[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTFByMUR0Y2xXcXN1NC1SVmZiV3IyUW42Vmp3eDJQTFZFc0tTc05TWGpJWFQ1TldMSkphcnJ6bTd3WTJBV2hxUklNa1lxSTFBcFE2bXNYZllkTUdWY2U2OHRjTEh0MlFPU0libkVnRDZ4djk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Nov 2023 08:00:00 GMT",
        "title": "Ethereum won’t flip Bitcoin anytime soon, but Ordinals could change that - Blockworks",
        "content": "Bitcoin block space looks set to be the hottest commodity in crypto.\n\nBitcoin once again occupies more than half the entire crypto market, having outperformed ether by nearly double so far in 2023. Now, the long-prophesied “flippening” of ether over bitcoin is even further in the future.\n\nThe market currently values Bitcoin three times higher than Ethereum. Bitcoin’s market cap, at $727 billion, has swelled by $400 billion in 2023 — a figure bigger than Mastercard’s entire stock valuation and about twice that of Netflix’s.\n\nEthereum’s valuation has grown by $100 billion, jumping from under $145 billion in January to nearly $245 billion today.\n\nSome anticipate that Ethereum’s market cap will one day eclipse Bitcoin’s, despite the latter’s half-decade head start.\n\nThings were looking good coming out of the 2019 bear market and into 2021’s explosive bull cycle. DeFi summer and NFT mania boosted interest in Ethereum, at times driving up fees for certain actions beyond $250.\n\nBitcoin‘s market value was 925% of Ethereum’s — $130 billion to $14 billion — at the end of 2019 (bottom of the bear market).\n\nThat figure had shrunk to under 200% by the end of 2021 (peak bull market).\n\nBitcoin’s market value is now 300% of Ethereum’s.\n\nThe Bitcoin rally has widened the gap\n\nThe case for flippening has recently taken a hit by a different flip: The Bitcoin network now rakes in more fees than Ethereum for the first time since December 2020.\n\nOver the past four days, Bitcoin users have paid miners about $40 million to have their transactions processed.\n\nEthereum users, meanwhile, forked out less than $27 million ether (most of those fees have been burned, slightly reducing Ethereum’s overall supply).\n\nLayer-2 Ethereum networks Arbitrum and Optimism haven’t bridged that gap as they each generate less than $200,000 in fees per day right now.\n\nThe fee-flippening (flee-pening?) is awkward when you consider the sheer amount of use cases supported by Ethereum. Decentralized exchanges, DAOs, memecoins, NFTs, stablecoins, DeFi and GameFi all run atop Ethereum.\n\nRead more: Ethereum’s Justin Drake is unconcerned despite ether’s middling year pricewise: Q&A\n\nBitcoin, on the other hand, had for the longest time mostly had one application — bitcoin transactions. But the rate of on-chain transactions had until recently sustained very little growth since 2015. Perhaps due to its “digital gold” narrative and the rising ubiquity of alternative cryptocurrencies.\n\nOver the past five years, Ethereum users have paid $17 billion in fees, Bitcoin users just $2.9 billion\n\nAll that changed with Ordinals — a protocol for inscribing individual units of bitcoin (BTC) with unique data to create digital collectibles, first launched in January.\n\nMusic, text, art, video and even code for browser-based DOOM clones have since been inscribed to Bitcoin, resulting in an on-chain collectibles market worth thousands of BTC. Bitcoin users trade Ordinals as Ethereum or Solana users would trade NFTs.\n\nToday, anywhere from around a third to one half of Bitcoin transactions contain Ordinals, driving up demand for blockspace as well as transaction fees. At times today, “medium priority” transactions went for around $11 compared to around $2.30 for the same on Ethereum (more priority generally means faster processing), although those prices have since come down.\n\nTron comes in third overall for monthly fees, mostly thanks to stablecoin Tether\n\nSo is Bitcoin netting more fees than Ethereum good for Bitcoin? Maybe not.\n\nSome Bitcoin insiders worry the network isn’t properly equipped to handle Ordinals and potential influxes of interest in its original use case, BTC payments.\n\nThe CryptoKitties incident in December 2017 — during which a NFT game grew so popular that it spectacularly clogged Ethereum — first showed that Ethereum probably couldn’t handle serving as the “World Computer” just yet.\n\nThen, the 2021 bull market saw NFT mint costs soar to $250 at times — a reminder of how necessary it was to port activity to smaller chains, including rollups. Still, memecoins and low quality token projects ratcheted up fees beyond $20 earlier this year, drastically reducing Ethereum’s usefulness for non-critical tasks.\n\nThe NFT craze of 2021 made Ethereum block space the hottest commodity in crypto. Even while tanking its utility.\n\nOrdinals may end up having the same effect on Bitcoin, especially if demand keeps up and the bull market truly hits.\n\nAt that point, it would seem reasonable to value Bitcoin and Ethereum more similarly. It might just take another run.\n\nUpdated Nov. 16, 2023 at 4:25 pm ET: Corrected reference to percentages in bullet points.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiaEFVX3lxTFBHeDJkdXFhTnFua2ZFMmNrcFp6dldvai1SYUlBTzNIcUg1MFk2YlFrSXdvNE40S1Npb2tBeEhlTWRQWGt0NTFYcTdTQWhzQW1zWmtQbGVxbm4ybjgtME9iRmZEQnRnanBt?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Nov 2023 08:00:00 GMT",
        "title": "What Is Validium in Ethereum? A Beginner’s Guide - Unchained",
        "content": "Validium is an innovative addition to the suite of scaling solutions helping to solve Ethereum’s scalability challenges.\n\nValidium is a protocol that was introduced to improve scalability issues on the Ethereum network. In this guide, we look at what Validium is, how it works, and its benefits and challenges.\n\nWhat Is Validium?\n\nValidium is a Layer 2 (L2) scaling solution that leverages zero-knowledge proofs (zk-proofs) to verify off-chain transactions. Its primary goal is to enhance the scalability, privacy, and security of the Ethereum network.\n\nAt the solution’s core are sidechains or L2 solutions linked to but handling transactions separately from the Ethereum main chain. In this way, they move transactions off-chain and help ease transactional pressure on the Ethereum network.\n\nConsequently, users can enjoy faster confirmation times while moving more volumes. Furthermore, Validium significantly reduces gas fees due to the reduced computational overhead, as it doesn’t need to verify every transaction individually.\n\nHow Does Validium Work?\n\nValidium bundles sidechain transactions into batches and generates zk-proofs for each batch. Zk-proofs ensure the validity of the transactions and that the off-chain chain has been updated correctly.\n\nEvery sidechain has a validator responsible for aggregating transactions and generating zk-proofs, which are then submitted to the Ethereum mainnet for verification.\n\nIf the proof is valid, the verifiers update the mainnet record to reflect the changes that occurred in the sidechain.\n\nUse Cases and Applications of Validium in Ethereum\n\nValidium has several potential use cases and applications within the Ethereum ecosystem.\n\nDecentralized Finance (DeFi)\n\nDeFi protocols can use Validium to improve their efficiency and usability. For example, they can adopt the technology to create faster DeFi investment platforms with lower gas fees. This efficiency broadens the platform’s accessibility and enhances the user experience.\n\nGaming and NFTs\n\nValidium solutions can facilitate seamless in-game transactions and interactions with NFT marketplaces due to their low fees and faster confirmation times. This provides gamers and collectors with more enjoyable experiences.\n\nSupply Chain Management\n\nThrough Validium, manufacturers can set up more efficient and transparent supply chain management systems. They can track their consignments off-chain easily and cost-efficiently without overloading the blockchain with data.\n\nKey Benefits of Validium in Ethereum\n\nLet’s take a look at some of the key benefits Validium brings to Ethereum.\n\nEnhanced Scalability\n\nValidium can process thousands of transactions per second (tps), compared to the Ethereum mainnet’s 15-25 tps. This feature makes it ideal for high-throughput applications like decentralized exchanges and gaming platforms. Increased throughputs are crucial to Ethereum adoption as they guarantee timely transactions.\n\nPrivacy and Security\n\nValidium uses zk-proofs to verify transactions by allowing one party to prove to another party that they know something without revealing what the thing they know is. As such, zk-proofs provide an elevated level of security for transactions, ensuring that validators cannot cheat or steal user funds. Additionally, Validium improves privacy by excluding sensitive user data from the public Ethereum blockchain.\n\nLower Transaction Fees\n\nReduced computational overhead makes Validium settlements significantly cheaper than mainnet ones. This is a major benefit for users, making Ethereum more affordable.\n\nFaster Transaction Speeds\n\nDue to its off-chain processing, Validium operations are much faster than those on the mainnet. This is important for applications that require fast and reliable transactions, such as decentralized exchanges and gaming platforms.\n\nChallenges and Limitations of Validium\n\nDespite its benefits, Validium also has some challenges and limitations.\n\nCentralization of the Network\n\nUsers must trust the validator to process transactions correctly. This could lead to centralization concerns, as few validators could control a sizable portion of the network. Introducing a trusted third party contradicts the decentralization philosophy of cryptocurrencies.\n\nInteroperability and Compatibility\n\nIntegrating Validium with existing Ethereum smart contracts and protocols can be challenging due to potential data structure incompatibilities. Ethereum developers are working on ways to ensure seamless interaction between the mainnet and its sidechains.\n\nDependence on Data Providers\n\nThe technology relies on data providers to make off-chain data available. This dependence on them introduces an element of trust that runs counter to decentralization, a central tenet of cryptocurrencies.\n\nHaving external data providers also puts the data processed on the network at risk of hacking or unauthorized access by malicious parties.\n\nConclusion\n\nValidium is important in Ethereum’s journey toward scalability. Its ability to significantly improve transaction speeds, lower costs, and streamline operations is poised to redefine the network’s experience, with many developers seeking to integrate it into their products."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxNS2FVb1RUOV9OZzkwbUtxOW95YUJkMFU3VUpfaVRFaHlKejhuZkhCY1FCZnI0a1ZIZ1o2WnN4S0xwUDc5LUJiQzREek5jNVlaVlhCcEZvY1NoT25mTXpUMXpiZ1lkeU1yS2tXY2I1NF9pUmlJR000U2VpSHU2dGNaNWlSZXpTMVE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Nov 2023 08:00:00 GMT",
        "title": "Former advisor Steven Nerayoff hypes Ethereum scandal exposé - Protos",
        "content": "Ethereum whistleblowers Steven Nerayoff and TruthLabs have alleged numerous incidents of misconduct by early Ethereum insiders, with Nerayoff currently teasing the release of apparently never-before-heard audio recordings of Vitalik Buterin.\n\nNerayoff is promising to reveal scandalous evidence that he believes proves that Buterin copied his idea of issuing utility tokens via ICOs. He is also threatening to sue over his supposed invention.\n\nOf course, fraud by third-party creators who simply used the Ethereum platform to create scam tokens or NFTs is nothing new. Many Ethereum ICO fundraisers during the 2017-2018 craze turned out to be doomed. Indeed, most ICOs have fallen to near-$0.\n\nSimilarly, most NFTs are now worthless. Ethereum insiders, however, are not responsible for those scams.\n\nWhat is new, however, is the fact that Steven Nerayoff and an unrelated researcher, TruthLabs, have both alleged misconduct by Ethereum founders and their allies and want to release the supposedly irrefutable evidence.\n\nRead more: These six-figure NFTs are down 99%\n\nSteven Nerayoff: Baffling yet impossible to ignore\n\nNerayoff makes sweeping claims that are often difficult to understand, yet he does speak with some authority. He was a former legal advisor to the Ethereum Foundation. He claims that Vitalik Buterin once lived with him in New York and worked in an office that Nerayoff rented for the benefit of Ethereum.\n\nSome observers used to dismiss most of Nerayoff’s claims due to his personal credibility taking a hit when the US Department of Justice (DoJ) charged him with criminal extortion in 2019. However, a New York judge dismissed that charge in May 2023, cleaning up his reputation considerably.\n\nAlthough Nerayoff has posted his recent, Ethereum-related claims to X, he says his legal team is working on organizing all the documents involved to substantiate his new claims. Curiously, he claims to have created a non-X platform to ostensibly ensure that the information he publishes will not be censored.\n\nOn November 14, he promised to publish specific allegations against Ethereum insiders “within 48 hours, hopefully less.” There have, however, been delays, with Nerayoff claiming that logistics and the creation of NFTs were responsible for most of the hold-ups.\n\nShould be within 48 hours hopefully less. Logistics, setting up Smart NFTs, etc. — Steven Nerayoff (@StevenNerayoff) November 14, 2023\n\nDid Vitalik Buterin ask Nerayoff to rescue the Ethereum Foundation?\n\nNerayoff claims that one of his upcoming NFTs will include a 2015 recording of Vitalik Buterin asking Nerayoff for a “rescue plan” for the Ethereum Foundation.\n\nA transcript of Nerayoff’s appearance on one of Mario Nawfal’s “Twitter Spaces” indicates that the NFT will include audio asking Nerayoff to help restructure the Ethereum Foundation.\n\nGreat thread @CoinpediaNews . The NFT isn’t about fraud it’s a recording of a rescue plan to save Ethereum Vitalik asked me to create in 2015. It’s a rare unedited historical view into what was really happening & crucial decisions made or not made which shaped much of crypto. https://t.co/4paTF5fseI — Steven Nerayoff (@StevenNerayoff) November 14, 2023\n\nThis continues Nerayoff’s pattern of claiming he created many of the standards that made Ethereum successful, including the ‘fungible’ tokens behind ICOs. The ERC-20 standard originally described the most commonly used API for Ethereum-based fungible tokens. The document doesn’t list Nerayoff as a contributor unless he was going by a pseudonym.\n\nDid Vitalik invent anything? No he did not. Ethereum never scaled bc of him. Only killer app was issuing Utility Tokens on ICOs both of which I invented. Vitalik & Lubin sabotaged crypto. Their focus was merely to issue hundreds or thousands of fraudulent ICOs fleecing people. — Steven Nerayoff (@StevenNerayoff) November 14, 2023\n\nNerayoff and TruthLabs question Ethereum’s The DAO\n\nTruthLabs supposedly found evidence that the Ethereum Foundation and Slock.it were behind the infamous hack of The DAO that precipitated the hard fork between Ethereum (ETH) and Ethereum Classic (ETC).\n\nNothing would surprise me but seems more likely others will flip on them. Now let me see, was the DAO an inside job? Oh there are too many to even count. They have a whole industry of people who could turn on them. Frankly I refused to cooperate at all but that’s me most would. — Steven Nerayoff (@StevenNerayoff) November 16, 2023\n\nRead more: Ethereum centralization is becoming a serious problem\n\nAccording to Nerayoff, the DAO hack was an inside job. Publicly, Slock.it was hit hard, and eventually sold to Blockchains.com in 2019. Blockchains.com rebranded Slock.it to BC Development Labs.\n\nSo, what did the Securities and Exchange Commission (SEC) say about The DAO? According to Commissioners, The DAO insiders sold DAO tokens as unregistered securities. However, the SEC declined to file charges in that particular case.\n\nNerayoff and TruthLabs also call out ex-SEC Director Bill Hinman\n\nBy now, it is no secret that former SEC chief William Hinman likely had an Ethereum-related conflict of interest while working for the SEC. Protos has previously covered Hinman’s financial conflict of interest and its potential impact on the SEC v. Ripple case.\n\nBill Hinman routinely met Simpson Thacher & Bartlett employees, which received funding from a pro-Ethereum entity, including an employee who worked for its Hong Kong division. Hinman also did not divest from his financial interest in the Simpson Thacher, which had done work for the Ethereum Foundation, despite being warned to by the SEC’s ethics office.\n\nAfter the Empower emails, I said a 🙊 could prove Hinman violated the criminal financial conflict laws. You can be found violating 18 USC 208 if you allow even only an appearance of impropriety w/o being told you’re violating the law. Here, he was told multiple times but did it. — John E Deaton (@JohnEDeaton1) June 13, 2023\n\nHowever, according to Nerayoff, the corruption among government officials might go far beyond just William Hinman’s opining that ETH offers were not securities transactions.\n\nA transcript of a Mario Nawfal X audio space reveals that Nerayoff believes the SEC, DoJ, and FBI fabricated charges against him. “They were looking to get as many people in this industry as possible. And that all started at the very same time,” he said. He also implied that Hinman was in on the Ethereum inside job.\n\nSome individuals were skeptical. However, attorney Michael Scotto opined that Nerayoff “has a case.”\n\nYes @StevenNerayoff has a case. IT EXISTS. We will be releasing all his filings in the near future. As his attorney I just wish he would stop talking until then, but he is very eager to share his experience. Although I won’t go into details I will say everything he has said is… https://t.co/cKQuuzgxP9 — michael scotto (@mascotto89) October 28, 2023\n\nNerayoff acknowledged that his lawyers advised him not to post about it in a lengthy X post. However, he says he cares more about holding people accountable than the money he allegedly lost.\n\nMistakes in Gary Gensler’s MIT course?\n\nPrior to becoming chairman of the SEC, Gary Gensler taught a course about blockchain at MIT.\n\nTruthLabs has questioned why Gensler used this class to spread, in TruthLabs’ opinion, false information about Ethereum’s history. According to TruthLabs, his allegedly false teaching material included Gensler’s claim that Canadian VCs mostly supported Ethereum during its pre-ICO days. Rather than Canadian money, as Protos has covered, Ethereum’s extensive ties to Chinese money. If deflecting attention from China to Canada was intentional, TruthLabs posits that William Hinman might not be the only SEC official with an interest in misrepresenting Ethereum’s financial ties.\n\nWhy is Gary Gensler teaching a false history on Ethereum's ICO in his MIT class?\n\n\n\nIn this 🧵, I will show you that it was the CCP that invested in Ethereum in its pre-ICO days, and not Canadian VC's like Gary teaches. pic.twitter.com/xfGtlux85C — TruthLabs 🫡 (@BoringSleuth) April 19, 2023\n\nOther claims made in Gensler’s lecture on Ethereum included the idea that Joseph Lubin bought 10% of the ICO. Lubin disagrees with this percentage, claiming he never owned more than half a percent of Ethereum’s supply.\n\nNerayoff called Lubin out on this, citing a video in which Lubin said buying large quantities of tokens, or buying them to speculate, could become a sign that the token is a security.\n\nLubin is saying if you buy tokens in large quantities or to speculate it’s a security. Gensler on video said Lubin was a VC who bought Ether in large quantities to speculate.\n\n\n\nSo, Ether is a security according to Lubin & Gensler due to Lubin’s actions.\n\n\n\nWanna brag some more Joe?… https://t.co/BFLi3ZRmPv — Steven Nerayoff (@StevenNerayoff) November 12, 2023\n\nRead more: Here’s why ‘news’ attacking Gary Gensler is all over crypto media\n\nRevisiting Ethereum’s ties to China\n\nAnyway, TruthLabs claims that Chinese entities Wanxiang Blockchain Labs and Fenbushi Capital were involved in setting up some of Lubin’s Ethereum wallets.\n\nProtos has previously covered Ethereum’s extensive ties to Chinese money.\n\nTruthLabs also found evidence that Wanxiang Blockchain Labs set the Ethereum Foundation wallet up. Wanxiang’s Dr. Xiao Feng went on record about its early support for Ethereum, pledging $500,000 to help launch it.\n\nGary Gensler teached to the public that Joseph Lubin bought 10% of the ICO for himself. Whats his source? Lubin claims he never even owned half a percent of Ethereums supply. So whats up with this 10%? And did he know about how Lubin called to disguise all major investors? pic.twitter.com/zpYgnOaWNP — Mr. Huber🔥🦅🔥 (@Leerzeit) April 19, 2023\n\nTruthLabs also notes a coincidence that Wanxiang Group and MIT announced a ‘partnership’ in March 2018. TruthLabs notes that it is possible that Chinese government-connected individuals could have used proxy or puppet entities to exert influence over Ethereum.\n\nLaura Shin’s book, The Cryptopians, detailed allegations that Vitalik Buterin tolerated an out-of-place Chinese national named Ming Chan, who served as the Ethereum Foundation’s executive director, for a curious span of time — even after she clashed with other foundation members.\n\nInterestingly, Chan assumed that role in 2015 — the same year that Nerayoff alleges Buterin asked him about restructuring or saving the Ethereum Foundation.\n\nEthereum also famously published its whitepaper first in two languages: English initially, and then Chinese.\n\nFinally, and somewhat off-topic, Nerayoff makes yet another assertion: Vitalik Buterin could have shorted Ethereum at some point.\n\nAwaiting evidence from Steven Nerayoff, TruthLabs\n\nIn summary, Nerayoff and TruthLabs’ allegations are seemingly impossible to ignore. However, it’s important to remember that they are just that: allegations.\n\nNerayoff claims to be releasing another round of evidence today or tomorrow and intends to fight for his intellectual property rights in court.\n\nEthereum initially wanted to build a decentralized digital asset ecosystem. Much of its initial marketing billed it as a “world computer” that could be used for blockchain applications like smart contracts. However, since inception, Ethereum has maintained strong ties to Chinese executives with curious motivations.\n\nBoth Nerayoff and TruthLabs claim to be interested in publicizing their version of the truth about Ethereum’s origins and initial motivations. Many observers have been and will continue to await their allegedly irrefutable evidence.\n\nGot a tip? Send us an email or ProtonMail. For more informed news, follow us on X, Instagram, Bluesky, and Google News, or subscribe to our YouTube channel."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxQRXkzTmpHV2s3eFM2RjVPMzRPakl3cG5nVkZodmJaQ05QYmJVX1BBVFRmZ0FEQjJjR3ZWcnBINFltek9VaUktUFJCRzlNWFhsX3lwZUF6WTZJb3dvTnFlLUxQUFMtUWIzYTRnTU1wYWdlNUFxc0h5dVB1Nk91OTFZYkZNejQ2N0dURHN0WEU0WXdZV2Y4MDl4UlVBMC1TSUZoMkFBSW93LWsxUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "Nocturne Launches on Mainnet to Bring Private Accounts to Ethereum - CryptoSlate",
        "content": "Chainwire Nocturne Launches on Mainnet to Bring Private Accounts to Ethereum Chainwire · · 3 min read\n\nDisclaimer: This is a sponsored press release. Readers should conduct their own research prior to taking any actions related to the content mentioned in this article. Learn more ›\n\nNEW YORK, United States, November 15th, 2023, Chainwire – Nocturne, a protocol enabling on-chain private accounts, today announced the successful deployment of Nocturne v1 to Ethereum mainnet. This marks a significant milestone in the journey towards a more private and accessible Ethereum. For the first time, users will have a compatible and easy-to-use product resembling a private onchain account.\n\nNocturne v1 is a step towards compatible onchain privacy that functions simply as another account rather than a distinct tool or ecosystem. Users will find transacting with Nocturne similar to using a smart contract wallet, with the added benefit of privacy. Nocturne v1 is currently out-of-the-box compatible with any DeFi protocol that represents state via output tokens (e.g. Uniswap swap tokens, Aave aTokens, Compound cTokens, etc). There are plans to later extend this compatibility to arbitrary protocols.\n\n“With Nocturne v1’s launch, we’re moving away from the notion of a ‘privacy tool.’ Privacy should be embedded at the account layer and the v1 launch is the first step in making this possible,” said Luke Tchang, CEO and co-founder of Nocturne. “Our goal is to ensure that everyone, from individual users to large institutions, can transact securely without exposing their financial history to the world. This is more than a product; it’s a commitment to making Etherereum more accessible and enabling secure and private money over the internet.”\n\nNocturne is built on the belief that privacy on public blockchains will only become mainstream if it’s seamlessly integrated with the existing user experience. Nocturne’s objective is straightforward: to create private user accounts on L1/L2 that are fully compatible with existing Ethereum accounts. To read more about private accounts, please see Nocturne’s recent blog post.\n\nPrivacy: The Keystone for Ethereum’s Growth\n\nThough DeFi and other onchain activities have surged in popularity, privacy concerns have prevented broader acceptance and use of crypto as money. Recognizing that the typical user may be uneasy with the idea of their financial dealings being public, and that institutions demand confidentiality for their transactions, Nocturne addresses these critical barriers head-on. Privacy isn’t just a feature—it’s foundational to the broader adoption of crypto.\n\nNocturne’s Future Vision\n\nAs they continue building new versions, Nocturne’s long-term vision is to make the experience so seamless that by default, every Ethereum user automatically has a private account which mirrors their public account. In short, a seamless parallel account layer for privacy.\n\nNocturne’s plans for achieving its longer-term vision include:\n\nTransition to a more permissionless protocol by migrating to proof of innocence, as described by Vitalik and Ameen Solemani in the Practical Privacy & Compliance paper.\n\nBring Nocturne accounts closer to usable as general wallets by extending Nocturne’s protocol compatibility to arbitrary smart contracts.\n\nImprove the compatibility of Nocturne accounts with EOAs and smart accounts through a scheme that allows for public wallet authorization to be leveraged within Nocturne for security.\n\nHow To Access\n\nNocturne v1 is live and can be accessed through a dedicated private vault UI, allowing users to discreetly manage their assets. The current UI capabilities include deposits, transfers to new burner addresses, and private swaps and staking. To get started, visit app.nocturne.xyz.\n\nAbout Nocturne Labs\n\nNocturne Labs is a forward-thinking blockchain technology company committed to addressing the most critical privacy and user experience challenges within the Ethereum ecosystem. With a pioneering protocol for private accounts, Nocturne enables users to transact safely with built-in privacy. This marks a substantial stride in advancing the usability of public blockchains. Backed by notable investors such as Bain Capital Crypto, Polychain Capital, Bankless, and Vitalik, Nocturne is led by a team of experienced developers dedicated to enabling a more secure and accessible Ethereum. For more information, visit https://nocturnelabs.xyz/.\n\nContact\n\nPR Manager\n\nKayla Gill\n\nSerotonin\n\n[email protected]\n\nShare"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiZEFVX3lxTE4wbkpuWG5INW9YWXNXOU15U3JlNGRNT0tqNDRrdjJKRHRPbjRaZS1DOVJwblBydENpS1V1bzZDQ2VkQlVlYlNOZlVFZ1p0VHlqcWRubzJ2YmRHQjBnYmJQZ0lqekI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Nov 2023 08:00:00 GMT",
        "title": "What is Plasma and why is Vitalik Buterin into it all over again? - Blockworks",
        "content": "Ethereum co-founder Vitalik Buterin wants to bring back Plasma as a blockchain scaling solution that could sidestep existing data availability concerns.\n\nFirst created in 2017, Plasma networks can be considered “child” chains of the Ethereum mainnet. These execute transactions away from Ethereum using their own block-validation mechanisms, then periodically post final states back to mainnet.\n\nPlasma chains differ from popular scaling solutions such as Arbitrum or Optimism, which instead post computed data back to Ethereum mainnet, although it is compressed.\n\nIn the blockchain world, data tied to computational tasks — such as processing transactions — must be stored somewhere. When stored on-chain this process is often costly and time-consuming for network participants, particularly validators and other node operators.\n\nFull nodes on Ethereum mainnet — and there are roughly 11,000 of them active worldwide — download all the data of each block so that network participants can verify it. This redundancy make it difficult for invalid transactions to be mistakenly executed.\n\nAlthough great for security, the consensus process hinders scalability as it is inefficient and reduces throughput.\n\nWith Plasma, all data processing and computational tasks are kept off Ethereum mainnet — only final verified states are posted to the chain — and thus less data takes up Ethereum block space.\n\nThe problem with Plasma\n\nAccording to Buterin, Plasma was not considered by the current batch of roll-up solutions for its overwhelming costs around client-side data storage and its application limits. This made it difficult to build Plasma-powered apps which did more than simple payments.\n\nIn his recent blog post, Buterin discussed a previous Plasma implementation known as Plasma Cash. This system sees each individual coin as its own non-fungible token (NFT) with a unique history.\n\nOperators on Plasma chains create new blocks in the form of a root of a Merkle tree. This means that every time there is a transaction, the owner of that transaction can be found by stepping through the tree.\n\nIf an operator chooses to misbehave by publishing an invalid or unavailable block, the owner of that transaction will have seven days to cancel by showing that they are either not the latest owner, that there is a double spend, or that there is an invalid history. This can make for a clunky process in the real-world, Buterin explained.\n\n“If you receive 0.001 ETH each from hundreds of people who are buying coffees from you, you are going to have 0.001 ETH in many places in the tree, and so actually exiting that ETH would still require submitting many separate exits, making the gas fees prohibitive,” Buterin wrote.\n\nDefragmentation protocols do exist, Buterin said, but they are difficult to implement in practice. Further, it is difficult to apply the Plasma design to a generalized Ethereum virtual machine (EVM) as the design requires specific owners to object to false transactions.\n\nMany DeFi protocols on-chain, for example, do not have unique or individual owners, meaning that complex applications would not be able to work on Plasma.\n\nEnter zk-SNARKS\n\nButerin noted that concerns around Plasma can be resolved with the introduction of zk-SNARKS and validity proofs.\n\nZk-SNARKS, short for “zero-knowledge succinct non-interactive argument of knowledge,” enables blockchains to prove that information is accurate without revealing the contents of the information itself.\n\nSNARKS are the proof system, and validity proofs are cryptographic proofs which attest that the information is indeed accurate.\n\n“The largest challenge of making Plasma work for payments, client-side data storage, can be efficiently addressed with validity proofs. Additionally, validity proofs provide a wide array of tools that allow us to make a Plasma-like chain that runs an EVM,” Buterin wrote.\n\nValidity proofs will be able to prove that each Plasma block that is on the blockchain is valid — meaning that it will no longer be necessary to worry about who the last owner of each individual transaction on a Merkle tree is.\n\n“In a validity-proven Plasma chain, such withdrawals would not be subject to any challenges at all. This means that, in the normal case, withdrawals can be instant,” Buterin wrote.\n\nConsiderations\n\nAlthough zk-SNARKs and validity proofs can address significant problems with the previous Plasma design, Buterin reasoned, there are still limitations.\n\nThis is most clearly highlighted when a particular state object, such as a token, does not have a clear economic owner.\n\nButerin drew on the example of Uniswap liquidity provider positions: “If you traded USDC for ETH in a Uniswap position, you could try to withdraw your pre-trade USDC and your post-trade ETH. If you collude with the Plasma chain operator, the liquidity providers and other users would not have access to the post-trade state, so they would not be able to withdraw their post-trade USDC.”\n\nThis shows that although Plasma potentially offers useful solutions, there may still be concerns about bad actors, which should be addressed.\n\nDespite this, Buterin believes that Plasma remains an underrated design in the blockchain technology space and could help ease Ethereum transaction fees.\n\n“Rollups remain the gold standard, and have security properties that cannot be matched. This is particularly true from the developer experience perspective: nothing can match the simplicity of an application developer not even having to think about ownership graphs and incentive flows within their application,” Buterin said.\n\n“However, Plasma lets us completely sidestep the data availability question, greatly reducing transaction fees. Plasma can be a significant security upgrade for chains that would otherwise be validiums.”\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxPallKU2RvTXBJcUJrR3pTT3VjZTRsaEhmbC1jUHN6WGM1QllJbEdhdHU4WmpvMGZnal9aTWIwbDlFbWg3cXIyQlctVzEzclVSbWlkQmJsQVZjX2pJMks3YnRiaHBKS29kMy10YWRNRjJOTzBINThiREdHT1dlbHZBcDhsREN4dkF1WE9PNUk0cmN1V0FlS19Keno4RFc5bVhhVERFZnFVM1c1emlnMnJJU3NwRjjSAboBQVVfeXFMTWtpOVZGa01yTXVBQlV5YmJPVUVHYWVPNnVVTWtHOFRveTRNQV91TjVsMEI1Q1hObTFjeGNWVjVta1VsYjV6UGdMbHVHQUE4dmVrbU1oOEExN2huNmZja2N4QmpzUmFIRXFYRUQyMGk2bklIRU45RGlxMm1RR0Z4bnZtZVVqamZQRnhPRkU3QXNfSG53NC1SNW1CMjd4czg1N2JrV21ORVlkYUhiUXhUaF9hWVR1Q0M4eHJB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "Solana surges amid altcoin rally, nearly triples its price over the past month - CNBC",
        "content": "The price of the Solana token jumped Wednesday amid an ongoing rally in altcoins and bullish remarks on the token from famed tech investor Cathie Wood.\n\nSolana was last higher by nearly 18% at $65.65. It has nearly tripled in price in the past month.\n\nThe spike comes a day after Ark Invest CEO Cathie Wood applauded its performance this year on CNBC.\n\n\"Solana is doing a really good job,\" she told CNBC's \"Squawk Box\" on Tuesday. \"Ether was faster and cheaper than bitcoin [back] in the day – that's how we got ether. Solana is even faster and [more] cost-effective than ether.\"\n\nWood went on to say on CNBC Pro Talks that she \"really does like Solana\" while also noting that its downtime – the time the network is down, under maintenance, or suffering an outage – \"is much higher than it is for Ethereum.\"\n\n\"People are willing to put up with that because maybe the transaction sizes are not as large or for some reason are not as important, they just want speed and cost as their top priority,\" Wood told CNBC PRO. \"Each one of [the networks] is going to have a place.\"\n\nSolana, the sixth largest crypto token by market cap, according to CoinGecko, became the darling of the crypto world in the 2021 bull market as it sold investors a vision of something like Ethereum, but without the slow and expensive transactions.\n\nActivity on Solana has been growing all year, particularly in liquid staking protocols like Jito, according to data provider Kaiko. The token has topped the list of the most traded altcoins on US-available exchanges this year, outpacing dogecoin , litecoin , Polygon's MATIC and Ripple's XRP .\n\nMore recently, the token is following a broader crypto market rally led by bitcoin, that began Oct. 24, when the coin doubled for the year and topped $35,000 for first time since May 2022. Shortly, after ether followed, rising to the key psychological level of $2,000. Historically, the altcoin rally tends to follow ether.\n\n\"After Oct. 24 bitcoin started losing its momentum, which during bitcoin bull markets causes traders to go down the risk curve and switch to alts as a way of chasing huge profits,\" said Mikołaj Zakrzowski, an analyst at data provider CryptoQuant.\n\nThis time a year ago, the coin was facing a crucible moment after the FTX blowup sent it down 70% over two days and briefly traded under $10. FTX and its now-fallen leader Sam Bankman-Fried were widely credited with providing substantial money and resources behind the Solana project to get it off the ground.\n\nSolana is up about 550% this year and has been one of the best performing cryptocurrencies of 2023. By comparison, bitcoin and ether have gained about 127% and 70%, respectively."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE43bVVMdGlRX05CZUlteHpBWHhSdDdrYTJyZ05RSmtfLUJQelJpZzh5dzJxX25lTVlERDRuRXdUbU5DTVV2NzRsVUcxcmNUXzNNbjdkaVBnTzFtVHB4VnJWQU9tSU9HQjU4RG5GRk44bm5DcHhlcWIta2UydXF1X2M?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "Ethereum’s blue chip DeFi tokens poised for growth - CryptoSlate",
        "content": "What is CryptoSlate Alpha? A web3 membership designed to empower you with cutting-edge insights and knowledge, powered by Access Protocol. Learn more ›\n\nConnected to Alpha Welcome! 👋 You are connected to CryptoSlate Alpha. To manage your wallet connection, click the button below.\n\nImportant: You must lock a minimum of 20,000 ACS If you don't have enough, buy ACS on the following exchanges: Coinbase Kucoin Orca\n\nConnect via Access Protocol Access Protocol is a web3 monetization paywall. When users stake ACS, they can access paywalled content. Sign up for Access ›\n\nDisclaimer: By choosing to lock your ACS tokens with CryptoSlate, you accept and recognize that you will be bound by the terms and conditions of your third-party digital wallet provider, as well as any applicable terms and conditions of the Access Foundation. CryptoSlate shall have no responsibility or liability with regard to the provision, access, use, locking, security, integrity, value, or legal status of your ACS Tokens or your digital wallet, including any losses associated with your ACS tokens. It is solely your responsibility to assume the risks associated with locking your ACS tokens with CryptoSlate. For more information, visit our terms page."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxPYnRkZWw5ckhTMWpBMnJqU25zOFJQLWhnQkNLU0FFakJvYXRhbmFsMGVaUUgxMVpEd2cwVGtMUUNVam9DUHdIYUV2MkJRZlJvbHdLcGxOYlhNTS00Sy03ODBNM2g2c29NaEllZFVYakRDcUN5ZE5NUFJReEt2TnZrVDBOemJQeTNvcy16MmxuM3PSAZgBQVVfeXFMTzA5VVN0Sl9paWtCM19rZlpDVUw0a0htZkpqYVRhLTJtUVZnZzVqYnZVVjdKUGc2eE4wQnZZZ2NYcE03bU1xa213UnUxeUJWLVgxVDdySTRRNTk1eTZ4VmUtVGdqMEpzQXVCTWJmVTdQdVZHU3VaY3Jod0dCZkpxeXRBMEJZQUVVV01fcmQ4aW5hbkVJVk5KcWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Nov 2023 08:00:00 GMT",
        "title": "How to Claim the Pyth Airdrop for Ethereum, Solana, Aptos Users - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nDecentralized finance (DeFi) oracles network Pyth will kick off an airdrop of roughly 255 million PYTH tokens to its users and community members beginning in just four days, the network announced Thursday.\n\nOver 90,000 wallets will be eligible to claim PYTH tokens through the airdrop once it opens on November 20 at 2:00 pm UTC, according to Pyth. Users of dapps that rely on Pyth network data across 27 blockchains—including Ethereum, Solana, Aptos, Polygon, Arbitrum, Avalanche, and Optimism—may be eligible for a token allocation, according to the network. Pyth Network Discord administrators and holders of Pyth NFTs are also likely to receive an allotment.\n\nThe Claim Process for the Pyth Network Retrospective Airdrop will open on Monday, Nov 20 at 2 PM UTC. Stay tuned for more details on instructions on how the Claim Process works. Additionally, the Claim Process will be available for 90 days. The Airdrop Claim Page will be active… — Pyth Network 🔮 (@PythNetwork) November 16, 2023\n\nAD\n\nAD\n\nAfter November 20, the airdrop will remain open until February 18. DeFi users can check their potential eligibility for the airdrop, as well as the amount of PYTH they are set to receive, at the network’s airdrop check page.\n\nPyth users in several countries, however, will be ineligible to participate by default, due to mitigating legal factors. Residents of the United States and the United Kingdom will not be able to claim PYTH tokens; nor will residents of North Korea, Ukraine, Cuba, Syria, Iran, Yemen, South Sudan, the Democratic Republic of the Congo, and eight other nations and territories.\n\nPyth’s native token will have an initial circulating supply of 1.5 billion, according to the network. 8.5 billion additional PYTH tokens will unlock between six and 42 months from launch.\n\nDeFi oracle networks like Pyth connect blockchains with data sources from the off-chain world, allowing DeFi smart contracts to execute based on inputs and outputs from real-world events and data. They can enable smart contracts, for example, to automatically order products when an inventory drops; to pay out agreements that hinge on the price of stocks and commodities; or to track carbon emissions and tax a company if a certain level is exceeded. Oracle networks are central to the growing integration of the crypto market and traditional financial markets, as well as the application of smart contracts to traditional businesses.\n\nAs intermediaries of information, oracle networks can also be exploited. Last fall, a hacker managed to drain $100 million from decentralized exchange Mango Markets by manipulating the oracle-reported price of the MNGO token.\n\nAD\n\nAD\n\nPyth is the fourth-largest such oracle network by total value secured, according to DeFi Llama; Pyth’s chief competitor, Chainlink, boasts over nine times the value secured, and a dominant 45% market share, compared with Pyth’s 4.83%.\n\nEdited by Stacy Elliott."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxOWEZXNkxnSzlFWUhxZFRoQS1wSW4tTkNVRUlwX3kyZTRCWVhzOGotd0FxamVPaFV6d1ZNOHhCTGUxMHlZaXRxRjVMMVA3NjVpN0R1QlFhTWlwZXZyTVZGTGlNMDE4X1NzY1VFNFBBT1NqekZHcDBNc2I2eS1iTzRsS2x5ZDNuUkl2b1dsSUotazEwRGF2YWZJckpyTFJwMk45?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Nov 2023 08:00:00 GMT",
        "title": "BlackRock Officially Submits Form S-1 With SEC for Ethereum ETF - Bitcoinsensus",
        "content": "BlackRock submitted an application for an Ethereum ETF to the United States Securities and Exchange Commission.\n\nThe objective of the iShares Ethereum Trust is to replicate the price performance of Ethereum.\n\nThis new development could also increase the chances of a Bitcoin spot ETF.\n\nBlackRock, the investment management giant, has taken a significant step forward in regard to crypto ETFs. On November 15, 2023, the company formally submitted its S-1 application for a spot Ethereum ETF, marking a pivotal moment in the listing process.\n\nClaim up to $30,030 in Bonus 100x Leverage Start Trading\n\nImpact on Ethereum Price\n\nDespite the anticipation surrounding this move, the effect on Ethereum’s price has been relatively subdued. As of the latest data from CoinMarketCap, Ethereum is trading at $2040, boasting a market capitalization exceeding $248 billion. The 7-day chart for ETH indicates a noteworthy uptrend of over 8 percent.\n\nBlackRock’s Ethereum Strategy\n\nBlackRock’s strategic move into the Ethereum space was unveiled recently when it filed for a spot ETH ETF named ‘iShares Ethereum Trust’ with the Delaware Department of State Division of Corporations. Nasdaq further fueled this development by filing a proposal for the listing and trading of shares associated with the spot Ethereum ETF. This announcement caused a surge in Ethereum’s value, breaching the $2100 level.\n\nThe SEC filing discloses that Coinbase Custody Trust will serve as the custodian for the spot ETH ETF. Additionally, the shares, set to be listed on the Nasdaq, will follow the CME CF Ether-Dollar Reference Rate.\n\nBlackRock’s Influence in the Market\n\nBlackRock’s influence in the ETF market is not a recent development. The investment management giant played a pioneering role by filing for a spot Bitcoin ETF earlier this year. This move triggered a domino effect, inspiring several other significant players in the ETF market to follow suit.\n\nFurthermore, BlackRock’s involvement has heightened the prospects of a spot Bitcoin ETF receiving approval. The progress and developments in BlackRock’s filings have correlated with notable fluctuations in Bitcoin’s price.\n\nUnleash the potential of leverage trading! Join Bybit today with our link, complete KYC, and earn up to a $40 bonus on a $100 deposit. Don’t miss out on this exclusive offer; claim your bonus now!\n\nClaim up to $30,030 in Bonus 100x Leverage Start Trading\n\nResponse to Fake Spot XRP ETF Filing\n\nThe market also witnessed BlackRock’s impact when a fraudulent spot XRP ETF filing emerged. Submitted to the Delaware Department of State Division of Corporations, this fake filing prompted a swift rise in XRP’s value, leading to the liquidation of over $7 million worth of futures positions.\n\nAlso Read: BlackRock Officially Files for a Spot Ethereum ETF\n\nSEC’s Role\n\nWhile BlackRock’s plans for altcoins remain uncertain, its influence on the crypto market is undeniable. The trajectory of these developments now rests in the hands of the US Securities and Exchange Commission (SEC).\n\nDuring Gary Gensler’s tenure as SEC chairman, Ethereum’s classification as a security or commodity remained unresolved. Gensler, in his previous role at MIT in 2018, indicated that the SEC did not label Ethereum a security due to its perceived decentralization. This viewpoint echoes sentiments expressed by former SEC Director of Corporate Finance, William Hinman, in June 2018.\n\nBlackRock’s effort towards crypto ETFs is helping the crypto market move in the right direction. However, the SEC is still quite active and there will be challenges before these ETFs become a reality.\n\nClaim up to $30,030 in Bonus 100x Leverage Start Trading\n\nEnhance Your Crypto Trading Skills With Our Legends’ Trading Masterclass\n\nEmpower your crypto trading skills with our Legends Masterclass. Sign up now and take advantage of our limited-time discount offer! Join the class today."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxOS0lWcUVGdjhnWmxOYVF3QUl0TlhENUZudjRtTGNrUllOeTk1d295YWw5UjFqdEwtc2lBR0VVUG53MVlhenVEXzVuLU9UTUE0Q3lNclFLT1pvMWJqRDQtU2hPS0NpRldPMGJhYVlQdml5Z19LVGVtNHBnYU96Wmh3bGx0bVRQemPSAYwBQVVfeXFMT2xKSmdqcUU5eGhZR253UUFmM0ZEZGVYZlpzOHE0ejdzd1VpLWpna2hpcE9zbWxUM1NCbHhNb1AyLXROS0pXU1lUWDdwTDRPQVd2ZlZXLWJRcDFMUlhEV1JackpfLTRYa1V0UFdTaG5raHhhVk1SajBFVUdvSjg4NEZSYTE4OHoxZjJxazI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "Is ETH About to Crash Below $2K? (Ethereum Price Analysis) - CryptoPotato",
        "content": "Technical Analysis\n\nBy GreatestTrader\n\nBuyers in the Ethereum market have recently driven the price into a strong uptrend, reaching a critical resistance level at $2K. However, encountering a significant hurdle around this crucial mark, there exists the potential for a temporary consolidation correction phase in the coming days.\n\nThe Daily Chart\n\nA thorough examination of the daily chart reveals substantial support around the crucial region, comprising the static support at $1,500 and the lower boundary of the wedge pattern. This support fueled a significant surge, indicating strong buying momentum, with buyers targeting the critical $2K resistance zone.\n\nDespite reaching this key level, aligned with the wedge’s upper boundary, Ethereum faced rejection, leading to a slight retracement towards the broken 200-day moving average at $1,783.\n\nConsidering the significance of the resistance at $2K and the associated wedge pattern’s upper boundary, a temporary continuation of the ongoing retracement followed by consolidation around the broken moving averages is highly likely. If the price completes a pullback to the broken moving averages, buyers may re-enter the market, aiming once again for the substantial $2K level.\n\n\n\nThe 4-Hour Chart\n\nOn the 4-hour chart, the intensified buying pressure around the $1,5K support region propelled Ethereum toward the substantial $2K resistance. This upward movement demonstrated significant bullish momentum, reflecting the buyers’ dominance in the market.\n\nHowever, the $2K region represents a crucial psychological resistance, posing challenges for buyers to push the price higher. Notably, a bearish divergence between the price and the RSI indicator suggested insufficient buying pressure, leading to a reversal and slight corrections.\n\nAdditionally, a recognizable double-top pattern around this pivotal resistance confirmed the presence of sellers in the short term.\n\nGiven the existing market dynamics, there is a high likelihood of an extended consolidation correction phase in the short term. This implies that the market might continue its retracement before definitively determining its next course of action. In this scenario, the support range between the 0.5 and 61.8 levels of the Fibonacci retracement ($1,839 – $1,769) is expected to be the next level of interest for Ethereum’s price.\n\n\n\nOn-chain Analysis\n\nBy GreatestTrader\n\nThe futures market has been a significant influencer of Ethereum’s price dynamics, making it imperative for the current uptrend to sustain favorable conditions in this market.\n\nIllustrated in the chart is the 30-day moving average of the Ethereum Taker Buy Sell ratio, a crucial metric for gauging sentiment in the futures market. During a period of substantial price increase in Ethereum, the taker buy-sell ratio exhibited a robust uptrend, signaling strong buying interest. However, a recent reversal in the metric’s trend has led to a downtrend, dipping below the threshold of 1. This reversal indicates that sellers are now executing more aggressive orders in the aggregate, potentially to realize profits or to take short positions.\n\nSignificantly, this shift in the metric aligns with the recent market rejection and its struggle to move higher. The confluence of these events suggests a potential for a short-term retracement in Ethereum’s price.\n\nShould the taker buy-sell ratio resume an upward trajectory, surpassing the 1 threshold, it would indicate a revival of bullish sentiment in the short term, potentially supporting the continuation of the uptrend. Conversely, a failure of the metric to exhibit upward movement would raise concerns about the sustainability of any bullish momentum."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMi9AFBVV95cUxNdGU1SXBvdXRzVmJzWktoOG5HNTlwa05WMVFHRU42clB6YXZiY0p0cllFOFZwUFF1X3hXS1ZnMmRYaTYzakx1djhtTTZ0NGRUZm1jblU4X25jekpjUml5ZVRiRXZPMzFnVUdmbnExcFlGa2R3eF91czJVV3h4a3llZTBaR3FKMjZUTVhYSEs0clZ6cTBZOWgtOEhlNVZfVDdqN3hpQWRBb2JsVVZpUU96N0Z6WG45TlF1MXhIazJacHRZcGZpWGZTaEZmV0Npemd2OEp3WS1ndzVpMmhwZ0RNUXhZdjl6MFVBbUdSR2o1TEFrdnVK0gH6AUFVX3lxTFBNdER4aHdINlBPSC11SXJmbkJVLXltYWVFTkh6RjhUVEhOQUxXLTdJNTdjejdtNFA0eE1TaVA5WGJNNnhKVUdSRkVkam9JWEs0YjUtVnpaUjY2X2djZlI1RzJYdnJiYWE0QVJ0U1ZaUFRvb25YejR5QW45S21NTUZ0T2ZYb3Q3ODZiWXF2elJyZ0hZTk02aGdKb0EwMzBySDFhdm1Jc0kxM2VKbWk3anFZTmFPZjlXbE55ZmFlbXVmN196dC1nbDBuTFE0T1NDenkzRWNiVDlPZ2NrbVJDZTNtOGlqRW1abl9fRmpvaXAtbkFiTDhnX1JZU2c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: BTC bulls take advantage of recent dip with $40,000 in sight - FXStreet",
        "content": "Bitcoin price could climb 7%, recouping the ground covered since the November 9 rejection from the $37,972 range high.\n\nEthereum price defends the $1,935 support level at all costs, with success likely to initiate a 10% rally to $2,200.\n\nRipple price shows weakness, breaks the triangle to the south as the 25-day EMA provides support at $0.6183.\n\nBitcoin (BTC) price is showing strength again after a stark correction on Tuesday that bruised the market. Ethereum (ETH) is following the trend set by the largest cryptocurrency by market capitalization. However, the same cannot be said for Ripple (XRP), at least not yet, as the remittance token's price is showing weakness.\n\nAlso Read: Bitcoin price drops, $90 million in open interest wiped out amid jitter over spot BTC ETF window closing\n\nBitcoin price pulls north as momentum restores\n\nBitcoin (BTC) price is pulling north, trying to recover all the ground lost in the recent crash that saw up to $90 million in open interest wiped out of the market. With the 25-day Exponential Moving Average (EMA) coming into play at $34,572, BTC is trying to reclaim territory above the critical resistance at $36,788.\n\nFor a confirmed move north, investors should watch for Bitcoin price to break and close above the $36,788 level. This will set the tone for BTC to target the $37,972 range high before reaching the $38,000 psychological level.\n\nIn a highly bullish case, Bitcoin price could extend its reach to tag the $40,000 psychological level, with such a move constituting a 10% climb above current levels.\n\nThe Relative Strength Index (RSI) is tipping north, suggesting momentum is rising, while the Awesome Oscillator (AO) holds in positive territory. This adds credence to the bullish thesis.\n\nBTC/USDT 1-day chart\n\nConversely, another rejection from the $36,788 resistance level could see Bitcoin price losing support due to the 25-day and 50-day EMAs at $34,572 and $32,456, respectively, before dipping into the supply zone turned bullish breaker where it could test the 100-day EMA at $30,528.\n\nAlso Read: Over $1 billion worth of BTC susceptible to be sold as Bitcoin price hints at short-term correction\n\nEthereum price holds above $1,935\n\nEthereum (ETH) price maintains above the $1,935 level, a crucial support that could spell doom for ETH if lost. With the RSI tipping north and the AO holding in the positive zone, ETH could scale north, restoring itself above the $2,029 support in order to ride the ascending trendline. This could ship the second-largest cryptocurrency by market capitalization to the $2,136 range high.\n\nETH/USDT 1-day chart\n\nHowever, if selling pressure increases, Ethereum price could slip below the $1,935 support. A decisive move below this level would confirm the downtrend, with ETH likely to test the 25-day or 50-day EMA at $1,892 and $1,806, respectively.\n\nIn a worse case, Ethereum price could tag the 100-day EMA at $1,763, with a break and close below it invalidating the bullish thesis under the $1,753 support level.\n\nAlso Read: Ethereum Price Prediction: Eighteen-months ascending triangle pattern appraises $4,000 target for ETH\n\nRipple price breaks the triangle\n\nRipple (XRP) price has shown weakness, breaking out of the triangle to the downside amid reducing volatility. Increased selling pressure could send XRP below the 25-day EMA at $0.6181. A break and close below the $0.5981 would lower optimism for a move north.\n\nXRP/USDT 1-day chart\n\nHowever, if buyer momentum increases, Ripple price could restore back above the lower trendline of the triangle above $0.6584, which would set the tone for a move to $0.7000.\n\nIn a highly bullish case, the gains could extend toward the Fair Value Gap (FVG) between $0.7519 to $0.7623, with Ripple price filling the inefficiency and restoring balance.\n\nAlso Read: XRP price could extend gains with Ripple’s likely win through $20 million settlement with SEC"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMibEFVX3lxTE4zS1ZpYURyWFI5MDVSWXFqejgzT2F5SjhTWUh4S1dVejFJYVZBOHo1bmJLeU01T0Z5SzJjWU9rVDBlWDVrZGJHQWJhTFpQLVVMR2VmbXExZXdHUVJQT1NWUlJrT1dCWlF4cC1IaQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 17:55:32 GMT",
        "title": "SEC postpones decision on Grayscale’s proposed ETH ETF rule change - Blockworks",
        "content": "The Securities and Exchange Commission on Wednesday announced that it will “designate a longer period within which to take action on the proposed rule change” for Grayscale’s Ethereum Futures Trust.\n\nThe filing pushes the deadline to Jan. 1, 2024.\n\nIn the filing, the SEC said that the “Commission shall either approve or disapprove, or institute proceedings to determine whether to disapprove, the proposed rule change.” Essentially, the regulatory agency has another window to push back a decision.\n\nBloomberg analyst James Seyffart posted on X that the delay of the 19b-4 filing was not “remotely surprising.”\n\nLoading Tweet..\n\nGrayscale filed in early October to convert its Ethereum Trust into an ETF.\n\n“As we file to convert ETHE to an ETF, the natural next step in the product’s evolution, we recognize this as an important moment to bring Ethereum even further into the US regulatory perimeter,” Grayscale CEO Michael Sonnenshein said in a statement at the time.\n\nIn August, Grayscale scored a court win against the SEC after it sought to convert its bitcoin trust (GBTC) to an ETF.\n\nThe judges didn’t order the SEC to give Grayscale’s proposal a greenlight, but rather ordered the regulatory body to re-examine the application it originally denied.\n\nThe panel of judges agreed that the original denial, but the allowance of bitcoin futures ETFs was “arbitrary and capricious.”\n\nAlongside spot bitcoin ETFs, firms are now vying to get spot ether ETFs off the ground. Ark Invest and 21Shares plan to introduce five funds holding both bitcoin futures and ether futures this week. Both filed for the products back in August.\n\nIn early October, six ETFs holding ether futures launched, with roughly $20 million or so in combined assets under management as of early November.\n\nAdditionally, ETF watchers are keeping a close eye on the SEC’s approach to the spot bitcoin ETFs after big traditional finance firms such as BlackRock threw their hats in the ring.\n\nThe SEC also postponed decisions on the big ETFs in late September ahead of a potential government shutdown.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxQbTZQY1lKRGUydFNHcFkxeVZNMFFYbGdiZGNLMThNQUpPLVVDM1lTT2NTdmFDQ3FLMUhUZVhiV2w5WjJJdEFGMjRudThwY1dqOXlDMjh6X1V2dS1tbUtWMmtrYlMyUmR3YUJUeDJOMGJqT2o2V0VsajNzMFh6SFo1TnZKTEowdlQ0eGdGbkg1UEpnamxL?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Nov 2023 08:00:00 GMT",
        "title": "JPMorgan Chase, Siemens, and FedEx show that blockchain finance is more than a buzzword - Fortune",
        "content": "Innovation is a funny thing. It often arrives with an excess of hype and then fades into disappointment—before reemerging in full bloom. A case in point is JPMorgan Chase’s “JPM Coin,” a corporate stablecoin launched shortly after the 2017 crypto bubble that seemed doomed to languish as a proof of concept that would never catch on in the real world.\n\nIn recent weeks however, the story around JPM Coin has changed dramatically as the bank announced that it is notching daily transaction volumes above $1 billion and that its big corporate clients are finally tapping into the coin’s promise to provide “programmable” money.\n\nIf you’re unfamiliar with JPM Coin, it’s a digital dollar that the bank created on a private version of the Ethereum blockchain. This means that clients with access to the coin (or ones like it) can enjoy the benefits of crypto technology—including 24/7 transactions and smart contracts—within a secure corporate environment. Well, that’s how it’s supposed to work in theory.\n\nIn reality, the past six years have been marked by a series of announcements involving banks and companies saying they’ve carried out a blockchain transaction—involving dollars or equities or commodities—and that’s been the end of the matter. While the transactions did occur, they didn’t really matter since they were mostly one-off events that didn’t lead to any changes in day-to-day commerce.\n\nThis has quietly begun to change, however, as companies have moved past the PR phase of blockchain and started tapping into its actual benefits. I spoke with Naveen Mallela, the head of coin systems (yes, that’s a title) at JPMorgan Chases’s Onyx unit, and he explained that the likes of Siemens, Cargill, and FedEx are all using these tools in daily operations.\n\nMallela told me that customers are viewing JPM Coin less as a stablecoin than as a tool to manage commercial deposits and take advantage of programmable money. I pushed him on that, asking what exactly he means by programmable. He explained that it means creating automated instructions for funds you control. A primitive illustration is autopay for bills but, thanks to blockchain, companies can now carry out far more sophisticated operations.\n\nMallela gave three persuasive examples of programmable money in action: companies using blockchain to carry out cash sweeps that used to happen once a day, but that can now occur anytime; finance firms using smart contracts to monitor and address margin calls for securities; and companies arranging for shipping payments to be released at various stages of a voyage.\n\nBy relying on smart contracts to handle these operations, companies can deploy cash and staffing resources more efficiently. And this is likely only the beginning. Mallela notes that IFTTT (“if this, then that”) instructions are becoming commonplace in the corporate blockchain environment and that companies will find more and more ways to use them.\n\nMeanwhile, programmable money is sprouting up in the investment sector as well—JPMorgan Chase and Apollo just launched tokenized funds in Singapore, while a startup called Superstate, founded by the creator of the popular DeFi protocol Compound, just raised $14 million to do the same in the U.S. All of this shows that while blockchain-based finance is still far from mainstream, it has quietly taken a giant leap forward.\n\nJeff John Roberts\n\njeff.roberts@fortune.com\n\n@jeffjohnroberts\n\nDECENTRALIZED NEWS\n\nBinance is launching a new crypto exchange in Thailand alongside Gulf Energy, a giant conglomerate run by the country's second-richest man. (Bloomberg)\n\nPaxos is launching a new USD-pegged stablecoin in Singapore after becoming the second company to obtain a key approval from the country's Monetary Authority. (The Block)\n\nThe SEC deferred on two more crypto ETF applications, including Grayscale's bid to launch one for ETH futures, though many predict approvals in January. (Bloomberg)\n\nArk's Cathie Wood plugged Solana on TV, helping to push the altcoin's price to three times what it was in January. (CNBC)\n\nBitcoin soared 6%, wiping out losses from earlier this week and returning the currency to just under $38,000. (Coindesk)\n\nMEME O’ THE MOMENT\n\nGary + Liz foreva:"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxPUTJsUUZOUXZVVXdVVFc2YzJReHZQRUdQRUZkQ1hHdTk1c3M4NDhkLXFPZkIyZ0ZUdDdQZWctNU43NzlwZ21wcW4tRnZDTmo2ZlFpRXBsU042ZGdMdlBkUDdOQW5uQWVaUXY5X2VCbE50LWZXZjRXZXk0TDlhc0UxStIBhgFBVV95cUxOWlJZSUhPbGp1VG9LOWxSeUJzR1FCbXRIYndMWmdRX0ZIcXh6T2F3eWRfXzlXVE01U3BrNi01WTE0S0JJelp5YkN0ZmpCM0RfMXVoSkNsS0RuTUlqYjZRSHFSS0VpMzdxVTkxenpEcUVMdGJrbDR2MFBBRnhIQUNITjVjUmJXdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Nov 2023 08:00:00 GMT",
        "title": "Vitalik Buterin bats for Plasma scaling solution - AMBCrypto English",
        "content": "Plasma aimed to increase efficiency by taking the bulk of the data off the main chain.\n\nVitalik Buterin claimed that validity proofs could help in plugging the limitations of Plasma.\n\nAs Ethereum [ETH] congestion reached record levels, the need for effective scaling solutions was higher than ever in the blockchain industry.\n\nVitalik bats for Plasma chains\n\nEthereum co-founder Vitalik Buterin talked about the largely ignored advantages of layer-2 scaling solution Plasma in a recently published blog post, and urged Web3 developers to re-explore the technology.\n\nProposed by Buterin himself in 2017, Plasma aimed to increase efficiency by taking the bulk of the data off the main chain. The data is then redistributed onto a series of smaller chains called sidechains.\n\nDue to this, it was the best choice for high-throughput payment transactions.\n\nThese were the shortcomings\n\nHowever, the solution fell behind the competition due to its limitations in enabling smart contract deployment, something that rollups like Optimism [OP] and Arbitrum [ARB] allow.\n\nMoreover, Plasma sacrifices some aspects of security in favor of greater scalability. Highlighted by Vitalik Buterin as well, each Plasma sidechain was independent and responsible for its own security. This made them vulnerable to hacks if there wasn’t enough mining power to secure them.\n\nOn the other hand, rollups, as we know, post all the information about executed transactions on the main chain. Therefore, rollups have been known to have much higher security than Plasma chains.\n\nWhat is the future?\n\nHowever, validity proofs could help in plugging the limitations of Plasma, said the inventor of Ethereum.\n\nHe added,\n\n“Plasma can be a significant security upgrade for chains that would otherwise be validiums. The fact that ZK-EVMs are finally coming to fruition this year makes it an excellent opportunity to re-explore this design space.”\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nRecall that Polygon [MATIC] introduced a proposal earlier to upgrade the PoS network to a zkEVM validium\n\nWhile admitting that rollups were the “gold standard” in scaling solutions, Buterin called for a revisit of Plasma technology because of its advantages in throughput and cost-effectiveness."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMibEFVX3lxTE1Vb053dzdzajQ3RlV0UHJkZEN2V0tfWjVndUFtZmJ4YkZ4NFlvVVNwSGFnSUNvQURzamQ1MGVESG5NUFhRcHdjSHAyZGZpTUVlZjdXeEFVdl9ZUWo4eXhlV2tmSlZIUkdjUElNMw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Nov 2023 08:00:00 GMT",
        "title": "How Jane Street-backed ZetaChain aims to expand Bitcoin’s use cases - TechCrunch",
        "content": "Despite its dominant market share in the crypto sphere, Bitcoin has had limited applications compared to other blockchains which have blossomed to facilitate asset transfers in everything from financial products to video games.\n\nEthereum, for example, has close to 6,000 developers actively building on its network every month as of October 1, according to numbers from Developer Report. Bitcoin, in comparison, has just under 1,000 monthly developers.\n\nA California-based startup called ZetaChain wants to change that by including Bitcoin in the flourishing economy of decentralized finance (DeFi). Off the back of its sizable $27 million Series A raise in August, the company has been busy striking partnerships to scale its blockchain ecosystem.\n\nZetaChain is a Layer 1 blockchain upon which developers can build decentralized apps (dApps) and get access to other blockchains without the need for so-called “bridges” or “wrapped coins”, which are popular solutions that solve one of the biggest hurdles in crypto today — interoperability across different networks.\n\nOne of the breakthroughs brought by ZetaChain, according to its core contributor Ankur Nandwani, is that developers can deploy smart contracts on the blockchain that can interact with native Bitcoin, essentially adding a smart contract layer to Bitcoin. First proposed by Ethereum, smart contracts are lines of code that execute on predefined rules and have given rise to a proliferation of applications like non-fungible tokens.\n\n“Every blockchain is like an isolated state and we are connecting them,” said Nandwani in an interview with TechCrunch. “Most people use Bitcoin as gold. If you can borrow against gold, you should be able to do what you do with gold for Bitcoin.”\n\nToday, ZetaChain announced that it’s adding native Bitcoin support to decentralized exchange (DEX) Sushi, letting users swap Bitcoin across 30 networks. Behind the scenes, Sushi works by deploying its EVM (Ethereum virtual machine)-compatible smart contract on ZetaChain, meaning that, for the first time, Sushi can support native Bitcoins by making minimal changes.\n\nThese Sushi smart contracts can be accessed from the Bitcoin network itself, so Bitcoin users don’t even need to leave the network.\n\n“It’s not only about the increased liquidity from Bitcoin; it’s about beginning a new chapter in DeFi, where we see more practical use cases of interoperability and enhanced connectivity,” said Sushi’s “head chef” Jared Grey in a statement.\n\nIn October, ZetaChain integrated with centralized exchange OKX’s self-custodial wallet, allowing users to access dApps on various networks and to use their Bitcoins in dApps without the need for wrapping or bridging from the Bitcoin network itself.\n\nStarted in 2021 by serial entrepreneur Nandwani, ZetaChain announced its Series A funding round in August from investors from a range of backgrounds, including quantitative trading firm Jane Street Capital, crypto exchange Blockchain.com and China-focused early-stage VC firm Sky9."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiZEFVX3lxTE84R3ZjX0ZuZDZZV3R6TlJZZzNEY2xaWnJGY3NwTC01TlZJQlU4RjRPOVZ0M1JaWlp1MmpKdkJSRXNBMzJsbkdMdkstWVFnYm5JTU4yY1JXcWZJanktYmtvcTk0S1M?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "What Is Arbitrum Crypto? A Beginner's Guide to Ethereum's Game-Changing Layer 2 Solution - Bybit Learn",
        "content": "Grab Up to 5,000 USDT in Rewards\n\nGet a 20 USDT Coupon instantly & earn more bonuses when you sign up today."
    }
]