[
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxQazN0S2VZQ1NPOTlNWHpPYkV2T0tiOW9NZmNfUHJNOXQzNGVuMzRsYVgyRDMxa18zMWhIQXh0a21tUTZqWng1YnRtamVLdktQMWFoNUpKVjZNam9lZU1aV3ZJQm5yd1lyc0hqU2c3U0NQaHJVNWhvSjVDQmEtaWJlcXp4UFZMZ2MyLThwMG16eHVTY3M1X2k4dDlQX0E1MFgwYVkzaDhzelBRS2s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Ethereum community approves first-ever compliant tokenization standard, ERC-3643 - Crypto Briefing",
        "content": "The new token standard allows anonymous credentials to ensure only eligible users can access tokens.\n\nShare this article\n\nThe Ethereum community has approved the ERC-3643 standard. This standard is the first-ever designed specifically for compliant tokenization. This new standard improves upon the widely used ERC-20 standard, particularly in securities activities. It enhances ERC-20 tokens with controlled advanced functions and compliance modules.\n\nJoachim Lebrum, Chair of the Technology Working Group ERC-3643 Association, stated that:\n\n“The ERC3643 standard is a groundbreaking step towards integrating advanced blockchain solutions into the enterprise sector, and this validation sends echoes across the ecosystem that ERC3643 is the superior standard for such use cases.”\n\nERC-3643 is a permissioned token standard for tokenizing securities, real-world assets (RWAs), payment systems, and loyalty programs. The standard uses a self-sovereign identity (SSI) framework to verify users’ token eligibility dynamically. This feature ensures compliance through anonymous but verifiable credentials.\n\nThe new ERC-3643 standard sets out to revolutionize how companies leverage blockchain technology. It provides them with a secure, compliant framework to tokenize various assets. Ethereum’s official recognition of this standard demonstrates its goals to address users’ diverse needs. It also establishes a benchmark for institutions implementing this framework in tokenization projects.\n\nCompanies now have an approved standard to actively deploy to bring real-world assets onto blockchains while integrating the necessary compliance controls and permissions.\n\nLooking ahead to 2024, experts predict the momentum behind asset tokenization will accelerate. HSBC’s research group forecasts the market for tokenized assets will swell to trillions of dollars by 2030. Governments and significant investment funds are demonstrating growing interest in this area. The next wave of tokenization will likely see bonds, equities, and other mainstream financial assets transitioning to blockchain-based models."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiaEFVX3lxTE1SdzdzbkdsbXJDRkUxRFNxU1M2N0JOZlZMYmJzdHpIY0hVMXZCd1pXM0NyeFo3VVpybHhweUFYbnpGcDYtcVp5Z0FNcGlYZlJEVjJadFBFZm5QT0RIV3M0MkNOSGg2Z3pE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Dec 2023 08:00:00 GMT",
        "title": "Cronos broadens scaling roadmap from Cosmos to Ethereum - Blockworks",
        "content": "The network of Ethereum layer-2 rollups using zkSync’s ZK Stack got a new addition Thursday, with the launch of the Cronos zkEVM testnet.\n\nBlockchain developer Cronos Labs is developing its third blockchain, which is the first to use ZK Stack hyperchain to reach a live testnet.\n\nThe first chain in the Cronos ecosystem was a Cosmos appchain developed in partnership with the Crypto.com exchange and launched in 2021. Cronos then followed up with an EVM-compatible chain, also built using the Cosmos SDK in 2022. This new effort augments, but does not replace, the prior two chains.\n\nCronos’ zkEVM is the result of a collaborative effort involving Cronos Labs, Matter Labs (the team behind zkSync), and several engineering teams from stakeholders Crypto.com and dapp developers on the existing chains.\n\nThe zkEVM testnet is built on top of the Ethereum Sepolia testnet and leverages zkSync’s new open-source prover, Boojum, a STARK-based zero-knowledge proof system, notable for its low hardware requirements and low fees in the layer-2 rollup space.\n\nRead more: Polygon Zero and Matter Labs square off over open-source norms\n\nLaunching a native Ethereum chain was motivated by frustrations with bridging across EVM chains and between Cosmos and Ethereum, according to Ken Timsit, managing director at Cronos.\n\n“When we started building Cronos as an EVM chain, we were, of course, already convinced that the Ethereum developer ecosystem has richness and robustness that has no comparison when it comes to building DeFi and NFT applications,” Timsit told Blockworks.\n\nGood relations with Matter Labs and a desire to contribute to the open source development of the ZK Stack led them to take the next step.\n\nHyperchains share components of the ZK Stack, including a shared native bridge to the Ethereum mainnet and zkSync’s trustless bridging mechanism, in which assets remain secured by Ethereum.\n\nIt will also benefit from zkSync’s native account abstraction, which allows transactions fee payment in various cryptocurrencies, such as Cronos’ token (CRO).\n\n“When you look at legacy chains, it’s very hard to migrate Ethereum assets, for example, to account abstraction enabled wallets,” Timsit said. “And so for us, starting by default with account abstraction is a way to take advantage of what this technology offers, better than what we can do on a chain which already has an ecosystem of wallets and tokens.”\n\nCronos’ zkEVM is expected to progress to mainnet in the second quarter of 2024.\n\nGrowing hyperchains\n\nA handful of other hyperchains are in development using the ZK Stack, notably GRVT, (pronounced “gravity”) a derivatives exchange, and Tradable, which is working on bringing private credit on-chain.\n\nTradable intends to have an institutional focused hyperchain, eventually forming a decentralized chain alongside other institutional partners, according to Omar Azhar, Matter Labs head of business development.\n\n“I think what you might start seeing is app specific chains and then ecosystem specific chains,” Azhar told Blockworks.\n\nMatter Labs sees the zkSync hyperchain as strictly a better option than app-specific chains in Cosmos, such as Cronos’ earlier efforts, said Marco Cora, senior vice president of business and operations. That’s because Cosmos chains generally must provide for their own validator set and security, and lack native token bridges to Ethereum.\n\n“If you are an appchain developer, why are you taking on these two extra projects that you shouldn’t really focus on: building the bridge and bootstrapping the security?” Cora told Blockworks.\n\nThe ZK Stack competes with other well-funded networks building zkEVM chains, including Polygon, whose Chain Development Kit (CDK) shares many of the same goals, and StarkWare’s Starknet, the progenitor of STARK prover technology which both Polygon and zkSync have iterated upon.\n\nHyperchains can also serve the purpose of private blockchain frameworks such as Hyperledger or Corda, Cora said, but with all the benefits of Ethereum.\n\n“They are technically highly scalable, but they practically don’t scale. When you speak with most enterprises, they tell you this is way too expensive for what it is for me,” he said.\n\nAside from cost considerations, there’s the social coordination problem.\n\n“If you’re Goldman Sachs, you don’t want to join the Morgan Stanley Chain just because it’s the Morgan Stanley Chain. If you’re Fidelity, you don’t want to join the BlackRock Chain just because it’s the BlackRock Chain and so on and so forth,” Cora said.\n\n“But if the sponsor of the chain…forced himself to create a zero knowledge proof and to hand this proof to a third party — which is Ethereum — they now can claim a much higher degree of credible neutrality,” he added. “Now, this party cannot mess with the system.”\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiZkFVX3lxTE1DTThDVXZtaFVHenZ6Zzl0VldWQkRqNjBpV1VkZjZTV0ZlODE2eDZ0aWRLVzdyMVM0ZXJWZzZmaU5aQjl3LWhiY0xVS2g3NVVtdDNSaDAtRFh4cmdyQlVvOFB0T0NYd9IBa0FVX3lxTE1uWmEycC1DOEJ4RVFnQy1zNnNfZDNBcU5ST2FtQTZfS2dmakJMS2g4WTBXVEhfTHBKcEdNdjloZmE4cU4yS1NLYkpvTk9PcHNfcnd0R0xkVW1FLXJfSjBUWVZHWGQ5bENMMEc0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Founder Vitalik Buterin Sells Trillions Of Tokens | Bitcoinist.com - Bitcoinist",
        "content": "Ethereum founder, Vitalik Buterin has undertaken a large-scale transaction involving trillions of meme tokens, leaving the broader cryptocurrency space curious about the motives behind the founder’s decision.\n\nEthereum Founder Executes Massive Memecoin Sales\n\nEthereum inventor and founder, Vitalik Buterin has made new headlines as reports surface of his substantial memecoin sales. According to blockchain security company, PeckShield Alerts, a Vitalik labeled wallet address was seen swapping 100,000,000,000,111.111 DOBE tokens worth approximately $22,900 for 10.44 Ethereum tokens (ETH). Additionally, the wallet also initiated another sale of 1,858,140,000,000 DOJO tokens worth $6800 for 3.12 ETH.\n\nThe motivation behind the sell-offs remains unknown however the large-scale memecoin transaction has adequately caught the attention of cryptocurrency investors and the market as a whole.\n\nThe substantial meme coin sale follows a recent loss experienced by Buterin earlier this week. The Ethereum founder’s publicly known crypto wallets became short of $29 million between December 15 and 21.\n\nThe loss was reported by blockchain analytics service, Arkham Intelligence. According to the analytics platform, the reason for the loss was due to crypto market fluctuations which saw Buterin’s wallets losing 5% of the total value of its assets.\n\nETH price chart at $2,300 | Source: ETHUSD on Tradingview.com\n\nButerin Crypto Sell-Offs\n\nIn addition to Buterin’s recent large-scale meme coin sell-off, there have been many other crypto sales executed by the ETH founder. Earlier this year, Buterin sold about 9.9 billion CULT tokens worth $332,420 at the time of the sales. The Ethereum founder subsequently revealed reasons for the sell-off, stating that the cryptocurrency held no cultural or moral value.\n\nLater in October, rumors surfaced about Buterin allegedly selling off his ETH holdings after the Ethereum founder sold about 500,000 USDC worth approximately $14.93 million at the time, to the Gemini exchange. Buterin clarified the sell-off allegations stating that the transactions were made to charitable organizations and other initiatives.\n\nMore times than not, large-scale crypto transactions from prominent leaders in the crypto space tend to capture the attention of investors as these sales could lead to a shift in the market. However, Buterin has also revealed that he has never sold Ethereum tokens (ETH) for his gain since 2018.\n\nThe Ethereum founder is known for making multiple ETH donations to charity organizations and COVID-related causes. Buterin is also known for purchasing and constantly dumping meme coins, causing the value of these tokens to plummet in several cases.\n\nFeatured image from Newsway, chart from Tradingview.com"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxQRm02QUE2Mjd0NVptUThOemFkVkJ4ZzFZZ25YZVJFX0RKNjRXbFRoRnVnY1hOc3A2UVFsdkVtU1FlYzlOcEMtckgxejZOWnc3Vl9FSTFuUHd6anZEUVdNLUtMc0MzTlhkSzRyLTZkdlhqbjRYanpnWXc5WklYUG4tM1d5NNIBiAFBVV95cUxOUHBMcGZSYldLWF8tWHR2Qm9kT2xObGNJNGxURGJXQjhjX1FFRllreURvWGg3UjNZMWVlYWRnY3RCQmNKU3RQM2RMbVNVdGw3ZVFGUjZoUFFZbFduZTRHZUF1MXpvQ1dGZjQ5bkJNU2I2UmVwVGN6SjdfR1dNT2l5a29rYTZfWTdN?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Dec 2023 08:00:00 GMT",
        "title": "Ethereum (ETH) Price to Reach $2,500 on This Date, But Here's Catch - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nEthereum's price trajectory has been the subject of intense scrutiny and speculation, especially as it shows numerous reversal signs. Chart analysis suggests that the middle of January 2024 could be when Ethereum potentially hits the coveted $2,500 price mark. However, like any projection on the volatile market, this comes with significant caveats.\n\nAdvertisement\n\nA study of Ethereum's price performance, as depicted in the recent ETH/USDT chart, shows a robust uptrend with high momentum. This is corroborated by the Relative Strength Index (RSI), which, although retreating from overbought territory, remains strong, indicating sustained buying interest. The moving averages (MAs) — key indicators of long-term trends — demonstrate a bullish crossover, with shorter-term MAs traversing above longer-term ones, signaling ongoing upward momentum.\n\nSpecifically, the separation between the 50-day and 200-day moving averages is widening, a classic confirmation of a strong trend. However, this separation could also precede a long-term correction, particularly if it continues to expand without price consolidation. Additionally, descending volume accompanying recent price spikes raises concerns. Robust volume is a hallmark of sustainable price movements, and without it, the likelihood of a retracement increases.\n\nAdvertisement\n\nGiven these factors, mid-January 2024 stands out as a pivotal moment for Ethereum. Should the current momentum persist, and if volume picks up to validate the trend, reaching $2,500 is possible. This projection assumes that the current support levels hold firm and that buyer interest continues unabated.\n\nHowever, investors should heed the warning signs. The descending volume is the primary indicator to watch after as it may bring some issues and cause a drop of momentum in the future. Moreover, the potential for a long-term correction looms if the market perceives the price has outpaced fundamentals."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxQMDdpaHZCUXNFSjlaM3VhV25LUURYUjhZdkwxYVRxT3VzUFFETkRjUmplczVkSzUyVHd4UXRJMVVBZ3BYcWVDZm9aUC1TNzN5RjFodXZ0YnFKc1ZFalJZT0l0STAzRmo3Q3dZVTU4UWlRRm9OZDgyUDVweUg3X0d2WQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "2 Stocks to Watch as Ethereum Shows Promise for 2024 - Yahoo Finance",
        "content": "While Bitcoin (BTC) has had a great 2023, so has Ethereum (ETH), the second-most traded and recognizable crypto coin in the world. Ethereum is known for its uses as a blockchain-powered, open-ended decentralized software platform and has risen 89.4% in value as of date in 2023.\n\nThe crypto behemoth has paved its path to winning over new customers by making a significant update this year, known as the Shanghai Upgrade. Under this upgrade, ETH shifted its blockchain validation system from proof-of-work to proof-of-stake and marked one of the most significant developments in the relatively short history of cryptocurrency.\n\nIn the proof-of-stake system, miners of Ethereum will rely on Ether holders, who will act as validators, thus lending more assurance to the system. In essence, proof-of-stake allows holders of Ether to lock up their funds as collateral to validate transactions and create new blocks, reducing the need for extensive computation and energy consumption.\n\nPowered by this development and what promises to be a significant 2024 for cryptocurrency, analysts around the world have turned bullish on it. There is a consensus that ETH might outperform BTC in 2024 with regard to growth rate and will gain more market share based on its proposals to reduce transaction costs and boost the number of transactions per second. In fact, its planned upgrade, called EIP-4844, might ensure that transaction costs could fall to as low as $0.01.\n\nPer Bitwise Asset Management, the world's largest crypto index fund manager, ETH revenues could double from 2023, up to $5 billion in 2024. Also, a state of fast-rising interest rates has not proven conducive to the crypto market. However, with markets widely betting on rate hikes having come to an end and the first rate cut as early as first-quarter 2024, the crisis for crypto may have been averted.\n\nEthereum has already started to make good of the state of the market, and it might be prudent to keep a watch on stocks exposed to this open-source, decentralized blockchain platform. Here is a selection of two stocks that we believe should be tracked. These currently carry a Zacks Rank #2 (Buy) or 3 (Hold). You can see the complete list of today’s Zacks #1 Rank stocks here.\n\nAccenture plc ACN: This global system integrator that provides consulting, technology and other services markets Ethereum-based blockchain solutions to businesses to make it easier to process payments.\n\nAccenture’s expected earnings growth rate for the current year is 4.6%. The Zacks Consensus Estimate for its current-year earnings has improved by 0.1% over the past 60 days. ACN currently carries a Zacks Rank #2.\n\nStory continues\n\nCME Group Inc. CME: This company operates as one of the world's largest futures exchange, offers a wide range of derivatives contracts and provides various solutions to invest in cryptocurrencies like Ethereum.\n\nCME Group’s expected earnings growth rate for the current year is 14.7%. The Zacks Consensus Estimate for its current-year earnings has improved by 0.6% over the past 60 days. CME currently carries a Zacks Rank #3.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nCME Group Inc. (CME) : Free Stock Analysis Report\n\nAccenture PLC (ACN) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxQVFh1aHBTMVVkaFJkaUxvNloxQzVWb05RRGtwcUxDN1IwZURIZGdkZzRsUmxnVW5QSDNkQ1BLT0JaQ29IVlNXUU9XWjZyaUp1NE0tYTJyeHZOWGR0YktZUEZHZWFFYVlkX1dGUjVJUFRhaThkT19SQ2RWZDVkVEJrbVNCdzJlQUt2YnFaZ0ZB0gGWAUFVX3lxTE05NGpFaFlBLXczLUJXQ0s0R3M0bGFfc05sandVdEh6LVNtdExNM0VZWFhfNkIwdUdfal9pNGd1X1A3Y2dkcTE1QjBab25uYVZZaXVJUnZXZ0ZrYS1Qd1Bva3k3NENnNjlEbDN3RUtNUVcwQ2V3Q2h2VTNvOWJIVEdUMGNFdFhiQTFIa3A1R0xkWHF4cWdzQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Dec 2023 08:00:00 GMT",
        "title": "Native Bitcoin Staking on Ethereum and Solana Could Soon Be a Reality - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThere are a few essential truths that govern accepted thinking about blockchain networks. One such truth is that, without compromises like wrapped tokens and blockchain bridges, proof-of-stake networks like Ethereum and proof-of-work networks like Bitcoin are tantamount to water and oil: They just don’t mix.\n\nNow, a new startup led by a Stanford professor and a former Dolby engineer is attempting to disprove that. Babylon, a project that seeks to allow users to stake Bitcoin (BTC) to validate nodes on a variety of proof-of-stake networks including Ethereum, Solana, and Polygon, is already well on its way to achieving its improbable-sounding goal.\n\nThe company just raised an $18 million funding round co-led by Polychain Capital and Hack VC, with participation from funds including Framework Ventures, Polygon Ventures, OKX Ventures, and Castle Island Ventures. It is also in ongoing conversations with multiple blockchain networks about integrating its services, including Polygon, a Polygon Labs spokesperson confirmed to Decrypt.\n\nHow could it be possible, even theoretically, for someone to stake BTC—actual BTC, not a wrapped token that utilizes a blockchain bridge—on a proof-of-stake network? Proof-of-stake networks like Ethereum utilize smart contracts to govern the staking process, which rewards users who deposit a certain amount of ETH with rewards accrued over time.\n\nAD\n\nAD\n\nIn return, these ETH deposits are used to validate transactions on the Ethereum network. The entire staking process represents an intricate web of if/then conditions executed automatically by a smart contract.\n\nSmart contracts, however, are not natively supported on the Bitcoin blockchain—but Babylon says it’s found a workaround.\n\nThe solution relies in part on Bitcoin’s “time lock” mechanism, which allows users to deposit a certain amount of BTC for a certain period, then withdraw it after that period without depending on a third party. But Babylon also had to find a way to get around the pesky smart contract problem.\n\n“The biggest challenge for staking is that the stake is a collateral,” David Tse, an engineering professor at Stanford who co-founded Babylon, told Decrypt. “In other words, I have to be able to slash the Bitcoin when the validator on the proof-of-stake chain is doing something bad.”\n\nAD\n\nAD\n\nTypically, a smart contract would either release collateralized funds to a staker if all conditions were met, or burn (or slash) those funds if they hadn’t been. Tse says his team has been able to replicate that process on the Bitcoin network without smart contracts.\n\n“We came up with a way to use the existing Bitcoin scripting language to effect the slashing,” Tse said. “That is the main innovation of the project.”\n\nIf Tse and his team have in fact gotten this right—he says they still have a bit of final tweaking to do on the technology—then the potential upside is enormous.\n\nProof-of-stake blockchains of all sorts could tap into the $838 billion worth of incredibly secure Bitcoin already in circulation to validate their transactions. That innovation would be an all-but-certain path to deflation for any proof-of-stake network, that would no longer have to issue so many new tokens in order to incentivize validation.\n\n“The Cosmos hub is paying about 10%—inflating the token 10%—to pay for Cosmos’ security,” Tse said, giving an example. “By bringing in Bitcoin, it can potentially lower the cost of security quite a bit, because Bitcoin is a much larger supply of capital.”\n\nBabylon won’t be able to provide its technology to any given proof-of-stake blockchain ecosystem until that blockchain’s governance gives consent. So, at the moment, the company’s vision is still theoretical.\n\nBut Babylon is, as mentioned above, currently in serious conversations with major proof-of-stake blockchains like Polygon—and also has already received the blessing of industry leaders including Polygon co-founder Sandeep Nailwal.\n\n“Babylon's vision aligns with our commitment to fostering decentralized ecosystems by offering diverse options for communities to seamlessly choose from,” Nailwal said in a statement. “We are enthusiastic about the positive impact this collaboration will bring to the wider blockchain community.”\n\nAD\n\nAD\n\nIf (or when) proof-of-stake networks like Polygon begin adopting Babylon’s novel technology, they may create new parameters for what it means to stake BTC on their chain as opposed to the network’s native token.\n\nEthereum, for example, may not require the minimum amount of BTC needed to stake on the network to equal 32 ETH, the system’s current requirement. It might also elect to offer a lower rewards return rate for BTC stakers.\n\nEven if proof-of-stake networks that eventually work with Babylon opt to make such choices, though, the demand for receiving any sort of passive, guaranteed return on Bitcoin will likely be immensely attractive to BTC holders around the world.\n\nEdited by Andrew Hayward"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxNYWFaSlg4VGIwM0JWd0Q0d2dMMGhRSFYtdi1YUENPQWVvOU1BX2FtbFR4ZXhGSy1URGQtLUE2aERwR0czTXgxMFBWVTQtTk14X0IyeEJReVNDdG5Ub0FRVFZMOWhMUmRxRnEtTzJWYUd0X0NyS0xaa3dsdm5FOWRZQTV6RGJCSTlMcEsyX25mODRXd2daMEVSXzhZazRkZzFSZElVVTBRUTVPUdIBrwFBVV95cUxQdWtFVUZ3QnlFX3dBanJ6UHFyOEI4TWx1S01nbTZzZ3g0VTdhQmhvQUZRaF9Mb3pBd3RkYmNUN1c5WUxwVVFWdHJxRHlJUmxjX0R5ZkNuUXhDZl85OEtPcWlNeXlXbUJhaUlrQ1RNRmdCQUJSb1J4eTNUTXhINERhOU1wa0I4dkdOU2c4dVhXNldVV1JGaFRZekQwVGt4ekNjejdabzVBdXowb0szM3Zz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Dec 2023 08:00:00 GMT",
        "title": "Vitalik Buterin Proposes ‘Enshrined zkEVM’ to Address Ethereum’s Layer-2 Challenges - CryptoPotato",
        "content": "Vitalik Buterin, Ethereum’s co-founder, has proposed a new concept: the “enshrined Zero-Knowledge Ethereum Virtual Machine (zkEVM).”\n\nThis initiative aims to enhance the efficiency and security of Ethereum’s Layer-2 protocols, particularly optimistic and ZK rollups, which are crucial for the network’s scalability.\n\nVitalik Buterin’s zkEVM Layer-2 Solution\n\nIn a recent blog post, Vitalik Buterin highlighted the evolving strength of Ethereum’s “light clients.” They are set to improve, soon being able to use zero-knowledge cryptography for verifying transactions on the primary chain.\n\nThis development, Buterin notes, will effectively integrate a zkEVM into Ethereum, leading him to propose its potential use for rollup protocols as well.\n\nEthereum’s Layer-2 protocols are crucial for the blockchain’s scalability but rely heavily on EVM verification. The current method has a large and potentially vulnerable codebase, which creates several challenges.\n\nzkEVMs, designed to replicate the Layer-1 EVM, struggle to keep up with updates in the Ethereum protocol, leading to duplicated efforts and increased security risks.\n\nA post on benefits and challenges of enshrined ZK-EVMs at layer 1:https://t.co/bRTKdtaFRL There’s different options and the tradeoffs get complex! — vitalik.eth (@VitalikButerin) December 13, 2023\n\nAddressing these issues, Buterin suggests embedding a zkEVM directly into the Ethereum blockchain. This internal zkEVM would take on the task of verifying Layer-1 Ethereum blocks, offering a more efficient and secure approach.\n\nButerin envisions the proposed zkEVM’s main focus on verifying Ethereum blocks by processing inputs like a pre-state root, a block, and a post-state root. This ensures the integrity of the post-state root as a true outcome of block execution.\n\nAccording to Buterin, Implementing the zkEVM presents several design challenges and trade-offs. It requires compatibility and adaptability to support various proving systems, reflecting Ethereum’s multi-client environment.\n\nIt’s also essential to provide data availability to satisfy different clients while ensuring auditability and upgradeability for easy inspection and quick issue resolution without hard forks. The system must also support innovations in ‘Almost-EVMs,’ permitting Layer-2 solutions to extend and innovate upon standard EVM functionalities.\n\nButerin also advocates for an open system, where proofs are verified externally, for its flexibility and compatibility with Ethereum’s core values despite its higher complexity.\n\nSpeed is also a critical aspect of zkEVM implementations. The objective is to reduce the proof generation time, enabling near-instantaneous processing using technological advancements in parallelization and hardware acceleration.\n\nPotential Impact on Layer-2 Projects\n\nButerin’s proposal could significantly impact existing Layer-2 projects like Polygon, Matter Labs, and Scroll, which have invested heavily in aligning with Ethereum’s earlier roadmap.\n\nButerin, who has for years pushed Ethereum down a “rollup-centric” roadmap, has assured that Layer-2 networks will continue to play an essential role, responsible for functions like fast pre-confirmations, MEV mitigation strategies, extensions to the EVM, and user and developer conveniences.\n\nHe notes that these teams are crucial in attracting users to their ecosystems and are compensated through capturing MEV and congestion fees within their networks. This relationship is expected to continue under the new plan."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxQd1NmOU1sNGxTeHpaTTBiTWxqX2pRMjB3RGI1dmtzdFF6MTI4eDUtVkFrWXVNZ2F3Q2liVGQwRkZHU2V5NUprdVZ6MFFoNExocjRQaXFWQncxV3d2Ujh6bF9acHZtVm1Xc3VqSXp0S0FzTkVFMEJkYnFHT3l4dUxsZG1HT2hlVVRXZDctZjk0dVFIcThOSXhuRC14OGFBZDhmRU5n?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Ethereum: Vitalik Buterin Explores Direct L1-L2 Integration via ZK-EVM - Cointribune EN",
        "content": "Fri 15 Dec 2023 ▪ 3 min read ▪ by Ariela R.\n\nVitalik Buterin, co-founder of Ethereum, explores the nuances of Layer-2 solutions in a visionary article. He particularly emphasizes the current dependency of L2 solutions on the main EVM. He also discusses the possibility of directly integrating native ZK-EVM on Ethereum’s Layer 1 (L1). The details!\n\nVitalik published an article discussing the current L2 EVM solution heavily relies on the mainnet EVM, and whether it would be possible in the future for the built-in ZK-EVM on L1 to be directly used by Rollups. He also described several possible implementation versions, explored… — Wu Blockchain (@WuBlockchain) December 13, 2023 Vitalik Buterin explores new approaches to boost the performance of the Ethereum blockchain\n\nVitalik wants to redefine Ethereum L2 with ZK-EVM\n\nAbout a month ago, we discussed the impact of backdoors on Ethereum rollups. Now, Vitalik is questioning the current dependency of L2 solutions on Ethereum’s main EVM.\n\nIn an article published on December 13, Vitalik Buterin indeed proposes a bold reflection aimed at transcending the existing limits of Layer-2 solutions. Currently, these solutions are tightly dependent on the Ethereum Virtual Machine (EVM) of the main network. However, Buterin envisions a transition towards a more direct integration with a native ZK-EVM.\n\nThis proposal raises fundamental questions on:\n\nthe current design of Layer-2 solutions,\n\nthe challenges inherent to such a pronounced dependency.\n\nExploring these implications offers insight into potential changes in how Layer-2 protocols interact with the Ethereum blockchain. This paves the way for more flexible and efficient solutions!\n\nThe envisioned versions of ZK-EVM\n\nThe potential evolution towards a dedicated ZK-EVM presents significant strategic and technical implications. In his article, Buterin precisely explores the reasons behind these choices. Also, he offers an in-depth perspective on how this technology could revolutionize the way smart contracts are executed on the Ethereum blockchain.\n\nThe multi-client philosophy in the context of EVM verification emerges as a central element of Vitalik Buterin’s discussions. He explores the advantages and disadvantages of multi-client systems, classifying them as “open” and “closed”. The crucial question is whether a multi-client system can provide a more resilient and decentralized solution.\n\nVitalik’s innovative ideas thus pave the way for a more transparent and robust Ethereum ecosystem. By inviting the crypto community to embrace innovation, direct ZK-EVM integration foretells a promising future for Ethereum’s blockchain technology.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxNYlRmbGNvd29tTC1GemgteFpoYTE3QUZ3eDBsSGRfNVVodFNZOThsMVUwaElodWJwTDEydmVLNFR1Q1gzaG5WUTc1RTJkLTI4dXFSSmRKN1dhY1ZzSkVJRkl0MG9hbkhWWVF2S1JhZ09yNXBnX01qc3FRb2I3SWJ6RWx3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Dec 2023 08:00:00 GMT",
        "title": "Vitalik Smart Gas (VSG) launches on Ethereum Chain. Embark on the Revolution of Layer 2 Smart Chain with $VSG - Yahoo Finance",
        "content": "Vitalik Smart Gas\n\nCalifornia City, CA, Dec. 14, 2023 (GLOBE NEWSWIRE) -- VSG proudly announces the launch of Vitalik Smart Gas (VSG) , a pioneering gas token designed exclusively for the revolutionary Vitalik Smart Chain (VSC) – Layer 2 (L2). This momentous launch signifies a significant stride forward in the evolution of blockchain technology, presenting an unparalleled opportunity for early adopters to immerse themselves in the ground-breaking VSC L2 ecosystem.\n\n\n\n\n\n\n\nAs trailblazers at the forefront of the development stage of this cutting-edge chain, VSG extends a distinct invitation to individuals, investors, and enthusiasts to participate in the foundational phase of an L2 chain token. This launch heralds a unique chance to carve a definitive position in the imminent evolution of blockchain technology.\n\n\"Today marks a watershed moment in the blockchain landscape as we introduce Vitalik Smart Gas (VSG), the dedicated gas token for the ground-breaking Vitalik Smart Chain (VSC) L2,\" stated Whittaker, the community developer. \"With this launch, we invite forward-thinking individuals to seize the opportunity and become catalysts in the transformation of decentralized systems.\"\n\nVitalik Smart Gas (VSG) launch highlights:\n\nIntroduction of VSG, the gas token designed exclusively for the VSC L2 ecosystem.\n\n\n\nA pivotal moment to engage and contribute at the genesis of an L2 chain token.\n\n\n\nOpportunity for investors and enthusiasts to secure their position in the future of blockchain innovation.\n\n\n\nParticipation in the VSG launch signifies more than an investment opportunity; it represents involvement in a community-driven ecosystem committed to scalability, efficiency, and technological advancement.\n\nFor detailed information regarding VSG and how to engage with the VSC L2 ecosystem, please visit the official resources:\n\nWebsite: https://vsgofficial.com/\n\nTelegram: https://t.me/vsgportal\n\nTwitter: https://x.com/VITALIKL2CHAIN\n\n\n\n\n\nJoin us as we embark on this transformative journey with the Vitalik Smart Chain (VSC) L2 and its dedicated gas token, Vitalik Smart Gas (VSG) .\n\nFor media inquiries or additional information, please contact\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, or intended as investment advice, financial advice, or trading advice. It is strongly recommended that you practice due diligence (including consultation with a professional financial advisor) before investing in or trading securities and cryptocurrency.\n\n\n\n\n\n\n\nCONTACT: Aditya Roy VITALIK SMART GAS contact at vsgofficial.com\n\nStory continues\n\n\n\n"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMi3gFBVV95cUxPa2dNSHFOSU42bE1EVG1ZVUpvWWE0ZUxYQ0pCQjhkX3VlNDRCRlZPVnFPXzBhQVV3WmZhdDI3a2dRdk40ZW44SlpCeWxjcmtUTC1Fc2hVS3UzS0JuZ3RGaHlpdnVSeHlSSVVCZ3Y5WktJZUdOcnAzb3QwaDlkWU5ibjJhTUhURDlFRlMyTnJNWUNXMFB3a3Y4RnFKcjdjaXM5NWtnaUpEaldwY0RvbjZOQmczbFNvYlhabmlrZUpNV2F1X1hzeVNLSEV5V1lzY1B6aWlGUVgxUlBnbUVhc1HSAeMBQVVfeXFMTXBLMkV3c3Y4ZUxmN0JiUUxOSzZDdy05Qk5rbGpGMEFUWWFUaHRwLXVxYVNscmU4cGVzTWFNMy1LQ0EzNnB4WjQwN05kLUZ0RURBLUZFNXVvX3FLQUNBTVh4QnJUM0JVZkE5cTk2OGtfd0dLVGowUDFqa185TGYtdEFFdlRhT1JZTmZQNjBNYm14Y1Zoa0RxbmtyTlJTVXpLbE9UOV9jYnFGanVzcHBIQXoxZXUzSF90Xy1nNE5EenllRS02UERXdTBUX2xxYi1jbkx1WWFJZVpsa1dtMjN5bnBUMVk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Ethereum price likely to outperform BTC says JP Morgan report, but short-outlook remains flat despite ETF hype - FXStreet",
        "content": "Invesco Digital’s Ethereum spot ETF’s approval is delayed.\n\nEthereum price is likely to hover between the $2,030 and $2,539 levels for the next few weeks.\n\nOn-chain metrics note a decline in user activity, which could add headwinds to the uptrend.\n\nEthereum (ETH) price is likely to overshadow Bitcoin price performance in 2024 said JP Morgan analysts in a recent note. Ether traded in the $2,400 region after nearly three weeks of consolidation but this uptrend seems to have lost momentum as Bitcoin price takes a hit this week. Despite the Bitcoin ETF approval hype, ETH continues to remain largely neutral as other altcoins outperform Ether. In the near future, ETH is likely to slip into sideways movement due to a few reasons: a slump in on-chain activity, a delay in ETF approval from the US Securities and Exchange Commission (SEC), a fast-approaching holiday season, and a lack of momentum to push Bitcoin price higher.\n\nAlso read: Ethereum revenue could double to $5 billion and fee may fall to $0.01 in 2024: Bitwise prediction\n\nSEC delays Ethereum ETF\n\nAs noted by Bloomberg Analyst James Seyffart, the Commission has decided to delay the Invesco Galaxy Ethereum ETF. The analyst adds that “this was early but completely expected.”\n\nUpdate: SEC delayed @InvescoUS / @galaxyhq Ethereum ETF application -- This was early but completely expected. (Wasn't due until Dec 23rd I think) pic.twitter.com/jFCjnND3Rf — James Seyffart (@JSeyff) December 13, 2023\n\nInvesco and Galaxy Digital filed for an Ether spot ETF in September, but like Bitcoin’s ETFs, Ether’s is likely to be delayed before the SEC gives a decision. Additionally, the Commission remains unclear on its stance as to whether Ether is a security or a commodity, which makes the approval of an Ethereum ETF highly speculative.\n\nRead more: Hashdex tips spot Bitcoin ETF s to trade by Q2, followed by Ethereum\n\nEthereum price remains neutral-to-bullish\n\nEthereum price action between June 2022 and November 2023, created an ascending triangle setup. This technical formation is a bullish pattern in which the asset price creates higher lows and equal highs. In Ether’s case, three distinctive higher lows and three equal highs formed.\n\nConnecting the equal highs shows a horizontal resistance level at $2,030. This level was broken on November 20, indicating the upside potential of the pattern was activated. The ascending triangle setup forecasts a 43% upswing to the $2,943 level, obtained by measuring the distance of the widest part of the triangle and extrapolating it higher.\n\nEthereum price’s breakout was succeeded by a 16% rally to a local top at $2,403. Since then, ETH has dropped 6.3% and currently trades at $2,252. Going forward, the smart contract token is likely going to move sideways between the ascending triangle’s base at $2,030 and the weekly resistance level at $2,539.\n\nA decisive flip of the $2,539 will open the path for Ethereum price to continue rising to its theoretical target of $2,943 or the $3,000 psychological level.\n\nETH/USDT 1-week chart\n\nEthereum’s Social Dominance metric has been trending lower since September 30, showing a decline in interest for ETH among investors.\n\nETH Social Dominance\n\nAccording to data from Santiment, On-chain Volumes saw a spike on November 10 but has been steadily slumping since then. The same can be said about Whale Transaction Count, which has also seen a decline.\n\nETH On-chain Volume, WTC\n\nWhile this is bearish in the short term, the Active Addresses have been in an uptrend since mid-September. Network Growth has also remained consistent, which shows that the investors are being patient about the mid-to-long term outlook.\n\nETH Active Addresses, Network Growth\n\nA decisive breakout above $2,539 could signal a bullish outlook for ETH. In such a case, the Ethereum price could eye a retest of the $3,000 psychological level.\n\nOn the other hand, a breakdown of the $2,030 support level could trigger a 15% crash in Ethereum price to $1,727."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxOVGpGaW1OdDZSaUl6SHh3WG96Rzc3a2p5cmZPcjJVaHpGTHlVUXpJZDF1VVBWQ3U4X0ZWV3p0MXl2bHNzWWlwRDhxNE9iVHBvMXFSc1F6azJSNHhNbVRidjJTeEpZeEt5a0tJaUtFNVdzWHFpUF9lZFlqRTBqR055akJFNTVDeUVvZUxlY251c0RVV2hlOVYycjY1MkFCT2x1cDB1d9IBqgFBVV95cUxQdUxzR2xTY2JvTzF0dTRIYWJOckhoNERHX1RZTUJFbEllSkNNQzV6emhTZTlNRTgzNFhuRC15ZmFUdEhzY3RqY0ZZWUlsMElPZFpjNmF6QU9jNU82NmtrNGZtcVNwY2hrTlhoUTdRQkFWYjRXUzk0QzREbV9HLTJ1d0dHSHJ6NTNLcWVwUzV1bS1jTm5CaDN1V1ZJUmtETDNxNHJEX0kwQkNTZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Dec 2023 08:00:00 GMT",
        "title": "Cronos Labs Unveils Public zkEVM Chain Testnet to Foster Mainstream Adoption - CryptoPotato",
        "content": "Cronos Labs, the web3 start-up accelerator behind the Cronos ecosystem, has launched a zero-knowledge Ethereum Virtual Machine (zkEVM) testnet blockchain network on top of the Ethereum Sepolia testnet.\n\nAccording to an announcement shared with CryptoPotato, the Cronos zkEVM Chain testnet is launched in an alliance between Cronos Labs, Matter Labs, engineering teams from digital asset exchange Crypto.com, and decentralized finance (DeFi) platforms VVS Finance, Veno Finance, and Fulcrom Finance.\n\nCronos Labs Launches zkEVM Chain Testnet\n\nThe Cronos zkEVM testnet is a hyperchain using the ZK Scalable Transparent Argument of Knowledge (STARK) modular framework. As it is on top of the Sepolia faucet, the chain is secured by the Ethereum testnet from a final settlement and data availability standpoint.\n\nCronos Labs claims the new chain is the first public testnet utilizing the ZK Stack framework. As a hyperchain, the zkEVM testnet runs alongside a common settlement on the Ethereum mainnet. By 2024, the network will adopt a shared native bridge to the Ethereum mainnet, enabling users to send tokens and messages while enjoying the latter’s security.\n\nKen Timsit, Managing Director of Cronos Labs, said: “The Cronos zkEVM testnet represents an opportunity for Cronos Labs and our partners, including VVS, Fulcrom, and Veno, to experiment with ZK layer 2 technology in order to prepare the next phase of growth starting in 2024. Other Cronos apps are warmly invited to join the testnet.”\n\nCronos’ zkEVM Testnet to Use TCRO\n\nThe new network uses a Boojum STARK-based ZK-proof system, which runs on general processing units (GPUs) while reducing fees. The zkEVM chain also uses TCRO, a testnet version of CRO, the native cryptocurrency of the Cronos ecosystem, to pay transaction fees. Cronos Labs said fee payments can be made in other cryptocurrencies due to the native account abstraction implemented at the protocol level.\n\n“When we introduced the ZK Stack, we opened up the door for anyone wanting to build on top of Ethereum to do so by deploying hyperchains. Whether you’re building a specialized Rollup or a general purpose one, hyperchains allow you to tap into Ethereum’s extensive userbase base and liquidity while preserving its robust security and decentralization”, said Marco Cora, senior vice president of business and operations at Matter Labs, the firm behind Ethereum-based layer-2 scaling solution zkSync.\n\nAs the latest sister chain in the Cronos network, the zkEVM testnet will ease the movement of liquidity between the ecosystem and Ethereum."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxOSGk1SnVLM2p1OTU4XzEtMEJ6b1hUVGRLZWU4Rm94aFNmQnhVNTVTTXk3c0dVSkV4cXlSSTFPZXBseFE4dHBDc3QxanU2OEhMSmlZMlpKc0RsbVY1S2U3WDNRNWdBZU9GN1VhbHQ1QUdqSjBkaGUxcGFsYWJQbXVOdlppRFJhR1NJR0hZLVE2NWwtbHFPU1d2THFIRkFXLTMtcWtYanZCVWU5dDlFa3pNZEtXUE9jekNBOHc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Ethereum (ETH) and Solana (SOL) Pave the Way for Pullix (PLX): A Trifecta of Crypto Success - TechCabal",
        "content": "The blockchain cryptocurrency industry has evolved substantially since the launch of Bitcoin in 2009. Ethereum (ETH) and Solana (SOL) are two top altcoins that have contributed to the industry’s growth.\n\nWhile Ethereum was the first to implement smart contracts, Solana expanded the possibilities by increasing scalability. Both have contributed to the emergence of Pullix (PLX), the new trifecta of crypto success. Let’s find out why Pullix is now referred to as one of the best cryptocurrencies to invest in right now.\n\nEthereum Introduces a New Phase in Crypto\n\nEthereum (ETH) is widely considered as the blockchain industry’s backbone. This is because the Ethereum network was the first to provide smart contracts and decentralized apps. The infrastructure has extended throughout the bitcoin industry.\n\nThe Ethereum network’s popularity has propelled it to the top altcoins in the market today. Ethereum (ETH) is the project that led to the idea of a decentralized future since it created the framework for the launch of many projects.\n\nSolana’s Scalability Increased the Possibilities\n\nWhile Ethereum introduced smart contracts, scalability remained a long-standing issue. In 2017, the Solana network was launched as a game changer. While Ethereum can only handle 8-18 transactions per second (TPS), the Solana network has the potential to handle 65,000 TPS.\n\nThis scalability caused the Solana coin to gain traction. It also led to a massive expansion of the network. The growth of the network has established the Solana coin as one of the top altcoins in the cryptocurrency market today.\n\nThe Emergence of Pullix (PLX)\n\nPullix is now being referred to as a trifecta of crypto success as it combines both concepts introduced by Ethereum and Solana. As an exchange, it combines the decentralization of Ethereum with the great scalability of Solana.\n\nPullix has thus unveiled an exchange platform that exceeds the competitors. As a result, the exchange functions in a safe and decentralized environment. Furthermore, it promotes a transparent trading system that eliminates intermediaries and lowers transaction fees.\n\nThe exchange’s great scalability has enabled it to enter new markets. Users will be able to trade more than just cryptos on Pullix. Users will be able to trade assets from the stock, FX, commodities, and exchange-traded fund (ETF) markets.\n\nPullix has linked its DeFi cryptocurrency, PLX, to the trading platform in order to bring additional incentives to customers. PLX token holders will receive regular passive income transfers via providing liquidity.\n\nDue to these amazing features, there has been great interest in the platform’s DeFi cryptocurrency, PLX. Over the last few days, almost a million PLX tokens have been snapped up. Fortunately, PLX is still available at a great price of $0.042 per token before its projected rally.\n\nFinal Thoughts\n\nThe combination of successful two models has made Pullix one of the best cryptocurrencies to invest in at the moment. This is the reason why it is referred to as a trifecta of crypto success. Now is a great time to join the project before its projected rally of 100x.\n\nFor more information regarding the Pullix Presale see links below:\n\nVisit Pullix\n\nJoin The Pullix Communities\n\nKeywords: top altcoins, best cryptocurrencies to invest in, DeFi cryptocurrency, altcoins, Ethereum, Ethereum (ETH), Ethereum network, Solana, Solana network, Solana coin\n\nMeta Title: Crypto Trifecta: Ethereum (ETH) and Solana (SOL) Forge the Path for Pullix (PLX) Success\n\nMeta Description: Find out how Ethereum (ETH) and Solana (SOL) have paved the way for the success of Pullix (PLX).\n\nShare this article"
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxQZFlfNjk5cmdqT1lkbm5WRFBvTVdvZzVHNUJwbEN3UTRXOW4tNXdGQm9IMFQxbFVKSk9RMDZTWEV5MVZ6dlptQkZYYllmY3o4cU83TXFZY0c1VHpBTUxzd0wwdVFFMWotOFQzQm1qVkJNQkJQOFRDTUZhcVdNTnpQNUZVaExvWTJJUGNfTnlDUGczcG9lS2o1Y2lRWWI5VjA5ZGpfTUFFREIwcGJhc1JKNlpVWlMxeHhK?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "3 Transformative Cryptos Changing The World: Ethereum (ETH), Everlodge (EDLG), Toncoin (TON) - TechCabal",
        "content": "Cryptocurrency was originally created to transform how we make payments. Now, innovative new projects like Ethereum, Everlodge, and Toncoin are taking things one step further. Each project offers an innovative new solution, and as a result could be extremely profitable for early investors. Here’s why investors should consider each for their portfolios.\n\nEthereum Continues To Pioneer DeFi Developments\n\nEthereum is the largest blockchain in the world. Over 1,500 active decentralized apps have been built on the network, with a total value locked (TVL) of over $1 billion. Many analysts believe that Ethereum is now more important than Bitcoin, and could play a more important role in the future of decentralized finance.\n\nEthereum recently experienced its largest price increase of 2023, rising to over $2,350. It has since declined to $2,232, though Ethereum’s value has still increased by 8.65% in the last month. With huge plans for 2024, including a potential spot ETF, experts believe that Ethereum’s value could surge over the next year. Predictions range from $3,000 to $4,000+, though most experts agree that Ethereum’s value will rise.\n\nToncoin Blockchain Slows Following New Protocol Release\n\nToncoin was created to provide seamless DeFi transactions, offering speeds of over 100,000 transactions per second. However, a recent issue with Toncoins transaction processing has cast a shadow of doubt around the project.\n\nLast Tuesday, a new protocol inspired by Bitcoin Ordinals caused a spike in activity on the Toncoin network. This caused the blockchain’s speed to crash to less than 1 transaction per second on Thursday, during which over 2.5 million transactions were pending.\n\nDue to congestion Tonkeeper, a popular Toncoin wallet, had to suspend its services. Later reports suggest that network usage increased by 61 times in just 30 minutes, causing issues for Toncoin. Since this setback, Toncoin’s value has fallen by 8% to $2.17, and Toncoin’s daily trading volume has fallen to $50 million.\n\nCould Everlodge Revolutionize A Trillion Dollar Market?\n\nWhile most crypto projects focus on finance or the blockchain, Everlodge applies DeFi technology to an entirely new market– travel properties. As a pioneer in this industry, Everlodge is expected to gain significant traction throughout 2024 as thousands of investors discover a new way to build their property portfolios.\n\nEverlodge looks to disrupt the travel property market by minting properties as NFTs. This is designed to streamline the buying and selling process. Once minted, NFTs are fractionalized so investors can buy a percentage of the property instead of the entire property outright. For example, a holiday home in the U.K. worth $1 million could be split into 5 fractions, after which 5 individuals can own a 20% share in the property.\n\n<blockquote class=”twitter-tweet”><p lang=”en” dir=”ltr”>We're thrilled to announce that our website just got a makeover! 💻<br><br>Check out the fresh look and discover the NEW features we've added. It's all about making your experience even better!<br><br>Plus, remember that our Presale is still ON. <br><br>Explore now: <a href=”https://t.co/SIYWBylwQD”>https://t.co/SIYWBylwQD</a><a href=”https://twitter.com/hashtag/RWA?src=hash&ref_src=twsrc%5Etfw”>#RWA</a> <a href=”https://t.co/aTuT8x7z36″>pic.twitter.com/aTuT8x7z36</a></p>— Everlodge (@EverlodgeHQ) <a href=”https://twitter.com/EverlodgeHQ/status/1716543605576241503?ref_src=twsrc%5Etfw“>October 23, 2023</a></blockquote> <script async src=”https://platform.twitter.com/widgets.js” charset=”utf-8″></script>\n\nThis unique application reduces how much an investor needs to get started, and removes traditional barriers to entry, such as location. Properties available on Everlodge will include luxury villas, hotels, and holiday homes, with plans to add more property types in the future.\n\nEverlodge is currently in stage 8 of its presale, having sold out at record rates during its previous seven rounds. Its native token, ELDG, is currently available for just $0.027, and will offer numerous benefits to holders once Everlodge officially launches.\n\nInvestors who buy ELDG tokens during the Everlodge presale will automatically be granted access to the Everlodge private members club, which will offer lucrative rewards such as free stays at properties within the Everlodge ecosystem.\n\nVisit Everlodge\n\nShare this article"
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMimwJBVV95cUxPODlsVmRTdjgxSk1UX3BWNHBWcUJVUVVtb21peTF0V2YyTmlUVkxQSWtKQUQ3S2J5eUVkMGVIcXJZV1RjTkkyTTBsS0lrWXVyd0xnM29YeDNBRm5xbUhWUWM5UnpoT2ZjVWJmcjBTZll5VWxJVml1RFl3enE3dzZ1Q21GZGM1a3FoOUpYa0NxSkktNVZqR2ZxRWd1a1ZjNlBHakkwcFJPQWFhOGN4cXFHR0NBaTZLQkR1blNqZlhFQTk0OGR1VHhFWUNGbW5LWU9JWGduZGMtTTRtcEEzd25BbUlrWk4wc1l0aTFjQnk3S1RiY19oVVp2bGVwRVVMY05UNlhHV2dicXg4T0xoZ19xV2RrNXRqRUJCVlMw0gGoAkFVX3lxTE1tMWw4MEt0VG5LOFlaanVsTHR1bTd4bmhYeGttVlMxcWxIdEd3QVVNUUdPd0F2OEYyZ1pmeVpNZEZ4MXFJSk1SamF6SzdFM3U2eHdOQU13QTd6LXRKZTNFbUJzOFBPbFphcGcwcl9HcUtMa09XR1VhUkE2UjBfY3lCcVQ4Wk9lMzVPUWVmdlFDOU42bHUtcktSQ0RMdmwwcUVrWWFnZ1I4djhiU1BRTWhNUWFrNGFvMmYwTUJhNGczRDhpRGV4MDJpOFN1cnhTRVJaWXdYeDZ0bzJvdWowS2ZBTmJ5NEI1QVNrT1ZaaHZpZ1FUREoxSUM2cWpWaTEyUXdGdXlUOUtaa3ZtN2pUdWJVaFlQakMtUzUtbU5Hc3pLUmNkYUViQjhw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Dec 2023 08:00:00 GMT",
        "title": "Top 5 Altcoins to Watch for the Next Bull Run | Best Altcoins to Buy Now? Discussing Polkadot, Solana, Ethereum, Cardano, and ApeMax - Analytics Insight",
        "content": "As the crypto community undergoes renewed bullish momentum, ApeMax's presale has continued to grow as 2024 approaches. However, as a return of optimism can be seen in the crypto space, exactly when and whether or not a sustained bull run will occur is still a matter of debate and can only be observed after the fact. Moreover, all coins, including new altcoins, can be volatile and they are ultimately subject to the supply and demand forces of the market."
    }
]