[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTFBPd1pWRzFadHYxR09HLW92QWFuUnEwUG5jQTlpY3dqdk1uLWJ5VlUtdVZhNFlhX0xjUWtSaTdGN3pndWhBZ3kzNkgza2NQaklJUE5UZDNWQjFyTEZkT2tTSlVtX0tObVpBV2c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 30 Dec 2023 08:00:00 GMT",
        "title": "271 Stories To Learn About Ethereum - hackernoon.com",
        "content": "Let's learn about Ethereum via these 271 free stories. They are ordered by most time reading created on HackerNoon. Visit the /Learn Repo to find the most read stories about any technology.\n\nThe big-daddy of the alts - a claim contested by thousands of self-professed Ethereum-Killers who unfortunately got rekt by crypto-volatility.\n\nGemini is a cryptocurrency exchange platform where investors can buy Bitcoin (BTC) and Ether (ETH) using US dollars — or just trade between BTC and ETH.\n\nDogecoin started its initial coin production schedule with 100 billion coins in circulation. By mid-2015 the 100 billionth Dogecoin had been mined though.\n\nHashKey Capital is an asset manager with three dedicated funds investing exclusively in blockchain technology and digital assets.\n\nIn our first article, we covered how to make a DeFi project successful, build a community, and organize a marketing campaign.\n\nlet's look at what Grayscale is, what this 'pump effect' is, and why it might create sagging prices over the holidays.\n\nNo, the successful trader is not me. I’ve gotten lucky a few times and I’m still refining and trying out strategies; on the other hand, I’m part of communities of people who trade on a daily basis to grow their portfolios, and while some of the results can be attributed to luck, a majority of it is based on fundamentals, good habits, and experience.\n\nHow gas fees are calculated and how to minimise the cost of conducting transactions on the Ethereum network.\n\nEither the merge happens, or it doesn’t. That is the future event we are trading. The merge itself is unaffected by the price of ETH\n\nWhat's the technology behind cryptocurrencies and blockchain? It's a magic book that's based on magic.\n\nAvoid crippling gas fees! Learn how to transfer your tokens from the Ethereum to Polygon blockchain, so you can trade at a fraction of the cost and speed.\n\nCryptocurrency is all about better currency; that is good money. Everyone in cryptocurrency is there to make money….not everyone makes it though!\n\nWhat is EIP-1559? Will this improvement proposal makes the transaction fees lower and the transaction speeds faster? Read on to learn more!\n\nFor many people, buying large amounts of Bitcoin is not a financially-viable investment strategy. But the good news is that there are now more alternatives than ever that make it easy for people to earn bitcoin.\n\nDo you remember when stablecoins were still just for hedging risks? In the crypto industry, just about anything can become a source of profit – including stablecoins. But which of the USD-pegged coins should you buy to maximize your earnings?\n\nHow to stake eth without running a node, defi solutions, staking\n\nThere are major players as exchanges that are running in a fully controlled manner. The solution recently presented itself in IDO - Initial DEX Offering.\n\nAn analysis of differentiated L1 public blockchains and why they may outperform in the next bull market.\n\nLearn what awaits crypto in the 2021st, what fosters its mass adoption, how institutional investors fuel industry, and how vaccine may influence bitcoin price\n\nBut with the skyrocketing prices of transaction fees, especially on the Ethereum network, this space craves alternatives (which we are already seeing).\n\nFind out the benefits of concentrated liquidity for multiple pooled assets in Uniswap.\n\nDigital gaming brings in about $100 billion in revenue every year. It’s projected to triple by 2022. And in almost every single one of these games, players are buying items, skins and upgrades which they don’t truly own.\n\n2020 will go into crypto history as the year of DeFi. It has been a long time since we have seen a hype of similar magnitude, probably best comparable to the 2017 ICO hype.\n\nHow to promote a DeFi and NFT project, the full guide to NFT marketing that will help to make non fungible tokens and decentralised finance projects successful\n\nChina is launching a national cryptocurrency. In this article, we’ll tell you what information is already known about the project at the moment as well as how it may change the financial world.\n\nIn this article, I explain the larger pieces of the puzzle contributing to this epic 2021 cryptocurrency bull run.\n\nThe idea for Swarm came from Gavin Wood, one of the founders of Ethereum.\n\nIncluding a code sample of this powerful tokenomics scheme.\n\nWrite a decentralized Uber using Status.im Waku and Vue.js\n\nThis article will explain how to set up a Private Ethereum Blockchain using Go Ethereum (Geth) - the official Go implementation of the Ethereum protocol.\n\nThe 3 of the most coveted indicators for crypto are now live on Aurox.. For FREE! These indicators cost a whopping $1500 but free on Aurox.\n\nWhile #cryptocurrencies and the #blockchain can practically save the world, it still has teething problems that are not shiny, that give it a bad rap and that cause trouble.\n\nProsperity not created by capitalism but through cooperation.\n\nEthereum layer 2 is a collection of solutions that are specifically designed to scale applications by handling transactions off the Ethereum Mainnet, Layer 1.\n\nInteroperability as the solution for the scaling trilemma.\n\nHere I'd like to introduce a website developed by me and my friend in order to provide a better experience for Ethereum smart contracts developers and blockchain enthusiasts - https://justsmartcontracts.dev/. But first I'm going to explain the reasons lead to creating of this website.\n\nNFTs stand for non-fungible tokens and refer to cryptographic assets that signify ownership of unique things, such as digital art or in-game assets.\n\n(A Merkle tree, as present in a typical blockchain)\n\nThe internet that most of the world sees is essentially identical. It’s called DNS, and most people understand this system to be the \"legitimate\" internet. This system is run by ICANN, a non-profit charged with determining who has the right to launch a domain extension (like a .com).\n\nLearn what the Ethereum 2.0 upgrade means, how it works, and what changes it means for the Ethereum blockchain\n\nIn this post, we are going to focus on promising cryptocurrencies that can be staked.\n\nA few days ago, I presented a webinar about price predictions for cryptocurrencies. The webinar summarized some of the lessons we have learned building prediction models for crypto-assets in the IntoTheBlock platform. We have a lot of interesting IP and research coming out in this area but I wanted to summarize some key ideas that can result helpful if you are intrigued by the idea of predicting the price of crypto-assets.\n\nFollowing part one of this tutorial, we will be building the frontend side of this project.\n\nI happened to publish an essay titled “I’ve seen the future of the web and it’s Ethereum” on the same day that between 150 and 300 million dollars worth of Ethereum was lost forever or until the next fork, due to yet another bug in Parity multi-sig wallets.\n\nthere are similarities between these three protocols, because at the end of the day, what we are all trying to deliver are the best platforms\n\nThe Ethereum community has been awkwardly quiet in the face of ETH 2.0 difficulties. Many DeFi projects are playing the waiting game on implementing layer two solutions or wait for good news from Vitalik Buterin.\n\nIn this article, I take a deep dive into Chainlink and blochain protocols, and explain why I think Chainlink is the greatest investment of our lifetime.\n\nEthereum (ETH) which was launched in 2015, and is the second most valuable cryptocurrency in terms of market capitalization, is known for its high developer activity, alongside certain other cryptos like Cardano (ADA) and Kusamo (KSM).\n\nIn this tutorial I will show you step by step how to use Remix and Metamask, which are tools that were originally built for Ethereum, to create and deploy a simple smart contract on RSK’s Testnet.\n\nWhy are we all so entitled to the Blockchain industry? For the high development pace? Of course. For the number of appearing opportunities, growing like a weed under the sun and rain? Surely. For building up an alternative financial and tech sphere? You name it.\n\nAutomated Market Makers (AMM) seem to be a faster alternative to previous models in the decentralized ecosystem, as they remove a counterparty from a trade.\n\nUse email & SMS crypto alerts to track Bitcoin, Ethereum, and other 3500+ crypto coins and tokens\n\nThis article describes how to transfer tokens from Ethereum to BSC, How to transfer tokens from BSC to Polygon, and how to transfer from Ethereum to Polygon.\n\nPut tokenized items for sale in a decentralized classifieds board\n\nBitcoin users are often unable to explore the decentralized finance market segment. The vast majority of platforms in existence today are built on Ethereum. Even though the BTC and ETH blockchains cannot communicate directly, wrapped tokens can offer a viable solution.\n\nYou’ve never heard of Yuji Ijiri. But back in 1989 he created something incredible.\n\nHow Can Casper Network Make Up for ETH 2.0 Delays\n\nMy journey from turning 2k to $2m+ in 16 Months Using Brand, Opportunity, and Technical Analysis. Stacking Ethereum and Bitcoin and working hard.\n\nIn 2021, we've seen the rise of blockchains challenging Ethereum, all-time highs, the NFT craze, new milestones, and a step to mass adoption of cryptocurrencies\n\nAt the end of 2018, I was analyzing the reasons for the bear market in cryptocurrency. It is interesting to look back and check if something has changed. Potentially it could let us predict future movement and development.\n\n[61. Ethereum.org's New Art:\n\nRethinking Identity as Community](https://hackernoon.com/rethinking-the-identity-of-ethereumorg-l718w347l) Today, I am excited to launch the first new artwork for the website of ethereum.org. Every few months, the website will be updated with new artwork that reflects a new aspect of Ethereum's identity. The concept of the work focuses on one of Ethereum’s major strengths: the community.\n\nTrading volume on Binance increased by 30% on February 10, then by 70% on February 18 against Ethereum\n\nTechnology should serve humans. But when combined with the wrong business model, it can turn individuals into non-player characters in a game dominated by tech.\n\nFor the purpose of this, we’ll be using a basic ERC20 smart contract I created called JavaToken you can find here. We’ll be using it and the repository it’s in for demonstration purposes, so feel free to clone it and follow along! The network we will be deploying and running it on will be a local Ganache Testnet using Truffle.\n\nRecently I decided I would like to get a bit more into Ethereum development, as blockchain technology had always interested me but I never got around to actually making a project with it. With Android being my favorite environment, I decided this would be my platform. However, upon starting I noticed it was quite difficult to find much information about Ethereum development in mobile, leading to the creation of this article, where I’ll show you how to make a simple Ethereum application using web3j on the Ethereum Testnet Rinkeby.\n\nMessaging is a core feature of the internet. It was described as the internet’s killer app. It enabled anyone to communicate with anyone else in the world instantly, and for free. Billions of people chat every day.\n\nThe term hackathon is a compound word, a fusion of hacking and marathon, where hack is used in the sense of exploratory programming.\n\nChina aims to improve the global scaling limitations of Bitcoin and Ethereum with Blockchain 3.0 technologies.\n\nGoogle became popular by taking a nebulous, disorganized, and opaque landscape (the internet) and making it easily searchable. Now, the tech giant wants to do the same thing for a similarly novel technological advancement: the blockchain.\n\nA journey marked by crypto collectibles and highlights of lessons learned along the way.\n\nThis tutorial will teach you how to build a decentralized blockchain application from the ground up that will interact with a ReactJs frontend.\n\nThis article talks about DAOs, ethereum scaling and why DAOs will be the future of governance.\n\nData and content management are two of the main capabilities in many of the real-world business applications, such as information portals, Wikipedia, and ecommerce and social media applications.\n\nHow to Understand the Latest DeFi \"Hack\" in 3 Steps\n\nThis interview talks about the rising ethereum transaction fees, cross-fi staking and cybersecurity for blockchain startups.\n\nLearn how to stake Ethereum 2.0 independently with non-custodial Launchnodes. We dive into Ethereum staking on AWS and benefits of having no intermediaries.\n\nOn June 26, 2020, the value locked into the Compound protocol reached a staggering $1 billion, making it the \"most valuable\" decentralized finance protocol. In the past year, DeFi became the hottest topic in the crypto. Let's take a close look at one of its most popular projects.\n\nEthereum is holding top rank 2 by replacing Ripple, and it becomes possible because of growth in Ethereum adoption. There were many coins on the rank 2 but none permanent, which shows that it may be possible that Ethereum can get replaced by other innovative coins.\n\nThe developer experience for Web3 is rife with inconveniences, including bloatedness, lack of protocol standardization, limited support for other platforms, and many more.\n\nSource: https://brunch.co.kr/@curg/20\n\nWhile the lending market craze is plummeting and the “yield farming” opportunities are not as profitable as they were in the beginning, you might be looking for new ways to put your money at work.\n\nHow to code a minimalistic NFT contract on the Ethereum blockchain in Solidity\n\nWe hear this all the time: a new analytics platform or study that uses machine learning to analyze crypto-assets. However, when we dig a bit deeper, instead of cutting edge machine learning we find simple statistics or basic algebra glorified as a sophisticated analysis.\n\nPredictions for Crypto industry in 2021: DeFi, DEX, STO, ETH 2.0, CBDC and everything that can affect crypto / blockchain world and can help users and projects\n\nDeFi industry is stepping forward at a great pace. Currently it appears to be the largest tectonic plate covering the Blockchain sphere and you have to be fully prepared.\n\nEvery crypto and DeFi enthusiast knows what difficulties he might face during blockchain project development: strict regulation, a public opinion upon the entire industry, lack of assets security. However, let’s ask ourselves a question: What stands above all of it? Uncertain future of Digital Finance? Hardly. Dependency on the Bitcoin rate? Partly yes, but recent cases show that it's not always the main factor.. Another thing came across my mind because I work a lot on the promotion of crypto and DeFi projects.\n\n(bait for ethereum lovers)\n\nI used two old Nvidia GPUs to make over 1000$ in a month using the Livepeer network, built on Ethereum, to perform video mining.\n\nStory of how I tried to become a cyborg, but with a geeky twist\n\nOR: Decentralized Exploitation, a cautionary tail about Blockchain.\n\nNothing lasts forever, but the current crop of economic “isms” all believe that national economies must and can grow ad infinitum.\n\nThe second-largest cryptocurrency in the world is implementing a network upgrade, which completely changes its value proposition as a financial asset.\n\nWhen investing into cryptocurrency you want to look for projects that will make the biggest changes within an industry. This is why I prefer coins like ETH, BAT, LINK, XLM, ONT and NEO.\n\nOne of the most promising foundational constructions to build layer 2 solutions are optimistic rollups. Many projects are built upon them\n\nEthereum is scaling. Why do we need Layer 2 and what does the near future promise\n\nProject Serum is a brand new decentralized exchange (DEX) for the decentralized finance (DeFi) sphere from the same team that created FTX Exchange. It is said to test the boundaries of DEXs using a non-Ethereum blockchain.\n\nReddit’s vision for MOON tokens and the Community Points program is to encourage high-quality posts, discussions, and engagement\n\nIntroduction\n\nOnce Ripple was identified as the incumbent to a brave new world of practical cryptocurrencies. Speculation was rife that Ripple’s XRP coin had the potential to overtake Bitcoin in terms of usage and utilise its swift and cost-effective transaction framework to take the world into the future of practical digital currency.\n\nProof of Work is an important aspect of the cryptocurrency solution. Here are my favorite Proof of Work cryptocurrencies.\n\nCoinList has an excellent lineup of token sales. They vet each project and provide a good opportunity for investors to get in early on exciting crypto startups.\n\nEthereum 3.0 + Layer 2 Management DAO opens the window for the real-world economy to run on top of the blockchain. What are you still waiting for?\n\nWhy bear market presents the best opportunity to make money from cryptocurrencies and which coins are worth considering.\n\nEthereum 2.0 is just around the corner, with a rumored release on Ethereum's 5th Anniversary on July 30th 2020.\n\nLayer 2 scaling solutions remain a notable tool in the quest by crypto developers to solve the blockchain trilemma.\n\nIntroduction\n\nIn this article, I explain how I went from no coding experience to creating my first decentralized application on Ethereum.\n\nIn this guide, we'll be diving into solidity vulnerabilities and exploiting a solidity constructor.\n\nBlockchains are transaction machines. But on-chain data represents value-at-rest — confirmed transactions. While pre-chain, or mempool, data explores value-in motion — transactions in flight.\n\nPolkadot is currently the leading, highest value, and most secure PoS platform, offering estimated rewards of 13.87% per year.\n\nSmart contract platforms are often considered to offer better long-term investment potential than pure cryptocurrencies. Despite Bitcoin now being more than ten years old, cryptocurrencies continue to face criticism for their speculative nature. On the other hand, a development platform can derive long-term value from the various projects built on it.\n\nStaking cryptocurrencies has largely become a primary form of earning passive income in the crypto space and staking pools have become more popular than ever.\n\nA piece providing a straightforward means to host websites on Web3.0 for both beginners and experienced Web2.0 devs.\n\nDecentralized prediction markets are smart contracts that stipulate who gets paid how much when certain predefined conditions are met.\n\nAn analysis of cross- chain asset bridge mechanisms. Ethereum scaling solutions Polygon vs optimistic and zk rollups compared\n\nThe first episode of this series describes Determinism. This article will explain the most fundamental principle each and every blockchain follows by design.\n\nAfter months of anticipation, Cryptex announced the launch of TCAP, The World’s First Total Cryptocurrency Market Cap Token.\n\nIn this article I’ll introduce an implementation for Singly and Doubly Linked Lists, which you can reuse or modify for your own purposes. All the code is available in github or as an npm package.\n\nI have been searching for a web browser to naturally block advertisement on websites. Often, advertisements can contain trackers and sometimes even malware. Have you ever had a conversation with someone and next thing you know you see an advertisement for the thing you were talking about? Maybe it’s confirmation bias, maybe it’s that you are so predictable from your browser habits that the big data algorithms detect what your next move will be. The above situations are, of course, hypothetical; however, what if we didn’t need to think about pesky advertisements? What would feed us suggestions for our next purchase? I digress…\n\nHuge changes for Ethereum are on the horizon. We have Eth2, EIP 1559, and Layer 2 scaling. Here, we explore how they influence ETH tokenomics and price.\n\nWhat do Finance guys do? They do nothing.\n\nMaking profits in crypto is all about being early. In this article I present my thoughts on 6 trends which are likely to explode in 2022.\n\nThis article talks about cross-chain DEX and how different blockchains such as Solana are distributing the smart contract industry.\n\nLearn how to code a viable application for Ethereum in ten minutes.\n\nI bought an ENS domain NFT to receive payments to a .ETH wallet easily. This story explains what I went through and what you need to too.\n\nTo see the contract that uses CREATE2, jump to Step 2.\n\nBesides crying, screaming, and other self-destructive behavior.\n\nHow to Write Upgradable Smart Contracts\n\nI see blockchain gaming as the future of video games. I also consider it the best possible vehicle for the road to blockchain mass adoption. What better way to teach people about blockchain than giving them hands-on experience that allows them to see and understand its benefits in real-time.\n\nHey everybody, this is the second post of the series on writing apps the Git way, where you just go take a cup of coffee and browse a Git repo to learn something new!\n\nPolygon, ZKSync, and Arbitrum are just some of the dApp platforms you should be following in 2021.\n\n2020 has been quite challenging for a lot of people. When the year started, the COVID-19 pandemic hit, and the majority of nations went into lockdown, which caused the global economy to plunge. A number of important industries have been negatively affected, and one of the sectors that suffered the most was the real estate space.\n\nHey dapp developers! Today I am excited because I am posting the step-by-step process that allowed me to deploy my first Ethereum smart contract on the Ropsten testnet.\n\nHarmony Protocol has already approved 21 proposals to be part of its $300M Ecosystem Fund in January 2022.\n\nBusinesses, to stand out from each other, are coming out with different blockchain approaches targeting different sectors. Blockchain initially hit the financial market when it was introduced, followed by data management, software development and more.\n\nNFT\n\nMoney in the Crypto market flows in a predictably cyclical manner.\n\nBlockchain technology continues to progress at an incredible speed. This great technology behind cryptocurrencies continues to move at the same pace.\n\n2019 has marked itself not only with the end of the crypto winter but also with time when established technology companies entered the blockchain field. Telegram is going to release its own blockchain with the goal of processing millions of transactions per second. Facebook plans to introduce Libra coin to facilitate payments for 1.7 billion unbanked but connected people.\n\nMost of the common blockchain audience has by now heard of DeFi, and the implications it has to those who know how to utilise it - but one thing that hasn't been greatly explored is Price Oracles and their impact on these applications.\n\nEIP-2981 introduces an easier method for enabling royalties for NFT projects. Learn all about this royalty standard and how to implement it in this article\n\nBitcoin and Ethereum differ in many ways. In this article, I will cover one of their differences: the way they keep track of what coins a user owns.\n\nEver watched Ready Player One and wondered what it would be like to have the same thing in real life (well you know what we mean)? Play around a virtual casino,\n\nAt its core, Polkadot is a highly scalable and fully interoperable blockchain protocol upon which the next generation of the web is being built.\n\nArticle written by Vincent Le Gallic - CTO @Rockside\n\nIn this article, we are going to build a simple Ethereum wallet from scratch using Python. During the process, we will use some cryptography and try to interact with the Ethereum blockchain. In part 1, we will generate a key pair which is compatible with the Ethereum protocol, obtain the Ethereum address from the public key and encrypt the private key using a password.\n\nPublic blockchains enable us to build decentralized web applications (Dapps) that are censorship-resistant and have built-in economic incentives.\n\nAs the Polkadot blockchain ecosystem continues to grow, we take a look at four promising DEX platforms and protocols that are offering innovative solutions.\n\nPrerequisites\n\n2020 was great for Non-Fungible Tokens. This market gained volume, fame, and infrastructure. But what all the buzz is about? And what can we expect in 2021? I want to make it clear and to share my thoughts about the future of NFT.\n\nWhich blockchain protocol is best poised to challenge Ethereum? Here we review Radix, Polkadot, Elrond, Algorand, and Avalanche.\n\nMaybe you have noticed that there is a lot of fake Binance, Ethereum, Ripple and Bitcoin Cash streams on Youtube lately. The crazy part is that those live streams are on a big accounts with thousands of subscribers.\n\nJapan is among the leading blockchain hubs in Asia, and arguably, the world. Its embrace of blockchain technology is one to be emulated by any country wishing to adopt blockchain holistically.\n\nThis is the story of dOrg’s evolution from a few passionate engineers to a heterarchical network of builders developing industry-leading Web3 software.\n\nA step by step guide on how to begin the process of investing in cryptocurrency.\n\nAvoid crippling gas fees! Learn how to transfer your tokens from the Ethereum to Polygon blockchain, so you can trade at a fraction of the cost and speed.\n\nEveryone knows about the time in 2017 and early 2018 when bitcoin hit over $20,000 USD and Ethereum was sitting nicely at $1,300+. In fact, the total market cap for coins and tokens listed on CoinMarketCap, had just ticked over $800,000,000,000. Everyone was going to be a millionaire.\n\nOriginal Image by ipopba from Getty Images Pro\n\nSetting up your dev environment for Ethereum development takes just a few minutes. It’s important to have a basic understanding of a few general concepts before we start writing code.\n\nHello guys, if you are thinking about how to become a Blockchain Developer in 2020 and looking for some online courses to startwith then you have come to the right palce.\n\nTLDR: IBCO is the new primitive for crypto projects funding, solving for the main issues of ICOs such as lack of accountability, lack of liquidity and flawed price discovery mechanics for the token itself.\n\nVery little has changed the last couple of decades when it comes to real estate practices. Buying and selling a home today is much like what it was fifty years ago. It's more or less the same process as when our grandparents' generations purchased and sold homes.\n\nPolkadot has been one of the most talked about blockchain projects in recent times. A host of innovative blockchain projects are being developed within the Polkadot ecosystem.\n\nLearn how an Ethereum smart contract can pay your kids, employees, or whomever quickly, fairly, and automatically. No more banks, no more headaches.\n\nWhen looking at Ethereum, there are some good things I can say about it and some bad. Ethereum did early stage investors in their ICO right, in the fact that the 2014 ICO price was $0.30.\n\nWith over 9 million transactions AdEx Network is currently the largest payment channel network on Ethereum. Here's how we did it\n\nLearning a new technology can certainly be overwhelming, especially when you’re a developer who already has a lot on your plate. But when it comes to looking out for the future of your career, even the busiest of developers should understand how important it is to stay current with the newest developer trends. Blockchains have, quite simply, revolutionized many spaces thanks to the implementation of dApps. But can blockchains stay at the forefront of revolutionizing technology if it becomes stagnant? Blockchain primitives will have a huge impact on the ever-changing development of distributed ledger technology, and it will all boil down to one thing: protocols.\n\nPublic blockchains involve active participants (miners, validators, node operators etc.) to contribute towards the common goal of strengthening the network and confirming transactions through some sort of distributed consensus algorithm.\n\nWith the rising popularity of cryptocurrency, the rise of a new generation of crypto-lovers has also fueled the growth of a new beast: non-fungible tokens.\n\nThe way the world interacts with visual art is changing. As we move towards a more digital state, it is no surprise the way we create, consume and collect art has followed suit.\n\nHi folks! In this tutorial, we are going to learn how to create a simple REST API to interact with the Ethereum blockchain using Golang.\n\nThere are a lot of different gambling platforms out there. But there is almost no project that offers a transparent and fair experience. Let's fix that!\n\nYou decide who does what with your smart contracts\n\nDracula Protocol is a suite of smart contracts which aggregate major DeFi yield farms and liquidity mining platforms through a single smart-contract.\n\nThe purpose of this state of the union is the criticize aspects of the Ethereum project and bring awareness to fixable issues while combating general ignorance of cryptocurrencies and the blockchain.\n\nA look at DeFi projects that have a technological foundation due to their Blockchain proposal within the crypto ecosystem, with a low Fully Diluted Market Cap\n\nChainlink(LINK) has been one of the best performant crypto assets in 2019 and one that remains an enigma for most crypto investors. This is partly because Chainlink is not a general purpose cryptocurrency but rather a programmable token focus on one of the biggest use cases for decentralized applications(DApps): integration.\n\nEverything you need to know about Option Protocols in DeFi\n\nNFT journey on Ethereum began (Yr 2015) much early than the birth of Cryptopunks. It was not until late 2017 with the launch of Cryptokitties that created public awareness around NFTs and excitement on its future prospects. The entire scope of Cryptokitties gameplay revolve arounds collecting, breeding, and auctioning kitties.\n\nThis article talks about a new token standard that can be used to deploy bonds on the ethereum blockchain. Known as ERC-3475.\n\nThe roaring popularity of blockchain technology owes a great deal to the brilliance of smart contracts. Conceptualized by computer scientist Nick Szabo in 1994, a smart contract can be considered to be a set of instructions (usually in the form of a computer program) which automatically execute when the terms of a ‘contract’ are fulfilled.\n\nIt always seems impossible until it’s done. — Nelson Mandela\n\nCryptocurrencies, although the best assets of the financial world, have since inception in 2009 seen their fair share of volatility-related issues. Bitcoin has historically been the most volatile of all crypto assets.\n\nA review of the benefits and risks of decentralized software solutions in general, and blockchain-based solutions - such as NFTs - in particular.\n\nThe cryptocurrency market is heating up and many are calling 2020 Bitcoin’s next “bull run” year.\n\n*This article contains some referral links\n\nNothing in this document constitutes financial advice.\n\nAn RTS game on Ethereum… WHAT?! That's possible?!\n\nThat’s exactly what the Dark Forest, an innovative blockchain game named after Liu Cixin’s eponymous second novel of the Remembrance of Earth’s Past trilogy, is. In fact, it is the first real-time strategy game running on Ethereum in existence.\n\nEthereum development, while still very nascent in feel, has come a long way. When I started developing Solidity smart contracts and Ethereum dapps in 2017, Truffle and Web3.js were the industry standard. These are great tools and I have tons of respect for the people that built them. However, anyone who has used them has dealt with bugs and sometimes poor developer experience. There are a few new tools out there that have clearly been inspired by these first sets of tools and made the developer process much better.\n\nI hope you enjoyed your bear market baptism.\n\nThe world witnessed some of the massive DeFi hacks in 2021 on some of the most renowned protocols like bZx, Cheese Bank, Harvest Finance, Value Defi, etc.\n\nRandom numbers in Solidity for Ethereum using the Niguez Randomity Engine\n\nThis article will guide you through running ETH2.0 Beacon Node with Lighthouse client on MacOS if you have barely to 0 experiences with Terminal command lines and you want to spin off Lighthouse Beacon node and join the validator pool on ETH2.0 Beacon chain with Lighthouse client. This guide includes spinning off Nethermind Goerli node.\n\nThis solution provides a level of security that is enough to automate critical decision making in any DAO such as automatic protocol modification or even autom\n\nOn March 04, 2020, India finally got the trigger for the resurgence of its crypto ecosystem. The ruling came a stifling two years after RBI banned banks from facilitating banking services to crypto exchanges.\n\nThis is a written version of the talk I gave at WAQ19. Watch the video with English captions on YouTube.\n\nIntroduction to BlockDAG - a technology that can go hand-in-hand with blockchain but also acts as a new meta-technology that challenges it.\n\nAs of today, there are over 24 layer-1 blockchain projects just within the first 100 listings in coinmarketcap.com. Guess, what? Each of them claims to be the “next-big-thing”, still they are just a broken iteration of one other.\n\nEthereum is a blockchain with a built-in Turing-complete programming language. It allows anyone to create a decentralised application, by making use of Ethereum smart contracts.\n\nThe mother of DeFi is Etheurem, but the true DeFi platform the world needs now is Bitcoin-based, which follows the original idea of Satoshi Nakomoto.\n\nIn this post we'll look at 10 affordable NFT projects on the Ethereum blockchain.\n\ntldr; Below is a hefty and yet still somehow high-level overview of Ethereum. The roughly 5-year-old project has emerged as one of the most exciting and proven projects in the cryptocurrency space while somehow still encompassing the most risk and arguably, upside of any crypto-project. This dichotomy has allowed Ethereum to act as a sort of magic mirror for those in the industry. Fanboys and detractors alike can look into the project and see what they want to see: the 2nd-most successful crypto-project with product-market fit and an army of developers behind it or a nascent, experimental Frankenstein so complicated it would make Rube Goldberg blush.\n\nImage Credit: UnsplashThe endless possibilities of cryptocurrencies have seen a lot of businesses show interest in the token economy and the overall blockchain space.\n\nMost of the applications on Ethereum are micro-financial ones where the price per ticket ranges from $100 — $1000.\n\nEthereum (ETH) supply is becoming scarce while demand is rising. Here's what you need to know.\n\nHow the Internet Computer promises to serve as a decentralized, scalable layer for Web3 and blockchain-based gaming.\n\nThe future is now, it's 2020 and Decentralized Autonomous Organizations (DAOs) are experiencing a Cambrian explosion.\n\nTypically in an enterprise, you have top-down hierarchies as the mechanism of control. Let's look at a quick example of how a DAO works differently in action.\n\nImagine you’re building a startup, except at this startup, there is a clear sense of organization without humans organizing other humans. It all runs organically, and it's generative in nature, meaning it evolves, innovates and experiences high growth from within.\n\nLeaderless leadership!\n\nHow is such a way of working together achieved?\n\nThrough active participation from interested parties who share common values, missions and objectives. People-driven autonomous organizations happen mostly through voting on decisions that are proposed by other community members.\n\nYou can propose, vote and discuss decisions as a team without having to have a singular authority to report to. Resulting in new ideas being seeded and proposed from within the organization to solve mission-critical challenges that the DAO is facing.\n\nIt's really a synthesis of innovation and ambition, it's great!\n\nWith that said there are certainly some balanced benefits and drawbacks about this model that we should explore.\n\nFor the moment DAOs function in a fairly binary nature, you vote on proposals that you or others have submitted, typically these votes take place on blockchains by signing a transaction with your crypto wallet. That means the current state of DAOs is experiencing the highest growth in the blockchain industry. So whilst DAOs are now, they might be somewhat gravitating around the future of money.\n\nHowever crypto-centric it is right now, it is definitely laying out an exceptional framework that any organization type could be built upon. We are seeing many other non-crypto DAOs emerge too, using platforms like Aragon to create a DAO in minutes on the blockchain. This is achieved by creating a Governance Token on the Ethereum blockchain. When users hold these Governance Tokens they can vote on proposals put forward to the community.\n\nThese communities can even have treasuries where the DAO can organize their finances. For example, members that hold these Governance Tokens can suggest making a payment, creating a vote inside the community so it can be approved or denied collectively.\n\nThere are many lessons to learn about how to coordinate large groups of self-interested people.\n\nI recently wrote an article, \"Failure shows us the way\", where I outlined my thesis on how I think we can even coordinate groups who don't explicitly share the same values, they instead just share the same mission. It's going to be very interesting to see what unfolds with the DAOs that are experimenting right now.\n\nWhy are DAOs exploding right now?\n\nBasically there is an entire unstoppable movement happening because of projects offering up a Governance Token as a bonus to those who are using some Decentralized Finance (DeFi) applications.\n\nI've heard many stories from folks achieving incredible results in less than 5 days. For example, \"With YFI I earned like $3.5k on $24k\", one community member shared with me.\n\nThat example is a 14.58% increase in capital in just five days, no wonder it's getting attention.\n\nWait, how are people making money from these Governance Tokens?\n\nIn the DeFi world, there is a new meme known as Yield Farming 👨‍🌾 its technical name is Liquidity Mining.\n\nThis is where a user deposits crypto stablecoins like USDC, DAI & USDT to earn a reasonably safe and secure return, which lately seems to be roughly 8% APY. As well as this, these DeFi applications which have newly formed their own DAOs to oversee their protocols, are rewarding users with Governance Tokens when they have funds deposited into their various DeFi products.\n\nThis has added rocket fuel to the DeFi community, with an explosive $3 Billion USD flowing into projects in just the last couple of weeks. This doesn't stop here either, there are many more DAO innovations that will be made known during this wave of Governance Tokens. One example is Referral Yield Farming, where you can earn Governance Tokens for referring people to DeFi platforms without having to deposit any funds of your own.\n\nArt101 announced a Vitalik Buterin NFT collection 'Based Vitalik'\n\nThere is no doubt that the crypto space is growing at a very rapid pace, but no one can ignore the scams that are prevalent in this ecosystem. If we just go back a few years, more than 80 percent of the ICOs were identified as outright scams in a study conducted by the ICO advisory firm Statis Group.\n\nWhile Vitalik Buterin is the most well-known name in the Ethereum space, the birth of Ethereum was a collaborative effort, as were later developments like ERC-20. Fabian Vogelsteller is one-such early Ethereum developer and thought leader on blockchain technology. He has built many Ethereum user and developer-facing projects including the Ethereum Mist browser, the Ethereum Wallet and web3.js - the Ethereum’s space most used JavaScript library.\n\nTogether with Vitalik Buterin, he proposed the ERC20 token standard, which initiated the world ICO wave and redefined investment and crowd ownership as we know it. Today Fabian is leading the concept, design, and development of the LUKSO Blockchain.\n\nPolkadot is a radically different approach to blockchain scaling. But have solutions like Binance Smart Chain already made it unnecessary?\n\nDue to a clogged network, Ethereum just got an expansion — but at what cost? Here's everything you need to know about the ethereum gas limit debate.\n\nThe other day I got myself in a situation where I needed to communicate with the Ethereum network using python in an environment where getting web3.py to work seemed pretty much impossible. Since I still needed to talk to the network, I resorted to using the JSON-RPC API provided by Ethereum, which all web3 libraries are built on top of. Turns out, it’s pretty interesting! So, let’s get started!\n\nIf you’ve been in the cryptocurrency and blockchain community for a while, then you’ve surely heard the phrase “we just need a killer app” to get crypto into the mainstream. Now, as you’ve most likely also noticed, many of the current decentralized applications that are out there have great ideas backing them — perhaps even revolutionary ones — so why aren’t any of these dApps achieving widespread use? Why aren’t they, or one of them, the “killer app” that we need? I certainly don’t think the gambling dApps topping the daily usage tracking charts would constitute such an app.\n\nCompanies can determine whether they should invest in blockchain by focusing on specific use cases and their market position.\n\n“I need a no-code platform to build my own web3 product!” Is that you? If so, discover the right tool for the job from creators of a no-code web3 platform.\n\nBlockchain is a part of a trustless digital solution.\n\nBlockchains depend heavily on network effects, i.e. the notion that networks such as telecommunication services, the Internet, or social networks become more valuable when their number of users grows. This is why ecosystem building is one of the main factors that drives the value of a Layer 1 blockchain enterprise. Here is a comparison of how different blockchain projects handle this.\n\nzkEVM is said to be the crown jewel of Ethereum scaling schemes. Our 5th article compares and contrasts popular zkEVM solutions and proposes several questions.\n\nThe article discusses lottery pools, the use of Bitcoin as a currency for lottery and why Ethereum is not ready to be used for the lottery.\n\nSantadao $HOHO — whatever the F this is, rugpulled, which isn’t a surprise. $200K has been stolen. Many influencers were posting about this one, casually, as they’d about any other.\n\nWhen launching an NFT collection, marketing strategy is the key driver of success.\n\nBitcoin and Ethereum have been around for many years - in almost ten years Bitcoin came a long way from digital money for geeks and a token for drug dealers to a billion-dollar asset.\n\nHere's how to create your own NFT contracts without needing to have any prior experience with programming using no-code tools available to the public.\n\nCentralized exchanges remain one of the black boxes of the crypto landscape. Despite being a gateway into the world of decentralized finance, centralized exchanges are very…well…centralized in nature and hide many of its intrinsic mechanics from the scrutiny of public blockchains. Not surprisingly, ten years after the creation of Bitcoin, the internal architecture of centralized exchanges remains a mystery to even the top experts in the crypto market.\n\nPhoto by Cláudio Luiz Castro on Unsplash\n\nCentralized exchanges are, arguably, one of the most challenging components to analyze in the crypto-asset markets. While the behavior of many actors in the crypto space is transparently recorded in distributed ledgers, centralized exchanges still operate largely off-chain only publishing subset of the activity to the corresponding blockchains. Without a doubt, centralized exchanges introduce a level of opacity that challenges even the most sophisticated analytic techniques. And yet, the analysis of the behavior of centralized exchanges can yield many interesting benefits for crypto investors and traders. Imagine that you are able to effectively track large crypto transfers between exchanges that can anticipate a large position on a specific crypto asset. All that, however, requires understanding the underlying patterns in centralized exchanges.\n\nThe global healthcare crisis caused by COVID-19 has severely impacted the financial markets. From stocks to commodities, industries are in disarray.\n\nCryptographically, the brave may not live forever, but the cautious do not live at all.\n\nThis article is about a Web3 company called YellowCard that has a crypto exchange app platform for bitcoin, ethereum and others, based for the African market.\n\nIn this interview, we discuss Grim Reaper's crypto story, the reason for his anonymity, crypto mining, EIP 1559, and more.\n\nIf you’ve noticed a dramatic slowdown in the Ethereum network, you’re not alone. Here’s why it’s happening – and why it’s about to get a whole lot worse.\n\nSometimes the EOS platform is advertised as an ecosystem that doesn't require any fees for making transactions. Technically, it is true. However, if you try to make an EOS transaction you will eventually find out that you need to put some of your EOS coins on hold.\n\nDecentralized fundraising and the ability to raise money “independently” from VCs and funds has always been a deeply rooted ideal in the crypto sphere.\n\nDeFi or decentralized finance is a growing sector in the blockchain and cryptocurrency space that defines an ecosystem of decentralized applications providing financial services with no governing authority.\n\nIt’s time to make a DAO! Anyone can make their own DAO with Aragon or DAOstack, or just by forking Molloch. Even better, you can use an augmented bonding curve to fund your DAO, thanks to the amazing work by the Commons Stack folks, and there you have it! A fully-functioning DAO with just a few days of work!\n\nAfter the global economic crisis of 2008, the question of trust in the modern international financial system arose globally. The answer to this request was the emergence of the first decentralized Internet system — Bitcoin, which from “decentralized” money turned into a valuable financial asset by 2020.\n\nI guess the first question is, Why? Why should an internet community become a DAO?\n\nAll but the simplest of Ethereum applications are composed of several smart contracts. This is because of a hard limit of 24KB in any deployed contract, and because your sanity will slip away as the complexity of a smart contract grows.\n\nCentralized crypto exchanges are the most important black box of the crypto ecosystem. We all use them, we have a love-hate relationship with them, and we understand very little about their internal behavior. At IntoTheBlock, we have been heads down working on a series of machine learning models that help us better understand the internal of crypto exchanges. Recently, we presented some of our initial findings at a highly oversubscribed webinar and I thought it would be elaborate further in some of the ideas discussed there.\n\nThe following are not my beliefs, but a compilation of notes from conversations I had with a self-described Bitcoin “mutant”, named Edan Yago, contributor to Sovryn. Letting him ramble on about Bitcoin resulted in mesmerizing, mythical, and fascinating ruminations about Bitcoin’s destiny. So for one, I myself believe in Bitcoin as a digital store of value. It is a huge chunk of my portfolio, and I believe it will outlast 99% of the cryptocurrencies we have today. There is no better symbol of scarcity and hard money in crypto to date. However, I feel just about the same level of admiration for Ethereum, as it is opening up so many use cases through DeFi and DAOs. I am putting my biases aside to explain a very rare (and what I find fascinating) point of view. I present you Part 1 of The Hero’s Journey of Bitcoin:\n\nFirst things first, it’s called Vyper, not Viper.\n\nThe go-to blockchain for decentralized finance is still Ethereum (ETH). It has the great advantage of being a first mover, so plenty of investors are already aware of ETH and its use cases. ETH tokens also played a role in the tokensale bonanza of 2017 and 2018, and are now becoming highly active again in their new role as the backbone of the DeFi market.\n\nAbout the writer\n\nMoney is a social tool to achieve cooperation among a group of people. Through history, the form of money has evolved from collectibles to coinage to currency issued by fiat. Money often reflects the values or politics of the communities that issue and use them.\n\nA list of basic blockchain terms every beginner should know.\n\nAre NFTs really harmful to the ecosystem? Read on to know more about the this statement, which is dismissed by facts, stats, and numbers.\n\nSmart Contracts are immutable, transparent, secure, and decentralized. Follow this example to learn how to write them with the programming language solidity.\n\nWe have all heard stories of crypto traders losing over 50% within weeks or even days. This is what happens when amateurs do not know how to control risk. Options when used correctly can help you combat crypto market volatility and even profit from it. I am going to share 3 strategies that professionals use daily.\n\nI am going to show the function of reading Ethereum Smart Contract by Elixir&Rust in this article\n\nHow Ethereum’s composability created the most innovative ecosystem to date.\n\nGoogle, Internet Stocks and Ethereum\n\nSignificant Changes Coming to Ethereum\n\nDecentraland, Gods Unchained, and Cryptodads are among the best Ethereum NFT projects to follow in 2022.\n\nToday's most popular and promising practical application of blockchain technology is the payment field.\n\n\n\n\n\nEthereum is a general-purpose blockchain that is more suited to describing business logic, through advanced scripts, also known as smart contracts. Ethereum was designed with a broader vision, as adecentralized or world computer that attempts to marry the power of the blockchain, as a trust machine, with a Turing-complete contract engine. Although Ethereum borrows many ideas that were initially introduced by bitcoin, there are many divergences between the two.\n\n\n\n\n\nThe Ethereum virtual machine and smart contracts are key elements of Ethereum, and constitute its main attraction. In Ethereum, smart contracts represent a piece of code written in a high-level language(Solidity, LLL, Viper) and stored as bytecode in the blockchain, in order to run reliably in a stack-based virtual machine (Ethereum Virtual Machine), in each node, once invoked. The interactions with smart contract functions happen through transactions on the blockchain network, with their payloads being executed in the Ethereum virtual machine, and the shared blockchain state being updated accordingly.\n\nblockchains offer the simplest means of keeping self-audited immutable records without having to use any third party service.\n\nMany of us have come to know about decentralized finance (DeFi) and have faced this sector with many doubts, understanding its potential, especially given the interests and the APR and APY it provides to those who interact with the various protocols.\n\nThe #creatoreconomy is changing quickly with the influence of #NFT #Crypto and #blockchain.\n\nThe two latest thrilling things in the Ethereum ecosystem are NFT and DeFi. Until 2020, these \"Money LEGOs\" were quite isolated from each other but became the arena of many new projects, innovations, and volume records. And I'm sure that there's more room to grow and blend.\n\nNowadays, binary options trading has transformed into one of the most popular financial products of the Internet era.\n\nEthereum, the world’s first and dominant smart contract platform, has the largest dapp ecosystem with more than a million deployed smart contracts and hundreds of millions of dollars in monthly transactions\n\nThree example configurations for the new OpenZeppelin access control contract.\n\nEthereum's native crypto asset Ether will increase from $3,077 to $32,468 in the next five years, representing a 10.6x ROI.\n\nDemystifying the EVM Through Interactive Puzzles - A Walkthrough.\n\nThe State of the Blockchain and Cryptocurrency Job Market in 2019-2020\n\nBuilding a custom authentication flow using Amazon Cognito and MetaMask\n\nSupply elasticity is a property of money that allows the supply to expand and contract on an as-needed basis in order to meet demand. Well established monies like gold, as well as modern age cryptocurrencies like bitcoin and ethereum, do not have this property.\n\nThe whole fintech industry is built around the interactions of various institutions. Fintech products can be as advanced and complex as you want them to be; they can solve essential problems for their customers, but in the end, the focal point is always some bank happily sitting on money. Thus, centralized finances are the banks and their subsidiaries. Many things in fintech are controlled by bureaucrats and most fintech apps function only because they are allowed to.\n\nThank you for checking out the 271 most read stories about Ethereum on HackerNoon.\n\nVisit the /Learn Repo to find the most read stories about any technology."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxQQnh2Vi1VT0hYSkdyQmZQV3NqN1N4QlBTbEZpZkpTbFVpdkpTVDdnV0E2OHVPcDdjSWhPbFp2RWEwVlhLZ1d5Y2E3M0hOZzlnSmttNWxaaVhrQkxBa3o5b0tKM0t2ZjBva241WkNNaGR0R3lDR1lBRkFXUFFwbHVlT9IBhgFBVV95cUxNOVF6eTcyVXhsWnliazZvdy1lZUxraGNUN2hFMklsZlZLdzFjV3lvWDNXbmdQWURiQ3lYQnJnQlo4WnJtWFBTYkVKX2UxTlNPTGl1elpEeHFfZzVPbXF0ZWRtQW81QlQ5Z1Q3QmpVNEVLYzZURWRRSThzUV9tQ3M4Z2RvWXU4Zw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 30 Dec 2023 08:00:00 GMT",
        "title": "The Year Of Ethereum: ETH Long-Term Holder Percentage Surpasses BTC - Bitcoinist",
        "content": "The percentage of long-term ETH holders has skyrocketed this year to surpass Bitcoin for the second time ever. According to data from on-chain analytics platform IntoTheBlock, Ethereum has done pretty well in its percentage of long-term holders this year, with over 70% of investors currently holding on to their assets for more than a year, a new milestone for the blockchain.\n\nETH Long-Term Holders Now Top BTC\n\nEthereum’s price activity has largely underperformed this year when compared to Bitcoin. But this isn’t surprising, as Bitcoin has led the entire industry in bullish metrics and investor confidence this year. However, data from IntoTheBlock suggest more Ethereum investors are holding onto ETH for the long haul, hopefully with the belief that it will continue to rise substantially in value over time.\n\nLong-term holders are investors who refuse to sell their crypto even during times of market volatility and price depreciation. They are particularly important in maintaining the overall health of any blockchain, as they help to provide stability and reduce price volatility.\n\nHistory has shown Ethereum surpassing Bitcoin as regards this metric only once before. It’s important to note that the last time this happened, ETH would go on to lead in this metric over the subsequent months.\n\n2023 Review! This year, the percent of long-term $ETH holders surpassed that of Bitcoin for the second time ever! pic.twitter.com/i6kDzAjzgM — IntoTheBlock (@intotheblock) December 30, 2023\n\nOn the other hand, In/Out of the Money metric by IntoTheBlock shows Bitcoin leading Ethereum in terms of profitability. At the time of writing, 82.25% of all BTC addresses are making money at the current price, compared to 76.10% of ETH addresses.\n\nBitcoin’s high profitability can be linked to a huge number of early Bitcoins assumed to be lost forever. As a result, the percentage of holders who bought at the current price metric puts Ethereum ahead of Bitcoin.\n\nTotal crypto market cap is currently at $1.6 trillion. Chart: TradingView.com\n\nAround 63% of ETH addresses who bought around the current price of $1,948 and $2,641 are still in profit compared to BTC’s 52% of addresses that bought between $35,729 and $48,402.\n\nWhat’s Next For Ethereum?\n\nEthereum is currently trading at $2,285 and is up by 91% this year. However, the asset’s price has largely underperformed in comparison to major altcoins like Solana and Cardano, who are currently up by 925% and 145% respectively this year.\n\nInterestingly, this hasn’t stopped bullish predictions from coming in regarding Ethereum. One of these is a prediction from BitMex founder Arthur Hayes, who estimated an astounding $5,000 price for Ethereum. Crypto analyst Raoul Pau also looked at price history to predict ETH outperforming BTC becoming a key macro trend of 2024. The first step in achieving this would be to break above the $2,380 price level.\n\nFor all the ETH bears… in Feb 2021, BTC first hit $44,000 (where it is today) and ETH was at $1400 (now $2250), 9 months later ETH was up 245%, BTC was up 45%… I think ETH outperforming BTC will be a key macro trend of 2024 and our work at EXPAAM suggests it. 1/ pic.twitter.com/QGSZahhldg — Raoul Pal (@RaoulGMI) December 21, 2023\n\nFeatured image from Pexels"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxNTmVpNWVxbGZhdHp3UGdRYzNwaldNTnljaDVqd043dllDQloxNjBuejRaMVlIeVd6NTYtQXJiMzJ2bWpKV3dBZDE1UV9rUEdLeUw2bF9fRFhuQzdETmZ6bmF1N29aaWtxRG9malNwSUw2RmdNV3ZuTFUtREg1RnQwZFFwdFdJRmx4dXo3WmtTWmJDQkJtdjJZMzJWbWZyU2dhSV8zc2tUT1ktUGxUN2dj?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 29 Dec 2023 08:00:00 GMT",
        "title": "Vitalik wants Ethereum to be more ‘Cypherpunk’ hailing the social layer as its core USP - CryptoSlate",
        "content": "Ethereum’s co-founder Vitalik Buterin shared his insights on the evolving landscape of the crypto ecosystem on Dec. 29, mainly focusing on Ethereum’s role in shaping a more open and decentralized internet in a blog post entitled “Make Ethereum Cypherpunk Again.”\n\nSince its inception, Ethereum has journeyed beyond being a mere extension of Bitcoin with smart contracts. Buterin recalls early memories of using Bitcoin in Berlin’s Bitcoin Kiez and at PorcFest, a libertarian gathering, highlighting the intertwined nature of technological and social aspects in the crypto world. These experiences stress the broader vision of crypto: fostering a free, open society where technology, social, and economic elements harmoniously interact.\n\nThe initial concept of “web3,” as coined by Ethereum’s co-founder Gavin Wood, envisioned Ethereum as a fundamental component of a more open internet stack. This vision aimed to overcome the limitations of the free, open-source software movement of the 1980s and ’90s, which did not account for modern internet applications’ collaborative and centralized nature. Ethereum, along with technologies like peer-to-peer messaging and decentralized file storage, was seen as a decentralized, shared hard drive crucial for extending the spirit of open source into today’s interconnected world. For Buterin, the chart below outlines the core benefits of decentralized technologies.\n\nHowever, Buterin notes a shift in focus since around 2017, with a diminished emphasis on consumer crypto payments and non-financial applications. This shift is partly attributed to rising transaction fees on the Ethereum network, which have priced out more minor, non-financial uses in favor of financial applications dominated by speculative activities. According to Buterin, this change has led to a misalignment with the original vision of Ethereum and the broader crypto space.\n\nLooking ahead to 2024, Buterin highlights several positive developments in Ethereum’s technology that could steer the platform back toward its foundational principles. These include advancements in rollups, second-generation privacy solutions, account abstraction, light clients, and zero-knowledge proofs. These technologies address the challenge of scalability and embody the values of decentralization, censorship resistance, and open participation.\n\nAs part of a broader technological vision, Buterin states, Ethereum continues developing its original components and “sister technologies” such as decentralized messaging and decentralized storage. Introducing zero-knowledge proofs adds a new dimension, enabling privacy and authentication simultaneously. For instance, Buterin notes how Zupass, a zero-knowledge-proof-based system, successfully implemented anonymous voting, demonstrating the potential of Ethereum-based technologies in achieving privacy without sacrificing security.\n\n“We can start to see the contours of what an Ethereum-y cypherpunk world would look like, at least on a pure technical level. We can be holding our assets in ETH and ERC20 tokens, as well as all kinds of NFTs, and use privacy systems based on stealth addresses and Privacy Pools technology to preserve our privacy while at the same time locking out known bad actors’ ability to benefit from the same anonymity set.”\n\nButerin also emphasizes Ethereum’s role in developing a decentralized tech protocol stack, competing with traditional centralized systems. This stack includes banking, social media, and identity verification alternatives, highlighting Ethereum’s commitment to building tools that interoperate with a broader ecosystem rather than creating isolated empires.\n\nThe social layer of Ethereum is equally crucial, according to Buterin. He acknowledges the need for a balance between incentive-driven and community-oriented approaches. Large-scale public goods funding and cooperative efforts within the Ethereum ecosystem are steps toward this balance, yet there is much room for growth and improvement.\n\n“There is a unqiue mix of valuing a warm and cohesive community, but at the same time remembering that what feels “warm and cohesive” from the inside can easily feel “oppressive and exclusive” from the outside, and valuing hard norms of neutrality, open source and censorship resistance as a way of guarding against the risks of going too far in being community-driven.”\n\nUltimately, Buterin envisions Ethereum as a platform that excels technically and economically and fosters a robust and value-driven community. Buterin closes his post by stating,\n\n“If this mix can be made to work well, it will in turn be in the best possible position to realize its vision on the economic and technical level.”\n\nButerin believes integrating technical innovation with social and ethical principles could potentially lead Ethereum to realize its original vision of a decentralized, open, and equitable digital world.\n\nMentioned in this article"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMi8wFBVV95cUxOd0c4Q0RNSHNTRWY3T0RGRXRWdEp3UV9GUE9ISnpJeWJmcjJsZF9VZkNZLUVSM29iMGxfWFZvaVJKTC1pQUhTMWdFNl8xazE0WTZjYlR5M1RYODVZWDhVTl95R1BNQkt1WEtVUmlSR2pacjhkZi1fZC1wVFpZampwOWY1dWVTa2lnU2ctS05kWlRHdzd3X29MUHpySXVmXy1lcE9UTWc1Ny01LVphcTNBRlN3ZGxDa3J3SFJBS2RvQzhCa1lOOTRCczBEYUF5dUFaa3h2c2V2Ym50VTBJWjM4N3BVcVlmMEVtQlhraTh2cy1ReGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 29 Dec 2023 08:00:00 GMT",
        "title": "ZkSync: L2 privacy surpasses Ethereum blockchain - The Cryptonomist",
        "content": "ZkSync, a layer-2 blockchain developed by provider Matter Labs and focused on scalability and privacy, has surpassed the Ethereum mainnet for the first time in terms of number of transactions executed.\n\nIn the last 30 days, Zksync has recorded a total of 34.7 million transactions compared to Ethereum’s 34.2 million.\n\nThis is mainly due to the new trend of inscriptions, which after targeting the Bitcoin network, is now expanding within the EVM chains sector.\n\nWe will see if the attention on this type of digital products will remain high even in 2024.\n\nAll the details below.\n\nZkSync, a privacy and scalability-focused rollup, outperforms the Ethereum blockchain thanks to the trend of inscriptions\n\nThe zero-knowledge rollup ZkSync, which focuses its efforts on optimizing scalability and privacy, has managed to outperform the Ethereum blockchain, which it relies on as a second-layer solution.\n\nIn the last 30 days, according to L2Beat data, there have been a total of 34.7 million transactions on ZkSync, while on its main network there have been 34.2 million transactions, resulting in a positive difference of approximately half a million transactions.\n\nWith this record, L2 ranks first in the EVM network ranking that has recently recorded the most tx, ahead of competitors Arbitrum, Optimism, DyDx v3, Base, and ImmutableX.\n\n\n\nThese data are justified by the recent introduction and diffusion of “inscriptions”, which is a metadata registration feature originating from Bitcoin, on all networks that support the Ethereum virtual machine, including the vast Ethereum L2 landscape.\n\nRegistrations allow you to obtain alternative NFT to the classic resources generated through smart contracts, adding information such as text, images, videos, and even additional code within the ID of a transaction, all without losing the advantages of privacy and security.\n\nThis, although it may seem more cumbersome and sometimes even obsolete, allows you to save fees when it comes to including complex data within a smart contract and therefore is preferred by developers and users.\n\nThe data from L2Beat shows that the zkSync blockchain recorded its largest increase in monthly transactions on December 16th.\n\nIt was then that the synchronization registration was launched on the network and accounted for 4.6 million out of the 5.3 million transactions on that day alone, according to Dune’s data aggregated by Dragonfly analyst Hildobby.\n\nIt is rare for an L2 network to surpass its main network in on-chain metrics, but given the interest and development that has been revolving within the Ethereum rollup sector lately, and the increasingly captivating narrative of inscriptions, it is possible that in the future these opportunities will become more frequent.\n\nThe ZkSync Cryptographic Ecosystem\n\nThis is not the first time that the layer-2 blockchain Zksync has made headlines, having become the protagonist of several records in the last year, thanks above all to a growing cryptographic ecosystem.\n\nThe zero-knowledge rollup solution was launched in March and has immediately succeeded in scaling the Ethereum mainnet, without compromising the security and privacy of the infrastructure.\n\nIn a short time, it has established itself as one of the leading players in the EVM chain sector, reaching a significantly high Total Value Locked.\n\nSpecifically, as of today ZkSync has a TVL of 581 million dollars, second only to Arbitrum and Optimism’s optimistic rollup versions, which have locked values exceeding one billion dollars, and to competitors Metis and Base.\n\nIt is not excluded that the cryptographic solution of Matter Labs will be able to further climb the rankings in the coming months, reaching the top 3 of the most used L2s in the world, especially if a gas token is launched to support its growth.\n\nLooking closer at the composition of this blockchain, we see that the protocols that have contributed the most to its growth are mostly DEX, which allow on-chain cryptocurrency exchange through an AMM (Automated Market Maker) platform.\n\nAmong these, the favorites of DeFi users have been ZKSwap, SyncSwap, Mute.io, Maverick, Velocore, Space.Fi, IziSwap, Pancakeswap, and ZkSwap Finance.\n\nOverall, DEXs on Zksync encompass the majority of TVL managed on the network, channeled into a multitude of decentralized pools that allow for the free exchange of cryptographic resources.\n\nThe category that has had the most impact on the success of ZkSync is the Lending platforms such as Reactor Fusion, Zero Lend, and ZkLend.\n\nFinally, we find decentralized applications for derivative trading such as Derivio, Holdstation, Satori, Rollup Finance, and Fulcrom.\n\nFurthermore, it is necessary to consider the boost of on-chain activities that has been given thanks to the narrative of crypto airdrops, which have encouraged Ethereum rollup users to prefer this blockchain precisely because of the possibility of a reward for its early adopters.\n\nWith $458 million raised in funding from external investors, Zksync promises to carry out one of the largest airdrops in the history of the blockchain world.\n\nThis factor, together with the new trend of inscriptions, could bring the L2 network to another level, where imagination still cannot reach."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTE1wTE9zVzhyYURaS1g3VDJkdXRtbkpPZG5VaTZhUUhzYUxXVDNwNU5EcHVRMjhJR010NEF3V0NNdTdIeVlVSnFCVmdOSmNZTzQyWnVPdVFxbEhwR2doa3dUb2oteXpXT0cxTUHSAW9BVV95cUxNa2R3OGFPVUhmWlNVZi1NQ3ljMjRibTU0dG1tN3UzRjJadFBjOVN2UmNUMWVGYnhaeDU1QWk1T29wbnY5dHFTVGZWX3lVQXY3UFcxeVMtazVwUDBXN3VXZFRxeVhfTU5oUjB0X1UtOWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 29 Dec 2023 08:00:00 GMT",
        "title": "Vitalik Buterin Shares New Ethereum Vision - U.Today",
        "content": "Vitalik Buterin has voiced a new vision for the Ethereum platform that seeks to address its most pressing challenges and leverage emerging technologies to reinvent Ethereum’s infrastructure. Central to this vision is a renewed focus on scalability and privacy, fueled by the development of layer-2 solutions and novel privacy technologies.\n\nAdvertisement\n\nButerin acknowledges probably the biggest issue on the network right now – high fees. This barrier has not only hindered widespread adoption but also skewed the network toward financial applications, as only users with significant resources can afford to transact during peak times. The proposed solution to this predicament lies in the advancement of rollups. Rollups perform transaction execution outside the main Ethereum chain (layer 1) but post transaction data to layer 1, thereby enhancing the network’s capacity while retaining its security.\n\nThe advent of rollups, particularly optimistic and zero-knowledge rollups, has been a primary way of reducing fees on the network. These rollups promise to execute a large number of transactions at a fraction of the cost currently required on the main chain, potentially lowering the entry barrier for new users and diverse applications.\n\nAccount abstraction is another key component of Buterin's vision. It represents a shift in how user accounts and transactions are managed, offering a more flexible and user-friendly model that could open up new possibilities for application developers.\n\nAdvertisement\n\nLight clients, which have been on the backburner for some time, are now closer to fruition. Their role is crucial for enabling users to interact with the Ethereum network without running full nodes, thereby lowering the technical barriers to entry and participation.\n\nThe most groundbreaking development highlighted by Buterin is the practical application of zero-knowledge proofs (ZKPs). Once considered a distant future technology, ZKPs are now increasingly developer-friendly and on the verge of consumer application. This technology could revolutionize privacy and scalability on Ethereum by allowing users to validate transactions without revealing underlying information."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPMVFheHI3MEpRdnZPMlNLY01KdklaaGZqa2gtTDhUNThjSU41LURaZzhGVXpmVzlyQWtia1draUpTcGw0VEtLbkhEWFNHaHBmUHJubUV0V04xTk9hVzRudUJNNGpzQzJqTURuUl8zSXh5SDJFQ1lUbFFZbDJyQ0FQQ1FIZTgzSWZtM3ptNGtIWC1FR2NzSVp1WQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 29 Dec 2023 08:00:00 GMT",
        "title": "Ethereum co-founder Vitalik Buterin Proposes Signature Reduction - Blockchain News",
        "content": "Ethereum co-founder Vitalik Buterin Proposes Signature Reduction Zach Anderson Ethereum co-founder Vitalik Buterin proposes reducing the number of signatures for validators in the PoS system to simplify the system, address technical issues, and enhance network security.\n\nVitalik Buterin, Ethereum's co-founder, recently proposed a significant change to the Ethereum blockchain's proof-of-stake (PoS) system. The core of his proposal is to reduce the number of signatures that validators must process. Currently, Ethereum's PoS mechanism involves around 895,000 validators processing approximately 28,000 signatures per slot, which results in a heavy load on the network​​​​.\n\nThe Need for Change: Balancing Decentralization and Efficiency\n\nThis high number of validators and the associated signature load come with major technical downsides. It limits quantum resistance, complicates forking, and challenges scaling signatures through zero-knowledge proofs (SNARKs). Moreover, the high minimum of 32 ETH for becoming a validator remains prohibitive for many, limiting widespread participation​​.\n\nButerin suggests that reducing the signature requirement to about 8,192 per slot, down from the current 28,000, would offer several benefits. It would simplify the consensus mechanism, make the blockchain more quantum-resistant, and maintain a high total of slashable ETH (1-2 million ETH), a mechanism to enforce good behavior among validators​​.\n\nExploring Alternative Approaches: Decentralized Staking Pools and More\n\nButerin outlined three potential approaches for this change:\n\nDecentralized Staking Pools: This method involves increasing the minimum ether required for staking, encouraging smaller validators to form pools. This shift would reduce the number of individual validators​​. Dual-Layer Staking System: A 'heavy' layer would require a higher ETH stake (4,096 ETH) for participation in finalization processes, while a 'light' layer would have no minimum requirement, creating a balance between security and accessibility​​. Rotating Validator Set: This approach would involve a rotating set of 4,096 validators for each slot, adjusting the set during each slot to ensure network safety​​.\n\nAddressing Security Concerns\n\nButerin also pointed out the limitations of the committee-based security model used in other blockchains. This model, which randomly selects a group of validators for each slot, lacks accountability in the event of a 51% attack. Ethereum's current system, which imposes severe penalties for such attacks, is effective but might be excessively punitive. A balanced solution maintaining high slashable Ethereum while making concessions on validator accountability is needed​​.\n\nImage source: Shutterstock"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxNRFhfTFBESF9LbVR2Z1lFemVJeUlDU3JyRVY0S2puU04tZTlacTVEbkUyMnZ1RkxncjMyZ2tJQVdPSXJzZVN2cGgydl9oemQ1TnV6ZzQ2M2s5SnkyQjdaWG5qMGVrRnZkZ0diREJRdkpyR1phVXhJSVdJVm5Eb18wVFBBczJJamlGeVV5QzE2WGhtZ3RZNk5rRzV3bTF1TDA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 29 Dec 2023 08:00:00 GMT",
        "title": "Solana Surpasses Ethereum on Worldwide Google Search Volume - Crypto Times",
        "content": "The search volume for Solana has surpassed Ethereum on Google for the first time following the recent spike in SOL price and its ecosystem activity.\n\nThroughout the year, Ethereum was in the lead against Solana on Google search, but the recently changed market dynamics have pushed users’ interest in Solana to a higher position\n\nThe increase in Solana search interest has been recorded in the past two weeks, according to Google Trends data.\n\nSolana & Ethereum Search Interest – Google Trends\n\nSolana got a search interest score of 100 from December 24 to December 30, which helped it surpass the Ethereum search dominance with a sudden spike. The score of 100 in search interest represents peak popularity for the term.\n\nThe spike has been primarily led by the recent popular memecoin BONK, which gained massively from November to its peak in mid-December. The unexpected surge in SOL price has also continued to raise search interest for Solana during the past couple of weeks.\n\nGoogle Trends data further shows that people who searched for Solana on Google have also searched for BONK and Tensor, a Solana-based NFT marketplace.\n\nSolana has regained much attention in the past three months, with the SOL price rising from nearly $21 on October 1 to peaking over $124 on December 25, recording a gain of over 490% during the period.\n\nSOL is currently trading at $108 with a yearly gain of 1050%, according to data from Coinmarketcap."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE5YS1BPMHUtdlNiYmRWeXR6X3c1YjZoM05wTTRTY2swNGJIUTdYemZiaDA3YkdsSHhiRG5ld1VhUjZ4U01qQ0RFUERBdDdIbnI1Uk9NVFl4OFZncnpCdDFlcGsyV29ZYXM4MEFXYk1DZnJGWmkwMVI4X1ozOXI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 30 Dec 2023 08:00:00 GMT",
        "title": "What’s Behind Solana’s Recent Surge - Yahoo Finance",
        "content": "What’s Behind Solana’s Recent Surge\n\nSolana Flipped Ethereum in Google Search Interest\n\nGoogle searches for the term \"Solana\" surpassed \"Ethereum\" for the first time in 2023, indicating growing interest in the Solana ecosystem.\n\nFrom December 17 to 23, Solana's search interest score reached 56, while Ethereum's was 50. Google Trends data suggests that Solana's search interest is set to peak during the week of December 24 to 30, with a score of 100.\n\nUsers searching for Solana also showed interest in terms like \"bonk\" and \"tensor.\" Bonk (BONK) is the leading Solana memecoin that reached a peak market cap of $1.9 billion after being listed on Binance and Coinbase, while Tensor is the leading NFT marketplace on Solana, after surpassing Magic Eden in trading volume.\n\nSolana’s DEX Volumes and NFT Sales Surpassed Ethereum’s\n\nOn December 23, Solana surpassed Ethereum in weekly decentralized exchange (DEX) volume and non-fungible token (NFT) sales.\n\nDEX volume on Solana surged to over $10 billion, surpassing Ethereum's $8.8 billion for that week. Meanwhile, Solana also processed $109 million in NFT sales in that week, eclipsing Ethereum by $30 million.\n\nAt the time of writing, Ethereum is leading in terms of DEX volumes, with $10.12 billion compared to Solana’s $8.71 billion. However, Solana’s NFT sales volume is still ahead of Ethereum’s, although Bitcoin is leading due to the recent Ordinals frenzy.\n\nThe current frenzy on Solana is partly driven by memecoins, particularly BONK, which has skyrocketed by 300% in December and has a market cap of over $1 billion. Another Solana-based memecoin, Dogwifhat, has also gained 428% in the past week.\n\nSolana Flipped BNB in Market Cap Momentarily\n\nOn December 22, Solana surged by 18% to overtake BNB (BNB), propelling it to 4th place in terms of market capitalization. SOL traded at a market cap of $41.9 billion, surpassing BNB, which had a market cap of $41.8 billion.\n\nThis surge came after SOL overtook XRP in market cap on December 21. However, BNB has since regained its position after gaining over 17% in the past week. BNB is currently trading at a market cap of $47.8 million, compared to SOL’s market cap of $43.7 million.\n\nSOL gained over 71% in the past month, outperforming many large-cap cryptocurrencies such as ETH, which has only gained 12.4%.\n\nWhat’s the Reason Behind Solana’s Recent Rally?\n\nSolana's recent price surge can be attributed to several factors, including:\n\nIncreased User Activity\n\nActive addresses on Solana have increased by nearly 400% in the last three months, surpassing Ethereum’s in mid-November. This suggests an exceptional increase in retail activity, with crypto users likely migrating to Solana for its lower transaction costs, increased speculative activity, airdrop farming and more.\n\nStory continues\n\nAirdrops and Memecoins Caused Surge in DEX Volume\n\nRecent airdrops on Solana, particularly the Jito (JTO) airdrop worth five figures, have resulted in more users flocking to other Solana-based protocols in hopes of securing a future airdrop. Furthermore, memecoins trading craze, led by the Bonk memecoin, have boosted speculative user activity, causing the DEX volume on Solana to surpass Ethereum’s for a week. Other memecoins on Solana, like Dogwifhat (WIF) and Silly Dragon (SILLY), also saw millions in daily volume on-chain, contributing to the rise in DEX volumes.\n\nInstitutional Capital Flows Into Solana\n\nSource: CoinShares\n\nSolana-based investment funds attracted $156 million in institutional inflows as of December 16, making it the crypto asset with the highest inflows behind only Bitcoin, suggesting robust institutional interest in Solana."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxNVW5IQWdNYnlIT3BiQjQxWGxwS25ZdXhUV0x1Z1JkSUJ4dHBfSU5TWjFjeC1EdFVpWkFEVlpPXzN3VGhqWVdLV2tSUHQ0X01fMWdKOUcwdUlNMm5aMDZSc2N3dXEwVElDQ1NKODJJM3lNT0dLbTJYbTMzc2U5aFNKVm5QUlUwNWZRa0NLd1VfRnhzTGxMWllWWDhrenk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 29 Dec 2023 08:00:00 GMT",
        "title": "Vitalik Buterin Wants Ethereum To Become ‘Cypherpunk’ Again - Crypto Times",
        "content": "The developer and co-founder, Vitalik Buterin, wants Ethereum to become cypherpunk again, as it was in 2017 before financial applications took dominance over the network.\n\nIn his latest blogpost shared on December 28, Vitalik said that Ethereum was originally introduced as a “decentralized shared hard drive,” which ought to serve peer-to-peer messaging and decentralized file storage.\n\nHe amplified that Ethereum’s vision faded in 2017 after it saw a variety of DeFi applications boom and “financialization.”\n\n“Having lived through that era, the number one culprit that I would blame as the root cause of this shift is the rise in transaction fees,” said Vitalik, adding that “When the cost of writing to the chain is $0.001, or even $0.1, you could imagine people making all kinds of applications that use blockchains in various ways, including non-financial ways.”\n\nWhen the transaction fees go up, it’s only used and essentially fueled by “degen gamblers” who are willing to play more and more as coin prices go higher and “they are getting richer.”\n\nVitalik also noted that Ethereum has advanced in other ways, which include innovations such as rollups, zero knowledge (zk) proofs, account abstraction, and more. He also reminded everyone of the core values on which the foundation of Ethereum is built.\n\nMake Ethereum Cypherpunk Again – Vitalik.eth.limo\n\nFurthermore, he also noted developments on Ethereum that address internal as well as outside-ecosystem issues, claiming that while Bitcoin is trying to solve two or three problems, Ethereum has many communities that focus on different visions.\n\n"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE9KZUF0WnEzWXlYVElOcllicHZRMGFZa0gwRVlvMVE4dmhTSXJHX2FNaEtwRVVkZUd6UVJ0SG5WTEtSaEEteXN2TUVrd1VYUDhfMFFGVS1ib2xmb3hLYXJGUDZzNU9RMVVNWGlDaHF3N0NpQWZrMDFqT25VUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 29 Dec 2023 08:00:00 GMT",
        "title": "Ethereum’s Vitalik Buterin Unveils Signature Solutions: Simplifying PoS Complexity - TronWeekly",
        "content": "Ethereum co-founder Vitalik Buterin has presented three potential solutions to address what he identifies as a looming systemic complexity within Ethereum’s proof-of-stake (PoS) consensus mechanism. In a detailed post on the Ethereum Research forum, Buterin highlighted the challenges posed by the increasing number of signatures required for validators to keep the network operational.\n\nThe heart of the problem lies in the extensive workload placed on validators, who are essential for maintaining the network’s functionality. As the number of validators continues to grow, the burden of generating signatures essential for proper network operation escalates, putting a strain on the system. Upcoming upgrades are expected to exacerbate this issue by significantly increasing signature requirements.\n\nEthereum's Vitalik Buterin Unveils Signature Solutions: Simplifying PoS Complexity 3\n\nButerin’s Fixes: Simplifying Ethereum’s PoS\n\nButerin’s proposed solutions revolve around the common goal of reducing the required signatures to 8,192 per slot in the Ethereum blockchain. Each solution introduces a distinct approach to tackle the complexity associated with the current PoS design.\n\nDecentralized Staking Pools: One approach involves the establishment of decentralized staking pools. By increasing the minimum amount of ether required to run a validator, individual validators are encouraged to collaborate and pool their resources. This would distribute the workload and alleviate the strain on the system.\n\nTwo-Tiered Staking: The second proposed solution suggests implementing two layers of stakers with different requirements. A “heavy” layer with higher requirements would participate in finalization, while a “light” layer with lighter requirements adds an additional layer of security to the block finalization process.\n\nRotating Participation: The third solution introduces a rotating set of participants, where a random group of validators is selected for each slot. While this would diversify the workload and reduce the overall number of required signatures, Buterin acknowledged the added complexity associated with this approach.\n\nAccording to the blog post, Buterin emphasized the current challenges posed by Ethereum’s commitment to supporting a high number of validators for the sake of decentralization. The immense number of required signatures per slot creates technical challenges, including intricate attestation propagation mechanisms and potential quantum resistance issues.\n\nTo address these challenges, Buterin suggests moving away from the expectation of an ever-increasing number of signatures per slot. He proposes a philosophical pivot to expand the PoS design space, simplify technical implementations, enhance security, and tackle quantum resistance issues effectively.\n\nThe Ethereum co-founder also explored the drawbacks of a committee-based approach used by some blockchains, emphasizing the importance of accountability in Ethereum’s current system.\n\nButerin’s proposal aims to establish a clear expectation of 8,192 signatures per slot, providing technical implementers and the Ethereum community with a more predictable future. The decision on which solution to adopt will involve careful consideration of trade-offs, particularly regarding liquid staking and other related issues.\n\nRelated Reading | Tim Draper Predicts Bitcoin To Reach $250,000 In 2024 Amid Enthusiasm And Regulatory Anticipation"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxOTzZSa2JuU0tuTmFIOE9SWmptY1NfeWZWMkRybjZ6Z1JCTzJIZEZNYmRxRXhQQjJNNVR5cjd6a3Z2ZllwTHpOVjZOTS1SUXdJZnBJcWNnV0hQcWxadHBCR2F0NUZBYUdyRXc4TEljRTgxa2J1VWVDS0E2cllUQXlYZE1KSUVQallVNlBz0gGQAUFVX3lxTFA0RTNBa1YzRmZWRVFRY3FubGZoOTY3eksxV2puY1h5ZEhVenlqaE1qWFdvNTMyUnU1MkVnYVpwWVdsOVhzOVZtNHNhckF1SVhfXzFHb2xlTlFfb0RuaVZlTnJLai1OSWJneU40cGdHS0hXODF3OXBDemR4NTBRR0RvMzNERktFbzg2aUNPOGx4Mw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 30 Dec 2023 08:00:00 GMT",
        "title": "How Ethereum Whale Risks Liquidation After Buying 25,674 ETH: Details - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAccording to Lookonchain, an Ethereum whale has recently made a huge purchase of 25,674 ETH; however, this action could backfire if the price of ETH falls below a specific threshold, triggering a liquidation event.\n\nAdvertisement\n\nFrom all indications, it appears that the whale obtained the said ETH from MakerDAO. This decentralized lending platform allows users to mint stablecoins (DAI) by locking up their crypto assets as collateral.\n\nWhen the price of $ETH drops to $2,257, the smart money will be in danger of liquidation.\n\n\n\nThe healthy ratio on #Maker is as low as 1.03.\n\n\n\nThe smart money once again spent 61M $DAI to buy 25,674 $ETH, and then sold 5,851 $ETH for 14M $DAI, making ~$99K.https://t.co/yGkFI6qpnj pic.twitter.com/VRmstUCngE — Lookonchain (@lookonchain) December 29, 2023\n\nLookonchain reports that the whale had spent 61 million DAI to buy 25,674 ETH; however, the whale shortly after sold 5,851 ETH out of this stash for a value of 14 million DAI, of which they made a profit of $99,000.\n\nAdvertisement\n\nAlthough the whale had made some profits from this strategy, they also faced the risk of liquidation. If the ETH price goes below a certain level, the whale's collateral will be insufficient to cover their debt, and MakerDAO will automatically liquidate the ETH to reclaim the DAI.\n\nAccording to Lookonchain, if the price of ETH drops to $2,257, the said large ETH holder might be in danger of liquidation. This is because the healthy ratio on MakerDAO is presently as low as 1.03.\n\nThe Ethereum price is nearing this threshold, having fallen 3.56% in the last 24 hours to trade at $2,280, according to CoinMarketCap data. Since reaching a high of $2,448 on Dec. 28, the price of Ethereum has steadily dropped.\n\nIf today closes in red, ETH might be set to mark its third consecutive day of losses. The ETH price fell to intraday lows of $2,255 on Dec. 29, but at present, it has held up above the lows of $2,267 marked in today's trading session.\n\nWherever ETH price trends, the whale's fate is now related to the performance of ETH and the crypto market as a whole, which is currently declining as investors book profits through the end of 2023."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxOb3ZGU1hSSjl3YVYzTWxNMF9qU3RKc2hqRkU4RWMtWlpXbXpIcWR6VjUzVm5Oa2pVeDdmMDMyZHdQSVQ0YmNfTTFIR2hERGtJNVlma19uVmJWOS1LTVpxR0tUbTZ0UFJiTm9nbU9kUUFfVFRVRElwYlhKcnhIWFN1NnMtMWpHNnRsdUMwai00cDdiYTJxQ3p5bE0wclc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 29 Dec 2023 08:00:00 GMT",
        "title": "Arthur Hayes on Why Bitcoin Is Money and ETH Is a Shitcoin He Loves - Unchained",
        "content": "Episode 587\n\nArthur Hayes, Chief Investment Officer of Maelstrom, delves into the anticipated bull run in crypto, the potential collapse of the traditional financial system, and his unique take on Bitcoin, Ethereum, shitcoins, and more.\n\nListen to the episode on Apple Podcasts, Spotify, Overcast, Podcast Addict, Pocket Casts, Pandora, Castbox, Google Podcasts, Amazon Music, or on your favorite podcast platform.\n\nAs 2023 nears its end, the crypto community is abuzz with speculation: will the relentless crypto winter give way in 2024? Crypto OG Arthur Hayes is confident that crypto is on an upswing. According to Hayes, these market cycles are historically recurrent, indicating a potential bull run in the near future.\n\nIn this episode, Hayes offers his insights on a range of compelling topics, from what he believes will be a resurgence of central bank money printing between 2024 and 2027 to the effect spot Bitcoin ETFs will have on crypto markets.\n\nHe also shares his views on the post-FTX blockchain landscape, the dynamics of Ethereum and memecoins, and why he thinks Tether won’t last.\n\nShow highlights:\n\nWhy Arthur believes that central banks across the globe might resort to printing money again between 2024 and 2027\n\nWhy he’s anticipating a bull run in the crypto market within the next year\n\nWhether the financial system established post-World War II is on the verge of a breakdown\n\nWhat Arthur recommends investors should do in the event of a spot Bitcoin ETF launch\n\nWhy he is confident that the launch of a Bitcoin ETF won’t immediately lead to a massive surge in prices\n\nHow, according to Arthur, the collapse of FTX actually validated the resilience of the blockchain ecosystem\n\nWhether the DCG crisis is likely to have a far-reaching impact on the crypto industry\n\nWhy Arthur maintains a bullish stance on ETH and the Ethereum ecosystem, despite labeling it a “shitcoin”\n\nWhether he sees the use of the Bitcoin blockchain for trading memecoins (BRC-20s) as problematic\n\nWhy Arthur thinks Tether’s dominance will be challenged with the entry of major U.S. banks into the stablecoin market\n\nWhy he firmly believes that AI systems will favor Bitcoin over traditional forms of money\n\nWhy, in Arthur’s view, China may not aim to become the issuer of the global reserve currency\n\nThe investment strategy of Arthur’s family office, Maelstrom\n\nThank you to our sponsors!\n\nGuest\n\nLinks\n\nMacroeconomics\n\nBitcoin ETFs and markets\n\nSBF and FTX\n\nCZ and Binance\n\nEthereum, Solana, memecoins:\n\nArtificial intelligence\n\nStablecoins:"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOd3VKeTB3dXkzYVRVaFQ5Ql9URUFmTXBodjJSU08zWjZXd01aM3NyY01uMzQzczUxcXJWMzNISGp0OWpsbkszcXlRVUtRWGtwSTNELVA5WDdrRDhNa3d0RHloQ1p0OUtFTW9qSGJ6TUN6TTVISmEzbTNBeVcwT0d3ckNwWlJtRlRyX2hwM2w1b9IBlAFBVV95cUxNM2k5NDlkMUVTbzk5MTV6YUVQc0VtZURZanhkMXJlTDNPX0RoS3BmWmdkcEpzNTBvWDUzdWlVbUdfNGJTbHhCb3hUMUZfRVNMelM0ajAxVEZlS3B4YVpvaU5QM2t6d0FUQzJvYnlQRWNhUF9PWUpDMVE2UVpVeXB2NnZJQWtZdThRZ25WOF9HS0xBY0Zl?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 30 Dec 2023 08:00:00 GMT",
        "title": "Vitalik Buterin says he wants to ‘make Ethereum cypherpunk again’ - AMBCrypto News",
        "content": "Ethereum founder Vitalik Buterin talked about the blockchain’s future in his recent blog.\n\nUsage of network remained high, however, its price saw a correction.\n\nEven though multiple altcoins have followed suit after Bitcoin’s [BTC] rally, Ethereum’s [ETH] price has not seen much growth in the recent past.\n\nDespite this developments have ensued on the network with founder Vitalik committed to the vision of Ethereum.\n\nHas Ethereum lost its Cypherpunk?\n\nIn a recent blog post titled “Make Ethereum Cypherpunk Again,” Vitalik Buterin outlined a promising future for the network, driven by significant developments across various fronts.\n\nHe stated that scalability solutions, such as rollups, are addressing Ethereum’s historical scalability challenges, allowing for more efficient transaction processing. Second-generation privacy solutions, including projects like Railway and Nocturne, are enhancing user confidentiality.\n\nHe also mentioned the concept of account abstraction is gaining traction, enabling users to interact with smart contracts without the need for native cryptocurrency holdings, making Ethereum more accessible.\n\nProgress in the development of light clients is reducing resource requirements and increasing network accessibility. Zero knowledge proofs, once considered a distant technology, are becoming more developer-friendly, offering enhanced privacy and verification capabilities.\n\nThe blog post also emphasizes a return to core values within the crypto community, including open global participation, decentralization, and a cooperative mindset.\n\nThese updates collectively aim to address scalability concerns, reduce transaction fees, and bolster privacy and security.\n\nAs a result, Ethereum may experience improved efficiency, making it more appealing to a wider user base and enabling a broader array of applications.\n\nHowever, the success of these changes depends on community adoption and effective implementation.\n\nHow is Ethereum doing?\n\nComing to the state of the protocol, it was seen that the gas usage on the network has remained consistent. This meant activity on the network was high.\n\nHowever, the number of NFT trades occurring on the Ethereum network has fallen.\n\nRead Ethereum’s [ETH] Price Prediction 2023-24\n\nThis could have a negative impact on Ethereum in the future as NFT trades make up a large amount of the overall activity on the network.\n\nAt press time, ETH was trading at $2,361.39 and its price had fallen by -1.21% in the last 24 hours. Only time will tell whether Vitalik’s long term vision will help ETH’s price see further growth."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxPQzRvbHBWVUNtYkxLUm1WRXIwS1ZhYmEyRE04TFhDd1haLWt1dmc4ZkdTWk4td3dpN1VObG5TT2V0VWIzREREUDhsRFJvU1U1ZjJrVjhYcnY5YzBMVFlkMUM1VlRyWUFWVFllVXZIVWFXUllJd04zbGtlZVJBaGZ6V0xZSEtWeGNWRmhlY3RtelpaeF9aaURWUWdrZ0VxLXPSAaQBQVVfeXFMT190SjB5V1A5LVZrRUl4S0hPdVIyX3ZULW5YdkI0RnlJSTBhd25LdE04TFZ2MEg3blZCMzNVc2U5Vm5DTllZYTB5TnROcmVRa0Z2bjZoczVJZDM5QlJhcnFXOFNkN2xuN3czSkNiVVFBdFFEUXdyYkI0WEgzSkg4aWdpRHhMOXMwLTd4WVlERUtYVXdTNm5FSHpXUlVnWUFJbU1QMU4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 30 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Layer-2 Transactions Skyrocket 330% In 2023, ARB And OP Take The Lead - CoinGape",
        "content": "The Ethereum Layer 2 transactions skyrocketed by over 330% in 2023 compared to the last year. In recent months, Ethereum’s scaling solutions have experienced a notable uptick in interest, marked by the frequent introduction of new Layer 2s (L2s).\n\nOne of the latest players in this dynamic landscape is Coinbase’s Base L2, which gripped the attention of crypto enthusiasts. While Base had a significant share in these transactions, Arbitrum (ARB) and Optimism (OP) emerged as the largest contributors.\n\nadvertisement\n\nEthereum L2 Transactions Overview\n\nAccording to IntoTheBlock analytics, the Ethereum L2 ecosystem recorded a total of 583.53 million transactions in 2023. This suggests a staggering increase of 332.08% from 2022’s figure of 135.05 million. The largest contribution in the 2023 transactions was made by Arbitrum which accounted for a 64.01% share.\n\nOn the other hand, Optimism and Base held a share of 22.22% and 13.77% share, respectively. Furthermore, it’s worth noting that the 2023 Ethereum L2 transaction data indicates an unprecedented growth from 2021. Since the Ethereum Layer 2 ecosystem was fairly new in 2021, the number of transactions was recorded to be 6.24 million, which indicates a whopping increase of 9,251% since then.\n\nAlso Read: Ethereum Price: Analyst Predicts 22% Surge In Ethereum (ETH) Price Sparking Market Optimism\n\nFurthermore, in a recent post on X, IntoTheBlock highlighted that the weekly transactions since 2021 have increased by 90 times. The weekly transactions hit a high of 18 million in 2023 while in 2021, it was less than a million.\n\nArbitrum And Optimism’s Recent Performance\n\nOwing to the growing popularity of the Ethereum Layer 2 ecosystem, the ARB and OP prices have gained significantly lately. In the past seven days, the ARB price locked in profits of over 8% while OP surged by 13%. In addition, the ARB crypto soared by more than 43% in the past month whereas OP skyrocketed by 117%.\n\nHowever, at the time of writing, both these digital assets saw a significant drop in value due to the ongoing bearish trend of the market. At press time, the ARB price was recorded at $1.45, plunging by 5.56%. The ARB market cap stood at $1.84 billion, down by 5.72%. Moreover, the 24-hour trade volume slumped by 23.54% to $617.02 million.\n\nWhilst, the OP crypto price dipped by 2.41% to $3.65. The crypto’s market cap was recorded at $3.32 billion, marking a decline of 2.43%. However, the 24-hour trade volume registered a significant increase of 11.73% to 589.94 million.\n\nAlso Read: Optimism And Immutable Price Rally Continues With Monthly Gains Of Over 75%\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxPaE1uSDExUXJYSkZBelNXX3VlTE82NDlzeUNwMy1VQ1RTOVFvc0ctcG5wUUpGc3J5Y2hoSVFEZGlpc0hJMXl2Z2h0Y0MzaHpyMU9SbFFQMnZSNWU1ekxna1M1dTkyclZQTDNjSFE4NklxdlpzRDN3My1hYmN4SE9YUXNLRjh0Rzc3bm9NTmN1SlYyU3pqM0pUVWJSS2w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 29 Dec 2023 08:00:00 GMT",
        "title": "Solana's Impressive Comeback, a Real Threat to Ethereum's Supremacy? - Cointribune EN",
        "content": "Fri 29 Dec 2023 ▪ 3 min read ▪ by Fenelon L.\n\nWith its SOL token back well above 100 dollars, Solana marks a resounding comeback and positions itself as a formidable opponent to Ethereum’s dominance. Let’s dissect the mechanisms of this resurgence.\n\nDoes Solana’s Shadow Loom Over the Realm of Ethereum?\n\nLaunched in 2020, Solana bets everything on speed. Its blockchain can process 65,000 transactions per second, compared to a mere 15 for Ethereum. A considerable advantage for attracting decentralized finance (DeFi) projects and cryptocurrencies.\n\nIn 2021, this argument captivated the masses. SOL surged spectacularly, from $1 in January to $260 in November. Its proponents even announced that Solana was on track to overtake Ethereum in the smart contracts market.\n\nHowever, the FTX debacle changed the game. The crash of Sam Bankman-Fried‘s platform, closely linked to Solana, sent SOL below $10. The blockchain also faced criticism for its technical vulnerabilities. Its future seemed uncertain.\n\nA Spectacular Comeback\n\nYet, the tide began to turn at the start of 2023. SOL rebounded sharply to $20 after the FTX collapse, and then surpassed $100 in mid-February.\n\nSeveral factors explain this rebound. On one hand, investors are returning to cryptocurrencies after difficult months. On the other hand, new projects are emerging on Solana, attracted by its low transaction fees.\n\nTrading volumes are surging, fueled by risky speculation. Last weekend, Solana even overtook Bitcoin and Ethereum in terms of spot transaction volume in SOL/USDT, reaching an impressive $1.037 billion on Binance.\n\nDoes this spectacular comeback mean that Solana is threatening the dominance of Ethereum? Not yet. With 29 billion dollars of assets locked, Vitalik Buterin‘s blockchain remains well ahead. Solana is worth 15 times less, at 1.5 billion according to data from DefiLlama, despite its rapid growth.\n\nNevertheless, this contender poses a serious threat. Solana continues to attract projects thanks to its low fees and record speed. If it overcomes its stability issues, it could continue to gain market share from Ethereum in the coming years. Their rivalry promises to be thrilling.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxQYlRCbjlUdDY1TEFaUVJDVWZHSjFlMHFQc2hMNXJoZVpVSV9ub2NHSXp4MVZBVkZkTk5ZQ29zazhWMjgtbkNvcFoxYVNqSXFLU3dTLUNQb0o3bVR0dEFENlFJRy1TSXM5SHFBajJHQ3hfWmR4R1N6ZkR1LVdfZmRLRmd2b0xOeWlTU256S0tEWW5TQ3ot?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 29 Dec 2023 08:00:00 GMT",
        "title": "Ethereum rainbow chart forecasts gains alongside Cosmos and Everlodge - crypto.news",
        "content": "Disclosure: This article does not represent investment advice. The content and materials featured on this page are for educational purposes only.\n\nEthereum’s bullish trend might continue in 2024. It reached highs over $2,300 recently, with a slight correction in the past week. Investors expect Ethereum, alongside Cosmos and Everlodge, to rally. Though Ethereum could offer gains in the long term, Everlodge offers better short-term potential.\n\nEthereum rises despite SEC’s decision\n\nDespite a delay in the SEC’s decision on Ethereum ETFs, Ethereum has increased slightly.\n\nThis has disappointed some investors who hoped prices would surge if a spot Ethereum ETF were approved.\n\nEthereum is now trading at $2,189.\n\nCosmos is booming\n\nCosmos has been trending higher in 2024, with its Inter-Blockchain Communication (IBC) protocol facilitating over $30 billion in annual asset transfers across over 100 chains.\n\nProjects like MilkyWay, launched on the Cosmos ecosystem, are expected to drive further growth, potentially pushing ATOM’s price to $12 in January and $15 by Q1 2024.\n\nEverlodge aims to reshape the travel property market\n\nEverlodge is a decentralized finance (defi) platform that allows users to invest in a portfolio of luxury villas, holiday homes, and even hotels.\n\nThrough fractionalized NFTs, you can gain ownership and receive a guaranteed income stream.\n\nhttps://twitter.com/EverlodgeHQ/status/1734201902387069327\n\nUnlike traditional property investments, Everlodge opens up new opportunities for diversification and growth.\n\nThe project has garnered significant interest, with seven presale stages sold out and stage 8 gaining popularity.\n\nELDG holders will enjoy exclusive benefits, including discounts on property purchases, trading fee discounts, and free stays in Everlodge properties.\n\nLater, ELDG will list on Uniswap and two tier-1 exchanges."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTE5CelMtcS1KY1B5NXl4VkNLSkszeG9RYkNKYnA0dlk2WDR6bml6dmpwSkpyLUw3UU5uVmlVRTdFYk96QXRTb0F4MHVCUGZoZTBIdUxmbHl1OWRUQ3B0VXRfd285OFJBa3RuUjBjckktX2FpQWvSAXhBVV95cUxOd1pUZ0Nfd01RRTEtbzZxYzg2ZzlTaTBfdV83M0lZNndiZzNCUzJOUlpuZkhXRWR5WmhuSDF4M211U0NYcHp3aUxLZUx3R0NsbVE0cXVJMWhLTGYwVmsxckhoYm5CTHRHU1hrODZuOE1yRzRqaFdyaE4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 30 Dec 2023 08:00:00 GMT",
        "title": "Solana's Rising Search Popularity: A New Trend in the Crypto World - Coinnounce",
        "content": "Google Trends Highlight Solana's Surging Interest\n\nIn an intriguing turn of events within the cryptocurrency sector, Solana has garnered significant attention, surpassing Ethereum in Google search interest for the first time in 2023. This surge in curiosity reflects the dynamic movements within Solana's ecosystem and hints at changing trends in the crypto community.\n\nSolana vs. Ethereum: A Shift in Search Dynamics\n\nThroughout most of 2023, Ethereum maintained a considerable lead over Solana in terms of search interest. However, the period from December 17 to December 23 marked a pivotal change, with Solana achieving a search interest score of 56 compared to Ethereum's 50. Google Trends forecasts that Solana's search interest will reach a peak score of 100 between December 24 and December 30, indicating \"peak popularity for the term.\"\n\nInterestingly, the surge in Solana's search interest is more pronounced in countries like Spain and the Philippines, while Ethereum continues to dominate in regions such as Indonesia, Taiwan, and Morocco.\n\nAssociated Search Trends and Market Movements\n\nUsers searching for Solana have also shown interest in terms like \"bonk\" and \"tensor.\" Bonk, a dog-themed memecoin, overtook Pepecoin in market capitalization on December 8 after witnessing a 370% monthly gain. Tensor, a Solana-based nonfungible token (NFT) marketplace, has created the Tensorians NFT collection, which also experienced significant gains in the last 30 days.\n\nSolana's increased search interest may be partly attributed to the recent rise in the price of its token. On December 20, Solana's market capitalization surpassed Ripple's XRP, with the token price increasing by 13.8%, reaching over $82 for the first time since May 2022. This surge briefly positioned Solana as the fourth-largest crypto token by market cap, surpassing BNB on December 22. However, by December 29, BNB regained its position as Solana's token prices returned to levels seen before Christmas."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxNMEx1RHN0dDRGRDJ4YnFjcVpzZTFVRlJPbXVzdWQ1VF9KeXc5ZS02bVNzampTX04yUlZuemZKYnBsR1V5M0gzNWdrc0NFcU5ONUhBd1VMd012NHJJd3dUUEZkMTBMdHVmblBqQm8zRWVfTDg1MV9YRmcwcnlvaU84Qk5PVTNRd2JoeXRZM2FkQjJtTlppbzlBM2Y0c9IBoAFBVV95cUxNcGpjRzJSLUl4dGlZcVM5TzlYcV9IRjRDSW04R05wU29BYzVHdG9JS295U2RBVUs3RW9jV0VQSGdUekZWOGF2RmYycDJkN2J4Y0NDeFlZMlZtclUxc1BBYzdGdWFyVmZOWmc1eDlUamhGUFZ0YWxta2dKVUpkSTVEbnhTRVZxeHFkZzgySll5MFV3SWROeXEwSG9KX2VWRGpt?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 29 Dec 2023 08:00:00 GMT",
        "title": "We Asked ChatGPT if Solana (SOL) Can Become the Biggest Altcoin in 2024 - CryptoPotato",
        "content": "TL;DR\n\nSolana’s SOL token has shown impressive performance this year, with significant growth in price and market capitalization, making it one of the top digital currencies in the market.\n\nFuture growth potential for SOL hinges on factors like technology adoption, overcoming past network issues, regulatory developments, and potential strategic partnerships, which could enhance its market value and utility.\n\nDespite its progress, SOL’s market cap is still behind major players like Ethereum, but it has surpassed them in certain metrics like trading volume and NFT sales volume in recent times.\n\nCan Solana (SOL) Progress Even More Next Year?\n\nSolana’s native token – SOL – has been a top performer this year, with its price reaching almost $125 earlier this week. The token has skyrocketed by over 1,000% since January 1, while its market capitalization briefly surpassed the $50 billion mark and is currently standing at around $48 billion (per CoinGecko’s data).\n\nThis uptrend has made SOL the fourth-largest digital currency in the entire market, outpacing Binance Coin (BNB) and Ripple (XRP).\n\nIn the following lines we will take a deeper dive and check whether the asset’s progress could continue next year with SOL becoming the biggest alternative coin in the realm.\n\nAccording to ChatGPT, such a scenario is not out of the cards but hinges on on multiple elements. One major factor is the possible adoption of the asset’s technology and network. Solana is known for its low costs and fast transaction speed, which makes it a preferred ecosystem for decentralized applications.\n\nThe AI-powered chatbot also estimated that SOL’s future success depends on coping with some issues that have caused reputational damage to the blockchain protocol in the past. Recall that Solana has experienced numerous network outages in the last few years.\n\nRegulatory development was also outlined as a vital factor. According to ChatGPT, the implementation of favorable rules in the crypto industry could have a positive impact on SOL.\n\nLast but not least, the chatbot pointed out possible partnerships that the blockchain entity might strike up with prominent organizations. Such strategic collaborations could enhance SOL’s utility and adoption, potentially boosting its market value.\n\nDespite its rapid recent progress, SOL’s market capitalization is still far from Ethereum’s (almost $270 billion) and the one of USDT ($91 billion), meaning it has a long way to go before being throned as the largest altcoin.\n\nSolana has Already Surpassed Ethereum in These Metrics\n\nIt is worth noting that Solana has performed better than its rival for the top – Ethereum – in some aspects. According to DefiLlama, trading volume on Solana has surged above $1.3 billion in the past few days. For the most part of the month, Ethereum was lagging behind.\n\nSolana has also performed quite well in the non-fungible token space, registering an NFT sales volume of over $88 million in the last week. Ethereum has fallen behind with approximately $74 million for the same period.\n\nWhat is more, Solana flipped Ethereum in terms of search volumes on Google, which is a testament to the growing interest in the cryptocurrency."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiS0FVX3lxTE13bWN5VDFqZGJReWY3TUJvMTIyQ08tczNaazBMaWx2Rkg2SlIzOEYzYjFwWi1SS2ZzZDNIV0FSV0ZfZWs1bFBwYmozVdIBQkFVX3lxTE1yX0VuNW1zemxZeWROaUlyeC1aamIzYjVTTEFpVWVCNUk2dEk0dkhKQkIxeF9YbDJYV2wxWGtJVGlIQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 30 Dec 2023 08:00:00 GMT",
        "title": "Vitalik Buterin Reveals Ethereum Roadmap For 2024 - VOI English",
        "content": "JAKARTA - Ethereum founder Vitalik Buterin has shared plans for the Ethereum roadmap for 2024. He acknowledged that there were only minor changes compared to last year.\n\nIn a series of posts on platform X (formerly Twitter), Buterin explained that the focus continues for Ethereum in 2024 centered on six main components.\n\nFurthermore, in a detailed graph with annotations and diagrams, Buterin outlines these six elements the Merge, the Surge, the Scourge, the Verge, the Purge, and the Splurge.\n\nHe pointed out that, as Ethereum's technical direction became clearer, there were only a few minor adjustments compared to the 2023 road plan. \"As Ethereum's technical direction becomes clearer, there are relatively few changes,\" he said.\n\nBy popular demand, an updated roadmap diagram for 2023! pic.twitter.com/oxo58A2KuG — vitalik.eth (@VitalikButerin) December 30, 2023\n\nBy popular demand, an updated roadmap diagram for 2023! pic.twitter.com/oxo58A2KUG\n\nThe Merger is highlighted as a key part of the road plan, aiming to maintain a simple and long-lasting proof-of-stake (PoS) consensus.\n\nIn September 2022, the Merge took place, integrating the Ethereum mainnet with the proof-of-stake blockchain, Banyak Chain.\n\nFollowing the merger, the most significant observation on Ethereum is the transition from a proof-of-work (PoW) consensus mechanism that consumes high energy to PoS, resulting in a huge drop in network total energy consumption.\n\nHe also noted developments in Ethereum's single-slot finality (SSF). The finality aims to ensure that changes to blockchain block cannot be reversed without burning at least 33% of the total Ether at stake.\n\n\"The role of the single slot finality (SSF) in post-Merge PoS improvements is getting stronger. It is clear that SSF is the easiest path to solve most of the current Ethereum PoS design weaknesses,\" he said.\n\nThis comes after Cointelegraph recently reported that Buterin wanted to restore the original idea of a \"cypherpunk\" revolution to blockchain.\n\nCypherpunk refers to someone who uses encryption to ensure privacy when accessing computer networks, especially from government authorities.\n\nIn a post blog, Buterin explains that Ethereum was originally idealized as a \"public decentralized shared drive\" that could leverage peer-to-peer messaging and decentralized file storage.\n\nHowever, the vision began to fade in 2017 by turning towards financialization on Ethereum.\n\nButerin highlighted that rollups, proof of zero knowledge, account abstraction, and second generation privacy solutions have become more mainstream. He noted that this could support certain values related to the principle of cypherpunk.\n\nThe English, Chinese, Japanese, Arabic, and French versions are automatically generated by the AI. So there may still be inaccuracies in translating, please always see Indonesian as our main language. (system supported by DigitalSiber.id)"
    }
]