[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTFBlZjl0bXJDMFI1WkU5UEdLaDZQdC1ZZWROX29GQ2hXTWpTZnZHZlYwcEZrcWFyeHdrVllmREhjMjlJdGFyWUFyODZ1Q0w5bHpGdm5qZV80eVhJZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Dec 2023 08:00:00 GMT",
        "title": "What Is Polygon? • Layer-2 Ethereum Scaling - Benzinga",
        "content": "Want to invest in Polygon? eToro makes it easy to buy MATIC with a simple trading platform and low fees!\n\nThe Ethereum ecosystem is the largest and most vibrant of smart contracts compatible Layer 1 blockchain. However, high transaction fees on the Ethereum network have alienated investors from this product. High gas fees on the Ethereum network have led to the development of rival blockchains — such as Cardano, Solana, Avalanche — sometimes referred to as ETH killers. Although these blockchains are often faster and cheaper than Ethereum, they lack the security and the network effect of Ethereum's massive user base.\n\nLayer 2 solutions are applications created to help scale a blockchain. Examples of Layer 2 solutions are the Bitcoin Lightning network, Arbitrum and Polygon Crypto. These Layer 2 solutions process transactions off the mainnet, or Layer 1, and post them back in groups using rollups. Layer 2 solutions help increase transaction speed and reduce gas fees while still providing the security and decentralization of the mainnet. Layer 2 solutions are also often referred to as sidechains.\n\nOverview of Polygon\n\nPolygon is a Layer 2 scaling solution for the Ethereum blockchain. Polygon acts as a faster blockchain running concurrently alongside the Ethereum blockchain that uses multiple sidechains. These sidechains operate using the following methods to help improve scalability methods.\n\nZK-Rollups: ZK-rollups process multiple transfers off the Ethereum mainnet. These transfers are then bundled into a single transaction and posted to the mainnet. This process reduces the volume of transactions and the amount of data being processed on the Ethereum mainnet, enabling cheaper and faster transactions.\n\nPlasma chains: Plasma chains are blockchains that run alongside the Ethereum mainnet. The two blockchains can communicate with each other and allow assets to travel between them. Plasma chains have a consensus mechanism that creates blocks, and the root of each plasma chain block is published to the Ethereum mainnet. These roots are little pieces of information that can be used to prove the contents of those blocks.\n\nOptimistic rollups: Optimistic rollups are similar to ZK-rollups, except that they assume transactions are valid by default. They only run computations in the event the integrity of a transaction is challenged.\n\nThe MATIC token is Polygon’s native cryptocurrency. MATIC, an ERC-20 token, is used for staking, fees and governance.\n\nWhy Do People Use Polygon?\n\nPeople use Polygon because of its fast transaction speeds and low gas fees. Gas fees on Polygon are often just a couple of cents, far lower than those charged on Ethereum. People also use Polygon because the network benefits from the strong security of the Ethereum blockchain, and it can benefit someone who wishes to be a contributor to the blockchain technology.\n\nPolygon History\n\nPolygon was launched in October 2017 as the Matic Network. Polygon was co-founded in Mumbai, India, by developers Anurag Arjun, Jaynti Kanani and Sandeep Nailwal. Kanani was a former data scientist at Housing.com before helping found Polygon and serving as the company’s CEO. Nailwal was the previous chief technology officer (CTO) of Welspun Group. He also worked as a consultant at Deloitte and started another company known as ScopeWeaver. Arjun worked as a project manager at IRIS Business, SNL Financial and Dexter Consultancy. Matic was rebranded as Polygon in February 2021 to reflect its wide array of scaling solutions.\n\nWhere To Buy MATIC\n\nMATIC can be purchased from most centralized exchanges such as Voyager, Crypto.com and Binance. MATIC can also be purchased from decentralized exchanges such as Uniswap and MetaMask Swap. Polygon uses a proof-of-stake consensus mechanism. If you already own MATIC, you can earn more of it by staking and buy cryptocurrency to diversify your portfolio along with the Polygons you already hold.\n\nPolygon vs. Other Blockchains\n\nThe Polygon blockchain fundamentally differs from other blockchains such as Bitcoin and Solana because it relies heavily on another blockchain for its security. Polygon is in effect a part of the greater Ethereum ecosystem.\n\nArbitrum is another Ethereum Layer 2 scaling solution. Arbitrum is slightly more decentralized because it is secured by Ethereum’s large network of miners. Polygon, on the other hand, is secured by MATIC staking, which is a smaller pool of capital when compared to the miners who secure the Ethereum network. Polygon is slightly cheaper to use and has faster withdrawal times when transitioning your assets back onto the Ethereum Network.\n\nHow to Store MATIC Safely\n\nIf you wish to purchase a large sum of MATIC tokens, it is crucial to take the proper precautions to store your cryptocurrencies safely. The best place to store your MATIC tokens is on the hardware wallet Ledger.\n\nLedger is a hardware cryptocurrency wallet that stores access to your cryptocurrencies on an external device. Ledger wallets are not connected to the internet. This feature is beneficial because hot wallets that are connected to the internet are much more likely to be exposed to scams, hacks and private key leaks. Ledger wallets are currently priced at around $60 to $250 depending on the model you choose.\n\nShould You Use Polygon?\n\nPolygon is a scaling solution for the growing cryptographer that aims to improve the speed and reduce the cost of using the Ethereum blockchain. The company not only helps bring new cost-conscious users into the Ethereum ecosystem, but it also retains existing users. Many Ethereum projects are in the process of deploying on Polygon, and the Polygon Labs ecosystem is only expected to grow and add scaling solutions over time. However, the Ethereum 2.0 upgrade risks rendering Ethereum’s Layer 2 solutions less valuable as the mainnet scalability improves.\n\nFrequently Asked Questions"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiyAFBVV95cUxNUGpSbExreGNSY1piNVlzdmZuaE5NUGFWbElVV2ZUZjRNdzNucGtiSm9HcngzaWs2dHFENkRKYndXNEJaM0hZWURPOWxOa2dyQ0JXVVpJVXJVaFRKcnFHUFVHMzhjVVpHdTVrYTF5TmpLMUc2S0JDRDI5RkF5TWpaVURQbTB2Ni1DLXZqOGw5ZnA5VTdTSmJfUmZKQndKcmxsNEROczRfakhONFVuR2szZmNJeHozeFF6TUgxRXdNVjVBWTNCZ2pKdtIBzgFBVV95cUxOSWtpZzhTTG8wVmhGbmdJekQ2VjI5TV91Q0x0VlpRN3NUSVRTSWJobjc4YU1TU2RhMWtKZWxXQUhabWxmTm9qbHN6d21pZVVZd1U0NHcybk9DNk1lenkwcGNCS21hNU01Z2RCOWpPTVloQjNfTXR2U3NmYnpYeWt5ZGJMZ25YaTduVmcyMFVfOWhEQzJWRXpPdlJOX1lpN3FFT1YwZlpQdnhia21JRDlnMDVrekYxaGxoVVZlejZ0Qjd2cXBiSnowMDBzWlFoQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 17 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Whale Dormant for One Year Begins Selling Off Its Coins As ETH Loses Steam: Lookonchain - The Daily Hodl",
        "content": "New data reveals that a deep-pocketed Ethereum (ETH) investor has woken up from a year of dormancy and is selling off its crypto assets as the top altcoin loses momentum.\n\nAccording to blockchain data tracker Lookonchain, the crypto whale has woken up from a 12-month slumber and is selling its stash of ETH over decentralized exchange platforms (DEX).\n\n“A whale that has been dormant for one year is dumping ETH on DEX! So far, 18,865 ETH has been sold for four million DAI through four new wallets, the average selling price is $2,229. And currently has 5,588 ETH ($12.5 million) left.”\n\nEthereum is trading for $2,214 at time of writing, down about 6% from its 2023 high of $2,359.\n\nLookonchain then brings its attention toward the amount of decentralized oracle provider Chainlink (LINK) deposited into Binance, the top crypto exchange platform by volume. According to the data, noncirculating supply wallets deposited 8.3 million LINK, worth $119 million at time of writing, into Binance.\n\n“The wallets [have] deposited LINK to Binance every three months since Aug 26, 2022.\n\nInterestingly, most of the time, the deposit is at the bottom of the price and the price rises after that.”\n\nChainlink is trading for $14.08 at time of writing.\n\nConcluding its analysis with Solana-based (SOL) memecoin Bonk (BONK), Lookonchain says that while one savvy trader lost $46,000 on November 1st, on December 15th, the same entity made a staggering $4.4 million from trading the dog-themed meme asset.\n\n“This trader owns two wallets. In the past year, the trader withdrew 334.5 billion BONK ($218,000) [from crypto exchange] MEXC and bought 32.18 billion BONK ($41,000) from DEX.\n\nAnd deposited 204.2 billion BONK ($80,000) to MEXC, leaving 172.5 billion BONK (worth $132,000 on Nov 1st). On Nov 1st, he still lost $46,000, but today he made $4.4 million.”\n\nBONK is trading for $0.0000205 at time of writing.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Animedigitalart"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxOMk0xdHB1dUdza2c1OHd6OTVTMUhnV0VuaWxrbl8wUmVLZlZNNHc2aDRvaFJVUFl5VXhrUHlVc0pFOG9ZNXpmeDZ0b3dwY3JzMHlYOFF6bWpNMTBmMGV6THFYS2RLZEE5SjJOU1VlUXJxUXV1ZGhJQ0pqbzJOUlZSd0F0SDdNQdIBiwFBVV95cUxPcTZGcUxrNktQblpUSWdwaElNMlpnTTBIaFM1RjBMWV93U01hS1lMSUJfbHQyQ2xCeG11ekF1a0lGcC14ZW4zb2cwb3BkNVI5Slg3cklIdHlQWlg0aEI0T1E0X3lOaHF3RzhubmNnQXM5N2NRQ2J4ZEQ0bFoyckROemVzSXQtQnIzQ1g0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 17 Dec 2023 08:00:00 GMT",
        "title": "5 Cryptocurrency Predictions for 2024: Charting the Future of Digital Assets - Investing Haven",
        "content": "As we head into the 2024, several compelling trends emerge in crypto, shaping the future of digital assets. In this article, we look at 5 cryptocurrency predictions that could define the crypto space in 2024 and 2025. From our crypto charts, we derive 5 trends that will shape the future of digital assets, beyond our XRP forecast 2024 and $10 XRP forecast.\n\nIn recent years, we published our cryptocurrency forecast, each and every year right before year-end. If anything, it can be said that most, if not all, of our cryptocurrency predictions came true. Only our 2022 cryptocurrency predictions were somehow postponed, but eventually were achieved in 2023 or are close to be achieved in 2024.\n\nCrypto Prediction #1. Bitcoin’s Ascension to All-Time Highs\n\nBitcoin, the pioneer of cryptocurrencies, along with Ethereum, is poised for a remarkable journey in 2024. We explained our viewpoint, in great detail, in the following articles, cryptocurrency predictions published a while ago but highly accurate based on the current path of Bitcoin:\n\nA Bitcoin Price Forecast For 2024\n\nHow High Can Bitcoin Go In 2024?\n\nWill Bitcoin go to $100,000 in 2024, 2025 or 2026?\n\nOur compass is the seven-year rising channel etched on its weekly chart, guiding us towards the anticipation of Bitcoin revisiting its previous all-time highs. As the market dynamics continue to evolve, Bitcoin’s resilience remains a cornerstone, offering investors a reliable pathway in the crypto universe.\n\nCrypto Prediction #2. Game-Fi Resurgence\n\nIn the ‘beaten down’ area of blockchain gaming, Game-Fi is set to reclaim the spotlight. Axie Infinity, a trailblazer in the sector, serves as our North Star, pointing to a resurgence of interest and activity.\n\nThe vast majority of investors will look at the chart of Axie Infinity, with a lot of disinterest, and run for the hills because it’s not hot. Over here, at InvestingHaven, we get unusually excited from Axie Infinity, simply because we see the bullish reversal that is clearly, visibly, certainly going to resolve to the upside. We believe that AXS will move to 40 USD, it will start in 2024 and might be complete late 2024 or in 2025. We stay focused on the future direction of this chart, not the current ‘lack of momentum’. In fact, we see momentum coming, it makes us unusually excited.\n\nAs blockchain gaming ecosystems mature, expect Game-Fi to captivate audiences anew, presenting exciting opportunities for both gamers and investors. For those that want to spot the best opportunities in Game-Fi, we recommend following our crypto investing research service because we will not feature the best Game-Fi tokens in the public domain.\n\nCrypto Prediction #3. Real-World Applications, Tokenization and NFTs in Focus\n\nThe crypto sphere is on the cusp of integrating with the tangible world. Real-life applications, whether in tokenizing physical assets or expanding the horizons of non-fungible tokens (NFTs), are becoming a reality. 2024 could witness a transformative phase where blockchain technology steps out of the digital realm and makes a tangible impact on the real world.\n\nCrypto Prediction #4. Micro Caps’ Meteoric Rise\n\nThe crypto market isn’t just about the giants; hidden gems in the form of small and micro-cap coins are poised for a spectacular ascent. A multitude of charts reveals bullish reversals, quietly biding their time for the opportune moment to explode. Throughout 2024, keep an eye on these underdogs, as they have the potential to surge a hundredfold, rewriting the narrative of crypto investments.\n\nOne of the illustrations of what we are saying is the token shown below. We are, on purpose, not showing the symbol, simply to avoid a misunderstanding (some readers might take it as a ‘buy recommendation’ which it isn’t). We use this chart as an illustration of the tremendous upside potential in some, not all, micro caps and nano caps.\n\nCase in point: the token shown below had a market cap of 1.5m in October, it went up 20x in a matter of 3 weeks, after which it retraced. We are 100% sure that many more micro caps and nano caps will follow the same path. Note that the token shown below has another 20x upside potential.\n\nCrypto Prediction #5. Meme Token Surprises, Beyond the Expected Names\n\nMeme tokens, often characterized by unpredictability, are set to surprise. However, the stars of this show might not be the familiar names. Buckle up for an unpredictable ride, as a select few meme tokens, hitherto under the radar, could undergo a staggering tenfold increase. In the crypto world, expect the unexpected.\n\nOur top meme pick was featured in our latest premium crypto alert, with very specific entry and exit areas, along with a strategy to multiple the tokens over a period of 2 years without doing anything. We recommend signing up to find out which meme token we are talking about, and read our strategy: Crypto – Time For Some Partial Exits And Free Tokens.\n\nConclusion\n\nAs we step into 2024, the cryptocurrency space promises excitement, innovation, and unforeseen opportunities. While the future is inherently uncertain, these five predictions offer a glimpse into the potential trajectories that digital assets might traverse. Whether you’re a seasoned investor or a curious enthusiast, navigating the crypto landscape requires adaptability and a keen eye for emerging trends.\n\nSign up to get top token tips which we will not feature in the public space >>"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxQZUhkSG1lR3lRX0VvVTRnVnVFZHRaUDQ4TDZmOHlWTklOUTdiRDhLVFIxUEVwSXVHQXRtdzk0Zzl5OWlrS1ZUYXdudWs3S2Q1bkZzQXRPZVVTLXlFZkkySjBCWUhoRks3S2hxQ1BId0RuNFhkdWVLOUpIV2FOSWx6VFpqbm1URl9ybFNHaFM0V3hBU2RQYnc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Dec 2023 08:00:00 GMT",
        "title": "Solana: il momento dell'Ethereum-killer è arrivato - The Cryptonomist",
        "content": "In the last few days, Solana has surpassed Ethereum.\n\nHowever, this is not a general overtaking, so much so that for example, in terms of market capitalization, ETH’s is still almost ten times higher than SOL’s.\n\nThe overtaking, instead, occurred in a specific context, and as far as a single parameter is concerned.\n\nDecentralized Exchanges: Solana vs Ethereum\n\nAccording to DefiLlama data, daily trading volumes on Solana DEX have reached those of Ethereum DEX.\n\nOn the contrary, on Friday for the first time in history, the daily trading volume on DEX on Solana exceeded that of DEX on Ethereum.\n\nBREAKING: @solana FLIPS @ethereum IN 24H DEX VOLUME FOR THE FIRST TIME IN HISTORY pic.twitter.com/fmcYjnlyeq — DEGEN NEWS 🗞️ (@DegenerateNews) December 16, 2023\n\nNote that these are relatively small volumes, around one billion dollars. For example, the daily trading volumes of ETH on centralized exchanges exceed 8 billion dollars, while those of SOL are less than 2 billion.\n\nFurthermore, it should be noted that the data related to DEX does not only concern the exchange of ETH and SOL cryptocurrencies, but also all the other tokens present on the Ethereum and Solana blockchains.\n\nIn particular, the recent boom in trading on Solana’s DEX is mainly due to the boom of the Bonk token.\n\nThe incredible hype about Bonk\n\nTaking into consideration the overall trading volumes of Bonk on both DEX and decentralized exchanges, the all-time peak occurred precisely between December 15th and 16th.\n\nBonk is a token on Solana launched in December of last year, and had never exceeded $200 million in daily trading volume until December 8th.\n\nActually, to tell the truth, if we exclude the initial weeks, afterwards it didn’t even exceed 10 million until the end of October.\n\nStarting from the end of October, with the awakening of the crypto markets, both trading volumes and price have skyrocketed.\n\nOn December 13th, volumes had risen to $350 million, and the following day they had already skyrocketed to $680 million.\n\nThe peak on December 15/16 first saw a surpass of 3 billion dollars, and then a decline to 2.6 billion. These numbers alone are able to justify the surpass of daily trading volume on the Solana DEX compared to the Ethereum DEX.\n\nThe return to normality\n\nIn fact, yesterday the trading volume of Bonk tokens dropped to 1.1 billion dollars, and the daily trading volume on DEXs on Ethereum has returned higher than that on Solana.\n\nSince Bonk is a token that “awakens” before Christmas, this trend is destined to quickly fade away, and yesterday’s decline seems likely to persist today.\n\nTherefore, it was an exceptional circumstance not specifically related to Solana but to a token issued on the Solana blockchain, and therefore exchangeable on Solana DEXs and not on Ethereum ones.\n\nFor example, considering other parameters such as TVL, Ethereum continues to dominate undisputedly, with 55% of the entire DeFi TVL DeFi.\n\nAlthough it is slightly down compared to the 56% at the beginning of the month, it is still more than the sum of the TVL of all the other chains put together.\n\nIn addition, Solana is not even on the podium from this point of view, because compared to 28 billion dollars of TVL on Ethereum, 8 billion on Tron, and 3 billion on BCS, Solana is only in fifth place with just over one billion.\n\nThe same market capitalization of Bonk is just over one billion dollars, and this indicates that there are not many BONK tokens locked on DEX.\n\nSolana is challenging Ethereum\n\nDespite this, it can still be said that SOlana is somehow challenging Ethereum.\n\nWhile Ethereum in general seems untouchable at the moment, there are niches where Solana or other chains can perform better.\n\nIn particular, they perform better where it is more important for fees to be contained. For example, on DEXs it can be a problem if the average transaction fees are around $10, as is the case with current transactions on Ethereum.\n\nSolana allows for faster transactions and significantly lower costs, so it’s no wonder that tokens like Bonk, which are not appealing to large investors, are now being issued on blockchains like Solana and traded there, perhaps on DEX platforms.\n\nMoreover, Bonk has only recently been added to the main centralized exchanges, while until just a few days ago it could practically only be traded on DEX.\n\nNote that the trading volume of Bonk in the last 24 hours on all exchanges has dropped below 700 million dollars, so the phenomenon mentioned above seems to have run its course."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxOLTMxMnhnRkpueHAyZGxzd3JWb21YRGFlNlhPVUJ6NEF2ODloaE5RdzNIRi1veHJxYlZrcnJ5dkZBZnRiRXBzVDJfRmdzdkF1UlNrX2toajZkelJuZ1o1dldNZXFRU0lqRWhQc2NIcTF4R0s3bXJwMmtnUE1ya2NDVVprT0pFZXc4X29iLUlMMC00U2Z5TGVYNFIyeGk2X25f0gGoAUFVX3lxTE1UWFByNGlMellvNW9YOVBnS2dmcTBwU2xHUFcyU25QRHJLYVRUb3drSzNOR1dRUnBwN2x6dTNySlE5Y3VvTUdRaEthLXFMd0tRYmplNHNWbnJnNGZlTWg5VHBDOGk4Y2VPMWowZHdzLTczNUtGZF9Pb200UVZrSERKMkxBclRPY3Jqd0VJbnVyQWQ5ZTl2UWtVYW5YUTBJaG9kNUcycXltUg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Dec 2023 08:00:00 GMT",
        "title": "Ubisoft's 'Champions Tactics' Ethereum NFTs Generate Millions After Free Mint - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nUbisoft’s upcoming battler game Champions Tactics: Grimoria Chronicles sold out of its free Warlords NFTs within minutes—and has seen over $2 million in sales within a couple hours of its public mint, per CryptoSlam data.\n\nAfter a limited presale for select fans, the pixelated profile picture-style Warlords minted out in less than 20 minutes during the collection’s free public mint that occurred at 4pm ET Monday.\n\nThe NFTs are now trading on secondary marketplaces like OpenSea for roughly $600 each, or about 0.27 ETH, at time of writing. Only 7% of the 9,999 NFTs are currently listed for sale—a stat that suggests most collectors plan to hang onto their Warlords so they can use them to unlock the game’s next free mint for its in-game characters.\n\nWhile the Warlords NFTs were free to mint, buyers did have to pay Ethereum gas fees for their transactions, which can fluctuate wildly from tens to hundreds of dollars depending on network traffic. Champions Tactics will use the Oasys blockchain for its other crypto integrations, which promises a gas-free gaming experience.\n\nAD\n\nAD\n\nPrologue completed.\n\nStay tuned for reveal... pic.twitter.com/iP08QG7poH — Champions Tactics (@ChampionsVerse) December 18, 2023\n\nGamers who missed out on the Warlords mint and don’t want to drop $600 in Ethereum to play the game aren’t out of options, though. According to the game’s website, Ubisoft will offer a free Champions figure drop at a later date, with more details yet to be revealed.\n\nChampions Tactics is expected to release sometime in 2024.\n\nEdited by Andrew Hayward\n\nAD\n\nAD"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxONEJCVkhsOUloWjJON015aHlvMGl3a2tsRHUwU21WRXRUcWk0UmNrQ0V5am5ESlp3ODVLVTR4cUpieDVUd0tCbUdYRVJCTEtHd0ZxZVI5eE5uMGNfQTlpelVBcFAzOXBDaUpZWlBFbVBlTmU1SV83YXpScHZ5bWUzbm9wcW4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Dec 2023 08:00:00 GMT",
        "title": "AGII Goes Multichain: Launches AI Tools For Ethereum (ETH) - Yahoo Finance",
        "content": "New York, New York--(Newsfile Corp. - December 18, 2023) - AGII, a prominent Web3 AI platform backed by KaJ Labs, is pleased to announce the launch of its AI tools on the Ethereum (ETH) blockchain. This strategic move extends AGII's innovative solutions, including content generation, coding support, and NFT creation, to Ethereum users.\n\n\"We're excited to bring AGII's AI capabilities to the Ethereum network, delivering practical solutions to a wider audience,\" said J.King Kasr, CEO at KaJ Labs.\n\n\n\n\n\nAGII\n\n\n\nTo view an enhanced version of this graphic, please visit:\n\nhttps://images.newsfilecorp.com/files/8833/191346_30.jpg\n\nThis expansion reinforces AGII's commitment to providing user-friendly AI tools in the Web3 era. In collaboration with KaJ Labs, AGII aims to bridge the gap between AI capabilities and the Ethereum community, fostering seamless integration for developers and users.\n\nThis joint initiative reflects the shared vision of AGII and KaJ Labs to contribute to the evolution of the Web3 landscape, ensuring decentralized technologies are accessible on a global scale.\n\nAbout AGII:\n\nAGII is a leading AI platform in the Web3 space, providing practical solutions for content generation, coding, and NFT creation.\n\nAbout KaJ Labs:\n\nKaJ Labs is a decentralized research organization dedicated to AI and blockchain technology, supporting innovative projects globally.\n\nMedia Contact:\n\nDorothy Marley\n\nKaJ Labs\n\n+1 707-622-6168\n\nmedia@kajlabs.com\n\nVisit us on social media:\n\nhttps://www.instagram.com/kajlabs/\n\nhttps://twitter.com/kajlabs\n\nTo view the source version of this press release, please visit https://www.newsfilecorp.com/release/191346"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiXEFVX3lxTFBWMjExd1Y1bHJPMXlzd2Y3RjA1WVpFMElwWml2R25pa3VqeFhWSFhyRkhUclp6b0FsN3A3WEcwb2dLbGhVM0N3VUdzaTVmNXpJelNNVE44YVJWVWN20gFiQVVfeXFMTmhfTWNkTnpuUTlfVzNYcEVUMWx5MlcxdU9UcXFjUnJMbkFrQTV6N0pNdnM4M0N1bzFQdE9ZeWpmRWtvUHRwVUZEbFZWSW5TZGI0Rmp3cFc1RC1wUzJaZWpCakE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Dec 2023 08:00:00 GMT",
        "title": "The Sandbox Embraces Polygon – Lower Fees, Endless Creativity - NFT Plazas",
        "content": "The Sandbox Embraces Polygon – Lower Fees, Endless Creativity\n\nThe Sandbox, a renowned virtual gaming universe, has recently revealed a critical development shift: transitioning its digital marketplace from Ethereum to Polygon.\n\nBy now being powered by the Polygon blockchain, the Metaverse‘s marketplace offers reduced fees for minting assets. Anyone can craft and sell their virtual creations while earning royalties from resales, with minting on Workspace and its improved UX/UI making this process effortless.\n\nFurther highlighting its dedication to becoming more affordable and seamless, the platform is committing itself to covering up to 10 transaction costs per user every month.\n\nWhat’s more, as an additional celebration of the chain switch, The Sandbox Marketplace is unveiling over 100 new digital artworks. Each artistic endeavor — designed by 30 artists who are part of The Sandbox’s Creator Fund program — boasts a unique style like no other, comprising fantasy characters, futuristic designs, legendary creatures, and more.\n\n📣 Introducing The Sandbox Marketplace on @0xPolygon! 📣 Anyone can now mint ASSETs with greatly reduced fees! 💰 Monetize your creations – Put your work up for sale and even get royalties for every ASSET resold on the Marketplace. 📤 Mint ASSETs with ease – Upload to… pic.twitter.com/yhpOP8lACv — The Sandbox (@TheSandboxGame) December 14, 2023\n\nOther New Notable Gains\n\nAlong with the transition to Polygon, various improvements were made to the platform. The browsing and search features have been upgraded, making it easier for users to discover new digital assets. One significant enhancement is the capability of users to mint NFTs using CATALYST tokens, thereby enabling a broader range of creators to design unique virtual collectibles on the platform.\n\nFurthermore, The Sandbox acknowledges that not all creators are in possession of CATALYST tokens. To address this issue, it has begun free distributions for these creators, which include all LAND owners. Moreover, LAND owners who participate in subsequent activities are promised an extra allocation of tokens.\n\nNotably, all existing digital assets created on the Ethereum network can remain on The Sandbox. However, there’s also the provision to transfer these assets to Polygon in the near future. Thus, creators can continue to expand their digital landscapes unabated.\n\nThe Sandbox’s blockchain move offers several benefits for both users and creators. Lower transaction costs, upgraded platform functionality, and fresh opportunities underline. For aspiring creators, artists, and users, there are many exciting advancements to look forward to in this ever-evolving virtual world.\n\nWant more? Connect with NFT Plazas\n\nJoin the Weekly Newsletter\n\nFollow us on Twitter\n\nLike us on Facebook\n\nFollow us on Instagram\n\n*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment."
    }
]