[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE1nTDZEeWduMWdMWWxjRkttQnpxbXBEQzZpcTRBWFgxMGZCVzVRa2NvcG9mb0VUNWhlVWROOGtBWk82aFpQbmlzZ3M0dlVscEFHTjRjQW1jMGxOb2RlQS1Fa2tfdmI4cW5XQlUzdDBRZGVCRThRNHBMQTdB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Ethereum gets a BlackRock boost, but the real test lies ahead - Fortune",
        "content": "Happy Friday. The week is ending on a high note for Ethereum, which is back in the news after financial giant BlackRock filed to launch an ETF backed by Ether, the blockchain’s native currency. This led the price to jump 10%, back over the $2,000 mark, for the first time in months as investors bet that BlackRock’s entry will attract billions of dollars in new capital.\n\nThis development brings renewed attention to the world’s second-largest cryptocurrency, which has largely been overshadowed by Bitcoin and even Solana during the long-awaited rally of the last two months. But while Ethereum boosters are rightfully enjoying the price surge, the return of the spotlight has also raised some familiar concerns.\n\nThese include griping about Ethereum’s transactions costs, known as gas fees, which have soared along with the burst of activity on the blockchain that has come with more trading. For long-time crypto watchers, this will bring back unpleasant memories of 2017 and 2021 when hype over Ethereum’s smart contract promise led to a surge in price—followed by the blockchain slowing to a crawl, which in turn forced those who wanted to transact to pay outrageous fees.\n\nEthereum’s momentous shift last year to a proof-of-stake system was supposed to alleviate the price and congestion issues, along with so-called layer-2 solutions—sub-layers on the network that process transactions in batches and then record them on the main blockchain.\n\nThe trouble is that while the layer-2 systems do indeed lower costs dramatically, they add complexity and make the Ethereum user experience—already an ordeal for those who aren’t crypto diehards—even more of a headache. They are also less secure. This has led some to gripe that Ethereum should have devoted its energy to making its main network cheaper and efficient rather than outsourcing the task to other projects.\n\nFinally, the switch to proof of stake has also raised concerns over centralization as a relatively small amount of validators are now responsible for maintaining the network—a fact that Bitcoin purists, never gracious at the best of times, have lampooned mercilessly as part of the crypto world’s eternal infighting.\n\nNone of this means that Ethereum is facing major trouble—the network is the leading smart contract for a reason, with by far the most users and a robust and dedicated developer community. But as a new crypto bull market emerges, it will be harder for the platform to blame familiar headaches on growing pains. Ethereum is now almost a decade old, and the time has come for it to show it can deliver on its enormous potential.\n\nJeff John Roberts\n\njeff.roberts@fortune.com\n\n@jeffjohnroberts\n\nDECENTRALIZED NEWS\n\nChainlink's LINK token is up 175% since January as the oracle provider has branched out from pure crypto pricing to tie-ups with the TradFi sector. (Fortune)\n\nThe notorious \"Cryptoqueen\" who oversaw legal and compliance for Ponzi-like OneCoin pled guilty in the $4 billion fraud. (WSJ)\n\nEconomist Nouriel Roubini, a.k.a Dr. Doom, has long been a fierce critic of Bitcoin and crypto, but in a surprise move is launching his own stablecoin. (The Defiant)\n\nIn a first-of-its-kind crypto bankruptcy exit, a restructuring plan will give Celsius customers 37 cents on the dollar and shares in a new company dedicated to staking and mining. (WSJ)\n\nBitcoin brushed $38,000 on Thursday, the highest the token has traded in 18 months. (Fortune)\n\nMEME O’ THE MOMENT\n\nTFW you learn one-third of Ethereum nodes are 20 miles from CIA headquarters:"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxPelZ3eWk2a3pJSE1BOWY1aHY2RU1mWEU1VUp2dGgxaERES0xGeHpYQXBGZ1lkVnpLNTU2SDk2MVFRTFFvMWZuV0h2YVh4TnY4RlBMYjFMM1B5UEpoQTRBMW1tNTRvWEFsVVd4Sk5wQlBiRF9qRGhfaWhLX2J6MkZJc1Fnb0ZZa0ZHLXVDUjRQWFc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Solana Is on a Tear. So Why Do Ethereum NFTs Remain Top Dog? - Unchained",
        "content": "SOL more than doubled in the last month. But here’s why Ethereum NFTs continue to outperform Solana NFTs by a mile.\n\nSolana is ripping. Not only has general crypto market sentiment turned more positive, which has boosted assets beyond just bitcoin, but Solana also just completed another one of its attention-grabbing conferences, Breakpoint. That’s all led to SOL more than doubling in the past month.\n\nDespite developer interest in Solana, the jump in its token price, and the fact that the speedy chain is known for NFT activity, as of yet, the leading blockchain for NFTs remains Ethereum.\n\nRead more: NFT Trading Activity on Ethereum Surges, Reaching a Six-Month High\n\nAccording to data from CryptoSlam, in the past 30 days, Ethereum led the NFT market in sales volume with $245 million in sales. Ethereum’s activity underscores its dominance, with a vast number of transactions totaling 745,175 and engaging 70,423 buyers.\n\nComparatively, Solana, which stands fourth in the ranking, reported $30.1 million in sales, just 12% of Ethereum’s volume, even after considering the fact that SOL has outperformed ETH by 127% in the last 30 days.\n\nWith Solana struggling to grab market share in the NFT ecosystem, Hildebert Mouiliere, aka Hildobby, a data scientist at VC firm Dragonfly, told Unchained that “a lot of things that appear on [Solana] are just copying what happened on Ethereum, which isn’t very innovative.”\n\nSolana is also battling the fact that Ethereum’s longer history makes it a hub for many types of activity beyond just NFTs. “I think Ethereum has become a center of liquidity for a lot of things,” said gmoney, NFT collector and founder of 9dcc. “And not just NFTs, but also certain tranches of DeFi and what have you. And so I think that’s going to be hard to displace even though there are narratives that build up around other chains.”\n\nHowever, Solana could still become a contender if it builds on the particular advantages of its technology over Ethereum. “I hope that we see in the future some teams actually using what this tech can do to leverage what is lower fees and higher frequency transaction,” said Hildobby.\n\nRead more: Anatoly Yakovenko on Solana’s Astounding Recovery and Its Future Plans\n\nOver a year has passed since marketplaces like Magic Eden sparked a seismic shift in the NFT industry by making creator royalties optional—a move that continues to influence market dynamics.\n\nHildobby noted the complex nature of enforcing such payments and suggested that creators may need to consider additional incentives to encourage voluntary compliance. “It’s impossible to enforce those things,” he said.\n\nAs for where the market could go, Hildobby said he’s looking to the rise of NFT derivatives and lending platforms, which could diversify NFTs as financial instruments. “The vast majority of volume now is around lending, which allows for those high prices to now land at a much discounted rate,” Hildobby explained, emphasizing the potential for these platforms to broaden market participation.\n\nLearn more: What Are NFT dApps?\n\nGmoney also thinks future innovation in NFTs will come in their financialization and bringing real world assets on chain. As an example, he said, “the sneaker resell market is huge,” noting that with NFTs, “you can give them access to credit that they otherwise wouldn’t have.” Once that is a proven application, he said that could show the potential for NFTs to unlock value in other collectors’ items such as watches and handbags. “To me, one of the most interesting things is obviously, definitely the real world asset side of things, because I just think that you need to see the melding of those two worlds at some point, and I think that starts to happen over the next three to five years.”"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFA5QlR4S25jVFk4ZXRGUE1RWGc1eERiN1R4WFZKQURoU1hJUHdZQ3BDdEFaYkt0ZXRMSXBTdExFQ01lcUFVaWtBWDVsVVNBdEN4dFZwa2lOZHprY0haYVRyX1N3MGFXN0hiQThwTlZQQ3pJbFBNMXhBeHB0NkPSAYQBQVVfeXFMTlg0RnZ2cDU1Q2JYT0RzTEY5UUlseDNSVTBMazZ3RHpEd2J0cExSbmpnUjNvUUxNV0dpUGtLVGpCdHBkZW1RN0w5VjhrRHYxSWo4T3VrdHNXY1hRQl92UDljcTJKRVFrOWFWMHdscmNfdUJSNzM1ZmQxRmZiQU1TbWJpY05s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Here We Go Again: Pet Rock JPEGs on Bitcoin, Ethereum Sell for Over $100K - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThis week, half-giddy, half-cautious optimism spread across crypto circles as Bitcoin surged past $37,000 for the first time in 18 months on excitement regarding the approval a spot Bitcoin ETF, and Ethereum pumped past $2,100 on similar news of a pending ETH ETF application from BlackRock.\n\nThere’s clearly an emergent hope within crypto that the bottom—finally—is in. But to those who protest that it could never be a true bull market without obscenely expensive, seemingly pointless JPEGs trading hands: there’s now reason to rejoice on that front as well.\n\nOn Friday, two separate on-chain images of illustrated rocks—one hosted on Ethereum as an NFT, the other inscribed on Bitcoin as an Ordinal—sold for six-figure respective sums on secondary markets.\n\nAn NFT from the EtherRocks collection, EtherRock #95, traded hands this morning for 100 ETH, or just over $209,000. Just hours prior, an Ordinal from the visually identical Bitcoin Rock collection sold for 2.99 BTC, worth just over $111,000 at writing.\n\nAD\n\nAD\n\nThe JPEGs do not come with any affiliated memberships or perks, or anything that doesn’t meet the eye. They are, quite simply, lightly illustrated images of nearly indistinguishable gray boulders that don’t even feature backgrounds.\n\nBitcoin Rock #75 has sold for 3btc on the secondary market. Congratulations to @Scobra9000 on the sale. A warm welcome to @GrantWSchneider, already a legendary collector in the ordinals community, who has now taken it to the highest level. pic.twitter.com/wkqkk8Kbn9 — BITCOIN ROCKS ◉ (@ordrocks) November 10, 2023\n\nDumb as rocks?\n\nEtherRocks first launched in 2017 to little fanfare. Only during the height of the NFT bull run, in late 2021, did the 100-piece collection catch fire—largely as a means to poke fun at the absurdity of value and the crypto market. Individual EtherRocks regularly sold at the time for hundreds of thousands of dollars a piece; one sold for the equivalent of $1.3 million.\n\nAD\n\nAD\n\n“Monetary value of art is all an illusion,” an EtherRocks buyer wrote at the time. “The pet rocks present the perfect shock value, it’s so stupid that it’s perfect. Fate loves irony.”\n\nIn January, an apparently unaffiliated Ordinals user inscribed a set of 100 images almost identical to the EtherRocks onto small denominations of Bitcoin, creating a new collection: Bitcoin Rocks. While that Ordinals collection has not enjoyed the same success as its Ethereum predecessor, it has generated five-figure secondary market sales in recent months.\n\nIn the context of recent market trends, though, Friday’s sales appear to be hitting differently. Numerous Twitter users saw the news as a harbinger of the return of the type of obscenity, absurdity, and flagrant financial foolishness that defined the previous crypto bull run.\n\nLol that scam again.\n\nWe're so back — Dr.M₳ryJ⚡I buy Shitcoins,I hold ₿itcoin ❤₳d₳ᴺᶠᵀ𓊽 (@mary_el83) November 10, 2023\n\nMembers of the crypto community appear divided about whether that’s a good thing or a bad thing.\n\nThis space never fails to amaze me — sugarspicysauce (@sugarspicysauce) November 10, 2023\n\nBut despite the return of bull market antics, crypto activity is nowhere close to the levels enjoyed when EtherRocks were last ascendent. Though Bitcoin Ordinals trading did indeed hit a six-month high earlier this week, and NFT trading volume posted its best numbers since August, those numbers still pale in comparison to the type of volume witnessed during the 2021/2022 NFT bull run.\n\nLast week’s apparently encouraging NFT figures, for example, marked a 93% decrease in trading volume from the market’s peak in April 2022. But these pricey digital rock purchases point to at least a desire for the same kind of frothy, frenzied excitement that defined that earlier era.\n\nAD\n\nAD\n\nEdited by Andrew Hayward"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMi8AFBVV95cUxQT25oTkVRcVhBN0x5MWZmMnVfdDk5WWZTenFqMnVWMnc5b2NER2dBRWZBUDNTTEZRT08tVDFlOTZMS0xzVnlQUTk4VGZESi1tS3Z0aU1hSlJsaFphTE04WmQ4ZjByQ2V0MFh5d3lpY0ZNbjF1VU1EZkZhdmtWWkdSS2NkWnlwWUFkWFQybE9fVmhSZGVqYUtsOUZlOWJwcmJxZE9DQzcwX3JTMzYxSERnUlF0elZmZEdBdTg1ZnpDdHNoMnNqT2ZKUzRMXzRMazd2M1FRLTVxci1oUm1NNkt0eEhYUnFreUJtbVEyWVo2RHfSAfYBQVVfeXFMUEY5TWx1ODhuTGlHaHJMM1RXMlZ3d0NYZW1aenMzdk1lWWZNYkp0Qm5uSGN4QXp3M2hPdlVpWVZPQ1oxWFpkd29hbjM1Tm4tcXplMko3ZUFDN0tKMU1qR1VVR0dlSjQ4aHgyamdoWGlmcm85dDhVVmhEUGp5aXg0aUlJeG9NUnJURTduQTNva29kdUc1OGh0eS1oT0hKMDhZc0cxcEJmQUIxdk5iNmZ2blFnUHJPbmk3ODh1MHpfUnlmSUZpQnV6ZGp1bmt5T0VLZDJjd0VMbkhURHRtTElvUGk4V2UzaUExclAweG1EWGJxN0Z0dGtB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Price Prediction: Eighteen-months ascending triangle pattern appraises $4,000 target for ETH - FXStreet",
        "content": "Ethereum price has been consolidating along an ascending trendline for the past eighteen months, with the $2,035 level holding as resistance.\n\nThe overall price action has formed an ascending triangle pattern, which forecasts a $4,736 price target for ETH.\n\nThe bullish thesis will be invalidated once the altcoin breaks and closes below the ascending trendline at the $1,500 psychological level.\n\nEthereum (ETH) price is bullish on lower and higher timeframes alike, as token holders ride the wave of what already seems to be the making of a bull market. On the higher timeframe, however, the target objective for the largest altcoin by market capitalization looks overly ambitious, but not impossible as community members turn faces toward the exchange-traded fund (ETF) narrative and the much-anticipated Bitcoin (BTC) halving, together with their combined effect on asset prices.\n\nAlso Read: Top 3 Price Prediction Bitcoin, Ethereum, Ripple: BTC rages on, $40,000 may not be hopium after all\n\nEthereum price 18-month ascending triangle forecasts $4,736 target\n\nEthereum (ETH) price consolidating above an ascending triangle, combined with the effect of the formation of multiple local tops around the$2,035 level has led to the formation of an ascending triangle pattern.\n\nSuch a technical formation is created when the asset’s price lead to the formation of a horizontal line connecting the swing highs, while a rising trendline trails it from below connecting the swing lows. Together, the trendlines form a triangle, with traders watching for breakouts from the horizontal trendline. The target objective for such a technical formation is determined by measuring the height of the triangle and superimposing it at the breakout point.\n\nFor Ethereum price, the height of the triangle is around 134%, from $865 to $2,035 on the weekly timeframe. Superimposing this percentage difference on the weekly chart puts a target objective of $4,736.\n\nThe Relative Strength Index (RSI) spurs optimism, moving north to signify rising momentum while its position at 64 shows there is still more room to the north. Effectively, the Awesome Oscillators (AO) histogram bars are also flashing green to show the bulls maintain a strong presence in the ETH market.\n\nETH/USDT 1-week chart\n\nOn the flip side, profit-taking could nullify the projection by sending Ethereum price south, potentially losing the support offered by the ascending trendline at the $1,500 psychological level. This would invalid the bullish thesis."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMigwJBVV95cUxPaFhXTkRxcmpqbHBTOW5JSjYyWVotUjExYXI2STFvSDMzNTgwU0dkdDNkNmhwOS1GYjk3a0RCdnNvMWFhVkhXOTNfT1g2TG0xQ3g2UnJPTDExMEwwRUFfQjZGRVl6ZUF1c0Q4VG9XUDYyNjMtVTZiUUFhNzAyQVRoWTFSSUltaEp0eUxnZWRjUldzSHhNaUxOcjZFWWlvTlNZQnVnMHQxVzFMcTExZWxYcDhNXzE1Zlh4Y2tQWGdSNkNYOW9BNUZkWlpDamg3UC15WGRraHBpaW5TZkFUaWVDRVlQWTZQMXFzVk9PcGp1WDlFMGN4S1pHOTh4eHh4X21DeG1z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "NEAR Foundation and Eigen Labs partner to enable faster, cheaper Web3 transactions for Ethereum rollups via EigenLayer - PR Newswire",
        "content": "The fast finality layer will solve communication and latency issues for L2 builders while also improving usability and security\n\nLISBON, Portugal, Nov. 10, 2023 /PRNewswire/ -- NEARCON: The NEAR Foundation and Eigen Labs today announced a collaboration to build a fast finality solution that will soon power faster, less expensive transactions for Ethereum rollups, including cross-rollup transactions––a first of its kind in Web3.\n\nNEAR Foundation and Eigen Labs partner to enable faster, cheaper Web3 transactions for Ethereum rollups via EigenLayer\n\nThe NEAR Foundation and Eigen Labs teams are working together to build the first-ever \"fast finality layer\" for Ethereum rollups, which enables transactions to be processed within 3-4 seconds––rather than minutes, hours, or even days––and 4000x cheaper than the current options. This will also enable secure, low-latency cross rollup communication and solve one of the biggest challenges for founders and developers using rollups today.\n\nThis advancement will reduce liquidity fragmentation between Layer-2s through increased efficiency while also allowing them to make individual decisions around the sequencers they use to process those transactions, either on-chain or off-chain. The fast finality layer retains all Ethereum security guarantees while adding both NEAR and EigenLayer guarantees, making it an attractive option for any team building on Ethereum L2s.\n\nIllia Polosukhin, co-founder of NEAR Protocol, said: \"NEAR Foundation is proud to partner with such an excellent team as Eigen Labs to offer a fast finality layer for ETH rollups. The fast finality layer showcases the strengths of NEAR's technology while making the Open Web more usable, which has always been the core goal for NEAR. It will also help defragment liquidity for Ethereum rollups and make all of Web3 more interoperable as a result.\"\n\nSreeram Kannan, founder of Eigen Labs, said: \"We are thrilled to partner with the highly innovative team behind the NEAR protocol. This is a mutually beneficial partnership that will leverage both NEAR and EigenLayer's technologies to make it easier, faster, and cheaper for developers to build on Ethereum.\"\n\nFor EigenLayer, this collaboration will provide fast settlement for cross-rollup transactions and showcases adoption of restaking across the Ethereum ecosystem and beyond. For NEAR, the collaboration will also extend to transitioning the NEAR-Ethereum Rainbow Bridge to an actively validated service (AVS). This will create a better bridging experience between NEAR and Ethereum. Transactions will reach finality faster, with stronger security guarantees and decentralization.\n\nBowen Wang, Director of Protocol at Pagoda, the NEAR ecosystem team building the fast finality layer, said: \"Pagoda is proud to work with Eigen Labs, a world-class team, to cobuild the fast finality layer. This solution improves the composability with Ethereum L2s and reduces liquidity fragmentation within the rollup ecosystem.\"\n\nA testnet is expected to launch in Q1 2024, and more details will be shared around that time. For the latest news from NEAR Foundation or EigenLayer, please check our websites, follow us on social, or join our communities:\n\nNEAR Foundation website: https://near.foundation/\n\nNEAR Foundation X/Twitter: @nearprotocol\n\nNEAR Foundation Telegram: @cryptonear\n\nEigenLayer website: https://www.eigenlayer.xyz/\n\nEigenLayer X/Twitter: @eigenlayer\n\nEigenLayer Telegram: @eigenlayer\n\nAbout NEAR Foundation\n\nThe NEAR Foundation is a Switzerland-based non-profit foundation whose mission is to enable community driven innovation to benefit people around the world. One of its core areas of focus is the NEAR ecosystem, which includes a fully operational decentralized Blockchain-based platform for building decentralized applications.\n\nNF carries out its mission, primarily through the allocation of support and resources to other nodes in the near ecosystem, rather than via direct intervention or operations.\n\nNF's ultimate goal is to minimize its own scope and footprint by continuing to divide functions and resources to the ecosystem; and support the development of decentralized infrastructure necessary for those ecosystem functions to operate in a self-sufficient manner. For more information visit the website , follow us on social, or join our communities:\n\nNEAR Foundation X/Twitter: @nearprotocol\n\nNEAR Foundation Telegram: @cryptonear\n\nAbout Eigen Labs\n\nEigenLayer provides developers with access to the Ethereum staked capital base and decentralized validator set. Access to this trust network can make previously impossible mechanism designs possible.\n\nMedia contacts:\n\nGeorgia Hanias\n\nNEAR Foundation\n\n[email protected]\n\n+44 (0) 7812211403\n\nSOURCE NEAR Foundation"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxQR0swZzg2MVoxcnREeE0wbVU4Y2hwdFJGZlJINVlGTVZ4Zkc4SWxvY1AzYWpPM2RHOFBXWko5R0Z4a0V2N1hIZDdJV1gxQXk1TlY3WHlremEzR0hfeGdaUlZ2X3lYWWduaFNZdG1meHRUVGlXZU1DeW02TUdVS2hjM1BNX3duVUpOQ29GVG1WYUVkYy1xaEhPMHd1a3lDOHkwMTRhYkZDa3NoaDIyZzgtTGs5NHJkU3Vtc3BiR1djLV80dUhsN2RN?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Peter Brandt Predicts Bitcoin to Hit $43,289, Also Identifies Rising Wedge on Ethereum Chart - The Crypto Basic",
        "content": "Bitcoin (BTC) is on track to clinch a $43,289 price amid the formation of a pennant, as disclosed by veteran analyst Peter Brandt, who also called attention to a bearish rising wedge for Ethereum (ETH).\n\nBrandt made these disclosures in two separate analyses of the two largest crypto assets in the market. In a recent Bitcoin analysis, the analyst highlighted the formation of a pennant pattern on the BTC daily chart amid the ongoing uptrend.\n\nBitcoin Forms Bullish Pennant\n\nA pennant during an uptrend is a bullish continuation pattern. It features converging trendlines forming a small symmetrical triangle, preceded by a flagpole, which reflects the previous price surge. This pattern suggests a brief consolidation before the previous upward trend is likely to resume.\n\n- Advertisement -\n\nThe flagpole of the current pennant formed when Bitcoin staged a rally from the $26,555 low on Oct. 12. The rally saw BTC appreciate to $35,280 on Oct. 24, marking a massive 33% increase in less than two weeks. Although Bitcoin has retained its upward trajectory, the momentum has reduced, leading to the formation of the pennant.\n\nWhen a pennant forms, analysts view it as a brief pause to the rally, preceding a continuation of the bull run. According to Brandt, to gauge the extent of the next price rally, market participants should measure the height of the previous price rally that formed the initial flag pole, from the lowest to the highest point into the pennant.\n\nAccording to him, they can then project this same appreciation rate for the next surge, starting from the last small reaction inside the flag. Using this technique, Brandt projects that Bitcoin could appreciate $43,289 in the following price run after breaking out from the flag.\n\nEthereum Forms a Rising Wedge\n\nWhile Bitcoin could see a potential rally, Ethereum finds itself in a bearish pattern. Notably, ETH recently formed a rising wedge on the weekly timeframe, as highlighted by Brandt in a recent post on X.\n\nMarket watchers typically consider a rising wedge a bearish reversal pattern. It forms converging upward-sloping trendlines, indicating a tightening range between highs and lows. The pattern signals that the upward momentum is weakening and that a potential trend reversal to the downside may occur.\n\n- Advertisement -\n\nNotably, the rising wedge formation began in June 2022 when ETH slumped to a low of $881 following the Terra collapse in May. The asset registered a comeback, eventually recovering its lost value. However, amid the recent uptrend, a slowdown has resulted in the formation of the wedge.\n\n“It will be interesting to see if this market can expand beyond this pETH of pie,” Brandt said on X, calling attention to the bearish structure.\n\nPeter Brandt’s statement appears to be a play on words, referring to a portion of the Ethereum price chart within the rising wedge pattern. Brandt’s words suggest that the analyst is watching to see if Ethereum’s price can break out of the pattern and surpass the upper boundary of the wedge.\n\nMeanwhile, Ethereum seems to be seeing gains in the short term, while Bitcoin is currently down. ETH is up 7.12% over the past 24 hours, currently trading for $2,080. However, BTC is changing hands at $37,100, with a 1.50% decline within the same timeframe."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxOVWN6ZExrX2l4Q1dGNktzczdFUGdmMjFhWW14MzBza2RoZ2FMWnYxM3RNbW1qcV9ZbGZJOHY5eFQyVkRFbTQxWlE2MUw0c2toOXhOcjJBTnJsODVyeFNKUXFYTmNCWHZKSFBadDJ1cllNQzlmSWg0eHJGb0RNNEZuX2U0VUN0NVlmcDA2TFdycWo5Qlo1bjdtOUZwTnZURlRkN1M1UXZ6eExlVl9ZWG1mNVJvWjdtYjJvSExvSlQyaDI5VEdVWmhpenRzN2_SAdIBQVVfeXFMTWFUaEtmb0JLcFNqQWNkLUR2TFZDRkVXRG1ReGZFNHVVMGo3LWNIWHlWMEVpbkZ5RTNyT2Ixc3lzbVBoS2MtWHkzcnZCN2pLaGJPUFIyeDR2dVZ2UFJOdmVVOGJNNTYyVVUyamdHMWRNeDZkYmhpYUVfQVNQb3dIaDRYS3hLNlJkTnlwbkFrWTEyblNiS2RwZFF1dWl3bndkcGtxVU1hT0RPTnVBZzB2S0kxemFrN255dmdiT2V1Zk5UR2VYX1h4RFRLZXMyYkRfajJ3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Nov 2023 08:00:00 GMT",
        "title": "Arthur Hayes Says Ethereum Could Explode by Over 4,600%, Doubles Down on $1 Million Bitcoin Prediction - The Daily Hodl",
        "content": "BitMEX co-founder Arthur Hayes is doubling down on his massively bullish Bitcoin (BTC) predictions while forecasting that Ethereum (ETH) could hit a six-figure price.\n\nHayes says that the time to turn bullish on crypto is “now” while unveiling a target of $100,000 for Ethereum – an increase of about 4,669% from the current level.\n\nThe BitMEX founder also reiterates his prediction that Bitcoin will hit $1 million.\n\nIn a new blog post, Hayes further says that as currencies debase across the globe, the “smartest trade” would be “going long crypto.” According to the BitMEX founder, Bitcoin and Ethereum are “crypto’s reserve assets” while “everything else is a sh*tcoin.”\n\nBesides Bitcoin and Ethereum, Hayes says there are other opportunities that exist in the crypto space offering the potential of higher returns at a greater risk.\n\n“Then, we get to other layer-one blockchains that claim to be an improvement on Ether. Solana is an example. These all got beaten up real bad during the bear market. As such, they will levitate off extreme lows and provide great returns for intrepid investors. But, they are still all overhyped, me-too, pieces of sh*t that won’t overtake Ethereum in terms of active developers, decentralized applications (DApps) activity, or Total Value Locked.\n\nFinally, all manner of DApps and their respective tokens will pump. This is the most fun, because down here is where you get the 10,000x returns. Of course, you’re also more likely to get rugged, but where there is no risk there is no return.”\n\nEthereum is trading at $2,097 at time of writing while Bitcoin is worth $37,083.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiUkFVX3lxTE5YTjFMUkd4SzJaZEhlNEpuem9oRjFkWVI5UDZuU0Y1b0dpUHBVQUxtUUlEZFJNOUpMNW45b2RfY0NZX0JGMURKbkU3RjBLY2tfUFE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "What is OmiseGO? A comprehensive beginners guide - CoinCentral",
        "content": "OmiseGo is an Ethereum L2 launched in 2017 and founded by Omise, a venture-backed payment services company operating in Thailand, Japan, Singapore, and Indonesia.\n\nOmiseGO (OMG) is a white-label eWallet, smart contract platform and ERC-20 token (the Ethereum code standard). OMG uses a proof-of-stake (PoS) algorithm and has a total supply of 140,245,398 with a current circulating supply of 140,245,398 OMG– yes that’s right, OMG currently has all of its hard cap in circulation, and no new tokens are planned to be issued. OMG was designed to function as a decentralized bank, exchange, and asset-backed blockchain gateway. OMG’s ultimate goal is to be a “preeminent high-value exchange and settlement platform”. Think of a decentralized Ripple + universal remittance bridge to interconnect fragmented payment processors, legacy rails, and decentralized blockchains.\n\nThis means helping the unbanked get banking services (through their open-wallet infrastructure) and facilitating unprecedented interchangeability between the many siloed legacy rails (ACH, VISA, Paypal) and decentralized blockchains (like Ethereum). This could even potentially include more obscure assets like airline miles or loyalty points.\n\nOMG is based on ERC-20 which defines recognized smart contract code functions across the Ethereum ecosystem\n\nThe OmiseGO Team\n\nIn a November 2023 tweet, the OMG account claimed the original team has “moved on” leaving the token to be completely governed by the token holders.\n\n$OMG token is listed on over 130 exchanges and has over 700K holders. The original team has moved on, making it possible for OMG to become the only L2 that is 100% governed by the token holders. — OMG (@omgnetworkhq) November 14, 2023\n\nThe original OmiseGo team was described as “Fintech Rockstars” by Forbes in a now-deleted profile.\n\nOmise contributed $100,000 in funding to the Ethereum foundation’s DEVGRANTS which is a program to help new Ethereum-focused projects, develop the code bases and implement community evangelism. This indicates their commitment to the Ethereum ecosystem as a whole.\n\nThe original OMG Advisory board is notable, including Ethereum consensus-algorithm braniacs such as Vitalik Buterin, Gavin Wood (Polkadot), Jae Kwon (Cosmos), and more.\n\nFinal Thoughts: Is OMG Network Still Relevant?\n\nWith so many new Layer-2s storming the scene since OMG’s launch in 2017, OMG Network appears to have faded into the background music. However, it’s still a project worth keeping an eye on– its entire token issuance is currently circulating in markets, and governance is in the hands of the tokenholders.\n\nOMG holders earn tokens for validating transactions via a Proof of Stake (PoS) model\n\nThe OMG wallet application will also hold OMG tokens, which are a critical part of confirming blocks as valid and adding them to the blockchain. Keeping X amount of OMG tokens “buys” you the right to confirm blocks.\n\nEvery transaction on the OMG blockchain will require a transaction fee, that transaction fee will be distributed among OMG holders as a “stake”. The more coins held in the wallet the more fees you will receive proportionally.\n\nOmiseGo is the first implementation of Plasma, an Ethereum scaling solution co-developed by Joseph Poon (Lightning Network co-founder) and Vitalik Buterin\n\nA big challenge that faces not only OMG but all digital currencies is the number of transactions the network can handle. As seen with Bitcoin congestion, this is a critical issue of today. OmiseGo hopes to solve this issue with Plasma.\n\nPartnership with McDonald’s and the Thai Government\n\nA partnership with McDonald’s could potentially bring any entity (regardless of their market) much more growth and usage. In this case, they’re helping McDonald’s take in money more efficiently and inexpensively.\n\nThe Thailand Finance Ministry launched a national e-payment master plan to promote electronic payments. In addition, they rolled out Omise’s FacePay technology which allows payments using facial recognition. Omise and Vitalik Buterin had a meeting with the Central Bank of Thailand which indicates interest in their work.\n\nStrategic Alliances include investments from the Krungsri Bank of Ayudhya and SMBC\n\nThe Bank of Ayudhya made a 30 million dollar strategic investment in OmiseGO. They are a part of Japan’s largest financial group, Mitsubishi UFJ (MUFG), and hold $2.4 trillion of assets. Sumitomo Mitsui Banking Corporation (SMBC), another investor, is the second largest bank in Japan. Finally, Credit Saison, the third largest credit card company in Japan, is also partnering with OmiseGO.\n\nThe payment processing industry is siloed, fragmented and extremely centralized, creating security and counterparty risks for everyone. Omise, the creator of OmiseGo is a well-embedded payment processor in Asian markets which encompasses a massive market of users.\n\nOmise’s early ties to the Ethereum network and decentralization with their DEVGRANT donations and close ties with developers. OMG’s Software Development Kit (SDK) bundled with Omise’s suite of financial services is a robust and powerful combination of tools. Current and future OMG blockchain developers can move faster with less friction without having to reinvent the blockchain and remittance wheel.\n\nFinally, OmiseGo has backing from leading financial institutions and advisors like Vitalik Buterin among many other talented individuals."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMibkFVX3lxTE9Xblc2b0V3WlNfR2M5elp6Y3QzSFUwZGNLVUJ4ZXJ0Znd4SU1lY0p6YmNZOHhva01NcWJJVG1ETFU3ZzVtUmk1c0tZOXJ2TlMzQkFGRENiY3FFU0dIMVAtYzNYbFNRWDFhWkhOdkVR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 21:03:15 GMT",
        "title": "Coinbase launches KYC service on Base - Blockworks",
        "content": "Coinbase launched its Verifications platform Thursday, bringing know-your-customer policies on-chain.\n\nThe exchange said launching identity verification on the chain protocol level increases security and transparency, providing a solution to common challenges associated with typical KYC methods.\n\n“Built on the [Ethereum Attestation Service’s] open standard, our verifications are public and composable,” Coinbase Cloud, the company’s blockchain infrastructure arm, wrote on X.\n\nEthereum Attestation Service is a base layer where users can make declarations and add virtual signatures to information.\n\n“EAS enables anyone to make attestations on chain or off chain about anything,” the service’s website reads. “You simply register a schema (or use an existing one) about any topic and make attestations referencing that schema.”\n\nCoinbase Verifications, built on Coinbase’s layer-2 Base, already has about 9,300 attestations from users, according to data from analytics firm Dune. The service is expected to help particularly with Sybil attacks, which is when hackers use a single node to create many fake identities.\n\nThe service is the next step toward “using open source, public good infrastructure to enable the next billion users to come on-chain,” said Jesse Pollak, the creator of Base.\n\nThe move marks Coinbase’s entry into the decentralized identity game. Proof of Humanity, a verification protocol where users can submit social and video proof of their identities, emerged as a leader in the space when it launched on Ethereum-built application Kleros in 2021.\n\nRead more from our opinion section: Made by humans but governed by code?\n\n“In our digital interactions, we cannot know who is sitting on the other side of the screen,” the Kleros team said at time of launch. This enables AI manipulation through impersonation and the spread of misinformation by bad actors.\n\nCoinbase’s announcement comes as Coinbase shares begin to par gains after an explosive week. The stock was trading down a little less than 1% Friday after gaining as much as 6% during Thursday’s trading session.\n\nStill, Coinbase (COIN) remains up close to 7% over the past five trading days and is in the green more than 175% since the start of the year.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxQeDFsdm1lVmlLTjFBQ3dBQjEtbzF0SjFraE42aVpqekRBU1VYUXpOV1c0WW1XYlJtNkVTRlJqY21mb3ZsMERYQ0M5b1FwajdMY2FNZ1BYa0w1eWNta0JwMi16UWFOUmFtWDViWGNmREZqQ1VOSGJjS2pob3BKVzJaal8wZEp5WGdwa0xNeDJiWE43Z0YxaFZCbGdNSjlVb2dBeDdJSVBmb0FuNnZoMXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Solana Price Could Reach $1,000, Analyst Explains Why - TradingView",
        "content": "Crypto analyst Jacob Canfield has laid out a comprehensive analysis, suggesting Solana (SOL) could be on the brink of an unprecedented market surge. “In my opinion, I think that Solana is going to continue to be one of the biggest movers during this current bull market cycle,” Canfield states, proposing that Solana could potentially escalate its market dominance to the 12-15% range.\n\nCan Solana Hit $1,000?\n\nCanfield bases his analysis on several indicators. He highlights the Solana Dominance (SOL.D) chart, noting that at the peak market cap, it didn’t even crack 3%. Given the current trends and the breakout of SOLBTC from its weekly resistance, Canfield envisions a scenario where Solana could enter a parabolic rally phase, which is further supported by the SOLETH chart showing a similar pattern. “SOLETH – Also currently broke out of a weekly resistance and looks to be forming a parabolic rally against it.”\n\nNewsBTC\n\nA significant factor in Canfield’s analysis is the current state of Ethereum Dominance (ETH.D). He notes that ETH.D is breaking down from a long-term trendline and losing the 200 weekly moving average, now sitting at 17%. “If Solana continues to trend against Ethereum and it continues to break down to 2019-2020 levels, we could see SOL as the big winner this cycle,” Canfield explains.\n\nHowever, Canfield does not disregard the potential ramifications of recent news regarding an Ethereum ETF. “This may not play out with the current ETF announcement news as it will bring more attention,” he acknowledges, indicating that an approved Ethereum ETF could shift investor focus and capital back to Ethereum, potentially tempering Solana’s ascent.\n\nDespite potential headwinds from the Ethereum sector, Canfield emphasizes Solana’s robust partnerships with corporate giants like Google, Circle, and Amazon, positing that these collaborations could significantly drive adoption and enhance Solana’s visibility in this cycle of the crypto market.\n\nFurthermore, Canfield’s analysis extends beyond charts and partnerships. He delves into the Solana ecosystem, spotlighting projects that are paving the way for its expansion. From decentralized finance protocols and automated market makers to NFT storage solutions and governance tokens for gaming platforms, Canfield points to a breadth of innovation within Solana that parallels, and in some aspects, seeks to outdo Ethereum’s ecosystem.\n\nIn light of the FTX debacle, Canfield remarks on the psychological impact on Solana’s market sentiment, noting that with Sam Bankman-Fried’s legal troubles, there is an opportunity for Solana to redefine itself. “There’s a bit of PTSD around the ecosystem, but it’s time to become its own entity and forge its own future,” he asserts, suggesting that Solana’s future will be shaped by those who are deeply integrated into its ecosystem, from developers to traders and influencers.\n\nHis conclusion: “Solana could triple or quadruple it’s all time high market dominance around 12-15% and if it continues to trend against Bitcoin, could easily see a $1,000 per coin and take the #2 spot behind Bitcoin.” When asked about the potential of Ethereum, Canfield emphasized, “No reason to not have allocations to both. It’s like trying to bet on Microsoft or Google. Tesla or Ford: Just buy both.”\n\nShort-Term SOL Price Outlook\n\nOn the shorter-term horizon, analyst Rekt Capital brings attention to Solana’s price movements in a recent post on X. “Solana continues to outperform in the market. In 2021, SOL upside deviated to $53 and then $61 before retracing to the bottom of the purple box,” he noted, referring to a specific zone on the price chart that has historically acted as both resistance and support.\n\nNewsBTC\n\nIn the Rekt Capital chart, SOL is currently breaking out above the zone. However, if history repeats itself and the zone once again acts as strong resistance, the SOL price could suffer a severe pullback. Using the green arrow in the chart, Rekt Capital paints a scenario in which SOL initially falls back towards $30 before the price rises again towards $42."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiYkFVX3lxTE0zSTlORWktVVhRRjY4eVhYbDdvdGVNbEVwdGk1blN4Nm9paTVURXI1Mnh0V1lWRWUyTEQ2Y0hRRS01T0lkWHdEOXNkRG91TTJ0RGdGN3EtWnhuNWR3MHUzNFJn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Is Chainlink a good investment in 2024? Detailed Analysis - CoinGape",
        "content": "Chainlink, a decentralized blockchain oracle network built on Ethereum, has started to make headlines as the cryptocurrency has recently seen an impressive rise in its value along with healthy technicals.\n\nAs a result, Chainlink, which aims to facilitate tamper-proof data transfer from off-chain sources to on-chain smart contracts, saw its native cryptocurrency LINK price surge by 30% in the past 7 days.\n\nadvertisement\n\nBut investors are hoping that LINK, which has an all-time high of $52.88, at least cross the $50 mark once again in 2024. Currently, the LINK crypto coin is trading at around $18 apiece.\n\nChainlink Overview\n\nChainlink was created in 2017 by Sergey Nazarov and Steve Ellis, with the smart contract network formally launched in 2019.\n\nThe network acts as a bridge between blockchain and off-chain environments.\n\nChainlink’s coin LINK is an Ethereum token, compatible with the ERC-20 token standard. The maximum supply of LINK tokens is 1,000,000,000.\n\nChainlink Historical Data\n\nIn 2017, at the time of Chainlik’s launch, crypto markets were stagnant. At the time of its initial coin offering (ICO), Chainlink price was $0.11. A total of 350 million LINK tokens were sold at the time of its ICO.\n\nIn the following years, the coin witnessed a consistent rise in its price. It recorded its all-time high of $52.88 on 9 May 2021, on the back of an impressive rally in the overall cryptocurrency space. But soon, it went downhill like other cryptocurrencies. Chainlink now appears to be making a slow and steady recovery. The coin has already crossed the $10 mark and was trading very close to the $12 mark, showing marginally bullish sentiment.\n\nWill Chainlink Reach $50?\n\nChainlink is currently hovering around the $18 mark. For it to reach $50, it will need to grow close to 3X. If the anticipation of upcoming bull market comes to reality, Chainlink could further increase in value and eventually reach $50.\n\nBesides, there is also a possibility that network upgrades and staking improvements increase Chainlink adoption, causing its price to rise. However, at present, it appears to be a distant future. What will happen next? Only time could tell.\n\nConclusion\n\nChainlink has clearly started to make its recovery. There is massive room for growth in the coming times as the token is down from its all-time high. Coupled with Chainlink’s continuous efforts to form key partnerships and improvements in the tech stack, the present price rise could continue in the coming times."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxPZWw3ZjZqMU5YMU45Mk1FUjZqcHZVSEZYZUxLTzQ3Tzg3SUkyUUE2N2ducTk4NFR0Z1U4Vk9ELUZ1ZmxCNWlobXhXVWI1WHFlY2NVOWRWWlRNdHg0VEUtWEZTLXRMdkVRN2paTHoxUExLbjlFbGYwTWpreEJzQTFMVFBta0U2Wll3ejRZRzRsMHNiSzF4SlBOSWxjUjdWMUJzX2ZleWd6ONIBrAFBVV95cUxPdmhVemxkSmpsRDhDYUtua2JsS1l4NmlEV3M2VEtGRFhDZjR1NGZnU29KYzhiVE54WkZrOFlWU1A4cWtFU3BvSkQtX0xaTGVpTkwyWnVyOUVCVlZHdDBtWGJpSUxkeTFPTjZSeUF3LUh1UkE2eUY3MEplejAtWk81MXBOc0tQT0NBUlgzZGIxN3gwVjlpN0N2RHJNeTBWWDRxMzE2X2hFb093aVBh?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Nov 2023 08:00:00 GMT",
        "title": "Will Blackrock Explore ETFs for Chainlink, Solana, and Dogecoin? Expert Answers - Coinpedia Fintech News",
        "content": "Qadir Ak is the founder of Coinpedia. He has over a decade of experience writing about technology and has been covering the blockchain and cryptocurrency space since 2010. He has also interviewed a few prominent experts within the cryptocurrency space.\n\nCryptocurrency analyst Lark Davis hinted at a potential boom for Ethereum with the registration of BlackRock’s IShares Ethereum Trust in Delaware. Expressing confidence in this prediction, Davis speculated that BlackRock wouldn’t undertake such a move unless they were pretty sure about obtaining approval for a Bitcoin spot ETF.\n\nHe playfully suggested that beyond Ethereum, BlackRock might eventually explore ETFs for other cryptocurrencies like Chainlink, Solana, and even Dogecoin. While BlackRock isn’t the first to file for a spot in Ethereum ETF, joining others like Invesco and Hashdex, Davis sees this as a sign of institutional interest aligning for a significant influx of institutional money.\n\nHighlighting potential numbers, Davis discussed the current Ethereum holdings on exchanges, which amount to about 14 million ETH or $28 billion at the current price. He estimated that if Ethereum attracts half the inflows that Bitcoin does into ETF products, it could result in up to half of the available coins being acquired in the first year alone.\n\nReferencing Galaxy Digital’s estimates for a Bitcoin ETF, Davis halved the numbers for Ethereum, projecting $7 billion in the first year, $14 billion in the second, and $20 billion in the third. He said that such inflows, coupled with increasing demand, could lead to a situation where every Ethereum is bought up within three years.\n\nBeyond BlackRock’s potential move, Davis touched on other bullish catalysts for Ethereum. These include the monthly MACD nearing a bullish cross, with Ethereum catching up to Bitcoin’s trend. Additionally, he noted that 28.3 million ETH is currently staked, creating an over 2-year exit queue and restricting immediate dumping on the market. Davis also pointed out that Ethereum’s deflationary nature, EIP-4844 reducing gas fees on layer twos, and the ongoing migration to layer twos would further drive Ethereum’s growth."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiSkFVX3lxTFBwM3pNTlRkakdtLThWZ0Jkdnc5d0JSTUJPRS1XS293aVFpN2hwZkFRcjFWVXZoLTFuOVpaVVRKSzJnYjMtbThFNndR0gFCQVVfeXFMUFBmYXdMMWhQZTJfeXVWMENIand5V192enFZT0Jxb1ZLbDQzS2YteGZFNi1yYl9RTG0ybU9DRVJFRzR3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Nov 2023 08:00:00 GMT",
        "title": "Bank Nomura Offers Ethereum Investment For Institutional Investors, ETH Price Soars - VOI.ID",
        "content": "JAKARTA - Japan's largest investment bank, Nomura Holdings, launched an Ethereum-based investment fund for institutional investors through its digital asset subsidiary, the Laser Digital Asset Management, according to a press release released on November 9.\n\nThe fund, called \"Laser Digital Ethereum Adoption Fund SP\", is the second digital adoption solution investment fund introduced by the Digital Laser after launching the Laser Digital Bitcoin Adoption Fund last September.\n\nThe new fund will focus on the long-term spot position on Ethereum, reported by CryptoSlate. The fund is expected to increase yields through innovative strategies involving ETH staking owned by the fund. The fund is managed as a separate portfolio in the Laser Digital Funds SPC, a separate portfolio company listed in the Cayman Islands.\n\nLaser Digital has partnered with Komainu as a store for the assets of the fund. The company also acts as a store of assets for the Bitcoin Digital Laser fund. Komainu is a company regulated by the UK Financial Behavior Authority and the Virtual Asset Regulatory Authority in Dubai.\n\nSebastian Guglietta, head of the Laser Digital Asset Management and former Chief Scientist Officer Nomura, said his company sees Ethereum as a technology catalyst that will digitize the economy. He added that in the long term, exposure to Ethereum is very important to capture the structural technology trend of the web economy 3.\n\nMeanwhile, Total King, head of the Laser Digital Asset Management distribution, said that the fund would simplify investment in digital assets and provide a safe way for institutional investors to gain exposure in the industry because it is fully regulated.\n\nLaunching CryptoPolitan, Steven Ashley, co-founder and executive chairman at Laser Digital, said that the funds offer added value to investors interested in the technology underlying the Web3 ecosystem, such as smart contracts, decentralized finance (DeFi), and non-fungible tokens (NFT).\n\nHe also said that Ethereum has an important role as a building block for this digital infrastructure, and is therefore of interest to their institutional clients. The launch of Ethereum funds by Nomura Laser Digital shows that there is growing interest from traditional financial institutions to integrate digital assets into their investment portfolios.\n\nAt the time of writing, the price of ETH has increased by 9.9% in the last 24 hours. Now ETH is trading at IDR 32.8 million based on Coingecko data reports.\n\nThe English, Chinese, Japanese, Arabic, and French versions are automatically generated by the AI. So there may still be inaccuracies in translating, please always see Indonesian as our main language. (system supported by DigitalSiber.id)"
    }
]