[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiyAFBVV95cUxNUGpSbExreGNSY1piNVlzdmZuaE5NUGFWbElVV2ZUZjRNdzNucGtiSm9HcngzaWs2dHFENkRKYndXNEJaM0hZWURPOWxOa2dyQ0JXVVpJVXJVaFRKcnFHUFVHMzhjVVpHdTVrYTF5TmpLMUc2S0JDRDI5RkF5TWpaVURQbTB2Ni1DLXZqOGw5ZnA5VTdTSmJfUmZKQndKcmxsNEROczRfakhONFVuR2szZmNJeHozeFF6TUgxRXdNVjVBWTNCZ2pKdtIBzgFBVV95cUxOSWtpZzhTTG8wVmhGbmdJekQ2VjI5TV91Q0x0VlpRN3NUSVRTSWJobjc4YU1TU2RhMWtKZWxXQUhabWxmTm9qbHN6d21pZVVZd1U0NHcybk9DNk1lenkwcGNCS21hNU01Z2RCOWpPTVloQjNfTXR2U3NmYnpYeWt5ZGJMZ25YaTduVmcyMFVfOWhEQzJWRXpPdlJOX1lpN3FFT1YwZlpQdnhia21JRDlnMDVrekYxaGxoVVZlejZ0Qjd2cXBiSnowMDBzWlFoQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 17 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Whale Dormant for One Year Begins Selling Off Its Coins As ETH Loses Steam: Lookonchain - The Daily Hodl",
        "content": "New data reveals that a deep-pocketed Ethereum (ETH) investor has woken up from a year of dormancy and is selling off its crypto assets as the top altcoin loses momentum.\n\nAccording to blockchain data tracker Lookonchain, the crypto whale has woken up from a 12-month slumber and is selling its stash of ETH over decentralized exchange platforms (DEX).\n\n“A whale that has been dormant for one year is dumping ETH on DEX! So far, 18,865 ETH has been sold for four million DAI through four new wallets, the average selling price is $2,229. And currently has 5,588 ETH ($12.5 million) left.”\n\nEthereum is trading for $2,214 at time of writing, down about 6% from its 2023 high of $2,359.\n\nLookonchain then brings its attention toward the amount of decentralized oracle provider Chainlink (LINK) deposited into Binance, the top crypto exchange platform by volume. According to the data, noncirculating supply wallets deposited 8.3 million LINK, worth $119 million at time of writing, into Binance.\n\n“The wallets [have] deposited LINK to Binance every three months since Aug 26, 2022.\n\nInterestingly, most of the time, the deposit is at the bottom of the price and the price rises after that.”\n\nChainlink is trading for $14.08 at time of writing.\n\nConcluding its analysis with Solana-based (SOL) memecoin Bonk (BONK), Lookonchain says that while one savvy trader lost $46,000 on November 1st, on December 15th, the same entity made a staggering $4.4 million from trading the dog-themed meme asset.\n\n“This trader owns two wallets. In the past year, the trader withdrew 334.5 billion BONK ($218,000) [from crypto exchange] MEXC and bought 32.18 billion BONK ($41,000) from DEX.\n\nAnd deposited 204.2 billion BONK ($80,000) to MEXC, leaving 172.5 billion BONK (worth $132,000 on Nov 1st). On Nov 1st, he still lost $46,000, but today he made $4.4 million.”\n\nBONK is trading for $0.0000205 at time of writing.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Animedigitalart"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxOMk0xdHB1dUdza2c1OHd6OTVTMUhnV0VuaWxrbl8wUmVLZlZNNHc2aDRvaFJVUFl5VXhrUHlVc0pFOG9ZNXpmeDZ0b3dwY3JzMHlYOFF6bWpNMTBmMGV6THFYS2RLZEE5SjJOU1VlUXJxUXV1ZGhJQ0pqbzJOUlZSd0F0SDdNQdIBiwFBVV95cUxPcTZGcUxrNktQblpUSWdwaElNMlpnTTBIaFM1RjBMWV93U01hS1lMSUJfbHQyQ2xCeG11ekF1a0lGcC14ZW4zb2cwb3BkNVI5Slg3cklIdHlQWlg0aEI0T1E0X3lOaHF3RzhubmNnQXM5N2NRQ2J4ZEQ0bFoyckROemVzSXQtQnIzQ1g0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 17 Dec 2023 08:00:00 GMT",
        "title": "5 Cryptocurrency Predictions for 2024: Charting the Future of Digital Assets - Investing Haven",
        "content": "As we head into the 2024, several compelling trends emerge in crypto, shaping the future of digital assets. In this article, we look at 5 cryptocurrency predictions that could define the crypto space in 2024 and 2025. From our crypto charts, we derive 5 trends that will shape the future of digital assets, beyond our XRP forecast 2024 and $10 XRP forecast.\n\nIn recent years, we published our cryptocurrency forecast, each and every year right before year-end. If anything, it can be said that most, if not all, of our cryptocurrency predictions came true. Only our 2022 cryptocurrency predictions were somehow postponed, but eventually were achieved in 2023 or are close to be achieved in 2024.\n\nCrypto Prediction #1. Bitcoin’s Ascension to All-Time Highs\n\nBitcoin, the pioneer of cryptocurrencies, along with Ethereum, is poised for a remarkable journey in 2024. We explained our viewpoint, in great detail, in the following articles, cryptocurrency predictions published a while ago but highly accurate based on the current path of Bitcoin:\n\nA Bitcoin Price Forecast For 2024\n\nHow High Can Bitcoin Go In 2024?\n\nWill Bitcoin go to $100,000 in 2024, 2025 or 2026?\n\nOur compass is the seven-year rising channel etched on its weekly chart, guiding us towards the anticipation of Bitcoin revisiting its previous all-time highs. As the market dynamics continue to evolve, Bitcoin’s resilience remains a cornerstone, offering investors a reliable pathway in the crypto universe.\n\nCrypto Prediction #2. Game-Fi Resurgence\n\nIn the ‘beaten down’ area of blockchain gaming, Game-Fi is set to reclaim the spotlight. Axie Infinity, a trailblazer in the sector, serves as our North Star, pointing to a resurgence of interest and activity.\n\nThe vast majority of investors will look at the chart of Axie Infinity, with a lot of disinterest, and run for the hills because it’s not hot. Over here, at InvestingHaven, we get unusually excited from Axie Infinity, simply because we see the bullish reversal that is clearly, visibly, certainly going to resolve to the upside. We believe that AXS will move to 40 USD, it will start in 2024 and might be complete late 2024 or in 2025. We stay focused on the future direction of this chart, not the current ‘lack of momentum’. In fact, we see momentum coming, it makes us unusually excited.\n\nAs blockchain gaming ecosystems mature, expect Game-Fi to captivate audiences anew, presenting exciting opportunities for both gamers and investors. For those that want to spot the best opportunities in Game-Fi, we recommend following our crypto investing research service because we will not feature the best Game-Fi tokens in the public domain.\n\nCrypto Prediction #3. Real-World Applications, Tokenization and NFTs in Focus\n\nThe crypto sphere is on the cusp of integrating with the tangible world. Real-life applications, whether in tokenizing physical assets or expanding the horizons of non-fungible tokens (NFTs), are becoming a reality. 2024 could witness a transformative phase where blockchain technology steps out of the digital realm and makes a tangible impact on the real world.\n\nCrypto Prediction #4. Micro Caps’ Meteoric Rise\n\nThe crypto market isn’t just about the giants; hidden gems in the form of small and micro-cap coins are poised for a spectacular ascent. A multitude of charts reveals bullish reversals, quietly biding their time for the opportune moment to explode. Throughout 2024, keep an eye on these underdogs, as they have the potential to surge a hundredfold, rewriting the narrative of crypto investments.\n\nOne of the illustrations of what we are saying is the token shown below. We are, on purpose, not showing the symbol, simply to avoid a misunderstanding (some readers might take it as a ‘buy recommendation’ which it isn’t). We use this chart as an illustration of the tremendous upside potential in some, not all, micro caps and nano caps.\n\nCase in point: the token shown below had a market cap of 1.5m in October, it went up 20x in a matter of 3 weeks, after which it retraced. We are 100% sure that many more micro caps and nano caps will follow the same path. Note that the token shown below has another 20x upside potential.\n\nCrypto Prediction #5. Meme Token Surprises, Beyond the Expected Names\n\nMeme tokens, often characterized by unpredictability, are set to surprise. However, the stars of this show might not be the familiar names. Buckle up for an unpredictable ride, as a select few meme tokens, hitherto under the radar, could undergo a staggering tenfold increase. In the crypto world, expect the unexpected.\n\nOur top meme pick was featured in our latest premium crypto alert, with very specific entry and exit areas, along with a strategy to multiple the tokens over a period of 2 years without doing anything. We recommend signing up to find out which meme token we are talking about, and read our strategy: Crypto – Time For Some Partial Exits And Free Tokens.\n\nConclusion\n\nAs we step into 2024, the cryptocurrency space promises excitement, innovation, and unforeseen opportunities. While the future is inherently uncertain, these five predictions offer a glimpse into the potential trajectories that digital assets might traverse. Whether you’re a seasoned investor or a curious enthusiast, navigating the crypto landscape requires adaptability and a keen eye for emerging trends.\n\nSign up to get top token tips which we will not feature in the public space >>"
    }
]