[
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxQNnZYRXFlaWxSNW9PcldJNWlqSHRpOWxldmlLOHhndy1FSEFrZUJkdWN5TmIyd1dHUnFLWXR4UW52dDVUNVlaRjlhWW5JMVhRTUczRTlObERUdEFRUVc2dy1aX2tpb2pTNUlabkNmNXcwZUx6TEZ5ZE04UWdRNWVyaQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Nov 2023 08:00:00 GMT",
        "title": "What Is the Ethereum Cancun Upgrade? - Binance Academy",
        "content": "Key Takeaways\n\nThe Ethereum Cancun upgrade aims to enhance scalability, security, and efficiency within the Ethereum network, introducing the concept of proto-danksharding.\n\nDanksharding represents the final phase of the Ethereum 2.0 (Serenity) upgrade that enhances data management and transaction processing.\n\nThe Ethereum Cancun upgrade is designed to bring faster transaction processing times, reduced transaction costs, and optimized data management. Potential risks include impacts on existing smart contracts and the integration of new data storage techniques.\n\nThe Ethereum Cancun upgrade was initially planned to go live in October 2023 but was later delayed to the first half of 2024. It went live on the Ethereum mainnet on March 13, 2024.\n\nIntroduction\n\nEthereum's transition to Proof of Stake (PoS) and the introduction of sharding are vital components of its Ethereum 2.0 upgrade. PoS reduces energy consumption by replacing miners with validators, who are selected to create new blocks based on the amount of ETH they stake.\n\nMeanwhile, sharding increases transaction speed by partitioning the Ethereum network into smaller pieces (shards), with each capable of independently processing transactions and smart contracts. The shift from PoW to PoS enables secure and efficient sharding by randomly assigning validators to specific shards, preventing manipulation and enhancing performance.\n\nThe Ethereum Cancun upgrade represents an important advancement in the Ethereum blockchain, aimed at fortifying the network's scalability, security, and overall efficiency. This upgrade introduces the concept of proto-danksharding, an important step toward optimizing data management and enhancing transaction affordability within the Ethereum ecosystem.\n\nBy leveraging innovative data storage techniques, the Ethereum Cancun upgrade is poised to revolutionize the way the network processes transactions, paving the way for a more accessible and seamless user experience.\n\nUnderstanding the Ethereum Cancun Upgrade\n\nThe Ethereum Cancun upgrade (also known as the “Cancun-Deneb” upgrade) is a concerted effort by Ethereum to bolster its infrastructure and address unresolved issues after the Shanghai upgrade.\n\nThe Cancun upgrade is based on four Ethereum Improvement Proposals (EIPs): EIP-4844, EIP-1153, EIP-4788, and EIP-6780. Together, the implementation of these EIPs can provide many benefits, including improved scalability, enhanced data storage and availability, and reduced transaction costs.\n\nWith a primary focus on optimizing the execution layer (Layer 1), the Cancun upgrade prepares the network for the future implementation of full data sharding, a vital component in Ethereum's long-term development strategy.\n\nSharding refers to splitting a blockchain database into smaller portions, called shards, for higher efficiency, and the Cancun upgrade introduces a specific type of sharding known as proto-danksharding (discussed below).\n\nThe goal of the Cancun upgrade is to increase the network’s transactions per second (TPS), aligning with Ethereum's roadmap's \"Surge\" phase, aiming to scale performance to 100,000+ TPS.\n\nThe Cancun upgrade – along with the subsequent Deneb upgrade – represents a significant milestone in Ethereum's journey towards establishing itself as a leading decentralized finance platform.\n\nDanksharding and Proto-Danksharding\n\nDanksharding and proto-danksharding are different iterations of the sharding technology developed for Ethereum. Named after Ethereum researcher Dankrad Feist, danksharding is a type of sharding that serves as the final phase of the Ethereum 2.0 (Serenity) upgrade. It concentrates on optimizing data availability for rollups within the Ethereum network.\n\nTechnically speaking, danksharding is a design that introduces the concept of a merged market fee. While traditional sharding has different blocks and block proposers for each shard, there is only one block proposer in danksharding. In simple terms, danksharding can enhance transaction processing and streamline data storage by simplifying the sharding architecture and prioritizing data management.\n\nIn the context of the upgrade, proto-danksharding (introduced by EIP-4844) serves as a prototype of danksharding. It’s a temporary solution that can significantly reduce gas fees associated with rollups before the complete implementation of the danksharding framework.\n\nBlob-carrying transactions\n\nBlob-carrying transactions were introduced along with proto-danksharding (EIP-4844) to help reduce gas fees. Blob-carrying transactions allow the temporary storage and retrieval of off-chain data, meaning extra data can be added to Ethereum transactions in a more cost-effective way.\n\nBenefits of the Ethereum Cancun Upgrade\n\nAs we’ve discussed, the Ethereum Cancun upgrade can provide a range of benefits, including faster transaction processing, reduced transaction costs, optimized data management, and improved cross-chain communication. By introducing the concept of blob-carrying transactions, the upgrade aims to streamline data processing and enhance overall network efficiency.\n\n1. Better scalability: Proto-danksharding introduces temporary data storage capacity, allowing Layer 2 rollups (and the network as a whole) to process more transactions per second.\n\n2. Reduced transaction costs: Blob-carrying transactions allow extra data to be added to Ethereum transactions in a more cost-effective way.\n\n3. Optimized data management: EIP-1153 can optimize block space and reduce on-chain data storage costs.\n\n4. Better cross-chain communication: EIP-4788 aims to improve interoperability between different blockchain networks by exposing the Beacon chain to execution layers.\n\n5. Improved security: EIP-6780 can reduce the risk of smart contract termination by disempowering the SELFDESTRUCT code, enhancing the security of user data and funds.\n\nPotential Risks of the Ethereum Cancun Upgrade\n\nThere might be risks related to the potential impact of the upgrade on existing smart contracts and the intricacies of integrating new data storage techniques. These require extensive testing and careful consideration during the implementation phase to ensure a smooth transition for all stakeholders involved.\n\nThe Ethereum Cancun-Deneb upgrade was initially planned to go live in October 2023 but was later delayed to the first half of 2024. It went live on the Ethereum mainnet on March 13, 2024 (at epoch 269,568). Node operators and stakers must upgrade their software to releases listed in the official announcement.\n\nClosing Thoughts\n\nThe Ethereum Cancun-Deneb (Dencun) upgrade marks a significant leap forward in Ethereum's quest for improved scalability, efficiency, and user experience. By introducing proto-danksharding and laying the groundwork for future advancements, the Ethereum Cancun Upgrade will likely enhance the realm of decentralized finance and blockchain technology.\n\nFurther Reading\n\n\n\nDisclaimer: This content is presented to you on an “as is” basis for general information and educational purposes only, without representation or warranty of any kind. It should not be construed as financial, legal or other professional advice, nor is it intended to recommend the purchase of any specific product or service. You should seek your own advice from appropriate professional advisors. Where the article is contributed by a third party contributor, please note that those views expressed belong to the third party contributor, and do not necessarily reflect those of Binance Academy. Please read our full disclaimer here for further details. Digital asset prices can be volatile. The value of your investment may go down or up and you may not get back the amount invested. You are solely responsible for your investment decisions and Binance Academy is not liable for any losses you may incur. This material should not be construed as financial, legal or other professional advice. For more information, see our Terms of Use and Risk Warning."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMi8AFBVV95cUxQT25oTkVRcVhBN0x5MWZmMnVfdDk5WWZTenFqMnVWMnc5b2NER2dBRWZBUDNTTEZRT08tVDFlOTZMS0xzVnlQUTk4VGZESi1tS3Z0aU1hSlJsaFphTE04WmQ4ZjByQ2V0MFh5d3lpY0ZNbjF1VU1EZkZhdmtWWkdSS2NkWnlwWUFkWFQybE9fVmhSZGVqYUtsOUZlOWJwcmJxZE9DQzcwX3JTMzYxSERnUlF0elZmZEdBdTg1ZnpDdHNoMnNqT2ZKUzRMXzRMazd2M1FRLTVxci1oUm1NNkt0eEhYUnFreUJtbVEyWVo2RHfSAfYBQVVfeXFMUEY5TWx1ODhuTGlHaHJMM1RXMlZ3d0NYZW1aenMzdk1lWWZNYkp0Qm5uSGN4QXp3M2hPdlVpWVZPQ1oxWFpkd29hbjM1Tm4tcXplMko3ZUFDN0tKMU1qR1VVR0dlSjQ4aHgyamdoWGlmcm85dDhVVmhEUGp5aXg0aUlJeG9NUnJURTduQTNva29kdUc1OGh0eS1oT0hKMDhZc0cxcEJmQUIxdk5iNmZ2blFnUHJPbmk3ODh1MHpfUnlmSUZpQnV6ZGp1bmt5T0VLZDJjd0VMbkhURHRtTElvUGk4V2UzaUExclAweG1EWGJxN0Z0dGtB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Price Prediction: Eighteen-months ascending triangle pattern appraises $4,000 target for ETH - FXStreet",
        "content": "Ethereum price has been consolidating along an ascending trendline for the past eighteen months, with the $2,035 level holding as resistance.\n\nThe overall price action has formed an ascending triangle pattern, which forecasts a $4,736 price target for ETH.\n\nThe bullish thesis will be invalidated once the altcoin breaks and closes below the ascending trendline at the $1,500 psychological level.\n\nEthereum (ETH) price is bullish on lower and higher timeframes alike, as token holders ride the wave of what already seems to be the making of a bull market. On the higher timeframe, however, the target objective for the largest altcoin by market capitalization looks overly ambitious, but not impossible as community members turn faces toward the exchange-traded fund (ETF) narrative and the much-anticipated Bitcoin (BTC) halving, together with their combined effect on asset prices.\n\nAlso Read: Top 3 Price Prediction Bitcoin, Ethereum, Ripple: BTC rages on, $40,000 may not be hopium after all\n\nEthereum price 18-month ascending triangle forecasts $4,736 target\n\nEthereum (ETH) price consolidating above an ascending triangle, combined with the effect of the formation of multiple local tops around the$2,035 level has led to the formation of an ascending triangle pattern.\n\nSuch a technical formation is created when the asset’s price lead to the formation of a horizontal line connecting the swing highs, while a rising trendline trails it from below connecting the swing lows. Together, the trendlines form a triangle, with traders watching for breakouts from the horizontal trendline. The target objective for such a technical formation is determined by measuring the height of the triangle and superimposing it at the breakout point.\n\nFor Ethereum price, the height of the triangle is around 134%, from $865 to $2,035 on the weekly timeframe. Superimposing this percentage difference on the weekly chart puts a target objective of $4,736.\n\nThe Relative Strength Index (RSI) spurs optimism, moving north to signify rising momentum while its position at 64 shows there is still more room to the north. Effectively, the Awesome Oscillators (AO) histogram bars are also flashing green to show the bulls maintain a strong presence in the ETH market.\n\nETH/USDT 1-week chart\n\nOn the flip side, profit-taking could nullify the projection by sending Ethereum price south, potentially losing the support offered by the ascending trendline at the $1,500 psychological level. This would invalid the bullish thesis."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE4tYTFGWWJhQ2NSZk9wM1BZdjRWRVFYZEI1Qmp6R0MtenVaLU00MmZER1ZCT3N2V2xCVWIxY3hDTGVVUl9Ra0ZMRS05dENBU3ZudkZ5VWNwMTJwYXR2UGtjTXR2cmUxTFQ0ZTVGXzNUT1U0bGMtSFJ2bE5B?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Surges To $2,132 As Blackrock's Move Sparks Enthusiasm - TronWeekly",
        "content": "Ethereum has hit a high of $2,132, riding a wave of enthusiasm driven by the news of Blackrock’s recent submission of an ETF for SEC review, as per Santiment X post. This surge reflects the growing optimism surrounding the second-largest cryptocurrency in the market.\n\n📊 #Ethereum has reached as high as $2,132 as optimism surrounding the #2 asset in #crypto surged with #Blackrock's new submitted #ETF for the #SEC's review. Our latest insight looks at $ETH's #onchain health and its chances to continue its growth. 👇 https://t.co/8sBC9d1lWT pic.twitter.com/2PruVIM4Ve — Santiment (@santimentfeed) November 11, 2023\n\nEthereum dominates discussions in the crypto sphere, marking the highest increase in conversation compared to its usual trends. The spike in interest correlates with Blackrock’s confirmation of an official filing for a Spot Ethereum ETF with Nasdaq, now awaiting SEC approval.\n\nThis revelation has infused a moderate level of euphoria among traders, propelling ETH’s price to the cusp of a 1.5-year high. The crypto community, both traders and influencers, is ablaze with bullish sentiments regarding the potential impact of these ETFs on the crypto sector.\n\nThe industry also speculates that Blackrock’s move may signal positive indications for their earlier Bitcoin ETF filing in June. However, the certainty of these ETFs remains a subject of debate, albeit Ethereum’s significant lead in social volume reinforces its current prominence.\n\nConversely, deeper insights into Ethereum’s network health via Santiment’s metrics reveal a mixed picture. While some utility metrics show strength with rising transaction volume and circulation, signals of concern emerge. The surge in whale transactions, simultaneous with substantial dumping by key stakeholders in the $100K-$1M tier, raises alarms of profit-taking.\n\nEthereum Surges to $2,132 as Blackrock's Move Sparks Enthusiasm 6\n\nMoreover, the spike in Ethereum’s social dominance amid price surges indicates elements of FOMO and greed, adding complexity to the overall outlook.\n\nEthereum Surges to $2,132 as Blackrock's Move Sparks Enthusiasm 7\n\nThe community, while excited about the ETF potential, is cautioned against the uncertainty of its confirmation. The fervor might simmer down, giving way to impatience in the coming weeks or months.\n\nThe future of Ethereum’s growth remains subject to the intricate interplay between market dynamics, investor behavior, and regulatory decisions.\n\nEthereum Price Analysis\n\nThe present value of Ethereum stands at $2,064.29, accompanied by a trading volume of $13.86 billion within the last 24 hours. Its market capitalization is estimated at $248.26 billion, contributing to a market dominance of 17.48%. Notably, there was a decrease of -1.69% in the ETH price over the past day.\n\nSource: CoinMarketcap\n\nAs per Coincodex’s current forecast, Ethereum’s value is anticipated to climb by 5.14%, aiming for $2,165.91 by November 15, 2023. Coincodex technical analysis indicates a prevailing bullish sentiment, corroborated by a Fear & Greed Index reading of 70, indicating a state of “Greed.” In the previous 30 days, Ethereum has experienced 23/30 (77%) days of positive growth, showcasing an 8.11% price fluctuation.\n\nEthereum’s price consolidates above $2,035 within an ascending triangle pattern formed by connecting swing highs and lows. Traders eye a breakout from the horizontal trendline. The pattern suggests a target of $4,736, derived from a 134% triangle height. Positive RSI and bullish AO hint at sustained momentum and market strength.\n\nSource: Tradingview.com\n\nNote: The details on this page about markets and instruments are like a sneak peek – just info, not a nudge to buy or sell. Before diving into investments, dive into your own research pool.\n\nRelated Reading | Celsius Bankruptcy Plan Faces Skepticism, Regulatory Hurdles"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxOVWN6ZExrX2l4Q1dGNktzczdFUGdmMjFhWW14MzBza2RoZ2FMWnYxM3RNbW1qcV9ZbGZJOHY5eFQyVkRFbTQxWlE2MUw0c2toOXhOcjJBTnJsODVyeFNKUXFYTmNCWHZKSFBadDJ1cllNQzlmSWg0eHJGb0RNNEZuX2U0VUN0NVlmcDA2TFdycWo5Qlo1bjdtOUZwTnZURlRkN1M1UXZ6eExlVl9ZWG1mNVJvWjdtYjJvSExvSlQyaDI5VEdVWmhpenRzN2_SAdIBQVVfeXFMTWFUaEtmb0JLcFNqQWNkLUR2TFZDRkVXRG1ReGZFNHVVMGo3LWNIWHlWMEVpbkZ5RTNyT2Ixc3lzbVBoS2MtWHkzcnZCN2pLaGJPUFIyeDR2dVZ2UFJOdmVVOGJNNTYyVVUyamdHMWRNeDZkYmhpYUVfQVNQb3dIaDRYS3hLNlJkTnlwbkFrWTEyblNiS2RwZFF1dWl3bndkcGtxVU1hT0RPTnVBZzB2S0kxemFrN255dmdiT2V1Zk5UR2VYX1h4RFRLZXMyYkRfajJ3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Nov 2023 08:00:00 GMT",
        "title": "Arthur Hayes Says Ethereum Could Explode by Over 4,600%, Doubles Down on $1 Million Bitcoin Prediction - The Daily Hodl",
        "content": "BitMEX co-founder Arthur Hayes is doubling down on his massively bullish Bitcoin (BTC) predictions while forecasting that Ethereum (ETH) could hit a six-figure price.\n\nHayes says that the time to turn bullish on crypto is “now” while unveiling a target of $100,000 for Ethereum – an increase of about 4,669% from the current level.\n\nThe BitMEX founder also reiterates his prediction that Bitcoin will hit $1 million.\n\nIn a new blog post, Hayes further says that as currencies debase across the globe, the “smartest trade” would be “going long crypto.” According to the BitMEX founder, Bitcoin and Ethereum are “crypto’s reserve assets” while “everything else is a sh*tcoin.”\n\nBesides Bitcoin and Ethereum, Hayes says there are other opportunities that exist in the crypto space offering the potential of higher returns at a greater risk.\n\n“Then, we get to other layer-one blockchains that claim to be an improvement on Ether. Solana is an example. These all got beaten up real bad during the bear market. As such, they will levitate off extreme lows and provide great returns for intrepid investors. But, they are still all overhyped, me-too, pieces of sh*t that won’t overtake Ethereum in terms of active developers, decentralized applications (DApps) activity, or Total Value Locked.\n\nFinally, all manner of DApps and their respective tokens will pump. This is the most fun, because down here is where you get the 10,000x returns. Of course, you’re also more likely to get rugged, but where there is no risk there is no return.”\n\nEthereum is trading at $2,097 at time of writing while Bitcoin is worth $37,083.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxPZWw3ZjZqMU5YMU45Mk1FUjZqcHZVSEZYZUxLTzQ3Tzg3SUkyUUE2N2ducTk4NFR0Z1U4Vk9ELUZ1ZmxCNWlobXhXVWI1WHFlY2NVOWRWWlRNdHg0VEUtWEZTLXRMdkVRN2paTHoxUExLbjlFbGYwTWpreEJzQTFMVFBta0U2Wll3ejRZRzRsMHNiSzF4SlBOSWxjUjdWMUJzX2ZleWd6ONIBrAFBVV95cUxPdmhVemxkSmpsRDhDYUtua2JsS1l4NmlEV3M2VEtGRFhDZjR1NGZnU29KYzhiVE54WkZrOFlWU1A4cWtFU3BvSkQtX0xaTGVpTkwyWnVyOUVCVlZHdDBtWGJpSUxkeTFPTjZSeUF3LUh1UkE2eUY3MEplejAtWk81MXBOc0tQT0NBUlgzZGIxN3gwVjlpN0N2RHJNeTBWWDRxMzE2X2hFb093aVBh?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Nov 2023 08:00:00 GMT",
        "title": "Will Blackrock Explore ETFs for Chainlink, Solana, and Dogecoin? Expert Answers - Coinpedia Fintech News",
        "content": "Qadir Ak is the founder of Coinpedia. He has over a decade of experience writing about technology and has been covering the blockchain and cryptocurrency space since 2010. He has also interviewed a few prominent experts within the cryptocurrency space.\n\nCryptocurrency analyst Lark Davis hinted at a potential boom for Ethereum with the registration of BlackRock’s IShares Ethereum Trust in Delaware. Expressing confidence in this prediction, Davis speculated that BlackRock wouldn’t undertake such a move unless they were pretty sure about obtaining approval for a Bitcoin spot ETF.\n\nHe playfully suggested that beyond Ethereum, BlackRock might eventually explore ETFs for other cryptocurrencies like Chainlink, Solana, and even Dogecoin. While BlackRock isn’t the first to file for a spot in Ethereum ETF, joining others like Invesco and Hashdex, Davis sees this as a sign of institutional interest aligning for a significant influx of institutional money.\n\nHighlighting potential numbers, Davis discussed the current Ethereum holdings on exchanges, which amount to about 14 million ETH or $28 billion at the current price. He estimated that if Ethereum attracts half the inflows that Bitcoin does into ETF products, it could result in up to half of the available coins being acquired in the first year alone.\n\nReferencing Galaxy Digital’s estimates for a Bitcoin ETF, Davis halved the numbers for Ethereum, projecting $7 billion in the first year, $14 billion in the second, and $20 billion in the third. He said that such inflows, coupled with increasing demand, could lead to a situation where every Ethereum is bought up within three years.\n\nBeyond BlackRock’s potential move, Davis touched on other bullish catalysts for Ethereum. These include the monthly MACD nearing a bullish cross, with Ethereum catching up to Bitcoin’s trend. Additionally, he noted that 28.3 million ETH is currently staked, creating an over 2-year exit queue and restricting immediate dumping on the market. Davis also pointed out that Ethereum’s deflationary nature, EIP-4844 reducing gas fees on layer twos, and the ongoing migration to layer twos would further drive Ethereum’s growth."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiSkFVX3lxTFBwM3pNTlRkakdtLThWZ0Jkdnc5d0JSTUJPRS1XS293aVFpN2hwZkFRcjFWVXZoLTFuOVpaVVRKSzJnYjMtbThFNndR0gFCQVVfeXFMUFBmYXdMMWhQZTJfeXVWMENIand5V192enFZT0Jxb1ZLbDQzS2YteGZFNi1yYl9RTG0ybU9DRVJFRzR3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Nov 2023 08:00:00 GMT",
        "title": "Bank Nomura Offers Ethereum Investment For Institutional Investors, ETH Price Soars - VOI.ID",
        "content": "JAKARTA - Japan's largest investment bank, Nomura Holdings, launched an Ethereum-based investment fund for institutional investors through its digital asset subsidiary, the Laser Digital Asset Management, according to a press release released on November 9.\n\nThe fund, called \"Laser Digital Ethereum Adoption Fund SP\", is the second digital adoption solution investment fund introduced by the Digital Laser after launching the Laser Digital Bitcoin Adoption Fund last September.\n\nThe new fund will focus on the long-term spot position on Ethereum, reported by CryptoSlate. The fund is expected to increase yields through innovative strategies involving ETH staking owned by the fund. The fund is managed as a separate portfolio in the Laser Digital Funds SPC, a separate portfolio company listed in the Cayman Islands.\n\nLaser Digital has partnered with Komainu as a store for the assets of the fund. The company also acts as a store of assets for the Bitcoin Digital Laser fund. Komainu is a company regulated by the UK Financial Behavior Authority and the Virtual Asset Regulatory Authority in Dubai.\n\nSebastian Guglietta, head of the Laser Digital Asset Management and former Chief Scientist Officer Nomura, said his company sees Ethereum as a technology catalyst that will digitize the economy. He added that in the long term, exposure to Ethereum is very important to capture the structural technology trend of the web economy 3.\n\nMeanwhile, Total King, head of the Laser Digital Asset Management distribution, said that the fund would simplify investment in digital assets and provide a safe way for institutional investors to gain exposure in the industry because it is fully regulated.\n\nLaunching CryptoPolitan, Steven Ashley, co-founder and executive chairman at Laser Digital, said that the funds offer added value to investors interested in the technology underlying the Web3 ecosystem, such as smart contracts, decentralized finance (DeFi), and non-fungible tokens (NFT).\n\nHe also said that Ethereum has an important role as a building block for this digital infrastructure, and is therefore of interest to their institutional clients. The launch of Ethereum funds by Nomura Laser Digital shows that there is growing interest from traditional financial institutions to integrate digital assets into their investment portfolios.\n\nAt the time of writing, the price of ETH has increased by 9.9% in the last 24 hours. Now ETH is trading at IDR 32.8 million based on Coingecko data reports.\n\nThe English, Chinese, Japanese, Arabic, and French versions are automatically generated by the AI. So there may still be inaccuracies in translating, please always see Indonesian as our main language. (system supported by DigitalSiber.id)"
    }
]