[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiXkFVX3lxTE5LR2lOeVh0eU16WGNXelp5LVRFc19JMWVsZmZ6cjM5Z3hndGE2MG1Cay1pU3ExUE5TSlBrTGNYajcxNFhVMERiYVlibzk3VDk4WTRqSDQ1ZGI2NDhlV1E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Nov 2023 08:00:00 GMT",
        "title": "Ethereum’s Justin Drake is unconcerned despite ether’s middling year pricewise: Q&A - Blockworks",
        "content": "When Ethereum’s “Merge” to proof-of-stake went off without a hitch last September, some felt the layer-1 was primed for a breakout. Speculation arose around a “flippening” and institutional investors waited in the wings.\n\nBut ether’s price did not end up meeting these expectations. NFTs tested new lows, and the bear market muted DeFi engagement. Bitcoin continued to outpace ether in 2023 — recently reaching dominance levels not seen since 2021. Meanwhile, institutional inflows are largely yet to materialize.\n\nBlockworks spoke with Justin Drake, a researcher at the Ethereum Foundation, about the network’s current standing and future prospects. Keep reading for more excerpts from Blockworks’ interview with Drake.\n\nBlockworks: You can see variations of this stat in different places, but the rewards paid out by Ethereum were larger than the transaction fees that were burned in both September and October. It looks like that’s turned around a little bit, but how should people think about issuance versus burn and when that flips negative?\n\nDrake: The fee market is exceptionally volatile. What you really want to be doing is zooming out, because when you zoom out, you’re smoothing your data over a longer period of time.\n\nIf you look at ultrasound.money, you’ll notice that when it’s profitable, it’s like printing money. It’s really, really profitable. Ethereum has about a profit margin of 50% which is outstanding for a business. Now okay, on some days, especially weekends, it won’t be profitable. In some months, if you’re in the absolute depth of the bear market, then it won’t be profitable. But over a long period of time, it’s extremely profitable.\n\nBlockworks: How important is this deflationary aspect of Ethereum and Ethereum’s ability to generate fees? Because obviously Ethereum is not a company in the traditional sense where your revenues need to outweigh costs. So how should people think about revenue versus issuance? And how important is that metric as a way to gauge the success of the network?\n\nDrake: Broader than just as a company, some people think of ether, the asset, as money for the internet. And in that context, scarcity as a meme is extremely important. There’s this almost obsession with the 21 million Bitcoin meme precisely because it’s all about scarcity. And for the first time in history pretty much, we have money which not only has a fixed supply but actually has a decreasing supply.\n\nSo now there’s what I call memetic potential. Memes are ideas that spread. The 21 million meme is one that spreads far and wide because it’s kind of an attractive thing intellectually. There’s an opportunity potentially for this meme to spread that ether is the scarcest money on Earth. Its supply is going down over time.\n\nBlockworks: And who benefits from this meme?\n\nDrake: Ether the asset is the basis of two very fundamental public goods in any programmable blockchain.\n\nPublic good number one is economic security. We’re trying to build systems here which have a lot of longevity. We want to be in a position where it’s extremely difficult even for the most powerful nation-states out there to attack Ethereum.\n\nAnd then there’s this second really important public good for blockchains which is called economic bandwidth, and that’s the ability to be used as collateral within DeFi. Ether is especially valuable as collateral money because it’s the only so-called pristine collateral. Pristine means that there’s no contract risk. There’s no governance risk. There’s no oracle risk. It’s the one risk free asset.\n\nBlockworks: It sounds like you’re saying the idea of ultrasound money is a means to these larger ends that you described.\n\nDrake: Exactly. It’s a Trojan Horse, but ultimately the value is utilitarian through economic security and economic bandwidth.\n\nBlockworks: Ethereum’s validator queue has been in the hundreds of people waiting to stake ether (ETH), and that’s down from tens of thousands over the summer and even into September. What do you make of this?\n\nDrake: The churn, which is basically the amount of validators that can be processed by the queue, is proportional to the amount of staked ETH. As the amount of staked ETH grows, the churn grows and it becomes easier and easier to clear the queue. And so in that sense, looking at the queue is kind of a totally irrelevant game. The fact that the queue is very low just means that ether is very efficient at processing deposits.\n\nThe better metric is what’s called deposits. Every single day on average, there’s 40,000 ETH coming in, which is a huge amount of money.\n\nBlockworks: How concerned are you about staking yields being down?\n\nDrake: I mean in a way, the lower the better, right? Because it means that we’re not spending as much to secure Ethereum. Ethereum is already extremely secure.\n\nThe security ratio is the value secured by Ethereum, which is all the ETH, all the NFTs, all the ERC-20s divided by the value securing Ethereum, and it’s 7.5, which is extremely healthy. If we were to have more staked ETH, this ratio would keep on going down. But there’s no real need for that. And so having more staked ETH in the way is wastefully paying for security.\n\nBlockworks: Post-Merge, there was a lot of excitement about Ethereum. In 2023, ether’s price has gone up, but especially compared to bitcoin, not as much as some had predicted. Why is that?\n\nRead more: The flippening: Will ether flip bitcoin in the next year?\n\nDrake: What tends to happen, generally speaking, is that during bear markets, dominance of bitcoin goes up, and then during bull markets, it drops down precipitously and then it reaches a new low, so this is all standard behavior.\n\nWhat I’ll say is that bitcoin dominance hasn’t grown as much as what would have been expected in the bear market. So I think expectations were unreasonable thinking that during a bear market, ether will outperform [bitcoin].\n\nThis is all speculation, but my guess is that there will be a flippening in the next bull run.\n\nInterview responses were edited for brevity and clarity.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE1qSE9PVHNsS3hwUmR0UkRyQzV2Zkt4UVFuNGtUYnc1WnR1aGIwQTBIZ3pQM09XT1BaeGRrYlVvVHhLbnp1OFZ3RGNOVlctd1d0b2ExcE9HckRSUlJlZUVDcjBkSkQ2NGlNeUpjVmswY0pKLW43WVFydUNZVGw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Classic (ETC) Price Prediction 2024 – 2030 - The Tech Report",
        "content": "Ethereum Classic (ETC) Price Prediction 2024 – 2030\n\nIn our content, we occasionally include affiliate links. Should you click on these links, we may earn a commission, though this incurs no additional cost to you. Your use of this website signifies your acceptance of our terms and conditions as well as our privacy policy.\n\nWhy Trust Tech Report Tech Report is one of the oldest hardware, news, and tech review sites on the internet. We write helpful technology guides, unbiased product reviews, and report on the latest tech and crypto news. We maintain editorial independence and consider content quality and factual accuracy to be non-negotiable.\n\nEthereum Classic’s (ETC) price might witness a positive turnaround, ready for a massive rally in the coming weeks. Following the slight recovery in the general crypto market, altcoins like Ethereum Classic are also rising. With the rising bullish momentum in the market,, ready for a massive rally in the coming weeks.\n\nThis analysis will provide insights into Ethereum Classic’s potential price trajectory from 2023 to 2030. Furthermore, we’ll give detailed information on what can affect Ethereum Classic’s price soon.\n\nHowever, remember that these projections are based on actual market behavior. Let’s explore the potential scenarios for Ethereum Classic’s journey over the next seven years.\n\nEthereum Classic Price Prediction 2023 – 2030\n\nBased on the daily chart, the Ethereum Classic token has breached above its bearish trendline . Currently, the token is testing support at $15 and trying to rally its price above the 20 and 50-day MA indicators.\n\nTesting the $15 support: Ethereum Classic’s price recently went down , but it successfully reached the $15 level. If it can retest this level, it might surpass its average price and start going up.\n\nLimited Near-term Growth: Right now, it seems challenging for Ethereum Classic’s price to increase significantly in the short term.\n\nSimilar to Ethereum: Ethereum Classic’s price tends to follow Ethereum’s price closely . Sometimes, it even reaches new highest values before Ethereum does.\n\nGood news in 2024: In 2024, important events are happening in the cryptocurrency world that can benefit Ethereum Classic. Ethereum’s planned upgrade and Bitcoin’s Halving event could positively affect Ethereum Classic’s price.\n\nDecentralization Matters: If people start talking more about decentralization in the blockchain world, Ethereum Classic might become more popular because it’s known for being decentralized. This could lead to more interest in Ethereum Classic.\n\nEthereum Classic Price Prediction Summary for 2023 – 2030\n\nYear Maximum Price Average Price Minimum Price 2023 $15.50 $15 $14.72 2024 $100 $48 $15 2025 $387 $210 $120 2030 $860 $690 $520\n\nEthereum Classic Price History\n\nEthereum Classic (ETC) is a cryptocurrency that emerged from a hard fork of the Ethereum network in July 2016. The split resulted from a disagreement within the Ethereum community following the infamous Decentralized Autonomous Organization incident.\n\nThe DAO was a smart contract-based investment fund on the Ethereum blockchain but fell victim to a critical vulnerability. This led to a massive Ether (ETH) theft in July 2016, which resulted in a drift in the community.\n\nSome community members advocated a hard fork to reverse the transactions and recover the stolen funds. In contrast, others believed in preserving the immutability of the blockchain, arguing that “code is law.”\n\nThose who adhered to the latter viewpoint continued with the original Ethereum chain, which became Ethereum Classic. Following the split from Ethereum in 2016, the project needed to establish its value.\n\nThis was done by listing ETC on two cryptocurrency exchanges on July 20, 2016. CoinMarketCap started recording the price of Ethereum Classic on July 24, 2016.\n\nAt that time, one unit of Ethereum Classic traded at $0.7523. This initial price helped set the foundation for ETC’s value in the cryptocurrency market.\n\nSince its beginning, Ethereum Classic’s price has closely followed its counterpart, Ethereum. It reached its all-time high of $176.16 in May 2021.\n\nBefore a significant upgrade on Ethereum in September 2022, Ethereum Classic’s price rose from $14.20 to $41.59. However, by the end of 2022, it settled back around $15.\n\nFurthermore, in 2023, the Ethereum Classic’s price has been unstable, bouncing between $15 and $23. Remember, these values can change rapidly due to the unpredictable nature of the crypto market.\n\nMeanwhile, Ethereum Classic has since developed its ecosystem, community, and development teams. It shares many similarities with Ethereum, including its smart contract capabilities, but operates independently with a separate token, ETC.\n\nDespite facing various challenges and controversies, Ethereum Classic has demonstrated remarkable resilience. This is a testament to the diverse range of ideologies within the blockchain space.\n\nKey Points in Ethereum Classic Price History\n\nThe Ethereum Classic is a fork of the Ethereum chain. It split from Ethereum due to a hack in July 2016.\n\nStart Date and Initial Value (July 24, 2016): Ethereum Classic’s price history began on CoinMarketCap on July 24, 2016, with an initial value of $0.7523.\n\nPrice Tracking with Ethereum: Since its inception, Ethereum Classic’s price movement has closely mirrored that of Ethereum, its sibling cryptocurrency.\n\nAll-Time High and Current Status: Ethereum Classic achieved its highest price of $176.16 on May 06, 2021. As of today, it has decreased by 90.47% from this peak.\n\nThe Merge and Price Movement: Leading up to The Merge, a significant upgrade on Ethereum, Ethereum Classic experienced more considerable percentage gains than Ethereum.\n\nIts price surged nearly 193%, rising from $14.20 to $41.59. This surge was because many miners expected to shift their support to Ethereum Classic.\n\nEthereum Classic shares many similarities with Ethereum, including its smart contract.\n\nEthereum Classic (ETC) Current Price & Stat\n\nIt started the year at $15.69 and is currently at $15.21, marking a decrease of over 34%. Also, in the last 30 days, the coin has been down by 2% and around 7% in the past 14 days trading session.\n\nHowever, in the past hour, there’s a sign of a favorable market as the coin is rising gradually by almost 1%.\n\nBased on its market cap of more than $2 billion, Ethereum Classic is ranked #28 amongst other crypto assets. According to CoinGecko, the trading volume is at $130,977,163, an increase of 97% in the last 24 hours.\n\nInterestingly, despite its bearish momentum, the coin is still massively above its all-time low by 2,372.71%.\n\nCurrent Market Status\n\nCurrent Price $15.22 24-Hour Price Change -0.06% 24-Hours Trading Volume $130,977,163 (97.50%) Market Cap $2,175,151,142 Current Ranking #28 Circulating Supply 140 Million tokens All-Time High $167.09 (May 06, 2021) All-Time Low $0.615038 (July 25, 2016)\n\nEthereum Classic Price Prediction 2023 – 2030\n\nEthereum Classic Price Prediction 2023\n\nSince the start of 2023, the price of Ethereum Classic has ranged between $15 and $23. The price is now lower than at the beginning of the year.\n\nHowever, toward the end of September, there was a significant shift in its price performance. Importantly, Ethereum Classic has breached the solid bearish trend and is forming a new positive trendline.\n\nA rapid climb above key indicators marked this positive trend, the 50-day and 20-day Moving Averages (MAs). Following this positive move, Ethereum Classic’s price climbed to $16.71.\n\nSubsequently, the price dipped below the Moving Averages and is now testing the $15 support level. This level may serve as a turning point, where the price could stabilize or begin to rise again.\n\nNotably, if the Ethereum Classic token could build up intense energy to stay above this support and maintain the trendline for a few days, we can likely see a bullish move.\n\nBased on this, we anticipate the price of Ethereum Classic to reach a high of $17 or an average of $15.50. However, if Ethereum Classic’s price faces challenges at the MAs, it may fall back to $15 since investors are willing to buy the coin at this price.\n\nMeanwhile, if the support doesn’t hold or the momentum is not strong, it could trigger further downward pressure on the coin. If both the lack of support at $15 and the MAs resistance persist, it could create a bearish market sentiment.\n\nImportantly, this could send the price of Ethereum Classic to a low of $14.72.\n\nEthereum Classic must overcome significant challenges and obstacles to record substantial price gains. Based on this, we predicted that Ethereum Classic’s price will stay relatively high.\n\nInstead, it could trade within a narrow range from now to the end of 2023. The projected range is between $15.50 (the highest it might go) and $14.72 (the lowest it might reach).\n\n2023 Price Prediction Maximum Price $15.50 Minimum Price $14.72\n\nEthereum Classic Price Prediction 2024\n\nDue to the upcoming Bitcoin Halving set to occur in April 2024, there are high expectations of a crypto bull market. The Bitcoin Halving is an event that slashes the rewards miners receive for verifying transactions in half.\n\nImportantly, this event happens approximately every four years.\n\nBased on historical price moves, the price of Bitcoin tends to increase due to this event steadily. Since Bitcoin is the mother of altcoins, its price movements often have a ripple effect on the entire cryptocurrency market.\n\nRecall that in the last bull run, which started around the time of the previous Bitcoin Halving, ETC reached an all-time high of $176.16.\n\nEthereum Classic needs a well-defined roadmap for its future development, making it challenging to predict (DeFi) ecosystem developments that could impact its future price. Also, the coin stands out from other cryptocurrencies because it has never had a formal roadmap.\n\nThis sets Ethereum Classic apart from crypto assets that face scrutiny when they lack a clear plan for their future. Therefore, Ethereum Classic experiences less pressure on its price due to the absence of a roadmap.\n\nMeanwhile, Ethereum Classic closely watches Ethereum’s price. Ethereum will start testing some significant improvements related to scaling in late 2023, which they call proto-dank sharding. They plan to implement these changes in 2024.\n\nIf all goes well, this could increase Ethereum’s price, and Ethereum Classic will likely increase. Ethereum Classic will apply these changes to its system about 3 to 6 months after implementing them on Ethereum.\n\nConsidering all this, our prediction for Ethereum Classic’s price in 2024 is optimistic. It could reach as high as $100, with a potential year-end fee of $48. At the start of the year, it might be lower, around $15.\n\nEthereum Classic Price Prediction 2025\n\nIf a strong market trend begins in 2024 due to Bitcoin Halving, it’s likely to continue into 2025. During this time, many coins might reach their highest-ever prices.\n\nIn the past, Ethereum Classic has often followed a similar pattern to Ethereum, sometimes even hitting new high prices before Ethereum does.\n\nConsidering Ethereum’s growing popularity and role as the second cryptocurrency, it’s expected to hit a new all-time high in the next bull market.\n\nAlso, ETH could increase significantly with its rise as a preferred proof-of-stake coin and a limited supply asset in the last year.\n\nBased on our projection of Ethereum’s price increasing by 120%, we anticipate Ethereum Classic could reach a top price of $387 in 2025. The lowest price might be around $120, while the average price could be about $210.\n\nEthereum Classic Price Prediction 2030\n\nMany things can influence what might happen to Ethereum Classic’s price in 2030. One major factor is whether cryptocurrencies become widely used by then.\n\nImportantly, if more people start using cryptocurrencies, it’s good news for all crypto, including Ethereum Classic. Additionally, Ethereum Classic could benefit from the growing interest in decentralized solutions, leading to high demand that could drive prices higher.\n\nThe following sections will show that Ethereum Classic is the original, unchanged version of Ethereum. This means that if trust in centralized systems decreases, Ethereum’s history might make people favor Ethereum Classic instead.\n\nEthereum Classic usually follows a similar path as Ethereum, adopting similar upgrades a few months later. This makes it easy for apps and services to switch to Ethereum Classic, potentially bringing more users and increasing demand.\n\nHowever, there’s a concern about how people view proof-of-work blockchains due to their environmental impact. This issue might not improve by 2030. This could lead Ethereum Classic to go in its own direction, separate from Ethereum.\n\nConsidering all this, our guess for Ethereum Classic’s price in 2030 is that it might hit new highest prices, going as high as $860. Meanwhile, the lowest might be around $520, and the average price could be about $690.\n\nPotential Highs & Lows of the Ethereum Classic Price\n\nEthereum Classic wants to be like Ethereum, but it has its own story. Even though it’s a separate coin, it follows the price of Ethereum closely.\n\nWe have to think about what’s happening with Ethereum to guess what might happen to Ethereum Classic. Here’s a short overview of our guesses about Ethereum Classic’s price.\n\nYear Potential Low Price Average Price Potential High Price 2023 $14.72 $15 $15.50 2024 $15 $48 $100 2025 $120 $210 $387 2030 $520 $690 $860\n\nOther Analysts Prediction on Ethereum Classic\n\nDifferent sources have another prediction on Ethereum Classic’s future price:\n\nFirstly, the Cryptopolitan thinks Ethereum Classic might reach $50.94 in 2025 and $317.96 in 2030. Also, by 2032, they predicted the coin to achieve a high of $705.99.\n\nAccording to Changelly, it could hit a high of $317.93 by the end of 2030, with an average price of $237.65.\n\nFurthermore, Wallet Investor has a less optimistic view, suggesting it might drop much in value to around $0.195 by October 2028.\n\nMeanwhile, Coincodex believes it could reach $33.57 in 2025 and $34.98 in 2030. They also expect $74.29 in 2024 and $100.97 in 2028 due to the Bitcoin Halving.\n\nTraders Union has more moderate predictions, estimating prices of $20.54 in 2025 and $33.14 in 2030.\n\nRemember, these predictions above are based on assessments and forecasts made by various sources. They are speculative and do not guarantee ETC’s future performance.\n\nWhat is Ethereum Classic and its Uses?\n\nEthereum Classic (ETC) is an open-source, decentralized, and blockchain-based computing platform and cryptocurrency birthed due to a hard fork from the Ethereum blockchain in 2016.\n\nOrigin of Ethereum Classic\n\nEthereum Classic originated from the Ethereum blockchain conceived by Vitalik Buterin and the Ethereum Foundation and launched in 2015.\n\nEthereum Classic was created after The DAO hack in 2016, which resulted in the loss of millions of dollars worth of Ether. The dispute caused a split in the Ethereum community, with the majority choosing to reverse the hack.\n\nWhat is Ethereum Classic?\n\nEthereum Classic is a decentralized platform that uses smart contracts embedded within a distributed ledger. Smart Contracts are self-executing autonomous digital applications, based on the principle of “Code is Law,” which can run on their own as programmed.\n\nWhy is Ethereum Classic Used?\n\nThe ETC or Ethereum Classic asset facilitates payments for decentralized computations on the Ethereum network. The project aims to develop a global payment network based on smart contracts that can operate with no centralized authority.\n\nEthereum Classic, like other cryptocurrencies, will aspire to be a digital store of value, meaning you can save and exchange it while maintaining its weight.\n\nWhat are the goals of Ethereum Classic?\n\nEthereum Classic aims to provide a platform for developers to build decentralized applications (dApps) that can run on a blockchain. Ethereum Classic aims to provide a secure and decentralized platform for developing smart contracts.\n\nIt aims to provide a platform for developing decentralized finance (DeFi) applications.\n\nHow is Ethereum Classic Different from Ethereum?\n\nEthereum Classic and Ethereum are similar in terms of basic functionalities. Developers can use the open-source code to develop and run their apps.\n\nEthereum Classic preserves the old code of the Ethereum blockchain as it was until the DAO attack. People often regard it as the “original” Ethereum crypto. Ethereum Classic is an attempt to preserve the originality of Ethereum.\n\nFactors Influencing the Price of Ethereum Classic?\n\nDue to the relationship between Ethereum Classic and Ethereum, ETC’s price is influenced mainly by the cost of Ethereum. This means that when Ethereum makes any significant move, it affects the price of Ethereum Classic.\n\nSimilarly, the upcoming Bitcoin Halving could influence the price of the general crypto market. Importantly, this bullish move is estimated to continue until 2028. As a result, altcoins like ETC could record new all-time highs.\n\nFurthermore, public statements about Ethereum Classic could significantly impact the coin’s price. For instance, in 2022, a significant endorsement from Vitalik Buterin led to a 20% increase in Ethereum Classic’s price.\n\nHe recommended Ethereum Classic for those who prefer a system called proof-of-work. Buterin states, “If you like proof-of-work, you should use Ethereum Classic.”\n\nAdditionally, as the Ethereum Classic community and its uses expand, the coin becomes more valuable and attracts more users. Note that when more people actively use it, it encourages others to join in, increasing the demand for the coin.\n\nThis growing activity and interest contribute to potential price movements.\n\nEthereum Classic has been a victim of a series of attacks. This affected its price significantly, dropping from $7.40 to $5.12 in 2020.\n\nIs Ethereum Classic a Good Token to Buy?\n\nBased on this analysis, Ethereum Classic’s price might remain unchanged. The coin may likely finish this year trading around $15.\n\nHowever, in 2024, things could get interesting. With the Bitcoin Halving and upgrades on Ethereum, Ethereum Classic could reach $100.\n\nAs we head into 2025, during a period of solid growth in the crypto market, it might reach as high as $387. By 2030, Ethereum Classic’s price might surge massively, hitting the $860 level.\n\nRemember, these are just projections, and many things can change. The crypto market can be very unpredictable, so prices could go down instead, leading to potential losses.\n\nConclusion\n\nEthereum Classic’s strong connection to the second-largest cryptocurrency, Ethereum, brings positive vibes to its future predictions despite initial doubts due to its name.\n\nSticking to its current proof-of-work consensus mechanism might pose challenges ahead. Yet, if the importance of decentralization grows, Ethereum Classic could stand out as a preferred choice, mainly due to its compatibility with Ethereum.\n\nKeep in mind that the future of any cryptocurrency can be uncertain, so always approach with caution and do thorough research."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxOeGVzS2EwRjBMZUhibmxWcHdKbWFXOV81d3l2QXpJdk02d2dLMzgzYUJhTVZWSC1mUWEyQmhzNWRnSU5PY0hGdVdyMkxNeXNrempWMVJkRGt5WGJVQy11Q2xkWWpqbE1GOFF3UjdDTUZNcVJpYXV6TmR4aE8tQTlnaEZLMzE2MWs4aXdj0gGTAUFVX3lxTE4xWVBnZHBONzZ0eFhlcll2YmhnRXZJTjl3TWdvdW11ZVgyMnN0d05ldml4QThQOUpzb0RDd1RFY3pUNy0tMTNmSFNRTXdfT1pXUldaQXk1WGxySFNmZVBpOFF1aGkzcmptWklDRWZwSzFza3FMUF9uRHBvZjZXdTdsZ1hmQmpGQ2NGejNHd29WT2tNWQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Rival Solana Is Back—Experts Say It's No Surprise - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nSolana is once again the talk of crypto, and its native coin SOL is benefiting from the attention. The price of SOL is up over 9% today, hitting a 24-hour high of $44.41.\n\nOver the past 30 days, it has exploded in value by over 88%, according to CoinGecko—making it the biggest winner of all the major cryptocurrencies.\n\nAnd despite its association with the collapsed FTX crypto exchange and its criminally convicted founder Sam Bankman-Fried, experts say Solana’s recent rise shouldn’t come as a shock.\n\nWidely considered a competitor to Ethereum, Solana aims to be the go-to network for on-chain applications and experiences. Ethereum proponents argue that the leading smart contract network offers greater stability and security, but Solana is objectively cheaper and faster for those wanting to build or use lending protocols, games, and other applications that utilize blockchain technology.\n\nAD\n\nAD\n\nSolana gas fees right now stand at $0.000522; to make a transaction on Ethereum, it costs $6.58 on average.\n\nFor this reason, Solana has grabbed the attention of Visa, Shopify, and developers wanting to build on the network.\n\n“Solana adopts a streamlined approach, emphasizing high base layer throughput while simplifying the developer experience,” portfolio manager at Yield App Akash Mahendra told Decrypt, highlighting how much data can be processed by the blockchain.\n\nMahendra added that major partnerships and institutional interest are also helping drive up the price of SOL.\n\nAD\n\nAD\n\nIt wasn’t that long ago that Solana was getting a bad rep. FTX, once one of the biggest and most recognizable brands in the crypto space, was heavily invested in Solana.\n\nEx-FTX boss and co-founder Sam Bankman-Fried was a prominent Solana supporter, and the company invested in numerous Solana-related projects. FTX launched a marketplace for Solana NFTs, and even co-created Serum, which at one point was considered a foundation of the Solana DeFi space. At its peak in 2021, Solana commanded a market cap of $78 billion and boasted a $10 billion DeFi ecosystem.\n\nFTX then collapsed in a highly publicized bankruptcy while holding over $1 billion in SOL. The cryptocurrency plunged as a result.\n\nBut big players still see real value in the project.\n\nIn August, Solana’s payment protocol Solana Pay integrated with the e-commerce platform Shopify, allowing merchants to accept stablecoin USDC via the blockchain. This collaboration “capitalized on Shopify’s influential 10% share in the U.S. online retail sector, which translates to an estimated $444 billion in global transactions,” according to Mahendra.\n\nThen, payments giant Visa announced in September that it had chosen Solana’s blockchain for its stablecoin ambitions. This, according to Solana Foundation’s head of strategy Austin Federa, “validates the importance of the network’s unmatched speed and scalability.”\n\nThese two moves were seen as bullish by investors who have since been plugging fresh cash into the project. And things really picked up in the last month.\n\nPatrick Felder, founder & CIO at Prismatic Capital, told Decrypt this was because when Bitcoin and the broader crypto market started rallying, SOL was the most deeply oversold asset in the space following news that FTX’s new management might sell off large amounts of SOL.\n\nAD\n\nAD\n\nBut this, according to Felder, was “massively overblown” FUD (fear, uncertainty and doubt) and “triggered a massive short squeeze.” In the world of trading, a short squeeze is when the price of an asset shoots up unexpectedly due to short sellers (those who’ve bet on the asset going down) exiting their positions.\n\nThis happened with SOL, according to Felder, as many had bet on Sam Bankman-Fried’s FTX trial hurting the asset's price.\n\nThe Solana community’s annual conference, Breakpoint, took place at the end of October, leading to an even bigger rally, added Felder.\n\nThe irony is that at Breakpoint last year, the price of SOL had plunged by 60% in the week following the FTX crash. Spirits were low. But now, the coin has made a stunning comeback.\n\nAs always the question is, will it last?\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxQclhDNWZScDJRUHVWOTFKdTZpNmZiMWJUREtockktNTNvSllOMVN4bVV5andiTno5NHI2YzBORk1xaXZxZXhFWWxaRjRhUjNhUDF2VG9YYmdQR3V2Um1JcWM4VS16NVdPWERVZXZvVnEwSjhYdUszLUZPNjdnNGFyU19EVmU2YkFudXdlT21mLXhuSE8tQ295Nl91bmxLVFhJelZla3hzaEpONzZ4U191Zm0zRV9XeS1kWEhhWm1mMnd5d9IBxwFBVV95cUxNMnI4b3hvbjNaeVlJZWJkX3dyM2VFSUlRXzNVNG9ld0NNNnJmS1lVaHFoaEhGQUNVdUpZQXBDU19zNTlLU3h1Q09fdWVWU2RFamtJOG16NTVkdV8tN19UbGRINDR1WER4UDdtaTQyWUhpVTItNkprUlJUSU5GVVB4R1g4U1V2QjBKeTlnLWpIYlYzNVNRSkJJdDRKMExkck9CWlFLLW05V3ZRenI0WVplbmRtam9Qc3NONDVnbUZVQVhHWG9tN3hF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "Banker Loses Access to $450,000,000 Worth of Ethereum (ETH) After Misplacing Wallet Keys: Report - The Daily Hodl",
        "content": "An Estonian banker has confirmed himself to be the owner of an Ethereum address with over 250,000 ETH worth nearly half a billion dollars – but says he lost the keys.\n\nIn a new interview with Vikerraadio in Estonia, LHV Bank founder Rain Lõhmus was asked about something he said years ago about getting into Bitcoin (BTC) and Ethereum in their early days but then losing access to his wallets.\n\nAsked if he ever found his keys, Lõhmus says,\n\n“No, and I haven’t made much effort either. It’s no secret that I have a wallet with 250,000 Ethereum units, anyone can calculate for themselves what it’s worth.\n\nInterviewer: That’s hundreds of millions?\n\nYeah, and I can’t solve this alone; if someone thinks they can, I’ll take all offers. My own best plan is to build Rain Lõhmus as an AI and see if he can get his memories back.\n\nLõhmus said the dangers of handling your own keys and seed phrases was one of the weak points of crypto.\n\n“I absolutely agree that this is a very weak point of this system, which makes you think that this perfect decentralization has other risks that you don’t usually think about. But it’s very common for me to lose passwords. I went to renew my ID card passwords today; if it were crypto, I’d be in a big crisis again, but luckily the police and border police work.”\n\nBased on the information shared by Lõhmus, on-chain analysts have identified his Ethereum address, and according to Etherscan, it is the fourth biggest holding of ETH excluding exchanges, the Ethereum Foundation, and the Wrapped Ether (wETH) address.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Tithi Luadthong/Natalia Siiatovskaia"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiYkFVX3lxTE93T1R0cEt4UGlHV1NYTVNUT3R4Nml2bWcwQnlxcFhkdTViNktFM0ZvWHB6eVZuOXlTakswZENjZ1JzOWJXOGxXSlE5ek1HQ2VKQ3ROM0wwTFFCZkR1Ynp2OWl3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "Evmos hopes to lure Ethereum developers to IBC by deprecating Cosmos transactions - Blockworks",
        "content": "On the Cosmos-based EVM chain Evmos, Cosmos transactions and Ethereum transactions have been operating under different standards, leading to complications as these two types of transactions struggle to decode each other effectively.\n\nEvmos plans to relieve this technical headache by only supporting Ethereum-formatted transactions by 2024 Q3, it announced in a blog post Tuesday. Despite this strategic shift, the protocol emphasized that Evmos is not exiting the Cosmos ecosystem. Additionally, Evmos’ founder suggested that the move could help bring Ethereum developers to the IBC.\n\nEvmos functions as an Ethereum Virtual Machine (EVM) compatible blockchain that integrates the Cosmos IBC protocol, allowing it to operate as an EVM within the Cosmos network. Evmos raised $27 million via token sale in late 2022.\n\nRead more: Uniting the blockchain ecosystems: Q&A with Cosmos founder Ethan Buchman\n\nThe project’s co-founder Federico Kunze Küllmer said that by only supporting Ethereum transactions, Evmos hopes to make it easier for Ethereum developers to start working in Cosmos.\n\n“The wallets and the tools that they are already used to on Ethereum do not work easily on Cosmos,” Küllmer said. “We want to make it very easy for the developers and users that are already interacting with Ethereum wallets to interact with any Cosmos application specific blockchain.”\n\nThe Interchain Foundation, a non-profit focused on Cosmos adoption, made onboarding Ethereum developers a large part of its 2024 roadmap, Blockworks previously reported.\n\nIn the lead-up to fully embracing Ethereum-formatted transactions by Q3 2024, the protocol has committed to burning all Cosmos transaction fees during this interim period. This action will effectively remove these fees from circulation, signaling a shift towards revised token economics for the EVMOS token. Küllmer indicated that further details on the new tokenomics will be unveiled next week.\n\nEvmos (EVMOS) was worth around $0.07 at the time of publication.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTE9oYWFralhTRDhsVFllVVRTdFpnSS10VXpxVXdtbmIyR3hjQzQ1Mm9LTzg4REhWMC1UY1J6bk9aOFMwQ2thNV9yRjlqRVVvYlZ0WkNWeG5Cb0JlSDVPN3hCTDAwNUZ1aUctYlNvc2wtMnZYUTA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "New Ethereum rollup takes a zero-knowledge approach to sharding - Blockworks",
        "content": "Ethereum scaling solution builder =nil; Foundation has introduced zkSharding for Ethereum, the latest infrastructure attempt at gaining faster transaction speeds while maintaining Ethereum’s economic security.\n\nSharding, unlike other popular scaling solutions, is designed to divide the Ethereum network into different sections and process transactions in a cheaper, more efficient manner.\n\nZkSharding utilizes zero-knowledge (zk) technology to generate proofs, ensuring that transactions are valid across different layer-2 shards before being submitted to Ethereum mainnet. The greater the sub-shards, the higher the maximum throughput on Ethereum.\n\nThis technique is not to be confused with Proto-Danksharding, which refers to Ethereum Improvement Proposal (EIP) 4844, and whose primary purpose is to reduce the costs of transactions for zk rollups by storing them in temporary data blobs, Misha Komarov, CEO and co-founder of =nil; Foundation told Blockworks.\n\nAll zk rollups can benefit from Proto-Danksharding, but only applications built on =nil; will be able to benefit from zkSharding on top of that, Komarov explains, noting that data-intensive environments and high-load environments will be able to benefit most from zkSharding.\n\n“As a zk rollup, =nil; benefits from Proto-Danksharding that cheapens storing transactions on Ethereum, however zkSharding as a scaling concept addresses fragmentation of liquidity and economic security,” Komarov said.\n\nZkSharding represents a combination of modular and monolithic blockchain architectures and delivers an appropriate solution based on its features in a competitive layer-2 environment, he said.\n\n“We believe that zkSharding addresses the drawbacks common for other alternatives on the market that go, by design, with application-specific scaling,” she said.\n\nSpecifically, Komarov notes that applications built on other zk rollups can only interact with liquidity or data that was migrated to its specific zk rollup environment, limiting market efficiency and creating additional trust assumptions and costs through bridges for interoperability.\n\n“zkSharding introduces separate shards as dedicated execution layers that are fully composable with each other, meaning a transaction can trigger the creation of new transactions on other shards,” Komarov said.\n\nThe goals are familiar from other zk-based scaling approaches such as zkSync’s, however. ZkSync terms chain connections using the ZK Stack architecture “hyperbridges,” which are also designed to trigger transactions on other “hyperchains,” a spokesperson told Blockworks.\n\n“As a rule, don’t trust, verify the claims of those that promise to solve the layer-2 fragmentation of liquidity issues — even with cutting-edge zk tech, it’s definitely not solvable for native assets without adding non-negligible security assumptions,” the spokesperson said.\n\nFinding the proof in the pudding will have to wait in the case of the new =nil; layer-2, which is initially operating with a single shard on a testnet."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxONmNFZFptZ25LYkZuU3VoYVI3N3RWZ2NqTXduR0ZFQ08zbVlXcWhCcW5MZEhoZDNXbm5wOXVvT3ppSklwZ21sSnhhMW9SMG43eFplYXZVTjNjRXJOYWJJMzZIQTMzODFUREhfWUxJUGd3eEh4bHhkNlBFcndnNEJCTzJneGdoZHJPV1lkeVNfVE9EdlJHU0xGMTVn0gGfAUFVX3lxTE1lSXZuZGlPUDhhRUh3cW5zQWpGUWxwYU9MakFKeUNOZjBwSjc5eHI5QllIR0pTNHJWWGRSWER5N1d0VlBiREd0LUJ0QkM0bVc1TG1EcGthaHM4eml0VkV2aTNMOFdIQUFIMm5sOU05eVVHRDJIc1pOYkNDZmlvSXR0MGI5Mk9qelY2QW5Pb0pLbjd0TVFoQ2Y5RHFaUWREVQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Nov 2023 08:00:00 GMT",
        "title": "The Protocol: Kraken Awakens – as Ethereum L2 Candidate - CoinDesk",
        "content": "CELESTIA POSTSCRIPT: Rarely are blockchain projects alone in the pursuit of hot new ideas. That's true of the au courant rush by various efforts to provide \"modular\" solutions for handling the various tasks of a blockchain, including the job of \"data availability,\" which involves managing growing reams of data and efficiently providing it to users or applications when requested. The data-availability network Celestia dominated the headlines last week, especially with the buzzy airdrop of TIA tokens garnering interest from crypto traders. This week, a rival project, Avail, announced a new incentive program on a test network to encourage early adopters to \"battle-test our code base.\" And Near Foundation, hosting an annual conference this week in Lisbon for the layer-1 blockchain NEAR Protocol, announced its own plans to offer a data-availability network for the Ethereum ecosystem. Despite the interest from solutions providers, early usage of Celestia appears to be modest so far. Galaxy Research's Christine Kim wrote in a newsletter on Nov. 3: \"Now that Celestia has launched, the true value of the protocol will come from the rollup ecosystem that is created over the next few months and years on top of Celestia. The adoption of the rollups built on top of Celestia will dictate the revenue and long-term success of the protocol, and ultimately, prove (or disprove) the blockchain modularity thesis. \""
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxOM2xHbTJxMFl3TkwzSmlpczZkRTJ0RDNGSkRtREhpekhvVmFvcGpVeGNFRGdWc212OFBWR1hwaF82ZWJSbXVnNHpXZkozZUlqRGlvalVfc1c3RGdHZjFiMzh4QmlseWlMZTh6dDhoeWZmR3lnMGN2NjFsMnNoWmFQZ1R3TnZ6TkVkVVRnMkx0VjdYZDQ0NUhwOHJB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Nov 2023 08:00:00 GMT",
        "title": "Unmasking Owner of Ethereum Wallet with 250,000 Lost ETH - The Crypto Basic",
        "content": "Investigations have uncovered the mysterious owner of a crypto wallet that lost the keys to a $450 million fortune in Ethereum (ETH).\n\nAccording to Coinbase director Conor Grogan, the owner of this wallet is Rain Lohmus, co-founder of LHV Bank. The wallet contained as much as 250,000 ETH, most acquired during the coin’s Initial Coin Offering (ICO) in 2014.\n\nOne mystery solved: This address (which now holds $450M of crypto) belongs to Rain Lohmus, founder of LHV Bank Unfortunately he lost his keys and can't access these 100s of millions. If you can help him recover them somehow, he's willing to split them with you https://t.co/wYLAU9gKzb pic.twitter.com/0A1nIjFSyn — Conor (@jconorgrogan) November 6, 2023\n\n- Advertisement -\n\nRain Lohmus and Recovery Strategy\n\nLosing the keys to wallet addresses is not uncommon in the crypto ecosystem. Infact, according to a computation made by Conor, a minimum of 909,800 ETH with a valuation of over $1.73 billion remains lost on-chain. This accounts for 0.73% of all circulating Ethereum supply.\n\nOne distinguishing trait of Rain Lohmus is that he has chosen not to give up on the push to recover the asset. He has a strategy to power the recovery, but according to what appears as an interview excerpt shared by Conor, he wants as much help as he can get, from anyone.\n\nWhile he said he’s open to any offers from the public on how to recover the funds, he revealed his best plan is to build “Rain Lohmus” as an AI to see if his memories can come back to remember the lost keys.\n\nDaunting as this task is, the LHV Bank founder said he takes it easy on himself. Lohmus acknowledged the possibility of spending a decade trying to hack this challenge and achieving zero results. Based on this, he said he’d rather embrace solutions where he can get visible progress daily.\n\n- Advertisement -\n\nFor anyone who can help him recover the funds, Lohmus plans to split the funds as compensation.\n\nOnly Untouched ICO Wallet for Now\n\nRecently, we have seen some Ethereum ICO wallets coming alive, but Conor noted that in his research, the Rain Lohmus wallet remains the only address from this era that has stayed dormant.\n\nBased on previous discoveries, the wallet acquired $75,000 worth of ETH at the 2014 ICO and has never made a single transaction. The wallet, over the years, received an intriguing bonus worth $6.5 million just for HODLing, the earlier acquired ETH."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxNTUwyZVJMWndTWUhnZkZtUl9JdS0tcVBKWXdkTnc2RXhLQzBSNDNnZEFnUTZSOGFxUW5XY3dTZ2tvNnduYjJkTDJoc2Z2LTVxY1FwSU40M1BIVGlCSVZsdm9JcG1LY3Nmdl9kY3NvOTZjVmx4a2I4NS1US2hXX0FGbGN0a2FlS1NaS1hwdXZEdGRZZFpMZDZWM1JQdVU5djJQbDdpRXo0X3hTbl9fdHZj0gG0AUFVX3lxTE5qUjVQT3VKNVZ5cXh1UnNnZi1lblhtYmY4SG12SDRNejY0OVJDbmNHbzQ2QWltdFJCeG9acXh4bzVXaHNQd1kwRXNsdFdjVjhDdnBmMFMxc01kemFwenEtUVBVWHJxc2ZrVS12M3FJX25oT3VhY19EX3hmOWk1U0JqTmtmQndKTzF1LUt2QlM3Q1djdXhBSkxlQmNCU09xT001OF90bDNMek1BaGRVT1V2alV4Uw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Price Prediction: ETH Going To $5.8? Here’re The Levels To Watch - CoinGape",
        "content": "Ethereum (ETH) price is pulling back after taking a breather in the wake of the climb to $1,900 earlier this week. The prominent smart contracts token needs to sweep fresh liquidity preferably at $1,800; the immediate support. Traders may take this opportunity to lock in the gains, a move likely to trigger a larger sell-off.\n\nHowever, with a bull flag pattern validated on the weekly chart, investors do not need to panic, as the next rebound could overcome resistance at $2,000 and pave the way for gains to a new all-time high of $5,800, foreshadowed by the Finder’s panel.\n\nadvertisement\n\nA higher support is anticipated above $1,800 as Ethereum collects liquidity for the next breakout above $2,000. For now, it might be prudent to let the consolidation play out before betting on either longs or shorts.\n\nEthereum Price Bullish Scenario – Bull Flag Pattern\n\nThe weekly chart highlights the formation and validation of a bull flag. This is a bullish flag pattern, formed by a couple of price rallies set apart by a consolidation period.\n\nThe flagpole represents the bullish muscle blindsiding sellers who then briefly assume control over the price (the channel), as profit-booking takes place, but eventually, the price breaks out to a higher level.\n\nIn Ethereum’s case, the bull flag breakout has already been validated. However, due to the resistance at $1,900, buyers lack the momentum to complete the 49.44% breakout target of $2,678.\n\nWith Ethereum price holding above all three moving averages, including the 50-week Exponential Moving Average (EMA), the 100-week EMA, and the 200-week EMA, the uptrend has a higher chance of resuming than a correction taking place below $1,800.\n\nTraders should be on the lookout for how Ethereum price responds to the support provided by the 100-week EMA (blue) at $1,806. A retest of this support could prove highly bullish and trigger a larger breakout.\n\nHowever, trading below $1,800 might be detrimental to ETH price as it may discourage traders from booking new long positions afraid of capitulation. Below $1,800, the next key support areas are the 50-week EMA (red) at $1,757 and the 200-week EMA (purple) at $1,633.\n\nFinder Analysts Predict Ethereum Price Rise To $5.8k By 2025\n\nFinder, a platform that brings together predictions from different industry leaders, has predicted a potential surge in Ethereum price to $5,800 by 2025.\n\n“On average, our panel thinks Ether (ETH) will be worth US$1,840 by 2023 before rising to US$5,824 by 2025 and then US$14,411 by 2030,” Finder’s latest report states.\n\nMeanwhile, Ethereum is expected to close the year at $1,840 based on the average prediction of the panel of 31 crypto industry specialists. The panel appears to have changed its tune toward the bearish side, following a previous optimistic prediction of $2,451 in July.\n\nMost panelists believe that “ETH has a huge growth potential” especially with the growing interest in “Ethereum staking and [ETH’s] exceptional low inflation rate” which points to a potential short squeeze likely to culminate in a remarkable upside in the ecosystem, believes Ben Richie, the managing director at Digital Capital Management Pty Ltd.\n\nHowever, some specialists like Ryan Grace, the head of tasty tastycrypto said that like Bitcoin price, Ethereum price is bound to encounter macro headwinds which could limit its upside action in the short-term, especially with the Federal interest rates above 5%.\n\nRelated Articles\n\nJohn Isige John is a seasoned crypto expert, renowned for his in-depth analysis and accurate price predictions in the digital asset market. As the Price Prediction Editor for Market Content at CoinGape Media, he is dedicated to delivering valuable insights on price trends and market forecasts. With his extensive experience in the crypto sphere, John has honed his skills in understanding on-chain data analytics, Non-Fungible Tokens (NFTs), Decentralized Finance (DeFi), Centralized Finance (CeFi), and the dynamic metaverse landscape. Through his steadfast reporting, John keeps his audience informed and equipped to navigate the ever-changing crypto market.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxNbUtnQlkzMHBzODlyZWtRM2RqdV9hT05VbzN1bXVOcjFvWENVWFV4MEFqWGhUTllTSUd5UmNzTHRNTDBBNUhxMzNpWjdsZHRTbzdwQm9TbEtPME9ZOHlRZ25EUGtKLVpCY2pES0g5OVhHSDFOMnFrOE0tVzNxamoxVQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "Analysis of Ethereum’s on-chain data and ETH price - The Cryptonomist",
        "content": "During 2023, Ethereum Layer 2 sector, and more generally the entire blockchain infrastructure landscape, has seen strong growth in terms of new users not in price.\n\nThe DeFi sector saw a 52% increase in activity this year, driven by the strong development of the L1 interoperability and scalability platform.\n\nIndeed, Ethereum users seem to prefer decentralised finance to other NFT and gaming activities, with on-chain trend data clearly indicating the dominance of this sector as the first choice of individuals on the network3.\n\nMeanwhile, the speculative cryptocurrency market continues to make progress, with ETH topping $1,900 per unit overnight, only to retreat slightly this morning.\n\nCompared to the beginning of the year, the price of the industry’s second most capitalised crypto has risen sharply, but will this be the case in 2024?\n\nWill Ethereum’s technology be able to dominate and attract the next billion users?\n\nAll the answers in this article.\n\nOn-chain data in the Ethereum market and classification of user habits\n\nOn-chain data for 2023 shows that the Ethereum infrastructure and its entire ecosystem is booming.\n\nThe entire layer 2, bridging platforms and web3 services sector is growing rapidly, with a positive estimate of 149.28% of new users compared to the beginning of the year.\n\nIn particular, the niche that seems to be attracting the most attention is that of DeFi, which, as we will see later thanks to the metrics provided by Nansen, has achieved higher user traffic than other decentralised industries.\n\nMore specifically, we start collecting on-chain data by looking at the change in the number of active addresses on the Ethereum blockchain over the course of 2023.\n\nAs of October 2023, there are over 300,000 entities that have successfully completed at least one transaction, such as transferring assets to another address.\n\nThis shows that, despite two turbulent years consisting of price collapses of most cryptocurrencies, global crises and hack attacks on the largest DeFi infrastructures, there is still a user base working on Ethereum on a daily basis.\n\nTrying to go deeper, thanks to Nansen’s custom queries, we can sample active users on Ethereum to understand their attitudes in 2023.\n\nWe classify the people in question as\n\nDeFi users : addresses that have used DEX, lending and yield farming platforms, opened positions with decentralised futures, executed stablecoin payments, exploited yield optimiser or arbitrage protocols, etc.\n\n: addresses that have used DEX, lending and yield farming platforms, opened positions with decentralised futures, executed stablecoin payments, exploited yield optimiser or arbitrage protocols, etc. NFT scammers : addresses that have participated in NFT auctions, played crypto casinos, roamed the metaverse, invested in NFT liquidity platforms, bet on GambleFi;\n\n: addresses that have participated in NFT auctions, played crypto casinos, roamed the metaverse, invested in NFT liquidity platforms, bet on GambleFi; Scaling solution enthusiasts: addresses that have used scaling solutions such as rollups, cross-chain interoperability platforms, bridges, sidechains and L2.\n\nAccording to the data recorded by Ethereum’s various web3 applications, we can conclude that the majority of active users have made DeFi their primary choice in 2023.\n\nAbout 92,000 addresses are classified as ‘DeFi users’, while only about 40,000 preferred NT and scaling substrates overall, according to a snapshot from 12 October.\n\nSince March, there has been a strong increase in scaling protocols, supported by the trend of Ethereum rollups and alleged airdrops for early adopters.\n\nIn contrast, the NFT niche has lost over 50 percent of its on-chain assets over the past year.\n\nAnother way to analyse the regularity of Ethereum users is to look at the FIRST on-chain transaction made by NEW addresses in 2023.\n\nBasically, all wallets that were funded by other entities in 2023 and executed a transaction within 7 days were analysed.\n\nOnce again, DeFi seems to be the preferred choice of the crypto world’s degenerate, with the majority of transactions flowing to this sector.\n\nAccording to data from 12 October, only 17% of new users used Ethereum scaling solutions as their first transaction, but this figure is up on the beginning of the year.\n\nOn the other hand, transactions in the NFT market were less frequent, falling from 24% at the beginning of the year to 6% on 12 October.\n\nDeFi confirmed its dominance by recording a significant increase in this metric, with data showing 66% at the beginning of the year and 76% on 12 October.\n\nEthereum (ETH) price analysis and predictions\n\nAs mentioned above, it’s not just Ethereum’s on-chain data that will have supporters of the smart contract platform smiling in 2023, but also the performance of the ETH price, which has risen by more than 50% over the past 10 months.\n\nAfter starting the year just above $1,200 per unit, the Ethereum coin returned to the $2,000 area around April, then went through a mild distribution phase until the rally of the past three weeks.\n\nCurrently, the price of ETH remains firmly above the 50 EMA, suggesting another leg higher before the end of the year.\n\nThe RSI is rising on the weekly time frame and there is plenty of room for further upward movement.\n\nThe Super Trend Indicator, which has been very useful in predicting the beginning and end of previous bull/bear cycles, has called for a buy around the middle of the year (remember that it arrives a little later than market logic).\n\nIf we compare the current phase with that of 2020, when the Supertrend indicated a buy opportunity with ETH at around $250, we could say that we expect at least 4 more months of crypto price rises.\n\nGrafico settimanale del prezzo di Ethereum (ETH/USD)\n\nIndicatively, 2024 should be a good year for Ethereum and its cryptocurrency. Next year we can expect the halving of Bitcoin, which is usually the market’s best stimulus, and probably the SEC’s approval of the first crypto spot ETF tradable on US stock exchanges.\n\nIn addition, the Fed could also provide a positive boost to the price of Ethereum, with US interest rate forecasts signalling a high probability of quantitative tightening in favour of economic expansion with reduced debt costs.\n\nAll in all, the price of ETH is likely to exceed at least $3,000 next year. Several analysts agree that it will surpass its previous all-time high of $4,950.\n\nDespite this, ETH is still suffering in the pair against BTC and is down -25% since the beginning of the year.\n\nThis means that so far it has been cheaper to hold bitcoin than ethereum.\n\nIt will be interesting to see if this trend starts to reverse with the start of the new year, as it did during the last bull run in 2020."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMi2wFBVV95cUxQcUp5cmFyZGY5eVlxak5EQjdMcl9vUHVMMDRDMnN2QkdhMUdaQWlSTEFrM29HY2VDUnRBZHJ1Mks3QWhpR2hCTWpnYmVhdEl2STdXQVJHQmNfNUxyNTlfS2JzeFZCM1ZLaWV2aGJ0SFJIdDRpZTg5LVI1MDMxX2xldjRCMEUyV1doV3lWQ2R6R3NVRHBhVXJFUElGd0NsVmpyYnBTenRIQzRtbGx6WlhDa3h5YzYwcjVBaTUtZTA0QzZUSTdheWFBdk8yNmh3UmJXTk1jQl9kOGRGZmvSAeABQVVfeXFMUHdDTVBUbXkwbkpvRkZ6T21hdWlUem9rTmduOG5JNm9jZ1o0MTlBS1NnVzJfMkZ5R2NHZmN4NVJEUjFaaFJyaG04NVVTd1FqZ3ZHd2c2VlpoUzVMQ054TERYLWZxOENGdUJ2bVN2bzJzVmJDS3lEU3FYOFpFSk1FdzUzU2tKYXdhMktzV1pfMVNwaEJYOVNEaTlpX2pTQjBRRlQ1UTJ4MFRWblRPQnZFZEFNZHB6NW9yWUgzSHlpSGtaR3A2S0c3X2p4Y0hwa3h6YWo3aC1zcUlWbnV2NGFEYW8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Nov 2023 08:00:00 GMT",
        "title": "Top Trader Says No Resistance for Solana Until Well Above $100, Unveils Forecast for One Ethereum-Based Altcoin - The Daily Hodl",
        "content": "A crypto trader who accurately called Bitcoin’s (BTC) 2018 bear market price floor is predicting Solana (SOL) will easily soar beyond $100.\n\nPseudonymous analyst Bluntz tells his 226,000 followers on the social media platform X that the Ethereum (ETH) competitor Solana will likely increase by more than 218% from its current value after a long accumulation phase.\n\n“These high timeframe accumulation breaks after 90% drawdowns are the things dreams are made of. No high time frame resistance in my opinion until $137 on SOL.”\n\nHe also says that Solana is showing bullish momentum after breaking out of a downward channel.\n\n“SOL baby let’s go. LTF (low time frame) accumulation and channel breakout.”\n\nSolana is trading for $42.95 at time of writing.\n\nThe trader also weighs in on the liquid-staking service provider Lido DAO (LDO). According to Bluntz, the LDO against Bitcoin (LDO/BTC) pair may have already carved a cycle low.\n\n“LDO/BTC from inception. Trying to keep a level head about it and not get carried away, but good chance this is a cycle bottom against BTC.”\n\nLooking at LDO versus the US dollar (LDO/USD), Bluntz says that the pair is flashing a bullish setup on the four-hour chart.\n\n“LDO consolidating above the prior high, gearing up for the next markup in my opinion. I really like this setup. LDO/BTC ended up closing the week as a very nice engulfing as well.”\n\nLDO/BTC is trading for 0.0000555 BTC ($1.97) at time of writing.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxOZVBPLVJ6T1JuaGMzc3JBeF92dUJHNWpwazRGMkVaRXpRcWFQM2VHeG51eFROdUV2ZWFEN3JpV2EzYXVCbC1pSWRlaFRrUnBHYzN0SUJwbU1yOUtacXhUZUpvRENTaTBGcFBFOEs0cXkzMklrNzRDSEk0QU0xczZZemhBc3VkZ054UnZrcXpJUEtkVlo4V2txMHUwenVhWmRFUjVzMzhRcHZMUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Nov 2023 08:00:00 GMT",
        "title": "Launchnodes Goes Big on Impact Staking and Takes Solo Staking Next Level - Brave New Coin Insights",
        "content": "Launchnodes Goes Big on Impact Staking and Takes Solo Staking Next Level\n\nLaunchnodes, is a UK-based firm that enables enterprises and individuals to solo-stake Ethereum on public clouds and bare metal. In this article, we investigate what this means and what Launchnodes does and intends to do in the space of solo staking.\n\nLaunchnodes is the only Ethereum-focused solo staking provider in the world today. Now, the team behind Launchnodes is betting big on impact staking, believing that solo staking isn’t just about decentralization and staking returns – it’s also a way to fund long-term social impact.\n\nThe innovative use cases introduced by the company are exactly what the blockchain industry needs to prove it’s a real-world tool for solving problems, not just a space for crypto enthusiasts to get rich.\n\nStaking beats all records\n\nThe current Ethereum staking scene is nothing short of explosive. With over $43 billion worth of ETH staked, the network is not just the largest TVL player on the market, but also one with most number of participants. Whilst solo staking requires 32ETH, protocols like Lido and crypto exchanges open the floodgates to much wider audience, allowing you to stake 0.01 ETH or 35000 ETH.\n\nLaunchnodes’ clients on the other hand, require a minimum 32ETH to run their own nodes, but the process is simplified for them by not having to run or pay for a beacon node or an Execution layer node (although they help their business customers run all the nodes not just validators). Hence, you can either solo stake cheaply or stake below 32ETH with other providers. You get to choose your pattern based on your economic and technical preference.\n\nStaking attracts users for multiple reasons. The primary factor is the earnings that each validator node owner or a below 32ETH staker receives over the time of having funds locked. These earnings are transparent and are derived from the automated work that validator nodes perform on the Ethereum blockchain of updating the blockchain and securing the network.\n\nUnlike DeFi protocols that at times deliver unfathomable returns, staking is less lucrative, but stable with the core risk being the price of ETH. That being said, solo staking remains to be the gold standard of staking, delivering most of the returns, without having to share your returns with any provider.\n\nStaking and solo staking specifically, helps to decentralise the network, with each node representing a unit of capital supporting the network.\n\nTaking solo staking up a notch\n\nOk, so a yield through staking is old news. Can Ethereum staking be more than a financial outcome similar to a savings account?\n\nHow can Ethereum staking be utilised further? Launchnodes thinks that Ethereum staking represents a new way to fund social impact which they call impact staking. Essentially a donor only gives away the staking returns for a period of time 12/24 months and at the end gets their original capital back.\n\nLaunchnodes initially used staking returns to fund tablets in refugee camps for Save the Children. Then, working as an implementation partner worked with UNICEF/GIGA to use staking returns to fund internet connectivity in schools.\n\nYes, the principal remains untouched, whilst all the returns that the node generates are used to fuel social impact, crucially internet connectivity is something that spews out data, ie how long the line is up for, bandwidth etc, Launchnodes believes that funding these data-rich contexts is a crucial part of impact staking rather than simply connecting money into building a school. This is what impact staking is all about and it may just be the new model for philanthropic endeavours. As the capital gets returned.\n\nPersistence is key\n\nHaving proof of concept confirmed and executed, the team at Launchnodes pushed to get the idea to the masses. According to the team, it wasn’t a straightforward and easy ride. Introducing the notion of staking to leading non-profit organisations involves integrating Ethereum into the real world and foremost, coming up with a governance solution that these organisations can work with.\n\nAnd now, the broader Ethereum ecosystem is starting to pay attention. Launchnodes secured a grant from Lido staking protocol. Lido has $15 billion worth of ETH under management. Once implemented, any Lido user will be able to channel a share of staking returns to a good cause directly within the protocol. This is good news for those wanting funding in the social impact space, as well as for Lido and the Ethereum ecosystem.\n\nLast but not least, Launchnodes has just rolled out a validator node product in partnership with GiveDirectly. Here, the idea is simple. You get a discount on spinning up a validator node, point your execution layer yield to GiveDirectly donations, and retain the consensus layer returns. This way, anyone who wants to be an integral part of the network by running a validator node through solo staking, can now also donate a share of the staking rewards to social impact.\n\nSince its launch in 2009, GiveDirectly has delivered $700+ million to over 1.5 million people living in poverty, and this partnership sets out to use the benefits of solo staking to maximise donations even further.\n\nThe next stage\n\nAs per its original goal, Launchnodes is fully devoted to enabling enterprises and individuals to solo stake Ethereum. The major downside to solo staking is that spinning up your own nodes is not a function of a few clicks, says Jaydeep Korde, the company’s CEO. This stops many Ethereum holders from reaping the maximum returns that solo staking offers. Even with the hand-holding service that the company offers, Jaydeep believes that there is still room for improvement. It is something that they are tackling right now, with a soon-to-be-released solo staking UI, aimed at simplifying the process of launching validator nodes to a few clicks whilst still keeping the nodes on your infrastructure – and not a Launchnodes run platform.\n\nWhether Launchnodes succeeds, we are yet to find out. However, if blockchains are going to change the world, use cases like impact staking leave us hopeful to see the future unravell.\n\nPhoto by rc.xyz NFT gallery"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxQc3JzeDh4eFoxZ0RaWnVoQVB6aDNtMnh5SnJvTmFkSXFKcnVfVkYzU19RX3NSblpYNnV2SElLMVVCZlRTZ3ZYdF9lMnNwcW96UlYwRHMxN3hFNWwzUDY1eXZ4UC02aVVCUGFsaXVZTjFwZEZ6bVNRb1R6d0xRcm5RQ3FCcUdrY1ktVFAzWUdOeFowaUViRURVcHg5MnBxdE1LNTBTcjVyODVQUE9MTFRqZ2xqYnlGR2tEemFQWnpoRFNSNS1GbHc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "Bing Ventures Presents Ethereum 2030, Devconnect’s Premier Event #BingVentures - Media OutReach",
        "content": "Yajin (Andy) Zhou, CEO of Blocksec\n\nAzeem Khan, Head of Impact at Gitcoin\n\nJack He, Co-founder at Aspecta\n\nBertuğ Oymak, Co-Founder and CEO of Utilify\n\nDougie DeLuca, Investor at Figment Capital\n\nFatih Taşdemir, Co-Founder of Koin Bülteni\n\nVolkan KORKMAZ, CEO and Co-Founder at Altcointurk\n\nLuca (Moss) Mossini, BD at Avantgarde & Enzyme Finance\n\nSeraphim Czecker, Head of Taking Risk\n\nVaruni Trivedi, Editor in Chief at Voice of Crypto\n\nAnıl Öz, Chief Technology Officer at DATS Project\n\nArif Kalem, Brand Ambassador of Turkey at BingX\n\nÖzge ERDEMİR, Web3 Advisor, Business Developer\n\nSima Baktas, Web3 Attorney at GlobalB Law / Co-Founder of CryptoFemale\n\nDaria Krasnova, Managing Editor at BeInCrypto\n\nThe issuer is solely responsible for the content of this announcement."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxNaVdJYjE4cjJSaTBMOTFTb215ZkdoMFo5OUI2b2Q2STZyeWhzdEJib1N2VFkwbDNKVUtZZjdrUXdpdXI4WjhKdVkxX2lsRlV3U25LNjhHdmlrOXBuTjlHcFdYSlNPbEU5UzNmQzBheG1NNVE2cFpSZTg3VXdwVVM2MUZ6RDlOM2xJLTI0b0hjM21zS1I5dmJhMzgtNlFySkg4MmtZdFNkMEViYkpYSEZ5NdIBtgFBVV95cUxNNDREVUs1d3lScjkyRFA4U2ZLSXJxbk42ZHFFVHR5cURvenQyeF96NldHYTlTMjdDTm42blNNWjduRkdyLW5QaGw4TG9WUlM3eDJyVi1KRlhELUpRWXYwbzFTaGFsWUV5c3ZaR1VVTU9TZDhsdjVranlxTDFaNFdNR3N1WF8yc1dGTHdCbzNvb3VLTkg1TTRkOE5zUmpQWEZESmRFTlZNQm01UlVWaHRyeG9seTBGUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Nov 2023 08:00:00 GMT",
        "title": "Near Foundation and Polygon Labs Collaborate to Build ZK Solution - CoinDesk",
        "content": "“We are proud to collaborate with Near on this exciting research initiative to further drive the development and adoption of ZK technology,” said Sandeep Nailwal, co-founder of Polygon. The zkWASM prover maximizes developer customizability, which means projects will be able to select from a number of provers when building with Polygon Chain Development Kit (CDK), whether that’s launching or migrating an EVM chain, or building a WASM chain for closer Ethereum alignment and access to liquidity.”"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxPcGRiOFZITF9rX3lYazVadGlTVkV6eEtZT25sUGptTnptSW02Skw1T1VfQ05jLV9pc3lBWHhsWEhFRW5yS3RtUFJtVWQyZDZaQ0xORzBQNEJycGE3bmFrOXdFSDFJblUtZ2RMMDhCdjRxX242c0hZZE8xYnB0RW82cUdnTXV6THNmWWVqSHptcDVfWFFMYTlN0gGcAUFVX3lxTE5ac2g0MU5CMGNvcTNRU0IyMEpsekhxdUZ0ZXh4R2dIN2Zxam41eThDSnY3TlQ1eXFwZjZnaWlWUlhoWkg0NTRHTWZUTTZseWVMTXBuTGtvT2ZjdU54TS1aeFlVUW5SS041SjdNQ01RS1FPQUczOWw4RHdDNkUwV0VIX1RfWTZOcGgzVWlKdHhsR2M5d25feWpWWWlpUg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "Can LHV Bank’s Founder Regain Access to His $470 Million ETH Fortune? - CryptoPotato",
        "content": "In a recent revelation, a dormant Ethereum wallet holding $470 million worth of ETH has been linked to Rain Lõhmus, the founder of Estonia-based LHV Bank.\n\nHowever, Lõhmus has lost the private keys to this wallet, and he’s now seeking the help of the crypto community to regain access.\n\nLHV Bank Founder Rain Lõhmus Identified As Wallet Owner\n\nThe story began in February when Coinbase director Conor Grogan first drew attention to an Ethereum wallet that had remained untouched since the blockchain’s inception in 2014. This wallet contained 250,000 ETH, a sum that, at the time of writing, exceeds $470 million in value.\n\nFast forward to November 6, and Coinbase director Conor Grogan provided an update, officially linking the wallet address, 0x2B6…0Ffb9, to Rain Lõhmus. This connection was established based on an article by ERR News in which Lõhmus openly admitted that he had lost the password to the wallet.\n\nOne mystery solved: This address (which now holds $450M of crypto) belongs to Rain Lohmus, founder of LHV Bank Unfortunately he lost his keys and can’t access these 100s of millions. If you can help him recover them somehow, he’s willing to split them with you https://t.co/wYLAU9gKzb pic.twitter.com/0A1nIjFSyn — Conor (@jconorgrogan) November 6, 2023\n\nGrogan, through a post on X, shared this revelation with the crypto community, stating, “One mystery solved.” This address, which now holds $450M of crypto, belongs to Rain Lõhmus, founder of LHV Bank. Unfortunately, he misplaced his private keys and could not access the substantial sum.\n\nAccording to the ERR News report, Lõhmus acknowledged owning a wallet containing 250,000 ETH, but he hadn’t put much effort into recovering it. In the interview, Lõhmus expressed his willingness to entertain offers from individuals who could help him regain access to his lost crypto fortune.\n\nThe Dormant Ethereum Wallet\n\nAs Grogan highlighted in a previous post on February 26, 2023, the 0x2B6…0Ffb9 address had held Lõhmus’ investments since the early days of Ethereum without a single transaction. During Ethereum’s ICO days, Lõhmus invested around $75,000, growing more than 5,000 times in value. Additionally, he received nearly $6.5 million worth of altcoins through airdrops.\n\nOne of the most mysterious addresses in all of crypto:\n\n-Bought $75k worth of ETH at the ICO in ’14\n\n-Completely untouched wallet; has never made a single transaction\n\n-Wallet now worth $400M+, a 5333x\n\n-Received $6.5M in airdrops just by hodling (a 87x on initial investment alone) pic.twitter.com/wBpw9pQcAB — Conor (@jconorgrogan) February 26, 2023\n\nAt the peak of Ether’s value on November 10, 2021, which reached nearly $4,900, Lõhmus’s stash was valued at $1.22 billion. Even today, Lõhmus’s wallet boasts a gain of 628,757%. According to Etherscan data, his wallet stands among the top 25 accounts in terms of ETH balance.\n\nFounded in 1999, LHV Bank is a subsidiary of AS LHV Group, a publicly listed company on the Nasdaq Tallinn Stock Exchange. The bank is currently the third-largest financial institution in Estonia, further highlighting Lõhmus’s significant presence in the financial world."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiYkFVX3lxTE1PTHZ2SjNqOHJnQ1oxMFNWbE10OVNhVHd6MWkxN2FWT1NtYUM4MHBYZTloaHJWdlZ4VkxCcXlNV1pjd1BiaVJpdE90aTl3SlVJTnloaF9hMlNiWVNLUUdDanJR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Nov 2023 08:00:00 GMT",
        "title": "Top 10 DeFi Platforms in 2024 - Bitcoin Market Journal",
        "content": "As we move into 2024, finance will be about decentralization.\n\nDecentralized Finance (DeFi) is one of the biggest and most exciting trends in the blockchain industry, with many believing it will overtake traditional finance in the coming years. This growing financial sector relies on the promise of robust, decentralized support networks that promote innovation (both financial and technical) that could fundamentally disrupt how we think of money exchange.\n\nAt the forefront of this movement is the collection of DeFi platforms that support crypto and blockchain projects, facilitate transactions across blockchains, and serve as a trading hub of sorts for investors around the world.\n\nWith that said, we must understand that DeFi platforms hold both peril and promise. In this guide, we’ll cover the top 10 DeFi platforms for 2024, looking at both the potential risks and rewards.\n\nBeyond TVL: How We Rank DeFi Platforms\n\nWhen our analysts assess DeFi platforms, they use criteria that articulate the “trust factor” of these platforms, such as year of launch, community following, and Total Value Locked (TVL) in supported protocols.\n\nEven though DeFi is a young industry, we’re looking for platforms that have stood the test of time (relatively speaking), typically with a large user base and significant value.\n\nTotal value locked is like money “locked” in traditional mutual funds or CDs. This metric does matter, representing the sum of funds available to a DeFi platform, like a bank’s lending and borrowing capacity. But many DeFi projects quickly attract a lot of capital and then promptly flame out as users leave the service, rendering TVL a less-than-useful metric. This is slightly different from other analysts. Most DeFi rankings look exclusively at Total Value Locked, which can be misleading. The DeFi industry has nearly $44 billion locked in apps.\n\nSo, TVL is just one part of the picture. We also look for longevity and the long-term ability to sustain a strong community of users — in the same way that we would look at a bank’s history and customer happiness, not just its size.\n\nAave, formerly known as ETHLend, is an Ethereum-powered, decentralized peer-to-peer marketplace for borrowing and lending digital assets. The peer-to-peer lending platform enables borrowers and lenders to agree on the loan terms executed using smart contracts.\n\nWhile Aave doesn’t have the largest TVL (Lido takes that award), it does have the greatest transaction volume and the longest history of any platform in our list, giving it the edge over other platforms.\n\nYear Launched: 2017\n\nBlockchain: Ethereum\n\nServices: Borrowing and Lending\n\nTotal Value Locked: $5,490,000,000\n\nCommunity Following: 549,500\n\nBMJ Score: 4.5\n\nCheck out BMJ’s Aave Investor Scorecard here.\n\nLido was launched parallel to the Ethereum 2.0 Beacon Chain as a liquid staking solution for Ethereum and other PoS chains. The protocol offers non-custodial staking services, allowing users to stake their tokens without locking assets or maintaining staking infrastructure.\n\nSince Ethereum has switched to Proof-of-Stake Lido has exploded. It’s huge TVL lands it very near the top of our ratings.\n\nYear Launched: 2020\n\nBlockchain: Ethereum\n\nServices: Liquid staking\n\nTotal Value Locked: $16,360,000,000\n\nCommunity Following: 269,000\n\nBMJ Score: 4.0\n\nUniswap is a decentralized exchange on the Ethereum network that enables users to trade ERC20 tokens autonomously and swiftly. It does so through an algorithm that matches trades based on supply and demand in a liquidity pool, removing middlemen and intermediaries.\n\nUniswap is one of the earliest DeFi platforms and has a huge user base, giving it a very strong showing in our ratings.\n\nYear Launched: 2018\n\nBlockchain: Ethereum\n\nServices: Token Exchange/Lending\n\nTotal Value Locked: $3,310,000,000\n\nCommunity Following: 4,500,000\n\nBMJ Score: 4.0\n\nCheck out BMJ’s Uniswap Investor Scorecard here and Risk scorecard here.\n\nThe Ethereum-powered MakerDAO is a decentralized Collateralized Debt Position (CDP) platform that supports the stablecoin DAI, which aims to maintain its value one-to-one with the US dollar. Users can open a Collateralized Debt Position (CDP) by locking up ether (ETH) or other Ethereum assets as collateral to receive DAI as a debt against the locked-up assets. The platform uses the MKR token for interest payments, and the DAI and MKR paid are burned once the CPD is closed out.\n\nWith its focus on borrowing and lending, along with a connection to DAI and a long history, Maker ranks very highly.\n\nYear Launched: 2018\n\nBlockchain: Ethereum\n\nServices: Borrowing and Lending/Stablecoin\n\nTotal Value Locked: $4,950,000,000\n\nCommunity Following: 261,000\n\nBMJ Score: 3.5\n\nCheck out BMJ’s Maker Investor Scorecard here.\n\nPancakeSwap is a popular decentralized exchange providing token trading alongside features like staking and liquidity pools. The DEX is based on the BNB Chain, formerly the Binance Smart Chain.\n\nWhile PancakeSwap is relatively new, it has a huge following. Its prominent place in the Binance ecosystem makes it a good choice for Binance users.\n\nYear Launched: 2020\n\nBlockchain: BNB Chain\n\nServices: Trading, Staking, Yield Farming\n\nTotal Value Locked: $1,100,000,000\n\nCommunity Following: 2,000,000\n\nBMJ Score: 3.5\n\nCheck out BMJ’s PancakeSwap Investor Scorecard here.\n\nCurve finance is a decentralized exchange protocol where users can swap and trade Ethereum-based assets. It also focuses on providing liquidity to the markets using a market-making algorithm that automatically buys and sells assets while profiting from the bid and ask price spreads, incentivizing users to add their funds to the overall pool and earn interest.\n\nCurve is another relatively new addition to the DeFi ecosystem. It’s large TVL helps lift it in our rankings.\n\nYear Launched: 2020\n\nBlockchain: Ethereum\n\nServices: Borrowing and Lending/Decentralized Exchange\n\nTotal Value Locked: $2,401,000,000\n\nCommunity Following: 354,600\n\nBMJ Score: 3.0\n\nCheck out BMJ’s Curve Investor Scorecard here.\n\nThe first-ever official lending platform on TRON, JustLend enables users to borrow and lend their assets and earn interest on deposits. The overall supply and demand of TRON assets decide the interest rates on fund pools.\n\nWhile JustLend is focused on the Tron ecosystem, this hasn’t kept it from amassing nearly $6 billion in TVL. While the community following is small it is a great choice for anyone focused on the Tron ecosystem.\n\nYear Launched: 2020\n\nBlockchain: TRON\n\nServices: Borrowing and Lending\n\nTotal Value Locked: $5,795,000,000\n\nCommunity Following: 58,600\n\nBMJ Score: 3.0\n\nCompound Finance is an Ethereum-based, open-source money market protocol that enables users to borrow or lend against collateral. Anyone can participate in Compound’s liquidity pool and start to earn interest on their digital asset holdings. The interest rates adjust according to the supply and demand on the platform. Compound supports DAI, ETH, and USDC, among other digital assets.\n\nCompound remains a popular choice for borrowing and lending, but is overshadowed by larger competitors Maker and Curve.\n\nYear Launched: 2018\n\nBlockchain: Ethereum\n\nServices: Borrowing and Lending/Stablecoin\n\nTotal Value Locked: $2,070,000,000\n\nCommunity Following: 850,000\n\nBMJ Score: 2.5\n\nCheck out BMJ’s Compound Investor Scorecard here and Risk scorecard here.\n\nConvex Finance is a DeFi protocol built on Curve finance. Convex protocol maximizes yields by streamlining the boosting experience. Curve LP (liquidity pool) providers can claim boosted CRV (Curve DAO Token) and earn trading fees without locking CRV. Users receive a token called cvxCRV when they deposit a certain amount of CRV tokens into Convex.\n\nMoreover, users can choose to stake cvxCRV tokens and receive CVX tokens as staking rewards along with a part of CRV rewards from Curve through Convex.\n\nConvex is a smaller service due to its ties with Curve. If you’re a frequent Curve user then Convex could be a good choice for you, but its niche status led us to rank it somewhat lower.\n\nYear Launched: 2019\n\nBlockchain: Ethereum\n\nServices: Assets\n\nTotal Value Locked: $1,710,000,000\n\nCommunity Following: 54,800\n\nBMJ Score: 1.5\n\nPopularly known as the “DeFi Smart Layer,” InstaDApp is a DeFi app based on the Ethereum network. It is designed to provide a single, easy-to-use access point to interact with multiple DeFi protocols. Instead of using 2-3 separate apps for lending, borrowing, or staking across protocols, InstaDApp allows users to do everything in one place.\n\nWhile InstaDapp is a great service it hasn’t really caught on as users seem to prefer interacting directly with their lending, borrowing and staking apps rather than using a third-party service.\n\nYear Launched: 2019\n\nBlockchain: Ethereum\n\nServices: DeFi Token, DeFi Smart Accounts\n\nTotal Value Locked: $1,970,000,000\n\nCommunity Following: 47,700\n\nBMJ Score: 1.5\n\nWhat Is Decentralized Finance?\n\nDecentralized finance (DeFi) refers to websites that offer “decentralized” financial tools and services such as investing, borrowing, lending, trading, tokenized real estate, and insurance.\n\nDeFi is a counterpart to traditional finance services, typically centralized through a bank or similar institution. Whereas conventional finance will rely on these institutions to facilitate transactions between parties, DeFi decentralizes these transactions as peer-to-peer through blockchain technology.\n\nThere’s a lot of potential in the DeFi space, and the data from the last three years validate this.\n\nThe Total Value Locked (TVL) in DeFi protocols was under $1 billion in January 2020. Spurred by frenetic activity in the crypto markets during the COVID lockdowns, it surged to $248 billion by November 2021 – a phenomenal 350x rise in 22 months.\n\nBy 2022, the crypto bull run had run its course, and a crypto winter hit the market hard. Although DeFi was also affected (TVL had dropped to just around $42 billion), the numbers remain significantly higher than in 2020.\n\nBut, even as centralized platforms like FTX have collapsed, the allure of DeFi remains strong. TVL surpassed $50 billion in Q1 2023, indicating sustained interest in decentralized crypto platforms.\n\nLiquid staking projects, in particular, have thrived in the past year. With a current TVL of $17.67 billion, this market sector has returned almost 300% over the past 12 months. Over the next decade, the DeFi market is expected to surpass $232.2 billion, with a CAGR of at least 42.6%.\n\nHow Do I Get Involved with DeFi Platforms?\n\nThere are various ways to get involved with DeFi platforms:\n\nEarning Yield : One way to earn “interest” on your crypto assets is by depositing them in DeFi platforms such as Aave or Compound , which will pay you an Annual Percentage Yield. (See our current list of Best DeFi Rates .)\n\n: One way to earn “interest” on your crypto assets is by depositing them in DeFi platforms such as or , which will pay you an Annual Percentage Yield. (See our current list of .) Liquidity Mining : This allows users to earn yield for providing liquidity (capital) to a liquidity pool on a DEX (Decentralized Exchange). Users may also be rewarded in the DEX’s in-house token, which may increase in value, like owning “stock” in the company. (See our list of Top Dex Aggregators .)\n\n: This allows users to earn yield for providing liquidity (capital) to a liquidity pool on a DEX (Decentralized Exchange). Users may also be rewarded in the DEX’s in-house token, which may increase in value, like owning “stock” in the company. (See our list of .) Trading on DEXs: Decentralized exchanges let people directly trade with each other, unlike centralized exchanges. You can often trade smaller coins on DEXes you won’t find in centralized exchanges.\n\nThe sustained interest in DeFi projects is encouraging for crypto investors. With the constant innovation and evolution of these decentralized financial services and the addition of new protocols, the DeFi space remains one of the most exciting areas to watch.\n\nInvestor Takeaway\n\nDeFi isn’t just randomly buying crypto and YOLO’ing for the best. It’s seeing opportunities in new markets and technologies and supporting well-managed organizations doing the same.\n\nAs the federal government argues over regulations and new designations for these assets, the role of DeFi in organizing and facilitating investments will just grow.\n\nThe platforms covered here are major players in the game. However, investors must do their due diligence and understand their expectations and needs before deciding on investing in any of them.\n\nThe fundamentals are here, and the future looks bright for DeFi.\n\nWant to get more insight on DeFi? Subscribe to Bitcoin Market Journal and get investing tips delivered straight to your inbox."
    }
]