[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiYEFVX3lxTE5PaERSUUhpZlZrcmpEQk02VmZ4QzFRb0xOTU9tX0RqWnZYRjZtSVlYY2VjMGZZMV8yWHhzcW5GUXFqWHpoTzhBc09GYUJ3a3JXSVlwUHQ5eXJGMmgydldjbw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "Three privacy-focused Ethereum L2s arising in 2024 - Blockworks",
        "content": "Several crypto startups are looking to develop the first-ever privacy-centric Ethereum L2.\n\nOn Ethereum today, transactions and other smart contract executions are all publicly visible. Transparency is a core principle of blockchain technology, meant to allow verification of systems and instill confidence, but it can also be a double-edged sword.\n\n\n\nWhile transparency ensures accountability, it also means that the details of these transactions and contracts are exposed to everyone, including malicious actors and hackers who can analyze transaction patterns, identify vulnerabilities in smart contract code, and exploit these weaknesses for nefarious purposes.\n\nPrivacy solutions offer dapp developers the opportunity to build applications that shore up these shortcomings without compromising security.\n\nIn the process, these privacy-first applications must endeavor to prevent harmful actors from concealing their identities, while protecting the rights of law-abiding citizens. In short, to avoid the fate of crypto mixer Tornado Cash, which allegedly was used to launder over $455 million stolen by sanctioned North Korean hackers.\n\nRead More: Tornado Cash Developer’s Arrest Sparks Protest in Amsterdam\n\nHere are a few teams that are hoping to build a functioning privacy-centric L2:\n\nAztec\n\nAztec is a privacy layer of Ethereum. It’s referred to as a hybrid solution using zkSNARKs and its very own programming language, Noir, to offer private transfers, meaning that the network is designed to validate transactions without revealing any sensitive information about them, such as the amount and parties involved.\n\nUnlike other zero-knowledge (zk) rollups on Ethereum, Aztec combines private and public execution in one single zk rollup. Meaning that a user’s own device is responsible for encrypting the transactions before it is processed by the blockchain.\n\nIts primary focus, for now, is to design a platform for engineers to write private smart contracts without requiring in-depth mathematical knowledge of zk proofs. It recently revealed a new testing environment, Aztec Sandbox, for interested developers and plans for a testnet launch early next year.\n\nFhenix\n\nEncryption start-up Fhenix hopes to bring fully homomorphic encryption (FHE) to smart contracts.\n\nUnlike privacy startups that use zero-knowledge technology, where data must be moved off-chain and decrypted in order for a prover to verify its accuracy, FHE encryption performs computations directly on encrypted data.\n\nBy keeping data on chain, the network will have the capability to process computations that come from various sources, such as an on-chain poker game or a sealed-bid auction contract.\n\nFhenix launched a developer testnet in July and plans for a full-scale testnet launch of its FHE rollup in early 2024.\n\nCOTI\n\nCOTI is a privacy L2 building on Ethereum. Unlike Aztec, which uses zkSNARKS and Fhenix with FHE, COTI V2 will use so-called Garbled Circuits to enable private transactions.\n\nGarbled Circuits enable two different parties to evaluate information, even if they distrust one another. The parties can each submit their ‘garbled’ or encrypted inputs, computations are conducted on these inputs and an outcome is obtained.\n\nCOTI will launch a developer testnet V2 in Q2 of 2024, and its mainnet launch will come soon after.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiZkFVX3lxTFBhZzJSWmZPRjg2dUZQVkV2OEZSa1BMRWZwQ3NBcF80VDlDVnM4MHpFYnlLYjhaRWFsazAzZGpjRW5NdVlUblZ5NnR2UlpRUlE5bjBaZGt6RmdiOW00QkZJNExtN21sQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Gas Fee Concept Explained - LCX",
        "content": "Why Do We Need Gas in the Ethereum Ecosystem?\n\nGas’s primary function is to reduce ETH’s volatility. ETH is publicly tradeable and listed on exchanges. As a result, it is directly subject to market volatility. Petrol is not listed on any exchange, so it is not directly affected by market volatility. An Ethereum smart contract requires more computational power than a straightforward transfer. In order to avoid instability, the fee must be meticulously designed.\n\nHow Is the Gas Price Determined?\n\nGas price is determined by two factors: the gas limit and the price of gas. The sender’s gas limit is the utmost amount of gas they are willing to pay for the transaction. The cost of gas is determined by market supply and demand. The final gas price for the transaction is calculated by multiplying the two prices.\n\nGas Limit * Gas Price = Gas Fee\n\nGas Limit: Gas Limit is the maximum quantity of ETH that the sender is willing to spend on the transaction. Typically, when discussing Gas in Ethereum, one is referring to Gas Limit. Sending ETH requires the shipper to set Gas Limit. If there is insufficient Gas Limit to complete the transfer, the transfer will be cancelled and the shipper will receive a Gas refund. Alternatively, if the sender specifies an excessive Gas Limit, any excess Gas will be returned to the sender.\n\nGas Price: Gas Price indicates the cost of Gas in Gwei. For instance, 1 Gas equals 10 Gwei. It is primarily determined by supply and demand in the market. Gas Price is multiplied by Gas Limit to ascertain the cost of gas.\n\nWhat Are the Factors Affecting Gas Fees?\n\nUnderstanding the dynamics of gas fees involves recognizing the factors that influence their fluctuations:\n\nNetwork Congestion: Ethereum’s popularity has led to network congestion during peak usage times. As more transactions compete for limited block space, gas fees tend to increase.\n\nGas Price: Users can set their preferred gas price. A higher gas price increases the likelihood of a transaction being processed promptly, but it also incurs higher costs.\n\nTransaction Complexity: The computational resources required to execute a transaction or smart contract influence its gas fee. More complex operations demand more gas.\n\nGas Limit: Each Ethereum transaction has a gas limit, which represents the maximum amount of gas a user is willing to spend. If a transaction’s computational requirements exceed the gas limit, the transaction will fail, and the user will still be charged.\n\nExternal Events: Market fluctuations, platform upgrades, and major smart contract executions can impact gas fees.\n\nWhat Are the Strategies to Optimize Gas Fees?\n\nNavigating the Ethereum gas fee landscape requires a strategic approach. Consider these tips to optimize your transactions:\n\nGas Estimators: Various online tools and wallets provide gas estimators that recommend a suitable gas price based on network conditions. These estimators help you strike a balance between prompt execution and cost efficiency.\n\nOff-Peak Usage: Initiate transactions during periods of lower network activity. Gas fees tend to be lower during off-peak times.\n\nLayer 2 Solutions: Layer 2 scaling solutions, such as Optimistic Rollups and zk-Rollups, aim to alleviate Ethereum’s scalability issues by processing transactions off-chain and settling them on-chain. These solutions can significantly reduce gas fees and transaction times.\n\nBatch Transactions: Some wallets and platforms allow users to bundle multiple transactions into a single batch. This approach can save on gas costs, as multiple transactions are processed in a single block.\n\nGas Tokens: Gas tokens are tokens that can be minted when gas prices are low and burned (destroyed) when gas prices are high. This mechanism enables users to hedge against future gas price increases.\n\nSmart Contract Efficiency: Developers can optimize smart contracts to minimize gas consumption. This includes techniques like reducing unnecessary storage operations and using more efficient algorithms.\n\nConclusion\n\nEthereum gas fees are an integral aspect of the network’s functionality. While they can present challenges, they are also a testament to Ethereum’s popularity and utility. By understanding the factors that influence gas fees and implementing optimization strategies, users can navigate the Ethereum ecosystem more effectively and make the most of its innovative applications."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxPVkpGWFhKcGl6ZEIwanVvVURUZWVpaTU0UldCREFCNVlDR2FQX0gta1oyUmJEMFRmR2VCZWVKaUk4a21uNHFfcEVpcmFUREF0Q2ZhM1gyYjFIMndIT0YwRWpkd1JUd2lHd2hobHkxcTJoOFVkbkwxZTloWHRDWkcyUzY0MVFEMGV4cTNURC05ejE2WkpSckdSMVo3aTF3NEVQd1NuZWVtUG1kZTlPQ3fSAbMBQVVfeXFMTVFWZk82QURwTTdReFM4WDE0cTh6Y1lZWkZQSUlIWEE3WmRKUF9ac3BtWmpRVzg3UkZNM05kVC13eThWbktadFdUalgzbWY4TS1oRktxckxZTmNYb2I2cWwxc2x6dXI3aTN3TUZ0c1phVHQtM2JTZ0FubUNhaUIzYzFFNnY5dEdCRlMxc0dheDR5bzdTdnlLNWp5LUFPcWliT3VfMVJnaUpvYkxZT3NZVDRONkk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "ETH Could Hit $15K in 2024, But These Ethereum-Related Tokens Will Outperform: Analyst - CryptoPotato",
        "content": "On Dec. 26, crypto YouTuber Lark Davis said, “Ethereum is going to make a lot of new millionaires in 2024.”\n\nHowever, he added that those with a lot of ETH, purchased at much lower prices and staked, will do well in the next bull market. But those getting into the market now, with the asset trading over $2,000, are not going to make it big unless they have a lot to invest.\n\nThe big returns will be made trading Ethereum layer-2 assets, he said.\n\nEthereum Will Make Millionaires In 2024, BUT Not How You Think pic.twitter.com/00YCLPyGCl — Lark Davis (@TheCryptoLark) December 25, 2023\n\nEthereum to $15,000\n\nLark highlighted a number of current and upcoming layer-2 listings, such as zkSync, Starknet, Linea, Scroll, Blast, Manta, and Celestia. “New listings can make money, especially in the short term,” he said.\n\nNewly launched tokens often exhibit pump-and-dump patterns as airdrop hunters offload them quickly. However, there have been several that have begun up trending soon after when they get listed on larger exchanges.\n\nFor the Ethereum hodlers, things could still be good in 2024. He compared gains for ETH from previous cycles and made a prediction for the next bull cycle in 2024 and 2025.\n\nNow that the asset has broken out from its resistance zone at $2,150, “it’s going to do big things.”\n\nIf Ethereum makes similar gains to the last cycle high, or even slightly less, “that will get us up to around $15,000 per coin.”\n\nThis is on a hypothetical 200% gain from the previous high, which was around $4,880 in November 2021.\n\nFor those buying now, there is a potential 500-600% gain, he said, which is a “relatively low-risk bet for crypto.”\n\nEthereum is very strong fundamentally despite the lack of love recently from the crypto community.\n\nETH Price Outlook\n\nCrypto markets are in retreat this Wednesday in Asia. As a result, ETH prices dropped 2% on the day in a fall to $2,223 at the time of writing.\n\nMoreover, the asset has now declined 6.8% from its 2023 high of $2,385 on Dec. 9. There is solid support at the $2,150 area where it could be heading next as markets continue to cool.\n\nThere is little doubt that the asset will perform well in the next bull cycle, but at the moment, the Ethereum engines are spluttering a little."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPOUlBMmI1dVZPSkVCdmFBblRXam9YeEk2dkg3bjVXbWExQlVOM0VTLVp2QmhsSTJLREZNdC16cl9RbDhWXzNlaFpNc2MwTHVtS3BBMzlCNXRseDhPYy0xOEgwQU5YSXJjbkxMUGJJUmhLdzhEdFZ4UGk3TTViQTJXQXpqSWQ0R1k?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "Trump’s Ethereum wallet moves $2.4M in crypto to Coinbase - CryptoSlate",
        "content": "An Ethereum wallet thought to belong to former U.S. President Donald Trump recently moved millions in crypto earned from sales of non-fungible tokens, according to reports from Arkham Intelligence on Dec. 27.\n\nArkham noted that Trump’s wallet began to send his ETH holdings to Coinbase three weeks ago and has moved 1,075 ETH, worth $2.4 million, to the exchange. Arkham added that Trump’s wallet previously held $4 million at its peak.\n\nLive Arkham data shows that Trump currently holds $1.39 million of ETH. He additionally holds $644,000 in MATIC and small amounts of other cryptocurrency tokens for a total of $2.22 million. Arkham’s data additionally indicates that the wallet did not initiate any transfers to exchanges before December.\n\nThough Arkham suggested that Trump is selling the recently transferred holdings, the attached transaction log only shows deposits to Coinbase. The log does not explicitly show that he has sold or converted the funds to another asset.\n\nFunds likely linked to NFT sales\n\nThe crypto wallet in question is believed to belong to Trump based on Arkham Intelligence’s findings. Arkham asserted in August that the wallet belonged to Trump based on information in a financial statement released that month.\n\nForbes India separately reported on Trump’s financial disclosure at the time. The wallet’s balance appears to originate at least in part from Trump’s NFT sales.\n\nSales of the Trump-themed NFTs are conducted through a firm called NFT International LLC. The company claims it does not operate under Trump. However, Trump has been highly involved in promoting the NFTs and has hosted various events for those who purchase the collectibles. He has seemingly collected royalties and revenue from the sales, as explained above.\n\nThe company has so far released three series of NFTs. The latest batch of NFTs attempted to capitalize on Trump’s recent arrest by featuring his mugshot photo. High-quantity purchases included a physical card with pieces of Trump’s suit.\n\nMentioned in this article"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxQNmtub0JJbEpicHFaX3VENGRxNFVzMXpWc2diY2FCNTUtQ2NzSUhjTzkwTXRsbElKUm5EVGY1SFQwc1pNbmVUZDAwd3A4Smc3QW5BUzJ6elRuWVdlR3FoUGVFMkVGT3h5c0Q5RTFUZ29sYjNJUm1oZXp4N3N2QUVFV0xIYUJNcjNLMDhUcENpNDNxNm5BSmdwMjhEY3lTcmNfZG5BSnlwR2xCeU9ydzUw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Price Forecast – Ethereum Continues to Consolidate - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxPU052OG9sa20wc0FDNWlaQUtkazhveG9ETldJbXFNR2dtd2c4OVJkSmZkWHZQd0RfeTZpLVAzaFNuTjJMLXl0TERpVE5GRG0xS2lwWDVFOHlxQk9vdVN5Q1lMZmNad0UwcDRFRmhGc2lYZWhpdTFfZFRsT1hzRk1YZUJtRm9VSERaRmlucUtVbzFxQ3NneGthT3NXZmZpOGR1SEhaYXNmT2RRb1VZc2ZyQmZMNTR3UXlIckowbDR5c0pnQdIBxwFBVV95cUxPZk1VeGpYQlZ6eVRMdnVMb2NreGtrcV8wYWJKOGNsdEFlX1lmYWZqMDg4TjZTbDFJMnJiQldadjhUS1dNd0dWdldkUTh1TUl6NkpWV2JkOVg2Sk51UkVreVd5Z08ySEdxOVl5MFV4S1Y0azhRc3Q2ZzZiS016M3p1VHNvNlF4U1RFaVk4RlRMc1NudHBTQ253LXZVOGZ0M0UwRFBrbWg4M2t1cTJ4RG5RTkJNeHNodW1LTElVWU0yazBQWWVxWTVZ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "Ethereum price eyes $2,500 mark as Solana market takes a breather - FXStreet",
        "content": "Ethereum price looks poised for a continuation of the uptrend, with several technical indicators favoring the upside.\n\nMeanwhile, Solana price is likely to face a correction after a multi-month period of SOL being massively overbought.\n\nETH could rise almost 7% to hit $2,500 amid rising momentum and a possible pending buy signal.\n\nA break and close below the critical support at $2,147 would invalidate the bullish thesis.\n\nEthereum (ETH) price looks poised for a shine after a prolonged contention against its peer in the Layer 1 space, Solana (SOL). This brings to mind previous reports where Solana founder Anatoly Yakovenko said he envisions a future where SOL and Ether co-exist, urging that the whole narrative of one ecosystem kills the other be binned.\n\nAlso Read: Crypto hack: Ethereum, Solana DeFi trading platform Thunder exploited for $239,000\n\nEther displays upside potential as Solana price shows weakness\n\nEthereum (ETH) price has spent the better part of December consolidating between the critical support at $ 2,147 and the $2,380 resistance level. Based on technicals such as the Relative Strength Index (RSI), the largest cryptocurrency may be poised to shine, at least for the short term.\n\nMeanwhile, the SOL market is exhibiting weakness, as the technical indicators hint at a possible dip in the Solana price. It comes after a prolonged period of SOL being massively overbought, indicated by the presence of the RSI above the 70 level since October 18, when the markets turned bullish. This preceded a correction.\n\nSOL/USDT 1-day chart, ETH/USDT 1-day chart\n\nEthereum price outlook with ETH shining at Solana’s expense\n\nAfter Solana price’s epic surge across the fourth quarter, the SOL market is taking a breather, with capital flowing into Ether. With this, Ethereum price looks ready to shine at the expense of Solana.\n\nThe RSI is northbound, suggesting rising momentum. The Awesome Oscillators (AO) indicator remains in the positive territory, adding credence to the bullish thesis. Increased buying pressure above current levels, therefore, could see Ethereum price rise, potentially flipping the $2,380 resistance level to a support before testing the $2,403 range high.\n\nIn a highly bullish case, the gains could extend for Ethereum price to tag the forecasted $2,500 psychological level, in a move that would constitute a 7% climb above current levels.\n\nETH/USDT 1-day chart\n\nOn the other hand, if the $2,380 roadblock holds as resistance, the ensuing rejection could see Ethereum price lose the critical support at $2,147, below which the bullish outlook would be invalidated. In the dire case, Ether market value could descend to test the supply barrier that now acts as a bullish breaker between $2,049 and $2,107.\n\nA break and close below the midline at $2,075 would confirm the continuation of the downtrend, with Ethereum price likely to spiral towards the $2,049 support, levels last tested in November."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxOc1MzR3QtNDF6NENTb3lZUzNXRzltT25WeFVnbzliRDYzSjV2TENnMmlBcVBKNWdnRTZ2S0VsUGJjckpEb1NlRFZfd3JqeXpnckRuZXk3TjBJeWV6Zi1hOUJlbjFERXEzdnBwSVlOdUJ5WnJkS0FBaDZadDgzRGsweVFVcWI3ODQ1aEtLa0tNc1daMjNpZ1ZhX19lV0dmLTBjU0lSbUVSanFtY3duWlFpRnl1c1pNc0tsdGEyMjNpTGZYN0pa0gHKAUFVX3lxTE5VZjZ1M3JmZEo1MjZRRWJHcVRCM0Rya1BaSUk0TU5pUHVWUTJMMDZEOTJYRV9SX3NITjl2MUNoN0liSTdseGdZVWpkU21iWW9IZXpORjRKbXhkdVJuZmVBZHUyUWtZdkxzRDN6VXprZWlpaThiUTRfbUY1eFItUVl3ZjNneFZBc2tOMGhzOVk5a1MxalU0ZVBLYTJTZGY5eEtjVWl0Zm9DSGVja0dTVmMxWVJfcjk4M21hWnc1c25reklwaDVpTXREZVE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "Incoming Ethereum ‘God Candle’ Will Catch Many off Guard, Says Crypto Analyst – Here’s His Outlook - The Daily Hodl",
        "content": "A closely followed crypto trader believes that Ethereum (ETH) is gearing up for a sudden massive move to the upside that will take many by surprise.\n\nPseudonymous crypto analyst Inmortal tells his 203,700 followers on the social media platform X that Ethereum could soon approach the $3,000 level, a more than 34% increase from its current value.\n\n“Ethereum god candle will catch many people off guard.\n\n‘ETH is dead.’\n\n‘ETH is broken.’\n\nDo you think this market gives a s**t about that? Human greed has no limits.”\n\nThe trader shares a chart comparing ETH’s current price pattern to a similar historic Bitcoin (BTC) price pattern, suggesting that ETH is about to go on a massive rally, flipping a key resistance level at around $2,400 into support.\n\nHe also predicts that Ethereum will soon soar out of a descending triangle against Bitcoin (ETH/BTC) and hit 0.069 BTC ($2,926) next month.\n\n“Do it.”\n\nETH/BTC is trading for 0.05251 BTC ($2,228) at time of writing.\n\nNext up, the trader gives a bullish outlook on ETH competitor Solana, sharing a chart where he predicts SOL will increase to about $500, a more than 350% increase from its current value, by early 2025.\n\nSolana is trading for $111 at time of writing, down 6.6% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxQMFlnb0JVZDl3Y2trNWZBWEdzUkNLV2MzcndXYktmSEJwT2ZWVWVkTlZ0aW1wbm1FckRNUkVWZnV6SUZWTHVaNVlpbmlTOHpUNWlrajZJcW9rSjFUX25DVmctS0VhY2dhVWxvN1NOQVhMbm05c3o1ak9PbXd3U2I4ME5iMTBqdUR4Q3JpUVBfZXl4UV81d2xuTjdCc21fRTBlQVU0OFZQckV1SzM4RWhXNGVDTkZkR0hWVW1BMWxWWVpZZXdrTkRsdkJ0WHpOYVJjYmt6YXB30gHbAUFVX3lxTE9uSUFod2xrNkhKWVhOVEFWaFY4WWFuYlZyd3lfYl9RaFZMbEYxeVdKUVlPaENseWZHc0NxbHdPeEphM1pNOU84SGJtSmR6cjBEQzJycE9NcFBhYm9taDFLZHVXdFEwYWx1bnZDamFGQjVOdXFBT2cyMzg2YmxjVGhvMmE0UVRmU0l1TG5mSTd2Z2JRVUZfY0NXdzVLVlpPbFZMNl9aWHpZQzc1SjBMbFoySGppd0pQaTN1elJmSVlqd2xJTFhhOC1pMW1BZzNieTk0NV9wSWNJYkctMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Layer-2 Crypto Project’s Token Soars Over 260% in a Week Amid Launch of a $425,000,000+ Ecosystem Fund - The Daily Hodl",
        "content": "The native token of a little-known Ethereum (ETH) scaling solution has soared by triple digits amid the announcement of an incentive program.\n\nEthereum layer-2 Metis (METIS) is up nearly 20% over the past 24 hours and up 261% in seven days from December 20th’s opening price of $25.67.\n\nMETIS is trading at $92.58 at time of writing.\n\nThe explosive rise in the token’s price comes a little over a week after the Metis crypto project announced the launch of the Metis Ecosystem Development Fund (Metis EDF).\n\n“The Metis Ecosystem Development Fund (Metis EDF) is a 4.6 million METIS fund dedicated to accelerating adoption in the Metis ecosystem. The Metis EDF will be used to fund grants for new project deployments, product development for existing DApps, Builder Mining rewards, sequencer mining, and more.”\n\nAt the current price of $92.58 per METIS the fund’s allocation is currently worth nearly $426 million. The Metis Ecosystem Development Fund is expected to commence disbursements in the first quarter of 2024 and the funds will be distributed over the course of a decade.\n\nThe lion’s share of the funding, 65.4%, will go to sequencer mining while 34.6% will be allocated to ecosystem funding. Sequencer mining is the process by which various parties stake their tokens to earn mining rewards while assisting in block production.\n\nAmong the potential beneficiaries of Metis EDF’s ecosystem funding include sectors such as decentralized finance, Real World Assets tokenization, decentralized identity and privacy solutions, blockchain gaming and metaverse applications and prediction markets.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxPcDJUa2k0SGtzZzJycWlLZmowdFVzY0tKUl9QbC1zMl94dDZUMTI4c3lLRF9FMjRCU2JfQW04ZncwQnBxMWFEcGI5akw1WjFpU3NyZXVNWmZnZmg4WmZ3MWcyN0lpNzRjZ3EtU29rSzY1VDAzSWdCTE0tSl9MUlJLTkprY1ZGSk9wM2ZyNjhkaEIyWU0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "Vitalik Buterin’s Three Solutions for Ethereum’s PoS - Crypto Times",
        "content": "The proof-of-stake consensus mechanism at the core of Ethereum, according to co-founder Vitalik Buterin, may face systemic complexity. To address this, he has three solutions.\n\n“A PoS simplification proposal: make a design that only requires 8192 signatures per slot (even with SSF), making the consensus implementation considerably simpler and lighter,” he wrote in a post on X.\n\nThe primary problem is that to keep the network functioning properly, validators that maintain it must create a large number of digital signatures using encryption.\n\nThe network already has a lot of work to handle from this, but as additional validators join, the number of signatures will rise, adding to the system’s workload. Subsequent updates are expected to raise the required signatures even more dramatically.\n\nOn December 27, Buterin wrote a post to the Ethereum Research forum outlining three approaches to avoid this. The shared goal is to reduce the number of signatures needed for each Ethereum blockchain space to 8,192.\n\nThe first solution is centered on decentralized staking pools. This would need raising the minimum amount of ether needed to run a validator to force people running validators to collaborate and pool their resources.\n\nVitalik’s second solution is to have two layers of stakeholders, one with stricter criteria and the other with more lax ones would be the second strategy. During the block finalization process, the two levels would be used in distinct ways.\n\nThe third option would be to have a rotating group of participants, in which case a different group of validators is chosen at random for each slot. Although Buterin pointed out that it would increase complexity, this would divide out the workload and lower the overall number of signatures."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMizgFBVV95cUxOWnZfc1JyV3B3RDRWbGZJajFGaW1CZE9xMjRhM21IbmR6UDlub1psODhycFNPU0Y4MFo1LTVFMzFhbHJEOXZLSm55Q0lyTkJkTDJwOFdBRnliVW9aaS1GT3YwTFJXMXVlX3B6MjI5YjRPbmRLeVhjTkhfWkRUSkF4TTBvZkZDbWcxaUZscGl4WlZGcXFqbC1DejRIZGFRbW8tdDhDTm9WZkJrTGJieWxQdzJfWkVObXRLb1RfT1l1YjFfTUxENVRGMGlsSHAtd9IB0wFBVV95cUxPNkVhWkItY1VyQUM1WWJWcGIxRE1IVFR4bzg0QXI3bXhLLVM0dlNlMldHWlQxUUZ1dlY0MWVlM0otTU4ydTd0R0x1YkNIb0FHYVhjM0dJaG03OHRlME9RclJ3YjY1bzhKRFFZUzJHRG95QVRDV1JZQTF1N3lFVXlhNEF3SHZsZ1NTQ2k5WGQ0akQwS0Nia09vLWxsaGFsUWxsd3daVjA3T2hpV05saEx0ZDhWUDBMNFhmRl9hUklqU3d3YS03bzIwX3V4TGNxcGNwaWlB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "New Whales Suddenly Accumulate Chainlink (LINK) and One Additional Ethereum-Based Altcoin: Lookonchain - The Daily Hodl",
        "content": "Deep-pocketed investors are suddenly scooping up massive amounts of Chainlink (LINK) and one other Ethereum (ETH)-based altcoin, according to on-chain data.\n\nThe blockchain data tracker Lookonchain noticed that newly created crypto whale wallets were accumulating two digital assets Wednesday using the top global crypto exchange Binance.\n\nOne crypto whale scooped up more than $4 million worth of decentralized finance (DeFi) protocol Maker (MKR), according to Lookonchain.\n\n“Fresh whale wallets are accumulating MKR and LINK today.\n\n0xE68E withdrew 3,150 MKR ($4.55M) from Binance [Wednesday].”\n\nMaker is trading for $1,489 at time of writing, up 4.8% in the last 24 hours.\n\nLookonchain says another whale is accumulating large amounts of decentralized oracle provider Chainlink, having loaded up more than $2 million worth of LINK Wednesday, on top of the nearly $5.8 million the whale bought 10 days prior.\n\n“0x8eAD withdrew 136,146 LINK($2.05M) from Binance [Wednesday] and has withdrawn 384,006 LINK ($5.79M) from Binance in the past 10 days.”\n\nChainlink is trading for $16.40 at time of writing, up 9.4% in the last 24 hours.\n\nLookonchain also noticed that one crypto whale made enormous profits trading decentralized finance (DeFi) lending protocol Aave (AAVE).\n\n“In 3.6 years, this early AAVE buyer turned $500,000 into $13 million, making $12.5M (25x)! He sold 30,000 AAVE($3.01M) via Cumberland to take profits [Tuesday] and has 100,000 AAVE($10M) left. He spent 500,000 USDC to buy 12.5M LEND at $0.04 on May 6, 2020 (migrated to 12,500 AAVE).”\n\nAave is trading for $109.50 at time of writing, up 6.6% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Tithi Luadthong"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxPSEhDSVJ3cWtYbGpEcS1NanMyWHZQelBNc1M5MXU4YWdtVWhWbldRZ1I4SWh6RC1PQk90YVI5NExfWkVSYzdwellTbDd3a280czJpZ21CZmFtWUstY3ZsLTdpZ00ydFYxeWhmcV9qQ1NmeWV5UXZjcEdhY2NwTTZ4TU10Q0c5Z2V0dTc3V2pOV1EtbS1wRTdLaGxwUXZRb0RrNlY4bzRNTnhXdW9MRUNodmlZT250a2hicG5fczN1RXp3bGRfTEhja1p6bk9NdUlSSVl4U25sTzDSAd4BQVVfeXFMTVhxWVFPd0h4WmxVNWFvdm5vNVQxUUJHU0F2TFM5LWMxTEtsQlJ4TzZ4RGdwaWJqWDBoYXNwYVcyTU0yLWJmMHlIa3d1WllzMGVVRW5FbFBpQndHSHJJWFBaYzRZRFJ2S1pXblhjVXdiWFBfRXlZR0NaUkxaT25qYXBrdURFY3NQRVZ4QWRmSHMtanE3aGRLOWh3ZmwwWmc5T001WXNBQjVkcHFVMV9iTDhaaWhsT0RrMFlzMnN6TlRCZnZvTVJvd3dTT1VPX0ozRXdmSmlJdE9ZTkJsVVNB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "Top Analyst Unveils Massive Price Target for Surging Ethereum Rival, Calls Altcoin This Cycle’s Darling Chain - The Daily Hodl",
        "content": "A trader who accurately called the bottom of Bitcoin’s (BTC) 2018 bear market thinks that the uptrend of one Ethereum (ETH) challenger that has massively outperformed the broader crypto markets this year is far from over.\n\nPseudonymous analyst Bluntz tells his 233,400 followers on the social media platform X that the people who are calling for the end of Solana’s (SOL) big rally this year will most likely miss out on the altcoin’s surge to a fresh all-time high (ATH).\n\nAccording to Bluntz, Solana has a lot more gas left in the tank as he predicts that SOL could still print gains of more than 257% from current levels.\n\n“SOL is still 113% away from ATH. Why is everyone so hell-bent on calling tops? What the f**k is wrong with y’all?\n\nJust buy dips all the way to $400.\n\nNot a single person is ever going to remember the guy who may or may not have been successful in shorting a 10% move down, but they will remember the chads who long all the way to inevitable all-time highs.\n\nDon’t overthink it, SOL is this cycle’s darling chain, embrace it.”\n\nAt time of writing, SOL is worth $112, up more than 1,000% from this year’s opening price of $9.99.\n\nLooking at the low time frame charts of Solana, the trader thinks that the altcoin is poised for another leg up against both the US dollar and Bitcoin (SOL/BTC).\n\n“Nice little 12% dip there on SOL in a monster uptrend with a few more legs to go in my opinion on the BTC pair and USD pair. Don’t fight the trend.”\n\nBluntz uses the Elliott Wave theory in his technical analysis in an attempt to predict future price action by following crowd psychology that tends to manifest in waves. According to the theory, a bullish asset witnesses a five-wave uptrend to be followed by an ABC correction before the next leg up.\n\nLooking at the analyst’s SOL/USD pair, he seems to suggest that the pair is in a position to rally once more after completing an ABC correction. For the SOL/BTC pair, he appears to predict that it could rise above 0.0034 BTC, worth $144.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE54ZXFPRGtMMFlBa2d3Z2xydVJsOUY4ZndiYlhXTG51UXo1aWNvTTd2bU1KLUhhX1RmT0dRSzRXSkJ6akZVaG14LURLd0EyNGxBZ3lxeVhUOHNRUm1ialdtSXJybVpJVFloOUVuX0NfdHdsa0NhbjlLTl9RZm0wa2M?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "Crypto: 'Solana Is Ethereum,' Says SOL Founder - Cointribune EN",
        "content": "Wed 27 Dec 2023 ▪ 3 min read ▪ by Ariela R.\n\nAnatoly Yakovenko, co-founder of SOL, highlights a new era of collaboration between Solana and Ethereum. According to him, Solana is Ethereum. This intriguing vision paves the way for crypto interoperability.\n\nSolana is ethereum! Solana is an ethereum L2 through the wormhole eigenlayer. Once danksharding is scaled up no one is going to stop you from submitting all the solana blocks into some data validating bridge contract on ethereum — toly 🇺🇸 (@aeyakovenko) December 26, 2023 Anatoly Yakovenko is convinced: Solana is Ethereum\n\n“Solana is Ethereum”: What Does the Founder of the SOL Blockchain Mean?\n\nCrypto analysts have always considered Solana as the “Ethereum Killer”. But recent statements by Yakovenko are changing the narrative.\n\nIn a recent post on his X account, Yakovenko is expanding the horizon of the crypto blockchain by suggesting that Solana can be more than a mere competitor to Ethereum. Specifically, the co-founder of the SOL crypto platform explores the notion of Solana as a layer 2 for Ethereum.\n\nIn his comments on platform X, Yakovenko explains that this symbiosis is possible through the “native wormhole layer.” Danksharding, Ethereum’s scalability upgrade, then becomes the key to this collaboration. It will improve scalability, thereby paving the way for unexpected cooperation between two crypto blockchain giants.\n\nDanksharding: The Path to Crypto Interoperability\n\nAccording to Yakovenko, Danksharding appears to be the key that unlocks the potential for interoperability between the two crypto platforms. He maintains that the extension of danksharding will facilitate the integration of SOL blocks within a validation relay contract on the Ethereum crypto blockchain. This underscores a collaborative approach to bridging protocol and consensus differences.\n\nThe different consensus mechanisms between Solana and Ethereum raise questions about the stability of this crypto alliance. Some users wonder about the possible reorganization of Solana as a layer 2 if Ethereum adopts a different approach. In this regard, Yakovenko assures that users can withdraw their crypto ETH tokens from the bridge. The agreement from both sides remains essential, however.\n\nHowever, he acknowledges that mutual agreement is necessary for seamless integration. He thus highlights the challenges that remain despite the innovative vision of crypto interoperability between Solana and Ethereum.\n\nYakovenko’s bold statement marks a turning point in Solana’s perception towards Ethereum. This exploration of crypto interoperability, fueled by Danksharding, promises a collaborative future in the complex universe of blockchain.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxOMUxkRUlUUmxsUWpISXdqc1dISl9GV0p6RUI2aU1iUmhKcGV6c2lWd2xiTDh4eUp5ZzBRcHJuU245QkRSNU5EZFh0ekFuc3lSRnJzelYxSjIwU283UkFNd3Yxc0tQZGpia3RybGdEMGhwMXE1a1dNMnN4SDlteE04RVNuMG00eGlKNDc5Nm1ieDVUYTcxelpfNi1WLXZnSXFKcVVvQ0o5MmxaZ0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Dec 2023 01:34:50 GMT",
        "title": "News Explorer — Donald Trump Has Sold Off $2.4 Million Worth of Ethereum - Decrypt",
        "content": "Dec 28, 12:53 am\n\nDecrypt\n\nDonald Trump Has Sold Off $2.4 Million Worth of Ethereum\n\nFormer President Donald Trump has been selling off his Ethereum (ETH) holdings, divesting 1,075 ETH for a total of $2.4 million. This comes after his unsuccessful attempts to revive his NFT trading card business. Trump still holds $2.2 million in various cryptocurrencies, including ETH, WETH, MAGA coin, Pepecoin, and JESUS."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPWTJaMlpjd0ttSGttYV9aXzVLSlh1YzVqVTR6enJiOTFaclo5ako3NzVJUWc3LTd1d2Vfb2RrbkdYNV9xRVZVY0xUMUZxcWYzY1o1dTJBQ2M0R2plZVF1ZmRUeWRtaWpHb1B4MGZUaDlKVm5kWEdWWlBOMUVDYXh4d1A0d2NlWlA5S29N0gGQAUFVX3lxTE1kOW1aUHZfbUJGaFV6TUc1cmgydFMxWHFyVUNDOGZQeTYyZTc0WW1YN19Da3NBeGoyazNNM214VFg3LV8wV0pSemYxUEJabHdDcExRUnRwN0hRM3p3Q01KS3dsQnZVWTRQVnpmU094TGZ0ODE2ME9NakZGTlROWDJTZnBHWHJ2bjlwS3NESW53eQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Price Exits Correction Trend With 6% Jump, Is $2600 Within Reach? - CoinGape",
        "content": "Despite the ongoing uncertainty in the crypto market, the second largest cryptocurrency Ethereum (ETH) has managed to sustain above the $2150 level. This level coincides closely with the 23.6% Fibonacci retracement level indicating the overall trend of this asset remains bullish. With an intraday gain of 5.3%, the ETH price has just offered a breakout above the resistance trendline which traced the correction trend indicating an early signal of uptrend continuation.\n\nAlso Read: Ethereum Ain’t Dead: Here’s Why Ethereum Can Outperform Bitcoin in Q1 2024\n\nadvertisement\n\nIs ETH Price Ready to Surpass $2500\n\nThe ETH price breakout from the overhead trendline should release the build-up momentum\n\nThe coin buyers may face potential supply pressure at $2400, followed by $2665\n\nThe intraday trading volume in Ether is $12.8 Billion, indicating a 30% gain.\n\nAfter witnessing steady growth from mid-October to early December, the Ethereum price shifted its projection sideways in line with the current market uncertainty. This last three weeks’ consolidation gives a view of price sustainability at higher levels and a short breather per buyers to recuperate the rest of the time.\n\nInterestingly, the ETH price was actively rebounding from two converging trendlines which acted as a dynamic resistance and support. Today, the Ethereum price witnessed a significant inflow, which led to a decisive breakout from the upper trendline in the 4-hour time frame chart.\n\nShould this candle close above the breached level, the buyers would obtain an early signal of uptrend continuation. With sustained buying the ETH price should surpass the last swing high resistance of $2400 to obtain a better confirmation and entry opportunity.\n\nAs per the Fibonacci extension tool, the post-correction rally can chase a potential target of $2665 aligned with the 0.618 FIB level\n\nKey Level to Watch\n\nWhile the current market outlook for Ethereum seems strongly bullish, the coin buyers may face renewed supply pressure at the $2400 mark. In case this resistance triggers another correction, the coin holders can rely on an ascending trendline that has been offering dynamic support to the ETH price for nearly two months. The coin price rebounded several times from the support project the buyers continued to accumulate at market dips, which is a strong signal of an established uptrend. On the contrary, a breakdown below this support would trigger a significant correction in ETH price\n\nBollinger Band: The flattish upper boundary of the Bollinger Band indicator offers an additional layer of resistance at $2400\n\nVortex Indicator: A bullish crossover between the VI+ and VI- slope signals a recovery trend in active.\n\nSahil Mahadik Sahil is a dedicated full-time trader with over three years of experience in the financial markets. Armed with a strong grasp of technical analysis, he keeps a vigilant eye on the daily price movements of top assets and indices. Drawn by his fascination with financial instruments, Sahil enthusiastically embraced the emerging realm of cryptocurrency, where he continues to explore opportunities driven by his passion for trading\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxQUmIteGlBTXhscXg0NFdJSmFENFJacVYxYnFUMnVZX1k5ckh2SWdrOWp6XzdlZFY4d2wxaUplNGhZaURDMjcxWElGWWN4WENLRTdUTkdPekl6cE5STnVKaE1EU1N3MkFTeG5IYnUzWHR5d2l4TEpXQWlIVjc1Zm9ZZlplRWFuZ9IBiwFBVV95cUxQS2RjX0Jnajk1US1CcGk0V3ZCdGMtUTlFNFhkVzlkUU9nM1VOZWxWcS1CVU5HaC1CazdSY25iaXdLT3BxaUtLYkctRjFzMnpPZWtHR1BTeVNMYkw2blNJVFBONG8zd053QmNqUUtwVEZHMFQxU0p4c0NMRnFDOFpRTzdzUkljSnI1VDc4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Dec 2023 08:00:00 GMT",
        "title": "New Ethereum (ETH), XRP and Solana (SOL) Pairs to Go Live on Binance - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nIn a bid to enhance the user trading experience and provide a wider array of choices, Binance has announced the launch of USDC-margined perpetual contracts for popular cryptocurrencies such as Ethereum (ETH), Solana (SOL) and XRP.\n\nAdvertisement\n\nThe introduction of these new trading pairs with up to 125 times leverage is set to go live on Jan. 3, 2024, at 12:30 p.m. (UTC). This move follows closely on the heels of Binance's recent addition of XRP and ADA trading pairs against USDC, showcasing the platform's strategic maneuvers and a notable return of the stablecoin to its ecosystem.\n\nTo celebrate the launch of USDC-margined futures contracts, Binance Futures is offering a 10% promotional trading fee discount on all trades within the specified period. The promotion period is from Jan. 3, 2024, at 12:30 p.m. (UTC) to April 3, 2024, at 12:30 p.m. (UTC).\n\nAdvertisement\n\nFor users opting to pay their trading fees with BNB on the Binance Futures platform, the 10% promotional trading fee discount for USDC-margined futures contracts will be an additional benefit on top of the existing 10% BNB fee discount. This double discount provides added value for BNB users, encouraging further engagement with the new trading pairs.\n\nBinance’s regulatory landscape and delisting decisions\n\nThe expansion of trading pairs and the reintroduction of USDC come at a time when Binance is navigating increased regulatory scrutiny.\n\nRecent delisting decisions, including spot trading pairs linked to the British Pound (GBP), such as ADA, BTC, DOGE and XRP, reflect Binance's efforts to streamline operations and comply with regulatory requirements.\n\nThe ongoing investigations by the U.S. Department of Justice (DOJ) and the SEC have created an atmosphere of uncertainty, prompting the exchange to make strategic decisions to ensure regulatory compliance. Traders and enthusiasts alike will be closely watching how these developments unfold in the coming months."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxNQldMQVNjS0dqbEZzV0Z3WVlHWVNFVkJzMEJVTVhVTEFNZ1NZeEhKRE5GWTZuQTNST3dVblo3WDFMdWhnSTFzWXFIdUc0NmlGY1lEdmVJWm1zU2xaSkRCcDdsQlU1UTRCdUFHV1dLSXhIMjdOQ2s3ZkFlWXlJYUIwM3RKMU5yLXRFd0ZGRkhzVmlVd3ZlZGNFemYtNFM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Dec 2023 08:00:00 GMT",
        "title": "L'innovazione di Ethereum: le migliorie alla proof of stake - The Cryptonomist",
        "content": "The world of cryptocurrencies is constantly evolving, with Ethereum (ETH) standing out as a pioneer in the field of proof of stake.\n\nRecently, ETH has recorded an increase of 6.77%, a positive signal for investors and industry enthusiasts.\n\nThis development can largely be attributed to the proposal by Vitalik Buterin, co-founder of Ethereum, to simplify the proof of stake (PoS) consensus mechanism of the platform.\n\nThe problem of complexity in Ethereum’s proof of stake\n\nThe heart of the matter lies in the intrinsic systemic complexity of Ethereum’s Proof of Stake (PoS) mechanism. Buterin has identified a critical node: the management of digital signatures. Validators, responsible for the network’s operation, must produce a high number of digital signatures.\n\nThis process, already burdensome, becomes even more burdensome with the increase of validators, leading to system overload.\n\nFuture implementations could even further intensify the signing requirements. The challenge is therefore not only to maintain, but also to optimize efficiency in a constantly growing ecosystem.\n\nAddressing this issue is crucial to ensure the long-term scalability and sustainability of Ethereum.\n\nThe solution proposed by Buterin aims to simplify the process without sacrificing the security and integrity of the network.\n\nButerin’s three proposals to simplify the process\n\nButerin outlined three possible solutions at the Ethereum research forum on December 27th. The common focus of the proposals is to reduce the number of signatures required per slot to 8,192 in the Ethereum blockchain.\n\nDecentralized staking pools: The first solution proposes the introduction of decentralized staking pools. This would involve increasing the minimum amount of ether required to run a validator, encouraging operators to collaborate and pool their resources. This approach could not only lighten the workload of individual validators but also promote an atmosphere of cooperation and mutualism within the Ethereum network. two levels of stakers: The second solution involves creating two levels of stakers: one with more demanding requirements and the other with lighter requirements. These two levels would be treated differently in the block finalization process. This structure could provide greater flexibility and accessibility for different types of participants in the network, balancing security and inclusivity. Rotating participants: Finally, the third proposal suggests the adoption of a system of rotating participants, where a random set of validators is selected for each slot. This system would distribute the workload and reduce the total number of signatures, but it would add complexity to the system. This method could improve fairness and decentralization, ensuring a more even distribution of responsibilities and rewards among participants.\n\nConclusion\n\nButerin’s proposal represents a significant step towards a more efficient and effective implementation of the PoS mechanism in Ethereum.\n\nBy reducing the complexity and workload of validators, Ethereum could achieve greater scalability and security. It is clear that the future of Ethereum, with its transition to the proof of stake model, still holds many innovations and potential improvements.\n\nIn addition, this evolution highlights Ethereum’s ongoing commitment to finding solutions that not only improve network performance, but also contribute to greater decentralization and democracy in the world of cryptocurrencies.\n\nButerin’s vision for a leaner and more robust system could prove crucial in the evolution of the cryptocurrency industry, marking an era of new possibilities and applications."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxNY2RuVjBzdktWcDhEazFhYVpyMHpCNjdfOXU4a1pGSkUwbkU4MEZDOXRoOHVzNEx2NXVKNjVHdlV2bUM4OFh5djF0V2RpM3VULWVhZ1dmajRyOW10TndoZ1FPV0M2aUxacjhaSTlVYTI3Qnd1WTl0aXZxM3pFdnFNR0xpaGNfcVZz0gGOAUFVX3lxTFBQNGZuUDJVbHQ3c3BEeng1bktEVnRkbDIxTDhEX19sbGJ6QzN6M0dZcERzRXViakV3dEY1VW8zb2xZX0RtemJMLTZSN0VnOXRzNVRCZkVJZWRvbkxZdUg1LWJhX1pCdjkycFA1d3p1UEE2MVg1eXdJLVoweU1nYm9nNWw3Nmt5Z3FMb0ZjbWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Dec 2023 08:00:00 GMT",
        "title": "Ethereum's Path to Efficiency: Vitalik Buterin's Proposal for a Lighter PoS System - Coinnounce",
        "content": "Innovative Steps Towards a Streamlined Ethereum\n\nEthereum's co-founder Vitalik Buterin has put forth a groundbreaking proposal aimed at enhancing the efficiency of the Ethereum blockchain. This proposal, which centers on making the proof-of-stake (PoS) consensus mechanism both simpler and lighter, could be a game-changer in blockchain technology.\n\nReducing the Burden: A Shift in Validator Signatures\n\nOn December 28, Buterin introduced a strategy to reduce the number of signatures required from validators. This reduction is expected to significantly lighten the load on the Ethereum network. The current system supports a vast number of validators — approximately 895,000 — in an effort to achieve decentralization and facilitate broader participation in staking.\n\nHowever, this high number of validators leads to considerable technical challenges. The network is tasked with processing around 28,000 signatures per slot, which Buterin describes as an excessively high load.\n\nAddressing Technical Challenges and Participation Issues\n\nButerin highlighted several compromises that come with supporting such a load, including limited quantum resistance, complex forking processes, and the need to scale signatures through sophisticated methods like zero-knowledge proofs (SNARKs). Moreover, the current system falls short of its goal to enable widespread participation due to the high minimum stake required to become a validator.\n\nProposing a Balanced Solution\n\nA PoS simplification proposal: make a design that only requires 8192 signatures per slot (even with SSF), making the consensus implementation considerably simpler and lighter.https://t.co/Z8mK7vZx7g — vitalik.eth (@VitalikButerin) December 27, 2023\n\nTo address these issues, Buterin suggests a moderate approach, reducing the number of signatures per slot to approximately 8,192 from the existing 28,000. This change would lead to significant technical simplifications, enhance quantum resistance, and maintain a high total of slashable ETH (1-2 million ETH). Slashable ETH is a critical mechanism for encouraging proper validator behavior.\n\nButerin proposed three potential methods to achieve this goal: fully decentralized staking pools, a two-tiered staking system with both 'heavy' and 'light' options, and a rotating participation model with accountable committees.\n\nAnticipating a Manageable Future Load\n\nThe primary benefit of Buterin's proposal is the establishment of a predictable and manageable future signature load. This foresight would greatly simplify protocol and infrastructure development. \"The future load of the Ethereum protocol becomes no longer an unknown,\" Buterin stated, adding that the signature load could be increased in the future through hard forks, but only when technological advancements can support a larger number of signatures-per-slot efficiently.\n\nButerin's Caution Against Overextension\n\nIn May, Buterin had cautioned against overstretching Ethereum's consensus mechanism beyond its primary functions of block validation and network security. This new proposal is in line with his vision of a streamlined, efficient blockchain that remains true to its core purposes."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxQMkZLMnByQkFnaGJ6Z0w2MVVIaDZTZUx1VGNhR2JyRE15MHozRWtXNVptWGZZcXRSQkk0UHJJOG1meHpLZ3ZkQlRUQ0pwX09KZjNCYVRRd3FLRnZEazZ5Snc0bk5iNjdCbUJNMzBoeWE2U3o1ZWhOUE9xZ0lzdTRNNzhaWWdQODduYXhSS9IBkgFBVV95cUxNamNNaVlZenlnSDRMSkNWeEJMeFRrU3l5OGg5WFQ0LWxwekVGT2k1aHE1MEc2SUpyZGUzUDV5ZnBkbzZ1M05rNlp6ZnUyczB5MWZ3TWx4aVRWYWJja2pLeDNId1dNZWZXT0cwaWlwVHhTcDF4dTBfZVVZZFBFYUgyaFAxR1FTWlNPV2F1elQxVWR3dw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Dec 2023 08:00:00 GMT",
        "title": "Vitalik Buterin Proposes Solutions for Ethereum PoS Complexity - CoinGape",
        "content": "Vitalik Buterin, Ethereum’s co-founder, recently outlined a trio of potential solutions to address a critical complexity issue in Ethereum’s proof-of-stake (PoS) consensus mechanism. His proposals, targeting the burgeoning challenge of managing digital signatures within the Ethereum network, were detailed in a post on the Ethereum Research forum. Buterin focuses on streamlining the process to require only 8,192 signatures per slot, simplifying and lightening the network’s load.\n\nVitalik Buterin Unveils Two-Tier Staking System Idea\n\nThe first approach Vitalik Buterin suggests involves the transformation of staking pools. By increasing the minimum ether required to run a validator, smaller validator operations would need to combine their resources. This consolidation aims to reduce the overall number of validators, thereby lessening the signature workload.\n\nadvertisement\n\nThis solution is about scaling down the number of participants and fostering a more collaborative and resource-shared environment within the Ethereum network. While compelling in its simplicity, this method raises questions about the impact on smaller validators and the potential centralization of power among larger staking pools.\n\nButerin’s second proposal introduces a two-tier staking system. This novel approach distinguishes between stakers with varying responsibilities and requirements. The two layers of stakers would be integrated differently in the block finalization process, with one layer shouldering heavier requirements and the other operating under lighter ones.\n\nThis bifurcation could create a more balanced system, where responsibilities and rewards are aligned with the capabilities and commitments of different stakers. However, this solution also introduces complexity in managing these two distinct groups and ensuring fair and effective participation from both.\n\nNew Ethereum Model Aims to Reduce Signatures\n\nThe final solution put forth by Buterin involves a rotating system of validators. In this model, a random set of validators would be selected for each slot, distributing the workload more evenly across the network. While this approach could effectively reduce the number of signatures needed, it introduces new complexities.\n\nThe random selection process must ensure fairness and transparency while maintaining network security and efficiency. This solution balances reducing the signature burden and maintaining a diverse and decentralized pool of validators.\n\nEach of these proposed solutions by Buterin comes with its advantages and challenges. The central theme in all three is the balancing act between reducing the signature workload and maintaining the decentralized ethos of the Ethereum network.\n\nRead Also: Ether Poised to Outshine Bitcoin in 2024, ETC Group Report Predicts\n\nMaxwell Mutuma Maxwell is a crypto-economic analyst and Blockchain enthusiast, passionate about helping people understand the potential of decentralized technology. I write extensively on topics such as blockchain, cryptocurrency, tokens, and more for many publications. My goal is to spread knowledge about this revolutionary technology and its implications for economic freedom and social good.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMibkFVX3lxTFBrcWZKS1M5MHhTRFd6WFdzNTFoaW9TVTlCWEYyWnhsaWFlZWl5NWQzbGpPUHFtN3NxYmZCSWZSa2NVRXZQeGlhckdEUDdxVU85SDgwb2FlTGIxTF8xZmI3dXI3dnVmQnFHR3JRV1R30gFzQVVfeXFMTnV3RV8yMkNsRU5QdkMwcUhGR1pZZl84elJKMVNsbU9ySUVDV1h3TmNTSkY5QnFYNDF4SU5jY0dqMWNBWFdRblQ1Y3BuMmhCTXdySFVZbU81SWp6MXdyUGZUOGJ1enlnbk5mVmlOR0k2cVNDMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Founder Vitalik Buterin Shares Thoughts On The Current State Of Web3 | Bitcoinist.com - Bitcoinist",
        "content": "In a recent blog post titled “Make Ethereum Cypherpunk Again” the founder of Ethereum, Vitalik Buterin has expressed his thoughts on the current state of the Web3 ecosystem.\n\nEthereum Founder Voices Concerns Over Faded Web3 Vision\n\nIn a blog post published on December 28, Ethereum Founder, Vitalik Buterin reflected on his past experiences from a decade ago where he witnessed Bitcoin’s steady adoption and integration into daily life activities. In this reflection, Buterin highlighted the transformative vision he visualizes of the Web3 ecosystem.\n\n“The reason why I bring these memories up is that they remind me of a deeper vision underlying crypto: we are not here to just create isolated tools and games, but rather build holistically toward a more free and open society and economy, where the different parts – technological, social and economic – fit into each other,” Buterin wrote in the blog post.\n\nWhile maintaining a positive perspective of the Web3 ecosystem, Buterin acknowledged that the vision for the Web3 space has become somewhat diminished. He noted that the vision had begun fading into the background since 2017.\n\nThe Ethereum founder highlighted several reasons for his statement, with the foremost factor being the rise of transaction fees, which he identified as the number one culprit for the fading Web3 vision.\n\nButerin explained that when the cost of writing to the chain was $0.001 or $0.1, many individuals would actively engage with blockchains. However, as transaction fees rise to $100, a specific audience, the degen gamblers remain willing to pay the substantial cost.\n\nButerin pointed out that when degen gamblers become the predominant users of the chain, it alters the perception of the public and adversely affects the internal culture of the crypto space.\n\nHe also revealed that “there is a large ideological rift where significant parts of the non-blockchain decentralization community see the crypto world as a distraction, and not as a kindred spirit and a powerful ally. In many countries, people do use cryptocurrency to send and save money, but they often do this through centralized means.”\n\nETH price at $2,372 | Source: ETHUSD on Tradingview.com\n\nCypherpunk Future Achievable Amid 2023 Development\n\nIn his blog post, Buterin highlighted several positive developments made in 2023 that could facilitate the development of a cypherpunk future for the Web3 space.\n\nSome of these developments include the existence of Blockchain Rollups which are special Layer-2 blockchains that process transactions off-chain. Buterin also noted the expansion of second-generation privacy solutions like Railway and Nocturne, alongside advancements in Zero Knowledge Proofs, a powerful tool used for enhancing privacy and security.\n\nConcluding his list of positive developments within the Web3 space in 2023, Buterin affirmed that these changes would create a great opportunity for the Ethereum blockchain.\n\nHe stated that the developments would “make at least a part of the Ethereum ecosystem actually be the permissionless, decentralized, censorship-resistant, open source ecosystem that we originally came to build.”\n\nFeatured image from Analytics Insight, chart from Tradingview.com"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxNN0lzQ0NYaktEc2tlVVVOVlE5c01WRll3THV0a0JTMmh6U2ZYQmZDMUhNLWlKbFVOYW9vTmVDcHRCN3AtMk1nQkNCZllWVktzQlo0NWhtUGZ6V3E0bVdub0tlMlpSV3A5amtTS2hhTHZxMUl1VmpQZm94SjlGbXd5d2JMVQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 17:20:50 GMT",
        "title": "An Introduction to Blockchain Networks Like Solana - Innovation & Tech Today",
        "content": "Have you heard of Solana? When it comes to the blockchain market, it might be the case that you’ve only ever heard of Ethereum, but we posit that there is a dark horse in Solana. So, why is Solana going up? What does this mean for investors?\n\nWhat Is Blockchain?\n\nHowever, before we can understand Solana, we need to understand blockchain. Tech experts talk about “the” blockchain as though there is only one, the way we have “the” internet, but this isn’t the case. While Bitcoin was the first major blockchain developed, many other public and private blockchain networks exist today with different designs, features, and use cases. These include Ethereum, the most commonly used market leader, Polkadot, Cardano, and Solana.\n\nA blockchain is essentially a database. It is distributed across a network of computers instead of a single location and is, importantly, decentralized due to this nature. A blockchain is a data structure block holding key transaction details, like date, time, and amount. Every time you make a transaction, you’re making up a block that will add to the chain, with each new block\n\nTrending Lux Algo Offers a Lifeline as Beginner Crypto Investors Struggle\n\nreferring back to previous blocks in a way that creates a secure, immutable data record.\n\nThis decentralized, transparent, and automated system enables security, accuracy, and permanence in recording everything from financial transactions to asset ledgers, credentials, records, and contracts in an open and trusted manner. It has disruptive potential across finance, supply chain, and healthcare industries.\n\nWhat Is Solana?\n\nAs we mentioned, Solana is one such blockchain, and its position in cryptocurrency right now puts it in direct competition with the market leader: Ethereum. However, it has a lot of benefits over Ethereum and is therefore fighting for space in the market as a superior product. Ethereum has reason to worry- it has seen tremendous growth in 2022, even amidst the crypto winter, appreciating over 85% year-to-date while most other cryptos declined. Additionally, it’s in the top three most actively developed blockchain networks alongside Ethereum and Polkadot based on activity metrics. Over 400 projects have launched on Solana across DeFi, NFTs, and Web3 spaces. Areas like DeFi show dominance with over $1.2 billion total value locked.\n\nSolana shows strong usage and developer momentum, pointing to a promising spot staking its claim among the future internet of blockchains. It is a highly scalable, open-source blockchain network that utilizes innovative technologies to achieve high throughput and low costs without sacrificing decentralization.\n\nWhat Are the Benefits of Solana?\n\nSo, what makes Solana such a dark horse in the fintech industry? Solana is credited with being the core innovation for the “proof of history” method, which is a sequencing technique that cryptographically verifies the passage of time between events, greatly boosting efficiency. For comparison, Ethereum recently moved to Proof of Stake, which uses significantly less energy, allowing Solana to reach 50,000 transactions per second, orders of magnitude higher than networks like Bitcoin and Ethereum, and therefore costs, run well below $0.01 per transaction.\n\nThis speed is Solana’s best calling card. For users, Solana promises to enable fast, inexpensive decentralized applications – everything from DeFi to NFTs to Web3 networks built to scale to millions. It is also easy to build on, with familiar coding languages and SDK availability leading to rapid application development.\n\nAdditionally, Solana utilizes a sturdy underlying Proof of Stake consensus and communication architecture that brings resilient decentralized security to high throughput environments.\n\nWhat Are the Key Innovations of Solana?\n\nAnother innovation of Solana is the Gulf Stream protocol, an innovative networking architecture Solana uses to enable massive transaction throughput. Before they are confirmed by validators and established early transaction orders, it enables the forwarding of transactions from node to node across Solana’s network. This is important because typical blockchains flood the network with unconfirmed transaction data, causing bottlenecks, whereas Gulf Stream prevents network overload.\n\nWhat Does the Impact of Solana Mean for Investors?\n\nThe profile and adoption of Solana have been rising exponentially recently. As more decentralized apps choose to be built on Solana, investment in the ecosystem could ride a wave of growth.\n\nBecause Solana enables fast and scalable blockchain in areas like DeFi, NFTs, Web3 networks, and gaming, it offers cheap fees and extra speed. This makes these new apps much more viable at scale than on other chains like Ethereum, which brands and businesses around the world are likely to be interested in.\n\nIncreased real-world usage and speculative mania have led to massive price appreciation for Solana’s cryptocurrency SOL, from under $2 in 2020 to over $200 by November 2021. With faster transaction finality, higher throughput, and cheaper gas, Solana is facilitating more disruptive and user-friendly decentralized network models. This brings new early-stage investment opportunities.\n\nWhat Is Solana’s Current Competitor?\n\nEthereum’s position as a competitor to Solana is as yet unchallenged. It is the market leader and, therefore, has a first-mover advantage and an enormous lead on developer ecosystem size and usage compared to Solana or any other layer 1 blockchain. For example, over 3,400 decentralized apps run on Ethereum today.\n\nHowever, where Ethereum struggles with network congestion and high gas fees, Solana touts faster speeds, higher throughput capability, and significantly cheaper transactions – positioning itself as an “Ethereum Killer.”"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxOaGs4RUU4Ry10NlhKdnYxMDhld2szRmpCWURTRVN5ZDdqbUJrNlpGa0c1ckRtNGF0bVE2MThDd1g3OGNhd0JPTmtZSHhNU2VuZExoWldmaWdHWTBnREFNSHo0bnc0N1Z3eEFsbUx6bDJOQ3FoVklhYVJKcWhxeXJpbzNsWjQ4OWllWXFDTGZn0gGTAUFVX3lxTE1mY3RKXzhRcTN1RFlrU1I4LV8xZnZ3TkxnUkh0YUQ4VWtDdTVUMWx3MlE5T3lwZGVJUlNoWXNpUlhqc25ZTUpvREhuM3lEZ3NoNzFMVGdueVpCbVkwNjgyU0hhWnlsVGRteWxtTWpFdEMzcnNTcFJBWFFJQUxhZUd3a1UtUVcybVE4RU85NHZQTk5tWQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Dec 2023 08:00:00 GMT",
        "title": "Solana Now an “Ethereum L2 With Wormhole Eigenlayer” – Founder Says - CoinGape",
        "content": "Solana (SOL) co-founder, Anatoly Yakovenko blew up Crypto X with a recent admission when he noted that the protocol is now already an “Ethereum L2 with the Wormhole Eigenlayer.”\n\nLightning the Solana versus Ethereum Rivalry\n\nThough the shared X post from Anatoly Yakovenko is a technology-based communication, it has a major but subtle aim to lighten the ongoing rivalry between Solana and its bigger rival, Ethereum (ETH).\n\nadvertisement\n\nAccording to the Solana co-founder, a major overlap exists between some of the validators operating decentralized applications that exist as a connecting bridge between both protocols.\n\n“There is a huge overlap between solana validators and Lido eth L1 operators and wormhole operators. They are all effectively under heavy “re-staking” incentives not to withhold data or mess with the state root between the chains,” his post reads.\n\nWhile Yakovenko’s initial post on the subject was shared on December 25, media reports failed to see the initial ironic intention behind the post. By all means, Solana is bigger as a protocol when compared to the next capitalized Ethereum L2, Polygon and it has a thriving ecosystem that will undoubtedly prevent it from staying under the shadows of Ethereum.\n\nOver the past few months, there have been a lot of controversial community talks between members of the Solana and Ethereum communities in which some of the former try to elevate their technologies over the latter. This narrative was deepened as Solana started flipping Ethereum in key performance metrics.\n\nYakovenko has time and again tried to caution the community against such narratives and this latest post might be another way to show both can co-exist.\n\nEqual Ecosystem Criticism\n\nWithin the space of 2 weeks, the duo of Ethereum and Solana have faced intense criticism from some market analysts who took out time to highlight the flaws of both protocols.\n\nPeter Brandt recently took on Ethereum, noting that he has shorted the coin as he believes it is on its way to a low of $650. He based his bearish assumptions on the fact that Ethereum is unfriendly to use as a result of expensive network or gas fees. Solana on the other hand got its first major critic in Fred Krueger who said many of the innovations being pushed out by the protocol are “pure science fiction.”\n\nWhile neither of the blockchain protocols is perfect, Yakovenko’s post is an indication that both can truly exist together with more benefit to the broader crypto ecosystem.\n\nGodfrey Benjamin Linkedin Benjamin Godfrey is a blockchain enthusiast and journalists who relish writing about the real life applications of blockchain technology and innovations to drive general acceptance and worldwide integration of the emerging technology. His desires to educate people about cryptocurrencies inspires his contributions to renowned blockchain based media and sites. Benjamin Godfrey is a lover of sports and agriculture. Follow him on Twitter\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxNam5TXzAwUG1zbjRSeXF2SkpmU3FsUzlFS0dyQ3p3TUFOZHRwa1lNaFhydkp1b1h3c1NkU2RmNm9tU1lpYTdqaENfU05DckNjaWp3aUgxVFEydXlTTTVIS1hkYm1WbGFodVo1Q0dOT1d1czhVQk9NX2xKUXkwVmhmTU9zOXdybXRfdHVMVGlmdU1wUVNFQUdQX0VIdWxVWTVVNHJ6dWlZVkhDa3A4MDNwZURfSURJcHU3TVlySS1UVWd4UXF4aEtsVnJMNVY?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "Airdrop hunters plough $345m into fledgling blockchain to get new token - DLNews",
        "content": "Manta Pacific's TVL spiked 1,250% in December.\n\nIt is now the seventh biggest layer 2 blockchain network on Ethereum.\n\nOther layer 2s are also ratcheting up airdrops.\n\nCrypto airdrop hunters have deposited $345 million into Manta Pacific, Manta Network’s Ethereum layer 2 blockchain, since December 14.\n\nWhy the sudden interest?\n\nBecause of an airdrop expected in early 2024.\n\nAirdrop hunters have deposited Ether and stablecoins into the blockchain to obtain rewards scheduled for distribution in January.\n\nManta Pacific’s TVL has skyrocketed 1,250% in December. This spike has made Manta Pacific the seventh largest Ethereum layer 2 blockchain per total value locked, according to data from Ethereum layer 2 tracking portal L2Beat.\n\nTVL is a metric that tracks how much crypto is locked up in a DeFi protocol’s smart contracts, or in all DeFi protocols running on a given blockchain.\n\nPromising signs\n\nFor Kenny Li, co-founder of blockchain developer p0x Labs and Manta Network contributor, the TVL growth is encouraging.\n\n“These early promising signs mean that a new contender is emerging from DeFi to challenge the likes of zkSync and Base,” Li told DL News.\n\nJoin the community to get our latest stories and updates\n\nBase and zkSync are also Ethereum layer 2 blockchains.\n\nSmart contracts\n\nThe smart contract that holds these deposits is not verified on Ethereum blockchain explorer Etherscan, so it’s difficult for independent security experts to determine its safety.\n\nManta’s team says the contract has been reviewed by security experts.\n\n“The contracts have been audited by Veridise,” Li said.\n\n“At the moment, the audit is unverified on Etherscan as the contract is not open-sourced but we plan on having these verified in the future.”\n\nFor risk-tolerant crypto degens, the unverified contract has not proved to be an issue as they’ve run up nine-figure dollar deposits.\n\nInvestors were driven to deposit these funds as part of Manta’s New Paradigm campaign.\n\nIt promises five layers of rewards for early investors, including an airdrop of 50 million Manta tokens. Manta isn’t trading yet, so those 50 million tokens do not yet have market value.\n\nGetting a STONE token\n\nThis TVL growth is most likely driven by the promised airdrop because the project’s canonical bridge has attracted only $28 million in deposits since its creation three months ago.\n\nManta airdrop hopefuls receive a token called STONE in exchange for their locked Ether deposits in the blockchain.\n\nSTONE is a so-called yield-bearing token, according to Manta’s documentation. Airdrop hunters will be able to redeem STONE for Manta tokens in January.\n\nAs a yield-bearing token, airdrop hunters can use STONE to earn points on protocols within Manta Pacific that support the token. By doing so, investors can farm more STONE tokens and potentially increase their promised Manta token airdrop.\n\nDepositors also earn NFTs, which can be sold on Element, a multichain NFT marketplace.\n\nParticipants are also hunting for NFT combinations that will yield even bigger airdrop rewards, a process that requires them to acquire six different NFTs from the campaign that can be combined to get a premium NFT that offers greater rewards.\n\n$1 billion in investments\n\nManta is only the latest in a growing trend of projects enticing significant early backing with the promise of rewards early next year.\n\nBlast, a planned Ethereum layer 2 blockchain project, managed to attract about $650 million in barely a week after it was announced in November. The project now sits on top of over $1 billion in investments.\n\nLike Blast, Manta Pacific is also invite-only with prospective new entrants requiring invite codes from existing investors.\n\nManta Network did not immediately return requests for comment.\n\nThis article has been updated to include comments from Manta Network core contributor Kenny Li.\n\nOsato Avan-Nomayo is our Nigeria-based DeFi correspondent. He covers DeFi and tech. To share tips or information about stories, please contact him at osato@dlnews.com."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxQMUdpU09Va01FUmVsU3prOHl5Zks3eHFldnBLSENFeFFGNllZZUpLSzI4NzJBX3dqSHE0OU5jZUhsSDJKWE5qQ0QzNUhIUllmV2VqMkE3VktKM2lhM0t2ZUFrWWpNMXFjM1VTRzdHUElzYjhTMWxOeXhjY1l0THRVaTA4NA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Dec 2023 08:00:00 GMT",
        "title": "Trump-related crypto wallet cashed out $2.4m worth of ETH - crypto.news",
        "content": "According to on-chain data, a crypto wallet associated with the former U.S. president has transferred millions of dollars worth of Ethereum to Coinbase.\n\nAn Ethereum wallet, which has been accumulating royalties from Donald Trump‘s NFT collection for months, has started moving the funds to the centralized crypto exchange. According to Arkham Intelligence, the wallet has transferred 1,075 ETH (around $2.4 million at the time of the transaction) to Coinbase.\n\nLooks like Donald Trump is selling his ETH.\n\n\n\n3 weeks ago he started sending ETH to Coinbase after months of accumulating Trump NFT royalties. His peak balance was $4 million.\n\n\n\nBased on the deposits, so far he's sold 1,075 ETH for $2.4 million. pic.twitter.com/JZzA3cS2je — Arkham (@ArkhamIntel) December 27, 2023\n\nWhile the purpose behind transferring the funds to Coinbase remains unclear, data suggests that the Trump-associated wallet still holds multiple cryptocurrencies valued at over $2.2 million.\n\nYou might also like: Donald Trump is accused of using copyrighted images for his NFTs\n\nAccording to the wallet’s data, the majority of the funds are allocated in ETH (approximately $1.4 million), followed by WETH (almost $650,000) and the TRUMP token (around $177,000). The wallet, at its peak, held approximately $4 million worth of a diverse range of cryptocurrencies, as indicated by the data.\n\nTrump-related crypto wallet | Source: Arkham Intelligence\n\nThis transfer coincides with the unveiling of a new NFT collection titled the “Mugshot Edition,” a nod to the recent legal challenges faced by the Republican politician.\n\nAs reported by crypto.news, in mid-December, Trump took to his social network Truth Social to announce the release of new non-fungible tokens featuring an infamous mug shot captured after the former President’s booking in an Atlanta-area jail last August on charges related to the alleged conspiracy to overturn Georgia’s election results."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiYkFVX3lxTE91MGdsaTdkeGkwR0tDSktIQk52Q3hpa2FWMzZjczlodWhDVE1Sc0YwMjBIUV9GX1JoaUcycHRYamR0NHNRTl9mNV9oaXk5LS1qbldIWnpjc2dQQzI0SzJ1U19R0gFnQVVfeXFMTzVEbXdSLXl6bHpMdlRQa0Rwajl2VzB4WkQzN2thNnd4TzQ4bnJsU1daU2c2a3hfS2R6ZEFDQl9OVDFRZGlOM1lXMV9fTTUtdjNEMGF6OTY5UkFLcS1BQkUwSXlGbUxIOA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Dec 2023 08:00:00 GMT",
        "title": "Crypto Analyst Predicts Big Moves For Shiba Inu And PEPE, Here’s The Trigger | Bitcoinist.com - Bitcoinist",
        "content": "The prices of Shiba Inu and PEPE, although there has been movement in both of these assets, have not performed as well as expected. This could be attributed to the muted performance that Ethereum, the parent network of both assets, have put on recently, and thus, they have followed in its footsteps. However, as Ethereum begins to see better upside, things could change for both of these assets according to one analyst.\n\nWatch Out For Shiba Inu As Ethereum Begins To Break Out\n\nEthereum has started moving up again and is currently trading above $2,400 at the time of this writing. Naturally, crypto investors expect its ecosystem tokens to follow the same path, and one of those is Shiba Inu, as pseudonymous crypto analyst Crypto Kaleo explains.\n\nTaking to X (formerly Twitter), the analyst shares their expectations for the Shiba Inu price going forward. Crypto Kaleo warns investors to keep an eye out for the Shiba Inu price especially as Ethereum begins another uptrend.\n\nThe crypto analyst expects good movement in price, possibly something that could rival its 2021 movement. Kaleo points out that the SHIB price is currently still trading in a base range of $0.00001, and this is a level that the price has maintained for almost one week now.\n\nGiven that the crypto’s price has stayed in this range for so long, Kaleo expects a good thing if the price is able to break out of this range. “Wouldn’t be surprised if we see another god candle similar to October ’21 when it finally breaks out of this base range,” Kaleo said.\n\nAlso a reminder to not sleep on $SHIB as $ETH starts to break out. Wouldn’t be surprised if we see another god candle similar to October ’21 when it finally breaks out of this base range. pic.twitter.com/jRYYW6gcjq — K A L E O (@CryptoKaleo) December 28, 2023\n\nSHIB price above $0.00001 | Source: SHIBUSD on Tradingview.com\n\nPEPE Expected To Follow The Same Path\n\nAs the Ethereum price recovers, Shiba Inu is not the only cryptocurrency that is expected to do well. Another coin that the crypto analyst points out is poised for good things during this time as well is the PEPE meme coin.\n\nPEPE has also been on a rather slow path over the last few months despite the fact that the Bitcoin price has been going up. There have been more dips than pumps, but Kaleo expects that this could change quickly as the pump commences.\n\nKaleo compared the expected movement to what happened with Solana (SOL) and BONK. The BONK price had risen drastically as the SOL price pumped. In the same vein, the crypto analyst expects the meme coin to reach a new all-time high as the Ethereum price begins to move as well.\n\n“It’ll be one of the most obvious hindsight trades out there when it happens,” Kaleo explains.\n\nThe same way $BONK printed new ATHs vs $SOL when it broke out, I see $PEPE printing new ATHs vs $ETH as it starts to move. It’ll be one of the most obvious hindsight trades out there when it happens. pic.twitter.com/cvSPd9bxSt — K A L E O (@CryptoKaleo) December 27, 2023\n\nFeatured image from CoinMarketCap, chart from Tradingview.com"
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxQZ0hvZGRhUlZjVVlaMklxUU1LV19lZExGQU0wMU1rQURDU0VKMmdzWTUyS0hLYllWOXlhNUEtZzZacGRyd0RJWHNPc2tKUnJzY3ZPNW5oa3BvODZ3bk91T01Ka0RNTUVoNkpGT1E0aFhjcGNxMTEyZ3JpTExOWl9KQkRNOFFRRmd3ampGZl9Ib2JMVHl1anhVNXJSWW1rS2VzR3Fha25mMzVrNVFiUnpBeWx2bzBnUdIBuwFBVV95cUxQeVV5WUgzVGx1eFV0dV9WeDE2U0JsZDI2cVRHZXVfWU0xSFVkZHMyOW50S3ZZUlhROUE0WEg3eE52ZjRJeWxBdkN4N285eDdmNDdhQjFld2JZZnNZUHRVdmZDblBXblVLSVBGWUIzTXI2cEN5Vzd5M1BPNGdNczVEYk8ybkpfX3pxVFBjZXNTZFAwS1lKZExKVy1MbXFGbkJ5UzlRSld0dXdoZll2QnJCalJ3RHNuYzZPMF9v?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Dec 2023 08:00:00 GMT",
        "title": "Crypto prices today 28 Dec 2023: Bitcoin surges above $43K mark, Ethereum up by 7.33% - Web3Cafe",
        "content": "On Thursday, Bitcoin, the largest crypto across the world, witnessed a growth of 1.98 percent over the last 24 hours. Its value reached $43,190.08, at the time of writing this article (1100 IST). Even the top altcoins registered an increase in their value. Ethereum gained by 7.33 percent and is trading at $2,384.82 over the previous day. Cardano, XRP, and BNB grew by 9.35 percent, 4.67 percent, and 11.36 percent, respectively.\n\nadvertisement\n\nContrastingly, Solana lost by 4.94 percent, and Avalanche was down by 4.01 percent since the previous day.\n\nOn 28 December, the global crypto market cap stood at $1.7 trillion, rising by 3.40 percent, while the total crypto market volume plunged by 1.80 percent to $80.53 billion.\n\nAt present, Bitcoin’s dominance is at 49.9 percent, while that of Ethereum is at 16.9 percent.\n\nGainers and losers\n\nToday's top gainer was Bitcoin SV, which grew by 51.44 percent since the last day. It was followed by Aave, Arbitrum, XDC Network, and Lido DAO, among others.\n\nOn the other hand, Bonk was the top decliner of the day, recording a fall of 10.42 percent in its prices. Further, Stacks, Mina, Sei etc. were in the red zone.\n\nadvertisement\n\nMemecoins in the green\n\nToday, most of the popular memecoins displayed upward trajectory. Elon Musk’s favourite Dogecoin rose by 3.77 percent. Shiba Inu, Pepe, Floki, Memecoin, and Bone ShibaSwap also rose by 3.97 percent, 9.92 percent, 10.03 percent, 3.27 percent, and 4.29 percent, respectively. Other memecoins also saw the growth.\n\nMetaverse tokens trade mix\n\nMost of the top Metaverse tokens witnessed a mixed trend in their value. Internet Computer, Theta Network, Decentraland, ApeCoin and WEMIX increased by 11.56 percent, 1.33 percent, 1.29 percent, 4.89 percent and 3.71 percent, respectively. Contrastingly, Stacks decreased by 8.05 percent and Render lost by 1.59 percent."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE9SREpncTdGSW04eHNlZW5GY3pqNHc3ZVB5VmdCcG1RMmttdklmU2JiYzZJaUlJRzBCdXY1Mzh1OUtpdGVTT01vQWdMZ0dsNDF5MV92QlJIdllNWVNIZmlWcFVVUkR6RDRHUV8wQ0V0alE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Dec 2023 08:00:00 GMT",
        "title": "StarkNet Crypto Airdrop: How to be eligible for STRK Airdrop? - CryptoTicker.io - Bitcoin Price, Ethereum Price & Crypto News",
        "content": "If you’re into airdrops, Starknet is a must-check for one of the most promising airdrops in 2023. Its parent company, StarkWare, has received a whopping $273 million in funding and is currently valued at $8 billion. This season seems to be full of crypto airdrops. We have already published two potential airdrops: Scroll Name Service (SNS) and DeBank\n\nStarknet is now live on its Mainnet, and the tasks for the airdrop are pretty straightforward. You can complete them in just about 20 minutes, depending on how quickly you move. So, let’s take a look at this StarkNet airdrop article in more detail.\n\nStarkNet stands out as a Layer 2 network developed by StarkWare to enhance the scalability of the Ethereum network through Validity Rollups (or Zk Rollups). As highlighted on its website, StarkNet empowers decentralized applications (dapps) to attain unlimited scalability for both transactions and computation, all while benefiting from the robust security features of the Ethereum blockchain.\n\nA key component of their offering is StarkEx, which has gained substantial social validation, as evidenced by its impressive clientele. The permissioned solution serves as the hosting platform for notable clients such as ImmutableX, dYdX, Sorare, ApeX, and Immutable, showcasing the widespread adoption and trust within the industry.\n\nWhat is $STRK Token?\n\nThe deployment of the StarkNet token ($STRK) took place on the Ethereum mainnet on November 16, 2022. Despite being deployed, the tokens are not currently available for sale. Notably, the StarkWare team has maintained a high level of transparency regarding the launch, distribution, and allocation plan of the token.\n\nThis information is derived from a blog post on the Medium platform authored by StarkWare, where they detail their approach and plans for the StarkNet token.\n\nHas the $STRK Airdrop Been Confirmed?\n\nOn December 8, 2023, Starknet officially announced a 1.8 billion $STRK token airdrop. Despite the confirmation, there is no specified timeline provided. While there’s still an opportunity to participate in the Starknet airdrop, it remains uncertain whether the snapshot has already been taken. Although there might be a risk of it being too late, akin to Solana airdrops, you can explore the possibility of participating in airdrops offered by popular Starknet decentralized applications (dApps).\n\nHow to be eligible for Starknet Airdrop?\n\nStarknet is currently operating on its mainnet, providing numerous opportunities to engage with applications that may make you eligible for an airdrop. The process involves bridging funds and engaging with well-known Starknet decentralized applications (dApps), such as decentralized exchanges (DEXs) and NFT marketplaces. It’s a straightforward process, and here are what I consider the most beneficial tasks for maximizing your chances in this potential airdrop:\n\nCreate a MetaMask Wallet\n\nFor this guide, we’ll require two wallets, beginning with MetaMask. If you haven’t installed it yet, visit the Metamask website to create your wallet. Then, add some Ethereum to it.\n\nCreate a Starknet Wallet\n\nStarknet does not operate on the Ethereum Virtual Machine (EVM), so using MetaMask, which is designed for the EVM, is not suitable for most Starknet applications. To interact effectively, you’ll need a specialized Starknet wallet. The top two options for this purpose are Argent and Braavos.\n\nVisit https://www.argent.xyz/argent-x/ or https://braavos.app/\n\nSet up your wallet on the same browser/device as your MetaMask\n\nBridge ETH to Starknet\n\nBridging to Starknet: Exploring the Pathways\n\nDifferent Bridges for Starknet:\n\nStarkgate Bridge\n\nOrbiter Finance Bridge\n\nLayerSwap\n\nNow it’s time to transfer some ETH to Starknet using the native bridge, StarkGate. Follow these steps:\n\n1. Visit https://starkgate.starknet.io\n\n2. Connect both your MetaMask and Starknet Wallet.\n\n3. Initiate the process to bridge ETH to StarkGate. Ensure you send enough ETH to cover the gas fees. Transaction costs on Starknet typically range from $0.50 to $3.00.\n\n4. You have the option to bridge ETH directly from the Ethereum Mainnet. Alternatively, if you want to minimize gas fees, you can also bridge the ETH mentioned with the help of the above-mentioned bridges.\n\nUtilize the foremost decentralized exchanges (DEXs) on Starknet\n\nNow that we have money on Starknet, let’s use some popular apps. Decentralized exchanges are an easy way to do things on the blockchain, and that’s what we’re aiming for to get airdrops. According to DeFi Llama, here are the biggest decentralized exchanges on Starknet:\n\nEkubo\n\nMySwap\n\nJediswap\n\n10kswap\n\nHead to these decentralized exchanges (DEXs), connect your wallet, and exchange tokens on each platform. You have the flexibility to swap any token and any amount, as many times as you like. Additionally, consider adding liquidity to the pools and withdrawing it.\n\nBy following these steps, you can accumulate at least 5-10 transactions in your wallet or even more, providing a solid beginning. For optimal airdrop rewards, return every 30 days or more and perform similar tasks.\n\nAnticipating the STARK Airdrop: Unveiling the Plans for 2024\n\nThe STARK Airdrop is on the horizon, with an impressive allocation of 900 million STRK tokens for transparent distribution across various programs. This implies multiple airdrops, emphasizing a focus on long-term engagement with the network.\n\nThe timeframe is expected to be lengthy, so don’t expect the 900 million STRK tokens to be ready for an airdrop next week. This approach encourages sustained engagement with the blockchain.\n\n900M STRK for “User Rebates”\n\n50M for “On-Chain Incentives for DeFi”\n\nThe allocation of 900 million STRK tokens for “User Rebates” suggests a potential refund for ETH spent on gas fees by users. Another 50 million is allocated for “On-Chain Incentives for DeFi,” with direct, indirect, and retroactive incentivization in the decentralized finance (DeFi) space. Protocols are expected to receive tokens, and Yield Farming on Starknet will commence.\n\nTimeframe and Outlook: Q1 2024 and Beyond\n\nThe research phase is nearing completion, and execution and deployment are scheduled for Q1 2024. This provides a clear timeline, especially for “On-Chain Incentives for DeFi,” indicating that STRK yield farming will likely begin early next year.\n\nDevelopers and Dapps: Anticipating New Announcements\n\nSubject to Terms & Conditions: Possible Exclusions\n\nFor developers and decentralized applications (Dapps), there are imminent announcements. A formal announcement is expected next week. It’s noted that certain terms and conditions may apply, potentially including exclusions for the USA."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxPd2xLYnJlMy1xWGFoS2tCS0lZWGtSSXFBUEtMRlRDaGVrUThZeXhwTDcyendTa3FBT2xPeFF3TkFJUWxLQmNjbm16N2FUc1VIUDdXZHhyY0hGdGtNY1AtM1hoendtZWRkNHN1WmozcFc1NG1yZnhoUElLUWh6VGF2VmgxcDJMMWRqRFlxQzJMejBaVGVyd3RlUVlWZ1dkRE16ZkJUZFdtVWI1bW44WHNRQlVQb2VUNW93OHhv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "Anatoly Yakovenko Says 'Solana Is Ethereum' In Layer-2 Scalability Debate - News 4 Social English",
        "content": "Anatoly Yakovenko says 'Solana is Ethereum' in layer-2 scalability debate h3>\n\nSolana creator Anatoly Yakovenko recently referred to Solana as an Ethereum layer-2 solution through its Wormhole eigenlayer in a post on X.\n\nIn the exchange, Yakovenko positioned the blockchain as an Ethereum layer-2 while responding to a tweet listing various other L2 solutions, including Arbitrum, Aztec, and Polygon, among others. He wrote:\n\n“Solana is ethereum! Solana is an ethereum L2 through the wormhole eigenlayer. Once danksharding is scaled up no one is going to stop you from submitting all the solana blocks into some data validating bridge contract on ethereum.”\n\nAccording to Yakovenko, the integration of Solana with Ethereum is facilitated by the Wormhole eigenlayer, which would eventually allow the potential for Solana blocks to be submitted into a data-validating bridge contract on Ethereum after key scalability upgrades.\n\nOn the rise\n\nFollowing a challenging start to 2023, Solana ended the year with a significant upturn. December was a particularly active month for the blockchain, showcasing one of the quickest price recoveries in the final quarter. The total value locked (TVL) on Solana impressively more than doubled, escalating from $671.62 million at the beginning of the month to $1.529 billion by December 26th.\n\nHowever, when denominated in SOL, the increase was more modest, from 11.35 million SOL to 12.56 million SOL in the same period. This discrepancy reflects the significant rise in SOL price, which climbed from $59.2 to $121.4, affecting the USD valuation of the TVL.\n\nNotably, Solana overtook XRP in market cap, becoming the fifth-largest cryptocurrency with a market cap of $34.8 billion as of December 20, 2023, following an 11% increase in Solana’s value, which outpaced the broader market’s 3% gain. The SOL/ETH ratio, comparing Solana’s value to Ethereum’s, also shows recovery, highlighting Solana’s competitive stance.\n\nThe SOL/ETH ratio, a metric comparing the value of Solana (SOL) to Ethereum (ETH), is a critical measure of Solana’s competitive position. This ratio has experienced significant fluctuations, with the most recent data showing a recovery in Solana’s standing against Ethereum.\n\nSolana’s blockchain technology, known for its high performance and scalability, is designed to support decentralized applications (dApps) and decentralized finance (DeFi) use cases. The platform’s success is attributed to its unique consensus algorithm, “Proof of History,” which enables high transaction speeds and low fees, making it a popular choice among developers for dApps and DeFi projects.\n\nThe post Anatoly Yakovenko says ‘Solana is Ethereum’ in layer-2 scalability debate appeared first on CryptoSlate.\n\nCheck More Latest Cryptocurrency News Click Here– Latest Cryptocurrency News\n\nCheck More Business News Click Here– Latest Business News"
    }
]