[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMibkFVX3lxTE1zaUEzcUg0VS1MR0tRM2VDY3BBZ3JZMVZySkpnQ0xIVHlILVZfTndIbTF2VldqTXZwcEhNMExMQ0xlOVZQbUJlMWdFX0R1VnNSWkVhVDM4OUJHREF1b3FkUHh2VUxuVjVSM2Uzb2JR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 20:33:15 GMT",
        "title": "Ethereum validator and node growth leads to emissions decline: Report - Blockworks",
        "content": "The Ethereum network’s greenhouse gas emissions have dropped by an estimated 99.97% since its shift to proof-of-stake, despite a big rise in node count.\n\nThat’s according to new research by the Cambridge Centre for Alternative Finance. The organization has upped its crypto research effort after in April launching the Cambridge Blockchain Network Sustainability Index (CBNSI) — a measure that detailed Ethereum’s electricity consumption pre- and post-Merge.\n\nThe Ethereum network currently is responsible for 2.8 kilotonnes of carbon dioxide equivalent (KtCO 2 e) on an annualized basis, the CCAF said in a Friday report.\n\n“To contextualize, this would equate to the emissions from five round-trip airplane flights from London to New York, the annual energy consumption-related emissions of 450 UK households, or the annual carbon sequestration capacity of 270 acres of forest,” the report states.\n\nEthereum switched to a proof-of-stake consensus model in September 2022. The Ethereum Foundation had estimated the Merge would reduce the blockchain’s power consumption by 99.95%.\n\nRead more: Ethereum switches to proof-of-stake after 7 years of work\n\nBut electricity usage is only one piece of an environmental impact assessment, according to the Friday report.\n\nAdditional data was required to convert electricity consumption to greenhouse gas emissions. The CCAF used off-chain data from the peer-to-peer communication of Ethereum nodes to gather both electricity usage and the geolocational distribution of nodes.\n\nThe number of Ethereum validators has grown 57% since April 1, reaching 880,822. Ethereum nodes have grown to 14,072, reflecting a 23.2% increase over that span.\n\nThe network’s annual electricity consumption increased by 21.2% in those eight months, from 6.19 GWh to 7.50 GWh — roughly the annual electricity use of 2,000 English households, the Cambridge data shows.\n\nAs for where the nodes are, Europe and North America are home to 43.3% and 40.5% of them, respectively, following the Merge.\n\nSource: Cambridge Centre for Alternative Finance (CCAF)\n\nThe CCAF estimates pre-Merge greenhouse gas emissions were about 10.3 MCO 2 e. The latest post-Merge figure of 2.8 KtCO 2 e reflects a 99.97% drop despite a substantial increase in the number of Ethereum nodes, the report notes.\n\nThe network is now powered by nearly 48% sustainable energy — including 32% renewables and 16% nuclear — the CCAF estimates, with the remaining 52% coming from natural gas, coal-fired power, and oil.\n\nThe CCAF said it next looks to enhance its Cambridge Bitcoin Electricity Consumption Index (CBECI). Despite Ethereum’s shift to proof-of-stake, bitcoin’s proof-of-work consensus model is a cornerstone of its identity, the report acknowledges — making a similar transition “not as straightforward as it might appear at first glance.”\n\nThe research institute adds: “The narrative of Ethereum and Bitcoin’s different paths is not just a tale of technological advancements but also reflects different ideologies and priorities of their communities, highlighting the multifaceted complexity inherent in the evolution of leading blockchain networks.”\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxPWG5LSDN5d3FDQjFsUWFpd0xUWGdHQUY5THdLRm5WNkR2NElIeE90S2ExUXhiZHZ3Y3NOMUJEUFl0aGRyekpIcENtN0g2LUtBZUZUZUlEQlVKWl81eFAwYTh5azNLcVA0YUt0WmM2VG5GZlBicTVvakRQSTJQUTdiRNIBhgFBVV95cUxOTVlvOGJta0pVeG40MG5BY1JQOTlNMEtVeGc1UjVXWXVLUmdqVmloYnRoQUpUWnUxNHh2OF84dkpPbEZxNjQwV3c1MTd5SW9pZlBWeUI4Q3FRVXNFeERKNllicE5YZVl5M3JnYkZ6VHVTUEwwNld1bVI0TW9FODZtWXVDVDdfUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 02 Dec 2023 08:00:00 GMT",
        "title": "Solana (SOL) Exceeds Ethereum L2s by Trading Volume, Data Says - U.Today",
        "content": "Advertisement\n\nTraders and analysts are discussing the roots of the \"New Solana Summer\" as all core metrics of on-chain activity are rocketing. Some of them have already reached pre-FTX collapse levels. NFTs and meme coin segments might be contributing to this upsurge, data says.\n\nSolana (SOL) exceeds Polygon (MATIC), Optimism (OP) by transactional volume\n\nIn early December 2023, the aggregated on-chain trading volume on the Solana (SOL) blockchain surged above $240 million per day in equivalent. As such, the blockchain managed to surpass both Polygon (MATIC) and Optimism (OP), two mainstream Ethereum-based L2s by this indicator.\n\nImage by DefiLlama\n\nIn the first days of December, Polygon (MATIC) and Optimism (OP) demonstrate trading volumes of $137 million and $40 million per day, respectively. As such, Solana (SOL) processes more money on-chain than they do combined.\n\nAlso, in the last 24 hours, Solana (SOL) exceeded its another rival Avalanche (AVAX) by net value locked in dApps. Solana's dApp ecosystem is responsible for $688 million in TVL, Avalanche (AVAX) dApps logged $660 million. At that pace, Solana (SOL) might surpass the TVLs of Polygon (MATIC) and Optimism (OP) in the coming days.\n\nAdvertisement\n\nIn the last month, Solana's (SOL) TVL added over 60%, while the SOL price soared by 45%.\n\nHowever, it is still lagging behind Arbitrum (ARB), a dominant Ethereum (ETH) L2. Arbitrum (ARB) amassed almost $2.2 billion in TVL, while its daily trading volume exceeds $363 million in equivalent.\n\nSolScriptions and meme coins triggered Solana (SOL) comeback\n\nThe rally of Solana (SOL) and its network indicators can be attributed to a combination of powerful catalysts. For instance, the interest in Solana-based Ordinals \"SolScriptions\" and meme coins triggered the growth of SPL tokens minted on-chain.\n\nThen, Solana-based liquid staking protocols like Jito and Marinade Finance are actively attracting new customers and liquidity. Decentralized exchanges like Raydium and Orca are also gaining traction.\n\nAs covered by U.Today previously, CoinEx Research indicated the DePIN (Decentralized Physical Infrastructure Networks) sector as yet another powerful catalyst for Solana (SOL) ecosystem's rebound."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxNTzVHQVpvR3dnSXlVVmk2SDIzbVh6NDB2MHZETTFLdkJBd2hSNHR3b3gyMkpteGFGRkd6V2p3TTk0UlhqUld0NmdHRW91WVpnTXVNb3dyb05OTkhLQTdNN096bEVVMDFkNnJKR3JRSDdUWWpBT1RPSlV0bEVCMldSLXpMbTNMdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Vitalik is the public intellectual the tech world needs right now - Fortune",
        "content": "Vitalik Buterin is best known for creating the world’s second-most-valuable blockchain, Ethereum, when he was just 19 years old. In the past few years, though, Buterin’s influence has expanded well beyond the world of crypto and into the broader realm of ideas where the young polymath—who taught himself Mandarin while traveling the world—offers important treatises on technology and the future.\n\nThe latest example is a 10,000-word essay Buterin published this week titled “My techno-optimism.” It’s a response to the much-discussed “manifesto” with a similar title by the influential venture capitalist Marc Andreessen. Buterin’s piece endorses many elements of the manifesto, including an affirmation that technology has delivered marvelous benefits to humanity, and that fear and overzealous regulation have limited progress in fields like biotech. But while he endorses a foot-on-the-gas approach, especially to solve the climate change crisis, Buterin also calls for a more cautious approach when it comes to AI.\n\nWhile the Ethereum creator has long been a leading thinker in computer science, he has also become one in the governance of technology and society. Here is Buterin on the crack-up at OpenAI and the problem of putting guardrails on technology by means of small councils of elite decision-makers:\n\n“[It was] a well-intentioned effort to balance the need to make a profit to satisfy investors who provide the initial capital with the desire to have a check-and-balance to push against moves that risk OpenAI blowing up the world. In practice, however, their recent attempt to fire Sam Altman makes the structure seem like an abject failure: It centralized power in an undemocratic and unaccountable board of five people, who made key decisions based on secret information and refused to give any details on their reasoning until employees threatened to quit en masse.”\n\nDrawing on his experience in trying to build decentralized communities in the Ethereum realm, Buterin provides new and important insights into how to think about AI—including how to avoid the very real possibility that humans end up as pets to machine overlords. He is, of course, hardly the only one with big ideas about the future of technology. But what makes Buterin stand apart is his deep capacity for empathy and lack of ego.\n\nUnlike Andreessen and Balaji Srinivasan—another tech genius whose ideas carry a lot of weight in the debate over technology—Buterin doesn’t have contempt for those who disagree with him, and he doesn’t frame the debate in the shrill us-versus-them tone of the venture capital elite.\n\n“I believe that these [technologies] are deeply good, and that expanding humanity’s reach even further to the planets and stars is deeply good, because I believe humanity is deeply good,” he writes. In a troubled moment where too many people are consumed with fear and negativity, it is welcome to read a tech genius who relies on empathetic persuasion. If you want a shorter and more approachable window into Buterin’s worldview, you can also check out this new Fortune Q&A, which includes the moral case for supporting Ukraine and the fascinating sci-fi realm of the popular book and film The Three Body Problem. Have a great weekend.\n\nJeff John Roberts\n\njeff.roberts@fortune.com\n\n@jeffjohnroberts\n\nDECENTRALIZED NEWS\n\nBitcoin bulls are predicting the currency, which is up around 130% in 2023, will end the year at $40,000 even as it has struggled to maintain a consistent foothold above $38,000. (Bloomberg)\n\nRep. Tom Emmer (R-Minn.), a GOP House leader, warned about a legal framework for stablecoins based around CBDCs that he says could “swallow up” crypto in a “surveillance security state.” (Fortune)\n\nPolygon secretly gave preferential status to Draft Kings in the form of millions of dollars’ worth of subsidies to a validator run by the sports betting site—an effort that is now kaput. (CoinDesk)\n\nA new survey of the Bitcoin mining industry raises concerns about its use of water, which it claims is about equal to the annual consumption of Washington, D.C. (The Verge)\n\nAmid a broader reckoning in the VC industry, Tiger Global slashed valuations in its venture fund, including markdowns of 94% to OpenSea and 64% to Bored Ape Yacht Club. (Bloomberg)\n\nMEME O’ THE MOMENT\n\nOne version of the future:"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxONlFIR2ttMFNKb25qc1g3MWJJSXdnQ2xfTU5PUEh6dDZZRURnR1pLemVEc3dGenlEanhJN3BlSk5zN1FXTnI1Y3d1c090LVJ5NEhvZXBNRWV6NFdVTXdIYW9Vb0xoWlUxTVMtWU5ZaEVmSUcxaXlVRFlacklEOGREZUxKMWlHNHNwSFpzTk9abHRKVDVEMjlDb2RTOUtYQVYtRC1HNHBvT3BuUjNOZkRGQjViOGxJVkp0cXdsbmoxRGhtXzA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "The Fabricant’s Fifth Anniversary: Ethereum, Revamped Collection, AI and More - WWD",
        "content": "For its fifth anniversary, The Fabricant makes no bones about its visions of grandeur. In addition to celebrating the occasion with a revamped Deep collection, with artificial intelligence reimagining one of its earliest offerings, it is expanding the digital fashion platform with new integrations.\n\nThese moves matter, executives told WWD in an exclusive interview, because they represent the company’s next step in its evolution — and its ambitions to advance virtual fashion as a whole. The plan, they said, was to finally turn digital fashion into a mainstream movement.\n\nThe work has already begun. It starts with opening up availability for virtual fashion. For Kerry Murphy, cofounder and chief executive officer, and chief technology officer Marco Marchesi, that translates to expanding The Fabricant’s platform to Ethereum, one of the crypto world’s top decentralized blockchain networks, as a way to become a multichain platform. Meanwhile, it is also integrating with Crossmint, which builds tools that make it easier for businesses to build NFTs at scale.\n\nMetaverse skeptics could criticize moves like this, given the tech’s downturn as a cultural phenomenon. But blockchain evangelists beg to differ, and corporate America as well as global brands seem to agree. Not only have fashion brands continued to invest in virtual technology and metaverse initiatives, but Crossmint — a popular NFT partner for some of the world’s most recognizable companies — recently inked another notable deal with Coinbase.\n\nYou May Also Like\n\nThe original “CopyCopyCopy” look from the 2018 collection. Courtesy image\n\nIn an August social media share, the company announced that “the world’s coming on-chain. @coinbase is integrating @crossmint to help Coca-Cola, Atari, and other major companies onboard the world to Web3.” That follows the June launch of its NFT “wallet-as-a-service” to help companies put simplified, interoperable blockchain technologies into their existing products. The same month, rapper Snoop Dogg released a “dynamic” NFT collection, which evolves alongside his tour. He used Crossmint, which can work with fiat currency, as the NFT payment processor.\n\n“Crossmint is the perfect partner to really remove the friction between payments and experience that you get with NFTs,” said Marchesi. “That’s the name of the company itself, ‘Crossmint,’ so they really don’t care anymore what currency you’re using at other servers. And that’s what we need for our community, for our users.”\n\nWith the Ethereum play, The Fabricant’s digital fashions — its own or those of its brand partners — are poised to become more available to a greater number of consumers.\n\nLinking to Ethereum is something of a homecoming for the company. “We sold the world’s first digital fashion couture NFT on Ethereum, back in 2019,” explained Murphy, referring to a high-profile collaboration between The Fabricant and artist Johanna Jaskowska, CryptoKitties and Dapper Labs that resulted in a digital blockchain dress called “Iridescence.” The NFT was hailed as the world’s first virtual-only haute couture dress and sold for close to $10,000.\n\nThe project was more about making a statement about digital fashion, said the CEO, and at the time, it prompted the press to wonder why anybody would pay such a high price for clothing that didn’t actually exist. But soon enough, COVID-19 changed the equation, with people living more of their lives online amid widespread lockdowns. “We became one of the most relevant companies in the fashion industry, and we had all the physical fashion brands calling us up asking, ‘What is this digital fashion about?’” he added.\n\nAs he reflected on his company’s five-year journey, it’s clear that it was quite a whirlwind studded with major figures in gaming, from establishment giant Atari to Web3 hit Star Atlas, and notable names in fashion spanning Rtfkt, the digital sneaker start-up-turned-Nike business, to Virgil Abloh. The Fabricant has been at the heart of millions of dollars in NFT transactions and other investments and not just for partners. In 2021, it scored $14 million in series A funding, which was perhaps fortunate timing. The following year saw a cryptomarket crash that took the shine off of cryptocurrencies and, to some degree, NFTs.\n\nMurphy was quick to note that The Fabricant is not a crypto company, but it does work with the same underlying blockchain technology, so it felt the ripples. “[We] had to really detach ourselves from the narrative of crypto NFT and metaverse, and really focus on digital fashion,” he said, describing it as a highly successful shift.\n\nNow the company is ready to move forward and, once again, timing may be on its side, given recent advancements in artificial intelligence, brands’ growing digital sophistication and greater consumer understanding of virtual experiences. Case in point: The revamped version of Amber Jae Slooten’s Deep collection, as reimagined using generative AI. The original was never available “on chain” before, but the collection totaling seven items will drop on Dec. 14 as part of The Fabricant’s Ethereum expansion.\n\n“Machine” from the 2018 Deep collection. Courtesy image\n\n“Machine” as reimagined by AI in the 2023 Deep collection. Courtesy image\n\nAs for the future, Marchesi pointed to new experiences in development, such as augmented reality dressing. It remains a holy grail in digital fashion, and The Fabricant partnered with Snap Inc. to enable it and, by doing so, it joined myriad players from Google to DressX pursuing the same thing. The key is to not let the technology or complexity get in the way. The CTO sees it as “part of our vision, [which] is about, everyone should be able to wear digital fashion in any context with any device.” The Fabricant quietly launched AR try-on as a beta feature of its platform, as it has been a work in progress, but it’s ready to call more attention to it now.\n\nAnother area of interest is using virtual fashion and realistic AI models for photo shoots. The company wouldn’t disclose details on that on the record, but it is actively exploring this.\n\nThere’s more happening on the fashion front, including some sort of upcoming collaboration with a notable luxury brand, though neither Murphy nor Marchesi could offer details at press time. But coming on the heels of this slew of updates, exploratory projects and efforts in development, it’s unlikely to be a rank-and-file debut.\n\nWhether any of it succeeds in drawing mainstream interest remains to be seen. But one thing seems quite clear — The Fabricant’s swirl of activity in the last five years might be nothing compared to what the next five brings."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxOcTFQVDQ4OFdKNU0ydmZvTmJ3WTJGLXBCNS1RejV6dmRyOUJUMmhNLVNsS3VHYUs5NENGeGtGVE1kYUZBbDh0YWRMNlZEWVZFZURpMkwwNlhnWF9ieHRNQXRoOHJpXzQ1dEU4NG1ZVlJPVHdIMU5KT1lqMlVkSnBuclQ1RDQ5dkJ6Y01ab3FVUmFQUdIBlwFBVV95cUxPR0tJdW9vX0dzbkpnN1g4a2JKZTJfWm1iUTFPdGJzTldfcDF5Q0w3NmJNQ0FyUVlvb2oxZjhjZ2h4ZUxwMUc5YXptMG4yMzE0LTRBMk0tNkZFRld2NEtzM01lTzVoR1p4ZzhMUGw1c2ozQ1VKV21ET2lmd19nZ3E1Z2h5Szg0bmtWLTFVOWtXWG43ZWYzdkpZ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Price Prediction: Is ETH Ready For New ATH In 2024? - CoinGape",
        "content": "Ethereum Price Prediction: Ethereum (ETH) price stayed relatively unchanged on Thursday despite the trading volume dropping by 20% to $8.5 billion. Intriguingly, the altcoin’s market cap is holding up above $245 billion, according to market data by CoinMarketCap.\n\nThis has been a week of consolidation with Ethereum price sitting above the $2,000 level. Recovery has become an uphill battle leaving Ether to wobble between support at $2,020 and a short-term resistance at $2,070.\n\nadvertisement\n\nEthereum Price Prediction: How Far Is Ethereum From Breakout?\n\nThe Moving Average Convergence Divergence (MACD) indicator upholds the mundane sideways trading Ethereum has displayed since Monday. Its downside is protected by the 100 Exponential Moving Average (EMA) (blue) at $2,020 and the ascending trendline.\n\nEthereum price tends to react bullishly every time it has retraced to touch the trendline. Therefore, in case of dips towards the $2,000 mark, bulls could seize the opportunity to buy into ETH while speculating on the next breakout first to $2,200, and later to the subsequent levels at $2,500 and $3,000.\n\nTraders should exercise caution and restraint as long as Ethereum is trading below the short-term resistance at $2,040, as highlighted by the 50 EMA (red). The action above this level and the next resistance between $2,058 and $2,070 would serve as a breakout signal, paving the way for a bigger move to $2,200.\n\nThe momentum indicator will confirm the uptrend’s continuation with the blue MACD line flipping above the red signal line.\n\nA triangle pattern forming on the four-hour chart could nurture a bigger breakout towards $3,000 if validated. Bulls must focus on breaking above resistance at $2,120 to activate the triangle breakout. Most traders would consider going long on Ethereum slightly above the triangle.\n\nRecommended for you: Dogecoin Price Could Blast Through $0.12 Resistance If This Technical Pattern Plays Out\n\nA glimpse of the daily chart assures traders of support at $2,015 but based on the current technical, as depicted by the sell signal from the MACD, ETH might drop again before making another significant recovery attempt.\n\nHowever, backing the bullish outlook in ETH is the position of all three moving averages; the 50-day EMA, the 100-day EMA, and the 200-day EMA. If the MAs uphold the ongoing uptrend, the path with the least resistance is likely to stick to the upside.\n\nEthereum DeFi TVL Shoots To $26 Billion\n\nThe dollar value of all ETH locked in staking protocols and other decentralized finance (DeFi) networks is increasing rapidly. According to data by Defi Llama, the total value locked (TVL) currently stands at $26 billion from approximately $19.4 billion in mid-October.\n\nThe growth in TVL underscores the long-term bullish outlook investors have for Ethereum price. They are willing to lock up their Ether for longer periods, expecting that the uptrend will continue into 2023. A high TVL value significantly reduces the selling pressure.\n\nRelated Articles\n\nJohn Isige John is a seasoned crypto expert, renowned for his in-depth analysis and accurate price predictions in the digital asset market. As the Price Prediction Editor for Market Content at CoinGape Media, he is dedicated to delivering valuable insights on price trends and market forecasts. With his extensive experience in the crypto sphere, John has honed his skills in understanding on-chain data analytics, Non-Fungible Tokens (NFTs), Decentralized Finance (DeFi), Centralized Finance (CeFi), and the dynamic metaverse landscape. Through his steadfast reporting, John keeps his audience informed and equipped to navigate the ever-changing crypto market.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxPWHdjQ2xUTXFtUGVjRXFWcTFmRXFtdXJTdHZqeU9manR6VjdHQWpGblVsSWZ5V0dGZXpPS01kbEhJZVdOWWFseXY5QzA0czhEVk1GZEFSMVN3WWZLUVFvZEhra0hGNnhXZnNXSUhQQmpzVExlOVloN2dsSjR5bGxmNE1wUGxkUFVONjBDd0ItWXp4Vmc0bFNxeUh5Wk84d1ZHTU9KWmtFMFFjN1BUT3pB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Ethereum (ETH): Time to Take Profit? Whales Cashing Out By U.Today - Investing.com",
        "content": "U.Today - market dynamics are often a tale of whose trades can signal shifts in market sentiment. Recently, a whale transaction caught the eye of many, as 3,150 ETH, valued at approximately $6.37 million, were sold at an average price of around $2,023, netting a substantial profit from an earlier purchase of 2,762 ETH at $1,825 each. This move has prompted discussion among traders: is it time to take profits on Ethereum?\n\nThe chart reveals a critical juncture in price action. After a period of bullish momentum, is now testing local resistance levels, creating a moment of decision for investors. The current resistance, formed near the $2,050 mark, is a crucial threshold that has previously prompted sell-offs, suggesting that traders are eyeing this level to secure gains.\n\nConversely, the support levels paint a picture of potential bounce-back zones. The first significant support is visible near the $1,950 level, aligning with the 50-day moving average. This moving average has historically acted as a dynamic support, propelling prices upward upon contact. A break below this, however, could see Ethereum's price target the next support at approximately $1,850, where previous demand coalesced to halt bearish runs.\n\nThe probability of a price reversal hinges on the to these critical technical levels. A convincing break above the current resistance could invalidate the bearish thesis, potentially leading to a continuation of the upward trend. However, recent whale activity suggests that some large holders are starting to realize profits, potentially adding to the selling pressure at this price threshold.\n\nVolume trends also provide insight, with a notable decrease in trading volume suggesting that the current price level may be unsustainable in the short term. Combined with the whale's cashout, it could signal a broader sentiment shift among investors, leading to increased volatility and a possible price correction.\n\nThis article was originally published on U.Today"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMi7gFBVV95cUxNTnBKUXE0RnVSekNoTUs4VWVac0F4MDd1UTNDN0s1elRyR1dYaFJVMUZlNEZEUkxtVGwxaXNmbG5uSC1HdDJJLXEzMm9JaG0zSjI5Mkl6ZHYxRDhmVkRQVER6SUJIM2NFMXRlREE3YkwyVUpjOFZ6dlRTZTUwQkpSZ3hwTV9GWGt6Z0hFRnROMzZOZ0dEYl92dTlZLTdVWmZjVlEyRlM5TXpGblB3NW11Qm1DcGpqYXQ5cnlsV3g1c1FkN2FLT0ZFRkdPSEhaQlE5eUE1TXFKeHZhdDRHMFV0b3VGWXBMQVh2YUFTai1n0gHzAUFVX3lxTFBpeTRKQncteGxBSlZSc2dmYVdDM1V6WkY0MFowRTFtM0lYSExkX2c0YUgxNG83UnplM1BodDBOVTJkUVdpdm5wODFvdDdLS01CN2FFd2lGYlNFMldqaEZvTFRtYWd2ZFk2ZjVPMUE0dnZMTmp4bjNBRFlDcTJjeHRsckc2SERpU0JoR0ExZ2xIVVpRa1RzMjRTUk56ZGlEbGw1Rm93c29TNmF3VEVlMlVkbzktanRVVFQ5bUltTExwWkFObWZjLUpOYV90ZnFEQVpQVWhKOE1Oc01yVk45OHhwYWthbUR2UWxubElGUGwxejVVRQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Charles Hoskinson and XRP community in loggerheads again, debate on Ethereum’s free pass resurfaces - FXStreet",
        "content": "Charles Hoskinson has addressed the rumors of Joseph Lubin of ConsenSys bribing the SEC to go after XRP.\n\nHoskinson finds himself in a similar situation as Brad Garlinghouse, as the SEC considers ADA an “investment contract” in its lawsuit.\n\nThe Cardano founder has asked the XRP community to present evidence of the bribery allegations and dispels the rumors.\n\nCharles Hoskinson, the founder of Cardano, engaged in a debate with the XRP community over the rumors of ConsenSys founder, Joseph Lubin, bribing the US financial regulator. The rumors seem unfounded and the XRP community has failed to present evidence supporting the claims.\n\nAlso read: LUNC ranks among trending tokens alongside Dollar pegged stablecoin USTC, eyes recovery\n\nCharles Hoskinson addresses rumors surrounding Ripple lawsuit\n\nCharles Hoskinson, the founder of Cardano is one of the co-founders of Ethereum. Hoskinson has been embroiled in a debate with the XRP community over alleged rumors of ConsenSys founder Joseph Lubin bribing the US Securities and Exchange Commission (SEC) to give Ethereum a “free pass” and go after Ripple. Here free pass meant Ethereum was allowed to conduct business as usual while Ripple was hit by a lawsuit.\n\nIt is important to note that Hoskinson currently finds himself in a similar situation to Brad Garlinghouse, the CEO of Ripple, in 2020. The US SEC slammed Ripple with a lawsuit, alleging the unregistered sale of securities, here securities meaning XRP. The SEC has listed Cardano as an investment contract in its lawsuit against Kraken, a cryptocurrency exchange. It is therefore clear that the regulator considered Cardano an investment contract.\n\nHoskinson commented on the rumors stating that the XRP community needs to present evidence to back its claims, or else he finds it a “grand conspiracy.”\n\nFor the argument that Joe bribed the SEC to go after XRP that is the conclusion. That is the entire point of calling it a grand conspiracy. The free pass has nothing to do with the case against Ripple. They are unrelated events. Two years now and you haven't provided any evidence… — Charles Hoskinson (@IOHK_Charles) November 30, 2023\n\nJoseph Lubin is involved here as ConsenSys is software production studio that offers clients enterprise Ethereum solutions. The tight relationship between ConsenSys and Ethereum gave rise to the rumors, however, no evidence of bribery has been presented so far."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxOSmdPTDd3bnluVTdwNkZzaHIwT1RBdmlyNFFKSG9qRF9ZWGV6bVFibjJIOGVmYWJSVFJWOWo3SGNZMVVBcXAyYVVkMnNpZE9sN2EyN2RzSEZzVUYtT1N3VlpIWDc3aVpLTXIxLVc3YmY4VG5rWVNuVGsyNlF3VnRULW84RDNVazk4ckk5SENqMDRVWk40dkVTRA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 02 Dec 2023 08:00:00 GMT",
        "title": "Goldfinch Approves Expansion to Coinbase’s Base Layer-2 - Crypto Times",
        "content": "The decentralized finance (DeFi) lending protocol Goldfinch has approved plans to expand beyond Ethereum and launch its services on Base, a layer-2 blockchain created by major crypto exchange Coinbase.\n\nWe're thrilled to announce that our community has approved the deployment of the Goldfinch smart contracts on @BuildOnBase L2!\n\n\n\nThis strategic move aligns with our mission to make the power of crypto accessible to a broader audience by improving user experience and reducing gas… — Goldfinch (@goldfinch_fi) November 30, 2023\n\nGoldfinch governance members reached consensus on the proposal after extensive debate over the benefits of onboarding more users through Coinbase’s large customer base versus remaining solely on Ethereum.\n\nThe Goldfinch community will next hold a soft vote and audit the code before officially activating the deployment contract to add Goldfinch to Base. This represents a major step toward lowering transaction fees and boosting adoption for the DeFi lending platform.\n\nAdditionally, Goldfinch’s native GFI token surged 14% to $1.74 following news of the expansion on December 1.\n\nGFI Price | Source: Tradingview\n\nAs an Ethereum-exclusive project until now, the shift to a more affordable layer-2 network will enable greater accessibility by reducing prohibitively high gas fees on the main Ethereum blockchain.\n\nGoldfinch co-founder Blake West and engineering manager Greg Egan were strong proponents for the move to Base, citing the blockchain’s rapidly growing total value locked of over $300 million. They also referred to Coinbase’s massive user base over 100 million worldwide that Base apps can leverage.\n\nAs one of the largest centralized crypto exchanges that recently went public, Coinbase’s support provides credibility and a built-in customer pipeline that will accelerate DeFi adoption. Goldfinch aims to take advantage of Base as a customer acquisition channel going forward.\n\nThis latest development comes on the heels of Goldfinch marking the full repayment of its first-issued loan to crypto lender Fazz Financial in late November. The successful repayment of this genesis loan is a promising indicator for the newly expanded lending protocol."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMi2gFBVV95cUxQeE9pWWFQS0RHZ01tV3hXa3BONU9yMENfR2h5alg1QXhaT2Q3LVpBdGp3dFNEWFFhVGVObnNYOTZlZS1vMEpEX3ptcENCZm9qdHp1QVk3ZEVtY0VzczdxQUp6bW0wdld6cHRaMDdRb1VNSEZjd0U3S0otWkhMNHZ6V1h3cWkzUjR3b3dqT3pFajNFZUlsMEJXVXBxd0NrWkRycW5zeE1IVmdXbnJrTHhoY0lKcTZlRVJ1SFM3YTNvWkVMVTlMbnJYeFdTY2k1MXd2OWFRR2FWaDQ0Zw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Will XRP Make You Rich? Here’s What XRP Price Looked Like 5 Years Ago When ETH was $102, and Cardano $0.0328 - The Crypto Basic",
        "content": "Recently, XRP community members looked back into history to compare XRP’s price through their years of holding on to the digital asset with respect to the performance of other competing crypto projects.\n\nPer statistics from authoritative sources, XRP appears to be the worst-performing cryptocurrency when compared to others ranking in the top ten, like Bitcoin (BTC), Ethereum (ETH), and Cardano (ADA).\n\nXRP Price Five Years Ago\n\nToday, five years ago, data from prominent market tracker CoinMarketCap shows XRP traded at a low of $0.3625 and a high of $0.381. At that time, it had a market cap of $14.61 billion, with a 24-hour trading volume of around $512 million.\n\n- Advertisement -\n\nThroughout November 2018, the highest point XRP reached was $0.5605, while its lowest was $0.325, per CoinMarketCap statistics.\n\nXRP’s lowest value five years ago, when compared to its price of $0.6 today, suggests the token has again only 86.45% all the way from 2018 to 2023. On the high side, with $0.5605, XRP has seen only 8.12% in five years.\n\nBitcoin Price Five Years Ago\n\nMeanwhile, on November 30, 2018, BTC traded at a low of $3,942.82 with a valuation of $69.9 billion and a trading volume exceeding $6 billion. The firstborn crypto’s lowest value for November 2018 was $3,585.06, which translates to a 957% gain when factored against today’s price of $37,902.\n\nEmphatically, Bitcoin’s value five years ago compared to today implies BTC investors have reaped more than ten times more profit than XRP investors.\n\nETH and Cardano Price\n\nSimilarly, Ethereum exchanged hands at a low of $111.74 today five years ago, with a market cap exceeding $11,7 billion. In the same month, ETH bottomed at $102.45 and has grown 1887.71% since then to $2,036 today.\n\n- Advertisement -\n\nIn other words, investors who bought ETH’s dip in November 2018 have seen 21 times more profit than those who bought XRP’s dip the same month. Likewise, Cardano sold at a discount of $0.0328 in November 2018. However, ADA’s value has risen 1,053.05% since then to $.378.\n\nCrypto Community Reacts\n\nA crypto enthusiast with X username “@Ianbins” put XRP’s five-year value alongside rivalry tokens with a satirical comment.\n\n“Buy XRP, they said; it will make you rich, they said,” he mocked, given that XRP’s current value is not much different from November 2018.\n\nMeanwhile, Bill Morgan, a lawyer known for his pro-XRP stance, remarked:\n\n“Wow. I never realized XRP’s price performance was this poor compared to other major coins and not only compared to Bitcoin and Ethereum.”\n\nWow. I never realised XRP’s price performance was this poor compared to other major coins and not only compared to Bitcoin and Ethereum. It has of course been under the cloud of a SEC investigation and then lawsuit that entire period but you would think it would have caught up… https://t.co/Eyflqp0JZq — bill morgan (@Belisarius2020) November 29, 2023\n\nNotably, the XRP Army has argued the multi-year regulatory battle against XRP had hindered its performance. Following the court ruling in July, XRP reached $0.93 but has since lost those gains.\n\nNonetheless, it remains to be seen how XRP will perform in the coming years with the U.S. regulatory fight out of the way."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiY0FVX3lxTE1NVnVnVW1uN3czaE1FWFp2cFZoNmVpSW1KTDZ4R2JENHNaWng5eXJaLXFKdUhlM040ckJNc3o4MjFfNndTYXBNZF9xa1RyVlZFUEx3STlPZC1tUEtfc2ViQ2lwTQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Blast from the past: 3 years on from the launch of ETH staking - Blockworks",
        "content": "Yeeting ETH into the void is nothing new for Ethereans.\n\nBy the time the Beacon Chain officially launched on Dec. 1, 2020, the staking contract — referred to as “ETH 2.0” back then — had already seen around 880,000 ETH in deposits.\n\nSo perhaps it’s no surprise that multisig-with-a-plan project Blast now sports $650 million in staked ether and stablecoins under its control.\n\nBlast’s explicit promise is that deposited tokens will earn an on-chain yield, plus rewards of unknown value. Ether staking yield comes via Lido’s stETH tokens, while stablecoins are converted to dai deposited in Maker, or savings dai (sDAI).\n\nOn Thursday it emerged that the Blast deposit interface set its slippage tolerance to an inordinately high 10%, resulting in one user losing about $100,000 in value. The Blast team says they’ve fixed it.\n\nBut, sandwich attack surprises aside, most depositors at least know that all assets will be locked until the proposed optimistic rollup launches in February.\n\nDepositors to the Beacon Chain, too, knew that their ether would be locked up for at least a couple of years — though it wasn’t clear when exactly The Merge and subsequent enabling of staking withdrawals would happen when many aped in.\n\nUltimately it took until April 2023, by which time about 18 million ETH (about $33 billion at the time) were deposited.\n\nIn the interim, there was a rapid growth in liquid staking, with Lido becoming the dominant player in early 2022, and already nearing a third of all staked ether by May 2022. It has remained between 29% and 33% ever since, keeping the project at the center of a debate about centralizing market forces on Ethereum.\n\nThe total percentage staked through Lido currently stands at 32.28%, and Blast — which uses Lido exclusively — isn’t helping.\n\nHow much of a problem that is, depends on who you ask.\n\nSome will analogize the concentration of ether stake to the preponderance of the Go Ethereum (Geth) execution client for Ethereum node operators. A great deal of social coordination was needed to bring down the market share of Prysm on the consensus layer, which reduces risks to the network as a whole. Geth is currently at 84%.\n\nClient diversity is widely seen as one of Ethereum’s strengths, a hallmark of its resilience through decentralization, which is unmatched in crypto. Indeed, decentralization and resilience are often seen as synonymous.\n\nLoading Tweet..\n\nThat’s why some are concerned about the Blast-fueled tick up in Lido’s stake share.\n\nBut for others, it’s a feature, not a bug. Blur and Blast investor Izebel.eth stated the “3 line pitch” for Blast is that “[Ethereum] would be better if everyone used stETH…so we use the bridge as a forcing function.”\n\nLoading Tweet..\n\nOf course, the “bridge” is not really a bridge, while it can only be crossed one way. And forcing people into a harmful position isn’t doing them any favors.\n\nLoading Tweet..\n\nIt’s generally good advice to be wary of promises from backers that something can “reshape the fabric of society.” That’s not just “ambitious” — it’s hubris.\n\nNone of the more academic discussions ultimately matter, though, when you have gamification as your selling point. And, maybe there are bigger fish to fry.\n\nIn any case, Lido has more TVL — approaching $20 billion — than any other DeFi protocol by a country mile. And Blast is bigger than Base — in third place behind Arbitrum and Optimism according to L2Beat — while now hiring software engineers, much to the amusement of crypto Twitter.\n\nPlenty of folks in this industry idolize the free market; so if that’s your modus operandi, then the market has spoken, for now.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxOSEFkeVRjUk1DY3RaaWRCMW9leWozNkRROWY5Y0JvejdBc2VodkZhdU12Mk1maFczWERSZXVBQjFULTdpdzRrTkdSa3JwLVhlMDRhRGg2SV9TeEwtbnNmVFYyaDNHalNlQU5nTHREVmFJdHFmOFNDMnJkb21qOHY1SEMzTG9xLVEx?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "The Best Crypto Investment: GameStop Memes Beats BNB and Ethereum ROIs with a $4 Million Presale Surge - Tekedia",
        "content": "When we talk about the dynamism of the cryptocurrency world, we are in for a great ride on the excitement of potential gains and the ever-evolving market dynamics that make investors’ choices harder and harder. So, today, we will explore the strategies and impacts of three amazing digital assets: Binance Coin (BNB), Ethereum (ETH), and the current innovator, GameStop Memes (GMS).\n\nIn this article, we will shed light on whether these three currencies will be a successful investment in the world of cryptocurrencies in 2024, especially after the $4 million presale of GameStop Memes.\n\nBNB Sees Surge in Popularity\n\nIn the first corner of our crypto battlefront, we have Binance Coin (BNB), the native cryptocurrency of the world-renowned Binance exchange. BNB has been a prominent player in the crypto space, known for its utility and versatility. Originally launched as an ERC-20 token on the Ethereum blockchain, BNB transitioned to Binance’s native blockchain, Binance Chain, through a coin swap.\n\nBinance Coin’s primary function is to fuel transactions and interactions within the Binance ecosystem. Users can utilise BNB to pay for trading fees, transaction fees, and even goods and services from merchants that accept them. This utility has solidified BNB’s position in the crypto market and continues to evolve.\n\nOne of the key factors driving Binance Coin’s popularity is its participation in various Initial Coin Offerings (ICOs) and token sales on the Binance Launchpad. This has allowed investors to access promising projects at an early stage, potentially reaping significant rewards, which means it is likely to be a good investment in 2024.\n\nEthereum: An Uncertain Investment in 2024?\n\nIn the opposite corner, Ethereum (ETH) stands out for its groundbreaking approach to blockchain technology. While Bitcoin primarily focuses on digital currency, Ethereum takes a broader perspective.\n\nLaunched by Vitalik Buterin in 2015, Ethereum introduced the concept of smart contracts, enabling developers to create decentralised applications (DApps) and customise blockchain solutions. This innovation opened doors to a wide range of applications beyond traditional finance.\n\nHowever, Ethereum has grappled with scalability issues. Its current infrastructure struggles to handle a high volume of transactions efficiently. This has resulted in high gas fees and slower transaction processing times, limiting its potential; therefore, Ethereum may not be a good investment in 2024.\n\nGameStop Memes’ Disruptive Entry to Crypto\n\nNow, let’s shine the spotlight on the disruptor of the hour, GameStop Memes (GMS). Inspired by the GameStop saga that made headlines, GMS takes the meme culture to new heights by turning popular internet memes into tradable assets.\n\nGameStop Memes’ strength lies in its community-driven ethos. It thrives on the collective enthusiasm of its users, who come together to celebrate and invest in their favourite memes. While it may not possess the technological sophistication of Ethereum or the dominance of Binance Coin, it introduces an element of fun and community spirit to the crypto space.\n\nMoreover, GameStop Memes made a significant mark by amassing an impressive $4 million during its presale, signifying growing interest and support for this meme-inspired cryptocurrency. While its long-term impact on the crypto market remains uncertain, it undeniably injects excitement and unpredictability into the scene.\n\nWe’ve explored the strengths and strategies of Binance Coin, Ethereum, and GameStop Memes in this crypto battle. Binance Coin excels in utility and participation in token sales, Ethereum pioneer’s innovation with its smart contracts, and GameStop Memes adds a playful twist to the world of crypto.\n\nSo far, the GameStop Memes method seems effective and distinct after achieving $4 million in presale.\n\nInvest in GSM while it’s still in presale!\n\nWebsite: https://GameStopmemes.com/\n\nTwitter: https://twitter.com/GameStopopMemes\n\nTelegram: https://t.me/GameStopopMemes\n\nShare this: Facebook\n\nTwitter\n\nWhatsApp\n\nLinkedIn\n\nEmail\n\nPrint\n\n"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxONmlNeFgxMzhjd25fVnYzOEo4MGtxUFVocEZSbF9wTEhJWVpUbElvRXJKTWtRZllGTF93dHREeVdwdkF1b1pfMW8zTTFyZ3pUZXJnQ3dsVWQzY2d1akRBV3UxeTVESGZNSGZFTzM5OVZzQ28weHl6UXJQVlF1eHVrMnVYSnIxZHQzWTBDMXBKTks3LVdtdlhUZkxWTlo2cHpVLTd3OEpYcnRkMkd2ZVRTTjJLOENxQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "How to make cryptocurrency bridges from the BSC network to ETH or vice versa - The Cryptonomist",
        "content": "In this article we will see how to perform a cryptocurrency bridge from the Binance Smart Chain (BSC) cryptographic network to the Ethereum Mainnet (ETH), or vice versa.\n\nThe bridge represents a cross-chain transfer of digital currencies between different blockchains that, by their nature, cannot overlap and must travel on different roads.\n\nTo carry out this type of operation, we can rely on both non-custodial solutions and custodial ones.\n\nThe former maintain the component of decentralization, typical of those who want to operate in complete privacy and in a trustless mode, while the latter represent a valid alternative for those who handle large amounts of capital and prefer to enjoy greater protection in terms of cybersecurity.\n\nLet’s see below all the details.\n\nCrypto bridges from BSC network to ETH or vice versa: the best protocols\n\nOne of the most popular solutions for bridging cryptocurrencies from the Binance Smart Chain (BSC) to the Ethereum Mainnet (ETH), or vice versa, is to use decentralized interoperability applications.\n\nWith this specific genre of protocols, crypto such as BNB, USDT, and USDC can be easily transferred between the two networks, which due to their nature normally cannot communicate.\n\nTo use them, it is essential to have a non-custodial crypto wallet, such as Metamask or Trustwallet, and be familiar with the practices and operations typical of web3 and DeFi.\n\nAmong the most quoted and reliable applications in the specific case of the BSC to ETH bridge, we find: Stargate, Meson, Symbiosis, Orbiter Finance, and Layerswap.\n\nAll of them represent a quick and economical option that with a few minutes of waiting and a handful of dollars, will allow your tokens to teleport between blockchains.\n\nFurthermore, the liquidity on them is sufficient to guarantee the perfect functioning of operations. Stargate is by far the most popular platform in this regard, to the point of recording a volume of over 220 million dollars in the bridges of the last 30 days involving the BSC.\n\nIt is estimated that the entire cryptographic network during the same period supported a total volume of 349 million dollars across all existing applications\n\nIts dominance is largely due to speculation about an alleged LayerZero airdrop that could be released specifically to Stargate users.\n\nNow let’s see practically how to perform a bridge from BSC to ETH, using the platform just mentioned as a reference.\n\nThe mechanism is identical in any other solution, with the only difference that some cryptos may be available for transfers on one platform rather than another.\n\nOnce we have entered the official Stargate website, we go to the “transfer” section, select the type of currency we want to transfer, and select the sender and recipient networks.\n\nLet’s enter the total number of tokens to be bridged and click on the “transfer” button.\n\nAs in the following example, after a few minutes the USDT sent from BSC will be visible on ETH and can be used immediately within this ecosystem.\n\nObviously, like any operation on blockchain, this one also incurs commission costs, which in the case of the bridge from BSC to ETH can reach a few dollars, while from ETH to BSC it could sometimes exceed even more than 20 dollars (it depends a lot on the gas cost on Ethereum).\n\n\n\nThere are actually applications like Sushiswap, which have implemented the so-called “cross-chain swap”, which allow you to simultaneously execute a swap between two tokens while they are being transferred from one chain to another.\n\nWithdrawal of crypto from exchanges as a secure custodial solution for cryptocurrency bridging\n\nAnother method to bridge cryptocurrencies between the BSC and ETH networks is to use centralized exchanges as a support base to deposit funds from one network and withdraw them from the other. This is not a true bridge, but it still represents a very valid alternative solution.\n\nIf, for example, you have some USDT on the BSC on the Metamask wallet and you want to transfer them to ETH, you could make a BEP-20 deposit on an exchange like Binance and then withdraw the same USDT as ERC-20 on Ethereum to the same starting address.\n\nBy doing so, you give up the factors of decentralization and privacy to enjoy some advantages such as increased security.\n\nUsually those who use this bridging option do so because they handle significant volumes and do not want to expose themselves to the risks of third-party non-custodial platform smart contracts.\n\nDecentralized bridges are indeed the most vulnerable web3 environment to cyber attacks par excellence, where the funds of many users have been compromised in recent years.\n\nConsidering that in this niche, in just over 3 years hackers managed to steal about 2.75 billion dollars, which is a little over a third of all thefts that occurred in the entire crypto world.\n\nIn this regard, just a few days ago the Heco Bridge managed by the famous Justin Sun, was hacked for 86.6 million dollars\n\nTransferring your cryptocurrency to CEX minimizes counterparty risk in this type of protocol, relying solely on the reliability of the exchange in question.\n\nIt is also worth noting how this option can solve the potential “problem” of high gas fees on Ethereum in the case of the bridge from ETH to BSC, significantly reducing commission costs compared to interoperability applications.\n\nThe best exchanges to carry out this type of operation are Binance, Bybit, Okx, Crypto.com, Bitget, Kraken, Kucoin.\n\nBefore making the first deposit, make sure that the platform you are using supports the tokens you want to transfer and the networks you want to rely on."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE9xTE1WOHpObks2cXhSa3pOb1Q2MXBuVXZ2RVJTTkV4b1dzeXhwc05mX2lrTHZMY3dLNnhZRFE4dkJkOGFJdzBxbXlTOTJ2QV92YVRlUHNJTFpQYk5zZjZfYXBjdl9hSG9PNkRaeUV0T2NaeWJ5Njdsa3I4UmXSAYIBQVVfeXFMT3hWTkoxQmc4RElHT3g0dW9iNEc3UzNESXlVN3lCMkdzTHRpby1qZ3hhanhuUzlhWGpyZVdBblNFNjZERFo4TEtvc3RUNXZBS2pQOTNSZ3lYSnB1UmdiX0J1UWswMDN2UmZkYzZnQ1FMcWZPLUZJbVpOOHMyYm9wdlQ4UQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 02 Dec 2023 08:00:00 GMT",
        "title": "Shiba Inu's Shibarium Just Did Something Absolutely Crazy - U.Today",
        "content": "Advertisement\n\nShibarium, the Layer-2 scaling solution for the Shiba Inu cryptocurrency, has set a new record by processing a staggering 7.4 million transactions in a single day.\n\nThis milestone is part of a broader surge that saw the platform handle over 12.5 million transactions in just two days.\n\nThis is a significant turnaround for a network that appeared dormant (or even borderline dead) just weeks ago.\n\nShibarium's stunning comeback\n\nShibarium has recently experienced a stunning resurgence, contrasting sharply with its previous state of inactivity.\n\nAdvertisement\n\nIn the past few days alone, the network recorded an impressive transaction volume, with nearly 35,000 transactions on Tuesday and over 29,000 on Wednesday.\n\nThis peak in activity is the highest since Oct. 25, when Shibarium processed a then-record of 62,000 transactions.\n\nEarlier this month, Shibarium had shown signs of increasing activity, but the recent spike surpasses all expectations. This revival is particularly noteworthy given the platform's earlier struggles, where it saw days with fewer than 10,000 transactions.\n\nModerate impact on SHIB's price\n\nDespite Shibarium's exceptional performance, the excitement has not translated into a significant spike in the value of SHIB.\n\nThe meme coin, which is the second-largest of its kind, has seen only a modest increase of 2.5% in its price over the last 24 hours.\n\nThe current market data show SHIB priced at $0.00000852, with a 24-hour trading volume of $134,747,522.\n\nAlthough Shibarium's achievements are noteworthy, they have yet to make a substantial impact on SHIB's market cap or its position on investor watch lists."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxObTVPMV92NC1pUXEyT2FlS3pWWHRnazE4RUtTWjB3cG53WUpqdWlqU09aVm1Wam1Gd1llYkg2YWxmSlF2WmI2UGdtLVlmRkk5UlE4b3lWLWdvOTcwV3l6S2ppcHdHR3FaY0x0RUx5U3lfbUhSQmlsVVNEVG1aQW5ETmtCT1JPTnA1OGJCTVZjX0FpMDJqOW5tVnZORmFUSmpPczdtUV9iNzFIc3h0clFr0gG0AUFVX3lxTE10QzktRTBZX2N0LUJvZ0YtR1RacTJqeVFEa0JtYUhYNlVpVzk3LWFlOVlZWTlUZ2JEbUlCOFdVTkxnWFhWSS1CajZ3M2JWZWNHT1BlNFBnN3pNZzQ5cVFhcTUzUDVJYi1hM2xtczVxRk5TQ29vaHNtckpuUEFpVHJBM3FxVjJTclpILTF3OWNBM2JaTUg5bmVrVXk1UUtpSV9LeDhTUHY2Ql9yNWptbkxrTVNSVQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Beyond Ethereum: Unveiling the Potential of Innovative Blockchain Ecosystems - Coinpedia Fintech News",
        "content": "Sara is steadily working on cryptocurrency evaluations, news, and fluctuations in digital currency prices. She is guest author associated with many cryptocurrencies admin and contributes as an active guide to readers about recent updates on virtual currencies.\n\nOver the past decade, Ethereum has established itself as the leading blockchain platform, revolutionizing the world with its bright concept of decentralized applications (dApps) and smart contracts. However, as the blockchain industry continues to evolve, new and innovative ecosystems are emerging, challenging Ethereum’s dominance. In this article, we will explore the rise of these alternative blockchain ecosystems and shed light on the Ultima ecosystem, which stands out as a prime example of innovation and potential.\n\nEthereum’s Strengths and Limitations\n\nThere’s no denying Ethereum’s groundbreaking contributions to the blockchain industry. With its robust smart contract capabilities, Ethereum has enabled the creation of a vast ecosystem of dApps and DeFi protocols. However, Ethereum has faced significant challenges, particularly in terms of scalability and high gas fees. As the demand for dApps and DeFi projects grew, Ethereum’s network congestion became apparent, leading to slower transaction times and exorbitant fees.\n\nThese limitations have impacted the user experience and hindered the scalability of the Ethereum ecosystem. Additionally, the switch to staking, while promising in theory, has raised questions about whether it has truly lived up to users’ expectations and the actual rewards it offers.\n\nThe Emergence of New Blockchains\n\nAs Ethereum grapples with its limitations, alternative blockchains have emerged, aiming to provide solutions and compete for market share. Binance Smart Chain, Solana, and Polkadot are a few examples of these rising stars challenging Ethereum’s dominance and aiming to provide solutions to the scalability and cost issues.\n\nHowever, among these alternatives, the Ultima ecosystem has garnered attention for its unique offerings and outstanding features. Ultima is building a comprehensive ecosystem of blockchain products and introduces the DeFi-U platform, which aims to revolutionize decentralized finance and provide users with a seamless and efficient experience.\n\nUltima: The Innovative Blockchain Ecosystem\n\nAt the heart of the Ultima ecosystem lies a commitment to innovation and cutting-edge technology. Compared to Ethereum, Ultima boasts faster transaction processing of the Smart Blockchain it is built on, setting new parameters for speed and efficiency. Additionally, the ecosystem offers lower transaction costs, making it more cost-effective for users to engage in various activities.\n\nULTIMA, the native token of the Ultima ecosystem, implements a halving mechanism to increase its scarcity and value. This strategy reduces the rate of new tokens entering the market by half every 10,000,000 blocks, ensuring a controlled supply and preventing inflation. Currently, slightly over 50 ULTIMA tokens are coming off the block daily. In 2024, this number will decrease to 25, and by 2028, the daily supply will reach just 1 token, introducing scarcity and potentially driving up the token’s value over time.\n\nThis scarcity-focused approach encourages early adoption and creates a sense of urgency for participants to engage with the platform and acquire ULTIMA tokens. Early adopters and long-term holders of ULTIMA tokens can benefit from potential price appreciation and access to ecosystem advantages. Ultima has plans to expand the ecosystem with future products such as a crowdfunding platform, marketplace, cryptocurrency debit card, UltimEx cryptocurrency exchange, and Ultima Travel Club. These additions aim to make the Ultima ecosystem comprehensive for its user base, which already exceeds 3 million users worldwide.\n\nUltima’s flagship product, DeFi-U, is a delegated liquidity pool that allows users to activate profit in ULTIMA tokens. The splitting mechanics of rewards distribution offers split licenses for lifelong benefits in ULTIMA tokens through blockchain technology and smart contracts, allowing both experienced and new users to engage directly with blockchain technology. Unlike Ethereum’s complex staking process, splitting simplifies participation, attracting a wider user base and promoting active ecosystem engagement.\n\nWhat’s Wrong with Staking?\n\nEthereum, which initially operated on a Proof of Work (PoW) consensus mechanism similar to Bitcoin, has since transitioned to a Proof of Stake (PoS) mechanism following the Ethereum 2.0 upgrade, also known as the “Merge.” This update has been eagerly awaited and discussed for a long time because it raised a lot of hopes.\n\nHowever, as time went on, there occurred some challenges associated with staking. One of the main reasons why the tech hasn’t become massively adopted was its complexity, for staking requires users to lock their tokens directly on the blockchain with operators or validators.\n\nStaking tokens can be risky due to factors like slashing and penalties, client software bugs, and unstaking periods. Trustworthiness is crucial when choosing a validator, and different teams should be used to maintain the software. The bear market has negatively impacted public perception of staking, making it essential to choose trustworthy and reliable validators.\n\nWhy Splitting Is Better Than Staking\n\nThe splitting technology offered by Ultima presents several advantages over traditional staking mechanisms, which may make it more appealing to both experienced cryptocurrency enthusiasts and newcomers. Here’s a detailed comparison of why splitting could be considered better than staking:\n\nAccessibility and Ease of Use: Traditional staking often requires a certain level of technical knowledge and understanding of blockchain technology. Ultima’s splitting tech is more appealing to both experienced and newcomers. It simplifies the process by allowing users to acquire SPLIT tokens via a license and smart contract, making it more accessible to the average person without technical expertise.\n\nLiquidity Concerns: Staked tokens are often locked up for a certain period, reducing liquidity and limiting users’ ability to respond to market movements. With splitting, daily rewards in ULTIMA tokens are claimable after 24 hours, offering more flexibility and potentially higher liquidity.\n\nPrice Volatility: Cryptocurrency markets are known for their volatility. Staking rewards are typically in the form of the native token, whose value can fluctuate widely. In the case of splitting, the combination of a halving mechanism with a limited supply of ULTIMA tokens is designed to potentially increase token value over time, which could offer a more stable reward system.\n\nLongevity of Rewards: With splitting, users receive daily rewards for the rest of their lives as long as they hold SPLIT tokens in their Smart Wallets. This model provides a clear, long-term benefit structure, whereas staking rewards may vary based on changes in protocol rules or tokenomics.\n\nCommunity Growth and Token Scarcity: The Ultima ecosystem is designed to grow with its community, and as more people use ULTIMA tokens, the market supply decreases due to the halving mechanism and limited token supply. This could potentially drive up prices and make rewards more valuable over time, benefiting early adopters and consistent participants.\n\nExpanding Horizons: Shaping the DeFi Landscape\n\nAs the blockchain space continues to mature, new ecosystems are emerging, challenging Ethereum’s dominance and offering innovative features and solutions. The rise of innovative blockchain ecosystems, such as Ultima, showcases the potential beyond Ethereum. With its cutting-edge technology, user-centric approach, and unique advantages, Ultima is poised to shape the future of decentralized finance, providing users with a more accessible, secure, and efficient DeFi experience. As the blockchain landscape continues to evolve, embracing these innovative ecosystems will unlock new opportunities and possibilities for individuals and the broader blockchain community."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiVkFVX3lxTE1MYmg0MEVFcjJCZ3EzQWZOaFk2QVhuVUxoTmZ1LWwwX0k4a3BtUmNfanJnalM4WjBydVM2RkU2dlNoOG1qYUw5aF9qRU5MQTNzUVlGVlNB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Top Crypto Games to Watch in 2024 - CryptoTicker.io - Bitcoin Price, Ethereum Price & Crypto News",
        "content": "The world of crypto gaming is rapidly evolving, and 2024 is set to be an exciting year with several innovative games on the horizon. Here’s a look at top crypto games that are generating buzz and are worth keeping an eye on.\n\nMyria is a decentralized gaming platform on Ethereum’s Layer 2, leveraging ZK roll-up technology for almost instant transactions, no gas fees, and complimentary NFT creation. This platform hosts over 250 external gaming projects and boasts a user base exceeding one million. The native token of Myria, MYRIA, serves various purposes including governance, staking, in-game functionality, and covering protocol charges. With a capped supply of 50 billion tokens, MYRIA’s distribution encompasses ecosystem funding, node incentives, project advancement, liquidity support, and a strategic reserve. Additionally, Myria has collaborated with famed cricketer AB de Villiers and introduced its inaugural game, Metarush. Over the past month, the value of Myria in US Dollars has surged by 131.00%. In the same timeframe, MYRIA has experienced a 103.47% rise when compared to Ethereum, and a 110.25% increase relative to Bitcoin. REVV\n\nThe REVV token, an ERC-20 utility token, serves as the primary currency across various gaming dApps created by Animoca Brands. Every game within the REVV Motorsport ecosystem is built on the Play-and-Earn principle. This means that players can not only enjoy diverse and engaging gameplay but also have the opportunity to earn rewards simply by participating in the games. REVV (REVV) functions as a utility token and in-game currency for blockchain-based motorsport games by Animoca Brands. It plays a crucial role in sustaining the in-game economies of F1 Delta Time, MotoGP Ignition, and REVV Racing. These games are designed around a play-to-earn model, rewarding players with cryptocurrency earnings for their active engagement and contributions within the game environment. Players earn REVV by participating in various activities such as time-trial races, grand-prix tournaments, staking race cars, and earning dividends from owning tracks. This digital currency can be used for purchasing non-fungible tokens (NFTs) and covering entry fees for gameplay within these virtual worlds. As outlined in the official light paper, a condensed version of a whitepaper, the first sale of the REVV token took place in September 2020, shortly before the launch of F1 Delta Time in December 2020. It was later integrated into MotoGP Ignition and REVV Racing following their launches in March 2021 and August 2021, respectively. In the past month, the value of REVV in US Dollars has surged by 205.00%. Compared to Ethereum, REVV has shown a 163.52% increase, and it has risen by 175.40% when measured against Bitcoin in the same one-month period. Illuvium (ILV)\n\nIlluvium, a groundbreaking open-world fantasy battle game, is developed on the Ethereum blockchain. It stands out as Ethereum’s first AAA-level game, blending entertainment for both casual players and dedicated DeFi enthusiasts with its unique collection and trading elements. In the game’s universe, players encounter mystical creatures called Illuvials. These creatures, once defeated and healed by the players, join their collection, loyally assisting in battles against other players in the game’s auto battler feature. Illuvium combines the thrill of open-world exploration with the strategy of PVP battles. Players can either traverse the vast game world or focus on assembling a formidable team of creatures. The development of Illuvium, which began in 2020, is led by a global team of over 40 professionals. This includes co-founders Kieran Warwick, a seasoned entrepreneur and early crypto adopter, and Aaron Warwick, a skilled game designer. Interestingly, they are also siblings of Kain Warwick, the co-founder of the DeFi platform Synthetix. Within the Illuvium ecosystem, the ILV token serves multiple purposes. It rewards players for their achievements, grants access to the Illuvium Vault, and allows participation in the game’s governance through the Illuvium decentralized autonomous organization (DAO). Over the past month, the value of Illuvium in US Dollars has seen a significant rise of 125.00%. When compared to Ethereum, ILV has experienced a 94.28% increase, and against Bitcoin, it has gained 103.16% during the same time frame. Nakamoto Games (NAKA)\n\nNakamoto Games offers a diverse range of engaging and rewarding crypto games on its play-to-earn platform, poised to capitalize on the growing trend of crypto gaming. This platform is designed to benefit both gaming enthusiasts and those new to gaming, with significant earning potential. The goal is to create a hub that appeals to both players and game creators. For developers, the platform provides essential tools to develop, launch, and monetize their gaming projects. The platform focuses on creating a comprehensive ecosystem dedicated to play-to-earn games, rather than just a single offering. Regularly introducing new games, Nakamoto Games ensures a dynamic and ever-evolving gaming experience. This keeps the platform fresh and exciting for gamers. Additionally, it also encourages third-party developers to integrate their games using its SDK, further expanding the variety and quantity of games available on the platform. Seedify.fund (SFUND)\n\nSeedify.fund (SFUND) operates as a specialized incubator and launchpad dedicated to blockchain gaming. It supports innovators and project creators by providing funding, fostering community connections, and building partnerships. This comprehensive support system is designed to propel the advancement of gaming and blockchain technology. Additionally, Seedify’s ecosystem encompasses an NFT launchpad tailored for gaming and metaverse assets. It also features the pioneering NFT marketplace in the industry, Seedify NFT Space, focused on gaming and metaverse assets. Seedify features an IGO (Initial Game Offering) launchpad with a tiered allocation system, allowing $SFUND token holders to stake their tokens. This staking not only yields rewards but also grants access to select blockchain gaming projects via private sales and IGOs. The launchpad’s structure includes nine tiers, with Tier 1 operating on a lottery-based allocation, while Tiers 2 to 9 offer guaranteed allocations to participants. In addition to IGOs, those staking in Seedify can engage in initial NFT offerings (INOs) and initial metaverse offerings (IMOs) through the Seedify NFT Launchpad. Moreover, staking $SFUND opens up the possibility for holders to receive tokens from various projects incubated and backed by Seedify. Over the past month, the price of Seedify.fund in US Dollars has seen a substantial rise of 176.00%. In the same period, SFUND has gained 138.71% when compared to Ethereum and has increased by 149.23% against Bitcoin. Netvrk (NTVRK)\n\nNetvrk is a blockchain-based social virtual platform where users can create and earn from their own digital content. Within the virtual reality environment of NETVRK, the NETVRK token serves as a currency for purchasing various assets. These assets range from buildings and vehicles to houses and numerous other items available in the NETVRK marketplace. Netvrk’s innovative model is a harmonious blend of sustainability and reward, designed to revolutionize the virtual reality landscape. At its core, the Netvrk Reserve system functions as the financial backbone, supporting the ecosystem’s diverse needs. The governance of this digital metaverse is overseen by the Netvrk DAO, ensuring a decentralized yet orderly environment. Central to all transactions within this virtual world is the Netvrk Token, establishing a unified currency standard. Embracing the mantra “Decentralize Wisely, Entertain Always,” Netvrk offers a dynamic and engaging virtual reality experience. The $NTVRK token is the key to unlocking a myriad of assets in this digital realm. Users can immerse themselves in interactive buildings, engage with various gameplay assets, personalize their experience with unique avatars, explore in virtual vehicles, and much more. Netvrk seamlessly integrates real-world concepts with web3 applications, offering a new dimension of virtual interaction. In the realm of LAND, users can engage in the buying and selling of virtual real estate, holding onto valuable virtual commodities. Advertising space within this digital universe opens avenues for generating recurring income through on-selling ad space. The world of NFTs in Netvrk is particularly vibrant, allowing users to create, purchase, and sell virtual assets, fostering a thriving C2C (customer-to-customer) environment where services can be facilitated and custom monetization strategies can be developed. This ecosystem is not just a virtual space but a hub of endless possibilities, blending entertainment, commerce, and community in a uniquely digital experience. In the past month, the value of Netvrk in US Dollars has surged by an impressive 410.00%. When compared to Ethereum, NTVRK has experienced a substantial increase of 339.88%, and against Bitcoin, it has risen by 359.67% during the same one-month period. DeRace (DERC)\n\nDerace positions itself as a comprehensive NFT horse racing ecosystem, aiming to redefine the standards of the GameFi industry. It offers users the chance to purchase and breed distinctive NFT horses, equip them with various items, and even construct their own NFT hippodromes for hosting races. The project initiated its Initial DEX Offering (IDO) on DAO Maker on July 16, 2021. Following this, the beta version of DeRace was rolled out on December 28, 2021. The complete second version (V2) of the game is scheduled for release in the third or fourth quarter of the year. DeRace sets its sights on revolutionizing two major industries: video gaming and horse racing, both of which are worth billions. The project identifies a significant gap in the market due to the scarcity of video games offering sustainable play-to-earn mechanics. Concurrently, it addresses the challenges faced by the horse racing sector, which include corruption issues and a lag in digital advancement compared to other sports. DeRace is poised to address these issues, bringing a fresh perspective and innovative solutions to both fields. In the last month, the price of DeRace in US Dollars has seen a substantial increase of 150.00%. During the same period, DERC has risen by 115.74% when compared to Ethereum and has gained 125.45% against Bitcoin. EPIK Prime (EPIK)"
    }
]