[
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxNRExwcjlPX2hldXQ1ZngtcHhycWpxdTRiTkxod0QxTE5NWGJSMnZjRHVfZ3hrdWUza21lam1kVG8zRmhKcVZtWFNKQ0tYZGlqNWI3N1hPZlNkNmtKai1YdkhKdTBLZjBfaXRaWmFybHBqLUtHQ0RsZ0YycEpmZGFyTHllWFZsU05PWUdKbU5fR183ZTJMSFZhUTNBZzFwOUJQVjNBX0hsVzV3cUxtLXRFNDkwR2YtZHI1d0VUNHY1UHJQdHfSAcgBQVVfeXFMTmkycVlDbWJHZmtVNzhSMEFhVWI4Q09QVW1KR3lHYWZKWldNLXZYbHZVbzVTTDFYaGR2eExMTjNLVTRXRFdfNUtUaldhVFBEbVA1RnJZYjZKdjN6a1pwcUxZOW4xLVpJQXdhbExhdlFRcV85QzJDQ2dPeWVEcXVNSFd2WkZGQjNlMHpYUzFJYTBVdVF4eTloaE1SeFI5cUt6Q3VNT3FuVVNsVU5oeXlwLWpYSE5BeVFnRWdtcGpjNG1nUFh0LTBkdkQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Price Prediction: ETH attempts to flip $2,300 into support - FXStreet",
        "content": "Ethereum price is on a tear, consolidating within a bullish technical formation that promises more gains if sustained.\n\nETH could rise 5% to convert the $2,300 resistance level into a support floor before continuing its upward trajectory.\n\nThe bullish thesis will be invalidated upon a daily candlestick close below the $2,143 support level.\n\nEthereum (ETH) price has been consolidating within an ascending parallel channel since the broader market turned bullish around October 18, pushing north with key drivers including speculation of spot Ether exchange-traded funds (ETFs) launching in the market.\n\nAlso Read: Ethereum price breaks past $2,000 as BlackRock hints at filing for spot Ether ETF\n\nEthereum price eyes 5% rise above the $2,300 support\n\nEthereum (ETH) price is trading with a bullish bias, sustained by an ascending parallel channel. This technical formation promises and delivers more gains for the asset as long as it remains within its confines. However, based on the current outlook, the largest cryptocurrency by trading volume looks ready for a breakout after one attempt already.\n\nTechnical indicators show that Ethereum price still has some upside potential, with the Relative Strength Index (RSI) inclined north at 69 to show momentum is still rising. Its position below 70 is good, suggesting ETH is still not overbought nor ripe for a correction.\n\nSimilarly, the Awesome Oscillator (AO) remains in positive territory with green histogram bars. This points to a strong presence of bulls in the Ether market and could bode well for Ethereum price, depending on how the bulls play their hands.\n\nIncreased buying pressure above current levels could see Ethereum price breakout above the upper boundary of the chart pattern, confirmed by a flip of the $2,300 resistance level into a support level. This would set the tone for Ether to continue its upward trajectory.\n\nETH/USDT 1-day chart\n\nOn-chain metrics support Ethereum price bullish outlook\n\nMultiple on-chain metrics support the bullish thesis for Ethereum price, including the dwindling deposit transactions and the volume of exchange inflows. As a spike in deposit transactions would indicate a rise in short-term selling pressure, the absence thereof shows investors do not have the intention to sell.\n\nThis outlook is corroborated by dwindling exchange inflows, suggesting investors are not moving their ETH holdings to exchanges. There is no effective intention to sell in the near future.\n\nETH Santiment: Deposit transactions, exchange inflows\n\nFurther, the Tether (USDT) stablecoin market capitalization is rising, suggesting fresh capital inflow into the Ether market, interpreted as the intention to buy. The ensuing buying pressure could inspire a prolonged uptrend for Ethereum price.\n\nETH Santiment: USDT market capitalization\n\nConversely, if selling pressure increases, possibly as investors start booking early profits after such a striking climb, Ethereum price could pull south. In such a directional bias, ETH could lose the confluence support between the midline of the channel and the horizontal line at $2,143. A break and close below this level would invalidate the bullish thesis.\n\nFurther south, Ethereum price could extend the fall, potentially going as low as the $2,029 support before a foray into the supply zone turned bullish breaker. A decisive candlestick close below the midline of this zone at $1,935 would confirm the continuation of the downtrend."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxPdXotOHNNLUpQUVJFSjcxTVZvbmJfS3B6Yi16eEZ3Q0g0T2stdXNlMHRJSnE0WXhpSi1vT2Z3STlmVGxwMmF1aWRlYnZZS1VmbXFaWXRZMUhGaDZPM2o2YXJwS0N3ZzJ2UlBTWXVVV0FQX1NIRlJUYl9mZG5vZVlpNldyMUw0dkljNEZfZTBaT01uQTJhTVAyV21BVllCd0QxV1FUUnVlT05EbFFxbWpKM29lTVFjQTJTb2ZkQUZ6SkxoWVFZMEVRbUhwOWROdjQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Dec 2023 08:00:00 GMT",
        "title": "Analyst Says Ethereum Price Will Hit $28K Following BlackRock ETF Approval as BTC ETF Token Presale Passes $2M - CryptoPotato",
        "content": "Ethereum will skyrocket in price should BlackRock’s Ethereum spot ETF gain the SEC’s approval, according to analysts. This will result in more than 10x growth based on its current price.\n\nMeanwhile, the Bitcoin ETF Token presale recently hit $2m as analysts provide 10-100x price predictions.\n\nUnprecedented Institutional Captial Anticipated as Key Price Driver\n\nEthereum’s price experienced a notable spike in November when the world’s largest asset manager, BlackRock, doubled down on its crypto efforts, filing for an Ethereum exchange-traded fund.\n\nIf approved, the ETF would be listed on Nasdaq, opening the door to a broad new audience previously deterred from buying ETH for technical, security, or liquidity reasons.\n\nThis would propel cryptocurrency to a legitimate investment opportunity, even for traditional investors. As such, it is no surprise that Ethereum’s price is rising in anticipation, currently at $2.09K, up 15% in the last month.\n\nYet, some analysts are significantly bullish on where Ethereum could be headed in the upcoming market cycle.\n\nIn a breakdown on TheStreet, prominent analyst Austin Arnold said, “The largest asset manager in the world, BlackRock, is now backing both Bitcoin and Ethereum,” suggesting this is of monumental importance for the assets’ future.\n\nHe then considered BlackRock’s assets under management (AUM), how much it may allocate to the ETH ETF, and how this could impact the asset’s market cap.\n\nArnold then discussed a bull case following the ETF approval, contemplating Ethereum could climb to highs of $41,000. However, he stated, “I do not see Ethereum getting that far.”\n\nInstead, the analyst sees a more realistic prediction being $28,000, or $10,000.\n\n“Whether it’s $28,000, $45,000, $10,000, I’d be happy with anything, but I’m a long-term holder,” Arnold concluded.\n\nOne of the factors that he highlighted was the difference in Bitcoin’s and Ethereum’s structure, tokenomics, and utility. He explained, “One’s digital gold, it’s aiming to be a store of value. While Ethereum is like digital oil, used to power a global, decentralized supercomputer, build apps. Just like a car needs gasoline to be able to run, Ethereum is the gas that makes the system work.”\n\nThe analyst also referenced Ethereum’s burn mechanism, which makes the token deflationary by destroying a small part of each transaction fee. Coupled with the incoming ETF liquidity inflows, Arnold believes this could significantly bolster its price.\n\nHowever, he understands there is a ceiling to how far it can go in the next market cycle. “$10,000 ETH is the most realistic scenario,” he said.\n\nThis represents less than a 5x gain from its current price. While this is a significant return for those with large portfolios, it is unlikely to render sufficient returns for those with limited financial resources.\n\nOne alternative with a lot of upside potential is Bitcoin ETF Token, a new trending presale that has raised over $2.1 million in three weeks amid the BlackRock hype.\n\nStake-to-Earn Bitcoin ETF Token ICO Hits $2M Milestone\n\nBitcoin ETF Token is a compelling new project that rewards holders in line with key Bitcoin ETF milestones.\n\nThe project has allocated 25% of its total supply to be burned as Bitcoin ETFs reach five main targets, creating a sense of scarcity and fear of missing out (FOMO) when the hype is highest.\n\nIt also features a 5% burn tax on transactions, reducing by 1% at each milestone. This incentivizes people to hold longer and ensures explosive price action following the project’s IEO.\n\nThese factors make Bitcoin ETF Token deflationary, introducing the scarcity principle into the project, which has been a key driver for Bitcoin’s parabolic price action since its launch in 2009.\n\nAnother exciting factor is its staking mechanism, rewarding its community and incentivizing users to lock up their tokens, further limiting the available supply.\n\nHolders can garner a 118% staking APY, but they must be quick because this decreases as more users stake their tokens.\n\nThe project has experienced significant success lately, with top analysts providing massively bullish predictions. Jacob Bury speculates it will 10x after its launch, while Crypto Boy believes it could 100x.\n\nVisit Bitcoin ETF Token Presale\n\nDisclaimer: The above article is sponsored content; it’s written by a third party. CryptoPotato doesn’t endorse or assume responsibility for the content, advertising, products, quality, accuracy, or other materials on this page. Nothing in it should be construed as financial advice. Readers are strongly advised to verify the information independently and carefully before engaging with any company or project mentioned and do their own research. Investing in cryptocurrencies carries a risk of capital loss, and readers are also advised to consult a professional before making any decisions that may or may not be based on the above-sponsored content.\n\nThe project in the above article is not related to Bitcoin or to a Bitcoin ETF. It’s a completely different token.\n\nReaders are also advised to read CryptoPotato’s full disclaimer."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMi9wFBVV95cUxNVXdxM1AwQnhoM0ptUl9yY09Tbm5wOEZVVDBSRjNEakpNZmhQbmlHQU1XdS1ucVcxQU5VbmNCcXFOT1Y5RXp6X3hUTzdEZGYwendGaHVpcE9LdHBoRDBQWFZ6YUljUkR1WUEzUzVkYlJ0X283X0pxU3RDbGZmOHk1RGZMeEFUdm9LQ0kwN3gybnZuQnlVMUlENm5iMlJUNVZvcVUwM3dlMXZGcjNaNC1EcHJUTGlMTDBrVnhXSHM5UzZFSHpZNVVvU1Q0Q3c2WDdZelVjQUktZVpZNnctSHpOWUxxQ1FXVzNVdjJjRjBUMVVoOHJGLTh30gH8AUFVX3lxTE0tRXVEcjVhZ1hlMWdXeG1ZRmg5aWwwZDRRblFkazR0elNzYUtSTklHUFRpRW9aM0FWdmJtWm1qZm5xX0prYTFUMVdRcFVxanNtcXozVEhoZWFFV0RhbFpNeWF6UjYtMWZBZkNOOFpYZkNhRXdOWnBkZUswcTJMT1ZfSjdOdTMtbHRQZFJpOE54NGg4N25JTzVueG1ETFdlbW5oUVA2VzJZeThiVUxIb05qYjh0V0Jkc0xOc01LVFBZWXRMOVhya2x4ckFHUXN1aEtCZVVzWF9YeDFLVjZZU3MzV2pObkNMa2pLXy1UZ24xV290UEx5Z2VhZEh2Yg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Dec 2023 08:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: BTC headstrong as Spot ETF talks reach technical stage - FXStreet",
        "content": "Bitcoin price could flip $43,860 into a support floor, bringing the $50,000 psychological level into view.\n\nEthereum price could climb 7% to the $2,500 level as bulls show determination.\n\nRipple price could extend 10% north as bulls make a comeback in the XRP market.\n\nBitcoin (BTC) price remains steadfast on the higher timeframe, amid news that spot BTC exchange-traded funds (ETF) discussions are now at the technical stage of approval. Specifically, talks with Spot BTC ETF issuers have advanced to key technical details, with Reuters indicating that it could signal a shift toward a potential approval.\n\nAlso Read: This is the level to beat as Bitcoin eyes $50,000 next\n\nBitcoin price could overcome $43,860\n\nBitcoin (BTC) price is confronting the $43,860 critical support, marking the midline of a weekly supply zone extending from $40,698 to $46,999. A decisive candlestick close above this mean threshold on the weekly timeframe would confirm the continuation of the primary trend, flipping the supply barrier into a bullish breaker and using it as the springboard for a race to the $50,000 psychological level.\n\nThe Relative Strength Index (RSI) remains northbound despite BTC being overbought, indicating momentum continues to rise. Meanwhile, the histogram bars of the Awesome Oscillator (AO) remain in positive territory, flashing green to show that bulls are leading the BTC market. These bolster the case to the upside.\n\nBTC/USDT 1-week chart\n\nOn the flipside, if the supply zone holds as a resistance level, Bitcoin price could face a rejection, deflecting south to lose the support offered by the $40,000 psychological level. In a worse case, the fall could extend to the $30,000 psychological level, with a weekly candlestick close below this level invalidating the bullish thesis.\n\nAlso Read: Bitcoin price hits $44,000 as Coinbase CEO speculates BTC could be key to extending Western civilization\n\nEthereum price could climb 7%\n\nEthereum (ETH) price action remains bullish since mid-October, consolidating within an ascending parallel channel. This is a bullish technical formation, promising more growth as long as the asset’s price remains within its confines.\n\nWith both the RSI and AO indicators supporting the bullish outlook, Ethereum price could rise 7% to the $2,500 level last tested in May 2022.\n\nETH/USDT 1-day chart\n\nConversely, should profit-taking kick in, Ethereum price could fail to realize the $2,500 target. The ensuing selling pressure could see ETH dwindle to lose the $2,147 support.\n\nEthereum price could then extend a leg down, converting the midline of the April 18 supply zone extending from $2,049 to $2,107 from a resistance area into a support area by breaking and closing below its midline at $2,075. A daily candlestick close below this level would not only invalidate the bullish thesis but also confirm the continuation of the downtrend.\n\nAlso Read: Ethereum Price Prediction: ETH attempts to flip $2,300 into support"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMibkFVX3lxTE5tMEhzUlVXZk9ibEsyd0RZZC1MNlZCeUlVZnZvUXFlbXFIakVkcUU4WGJWanE5YkRsUlNKVVN2YkdCZmRqOWhZTTdhQjFZd3ZrRXN5YWlfbVhiaVl1SWVZU1h6Umt3RmVlcHMzbU5B?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Dec 2023 08:00:00 GMT",
        "title": "Mantle offers ‘mETH’ to the masses, as a ‘lighter weight Lido’ - Blockworks",
        "content": "After nine months in development, Ethereum layer-2 network Mantle has launched its second core product, Mantle Liquid Staking Protocol (LSP).\n\nThis new protocol, deployed on Mantle and Ethereum mainnet, introduces a non-custodial and permissionless ether liquid staking solution, Mantle Staked Ether (mETH).\n\nMETH acts as a value-accumulating receipt token within the Mantle LSP, very similar to Lido’s staked ether (stETH). Mantle aims to achieve the highest sustainable core yield by exploring maximal extractable value. It also shares yield from the Mantle treasury, according to a statement released Monday.\n\nThe idea for mETH came from Mantle “alchemist” Jordi Alexander, chief information officer at Selini Capital.\n\n“We’ve just created a lighter weight, more modern Lido,” Alexander told Blockworks. He champions the idea of offering a native staking yield on an Ethereum layer-2. The premise is “we should do all of DeFi, but first start by having the 5% yield,” he explained.\n\nThis is the same promise of the planned Blast layer-2, which has attracted deposits of ether (ETH) and stablecoins now topping $750 million over the past two weeks.\n\nBlast, despite its rapid growth and ambitious plans, faces scrutiny over its security model and the centralization concerns related to its reliance on Lido.\n\nRead more: Did Lido fly too close to the sun? Inside the centralization debate\n\n“Kudos to the Blast team because it’s the same idea that I had but just a very different implementation,” said Alexander, who has been advising Mantle since March and serves on investment and treasury committees.\n\n“I was pretty excited [when Blast launched] because they’re educating the market on this idea” of having native staking yield available for DeFi on a layer-2, he said.\n\nThe Mantle LSP development process represents a more traditional, structured approach with a focus on security and integration within its ecosystem.\n\nThe team decided to build a solution from scratch, but also talked to Lido about the idea of white labeling their infrastructure.\n\n“We talked to everybody — we literally went through every single [liquid staking team] out there — including Lido of course — we had multiple chats with them to decide [if] there [is] a way that we can take the easy way out,” Alexander said, adding “we decided to go the hard route, and it’s taken many months to do it properly and get all the audits and everything.”\n\nThe various components of the Mantle LSP have been audited by Hexens, MixBytes, Secure3 and Verilog, and the contract upgradeability is the responsibility of the Mantle Security Council, a 6 of 12 multisig, which is also used for maintenance of the Mantle Network itself.\n\n“If you trust Mantle, it’s the same security,” Alexander said.\n\nUnlike Blast, Mantle LSP doesn’t force anyone to stake or bridge. METH will work just fine on Ethereum mainnet and Alexander stressed that it is an independent product from the Mantle Network.\n\n“There’s some people that just want to stay on [Ethereum] mainnet and we do want to cater to them as well,” but, he adds, “I expect that most of it eventually will get incentivized to move because we’ll make it really juicy to ship it over.”\n\nThese incentives can be seen as a vampire attack on Lido, which Alexander says should appeal to members of the Ethereum community concerned over excessive Lido centralization.\n\nWhat’s cooking in “the mETH lab”?\n\nThe Mantle team has a number of ideas in the works to expand upon the LSP’s use within its network, which will be proposed to holders of the MNT governance token in the coming weeks.\n\nMNT is also used to pay transaction fees on the Mantle Network.\n\nAlexander originally considered mETH as a good candidate for the Mantle gas token — “like a self-replenishing gas,” he said — but ultimately Mantle’s mainnet launch schedule led to the introduction of MNT.\n\nThe team might consider a dual gas token model, make use of account abstraction to reduce user friction, or outline other new utilities for MNT.\n\n“I think we’re going to have it be sort of like ATOM where you get airdrops and it’s kind of like a launch pool token,” Alexander said, referring to the native asset of the Cosmos Hub.\n\nHe agrees with the critique that Ethereum has too many layer-2 networks proliferating, suggesting that most lack a creative new idea.\n\n“Is there something unique or some imagination that’s gone into it instead of just deploying a tenth version of Aave and just doing the same USDT pair or whatever?” he asked rhetorically.\n\nAnd as for the name and its natural association with illicit drugs?\n\n“We’re going to try to just lean into it. I’m going to launch an unofficial meme contest on my Twitter.”\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxQaW1TYzJmdUtfVGkxSVo2RTlha3BSbW52ZGtyUVVjWTcwR3FnNFNqOXEwQk0xQ0k5Rk5rU0Z6MnU3elJoU0tnQklDZmowSkVfRUhKMXdWNG1zTmt2blpibmtqSzBGM2NOT25JVkFqYzlvTE42VlhLNWZDbnpfT2ZyaDZmSVFUSmI5Z0dhTTVIaUgzVnpYd1B2ZVYxUHdtcVk4TmtFWlR4VjViUjhy?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Dec 2023 08:00:00 GMT",
        "title": "Binance looks to boost FDUSD adoption with fee-free trading for Ethereum, XRP, others - CryptoSlate",
        "content": "Binance has expanded its free trading options for the spot and margin trading pairs of the First Digital USD (FDUSD) stablecoin pairing with six digital assets, including BNB, Dogecoin, Chainlink, Ethereum, Solana, and XRP, according to a Dec. 5 statement.\n\nBinance users will see zero maker and taker fees for these pairs starting Dec. 8 for an undisclosed period. The exchange explained that the free trading option would exclude these pairs from BNB fee discounts, rebates, and other adjustments.\n\nHowever, the firm stated that it “reserves the right to disqualify trades deemed to be wash trades or illegally bulk account registrations, as well as trades that display attributes of self-dealing or market manipulation.”\n\nBinance is actively pushing FDUSD.\n\nThe free transaction promotion is part of Binance’s ongoing efforts to encourage its users to use the FDUSD stablecoin.\n\nLast week, the crypto platform said it would phase out support for Binance USD (BUSD) by Dec. 15. Binance urged users to convert their BUSD holdings into the new stablecoin before the end of the year, saying it would end BUSD withdrawals by Dec. 31 and that BUSD balances would be automatically converted to FDUSD.\n\nBinance’s decision relates to the BUSD stablecoin’s regulatory issues. Earlier in the year, the BUSD issuer, Paxos, suspended the stablecoin issuance following scrutiny from U.S. regulators. At the time, the company received a Wells Notice from the U.S. Securities and Exchange Commission (SEC), which classified the stablecoin as a security.\n\nWhile Binance and Paxos have vehemently rejected this classification, the crypto community promptly deserted the stablecoin, with its circulating supply dropping to less than $2 billion as of press time, according to CryptoSlate’s data.\n\nConcurrently, Binance has been heavily pushing FDUSD as a viable alternative, introducing new products for the digital asset and incentivizing its use. However, FDUSD’s circulating supply remains less than 1 billion and is only available on less than five crypto exchanges.\n\nMentioned in this article"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxON0duaWJic05YYVdjVnJSejdKNUZKa0wteE44bHZiNXR2TG13SF9vTWJ1N095Y19rMERDLXY0RG1EVE9OdE9UQjVZS2xsM2dMazVTTE5ILXhEbDV5U2tIRXRob3QxRVdiRGZkMHlkbE5veklkOVRhRThTNjJBZEZKTDE5OElqeXNjd3YxVWJjTDJJa1lFcHdUQzR5aE9PNVhmTF9FNzY5N0ZHZDU4d2N2am5Va0tMZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Dec 2023 08:00:00 GMT",
        "title": "Mantle introduces mETH liquid staking protocol, expanding its Ethereum-based DeFi ecosystem - CryptoSlate",
        "content": "Mantle, the DAO-led web3 ecosystem, today unveiled its Mantle Liquid Staking Protocol (LSP) as a key addition to the Mantle Ecosystem, offering users a novel way to engage with Ethereum’s proof-of-stake (PoS) validator network, according to a statement shared with CryptoSlate.\n\nThe Mantle LSP is a permissionless and non-custodial Ethereum (ETH) liquid staking protocol, functioning on Ethereum L1 and governed by Mantle. It stands as the second core product of the Mantle Ecosystem, following the Mantle Network L2. Mantle posits that the introduction of Mantle Staked Ether (mETH), a value-accumulating receipt token, is a pivotal step in their protocol.\n\nMantle detailed that the genesis of Mantle LSP began with a proposal in a Mantle forum on July 14, 2023. Following the acceptance of the Mantle Governance Proposal MIP-25, the staking of Mantle Treasury ETH was sanctioned, leading to the phased deployment of Mantle LSP. This process culminated in the protocol’s full operational launch on Dec. 4, transitioning it into a Permissionless Mode.\n\nMantle LSP distinguishes itself by offering instant and sustainable rewards. Users staking ETH receive mETH, a token embodying their staked value and accumulated rewards, while also unlocking additional yield opportunities within the Mantle Ecosystem. Mantle states that the ETH to mETH exchange rate is deterministically calculated, thus mitigating the impact of stake size on slippage. Furthermore, mETH is available for trade on various exchanges, with its pricing governed by market dynamics.\n\nMantle emphasizes that their protocol underscores a commitment to user experience, security, and yield optimization. Mantle states its LSP features a streamlined architecture, focusing on the ETH to mETH conversion process on L1, and avoids complexities associated with other PoS tokens and chains. The protocol’s design incorporates robust risk management strategies, including non-custodial core smart contracts and off-chain services that impose strict risk limits. Additionally, Mantle LSP’s security framework involves dividing responsibilities among various roles, ensuring the safeguarding of staked ETH within smart contract addresses.\n\nWith the launch of Mantle LSP, Mantle intends to enhance its DeFi offerings by exploring the adoption of mETH across various applications within its ecosystem and beyond. This expansion aims to bolster the utility and efficiency of mETH, contributing significantly to Mantle’s growth in the DeFi space.\n\nThe broader Mantle ecosystem, anchored in Ethereum technology, now includes the Mantle Network, an Ethereum layer 2 (L2) solution, Mantle Governance, a decentralized autonomous organization (DAO), and Mantle Treasury, one of the largest on-chain treasuries. The ecosystem is facilitated by the Mantle token (MNT), which serves as a product and governance token.\n\nMentioned in this article"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxPYV9nczBLaktGdVpBcmpMWTI0V3EwLW1yczNCRVFuY1llVWFfRHFKTHJud0V2V0lSbTBhc2RQdjRlSDBQTVhTLWs1SFlUckxHQ1g0cHg5QXRPSy03YTBhbjNLaUxFdS1Nd0NPYi1venV1WkJ2MVp2dy1rOVB6ejZkX0RhZGU3NGFaSjRfYy1QVUc1bVQyQWhXUktJWjdyMGtXd0dnOUhtcmQ5SExocVJoNV9DbGtzVzdLSG8zbU5hbHZFelNObGRwWlEza3k?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Dec 2023 08:00:00 GMT",
        "title": "Crypto Analysts & JP Morgan Bullish on Bitcoin Mining - Ethereum-Based Bitcoin Minetrix Nears $5 Million In ICO - CryptoPotato",
        "content": "With Bitcoin mining stocks surging, analysts and even legacy banks like JPMorgan Chase are increasingly bullish on the sector’s prospects.\n\nMeanwhile, the Ethereum-based project Bitcoin Minetrix (BTCMTX) is nearing $5 million in its ongoing initial coin offering (ICO), thanks to the buzz around its innovative Stake-to-Mine model.\n\nThe Bitcoin Mining Sector – A Brief Overview\n\nBitcoin mining is the process of using specialized computers to solve complex math problems that validate transactions on the Bitcoin blockchain.\n\nIn return, miners earn BTC as a reward – providing an incentive to continue mining.\n\nDuring Bitcoin’s early days, mining was possible on regular home computers.\n\nHowever, as the Bitcoin network has grown, mining has become increasingly competitive, spurring an arms race in mining hardware development.\n\nThe introduction of ASIC mining rigs has enabled industrial-scale Bitcoin mining operations, helping the mining sector balloon to a multi-billion dollar industry dominated by large firms.\n\nAlthough the sector’s energy consumption has raised environmental concerns, recent innovations have begun to focus on boosting efficiency in a greener way.\n\nMoreover, these concerns have led to the exploration of alternative energy sources like solar, wind, and hydroelectric power in BTC mining operations.\n\nAccording to a report from Industry Research Co., the entire crypto-mining market was valued at $4.2 billion in 2022 and is expected to reach $4.7 billion by 2028.\n\nAnalysts & JPMorgan Bullish on Bitcoin Mining Stocks\n\nSeveral analysts, and even huge financial institutions like JPMorgan, are growing increasingly optimistic about the prospects of companies that operate in the crypto mining space.\n\nCleanSpark ($CLSK), in particular, has attracted bullish praise recently.\n\nIn a recent research note, JPMorgan called CleanSpark its “top pick” among mining stocks, citing its “scale, growth potential, power costs & relative value.”\n\nOn Twitter, crypto analyst UltraXBT expressed confidence in CleanSpark at current levels, claiming it’s a “$25 stock that is currently identifying as a $4.50 stock.”\n\nMeanwhile, ThoughtfulTrade on Twitter noted that a Bitcoin breakout above $46,000 could spur the price of mining stocks like CleanSpark to soar even higher.\n\nWith BTC mining profitability improving due to the crypto market’s recovery, firms like CleanSpark that leverage low-cost power stand to capitalize.\n\nMoreover, the upbeat outlook from JPMorgan and analysts reflects the growing optimism around the Bitcoin mining space in general.\n\nBitcoin Minetrix Platform Introduces Innovative Stake-to-Mine Model & Raises $4.8 Million\n\nWhile Bitcoin mining stocks like CleanSpark offer indirect exposure to crypto prices, a new altcoin project called Bitcoin Minetrix (BTCMTX) aims to reinvent mining rewards through staking.\n\nThe Ethereum-based Stake-to-Mine protocol allows users to earn regular BTC rewards by staking BTCMTX tokens rather than purchasing expensive hardware.\n\nBitcoin Minetrix’s protocol works by distributing “mining credits” to those who stake BTCMTX, which can be exchanged for cloud mining power.\n\nIn turn, this democratizes access to BTC mining by lowering the barriers to entry – meaning anyone can get involved.\n\nThe Stake-to-Mine mechanism also enables considerable staking yields, with current APYs exceeding 120%.\n\nUltimately, by reinventing mining rewards and making hash power more accessible, Bitcoin Minetrix has the potential to transform the crypto-mining space.\n\nOn the back of strong interest surrounding its unique value proposition, Bitcoin Minetrix’s team recently launched a presale for BTCMTX.\n\nThe presale aims to raise funds to develop and scale the Stake-to-Mine platform further.\n\nMore than $4.8 million has already been raised from eager investors, with BTCMTX tokens available to buy for $0.012 each.\n\nOnce the presale concludes, Bitcoin Minetrix’s team plans to list BTCMTX on leading centralized exchanges, enabling seamless trading for speculative investors.\n\nWith strong presale momentum and backing from high-profile names like VoskCoin, BTCMTX seems poised to make a splash when public trading begins.\n\nVisit Bitcoin Minetrix Presale\n\nDisclaimer: The above article is sponsored content; it’s written by a third party. CryptoPotato doesn’t endorse or assume responsibility for the content, advertising, products, quality, accuracy, or other materials on this page. Nothing in it should be construed as financial advice. Readers are strongly advised to verify the information independently and carefully before engaging with any company or project mentioned and do their own research. Investing in cryptocurrencies carries a risk of capital loss, and readers are also advised to consult a professional before making any decisions that may or may not be based on the above-sponsored content.\n\nReaders are also advised to read CryptoPotato’s full disclaimer."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxPS3FFaFFJRnJIVEFQOHJveGF5YXlzQzY0LThnTThSdDZUZUtLd1RmTVlYdjBUbVZBM2cwa0k2UzNtUEN2cUkzVkJ2WTd1Vk5oaDZOU2ZnbVp1LUltbDMtOXNKdnFLOElUOUM4b09HVXhXRDUyUWtMWXlxbGdYUFJKajN1c0NvZUtHRWFkVEdpNHFqMmhYN0RhZkZmOA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Dec 2023 08:00:00 GMT",
        "title": "Spain detains aristocrat who allegedly recruited Ethereum developer Virgil Griffith to help North Korea - DLNews",
        "content": "Spanish officials detained Alejandro Cao de Benos, a Spanish aristocrat.\n\nHe allegedly enlisted Ethereum researcher Virgil Griffith to help North Korea evade sanctions.\n\nSpanish officials detained on Thursday a pro-North Korea political activist aristocrat accused of aiding North Korea in circumventing international sanctions through crypto, according to a statement by the Spanish police.\n\nAlejandro Cao de Benos, the founder of advocacy group Korea Friendship Association, was indicted last year by US authorities for allegedly recruiting Ethereum researcher Virgil Griffith to unlawfully provide crypto services to North Korea.\n\n“Such accusations are totally false. There is not a single piece of evidence that proves that I hired or solicited the services of Virgil Griffith,” Cao de Benos said in a public statement posted Sunday on X.\n\nThe police said investigation for his location began in mid-October, when the agents received a tipoff from Interpol indicating that Cao de Benos could be in Spain.\n\nCao de Benos was released after a one-day detention.\n\n“It is a disgrace that the US empire abuses Interpol and Spain to carry out what is purely political persecution,” he said.\n\nEthereum researcher Virgil Griffith\n\nGriffith, a former Ethereum Foundation researcher, was arrested in 2019 after a trip to North Korea to allegedly consult the regime on how to use crypto to evade international sanctions.\n\nHis keynote speech at the Pyongyang conference allegedly contained information on how to bypass sanctions, according to the US Department of Justice.\n\nJoin the community to get our latest stories and updates\n\nBut Griffith’s advocates and his legal team have argued that the presentation did no more than recapitulate widely available information, which could be readily accessed online.\n\nGriffith’s lawyer said that the trip was “the culmination of Virgil’s unique and unfortunate curiosity and obsession with North Korea.”\n\nHe received a 63-month prison sentence last year after pleading guilty to a charge of conspiring to violate the International Emergency Economic Powers Act. The act forbids US citizens from exporting goods, services, or technology to North Korea without a licence from the Treasury’s Office of Foreign Assets Control.\n\nHis lawyer told the Wall Street Journal that Griffith was “sincerely remorseful.”\n\nChristopher Emms dodges the bullet\n\nBritish national Christopher Emms was also charged last year, alongside Cao de Benos, with the conspiracy to help North Korea access crypto. He had attended the same conference as Griffith.\n\nIn June, Emms said he received political asylum in Russia.\n\nAppearing on Russian state media RT yesterday, Emms called Cao de Benos’ detention “politically motivated” and said the “US government doesn’t like when someone stands up to them.”\n\nEmms told Blockworks last year that Cao de Benos contacted him through LinkedIn and invited him to the conference in Pyongyang.\n\n“I did the typical crypto bro thing: I googled it. I checked the Foreign Office website as a UK citizen. I checked the UN website and I didn’t see that speaking at a conference in North Korea was breaking any laws,” Emms said.\n\nThe North Korea trip was “incredibly naive,” Emms said, but “the way we [the crypto industry] approached things was so different than we would right now. There was a lack of clarity on so many things.”\n\nCrypto: North Korea’s ‘treasure sword’\n\nNorth Korea calls crypto its “treasure sword,” according to David Maxwell, senior fellow at the think tank Foundation for the Defense of Democracies, who spoke with DL News in April.\n\nNorth Korea’s crypto arm known as Lazarus Group has stolen at least $3.4 billion in crypto since emerging in 2007, according to calculations by DL News.\n\n“All the money [the North Korean hackers] cash out goes to fund their missile programme,” Erin Plante, vice-president of investigations at Chainalysis, told DL News in April. A report by Recorded Future last week said that North Korea loots enough crypto to fund almost half of its military budget.\n\nLast year, Lazarus hacked a record a $625 million in crypto, raiding the web3 game Axie Infinity.\n\nThat attack, said Plante, was “a turning-point event where suddenly the US National Security Council cared and wanted to hear about it.”"
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxQMTlNc1phY0g4bXpwQW5jX2JWd2RwMklOWm8yd0QwNXU4QThvc3RYZzhOWmhRRV9DYzZ3VEg1bDl2aExMWGhnVVliVHZUUjhXa3hLeWs5d29KQ2lQY1h2UGlMTEJnUHVTNWtIeE1DSFpENEt3TkdGS2RGdHpKRjRLdUROSGdwcWlFVnBXRzlrUllsamI5V0pZYVlXbHh3bWFPQVNLdE1WTHMybHBhclRpZzNYSknSAboBQVVfeXFMTm1HeGlkZjgzbXFBMEJ5UnBhUWlGNkdkY3B3WFY1emVBSmRweFR0UEtOZHFWdEdHcXBINGs3emJMMFVjVDZMZFlLUmRteTQxb3ZlWEVZVDFvZVZpM01vZ1lCYldBaVpPZ1BHeGN0R3hhSDBDWlVPdGxpTE44Mk5admwwbmVJU09KdG1vZGR5d09xMnN2Y015NEFFTGF4MnpUcUd3UlRfVVlRZ3RDdU9iYkdyVTBiclNqXzFR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Dec 2023 08:00:00 GMT",
        "title": "Martin Köppelmann Is Fighting to Keep Crypto Tech on Track - CoinDesk",
        "content": "Köppelmann's first blockchain company, Fairlay, grew into the largest bitcoin-based prediction market before he sold it. \"Over the years I became quite skeptical about bitcoin in many ways, but certainly, in that period, I was kind of a bitcoin maximalist,\" said Köppelmann. \"I quite quickly concluded that bitcoin is awesome because it shows other forms of money are possible, but the concrete form of bitcoin is not necessarily what I believe is the best for humanity.\""
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxQVVNPR3Bsd1pxajRGbmVaZ0hzRlFpZ2k0ZmZEd1oxTDV3Y0c4NHRtVTRhRXd3WXFUS1gzc29wM2dEVFpER25WQjhvUXRwVUJiQ3JkNVVCQnhKeFdHSG1XWWJpVG95XzFFWkR6NXFOaWsyZnZqWkdhWUZ3cUt5Z2EtT29EWVRNTV96NTdRVGtoZW1SeEI4UEhrYThxSFpFR2xtYXkycFhFTWhLRFl4Q0ZYMUFlMnZuaGRa?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Dec 2023 08:00:00 GMT",
        "title": "How a Photographer Missed Out on $8 Million for This Portrait of a Crypto Billionaire - PetaPixel",
        "content": "Being a freelance photographer is not easy. Chasing invoices, dealing with late payments, the list goes on, but very few have ever missed out on a payment of $8 million that was rightfully theirs.\n\nBut that’s what happened to photographer Andrew Miller after he took a portrait of Vitalik Buterin, who co-founded the cryptocurrency Ethereum and went on to become the world’s youngest crypto billionaire.\n\nLong before Russian-Canadian programmer Buterin made the Forbes rich list, Miller, a self-confessed gamer geek, had taken a keen interest in the enigmatic programmer and approached him with a portrait idea around the same time Buterin was launching Ethereum. Buterin agreed, but back then he was cash-strapped so one of his investors came up with the idea of paying Miller in the upcoming Ethereum currency.\n\nMiller paid for the shoot at his own expense — which included dinner, a photo assistant, and a makeup artist — and agreed to be paid in the initial coin offering so long as it was the equivalent of the $1,200 CAD ($886) that Miller deemed to be the value of his photo shoot.\n\nThis is Where it Gets Interesting\n\nMiller tells PetaPixel that he was supposed to have been paid for the copyright of the photo during the initial coin offering when the price of Etherum was $0.31, meaning the photographer ought to have received somewhere between 3,225 and 3,600 Ether. Today, 3,600 Ether is worth nearly $8 million (10.8 million CAD).\n\n“I said if they started using it commercially they could pay me in Ether at the initial coin offering amount. They agreed in principle and would investigate how to get the coins to me through their execution of the offering. It was still a new process for them and theoretical,” Miller says.\n\n“I met them in Vancouver two weeks later at the 2014 Coinfest and hung around for lunch and other gatherings. I queried them on how payment would play out and Anthony [an investor] set me up with a Bitcoin wallet to demonstrate how one would send coins back and forth,” he continues.\n\n“It was always my understanding that I would receive Ether at the initial coin offering. I just thought that in the end, they didn’t use the image commercially. Everything was not traditionally public and the Ethereum website was sparse for photos.”\n\nSuffice it to say, Miller never received the cryptocurrency and after losing contact with Buterin, he was oblivious that his photo had been disseminated commercially. It was being used in news articles, memes, fan art, and even being sold as knock-off NFTs with zero credit given to Miller.\n\nDespite numerous attempts to reach Buterin, Miller has not heard from the Ethereum co-founder and now says he is “trapped in a situation where there is no response from Vitalik or the Ethereum organization.”\n\n“My portraits appear to have been instrumental in shaping the positive perception of Vitalik and contributed in some small part to Ethereum’s rise,” Miller writes in an article for DIY Photography.\n\n“Today, I am battling to gain attribution and recognition after the portraits became famous, leaving my name unspoken. The history of what I did for Vitalik was untold, and anyone looking back can see its value given the timing and what transpired afterwards. Any joy I took in seeing my photos fulfilling the role I originally intended was quelled when I learned that they had been used commercially by the Ethereum co-founders, who never fulfilled their end of the negotiation.”\n\nMiller stresses he has never issued an invoice, largely because if he does, Canadian law requires him to declare it as income immediately and pay income and sales tax on it regardless whether he’s received the payment or not.\n\nPetaPixel has reached out to Vitalik Buterin and Ethereum for comment but did not hear back ahead of publication.\n\nMore of Miller’s work can be found on his website and Instagram.\n\nImage credits: Photographs by Andrew Miller."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxPLWlMY0llMEdIdUdtUVoxaWxCbXBnbGhXWFNuVkNhOGVGT2o1MVRuWEZvczQ5ZW0yLVFBN05kMmpVYzFUekZHQUtIbWhCTklCMEc0TUtDNnhBMmlZdng4UFJiWDJkcWd3eWhYbHpfTTlXb21KSFpEcTVid1hwYUlZWVdHQ1NHUGhoUTJYRExDcTc5RE5QQUYyOUlIOTgxREd1T0JtQzRyTFBIanpRNVI3ZExWQXlwbnhGbU9ENzF30gHDAUFVX3lxTE51VWRuT0JiLUhydlE4Y0VIS25yZFEyc2VJVVN5SzlsejMta3Rrb1V6Qjl6RWl3U0xLaHQ3d2x4WkNCNHFNZDJrNmloZ3hhMERJdDBuNmJ6aGJvVkNFYWtmYWQwN1p2bXI3SkhPNVZqY1ZfdUdzdWpQaE1LNllfVGtpc1hXTFRnYWRLVW9PYW9PNzI1YzJnZTJ0WHZqanM0bjFlOVBOcGVDb25fWUZRbmRLM1c0YVM4R1RxRkV5UW9hWTUxdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Dec 2023 08:00:00 GMT",
        "title": "Trader Predicts Massive Solana (SOL) Rally to New All-Time High of $360 – Here’s His Timeline - The Daily Hodl",
        "content": "A popular crypto analyst thinks Ethereum (ETH) competitor Solana (SOL) could skyrocket to new all-time highs within the next year.\n\nThe pseudonymous trader known as Inmortal shares a chart with his 202,700 followers on the social media platform X that projects SOL surging to $360 by the beginning of 2025.\n\nInmortal’s chart predicts the sixth-ranked crypto asset by market cap will jump up to around $100 near the end of this year and then realize most of its gains in the second half of 2024.\n\nSOL is trading at $60.81 and is down more than 3% in the past 24 hours. The Ethereum competitor’s all-time high is around $260, which it hit in November 2021, according to CoinGecko.\n\nLooking at the peer-to-peer payments network Litecoin (LTC), Inmortal predicts the crypto asset could jump to around $90 by early 2024.\n\nLTC is trading at $72.38 at time of writing.\n\nIn terms of Bitcoin (BTC), the analyst says there could be a BTC price dip this week. Inmortal notes that $38,000 is the level where he wants to go long on the top crypto asset.\n\nBTC is trading at $41,894 at time of writing, its highest level since April 2022. The top crypto is up more than 6% in the past 24 hours and nearly 20% in the past month.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTFBUakx3THViSzVWV1o2c0EzY1JmZlNXYUZXSWVUa2dfc2lHeDlMdVpHcGVQdXNORndDemwtUW91RHpBa2RuRWNnZjdlUEZtaVBYcExTaWpqM1Q0QdIBX0FVX3lxTE9ObHE1bkNYdkVyTUxaUmp5cTFwd2w1ZXhDRWI5VzBIWDNVM0dOTklmWTNOWFROelhMdlgxNGFqVVloVlIyRXFqdjlyek9CcW9wMGlxbkRaWU82Um1Ic21R?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Dec 2023 08:00:00 GMT",
        "title": "Blur Captures 80% of Total NFT Trading Volume - NFT Plazas",
        "content": "Blur Captures 80% of Total NFT Trading Volume\n\nIn the ever-changing NFT realm, the Blur marketplace is surging ahead, claiming a whopping 80% of the total trading volume of non-fungible collectibles.\n\nDespite OpenSea once being the dominant player, the marketplace’s share has dwindled to 17%. Blur has been overriding OpenSea since February, which has led to Blur dominating nearly 80% of the Ethereum-based NFT landscape.\n\nWhile other marketplaces like LooksRare and X2Y2 exist in the NFT ecosystem, they garner just a minimal portion of the market’s monthly trading volume, especially when compared to the key influencers Blur and OpenSea, which continue to command the lion’s share of NFT trades.\n\nA Wider Look into NFT Market Growth\n\nNovember signified a remarkable milestone for NFTs, garnering $605 million in Ethereum trading — an increase of more than 100% when compares to the previous month. This momentum is continuing into December, with trading surpassing $90 million and Blur’s marketplace contributing approximately $70 million of this amount.\n\nAlongside Ethereum, Solana-based marketplaces also witnessed an increase in trading activity last month and into December. On November 30, the total trading volume on Solana markets hit $9.3 million — an amount not garnered since April last year. Notably, the majority of these transactions were made on the Tensor marketplace, with daily Solana-based trades reaching around $5 million.\n\nAcross numerous blockchains (Ethereum, Solana, etc.), NFT projects such as Pudgy Penguins, Milady Makers and Mad Lads are spearheading this current NFT market upswing. And the excitement doesn’t end there: ongoing developments in the NFT realm will continue to present intriguing journeys for both NFT novices and established players alike.\n\nWant more? Connect with NFT Plazas Join the Weekly Newsletter\n\nFollow us on Twitter\n\nLike us on Facebook\n\nFollow us on Instagram *All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiZkFVX3lxTE5fYW9BcU4zc3VJd0NBdzQzcWVNOUJDTjM0V0VlTkxyY3cxR2hoenhvaGx6ODdjWEt0TXVvemxZYjFiYXJURWFIY3NaUm9KYkpPUXZPdlFFNGd3WTFaRE1KeEsyZFF6QQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Dec 2023 08:00:00 GMT",
        "title": "Ether vs Ethereum: The Key Behind Crypto Development - INDODAX",
        "content": "In discussions about the world of crypto assets, the role of Ether (ETH) and blockchain platform, Ethereum is very important and needs to be understood. Ethereum is a decentralized computing platform that executes computer programs known as smart contracts.\n\nIt has a native crypto asset called Ether (ETH), which is the crypto asset with the second largest market capitalization after Bitcoin. However, Ether is a crypto asset and a “gas fee,” enabling various decentralized transactions and applications or Decentralized Applications (dApps) to operate within the Ethereum ecosystem.\n\nAs a blockchain platform, Ethereum is known to have created the foundation for major innovation in the crypto world. By understanding the differences and relationships between Ether and Ethereum, we can avoid any misunderstandings that may arise. This means that Ether is not just a digital coin but also a key element that drives the economy on the Ethereum blockchain.\n\nSo, to understand what Ether (ETH) is, its role in the Ethereum ecosystem, the relationship between the two, and the latest trends and future projections for Ether, see the complete review below!\n\nWhat is Ether (ETH)?\n\nIt is important to know that the Ethereum blockchain is one of the oldest and most widely used blockchain networks. Ether, which functions as a gas fee, has become one of the leading cryptocurrencies after Bitcoin in terms of market value.\n\nAs explained at the beginning of this article, Ether is a native coin or native asset used in the Ethereum blockchain to facilitate transactions throughout its ecosystem. Every transaction in the Ethereum ecosystem requires payment of a computing fee (gas fee) to the miners who carry out the transaction computation. This payment is made using Ether.\n\nThese gas fees increase with the computational complexity required. For example, the shipping costs of ERC-20 tokens are higher than sending ETH because sending ERC-20 tokens uses interaction and computing on smart contracts while sending ETH does not involve such a process.\n\nETH has various uses as a digital asset and for carrying out various transactions in the Ethereum blockchain ecosystem. Please note that Ethereum has become one of the most widely used blockchain platforms for building dApps, along with its ability to support more programs than Bitcoin.\n\nAs a crypto asset, ETH has an important role as gas fees are paid to run computations on various applications developed on the Ethereum platform. This makes ETH one of the second largest crypto assets after Bitcoin when viewed from market value.\n\nWhen it was first traded, the value of one Ethereum coin was around $2.83 or around IDR 41,035. However, in June 2021, the price of ETH jumped to $2,578 per coin, or the equivalent of IDR 36,822,218. ETH’s highest price peak occurred in November 2021, reaching $4,620. However, in December 2022, the price of Ethereum will decrease to $1,225 per coin, or the equivalent of IDR 19,264,748.\n\nSo, if you are interested in buying ETH, you can purchase through a trusted crypto buying and selling application, namely INDODAX. As a platform, INDODAX has been officially registered as a Physical Crypto Asset Trader under the Commodity Futures Trading Supervisory Agency (BAPPEBTI) so that security is guaranteed. You can download the INDODAX application to buy ETH.\n\nThe Role of Ether in the Ethereum Ecosystem\n\nIt is important to understand that Ether (ETH) is important in the Ethereum ecosystem and is used for various purposes on the network. One of Ether’s main roles in the Ethereum ecosystem is as a digital asset.\n\nInitially, Ether was created as a digital asset for use on the Ethereum network. Most transactions and smart contracts are carried out using Ether. In this case, users can send and receive Ether within the Ethereum ecosystem.\n\nEther’s other main role is to pay transaction fees. Every time someone sends Ether or performs a function within a smart contract, they have to pay a transaction fee. These fees are known as “gas,” which is necessary to ensure that the Ethereum network runs efficiently and prevents network abuse.\n\nThe gas is a unit of measurement for measuring how much computing power is needed to complete a task on the Ethereum network. Smart contract transactions/execution require gas, and transaction fees are calculated based on the amount of gas used.\n\nOn the other hand, Ether also plays an important role in maintaining network security. Miners who process transactions and secure the network will receive rewards in the form of Ether for their efforts. This also provides incentives for miners to maintain network reliability and security.\n\nApart from that, Ether is also used as a store of value in the network’s decision-making process to create tokens and to run smart contracts on the Ethereum network. For example, ERC-20 and ERC-721 tokens are often created using Ether as “gas” to carry out smart contracts.\n\nEthereum Ecosystem: Beyond Ether\n\nAs previously explained, smart contract technology on Ethereum drives new innovations in financial transactions. The following are several examples of smart contract implementation that are currently underway including:\n\n1. Stablecoins\n\nCrypto asset prices are often very volatile. Stablecoins , which utilizes smart contract technology, also solves this problem. The value of stablecoins is held to the value of non-digital assets, such as the rupiah and US dollar, to maintain their stability.\n\nSome well-known stablecoins maintain stability by guaranteeing a 1:1 rate with the original currency and being convertible to that currency. For example, Rupiah Token (IDRT), a crypto asset on the Ethereum blockchain, has a value equivalent to the rupiah. IDRT creates a digital representation of rupiah by generating tokens in proportion to the amount of rupiah deposited by the user and sending them to the user’s Ethereum wallet.\n\nApart from IDRT, another example of a stablecoin, namely USD Coin (USDC), is designed to have the same value as the US dollar. The existence of stablecoins makes it easier for users to transfer value to various places around the world in a short time. Stablecoins also provide the stability needed in the crypto ecosystem and connect traditional financial infrastructure with the blockchain world.\n\n2. Borrow and Borrow on Ethereum\n\nSmart contract technology on the Ethereum blockchain also enables the development of crypto asset lending and lending applications. For example, AAVE and Compound are decentralized lending and lending Apps (dApps) based in the Ethereum ecosystem.\n\nWith AAVE and Compound, users can deposit crypto assets to earn interest or borrow other crypto assets. Using these two applications requires an Ethereum wallet and a certain amount of funds in the form of ETH or ERC-20 tokens. With AAVE and Compound, anyone can be involved in asset lending and lending activities without relying on banks or traditional financial institutions.\n\n3. Decentralized Exchanges (DEXs)\n\nDecentralized Exchanges (DEXs) are applications that facilitate token exchange using smart contract technology. One example of a very popular DEX built on Ethereum is Uniswap and Sushiswap.\n\nThrough DEXs, users can exchange ETH for ERC-20 tokens or vice versa and exchange between ERC-20 tokens. As long as it follows the ERC-20 token standard, various types of tokens can be exchanged using DEXs.\n\nThe Connection Between the Two\n\nEther (ETH) and Ethereum are interrelated concepts, but they have different roles in the Ethereum blockchain ecosystem. Ethereum is a blockchain platform allowing developers to create and run dApps. On the other hand, Ether is a crypto asset used on the Ethereum network.\n\nRemember that Ethereum is designed to support smart contracts, programming codes that can execute certain tasks when specified conditions are met. Ether is used as “gas” to carry out these operations, including executing smart contracts.\n\nOn the other hand, Ether is also used as an incentive for miners (or validators in the context of Ethereum 2.0), which helps keep the network decentralized and secure. Miners will receive Ether in exchange for adding blocks to the blockchain.\n\nEther is also used as a digital asset to carry out transactions within the Ethereum network. Every time someone sends Ether, it automatically reflects a transfer of value within the Ethereum ecosystem. Meanwhile, when someone runs or interacts with smart contracts, he must pay transaction fees in the form of Ether. This helps prevent network abuse and ensures that people who use network resources pay for that use.\n\nEthereum and Ether complement each other. Ether itself is essential to maintaining the functionality of the Ethereum network. Without Ether, executing transactions, implementing smart contracts, or ensuring network security would be impossible. The existence of Ether itself supports the Ethereum ecosystem by providing incentives for developers to create decentralized applications and for miners (validators) to keep the network safe and decentralized.\n\nHistory and Evolution\n\nThe history of Ether and Ethereum is known to have reflected a long journey towards the development of blockchain technology and the growth of the crypto ecosystem as a whole. Referring to its history, Ethereum was first proposed by Vitalik Buterin in 2013. It was an evolution of the idea to expand Bitcoin’s functionality by enabling smart contracts.\n\nThe funding for Ethereum development was obtained through an initial public offering (ICO) in 2014, where Ether (ETH) was first sold to investors. Furthermore, Ethereum was launched on July 30, 2015, with the launch of the first block, or “Genesis Block.”\n\nAs time passes, Ethereum 2.0 aims to move away from consensus Proof-of-Work (PoW) to Proof-of-Stake (PoS), which began to be developed to increase network scalability and efficiency. The first phases of Ethereum 2.0 are launched, and the transition towards PoS begins.\n\nFurthermore, the launch of Ethereum as a new blockchain platform and raising funds through ICOs is known to have played an important role in forming the modern crypto ecosystem. One of the important events that shaped their role in the crypto industry was when an attack occurred on Decentralized Autonomous Organization(DAO). In 2016, an attack on the DAO on Ethereum led to a massive theft of Ether.\n\nTo overcome the consequences of the DAO attack, the Ethereum community decided to carry out a hard fork, then created Ethereum (ETH) and Ethereum Classic (ETC) as two separate blockchain chains. Ultimately, efforts to improve network performance and security through Ethereum 2.0 and the transition to PoS are important steps in Ethereum’s evolution.\n\nThe Importance of Maintaining Both\n\nIt should be emphasized that Ether is the driving force in the Ethereum ecosystem. By maintaining its sustainability, Ether continues to support the execution of transactions and smart contracts on the network. This is important for maintaining blockchain functionality and allowing various decentralized applications to run. Apart from that, Ether also plays an important role in maintaining the resilience of the Ethereum network. Through incentives for miners (or validators in Ethereum 2.0), Ether ensures that the network remains secure, distributed, and resistant to attacks.\n\nFurthermore, Ethereum powered by Ether also plays a key role in driving innovation in Decentralized Finance(DeFi). Ether’s sustainability supports liquidity, collateral, and smart contract functionality that is the foundation for various DeFi projects, from loans to exchanges to other protocols.\n\nEthereum, which can run smart contracts, is known to have paved the way for various use cases, including finance, logistics, digital identity, and many others. Therefore, maintaining Ether is key to ensuring that innovation continues to develop in various sectors. On the other hand, Ethereum has also become the main platform for DeFi projects. The growth of DeFi is also one of the main factors driving wider crypto adoption, as it provides a decentralized alternative to traditional financial services.\n\nTherefore, it can be concluded that Ether and Ethereum play an important role in forming and maintaining the crypto ecosystem. Ether’s sustainability supports transactions, network security, and innovation within Ethereum, while Ethereum, as a platform, continues to drive the growth and broader adoption of blockchain technology. Both are interdependent and play an important role in driving the evolution of the global crypto ecosystem.\n\nRecent Trends and Future Projections\n\nThe latest trends in Ether and Ethereum can be seen from the development of Ethereum 2.0 and PoS. Development of Ethereum 2.0 itself continues, with a focus on implementing PoS to increase network efficiency and sustainability. Additionally, the DeFi sector continues to be a major trend within the Ethereum ecosystem, with the growth of projects such as lending protocols, decentralized exchanges, and liquidity mining.\n\nThen, there are also Layer-2 scalability solutions, such as Optimistic Rollups and zk-Rollups, which gained popularity to address Ethereum’s scalability challenges, enabling faster transactions and lower fees. Meanwhile, regarding future projections for Ether and Ethereum, with the continued development of Ethereum 2.0, future projections involve a swap from PoW to PoS, which is expected to increase network speed and efficiency.\n\nOn the other hand, the DeFi sector is also expected to continue to develop with more innovations, such as introducing more complex financial products, growing lending and borrowing protocols, and cross-chain solutions to increase interoperability. Ultimately, if Ethereum 2.0 successfully addresses scalability and transaction cost issues, then Ethereum will have the potential to play a role in revitalizing the global financial system, opening the door to greater financial inclusion and decentralized financial solutions.\n\nIntegrating blockchain and smart contracts on Ethereum could also bring major benefits to various industries, from supply chains to insurance, with the potential to reduce bureaucracy and increase efficiency.\n\nBuy Ethereum on INDODAX\n\nSo, now you understand what Ether (ETH) is, its role in the Ethereum ecosystem, the relationship between the two, and the latest trends and future projections for Ether.\n\nNext, if you want to buy Ethereum (ETH), you can do it at INDODAX. The following is a guide to buying Ethereum on INDODAX that you need to know:\n\nFirst, log in to your INDODAX account.\n\nThen, make a deposit (if the balance is still empty).\n\nContinue by visiting the INDODAX market, then search for Ethereum on the INDODAX market.\n\nNext, look for the trade column and enter the desired Ethereum price and balance amount. You can use the Instant method or the Limit method.\n\nAlternatively, you can immediately place a sell order at the price you determine after you have Ethereum. Make sure that the price is profitable.\n\nConclusion\n\nIn conclusion, Ether functions as a digital asset within the Ethereum network, allowing transactions and payment of network operational fees (gas). In addition, Ether also provides incentives for miners (or validators) to keep the network secure via PoW or PoS.\n\nMeanwhile, Ethereum provides a platform for running smart contracts that allow the creation and execution of programming code without third-party intermediation. Ethereum is the basis for a growing DeFi ecosystem and various dApps that create decentralized alternatives to traditional financial services.\n\nUnderstanding Ether and Ethereum is important to understand the functionality and usability of the crypto ecosystem. A deep understanding of Ether and Ethereum is necessary to participate effectively in the crypto ecosystem and recognize the transformational potential they can bring to various sectors and industries in the future."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxPR1p2U1d4RVdReFpsOTZBVVd4X0xQdzNyUVNWeEMzN0l4WjRILVBqRHF0YTduYzZoYXBzMzNOYWlRTEZyWmJ0WS1uRWFjVVVpdWVtajRPNUUyMVU3djA5Q1A4d0EwTkJfMFZRbEg4RWMzU2pTendfdGtSblRZN25jbWpPUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Dec 2023 08:00:00 GMT",
        "title": "What Is Sharding and How Does It Work? - Binance Academy",
        "content": "TL;DR\n\nSharding' splits a blockchain into smaller 'shards' to address the issue of scalability associated with Layer 1 networks.\n\nSharding improves transaction speeds, minimizes processing and storage costs, and enhances network performance.\n\nSharding comes with its potential drawbacks, such as network security concerns and complexity of cross-shard transactions.\n\nIntroduction\n\nBlockchain technology has introduced unprecedented potential in decentralization, transparency, and security. But it faces a significant challenge: scalability. Scalability is one point of the \"blockchain trilemma,\" which also includes security and decentralization. Achieving all three simultaneously is a persisting issue in the blockchain realm. This is where strategic solutions like \"sharding\" come into play.\n\nWhat Is Sharding?\n\nSharding is a concept borrowed from traditional database management. It refers to the process of splitting a larger database into smaller, more manageable parts, called shards. Its application in blockchain aims to improve scalability, whilst maintaining the principle of decentralization. In essence, sharding occurs when a blockchain network is divided into smaller parts known as shards, each capable of parallelly processing transactions and smart contracts.\n\nHow Does Sharding Work?\n\nUnderstanding how sharding is executed within a blockchain network requires a comprehension of how blockchain data is usually stored and processed. There are various ways data can be processed. We are going to look into sequential and parallel processing.\n\nTypically, each blockchain node is responsible for handling all of the transaction volume within the network. This type of data processing is commonly referred to as sequential processing. This implies that every node must maintain and store all critical information, such as account balances and transaction history. In essence, each node must process all network operations, data, and transactions.\n\nThough such a model bolsters the security of the blockchain by recording every transaction across all nodes, it dramatically slows down the processing of data. This is where parallel processing of data comes into play as it allows for multiple operations to be executed concurrently.\n\nSharding can be a potent solution to this predicament as it divides or 'partitions' the transactional workload across the blockchain network. This means that not all nodes need to manage or process the entirety of the blockchain's load.\n\nInstead, sharding segregates the workload through horizontal partitioning. In this process, the data is divided into horizontal subsets, with each shard acting as an independent database capable of processing transactions separately from the others.\n\nHorizontal vs. vertical partitioning\n\nHorizontal partitioning and vertical partitioning are two key approaches to database scaling. While both are designed to manage large data sets more effectively, they work in fundamentally different ways. Sharding is a common method of implementing horizontal partitioning.\n\nIn horizontal partitioning, the data is divided into rows and spread across different nodes (or databases), each containing a subset of the data. Each row in a table is a unique entity, so separating them doesn't lead to any loss of data integrity. A prominent example of horizontal partitioning in use is in the distribution of blockchain networks, such as Ethereum and Bitcoin.\n\nIn vertical partitioning, the data is divided into columns, rather than rows. Each partition in vertical partitioning contains a subset of data for each entity, or the entire dataset, but only for a certain set of attributes. For instance, consider a customer table with columns like Name, Status, Description, and Photo. In a vertical partitioning scenario, the 'Name' and 'Status' might be kept in one table, and 'Description' and 'Photo' in another.\n\nWhy is horizontal partitioning preferred?\n\nHorizontal partitioning is generally favored over vertical partitioning in blockchain networks for three key reasons: scalability, decentralization, and security.\n\nScalability: Sharding provides a solution by breaking the data into smaller, more manageable 'shards'. Each shard can operate independently, enabling more transactions to be processed simultaneously, improving network speed and efficiency. Whereas with vertical partitioning, distributing the columns across different databases might require more complexity in retrieving a complete transaction or block information and could limit the scalability.\n\nDecentralization: In keeping with the core ethos of blockchain, horizontal partitioning supports decentralization. When nodes only have to process a portion of the total data (a shard), it allows for more nodes to participate in the network since the computational and storage burdens are reduced. Vertical partitioning, comparatively, would restrict this as each node would need access to all partitions (all columns of data) to understand and verify the complete block data.\n\nSecurity and Data Integrity: Horizontal partitioning maintains data integrity because each shard (or partition) contains complete transaction data, ensuring that each node has a full, accurate copy of its portion of the blockchain. In vertical partitioning, you'd essentially be splitting up a block's data across different nodes, making it challenging to ensure data integrity and security, a paramount aspect of blockchain networks.\n\nWhat Are the Benefits of Sharding?\n\nLet’s delve into the potential benefits that sharding brings to blockchain technology:\n\nIncreased Transaction Speed: Sharding facilitates parallel processing of transactions. Instead of processing transactions one by one in a sequential manner, sharding allows transactions to be processed simultaneously but on different shards. Each shard works independently, thereby increasing transaction speed significantly. This not only expedites transaction speed, but it also means that the whole network can handle more users, promoting mass adoption.\n\nAn example of an existing blockchain network using shards to address scalability is Ziliqa. Ziliqa’s sharding mechanism allows it to achieve thousands of transactions per second.\n\nMinimized Processing and Storage Costs: The conventional blockchain design obliges every node to store all transactions, intensifying the demands on hardware as the blockchain grows. But with sharding, each node is responsible for processing and storing just a fraction of the entire network's data—this decreases the resources necessary for a node to participate in the network.\n\nAs such, more participants can join as validators, enhancing network decentralization without incurring prohibitive costs. It mitigates problems where only entities with high-end, expensive computing resources could realistically participate in the process, thus maintaining the democratized nature of blockchain networks.\n\nImproved Network Performance: Sharding can help to improve overall network performance and capacity. In the traditional blockchains, as more nodes participate in the network, the performance paradoxically decreases due to the need for increased data communication and synchronization between nodes.\n\nHowever, sharding transforms this scenario. Since each shard works separately and concurrently, the system can process more transactions and computations. When a new node joins, it can be added to a shard instead of the entire network, thus enhancing the network's capacity to scale. Efficiency is improved, leading to smoother transactions and a better user experience.\n\nRemember, future advancements and improvements in sharding technology may create other advantages, or strengthen these existing ones, enhancing the blockchain ecosystem continually.\n\nWhat Are the Limitations of Sharding?\n\nWhile sharding offers several potential benefits that could help blockchain networks become more efficient, the process also introduces a unique set of challenges. Some potential vulnerabilities introduced by sharding include:\n\nSingle Shard Takeover Attacks: In a sharding environment, the computational power to take over a single shard is dramatically less than the power required to take over the entire network. This makes these individual shards more vulnerable to a \"one-percent attack\" or \"shard takeover\" - whereby an attacker with a small amount of resources compared to the whole network can potentially take over an individual shard.\n\nCross-shard Transactions: Transactions happening across different shards (cross-shard) present a unique challenge. Cross-shard transactions are complex and could potentially lead to double-spending if not carefully managed. If one shard doesn't accurately track the state of the other shard during a transaction, users may exploit this to \"double spend\".\n\nData Availability Problems: Sharding makes maintaining the entire network state an intricate effort. If certain shards aren’t available when required (because the nodes maintaining those shards are offline), it could lead to data availability issues, disrupting the entire network.\n\nNetwork Security: Sharding requires the implementation of a robust protocol that balances the load between shards. If not correctly done, this could lead to uneven distribution of data or imbalance of resources, resulting in potential network instability.\n\nNode Synchronization: Node synchronization can cause network delays due to the time it takes to share and update information across different nodes. Furthermore, if a node with slower processing capabilities or network connection lags behind, it could slow down the entire synchronization process, reducing the overall performance of the blockchain network.\n\nIs Sharding Implemented on Ethereum?\n\nEthereum has plans to implement sharding as part of their Ethereum 2.0 upgrade. Ethereum 2.0, also known as Eth2 or Serenity, is an upgrade to the Ethereum blockchain that aims to enhance the speed, efficiency, and scalability of the network, allowing it to process more transactions and ease congestion.\n\nAs of now, the upgrade is being implemented in phases, with the final phase (Phase 2) including the full implementation of sharding. Ethereum developers hope that these enhancements will address some of the current challenges associated with scalability and transaction cost that the network is facing.\n\nHowever, it's important to note that implementing sharding comes with its own set of challenges, particularly in maintaining the security and decentralization of the network. Therefore, Ethereum developers are putting careful thought and extensive testing into this transition to ensure the upgrade's success when fully implemented.\n\nClosing Thoughts\n\nOverall, sharding represents a noteworthy advance towards solving the blockchain trilemma. While it introduces new complexities and possible drawbacks, its potential for increasing scalability without compromising decentralization holds immense promise for the future of blockchain networks.\n\nIt’s no wonder that various blockchains are exploring sharding as a potential solution. Ethereum is integrating sharding as part of the Ethereum 2.0 upgrade to address scalability issues. This implementation is expected to take place through The Cancun upgrade, a critical component of the overall enhancement plan. Nevertheless, like any other evolving technology, success will depend on ongoing research, development, and rigorous testing of sharding implementations.\n\nFurther Reading\n\nDisclaimer: This content is presented to you on an “as is” basis for general information and educational purposes only, without representation or warranty of any kind. It should not be construed as financial, legal or other professional advice, nor is it intended to recommend the purchase of any specific product or service. You should seek your own advice from appropriate professional advisors. Where the article is contributed by a third party contributor, please note that those views expressed belong to the third party contributor, and do not necessarily reflect those of Binance Academy. Please read our full disclaimer here for further details. Digital asset prices can be volatile. The value of your investment may go down or up and you may not get back the amount invested. You are solely responsible for your investment decisions and Binance Academy is not liable for any losses you may incur. This material should not be construed as financial, legal or other professional advice. For more information, see our Terms of Use and Risk Warning."
    }
]