[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxOVkZhRmhtZ2cyYXF6UzY1NkFPZXZIUEFfUHVVMkxseDRibG55OHMwOGlVNHQyZHhZUHVDWGN0TDVVeXQtRGNhNGZMTkZGSTEteUVPM0hvcjlYczJuN2RidUZpY1JVWUZWNVp3RXcxQjRRdXFNNXM5U2NaTnpTdG5zRWtVWDlUQnBKakR1LUgxVkZsUm1NY0Q0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Should You Buy Ethereum While It's Still Underperforming the Market? - The Motley Fool",
        "content": "A number of factors are holding back Ethereum's market performance, including the reemergence of Bitcoin.\n\nAt first glance, Ethereum (ETH 1.79%), the world's second-most valuable cryptocurrency, seems to be having a banner year. Ethereum is up 57% and appears to be gaining momentum heading into the final weeks of the year. Over the past 30 days, Ethereum is up more than 20%.\n\nBut context matters, and right now, Ethereum is badly underperforming the crypto market. Bitcoin (BTC 2.86%), for example, is up a spectacular 112% this year. And other top cryptocurrencies are similarly posting triple-digit gains in 2023. All of this has complicated the decision-making calculus around Ethereum, which now looks like a market laggard. If you are thinking about buying Ethereum, this is what you need to know.\n\nWhy is Ethereum underperforming?\n\nWhat's particularly puzzling about Ethereum this year is that it's just so hard to pinpoint exactly why it's underperforming Bitcoin and other top cryptos. Heading into 2023, Ethereum seemed to be riding a wave of momentum after pulling off The Merge, which was widely hailed as one of the greatest technical achievements ever in the blockchain world. As a result of The Merge, Ethereum changed its overall blockchain infrastructure, all with the goal of reducing transaction fees, boosting transaction processing speeds, and improving overall efficiency.\n\nBut a number of issues have popped up throughout this year. For one, overall activity on the Ethereum blockchain seems to be down and that's not a good sign for future growth. Case in point: Bitcoin recently passed Ethereum for the first time ever in terms of 24-hour non-fungible token (NFT) sales volume, an area Ethereum has always dominated. And Total Value Locked (TVL), which measures activity on the blockchain, also recently reached a 12-month low, a potential sign of Ethereum's weakening position in decentralized finance. These might just be short-term blips on the radar, but they are still concerning.\n\nThere have been regulatory concerns, too, such as those related to staking activity on Ethereum's brand-new proof-of-stake blockchain. The primary concern is that the SEC's willingness to go after major cryptocurrency exchanges for their staking activity, as we saw earlier this year, will eventually erode the attractiveness of Ethereum as an investment option.\n\nMoreover, The Merge is not having the sort of breakthrough impact it was supposed to have, as measured by transaction fees and transaction processing speeds. For example, transaction fees for relatively straightforward activities, such as buying a new NFT, can sometimes run into the hundreds of dollars. And the main Ethereum blockchain can still only handle 20 to 30 transactions per second, a far cry from the 1 million transactions per second promised years ago.\n\nEthereum vs. Bitcoin\n\nPerhaps the best explanation, though, might be that investors are almost single-mindedly focused on Bitcoin at the moment. Just about everyone seems to be looking ahead to the imminent launch of the first-ever spot Bitcoin exchange-traded fund (ETF), and what that could mean for the broader crypto market. Ethereum almost feels like an afterthought right now.\n\nPerhaps as a result, the longtime strong correlation between Ethereum and Bitcoin appears to be weakening. Until mid-March, the correlation between Bitcoin and Ethereum was nearly 0.95. That's almost a perfect 1-to-1 match in terms of performance. But now the 90-day correlation between the two has dipped to the 0.8 level.\n\nEthereum vs. other altcoins\n\nIn addition, many other cryptos appear to be passing Ethereum right now. That's of particular concern in the case of Solana (SOL 4.65%), which is arguably Ethereum's greatest rival right now in the Layer-1 blockchain space. Solana is up a stunning 325% year to date. While Solana has its own fair share of regulatory and technical issues, investors have largely been willing to shrug them off due to Solana's perceived growth prospects. Solana's new \"crypto phone\" is just one of the most exciting projects.\n\nThese shifting investor perceptions of Ethereum are having an impact on institutional money flows. Quite simply, large institutional investors appear to be taking their money out of Ethereum and moving it into Solana. In 28 of 32 weeks this year, Solana has seen net positive inflows, according to CoinShares, which tracks inflows and outflows into different cryptocurrencies. In contrast, Ethereum has seen outflows. And that has led to CoinShares calling Solana \"the altcoin of choice\" for institutional investors right now.\n\nCan Ethereum bounce back?\n\nAt the end of the day, the decision whether or not to invest in Ethereum comes down to your view of its long-term growth prospects. Ethereum is still the clear leader in just about every niche or sector of the blockchain world and it's one of the few cryptos that seems to have the implicit support of federal regulators. Notably, SEC Chair Gary Gensler has always stopped short of calling Ethereum a \"security.\" And it's not like analysts have completely given up on Ethereum. Standard Chartered Bank, for example, just put out an aggressive $8,000 price target for Ethereum.\n\nGoing forward, I'm keeping a close eye on how Ethereum fends off the threat from rival Solana. This one factor could end up having the greatest impact on Ethereum's long-term growth prospects. If Ethereum is unable to keep up with Solana and other Layer-1 blockchains, that could have a huge impact on my decision of whether or not to invest in Ethereum going forward."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPaXowekpvdEV3R1l3UXNVR2tNamt0TElhdDJuOUF3RjlxU0ZtQ0xxTzVyYm02eUJvcHJKeGxSQThNRU14X2I4cmVuaWd3STNqNjhzVnRSckRnbjZGMk9zOFJsZHFEWEU5UFI0dmZIaVpudm14M25manFfYm5tdU9IUGp1anl2bEF4UkNvNkVB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Ethereum and Solana lead DeFi surge as TVL and DEX activity soar - CryptoSlate",
        "content": "The DeFi sector has experienced a significant increase in both activity and token prices, primarily driven by Bitcoin’s October rally. Central to understanding this landscape is the concept of Total Value Locked (TVL) and decentralized exchange (DEX) volumes, two critical metrics that offer insights into the health and trajectory of DeFi protocols.\n\nTVL, the aggregate value of assets deposited in DeFi protocols, serves as a barometer for sector health and investor sentiment. CryptoSlate analysis found an interesting growth pattern across various chains. Ethereum, the frontrunner with $25.336 billion in TVL, has seen a 31.14% increase over the past month, cementing its dominant position in the DeFi space. Solana, though lower in overall TVL, showed the highest growth rate at 89.31%. Notably, all chains recorded positive growth over the month, indicating a robust expansion across the sector.\n\nThe number of active users on these chains offers additional insights. Despite its lower TVL, Tron boasts a significantly larger active user base of 1.69 million, which could result from a more retail-oriented user landscape. Conversely, Ethereum’s lower active user count than its TVL might indicate a higher engagement of institutional or sophisticated, high-net-worth investors.\n\nThe market cap to TVL ratio is another critical metric, shedding light on the market’s perception of a chain’s value. Ethereum’s ratio of 9.72 suggests a mature market. In contrast, Solana’s higher ratio of 43.49 indicates either potential growth opportunities or an undervalued ecosystem, warranting closer investor scrutiny.\n\nName Protocols Active Users 1D Change 7D Change 1M Change TVL Stablecoins 24h Volume 24h Fees Market Cap to TVL ratio 1.Ethereum 946 304,493 -0.12% +6.50% +31.14% $25.473b $64.929b $1.718b $7.27m 9.63 2.Tron 26 1.69m -1.34% +5.04% +25.14% $8.291b $47.455b $11.33m $1.66m 1.13 3. BSC 663 945,060 +0.22% +1.70% +12.58% $2.996b $4.992b $429.32m $348,294 12.62 4.Arbitrum 481 133,870 -0.38% +10.90% +25.21% $2.095b $1.844b $925.94m 0.66 5.Polygon 488 +1.28% +8.10% +21.93% $852.6m $1.17b $369m $87,858 10.06 6.Optimism 197 91,508 -0.12% +11.94% +25.87% $739.39m $576.85m $109.27m 2.11 7.Avalanche 344 33,880 -1.04% +12.63% +28.18% $615.82m $1.07b $140.2m $36,244 9.73 8.Solana 115 -1.55% +23.58% +89.31% $530.8m $1.513b $425.62m $108,773 42.62\n\nTable showing the TVL, active users, volume, and market cap to TVL ratio for the 8 largest L1 chains on Nov. 14, 2023 (Source: DeFi Llama)\n\nDEX volumes provide a lens into the trading activity within these ecosystems. Ethereum leads with a 24-hour volume of $1.718 billion, accounting for a substantial portion of the total market. The rapid growth in DEX volumes on platforms like Solana and Polygon, with increases of 81.35% and 86.32%, respectively, reflects growing user adoption and confidence.\n\nName Weekly change Volume (24h) Volume (7d) TVL % of total Cumulative volume 1. Ethereum +27.29% $1.718b $10.65b 5.941b 37.12% $1.888t 2. Arbitrum +58.15% $925.94m $4.415b 1.127b 20.00% $138.902b 3. BSC +7.54% $429.32m $2.752b 1.577b 9.27% $757.4b 4. Solana +81.35% $425.62m $2.571b 185.78m 9.19% $54.616b 5. Polygon +86.32% $369m $1.711b 0 7.97% $101.421b Table showing trading volumes and total value locked for decentralized exchanges (DEXs) across the five largest L1 chains on Nov. 14, 2023 (Source: DeFi Llama)\n\nThe observed trends in TVL, active users, and DEX volumes show a market booming with activity. Ethereum continues to lead, both in terms of TVL and DEX volume, signaling strong investor confidence and market dominance.\n\nHowever, the rapid growth of newer platforms like Solana and Polygon suggests a diversifying landscape, with different chains catering to varied user needs and investment profiles. The market cap to TVL ratios further confirms the growth potential of lower market cap chains, with Solana and Polygon positioning themselves for future growth.\n\nMentioned in this article"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE16MTBGU0ROOUV4c0V3ZTlsal94dWRvQTdIQm04TWVFOVZ3SkNKZ0t6VFVLa3IySWcxOU5ic3MzVG90VmN2Z0dtOHk4U2YycmVtcEljOW9obXdxQW5XYnhReVE5ZUxPQnd3eTdaSkFnbk9pQdIBekFVX3lxTE5sRFVxYnV4ZFNtYUdLNTBVZlZ6YjV0TkhRX29TVnNTVkE4RmhRU3c5UE1LRWxKTGdYV1BSMDZCRWJFNTMtYlVUM3JtMEZNek51dmdaSi0wUjRFMlRRZmpTRWtldXJKRVY3V0xLenJNN3NuTzVycUtNcTBB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin and Ethereum Lag While DeFi Tokens dYdX and Maker See Gains - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nA number of decentralized finance (DeFi) assets surged on Tuesday while major cryptocurrencies—including Bitcoin and Ethereum—experienced losses.\n\nDecentralized lender dYdX, which runs on Ethereum, was at the time of writing trading for $3.34, having gained nearly 7% in 24 hours. Over the week, the protocol's native token, ETHDYDX, had boomed by 42%, CoinGecko data showed.\n\nElsewhere, Maker (MKR) also experienced a surge: at the time of writing, it was only up over 1%, trading for $1,366, but had shot up earlier on Tuesday morning Eastern Time to a high of $1,423.\n\nAnd decentralized exchange PancakeSwap (CAKE) was also up nearly 3%, coming in at a price of $2.24.\n\nAD\n\nAD\n\nDeFi refers to the projects in the cryptocurrency space which want to replace traditional financial services, such as borrowing, lending or banking.\n\nSuch projects are new, experimental and prone to hacks—which means respective coins and tokens are volatile.\n\nBitcoin, the largest digital asset by market cap, had lost more than 2% of its value by the time this story was published, and was trading hands for $36,049.\n\nAnd Ethereum, which last week pushed past $2,000, was down nearly 3%. It is priced at $2,041 per coin.\n\nAD\n\nAD\n\nLast week ETH saw major gains on news that BlackRock Advisors, a division of the Wall Street titan, was preparing to file an application for an Ethereum ETF. The iShares Ethereum Trust application is BlackRock's first official application for an Ethereum ETF.\n\nWithin 24 hours after the filing of the iShares Ethereum Trust application, the price of Ethereum crossed the $2,000 mark, a level it had not seen since July 2023. The price of Ethereum experienced a substantial increase, with gains reported at over 8%. Moreover, the trading volume surged by 259%, indicating a significant rise in market activity.\n\nConcurrently, the market capitalization of Ethereum increased by a little more than 10%—reflecting a marked growth in investor confidence and market valuation following the news of the filing.\n\nElsewhere, major coins and tokens were having a rough morning. Solana (SOL), which last week blew up in value, was trading little over $56 per coin, up less than 1%. Even when ETF optimism cooled for Bitcoin and Ethereum, Solana has held onto its gains.\n\nSOL has surged nearly 160% over 30 days. For a few days, it briefly overtook the market capitalization of major stablecoin USDC. But it has since dropped below it again. As of this writing, SOL has a market cap of $23.8 billion and USDC has a market cap of $23.9 billion.\n\nEdited by Stacy Elliott."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxPallKU2RvTXBJcUJrR3pTT3VjZTRsaEhmbC1jUHN6WGM1QllJbEdhdHU4WmpvMGZnal9aTWIwbDlFbWg3cXIyQlctVzEzclVSbWlkQmJsQVZjX2pJMks3YnRiaHBKS29kMy10YWRNRjJOTzBINThiREdHT1dlbHZBcDhsREN4dkF1WE9PNUk0cmN1V0FlS19Keno4RFc5bVhhVERFZnFVM1c1emlnMnJJU3NwRjjSAboBQVVfeXFMTWtpOVZGa01yTXVBQlV5YmJPVUVHYWVPNnVVTWtHOFRveTRNQV91TjVsMEI1Q1hObTFjeGNWVjVta1VsYjV6UGdMbHVHQUE4dmVrbU1oOEExN2huNmZja2N4QmpzUmFIRXFYRUQyMGk2bklIRU45RGlxMm1RR0Z4bnZtZVVqamZQRnhPRkU3QXNfSG53NC1SNW1CMjd4czg1N2JrV21ORVlkYUhiUXhUaF9hWVR1Q0M4eHJB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "Solana surges amid altcoin rally, nearly triples its price over the past month - CNBC",
        "content": "The price of the Solana token jumped Wednesday amid an ongoing rally in altcoins and bullish remarks on the token from famed tech investor Cathie Wood.\n\nSolana was last higher by nearly 18% at $65.65. It has nearly tripled in price in the past month.\n\nThe spike comes a day after Ark Invest CEO Cathie Wood applauded its performance this year on CNBC.\n\n\"Solana is doing a really good job,\" she told CNBC's \"Squawk Box\" on Tuesday. \"Ether was faster and cheaper than bitcoin [back] in the day – that's how we got ether. Solana is even faster and [more] cost-effective than ether.\"\n\nWood went on to say on CNBC Pro Talks that she \"really does like Solana\" while also noting that its downtime – the time the network is down, under maintenance, or suffering an outage – \"is much higher than it is for Ethereum.\"\n\n\"People are willing to put up with that because maybe the transaction sizes are not as large or for some reason are not as important, they just want speed and cost as their top priority,\" Wood told CNBC PRO. \"Each one of [the networks] is going to have a place.\"\n\nSolana, the sixth largest crypto token by market cap, according to CoinGecko, became the darling of the crypto world in the 2021 bull market as it sold investors a vision of something like Ethereum, but without the slow and expensive transactions.\n\nActivity on Solana has been growing all year, particularly in liquid staking protocols like Jito, according to data provider Kaiko. The token has topped the list of the most traded altcoins on US-available exchanges this year, outpacing dogecoin , litecoin , Polygon's MATIC and Ripple's XRP .\n\nMore recently, the token is following a broader crypto market rally led by bitcoin, that began Oct. 24, when the coin doubled for the year and topped $35,000 for first time since May 2022. Shortly, after ether followed, rising to the key psychological level of $2,000. Historically, the altcoin rally tends to follow ether.\n\n\"After Oct. 24 bitcoin started losing its momentum, which during bitcoin bull markets causes traders to go down the risk curve and switch to alts as a way of chasing huge profits,\" said Mikołaj Zakrzowski, an analyst at data provider CryptoQuant.\n\nThis time a year ago, the coin was facing a crucible moment after the FTX blowup sent it down 70% over two days and briefly traded under $10. FTX and its now-fallen leader Sam Bankman-Fried were widely credited with providing substantial money and resources behind the Solana project to get it off the ground.\n\nSolana is up about 550% this year and has been one of the best performing cryptocurrencies of 2023. By comparison, bitcoin and ether have gained about 127% and 70%, respectively."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxOS0lWcUVGdjhnWmxOYVF3QUl0TlhENUZudjRtTGNrUllOeTk1d295YWw5UjFqdEwtc2lBR0VVUG53MVlhenVEXzVuLU9UTUE0Q3lNclFLT1pvMWJqRDQtU2hPS0NpRldPMGJhYVlQdml5Z19LVGVtNHBnYU96Wmh3bGx0bVRQemPSAYwBQVVfeXFMT2xKSmdqcUU5eGhZR253UUFmM0ZEZGVYZlpzOHE0ejdzd1VpLWpna2hpcE9zbWxUM1NCbHhNb1AyLXROS0pXU1lUWDdwTDRPQVd2ZlZXLWJRcDFMUlhEV1JackpfLTRYa1V0UFdTaG5raHhhVk1SajBFVUdvSjg4NEZSYTE4OHoxZjJxazI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "Is ETH About to Crash Below $2K? (Ethereum Price Analysis) - CryptoPotato",
        "content": "Technical Analysis\n\nBy GreatestTrader\n\nBuyers in the Ethereum market have recently driven the price into a strong uptrend, reaching a critical resistance level at $2K. However, encountering a significant hurdle around this crucial mark, there exists the potential for a temporary consolidation correction phase in the coming days.\n\nThe Daily Chart\n\nA thorough examination of the daily chart reveals substantial support around the crucial region, comprising the static support at $1,500 and the lower boundary of the wedge pattern. This support fueled a significant surge, indicating strong buying momentum, with buyers targeting the critical $2K resistance zone.\n\nDespite reaching this key level, aligned with the wedge’s upper boundary, Ethereum faced rejection, leading to a slight retracement towards the broken 200-day moving average at $1,783.\n\nConsidering the significance of the resistance at $2K and the associated wedge pattern’s upper boundary, a temporary continuation of the ongoing retracement followed by consolidation around the broken moving averages is highly likely. If the price completes a pullback to the broken moving averages, buyers may re-enter the market, aiming once again for the substantial $2K level.\n\n\n\nThe 4-Hour Chart\n\nOn the 4-hour chart, the intensified buying pressure around the $1,5K support region propelled Ethereum toward the substantial $2K resistance. This upward movement demonstrated significant bullish momentum, reflecting the buyers’ dominance in the market.\n\nHowever, the $2K region represents a crucial psychological resistance, posing challenges for buyers to push the price higher. Notably, a bearish divergence between the price and the RSI indicator suggested insufficient buying pressure, leading to a reversal and slight corrections.\n\nAdditionally, a recognizable double-top pattern around this pivotal resistance confirmed the presence of sellers in the short term.\n\nGiven the existing market dynamics, there is a high likelihood of an extended consolidation correction phase in the short term. This implies that the market might continue its retracement before definitively determining its next course of action. In this scenario, the support range between the 0.5 and 61.8 levels of the Fibonacci retracement ($1,839 – $1,769) is expected to be the next level of interest for Ethereum’s price.\n\n\n\nOn-chain Analysis\n\nBy GreatestTrader\n\nThe futures market has been a significant influencer of Ethereum’s price dynamics, making it imperative for the current uptrend to sustain favorable conditions in this market.\n\nIllustrated in the chart is the 30-day moving average of the Ethereum Taker Buy Sell ratio, a crucial metric for gauging sentiment in the futures market. During a period of substantial price increase in Ethereum, the taker buy-sell ratio exhibited a robust uptrend, signaling strong buying interest. However, a recent reversal in the metric’s trend has led to a downtrend, dipping below the threshold of 1. This reversal indicates that sellers are now executing more aggressive orders in the aggregate, potentially to realize profits or to take short positions.\n\nSignificantly, this shift in the metric aligns with the recent market rejection and its struggle to move higher. The confluence of these events suggests a potential for a short-term retracement in Ethereum’s price.\n\nShould the taker buy-sell ratio resume an upward trajectory, surpassing the 1 threshold, it would indicate a revival of bullish sentiment in the short term, potentially supporting the continuation of the uptrend. Conversely, a failure of the metric to exhibit upward movement would raise concerns about the sustainability of any bullish momentum."
    }
]