[
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTE43NUFXblJWaHl5QnFYMHo2ZDBNRHFBa1htTkVuamhlc2NFT2xScGhJbjdTb3Azb3FaNXpSYm9qcW1uODJyN1pMOWpsREZ0SUZOcmhLWVVGU2tWTndsaGxjc2hFTVltc25nYTQtZm95bG9nYkpW?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Nov 2023 08:00:00 GMT",
        "title": "Binance Set To Remove Bitcoin & Ethereum Pairs From Nov 28 - TronWeekly",
        "content": "Binance, the world’s largest cryptocurrency exchange, has recently announced its decision to delist Bitcoin [BTC] and Ethereum [ETH] cross-margin and isolated margin pairs. This strategic move, effective November 28, is part of the crypto exchange’s proactive approach to addressing the increasing legal challenges within the digital asset industry.\n\nThe impacted pairs are directly linked to BUSD, a stablecoin created in collaboration with Paxos. The suspension of isolated margin borrowing on these pairs is set to occur on November 28, followed by the closure of auto-settled user positions and the cancellation of pending orders on December 7. This decision comes in response to allegations from the U.S. Securities and Exchange Commission (SEC), which previously classified BUSD as a security.\n\nBinance Set To Remove Bitcoin & Ethereum Pairs From Nov 28 3\n\nIn response to this classification, both Paxos and Binance promptly ceased further minting and circulation of the stablecoin, aligning with the ongoing efforts of crypto exchanges to comply with evolving regulatory frameworks.\n\nEarlier this week, CZ pleaded guilty and is set to stand trial for charges related to operating an unlicensed money transfer business, conspiracy, and violating restrictions, resulting in a substantial $4.3 billion fine for Binance. As the cryptocurrency space grapples with these regulatory challenges, the implications for the market remain uncertain. The delisting of major pairs and the leadership change at Binance underscore the mounting regulatory pressures faced by crypto exchanges globally, marking a pivotal moment for the industry.\n\nMeanwhile, according to data from CryptoQuant, Bitcoin reserves are shifting from Binance to Coinbase. As of November 22, Coinbase’s reserves have surged by almost 12,000 BTC, while Binance’s have declined by 5,000 BTC, as noted by the research firm in a recent report. Analysts attribute the decrease in Bitcoin reserves to retail outflows.\n\nBinance’s Bitcoin Reserves Drop\n\nConcurrently, some market experts speculate that Binance’s recent settlement with the U.S. Department of Justice could be the final hurdle for obtaining approval for a spot Bitcoin ETF, influencing fund flows.\n\nCryptoQuant identified a 1,000 BTC withdrawal from Coinbase, with suggestions that the transaction represents an “institutional over-the-counter [OTC] trade and can be seen as anticipation of approval of ETFs.”\n\nFurthermore, CryptoQuant’s data reveals a consistent decrease in bitcoin reserves on exchanges throughout the year, considered a bullish indicator. However, certain analysts argue that since the collapse of FTX last year, trust in centralized exchanges has waned, prompting investors to store their holdings elsewhere."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE1HUEFLam0waUtlZHZyNEpxOHNJQVk4OWtzNlVKSEZtWG1UZlppTkxVa2Jod3NGV1NmcS1EbzhrS21sQmRxbkdkazY4anZlb2N3eVd6czFnbjJMaXQyZDlkb3FsVlNBWUI2REtYbDNsZmtxR1A5M0HSAXtBVV95cUxOZHlkRHlUM2o0a2ZaVnVfSXJYZGlyOUk5WHJ2dF95a0pDWTNvb2tMa2t6SW42MFljeVpGb3Y1YklGazN3RHBwTGNDXzVZeVpTSVMwV1BZOEdQZmlWZmUwSnVNcmFIN2hfOHBiakhsWTVaQ3E2aDBsWm1QY1E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Price Could Reach $36,800 By 2030: Token Terminal - Bitcoinist",
        "content": "Token Terminal, a blockchain analytics platform, predicts Ethereum (ETH), the world’s second most valuable cryptocurrency, can soar above $36,800 by the decade’s end based on total addressable market projects.\n\nIn an in-depth analysis covering Ethereum on November 23, the analytics platform laid out several reasons that will drive the coin to astronomical levels, nearly 18X from spot levels.\n\nEthereum Is King, Predicted To Process $14 Trillion In Value By 2030\n\nThe Token Terminal report cited strengthening network effects, increasing token scarcity, and successful transition to proof-of-stake (PoS) consensus as possible price drivers accelerating the rally towards $36,800. The first-mover advantage and network effects, among others, have given Ethereum a competitive advantage over rival smart contract platforms, including Solana (SOL) and Cardano (ADA).\n\n\n\nUsers can deploy decentralized finance (DeFi) solutions in these competing networks, mint non-fungible tokens (NFTs), and overly participate in web3 development. Even so, Token Terminal observes that despite Ethereum’s limited scalability and fluctuating gas fees, which tend to rise in trending markets and intense network activity, discouraging engagement, it stands to dominate in the years ahead.\n\nQuantifying future adoption, Token Terminal estimates that by 2030, approximately half of the finance industry’s trillion-dollar revenue will likely be flowing through Ethereum. To put a figure to this, the blockchain analytics platform estimates that over $14 trillion in value will be settled on-chain, with Ethereum as the preferred network.\n\nThe finance industry generates over $28 trillion in annual revenue, growing at a compound annual growth rate (CAGR) of 7.5%.\n\nAs it is, this mega valuation expected to flow through Ethereum is more than 10X the total crypto market when writing on November 2023. According to CoinMarketCap, it is slightly over $1.4 trillion with Bitcoin commanding roughly 51%.\n\nMaking projections from this outlook, the blockchain analytics platform noted that the expected adoption via emerging verticals, including identity, content streaming, and even the Internet of Things, could see ETH soar year-over-year in the next seven years.\n\nPotential Challenges That Might Slow Adoption\n\nStill, the study notes that challenges in the future might slow down adoption, potentially stifling growth and prices. Top of the list is the risk associated with regulation. As crypto finds adoption, the research notes that governments might try to interfere to maintain order.\n\nAt the same time, there could be unforeseen changes to the network design tradeoffs, the success and subsequent dominance of layer-2s forcing venture capitals to prioritize funding for off-chain projects and note those deploying on the mainnet.\n\nAdditionally, Token Terminal said even a bug being discovered on-chain, leading to losses and, thus, a dent in confidence, cannot be discounted in the long-term.\n\nFeature image from Canva, chart from TradingView"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxPUTlpTUJpQUJ1bnZqalNzY19XLVQwNWFoX0FvRWZyNTkyRFhLX0FtamNHZ3oxM0ZPM2doNWJHZ21XU2lrUFYtZjBtUVZydTJuNkh4QTRLMUdxa1VaZGxMcS1IRkhNNUFPcDJ4ZnZ4Qk5Ra0QyeU5pR0hJaFJveHZYOVRCWm9SSHZDdWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Nov 2023 08:00:00 GMT",
        "title": "Crypto Revolution: Ethereum, BNB, GameStop Memes Unleashed - Techpoint Africa",
        "content": "Explore Ethereum's rise, BNB's dominance in the bull market, and the unique community-driven spirit of GameStop Memes in decentralised finance.\n\nIn the world of cryptocurrency, three coins have captured the attention of investors and enthusiasts alike: Ethereum (ETH), Binance Coin (BNB), and the newcomer making waves, GameStop Memes ($GSM). In this article, we will delve into the intricacies of Ethereum mining, explore the bullish trends in the crypto market, and uncover the unique features of GameStop Memes in the decentralized finance (DeFi) landscape.\n\nEthereum: The Leading Crypto Ecosystem\n\nEthereum, the pioneer of smart contracts, has long been a frontrunner in the crypto sphere. Its revolutionary blockchain technology has opened the doors to many decentralized applications (DApps) and the world of decentralized finance. Ethereum mining, driven by its proof-of-stake (PoS) consensus algorithm, continues to be a focal point for crypto enthusiasts seeking to contribute to the network and earn rewards. The demand for Ethereum mining hardware has surged alongside the bull market, reflecting the growing interest in cryptocurrency. Miners seek efficient and powerful hardware to optimize their mining operations, contributing to the robustness of the Ethereum network.\n\nAs the crypto market gains momentum, Ethereum's value has soared, solidifying its position as a powerhouse in the crypto space. The decentralized nature of Ethereum aligns with the ethos of GameStop Memes, a token that champions the spirit of resistance and unity within the crypto community. Positioned as the successor to Wall Street Memes, GameStop Memes carries the torch forward by embodying the disruptive spirit witnessed during the GameStop saga. Its commitment to decentralization aligns with Ethereum's ethos, providing users with a platform that empowers and unites; a 100x possibility.\n\nBinance Coin Surges Ahead\n\nAmid the bull market, Binance Coin has emerged as a powerhouse, backed by the success of the Binance exchange. With innovative features and a robust ecosystem, BNB has become a go-to choice for traders and investors navigating the crypto landscape.\n\nAs Ethereum mining gains traction, BNB's utility in the decentralized exchange (DEX) space adds another layer to the crypto narrative. The bull market has fueled BNB's rise, and its influence on the market dynamics cannot be ignored. GameStop Memes, while acknowledging the dominance of BNB in the crypto market, bring a unique narrative to the forefront. Its focus on community-driven initiatives and homage to the GameStop movement sets it apart, providing enthusiasts with a token that goes beyond market trends.\n\nGameStop Memes Sets Sailing\n\nAs we navigate the exciting landscape of Ethereum mining, ride the waves of the bull market, and explore the intricacies of crypto hardware, GameStop Memes emerges as a beacon of innovation in decentralized finance. Its protocols, driven by a passionate community, stand as a testament to the transformative power of unity and defiance in the crypto world.\n\nIn the crypto landscape, GameStop Memes introduces a fresh perspective. Beyond the mining hardware and market dynamics, it emphasises the community's role in shaping the future of finance. By aligning with Ethereum's commitment to decentralization, GameStop Memes aims to create a platform where every participant plays a crucial role. In the realm of Ethereum mining hardware, GameStop Memes introduces a human-centric approach; opening a door for 100x potential. It's not just about the technology; it's about empowering individuals to be active contributors to the decentralized financial ecosystem.\n\nThe Bottom Line For DeFi In 2024\n\nIn the grand tapestry of crypto, Ethereum, BNB, and GameStop Memes each play a distinctive role in this bull market. While Ethereum and BNB pave the way, GameStop Memes adds a layer of community-driven revolution, reshaping the decentralized finance landscape. As we embrace the future of crypto, GameStop Memes invites enthusiasts to be not just investors but active participants in a movement that challenges norms and celebrates the spirit of decentralized finance. Join the GameStop Memes 100x potential as it is here to stay.\n\n\n\nStay Engaged With What’s Latest About GameStop Memes\n\nWebsite: https://gamestmemes.com\n\nTwitter: https://twitter.com/GameStopMemes\n\nTelegram: https://t.me/GameStopMemes"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxQa2w1ZmRpQnk2djRRc3d1QWtkX0tkbU9FRlY5OEoyY09VcjhmSEJHX1FKeTFVeXE3MXBDMGNEeF9fZG8yVXhkN1hUMUYzek9LWHVnN1JUUmR2QVd0VFJ2dzFOSjZaS01CNkNnT3JFc1BrbkpaNGhua1kxS04wdWJHVlVfYXZGcjV1WmlTNTk0YkZkQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Nov 2023 08:00:00 GMT",
        "title": "What is Blast: the million-dollar Ethereum L2 cofounded by Blur - OKX",
        "content": "If you're someone who prefers to HODL their portfolio for the long haul, staking and generating passive yield may be at the top of your agenda. With so many staking protocols to choose from, you'll practically be spoilt for choice, as they potentially bring satisfying rewards and security that reassures you of your staking decision.\n\nRecently, an Ethereum layer-2 (L2) solution that allegedly offers native yield has been making a splash in the decentralized finance (DeFi) scene. Enter Blast: the L2 solution with over $300 million in Total Value Locked (TVL) and 50,000 users as of November 2023. As an ever-growing pool of users are hopping aboard the Blast bandwagon, it begs the question — are these benefits too good to be true?\n\nFrom explaining Blast as an L2 solution to digging deeper into its smart contract specifics, here's everything to know about Blast and its explosive overnight success as an Ethereum L2 solution.\n\nWhat is Blast?\n\nAs the market's only Ethereum L2 with native yield for ETH and stablecoins, Blast is the result of Blur's founder Tieshun Roquerre recognizing a need for a new L2 optimistic rollup solution with native yield. While Blast is still in early access, it's attracted the attention of yield hunters due to its promises of up to 5% and more. This is thanks to extra Blast rewards in the form of USDB, Blast’s auto-rebasing stablecoin. USDB can then be swapped to USDC once Blast rewards are distributed in May 2024.\n\nHow does Blast work?\n\nWith rewards of up to 5%, one has to wonder where Blast is getting this yield from. To quell the worries of Blast skeptics, Roquerre has been fully transparent with the way the bridged stablecoins and ETH are being handled. In a public Blast thread on X, the L2 optimistic rollup solution has clearly stated its yield sources. Here's a breakdown of how Blast works and how users will interact with the L2 solution:\n\nUsers can deposit ETH, stETH, DAI, USDC or USDT. These deposits are locked until February 2024, when Blast's mainnet and DApps go live.\n\nUSDT deposits are swapped into DAI via Curve Finance's 3pool while USDC deposits are converted to DAI via MakerDAO.\n\nThese user deposits are then converted into yield bearing assets. Blast natively participates in ETH staking and will stake the deposited ETH on Lido, where it's converted to stETH and staking yields about 4% APY.\n\nETH deposited and staked with Blast is auto rebasing, meaning it's meant to maintain a stable price and protect holders from potential inflation.\n\nStablecoins are deposited into on-chain treasury bill protocols like MakerDAO's Dai Savings Rate contract. These claim to yield about 5% APY and will be returned to Blast users via USDB, Blast’s auto-rebasing stablecoin.\n\nSince Blast is in early access for the next couple of months, participation is limited to invite codes. Users get more Blast points based on how much they bridge and who they invite.\n\nWhy's Blast so popular? The pull factor of Blast's yield and star power\n\nA minimum of 4% yield on ETH and stablecoin deposits\n\nWith the current state of staking on L2s, some crypto natives may feel that the possible yield gained doesn't justify locking up one's digital assets on-chain for staking. As the newest Ethereum L2 on the block, Blast is seeking to offer more lucrative staking for ETH and stablecoin holders than its competitors. Since the baseline interest rate on existing L2s is 0%, assets on L2s are basically depreciating over time thanks to inflation. Armed with native yield, Blast offers a compelling alternative solution by providing at least 4% APY and more in Blast rewards.\n\nBlur-related FOMO\n\nAnother reason Blast has racked up so much TVL in such a short amount of time is perhaps due to the fear of missing out. As Blast is headed by Blur's founder, crypto natives are undoubtedly going to jump on Blast because of how successful Blur became in taking on NFT marketplaces like OpenSea. Speaking of reputable names, top venture capitalist firms like Paradigm and Standard Crypto have also joined the fray by raising $20 million for Blast. This has undoubtedly created a dilemma where users are tempted to deposit on Blast with the justification that big money is also doing it.\n\nHonesty in how Blast will operate\n\nFinally, Blast has been the talk of the town in the staking space because it has seemingly laid all its cards on the table when it comes to overall transparency. From clearly stating where the deposits will be staked to listing out when the Blast mainnet goes live and when rewards will be distributed, Blast's refreshing honesty is a contrast to what we sometimes see in shady DeFi projects that try to fool users through the door with high and unsustainable yields while minimizing overall communication.\n\nWhat are the risks of depositing on Blast?\n\nWhile some may welcome what Blast offers since staking on L2 typically provides 0% yield, some eagle-eyed commentators are saying otherwise by pointing out some red flags.\n\nThe safety of user deposits\n\nRight from the getgo, Blast displays some signs of security weakness. Its smart contracts are owned by a 3-of-5 Safe multisig wallet and the active signers of said wallet are funded by an account with ties to degenerate NFT trading activity. According to a thread posted by user harls.eth, the funds are linked to a wallet littered with questionable NFT buys. While some Blast users may brush this off, such ties don't exactly paint Blast in the best light. With the amount of cyberhacks happening in late 2023, all it takes is a smart contract bug to trigger a massive withdrawal of millions of deposits and cause heartbreak for thousands of users.\n\nThe Blast rewards framework\n\nA big reason crypto natives are going all out to secure a Blast invite is because of the additional yield gained by depositing their ETH and stablecoins. By promising yields above what typical risk-free rates offer, this definitely checks the boxes of yield hunters looking to maximize their DeFi gains.\n\nDigging deeper into Blast's current reward framework reveals other red flags worth mentioning. In its current early access state, deposits into Blast are one-way with no way of withdrawing until Blast's mainnet goes live. Additionally, Blast is promising rewards as a bonus for users who participate early. While it does sound lucrative, these rewards are points for an L2 solution that's yet to be released. This echoes the critique by Cinneamhain Ventures' Adam Cochran, who claims Blast is a platform with one-way deposits.\n\nLeaderboard and Spins system resembling a pyramid marketing scheme\n\nAdditionally, Blast has a Leaderboard and Spins mechanic that should inspire caution. Essentially, it's a recruitment system that encourages existing users to 'recruit' more users to sign up in hopes of forming a Squad of Blast users. By convincing invitees to deposit, users earn bonus luck, which contributes to their overall odds of gaining more Blast points when they play the Spins minigame. Each week, users will get a fixed amount of Spins, which is a card-flipping minigame that grants you extra points based on your luck.\n\nTo summarize these mechanics, the more ETH one's overall Squad is worth, the more invites one gets. With more deposits, users can increase their luck when interacting with Super Spins and reap more Blast points. This structure of getting more interested individuals to pile on later in order for the earliest Blast users to benefit has been criticized as a form of Ponzi scheme by some in the crypto community. At a minimum, traders should note that it might be tough for Blast to maintain its current TVL levels without rewarding users to keep them around.\n\nThe future of Blast L2: what can users look forward to?\n\nAlthough there isn't an official roadmap yet for the future of Blast besides dates relating to its mainnet launch and reward distribution, Roquerre's recent thread has declared that Blast is meant to complement the Blur ecosystem. It also aims to help its users avoid asset depreciation, reduce NFT transaction costs, and launch NFT perps. Blast's future ambitions would allow it to be beneficial to all DApps since an L2 with native yield opportunities like Blast will unlock possibilities for the entire on-chain economy. Roquerre then extends the benefits to Perps, DEXes, lending, NFTs, and SocialFi as potential benefactors.\n\nShould you deposit on Blast?\n\nAs every individual has their own levels of risk tolerance and trading plans to stick to, there's no hard-and-fast rule that you should or shouldn't consider depositing ETH and stablecoins on Blast. Ultimately, one should weigh both benefits and risks before coming to a personal decision.\n\nFor those won over by Roquerre and his ambitions, Blast succeeding as an L2 solution definitely doesn't seem to be far fetched as he might be able to replicate Blur's success with Blast. Those who do so could be rewarded with bonus Blast point yields and the ability to say they were one of the early access depositers.\n\nOn the flipside, Blast certainly does display its fair share of risks. From its aggressive recruitment structure to the sustainability of its future rewards, many doubters are claiming that Blast is getting ahead of itself by delivering a marketing narrative without launching an actual L2 product.\n\nFinal words and next steps\n\nCan Blast keep its explosive momentum going? That seems to be a question many crypto natives and critics are asking as Blast's TVL numbers beat the odds and increase by the millions each day. As hype and anticipation builds behind the L2's impending launch, it'll certainly be interesting to see how Blast plays out.\n\nOverall, the synergy between Blur and Blast will definitely be interesting as Blur has stated that it plans to test and deploy its L2 apps on Blast. Whether this'll result in a thriving ecosystem that takes the crypto world by storm is another story. As an Ethereum L2 optimistic rollup solution that offers native yield, Blast has hit the ground running in gaining adoption among diehard Blur fans and yield hunting crypto natives. Ultimately, only time will tell if they're able to stick the landing and establish themselves as one of the leaders in the L2 space.\n\nKeen to see how Blast's success impacts Blur prices? Check out the Blur token for information."
    }
]