[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxNWDZZcUtCRDBjNDFwaDQzNEg2aEs4UFUzdVJOLTl0dUZuQXJrNnlSWm1YTXU4XzY2YmE2YTZudl96R1ZQbkdPbURmRnJnV2xIQVM0VUhrU00tb056NWlKY2Njc3BPTTlhUEJaVnFUQ3Jad2JpWUw1eDFEa0VKQ1E3aGhDLUpmRkpkX25BZk1OUXpsR2RqMTE3dDVGNDdtNmlqam5z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin approaches $38,000 and Ethereum crosses $2,000 as ETF fever continues to buoy the crypto market - Fortune",
        "content": "The world’s largest cryptocurrency by market capitalization continued to push past year-long highs, as Bitcoin approached $38,000 late Thursday morning, an approximately 7% increase in the past 24 hours, according to data from CoinGecko. Its peak of $37,935 was the highest the coin has reached in more than 18 months.\n\nEther, the token for the Ethereum blockchain and second-largest cryptocurrency by market capitalization, was also up, crossing the $2,000 mark for the first time since July on the back of an 8% day-over-day price upswing.\n\nThe market capitalization for all cryptocurrencies increased approximately 5.4% day-over-day to $1.45 trillion, as some of the other largest coins on the market saw large gains as of Thursday morning, including Cardano (8.2%), Solana (9.9%), and Chainlink (12.7%). The movements in the crypto markets far outpaced the stock indices, with the NASDAQ and S&P 500 basically flat over the past 24 hours.\n\nBitcoin’s recent upswing is mainly due to “optimism around a near-term spot Bitcoin ETF approval and a resulting short-squeeze,” Brian Rudick, a senior strategist at crypto trading firm GSR, told Fortune, referring to a Bitcoin-based financial product that traditional investors can trade. And on Thursday morning, BlackRock registered the name “iShares Ethereum Trust” in Delaware, an indication “that it is likely to file a spot ether ETF application soon,” he added.\n\nDavid Lawant, head of research at crypto brokerage and trading platform FalconX, echoed Rudick’s assessment. Bitcoin “continues to perform well as the market focuses on the U.S. spot ETF approval process,” he told Fortune, adding that the “big star of the day” has been Ethereum, following news of BlackRock’s registration of the “iShares Ethereum Trust” name.\n\nhttps://datawrapper.dwcdn.net/ToPGM/2/\n\nThe rapid rise in the prices of major cryptocurrencies continues a month-long rally in the digital assets market. The total market capitalization for all cryptocurrencies has rocketed about 30% since Oct. 9, rising alongside optimism over the likely approval of a spot Bitcoin ETF, or exchange-traded fund.\n\nTraditional investors, who manage trillions of dollars in capital, are largely constrained by the investment products available on portfolio management platforms like Vanguard or TD Ameritrade. If the Securities and Exchange Commission were to approve a spot Bitcoin ETF, which lets traditional investors trade on current Bitcoin prices, crypto industry boosters are betting that tremendous amounts of capital would flow into the Bitcoin—and crypto—markets.\n\nWhile the industry has repeatedly tried and failed to convince the SEC to approve a spot Bitcoin ETF, BlackRock, the largest asset manager in the world, filed an application for its own spot Bitcoin ETF in June. Since then, the crypto markets have rallied, and other financial institutions have filed their own ETF applications, hoping to cash in if the SEC were to approve the application from BlackRock, which has a sterling record of past ETF approvals.\n\nAnd starting Thursday, a brief period for the SEC to approve a spot Bitcoin ETF opened, according to Bloomberg Intelligence analysts, who believe that, even if approvals don’t come in November, there is a 90% chance of approval by January.\n\n“There is significant hype surrounding the recent comments from Bloomberg regarding the ETF ‘window,'” James Butterfill, head of research at CoinShares, told Fortune. “Admittedly, it is always a little worrying when prices rise so sharply. That said, as we enter into this new bull market, it is worth reflecting on the point that we remain well below the all-time-highs seen in 2021.”"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxPelZ3eWk2a3pJSE1BOWY1aHY2RU1mWEU1VUp2dGgxaERES0xGeHpYQXBGZ1lkVnpLNTU2SDk2MVFRTFFvMWZuV0h2YVh4TnY4RlBMYjFMM1B5UEpoQTRBMW1tNTRvWEFsVVd4Sk5wQlBiRF9qRGhfaWhLX2J6MkZJc1Fnb0ZZa0ZHLXVDUjRQWFc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Solana Is on a Tear. So Why Do Ethereum NFTs Remain Top Dog? - Unchained",
        "content": "SOL more than doubled in the last month. But here’s why Ethereum NFTs continue to outperform Solana NFTs by a mile.\n\nSolana is ripping. Not only has general crypto market sentiment turned more positive, which has boosted assets beyond just bitcoin, but Solana also just completed another one of its attention-grabbing conferences, Breakpoint. That’s all led to SOL more than doubling in the past month.\n\nDespite developer interest in Solana, the jump in its token price, and the fact that the speedy chain is known for NFT activity, as of yet, the leading blockchain for NFTs remains Ethereum.\n\nRead more: NFT Trading Activity on Ethereum Surges, Reaching a Six-Month High\n\nAccording to data from CryptoSlam, in the past 30 days, Ethereum led the NFT market in sales volume with $245 million in sales. Ethereum’s activity underscores its dominance, with a vast number of transactions totaling 745,175 and engaging 70,423 buyers.\n\nComparatively, Solana, which stands fourth in the ranking, reported $30.1 million in sales, just 12% of Ethereum’s volume, even after considering the fact that SOL has outperformed ETH by 127% in the last 30 days.\n\nWith Solana struggling to grab market share in the NFT ecosystem, Hildebert Mouiliere, aka Hildobby, a data scientist at VC firm Dragonfly, told Unchained that “a lot of things that appear on [Solana] are just copying what happened on Ethereum, which isn’t very innovative.”\n\nSolana is also battling the fact that Ethereum’s longer history makes it a hub for many types of activity beyond just NFTs. “I think Ethereum has become a center of liquidity for a lot of things,” said gmoney, NFT collector and founder of 9dcc. “And not just NFTs, but also certain tranches of DeFi and what have you. And so I think that’s going to be hard to displace even though there are narratives that build up around other chains.”\n\nHowever, Solana could still become a contender if it builds on the particular advantages of its technology over Ethereum. “I hope that we see in the future some teams actually using what this tech can do to leverage what is lower fees and higher frequency transaction,” said Hildobby.\n\nRead more: Anatoly Yakovenko on Solana’s Astounding Recovery and Its Future Plans\n\nOver a year has passed since marketplaces like Magic Eden sparked a seismic shift in the NFT industry by making creator royalties optional—a move that continues to influence market dynamics.\n\nHildobby noted the complex nature of enforcing such payments and suggested that creators may need to consider additional incentives to encourage voluntary compliance. “It’s impossible to enforce those things,” he said.\n\nAs for where the market could go, Hildobby said he’s looking to the rise of NFT derivatives and lending platforms, which could diversify NFTs as financial instruments. “The vast majority of volume now is around lending, which allows for those high prices to now land at a much discounted rate,” Hildobby explained, emphasizing the potential for these platforms to broaden market participation.\n\nLearn more: What Are NFT dApps?\n\nGmoney also thinks future innovation in NFTs will come in their financialization and bringing real world assets on chain. As an example, he said, “the sneaker resell market is huge,” noting that with NFTs, “you can give them access to credit that they otherwise wouldn’t have.” Once that is a proven application, he said that could show the potential for NFTs to unlock value in other collectors’ items such as watches and handbags. “To me, one of the most interesting things is obviously, definitely the real world asset side of things, because I just think that you need to see the melding of those two worlds at some point, and I think that starts to happen over the next three to five years.”"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxQZEpnRlJlcmhyRUV5cmNfMUx2bERRNnV5ZzVjcUpUODlpLVZhdU5XdmNyRDduMFRWTFdnc3ZSM2lncDFLcGxoYkJibHNHazcwd2ZnQzM5ZGczdGhIM2wtbmFueUtIdFlOVTl1WTFuM2FfTFFkR3NxbjR0cmpfREdzQ09mNllHa3BjdlhvdVZ6RXlMY2ZD?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Nov 2023 08:00:00 GMT",
        "title": "Price Analysis: Ethereum Hits 6-Month High on BlackRock ETF Speculation - Crypto Briefing",
        "content": "Share this article\n\nEthereum prices topped $2,050 Thursday, reaching the highest level since May. The rally comes amid rumors that BlackRock may soon file for an Ether ETF.\n\nThe chart shows Ethereum remains in a clear uptrend, with the 50-day SMA and 20-day EMA providing dynamic support.\n\nHowever, the RSI is overbought at 80, signaling the rally may be overextended short-term. This could lead to a pullback or consolidation as the indicator cools off.\n\nUpside resistance may emerge around the current highs and psychological levels above $2,000. Support could be present around the key moving averages.\n\nIf the uptrend continues, Ethereum could target new highs above $2,100. But overbought conditions raise the chance of a correction, which could retest previous lows if the trend shifts bearish.\n\nBlackRock registered the iShares Ethereum Trust this week, sparking speculation it will submit an ETF application to the SEC soon. The asset manager took a similar step before filing for a Bitcoin ETF."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE9pVlR2czA1dU8tUF81cFRxeV9HSnJzbTh2aDQwYm5HdUZRMGEwVHFPLUY5dUd2bHFLZ2NUa0tvRXNKbXdBQzBLLXBXSFRBZ0ZXVE1WTUJQM19Gb0NFVzVQbmZsSVJsNjI4ZDJzZW5INHBRdUhsNEJ3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Nov 2023 08:00:00 GMT",
        "title": "Laser Digital Asset Management Launches Ethereum Adoption Fund for Institutional Investors - nomuraholdings.com",
        "content": "\n\nTweet *Twitter share button is not available on your current browser. PDF (426KB) Laser Digital Asset Management Launches Ethereum Adoption Fund for Institutional Investors\n\nLONDON, UNITED KINGDOM/DUBAI, UAE, 9 NOVEMBER 2023 - Nomura's digital assets subsidiary, Laser Digital, today announces the launch of their Ethereum Adoption Fund. The Fund, which invests in long-only spot positions in Ethereum, also deploys a yield enhancement strategy by staking the Ethereum held by the fund.\n\nIt is the second in a series of digital adoption investment solutions that Laser Digital Asset Management began launching in September, starting with the Laser Digital Bitcoin Adoption Fund.\n\nThe 'Laser Digital Ethereum Adoption Fund SP' is a segregated portfolio of Laser Digital Funds SPC (a segregated portfolio company incorporated with limited liability under the laws of the Cayman Islands under registration number MC-401019). Komainu, which is regulated by the UK Financial Conduct Authority and the Virtual Asset Regulatory Authority in Dubai, will provide secure, regulated custody for the fund's assets.\n\nLaser Digital Asset Management is led by Sebastian Guglietta, who was previously Nomura's Chief Scientist Officer, prior to which he was a Portfolio Manager and Senior Scientist at Brevan Howard. Sebastien has over 25 years of experience in the domain of systematic investment strategies, derivatives and macro trading. Fiona King, Head of Distribution, joined Laser from Nickel Digital Asset Management, where she was Managing Director and Global Head of Institutional Business and prior to this she was at Bank of America Merrill Lynch responsible for their UCITS alternative platform.\n\nOn launching the fund, Sebastien Guglietta, Head of Laser Digital Asset Management commented: \"Technology is a key driver of economic growth and transforms a large part of the economy from being analogue to digital. Ethereum is one of the enablers of this long-lasting transformational change. Hence, being exposed to Ethereum in the long run is considered a solution to capture this structural technology trend and the pace at which the Web 3.0 economy expands its network effect.\"\n\nFiona King, Head of Distribution, Laser Digital Asset Management added: \"We're excited to now be able to offer institutional investors a regulated product to allow investment and even staking in Ethereum. Our product simplifies digital asset investment strategies, driving institutional engagement securely.\"\n\nLaser Digital was launched by Nomura and was co-founded by Steven Ashley, who previously led Nomura's wholesale division and Jez Mohideen, who was Nomura's Chief Digital Officer and Co-Head of Global Markets EMEA. Headquartered in Switzerland, Laser Digital combines the rigor, best practices, and capabilities from global investment banking with the experience of a crypto-native team.\n\nMedia Contact:\n\nSophie Arnold\n\nHead of Communications\n\nSophie.arnold@laserdigital.com\n\nAsset Management Contact:\n\nFiona King\n\nHead of Distribution\n\nFiona.king@laserdigital.com\n\nGeneral Queries:\n\nam@laserdigital.com\n\nAbout Laser Digital\n\nBacked by Nomura, Laser Digital delivers scalable, robust opportunities in digital assets across trading, asset management, and ventures. The team works at higher risk management standards, compliance, and commercial viability, all driven by a belief in more responsible engagement in digital assets. With an open and dynamic culture, Laser Digital has the freedom to adapt to market needs, to move swiftly to capitalisation, and to share learnings with clients and partners – bringing greater confidence to the institutional market for the benefit of all. For more information, please visit Laser Digital\n\nLaser Digital UK Ltd, FRN 1000108, is an appointed representative of Strata Global Ltd, which is authorised and regulated by the Financial Conduct Authority, FRN 563834. Strata Global Ltd is registered in England & Wales with company number 07707508 and whose registered office is at 7-11 Moorgate, London EC2R 6AF\n\nDisclaimer\n\nMarketing communication: This document is a marketing communication addressed exclusively to professional and institutional investors. This document is not a contractually binding document or an information document required by any legislative provision, and is not sufficient to take an investment decision.\n\nNo offering: Nothing in this document amounts to, or should be construed as, an offer, placement, invitation or general solicitation to invest in any fund or to buy or sell securities, digital assets, or to engage in any other related or unrelated transactions. This document was not prepared in compliance with applicable provisions of law designed to promote the independence of financial analysis and is not subject to a prohibition on trading following the distribution of financial research. This document does not purport to contain all of the information that may be required to evaluate any potential transaction and should not be relied on in connection with any such potential transaction. Any future offers to invest in the fund/other products will be subject to the terms of the fund's constitutional documents and/or relevant offering documentation.\n\nNon-reliance: The document is not a recommendation and should not be relied upon as accounting, legal, tax or investment advice. You should consult your tax, legal, accounting or other advisers separately. Neither this document nor the information contained in it is for publication or distribution, directly or indirectly, in or into any jurisdiction where to do so might constitute a violation of applicable law. None of Nomura, Laser Digital, their group companies or any of their respective directors, officers, employees, partners, shareholders, advisers, agents or affiliates (together the \"Sponsor Parties\") make any representation or warranty, express or implied, as to the accuracy or completeness of the information contained in this document, and nothing contained in it shall be relied upon as a promise or representation whether as to past or future performance. To the maximum extent permitted by law, none of the Sponsor Parties shall be liable (including in negligence) for direct, indirect or consequential losses, damages, costs or expenses arising out of or in connection with the use of or reliance on this document. The information contained in this document is unaudited. It is published for the assistance of recipients, but is not to be relied upon as authoritative and is not to be substituted for the exercise of one's own judgment. A mutual fund licence issued or a fund registered by the Cayman Islands Monetary Authority does not constitute an obligation of the authority to any investor as to the performance or creditworthiness of the fund. Furthermore, in issuing such a licence or in registering a fund, the authority shall not be liable for any losses or default of the fund or for the correctness of any opinions or statements expressed in any prospectus or offering document.\n\nDigital assets: Digital assets regulation is still developing across all jurisdictions and governments may in the future restrict the use and exchange of any or all digital assets. Digital assets are generally not backed nor supported by any government or central bank, are not insured by depositor nor investor guarantees schemes and do not have the same protections countries' bank deposits may have and are more volatile than traditional currencies and/or other investments. Transacting in digital assets carries the risk of market manipulation and cybersecurity failures such as the risk of hacking, theft, programming bugs, and accidental loss. Differing forms of digital assets may carry different risks. In certain circumstances it may not be possible to liquidate a digital assets position in a timely manner at a reasonable price. The volatility and unpredictability of the price of digital assets may lead to significant and immediate losses.\n\nRisks: An investment in any of the products mentioned herein involves significant risks, including loss of an investor's entire capital investment. Alternative investment strategies are intended only for investors who understand and accept the risks associated with investments in such products and these products are not suitable for all investors. Investments in digital assets are high-risk investments and you should not expect to be protected if something goes wrong. The volatility and unpredictability of the price of digital assets may lead to significant and immediate losses. You are invited to do all the necessary research and learn before investing in digital assets. In considering any performance data in this document, you should bear in mind that past or targeted performance is not indicative of future results, and there can be no assurance that any of the fund would achieve its investment objectives, comparable results or that target returns would be met. Past performance is not a guide to future performance, future returns are not guarantees and a loss of original capital may occur. The price and value of investments referred to in this document may fluctuate.\n\n*UAE (excluding ADGM and DIFC): In the UAE (excluding ADGM and DIFC), this document is issued by Laser Digital Middle East FZE (\"LDME\"). LDME is the investment manager of the fund and is authorised and regulated by the Dubai Virtual Assets Regulatory Authority (\"VARA\") with registered number VL/23/06/001. We are registered in Dubai, and only deal with or for Qualified Investors and Institutional Investors as defined by VARA.. Our registered office is located at One Central, Office 3, Level 3, Unit 345, Dubai, UAE Additional information on LDME and the relevant regulatory disclosures may be found at Laser Digital Middle East FZE. The information contained herein, does not constitute, and is not intended to constitute, a public offer of securities in the United Arab Emirates (\"UAE\") and accordingly should not be construed as such. The shares are only being offered to a limited number of exempt investors in the UAE who (a) are willing and able to conduct an independent investigation of the risks involved in an investment in such shares, and (b) upon their specific request. The shares have not been approved by or licensed or registered with the UAE Central Bank, the Securities and Commodities Authority, or any other relevant licensing authorities or governmental agencies in the UAE. No transaction will be concluded in the UAE and any enquiries regarding the Shares should be made to Laser Digital UK Ltd at 1 Angel Lane, London, EC4R 3AB.\n\n*UK: This document is being issued in the United Kingdom by Laser Digital UK Ltd, I Angel Lane, London EC4R 3AB, United Kingdom, to and/or is directed only at persons who are professional investors for the purposes of the Alternative Investment Fund Managers Regulations 2013, as amended and is accordingly exempt from the financial promotion restriction in Section 21 of the Financial Services and Markets Act 2000 (\"FSMA\") in accordance with section 29(3) of the FSMA (Financial Promotions) Order 2005. The opportunity to invest in the fund mentioned herein is only available to such persons in the United Kingdom and this document must not be relied or acted upon by any other persons in the United Kingdom. Laser Digital UK Ltd, FRN 1000108, is an appointed representative of Strata Global Ltd, which is authorised and regulated by the Financial Conduct Authority, FRN 563834. Strata Global Ltd is registered in England & Wales with company number 07707508 and whose registered office is at 7-11 Moorgate, London EC2R 6AF. This presentation as well as any additional document may only be distributed and the interests in any of the funds may only be offered or placed in the United Kingdom to the extent that (1) the fund is permitted to be marketed to professional investors in the United Kingdom in accordance with Alternative Investment Fund Managers Directive (Directive (2011/61/EU) (the \"AIFMD\") (as it forms part of the domestic law of the United Kingdom); or (2) this document as well as any additional document may otherwise be lawfully distributed and the interests in the fund may otherwise be lawfully offered or placed in the United Kingdom (including at the initiative of the investor). All, or most, of the rules made under the FSMA for the protection of retail clients will not apply, and compensation under the United Kingdom Financial Services Compensation Scheme will not be available.\n\nEEA: As at the date of this document, none of the funds rereferred to herein has been approved, notified or registered in accordance with the Alternative Investment Fund Managers Directive (Directive (2011/61/EU) (the \"AIFMD\") for marketing to professional investors in any member state of the EEA (each a \"Relevant State\"). However, such approval may be sought or such notification or registration may be made in the future. Therefore, this document and any additional documentation may only be transmitted to an investor in a Relevant State at such investor's own initiative.\n\nJapan: None of the shares in any of the funds have been and will not be registered pursuant to Article 4, Paragraph 1 of the Financial Instruments and Exchange Law of Japan (Law no. 25 of 1948, as amended) and, accordingly, none of the shares nor any interest therein may be offered or sold, directly or indirectly, in Japan or to, or for the benefit, of any Japanese person or to others for re-offering or resale, directly or indirectly, in Japan or to any Japanese person except under circumstances which will result in compliance with all applicable laws, regulations and guidelines promulgated by the relevant Japanese governmental and regulatory authorities and in effect at the relevant time. For this purpose, a \"Japanese person\" means any person resident in Japan, including any corporation or other entity organised under the laws of Japan\n\nSwitzerland: The offer and marketing of fund shares in Switzerland will be exclusively made to, and directed at, qualified investors (the \"Qualified Investors\"), as defined in Article 10(3) and (3ter) of the Swiss Collective Investment Schemes Act (\"CISA\") and its implementing ordinance, to the exclusion of qualified investors who have opted-out pursuant to Article 5(1) of the Swiss Financial Services Act and without any portfolio management or advisory relationship with a financial intermediary pursuant to Article 10(3ter) CISA (\"Excluded Qualified Investors\"). Accordingly, the fund has not been and will not be registered with the Swiss Financial Market Supervisory Authority and no representative or paying agent has been or will be appointed in Switzerland. This document and/or any other offering or marketing materials relating to the Shares may be made available in Switzerland solely to Qualified Investors, to the exclusion of Excluded Qualified Investors. The legal documents of the fund may be obtained free of charge from the Investment Manager.\n\nCayman Islands: No offer or invitation may be made to the public in the Cayman Islands to subscribe for the shares.\n\nRestricted jurisdictions: The distribution of this document and the offering of shares in the fund may be restricted in certain jurisdictions. The information below is for general guidance only, and it is the responsibility of any person or persons in possession of this document and wishing to make an application for shares to inform themselves of and observe all applicable laws and regulations of any relevant jurisdiction. Such persons should also inform themselves of any applicable legal requirements, exchange control regulations and taxes in the countries of their respective citizenship, residence or domicile. This document does not constitute an offer or solicitation to any person in any jurisdiction in which such an offer or solicitation is not authorised or to any person to whom it would be unlawful to make such an offer or solicitation. In particular, this document does not constitute an offer of securities to sell or a solicitation of an offer to purchase in or into the United States, Canada, Australia, or Japan. The securities of Laser Digital Funds SPC to which these materials relate have not been and will not be registered under the United States Securities Act of 1933, as amended (the \"Securities Act\"), and may not be offered or sold in the United States absent registration or an applicable exemption from, or in a transaction not subject to, the registration requirements of the Securities Act. There will not be a public offering of securities in the United States.\n\nRestrictions on investors: The fund referred herein is not available for subscriptions from retail investors in any jurisdictions. No key information document has been prepared in respect of any sub-class of shares in accordance with Regulation (EU) No 1286/2014 on key information documents for packaged retail and insurance-based investment products (PRIIPs) (and, in the case of the United Kingdom, such regulation as it forms part of the domestic law of the United Kingdom). Accordingly, shares in the fund are not available to, and no person may advise on, offer or sell shares for or to, any retail client (as defined in MiFID 2) in any jurisdiction, including, but not limited to, any EEA Member State, the UAE or the United Kingdom"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE1nTDZEeWduMWdMWWxjRkttQnpxbXBEQzZpcTRBWFgxMGZCVzVRa2NvcG9mb0VUNWhlVWROOGtBWk82aFpQbmlzZ3M0dlVscEFHTjRjQW1jMGxOb2RlQS1Fa2tfdmI4cW5XQlUzdDBRZGVCRThRNHBMQTdB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Ethereum gets a BlackRock boost, but the real test lies ahead - Fortune",
        "content": "Happy Friday. The week is ending on a high note for Ethereum, which is back in the news after financial giant BlackRock filed to launch an ETF backed by Ether, the blockchain’s native currency. This led the price to jump 10%, back over the $2,000 mark, for the first time in months as investors bet that BlackRock’s entry will attract billions of dollars in new capital.\n\nThis development brings renewed attention to the world’s second-largest cryptocurrency, which has largely been overshadowed by Bitcoin and even Solana during the long-awaited rally of the last two months. But while Ethereum boosters are rightfully enjoying the price surge, the return of the spotlight has also raised some familiar concerns.\n\nThese include griping about Ethereum’s transactions costs, known as gas fees, which have soared along with the burst of activity on the blockchain that has come with more trading. For long-time crypto watchers, this will bring back unpleasant memories of 2017 and 2021 when hype over Ethereum’s smart contract promise led to a surge in price—followed by the blockchain slowing to a crawl, which in turn forced those who wanted to transact to pay outrageous fees.\n\nEthereum’s momentous shift last year to a proof-of-stake system was supposed to alleviate the price and congestion issues, along with so-called layer-2 solutions—sub-layers on the network that process transactions in batches and then record them on the main blockchain.\n\nThe trouble is that while the layer-2 systems do indeed lower costs dramatically, they add complexity and make the Ethereum user experience—already an ordeal for those who aren’t crypto diehards—even more of a headache. They are also less secure. This has led some to gripe that Ethereum should have devoted its energy to making its main network cheaper and efficient rather than outsourcing the task to other projects.\n\nFinally, the switch to proof of stake has also raised concerns over centralization as a relatively small amount of validators are now responsible for maintaining the network—a fact that Bitcoin purists, never gracious at the best of times, have lampooned mercilessly as part of the crypto world’s eternal infighting.\n\nNone of this means that Ethereum is facing major trouble—the network is the leading smart contract for a reason, with by far the most users and a robust and dedicated developer community. But as a new crypto bull market emerges, it will be harder for the platform to blame familiar headaches on growing pains. Ethereum is now almost a decade old, and the time has come for it to show it can deliver on its enormous potential.\n\nJeff John Roberts\n\njeff.roberts@fortune.com\n\n@jeffjohnroberts\n\nDECENTRALIZED NEWS\n\nChainlink's LINK token is up 175% since January as the oracle provider has branched out from pure crypto pricing to tie-ups with the TradFi sector. (Fortune)\n\nThe notorious \"Cryptoqueen\" who oversaw legal and compliance for Ponzi-like OneCoin pled guilty in the $4 billion fraud. (WSJ)\n\nEconomist Nouriel Roubini, a.k.a Dr. Doom, has long been a fierce critic of Bitcoin and crypto, but in a surprise move is launching his own stablecoin. (The Defiant)\n\nIn a first-of-its-kind crypto bankruptcy exit, a restructuring plan will give Celsius customers 37 cents on the dollar and shares in a new company dedicated to staking and mining. (WSJ)\n\nBitcoin brushed $38,000 on Thursday, the highest the token has traded in 18 months. (Fortune)\n\nMEME O’ THE MOMENT\n\nTFW you learn one-third of Ethereum nodes are 20 miles from CIA headquarters:"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxOaDFEVjgzYUx3OW8yVng3N2cyanJYUlM2cmFleGtPM2dxQzYwMWJFWEowZW1vMTFJMEw3SlJ4XzlZNzJhWkhsVmZNS1RJeDNwWUhBcllqS3BfNjFWMzJNMWVWR2V6eFZ3NjIxZjNfQUhDaFZjOEE2eC1ES0lSRnlNaHpxQ2IxcjRZMFF6UGdieldiU0lzVzFXWTg2bzJZUk0yV0xtWDZES1RyeWtNdmRWb0ZyYnBHN2JZdUcxVzZQbktiVE0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Nov 2023 08:00:00 GMT",
        "title": "Ethereum, Ripple and Solana Price Forecast: ETH Breaks $2K, Bull Run or Bubble? - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTFAwUVFFM3dJUDlWWjBiYkNsRUNXbXJxMDNHakVIMTM2UUdUTktpZi1zdnBscTdSUlJyZlVCdHhYRVpmRWY0bUtJY254cVpCbTNYMndSX2M1YWFObkFUM3dUX3ZsaHB4WFZOVmhBa1BZckNvaERo0gF8QVVfeXFMTk0zYUJLajQxS3dtc1duT0tPX19GXzFuOU9vdmp6WndmMHprUmEwZUREa0JrX21PWjcyckFsVFZxcm56aGZJaGxuaTVLNnJ6Zm15aWdSbG14aUdDaDB3RGt3M001UW52Qy1SQkVlOGRuNDFBZG0yVDFPSjlidA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Has Gone Deflationary Again—Here's Why and What It Means - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe global Ethereum supply has contracted by just over 4,700 ETH, or about $9.5 million, since Monday, according to data aggregator ultrasound.money.\n\nWhile that figure pales in comparison to the cryptocurrency’s massive $243.4 billion market capitalization, it is nonetheless eyebrow-raising: ETH has not experienced such a prolonged deflationary period in months, and the rally appears to have halted the token’s recent inflationary spiral.\n\nAnd perhaps not coincidentally, the market currently likes what it sees when it comes to Ethereum: Earlier today, ETH touched $2,000 for the first time since July. At writing, the token sits at $2,020, up 6.7% in the last 24 hours.\n\nSo, what’s behind ETH’s deflationary sea change this week? And how long can the momentum be expected to last?\n\nAD\n\nAD\n\nThanks to the fee-burning mechanism that’s governed Ethereum since 2021, the more traffic on the network, the higher gas fees rise. And the higher gas fees rise, the more ETH is “burned” by the network, or permanently removed from circulation. That means increased traffic on the Ethereum network could lead to more ETH being removed from circulation than created on a yearly basis.\n\nIndeed, average gas fees on Ethereum have more than doubled since Sunday, according to Etherscan; at writing, for example, the average Uniswap transaction requires $16.35 worth of gas. Transferring an NFT on Rarible currently costs around $21.77.\n\nBut what accounts for the increase in activity on the network?\n\nAD\n\nAD\n\nNFT trading volume hit a three month high this week. Are degens flipping jpegs again? And are they to thank for Ethereum’s short-term comeback? Probably not, says Alice Kohn, Glassnode’s head ETH analyst—those bumps may be a red herring.\n\n“There has been a surge in NFT-related activities, hinting at a possible resurgence in the NFT market,” Kohn told Decrypt. “However, these activities remain relatively modest compared to the NFT boom witnessed earlier in the year.”\n\nKohn does not believe that this week’s ETH deflation can be attributed to minor fluctuations in NFT trading. Instead, she’s found that the deflation mostly stemmed from another source: altcoins.\n\nEthereum, being the permissionless network that it is, allows for anyone to create a blockchain-based token for just about anything. These tokens, typically of the ERC-20 variety, trade on both centralized and decentralized exchanges, such as Uniswap, and make up a significant portion of the altcoin market.\n\nUniswap currently ranks as the leading gas guzzler on the Ethereum network, per Etherscan, with transactions on the protocol accounting for about 13% of all Ethereum traffic; once-dominant NFT platforms like OpenSea and Blur, which similarly led in gas fees during the NFT bull run, are hardly making a dent these days.\n\n“The latest uptick in network activities, which led to the deflationary turn for the ETH supply, clearly comes from altcoins,” Kohn said. “The latest surge in interest, particularly evident in GameFi tokens, underscores the evolving landscape of the crypto market.”\n\nNumerous ETH-based tokens have enjoyed substantial rallies this week—LINK is up 27.2%, and PEPE is up 12%, for example. Those gains appear to be riding a macro tide that, in the last seven days, also lifted altcoins XRP, Cardano, and Solana by between 11% and 20%—potentially indicating renewed investor interest in Bitcoin alternatives.\n\nSome analysts have predicted that Ethereum’s altcoin-fueled deflationary run this week could signal that the bottom is in for the token, and that ETH is now set to climb towards $3,000. But Kohn isn’t so certain that renewed altcoin interest is strictly a good thing for Ethereum’s short-term health.\n\nAD\n\nAD\n\n“There's a possibility that funds may flow into BTC first and then navigate down the risk curve directly into altcoins, bypassing ETH,” she said. “This could position ETH in a challenging scenario, sandwiched between BTC as the premier crypto asset and more enticing risk-on altcoins.”\n\nDisclaimer The views and opinions expressed by the author are for informational purposes only and do not constitute financial, investment, or other advice."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFA5QlR4S25jVFk4ZXRGUE1RWGc1eERiN1R4WFZKQURoU1hJUHdZQ3BDdEFaYkt0ZXRMSXBTdExFQ01lcUFVaWtBWDVsVVNBdEN4dFZwa2lOZHprY0haYVRyX1N3MGFXN0hiQThwTlZQQ3pJbFBNMXhBeHB0NkPSAYQBQVVfeXFMTlg0RnZ2cDU1Q2JYT0RzTEY5UUlseDNSVTBMazZ3RHpEd2J0cExSbmpnUjNvUUxNV0dpUGtLVGpCdHBkZW1RN0w5VjhrRHYxSWo4T3VrdHNXY1hRQl92UDljcTJKRVFrOWFWMHdscmNfdUJSNzM1ZmQxRmZiQU1TbWJpY05s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Here We Go Again: Pet Rock JPEGs on Bitcoin, Ethereum Sell for Over $100K - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThis week, half-giddy, half-cautious optimism spread across crypto circles as Bitcoin surged past $37,000 for the first time in 18 months on excitement regarding the approval a spot Bitcoin ETF, and Ethereum pumped past $2,100 on similar news of a pending ETH ETF application from BlackRock.\n\nThere’s clearly an emergent hope within crypto that the bottom—finally—is in. But to those who protest that it could never be a true bull market without obscenely expensive, seemingly pointless JPEGs trading hands: there’s now reason to rejoice on that front as well.\n\nOn Friday, two separate on-chain images of illustrated rocks—one hosted on Ethereum as an NFT, the other inscribed on Bitcoin as an Ordinal—sold for six-figure respective sums on secondary markets.\n\nAn NFT from the EtherRocks collection, EtherRock #95, traded hands this morning for 100 ETH, or just over $209,000. Just hours prior, an Ordinal from the visually identical Bitcoin Rock collection sold for 2.99 BTC, worth just over $111,000 at writing.\n\nAD\n\nAD\n\nThe JPEGs do not come with any affiliated memberships or perks, or anything that doesn’t meet the eye. They are, quite simply, lightly illustrated images of nearly indistinguishable gray boulders that don’t even feature backgrounds.\n\nBitcoin Rock #75 has sold for 3btc on the secondary market. Congratulations to @Scobra9000 on the sale. A warm welcome to @GrantWSchneider, already a legendary collector in the ordinals community, who has now taken it to the highest level. pic.twitter.com/wkqkk8Kbn9 — BITCOIN ROCKS ◉ (@ordrocks) November 10, 2023\n\nDumb as rocks?\n\nEtherRocks first launched in 2017 to little fanfare. Only during the height of the NFT bull run, in late 2021, did the 100-piece collection catch fire—largely as a means to poke fun at the absurdity of value and the crypto market. Individual EtherRocks regularly sold at the time for hundreds of thousands of dollars a piece; one sold for the equivalent of $1.3 million.\n\nAD\n\nAD\n\n“Monetary value of art is all an illusion,” an EtherRocks buyer wrote at the time. “The pet rocks present the perfect shock value, it’s so stupid that it’s perfect. Fate loves irony.”\n\nIn January, an apparently unaffiliated Ordinals user inscribed a set of 100 images almost identical to the EtherRocks onto small denominations of Bitcoin, creating a new collection: Bitcoin Rocks. While that Ordinals collection has not enjoyed the same success as its Ethereum predecessor, it has generated five-figure secondary market sales in recent months.\n\nIn the context of recent market trends, though, Friday’s sales appear to be hitting differently. Numerous Twitter users saw the news as a harbinger of the return of the type of obscenity, absurdity, and flagrant financial foolishness that defined the previous crypto bull run.\n\nLol that scam again.\n\nWe're so back — Dr.M₳ryJ⚡I buy Shitcoins,I hold ₿itcoin ❤₳d₳ᴺᶠᵀ𓊽 (@mary_el83) November 10, 2023\n\nMembers of the crypto community appear divided about whether that’s a good thing or a bad thing.\n\nThis space never fails to amaze me — sugarspicysauce (@sugarspicysauce) November 10, 2023\n\nBut despite the return of bull market antics, crypto activity is nowhere close to the levels enjoyed when EtherRocks were last ascendent. Though Bitcoin Ordinals trading did indeed hit a six-month high earlier this week, and NFT trading volume posted its best numbers since August, those numbers still pale in comparison to the type of volume witnessed during the 2021/2022 NFT bull run.\n\nLast week’s apparently encouraging NFT figures, for example, marked a 93% decrease in trading volume from the market’s peak in April 2022. But these pricey digital rock purchases point to at least a desire for the same kind of frothy, frenzied excitement that defined that earlier era.\n\nAD\n\nAD\n\nEdited by Andrew Hayward"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiX0FVX3lxTE0zcENXYWNVTFZIYUNRME81aHhxRDd2SDlGR08zZk9UUVJlMjdOd2FRYjZjQlNDcTctSUxmUlNvZGtiMG9uTGhkdEdDbkhucEVPUEQxV2lrQmhvV1JoeU9j0gFnQVVfeXFMUHhkbzcyTUpMSzc5WldURFdGc1I1c0pHSF9GRFNUZFVFTXNfa19oVzVfdGZNT3JxV0w4aUQzZGNxZGJ3Qno0T255d3EySVNfaFhaWXdtRktDTGVDRngzQnlsc3lLQkpLSQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Tops $2,000 for First Time Since July - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEthereum (ETH) has roared past $2,000 for the first time in four months.\n\nAccording to CoinGecko data the second-largest digital asset by market cap was trading for $2,030 at the time of writing—an 8% jump in the past 24 hours.\n\nETH hasn't been this high since July 13. The asset has boomed with Bitcoin (BTC), the biggest coin in the space, which today hit an 18-month high.\n\nWhile ETH hasn't seen the same gains as BTC this year, it is still up significantly—by more 60% since January.\n\nAD\n\nAD\n\nBut like most coins and tokens, Ethereum still has a long way to go before it passes its November 2021 all-time high of $4,878.\n\nBig investors are eying up ETH, though. A report by fund manager CoinShares on Monday said that crypto products related to ETH recently received their biggest inflows—$17.5 million in a week—since August of last year.\n\nEthereum and other major coins and tokens have seen a significant bump in value today as BTC jumps in price. The rally is likely linked to the chance that traditional investors may soon have access to the digital asset market via a spot Bitcoin exchange-traded fund (ETF).\n\nSuch a fund would give investors exposure to crypto via shares that track its price. Major investment firms have been applying to the U.S. Securities and Exchange Commission for a spot Bitcoin ETF for years only to face rejection.\n\nAD\n\nAD\n\nBut analysts at Bloomberg Intelligence said Wednesday that the SEC now has an eight-day window to approve all 12 Bitcoin ETFs filed by major Wall Street firms—including BlackRock—starting from today. This led to a rally in crypto prices.\n\nOther than Bitcoin and Ethereum, other major altcoins are up significantly. Meme coin Pepe (PEPE), which launched earlier this year, is one of the best-performers, having notched up 23% in value in the past day. It's currently trading for $0.00000141.\n\nWhile out of the top 20 coins and tokens, Solana (SOL)—which is one of the top gainers over the past month—continued to rally: it's up over 9% in the past day and is trading hands for $46.58.\n\nEdited by Stacy Elliott."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE51c1BkZ3RtY0QxYjVRNDdKeWdHaHdxUlpNaDRuWXVSLUNHQjBEbENUWnB4LWJKb1drdDRKMTJWXzJaNzkzX0JxNTFNSi1yN2lkZWwxOHRJaV8xZXVibHVScXVfcW5pdTluenY0TnpMamxtQktCT1FMUHF2SQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Nov 2023 08:00:00 GMT",
        "title": "BlackRock Ethereum ETF sparks surge in ETH/BTC ratio - CryptoSlate",
        "content": "What is CryptoSlate Alpha? A web3 membership designed to empower you with cutting-edge insights and knowledge, powered by Access Protocol. Learn more ›\n\nConnected to Alpha Welcome! 👋 You are connected to CryptoSlate Alpha. To manage your wallet connection, click the button below.\n\nImportant: You must lock a minimum of 20,000 ACS If you don't have enough, buy ACS on the following exchanges: Coinbase Kucoin Orca\n\nConnect via Access Protocol Access Protocol is a web3 monetization paywall. When users stake ACS, they can access paywalled content. Sign up for Access ›\n\nDisclaimer: By choosing to lock your ACS tokens with CryptoSlate, you accept and recognize that you will be bound by the terms and conditions of your third-party digital wallet provider, as well as any applicable terms and conditions of the Access Foundation. CryptoSlate shall have no responsibility or liability with regard to the provision, access, use, locking, security, integrity, value, or legal status of your ACS Tokens or your digital wallet, including any losses associated with your ACS tokens. It is solely your responsibility to assume the risks associated with locking your ACS tokens with CryptoSlate. For more information, visit our terms page."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMigwJBVV95cUxPaFhXTkRxcmpqbHBTOW5JSjYyWVotUjExYXI2STFvSDMzNTgwU0dkdDNkNmhwOS1GYjk3a0RCdnNvMWFhVkhXOTNfT1g2TG0xQ3g2UnJPTDExMEwwRUFfQjZGRVl6ZUF1c0Q4VG9XUDYyNjMtVTZiUUFhNzAyQVRoWTFSSUltaEp0eUxnZWRjUldzSHhNaUxOcjZFWWlvTlNZQnVnMHQxVzFMcTExZWxYcDhNXzE1Zlh4Y2tQWGdSNkNYOW9BNUZkWlpDamg3UC15WGRraHBpaW5TZkFUaWVDRVlQWTZQMXFzVk9PcGp1WDlFMGN4S1pHOTh4eHh4X21DeG1z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "NEAR Foundation and Eigen Labs partner to enable faster, cheaper Web3 transactions for Ethereum rollups via EigenLayer - PR Newswire",
        "content": "The fast finality layer will solve communication and latency issues for L2 builders while also improving usability and security\n\nLISBON, Portugal, Nov. 10, 2023 /PRNewswire/ -- NEARCON: The NEAR Foundation and Eigen Labs today announced a collaboration to build a fast finality solution that will soon power faster, less expensive transactions for Ethereum rollups, including cross-rollup transactions––a first of its kind in Web3.\n\nNEAR Foundation and Eigen Labs partner to enable faster, cheaper Web3 transactions for Ethereum rollups via EigenLayer\n\nThe NEAR Foundation and Eigen Labs teams are working together to build the first-ever \"fast finality layer\" for Ethereum rollups, which enables transactions to be processed within 3-4 seconds––rather than minutes, hours, or even days––and 4000x cheaper than the current options. This will also enable secure, low-latency cross rollup communication and solve one of the biggest challenges for founders and developers using rollups today.\n\nThis advancement will reduce liquidity fragmentation between Layer-2s through increased efficiency while also allowing them to make individual decisions around the sequencers they use to process those transactions, either on-chain or off-chain. The fast finality layer retains all Ethereum security guarantees while adding both NEAR and EigenLayer guarantees, making it an attractive option for any team building on Ethereum L2s.\n\nIllia Polosukhin, co-founder of NEAR Protocol, said: \"NEAR Foundation is proud to partner with such an excellent team as Eigen Labs to offer a fast finality layer for ETH rollups. The fast finality layer showcases the strengths of NEAR's technology while making the Open Web more usable, which has always been the core goal for NEAR. It will also help defragment liquidity for Ethereum rollups and make all of Web3 more interoperable as a result.\"\n\nSreeram Kannan, founder of Eigen Labs, said: \"We are thrilled to partner with the highly innovative team behind the NEAR protocol. This is a mutually beneficial partnership that will leverage both NEAR and EigenLayer's technologies to make it easier, faster, and cheaper for developers to build on Ethereum.\"\n\nFor EigenLayer, this collaboration will provide fast settlement for cross-rollup transactions and showcases adoption of restaking across the Ethereum ecosystem and beyond. For NEAR, the collaboration will also extend to transitioning the NEAR-Ethereum Rainbow Bridge to an actively validated service (AVS). This will create a better bridging experience between NEAR and Ethereum. Transactions will reach finality faster, with stronger security guarantees and decentralization.\n\nBowen Wang, Director of Protocol at Pagoda, the NEAR ecosystem team building the fast finality layer, said: \"Pagoda is proud to work with Eigen Labs, a world-class team, to cobuild the fast finality layer. This solution improves the composability with Ethereum L2s and reduces liquidity fragmentation within the rollup ecosystem.\"\n\nA testnet is expected to launch in Q1 2024, and more details will be shared around that time. For the latest news from NEAR Foundation or EigenLayer, please check our websites, follow us on social, or join our communities:\n\nNEAR Foundation website: https://near.foundation/\n\nNEAR Foundation X/Twitter: @nearprotocol\n\nNEAR Foundation Telegram: @cryptonear\n\nEigenLayer website: https://www.eigenlayer.xyz/\n\nEigenLayer X/Twitter: @eigenlayer\n\nEigenLayer Telegram: @eigenlayer\n\nAbout NEAR Foundation\n\nThe NEAR Foundation is a Switzerland-based non-profit foundation whose mission is to enable community driven innovation to benefit people around the world. One of its core areas of focus is the NEAR ecosystem, which includes a fully operational decentralized Blockchain-based platform for building decentralized applications.\n\nNF carries out its mission, primarily through the allocation of support and resources to other nodes in the near ecosystem, rather than via direct intervention or operations.\n\nNF's ultimate goal is to minimize its own scope and footprint by continuing to divide functions and resources to the ecosystem; and support the development of decentralized infrastructure necessary for those ecosystem functions to operate in a self-sufficient manner. For more information visit the website , follow us on social, or join our communities:\n\nNEAR Foundation X/Twitter: @nearprotocol\n\nNEAR Foundation Telegram: @cryptonear\n\nAbout Eigen Labs\n\nEigenLayer provides developers with access to the Ethereum staked capital base and decentralized validator set. Access to this trust network can make previously impossible mechanism designs possible.\n\nMedia contacts:\n\nGeorgia Hanias\n\nNEAR Foundation\n\n[email protected]\n\n+44 (0) 7812211403\n\nSOURCE NEAR Foundation"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxQR0swZzg2MVoxcnREeE0wbVU4Y2hwdFJGZlJINVlGTVZ4Zkc4SWxvY1AzYWpPM2RHOFBXWko5R0Z4a0V2N1hIZDdJV1gxQXk1TlY3WHlremEzR0hfeGdaUlZ2X3lYWWduaFNZdG1meHRUVGlXZU1DeW02TUdVS2hjM1BNX3duVUpOQ29GVG1WYUVkYy1xaEhPMHd1a3lDOHkwMTRhYkZDa3NoaDIyZzgtTGs5NHJkU3Vtc3BiR1djLV80dUhsN2RN?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Peter Brandt Predicts Bitcoin to Hit $43,289, Also Identifies Rising Wedge on Ethereum Chart - The Crypto Basic",
        "content": "Bitcoin (BTC) is on track to clinch a $43,289 price amid the formation of a pennant, as disclosed by veteran analyst Peter Brandt, who also called attention to a bearish rising wedge for Ethereum (ETH).\n\nBrandt made these disclosures in two separate analyses of the two largest crypto assets in the market. In a recent Bitcoin analysis, the analyst highlighted the formation of a pennant pattern on the BTC daily chart amid the ongoing uptrend.\n\nBitcoin Forms Bullish Pennant\n\nA pennant during an uptrend is a bullish continuation pattern. It features converging trendlines forming a small symmetrical triangle, preceded by a flagpole, which reflects the previous price surge. This pattern suggests a brief consolidation before the previous upward trend is likely to resume.\n\n- Advertisement -\n\nThe flagpole of the current pennant formed when Bitcoin staged a rally from the $26,555 low on Oct. 12. The rally saw BTC appreciate to $35,280 on Oct. 24, marking a massive 33% increase in less than two weeks. Although Bitcoin has retained its upward trajectory, the momentum has reduced, leading to the formation of the pennant.\n\nWhen a pennant forms, analysts view it as a brief pause to the rally, preceding a continuation of the bull run. According to Brandt, to gauge the extent of the next price rally, market participants should measure the height of the previous price rally that formed the initial flag pole, from the lowest to the highest point into the pennant.\n\nAccording to him, they can then project this same appreciation rate for the next surge, starting from the last small reaction inside the flag. Using this technique, Brandt projects that Bitcoin could appreciate $43,289 in the following price run after breaking out from the flag.\n\nEthereum Forms a Rising Wedge\n\nWhile Bitcoin could see a potential rally, Ethereum finds itself in a bearish pattern. Notably, ETH recently formed a rising wedge on the weekly timeframe, as highlighted by Brandt in a recent post on X.\n\nMarket watchers typically consider a rising wedge a bearish reversal pattern. It forms converging upward-sloping trendlines, indicating a tightening range between highs and lows. The pattern signals that the upward momentum is weakening and that a potential trend reversal to the downside may occur.\n\n- Advertisement -\n\nNotably, the rising wedge formation began in June 2022 when ETH slumped to a low of $881 following the Terra collapse in May. The asset registered a comeback, eventually recovering its lost value. However, amid the recent uptrend, a slowdown has resulted in the formation of the wedge.\n\n“It will be interesting to see if this market can expand beyond this pETH of pie,” Brandt said on X, calling attention to the bearish structure.\n\nPeter Brandt’s statement appears to be a play on words, referring to a portion of the Ethereum price chart within the rising wedge pattern. Brandt’s words suggest that the analyst is watching to see if Ethereum’s price can break out of the pattern and surpass the upper boundary of the wedge.\n\nMeanwhile, Ethereum seems to be seeing gains in the short term, while Bitcoin is currently down. ETH is up 7.12% over the past 24 hours, currently trading for $2,080. However, BTC is changing hands at $37,100, with a 1.50% decline within the same timeframe."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMi6gFBVV95cUxOX2JRdHBWN2hSWi00Mko1dHJqMFZHNTNTWTBhTk05NHQzUUZvSlZWQTlLVDhWTWpIR2NMNEJFSHlmR21hMHc5cmZqMVVDN3ZtTVdaRml2SHJJeEVnUGkxby0yZzBHVUZ1dDI1bmprb2lRY0k3bmI5SWpsand5Nm1lRy02Q3F5YnJGWmVKSUJqRmY1b0tyelFWTTAyQkxmRmRvOTI2QkJ1WUk3aGJGRk11aVlEWEpvV2JkdXdMMFVwT0JVRDBnamhxZDdKejQwVkQzalhiam1OZ1lYZmk5VEFwbEEyRGgyUktmdmfSAe8BQVVfeXFMUGVSREk0ZnpJbVNJNEpqSUgtU0I2NUNydEFRUkdJNWVnOUNpZmNlUWF6ZU55ZFdSVTQ0V2oyN3A0Y3dRWHI4WE1SUl80RERzVWg3dEM2WEdsMEVxTTFXOFRJVE1XT0pNNTZtZmkycTdyYks4QjZ0UlUyZzNhSzlPTVFab2VPbUh0NE5DSThlU3c2UUdQa2Qzd0FxT2J5ZGF5ZG5xdERaZnh1WU84MWJUbXRMaGZHaFVfSGV6UGVNeUsyVzd4LThUeW1iamMzVnlVd1N5cFFtdnhVWnhYY3hSWGJSNGdaa3c1c19KVnF2U2M?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Nov 2023 08:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: $40,000 viable for BTC as speculators front run spot BTC ETF - FXStreet",
        "content": "Bitcoin (BTC) price continues to pump hard, as speculators front-run a spot BTC exchange-traded fund approval from the US Securities and Exchange Commission (SEC). Ethereum (ETH) price is also showing remarkable strength, coming on the back of BlackRock hinting at a spot Ether ETF to come soon. Meanwhile, Ripple (XRP) price is showing weakness ahead of a briefing on its longstanding case against the financial regulator.\n\nAlso Read: Week Ahead: Ditch Bitcoin for these altcoins this week likely to be more profitable\n\nCrypto ETF FAQs What is an ETF? An Exchange-Traded Fund (ETF) is an investment vehicle or an index that tracks the price of an underlying asset. ETFs can not only track a single asset, but a group of assets and sectors. For example, a Bitcoin ETF tracks Bitcoin’s price. ETF is a tool used by investors to gain exposure to a certain asset. Is Bitcoin futures ETF approved? Yes. The first Bitcoin futures ETF in the US was approved by the US Securities & Exchange Commission in October 2021. A total of seven Bitcoin futures ETFs have been approved, with more than 20 still waiting for the regulator’s permission. The SEC says that the cryptocurrency industry is new and subject to manipulation, which is why it has been delaying crypto-related futures ETFs for the last few years. Is Bitcoin spot ETF approved? Bitcoin spot ETF has been approved outside the US, but the SEC is yet to approve one in the country. After BlackRock filed for a Bitcoin spot ETF on June 15, the interest surrounding crypto ETFs has been renewed. Grayscale – whose application for a Bitcoin spot ETF was initially rejected by the SEC – got a victory in court, forcing the US regulator to review its proposal again. The SEC’s loss in this lawsuit has fueled hopes that a Bitcoin spot ETF might be approved by the end of the year.\n\nBitcoin price uptrend stalls, makes $34,000 likely as markets don’t pause\n\nBitcoin (BTC) price uptrend seems to have lost steam. With the king of crypto still consolidating within the confines of an ascending parallel channel, a retest of the lower boundary seems likely following weakening momentum.\n\nThe Relative Strength Index (RSI) indicator is not only moving flat but also deviating to the south, hinting at buyer exhaustion now that momentum is falling. The Awesome Oscillator (AO) histogram is also moving toward the midlines with a sustained series of red bars as seller count continues to increase. Also, the Moving Average Convergence Divergence (MACD) indicator has also crossed below the yellow band, another sell signal that arises as longs close their positions.\n\nAs such, Bitcoin price could soon break below the lower boundary of the ascending channel to potentially test the $34,000 level. If this support level fails to hold, the slump could extend to $32,000 or even the $31,190 support level. Such a move would constitute a 12% slip from current levels.\n\nBTC/USDT 1-day chart\n\nThe narrative would be different, however, if sidelined investors join the rush, with the ensuing buying pressure extending the gains for Bitcoin price. In such a turn, BTC could overcome the $35,500 barricade and move higher, breaking past the $35,984 range high.\n\nAlso Read: Bitcoin price trends above $35,000 after BTC survives sell off by miners\n\nEthereum price could fall out of the supply zone at $1,861\n\nEthereum (ETH) price has faced a rejection from the $1,935 level, the midline of the supply zone that extends from $1,861 to $2,004. The largest altcoin by market capitalization could soon fall out of this supplier congestion zone.\n\nA retracement to the $1,800 level or lower to the $1,748 support level seems likely, with the RSI teasing above the 70 level with a deviation to the south.\n\nETH/USDT 1-day chart\n\nHowever, judging from the stance of both the AO and MACD indicators moving into positive territory, bulls still have a presence in the ETH market. Increased buying pressure from this cohort of traders could send Ethereum price past the $1,935 level, with a flip of this barrier to a support floor confirming the continuation of the intermediary trend.\n\nIn a highly bullish case, Ethereum price could extricate itself from the grasp of the supply zone above $2,004 to tag the $2,029 resistance level. A flip of this hurdle into support would set the tone for ETH to reach for the $2,141 range high, a level last tested in mid-April.\n\nAlso Read: Ethereum whales scoop up the altcoin, likely to catalyze ETH price rally\n\nRipple price in recovery rally, $0.69 level is critical\n\nRipple (XRP) price is in a recovery rally, confronting the $0.69 resistance level. Depending on how the bulls play their hand, it could be a make-or-break moment for the payments token. Overcoming $0.69 would set the tone for an extension to the supply zone between $0.77 and $0.81. A break and close above its midline at $0.79 would embolden XRP to collect sell-side liquidity as it heads toward the $0.93 range high.\n\nThe RSI at 75 shows XRP is overbought, signaling traders should not open new positions but keep their existing ones open until the RSI is at the brink of crossing below 70. A closer look shows a promising deviation of the RSI as bulls fight with their last breath.\n\nMeanwhile, the histogram bars of the AO shows bulls are leading the market. The MACD also supports the outlook, moving north as momentum continues to grow.\n\nXRP/USDT 1-day chart\n\nConversely, increased selling pressure could send Ripple price south, breaching the $0.66 support before ultimately slipping below $0.59. A break and close below $0.59 would invalidate the bullish thesis, sending XRP toward a consolidation phase under $0.53.\n\nAlso Read: Ripple hits new milestone in payments, likely catalyst for XRP price"
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxNYVhldVc0c1JhNHV6M2R5dFZtNVFnazZLVXhxMU9uZFJDc2JVNFI3ekxQQmJIZVZoYWFWcnNpZ3JqdFBZUU9kdzBkeVo5a3RoTUYyb1hwelk5c1JFU0d0N0x4bWlxb0FCN1dNb1I2R2hGWENNdl9PNXItV21SMjFWVlo0R3BaVW44ZHNrZE43MWYteVk3NElCa0JR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Nov 2023 08:00:00 GMT",
        "title": "Japanese banking giant Nomura launches ETH fund via crypto unit Laser Digital - CryptoSlate",
        "content": "Japan’s largest investment bank, Nomura Holdings, is launching an Ethereum-based fund for institutional investors through its digital assets subsidiary Laser Digital Asset Management, according to a Nov. 9 press release.\n\nThe “Laser Digital Ethereum Adoption Fund SP” fund marks the second installment in a series of digital adoption investment solutions introduced by Laser Digital following the launch of the Laser Digital Bitcoin Adoption Fund in September.\n\nEthereum Adoption Fund\n\nThe new fund will primarily target long-only spot positions in Ethereum. It enhances yield through an innovative strategy that involves staking the ETH held by the fund. The fund is managed as a segregated portfolio within Laser Digital Funds SPC, a segregated portfolio company registered in the Cayman Islands.\n\nLaser Digital has partnered with Komainu as custodian for the fund’s assets. The company also serves as the custodian for Laser Digital’s Bitcoin fund. Komainu is regulated under the U.K. Financial Conduct Authority and the Virtual Asset Regulatory Authority in Dubai.\n\nLaser Digital Asset Management head and former Nomura Chief Scientist Officer Sebastian Guglietta said the company views Ethereum as the technological catalyst that will digitize the economy. He added that in the long run, exposure to Ethereum is crucial to capturing the structural technology trend of the web 3 economy.\n\nMeanwhile, Laser Digital Asset Management head of distribution Fiona King said the fund will simplify investing in digital assets and provide a secure way for institutional investors to gain exposure to the industry as it is fully regulated.\n\nETH spikes amid positive news\n\nBeyond the Nomura announcement, documents surfaced on Nov. 9 showing that BlackRock has registered an Ethereum-based exchange-traded fund (ETF) in the state of Delaware on the same day.\n\nThe ETF was registered under the name iShares Ethereum Trust. BlackRock similarly filed its Bitcoin ETF a week before applying with the SEC.\n\nNews of large traditional financial institutions diving into Ethereum has caused the token to rally and break past the $2000 resistance level. ETH was trading at $2,007 at press time — more than 5.8% over 24 hours, according to CryptoSlate data."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxNSG5ETm5CVGpDZklSejhDbWtIZDJ2N1RsZnhsd1FBWmY4UUdoVkc1bmtWNUYyOFlKUDd0RmdRdTQxNUZXbkVpYi1xbUxYbGk2eG02YUxWYWdlS285cEFuQ3hfSmRJVXgtRVp6Q0hRSVVGVUs1U2NmcWlRMW5XNXdia01QRDllLTFqSlFEQ3VodzdBSXMtdUtsOEZrTFlPcllBY0lRNUlRaC0yaGRvRGcxRGJLS3hlX3JrRUUtYXpqRnVyZUU2Y3Z0MjZlakM2OUNidTNxcFNR0gHbAUFVX3lxTE1mQ3ZicWZlSUZRV0JfV0ZyRVVGTUtfQ3NOSk01bXN3SlJ0bXZYRXR5eDR1TUoyOEVGMzVqMllpM3hYa2V4UGQzMVNpREtpQ2twQVJOSUhGZ0Vnb2hXYTBlSXl0NmZBZ21LM1RMMWRHNjdZT0ZwYXNzSk9UczV4SU9qaWxrZU9sZFJyQ0ZKM0Q4Mkx1MUt0VlE2dTdvZUEyb2VySVk1VGtLT0RnMWJSSEJvSTVpMWFVcEJGVG1zN1NJdkdsVzNEemh1OFlhamZXenVNTUJZM0U2ODg2cw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Nov 2023 08:00:00 GMT",
        "title": "Top Analyst Predicts Pullbacks for Solana and Altcoins, Updates Outlook on One Ethereum-Based Crypto Asset - The Daily Hodl",
        "content": "A crypto analyst who nailed the top of the 2021 Bitcoin (BTC) bull market says Solana (SOL) will likely pull back after a big rally.\n\nPseudonymous analyst Pentoshi tells his 706,400 followers on the social media platform X that Solana could dip by more than 25% from its current value.\n\n“Whether it goes higher, or lower first. I think you’ll get another shot to buy $35-$36 and maybe even $32.”\n\nSolana is trading for $43.05 at time of writing.\n\nThe trader also predicts that other surging altcoins will likely see up to 20% pullbacks.\n\n“In regards to alts, many of these will have massive 15-20% pullbacks in due time. And a lot of people are sidelined. Your opportunities will come.”\n\nNext, the trader weighs in on the confidential transaction blockchain project Beam (BEAM), noting key milestones in the ecosystem.\n\n“BEAM has already had its first buyback and burn worth $158,000 since the migration. To date 37%+ has been burned and the treasury is up another 2.5 million-plus this month inching closer to the 100 million mark. Expecting at least another million USD to be burned by end-of-year at this pace.”\n\nThe trader also says he is bullish on BEAM.\n\n“Expecting a few solid updates by end-of-year.”\n\nBEAM is worth $0.00534 at time of writing, up 10.6% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiUkFVX3lxTE5YTjFMUkd4SzJaZEhlNEpuem9oRjFkWVI5UDZuU0Y1b0dpUHBVQUxtUUlEZFJNOUpMNW45b2RfY0NZX0JGMURKbkU3RjBLY2tfUFE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "What is OmiseGO? A comprehensive beginners guide - CoinCentral",
        "content": "OmiseGo is an Ethereum L2 launched in 2017 and founded by Omise, a venture-backed payment services company operating in Thailand, Japan, Singapore, and Indonesia.\n\nOmiseGO (OMG) is a white-label eWallet, smart contract platform and ERC-20 token (the Ethereum code standard). OMG uses a proof-of-stake (PoS) algorithm and has a total supply of 140,245,398 with a current circulating supply of 140,245,398 OMG– yes that’s right, OMG currently has all of its hard cap in circulation, and no new tokens are planned to be issued. OMG was designed to function as a decentralized bank, exchange, and asset-backed blockchain gateway. OMG’s ultimate goal is to be a “preeminent high-value exchange and settlement platform”. Think of a decentralized Ripple + universal remittance bridge to interconnect fragmented payment processors, legacy rails, and decentralized blockchains.\n\nThis means helping the unbanked get banking services (through their open-wallet infrastructure) and facilitating unprecedented interchangeability between the many siloed legacy rails (ACH, VISA, Paypal) and decentralized blockchains (like Ethereum). This could even potentially include more obscure assets like airline miles or loyalty points.\n\nOMG is based on ERC-20 which defines recognized smart contract code functions across the Ethereum ecosystem\n\nThe OmiseGO Team\n\nIn a November 2023 tweet, the OMG account claimed the original team has “moved on” leaving the token to be completely governed by the token holders.\n\n$OMG token is listed on over 130 exchanges and has over 700K holders. The original team has moved on, making it possible for OMG to become the only L2 that is 100% governed by the token holders. — OMG (@omgnetworkhq) November 14, 2023\n\nThe original OmiseGo team was described as “Fintech Rockstars” by Forbes in a now-deleted profile.\n\nOmise contributed $100,000 in funding to the Ethereum foundation’s DEVGRANTS which is a program to help new Ethereum-focused projects, develop the code bases and implement community evangelism. This indicates their commitment to the Ethereum ecosystem as a whole.\n\nThe original OMG Advisory board is notable, including Ethereum consensus-algorithm braniacs such as Vitalik Buterin, Gavin Wood (Polkadot), Jae Kwon (Cosmos), and more.\n\nFinal Thoughts: Is OMG Network Still Relevant?\n\nWith so many new Layer-2s storming the scene since OMG’s launch in 2017, OMG Network appears to have faded into the background music. However, it’s still a project worth keeping an eye on– its entire token issuance is currently circulating in markets, and governance is in the hands of the tokenholders.\n\nOMG holders earn tokens for validating transactions via a Proof of Stake (PoS) model\n\nThe OMG wallet application will also hold OMG tokens, which are a critical part of confirming blocks as valid and adding them to the blockchain. Keeping X amount of OMG tokens “buys” you the right to confirm blocks.\n\nEvery transaction on the OMG blockchain will require a transaction fee, that transaction fee will be distributed among OMG holders as a “stake”. The more coins held in the wallet the more fees you will receive proportionally.\n\nOmiseGo is the first implementation of Plasma, an Ethereum scaling solution co-developed by Joseph Poon (Lightning Network co-founder) and Vitalik Buterin\n\nA big challenge that faces not only OMG but all digital currencies is the number of transactions the network can handle. As seen with Bitcoin congestion, this is a critical issue of today. OmiseGo hopes to solve this issue with Plasma.\n\nPartnership with McDonald’s and the Thai Government\n\nA partnership with McDonald’s could potentially bring any entity (regardless of their market) much more growth and usage. In this case, they’re helping McDonald’s take in money more efficiently and inexpensively.\n\nThe Thailand Finance Ministry launched a national e-payment master plan to promote electronic payments. In addition, they rolled out Omise’s FacePay technology which allows payments using facial recognition. Omise and Vitalik Buterin had a meeting with the Central Bank of Thailand which indicates interest in their work.\n\nStrategic Alliances include investments from the Krungsri Bank of Ayudhya and SMBC\n\nThe Bank of Ayudhya made a 30 million dollar strategic investment in OmiseGO. They are a part of Japan’s largest financial group, Mitsubishi UFJ (MUFG), and hold $2.4 trillion of assets. Sumitomo Mitsui Banking Corporation (SMBC), another investor, is the second largest bank in Japan. Finally, Credit Saison, the third largest credit card company in Japan, is also partnering with OmiseGO.\n\nThe payment processing industry is siloed, fragmented and extremely centralized, creating security and counterparty risks for everyone. Omise, the creator of OmiseGo is a well-embedded payment processor in Asian markets which encompasses a massive market of users.\n\nOmise’s early ties to the Ethereum network and decentralization with their DEVGRANT donations and close ties with developers. OMG’s Software Development Kit (SDK) bundled with Omise’s suite of financial services is a robust and powerful combination of tools. Current and future OMG blockchain developers can move faster with less friction without having to reinvent the blockchain and remittance wheel.\n\nFinally, OmiseGo has backing from leading financial institutions and advisors like Vitalik Buterin among many other talented individuals."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxQUl91TVJ6dVZuVHdUcEJyd3lWekkyOHozVmZuR3pQaVZVa1dUaFoyVFotV3d0VzhUVXhfNUNZRms5eWdoYm1UUjVlMHM2THE1Q3dvSldyODhLX1RnRTZ5MEItUUxQWjAtdXpTRzFvZWtwRWgxMTJ1eUNGVHlZWlRCWWJWQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Nov 2023 08:00:00 GMT",
        "title": "Ex-Ethereum engineers launch Hyperbridge - Techpoint Africa",
        "content": "Key takeaways:\n\nFounders of Polytope Labs, Seun Lanlege and David Salami, have launched Hyperbridge, a protocol for safe cross-chain transactions.\n\nBuilt to make Africans builders of blockchain technology, Polytope Labs has gotten funding and research grants of up to $130,000.\n\nHyperbridge, which is its first product, is a blockchain network that the founders claim uses a first-of-its-kind infrastructure design.\n\nAfrica has largely been on the consuming end of crypto and blockchain technology for a long time. While crypto evangelists across the world say Africa has the most use cases for blockchain, Africa has not played a major role in the building of critical blockchain infrastructures — the hard stuff, if you may.\n\nThis is the reason why Seun Lanlege, who used to work with the team that built the Ethereum network and Polkadot network and David Salami built Polytope Labs.\n\nIn a conversation with Techpoint Africa, Lanlege said \"Polytope Labs is an opportunity for Nigerians to build lasting technological infrastructure. If we're going to be using this technology, we should also be building it.\"\n\nAdvertisement\n\nHowever, building blockchain infrastructures is hard.\n\nAnd this is not just because of the complex-looking mathematical equations Lanlege has on his board during blockchain community meets ups or his cryptography and blockchain discussions at the University of London, UK, building blockchain products needs expertise, the kind Salami and Lanlege are hoping to nurture at Polytope Labs.\n\nThey also want to build products and have successfully built Hyperbridge.\n\nWhat is Hyperbridge?\n\nHyperbridge is a cross-chain protocol that allows the exchange of information across blockchains.\n\nNormally, blockchains exist in silos. Ethereum network does not communicate with the Bitcoin Network, while Polkadot does not communicate with Solana. This poses a challenge when you need to send information across these networks.\n\nLet the best of tech news come to you\n\nJoin 30,000 subscribers who receive Techpoint Digest, a fun week-daily 5-minute roundup of happenings in African and global tech, directly in your inbox, hours before everyone else. Digest Subscription Email First Name JOIN FREE Give it a try, you can unsubscribe anytime. Privacy Policy.\n\nA familiar example is sending money across different banks in Nigeria. Imagine every bank had its own currency and do not accept currencies from other banks.\n\nIf your supermarket uses Access Bank and you have a First Bank account, there'll be no way for you to pay because Access Bank does not take transfers from any other bank.\n\nBlockchains are designed this way for security reasons, and Hyperbridge wants to solve this problem.\n\nLanlege pointed out that while Hyperbridge isn't a first when it comes to cross-chain solutions, the design architecture is the first in the world.\n\n\"What we've built is a blockchain that does the cryptography verification on behalf of other blockchains. It is connected to all the chains and does all the verification that needs to happen so that secure messages can be passed between each chain.\"\n\nHe said that existing solutions have led to hacks due to security flaws that emerge because of, how expensive cross-chain protocols are difficult to run.\n\nOther cross-chain solutions include Polkadot, which is described as the blockchain of blockchains by the developer and former Ethereum Co-founder Gavin Wood and Cosmos with the vision of becoming the \"Internet blockchains.\"\n\nInterestingly, Polytope Labs has received up to $130,000 in funding and research grants from the likes of Web3 Foundation and Polkadot.\n\nHowever, Hyperbridge is just the beginning of Polytope Labs' blockchain creations, while Lanlege admits that the space is still growing, he believes Africa can be builders and not just consumers."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxQeDFsdm1lVmlLTjFBQ3dBQjEtbzF0SjFraE42aVpqekRBU1VYUXpOV1c0WW1XYlJtNkVTRlJqY21mb3ZsMERYQ0M5b1FwajdMY2FNZ1BYa0w1eWNta0JwMi16UWFOUmFtWDViWGNmREZqQ1VOSGJjS2pob3BKVzJaal8wZEp5WGdwa0xNeDJiWE43Z0YxaFZCbGdNSjlVb2dBeDdJSVBmb0FuNnZoMXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Solana Price Could Reach $1,000, Analyst Explains Why - TradingView",
        "content": "Crypto analyst Jacob Canfield has laid out a comprehensive analysis, suggesting Solana (SOL) could be on the brink of an unprecedented market surge. “In my opinion, I think that Solana is going to continue to be one of the biggest movers during this current bull market cycle,” Canfield states, proposing that Solana could potentially escalate its market dominance to the 12-15% range.\n\nCan Solana Hit $1,000?\n\nCanfield bases his analysis on several indicators. He highlights the Solana Dominance (SOL.D) chart, noting that at the peak market cap, it didn’t even crack 3%. Given the current trends and the breakout of SOLBTC from its weekly resistance, Canfield envisions a scenario where Solana could enter a parabolic rally phase, which is further supported by the SOLETH chart showing a similar pattern. “SOLETH – Also currently broke out of a weekly resistance and looks to be forming a parabolic rally against it.”\n\nNewsBTC\n\nA significant factor in Canfield’s analysis is the current state of Ethereum Dominance (ETH.D). He notes that ETH.D is breaking down from a long-term trendline and losing the 200 weekly moving average, now sitting at 17%. “If Solana continues to trend against Ethereum and it continues to break down to 2019-2020 levels, we could see SOL as the big winner this cycle,” Canfield explains.\n\nHowever, Canfield does not disregard the potential ramifications of recent news regarding an Ethereum ETF. “This may not play out with the current ETF announcement news as it will bring more attention,” he acknowledges, indicating that an approved Ethereum ETF could shift investor focus and capital back to Ethereum, potentially tempering Solana’s ascent.\n\nDespite potential headwinds from the Ethereum sector, Canfield emphasizes Solana’s robust partnerships with corporate giants like Google, Circle, and Amazon, positing that these collaborations could significantly drive adoption and enhance Solana’s visibility in this cycle of the crypto market.\n\nFurthermore, Canfield’s analysis extends beyond charts and partnerships. He delves into the Solana ecosystem, spotlighting projects that are paving the way for its expansion. From decentralized finance protocols and automated market makers to NFT storage solutions and governance tokens for gaming platforms, Canfield points to a breadth of innovation within Solana that parallels, and in some aspects, seeks to outdo Ethereum’s ecosystem.\n\nIn light of the FTX debacle, Canfield remarks on the psychological impact on Solana’s market sentiment, noting that with Sam Bankman-Fried’s legal troubles, there is an opportunity for Solana to redefine itself. “There’s a bit of PTSD around the ecosystem, but it’s time to become its own entity and forge its own future,” he asserts, suggesting that Solana’s future will be shaped by those who are deeply integrated into its ecosystem, from developers to traders and influencers.\n\nHis conclusion: “Solana could triple or quadruple it’s all time high market dominance around 12-15% and if it continues to trend against Bitcoin, could easily see a $1,000 per coin and take the #2 spot behind Bitcoin.” When asked about the potential of Ethereum, Canfield emphasized, “No reason to not have allocations to both. It’s like trying to bet on Microsoft or Google. Tesla or Ford: Just buy both.”\n\nShort-Term SOL Price Outlook\n\nOn the shorter-term horizon, analyst Rekt Capital brings attention to Solana’s price movements in a recent post on X. “Solana continues to outperform in the market. In 2021, SOL upside deviated to $53 and then $61 before retracing to the bottom of the purple box,” he noted, referring to a specific zone on the price chart that has historically acted as both resistance and support.\n\nNewsBTC\n\nIn the Rekt Capital chart, SOL is currently breaking out above the zone. However, if history repeats itself and the zone once again acts as strong resistance, the SOL price could suffer a severe pullback. Using the green arrow in the chart, Rekt Capital paints a scenario in which SOL initially falls back towards $30 before the price rises again towards $42."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE5rbG1SdjVHSGVwVVdVaVh1RWFWUkd5U1BVNFVCZWJHWXpGLS1DeGlESy1XaktGZFJqTGdCTl9oUFctZEg1N1NhTVdRM25Bai0wcUc4Y0dVT2RKa3VmakFMbHhzWkpBcHpDaXVJc2pWR3jSAXZBVV95cUxQa3dKT1NxU2xkNG13RTFJeTkxZnZnSGtMM0pWNUFuTVpnMWotQlBkaFNLQlF0STU1Mm16RWpaMGdkRU41UTViamlwQUZTaHFiNGZ3TnZwTmpXcE5CVGFlVGlOMlBQeEd3bTNDcVZZeGUzS1lmZDJn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Nov 2023 08:00:00 GMT",
        "title": "Can spot Bitcoin ETFs push Hong Kong to the crypto throne? - Forkast News",
        "content": "In this issue\n\nBitcoin ETFs: Hong Kong has entered the chat Bitcoin Ordinals flip Ethereum NFTs IPO comes full circle\n\nFrom the Editor’s Desk Dear Reader, The verdict is in. Sam Bankman-Fried, founder and former chief executive officer of failed cryptocurrency exchange FTX, has been found guilty in what U.S. government prosecutors labeled one of the biggest financial fraud cases in history. As Bankman-Fried awaits a likely decades-long sentence for his part in FTX’s collapse — a truly catastrophic implosion that contributed in large part to the digital asset market’s travails over the past year — the industry is now looking forward. And nowhere, arguably, is more forward-looking than Hong Kong when it comes to the digital economy. The special administrative zone was again in the news this week as Hong Kong Securities and Futures Commission (SFC) head Julia Leung gave her first international media interview since taking office in January. Leung said that the regulator is happy to try any innovative digital asset proposal that “boosts efficiency and customer experience.” Significantly, that willingness to engage with digital assets includes the much-heralded spot Bitcoin exchange-traded fund (ETF). The financial instrument — which allows investors to trade Bitcoin on a traditional exchange at any time throughout the day — is expected to bring much-needed institutional cash into the industry. That’s particularly so in the U.S., where spot Bitcoin ETFs from the likes of investment giant BlackRock are reportedly just around the corner. With the U.S. spot Bitcoin ETF buzz causing a recent surge in the price of Bitcoin to over the US$35,000 mark, a ripple of fresh excitement has spread throughout the wider crypto market. But Leung also advised caution. She added the caveat to her comments about a spot Bitcoin ETF that the regulator would only consider products that meet the jurisdiction’s strict requirements on customer protection. Amid all the talk over a luxurious penthouse lifestyle for FTX executives in the Bahamas — where Bankman-Fried is also known to have cozied up to local officials — it is easy to forget that the exchange began life in Hong Kong. Added to that, the city has also just been through its own huge crypto scandal, with customers of the JPEX exchange losing out on over US$200 million in investments. Particularly as Beijing continues to clamp down on crypto in the Chinese mainland, Leung is right to advise caution. Hong Kong is seen as a so-called “sandbox” for crypto innovation, an area where experiments — regulatory and otherwise — can be conducted with a degree of separation from the wider Chinese market. Should the marriage between innovation and effective regulation work out as planned, Hong Kong has every chance of achieving what is now a key aim for the region — restoring its international reputation as a cutting edge financial center by becoming a global hub for the digital asset industry. Until the next time, Angie Lau,\n\nFounder and Editor-in-Chief\n\nForkast.News\n\n1. Bitcoin ETFs: Hong Kong has entered the chat\n\nAs fund managers vie to launch Bitcoin spot ETFs in major markets, the financial world watches, poised for a transformative shift in the digital asset landscape. Image: Canva\n\nThe Hong Kong Securities and Futures Commission (SFC) is considering the approval of ETFs investing directly in cryptocurrencies, with regulations to mitigate new risks.\n\nTwo Bitcoin futures ETFs and one Ethereum futures fund have already been approved by the SFC, signaling a cautious advancement into institutionally accessible crypto-based financial products.\n\nAccording to Bloomberg, SFC Chief Executive Julia Leung emphasized the need for a “comprehensive regulatory framework” following a significant fraud case involving the Hong Kong Exchange JPEX, which saw HK$1.6 billion (US$204 million) in customer funds misappropriated.\n\nThe SFC is refining its cryptocurrency regulations and developing new rules for stablecoins and asset tokenization, while the Hong Kong Monetary Authority (HKMA) is aiding banks in handling tokenized assets.\n\nIn the U.S., the Securities and Exchange Commission (SEC) has been wary of approving Bitcoin ETFs, citing potential market manipulation and the need for secure handling of customer assets.\n\nBlackRock and Fidelity Investments are among several major investment giants that have applied to set up a spot Bitcoin ETF in the U.S., with Grayscale Investments looking to convert its Bitcoin trust into a spot ETF.\n\nForkast.Insights | What does it mean? The spot Bitcoin ETF remains the news of the week, regardless of location. The crypto industry views the arrival of this financial instrument in the U.S. as the silver bullet needed to steady the listing ship of the crypto market, down some US$2 trillion over the past 18 months after the collapse of FTX, among a host of other digital asset firms. But spot Bitcoin ETFs already exist in Europe, where they have been met with a muted reception. Bitcoin futures ETFs also already exist. But beyond an initial bump in the price of Bitcoin when ProShares first introduced a Bitcoin futures ETF in the U.S. in October 2021, they too have failed to pull up many trees. But, the optimism is there. Bitcoin is up over 30% since mid-October just on the suggestion that a spot Bitcoin ETF in the U.S. is imminent. Some analysts argue that the past month’s price pump goes to show that the market had yet to price in the existence of a spot Bitcoin ETF. The rise in prices across crypto is just a way of factoring in the potential inflow of institutional cash this particular financial instrument is expected to bring. But others, including former Wall Street banker Norbert Gehrker, believe that the improvements to the user experience for investors enabled by the creation of a spot Bitcoin ETF in the U.S. is enough to potentially attract further large scale inflows of money into the industry. In a note to Forkast, Gehrke used the example of the first gold ETF. Introduced in 2004, it pulled in US$5 billion in the first 15 months and US$10 billion over the first 10 years, dramatically changing the gold market. Expectations are similar in the Bitcoin market. We could soon see multiple jurisdictions look to get in on the action in the near future, particularly if — as expected — the SEC makes an approval early in the new year.\n\n2. Bitcoin Ordinals flip Ethereum NFTs\n\nCredit\n\nBitcoin’s ecosystem of inscribed blockchain artifacts, Ordinals, BRC20s, and infinite future iterations, overtook Ethereum’s ecosystem of NFTs in sales volume this week for the first time.\n\nBitcoin Ordinals and BRC20s saw over US$17.9 million in sales Tuesday, beating the combined sales volume of the next four blockchains.\n\nThe Bitcoin ecosystem has traded for over US$57.6 million in November, reflecting a return to pre-summer levels of trading.\n\n$SATS BRC-20s are the top-selling NFT collection in the past seven days across blockchains, with US$25.2 million in sales.\n\nForkast.Insights | What does it mean? A true milestone moment for Bitcoin happened this week. Not just for blockchain collectibles, artifacts, or NFTs. Instead, it’s a milestone for the Bitcoin blockchain itself, which is seeing its utility beyond payments legitimized. Sales volume for Ordinals, an iteration of NFTs on the Bitcoin network, has been on the rise. The blockchain’s BRC20s, a fungible token standard powered by Ordinals, are really seeing an increase in sales. Seven of the top 10 collections on CryptoSlam are represented by BRC20s. These bundles of fungible tokens are being sold at a rate that we’ve not seen before, and Binance’s recent integration of ORDI tokens suggests there’s much more in store for this genesis of decentralized finance (DeFi) on the Bitcoin blockchain. It’s fair to say that Bitcoin “flipping” Ethereum is a controversial statement. Most on the Ethereum side don’t accept it. Comparing BRC20s to NFTs is not apples to apples. But comparing non-fungible bundles of BRC20s to tokenized houses, profile pictures, cars, and fantasy sports assets shouldn’t require an apples to apples comparison.\n\n\n\nThe NFT ecosystem is young, and as it matures, clever technologists will find all kinds of ways to shoehorn strange use cases into NFTs. Last month, it was Pokemon cards stored in Brinks vaults, this month it’s BRC20s, and next year it just might be your entire bank account.\n\n3. IPO comes full circle\n\nCircle gears up for an exhilarating return to the IPO arena, riding the wave of regulatory shifts and market optimism. Image: Circle/Canva\n\nCircle Internet Financial Ltd., the company behind USDC, the world’s second-largest stablecoin, is contemplating an initial public offering (IPO) in early 2024, Bloomberg reported Wednesday, citing unnamed sources.\n\nThe sources reportedly said Circle is in talks with advisers over the potential listing, although the outcome and valuation remain uncertain.\n\nCircle canceled a previous attempt to go public via a SPAC merger. The company was valued at US$9 billion in 2022.\n\nDespite the aborted merger with Concord Acquisition Corp., Circle has attracted significant investment from heavyweights like Goldman Sachs and BlackRock.\n\nThe stablecoin issuer faced a scare earlier this year due to its US$3.3 billion exposure to the defunct Silicon Valley Bank."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxOV2EwRHhzYTRFRm9meXJyNzdiMFhIbWkxV1NvTWdjY3l2cl9ha29qdDIxWEltUUJ4WTZLTVpqM281REtFXzktcFlpY0ZTMVJwUHRvZWtVMUhQYV94WXV2Yjd3elNhdEtMd2s0N3RfVXNVLWhhVEVCN2wyTXY4QngtTGtTYXJsdE96Tkc4eHpHSUVHaURMc1NRWVRpYW9SSjVhbEYtZXUxRURXbmdnWUpkMXFiUUFYODcxazBn0gHAAUFVX3lxTE8yZ08zUUF3eHVraEhvbXVHeUxVakZnZTh3WlBEWm5lckh0Vk9qaHZXV0ZQRVdEOVd6LWI5YktWNlBpTnh0ckhWUWxCb200VHFCaWtpVW1sbTZIMmwxek53cXZldGJfQlJUWWViTlFEQ2dCdVBXeEtHSXhaTDltVlVPd3ZiSkV2YmZLZWZqZEhLNUh4aUtRVFZiV3RWYXJpelU4ZGtCbDc1RDJ6T0JrcXU3NTJfZWRHc014NG1WWngweg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Nov 2023 08:00:00 GMT",
        "title": "Zircuit, New ZK Rollup Backed by Pioneering Layer Two Research, Launches Public Testnet - The Daily Hodl",
        "content": "November 9, 2023 – Grand Cayman, Cayman Islands\n\nZircuit – a new zero-knowledge rollup backed by pioneering layer two research – today announced the launch of its public testnet.\n\nZircuit is fully EVM-compatible, supports existing Ethereum DApps and wallets and allows any DApp on Ethereum to deploy on Zircuit with minimal changes.\n\nTo celebrate the launch, Zircuit will be hosting a multi-day event during Devconnect that begins on Monday, November 13, 2023.\n\nOver the last one and a half years, the Zircuit team has been pioneering various research initiatives such as rollup security tooling, rollup compression and scaling cryptography.\n\nThis work led to grants awarded by the Ethereum Foundation for layer two research.\n\nZircuit’s upcoming testnet synthesizes the team’s research advances and new technology to create an evolved layer two environment for developers.\n\nHarnessing these research advancements, Zircuit uses a hybrid approach that combines the latest zero-knowledge proofs with optimistic infrastructure.\n\nMore efficient proof generation results in reduced fees and the development of new compression algorithms increases transaction speeds and saves users gas.\n\nThis state-of-the-art integration allows developers to move popular DApps directly over to Zircuit without making costly changes.\n\nZircuit provides the perfect place for developers to battle-test their DApps before launching on Ethereum mainnet.\n\nBy having security at the sequencer level, Zircuit will block any malicious transactions while still allowing developers to see an attempt to hack.\n\nTransactions on Zircuit are cheap, and setup on Zircuit takes minutes, making it a quick, low-risk solution for developers who want to experiment.\n\nThe unique combination of rollup and ZK technology in Zircuit provides a streamlined experience for end users as well.\n\nEthereum applications can seamlessly deploy onto Zircuit without learning a new programming language or framework, which makes it so Zircuit can easily stay up to date when popular Ethereum applications have updates.\n\nThis compatibility gives users the ability to enjoy the new features, speed and cost benefits of these DApps without having to learn anything extra.\n\nDr. Jan Gorzny, head of layer two scaling at Zircuit, said,\n\n“Our research on rollups led us to create a [layer two] scaling solution that is breaking new ground and paving the way for a new generation of rollups. It’s taking the existing technology further and easing use for both developers and DApp users.”\n\nZircuit invites developers and projects from across the Web 3.0 ecosystem to participate in its testnet.\n\nProjects will receive assistance and incentives such as onboarding, readiness support and developer workshops.\n\nDuring Devconnect, Zircuit is hosting a four-day event where attendees will have the chance to learn more about the testnet launch, engage with the Zircuit team and mingle with fellow members of the Web 3.0 community.\n\nTickets are available here.\n\nTo learn more about Zircuit, visit the website or read the developer docs here.\n\nAbout Zircuit\n\nZircuit is a fully EVM-compatible zero-knowledge rollup powering the limitless potential of Web 3.0.\n\nBacked by pioneering layer two research, the network’s unique hybrid architecture combines optimistic infrastructure with zero-knowledge proofs to give developers the best of both worlds.\n\nWith cutting-edge performance and security at the sequencer level, users can explore new frontiers with faster transactions, reduced fees and complete peace of mind.\n\nTo learn more, visit the links below.\n\nWebsite | Twitter | Discord\n\nContact\n\nJessica Graber, PR strategist at Zircuit"
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxNZER6RzJGREhESW9uV2RUczVuSGJ4b09rSlB5eUk5eU9ubXJUWGZFb25Zc2VIOVJwRDRfLUFwXzZRS3d6OWlncTl3OWJXLXNhcG9rRklCUWpVaFRXblZ2dm11Z3ZRbWFQYm5NcHNXRUNiYmRtdzBnNG1Rbjl1QTdkLWh5TjBOSGJD0gGOAUFVX3lxTE9uSEZrbDJzeXgxVHJZelcxeUhqSVJlWm5JNE80TnRGc3FhaXBQQU90bUh2UzNsXy14NlVSSURuWXBXQlZyc3lVYXh2cElsQ2xNMzc2d0tBT3JDTkstZEF5ZTJ1VTNONUJTdGx0aFhBOE56bGREQkgxQUtlZk5VUEIxRjVIdm02U29fVXlFd0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Nov 2023 08:00:00 GMT",
        "title": "What Polygon’s partnership with Near Protocol means for you - AMBCrypto News",
        "content": "The new zkWasm solution would enable Near Protocol to access Ethereum’s big liquidity pool.\n\nPolygon developers will have the option to build using the programming language of their choice.\n\nEthereum [ETH] scaling solution Polygon Labs [MATIC] announced a partnership with layer-1 blockchain Near Protocol [NEAR] in a bid to boost cross-chain interoperability.\n\nAs per details shared in a blog post, the two entities joined hands to develop zkWasm, a zero-knowledge (ZK) protocol for WebAssembly (Wasm) blockchains. The aim was to bridge the gap between Wasm blockchains and Ethereum ecosystem.\n\nLet’s understand the tech of it all\n\nIt’s well known that Ethereum pioneered the development of decentralized applications (dApps) through Ethereum Virtual Machine (EVM) – the standard on which all protocols on Ethereum run.\n\nOwing to the popularity and apparent interoperability benefits, many other blockhains like the BNB Chain [BNB], Avalanche [AVAX], and Polygon, became EVM-compatible.\n\nWhile thousands of dApps have reaped the benefits of EVM, the solution began to show its limitations in recent years.\n\nOne of the foremost was the lack of popular language options available to developers apart from Solidity. It was a time-consuming and difficult process for anyone who wished to use a different language to work in this ecosystem.\n\nThe Wasm technology has been viewed as the main competitor to the EVM. Wasm expands the family of languages available to smart contract developers to include Rust, C/C++, and C#.\n\nThe high-performance framework has been used for running complex programs in web browsers, including Google and Mozilla.\n\nA new feat in cross-chain interoperability\n\nInterestingly, Near Protocol allows developers to employ the Wasm technology to build dApps. The new zkWasm solution therefore intended to act as the bridge, enabling Near to access Ethereum’s big liquidity pool.\n\nMoreover, the collaboration would give additional options for Polygon developers. Polygon co-founder Sandeep Nailwal, while responding to the news of the partnership, said on X (formerly Twitter),\n\n“Polygon Ecosystem gets Wasm appchains, perhaps even with Near mainnet codebase, where devs can build a sharded smart contracts platform where app devs can build smart contracts using any programming language of their choice like C++, Rust, and many others.”\n\nFurthermore, developers would have the flexibility either to launch an EVM chain, or build a WASM chain for closer Ethereum alignment and access to liquidity.\n\nAccording to an official X post by Near Protocol, the product was under development as of press time and slated to launch next year.\n\nThe partnership was just one of many initiatives undertaken by Web3 companies to strengthen cross-chain interoperability. The hot trend could pave the way for creation of powerful new products and services that leverage the benefits of multiple networks simultaneously.\n\nMATIC reacts positively\n\nThe news of the deal increased demand for Polygon’s native coin, MATIC. The cryptocurrency jumped 8.39% to $0.82 at press time, the highest since mid-July, according to CoinMarketCap.\n\nThe thirteenth-largest crypto by market cap benefitted from the prevailing bullish sentiments in the market. Since the 19th of October, MATIC has increased by more than 60%, making it one of the top performing altcoins.\n\nNotably, whale accumulation has assisted the growth significantly. According to on-chain analytics firm Santiment, wallets holding between 100,000- 10 million MATICs added 42.88 million coins in the last two weeks.\n\nAdditionally, 161 whale transactions worth more than $100,000 were recorded on 8 November, the highest since July.\n\nRead Polygon’s [MATIC] Price Prediction 2023-24\n\nOn the other hand, NEAR saw a comparatively subdued response. The coin was exchanging hands at $1.5 at press time, with gains of just 2.28%.\n\nHaving said that, the broader market bullishness turned the fortunes for NEAR as well. The coin enjoyed monthly gains of nearly 39% at the time of writing."
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMiZkFVX3lxTE9iRjdaRklpZlUtM3ZFUU1tbFh6V05xUjBNZndjQlZSUXlZSk5HV1h1enlPVFV3bjBwbjM1LW4zeU4yMGNYeHl3QUd3bmRteklfanlaREdCU0pLeE1EQ3huTnlicGNRdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Nov 2023 08:00:00 GMT",
        "title": "NEAR Foundation launches NEAR DA to offer secure, cost-effective data availability for ETH rollups and Ethereum developers - CIO News",
        "content": "NEAR moves into the modular blockchain landscape with the lowest-cost DA offering in the Web3 market today.\n\nNovember 8th, 2023, at 2:30 p.m. Lisbon time, NEARCON: The NEAR Foundation today announced the rollout of the NEAR Data Availability (NEAR DA) layer, a groundbreaking innovation that offers robust, cost-efficient data availability for developers building Ethereum rollups.\n\nLaunched with Madara by StarkNet, Caldera, Fluent, Vistara, Dymension RollApps, and Movement Labs as its first users, NEAR DA’s entry into the data availability landscape builds upon the NEAR Protocol’s 3+ years as an established, secure, and reliable blockchain with 100% uptime. NEAR provides all the guarantees of a scalable layer-one network that is also more cost-effective than other DA solutions; for instance, posting rollup data on NEAR would be 8,000 times cheaper than posting on Ethereum.\n\nDesigned to scale Ethereum cheaply and reliably, NEAR DA offers immediate benefits to Web3 founders exploring the modular blockchain development landscape. The new layer supports Ethereum L2s that want to continue building on ETH without the high cost of posting data. It will also support high-quality projects looking to launch an app chain or an L2.\n\nThe negligible, predictable gas fees and cost-effectiveness of NEAR DA let developers build more accessible applications for their end-users. As of September 2023, posting 100kB of calldata on Ethereum L1 for optimistic rollups would cost roughly $26.22, while posting the same amount of data on NEAR Protocol would cost $0.0033. Projects can pass those benefits along to their user base while still remaining integrated with the broader Ethereum ecosystem.\n\nIllia Polosukhin, co-founder of NEAR Protocol, said: “Offering a data availability layer to Ethereum rollups highlights the versatility of NEAR’s tech while also helping founders from across Web3 deliver great products that bring us closer to mainstream adoption of the Open Web. NEAR’s L1 has been live with 100% uptime for more than three years, so it can offer true reliability to projects looking for a secure DA while also being cost-effective. NEAR provides great solutions to developers no matter which stack they’re building on, and now that includes the Ethereum modular blockchain landscape.”\n\nBy opening up its blockchain for data availability, NEAR Protocol is expanding its offerings to deliver a modular blockchain development framework that lets Web3 developers and founders continue building on Ethereum while leveraging NEAR’s state-of-the-art technology for one part of the stack, depending on their requirements. NEAR DA expands the capabilities of NEAR’s Open Web Stack, a common entry point where developers and users alike can easily build, browse, and discover Web3 products and platforms. This includes FastAuth onboarding to an account in seconds with zero crypto or seed phrases required, as well as the ability to create decentralized frontends from a library of thousands of components.\n\nDevelopers and founders building on Ethereum rollups interested in using NEAR DA can visit near.org/data-availability to get started.\n\nAlso read: Global AI Solutions, created in India, Aravind Raghunathan Joins Yavar.ai as CTO\n\nDo Follow: CIO News LinkedIn Account | CIO News Facebook | CIO News Youtube | CIO News Twitter\n\nAbout us:\n\nCIO News, a proprietary of Mercadeo, produces award-winning content and resources for IT leaders across any industry through print articles and recorded video interviews on topics in the technology sector such as Digital Transformation, Artificial Intelligence (AI), Machine Learning (ML), Cloud, Robotics, Cyber-security, Data, Analytics, SOC, SASE, among other technology topics."
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMiYkFVX3lxTE0zSTlORWktVVhRRjY4eVhYbDdvdGVNbEVwdGk1blN4Nm9paTVURXI1Mnh0V1lWRWUyTEQ2Y0hRRS01T0lkWHdEOXNkRG91TTJ0RGdGN3EtWnhuNWR3MHUzNFJn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Is Chainlink a good investment in 2024? Detailed Analysis - CoinGape",
        "content": "Chainlink, a decentralized blockchain oracle network built on Ethereum, has started to make headlines as the cryptocurrency has recently seen an impressive rise in its value along with healthy technicals.\n\nAs a result, Chainlink, which aims to facilitate tamper-proof data transfer from off-chain sources to on-chain smart contracts, saw its native cryptocurrency LINK price surge by 30% in the past 7 days.\n\nadvertisement\n\nBut investors are hoping that LINK, which has an all-time high of $52.88, at least cross the $50 mark once again in 2024. Currently, the LINK crypto coin is trading at around $18 apiece.\n\nChainlink Overview\n\nChainlink was created in 2017 by Sergey Nazarov and Steve Ellis, with the smart contract network formally launched in 2019.\n\nThe network acts as a bridge between blockchain and off-chain environments.\n\nChainlink’s coin LINK is an Ethereum token, compatible with the ERC-20 token standard. The maximum supply of LINK tokens is 1,000,000,000.\n\nChainlink Historical Data\n\nIn 2017, at the time of Chainlik’s launch, crypto markets were stagnant. At the time of its initial coin offering (ICO), Chainlink price was $0.11. A total of 350 million LINK tokens were sold at the time of its ICO.\n\nIn the following years, the coin witnessed a consistent rise in its price. It recorded its all-time high of $52.88 on 9 May 2021, on the back of an impressive rally in the overall cryptocurrency space. But soon, it went downhill like other cryptocurrencies. Chainlink now appears to be making a slow and steady recovery. The coin has already crossed the $10 mark and was trading very close to the $12 mark, showing marginally bullish sentiment.\n\nWill Chainlink Reach $50?\n\nChainlink is currently hovering around the $18 mark. For it to reach $50, it will need to grow close to 3X. If the anticipation of upcoming bull market comes to reality, Chainlink could further increase in value and eventually reach $50.\n\nBesides, there is also a possibility that network upgrades and staking improvements increase Chainlink adoption, causing its price to rise. However, at present, it appears to be a distant future. What will happen next? Only time could tell.\n\nConclusion\n\nChainlink has clearly started to make its recovery. There is massive room for growth in the coming times as the token is down from its all-time high. Coupled with Chainlink’s continuous efforts to form key partnerships and improvements in the tech stack, the present price rise could continue in the coming times."
    }
]