[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxNeFpteGlBMHhtS3RUSDlIcjlaNVNScU1pRjZYS1Npb0RBSEVqcEhiX2lMR1RUTi1VM3FDbXo4OVV4bDMyQndBTE1SaHczVEh5LXVrRGxNbk1Rb1dFZjQyX3d3dU5PcVJ0SF9qamN5U2RsNUREZU1YanVQZUZLVXhEX2JnWmQycmFnejBMZEJacHdMcWpQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 22 Nov 2023 08:00:00 GMT",
        "title": "Exploring Ethereum: a comprehensive look at ETH and its ecosystem - OKX",
        "content": "Have you ever wondered what Ethereum is and how it's different from other cryptocurrencies like Bitcoin?\n\nEthereum is a decentralized network of computers worldwide that follows a set of rules known as the Ethereum protocol. This network serves as a platform for creating and using applications, communities, organizations, and digital assets, allowing anyone to do so without relying on a centralized power. Ethereum's native cryptocurrency, Ether (ETH), pays for network activities, including the computation necessary to build and run decentralized apps (DApps) and organizations on Ethereum.\n\nThat's only scratching the surface about Ethereum, and in this article, we take a close look at the ecosystem, its native token, and how Ethereum is impacting the future of decentralized finance (DeFi).\n\nTL;DR\n\nEthereum is a decentralized platform that allows smart contracts and DApps with its native cryptocurrency, Ether (ETH), used for transactions.\n\nETH, launched in 2015, is the second-largest cryptocurrency by market cap and is essential for Ethereum network operations.\n\nEthereum's smart contracts are self-executing contracts with terms directly written into code, facilitating automated, secure, and efficient transactions and applications without intermediaries.\n\nThe Merge has caused Ethereum to move to a proof-of-stake (PoS) system, which has significantly affected ETH issuance and energy consumption. This shift has had a massive impact on the network's sustainability and ETH's economic model.\n\nDespite challenges like competition from other blockchains, scalability issues, high transaction fees, regulatory risks, and security threats, Ethereum's future looks bright. This is due to numerous technological enhancements and advances in token standards.\n\nWhat's Ethereum and how does it differ from Bitcoin?\n\nBitcoin and Ethereum are fundamental cryptocurrencies that have helped accelerate the transformation of blockchain. However, the technologies are significantly different in their aim and operation. Ethereum uses blockchain technology, similar to Bitcoin, but also serves as a platform for DApps by applying smart contracts. These contracts are programmed to execute the conditions of an agreement automatically — an action that's directly included in the code.\n\nBitcoin, meanwhile, was created as a decentralized alternative to fiat currency. It aims to be a store of value and a medium of exchange. Blockchain technology creates a decentralized accounting ledger for Bitcoin transactions, removing the need for a single authoritative body.\n\nIn contrast, Ethereum's blockchain is built to do even more. Through this platform, developers can build and launch various applications. This can be anything from video games to intricate financial systems. Ether, the native cryptocurrency of Ethereum, is used to execute and manage transactions within this environment.\n\nAs a result, Ethereum has become a base for thousands of crypto token projects, each using the technology to power their own DApps.\n\nWhat ultimately separates Ethereum from Bitcoin is its technical basis. Ethereum has a faster block time than Bitcoin, meaning it can process transactions in less time. This is necessary for applications that demand rapid transaction speeds.\n\nFor many, the comparison between Ethereum and Bitcoin is rooted in the distinction between their respective capabilities. Where Bitcoin is mainly a medium of exchange, Ethereum is more of a development platform with added features like smart contracts. This has resulted in a significant market cap for cryptocurrencies operating on decentralized blockchain technology.\n\nWhat is ETH?\n\nIn 2015, Ethereum co-founder Vitalik Buterin created ETH, which has since become the second-largest cryptocurrency in market value behind Bitcoin. Unlike conventional currencies, ETH isn't regulated by any governing body. The token is a tradable asset class on multiple crypto exchanges.\n\nETH stands out in the crypto space because it's not just a medium of exchange or a store of value. ETH is used to run operations on the Ethereum network, such as executing smart contracts and DApps. To perform these processes, users must pay a fee in Ether, often called \"gas,\" given to miners to incentivize them to validate transactions on the blockchain.\n\nETH plays an essential part in the maturing DeFi environment, which aims to reproduce and modernize traditional financial services such as borrowing, lending, and trading without intermediaries. ETH is widely employed as collateral, a form of currency, and a unit of account in various economic protocols in DeFi.\n\nTraders and users hold ETH for various reasons: some \"hodl\" it long term, speculating on the growth of the Ethereum network and the broader adoption of blockchain technology. Others use it more actively for trading and accessing the network's capabilities.\n\nTo sum up, ETH is an essential component of the Ethereum network and the basis of the DeFi space.\n\nHow do Ethereum's smart contracts work?\n\nEthereum is renowned for its smart contracts. These contracts don't follow conventional guidelines. Instead, their terms are encoded into computer code. Smart contracts are located on the Ethereum blockchain, an open system that guarantees the underlying action or agreement will be carried out without disruption, control, deception, or outside influence.\n\nSmart contract functionality\n\nImagine a smart contract as a vending machine. When you choose a product (a digital deal or contract), you pay the necessary amount of ETH and the machine (the smart agreement) will instantly execute the deal in line with the encoded requirements. This system removes the need for intermediaries such as lawyers or brokers, which minimizes expenses and boosts effectiveness.\n\nThe power of automation in blockchain\n\nWhen the set parameters are fulfilled, smart contracts can autonomously enforce and complete the obligations of a deal. This way, these contracts can automate the administrative and transactional processes. This capability is game-changing in areas like finance, real estate, and legal operations, where complex agreements are common.\n\nDApps and beyond\n\nThe Ethereum blockchain serves as the base for various DApps. These applications are hosted on a peer-to-peer network instead of a single computer. The advantages of using DApps built on Ethereum are bolstered by blockchain technology's security, reliability, and transparency. From DeFi to NFTs, the range of applications is rapidly increasing.\n\nEthereum's smart contracts provide a reliable, clear, and efficient approach to supporting digital purchases and arrangements, creating change that could influence many industries positively.\n\nWhat are the real-world applications of Ethereum?\n\nEthereum's most notable use is in DeFi, which encompasses smart contract-powered loans and other financial activities. Ethereum stands out because of its decentralization, transparency, automation, and immutability, making it suitable for many different applications across various industries.\n\nBanking, crowdfunding, and web hosting are just some of the ways Ethereum has changed how people transact and interact. For example, Ethereum offers new ways of processing loans, borrowing, and trading digital assets.\n\nSmart contracts on Ethereum can be used to set up trustless and secure crowdfunding initiatives. At the same time, prediction markets employ the technology to create decentralized platforms for forecasting the results of events. Ethereum has also been used to create decentralized web services, spotlighting its influence in multiple domains.\n\nEthereum's blockchain technology supports various real-world applications across different industries, and several companies are actively leveraging its capabilities:\n\nTake-Two: In August 2023, the publisher behind the Grand Theft Auto gaming franchise announced the development of Sugartown, a Web3 game built on Ethereum. Sugartown's plot follows three agricultural animals that, by chance, open a wormhole from another world to Sugartown, allowing odd creatures known as Ora’s to enter the city. Using their inventiveness, the Ora’s turn Sugartown into a lively destination that offers enjoyable activities and amusements.\n\nING : The Dutch bank has been involved in multiple Ethereum-based projects. One example is Komgo, which aims to optimize trading documents. ING is also a part of Fnality, a payments settlement consortium, and has been working on Bamboo, a bilateral letter of credit.\n\nTD Ameritrade: As a brokerage firm, TD Ameritrade has embraced Ethereum by supporting ErisX, a CFTC-regulated spot exchange that leverages Ethereum smart contracts. What's more, the firm allows customers to trade Ethereum futures through the platform.\n\nThe above examples show how Ethereum's blockchain can enable secure, open, and effective trading of digital assets, the production of NFTs, and underpin a variety of financial activities.\n\nHow does Ethereum's transition to proof-of-stake affect ETH?\n\nEthereum's shift from proof-of-work (PoW) to proof-of-stake (PoS), known as \"The Merge,\" has had a profound impact on the issuance and economics of ETH:\n\nPre-merge issuance:\n\nMiners issued ~13,000 ETH/day under PoW.\n\nAnnual inflation rate was approximately 4.61%.\n\nPost-merge issuance:\n\nIssuance reduced to validators issuing ~1,700 ETH/day under PoS.\n\nAnnual inflation rate now approximately 0.52%.\n\nTotal new ETH issuance down by ~88%.\n\nSustainability:\n\nThe Merge eliminated energy-intensive mining activities.\n\nValidators require a smaller reward, contributing to lower issuance.\n\nETH burning:\n\nTransactions require a base fee that gets burned, removing ETH from circulation.\n\nOn days of high network demand, the burning can offset the daily ETH issuance, potentially leading to deflation.\n\nValidator economics:\n\nValidators are incentivized to withdraw rewards over 32 ETH.\n\nWithdrawal limits are in place to maintain network stability.\n\nThe switch to PoS has significantly cut ETH's inflation rate and enhanced the blockchain's sustainability. The supply and demand for ETH is now affected by less issuance and the burning of transaction fees, which may sometimes result in net-zero inflation or deflation.\n\nWhat are the risks and challenges facing Ethereum and ETH?\n\nMany believe the risks and challenges that could affect Ethereum and ETH center on issues with functionality and value.\n\nCompetition from other blockchains\n\nNetworks like Solana and Cardano, which offer faster and cheaper transactions, are emerging as competitors that could potentially erode Ethereum's market share. However, one positive from increased competitive pressure is the potential for fresh innovation.\n\nScalability and storage\n\nAs Ethereum's blockchain increases, it's faced with scalability issues. The need for large storage capacity is growing faster than for Bitcoin. If this need is not managed effectively, it could result in the network exceeding the available resources which could cause problems with performance.\n\nHigh transaction fees\n\nEthereum's network can be too costly for transactions with little monetary value due to high fees. This could restrict its use to only those transactions with higher values, potentially impeding its day-to-day utility.\n\nRegulatory risks\n\nRegulations surrounding the DeFi and NFT segments running on Ethereum could change. If these segments are prohibited or limited in their use of Ethereum, it could diminish demand for transactions on the network.\n\nSecurity threats\n\nEthereum's layered architecture is susceptible to a variety of attacks:\n\nReplay attacks : hackers can copy and use transaction details again if crucial factors such as timestamps and nonces aren't handled correctly.\n\nFalse top-up attacks : errors in the confirmation process of tokens traded on platforms can result in the theft of possessions.\n\nHoneypot attacks : scam contracts that trick users into thinking they can steal ETH when in fact they lose it.\n\nShort URL attacks : bad input validation in exchanges can make transfer amounts look bigger than they are.\n\nAirdrop hunting attacks : these attacks involve the exploitation of airdrop functions to accumulate wealth illicitly.\n\nArbitrary storage writing attacks : the potential for attackers to change the data stored in smart contracts.\n\nGas exhaustion denial of service attacks: agreements that use up all the gas in a block, leaving no room for processing other transactions.\n\nWhat's the future outlook for Ethereum and ETH?\n\nA combination of market analysis, recent technological developments, and new innovations in token standards are shaping the future outlook for Ethereum and ETH.\n\nMarket analysis\n\nEthereum's price is predicted to hover between $1,800 and $1,900 throughout 2023, with resistance at $1,760 and potential dips to $1,600. The average trading price is expected to be around $1,880.75, and some analysts predict returns of around 5%. An ascending triangle technical trading setup indicates a bullish trend, suggesting Ethereum's rally could continue.\n\nBy November 2023, forecasts anticipate a value increase of 4.3%, reaching approximately $2,038.14. The market sentiment at November 2023 was neutral to bullish, with the Fear & Greed Index indicating a state of \"Greed.\"\n\nTechnological developments\n\nEthereum's transition from PoW to PoS with The Merge has reduced its energy consumption and improved security. Further upgrades, such as Danksharding, are expected to enhance Ethereum's scalability, speed, and efficiency, potentially strengthening its position in the crypto space.\n\nWith these technological advancements and a robust developer community, Ethereum is expected to sustain its growth and success.\n\nInnovation in token standards\n\nA notable innovation in 2023 is the introduction of ERC-6551 Token Bound Accounts (TBA). This new Ethereum token standard significantly expands the functionality of NFTs, enabling them to act as their own smart contract accounts.\n\nThis overcomes the limitations of the previous ERC-721 standard by allowing for seamless interactions and improving the real-world usability of digital assets.\n\nEthscriptions\n\nEthscriptions are a new innovation on the Ethereum blockchain. They offer a way to share data — currently only images — without the need to create ERC-721 tokens. They differ from NFTs in their use of calldata for storage, lower creation and transfer costs, and their native hosting on the Ethereum blockchain.\n\nEthereum Follow Protocol (EFP)\n\nBrantly Millegan proposed the EFP in spring 2023. The protocol allows users to follow each other natively on the Ethereum blockchain.\n\nThe vision is to build an essential social graph structure that's focused on Ethereum and can be incorporated with pre-existing platforms like the Ethereum Name Service (ENS).\n\nEthereum's future looks encouraging, bolstered by positive market movements, regular upgrades to its technology, and the emergence of new token standards that should help improve the platform's usefulness and features.\n\nBecause of this, Ethereum has the potential to keep growing and become an even more significant player in the world of digital currencies. As with all projects and tokens, it's wise to continue researching and following updates to Ethereum to stay up to speed with its developments.\n\nThe final word\n\nEthereum stands out as an influential platform for decentralized applications and smart contracts, powered by Ether (ETH).\n\nThe shift from PoW to PoS with the arrival of The Merge demonstrates Ethereum's dedication to progress and sustainability. This is seen in the network's growing scope of uses beyond transactions, paving the way for further DeFi innovation. Despite certain obstacles, such as scalability issues and rival protocols, Ethereum continues to push forward and find new users.\n\nAs Ethereum continues to evolve with new technological advancements, its impact on the digital and financial landscape is poised to grow. What future do you envision for Ethereum in this rapidly changing ecosystem?"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiygFBVV95cUxNdXJKZ1MzVExjdTRVZHZQQ1pEaVJLNHVScWpreTJrbXVzc2pBLWNodXg5dV9hRUZRQUR3LTIwSkdSeWxYSEhiMkdFanEwVHNzQjQ4enVCNG9mVHZkWF8tVzIwUTVNMk16ejZyNVhLMVlxU0Vwbjh2eDE5T1ZiellzRnJiT2V3MjFNNmt5RzFCdDBTbm9TUmF1UWQtTkFvdTRnNkg5aDB3UDJDcUMzbXBMNmdfb0duWU81ajF5em9hUjlZeENOa3k1Nk5B0gHPAUFVX3lxTE5FRldwSVVCWTZ6YmVQRGZ3OF8wTEtad0NZTWkxUDRibUp2d2FvMFVyVGlFTS1KclR6YjEtWE8ydUlxTWhSLVNEYW0wdHRVdVMzZHJzTjl0ZGpQVjlYdHAwaFdXNjNqUk5qM3oxQl95eFI4aFFiWkJVR0pfV19TNzRCZVVka1JfVExxNWRDRlpWRThaMmJRekVISkpUM1FvVTZZOHQwanQ1cnQ2MEVHOUtReTgyNUUxVkRjXzB6SHRRZ0Y1b2U3aXJoeHZmTWRUcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 22 Nov 2023 08:00:00 GMT",
        "title": "Trader Unveils Bull Market Price Targets for Bitcoin, Ethereum, Solana and Two Additional Altcoins - The Daily Hodl",
        "content": "A closely followed crypto analyst is sharing his price targets for Bitcoin (BTC) and four other digital assets.\n\nPseudonymous analyst Inmortal tells his 201,000 followers on the social media platform X that Bitcoin could soar by more than 255% from its current value in the next bull market.\n\nHe also says that Ethereum (ETH) could soar more than 393% from its current value and ETH competitor Solana (SOL) could soar more than 813% from its current value.\n\nLastly, the trader predicts decentralized oracle provider Chainlink (LINK) could soar more than 1,190% from its current value, and 0x0.ai (0x0), an AI-powered smart contract auditor, could soar more than 3,378% from its current value.\n\n“I don’t usually do this, but here it goes. Bull run (2024-2025) predictions:\n\nBTC: $131,000\n\nETH: $9,800\n\nSOL: $490\n\n0x0: $4\n\nLINK: $180.”\n\nLooking at Ethereum, the trader predicts that ETH will soon take out recent high prices and cross the $2,100 level within days.\n\n“Sweep the highs first.”\n\nHe also predicts that 0x0 will continue its strong performance against Wrapped Ethereum (0x0/WETH) and hit 0.00110 WETH in early 2024, up from its current value of 0.0000557 WETH.\n\n“Casual +70% up move in one week.\n\nAnother normal day for 0x0 holders.”\n\nBitcoin is trading for $36,851 at time of writing, down 1.8% in the last 24 hours. Meanwhile, Ethereum is trading for $1,985 at time of writing, down 2.2% in the last 24 hours.\n\nSolana is trading for $53.66 at time of writing, down 5.8% in the last 24 hours, while Chainlink is trading for $13.95 at time of writing, down 4.5% in the last 24 hours.\n\n0x0 is trading for $0.115 at time of writing, down 13.6% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE1HUEFLam0waUtlZHZyNEpxOHNJQVk4OWtzNlVKSEZtWG1UZlppTkxVa2Jod3NGV1NmcS1EbzhrS21sQmRxbkdkazY4anZlb2N3eVd6czFnbjJMaXQyZDlkb3FsVlNBWUI2REtYbDNsZmtxR1A5M0HSAXtBVV95cUxOZHlkRHlUM2o0a2ZaVnVfSXJYZGlyOUk5WHJ2dF95a0pDWTNvb2tMa2t6SW42MFljeVpGb3Y1YklGazN3RHBwTGNDXzVZeVpTSVMwV1BZOEdQZmlWZmUwSnVNcmFIN2hfOHBiakhsWTVaQ3E2aDBsWm1QY1E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Price Could Reach $36,800 By 2030: Token Terminal - Bitcoinist",
        "content": "Token Terminal, a blockchain analytics platform, predicts Ethereum (ETH), the world’s second most valuable cryptocurrency, can soar above $36,800 by the decade’s end based on total addressable market projects.\n\nIn an in-depth analysis covering Ethereum on November 23, the analytics platform laid out several reasons that will drive the coin to astronomical levels, nearly 18X from spot levels.\n\nEthereum Is King, Predicted To Process $14 Trillion In Value By 2030\n\nThe Token Terminal report cited strengthening network effects, increasing token scarcity, and successful transition to proof-of-stake (PoS) consensus as possible price drivers accelerating the rally towards $36,800. The first-mover advantage and network effects, among others, have given Ethereum a competitive advantage over rival smart contract platforms, including Solana (SOL) and Cardano (ADA).\n\n\n\nUsers can deploy decentralized finance (DeFi) solutions in these competing networks, mint non-fungible tokens (NFTs), and overly participate in web3 development. Even so, Token Terminal observes that despite Ethereum’s limited scalability and fluctuating gas fees, which tend to rise in trending markets and intense network activity, discouraging engagement, it stands to dominate in the years ahead.\n\nQuantifying future adoption, Token Terminal estimates that by 2030, approximately half of the finance industry’s trillion-dollar revenue will likely be flowing through Ethereum. To put a figure to this, the blockchain analytics platform estimates that over $14 trillion in value will be settled on-chain, with Ethereum as the preferred network.\n\nThe finance industry generates over $28 trillion in annual revenue, growing at a compound annual growth rate (CAGR) of 7.5%.\n\nAs it is, this mega valuation expected to flow through Ethereum is more than 10X the total crypto market when writing on November 2023. According to CoinMarketCap, it is slightly over $1.4 trillion with Bitcoin commanding roughly 51%.\n\nMaking projections from this outlook, the blockchain analytics platform noted that the expected adoption via emerging verticals, including identity, content streaming, and even the Internet of Things, could see ETH soar year-over-year in the next seven years.\n\nPotential Challenges That Might Slow Adoption\n\nStill, the study notes that challenges in the future might slow down adoption, potentially stifling growth and prices. Top of the list is the risk associated with regulation. As crypto finds adoption, the research notes that governments might try to interfere to maintain order.\n\nAt the same time, there could be unforeseen changes to the network design tradeoffs, the success and subsequent dominance of layer-2s forcing venture capitals to prioritize funding for off-chain projects and note those deploying on the mainnet.\n\nAdditionally, Token Terminal said even a bug being discovered on-chain, leading to losses and, thus, a dent in confidence, cannot be discounted in the long-term.\n\nFeature image from Canva, chart from TradingView"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiZEFVX3lxTFBwa0VfUWM4QVlEXzgtUEI1TTNBU0ljVFhjWFYzV3FvUkVUdVA5SXZPaHZUbmhvYjMxZTlGTFdRaFViYklZcWp4dFc5THdidzRHdURRak9zQ09DOU9LVXpjTW1zLUs?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 22 Nov 2023 08:00:00 GMT",
        "title": "Wannabe L2 Blast bursts onto scene promising high ETH yield — in 3 months - Blockworks",
        "content": "A new Ethereum layer-2 rollup, announced Monday, has already attracted $27 million in total value locked (TVL), but there’s a twist: It doesn’t yet exist.\n\nThe promised network, Blast, would launch as an optimistic rollup in February 2024, but its backers immediately began soliciting deposits into a smart contract “bridge.”\n\nIn the span of half a day, the contract has amassed enough ether (ETH) and dai (DAI) to put it at number 16 in rollup tracker L2Beat’s TVL rankings, ahead of established names such as derivatives DEX Aevo and Arbitrum Nova.\n\nThe announcement touts Blast as “the only Ethereum L2 with native yield for ETH and stablecoins,” meaning it taps into Ethereum staking yield by directing all ETH to Lido and uses DAI to tap MakerDAO’s growing US Treasury bill yield through its Dai Savings Rate (DSR), currently at 5%.\n\nBlast’s development team, led by pseudonymous Blur co-founder Pacman, raised $20 million from venture capital firms Paradigm and Standard Crypto, joined by a motley crew of angel investors and crypto influencers.\n\nEarly reaction has focused on the one-way nature of the “bridge” — once you cross you can’t exit until after Blast actually launches and withdrawals are enabled.\n\nNormally, a bridge allows assets to flow both ways. This contract is apparently controlled by a five-key multi-signature wallet. However, of the five addresses, one contains no ether and has no transaction history, and the other four were recently funded by a single address.\n\nThat calls into question the independence of the signing cohort.\n\nAccording to Pacman, there’s no need to worry.\n\n“The Blast Early Access bridge contract does use a multisig, and each signer is a unique contributor to Blast,” he told Blockworks. “This is the same security model that other L2s like Optimism, Polygon, and Arbitrum utilize — these L2s are all upgradeable via multisig as well.”\n\nBlockworks also contacted Paradigm and Standard Crypto for comment.\n\nL2Beat designated the project “upcoming” rather than “active” as a result of its current implementation.\n\nLoading Tweet..\n\nThe use of Lido has drawn the ire of Ethereum community members concerned with centralization risk in staking providers, including Dankrad Feist, who called it “a very bad idea” on X.\n\n“ETH and liquid staking derivatives are different assets with different risk profiles (and rewards), and users should have a choice about which one they want to use,” he said.\n\nIt should come as no surprise, given that Paradigm is an investor in both Lido and Blur.\n\nCritics also question the use of a multi-level-marketing style referral campaign, which doles out points, of unknown value, to incentivize sending invitations to prospective new users.\n\nLoading Tweet..\n\nThe site explicitly promises an airdrop based on early access participation. Points earned are expected to be redeemable in May 2024.\n\nPoints systems have increasingly been used as a growth bootstrapping mechanism by protocol developers — including Pacman’s prior marketing of Blur — and are widely seen as a precursor to an airdrop or something else of value.\n\nUpdated Nov. 21, 2024 at 12:15 pm ET with comment from Pacman and Nov. 22 at 5:57 am ET with additional context.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxNWFhtQlBzVkxrNVZIWjdaWm9WUE9QOUFBc3ZCQkdnNDNrMlBXcTBHWnFFbXhBOG1mQWlXS2NjU0laMjdIc3JpV0s2VHNuMzROSC13OUxNZ1Z2UHpMWWw0U0JYelVQallMZ0dVTFNNbnV6WXBQdlRYLWNLNGV4ZThKSklUb9IBiAFBVV95cUxPSHhQRDhib2h1d1dxWHh2X2hHOE9fQjJ4UHgyVVhjdUlPN0tlZ212UnYtZlFubUNybXJaOXEtTHhzNG9zb3ZEa05oUkRvZzE1WmZnSWVSeEJ0QlFyeHo3NTM4NFRlX05CU3pkME9JTTFFWXB0OTg1VGNLdEZQcml5SC1MWEs0YnhK?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 22 Nov 2023 08:00:00 GMT",
        "title": "What Is Blast? Ethereum Staking L2 That Spiked by 20,000% in TVL - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nOn Nov. 21, 2023, Blast, a new second-layer solution on Ethereum (ETH), caused unprecedented hype on social media. By press time, over $87 million in liquidity is injected into this on-chain bridge.\n\nAdvertisement\n\nWhat is Blast, novel Ethereum staking L2: Highlights\n\nBlast L2 protocol attempts to change the way Ether (ETH) is staked on-chain. It employs a number of eccentric mechanisms designed to offer more profitable and seamless staking for ETH holders.\n\nBlast is promoted as a second-layer protocol on top of Ethereum (ETH), the largest programmable blockchain.\n\nPer the statement of its team, Blast automatically stakes all injected crypto in Lido and redistributes staking rewards between investors if its L2.\n\nAlso, users who bridge stablecoins, automatically get USDB, Blast's auto-rebasing stablecoin, to enjoy additional yield from MakerDAO's on-chain T-bill protocol.\n\nBlast team will enable withdrawals on Feb. 24, 2024, while redemption of Blast Points is set to kick off in May.\n\nThe project siphoned over $87 million in Ether and stablecoins in less than 24 hours upon launch.\n\nImage by 21 Shares via Dune Analytics\n\nBy press time, its TVL metric demonstrates over 20,000% daily growth, which makes it arguably the fastest growing L2 in Ethereum (ETH) history.\n\nBlast, most overhyped Ethereum L2 in Q4, 2023\n\nBlast, a novel L2 on Ethereum, is attempting to make ETH staking more profitable via the concept of \"native yield.\"\n\nBlast L2: Basics\n\nBlast is the second-layer solution on the top of the Ethereum (ETH) blockchain. Per its official statement, Blast is developed by contributors of Blur, a dominant NFT marketplace. Also, it is said to be funded by heavyweight VCs Paradigm, Standard Crypto and Primitive Ventures with the participation of top angel investors Andrew Kang and Santiago Santos.\n\nSimply put, the protocol attempts to offer more inclusive and profitable staking for ETH and stablecoin holders than its competitors.\n\nWith Blast, ETH itself is natively rebasing on the L2. Ether-denominated yield from an L1 staking protocol (initially Lido) is automatically transferred to users via rebasing ETH on the L2.\n\nBlast attempts to integrate real-world assets into the ETH staking process. All of its customers who inject stablecoins get USDB, Blast's native asset. The yield for USDB comes from MakerDAO protocol pegged to U.S. 10-year T-bills.\n\nBlast L2: When will the token arrive?\n\nBlast released a three-step timeline for its operations:\n\nEarly access (already live from Nov. 21): Bridge goes live, Blast Points distribution starts. Mainnet launch (expected on Feb. 24, 2024): dApps go live, ETH withdrawals enabled by team. Redemption (expected in May 24, 2024): Blast Points redemption activated.\n\nUsers will only be able to withdraw what they inject into Blast three months after the start of its early access campaign.\n\nBlast Ethereum L2: Risks\n\nBesides the high volatility of cryptocurrency and other \"regular\" considerations necessary for crypto investors, there are some extra risks associated with the project so far:\n\nNobody can predict the price of Ether and associated assets on the day of the unlocking; the stakes-USD-denominated valuation can either spike or shrink.\n\nAirdrop of token is not guaranteed; its rules are also yet to be announced.\n\nInterest in building dApps on this L2 cannot be predicted.\n\nAs such, users should be extra cautious when working with every early-stage cryptocurrency protocol."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTE10OElkWmYzSU1mSDhYaGNDbHNpZUdkemVhRXFuZmZjNERKaDdjelhEdHZrTmRQOTcyTnZWX0tDU2pZWkI5eFJab0tSMzh0bDBxb21wbkdyMEJ4NmZrZ09CQ1FlVEVqdnJMS0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 22 Nov 2023 08:00:00 GMT",
        "title": "Huobi’s ‘Heco’ chain bridge drained of $87M in crypto assets - Blockworks",
        "content": "The bridge connecting the HTX exchange (formerly Huobi) and Ethereum was exploited for approximately $87 million in crypto assets early Wednesday.\n\nLarge quantities of ether, tether (USDT) and a wrapped version of bitcoin (HBTC) were seen leaving the bridge for a previously unused Ethereum wallet.\n\nThe suspicious transactions were first analyzed by various blockchain security firms including CertiK, Peckshield and Cyvers.\n\nAccording to CertiK, the bridge’s private key was likely compromised.\n\n“The suspicious transactions were initiated by the Huobi HECO Bridge operator wallet indicating that this wallet was compromised,” a CertiK spokesperson told Blockworks.\n\nRead more: Crypto exchange HTX loses $8M in weekend hack\n\nVarious other ERC-20 tokens were drained, swapped for ether, and distributed to at least 8 other wallets.\n\nTwo hot wallets of HTX Global (formerly Huobi) lost funds, according to Cyvers. Board member Justin Sun confirmed the incident on X.\n\n“HTX and Heco Cross-Chain Bridge Undergo Hacker Attack. HTX Will Fully Compensate for HTX’s hot wallet Losses,” Sun said.\n\nJustin Sun assumed control over the Huobi Eco Chain in October 2022, Bloomberg previously reported, although Sun denied he owns a majority stake. He referred to it as a merger with the Tron and BitTorrent Chain ecosystems, which he also controls.\n\nThe primary purpose of the HECO bridge is to enable the movement of digital assets between the Huobi Eco Chain and other blockchain networks, such as Ethereum.\n\nThe HECO hack is not an isolated incident but rather part of a pattern of security lapses in blockchain projects associated with Sun. Poloniex, an exchange acquired by Sun, suffered a $100 million exploit two weeks ago, which security analysts believe also may have resulted from compromised private keys.\n\nPoloniex officials have been in the process of negotiating with the hacker in that case.\n\nIt’s not yet clear if the two thefts are directly related.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    }
]