[
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE11cXJRMjd0ZUstM0JZVmFTRDFoeHhpVGE4RWJnWFBaTUQ2Rlh6aGxnQW1LQU12OXh6STBsQWtxeUVCS3U4NWY4VUg5cGFzVGJMU29vZGdfRDdTLWtiZGFFR0VvdFVGUGRNX0cwbU52NDRhZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Set For Significant Surge, Eyes 0.125 BTC Target - TronWeekly",
        "content": "Jelle­­, a noted cryptocurrency trader, has pre­­sented a detaile­­d analysis of the ETH/BTC trading pair over the past thre­­e years. He highlights a classic Wyckoff re­­-accumulation pattern, indicating that Ethereum (ETH) is on the­­ brink of a significant upward movement.\n\nHe be­­gins with the Preliminary Support (PSY) phase around 0.030 BTC, whe­­re substantial buying interest e­­merged, establishing initial support. This phase­­ was followed by the Automatic Rally (AR), driven by inte­­nse buying pressure, pushing ETH’s price­­ to approximately 0.045 BTC. The rally culminate­d in a Buying Climax (BC) at around 0.085 BTC, marking a peak before a re­actionary decline.\n\nEthereum (ETH) Set for Significant Surge, Eyes 0.125 BTC Target 4\n\nIn the Se­condary Test (ST) phase, the price­ dropped to approximately 0.065 BTC, confirming the support leve­l following an initial peak. Afterward, the Uppe­r Trading range (UT phase B) indicated a consolidation pe­riod, during which prices fluctuated betwe­en 0.065 BTC and 0.080 BTC. This consolidation period showed that se­lling pressure was being absorbe­d and hinted at a potential breakout.\n\nDuring the­ Creek phase, the­ price followed a desce­nding trendline, marking the final stage­s of accumulation before a breakout. The­ Spring phase, which occurred around 0.048 BTC, involved a brie­f shakeout to test support leve­ls, resulting in a temporary decline­ before a rebound. The­ recent price move­ments indicate a rebound, se­tting the stage for a notable upward tre­nd.\n\nEthereum Price Forecast\n\nJelle­ identifies the curre­nt phase as the Test phase­, confirming support around 0.053 BTC. This phase is crucial as it validate­s the­ spring and pre­­pares for the­ ne­xt rally phase­­, potentially targe­ting re­sistance­­ leve­ls. The­ anticipate­­d commenceme­nt of spot ETFs trading in the­­ coming weeks is e­xpe­­cted to bring substantial institutional investme­nt, providing the­­ necessary mome­ntum for Ethereum’s surge.\n\nETH is curre­­ntly trading at $3,069, marking a 3.55% increase in the last 24 hours. Howe­­ver, trading volume has decre­­ased by over 12%. Daily indicators reve­­al a significant downtrend, with the 50-day and 100-day Exponential Moving Ave­­rages (EMAs) positioned well above­­ the current price le­­vel. The 50 EMA stands at approximately $3,372.33, and the­­ 100 EMA is around $3,329.70, indicating a bearish market sentime­­nt.\n\nEthereum (ETH) Set for Significant Surge, Eyes 0.125 BTC Target 5\n\nThe Relative Stre­­ngth Index (RSI) indicator, currently at 38.09, signals bearish mome­­ntum. Despite being be­­low the neutral 50 leve­­l, the RSI shows a slight upward movement, hinting at pote­­ntial bullish divergence. Although in the­­ oversold territory, this suggests the­­ recent price downtre­­nd might be nearing exhaustion.\n\nWhile­ ETH face­s downward pre­ssure, a shift towards positive­ price­ action is possible­ if bullish momentum stre­ngthe­ns. Je­lle’s fore­cast pre­dicts a short-te­rm rise to 0.090 BTC, with a longe­r-te­rm targe­t of 0.125 BTC. Ethereum’s future­ looks promising as the­ market anticipate­s the­ impact of institutional inve­stments and spot ETFs.\n\nRelated Readings | Ethereum’s Strength Surpasses Bitcoin: Analyst Predicts Bullish Trend"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxPYUZMMWs2MmpjdlFpY25XRnJBbUhnZjBrWjBUX1E4bmpMTnl2X3c4RE42Zkt4V2tIaUtxcXVtdkRDdnhjQ2JWMGVodzZiU1REdTBHWXFZQzZuRDQ1NVR2RUExT2had3hxVUp5eTAtckNHRnBLemhtdTVpZ3BwVkRRNE1sOUNxdUtIWFUtd1gzM0kwRVJNYm4xMVgzeXl3SERyYmc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "Bitwise CCO says Ethereum ETFs ‘close to finish line’, SEC open to other funds - CryptoSlate",
        "content": "Bitwise CCO Katherine Dowling said spot Ethereum ETFs are “close to the finish line” while noting that the SEC is “quite welcoming” about discussions regarding other products.\n\nOn July 9, Dowling told Bloomberg that the SEC and ETF issuers are addressing fewer issues in each S-1 amendment, pointing to a close launch.\n\nDowling affirmed SEC chair Gary Gensler’s assertion that the agency will fully approve issuers’ registration statements over the summer but described an open time frame. She said:\n\n“You know, everyone has a different definition of summer. It’s been a little bit of a long, hot summer for the issuers waiting ….”\n\nDowling said that Bitwise intends to set itself apart from other applicants, including giants such as BlackRock and Fidelity, as a “crypto specialist” with years of focus on the sector.\n\nBitwise filed its most recent amendment on July 3, while many other applicants filed on a July 8 deadline. Applicants must still add certain details, including sponsor’s fees, in future amendments.\n\nSEC welcoming to other discussions\n\nDowling also said that Bitwise has spoken to the SEC about potential new products “coming down the pipe.” She described the conversations positively, stating:\n\n“I think our communication with the SEC about the prospects for these products has actually been quite welcoming.”\n\nHowever, she agreed with Bloomberg ETF analyst Eric Balchunas that some products may only be approved under a new SEC chair.\n\nOtherwise, she said, it could take considerable time to bring the products to market due to the history of previous product approvals and the lack of future markets underlying the potential products.\n\nDowling did not identify the products in question. Currently, the only other pending spot crypto ETFs are VanEck and 21Shares’ spot Solana (SOL) ETFs.\n\nBitwise has not applied for a similar product as of press time.\n\nMentioned in this article"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxQR19qalNKX1JUcXNmcE9JaDhEcHV1Qm5fZzVnck1PNGlYTHYyaUEwcmFoVmViOGpWblBxS05NcHZrZTZoMm5VdUM5Ty1abW14WF9hUEZGSENCalI4MFVWV1dLbjdSUkFfVlo4RDc4T1JMSExuZlFhRm8wdEZHakhWMFpmTEI3T2ZlUW1TSEN6YW9ITnVDY1JKekFRQVFsa09hT0cyWHB4VURyLVEybUdDckluQdIBuAFBVV95cUxPWjk4UjAwSG1UZVdMSFBUeGd1NU01dDlQOS1OWTJubjVMcGNYMmkxNWd4VThaMm1HTXJfQU5BYUNfdWFreG5uVkpfLXVaZWJEeEZUdXd3bThBQnY4OFNOQnVPUDVsWGVtNnE1Wm9STV9CUUtwS1BjYWM3c1lkTHlxSF94UEVPOFBDb2xVUl9JZXp0b0JFeXNzRC1LSmVkcTRVM1ZLOVVCem9WZjVuNFVMSEV5ZDRkV2hC?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "Top Crypto Analyst Predicts Swift Ethereum Recovery, Says Big Run Coming for ETH - The Daily Hodl",
        "content": "A widely followed crypto strategist believes that the leading altcoin Ethereum (ETH) is close to carving a mid-cycle bottom.\n\nIn a new video update, pseudonymous analyst Bluntz tells his 264,400 followers on the social media platform X that Ethereum is about to conclude its ABC corrective wave.\n\nBluntz practices the Elliott Wave theory, which states that a consolidating asset tends to witness an ABC correction before igniting a fresh five-wave surge.\n\n“Looking at ETH/USD, we’re basically down here at the lows again, but I think it would be very odd if we just moved up from here…\n\nI think ultimately ETH needs to sweep $2,800, take out the low and reclaim it and then finally we would have what looks like a proper ABC down on Ethereum… [I think] we go sideways here on ETH for a little bit and take the lows and then look to bounce.”\n\nAccording to the analyst, Ethereum’s ABC correction will eventually resolve to the upside, sending ETH initially to a new all-time high of $6,000 before pulling back and rallying to a cycle top of $8,000.\n\n“I still firmly believe ETH has not had its big run yet and I do think it will definitely be coming this cycle. It’s just late.\n\nIt’s probably going to be induced by the ETH ETF narrative, which is supposedly coming out any day now. Everyone’s talking about it, everyone’s expecting it to be this giga-bullish ETH news. So I think what will most likely happen in my opinion is ETH will sell off first, take the lows, f**k everyone over and then start to get bid up heavily.”\n\nAt time of writing, Ethereum is worth $3,048.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxPc3BhVnBERjVfTVFmbzZkUExjUDdwemg3dmo3dGd5S0ZKczJ6SGxDMnhtS1h3bmg5SVNPaGxfRjh5b3lndUVLdHpRYl9NUHFpb3JiSTBCajBraUhUb09wWjI1QXZDa19nY2J3QlRJTG5IOVdNLWZEV1h3ZkJSLU91QVlFa0NCSno1YWN0OXl3eFJJUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jul 2024 07:00:00 GMT",
        "title": "How to Convert (Swap) Ethereum (ETH) to Bitcoin (BTC) - Finance Monthly",
        "content": "Imagine standing at the crossroads of the digital currency universe, where two of the most influential cryptocurrencies, Ethereum (ETH) and Bitcoin (BTC), intersect. This is not a mere intersection, but a gateway, a portal that allows you to convert one cryptocurrency into another. As a result, the question of how to swap ETH to BTC arises. Today, we will guide you on the journey of ETH to BTC swaps.\n\nThis journey is not just for the seasoned crypto navigators but also for those who have just set sail in the vast ocean of digital currencies. Knowing how to convert Ethereum to Bitcoin is like having a magic key that can unlock new opportunities for investment and diversification. Follow this guide to navigate the process and learn all about the exchange of two major players on the market - ETH to BTC.\n\nWhat is Ethereum (ETH)?\n\nEthereum (ETH) is not just a cryptocurrency but more of a decentralized global computer. It was funded through crowdfunding, making it decentralized from the start. Ethereum is in the process of a significant change from Proof-of-Work to Proof-of-Stake. With a market cap of $198 billion, Ethereum is the second-largest blockchain network in the world. It hosts nearly 6,000 decentralized apps (DApps) and functions as the base infrastructure for several crypto trading platforms, DeFi protocols, and NFT marketplaces.\n\nWhat is Bitcoin (BTC)?\n\nBitcoin, although less mysterious and more widespread, also has some intriguing aspects that are not widely known. For instance, a bug in 2010 led to the accidental creation of 184 billion BTC, far exceeding the intended maximum limit of 21 million. However, this issue was quickly rectified, and the maximum limit was reinstated. Another interesting fact is that the smallest unit of bitcoin is called a “satoshi,” which is equal to 0.00000001 BTC. Together, all these make the question of how to swap ETH to BTC even more important.\n\nWhy Do Users Swap ETH to BTC?\n\nUsers might look for ways to convert ETH to BTC for various reasons. One of the primary reasons is portfolio diversification. By holding a diverse range of cryptocurrencies, investors can mitigate risk across different assets. Due to the high volatility in cryptocurrency values, maintaining a variety of assets can safeguard investments against market fluctuations.\n\nWhere to Swap ETH to BTC?\n\nThere are several platforms where users can swap ETH to BTC. These include places like Coinbase, Binance, Kraken, and more. However, the majority of our readers prefer SimpleSwap as a convenient way to convert ETH to BTC. The platform stands out as a reliable and user-friendly platform for swapping ETH to BTC\n\nHow to Swap ETH to BTC: Swapping Guide\n\nOne solution for those wondering how to transfer ETH to BTC is through a platform like SimpleSwap.\n\n1. Choose the crypto pair.\n\nSelect ETH in the “You send” section and enter the amount you wish to exchange. Then choose BTC in the “You get” section. Click “Exchange”.\n\n2. Add the recipient’s address.\n\nEnter the recipient’s address. The ETH will be sent to this address after the exchange.\n\n3. Send the deposit\n\nYou’ll see an address to send the indicated amount of BTC to continue your swap.\n\n4. Get cryptocurrencies\n\nAfter receiving your deposit, SimpleSwap will convert it and send the ETH to the wallet address you provided.\n\nHow the Exchange (Swap) Process Looks Like\n\nBefore we delve into the specifics of how to exchange ETH to BTC, let’s pause to comprehend the procedure. By following a well-defined and organized approach, you can facilitate the exchange process with ease and efficiency. It’s important to note that this procedure is not exclusive to the method to buy Bitcoin with Ethereum - it can also be applied to any crypto pair.\n\nBenefits of Exchanging ETH to BTC\n\nSwapping the two can offer several benefits, some of which are discussed below:\n\nDiversity of Your Cryptocurrency Portfolio\n\nThe exchange allows you to distribute your investments across multiple cryptocurrencies, taking advantage of the distinct strengths and opportunities each coin presents. This strategy can reduce the impact of volatility in any one cryptocurrency and potentially improve the overall performance of your portfolio.\n\nPotential for Higher Returns\n\nHistorically, Bitcoin has demonstrated higher returns than Ethereum. While past performance does not guarantee future outcomes, many investors exchange ETH for BTC with the aim of benefiting from Bitcoin's market trends and its potential for high returns. However, it’s crucial to understand that higher potential returns also come with greater risk.\n\nLarger Market Volume and Broader Application\n\nBitcoin, being the first and most widely adopted cryptocurrency, has a larger market volume and broader application than Ethereum. This means Bitcoin is accepted and recognized by more businesses and individuals worldwide, making it potentially a more liquid and versatile investment. Swapping ETH to BTC could therefore offer more opportunities for use and potential appreciation.\n\nLower Transaction Fees\n\nBitcoin transactions generally have lower fees compared to Ethereum, especially during periods of high network congestion. This can make Bitcoin a more cost-effective option for frequent transactions. However, transaction fees can vary and should be checked at the time of the transaction.\n\nConclusion\n\nIn conclusion, the choice of how to convert ETH to BTC can be a strategic move both in the short term and in the long term. While the process may seem complex at first, platforms like SimpleSwap make the process straightforward and accessible. As with any financial decision, it’s important to do your research and understand the potential risks and rewards."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMia0FVX3lxTFBtdzNIakdkeEliN01BYXZGd0tFcmhpWDN5a3FEamlKVTMxSGsyRXhuYVVsdWxNQmtJWHpUNlc0T3hYc08yNU1MbTJZM2hCLVVJS1plVXI5MmRaeG9WYmp5Y1VwRk5VN0V0dktB0gFwQVVfeXFMUFdOQXBjQ3dVTjJjWXF0YWI0SGxzalFOUTNRLUY5S1l5bE1Xb2Uzd1hTN2szT0RuazdSbnBCNF8wRG56ZXk0QTgtc1lXWXlRNWFINVBHS19hOWxNVGNMWEpsUlR0UE5pZ21QMmJyZV9fOQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jul 2024 07:00:00 GMT",
        "title": "What is ENS? Ethereum Name Service Explained (Updated 2022) - CryptoPotato",
        "content": "Back in the days, when the Internet wasn’t so mainstream, one of the main problems that users faced was that domain names hadn’t been matched up to Internet protocol (IP) addresses.\n\nThis made them very unfriendly towards the average Joe, who had to type in the IP address of the website they wanted to visit, as in to type in the numbers literally.\n\nUnlike traditional IPs, cryptocurrency addresses represent even longer strings of numbers and letters. If a user wants to send another user funds over Ethereum’s network, they would have to input the address and make sure that each number and letter is written correctly.\n\nQuick Navigation\n\nIt’s also important to know that blockchain-based technology is very punishing in this regard. If you fail to input the address correctly and mistype a letter, the funds you send will be irreversibly lost. There’s no central authority to contact to reverse or refund the transaction—that money is lost.\n\nAnd just like Domain Name Services (DNS) came to life when using the Internet, the Ethereum Name Service (ENS) came to be.\n\nWhat is Ethereum Name Service (ENS)?\n\nEthereum Name Service (ENS) uses the same concept as the Domain Name Service (DNS) but adjusts it for the needs of Ethereum users. At its core, the Ethereum Name Service is a distributed, open, and extensible naming system operating on the Ethereum blockchain.\n\nIt aims to map human-readable names to machine-readable identifiers. In this case, the human-readable name can be something like “cactus.eth,” whereas the machine-readable identifier can be the Ethereum address (or other cryptocurrency addresses, for that matter.)\n\nIn the image below, we have given an example of what it looks like. The address belongs to the Ethereum Foundation. The ENS domain name that we created is just an example for the purpose of this guide:\n\nThe standard Ethereum Address is converted into human-readable text (foundation.eth). This means that users can send funds or interact with “foundation.eth” instead of the standard address. Obviously, this makes it much easier for regular users and also considerably tightens the possibility of a mistake.\n\nAccording to the official ENS documentation, the system “has similar goals to DNS, the Internet’s Domain Name Service, but has significantly different architecture due to the capabilities and constraints provided by the Ethereum blockchain.”\n\nSimilar to DNS, ENS operates on a system of dot-separated hierarchical names called domains. The owner of a domain also has full control over the subdomains.\n\nHow Does ENS Work?\n\nThere are two core components to the Ethereum Name Service. Namely, these are the registry and the resolvers. The architecture of the system looks like this:\n\nRegistry\n\nThe registry is composed of a smart contract designed to maintain a list of all the domains and subdomains while also storing three essential pieces of information about each. These pieces are:\n\nThe owner of the domain\n\nThe resolver of the domain\n\nThe caching time-to-live for all the records that are under the domain\n\nThe purpose of the ENS registry is very straightforward – it’s to map from a name to the resolver who’s responsible for it. Meanwhile, owners of domains in the ENS registry are allowed to:\n\nChange the ownership of the subdomains\n\nTransfer ownership of their domain to another address\n\nSet the resolver and the time-to-live (TTL) for the domain\n\nResolvers\n\nResolvers, on the other hand, are responsible for translating names into addresses. Every contract that implements the required standards can be a resolver in the Ethereum Name Service. However, resolving a name in ENS is a process that is composed of two steps.\n\nThe first one is to ask the registry what resolver is responsible for the said name. The second one is to ask that particular resolver for the answer to the query. In terms of architecture, it looks like this:\n\nThe Difference Between DNS and ENS\n\nThe Domain Name Service (DNS) was created in 1983 by Paul Mockapetris, a US computer scientist. It followed the research of another American scientist, Elizabeth Feinler.\n\nPut in simple terms, the purpose of DNS is to match internet protocol (IP) addresses with human-friendly domain names. This allows users to type in the website’s name instead of having to input the literal numeric IP address.\n\nIn a similar yet different way, Ethereum Name Service attempts to make it easier for people (and applications) to read and share cryptocurrency addresses.\n\nHow to Register an Ethereum Name Service (ENS) Domain?\n\nRegistering an Ethereum Name Service domain is pretty straightforward. All you need is a hot wallet such as MetaMask.\n\nGo to app.ens.domains (the official website for registering an ENS domain), and type in the domain name that you want to register. This will check its availability.\n\nOnce you have selected your name, all you need to do is follow the instructions given below:\n\nEthereum Name Service Governance\n\nThe Ethereum Name Service is governed by several different arms, each with its own significance.\n\nENS Token + Distribution\n\nThe ENS token is a standard token using the ERC-20 standard on the Ethereum blockchain. Its main purpose is to be used for the governance of the system.\n\nToken holders can submit proposals and cast their votes. The main place where community members can discuss ideas and have governance-related discussions is the forum discuss.ens.domains.\n\nThe ENS token was airdropped to early adopters who had previously registered an ENS domain name. The claiming process started on November 8th, 2021, and users had until May 4th, 2022, to claim their allotted tokens.\n\n25% of the total supply was distributed through the airdrop, while the rest is designated as shown in the following piechart:\n\nENS DAO\n\nIn the spirit of decentralization, the Ethereum Name Service is operated by a decentralized autonomous organization (DAO). The DAO is governed by holders of the ENS token, who can submit proposals and vote on them to determine the protocol’s future development.\n\nENS Foundation\n\nThe ENS DAO itself is represented by an existing Cayman Islands Foundation called the ENS Foundation.\n\nIt has a few purposes, including:\n\nTo comply with tax requirements because without a legal entity, DAO participants may be responsible for a certain proportion of the DAO’s income, even if they don’t have access to these funds.\n\nTo enter into contracts with other companies.\n\nTo provide limited liability for participants in the DAO for the actions of the DAO.\n\nConclusion\n\nENS is a critical advent in the cryptocurrency field and a step towards solving some of the pressing issues that riddle the industry – namely, user experience.\n\nHaving to deal with long strings of random numbers and letters is oftentimes the reason for mistakes, and in the field of crypto, mistakes are quite commonly very expensive. Normalizing addresses and presenting them in a human-readable and friendly way is a step towards improving the overall user experience, the way DNS improved the UX for Internet users.\n\nAt the same time, though, DNS records of domains and names are typically stored on centralized servers, making them prone to hacks. ENS, on the other hand, are secured by Ethereum’s blockchain, making them multifold and more secure.\n\nThat said, the Ethereum Name Service is undoubtedly an important invention and innovation that’s quickly become widespread and used by thousands of people."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTE5xWWxqdlBFM0x3ZXhVcmlXaVBRRXh3RXhLRkR1OVdleUVIOXRVSXRwQU9SOG8wbnIyWEI2d0FNVzg5Q2ZXTWwyLUJjUlcxYXdKWmRHdzdEWDJpODdRT2F1aml5eDg4R1Qtck5aTE9kNlVUejjSAXhBVV95cUxQRGhZNnUtRnE4eHhGdFpkaWRDZXAxWkIyb3JfWWhhN1ZKelYzNlFRWXl6MTNiTWg3ejRMRW5zdFgxeDlpb0lEVDVMZ3FjQkVIZDVDX0syWWdnX1pvTlZZc1VMaTV6dWlVSXMzMUQwRnBja05QbHBtaXI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 11:37:14 GMT",
        "title": "Ethereum (ETH) Sets Major Staking Milestone: Details - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAccording to on-chain analytics firm Santiment, Ethereum (ETH), the second largest cryptocurrency by market capitalization, has just set a major milestone - this time in staking.\n\nAdvertisement\n\nStaking refers to the act of depositing 32 ETH to activate validator software. However, there is some flexibility, as any user with any amount of ETH can help secure the network, while earning rewards based on how much they want to stake. While 32 ETH might be required to activate being a validator, it is possible to stake less.\n\nValidators are responsible for storing data, processing transactions and adding new blocks to the Ethereum blockchain. This helps to secure Ethereum, while also allowing users to earn ETH rewards.\n\nAccording to Santiment, the ETH2 Beacon Deposit Contract, used for staking deposits for Ethereum 2.0, now holds an all-time high of 47.36 million ETH. Santiment regards this as positivity, with this figure accounting for 33.9% of the entire ETH supply.\n\n🤯 The ETH2 Beacon Deposit Contract, used for staking deposits for Ethereum 2.0, now holds an all-time high 47.36M ETH, This is good for 33.9% of the entire supply, and more than tripling since the 10.9% it held two years ago. pic.twitter.com/aCnEhfClfb — Santiment (@santimentfeed) July 10, 2024\n\nSantiment noted a trend of growth in ETH staked, pointing out that this has more than tripled from the 10.9% the ETH2 Beacon deposit contract held two years ago.\n\nThis milestone remains significant as the network gets stronger against attacks, as more ETH is staked because it requires more ETH to control a majority of the network.\n\nIn another significant milestone, Blackrock's BUIDL fund operating on the Ethereum network continues to attract new investors. The fund requires a minimum entry of $5 million, and its total assets have nearly reached $500 million.\n\nEthereum price action\n\nAt the time of writing, ETH was trading down 0.29% in the last 24 hours at $3,079. In the short term, the $2,850 level is being eyed as a solid support for ETH's price action.\n\nThe $2,850 support cracks, the selling may increase and Ethereum may begin a downward trend to $2,200. The bulls are likely to strongly defend this level.\n\nAlternatively, if the ETH price bounces off its current level and goes above $3,110, it might signal the beginning of a relief rally above $3,200."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTFBlZGw1eDhyY2pYMzRQQUFYU3NJakFmY01ucGJDV1doOEZEUk1vUGp1MFM5OTlrc2JqVkw5eUZIVzNCdm1lejAycS0wVFJ4REI1YXVjM2hiYl8yMXI4UmdjS0hMWU9LU2JYSTBjYUNOS1p5eUcxSHROeS1yRGNiY2vSAYQBQVVfeXFMTnZwOHc3VlN4bWJQRUp6SlZaUmpyWXJwMS1ONjh0akpFd3dWNWdQLW01MHVfdmNBdV9tTGhNV3RaVjFYR0dqSjFaeUt5ZVltMkxkUEx1VHdZWFl4Z1B4LWxYQUdMS0JhRWtITGE2alBVYjQ5REtHZmdveTlLQjJhUEkyQWdj?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Investors Are Ready To Sell ETH As It Hits $3.2K - CoinGape",
        "content": "Ethereum, the second-largest cryptocurrency by market cap, has once again sparked speculations among crypto market participants. Meanwhile, all eyes are on the crypto amid soaring anticipation over a potential Ether ETF launch soon.\n\nHowever, ETH has recently reclaimed the $3K level, but on-chain data indicates that it faces significant resistance at $3,200. So, let’s take a closer look at why the $3.2K level poses a significant threat to Ethereum’s price.\n\nadvertisement\n\nEthereum Holders Ready To Sell ETH\n\nA recent Into The Block data revealed that approximately 2 million addresses that previously traded Ethereum at around the $3,200 price level are currently holding ETH at a loss. This paves the path for potential selloffs as these addresses break even with price gains ahead, adding selling pressure to the asset.\n\nHowever, a bullish catalyst in the pipeline might prevent this from happening. For context, the approaching launch of an ETH ETF (exchange-traded-product) could serve as a catalyst for a remarkable rising price action in the future. Aligning with this, the commencement of ETF trading could counteract the selling pressure, in turn generating positive momentum in the asset due to money inflow.\n\nHowever, it’s worth noting that Ethereum has continued to struggle to reach its resistance level of $3,200.\n\nAlso Read: Institutional FOMO On Spot Bitcoin ETF As German Govt Continues BTC Sell-off\n\nETH Price Faces Turbulency\n\nAt press time, the ETH price showed a 0.20% dip in value, trading at $3,100.56. The token’s 24-hour bottoms and peaks were $3,025.51 and $3,129.02, respectively.\n\nCoinglass data further validated ETH’s turbulent movement, spotlighting an uncertain investor sentiment in the market. ETH Futures OI jumped 0.51% to $12.67 billion, while its derivatives volume dipped 30.71% to $21.15 billion. Notably, the RSI was recorded to be hovering at 40, underscoring that the asset is neither overbought nor oversold.\n\nHowever, it’s crucial to note that the current market sentiments could take a paradigm shift ahead with the approval of spot Ethereum ETFs. CoinGape Media recently reported that a whale bagged a staggering 16K ETH in light of the looming ETF.\n\nAltogether, broader market sentiments remain optimistic about Ethereum’s future price movements, although traders and investors currently exercise caution due to the highly volatile nature of the crypto realm.\n\nAlso Read: Solana ETF Approval Stands Strong: VanEck Exec\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMi0gFBVV95cUxOeUNIQjJJODBQX3hjN1hyMzV3ZVdyUFphWURGZkhDUEVsclNCaVBZbHpHRERrZDZKQ0xkUkdJcGJPcTFqanVEWk9vM1c1dGtEMFVYX3lrY2JTR251YXMxc2VJYWJ3YlNTZVkyRk5TSEdBSEQ4QzVmbldpdC1HTmJJQkRuSFFWUWlURVk0N3gtaHpScHpUNjRoT1l1Unk5RXFqY2V3OHozaGhlcWl3b2R6ZFVNd2hmWVhBeUo5OUpWelhCOU9zOUFxQVRGV3d2Sm5iUWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "The strengths and weaknesses of Ethereum according to Vitalik Buterin - The Cryptonomist",
        "content": "The co-founder and intellectual leader of Ethereum, Vitalik Buterin, recently shared his thoughts on the strengths and weaknesses of the blockchain during the EthCC (Ethereum Community Conference) held in Bruxelles.\n\nAddressing a packed room, Buterin offered an honest assessment of the current state of the platform, outlining both the challenges and opportunities that await Ethereum.\n\nThe strengths of Ethereum according to Vitalik Buterin\n\nButerin began his speech by highlighting the numerous strengths that have contributed to the success of Ethereum. One of the key aspects he pointed out is Ethereum’s ability to support complex smart contracts, which have enabled the creation of a vast ecosystem of decentralized applications (dApp). These applications range from decentralized financial services (DeFi) to non-fungible tokens (NFT), demonstrating the versatility and breadth of the Ethereum blockchain.\n\nFurthermore, Buterin spoke about the robust development of the Ethereum community. The platform is supported by a global community of developers, researchers, and enthusiasts who constantly contribute to the improvement and security of the network. This community not only develops new technologies and applications, but is also engaged in the governance of the network, ensuring that Ethereum remains a decentralized and democratic platform.\n\nAnother strength cited by Buterin is the transition to Ethereum 2.0, which represents a crucial shift from proof-of-work (PoW) to proof-of-stake (PoS). This change will not only significantly reduce the network’s energy consumption but also increase the scalability and security of the platform, making Ethereum more sustainable and capable of handling a larger number of transactions.\n\nThe weaknesses of Ethereum and the solutions\n\nDespite the numerous successes, Buterin has openly acknowledged the current weaknesses of Ethereum. One of the main problems is scalability. The Ethereum network has struggled to handle a high volume of transactions, resulting in high fees and long confirmation times. This problem has become particularly evident during periods of high demand, such as the bull of DeFi and NFTs.\n\nButerin also spoke about the challenges related to security. Despite the ongoing efforts to improve the security of the network, Ethereum remains vulnerable to various types of attacks, including smart contract exploits and network-level attacks. The complexity of the platform and the wide attack surface require constant vigilance and continuous innovations to maintain the security of the network.\n\nAnother area of weakness concerns usability. Buterin emphasized that, despite significant progress, the user experience on Ethereum remains complicated for non-experts. The setup of wallet, the management of private keys, and the interaction with dApps can be discouraging for new users, limiting the mainstream adoption of the technology.\n\nButerin concluded his speech by outlining strategies to “strengthen” Ethereum and overcome its weaknesses. The solution to scalability, he explained, lies in technologies such as shards and rollups. Shards will allow Ethereum to divide the workload among different parallel chains, significantly increasing the network’s capacity. Rollups, on the other hand, aggregate many transactions into a single one, reducing the amount of data that needs to be processed by the main network.\n\nRegarding security, Buterin emphasized the importance of continuous research and collaboration with security experts to develop new protection mechanisms. He also highlighted the importance of bug bounty programs and security audits to identify and fix vulnerabilities before they can be exploited.\n\nTo improve usability, Buterin has proposed a series of initiatives aimed at simplifying the user experience. These include the development of more intuitive interfaces, user education, and the implementation of safer and easier-to-use custody solutions.\n\nConclusion\n\nThe intervention of Vitalik Buterin at EthCC provided a clear and honest view of the current state of Ethereum, highlighting both its strengths and weaknesses. His reflection was a call to action for the Ethereum community, encouraging developers and users to collaborate to overcome challenges and continue to innovate. With the right strategies and a collective commitment, Ethereum is well positioned to strengthen its position as a leader in the world of blockchains and smart contracts."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxOdjRzRnYzMkoydEdxeDBVZ1kyY3RHbjdiQlBxTUljaERFeHBqUFRvZDU2cHp3SU5uVV9JcUdrMGNOTlIwZEc3eFlpdG9kMzZsb21WYWtmMzBSNkF1YXpSQXdlRGE2U0pVdUJRdExQNkRlTzEzZDkxU2pkMGd5OHoweVlLNEszN0RUai05cXI2Rk1xTE5pdHhUTnB3c040N3BPNDl2Mno3M0JKdEotVWd4S01HdEdVSzZFM2F1SFJ1WG9Id9IBxwFBVV95cUxPeVRkXzVPZ0l0VGkxaW5nLUdVeTN6Vkh5UWlHUXdjYjZpQlNEbVowdV9YbTdWLW1XQmNhQTUxNDZoeEcxWk1LZFJIMkpYZkZDMHlwa2pTbWtkQ0ZKVW9ENFJwRmg1QWZhQmM4NlZtQnRTcWZfSVJwcVZ3S0RJOG1XbG9xQ3RBS2JkUzBucGhvazJ6SVpRVk52U1NOVTJIcXRQeXFzOXljOHpFY01SY1lHdU92TWpiLXAzanFNYm54Tm9ELTd6N3lv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "Key dynamics to watch ahead of launch of Ethereum ETFs - FXStreet",
        "content": "Ethereum ETFs close to finish line, says Bitwise executive.\n\nEthereum investors are buying the dip despite FUD from potential Golem selling spree.\n\nEthereum bearish pressure has slowed, but key resistance could prove critical ahead of ETH ETF launch.\n\nEthereum (ETH) is up 2.3% on Wednesday as investors continue buying the dip in hopes of a rally following the launch of spot ETH ETFs. However, other key metrics like break-even prices and Golem sales provide a deeper understanding of what to expect as the launch draws nearer.\n\nDaily digest market movers: Ethereum accumulation, Golem sales\n\nWith the potential launch of spot ETH ETFs drawing closer amid the wider market stagnancy, investors are readjusting their portfolios. Bitwise chief compliance officer Katherine Dowling confirmed that the launch is \"close to the finish line.\"\n\n\"We're seeing in the S-1 amendments that there are fewer and fewer issues that are being vetted back and forth between issuers and the SEC,\" said Dowling in a Bloomberg interview.\n\n\"So that points all signs in the direction that we are close. We're close to the finish line on the launch,\" she added.\n\nThe Securities & Exchange Commission (SEC) approved spot ETH ETF issuers' 19b-4 filings in May, but the agency needs to greenlight their S-1s before the products can begin trading.\n\nEthereum's recent descent saw more investors accumulating the altcoin, as revealed in CryptoQuant's data. These investors are considering the dip as an opportunity to purchase ETH at a discount before ETH ETFs launch in tandem. The lower ETH goes, the more investors buy.\n\nETH New Accumulating Adresses Balance\n\nSantiment data shows that some of these purchases have been flowing into staking platforms. The Ethereum 2.0 staking contract now holds 47.36 million ETH or about 34% of ETH's entire supply. Notably, the contract's holdings have more than tripled from just under 11% of ETH's supply it held in 2022.\n\nETH2 Beacon Deposit Contract\n\nMeanwhile, Golem, which raised 820,000 ETH through an ICO in 2016, has been on a potential selling spree. After transferring 40,000 ETH to address \"0x159a\", the address deposited 3,000 ETH worth $9.3 million to Binance, Bitfinex and Coinbase in the past few hours, according to Lookonchain. Golem has deposited about 32,000 ETH to exchanges in the past six days.\n\nETH technical analysis: Ethereum faces a key resistance at $3,200\n\nEthereum is trading around $3,130 on Wednesday, up 2.3% on the day. ETH's total liquidations in the past 24 hours are at $33.58 million, with long and short liquidations accounting for $23.18 million and $10.40 million, respectively, according to data from Coinglass.\n\nETH's long and short ratio shows traders are slowly reducing their bearish sentiment as the ratio has increased to 0.989. However, Ethereum's Fear and Greed Index is at number 30, indicating fear persists in the market despite increasing accumulation from whale addresses.\n\nInto The Block's data shows that more than 5.6 million addresses broke even after ETH reached $3,000, a potential sell sign for these addresses.\n\nIt could be that whales bullish on the ETH ETF approval accumulated selling pressure from retail traders who potentially sold off their tokens after ETH reclaimed the $3,000 psychological level.\n\nAs ETH's price slowly tilts toward the upside, it may face a resistance at the $3,200 level. According to IntoTheBlock, approximately 2 million addresses that purchased ETH around this level could sell if they break even. However, a price catalyst like the ETH ETF going live can prevent such a move.\n\nETH/USDT 4-hour chart\n\nOn the downside, the $2,800 to $2,852 level remains a key support if the bearish pressure increases.In the short term, ETH could bounce off the $3,064 level, where $3.32 million ETH longs risk liquidation."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxNalpZOVc2Nk9DaHFqcGthZE1CYVBDWU0zOG1pOUQ3OTMzUDFDNW1qWlJPOU9XeUc2OUZQWGtOWnppOWRRMzVOZ2ZkLWc4YU9teTJ1OHM0YnJlSTFhX2FzMF8zUXk2MGZ6WW5FUDVCeXZZbXlYelZkSmhhTTBHSzlVUtIBhgFBVV95cUxNalhoUDliUFZET1B0UEQzMGFTaDIyZTdMbEJ6Y25HTk5BNXlPd3A2N2ZjS0oxMnlBN21lRThBTTZrR0hVTFF3WGg4dGY4OTZkSDFNWVhnYXlFTUtRNEREVjdEYkVKRWM1allyeU1rOGJOeGVfdWxDY2s2bUZSREliZHdBNVZiUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "Staking frenzy grips Ethereum: 33.9% of ETH now staked - AMBCrypto News",
        "content": "Interest in staking Ethereum surged significantly over the past few days.\n\nNetwork growth for ETH fell materially despite the surge in price.\n\nOver the last few days, Ethereum [ETH] has seen massive volatility in terms of price movement, which has impacted sentiment around the token significantly.\n\nInterest in Ethereum staking surged\n\nThe ETH2 Beacon Deposit Contract, the backbone for staking deposits in Ethereum 2.0, has reached a new peak, locking in a whopping 47.36 million ETH. This represents a significant chunk of the total supply, amounting to 33.9%.\n\nThe value is more than triple the amount staked just two years ago, which was only 10.9%. The surge in deposits indicates growing confidence in Ethereum 2.0 and its potential to revolutionize the Ethereum blockchain.\n\nWith a significant portion of ETH locked up in staking deposits, the circulating supply of ETH effectively decreases. This can lead to upward pressure on the price due to basic principles of supply and demand.\n\nMoreover, since staked ETH is locked up for a period of time, it’s less likely to be sold on the open market in the short term. This can help reduce downward pressure on the price, especially during periods of market volatility.\n\nDaily activity on the network fell\n\nHowever, despite the surge in ETH staking, the overall interest in the Ethereum ecosystem waned.\n\nAMBCrypto’s analysis of Santiment’s data revealed that the overall active addresses on the Ethereum network declined significantly over the past month.\n\nMoreover, this decline in activity coincided with the number of NFT trades occurring on the Ethereum network falling.\n\nThis suggests that despite the potential benefits of staking, fewer people are actively using the Ethereum network for other purposes.\n\nThis could be due to a number of factors, such as high gas fees, a lack of new applications, or a general bearish sentiment in the cryptocurrency market.\n\nAt press time, ETH was trading at $3,087.00 and its price had grown by 10.91% since the 10th of July. Despite the surge in price, the overall trend for ETH remained bearish.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nAdditionally, the network growth for ETH fell materially, indicating that new addresses were losing interest in ETH.\n\nCoupled with that, the velocity at which ETH was trading at had also fallen,, implying that the frequency at which ETH was being exchanged had declined."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxQdWM2NDFJMlh6Y25lREltcy0yQzVWV0VJZ2wxVVpsaEZOeGRhYkZ2aW9Tb2VvZy1DWUhESVhDbVVtRndacVFMMTNqYlJBLWRkLUVqelRUdGdWQ2g4am5PWmVqUXZvRVNqYzcwMFZvNm53dXg3enB4bDlaS2VZUEFJcWVKd2oteVhJdWtqRDZWVDc3a25DMTdXenk5S3BneTJLZkdhbjNjaVBoVFhoVTExczhCUVpTZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "Prices and forecasts on crypto Bitcoin (BTC), Ethereum (ETH), and Binance Coin (BNB) - The Cryptonomist",
        "content": "For some time now, there have been three cryptos dominating the markets, Bitcoin, Ethereum, and BNB: today we will analyze some predictions of their prices.\n\nBitcoin is the first ever to be created and the one that alone capitalizes more than half of the entire crypto market.\n\nThe second is Ethereum, which is the main altcoin that is often followed by all the others.\n\nThe third is BNB, the cryptocurrency of the main crypto exchange in the world (Binance).\n\nPerformance of BTC: which crypto is performing better among Bitcoin, Ethereum, and BNB?\n\nThe trend of the price of Bitcoin underwent a significant change a few days ago.\n\nFrom February 28 to July 3, 2024, for more than four consecutive months, it had effectively moved sideways within a wide range between $57,000 and $72,000, with small and brief excursions a bit above and a bit below.\n\nInstead, starting from July 2, it began a descent that on July 4 led it to break down the bottom of that range.\n\nTo tell the truth, already on July 7th it had returned above $57,000, but on July 4th the medium-term trend seems to have changed.\n\nIt is not yet clear if the new trend is descending, or if it is just a lowering of the bottom of the lateralization range.\n\nThe latest predictions on the price of Bitcoin (BTC)\n\nThe analysts do not agree with the forecasts, but what happened between yesterday and today seems to have definitively ended the decline that began on July 2.\n\nFrom $63,000 back then to $53,500 on July 5th, the drop was 15%, but it has already been partially absorbed. The current situation seems to have returned to perfect normality, so that drop seems to have completely run its course.\n\nHaving said that, there are no certainties that another one cannot be triggered.\n\nThere are several analysts who expect further similar declines in the coming weeks, so much so that some are hypothesizing a bottom at $52,000, $51,000, or even below $50,000. There are also many other even more pessimistic forecasts circulating, but they generally do not come from expert analysts.\n\nIt should be noted, however, that there are also many analysts who instead hypothesize only the beginning of a new phase of lateralization, simply within a lower range, whose bottom would be between $51,000 and $53,000, while the top is not yet clear (it could also be above $60,000).\n\nMany, however, expect a change in trend in the autumn, perhaps already anticipated at the beginning of September or the end of August. Among those who expect this change in trend, optimism seems to prevail.\n\nPerformance of Ethereum: the crypto between Bitcoin and BNB\n\nThe trend of the price of Ethereum has been following that of Bitcoin quite closely since the end of May.\n\nThis thing, however, appears anomalous, given that precisely between this week, or at the latest next week, the spot Ethereum ETFs should land on the US stock exchanges for the first time.\n\nThe upward movement of ETH’s price at the end of May was due precisely to the news of the approval of these ETFs, but since then it has simply started to follow those of BTC.\n\nComparing the price of Ethereum with that of Bitcoin, one realizes that in May ETH had risen from 0.046 BTC to 0.057 BTC, but then it stabilized.\n\nIndeed, in mid-June it had also fallen below 0.052 BTC, and now it is around 0.053 BTC.\n\nAt this moment, despite the imminent arrival of ETFs, the price of Ethereum does not seem to have the strength to move independently compared to that of Bitcoin, at least in the short term.\n\nPredictions on the price of Ethereum (ETH)\n\nAfter the actual launch on the stock exchange of spot ETH ETFs, many believe that the price of Ethereum could fall.\n\nObserving the chart of the last few weeks, it indeed seems that the markets do not believe that these new financial derivatives can achieve a great result, at least in the immediate future.\n\nFurthermore, there is always the risk that the Grayscale Ethereum Trust, once transformed into an ETF, may start liquidating large amounts of ETH, just as happened with BTC in January.\n\nBut if in the medium-short term many are not optimistic about the price of Ethereum, in the medium-long term the expectations change.\n\nIn fact, should Bitcoin wake up in the autumn, the presence of ETF on ETH spot on the US exchanges could benefit the price of Ethereum quite a bit.\n\nJust think that after the arrival of the spot Bitcoin ETFs the price of BTC rose from about $45,000 to over $70,000, after initially dropping below $40,000.\n\nThe trend of BNB\n\nThe trend of the price of BNB follows that of Bitcoin, and of Ethereum, but it also follows the alternating fortunes of Binance.\n\nTo tell the truth, for years now Binance has been the largest crypto exchange in the world, and its dominance seems to be unchallenged, but last year it had several problems with the authorities, especially in the USA.\n\nTaking Ethereum as a reference, the price of BNB last year fell below 0.1 ETH, after being above 0.26 ETH at the end of 2022.\n\nIn March of this year, however, it started to recover, first climbing to 0.17 ETH and then even above 0.20 ETH. Now it has returned to 0.17 ETH.\n\nTaking instead as a reference the US dollar, a month ago it recorded its all-time high, at around 717$. It should be noted that Bitcoin also recorded its new all-time high this year, in March, while Ethereum did not.\n\nSo during the course of 2024 BNB has performed better than ETH, so much so that it is now at +64% since the beginning of the year. However, it should be remembered that in 2023 it had not performed well, while both ETH and BTC had already recorded really interesting gains.\n\nPredictions on BNB and the Binance ecosystem\n\nMaking predictions about the price of BNB is more difficult, because much depends on the alternating fortunes of Binance.\n\nAlthough today it is possible to state that in the event of a new bull run Binance seems destined to perform well, and consequently BNB, last year, for example, it was very difficult to predict that Binance would solve all its problems, as it eventually did, allowing the price of BNB to take off again.\n\nIn this case, in fact, in addition to the simple movements of the market, and the law of supply and demand, the economic results of Binance also matter, which are not easily predictable."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxPb2hRNVA3b3BiSEtoUTNtaXZoTkpJd2NZdkVaMW1GQ1d2c2Z6LWZ2WXE1VmZwOVlORnlJMnBNVnNOck5rdGdMcG12YTRGRk01NElkbEp5cjV0d29heTlqTzlFeFJSN0ltZnpLLXUwZDR1TDBuN0NQU2hodE5lN1NYUERBM3A2b0xORzRlcVRmRQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "Bitwise Says SEC is Open to Solana ETF After Ethereum Launch - Watcher Guru",
        "content": "Cryptocurrency asset management firm Bitwise has recently said that the US Securities and Exchange Commission (SEC) is open to a Spot Solana ETF after the previously approved Ethereum iteration launches. Indeed, the ETH investment product is expected to begin trading in the next week.\n\nSpeaking to Bloomberg, the firm’s CCO Katherine Downing noted that the agency appears “quite welcoming” to the idea of other crypto-based ETFs. Additionally, Downing said that the Ether ETF is “close to the finish line.” Many issuers have already filed the amended S-1 forms this week.\n\nAlso Read: Ethereum ETF: Expert Predicts Official Launch in Next Two Weeks\n\nSolana ETF in the Works After ETH Debuts?\n\nBitwise’s Downing discussed the potential for investment products like a Solana ETF amid the ongoing Ethereum process in the recent interview. She noted that issuers have “dialogue with the SEC about the possibility of what’s coming down the pike with new products.”\n\nHowever, Downing did note that those products “may have to wait on a new SEC chair,” if Gary Gensler is removed in January of this year. She maintained that he could get in the way. Specifically, Downing noted Gensler’s involvement creates a “long haul” to get products to market. Especially given his history with the industry.\n\nAlso Read: Solana Mirroring 2021 Bull Run Pattern: New All-Time High Soon?\n\nStill, Downign described the agency’s response to talk regarding more products as “quite welcoming.” That certainly increases the odds of a Solana-based ETF. Applications for such an investment product have already been filed by asset managers like VanEck.\n\nEarlier this month, GSR Markets released a report on the potential product. There, they noted SOL has “cemented itself as part of Crypto’s Big Three.” Therefore, it is only natural it follows ETH and BTC with the next crypto-based ETF. Yet, the question now is when. With two approvals in 2024 already, many expect a Solana ETF to not be viable until 2025."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMi0AFBVV95cUxNTDdKMXNacXlLY0RwWnZQZEVMZDUtQ1FPN1BHRW5MUC1RN09ZdFg2a1lZNWZPNVJxWGIzTFdHSHdsNXB1OE1XYXFEV19HdXA4bHZDZWRIdXh2eW44OHJ5bWJoaV9PNXBVWW1vQWhxQmNtQ084V1RLQ09lcjdxS0pzTm9CcDRZbEdXRVB3V0FnTWwweGo0WlJ3TExXTDc4WWJnZV9lUWtndEZMS19mc1lDcm5rMHNZS0dLY1N3Y1JsaHp4TDVVRkZLemdQNW8tQ0lr0gHWAUFVX3lxTE5sbjVWNXBINjhpTVdDN3AtQTg4Y3l2UVl5SVI2dEtEN09Fc3paS19EYldtTWlNS2JFS2hhLU85S0NXRG1WT01CSUs5QXhUQUpKSGs4YTdpaHFDQnhsQll5NFBtbGtPRlVBWVZPMlZIVHVOY0JEcTF3bmhrY291MnVpUHhzR2hlcGtQWkQ2MGdrT3dfTVA1QnU5OVI5WllIM1dtZ3Vzemh6bzVuNjR5RzlRbnNvTzlod0JmWm5wNG5Wbnd6UDhuNXhCemtQdjJMcVEwb0FGdWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jul 2024 07:00:00 GMT",
        "title": "Trader Says Ethereum Rival To Perform Well Over Coming Months, Updates Outlook on Bitcoin and Celestia - The Daily Hodl",
        "content": "A popular crypto trader thinks one Ethereum (ETH) rival is primed to perform well over the coming months.\n\nThe pseudonymous analyst known as Altcoin Sherpa tells his 217,800 followers on the social media platform X that he’s “pretty neutral” on Solana (SOL) over the short term but more optimistic on the asset as 2024 winds down.\n\n“I still believe $120-170 is a decent region to accumulate SOL overall, and I think this still does pretty well in the second part of the year. Not really expecting this one to move until the overall market environment improves though.”\n\nSOL is trading at $140.87 at time of writing. The 5th-ranked crypto asset by market cap is down more than 1% in the past 24 hours.\n\nAltcoin Sherpa also shares his prediction on Bitcoin (BTC).\n\n“Expecting a few days of green, after that, I have no clue. Next week should be pretty telling if we’re headed back within the range or not. Short-term bullish but mid-term, no clue.”\n\nBTC is trading at $57,519 at time of writing and is down more than 1% in the past 24 hours.\n\nThe analyst also says he plans to watch the native asset of the modular blockchain network Celestia (TIA) for a potential bull flag.\n\n“Modular is back and sexy. I’m looking to buy TIA at $6.00 or a bit lower. Let’s see if/when it comes.”\n\nBull flags, as the name suggests, are typically seen as bullish technical setups that imply an upward impulse and then a brief consolidation before another move up.\n\nTIA is trading at $6.82 at time of writing. The 66th-ranked crypto asset by market cap is down more than 3.5% in the past 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxQdS1FWXpZMzJEX2JtX1FxSVd2Nm4ybFF2Ym1vU0dJd3BhaDVCS3JxZmFNcmtRRlVXbDhaX2tqTGhwRGxBLW9qYnIwVlc4T0NpUmVXWlMwZ00zRl9lT1poSkZ0cEZ3dmFWMmgzUmZ6dGI2cTh1SGJYRVhXb2dmd2ExQzF30gGHAUFVX3lxTFBSYjQzck1kdjhBQi1NZV9JOFAySGxIRkItT091RjVtNmFKQjBkazg0T0RjaXBtYkZCaTZrVnZjbE5DRkQ5dzh2SGx3b2ZOUndmTE85ZHpwM3FvLTJPdmNnbUFadm9NUG1sNFgwYmU1Q2R2ZnhxZWd1d1ZQVHI2UXRYN1RFOE1Ncw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jul 2024 07:00:00 GMT",
        "title": "Justin Sun Buys $5 Million In ETH Ahead of Ethereum ETF Approval - CoinGape",
        "content": "Amid the current market volatility, the Ethereum (ETH) price is showing strength and holding steady around $3070 levels. There’s a massive whale activity currently happening around Ethereum, with Tron founder Justin Sun trying to absorb all the selling pressure before the upcoming approval of spot Ethereum ETF, scheduled within the next two weeks.\n\nJustin Buys Ethereum in Huge Quantity\n\nAs per on-chain data provider Spot on Chain, Tron founder Justin Sun spent a total of $5 million USDT in order to acquire 1,614 ETH at a price of $3,097 per token.\n\nadvertisement\n\nSun has been on an Ethereum accumulation spree since the beginning of the year. Spot on Chain reports that since February 8, Justin Sun has reportedly accumulated a total of 362,751 ETH across three different wallets, for an estimated total investment of $1.1 billion, and an average price of $3,047 per ETH.\n\nAlong with these purchases, Spot on Chain also noted that Sun recently deposited 45 million USDT to Binance, suggesting the possibility of future Ethereum acquisitions.\n\n12 hours ago, Justin Sun (@justinsuntron) allegedly spent 5M $USDT to buy 1,614 $ETH at ~$3,097. Since Feb 8, Justin Sun might have bought 362,751 $ETH (est. cost: $1.11B) at ~$3,047 via 3 wallets (more details in previous posts 👇). Note that he also deposited 45M $USDT to… https://t.co/xeW1usR3MJ pic.twitter.com/aJ4zhXFas2 — Spot On Chain (@spotonchain) July 11, 2024\n\nInterestingly, the ETH whale accumulation has been happening just ahead of the spot Ether ETF approval, likely to happen before the end of July.\n\nAlso Read: Justin Sun Confirms Development Of Gas-Free Stablecoin Solution\n\nEthereum Whale Activity Jumps\n\nWhile Justin Sun has been picking up Ethereum from the exchanges, there have also been huge ETH deposits taking place recently. In the last 24 hours, the Golem Project was one of the major depositors of ETH to crypto exchange Binance. However, on-chain data shows that they have reportedly stopped selling ETH, while simultaneously staking a total of 40,000 ETH.\n\nMoreover, Elwood Technologies has also deposited 26,811 ETH worth over $84 million to crypto exchange Binance in the last three days. However, some of the Elwood-related addresses also withdrew 24,463 ETH from Binance during the same time.\n\nAs of now, the ETH price is holding firmly above $3,000 despite this massive whale activity. Technical indicators suggest that the Ethereum bottom could already be in.\n\n$ETH – Thought we were gonna bounce at the first support (red line) but that broke. The good news is this support is looking much stronger and that’s a much better response. I’m hoping that was the low of Q3. pic.twitter.com/GzitxuQN8i — IncomeSharks (@IncomeSharks) July 10, 2024\n\nAlso Read: Ethereum Investors Are Ready To Sell ETH As It Hits $3.2K\n\nBhushan Akolkar Bhushan is a FinTech enthusiast with a keen understanding of financial markets. His interest in economics and finance has led him to focus on emerging Blockchain technology and cryptocurrency markets. He is committed to continuous learning and stays motivated by sharing the knowledge he acquires. In his free time, Bhushan enjoys reading thriller fiction novels and occasionally explores his culinary skills.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxOUDhBNW1lUEhGZUhLNTRiQVE4YjlNOFJldkYwQWVDM3B6REFCWWh0eEZ6VEkzc3hnOExKRmU5cjNpYTVmbGd3bkdyMHJELUktZEdrcmh3MktPaDNZRkN2cEYyMXRtaHNNdHZleEZNeWJibWlsRC1zYjMyTlo2SzJ4Zmc0NXBqOWVNVTFyTNIBkgFBVV95cUxQOW9uU2taS2FvTG8zSFBYUGs1ZlpRTm1lVFEtOHJVdWJpem1MeUtlNGlLSVJJbl9NTjNpMndRcnlrUVRMT1pTaXREX3U2Wm9LYnAwc3dsNVdJSy10RGpZbHQzOVY3cGw5TUh6RW96OUtkaWMybnF1RVBnajk4blVMS3UyZUliSmZtU1ZVUDczeEduZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETFs ‘close to the finish line,’ celebrates Bitwise CCO - AMBCrypto News",
        "content": "The launch of Ethereum ETFs remained uncertain despite Gensler’s summer prediction.\n\nSEC’s cautious crypto stance contrasted with the Bitcoin ETF approval under Gensler.\n\nAmid mounting anticipation, the upcoming launch of a spot Ethereum [ETH] exchange-traded fund [ETF] has garnered significant attention.\n\n\n\nRemarking on the same, Katherine Dowling, Bitwise’s chief compliance officer, emphasized the uncertainty surrounding the exact launch date.\n\nBitwise CCO on ETH ETF\n\nDespite SEC Chair Gary Gensler predicting a summer debut for the ETH ETF, Dowling in a recent conversation with Bloomberg, said,\n\n“We’re seeing in the S-1 amendments that there are fewer and fewer issues that are being vetted back and forth between issuers and the SEC.”\n\nShe further added,\n\n“So that points all signs in the direction that we are close. We’re close to the finish line on the launch.”\n\nTime for a crypto-friendly SEC admin?\n\nThis is quite surprising because Bitwise was one of the first issuers to take proactive steps by submitting an amended S-1 form to the SEC ahead of schedule, on 8th July.\n\nThis move had back then sparked excitement within the crypto community about the imminent approval of the ETH ETF.\n\nHence, the delay and uncertainty in approval highlight the SEC’s cautious stance on crypto during the Biden administration.\n\nExpanding on the topic, Eric Balchunas, Senior ETF Analyst at Bloomberg, put it well when he said,\n\n“Looks like Solana ETFs are going to have a final deadline of mid-March 2025. But between now and then the most imp date is in November. If Biden wins, these likely DOA. If Trump wins, anything poss.”\n\nReiterating the same, Dowling added,\n\n“I think it’s going to be a really long haul to get some of these products out in the market, given the history we’ve had with getting these products to market and the fact of not having futures trading in some of these potential products.”\n\nNot all bad things!\n\nHowever, she also highlighted the SEC’s potential for positivity during the ETF approval process when she said,\n\n“But it’s an act of dialogue and I think our communication with the SEC about the prospects for these products has actually been quite welcoming.\n\nThis is important because, despite the SEC’s historical lack of interest in crypto, the current leadership under Gensler approved a decade-long-awaited Bitcoin [BTC] ETF.\n\nNeedless to say, the performance of the BTC ETF has been phenomenal since its debut on the 11th of January. As of the latest update on the 9th of July, the BTC ETF recorded inflows totaling $216.4 million as per Farside Investors."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxQWXRJM3RQNDV6a294Mmg2QlhvTlAxRXJFeTdMVzBVTU4zMHVzR3VnRXFtbi1lNmZDbUs2c0dmWnlzZksxZFJXSllhSlJmMUp1UkQwbTZEbTB1R3g3QUdJS0JQOTdyYkVSbmgxYmJwSXFZV3JpRnd3RE5RV1owR25LUnhn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "Crypto : Ethereum au bord du gouffre ? - Cointribune EN",
        "content": "Wed 10 Jul 2024 ▪ 3 min read ▪ by Luc Jose A.\n\nAs Ethereum is not far from the critical zone of $3,200, sell signals are multiplying among investors. This resistance, combined with expectations regarding the launch of an ETF on Ether, creates a tense and uncertain market climate. The current volatility could have major consequences for the future of the second-largest cryptocurrency.\n\nEthereum facing resistance at $3,200\n\nEthereum, the second-largest crypto by market capitalization, recently crossed the $3,000 mark, but it encounters major resistance at $3,200. This price barrier is critical, on-chain data shows that about 2 million addresses that bought Ethereum around this level are currently at a loss. These investors might choose to sell their cryptos to recover their initial investments, increasing the selling pressure on the market.\n\nHowever, the imminent launch of an ETF (Exchange-Traded Product) on Ether could change the game. This event is likely to inject new capital into the market, counterbalancing the selling pressure and generating a positive momentum for prices. Despite everything, Ethereum struggles to break through the $3,200 resistance, illustrating the current fragility of its position.\n\nMarket sentiments and projections\n\nDespite the optimism surrounding the launch of the ETF on Ether, the price of Ethereum remains unstable. Currently, ETH is oscillating around $3,100, with recent fluctuations indicating uncertainty among investors. Data from Coinglass shows a slight increase in Open Interest in ETH futures, reaching $12.67 billion, while the derivatives volume has dropped significantly. This combination highlights a sense of caution and expectation in the market.\n\nThe Relative Strength Index (RSI) of Ethereum, currently at 40, indicates that the asset is neither overbought nor oversold, marking a neutral position that could shift either way. The situation is worsened by large purchases, such as the recent acquisition of 16,000 ETH by a whale, showing that some investors are anticipating a rise due to the ETF.\n\nThe short-term outlook for Ethereum is thus marked by high volatility and persistent uncertainty. The selling pressure at $3,200 remains a major obstacle, but the launch of the ETF will undoubtedly bring a capital influx that will change the game.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxPTlQyNWUwUUtQUEtWMDVSeEtfd2twMjVyTXhkSHFZbzJMaGJHWnhnZU1fMDhoeFRZcFV3ZFRXVmt1VXd5UFNTbl9sbUZ0dHNfeFVNNW9iSzN2aEtiUlZ3azh1SkFmQXpQMW5QWkZUQ09ENHFoRHdCeXFDSzVxZTF3LXdvdVh0S3lmTU5vbDhJT1pHNW9oNmZNWnE1MjfSAaoBQVVfeXFMTnZQNE9WdDBWbDVhYmFJb1luTi1uV0pabTVEaDVNWGVkTlNQY19oWDJKaUplZ2JuRWFuUmN4bTV2MzdXeFltYzI2dlNWOVdPZW8zQ1RKd1VNbl84VEJDMXhRRWZmblkxeFd3MjBBdVROTm1mYk1jUXlIM0FwdXZrRGE5Q1VvOTNEdkRneEhkZDIzLVJXNVVNMnA5Q09BamZmTDllcWlwR1lKS2c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Code Review 2024 – Is It A Legit Trading Platform? - Outlook India",
        "content": "What is Ethereum Code?\n\nEthereum Code is an online trading and educational platform that offers a wide range of trading and learning perks. It has been created to assist users with various needs and delivers reliable information and trading sources to begin with.\n\nThe user-friendliness of Ethereum Code allows users to get a personalized experience that can be achieved by customizing the dashboard easily. Moreover, the platform features comprehensive learning resources that can be used for upskilling trading techniques by users of all kinds. It features:\n\nAccess to the crypto market for trading needs\n\nHigh-end trading tools for accurate trading\n\nRisk assessment and tips\n\nEducational resources for learning needs\n\nPersonalized organizational dashboard\n\nHow Does Ethereum Code Work?\n\nOne of the best things about Ethereum Code is that it operates as a bridge between users, trading brokers, and educational companies. It allows users to access market insights for trading while learning from reputed educational sources.\n\nExplore Ethereum Code’s Official Website\n\nUnlike other trading sources, it uses high-end and sophisticated trading bots that assist traders in their journey. In addition, it carefully sources educational materials so that traders can benefit from what they learn and implement it practically.\n\nWhile trading, it analyzes the preferences of the users and finds opportunities in the market accordingly. Hence, it's like a trading assistant that you can assign a task and let it handle the rest. All you have to do is sign up, check out the opportunities waiting for you, and trade to earn the benefit.\n\nFeatures of Ethereum Code\n\nLet’s check out some appealing features of Ethereum Code:\n\nPersonalized Platform Experience\n\nAn attractive thing about Ethereum Code is that it allows users to customize their dashboard according to their preferences. This feature is usually limited in other platforms where you can only add limited resources to your dashboard.\n\nHowever, with Ethereum Code, you can easily add resources from educational to trading and tools on your dashboard. This kind of personalization makes navigation easy and the interface clean, giving the user good control over what they want to interact with.\n\nSupports Different Cryptocurrencies\n\nWhile working with any trading platform, users need to consider the kind of currencies it supports and allows trading with. Fortunately, the Ethereum Code allows trading in various currencies, including but not limited to Ether, Shiba, etc. as well as mixing these currencies for trading needs.\n\nHigh Success Rate\n\nSuccess rate matters a lot when choosing a trading platform. Success rate defines the rate of positive trading returns based on the insights the trading bots share. If the success rate is low, then you shouldn’t be bothering with the platform at all.\n\nFortunately, with Ethereum Code, you can rest easy as it offers more than a 95% success rate. Although this rate is claimed, it's not entirely true and can vary based on the trading processes used by the traders.\n\nHowever, the platform creators still state that the platform features a high success rate, which makes it a compelling choice for a trading platform to begin with. Again, it's strongly recommended that the users adopt only legitimate ways of trading and investing only the amount that they can risk losing while working with a broker for risky trades.\n\nEasy Withdrawals\n\nWhile using most market platforms, it was discovered that the users had a hard time withdrawing their invested money. Moreover, it was also identified that users faced difficulties while trying to withdraw their profits. But thankfully, Ethereum Code facilitates the users in this matter.\n\nIt not only allows the users to withdraw their profits or transfer them to other sources but also withdraw their entire capital to close the account or for any other reason. After proper authentication, customer support assists the users in proceeding with their withdrawals, which are usually processed in 48 hours.\n\nDemo Account\n\nWhile it features numerous learning resources to begin your trading journey with, it also facilitates the users with practical trading through a demo account. The demo account is formed just to give a hands-on experience to the users of how the platform and trading with it works.\n\nIn other words, the demo account is filled with the exact features and tools that one can find in the real-time account except it features demo money. Hence, the users can trade without the fear of losing their investment.\n\nOnce the users have experienced trading, they can easily switch to the real account and start trading. The demo account is always available for the users whenever they want to switch and strengthen their learning or test various trading techniques.\n\nRobust Customer Service\n\nCustomer service plays an important part in the functionality of any trading platform. From entertaining the queries to resolving the issues, it has to be readily available so that the users can reach out to it in times of distress.\n\nFortunately, Ethereum Code features such robust customer service that is available to the users 24/7. Whether it’s an issue with withdrawals, payments, etc. or you want to know how to get started with Ethereum Code, the customer service will entertain your queries and will assist with everything.\n\nCatalog of Useful Educational Resources\n\nAs it’s an investment learning platform, Ethereum Code features numerous educational resources. These resources are carefully sourced so that they can entertain queries related to trading, eventually helping the users strengthen their concepts.\n\nMoreover, some of these resources are free to access and easily available when you sign up for the platform. As for others, these carry a small fee since they offer certifications and can help you earn a reputation as a well-versed and certified trading expert.\n\nHowever, it’s a small fee to pay for such an organized and useful catalog of educational sources, which is why Ethereum Code is reliable enough.\n\nHigh-End Security\n\nWhen it comes to choosing a trading platform, you cannot overlook the level of security and safety the platform has to offer. Crypto trading platforms hold sensitive information regarding payment methods as well as user profiles. Hence, it's only evident that this information is secured with high-end measures.\n\nThankfully, Ethereum Code ensures that its platform, the data, and the users are protected at all costs. It uses strong encryptions and two-factor authentication methods to guarantee only legitimate users are accessing the platform.\n\nSome Downsides to Ethereum Code\n\nEven though the platform offers a series of compelling perks and features, to begin with, it still has some downsides that the users should be aware of:\n\nLack of an App\n\nSimply put, there isn't any Ethereum Code app; however, the creators are vigorously working on creating and launching one.\n\nAvailability Issues\n\nEven though Ethereum Code is available to users in countries such as Germany, China, the UK, etc. it's not available to users in the US. Hence, in order to access Ethereum Code in the US, you'd need to use a VPN. However, VPN use isn't recommended for high-end trading since internet fluctuations can cause errors in the reports and insights fetched by the platform, causing losses.\n\nHow to Get Started with Ethereum Code?\n\nNow that we’ve gone through what Ethereum Code is, how it operates, and its features, it’s time to let you know how you can join and get started with it. Check out the process below:\n\nSigning Up\n\nThe first step is signing up with Ethereum Code. You need to visit the official website of Ethereum Code and click on register or sign up to create your account. Once you do, you’ll be directed to a form where you’d need to input your contact information including username, email, contact information, etc.\n\nExplore Ethereum Code’s Official Website\n\nConnecting with an Expert\n\nOnce you input your details, you’ve officially created your user account. Shortly afterward, you’ll receive an email on your provided address, indicating that you need to verify your account.\n\nOnce you do, you’ll connect with a customer service representative that will ask some basic questions. These questions will include your investment and trading goals, risk approaches, and other metrics.\n\nThe representatives will ask these so that they can customize your dashboard layout as well as feature relevant educational materials for you to begin with.\n\nInitial Deposit\n\nAfter connecting with an expert and sharing your trading requirements, you'll be directed to a payment form where you need to share your payment details. This will be used for depositing your initial capital of $250.\n\nThis amount is required to complete your registration as a legit user as well as provide initial capital that you can use later for trading. In addition, you can also add more funds to this capital amount and use it later instead of re-depositing the amount again.\n\nChoosing Your Account Type\n\nFollowing the submission of your investment capital, you’ll be directed to the page where you need to choose the account that you need to begin with. This includes the demo account that we mentioned earlier.\n\nIf you're a beginner or even a professional who wants to begin your journey experiencing the platform, then you can choose the demo account right away. Once you've done getting hands-on experience, you can switch to your manual account easily.\n\nHave Celebrities Endorsed the Ethereum Code?\n\nAs far as our Ethereum Code review shows, the platform hasn't been endorsed by any celebrities. Hence, it's safe to say that any website claiming that Elon Musk or Jeff Bezos supports the Ethereum Code is false and users should abstain from following such sources.\n\nMoreover, it’s also recommended that the users only follow the news sources provided by the platform itself instead of following any other material online. Ethereum Code has a community page as well where it shares recent updates in the market as well as news about the platform.\n\nIn any case of collaboration or official launches, users can easily refer to this page or reach out to customer service to know the details.\n\nIs There a Dedicated Ethereum Code App?\n\nUnfortunately, there is no Ethereum Code app in the market and the creators are working diligently to create and launch one. Hence, Ethereum Code is under work; however, it's recommended that users not trust any such apps available on the market since they are not legit.\n\nThe platform creators have clearly shared that any such applications are not legit and they don't take any responsibility for losses or scams occurring through these apps. It's only recommended that users stick with the official website of Ethereum Code for updates on its app launch.\n\nIs Ethereum Code Legit?\n\nPerhaps one of the reasons why the Ethereum Code is quite recommended for traders is that it operates as an investment educational platform. It not only allows traders to invest and trade cryptocurrency but also allows them to learn from its numerous educational resources.\n\nThe availability of online resources, robust customer service, and amazing workability and design allow Ethereum Code to feature competitive trading perks for users. Hence, it's well-equipped to offer risk assessment and trading expertise, giving better insights into trading even on other platforms.\n\nFinal Thoughts\n\nEthereum Code is a legit platform that has a trading success rate while offering great means for users to learn more about trading. The customer service is readily available to assist with all matters and the high-end security measures make it quite compelling to be chosen for a trading platform."
    },
    {
        "id": 71,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxOY0lVaDRackxuUlhLYjZnbzJyRmJCLTkyeExSb3JobzBDVzZBUzlseDlaRmh4Sm1sSXByWU4tOVRFVFdPMHpHY2pYeTIyM01WdGdmTDY5N0xRSFkzM3NZNzMwTlpMQUt5N055azJRMTFlQjdpb1ZybWwtdktPdjhnSGZwLVAtMkNobHVUbnljbllydTl1T0NMMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "Ethereum co-founder Vitalik Buterin visits Waterloo - University of Waterloo",
        "content": "On Saturday, July 6, nearly two hundred students gathered for an ask-me-anything event with Vitalik Buterin, the co-creator of the Ethereum blockchain and a former University of Waterloo student.\n\nButerin studied computer science at Waterloo and worked as a research assistant for cryptographer and computer science professor Ian Goldberg. In 2013 he wrote a white paper proposing Ethereum. Buterin was awarded a $100,000 USD grant from the Thiel Fellowship in 2014 and subsequently left Waterloo to work on Ethereum full-time. Today, Ethereum is second only to Bitcoin in market value.\n\nIn his talk, Buterin discussed the math behind the blockchain, areas for innovation and the future of cryptocurrency. “Will crypto become the Esperanto of finance, the Linux of finance or the Internet of finance?” he asked rhetorically. “I think it depends — there are a lot of countries, particularly in the developing world, where there is a lot of demand for cryptocurrency because the traditional banking system is not effective.”\n\nButerin also distinguished between early-stage technologies (like cryptocurrency, AI and space travel) and later-stage technologies (like the pharmaceutical industry), arguing that early-stage technologies are an ideal space for ambitious thinking, innovation and employing pure math, engineering and science. “There’s a real focus right now on building amazing things,” he said.\n\n“We are incredibly lucky to have Vitalik come into town to talk about Ethereum and its future roadmap,” said systems design engineering master’s student Monica Tsang. “He encouraged us to work on the optimistic, idealistic side of blockchain development instead of chasing quick money. Being a jack-of-all trades will help us learn new knowledge fast in this quickly changing blockchain space!”\n\nButerin emphasized the importance of shared values in technological ventures, both for practical reasons and for ethical ones. “Make sure you and your co-founders are aligned on values, both in terms of what you want to achieve in the world and also what you want to get out of the project,” he said. “Consider what kind of relationship you want to have with each other, with your investors, with your users and with your community.”\n\nButerin’s talk was the finale of a four-day workshop series, “Solidity 101 Bootcamp,” sponsored by De University of Ethereum, VentureMiner and the Faculty of Mathematics. The bootcamp was billed as a comprehensive educational program designed to empower the next generation of blockchain developers.\n\n“It was such a thrill hosting Vitalik Buterin,” said Stephanie Whitney, director for Research & Innovation Partnerships in the Math Innovation Office. “The audience was blown away by how thoughtfully he outlined avenues for contributing to the blockchain ecosystem. We can’t thank him and the Ethereum Foundation enough for this amazing opportunity.”\n\nYou can learn more about Ethereum on the Ethereum Foundation website. You can learn more about the Math Innovation’s Entrepreneurship and Impact Series, including future visitors, on the Math Innovation Website."
    },
    {
        "id": 72,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxPMjJrZDRpTDVMcmY4RHY5VXpXbDZmWm0zTkZJejJwbk13RzVMSDdCazI2WktUZnNSWEJhMnYwMWVmTlBEaE04VGdNanliWWFxdzlfaUVyX0cyZW8xMkM4a1hwZlI5STV2R0llNnhjaHYwYzNRdGdFd3RXS0ZqUFBMYTBQTWdrQXhLQ2hoeXhCdGNRaS1DdW9xV1ZDZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "Vitalik Buterin Goes In-Depth on Ethereum and How to Make it Stronger - Watcher Guru",
        "content": "One of the creators of the largest smart contracts blockchain, Vitalik Buterin took the stage at the Ethereum Community Conference (EthCC) to discuss the network, its strengths, weaknesses, and how to make it even better. At the Brussel’s event, Buterin noted the strides the blockchain has taken, but what work lies ahead to optimize its offerings to a growing user base.\n\nThe keynote speech, to a room of more than 1,000 onlookers, covered a variety of topics. Among them was Buterin’s concerns regarding transaction censorship. Moreover, the co-founder revealed a unique proposal to those in attendance that would have a massive impact on the overarching issue.\n\nSource – Watcher Guru\n\nAlso Read: Ethereum: Vitalik Buterin Wants to Redesign the Network\n\nButerin Talks Ethereum’s Strengths, Weaknesses, and ‘Hardening’ The Network\n\nIt's time! It's time! @VitalikButerin is speaking right now in the Gold Hall 🥳\n\n\n\nWe have a full house of eager beavers ready to hear his keynote 🦫✨\n\n\n\nIf you can't find a seat, please check out the streams in the Silver and Copper Halls 🫶 pic.twitter.com/e9xpRFy29s July 10, 2024\n\nThe network’s co-founder, Vitalik Buterin, recently spoke on Ethereum at a keynote talk. There, he expressed his belief that Ethereum thrives as a “large and reasonably decentralized staking ecosystem.”\n\nThis proved to be its greatest strength, according to Buterin. Moreover, it is supported by a growing community that is both international and highly intelligent. Yet, there is still room to make it better. The co-founder noted that solo staking is still very difficult. Currenlty, the process requires 32 ETH to become a validator, while running a node is increasingly complicated.\n\nHowever, Buterin did note that these issues, “are very addressable.” Specifically, he discussed various improvements that would allow for a simplified protocol. “So if you want a robust ecosystem, it needs to be simple,” he said. “It should not have these, like, 73 random hooks and some kind of backward compatibility,” just because it was created by Vitalik himself.\n\nSource: CoinDesk\n\nAlso Read: Ethereum ETF: Expert Predicts Official Launch in Next Two Weeks\n\nHe also voiced his worry about the 51% attacks on the blockchain. However, he noted a solution isn’t all that simple. Buterin said it “depends on a lot of assumptions around coordination, ideology, and various other things, and it’s not clear how to do something like that as well in 10 years.”\n\nButerin did share a proposal with attendees. He noted the difficulty in recovering from attacks when the chain finalizes. Therefore, he proposed increasing the quorum threshold from 75% to 80% to prevent that.\n\nIn the end, the Ethereum leader noted a clear path forward for the newor. “I think there’s value in really doubling down on these strengths and at the same time, recognizing and fixing our inadequacies and making sure that we actually live up to our very high standards.”"
    },
    {
        "id": 73,
        "url": "https://news.google.com/rss/articles/CBMi_AFBVV95cUxPR0M2WTB5d2J0SEthNkg5Ymg3eS1vVWx5ZXlqdDN0RVdCNDI2WVZnc2Fab2ViZHFZaWhRa0JRTU9wMmlySlp4a1lrQUlJYnhDUTVRNGlyRVlCLWVGVmw5QlN0UnZhTFZCN2VVUDRvYzRwN1NSNFRoenlHRzJuajZuRm54Qkw0eVAwQVJhVUlDVE1CV0k0TzJSQ1VfZUtIN1NzX0ZVcWxOS29rVWZxcm9jeHNpNlVDZk1MTndJd19LeG1USnFGQ1hCclVsRlBMWWlPUWtEdzd3aTJMN182VHpxVy1kSmkzMFdoMU9QeklTX3NJSV84VnNhQWxpV3M?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jul 2024 07:00:00 GMT",
        "title": "Cryptocurrency Crash: Ethereum Down 15% This Week, MATIC Heading Towards 30 Cents, Investors Hedge With Rollblock As Price Soon To Jump - Techpoint Africa",
        "content": "With crypto markets in a serious slump the Ethereum ecosystem is grinding out new support levels. After a legendary run up from 2019-2021, the price of Ether ($ETH) has underperformed Bitcoin and most other majors. Investors are left wondering where the edge is today.\n\n\n\nL2 networks on Ethereum have led the slide downwards over the past weeks, with Polygon ($MATIC) settling last week at levels not seen since the bear market in 2022. With more losses expected in July, keen investors are turning to new protocols such as Rollblock ($RBLK) which is defying market conditions after raising more than $1Million and generating gains in excess of 55%!\n\nEthereum ($Eth) Struggles To Maintain Price Parity With Bitcoin\n\nDespite continued development of features and the switch to the ESG friendly Proof-of-Stake protocol, Ethereum ($ETH) has failed to keep pace with Bitcoin. It’s continued to underperform even with an upcoming ETF approval in the pipeline, slipping under the $3000 mark routinely over the past week.\n\n\n\nNew major networks such as Solana and The Open Network attract retail investors, while institutions continue to favor the stability and trust of the Bitcoin network. There appears to be no love for the middle as the jack-of-all trades Ethereum misses the mark with both speculators and long term capital allocation.\n\nPolygon ($Matic) Fails To Attract New Investors\n\nPolygon ($MATIC) blockchain was the first network built on top of Ethereum ($ETH). Designed to enable cheaper and faster transactions while maintaining the security of the base network, Polygon initially attracted investors looking for $ETH beta. This thesis has not played out the way they anticipated, with dozens of rollup networks now built on top of Ethereum, Polygon is struggling to remain relevant.\n\n\n\nPolygon has also failed to keep investor money on the protocol. With less than $1 billion of funds on the network after reaching a high of over $10 billion in 2021, the Polygon network appears to be largely forgotten by keen speculators. With a price of just 50 cents at the time of writing, Polygon is down over 80% from its bull market highs.\n\nRollblock ($RBLK) Soars Amid Market Declines\n\nHaving crossed the million-dollar mark in less than two months, Rollblock is becoming one of the markets most popular crypto presales. This highly lucrative project combines the best of DeFi innovations with traditional betting, offering a comprehensive experience not available elsewhere. The project uses blockchain and AI to offer greater security than traditional casinos, making it impossible to change bets once placed while recording all transactions on the blockchain.\n\nThe casino itself hosts over 150 games, including classics like roulette and slots, as well as digital games. These will soon be complemented by sports betting, which will let players place wagers on sports such as the NFL, NBA, soccer, golf, and more.\n\nTo support both users and investors, Rollblock has implemented a revenue share model that shares up to 30% of the platform's revenue with $RBLK token holders. To achieve this, Rollblock will use revenue to buy $RBLK from the open market. To create a deflationary effect, half of these tokens will be burned, and the remaining half will be allocated to staking rewards, where stakers can earn some of the highest APYs in the market.\n\nAnother key element of the Rollblock ecosystem is its ease of access. Unlike traditional casinos which require extensive background checks, Rollblock requires no KYC to get started. Instead, players can sign up using their email or cryptocurrency wallet. After signing up they can deposit over 20 major cryptocurrencies. This ease of access has sped up Rollblock adoption, with almost 5000 users signing up in Q2.\n\n\n\nRollblock is currently in the third stage of its presale, and $RBLK is selling for $0.0154. The token has already seen two price increases over the last week, and as a result thousands of investors are doubling down on what experts are calling the hottest presale of the year. As the project's momentum snowballs, analysts believe that 100x returns could be on the table.\n\nDiscover the Exciting Opportunities of the Rollblock (RBLK) Presale Today!\n\nWebsite: https://presale.rollblock.io/\n\n\n\nSocials: https://linktr.ee/rollblockcasino"
    },
    {
        "id": 74,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE5XbndqSXAzR1ZBXzRSSHNhTVdaNlEwVlBOOEtPcjZ2d3Z1cUNtYW5Obm81VHFvZlluM1hIMXNnVWJHNFNWUlZkM01PQnlsSkgwZVhBbU4ydzI3Vjhza1RLYkdya3BqN2RaY3pkano1Z3nSAXZBVV95cUxPSm9jT25haTd6RTZ0OWt1bTBDS3NEbmlwZUQ3Uk5mVVdIODczSDlUcnFfQV9GRTM4eFNQTnY1b2tWRDFKTHFubUo3R3JSdE5pZlJIaVVJYkxqTkJJRUFwVTE0LWJic01EMnN5aWR5S3JwRWltVnVB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jul 2024 03:29:03 GMT",
        "title": "Ethereum Price Sets Sights on Upside Break: Indicators Turn Green - NewsBTC",
        "content": "Ethereum price is moving higher above the $3,080 resistance zone. ETH could gain bullish momentum if there is a close above the $3,150 resistance.\n\nEthereum is slowly moving higher above the $3,050 level.\n\nThe price is trading above $3,050 and the 100-hourly Simple Moving Average.\n\nThere was a break above a short-term bullish flag with resistance near $3,090 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could gain bullish momentum if there is a close above the $3,150 resistance zone.\n\nEthereum Price Could Extend Gains Above $3,150\n\nEthereum price extended its recovery wave above the $3,000 resistance zone. ETH even climbed above the $3,050 resistance. There was a break above a short-term bullish flag with resistance near $3,090 on the hourly chart of ETH/USD.\n\nThe pair even spiked above the $3,110 resistance, outperforming Bitcoin. It tested the $3,150 resistance zone. A high was formed at $3,149 and the price is now consolidating gains. There was a minor decline below $3,120. The price tested the 23.6% Fib retracement level of the upward move from the $2,895 swing low to the $3,149 high.\n\nEthereum is now trading above $3,050 and the 100-hourly Simple Moving Average. On the upside, the price is facing resistance near the $3,120 level.\n\nThe first major resistance is near the $3,150 level. The next major hurdle is near the $3,220 level. A close above the $3,220 level might send Ether toward the $3,320 resistance. The next key resistance is near $3,400. An upside break above the $3,400 resistance might send the price higher toward the $3,500 resistance zone in the coming days.\n\nAnother Decline In ETH?\n\nIf Ethereum fails to clear the $3,150 resistance, it could start another decline. Initial support on the downside is near $3,080. The first major support sits near the $3,020 zone and the 50% Fib retracement level of the upward move from the $2,895 swing low to the $3,149 high.\n\nA clear move below the $3,020 support might push the price toward $2,955. Any more losses might send the price toward the $2,880 support level in the near term.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone.\n\nHourly RSI – The RSI for ETH/USD is now above the 50 zone.\n\nMajor Support Level – $3,020\n\nMajor Resistance Level – $3,150"
    },
    {
        "id": 78,
        "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTFBOVmZEMHBkRWw5N3dMOW1JNnQ3V3ZCbGNTdWxUVUhUMVVLSm5EOU53eDU1dVE3WXUwbk5XeWpJZHNwYTRaS0xPWHZMNUpsdV9xNkdsYW56dHpvSlUxVGdqTUI5TnpRVXVJcnhfQUlTRXNXZzVkckdj?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jul 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Price Prediction July 2024 - Is ETH About to EXPLODE? Buy Before It's Too Late! - Coinfomania",
        "content": "Different predictions on the future price trajectory of Ethereum (ETH) have been triggered by the upcoming launch of spot Ethereum ETFs.\n\nOf these forecasts, one that stands out the most is that ETH might replicate the remarkable gains that Bitcoin (BTC) made between 2023 and 2024. Bitcoin increased from $26,000 to an all-time high of $73,750 over that time.\n\nEthereum ETF Could Ignite Another Bull Run, Analyst Predicts\n\nAn anonymous analyst on X Follis stated that the expected Ethereum ETF might cause ETH’s price to move like BTC has in the past, with a possible 200% rise. Ethereum is now priced at $3,130, but the analyst predicts that price will grow to $9,324 by the end of the year.\n\nDemand would need to rise significantly in order for such a price hike to occur. The first signs of this increased interest were when ETH whales moved a sizable amount of money, as reported by Spot On Chain.\n\nEveryone focussed on Germany and Mt Gox\n\n\n\nMeanwhile the Ethereum ETF is about to launch and the $ETH chart looks identical to $BTC before it pumped +200% last year\n\n\n\nStudy ETF rallies pic.twitter.com/VWENNnO8dN — フ ォ リ ス (SG 🇸🇬) (@follis_) July 9, 2024\n\nA whale was observed to have taken out $50.30 million worth of ETH early on July 10, which was the first significant build-up since the Ethereum ETF started to garner more attention.\n\nThe recent events, in which a whale sold $12 million worth of Ethereum, stand in stark contrast to this claim. This change in behavior among Ethereum whales—from spreading their holdings to making bulk purchases—is corroborated by other Glassnode data.\n\nThis is demonstrated by the rise in addresses with $1 million or more in Ethereum valued at the time of reporting, from 14,217 on July 7 to 14,823 at that time. This suggests that there is increased demand for Ethereum and hope for the approval of the spot ETF.\n\nIn contrast to Bitcoin, Ethereum has experienced a more severe price correction. The price of ETH dropped by 24.65% between May 28 and July 9, while the price of Bitcoin dropped by a smaller amount, 19.43%.\n\nIn spite of this, according to market valuation, Bitcoin is still the most valuable cryptocurrency and is still outperforming Ethereum according to bullish signals.\n\nCautious Optimism\n\nHowever, historically, ETH’s more severe price drops have presented chances for large rebounds. A double bottom formation is currently visible on the daily ETH/USD chart, indicating a possible bullish reversal.\n\nTwo low points that are located close to the same price level and suggest a stabilization and possible upward trajectory help to identify this formation.\n\nThe last time such a pattern appeared on the Ethereum chart was in January 2024. After that, the price of ETH increased by 81.94%, reaching $4,067 by April.\n\nIf past events are repeated in a comparable manner, Ethereum’s price may reach $5,625 by the end of September. Nevertheless, Ethereum’s near-term outlook is still positive, provided that bulls can hold into their $2,934 support level.\n\nIs ETH About to EXPLODE? There could be Potential for a Bitcoin-Like Rally\n\nAnalysts are optimistic about Ethereum’s future, with some forecasting a rise similar to Bitcoin due to the impending introduction of spot Ethereum ETFs. The likelihood of more demand—especially in light of recent whale activity—fuels the possibility of a price spike.\n\nSource: Glassnode\n\nEthereum’s price adjustment is more noticeable than Bitcoin’s, but there appears to be a growing interest for the cryptocurrency based on the change from whale selling to accumulation and the rise in high-net-worth Ethereum holdings.\n\nShould the expected flood of institutional capital via ETFs come to pass, ETH may see a price increase like to that of Bitcoin during its 2023–2024 surge."
    }
]