[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE5FdjloR3FlR1B4cnFsYjVqdm5rM2U0TTZ4SGZJa0YwYlBuRkJBOHIzeTBPQzBpWWpmVUM4X3A1cWxRaDBPX3FBY0VZeks3Y3c1eVNUbDNwWjUtTnZBdkR4MTdobEd4UXI0SmZ4MjNjcVRYRThnaWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 01 Feb 2024 08:00:00 GMT",
        "title": "Ethereum devs consider ‘existential’ upgrade to the EVM - Blockworks",
        "content": "If there is one Ethereum upgrade that has been ever a bridesmaid, it’s the EVM Object Format (EOF).\n\nEngaged once, with plans to be married in Shanghai, it was cast aside soon after by developers swooning for a blobular future in Proto-Danksharding.\n\nIf you have no idea what that sentence means, don’t fret. It’s a metaphor for hours of discussion over years of Ethereum all-core developer calls.\n\nFollowing Thursday’s ACD call, we still don’t know whether EOF will finally get a chance to be a bride. But at least there’s a clear proposal on the table.\n\nRead more: Dencun and Pralectra: Ethereum core devs chart an ambitious 2024\n\nDevelopers had been strongly considering EOF for the Shapella hard fork. A year ago however, after a fair bit of introspection, it was pulled in favor of keeping the focus solely on staking withdrawals.\n\nOnce Shapella had safely shipped, the candidates for inclusion in Dencun had yet again EOF among them. And again it was shelved, much to the chagrin of the feature’s two main champions, Danno Ferrin and Greg Colvin.\n\nThe consensus in April 2023 was that EOF was too big to share the stage with EIP-4844 — Proto-Danksharding — and therefore one had to go. The latter, with its potential to dramatically improve the user experience of layer-2 rollups, won out.\n\nAs a consolation, Ansgar Dietrichs at the Ethereum Foundation suggested having EOF as a focus of the next upgrade, Prague. “It’s too big to be the second place in a fork,” he said. So, it should have its own.\n\nRead more: Ethereum’s next upgrade to focus on blobs\n\nDencun, with 4844 as its “driver,” remains on track for mainnet in March as developers reported an “uneventful” hard fork of the Sepolia testnet on Tuesday.\n\n“We saw finality as well as blobs showing up exactly when we wanted them to,” said the Ethereum Foundation’s Parithosh Jayanthi.\n\nJust one testnet, Holesky, is left before mainnet, and Dencun should be given its final test on Feb. 7.\n\nPushing EOF over the finish line\n\nMost of Thursday’s call was aimed at understanding the current status of the next big feature fork. Named “Prague,” this consensus layer upgrade is titled after the location of Devcon 4. Meanwhile, “Electra” — a designation inspired by a blue-white giant star within the Taurus constellation — is the term used by execution clients to refer to the same upgrade.\n\nThe priorities for “Pectra” are slowly taking shape. Very slowly.\n\nFerrin once again made the pitch for EOF, calling it “existential to the EVM in the next couple of years.”\n\nAs a leader of the EOF implementers working group, Ferrin said developers “have been moving into ‘ship it’ mode.”\n\nEOF aims to make Ethereum smart contracts more secure, efficient and developer-friendly. It’s of particular significance to Ethereum dapp developers, who don’t typically join the biweekly all-core dev calls.\n\nThat’s left some client teams with the impression that EOF isn’t important in the past, a stigma that has been hard to shake.\n\nOn the Jan. 4 call, Dragan Rakita from the Reth client team expressed strong support for EOF, and Nethermind developer Lukasz Rozmej noted EOF is a lot easier to test than Verkle trees — the main competing focus for the next fork.\n\nRead more: Big Geth users are diversifying their clients following Nethermind bug\n\nEven Marius van der Wijden from Go Ethereum (Geth), previously an EOF-skeptic, sounded relatively on-board with the idea.\n\n“I’ve been warming up to EOF, [it’s] just not a [priority] for me,” van der Wijden said.\n\nSupport built further on the Jan. 18 call. Paradigm’s Chief Technology Officer Georgios Konstantonopolous said it was “doable by one person in a couple months.”\n\nFerrin reiterated that sentiment on the most recent call, arguing that work on EOF and Verkle is done by different engineers within client teams, and therefore committing to it wouldn’t prevent work on Verkle from progressing.\n\nBut Guillaume Ballet, a Geth developer at the Ethereum Foundation, was not yet convinced, worrying EOF could adversely affect Verkle.\n\n“If it does go first, I need to make sure we don’t ship something and paint ourselves in the corner realizing we broke something,” Ballet said.\n\nAndrew Ashikhmin, software engineer on the Erigon client team, proposed to commit to EOF with the caveat that it be tried on a Verkle testnet and that there be time carved out for collaboration between Verkle and EOF implementers in the coming weeks.\n\nIt’s a bit of a chicken-and-egg problem, as Ferrin observed.\n\n“Before we can put it in testnet in Verkle, we need it working in clients,” he said, adding that his Besu client team could have EOF up and running soon for testing purposes.\n\nBut he’s convinced it should be compatible with Verkle.\n\n“I don’t want ‘shoulds,’ I want to see it working,” Ballet retorted.\n\nEOF is left still trying to catch the bouquet, awaiting a suitor to walk it down the aisle.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxOVU1VQ3RmM3p6NUlLbXYwMUdLNFExenRYWUxfaDdaTmZBUWJtRlU1RkJQaHpwakVfZnFpeW84Mlp4UGF0S2JBNHg4Um9TbFJpeTlQN1BjWkVyUFpJV2FPUGM1TmMxeklNMnllWXNfbnREdGZZTHlNUUJqSjlVd3M2azljZ2pZMDBBcDRiLXBYdGw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 02 Feb 2024 08:00:00 GMT",
        "title": "Prediction: Ethereum Will Reach $10,000 in 2030 - The Motley Fool",
        "content": "For Ethereum to rise nearly 5 times in value by the year 2030, here's what needs to go right.\n\nSo far in 2024, Bitcoin (BTC -0.36%) has attracted much of the attention of crypto investors, thanks primarily to all the buzz surrounding the launch of the new spot Bitcoin ETFs. But don't sleep on Ethereum (ETH -1.08%), which is finally showing signs of making a bull market breakout above the $2,000 price level.\n\nFor Ethereum to hit a future price of $10,000 would require it to rise nearly 5 times in value within a relatively short period of time. But there are several good reasons why that might be more likely than you think. Let's take a closer look.\n\nEthereum's market dominance\n\nWhile it might be fashionable to talk about all the upstart cryptos challenging Ethereum -- most notably Solana (SOL -0.80%) -- the fact remains that Ethereum still dominates in just about every key niche of the world of blockchain-based smart contracts.\n\nTake decentralized finance (DeFi), for example. According to the leading metric used to calculate DeFi strength (Total Value Locked, or TVL), Ethereum is the market leader by a wide margin. Ethereum currently accounts for 56% of all TVL in the blockchain world. By way of comparison, Solana's market share is less than 3%.\n\nIn a best-case scenario, Ethereum will continue this market dominance over the next five years. In doing so, it will position itself at the forefront of every major blockchain trend. Sure, some of these trends might flame out, as we saw recently with non-fungible tokens (NFTs) and metaverse tokens. But some of these trends could really take off and create an enormous amount of value along the way.\n\nSpot ETF approval on the way\n\nThere are also a number of upcoming catalysts that could lead to a sustained rally in Ethereum's price. Chief among these is the potential introduction of a spot ETF product for Ethereum.\n\nThese new Ethereum ETFs are expected to galvanize the same type of market enthusiasm as the new Bitcoin ETFs. In fact, immediately after the spot Bitcoin ETFs started trading, the price of Ethereum spiked, largely based on this assumption. Right now, it looks like SEC approval of a spot Ethereum ETF could happen as early as May. Assuming that there are no market glitches related to the new Bitcoin ETFs, approval now looks likely.\n\nThe big question is what type of effect this approval might have on the price of Ethereum. The current assumption is that institutional investors will choose to allocate at least 1% of their portfolios to crypto. Presumably, the lion's share of that money would flow into Bitcoin. But some portion of that money would flow into Ethereum as well, and that could steadily push up the price of Ethereum over time.\n\nHow likely is the $10,000 price forecast?\n\nA price target of $10,000 by the year 2030 might sound outlandish, but it's actually more conservative than other price targets for Ethereum. If you look across the crypto industry, you can find price forecasts of $50,000 and higher for Ethereum. It all really depends on how fast you think Ethereum can grow over the next half-decade.\n\nFor example, in 2022, Cathie Wood of Ark Invest predicted that Ethereum would have a market cap of $20 trillion by the year 2030. Given Ethereum's current circulating coin supply of 120 million, that would imply a future price of approximately $170,000 per coin! Moreover, Wood has suggested that Ethereum could outperform Bitcoin in the next crypto market rally and potentially even \"flip\" Bitcoin in terms of overall market cap.\n\nGranted, that $170,000 price prediction was made amid all the buzz and hoopla surrounding The Merge, which saw Ethereum radically overhaul its blockchain to prepare for the next wave of growth. But it gives you an idea of how high some investors think Ethereum could soar in the next few years.\n\nWhat needs to happen next\n\nFrom my perspective, a few things need to happen next in order for Ethereum to hit that magical $10,000 price point as early as the year 2030. For one, we need to see approval of the spot Ethereum ETFs. That would make Ethereum much more attractive to both retail and institutional investors. It would also be great to see Ethereum continue to make major upgrades to its blockchain, so that it becomes even faster, cheaper, and more efficient to use.\n\nThe only problem, really, is what to do about all those pesky Ethereum challengers. They appear to be growing faster than Ethereum and, in some cases, innovating much faster than Ethereum. Even Cathie Wood has acknowledged this.\n\nSo Ethereum reaching a price of $10,000 is by no means a slam dunk. Even in the best of all possible worlds, it takes many years of frankly unrealistic price gains to get there. But if the entire crypto industry continues to grow and mature, and if Ethereum maintains its dominant market role along the way, it just might happen."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxOZDgwSGpaRHd0MGNnV2ZRS2tFdVhaa0RRdGZBVUVMcWFWYTFGVzlVWndsSmNZNnBfbjBURWZpRlExOGRuUDFZUWZxbW00SzZtZTFSYzFYQ3UyYVB0eExlbUtEU0wxQXhYV1NRSmtKZzVOMk5DWkNPSDg4TVU3OHg2UUgwX2dQT3E5VWhYdkg0N21nejd3U2NDem5yTzJkVDZVSkE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 01 Feb 2024 08:00:00 GMT",
        "title": "Pro-Ethereum Crowd Slams Solana-based Jupiter Airdrop as ‘Absolute Trash’ - Unchained",
        "content": "Ethereum enthusiasts and Solana devotees have been trading insults over one of the key mechanisms used in the airdrop for Solana-based decentralized exchange aggregator Jupiter.\n\nJupiter’s LFG Launchpad is a portal where traders can claim their airdrop distribution and use services to facilitate the trading of newly issued tokens. In the instance of the JUP airdrop, Jupiter traders can claim their airdrop allocation of JUP in addition to acquiring more tokens at launch by presetting limit orders or dollar cost-averaging functions.\n\nWhen traders acquire more tokens through Jupiter’s LFG Launchpad, they are engaging with a single-sided liquidity pool that initially only had JUP. When the airdrop went live, traders were able to withdraw JUP from the pool and deposit USDC.\n\nRead More: Jupiter Traders Claim Whopping 545 Million JUP Tokens in First 8 Hours of Airdrop\n\nOf JUP’s 10 billion total token supply, the Jupiter team allocated 250 million JUP for the single-sided liquidity launch pool and 100 million JUP for the launchpad fees, according to a forum post written by Meow two days ago that detailed JUP’s token genesis event.\n\nThis means traders, who purchase tokens through Jupiter’s launchpad infrastructure, are acquiring JUP directly from the 250 million pot that the Jupiter team earmarked for the liquidity pool on its airdrop launch page. On Thursday, Meow said on X that Jupiter’s core members will in a week take the USDC and JUP inside the liquidity pool and place the funds into the team treasury.\n\nMoreover, 75% of the 100 million JUP allocated as LFG launchpad fees is dedicated to the coming JUP DAO and the remaining 25% is for the Jupiter core team.\n\nWhile people from the Solana ecosystem have praised Jupiter and its founder Meow for how Jupiter’s core members designed and conducted its airdrop, members of the Solana-rival pro-Ethereum camp had harsh words for the decentralized exchange aggregator.\n\nEthereum Crowd’s Takeaway\n\nCritics cite Jupiter and its founder Meow on two elements of Jupiter’s airdrop infrastructure: the team having 250 million JUP tokens to sell and the Jupiter ecosystem keeping 100 million JUP tokens fee for launching on their own launchpad.\n\nEthereum enthusiasts have raised concerns about the Jupiter team selling tokens to the public through the token launch pool, immediately following its airdrop going live. A strategic advisor for liquid staking provider Lido and Ethereum research firm Flashbots, who goes by “Hasu,” said on X that Jupiter selling the 250 million JUP tokens for stablecoin USDC is a “Truly remarkable grift” and “One for the textbooks.”\n\nIn reference to the launchpad fee of 100 million JUP tokens that will end up in the pockets of the JUP DAO and the core team, Paul Dylan-Ennis, a lecturer in the College of Business, University College Dublin who writes about Ethereum culture, said on X, “This is Solana’s ICO era of absolute trash.”\n\nSolana Crowd’s Pushback\n\nThose defending Jupiter argue that the information about the 250 million JUP tokens for the launchpad liquidity pool and the 100 million JUP tokens for the launchpad fee has been publicly accessible for months.\n\nMike Dudas, general partner at 6th Man Ventures, expressed sarcastic outrage about Jupiter’s transparency. “I, for one, am extremely outraged that @weremeow and @JupiterExchange launched their token in the exact manner they said they would after sharing the methodology in excruciating detail across numerous communication methods for multiple months,” he shared on X.\n\nRead More: Jupiter’s Airdropped Token JUP Debuts at a $878 Million Market Cap\n\nSolana enthusiasts also took the opportunity to use ad hominems to call out Ethereum loyalists. One X user in a tweet about Jupiter’s controversy said, “0xdumbass.eths are crying – thats just what they do — ignore them.” Another said, “ETH Maxis can cry all they want and make unfounded statements… having haters comes with the territory.”\n\nMeow defended Jupiter’s decision to allocate 250 million JUP tokens inside the launchpad liquidity pool. “By doing it this way, airdrop recipients get a massive pool to constantly sell into, while prospective buyers have assurance that there is a big pool to absorb big selling pressure from airdrops that will cause them immediate massive rekt,” wrote Meow on X.\n\nRivalry Going Back Years\n\nThe back-and-forth between supporters of Solana and Ethereum is the latest development in the rivalry between the two blockchain networks. For years, people have referred to Solana as the “Ethereum killer,” but Ethereum has been the incumbent leader for blockchain networks with smart contract functionality. While Solana has historically trailed Ethereum — falling further behind during the collapse of the crypto exchange FTX — in the past few months, Solana has made a comeback. It’s been successfully challenging Ethereum’s dominance in terms of several metrics such as a thriving memecoin ecosystem and trading volume on decentralized exchanges."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxQZHlpdkF4emoyY1dyaUIwend1dW1uU2t3RTN0OHBMdjdBdkVoMUJIOXVNdE1XcFgwTVplUkl0ZUQ3aGxHNTUyNVJUR3R0TXFRZGVFZUxEVk9RQkZGODZfUTZEdmJJbmJTTXA3T0x2c2FsMURON3pobjRnSEZfdzJRYWJjOFBmOExBVzRkempPQUY3UEoweEdnejBsS0lEbW1XcGExSE9tc3YwMERWTnJHampHSFQ2MDRiT25CcTN0bjNPSlRiWlNR0gHMAUFVX3lxTE01LVJKM3Eyc1JaZU00UUpoSkZGMFdTSkY1MVlERE80VXpLWnk0TGd1ZjBReEhTelZaTmJhNkU1b0JpSXk1VXhvM29Pamx2YTFWSVlRZWh0LV96amJOdks3ci1XVlkwOUdtM1Y3eFY1R3VjTExBWDF5VkRaajd1U1JqYjk0SzlSSnVfWUNTUU5BX3MxU080TjdXUFprRlRPNEJrOTVGMzRPQjduUS1XbFAzeUNSOTBpaFRTZ2h2RHg2N01ibFU4VS16WXVPbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 02 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Ready for 70%+ Surge, According to Crypto Trader Michaël van de Poppe – Here’s the Timeline - The Daily Hodl",
        "content": "A widely followed cryptocurrency analyst and trader believes Ethereum (ETH) is on the verge of a massive breakout.\n\nMichaël van de Poppe tells his 691,900 followers on the social media platform X that there are three main reasons why he believes ETH could soon soar by more than 70% from its current value.\n\nHe thinks the finalization of ETH’s next major upgrade called Dencun will help boost the network’s value. Dencun aims to decrease ETH’s transaction costs for layer-2 projects and address scalability issues.\n\nOther catalysts, according to the trader, are the possibility of spot exchange-traded funds (ETFs) for ETH and the funneling of Bitcoin (BTC) profits into ETH after the crypto king’s April halving event, when miners’ rewards are cut in half.\n\n“Ethereum is still ready for $3,500-4,000 in the coming three-six months.\n\nDencun upgrade with the final testnet February 7th.\n\nEthereum spot ETF hype.\n\nBitcoin rotation after halving towards the rest of the ecosystem.”\n\nLooking at his chart, the trader suggests Ethereum is printing a bullish pattern of higher low prices and is on the verge of possibly flipping the key level of $2,336 into support.\n\nEthereum is trading for $2,309 at time of writing.\n\nNext up, the trader predicts Bitcoin will rally up to $51,000 before the halving and then correct to the low $40,000 range.\n\n“Bitcoin consolidating and acting in a boring manner. Probably it will look for a higher low after which we’re having a slight pre-halving push to $48,000-$51,000.”\n\nBitcoin is trading at $43,357 at time of writing, up more than 2% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxQOHE5V2lQR3JnMmZXLTRrZTloZENZbnFaXzZHQzBwS0o1Vm9sT0NEU2p0dENSdlBoTGlMSGdWSVRtTjFNOURCWEVnZ0UzaGNYOTJuYkh1OXktblJuc0Q2X2hFOW5zdzJUVndISHFqYTNoYzZ1S1NBLWVnVWo1aDVXcncwR3BoMWQ1RDRybWlYYlFKQ0VfQ2pBcnhBRGRCTGNwOS1WTWdfM05adw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 02 Feb 2024 08:00:00 GMT",
        "title": "Jupiter airdrop propels Solana DEXs to outpace Ethereum in daily trading activity - CryptoSlate",
        "content": "Solana-based Jupiter airdrop has generated substantial excitement, driving decentralized exchange (DEX) trading activity on the layer1 blockchain network beyond that of Ethereum.\n\nData from DeFillama shows that Solana-based DEXs facilitated trades totaling $1.14 billion in the last 24 hours, surpassing the approximately $1.13 billion traded on Ethereum-based platforms during the same period.\n\nThis achievement underlines the remarkable growth and widespread adoption witnessed within Solana’s DeFi ecosystem, capturing the crypto community’s attention. Notably, last December marked the first instance of Solana DEXs outpacing Ethereum, propelled by heightened memecoin and stablecoin activity.\n\nWhile the daily figures demonstrate Solana’s momentary lead, it’s essential to note that the weekly transaction volume of Solana-based DEXs stands at $6.113 billion, slightly trailing behind Ethereum’s $7.852 billion.\n\nJupiter airdrop\n\nOn Jan. 31, decentralized exchange aggregator Jupiter executed a noteworthy airdrop, distributing approximately $700 million worth of its native token, JUP, to nearly a million wallets. The trading platform is the most dominant protocol on Solana, facilitating trades worth $11 billion in January.\n\nIts airdrop garnered substantial attention from the crypto community, leading to rapid listings on major centralized exchanges like Bybit and Binance. On its first trading day, the asset witnessed an impressive volume surpassing $1.4 billion, propelling the token’s value to a peak of $0.72 before settling at $0.62 as of press time, according to CoinMaketCap data.\n\nOn-chain investigator Lookonchain identified three airdrop participants who amassed over $1 million in gains. These individuals received a collective airdrop of 5.5 million JUP tokens, valued at an estimated $3.6 million, distributed across approximately 27,600 wallets.\n\nThe launch and airdrop of Jupiter’s token significantly boosted activity on the Solana network. Notably, the web3 wallet Phantom reported unprecedented traffic levels, tripling the total volumes seen after the recent WEN meme token launch.\n\nBlockchain analytical firm Artemis corroborated this, pointing out that the anticipation of the airdrop had driven active addresses on Solana to more than 1 million earlier in the week.\n\nDespite the surge in activity, Solana’s network demonstrated exceptional stability, dispelling concerns of potential downtime that had plagued it in the past.\n\nMentioned in this article"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxNYnNxTXBQM3NWZW1DZXN6TkZ5SnNWM2FnMnBSLWM3Qi16c242RHlpeHZYbjBTODY1QUs0YzZ1bXlYaUpMVW9XRFVTbjdRM1NwSHZYR2U3a21lNlNWcHc3TGdYLW51VlNHeUl2d29OT3JOSHhjdHJCWXctRHgxZGRUMno0UzhLSXprZDVwMzlWSnZfUG1jREcxTHpmQk83amJDWmdxeHR4eGxUazFfUEZWVDdR0gG3AUFVX3lxTE1SMjhBeFBiNEVLbEZuSDI2UmxWMG9NZm1QVDlPblp4VG1VQ0VFVVlwRXpQS0doMWpYTUtnWkVkRUdqVWJxaVFQMEYyektUR053VWJQR2dYSGd1cHhLZXdDdDhjZ0pMQVJQYmtYSEk2Q0VZSWJyeUoxMEgtRlNTdU1RN3Y4WE15SFlXdTNJb1pId3ZHaFk2Q0tQVmQ1QmxRTFp0aTFlV01OQjJiYzhiRE5QSktZS3RNQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 02 Feb 2024 08:00:00 GMT",
        "title": "ChainLink (LINK) Price Explosion: What Happened? Ethereum (ETH) Price Rally Lacks Backbone, Can Bitcoin (BTC) Break Through 50 EMA? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nChainlink has surged ahead of the rest of the crypto market with an explosive 16% rally in the last two days. This rally can be attributed to a variety of factors, not least of which is the activity spike in previously dormant wallets, signaling a resurgence of movement within the Chainlink ecosystem.\n\nThe analytics have revealed an Age Consumed spike of 5.38 billion, a metric that measures the multiplication of coins moved by the number of days they had remained passive. This sudden mobilization of LINK tokens has injected volatility and liquidity onto the market, fueling the price ascent.\n\nFrom a technical standpoint, Chainlink's price has breached crucial resistance levels, now attempting to establish new support. The price has soared past the $15.29 mark, which previously acted as a significant resistance barrier. This breakthrough suggests robust bullish sentiment, with the potential for further growth if the momentum is sustained.\n\nThe next resistance lies at approximately $18.39, a level that, if conquered, could bolster confidence in Chainlink's uptrend. Conversely, should there be a retracement, the $14.29 level may serve as a new support, providing a safety net for the price. A dip below this could see LINK testing the $13.18 support zone, where buyers may step in to prop up the market.\n\nAdvertisement\n\nNo power for Ethereum\n\nEthereum, the second-largest decentralized network by market capitalization, is experiencing a period of stagnation, with its anticipated price rally showing signs of faltering. Despite Ethereum's prominence in the blockchain space, the network is seeing a significant challenge from competitors like Solana, which has been capturing a growing share of blockchain activity.\n\nA closer look at Ethereum's price movement reveals a lack of momentum that could be attributed to the decrease in on-chain traction and volume. Ethereum's price is currently consolidating around the $2,300 mark, struggling to find the strength for a decisive move. The key resistance level to watch is at $2,337, where the token has faced repeated rejections. A breakthrough above this point could potentially lead to a test of the $2,450 zone, offering a glimmer of hope for bullish momentum.\n\nHowever, the support levels paint a cautious picture, with $2,193 serving as the immediate floor. A breach below this could see prices slide toward the $2,042 level, which could further dampen market sentiment. The lack of volume accompanying recent price movements suggests a tentative market, with investors possibly waiting for a stronger sign of a trend reversal before committing to more substantial positions.\n\nBitcoin aims for breakthrough\n\nBitcoin has recently made a bold move, slicing through the 50-day Exponential Moving Average (EMA), a key technical resistance level. This breakthrough is a sign of strength from the leading cryptocurrency, indicating a potential reversal from its recent price consolidation.\n\nThe 50 EMA has historically acted as a litmus test for Bitcoin's short-term trend direction. A sustained move above this line could validate bullish sentiment among investors, as the cryptocurrency tries to establish a new foothold for further gains. Currently, Bitcoin's price is hovering around the $42,000 mark, attempting to solidify its position above the 50 EMA.\n\nIn terms of price analysis, the successful breach of the 50 EMA has set the stage for Bitcoin to test the next resistance level near $43,500. This level is critical as a break above could pave the way for a move toward the $45,000 resistance zone. However, it is essential to note that Bitcoin needs to maintain its current momentum to prevent fallbacks below the 50 EMA, which could dampen the optimistic outlook."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiUkFVX3lxTE9pazBPS0Uyem9rVzBLS2g2c2V6SkVtNlluV0xnWFMzU0pCcVR1TV83RDVmMG5yVEM4RlpKeHFWNFJ4MG12YnZhaUdvQTlaOUwyeWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 01 Feb 2024 08:00:00 GMT",
        "title": "How to bridge to Tron - OKX",
        "content": "Blockchains are usually self-contained systems and lack the ability to communicate with other chains, creating difficulties for users when transferring money. The purpose of building what the crypto space call ‘bridges’ is to address this issue. Through blockchain bridging , individuals can efficiently transfer their funds between different chains. Cryptocurrency bridges promote blockchain interoperability and enhance the ease of digital asset transfer.\n\nIn this article, we’ll walk you through how to bridge to the Tron ecosystem’s own blockchain. But first, what is Tron?\n\nLaunched in 2017 by Justin Sun, Tron quickly grew in popularity due to its speed and efficiency. Initially, it was built on Ethereum to focus on entertainment and content sharing. It shifted to its own blockchain system in 2018 and achieved complete decentralization in 2021. Over the years, Tron has developed a vibrant community and decentralized application (DApp) ecosystem featuring popular NFTs and games.\n\nPreparing for bridging: wallet and asset selection\n\nChoosing the right wallet\n\nTo begin using a bridge to Tron, the first step is selecting the appropriate wallet.\n\nOKX provides a highly secure and multi-chain OKX Web3 Wallet with all OKX accounts. Tron isn't an Ethereum-compatible chain and Ethereum wallets such as Metamask don't support it. However, the OKX Web3 Wallet has ‌support for major blockchains, including Tron. Also, the OKX Web3 Wallet features bank-grade security and inbuilt access to hundreds of DApps and the OKX NFT Marketplace .\n\nSelecting assets for bridging\n\nThe first step before you bridge a cryptocurrency from one chain to another is to make sure the asset is supported. For this guide, we’ll be transferring USDT from Ethereum to Tron. USDT is a supported currency on both chains.\n\nTo do the bridging, you need USDT as the asset you’re sending and ETH to cover gas on Ethereum. However, make sure you have some TRON in your Tron wallet for gas fees to use your USDT after bridging.\n\nExploring bridge services\n\nDecentralized bridge services\n\nWe recommend OKX Swap as a safe option to bridge ETH to Tron. OKX Swap combines prices from numerous decentralized exchanges to provide the most efficient path, reducing slippage and network fees. Additionally, OKX Swap allows for effortless cryptocurrency conversions and safe transactions. Other Tron bridges you can check out are Meson and Allbridge .\n\nCentralized bridge services\n\nOne simple method of connecting to Tron is through the use of centralized exchanges. By using this method, you can transfer your cryptocurrency to OKX using one network and then transfer it out using a different one. Here’s a simple guide on bridging USDT from Ethereum to Tron using OKX Exchange.\n\nStep 1: Create an account on OKX .\n\nStep 2: Once logged in, head to “Assets” on the top-right and select “Deposit.” If you don't have USDT, you can purchase some on OKX and bypass the deposit process.\n\nStep 3: Select “USDT” as the crypto and “ETH-ERC20” as the deposit network.\n\nStep 4: Transfer USDT to the provided address from your Ethereum Wallet. It may take a few minutes for the USDT to be deposited and become available in your account.\n\nStep 5: Once your funds are ready to be used, go back to “Assets” and select “Withdraw.”\n\nStep 6: Select “USDT” as Crypto and the withdrawal method as “On-chain.”\n\nStep 7: Type in your Tron address and select the network as “USDT-TRC20.” Enter the amount of USDT you want to bridge to Tron and hit next. Upon account verification, the USDT will be deposited into your Tron wallet in a matter of minutes.\n\nOne of the simplest ways to bridge your assets is by using an exchange, since you won't have to worry about slippage or network fees.\n\nChoosing a bridge service\n\nCentralized and decentralized cryptocurrency bridges have their own benefits. Deciding which one to use is a personal choice. Decentralized bridges allow for faster movement between chains, but may have high fees and security concerns. It's important to choose a reputable bridge with a strong security history.\n\nBridging process: a step-by-step guide\n\nTo transfer USDT to Tron, you'll need to link your wallet and move the assets. Our recommended method involves using the OKX Web3 Wallet and OKX Swap. However, the steps should be similar if you prefer to use a different wallet or bridge platform.\n\nConnecting to a bridge service\n\nStep 1: Head over to OKX Swap .\n\nStep 2: Select “Connect wallet” in the top right corner, and select “OKX wallet extension.” If you use another wallet provider like Metamask or Phantom, select “Other” and choose your wallet.\n\nStep 3: Enter your OKX wallet password and select \"Confirm\" to allow your OKX wallet to connect with OKX Swap.\n\nTransferring assets to Tron\n\nNow that you’re connected to OKX Swap, you can bridge USDT to Tron.\n\nStep 1: Adjust the bridge settings and specify the quantity of USDT you wish to transfer in the \"Swap and Bridge\" section.\n\nChoose \"Ethereum\" as the first network and enter the desired quantity of USDT to transfer. Choose \"Tron\" from the \"To\" network. If you can't find the network right away, select \"View all networks\" under \"Select Network\" and look for \"Tron.\" Next, choose \"USDT\" as the token. OKX Swap will then display the USDT you'll receive on Tron.\n\nStep 2 (optional): This step isn't mandatory. It should only be completed if you have a strong understanding of slippage and bridges.\n\nNetwork fee: This calculates the cost of the network to enable the bridging. Slippage: Slippage refers to the level of flexibility you're comfortable with when faced with price fluctuations. By setting the slippage to 0%, OKX swap guarantees you'll receive exactly 98.2 USDT, as shown. However, the transaction will be voided if the price changes, and you'll incur a network fee. Allowing for some slippage is important in situations where liquidity is limited. Trading route: The OKX Swap acts as a DeFi aggregator, selecting the most optimal bridge to connect to Tron at any given moment, rather than functioning as a bridge itself. You have the option to manually change the service if needed.\n\nStep 3: Select “Swap across chains.” When your wallet pops up, confirm the transaction.\n\nOKX Swap is a user-friendly DeFi solution for transferring and exchanging cryptocurrencies with‌ bridges.\n\nAlongside supporting swaps between different networks, OKX Swap and other bridges can also be used in the opposite direction, acting as bridges between Tron and Ethereum. To launch a Tron to Ethereum bridge, Tron must be selected as the primary network and Ethereum as the secondary network.\n\nOKX Swap also offers the capability to convert USDT to TRX during the bridging process. By selecting \"TRX\" as the second currency instead of \"USDT,\" OKX Swap will seamlessly convert the USDT from Ethereum to TRX and complete the bridge to Tron.\n\nUnderstanding fees and timelines\n\nFee structures explained\n\nThere are multiple fees involved in a decentralized bridging process:\n\nEthereum gas fees : To use OKX Swap and transfer your USDT, you're required to pay a transaction fee to the Ethereum network. Bridge fees: The role of OKX Swap is to serve as both a bridge and a swap aggregator. To start the bridging process, a small fee is charged by the bridge. Tron transaction fees: Just like the gas fee on Ethereum, the Tron transaction fee is deducted to enable the transfer of USDT from the bridge to your wallet. Conversion fees: If you’re converting from one cryptocurrency to another during the bridge process, such as USDT to TRX, there’s a conversion fee for that.\n\nBefore making a transfer, you can view a breakdown of the conversion and bridge fees on OKX Swap. However, the Ethereum gas fee will only be displayed on the OKX Web3 Wallet pop-up when you confirm the transaction.\n\nExpected transaction times\n\nJust like the fees, the transaction time also depends on multiple factors:\n\nEthereum confirmation time: The amount of time it takes for USDT to transfer from your wallet to the bridge. Bridge processing time: The duration for transferring your asset from one chain to The information for each bridge may differ. To access this information for OKX Swap, go to the advanced options and choose the trading route. Tron blockchain confirmation time: The USDT will be transferred to your wallet after the The bridging procedure is quick thanks to Tron's fast processing speed, so you can expect to receive it in your wallet within a few seconds.\n\nSecurity measures and best practices\n\nMaking secure transactions\n\nWhen using a cryptocurrency bridge, it's important to remember that you are interacting with a smart contract that has access to your wallet. Be aware that malicious smart contracts can be used to steal funds from your wallet. To ensure a secure transfer of digital assets on bridges, we suggest following these steps:\n\nBe sure to choose a reliable bridge for Tron, like OKX Swap, which has a good history. Refraining from using your main wallet for transactions with bridges and other DApps is recommended. Maintaining a separate cold wallet for securely storing your assets is advisable. Use tools like Revoke to remove access to your wallet once you’re done bridging.\n\nAnother possibility for minimizing potential hazards is using a centralized exchange as a bridge. OKX implements cutting-edge security measures to ensure the secure and seamless exchange of USDT for global users. Visit our security of funds and Proof of Reserves page for more details.\n\nAvoiding common pitfalls\n\nHere are some of the common pitfalls you can avoid while you’re bridging your assets to Tron blockchain:\n\nMake sure to thoroughly check all the information you enter before finalizing it. Once the transaction is confirmed, it can't be undone. Pay close attention to gas fees . During high network congestion and demand periods, gas fees on Ethereum may increase, making transactions more costly. You may want to wait for gas fees to decrease or choose to use a centralized exchange for transferring funds. High slippage and liquidity issues are another aspect to look out for. Opting for a less commonly used bridge or connecting to a coin with low trading activity could lead to significant slippage. To avoid this, it's advisable to only bridge to assets with a high level of liquidity.\n\nTroubleshooting and support\n\nCommon bridging issues and solutions\n\nIt's common for users to come across stuck transactions, but this can be resolved by making sure that the gas fee on Ethereum is appropriate. If enough gas has been allocated, the transaction will be completed successfully. However, inadequate gas will result in a failed transaction and a refund of funds to your wallet. During times of high traffic, transactions may get trapped on the bridge. Nevertheless, cryptocurrency bridges are equipped to handle these situations and will eventually be resolved. Cross-chain compatibility: Prior to initiating the bridge, ensure that the asset being transferred has adequate liquidity and is compatible with the designated chain.\n\nWhere to seek help\n\nThe crypto community is renowned for its helpfulness. In case of any difficulties, there should be accessible resources to help you."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMi4wFBVV95cUxPVzUtdDR5X1ZMeWlXU3RYZUEtZm9CNlhQQ0NUYmZkV2lDS1FVeVU4dXlrbjVsS3E0Mlh1MGtHZXU3TU5hSlVYX0phZ3IxOGg5bE9zUGlBdmJlSUtlbGptUFpuVXRXa0xLM2pOWTUwUGhZUENVQTRoNE0tSGxZYy1iXzc2a2NHSktwYldCQTFtaVBScDdCNC1MVGFoRXl1N3NBX2FEdDloMjBPRllQWEYwc0VGTTNLVnhwRmJMd2xCdVZ6M1VDbGh2T3NzblNxTEVtbGhqdEczWHNrelNxYk51YWpGMNIB6AFBVV95cUxOV0dQc2J6OXdqaG55am5uaVR4c1NXSTZRS1lrdXJFZENzWmEyZXk1Yl9abUpkdF9GNVBpQ2R1eTNQVVpSdm9kVGZpcVBpRy05b2NDbFJ3bjVrUUxNZUVOWkhQa0pGQXl6ZGJnajFZcGM5YnlwUjFfODBRQVduZmRuSkVVak5EM1g4S0RORTVxX3hfdmZPbkc0TklRbDJlbkFNWVREcUJLMUI5VjN2YllLdWpaVFZXTUxPRWdEQU9ISWtNY05lX0dlVGZPYkh5WTQtMjlISXMtRElMYWIydTVnVllkdkdxOUJM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 02 Feb 2024 08:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: BTC gains strength as GBTC outflows shrink - FXStreet",
        "content": "Bitcoin price could make a move on the $43,750 barrier.\n\nEthereum price risks a 5% drop as technical indicators for ETH show weakness.\n\nRipple price could fall 7% to October lows as XRP consolidates within a bearish technical formation.\n\nBitcoin (BTC) price is showing strength again amid waning selling pressure from Grayscale Bitcoin Trust (GBTC) redemptions. The sentiment is yet to be reflected among altcoins, however, as Ethereum (ETH) and Ripple (XRP) prices still struggle amid a choppy altcoin market.\n\nAlso Read: Bitcoin Weekly Forecast: BTC price remains indecisive despite strong fundamentals\n\nBitcoin price finds strength as GBTC selling pressure wanes\n\nBitcoin (BTC) price is trading with a bullish bias, consolidating along an ascending trendline for the past week. It had fallen below critical support just a few weeks ago, slipping beneath the ascending bottom trendline in the aftermath of GBTC redemptions.\n\nThe king of cryptocurrency has found strength as GBTC outflows shrink. Specifically, GBTC selling pressure is almost over, moving from $1.8 billion to less than $200 million per day now.\n\nGBTC outflows\n\nBesides reducing outflows, the sales are being absorbed easily, with Bitfinex whales scooping up the $39,000 bottom in Bitcoin price as they bought over 7,000 BTC of spot. The absorption is also seen with growing limit bids on Coinbase.\n\nBitcoin price could restore above the $43,750 support, flipping the major ascending trendline into support.\n\nIn a highly bullish case, Bitcoin price could extend to $48,000, or a neck higher to $50,000, 15% above current levels.\n\nThe Relative Strength Index (RSI) is above the 50 midline, while the Moving Average Convergence Divergence (MACD) indicator is moving above its signal line (orange band). The position of the MACD and the Awesome Oscillator (AO) in positive territory tilts the odds further in favor of the upside.\n\nBTC/USDT 1-day chart\n\nOn the flipside, if traders book profits for the ground covered so far, Bitcoin price could drop, losing support due the minor ascending trendline. This could see BTC test the $40,726 support, or confirm the downtrend by breaching below the midline of the demand zone at $39,196.\n\nAlso Read: Bitcoin price recovers as on-chain metrics point at potential BTC rally\n\nEthereum price likely to fall 5%\n\nEthereum (ETH) price, like Bitcoin, is trading along a minor ascending trendline. However, for its case, the technical indicators are bearish, with the RSI below 50 and the MACD and AO in negative territory.\n\nWith the odds favoring the downside, Ethereum price could fall 5% to the $2,200 level, or in a dire case, into the demand zone between $2,059 and $2,118.\n\nETH/USDT 1-day chart\n\nConversely, a reentry by the bulls could see Bitcoin price foray back into the ascending channel by flipping the $2,388 blockade into support. This could set the path for a move north, with ETH reclaiming the range high of $2,717 in a highly bullish case.\n\nAlso Read: Ethereum monthly transaction count climbs to highest level since July 2022\n\nRipple price risks 7% fall\n\nRipple (XRP) price could fall 7% to the $0.4734 support with growing overhead pressure due to the confluence between the 50-day and 200-day SMAs at $0.5778 and $0.5817, respectively, as well as the 100-day SMA at $0.6009.\n\nThe RSI is also sub-50, below its signal line (yellow band) with the AO and MACD in negative territory. With the price stuck below the midline of the channel, the downside potential is gaining strength.\n\nXRP/USDT 1-day chart\n\nConversely, traders buying the dip could send Ripple price north, but the bearish thesis would only be invalidated if XRP records a decisive daily candlestick close above $0.6421. This would set the tone for an extension to the $0.7000 psychological level, 40% above current levels.\n\nAlso Read: XRP price slumps despite Ripple’s FOMO Pay announcing link between Asia and Africa"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxQd0VyTGs0UzZKZmJmbmktcnlFZ1lHWFJyOHY5RUJDM0NzRXF3SHE1VnFFSXY1MFhfYjlkakZoMUtUeU93dkt1UzFPQ2tUOENaNlU4NmdFQ01pWDUzX2ZPYThPSkhuOXl4TWlnZWFSZVg2WjkyUy11SVNTeTl4SEZZQVNn0gGHAUFVX3lxTE52X0VoV0hXMjhXWnBveVhMaEExR2c0a1NSZFlyQkR1Y0Z5RHItbmxmNzEzYXhCdDhoMC1VVVFtZzBfWFMtTEUwdXFjZG5fMlBwUWpQTGJ2bzlZRXVrbzAydk9KRDVMMEJVTUg0M211MTE2ZUZYYVR2dTRUUHRJS250TVhlRFJXcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 02 Feb 2024 08:00:00 GMT",
        "title": "How Bitcoin, Ethereum reacted to Powell’s FOMC ‘prophecy’ - AMBCrypto News",
        "content": "The price of the two cryptocurrencies fell because of Powell’s statement.\n\nBTC and ETH might continue trading sideways in the short term.\n\nMajor cryptocurrencies, including Bitcoin [BTC], and Ethereum [ETH], witnessed a slide after Federal Reserve chair Jerome Powell said he does not expect rate cuts by the next FOMC meeting scheduled for March.\n\nFOMC stands for Federal Open Market Committee. It is the body of the Federal Reserve System responsible for monetary policy in the U.S.\n\nBefore Powell’s forecast, some market participants have forecasted a possible drop in the high interest rates. But the unexpected statement sent a sonic boom throughout the market.\n\nThe chair says, “It’s not time”\n\nHowever, the predictions that rates would remain unchanged this month were in agreement with the Fed’s latest decision. According to the policy team, the standard would remain between 5.25% and 5.50%.\n\nAt press time, Bitcoin’s price has dropped by 2.12% to $42,587. Ether, on the other hand, also experienced a drawdown. The altcoin’s value, as of this writing, was $2,280, indicating a 3.98% decline.\n\nOther cryptocurrencies, including Solana [SOL] and Cardano [ADA], were also affected, reinforcing how the market was not thick-skinned to financial policies.\n\nAMBCrypto watched Powell live at the press briefing, where the chair gave reasons for the projection. According to him,\n\n“Inflation has eased notably over the past year. But it remains above our overall goal of 2%. Also, we will need to see continued evidence to build confidence that inflation is moving down sustainably down toward our goal.”\n\nBTC and ETH’s reaction to the statement underscores investors’ cautious approach to the market. Assuming Powell had hinted about rate cuts, prices would have jumped.\n\nNo party for BTC and ETH\n\nOn the daily BTC/USD timeframe, the On Balance Volume (OBV) fell. The decline shown by the indicator reflects investors’ cautious approach toward Bitcoin.\n\nIf the OBV continues to fall, then BTC might drop below $42,000 as this would indicate a lack of buying pressure.\n\nMeanwhile, the 9 EMA (blue) and 20 EMA (yellow) were almost at the same spot as BTC’s price. This position suggests consolidation in the meantime.\n\nAs such, BTC might continue trading within a range of $41.826 and $43,217.\n\nA look at the Relative Strength Index (RSI) confirmed the sentiment that Bitcoin might continue moving sideways. But if the RSI rises above 50.00, the coin might make attempts at reaching $44,000.\n\nHowever, signals from other indicators showed that the potential looked gloomy.\n\nETH’s price movement was similar to Bitcoin’s. At press time, the Accumulation/Distribution (A/D) indicator suggested that participants had slowed down on buying ETH.\n\nBut this does not imply that the altcoin was undergoing severe distribution.\n\nRead Bitcoin’s [BTC] Price Prediction 2023-2024\n\nLike BTC, the RSI on ETH’s daily chart confirmed a lack of buy orders. In a highly bullish situation, ETH might move back above $2,300.\n\nIf interest rates do not drop by March, the coin’s price might go lower."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxPQ3hpcGx2aURRWTZkaHFmc2tQclh4M2RwWlNsMnd0RWJ4UDVMN3p4RGM2RXpUWEZvekMzdlVsOWF5ZEM5bjJLX0ktb3lmSjJJOTBWYXRBVEN2VG9MakM3WkFZcG9mYk1QYUlONllpQWd3OGNTWXRuRkZaZjBkX29tR1RRUXZtWERzc1VDYXgyRTFCMDVETXZRYnlMT0hldw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 01 Feb 2024 08:00:00 GMT",
        "title": "New OTC Portal pairs available for ETH, INJ and SOL - Kraken Blog",
        "content": "Kraken OTC is pleased to announce that our RFQ system now supports new Ethereum (ETH) and Solana (SOL) non-stablecoin crypto-to-crypto pairs (an OTC Portal first!) as well as a new pair for Injective (INJ).\n\nNow available to trade via RFQ within the OTC Portal:\n\nBase asset Pair ETH BTC INJ USD SOL BTC, ETH\n\nHere’s what you need to know about ETH, INJ and SOL:\n\nEthereum (ETH) is a global, open-source platform for decentralized applications. Ethereum is a marketplace of financial services, games and apps that is trustless, decentralized and secure. ETH is the cryptocurrency powering the Ethereum network. It’s used to pay for transactions, as a store of value or peer-to-peer payment method, or as collateral to generate entirely different crypto tokens that run on Ethereum.\n\nInjective (INJ) is a decentralized exchange (DEX) that offers various features such as cross-chain margin trading, derivatives and forex futures trading. Built on the Cosmos blockchain, a Layer 2 application, Injective uses bridges to offer cross-chain capabilities for traders to trade across other networks. The exchange is operated by the INJ token, Injective’s native cryptocurrency, which is used by makers and takers to pay for transaction fees on its network.\n\nSolana (SOL) is a blockchain platform aimed at improving user scalability. Solana is a blockchain platform that aims to increase user scalability through faster transaction settlement times and a flexible infrastructure. The SOL cryptocurrency plays a key role in maintaining and operating the Solana ecosystem and is used to execute smart contracts, send transactions, and incentivize actors that support the network.\n\nWho can trade via RFQ?\n\nKraken OTC’s RFQ system is available to OTC clients. To onboard to Kraken OTC, you must be a Pro-verified Kraken client. Once this step is complete, reach out to the OTC desk to get started.\n\nExisting institutional clients can speak with their Account Manager to onboard to Kraken OTC.\n\nWhat is Kraken OTC?\n\nKraken OTC offers premium trading services to execute orders over $100,000 off the open exchange. OTC clients gain 24/7 access to deep liquidity and competitive execution and settlement services whether trading over chat or our RFQ system."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxNWER5eUhyUXN5Ukt2VnlEZU8weEFVVDlxNG82azhaLUllTFJBVGtiVW90VHBnVU8zQ21qVkFvU0hjZnliQVRXZjdlMGNrVUJuQjlIVzJkUXZzVEt6WVprSzFYaFM1UTR0TVl4TU01eHBBRGxWWjZxWlh5UkFwOWZ4YV9HWWdoUVNlOTVMb2RPbFp0NFdBTW9lQ2NFV0doSEhvY0xVdFE5dnhNeHNYYzJTVUQxTFJDWGotbDAwMjZjcTcwODBzWWJ1R0Q0ZDFBTDU3clkzYtIB2gFBVV95cUxPamM2TXc2TDFJOC1tWnhRXzhCYkxwSXV6VF9na2xYblc4X1doTi1BNmVUaEhJelZtUTJ1T05HUV91bEh0VkpGTC1Xd0QtT0RMU211bEk5c0tONVppQmp1bU1ycEdzMThnQlVXUnFUV2FydzlydE1VTkthdllSQ2NURHp4ZXJzWXFfLXc4blk5cW5MeE1iX1dRcl9iVmt3STZzcXBTcFRfS2FCZE1GZGpfWEZZZnlXckNRT2hCM2tTUHBMdHVlRlctMWNLbHc3Rk1KQTVsc0tOUExPZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 02 Feb 2024 08:00:00 GMT",
        "title": "Best Cryptocurrencies to Invest in August 2024 - The Economic Times",
        "content": "\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nAfter a rollercoaster 2023, things are looking up for the crypto market. The US Securities and Exchange Commission (SEC) recently approved the listing of spot Bitcoin ETFs from eleven different organisations, including heavyweights like BlackRock and Fidelity.The SEC approval has naturally got retail investors curious about cryptocurrencies. They are now asking: \"What do I invest in?\" This article delves into the ten most promising cryptocurrencies to invest in 2024. Established titans like Bitcoin and Ether are going to be portfolio mainstays. But rising stars like Solana and Injective are also vying for a piece of the digital future.Prepare yourself, as 2024 promises to be a profitable year for crypto investors.We take a look at the top coins and tokens to invest in 2024 below.The world’s first cryptocurrency, Bitcoin, has the largest market capitalization. Its established network, limited supply, and growing institutional adoption make it a relatively safe haven in the volatile crypto market.Bitcoin grew by 155% from the start till the end of 2023. These returns are better than anything you'd get from investing in traditional financial assets, albeit at a slightly higher risk. With the impending ETF approval, halving, and potential rate cuts from the US Fed, Bitcoin is poised to reach greater heights in 2024.The go-to platform for smart contracts and dApps, Ethereum fuels the burgeoning field of decentralised finance (DeFi). Despite intense competition from other Layer 1 blockchains, many institutional investors rely on Ethereum owing to its security and mature ecosystem.Because of this interest from institutions, we feel it’s an excellent asset for HODLing. The upcoming EIP-4844 proposal could reduce gas fees significantly on Layer 2 blockchains piggybacking on Ethereum. This would be another win for Ethereum and could further boost its value. Solana (SOL) Boasting lightning-fast transaction speeds and low fees, Solana has attracted a thriving ecosystem of DeFi and NFT projects. Its continued focus on scalability and developer experience makes it a strong contender in the high-performance blockchain space.According to data from crypto data provider CryptoSlam, NFT sales on the Solana blockchain ($366.5 million) exceeded those of Ethereum ($353.2 million) for the first time in December 2023. This strong interest in Solana from retail users. Cardano (ADA) Built with meticulous research, Cardano boasts a secure and scalable blockchain. Its focus on sustainability and smart contracts makes it a long-term player with a commitment to responsible growth.ADA is not just a speculative asset. People are exploring it for various real-world applications, including supply chain management, identity verification, and voting systems. These real-world use cases grant ADA value, making it a great addition to crypto portfolios. Polygon (MATIC) Polygon is a popular Layer-2 scaling solution for Ethereum, meaning it helps transactions on the Ethereum blockchain become significantly faster and cheaper.Other Layer-2 scaling solutions have emerged since Polygon's debut in October 2017, but it still stands tall as a popular option in DeFi. Several popular dApps like Uniswap, Curve, Chainlink, and more have integrated Polygon into their ecosystems.In the future, Polygon aims to offer its scaling solutions to other blockchains. It also plans to provide interoperability between different protocols and blockchains.Due to Polygon's successful track record and its goals to solve real-world problems, MATIC is an excellent coin to invest in.Avalanche (AVAX) is gaining popularity by challenging Ethereum with its lightning-fast transactions. In 2023, it grew by a whopping 254%, despite market ups and downs. The constant growth comes from its expanding ecosystem, new dApps, and partnerships. With low fees and scalability, it attracts users and developers looking for a faster and cheaper option than Ethereum.In the future, Avalanche aims at DeFi, NFTs, and business solutions. With a strong team and community, 2024 seems promising for AVAX. If it grabs a big share in DeFi and NFTs, AVAX could become a major player in the blockchain world. Polkadot (DOT) Think of Polkadot (DOT) as the Internet for Blockchains. It connects different blockchains, letting them share data and work together. This ‘multichain’ approach breaks down barriers and unlocks new possibilities.While 2023 wasn't a record growth year for DOT, its potential for the future is huge. Developers can build custom blockchains on Polkadot, making it ideal for everything from DeFi to healthcare.Plus, security is a top priority. Polkadot's central chain keeps everything safe and sound.With DeFi booming and NFTs making a comeback, Polkadot's interoperability could be key to their success.This Layer-1 blockchain caters to all sorts of DeFi applications, including decentralised exchanges (DEXs), prediction markets, and lending protocols – all on-chain and lightning-fast. Like Ethereum, it has excellent support for smart contracts.Injective provides plug-and-play modules that developers can use to build cutting-edge financial applications. Its token, INJ, fuels the platform, letting you vote on upgrades and potentially share in its growth.INJ's price skyrocketed towards the end of 2023, going from about $8 at the start of October to about $40 at the end of the year, a massive 5x growth! Overall, things are looking promising for Injective in 2024.Uniswap (UNI) is a decentralised exchange (DEX) where you can trade directly from your own wallet. Unlike a centralized exchange (CEX) like Binance, you keep complete control of your funds, so there's no risk of your assets being frozen.As a DEX, Uniswap also doesn't use the traditional order book model. Instead, it facilitates peer-to-peer exchange of tokens. This means that users can trade directly with each other, cutting out the middleman and reducing trading fees.UNI is the platform's native token, and it gives users a say in how Uniswap evolves. They can vote on proposed changes to the protocol, which can have a big impact on the platform's future. Cosmos (ATOM) Cosmos is unique in that it's designed to connect several blockchains to communicate seamlessly.Its potential for mainstream adoption is high, making its native token (ATOM) a valuable addition to crypto portfolios in 2024.While you may invest in your preferred cryptocurrencies individually, a better approach is to invest in crypto as an index fund. And Mudrex's Coin Sets allow you to do just that.Coin Sets are curated collections of cryptocurrencies that are grouped based on themes or as index funds. You manage your risk better by investing in a basket of cryptocurrencies as opposed to hand-picking individual coins. Gains in other assets can offset a drawdown in an individual asset.As an example, take Mudrex's Crypto Blue Chip Coin Set . It's a crypto index fund that tracks the performance of the top 5 cryptocurrencies by market capitalisation. If you want broader exposure without having to rely on heavyweights like Bitcoin and Ethereum, you might want to check out the Crypto Broad Market Index instead.Investing in cryptocurrencies requires careful consideration beyond mere hype. To make informed decisions about what to invest in, focus on these five key criteria:Dive deep into the blockchain technology underpinning the cryptocurrency. Assess its scalability, security, decentralization, and innovation potential. Are there unique mechanisms that address existing blockchain challenges? Does it offer interoperability with other platforms?Evaluating the technology helps gauge the cryptocurrency's potential for future growth and adoption.Scrutinize the team behind the project. Do they have relevant expertise and experience in blockchain development and business? Is their track record transparent and credible? Are they actively engaged with the community and responsive to feedback?A compelling use case is vital. Does cryptocurrency solve a real-world problem or offer a clear value proposition? How does it differentiate itself from existing solutions? Is there sustained demand for its functionality within its target market?If a cryptocurrency has a practical use case or two, it is more likely to succeed and have long-term value.Analyse the market demand and adoption rate for the cryptocurrency. Is there a growing user base and developer community? Are established institutions or businesses embracing its use? Has its trading volume and liquidity increased steadily?While past performance is not indicative of future results, historical price movements can offer valuable insights. Understand the factors driving both short- and long-term price fluctuations. Be wary of extreme volatility and sudden spikes, as they may suggest speculative hype rather than sustainable growth.By studying these five criteria, you can gain a deeper understanding of a cryptocurrency's potential and make informed investment decisions based on its individual strengths and weaknesses. Remember, thorough research, a diversified portfolio, and risk management are crucial in the world of crypto.Cryptocurrency investment presents both compelling opportunities and inherent risks. While the potential for high returns can be alluring, you must understand the risks of this new market. Below are some risks and considerations to think about before beginning your investing journey:Unlike traditional assets, cryptocurrencies undergo significant price fluctuations. Rapid uptrends and equally swift downturns often characterise these fluctuations. For example, Bitcoin's price dropped by almost $3,000 on January 3, and no significant news that day could've caused it!This inherent volatility carries a substantial risk of loss. We can't emphasise the need for risk management and responsible investment strategies enough.India's regulatory framework surrounding cryptocurrencies remains in flux. This is in spite of crypto investors filing taxes for the first time last fiscal year. This dynamic environment can give rise to disruptions and uncertainties, meaning you have to stay informed about evolving regulations and their potential impact on the market.Blockchain technology, while innovative, is still undergoing significant development. Technological imperfections, bugs, and vulnerabilities can lead to network disruptions, transaction delays, and even security breaches. These risks can jeopardize the value and functionality of invested assets.Where there's money to be made, there will always be malicious actors looking to exploit the gullible. And the world of cryptocurrencies isn't any different. Sophisticated phishing scams, fraudulent projects, pump and dump schemes, and unregulated exchanges pose significant threats to unwary investors.The year 2024 paints a vibrant picture for crypto enthusiasts. With the confluence of bullish signals like the Bitcoin ETF approval, Bitcoin halving, and potential Fed rate cuts, we might witness some explosive growth this year.This isn't a solo show for Bitcoin, though. Altcoins like Solana, Cardano, and Uniswap are carving their own niches, fueled by innovative technology and robust ecosystems. Meanwhile, established platforms like Ethereum and Avalanche are constantly evolving, solidifying their positions as cornerstones of the DeFi and NFT landscapes."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMi_gFBVV95cUxPT2VtWUV4b3JuVHRNRmtqX0NFR1JFNWZ1SGVOeFpFbk1Vc3dZU2xFdU9LWHhIdjdQLU80LUVOTWNfQm90bER6OUxCdWZvaVFObkdoeFVPS2xJMHdTSG4xdDVJX1VkaWtzb2I1SXZPVXAxTU5WMERvNDBCMlVyRmJpNy1lUVZrUmRteUNFSGIzMFpOOHhLZVctcXJPbFNWN2xwQUlaU05pMnBHdFNQRzY2eVJCWV9MVWFKemRFREFhd1p5b2lTVm1FeG9Tbm9tcnhlUXdNTGhkVTdWZ0Q3OUdHdUlpc25rRklINE14RzJBWHBYbmMzMHNFeUdsOGl5Z9IBgwJBVV95cUxPMlo0dV90d2g2ODRBVGZ0aXIteXVQaThMcExmLW44MGwzdGdSdUJXdFdnTlFwUVNReG0zREtLa2taZ0ZUaWxLSlcyRUxrZm43MmtYbmRTX3pCTXpTUnJ0UTBMMFluRWh6OXgzY2pGNHdUYXJjQWNWeHA5MHU3NEFOSFFmcnZWbzlBVGwtOU5DbzNKcGQ1aDJOMTJ3Umc3d202WmRlMWo2WjgtRlAyMk5qeEZPejQ3by1IdGJLOGFDX3NrQ2lJaHJVSnBaZDVKMHByaFQ0aWZmN2YxOGJDaFhrOFZwMldCa2xNcWxscHNMb2QzejZzdnJ5X2ZyVXZZOVRqanVJ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 01 Feb 2024 08:00:00 GMT",
        "title": "Cryptocurrency Price Today: Bitcoin Briefly Rises Above $43,000, Jupiter Dips Over 60% - ABP Live",
        "content": "Bitcoin (BTC), the oldest and most valued cryptocurrency in the world, briefly managed to rise above the $43,000 mark before dipping below once again early Thursday. The US Fed’s call to maintain interest rates appears to have lent a sense of stability in prices. Other top coins, including the likes of — Ethereum (ETH), Dogecoin (DOGE), Solana (SOL), Ripple (XRP), and Litecoin (LTC) — saw minor losses across the board. The SATS (1000SATS) token emerged to be the biggest gainer of the lot, with a 24-hour jump of over 5 percent. Jupiter (JUP), on the other hand, became the biggest loser, with a 24-hour dip of over 60 percent.\n\nThe global crypto market cap stood at $1.51 trillion at the time of writing, registering a 24-hour dip of 8.43 percent.\n\nBitcoin (BTC) Price Today\n\nBitcoin price stood at $42,051.28, registering a 24-hour dip of 2.05 percent, as per CoinMarketCap. According to Indian exchange WazirX, BTC price stood at Rs 37.14 lakh.\n\nEthereum (ETH) Price Today\n\nETH price stood at $2,255.67, marking a 24-hour dip of 3.65 percent at the time of writing. As per WazirX, Ethereum price in India stood at Rs 2.01 lakh.\n\nDogecoin (DOGE) Price Today\n\nDOGE registered a 24-hour dip of 1.82 percent, as per CoinMarketCap data, currently priced at $0.07864. As per WazirX, Dogecoin price in India stood at Rs 6.94.\n\nLitecoin (LTC) Price Today\n\nLitecoin saw a 24-hour dip of 2.01 percent. At the time of writing, it was trading at $66.47. LTC price in India stood at Rs 5,828.\n\nRipple (XRP) Price Today\n\nXRP price stood at $0.4974, seeing a 24-hour loss of 2.59 percent. As per WazirX, Ripple price stood at Rs 44.10.\n\nSolana (SOL) Price Today\n\nSolana price stood at $93.90, marking a 24-hour dip of 7.24 percent. As per WazirX, SOL price in India stood at Rs 8,800.09.\n\nTop Crypto Gainers Today (February 1)\n\nAs per CoinMarketCap data, here are the top five crypto gainers over the past 24 hours:\n\nSATS (1000SATS)\n\nPrice: $0.0005251\n\n24-hour gain: 5.56 percent\n\nMonero (XMR)\n\nPrice: $167.14\n\n24-hour gain: 4.44 percent\n\nORDI (ORDI)\n\nPrice: $61.65\n\n24-hour gain: 1.89 percent\n\nChiliz (CHZ)\n\nPrice: $0.1017\n\n24-hour gain: 1.52 percent\n\nRonin (RON)\n\nPrice: $2.76\n\n24-hour gain: 1.45 percent\n\nTop Crypto Losers Today (February 1)\n\nAs per CoinMarketCap data, here are the top five crypto losers over the past 24 hours:\n\nJupiter (JUP)\n\nPrice: $0.6343\n\n24-hour loss: 60.33 percent\n\nSei (SEI)\n\nPrice: $0.6222\n\n24-hour loss: 12.87 percent\n\nManta Network (MANTA)\n\nPrice: $2.95\n\n24-hour loss: 12.26 percent\n\nCelestia (TIA)\n\nPrice: $15.88\n\n24-hour loss: 8.83 percent\n\nOKB (OKB)\n\nPrice: $47.48\n\n24-hour loss: 8.77 percent\n\nWhat Crypto Exchanges Are Saying About Current Market Scenario\n\nMudrex co-founder and CEO Edul Patel told ABP Live, “Bitcoin experienced a decline below the $43,000 threshold following the US Federal Reserve's decision to maintain interest rates, fueled by investor expectations of a possible rate cut in March. Despite a brief surge, Bitcoin couldn't sustain the momentum. Despite attempts by bears to push the price down, bulls defended the territory above $42,000. Ethereum is trading in line with Bitcoin, and there's a likelihood it will oscillate between $2,100 and $2,400 in the near future.”\n\nCoinSwitch Markets Desk noted, “Bitcoin is headed for a third consecutive red day, trading near the $42k mark even as the Federal Reserve of the US kept the interest rates unchanged — exactly as per the expectation of the market. However, after Fed Chair Jerome Powell’s comments yesterday, several big analysts like Goldman Sachs are now predicting that the Fed will start cutting rates from May this year instead of March, which could be a big reason why bears have taken some control in shorter time frames. In larger time frames, however, the BTC structure remains bullish and the current trend line supports remain at $39.3k.”\n\nRajagopal Menon, Vice President, WazirX, said, “The Federal Reserve's decision to maintain interest rates thwarted expectations of cuts, impacting Bitcoin's valuation, now potentially encountering resistance at $40,000. The next hurdle for Bitcoin lies at $40,000 before a potential easing of selling pressure. A surge in demand, driven by reduced supply through BTC ETF access, could be the forthcoming catalyst. Currently, Bitcoin has registered a 2.25% decline in the last 24 hours, settling at $41,998.72, with a 4.79% gain over the past week. Ethereum trades at $2,257.09, reflecting a 3.59% drop in 24 hours but a 1.06% increase over the week. Bitcoin's technical indicators present a mixed outlook. Moving averages signal a \"Buy,\" while the Ichimoku Base Line remains neutral. RSI at 49 suggests a neutral stance, with Stochastic %K at 75 and ADX at 16 reflecting neutrality. MACD at -173 indicates a \"Buy,\" while Stochastic RSI and William's Percentage suggest a neutral outlook.”\n\nSathvik Vishwanath, CEO and co-founder of Unocoin, said, “Bitcoin's recent drop below $43,000 followed a hawkish stance by Federal Reserve Chairman Jerome Powell, suggesting a March rate cut is unlikely. This stance prompted a market reevaluation, reducing the likelihood of an imminent rate cut. However, the broader economic environment favours Bitcoin in 2024 with expectations of a possible Fed rate cut, which traditionally boosts cryptocurrencies. Amid short-term fluctuations, investor confidence persists, supported by several optimistic factors. The emergence of spot bitcoin ETFs, along with massive demand for new offerings from BlackRock and Fidelity, is easing selling pressures. Additionally, expectations surrounding the April halving of Bitcoin and potential supportive US political and fiscal dynamics add to the bullish outlook. Despite the near-term uncertainty, Bitcoin's price trajectory is set for a potential rally to the low $50,000s, outweighing the prospect of a dip to the low $30,000s in the foreseeable future.”\n\nShivam Thakral, CEO, BuyUcoin, noted, \"The Crypto market witnessed a fresh decline due to the unchanged interest rates by the Fed. The bullish momentum marked by decrease in grayscale sales and increase in BTC ETF offerings eventually led to a downward trend caused by the unchanged interest levels which represent the 2023 high levels. The Altcoin market also took a downturn which could change unlesss Ethereum breaches $2500 amid other positive macroeconomic factors.\"\n\nCoinDCX Research Team told ABP Live, “Over the past 24 hours, the crypto market experienced a shift from positive to slightly bearish conditions, triggered by the Federal Reserve's decision to maintain unchanged interest rates. BTC, positioned within its range, is currently situated in the middle, with the rising dominance of BTC causing declines in most of the altcoins. ETH reflects a parallel situation, trading within its established range. Additionally, the market sentiment is influenced by the regular movement of funds through ETFs, contributing to the overall market dynamics.”\n\nSubscribe And Follow ABP Live On Telegram: t.me/officialabplive\n\nDisclaimer: Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Cryptocurrency is not a legal tender and is subject to market risks. Readers are advised to seek expert advice and read offer document(s) along with related important literature on the subject carefully before making any kind of investment whatsoever. Cryptocurrency market predictions are speculative and any investment made shall be at the sole cost and risk of the readers."
    }
]