[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE80QzNocHZFLWttYlV6Rk1qVHpSNUJDZDItcGJIcTRnNUZhZF9QNUNhQzJkYWhzeUs1WjMxYnh2U3VWRnRYcVBrWU91T1JEbFFRck5EN3hHMXB3a1NUR3QtS2FuZWtFU213cm50N1o2RnFqSmlOWno5Z0ZPZXhaZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Mar 2024 07:00:00 GMT",
        "title": "What Is the Ethereum Roadmap: Upgrades in 2024 and Beyond - Ledger",
        "content": "What Is the Ethereum Roadmap: Upgrades in 2024 and Beyond\n\nBy Gaurav Roy\n\nBeginner\n\nSHARE\n\nKEY TAKEAWAYS: — The Ethereum network ensures constant progress through its roadmap, allowing it to improve the protocol while addressing new challenges and developments in crypto.\n\n\n\n— After the Merge and Shanghai upgrade, the Ethereum roadmap has been updated to make the network scalable, resilient, and more secure.\n\n\n\n— The next upgrade Ethereum will undergo is the Prague/Electra upgrade, which is not yet scheduled.\n\nAs the pioneering network for smart contracts, Ethereum has enabled an entire ecosystem to come to life. It is home to the majority of today’s decentralized applications (dApps) and powers an entire sector of decentralized financial services that host tens of billions of dollars.\n\nSince its founding in 2015, Ethereum price has grown tremendously, winning the support of individuals, communities, and businesses across the globe. Still, the network has some growing to do before it can gain the acceptance of a mainstream audience.\n\nIndeed, for Ethereum to become accessible, affordable, and resilient enough to be adopted by the masses, there are several challenges that it must still overcome. And mapping out those challenges, and how the network might solve them, is precisely why the Ethereum roadmap exists.\n\nBut what exactly are the challenges facing Ethereum? And how will its planned upgrades help to prepare it for mass adoption? Let’s explore what the future holds for the world’s second-largest cryptocurrency.\n\nWhat Is the Ethereum Roadmap For?\n\nFor all of Ethereum’s success as a global coordination platform, it has some shortcomings. Most notably, the network suffers from slow transaction speeds and high fees during times of high congestion.\n\nThis is arguably Ethereum’s biggest roadblock when it comes to onboarding more users. After all, if Ethereum actually reached something close to mainstream adoption in its current state, it would likely be unreasonably slow and expensive. This is, generally speaking, what people mean when they talk about the scalability of a blockchain. It’s the idea that the network needs to be able to scale up and accommodate many more users while still functioning well.\n\nOf course, tackling Ethereum’s scalability challenges brings about what is known as the blockchain trilemma. This phrase was coined by Ethereum co-founder, Vitalik Buterin, and refers to the concept that, while there are three key elements in a blockchain – decentralization, scalability, and security – you can only optimize for two of them. In other words, you can have a fully decentralized and highly secure blockchain, but it won’t be scalable. And so on and so on.\n\nAs a result of this, Ethereum has to remain highly adaptable as it continues to address its challenges while pursuing an optimal balance of decentralization, scalability, and security. Not to mention that, with the hyper-innovative, constantly changing nature of crypto, Ethereum has to be able to integrate new features, assets, and applications as they appear.\n\nThere needs to be a way to keep track of all the upgrades that Ethereum needs, which is why the roadmap exists. It’s essentially a list of all the specific changes necessary to make the network cheaper and easier to use, more secure, and futureproof.\n\nHow Are Ethereum Upgrades Decided On?\n\nAs a decentralized network and open-source network, Ethereum is not controlled by a single entity. The upgrades proposed in the roadmap generally come from Ethereum researchers and developers, but essentially anyone can offer suggestions to upgrade the protocol.\n\nBasically, any interested person can propose a change by creating an Ethereum Improvement Proposal (EIP), which outlines the technical specifications for the proposed changes. The community of Ethereum developers and researchers then reviews, debates, and potentially implements the EIP. It’s important to note that EIPs generally grow out of discussions on major Ethereum forums or the EthR&D Discord that then mature into specific ideas for improvements.\n\nAnother key point about the roadmap is that it is subject to change. The points on the roadmap can evolve as new information, ideas, and technologies become available.\n\nFor example, the roadmap previously laid out plans to scale the network through sharding, a method that involves splitting up the blockchain so subsets of validators handle only a portion of the total data. This is no longer a part of the roadmap now as danksharding, which integrates ‘blobs’ of data into Ethereum blocks, has replaced the earlier proposed sharding approach.\n\nWhat Changes Are Coming to Ethereum?\n\nScalability\n\nAs previously mentioned, scalability is a major issue for Ethereum to address. Thus, the Ethereum roadmap features several planned upgrades to that end.\n\nDanksharding\n\nDanksharding is the current plan for making Ethereum transactions much cheaper and faster and it revolves around Layer 2 solutions, specifically blockchain rollups.\n\nTo sum up, Danksharding will enable the Ethereum network to process the bundled transactions that come from layer two roll ups without having to store all of their data permanently.\n\nSingle-Slot Finality\n\nCurrently, it takes about 15 minutes for an Ethereum block to finalize. The introduction of single-slot finality (SSF) aims to make the block validation process more efficient. Under the SSF mechanism, blocks can be proposed and finalized in the same slot, significantly decreasing the time it takes to finalize a block.\n\nVerkle Trees\n\nA blend of the two concepts “Vector commitment” and “Merkle Trees,” Verkle trees serve as a data structure to upgrade nodes. Notably, Verkle Trees make it possible for Ethereum to use stateless clients. These stateless clients ultimately help scalability as they only need a tiny amount of storage space to be able to verify new blocks.\n\nUser Experience\n\nAs crypto gains mainstream adoption, blockchains must offer better UX design and customer experience to appeal to the non-technical masses. This is the key to bringing the technology to more users and advancing the next generation of decentralized applications.\n\nThis need for an improved user experience is partly being addressed by a group of upgrades, collectively referred to as account abstraction. This class of upgrades will support smart contracts natively on Ethereum. Currently, smart contract interactions can only happen through externally owned accounts (EOAs).\n\nAccount abstraction will bring about many exciting features natively to Ethereum, such as the ability to batch transactions together, recover your account if you lose the keys, or have someone else pay for your gas.\n\nSecurity\n\nEvery day, attackers try to find new ways to exploit the Ethereum network and its users. Ethereum is exploring the following features to provide top-notch security and keep attackers at bay.\n\nProposer-Builder Separation (PBS)\n\nPBS splits the block-building and block-proposal tasks among different validators. For each slot, block builders create blocks and present them to the block proposer, who can then choose the most profitable block without seeing its contents. The proposer also has to pay a fee to the block builder before sending the block to its peers. This arrangement prevents transaction censorship, establishes a fairer consensus mechanism, and facilitates the Danksharding upgrade.\n\nClever Cryptography\n\nThe proof-of-stake (PoS) based consensus mechanism currently makes the list of upcoming block proposers public, making it possible to map their IP addresses. This makes them vulnerable to attacks such as a DOS attack. Clever cryptography here makes sure the identity of the current block proposer is not made public and protects them.\n\nWhere are we on the Ethereum Roadmap so far?\n\nOver the last nine years, Ethereum has gone through several upgrades to enhance its network, with the last two major upgrades being the Merge and Shanghai.\n\nWhat Was the Merge?\n\nActivated on Sept. 15, 2022, the Merge was a way to complete Ethereum’s shift from the energy-intensive Proof-of-Work (PoW) consensus mechanism to the more efficient Proof-of-Stake (PoS), where validators are randomly selected based on the total amount and duration of their ETH staking.\n\nIn December 2020, developers launched the Beacon Chain as a basic PoS-based version running parallel to the regular Ethereum mainnet. They used it to test reconfigurations and new features safely.\n\nJust under two years later in September 2022, the integration of both the Beacon Chain and the mainnet marked Ethereum’s official adoption of the PoS consensus mechanism across its ecosystem.\n\nWhat was the Shanghai Upgrade?\n\nAfter the Merge, the Ethereum Shanghai Upgrade, also known as the Shapella upgrade, was a major step in finalizing Ethereum’s move from PoW to PoS. While this planned hard fork of the protocol opened the door to new developments, it also unlocked the ability to withdraw staked ETH from the Beacon Chain.\n\nUp until the Shanghai upgrade, those who staked their ETH on the Beacon Chain were unable to withdraw their locked-up ETH and the rewards earned in the process. However, following the Shanghai upgrade on April 12, 2023, validators could finally access their ETH holdings and cash out their rewards.\n\nWhat was the Dencun Upgrade?\n\nThe Dencun Upgrade, one of the major upgrades, went live on March 13th. It’s designed to reduce costs for layer-2 transactions and enhance data availability on Ethereum. Notably, this upgrade introduces “proto-danksharding”, the first step to scaling the network through danksharding.\n\nProto-danksharding, or EIP-4844, introduced data “blobs”—an acronym for ‘Binary Large Objects.’ These data blobs can be sent and attached to blocks, aiming to minimize the data stored permanently on Ethereum.\n\nCurrently, layer-2 scaling solution rollups post their transactions in CALLDATA, which is costly because their data remains on the chain indefinitely. In contrast, the data in blobs are automatically deleted after a fixed period, reducing data storage costs and thus lowering transaction fees for users.\n\nWhat’s next on the Ethereum Roadmap?\n\nNow, the Ethereum network is preparing for more upgrades to advance its capabilities. Here’s what’s next in line for the blockchain:\n\nPrague/Electra Upgrade\n\nOnce implemented, the Dencun upgrade will allow developers to focus on the next update, the Prague/Electra upgrade (Pralectra). Interestingly, there is still a debate among core Ethereum devs about what Pralectra will entail.\n\nOn one hand, it could look like several smaller EIPs focused on adding new features to the network. For example, one of the major proposals for this upgrade is EIP-6110, which would improve Ethereum’s security and stability by changing the way that the network processes its validators’ deposits.\n\nOtherwise, Pralectra could end up being a major protocol upgrade that would add Verkle Trees to the blockchain’s execution layer. As previously mentioned, Verkle Trees are an important milestone in the overall Ethereum roadmap, important for increasing its scalability.\n\nWhile the specific items that Prague/Electra will center on are still being decided, this upgrade will undoubtedly make further improvements to the network’s performance, security, and usability.\n\nThe Future of Ethereum\n\nOver the past decade, cryptocurrency has emerged as a revolutionary answer to the traditional financial world by offering a decentralized, permissionless, and secure alternative to traditional banking systems. In the same spirit, Ethereum has brought forth a wave of innovation in global decentralization. With its advanced technology, growing ecosystem, and constant evolution, the future of the pioneering smart contract chain is bright indeed.\n\nAnd it’s a future that you can be a part of! By getting yourself a Ledger Ethereum wallet, you unlock all that the Ethereum ecosystem has to offer, all while enjoying the power and security of self-custody.\n\nSo what are you waiting for? Take your place at the forefront of the Ethereum evolution and explore the bleeding edge of innovation in the decentralized world."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE1FX24xWUFDTEo1V2ROd0xHSEJ2MDlNNDU0Mml3OXcydElaTE1UcEVZOV9kT2hmbFk2ekUxWmFmZ1drTDY2eGJjTnpEekpVMnNCcmdnNzBuRmtWczlCNDhud3J1aU5RYmJMTWFXeTBUYm9KZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Mar 2024 17:15:45 GMT",
        "title": "It’s cheaper to swap on layer-2s than on Ethereum, Uniswap research finds - Blockworks",
        "content": "A recent paper by Austin Adams, a researcher at Uniswap Labs, contends that swapping and liquidity provisions on layer-2 networks are significantly cheaper than on Ethereum’s mainnet.\n\nAccording to the paper, chains like Arbitrum created over three times more liquidity positions this past year than Ethereum.\n\nThe report further shows that, when looking at USDC/ETH pools, 97.5% of swappers with trades under $125,000 did better on layer-2s than on Ethereum mainnet.\n\nRead more: Uniswap releases new tools for swappers\n\nThis is likely because retail swappers, with trades under $125,000, are much more likely to benefit from the lower gas costs and higher liquidity concentration on layer-2s than the mainnet.\n\nIt is worth noting that Ethereum is responsible for only around 25% of the total transaction count but over 60% of the volume — demonstrating that, despite boasting higher transaction volumes, network activity is still predominantly on layer-2s.\n\nAdditionally, layer-2s often offer shorter block times, or the time it takes the network to produce a new block. On Ethereum today, the average block time is roughly 12 seconds. On Arbitrum, on the other hand, the average block time is around 0.26 seconds.\n\nRead more: Cheatsheet: Ethereum on track to burn $10B ETH over next year\n\nThe shorter the block time, the less opportunity there would be for the market price of an asset to move, meaning that arbitrage attempts will likely not be as profitable.\n\nLess successful arbitrage attempts are a good thing for liquidity providers, who are making 20% more in returns from arbitrage on layer-2s than they are on mainnet, the paper shows.\n\nAlthough there are significant benefits for users to trade on layer-2s, the paper does note drawbacks. One primary concern is the centralized sequencer.\n\nRead more: ‘Shared Sequencing’ could help unite blockchain rollups\n\nThe paper notes that many existing rollups today still operate under one centralized sequencer. This sequencer could take advantage of the situation by reordering transactions to maximize MEV profits for themselves.\n\nAdditionally, optimistic rollups today do not have decentralized fraud proofs, which are necessary to correct sequencer errors.\n\nRead more: So your layer-2 is ‘secured by Ethereum’ — what does that mean?\n\nFinally, there are over 40 layer-2 ecosystems present today. The proliferation of these networks means further liquidity fragmentation, as they cannot trustlessly speak to one another in real time. This means that they will need to rely on bridging infrastructure, which is both costly and time-consuming.\n\nThe developers of layer-2 networks are working to address these concerns. Optimism recently revealed a permissionless fault-proof system, while shared sequencer networks like Espresso have explored ways to diversify sequencers for rollups.\n\n“For decentralized markets to fulfill their full potential, aggregate trading costs must continue to decline and user experience must continue to improve,” Adams wrote. “We believe that the studied generalized layer-2s still have many benefits that users can utilize today, and any future improvements will only continue to benefit the trading experience.”\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMihwJBVV95cUxNTjlQejROV1pRY0lWa3pWdlRjVERKd0dUOG1fU2lQZXAzSGxJbFFodTlTcU5fRHY2aWN2Ym16enpsclZfSlZKMlFSZjR2eGVTUVNDQkpTbndsd3FoblhyLW1HM3dSUXdsX1NOS3Z5WEoyR3JMTVU4SWdVblNPR2NPWnJBaVpUWGxuSnZmZ1lyUU9pdDhjV2ZOOXRFcXY3NzZzNjBXU2EyUGRQbzFTeVh4R2tfV2tLM3RBbE5iek1lOEd6bkFfSTBtaV8ycXp2SmVfNENITTJULTY1Ni0tU2tIdkNxYWYteU52YWtqWkNpRXJtVU1YNTB5dzdUeTliMWZqTUVfdG0xSQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Mar 2024 07:00:00 GMT",
        "title": "Use AWS Nitro Enclaves to build Cubist CubeSigner, a secure and highly reliable key management platform for Ethereum validators and beyond - AWS Blog",
        "content": "Validators are the fundamental building blocks of proof-of-stake (PoS) blockchain protocols like Ethereum. They maintain the history of the chain and run the consensus protocol that makes it possible to implement complex decentralized applications—from decentralized finance applications to NFT collectibles. To join the protocol, validators provide assets as collateral, which ensures they behave correctly in driving consensus. Unfortunately, because the protocol doesn’t distinguish between malicious validators and honest mistakes, operational mistakes and bugs in validator client software have and continue to put assets at risk. This results in small economic penalties in the best case scenario and total loss of funds in the worst case.\n\nIn this post, we describe the high-level architecture of a secure key management platform designed to protect Ethereum validator operators from insider threats, validator compromise, operational mistakes, and client bugs. We cover the following topics:\n\nThe challenges of running Ethereum validators and the associated security and slashing risks.\n\nThe idea of tackling these challenges using a remote key management solution and the underlying goals a key manager must be built around to meaningfully reduce risk.\n\nThe high-level design of Cubist’s CubeSigner, a secure key management platform built on top of AWS Nitro Enclaves. CubeSigner supports staking and other applications, from end-user wallets to trading to key management for teams and operations.\n\nOperational traps and pitfalls when running Ethereum validators\n\nThe Ethereum PoS protocol is a consensus protocol run across hundreds of thousands of validators. Every few seconds, validators run Ethereum transactions and, if the results of running these transactions agree with state changes proposed by a randomly chosen validator, they add these transactions to the blockchain and attest to this by signing validation messages. To incentivize validators to honestly report the state of the chain, the protocol requires them to put 32 ETH at stake. If validators behave as expected, (for example, by not manipulating transactions or lying about the state of the chain), they earn a reward on their staked assets. If they don’t, they lose some of this stake.\n\nIf validators are caught manipulating the state of the chain, they are penalized for putting the network’s safety at risk through slashing. Getting slashed means losing a significant amount of stake and being ejected from the protocol. To a lesser degree, validators are also punished if they go offline or sign very slowly, because this puts the protocol’s availability at risk.\n\nUnfortunately, validator mistakes are indistinguishable from malicious behavior. If a validator provides two conflicting reports on the state of the blockchain, it’s impossible to tell if the conflict resulted from intentional misbehavior or a bug in the validator software. As a result, operators who make security, correctness, or performance mistakes can suffer direct financial loss due to slashing. There are serious challenges in preventing each kind of mistake:\n\nSecurity – A single validator staking key typically protects 32 ETH (at the time of writing, roughly $80,000 USD). However, these valuable validator staking keys can’t be kept in cold storage because they must sign validation messages every few minutes. As a consequence, node operators have to protect hot keys from system breaches. This is especially hard considering the complex environment of open source validator clients, the operational requirements to keep nodes alive 24/7, and the potential of insider threat vectors like rogue operators and social engineering. Our goal – Create a key manager that prevents attackers or malicious insiders from stealing or misusing secret signing keys.\n\n– A single validator staking key typically protects 32 ETH (at the time of writing, roughly $80,000 USD). However, these valuable validator staking keys can’t be kept in cold storage because they must sign validation messages every few minutes. As a consequence, node operators have to protect hot keys from system breaches. This is especially hard considering the complex environment of open source validator clients, the operational requirements to keep nodes alive 24/7, and the potential of insider threat vectors like rogue operators and social engineering. Correctness – Validators that sign two different, conflicting messages are deemed dishonest and are slashed, even if the conflicting signatures were a genuine mistake. In the past, honest operators have been slashed because of buggy validator client software, errors migrating validators across machines, and mistakes updating validator software. Our goal – Create a key manager that protects operators from slashing and ensures correct behavior according to the Beacon chain protocol specifications.\n\n– Validators that sign two different, conflicting messages are deemed dishonest and are slashed, even if the conflicting signatures were a genuine mistake. In the past, honest operators have been slashed because of buggy validator client software, errors migrating validators across machines, and mistakes updating validator software. Availability – Validators that don’t sign or sign too slowly (for example, don’t respond with the 12-second slot time) get reduced financial rewards or don’t get paid at all. As a result, node operators design their solutions to be highly available and reliable, and to respond with low latency (typically setting an upper bound of 500 milliseconds for signing). Our goal – Create a key manager that helps operators achieve these latency, reliability, and availability goals.\n\n– Validators that don’t sign or sign too slowly (for example, don’t respond with the 12-second slot time) get reduced financial rewards or don’t get paid at all. As a result, node operators design their solutions to be highly available and reliable, and to respond with low latency (typically setting an upper bound of 500 milliseconds for signing).\n\nRemote signing reduces risk due to bugs and operational mistakes\n\nTo participate in the Ethereum PoS Beacon chain, node operators use a validator client like Lighthouse or Prysm. The validator client contains any number of validator key pairs. Each pair corresponds to a validator: the public key is the validator’s identity, and the secret key is what the validator client uses to sign messages on behalf of the validator. The validator client then broadcasts these signed messages to the Beacon chain network, essentially asserting the validator’s view of the state of the chain.\n\nValidator clients can store validator keys on their machines and sign locally, or they can use a remote signer. A remote signer stores keys remotely and exposes a signing API to the validator client. At each epoch, the validator client makes a signing request to the remote signer, and the signer sends back a signed validation message. Although network latency makes remote signing slower than local signing due to the additional network round trip, operators use remote signers for many reasons, including:\n\nSecurity – By using a remote signer, the validator keys can be isolated from: The validator client – This interfaces with the untrusted world—other Beacon chain nodes—and runs untrusted Ethereum Virtual Machine (EVM) code. Insider threats – These include the operators keeping the nodes up and running, who don’t need access to the validator secret keys to do their jobs.\n\n– By using a remote signer, the validator keys can be isolated from: Correctness – Using a remote signer makes it possible to implement a reference monitor—by coupling the signer with an anti-slashing database—that ensures that a key never signs messages that could result in slashing\n\n– Using a remote signer makes it possible to implement a reference monitor—by coupling the signer with an anti-slashing database—that ensures that a key never signs messages that could result in slashing Availability – Using a remote signer that handles all validator keys makes it possible for node operators to automatically scale the validator clients and spin up new ones when they crash\n\nThe remote signer must be designed with these properties in mind—simply using an off-the-shelf signer like Web3Signer doesn’t give you these properties. For example, the remote signer must restrict who has access to keys—this means restricting access to only authorized users (and validator clients) and sealing the keys to the signer itself—and what they can do with the keys. Otherwise, a breach or insider threat can turn into key theft. The remote signer must itself be highly available and fault-tolerant, and it must use a global, highly available, anti-slashing database; otherwise, signer or OS updates, machine failures, or network interruptions could result in slashing events. Finally, although the remote signer doesn’t need to be as fast as local (unsafe) signing, the latency of the remote signer does matter: if it’s too slow (typically anything over a second), the validator will be late signing messages and lose the operator money.\n\nIn the following sections, we explain in detail how we achieved the goal of security, correctness, and availability by implementing our Nitro Enclaves-based CubeSigner remote signing solution.\n\nCubist CubeSigner – Architecture overview\n\nTo address the correctness, security, and performance and reliability challenges from the previous section, we built CubeSigner, a new remote signing service that builds on AWS Key Management Service (AWS KMS), Amazon DynamoDB, and Nitro Enclaves.\n\nAt a high level, to process a validation message from a validator client, the signer completes the following steps:\n\nAccept the validation message via an HTTP interface based on Amazon API Gateway. Checks if that message is slashable using a signing history stored in DynamoDB. Signs the message—as long as it’s non-slashable—using keys secured by AWS KMS and Nitro Enclaves.\n\nThe following diagram illustrates the solution architecture.\n\nIn the following sections, we walk through these three steps in detail.\n\nAuthenticated, high-level signing API\n\nThe signer needs to expose an API that validator clients like Lighthouse and Prysm can use out of the box. Unlike the AWS KMS API, which exposes a simple but low-level signing endpoint, this API must handle high-level validator messages specific to the Ethereum Beacon chain. This high-level API is essential because it can enforce an anti-slashing policy on validator messages based on their contents. If the API instead ingested and signed raw hashes of messages, it would have no way to determine whether a given message was slashable.\n\nIn addition to preventing slashing, this high-level API also needs to ensure that validation requests are from authenticated validator clients—otherwise, compromising a single client would mean compromising all validator clients and all keys. CubeSigner goes a step further, using authentication with fine-grained scopes. A scope restricts an authenticated session so that it can only perform certain actions (for example, validation). By only giving validator clients the validation scope, node operators can prevent those validators from, for example, signing exit messages and exiting the validation protocol. This stops operators from accidentally exiting their validators, and protects them from attackers trying to exit on their behalf (costing rewards).\n\nCubeSigner uses API Gateway with AWS Lambda authorizers to implement a custom authorization scheme that determines the caller’s identity. Each authorized signing request is then sent to CubeSigner’s Amazon Elastic Compute Cloud (Amazon EC2) instances, which first check that the authorized scopes allow the request. Then, the signer computes the message signing root hash, applies the anti-slashing policy to ensure that signing the message (hash) won’t result in a slashable offense, and signs it, returning the signature back to the validator client. Next, we discuss anti-slashing and signing itself.\n\nAnti-slashing\n\nCubeSigner implements anti-slashing in the second tier—the policy engine. After authorizing a signing request, CubeSigner applies several policies, including built-in anti-slashing for Ethereum. The anti-slashing policy follows EIP-3076 and ensures that a validator never signs messages that would disagree with the chain history that the validator has already committed to, which means that the policy requires a saving state. CubeSigner enforces this policy using DynamoDB as its database. It atomically and conditionally records the messages it signs for every validator key, ensuring, for example, that the signer only produces a single signature for any particular slot number.\n\nDynamoDB is a fully managed, serverless, key-value NoSQL database designed to run high-performance applications at any scale. DynamoDB offers built-in security, continuous backups, automated multi-Region replication, in-memory caching, and data import and export tools. Availability and consistent performance are particularly critical when running blockchain validators because downtime, latencies, or data inconsistencies can directly result in financial losses. Given these requirements, DynamoDB is well suited because of its consistent single-digit millisecond performance and up to 99.999% availability. For additional information on DynamoDB performance, costs, and scalability features, refer to Amazon DynamoDB features.\n\nSafe signing\n\nThe third tier is the low-level signer itself—the CubeSigner virtual hardware security module (vHSM). This tier builds on AWS KMS to sign validation messages in HSMs, where keys are safe from attackers.\n\nHSMs and AWS KMS\n\nIn security-sensitive business areas such as banking or domain certificate management, it’s common to outsource key management-related tasks (for example, key storage or signing) to HSMs. HSMs consist of purpose-built hardware that ties cryptographic secrets to physical hardware, which makes them very tough to steal. Key extractions attacks on standard HSMs, for example, require a laboratory with an electron microscope—otherwise, the HSM self-destruct circuit triggers, because it detects someone trying to steal keying material.\n\nUsing HSMs on their own is relatively difficult, however. Accessing them from within applications written in high-level languages typically requires a vendor-specific SDK, and the application itself needs to adhere to the PKCS11 API standard. AWS provides an accessible, HSM-based key management service called AWS KMS. AWS KMS is a fully managed service that lets you create and control cryptographic keys protected by HSMs classified at the FIPS 140-2 Security Level 3. Furthermore, it is accessible via the standard AWS SDK (for example, aws-sdk-kms for Rust).\n\nWhy not use AWS KMS on its own\n\nUsing AWS KMS alone is not enough to build a secure key manager for validators. The first problem is mechanical: Ethereum validators must sign using the Boneh-Lynn-Shacham (BLS) signature scheme, but HSMs don’t yet support BLS because of regulatory challenges aligning with the National Institute of Standards and Technology (NIST). HSMs primarily focus on providing cryptographic signature schemes that are more ubiquitous outside the blockchain industry, namely RSA and Elliptic Curve Digital Signature Algorithm (ECDSA). Extending support for newer signature schemes usually requires low-level firmware upgrades of the HSM itself.\n\nEven if HSMs could produce BLS signatures, we would encounter a second set of problems: latency and throughput. Ethereum node operators run hundreds to thousands of validators, all of which must sign in under roughly a second (accounting for the actual cryptographic operation and network round trip). Most HSMs aren’t optimized for batching public key cryptography operations (for example, the compound latencies in KMS for sending 100s of ECDSA signing operations would exceed the one second limit). Furthermore, HSMs are typically throughput limited (per default, AWS KMS can process 300 elliptic curve asymmetric operations per second). By combining AWS KMS HSMs with Nitro Enclaves, you can implement a vHSM that overcomes these problems while preserving security guarantees.\n\nNitro Enclaves are separate, hardened, and highly constrained virtual machines. The AWS Nitro System, which is a combination of dedicated hardware and lightweight hypervisor, provides features such as strong isolation, hardware generated entropy via the Nitro Security Module, and cryptographic attestation—allowing you to verify the enclave’s identity and that only authorized code is running in the enclave.\n\nHow CubeSigner uses Nitro Enclaves with AWS KMS\n\nThe CubeSigner vHSM implements core signature schemes like BLS in software and runs this code in Nitro Enclaves. This lets it support arbitrary signature schemes and sign orders of magnitude faster than an HSM.\n\nThe vHSM encrypts all signing keys using an AWS KMS-based key wrapping key; whenever it gets a request to sign a transaction, it pulls the encrypted signing key and the key wrapping key into the enclave, decrypts the signing key, signs the transaction, and returns it to the user. Signing in the vHSM is fast enough for validating without penalty (for example, is well under the 500ms target even accounting for network latency). This is because:\n\nSigning a message requires a single signing key decryption, and HSMs are well-optimized for symmetric cryptographic operations. AWS KMS, for example, by default runs up to 50,000 combined symmetric encrypt/decrypt operations per second.\n\nNitro Enclaves can do asymmetric cryptographic operations (for example, produce the signature) at native speeds.\n\nCubeSigner stores all encrypted signing keys—in our example, BLS validator keys, but in general keys for any signature scheme—in DynamoDB. This allows us to replicate keys, back up keys, and use DynamoDB for scale and performance.\n\nThe key wrapping keys are stored and managed using AWS KMS, with one key wrapping key per node operator. This key is sealed to the vHSM in the enclave and made inaccessible to the AWS root user, which means that no one can use or extract the key wrapping key. Sealing a KMS key to an enclave is an extremely powerful primitive. It guarantees that the vHSM is the only component that can decrypt the operator’s signing keys, which makes it possible for us to implement hardware abstractions like the HSM in software.\n\nBecause only the code in the enclave can access secret keys, keeping keys safe reduces to keeping enclave code safe. To this end, that code is has the following features:\n\nWritten in Rust – We wrote the singer in Rust because it gives us low-level control over how the code handles secrets, so we can avoid leaking secrets in memory or through side channels. Rust also makes it straightforward to use verification techniques for proving the safety of the code running in the enclave.\n\n– We wrote the singer in Rust because it gives us low-level control over how the code handles secrets, so we can avoid leaking secrets in memory or through side channels. Rust also makes it straightforward to use verification techniques for proving the safety of the code running in the enclave. Minimal – We keep dependencies in check with cargo vet, and using Rust protects us from massive runtime systems (for example, the JVM), complex just-in-time compilers (as in JavaScript engines), and their resulting huge supply chains.\n\n– We keep dependencies in check with cargo vet, and using Rust protects us from massive runtime systems (for example, the JVM), complex just-in-time compilers (as in JavaScript engines), and their resulting huge supply chains. Least privileged – The interface to the code running in the enclave is its attack surface. Our vHSM implements a tiny, well-typed interface using the vsock communication channel—unlike other signers, which simply proxy arbitrary network requests across the enclave boundary.\n\n– The interface to the code running in the enclave is its attack surface. Our vHSM implements a tiny, well-typed interface using the vsock communication channel—unlike other signers, which simply proxy arbitrary network requests across the enclave boundary. Confined – The only outbound channel from the vHSM is to AWS KMS, following a secure communication flow. For more information, refer to How AWS Nitro Enclaves uses AWS KMS. Even here, however, the signer assumes that the channel may be compromised and uses the ephemeral private and public key associated with the particular enclave to encrypt the AWS KMS result with the public key stored in the attestation document. This way, the AWS KMS result can only be decrypted and read inside the enclave where the AWS KMS decrypt call originated in the first place.\n\nConclusion\n\nIn this post, we covered the operational traps and pitfalls of running Ethereum validator nodes and, in particular, the security, correctness, and availability challenges node operators have to balance daily. Remote signing, in contrast to managing keys locally on the node, can address these challenges—but the design of the remote signer matters. To this end, we detailed the design of CubeSigner, a remote signing solution based on Nitro Enclaves, and showed how CubeSigner not only addresses the security and correctness (slashing) challenges operators face, but also how it makes it straightforward to eliminate operational costs and run highly available validator clusters.\n\nWe encourage you to sign up for a Cubist CubeSigner sandbox account, start up your Ethereum validator using an AWS Blockchain Node Runners template, and run your own Ethereum validator node.\n\nAbout the Authors\n\nFraser Brown is a co-founder and the CTO of Cubist. She is also an Assistant Professor at Carnegie Mellon University’s School of Computer Science. Her research focuses on security and program correctness, from verifying (parts of) production systems to automatically finding exploitable bugs in real codebases; for example, her tools have found many zero-day bountied bugs and CVEs in the popular Chrome and Firefox browsers.\n\nDeian Stefan is a co-founder and Chief Scientist of Cubist. He is also an Associate Professor of Computer Science and Engineering at UC San Diego. His research lies at the intersection of security and programming languages with a particular focus on building secure systems that are deployed in production. He was a co-founder of Intrinsic, a runtime security startup acquired by VMware in 2019.\n\nDavid-Paul Dornseifer is a Blockchain Development Architect at AWS. He focuses on helping customers design, develop and scale end-to-end blockchain solutions. His primary focus is on digital asset custody and key management solutions."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiXkFVX3lxTFBWMldnbjdiZlpRalcycTVWSXNJMTViQm5LTHpNMTY0eGRqbUtjenJESXJzT0VLSFJOczktR2EySF9vQWlFbmh6dmVycHBKWm92Xy1zMmxHUEE3RnJnR3c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Mar 2024 07:00:00 GMT",
        "title": "Ethereum Dencun upgrade sparks divergent opinions from crypto execs - crypto.news",
        "content": "While Ethereum developers inch closer to shipping Dencun, some experts are unconvinced the upgrade will deliver on its promises.\n\nDays before Dencun is scheduled to deploy on Ethereum’s mainnet, two industry veterans offered differing opinions regarding the impact of this much-anticipated upgrade amid skyrocketing Ether (ETH) prices.\n\nThe hype and crypto market euphoria pushed ETH to another two-year high, as the crypto crossed $4,000 for the first time since late 2021, at the peak of the previous bull cycle.\n\nYou might also like: Ethereum hits $4k amid bullish surge, market awaits Dencun upgrade boost\n\nCore DAO, Wormhole experts on Ethereum’s upgrade\n\nEthereum developers have said that Dencun will implement expanded data availability for layer-2 solutions like Arbitrum and Optimism, allowing for improved transaction capacity at lower gas fees.\n\nCore DAO initial contributor Rich Rines said in a statement received by crypto.news that the focus on Ethereum L2 may harbor unexpected issues around liquidity and on-chain fragmentation.\n\nWhile this should enable higher TPS on the network as a whole, questions remain whether this is a long-term fix. Over-reliance on Layer 2s could lead to fractured ecosystems and liquidity, as activity trends away from the base layer. Additionally, Layer 2s may involve more trust assumptions and can have sub-optimal influence on the base layer if transactions and fees are increasingly taken off the base chain. Rich Rines, Core DAO initial contributor\n\nRines noted that observers must closely monitor Dencun’s progress after deployment, which is expected by March 13 barring unforeseen delays. The Core DAO contributor also said questions may arise about whether the upgrade’s objective was the correct goal in the first place.\n\nOn the other hand, Wormhole Foundation co-founder and CCO Robinson Burkey views Dencun optimistically and expects the upgrade to herald a massive increase in cross-chain asset transfers.\n\nThe Dencun upgrade is undeniably a positive development for the crypto space. This upgrade will really enhance Ethereum’s scalability and security, which bodes well for defi and overall interoperability. This will result in cheaper and easier asset movement and more affordable transactions on Ethereum. Robinson Burkey, Wormhole Foundation co-founder and CCO,\n\nBurkey opined that the Dencun upgrade will bolster defi usage, accessibility, and dynamism as cheaper fees should incentivize greater on-chain participation in crypto’s largest decentralized ecosystem."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxNQWJjUGY4NVBWUjNsVUxkdzNNN3lQald4V3REcGNZSTRiOWNqdVFmTFUwbW00SG1udUZzNWM0ZU9GRGxLQWJBN25WWndfemlydkN0YldhdG5SU19PelJteTM1X0V6Qmh0b3RmNmhlbzNSc1dqTDR6b196XzJaX0xxSHFSaFNNZ0No0gGQAUFVX3lxTE82QUtETkI2Q245SjVVaERMMjFIa2ljMHNaTFJxR3pXME9pVVJGM3FFZDhheXMxTW9jbk9VaGZjLVp3TlVmM1dXdE01S2xfYkJOMjQwOHpsa2Q0SnhnN0NtejZxSGZad3UzQ2VqRnl6QWtDQnlLRXE3S1NYRk5MTUN6M1FQOWYyNXlMNFNDVkdINg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Mar 2024 07:00:00 GMT",
        "title": "Upland Reveals 'Share and Build' Airdrop Drive Ahead of Ethereum Token Launch - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nUpland, a crypto game built around real-world locations, announced Friday that it has launched the first wave of its \"Share and Build\" airdrop series. It's aimed at rewarding community members and newcomers alike for engaging with the Upland platform before its Ethereum token goes live.\n\nThe first chapter will let users earn Sparklet tokens—Upland's existing in-game utility token used to construct buildings and create content—through social media activities and in-app missions over a three-week period.\n\nUsers can connect their Twitter (aka X) accounts and earn points by engaging with Upland and Sparklet content on the social media platform. Those points will then be converted to Sparklet tokens within the Upland game. The Twitter-centric airdrop farming campaign recalls similar pushes around the Portal and BlockGames tokens.\n\nLast November, the EOS-based Upland announced that it planned to launch an Ethereum token that’s tied to its in-game Sparklet token. That whitepaper describing Upland’s plans was put to a community vote, with 87% of users voting in approval of the proposal.\n\nAD\n\nAD\n\nThe token tradability event (TTE) will follow the airdrop campaign, letting users convert their in-game Sparklet currency into a tradeable Ethereum token.\n\n\"We're excited to launch the 'Share and Build' airdrop series as we are getting ready for the Sparklet event. This initiative aligns perfectly with our vision of fostering a thriving Web3 ecosystem and rewarding passionate players,\" said Dirk Lueth, co-founder and co-CEO of Upland, in a release.\n\nThis first wave of the airdrop campaign offers 10 different reward levels, with users' engagement levels and social stats on Twitter determining their point multipliers. Users of select, as-yet-unrevealed Upland partners will also receive \"point boosts\" to help them earn more.\n\nAdditionally, by completing each forthcoming airdrop chapter, participants will be rewarded a distinct Block Explorer NFT that serves as a game piece within Upland. Collecting five such rewards unlocks an exclusive NFT for use within the Upland game.\n\nAD\n\nAD\n\nUpland began life in 2019 as a property-trading game, with digital versions of real life properties tokenized and sold within the game. It has since expanded into a more robust metaverse experience with vehicles, events, and other gameplay opportunities. Upland raised $7 million in a Series A extension round last November.\n\nEditor’s note: This article was written with the assistance of AI. Edited and fact-checked by Andrew Hayward."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxOWFpGLTI5Q0lfSV9qMkJ5eXJ4d3lLRVJYalVqdnp3MzN1eFFnZTByS2lUVVhUM0JvNW9abHlCS1AxMDlQUVVyQUd6dTNBUU44cmJ1ZVlGT2RfbHR2WlFpSno1OE1EaFhEeEY5Z1pGamZtNWo3UW5PWU1CWHlqRG16MHFLeG5uTmNEekFkTkFDVlBWVjRLcUZQTUppb1hYdXlBdG9zeVgzQlg5Mk9TUmNlZGlLd9IBuAFBVV95cUxORE10ZEdLS0djNVJrbmdwek43cE5NdnZGLUhhaGN1U2FGcGtsV0ZSWmk4bUpJcEtvOURKbmM1VG9kSFdlcFpDYzBRd3NabW45YjEzVGx5aXpNNlBmWHVCN3JLYUlSX0ljQURUanE2dHFVRkJFZXBGYWVDSFpEdVhTcDBqNHJPMFZTMWszc3MwYWR4bG1JMXhFNldqY2V6MDUwTmo3WXJFdTd5VW53NmhrTk5BbGpYbVpU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Mar 2024 07:00:00 GMT",
        "title": "Here’s How Low ETH Can Go if $3.5K Fails to Hold Selling Pressure (Ethereum Price Analysis) - CryptoPotato",
        "content": "Ethereum has recently breached a significant resistance level, crossing the psychological milestone of $4K and achieving a new high for the year.\n\nHowever, this breakthrough was met with resistance, leading to a noticeable correction. The question that arises now is whether this correction is merely a temporary setback or the beginning of a broader reversal in the bullish trend.\n\nTechnical Analysis\n\nBy Shayan\n\nThe Daily Chart\n\nA thorough analysis of the daily chart indicates a prevailing bullish sentiment surrounding Ethereum, evident in a strong and sudden upward surge that surpassed the critical resistance at $4K. This surge reflects heightened interest from market participants in Ethereum, resulting in increased volatility.\n\nHowever, after briefly surpassing the crucial $4K resistance level, the price encountered intensified selling pressure, likely due to profit-taking among participants, leading to a significant decline toward the substantial support zone of around $3.5K. It seems likely that the market will find support in this region and initiate a fresh rally.\n\nHowever, in the event of a continued corrective retracement, Ethereum’s price is expected to find support around key levels within the Fibonacci retracement, specifically between the 0.5 ($3,181) and 0.618 ($2,966) levels.\n\nThe 4-Hour Chart\n\nFurther examination of the 4-hour chart confirms the presence of buyers in the Ethereum market, propelling the price to its highest level since April 2022. This surge, accompanied by increased market volatility, demonstrates significant buying interest aimed at surpassing the previous all-time high of $4.8K.\n\nHowever, following the breakthrough above the critical $4K resistance level, the price faced rejection, leading to a sharp decline aiming for the key support zones around $3.5K and $3.3K. Additionally, an expanding bearish divergence between the price and the RSI indicator suggests the potential for a notable market correction.\n\nNevertheless, it is important to recognize that healthy bullish markets often experience periods of consolidation correction, allowing the asset to rest and rebuild demand. Therefore, it seems likely that the price will find support in the medium term, continuing its overall upward trend.\n\nOn-chain Analysis\n\nBy Shayan\n\nEthereum’s price has surged rapidly in recent weeks, briefly surpassing its previous all-time high of $4,000. This surge has attracted numerous speculators to the market, driving up buying pressure and instilling confidence among investors.\n\nThe accompanying chart illustrates the open interest, a valuable metric for assessing sentiment in the futures market. Open interest quantifies the number of outstanding perpetual futures contracts across various crypto exchanges.\n\nIt’s evident that the open interest has soared alongside the recent bullish trend, reaching unprecedented levels. This surge indicates the intensity of both long and short positions in the perpetual futures market, resulting in an overheated environment.\n\nWhile elevated open interest is typical in a robust bull market, it can also contribute to heightened volatility and unexpected market corrections. As such, it’s prudent for investors to carefully manage their risk in the short term."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxOLUxnUUg0ZklTem5meXd0bndvcjFHVUxBdXRDV081enVaMFNKMWtKcnZ5VElqNmNaLUZZR0tfOC1NYU03OEhkc0dzZ1FrV05nUEVlTk16WU9aVi1VajFUS242NkVnV0Facl82em9PSkpkWmJhdEZoTUliMUJDdnpZc1daakY0cVpPMmJxc00zMjZVMjY0OHpSakZoVHLSAaIBQVVfeXFMTjRpNHlseVZsNjl3QVI5c1ZpNzM2anpDRmpmZGpHbnVJQnkzUWZMT2ZvTXMxZG5zdXBoZWI1TUVSblFtWlBESjdCV1R5dmx0dHNQQ0pHeml2cS0zajlGYWFDNTVGZ0ljRFRHVC14ZW9GY1pPMnZuZ2x2ZEp0VHZvRXVicGh1TmU1bG56OHdnZ2dxWU92SU8tNUs5dXhMOUFEdlRB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Mar 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Price Drops 7.8% A Day After Dencun Upgrade, What’s the Next Support? - CoinGape",
        "content": "Following the successful implementation of the Dencun upgrade, Ethereum has encountered significant selling pressure. As of the latest update, the Ethereum (ETH) price has declined by 7.8%, trading at $3,669 with a market capitalization of nearly $450 billion. Additionally, Ethereum’s daily trading volume has surged by 45% to $32.29 billion\n\nEthereum (ETH) Price Levels to Watch Ahead\n\nThe Ethereum price faced resistance at the $4,000 level and initiated a downward correction, mirroring Bitcoin’s movement. ETH dipped below crucial support levels at $3,920 and $3,850, signaling a short-term bearish trend.\n\nadvertisement\n\nIt briefly dropped below the $3,680 support area, reaching a low of $3,625 before consolidating losses. Currently, a significant bearish trend line is forming with resistance around $3,850. The primary resistance levels are near $3,850 and the trend line, close to the 50% Fibonacci retracement level from the recent swing high at $4,083 to the low of $3,625.\n\nIf the Ethereum (ETH) price surpasses the $3,880 resistance, it may regain bullish momentum, aiming for the $4,000 level. Conversely, failure to break above $3,850 could lead to further downside movement. Initial support is at $3,680, followed by a major support zone near $3,600, with a potential downside target at $3,500. A decisive break below $3,500 might trigger a decline toward $3,350.\n\nPopular crypto analyst CrediBULL Crypto explained that the range of $3600-$3700 for Ethereum is likely to attract significant buying interest in the short term.\n\nFurthermore, blockchain analytics firm Elliptic uncovered a substantial transaction involving $12 million worth of Ether by the Lazarus Group. This transfer was facilitated through Tornado Cash, a cryptocurrency mixer. Despite being subject to sanctions, the North Korean hacker organization has resumed its use of this platform.\n\nThe funds are traced back to a cyber-attack on HTX and the Heco Bridge in November, orchestrated by the Lazarus group. This attack resulted in significant losses amounting to $100 million for the affected platforms.\n\nETH Gas Fee Drops Under $10\n\nAccording to Santiment, an on-chain data provider, the current scenario of Ethereum surpassing a $4,000 market value differs from October and November 2021. Today, the network’s transaction costs are significantly lower, standing at less than 1/6th of the previous levels. With gas fees averaging $9.35, this improvement can be attributed in part to the enhancements in network fees following the transition to Ethereum 2.0.\n\nBhushan Akolkar Bhushan is a FinTech enthusiast with a keen understanding of financial markets. His interest in economics and finance has led him to focus on emerging Blockchain technology and cryptocurrency markets. He is committed to continuous learning and stays motivated by sharing the knowledge he acquires. In his free time, Bhushan enjoys reading thriller fiction novels and occasionally explores his culinary skills.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxOTDBoeHJ3RldXN2tfZGxzMjdhWk1xWVNEZlcyU29BaUFxSGdMVnRXenBCcmItU256UWpvRk8zWkdFd1o3YzVNQWpydkZ0T2lGMmd0SGFzVlZjN1Fua3paQ0hkd1gzNHZhTGl0S1d3VHI5M0RYYkVDZF8tN2tPYmQyTQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Mar 2024 07:00:00 GMT",
        "title": "Upland unveils “Share and Build” Airdrop ahead of $SPARKLET token launch on Ethereum - The Cryptonomist",
        "content": "Upland has announced its Airdrop “Share and Build” program in anticipation of the launch of its token on Ethereum. The cryptocurrency game is gearing up for the debut of the Sparklet token and is offering rewards to users through game missions and social media interactions.\n\nLet’s see below all the details.\n\nUpland Airdrop Strategy: Launching the Ethereum Token\n\nAs anticipated, Upland, a game of cryptocurrencies based on real-world locations around the world, announced on Friday the launch of the first phase of the “Share and Build” airdrop series.\n\nThe goal is to reward both existing community members and new users who engage with the Upland platform before the launch of its token on Ethereum.\n\nThe first chapter of the series will allow users to earn Sparklet tokens, used within the game to build buildings and create content, by participating in activities on social media and missions within the application for a period of three weeks.\n\nLast November, Upland, based on EOS, announced plans to launch an Ethereum token linked to the Sparklet game token.\n\nThe whitepaper detailing these plans has been submitted to the community vote, with 87% of users voting in favor of the proposal.\n\nThe token commercialization event (TTE) will follow the airdrop campaign, allowing users to convert the in-game Sparklet currency into a tradable Ethereum token.\n\nAirdrop and NFT: expanding the gaming experience in the metaverse\n\nDirk Lueth, co-founder and co-CEO of Upland, stated the following:\n\n“We are excited to launch the ‘Share and Build’ airdrop series as we prepare for the Sparklet event. This initiative aligns perfectly with our vision to promote a thriving Web3 ecosystem and reward passionate players.”\n\nThe first phase of the launch campaign offers 10 different reward levels, with user engagement levels and social statistics on Twitter determining their point multipliers.\n\nFurthermore, selected Upland partner users will receive “point boosts” to increase their earnings.\n\nIn addition, each completed chapter of the airdrop will guarantee participants a unique NFT Block Explorer, which will serve as a gaming element within Upland.\n\nBy accumulating five of these awards, you will gain access to an exclusive NFT to use in the world of Upland.\n\nWe remind you that Upland originated in 2019 as a property trading game, with digital versions of real assets tokenized and sold within the game.\n\nOver time, it has evolved into a solid metaverse, offering vehicles, events, and other gaming opportunities. Last November, Upland raised $7 million in a Series A extension round.\n\nRevenues for Upland players in 2023 and more\n\nUpland has generated approximately $13.5 million in revenue for players in 2023, establishing itself as a growing digital economy and an economic hub in the Web3.\n\nRevenues are withdrawn in USD via PayPal in collaboration with Tilia, a payment solution offered by Second Life, another Metaverse platform. Additionally, players can withdraw their funds using Upland’s native UPX.\n\nThe co-CEO and co-founder of Upland, Dirk Lueth, shared this information in a press release with NFTgators, stating:\n\n“The platform has over 3 million registered users with active participation, turning Upland into an immersive digital economy.”\n\nPlaying and selling virtual properties on Upland has allowed uplanders to make millions in profits, while the platform has formed partnerships with entities such as FIFA, UNICEF Brazil, and Susan G. Komen.\n\nUpland emerges as a symbol of the power of GamiFi, true ownership, and engaging digital economy.\n\nFurthermore, Upland has announced progress in the ecosystem of user-generated content (UGC), open to all individuals.\n\nThe platform offers players the opportunity to verify the size of the property and the potential to adapt to different structures, welcoming valuable user feedback.\n\nThe video of the roadmap for the first quarter of 2024, published on January 10, 2024, reveals that Upland will focus on automotive transportation, car races, Sparklet, and renewed seasons."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxPejhZdk11STE4QVpyT2trSVo4aGhMRmtfX3B3aUtmSnktdlJrci1SMUp4QW1nWVdfM1l2WDduanVyUnZnR2RWU0NjOUhfS0x2T0ZsVHBocm5IRGl3dUFRakZwQjhQTTNvdzdyOU5wdl9oTXo3WEdkbkI4ZzQzV1E0VkY2NEZMb3ZTUEM2S2ZwNGUxZ0F4OHlmcVRGT0VoX1E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Mar 2024 07:00:00 GMT",
        "title": "The crypto future of Ethereum: the launch of the Metis Alpha - The Cryptonomist",
        "content": "Crypto news: the launch of Alpha marks the activation of the decentralized sequencer of Metis, representing a significant step forward for the scalability of Ethereum through the implementation of this milestone.\n\nLet’s see below all the details.\n\nMetis Crypto Sequencer: Steps Forward for Ethereum\n\nAs anticipated, Metis, the Layer-2 scalability platform of Ethereum comparable to the EVM, has launched the Alpha version of its innovative Decentralized Sequencer. This marks a significant step towards the decentralization of rollups.\n\nThe decentralized Sequencer represents a significant advancement compared to the single sequencer model currently adopted by other Layer-2 rollup solutions.\n\nThis launch positions Metis as the first rollup of Ethereum to adopt a decentralized approach to its sequencer. Rollups represent one of the most promising scalability solutions, but currently they have some drawbacks.\n\nTo fully ensure the security of Ethereum, a decentralized fraud/validity proof system and a decentralized sequencer are needed.\n\nSo far, no other rollup has focused on the decentralization of the sequencer, making them vulnerable to single points of failure and potentially subject to censorship.\n\nWith this new feature, instead, by keeping control over a single sequencer, the foundations maintain almost total control over the network and its revenues.\n\nSecurity, fairness, and community involvement in the crypto network\n\nThe adoption of a decentralized sequencer by Metis allows multiple entities to manage the sequencers. This improves the security and decentralization of the network and enables a more equitable revenue sharing with users.\n\nA distributed sequencer also paves the way for crucial functions such as seamless and secure sequencer rotation, the ejection of malfunctioning or harmful entities, and increased network stability.\n\nUsers can contribute to maintaining the decentralization, transparency, and stability of the network by becoming sequencers and participating in the consensus process.\n\nThe participation of multiple entities makes it more difficult for malicious actors to control or compromise the order of transactions.\n\nThe Sequencer nodes can earn rewards in METIS tokens for their role in block production and transaction processing within the network.\n\nActive participation from the community can lead to greater recognition within the group, paving the way for future collaborations or potential partnerships.\n\nFurthermore, during the first year, all sequencer nodes will benefit from a Mining Rewards Rate (MRR) of 20%.\n\nMetis gets a price rally with listing on Binance\n\nMetis has experienced a significant increase of about 27-30% after the announcement of its inclusion on the Binance trading platform.\n\nThe inclusion on Binance of the crypto has effectively introduced the project to a wide range of traders and investors, increasing its liquidity and accessibility.\n\nThe surge in the token price can be attributed to various factors, including the increase in visibility and credibility resulting from being listed on Binance, as well as the growing market interest in Layer 2 scalability solutions like Metis.\n\nParticularly significant is the fact that Binance has waived the listing fee for Metis, demonstrating confidence in the potential of the project and commitment to promoting innovation in the cryptocurrency sector.\n\nThe designation of “Seed Tag” conferred to Metis by Binance highlights its status as an innovative project, which could involve greater volatility and risks compared to other listed tokens.\n\nThe increase in Metis prices and its listing on Binance have coincided with a broader recovery in the cryptocurrency market.\n\nBitcoin has recently surpassed its previous all-time high, exceeding $71,000.\n\nOn the other hand, Ethereum has temporarily exceeded $4,000, further contributing to the bullish sentiment around Metis and other promising blockchain projects."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxOLTlMYXpMdTVpMG1naXdQbjc4UGN0bjJwNjRzUzhhbFVfR3cteVl4dEhpSE5NdGdpdzQxOFBYV1U5cGVwbVoyT1pqMVNOczk1Z2lpTDlUbEhUOVowMmc2cnFBdWE1Y3RkcThrSXFvTFMzODlyUXFWaHd0dW5wNkR2LVM1TTVxREhZ0gGOAUFVX3lxTE8zcnpjS05TSzdwU3JRdHlFYmpCZ1Q3TThBRVFYYmRzN084cW5fd0RoUjY1aFZQRl9ndHZLVEcxT21BZFFBT2pYQmdWWFZWeTBCSGtRR2VEcW5qLWhSazRtUUF2bXItZkdpVUJTQ1ZGT1VYQzRIa1AweV9xSUZRdGoyb1Vud1RaVjZ2alFrWHc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Mar 2024 07:00:00 GMT",
        "title": "Ethereum’s Dencun killing L2 fees by 92%: Will Optimism, ARB pump now? - AMBCrypto News",
        "content": "Ethereum’s Dencun upgrade went live on the 13th of March.\n\nThere has since been a notable decline in transaction fees on L2 networks.\n\nLeading layer 2 networks (L2s) have witnessed a significant drop in transaction fees in the past 24 hours.\n\nThis is a result of the successful deployment of the Dencun upgrade and the activation of EIP-4844 on the Ethereum [ETH] mainnet.\n\nThe Dencun hard fork, which is the biggest upgrade to the Ethereum network since the Merge in September 2022, went live at 1:55 pm UTC on the 13th of March.\n\nAs reported previously, the Dencun upgrade aims to enhance Ethereum’s scalability and, notably, to decrease the transaction fees of L2 solution providers.\n\nThe average transaction fees on L2s like Optimism [OP], Arbitrum [ARB], Base, and zkSync have dropped significantly by 92%, 23%, 94%, and 33%, respectively, since the implementation of the Dencun hard fork.\n\nAMBCrypto sourced this data via a Dune Analytics dashboard compiled by Marcov.\n\nETH remains in good hands\n\nETH exchanged hands at $3,988 at press time, per CoinMarketCap’s data.\n\nIts statistically positive correlation with Bitcoin [BTC], whose value has climbed by over 10% in the last week, caused the altcoin to witness a 5% price uptick during the same period.\n\nA 2% increase in its supply on cryptocurrency exchanges over the past week indicated a rise in profit-taking activity.\n\nHowever, a look at its performance on a daily chart revealed that market sentiment remains markedly bullish.\n\nFor example, reading from ETH’s Moving Average Convergence Divergence (MACD) indicator which tracks market trends, showed the MACD line (blue) significantly above the trend (orange) and zero lines.\n\nWhen these lines are positioned in this manner, it indicates strong bullish momentum in the market.\n\nIt suggests that the short-term moving average is above the long-term moving average, and there is potential for continued price growth.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nFurther, the altcoin’s Chaikin Money Flow (CMF) was 0.26 as of this writing. In an uptrend and above zero, ETH’s CMF showed that liquidity inflow into the market remained high.\n\nRegarding the demand for the leading altcoin, its Relative Strength Index (RSI) and Money Flow (MFI) were 76.57 and 65.54 at press time. These values showed that coin accumulation exceeded sell-offs."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxPaWh4ZU5tcUt2d2YyNGc4SDF1Q2o0a3NyYjNmb2p6ZVhWUmpsQnBTRFZxcy1NNlBPOG5IUEROZ0tOaGRpTDZwN29FTDZmNjU4aHVQU29YMkhTM2VmY1ZhUkxqS2Vsd2VvN1M4QWI5N0hfWkFyQ0hZSm9BVzdUc1FUODZIQkJvdFF4aGNIZGpvMUgtOGdlenRmVEhGaUt1dnhxYlJlaEJjLUdwcGcwOWhQRGoyWXFKMW94N3VPQzhSSjNCZFptLWdn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Mar 2024 07:00:00 GMT",
        "title": "Grayscale Submits Revised Application For Ethereum Spot ETF – What’s New? - TradingView",
        "content": "Asset management firm Grayscale Investments has updated its application for an Ethereum spot ETF (exchange-traded fund) with the United States Securities and Exchange Commission (SEC).\n\nEthereum Spot ETF Case Just As Solid As Bitcoin’s, Grayscale Argues\n\nAccording to a recent post on X by Craig Salm, Grayscale’s chief legal officer, the asset management firm has revised its 19b-4 form for an Ether spot ETF. Salm claimed that this move was “important” in an effort for Grayscale to list and trade shares of its Ether Trust on the New York Stock Exchange (NYSE) Arca.\n\nThe chief legal officer stated in his post that investors “want and deserve access” to Ethereum via a spot exchange-traded product, likening the situation to the Bitcoin ETF story. “We believe the case is just as strong as it was for spot Bitcoin ETFs,” Salm said.\n\nThe asset manager is amongst the numerous firms looking to issue the first Ethereum spot ETF in the United States, having filed an application with the SEC on October 10, 2023. However, these ETF applications have faced delays multiple times, with the most recent coming against BlackRock’s filing on March 4, 2024.\n\nAs a result, the likelihood of the SEC approving an Ethereum spot ETF has taken a nosedive in recent weeks. Once-optimistic Bloomberg ETF expert Balchunas even revealed in his latest analysis that the ETH funds now have only a 35% chance of approval.\n\nSEC Chairman Faces Pressure Over Crypto Approval\n\nTwo US senators of the Democrat party, Sens. Laphonza Butler of California and Jack Reed of Rhode Island, have urged the SEC chairman to avoid approving crypto investment products. In a letter dated March 11, the lawmakers, who are also members of the Senate Banking Committee, asked the Commission to limit future crypto ETF applications.\n\nAlexander Grieve @AlexanderGrieve The success of the BTC spot products clearly ruffling some feathers on the Hill. @SenatorJackReed and @Senlaphonza write to the @SECGov urging:-no further ETPs for other tokens-make life difficult (i.e. examinations/reviews) for brokers and advisers that recommend BTC ETPs pic.twitter.com/enxdumC02N\n\nFollowing the approval of 11 Bitcoin spot ETFs in January, the attention of the crypto public has somewhat turned to whether the SEC will do the same for the Ethereum versions. However, this latest letter from the senate seems to further hurt the chances of an ETH ETF approval.\n\nA part of the letter read:\n\nRetail investors would face enormous risks from ETPs referencing thinly traded cryptocurrencies or cryptocurrencies whose prices are especially susceptible to pump-and-dump or other fraudulent schemes,” they said. “The Commission is under no obligation to approve such products, and given the risk, it should not do so.\n\nAs of this writing, the price of the Ethereum token stands at $3,731, reflecting a 1.2% increase in the past day."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxNQXJ1bU1JTDdDamJIeXIxendYRHFEZzlQRFZVckczb1Bjc21DYlp5UFJiakFGckltTGZkb052akpKRVpZdVlJdmhNbEhsd2JOMWVtNFluc0o2bHpmeF9lNk0yeVV2Tjc1UEw4NDhyNE9uR0lwVWI0Q182QlVXSXJIdU55eV82eFRzTHdBaDJwQkgzMVJNLVlRdC1MeUtwczNUZEJtNV9USm1UejNCMlHSAbMBQVVfeXFMT0tUTExhTU1SUHJURFI1SF9zRm93UjV2cFlWaXFyRldpTXprSVhoTzAwXy1odzU1WUpzMVhEU2ZxdzNwLWxLZzliMDRTc2dTQXlLQU1OQWRnb3RGZEx4ZW1iQk9YN3pJa0twRjdVUkFGWHliWndtS2dLWnpqUDRXMzdDaWh0cFJUZ0NnNEtCMkVGa3g4LXk2azRQeGYyX3lHbDYwZl95OVJQc0NqTndDR2h3MFk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Mar 2024 07:00:00 GMT",
        "title": "Crypto Prices Today March 15: Bitcoin Crashes To $67K, Ethereum Dips 7%, SOL Rallies As XRP & PEPE Plunge - CoinGape",
        "content": "The top crypto prices today registered a crash as the Bitcoin (BTC) price neared the $67,000 level again after attaining an all-time high at $73,641.04. In contrast, the Ethereum price fell below to the $3,600 mark. Meanwhile, other top altcoins, such as XRP and Cardano (ADA) dipped massively as Solana (SOL) surged.\n\nMajor Crypto Prices Today\n\nThe Bitcoin price lost over 7% today. The Bitcoin price crashed by 7.56%, reaching $67,348.89 at the time of writing on Friday, March 15. On the other hand, it’s trading volume spiked 50.70% to $72.34 billion in the last 24 hours. Meanwhile, the crypto boasted a market cap of $1.32 trillion.\n\nadvertisement\n\nLooking at altcoin, the Ethereum price plunged by 7.41% to $3,664.32 at press time with a market valuation of $441.24 billion. Whilst, ETH saw its trading volume surge by 38.67%, reaching $30.31 billion. Meanwhile, the Binance Coin (BNB) price was down by 5.09%, reaching $581.82. Moreover, its 24-hour trade volume dipped by 21.32% to $4.85 billion.\n\nThe Solana price defied the bearish trend and neared the $180 level. The Solana price surged by 5.61%, settling at $177.81. In addition, SOL witnessed a 64.42% hike in trade volume to $10.91 billion in the last 24 hours. Whilst, the XRP price dropped below the $0.64 mark. The XRP price recorded a slump of 6.11%, reaching $0.6346. On the contrary, XRP’s trading volume soared 69.57% to $4.05 billion.\n\nMeanwhile, the Cardano price tumbled by 4.25% to $0.7167 today. Whilst, ADA recorded a 110.66% spike in its 24-hour trading volume, settling at $1.84 billion. As the top crypto prices bearish downturn, popular meme coins were also affected. The Dogecoin price was down by 8.70% to $0.1547 while its rival, Shiba Inu price plunged by 8.83% in value and traded at $0.00002997.\n\nAlso Read: Bitcoin (BTC) and Crypto Market Tank 7%, Expect Volatility Before FOMC\n\nTop Crypto Prices Today Are\n\nPepe Coin Plummets 10%\n\nThe Pepe Coin (PEPE) crypto, a hyped meme coin, tumbled over 10% today. At press time, the Pepe Coin price was down by 10.02% to $0.000009116 with a market valuation of $3.83 billion. In contrast, its 24-hour trade volume soared 22.33% to $2.82 billion.\n\nDogwifhat Rallies 13%\n\nDogwifhat (WIF), a Solana-based dog-faced meme crypto, recorded an impressive rally of over 13% and ranked the top crypto gainer for two consecutive days. The WIF price soared by 23.41% to $2.86 at the time of reporting. Moreover, its trade volume surged by 13.68% to $3.25. Furthermore, the Dogwifhat crypto recorded a high of $3.49 amid the rally recently.\n\nAlso Read: Tron Founder Justin Sun Fuels Ether Fi with Massive $480M ETH Deposit\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiY0FVX3lxTE1ndWQ1RHNiS0hhMjAzNXlsazlFTXFIU2xjSldLbWd6Vjk3emVaYmNHdDJsTjI3YnhIMUIwYzNlQVB0Qmd1eHdUNGxrd1JvcVFROXdzbWdZdzQtTkNnUUx1Z1VjVdIBZ0FVX3lxTE8wQW95ZzBZQUZVYktXa3dUNXFUZnc2WkFiTVBvMF9weVVLeVp3MzRMV1NwcTBmQmtjTFRRLUllRXdXby1iLXRucGkxa2lXWGRGeXp6M1AzMmJmMVZGeGI2bTNXNi0xSEU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Mar 2024 07:00:00 GMT",
        "title": "Ethereum Staking Explained: Is ETH Staking Worth It? - CoinCodex",
        "content": "Yes, Ethereum staking is worth it for most holders. Staking earns you rewards and contributes to the security and functionality of the Ethereum network. If you want to stake ETH as a solo staker you need 32 ETH, which is a high bar for most holders. However, liquid staking solutions allow users to stake much smaller amounts and generate virtually the same rewards.\n\nIn September 2022, the Ethereum blockchain received its biggest upgrade to date. The Merge upgrade moved Ethereum from Proof-of-Work over to Proof-of-Stake. The transition to Proof-of-Stake has made the Ethereum much more environmentally friendly and also laid the foundation for future upgrades, which will significantly improve the scalability of the network.\n\nWith the introduction of Proof-of-Stake on Ethereum, ETH holders now have the opportunity to stake their coins and earn staking rewards in the form of additional ETH. In this article, we’ll explain Ethereum staking and present the different options ETH holders have when it comes to earning staking rewards.\n\nKey highlights: The Ethereum network transitioned to a Proof-of-Stake consensus mechanism in September of 2021.\n\nThis means that ETH holders can now stake their ETH to provide additional security to the network and earn rewards.\n\nIf you want to run your own validator, you need 32 ETH.\n\nIf you don't have 32 ETH, you can still earn staking rewards. You can use liquid staking protocols such as Lido or stake your ETH with the help of a crypto exchange.\n\nWhat is Ethereum staking?\n\nEthereum now uses a Proof-of-Stake consensus mechanism, in which validators stake ETH in exchange for participating in the consensus process. Validators are rewarded for adding new blocks to the Ethereum blockchain and for checking that blocks proposed by other validators follow the protocol’s rules.\n\nValidators who are reliable and act in the best interests of the network receive ETH as a reward. At the time of writing, validators on Ethereum are earning an APR (annual percentage rate) of about 4%. If you’re investing in Ethereum and don’t plan to sell in the short term, staking ETH is certainly worth considering to passively grow your ETH holdings.\n\nThe rewards earned by each validator depend on the total number of validators that are active on the Ethereum network, as well as network activity (more activity means more potential income from transaction fees).\n\nThe catch is that validators who are not reliable or are found to be breaking the rules are punished by having a portion or the entirety of their ETH stake taken away.\n\nShould I stake my Ethereum?\n\nThere's little reason not to stake Ethereum if you plan on holding ETH for an extended period of time. While the rewards for staking are not enormous, they can still add up over time and increase your holdings. At the time of writing, ETH is trading at $3,700. With an expected APR of 3.5% for staking, a single ETH would generate 0.035 ETH in rewards over 1 year ($129.5 at current market rates).\n\nIt's worth noting that Ethereum staking does have certain drawbacks. For one, you cannot withdraw your ETH immediately. This can be detrimental if you decide you'd like to sell ETH quickly, as you will typically have to wait a couple of hours up to a couple of days for your ETH to be unstaked (also known as a \"cooldown period\"). The cooldown period is different between different protocols and platforms.\n\nAnother potential drawback, which impacts liquid staking protocols exclusively, is the fact that the token you receive in exchange for your staked ETH (for example, stETH on Lido), can drop in value relative to Ethereum. This means that if you want to convert your stETH back to ETH to claim rewards and unstake ETH, you might be selling at a loss. However, this rarely occurs and is only really a concern during periods of extreme bearish activity.\n\nstETH (a liquid staking ETH derivative by Lido) is, for all intents and purposes, pegged to the value of ETH.\n\nWho can stake ETH?\n\nIn order to launch your own validator, you need to have 32 ETH. At the time of writing, this translates to about $57,000, so it’s definitely not accessible to everyone from a financial perspective.\n\nHowever, the good news is that there are still ways to earn staking rewards with your ETH, even if you don’t have the 32 ETH required to launch your own validator. We’ll discuss the different ways to stake ETH a bit further in the article below.\n\nInitially, staked ETH coins could not be withdrawn. However, this was changed with the Shapella upgrade in April of 2023, which gave users the ability to withdraw their staked coins.\n\nWhere to stake ETH?\n\nThere are four distinct options for ETH holders who want to stake their ETH and earn staking rewards.\n\nSolo staking\n\nStaking as a service\n\nStaking pools\n\nStaking through crypto exchanges\n\nHowever, solo staking and staking as a service are limited to those that have at least 32 ETH.\n\nDo you have 32 ETH to stake?\n\nIf you have 32 or more ETH to stake, you can access solo staking or staking as a service solution. Of course, you can also use other ways of staking ETH that are also available to users who have less than 32 ETH to stake.\n\nSolo staking\n\nSolo staking involves launching your own Ethereum validator and maintaining it yourself. Each validator you run requires a stake of 32 ETH.\n\nWhen you’re solo staking, you’re directly participating in the consensus process of the Ethereum blockchain and contribute to the network’s decentralization. In addition, you remain in full control of your private keys and receive full staking rewards directly from the Ethereum protocol. This is why the Ethereum Foundation describes solo staking as the “gold standard” for Ethereum staking.\n\nWhile solo staking certainly has a lot of benefits, it is the least accessible way to stake ETH for the average person. The most obvious barrier to entry is that you need at least 32 ETH, which is simply out of reach for most Ethereum investors. Operating a validator also requires some technical expertise, and you need to ensure that your validator stays online continuously to avoid inactivity penalties.\n\nStaking as a service\n\nThere are various staking as a service providers that offer to manage one or more Ethereum validators on your behalf. When using these services, you’re required to provide ETH (32 ETH per validator). In most cases, you get to keep control of your private keys, which is a plus.\n\nOf course, staking as a service providers need some form of compensation for operating validator nodes on your behalf. So, while your validators will be earning ETH staking rewards directly from the Ethereum protocol, you will have to pay a fee to the service provider to keep your validators up and running.\n\nSo, staking as a service can be a good option if you have the sufficient amount of ETH to have your own validators but don’t want to deal with the technical aspects of setting up a node and keeping it operational.\n\nOverall, your returns will be slightly lower than what you’d get with solo staking, as you’ll have to pay a fee to the provider. Some examples of staking as a service providers are BloxStaking and Abyss Finance.\n\nDo you have less than 32 ETH to stake?\n\nIf you don't have 32 ETH to stake, you can't engage in solo staking, but there are other options available to you.\n\nStaking pools\n\nStaking pools take ETH deposits from multiple users and pool them together to launch Ethereum validators. This makes it possible for anyone to stake their ETH, even if they don’t have 32 ETH themselves.\n\nStaking pools are a very popular way of staking Ethereum, and many of them offer liquid staking, which is a very handy feature. Here are two examples of the top two Ethereum staking pools available today.\n\nLido\n\nLido is a liquid staking solution that supports multiple blockchains, including Ethereum. Lido is the most popular way to stake Ethereum. At the time of writing, over 30% of all ETH was staked through Lido.\n\nAfter staking your ETH through Lido, you will receive an equivalent amount of stETH tokens, which represent your staked ETH and any accrued rewards. These stETH tokens can be used in DeFi protocols or even sold if you need liquidity.\n\nHowever, you should keep in mind that the stETH to ETH exchange rate is usually skewed in favor of ETH, so you will likely receive a bit less than 1 ETH for each stETH you sell. Of course, you are also able to redeem your stETH for staked ETH on a 1:1 basis.\n\nRocket Pool\n\nRocket Pool is also a liquid staking solution that allows users to stake smaller amounts of ETH. The minimum amount of ETH that can be staked through Rocket Pool is 0.01 ETH, which makes the service highly accessible.\n\nWhen you stake ETH through Rocket Pool, your staked coins and accrued rewards are represented with rETH tokens. Similarly to stETH, you can use rETH in any way you please. rETH holders can redeem their tokens for ETH on a 1:1 basis.\n\nOverall, staking pools are a good option for anyone who’s looking to earn Ethereum staking rewards but has less than 32 ETH to stake.\n\nCrypto exchanges\n\nMany cryptocurrency exchanges offer Ethereum staking services to their users. For example, you can stake your Ethereum on Binance, which is a solid option since you will be able to retain liquidity thanks to BETH, a token that represents ETH staked through Binance.\n\nWhen staking through an exchange, you deposit ETH to the exchange. The exchange then pools together ETH from multiple users to deploy Ethereum validators. The rewards earned by these validators are then distributed to the users who staked their ETH, but the exchange will typically take a cut from the rewards as a fee for the service they provide.\n\nStaking through exchanges is probably the most convenient way to earn Ethereum staking rewards, but it also requires the most trust. When you deposit your ETH to a centralized crypto exchange, you have to trust that they will manage your funds responsibly. In addition, there could be a negative impact to the decentralization of Ethereum if exchanges control a large number of validators.\n\nComparison of Ethereum staking methods\n\nNow that we’ve briefly explained each different Ethereum staking method, let’s do a quick comparison of their pros and cons.\n\nMinimum amount Pros Cons Solo staking 32 ETH Full control over staking setup\n\nReceive full rewards\n\nContributes most to decentralization High barrier to entry\n\nRequires technical knowledge Staking as a service 32 ETH Much simpler than solo staking\n\nKeep control of keys required to withdraw or transfer staked ETH Service providers take a fee\n\nHigh barrier to entry Staking pools Small (0.01 ETH or less) You can stake smaller amounts of ETH\n\nMany staking pools offer liquidity tokens\n\nNon-custodial options available Smart contract risks\n\nLiquidity token price fluctuations Crypto exchanges Small (0.01 ETH or less) Very convenient way of staking ETH\n\nMany exchanges offer liquid staking options Requires trust in the exchange\n\nExchange takes a cut of the rewards\n\nCentralization risks\n\nEthereum \"restaking\"\n\nRecently, the concept of Ethereum \"restaking\" has started to gain traction in the crypto community. Through protocols such as EigenLayer, users who own staked ETH can choose to \"restake\" their coins to help provide security to applications that function on top of the Ethereum network. Essentially, this means that staked ETH can be used to validate networks and services other than the Ethereum mainnet, allowing users to earn additional rewards on top of the standard ETH staking yield.\n\nCurrently, the most popular Ethereum restaking protocol is EigenLayer, which supports restaking both for ETH as well as liquid staking tokens such as stETH and rETH. Please keep in mind that restaking is a relatively new concept and doesn't have a long track record in real-world conditions. If you're using a protocol such as EigenLayer to restake your ETH, you could be taking on substantially more risk than if you just kept your coins staked normally.\n\nThe bottom line—ETH staking is a good choice for long-term holders\n\nEthereum staking is worth it if you’re an ETH holder and plan to hold your coins over the long term. This is already the position of many ETH holders, as Ethereum is widely perceived as one of the best cryptocurrencies to hold for the long term. Before deciding whether staking is right for you, make sure to check the current ETH staking rewards to see what kind of APR to expect.\n\nIf you’re also interested in cryptocurrencies other than Ethereum, check out our list of the best cryptocurrencies to buy right now."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxOdGNuNmhmbVU5bTNoc2lTZWZ2bnhKT19pRjdxbEM0X3IxQkU0bzRtcmJ6b3RtdjlxOUlkdnpzS1dmVDJ3aEJ6eDlNb1Fua21DM0lFa1hpYVRwZS1rSnFLb1FtaDl0cXFiVDh4a1RlcGNnREtwd2hCWTF6Z01WN21BZV8zVlc3QmttdDV4dTcwTTh1SEh3LWhFNl9mbW9SRzVuX0hCeV9SZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Mar 2024 07:00:00 GMT",
        "title": "Vitalik Buterin's net worth revealed - Finbold - Finance in Bold",
        "content": "Vitalik Buterin, the co-founder of Ethereum and one of the most vocal advocates of cryptocurrency, has a significant portfolio comprised mainly of ETH tokens. In fact, during the bull market in 2021, he became the world’s youngest crypto billionaire. In the meanwhile, the price of ETH dropped significantly, but Vitalik Buterin’s wealth is still substantial. So, how much is Vitalik Buterin’s net worth today?\n\nVitalik Buterin and Ethereum\n\nTo better understand Vitalik Buterin’s net worth, we first have to delve deeper into his relationship with the world’s second most popular blockchain and cryptocurrency.\n\nVitalik Buterin, the creator of Ethereum.\n\nVitalik Buterin is the inventor and co-founder of Ethereum, a decentralized blockchain with an integrated smart contract functionality. Buterin first elaborated on the concept in a white paper in 2013, arguing that Bitcoin (back then, the sole relevant blockchain) lacked application development via an integrated scripting language.\n\nEthereum is a decentralized blockchain platform enabling smart contracts and supporting decentralized applications (DApps). It utilizes its crypto tokens called Ether (Bitcoin ( is a decentralized blockchain platform enabling smart contracts and supporting decentralized applications (DApps). It utilizes its crypto tokens called ETH ) to execute transactions and run smart contracts. Unlike BTC ), which emerged as an alternative currency, Ethereum primarily aims to support fully decentralized contracts and apps to simulate a global virtual computer.\n\nRecommended video: Vitalik Buterin explains Ethereum\n\nSource: Ethereum YouTube\n\nThe idea failed to take off initially, but the Ethereum white paper circulated, the interest grew, and it finally caught up at a Bitcoin conference in January 2014, where it was described as a global processing machine operating on a decentralized network with virtually limitless applications. Ultimately, the project was crowdfunded and launched on 30 July 2015.\n\nFun fact: Vitalik Buterin’s inspiration for decentralized money came from his Vitalik Buterin’s inspiration for decentralized money came from his World of Warcraft gaming experience. He stated that Blizzard removed the damage component from his beloved warlock’s Siphon Life spell one day. He cried himself to sleep, and on that day, he realized “what horrors centralized services can bring” and soon decided to quit.\n\nVitalik Buterin’s ETH portfolio\n\nIn 2014, before it was publicly launched, Ethereum conducted a pre-sale where people could acquire Ether by paying with Bitcoin. ETH’s initial token supply was over 72 million tokens, with 16.53% allocated to Vitalik Buterin and its other seven co-founders.\n\nThis initial batch of ETH is the source of most of his crypto portfolio and the most significant driver of Vitalik Buterin’s net worth. As of August 1, 2024, Vitalik Buterin holds 245,178 ETH tokens. As the current price of each token is $3,188.82, this makes Vitalik Buterin’s ETH portfolio total value equal to $781.83 million. In other words, Buterin’s total value in held Ether is a little over $780 million.\n\nVitalik Buterin claims he never held more than 0.9% of total supply of Ether, and that was at the end of 2015. According to Arkham Intelligence, as of December 2023, the inventor of Ethereum held 0.2% of total ETH supply.\n\nI never personally held more than ~0.9% of all ETH, and my net worth never came close to $1b. Also, I'm pretty sure there are no criminal laws against pre-mining. — vitalik.eth (@VitalikButerin) October 10, 2018\n\nSince nearly all of it comes from Ether, Vitalik Buterin’s net worth is highly dependent on the current price of the crypto coin. In November 2021, near ETH’s peak price, the native token went over the $4,635 mark, making Buterin’s net worth about $1.46 billion. Similarly, his future net worth will fluctuate according to the performance of his crypto invention.\n\nButerin’s portfolio includes a number of other crypto tokens, but their combined worth amounts to a fraction of his ETH wealth and does not change the total net worth by much. Significant sums include 869,509 Kyber Network Crystal (KNC) worth approximately $0.5 million, another 248,273 tokens or $0.85 million worth of WETH (WETH), about 250 trillion of Doge-Inu (DINU) worth $85,12, and small amounts sums of THE, USDC, INDSHIB, DOJO, and other tokens.\n\nButerin proposes radical innovations to boost Ethereum speed Although Ethereum has made significant advances over the years, it keeps lagging behind some of its competition – literally. Newer blockchains like Solana can generate blocks in 0.4 seconds, beating Ethereum’s 12 seconds many times over.\n\n\n\nTo address this, Buterin has proposed radical new solutions, including the “single-slot finality (SSF)” and “based pre-confirmations” that would provide guaranteed inclusion of the transaction in the next block for an additional fee. Buterin has emphasized the need to balance network speed and integrity, but if successful, the changes could transform the crypto industry, likely increasing Vitalik Buterin’s net worth in the process.\n\nVitalik Buterin’s non-crypto assets\n\nButerin was one of the earliest investors in StarkWare, an Israeli software tech company focused on cryptography, more precisely, zero-knowledge proof technology that focuses on blockchain scalability of the Ethereum platform. In May 2022, it was evaluated at $8 billion.\n\nAs there are few reliable sources and zero public data on Buterin’s assets, it is impossible to know for sure how much his non-crypto portfolio adds to his total net worth. Therefore, we will not take it into account when calculating Vitalik Buterin’s net worth in this article.\n\nAbout Vitalik Buterin\n\nBorn in Russia in 1994 and raised in Canada, the father of Ethereum showed exceptional skill in arithmetics and coding since his earliest years. He was the person to envisage how Ethereum should look and work and outlined the draft of its design in 2014, and the blockchain went live in 2015.\n\nRecommended video: Vitalik Buterin On Creating One Of The World’s Largest Cryptocurrencies\n\nSource: Business Insider YouTube\n\nAs such, Ethereum expanded the capabilities of a blockchain from mere financial assets to a range of diverse functionalities in finance, gaming, decentralized finance (DeFi), and more. He has built a legacy of innovative thinking and decentralization advocacy, winning respect within the crypto and wider technology community.\n\nVitalik Buterin’s net worth: the bottom line\n\nThe single asset that makes Vitalik Buterin wealthy is his stake in Ethereum, or the number of ETH tokens he holds and their combined value. At the moment, it is about $781.83 million, but the sum fluctuated wildly, going as high as $1.6 billion in November 2021 and as low as less than $300 million in June 2022.\n\nAs it is, Vitalik seems dedicated to tying his net worth to his pet project, binding his financial fate to the success of the Ethereum blockchain and the associated cryptocurrency. We can only wait and see how it goes in time, but it does mean one thing: the great crypto inventor truly cares about the project, inspiring and reassuring many crypto investors willing to bet on their share of ETH.\n\nFAQs about Vitalik Buterin net worth\n\nHow much is Vitalik Buterin's net worth? The vast majority (almost 99%) of Vitalik Buterin’s net worth comes from the value of ETH. His 245,178 ETH tokens are valued at $781.83 million as of August 1, 2024.\n\nWho is the largest owner of Ethereum? The single largest owner of Ethereum is Vitalik Buterin, with 245,178 ETH held in his crypto wallet as of August 1, 2024.\n\nDoes Vitalik Buterin own crypto other than ETH? Yes, Vitalik Buterin owns other tokens, such as WETH, STRK, KNC, and SDOG. However, almost 99% of his crypto portfolio’s worth is derived from Ethereum.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxPZlBHQUs2amtNdkcwdGNyS1ZWYmtuckJZc294Y3pHOU8xTlQxeUFfZjZUTkdfZzVVekZyUERqekx3UUJGWlN3WkwzdGdUbEhQZlMzX0wyUkZ0X1Ytb2hqQUdGbnpEV1Z2QWFSZHhHc0M2aU9jNkxSY0pjRDJpa0k2UTlYdWRFWHNUSkVuVmltV3pwdG5uVENCeXZDMTE1NWNj0gGmAUFVX3lxTFBsODJ0QWV6bm1SbV9lWUZaVDQ4NFdIUWxtNFp0UWxKNFhwbkhBTnNaNVNoY1VlWEVCU1RXejFDUDlneXpFdHh4Ym1MeldRRGtyZEV1SENqRzkwVTNVRHQ0dXpBYUtEdWI0UFhjWmptTjdMdENIWFhqY3R0c1pMYnlPZHdlZVVqMDFiVk1aWUNKY1UzZzRwa0dRYTZlSlpnYTBnN3dwTnc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Mar 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum, and XRP Price Prediction For The Coming Week! - Coinpedia Fintech News",
        "content": "Elena is an expert in technical analysis and risk management in cryptocurrency market. She has 10+year experience in writing - accordingly she is avid journalists with a passion towards researching new insights coming into crypto erena.\n\nThe cryptocurrency industry continues to display a significant fluctuation in the chart, suggesting an increased price action in the market. Further, the market leader, Bitcoin price, has successfully claimed a new all-time high of over $73,000, highlighting a positive outlook for the market in the coming time.\n\nOn the other hand, the altcoin leader, the Ethereum token, had successfully crossed the $4,000 market during the previous week, following which it experienced a significant correction in valuation. Further, the XRP token has displayed a similar trend, indicating increased volatility in the crypto space.\n\nBitcoin (BTC):\n\nThe Bitcoin price traded in a closed range between $50,540 and $52,853 for a brief period. As the volatility in the market increased, the bulls jumped 24.53% within three days, following which the price faced rejection at $64,287. After trading sideways for a while, the bulls regained momentum and jumped 11.03% before facing rejection at $68,296.\n\nThe bulls then lost momentum and tested their low of $61,025, but the bulls quickly regained momentum and leveled all their losses. Following this, the bulls constantly traded under a bullish influence and recorded a new ATH of above $73,000. Since then, the price has been trading under a bearish influence.\n\nTradingView: BTC/USDT\n\nThe technical indicator, MACD, displays a decline in the red histogram, indicating a decrease in the bearish influence in the crypto space. Further, the averages show a high possibility of a bullish convergence, suggesting a bullish price action for the BTC price in the coming time.\n\nIf the market holds the price above the support level of $68,296, the bulls will regain momentum and prepare to test its upper resistance level of $73,844 during the coming week. Conversely, if the bulls fail to regain momentum, the price will lose momentum and fall to test its lower support level of $64,287.\n\nEthereum (ETH):\n\nThe ETH price traded in a closed range between $2,609 and $2,883 for over a week, after which the bulls gained enough momentum to break out of the resistance level, where the price displayed a neutral trend for the next few days. As the volatility increased, the Ethereum price jumped 16.25% within the next three days, following which the price displayed a neutral trend.\n\nAfter testing its low of $3,369, the bulls reimagined momentum and recorded a jump of 17.42% before facing rejection at $3,956. Recently, the bulls recorded another jump and successfully reclaimed the $4,000 mark, where the price traded sideways for a while. Since then, the price has been trading under a bearish influence.\n\nTradingView: ETH/USDT\n\nThe Moving Average Convergence Divergence (MACD) displays a constant red histogram, indicating an increased bearish influence in the crypto space. Moreover, the averages show a flatline, suggesting uncertainty in the future price action of the coin in the market.\n\nIf the market pushes the price above the resistance level of $3,733, the bulls will regain momentum and prepare to test its upper resistance level of $4,200. Negatively, a trend reversal may pull the price toward its lower support level of $3,369 in the coming time.\n\nRipple (XRP):\n\nThe Ripple (XRP) token traded in a consolidated range between $0.530 and $0.578 for about two weeks, following which the bulls gained momentum, and the XRP price jumped 13.5% before facing rejection at $0.6015. After this, the price displayed a neutral trend by trading between $0.578 and $0.601 for a while.\n\nAs the market volatility grew, the bulls successfully broke out of the resistance level, where they traded between $0.6015 and $0.6625 for a brief period. Recently, the bulls jumped 21.52%, after which it faced rejection at $0.7310. Since then, the price has been displaying a negative trend in the chart.\n\nTradingView: XRP/USDT\n\nThe MACD displays a constant decline in the red histogram, highlighting a decrease in the selling pressure within the crypto industry. Further, the averages show a potential bullish curve, suggesting the price may undergo a bullish price action during the coming week.\n\nIf the market holds the price above the support level of $0.6290, the bulls will regain momentum and prepare to test its upper resistance level of $0.6930. Conversely, if the bears overpowered the bulls, the price would lose momentum and fall to test its lower support level of $0.5780 in the upcoming week."
    }
]