[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMi6wFBVV95cUxOdkozWlBEcTdJSzdXbExYeUlYRkZRVFNYX3JzQWFSaTZGZGlVS2FlVVJlZ0puNWdVbW9Ua0h2eGg0V3kzOUozUDYtOE52ay1pUHBZQmhMZkVNRmJ1WlN6dy1SbWl3MUIwemJiendPSHNMTGJBSWhSQmwyRkZqYmF3Q1BRWWJiZHN4NldPRUNXaVJhbUJPNUlfSlM5czhOSVpYZHlZWVpnZU80ZlNEdmFlMThac0RBdHJfZFFISHY1a1JLVUZtYjVYNnd5X2JkMW9pV0RRcVBuQlEwNUZkSXdJaFM4UGpVaXd2SkFj?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Feb 2024 08:00:00 GMT",
        "title": "GoDaddy and Ethereum Name Service Simplify Connecting Domain Names and Crypto Wallets for Customers - PR Newswire",
        "content": "Users can now connect their GoDaddy domain with their ENS name for free, seamlessly connecting DNS to ENS and the Web3 ecosystem\n\nTEMPE, Ariz., Feb. 5, 2024 /PRNewswire/ -- GoDaddy (NYSE: GDDY), a global leader in domain registration and web hosting is excited to partner with Ethereum Name Service (ENS), a pioneer in blockchain-based naming systems, to enable domain name users to link their domains to ENS effortlessly, with no additional costs or technical experience required. This collaboration signifies a major step toward bridging the gap between the Domain Name System (DNS) and blockchain technology.\n\nDNS is a naming database that interprets readable addresses (domain names) into a unique string of numbers called an Internet Protocol (IP) address. Similarly, ENS simplifies complex wallet addresses into human-readable names. By connecting the two, it empowers domain owners with the combined security and reliability of GoDaddy, a globally recognized brand, along with the cutting-edge benefits of ENS's blockchain infrastructure.\n\n\"As a long-time domain industry steward, we are always looking for innovative enhancements that benefit our customers,\" stated Paul Nicks, president of domains at GoDaddy. \"Partnering with ENS presents our customers with a unique opportunity to experience the fusion of domains names and blockchain technologies, bringing some great benefits for users in both areas.\"\n\nWhile it has always been feasible to bring domain names over to ENS, barriers like high gas fees have limited the seamless transition. To help, ENS deployed new smart contracts to enable the resolution process of domain names in ENS, at the DNS top-level domain (TLD) level. This allows verification of DNS records, enabling a cost-free method for users.\n\nThis integration not only simplifies user experience but also fosters a sense of trust in digital identities. Domain owners and crypto wallet holders can now enjoy a newfound convenience, effortlessly linking their digital assets for efficient management.\n\n\"With this milestone, we are furthering our mission to build a more secure, decentralized and user-friendly internet,\" said Nick Johnson, founder of ENS. \"ENS, much like DNS, is a public good and a core part of the internet infrastructure. By pairing up ENS names and GoDaddy domains, we will streamline the way users interact with web domains, blending the familiarity of the DNS with the potential of blockchain technology.\"\n\nThis important advancement simplifies the use of digital properties, creating an environment of convenience and trust. Learn more about linking domains at GoDaddy. For additional information about ENS's integration with GoDaddy, click here.\n\nAbout GoDaddy\n\nGoDaddy helps millions of entrepreneurs globally start, grow and scale their businesses. People come to GoDaddy to name their idea, build a professional website, attract customers, sell their products and services, and accept payments online and in person. GoDaddy's easy-to-use tools help microbusiness owners manage everything in one place, and its expert guides are available to provide assistance 24/7. To learn more about the company, visit www.GoDaddy.com.\n\nAbout Ethereum Name Service\n\nThe Ethereum Name Service (ENS) is a distributed, open, and extensible naming system based on the Ethereum blockchain. ENS addresses allow anyone to register a .eth domain which they can then connect to multiple wallets, and use across all of Web3. Founded with an Ethereum grant in 2017 by Nick Johnson, ENS quickly grew as the most widely used permissionless domain name protocol in the world. With over 2 million names registered onchain and over 4 million names offchain, the protocol aims to become the neutral naming protocol for all.\n\nSource: GoDaddy Inc.\n\nSOURCE GoDaddy Inc."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE5SX3FhUkpocG1ubWthQ2NjckpkT3Y3bzlVeFl3dXNrYUN2MXlaYTlvMm5UcnlrMzAzRmlRVUFWRjNWTW5SZjhneEN4UDhoeXRYbjRtY09ybS1KcEdYUmRSUUs4QzdfTlVNdHFvNnd4WlMxMTR3cUlZ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Feb 2024 08:00:00 GMT",
        "title": "ENS partners with GoDaddy to enable users to link wallets to domains - Blockworks",
        "content": "Ethereum Name Service (ENS), a domain naming system on the Ethereum blockchain, has partnered with GoDaddy, a domain registrar, to enable users to easily link their wallets to web pages.\n\nENS can be considered the blockchain-based counterpart to the Domain Name System (DNS) that is widely utilized in Web2.\n\nDNS services assign unique IP addresses to devices, facilitating the translation of these addresses into user-friendly domain names for accessing internet web pages. Similarly, ENS services convert intricate wallet addresses into easily readable names.\n\nThis latest integration with GoDaddy, one of the world’s largest web hosting providers, will allow users to connect their simplified ENS wallet addresses with their DNS.\n\nBridging the gap between Web2 and Web3 comes with its own set of problems, however, like concerns around censorship.\n\nRead more: Ethereum devs consider ‘existential’ upgrade to the EVM\n\nMost recently, Kubi Mensah, the co-founder of Gattaca, noted in a post on X that its domain was suspended indefinitely without any prior notice.\n\nAlthough the issue was resolved after escalating concerns to the senior management of the domain provider, the reason for the suspension was never made apparent.\n\n“We see this incident as a reminder that the fight against censorship is hard but worth every bit of our effort,” Mensah wrote.\n\nGenerally speaking, due to the decentralized nature of Web3 domains, entities themselves can not suspend, take or control an ENS .eth domain, Nick Johnson, the founder and lead developer of ENS, told Blockworks.\n\n“ENS .eth domains are censorship-resistant and tamper-proof by design; even the ENS DAO has no power to revoke or restrict a .eth domain,” Johnson said.\n\nHowever, this latest collaboration is a gateway for Web2 domain users to access blockchain technologies via their domains, and ownership of a DNS domain ultimately remains with the registrar.\n\n“Names that are imported from DNS — using our new integration with GoDaddy or our legacy integration — remain subject to the registrar they are held with, and the rules imposed by the registrar and ICANN,” Johnson said.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxQaVk5YTdwRDhSNXlMQV9hRTRtdHYyOEZYWlhGS1U4R2lrUzRCYXg2ekJ6emxUWktvQTBwOW5FUXJDeVplMjBEZjFYZE83My1aakJ3LUc2UnhGOWllTko1SGNwbm9zZWNYMF9pTVVWTlFHNGlHNGVtRWRQeFJlUndFc3U3NjBWUnd3elJFNG5TQkMxakFKT2ptWlY5akNVTWxfdm5N?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Feb 2024 08:00:00 GMT",
        "title": "Watch K33 Research Senior Analyst on Solana, Ethereum - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxOckdHWW1IOUlJZzc0SndHOEpFc28xSFBRRUN3RjhWOVJpdUhFVlhaUVREeVB6ZjFKa0NmWTBnUnVEQk1qNU15SG9iMExXOGYyMWR4cU01ZGxWRmsxY19DVmpGcWxiU1BFcnRqQXVkZGpUVElWVzVYSFNKWUZ5R21kSTBkOUhaVm16V2w5eXZwZm9Gc1ZxbWfSAZsBQVVfeXFMUDVsMFQ5dndPdUc0bG5naDAyNUhwVFU4MmY0M2k0UUNNdlhPaWRQYVhZZHRyTU9VRHUtWnVTdzY4dHlLV1F2TmdEcjZWQUdUazcwMy1la1NIVkNzU2JvNDlJY1NURjdrVGVFVzBkcEVlSUtrS1RhNW9xai0xRTNPd3I2ODJ3NlN2WEdob2dnNGFwQlJHbjdSa1gtZ2c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Feb 2024 08:00:00 GMT",
        "title": "Ethereum (ETH) Supply Drop Starts: Are We Seeing Beginning of New Ethereum Era? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nThe Ethereum network has recently observed a noteworthy supply drop, entering further into the deflation area. This week's data showcases a supply change with a decrease of 393.60 ETH, leading to a total supply of 120,179,017 ETH. This decline does not immediately impact the asset's price; however, a sustained deflationary trend could signal a positive development for Ethereum's market performance.\n\nAdvertisement\n\nDeflation in a cryptocurrency like Ethereum signifies that the number of coins being burned — taken out of circulation — is exceeding the number being created or issued. Such a supply contraction, especially when continuous, can be beneficial for an asset's valuation, as it may enhance scarcity and potential demand over time.\n\nETH/USD Chart by TradingView\n\nAnalyzing the current Ethereum chart, we observe that ETH has been maintaining a steady posture above the 100-day EMA (orange line), a significant indicator of long-term market sentiment. This positive position, juxtaposed with the recent supply deflation, provides a solid foundation for a potential growth scenario.\n\nAdvertisement\n\nThe deflationary mechanism introduced by Ethereum's EIP-1559 is expected to play a vital role in the asset's price dynamics in the long-term future. As the network reduces its overall supply, each ETH token's relative value could increase if demand remains constant or grows. We might also consider this as a precursor to a new short-term era for Ethereum, where increased network activity causes severe deflation.\n\nThe recent outage of the Solana network adds an intriguing layer to the narrative. Historically, when alternative layer-1 networks face technical difficulties, Ethereum often benefits as the leading smart contract platform. The current downtime in the Solana ecosystem may redirect attention and activity back to Ethereum, potentially strengthening ETH's market position."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiX0FVX3lxTE9ER09QN1JrbnpYazBRWmdmS1pGalFxR1hUZFZEbGFTaTh2alZZLXd1VVREQS15anZ1Y2ROLWlhTmZXa1lSYlVkSGJUUHktdUlUTFl6d1NfczIzM1djLWpZ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Feb 2024 08:00:00 GMT",
        "title": "Gitcoin is restructuring to focus on grants for the Ethereum ecosystem - Blockworks",
        "content": "Gitcoin, an open-source software funding platform, has announced it will shift focus away from public goods funding and towards enhancing grants infrastructure designed for the Ethereum ecosystem.\n\nSince its launch in May 2021, Gitcoin’s organizational hierarchy has been relatively flat, with no CEO calling the shots. Workstreams, or focused groups dedicated to specific tasks or projects within the organization, have always required budgets to be approved through community voting — an often time consuming process.\n\nAs the DAO has evolved, however, it morphed from an impact-focused organization to something more technology-centric. Gitcoin executive director Kyle Weiss told Blockworks in an interview that this did not align well with the existing DAO structure.\n\n“It was too disjointed,” said Weiss. “In a DAO environment where everyone is fully remote, we have folks contributing from nearly every continent — stability, operations, and software development is really important, you need a core group of individuals who have context.”\n\nRead more: Gitcoin’s co-founder wants to return from the sidelines\n\nAs part of the new restructuring plan, two business units have formed within Gitcoin. One unit will focus on coordinating product-specific work, while a subDAO will manage matters of community and governance.\n\nWeiss noted that over the years, the company has experimented with various products. He said that some of these have been distractions, while others have been valuable to its growth.\n\n“A lot of 2024 is focusing on grants. We want Gitcoin to be much more associated with grants, whereas right now, our narrative has been around public goods funding, and that shift is because we’ve moved from being an impact organization to a technology organization,” Weiss said.\n\nFor this reason, Weiss explained the DAO will transition from independent workstreams towards a structure more akin to a “Labs” structure. This is something that is common among existing protocol development teams, similar to how Uniswap has Uniswap Labs or how Optimism operates with OP Labs.\n\n“We want to make sure there is stability in the software development side and then give the DAO material scopes of work to own,” he said.\n\nWeiss says that by granting software development teams greater leadership and more defined decision-making powers, the community can remain concentrated on achieving results through the grants programs via token voting.\n\n“I don’t know if the token holders are the right people to decide on multi-year roadmap decisions on the technology side,” Weiss said.\n\nGitcoin co-founder Kevin Owocki shared this sentiment.\n\n“It’s not proven that DAOs can develop software, so the Labs team is designed to recognize that in our organizational structure, and make sure that we’re building world-class software.”\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxQdk5EZFBoS1hBNVBtWDB3SlJSQ3JHVXhXbWZQdlo5VWV6RzVGRTBDNm1ic3ZJX0ZRMUJfajZTSjlVZFhmSWFFQnlTd2t1c29rZ0Zqak15N2lxdHVPOGF2M2hrWlYxQjY5WXowSHNiWW9PQk5KdzRvX1VINTl3TXpocFlDV1poUmM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Feb 2024 08:00:00 GMT",
        "title": "Bitcoin halving will impact Kangamoon, Ethereum, and Optimism - crypto.news",
        "content": "Disclosure: This article does not represent investment advice. The content and materials featured on this page are for educational purposes only.\n\nIn 2024, Bitcoin halving will happen. This event will likely impact altcoins like Kangamoon (KANG), Ethereum (ETH), and Optimism (OP).\n\nEthereum is evolving\n\nIn the coming years, Ethereum will continue to upgrade.\n\nAs it is, more institutions are adopting Ethereum, which has led to an increase in its total value locked and transition to a deflationary asset.\n\nDespite potential challenges, experts are bullish.\n\nETH is steady, with supporters bullish that a spot Ethereum ETF will be approved.\n\nOptimism navigating trends\n\nOptimism, a layer-2 scaling solution for Ethereum, has made notable progress ahead of the Bitcoin halving in 2024.\n\nIt has upgraded and integrated with Orderly Network.\n\nOP is trading at $3.16, down from $4.20.\n\nThe integration of OP’s Stack on January 21, 2024, is a significant milestone for decentralized finance (defi).\n\nIt is expected to bring more users and liquidity to Optimism, boosting its overall economic activity.\n\nThe integration has led to an 800% increase in address count on Optimism, indicating growing interest and adoption.\n\nMarket analysts have mixed predictions for OP’s future price. Still, the overall sentiment remains optimistic, given its role in the expanding Ethereum ecosystem and its contribution to scaling solutions.\n\nKangamoon’s future\n\nKangamoon combines social and gaming elements.\n\nIt aims to create a community where members can participate in various challenges and earn rewards and KANG.\n\nKANG is changing hands at $0.005 in the ongoing presale, but analysts expect more gains.\n\nYou might also like: Cardano takes on Ethereum, analysts bullish on KangaMoon\n\nKangamoon doesn’t have taxes on buying or selling KANG.\n\nAs the cryptocurrency market changes, Kangamoon’s unique approach and focus on the community could make it a significant player in the meme coin and digital gaming markets."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxQTThLaEdubHZBUUNjR1pHX1lPc2hpZ0t2SmpMTXFvRXVPS1c1X191Z1JUUjA4OVlqOGtVNFpHSDVtckpOcVc0ZHIyTWI2dHZWQl9iVEhJOEFBNVRkM3I4ZjVIVDVac1l5Zk9lZlRxSFg1QkdLQTBGWHV3SEhNUWdBedIBiAFBVV95cUxOQ05KVmpiZmhFMkxVT3hBNHRJZ2huT0gzWE42VVdsMGFwVGRhU0xQN3ZQV3F3aWVTNVlHSFcyV1ViOWFSYzJqS1FyZ1B4RDRCYkxsOE01U1VHWHY3azBsR0kzLVNraWV4WlRFWVh1Unp5QU1rcjNFM2R4c0VrTUNVODZlcm55QW43?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Feb 2024 08:00:00 GMT",
        "title": "Dymension Goes Live, Airdrops $390 Million in DYM to Solana, Ethereum Users and More - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nDymension’s anticipated airdrop took place on Tuesday as the network’s mainnet went live, serving up over $390 million worth of DYM tokens for early users and select communities as the token surged in value following the launch.\n\nDYM is currently up 58% on the day to a current price of $5.60, according to data from CoinGecko, with some $246 million worth of trading volume already on exchanges including Binance, ByBit, and KuCoin. The airdrop spans 700 million DYM tokens, representing 7% of the total supply.\n\nDymension is a network built to let developers deploy app chains that it calls RollApps, and it’s a layer-1 blockchain built using Cosmos tech and the inter-blockchain communication protocol (IBC) to connect with various other chains. Builders can choose from various virtual machines and tokens on their RollApps.\n\nThe “genesis rolldrop,” as Dymension called it, was available to more than a million unique wallets across various chains and communities, including users on the networks Solana, Celestia, and Ethereum scaling networks such as Arbitrum, Optimism, Base, and the upcoming Blast.\n\nAD\n\nAD\n\nCertain communities could also take part in the airdrop, including holders of the popular Pudgy Penguins NFT collection on Ethereum, as well as Mad Lads and Tensorians on Solana.\n\nWhile more than a million wallets could have claimed a share of the 700 million airdropped tokens, the claim already took place in January—and only 528,523 wallets ultimately made a claim, which means that around half of eligible users left money (or DYM) on the table. Those tokens were ultimately redistributed to other users.\n\nDYM is currently the second-largest token airdrop of 2024 based on the total value of the dropped tokens. It follows decentralized exchange (DEX) aggregator Jupiter on Solana, which airdropped 1 billion JUP last week—which, at the current price, puts the total value of that drop at $527 million.\n\nEdited by Ryan Ozawa.\n\nAD\n\nAD"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxPOHcxRzFVNG1fVGk0MkFWektiRVJMdEZzelJPbUVRa0xpQVo5aVVHOXBkYktmY0VuSGFVSlVKYzBwdDI5OXNqUHFOMVdBNlg5ZWtMVmdMekpGVW1QcjhjY1EtT1RVLVBxb2xjWU9wYzZnbHJOc0RleEU1cmdZXzB1MlZ5YWo2WjFTY2c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Feb 2024 08:00:00 GMT",
        "title": "Analyst: this coin may outperform Bitcoin and Ethereum in 2024 - crypto.news",
        "content": "Although the broader market has been relatively flat, the Bitcoin Minetrix presale has been active, pushing raised amount to over $10.3 million. Some supporters now believe Bitcoin Minetrix (BTCMTX) could outpace top coins like Bitcoin (BTC) and Ethereum (ETH) in 2024.\n\nThe project incorporates a stake-to-mine model for utility, adding value to its ecosystem.\n\nBTCMTX versus BTC and ETH\n\nSince Bitcoin and Ethereum are considered some of the safest (least volatile) cryptocurrencies, market participants often expect more sizable returns when buying other projects.\n\nNew coins typically have more upside potential because of their lower market caps.\n\nMeanwhile, the prices of Bitcoin and Ethereum are less volatile in each market cycle as liquidity grows from expanding market caps.\n\nBitcoin Minetrix will lists on various exchanges at a later stage; an opportunity some investors plan to exploit.\n\nBitcoin Minetrix’s stake-to-mine model\n\nBitcoin Minetrix takes a novel approach to one of crypto’s most pressing issues: Bitcoin mining.\n\nThe project has created a cloud mining solution on Ethereum for users to mine Bitcoin.\n\nYou might also like: Analyst says Ethereum can reach $10k in 2024, new altcoin likely to follow\n\nIt requires no specialist hardware or technical expertise. This addresses the problems of high-startup capital and skill requirements to begin Bitcoin mining.\n\nBitcoin Minetrix enables anyone to easily get started.\n\nTo get started, users stake BTCMTX, in exchange for Bitcoin mining credits. They can then burn these credits for cloud mining power, mining BTC.\n\nEarlier cloud mining solutions are regarded as shady due to a series of scams that have been carried out.\n\nThe Bitcoin Minetrix whitepaper highlights this issue, explaining that cloud mining protocols would lure investors with decent gains and then present “unwarranted complexities” once users deposit more cash.\n\nHowever, Bitcoin Minetrix believes in transparency and fairness, ensuring all transactions are recorded on-chain.\n\nFurthermore, no cash changes hands with Bitcoin Minetrix thanks to its stake-to-mine model.\n\nWill Bitcoin halving impact BTCMTX\n\nThe Bitcoin halving has correlated with the beginning of every crypto bull market.\n\nThe event, set for early April 2024, will halve miner rewards, creating a supply and demand discrepancy in the market.\n\nYou might also like: Next Bitcoin halving just 15k blocks away\n\nThis development might drive prices higher, possibly lifting altcoins like BTCMTX thanks in part to the project’s correlation to Bitcoin.\n\nSince Bitcoin Minetrix users earn real BTC rewards, the value of Bitcoin Minetrix is tied to the Bitcoin price.\n\nBitcoin Minetrix tokenomics and presale\n\nBitcoin Minetrix tackles the mining problem but captures value using BTCMTX.\n\nSince BTCMTX is key to earning rewards and can be staked, it will relieve the token of selling pressure.\n\nAlso, staking rewards are primarily paid in mining credits, not BTCMTX. This differs from most other staking coins, which pay rewards in their native token, leading to sustained sell pressure.\n\n42.5% of Bitcoin Minetrix tokens are allocated to Bitcoin mining, 35% to marketing, 12.5% to staking, and 10% to the community.\n\nIn the current presale stage, BTCMTX is available for $0.0133."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxNQVFlWTZpdkFNNVR5QlpCdk1GYXVTSGdyQVJ1UDltajdkM09sRUxvOElDckszaVlfaXl4WVFROFpVSTVXeDNuYWt5eFpma1pXVTVaU2Z1RDc5b1YxUmV4R1BKZUwtX3VCdkdydTM5MnQzS2RXOXU5dkR0bmFHUVFpWNIBiAFBVV95cUxQRFJLMWRLOEw2MXg1SmJnaVdnR2dXQ081ZDRKb0ZKd2g3Y3BtNzExRXBGem1QMEg2bGh0dHBJQWRLOHB4S3hyUVhOOWhsTGJiOVdCWFFvQ2ZKbTY4YmpudlFKUnZRZV9DMldwaWdOaUpUWVJPVjBUZ2tVX19WUkhZNDJpU3NsVkNM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Feb 2024 08:00:00 GMT",
        "title": "'Heroes of Mavia' Airdrops Token to 100,000 Gamers, Ethereum NFT Owners - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nHeroes of Mavia, a recently released mobile strategy game, today launched its MAVIA token and conducted an airdrop to 100,000 players—along with holders of some 10,000 Ethereum NFT land plots in the game.\n\nThe MAVIA token on Ethereum debuted early Tuesday and has spiked in value, jumping about 36% to a current price of nearly $3.10, per data from CoinGecko. The platform reported about $95 million worth of trading volume on exchanges like Bybit and Crypto.com, with a current market cap of over $92 million.\n\nDeveloped by Skrice Studios, Heroes of Mavia is a iOS and Android strategy game that’s very similar in approach to the smash mobile hit Clash of Clans. Heroes of Mavia will implement the MAVIA crypto token, however, and Skrice has sold NFT land plots that will be integrated into the game.\n\nAccording to Skrice, more than a million people downloaded the game following its release last week. The studio launched an airdrop program for 100,000 total players who synced their game account to the Heroes of Mavia website, and all 100,000 slots were quickly filled ahead of the token launch.\n\nAD\n\nAD\n\nHeroes of Mavia has reached 1,000,000 global downloads on iOS and Android 🎉 Join us on our mission to bring mass adoption to Web3 gaming - one player at a time! pic.twitter.com/5KyknZaOQA — Heroes of Mavia (@MaviaGame) February 4, 2024\n\nFurthermore, people who own the Ethereum land plots and participated in NFT staking programs that began in early 2022 will also receive a share of tokens.\n\nSkrice Studios has raised over $8 million in funding to date, with backers including Binance Labs, Crypto.com Capital, and Animoca Brands.\n\nEdited by Ryan Ozawa.\n\nAD\n\nAD"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMi9gFBVV95cUxQVV9uVl9IUFNXZGVjS3R5UDg3MExYR3NZUGlEVE4tcWx4RUFVZ09nTU8wbG44YUZfdjUtLUJOYW1wVUtSSl95dzZxZDhqRU9UUnNqRkFiLTBGWTduZGRxTGk3MnBLSlg5blBFSlFsRUgwYmRseVppVDNSaThxX25RSWpBc0poemdjdDZJZm8wRWFaVmw3REJGSGVHeVNQdTVhZWRtYWItb2k3STRGN3FTNm9USjNtREdwRjNNdmpNY1ZkdjF2dVJSVEhvUlIyZTNhcTRrQndPTnpIWGxPUC1DR0dDTk1MQ2J0bXIyVlFPdDRNZVN4NFHSAfsBQVVfeXFMTkRmNy1QazhKRTF3bXJma09mUjJPNmpORV85aXVLVThXTC14RTJCcDVpajFyRk15MDdueDFWVjRHanZtVXZQUWdfcVVLaUthZV9ZekdzVHhnbjJCNzZsSWM3RXFGX3FaUFZsRTZnRUZRZ3dpWkoyeGV4NEVpenpicWtTOTVSbXRZVUdIUWhIMW42bFpPMG01RE9PWnZ2b1dsdllnMzdzOS1jUFFibGstM19SYnF2UTZVaHdjRzcxYXowOF93MU5ra1pXTW5KdHBJMU14RTN2QXJTdUx4RmhBT0g1MGhudWpkazNGbWVrZ2h6OFFzelNOZGVITTA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Feb 2024 08:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: BTC to record rash move soon as Bollinger Bands contract - FXStreet",
        "content": "Bitcoin price could fall 5% to the support confluence between 100-day SMA and horizontal line at $40,650 as boring chop continues.\n\nEthereum price could revisit $2,200, a 4% correction, as the 50-day SMA proves impenetrable.\n\nA retest of the October lows around $0.4734 seems likely for Ripple price as XRP token holders show weakness.\n\nBitcoin (BTC) price continues to record a boring chop, trading horizontally, with altcoins such as Ethereum (ETH) mimicking the price action. Meanwhile, Ripple (XRP) price continues to suffer in the hands of unmotivated traders.\n\nAlso Read: Week Ahead: Crypto markets to turn volatile as AI steals the spotlight\n\nBitcoin price likely to fall 5%\n\nBitcoin (BTC) price is trading within a range, consolidating between the centerline and the upper band of the Bollinger indicator at $41,895 and $44,210, respectively. With the two Bollinger bands contracting, BTC could record an impulsive or rash move soon.\n\nThe Relative Strength Index (RSI) is closely bearish, teasing with a cross below the signal line (yellow band). The Moving Average Convergence Divergence (MACD) also appears subdued with miniature volumes on the histogram bars. This is also reflected in the Awesome Oscillator (AO), tilting the odds in favor of the bears.\n\nIf the bears have their way, Bitcoin price could descend 5% to find support due to the confluence between the 100-day Simple Moving Average (SMA) and the horizontal line at $40,650. If this level fails to hold as support, BTC could extend the fall into the demand zone between $38,496 and $39,582. A break and close below the midline of this order block at $39,196 would confirm the continuation of the downtrend, potentially going as low as the $37,800 support.\n\nBTC/USDT 1-day chart\n\nConversely, if bulls have their way, Bitcoin price could shatter past the upper band of the Bollinger indicator at $44,210. This could see BTC climb to $48,000, or in a highly bullish case, tag $50,000, nearly 20% above current levels.\n\nAlso Read: Bitcoin price gains strength as GBTC outflows shrink\n\nEthereum price could drop to $2,200\n\nEthereum (ETH) price action is almost similar to that of BTC. It could fall 4% to $2,200 as overhead pressure due to the 50-day SMA continues to build. The Proof-of-Stake (PoS) token’s price has made multiple attempts to breach this supplier congestion level to no avail.\n\nWith the RSI below 50, the AO and MACD in negative territory, and below the latter’s signal line (orange band), the odds favor the downside. Ethereum price could slip past $2,200 to test the 100-day SMA at $2,203. In a dire case, the fall could see ETH dip into the demand zone between $2,059 and $2,118.\n\n\n\nETH/USDT 1-day chart\n\nOn the other hand, increased buying pressure could see Ethereum price overcome the 50-day SMA to confront the $2,388 barrier. Flipping this into support could restore Ether into the ascending parallel channel, a gateway to more gains.\n\nAlso Read: Ethereum monthly transaction count climbs to highest level since July 2022\n\nRipple price looks for pullback as XRP holders show weakness\n\nRipple (XRP) looks ready to fall as it is stuck below the foothold of the midline of the descending parallel channel. Increased selling pressure could see XRP price retest the October lows around $0.4734, with technical indicators showing an unmotivated holder community. This is seen by the waning momentum on the RSI below 50 and the position of the AO and MACD in negative territory.\n\nXRP/USDT 1-day chart\n\nOn the flipside, enhanced buyer momentum could see XRP price breach the resistance due to the midline of the channel, bringing the $0.6000 psychological level into focus.\n\nAlso Read: XRP price trades broadly unchanged leading up to crucial milestone in SEC vs. Ripple lawsuit"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxPMXpHeDRQTVVvaENTcVpiQl9yVXZIRmZYbkdWV0t3NDZsaTd5Z2VOTzFpdl9HTFBrb2VJTzAzNlBiNHktR0t5TEgtZE1LN3NtZWduNHh3R0tJSmg5NHdtbVBHYmVhRlFSX28zcjlrckJ1VTM2OTl2am43a3lJb1JfQVc4VGVwdE1aX0VoU3ZyeElxWEJId2N1c052RHc3cVU1Z3JhSDV3clhCblZkblVMQVBUVdIBuAFBVV95cUxOY3dDNk5rMXFTMU9HcGVEcWhGRm5LWUFtb1dOVm5JdmhBaXdaMzNyUWNlSWZYeVpzVHNEWjQzNGdnRVA4NjZnZDljWl8tal9TVWNLRHhrMmd3VWwtQ2RoVFpKc1JpMlhBLV9wZ3ljeEprTHdwWlRiUENkWXA5X3UyUWs3M254UE1RUURxX25JRzd0cWxpa3FkTXpvYTZ0c1AzTnU1MzNUQzFvTHZabktFdS1oYXFLRXNm?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Feb 2024 08:00:00 GMT",
        "title": "Solana (SOL) Gains Crucial Foothold, XRP's Movements Are Too Predictable, Last Resort for Ethereum (ETH)? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nSolana is showing signs of a potentially significant technical development on its trading chart against Ethereum. The asset is currently engaging in a critical battle at the 50-day EMA, a level that will determine the medium-term trend direction for the asset.\n\nAt this juncture, the 50 EMA is acting as a dynamic resistance level. Solana's attempts to break above this level have been met with resistance, but there is a persistent effort from the bulls to push through. Should Solana manage to decisively close above the 50 EMA, it would likely confirm an important new support level, which could bolster investor confidence and potentially lead to a new leg up in its price against ETH.\n\nHowever, despite the bullish attempts, the volume profile suggests that there is not substantial buying activity to give Solana the powerful push it needs to sustain above the 50 EMA. The volume, a crucial indicator of market enthusiasm, is somewhat lacking, indicating that the current push may not have the necessary momentum to create a reliable new support level.\n\nThe support level to watch, if Solana fails to break the 50 EMA, is positioned around the 100-day EMA. A retracement to this level could provide a bounce-back opportunity for the asset, but it would also reflect short-term bearish sentiment, indicating that the market is not ready for a breakout.\n\nAdvertisement\n\nXRP stays irrelevant\n\nUnpredictability is often the name of the cryptocurrency game. However, XRP has recently been tracing a path \"too predictable\" for a cryptocurrency. A few days ago, XRP appeared to be gathering momentum, but a swift correction quickly dispelled the budding optimism, bringing it down to lower support levels.\n\nThe focal point for traders now is the $0.47 support level. This key threshold is anticipated to be the springboard for a potential reversal. Yet, the timing of when XRP might reach and rebound from this level remains nebulous. The lack of volatility in XRP's price movements is serving to complicate predictions further.\n\nVolatility is a measure of trading opportunities, with larger price swings offering more potential for profit (and loss). The current state of flatlined price action limits these opportunities, potentially driving traders to look for more dynamic assets to trade.\n\nThe resistance levels to watch are at $0.5714 and $0.5633 which, if broken, could suggest the beginnings of a reversal pattern. However, without significant buying activity, these levels may continue to cap any upward movements.\n\nEthereum's last stop\n\nEthereum approaches a key technical indicator, and the outcome could dictate the asset's trajectory in the coming weeks. Currently, Ethereum's price hovers near a crucial point, engaging with the 50-day EMA.\n\nAt this juncture, the 50 EMA serves as the immediate resistance level. The ability of ETH to break above this mark is crucial — if successful, it could signal a return of bullish momentum, with potential targets set at higher resistance levels, such as the recent high around $2,436. Failure to breach this level, however, could spell trouble for Ethereum's short-term prospects.\n\nA rejection at the 50 EMA could lead to a price retracement toward the 100 EMA (the orange line), which is currently near the $2199.9 mark. This would not only negate the recent progress but could also result in bearish sentiment, potentially establishing a downward trend.\n\nFurther complicating the picture is the volume profile. The descending volume as the price approaches the 50 EMA suggests a lack of conviction among traders, which could imply that the push to overcome this resistance might not be supported by strong buying pressure. In market terms, a decrease in volume during a price increase often precedes a reversal, indicating that the current movement might lack the necessary fuel to sustain a breakout."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxOX09ScEpEb19pYkhFbmVOQjIwRW5oMXJqcTdrMGtCX25lbmtxZHJJZHk4ZUotMnl6OUJNdExVVkdQWGotNDFReVQzaURiaDE3VFhlY29tckJLWVJjUmxUd0lMQzZia3daamlOQlJINVZpLUJMX0RQak03S2pRNnZWUHpwLURiQdIBjgFBVV95cUxPUUFsMk8tVkY5dm5KWi02WlFSVk55eEQwSnV2THRUX25DeHdWNEZLRDZKWnZHbk1HeUlJZzlPZUpPZnhkNXdtX2NYdXRJLVlXRnhwTHdSWVNiSEtpZFhWd3JLMzR6SHluN1BVeEVkRHdXMXhuMHdoeXFzM3NlSExmZzJZX3V1QmRRQlVUS2Fn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Feb 2024 08:00:00 GMT",
        "title": "What Is Farcaster and Why Is Crypto So Excited About the Twitter Alternative? - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIn the last two years—particularly, since Elon Musk’s divisive purchase and overhaul of Twitter in late 2022—a number of upstart decentralized social media protocols have attempted to harness the transparent, uncensorable power of blockchain networks to improve the online social experience.\n\nFarcaster is the latest such project to do so. Now, it’s making waves after releasing a key update that has attracted thousands of new users in a matter of days. Here's why Crypto Twitter is so optimistic about this new potential replacement.\n\n(Video by Rug Radio Creator Benjamin White.)\n\nAD\n\nAD\n\nWhat is Farcaster?\n\nFounded by Coinbase alums Dan Romero and Varun Srinivasan in 2020, Farcaster is a social media protocol built on Optimism, the Ethereum scaling network. On top of the public and decentralized Farcaster ecosystem, users can create (and have created) a slew of integrated apps that perform various social media functions.\n\nThe most popular app built on the Farcaster network is Warpcast, a Twitter-like platform for writing posts (called “casts”), following other users, and liking or sharing (“recasting”) those users’ posts. Though a slew of apps currently live on Farcaster, Warpcast accounts for almost half of all sign ups across the entire protocol, according to on-chain data from Dune.\n\nMost of Farcaster’s most popular accounts are major players in the crypto space: Ethereum co-founder Vitalik Buterin, Ethereum core developer Tim Beiko, and Base creator Jesse Pollak.\n\nFarcaster shares its main selling points with other decentralized social media protocols: a lack of censorship, control over one’s data, and seamless interoperability of accounts across all apps built on the network. That’s opposed to, for example, the lack of interconnectivity between accounts on Twitter and Instagram.\n\nOne element that particularly distinguishes Farcaster from other social media protocols is the network’s emphasis on eliminating bot activity. To sign up, users must pay a $5 sign-up fee, meant to prevent the creation of spam accounts. Further, users can only post a limited number of “casts” on Farcaster apps, which are tied to packages called storage units.\n\nAD\n\nAD\n\nStorage units, which go for $5 a piece, grant a user 5,000 casts, 2,500 reactions, and 2,500 links or photo posts within a one-year period. Users who wish to buy additional storage units to post more can do so via a fairly technical and complicated process. This storage unit structure was designed to prevent Farcaster apps from being inundated with the millions of bot comments and likes that plague traditional social media platforms like Twitter.\n\nBut far and away, the most popular innovation on Farcaster is called Frames—and it upended the protocol’s trajectory overnight.\n\nWhat are Frames?\n\nLaunched on January 26, Frames are a new Farcaster feature that allows users to perform a suite of functions, both on-chain and off-chain, within Farcaster apps—without exiting to a third party.\n\nOn Warpcast, for example, users scrolling through a feed of casts can now click on a Frame posted by someone they follow, and perform a variety of functions—including minting NFTs, browsing an art gallery, playing games, subscribing to newsletters, and making online purchases—all while staying in their feed.\n\nSome popular Frames include “Girl Scout Cookies,” which enables one-click purchases of the popular dessert, “Nethria,” a text-based monster combat game, and “NFT Mint,” a gasless NFT drop.\n\njust came across one of the coolest new features in social media that I've seen in a decade not being dramatic, it's actually genius@farcaster_xyz Frames TL;DR - you can embed an \"iframe\" (not fully) into your tweets (casts) and people can interact with them without leaving… pic.twitter.com/30e9lgGkfa — mert | helius.dev (@0xMert_) January 28, 2024\n\nFrames is powered by Farcaster’s EdDSA authorization system, which already underlaid the Farcaster ecosystem. According to Farcaster co-founder Dan Romero, that structure eliminates the possibility of wallet drains, spoofing, and other malicious crypto hacks.\n\nAn easy to miss part of frames is it's powered by Farcaster's EdDSA auth system. 1. UX — every Farcaster user already has an EdDSA in the app they are using whether Warpcast or Supercast or something else. Every Farcaster client supports frames under the hood. And for… — Dan Romero (@dwr) January 29, 2024\n\nAD\n\nAD\n\nCurrently, on-chain functionality for Frames is limited to Ethereum-affiliated networks. As soon as next week, however, Farcaster’s founders have indicated the protocol will expand to support Solana.\n\nFarcaster is easily my favourite app in crypto right now and it's now coming to Solana 😱 colossal hint: with Farcaster Frames (embeddable actions into posts) — Solana is the **only** way to go from frames -> onchain without a backend OPOS pic.twitter.com/qrxte8okiy — mert | helius.dev (@0xMert_) February 2, 2024\n\nWithin days of introducing Frames, Farcaster exploded in popularity. The ecosystem, which typically supported around 2,000 daily users in recent months, quickly shot up over 1,300% in activity, to an average of over 28,000 daily users by Monday, according to data from Dune.\n\nThe volume of casts and likes on the platform has increased exponentially over the same period, from an average of 100,000 daily engagements just weeks ago, to over 2.3 million on Monday.\n\nAll in all, just north of 125,000 users have signed up for Farcaster so far—a statistic that pales in comparison to mainstream social media platforms, but nonetheless marks a substantial milestone for an on-chain network that has yet to cater to non-tech savvy users.\n\nEdited by Andrew Hayward"
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxOU0FmWERSOEF4My1PUWFDX0lSMy1pQ0s0MDZfWmx0cWsyaFMtZmdDeFRTdEEzazB3UkVjR1R1c0dLOFhYZEk4TURQN1YybGlLMm0tR0RLbk5ra0lGZTZ4Qzk0UjVlLW9uY0d1ZzJlVDF5MzlYN3E2X1hpdjAzX0gzM19nZS1RNzRkMVpPU1JlLXdXNUNDVllINW4zR2h0dGZSMDJF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Dogwifhat: some crypto-wallets pocket over $1.3 million - The Cryptonomist",
        "content": "During the weekend, it seems that some crypto wallets that collected a large supply of the Ethereum version of dogwifhat (WIF) pocketed over $1.3 million. The incident suggests that these are apparent “insiders” of the project.\n\nEthereum Dogwifhat: 12 probable insider crypto-wallets of the project pocket over $1.3 million\n\nOn Saturday, it seems that the Ethereum version of dogwifhat (WIF) was pumped and then dumped within a few hours, showing some suspicious data.\n\nAnd indeed, it seems that there are 12 crypto-wallets that, thanks to their wide supply of the memecoin version Ethereum, have managed to pocket a whopping 1.3 million dollars.\n\nThe suspicions suggest that these crypto wallets are apparent “insiders” of the project. This is confirmed by the on-chain analysis tool Lookonchain, which shows that these crypto wallets have purchased 24 million Ethereum WIF tokens for 3,000 dollars in ETH.\n\nThe purchase took place in the same block in which the deployer opened the negotiations, which implies that the trader knew exactly when the tokens would be issued and traded.\n\nAnyway, on Saturday, the Ethereum WIF went from prices of fractions of a cent to 30 cents in just a few hours, and then crashed by over 80%.\n\nEthereum Dogwifhat: word from the creator\n\nAlways on Saturday, on X, the issa account came forward, claiming to be the creator of the crypto dogwifhat.\n\nAs many of you know, I originally created the meme you all know as \"dogwifhat\". It recently gained a ton of traction within the crypto space, most notably through a coin named $WIF that launched on Solana, currently trading at $270M~ market cap.\n\n\n\nWith so many of you reaching out… — issa (@issa) February 3, 2024\n\n“As many of you know, I originally created the meme that you all know as ‘dogwifhat’. Recently, it has gained a lot of popularity in the cryptocurrency space, especially thanks to a coin called $WIF, launched on Solana and currently traded with a market cap of 270 million dollars. Since many of you have contacted me and the $WIF team has never recognized me as the original creator, I wanted to clarify that I have no affiliation with them and I have never owned or received any allocation. Today I officially announce that I will launch the REAL $dogwifhat, but on Ethereum. The website explaining the origin story of dogwifhat is directly linked below this text. If you are not familiar with the cryptocurrency space, please proceed with caution, this is not financial advice. All other tweets following this can be found on the official website @dogwifhat_eth”\n\nIn practice, the Ethereum version of dogwifhat is not connected to Solana-based WIF, which was launched at the end of November.\n\nSeventh crypto in the “Meme” category\n\nMeanwhile, looking at the meme crypto ranking by market capitalization, the dogwifhat (WIF) based on Solana blockchain is in seventh place.\n\nWIF has a total market cap of over 217 million dollars, not far from the other meme cryptos like FLOKI (265 million dollars) and MEME (227 million dollars).\n\nOn the memecoin scene, the dominant one is Dogecoin (DOGE) with over 11 billion dollars of market cap, followed by SHIB with 5.2 billion dollars and BONK with 655 million dollars.\n\nIn the last month, WIF Solana-based has seen a price pump of 97%, with the price going from $0.09 to the current $0.21. However, during the month, its highest recorded price was $0.45."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxNWmI0bndHdFFpbC1fV1RpZDlScUVKc21tRmRxbEV2XzRoNjhLd1lsUE5FdUJZVGdfdE5WeHlONGhoMlhWVV9PNmNIcERUUHFNY1RXd0s0ek0wU0NTcmtPRkItRkM5Tngxb2ZhOE9aMEJwcm84VDI1czRNd2k2bXNEbUxTb3NRZ0pjRVI4SjdnNm5ud01GeE1IODlsYmZfNEtB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Feb 2024 08:00:00 GMT",
        "title": "Bybit Report Predicts Ethereum Rebound in 2024 - Canada NewsWire",
        "content": "DUBAI, UAE, Feb. 5, 2024 /CNW/ -- Bybit , the world's third largest crypto exchange by volume, has released a new report reviewing the hottest trends in 2023, digging into the reasons behind them, and exploring what is to come in 2024.\n\nIn 2023, among several sectors studied, AI tokens have been the standout performers, outperforming most asset classes including Bitcoin and big tech. This remarkable performance underscores the burgeoning interest in AI technologies and their increasing integration into blockchain applications.\n\nBybit Report Predicts Ethereum Rebound in 2024\n\nAs the market evolves, Bybit boffins anticipate that BRC 20 tokens built on top of Bitcoin will take the limelight as more communities explore Bitcoin's utility as a base-layer.\n\nIn addition, Bybit's analysis suggests that tokens connected with the Decentralized Physical Infrastructure (DePIN) sector, including those used in computing, are expected to hold stable prices in the face of potential selling pressures. This stability is indicative of the sector's resilience and the sustained demand for decentralized privacy and networking solutions.\n\nFinally, this anticipated shift could signal a reconfiguration of market dynamics and investor confidence in Ethereum's long-term prospects.\n\nFor more detailed insights and the full report, please visit here.\n\n#Bybit / #TheCryptoArk\n\nAbout Bybit\n\nBybit is a top-three cryptocurrency exchange by volume with 20 million users established in 2018. It offers a professional platform where crypto investors and traders can find an ultra-fast matching engine, 24/7 customer service, and multilingual community support. Bybit is a proud partner of Formula One's reigning Constructors' and Drivers' champions: the Oracle Red Bull Racing team.\n\nFor more details about Bybit, please visit Bybit Press .\n\nFor media inquiries, please contact: [email protected]\n\nFor more information, please visit: https://www.bybit.com\n\nFor updates, please follow: Bybit's Communities and Social Media\n\nDiscord | Facebook | Instagram | LinkedIn | Reddit | Telegram | TikTok | X | Youtube\n\nSOURCE Bybit"
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxQN3lYMjhUZHZZUEhfeEVsNlZ4UHdUbFp3bWNRcFdiMFNQN0ZIci1YcWExeTNSSnJEcDN4MXZQU1psY2docjZ1b05zNkFrY2dZVVdqTUNwVExGSDZxRzdBUUtudVlMdkwyMDU4TXFQT05qcEptdW9SS1dJRHdpdERkclhsZGE0NFIzLWNkUk54WmdJNzZvaXdQTTJvM1VaZzhGY0VVNkhfd2tvOWtOc1ZZVmt0UzZ2Z9IBuwFBVV95cUxQU3FmdERWa2ZGWHI5dmhEd3hDQVNndWtfS1JBaGQ4bktGSTRXamNuT2V0YlJFdzlTVnZDRGVOWDZfd1lHX3FtbHk3OGRjWDBWMUdvQS1RUU5LakpTNmRjM1lVcHUzLTh6UHRGNTBpSmdJRVV6Tm9UMDh6THhpcGI3Wkw2Q2FOTmxnYllDZXc1LXN3ZTdpVXlEVEJyRlM1djdXNjkxWUhJT2J1cnBHX0FkM1VRLTdwbVpNdU9n?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Feb 2024 08:00:00 GMT",
        "title": "Kelexo (KLXO) Cryptocurrency Sale Becomes Spotlighted in February as Ethereum Classic (ETC) and Cardano (ADA) Holders Remain Optimistic - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nIn the midst of a market resurgence, Ethereum Classic (ETC) and Cardano (ADA) holders eye potential profits, with Ethereum Classic’s (ETC) upside supported by discussions of an Ethereum ETF. Cardano (ADA) faces challenges but remains crucial at the $0.5 psychological support.\n\nAmidst this, Kelexo (KLXO) steals the spotlight, revolutionizing decentralized lending within Web3. The ongoing presale witnesses growing interest, offering profit-sharing opportunities, a Kelexo (KLXO) wallet-linked debit card and a disruptive approach to traditional lending processes. Kelexo's (KLXO) comprehensive ecosystem and ongoing success position it as a significant influencer reshaping the landscape of online lending in 2024.\n\nSupporters of Kelexo (KLXO) can take part in pre-sale and buy tokens here .\n\nEthereum Classic (ETC): A potential upside\n\nWith discussions about an Ethereum ETF in May 2024, Ethereum Classic (ETC) emerges as an intriguing option with the potential for sharper moves. As a smaller-cap coin compared to Ethereum (ETH), Ethereum Classic (ETC) presents a higher upside. The coin's current price, hovering around $24.45, indicates a potential uptrend continuation, supported by its resilience above the 38.20% Fibonacci level at $23.24.\n\nAdvertisement\n\nCardano (ADA): Navigating turbulent waters\n\nCardano (ADA) faces turbulent market conditions, reaching a critical psychological support level at $0.5. This level holds significance, triggering emotional trading decisions. Cardano’s (ADA) price action around this level is crucial, as a bounce could signal a potential reversal toward upper resistance levels. Conversely, a breach of the $0.5 support may lead to further declines, with key support at $0.4738 and a possible last stand at $0.42.\n\nKelexo (KLXO): Lending redefined within Web3\n\nKelexo (KLXO) is a unique decentralized lending platform that simplifies borrowing and lending using smart contracts. Investors are attracted by the opportunity for profit sharing and a Kelexo (KLXO) wallet-linked debit card for global transactions. The ongoing presale indicates a growing interest in decentralized financial solutions, positioning Kelexo (KLXO) as a notable player in the cryptocurrency world.\n\nThe platform's Web3 model, without Know Your Customer (KYC) requirements and featuring instant transactions, disrupts traditional lending processes burdened by bureaucracy. Kelexo (KLXO) addresses common issues like high fees, paperwork and limited access, making it an attractive alternative for borrowers and lenders. The ongoing presale reflects a growing interest in decentralized financial solutions.\n\nKelexo (KLXO) offers a complete system, including a worldwide spending debit card, immediate cryptocurrency exchanges with no fees and a rewards scheme. Those who invest early can receive a portion of the fees generated by the platform according to their holdings. The platform supports decentralized governance, enabling users to propose and vote on enhancements. Additionally, a VIP program provides users with account managers, cashback perks and interest payments, enhancing user involvement."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxNdkh0dTltMWVTcjNvWU42Nk1aTnJyM1Jaek9fbE5CbGtHT2plUjhwaFZYcDNIWklTdkJHWmJlbTdyNXRJNnlCWVZtbEFrUTJucl9kT1dGMVh0OGNmckpPUGtHdE0zMmZCTnNNcXc1cTliemZCOUNMX0Q1THd4UnVldktFQmJaVEpEVzNYRElBZU9PMW5wWnY2enZ4M21JVUk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Feb 2024 08:00:00 GMT",
        "title": "Mollars ICO & What You Need to Know About Ethereum Blockchain’s New Bitcoin - CryptoPotato",
        "content": "The official Initial Coin Offering [ICO] for the Ethereum blockchain token “Mollars” launched on Monday, November 21st. The token price starts at $0.30 in the first phase.\n\nMollars is a hybrid cryptocurrency that will be an alternative to Bitcoin as it’s a store of value tokens. There will be a difference, however, as it’s starting a decade after BTC was first introduced to the world.\n\nWhat are Store of Value Tokens and Coins?\n\nLike Bitcoin, Mollars aims to be a store of value that’s in high demand, and the founder will not hold tokens privately. Possibly as high as 99.5% of today’s cryptocurrency founders have a personal stash of tokens that was likely introduced to investors through the ‘fine print’ in the crypto brand’s whitepaper.\n\nIn Mollars whitepapers, it’s clearly stated that no party involved in the development of this token will be given tokens. A complete 100% of the tokens generated by the founder and developer team will be put onto the crypto market and exchanges.\n\nAnother attribute that makes Mollars a store of value, like Bitcoin, is that it will be fully decentralized.\n\nThe founder will not own the brand. The creator of the token created infrastructure and formulas to give the token longevity, but the enigmatic figure will have no control over the token once it has been released on top crypto exchanges.\n\nMollars ICO and Potential Exchange Listings\n\nThe first exchange that Mollars will be listed on is Uniswap, the world’s #1 decentralized crypto exchange. If the ICO reaches its goal of US$ 2 million dollars, it will have a listing day price of US$0.62.\n\nThe 62-cent listing would mean today’s first-round ICO investors would get ROI Yields of over +200%.\n\nThe price of the listing day could be weaker if the US$2,000,000 milestone is not met with the Initial Coin Offering fundraising.\n\nWith 15,661 tokens sold since its debut on November 21st, the Mollars ICO listing is averaging a daily buy rate of just over 2,610 tokens. At this rate, it would take the Initial Coin offering a substantial amount of time to complete. However, the ‘buzz’ is building, and that daily buy rate is expected to increase.\n\nAnother reason users might begin buying more is the crypto token’s founder’s recent release of the white paper and mission statement. One of those statements includes a ‘catalyst’ to expand the Mollars brand via product.\n\nBitcoin Had a 10-Year Head Start… So Here’s The Catalyst\n\nThe new ERC-20 token will be a necessity for those who wish to use Mollars developers’ coming mystery web3 product. This decentralized app [dApp] will launch in early 2024 at the same time as the hybrid tokens launch on its first major crypto exchange.\n\nWhat exactly is the dApp Mollars will launch? It’s not yet clarified but the web3 ‘goody’ is being believed to target P2E gamers and metaverse enthusiasts of the Ethereum blockchain world.\n\nMollars ICO in 2024\n\nThese claims by the new ERC-20 token’s developers have left some analysts to believe today’s first round ICO investors could generate more than just the typical listing day gains.\n\nAs the Mollars token is being offered at US$ 0.30 cents today, it will list on a major crypto exchange in second quarter of 2024.\n\nMany new tokens see gains when listed on new cryptocurrency exchanges, but having an actual product could lift the token.\n\nICO & Tokenomics\n\nSpecifics for the ICO launch and post-listing plans have been made clear based on the fundraising goal being met successfully. A total of 4,500,000 tokens will be sold. Mollars initial coin offering will have 4 funding rounds. The price of the token pre-exchange will increase with each round incrementally.\n\nFirst-round investors will have the best opportunity to buy Mollars tokens at the previously mentioned rate of US$0.30. After a modest 200,000 tokens have been sold, the second round will begin.\n\nThe ICO price for second-round token investors will be US$0.40, which is a substantial increase. A maximum of 300,000 tokens will be sold in this second stage before the price is bumped upward again in the third round.\n\nAs popularity grows, the supply available in the ICO’s third round will more than double to 700,000 $MOLLARS tokens. By this third round, Mollars will have the first details and possibly a preview of their web3 product.\n\nIn the fourth round of the ICO, investors will have to pay half a dollar to buy tokens early.\n\nIn the 2 rounds following the fourth, the token presale will increase by US$0.05 each round. Specifically, 5th-round investors will have to pay US$0.55 per token, and 6th-rounders will have to buy tokens at a rate of US$0.60 each.\n\nThe total token supply that will be sold in the Mollars presale totals 4,000,000 crypto coins.\n\nAfter the ICO presale is completed, the $MOLLARS coin will appear on a top crypto exchange quickly — according to public plans.\n\nLearn more about the ICO and this new hybrid token at their official website — www.Mollars.com.\n\nDisclaimer: The above article is sponsored content; it’s written by a third party. CryptoPotato doesn’t endorse or assume responsibility for the content, advertising, products, quality, accuracy, or other materials on this page. Nothing in it should be construed as financial advice. Readers are strongly advised to verify the information independently and carefully before engaging with any company or project mentioned and do their own research. Investing in cryptocurrencies carries a risk of capital loss, and readers are also advised to consult a professional before making any decisions that may or may not be based on the above-sponsored content.\n\nReaders are also advised to read CryptoPotato’s full disclaimer."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxNZmJxeGhNSzV6ZVJ6MFRzcUtNa3FXbU14MkxzNkE5bWozRDIwWlVFSmNmekw3eWxqT045cnFaVVY0cURBdFRWbHU1RmJaNzZzUnZwQnVPc1RSRUpnaEpNX2Z4YmRxOFFBY2FwVmNSWmV5NlpUcUNiSGhRZDdrN1Y5UFRxVUZxOTQ0UXoxeXlINFd4MDVMWHU4Yi1QR2w4MFRCNThTaFM4OHVkU2NVeWlTMWE2Vi1TOU80QW5JNGpPbW5nOVFTVVZXcWFwT1V5N1hMNVdKSNIB2gFBVV95cUxQdWdIbjVLb2hQNEF5ZzJUYWJGcW15TDJVZ1JtdDN5VUZVWlF2Nmh1MTRIVVVvX3gtWi15Z0tDVTRGdlluOXplWjFqSW40NjU3cEt2ZlUtWDRaT011c1FZN3VSNEJvMEp3UVQtcHJDd3d1RWZPM3NXcVpDUzJ0MGRoVERCSlc1bnJrbUpyTHNQb010U1o2VWdYVkhETkVzSFcxUlF0dUVKQ2owSVhTS2NJbVlXNmc0cEJ3dHFqYmU3M1dfY2R2VWZ3LW9nOHJSWUhWazhSOU5zcURmdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Feb 2024 08:00:00 GMT",
        "title": "Types of Cryptocurrencies: From Bitcoin to Altcoins and beyond - The Economic Times",
        "content": "Bitcoin (BTC): The Pioneer Cryptocurrency\n\nAltcoins: Diverse Alternatives to Bitcoin:\n\nStablecoins: Minimizing Volatility for Stability:\n\nUtility Tokens: Powering Blockchain Ecosystems:\n\n\n\nSecurity Tokens: Bridging Traditional Finance with Blockchain:\n\nPrivacy Coins: Enhancing Anonymity in Transactions:\n\nCentral Bank Digital Currencies (CBDCs): Government-Backed Digital Money:\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nCryptocurrencies have revolutionized the financial landscape, offering innovative solutions to traditional monetary systems. As digital assets built on blockchain technology, cryptocurrencies provide decentralized and secure transactions. However, the crypto space is not a monolith; it comprises various types of cryptocurrencies with distinct purposes and functionalities.Types of Cryptocurrencies:Bitcoin, created by an anonymous entity known as Satoshi Nakamoto in 2009, is the first and most well-known cryptocurrency. Often referred to as digital gold, Bitcoin operates as a store of value and a medium of exchange. Its primary focus is on security and decentralization, making it a preferred choice for long-term investment.Altcoins, or alternative coins, encompass all cryptocurrencies other than Bitcoin. These coins aim to address specific shortcomings in Bitcoin or introduce new features. Examples include Ethereum (ETH), Ripple (XRP), Litecoin (LTC), and many more. Ethereum, for instance, enables smart contracts and decentralized applications (DApps), expanding the use cases beyond simple transactions.Designed to minimize the volatility inherent in many cryptocurrencies, stablecoins are pegged to traditional fiat currencies like the US Dollar or commodities like gold. Tether (USDT), USD Coin (USDC), and DAI are popular stablecoins. These digital assets provide a reliable medium of exchange and a store of value while retaining the efficiency of blockchain technology.Utility tokens are native to specific blockchain platforms and serve as a means of accessing and utilizing features within that ecosystem. For example, Binance Coin (BNB) is used to pay for transaction fees on the Binance exchange, while Filecoin (FIL) is a utility token for decentralized file storage on the Filecoin network.Security tokens represent ownership of real-world assets such as real estate, stocks, or bonds. These tokens are subject to securities regulations, providing a bridge between traditional financial markets and blockchain technology. Security tokens offer fractional ownership and increased liquidity for traditionally illiquid assets.Privacy coins focus on enhancing user anonymity by implementing advanced cryptographic techniques. Monero (XMR) and Zcash (ZEC) are examples of privacy coins that prioritize transaction privacy and fungibility. These coins appeal to users seeking enhanced confidentiality in their financial transactions.Some governments are exploring or developing their own digital currencies, known as Central Bank Digital Currencies (CBDCs). CBDCs are digital versions of a country's fiat currency issued and regulated by the central bank. These digital currencies aim to provide the benefits of blockchain technology while maintaining control over the monetary system."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxOQ3N2ZXRrLUM3SXc2U2U3aURTUVFKRjFFTE5LaTdEanlONFNheEZDekEtWmVDMHF6NmxWdmpmQ2x4QVQyQ09adGhyVmVmc3lUd1NQcHBzNlJyVkh2RHY3ZFVrNFNmWEF3bnoyeURFc3BtYi1kYjV1cDhBQmRRZ3FBQ3hnUktlSjNwa1h3dkgtb3VtYVpENG9CLWNsVFl0Zw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Feb 2024 08:00:00 GMT",
        "title": "DeFi developer Ameen Soleimani takes another stab at peg-less stablecoin - DLNews",
        "content": "It’s a cypherpunk’s dream: a stable cryptocurrency backed entirely by Ether, rather than real-world assets under the purview of hostile governments.\n\nBut RAI never took off. Its founder, prominent Ethereum developer Ameen Soleimani, hopes a newer version called HAI will prove decentralised stablecoins can thrive without being wedded to the dollar and, in turn, a central bank he believes is hellbent on gradually inflating away its value.\n\nPeople who hold a related token, KITE, will govern HAI. Beginning today, people who’ve used RAI and the Optimism blockchain can check their eligibility for a February 13 airdrop of KITE.\n\n“I would like to have money that doesn’t get rugged — for me, for my friends, for everybody on the planet,” Soleimani told DL News.\n\n“By providing an alternative, it’s a check on other systems that might try to exploit you. So it’s similar in ideology to Bitcoin.”\n\nBitcoin’s proponents consider it a decentralised hedge against inflation, an appreciating asset beyond the reach of governments that often wield their control of money to cow dissidents. But it has been too volatile to serve as “electronic cash” as first envisioned.\n\nCrypto developers have long sought to fix that by creating decentralised stablecoins such as RAI and Liquity’s LUSD. They have been mostly popular with DeFi natives, but Soleimani hopes that HAI, which is slated to launch February 20, will appeal to a broader range of people due to it its lower cost and a greater range of collateral assets.\n\nRAI vs HAI vs DAI\n\nLiquity accounted for a paltry 0.13% of the stablecoin market at the end of 2023, according to stablecoin ratings firm Bluechip. With a market capitalisation just under $5 million, RAI was even smaller: its share of the market was just 0.01%.\n\nJoin the community to get our latest stories and updates\n\nAbout $23 million in Ether backed RAI as of Tuesday.\n\nThat’s partly because both rely solely on deposits of Ether to back their stablecoins. That became less appealing after a pair of Ethereum upgrades that de-risked staking, a process in which investors lock up their Ether for a modest annual yield.\n\nUnlike RAI, HAI can be minted against multiple forms of collateral, such as Optimism’s OP and liquid staking tokens like stETH. Users who hold a separate token called KITE will have a say over what collateral HAI will accept.\n\nIn a February 12 airdrop, the developers behind the new stablecoin will give away one-fifth of the KITE supply to about 18,000 crypto wallets that belong to people who have used RAI, Optimism, and a prototype version of HAI.\n\nHAI will exist on Optimism, a low-cost blockchain that settles on Ethereum for security purposes, technically called a layer 2 blockchain.\n\n“We wanted to have multiple forms of collateral so that we could work with a broader base of users,” Soleimani said, “and we wanted to do it on a Layer 2 so that we could actually have smaller value loans and more everyday users can use it instead of, like, rich Ethereum whales.”\n\nAnother decentralised stablecoin, Maker’s DAI, gradually lost that moniker as it accepted greater amounts of centralised collateral in the form of USDC and US Treasuries.\n\nSoleimani said HAI could guard against mission drift by requiring a higher voting threshold to add collateral than to change other parameters; by delaying implementation of new collateral after a vote, giving anyone unhappy with the decision the opportunity to exit their position; and by limiting the amount of certain collateral users can deposit to mint HAI.\n\n‘Make more float coins’\n\nHAI will also start trading at $1, rather than RAI’s arbitrary $3.14 soft peg. RAI floats freely against that peg, but never too far from it. Similarly, HAI is expected to gradually drift from $1.\n\nSoleimani has taken to calling these tokens “float coins.” He hopes their popularity will show people that “stability” is not synonymous with tracking the value of the dollar.\n\nMarket values of top stablecoins\n\nTo ensure stability, it uses a self-correcting mechanism akin to a Chinese finger trap: the more someone tries to manipulate its value on the market, the more expensive the effort becomes.\n\nThe mechanism has worked well for RAI: according to data gathered by pseudonymous data analyst Kyoronut, RAI has been less volatile relative to the dollar than other world currencies.\n\nWhile Soleimani hopes HAI becomes a popular stablecoin, its market capitalisation isn’t the only measure of success, he said.\n\nHAI’s code is easy to copy, tweak, and deploy. Soleimani wants people to take advantage of that.\n\n“Make more float coins,” he said.\n\n“In the future that I want, instead of, like, going to the bank to get a loan against your farm or whatever, you and your friends — high tech farmers — would be able to make your own bank. You would have the digital tools to do so.”\n\nCorrection: This article was updated on January 7 to clarify that 18,000 wallets will receive KITE in an airdrop. The article originally stated 18,000 KITE would be distributed in the airdrop."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMiXkFVX3lxTE1xUlZqdUkyQm9fYVdvV3dYM2I0OVVTUEJsalVXNDFoWUVlYmtFS0YzNVlpMHRyYm1LNTVtRTAzb1lUSEpzUGZPdXY3Q01mdmhBZWhCOFd3SEpPVE5mRXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Feb 2024 08:00:00 GMT",
        "title": "How to Invest in Ethereum - Moneyland.ch",
        "content": "Ethereum (ETH) is the second-largest and best-known cryptocurrency after bitcoin (BTC). This moneyland.ch guide explains how you can invest in Ethereum.\n\nWhat is Ethereum?\n\nBitcoin clearly dominates the cryptocurrency space by a wide lead. But when ranked with all other cryptocurrencies excluding bitcoin, Ethereum holds first place. The cryptocurrency, which was first introduced at the North American Bitcoin Conference in Miami, currently has a market capitalization of 237 billion Swiss francs (as per February 1, 2024).\n\nStrictly-defined, the term Ethereum denotes the entire blockchain-based infrastructure. The cryptocurrency that enables transactions within the Ethereum platform is called Ether. However, the term Ethereum is widely used to describe the cryptocurrency as well.\n\nUnlike bitcoin, the Ethereum blockchain does not limit the number of Ether that can be generated. Ether is used to settle payment transactions on the platform. Ethereum is best known as a platform for smart contracts – transactions that are performed automatically when predefined conditions are met, without the need for an intermediary.\n\nTable 1: The biggest cryptocurrencies by market capitalization in Swiss francs\n\nCryptocurrency Market capitalization Bitcoin CHF 720 billion Ethereum CHF 237 billion Tether CHF 83 billion BNB CHF 39 billion Solana CHF 36 billion\n\nDate: 01.02.2024.\n\nHow can I invest in Ethereum?\n\nIf you are interested in investing in Ethereum, there are a number of different ways to do it:\n\nBuy Ethereum at ATMs or stores: A number of Swiss cryptocurrency service providers sell Ethereum at vending machines and in certain stores.\n\nA number of Swiss cryptocurrency service providers sell Ethereum at vending machines and in certain stores. Buy Ethereum online: There are many Swiss online service providers that you can use to buy Ethereum online.\n\nThere are many Swiss online service providers that you can use to buy Ethereum online. Exchange Traded Notes (ETNs): ETNs track the price of Ethereum and enable you to profit from price growth without having to buy actual Ethereum.\n\nETNs track the price of Ethereum and enable you to profit from price growth without having to buy actual Ethereum. Ethereum futures ETFs: These ETFs invest in futures – contracts used to speculate on price developments.\n\nThese ETFs invest in futures – contracts used to speculate on price developments. Contracts for difference (CFDs): CFD’s based on the Ethereum price can be used to speculate on positive or negative price developments. Typically, CFDs use leverage, and this exposes you to a lot of risk. For this reason, CFDs generally are not recommended for inexperienced investors.\n\nWhat are the possible costs of investing in Ethereum?\n\nExchange rate markups: All Ethereum service providers and trading platforms use their own exchange rates to calculate the price of Ethereum in Swiss francs. The cost of buying Ethereum largely depends on how high the dealer’s markup over the market price is. Make sure to compare the rate offered with the market price before you buy Ethereum. Even a platform that does not charge fees at all can still be more expensive than other platforms if it uses an unfavorable exchange rate.\n\nAll Ethereum service providers and trading platforms use their own exchange rates to calculate the price of Ethereum in Swiss francs. The cost of buying Ethereum largely depends on how high the dealer’s markup over the market price is. Make sure to compare the rate offered with the market price before you buy Ethereum. Even a platform that does not charge fees at all can still be more expensive than other platforms if it uses an unfavorable exchange rate. Transaction fees: Most trading platforms change a fee every time you buy or sell Ethereum. You also pay a fee – a brokerage fee – when you buy or sell ETNs using a stock brokerage account.\n\nMost trading platforms change a fee every time you buy or sell Ethereum. You also pay a fee – a brokerage fee – when you buy or sell ETNs using a stock brokerage account. Total expense ratios (TERs): Before investing in Ethereum using an ETN (more on this below), you should make sure to compare the total expense ratios (TERs) of Ethereum ETNs. The TER shows the ETN’s ongoing fees, which detract from investment performance.\n\nHow can I buy Ethereum offline?\n\nYou can buy Ethereum at some brick-and-mortar stores and at special vending machines. Simplicity is the main advantage: You can buy Ethereum and pay with cash (or other payment methods, in some cases), without having to first open an account with a service provider. The main disadvantages of buying Ethereum at brick-and-mortar outlets are the high fees and the poor exchange rates.\n\nTypically, you receive a QR code which lets you access an Ethereum wallet that contains the Ethereum you purchased.\n\nTable 2: Swiss service providers for buying Ethereum offline\n\nService provider Are payments in\n\nCHF possible? Limits for Ethereum\n\npurchases Fees Bity ATMs Yes, in cash. Euros are\n\nalso accepted. CHF 1000 per 30 days.\n\nHigher limits with identity\n\nverification. CHF 2 plus 3.5% to 9.5% of the\n\ntransacted amount, depending\n\non the ATM. Cryptonow cards\n\n(Värdex) Yes. The cards are\n\navailable at various\n\nretail outlets, including\n\npost offices, Coop\n\nsupermarkets, and\n\nstores in the Valora\n\ngroup (including\n\nK Kiosk and Avec). CHF 1000 per 30 days 9.9% of the transacted amount,\n\nplus a CHF 1 activation fee. Tibc ATMs Yes, in cash. Euros\n\nare also accepted. CHF 1000 per 30 days.\n\nHigher limits with with\n\nidentity verification. Variable. Värdex ATMs Yes, in cash. Euros\n\nare also accepted.\n\nFor purchases at the\n\ntill at Värdex partner\n\nstores: Debit cards\n\nare also accepted. CHF 1000 per 30 days.\n\nHigher limits with with\n\nidentity verification. CHF 1 plus 6.5% to 10% of the\n\ntransacted amount, depending\n\non the ATM.\n\nWith the exception of Bity, all of the Swiss companies included in Table 2 are registered with Finma. Date: 01.02.2024.\n\nHow can I buy Ethereum online?\n\nThere are many different Swiss online service providers from which you can buy Ethereum online. Most platforms require you to open an account before you can buy Ethereum through them, and that involves some time and effort. The advantage is that the fees are usually much lower than those charged for offline purchases.\n\nTable 3: Swiss service providers for buying Ethereum online\n\nService provider Bank license Are payments in CHF possible? Fees Bitcoin Suisse\n\n(minimum account\n\nbalance: CHF 100,000) No Yes, by bank transfer. 0.95% of the transacted amount. Bity No Yes, by bank transfer (verified\n\ncustomers can also pay with\n\nVisa or Mastercard). 1.2% of the transacted amount\n\n(0.8% for verified customers). DFX No Yes, by bank transfer. 1.49% of the transacted amount. Lykke No Yes, by bank transfer. None. Mt Pelerin No Yes, by bank transfer. Card\n\npayments are also accepted,\n\nbut with a fee of 2.5% to 3.4%. No fees for the first CHF 500 per\n\nyear. A fee of between 0.9% and\n\n1.3% applies to transactions above\n\nthat amount. Lower fees apply to\n\nholders of Mt Pelerin tokens. Smart Valor No Yes, by bank transfer, debit card,\n\nor credit card. 1.29% to 8.9%, depending on the\n\namount transacted. Swissborg No Yes, by bank transfer. Card\n\npayments are also accepted,\n\nbut with a fee of 2.25%. 1.49% of the transacted amount.\n\nLower fees apply to holders of\n\nSwissborg tokens. Swissquote Yes No, only EUR or USD accepted\n\nfor Ethereum purchases. You\n\ncan fund your Swissquote\n\naccount with CHF by bank\n\ntransfer. Debit cards and credit\n\ncards are also accepted, but\n\nwith a fee of 1.9%). 0.5% to 1%, depending on the\n\namount transacted.\n\nWith the exception of Bity, all of the Swiss companies included in Table 3 are registered with Finma. Date: 01.02.2024.\n\nWhat are Ethereum ETNs?\n\nThe principle of exchange-traded notes (ETNs) is similar to that of exchange-traded funds (ETFs). Like an ETF, an ETN aims to replicate the performance of an underlying asset – Ethereum in the case of Ethereum ETNs. These notes enable you as an investor to participate in price growth without buying actual Ethereum. You can invest in ETNs using a stock brokerage account at a bank, as with ETFs. ETNs are passively managed and are best suited to investors who only want to participate in the price developments, without actually holding Ethereum.\n\nThe difference between an ETN and an ETF is that an ETN is not an investment fund, but a promissory note that gives you a debt claim against ETN’s issuer. Your investments are not protected if the issuer goes bankrupt because unlike ETF shares, ETNs are not classified as segregated assets.\n\nThe titles of many ETNs include the abbreviation ETP, which stands for exchange-traded product. This is a broad term that covers many different assets that are traded on stock exchanges, including both ETNs and ETFs.\n\nWhich Ethereum ETNs are there?\n\nThere are many different Ethereum ETNs available to Swiss investors, but the selection varies depending on which stock brokerage account you use.\n\nTable 4: Ethereum ETNs ranked by costs (TER)\n\nETN ISIN Domicile of ETN issuer TER CoinShares Physical Ethereum GB00BLD4ZM24 Jersey 0.00% 21Shares Ethereum Core ETP CH1209763130 Switzerland 0.21% WisdomTree Physical Ethereum GB00BJYDH394 Jersey 0.35% Global X Ethereum ETP GB00BLBDZW12 Jersey 0.65% SEBA Ethereum ETP CH0587418630 Switzerland 0.75% VanEck Ethereum ETN DE000A3GPSP7 Liechtenstein 1.00% Ethereum Staking ETP CH0454664027 Switzerland 1.49% ETC Group Physical Ethereum DE000A3GMKD7 Germany 1.49%\n\nDate: 01.02.2024.\n\nThe ETNs included in Table 4 all use physical replication, meaning the issuer holds actual Ethereum as collateral.\n\nApart from the TER, you should also pay attention to the brokerage fees and custody fees charged by your bank. Typically, the fees for ETNs are the same as those for ETFs.\n\nCan I invest in Ethereum using ETFs?\n\nUnlike bitcoin, there are not yet any ETFs that replicate the market price of Ethereum. Currently, you only have the option of investing in Ethereum futures ETFs, which speculate on future price developments. These ETFs invest in futures.\n\nWhat are the risks of investing in Ethereum?\n\nInvesting in cryptocurrencies like Ethereum can potentially yield high returns, but it more closely resembles a lottery than a genuine investment. The prices of cryptocurrencies are very volatile, and there is no sure way to predict future price developments. Substantial losses are possible over both short terms and long terms, and a total loss cannot be ruled out. Ethereum can be used as an additional component to further diversify your investment portfolio. But it should never be a major part of your portfolio.\n\nYou should be especially careful with leveraged CFDs. Using these is identical to betting on the Ethereum price. Because a part of the investment is paid using a loan, you can end up losing more money than the amount you invested. These products are generally not suitable for inexperienced investors.\n\nMore on this topic:\n\nHow to buy bitcoin in Switzerland\n\nHow to pay with bitcoin in Switzerland\n\nShould I invest in bitcoin & Co?\n\nHow to invest money in Switzerland"
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxNRDZCNnJNZlNHUEhCZkVqUVJqajFGbzVKUjl0N1RpNHBqR2ZhWWlzSVZjN05XTzlscVF6Nlg2dUllYW9WS2syUjZ2RFhhb1JUV3VGUUJOclhzWGRCelpYWk16YTRTc2F4bUQ2c3ljR09WaWY4OWdtQTNYVzNWYkNlRWNVd29ITFBVdUZnNHNVSl9JQWJjYjRvMFdn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Feb 2024 08:00:00 GMT",
        "title": "Ronin is making a comeback two years after its $624m hack - DLNews",
        "content": "A version of this story appeared in our The Decentralised newsletter. Sign up here.\n\nGM, Tim here.\n\nHere’s what caught my DeFi-eye recently:\n\nAxie Infinity’s Ronin blockchain is making a comeback\n\nA new liquid restaking protocol wants to ‘vampire attack’ Lido\n\nThe Curve team is gearing up for another big launch\n\nRonin trading volume and TVL soar\n\nOn March 23, 2022, the bridge connecting the Ronin blockchain to Ethereum was hacked for $624 million, the biggest onchain crypto hack ever.\n\nThe situation looked bleak. In addition to the huge loss, user activity on Axie Infinity, the Ronin Blockchain’s flagship game, plummeted.\n\nFast-forward two years, and despite the odds, Ronin is thriving again. On Monday, Binance listed the blockchain’s RON token for trading after a 74% rally since the start of the year.\n\nThe RON token now trades higher than before the Ronin bridge suffered a $624 million hack in 2022 (CoinGecko)\n\nRonin is a so-called layer 1 blockchain. It was originally launched as a low-cost alternative to Ethereum.\n\nIn recent months, activity on Ronin has spiked. Trading volume on the blockchain is up 54% this week, while total value locked — a measure of funds locked in protocols on Ronin — jumped 28% this month.\n\nJoin the community to get our latest stories and updates\n\nGames such as Pixels have brought a new wave of users to Ronin, while existing projects — like early NFT franchise Cyberkongz — are planning to migrate to Ronin.\n\nRonin’s recent success could be a bellwether for a wider resurgence in crypto gaming, following its boom and bust during the previous bull market.\n\nPuffer Finance wants Lido’s blood\n\nPuffer Finance, a new entrant to the nascent liquid restaking sector, has drawn in over $440 million in deposits in less than a week.\n\nPuffer isn’t just competing against rival liquid restaking protocols like Kelp DAO and ether.fi — it wants to take on Lido, the biggest liquid staking protocol with more than $21 billion of deposits.\n\nIt plans to conduct what’s known in DeFi circles as a vampire attack — a type of aggressive growth strategy where a protocol targets users of a rival protocol by offering additional incentives.\n\nPuffer requires users to lock up Lido’s stETH to mint its restaking token called pufETH. Once the protocol fully launches later this year, Puffer will convert the stETH tokens backing pufETH into Ether and restake them itself in permissionless validators.\n\nIf successful, the plan should help chip away at Lido’s market dominance — a hot issue within the Ethereum community.\n\nCurve isolated lending is coming\n\nThe team behind decentralised exchange Curve Finance and the crvUSD stablecoin is about to launch its own lending market.\n\nDubbed Llamalend by the Curve community, the new protocol will allow users to borrow and lend using any Ethereum-based crypto as collateral. It uses the LLAMMA soft liquidation mechanism outlined in Curve co-founder Michael Egorov’s crvUSD whitepaper.\n\nThis means that instead of loans hitting an all or nothing liquidation threshold — as they do on other lending markets such as Aave — Llamalend will liquidate delinquent positions gradually. The algorithm can even buy back sold collateral if prices recover.\n\nEgorov told DL News that he tentatively expects Llamalend to launch by the end of the week.\n\n(Full disclosure, DL News’ founders were core contributors to the Curve protocol.)\n\nData of the week\n\nThe Ronin blockchain’s TVL has increased 250% over the past three months. And since the start of the year, the number of stablecoins on Ronin has also jumped 36%.\n\nThe fact that users are depositing stablecoins to Ronin is important. It shows that the TVL increase isn’t just due to the price increases of tokens already on Ronin, and that users are depositing new funds to the blockchain.\n\nAfter a long period of inactivity, stablecoin deposits to the Ronin blockchain are increasing. (DefiLlama)\n\nThis week in DeFi governance\n\nTEMP CHECK: Uniswap set to greenlight deployment on Zora\n\nVOTE: Frax makes more progress toward onchain US Treasury bills\n\nVOTE: Arbitrum DAO wants to diversify its holdings with real-world assets\n\nPost of the week\n\nMemecoins broke through into the real world this week after someone adorned the iconic raging bull statue near Wall Street with a pink crocheted hat — a nod to Solana memecoin dogwifhat.\n\nIt’s not the first time memecoin investors have pulled a similar stunt. In 2021, pictures of the giant brass bull facing off against a Shiba Inu went viral in appreciation of Dogecoin.\n\nYes this is real pic.twitter.com/oAKRJv2H1J — OJC 💫 𓃓 (@OjCrypto) February 2, 2024\n\nYes this is real pic.twitter.com/oAKRJv2H1J — OJC 💫 𓃓 (@OjCrypto) February 2, 2024\n\nWhat we’re watching\n\nI'm excited to share our latest research on adjusting the block gas limit.\n\nTogether with @VitalikButerin, we're exploring paths to reduce the maximum block size, balance calldata pricing, and ultimately raise the block gas limit.https://t.co/Thvyw9Yog3 — Toni Wahrstätter ⟠ (@nero_eth) February 5, 2024\n\nI'm excited to share our latest research on adjusting the block gas limit.\n\nTogether with @VitalikButerin, we're exploring paths to reduce the maximum block size, balance calldata pricing, and ultimately raise the block gas limit.https://t.co/Thvyw9Yog3 — Toni Wahrstätter ⟠ (@nero_eth) February 5, 2024\n\nEthereum Foundation researcher Toni Wahrstätter and Ethereum co-founder Vitalik Buterin have co-authored a proposal to increase the block gas limit and the price for nonzero calldata bytes.\n\nDoing so, they argue, should reduce block sizes and incentivise the transition to using blobs for data availability.\n\nGot a tip about DeFi? Reach out at tim@dlnews.com."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxQLXZqVXJmUFNpTDVjRmVCX1BaWE55cXp6clhOQlZiRWc1VEJ3WFptTGZfYVFwNjZJVWxnM0NueDNrMFJ1UWZDelpacmVkVWZ6d0p2bHFnVjZ5dXNTSW4wMlVWcm5zU3hBN0VhYklCaTBqb2VPbnVvZU1La29BRDVQTXR1ZFVQNnRhZHBPZ0xqWXVtV0hfRHd3TXVzUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Feb 2024 08:00:00 GMT",
        "title": "Farcaster NFTs are already selling for thousands of dollars. Here’s why - DLNews",
        "content": "Crypto’s latest decentralised social media app has taken center stage as users are now busy trading Farcaster IDs.\n\nEarly IDs have been eligible for various airdrops, likely driving trading activity.\n\nFarcaster is crypto Twitter’s main character these days, attracting interest from many crypto notables, including Ethereum co-creator Vitalik Buterin.\n\nTrading on Farmarket is booming, with users spending large on Farcaster IDs.\n\nSo far, the highest-selling FID on the Farcaster account marketplace earned the previous owner almost $7,000 in Ethereum.\n\nEarly joiners to Farcaster, an Optimism-based social media platform, claimed low FIDs — between one- to five-digit IDs. FIDs have now reached the six-digit level.\n\nFarcaster IDs are displayed as digits, with lower digit IDs attracting higher bids. They are also NFTs that can be bought and sold.\n\nUsers are offering each other as much as $34,000 for account NFTs on the Farcaster account marketplace FarMarket. (FarMarket)\n\nInterest in low FIDs is likely tied to some Farcaster apps having started airdropping viral meme coins to low-digit FIDs. One token called DEGEN has already surged 800% since late January, CoinGecko data shows.\n\n“I think this is a fad that will die soon, and [that] is why I immediately listed my ‘rare’ FID for a reasonable price — top sale at the moment for 3 ETH,” pseudonymous X user kcaz told DL News, referring to the hype around low FIDs.\n\nThey were the ones that sold the FID worth nearly $7,000, ID #4323.\n\nSecondary markets all the way down\n\nLaunched in August 2022, the protocol has over 293,000 users from over 41,000 Ethereum wallets and has already attracted several notable crypto personalities, including Ethereum co-creator Vitalik Buterin.\n\nJoin the community to get our latest stories and updates\n\nSpeculative interest in low-digit crypto IDs is not a new phenomenon.\n\nLow-digit Ethereum Name Service names have also sold for thousands of dollars in the past with 000.eth selling in July 2022 for 300 ETH, worth $315,000 at the time.\n\nAs was the case for digit-ENS domains, tiered floor prices have also emerged for FIDs based on how low they are. The floor price is the lowest offer for an NFT and can be used to calculate the minimum value of an NFT collection.\n\nFIDs lower than 20,000 currently have a floor price of a few hundred dollars, Farmarket data shows.\n\nFarcaster on the rise\n\nThe speculative FID trend comes amid a broader increase in Farcaster adoption metrics.\n\nThe protocol’s daily active user count soared 400% last week, coinciding with the protocol’s launch of Frames — a feature letting users turn social posts on Warpcast into mini-apps for use cases like NFTs and gaming.\n\nWarpcast is one of the many apps built atop the Farcaster protocol. Many are touted as decentralised alternatives to popular web2 social media platforms. Warpcast is similar to X, formerly Twitter. Fancord resembles Discord.\n\nWhile Farcaster has enjoyed soaring metrics, its competition struggles to maintain pace.\n\nFriend.tech, last year’s dominant SocialFi protocol, has seen its user numbers plummet 96% from its peak in September.\n\n“Bad gamefi is using financial speculation as a substitute for fun,” tweeted Buterin, responding to commentary on Friend.tech’s recent drop in user activity. “I believe a similar thing for crypto social.”\n\nThe Ethereum co-creator predicted that Farcaster, along with another web3 media protocol Lens, “will not be deserted in 4 months, or 1 year.”\n\nOsato Avan-Nomayo is our Nigeria-based DeFi correspondent. He covers DeFi and tech. To share tips or information about stories, please contact him at osato@dlnews.com."
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMi-gFBVV95cUxOeXZFenNzczdCWTF3T2hYYVNyMHNZcUxTTjItQ1AwbFVlZ2RoR3pzczR1ZjRIZmFtd0FhUkdkMHJrLVVHOV9XZU92eWdtZENZYmRRLXY4OS1qd2pkRm5XMVltZmc2X3pWRU1uOHN5bXNqeXlXcG91aEZZUzN6VWpiMVR5RWstNlhiNEZScWlqRDItdy1WRllhTDd0dkNObmRpZ3R5TnhQZ3RScTJkTkkyZTdRQmlEYjdyV3Z0cGI0cTRtVDF3a0h2WGxVR09Ycm9pclBGM05uNENUaHFlVm9YSXpGSFpEOFhhVm1lbWtnMGZKVUZBdGVQblVn0gH_AUFVX3lxTE5iTk1rc3R4OVFPdDY4UTFYZE1xVjUzVHZENVhjLVhkTGFEZ2hodHpfcWNxWThQN1Y2TzFMNVVaem1USldwMFB4VENlYXhLZDJwYXZCeG12OGQ1U0xOSjNYdGRLNF9qSlBrSGV3Tm95a21MbERORDFQM1p2eVNiMWEtb3pyRjNZZTkwRDltS0pZRElNVFotY1NGVzVvbEI4NGxvSEtCVDBxQmx4RU1hb0R0QkFZbXkzLU40dGlWSl9QbWxjSEpUM3ZOMXlHNDF0NmRjQjA3MWlfRVZrQ0ZpaDhRNXAzUVMtamlUTmRERm9Rekxwc0oyQmJxR1JtdjhjVQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Feb 2024 08:00:00 GMT",
        "title": "Cryptocurrency Price Today: Bitcoin Dips Below $43,000, Ronin Loses Over 25% - ABP Live",
        "content": "Bitcoin (BTC), the oldest and most valued cryptocurrency in the world, dipped below the $43,000 mark early Tuesday. Other top coins, including the likes of — Ethereum (ETH), Dogecoin (DOGE), Solana (SOL), Ripple (XRP), and Litecoin (LTC) — saw minor gains and losses across the board. The Ethereum Name Service (ENS) token emerged to be the biggest gainer of the lot, with a 24-hour jump of over 13 percent. Ronin (RON), on the other hand, became the biggest loser, with a 24-hour dip of over 25 percent.\n\nThe global crypto market cap stood at $1.64 trillion at the time of writing, registering a 24-hour gain of 0.42 percent.\n\nBitcoin (BTC) Price Today\n\nBitcoin price stood at $42,792.43, registering a 24-hour gain of 0.27 percent, as per CoinMarketCap. According to Indian exchange WazirX, BTC price stood at Rs 37.74 lakh.\n\nEthereum (ETH) Price Today\n\nETH price stood at $2,312.58, marking a 24-hour gain of 0.81 percent at the time of writing. As per WazirX, Ethereum price in India stood at Rs 2.02 lakh.\n\nDogecoin (DOGE) Price Today\n\nDOGE registered a 24-hour jump of 0.21 percent, as per CoinMarketCap data, currently priced at $0.07834. As per WazirX, Dogecoin price in India stood at Rs 6.90.\n\nLitecoin (LTC) Price Today\n\nLitecoin saw a 24-hour gain of 0.86 percent. At the time of writing, it was trading at $67.73. LTC price in India stood at Rs 5,871.87.\n\nRipple (XRP) Price Today\n\nXRP price stood at $0.5066, seeing a 24-hour jump of 0.17 percent. As per WazirX, Ripple price stood at Rs 44.50.\n\nSolana (SOL) Price Today\n\nSolana price stood at $95.92, marking a 24-hour dip of 0.95 percent. As per WazirX, SOL price in India stood at Rs 8,401.\n\nTop Crypto Gainers Today (February 6)\n\nAs per CoinMarketCap data, here are the top five crypto gainers over the past 24 hours:\n\nEthereum Name Service (ENS)\n\nPrice: $20.80\n\n24-hour gain: 13.70 percent\n\nSui (SUI)\n\nPrice: $1.59\n\n24-hour gain: 8.87 percent\n\nOptimism (OP)\n\nPrice: $3.21\n\n24-hour gain: 7.02 percent\n\nGnosis (GNO)\n\nPrice: $231.89\n\n24-hour gain: 6.05 percent\n\nImmutable (IMX)\n\nPrice: $2.26\n\n24-hour gain: 5.97 percent\n\nTop Crypto Losers Today (February 6)\n\nAs per CoinMarketCap data, here are the top five crypto losers over the past 24 hours:\n\nRonin (RON)\n\nPrice: $2.53\n\n24-hour loss: 25.69 percent\n\nPyth Network (PYTH)\n\nPrice: $0.465\n\n24-hour loss: 7.43 percent\n\nFlare (FLR)\n\nPrice: $0.02913\n\n24-hour loss: 6.67 percent\n\nInternet Computer (ICP)\n\nPrice: $12.17\n\n24-hour loss: 6.19 percent\n\nOasis Network (ROSE)\n\nPrice: $0.1121\n\n24-hour loss: 3.55 percent\n\nWhat Crypto Exchanges Are Saying About Current Market Scenario\n\nMudrex co-founder and CEO Edul Patel told ABP Live, “Bitcoin held its position above the $42,000 mark despite a 14 basis points increase in the 10-year US Treasury bond yield. Federal Reserve Chair Jerome Powell's statement that the Fed had little intention to cut rates in March did not shake the bullish sentiment, with the $42,000 level being defended. Despite this, the $42,000 level has seen defence by bullish investors. The next resistance for BTC is at $43,800, with support at $41,300. Meanwhile, Ethereum is presently at the $2,300 mark, with a potential bullish move anticipated if it surpasses $2,400, aiming for $2,600. Until then, Ethereum is expected to trade sideways.”\n\nCoinSwitch Markets Desk noted, “As BTC has been trading in a narrow channel for more than a week now, the up-trend still remains intact with $42k being the level to break on the down side and $44k on the up-side. However with Blackrock now holding more than $2 billion worth of BTC, bears will have to instill some massive amount of fear for breaking it to the downside. One of the biggest news from yesterday came from GoDaddy. The company announced that its users can now link domain names with Ethereum Name Service, ENS (+13%) at no extra cost. This is a big boost for both Ethereum (+1.68%) and the ENS token.”\n\nRajagopal Menon, Vice President, WazirX, said, “The potential liquidation of Genesis's assets could exert a negative impact on market prices. The selling pressure that started after the approval of spot BTC ETFs persists, influencing the market ahead of the anticipated Genesis sell-off. Bitcoin's price has retreated from $43,000 levels and faces a challenging struggle to avoid a further decline back to the $40,000 support level, which held during the bullish market sentiment at the end of last year. Ethereum's pricing signals indicate overbought conditions, suggesting a potential lull at the resistance level and a possible market downturn. Contrary to market expectations of a rally, XRP continues its downward trajectory, surprising investors. The Relative Strength Index signals oversold conditions amid a bearish sentiment, with moving averages indicating a prevailing 'Sell' sentiment.”\n\nShivam Thakral, CEO of BuyUcoin, said, “The total crypto market cap stands around $1.64T, a 0.73% increase over the last day. The selling pressure by Grayscale which has sold 141,00 Bitcoin is being absorbed by 175,000 Bitcoin bought through ETFs.The Cumulative spot Bitcoin ETF volume has also crossed the $30B threshold reflects a huge demand for Bitcoin in the Spot ETFs. Bitcoin has persistently attempted to breach the $44,000 level for several weeks but it has been hindered by low trading volume.”\n\nSathvik Vishwanath, CEO and co-founder of Unocoin, said, “Bitcoin's January surge in trading volume to $16.01 billion, the most since September 2022, pushed its value past $43,000. Factors such as reduced grayscale bitcoin sales and a strong US stock market contributed to this. Upcoming events, including the US Federal Reserve meeting, can affect market trends. Despite the potential uncertainty, Bitcoin's market capitalization rose 2% to $1.66 trillion in 24 hours. Federal Reserve Chairman Jerome Powell's plan to cut interest rates three times in 2024 aims to take advantage of the strong US economy and control inflation. Crypto analyst DonAlt predicts that Bitcoin could reach $60,000 if it clears key barriers and maintains a bullish outlook.”\n\nCoinDCX Research Team told ABP Live, “In the past 24 hours, the crypto market initially remained stable but later saw a decline, impacted by the fall in the US market and Coinbase shares. The overall market has been relatively quiet recently as BTC consolidates around the $43,000 level. However, on a higher time frame, BTC exhibits a bullish trend with confirmations from EMAs. ETH is following a similar price action to BTC, and both cryptocurrencies need to break out of their current consolidations to signal a significant move in either direction.”\n\nSubscribe And Follow ABP Live On Telegram: t.me/officialabplive\n\nDisclaimer: Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Cryptocurrency is not a legal tender and is subject to market risks. Readers are advised to seek expert advice and read offer document(s) along with related important literature on the subject carefully before making any kind of investment whatsoever. Cryptocurrency market predictions are speculative and any investment made shall be at the sole cost and risk of the readers."
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTFBGd3ZjRm9fd1UxVGV3ZUk4YWdEZ0p6UUdlSzR2VEFKeElHRURVX1ZBdVZHNEhCOWFEZFVKTTNVYVRUMTlWZ0JNQVFkZVFmREtnc2pQMzRGSXNnWUhLWDBldlptZmo0S1NwTWxUT1ZGQUVvQUhpRU5USGE5NExVQdIBggFBVV95cUxPUTMxX0tUR0JzZGg5X3JqbmtXUXFLT2tiNUxlOXFTQ2pGWjRMZ3d0OHkyanM4S0REdUY3WHpaU3B1MFNTMlVrbFQ5dGg0SW83blVWZUNUaWdZWU9qZnN0MkpvdU5qUENtZXB4S1hiQ2RWWFhXVWY1SWtUeFFabW1SWktn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Price Prediction – ETH Price Estimated to Reach $ 2,538.89 By Feb 11, 2024 - CoinCodex",
        "content": "Disclaimer: This is not investment advice. The information provided is for general purposes only. No information, materials, services and other content provided on this page constitute a solicitation, recommendation, endorsement, or any financial, investment, or other advice. Seek independent professional consultation in the form of legal, financial, and fiscal advice before making any investment decision.\n\nEthereum is up 3.17% today against the US Dollar\n\nEthereum is currently trading 6.09% below our prediction on Feb 11, 2024\n\nEthereum gained 6.35% in the last month and is up 44.19% since 1 year ago\n\nEthereum price $ 2,384.40 Ethereum prediction $ 2,538.89 (8.10%) Sentiment Bullish Fear & Greed index 64 (Greed) Key support levels $ 2,281.10, $ 2,254.32, $ 2,222.03 Key resistance levels $ 2,340.18, $ 2,372.47, $ 2,399.25\n\nETH price is expected to rise by 8.10% in the next 5 days according to our Ethereum price prediction\n\nis trading at $ 2,384.40 after gaining 3.17% in the last 24 hours. The coin outperformed the cryptocurrency market, as the total crypto market cap increased by 3.12% in the same time period. ETH performed well against BTC today and recorded a 1.83% gain against the world’s largest cryptocurrency.\n\nAccording to our Ethereum price prediction, ETH is expected to reach a price of $ 2,538.89 by Feb 11, 2024. This would represent a 8.10% price increase for ETH in the next 5 days.\n\nETH Price Prediction Chart\n\nBuy/Sell Ethereum\n\nWhat has been going on with Ethereum in the last 30 days\n\nEthereum has been displaying a positive trend recently, as the coin gained 6.35% in the last 30-days. The medium-term trend for Ethereum has been bullish, with ETH increasing by 25.24% in the last 3 months. The long-term picture for Ethereum has been positive, as ETH is currently displaying a 44.19% 1-year price change. On this day last year, ETH was trading at $ 1,653.62.\n\nEthereum reached its all-time high price on Nov 10, 2021, when the price of ETH peaked at $ 4,867.17. The current ETH cycle high is $ 2,714.13, while the cycle low is at $ 897.01. ETH has been displaying low volatility recently – the 1-month volatility of the coin is at 5.25. Ethereum recorded 15 green days in the last 30 days.\n\nEthereum technical analysis for today - Feb 06, 2024\n\nThe sentiment in the Ethereum markets is currently Bullish, and the Fear & Greed index is reading Greed. The most important support levels to watch are $ 2,281.10, $ 2,254.32 and $ 2,222.03, while $ 2,340.18, $ 2,372.47 and $ 2,399.25 are the key resistance levels.\n\nBullish sentiment for Ethereum\n\n25 indicators are currently signaling a bullish prediction for Ethereum, while 4 indicators are showing a bearish forecast. With 86% of indicators favoring a positive prediction. This results in an overall Bullish sentiment for Ethereum.\n\nCrypto market is currently experiencing Greed\n\nCurrently, the Fear & Greed index is at 64 (Greed), which signals that investors have a positive outlook on the market. The Fear & Greed index is a measure of sentiment among cryptocurrency investors. A “Greed” reading suggests that investors are currently optimistic about the cryptocurrency market, but can also be an indication that the market is overvalued. A “Fear” reading, on the other hand, signals that investors are currently hesitant about the cryptocurrency market, which potentially represents a buying opportunity.\n\nEthereum moving averages & oscillators\n\nLet’s take a look at what some of the most important technical indicators are signaling. We’ll be going through key moving averages and oscillators that will allow us to get a better idea of how Ethereum is positioned in the market right now.\n\nPeriod Daily Simple Daily Exponential Weekly Simple Weekly Exponential MA3 $ 2,372.86 (BUY) $ 2,342.19 (BUY) - - MA5 $ 2,315.28 (BUY) $ 2,342.89 (BUY) - - MA10 $ 2,275.38 (BUY) $ 2,316.66 (BUY) - - MA21 $ 2,319.52 (BUY) $ 2,241.23 (BUY) $ 3,083.51 (SELL) $ 2,068.40 (BUY) MA50 $ 2,321.73 (BUY) $ 2,087.63 (BUY) $ 2,685.39 (SELL) $ 1,923.03 (BUY) MA100 $ 2,196.73 (BUY) $ 1,955.41 (BUY) $ 1,545.55 (BUY) $ 1,888.48 (BUY) MA200 $ 1,976.76 (BUY) $ 1,861.02 (BUY) $ 2,148.26 (BUY) $ 1,666.57 (BUY)\n\nPeriod Value Action RSI (14) 46.87 NEUTRAL Stoch RSI (14) 100.00 SELL Stochastic Fast (14) 61.00 NEUTRAL Commodity Channel Index (20) -66.67 NEUTRAL Average Directional Index (14) 7.31 NEUTRAL Awesome Oscillator (5, 34) -60.55 NEUTRAL Momentum (10) 34.04 NEUTRAL MACD (12, 26) -3.45 NEUTRAL Williams Percent Range (14) -39.00 NEUTRAL Ultimate Oscillator (7, 14, 28) 47.26 NEUTRAL VWMA (10) 2,306.87 BUY Hull Moving Average (9) 2,309.05 SELL Ichimoku Cloud B/L (9, 26, 52, 26) 2,441.28 NEUTRAL\n\nThe Relative Strength Index (RSI 14) is a widely used indicator that helps inform investors whether an asset is currently overbought or oversold. The RSI 14 for Ethereum is at 46.87, suggesting that ETH is currently neutral.\n\nThe 50-day Simple Moving Average (SMA 50) takes into account the closing price of Ethereum over the last 50 days. Currently, Ethereum is trading below the SMA 50 trendline, which is a bearish signal.\n\nMeanwhile, the 200-day Simple Moving Average (SMA 200) is a long-term trendline that’s calculated by taking an average of the ETH closing price for the last 200 days. ETH is now trading below the SMA 200, signaling that the market is currently bearish.\n\nThe bottom line about this Ethereum prediction\n\nAfter considering the above factors, we can conclude that the current forecast for Ethereum price prediction is Bullish. ETH would have to increase by 8.10% to hit our $ 2,538.89 target within the next five days. Moving forward, it will be important to monitor the ETH market sentiment, the key support and resistance levels, and other metrics. However, we have to keep in mind that the cryptocurrency markets are unpredictable, and even the largest crypto assets display a lot of price volatility. For long-term Ethereum price predictions click here.\n\nDisclaimer: This is not investment advice. The information provided is for general purposes only. No information, materials, services and other content provided on this page constitute a solicitation, recommendation, endorsement, or any financial, investment, or other advice. Seek independent professional consultation in the form of legal, financial, and fiscal advice before making any investment decision."
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxNS3dVVkl4U3pScm5uLUlGS3ltSENoWGVEeUJqVXlOTU0ybENkcHZwSGs3blRqaktFSnBkRTlaTXlvdllXZ0VHcWFMQTZVODF0Ykh4T1hzaUZkM3JOQjhyakhPR0FzTHZyaDY1WmlTcDlKb1Y2eHpWd2lrcW1pT2dlek0yMTBpOWNHcTRMREV5SnlRcF9YbDFSX1dGamnSAaIBQVVfeXFMTkx2eXVNclRNWWFoc0VONF9fclJSRG94NS1mNDRXYURwZWJBU2hHdFdQLXd4UEFfeUhRNmg1RHNJNlBXa0hmZnNqb3ROLWZXbk95aXVPOFQwc0V5WWRWMzdwQ1c1VE5OQ2tjRTFaX1FRd3l4Sm1lYUJlSThsZVFId3lCYVN5NlFQQTdTQXRVd0lTRFo2T3U1NF91WEwyckVRSmVn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Feb 2024 08:00:00 GMT",
        "title": "Ethereum in the Spotlight- Sell-Offs, SEC Decisions, and Technical Signals - News Welcome",
        "content": "Ethereum, the second-largest cryptocurrency by market cap, finds itself in the middle of a myriad of critical events that are likely affecting its price and future outlook. Here is a glimpse into the recent billion-dollar sell-off, the SEC’s stance on a major ETF proposal, and a brief technical analysis for a comprehensive understanding of Ethereum’s current landscape.\n\nA Billion-Dollar Sell-Off Causing a Stir in the Ethereum Market\n\nA recent large-scale sell-off involving 459,561 ETH, valued at approximately $1.014 billion, by crypto financial services firm Celsius sent shockwaves through the Ethereum ecosystem. This massive transaction, primarily directed towards Coinbase Prime and Paxos Treasury, has raised concerns about Ethereum’s price stability and liquidity. While Celsius retains a significant ETH reserve, the market is reacting cautiously while observing how Ethereum absorbs this major outflow.\n\nSEC Holds the Cards while the Ethereum ETF Debate Continues\n\nTo add another layer of uncertainty, the SEC has hit pause on BlackRock’s proposal for a spot Ethereum ETF. This delay in the decision that was initially targeted for February indicates the SEC’s cautious approach towards crypto investment offerings. The future approval or rejection of this ETF is perceived to hold significant weight as it will likely influence investor sentiment and market movements.\n\nAnalyzing Potential Paths for ETH\n\nLooking at the technical side, Ethereum’s current indicators paint a mixed picture. The RSI (Relative Strength Index) suggests neutrality, while the stochastic %K hints at some bullish momentum. The CCI (Commodity Channel Index) leans towards a growing bullish trend, but the low ADX (Average Directional Index) indicates a lack of strong trend direction. Meanwhile, MACD and Awesome Oscillator readings are further confirming current bullish signals.\n\nSupport levels of $2295.48 and $2375.39 stand ready to cushion potential price dips, while resistance looms at $2573.47 and $2691.64. The 10-day and 200-day Simple Moving Averages (SMAs) at $2226.37 and $2358.42, respectively, suggest there may be a possible consolidation phase.\n\nPrice Predictions- Where Does Ethereum Go From Here?\n\nPredicting Ethereum’s price movements would require circumnavigating a complex interaction of technical indicators and fundamental developments. The SEC’s eventual decision on the ETF proposal and potential commissioner comments regarding the pending approval will no doubt have a significant impact on investor sentiment.\n\nFrom a technical perspective, immediate support and resistance levels will play a crucial role. A bullish scenario could see Ethereum test $2691.64, possibly reaching $2700 if the ETF receives approval. On the other hand, the recent sell-off and ETF delays might push prices toward $2375.39, with a further break likely to test $2295.48.\n\nHope vs. Caution for Ethereum- Final Thoughts\n\nOverall, Ethereum stands at a critical stage. Technical indicators present a balanced picture with hints of potential growth, particularly if the ETF receives a green light. However, the billion-dollar sell-off and regulatory uncertainty stress upon the need for caution. Investor sentiment and regulatory decisions will ultimately determine Ethereum’s path forward, keeping everyone on their toes for the time being.\n\nIt is pertinent to mention that this information is for educational purposes only and should not be considered financial advice. It is advised to conduct your own research and due diligence before making any investment decisions.\n\nhttps://www.investing.com/news/cryptocurrency-news/ethereum-eth-becomes-target-of-massive-1-billion-selloff-whos-responsible-3292047\n\nhttps://www.tradingview.com/news/cryptodaily:b6d7ba892094b:0-is-ethereum-s-stability-at-risk-after-a-gigantic-1-billion-sell-off/\n\n\n\n\n\n"
    }
]