[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxOLVB3Y04tZm01WHN1TGM1SEVOa2taOWFNbmtBZDFtU1FTNEdocXJLNDMtZWtzTVY4WXZvaWZtR0xMVlRGUjZpWmlmNC1qUk5PTk9NZkstb2k4ZUVOcVBZQ09FSDloZi15MWxWX3hBTmFuTU1VSUJSSkhlU3VuSDhvaTQ3WWlqVXJ1WDhmSHNyeW5WVkxFVGFYZlJFOEZ2N1dpdlpMU05GV29LanVKQkh2YldvQWdOSDlUb0lURVNtVXROWDQ0Z21qUVhNZjh3cVXSAdQBQVVfeXFMTmh0SG9sT2tCSno5c08tU1hmdWUtdUc2VmpubzZEOFdvSTBiTU5nRnljaG9mNzltaW5HTXRMSHUzMEFpcGFOUmd4SGtka3djQWlZaEkyT1RiWFdDaTQ2TU9mT0pUNFE5MThaSzhsc1JlNW5XUU9ZSUVmRmVvR0hrWDhpakFMa0xIS25kRW11b1Y1eTRaUWlZcEhwMWdMbGxSNTJYcEpDUmlsNHVHT3BadkdpZ0lQMzVDTHZNV0dkYXVtcFktei1nb3I1eURhMjg4dnF4b2c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 May 2024 07:00:00 GMT",
        "title": "Ethereum: Long Term Bullish Pattern Ironically Has To Retrace In Order To Be Super Bullish - Investing Haven",
        "content": "Ethereum’s recent price movements present a paradox that might confuse the average investor. As Ethereum’s price dips, it could, counterintuitively, signal a highly bullish future.\n\nUnderstanding this dynamic requires a deep dive into the technical patterns that are currently forming on Ethereum’s long-term charts. Chart analysis is one of our forecasting methods with which we try to predict ETH prices in 2024 & 2025.\n\nThe Current State of Ethereum\n\nLately, Ethereum has experienced a downward trend that has left many investors feeling uncertain. This decline is not just a reflection of market sentiment but also a pivotal development in the broader technical narrative of Ethereum’s chart.\n\nThe price action, which can seem disheartening at first glance, might actually be setting the stage for a major bullish pattern: the cup and handle.\n\nETH – Why a Move Lower is Bullish\n\nThe concept might seem contradictory at first — how can a decrease in price be a good thing for investors? The answer lies in the pattern itself. A cup and handle formation is recognized in technical analysis as a bullish continuation pattern that often leads to a breakout.\n\nFor Ethereum, this pattern begins with a “cup” formation, which the cryptocurrency has been crafting through its recent highs and lows.\n\nThe “handle” part of the pattern, which Ethereum is potentially beginning to form now, typically involves a slight downward or sideways movement in price following the cup. This movement is crucial as it consolidates earlier gains and builds a base for the next upward surge. For the pattern to be validated and for the bullish implications to be activated, Ethereum must not fall below a critical support level — in this case, $2,250.\n\nETH – The Importance of the $2,250 Support Level\n\nThis support level is more than just a number. It represents a key psychological and technical threshold that must hold for the cup and handle pattern to complete correctly. If Ethereum’s price respects this support level during its current retrace, it will likely solidify the handle portion of the pattern and set the stage for a significant bullish breakout.\n\nStrategic Considerations for Ethereum Investors\n\nFor those looking to capitalize on Ethereum’s potential, here are some conditions and strategies to consider:\n\nMonitor the $2,250 Support Level: This is the line in the sand for the bullish scenario to remain intact. A sustained movement below this price could invalidate the bullish setup and necessitate a reassessment of your investment approach. Understand the Pattern’s Timeframe: The cup and handle formation is a longer-term pattern. Patience is required, as the development and completion of this pattern can span several months. Prepare for Volatility: The path to higher prices is rarely smooth. Prepare for potential volatility as Ethereum tests these crucial levels. Consider the Broader Market Context: While Ethereum’s individual price movements are crucial, the broader market context, including regulatory news and macroeconomic factors, can also significantly impact price action. Set Clear Investment Goals: Whether you’re looking for short-term gains or long-term growth, understanding your own investment goals and risk tolerance is crucial. This clarity will guide your decisions amidst market uncertainty.\n\nConclusion\n\nIronically, Ethereum’s recent price retracement might be exactly what is needed to propel its price to new heights. By respecting the critical support level and forming a complete cup and handle pattern, Ethereum is not just performing a technical maneuver but is also setting the stage for a potential major bullish trend in the future. For savvy investors, this period is not just about weathering the storm but recognizing the opportunities that such patterns may present."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxOZ1o3MFhoY2lpWTVJQlBPYUV4cjVJSC1qa3V2S1l3Q0pQaUI0RFJ3OXl4ODMyTzNlMHZxNHc2NjNIRGo5bnY3bHNVcWN0bWV2Sk5CalB5WDdaZ1ZXZ0twVElmZ0VTdVNOTXVJM0owc3ZjYmkwUzB5dnFHSG5DNDRzQWRFeXUta3VaSE45TWNtdmluYXVQOFdQX05UeGYya3lEQUxhc0lNZ0lOSDZzRk94bkxkU0JvR0gtOGRkSDNsV1U4czA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 May 2024 07:00:00 GMT",
        "title": "Saylor predicts SEC will designate Ethereum as a security and deny spot ETF applications this summer - CryptoSlate",
        "content": "MicroStrategy executive chairman and co-founder Michael Saylor believes the SEC will classify Ethereum as a security this summer and reject the related spot ETF applications filed by various asset managers, including BlackRock.\n\nSaylor made the prediction in a social media post on May 2 during a presentation at the MicroStrategy World 2024 conference. He further predicted that other cryptos “down the stack” will also gain an unregistered security designation, including BNB, Solana (SOL), XRP, and Cardano (ADA).\n\nSaylor said:\n\n“None of them will be wrapped by a spot ETF, none of them will ever be accepted by Wall Street…”\n\nSaylor instead asserted that Bitcoin (BTC) alone has full institutional acceptance. He called BTC the “one universal” institutional-grade crypto asset and said “there won’t be another one.”\n\nMicroStrategy’s founder is well-known for his exclusive focus on Bitcoin. Saylor’s statements come days after MicroStrategy said it added $1.65 billion of BTC to its corporate holdings in the first quarter and alongside the announcement of its Bitcoin-based decentralized identity (DID) product.\n\nCritical ETH decisions\n\nAlthough the market was initially optimistic about the approval of spot Ethereum ETFs, the expectations have fallen dramatically in the last few weeks, with Polymarket placing the odds of approval at a meager 11% as of press time. Analysts similarly revised their expectations from more than 80% chance of approval to less than 30%.\n\nThe critical date for the SEC’s decision is May 23, at which point it must decide on VanEck’s proposed ETF. The regulator is expected to decide on other similar applications simultaneously.\n\nThe SEC may also need to state whether ETH is a security. The blockchain development company Consensys intends to compel the SEC to state ETH is not a security in a legal case. US lawmakers have also asked for clarity on the matter in relation to another company, Prometheum.\n\nA clear designation for ETH could provide companies with a definite way to handle the asset. However, such a designation could also affect whether the SEC approves certain products, such as a spot ETF, and whether companies work with ETH without proper registration.\n\nMentioned in this article"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPcEswQ2R2WUJxc2ZSQjFCVHVDbm5HcW1VYl9WQ3JyajkwWC1lR1hDdF9tTjVmUFZpTVYzaUtSWHpiXzBzQWFnVzBIZVA2dUFELVNiTUtjeUQ2UURfZU5ZbG5CUUxVYlJHOFEyOW9wMmNrTUV2aWxNbF9KcC0xd1owMnhSSWd4RHBqak5JU0dwRFRweUttNnpxRg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 May 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum, and Dogecoin Make a Massive Recovery on Friday - The Motley Fool",
        "content": "A bad jobs report was good for crypto today.\n\nAfter a week of lower trends, Bitcoin (BTC -3.41%), Ethereum (ETH -2.30%), and Dogecoin (DOGE -7.20%) jumped in trading on Friday morning.\n\nAs of 3 p.m. ET, Bitcoin was up 4.1% versus yesterday's stock market close, Ethereum had risen 2.6%, and Dogecoin was up 5.6%. And they all moved based on the same piece of information.\n\nUnemployment data and crypto\n\nCrypto values jumped the moment the U.S. Labor Department released April 2024 jobs data. The U.S. added 175,000 jobs last month and the unemployment rate rose slightly to 3.9%.\n\nEconomists were expecting 235,000 new jobs and an unemployment rate of 3.8%.\n\nThere can be revisions to initial data, but the market will often react solely to the headline report. And that's exactly what happened with the crypto market's reaction only seconds after the report was released.\n\nDoes unemployment really impact crypto?\n\nThe question is really about what this news has to do with cryptocurrencies. Many market participants think a worsening economy means the Federal Reserve will lower rates more quickly. Current expectations are for a September rate cut, but there may be no rate cuts this year if inflation remains high.\n\nIt's a balance to keep rates higher if the economy weakens because lower rates can be a catalyst for more economic activity.\n\nI also question whether or not rates really have much of an impact on cryptocurrencies at all. Outside of more speculation, lower rates don't have any fundamental impact on the crypto market in most instances.\n\nHigher rates are bad for the crypto meme\n\nWhile Bitcoin has solidified its position as a form of digital gold and Ethereum is commonly known as a more utility blockchain with many scaling solutions, Dogecoin could be the most sharply impacted if rates stay where they are and the economy gets worse.\n\nDogecoin is a meme coin with no real utility and that meme position will be tough to hold if people have fewer funds to spend on speculative assets. I think that explains the reaction today.\n\nThis is part of the normal volatility of the crypto market, but it also highlights that eventually, the meme that started in 2020 may not hold much water.\n\nCaution in crypto today\n\nThe crypto market has been on a tear in 2024 despite higher interest rates and signs the economy is getting weaker. And there was also the tailwind from the approval of Bitcoin exchange-traded funds (ETFs) in the U.S.\n\nBut some of the market's tailwinds may be subsiding and that won't be good for valuations long term unless there's a significant increase in the utility of cryptocurrencies. Bitcoin is getting more expensive after the most recent halving and Ethereum hasn't proven to be very cost-effective either.\n\nDogecoin has very little utility and has been focused on its meme status, which can come and go.\n\nI think a day like this is a time to take some chips off the table in crypto as the market telegraphs there are weaker fundamentals for the economy ahead. Like it or not, the economy and the Fed are still the biggest drivers of crypto long term."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxOaVFROUw0QlNUUEZCc0FSLVhqamhhZmdHM0drTHEyeTVPQ3N5aG4zODlKVEtmQjloMmRoWHFfUWZxckVBUS00dmNkbkdCcjVRLTF1RDgwdTQtTTM1VmI5ZGk3ZGNoU3pYZzBJb0JOZlRBdWJQVHZIcUNuaFNjMlA2a0puNEk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 04 May 2024 07:00:00 GMT",
        "title": "Bitcoin (BTC) and Ethereum (ETH) Rockets Skyward as Furrever Token (FURR) Gives a Chance to Earn $10,000 - Yahoo Finance",
        "content": "Furrever Token\n\nNew York City, NY, May 04, 2024 (GLOBE NEWSWIRE) --\n\nIn the midst of recent turbulence in the crypto markets, characterized by a brief spell of uncertainty, Bitcoin (BTC) and Ethereum (ETH) have emerged as beacons of resilience, surging to new heights. However, amidst this soaring trajectory, Furrever Token (FURR) has ignited a fresh wave of excitement by unveiling a lucrative opportunity for investors: the chance to pocket a substantial $10,000 reward. As BTC and ETH continue their upward ascent, the allure of FURR's enticing competition adds an extra layer of intrigue to the already exhilarating world of cryptocurrency investing.\n\nBitcoin (BTC) Rockets Towards $62,000 Amidst Renewed Bullish Momentum\n\nAmidst a recent tumultuous period for the cryptocurrency markets, Bitcoin (BTC) is staging an impressive rebound, surging by nearly 5% to reach around $61,857.26. This resurgence follows a sharp dip below $57,000, with BTC climbing 5.2% over the last 24 hours. Market analysts are closely eyeing the critical $62,000 level, identified as a key resistance point on BTC's daily chart. While some traders anticipate a bullish breakthrough, others caution against a strong rejection, emphasizing the significance of sustained volume and candlestick closure above this threshold.\n\nTechnical indicators and on-chain data suggest various levels of resistance and potential targets, with some analysts eyeing $82,000 as the initial objective. With signals of bullish momentum strengthening, Bitcoin's price action continues to draw attention, with a possible bull flag formation on the weekly chart signaling further upward potential towards all-time highs and beyond.\n\nEthereum (ETH) Faces Regulatory Hurdles as SEC Decision Looms\n\nAmidst a backdrop of regulatory uncertainty, Ethereum (ETH) is currently priced at around $3,081.29, marking a 3.5% increase since yesterday. As the deadline for the U.S. Securities and Exchange Commission (SEC) decision on Ethereum Exchange-Traded Funds (ETFs) approaches, industry experts express skepticism regarding approval. Analysts like Michaël van de Poppe and MicroStrategy CEO Michael Saylor doubt the likelihood of approval for Ethereum Spot ETFs this May. Three prominent applicants, VanEck, Ark 21 Shares, and Hashdex Nasdaq, face hurdles as the SEC scrutinizes underlying securities issues, potentially leading to postponements rather than outright denials.\n\nConcerns are raised that Ethereum may be classified as a security by the SEC, a move that could impact not only Ethereum but also other major cryptocurrencies and ETF applicants. In contrast, Hong Kong's crypto market experiences significant growth, with nearly $300 million in weekly inflows following the launch of Bitcoin and Ethereum ETFs. This divergence from the U.S. market, where spot Bitcoin ETFs face notable outflows, underscores the shifting dynamics of global crypto investments.\n\n\n\n\n\nStory continues\n\nFurrever Token (FURR): A Whimsical Journey Through Presale Success and Cute Crypto Innovation\n\nFurrever Token (FURR) is poised to captivate investors and accelerate through its remaining presale stages, leveraging a unique blend of charm and innovation. With a mission to infuse the crypto space with a delightful dose of cuteness, FURR transcends traditional use cases, offering users an irresistibly charming experience.\n\nIn a market dominated by serious blockchain projects, FURR stands out by fostering a warm and friendly community centered around the universal appeal of adorable cat imagery. The tokenomics of FURR are designed to incentivize participation, with 65% of tokens available during the presale, creating ample opportunities for early investors to secure their stake in this whimsical ecosystem. Moreover, the team's commitment to transparency and longevity is evident through the allocation of 10% of tokens, locked for a year, reassuring the community of their dedication.\n\nThe launch on a decentralized exchange (DEX) like PancakeSwap further enhances accessibility and liquidity, ensuring a seamless experience for investors. Held on the Gleam platform, the competition spans 7 days, offering participants the opportunity to accumulate points by completing various tasks. At the end of the frenzy, three lucky winners will each walk away with a share of the $10,000 prize pool in FURR tokens. The stakes are high, with the first-place winner bagging $5,000 worth of FURR, followed by $3,000 for second place and $2,000 for third place. The competition kicks off on 02/05/2024 at 12:00 pm (UTC +1) and concludes on 09/05/2024 at 12:00 pm (UTC +1), so rally your purrfect skills and join us for a chance to claim your spot among the ultimate Furrever winners!\n\n\n\nJoin Furrever Token Presale Now:\n\n\n\nFurrever Token Official Website\n\n\n\nVisit Furrever Token Presale\n\n\n\nJoin Furrever Token Bonanza Competition\n\n\n\nJoin Official Telegram Group\n\n\n\nFollow Official X Account\n\n\n\n\n\nMedia Contact:\n\nRobert Smith\n\nhttps://furrevertoken.com/\n\nsupport@furrevertoken.com\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\nCONTACT: Robert Smith support at furrevertoken.com\n\n\n\n"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxPUUphcmNVUm1OSl9XNW9tMDM3Mi1sbkQxbG02WVZRejRqemdRN1QzVDBoWXNSd3F6SWhCM2NubVp6aXU2UlJIdVJoMFF1bTBWN1RxWXBKNnp3cUJJckM4RWFyTjJOekRUWi14dkRHMVd6S004b0NMdlR6V0VHLU44VERicFhlRlFhU2VjVkVKQjBtWDFGMU8xTjRPMXFpa3FlNzJYOFlTYl9Kam5xWWlVQ0xOU3o?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 May 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Whales Move 36,000 as Recovery Begins – Will It Claim Previous Highs? - The Tech Report",
        "content": "Why Trust Tech Report Tech Report is one of the oldest hardware, news, and tech review sites on the internet. We write helpful technology guides, unbiased product reviews, and report on the latest tech and crypto news. We maintain editorial independence and consider content quality and factual accuracy to be non-negotiable.\n\nEthereum is now on the path to recovery after a retracement on the weekly timeframe. ETH touched the $3,000 price level today, indicating buyers’ return.\n\nWhale activity has increased again amid the price recovery, with more than 36,000 ETH tokens moved. Will this affect Ether prices?\n\nEthereum Whale Movement Influencing Ether’s Price\n\nAccording to the on-chain analytics platform Whale Alert, 36,763 ETH has been moved in the past day.\n\nA whale address transferred 25,772 ETH to Coinbase Institutional, a major crypto exchange, and another whale acquired 10,990 ETH from Coinbase within the same period.\n\nThese transactions coincide with Ethereum’s fluctuating prices, which has sparked mixed sentiments among market participants.\n\nMeanwhile, Ethereum’s price has increased slightly today, trading at $2,980 as of 5:37 AM EST, with a 1.4% 24-hour increase. The monthly charts suggest the token has entered a consolidation phase, marked by high fluctuation around the $3,000 price level.\n\nEthereum Spot ETF Decision Likely to Affect its Price\n\nThe uncertainty surrounding the spot Ethereum ETF approval by the U.S. Security and Exchange Commission (SEC) is a major factor affecting Ethereum’s price.\n\nWhile enthusiasts are keen on approval, MicroStrategy’s CEO, Michael Saylor, is critical of an Ethereum ETF. According to Saylor, Ethereum is a security. Hence, the SEC would never approve an ETF for the altcoin.\n\nThis assertion by Saylor comes just 20 days away from the final ETH ETF deadline of May 23. The SEC will either approve or reject a request for an Ethereum ETF on that date.\n\nAlso, Saylor believes that other altcoins such as BNB, SOL, Cardano, and XRP will be classified as unregistered securities. He noted that Bitcoin stands alone in attracting institutional acceptance, and there is no second-best token.\n\nWhile opinions are divided on an Ethereum ETF approval, a positive response will likely attract more investors. If the ETFs are approved, Ethereum will likely record a massive rally.\n\nHowever, nothing is certain yet, and a decline is imminent for Ether should the SEC decline the spot ETH ETF approval.\n\nWhat Next for Ethereum?\n\nETH has formed a red candle on the daily chart after rallying to $3,000 earlier today. The sellers have continued to mount pressure, forcing a decline at the $3032.8 resistance level.\n\nHowever, ETH has found support at the $2938.2 price level, which is critical to preventing further decline.\n\nThe Parabolic SAR indicator has moved above the candles, a bearish signal of further decline. This confirms the bearish signal displayed by the RSI, which sits at 39.08, approaching the oversold region.\n\nGiven the upcoming spot ETF decision and the current mixed market sentiment, Ethereum’s price is at a critical conjecture. It could remain consolidatory in the coming days until a decision is reached, which will either propel it upwards or trigger a downturn.\n\nDisclaimer: The opinions expressed in this article do not constitute financial advice. We encourage readers to conduct their own research and determine their own risk tolerance before making any financial decisions. Cryptocurrency is a highly volatile, high-risk asset class.\n\n🔎Looking for the next 10X crypto?\n\nCheck out the best crypto presales to invest now"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMi0wFBVV95cUxNRXJic3hhOHV6TjRpOExmMFZTTHFiNTg4cmdZVmtyV1NSU1UtRHJXbGJBdUpXV0lwWWN6RTZoV1ZtNjg3U2NmekVnUjdTTGxiWG9oZ2RpYUV1UkZSWDROeFBfTzRXcmdwSk9tOEVKUzU3a1JUTEVid0liNXFyM1hCaW42YzZ4TzkxX3NIdnFfOFdFTjF5dVZUSlhhRWpRb2RzeEJTWG1tME43Y3NYREdfZFZvV21sN1dRcDZDcWpGaUUyZ00wV2w2MlRtRFN5VVhRU3lj0gHYAUFVX3lxTE5HaHRQQzNxLU5HMHhlNFMyRGg4NDNyUTBnNHdfc3QxQlpDMjI0WWZwQUkzV3lJN1FyS3pGZkpfWU93X0p3ektqa3RYR2JtM3UwV3cxdzNrY0ZUM3dHMzhKMmwzUDlOb01JcXVnLXlQcElLdHZRenVPZzl0Z3RHcFBMLTRuX1c3anE0bmtjenhOODQ2akttbE5NdkNyZDRlRGNuZXhQU0h5RmxETzFBQkw1bDhKaGhKeUJaa2wwVEVhZUwzanNwdmtFYkdGZkx5V2JMVGxkS1gxbQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 May 2024 07:00:00 GMT",
        "title": "Here’s Why One Crypto Analyst Doesn’t Think an Ethereum ETF Will Get Approval Despite ‘Altcoin Bull Market’ - The Daily Hodl",
        "content": "One widely followed crypto analyst is warning Ethereum (ETH) traders that an ETH exchange-traded fund (ETF) approval from the U.S. Securities and Exchanges Commission (SEC) is unlikely to happen soon.\n\nCrypto trader Michaël van de Poppe tells his 715,800 followers on the social media platform X that traders may have to wait a little longer for an ETH ETF.\n\n“The Ethereum ETF is likely not going to be approved in May.\n\nHowever, the markets are undervaluing a potential approval in August, as Ethereum is still getting sold off.\n\nI think the chances of an approval in August is positive, through which I expect Ethereum to outperform.”\n\nAccording to Van de Poppe, the current turbulence of the crypto markets presents an opportunity for crypto investors.\n\n“You wanted to buy Bitcoin at <$60,000.\n\nYou wanted to buy Chainlink at <$15.\n\nYou wanted to buy any altcoin in a correction.\n\nHowever, now, emotions kicked in and sentiment expects another drop, while the opportunity is here.\n\nMaybe you don’t feel you want to, but this is the time.”\n\nAccording to Van de Poppe, he favors trading newer altcoins over the “old” ones.\n\n“Old coins continue to provide bad returns as Polygon (MATIC) is on a cycle low.\n\nIt’s in the area of interest, but you should wonder whether it is going to generate a lot of returns or whether a new coin is going to yield higher upward returns.\n\nTo me: I stick to new coins.”\n\nMATIC is currently down 20% in the last month.\n\nThe analyst concludes by noting the most recent Federal Open Market Committee (FOMC) data is helping fuel today’s Bitcoin (BTC) rally and a wider altcoin bull run.\n\n“Terrible economic data -> DXY (US dollar index) down, additionally the case for quarterly earnings and rate cuts will increase and therefore risk-on assets rally.\n\nBitcoin back to $61,600.\n\nFOMC was the low for the markets and the altcoin bull market has started.”\n\nBTC is worth $61,702 at time of writing, up 4% on the day.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/KumaSora/LongQuattro"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQbUx2b3RSd3V1TGZCa3puV293TEFwa2hPbTJtajVQaGlCMXhFQUpSOVVkV3FiNnFGek92eGRyUlhDT09KQmEzSVNvWUVnY1NUbVAzZHJFNVN1NzN3bkVYMXdxQ29vTl91VlozNThYaktuLU1Qc1NkLVRQZktaRXlOeXFrUTZLaHcydXR2bl9TX0M1MTTSAZgBQVVfeXFMUFJadEhWLUxlVk5WUnlWcWlDcktHX0RZUGNIaU5aODBvMDBHLV9ieU01MzlMYlZRWTdsaUpGbU5OTlYwTDU5SHlkSHVNaHJmaklVTk5GQUcweTJkRloyS1BScnFtSXUtSkM2YVhmNHZnY2R6QmV5a0l6aFV3REtCN2FGTWlPUEd5WTA4S0l2YXBNbjhKdTVNV18?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 May 2024 07:00:00 GMT",
        "title": "Ethereum Price: Whales Move 36K ETH As Price Regains Momentum, What’s Next? - CoinGape",
        "content": "Despite a weekly pullback in Ethereum’s price trajectory, the world’s second-largest crypto by global market cap has once again sparked substantial investor attention. Today, on May 3, Ethereum’s price not only regained an upward momentum but also surpassed the significant $3K mark, a positive development that has reinvigorated the market, instilling a sense of optimism among investors.\n\nThis upward trend, coupled with a considerable spike in whale activity, has ignited a flurry of interest surrounding the token’s future price movements. Nearly 36,000 ETH was shifted over the past day, with whales dumping and buying and buying the so-called ‘eternal Solana rival’ token in hand.\n\nadvertisement\n\nETH Whale Activity: A Closer Look\n\nInsights from on-chain analysis platforms reveal that a total of 36,762 ETH was moved in the past day. Notably, whale 0xf83c… made a significant move by transferring 25,772 ETH to Coinbase Institutional, a prominent player in the crypto industry. In contrast, whale 0x0b4… acquired 10,990 ETH from Coinbase during the same period, showcasing contrasting strategies.\n\nThese transactions, coming in tandem with Ethereum’s recent turbulent price action, have ignited mixed sentiments within the broader crypto market. While one whale continued to buy the token amid a broader market dip, the other whale dumped colossal amounts of the same token, underscoring a bearish sentiment amid ETH’s status as a security saga.\n\nNonetheless, the price trajectory’s upward movement at press time skewed the scale more toward the optimistic side.\n\nAlso Read: Jack Dorsey’s Block Boosts Its Bitcoin Bet With 10% Gain Reinvestment\n\nETH Price Jumps\n\nAs of writing, Ethereum’s price jumped 3.08% in the past 24 hours and currently sits at $3.001. The token witnesses a high price flux movement at the $3K mark, with its monthly charts illustrating a consolidatory phase.\n\nCrypto market enthusiasts continue to extensively eye the token for further price action shifts as the security lawsuit and a post-BTC halving rally remain poised to impact the token’s market dynamics.\n\nIt’s worth noting that XRP, a Ripple Labs-backed token, has been on a sluggish price trajectory ever since it entered a legal tussle with the U.S. SEC. On the other hand, a post-halving rally usually pushes a parabolic uptrend in altcoins as well, historical data suggests, although it’s not always a guarantee of future price movements.\n\nAlso Read: Michael Saylor Attacks Ethereum Calling It A Security, Disapproves spot ETF\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxPNG9sbjBOcTJzbkdwYVQtaVJFS1N6Um83LTFyOVRGMWhnbWNiaG95N2ZFUVA3bjBfTVl4SmdIM0JrTk4wNGpoejJ4d1QxR3M4eDdhc2EteXZMOEVCZ2Jpd0oyRXhpVTZTX19tU1lrVzdGSENjMmFnS3lJNUlHQ0VNeUNVd1haYU1KSFV0VnlJMXZuSjJNWDBvVmlVb09qR1FRQVktV3NkclRpUE05NUtlTEZkc2tsU1hF0gG-AUFVX3lxTE56LVpBX2M2SUkwYkRGN0tjbmRBWUprNzZ2RmxDY0FUNFdsRFVXay0tUkYwbmU4RHVMcVFuQkNSdnRmX3dMWWpvMmtDT1AzYW9ydDBMdjVuYnBTc1pOMXFFVFNNc2lhMWFkeDZTaDdsb3QyMXpYRVBYdUFEcmp6WGxfb3FnczhlMF9qeGlWeUJUUC1VNE5OTElJRGg0SDNiNTJra2RabmZLc3pJcXdVaFE0NUowS3I0VXlHRFo3QWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 May 2024 07:00:00 GMT",
        "title": "Bitcoin’s downtrend, Solana and Ethereum form double bottom - FXStreet",
        "content": "Market picture\n\nCrypto market capitalisation rose 3.3% in 24 hours to $2.22 trillion. Local capitalisation bottomed near $2.10 trillion, confirming a sequence of declining local lows (2.3 in March, 2.25 in April) and highs (2.76 in mid-March, 2.67 in early April and 2.46 in late April).\n\n\n\nEthereum and Solana are adding from the area of the April lows and forming a double bottom. This is a positive but not too reliable signal, as Bitcoin has been in a downtrend throughout April.\n\n\n\nAfter the halving, it is logical to expect miners to increase sales from inventory, to invest in new capacity or to lock in profits. Also, the hype around spot Bitcoin ETFs is going away, which reinforces selling by speculators.\n\n\n\nAssuming Bitcoin stays within the global growth cycle starting in 2023, we should expect further price declines in the coming weeks. The nearest likely target looks to be the $51-52K area, where growth was paused in February and where the 200-day MA will be pulled up by the end of the month.\n\nNews background\n\nSoSoValue notes that outflows for $563.8 million from spot bitcoin-ETFs on 1st May reached their highest since product approval. Bloomberg noted the formation of IBIT and FBTC price discounts relative to net asset value (NAV).\n\n\n\nBlackRock believes that financial institutions, including pension, endowment, and sovereign wealth funds, will enter the ETF market in the coming months.\n\n\n\nVanEck calculated that the aggregate value of Bitcoin in the wallets of governments and companies is $175bn. That’s about 15% of the total BTC capitalisation.\n\n\n\nBitfinex said that Bitcoin options traders are preparing for a summer lull in the market. Summer is usually a period of low volatility in the crypto market. Cube.Exchange, on the other hand, pointed to the likelihood of increased price fluctuations in the summer against a background of low liquidity.\n\n\n\nToncoin (TON) resumed growth after a correction amid an investment from venture capital firm Pantera Capital with over $5bn in assets under management. ‘We believe TON has the potential to bring crypto to the masses as it is widely used in the Telegram ecosystem’, Pantera noted.\n\n\n\nOn 2nd May, TON developers announced the platform’s integration with the on-chain analytics service Arkham Intelligence. On 1st May, integration with the cross-chain platform Layerswap was implemented, which, according to its representative, will make it possible ‘to send USDC from any network and receive USDT on the TON blockchain’."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxQY0dsNUZSOTFPRlNjQ0YxbE0zRU9SN0NscHVuZ2FkdlVCOGF3S1NWTFZZdTlad2MySzlWeVRsUUs0Ulpkbld2WmFHal90bVpyXzZFOV9Zc2YxVmd3RkExdFprUzJFYVNnS3ZLX2NPRmFlS1JlVDNOMlJsMW9jWDVkR1JnQzJ1U1R0SGw3c1ZwZk9VYm9CcFZLXzM4TUM0UkQ3NTg1SHU5MC0xUmpXbFQ5V3JkU3dpVUlaMWhXUVluel9KbUxtTllNNzZ2YWPSAdIBQVVfeXFMT0FLNTdxNGtnUW9qaWc0SHZ6YjRXLUpVbkZaTW5tZUExWU4wanVueE92SngzcXF4R0hIZU51ZklNMm0yVUhOY3ZFQ2tSYUlaVGJuYWZUMmhFTFVYNTd3ZTZCaGNZckVobzhmUS1QUTdDQTZkcGoyMGxZemtwZC05dmltX3J6REFIVnR3UkxJQUYyN1dKZFl5b05PT2gwQmpKaVNhWVlQTHZWVGlJeUcyeWI3OTJsQmdmOW5KSDhuU3lOYnNiUGdiUDdhS1BKdWNOdUZB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 04 May 2024 07:00:00 GMT",
        "title": "Crypto Trader Says Top Ethereum Rival Primed for Massive Bull Run Ahead, Updates Outlook on Bitcoin - The Daily Hodl",
        "content": "A closely followed crypto strategist believes that one Ethereum (ETH) competitor is ripe to witness steep bursts to the upside.\n\nTrader Ali Martinez tells his 61,400 followers on the social media platform X that he is bullish on Cardano (ADA).\n\nAccording to the analyst, ADA “seems ready for a parabolic bull run” after seeing its value drop by about 50% over the past month. Martinez points out that in 2020, Cardano saw an over 50% correction before going on a vertical rally.\n\n“In 2019, Cardano consolidated within a parallel channel, signaling an end to the bear market.\n\nFollowing the stagnant phase, ADA broke out of the channel with a 75% surge, then underwent a 56% price correction, setting the stage for an impressive 4,095% bull run.”\n\nMartinez says that a similar pattern may be playing out this time around.\n\n“Recently, in 2023, something similar happened! Cardano consolidated within a parallel channel, marking an end to the bear market. Following this period of stagnation, ADA broke out of the channel with a 72% surge.\n\nNow, ADA has undergone a 50% price correction, setting the stage for an impressive bull run ahead!”\n\nLooking at the trader’s chart, he seems to predict that Cardano will appreciate by roughly 2,080% from current levels.\n\nCardano is trading at $0.467 at time of writing.\n\nAs for Bitcoin (BTC), Martinez says that the Tom DeMark (TD) Sequential indicator is flashing a bullish signal for the crypto king.\n\nTraders use the TD Sequential Indicator to predict potential trend reversals for tokens based on the closing prices of their 13 previous bars or candles.\n\nSays Martinez,\n\n“The TD Sequential presents a buy signal on the Bitcoin daily chart. It anticipates a one to four daily candlesticks rebound for BTC.”\n\nBitcoin is trading at $62,750 at time of writing, up over 6% in the past day.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxQZE5iRTBQcjFmUWRRaFNLaV80VE1qTDZhbmt1ZW1GQzlwWkpBM3JsOHF6V2NPa1cwcjV4R2VvWmpDc3ZzNlFpWTFlVDItNmRlTkZIMXdjaV9MUDRBdG1mcnlfcUhiRkxLTFhVWHhFQWp2N09vSktQbVE4bGxTTzBNbVhGTdIBiAFBVV95cUxOdkVLdlpFZEk0Y3djNW1WanBrVzNfRFotSVdrS0FqVElMd2gwOXYxeVNvMW1ISWJSSHl0N1k2Qkk2ZUZzWjZucTl5WXZteF9YYkYzMFE1T1dHM3JnRE1UT0kzLTYwS1NmN1RTZ1RaZTZCUm84R01rc1h3VmxUUy1Xdngtd0k0dHc3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 May 2024 15:59:22 GMT",
        "title": "'Ethereum Will be Fine': Solana Cofounder Reacts to Ethereum FUD - U.Today",
        "content": "Solana cofounder Anatoly Yakovenko recently weighed in on the ongoing discourse surrounding Ethereum (ETH), providing a measured perspective amid concerns raised by the community. Following a flurry of debate and uncertainty, Yakovenko defended Ethereum, asserting that while progress may be slow and challenging, the platform will ultimately sustain itself.\n\nAdvertisement\n\nThe discussion emerged against a backdrop of criticism directed toward Ethereum's research quality and talent retention. Some voices within the ecosystem expressed worries about the decline in research standards and the departure of experienced developers and researchers. Concerns were also raised regarding the significance of Miner Extractable Value (MEV) research and its perceived utility.\n\nEthereum will be fine! Progress will be slow and painful though, but such is life. Advertisement May 3, 2024\n\nIn response, Yakovenko acknowledged challenges while maintaining a positive outlook. He emphasized the platform's resilience and its ability to navigate obstacles over time. Despite acknowledging Solana's own hurdles, such as the Ore mining incident and ongoing spam issues, Yakovenko remained steadfast in his defense of Ethereum's potential.\n\nThe conversation expanded to comparisons between Ethereum and Solana, with Yakovenko highlighting Solana's technical achievements, particularly its transaction throughput, in contrast to ETH's scalability solutions.\n\nInterestingly, a similar situation has happened in the past, but in reverse. After the FTX crash at the end of 2022, Solana (SOL) faced serious skepticism from all sides, and many have already buried the blockchain. However, Vitalik Buterin, the creator of Ethereum, expressed his faith and support for the project, which as a result marked the bottom of the SOL token price at that time."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxOcDV3cFZaZU8tdVlHT0dJTklSZ3dHYS1uaHVzcEZjaEZPd1BTRWl6bmNtRS1VcDJvYWxQblFrV214V2NjUzRpMm9mZkl4emZpdldrQTM5QUtwUnhnQ0NEWTlwcWJVRVczQXhmNXF5aHFMNnFFNWZJN3NBMldOb3ZQbE1oQUlZdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 04 May 2024 07:00:00 GMT",
        "title": "Crypto: Ethereum incinerates $12.7 billion in ETH - Cointribune EN",
        "content": "Sat 04 May 2024 ▪ 3 min read ▪ by Evans S.\n\nEthereum is distinguished by an operation of remarkable audacity in the crypto sphere: the burning of 12.7 billion dollars’ worth of ETH. This strategic move, far from being a mere supply reduction, reveals a profound vision and a commitment to the stability and longevity of the cryptocurrency.\n\nEthereum and the Reduction of Its Crypto Supply\n\nThe burning of ETH, implemented following a major upgrade of Ethereum thousand days ago, involves the destruction of a portion of the transaction fees.\n\nThis process no longer rewards the miners with these fees, but rather removes them from circulation, inducing a notable deflationary effect.\n\nTo date, approximately 4.3 million ETH have been eliminated, marking a decisive shift in the platform’s monetary policy.\n\nThis reduction in supply aims to increase the scarcity of the ETH crypto, which, theoretically, could support or increase its value in the market.\n\nComparable to stock buybacks in the financial world, this strategy can promote an appreciation of the price, thereby offering investors an opportunity for gain, provided the demand remains stable or increases.\n\nThe crypto market’s reaction to this massive burn has been predominantly positive, interpreted as a sign of maturity and responsibility on the part of Ethereum’s developers.\n\nBy controlling inflation and reinforcing user trust, Ethereum solidifies its position as a leader among alternative cryptocurrencies.\n\nEconomic and Technical Implications\n\nThrough this burn, Ethereum also improves the security and stability of its network. This makes a majority control less attractive in a Proof of Stake framework. Thus, the ETH crypto becomes more resistant to manipulation attempts, ensuring greater reliability for large-scale transactions.\n\nThe burning process also acts as a catalyst for innovation. By adjusting its economic structure, Ethereum encourages developers to design cost-optimized decentralized applications (dApps), promoting the emergence of new uses and functionalities within the ecosystem.\n\nIn the long term, this strategy could redefine the economic landscape of cryptocurrencies. Ethereum positions itself as a technological platform and a strategic economic player, positively influencing its own economy and that of the sector more broadly. Meanwhile, the rush of investors continues.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTFB6NVJiZ3RGaFA1Njg1Y1didGk0Rkt1U3FaTy04aVJTdktnU1lkYkZZak1oLUl3V2s4VlFUaFFldDNKV0xaUS1GNjhXTGlxazE1anJ3VEgwcTF0VC15N0ZMaDB4RURPVUpELVJ6Tmc2T0xPNmpPSnVXYktCci1zd9IBgwFBVV95cUxOb2VhSi1ENkRnNXA1Z3NrWjdvMnJMMm9aekNCM25iV2psMnBIS3pzelZuTnFVM1dRdGFLNDl4X1RhZ09uOEItVjlPLTZuSUdKZmdRekN0dURna2pETWg1U3BJUml1bnBqb0RIel9EYXhNb2pkclVraFZkNjdGNFN2aXh1OA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 04 May 2024 07:00:00 GMT",
        "title": "Solana takes on Ethereum as ‘DEX war’ takes new turn - AMBCrypto News",
        "content": "Activity on Jupiter, Solana’s biggest DEX, trumped Ethereum-based Uniswap’s numbers\n\nETH’s volume remained higher than SOL’s, while JUP and UNI sentiment differed\n\nJupiter, a decentralized exchange built on the Solana blockchain, has overtaken Uniswap as the DEX with the highest number of Unique Active Wallets (UAWs). AMBCrypto noticed this after looking at data from DappRadar.\n\nAt press time, UAWs on Jupiter exchanges were over 205,000. Uniswap, built on Ethereum [ETH], had less than 170,000.\n\nHow did this happen?\n\nUAW measures the crypto-wallet addresses that interact with a network or applications. If the metric increases, it implies a rise in user activity. On the other hand, a decrease suggests dwindling attention.\n\nAs can be seen below, Jupiter’s active wallets rose over the last 24 hours while Uniswap’s declined. However, this is not just about the DEXs mentioned. Instead, it speaks more of the competition between Solana and Ethereum.\n\nFor years, Ethereum dominated Solana on this front. However, this cycle has been different, and there are reasons attached to it too. For starters, Solana has been the chain producing most of the top memecoins.\n\nWhile a few have appeared on the Vitalik Buterin-developed blockchain, it has not been able to match Solana. For instance, you could mention dogwifhat [WIF], Bonk [BONK], and Popcat [POPCAT] as some of the memecoins that have grown incredibly on Solana. On the other hand, PEPE seems like the only major one that has come out of the other.\n\nBeyond the emergence of tokens, another factor that has played a part is the transaction fees. Investigations revealed that the cheap fees Solana offers has helped with retaining traders. Though fees on Ethereum are now lower than before, it’s still nowhere close to what Solana’s fees are.\n\nSimply put, the DEX takeover happened as a result of a combination of these factors.\n\nThat being said, on-chain data also revealed that Ethereum’s volume is still much higher than Solana’s.\n\nETH, UNI, overtake SOL, JUP on some fronts\n\nAt press time, Solana’s volume was $3.32 billion. Ethereum, on the other hand, registered a figure of $12.39 billion. On the price front though, SOL led ETH in terms of growth.\n\nAt the time of writing, SOL was changing hands at $139.03 — A 537.65% hike in the last 365 days. Within the same period, ETH’s price appreciated by ‘just’ 61.10%.\n\nShould this performance remain the same in months to come, then SOL could topple ETH all through this cycle. However, it is important to note that the DEXs mentioned have their native tokens too.\n\nFor Jupiter, the ticker is JUP. Uniswap’s UNI is more popular as it is a lot “older’ than the former. At the time of writing, JUP’s price was $1.02, representing a 75.53% hike in the last 90 days.\n\nMeanwhile, UNI changed hands at $7.08 following a 14.54% hike within the same period. Regardless of the price action though, the Weighted Sentiment of Solana-based JUP was negative.\n\nEthereum-based UNI was in the green, indicating that market participants are more bullish on it than JUP. However, sentiment without action might not affect prices as JUP might continue to outperform UNI.\n\nRealistic or not, here’s SOL’s market cap in ETH terms\n\nFor Ethereum and Solana, the battle might not stop anytime soon. Ergo, participants might need to keep an eye out for developments on their respective blockchains."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxPREZDY09yeHJzcy12aE1ybmVxNTdyalFLbDFtaGJobXJ2WXk3bllhNmZMcUdqSjBxZ081NV9QR19FOGFuM0Z4Yy1NZlo5LTZRbzdqRUlVNXRuZ29BQW82d2xmNm1LOHhvaVRleGdnZHZCSUFuNHNfYTlNSVowTGVoZFRybmg3czhEODNIYVNaeXBXd1p0QkNheVgzQWtVNVIzcnQ1NE16ZV_SAa4BQVVfeXFMUHZiWUhJak9QWjhvQlVSNEEwOW1INzlaa0NvUXdFdm1xQjNTSVdVdzNtS1BQVG1WSUNOZFBxWktyWm9DQm1jaTRGd1MwRHFyWnlrUnItaXNFdVAwYWc2Ym9kNnBaTEx1bkZHN0tXNEdWcDU2VjNZSnFPSS13N3h6U2ZpeDdVNzFQT2lVSzRhYTktY1FqMTBPRTdROUg0ME9PQkJLR01jcUk2MFhPVmZ3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 May 2024 07:00:00 GMT",
        "title": "Crypto Prices Today May 3: Bitcoin Nears $60K As Ethereum & Other Altcoins Recover - CoinGape",
        "content": "The top crypto prices today registered a rebound as the Bitcoin (BTC) price surged past the $59,000 level. In addition, the Ethereum (ETH) price attained the $3,000 mark, losing hold on a crucial level. Moreover, other top altcoins, such as Solana (SOL), XRP, Cardano (ADA) also recovered significantly.\n\nMajor Crypto Prices Today\n\n1. Bitcoin Price\n\nThe Bitcoin price surged by 4% reaching $59,539.94 at the time of writing on Friday, May 3. On the other hand, it’s trading volume plummeted 39.14% to $30.11 billion in the last 24 hours. Whilst, the crypto’s market capitalization soared to $1.17 trillion.\n\nadvertisement\n\n2. Ethereum Price\n\nThe Ethereum price gained 3.07% to $3,001.36 at press time with a market valuation of $360.38 billion. Whilst, ETH saw its trading volume plunge 38.14%, reaching $12.47 billion.\n\n3. Solana Price\n\nThe Solana price recovered significantly and approached the the $140 mark today. The Solana price rallied 8.33%, settling at $139.84. In contrast, SOL witnessed a 20.36% drop in trade volume to $3.31 billion in the last 24 hours.\n\n4. XRP Price\n\nWhilst, the XRP price traded above the $0.52 level. The XRP price recorded a gain of 1.7m81%, reaching $0.5209. On the other hand, XRP’s trading volume slumped 43.68% to $1 billion.\n\n5. Cardano Price\n\nMeanwhile, the Cardano crypto price was up 2.82% to $0.4566 today. Whilst, ADA recorded a decline of 37.77% in its 24-hour trading volume, settling at $331.69 million.\n\n6. Dogecoin & Shiba Inu Price\n\nThe Dogecoin price surged 7.35% to $0.1336 while its rival, Shiba Inu price was rallied 6.37% and traded at $0.00002315.\n\nAlso Read: Jack Dorsey’s Block Boosts Its Bitcoin Bet With 10% Gain Reinvestment\n\nTop Crypto Gainers Today\n\nArweave (AR): The Arweave crypto surged 20.94% and traded at $34.15.\n\nThe Arweave crypto surged 20.94% and traded at $34.15. Bonk (BONK): The Bonk crypto price rallied 16.85% to $0.00002588.\n\nThe Bonk crypto price rallied 16.85% to $0.00002588. Pepe (PEPE): The Pepe crypto price was up 15.77% and was valued at $0.000007916.\n\nThe Pepe crypto price was up 15.77% and was valued at $0.000007916. Toncoin (TON): The TON crypto price rose 13.64% to $5.38.\n\nTop Crypto Losers Today\n\nCosmos (ATM): The Cosmos price lost 1.66%% to $8.58.\n\nThe Cosmos price lost 1.66%% to $8.58. Gnosis (GNO): The GNO price dipped 0.67% to $304.84.\n\nThe GNO price dipped 0.67% to $304.84. Kaspa (KAS): The Kaspa crypto dropped 0.36% to $0.1074.\n\nDue to the recent rebound, only the above-mentioned three cryptocurrencies made it to the top crypto losers list. Meanwhile, the gainers list included Ondo, Immutable, Dogwifhat, and Jupiter among others.\n\nAlso Read: Tether Implements Chainalysis Surveillance to Tackle Illicit Crypto Activities\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE1zOGd5dDNqbnRyR2ZiSkhadjRDSnU5RXphWFBRUzd5ay1Lck4tUUotVWszaFhFY3Nja0xia09zR0gxajZEVDBlOTROeWU4S2tTQnppYTlvNVdvWHhQd1hmMjdEb0V4UDQ0WE1yS3VqdnNDUmNNZGRKeVphRFZxQ0HSAYQBQVVfeXFMTm1LZ0d3TEVJWUtrX1lQSHhDN1V4d25ldGN4elYwQ2RWb0d0ZjNza055WHRLQUxoZmRWTXRET0RuSXpHOUFfS0V2b1FiX1BoZzRNZ29fMDBVN1BGZFJ1R2FBbFlSNUd5bEc2MHF6LVFfN3BROGEycDVrckl5SWF4VFB2YVEy?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 04 May 2024 07:00:00 GMT",
        "title": "Ethereum NFTs on Blast – Should ETH holders worry now? - AMBCrypto News",
        "content": "Blast overtook Ethereum in terms of NFT volume\n\nWhile ETH’s price fell, network growth and velocity grew significantly on the charts\n\nEthereum [ETH] has largely been dominant in most sectors across the crypto-space. On a certain front, however, it would seem that the tides have shifted in favor of the Blast network.\n\nNFTs on full Blast\n\nRecent data suggests that over the last 24 hours, Blast NFT collections like PAC REKT, Blastopians, and Plutocrats have collectively generated more volume than the entire Ethereum NFT market across all exchanges.\n\nNow, even though Blast outperformed Ethereum in terms of NFT volume, a significant portion of this volume can be attributed to wash trading. For context, Wash trading in NFTs inflates trading volume by buying and selling between controlled wallets, creating fake popularity, and misleading investors. It undermines the NFT market by distorting prices and reducing real liquidity.\n\nEven though a large part of Blast’s NFT volume can be due to wash trading, the declining interest in Ethereum NFTs does raise concerns about the state of the network. In fact, AMBCrypto’s analysis of Santiment’s data revealed that the number of NFTs being traded has fallen significantly.\n\nTaking a deeper look\n\nNFT collections on other networks such as Bitcoin and Mythos managed to outperform Ethereum NFTs. According to CryptoSlam’s data, popular Ethereum NFT collections such as BAYC and Crypto Punks were not able to get into the top 5 most sold NFTs over the last month. The number of Crypto Punk buyers fell by an alarming 20%, whereas the number of BAYC buyers fell by 2.78%.\n\nIf this trend continues, Ethereum may lose its top spot in the NFT sector soon.\n\nETH holders bleed\n\nAs far as ETH’s price is concerned, at press time, it had climbed back above $3,000 on the back of Bitcoin’s recovery. Additionally, the network growth for ETH continued to rise as well.\n\nRising network growth is a sign that new addresses have been showing interest in ETH. Velocity climbed too, implying a surge in transaction activity on the Ethereum network.\n\nRising interest from new addresses and growing velocity could help ETH see green and push the altcoin to the levels it was trading at prior to the latest market correction.\n\nHowever, the size of the addresses showing interest in ETH will also play a key role in Ethereum’s future price movement.\n\nFor instance, addresses holding 100-10,000 ETH were declining at press time, according to Santiment’s data. Substantial purchases made by large addresses can play a huge role in ETH’s price trajectory in the future.\n\nIs your portfolio green? Check out the ETH Profit Calculator"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxQS1FSVndaV2VPY1d1REZzSnRFNHZwM280YUpYQmxmUjhjWWdKcmtSN3UzMlo3cjNLdzRyNW5zQ0hrSzZkNFpiZHFPVl9sZUdpaEtaSndCVUtkXzdSaWZhX0VNcTZFdXVMU0RnYml1dFZ0bDhQdTh0aTJvbzlWQXNaUF8tVXU4TjJhRlowQTBJMW1OX3VwYWpiWUxPUzTSAaIBQVVfeXFMTzFJUnU3Tl84R0ZUYi05ZDhCT0JVVndpbFhaWVdfckF4emZ3TEJVek1Uc0RqOFV5bVpHQ0hMcXlSZ0VfTHJuT3FGQk5xSHhMcmFQQ2dDNFRpNFJKTWdWbXZPem5ZRDc4VTlGWFdYZmhXckkxcU9VTzVsT1dMLUtvMV9aRDh0T043VlVXQzlEVUF5cE1SaDRpRDJKSzgtZGp1QW5n?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 May 2024 07:00:00 GMT",
        "title": "Michael Saylor Attacks Ethereum Calling It A Security, Disapproves spot ETF - CoinGape",
        "content": "MicroStrategy executive chairman Michael Saylor has made a bold statement against Ethereum stating that the world’s largest altcoin is a crypto asset security and not a commodity. His comments regarding ETH came on Thursday, May 2, while speaking at the MicroStrategy World 2024 conference.\n\nMichael Saylor Attacks ETH\n\nIn addition to attacking Ethereum and calling it a security, Michael Saylor added that there’s a very high likelihood that the U.S. Securities and Exchange Commission (SEC) would never approve a spot Ethereum ETF. His comments come just 20 days ahead of the final deadline of May 23, for the SEC to either approve/deny the spot Ethereum ETf applications.\n\nadvertisement\n\nHe went on to forecast that other cryptocurrencies further down the hierarchy would also be classified as unregistered securities, including BNB, Solana (SOL), XRP, and Cardano (ADA).\n\nSaylor emphasized:\n\n“None of them will be included in a spot ETF, none of them will ever gain acceptance on Wall Street…”\n\nHe firmly asserted that Bitcoin (BTC) stands alone in achieving full institutional acceptance. He labeled BTC as the “singular universal” crypto asset suitable for institutional-grade investments, stating that “there won’t be another one.”\n\nMicroStrategy’s founder is renowned for his unwavering focus on Bitcoin. Saylor’s remarks come shortly after MicroStrategy announced the addition of $1.65 billion worth of BTC to its corporate reserves in the first quarter.\n\nTwo days before, MicroStrategy also unveiled its Bitcoin-based decentralized identity (DID) product MicroStrategy Orange. Along with holding a large stash of BTc on its balance sheet, the company has also been making strong efforts in order to boost the Bitcoin ecosystem.\n\nFuture of Ethereum ETFs in the United States\n\nWhile some of the top financial players like BlackRock and Fidelity have been pushing for a spot Ethereum ETF, market analysts have toned down their expectations of approval recently. One of the major concerns has been the recent comments from the SEC that seek to treat it as a security.\n\nHowever, some of the top crypto industry firms are willing to defend Ethereum at all costs. Last week, ConsenSys slapped a lawsuit on U.S. SEC, and wants to declare it as a non-security.\n\nAs the SEC’s investigations into Ethereum unfold, it’s evident that spot Ethereum ETFs may face obstacles in the near future, potentially leading to further legal battles.\n\nSpot market Ethereum ETFs would offer Wall Street firms and investors a means to gain indirect exposure to ETH, bypassing the need to navigate crypto exchanges or manage digital wallets. Earlier this week, Hong Kong became the first jurisdiction to approve a spot Ethereum ETF.\n\nBhushan Akolkar Bhushan is a FinTech enthusiast with a keen understanding of financial markets. His interest in economics and finance has led him to focus on emerging Blockchain technology and cryptocurrency markets. He is committed to continuous learning and stays motivated by sharing the knowledge he acquires. In his free time, Bhushan enjoys reading thriller fiction novels and occasionally explores his culinary skills.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxOYkxwbzJVNWdFTXpJVkk0ZEdyTTlhR18wMjg3VHgzckJTMzJRMTg2VGxuc21wYWNEeDlOYS1teW9DVlFERlNJUFFybDI0bl9QaFQzdFFGekZLZnEyLWVYaWtqM1dXT1dmcnJiRzBlRHJWSk5TVW1fRHRGdHRMT0hyc2NhZkl0eU1uNk13U21FNF9ud3VDUEHSAZsBQVVfeXFMTXVQbENUbnQ2Tm9vb09DWEEydmtEVno5cGF2aWU4dFlmTFF1QmQwMDBBY3djSlVBajZWbDZBNzZlSmcwZXd3TE1WakV5b0V5NGY3VXRRLWNGV1dhbURtcmR5ZC1PY2liNDJKWkUxeTkxLWpZRWNvSklYeTc1bUprS0l1cnF6MHVqZ2ZDZlM5MWFwazNIclFMY2phREk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 May 2024 07:00:00 GMT",
        "title": "Shiba Inu: ShibaSwap to operate on Ethereum, Solana: Impact on SHIB? - AMBCrypto News",
        "content": "ShibaSwap’s 24-hour trading volume more than doubled.\n\nEcosystem tokens like SHIB and BONE saw impressive spikes in the last 24 hours.\n\nIn a major feat for the Shiba Inu [SHIB] ecosystem, decentralized exchange (DEX) ShibaSwap went live on the layer-2 (L2) blockchain Shibarium, ushering in a new multichain era.\n\nThe update was provided by Shiba Inu marketing lead Lucie via an X post dated the 1st of May. With the integration, Shibaswap would operate on both the Ethereum [ETH] and Shibarium networks.\n\nThe ecosystem’s primary token SHIB was trading at $0.00002245 as of this writing, up 6.4% in the last 24 hours, data from CoinMarketCap showed.\n\nBone ShibaSwap [BONE], ShibaSwap’s governance token, also got a 5.76% hike in the 24-hour period.\n\nBig boost for ShibaSwap\n\nSince its launch in July 2021, ShibaSwap has been functioning on the Ethereum blockchain as a DEX, offering services like staking, liquidity pools, and yield farming.\n\nThe platform has handled trades worth more than $17 billion as of this writing, AMBCrypto noted using DeFiLlama data. In the last 24 hours, the trading volume more than doubled to $2.55 million.\n\nShibarium was due for a hard fork on the 2nd of May, in a bid to make the network faster and more cost-effective.\n\nThe improved network performance could provide just the right ecosystem for ShibaSwap to grow further.\n\nWhat’s in there for SHIB?\n\nUtility projects like ShibaSwap and Shibarium were planned steps by the Shiba Inu ecosystem to rise above the meme coin status and add utility to native tokens.\n\nThe news of Shibarum’s integration not only caused SHIB to spike, but resulted in a dramatic increase in the new addresses created on the network, AMBCrypto noted using Santiment data.\n\nRead Shiba Inu’s [SHIB] Price Prediction 2024-25\n\nThe daily active addresses also spiked 11% on the 1st of May. The positive commentary around the coin also increased, as evidenced by the weighted sentiment indicator.\n\nLike the broader market, the second-largest meme coin had a rough April, losing more than 12% throughout the month."
    }
]