[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiZ0FVX3lxTE5DWVVaUmVXc1JIa0pmYWl4R096ek9wSVMyYzBacFlQSlVINWZmMGs5QkgxaTJVUWZ6Rzh3Zk5yUkdORUl0YklxWEctU2ZJcWN5eXI0VnM0T3FrUkctbC1US2tmU2Ffa0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Jun 2024 07:00:00 GMT",
        "title": "What Does Proof-of-Stake (PoS) Mean in Crypto? - Investopedia",
        "content": "What Is Proof-of-Stake (PoS)?\n\nProof-of-stake is a blockchain consensus mechanism for processing transactions and creating new blocks. A consensus mechanism is a method for validating entries into a distributed database and keeping the database secure. In the case of cryptocurrency, the database is called a blockchain—so the consensus mechanism secures the blockchain.\n\nLearn more about proof-of-stake and how it is different from proof-of-work. Additionally, find out the issues proof-of-stake attempts to address within the cryptocurrency industry.\n\nKey Takeaways Under proof-of-stake (POS), validators are chosen based on the number of staked coins they have.\n\nProof-of-stake (POS) was created as an alternative to proof-of-work (POW), the original consensus mechanism used to validate transactions and open new blocks.\n\nWhile PoW mechanisms require miners to solve cryptographic puzzles, PoS mechanisms require validators to hold and stake tokens for the privilege of earning transaction fees.\n\nProof-of-stake (POS) is seen as less risky regarding the potential for an attack on the network, as it structures compensation in a way that makes an attack less advantageous.\n\nThe next block writer on the blockchain is selected at random, with higher odds being assigned to nodes with larger stake positions.\n\nInvestopedia / Crea Taylor\n\nUnderstanding Proof-of-Stake (PoS)\n\nProof-of-stake reduces the computational work needed to verify blocks and transactions. Under proof-of-work, hefty computing requirements kept the blockchain secure. Proof-of-stake changes the way blocks are verified using the machines of coin owners, so there doesn't need to be as much computational work done. The owners offer their coins as collateral—called staking—for the chance to validate blocks and earn rewards.\n\nValidators are selected randomly to confirm transactions and validate block information. This system randomizes who gets to collect fees rather than using a competitive rewards-based mechanism like proof-of-work.\n\nTo become a validator, a coin owner must \"stake\" a specific amount of coins. For instance, Ethereum requires 32 ETH to be staked before a user can operate a node. Blocks are validated by multiple validators, and when a specific number of validators verify that the block is accurate, it is finalized and closed.\n\nTo activate your own validator, you'll need to stake 32 ETH; however, you don't need to stake that much ETH to participate in validation. You can join validation pools using \"liquid staking\" which uses an ERC-20 token that represents your ETH.\n\nDifferent proof-of-stake mechanisms may use various methods to reach a consensus. For example, when Ethereum introduces sharding, a validator will verify the transactions and add them to a shard block, which requires no more than 128 validators to form a voting \"committee.\" Once shards are validated and a block created, two-thirds of the validators must agree that the transaction is valid, then the block is closed.\n\nHow Is Proof-of-Stake Different From Proof-of-Work?\n\nBoth consensus mechanisms help blockchains synchronize data, validate information, and process transactions. Each method has proven successful at maintaining a blockchain, although each has pros and cons. However, the two algorithms have very different approaches.\n\nUnder PoS, block creators are called validators. A validator checks transactions, verifies activity, votes on outcomes, and maintains records. Under PoW, block creators are called miners. Miners work to solve a hashing problem to verify transactions. In return for solving it, they are rewarded with a coin.\n\nTo \"buy into\" the position of becoming a block creator, you need to own enough coins or tokens to become a validator on a PoS blockchain. For PoW, miners must invest in processing equipment and incur hefty energy charges to power the machines attempting to solve the computations.\n\nThe equipment and energy costs under PoW mechanisms are expensive, limiting access to mining and strengthening the security of the blockchain. PoS blockchains reduce the amount of processing power needed to validate block information and transactions. The mechanism also lowers network congestion and removes the rewards-based incentive PoW blockchains have."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxOazdsdk5rNWhGcy1mcHkta3M4ZlhsajFrV0NibURIeFRxZWZRYWx0VEpmYmVRYllzN1B1dEVYaDZMcmtJMVJncVM0VmJDMHJ0Z00wZFdMUVRmMjVPY1ZyR0tFUzU4NWVzODFCb0xpWFQzdTV6QUg3YXI1Skhzcnl6NzBPY3E4SlR6cVF6UzY2SFNjdmk3RDZneHVrSFJ0M3lVUG1kWWg0NDVLdi1t?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Jun 2024 07:00:00 GMT",
        "title": "Spot Ether ETFs Could Eclipse Bitcoin ETFs' Impact | Cryptocurrency - U.S News & World Report Money",
        "content": "If the Securities and Exchange Commission's approval of spot Bitcoin exchange-traded funds represented a watershed moment for cryptocurrency, the arrival of spot Ether ETFs on Wall Street could be nothing short of revolutionary.\n\nIn a move that caught even the most bullish crypto cheerleaders off guard, U.S. regulators have cleared the way for ETFs for the world's most popular altcoin, Ether (ETH), the native crypto of the Ethereum decentralized blockchain platform.\n\nSEC Chairman Gary Gensler told CNBC on June 5 that spot Ether ETF approvals will take some time, a nuance misunderstood by many investors who believed they would be able to buy and sell spot Ether ETFs in a matter of weeks.\n\nDespite a long-standing belief that the SEC holds a more skeptical stance over crypto, on May 23 the regulator approved 19b-4 filings for eight spot Ether ETFs, including Grayscale Ethereum Trust and Bitwise Ethereum ETF on NYSE Arca; iShares Ethereum Trust on Nasdaq; and VanEck Ethereum Trust, 21Shares Core Ethereum ETF, Invesco Galaxy Ethereum ETF, Fidelity Ethereum Fund and Franklin Ethereum ETF on CBOE BZX. In early June, NYSE Arca also proposed a rule change to allow the listing of ProShares Ethereum ETF. None of these ETFs are available to trade yet, as the SEC still must give the nod to the funds' S-1 registration filings.\n\nSponsored Crypto Exchanges 1 Gemini Account Minimum $0 Fee 0.2% Maker Fee / 0.4% Taker Fee Gemini is well-suited for crypto traders of any skill level and available in all 50 states. Sign up and trade to get $10 in bitcoin. Open An Account 2 Kraken Account Minimum $10 Fee 0% to 0.4% Easy, Fast, Secure Crypto Trading of 200+ Cryptocurrencies. Made for Beginners and Experts Alike. Open An Account View Disclosure 3 Coinbase Account Minimum $0 Fee 0% - 3.99% Get up to $200 in crypto. Open An Account View Disclosure\n\nAlthough spot Ether ETFs are unlikely to emulate spot Bitcoin (BTC) ETFs in terms of inflows upon launch, the weight of the SEC's decision to approve one of the most functional projects in the crypto ecosystem is apparent. Though there are ETFs that offer managed exposure to Ether futures contracts, direct exposure to Ether will be new.\n\nWhile Bitcoin's status as the world's first and oldest cryptocurrency has helped to cement its popularity, more than 10,000 projects have been developed on Ethereum's blockchain, and the approval of Ether ETFs can help to generate far more mainstream acceptance of the cryptocurrency and the many crypto-centric innovations it's helped to grow.\n\nWith this in mind, let's take a deeper look at the contrasts between spot Bitcoin ETFs and spot Ether ETFs and why they shouldn't be seen as two sides of the same coin.\n\nSpot Ether ETF vs. Spot Bitcoin ETF\n\nThere are several important differences between spot Bitcoin ETFs and the spot Ether ETFs investors expect to be formally greenlit in the coming months.\n\nFirst, in terms of assets under management, Bitcoin ETFs are set to far outweigh those of Ether ETFs. As of June 12, the AUM for spot Bitcoin ETFs totaled $59.4 billion, representing an increase of more than double that of Grayscale Bitcoin Trust's $28.7 billion in AUM at the beginning of trading in January.\n\nBy contrast, Grayscale Ethereum Trust's AUM at the end of May were $11 billion. It's also unlikely that spot Ether ETFs will be inundated with the same opening-day inflow of $655.2 million that Bitcoin ETFs experienced.\n\nThis is because Ethereum is a more complex entity than Bitcoin, and is more difficult to value for investors. While Bitcoin's older blockchain framework isn't optimized for functionality in the same way as its younger counterparts, Ethereum is an example of how cryptocurrency can represent far more than a simple store of value.\n\nFor starters, Ether offers annual yield through staking, although this feature won't be available for ETF holders. Furthermore, Ethereum's blockchain has become a highly functional ecosystem for hosting decentralized finance, or DeFi, projects that can focus on peer-to-peer lending and offer advanced blockchain-based open finance services.\n\nEthereum's blockchain has also become a popular framework for the burgeoning non-fungible token landscape, and many NFTs today are bought and sold using Ether.\n\nBoth cryptocurrencies are fundamentally different on a technical level, too. Bitcoin operates on a proof-of-work (PoW) mining mechanism and a capped total supply of 21 million coins to impose a significant level of scarcity that has drawn comparisons to digital gold. Ether has no such circulation cap, and its proof-of-stake (PoS) mechanism for minting new coins requires far less computational power and can mint far more Ether.\n\nAs a result, Ether's market capitalization of $419 billion is far lower than Bitcoin's $1.3 trillion (as of June 13), but the more technical capabilities of Ethereum's blockchain have the potential to draw investor interest as it hosts more innovative DeFi projects that could drive digital transformation throughout the financial sector and beyond.\n\nThe New Spot Ether ETFs Explained\n\nAn SEC memorandum laid out the authorization for NYSE Arca, Nasdaq and CBOE BZX to list spot Ether ETFs. The new arrivals include:\n\nGrayscale Ethereum Trust\n\nGrayscale Investments filed to convert its Grayscale Ethereum Trust (ticker: ETH), one of the first securities solely focused on Ether, to a spot-price ETF. Despite Grayscale withdrawing its application for the Grayscale Ethereum Futures Trust ETF on May 3, the SEC's approval for NYSE Arca to list the Ethereum Trust signifies the institution's foray deeper into the world of crypto, following its Bitcoin Trust ETF, which was until recently Wall Street's largest crypto ETF with $19.1 billion in assets under management. The largest is now iShares Bitcoin Trust (IBIT), with $20.6 billion in AUM as of June 12.\n\nBitwise Ethereum ETF\n\nBitwise Asset Management is a crypto-focused pioneer that already made waves with the launch of its Bitcoin ETF. The institution has built a reputation for supporting next-generation technology, and its launch of a Web3 ETF in late 2022 underlines its commitment to exciting new innovations.\n\nEthereum already has some exposure throughout Bitwise's suite of services, like the firm's 10 Crypto Index Fund (BITW), which has offered investors returns of more than 50% for the first half of 2024 alone. Its Ethereum ETF is set to be listed on NYSE Arca.\n\niShares Ethereum Trust\n\nAfter becoming the world's largest cryptocurrency ETF provider with its iShares Bitcoin Trust ETF (IBIT) in recent weeks, forward-thinking BlackRock Inc. (BLK) is expected to become a market leader when its spot Ethereum ETF launches on the Nasdaq.\n\nThe firm already made amendments to its iShares Ethereum Trust on May 29 ahead of its pending launch, and the spot ETF is likely to be hard to beat for investors.\n\nVanEck Ethereum Trust\n\nThe VanEck Ethereum Trust ETF has been a leader in this field since news of VanEck's intentions broke in September 2023. VanEck has built a reputation for offering access to untapped markets, and its decision to focus on Ether ETFs is a major step toward more Wall Street acceptance of cryptocurrency.\n\nInvesco Galaxy Ethereum ETF\n\nFollowing the Invesco Galaxy Bitcoin ETF (BTCO), the Ethereum iteration will champion the same partnership between global ETF provider Invesco Ltd. (IVZ) and Web3 leader Galaxy Asset Management. The team will use its experience with direct exposure to digital assets to inform the fund's strategy.\n\n21Shares Core Ethereum ETF\n\nThis ETF's initial application was initially sought by two companies, 21Shares and Ark. However, the two companies have decided to end their partnership, and 21Shares has filed an updated application, rebranding from Ark 21Shares Ethereum ETF to 21Shares Core Ethereum ETF.\n\nFidelity Ethereum Fund\n\nApproved to list on CBOE BZX, the Fidelity Ethereum Fund seeks to build on the success of Fidelity Wise Origin Bitcoin Fund (FBTC), a spot BTC ETF with $11.9 billion in AUM.\n\nFranklin Ethereum ETF\n\nAnother CBOE BZX listing is the Franklin Ethereum ETF. As one of the first ETFs to announce its associated fees, Franklin has set a competitive annualized rate of 0.19% of net asset value. Because of its relatively low cost, many analysts have suggested that the firm has sought to spark a fee war by playing its cards early.\n\nLeveraged, Inverse ProShares Ether ETFs Hit the Market\n\nOn June 7, ProShares launched two funds – a 2x leveraged and 2x inverse ETF – tied to the Bloomberg Ethereum Index and listed on NYSE Arca. The leveraged ETF, ProShares Ultra Ether ETF (ETHT), targets a double return of whatever the index does during the day, whereas the inverse ETF, ProShares UltraShort Ether ETF (ETHD), provides the opposite of that. ProShares also makes leveraged and inverse exposure to Ether futures available through two other ETFs, and it offers ETF exposure to a combination of Bitcoin and Ether futures as well, according to VettaFi.\n\nHow Will Spot Ether ETFs Impact Crypto Prices?\n\nBecause Ethereum's blockchain hosts more than 10,000 crypto projects, the SEC's approval of a spot Ether ETF will have a major impact on the many altcoins that make up the cryptocurrency ecosystem.\n\nWith Bitcoin's crypto market share at about 54%, the arrival of a spot Bitcoin ETF carried a significant impact on the ecosystem at scale. The arrival of the spot Ether ETF, however, is likely to have a more profound effect on the remaining 46% of assets that make up the rest of the market.\n\nAcceptance helps deliver more regulatory clarity to the Ethereum blockchain, which in turn drives competition and encourages innovation. This paves the way for more small-cap projects to emerge and generates market momentum, making altcoins more visible to Wall Street and the financial sector, and ultimately supporting higher crypto prices.\n\n\n\nCould Spot Ether ETFs Offer a Boost to Spot Bitcoin ETFs?\n\nThe arrival of spot Ether ETFs is unlikely to have a direct impact on the price of Bitcoin. BTC itself is expected to drive the crypto market higher as a result of its anticipated post-halving event rally, which tends to deliver a bull market every four years.\n\nThat's not to say that Ether ETFs won't help Bitcoin ETFs grow, as crypto ETFs are adopted into the mainstream. Approval of the more technical Ethereum could also help institutions and individual investors understand cryptocurrencies better.\n\nWhy Was Staking Left Out of Updated Filings?\n\nOne major omission from spot Ether ETF filings was the cryptocurrency's staking framework. This comes after plenty of uncertainty over whether Ether is a security or commodity.\n\nEthereum staking works when investors can earn interest by locking up Ether on its blockchain for a predetermined period. This, according to the SEC, would classify staking-as-a-service as the offering of an unregistered security and has previously led to the commission taking out lawsuits against exchanges like Coinbase Global Inc. (COIN) and Kraken for allowing its users to stake their own coins.\n\nGrayscale and other ETF applicants were hopeful that they could add staking features to their ETFs, but they ultimately removed this aspect of their proposals when it became a sticking point for the SEC.\n\nThis core feature of Ethereum has been a popular way for users to build a passive income, however, and investors could be less enthusiastic about embracing spot Ether ETFs without staking.\n\nBuilding on a Landmark Year for Crypto\n\nBecause of Ethereum's greater functionality and more intrinsic link to cryptocurrencies as a whole, the final approval of spot Ether ETFs by the SEC, expected this summer, has the potential to eclipse that of January's spot Bitcoin ETF approval in terms of wider crypto acceptance on Wall Street."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxQYVYxeG03Smh1b0R3WHpnZTc1QWlwOE8tSnNHNHVUY2VzRFNRUlBpQWNpVEwwRzFZR1ZNaUlKTW5nMFhpWklFTEZxY0tVOGlTbkRaQkMwWWRiWTJzRnU3UTVWSTU5S1phcTlleUY1dms4UzdZc0pvRllLcWNTbHd0b2dqZUM0SU9lNUJVM1BkUUkwR3hiTmdhR0xPMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jun 2024 07:00:00 GMT",
        "title": "Bitcoin’s Little Brother: Will Ethereum ETFs Also Boost Ether’s Price? - Unchained",
        "content": "In a recent budget hearing, SEC Chair Gary Gensler told senators that the US spot ether ETF approvals should be completed by the end of the summer, so where does the market see ether’s price going before and after the launch?\n\nUS spot ether ETF registrations are currently being reviewed at \"a staff level\" and could be approved by the end of summer.\n\nWhen the U.S. Securities and Exchange Commission (SEC) approved the 19b-4 forms for eight different spot ether exchange-traded funds (ETFs), the price of ether surged nearly 20% within several hours of the news.\n\nNow ETF applicants are submitting their S-1s, a registration form which needs to be greenlit by the securities regulator before the funds can start trading on exchanges. The SEC’s Gensler alluded to this process being completed by the end of the summer when speaking to the Senate Appropriations Committee on Thursday.\n\nThe registrations are being reviewed at a “staff level,” Gensler said, and will still depend on issuers and how responsive they are to any comments they receive. With the ball in the court of ETF issuers, where does the market see the price of ether going before and after the launch?\n\nInvestment management firm VanEck, whose application for a spot ether ETF was one of the eight to receive approval on their 19b-4 form, recently raised their 2030 price target for ether to $22,000. But Katie Talati, head of research at crypto asset management firm Arca, said in an email to Unchained that as of late “ether has struggled to establish a strong narrative compared to other layer 1 solutions and the emergence of layer 2 solutions.”\n\nETH’s Potential Price in the Short-term (Pre-launch)\n\nShort-term, this lack of narrative could give ether a boost — though likely not as high as $22,000 — as traders were under positioned in the asset when the approval announcement hit.\n\nCoinbase Institutional’s trading desk, “has seen increased buying in ether following the 19b-4 approvals,” said David Duong, Coinbase’s head of institutional research, in an email, “It hasn’t been nearly as aggressive as what we saw in bitcoin before spot bitcoin ETFs launched in the US. That leads us to believe that the market is still under positioned.”\n\nFor bitcoin, it was a “buy the rumor, sell the news” event because there was so much speculation in the lead up to the January approval of the bitcoin ETFs. While in the case of ether, “traders didn’t sell the news—they bought it,” due to the surprise nature of the approvals, said Glen Goodman, author of “The Crypto Trader,” in an email to Unchained.\n\nInvestors should still tread with caution, Katie Stockton’s Fairlead Strategies’ June 10 report states that ether has already given back some of its outperformance to bitcoin since the spot ether ETF news. The analysts foresee bitcoin continuing to outperform ether in the near term, describing their analysis of ether’s weekly MACD and stochastics as neutral, adding that they “will assume a bullish bias once ether clears resistance near $3,925 on a consecutive weekly closing basis.”\n\nWhere ETH Could Go Long-term (Post-launch)\n\nAfter experiencing a pullback post-ETF approval, “bitcoin went on to rally 72% from $39,201 to $67,339, ultimately making a new all-time high price in March of 2024,” said Teddy Fusaro, president at Bitwise, a crypto investment firm that launched a spot bitcoin ETF in the US.\n\nIf this were to happen, ether would have to rally more than 35% percent from its current price to reach its November 2021 all-time-high of $4,867, Fusaro said.\n\nWhile that may be plausible, Arca’s Katie Talati is not convinced that spot ether ETFs will have as substantial of a long-term impact on ether’s price given that institutional demand is not as high for ether as it is for bitcoin.\n\nIn a previous interview with Unchained, Ophelia Snyder, co-founder and president of crypto ETP provider 21Shares, alluded to this, saying that institutional knowledge of ether pales in comparison to that of bitcoin. 21Shares manages the 21Shares Ethereum Staking ETP (AETH) in Europe as well as a spot bitcoin ETF in the US known as ARKB,\n\nTalati also noted that “the Grayscale Ethereum Trust, which has $10 billion in assets under management (AUM), will likely also experience consistent outflows and cause daily selling pressure in the Ethereum market.”\n\nA recent report from crypto research firm Kaiko shared a similar sentiment. “Once the ether ETFs launch, it is reasonable to expect selling pressure on ether from likely outflows or redemptions due to Grayscale’s ETHE, which has been trading at a discount between 6% and 26% over the past three months.”\n\nStill, crypto research firm K33’s senior analyst Vetle Lunde in a recent report anticipated that US spot ether ETFs will attract $4 billion in net inflows in their first five months after launch. In a message to Unchained, Vetle explained that he expects roughly 20% of this $4 billion to come from institutional investors, putting their anticipated AUM at $700-800 million.\n\nWhile some question whether the absence of staking in the ether ETFs will limit investor interest in the funds due to lack of APY (Annual Percentage Yield), Lunde does not see this as an issue, writing that, “99.1% of the AUM in Canadian ether ETFs are held in non-staked products, whereas 97.9% of European AUM sits in non-staked ETPs. This indicates that staking is far from a major issue among ETP investors.”\n\nIn April, the Hong Kong Securities and Futures Commission approved the trading of spot ether ETFs along with their bitcoin counterparts. Using Hong Kong’s market as a point of reference, Crypto Is Macro Now author and economist Noelle Acheson wrote in a recent newsletter that, “when/if the ether spot ETFs eventually launch, we should brace ourselves for a disappointing reception.” Acheson bases this prediction on the fact that since these securities began trading in Hong Kong, ether has accounted for less than 15% of the total spot crypto ETF AUM.\n\nPranav Kanade, VanEck’s digital assets alpha fund portfolio manager, shares this assumption that interest in the spot ether ETFs may not be as explosive as it was with bitcoin, writing to Unchained that “the narratives for bitcoin lined up perfectly, especially in the United States … the stars don’t seem to be aligning as perfectly as they did with the bitcoin ETF.”\n\nDespite this, Kanade said that their bullish 2030 price prediction for ether assumes that ETFs will be a catalyst for further interest into the Ethereum network and its varying applications, such as stablecoins and other tokenized financial assets. “This, in turn, will drive increasing levels of activity on Ethereum or its layer 2 solutions, resulting in a higher amount of ether being burned and a lower overall supply of ether,” Kanade said."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPd2d4RWdwbVlNLWZYeThDMDdFN0pkX085b0gzaml4ZkU1TlZUbGZWZk1CeTJ0Y2VTSWp5b0UxTXhYMHFBTVM2Q0tpbUlzSFFEWFlrOW9mVmVsRkR4ekZJcFptN0wwWmtabHdlUC0yT2FIOEt1SllfdXVfcUtzS2RfRlo4blJOdjRBSzhz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jun 2024 07:00:00 GMT",
        "title": "Beginner Investors Beware! Why Bitcoin, Ethereum, and Furrever Token Are Must-Have Investments in 2024 - Yahoo Finance",
        "content": "Furrever Token\n\nNew York, NY, June 14, 2024 (GLOBE NEWSWIRE) -- As the cryptocurrency market continues to evolve, new investment opportunities are emerging, making it an exciting yet challenging space for beginners. Among the many options, Bitcoin, Ethereum, and Furrever Token are standout investments for 2024.\n\nBitcoin, often referred to as digital gold, has a long-established history as the first and most prominent cryptocurrency. Since its inception in 2009 by the pseudonymous Satoshi Nakamoto, Bitcoin has maintained its market leadership. As of mid-2024, Bitcoin is on a strong upward trajectory, nearing $100,000 per BTC, with a market cap surpassing $1 trillion, solidifying its status as a stable and reliable investment. Adoption of Bitcoin has accelerated, with major financial institutions like Fidelity and BlackRock integrating it into their portfolios. Additionally, Bitcoin ETFs have gained traction, providing investors with easier access to this digital asset. With increasing regulatory clarity and acceptance, Bitcoin's role as a hedge against inflation and a store of value continues to strengthen.\n\nEthereum, not just a cryptocurrency but a decentralized platform enabling smart contracts and decentralized applications (dApps), is another key player. The transition to Ethereum 2.0, introducing a proof-of-stake (PoS) consensus mechanism, promises significant improvements in scalability, security, and energy efficiency. This upgrade is expected to attract more developers and projects, further solidifying Ethereum's position in the crypto ecosystem. Ethereum is the foundation of the booming decentralized finance (DeFi) sector and the non-fungible token (NFT) market. With most DeFi projects and NFTs built on the Ethereum blockchain, its utility and demand continue to grow. The potential approval of Ethereum ETFs by the SEC also signals a positive outlook for institutional adoption.\n\n\n\nFurrever Token (FURR) is emerging as a new player in the meme coin space, offering a unique blend of financial incentives and engaging cat-themed content. Unlike many meme coins that rely solely on hype, Furrever Token integrates tangible value through its innovative features. The token has already raised over $1.3 million in presale stages, highlighting significant investor interest.\n\nOne of the standout features of Furrever Token is its referral system, which allows investors to earn 10% in $FURR Tokens for every deposit made through their personal referral link. This incentivizes community-driven growth and promotes widespread adoption. Currently priced at $0.000732, Furrever Token offers up to 15X returns, making it an attractive option for investors looking to capitalize on early-stage opportunities.\n\n\n\n\n\nStory continues\n\nThe increasing institutional interest in cryptocurrencies like Bitcoin and Ethereum adds a layer of credibility and stability to these investments. Large-scale investments by hedge funds, publicly traded companies, and financial institutions signify confidence in the long-term viability of these digital assets.\n\nThe overall market sentiment for cryptocurrencies is positive, with Bitcoin and Ethereum showing strong performance indicators. Bitcoin’s recent rally towards $100,000 and Ethereum's advancements with Ethereum 2.0 create a favorable environment for both seasoned and beginner investors.\n\nInvesting in Bitcoin, Ethereum, and Furrever Token offers a balanced approach to portfolio diversification. Bitcoin provides stability and long-term value, Ethereum offers exposure to the rapidly growing DeFi and NFT sectors, and Furrever Token presents high-growth potential in the meme coin market. This diversified strategy helps mitigate risks while maximizing potential returns.\n\nFor beginner investors, the availability of educational resources and community support is crucial. Bitcoin and Ethereum have extensive online communities, forums, and educational content to help new investors understand the market. Furrever Token, with its community-centric approach, also offers robust support, making it easier for beginners to navigate the investment landscape.\n\nConclusion\n\nAs the cryptocurrency market continues to mature, Bitcoin, Ethereum, and Furrever Token present compelling investment opportunities for 2024. Bitcoin's market dominance and institutional adoption, Ethereum's technological advancements and market utility, and Furrever Token's unique value proposition and high potential returns make them must-have investments. By understanding these assets' strengths and staying informed about market trends, beginner investors can confidently enter the crypto space and capitalize on its growth potential.\n\n\n\nJoin Furrever Token Presale Now:\n\n\n\nFurrever Token Official Website\n\n\n\nVisit Furrever Token Presale\n\n\n\nJoin Official Telegram Group\n\n\n\nFollow Official X Account\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\nCONTACT: Media Contact: Robert Smith https://furrevertoken.com/ support-at-furrevertoken.com\n\n\n\n"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMi0AFBVV95cUxQMktrbmthSGZrNEZuMXNFT01jT19IZXpNaVBuc3dJUDdBQ3V0NnI2dE02bDB5TklBWGN5ZVo0N0hMYnJyMnFWZVhlUmN2bDMtQ05fbmZCMHdkMzJPVXlxVTZ1WUVlcDFBWUNMWVZkLXIydFNHdXFTN1p1WFQ3VHZaZ1RDQUZsQ3U0cjE3aXkwM3BwYkZTZENlOU81bmhKMWYybVBsRXRUMThsZ29DUEc0OUZVaFpzcVJRU3RJbTdMVlg2bHNFeXJIVE9GbWtkTV9E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Jun 2024 07:00:00 GMT",
        "title": "Gary Gensler: Ethereum Spot ETFs Could Start Trading By The End Of Summer - Benzinga",
        "content": "U.S. Securities and Exchange Commission (SEC) Chairman Gary Gensler has indicated that the approval process for the highly anticipated Ethereum ETH/USD spot ETF may be completed by the end of this summer.\n\nWhat Happened: “Individual issuers are still working through the registration process that’s working smoothly, and I envision sometime over the course of the summer…” Gensler told Senator Bill Hagerty.\n\nThe summer period in the United States typically spans from June to August, suggesting that the approval could come as soon as late August.\n\nAlso Read: MicroStrategy To Raise $500M To Boost Bitcoin Holdings\n\nThe potential approval of spot Ethereum ETFs represents a crucial milestone for the cryptocurrency market, offering investors a new avenue to gain exposure to Ethereum without directly holding the asset. It expected to attract significant institutional investment and potentially increase market stability, following in the footsteps of Bitcoin spot ETFs, which have already made substantial impacts on the market.\n\nIndustry analysts believe that the introduction of an Ethereum spot ETF could further legitimize digital assets in the eyes of mainstream investors and regulatory bodies.\n\nWhat’s Next: The upcoming Benzinga Future of Digital Assets event on Nov. 19 will provide an ideal platform for industry leaders and experts to discuss the implications of such regulatory advancements.\n\nAttendees will explore how the approval of the ETH spot ETF could shape the future of digital finance and investment strategies.\n\nRead Next: Elon Musk’s Decision To Hide Likes On X: ‘Catastrophic For Crypto,’ Says Solana VC\n\nImage: Shutterstock"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxOdE9hU19HNWgxTnRrSWd4bU1Tc1ZPRktnZlY4c3VlX1RMWWc2Q0NMVVhkRm5hcklaeF9rYVRJSjVrMkFyOG9HREJabkNFWGxBcE00Y2VmbEx6eS1RWkQ3SmYzN3pRVTBfdzFTcGtqanUyYmczSzJSd3pIUU5RYmg0eURxNERaZFFUeUE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Jun 2024 07:00:00 GMT",
        "title": "Crypto Market Guide: Bitcoin and Ethereum Lead the Market - Can Furrever Token Join the Ranks with its Referral Bonus? - Yahoo Finance",
        "content": "Furrever Token\n\nNew York City, NY , June 13, 2024 (GLOBE NEWSWIRE) --\n\nThe cryptocurrency market continues to evolve, with Bitcoin and Ethereum maintaining their positions as the leading digital assets. These two giants have set the benchmark for innovation, adoption, and market performance. However, a new contender, Furrever Token, is making waves with its unique appeal and innovative referral bonus system. This guide explores how Furrever Token could potentially join the ranks of Bitcoin and Ethereum and what makes it a compelling investment opportunity.\n\nBitcoin: The Pioneer of Cryptocurrencies\n\nBitcoin (BTC) remains the most well-known and valuable cryptocurrency. Launched in 2009 by an anonymous figure known as Satoshi Nakamoto, Bitcoin introduced the world to the concept of decentralized digital currency. Over the years, Bitcoin has experienced significant price fluctuations, but it has consistently maintained its position as the market leader. Recently, Bitcoin faced a dip in its price following the Federal Reserve's decision to keep interest rates unchanged, currently trading around $42,590. Despite this volatility, Bitcoin's long-term potential and widespread adoption continue to attract investors.\n\nEthereum: The King of Smart Contracts\n\nEthereum (ETH), launched in 2015 by Vitalik Buterin, has revolutionized the crypto space with its smart contract functionality. Ethereum allows developers to build decentralized applications (dApps) on its blockchain, making it the backbone of numerous blockchain projects. Ethereum’s price has shown resilience, currently on a bullish trend with predictions of reaching significant price targets in the near future. The network’s continuous upgrades and its pivotal role in decentralized finance (DeFi) and non-fungible tokens (NFTs) reinforce its strong market position.\n\nEnter Furrever Token: The New Contender\n\nAmidst the dominance of Bitcoin and Ethereum, Furrever Token (FURR) is emerging as a promising new player in the crypto market. Designed to bring a whimsical and heartwarming touch to the digital currency space, Furrever Token features adorable cat-themed imagery and a strong focus on community engagement.\n\nInnovative Referral Bonus System\n\nOne of the standout features of Furrever Token is its innovative referral bonus system. This system allows users to earn 10% in FURR tokens for every deposit made through their personal referral links. This not only incentivizes early adoption but also fosters strong community growth. The referral system is a unique strategy that leverages the power of community engagement to drive the token’s growth and adoption.\n\nStory continues\n\nStrong Financial Potential\n\nFurrever Token offers substantial financial potential, promising up to 15X returns for early investors. Currently priced at just $0.000732, Furrever Token is in Stage 9 of its presale, having already raised over $1.3 million, with a target of $1.9 million before its launch on PancakeSwap. This attractive entry point, combined with its innovative features, positions Furrever Token as a noteworthy investment opportunity.\n\nSecurity and Compliance\n\nSecurity and compliance are top priorities for Furrever Token. The project has undergone rigorous audits by Securi Lab to ensure a safe and reliable investment environment. Additionally, the team has committed to locking their tokens for one year, providing reassurance to the community about the project’s longevity and stability.\n\n\n\n\n\nCan Furrever Token Join the Ranks of Bitcoin and Ethereum?\n\nWhile Bitcoin and Ethereum continue to lead the market with their established presence and robust infrastructures, Furrever Token presents a fresh and unique opportunity. Its innovative referral bonus system, strong financial potential, and focus on community engagement set it apart from many other cryptocurrencies.\n\nAs the crypto market evolves, the potential for new players like Furrever Token to join the ranks of established giants like Bitcoin and Ethereum grows. Investors looking for new opportunities in the meme coin space should consider the promising prospects of Furrever Token.\n\nThe Takeaway\n\nBitcoin and Ethereum have solidified their positions as the top cryptocurrencies, but the market is always open to innovative new players. Furrever Token, with its unique appeal and innovative referral system, is well-positioned to capture the attention of investors and potentially join the ranks of these market leaders. Don’t miss out on the chance to be part of this exciting new project. Visit furrevertoken.com to learn more and participate in the presale. Use your referral code to earn additional FURR tokens and contribute to the growth of this vibrant community. Act now before the opportunity passes by, and be a part of the next big thing in the crypto market!\n\n\n\nJoin Furrever Token Presale Now:\n\n\n\nFurrever Token Official Website\n\n\n\nVisit Furrever Token Presale\n\n\n\nJoin Official Telegram Group\n\n\n\nFollow Official X Account\n\n\n\nMedia Contact:\n\nRobert Smith\n\nhttps://furrevertoken.com/\n\nsupport@furrevertoken.com\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\n\n\n\n\nCONTACT: Robert Smith support at furrevertoken.com\n\n\n\n"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiXkFVX3lxTE1SXzh3QVlmQXlQbkN2NERBUk9JY0ZmT1hhVWhFTU82dHJFUlJGQmFqT3dlUnAyYk1LT3FwN3Q2YjhEOEpPZmxlX19RWTk2WDBxTnB6TnQ5aDJYQTJOWUHSAWNBVV95cUxOeWJDa0l5LUtMOW5UWU1sRG93YWszcHNVNWppdUdPclZKak5KVFZvVi1QMF9XanpQdmNsSVc1Rm5hc004WUh5RWwxNVg4TU5wcl9LbEhUWWROYzd1azZ0SVFQRlU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Jun 2024 14:36:27 GMT",
        "title": "Solana Founder Reveals SOL Surpasses Ethereum In This Major Metric | Bitcoinist.com - Bitcoinist",
        "content": "Solana founder, Anatoly Yakovenko has declared that SOL has surpassed Ethereum, the world’s second-largest cryptocurrency in a critical metric – the economic barrier for honest nodes to participate in consensus.\n\nSolana Outpaces Ethereum By 10X In This Metric\n\nAccording to Yakovenko, the economic barrier for honest nodes to participate in consensus in Solana is 10 times higher than Ethereum’s at the moment. Typically, blockchains like Ethereum and Solana rely on a distributed network of computers, also known as nodes, to validate and record transactions. This entire process is called a consensus and ensures that all nodes in the network work together to maintain the blockchain’s performance and security.\n\nHowever, Yakovenko suggests that not all nodes are equal and participation in engagement in the blockchain’s consensus process usually comes at a steep price. These expenses are usually inflated by costs of running powerful hardware, and energy consumption.\n\nThe Solana founder also disclosed that SOL’s expensive nodes are primarily due to the investments Ethereum has made in Boneh-Lynn-Sacham (BLS) aggregation for consensus messages.\n\nThe Boneh-Lynn-Sacham is a cryptographic signature scheme leveraged by Ethereum which enables users to verify the level of authenticity of a signer. Notably, the BLS scheme can hold messages independently verified by node validators.\n\nReports from Ryan Berckmans, an Ethereum community member and investor, have revealed just how expensive running a Solana validator is. He disclosed that the Solana Foundation is currently financially supporting the blockchain because running a validator costs over $65,000 per year.\n\nYakovenko has disclosed undefined plans to adopt a more efficient consensus mechanism to address the heightened voting fees. He disclosed that as hardware improves, the lower bound fee to send validator messages to the entire cluster will eventually decrease. As a result, the cost per vote will also decline and Solana’s economic barrier for node participation may drop.\n\nAdditionally, the Solana founder disclosed that establishing voting subcommittees would lower vote fees and potentially reduce the vote load by rotating boxes in and out of the committee.\n\nETH and SOL Witness Slight Pullback\n\nLately, the price of Ethereum and Solana has been witnessing minor declines, underscoring the waning demand for these cryptocurrencies in the crypto market. As of writing, Solana has recorded a substantial weekly decrease of 12.91%, pushing its price down to $150.5.\n\nThe slight pullback in Solana comes amidst the broader market volatility and a slowdown in investor’s demand for the cryptocurrency. Despite its bearish performance, crypto analyst Ali Martinez is optimistic about Solana’s future outlook. Martinez has predicted a potential price surge as high as 53% for the popular cryptocurrency.\n\nOn the other hand, Ethereum has continually witnessed a decrease in its value despite the recent approval of Spot Ethereum ETFs by the United States Securities and Exchange Commission (SEC). As of the latest update, the price of Ethereum is trading at $3,485, marking a significant weekly decline of 9.49%."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxQQVhzTmRvZFBNUEdRUnVqLVZPWUFzdFB2VmMtT1Z4YWhYVmY3QS1rUGUzYnFqOC1RZ0MyRmVPZkp3WE1fNFhEMUpTWFQ1YWo5NjJNWTB0UXNvaUo2TWtjNlZCM0RZdGRUVEdVZXllY1hkRzJZQmk2cUZCYW5WWEJSRVluVzZxbE9OOFBJM1VrMDE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Jun 2024 07:00:00 GMT",
        "title": "Telegram’s TON blockchain eclipses Ethereum in daily users - Yahoo Finance",
        "content": "Telegram’s The Open Network (TON) has surpassed Ethereum in daily active addresses, marking a notable shift in the cryptocurrency landscape.\n\nAnalytics firm Delphi Digital reports that TON’s daily active addresses have consistently outpaced Ethereum’s throughout June, thanks to Telegram’s 900 million users.\n\nTON’s network activity boost is attributed to strategic initiatives, including the integration of the Tether (USDT) stablecoin and the introduction of Notcoin, a tap-to-earn token that attracted 35 million users in just five months.\n\nNotcoin is not the only Telegram mini apps that have gone viral. More recently, Hamster Kombat announced it surpassed 100 million cumulative users.\n\nWhile TON’s performance is noteworthy, it’s essential to consider Ethereum’s ongoing transition to layer 2 scaling solutions like Arbitrum, Base, and Optimism, which reported 1.3 million daily active addresses on June 11 alone.\n\nEthereum co-founder Vitalik Buterin supports these solutions as part of Ethereum’s scaling strategy, which complicates direct comparisons with TON’s metrics."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxPMWJfYWRZUVZ6eEkyRXh0WFpEeTJHVGFITXBoSE9FMEE3MmpTanBpR0JiOGREVUZIYVJHWUd5ZkFhOFJLM21KaWhpUmVucmVSMTNrTlV6d05manZCWDNsMFRfWkUzQ0U0d3c4MWNvVTZ2QUNzaWF1Yl94Vm5jbVplR3NEeldDdy1lRjNIWG9Ca2tKR1IxWXhOeDg3WlBkSHpQc1hBUnZNVWpXc2ZER0dObXkzTdIBuAFBVV95cUxNU2NyU1BXTFJLTlN2b3pJakR4eFBZYTdpR0N3cUhELWRHV0hHVHVmT1BnWTR5Q3NOWk85eEh6NHhnemYwWkhPdTE3YW05M0ZMX1dfRjVaN3dqdEc2SDM5b05VcGlvUXIzdjBtMktUcklpWXFZSXpMMm1vR29GMWczOERicGhfXzZ2dGNhNUF0ajdMTzZYcG1INkhMRElWb0dqb0QybklJdkpFY2dwNWZ0bnNrX1NzVno0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Jun 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) in Critical State, Here's Why Bitcoin (BTC) Can't Reach $70,000, Will XRP Reach All-Time Low? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nAlthough Ethereum was beginning to gain traction on the market, the severe and ongoing consolidation that produced virtually nothing and only pulled ETH at about $3,800 was an important signal pointing to the asset's potential future performance.\n\nDespite its early strong momentum, the price action of ETH has surprised a lot of traders. After hitting resistance at about $3,800, Ethereum entered a consolidation phase. The current decline that we have observed, which is frequently an indication of market indecision, was foreseen in this instance by sideways movement. Over the past few days, Ethereum's price has dropped significantly, approaching $3,500.\n\nThe market had been feeling bullish overall, so many people were surprised by this sudden decline. There are several possible reasons for this unforeseen behavior. Initial liquidity issues could be crucial. Furthermore, macroeconomic factors and investor sentiment are always important. Ethereum's performance may have been impacted by recent global financial trends, regulatory news or even bigger sell-offs on the market. It is also critical to keep in mind that fluctuations in Bitcoin (such as the decline below $70,000) frequently have an impact on the entire cryptocurrency market, including Ethereum.\n\nTechnical indicators show that there was a significant sell-off of ETH in a short period of time. Reentry by buyers onto the market may indicate potential for expansion. Moving averages also show another concerning pattern: the shorter-term MAs crossing below the longer-term MAs, which is typically a bearish signal. Despite the recent downturn, Ethereum's fundamentals remain strong.\n\nAdvertisement\n\nBitcoin is struggling\n\nBitcoin is struggling to cross the $70,000 threshold for a number of reasons. The significant lack of purchasing power is one of the main causes. Bitcoin's price previously reached all-time highs due to significant capital inflows.\n\nA decreasing number of new purchasers are nevertheless willing to make these high-level investments, according to the state of the market. The lack of buying interest is making it difficult for Bitcoin to surpass the psychological $70,000 barrier.\n\nThe change in institutional behavior is another important component. Institutions are now shifting money away from Bitcoin ETFs despite the fact that they were crucial to Bitcoin's earlier rallies. This change is partially the result of people looking for better returns in alternative asset classes or new developments in the cryptocurrency industry.\n\nThe potential price of Bitcoin is weakened by diminished institutional support because a significant portion of the buying pressure that raised prices came from these large-scale investors.\n\nFurthermore, strong fundamental drivers that have historically sparked enormous bull runs are absent from Bitcoin at the moment. While the NFT craze played a similar role in 2021, the ICO boom in 2017 propelled Bitcoin to previously-unheard-of heights. There is currently no trend or invention like this propelling investor capital and enthusiasm toward Bitcoin on a large scale.\n\nThe struggles of Bitcoin are also reflected in technical indicators. It appears that neither overbought nor oversold conditions exist as the Relative Strength Index (RSI) has been circling around neutral. This neutral RSI adds to the general sense of indecisiveness and uncertainty on the market, further impeding any meaningful price movement.\n\nXRP in trouble\n\nXRP's current state is really problematic. The asset has lost numerous key support levels like the 50 EMA, psychological levels at $0.5 and others. Such performance certainly puts XRP down on the list of better-performing assets. However, the only question now is: will it reach the yearly low of $0.44?\n\nXRP has been steadily losing value over the last few weeks as it has been in a downtrend. The first real red flag appeared when the 50-day EMA disappeared. After that, XRP dropped below both the critical psychological support level of $0.5, which is represented by the orange line on the 100-day EMA, further deteriorating its technical outlook.\n\nThe annual low of $0.44 is the next significant support level for XRP. The likelihood of reaching this level appears to be growing given the state of the market and technical indicators. There is a long-term bearish trend indicated by the 200-day EMA, which is still significantly above the current price.\n\nThe absence of significant purchasing power is one of the primary causes of XRP's downfall. The asset finds it difficult to hold onto its value, much less increase it in the absence of substantial buy-side interest. Due to investor caution brought on by macroeconomic uncertainties, the overall market conditions for cryptocurrencies are currently not very favorable."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxOdHRleDkxNXJkZXNaeU5Ua1g4QjAyUEVrWDFmSWVQT2llQlk0S2ltOVFOTDhTeVN3c3YwZ01oTmFodTNhYTBDdE1odGdIbVY2Y3pYalRsa1U0MFB0ZVV3ZlR5ejMwT2NlNUZEV1NqalR2MWNaU2owZDhMU01pTm1nSWJfVDFyNlFWZDV5ZDJRSGh1azZIQlVHSGR2YllDQ1dHSHQyWW1MYVRFWkHSAbABQVVfeXFMT1NPSEVIMzVibndMUTItdXMtRTFpMEd1VTZ1YldYRFYxVllkc1ExOVlVRGx5NzVjYnVlWUJUcGhGZm9SVDJ6MkZLNnVqaVdNWEJyUWlrMjJMR1lOUG5KYkJWbnFVWFk1VWN4aEt6S2ZaTVhTTk1KUV9rYXRPVUl4bm9hUHZtdERnZDhsSXp3QzRfTlJHbkhHQXVtWENNNkc3M3VVbEgyR1lTcjYxbXFfRmk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Jun 2024 07:00:00 GMT",
        "title": "When Will Ethereum Start Rallying Again? Here Are the Latest ETH Price Predictions - CryptoPotato",
        "content": "TL;DR\n\nEthereum (ETH) has declined to around $3,500, but analysts predict potential new all-time highs due to positive technical indicators.\n\nMetrics such as negative exchange netflow and a low RSI suggest reduced selling pressure and possible price recovery.\n\nIs It Time for a Resurgence?\n\nThe price of Ethereum (ETH), similar to many other cryptocurrencies, plunged significantly in the past several days. Currently, the second-biggest digital asset in terms of market capitalization is worth around $3,500 (per CoinGecko’s data), a 9% decline on a weekly scale.\n\nNonetheless, some analysts think ETH will face good days ahead, with some speculating about a new all-time high in the following months. The X users Wolf and Jelle are some examples.\n\nThe former presented a price chart showing that ETH has been on a bullish path since the beginning of 2024. The analyst envisioned enhanced volatility for the asset in the upcoming future, which will eventually lead to a bull run and a new all-time high price of over $5,000.\n\nJelle claimed that ETH “successfully retested the 50-day EMA.” The analyst believes the asset’s valuation could reach fresh peaks once it surpasses the $3,700 zone.\n\nThe 50-day Exponential Moving Average (EMA) is an important technical analysis tool that could suggest a potential price movement. It helps identify prevailing trends in the past 50 days but with a bigger focus on the most recent data, unlike the SMA, and provides insights into potential buy and sell levels.\n\n\n\nWhat Are Metrics Signaling?\n\nSeveral major indicators also hint that an ETH price revival might be in the cards. One example is Ethereum’s exchange netflow, which has been negative in the last four days. A shift from centralized trading platforms towards self-custody methods is considered bullish since it reduces the immediate selling pressure.\n\n\n\nSeparately, Ethereum’s Relative Strength Index (RSI) plummeted on June 11 to a multi-month low of 20.7, currently positioned at 36. The metric has not crossed the 70 mark since May 23.\n\nIt is a momentum oscillator that measures the speed and change of price fluctuations and identifies overbought or oversold conditions in a market. Its value varies from 0 to 100, with a ratio above 70 suggesting a pullback might be imminent."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxPNXZucUx3VUVKTS1sSVcxOG5MQ0VmX2pYSEVuMHpQV2NKemhONFkxeV9BYUpDVWxva1RCRmV1YzRmRTAtT3hkdGNDMG8tQTRES0dBZnIzanl6R1ZEczVMYVQ1MzVRWDJUc2RNUGFLZXVZRTI2Sy1FZk1FR2RmdXhXblpIYzZ3VkxSQnBZWkxINGRoRDBTOWRUNVYxMjLSAaIBQVVfeXFMTmx6TlRYWVRNTTdhQ3l5cEFkU2JDcmpaQ3lMWUVjckxRcE95NUhQNGNUTkVERk9hNmJLeS16bUdRZVlabmVEUmlmazFjdE5MUzlTMzZDX1FLN2FNY1JJVjhsLS1ZX1ZBRHlOdG9IdG5EZm9RUU9idmhSWTRHU3RnRi00aUt1enB0enliNTdQUDJ0dFJUWTFpM3JpX0NUUnFISy1n?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jun 2024 07:00:00 GMT",
        "title": "Altcoins: Shiba Inu, Chainlink, Ethereum Exchange Reserve Plunges, Price To Recover? - CoinGape",
        "content": "In latest developments, the top 10 exchange wallets for altcoins like Shiba Inu (SHIB), Chainlink (LINK), and Ethereum (ETH) have seen a significant decrease in their holdings since May 27, 2024. To be specific, Shiba Inu’s exchange supply has shrunk by 2.4%, Chainlink by 2.9%, and Ethereum by 8.6%.\n\nMoreover, such reductions in exchange reserves are generally interpreted as bullish indicators by traders. Hence, a potential for price recovery could be witnessed for SHIB, ETH, and LINK. Currently, all these cryptocurrencies are grappling with a downtrend.\n\nadvertisement\n\nShiba Inu (SHIB) Price Analysis\n\nAt the time of writing, the SHIB price was $0.00002175, up by 0.38% on Friday, June 14. This price movement places Shiba Inu at a pivotal point, encountering a significant barrier at $0.000022. If Shiba Inu can surpass this resistance, it may climb to $0.000025, with the possibility of reaching $0.00003.\n\nOn the other hand, increased selling pressure could push Shiba Inu down to $0.000021, and it might fall further to $0.00002 if market sentiment deteriorates. Whilst, technical analysis indicates that SHIB might be entering a consolidation phase. The MACD indicator reveals a convergence towards the signal line, hinting at a possible slowdown or reversal in momentum.\n\nWith the MACD line currently beneath the signal line, it signifies weak bullish momentum. Currently, the Shiba Inu RSI is at 37, suggesting a neutral market stance, as SHIB is neither overbought nor oversold. However, the RSI is nearing 30, which signals a oversold condition is looming. In the aftermath of such conditions, the price generally rebounds.\n\nMoreover, the reduction in Shiba Inu supply due to decreasing exchange reserve and frequent burns could also catalyze a rebound. On the flip side, most oscillators and moving averages on the daily chart are issuing sell signals. The 50-EMA being above the 20-EMA suggests a potential downward trend.\n\nAlso Read: Shiba Inu Coin Bull Run Ahead As SHIB Burn Rate Spikes Further\n\nChainlink (LINK) Outlook\n\nAt press time, Chainlink is traded at $15.32, down by 0.90%. This decline has triggered long liquidations, which account for over 95% of total liquidations, signaling a short-term price decline. However, the diminishing exchange reserve could lead to a rebound in the long term due to a reduced supply.\n\nAs exchange supplies decrease, it often points to accumulation by investors, which can drive prices up as supply dwindles. Moreover, the Chainlink price has sustained a profit of over 14% in the last 30 days despite the recent bearish turn. Hence, it could mirror the momentum for a reversal as the LINK open interest has also surged.\n\nEthereum (ETH) Prospect Following ETF Approval\n\nAccording to Santiment, Ethereum’s exchange supply has seen the most significant reduction among the three cryptocurrencies, dropping by 8.6%. This substantial decrease is viewed positively by bullish traders as it may indicate strong accumulation and potential for future price increases.\n\nRecently, Ethereum’s market narrative is also being shaped by regulatory developments. Crypto analyst Michaël van de Poppe highlighted a statement from SEC Chair Gary Gensler, suggesting that an Ethereum ETF might be listed during the summer. This anticipation signals a final correction before a substantial price surge, according to Poppe.\n\nThe approval of Spot Ethereum ETF S-1 filings is expected to have a profound impact on ETH’s price. It could potentially push the ETH price above $4,000 immediately after the ETF listing. Furthermore, Standard Chartered has projected that this development could even drive Ether’s price to exceed $8,000 by the end of the year. Such optimistic forecasts are underpinned by the expected influx of institutional investment following the ETF’s approval.\n\nAlso Read: Whale Heavily Bags SHIB, ETH, CRV, & Others, What’s Next?\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxOZVJZaDl6cDlweVFCQXdubFhZVEp5OVg4dWlMR0FjVGpzX0Y3aldtM04taUVtTkFmcFhwSGFMZ0J6ZVpNMXVSdEU4UGRENzJ6bU5DMFcxT2V6R29GWmp1aHZ5ck1adjgxVVg3MTVRZDJvWEtoRzdDMkFtN2JGSWZSbXMwR0RQNDctVGpiak10Y2FQTGY4S3pKd3dqbkfSAaQBQVVfeXFMTTFPVGhha2lZM0VZSXdCT3BlSmZVZFZ6OG5vXzQ0aFFUdFdBWHdWeGRnZmhFUzVVSlJKTnZqSGFhdkRadmx1MFRfSFJvSVU2anppSzlSdzRZWVp0dHNDWDJZUmVCUmZ5ekx3NnZGYko2alVDNHZURm1qM1VpeS1tZzVzeEhyZGx3U0FkT0ZyNzNpbnR4ME95Ry1wRXN0d1ljVTJSYlY?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jun 2024 07:00:00 GMT",
        "title": "Notcoin Posts 10% Gain as TON Daily Active Wallets Match Ethereum Again - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nTelegram-based clicker game Notcoin (NOT) is the top gainer out of the top 100 crypto tokens, after leaping 10% in the past 24 hours. This comes amid The Open Network (TON), the blockchain that Notcoin uses, matching Ethereum for daily active wallets.\n\nNotcoin has racked up a player base of 35 million users, hitting a peak of five million daily active users back in March. But it wasn’t enough for TON to flip Ethereum’s daily active wallets. It wasn’t until May 17 when TON flipped Ethereum for the first time.\n\nThe two networks traded places a couple of times until June 2 when TON led the charge for nine consecutive days, according to Artemis Terminal. Since June 10, the pair have been neck and neck. At the time of writing, TON is currently trailing by only 4,000 daily active addresses.\n\nIn turn, TON is up 5% in the past 24 hours and 5.5% over the past week, according to CoinGecko data.\n\nAD\n\nAD\n\nThe Open Network has had a good 2024. After the success of Notcoin, a slew of new Telegram-based games launched. And the team has said it has plans of releasing a token on the network.\n\nRecently the clicker game Hamster Kombat hit 100 million players, claiming the crown for the single largest Telegram channel. Now the game is planning a tentative token launch in July, which will see players convert in-game points to crypto tokens.\n\nTapswap and Yescoin are two new Telegram games looking to launch tokens on TON. The former, which claims 50 million players, previously offered Solana wallet integration but is now looking to launch its token on TON. While the former, Yescoin, is looking to bring its 18 million users to The Open Network, with over 6 million already connecting their wallets.\n\nThis explosion of new games launching with tokens on the horizon has led to TON becoming the 10th largest crypto token by market capitalization, according to CoinGecko, beating out Cardano for the spot.\n\nAD\n\nAD\n\nEdited by Stacy Elliott."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxNWm5uWmphSTBpbG5IRjRheUNSS19lZ3hjWkJaVXlWMncwdVBwNVpCVm1obThFS2s3dEEzNGtTMVpvblFkU3M2MHJyb3RVQ29sbWlzbmtUN1ppeElhclB4TTE4bXVtbDRmMUtmYXZFZ2Y4Yi1oN2gzanU3eEp5UTBnb185eUxidnExeGpPdjZNa3RYVWU4WDEzbXVIOWVTNko0b25OejFWdzg1c05jLXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Jun 2024 07:00:00 GMT",
        "title": "L'ICBC élève Bitcoin au rang de l'or et Ethereum à celui du pétrole - Cointribune EN",
        "content": "Thu 13 Jun 2024 ▪ 4 min read ▪ by Luc Jose A.\n\nThe world of cryptos has just taken a new decisive step: the Industrial and Commercial Bank of China (ICBC), the largest bank in the world by assets, has recently compared Bitcoin to digital gold and Ethereum to digital oil. This statement, coming from a leading financial institution, marks an important recognition of the significance and potential of cryptocurrencies in today’s global economy. By highlighting the unique qualities and distinctive roles of these two digital assets, ICBC draws attention to their growing place in an ever-evolving financial landscape.\n\nICBC elevates Bitcoin and Ethereum to the rank of strategic resources\n\nThe Industrial and Commercial Bank of China (ICBC), the largest bank in the world by assets, recently released a groundbreaking report that compares Bitcoin to digital gold and Ethereum to digital oil. This report marks a significant step in the recognition of cryptocurrencies by traditional financial institutions. According to the ICBC report, “Bitcoin retains the scarcity similar to that of gold by mathematical consensus, while solving its problem of being difficult to divide, difficult to identify authenticity, and uncomfortable to transport.” This statement highlights the transformation of Bitcoin, which has evolved from a mere potential currency to a robust and valuable financial asset.\n\nAt the same time, ICBC calls Ethereum “digital oil“, emphasizing its central role in powering Web3 applications and programs. The report states that “Ethereum has continuously upgraded its technology in terms of security, scalability, and sustainability, providing the technical power for the digital future.” This recognition illustrates the growing importance of Ethereum in the global digital ecosystem, serving as a crucial platform for innovations and decentralized applications.\n\nTowards a new era of financial recognition\n\n“The monetary attributes of Bitcoin are gradually weakening, while its asset attributes are constantly strengthening.” The ICBC report also highlights the growing importance of Bitcoin in today’s global financial system. By emphasizing its scarcity and robustness as an asset, the bank shows how Bitcoin has evolved to become a store of value, comparable to gold in the physical world. This analysis confirms the gradual transformation of Bitcoin’s attributes, where its qualities as an asset are constantly strengthening at the expense of its initial monetary attributes.\n\nThe ICBC report also highlights the crucial role of Ethereum in the digital economy. Analysts explain that “the introduction and development of stablecoins provide a bridge for the digital currency market to connect to the real world.” This functionality positions Ethereum as an indispensable platform for decentralized finance (DeFi) applications and non-fungible tokens (NFTs). By facilitating the connection between the digital market and the real world, Ethereum enhances its utility and relevance in the global financial landscape.\n\nEthereum’s innovative technology is also highlighted by ICBC. The report underscores Ethereum’s capability to enable the creation of complex smart contracts via its virtual machine (EVM) and programming language (Solidity). These technical innovations have allowed Ethereum to become the backbone of many decentralized applications, strengthening its role in the future digital infrastructure. By continuously improving its security, scalability, and sustainability, Ethereum positions itself as a robust and reliable platform for future applications.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxNcXc1djZrMkJVeG56bkdhdUV1elN5TFZ3X1d0eFE5ZkxGNC1sR3IzUUhXV0RaSUQ3MjJ0RDE3Z0NDYzNTUEZKcnYzR3RZUVkzbnpaZzd4RERSdmloRXlWbDJsX2puN0VRMjd1bUw1dTlsc0s4Nk5GX3JCN1lpNU9FM2x1dzZNSG01QkZyNUpQd9IBlAFBVV95cUxNOGdCV05YWHYwaWlza1A2eDN1NzBINm42bDdndWdTdGxQTE9wMjRPVF9wZ0UwQzJQY2lYay1YN25WZk1hOWpQSkFfeWxxWVVLR0lSUkJ0X1l2bktIWGJlMmN4djNIR3hCV2phSzh4cUtpc2dEdHlrcjFTeXg0YUl5SGFvSy04c2xlWkJubzNJNGZqVDJU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jun 2024 07:00:00 GMT",
        "title": "Aethir Ethereum launch sends ATH token soaring 100%, details here - AMBCrypto News",
        "content": "Aethir has launched its decentralized cloud computing network on the Ethereum mainnet.\n\nThe value of its ATH token may plunge in the short term.\n\nAethir, a decentralized physical infrastructure network (DePIN) provider, launched its decentralized cloud computing network on the Ethereum [ETH] mainnet on 12th June.\n\nThe protocol allows users to rent high-performance computing resources needed for training artificial intelligence (AI) and rendering digital content.\n\nThis service is crucial for organizations that require significant computational power as it offers flexibility and scalability for their operations.\n\nAethir’s mainnet launch comes with a native token, ATH.\n\nATH is required for governance and security within the Aethir ecosystem, staking on the Ethereum network, and payment to compute providers through Arbitrum [ARB].\n\nThis mainnet launch comes seven months after its testnet launch on 7th November 2023 on Arbitrum, a layer-2 scaling solution for Ethereum.\n\nIn its announcement, Aethir confirmed that its user base exceeded 500,000 on its testnet, and it completed a $146 million node sale.\n\nATH pursues new lows\n\nFollowing ATH’s launch, its price skyrocketed by almost 100% before correcting. At press time, ATH exchanged hands at $0.073. According to CoinGecko, its price has declined by 14% in the past 24 hours.\n\nIts daily trading volume totaled $261 million during that period, rising by 38%. The opposite movements of ATH’s price and trading volume indicated the presence of significant bearish sentiment in the token’s market.\n\nWhen an asset’s price declines while its trading volume surges within the same period, it signals a spike in selling pressure. This means that most token holders are looking to sell their positions, hence the downtrend in the asset’s value.\n\nAn assessment of ATH’s key technical indicators on an hourly chart confirmed the steady decline in the demand for the altcoin.\n\nFor example, its Relative Strength Index (RSI) and Money Flow Index (MFI) were 44.88 and 34.85 at press time.\n\nThese indicators measure an asset’s overbought and oversold conditions by tracking its price momentum and changes. At these values, ATH’s RSI and MFI suggest that market participants prefer to sell their holdings rather than accumulate new tokens.\n\nThis trend was confirmed by ATH’s Chaikin Money Flow (CMF), which measures the flow of money into and out of its market. As of this writing, this indicator’s value was -0.23.\n\nA negative CMF value is a sign of market weakness. It signals liquidity exit from the market, a precursor to further price decline.\n\nIf ATH’s selling pressure continues to increase, its price might decline toward $0.048.\n\nHowever, if the bulls re-emerge and token accumulation begins to climb, ATH’s value might rally toward $0.078."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxONnlSenVEWUlTakxoXzJUUHNTUy1BLWJSbzBPWThLS0hveFhfUEsxUUlhUnlzRGxjTVhidVRrbkd1TmRDcFFFVDhqdkNFQzM4anFaMndqQVpUa1NuOE5NNmRDVXJaTDVPMXZPRzhqSjlCOU4wSjVkY0luNHhlU0ZhY0FMaXLSAZIBQVVfeXFMUEZTcTZfd2dlNGVoX2oybWc0ZnpDZm00RERqTVFveHBLWVVoeXgxM1ZKVXVFV3NRMmxlQkdnYTBsTWxEeUZZdElsRGRGTGVEa2hQU1ZTQUhTOERkQzhOaVNBay1fTGtQUkkyUl9tSlk4SXJ6OHlGSk8wZXB0MzF6bUc2UmJJZGhNdC1IOS0tWnZQYkE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis: June 13, 2024 - Analytics Insight",
        "content": "The network allows enterprises, data centers, cloud providers, and cryptocurrency mining operators to contribute idle GPU resources to Aethir’s GPU-as-a-service solutions network.\n\nCo-founder Mark Rydon highlighted the significance of the mainnet launch, stressing that it would facilitate more innovation in AI, ML, and cloud gaming.\n\nWith the launch on mainnet, high-quality enterprises gained the opportunity to contribute to the Aethir network , thereby enhancing access to the existing supply of GPUs.\n\nEnterprises and developers could rent compute resources from Aethir's network of providers to support tasks such as training AI models and rendering digital content at scale."
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTE51c3Vsd2NDLUw1dEZQR19mb1g4ZVdOcTl5Y0VLM3A2VFhyYVJTQ1Raa2l2TjE4UDhHa09zSHAxVkFJOW1PTXI2QUJwalBsR2Z2LWNEOU5MT2NZR29KNTBwbk41b1VkWG0weE13N25GOWtSZlHSAXhBVV95cUxQUnhNTEVsYWxDTUpnLU1pemItRE55UjgwOEhuT0ZfVVROc2dNMWNiaXF6Ti1CME5RQmFNdWhvb0tHLS1wS040TGlkT3ZmSHFZbjhEaHJHLWpNUXVGb3pfNzZ3VmVtcDg2WTNXdkQyRHVmSm1aN1lFZFQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jun 2024 03:29:57 GMT",
        "title": "Ethereum Price Decline: Market Indicators Point to More Dips - NewsBTC",
        "content": "Ethereum price struggled to clear the $3,650 resistance. ETH started another decline and there is now a risk of more dips below the $3,420 support.\n\nEthereum started a fresh decline below the $3,550 support zone.\n\nThe price is trading below $3,540 and the 100-hourly Simple Moving Average.\n\nThere is a crucial bearish trend line forming with resistance near $3,550 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could extend losses if it stays below the $3,550 resistance zone.\n\nEthereum Price Struggle Continues\n\nEthereum price failed to start a recovery wave above the $3,550 and $3,580 resistance levels, like Bitcoin. ETH remained in a short-term bearish zone and extended losses below the $3,500 level.\n\nThe price declined below the $3,450 support level. A low was formed at $3,428 and the price is now consolidating losses. There was a minor increase above the 23.6% Fib retracement level of the recent decline from the $3,655 swing high to the $3,428 low.\n\nEthereum is still trading below $3,550 and the 100-hourly Simple Moving Average. There is also a crucial bearish trend line forming with resistance near $3,550 on the hourly chart of ETH/USD. If there is a fresh increase, the price might face resistance near the $3,540 level and the 50% Fib retracement level of the recent decline from the $3,655 swing high to the $3,428 low.\n\nThe first major resistance is near the $3,550 level and the trend line. An upside break above the $3,550 resistance might send the price higher. The next key resistance sits at $3,650, above which the price might gain traction and rise toward the $3,720 level.\n\nA clear move above the $3,720 level might send Ether toward the $3,800 resistance. Any more gains could send Ether toward the $3,880 resistance zone.\n\nMore Downsides In ETH?\n\nIf Ethereum fails to clear the $3,550 resistance, it could continue to move down. Initial support on the downside is near $3,420.\n\nA clear move below the $3,420 support might push the price toward $3,350. Any more losses might send the price toward the $3,250 level in the near term.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is losing momentum in the bearish zone.\n\nHourly RSI – The RSI for ETH/USD is now below the 50 zone.\n\nMajor Support Level – $3,420\n\nMajor Resistance Level – $3,550"
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxNZDVHWE4tc2N6R0Z0X0dheEpjLWFDYUd3Zmg4VDI2Um9uX29nQVZqeFl6dVdhRWhHVDJiT0hiWDNHUmI2M1FJRFJnV2NrZWFFYk5KQVVHTGQ5cHZMaG9CTWxzN0xkT0o1dll5dnE0dXYtSGlZVHZla055Y2tyQ0hvM1FnR1phUWlLcks4QU9n?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jun 2024 07:00:00 GMT",
        "title": "TON surpasses Ethereum in daily active users; What’s next for Web3 - Finbold - Finance in Bold",
        "content": "The Open Network (TON), originally developed as Telegram Open Network to enhance the popular messaging app, has outperformed Ethereum (ETH) in daily active addresses throughout June.\n\nDespite Telegram stepping back due to regulatory issues, an independent community has driven TON’s growth, leveraging Telegram’s 900 million users and integrated crypto wallet.\n\nDelphi Digital highlighted TON’s impressive growth in a recent post on X (formerly Twitter), noting that TON’s daily active addresses have surpassed Ethereum’s.\n\nThe Flippening CT ignores 🔍\n\n\n\nTON's quiet growth, fueled by Telegram's 900M user base, has driven its daily active addresses above Ethereum.\n\n\n\nAt its core, TON is a bet on Telegram's distribution. Though the ecosystem is nascent, its early growth is promising. But is it enough? pic.twitter.com/k2b2SMiQJD — Delphi Digital (@Delphi_Digital) June 10, 2024\n\nThey attributed this achievement to Telegram’s massive user base but questioned whether TON’s growth could be sustained long-term to permanently surpass Ethereum.\n\nTON and Ethereum compete in active addresses\n\nDaily active addresses (DAA) are defined by Artemis as the number of unique wallets engaging in transactions on a blockchain each day.\n\nDaily active addresses and daily transactions in Ton and Ethereum networks. Source: Artemis\n\n\n\nSince May 17, TON and Ethereum have been closely matched. However, TON gained an edge at the beginning of June, surpassing Ethereum on 10 out of the first 11 days.\n\nOn June 3, TON reached a record 568,300 DAAs, a level Ethereum hasn’t seen since September 13, 2023.\n\nDespite these impressive figures, Ethereum has been actively pushing transactions to layer 2 scaling solutions, which have attracted significant user activity.\n\nOn June 11 alone, three of Ethereum’s top layer 2 solutions—Arbitrum (ARB), Base, and Optimism (OP)—boasted a combined 1.3 million daily active addresses.\n\nFactors driving TON’s surge\n\nThe recent surge in activity on TON is driven by an ecosystem of mini-applications, including chatbots and games.\n\nNotcoin, a free game on Telegram with over 35 million users, launched its cryptocurrency NOT in May, reaching a market cap of $2.1 billion. Other popular games like Hamster Kombat and Catizen have nearly 33.6 million and 3.6 million users, respectively.\n\nTelegram also hosts TON-native trading bots like sTONks, which are expected to enhance the user experience for traders. Additionally, the introduction of Telegram Stars, an in-app currency for digital purchases, has further enhanced user interaction.\n\nThe future of TON and web3\n\nThe Total Value Locked (TVL) in TON has grown dramatically from $22.9 million to over $500 million since March, marking an impressive increase within just three months.\n\nBREAKING: $500M Total Value Locked (TVL) 🔥\n\n\n\nThe GDP of a small country is in use across #TON's apps. This incredible achievement is yours, TON Community!\n\n\n\nFrom $22.9M TVL in March 2024 to more than half a billion today – over 2,000% increase. 📈\n\n\n\nIt’s still only the beginning.… pic.twitter.com/bE3xqohACG — TON 💎 (@ton_blockchain) June 13, 2024\n\nThe number of active Toncoin wallets has surged from 1.28 million at the start of 2024 to over 8 million. This growth reflects the network’s expanding user base and the increasing adoption of Toncoin for various financial activities.\n\nIf you are starting on crypto, I will strongly recommend you to have a look at $TON / @ton_blockchain\n\n\n\nSuper early. Super quick. Easy to build.\n\n\n\nMoreover, run by @telegram .\n\n\n\nFew more weeks, you will see $TON over 10$ 🔮 pic.twitter.com/ONRBCFKsmc — Crypto King👑💎.eth.sol (@cryptosanthoshK) June 11, 2024\n\nCrypto influencer Crypto King recently recommended Toncoin to new investors, emphasizing its fast and user-friendly blockchain infrastructure. He noted the credibility of the development team, which also developed Telegram, suggesting that this could lead to a significant price spike for Toncoin, potentially reaching $10 in the near future.\n\nIn a technical analysis, crypto analyst Ali Martinez identified a potential 40% breakout for Toncoin, targeting an ambitious price point of $11.\n\nAt press time, Toncoin is trading at $8.03, reflecting a 6.63% increase over the past 24 hours.\n\nThe rise of TON reflects broader trends in the crypto ecosystem, where platforms that successfully integrate blockchain technology with existing user bases can achieve rapid growth.\n\nWhile Ethereum continues to be a major player with its layer 2 solutions, TON’s success illustrates the dynamic and competitive nature of the crypto market.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    }
]