[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxOZWVlLUJzYkE4cFpJMWxaZWJrLXlqMU40YnFmUDdYbGFqTXppN1BUeWFtOUctcWNSY3JZdlluUTJHbkZBQld3TER4SUFWSjhUWXAtTlNDb0MzendudlZCS1dHV0VtMzdJZGhhNlNJZktPYUhsVFRpbnJSbWhGZkp5cnRNSFpDdzdrV3BzRGJQVkN2a2xzOGNkOWp1OUw4enExRnV1dmIxSkFWaGFVOGJzMUZwZWRHajNx?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jul 2024 07:00:00 GMT",
        "title": "BlackRock’s iShares Ethereum Trust ETF Set to Launch - Business Wire",
        "content": "NEW YORK--(BUSINESS WIRE)--The registration statement for BlackRock’s iShares Ethereum Trust ETF (ETHA), has been declared effective by the U.S. Securities and Exchange Commission (SEC). ETHA seeks to track the price of Ethereum’s native token, ether, and is expected to begin trading on Nasdaq on July 23, 2024. ETHA carries a 0.25% sponsor fee with a one-year waiver reducing the fee to 0.12% on the first $2.5B assets under management (AUM)1.\n\n\" Our clients are increasingly interested in gaining exposure to digital assets through exchange-traded products (ETPs) which provide convenient access, liquidity and transparency,\" said Jay Jacobs, U.S. Head of Thematic and Active ETFs. “ Ethereum’s appeal lies in its decentralized nature and its potential to drive digital transformation in finance and other industries.”\n\nThe iShares Ethereum Trust ETF (ETHA) offers exposure to the Ethereum's native token, ether, the second largest cryptocurrency by market capitalization.2 Ethereum, a global technology platform, is similar to an app store that generates value for ether as usage increases and more applications are built on top of it.\n\nOver the last 12 months, iShares has launched 170 ETFs and ETPs including the iShares Bitcoin Trust (IBIT), driving innovation and providing investors with more choices to help them meet their investment goals.\n\nWith over 20 years of experience and more than 1,400 ETFs globally, iShares has helped millions of investors access different corners of the market. Every iShares product is underpinned by decades of investment expertise and institutional grade technology.\n\nTo learn more about the iShares Ethereum Trust ETF filing visit: https://www.sec.gov/Archives/edgar/data/2000638/000143774924023199/iset20240720_424b3.htm\n\nAbout BlackRock\n\nBlackRock’s purpose is to help more and more people experience financial well-being. As a fiduciary to investors and a leading provider of financial technology, we help millions of people build savings that serve them throughout their lives by making investing easier and more affordable. For additional information on BlackRock, please visit www.blackrock.com/corporate | Twitter: @blackrock | LinkedIn: www.linkedin.com/company/blackrock\n\nAbout iShares\n\niShares unlocks opportunity across markets to meet the evolving needs of investors. With more than twenty years of experience, a global line-up of 1400+ exchange traded funds (ETFs) and $3.86 trillion in assets under management as of June 30, 2024, iShares continues to drive progress for the financial industry. iShares funds are powered by the expert portfolio and risk management of BlackRock.\n\nImportant Information\n\nA registration statement has been filed for the iShares Ethereum Trust ETF (“the Trust”) and the registration statement has become effective. However, shares of the Trust are not yet available for purchase or sale. Carefully consider the Trust’s investment objectives, risk factors, and charges and expenses before investing. This information must be accompanied or preceded by a current iShares Ethereum Trust ETF prospectus and iShares Bitcoin Trust Prospectus. Please read the prospectuses carefully before investing.\n\nThe iShares Trusts are not investment companies registered under the Investment Company Act of 1940, and therefore are not subject to the same regulatory requirements as mutual funds or ETFs registered under the Investment Company Act of 1940. Investments in these products are speculative and involve a high degree of risk.\n\nInvesting involves a high degree of risk, including possible loss of principal. An investment in the Trust is not suitable for all investors, may be deemed speculative and is not intended as a complete investment program. An investment in Shares should be considered only by persons who can bear the risk of total loss associated with an investment in the Trust.\n\nInvesting in digital assets involves significant risks due to their extreme price volatility and the potential for loss, theft, or compromise of private keys. The value of the shares is closely tied to acceptance, industry developments, and governance changes, making them susceptible to market sentiment. Digital assets represent a new and rapidly evolving industry, and the value of the Shares depends on their acceptance. Changes in the governance of a digital asset network may not receive sufficient support from users and miners, which may negatively affect that digital asset network’s ability to grow and respond to challenges Investing in the Trust comes with risks that could impact the Trust's share value, including large-scale sales by major investors, security threats like breaches and hacking, negative sentiment among speculators, and competition from central bank digital currencies and financial initiatives using blockchain technology. A disruption of the internet or a digital asset network would affect the ability to transfer digital assets and, consequently, would impact their value. There can be no assurance that security procedures designed to protect the Trust’s assets will actually work as designed or prove to be successful in safeguarding the Trust’s assets against all possible sources of theft, loss or damage.\n\nThe Trust may incur certain extraordinary, non-recurring expenses that are not assumed by the Sponsor.\n\nThe iShares Ethereum Trust ETF (the “Trust”) is not sponsored, endorsed, issued, sold or promoted by Stiftung Ethereum (the \"Ethereum Foundation\"), nor does the Ethereum Foundation make any representation regarding the advisability of investing in the Trust. BlackRock is not affiliated with the Ethereum Foundation. Ethereum Marks are owned by the Ethereum Foundation, used under license.\n\nShares of the Trust are not deposits or other obligations of or guaranteed by BlackRock, Inc., and its affiliates, and are not insured by the Federal Deposit Insurance Corporation or any other governmental agency. The sponsor of the trust is iShares Delaware Trust Sponsor LLC (the “Sponsor”). BlackRock Investments, LLC (\"BRIL\"), assists in the promotion of the Trust. The Sponsor and BRIL are affiliates of BlackRock, Inc. The bitcoin and ether Custodian is Coinbase Custody Trust Company, LLC, which is not affiliated with BlackRock, Inc. The Sponsor is not responsible for losses incurred due to loss, theft, destruction, or compromise of the trust's bitcoin or ether.\n\n©2024 BlackRock, Inc. or its affiliates. All rights reserved. iSHARES and BLACKROCK are trademarks of BlackRock, Inc., or its affiliates. All other trademarks are the property of their respective owners.\n\n_________________\n\n1 BlackRock will waive a portion of the Sponsor’s Fee for the first 12 months commencing on July 23, 2024, so that the fee will be 0.12% of the net asset value of the Trust for the first $2.5 billion of the Trust’s assets. If the fund exceeds $2.5 billion of the Trust’s assets prior to the end of the 12-month period, the Sponsor’s Fee charged on assets over $2.5 billion will be 0.25%. All investors will incur the same Sponsor’s Fee which is the weighted average of those fee rates. After the 12-month waiver period is over, the Sponsor’s Fee will be 0.25%.\n\n2 Source: The Block, as of May 21, 2024. Ethereum’s market capitalization of $450 billion is measured by its native token, ether."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxOM09nOUNCWGpLbXJRWE9adURTQkFzZ2llWEtfWklibk9Ody0xVzNST1RraVFwVzdHdUp3bWxTYk9HU0V4RVp6MU4zM3IyZWQ5SWsyMk8yZEZJazlnWTYxcHpSZXdtcXlRaHBHVDFqQ2FOUXp6QUpNQlQzTkJiXzdLdHRYME1GcFgz0gGOAUFVX3lxTFA2Z3lGQnZPOGFOV0xTTWJMOE5YWXRBSU9YcHVGRXVfbk10WjN3S1U3X2N1ckNGNUVvamRKRDQzTGhYMzVMQkFVcy1GZC13NDltNDYzTldDNzJTYmJCV19ZQkw5V0Y3WEt5QWx4RGVqVXRnWnBwUHhjRWQzcjh0ejl3WnN0VHZ5U25BOFJ1M1E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jul 2024 07:00:00 GMT",
        "title": "Ether ETFs Make Their Bow, With Uncertainty Ahead - PaymentsJournal",
        "content": "Five spot ether exchange-traded funds (ETF) are slated to begin trading on the Chicago Board Options Exchange. They follow the nine bitcoin ETFs that began selling earlier this year as the only two cryptocurrency plays available to investors on the regular stock market.\n\nThe new ETFs include the 21Shares Core Ethereum ETF, Fidelity Ethereum Fund, Invesco Galaxy Ethereum ETF, VanEck Ethereum ETF, and Franklin Ethereum ETF. To jumpstart the introduction, virtually all of the ETH ETF issuers have announced plans to temporarily waive or discount their fees. The discounts run from 50% fee reductions to full waivers and will be in place anywhere from six months to a year.\n\nThe bitcoin ETFs have been highly successful, with more than $17 billion in net inflows since their introduction. The ether ETFs will face an uphill climb in replicating that success, with some industry experts expecting them to garner anywhere between 10% and 20% of the inflows garnered by the bitcoin ETFs.\n\nAs a less widely traded asset, ether is expected to endure more price volatility than bitcoin. As the world’s second-largest cryptocurrency, ether has a market cap of just over $400 billion, while bitcoin’s market cap is well over $1 trillion. Analysts looking at the ether ETFs are expecting significant price fluctuations after the introduction. For instance, data from research firm Deribit shows that the implied volatility of ether options rose from 56% to 70% in the past week.\n\nNot Mined but Staked\n\nOne key difference between the two cryptocurrencies is that bitcoin is mined, while Ethereum has switched to staking. In September 2022, Ethereum replaced its energy-intensive Proof-of-Work (PoW) mining mechanism with a Proof-of-Stake (PoS) mechanism rooted more in financial transactions. Technically speaking, Ethereum is the blockchain platform, while ether is the cryptocurrency derived from that platform.\n\nThis change transformed how new Ethereum is created, making traditional mining obsolete. Staking involves committing ether as collateral to validate transactions on the Ethereum network, which allows you to earn more ether.\n\nOne upshot of the ether ETFs is that they will almost certainly increase demand for the cryptocurrency, potentially leading to a severe supply shortage. The Ethereum Exchange Reserve, which tracks the amount of ether available on cryptocurrency exchanges, is already at multi-year lows."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNYzBsRlA0T0lMenBtLS1xUXJIcjlVbjFCWXY5N0xrRTRRQXlWRVhhOGMxYm9VLVNsTWJxOE1NQlFDN1VIaGNTNUJLSWlldV9vcVl6M2ltc2FTZkdFZHh2cVoyalRaLXV5eVZObjY4V1VQVFFob3dtNXFCRngxZWh1VXdISXZhVmlJSkE2ZQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jul 2024 07:00:00 GMT",
        "title": "Prediction: Ethereum Will Hit $5,000 by 2025 - The Motley Fool",
        "content": "There are two key catalysts that could propel Ethereum to a new all-time high next year.\n\nUp more than 50% through the first half of 2024, Ethereum (ETH -7.12%) now appears to be on track to regain its all-time high of $4,891 from the previous crypto bull market rally. Given Ethereum's current price of $3,400, that would imply a rally of more than 40% within a relatively short period of time.\n\nThat's certainly possible, given how well Ethereum has performed over the first half of the year. But a lot still needs to go right. Here's a closer look at two key factors that could propel Ethereum to the $5,000 mark by 2025.\n\n1. Continued growth of Ethereum's blockchain ecosystem\n\nFirst and most importantly, Ethereum needs to see continued growth in core segments of its sprawling blockchain ecosystem. One of the most important of these segments is known as decentralized finance (DeFi), which refers to traditional financial products and services reinvented with the help of blockchain technology. As such, DeFi offers the potential for faster, cheaper, and better solutions than those currently offered by traditional Wall Street providers.\n\nIn order to come up with a reasonable future price forecast for Ethereum, it is important first to come up with a ballpark figure for how much market value Ethereum can realistically create over the next few years. Cathie Wood of Ark Invest, for example, has crunched the numbers and determined that blockchain networks such as Ethereum could potentially generate $5 trillion in new market value by 2030.\n\nThat may sound like a huge, pie-in-the-sky number, but not when you take into account emerging trends such as asset tokenization, which refers to the process of transforming traditional financial instruments into digital assets that live on the blockchain. The faster that the process of asset tokenization takes place, the more valuable Ethereum becomes. According to consulting firm McKinsey, asset tokenization could be a $2 trillion market opportunity by 2030, and Ethereum stands to be a key beneficiary.\n\n2. Mainstream investor acceptance of Ethereum ETFs\n\nEven if you don't buy into the idea of blockchain-powered financial products transforming the modern financial system, there is one other path to Ethereum soaring to the $5,000 mark: the imminent launch of the new spot Ethereum ETFs, which are scheduled to begin trading this summer. In a bullish scenario, as much as $4.8 billion in new investor money could flow into these new ETFs, helping to boost the price of Ethereum.\n\nTo get a sense of how much of a boost these ETFs may provide, consider the example of the spot Bitcoin (BTC -4.33%) ETFs, which began trading in January. Over the ensuing six months, the price of Bitcoin soared from approximately $45,000 to $70,000, for a gain of nearly 55%. For the sake of argument, let's assume that the new Ethereum ETFs are not as successful as the Bitcoin ETFs, and the gains are not as significant. But even a rally of 40% would still be enough to propel Ethereum to the $5,000 mark by 2025.\n\nIs Ethereum a $2 trillion asset?\n\nIn fact, a price forecast of $5,000 may turn out to be conservative. For example, investment firm VanEck came up with a base-case price forecast of $22,000 for Ethereum for the year 2030. This assumes that Ethereum can continue to make inroads in areas such as DeFi and Web3, and that key blockchain metrics continue to see improvement over the next five years. At a price of $22,000 per coin, Ethereum would have an implied valuation of more than $2 trillion, making it more valuable than all but a handful of companies in the world.\n\nIf you are thinking about investing in Ethereum, keep in mind that crypto can be incredibly volatile and unpredictable. There's always the chance that Ethereum will no longer continue to see rapid gains after a remarkable first decade of growth. Tech issues could prevent it from scaling past a certain point, and the arrival of new competitors could blindside it.\n\nThat being said, if you think that we're on the cusp of a major bull market rally, Ethereum should definitely be on your radar as a cryptocurrency capable of soaring in value over the next several years."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE56SFhqS2dRaV80SXE1Sjhwem1hVW1EcTE3UTdoSFNnbmpaV2NsemlsaXhBcW5QdUZ6VTk3UEFhVzhvTnNYUjFKMGRaZXg1Q2s5M2JfaEMyVmNyRnNQNklIQ3VqckVlOW1WMlVONU1keHJtcW9KNXVxVTd4YWI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jul 2024 07:00:00 GMT",
        "title": "US Spot Ethereum ETFs Due to Start Trading - Markets Media",
        "content": "Daily Email Feature US Spot Ethereum ETFs Due to Start Trading\n\nThe US Securities and Exchange Commission has approved the start of trading of spot ethereum exchange-traded funds just six months after spot bitcoin EFTs launched in January this year.\n\nTom Duff Gordon, VP international policy at Coinbase, said in an email that the approval marks a significant milestone in the crypto ecosystem, emphasising the ongoing shift towards the global transition to digital assets. He added: “This development highlights that crypto is not merely a trend; it illustrates the transformative digital shift in the financial system. We’re proud to be the custodian for eight of the nine newly approved ETH ETFs, entrusted by many leading financial institutions as a reliable,safe, and secure partner.”\n\nHistory often happen gradually, then suddenly. Crypto is no exception. The approval of spot ETH ETFs today is yet another one of those moments. And it validates what we’ve been saying for years: ETH is not a security. https://t.co/1OGfaNr6ro — paulgrewal.eth (@iampaulgrewal) July 22, 2024\n\nThe SEC approved the launch of bitcoin EFTs in January this year when 10 new ETFs began trading and digital asset manager Grayscale Investments also converted its the Grayscale Bitcoin Trust into an ETF. In May this year the SEC also approved spot ethereum ETFs with market participants expecting trading to begin on 23 July 2024. Ether’s $420bn market cap was second only to bitcoin’s $1.3 trillion market cap as of 19 July 2024, according to data provider Morningstar.\n\nIssuers of ethereum ETFs have already listed bitcoin ETFs – Fidelity, iShares, Bitwise, VanEck, 21Shares, Invesco Galaxy, Franklin Templeton, and Grayscale added Morningstar. The data provider said in a report that WisdomTree and Valkyrie are the two spot bitcoin issuers missing from the spot ethereum list, while 21Shares is issuing its ethereum ETF alone, after joining forces with Ark Invest on its bitcoin ETF. Grayscale Investments will convert its Grayscale Ethereum Trust into an ETF, as it did with its bitcoin trust.\n\nRegardless of your feelings about ether or crypto, this kind of first class TradFi treatment (translating benefits into Boomer-ese and and delivering it in the most preferred inv vehicle on Planet (the ETF) is a major deal. These issuers have over $15T in collective aum. pic.twitter.com/uXR1AL1BxX — Eric Balchunas (@EricBalchunas) July 22, 2024\n\n1/ Hello, X! This is Jenny Johnson, CEO of Franklin Templeton, taking over the account. Our lawyers help keep me measured in my comments, but to say the least, I am THRILLED about $EZET, our second crypto ETF to launch in the market. 🧵 pic.twitter.com/SFyfyDj5Xj — Franklin Templeton (@FTI_US) July 23, 2024\n\n“If spot bitcoin ETFs are an indicator, expect iShares and Fidelity to quickly take over Grayscale as the top ethereum ETFs by assets and volume,” added Morningstar.\n\nBlackRock said in statement that the registration statement for BlackRock’s iShares Ethereum Trust ETF (ETHA), has been declared effective by the SEC and is expected to begin trading on Nasdaq on 23 July 2024. The ETF carries a 0.25% sponsor fee with a one-year waiver reducing the fee to 0.12% on the first $2.5bn assets under management. The asset manager described ethereum, a global technology platform, as similar to an app store that generates value for ether as usage increases and more applications are built on top of it.\n\nJay Jacobs, U.S. head of thematic and active ETFs at BlackRock, said in a statement: “Our clients are increasingly interested in gaining exposure to digital assets through exchange-traded products which provide convenient access, liquidity and transparency. Ethereum’s appeal lies in its decentralized nature and its potential to drive digital transformation in finance and other industries.”\n\nAnnouncement: Today, the Bitwise Ethereum ETF (ETHW) became the first U.S. ETP to publish its Ethereum addresses and set ENS subnames for each address. 1.ethw.bitwise.eth -> 0xa15c…2A69\n\n2.ethw.bitwise.eth -> 0xEd92…b4eF\n\n3.ethw.bitwise.eth -> 0x3339…7cB5\n\n4.ethw.bitwise.eth… pic.twitter.com/SdOGiXkyqP — Bitwise (@BitwiseInvest) July 23, 2024\n\nMany of the largest tradfi asset managers in the world are launching crypto ETPs. It's one of the best things that has happened to the space. They bring a huge endorsement to the validity of this asset class to mainstream investors who were unsure, and they have incredible… https://t.co/vO61qd63mF — Hunter Horsley (@HHorsley) July 22, 2024\n\nOn the eve of the launch of the first spot Ethereum ETFs, a look at the current state of play in #bitcoin ETFs. Most striking (but least surprising) to me is just how much these have traded. Since they listed, this group's turnover (total value traded/avg. daily assets) has… pic.twitter.com/hQ8KKzIBZO — Ben Johnson, CFA (@MstarBenJohnson) July 22, 2024\n\n💥BREAKING💥 BlackRock’s #Bitcoin ETF has surpassed the Nasdaq ETF $QQQ in flows this year Most successful ETF launch ever! pic.twitter.com/C4zY9Ps5cB — Quinten | 048.eth (@QuintenFrancois) July 22, 2024\n\nMorningstar added that SEC only approved ether ETF filings after staking was disallowed, and the average annual reward for ether staking is roughly 2%-4%. As a result, unlike bitcoin, holding ether directly could hold a meaningful performance edge over spot ether ETFs for investors willing to engage in staking.\n\nCrypto ETFs and ETPs listed globally gathered net inflows of $44.5bn through to the end of May this year according to ETFGI, the independent research and consultancy firm. ETFGI said in a report that this is a contrast to the $135.6m of net outflows at the same time last year.\n\nSubstantial inflows can be attributed to the top 20 ETFs/ETPs by net new assets, which collectively gathered $3.1bn during May according to ETFGI. BlackRock’s iShares Bitcoin Trust (IBIT US) had the largest individual net inflow of $1.2bn in May.\n\nBlockworks Research said in a report that the majority of the eight issuers filing for the ether ETF have set fees between 0.19% and 0.25%, with the exception of Grayscale. The Grayscale Ethereum Trust ETF will maintain a fee of 2.5%, and the mini trust will offer a 0% fee for the first six months of trading, up to $2bn in assets under management. Then the mini trust will then charge 0.15%, undercutting all the competitors’ currently advertised rates.\n\n“Interestingly, the mini trust will be seeded with 10% of trust’s current AUM, and investors will receive a proportional distribution of the mini product at creation,” added Blockworks. “Grayscale is likely moving some of its client’s capital into this lower fee product in an attempt to dampen the exodus of funds that was observed with bitcoin trust’s conversion to an ETF. As trading begins, we’ll get our first glimpse into how well this strategy may work for them.”\n\nLaw firm Foley & Lardner said in a blog that the ether ETF approval is a significant milestone for increased institutional and retail investments in crypto ETFs.\n\n“The approval of these applications occurred without much resistance, which is a notable departure from the contentious process that preceded the approval of bitcoin ETFs,” added the law firm.\n\nThe SEC was forced to approve bitcoin ETFs after losing a lawsuit against Grayscale Investments, which had challenged their previous rejections. However, the SEC approved ethereum ETFs without a lawsuit.\n\n“While this maneuver might have been to avoid more litigation and public scrutiny, the approval shows a steady departure from “regulation by enforcement” and a movement toward actions that promote growth in the cryptocurrency industry and investor freedom,” added the law firm.\n\nFoley & Lardner highlighted that the SEC noted the high correlation between spot ether prices and the CME’s futures market. Morningstar also added that the SEC is unlikely to approve another spot cryptocurrency ETF without them first having a regulated market, which has so far been the CME futures market.\n\n“The CME doesn’t currently list any other cryptocurrency futures,” said Morningstar. “It stands to reason that ETF approval is distant for cryptocurrencies other than bitcoin and ethereum.”\n\nInstitutional interest\n\nFoley & Lardner said: “In the coming years, it is very possible we will view the SEC’s decision to approve ether ETFs as an important step in what became a trend of integrating cryptocurrency assets into traditional finance networks through ETFs and other financial instruments.”\n\nCrypto ECN Finery Markets said in its second quarter over-the-counter (OTC) review that the recent approval of crypto-related vehicles has sparked institutional interest in adopting crypto for the long term, demonstrated by the increase in crypto OTC flows. In the first half of this year, the OTC institutional crypto market’s total spot transaction volume rose 95% from the first six months of last year.\n\n“The approval of ETH ETFs may further drive institutional participation in the market,” added Finery Markets “However, we believe that the full impact of ETF approvals on the market may not be fully realized until six to nine months later, as it typically takes this amount of time for innovative products to be fully integrated into financial players’ product portfolios and widely adopted.”\n\nFinery Markets noted that the recent launch of a bitcoin ETF in Australia, and similar launches in the US and Hong Kong, reflect global interest in crypto investment vehicles. In addition, issuer VanEck’s recent application for a Solana ETF highlights this growing trend.\n\nWe at @vaneck_us are pleased to announce that @CBOE just filed our 19b-4 to list and trade shares of the FIRST Solana exchange-traded fund in the US! We look forward to engaging with the SEC during the review period. — matthew sigel, recovering CFA (@matthew_sigel) July 8, 2024\n\n“These developments signify a changing regulatory environment that is becoming more favorable towards digital assets,” added Finery. “This shift is important as it provides traditional financial institutions with a clear path to enter the crypto space using established financial instruments, taking advantage of current market conditions.”\n\nFuture trends\n\nNate Geraci, president of The ETF Store, said:\n\nPrediction… An ETF issuer will file for combined spot btc, eth, & sol ETF in next few months. We’re quickly heading down path towards index-based & actively managed crypto ETFs. — Nate Geraci (@NateGeraci) July 22, 2024\n\nBrett Harrison, founder and chief executive of Architect Financial Technologies, said:\n\nNow that spot ETH ETFs are set to begin trading next week, a question remains — what is holding the SEC back from approving spot BTC ETF options? Options on BTC future ETFs were available within days of their underlying ETFs’ listings, but to list options on spot commodity ETFs… — Brett Harrison (@BrettHarrison88) July 17, 2024\n\nIn May this year the New York Stock Exchange said in a statement it is collaborating with CoinDesk Indices to launch cash-settled index options tracking the CoinDesk Bitcoin Price Index, which has been operating since 2014.\n\nThe XBX index benchmarks $20bn in ETF assets under management, and tracks the spot price of bitcoin, denominated in U.S. dollars, in real time across multiple crypto exchanges. It is calculated and published once per second, 24 hours per day, 365 days each year.\n\nAndy Baehr, head of product, CoinDesk Indices, said in a statement at the time: “Collaborating with the NYSE to launch XBX index options opens a new chapter in digital assets, placing important and familiar risk-management tools in the hands of U.S. and global investors.”\n\nIn July this year Eurex said it is expanding its crypto derivatives portfolio with the launch of FTSE Ethereum index futures and options as of 12 August 2024. The derivatives arm of Deutsche Börse Group launched FTSE Bitcoin Index futures and options in 2023 and more than 100,000 contracts, equivalent to over $3.5bn in notional, have been traded.\n\nFTSE Russell developed the index with Digital Asset Research. The index captures data from vetted assets and exchanges to meet EU Benchmarks. The final settlement rate of the Eurex contracts is determined as the volume time-weighted average of the FTSE DAR Digital Asset Price over a 15 minute period prior to the fixing time."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxPVFdXQXpvSm40QUFlSTdjRGFka1VnS2NLQUJEcVJ5aUVDRldsUXN4R3hEVi1HSDNkMkcxVm1yVzBjdEI3ZHpNaWs3VC1ud3ZiWVFDU01IRGZET2MyQVRvR29vNV9UWDMtNG53RDBVRXhXazh4UUx2d19kWjRWZTU0SUNQONIBiAFBVV95cUxNU3VwVGF6dE80Sl9oYVBaU2lLU2pqM1lxSUQwbkVSbDZ6bENJV3ZrZldDXzZuYkdKSWExUjRIVmRXbzdyd3Vrb2lvcHRPR1ZpdXRaY1JhWGQyYnItTmhGcGE5N3JSamNxejNneVljdkUzUlZlVkRUd3djUk9JQW1XSmR1RU5HVEhF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Turns 10: A Decade of Blockchain Revolution - CryptoPotato",
        "content": "Over the past ten years, Ethereum has transformed the blockchain landscape.\n\nFrom its initial coin offering to becoming the second-largest crypto by market cap, Ethereum has continuously evolved, implementing major upgrades like the shift to Proof-of-Stake (PoS) and Layer 2 scaling solutions and cementing its position as a cornerstone of the Web3 ecosystem despite the emergence of several alternatives over the years.\n\nEthereum’s 10-Year Journey\n\nReflecting on its origins, Ethereum Foundation researcher Justin Drake pointed out that Ethereum’s initial coin offering (ICO) began on July 22, 2014, with the price being 2,000 ETH per sale unit per BTC in a fully permissionless environment devoid of venture capital influence or vesting periods.\n\nThis rate only applied for the first 14 days. After that, the price began to decrease gradually, with each subsequent day offering fewer ETH per unit. By the end of the sale period on September 2, 2014, the rate had dropped to 1337.077 ETH per unit.\n\nFast forward to today, and the value dynamic has shifted dramatically. Now, 1 BTC buys less than 20 ETH. Drake pointed out that few assets have matched Bitcoin’s performance over the past decade, and even fewer have surpassed it by a factor of 100.\n\nEthereum has evolved into a crucial component of the blockchain ecosystem. So far, 4.3 million ETH has been burned for gas fees since the introduction of EIP-1559, and many more are expected to be burned with the introduction of blob transactions.\n\nAdditionally, Ethereum’s staking mechanism now provides $100 billion in economic security, ten times more than Bitcoin, and supports DeFi and restaking, vastly improving the Internet of Value’s economic bandwidth.\n\nEthereum’s Institutional Journey Begins\n\nAll eyes are on the spot Ether ETF, which, according to Drake, further signified Ethereum’s growing recognition as a digital commodity, marking the beginning of the crypto asset’s institutional journey.\n\nThe Chicago Board Options Exchange (CBOE) will debut five spot Ethereum exchange-traded funds (ETFs) on July 23, pending final regulatory approval, as announced by the agency last week. This follows the US Securities and Exchange Commission’s (SEC) approval on May 23, which greenlighted the listing of several spot Ether ETFs.\n\nThe five Ethereum ETFs scheduled for launch are the 21Shares Core Ethereum ETF, Fidelity Ethereum Fund, Invesco Galaxy Ethereum ETF, VanEck Ethereum ETF, and Franklin Ethereum ETF.\n\nTo attract investors and secure a market position, most of the ETH ETF issuers are planning to offer temporary fee reductions or waivers as the funds start trading."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxPY1VyQUhUVGZ5LXpJQ1R3cUdONnZmRDhaVnVYOTlnc3BrZC1Sd1V4NTJrOGU2WVBUb1MtQzNuZEF1TF90TjZfUzdSRXEzOTZEbEJHRENaZUEzM01CRHI2REcxVF9DUUlITGZkdzlhMUI3X0ZJUzFwV3AxTjhWZTdIUXBobjdKaFh2UEVPcVN5ekMxbTdpN3BDMFI4R2ZqUDJzcnAwa1JYQ1o3UdIBsgFBVV95cUxOSE9uQTBweHRFZU9zMXRSQTN3cDFHUXVYQUpDcnA2Q2RTZXdCTzhsTmFzRkdtZmNzQ3lCbjFLNVFUYTlPWkV2RHRhbkxrX2pTRnFFMXB0aWRrR2tMZ3hKNFhHMW5wRGNoOE5uZTg4RWpMeVBWQ19heFZpcnFhUWdQNTRhczN0T1NfMnU2UHNjX0FDd01NNmpTNTFYUlI4Zm1yYV9XQy1kV0NiVXF3OUpMMlJB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jul 2024 07:00:00 GMT",
        "title": "Grayscale Shifts $1 Billion in Ethereum to Coinbase Ahead of US ETF Trading Debut - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nCrypto asset manager Grayscale has transferred a hefty sum of Ethereum to Coinbase Prime as exchange-traded funds (ETFs) associated with the asset gear up for a trading debut in the U.S. this week.\n\nGrayscale's transaction of $1.01 billion to Coinbase Prime on Wednesday prompted market participants to suggest Grayscale might be preparing for a sell-off to reinvest in another crypto, such as Solana.\n\nJon Campagna, managing partner at crypto hedge fund Nexyst Digital and formerly associated with Coinfund and Blackrock, dismissed these claims in a Tuesday post on X, saying Grayscale is unlikely to reallocate its Ethereum holdings.\n\nIt comes as Grayscale tipped 10% of its Grayscale Ethereum Trust (ETHE) holdings into its separate Ethereum ETF (ETH) on July 18, Campagna explained.\n\nAD\n\nAD\n\nThe new fund is expected to become active on Wednesday, with ETHE holders receiving their proportional ETF positions.\n\nTo facilitate the move, the asset manager transferred $1 billion, or 10% of their $10 billion AUM in ETHE, to Coinbase Prime, as announced a week earlier by Grayscale, Campagna wrote.\n\n\"What will be interesting is to see the outflows from ETHE as they refuse to lower their ... fee,\" Campagna said. \"My guess is those outflows get recycled into inflows into the lower-cost ETFs, like Grayscale's own 15 basis point fee ETH ticker. Brilliant move by them as they quasi-guarantee more assets stay in-house this way.\"\n\n\"Grayscale is not lowering at all,\" Eric Balchunas, an ETF analyst at Bloomberg, wrote in a post to X on July 18. \"This means they are ten times higher than competition.\" Grayscale is expected to maintain a 2.5% fee on ETHE.\n\nAD\n\nAD\n\nWhile algorithmic trading firm Wintermute has indicated that the demand for Ethereum ETFs might be lower than expected, analysts remain optimistic about their debut on Wednesday.\n\nMatt Hougan, chief investment officer at Bitwise Asset Management, has said Ethereum could reach as high as $5,000, Decrypt previously reported.\n\nEthereum has already begun to move higher, surpassing $3,500 on July 17 after a significant drop earlier in the month.\n\nGrayscale is among several major investment firms, including BlackRock, Fidelity, and Franklin Templeton, preparing to launch Ether ETFs.\n\nDemand for the funds is projected to be between $3.2 billion and $4 billion.\n\nEdited by Sebastian Sinclair"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxNcEJCZWJ5bjJyQWwxSlM5djhYQW9Gdm1wWHRyNzZETHhRd1hnTzRkbnlodGxtZHZtMDNUcjNMcmV2dWtMcmN3NHFsT3IyQkdvQXpHeGk0azZvRTlMS2kwZ2JhemNwLUhhYmlqcm43OTBKS1hvY2w4UFVKdkdIWXR2TVl3LWZralVZbWlF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jul 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum Hold Steady, Dogecoin Spikes As Biden Bows Out Of Presidential Race: King Crypto Might Have A Chance To Reclaim $71.5K, Forecasts Analyst - Yahoo Finance",
        "content": "Bitcoin, Ethereum Hold Steady, Dogecoin Spikes As Biden Bows Out Of Presidential Race: King Crypto Might Have A Chance To Reclaim $71.5K, Forecasts Analyst\n\nBitcoin and Ethereum consolidated, while Dogecoin rose as President Joe Biden announced his withdrawal from the 2024 presidential race.\n\n\n\n\n\nCryptocurrency Gains +/- Price (Recorded 9:15 p.m. EDT) Bitcoin (CRYPTO: BTC) +1.52% $68,136.71 Ethereum (CRYPTO: ETH)\n\n+0.83% $3,540.81 Dogecoin (CRYPTO: DOGE) +5.50% $0.1397\n\nWhat Happened: The world's largest cryptocurrency, Bitcoin, traded flat until the news of Biden dropping out of the contest broke, injecting positive volatility in the market. King Crypto recorded a weekly close above $68,000 and is up more than 10% over the week.\n\nEthereum moved in the $3,500 zone, anticipating bullish impetus as it awaits the final approval of exchange-traded funds tracking its spot price. The investment products are likely to go live this week.\n\nIn the last 24 hours, 56,837 traders were liquidated, with the total liquidations at $165.54 million, More than $100 million in bullish bets were liquidated.\n\nDon’t Miss:\n\nBitcoin's Open Interest rose 1.08% to $37.21 billion in the last 24 hours, complementing the price increase. This is typically indicative of a bullish sentiment.\n\nThe Cryptocurrency Fear & Greed Index flashed \"Greed\" at the time of writing, signaling significant buying sentiment in the market.\n\nTop Gainers (24-Hours)\n\n\n\n\n\nCryptocurrency Gains +/- Price (Recorded at 9:15 p.m. EDT) Celestia (TIA) +16.30% $7.55 Core (CORE) +15.12% $1.65 Avalanche (AVAX) +12.27% $32.54\n\nThe global cryptocurrency market stands at $2.48 trillion, up 1.65% in the last 24 hours.\n\nStock futures edged higher Sunday night. The Dow Jones Industrial Average Futures gained 0.12%, as of 9:15 p.m. EDT. Futures linked to the S&P 500 added 0.22%, while Nasdaq 100 Futures rose 0.36%.\n\nTraders monitored political developments in the wake of Biden dropping out of the 2024 presidential race. It will be interesting to see how the market opens this week in response to this significant development.\n\nLast week, major indices like the S&P 500 and the Nasdaq Composite registered their biggest weekly losses since April.\n\nSee Also: Commercial real estate has historically outperformed the stock market, and this platform allows individuals to invest in commercial real estate with as little as $5,000 offering a 12% target yield.\n\nAnalyst Notes: Popular cryptocurrency trader CrypNuevo anticipated significant volatility in the Bitcoin market after Joe Biden's announcement.\n\nStory continues\n\n\"Expecting a volatile price action instead; therefore, I think it’s likely to see a move down first. Then we can go up to liquidity at $68,900,\" the trader predicted.\n\n\n\n\n\n$BTC Sunday update:\n\n\n\nIt was going to be a quiet week ahead, but Biden just announced that he is not running for re-election.\n\n\n\nExpecting a volatile price action instead; therefore, I think it's likely to see a move down first. Then we can go up to the liquidity at $68.9k.\n\n\n\n🧵👇 pic.twitter.com/3XfaZITYWL — CrypNuevo 🔨 (@CrypNuevo) July 21, 2024\n\nWidely-followed analyst Rekt Capital stated that a weekly close above $65,000 could bolster Bitcoin's chances of reclaiming $71,500 in the following week.\n\nWith the apex cryptocurrency closing near $68,000, it’ll be intriguing to see if the predictions come true.\n\n\n\n\n\n#BTC\n\n\n\nEvery time Bitcoin Weekly Closed above ~$65000 (blue) in an uptrend...\n\n\n\nBitcoin would revisit ~$71500 in the following week\n\n\n\nCould history repeat itself?\n\n\n\nWe know it often does\n\n\n\nWhat about this time?$BTC #Crypto #Bitcoin pic.twitter.com/KosyX2ezIh — Rekt Capital (@rektcapital) July 21, 2024\n\nRead Next:\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nGet the latest stock analysis from Benzinga?\n\nThis article Bitcoin, Ethereum Hold Steady, Dogecoin Spikes As Biden Bows Out Of Presidential Race: King Crypto Might Have A Chance To Reclaim $71.5K, Forecasts Analyst originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxORlRBZi0tSHI5YTlBYXd5bUpGZ0FzN21iRFFxSUJxWVc4NnBFMVI1MnVCSFFTbGpFVXNDRTZxc3hfQU9iWk14c3BFMDNJMlU5a0NHMWJVOFZCbE1QTzdieFJrblBGdVpmX1hHVVdmdG5zMFlsbVRpdHB4U2dzNzJ6N0Z3bnpxdVNKLUhLQXdnQjhtZEY1SkNkam1lWnphSnB2T0ZMc0VLTDhHWTNTTE9vdko2eXJWNWNBR0djcFdxR21nN1RlUExsVkI0UkhuaEM0aElCM1ZDemTSAd4BQVVfeXFMTXVsRWVVa0EyTjBtcEd1R0M4YWlzSjg2b1hJQk8zd3BuTlFCVGFzSVdYcUlRejNfdzNIQ2E2MGFTSmxkVmlCQmxBQmVyZFRyVG1EdGpxNHgxNjJhZXRUdFE0TUp5V2Z0NWYtVGoydnBOWXJlZzhLbGs2V1JWTUkzV2wzMzdKR1BjTkFTQ3dXUnA1aUMtTmkxc09oY29uenBQYm5uT285ellkbWpHWjVMNlVaU0o5TzNIaDFObTBQOHdPMF9ISEJqc3dXU0R4WGRka1BaNjc0SVFQMWIyTkN3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Overtakes Solana With Most Altcoin Inflows Year-to-Date As Positive Sentiment Continues: CoinShares - The Daily Hodl",
        "content": "Digital assets manager CoinShares says that institutional crypto investors are going in heavy on the leading altcoin Ethereum (ETH).\n\nIn its latest Digital Asset Fund Flows report, CoinShares says crypto investment products enjoyed $1.35 billion in inflows last week.\n\n“Digital asset investment products saw further buying with inflows of US$1.35bn last week, bringing the last 3 week run of inflows to US$3.2bn. ETP (exchange-traded product) trading volumes also increased substantially, up 45% week-on-week to US$12.9bn, but representing a lower than usual 22% of the broader crypto market volumes.”\n\nRegionally, the United States and Switzerland saw inflows of $1.3 million and $66 million, respectively.\n\nMinor outflows were experienced in Brazil and Hong Kong to the tune of less than $7.5 million in total.\n\nBitcoin (BTC), per usual, enjoyed the lion’s share of inflows at $1.27 billion.\n\nHowever, the biggest story of last week’s inflows was Ethereum, according to CoinShares.\n\n“The outlook for Ethereum seems to have turned a corner, seeing a further US$45m of inflows last week, overtaking Solana for the altcoin with the most inflows year-to-date (YTD) at US$103m.”\n\nSolana (SOL) enjoyed $9.6 million in inflows. Multi-asset crypto investment vehicles enjoyed $16.7 million in inflows. Litecoin (LTC), Chainlink (LINK), XRP and Cardano (ADA) also brought in inflows of $2.2 million, $0.7 million, $0.5 million and $0.4 million, respectively.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxNMC15d28wTmVPdzFkODhCckx5Nk40TkhIR1NqbG1Cb2xOa2tNZUFnZi1iajVvMUpsVWVHWFhWazNTZ1lzMTltLWt2ckpLOWRVa2t1OE5tTkt6VGNRbkxOYW1wZ0JISkdHdHIzMzdKaU9XYVFYR2JWN2liOFA3bjJnamFyM3U3Z2NCWWM0NS1UR3FxcTB5ODBsRHFtQjRRQl800gGmAUFVX3lxTFBqWTFGREhraHd0V1BlQU11TlNadmZWakp5bFZPekJsNlhKWHVtZ2VGb180QVV4N3dRTVNZdV95U2tfR2hjb1M3TFJmVmhJRFhHM3ZnQXFEZjJHUzltd3ZGSVQ1VUEzNV9mUWVJZVRrUVdRRjlTUWlfODFRUFRublZMOVNFRkV2T0thX2dYbVZTZGlrcU1TM0lKTG1BYU94d1ZKTjhJMlE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jul 2024 07:00:00 GMT",
        "title": "Cboe Unveils the Official Launch Date for Five Spot Ethereum ETFs - The Daily Hodl",
        "content": "The Chicago Board Options Exchange (Cboe) is giving the launch date for five spot market Ethereum (ETH) exchange-traded funds (ETFs).\n\nCboe’s new listings page shows that Ethereum ETFs from issuers 21Shares, Fidelity, Franklin Templeton, Invesco and VanEck are scheduled to roll out on Tuesday, July 23rd.\n\nLast week, Bloomberg senior ETF analyst Eric Balchunas said Ethereum ETFs are likely to begin trading on Tuesday after the U.S. Securities and Exchange Commission (SEC) asked issuers to make final changes to their form S-1 registration statement.\n\nCrypto market participants have been anticipating the rollout of Ethereum ETFs since May when the SEC abruptly shifted its stance on the investment products.\n\nAnalytics firm IntoTheBlock says that deep-pocketed crypto investors are rushing to load up on Ethereum in anticipation of the ETF launch.\n\n“$126 million worth of ETH was withdrawn from exchanges [last] week, signaling accumulation ahead of the ETF launch.”\n\nWhile whales appear to be bullish on ETH, crypto analyst Kaleo thinks the ETF launch will lead to a brief price spike before Ethereum witnesses a correction. According to Kaleo, the ETF launch will turn out to be a sell-the-news event.\n\nBut after the pullback, the trader predicts that ETH will soar above $4,550.\n\n“If you’re really bullish on this cycle, one more sweep of the lows would be an absolute gift. We’re heading way higher from here – just think we might need a bit more patience before the fun really starts.”\n\nAt time of writing, Ethereum is worth $3,521, a slight increase on the day.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiYEFVX3lxTE11TTRTekxsZHJpQ0xfRDlwc1lobzlMbmQ0WDgyUDBMWGV4XzVCa0xxOFJ2ZTR1VElsLXFzZzJjdW83TjJxX05FSFd2OF9sUWp6XzVzbTJnbTA5bm9NSk02dtIBZkFVX3lxTE05ZHdkNW5hZm5RY3U1bmJZaGNDYkJCbE9WcGRjTklmRk84SHJzeTQtMWVhSXNCdkQ3eG01WTRvVkJVdUhXYWpwcWFab1B2TXBTNDVWN1JKT0xGX0VRREJ5bkVobDkwZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jul 2024 07:00:00 GMT",
        "title": "What is Optimism (OP): Guide to One of Ethereum’s Layer-Two Scaling Solutions - CryptoPotato",
        "content": "The cryptocurrency industry, in general, has become much more popular in the past couple of years. This saw the development and launch of hundreds if not thousands, of decentralized applications (dApps) in various fields, such as DeFi, gaming, learning, trading, investing, and so on.\n\nThere are many reasons for this, including but not limited to the massive bull run in 2021, the rise of non-fungible tokens, the popularity of memecoins, and more. This saw hundreds of thousands of users flocking to whatever the next trend may be.\n\nUnlike previous cycles, however, this time, we also saw regular users take advantage of on-chain availabilities and interact with various dApps such as Uniswap, OpenSea, and so forth. And while this had a massively beneficial effect on the industry’s growth and valuation, it also highlighted some very critical issues.\n\nBlockchains like Ethereum—where the lion’s share of dApp activity takes place—struggled in terms of affordability, scalability, and even accessibility. Layer one alternatives like Solana also proved insufficiently effective in handling the massive load of user requests.\n\nThis brought up a topic that’s been largely discussed in the cryptocurrency community for years—scalability. Now that scaling solutions have become essentially imperative for the industry’s future growth, projects like Optimism have seen the light of day.\n\nOne of the most popular Ethereum scaling solutions, Optimism aims to solve some of the network’s underlying issues, with a particular focus on scaling.\n\nQuick Facts About Optimism\n\nOptimism’s mainnet went live on December 2021\n\nOptimism launched its native token (OP) on May 31st, 2022.\n\nA total of 231,000 addresses were eligible to claim 214 million OP tokens.\n\nQuick Navigation\n\nWhat is Optimism?\n\nOptimism is an Ethereum scaling solution. In essence, its purpose is to help the main network run smoothly by taking some of its transactional load. In technical terms, Optimism is an “Optimistic rollup,” and it’s important to understand what rollups do before diving deeper.\n\nWhat is a Rollup?\n\nRollups are one of the multiple scaling solutions intended to help Ethereum achieve a higher transaction throughput.\n\nThe Ethereum Foundation explains that they “perform transaction execution outside layer 1, and then the data is posted to layer 1 where consensus is reached.”\n\nThe main benefit of this is that it reduces the load on the main network while also guaranteeing the broadcasted information by its native security.\n\nThere are two main types of rollups, mainly differentiated by their security models:\n\nZero-Knowledge (ZK) Rollups – these run the computation off-chain and then submit proof of validity to the chain.\n\n– these run the computation off-chain and then submit proof of validity to the chain. Optimistic rollups – these assume that transactions are valid by default and only run computation through fraud-proof if there’s a challenge.\n\nOptimism falls within the second category, and, as you may have probably guessed already, its parent chain is Ethereum.\n\nHow Does Optimism Work?\n\nThe big idea that makes Optimism interesting to most is the Optimistic Rollup. The following is a brief explanation of the concept’s fundamental principles.\n\nHowever, the TLDR is that an Optimistic Rollup is another way of calling a blockchain designed to take advantage of the security of another network that acts as a parent one.\n\nBlock Storage\n\nAll of the blocks on Optimism are stored within a specific smart contract that’s built on Ethereum and is called CannonicalTransactionChain – CTC to make it easier. They are helped within a list that’s inside of the CTC, and it’s append-only.\n\nThe CTC contains code that guarantees that the current list of blocks can’t be altered by newer transactions on Ethereum. However, this guarantee can be broken if the Ethereum network itself undergoes a reorganization (reorg) and the order is changed.\n\nBlock Production\n\nThe ‘sequencer’ is the single party that manages block production on Optimism. It helps with the network by delivering the following:\n\nInstant transaction confirmations and state updates;\n\nConstructing and executing layer-two blocks;\n\nSubmitting user transactions to layer one.\n\nIt has no mempool, which means that the transactions are accepted (or rejected) immediately. This happens in the order they are received. When someone sends a transaction, the sequencer will check if it’s valid (pays a sufficient fee) and apply it to the local state as a block that’s pending. These pending blocks are then batched and periodically submitted to Ethereum’s network for finalization.\n\nThe main goal of this batching is to reduce the overall transaction fees by spreading certain fixed costs over all of the transactions within a single batch. Of course, this fee may vary depending on the network load at the time when the transactions were sent to the sequencer.\n\nBlock Execution\n\nIt’s important to understand that Ethereum nodes download blocks from Ethereum’s network that’s peer-to-peer. Optimism nodes, on the other hand, download blocks directly from the CTC append-only contract.\n\nTwo primary components make up Optimism nodes: the Ethereum Data Indexer and the Optimism Client Software.\n\nEthereum Data Indexer\n\nIt’s designed to reconstruct the optimism blockchain from blocks that are published to the CTC contract. It’s also called the data transport layer.\n\nOptimism Client Software\n\nThis one closely resembles Geth, which means that Optimism, overall, is very similar in its design to Ethereum. This is also because Optimism shares the same Ethereum Virtual Machine (EVM), account and state structure, gas metering mechanism, and fee schedule.\n\nFault Proofs\n\nUsing an Optimistic Rollup means that state commitments are published to Ethereum’s network directly without requesting proof of their validity. Fault proofs are requested when a state commitment is challenged. If it’s challenged successfully, it is removed and eventually replaced by another one.\n\nThis documents provide a more in-depth and technical explanation of the terms and overall process described above.\n\nHow to Bridge Assets Between Layers\n\nWith layer-two scaling solutions such as Optimism, being able to swap assets between different layers is obviously of paramount importance.\n\nThere are multiple ways to do it. First and foremost, you can hop on the official website and use the bridge provided there. This would only require you to have a Web3 wallet such as MetaMask.\n\nFrom there, you have to select the network from which you want to bridge tokens. This is the supported list:\n\nThere are also options to bridge from centralized exchanges, but it’s critical to note that these happen through providers that Optimism has simply linked to—meaning there’s no endorsement. You should proceed with caution and after conducting thorough due diligence.\n\nFrom there, the process is particularly simple, as all you need to do is confirm the amount and sign the transaction in your wallet.\n\nThere are a couple of options for bridging assets from optimism. You can use a third-party bridge or the official bridge instead. The following is an example of the latter, but keep in mind that bridging from Optimism to Ethereum takes seven days.\n\nAll you need to do is click the arrow in between the value boxes, and this will switch the above transaction. If you haven’t added Optimism to MetaMask, this will also handle it for you. From there, you only have to confirm the amount and sign the transaction:\n\nGovernance: Optimism’s Model\n\nThe native cryptocurrency of the Optimism ecosystem is the OP token.\n\nOptimism is governed by the so-called Optimism Collective. According to the official website, the collective is:\n\n“… a band of companies, communities, and citizens working together to reward public goods and build a sustainable future for Ethereum.”\n\nThat said, the governance of the Optimism Collective itself will consist of two separate houses: The Token House and the Citizens’ House. Let’s break it down.\n\nThe Token House\n\nThe launch of the OP token and the Token House set forth the beginning of the governance of Optimism. OP itself was distributed to hundreds of thousands of addresses, who engaged in community-oriented behavior through the first airdrop (more on that later.)\n\nIn any case, members of the Token House are responsible for deliberating, submitting, and voting on various proposals. To do so, OP holders can either vote directly o choose to delegate their voting power to a third party.\n\nIn essence, the Token House votes on proposals of the following types:\n\nProtocol u grades\n\nInflation adjustment\n\nTreasury appropriations\n\nRights protection\n\nGovernance fund grants\n\nThe Citizens’ House\n\nAt its core, the Citizens’ House is an experimental attempt at a non-plutocratic governance model. It is responsible for retroactive public goods funding.\n\nThe above brings us to our next point, which is the OP token.\n\nIntroducing the OP Token\n\nThe OP token was launched through an airdrop, which distributed a total of 5% of the total supply.\n\nThat said, qualifying users included:\n\nDAO voters\n\nMulti-Sig signers\n\nRepeat Optimism users\n\nGitrcoin donors\n\nIf you suspect you are eligible, you can check out any associated wallets on the official claim page.\n\nMany wonder if there will be a new airdrop, and the short answer is – yes. The team has made it clear that it plans to allocate a total of 19% of the supply for this purpose. Here’s what the overall tokenomics of OP look like:\n\nPlease visit the official website for a more complete look at the economics behind the Optimism ecosystem.\n\nConclusion\n\nOptimism has quickly become one of the most popular Ethereum scaling solutions. Most recently, the Optimism Foundation released a proposal to upgrade the Optimism mainnet to Bedrock, which is a new generation of decentralized Rollup architecture developed by Optimism Labs. Speaking on the matter, the team said:\n\n“We are confident that the post-Bedrock experience will be a positive change for developers in the Optimism ecosystem and have received consistent excitement for the upgrade from our partners. We are committed to making this upgrade a success and are eager to see the results in the months and years to come.”\n\nIt’s also very interesting to monitor how the different layer twos fare in the coming years as the battle between optimistic rollups and ZK-rollups continues."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMi4AFBVV95cUxQX1FnN1VSQVBzVGw5dzNYN1BpbnA0QlJUWERBYTdQbjlwVHhDYWJWRGdHUTdWeVB0bkhzSVpNczBZNDRjbi15ckF2N01xU1l0RnZUb1IySV9MTkYxY2R0U3M1VFZycWFadmp1bUJIa01JYkNIVV9tMXd1ZUctVVJWVXlLaE5ScUx4dkowU1k1MWJnb2h1c2hZY2dxLWJsTjdZWnkwNUxtQW1tTXNrOVlIdXFBMlJISy1na3FUWDFDZzFFaVlxclpkRWltVmhVRzBNMHVaS1V3TmlYbVUtWWNQRdIB5gFBVV95cUxQSmtVRVpmZU55M1VnSm5VTGxiYjRvT21YUzQ1RlBPR2xQYUs3LTdSQ1ZUbW15Yk5xN1E3VFlCWjcxY0NrbW56aFM3WlEtZVFYSmpsTjAzZUd3SG9Ma0UxcnRNZ3VNam5GQS1maWZ0azhsclhPWmV4LUljYlVrelktVXlPTThyUUo3RDY4UmhWRS05eFJ6bHNWZ2FOYTU2MWtJR1VENVJnNFJ4M1V4LU9FTk0xS2ZlS0NPQ2VkM0dBeXdEUmRsT2doZDlNRlpaTzdLNkhBRWk1QVp1bE1kV2ZtTlRETnNGQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jul 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum, Solana and Crypto Markets Look Ready To ‘Send’ As Stars Align, According to Investor Chris Burniske - The Daily Hodl",
        "content": "Crypto investor Chris Burniske says that Bitcoin (BTC), Ethereum (ETH), Solana (SOL) and the crypto market in general look ready to make a run.\n\nThe former head of crypto at ARK Invest tells his 292,200 followers on the social media platform X that several catalysts are now lining up, hinting that digital asset markets are on the verge of a rally.\n\nAccording to Burniske, a partner at venture capital firm Placeholder, the highly anticipated launch of Ethereum-based exchange-traded funds (ETFs), Republican presidential candidate Donald Trump speaking at an upcoming Bitcoin event and the current state of BTC, ETH, and SOL charts all suggest major bullishness for crypto markets.\n\n“With ETH ETFs slated to go live, Trump speaking at The Bitcoin Conference, and BTC, ETH, SOL charts that look like [they do] (while equities are weak), it’s hard to see a world where we don’t send next week.”\n\nReuters recently reported that preliminary approval for ETH ETFs was granted while The Bitcoin Conference is set to take place from July 25th-July 27th.\n\nBTC, ETH, and SOL are trading for $67,333, $3,528 and $174 at time of writing, respectively.\n\nThe venture capitalist also provides an update on his prediction that the total market cap of crypto assets will eventually reach $10 trillion. According to his chart, the road to $10 trillion is currently “23%” complete as it sits around $2.2 trillion.\n\nEarlier this month, Burniske said in an interview with Real Vision CEO Raoul Paul that he’s keeping a close eye on the Move ecosystem, which was originally built by social media giant Meta and then used to develop layer-1 blockchains Sui (SUI) and Aptos (APT).\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxORm5kSk8yMk9MLWpzUzExQ1p3NFRwTy1HLWYxQnY4T0NLa0RWNkxfVGhZLXRsbEFITG5HUU1IaXNoa1Y3WjR4a0kwdjVqY0ZIX2xVWHJfRGF6cXFHY3dUa0hGaTlDWjREaFVPU1RDS1cxNjhzbmpoZUl2OUJKWnVpdU5jcXF3TTN5SEJudmVUY2dRQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jul 2024 07:00:00 GMT",
        "title": "SEC Officially Approves Spot Ethereum ETF Trading for Tomorrow - Watcher Guru",
        "content": "The SEC has officially approved the trading of Spot Ethereum ETFs for tomorrow, July 23. U.S. regulators have given final approval for the S1 forms for ETFs that hold Ethereum’s ether. The Ether ETFs will be available for trade upon the opening bell.\n\nBREAKING: 🇺🇸 SEC officially approves spot Ethereum ETF trading for tomorrow. — Watcher.Guru (@WatcherGuru) July 22, 2024\n\nThe asset is set to be only the second crypto-based ETF in the United States. Moreover, the market is hopeful it can mirror Bitcoin’s success. The leading cryptocurrency debuted its ETF in January. Just three months later, the BTC reached an all-time high price of $73,000.\n\nThe decision caps a years-long process to get ether ETFs approved by the SEC, giving investors a new crypto asset to invest in. Ether ETF applicants first received 19b-4 form approvals back in May. However, many delays on the SEC’s end in looking over the final documents occurred. Now, we are less than 24 hours away from the first trades of a Spot Ethereum ETF.\n\nAlso Read: Ethereum: Is ETH a Lock for $4,000 After ETF Launch?\n\nHow Will Ethereum Perform Against Bitcoin After Spot ETF Launch?\n\nFurthermore, an interesting note is the timing of the approval. The SEC is greenlighting the launch date of the Ethereum ETF during the biggest Bitcoin conference of the year. This week isn’t just about Bitcoin anymore, as Ethereum is joining the spotlight with its ETF launch tomorrow. BTC and ETH represent the only two cryptocurrencies with an ETF in the US, but more are expected to be launched in the coming year. The first Solana SOL-based ETFs have already gotten applications sent out, and other cryptocurrencies like XRP expect to join the ETF conversation as well.\n\nCboe will house most of the first trading of Ether ETFs, with more exchanges likely jumping in shortly after trading commences. Upon the Ethereum ETFs’ debuts, the entire cryptocurrency market expects to jump as it did following the approval of Bitcoin ETFs in January."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxNbTYzdVJMWmJiaU8wNmJQYUtBZ0RwNjU0T2g0TFBUTzZ6MnVoeWVzbm5TTGlkUkxrdHB4cjlfN3lDcy1FYU1uZWI1Zjd0TmZlV09sMUdfLXoybnhTYW1iQ04xZ0xKRlUwRU9TelNkaEhmQlNwTElzQ1pCZmMtZG8zdWdKT0xpS0huS3B0MFRhSWFJdEM5eWc0MVMyOXZTWWxnTk1RU3NpTTB5RmI2WFZpcGNaM3Z0SDBPbnc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jul 2024 07:00:00 GMT",
        "title": "Bitcoin, Binance, Ethereum, Solana, and Ripple: The Biggest Crypto News of the Past Week - Cointribune EN",
        "content": "Mon 22 Jul 2024 ▪ 4 min read ▪ by Luc Jose A.\n\nBetween revolutionary announcements, technological developments, and regulatory turmoil, the crypto ecosystem continues to prove that it is both a limitless territory of innovation and a battlefield of regulatory and economic battles. Here is a summary of the most notable news from the past week around Bitcoin, Ethereum, Binance, Solana, and Ripple.\n\nBitcoin surpasses Visa and Mastercard in transaction volume\n\nBitcoin has reached a historic milestone by surpassing Visa and Mastercard in terms of daily transaction volume. According to data from Glassnode, the leading crypto asset recorded a volume of $46.4 billion, compared to $6.5 billion for filtered economic transactions. This surge is due to increasing adoption and innovations such as the Runes protocol. With a market capitalization of about $1.3 trillion, Bitcoin is redefining traditional payment systems.\n\nBinance can invest in US Treasury bonds\n\nThe world’s leading crypto exchange, Binance has received approval to invest customer funds in US Treasury bonds. This strategic decision allows the company to diversify investment options for its users. It offers greater security and stability compared to more volatile crypto assets. The announcement also led to a notable increase in the price of Binance Coin (BNB). This reflects investor confidence in Binance’s fund management and paves the way for similar initiatives.\n\nJD Vance: Trump’s Pro-Bitcoin Running Mate for 2024\n\nDonald Trump has chosen Ohio Senator JD Vance as his running mate for the 2024 presidential election. Vance, known for his support of cryptocurrencies, owns between $100,000 and $250,000 in Bitcoin and advocates for a crypto-friendly legislative framework. This nomination aims to attract the crypto-enthusiast electorate and marks a pro-crypto shift for Trump, who now accepts cryptocurrency donations for his campaign.\n\nThe Ethereum ETF hits the market on July 23\n\nThe long-awaited launch of the first spot Ethereum ETFs is scheduled for July 23, 2024, according to a recent confirmation from the Chicago Board Options Exchange (Cboe). Listed funds include the 21Shares Core Ethereum ETF (CETH) and the Fidelity Ethereum Fund (FETH). These ETFs offer a regulated and secure option to invest in Ethereum. They could attract more institutional investors and strengthen the legitimacy of the crypto market.\n\nWhale transactions destabilize XRP price\n\nRecent massive XRP transactions made by whales have caused significant volatility in the token’s price. After accumulating more than 130 million, these investors managed to push the price of XRP to 63 cents. However, the crypto asset’s price then fell by 8% to around 55.8 cents. These large holders’ significant movements demonstrate their direct impact on the market and the difficulty in maintaining price stability in the short term.\n\nThat’s the essentials to remember for this week. But if you want a more detailed recap and in-depth analysis delivered directly to your inbox, don’t hesitate to subscribe to our weekly newsletter.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQcWJVc3pmNnJtSENFSVhoZHB6NlI0NTFhWWppb3BITUxZRmRXN1E0OFp3bnlvR0JfRjY2WHdwZHQ1UXp1YlRmcnRIdlZVMC1WREpiVXpPcUNSQkZHVWtRbWhzdEdfSVNNX3ZBMG00MmlkQUoxcjlqY0ZwTjBMUF9MOVpUeTFNMWxGdGfSAY8BQVVfeXFMT2ZXUnNfOUJwTkl0ODV1dFZ3WlI2Y3NjbXZzUldpdnlkbDJoS2ZYOTc0amRsd3BnMGE4Wnh2YXRvZ3JWNkV4ZENONk1MakRYVFI0dzluSzJMdkJuVU1MY3VVNl9ZNWZpbXNRdGoxWVd2Tm8ybUxsbVFiaXo5WlI3LUo5ZHhjZlVyX2l0NDVTcTA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jul 2024 07:00:00 GMT",
        "title": "Ethereum’s road to $3.9K – Here’s what can and should not happen! - AMBCrypto News",
        "content": "Ethereum has been on the verge of surging past the $3.5k resistance level over the last five days\n\nTraders can anticipate a rally towards $3.9k, but chances of a bearish reversal thereafter would solidify\n\nEthereum [ETH], at the time of writing, was trading below the $3.5k-$3.6k resistance zone. Its momentum has stalled over the past week. In fact, a recent report revealed that the taker buy-sell ratio fell below 1 too.\n\nThis indicated a reduction in buying pressure in recent days.\n\nThe daily RSI signaled bullish momentum, but the OBV was closer to the lows of a range from May. This was not a good sign for the bulls.\n\nHence, AMBCrypto investigated whether the on-chain metrics leaned bearishly or bullishly.\n\nRecent positive netflows explain stalled momentum\n\nThe exchange netflow data revealed that over the past week, 57.98k ETH flowed into exchanges. Over the past month, 70.11k ETH flowed in.\n\nThis meant more inflows than outflows, which in turn precipitated potentially greater selling pressure in the altcoin’s market.\n\nAdditionally, the in/out of the money graph revealed that by volume, the $3171-$3276 zone was the strongest demand zone.\n\nMeanwhile, the $3.5k and $3.7k resistance levels might pose as opposition to the market’s bulls.\n\nOn-chain metrics underline Ethereum’s stagnancy\n\nThe 180-day mean dollar invested age (MDIA) metric has been trending higher since April. A prolonged uptrend is not welcome as it indicates reduced network activity and investments getting stagnant.\n\nOn the other hand, the development activity has been robust regardless of ETH’s price trend, which long-term investors would appreciate.\n\nThe daily active addresses and network growth saw a spike on 22 June, but both metrics have receded since. The age-consumed metric has also been quiet over the past week.\n\nOverall, the metrics showed that Ethereum would have a tough time climbing past the $3.6k-$3.7k resistance.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nThis point was reinforced by AMBCrypto’s analysis of the liquidation heatmap. After sweeping the pool of liquidity at $2.8k, Ethereum has rebounded healthily. Two liquidity clusters at $3.7k and $3.9k loomed ahead.\n\nIt could attract prices to them and reverse the trend, just as investors get excited about the potential for Ethereum to break the $4k resistance level."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxPNkZzTk95SlhldDBaOTFoR1NwSHBYTGVXNEgxajdYQWZvem9kaC0zelFJRWVJNi1OVngzVFFXck5ua1NrZUJQc0VwVDN4cUhSTjViSV9IZGpZSXhhdWMwYTJGdElpcUY2Q1dkdHVaQ2tHZ0tqT3JDa0Vxc09LemNrb2tmS0FzY2FoQmtWbnoyc9IBlAFBVV95cUxPODZnb1VyNHU2dlZGa21FVmVnbWV1YlZQZUU1UUYzUnJjZmZDS0t2U3NHNHVwUjBKbTlRX3BqbUdNaVpKb3BhTzJBVy1PQ21FcFNEN1dnWE5RSVlqOUc0Y21ldTVqbjlLdXAxZU1oZ2MxOGxqSExOcFp5TVYwdVFCMDEzQVhwUXVrQTN6UUVmSnVUN2RK?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jul 2024 07:00:00 GMT",
        "title": "Breaking: Mt Gox Set For Large Bitcoin Repayment Ahead Ethereum ETF Launch - CoinGape",
        "content": "Mt Gox, the infamous Bitcoin exchange that collapsed in 2014, appears to be gearing up for a significant repayment to its long-waiting creditors. This development comes at a crucial time, coinciding with the imminent launch of Ethereum ETFs. The intersection of these two events has sparked intense speculation about their potential impact on the crypto market, particularly on Bitcoin and Ethereum prices.\n\nMt Gox Prepares for Major Bitcoin Repayment\n\nAccording to data sourced from Arkham, Mt Gox has recently caught the attention of on-chain analysts with a series of small Bitcoin transfers. The most recent transaction involved 0.021 BTC (valued at approximately $1,390 USD) sent to an address 1C9Vo…t81Fa. This transfer occurred just minutes before the report was issued and mirrors a similar transaction made exactly six days prior.\n\nadvertisement\n\nThese micro-transactions are believed to be part of a testing phase for their transfer capabilities. The duplicate nature of these transactions, both involving 0.021 BTC from a Mt Gox-associated address, was also confirmed by Arkham. Speculations have arisen stating that these small-scale transfers could be a precursor to larger movements.\n\nThe cautious approach adopted is particularly noteworthy given the exchange’s troubled history and the significant assets still under its control. Reports indicate that their related addresses hold approximately 138,000 BTC, currently valued at around $8.91 billion.\n\nAlso Read: Real Bedford FC Purchases Additional $4.5 Million Worth of Bitcoins\n\nEthereum ETF Launch and Market Outlook\n\nThe cryptocurrency market is showing strong signs of recovery, buoyed by bullish sentiment surrounding the anticipated launch of spot Ethereum ETFs on July 23. This optimism has been further fueled by predictions from industry experts like Nate Geraci, president of The ETF Store, who suggests that the market may soon see the filing of a combined spot BTC, ETH, and SOL ETF.\n\nThis development has contributed to the overall positive market sentiment, Bitcoin price surpassed $68,000 but however trades at $67,346.8 and Ethereum price on the other hand rose above $3,550 but has also slightly dropped, trading at $3,496. All these come in anticipation of the spot Ethereum ETF launch. The market’s enthusiasm is reflected in the significant increase in total cryptocurrency trading volume, which has risen by more than 43% over the last 24 hours.\n\nAs the launch date for Ethereum ETFs approaches, market participants are closely watching for potential shifts in investment patterns and regulatory responses that could shape the future of cryptocurrency adoption and integration into traditional financial systems.\n\nAlso Read: Ripple CTO David Schwartz Bets on Joe Biden’s Replacement for Crypto Vote\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE1VLTFTQUVsbS1KVjRCRE5iWDFBdDRodTNvc05qcnNIdjhnU3U3dzQ5OXhRaUVFS0hHZ1hVVlVRdW9FSGtzY2V2ZUpIR1FsX1Vyem1WSGhnUUc5eGN2RTRBaWZaVGpVcGRxcHVyVnFkQWo5QdIBd0FVX3lxTE45MWJuZHpZbl9jVDFWazJ4ZFFFZ1c5cDV5cnE0ZDJENVhZLUVFdXNVTnl6UERqbmcybmRmd0JJV2c0MGlkYjdCcVBFc0dwMXZaY1ZyNzNoeS1lRS1kSk9yRjZfdzgtR0VxWmlpbjdfdHJyWHFFb0F3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jul 2024 03:31:06 GMT",
        "title": "Ethereum Price Climbs: Will It Challenge the $3,700 Mark Again? - NewsBTC",
        "content": "Ethereum price started a downside correction from the $3,500 resistance zone. ETH declined below $3,440 and might struggle to stay above $3,380.\n\nEthereum is moving higher above the $3,500 zone.\n\nThe price is trading above $3,520 and the 100-hourly Simple Moving Average.\n\nThere is a connecting bullish trend line forming with support at $3,450 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could continue to rise if there is a clear move above the $3,565 resistance zone.\n\nEthereum Price Reclaims $3,500\n\nEthereum price remained in a bullish zone above the $3,350 resistance zone. ETH extended its increase above the $3,500 resistance but lagged Bitcoin. There was a spike above the $3,550 level and the price traded as high as $3,563.\n\nIt is now consolidating gains near the 23.6% Fib retracement level of the upward move from the $3,412 swing low to the $3,563 high. Ethereum is now trading above $3,500 and the 100-hourly Simple Moving Average.\n\nThere is also a connecting bullish trend line forming with support at $3,450 on the hourly chart of ETH/USD. The trend line is close to the 76.4% Fib retracement level of the upward move from the $3,412 swing low to the $3,563 high.\n\nIf the price stays above the 100-hourly Simple Moving Average, it could attempt a fresh increase. On the upside, the price is facing resistance near the $3,550 level. The first major resistance is near the $3,580 level. The next major hurdle is near the $3,650 level.\n\nA close above the $3,650 level might send Ether toward the $3,700 resistance. The next key resistance is near $3,720. An upside break above the $3,720 resistance might send the price higher toward the $3,800 resistance zone in the coming days.\n\nAnother Decline In ETH?\n\nIf Ethereum fails to clear the $3,550 resistance, it could start a downside correction. Initial support on the downside is near $3,500. The first major support sits near the $3,470 zone and the 100-hourly Simple Moving Average.\n\nA clear move below the $3,470 support might push the price toward $3,440. Any more losses might send the price toward the $3,350 support level in the near term. The next key support sits at $3,320.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone.\n\nHourly RSI – The RSI for ETH/USD is now above the 50 zone.\n\nMajor Support Level – $3,500\n\nMajor Resistance Level – $3,550"
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE5QSnJWcVQ5OVF3b2JkcmVNNkFGR2QzRE4yTjk0UC1wLXB3Ykl5b09KRzZSNHNzNGdRLURyZnBhSTFVd2lvZlNSdTZ2QjBkU1k5T09PdDgyUDhhQzhkaWlPMVRQNG9TNDJjQnJ4YV8zeEhYT3YyYW01WTdyR3Jsd9IBgwFBVV95cUxQNWxVSVktV1lkeDJEVGgtOHE2Q1VEYnpGWUs5VElrdWw3dlJlRnVydzR0MnNXMm1ldjZUNnRIcGZ3bHExY3RvM0tIeU80d1FFQ0JLWFZIN1RKVXh5a0RJX1JKRUE2MTBHN0lNRHRoTWs1Yy1tT2VPX2otUDN4b29LcHgwSQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jul 2024 07:00:00 GMT",
        "title": "Solana Joins “Big Three” Cryptocurrencies as Spot ETF Hopes Rise - Coinpedia Fintech News",
        "content": "Mustafa has been writing about Blockchain and crypto since many years. He has previous trading experience and has been working in the Fintech industry since 2017.\n\nStory Highlights Crypto market will see a Trio of combined Spot ETFs for BTC, ETH, and SOL soon.\n\nSpot crypto ETFs have rapidly drawn billions from investors, reflecting high interest.\n\nCombined ETFs could offer diversified exposure, increasing demand and reducing risk.\n\nSolana (SOL), the fifth-largest cryptocurrency by market cap, has established itself alongside Bitcoin and Ethereum as part of crypto’s Big Three. With Bitcoin and Ethereum already having spot ETFs or about to launch them, it’s likely that Solana will get one too. This could significantly impact SOL, potentially even greater than what we’ve seen with Bitcoin and Ethereum.\n\n\n\nNate Geraci, President of The ETF Store, has speculated that issuers might soon pursue a combination of spot ETFs encompassing Bitcoin (BTC), Ethereum (ETH), and Solana (SOL). This prediction highlights the growing anticipation surrounding multi-crypto ETFs.\n\nCould this be the next big thing?\n\nThe Surge of Spot Crypto ETFs\n\n2024 has been a landmark year for spot crypto ETFs, which have captivated the market and attracted billions from eager investors. The approval of spot Bitcoin ETFs on January 11 injected fresh optimism into the crypto space, paving the way for similar offerings for Ethereum. The success of Bitcoin ETFs has not only sparked increased investor interest in Ethereum but has also driven Bitcoin prices up to $74,000.\n\nWith Bitcoin and Ethereum ETFs launched, more crypto exchange-traded products are now possible, including a potential ETF for Solana. The success of these initial ETFs shows that investors are eager for more options and managed crypto investments.\n\nThe Industry is Changing\n\nIn a recent tweet post, Nate Geraci, president of The ETF Store, believes that issuers may soon apply for combination spot ETFs that include major cryptocurrencies such as Bitcoin, Ethereum, and Solana.\n\nPrediction…\n\n\n\nAn ETF issuer will file for combined spot btc, eth, & sol ETF in next few months.\n\n\n\nWe’re quickly heading down path towards index-based & actively managed crypto ETFs. — Nate Geraci (@NateGeraci) July 22, 2024\n\nThis move is expected to offer investors a diversified exposure to the top-performing digital assets, reflecting the growing interest and maturity in the crypto market.\n\nGeraci further noted that the ETF industry is swiftly moving towards the adoption of both index-based and actively managed cryptocurrency ETFs. This transition reflects a growing demand for diversified and strategically managed crypto investment options.\n\nBy combining major cryptocurrencies like Bitcoin, Ethereum, and Solana into a single ETF, investors would gain exposure to a broader range of assets, potentially reducing risk and increasing investment appeal.\n\nPositive Signs for the Markets\n\nThe rise of crypto ETFs marks a big shift, changing the view of crypto from just a speculative asset to a key part of investment portfolios. More involvement from financial institutions adds credibility to crypto assets.\n\nThis positive development has boosted the crypto market, with Bitcoin trading at $67,878. Meanwhile, Ethereum is hovering around $3,514, and Solana is trading at $181.\n\nAlso Check Out: SOL Price Prediction: Post 40% Jump, Solana Eyes $200 Break To Hit $250!\n\nSolana is gaining traction. Do you see it as a solid investment? Let us know."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxONm1nd0VFZzY4RXE2cmFBZkEzeGJSUFZjTGZhTkNyNzVKZXpsRFQxbWNJVTd4Z2pQTXhMTzVtcmc3bFptb0h5eGNXdGpXRTdVSF91MU5Wb09Xb0VHZnNYMV9qZDFnQW9nYk84WXdOU2cyZDZFYjJ2QlZFRGlHVkxpSjFJRmZPcEp2MmprdGV2cHdfbGdRWFlYMHl6Z21HRjRNekVVYWZZOHFDWDk1cFo5UmZoRlFETE1kYjlnMi02N3dlNjRacjMybUlfR2RJbUFqRjItU05n0gHbAUFVX3lxTE5PUy1BaGtTdVpJX0Z5R2s2UVpIMG1ELXVKWkcxN2t0dXNlZF9jWWxOcGhDa2x6TGZxREo2M2ltaWdDODVhekhBRGhNSkFUUlVXUk8xR21iOHlCUVZrSGtxeXpmWE5ucjZMQWUwQnpxTDlUSENBd1JNdjlvakk1WVd4YjZ1bTd3UkNsSjg4Q1FNU1l4eUZxMi0xMkNndFh2NXNYWGZJZnFGVjR2a1BEMnY0c1B3NWtVRjhqd2M0c1NaQVJwNlE4enZLbDNKYXhPd0RlYlFtcWwxakFrdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETF Launch is Just a Few Moments Away: Will This Be the Turning Point for the ETH Price Rally? - Coinpedia Fintech News",
        "content": "A passionate cryptocurrency and blockchain author qualified to cover every event in the crypto space. Researching minute occurrences and bringing new insights lie within the prime focus of my task.\n\nEthereum ETF Launch is Just a Few Moments Away: Will This Be the Turning Point for the ETH Price Rally?\n\nStory Highlights The spot Ethereum ETF is expected to launch in the next 24 hours, while the ETH price consolidated below $3500\n\nThe historical pattern suggests the price has experienced a significant drop after each event and hence a similar pattern is feared to reciprocate\n\nThe Ethereum price is testing one of the crucial supports after the bears intensified their activity since the start of the day. Besides the market, participants remain vigilant ahead of the spot Ethereum ETF launch as they continue to hold crucial support. With this, the possibility of a major swing continues to prevail over the Ethereum price rally, but at the same time, the probability of a fakeout also haunts the rally.\n\nThe weekly chart displays that the price continues to trade within a pattern and hence it suggests that one final dip may begin a parabolic run towards a new ATH, maybe to a 5-digit figure. The ETH ETF is set to go live in the next 48 hours, and the sentiments have absorbed the Bitcoin selloff from the German government. Therefore, the launch is expected could bring new money and energy into the crypto space. Amid the bullish sentiments, is the ETH price prone to a pullback before the launch?\n\nAfter the bullish weekend close, the ETH price reached one of the crucial price zones which may trigger a 30% rise as it happened earlier in February. Previously, the price marked a pivotal resistance and consolidated for a range which triggered a massive run to mark a yearly high above $4000. Therefore, the upcoming price action suggests, that even if the price breaks the support at $3486, it may drag the price with a small range as the bulls could hold a strong base at $3350.\n\nThe MACD is displaying a drop in the selling pressure but the DMI is neutral, remaining within the bearish range. Although the +Di & -Di underwent a bullish close, the levels failed to maintain an ascending trend while the ADX continued to trade towards the south. On the other hand, the Ichimoku cloud is close to turning bullish which is flashing huge bullish signals for the upcoming ETH price rally.\n\nThe launch of the spot ETH ETF is expected to have a nominal impact on its price and also on the entire market. However, after a small pullback, the journey towards a new ATH above $5000 may be imminent."
    }
]