[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxPYkxOS05VN1FDaFp1akRWNEM5Y2tiZFdNY3NXQTQ4NXFuUC1zYjZWakNSQ1poRWJEcUhSYTNlZDJBYjN5RDdUQklJZUJNVjFzVkN6ZkdpMVBBX0hfTENqb2N6WTE0NlNBeVZ1bUhpcWFHWXNXQ20zUW8ta2JVMmoxZVNNc1J6R1BNV1p4UXk4WQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 28 Apr 2024 07:00:00 GMT",
        "title": "Top 15 Ethereum Competitors and Alternatives in 2024 - Yahoo Finance",
        "content": "In this article, we will discuss the top 15 Ethereum competitors and alternatives in 2024. If you want to skip our analysis about some of the key players in the cryptocurrency market, you can proceed to the section highlighting the Top 5 Ethereum Competitors and Alternatives in 2024.\n\nThe Global Cryptocurrency Market and a Comparison of Giants\n\nAccording to a report by Grand View Research, the global cryptocurrency market was valued at $4.67 billion in 2022 and is projected to grow at a compound annual growth rate (CAGR) of 12.5% from 2023 to 2030, to reach $11.71 billion by the end of the forecasted period. You can also take a look at 15 Best Blockchain and Bitcoin ETFs.\n\nBitcoin and Ethereum are the two most traded cryptocurrencies in the world. Both Bitcoin and Ethereum utilize blockchain technology, however, they have different purposes and technical architectures. Bitcoin was introduced in 2009 by the mysterious Satoshi Nakamoto as a decentralized digital currency primarily tailored for peer-to-peer digital transactions without the involvement of financial institutions. Bitcoin emphasizes security, and scarcity with its blockchain optimized primarily for monetary transactions. Bitcoin is powered by the energy-intensive Proof-of-Work (PoW) consensus mechanism and operates on the SHA-256 hash algorithm, Bitcoin has the highest market capitalization among all cryptocurrencies, valued at over $1.3 trillion on April 14. However, its smart contract capabilities are limited compared to Ethereum. You can 15 Countries Where Bitcoin is Legal and Illegal.\n\nEthereum on the other hand was launched in 2015 and is a global, open-source platform for decentralized applications that empowers developers to build decentralized applications (dApps) and execute smart contracts, which are self-executing agreements encoded in code. Examples of decentralized apps that can be built on Ethereum include tokens, non-fungible tokens, decentralized finance apps, lending protocols, and decentralized exchanges. Tokens are interchangeable digital assets that represent value on a blockchain. Non-fungible tokens (NFTs) are unique, non-interchangeable tokens that represent ownership of digital items such as art, collectibles, or virtual real estate. Decentralized finance (DeFi) apps are blockchain-based financial applications that operate without centralized intermediaries, Lending protocols are DeFi apps that allow users to lend and borrow cryptocurrencies, which often use NFTs as collateral and Decentralized exchanges (DEXs) facilitate the trading of cryptocurrencies in a decentralized manner, without any intermediaries. As of April 14, Ethereum has a market cap of over $386 billion.\n\nStory continues\n\nEthereum charges a fee for transactions and smart contracts on its blockchain network known as Gas which is paid entirely in Ethereum coins. Gas is measured by the amount of computational effort required to execute an operation or a smart contract, the more complex the execution operation is, the more Gas is required to fulfill that operation, and can vary from time to time depending on the network’s demand. Gas fees for Ethereum transactions can range from $0.0001 to over $100, depending on the blockchain’s demand.\n\nKey Players in the Cryptocurrency Market\n\nCompanies offering user-friendly cryptocurrency exchange platforms and providing services such as trading, lending, and wallets have contributed significantly to the growth of the cryptocurrency market and have also established themselves as key players in the digital finance industry. Some of the largest companies offering platforms and wallets for the cryptocurrency market include Coinbase Global Inc. (NYSE:COIN), Robinhood Markets, Inc. (NASDAQ:HOOD), and Block, Inc. (NYSE:SQ).\n\nCoinbase Global Inc. (NYSE:COIN) operates a cryptocurrency exchange platform and is the largest cryptocurrency exchange in the United States in terms of trading volume. On April 3 Coinbase Global Inc. (NYSE:COIN) announced that it had obtained registration as a Restricted Dealer by the Canadian Securities Administrators (CSA), making it the first and largest international cryptocurrency exchange registered in Canada. The registration marks a significant milestone in Coinbase Global Inc.’s (NYSE:COIN) commitment to the Canadian market, following its Enhanced Pre-Registration Undertaking in March 2023 for regulatory compliance and formally launching its services back in August 2023. Coinbase Global Inc. (NYSE:COIN) plans to establish partnerships with local financial institutions and stakeholders in Canada to encourage the adoption of digital assets and promote economic development. On April 11 Coinbase Global Inc. (NYSE:COIN) announced the launch of margined Bitcoin Cash and Litecoin futures contracts by Coinbase Derivatives, making it the first CFTC-regulated exchange to offer such contracts. Dogecoin futures contracts are also expected to launch later this month. Coinbase Derivatives aims to improve access to digital asset trading by reducing upfront capital requirements and ensuring regulatory compliance.\n\nRobinhood Markets, Inc. (NASDAQ:HOOD) provides a user-friendly platform that can be used to trade stocks and cryptocurrencies. On March 19, Robinhood Markets, Inc. (NASDAQ:HOOD) announced its official launch in the United Kingdom and offered key features and benefits for investors including options trading, 5% AER (Annual Equivalent Rate) on uninvested cash, access to over 6,000 global companies, commission-free trading, and no foreign exchange fees on trades, in comparison to the significant fees charged by other UK brokers. On February 29, Robinhood Markets, Inc. (NASDAQ:HOOD) announced its collaboration with Arbitrum, a Layer 2 scaling solution that will give Robinhood Wallet users access to Arbitrum swaps through decentralized exchanges. Robinhood Wallet users can now benefit from reduced transaction fees and faster transaction speeds on some of the most prominent networks in the cryptocurrency market. Over the next few months, Robinhood and Arbitrum will also collaborate to facilitate access to cross-chain swaps and other initiatives that are aimed at lowering the barriers to using web3 on Robinhood Wallet. Commenting on the event, Johann Kerbrat, General Manager of Robinhood Markets, Inc.’s (NASDAQ:HOOD) Crypto Divison said:\n\n“Ethereum gas fees are an essential part of securing the network, but these same fees can hinder adoption, Layer 2s like Arbitrum, which is currently the leading chain by total-locked value, help solve this problem for our users. Accessing and transacting on L2s has historically been difficult to non-crypto natives, but Robinhood Wallet now helps strip away the complexities to help onboard those new to web3.”\n\nBlock, Inc. (NYSE:SQ), formerly known as Square, Inc. is a global technology company with a focus on financial services and owns Square, Cash App, TIDAL, and TBD. On December 07, 2023, Block, Inc. (NYSE:SQ) launched Bitkey a self-custody cryptocurrency wallet in over 95 countries across six continents that consists of three components: a mobile app for seamless transactions on smartphones, a hardware device for securely storing cryptocurrencies offline, and a set of recovery tools in case customers lose their phone, hardware, or both. Unlike traditional self-custody wallets, Bitkey uses three keys to secure cryptocurrencies: one integrated into the mobile application, another in the hardware device, and the third stored on Bitkey’s server. Any two keys can be used to move cryptocurrencies or approve other security-related actions such as initiating recovery or modifying security settings. Bitkey has also partnered with prominent platforms like Coinbase and Cash App, enabling seamless transfers of cryptocurrencies from exchanges to the Bitkey wallet.\n\nEthereum's decentralized platform not only facilitates digital transactions but has also transformed the landscape of decentralized applications as they operate on a distributed network of servers and are not prone to censorship and fraudulent activities. As the cryptocurrency market continues to evolve, innovations in blockchain technology will further expand the possibilities within the cryptocurrency industry. With this context, let’s take a look at the list of the top 15 Ethereum competitors and alternatives in 2024. You can also take a look at the best day trading tips for beginners.\n\nTop 15 Ethereum Competitors and Alternatives in 2024\n\nnick-chong-0bO235Rhqec-unsplash\n\nOur Methodology\n\nTo come up with the top 15 Ethereum competitors and alternatives in 2024, we employed a consensus approach. We consulted more than 10 articles on the internet to find the top Ethereum competitors and alternatives in 2024. Of them, we picked cryptocurrencies that appeared in 50% of our sources and ranked them according to their market cap as of April 14, 2024. Here are the top 15 Ethereum competitors and alternatives in 2024.\n\nTop 15 Ethereum Competitors and Alternatives in 2024\n\n15. Filecoin (FIL)\n\nMarket Cap as of April 14: $3.42 billion\n\nFilecoin (FIL) is an open-source, public cryptocurrency and digital payment system made by Protocol Lab. Filecoin (FIL) allows users to rent out their unused storage space and earn tokens in return and creates a decentralized marketplace where one can store information securely and efficiently. Filecoin (FIL) ranks 15th on our list of top 15 Ethereum competitors and alternatives in 2024.\n\n14. Polygon (MATIC)\n\nMarket Cap as of April 14: $7.31 billion\n\nPolygon (MATIC), formerly known as Matic Network, is one of the top Ethereum alternatives in 2024 for processing transactions faster and cost-effectively. Polygon (MATIC) provides a solution for the Ethereum blockchain by offering a way to process transactions off the Ethereum blockchain and then commit them back to the main blockchain. Polygon (MATIC) plays a pivotal role in facilitating transactions and decentralized applications as Ethereum’s blockchain can be slow and expensive to use.\n\n13. Chainlink (LINK)\n\nMarket Cap as of April 14: $8.58 billion\n\nChainlink (LINK) is a decentralized oracle network designed to connect different networks and protocols. Chainlink (LINK) enables smart contracts to securely interact with external data sources, APIs, and payment systems to expand their capabilities. Chainlink (LINK) supports data movement between all blockchains worldwide and is one of the top 15 Ethereum competitors and alternatives in 2024.\n\n12. USD Coin (USDC)\n\nMarket Cap as of April 14: $9.69 billion\n\nUSD Coin (USDC) is a stablecoin pegged to the US dollar on a 1:1 basis. USD Coin (USDC) is issued by regulated financial institutions and is fully backed up by reserved assets. USD Coin (USDC) is commonly used for trading, investing, and transferring value on blockchain networks. USD Coin (USDC) ranks 12 in our list of top 15 Ethereum competitors and alternatives in 2024.\n\n11. Tron (TRX)\n\nMarket Cap as of April 14: $9.87 billion\n\nTron (TRX) is a blockchain and peer-to-peer (P2P) network that enables content creators to sell their content directly to consumers without any intermediaries and transaction fees. Tron (TRX) is developed by the Tron network and is used for various purposes, including transactions, smart contracts, and voting on network governance. As of 2024, Tron (TRX) is one of the top competitors and an alternative to Ethereum.\n\n10. Polkadot (DOT)\n\nMarket Cap as of April 14: $9.98 billion\n\nPolkadot (DOT) is a scalable, secure, and decentralized multi-chain network for the next web and is built on the Substrate framework. Polkadot (DOT) allows independent blockchains to share information and assets securely and creates an interconnected and scalable ecosystem. Polkadot (DOT) is one of the top Ethereum competitors and alternatives in 2024, developers can use the Polkadot (DOT) infrastructure to create custom blockchains with larger design spaces for decentralized assets and applications.\n\n9. Avalanche (AVAX)\n\nMarket Cap as of April 14: $14.10 billion\n\nAvalanche (AVAX) is a blockchain platform that offers tools for creating decentralized finance (DeFi) applications, financial assets, and enterprise-scale financial solutions and is one of the top competitors and alternatives to Ethereum in 2024. Avalanche (AVAX) is also compatible with Ethereum and its network is designed on multi-chain linear scalability which can process over 4,500 transactions per second.\n\n8. Shiba Inu (SHIB)\n\nMarket Cap as of April 14: $14.21 billion\n\nShiba Inu (SHIB) is a meme-based cryptocurrency inspired by the Dogecoin community and is one of the top competitors and alternatives to Ethereum in 2024. Shiba Inu (SHIB) creates a decentralized ecosystem for artists, creators, and developers to collaborate and build projects. Shiba Inu (SHIB) is the native token of the ShibaSwap decentralized exchange and is used for various purposes including as a peer-to-peer digital payment system.\n\n7. Cardano (ADA)\n\nMarket Cap as of April 14: $17.65 billion\n\nCardano (ADA) is a decentralized Proof-of-Stake (PoS) blockchain that requires less energy to operate compared to the Proof-of-Work (PoW) mechanism. Cardano (ADA) was developed by Ethereum’s co-founder Charles Hoskinson as a platform for Web3 applications. As of 2024, Cardano (ADA) is one of the top competitors to Ethereum.\n\n6. Dogecoin (DOGE)\n\nMarket Cap as of April 14: $23.95 billion\n\nDogecoin (DOGE) started as a joke based on the popular \"Doge\" meme and since then has gained a significant following and community. Dogecoin (DOGE) is a decentralized cryptocurrency that can be used for peer-to-peer transactions, tipping, and charitable donations and is one of the top 15 Ethereum competitors and alternatives in 2024. Dogecoin (DOGE) is known for its strong community spirit and has been supported by various celebrities and influencers.\n\nClick to continue reading Top 5 Ethereum Competitors and Alternatives in 2024.\n\nSuggested Articles:\n\nDisclosure: None. Top 15 Ethereum Competitors and Alternatives in 2024 is originally published on Insider Monkey."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiZ0FVX3lxTFBHUUY3bW80ZENGODNQbmdRZjhPWXFvVlY0NmVJbG4tQURwbk5Od0VicXd1MzY4ZGstMy1XZTA5LXZFbUZwOTgyNzVDRzN4YkI1U0dfdUhsNlJXQW5zbWJ1bzNVSUhYYm8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Apr 2024 07:00:00 GMT",
        "title": "SEC considered Ethereum unregistered security for at least a year: FOX Business - Crypto Briefing",
        "content": "Ethereum's legal status is questioned amid SEC's intensifying scrutiny.\n\nShare this article\n\nThe Securities and Exchange Commission (SEC), led by Chairman Gary Gensler, has been operating under the belief that Ethereum (ETH), the second-largest crypto, is an unregistered security. This perspective has been held for at least a year, FOX Business reported on Monday, citing recent court filings.\n\nThe filings emerged from a lawsuit filed by Ethereum software company Consensys last week, which is challenging the SEC’s attempt to classify Ethereum as a security. Consensys’ legal action follows a Wells Notice from the SEC, which signaled the agency’s intention to sue the firm for not complying with federal securities laws.\n\nAccording to FOX Business, the documents reveal that the SEC’s Enforcement Division, under the direction of Gurbir Grewal, initiated a formal investigation into Ethereum’s status as a security in March 2023. This investigation, referred to as the “Ethereum 2.0” investigation, aims to explore transactions and activities related to Ethereum dating back to at least 2018.\n\nSources familiar with the matter told FOX Business that the SEC sent multiple document requests and subpoenas to firms associated with Ethereum, including Consensys. MetaMask’s parent company reportedly received four subpoenas from the SEC and a Wells Notice.\n\nThe SEC’s current position appears to contradict previous guidance from 2018 when then-Director of Corporation Finance at the SEC Bill Hinman stated that Ethereum was not considered a security due to its decentralized nature. Comparatively, the Commodity Futures Trading Commission later classified ETH as a commodity.\n\nConsensys’ legal action against the SEC aims for the court to resolve the dispute over Ethereum’s regulatory status, a case that could have wide-reaching implications for the crypto industry, akin to previous cases against major platforms like Coinbase and Kraken."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTFAxM0djNFY5Ylo2ZGRFX0VlcGpndmx1ZkZxNkRuSU1LU2w3eXRCR2gyTE94SFQ4UGdmeWU5QWVaR0JhWnhIR3lOdzgzN2VkZUlkUXRiYl9UeDRWbS1maWFwUnVOVGNYRlpSM0c2YTc5SDlzRzAybE10bmlB0gF_QVVfeXFMTUFhMGM0ODJvbTJqRFNYOWUtb2JXTDlzeWswaWpNN2NfMG5HS1NWeEJtOXRwTk9WeE9GQUM0dG1kY2hlNnJtRl9ZWmM3THdHUWJXY29vVjkwbkNhaXZ2dnV5ZDEzMldrcm1iR0dRZEl5bk5wU1dheTNLWXlUdG1vdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 28 Apr 2024 07:00:00 GMT",
        "title": "Binance Seeing Ethereum Whales Outflow: What's Happening? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nBinance has experienced significant outflows: 14,146 ETH, valued at approximately $46.74 million, within 24 hours. Notably, a fresh wallet also extracted 95.67 million USDT along with 7,402 ETH, equating to around $23.3 million. The activity mirrors the withdrawal patterns of two other wallets known for moving large quantities of ETH and stablecoins off the platform.\n\nAdvertisement\n\nThe smart money tracking service Lookonchain even raised a question: Could these transactions be linked to Justin Sun, known for his substantial funds movements, or are they simply routine redistributions? While the identity of the wallet owners remains unconfirmed, the movement of such large sums is not necessarily an alarm signal. It is often a simple transfer of funds.\n\nRecently, Binance has been witnessing continuous outflows and a dip in market share. This could suggest a trend of whales gradually reducing their presence on the exchange. It is important to consider these movements within the market's current tendencies.\n\nEthereum price chart suggests the second-biggest currency is currently in a mixed position. Ethereum's price appears to be consolidating with current support at the $2,900 level. If there is a potential growth scenario toward resistance at $3,400, ETH would need to maintain the current pace. A break beyond that could see Ethereum challenging higher levels, possibly around the $3,650 mark.\n\nAdvertisement\n\nHowever, if support at $2,900 is breached, Ethereum might face a slide toward the next support region near $2,800. Whales' actions, like those possibly associated with Justin Sun, can influence market sentiment, but the price chart suggests a steadiness that may not be easily swayed by individual transactions, regardless of their size.\n\nWhile the outflows from Binance and market share reduction could be part of a funds redistribution by large-scale investors, Ethereum's technical indicators and support levels remain mixed."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE02a3V5bFlwNjZQdi1SSFRmemZieS04YnUyS2VQcFdDZjJNSzk4QzVRQl9ubS05UGF5Z0dFemxGTEkxdzd0dVNOelRKcmJFdzN2OU5QV3FHWTI3OVhpcE9Wb19sUWZOMVFGNlhwbmNUY255ZncyVEtfSlZURF8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Apr 2024 07:00:00 GMT",
        "title": "Solana Vs Ethereum : Will Solana Take Over Ethereum By End of 2024 ? - CoinGape",
        "content": "Amid crypto market crash following Bitcoin halving, Solana and Ethereum show different levels of performance. Solana’s annual increase of 480.53% contrasts with Ethereum’s decrease of 66.68%. During the previous week, Solana had a drop of 12.05%, whereas Ethereum had a smaller decrease of 1.06%. This article will analyze their most recent market performance, evaluating their potential paths in the current crypto environment and examining if Solana is positioned to surpass Ethereum.\n\nSolana vs Ethereum: Current Price Market Performance\n\nadvertisement\n\nIn the continuous battle between Solana and Ethereum, the market performance illustrates two powerful entities maneuvering through the unpredictable world of cryptocurrency. Solana’s native token SOL is currently at $135.08, showing a 4.50% decrease in value in the last 24 hours. Nevertheless, taking a broader perspective reveals a more detailed story, with SOL undergoing a 12.05% decrease in the week and a significant 27.45% drop in the month.\n\nEven with some temporary obstacles, the token has seen a remarkable increase of 480.53% in the last year, showing its ability to bounce back and remain popular among investors.\n\nIn comparison, Ethereum, along with its famous token ETH, holds a higher value of $3,164.16. However, similar to its opposite, it is dealing with recent changes, showing a 3.84% drop during the day. Nevertheless, Ethereum’s overall trend indicates a more stable path, with only a 1.06% drop in the week and a 10.75% decrease in the month.\n\nSignificantly, ETH has shown a 66.68% decline in value in the last year, highlighting the difficulties encountered in the cryptocurrency market as a whole.\n\nDigging further, Solana’s market capitalization of $6.4 billion places it in the 5th position among cryptocurrencies, according to CoinMarketCap. On the flip side, Ethereum boasts a market cap of $386.2 billion, establishing itself as the second biggest cryptocurrency by market capitalization.\n\nEven though they have different market capitalizations, both platforms show strong trading activity, with Solana seeing $1.98 billion in 24-hour volume and Ethereum reporting $13.5 billion.\n\nAnalyzing price movements, Solana’s recent changes had it moving between $133.96 and $143.78 in a day, whereas Ethereum traded within the range of $3,152.95 to $3,351.18. Both tokens reflect their highest values in the past, with Solana reaching $260.06 two years ago, showing a decline of 48.24%, and Ethereum peaking at $4,891.70, currently experiencing a decrease of 35.54%.\n\nWhat is Ethereum?\n\nEthereum is the second-largest cryptocurrency by market capitalization, operating as an open-source blockchain system with its own digital currency called Ether (ETH). Founded by Vitalik Buterin in 2013, Ethereum allows for the execution of Decentralized Smart Contracts. The project was funded through a public crowd sale in 2014, leading to the official launch of the blockchain in 2015.\n\nEthereum aims to be the global hub for decentralized applications (Dapps), enabling programmers to create and run software without censorship or downtime. The concept of “smart contracts” was pioneered by Ethereum, with co-founder Gavin Wood envisioning it as “one computer for the entire planet.” Recent upgrades like the London Hard Fork and the Dencun Upgrade have brought scaling efficiencies and lower transaction costs to the platform.\n\nWhat Is Solana?\n\nThe Solana project, initiated in 2017 and formally launched in March 2020 by the Solana Foundation, is an open-source platform leveraging blockchain technology for cost-effective DeFi solutions with a focus on speed. Its protocol supports DApp development through smart contract deployment on its blockchain, aiming to enhance scalability with a mix of PoH and PoS consensus mechanisms.\n\nWith SOL crypto priced at $104.69 on March 2, 2022, and reaching an ATH of $260.06 on November 6, 2021, Solana’s efficient model enables swift payment verification at low costs, providing a USP in the crypto industry. The innovative hybrid consensus ensures accessibility for all traders, aligning with the Foundation’s goal of broadening decentralized finance access.\n\nSolana vs Ethereum: Key Features\n\nSolana’s unique Proof-of-History (PoH) consensus mechanism, combined with Proof-of-Stake validation, allows it to process significantly more transactions per second than Ethereum. The platform provides each node with its clock and decision-making ability. The Byzantine Fault Tolerance (BFT) algorithm protects the system from disruptions, ensuring overall functionality. Solana supports multiple smart contracts running simultaneously, enhancing platform efficiency and versatility within its ecosystem.\n\nOn the other hand, Ethereum features smart contracts encoded into code for self-execution, enabling the creation of decentralized applications on its blockchain. Its native crypto is used for transactions and rewarding miners. With a Turing-complete virtual machine, Ethereum executes smart contracts for various applications and allows for the formation of DAOs, governed by code and consensus.\n\nSolana vs Ethereum: Latest News\n\nA potential spot Ethereum ETF could be on the horizon now that spot Bitcoin ETFs are no longer the focus, expected in May. Nevertheless, the schedule for this has not been determined yet, as the SEC has remained silent about the matter.\n\nAdditionally, the Ethereum Dencun Upgrade was successfully launched on the mainnet on March 13, 2024, following its deployment on all the Ethereum testnets. This is a significant advancement in the Ethereum network and a crucial step towards Ethereum 2.0.\n\nOn the other hand Solana received the Crypto of the Year award for its SOL token from CoinMarketCap, recognizing its growth and resilience. This milestone showcases its success among other notable projects in the industry.\n\nFurthermore, Solana-focused devshop Anza has released an update to fix the intermittent congestion issues and expects a sound recovery in the Solana ecosystem.\n\nConclusion: Will Solana Overtake Ethereum?\n\nBoth Solana and Ethereum are significant players in the world of cryptocurrency. Ethereum, the second-largest cryptocurrency, continues to advance with upgrades like the Dencun Upgrade. Meanwhile, Solana has quickly gained recognition, even winning the Crypto of the Year award. The question remains whether Solana will surpass Ethereum by 2024. Solana’s scalability and capabilities make it a strong competitor, but Ethereum’s established environment and continuous updates suggest it will maintain its dominance. The competition between Solana and Ethereum is expected to continue as new technologies, market factors, and regulations evolve."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxPakludWU5V3htZ3hqX0xHdUpicEliNjlHSGdzRTBSZjJLSW9PVGNib0tvV3czVUlaUkRFR0FVU1NPa0cwMHBCbTJKS0pkQXN4V2o5UzlvRGZNSnRyY3ZOVTJ1MllvTW9SaVJJZk1PWmFsNHVzc3lQeFF4eTFMN2VnWmtRUFNBRlJxS2VYZGVCYkYySnhXM2tERnJ1LUllZzIyMVd1TtIBrAFBVV95cUxOY3p2LXlYWjVIYVpoTkxrUGMtM1o3d3hpMHdTd21aaDBCRmY5Ykl5QjJwOGhwRFlFd08tT2kxTzkwZ3VlQjkzWW9QS0YxSzVOczBGbDdpYk1taUFXamVMUlRFcUNneFJWTkQwQjU2cUgzQjVZQTI2d0I3b2lHZUxNMFRidXhQT2tLMXNXYnB6VVFKUFNkS2gtNllOTG0yakdxeElBLXpabFV5OUV6?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 28 Apr 2024 07:00:00 GMT",
        "title": "This Week on Crypto Twitter: Bitcoin Runes Mania and More Ethereum Legal Drama - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIllustration by Mitchell Preffer for Decrypt\n\nCrypto Twitter this week was dominated by the industry’s new hottest topic, Bitcoin Runes—plus a steaming hot serving of legal drama in the form of a preemptive lawsuit filed by Ethereum software giant against the U.S. Securities and Exchange Commission (SEC).\n\nEver since Bitcoin’s latest halving, Runes—a new Bitcoin-based protocol that can support fungible tokens like meme coins—has surged in popularity. DOG, a new Runes meme token, was airdropped on Wednesday to holders of the Runestones Ordinal project. The distribution to tens of thousands of wallets immediately made DOG the most popular Runes token yet created.\n\nCheck your wallets! 100,000,000,000 $DOG has been successfully airdropped to Runestone holders. Shoutout to giga-chad volunteer community member @gm7t2 for flawlessly executing it. The journey to $1 has begun 🐕🚀🌕 pic.twitter.com/XPL7q6m7VG — Leonidas (@LeonidasNFT) April 24, 2024\n\nAD\n\nAD\n\nRunes fever took such hold over the cryptosphere this week that activity on the protocol quickly surged to dominate the entire Bitcoin network.\n\nBREAKING: Runes accounted for 72.7% of all Bitcoin transactions in the past 24 hours — Ord.io (@ord_io) April 24, 2024\n\nSome crypto users bemoaned the spike in Bitcoin network fees caused by the Runes frenzy. But other protocol supporters remained steadfast in their conviction that hype around the new class of tokens was only just beginning.\n\noverwhelmed by the number of absolute mid curve takes from people who are fading runes. “sit on your hands for now see how it goes” “all these tickers suck” “the fees are too high for meme coins” bruh you will be buying rune 1 from me for 100x sooner than you think. EZ game. — faXx 🎈| 824.eth (@faxx_eth) April 24, 2024\n\nOver on Ethereum, bullish news was found this week in the eye-popping, multi-million dollar sale of yet another CryptoPunk NFT. Punk #635, an ultra-rare Alien Punk, sold on Thursday for a whopping $12.38 million to an anonymous collector.\n\nAD\n\nAD\n\nThe sale marked the third occasion within weeks that an Alien Punk had traded hands for north of $11 million.\n\nCryptoPunk 635, the Alien originally owned by Larva Labs and sold at the Christie’s Contemporary Art Evening Sale in May 2021, has just been acquired by an anonymous collector in a deal brokered by Fountain. We’re honored to have played a small role in this sale. Congratulations… pic.twitter.com/glisy3MZpv — Fountain (@Fountainxyz) April 25, 2024\n\nIt wasn’t all smiles for everyone in the Ethereum NFT ecosystem, however. On Friday, Yuga Labs, the multi-billion dollar company behind the once-dominant NFT collection Bored Ape Yacht Club, laid off an undisclosed number of employees. In a message to employees, the company’s CEO and co-founder, Greg Solano, conceded that the company has “lost its way.”\n\ngm, really tough day today. I am hellbent on transforming yuga and getting us back to our roots, and that means making hard decisions. by far the hardest is saying goodbye to some talented team members. here was my message to the team this morning. pic.twitter.com/gBkoNf2iK3 — Garga.eth (Greg Solano) 🍌 (@CryptoGarga) April 26, 2024\n\nThe biggest bombshell of the week, however, came on Thursday, when Ethereum software giant Consensys revealed in a proactive lawsuit against the SEC that the federal regulator is allegedly seeking to sue the company and potentially declare Ethereum to be a security in the process.\n\nToday, Consensys filed a lawsuit against the Securities and Exchange Commission. The goal behind this is to ensure that Ethereum remains a vibrant and indispensable blockchain platform and to preserve access for the countless developers, market participants, and institutions… — Consensys (@Consensys) April 25, 2024\n\nIndustry leaders immediately took to Twitter to vocally support the suit, castigating the SEC for potentially attempting to effectively outlaw Ethereum after several other American government entities have indicated that ETH is not within the SEC’s jurisdiction.\n\nI know ETH is a commodity. You know ETH is a commodity. The CFTC knows ETH is a commodity. It's time for the SEC to admit that it still knows ETH is a commodity too. No more games. Thank you to @Consensys for standing up against the SEC's unlawful expansion of authority. https://t.co/8w7A4PBwUK — paulgrewal.eth (@iampaulgrewal) April 25, 2024\n\nAD\n\nAD\n\nHayden Adams, founder of decentralized exchange (DEX) Uniswap, likened the suit to a battle cry for the crypto industry to finally take an aggressive, collective stance against the SEC in a Lord of the Rings-esque battle. Uniswap revealed earlier this month that it, too, is being sued by the SEC for alleged securities violations.\n\nSue the Exchange Commission Thanks @ethereumJoseph and @Consensys for fighting back and defending our industry We're tired of the overreach and harassment https://t.co/yDTjjiaJWl pic.twitter.com/vtWxqKxv9n — hayden.eth 🦄 (@haydenzadams) April 25, 2024\n\nDisclosure: ConsenSys Mesh is one of 22 investors in Decrypt. Edited by Ryan Ozawa."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxOQTJkTmJMdWN4dHprMVhZX2VBeTBBenlOQnFCQnVjWE5NeEVvelh4alA5Tnd4WUhxS1otRy1icTgweGFtWlJDNWxwZmtUdUVjVkI0LWY3OWowR0J1MHFpMkVrT2NRd0p0Qm95V2hJUnRjQ1o5RlFEOXpxMktwQ0M4aUpqYjMycHpWM2RhOEJnRExpZVRKcVlKNDZFTExBc3pZQkF5VHpaZ1c2V2hWdVNTSkhaNzNaaEx1WFUtVjB0SFB2MFhHbmpUYTNxQkNRYVXSAdQBQVVfeXFMT3JzWGE3d3B2S2dMc29SMmdfb3RidzZmM2xtUlVueEtKV0ozelk1T3JPZ1VRamtuSE1aMWFsam5maFBncmRWNS1WcDZ2cXJLNm51bHh3bW9YdklwRGNaU0NrOG5kNDlGTXdrMmR0TFFCSjBGMkhGdnYtZE1IaXVlNGY0amxaNXNjVFJjckRhdG9yVm8tVWhjUzFvSWdKSVlVdTNzOVVVQVpvN1QzN2V2WEFnM2VSTzF2cmhyN2Z3RUlTREdTR1hldUtKVFI2azB0VXhQVk0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 28 Apr 2024 07:00:00 GMT",
        "title": "Ethereum fees drops to lowest level since October, ETH sustains above $3,200 - FXStreet",
        "content": "Ethereum supply is inflating despite relatively high throughput.\n\nAverage fee has nosedived to $1.12 per transaction, lowest since October.\n\nEther sustained above $3,200 on Sunday, up 4% in the past seven days.\n\nEthereum’s high transaction fees has been a sticky issue for the blockchain in the past. This led to Layer 2 chains and scaling solutions developing alternatives for users looking to transact at a lower cost.\n\nThe issue seems to have de-escalated with Ethereum’s average fee level dipping to $1.12 per network transaction. This is one of the lowest levels noted since October 18.\n\nEthereum transaction fee declines\n\nData from Ultrasound Money shows that Ether’s circulating supply has surged, climbing to the highest level witnessed since March. A little over 120 million Ether is in circulation now and the sharp increase in supply can be attributed to the consistent decline in burn rate, in the past two weeks.\n\nGas fees is currently 7.19 Gwei, up from a low value of 4.48 Gwei, as seen on Ultrasound.money. Gas fees is currently $0.62, as seen in YCharts, down from the May 2023 peak of $3.788.\n\nEthereum gas fees\n\nThe Ethereum supply chart shows inflation, and the recent increase sprung on ETH holders as a surprise, after five months of steady deflation. The ETH supply chart below shows the sudden increase in supply.\n\nETH supply\n\nThese catalysts have failed to have a significant impact on Ether price. The altcoin has sustained above $3,200 on Sunday, after relatively less significant moves since the Bitcoin halving. ETH holders are awaiting the Securities and Exchange Commission’s (SEC) decision on Spot Ether ETF and this is likely to emerge as the most significant catalyst for Ethereum."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxNR0VaVnJVb0NBUmpLb3BwRXhtMzg4SnBiNDVsTjRzdTVobVFFMXhRR2xNM3o3N0ZoMU1VMkFZTGtOakFZWXBHNHRvOER6cEI4d1dDZFpoekVCRERMX01RMzlRdnJ6dWw5WXJwVGJxLUdpQXZNTkwxWWgyaVJISjhTWV9zV2lqY2kybkJtTFN6bldQSWPSAZsBQVVfeXFMTnJPem1LUkg3V3hnZWJ5alR1UU9pODQ5ZHVsQjNhU2RmMDN0bkVoVjdRTjExRGtCY0dDbDktSE9NSWpnQTFkUFpZSldxRTBWRlZ3SnZ6Ql9HN1lJdDc2cGtjWEE2SXhoc2ptOTZ0aTk5ejZiN1dzVWpHX3RrcmxpWjh2X01UZkF1ekZVaVZ5WmNwZktMZERFNG1Wb1U?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Restaking Protocol EigenLayer Reveals Token and Airdrop Plans - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe Eigen Foundation, which supports the Ethereum restaking protocol EigenLayer, published details about its upcoming token airdrop on Monday.\n\nIn cryptocurrency, staking refers to locking up crypto holdings to support a blockchain's security, integrity, and efficiency by helping to validate transactions. EigenLayer facilitates Ethereum (ETH) “restaking,” which is the ability to use a single stake across multiple blockchains.\n\nBased on a snapshot of eligible wallets taken last month, the Eigen Foundation said the EIGEN token airdrop will take place between May 10 and September 7, spanning 120 days. The initial \"stakedrop\" allocates 5% of the total token supply to users who engaged in staking activities as of March 15.\n\nEligibility for the drop includes people who staked directly with EigenLayer or through liquid restaking tokens (LRTs). The first “Season 1” airdrop, the Eigen Foundation said, consists of two phases, with 90% of tokens going to users who meet the initial eligibility requirements and remaining allocation distributed in a later phase.\n\nAD\n\nAD\n\n“The remaining 10% is for people who interacted with EigenLayer in more complex ways, where determining the appropriate EigenLayer end-user was either not possible or required an opinionated decision,” the group wrote, later posting additional details to Twitter.\n\nClarifications with respect to the Season 1, Phase 2 allocations of 10% (approximately 7.77M EIGEN), Pendle, and certain other unresolved (DeFi) contracts. – Users of Pendle or any unresolved (DeFi) contract are not penalized in the distribution.\n\n– 10% is an approximate… — Eigen Foundation (@eigenfoundation) April 29, 2024\n\nThere are also restrictions, however. The EigenLayer airdrop terms of service disclose that certain regions will be excluded from participating in the drop, enforced through IP address blocks for regions under international sanctions or “deemed high-risk,” including the United States, Canada, China, Cuba, North Korea, Iran, and Venezuela.\n\n“To avoid circumvention of our geo-location controls, the organization has implemented proxy and VPN detection and blocking controls, which are designed to prevent Eigen claims by any person detected to be using VPN and similar proxy technologies,” EigenLayer wrote.\n\nAD\n\nAD\n\nAfter the initial EIGEN drop, 15% of the total supply is reserved for future drops, the foundation explained.\n\nIntroducing the Eigen Foundation, EIGEN token, and Season 1 Stakedrop! pic.twitter.com/lxEVSbRfVB — Eigen Foundation (@eigenfoundation) April 29, 2024\n\nThe Eigen Foundation did not immediately respond to Decrypt’s request for comment.\n\nEigenLayer was founded in 2021, led by former University of Washington data science professor Sreeram Kannan. In February, the total value locked (TVL) on EigenLayer surpassed $3 billion. $560 million of the deposits to EigenLayer were stETH, the liquid staking token created by Lido Finance.\n\nThe newly launched Eigen Foundation will support research and development on the EigenLayer protocol by funding grants, providing third-party evaluations, and “stewarding continued progress toward greater decentralization.”\n\n“The new EIGEN token introduces a complementary mechanism that is designed to specifically address ‘intersubjective’ faults—faults that are not possible to address via ETH restaking alone,” the foundation said. “Intersubjective faults are instances of misbehavior that cannot be objectively identified onchain, yet any two reasonable observers would agree that a penalty is deserved.”\n\nThe news of the stakedrop coincides with the release of EigenLayer’s whitepaper that details the structure and tokenomics of the Eigen ecosystem.\n\n“In the initial phase, the EIGEN token will be non-transferable and non-forkable,” the Eigen Foundation said. “We believe this approach will best support the long-term growth and maturity of the EigenLayer ecosyste\n\nAD\n\nAD\n\n“Upon completion of this phase, the full functionality of the token, including forkability and transferability, will be enabled,” it continued.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMi9wFBVV95cUxQbGU0eWwyXy1sYllpTlpibG42QU5iWVVGdXBUM1g3RmNyT3kzVlF3eFBpZk4yaDhQM0ZNeEhJUEgwZmtOWER1M2VHdnJVV2dFYWhtUWhLcXhrVG56MjlUVzFtRV8zU2ZwZWlVczEyQUlGN2VyLUc2UXRiU1d6TnhmUGszbEk5NzRqR3BZektQVE1OY0VuZVVyc3JIWVpoOVFDOTVkajl1c0luaTFUck1tTTlBLW9iM2MxbjBhSXN1UUtRSDNIQWlwbEtBMVAyRjBCczRVMlhXQUIwRDllUWpDLWUwTlpITUdjaktzZUR6ZkRqR09ncFE00gH8AUFVX3lxTE03YmlobWdJWHdMMmV5ZXdsbTl5cUlfV3ZDdzNiT2JVYzdhRjJ6SlJwNk5QTmtqNXhrOWVPcHJiaFc3cXZFYmU5bE0tcENxVWQ0dmxqYThVSWlUNEVfSFZHVm1PaFJIWk80SEJYTHFNUHhObE5pS0RJSWl0eVg4Q1hUQW5XQUhkS3hHMU5rdDFfSjdJTmx2NXpWLTNMUm82aGFXUEtXN0NmUXRVVEZQanhlbnJjcUxRQjl0SWtUUGw1VV92M29WMTFmd0gtUlFiM3VFYld6ZUhqakUzTlo2WnVtdFdIMTg4S28zakxrREp2Q0h4NGp1SThDbUZ6Tg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Apr 2024 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: Relief wave on altcoins likely as BTC shows a $5,000 range - FXStreet",
        "content": "Bitcoin price could drop into the liquidity pool between $60,600 and $59,005 as it establishes $65,600 as weekly resistance.\n\nEthereum price could confirm a falling wedge pattern with a 25% run above $3,406 at breakout point.\n\nRipple price defends $0.5000 but overhanging bearish activity will keep XRP holders’ vision for $0.6000 a hopium pipe dream.\n\nBitcoin (BTC) price has recorded lower highs over the past seven days, with a similar outlook witnessed among altcoins. Meanwhile, while altcoins display a rather disturbing outlook amid a broader market bleed, there could be some relief soon as fundamentals show:\n\nA massive cool off in euphoria and sentiment\n\nA cool-off phase allows the market to correct itself, stabilize, and establish a more sustainable growth trajectory.\n\nA healthy outlook in funding rates\n\nHealthy funding rates indicate a well-functioning and balanced market ecosystem, promoting stability, reducing the risk of manipulation, and fostering confidence among market participants.\n\nOverleveraged short positions are waiting to get liquidated\n\nWhile the initial liquidation of overleveraged short positions may lead to short-term volatility, the eventual impact can often be positive for the price of an asset.\n\nRead More: Week Ahead: Bitcoin could surprise investors this week\n\nBitcoin price forms a $5,000 range\n\nAfter successive weekly closes below $65,600, and with the bulls defending against a dip below $60,000, Bitcoin price has established a $5,000 macro market range. The odds hint at a further decline given the Relative Strength Index (RSI) is subdued below the mean level of 50 and the Awesome Oscillator (AO) indicator continues to post red histograms in negative territory.\n\nIf seller momentum increases and Bitcoin price dips into the liquidity pool between $60,600 and the intra-day low of March 5 at $59,005, the downtrend could continue with bulls waiting to buy BTC just above the $50,000 psychological level.\n\nBTC/USDT 1-day chart\n\nConversely, if history repeats, Bitcoin price could move in the opposite direction as the DXY Compare indicator. To confirm the continuation of the uptrend, however, the bulls must haul BTC above $72,000 because plenty of bearish activity awaits BTC price near the $70,000 threshold.\n\nAlso Read: Bitcoin Price Outlook: Will BTC ignore major macro market developments this week?\n\nEthereum price could rally 25%, pending confirmation\n\nEthereum price is trading with a bearish bias, but not for long as the price action since March 12 has consolidated into a descending wedge pattern. The execution of this bullish reversal technical formation will happen after a decisive breakout above the upper trendline on the one-day timeframe.\n\nThe target objective for this pattern is a 25% move toward $4,250, determined by measuring the heath of the wedge and superimposing it at the expected breakout point.\n\nThe Relative Strength Index (RSI) continues to wind around the mean level of 50, while the AO indicator shows growing bullish sentiment displayed by the green histograms that draw toward positive territory.\n\nThe higher highs seen on the RSI chart since mid-April relative to the lower highs in ETH price also support the bullish thesis, suggesting a bullish divergence. If the RSI flips above the mean level, it would tilt the odds further in favor of a bullish breakout.\n\nETH/USDT 1-day chart\n\nOn the other hand, if ETH bears have their way and book profits for the nearly 10% gains made since Ethereum price bounced from the $2,900 support, the market would see a correction. A candlestick close below $2,900 would invalidate the bullish thesis.\n\nAlso Read: Ethereum fees drops to lowest level since October, ETH sustains above $3,200\n\nRipple price suffers the weight of overhanging bearish pressure\n\nRipple downside potential remains very much alive with bearish activity waiting to descend on XRP price once it lifts. This is seen with the multiple spikes on the volume profile (grey) in the one-day chart below. The RSI is also declining steadily, showing falling momentum.\n\nThis, coupled with the red histogram bars that remain in negative territory reinforce the bearish outlook. If the $0.5000 psychological support is lost, Ripple price could drop all the way to the $0.4500 threshold, or in a dire case, extend the fall to the bottom of the market range at $0.4188, nearly 20% below current levels.\n\nXRP/USDT 1-day chart\n\nOn the flip side, if XRP bulls show up, Ripple price could recover. For the bearish thesis to be invalidated, however, the price must record a candlestick close above $0.6500. This is because massive bearish activity awaits the payments token in the area surrounding $0.6000 as XRP bears wait to cash in.\n\nAlso Read: XRP slides to $0.50 as ETHgate controversy resurfaces, Ripple CTO debates impact on litigation"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMinANBVV95cUxOcWVnemRNenRqSUU2TU5kSmI5RFAtZmN5b0d0Y2cxcjBKT0hoOUJtQmtNckZId1B3d1V3dXRsbi10dUZaNmxzemJNRThmR19vb3NHVy1yQ0toMVN3ZnRySThjdWJ3Y1dJVnNfSjNPbks5WWgzUy1wdGFZM1RmRFBEOVR4SHl4MDZTd005Q1lpREtKVzdUQmNueWM4LVY0Ykt3Zl9HZjVwRV95ekhzNzllME55X29xdzMzYXhWcXBOU3I2VV9XenBBZXdQdkdSeGViZjhEN3YzWDFkQkxsbUpaS3Fld25HaG8td2NuWjF2amxEbGtHMC12aTNuS0o2TGIxMm5kdnk4WHZlNXNickQtVFhOMTV5S1U1c2szN3JNRmd3Y3RVYVZXNE9BMVZnV2hUb2YycWo2cEt0cFE4VFo4OFI2eTQ2TVZEdWZVa3JZVU82ZWxHTm9ZNm1vcXBMZmtBLXgtT21IN1ozaWh4dHlCNWVSdm5wY3U1M2Y2YnZlZ1o0MVc3LUtLZVFQUThNSzhqT2diQkpoM0FkbXlV0gGiA0FVX3lxTE1FM1dtWHNmaFBoRmYtdmdMVlI4RGNhbTZGSEFBUUpSbldQclhIVVJpTkRmV3BnMWFqVnE1c3pJLWZuWmJxR0VHSUhPOFJvcUNTSFJNdUNSY2dVUURsdXlVWE95Q0NpM3lEV2ktbzk3b2lFZ3hLMXhSYk9BYVgzcXpkYXh0dThSbmxtM2xfVXhMNzRTZjBucWpqYUtOQ2I0VzgwVm9oTWVhbjFjTUk5bHdKODBBNUlIOTQxV3doNGptanR6LTRBakRERHNaMFZadnVuMm0tS0dUTklNSnI1dkQ1cldKdWxaMXZOeXBPMWQxVWxuUktrekZpeHJXdlVOVFQwZHdaODdCTFJPaTZKclRYSDdnQjZfaXFxUGd6N2EzWHBYVy1SdTliaVpNNEZFODFnYldTVFc4bjBPcnpidVJTMnVleU9md0p6RmxhSFRLaVZxY2gxQ1NjakNEd2FPRlJtc3M5QjJjOUhpQlJsTzR1YU9KdE1ESU5WY0JEZG5pMGI2THhyTG56SDhfVEtFOWxpWXNyUzdYMnE2eVVJMno3RkE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Apr 2024 07:00:00 GMT",
        "title": "Cryptocurrency market sees decline as Bitcoin and Ethereum slip - The Economic Times",
        "content": "\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nThe cryptocurrency market experienced a decline in Monday's trading session, with Bitcoin slipping 2.3% to $62,300, while Ethereum fell 4.3% to $3,170.In addition, the global cryptocurrency market cap decreased by 2.94% to approximately $2.31 trillion over the last 24 hours.\"Bitcoin failed to continue the relief rally after it crossed $67,000 briefly last week. Bitcoin’s current price momentum could be linked to low demand from Spot ETFs and negative sentiment among investors expecting a potential post-halving crash,\" said Shivam Thakral, CEO of BuyUcoin.\"$59,600 is an important level bulls need to defend to prevent further downsides. A strong break and close above $65,000 could clear the path for a rise to $68,000 and then to $71,000,\" said Thakral.Meanwhile, Parth Chaturvedi, Investments Lead at CoinSwitch Ventures, said, \"There seems to be a bearish trend forming for BTC, and we can expect some slow-moving days ahead. Immediate resistance is around $63.4k.\"Other major crypto tokens such as BNB (-2.2%), Solana (-5.2%), XRP (-3.4%), Dogecoin (-5%), Toncoin (-4.7%), Polkadot (-5.2%), Shiba Inu (-5.3%), and Avalanche (-4.4%) also declined.The volume of all stablecoins is now $52.74 billion, which is 90.58% of the total crypto market 24-hour volume, as per data available on CoinMarketCap.In the last 24 hours, the market cap of Bitcoin, the world's largest cryptocurrency, declined to $1.227 trillion. Bitcoin's dominance is currently 53.15%, according to CoinMarketCap. BTC volume in the last 24 hours rose 19.3% to $21 billion.Regarding the future price movements of cryptocurrencies, the CoinDCX Research Team noted, \"This week's macroeconomic events, such as the Fed's fund rate and unemployment rate announcements, could potentially increase market volatility.\"On the technical front, Edul Patel, CEO of Mudrex, said, \"Bitcoin has been range-bound between $60,000 and $70,000 level since a while now. The support lies at the $62,500 level and the resistance is at the $64,200 level.\""
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPTDdHcDA5REF5RmY1cVVBS1JiOFdQZFFGLXh1SHA0QVlGdFZyNEJPQjU5T0FQZmYzbmQ4emJualAyc1JZdHlFYTR3Y04zMlMyN2k1dXNmVllmckdfY2wtOElyQ1pLSUR1b25hcDJzYVZQTWhrVjFQVjJ1UVVVOVVNTnlTeU54OUc1TGNz0gGQAUFVX3lxTE9Sa3BJU2dYbUdoQkRqa28tYjdVWlZIaGhfUHBieE9LeGlKUkM5QXhzdk5jRE9wTW9aNFk4RjN3X2hxNEpPOEduUGpGN3N4MzNkUFhuZ04zNTNUSHJ5THpfODBnaWdINnlqT1JidGNmZl9sb2tjeWxjQk9EUEdVb3BVaDBLQ0F1MUktZDZvSTd5cg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Apr 2024 07:00:00 GMT",
        "title": "Ethereum ETH upgrade debate: How will EIP 3074 impact ETH’s future? - AMBCrypto News",
        "content": "Developers were in two minds about 3074 EIP in Ethereum’s recent developers call.\n\nPrice of ETH plummeted, on-chain metrics remained positive.\n\nEthereum’s [ETH] latest Dencun upgrade was a success that helped many L2 solutions reduce fees to extremely low levels.\n\nAfter this upgrade, the Ethereum developers set their sights on their upcoming upgrade, Prague, on their recent call.\n\nNew developments\n\nEthereum’s Pectra upgrade, expected in late 2024 or early 2025, is expected to bring new features to crypto wallets, enhancing user experience.\n\nEthereum Improvement Proposal (EIP) 3074, enables regular crypto wallets to function like smart contracts.\n\nOne key aspect of EIP-3074 is its ability to give standard wallets, like MetaMask, smart contract capabilities.\n\nAdditionally, it allows a third party to cover the gas fees associated with a user’s transaction, potentially making transactions more affordable for users.\n\nIt also includes features such as transaction bundling, reducing the need for multiple signatures, and sponsored transactions, allowing wallets to delegate funds for others’ use, similar to ERC-4337’s account abstraction.\n\nSome developers argue that the proposed changes to EIP 3074 to allow broader use cases and global message revocation significantly increase its complexity, making it harder to implement and potentially introducing security risks.\n\nBecause of these circumstances, developers have decided to conduct a separate breakout meeting to discuss the technical aspects of EIP 3074.\n\nTheir aim is to reach a consensus on its implementation in a way that satisfies everyone, given its controversial nature.\n\nState of ETH\n\nThe developments being made to the Ethereum network may heavily influence the price movement of ETH going forward.\n\nAt press time, ETH was trading at $3,170.97 and its price had fallen by 4.48% in the last 24 hours. However, the volume at which ETH was trading at, had grown by 9.33% in the same period.\n\nThe speculation around Spot ETFs around ETH was one of the major drivers of price movement for ETH in the last few days.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nDespite the recent decline in price, the onchain metrics provided a positive picture. The network growth for ETH had also grown during this period, indicating that the number of new addresses showing interest in ETH had surged.\n\nThis renewed interest may help ETH see further bullish momentum going forward. Along with that, the velocity had also risen, indicating a heightened trading frequency for ETH."
    }
]