[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxOYmJwRzV1cHo3LTFZeEdjWS1FWXdQVkFGZGd5WEtrbHEyY0thQ2E4ZHdmUC1RWlNqMWZnaG4zbE8yM0N1bHhGTFp4Y2hNeTdJbWZILUJNS0x2NFQ2c3llYzk3SXVuTFQtNzhSdXZpdmhvd0w1c1g2eTJpQW9NMmZJc2l2eWlSdXlWZ3JCR3ZDUE5LNGJFV2M3WXBWWQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Jan 2024 08:00:00 GMT",
        "title": "Distributed Validator Technology: Decentralizing Ethereum's Proof-of-Stake - hackernoon.com",
        "content": "In recent years, Ethereum transitioned to the Proof-of-Stake (PoS) model, moving away from its initial Proof-of-Work consensus. This new PoS model changes how transactions are verified on Ethereum and how new blocks are added to the network. Instead of the energy-heavy mining required in Proof-of-Work, PoS works by selecting validators based on the amount of cryptocurrency they hold and are willing to risk as security.\n\n\n\n\n\nThis method is more energy-efficient and aims to improve network security and fairness in participation. However, switching to PoS introduced challenges, especially in maintaining network decentralization and ensuring secure validation. For example, security is a paramount concern in blockchain networks, especially for validators who participate in consensus mechanisms and have access to significant funds.\n\n\n\n\n\nTraditional single-node validator configurations pose a risk; if a validator's private key is compromised, it can lead to serious consequences such as slashing or loss of staked ETH.\n\n\n\n\n\nEthereum has introduced Distributed Validator Technology (DVT) to tackle these issues. DVT spreads out the tasks and risks related to the validation process in Ethereum's PoS system. It works by dividing and sharing a validator's key responsibilities among several entities, decreasing the chances of centralized control and eliminating single points of failure.\n\n\n\n\n\nIn this system, a validator's private key is fragmented and distributed across a network, forming a strong cluster. These clusters work together, ensuring the complete key is never fully available on any computer. This method enhances network security and guarantees uninterrupted validation, even if some nodes in the cluster are compromised or fail.\n\n\n\n\n\nAlon Muroch, Founder of the SSV.Network's core team broke it down saying, \"Distribuited-Validator-Tech (DVT) is a protocol for delegating validator operations to a group of independent operators (cluster). DVT combines 2 core technologies: a BFT consensus protocol and threshold signatures. Cluster members reach a consensus, every epoch, on what duty data to sign, and then sign it using t-of-n BLS threshold.\"\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\"Each operator in a cluster holds a key share, those shares can be split from an existing validator using Shamir-Secret-Sharing or by some distributed-key-generation (DKG) protocol.\"\n\n\n\n\n\n\"Cluster members require consensus before signing, removing single point of failure setups in which a hacked or compromised service provider compromises the entire validator. DVT overcomes those challenges by using a fault tolerant consensus protocol (QBFT).\"\n\n\n\n\n\nDVT's integration into Ethereum's PoS framework is crucial for a more decentralized and secure blockchain network. By reducing the risks of centralized power and enhancing the security of the validation process, DVT significantly bolsters the integrity and reliability of Ethereum's network.\n\n\n\n\n\nIt ensures that the power to validate and create new blocks is spread across a broader group of participants, not concentrated among a few. This paper will examine how DVT strengthens Ethereum's decentralization, exploring its mechanisms and impact on the future of blockchain security and integrity.\n\n\n\n\n\nUnderstanding Ethereum's Proof-of-Stake and the Need for Decentralization\n\nEthereum's transition from Proof-of-Work (PoW) to Proof-of-Stake (PoS) was motivated by the need to improve the inefficiencies and environmental issues linked to PoW.\n\n\n\n\n\nPoS, which selects validators based on their cryptocurrency holdings and risk commitment, is more energy-efficient and accessible, reducing the heavy computational demand of PoW.\n\n\n\n\n\nDecentralization is a key aspect of PoS, vital for network security and resilience. Unlike PoW, where the high computational demands can lead to a few entities dominating mining power, PoS provides a fairer system for participation.\n\n\n\n\n\nDecentralization is important in PoS to avoid any single group having too much control over the network, which helps reduce the risk of unfair tactics like the 51% attack, where someone controls most of the mining power. A decentralized network is also more robust, less prone to specific points of failure, whether technical, geographical, or political.\n\n\n\n\n\nYet, achieving true decentralization in standard PoS models has its challenges. One main concern is the risk of wealth concentration, where wealthier stakeholders might have too much influence, potentially leading to a plutocracy. There's also the issue of centralization through staking pools, where smaller stakeholders combine their resources to increase their chances of being chosen as validators, unintentionally leading to a concentration of validation power.\n\n\n\n\n\nThese issues underscore the importance of systems like DVT, which aim to distribute the validation process more evenly across the network, reinforcing the decentralized nature of PoS. Addressing these obstacles, PoS systems aim to more closely adhere to the fundamental tenets of blockchain technology, striving towards an authentically decentralized and secure network.\n\n\n\n\n\nThe Basics of Distributed Validator Technology\n\nDistributed Validator Technology (DVT) is an innovative method that transforms how blockchain networks validate transactions, especially in Ethereum's Proof-of-Stake system. DVT's main goal is to boost security and promote decentralization by spreading the tasks and powers of a single validator among many nodes.\n\n\n\n\n\nIt does this by dividing the validator's private key into parts, each handled by different nodes in the network. These nodes work together to do the jobs of a single validator, like proposing and checking blocks, without ever having the full private key in one place. This greatly lowers the risk of someone getting unauthorized access to the key.\n\n\n\n\n\nDVT relies on several critical cryptographic techniques. First is Shamir's Secret Sharing, which splits the private key into multiple pieces. Each piece is given to different nodes, and only a certain number of these pieces can put the original key back together. This setup means no single node has total control or knowledge of the private key, making the system more secure.\n\n\n\n\n\nAnother key part is the Threshold Signature Scheme. This scheme decides how many key pieces are needed to perform a task, like making a signature. For example, in a 3-out-of-5 setup, three of the five pieces can create a valid signature. This ensures the system keeps working even if some nodes are down or compromised, as long as enough nodes are active and working together.\n\n\n\n\n\nDistributed Key Generation (DKG) is used to create these key pieces. It's a complex method that makes sure each participant gets a part of the key, without any single participant seeing the whole key. This step is crucial when first setting up a DVT system.\n\n\n\n\n\nMultiparty Computation (MPC) is also important in DVT. It allows multiple parties to jointly calculate something while keeping their inputs secret. In DVT, MPC helps nodes work together to make signatures, without sharing their key pieces.\n\n\n\n\n\nLastly, the consensus protocol in DVT is essential for making decisions in the network. It determines how nodes, each with a part of the validator's key, agree on actions like confirming blocks or approving transactions. This protocol ensures that even though the validation duties are spread out, the network runs smoothly and in sync, with all nodes aiming for the same goal. This protocol handles the usual blockchain operations and adapts to DVT's unique features, ensuring the system's distributed nature strengthens security without losing efficiency or unity.\n\n\n\n\n\nA Closer Look at Distributed Validator Technology in Ethereum's SSV Network\n\nThe SSV Network, employing Secret Shared Validator (SSV) or Distributed Validator Technology (DVT), introduces a novel method for Ethereum staking. This technology facilitates establishing a decentralized and open-source network for staking ETH.\n\n\n\n\n\nThe SSV Ethereum staking network, recently rolled out its unrestricted mainnet.\n\n\n\n\n\nThe primary function of SSV is to divide a validator key into multiple KeyShares, allowing the operation of an Ethereum validator across various non-trusting nodes. This division aims to improve the security and redundancy of validator keys, potentially impacting individual stakers, the Ethereum network, and staking services.\n\n\n\n\n\nSSV operates similarly to a multi-signature wallet with an additional consensus layer. It interfaces between a beacon node and a validator client to streamline the staking process. Its operation involves Distributed Key Generation, where operators collaboratively create a shared public and private key set. Each operator controls a private key segment, preventing total control by a single party.\n\n\n\n\n\nThe network uses the Shamir Secret Sharing method for reassembling validator keys, based on a specific threshold of KeyShares. Notably, each KeyShare alone cannot sign duties, yet the entire set is unnecessary if some are faulty, as indicated by the formula n≥3f+1. The flexibility is enhanced through BLS signatures, enabling the combination of multiple signatures to form a validator key signature. This integration aids in the distribution and assembly of keys as required.\n\n\n\n\n\nSSV incorporates Multi-Party Computation (MPC) to secure KeyShares distribution among operators and decentralized computation of validator duties. This process ensures that the validator key is not reconstructed on a single device. To reach a network-wide consensus, even when certain operators are offline or malfunctioning, the Istanbul Byzantine Fault Tolerance (IBFT) Consensus process is employed.\n\n\n\n\n\nThe SSV Network ecosystem consists of stakers, operators, and DAO members. Stakers, including individual ETH holders or services, utilize SSV/DVT technology to enhance the security and decentralization of their validators, compensating operators with SSV tokens.\n\n\n\n\n\nOperators provide hardware support and manage the SSV protocol, ensuring the network remains robust and functional. The DAO (Decentralized Autonomous Organization) plays a significant role in governing the SSV Network protocol and managing its treasury, with decisions made through governance functions and token holder votes.\n\n\n\n\n\nThe native token of the SSV Network, $SSV, is primarily used for payments and governance. Stakers pay operators $SSV; the token also enables participation in network decision-making. As more ETH is staked, operators and the DAO's treasury receive higher fees, potentially creating a cycle promoting network growth.\n\n\n\n\n\nMuroch said, \"Such an important public good like DVT needs to have the right governance to ensure it's aligned with the greater ethereum ethos. An active and prominent DAO empowers the ssv community to make decisions and drive innovation.\"\n\n\n\n\n\n\"The ssv DAO decides everything that happens within the ssv protocol: protocol params, contract upgrades, resource allocation and more.\n\nWe believe that a powerful DAO must be the driving force for ssv to serve ethereum and help make it more secure and decentralized.\"\n\n\n\n\n\nDiva's Approach to Distributed Validator Technology\n\nDiva, an Ethereum Liquid Staking protocol, utilizes Distributed Validator Technology to enhance Ethereum's Proof of Stake system. It introduces novel features for two types of participants: Liquid Stakers and Operators.\n\n\n\n\n\nLiquid Stakers interact with Diva by depositing Ethereum (ETH). In return, they receive divETH, a unique Liquid Staking Token. This token represents the initial ETH stake and accumulates Ethereum Staking Rewards over time. The distinct aspect of divETH is its liquidity; unlike traditional staking where assets are locked, divETH can be freely transferred or traded, maintaining its value and rewards.\n\n\n\n\n\nAdditionally, divETH is dynamic, with its balance regularly updating to reflect accrued rewards or penalties. This token also has versatility in the DeFi ecosystem, as it's an ERC20 token and can be used for various purposes like lending or bridging. For those who prefer a stable balance, divETH can be converted into wdivETH.\n\n\n\n\n\nOperators in the Diva ecosystem have a different role. They run nodes that are essential for the network's validation process, staking their divETH as collateral. This collateral secures the network and entitles them to Operator Rewards, supplementing the standard Staking Rewards that divETH generates.\n\n\n\n\n\nThe system incentivizes Operators to perform their duties correctly; because if they fail to do so, it can lead to penalties on their collateral. The more divETH an Operator stakes, the greater their potential rewards, as they can receive more Key Shares, which are crucial for the validation process.\n\n\n\n\n\nWhat sets Diva apart, particularly for Operators, is its non-custodial approach. Operators never handle the actual funds or private keys. Instead, the Diva Smart Contract acts as a mediator, handling ETH deposits and setting up validators within Ethereum's Consensus Layer.\n\n\n\n\n\nA unique feature of Diva is its use of Distributed Key Generation and Boneh–Lynn–Shacham (BLS) threshold signatures, ensuring secure and decentralized validation. Each Ethereum validator in this system is controlled by multiple Key Shares, distributed among various Operators. A consensus of two-thirds of these Key Shares is necessary for any validator action, ensuring reliability and security.\n\n\n\n\n\nDiva's architecture offers a more accessible and flexible staking option than traditional Ethereum staking. While Ethereum requires a significant commitment of 32 ETH and the operation of a node, Diva allows Liquid Stakers to stake any amount of ETH without running a node.\n\n\n\n\n\nOperators, on the other hand, can lock smaller amounts of divETH and still participate in node operation, often finding it more advantageous than operating a solo Ethereum validator. This approach simplifies the staking process and aggregates rewards from the entire network, leading to smoother and more predictable returns for all participants.\n\nHow Lido Utilized DVT\n\nLido's project involving Distributed Validator Technology (DVT) is a bit like a big experiment in teamwork for computers that handle cryptocurrency transactions, specifically Ethereum. They worked with a group called the SSV Network from April to July to test this out.\n\n\n\n\n\nThe involvement extended beyond Lido's existing Node Operators to include solo stakers, community stakers, and various professional organizations. This diversity of participants is crucial for a robust test of the DVT system.\n\n\n\n\n\nImagine a group of people (or in this case, computers) who need to agree on something before taking action. In Lido's test, they created teams, or \"clusters,\" each with a different number of members. Some teams needed most members to agree before acting, while others required nearly all members to agree.\n\n\n\n\n\nEach team had a leader responsible for organizing things and ensuring everyone was ready to work together. These teams comprised different types of participants – some were experienced with Lido's system, while others were new and came from the wider community.\n\n\n\n\n\nThe main task for these teams was to handle Ethereum transactions. They had to set up their systems following specific instructions and then work together to process transactions. Despite some initial challenges, most teams did well, showing they could handle transactions reliably and quickly.\n\n\n\n\n\nThe results were encouraging. After fixing some early problems, the teams worked better, showing that this method could be reliable in the long run. Lido plans to improve this system and eventually use it in the real world, not just in tests.\n\n\n\n\n\nThey want to make the process more secure and efficient and invite more people to join in future tests. This could lead to changes in how Ethereum transactions are handled, making the process more decentralized – not controlled by just one computer or a small group.\n\nDVT in the Broader Context of Blockchain and Cryptocurrency\n\nDistributed Validator Technology (DVT) offers a notable departure from traditional validator models in blockchain networks, representing a significant advancement in blockchain security and decentralization. In many blockchain systems, especially those using a Proof-of-Stake (PoS) mechanism, individual nodes or a small group of nodes often handle validation.\n\n\n\n\n\nWhile these conventional models are somewhat effective, they tend to concentrate power and responsibility in a few hands, leading to potential centralization issues. This concentration can create security risks and uneven distribution of rewards and governance influence. DVT changes this by spreading the validator's duties across several nodes, diluting the influence of any single validator and leading to a more democratic, decentralized network. This approach improves security by minimizing failure points and creates a fairer system with wider participation.\n\n\n\n\n\nThe implementation and success of DVT in Ethereum could profoundly impact other cryptocurrencies and the future of blockchain technology. As blockchain networks grow and need to become more secure, efficient, and decentralized, DVT offers a model for enhancing these aspects. Its adoption might inspire new blockchain innovations, leading to more advanced, secure decentralized systems. The principles and methods of DVT could be adapted in various ways across different blockchain designs, possibly setting a new standard for validator operations in the broader blockchain field.\n\n\n\n\n\nThe wider implications of DVT for the cryptocurrency ecosystem and stakeholder trust are significant. In a field where trust is crucial and concerns about centralization and security are common, DVT presents a practical solution to some key issues. By promoting a more decentralized and secure validation process, DVT boosts the overall trustworthiness of the network.\n\n\n\n\n\nThis can increase confidence among stakeholders, not just in Ethereum but across the blockchain and cryptocurrency sectors. Knowing that they are part of a securely and fairly managed system is invaluable for users, investors, and developers. This increased trust and security could lead to broader adoption, more innovation, and a stronger, more resilient cryptocurrency ecosystem. Therefore, DVT is more than a technological advance; it marks a critical step in the growth and development of the blockchain and cryptocurrency world.\n\n\n\n"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxOWENrSy1wcDN3cmhheWlzNXF0R0ZPaWxxLWVJaWFvYnRTbnRVcnhKMHMxc3h2WkNaeUlWcGRFaDh2TkkyWHJIY3JuV0JaWVFZMnplZ1VSRDNWNUFMeU5TRjhCUmw5Q3M1RlExS3dPV0NWUGZxZE40enJGZVUyc004SXB1QU51aFExNFZGQU1aVXBqT2RVZG800gGfAUFVX3lxTE5SMXdmLWhSck1mcTRtZHdMd0VfcWw4UVFvdHRJbzdPWUgxMkNRSXV4WUVibHJXY25xbFFiNk1taVV0QnJ4YzFJeURHZ3UyVkM4VVhqeEFnbmlDX3lmdW9LTmpuRWlpb2dmZHNHV3hxUW0wZGFwdWNMczVFcmQwRDVxT2R2aTBwZEpQZ1QyeFlLbC1lczlQTTd0SlBmRjRpaw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 28 Jan 2024 08:00:00 GMT",
        "title": "What Is Ronin? The Ethereum Gaming Chain Behind 'Axie Infinity' and 'Pixels' - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIn the wide world of crypto, there are now many blockchains specifically designed for gaming—but Ronin was among the first to launch.\n\nGaming blockchains are typically built to offer low transaction fees and a higher number of potential transactions, so they’re supposed to be more affordable and more scalable than blockchains like Bitcoin and Ethereum. Some gaming chains are also private, meaning that developers must gain approval from a blockchain’s creators in order to join its ecosystem.\n\nRonin is one of those examples—at least for now, though founders have said they intend to open it up sometime in 2024 for more studios to build on. In the meantime, games like Pixels and Axie Infinity are drawing players to the Ethereum sidechain network. Here's what you need to know about it.\n\nWhat is Ronin?\n\nAD\n\nAD\n\nRonin is a gaming-centric Ethereum sidechain designed to handle transactions at a much faster and cheaper rate than Ethereum's own mainnet. The Ethereum Virtual Machine (EVM) compatible chain originally launched back in February 2021.\n\nIt originally launched a “proof of authority” blockchain (PoA), meaning individuals Ronin deems reputable run validator nodes, a type of computer software, to confirm transactions on its blockchain. One common criticism of the PoA method, however, is that a lot of trust must be placed in a smaller number of validators—so it’s less decentralized than other methods.\n\nIn March 2022, the Ronin’s bridge experienced a massive $622 million hack. The bridge connects Ronin to Ethereum. The U.S. Treasury blamed North Korean hackers for the attack—and some of the lost funds were eventually recovered. Affected users were fully refunded by the Ronin network and developer Sky Mavis in June 2022.\n\nIn April 2023, the Ronin blockchain switched to the delegated proof-of-stake mechanism (DPoS), meaning that it no longer operates as a PoA blockchain. DPoS allows for more decentralization, as now any Ronin (RON) token holder with at least 250,000 RON staked on its blockchain can “delegate” or select validators for the network.\n\nWhat is RON?\n\nThe Ronin token, also known as RON, is the gas token for the Ronin blockchain. Ronin network users need a bit of RON to pay for transactions on the blockchain. RON can also be staked to participate in the blockchain’s aforementioned DPoS mechanism, or can be staked for other decentralized finance (DeFi) purposes.\n\nAD\n\nAD\n\nRON set an all-time high price of $4.45 in March 2024, beating the long-standing record from 2022. Ronin's token has gained substantially so far in 2024 on the back of hype around Pixels and other games launching on the network, along with a broader markets upswing led by Bitcoin and Ethereum.\n\nWhat is the Ronin Wallet?\n\nSky Mavis’ Ronin Wallet is a crypto wallet for the Ronin blockchain ecosystem that exists as both a web browser extension and a mobile app for iOS and Android devices.\n\nIn early 2024, the mobile wallet’s developers announced new features in an effort to expand its capabilities, adding support for other blockchains like Ethereum sidechain Polygon and the EVM-compatible BNB Chain. It’s also added Binance Pay as a feature, which allows users to buy some of the Ronin ecosystem's tokens.\n\nOther tokens running on Ronin include Axie Infinity's AXS governance token and Smooth Love Potion (SLP) rewards token, Pixels' PIXEL token, and Apeiron's APRS ecosystem token.\n\nWhat is Sky Mavis?\n\nSky Mavis is a crypto tech startup founded in 2018 that created both the Ronin blockchain and its flagship game, Axie Infinity. Sky Mavis has five co-founders: Trung Nguyen, Aleksander Larsen, Jeffrey Zirlin, Viet Anh Ho Sy, and Tu Doan.\n\nAccording to Tracxn data, Sky Mavis has 26 institutional investors, with Animoca Brands and Andreessen Horowitz (a16z) among them. Sky Mavis has raised $311 million in funding at time of writing, per Tracxn, with its latest round a Series B that raised $150 million in April 2022. That round was raised to help refund Ronin users after the aforementioned hack.\n\nWhich games are on Ronin?\n\nSky Mavis' own Axie Infinity launched the network, and it's a Pokémon-inspired play-to-earn game where players can fight each other in battles where they must pit axolotl-inspired creatures called “Axies” against each other. Every Axie is an NFT that can be bought and sold. Thanks to a recent update, some Axies can now be upgraded, too.\n\nMore recently, Pixels has been the network's biggest hit, delivering a social farming simulation akin to Stardew Valley and Harvest Moon, but with crypto incentives and NFT land plots. The game has attracted millions of players, initially fueled by its play-to-airdrop campaigns—but the buzz is still going after the token launch.\n\nAD\n\nAD\n\nBeyond Axie and Pixels, Sky Mavis has started to onboard other external game developers onto the Ronin blockchain, adding games like Apeiron, The Machines Arena, Kaidro, Tribesters: Island of Solas, and Civitas, to name a few. But some games have left Ronin too—such as Zoids Wild Arena and Battle Bears.\n\nWhat's next for Ronin?\n\nAlong with plans to open up the network to all builders at some point, Sky Mavis has also shared how it plans to expand the network to meet future demand. In April 2024, the company detailed plans to implement zero-knowledge rollups, tapping zkEVM tech to help grow the network in the coming years.\n\nRonin will become more Ethereum aligned. We are Ethereum’s best chance at onboarding everyday people. We’ve been doing it for 6 years but get no recognition since we aren’t a true L2 yet. We will be the #1 ETH L2 by adoption. https://t.co/ekmUWVNmfZ — Jihoz.ron (@Jihoz_Axie) April 3, 2024\n\nIn a tweet, Sky Mavis co-founder Jeff Zirlin wrote that Ronin will \"become more Ethereum-aligned\" as a result.\n\nEdited by Andrew Hayward\n\nThis story was originally published on January 28, 2024 and last updated with new details on April 8."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxNRDFJWVJoQ0M4NE1RTGlkUVZ1dllyZUJDT0M1ZGRrcmNodzZkWF9PT3hhSjNkUjk3aGNoOTE3RWhnd3lTTTRHNEpLdExoSU52TDFBYkdGd0xQOTlQV3NfcUVKWUZ2UE1uejB4eVdTVFU1OHdiMkZtZ3czclRaWXJLaHptak50a3FTbHJnQUlWLW5jeTVFYXlyWThUbHNhZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Jan 2024 08:00:00 GMT",
        "title": "Sei bets on ‘EVM parallelisation’ to lure Ethereum developers — but it’s not alone - DLNews",
        "content": "Sei Labs is rolling out an upgrade that it hopes will attract Ethereum developers.\n\nHowever, it is not the only layer 1 competing in the crowded market.\n\nSei Labs, the company behind the layer 1 blockchain Sei, is betting on its Sei v2 upgrade to attract developers and remove barriers for those looking to deploy DeFi protocols on its blockchain.\n\nIt will allow developers to deploy protocols from Ethereum — the biggest blockchain ecosystem with over $57 billion worth of DeFi deposits — on Sei without having to reconfigure their code.\n\n“Going to a new execution environment is very risky,” Sei co-founder Jay Jog told DL News. “If you don’t completely understand it, and you create even one small, tiny bug, that could result in your entire smart contract getting completely drained.”\n\nInvestor deposits ($) in Sei, as measured by total value locked on DefiLlama\n\nSei v2 is scheduled to go live in the first half of 2024 and will remove that risk for developers, Jog said.\n\nSei Labs is betting that Ethereum developers will opt to build on faster blockchains like Sei as the industry is growing more focused on interoperability, referring to the push to connect disparate blockchain ecosystems.\n\nTapping into Ethereum\n\nEthereum is currently where the vast majority of blockchain development takes place. A recent report from Electric Capital found that 71% of smart contract code was initially deployed on Ethereum.\n\nAlthough Ethereum is the birthplace for the majority of blockchain code, developers also frequently opt to deploy their projects on alternative blockchains that boast higher speeds and reduced transaction fees.\n\nBlockchains like Solana or Cardano have had a hard time attracting Ethereum developers because they use software that is incompatible with Ethereum’s. Solana uses its own custom-made solution, while Cardano uses a UTXO model.\n\nJoin the community to get our latest stories and updates\n\nThis has created an opportunity for Sei and similar projects looking to court Ethereum devs.\n\nNeon EVM, an Ethereum-compatible layer 2 blockchain built on top of Solana, and Monad, a yet-to-be-launched blockchain, also offer Ethereum developers routes to deploy their code on a more performant blockchain without having to make alterations to it.\n\n‘The EVM is here to stay’\n\nCurrently, blockchains fall into one of two broad categories: those that are compatible with the Ethereum Virtual Machine — or EVM for short — and those that are not.\n\nEVM-compatible blockchains make it easy for Ethereum developers to build on them, but many of those chains are prone to transaction congestion and high fees.\n\nWhile some EVM-compatible blockchains find a way around this using technologies like zero-knowledge proofs, such blockchains are still relatively new.\n\nOn the other hand, blockchains that use different software, like Sei and Solana, can achieve much higher transaction speeds.\n\nSei’s answer to this situation is to upgrade its current architecture to make it fully compatible with Ethereum — a request that’s at the top of developers’ wishlist, Jog said.\n\n“The EVM is here to stay,” Jog said. “It’s not necessarily the cleanest and most elegant execution environment to be using, but it is the one that has already gotten most market share.”\n\nSei currently requires developers to write their protocols using programming languages like Rust or C++. But after the Sei v2 upgrade, they will be able to use languages like Solidity and Vyper that are popular with Ethereum developers.\n\nEVM parallelisation\n\nSei already achieves high transaction speeds compared to other blockchains. To maintain these high speeds while also letting developers use the EVM, Sei is implementing a technique called EVM Parallelisation.\n\nThis allows Sei to run multiple execution environments that can simultaneously process transactions instead of having to process transactions one after the other, as most blockchains do.\n\nSei is not the only blockchain leveraging EVM Parallelisation.\n\nNeon EVM also uses EVM Parallelisation to let Ethereum developers tap into Solana.\n\nInvestors deposits ($) in Neon, as measured by total value locked on DefiLlama\n\nBut unlike Sei v2, where both EVM and non-EVM protocols will live on the same blockchain, Neon EVM is its own separate blockchain.\n\nThat means users must first bridge their assets to Neon EVM, introducing a point of friction, which hasn’t prevented Neon from making inroads with Ethereum developers.\n\nStiff competition\n\nAave, the biggest lending protocol on Ethereum with over $7 billion worth of investor deposits, recently polled its token holders on whether it should deploy its v3 version to Neon EVM. The vote ended with over 83% of token holders signalling support.\n\nMonad, a soon-to-be-launched blockchain, is also promising developers EVM compatibility and fast transactions.\n\nBoasting a proprietary consensus algorithm, Monad claims it will achieve processing capabilities of up to 10,000 transactions per second upon its launch later this year.\n\nAlthough Neon EVM has a head start, the competition between these three EVM Parallelisation projects is only just beginning.\n\nSEI token price ($)\n\nSuccess isn’t guaranteed.\n\n“It’s not ‘if you build it, they will come,’” Jog said. “Because there’s been dozens of other chains where no one has gone.”\n\nIn addition to Sei Labs’ focus on parallelisation, the Sei Foundation, an affiliated nonprofit that supports the Sei ecosystem, plans to launch a grants programme for those looking to develop on the Sei blockchain."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxNQi1ET25ieGlzUVpBLUFZaWctdEZmcTJRdGJLN1JjX1RHN3lPQW45U3QzSnJOZV9UZlNvdFRqNEZKQnljb1BoMzJzeGN6dURRem1Za0RHYzRuRDV2bi1XVW9TMlIwWE4yOGNzaVRZY3B2ckx0T0JyLUhza201WmdmVXpyM1BTYVhkV0RxR3o4QlBad3BtMXVOVmRGbzlCZlhVNkVDZ1VDVTVscHk1ZTBjN1d1aEN5T3ZxU0wzUlR4SjZEZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 28 Jan 2024 08:00:00 GMT",
        "title": "Massive Ethereum Update Is Here: All You Need to Know About Prague By U.Today - Investing.com",
        "content": "U.Today - The network is on the cusp of a major upgrade, one that is set to bring significant improvements and changes to the platform. This upcoming update is called the Prague upgrade, also referred to as the Pectra upgrade, and has been a hot topic in the Ethereum community.\n\nTestnets are essential staging grounds for new features, and the Dencun upgrade will first roll out across several testnets: Goerli on Jan. 17, Sepolia on Jan. 30 and Holesky on Feb. 7, 2024. These testnets will allow developers to fine-tune the upgrade in a controlled environment, ensuring everything operates smoothly before going live on the main network.\n\nSource: Tim Beiko on Ethereum MagiciansThe core development team is currently in a debate over prioritizing the implementation of Verkle trees, a data structure that would optimize storage and access to information on Ethereum. While some developers advocate making Verkle trees the sole focus, others suggest pursuing a smaller feature fork alongside the Verkle development.\n\nThe main argument for concentrating solely on Verkle trees stems from their complexity and the time investment needed to implement them effectively. This could mean that if Verkle trees become the next priority, no new execution layer (EL) features might appear for 12 to 24 months, or possibly longer.\n\nNevertheless, there is an understanding that even if the focus shifts to Verkle trees, minor updates to the Ethereum Layer (EL) might still be necessary. For example, changes to the gas limit for data availability are crucial for Ethereum's scaling solutions and require coordination across both the execution layer and the consensus layer (CL).\n\nThe Prague upgrade is set to include various proposals that aim to refine the Ethereum platform on different layers, including precompiles for specific cryptographic operations, a new EVM object format (EOF) and modifications to smart contract capabilities.\n\nThe Prague upgrade promises to be a significant event that will shape the future of the Ethereum ecosystem. It is a step forward in ensuring that Ethereum continues to offer a secure, efficient and scalable platform for decentralized applications.\n\nThis article was originally published on U.Today"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQdDJKMEdOYWw0RDFEcjZGLURTaG5EVVdMV2pTd2RuNWR4dWJObHFjYjZnLVZUUlpsOXBFeGZaQTkyQTJXeXNVcHN2YXFvNV80ZlJabDlyd1U2c0Q2amxRVDE4TG1LX2Rsc2M0aUROcXAyenprTVJvSDdNYzNSNXJ0dUNlcnhXVV9SYVHSAZIBQVVfeXFMT1d3bWYxdFlneW1Bc0FqUlB6MDRhN0ROQk5lM2xMejk1Mmc5SnBpVWxRbVE0bktRN0RhQXFGZXd5djVROEFxS21PSC1zX1RJQkNndEcxT1V4T1I1RjJHLWJoS0MxSzI2cXhkMWJRYUZibXR3OTIxb25fc1IybnNBbTRpb2NEN19vdEN0VWZBckdLYlE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Jan 2024 08:00:00 GMT",
        "title": "Solana Flips Ethereum in DeFi Trading as Jupiter Airdrop Nears - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nToken trading on Solana decentralized exchanges briefly flipped that of Ethereum exchanges in December as meme coin mania raged, and now it’s happened again—this time ascribed to an impending token airdrop.\n\nAs of Sunday night, rolling 24-hour trading volume on Solana-based decentralized exchanges (DEXes) topped Ethereum exchanges, according to data from DeFi Llama, with about $705 million on Solana during the span compared to $698 million on Ethereum.\n\nEthereum is back on top as of this writing, but the networks remain close: DeFi Llama shows about $742 million in Ethereum DEX trading over the last 24 hours, while Solana remains steady right around $705 million. Ethereum is well ahead in terms of seven-day volume, however, at $8.9 billion compared to less than $4.5 billion for Solana.\n\nEven so, the recent short-lived reversals show that the long-dominant Ethereum is facing increasing pressure from Solana, as the rival chain offers much cheaper and faster transactions. That was the case in December when trading on Solana meme coins like BONK and Dogwifhat (WIF) helped spike DEX volume.\n\nAD\n\nAD\n\nNow, the culprit appears to be the impending launch of JUP, the official token of the popular Solana decentralized exchange aggregator Jupiter. It’s set to debut on Wednesday with nearly a million wallets eligible to claim a share of JUP tokens.\n\nAccording to data from CoinGecko, Solana trading volume on Jupiter topped that of leading Ethereum DEX Uniswap V3 late Sunday, though much like with the broader chains, those places have already swapped as of Monday morning.\n\nUniswap V3 has over $629 million worth of trading volume over the past 24 hours, while Jupiter has about $571 million in DEX trading on Solana during that span.\n\nIt’s unclear whether any recent trading will actually factor into Jupiter airdrop eligibility, however, as the protocol took a snapshot of early users on November 2. It said that some 955,000 wallets would be eligible for the eventual drop, which is now set to take place on Wednesday. However, Jupiter has additional tokens planned for future airdrops.\n\nAD\n\nAD\n\nJupiter’s launchpad was used for last week’s WEN meme coin drop as a test run ahead of the JUP drop. More than a million wallets were eligible for the WEN airdrop, though the claim only lasted until Monday morning—with over 280 billion WEN left unclaimed.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxNOTcyd0lLMHlLaTJONlVfXzh1eElGQmtXREJkRmllM1ZEVGFWQ3FjS3RtalFrVzVYdGhVQ0tvaHZoenBRcTdBMENyejREbFhybTNjcUREM2VnRHI3SHhQclFQU09GeWVRd2k1enZaZzJYM3hORktNa1Z0NUxESDBnTl93Tng0VEV4NjktVmpVUTF6MmplaHfSAZsBQVVfeXFMT2ZTYlJuaFdVR3pvbzVmLWtyME15S1lXcEQ3TjVaQmZNVmIzWDhXMnlsVWNCWnBmSGt1VkNIN2FEUi1WMDlFMGNCeV91bWtzWHJhQnBVVmRFTjJ4M1pubjN0OGRJTkJaOWJHdFdEY2hHUDJWM0hscGhTQXBQWGlFSzJSUExEVV9nQnVZRkZ5UWNnekduZElfUnBsQXM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 28 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin vs Ethereum: Numbers Explain Which Has Higher Growth Potential - CoinGape",
        "content": "Over the past week, Bitcoin (BTC) price action has been sluggish. However, it has now moved above the $40K mark, indicating a potential recovery path. Ethereum (ETH) also clocked significant losses over the week but has now managed to neutralize its position.\n\nOn Saturday, Bitcoin’s price stood at a level close to $42,200, marking a daily increase of 1% as per CoinGlass data. The trading volume in crypto derivatives dropped significantly, down 55% to $21.50 billion. Despite this, Bitcoin’s total market value stayed at $828.78 billion, with open interest (OI) for Bitcoin reported at $17.98 billion. 24-hour liquidations surpassed $13.37 million, indicating sell pressure.\n\nadvertisement\n\nIn comparison, Ethereum was priced close to $2,280, with a modest daily increase. The amount traded fell by nearly 50% to $8.44 billion, while its total market value was $275.03 billion. Ethereum’s OI stood at $7.79 billion, with liquidations totaling $4.35 million.\n\nBTC vs ETH: Key metrics analysis\n\nIntoTheBlock’s metrics reveal insightful details about the two cryptocurrencies. Bitcoin’s large transaction volume decreased by 39.08% to $25.93 billion, indicating a decrease in high-value transactions. Daily active addresses increased by 7.76% to 979,300, reflecting a rise in user activity. The holder’s balance slightly rose to $581.26 billion. Notably, exchange netflows saw a significant drop of 129.87% and touched negative $71.71 million. The whale participation rate stood at 2.31%. Currently, 82.45% of Bitcoin holders are ‘in the money,’ showing a positive investment return.\n\nFor Ethereum, the large transaction volume also decreased by 49.58% to $2.14 billion. Daily active addresses were at 595,640, up by 9.94%. Ethereum’s holder’s balance increased to $218.04 billion. Exchange netflows showed a dramatic decrease of 405.1% and touched negative $96.24 million. Ethereum whale participation rate was significantly higher at 36.89%, with 71.70% of holders ‘in the money.’\n\nBoth Bitcoin and Ethereum are experiencing a decline in large transaction volumes, which implies a relatively reduced trading interest from investors. The negative exchange netflows for both suggest that users are moving their holdings out of exchanges.\n\nIntoTheBlock also noted that Bitcoin and Ethereum saw over a 30% decrease in transaction fees, attributed to reduced market volatility and less urgent need for transactions among users.\n\nBitcoin and Ethereum fees declined over 30% as market volatility decreased, leading to relatively less urgency amongst users transacting pic.twitter.com/Bk3Wd1SblY — IntoTheBlock (@intotheblock) January 26, 2024\n\nWhat are analysts betting on?\n\nCrypto analyst Michaël van de Poppe recently said in a post on X, “I personally believe that #Ethereum is going to outperform #Bitcoin in the upcoming period and it has started since the ETF approval.”\n\nHe pointed out a ‘massive weekly bullish divergence’ and crucial resistance at 0.06 BTC. Van de Poppe also anticipates further consolidation before a potential market uptrend.\n\nAlso Read: Top Crypto Analyst Compares Investment Potentials Of Bitcoin (BTC) & Ethereum (ETH)\n\nShraddha Sharma Shraddha's professional journey spans over five years, during which she worked as a financial journalist, covering business, markets, and cryptocurrencies. As a reporter, she has placed particular emphasis to learn about the market interaction with emerging technologies.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiV0FVX3lxTE9OY1paUERMSzdVZ2tRdU5VQ2hjd3hwdFQ4U182U1RsNlBZVzI5Yk9JUEdXUVgtTEhnVlZfc1huSHpWUXdNcTA1Q09tcHhfZjd0eGdYaTNFQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Jan 2024 08:00:00 GMT",
        "title": "How to bridge to Arbitrum - OKX",
        "content": "Arbitrum is a popular Ethereum Layer 2 (L2) solution, making bridging in and out of it essential. Arbitrum uses a method called “optimistic rollup,” where smart contracts are executed off-chain and only the final output is posted to the Ethereum blockchain. It has a significantly larger transaction throughput, making it faster and cheaper than Ethereum. Arbitrum is also an Ethereum equivalent blockchain, making it easy for developers to move their applications from the Ethereum chain.\n\nOften, blockchains are self-contained and can't communicate with other chains. Blockchain bridges exist to address this limitation. These bridges enable users to transfer their funds between different chains easily. Cryptocurrency bridges promote interoperability among blockchains and enhance the ease of transferring digital assets. The potential of decentralized applications (DApps) lies in the ability of users to easily move from one chain to another.\n\nPreparing for bridging: wallet and asset selection\n\nChoosing the right wallet\n\nThe first step before using an Ethereum to Arbitrum bridge is to choose the right wallet.\n\nOKX provides a highly secure and multi-chain OKX Web3 Wallet with all OKX accounts. It can safely store ETH or any other cryptocurrency across multiple chains for as long as needed. Additionally, the OKX Web3 Wallet features bank-grade security and inbuilt access to hundreds of DApps and the OKX NFT Marketplace.\n\nSelecting assets for bridging\n\nTo begin with, it’s necessary to confirm the asset is compatible before transferring a cryptocurrency between different chains. In this example, we'll move ETH from the Ethereum mainnet to Arbitrum One. ETH is the only requirement since it is the native currency on both networks. It's used on both the Ethereum blockchain and Arbitrum One to cover transaction fees.\n\nTo bridge a different asset like USDT, make sure that Arbitrum supports USDT. One easy way to do this is to check the bridge. If USDT is available, you should be able to bridge it. However, also make sure you have ETH on Arbitrum to pay for gas fees after you bridge the USDT.\n\nExploring bridge services\n\nDecentralized bridge services\n\nWe suggest using OKX Swap as a reliable cross-chain bridge for transferring ETH to Arbitrum. By aggregating prices from various decentralized exchanges, OKX provides the most optimal route, reducing both slippage and network fees.\n\nArbitrum also provides its own solution, Arbitrum Bridge. However, it has a restricted range of supported cryptocurrencies and doesn't provide swapping capabilities. Other options you can check out are Meson and Stargate.\n\nCentralized bridge services\n\nAn easy way to bridge to Arbitrum is by using centralized exchanges. This involves first transferring your digital assets to OKX on a specific blockchain, then withdrawing them on a different chain like Arbitrum.\n\nThe following guide explains how to bridge ETH from the Ethereum blockchain to Arbitrum using OKX Exchange:\n\nStep 1: Create an account on OKX.\n\nStep 2: After logging in, go to the \"Assets\" section in the top-right corner and choose \"Deposit.\" If you don't have ETH, you can purchase some on OKX and bypass the deposit process.\n\nStep 3: Select “ETH” as the crypto and “ETH-ERC20” as the deposit network.\n\nStep 4: Transfer ETH to the provided address. It may take a few minutes for the ETH to arrive in your account and become available.\n\nStep 5: After your funds are available, head back to the \"Assets\" section and choose \"Withdraw.\"”\n\nStep 6: Choose \"ETH\" as the cryptocurrency and opt for \"On-chain\" as the withdrawal option.\n\nStep 7: Type in your Arbitrum address and select the network as “ETH-Arbitrum One.” Enter the amount of ETH you want to bridge to Arbitrum and hit next. After verifying your account, the ETH will be deposited into your wallet in a matter of minutes.\n\nOne convenient method for transferring your assets is through an exchange, as it removes the concern for slippage and network fees.\n\nChoosing a bridge service\n\nBoth centralized and decentralized cryptocurrency bridges are good choices. Decentralized bridges, in particular, allow for quicker movement between chains. However, they do have drawbacks, such as high fees and slippage. It's essential to prioritize security when selecting a decentralized bridge and opt for a well-established one with a proven track record.\n\nBridging process: a step-by-step guide\n\nTo bridge ETH to Arbitrum, you'll need to link your wallet to the bridge and transfer your assets. We'll be using the OKX Web3 Wallet and OKX Swap for this process, but it should be similar if you prefer to use a different wallet or bridge service.\n\nConnecting to a bridge service\n\nStep 1: Head over to OKX Swap.\n\nStep 2: Choose \"Connect wallet\" located in the upper right corner, then opt for \"OKX wallet extension\". Or, if you prefer to use a different wallet provider such as Metamask or Phantom, select \"Other\" and choose your preferred wallet.\n\nStep 3: To connect your OKX wallet and OKX Swap, enter the password for your OKX wallet, and then select \"Confirm\".\n\nTransferring assets to Arbitrum One\n\nOnce you’re connected to OKX Swap, you’re ready to bridge ETH to Arbitrum.\n\nStep 1: Adjust the bridge settings and specify the quantity of ETH you wish to bridge in the \"Swap & Bridge\" section.\n\nSelect “Ethereum” as the “from” chain and type in the amount of ETH you want to bridge. Select “Arbitrum” on the “To” chain and token “ARB_ETH.” OKX Swap will automatically show you the amount of ETH you’ll get.\n\nStep 2 (optional): This step isn't required, and we recommend you only complete it if you understand slippage and bridges well.\n\nNetwork fee: This calculates the Ethereum network's cost for bridging. Slippage: Slippage refers to the level of flexibility you’re willing to allow for price fluctuations. By setting the slippage to 0%, OKX swap guarantees you'll receive exactly 0.49872 ETH, as indicated. The transaction will be voided if the price fluctuates, and you'll be charged a network fee. Allowing for some slippage is important when the pool has limited liquidity. Trading route: OKX Swap isn't a bridge but rather a DeFi aggregator that automatically selects the most suitable bridge to Arbitrum for you. However, you have the option to manually change the service if wanted.\n\nStep 3: Select “Swap across chains.” When your wallet pops up, confirm the transaction.\n\nOKX Swap is a convenient DeFi tool to get your cryptocurrencies across bridges and swap them along the way.\n\nOKX Swap and other bridges can serve as bridges between Arbitrum and ETH in both directions. To perform an Arbitrum to ETH bridge, the primary network must be selected as Arbitrum and the secondary network as Ethereum.\n\nUnderstanding fees and timelines\n\nFee structures explained\n\nThere are multiple fees involved in a decentralized bridging process:\n\nEthereum gas fees: To use OKX Swap and send your ETH, you must pay a transaction fee to the Ethereum network. Bridge fees: OKX Swap acts as a hub for connecting bridges. As part of the bridging procedure, a small charge is imposed by the bridge. Arbitrum transaction fees: Similar to the gas fee on Ethereum, a transaction fee is imposed on Arbitrum to enable the transfer of ETH from the bridge to your Arbitrum wallet. Conversion fees: There's an extra charge when you bridge between cryptocurrencies. For example, if you want to send USDT from Ethereum but want to receive ETH on Arbitrum, there willl be a fee for converting USDT to ETH.\n\nBefore the transfer, you can check the conversion and bridge charges using OKX Swap. However, the Ethereum gas fee will only be visible in the OKX Web3 Wallet pop-up when verifying the transaction.\n\nExpected transaction times\n\nJust like the fee involved, transaction time also depends on multiple factors:\n\nEthereum confirmation time: The duration it takes for ETH to move from your wallet to the bridge is dependent on the amount of gas used. With sufficient gas, the process should only take a few seconds. Bridge processing time: The duration of asset transfer between chains varies depending on the bridge being used. For OKX Swap, the trading route can be viewed in advanced options to determine its time. Arbitrum blockchain confirmation time: Once the bridging process is complete, the ETH will be sent to your wallet. With Arbitrum's efficient processing speeds, it should reach your wallet almost instantly.\n\nSecurity measures and best practices\n\nSecuring your transactions\n\nWhen using a cryptocurrency bridge, it's important to remember that you’re interacting with a smart contract that can access your wallet. It's possible for malicious smart contracts to withdraw funds from your wallet without your awareness. For safer crypto transactions on bridges, we recommend the following.\n\nMake sure you’re using a trustworthy bridge with a proven track record in the market. Avoid using your primary wallet to engage with bridges and other decentralized applications. Keep a separate cold wallet for storing your assets. Use tools like Revoke to block access to your wallet once bridging is complete.\n\nAn effective approach for minimizing these dangers is to use a centralized exchange for bridging purposes. As a leading global cryptocurrency exchange, OKX employs world-class security measures to protect users and allow them to buy and sell BTC safely and seamlessly. Visit our security of funds and Proof of Reserves page for more details.\n\nAvoiding common pitfalls\n\nHere are some of the common pitfalls you can avoid while you’re bridging your assets to Arbitrum:\n\nMake sure to review all the information you enter before submitting it. Once you confirm the transaction, there's no option to reverse it. Be mindful of the gas fees. When the Ethereum network is congested and in demand, ‌gas fees may rise. You can either wait for the fees to decrease or use a centralized exchange to bridge. High slippage and liquidity issues are another aspect to look out for. Using a bridge that isn't well-known or bridging to a coin with low trading volume may result in significant slippage. To prevent this, use bridges for assets with abundant liquidity.\n\nTroubleshooting and support\n\nCommon bridging issues and solutions\n\nMany users struggle with transactions getting stuck due to insufficient gas fees. In congested situations, transactions may also get stuck on bridges, but they're designed to handle this and will eventually be resolved. Just be patient and wait. Cross-chain compatibility: Before bridging, make sure the asset you’re using has sufficient liquidity and is compatible with the chain.\n\nWhere to find support\n\nIt’s usually not difficult to find support in the crypto community should you encounter any problems.\n\nIf you have issues with OKX Swap or Exchange, visit OKX Support for FAQs and chat with the team for help. Always use official support resources and watch out for scams."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiV0FVX3lxTE1zT1RCd28yOUNHbnBkYjNuZXNTYVZ0UnFKUnVBN3N4X1RxVENZOXo4a2I2Z2RfM3IycmFIdHBqT01MMk1NVVJQc1g2OEE4QlowdXI3by14MA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Jan 2024 08:00:00 GMT",
        "title": "How to bridge to Optimism - OKX",
        "content": "Optimism is a popular Ethereum Layer 2 (L2) blockchain designed to increase scalability. As a result, bridging is an essential part of using the technology. Optimism increases efficiency by processing transactions off Ethereum and periodically syncing them. This results in transaction fees and processing speed being significantly lower than Ethereum, making Optimism one of the most popular Ethereum L2 solutions.\n\nBlockchains are typically isolated systems and can't interact with other chains. The purpose of blockchain bridges is to address this issue. Through blockchain bridging, individuals can efficiently transfer their funds between different chains. These cryptocurrency bridges promote compatibility between blockchains and streamline the process of transferring digital assets. The future of decentralized applications (DApps) is multi-chain, as some chains are built for specific purposes.\n\nPreparing for bridging: wallet and asset selection\n\nChoosing the right wallet\n\nThe first step before using an Ethereum to Optimism bridge is to choose the right wallet.\n\nOKX provides a highly secure and multi-chain OKX Web3 Wallet with all OKX accounts. It can safely store BTC or any other cryptocurrency for as long as needed. In addition, the OKX Web3 Wallet features bank-grade security and inbuilt access to hundreds of DApps and the OKX NFT Marketplace .\n\nSelecting assets for bridging\n\nBefore bridging a cryptocurrency from one chain to another, the first task is to confirm that the asset is compatible. In this article, we'll be moving ETH from the Ethereum mainnet to Optimism. This process only requires ETH, as it’s the primary currency on both chains. On both the Ethereum blockchain and Optimism, ETH is used for covering gas fees.\n\nTo bridge a different asset like USDT, you must make sure that Optimism supports USDT. One easy way to do this is to check the bridge. If USDT is available, you should be able to bridge it. However, make sure you have ETH on Optimism to pay for gas fees after you bridge the USDT.\n\nExploring bridge services\n\nDecentralized bridge services\n\nOur top pick for a secure cross-chain bridge to transfer ETH to Optimism is OKX Swap . By collecting prices from multiple decentralized exchanges, OKX provides the most optimal path, reducing the impact of slippage and network charges.\n\nOptimism also provides its own solution, Optimism Bridge . However, this option supports a limited number of cryptocurrencies and doesn't offer swapping services. Other options you can check out are Meson and Stargate .\n\nCentralized bridge services\n\nOne simple method of connecting to Optimism is through the use of centralized exchanges. By depositing your ETH on OKX using one chain, you can then withdraw it using a different one. The following is a basic tutorial on how to bridge ETH from Ethereum to Optimism through OKX Exchange.\n\nStep 1: Create an account on OKX .\n\nStep 2: Once logged in, head to “Assets” on the top-right and select “Deposit.” If you don’t have ETH, buy some on OKX and skip the deposit step.\n\nStep 3: Select “ETH” as the crypto and “ETH-ERC20” as the deposit network.\n\nStep 4: Send ETH to the displayed address. It may take several minutes for the ETH to be credited to your account and become available for use.\n\nStep 5: Once your funds are ready to be used, go back to “Assets” and select “Withdraw.”\n\nStep 6: Select “ETH” as Crypto and the withdrawal method as “On-chain.”\n\nStep 7: Enter your Optimism address and choose \"ETH-Optimism\" as the network. Enter the amount of ETH you wish to transfer to Optimism and select next. You'll then be prompted to verify your account, and the ETH should appear in your wallet in a few minutes.\n\nUsing an exchange to connect your assets is among the simplest approaches, as you don't encounter slippage or network fees.\n\nChoosing a bridge service\n\nCentralized and decentralized cryptocurrency bridges offer different benefits. Deciding between the two depends on your preferences. Decentralized bridges allow for faster movement between chains but may have high fees and slippage. When choosing a decentralized bridge, prioritize security and choose a reputable one with a strong track record.\n\nBridging process: a step-by-step guide\n\nTo bridge ETH to Optimism, you'll need to link your wallet and send the assets. We'll execute the bridging process by using OKX Web3 wallet and OKX Swap. The steps should be similar for other wallets or bridge services.\n\nConnecting to a bridge service\n\nStep 1: Head over to OKX Swap\n\nStep 2: Select “Connect wallet” in the top right corner, and select “OKX wallet extension.” If you use another wallet provider like Metamask or Phantom, select “Other” and choose your wallet.\n\nStep 3: Enter your OKX wallet password and click \"Confirm\" to connect your OKX wallet and OKX Swap.\n\nTransferring assets to Optimism\n\nAfter successfully connecting to OKX Swap, you can proceed to transfer ETH to Optimism.\n\nStep 1: Adjust the bridge settings and specify the desired quantity of ETH to transfer in the \"Swap & Bridge\" section.\n\nSelect “Ethereum” as the “from” chain and type in the amount of ETH you want to bridge. Select “Optimism” on the “To” chain and token “OP_ETH.” OKX Swap will automatically show you the amount of ETH you’ll get.\n\nStep 2 (optional): This is an optional step. We advise you only do this if you understand slippage and bridges very well.\n\nNetwork fee: the network fee for enabling blockchain bridging. Slippage: slippage refers to the level of flexibility you're comfortable with in relation to fluctuations in prices. By choosing a slippage of 0%, OKX swap guarantees that you'll receive exactly 0.4982 ETH, as displayed. However, if you opt for a higher slippage, the transaction will be voided, and you'll incur the network fee. Allowing for some slippage is important when dealing with pools with lower liquidity levels. Trading route: The OKX Swap isn't a bridge, but rather a DeFi aggregator that automatically selects the most suitable bridge to Optimism for you. However, you also have the option to manually change the service if you want to.\n\nStep 3: Select “Swap across chains.” When your wallet shows, confirm the transaction.\n\nOKX Swap is a convenient DeFi solution for transferring and exchanging your digital assets through multiple bridges.\n\nIn addition to OKX Swap, other bridges can function as bridges from Optimism to ETH. You must choose Optimism as the primary network and ETH as the secondary network.\n\nUnderstanding fees and timelines\n\nFee structures explained\n\nThere are multiple fees involved in a decentralized bridging process:\n\nEthereum gas fees : The cost of transferring your ETH from your wallet to the bridge on Ethereum. Bridge fees: OKX Swap serves as a bridge and swap aggregator, with the bridge charging a small fee for facilitating the bridging process. Optimism transaction fees: Just like the gas fee in Ethereum, an Optimism transaction fee is required for transferring ETH from the bridge to your wallet. Conversion fees: If you opt to switch cryptocurrencies during the process of bridging, there'll be an extra charge. For example, you can convert USDT on Ethereum to ETH on Optimism, but it will come with an additional fee for the conversion.\n\nBefore starting the transfer, you can view the detailed breakdown of conversion and bridge fees on OKX Swap. Keep in mind the Ethereum gas fee will only be displayed on the OKX Web3 Wallet pop-up when you confirm the transaction.\n\nExpected transaction times\n\nJust like the fee involved, transaction time also depends on multiple factors:\n\nEthereum confirmation time: The duration of transferring ETH from your wallet to the Bridge is dependent on the amount of gas used. With sufficient gas, this process should only take a few seconds. Bridge processing time: The duration of transferring assets from one chain to another varies depending on the bridge used. For OKX Swap, this information can be found by selecting the trading route in the advanced options. Optimism blockchain confirmation time: The ETH will be transferred to your Optimism wallet after the bridging process. As Optimism is known for its speed, you can expect the funds to arrive in just a few seconds.\n\nSecurity measures and best practices\n\nProviding secure transactions\n\nWhen using a Cryptocurrency bridge, keep in mind that you’re engaging with a smart contract that has access to your wallet. Malicious smart contracts can be used to deplete wallet funds. To make sure your cryptocurrency transactions on bridges are safe, follow these guidelines:\n\nMake sure you’re using a reputable bridge to Optimism like OKX Swap, which is well established in the market. Don't use your primary wallet for interacting with bridges and other decentralized applications. Instead, keep a separate cold wallet for storing your assets. Use tools like Revoke to remove access to your wallet once you’re done bridging.\n\nUsing a centralized exchange for bridging purposes is an effective method for reducing these risks. As a leading global cryptocurrency exchange, OKX employs world-class security measures to make sure worldwide users can buy and sell BTC safely and seamlessly. Visit our security of funds and Proof of Reserves page for more details.\n\nAvoiding common pitfalls\n\nRead on for some of the common pitfalls to avoid while you’re bridging your assets to Optimism:\n\nMake sure to review all the fields you fill out. Once you confirm the transaction, there's no way to undo it. Be mindful of the gas fees . During periods of high demand and congestion on the Ethereum network, ‌gas fees may reach a high level. It's advised to either wait for the fees to decrease or use a centralized exchange for transactions. High slippage and liquidity issues are another aspect to look out for. You may encounter significant slippage if you use an unfamiliar bridge or bridge to a coin with limited trading volume. To prevent this, restrict your bridging to assets with ample liquidity.\n\nTroubleshooting and support\n\nCommon bridging issues and solutions\n\nStuck transactions are common and can occur when the gas fee for Ethereum isn't set correctly. If the gas is too low, the transaction will fail and the funds will be returned to your wallet. Transactions may also get stuck on congested cryptocurrency bridges. But, they're designed to handle these situations and will eventually be resolved with time. Cross-chain compatibility: Make sure there's sufficient liquidity for the asset you’re bridging and that it’s compatible with the chain every time you bridge.\n\nWhere to seek help\n\nThe cryptocurrency community is known for being supportive. If you encounter any problems, you can easily seek assistance."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxNd1hZVmo3N0pCQ3BnOHAyNE83c0wzanRRdFNLZW0tcWthUE5iY0QyTV9ObGdKTFVfamZHWDBObVhVbmU5cE1NZDQwMnRvYVFJdnp1X0xCTUQ1LWpRSVRIdG1LWnJLcDlycmRCczdZaVlsakx5LXVnYlpJaGE2YmFBOUZBWQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Jan 2024 08:00:00 GMT",
        "title": "What Is ERC-1155 and How Does It Work? - Binance Academy",
        "content": "TL;DR\n\nERC-1155 is a token standard on Ethereum designed to optimize the creation and management of crypto assets.\n\nIt allows the combination of fungible and non-fungible tokens in a single smart contract, streamlining transactions and reducing costs.\n\nERC-1155's secure transfer mechanism and other safety features enhance user confidence and address common challenges associated with sending tokens to incorrect addresses.\n\nIntroduction\n\nEthereum, the blockchain that introduced the world to smart contracts and decentralized applications (DApps), continues to evolve rapidly. Among its notable features are the so-called token standards, which ensure that assets and products built on Ethereum are compatible with one another.\n\nAlong with the ERC-20 and ERC-721, the ERC-1155 is one of the most important token standards on Ethereum. In this in-depth exploration, we'll delve into the intricacies of ERC-1155, understand how it works, and its significance in the blockchain ecosystem.\n\nWhat Is the ERC-1155 Token Standard?\n\nERC-1155, an abbreviation for Ethereum Request for Comments 1155, represents a set of standards designed to enhance the versatility of smart contracts and tokens on the Ethereum blockchain. In the context of blockchain, tokens are digital assets that can either be fungible (identical and interchangeable) or non-fungible (each token is unique). Prior to ERC-1155, these two types of tokens were governed by distinct technical standards, such as the ERC-20 for fungible tokens and ERC-721 for non-fungible tokens (NFTs).\n\nHow ERC-1155 Works\n\nTo comprehend the significance of ERC-1155, let’s imagine a scenario where you interact with a blockchain game that has a diverse set of items like swords, shields, and in-game coins. Before ERC-1155, each of these items required an exclusive set of rules within a smart contract. ERC-1155 simplifies this complexity by enabling all these diverse items to coexist harmoniously within a single smart contract. So, instead of managing separate contracts for each digital item, ERC-1155 consolidates them, streamlining the management of various tokens.\n\nKey Advantages of ERC-1155\n\nIn short, ERC-1155 stands out for its efficiency, adaptability, reduction of redundancy, enhanced security features, and support for various token types.\n\n1. Enhanced efficiency\n\nWith ERC-1155, the transfer of different token types can occur in a single transaction. This capability significantly expedites transactions and reduces associated costs. Imagine sending a sword, a shield, and some gold coins to a friend – all accomplished seamlessly in a single transaction.\n\n2. Versatility beyond gaming\n\nWhile ERC-1155 is very useful for gaming applications, its adaptability extends far beyond this niche. It can effortlessly handle any token type, whether it's currency, collectibles, or specialized tickets. This versatility positions ERC-1155 as a valuable tool for diverse applications across various industries.\n\n3. Reduction in redundancy\n\nPrior to ERC-1155, each token type necessitated its own contract, resulting in redundant copies of similar functionalities. ERC-1155 alleviates this redundancy by consolidating different token types within a single contract, optimizing space utilization, and simplifying token management.\n\n4. Safe transfer mechanism\n\nERC-1155 incorporates a safety feature that allows the reclamation of tokens if inadvertently sent to the wrong address. This represents a significant improvement over previous token standards, providing users with enhanced security and peace of mind.\n\n5. Support for various token types\n\nUnlike its predecessors, ERC-1155 supports not only fungible and non-fungible tokens but also semi-fungible tokens. These tokens, akin to general admission concert tickets, are interchangeable before the show but transform into unique collectibles afterward.\n\nERC-20 vs. ERC-1155 vs. ERC-721\n\nBelow is a short comparison table highlighting the key differences between the ERC-20, ERC-1155, and ERC-721 token standards.\n\nAs we can see, ERC-20 is used for interchangeable tokens like digital currency, ERC-721 is for unique tokens like digital art, and ERC-1155 combines features, offering flexibility for both use cases within a single contract.\n\nWho's Using ERC-1155?\n\nNumerous projects are leveraging the advantages offered by ERC-1155. Notable examples include:\n\nEnjin: a blockchain platform that uses ERC-1155 to power its digital asset and virtual economies ecosystem. Enjin is focused on the creation of NFTs and Web3 assets used in blockchain-based games.\n\nOpenSea: A prominent NFT marketplace leveraging ERC-1155, enabling multiple creators per contract, thus fostering collaboration and creativity.\n\nOpenZeppelin: A provider of blockchain security products utilizing the ERC-1155 standard, underlining its adoption in critical areas of the blockchain ecosystem.\n\nThe Future Landscape of ERC-1155\n\nDespite being in existence for several years, ERC-1155 continues to be underutilized compared to its ERC-20 and ERC-721 counterparts. This may stem from a lack of awareness of its capabilities, but as projects become more familiar with ERC-1155's versatility, migration to this standard may become a natural progression.\n\nThe emergence of play-to-earn games, where players can earn tokens while playing, might help accelerate the adoption of ERC-1155. In addition, decentralized autonomous organizations (DAOs) are also finding utility in ERC-1155, especially those that predominantly operate on-chain and require diverse token types.\n\nThe flexibility inherent in ERC-1155 opens the door to a variety of use cases, many of which have yet to be fully explored. As blockchain technology advances, ERC-1155 is poised to play a pivotal role in shaping the future of digital assets on the Ethereum network.\n\nBenefits of ERC-1155\n\nUser-friendly transactions: With ERC-1155's efficiency, users can expect smoother and more cost-effective transactions, especially when dealing with multiple token types.\n\nExpanded functionality for DAOs: Decentralized Autonomous Organizations (DAOs) can benefit from ERC-1155's support for diverse token types, facilitating on-chain operations.\n\nPlay-to-earn: The emergence of play-to-earn games could propel ERC-1155 adoption, offering players the ability to earn tokens seamlessly during gameplay.\n\nAs projects explore and integrate ERC-1155, the potential benefits for users, developers, and the broader blockchain community become increasingly evident.\n\nClosing Thoughts\n\nIn summary, ERC-1155 brought great improvements to the Ethereum ecosystem, streamlining token management, reducing redundancy, and unlocking new possibilities. Its impact is already evident in various projects, and as awareness spreads, ERC-1155 will likely continue to function as a cornerstone of Ethereum's token standards.\n\nFurther Reading\n\nDisclaimer: This content is presented to you on an “as is” basis for general information and educational purposes only, without representation or warranty of any kind. It should not be construed as financial, legal or other professional advice, nor is it intended to recommend the purchase of any specific product or service. You should seek your own advice from appropriate professional advisors. Where the article is contributed by a third party contributor, please note that those views expressed belong to the third party contributor, and do not necessarily reflect those of Binance Academy. Please read our full disclaimer here for further details. Digital asset prices can be volatile. The value of your investment may go down or up and you may not get back the amount invested. You are solely responsible for your investment decisions and Binance Academy is not liable for any losses you may incur. This material should not be construed as financial, legal or other professional advice. For more information, see our Terms of Use and Risk Warning.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
    }
]