[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTFBuNlVIYnVYd1VXcXR1X2x0Y3BJM0k2aVpmNllLckQ2T3p1NmhBVzRaQlhCWHNMQ3owT21BNkVUOGxzOXFKUGhfZHM5MG5HQV9DZmZBRXRxbk81M0RGdXhsdEh2ZFRzQ0xvbW1IelkwQkNLdldHelBheGVGYw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 07 Apr 2024 07:00:00 GMT",
        "title": "Funding Wrap: Solana-based Ellipsis draws an Ethereum-heavy cap table - Blockworks",
        "content": "The developers behind Solana-based decentralized exchange Phoenix have just secured $20 million in a Series A funding round for their startup Ellipsis.\n\nFunding was led by Paradigm, with support from Electric Capital and other industry leaders. Notably, public Ethereum figures also supported the development of Ellipsis. These include Ethereum researchers Justin Drake and Mike Neuder, Tim Beiko, who runs protocol support at Ethereum Foundation, and EigenLayer founder Sreeram Kannan.\n\nLoading Tweet..\n\nThe diverse group of investors caught the attention of X, where users immediately commented on the collaboration between individuals from competing ecosystems.\n\nRead more: Low cost of Solana DeFi frees developers from constraints: Ellipsis co-founder\n\nLoading Tweet..\n\nThe younger van Eck raises $12 million\n\nNick van Eck, the heir to investment management firm VanEck, landed $12 million for his stablecoin startup Agora in a seed round led by Dragonfly Capital.\n\n“After spending my whole career building investment cases based on other founders’ visions, there was no better time or opportunity to build towards a future and vision I believed in,” van Eck posted on X. “AgoraDollar is that company. We’re building a more financially inclusive future, where accessibility to financial wealth preservers and creators is borderless.”\n\nRead more: Ripple to issue stablecoin backed 100% by cash equivalents\n\nThe company notes that its first product will be a fully collateralized stablecoin that is pegged to the US dollar. The stablecoin, named Agora’s digital dollar or AUSD, has yet to launch, but the team remarks that it will differ from existing product offerings and will only be available to select markets outside of the United States.\n\nOther notable fundraises\n\nParadigm is in talks with investors to raise a $850 million fund.\n\nSei reveals that it will be injecting $10 million into its NFT ecosystem.\n\nMerkle Trade secured $2.1 million for a social perp DEX.\n\nXion raised $25 million for an abstraction-focused blockchain.\n\nJack Kubinec contributed to reporting.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMibkFVX3lxTFBndG9iQVRnVHhpUEEwT1p5c2ZOUV9LVkl4MDlKOFlJNElVSGlyVWhwOElSb2wxZlNiR1k1UnE4NV83MU5lTFdkdVFIZWhlN3JoaURFeFAxSFdyVUNsM2JFUW9Lb3hzZUxtampiR1Vn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Vs. Solana In Viral Video Showdown - TronWeekly",
        "content": "Superteam, a pool of skilled individuals within the Solana ecosystem, became widely popular after its promotional video critiquing Ethereum and disapproving ETHMAXI went viral. The two-minute ad showcased a fictional scenario with a patient exhibiting symptoms of ETH MAXI, alongside a doctor conducting an extensive ‘Ether Scan.’ The doctor diagnosed millions of developers with this condition and urged them to cross-chain to Solana via Wormhole.\n\nAs reported by TronWeekly earlier, the decentralized messaging protocol Wormhole announced its token airdrop. Per the roadmap, W will kickstart its journey as a native SPL token on the Solana blockchain and will gradually expand to all Wormhole-connect EVM chains thanks to Wormhole Native Token Transfers [NTT]. After debuting on Solana, NTT will allow seamless transfer of W across Solana [SOL], the Ethereum mainnet [ETH], and layer two protocols.\n\nEthereum vs. Solana In Viral Video Showdown 3\n\nThe timing of the ad and the Wormhole airdrop was a strategic maneuver, garnering retweets from both the official Solana account and the chairman of the Solana Foundation. A proponent of Ethereum defended its blockchain design choices, emphasizing the advantages of a decentralized, capitalist approach to innovation.\n\nEthereum and Solana: Uniting for Progress\n\nHe emphasizes how Ethereum’s constraints foster innovation across a multi-billion dollar industry. The post suggests that Ethereum’s design encourages competition and diverse solutions, resulting in platforms that advance the ecosystem while maintaining security and decentralization. It acknowledges concerns about fragmentation but argues that competition will drive solutions. He then ends his post by asserting that Ethereum’s prioritization of innovation over control is a smart approach.\n\nEthereum’s simplistic design (e.g., low TPS and minimal feature set) is seen as a constraint–or worse, a bug. But that design choice has led to a multi-billion dollar industry made of up different platforms trying to tackle that constraint while ensuring application users can benefit from Ethereum’s decentralization and security. Rollups, coprocessors, AVS protocols, off-chain (hybrid) applications–all of these appeared because developers needed to work around Ethereum’s constraints without completely eroding guarantees of trust minimization and security.\n\nFollowing the intense debate on superiority, the Superteam issued a statement, “Well, that blew up. while we’re focused on Solana, we respect everything Ethereum core devs and engineers have built. we stand together in advancing an open financial internet and resisting unfair regulation. Let’s have fun and move the space forward together!”"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxObE81eU1KSzItbGxRaV9hREQzbXJEWGdIVDA5MjA2OGgzTDNoTGQ5aWJlVThpNFE1MlpiMHdwdDluTDd4NXdwbVc2LS15Q3dVRnFhYmZTbDNDOWpoU1EzMk54Y3ZBNElFSlA4SFRYQUpYbTZmUk01eVdrc3JVTHdySDBDYTlKcnV2c3lDY0dn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 07 Apr 2024 07:00:00 GMT",
        "title": "Insights into Crypto Investments: Bitcoin (BTC), Ethereum (ETH), and Furrever Token (FURR) Guide - Yahoo Finance",
        "content": "Furrever Token\n\nNew York City, NY, April 07, 2024 (GLOBE NEWSWIRE) -- Bitcoin (BTC) and Ethereum (ETH) find themselves locked in a struggle to regain their footing amidst market uncertainties, while an emerging player, Furrever Token (FURR) , steals the spotlight with its remarkable presale success. Despite Bitcoin and Ethereum's challenges, characterized by fluctuating prices and ongoing recovery efforts, Furrever Token's rapid ascent, amassing over $660,000 within a month, underscores the shifting dynamics in the crypto landscape. As investors navigate through these contrasting trajectories, the rise of Furrever Token signals a potential paradigm shift, offering a compelling narrative of innovation and opportunity in the ever-evolving digital asset space.\n\nBitcoin Struggles for Recovery Amidst Market Challenges\n\nBitcoin (BTC), the pioneering cryptocurrency, continues to grapple with recovery efforts amidst a challenging market landscape. With the current price hovering around $66,670, representing a modest 1% increase from yesterday's levels, BTC finds itself trapped in a struggle to regain momentum. Following its meteoric rise to record highs exceeding $73,000 in March, Bitcoin has encountered a period of consolidation within a narrow trading range.\n\nThis downtrend aligns with broader market weaknesses observed in the U.S. stock market and other risk-driven assets at the onset of the second quarter. The waning capital inflows into recently approved Bitcoin exchange-traded funds (ETFs) further underscore a subdued sentiment prevailing in the crypto space. While ETF approvals served as a catalyst for Bitcoin's earlier bullish trajectory, diminishing enthusiasm suggests a loss of momentum in this trend. Market attention now pivots towards the impending release of nonfarm payroll data, slated for later in the week, which is poised to influence U.S. interest rate expectations. A scenario of sustained or elevated interest rates could potentially dampen Bitcoin's prospects, given its historical preference for low-rate, high-liquidity environments. As Bitcoin navigates these headwinds, its ability to reclaim upward momentum remains contingent on prevailing market dynamics and macroeconomic factors.\n\nEthereum Struggles to Break $3,440 Resistance\n\nIn the cryptocurrency markets, Ethereum (ETH) faces turbulent conditions as it struggles to surpass the $3,440 resistance level. Currently trading around $3,272, ETH encounters challenges in breaching this crucial threshold. However, recent trends indicate a potential for further downside if Ethereum continues to trade at lower levels, particularly if it breaks below the $3,250 support level. Ethereum finds itself locked in a battle to ascend above the $3,370 and $3,440 levels, yet it trades below the $3,380 level and the 100-hour Simple Moving Average.\n\nStory continues\n\nA closer examination of the ETH/USD pair's hourly chart reveals a significant break below the crucial uptrend line below the $3,300 support. Consequently, the possibility of increased losses should not be overlooked if there's a closure below the $3,250 support region. While Ethereum recently witnessed a recovery wave above the $3,300 and $3,320 levels akin to Bitcoin, attempts to breach the $3,400 level have been met with resistance from bears near the $3,440 region.\n\nAlthough a new high formed around $3,443, a significant break below the major uptrend line below the $3,300 support was observed on the hourly chart. This development tempered gains, prompting a retest of the $3,250 support, with prices dipping to $3,253 before consolidating current losses. As Ethereum navigates these price fluctuations, its ability to sustain upward momentum hinges on overcoming key resistance levels and maintaining crucial support zones.\n\n\n\nUnveiling Furrever Token (FURR): How It Attracts Investors with Over $660,000 Raised and Up to 15X Returns!\n\nFurrever Token (FURR) continues to captivate investors' attention and has emerged as a compelling investment opportunity in the volatile cryptocurrency market. Despite the market's fluctuations, FURR has demonstrated remarkable resilience, attracting significant interest and amassing over $660,000 in funds within just a month. The project's allure lies in its innovative approach to combining cryptocurrency with elements of cuteness and community engagement, setting it apart from traditional blockchain ventures.\n\nAt the heart of Furrever Token's appeal is its unique vision to revolutionize the crypto space by infusing it with an irresistible dose of charm and whimsy. Unlike many serious blockchain projects, FURR embraces a lighthearted approach, leveraging the universal appeal of adorable cat imagery to create a delightful user experience. By integrating cute cat-themed stickers, emojis, and visuals into its ecosystem, FURR fosters a sense of camaraderie and shared joy among its community members.\n\nMoreover, Furrever Token offers more than just a novel aesthetic experience; it presents tangible opportunities for investors to reap significant returns on their investments. With up to 15X returns on offer and over $660,000 raised in a month, FURR's presale success underscores the growing confidence and interest among investors. The tokenomics of FURR, including its allocation structure and potential for exponential growth, further contribute to its attractiveness as an investment asset.\n\nAdditionally, Furrever Token boasts a vibrant and active community characterized by enthusiastic participation and robust engagement. The project's commitment to fostering a warm and friendly atmosphere has cultivated a loyal following, driving interest and excitement surrounding FURR's development and future prospects. As for its current price, FURR is trading at $0.00048, reflecting its growing popularity and investor confidence in its long-term viability. With its vibrant community, promising returns, and unique approach to cryptocurrency, Furrever Token stands out as a promising player in the ever-evolving crypto landscape.\n\n\n\nDon’t Wait! Discover the Most Exclusive Presale Opportunity of 2024!\n\n\n\nFurrever Token Official Website | Visit Furrever Token Presale\n\n\n\nJoin Official Telegram Group | Follow Official X Account\n\n\n\nMedia Contact:\n\nRobert Smith\n\nhttps://furrevertoken.com/\n\nsupport@furrevertoken.com\n\n\n\nCONTACT: Robert Smith Furrever Token support at furrevertoken.com\n\n\n\n"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxONGE2aVRicm9Wc3ZqcFZwUEdETFJxY09Lc2FQS2I1dUhmM0ZiWTZIWWNJWDRQNzVmWThSTUFqOThxUWtweTBiS2hKSFRGUENoYm9YMTVKNUFJUjhKUmpmbTdwVHA2c2xJRU1GUXM5RUhwREE5b1gwM1A2bWx0RHdwTWFvc1JIU3lW0gGOAUFVX3lxTE1EX01TT3NzT1pkWnAyNjVsZjg2d2huZGozNzBfVWFNZEVaVnFmSHJlVHNLTmVvSHVNMkhxQkNaVU9XYmtuel9nZ2FJN1hyQVhXWnB1bWFSOUVaT2tmMXlScDAxVG40b0FnRnhlOGZFZFd4VGtudG01OFBmSFRBa3Z4ME9FaUVRNlg5SFdzMmc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 Apr 2024 07:00:00 GMT",
        "title": "Ethereum leads NFT market with over US$10 million in sales - Forkast News",
        "content": "Ethereum is the top-ranking blockchain in the non-fungible tokens (NFT) market for the second consecutive day, with sales exceeding US$10.24 million in the past 24 hours.\n\nIt was also the second straight day that Ethereum was the only blockchain to surpass $10 million in sales.\n\nThe leading platform saw a slight increase of 5.61% in sales volume, according to data from CryptoSlam.\n\nBitcoin and Solana followed as the second and third top-performing blockchains, with sales of US$7.71 million and US$4.60 million respectively.\n\nBitcoin experienced a notable increase of 8.97% in sales, with a significant drop in wash sales by 95.26%, leading to an overall positive change of 7.72% in total sales volume.\n\nBitcoin, which frequently challenged Ethereum’s dominance throughout March stayed below the US$10 million daily sales mark for the entire trading week.\n\nBitcoin’s US$514 million edged out Ethereum’s US$490 million in NFT sales last month.\n\nSolana faced a downturn, with sales plummeting by 24.06% and wash sales decreasing by 68.77%, resulting in a 41.97% decline in total sales volume.\n\nThe fourth-ranked BNB blockchain showed a remarkable surge in sales, jumping by 400.6%, although starting from a lower base, with total sales reaching nearly US$956,000.\n\nThe majority of BNB Chain’s sales came from LockDealNFT, which had a 563% increase to US$871,689."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxOQUszdFN3LXhxelhQNGpTY2Vydi02d0ZuT1ZFbkQ4NXJLeGFhel9MZktYbFRhZW1KZ0xHU3V3bVdfeHowSnA5UnpVdm1JNUZUTTJWTEVPVm9DcktiTmljQUcxNjBqR0REWUd0NUlHTk9HRGpURnlYVi1pMTF6cml3d1F1X0tNQndRcE9uT1ZLZ3d5TDRF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 Apr 2024 07:00:00 GMT",
        "title": "Explosion of L2 networks: Ethereum ready to tame its rivals - Cointribune EN",
        "content": "Sat 06 Apr 2024 ▪ 3 min read ▪ by Mikaia A.\n\n▪ Blockchain\n\nThe battle of Layer 2 solutions is raging among Ethereum, Binance, and Coinbase. But is it mere vanity or a lifeline for Layer 1 blockchains suffering from congestion problems? According to VanEck analysts, containing the rise of L2 networks will be challenging. By 2030, the market capitalization of similar mechanisms deployed on Ethereum could explode to reach 1 trillion dollars.\n\nEthereum L2: Prediction of Colossal Capitalization\n\nThere is currently a rush toward Layer 2 solutions such as Base (Coinbase), Arbitrium One, OP Mainnet, and many others. The reason? Their remarkable scalability, which constitutes a major asset as a blockchain infrastructure.\n\nVanEck analysts forecast a spectacular rise of Ethereum Layer 2 (L2) networks, reaching a market capitalization of 1 trillion dollars by 2030, reports CoinSpeaker.\n\nThe report, authored by Patrick Bush and Matthew Sigel, highlights the challenges of Ethereum in terms of data processing. Despite its dominance in smart contracts, its scalability limitations remain a hindrance.\n\nHowever, Ethereum is striving to improve its Layer 2 transaction processing capabilities, as demonstrated by the recent Denizen upgrade.\n\nThe bold prediction of VanEck is based on the belief that L2 networks are ready to capitalize on Ethereum’s weaknesses and meet the growing needs of an expanding ecosystem.\n\nWith rising transaction fees and prolonged processing times on Ethereum (ETH), the adoption of L2 networks seems like an inevitable solution for the future of blockchain.\n\nThe New Titans of Blockchain\n\nIn a striking report, VanEck analysts predict a future where Ethereum’s Layer 2 networks will surpass the base network in terms of revenue. According to Bush and Sigel, this rise is inevitable in the face of Ethereum’s inability to compete in terms of transactions and user experience.\n\nThis futuristic blockchain landscape, depicted by VanEck, reveals a dynamic ecosystem comprised of thousands of specialized L2 networks, promising to redefine industries and open new horizons. From decentralized social media platforms to specialized financial applications, the possibilities for innovation seem limitless.\n\nDiscover our newsletter This link uses an affiliate program.\n\nHowever, enthusiasm must be tempered, warn analysts. Despite the opportunities offered by L2 tokens, the competition is fierce. The top seven Ethereum Layer 2 tokens already display a valuation of 40 billion dollars, which raises the possibility of market saturation.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMi4gFBVV95cUxPdHljbDkwR3l3US13NFNWWWJTMWFvTG1oM0Zld25Ld3h0Y0l3N2pZY0czU3ROWGxHaEZiVm11MlpHZ3I2ZnNsNEVUeE0xTWRzb1QyUmJRTEtQbVV4Y2dIUHQ5eGdPbzJvMTVWT1RyVFIxZUJlX241OHEwZ0dkeUoxaGVEenI1MlFtek9hNVhZaGdyenJ4em5JMWd2MHBpaHExUHBERmhqamkwcllUclhqQ3lFQ0hLQ09wZm5vY1FCRzRjcGZCei1XOFZmVTNqTVVkTmc2ZnJDemlMa2ZCc2JnMk130gHnAUFVX3lxTE4wdXpTSndVMzNBa2Y1bmRzbmtEOEZtVTZVd19hRHhzUEg4TkVhSE5PN3dOV0Q4ckNpaEY2VENFdF9xNTM1VTVQcDVDNTlyN2ZzUEFUdWFZcW04TDRvM2dzTGcyaWJyZ2QzRTZLUVBFTWVmb0tlazFBNmVtY2JmMzlieW14bDJ3eEc0VGgyV1g3TGY4SWZZZE9kVVZQUWE0RXdEdmZBWDhBNDNDRUkxNmFlNDI2S1VESU03X3Nsc3QteE81RlY1dEJBSmRESkZkMGtISFctdm5teWRVWWNHQTlJNmNzVnJsNA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Layer 2 chains see nearly 32 million transactions per week after Dencun upgrade - FXStreet",
        "content": "On the weekly timeframe, Layer 2 tokens have printed nearly double-digit losses for holders. It remains to be seen whether the demand from users can aid recovery in L2 tokens in the coming week.\n\nThe radical increase in number of transactions despite rising competition from Solana and alternative chains marks a significant development in the Layer 2 ecosystem. As on April 6, Layer 2 tokens Polygon (MATIC), Stacks (STX), Mantle (MNT), ARB, ImmutableX (IMX), Starknet (STRK) piled on between 1% and 8% gains on Saturday.\n\nData from IntoTheBlock shows an increase in activity on the Layer 2 chains, as users respond to the declining transaction costs. This was anticipated as a result of the Dencun upgrade.\n\nWhile Solana is making headlines for failed transactions and rising DEX activity and meme coin narrative, Ethereum Layer 2 chains are seeing a consistent growth in activity. The Dencun upgrade resulted in a significant decrease in transaction cost on Layer 2 chains like Arbitrum (ARB), Optimism (OP) and Base (BASE).\n\nEthereum Layer 2 gas costs plummeted in response to the Dencun upgrade. Data from intelligence tracker IntoTheBlock show that the Dencun upgrade has reduced the transaction cost of Layer 2 chains and promoted an increase in on-chain activity on these protocols.\n\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all or a portion of your investment, as well as emotional distress. All risks, losses and costs associated with investing, including total loss of principal, are your responsibility. The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of FXStreet nor its advertisers. The author will not be held responsible for information that is found at the end of links posted on this page.\n\nIf not otherwise explicitly mentioned in the body of the article, at the time of writing, the author has no position in any stock mentioned in this article and no business relationship with any company mentioned. The author has not received compensation for writing this article, other than from FXStreet.\n\nFXStreet and the author do not provide personalized recommendations. The author makes no representations as to the accuracy, completeness, or suitability of this information. FXStreet and the author will not be liable for any errors, omissions or any losses, injuries or damages arising from this information and its display or use. Errors and omissions excepted.\n\nThe author and FXStreet are not registered investment advisors and nothing in this article is intended to be investment advice."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxQMUNoNHFuMWRZVkdyWkVWZEdOb3hYX2Nub0pXWHQzeTM1WGpyRnk2Yi1acVhmMDRtOVdjeUtTMzhyQlVkTk9ScWg4VzI0RzdhLU40cTZsNEI5eFhxRkgtTWlUTVBad3g4aWpDUklWTU9pamtJTWJjeWpjV1NnWUtSMmlZN2tKWE5hZUZyYVV6WFFqOElhYjZwV2ZXZXFXdWZzOXk1Z2hYNm1pQWlrbnNqaTFlVVRQV3QwUXRFbzh0VWNXUk4tSnfSAcsBQVVfeXFMTWRUQ0pLelVDMWp6RThBX0VJZ3lzeVhMWXFucW1YZ25ESjR0VWFuZDJ0aUpzTHFtUnhSWTI4Yjk1TXlreW50MS1kdzlmZ3lrY0k4dWxXWVhmcXR1bUwtNmNybkFRYkc4NlJIaW1vMFROZmZhV0VIUWUzNjNGMFotNkNnUk1LbENSbDdWM1ZHNWxQTUFRRWkyYUQ2WmZOTnRWdFdEV3RBVTE5MEJnYzd6WFdadWQ5a0JwdndHandCLXA4cmhVRFFRTFkzSmM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 07 Apr 2024 07:00:00 GMT",
        "title": "Top Analyst Says Altcoins Will Continue Massively Outshining Ethereum (ETH) – Unless This Happens - The Daily Hodl",
        "content": "A trader who rode last year’s crypto breakout thinks that Ethereum (ETH) will continue to underperform unless something monumental takes place.\n\nPseudonymous analyst DonAlt tells his 535,700 followers on the social media platform X that he expects other altcoins to massively outperform Ethereum as soon as market conditions improve.\n\nDonAlt believes Ethereum will continue to be a laggard until ETH witnesses a catastrophic collapse.\n\n“Everything down. ETH down but ETH down less.\n\nRejoice ETH holders your time has come (Down in USD, up relative to the rest of the sh*tters).\n\nI legit think this is the only way for ETH to go up for a while.\n\nOnly if everything dumps can ETH outperform. The moment things go up, others will just outshine it massively until we get a massive capitulation on ETH, then it’ll start leading again probably.”\n\nDonAlt has been bearish on ETH since September of last year, tracking the performance of the leading altcoin against Bitcoin (ETH/BTC) when it was trading at 0.06 BTC. Since then, the pair has lost nearly 20% of its value, now trading at 0.0487 BTC ($3,382).\n\nLooking at Bitcoin itself, DonAlt believes that BTC’s current consolidation is setting the stage for the crypto king to print new all-time highs.\n\n“Low timeframes look much better above $68,300. They look terrible below $65,000. Kind of a toss-up in between in my opinion.\n\nThe longer the range, the better for bulls, digesting the move from $30,000 to $60,000 by going sideways would pave the way toward $80,000+”\n\nAt time of writing, Bitcoin is worth $69,461.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxOakhtZmg5dG95TzBac0hPMFNLeDU1TGdBVzFJaFpYUXlleWc3YktLeEs1bEhadU1hc2czc3NDbzhCUGd4YjBGSjJHajFrQ1dKTjUxakpkOGNJLXFJZEIyTEVJcWFPLURzSEJTc0JpLVJOWnVvOFVObjVybmhFcGRlblhsb0U4MmJUQ0VKbXZOc0xVRjhwWTNVZjJkMHVGano5T0RpaGl3UTNpNjViNFHSAbMBQVVfeXFMUFBiUHZmYkNnWDR2bW1rYXRlSklNaG9MeTdOdnhkaFREZ3p6S2otdXJ6VnBDQ2twOGo3MC1xX1VmSzBhU1lrMXh2Ukh5NnJaemdKMjdUMWw0NWZpT1NHQmdTT3VFOXFMbG5nOHFNQUYtS19vemMweFNkam1kY3IxUkVNc0ZfTmtkMHNLTDZfbk1FdjlJQ1lpcENwdTZfS3Y3V2ltcjNSMHlfRHh0TGRDZmJLbk0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 07 Apr 2024 07:00:00 GMT",
        "title": "Ethereum’s Layer 2 Networks Projected to Reach $1T Market Cap by 2030: VanEck Analysts - CryptoPotato",
        "content": "In a report released earlier this week, analysts from investment manager VanEck forecasted that Ethereum’s Layer 2 scaling networks will reach an astonishing $1 trillion market capitalization by the year 2030.\n\nThe $1 trillion prediction was reached by estimating that Ethereum would hold 60% of the market share across all public blockchains and assessing the volume of assets within its ecosystem.\n\nEthereum’s $1T Potential Through Layer 2 Innovations\n\nVanEck’s senior digital assets investment analyst, Patrick Bush, and digital assets research head, Matthew Sigel, shed light on the transformative potential of Layer 2 blockchains in revolutionizing Ethereum’s scalability and performance.\n\nEthereum’s dominance in smart contracts faces scalability issues as transaction fees and processing times escalate during periods of high usage.\n\nAccording to the analysts, Layer 2 networks are set to capitalize on Ethereum’s limited capacity to process, store, and compute data, thus unlocking new opportunities for innovation and growth within the blockchain ecosystem.\n\nThe report also highlights the role played by Layer 2 solutions, particularly Optimistic Roll-Ups and Zero-Knowledge Roll-Ups, in enhancing Ethereum’s transaction processing capabilities while upholding its core principles of security and decentralization.\n\nOne development emphasized is Ethereum’s recent Dencun upgrade, which introduces the innovative “Blob” feature to reduce data posting costs, improving Layer 2 operations financially.\n\nLayer 2 Networks Could Dominate Ethereum\n\nVanEck’s analysis projects a future where Layer 2 networks will capture a significant portion of transaction value and Total Value Locked (TVL) within the Ethereum ecosystem. This growth is expected to be partly driven by the potential of Maximal Extractable Value (MEV) to enhance Layer 2 revenues. They also see a future where Layer-2 platforms could offer distinct competitive advantages over Ethereum in specific market sectors.\n\nDespite their optimistic outlook, the analysts are cautious regarding the long-term value of most layer 2-related tokens due to “cutthroat competition,” which could impact the long-term value of many projects. They note that the top seven Ethereum layer 2 tokens already command a fully diluted valuation of $40 billion, with more projects to launch in the coming months.\n\nThe report forecasts a future landscape characterized by thousands of use-case-specific Layer 2 networks catering to various sectors, including gaming, social media, and infrastructure.\n\nThese specialized chains are expected to complement Ethereum’s general-purpose chains, with a select few emerging as major players due to network effects and widespread adoption."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNd1dJUlBmRTJiTjIwY1E1V2VYdDBwLTBEckJWeGlYcElJdHEzemVxckZ4dU13Tnh1X3lhSUV0dkJ4OEQ2Qm10aTBFa3hnbnVXcWFmT3B2a0xFV28zenp6RmNZZWw0UG96Qk9pa3JBanRYUlh1NVRNcm95cm8xLWNLZmxHYVdFeV9OWmVmcNIBkgFBVV95cUxNZ2JfZlJmR0lsWWU0WFo4Q1ZkVGd2M1hrN0QtM1ZhOHlRS2ZuY0F4YmpTN1lDRnF0Unp1UUtKeG5pTDFFQkx4dUk4a3Q1Q0NkN0ctbDlsRElzQkhCM19IUjBvSWVPdmhzQTB4NlRkUjNxb0xKdTA3cU16RGZGd1VwNjJ3QlBadUdmYjVkakpzR3RIdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 Apr 2024 07:00:00 GMT",
        "title": "Veteran Trader Peter Brandt Makes Epic Solana vs Ethereum Prediction - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nPeter Brandt, a well-known figure in the trading community with decades of experience, recently predicted Solana price's potential to outperform Ethereum, triggering intrigue and speculation within the cryptocurrency community.\n\nAdvertisement\n\nIn a recent tweet, Brandt, a veteran trader, predicted that Solana (SOL) might double its value against Ethereum (ETH) if a significant resistance level is breached. This forecast comes amid ongoing market volatility, as evidenced by price drops.\n\nThe $SOLETH chart is at huge resistance. Resistance = supply. If this supply line is absorbed, then there is a prospect of $SOL doubling in value vs. $ETH.\n\nBTW, if you have not figured it out yet, I love dumping FUD on ETH -- I am actually not as bearish as my FUD indicates pic.twitter.com/jCiOey7SyU — Peter Brandt (@PeterLBrandt) April 5, 2024\n\nBrandt has identified a key resistance point on the SOL/ETH chart. In his words, he mentions that the SOL/ETH chart is a huge resistance.\n\nThe resistance level that Brandt refers to is a technical barrier where sell orders are clustered. If buyers manage to absorb this selling pressure, SOL's price relative to ETH might rise significantly, with the prospect of SOL's worth doubling against ETH.\n\nWhile it might seem that Brandt is bearish on Ethereum, he adds that he is not as bearish as his views might seem.\n\nBrandt expressed his skepticism about ETH in an April 4 tweet, referring to it as a \"junk coin.\" In what seemed like a shift in his position, Brandt said in a different tweet that he would not hesitate to take a leveraged long position in ETH if the charts indicated it.\n\nAt the time of writing, the SOL/ETH indicator was somewhat lower, at 0.0524. Solana was up 0.56% in the previous 24 hours to $174, while Ethereum rose 1.83% to $3,319.\n\nSolana addresses network congestion\n\nAnza, a Solana-focused dev shop building the Solana client Agave, has released updates on progress in addressing the present congestion on the Solana network. The fixes are likely to be issued next week.\n\nAnza, in collaboration with other core contributors, is analyzing the root cause of the network congestion on Solana and evaluating several potential changes.\n\nThe core issue relates to a QUIC implementation and the behavior of the Agave validator client on Solana when asked to process a large number of requests. In this light, the Anza team will be testing a patch to address current network congestion, and if successful, the patch might have a wider rollout.\n\nIn a bid to increase network performance, more improvements and changes are expected to be rolled out over the coming months."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxNeVNWVXZUdTdNRzRXSE1TZXVBQmNaV0lZMkx5S3JxeGhsQzBiQ0hOMUtCbVpUX3FPTTYwYU56Sm1WczJrOV9LaVlWTHVDcHZmaERwZ2pJdmhjYk9XcFZUaTBzTkoyZ0h6ZVgzUXVjd1JBM2RYWlZMbVpuSWpfOUluNkhZamdKdTNGaFBNdWRnbHY0djRaMXd6NmFDSF9NSWo2M0RWNGpqb3ZyamtheXZTVXNjcG9lS29JVW1ManVKYkZfYU9uTVZZV0RwdS1pdWdEWXRmckZ1RG7SAeABQVVfeXFMUEVVakZJZ2lNNnBOcHhPVFpKZXQxZEtMa1duWUlubkVGbFhSVFFaVXlmTHB5eldfSDE4aW51YXdCOExYWFQwbTNQdGtsOHFJNGllQTdPMzZ3eHgzQ2ZscW9xSl9WWXowdGU2cXpaSEx3MVN4MDdsMGNMemltamdlU183QVRTTlQ3ZUdQVHo1YWVkQ1R1VHk3b1BaVEVXSUo5UkxKMFVBTDlPQjd1aFhxQ3dKaE5QUFVTd1QxYms1VzNYXzZ6Ymo2dmU0SVpNWlBHbDBmZGZGS0JkaWgzR1hzZjM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 Apr 2024 07:00:00 GMT",
        "title": "From DAG Chains To BlockDAG: A 20,000x Investment Surge Amid MEW’s Market Rise And Ethereum’s Wallet Expansion - Crypto News Flash",
        "content": "The ascent of Ethereum wallets to record levels combined with the significant rise in MEW’s value highlights the increasing interest of investors in the cryptocurrency market. BlockDAG stands out in this burgeoning field, promising an investment return of up to 20,000 times. With a successful presale raking in $13.5 million and selling over 6.6 billion coins, BlockDAG is rapidly becoming a major player in the cryptocurrency realm.\n\nBacking rumors from major tech companies, alongside a robust presence on social media and the integration of DAG, further elevate BlockDAG’s attractiveness, positioning it as a prime investment for those aiming to ride the next big wave in cryptocurrency investments.\n\nSurge in MEW Value Challenges the Dominance of Solana’s Memecoin\n\nA remarkable increase of 269.95% in MEW’s value over the last week has drawn the attention of major Solana investors and enthusiasts. This pivot to MEW from the previously preferred memecoin BOME showcases the potential of MEW in the cryptocurrency market. A significant purchase by a whale, acquiring 9.6 billion MEW or 10.8% of its total circulation, underscores the growing trust in MEW’s value.\n\nThis uptick in MEW’s value has also increased its market cap by 140.78% to $639.45 million, with trading volumes seeing a 322.97% jump. As MEW’s price trends upward, paralleling Solana’s 5.78% increase, it begins to challenge WIF, positioning MEW to become a key player in the memecoin arena.\n\nEthereum Wallets Achieve New Heights as Ether Makes a Comeback\n\nThe recent increase in Ether’s price, the cryptocurrency native to Ethereum, correlates with a peak in Ethereum wallet numbers, now reaching 118,230. This surge reflects the growing investor interest, despite Ether’s recent dip. After experiencing a 25% decrease in value, Ether has bounced back, exceeding $3,600, as the number of Ethereum wallets continues to rise.\n\nThe Market Value to Realized Value (MVRV) index suggests a potential undervaluation, coinciding with the rise in Ethereum wallets, hinting at a future price increase. With Ethereum wallets at an all-time high and Ether’s price nearing $3,590, the ecosystem’s vitality suggests further growth, particularly if the historical relationship between Ethereum wallets and market value persists.\n\nBlockDAG Sets Sights on 20,000x Return: The Premier Investment in Crypto\n\nBlockDAG emerges as a leading cryptocurrency, attracting investors with its sustainable blockchain technology and an impressive $13.5 million raised in its presale. Selling over 6.6 billion BDAG coins by batch 7 at a price of $0.0035 each, the project’s dedication is evident. The publication of its technical Whitepaper V2 with right to be displayed at Las Vegas’ The Sphere further establishes BlockDAG’s foundation, reinforcing its position as a top investment opportunity. BlockDAG’s integration of DAG technology underscores its commitment to sustainable and energy-efficient blockchain solutions.\n\nSpeculation about support from tech giants and substantial social media buzz enhance its appeal, marking BlockDAG as a top investment choice for those seeking a 20,000x return. Though specific investors’ names remain unconfirmed, the speculation surrounding BlockDAG boosts its attractiveness, indicating a strong potential for the project and encouraging further investment. BlockDAG’s innovative approach and focus on environmental sustainability set a new standard, drawing investors to this promising opportunity.\n\nThe Final Say\n\nIn the midst of the Ethereum wallet boom and MEW’s price surge, BlockDAG stands out as a luminary for investors, offering a 20,000x return that positions it as a formidable entity in the cryptocurrency arena. Its commendable presale achievements and the buzz about potential support from leading tech companies underscore the project’s robust potential.\n\nBlockDAG’s forward-thinking approach to blockchain technology and its emphasis on environmental considerations make it an enticing option for those seeking substantial returns. As interest in BlockDAG grows, it cements its place as a key player to watch for anyone looking to invest in the cryptocurrency market’s future.\n\nJoin BlockDAG Presale Now:\n\nWebsite: https://blockdag.network\n\nPresale: https://purchase.blockdag.network\n\nTelegram: https://t.me/blockDAGnetworkOfficial\n\nDiscord: https://discord.gg/Q7BxghMVyu\n\n[thrive_leads id=\"228374\"]"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMi9AFBVV95cUxPcTZsVW9tM1JrMnYyV055U0dNTlJReFU0YUcyQ2p3Y3hqTDBUd2xPTURvcEhpempSU1VXU0ZoUmlVT1VMNGJPV09FTVBjZi1xbXlLNmp5TVVjb21tSkZQNjZsdDlXWTY1d1NlX1VYa0Rka2U0alhDRkpZd1JEMEtyblZWbFN0MW16bTNScTRjWmJBMFZhMHpibnA0M2UtaXFvUF9vMDh5cVlUM0lwQTZSMHhPWUdKeHNfZXBYZWNOYVZhMXpYZTVIa1hvTkx0aHhnRm9uY3FkTWRPZGsyM0lhN1Nydlppa19kQ1VDMmIyUlJ3SDJE0gH6AUFVX3lxTE1GeC0xSW9mSWxwcTNlV3gyS01STmVxa25fanh5SDhJNjBuNzk3LVBoQmIxczVDTEk3ckVQdTRxZUwtWFNSUXo2S2pwd1lsVGhRZWthUERNdHlkRUcxOFNfdHhhcWdvOXd6RkhXdENVLWY4NXVVVDBDX1d5T010aERFOWZ1M2JXUHNEb01hM1lMeXZJX3Z0WUVtdlZ4dWlHTGRLQ0R3TnQ4VTVESW1SSzgtMmxSNHlvSmhvYTlZbm9mNG5pZHQtUkp2a1QyWWlXRkFLeFZYcWN2MXFSN3R1SUpZclBaamtScXpGNHRia1BMMjVTZTB5NEhHSnc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Set for New All-Time Highs, Shiba Inu (SHIB) Poised for 2x Gains, But Trader Predicts Parabolic Run for This New Meme Coin - Crypto News Flash",
        "content": "According to Criptopaul, Ethereum is due for new all-time highs this month.\n\nShiba Inu is expected to see a 2x price rally following a symmetrical triangle breakout.\n\nNuggetRush is a new hybrid meme coin poised to lead the 2024 bull market.\n\nCriptopaul, a top crypto analyst, has predicted that Ethereum will hit new all-time highs in April. Shiba Inu (SHIB) is another meme coin poised for a 2x price breakout following its symmetrical triangle breakout. However, these top altcoins will be outperformed by NuggetRush, a project changing the meme coin narrative.\n\nEthereum (ETH) Set for New All-Time Highs: Criptopaul\n\nCriptopaul, a top crypto trader, has shared a bullish outlook for Ethereum (ETH). Although ETH has underperformed BTC in 2024, Criptopaul has predicted that the leading altcoin historically outperforms Bitcoin during the month of the halving event.\n\nWith the halving event scheduled to happen in April, the Bitcoin trader expects Ethereum to form new all-time highs in April. He expects a new ATH in the next 30 days, making Ethereum one of the top crypto to invest in.\n\nBased on the predictions, an ETH bullish reversal is expected over the next few days. While ETH has dropped to lows of $3,300, the leading altcoin is expected to trade above $5,000 in April, making it one of the top crypto coins for every investor to add to their portfolio.\n\nNuggetRush (NUGX) Could See a Parabolic Rise in April\n\nAll eyes in the crypto space have been on NuggetRush (NUGX) as it recorded several milestones in its blockchain ICO phase. Amidst interest in its upcoming mining game, NuggetRush sold over 270 million NUGX tokens, raising more than $3.75 million in the process.\n\nThe rising momentum for NuggetRush is backed by its unique gaming ecosystem. NuggetRush is a hybrid project that innovatively combines GameFi with meme culture, NFTs, and staking. Within the game, players will perform various mining tasks, including recruiting miners, collecting mining equipment, finding gold, and selling them.\n\nThe exciting part of NuggetRush is its partnership with artisanal miners, allowing players to convert their virtual gold to real gold and cash. The interesting part of NuggetRush is its cooperation with craft miners, letting players transfer their virtual gold to real gold and money. Furthermore, NuggetRush has trending NFTs, RUSHGEMs, that can be staked for APYs of up to 20%.\n\nThe incentive rewarding system of NuggetRush has created increasing NUGX demand. However, NUGX is an ERC20 coin of the platform. NUGX benefited from this demand, rising by 100% to hit its listing price of $0.020. Analysts expect NUGX to be one of the 100x tokens of 2024, making it a must-have coin in 2024.\n\nShiba Inu (SHIB) To Record a 2x Surge, Crypto Analyst Predicts\n\nOver the last few weeks, Shiba Inu (SHIB) has been one of the most impressive top memecoins. SHIB price has risen over 150% so far this year. The crypto trader, Captain Faibik has forecasted that it may continue its bullish run into the weeks ahead.\n\nCaptain Faibik pointed out that Shiba Inu has printed a multi-week symmetrical triangle. On this bullish pattern, he has predicted a return of at least 2x within the next few weeks. The next uptrend marked a high of $0.0000580 by the crypto trader.\n\nClosing Thoughts\n\nEthereum and Shiba Inu are both poised for significant gains in the near future. However, traders are also looking to the next big thing, NuggetRush, as its new exciting model could be the future of the GameFi market.\n\nVisit the NuggetRush Presale Website\n\n[thrive_leads id=\"228374\"]"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxPMkZ1SlhCYUREMkxYRFJQcmlTcGlTYTZsY3FjeGIwX1VNU1dqeERCVWRlWEMxZzdFRmlBU0FQVFh4Qnd2YmVSalNFc2cweDlWTWtxNkNtaWFGWEgzUUNma1JVYjhpYWZHSXJ3V3VFVDNyU1BmSzRubHlzZW5FamZrcHlqT2hNMnBFcWxkU3VfNVRGZ9IBlwFBVV95cUxNZk5vUDk5UzVKRmFVMFVnTDRpalRzeFgtOW9RbXB2OUxQVWRkLXhaN3ZlMzFseEV6RWVBbUNudGxOdFE4Z3BVd0o2Um85a2hQT1B4MmRFMFRIcUl3bG9MaWFNOFdIS1dfMHlxeGRxdTdmZEV3dS0ycXVEd3o4ODNxSUtyOTRMU3V0NzFyallDQmprNklpM1g4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 07 Apr 2024 07:00:00 GMT",
        "title": "Why Solana will ‘double in value’ against ‘junk coin’ Ethereum: Trader - AMBCrypto News",
        "content": "Brandt predicted that Solana could double versus Ethereum.\n\nSolana showed significant growth despite recent network issues.\n\nSolana [SOL], a cryptocurrency that previously aimed for $200, has encountered setbacks amidst a bearish sentiment in the weekly charts.\n\nHowever, its 24-hour price cycle depicted a 3.56% surge, mirroring optimism in the border market. Inasmuch, renowned crypto trader Peter Brandt, in his recent X (formerly Twitter) post, noted,\n\n“The $SOLETH chart is at huge resistance. Resistance = supply. If this supply line is absorbed, then there is a prospect of $SOL doubling in value vs. $ETH.”\n\nEthereum vs Solana\n\nThis isn’t the first time Brandt has criticized Ethereum, underscoring ongoing debates within the crypto sphere about its position and potential. On the 5th of April, Brandt tweeted,\n\n“I get tired of saying it, but $ETH is a junk coin despite mindless devotion of Etheridiots. As a store of value it is junk – a $BTC pretender.”\n\nDespite his criticisms, Brandt indicated his willingness to take advantage of Ethereum’s [ETH] market fluctuations.\n\nAmidst these setbacks, Solana’s recent network congestion and transaction failures have also stirred discussions within the crypto community.\n\nAddressing the concerns, Matt Sorg, Solana’s Tech and Product Lead, said,\n\n“Solana is a highly efficient protocol that hasn’t nearly hit its scaling ceiling. This particular issue doesn’t hit the transaction processing part of the protocol and isn’t an issue of failed transactions.”\n\nWhat’s on the price front?\n\nSurrounded by various downturns, Solana experienced a 2.2% drop last week, however, it has shown substantial growth, climbing by 34.15% in the past 30 days and an impressive 752.41% over the last year.\n\nAnalysts interpret this recent short-term decline as a temporary setback within Solana’s overall upward trend.\n\nErgo, with the Bitcoin [BTC] halving anticipated later this month, experts see the current market downturn as a potential opportunity for investors to enter the market before an expected recovery."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxPQmY2dGVrMkVOLWlZVkVkVk9kMHlwNTBLM0kwd1dUdldxV1pjb2FXRnRLMGdnTnpYdjNhMmJhMWkyazFDZDVxWjZYZTF5dlJVRldGVTJpU3dRLWtrbVgxckNrVUxMOTZIdHV2bjhlWVJpeHhlTTVEdHRPX3BiZnhnTWdFX2dkencwSWVNNzJILWNxWVZUQkZv0gGcAUFVX3lxTE82Sk5TX0VrMUZmOGwwaUFNdW55bmt5aW9ja0tqRTdsVERMdUN3SUJ6M0Iwa0RZWjRSclc1d2NxeE1LUkFTTmVlU0dkN21kTklLYWgtM3VTQWUtQjNKM2FPeEFvaGhrb3BNRkxleVh2X2FoS0N3SE9IWU9KMDYyU190NnMzU21Lc2NUQTNmM2FYVjY5SVpmQzIybnZwVg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 07 Apr 2024 07:00:00 GMT",
        "title": "Ethereum and Polygon Attract Majority of New Users: Flipside Report - CryptoPotato",
        "content": "Ethereum and its Layer 2 scaling solution, Polygon, attracted the most new users by far in the first quarter of 2024.\n\nThe latest report by Flipside revealed that these two blockchain platforms have garnered the most cumulative new users among observed EVM chains since the beginning of the year.\n\nPolygon boasted 12.3 million new users, and Ethereum had 13.4 million – roughly 70% of new users this year across all observed chains as of March 27. Next up was Arbitrum, recording the most new users (4.7 million) during the same period.\n\nTaking into account Ethereum and Polygon’s extensive history compared to most EVM chains, it’s not surprising that they hold significant dominance. In relative terms, the growth in new user volume for Ethereum and Polygon was only 298.3% and 359.7%, respectively, between January and March 2024, which places them in the middle of the pack among all observed chains, Flipside said in its report.\n\nDeFi – Main Driver of New User Growth\n\nDeFi has emerged as the primary catalyst for new user expansion across various chains this year. Among all monitored EVM chains, DeFi trade volume has surged since the beginning of the year.\n\nEthereum leads with a cumulative $1 billion in trade volume, with its busiest trading day recorded on March 5, when figures exceeded $428 million. In fact, March proved to be the most active trading period across all observed chains.\n\nWhile DeFi trading activity on Optimism and Arbitrum experienced slight declines in the past week, overall, DeFi activity has displayed a consistent upward trajectory. This stands in stark contrast to the erratic market fluctuations experienced throughout much of 2023.\n\nAlthough Arbitrum lagged significantly behind Ethereum and Polygon in acquiring new users, it managed to secure a strong second position in terms of new user trading volume, amassing $9.5 billion since the start of 2024. This difference in performance was attributed to Polygon’s high NFT trading volume this year, which hit a daily peak of $6.3 million in early January, compared to Arbitrum’s lower daily high of $229,000 in mid-February.\n\nNew User Growth Shows Mixed Results in NFT\n\nNew users’ engagement in NFT activity has shown “mixed” patterns, with the two largest chains experiencing contrasting trends. In comparison to DeFi, the growth of new users based on NFT activity has displayed greater volatility depending on the network.\n\nWhile Polygon’s new user NFT trading activity has consistently decreased since the start of the year, activity on Ethereum and Base, on the other hand, has steadily risen. Across all other chains, NFT trading has fluctuated from week to week without any clear pattern.\n\nEthereum and Polygon have maintained the highest USD volume of NFT transactions since the beginning of the year. Ethereum’s daily volume has remained consistently above $1 million since January 1st, whereas Polygon’s peaked in early January at over $6 million before declining to less than $500,000."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxPVDBhd2dlanNMdmFhQkdKdEpIbjA1Mm1ZQTJubHQyU3hWaUN6S0xaYW80NGhXV0paUW0xeXpUQnFMMzdaMHV6M3BaZU5iRG4xaUNOWG1XSlVzbmtSdkg5dnpnZWpNWmRsS1dMSE9oSTNJNktURDJQaHh5NzRpZnBmYk8wbzjSAYoBQVVfeXFMTkszVTBtVzl2RWVWLTZCUlVJU3V5UGVjNXJoWVFWalpIcmt6QTFUYjhhRVdBcXN6QTBPZ2hLTk9Nck5CMGl1bFprZzljcnZvLWNMT1hTWl9MZEFZTTR4VEI0TUpUcEp2d29mazlyQ2dzalVBMmtUTU9ReHQ1T1BDNWZMZFNLczM0c1Nn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 07 Apr 2024 07:00:00 GMT",
        "title": "Ethereum: Here’s how the market bought and sold ETH in Q1 - AMBCrypto News",
        "content": "ETH’s exchange outflows totaled $4 billion in Q1 of 2024\n\nMVRV ratio suggested the coin was trading slightly below its realized value\n\nAccording to data released by IntoTheBlock, Ethereum [ETH] outflows from cryptocurrency exchanges totaled $4 billion in the first quarter of the year. This signals a surge in coin accumulation by market participants over the 90-day period, despite the 10% decline in ETH’s value after it peaked at $4065 on 11 March.\n\nThe altcoin’s rally above $3500 towards $4000 between 4 and 19 March triggered a wave of sell-offs. This contributed to a hike in its exchange reserves, with a year-to-date (YTD) assessment of the coin’s reserves revealing a 5% decline.\n\nThis decline showed that ETH accumulation significantly outpaced distribution during the quarter.\n\nETH on-chain in Q1\n\nBetween January and March, the number of ETH wallet addresses holding between 100 and 100,000 coins fell by 2%, according to Santiment. This underlined a decline in ETH holding by its investor cohort, known to be market movers.\n\nAt press time, 45,623 wallet addresses held between 100 and 100,000 ETH. These addresses currently hold 36% of ETH’s circulating supply.\n\nConversely, during the period under review, the number of shrimp addresses holding between zero and 100 ETH coins climbed. As of 31 March, their number was 118.25 million, up 6% during the year’s first quarter. At the time of writing, this category of ETH holders controlled 10% of the coin’s supply.\n\nAlso, the surge in ETH’s price above $3500 in Q1 led to a spike in its Market Value to Realised Value (MVRV) ratio.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nThis metric measures when an asset is overvalued or undervalued. When its ratio is high and on an uptrend, it suggests that an asset’s market value has exceeded its realized value. When this happens, most asset holders will be in profit.\n\nConversely, when an asset’s MVRV ratio declines, it is deemed to be undervalued relative to its realized value. Investors who choose to sell their holdings at this point during the market cycle often do so at a loss.\n\nETH’s price rally to $4000 on 11 March pushed its MVRV ratio to a YTD high of 138.38%.\n\nAlthough ETH’s MVRV ratio also declined after its price fell from its peak, it closed the quarter with a value of 107%. Below 100% at press time, ETH’s MVRV ratio showed its price was slightly below the average price at which all coins were last moved on-chain"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxNSy0zRmFKOS1WeE5qUjVjZHlRTzVVT0Rpc3lVYlZfb0tWUkp6YnhBWThnM0tMLXdoTGlXelNnNzB2MEd0VFkybkVObDJJUUN4M0J5QUhaXzkzQlMtc1Qwc2kwQWMxZlJEQks2NXJXZkpyOG05ckhYRFViZlpCcDdRbmVMdlhmMy13UkxxVGFtM1VJd9IBlwFBVV95cUxQWk1QUVNKWFVOcmZZc2VhX1dzZTQ3aGJNM3FqeTZsbUp4clAyOEh0ZkZxQnN4R0phcWZMYmZVSnNkLXhKZFdKTnhncGNCTkozOGgxdlhTS2RTeFNoallyYkprcVN1YTdMa2xROFpCTHcwUm81NmF2bmhJaVlXMUFEQldQZjhGZFE5WTJCQU9ETU1obWdNdS13?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 Apr 2024 07:00:00 GMT",
        "title": "Ethereum: Still bullish on ETH’s price? Here’s why you might be right - AMBCrypto News",
        "content": "Ethereum outflows surged despite ETH’s price seeing volatility\n\nWhile traders got liquidated, long-term hodlers remain hopeful\n\nOver the last few weeks, Ethereum [ETH] has remained stagnant around the $3,500-price range. However, a recent correction pulled down ETH’s price on the charts significantly, fueling a change in sentiment.\n\nOutflows on the rise\n\nDespite this correction, however, there have been significant outflows of approximately 1,000,000 ETH, equivalent to $3.41 billion, from exchanges since March. This trend persists despite macroeconomic challenges and apprehensions regarding a potential rejection of a spot ETH ETF by the SEC.\n\nSuch outflows indicate that individuals are actively engaging in real activities on the Ethereum network, such as transaction payments, staking, and restaking. This also means they are confident in holding ETH despite unfavorable market conditions, rather than solely engaging in speculative trading. Nevertheless, liquidity for spot ETH remains highly valued.\n\nTraders bleed\n\nAt press time, ETH was trading at $3,254.80, with its price down by 2.68% over the last 24 hours. Due to the swift decline in ETH’s price, many traders’ positions got liquidated too. In fact, according to Coinglass’ data, $57.22 million worth of positions were liquidated over this period. Of this amount, approximately $41 million worth of long positions were liquidated.\n\nThe velocity at which ETH was trading at also fell in the last few days. This implied that the rate at which ETH was being traded declined materially. Moreover, the network growth of ETH has also decreased considerably, indicating that new addresses have been losing interest in ETH.\n\nA lack of interest from new addresses could affect buying pressure for ETH in the future and may impact its ability to climb back to the $3,500-level.\n\nLong-term holders show faith\n\nDue to the price correction, ETH’s MVRV ratio fell significantly. This indicated that most ETH holders were not profitable, at the time of writing. This could be interpreted positively as most of these holders don’t have any incentive to sell their holdings and the price of ETH could sustain its current levels going forward. Moreover, the Long/Short difference for ETH also spiked over the last few weeks.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nA rising Long/Short difference means that long-term holders outnumber the short-term holders. These long-term holders are less likely to sell their holdings and don’t tend to react impulsively to price fluctuations."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxOZmRHbmc0RDJmVzgtV2pZZjVuQWJKNXYwN0lMMFpULUZCbEJZclpCZFNYOVRDQjdHVkl2YTZUNlFGR055R0FYVmZqRW9jdjZ1Y3V2WWFwT2VuaFpxYjI5U0hxRTQzMF9XTUt2ZVR5c3pnM0kteWxFX1BUanpwVEVkSTZ1V3gtQ0FLSHhFYg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 07 Apr 2024 07:00:00 GMT",
        "title": "Ethereum ETF Approval Chances Hold Firm at 14% on Polymarket - Coinfomania",
        "content": "Grayscale’s recent survey highlighted the approval of a spot Ethereum ETF could increase US investor interest in Ethereum by 25%.\n\nThis increase in interest is driven by economic concerns like inflation and worries about financial stability, particularly among younger individuals and minority communities. 40% of voters from the previous year desired to invest in cryptocurrency. Due to economic instability, that percentage has increased to 47% this year, indicating that more individuals are interested in digital assets.\n\nSource: Grayscale\n\nAccording to Grayscale’s survey, many Americans are drawn to cryptocurrencies because they see them as a way to achieve financial stability and manage their expenses.\n\nEconomic worries have historically influenced crypto interest. Bitcoin’s limited supply allows it to function like gold, acting as a store of value. Grayscale found that familiarity with cryptocurrencies increases the likelihood of seeing Bitcoin as a hedge against inflation and other macroeconomic events.\n\nDemographic Ownership Patterns\n\nNearly 70% of people surveyed said they own some form of investment and around 19% own cryptocurrencies. Men, Black and Hispanic voters, and younger people have higher ownership rates. Gen Z respondents, in particular, reported a 31% ownership rate, with many saying they are more interested in cryptocurrencies because of inflation.\n\nDespite the FTX crash, enthusiasm for crypto remains strong in the US. Approximately 40% of investors believe their future portfolios will include Bitcoin.\n\nGrayscale’s data shows that cryptocurrency interest transcends political boundaries. Ownership rates are similar among Republicans (18%) and Democrats (19%). Voters are split on which party is more favorable to the crypto industry, with 30% believing both parties have a favorable stance on crypto policies.\n\nThis balanced interest aligns with recent bipartisan support in Congress for the resolution of SAB 121, enabling banks to serve as custodians for crypto, making it more accessible.\n\nPolitical Views on Crypto\n\nHowever, differences exist in how each party views the importance of crypto-related issues. Republican voters are more likely to prioritize inflation and the economy, with 54% compared to 33% of Democrats. Conversely, Democrats focus more on issues like gun violence, climate change, and income inequality.\n\nMeanwhile, Bitcoin and Ether prices continue to be affected by government sell-offs and Mt. Gox’s repayment. Bitcoin has stabilized around $57,000, while Ether stands at $3,027 as of press time."
    }
]