[
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOaTJjWUJ5aXFQX2lrWGlKRFRlRWwtbXVoQ0lPaHRXWUl1R0NLcXNkYk1IZ2pzd25DTE80UUZEZjUtb21NaDhmM2ppZF9jdURYNnM2TWFfVXV6dFdJZFIySXFOQ3A4cGJ6Q1lJWFVZQ3BzVGYwUVBMS2taem5GQnd5eUJJc2E3THNjcVF0T3g1ONIBlwFBVV95cUxOYnBaTkdYNDZJTEN4Y1hNWTZJTlBLZmtrWTg0TlNkRS1BZEo2SlZ5Z19JZEhpZk5BYlFra0RoamNoVHJ5cTlBcEJhNmN0RWoyM0ZhTVNfd3B6UXY0TjBoMlJxN3dubjFpUktXRFU1WXZnN3JaV3pOTnRqWXVhak1FNFdqOVVqTVc2Z2FOQi1zdG53R3AxZWJn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 27 Jan 2024 08:00:00 GMT",
        "title": "This Week in Coins: Bitcoin and Ethereum Dip, Bitcoin Recovers - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIllustration by Mitchell Preffer for Decrypt.\n\nBitcoin (BTC) had depressing week after the historic approval and trading of several crypto exchange-traded funds (ETFs).\n\nThe largest cryptocurrency by market cap plunged hard on Monday following a sell-off from digital asset fund manager Grayscale. The virtual coin dropped below $40,000 (to $38,678) on Tuesday, but slowly recovered as the week went on.\n\nIt is now trading for $41,830, CoinGecko data shows, a less than 1% movement over seven days.\n\nAD\n\nAD\n\nBefore Grayscale’s Bitcoin ETF started trading, it had operated like a closed-end fund where investors could not redeem their shares for BTC. However, following its conversion and subsequent trading, investors started to cash out quickly.\n\nThis led Grayscale to send huge amounts of the cryptocurrency to its custodian, Coinbase, leading to pressure on BTC’s price.\n\nGrayscale’s sell-off slowed towards the end of the week—likely leading to the rebound in BTC’s price.\n\nIt’s not all bad news, though: Analysts told Decrypt that Bitcoin “could see increased appeal” in 2024—if the Federal Reserve slashes interest rates.\n\nBut BTC’s plunge in the week hit the wider crypto market. Ethereum (ETH) was a big loser, dropping to $2,186 on Tuesday and never really recovering, logging an 8% loss over the week. It’s now trading for $2,264.\n\nAD\n\nAD\n\nIts drop came following the U.S. Securities and Exchange Commission’s decision to delay ETH ETF proposals from both BlackRock and Grayscale.\n\nElsewhere, Solana (SOL) took a beating. It was, at the start of the week, one of the worst-performing cryptocurrencies. It has since picked up and is trading for $92.60, a more than 1% seven-day rise.\n\nWhile Dogecoin (DOGE)—the original meme coin and 11th biggest cryptocurrency—pumped at the start of the week over speculation that it might be used for payments on Twitter, it slowly drifted back to where it started. It kicked off the week at $0.08, and is back at the same spot as of writing.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiZkFVX3lxTE9rZTZWUUd5enBXN0x0cXFFVXQ0YkZYSDBNSU00V1Y3emdXcG5teXN3cEwtSHliTkowWHdaM0c3MGtNSGc1akVCT3c2SjgwMEdhZW81aDhfYU9hX0NnTmVkZ01sTzlUZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Roughly ‘60% chance’ of spot ETH ETF approval in May: Seyffart - Blockworks",
        "content": "Spot ether ETFs have roughly a 60% chance of being approved in May, according to Bloomberg Intelligence analyst James Seyffart.\n\nEarlier this week, the Securities and Exchange Commission delayed decisions on the potential BlackRock and Grayscale ether ETFs. Alongside BlackRock and Grayscale, Ark 21Shares and VanEck are also in the running for a spot ether ETF.\n\nThe delays were not surprising, according to experts who expect the SEC to put off a decision on the ETFs until later this year. The SEC, earlier this month, approved a slew of bitcoin ETFs.\n\nRead more: Race for a spot ether ETF begins with bid from Ark Invest, 21Shares\n\nSeyffart is eyeing May 23 as the next date to watch in the spot ether saga. May 23 marks the 240-day window for the SEC to decide on proposals from Ark/21Shares and VanEck.\n\n“My base case is still probably around 60-ish percent that they’ll approve them” around that date, he told Blockworks. “But there’s plenty of ways they can delay.”\n\n“So if the SEC wants to get geared up and ready to go and wants everyone to go at the same time, they’ll likely do it on May 23 unless they can figure out some way to deny or delay this whole process and do what they want,” he continued.\n\nIf a May approval doesn’t pan out, then Seyffart plans to watch 2025.\n\nGrayscale is taking a similar approach to its bitcoin ETF by trying to convert the Grayscale Ethereum Trust (ETHE) into an ETF.\n\nThe company’s Chief Legal Officer Craig Salm said in a radio interview that the firm is looking at summer 2024 for an SEC decision.\n\n“That clock will come due sometime this summer,” he said.\n\nRead more: After spot bitcoin ETF approval, eyes shift to ether fund decision\n\nIts application for a bitcoin ETF was initially denied which led the firm to file an appeal. Back in August, a panel of judges sided with Grayscale, leaving the SEC to reconsider the application.\n\n“This ruling opened the floodgates for BTC, so to speak. And also put the SEC in a logical pretzel,” Van Buren Capital general partner Scott Johnsson said.\n\nFast forward to January, and Grayscale was one of nearly a dozen firms approved to launch. It is also the fund with the highest number of outflows since the ETFs went live earlier this month.\n\nJohnsson further gave his insights on the possible ETH ETF roadmap in a post on X Thursday.\n\nLoading Tweet..\n\nHe noted that there’s a lot of “nuance right now,” but he expects that, in the long term, “ETH spot is almost guaranteed.”\n\nHowever, the SEC can choose to ask potential issuers to pull their applications or issue denials when the May deadlines come around. If the SEC were to ask Ark/21Shares or VanEck to withdraw then it’s a “good indication that the SEC is going to approve these,” Seyffart said.\n\n“The SEC might just need more time to get up to speed with Ethereum versus Bitcoin,” he added, noting how different the two are.\n\nCaution, Johnsson said, “is warranted in assuming spot ETF approval.”\n\nLoading Tweet..\n\nJohnsson believes that the existence of ether futures ETFs is a bright spot for the potential green light, having seen that the SEC approved the bitcoin ETFs partially on that basis.\n\nSeyffart added that the SEC could say that the futures market isn’t “large enough or liquid enough or impactful enough” when looking at spot ether ETFs.\n\nBut, as May approaches, there should be clues that “inform” the public as to what the SEC is thinking.\n\n“There’s a few different things that we can look to to get a feel for what’s going on that we don’t have yet, and I wouldn’t expect us to have it for some time. Perhaps another month or two,” Seyffart said. These things include filings and responses from both the issuers and the SEC.\n\n“It would certainly not surprise me if the SEC decided to avoid the [DC Circuit] at all costs and simply issued approval,” Johnsson said in a post on X.\n\nSEC Commissioner Hester Peirce, in an interview earlier this week, said that the SEC “shouldn’t need a court to tell us that our approach is arbitrary and capricious in order for us to get it right.”\n\nShe added that the SEC will “apply precedent” to spot ether decisions.\n\nCurrently, Seyffart told Blockworks, the process for spot ETH approval reminds him of July of last year. Around that time, BlackRock and other issuers were about a month into the spot bitcoin ETF race and the Grayscale decision had yet to be issued.\n\n“I know the timeline isn’t exactly lining up that way, but what we know and what we don’t know are kind of in the same boat,” he said.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiU0FVX3lxTFBoM1pLZ1lHMFN2WnF5bk1Fa0lfTUZpR3hVWG44c3RYeTRraHVtQ1hRa19vWERkU1BvYUpzV0ZVUXJNNVBlRFpub3FxSDkwYmJ2dlZV?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 27 Jan 2024 08:00:00 GMT",
        "title": "Top 6 Ethereum Facts : All You Need To Know - CoinGape",
        "content": "Ethereum stands as a decentralized blockchain platform driven by the Ether token, offering users a versatile range of capabilities. From facilitating transactions to playing games, engaging in cryptocurrency trading, storing nonfungible tokens (NFTs) earning interest through staking, and even participating in social media activities, the platform presents a comprehensive ecosystem.\n\nMany envision Ethereum as the natural progression of the internet. While centralized platforms like Apple’s App Store embody the era of Web 2.0, Ethereum represents the dawn of Web 3.0—a decentralized, community-driven network. This new phase in internet evolution supports decentralized applications (DApps), decentralized finance (DeFi), and decentralized exchanges (DEXs). It’s crucial to note that Ether, not Ethereum, is the designated crypto unit.\n\nadvertisement\n\nNow, let’s unravel some lesser-known facts that add intriguing dimensions to the Ethereum narrative.\n\nEthereum’s Supply Dynamics\n\nUnlike Bitcoin, Ethereum takes a different stance on token supply. With over 120 million its tokens circulating, a stark contrast emerges—over ten times more tokens than Bitcoin. While Bitcoin’s value is influenced by its approaching finite supply of 21 million coins, Ethereum follows a different trajectory, emphasizing abundance over scarcity.\n\nBitcoin’s imminent scarcity pushes its value higher and poses challclassicenges to mining. The philosophy is straightforward: fewer coins available often translate to higher cryptocurrency value. Once a cryptocurrency reaches its maximum supply, mining stops, and market dynamics revolve around supply and demand.\n\nIn contrast, Ethereum doesn’t impose a fixed supply cap. Instead, it employs a mechanism called “minimum viable issuance” to manage Ether’s inflation rate, ensuring network security and motivating validators.\n\nThe platform’s issuance rate undergoes adjustments through Ethereum Improvement Proposals (EIPs) and community consensus. Diverging from Bitcoin’s fixed cap, it introduces a flexible approach, allowing for ongoing adjustments to maintain balance within the network. Notably, EIP-1559 introduces a deflationary element by burning a portion of ETH as a base fee, contributing to the evolving economic dynamics of the cryptocurrency.\n\nEthereum’s Dual Narrative\n\nThe Ethereum community faced a seismic event in 2015—the DAO hack, resulting in a substantial loss of $150 million worth of tokens. To salvage Ethereum from the brink of collapse, a consequential decision was made: a hard fork. However, a faction within the community, guided by the principle of “Code is law,” opted to adhere to the original code. This pivotal moment birthed two chains—the forked chain retaining the name Ethereum, and the original chain christened Ethereum Classic, which continues to follow the Proof-of-Work (PoW) consensus mechanism, preserving the ethos of the original code.\n\nThe Genesis: Birth and Philosophy\n\nEthereum’s beginnings trace back to 2013, involving a collective effort by eight individuals, including the visionary Vitalik Buterin, who crafted the coin (ETH) in Switzerland. With its official launch in 2015, Ethereum’s origin story bears the imprint of Buterin’s dissatisfaction with centralized services—a sentiment molded by his experiences in the world of World of Warcraft. This critical perspective formed the philosophical foundation of Ethereum, steering its path toward decentralization.\n\nIt’s crucial to avoid confusion between Ethereum and Ether. Ether, the native token, serves as a virtual coin within the Ethereum network, much like other digital currencies. Beyond being a tradable asset, Ether plays various roles—it is used for transactions, runs applications within the Ethereum network, and serves as a means to monetize activities conducted on the platform.\n\nEthereum’s move towards Proof-of-Stake\n\nIn the early days, both Bitcoin and Ethereum relied on a process called “Proof-of-Work” (PoW), where individuals could mine new tokens by validating blockchain transactions on their personal computers. However, in September 2022, Ethereum (ETH) underwent a significant transformation, moving away from PoW to embrace Proof-of-Stake.\n\nUnder PoS, new coins are created when crypto owners “stake” their own coins, essentially locking them up to participate in transaction verification and, consequently, earn rewards. While this method was already employed by Solana (SOL) and Cardano (ADA), Ether swiftly ascended to become the leading cryptocurrency in terms of staked value.\n\nThe primary motivation behind this shift lies in energy efficiency. The energy consumption associated with Ethereum transactions was staggering, equating to over 100,000 VISA transactions in December 2021. However, post the Ethereum Merge, the energy footprint notably decreased. Observers believe that this change not only influences public perceptions of cryptocurrencies but also holds implications for the future development of popular decentralized finance (DeFi) categories within Ethereum, such as crypto lending.\n\nExploring Alternatives to “Proof-of-Work”\n\nEthereum encountered a pivotal moment known as the “Split,” sparking a quest for alternatives to the traditional “Proof-of-Work” (PoW) model. As some enthusiasts applaud the reduction in energy costs, not all its formerminers welcomed the Merge, a transition away from the PoW model.\n\nIn September 2022, a revealing graphic displayed a substantial dump of Ethereum (ETH) by miners holding blockchain addresses linked to their mining activities. Expecting a price surge post-Merge, these miners were disappointed, leading to the selling of their ETH holdings.\n\nThe blockchain witnessed a surge in transaction counts, reaching approximately 1.1 million per day in September 2022. This uptick in activity coincided with the aftermath of the Merge and the subsequent dissatisfaction among miners. The dissatisfaction prompted a significant number of miners to part ways, seeking alternative cryptocurrencies for their mining endeavors.\n\nEthereum’s Crowdfunding\n\nEthereum’s inception traces back to a community-driven initiative, spearheaded by its creator, Vitalik Buterin. In 2013, Buterin conceived the idea of decentralized blockchain platform, inspired by a sense of dissatisfaction with the limitations he observed in Bitcoin. His vision extended beyond the constraints of existing blockchain technology, aiming to create a platform capable of supporting intricate and diverse applications.\n\nIn 2014, he initiated a community-backed fundraising effort, selling the initial batch of Ethereum tokens known as Ether (ETH) to the public. This crowdfunding campaign marked a significant milestone, surpassing expectations and raising over $18 million in just 42 days. Notably, this successful endeavour propelled the blockchain into the ranks of the first and largest crowdfunded projects in history.\n\nEthereum’s journey began not only as a technological innovation but as a testament to the power of community support, illustrating how collaborative efforts can pave the way for ground breaking projects in the ever-evolving landscape of blockchain technology.\n\nBonus: Ethereum’s Growing Influence in Tech Boardrooms\n\nBeyond the realm of developers and investors, Ethereum has captured the attention of major corporations. Giants like Microsoft, J.P. Morgan, Intel, and Amazon are exploring itspotential solutions. Enterprise software companies, including IBM and Deloitte, are testing the platform’s networks, signaling a broader acceptance of blockchain technology in corporate landscapes.\n\nConclusion\n\nIn the dynamic landscape of blockchain, Ethereum stands as a pioneer, symbolizing innovation, adaptability, and community-driven progress. Beyond its decentralized framework, the popular platform embodies the essence of Web 3.0, ushering in a new era of user empowerment. From token dynamics to the Proof-of-Stake transition and corporate intrigue, Ethereum’s journey reflects a dynamic intersection of technological evolution and philosophical principles. As it charts the course for decentralized possibilities, it serves as a testament to collective spirit in advancing blockchain technology."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxNNDhiQkxlRW0tSGE2Yjdua3BZVXJxQUFQTU9yMmRaejRVcGRoUHBBOV8wZS1fcHBrTXMyLWo0MWttUFJKOXNVanNKUlVOUG9FX3lhVnZpc0R5VUJfWFNnY0xCZEVwMzFNeXBiRV9pWkNQanFoSEtIME9oVkpGZV9pUnh3Y05WU1FYeFY5YTAtSlU1TmwzZmNWZl9RSQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Arbitrum Close to All-Time High in ETH Held in Its Smart Contracts - Unchained",
        "content": "The rollup holds about 4.5 million ETH in its smart contracts, a 13% increase in the past 30 days and a 104% jump in the past year.\n\nArbitrum has attracted the most ETH among all blockchains.\n\nArbitrum, the leading rollup scaling solution for the Ethereum blockchain, is close to its all-time high for the amount of ETH held in its smart contracts.\n\n“Arbitrum has made a lot more progress in decentralizing/securing their L2,” Paul Vaden, a core contributor at derivatives trading platform Lyra, wrote to Unchained on Telegram. “So, for people who want to move to a safe battle-tested L2, Arbitrum is the obvious choice.”\n\nUsers bridge their ether to Arbitrum for a variety of reasons. For example, users may want to trade on protocols based only on Arbitrum such as GMX, transact with lower costs compared to Ethereum, or experiment with Arbitrum’s technology stack.\n\nArbitrum holds nearly 4.5 million ETH in its smart contracts, a 13% increase in the past 30 days and a 104% jump in the past year. Optimism, Base, zkSync Era, and Linea’s combined amount of ETH is less than Arbitrum’s figure, data from layer 2 analytics website growthepie.xyz shows.\n\nRead more: Arbitrum Commands Nearly Half of Total Market Share in Ethereum Rollups: Nansen\n\nArbitrum reached an all-time high of more than 4.5 million ETH in its smart contracts roughly three weeks ago on January 5.\n\nRollups, considered scaling solutions for Ethereum, aim to optimize transaction speed and cost efficiency for users by moving computation off-chain and bundling a collection of transactions before posting them to Ethereum’s base layer.\n\nThe main Arbitrum bridge currently holds more than 1.4 million ETH, making it the sixth-largest holder of ETH, behind Ethereum’s staking deposit contract, the smart contract for wrapped ETH, one Binance wallet, one Kraken address, and Robinhood.\n\nThe number of ETH in this Arbitrum bridge has more than doubled in roughly the past five months from about 700,000 in Sept. 2022, data from blockchain explorer Etherscan shows, highlighting how people have been increasingly moving their ETH from Ethereum’s base layer to Arbitrum’s layer 2.\n\nDisclosure: Arbitrum is a sponsor for Unchained."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxPX0taYTZVdjB6UHZvelBpb3Z2YjE5MlNWUXJvOG9reUY0SjVEMlYxU1pzWWJ4N25kMzYzaFl0VGZxWUcwQjZYSGh4OFU5VVpRR3VWbXZPdG8yb1BET0w1bDUzOTBuTWRReHViTkI0YVZSanJkWXlvU0N2R0t1WlZBUF9kOHdWQWc3LXBiTE1tQVdzZ043?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Analyst projects Ethereum potentially to $2k amid market consolidation - crypto.news",
        "content": "FxPro senior analyst Alex Kuptsikevicha projects Ethereum’s price could further dip towards $2,000, as the altcoin is down by over 8% weekly.\n\nThe crypto market is experiencing a period of subdued volatility, with the total market capitalization hovering around $1.6 trillion for the third consecutive day. Simultaneously, equity indices in the stock market have also significantly declined in the past 24 hours.\n\nHowever, the impact on cryptocurrency investors has been minimal. Kuptsikevich thinks that the fall in stock values is seen more as a result of individual corporate stories rather than an indication of a global shift in market sentiment.\n\nBitcoin is benefiting from this consolidation phase, with its market share exceeding 50% once again. On the other hand, Ethereum has found itself at the lower end of the consolidation range, which it has been in for most of December. Kuptsikevich predicts that Ethereum is showing signs of possibly dropping to the $2,100 area, a level that marked the upper end of its November consolidation phase.\n\nETH 7-day market performance | Source: CoinMarketCap\n\nYou might also like: OKX shuts down mining pools after five years of operation\n\nKuptsikevich suggests that a further decline towards the $2,000 mark is possible, citing the cryptocurrency market’s inherent volatility. This potential dip could mirror a similar retracement in Bitcoin to the $37,500 level.\n\nThe SEC has also delayed its decision on BlackRock’s application for a spot Ethereum ETF until March 10. While some experts remain optimistic about the ETF’s approval by May, with a probability of 50-to-70%, others are wary of regulatory resistance.\n\nThe introduction of spot Bitcoin ETFs in the U.S. has broadened the appeal of cryptocurrencies to a wider audience. According to the head of institutional at Coinbase, this marks a potential shift towards mainstream adoption of digital currencies.\n\nHowever, the influx of new capital into new cryptocurrencies is expected to be a gradual process, unfolding over months or even years."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxPYUt1VldXSGJmQ0FmREd3aU9xWUNsWEtZZkJ3OGYtcE9rRkZXNElQbXVvYXdCazhwajVqZ0h1TnQwY2t6c3dtWUg5VE1fQkFXUm82TGJqemZOU1BYcGNHYVhUV0tqZTh3Wjl0MjZfNEswSDRyVU9CdExGN0FZYmVXQkhEbjRfV0NmRTF0MUx6OUpXVlBDeWtZd1VFaXFab3JyaE9DS3pOYzZESkFVRnZJSdIBtgFBVV95cUxNc0dicHVWbmVmaF9IdUJlWmlfX2p2NXdKQ011eFFsdVo2T0tRR0tMQW1MVnB6ZWsxU2lfdFQwY2I2VVJwUmhVbHZKaEhZUkUtYmtfYXZyXzh3WHJkRk4tNkY4elJqaWpKeHBKRDU0WjZGbERXTEF1TXd6TTZCakZEV1pIWXoyRVhCdHBOa0ZLSFEtZ01SS3R1QUhRRzRTUHpVWERubTlQMW9UZEVEZFhjVVhGR1EyUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 27 Jan 2024 08:00:00 GMT",
        "title": "XRP Starts Moving Earlier, Solana (SOL) Already Stronger Than Everyone Else; Does Ethereum (ETH) Need More Fuel? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nXRP appears to have begun its market movements earlier than anticipated. The chart shows a notable shift from the recent sideways trading pattern, as XRP starts to carve out a new direction.\n\nAs of the latest trends, XRP has been testing the support level around $0.50, a crucial psychological threshold for the asset. A sustained move below this level could signal further bearish momentum, potentially leading the price to test the next significant support zone around $0.47.\n\nOn the flip side, if XRP manages to stabilize and bounce back from the current support, the initial resistance is likely to be encountered near the $0.54 mark, where the 50-day moving average currently lies. This moving average has historically acted as a dynamic resistance level, and a breakout above could propel XRP toward the $0.56 level, which aligns with the 100-day moving average.\n\nFurther complicating the chart is the downward trendline that has been in play since the local high established in November. This trendline has repeatedly acted as resistance, pushing the price downward each time it has been tested. For a true reversal to be confirmed, XRP would need to break above this trendline with significant volume to validate the move.\n\nAdvertisement\n\nSolana is leading pack\n\nSolana is manifesting its strength as the top performer among the top 10 cryptocurrencies by market capitalization. Despite overall market volatility, SOL's price action has been signaling a stronger recovery compared to other assets.\n\nAt the time of analysis, Solana is trading around the $90 mark, having rebounded with considerable momentum from the support level near $78.35. This pivotal point, bolstered by the 100-day Exponential Moving Average (EMA), has served as a springboard for the recent bullish trend. The price of SOL has been consistently creating higher lows, indicative of strong buying interest at these levels.\n\nResistance for SOL is currently looming at the $100 psychological level, a breakthrough of which could propel the price toward the next significant resistance at $110.\n\nThe relative strength of Solana is further substantiated by the resurgence of a risk appetite on the market, particularly evidenced by the blossoming of meme coins. This renewed interest in higher-risk assets typically bodes well for ecosystems like Solana that support a variety of decentralized applications and niche crypto projects.\n\nEthereum needs push\n\nThe Ethereum market is currently facing a confluence of challenges as it searches for the momentum to sustain its position. A recent chart analysis reveals an indecisive atmosphere among investors, with Ethereum struggling to find a strong directional move.\n\nAt present, Ethereum is hovering around the $2,200 mark, a level that has seen significant activity and is currently acting as a temporary support. However, the lack of bullish conviction suggests that this support level may not hold if a new wave of selling pressure emerges.\n\nResistance levels are observed near the $2,400 range, where previous attempts to break higher have been met with a firm rejection, indicating a substantial barrier to upward movement.\n\nThe selling pressure is partly attributed to the recent news of Celsius Network liquidating approximately $1 billion worth of Ethereum holdings. This substantial amount has the potential to saturate the market, overwhelming current liquidity and triggering a downturn. As a result, the $2,000 psychological level is eyed as the next critical support zone, a breach of which could see a sharp decline toward the $1,950 region, where the 200-day moving average lies, providing stronger historical support.\n\nOn the flip side, if Ethereum can absorb the selling pressure and gain the necessary \"fuel,\" a push above the $2,400 resistance could open the path toward the $2,500 area before challenging the more formidable resistance at $2,600, which aligns with the 50-day moving average."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxPQWZ2SXlKRU8wZjkwSERfYTU2Q05vaUVhWWRwMC12UU5SS0FJSUpLUFEwMDBlRkt6cnNoWmNGUHJKZGFHOHpFOXNLMVc2Vldtczh0RlJUVnYya3VoVkJzdGxRbGRxNUdscEc4M2dqNkk4N3RWbjNxQ05zNjdHRXBFYmc1b1VzYXBVcEcxZmJSVnBCNjJOVkJxQlhJRVk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Scaling Solution AltLayer Launches With $100 Million Airdrop - TOKENPOST",
        "content": "Ethereum Scaling Solution AltLayer Launches With $100 Million Airdrop\n\nAltLayer recently became the first of at least three protocols to go live with an impressive $100 million token airdrops scheduled for the upcoming week. The launch marks a milestone in the field of blockchain technology, offering promising solutions for Ethereum's scalability issues.\n\nThe much-anticipated ALT token and the claiming process were officially made available to the public as of Jan. 25, 9 am UTC, as per Cointelegraph. A staggering 300 million tokens were allocated for the initial airdrop, resulting in a total value of approximately $96 million based on the current average daily price of $0.32 per token.\n\nHowever, Celestia stakers eager to participate in the ALT airdrop will have to exercise patience as AltLayer reported technical differences delaying the distribution to Celestia. Despite this delay, AltLayer's airdrop comes at a time when several other projects are also expected to distribute their respective tokens to eligible recipients within the same timeframe.\n\nDymension and Jupiter to Follow Suit\n\nAccording to ADVFN, among these projects is Dymension, a multilayer rollup deployer poised to launch its mainnet in the near future. Dymension plans to airdrop 70 million DYM tokens, primarily benefiting Celestia stakers and Pudgy Penguin NFT holders, as well as participants in the Solana and Ethereum ecosystems.\n\nFurthermore, the Solana-based decentralized exchange Jupiter has confirmed the launch of its highly anticipated JUP token on Jan. 31. A total of 1 billion tokens will be distributed through the airdrop, making it potentially worth around $410 million based on the current pre-market trading price of approximately $0.41 per token.\n\nBitcoin Ordinals Users Could Benefit from Airdrop\n\nIn addition, Bitcoin Ordinals users may also have an opportunity to participate in an airdrop. Ordinals developer Leonidas recently announced the launch of \"Runestone,\" a decentralized \"fairdrop\" initiative designed to reward early users of the Ordinals protocol. The airdrop aims to incentivize users' early adoption and engagement.\n\nWhile airdrops offer exciting possibilities, crypto users must exercise caution. The X platform is currently plagued by scam accounts posing as crypto firms' official social media pages announcing airdrops. Users must remain vigilant to avoid falling victim to these fraudulent schemes.\n\nPhoto: Traxer/Unsplash\n\nTokenPost | [email protected]"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxOdXltZEFTMnYzRFd1czBfZXJlR3JmNC0zMVlNWUw5LWEwMkRHZm1iVHZ3ZE9PR3hYaHpJOE5HVm5ydFMxQ1g3d0tHOU1yQzFDYW1xTGtydUxzTDlNS3RINWdxcnVyUnpCRnI3ZU9PQk5HTUt1RjV1SHZFeGVkMzBhaERRZUR0RHlZVE12WVBncGY2QXA0S0hJ0gGcAUFVX3lxTE43Z0JCb2FZY1dLX2hVNV9oMkhLSkVrQkxiQXEyTGRBNmZDQl9SVjBmOFJYX0Z6Y0p1MFdmS0czTGFjVEZUNV8wRjBlTWpGaGhBVzFPVm8xb1RHdzVnV3NVYmN3TEdLRml3WlhJQV9KX0lzeG9OdFo0bjUzeHV4bWV4bVFwTm92aGJMQnNnSGlCZlJYMi01TTlJSFNyVw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Ethereum could end consolidation with a dip towards $2000 - FxPro News",
        "content": "Market picture\n\nVolatility in the cryptocurrency market remains subdued, keeping the capitalisation near $1.56 trillion for the third day. Meanwhile, Bitcoin remains around $40K, and Ethereum looks pegged to $2200.\n\nThe drop in equity indices over the past 24 hours hasn’t been too much of a concern for cryptocurrency investors so far, as it looks more like a series of individual corporate stories rather than a global shift in sentiment.\n\nBitcoin is benefiting from this consolidation as its share of all cryptocurrencies has once again surpassed 50%.\n\nMeanwhile, Ethereum, the second most-capitalised coin, has returned to the lower end of the consolidation it spent most of December in, losing since the start of the day and threatening to fall a notch lower to the $2100 area, which was the upper end of the consolidation in November. A decline here would be as logical a move as a BTCUSD pullback to $37500, which remains the main scenario. At the same time, however, be prepared for a brief dip towards $2000 due to cryptocurrency volatility.\n\nNews background\n\nThe SEC postponed the decision on BlackRock’s application to launch a spot Ethereum ETF until 10 March. Optimistic experts expect the Ethereum ETF to be approved in May with a 50-70% probability, while sceptics point to regulatory resistance.\n\nThe emergence of spot bitcoin ETFs in the US has opened the door for the cryptocurrency to reach a wider audience. Now, for the first time, cryptocurrency could become mainstream, said the head of institutional at exchange Coinbase. New cryptocurrencies will attract a lot of capital, but it won’t happen overnight. It will take “months and even years”.\n\nThe G20’s Financial Stability Board in 2024 plans to focus on global regulations for the digital asset industry and the regulation of artificial intelligence.\n\nReuters confirmed the existence of a thriving underground crypto market in China. Investor interest in digital assets is growing against the backdrop of a troubled economy and a lack of value preservation tools. With Hong Kong’s approval of digital assets in 2023, Hong Kong has become one of the opportunities for Chinese investors to access cryptocurrencies."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxQQXdmOXBvRm54Qm51Y0RKVmU1cC00d3IwZXRFME1qc0pwQ3dvdFlrWTdRa0dNN2tvSDhKYTYxZ1pWc1ZlSE54VTFMMVhWYWZmaVNUbTFEeUZhV3c0Qk5TNF9yRGM3SGQwQ3h5NjZPdHdRaFZ4bnZYSXFDWlBYSFJTdGJWbWFGREZGQ3F0RUluZEtxNmROSTJlaUhrU3FLaWtTczdj?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Lif3 Accelerates DeFi Adoption and Innovation with BitFinex Listing - Brave New Coin Insights",
        "content": "Lif3 Accelerates DeFi Adoption and Innovation with BitFinex Listing\n\nToday, $LIF3, a ground-breaking and complete omni-chain DeFi Layer-1 Curated Blockchain ecosystem, announces its recent listing on Bitfinex, a premier digital asset trading platform, after recently migrating to the Ethereum Network from Fantom.\n\nToday, $LIF3 (pronounced Life), a ground-breaking and complete omni-chain DeFi Layer-1 Curated Blockchain ecosystem, announces its recent listing on Bitfinex (https://trading.bitfinex.com/t/LIF3:USD), a premier digital asset trading platform, after recently migrating to the Ethereum Network from Fantom.\n\nThis announcement coincides with Lif3’s vision and commitment to breaking down barriers to cryptocurrency, enabling easier adoption for consumers entering DeFi, through the Lif3 Mobile App. Lif3 provides a platform for exclusive event access, on-ramping, investing, trading, earning, gaming, and off-ramping.\n\nThis announcement coincides with Lif3’s vision and commitment to breaking down barriers to cryptocurrency, enabling easier adoption for consumers entering DeFi, through the Lif3 Mobile App. Lif3 provides a platform for exclusive event access, on-ramping, investing, trading, earning, gaming, and off-ramping.\n\nBitfinex Listing\n\nThe Bitfinex listing allows for professional traders to trade $LIF3 through a top tier exchange.\n\nDeposits for LIF3 will commence on January 23, 2024, at approximately 1:30 PM UTC. Trading is scheduled to start on January 25, 2024, at approximately 3:30 PM UTC, with LIF3 being tradable against US Dollars (LIF3/USD) and Tether tokens (LIF3/USDt).\n\n“The addition of LIF3 to our offerings is a significant step in our commitment to embracing innovative financial solutions. LIF3’s features include crypto swapping, yield farming, and a secure mobile wallet”, said Henry Child, Head of Tokens.. “This listing underscores our commitment to advancing the DeFi space with cutting-edge solutions,” he added.\n\nTo obtain access to $LIF3 on Bitfinex, customers can visit: https://trading.bitfinex.com/t/LIF3:USD\n\nEthereum Migration\n\nThe Lif3 protocol has recently migrated to Ethereum from Fantom Network. This move is not just a change of platform but a leap towards broader market accessibility and ease of trading of the $LIF3 token. According to the team behind Lif3, the transition simplifies the purchasing process for users, enabling easier acquisition of LIF3, and paves the way for Lif3’s further expansion.\n\nThe migration to Ethereum also marks a new chapter in Lif3’s journey. It represents a move towards a platform with a more extensive user base, offering increased exposure and potentially higher transaction volumes. This shift is about harnessing the strengths of Ethereum’s ecosystem, providing Lif3 users with easier methods of acquiring $LIF3 and improved reliability, crucial for DeFi transactions.\n\n“This Bitfinex listing in addition to the migration to Ethereum will expand Lif3.com and its market accessibility while enhancing efficiency in cryptocurrency transactions through consumer DeFi, unlocking more opportunities within the dynamic world of decentralised finance and beyond. We are not only excited for the recent migration to Ethereum, in addition to being available on Fantom, BNB Chain and Polygon – but also opening up a larger market and simplifying the purchase process for users, particularly in acquiring mainstream tokens like USDT and ETH”, says Kean Laurens, Head of Product.\n\n“The early stage of DeFi adoption presents unique challenges, including the complexity of swapping, staking, and bridging various chains. Recognizing Ethereum’s widespread recognition and trust factor, Lif3 aims to reduce entry barriers and foster a smoother transition into its ecosystem. Lif3 was conceived with a clear mission to make DeFi interactions and investments seamless and safe, especially for newcomers. Our visionaries in the crypto realm identified a need to simplify the on-ramping process and offer a unified platform for various DeFi activities,” emphasises Kean.\n\nLif3 Ecosystem\n\nLif3.com is a complete, omni-chain DeFi ecosystem, Curated Layer-1 blockchain, and a self-custody wallet available on the App Store and Google Play – unlocking the potential of Web3 through consumer DeFi, iGaming and the Entertainment Sectors.\n\nNow available on multiple blockchains: Ethereum, Polygon, BNB Chain, and Fantom – Lif3 offers a comprehensive suite of DeFi products that transcends beyond a mere platform and an entire curated ecosystem.\n\nThe ease of use for consumer DeFi, broader market accessibility and adoption are some of the key missions for Lif3. Through the use of a consumer focused and easy to use DeFi wallet, this results in a heightened efficiency in cryptocurrency transactions, signifying a quantum leap for both Lif3 and the future of digital finance in the Web3 space.\n\n“As an investor and Lif3 enthusiast, I am thrilled Lif3 is officially listed on Bitfinex, a renowned platform that shares Lif3’s commitment to innovation and excellence in addition to the Layer Zero partnership, in supporting the migration to the Ethereum Network. This listing signifies a crucial quantum leap in providing increased visibility and accessibility to a broader audience of investors and other Web3 enthusiasts alike, for a more seamless experience in using blockchain. As the Lif3 ecosystem continues to advance its mission in reshaping the future of finance, this announcement is poised to catalyse further growth and innovation,” says Harry Yeh, Managing Director of Quantum Fintech Group.\n\nEsports Tournament Supercup.gg\n\nLif3.com is also pleased to announce that Lif3 has teamed up with MetaNews and acquired an official licence by Krafton for the PUBG mobile tournament Super Cup, this falls in line with its vision to expand its reach and adoption with the esports user base. The competition will kick off on January 26 and is set to run until January 29, 2024.\n\nThe Lif3 ecosystem includes an architecture for esports which will bridge the gap from antiquated payment processors which cannot satisfy the need for micro-payments required for esports to operate in Web3 between amateur gamers, fans and their favourite esports organisations.\n\nTo learn more, visit https://supercup.gg/\n\nAbout LIF3.com\n\nLif3.com is a complete, omni-chain DeFi ecosystem, Curated Layer-1 blockchain, and a self-custody wallet available on the App Store and Google Play – unlocking the potential of Web3 through consumer DeFi, iGaming and the Entertainment Sectors. To learn more, visit https://lif3.com\n\nTwitter:\n\nhttps://twitter.com/Official_LIF3\n\nLif3 News and Updates:\n\nhttps://lif3.com/news\n\nHow to Buy LIF3 with ETH or USDT on Ethereum:\n\nhttps://support.lif3.com/hc/en-us/articles/8874195179279-How-to-Buy-LIF3-with-ETH-or-USDT-on-Ethereum\n\nFor official LIF3 logos and branding please visit:\n\nhttps://docs.lif3.com/brand-assets\n\nMedia Contact\n\n[email protected]\n\nAbout Bitfinex\n\nFounded in 2012, Bitfinex is a digital token trading platform offering state-of-the-art services for traders and global liquidity providers. In addition to a suite of advanced trading features and charting tools, Bitfinex provides access to peer-to-peer financing, an OTC market and margin trading for a wide selection of digital tokens. Bitfinex’s strategy focuses on providing unparalleled support, tools, and innovation for experienced traders and liquidity providers around the world. Visit www.bitfinex.com to learn more.\n\nBitfinex to List Lif3:\n\nhttps://blog.bitfinex.com/media-releases/bitfinex-to-list-lif3/\n\nFor official Bitfinex logos and branding:\n\nhttps://www.bitfinex.com/press/#press-downloads\n\nAbout LayerZero Labs\n\nLayerZero Labs is the team that launched the leading blockchain messaging protocol LayerZero. LayerZero’s advanced messaging infrastructure seamlessly connects over 30 blockchains and facilitates transparent and secure cross-chain messaging from one easy-to-use interface. Since going live in March 2022, the LayerZero protocol has processed more than 20 million messages with thousands of mainnet contracts being deployed by thousands of developer teams. Backed by leading venture capital firms including a16z, Sequoia, Binance Labs, Christie’s, Lightspeed, Opensea, Bond, Samsung Next, and GBV, LayerZero was recently valued at $3 billion. Developers building on LayerZero can create interoperable, omnichain dApps, which will lead to the establishment of a unified digital asset ecosystem. Visit LayerZero to learn more.\n\nContact\n\nMedia Relations\n\nChantel Elloway\n\nLif3 Labs Limited\n\n[email protected]"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMizgFBVV95cUxPVjVubGtLS1F5OG1TNGhzTmZXLWJpNW5jTzNfMFo5Rl9FYUxvNlA0bnRaY21BeTFLdVliSVNhX04wYUpKZ3E2YTBtYlhzMmRFSFlCXzIxdUx4SFV6MElsZ25HYzZPQ21tTEZHYkRCRkk1MnFyX1oybV9LOG1meE5Mb3dZYUNkbXQ2XzNwYXVnOFVMeDgwYjFhRXZaRXF5M3pSOV9GR3hPS3M0WTBLQ2Y0dVd6WkZNNmpWZHM2aGdLMW1UZWtIRjdsejdNUmlHQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "On chain sleuth ties Ethereum Foundation to 2016 GateCoin Hack as US SEC delays BlackRock’s Spot Ethereum ETF - Tekedia",
        "content": "A new investigation by an on-chain sleuth has revealed that the Ethereum Foundation may have been involved in the 2016 Gate Coin Hack, which resulted in the theft of more than 185,000 ETH and 250 BTC from the Hong Kong-based exchange.\n\nThe on-chain sleuth, who goes by the pseudonym of Boringsleuth, published a detailed report on X, where he traced the origin and destination of the stolen funds using blockchain analysis tools. He claims that he found evidence that some of the hacked ETH was sent to an address controlled by the Ethereum Foundation, and that the Foundation later sold some of the tainted coins on Kraken.\n\nThe Gatecoin Hack occurred between May 9th and May 12th, 2016, prior to at the onset of The DAO’s token sale & 1 Month Prior to The Dao Hack. Per Gatecoin’s official statement on May 14th, the hack resulted in losses of 185K Ethereum, valued at more than $460M today. At the time, Gatecoin “claimed” that the hacker was able to alter their own system to bypass their multi-sig cold storage, so that all inbound Deposits into Gatecoin went straight to their exploitable Hot Wallet.\n\nThey list the 4 Hacker Eth address’ below involved in the Exploit, Among the 4 ETH address’, one address, 0x1342a0, was originally funded PRIOR to the exploit. Our focus in this thread is looking into who it was that funded this Hacker’s wallet, in hopes of gaining an idea of who it was that was behind the Hack.\n\nBoringsleuth’s report is based on the assumption that the hacker used a smart contract to split the stolen funds into smaller amounts and send them to different addresses. He says that he identified the hacker’s contract by looking for transactions that had a high gas price and a low value, which indicated that they were used to deploy a contract.\n\nHe then analyzed the contract’s code and found that it had a function called split Funds , which took an array of addresses and amounts as inputs and sent ETH to each address accordingly.\n\nBoringsleuth says that he tracked down all the addresses that received ETH from the hacker’s contract and found that one of them belonged to the Ethereum Foundation. He says that he verified this by comparing the address with the list of addresses that received ETH from the genesis block, which are known to be controlled by the Foundation.\n\nHe also says that he checked the balance history of the address and found that it received 2,000 ETH from the hacker’s contract on March 15, 2016, which was one day after the Gate Coin Hack.\n\nBoringsleuth claims that he further followed the trail of the stolen ETH and found that some of it was sold on Kraken between April and June 2016. He says that he identified the Kraken deposit address of the Foundation by looking for transactions that had a high value and a low gas price, which indicated that they were used to transfer ETH to an exchange.\n\nHe then cross-referenced the address with Kraken’s API and found that it matched with one of the Foundation’s accounts. He also says that he checked the trading history of the account and found that it sold 1,337 ETH for BTC between April 4 and June 13, 2016.\n\nBoringsleuth concludes his report by saying that he has contacted both Gate Coin and the Ethereum Foundation to inform them of his findings but has not received any response from either party. He says that he hopes that his investigation will shed some light on one of the biggest unsolved hacks in crypto history, and that he will continue to monitor the movement of the remaining stolen funds.\n\nUS SEC delays BlackRock’s Spot Ethereum ETF\n\nMeanwhile, the US Securities and Exchange Commission (SEC) has postponed its decision on the approval of BlackRock’s Spot Ethereum ETF, a fund that would track the price of the second-largest cryptocurrency by market capitalization. The SEC said it needed more time to evaluate the proposal, which was filed by BlackRock in October 2023. The new deadline for the SEC’s decision is March 29, 2024.\n\nBlackRock is one of the world’s largest asset managers, with over $9 trillion in assets under management. The company has been exploring the crypto space for a while, and already offers exposure to Bitcoin futures through some of its funds. However, the Spot Ethereum ETF would be the first of its kind to directly invest in the underlying asset, rather than derivatives.\n\nThe SEC has been cautious about approving crypto ETFs, citing concerns about market manipulation, volatility, custody, and investor protection. So far, the regulator has only approved Bitcoin futures ETFs, which trade on regulated exchanges and are subject to margin requirements and clearinghouse oversight. Spot ETFs, on the other hand, would hold the actual cryptocurrencies in custody, and would require the SEC to grant exemptions from some of its rules.\n\nThe crypto community has been eagerly awaiting the approval of spot ETFs, as they would provide a more convenient and accessible way for investors to gain exposure to the nascent asset class. Spot ETFs would also potentially boost the liquidity and price discovery of the underlying cryptocurrencies, as well as attract more institutional investors to the space.\n\nHowever, the SEC’s delay is not surprising, given its history of postponing or rejecting crypto ETF proposals. The regulator has repeatedly asked for more information and feedback from the public and the industry on various aspects of crypto ETFs, such as valuation, liquidity, arbitrage, market surveillance, and investor education. The SEC has also indicated that it prefers a comprehensive regulatory framework for crypto assets before approving spot ETFs.\n\nBlackRock is not the only company that is seeking to launch a spot Ethereum ETF in the US. Other firms, such as VanEck, WisdomTree, and Bitwise, have also filed similar proposals with the SEC, but have not received any response yet. Meanwhile, Canada has already approved several spot crypto ETFs, including Bitcoin and Ethereum ones, which have attracted significant inflows and trading volumes.\n\nIt remains to be seen whether the SEC will finally greenlight a spot Ethereum ETF in 2024, or whether it will continue to delay or deny such products. The crypto industry is hopeful that the regulator will eventually recognize the benefits and potential of spot ETFs and will align its stance with other jurisdictions that have already embraced them.\n\nShare this: Facebook\n\nTwitter\n\nWhatsApp\n\nLinkedIn\n\nEmail\n\nPrint\n\n"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxPMDNmbW40UDR0RkJzU0NrOXhfTlU1QXFRNGt4czI5bHdNQ09RWVFzb1dvSGcybFg0cUpRaWMtV2cxcVBhaUtPTHRnV2E4M19jUTkxb1ozb21fWTZaREFtMVhfanRoZ3NzTDVWcnVpemVZc2tyQzhUd0xSLWVDQUYxTzNfcVNta3JEV2lNSXd4ZGV1Y2RFa3V2RnNJOEN4M2o5VFdLV2lBa29nRlJ4NTZZ0gG0AUFVX3lxTE51RzRYV1JubHltUmdsdEN1ZjU3VGFtdFhmSHZ4VEYyejlNZWVQSXg1anBaZmNMMWJaVmhSZlBiSUhoRWhkYlNWbXFPby1SV3VjbUo4N3QtU2NwREJIRWhEa2JoWlphdVd4dzgxdTdIZDdnc3A3WUZyZ0x6N2NEeURSLXA1MExveHdUcVRPNGtFR0ozZVpZd05hRmp4dHlxdXdwQmVtcEpHWDJOUFI3WUphSjF4TA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Kelexo (KLXO) Pre-Sale Might Be Impressive Event in 2024 while Ethereum (ETH) and Binance Coin (BNB) Investors Keep Optimism - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nThe presale stage is often the best time to invest in new crypto projects before hype drives up the price. Right now, investors are researching Kelexo (KLXO) presale as supporters shift funds from major assets.\n\nEnthusiasts of Kelexo (KLXO) can take part in pre-sale and buy tokens here .\n\nPotential supporters are watching KLXO\n\nKelexo (KLXO) is revolutionizing the peer-to-peer lending space by eliminating intermediaries and bureaucratic processes. Users can instantly lend or borrow funds in crypto with just a simple setup and without extensive KYC checks or long wait times.\n\nThis straightforward, decentralized model powered by blockchain technology provides significant advantages over traditional lending methods. Borrowers and lenders can connect directly, which removes the expensive overhead costs of intermediaries. Transactions in this marketplace close in seconds instead of days like at banks. Also, there are no minimum loan amounts or durations.\n\nAdvertisement\n\nBy removing these pain points, Kelexo (KLXO) offers users a more efficient way to access lending markets. The minimal identification requirements also enable participation from a wider audience, including those with limited credit history who may not qualify through conventional channels.\n\nKelexo (KLXO) also incentivizes user participation and decentralized governance through its Kelexo (KLXO) token. Token holders can submit platform enhancement proposals and vote on key decisions. An inbuilt rewards program further drives engagement.\n\nWith cutting-edge cryptography guaranteeing security, minimal barriers to access and community ownership, Kelexo (KLXO) represents the future of decentralized finance. It efficiently uses blockchain's capabilities to create a better borrowing and lending experience for all.\n\nKelexo (KLXO) is currently in stage 1 of its presale , priced at just $0.022. The presale supply is 264,000,000 out of a total supply of 440,000,000 and the presale price increases as each stage sells out.\n\nMajor players have started taking notice\n\nIt is important to state that whales and institutional traders have taken notice of the hype surrounding Kelexo (KLXO) (KLXO). Significant volume has shifted on-chain from blue chip cryptos like Ethereum (ETH) and Binance coin (BNB) into Kelexo (KLXO) as presale snipers load up their bags.\n\nThese big players help drive momentum and they’re likely expecting Kelexo (KLXO) to follow previous altcoins that did 100x or more out of the gate after presale.\n\nWith only 57% of the total supply available during the presale, scarcity of Kelexo (KLXO) tokens could drive fear of missing out (FOMO), which could lead to price surges post-listing.\n\nConsidering its strong real-world utility and advantage over existing lending platforms, Kelexo (KLXO) checks all the boxes for a breakout success story.\n\nMany believe getting in during presale could be like investing in Ethereum (ETH) or Solana (SOL) during their early days in terms of upside potential.\n\nAnalysts advise not to miss out on this presale as it could be an opportunity to invest in the top 100 coins of the bull market, an opportunity that is quickly disappearing the longer you delay.\n\nAs most experienced market movers know, investing in solid projects early is where huge gains are often made."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxOLUxIRFRScm91bmtmWXBKVXdUM3FUVEpydXcyNHFmSElUUUJJTDdBQVhKWWFuaW5od0ZUakJ1MFMzVDNjYWUtLXFYX21LVXJNdEZwVFloWlVfM0Fkb05fbGpIQUJKdGN5NmgxZkxGRU1DWXRtaGxUSlNEaXJfTUN5eGFOYkE4aWFJajZXUHc3YnNtTjBOVGhrWUxna9IBoAFBVV95cUxOeFprU1ZuVEtOeWJtM1M4MDNXQlJVdWhxZTBXVnM3by1IYXV4OWxCZGVDS3d2dTZ4UV9jdTU2QUVlbFJhT3YzeFJVWmQ3SUlHNjc2U1pNcXlEZzQ0N3dJSXJCc0t4cll0Y2g1VGhROS1FWHg1Q2tvLW9IbTJYV05ENm1xclRneTlqM3ZGcjJjNXBfcjgwVVNmZGhBYlN0b05Z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "TRUMP2024 or BIDEN2024? How U.S. elections are propping these altcoins - AMBCrypto News",
        "content": "Tokens such as TRUMP2024 and BIDEN2024 surge in popularity ahead of the U.S. elections.\n\nEthereum and Solana could benefit from the heightened interest in the tokens.\n\nThe 2024 U.S. election is one of the most anticipated events of this year. Some token creators have tried to capitalize on the attention around U.S. elections and have created tokens around the same.\n\nShitcoin Update: $BIDEN2024 and $TRUMP2024 on Ethereum are gaining marketcap. Is this the true election? Trending #8 and #11 on @dexscreener. ?https://t.co/8AO3d7z78ehttps://t.co/WXqV4WTt0Z pic.twitter.com/2ntHQHdHBf — MartyParty (@martypartymusic) January 24, 2024\n\nNew tokens have arrived\n\nThe tokens BIDEN2024 and TRUMP2024 are two of the most popular tokens that have been created in this context. The TRUMP2024 token grew by 751% over the last month and was trading at $0.00000000451 at the time of writing.\n\nThe volume at which it was trading grew by 26.69% in the last 24 hours and was currently at 3.69 million.\n\nComing to the BIDEN2024 token, it grew by 694.25% last week and saw a gigantic surge of 1796.25% in volume. At press time it was trading at $0.00000000431 and its volume was $2.41 million.\n\nAs the presidential election inches near, the probability of these tokens seeing more growth is very high. However, after the event, the prices of the token may collapse.\n\nMemecoins are very susceptible to rug pulls and holders should be careful around these tokens. Holders and traders should hedge their bets if they decide to invest in these tokens.\n\nL1 networks gain\n\nEven though some holders may gain or lose out on money eventually, Solana [SOL] and Ethereum [ETH] might see positive returns regardless.\n\nThe hype around these tokens on both Solana and Ethereum may add to an uptick in activity on both of these networks. The networks saw a massive surge in activity over the last few months as well.\n\nAccording to Artemis’ data, the number of daily active addresses on Solana increased from 214,000 to 624,000 in the last 3 months.\n\nSolana was lagging behind Ethereum in this regard earlier, however, at press time, Solana had outperformed Ethereum by a large margin. At press time, the number of daily active addresses on the Ethereum network amounted to 357,000.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nIn terms of transaction activity, a similar trend was observed. Solana completely left Ethereum in the dust in terms of transactions.\n\nAt the time of writing, daily transactions on the Solana network were 27.8 million. Ethereum on the other hand had 1.6 million."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMi-gFBVV95cUxNc3dzWHJJY2xNWVZ5NGNfVmpOTVcxaFJYd0Vma2FfOXQtbm1MVjRaZ1ZwbUI3ajRtdzlKNWtfMC1nalcxdXBndEFpREJJYjE3dk9NTEN2ZmlFV2twNnFhMkhPYVZhN3pVTW0zeENkUXBUZDh6OGh6YWtlOFQ4eGRsci1vbFJ6UC1Ic05raklWNWEybEFPb0VWNTNaYXZsbHBsYkdVVlpiaGFnTEQ4Mk9tX0MybTZ2VEJOTzNqREt5X09RbmtEVUtySlFmTmpNZ0c2YlhxYWNTdkVGNWtqLXF0MXVsRkQ2N1BKcXZ2T3c3U3c0dFhzUEVNZEZ30gH_AUFVX3lxTFBCa0hzbDYzQzN3bUJlVEZ1dmxRMWVMWENaYUEzVkNQQmRwTjE3eUhjRW1lT0tMMEhsWHltMHdVR3VNdzhIRDJ6Vm11d2dFRkhEVGVGeGJWM0trcDBDLWFrenotYkJ0dnRLT1FINWlCQVd1cEdKbDZDRUZpM2NBT0QyTE04aWFIMFdtRDNaY0dkSUpVLTI0M3NRZWlvSy03b2tJb3o1SnlfUXQyaHRSMG9rUkJHRUNMVjRxYWRuOHNWQktyODFURTZWMFBwSkU3cm5VX2hVc193YlNVMVVNeGt5TXYycDRjN3VRdGNnM3RsSTEtU2tGRVRBTTVZU0JLQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Cryptocurrency Price Today: Bitcoin Rises Above $40,000, PYTH Becomes Biggest Gainer - ABP Live",
        "content": "Bitcoin (BTC), the oldest and most valued cryptocurrency in the world, managed to rise above the $40,000 mark early Friday. Other top coins, including the likes of — Ethereum (ETH), Dogecoin (DOGE), Solana (SOL), Ripple (XRP), and Litecoin (LTC) — saw mix of minor gains and dips across the board. The MANTA token, which was the biggest gainer yesterday, turned out to be the biggest loser today, with a 24-hour dip of over 10 percent. PYTH, on the other hand, became the biggest gainer, with a 24-hour jump of over 13 percent.\n\nThe global crypto market cap stood at $1.56 trillion at the time of writing, registering a 24-hour gain of 0.32 percent.\n\nBitcoin (BTC) Price Today\n\nBitcoin price stood at $40,116.38, registering a 24-hour gain of 0.37 percent, as per CoinMarketCap. According to Indian exchange WazirX, BTC price stood at Rs 35.39 lakh.\n\nEthereum (ETH) Price Today\n\nETH price stood at $2,223.92, marking a 24-hour jump of 0.38 percent at the time of writing. As per WazirX, Ethereum price in India stood at Rs 1.99 lakh.\n\nDogecoin (DOGE) Price Today\n\nDOGE registered a 24-hour jump of 0.17 percent, as per CoinMarketCap data, currently priced at $0.07811. As per WazirX, Dogecoin price in India stood at Rs 6.92.\n\nLitecoin (LTC) Price Today\n\nLitecoin saw a 24-hour gain of 0.15 percent. At the time of writing, it was trading at $65.72. LTC price in India stood at Rs 5,889.73.\n\nRipple (XRP) Price Today\n\nXRP price stood at $0.5135, seeing a 24-hour loss of 0.27 percent. As per WazirX, Ripple price stood at Rs 45.\n\nSolana (SOL) Price Today\n\nSolana price stood at $88.04, marking a 24-hour dip of 0.25 percent. As per WazirX, SOL price in India stood at Rs 7,700.\n\nTop Crypto Gainers Today (January 26)\n\nAs per CoinMarketCap data, here are the top five crypto gainers over the past 24 hours:\n\nPyth Network (PYTH)\n\nPrice: $0.4214\n\n24-hour gain: 13.16 percent\n\nChiliz (CHZ)\n\nPrice: $0.1131\n\n24-hour gain: 9.54 percent\n\nIOTA (IOTA)\n\nPrice: $0.2515\n\n24-hour gain: 8.96 percent\n\nConflux (CFX)\n\nPrice: $0.1938\n\n24-hour gain: 7.57 percent\n\nEthereum Name Service (ENS)\n\nPrice: $19.02\n\n24-hour gain: 7.22 percent\n\nTop Crypto Losers Today (January 26)\n\nAs per CoinMarketCap data, here are the top five crypto losers over the past 24 hours:\n\nManta Network (MANTA)\n\nPrice: $2.92\n\n24-hour loss: 10.75 percent\n\nSui (SUI)\n\nPrice: $1.18\n\n24-hour loss: 5.33 percent\n\nInternet Computer (ICP)\n\nPrice: $11.28\n\n24-hour loss: 4.85 percent\n\nFTX Token (FTT)\n\nPrice: $2.62\n\n24-hour loss: 4.05 percent\n\nSATS (1000SATS)\n\nPrice: $0.0004094\n\n24-hour loss: 3.43 percent\n\nSubscribe And Follow ABP Live On Telegram: t.me/officialabplive\n\nDisclaimer: Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Cryptocurrency is not a legal tender and is subject to market risks. Readers are advised to seek expert advice and read offer document(s) along with related important literature on the subject carefully before making any kind of investment whatsoever. Cryptocurrency market predictions are speculative and any investment made shall be at the sole cost and risk of the readers."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxNYjMzOHBZS0lKTzZQWkRpOVlQYU56R2hDcEEzQXpCbDVUT0dRQ0kydTZPYnFZUzQzSXlQLWxNNng5RXI0NURIN1N1VEpHa1V1eGF3ejE4Q0tNRmNKc1A5V01Idl9pQ3JKV3NkU1h3WGxHWlM1NlphM1ZNV3UxdjhlZWsxRDNHZ25m?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 27 Jan 2024 08:00:00 GMT",
        "title": "Ethereum sell-off alert: Here’s what to watch for ETH/BTC pair - Finbold - Finance in Bold",
        "content": "Ethereum (ETH) performance against Bitcoin (BTC) is a leading indicator of market cycles and an altseason. Thus, cryptocurrency traders and investors constantly monitor the ETH/BTC pair for valuable insights.\n\nIn particular, the well-known CrediBULL Crypto has his eyes turned to this pair and warns of a possible Ethereum sell-off. According to him, Ethereum has found a local top against Bitcoin in an expected deviation above previous highs.\n\nCrediBULL Crypto posted this analysis on X (formerly Twitter) on January 25, quoting a previous post where he forecasted the deviation, as happened.\n\nBoom. Beautiful rejection on ETH/BTC as expected. May revisit those local highs but imo a full retrace of ETH/BTC is on the horizon as $BTC recovers from this recent correction and begins it's next impulsive move to the upside, outperforming ETH once again.\n\n\n\nAs I have said before… https://t.co/HllnRI4Pee pic.twitter.com/uiOqcVvRBO — CrediBULL Crypto (@CredibleCrypto) January 25, 2024\n\nETH/BTC analysis\n\nNotably, the trader points to a breakout from the current support line at 0.04905 BTC per Ethereum. Furthermore, ETH/BTC should continue its downfall through 0.04624 BTC straight to a range below 0.03800 BTC.\n\nETH/BTC daily price chart. Source: CrediBULL Crypto\n\nCrediBULL Crypto explained ETH/BTC will only find a bottom once Bitcoin makes a new all-time high. Therefore, investors must be aware of “any bounces before that,” as they will most likely fade away, in his words.\n\nSince posting, Bitcoin has already outperformed Ethereum by around 2%, validating the above analysis. However, the economic context is a key factor to consider. Moreover, the cryptocurrency market is unpredictable, and everything could change swiftly.\n\nOn the other hand, institutional investors are turning to Ethereum and showing support for altcoins and tokenization. Recently, Franklin Templeton backed ETH, SOL, and other cryptocurrencies focused on utility. In the meantime, BlackRock’s CEO shared his vision of tokenization while talking about an expected Ethereum spot ETF approval.\n\nAll things considered, it is possible that the ETH/BTC pair surprise technical analysts in the near future, depending on further developments involving institutions and the regulatory landscape. Investors must trade cautiously, keeping themselves updated on the adoption and demand for Ethereum or Bitcoin.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    }
]