[
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxNdzhxUTQwMzZ6NzhEaDFRMWxzOS1BQTVTSnViV0lCMnE3a2tkdjNnczBoRGwxRUVaTUVQSVVtQlV1QjY5cnY1RWl4ZWNVRXo5ZGhjV2NaVUJqUUU3SG5MZmNmLTZraVRmMFl6RXBEeVN4b190bXNyNkpUOTBNQnhGSGFCNU9VOEF3RDVSaUVnbVNqeXBRODNNV1JIMzE5Z2QtR2c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 07:00:00 GMT",
        "title": "Ethereum wins a major battle, but its war with the SEC is far from over - Fortune",
        "content": "Consensys, the maker of the popular MetaMask crypto wallet, announced this week that the Securities and Exchange Commission has backed off its unpopular campaign to investigate developers who use Ethereum. The move is in line with the growing legal consensus that Ethereum is a commodity, not a security, which puts it outside the agency’s jurisdiction. The announcement, however, also contained a dark lining that reveals SEC Chair Gary Gensler’s crusade against Ethereum is far from over.\n\nYou may recall that things between Consensys and the SEC came to a head when the company took the bold step of suing in April, asking a federal judge to force the agency to back off. The lawsuit came as a preemptive strike after the SEC had telegraphed it was on the verge of filing charges against the company after a year-long campaign of issuing subpoenas to developers who use Ethereum.\n\nThe SEC’s legal position became tenuous after the agency, under growing political pressure, approved Ethereum ETFs—an acknowledgement the currency is indeed a commodity. In response to an enquiry from Consensys, the SEC then informed the company it was “closing its investigation into Ethereum 2.0.” The “2.0” phrase appears to be a reference to the blockchain’s new proof-of-stake system that went into effect in 2022.\n\nAll of this came as good news to the market, and the price of Ethereum jumped around 3%. But one line in Consensys’s announcement hinted that all was not quite as well as it seemed—namely that its lawsuit with the SEC was ongoing. This seemed strange given that, if Ethereum is not a security, the SEC has no jurisdiction and there is nothing to hash out in court.\n\nI asked Consensys’s lawyers what is going on and they told me the SEC is still going after MetaMask because it can be used to swap tokens on the DeFi market, and also because it offers access to staking—a key element of Ethereum that pays users to help secure the network. Here is how the lawyers put it:\n\n“The SEC’s theory is that, because the Swaps offering allows users to trade various tokens using DeFi platforms, it is a securities broker due to at least some of those tokens being securities. They also assert that providing a user interface to two liquid staking protocols is also brokerage activity, and that it also constitutes offering unregistered crypto asset securities. The closing of the Ethereum 2.0 investigation doesn’t resolve those issues.”\n\nThe SEC, in other words, is trying to argue that Consensys—and by extension other firms—is an unlicensed brokerage engaged in the securities trade. This is likely a losing argument too, but it’s on brand for Gensler, who has treated the process of crypto regulation like a personal vendetta, to dig in to the bitter end. The upshot for the crypto industry is it has won another battle, but the war goes on.\n\nJeff John Roberts\n\njeff.roberts@fortune.com\n\n@jeffjohnroberts\n\nDECENTRALIZED NEWS\n\nThe Commodity Futures Trading Commission is investigating Jump’s crypto trading activities. (Fortune)\n\nS&P wrote that Ethereum restaking, carried out by EigenLayer and others, could become akin to an “internet bond market.” (Bloomberg)\n\nWorldcoin has resumed iris-scanning in Kenya after regulators dropped a year-long privacy probe that had halted operations. (TechCrunch)\n\nThe price of private shares of crypto firms like Kraken, Circle, Chainalysis, and Ripple have jumped this year amid rumors the bull market will lead to long-awaited IPOs. (Bloomberg)\n\nBitcoin is down around 10% this month as the price fell below $64,000, though some technical analysts predict a rally is on the way. (CoinDesk)\n\nMEME O’ THE MOMENT\n\nWhat could go wrong?"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxOSjZ5RGNQeHE5N2ZnTXhuajBfUmYzMkdOcGZPLUxLWWJwb0hKVW45aWV2THg4bHpFVy1hbklUcTJ1aDFKSXhWMmFzWUFSNHlYQ3VScklnNDNlN2Y4LUlVM0VwMS1VeG5ZNU1zMTFNVU4tWDQ2aTZpZDhzSmNLLUxsXzA4c04ySlNMUjgzQlRrekY1YzdiQmJaTklORkl6bDFmclZsdXFFdkQwZnExd2w3RlFzc9IBuAFBVV95cUxPVDUzdTh6UGVJd1NHWE5YRHBBaVgyakFoNGhIV0hPclBObU1fTEJrcDRISGUyVndBbF9DTzZRQUY5bFNtMXJPZjFicjg0RGlOdExYaE5VbGJYYmZRMENlemYyaVc0SHl1eUVRd3dBSWRzdnBZenRjd2hTd3E5cDJHS2tVY3VaVTllRDNHdE5ST2t2RGIwaW10Z1FnU04xNmNWUVVyaENxbmFGRUh6UXFoYy1IR05IQTI2?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 07:00:00 GMT",
        "title": "Bitcoin (BTC) to $70,000 Imminent? Solana (SOL) to Pump Ethereum: Here's How, Cardano (ADA) Bounces Around $0.3, But for How Long? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nBitcoin is finally entering reversal mode, with the price of the first cryptocurrency sliding in above the $65,000 zone. However, it is still moving below key support levels like the 50 EMA and is currently consolidating at the 100 EMA. The most decisive factor for a recovery would be momentum that is not present at this exact moment.\n\nIt is critical that Bitcoin maintains above $65,000 for the near future. Strong support has been seen at this level, which might serve as the basis for a reversal. If Bitcoin is able to overcome the immediate resistance at the 50 EMA or roughly $67,000, traders are hopeful of a possible rebound.\n\nAdditionally, the RSI which is centered on 47, shows that Bitcoin is neither overbought nor oversold, pointing to a period of consolidation prior to any notable movement. The macroeconomic environment as a whole is one factor influencing Bitcoin's current performance. Investor sentiment in a variety of markets, including cryptocurrency, has been influenced by worries about inflation and possible interest rate increases by central banks.\n\nBitcoin's long-term prospects are still promising despite these obstacles because of its growing institutional adoption and ability to act as an inflation hedge. Given its continued institutional interest and widespread adoption, Bitcoin's long-term prospects appear bright.\n\nAdvertisement\n\nSolana's questionable position\n\nWhile Solana clearly gained some respectable strength back in May, the situation for the asset has changed, and it has been going down steadily for the past 20 days. The SOLETH chart, often used for gauging market volatility, is clearly exhausted and might provide us with some growth in the future.\n\nThe Solana vs. Ethereum chart, which contrasts the two most powerful altcoins available, is an important comparison. This comparison makes the relative strength and possible volatility of the altcoin market easier for traders and investors to understand.\n\nA positive outlook for altcoins overall is frequently indicated by Solana's strong performance versus Ethereum and vice versa. Because SOLETH captures the growth and performance dynamics of two significant cryptocurrencies that are not Bitcoin, it is regarded as a barometer for market volatility. In the domains of NFTs and decentralized finance (DeFi), Solana and Ethereum are renowned for their strong ecosystems and noteworthy use cases.\n\nSignificant movements in these two assets may point to more general trends on the cryptocurrency market. Ethereum frequently serves as a benchmark since it is the bigger and more well known of the two. Conversely, Solana stands for more recent quickly expanding blockchain initiatives. It is possible to infer market sentiment regarding innovation and growth in the cryptocurrency space from the interaction of these two assets on the SOL/ETH chart.\n\nCardano's unexpected bounce\n\nCardano somewhat bounced from a local support level at approximately $0.35, with the potential to fight with the 26 EMA for momentum in the next few days. This bounce is a small but crucial step toward breaking an aggravating downtrend that has plagued the cryptocurrency for months.\n\nHolding above $0.35 is critical for Cardano in the near term. This level has provided a lot of support and might provide the groundwork for a future upswing. Cardano may indicate the start of a recovery phase if it can muster enough momentum to test and possibly break above the 26 EMA.\n\nAn RSI of about 37 indicates that ADA is in oversold territory, which may draw in buyers searching for cheap points of entry. But Cardano has not exactly performed well over the long haul. Even with the community's strong support and the project's lofty objectives, ADA has had difficulty holding onto its value. Cardano has experienced a protracted decline and has not been able to return to its prior highs since hitting its all-time high in early 2022.\n\nNumerous reasons contribute to this subpar performance, including the general mood of competition from rival blockchain platforms and slower-than-anticipated development progress. Although anticipated by many investors, the Cardano ecosystem has not yet produced the ground-breaking applications.\n\nAlthough the deployment of smart contracts on the Cardano network was a big step forward, neither the number of dApps nor user adoption has increased significantly as a result of it. Some investors have become frustrated with ADA's slow development, which has made them doubt the company's long-term prospects."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxORHJWTHhlNXBWUVBjdVdkN2VZdy1DUm1kSjI5X1Q5Wm13bXNOazA3MWhYQ3dLYmpOaG42d0lDWmRuU0lWTnhCVnFEVzFYZndTOC04OFNDbThfeHRoNVRtS0ZIdThpMXVqSDlvM2JqUWlVMVBVWUpMN2hkTWRUVG83MXZsczc0bXlyaGh1QQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 07:00:00 GMT",
        "title": "Altcoin Watch: Ethereum and Solana Maintain Strength, Furrever Token Offers High Referral Bonuses - Yahoo Finance",
        "content": "Furrever Token\n\nNew York, NY, June 21, 2024 (GLOBE NEWSWIRE) -- The cryptocurrency market is energetic and ever-evolving, with certain tokens standing out due to their special advancements and promising prospects. As we move through 2024, Ethereum, Solana, and Furrever Token rise as the must-watch cryptos, each advertising unmistakable focal points and openings for financial specialists.\n\nEthereum and Solana: Balanced for a Major Upward Move?\n\nLater market examination by Jason Pizzino demonstrates that the cryptocurrency market is right now in a stealth zone, characterized by expanded fear and diminished market intrigued. This period regularly leads to littler extended bars after beginning alarms, with key levels just like the 50% mark holding relentless and lows remaining marginally higher. These patterns suggest the market may well be equipping up for a critical upward move within the coming months.\n\nEthereum's Resilience In the midst of Market Declines\n\nEthereum (ETH) has appeared relative quality by keeping up its position over the significant 50% level of its extent, set up amid the May low. This period coincided with Bitcoin's crest taking after ETF news excitement. Later advancements, such as the SEC dropping certain cases, have encouraged Ethereum's price soundness, in spite of broader market decreases.\n\nWhereas the majority of the market has seen significant drops, Ethereum has managed to hold its ground. In case Ethereum breaks down to around $3,400, Pizzino proposes that $3,200 might be a secure level to observe. In any case, on the off chance that it falls below $2,829, it might flag that the ETF news isn't as positive because it shows up. This level of strength shows a bullish structure for Ethereum, proposing potential for a slow recuperation over the coming months.\n\nSolana's Bullish Positioning\n\nSolana (SOL) is in a comparable position to Ethereum, remaining over the 50% mark of the whole bear market range. As of now exchanging over $138, Solana includes a drawback support around $109. This situation indicates a bullish structure, with Solana putting in higher lows and keeping up quality inside its cycle. Previous corrections in Solana extended from 37% to 52%, recommending that a redress down to 50% would be steady with past designs.\n\nSolana's capacity to remain over these key levels despite market instability highlights its potential for a major upward move. The bullish structure of Solana, coupled with its historical correction designs, recommends that it is well-positioned for recuperation and development within the close future.\n\n\n\n\n\nStory continues\n\nFurrever Token: Earn 10% With Referral Program\n\nIn the midst of the major players like Solana and Ethereum, Furrever Token presents a revival and locks in turn to the crypto showcase. Outlined with a charming cat-themed environment, Furrever Token points to supply a delightful user involvement whereas advertising considerable monetary openings.\n\nThe continuous presale of Furrever Token has as of now raised over $1.3 million, with the extent as of now in arrange 9, pointing for an add up to of $1.9 million. The project's commitment to security, approved by an audit from Securi Lab, assists in enhancing its credibility.\n\nDon't lose your opportunity to include Furrever Token to your venture portfolio and be prepared for the setup to rule the meme coin sector. Visit www.furrevertoken.com to secure your tokens and be a portion of this energizing meander.\n\n\n\nJoin Furrever Token Presale Now:\n\n\n\nFurrever Token Official Website\n\n\n\nVisit Furrever Token Presale\n\n\n\nJoin Official Telegram Group\n\n\n\nFollow Official X Account\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\nCONTACT: Media Contact: Robert Smith https://furrevertoken.com/ support-at-furrevertoken.com\n\n\n\n"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxOTzBDam10Y1lBNWpvVndkdW5DMGR3Y0hwVVA2d3pwbmJvZEc1TXd4UmM5N1hPUV9yVWNiZ0FRWXd6OVdWY201VXlDZDZ1aV9vdjZ5ZFZZMjlOMXYwX2x3SFVCVHZMTmdEeGpob0s5ZWhWV2hacGpKSGZlaERCLVluWXdn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 07:00:00 GMT",
        "title": "Bullish sign for Ethereum as exchange balances drop - CryptoSlate",
        "content": "What is CryptoSlate Alpha? A web3 membership designed to empower you with cutting-edge insights and knowledge, powered by Access Protocol. Learn more ›\n\nConnected to Alpha Welcome! 👋 You are connected to CryptoSlate Alpha. To manage your wallet connection, click the button below.\n\nImportant: You must lock a minimum of 20,000 ACS If you don't have enough, buy ACS on the following exchanges: Coinbase Kucoin Orca\n\nConnect via Access Protocol Access Protocol is a web3 monetization paywall. When users stake ACS, they can access paywalled content. Sign up for Access ›\n\nDisclaimer: By choosing to lock your ACS tokens with CryptoSlate, you accept and recognize that you will be bound by the terms and conditions of your third-party digital wallet provider, as well as any applicable terms and conditions of the Access Foundation. CryptoSlate shall have no responsibility or liability with regard to the provision, access, use, locking, security, integrity, value, or legal status of your ACS Tokens or your digital wallet, including any losses associated with your ACS tokens. It is solely your responsibility to assume the risks associated with locking your ACS tokens with CryptoSlate. For more information, visit our terms page."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxQSHp3aFo5RlZnSmNwOFA3dG8tOExuQmhSbmRfaHA4M09aeGRYQUs5Y3gzd2U2RlV0WFJsb1l1WXk2U0x0bHZ6UHRSMmQxZk5fZ3VsR1EtLUd5MmprNDFQUWhjRnFDNTBSbU5OVFVXbGwtVEV2cGs2eVAzWGxVeHJSWEdIay1VN1V2Q3d0bEpKc9IBlAFBVV95cUxQampzNWx5UGZwREdqWVM1bXJpcnkyTXhNZHJfcXZxSjFyZy1VTWNXQk8tcEhwajFUb0NSLWFaZ0pvZG1XbUhIRmhpemdXYmgzaU9JVm1XNEs2eXhnb1BTMG9IdEhCbHNNcG1DbWQ3Z2JidUh4RDJNUVlTR3djQUtwTWE3V3hqQjhWV25lbHFiSjdsaHZB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 07:00:00 GMT",
        "title": "From Ethereum to Polkadot: The Journey of Gavin Wood - Crypto News Flash",
        "content": "Gavin Wood co-founded Ethereum and wrote its first implementation, pioneering smart contracts.\n\nWood founded Polkadot, enhancing blockchain interoperability, and later transitioned to Chief Architect for innovative focus.\n\nGavin Wood’s journey into the world of blockchain began using LEGO bricks rather than a computer. Self-described as a “technologist at heart,” Wood’s early interest with creating intricate constructions gradually moved from actual blocks to digital ones. This love of innovation and problem-solving made his later activities in the blockchain sector possible.\n\nBitcoin was the first cryptocurrency that Wood came into contact with. Thanks to the Silk Road online black market, his discovery was, in a sense, accidental.\n\nEnticed by the mathematical approach of human cooperation and interaction found in Bitcoin, Wood recognized the possibility of establishing whole new social systems. In little time at all, this interest became a professional possibility.\n\nThe Birth of Ethereum\n\nWood had a meeting with Vitalik Buterin and other trailblazers engaged in the ambitious Ethereum project in 2014. Once Wood joined this team, he was instrumental in turning Ethereum from a white paper into a working blockchain.\n\nWith the creation of the initial Ethereum implementation, he introduced the world to smart contracts—a ground-breaking idea that made decentralized, programmable transactions possible.\n\nWood wanted to create a platform that might propel social change as much as a new coin. Ethereum seemed to him like a means of creating a new planet that would propel human development for the remainder of the century.\n\nHis Ethereum work established the foundation for a significant force in the blockchain space that would upend established financial and economic institutions.\n\nMoving Beyond Ethereum: The Creation of Polkadot\n\nWood made major contributions to Ethereum and then focused on addressing some of the shortcomings he observed in the state of blockchain technology. As a result, Polkadot, a technology meant to facilitate smooth interoperability between several blockchains, was developed.\n\nThrough its special architecture, Polkadot addresses the scalability and governance problems that single-chain networks encounter by enabling several blockchains to run concurrently.\n\nood just presented a significant Polkadot update at the Token2049 conference: the Join-Accumulate Machine (JAM). By enabling multi-core computing and improving network flexibility, this new protocol seeks to offer a more modular and minimalistic design.\n\nFrom Polkadot’s current Relay Chain, the JAM protocol marks a dramatic change that will solve present constraints and advance the ecosystem toward its lofty objectives.\n\nWood resigned from Parity Technologies, the business that owns Polkadot, in October of 2022. He is still very much a part of Polkadot’s technical and conceptual components as Chief Architect, even if he is no longer CEO. This change enables him to spend more time on the creative improvements and projects that still define his profession.\n\nThe Broader Impact of Gavin Wood’s Work\n\nWood made more than just Ethereum and Polkadot contributions to the blockchain space. His concept to build decentralized platforms with blockchain technology has impacted a great deal of initiatives and businesses.\n\nThrough enabling interoperability between several blockchains, Polkadot has created new opportunities for both developers and companies, encouraging creativity and teamwork throughout the ecosystem.\n\nFrom a LEGO fanatic to a blockchain visionary, Gavin Wood’s path demonstrates his unwavering quest of technical innovation. Beyond what blockchain technology can do, his work has encouraged a new generation of developers and entrepreneurs to go outside the box.\n\nThe tale of Wood is proof of the ability of creativity and vision to propel technological advancement. Key elements in his success have been his commitment to finding solutions to difficult challenges and his ability to predict the promise of blockchain technology.\n\nWood’s story emphasizes for would-be entrepreneurs and engineers the value of remaining inquisitive, accepting obstacles, and never stopping to get better.\n\nThe future of distributed technology seems bright as long as Gavin Wood keeps leading and innovating in the blockchain field. His efforts with Polkadot and the JAM protocol are expected to completely change the way blockchains communicate, strengthening and expanding the ecosystem.\n\nRecommended for you:"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxNUndSbVNhbXJGam5fWDlRajdpMzdHUEZuZVRHQUtLME03MEppcDczbzI2MHRoZzk4Yl9CUjhRQXhaWjVtRWVHbFhxU2FwN253QTVLUmhHTVJrOXFQX1dJejlISVA2aDdTdV9aWDFrd3ZFZEtKcXZfZjY4VXR3ZnE3dEt30gGKAUFVX3lxTE81T1hPRmpIX2RPZFhMREVHSW9TQmJudTZ3Tk15YXhFeXdxZFVWbW1TUWJ6T3FSN0lKSjlGZnZESm5KTnR2RTEwMXN4bFNhOWNBT2NhLTBKc3pxbUVON09uRDhMTExVbTFKUEtzT21NUVBZWWF2YXZlOWtDX3RBRVZHdUFIQVF2a2tnQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Jun 2024 07:00:00 GMT",
        "title": "This Week in Coins: Ethereum Stays Afloat as Crypto Market Sinks - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIllustration by Mitchell Preffer for Decrypt.\n\nIt’s been another uninspiring week for Bitcoin, with the top crypto asset chopping sideways to enter the weekend below $64,500, notching another 2.6% loss in the last seven days.\n\nIt's extra disappointing given how MicroStrategy bought another $786 million in BTC this week, which the company’s founder says it never plans to sell. Still, MicroStrategy’s demand was overpowered by an onslaught of sell pressure from other long-term Bitcoin whales, including the German government.\n\nCryptoQuant noted that the broader crypto market is starting to lose momentum due to a lack of new investor demand. It follows, thenn, that most momentum-based meme coins like PEPE, DOGE, SHIB, and WIF are all down 5%, 9%, 13%, and 25%, respectively, on the week.\n\nAD\n\nAD\n\nToncoin also lost some of its momentum from last week, dropping 10% after previously rising to all-time highs on hype from projects within its gaming ecosystem. It remains a top ten crypto by market cap, and is only $300 million away from overtaking Dogecoin.\n\nDefying the market’s momentum to some degree is Ethereum. Its trading at $3,492 as of writing, hovering within a percent of its price seven days ago as Ethereum spot ETFs inch closer to reality. Multiple asset managers have now unveiled the fee on their ETFs, and Bitwise even published a commercial advertising ETH to old-school TV audiences.\n\nSolana—Ethereum’s top smart contract competitor—was less fortunate, sliding another 6% this week to $134.92.\n\nOne of the network’s high-flying Trump-based memecoins, DJT, amassed a $110 million market cap this week, and made headlines on rumors that it may have been launched by Trump’s team itself. One of the ex-president’s legal consultants later confirmed that the coin wasn’t launched by Trump nor his offspring.\n\nEven crypto stocks couldn’t retain momentum this week. Coinbase (COIN) fell 8%, MicroStrategy (MSTR) fell 1.96%, and DeFi Technologies (DEFTF)—which soared after buying Bitcoin earlier this month—has cratered 29.9% this week after crypto reports spread doubt about the company online.\n\nAD\n\nAD\n\nAll the negative momentum from altcoins this month has many analysts saying the crypto bull market may already be over. Still, BitMEX co-founder Arthur Hayes doubled down on his bullish thesis this Thursday that now is the time to ape into shitcoins and “buy the fucking dip” – before global money printers go brr.\n\nPrices as of 3am ET. Edited by Ryan Ozawa."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxPa085cXVBV0Vjb3JfNllmMzRWYUNUUE5FZXdheUZIaW9uMGhrdjFVNnNMenZrbFJEbkNwU0tiSkdVQmJicEl6cUxfRzR2UG1nUmkxSDAtM0hDSkVhb0hJdllZa1hIZXpQNVdXcWVKZnVnZDVDZTJOai0xSHlvOWZfSTF30gGHAUFVX3lxTE5VZVoyMkl1S01qVkhncXp6aW80MlZGSXZrNklQY2ppRm03RTJYb0JvUFNKa2NkaHlNREs1TUMxczhwWjJFcW9qUTV3Y3A0WnFJZXVObE50dWtEUUJhOVZsbzRKeGFJN2I5MDRhTFlVS0NyZFlKaHlDUkFucy00SXpzTWo0OEZEOA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Jun 2024 07:00:00 GMT",
        "title": "Bitcoin (BTC) vs. Ethereum (ETH): Which Will Win Q3 2024? - CryptoPotato",
        "content": "The world’s number one and two leading cryptocurrencies by market capitalization, daily transaction volume, and crypto exchange volume have almost perfectly tied for ROI from Jan. 1 through the middle of June.\n\nFor comparison, the S&P 500 Index notched up nearly 15% over that same period. But that’s more than the broad stock market benchmark usually makes in an entire year.\n\nSo even during an unusually good two quarters for U.S. stocks, Bitcoin and Ethereum delivered investors four times more ROI. In other words, Bitcoin broke the government’s investment planning tool. Again.\n\nThe average annualized ROI for Bitcoin and Ethereum price performance since Jan. 1 is aces. The top two cryptocurrencies are pacing for a +116% year.\n\nThat’s a return so high that the compound interest calculator tool on Investor.gov does not even allow users to enter interest rates above 100%.\n\nBy the way— if you enter $100 a month into the calculator for 15 years at an estimated interest rate of 15% (above average for the S&P 500), with a daily compounding frequency, you end up with $68,815 in 15 years for capitalizing your country’s economy with a total of $18,100 in contributions.\n\nIf you do the same exercise with Bitcoin or Ethereum profits, and just enter 99% for the interest rate – the result is a little different (more like a bajillion dollars).\n\nQuestion is which cryptocurrency will outdo the other in Q3, or will Bitcoin and Ethereum come remarkably close again to earning the same amount of profit for crypto investors in the next half of the year?\n\nHere are six salient factors that may be worth considering. Some are more bullish for BTC, some for ETH, and some are a wash between the two blockchain network giants.\n\n1. Fed Dollar Inflation (Advantage Bitcoin)\n\nThe center of gravity for the entire global financial system is the U.S. federal funds rate. It represents the cost for Federal Reserve banks to borrow cash from the ultimate lender in the economy.\n\nThe Fed interest rate calibrates the dollar interest rates for loan products all the way down the food chain to store credit cards and pay day lenders. When it goes up or down, so does the rest of the financial economy with it.\n\nBut when it goes up that’s a big headwind that puts downward pressure on prices for stocks and cryptocurrencies. However, when it goes down, there’s a big tailwind for investment products that tends to put upward pressure on their market prices.\n\nIt looks like there will be one interest rate cut for the U.S. dollar later this year. “If all of it happens to be as forecasted, I think one rate cut would be appropriate by year’s end,” said Philadelphia Fed President Patrick Harker on Monday. After the Fed left rates unchanged last Wednesday for the seventh FOMC meeting in a row, Investopedia reported:\n\n“A bevy of tamer-than-expected inflation numbers over the past week has supercharged expectations that a Federal Reserve rate cut is ahead, but Fed officials themselves are proceeding with caution.” “What we’ve been getting is good progress on inflation, with growth at a good level and with a strong labor market,” said Fed Chair Jerome Powell. “Ultimately, we think rates will have to come down to continue to support that. But so far, they haven’t had to.”\n\nMeanwhile, other central bank economies, like those in the United Kingdom and South Korea, are getting antsy to cut rates.\n\nNot if, but when the Fed eventually begins to trim rates back down again, it will be a tailwind for crypto, but especially for Bitcoin – because of its deflationary tokenomics, with a hard supply cap of only 21 million BTC tokens to ever be issued by the blockchain network.\n\n2. DeFi and DApps (Advantage Ethereum)\n\nBitcoin is like digital gold, but Ethereum is like the automotive economy that burgeoned in the 20th Century as a result of the Industrial Revolution. Bitcoin is scarcity in the digital world of cyber abundance.\n\nIt turns out that a world without scarcity is missing something useful. Meanwhile, Ethereum is a vehicle to bring different parts of the economy closer together so they can engage in smart financial markets.\n\nMetaMask, Oasis App, MakerDAO, and Uniswap usage statistics continue to wow in 2024. In February, MetaMask announced a 55% surge in users from 19 million to 30 million in a matter of four months.\n\nThe numbers are almost as high as the 2022 peak for MetaMask installations now. The company behind the Ethereum wallet says those 30 million users manage 100 million accounts with MetaMask.\n\nOasis App is a decentralized app (dApp) built on Ethereum. According to data hosted by BitDegree the app’s balance was worth some $1,769,996,160 in market value Thursday and the dApp had executed 308,620 transactions in the last 30 days (a 100% increase over the prior month).\n\nEthereum MakerDAO is one of those beefy, serious DeFi dApps making the Ethereum vision happen. The decentralized app’s native cryptocurrency, the stablecoin DAI, is a small economy unto itself, with a market capitalization this week exceeding $5.4 billion.\n\nMeanwhile, Uniswap continues to impress. The leading decentralized exchange (DEX) for cryptocurrencies absolutely dominates other DEXs, ranking in fees almost as high as $100 million in total over the previous 30-day period.\n\nThe only Web3 apps to generate more fee revenue in the past month were: Bitcoin, Ethereum, Tron, and Lido.\n\n3. Institutional Adoption (Advantage Bitcoin)\n\nBlackRock CEO Larry Fink noted in March how the Bitcoin exchange traded fund was the fastest growing ETF in history.\n\nBlackRock CEO Larry Fink says the $IBIT Spot #Bitcoin #ETF is the fastest growing ETF in history\n\npic.twitter.com/NOsDlFgROi — Simon Dixon (@SimonDixonTwitt) March 27, 2024\n\nAgainst every other cryptocurrency, Bitcoin and Ethereum both have an advantage in regard to regulatory approval. But against each other, Bitcoin still has a clear advantage going into Q3 2024. Hundreds of millions of dollars flow into and out of the Washington-regulated Bitcoin ETFs daily.\n\nFormer U.S. President Donald Trump now has the confidence to promote cryptocurrency to voters on the campaign trail. Before the last presidential election in 2020, Trump said he was anti-Bitcoin and crypto.\n\nThat is a strong signal of institutional and mainstream crypto adoption for Bitcoin and Ethereum. Trump recently said he wants all Bitcoin to be mined in the United States and he thinks it can help win the AI arms race.\n\nMeanwhile, VanEck announced Thursday that it will be launching the first Bitcoin exchange-traded fund in Australia.\n\n4. Prague Electra (Pectra) Update: (Advantage Ethereum)\n\nThe Dencun Update – the most recent major upgrade to Ethereum – was a massive boon to Ether’s market value on crypto exchanges. Ether price went parabolic buying the news from Jan. 24 until the upgrade happened on Mar. 13.\n\nEthereum devs plan to ship the Pectra upgrade by early 2025, maybe in Q4 2024, so this will be a bullish tailwind supporting ETH price in the background for the medium term.\n\nPectra is short for the Prague-Electra update.\n\nThe Wall Street stock analysts over at TipRanks recently praised the Pectra upgrade in an article featured on Nasdaq for the update’s enhanced rollups and new staking limit for ETH validators: 2,048 ETH.\n\n5. Meme Coins (Advantage Ethereum)\n\nEthereum is still dominating meme coins, but the emergence of fungible token issuance on Bitcoin through the UTXO function using a technique branded Runes and some big hits in Q2 – like Dog Go To The Moon (Runes) – shows Bitcoin is a relevant player in this niche as well.\n\nThrough the Bitcoin Ordinals technique, BTC-minted NFTs remain popular and transacted in volumes of five and ten million dollars daily in June, according to Dune Analytics data.\n\nThe Ethereum meme coin economy, however, is a multi-billion dollar concern that continues to drive capital inflows to Web3 like the world’s gone mad.\n\n6. Competitive Analysis (Advantage Bitcoin)\n\nThe competitive landscape is an important factor in the horse race between BTC and ETH. These are far from the only two cryptocurrencies in the world in 2024.\n\nEthereum grows faster because of motivation from its competition, but it has far more competitors than Bitcoin. Market share in a competitive landscape is a real issue for this currency. It’s not just a technology, toy, or platform; it’s a business.\n\nWhile BNB, Solana, Cardano, Avalanche, Aptos, and a hundred others compete with Ethereum for DeFi market share, there is only one Bitcoin with only 21 million BTC. The Web 2.0 dons, Messrs Jack Dorsey and Mark Zuckerberg, both know the Web3 competition for those oranges is about to get fierce."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxNV2VTRlZLaEJlOTliMjVpa2tUWDBNbmpUbE1CX0NlLVZRdU5xdTRUMjBqczM4OHUxaVNSNXVaYzN4TW5ncG0tUzFSUHVWWXZyRTZXT2hucGxKRGNvSmNlb1I2b3NvOUhNVzRwQl80ZzJZMFk2NzRKQkVwNGNUaXNQR1N5LTNkSUk4X0xLMXZvSkNVM1E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 07:00:00 GMT",
        "title": "Standard Chartered to Launch Spot Bitcoin & Ethereum Trading Desk - Watcher Guru",
        "content": "UK-based multinational bank Standard Chartered is officially launching a Spot Bitcoin and Ethereum trading desk. Bloomberg reports that the $820 billion bank’s STAN will be used for buying and selling both BTC and ETH directly. The institution becomes one of the first global banks to offer a trading service for the two leading cryptocurrencies.\n\nThe report notes that that desk will begin trading rather soon, according to sources. Although other banks have offered crypto derivatives trading, the decision places Standard Chartered in a league of its own regarding activity in the digital asset space.\n\nJUST IN: $820 billion Standard Chartered Bank to establish a spot trading desk for buying and selling #Bitcoin and Ethereum. June 21, 2024\n\nAlso Read: Bitcoin To Hit $100K Before US Elections: Standard Chartered\n\nStandard Chartered Announces BTC and ETH Trading Desk\n\nSource: Blockchain Reporter\n\nIn 2024, the United States approved two crypto-based ETFs, in what is a revolutionary move for the asset class. The decision heavily impacted Bitcoin, with the leading cryptocurrency reaching a landmark price of $73,000 in March of this year.\n\nNow, global institution Standard Chartered Bank is set to launch a Spot Bitcoin and Ethereum trading desk. In an emailed statement, the company noted its work to help support the growing demand that the firm has seen from clients.\n\n“We have been working closely with our regulators to support demand from our institutional clients to trade Bitcoin and Ethereum,” Standard Chartered said. The decision isn’t their first foray into the sector. They have backed crypto custodians Zodia Cusotry and its exchange, Zodia Markets.\n\nSource: CNBC\n\nAlso Read: Standard Chartered: Solana & XRP ETFs Could Launch in 2025\n\nThe bank has also launched a tokenization platform, Libeara in November of this year. The project tokenized government bond funds that use the Singaporean dollar, and showcase another venture into the Web3 sector for the bank.\n\nThe decision is a byproduct of the aforementioned demand from institutional clients. Although no launch date is announced, sources say that the “crypto desk is close to starting operations.” Additionally, sources confirm It will run out of the firm’s London office."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxNUGd4aVpFUXNyc0NQTzN1NFloWGZRRVBnVlFfNmtkQWVfWmVWR1l4NmpGak1xYVkySkhud3FSUGljT3lUYjRzOF92SlNnT0treUc3ZzE1cmNjbU9qWkR2S0lLSnRwMk9mSGM0OFdJb1J6dWxKN2F2Zkk1WnUwNldYZ0RPT091RDNBTng0elRKRUZZd0VuZUo5czFtTdIBoAFBVV95cUxOYzBaMkppV1czdTlyNzM4VkdYY0dib0ZRaDNQTVB0eTdkQ0RtMklod3pkR1Y0aGNTdHd6X1JSNW5hM3Jtb0tFeEhrcFp5Y0U2SlF4VW8yeVNORXNkZ0VCV1BfQS1ja0E4NzRVMHotT2hXdDVkQWJTNGtVUVhGdjhBT2ttYU5MdnRTQ2hrcXhvMy0tMElqS21DT082dEx3eGxW?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Jun 2024 07:00:00 GMT",
        "title": "PEPE’s correlation with Ethereum might play out THIS way for the memecoin - AMBCrypto News",
        "content": "Data revealed that the memecoin’s strong ties to ETH could stall further growth\n\nHigh exchange outflows might help PEPE\n\nFrog-themed memecoin Pepe [PEPE] was one of the few top-50 cryptocurrencies to register gains in the last 24 hours. At press time, PEPE was trading at a value of $0.000011, following a 3.35% hike its its value on 21 June.\n\nHowever, AMBCrypto found that the uptrend might not last. One reason for the same may be the memecoin’s correlation with Ethereum [ETH]. According to IntoTheBlock, PEPE’s correlation with ETH was. 0.91 at press time.\n\nETH has strong links with PEPE\n\nThe aforementioned figure was far above the correlation it shares with Bitcoin [BTC], which stood at 0.60. Values of the correlation ranges from -1. to +1. When the reading is close to -1, it means that prices hardly move in the same direction.\n\nHowever, if the reading is close to +1, it means that prices head in the same direction most times. And that was the case with ETH and PEPE.\n\nBut unlike PEPE, ETH did not appreciate on the charts. Instead, it moved sideways, trading at $3,502 at press time.\n\nShould the price of the altcoin continue to consolidate or encounter a decline, PEPE’s price could retrace too. Beyond that, only a few memecoins also jumped, meaning a lot of capital was not flowing into the category to kickstart a rally.\n\nOn the contrary, exchange flows seemed to suggest that ETH might not be able to halt the uptrend. At press time, PEPE’s exchange inflows were 845,000.\n\nMemecoin is in a tight spot\n\nInflows measure the number of tokens being sent into exchanges. When this number is high, it means that selling pressure could be intense, and could probably lead to a price decline.\n\nOn the other hand, Santiment data revealed that the exchange outflows were much higher at 131.07 million. The rise in the outflows means that those accumulating the token are refraining from keeping them on exchanges.\n\nInstead, participants are keeping them in non-custodial wallets. Should this activity continue, PEPE might overlook its strong ties with ETH, and the price could appreciate on the charts.\n\nIf this is the case, the value of the token could hit $0.000013 in the short term. However, traders might not need to be cautious.\n\nThis, because of the holdings distribution data. Consider this – Addresses by holdings revealed the 30-day change of the number of participants buying more of a token at a certain threshold.\n\nIn most cases, the retail cohort rarely impact prices like large investors. At press time, the number of addresses holding $1,000 to $10 million worth of the token had fallen.\n\nConsidering the most recent sell-offs across the market, PEPE might now struggle to keep up with its former bullish momentum.\n\nRealistic or not, here’s PEPE’s market cap in ETH terms\n\nIf this happens, the prediction to $0.000013 mentioned above could be invalidated. Therefore, PEPE’s price could move at the same pace as ETH, and its price might remain around the $0.000011 zone."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE8tSUQ0cEUxY0ZkZy1IY2dOb3kzUU9zYkVXSWFkRXNmd3JrMV84VHp4WTcwakt4RWFKYXo3cnduLUFYYncwMGN0Y0k2Y1dnNWZaeWhOSXM4Y3lKaGhhV0dFV0ItRl9qX1JZRTNrVklRVVRpc29CVm15UFpSbDFSWnfSAYcBQVVfeXFMUEFpWnNSTHc1S3BHRGNpY0NfSVNiMmVtWTBrWHlpOEY0dFZNUTlmUEs2OG5lblh4RjMyYUd0YVVGUVNtRDV0aDFaQzVTT1MxR29XOUlWeWg0dnozbnNQWnczNjVsYlBOb29ZbWl3bnF6U0RQbGhNeWMzZ25mdXJDODlvMHFsUURZ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 07:00:00 GMT",
        "title": "Standard Chartered Is Creating a Bitcoin and Ethereum Trading Desk in London - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBritish multinational bank Standard Chartered is creating a Bitcoin and Ethereum trading desk in London, according to a report from Bloomberg.\n\nThis will make it one of the first global banks to enter spot crypto trading, in the wake of spot Bitcoin and Ethereum ETFs being approved in the U.S.. Standard Chartered’s new crypto desk will begin trading soon, two people told the outlet, and will be part of the Forex trading unit.\n\n“We have been working closely with our regulators to support demand from our institutional clients to trade Bitcoin and Ethereum, in line with our strategy to support clients across the wider digital asset ecosystem, from access and custody to tokenization and interoperability,” Standard Chartered told Decrypt, echoing the statement it made to Bloomberg.\n\nBut Standard Chartered declined to respond to Decrypt’s request for further comment.\n\nAD\n\nAD\n\nThe bank part-owns institutional crypto custodian Zodia Custody and has backed institutional digital asset trading firm Zodia Markets. Now setting up its own spot crypto trading desk shows clear intention to move deeper into the world of digital assets, after dipping its toes through investment.\n\nOther banks have traded crypto before, but due to regulation they have had to trade in derivatives rather than the actual asset itself. For example, Goldman Sachs began trading Bitcoin futures in 2020, then opened its Bitcoin derivative trading desk in 2021.\n\nThe Basel Committee, an organization that sets global standards for banks, recommended in a 2022 report that banks should apply a 1,250% risk weighting when trading crypto assets. This term refers to the amount of capital a bank should have in reserve to counter the risk of the investment. Industry experts have noted that this incredibly high weighting makes it hard for banks to turn a profit on crypto trading.\n\nStandard Chartered has been bullish on crypto recently. In May, it predicted Bitcoin and Ethereum to hit all-time highs after spot Ethereum ETFs were approved in the U.S.. Soon, the bank predicted that Solana and XRP ETFs would be next to be approved in the States.\n\nAD\n\nAD\n\n“Albeit this is likely a 2025 story not a 2024 one,” Geoffrey Kendrick, Standard Chartered’s head of crypto research and emerging market foreign currencies, said.\n\nEdited by Stacy Elliott."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxOQkFqb1JWZmF3Z1NPdWNTLURrbUFJeFFJTE1kQ2NmdUtmM2ZjTGY1Uk5jNnpPR1lQUDBTdHJacThtN25nQmN4TVR5RFl2ZHRzeFNkQWgxc0J2VUE4eTg0TGJQYVpBMlFwTTdZeHZFUzVlQmsxNEc5WWNtUlpyU3B5N1ZOUV9hcGUxcmNJdmd2XzgxNkxCWUkzMkNhS3VEaTNic3VLendJY3Jxd9IBrwFBVV95cUxNYm1ROURGT2xsV2dpTU15VS1oM0NoV29mWHVxTWFzdUR3S2lIQ3A0WXpndVRad1BoMjVFaFBnMXduNnVtVHJHSmhnUHc1RVU1VlQtakpwLXRORkRQamVqdzgtSzl3YjMzaDY1YVFTU0RUc29DNUFPWGFrSmVfaFpOWHZvbWNyNWtidC1QcTlvc1Z2R0RFZWFtTFJLWVdiRC0ybFBNMTlWSTg4dHRsRjNv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 07:00:00 GMT",
        "title": "S&P Global: Ethereum Restaking Can Give Birth to ‘Internet Bond’ Market, Will SEC Approve? - CoinGape",
        "content": "S&P Global Ratings recently published a report stating that the Ethereum restaking services offering an additional yield are gaining prominence and could lead to a solid “internet bond” market in the long term.\n\nSimilar to the bond market, holders of Ethereum earn additional yield by either pledging or staking their ETH coins to help with transaction verification on the Ethereum blockchain. Similar to lending out securities in fixed-income markets, ETH restaking reinvest the staking rewards and provide compounding returns to investors. Ethereum restaking platforms like EigenLayer have been much in the limelight recently. Amid this popularity, EigenLayer went live on the crypto exchange Coinbase recently.\n\nadvertisement\n\nThe Rise of Ethereum Restaking\n\nIn a report published on Wednesday, Andrew O’Neill, S&P Global’s digital assets analytical lead, highlighted the importance of restaking in order to enhance economic growth within the crypto market.\n\nO’Neill also stated that restaking allows Ethereum node operators to validate new services by using established tokens thereby eliminating the need for these services to create their own validator with their own, illiquid, and volatile tokens.\n\nAs of now, there are only a few active restaking services popular as “actively validated services”. The report by S&P Global also notes that the total value of ETH restaked in the EigenLayer has surpassed 5.3 million Ether, valued at a staggering $19 million. Earlier this week, EigenLayer opened the Phase 2 claims for the EIGEN airdrop.\n\nRisks Associated with Restaking\n\nThe risks associated with restaking are primarily operational and specific to each actively validated service (AVS), though financial risks could emerge due to market speculation.\n\n“We do not currently foresee significant ecosystem-level financial risk as staking and restaking are generally non-custodial and there is no rehypothecation of the collateral,” O’Neill writes. “The impact of restaking on system-level leverage must be monitored, particularly through borrowing and leverage metrics on decentralized finance (DeFi) lending protocols”.\n\nEver since the EigenLayer launch in April, the protocol has gained strong traction within no time. This could inspire more players in the market to bring restaking services.\n\nHowever, the bigger question is whether the US SEc would allow more restaking protocols in the market. Another doubt is whether the SEC will allow restaking protocols to mature into “internet bond” market without proper regulations.\n\nBhushan Akolkar Bhushan is a FinTech enthusiast with a keen understanding of financial markets. His interest in economics and finance has led him to focus on emerging Blockchain technology and cryptocurrency markets. He is committed to continuous learning and stays motivated by sharing the knowledge he acquires. In his free time, Bhushan enjoys reading thriller fiction novels and occasionally explores his culinary skills.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxNaXBQLXlNbVE2anRaejVlS3VPMEZha2ZTQ0pIY0V0RFhSWlpBM0tsdkVfbGp0V25EQ2VJQ1VmZndxN0xYN09vNzUycmtiVEZDWmhKcUlCZVFrcjV6RmF0RERDQ2tNenpNdWt3QW5lS1NLUHZobXZqWG5Jc0dCZFFYaVlMYXlQSFh4THowYWZKMk8wRnfSAZgBQVVfeXFMTmRCZUd4V3A2NUZ6ZzQ1QkhxN2NQT3o2RFRWMktWOUlOWUtBVGk0RndRdTZOc1NzZFRKN3ZjUnYtTFg3eXRCbGd2akk0RndseG5SRXRScW11eHdWcm5uZmZaUnVsN3F5eDU1ektqYnBfU0ZKNDVxM2piVGZNVFRYVThLZ2lYNnhEOUIwVzVCUWsxeV8xZ2E4emo?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Classic’s 2024 – Here’s what you should expect from its price - AMBCrypto News",
        "content": "Ethereum Classic (ETC) flashed a general downtrend with decreasing price highs and lows, coupled with diminishing trading volumes\n\nA bearish ‘death cross’ suggested a potential long-term downtrend\n\nEthereum Classic (ETC) has been a staple in the cryptocurrency market, but never expected to go 100x. Still, 2024 is widely anticipated to be a very bullish year for the market, even more so than it has already been. However, things have slowed down recently, and markets have tumbled.\n\nSo, what about ETC? What’s its fate for the rest of the year?\n\nSince late May and into June, the trend has appeared generally bearish as ETC’s price made lower highs and lower lows – A classic indication of a downtrend. This recent decline in price can be coupled with diminishing trading volume – A sign of a reduction in investor interest and market fatigue.\n\nTypically, low volume during a downtrend might suggest a lack of conviction in the sell-offs, but it could also mean that fewer buyers are present to push the price back up.\n\nA hike of +5.56% means heightened trading activity in ETC derivatives, which can be speculative buying or selling. In fact, the notable spike seemed to align with a peak in ETC’s price line, possibly pointing to a speculative rush that was not sustained and led to price retraction.\n\nDeath Cross signals prolonged downtrend\n\nThe 50-day moving average recently crossed below the 200-day moving average, indicating a bearish ‘death cross.’ This pattern typically is a sign of a long-term downtrend.\n\nThe price peaked at around $35 in March, followed by a sharp decline. After that, it consolidated around the $30-mark before breaking below the 200-day moving average.\n\nPrevious support levels can be observed around the $25-level, which have now been breached and may act as resistances if a price recovery attempt occurs. The next key support is likely around the $20-level, which could be tested if the prevailing bearish trend continues.\n\nIn conclusion, the hike in selling volume plus the breach of prior support levels tells us that the bears are here to stay."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxPLUlob0xlY2NBU3pFZjZDdkV0VVFUZ3NFaFBZM2lnc3MzZE16anRad1NPRDQ2TFpfVXhWTU5xN3VPRFlHLXNvd3JxTnhHZGhaeEZxVnQ3eFRvQXloQzNKclJ6bEpRZFVPUGpNV0lRODlRbGF5aWZuZ0tPU0pMRFRwUDlXQml3Q2R4WUNoZmpIRkF3RGg5d0FrNGdvT2XSAaIBQVVfeXFMTmtIOGo3SVB2UDdYRlJIMVN4YVFaUnkzaHJValI5OV9ta2MzQVY0X1BfSkluMDFVOGtxMC1FanAxU3dHQnU5V3h3X2hFQ1hVajQzUkwySTdhc1hOM2t3a2JWczI3SnJ0Z1hLV3hDMXE1cmhPMjBfVjVKSng3MFBYWEo1bkhWZUctRjFESWdGbjRCSDZ5MUhVbGxwR3JrallCSjRR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 07:00:00 GMT",
        "title": "Breaking: Standard Chartered Becomes First Bank to Launch Spot Bitcoin, Ethereum Trading - CoinGape",
        "content": "Global banking giant Standard Chartered deepens crypto push and announces plan to open trading desk for spot Bitcoin and Ethereum. As a result, it has become the first bank to enter spot crypto trading.\n\nRecently, Mastercard and Standard Chartered Bank Hong Kong successfully completed their first live experiment on the tokenization of deposits using the Mastercard Multi-Token Network (MTN). The company making a stronger push into different crypto-related fields.\n\nadvertisement\n\nStandard Chartered Enters Spot Crypto Trading Space\n\nIn a major crypto development, Standard Chartered on June 21 said it is close to starting a trading desk for Bitcoin and Ethereum. The new crypto-focused operations will be part of the bank’s FX trading unit. The trading desk will be available to run from London, reported Bloomberg.\n\n“We have been working closely with our regulators to support demand from our institutional clients to trade Bitcoin and Ethereum, in line with our strategy to support clients across the wider digital asset ecosystem, from access and custody to tokenization and interoperability,” said Standard Chartered.\n\nThe move was welcomed by crypto industry leaders including Binance CEO Richard Ten as it indicates the mainstream adoption of crypto is picking pace. Standard Chartered through its owned companies Zodia Custody and Zodia Markets has offered crypto-tailored solutions including crypto custody and institutional crypto trading.\n\nZodia Custody has also announced expanding the list of supported digital assets for comprehensive custody solutions. It has added USDe to its custody platform today.\n\nAlso Read: Ripple Lawsuit Referred To Magistrate Judge For Settlement\n\nBitcoin and Ethereum To Rally?\n\nTraders reacted immediately to the news, bringing some upside momentum to both Bitcoin and Ethereum prices.\n\nBTC price rebounded 1% after the news but still down 2% in the past 24 hours, with the price currently trading at $64,151. The 24-hour low and high are $63,529 and $66,451, respectively. Furthermore, the trading volume has increased by 37% in the last 24 hours.\n\nMeanwhile, ETH price also reversed upside after dropping to a low of $3,446. The price currently changing hands at $3,514, down 2% in the last 24 hours. Also, the trading volume has increased by 15% in the last 24 hours, rasing speculation of a recovery in the crypto market.\n\nAlso Read: Shiba Inu Coin Burn Rate Spikes 530%, Will SHIB Price Rally?\n\nVarinder Singh Varinder has 10 years of experience in the Fintech sector, with over 5 years dedicated to blockchain, crypto, and Web3 developments. Being a technology enthusiast and analytical thinker, he has shared his knowledge of disruptive technologies in over 5000+ news, articles, and papers. With CoinGape Media, Varinder believes in the huge potential of these innovative future technologies. He is currently covering all the latest updates and developments in the crypto industry.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxPUDA3RlZSeGdsNk1pd0ljdEtWMFllZkRuSTNVQkdQdVVWa2VrUzc1V3Rpc2h1LWNqSjdBempfTmlNeXZGc3hoSC1XeTAwY1pwdnU5aEpuOGZCclRfNjIxd2tLM2Q3MzNMN0lIaS00b3R5RVNlXzJjOVBrTDVEODJsd0RFQklCR1VDb2Q4WnVtMmvSAZYBQVVfeXFMTnZZTzZzcGduSWhhWVBMS3V6X1phTXI2MlJuVEluT1RRanF5cmxhLUxPNEJnQUxjYU1jSkR4Q1pXemlxMGd1VTZZNHhtNE83UU02YWxVM21hbzlrbEpHUjZ3X09OcUVoZmJHY1RMd0kzMGtGNkhBTXdlYmY5LXMxbE16SmNPcFA2a1JjYUxidjctRERzUTNB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 08:01:07 GMT",
        "title": "3 Reasons To Invest In Ethereum, 1 To Stay Bitcoin-Only: Bitwise CIO - NewsBTC",
        "content": "In a recent commentary shared on X, Matt Hougan, Chief Investment Officer at Bitwise Asset Management, which ranks as the world’s largest provider of cryptocurrency index funds, detailed why investors should consider diversifying their cryptocurrency portfolio by adding Ethereum (ETH), alongside maintaining a position in Bitcoin (BTC). Hougan offered three compelling reasons for investors to embrace ETH, while also presenting a critical viewpoint for remaining invested solely in BTC.\n\nEthereum Vs. Bitcoin: 3 Reasons Pro-Ethereum\n\nHougan began by emphasizing the importance of diversification within crypto investments. Drawing an analogy to the early days of the internet, he pointed out how difficult it is to predict which technologies or companies will dominate over the long term. “It is very hard to predict the future with precision,” Hougan remarked, referring to investors who bet on early internet companies like AOL and Pets.com, which failed to maintain their initial promise despite the internet’s overall growth.\n\nRelated Reading\n\nEthereum At A Crossroads: Big Move Coming After Consolidation Phase? 3 months ago\n\nApplying this lesson to crypto, Hougan advised a diversified approach to hedge against similar uncertainties. Ethereum’s current market capitalization stands at approximately $420 billion, which is substantial but still only about one-third that of Bitcoin’s $1.3 trillion market cap. Given these figures, Hougan proposed a default starting allocation of 75% Bitcoin and 25% Ethereum for investors seeking broad market exposure.\n\nHougan’s second point delved into the functional differences between Bitcoin and Ethereum. He described Bitcoin as primarily “a new form of money,” highlighting its design choices aimed at enhancing its utility as a robust monetary system. “Every design choice the Bitcoin ecosystem makes is designed to make Bitcoin the best form of money that has ever existed,” he stated, underscoring Bitcoin’s targeted development toward optimizing its use as a currency.\n\nConversely, Ethereum is characterized by its role as a foundational technology for building new applications that leverage its capability for programmable money. This includes everything from issuing stablecoins to enabling complex decentralized finance (DeFi) ecosystems.\n\n“Ethereum’s primary function is making money programmable,” Hougan explained. He argued that the ongoing development within the Ethereum ecosystem provides a broader exposure to the potential applications of blockchain technology, which is still in its nascent stages.\n\nRelated Reading\n\nThe third argument for Ethereum centered on historical performance data. Hougan pointed out that historically, portfolios that included Ethereum along with Bitcoin showed better performance metrics, both in absolute terms and when adjusted for risk, across full crypto market cycles.\n\n“My favorite thing about that table is that the +ETH portfolio has both higher returns and a lower maximum drawdown,” he highlighted. This historical analysis suggests that Ethereum could offer better downside protection and higher potential returns, though Hougan cautioned that “past performance is no guarantee of future returns” and noted that in shorter, recent periods, a Bitcoin-only strategy would have outperformed.\n\nCounterpoint: Why a Bitcoin-Only Strategy May Be Preferable\n\nAddressing the other side of the coin, Hougan discussed why many investors might prefer a Bitcoin-only strategy. This perspective is especially relevant for those concerned with macroeconomic issues like the degradation of fiat currencies and inflation.\n\nHougan posited that Bitcoin’s dominant position and its community’s focus on becoming a new form of money make it likely to continue leading this space. “It has a large lead, and size matters in money,” he stated, supporting the idea that Bitcoin’s simplicity and focused use-case as digital gold could be more appealing for certain strategic investments.\n\n“Money is a massive market. There’s plenty of space for BTC to run if it succeeds. […] My view, in a word: If you want to make a broad bet on crypto and public blockchains, you should own multiple crypto assets. If you want to make a specific bet on a new form of digital money, buy Bitcoin,” Hougan concluded.\n\nAt press time, ETH traded at $3,514.06.\n\nFeatured image created with DALL·E, chart from TradingView.com"
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxPYUdJMG9mREZ4SjRpODk0UXNYUVJaaDBvREZpVGFPaGdiMjdINzRTR1dMZTRsMHU1Y2ZJb243eXFJS0JFV2dYTnVzMnF0LXh4RVB2aFVNVFUzX0V1UmtoRE1rbnNwTXFWeGhzRnVqX3pJRmFlam92S09vNU5iUmg5aDlSeEVPYlhCSnY3U2lzWnpyam56b2dpSGU1bXdZaUYybENFR2JR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Jun 2024 07:00:00 GMT",
        "title": "Ethereum or Silver? We asked ChatGPT-4o which asset is a better investment for 2024 - Finbold - Finance in Bold",
        "content": "As the broader cryptocurrency market faces a downturn, Ethereum (ETH) has demonstrated notable resilience, maintaining its value above $3,400. At the same time, silver (XAG/USD) is holding firm at a key support level of $29.00, rebounding as US bond yields come under pressure.\n\nThe evolving economic environment has led investors to reevaluate their strategies, comparing the benefits of Ethereum as a leading digital asset with the crucial role of silver in emerging technologies and its responsiveness to industrial demand fluctuations.\n\nEthereum: The innovator’s choice vs. Silver: The steady performer\n\nEthereum’s potential for aggressive growth and high volatility makes it an appealing speculative investment. Its foundational role in the decentralized finance (DeFi) ecosystem and smart contract functionality offers significant upside potential.\n\nAdditionally, Ethereum’s continuous technological advancements, such as the transition to Ethereum 2.0 and growing institutional interest, add to its attractiveness as a high-reward investment. Standard Chartered, an international banking giant, recently announced plans to open a trading desk for spot Bitcoin (BTC) and Ethereum, enhancing Ethereum’s market presence.\n\nEthereum’s flexibility and innovation within blockchain technology provide a hedge against traditional financial market instability and inflation, positioning it as a forward-looking investment choice.\n\nSilver, on the other hand, provides stability and growth potential tied to emerging technologies and global sustainability trends. Unlike Ethereum, silver is less volatile and benefits from its dual role as both an investment and an industrial commodity.\n\nIts sensitivity to industrial demand cycles and use in high-tech solutions position it for steady appreciation. Silver’s traditional role as a hedge against inflation and economic downturns makes it a reliable choice for more conservative investors.\n\nChatGPT’s analysis: Ethereum vs. Silver investment prospects\n\nAccording to ChatGPT-4o, the decision largely depends on individual investment strategies and risk tolerance.\n\nInvestors looking at Ethereum should be comfortable with higher risks and the potential for high rewards. This includes tech enthusiasts captivated by blockchain innovations, long-term believers in the future of decentralized finance (DeFi) and NFTs, and institutional investors seeking advanced digital assets.\n\nEthereum’s recent resilience, growing user engagement, and potential ETF approvals make it a compelling choice for those aiming for significant growth.\n\nChatGPT Ethereum investment prospects. Source: Finbold and ChatGPT\n\nOn the other hand, silver suits conservative investors who prioritize stability and steady growth. Silver’s extensive use in electronics, solar panels, and medical devices ensures ongoing demand, making it a reliable industrial commodity.\n\nAdditionally, silver serves as a traditional hedge against inflation and economic downturns, appealing to those who prefer tangible, physical assets. Its role as both an investment and an industrial commodity makes silver a sound choice for those seeking a balanced and secure addition to their portfolios.\n\nChatGPT Silver investment prospects. Source: Finbold and ChatGPT\n\nUltimately, diversification with both Ethereum and silver can be a way to manage risk and potentially benefit from the growth of both major assets. The choice between Ethereum and silver should align with individual investment goals, risk tolerance, and interest in the technological aspects of cryptocurrencies.\n\nEthereum and Silver recent price performance\n\nEthereum and Silver 6 months performance. Source: TradingView\n\n\n\nAs of 2024, six months performance for Ethereum and silver presents a clear contrast in investment returns. Ethereum has seen a significant rise, with an increase of 39% in six months, showcasing its volatile yet high-growth nature with its current price at $3,505.\n\nIn comparison, silver has gained 30% in six months, with its current price at about $29.5 per ounce.\n\nIn conclusion, both Ethereum and silver offer unique investment opportunities suited to different risk profiles and market perspectives.\n\nEthereum’s innovative edge and high-growth potential make it an attractive option for those willing to embrace volatility and technological advancements. In contrast, silver’s stability and industrial applications provide a safer, more conservative investment route.\n\nDiversifying with both assets could offer a balanced approach, allowing investors to capitalize on the strengths of each while mitigating overall risk.\n\n\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOdGQ1ODlvYXZhc3k3LUdyb3d2RjlGSDlvQzZrZ05SNHdTcUxYZ1JqcUtfSHZBUkwtcGlheTRPSEZwOFhrRFBXbm8zS28xWS1lNVRONUc3WlJrSzY3T0F0dGdhLWFCX2VaV0JCTUt5UjFIZlNhRXFHNDhJdzNjMkltYVpfd0EzSnRMalN4ZFRodw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jun 2024 07:00:00 GMT",
        "title": "Fidelity Makes $4.7 Million Play on Ethereum ETF in SEC Filing - Coinfomania",
        "content": "The United States Securities and Exchanges Commission (SEC) Chairman, Jay Clayton revealed in a Monday interview with CNBC that there is now an increased chance of seeing a Bitcoin exchange-traded fund (ETF) go live for U.S investors soon.\n\nClayton made the revelation while answering questions regarding how far crypto market participants seeking the listing of a Bitcoin ETF have satisfied concerns expressed by the SEC regarding such a product.\n\n“Yes, but there’s work left to be done,” said Clayton who had in the past mentioned perceived market price manipulation on unregulated exchanges and unreliable custody as the primary reasons why the SEC hasn’t blessed any of the Bitcoin ETF proposals it has received so far.\n\nOnce again, the SEC Chairman highlighted those concerns as tough questions, before saying,\n\n“Now, progress is being made, but people needed to answer those hard questions for us to be comfortable that this was the appropriate type of product.”\n\nUndoubtedly, the latest comments made by the SEC Chairman raises hopes that there is yet a possibility of seeing the first Bitcoin ETF launch later this year or at least sooner than many had envisaged.\n\nAs Coinfomania reported last month, the SEC must now rule on whether or not to approve proposed rule changes to list Bitcoin ETFs submitted by Bitwise and VanEck/SolidX. These filings were published in the federal register in February kickstarting a 240-day waiting period for a final decision by the SEC.\n\nHowever, the regulator has delayed deciding on three occasions and must now rule on October 13, 2019, whether or not to approve the Bitwise ETF application, and make a similar decision regarding the VanEck/SolidX on October 18, 2019.\n\nIt is also vital to note that there is a possibility that the SEC decides against approving the current proposals [with only roughly a month remaining] since Clayton also mentioned that “there’s work left to be done.”"
    }
]