[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiaEFVX3lxTE03cjhWaUFSZUpKX2hLZHNFOTNxMlUwM2M2cHhRaTJFc29YZDM0RGRXZEtkVmVHU2J0QUFiRmhSTjJfZkNpQ0NtTVRtNTljUHB2QWlXc3NKUU1wRHVSNXNOWWx4ZEY5YkJD?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "What Is Optimism in Ethereum? - Unchained",
        "content": "Optimism is one of the most popular Ethereum Layer 2 protocols.\n\nDespite Ethereum’s position as the leading smart contract blockchain, it still suffers from scalability issues. This is a challenge for Ethereum as its network supports a growing ecosystem of decentralized applications (dApps) and decentralized finance (DeFi) protocols that require high throughput and low transaction fees to scale. To address Ethereum’s scaling issues, Layer 2 protocols have emerged. Optimism is one of the most popular ones.\n\nIn this guide, we’ll discuss what Optimism is, how it works, and its benefits and drawbacks.\n\nWhat Is Optimism?\n\nOptimism is a layer 2 solution for the Ethereum network that utilizes ‘optimistic rollups,’ a kind of rollup that ‘optimistically’ accepts all transactions in the rollup as valid.\n\nThis process saves time as individual transactions get submitted without proof of their validity. However, validators involved in the rollup have up to a week to question the whole rollup if they have any doubts.\n\nOptimism rolls up multiple transactions into one transaction and settles them on another layer, but with the receipts being relayed back to the Ethereum blockchain. By bundling up transactions, Optimism offers users cheaper transactions and an improved user experience.\n\nOptimism has since grown to become the second-largest Ethereum Layer 2 scaling solution after Arbitrum, with a total value locked of $772 million, according to data on DefiLlama. The Layer 2 solution is also supported by various DeFi platforms such as AAVE, Synthetic, and Uniswap.\n\nHow Does the Ethereum Layer-2 Optimism Work?\n\nThe Optimism Layer 2 solution addresses Ethereum’s scalability issue using optimistic rollup technology. These rollups bundle or consolidate several transactions into one on the Ethereum network, significantly reducing the gas fees required by sharing the cost between the users whose transactions are in the bundle.\n\nTransactions on the Optimism scaling solution are assumed valid by default, mimicking the ‘innocent until proven guilty’ principle. Thus, transactions are processed much faster, improving the user experience.\n\nOptimism has a security system in place for transactions deemed doubtful. This security mechanism provides a one-week window where validators can submit and run a fault proof. This means asset transfers from the Optimism network to the Ethereum blockchain may take up to seven days to complete.\n\nOnce a fault proof is submitted, the transaction in question will go through a verification process against the state on the Ethereum layer. If the fault proof is challenged successfully, it’s removed and reprocessed.\n\nOptimism, designed as a scaling solution for Ethereum, borrows significantly from Ethereum’s architecture. Optimism utilizes the same virtual machine as the Ethereum network and charges gas fees similarly but at a lower rate. Additionally, users can send just about any ERC-20 asset between the two blockchains.\n\nHow to Use Optimism\n\nFor anyone who has used Ethereum before, using Optimism feels the same as using Ethereum.\n\nTo use Optimism, you must deposit either ETH or ERC-20 tokens to the Optimism token bridge. This way, you can process transactions on the Ethereum mainnet through Optimism. You can then change your tokens back to the Ethereum network when done.\n\nYou’ll need to use the Optimism Gateway to deposit your tokens. You can connect to the Optimism Gateway via a Web3 wallet, such as MetaMask or Trust Wallet. The transaction cost quoted will depend on the amount of tokens you want to transfer and deposits happen in minutes.\n\nOptimism will also notify you that you won’t be able to withdraw the funds until after a week. This delay is part of Optimism’s security mechanism. However, once you have successfully deposited your funds on Optimism, you can use them on supported dApps like Uniswap and save on fees. To do this, ensure that your network is set to Optimism.\n\nBenefits and Drawbacks of Optimism As an Ethereum Layer\n\nJust like any technology, Optimism offers both benefits and drawbacks.\n\nPros\n\nScalability: Optimism provides a solution to Ethereum’s scalability problem by using optimistic rollups. This involves moving the computational and status storage off-chain.\n\nCheaper transactions : By bundling the transactions into one, Optimism significantly reduces the gas fees linked with Ethereum transactions while maintaining the trustless nature and security of the blockchain.\n\nEthereum compatibility : Optimism borrows heavily from Ethereum’s architecture, which results in enhanced user experience.\n\nCons\n\nSlow transactions: Optimism has longer withdrawal times due to its security mechanism, which allows validators to raise any concerns they have if they doubt a transaction.\n\nLimited smart contract functionality: Users would still need to rely on Ethereum or other blockchain alternatives if their dApps heavily rely on smart contracts.\n\nSecurity risks: There are some potential security risks as Optimism relies on its fault-proof mechanism to validate transactions.\n\nFinal Words\n\nOptimism offers several benefits for Ethereum transactions, including seamless compatibility with the Ethereum main chain, improved scalability, and reduced fees. But just like with other technologies, Optimism has its drawbacks, including longer withdrawal wait times and limited smart contract capability.\n\nAs Ethereum’s adoption grows, it will be fascinating to witness how Optimism will evolve and transform to meet user needs."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiX0FVX3lxTE1VVXR3U1BKY0ZuTG1CR3N5RVBQNTJkOXRCbGpqdEhuT3NvckxaWHhLSzNiclVhc1NXLVdCQjR3bjRidlJaUDItd3lBeG03MWRja3VYa2JDWXpPVnlja2tz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jan 2024 08:00:00 GMT",
        "title": "Dencun and Pralectra: Ethereum core devs chart an ambitious 2024 - Blockworks",
        "content": "Ethereum’s core developers are debating the priorities for the next hard fork after “Dencun,” which could come in late 2024 or 2025.\n\nFollowing Thursday’s All Core Devs call, the tentative schedule for the Dencun fork remains unchanged, with the Goerli testnet first up on Jan. 17.\n\nLoading Tweet..\n\nWith the rollout of the upgrade looking likely in March, developers are turning attention to what comes next in Prague-Electra — Pralectra for short — the upgrade to follow.\n\nStill very much in flux, a debate is in progress on the overall vision: Either a feature-focused set of smaller Ethereum Improvement Proposals (EIPs) or a major protocol upgrade to introduce Verkle Trees to the execution layer.\n\nVerkle Trees are a new data structure that evolve the current Merkle Tree in use today, using more sophisticated mathematical techniques — vector commitments based on elliptic curve pairings, which are a significant departure from the simpler hash functions used in Merkle Trees, according to verkle.info.\n\nThis structure uses less space and can be verified faster, both of which allow the network to handle more transactions.\n\nIn short, it’s a way to deal with the long-term problem of “state bloat,” which will be increasingly important as Ethereum scales.\n\nThe upgrade is a key milestone on Ethereum’s long-term roadmap, a phase referred to as The Verge.\n\nThere was no clear consensus on the call — some advocate for keeping the focus squarely on Verkle Trees, with Guillaume Ballet at the Ethereum Foundation warning “there’s no such thing as a small fork,” but others calling for a firm commitment to upgrade the network again in 2024.\n\nThe fear is that Verkle Trees could take 18 months or more to deliver — an eternity in crypto.\n\nDencun itself was originally slated for November, but was finally pushed into 2024 last october.\n\nRead more: Core devs rule out Dencun fork this year\n\n“Verkle is on the scale of the Merge if not worse in terms of complexity,” Ballet said. “You cannot really ship anything at the same time on the [execution layer] side.”\n\nLukasz Rozmej of the Nethermind execution client team agreed, recommending the developers prioritize a feature-rich fork first before turning fully to Verkle Trees.\n\n“My experience tells me that state redesigns are extremely hard and they take an extremely long time,” he told colleagues on the call. “Verkle toughness is not the specification, it is the implementation, optimization and testing.”\n\nFeatures, yes, but which ones?\n\nAmong those advocating for a second 2024 fork focusing on features were client teams for Nethermind, Besu and Reth. But the question is what takes precedence?\n\nAndrew Ashikhmin, software engineer on the Erigon client team, suggested that the EVM Object Format (EOF) would be one candidate to drive the next upgrade without distracting from longer-term work on Verkle Trees, because it could be implemented by a smaller team, and was a more isolated change to the code base.\n\n“But Verkle should be the main focus,” he said.\n\nEOF was originally considered for the Shapella hard fork, but was considered too big to be paired as a “passenger” alongside the main “driver,” Proto-Dank sharding or EIP-4844.\n\nRead more: Ethereum’s Next Upgrade To Focus on Blobs\n\nEOF is “definitely not a passenger” according to Justin Florentine, protocol engineer on the Besu client team, but he said that Besu had already made “a lot of progress” on the feature, and therefore was in favor of its adoption in Pralectra\n\nGeorgios Konstantopoulos, chief technology officer and researcher at investment firm Paradigm, which is building the Rust Ethereum (Reth) client, said his team was “OK [with] EOF as it’s [a] one man job and [needs] isolated testing.”\n\nBut Ethereum Foundation developer Marius van der Wijden shared the opinion that “EOF is not going to be in the small fork.”\n\nAnsgar Dietrichs at the Ethereum Foundation supported EOF for inclusion in Pralectra last April, and noted on Thursday’s call that the Solidity team — maintaining the EVM’s main smart contract programing language — was strongly in favor.\n\nNo one on the call was there to explicitly advocate for EOF, however, prompting Nethermind founder Tomasz Stanczak to remark, ”if nobody champions EOF on this call this would summarize why it has not been shipped yet.”\n\nStanczak called EIP-7002 or “Execution layer triggerable exits” the most upvoted EIP in the Ethereum Magicians forum and “super important,” because it fixes a “major design bug with staking [and] cannot come early enough.”\n\nFellow core developer Parithosh Jayanthi, known by the nickname “Potuz” said if he had to choose one feature to ship it would be EIP-7002. However, in his view, EIP-7549 “should definitely be in.”\n\nThis feature, which only affects the consensus layer, fixes a bug in Ethereum’s design and aims to reduce the average number of pairings needed to verify consensus rules. A pairing is an operation used in certain cryptographic algorithms involving elliptic curves.\n\nCurrently, to reach consensus it’s necessary to verify a minimum of 1366 attestations — indicating agreement between validators — but after EIP-7549 it would be reduced to just 22.\n\n“It’s trivial to implement and it’ll save a lot of aggregation time,” Potus said. “It can help on trustless bridges — and zk-provers, zk-bridges — it’s something that should definitely be in whatever fork we do next.”\n\nThe goal of the call was to kickstart discussion, and the specific approach and improvement proposals will be decided at a later date. Ethereum upgrades are consensus-driven; there is no explicit hierarchy of authority, or voting mechanism to determine priorities.\n\nIt can at times appear challenging or chaotic to make progress, not unlike herding cats, but that’s the nature of the decentralized beast.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxPUmhHY2s4Z0gzS3BMLTM4NERKODcwdG1rTFFLNzJVMkN2VTQtSGwxbU1DWDhZNDVWejJ1RmV3Tm1IUzJvY1YxMl9uUGQ5ZHB6X0FNLUpoeUZNX2VlS3Z1NFA0aXBuRE11RmVoTnVWTzdBZE4zN01obU9MOGdKRFEwMmM5ZjZVX1ZlNjRqSnBfRUdtc1M2UmtJ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Once Looked Unstoppable. But It's 1 Crypto I'm Avoiding in 2024 - The Motley Fool",
        "content": "Is it time to rethink the future growth prospects of Ethereum?\n\nHeading into 2023, Ethereum (ETH 0.12%) looked unstoppable. Ethereum had just pulled off The Merge, which was often cited as one of the greatest technical accomplishments of 2022. As a result of The Merge, which made the entire network much less energy intensive, Ethereum appeared to be well positioned to continue its dominance in just about every meaningful niche of the blockchain world.\n\nHowever, since August 2022 -- one month before The Merge -- Ethereum is only up 10%, at a time when other cryptos posted stellar triple-digit returns in 2023. From my perspective, Ethereum suddenly looks very vulnerable, which is why it's one crypto I'm avoiding in 2024. Let's take a closer look.\n\nNew strategic roadmap\n\nEthereum just released its new strategic roadmap for 2024, and I'm not impressed. Even Ethereum co-founder Vitalik Buterin acknowledges that there are only minor changes planned for the year ahead. The primary focus is on resolving some of the blockchain design problems that resulted from The Merge. Fair enough -- it's probably expecting too much from Ethereum to come up with a wildly new strategic roadmap after a breakthrough achievement like The Merge.\n\nHowever, what concerns me is that some of the initial grand strategic goals of The Merge keep getting scaled back. For example, at one time Ethereum promised a total throughput speed of 1 million transactions per second. That has now been scaled back to 100,000. And according to Ethereum's own strategic roadmap, that goal probably won't be achievable in its current stage of development. Meanwhile, rival blockchain Solana (SOL -1.77%) says it already has the ability to handle 65,000 transactions per second.\n\nOn top of all that, Buterin seems to be backing away from what he refers to as the \"financialization\" of Ethereum's blockchain. Simply put, this term means the mainstreaming of Ethereum's blockchain for Wall Street institutions, ensuring that the blockchain's architecture makes sense for the modern financial world. If you're a long-term investor, that's exactly what you want to see, because it would be huge for Ethereum's future growth prospects.\n\nHowever, Buterin now seems to be leaning into what he calls a \"cypherpunk\" (a mashup of \"cyberpunk\" and \"cipher\") approach to blockchain development to recapture some of the early mystique of crypto. Kudos to Buterin for staying true to his original vision for the blockchain. But as a cold-hearted investor, I find that somewhat worrisome. Are top Wall Street firms really going to partner with a bunch of cyberpunks?\n\nRise of new competitors\n\nBy itself, a less-than-compelling strategic roadmap would not be enough to get me off Ethereum. I mean, really, this is Ethereum we're talking about. This is a blockchain that has a strong track record dating back to 2015. Ethereum's Buterin has been featured on the cover of TIME magazine as \"the prince of crypto,\" and it's hard not to think of him as one of the brightest minds of our generation.\n\nHowever, take a step back and consider the overall competitive landscape. One of the primary reasons for investing in Ethereum has always been the fact that it is a best-in-class blockchain, with an obvious dominant market share in key blockchain niches. But now there are several very credible competitors all nipping at the heels of Ethereum. Right now, three of the top 10 cryptocurrencies by market cap -- Solana, Avalanche (AVAX -1.74%), and Cardano (ADA -2.47%) -- are direct competitors to Ethereum.\n\nMoreover, all three of these competitors now appear to be growing faster than Ethereum, especially Solana. At the end of 2022, for example, Solana started to eclipse Ethereum in terms of NFT trading volume and decentralized exchange (DEX) trading volume. And institutional investors really appear to be buying into the argument that Solana is a faster, more cost-efficient version of Ethereum. For example, Cathie Wood of Ark Invest recently appeared on CNBC, talking up the merits of Solana.\n\nHow can Ethereum get its mojo back?\n\nRight now, I'm not adding to my Ethereum position until it moves out of The Merge stage of development and into what the crypto's leaders have dubbed \"The Surge\" stage of development. To me, the remainder of The Merge stage is filled with a bunch of wonky technical improvements that aren't truly disruptive in nature. In contrast, The Surge is when Ethereum is supposed to hit that 100,000 transactions per second threshold. That's exciting, because even a world-class payment network like Visa, Inc. (V 1.28%) can't deliver that type of throughput.\n\nAt the same time, I'll be watching to see how well Ethereum preserves its market-leading position in key blockchain niches. If Ethereum can show that it is fending off rival blockchains such as Solana, then I will be much more inclined to restore my bullish outlook for Ethereum."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxNN0JZM0piOG0xWUktaXNCOGtqSnlJQk9iUDJsZWVuWE5CTzZBZEpOQllPMEhhR0tadU5ybEhCWTNaNkMyT0U1dG5rQUJxX2xpNE5nNHV2RktHM0dOQ05UTlF5ZUUycVN3eUhOM3RsQ0ZQdjV5emdyT1p0enNaMC1FN25TRTgyNmJmR3BCVExzSkVSaXli?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jan 2024 08:00:00 GMT",
        "title": "Will Ethereum hit $10k in 2024 or is this altcoin a better alternative? - crypto.news",
        "content": "Disclosure: This article does not represent investment advice. The content and materials featured on this page are for educational purposes only.\n\nWith market conditions trending higher, many speculators are contemplating whether Ethereum (ETH) could hit $10,000 in 2024. Currently, it is trading at $2,254, up 2.9% this month and 81% year-to-date. However, some analysts are backing Bitcoin Minetrix after its presale hits $7.5 million.\n\nAnalysts bullish on Ethereum\n\nGiven Ethereum’s trajectory in the last bull run, market participants are eagerly anticipating for the coin to hit $10k, hoping it comes in the early stages of the upcoming bull market rally.\n\nYou might also like: Ethereum suffered highest losses due to rug pulls and hacks, data shows\n\nFollowing the last Bitcoin halving, Ethereum rose from $200 to over $1,200.\n\nIf the same growth applies, ETH may soar above $13K by the end of 2024.\n\nEven so, several variables are at play, mainly Ethereum’s significantly higher market cap of $272 billion.\n\nAs such, it is not as simple as using past data to determine future results. However, several analysts have weighed in on this possibility in 2024.\n\nGeoff Kendrick, head of FX Research, West, and Digital Assets Research at Standard Chartered Bank, believes the coin could be headed to $4,000 by the end of 2024.\n\nThe analyst referenced the Bitcoin halving, speculating it “should lift all boats.”\n\nMeanwhile, X commentator icircle_nft recently said ETH will rally to $5K by the end of 2024.\n\nhttps://twitter.com/icircle_nft/status/1741776096969077001?s=20\n\nHowever, the analyst has higher hopes for ETH in 2025, forecasting it will reach $18K.\n\nMeanwhile, FieryTrading said the coin is trading inside a rising wedge pattern and may reach $16K by the end of 2025.\n\nThat said, analyst CrediBULL Crypto is even more optimistic, speculating Ethereum could reach highs of $20K or a minimum of $10K by the end of 2024.\n\nUltimately, whether Ethereum will underperform, equal, or outperform its last market cycle remains to be seen. While most analysts are bullish, there are many opinions on where it could be headed.\n\nThough many analysts expect Ethereum to outperform in 2024, some are more bullish on Bitcoin Minetrix after raising $7.5 million in the ongoing presale.\n\nBitcoin Minetrix raises $7.5 million in presale: what’s next?\n\nBitcoin Minetrix allows users to earn passive BTC rewards by staking on Ethereum.\n\nThe project is a cloud mining solution where users can stake BTCMTX for Bitcoin mining credits.\n\nThey can then burn these credits on the Bitcoin Minetrix platform for cloud mining power, receiving Bitcoin.\n\nThis use case requires no hardware or technical know-how from users, making it ideal for beginners.\n\nAnother benefit is that the decentralized and transparent BTCMTX eradicates the risk of cloud mining scams.\n\nOther advantages include no space or noise constraints on the user and it offers a more eco-friendly way to mine Bitcoin.\n\nThese benefits seem to be supporting the project in the ongoing presale which has raised $7.5 million so far.\n\nFor what it offers, an analyst, Jacob Bury, says BTCMTX is set for more gains after launching."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxOTTZRVEtSVS00R0dFSEtHb3VaUGExRURRajl2SVd5V0RtTzVHeEwtdzRob0UyOWRtYldDaGE5X3ZnYkdXNmdsU2N0YmdHMGd0MnVXZTdReEFQWkRZVWtnTHJXUV8zZElOWm16RXI2NEN4WjZxTjRHSnhmNDg1WXU2NDExVUpXVGpXc0tEZVV6Ti1fYmR2WThwZmd3QUVwaFd4M1hoTE5LSS1DbUZ5Y1FlQVBpV2dSOEw1SjhPOEU1MTNTZ9IBxwFBVV95cUxNRVpSQWxmeXpXV002QkloMWY2M3hvLXJWSjFzRmRGdHVRNkZKWHF1SXItZGRGSVYwanlXdzRQSFBYcDBoOUNSQzFaSUhzN1ZNOHFhbkh6Sm1RNjk3RFZnMUlza1NpSnRRSDd4eERzLVo5WVFuNkRoN0hRNnNxc1ZZSmo5T1BnMjlwQTRNRV9ybUtZVFFjTEhfNFVfNHpFTm9TczJHWlV1cEg4Nlk3VmZMMkhfaUplemo2RWMwM3dHZS1zVzg4b3NF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jan 2024 08:00:00 GMT",
        "title": "Ethereum price could target $3,000 with ETH whales buying the dip - FXStreet",
        "content": "Ethereum price has shown interest in a recovery rally, trading around $2,244.\n\nA spike in whale transaction count suggests investors could be buying the dip.\n\nOn-chain metrics hint at little to no resistance up to $2,800.\n\nA flip of the $2,145 level into the resistance level will invalidate the bullish thesis.\n\nEthereum (ETH) price is attempting a recovery bounce that could kickstart a run-up to new yearly highs. Supporting on-chain and technical indicators add credence to this bullish ETH outlook.\n\nAlso read: Institutions’ interest in crypto grew by 176% in 2023 but seems to be waning ahead of Bitcoin ETF\n\nEthereum price ready to move higher\n\nEthereum price slipped low as $2,100 on January 3 after Matrixport’s ETF-rejection post. But ETH, like many other cryptocurrencies, recovered quickly. Ether currently trades at $2,244, forecasting a potentially explosive move to the upside.\n\nThe Relative Strength Index (RSI) hovers around 42 after its recovery from the oversold region a few days ago. A higher low formation could indicate a slow but steadily gaining upward momentum.\n\nThe Awesome Oscillator (AO) is much more optimistic than the RSI, which shows a decline in bearish momentum as the indicator approaches the zero line. A flip of the mean level would indicate that the bullish momentum is in play and could push Ethereum price higher.\n\nIn such a case, if Ethereum price flips the $2,300 hurdle into a support floor, it could move higher and retest the $2,400 barrier. In a highly bullish case, ETH could tag the 161.8% Fibonacci level at $2,562 and also the monthly resistance level at $2,652.\n\nRead more: Ethereum price could make a recovery as ETH supply on exchanges hits an all-time low\n\nETH/USDT 1-day chart\n\nThe bullish Ethereum price outlook is supported by the spike in Whale Transaction Count and Volume on January 3. According to Santiment’s data, this uptick occurred on the day of a massive sell-off, which is a sign of investors buying the dip.\n\nSince whale-transaction count tracks transfers worth $100,000 or more, this uptick has a high chance of being a buy-the-dip move from institutional investors. Considering that the volume coincides with this uptick adds even more credence to the bullish outlook.\n\nETH whale transaction count, volume\n\nFurthermore, IntoTheBlock’s Global In/Out of the Money (GIOM) indicator shows that the immediate key hurdle at $2,347 is relatively weak. Hence, overcoming this blockade could send ETH to the next critical level of $2,859. Here, roughly 10.77 million addresses that accumulated 5.2 million Ether are sitting at a loss.\n\nTherefore, a potential move into this hurdle could see a considerable spike in selling pressure from these holders trying to break even.\n\nETH GIOM\n\nOn the other hand, if Ethereum price flips the range low of $2,144, it will create a lower low and invalidate the bullish thesis. In such a case, ETH could slide 6.50% and revisit the $2,000 psychological level.\n\nAlso read: Following spot Bitcoin ETF applicants, SEC holds meetings with NYSE, NASDAQ and other exchanges"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxOMnpPV21uNTlDWks4ajh3ZXN0TnlwdkNmaUpUTWx6Wm1zYnZPa1Rkamx2cWxoTGREOXF2UmJCTXppZXJDbkpBTkFhYWZvUWRScEFnOVRwdFNyQktaUDJqdHAtTUNPNEJkTzRGM2cyV0Rmd0xwTUJtOGpLTTEteDRhVUQydzNlX0FPNUY3WVVXQW5lVU11TF9BYndkZmpzUV9KZ2o5aGhodndVclVZWUFDYWRUZ0I?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jan 2024 08:00:00 GMT",
        "title": "Arbitrum Takes Lead in Daily DEX Volume for First Time, Surpassing Ethereum and Solana - Unchained",
        "content": "The surge in Arbitrum’s daily volume likely stems from the upcoming Ethereum upgrade dubbed Dencun, not the memecoin frenzy experienced by other blockchain networks.\n\nArbitrum, a layer 2 scaling solution for Ethereum, has taken the lead in daily volume on decentralized exchanges (DEX) for the first time in Arbitrum’s history, according to the most recent data from crypto analytics firm DefiLlama.\n\nOver the past 24 hours, the total value of transactions made on Arbitrum by crypto users stands at $1.83 billion, taking the lead from base layer blockchain Ethereum, which has a 24-hour volume of $1.44 billion. In fact, the combined 24-hour volume of Solana, Binance Smart Chain, Polygon, Avalanche, Optimism and zkSync Era is less than that of Arbitrum.\n\n\n\nThe historical leader in 24-hour volume has been Ethereum, though its seat on the throne has been challenged recently. Solana, a layer 1 blockchain that implements proof-of-history, surpassed Ethereum’s daily DEX volume for several days in December 2023. Now, less than a month later, Arbitrum has taken the lead.\n\n“It’s not an easy feat, there’s a lot of chains and not many have been able to do that, even if it’s just temporarily,” said Martin Lee, content lead at on-chain metrics firm Nansen, to Unchained via Telegram. “While it’s an impressive achievement, ideally, I’d want to see this trend continue over a longer time horizon before putting any weight behind it. We’ve seen moments where chains get massive spikes in activity but few manage to maintain it.”\n\nDencun’s Impact\n\nThe spike in Arbitrum’s volume likely stems from the upcoming Ethereum upgrade known as Dencun, Lee noted. Set to be activated on several testnets this month, Dencun is the first major upgrade to Ethereum since Shapella in April of last year, which enabled stakers to withdraw their ETH. The newest upgrade includes EIP-4844, also known as proto-danksharding, which is designed to scale Ethereum in a decentralized way.\n\n“Proto-danksharding reduces the cost of posting large amounts of data to Ethereum and thereby lowers the operational cost of rollups,” wrote Galaxy’s vice president of research Christine Kim in a research report last June. “EIP 4844 is considered a boost to Ethereum scalability because it makes Layer-2 networks built atop Ethereum more cost-effective,” the report said.\n\nIn addition, Carlos Mercado, data scientist at blockchain data firm Flipside Crypto told Unchained over Telegram that “Arbitrum over the last few weeks has been preparing for Arbitrum Orbit, their competitor to the Optimism ‘Superchain’ thesis,” a network of chains that all share Optimism’s open-source development stack.\n\nNotably, the surge in Arbitrum’s daily DEX volume is not from the recent memecoin frenzy that has gone viral on other Layer-1 networks such as Bitcoin, Solana, and Avalanche. Memecoins “never took off” on Arbitrum, according to Nansen’s Lee.\n\nARB, the native governance token for the Arbitrum ecosystem, has slid roughly 11% in the past 24 hours, but has gained nearly 27% in the past seven days to change hands at $1.86, according to CoinGecko.\n\nDisclosure: Arbitrum is a sponsor of Unchained."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxPdEVFdWpEUU1zM21ydUpvNjNwLVFhbXRmN3hPczhWVDJ3MU9CUGsteEFBVzVxbF9tQlE2UE1DR3hCbG5UMEZuTkZEQmJhV0RNTGM3SWlMSVZnS3Q4SlIyQXFtYm5XOEhuUk5fNzJMb1NIUzlldmJaNGVaV2FoMkR4dXNVX29ZRWRGX3JoNzY2bjQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jan 2024 08:00:00 GMT",
        "title": "Arbitrum DEXs daily transaction volume eclipse Ethereum, Solana - CryptoSlate",
        "content": "Decentralized exchanges (DEX) transaction volume on Arbitrum, a layer2 network, surpassed that of Ethereum for the first time during the past day, according to DeFillama data.\n\nDuring the reporting period, DEXs on Arbitrum saw their volume soar to $1.843 billion, surpassing Ethereum’s $1.444 billion and Solana’s $683.59 million.\n\nThis surge aligns with Arbitrum’s continuous weekly growth, rising by 32.58% to $6.804 billion, a new all-time high, though still trailing Ethereum’s $9.581 billion. However, it surpasses Solana’s $5.039 billion and notably exceeds Binance Smart Chain’s daily volume by nearly fourfold.\n\nThe rising DEX volume also coincided with high-network activity on the layer2 network. During the past day, Arbitrum’s daily transaction per second stood at 14.05, while Ethereum mainnet’s was 12.92, according to L2beat data.\n\nUniswap dominates\n\nThe increased trading volume can be attributed to heightened activity on Arbitrum’s DEXs like Uniswap, Camelot, Ramses Exchange, and Trader Joe. Data from DeFillama shows that these protocols have enjoyed double-digit growth to new highs during the past week.\n\nUniswap Labs, the developers of the popular decentralized trading protocol Uniswap, revealed that Arbitrum became the first layer2 network to cross a billion in daily volume on the platform on Jan. 4.\n\nUniswap is the largest DEX protocol by trading volume across all chains, with an average volume of more than $1.5 billion during the past week.\n\nArbitrum’s rising TVL\n\nThe rising DEX volume has also coincided with a sharp increase in the total value of assets locked on the Ethereum-based layer2 network.\n\nData from DefiLlama shows the TVL on Arbitrum-based applications has increased by around $1 billion in the last six months to nearly $2.5 billion, with the dominant DeFi protocol being GMX, a decentralized spot, and perpetual exchange, which controls about 20% of the network’s total TVL.\n\nAdditionally, Arbitrum’s native ARB token recently reached a new all-time high of more than $2 on Jan. 4 but has retraced to $1.94 as of press time, according to CryptoSlate’s data.\n\nMentioned in this article"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxPNU9GVmk4ZDJRMG9sVDRzYTA3dUZ3c3llR2NPdFhwRnpWUVRDSmdUUEJVeFFIeTBrUF9yaXZXbWhQX3RJY19LbGxwb292NThXSzE3WFVOZzhHcEtGUnpNQ3duM2ZoZmF4RmRkOUhmSkZMemdkQW9tYTY2cU00SHlOLVczVDBodnRtM2c1WUF4LXZUZ9IBlwFBVV95cUxNbHZvSlNpVFRQRmFvTjRlSVZjWGFYSEJPQ2lDVTNrYVdWckNSaHlnV1Q1YUdZeU1rVGRXX3Z6ejFoaDlza2x3a0oyNTRacVNjRHo5YUtoOHBXdDRpZk5teF9xUUhDWWNWN0VST1VDM0JjZjZkVUc4WTJxM0VRWlBUaDFpbkNFYnRiSE9hR0pBMUtPWUZ0WWR3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jan 2024 08:00:00 GMT",
        "title": "Rotation Back Into Ethereum Begins, Could ETH Hit $10,000 in 2024? - CryptoPotato",
        "content": "Ethereum’s recent lackluster price movement had many calling it an ‘ETH death’ as rivals Solana and Avalanche skyrocketed.\n\nHowever, the fourth quarter layer-1 rotation was similar to that in 2021, observed crypto analyst ‘Metaquant’ on Jan. 5.\n\nMoreover, Solana and Avalanche are slowing down after weeks of upward price action, so where is the capital flowing next?\n\nEthereum Rotation Begins\n\nThe analyst noted that ETH is flowing out of centralized exchanges, and activity on the network is slowly increasing compared to the past weeks.\n\n“The rotation from alt L1s to ETH has started – ETH on-chain season is heating up.”\n\nQ4 saw an L1 rotation similar to 2021, but now it’s time for the king to play its hand.$SOL and $AVAX are now slowing down after weeks of up-only PA. Here is a quick analysis of where the money is flowing next👇 — Metaquant (@QuantMeta) January 4, 2024\n\nThe analyst added that in the past ten days, AVAX and SOL have cooled down after their huge runs, while ETH went sideways without showing signs of weakness. “The next run will likely be on ETH and its ecosystem,” he said.\n\nAdditionally, the activity on Ethereum and layer-2 networks has been growing steadily for months. Total value locked across the L2 ecosystem hit an all-time high of $21 billion on Jan. 4, according to L2beat.\n\nIn addition to the TVL peak, daily active addresses, layer-2 fees, and layer-2 stablecoin market capitalization have also been steadily increasing.\n\nSince ETH prices have been lagging as attention was elsewhere, “once price goes up, everyone will move again on ETH and L2s,” he said.\n\n“Note how there is no bull run without an ETH on-chain season. So, it’s a matter of time before this starts to happen.”\n\nAdditionally, embattled crypto lender Celsius has just announced that it is unstaking ETH to return to creditors.\n\nWhile this may cause some short-term volatility if they sell, it has been viewed as a positive for Ethereum markets without the vampirical cloud of Celsius and its huge ETH bags hanging over them.\n\nETH Price Outlook\n\nETH prices have remained flat on the day at $2,242 at the time of writing. However, the asset is down 8% from its weekly high of $2,434 on Dec. 2 as markets cool.\n\nZooming out, Ethereum has been consolidating at current levels for the past month.\n\nAdditionally, analysts have been mulling potential price peaks for ETH this year. Some see it hitting $10,000 quite easily. This is only double its all-time high in the last cycle, in which it made a $4,800 gain from trough to peak."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxNQVNiQXNWejMyUHJ1b0dVTm83TWdKaWM4SHpzd3lGUGFoZ2UzaW9JSlRjdmE0V3h4RUVnQ2V5c2xHcHJxUzNKZm9uSUstUDRGNVlVOTAwTXJ4VFdQNEptRGpvRElXVURQVjByMF94eFZ5b0ZFb3BwUWV5NkVxdUlwb3hfZldRd2hlMm9oOHRn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jan 2024 08:00:00 GMT",
        "title": "Ethereum: 3 Indicators Suggest ETH Could Reach $10,000 in 2024 - Watcher Guru",
        "content": "2023 was not particularly Ethereum’s (ETH) best year. Although the second-largest cryptocurrency rallied almost 90%, other altcoins, such as Solana (SOL) and Avalanche (AVAX), were miles ahead. SOL’s price went up by nearly 1000% in 2023. AVAX, on the other hand, saw an increase of over 200%. However, things may change for ETH in 2024, as there is a possibility that the project could surge to new heights.\n\nAlso Read: Ethereum to “Easily” Rally 350% and Hit $10,000: Predicts Analyst.\n\nEthereum (ETH) to hit $10,000 in 2024?\n\nOne of the biggest drivers for ETH’s price would be a bull run for the crypto market. Analysts anticipate a bull market in 2024, fuelled by the SEC‘s (Securities and Exchange Commission) possible approval of a spot Bitcoin (BTC) ETF (Exchange Traded Fund) and BTC’s halving event in April. Both developments could usher in a 2021-like bull run for the crypto market. In such a scenario, BTC might hit a new all-time high. If BTC reaches a new peak, ETH is likely to follow.\n\nAlso Read: Ethereum: ETH Could Hit $3500 in Q1, But There’s a Catch\n\nThe second factor that could send Ethereum (ETH) to $10,000 is the possibility of an ETH ETF. The world’s largest asset manager, BlackRock, is among the interested parties. Moreover, the SEC has accepted ETH as a commodity. Hence, an ETH ETF approval could be smooth sailing for the industry.\n\nAnother aspect to consider is that an Ethereum (ETH) rally is long overdue. Other altcoins, such as Solana (SOL), Avalanche (AVAX), Cardano (ADA), etc., rallied hard towards the end of 2023. ETH, however, kept calm. Hence, we may see a late rally for the second-largest cryptocurrency.\n\nEthereum (ETH) is also one of the most-used networks right now. The project dominates in terms of applications and adoption. This metric will play a vital role in ETH’s journey to $10,000."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPSGhGeGYxUHowRFZ0b1ZQaXN3bHB0SXFZM21UWC1Ma2lfb1YyUjNWTzZQN01OWW9SMEthUWp4eE1BZ0E2R29hanhneE12TzZKdmo3TTZJZmhMQU9VY2N4Uy1OaVZsdXVOLVVlZFQ2MHRqNEM4MmwtYVhBTXcyZ0NJQ1BydXBRUkNHYU5NX3h30gGTAUFVX3lxTE1kVmJMbUNiZlZqVXFZdjBWbk9iaVFHZ05RV3k0MG5zX2t3TWdNQmRWRW1Hdms3X1RQV2RTZF9vb19yVzZlbW9UVE1oZlVUWXY4bUx0bDV1ZV84ckoxTFhINXRDQkpLSUc2QXd3Z25yMkxLM1Q1T3haMHhweWgwYkNXUFhlcGJOdmNMamhtblVRckh6NA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Price Prediction Signals 20% Downside Risk As 60-Day Support Falls - CoinGape",
        "content": "Ethereum Price Prediction: Ethereum (ETH), the world’s second-largest cryptocurrency, has been experiencing a lateral trading pattern for over a month, fluctuating between two key levels at $2400 and $2137. The appearance of daily candles with rejection wicks at both ends signifies a prevailing uncertainty among investors. Recently, a sharp market downturn, partly attributed to speculated rejections of spot Bitcoin ETFs by the US SEC as reported by Matrixport, a digital asset financial services firm, resulted in a notable 6.5% drop in the ETH price. This decline led to the breach of a crucial support trendline, hinting at the risk of further corrections.\n\nIs Ethereum Headed for a Steeper Slide?\n\nA bearish breakdown below the support trendline hints at an early upcoming correction.\n\nA healthy retracement in ETH price should bolter buyers to revive exhausted bullish momentum,\n\nThe intraday trading volume in Ether is $19.3 Billion, indicating a 53% gain.\n\nOver the past eight weeks, the Ethereum price has shown signs of recovery, evident from an ascending trendline on the daily chart. This trendline has historically served as a strategic buying point for investors during market dips, indicative of a robust recovery.\n\nadvertisement\n\nHowever, during the current period of consolidation, Ether has been facing substantial resistance at the $2400 mark. The recent downturn, coinciding with the broader market sell-off, pushed the price below both the 23.6% Fibonacci retracement level and the established support trendline.\n\nIf the daily candlestick closes beneath this critical threshold, it could pave the way for sellers to exert additional downward pressure, potentially triggering a further 20% price decline, bringing the ETH price down to approximately $1750.\n\nEthereum Long-Term Holder Ratio Surpasses Bitcoin\n\nWhile current short-term trends suggest a cautious or downward trajectory for the Ethereum price, an analysis of the “Holder Ratio” chart presents a promising outlook for the cryptocurrency. In a retrospective of 2023, on-chain data from Intotheblock showcased on the X-platform, revealed that the proportion of long-term Ethereum holders exceeded that of Bitcoin for the second time. This vital statistic underscores a growing trend of Ethereum investors committing to hold their assets for extended periods, outpacing similar commitments among Bitcoin investors. This increase in long-term holding is significant as it reflects deepening confidence in Ethereum’s prospects and stability\n\nRelative Strength Index (RSI): The daily RSI slope drops below the midline reflecting the sellers are strengthening their group over\n\nExponential Moving Average (EMA): The ETH price above daily EMAs(50, 100, and 200) hints the broader market is strongly bullish.\n\nRelated Articles:\n\nSahil Mahadik Sahil is a dedicated full-time trader with over three years of experience in the financial markets. Armed with a strong grasp of technical analysis, he keeps a vigilant eye on the daily price movements of top assets and indices. Drawn by his fascination with financial instruments, Sahil enthusiastically embraced the emerging realm of cryptocurrency, where he continues to explore opportunities driven by his passion for trading\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE5QcjRWUE9hRHJRMUJ4T21aempkc2pLRU93R0dGTjB3WTBfa3d0LXA3ZVE3c1hIN2xTZTdQZHVfQTBiVG1PUzh2YkpEUl90aHhvbW5wWVVJaFJSQTF3Q1VWUDlRRjk2c1JTdlM3aEtVa0E5d29rbkhoODJWNmZrZ9IBgwFBVV95cUxNekRKd2FyY1FBdkYtSHhaMmpHRjc1WFFQVm9WSGN4c19pcXRHR2o4emZRdkxSNnFMNVJFUmZqd1ZqcF9VSzNnU0RsNU1mU3Jnd1VqSVcxdHFMVEVHMW13QTA0anhoRjNtd3RuXzU0LUhBV3JnVUttUG9pVTVMa2FPc1VnMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "The Rise of Layer 2 Solutions in 2024: Scaling Cryptocurrencies for the Future - Coinnounce",
        "content": "Layer 2 Solutions: The Next Frontier in Crypto Scalability\n\nAs we delve deeper into 2024, the cryptocurrency world is buzzing with a key development: Layer 2 solutions. These technologies are pivotal in addressing one of the most pressing issues in the blockchain arena – scalability. But what exactly are Layer 2 solutions, and why are they becoming crucial for the future of cryptocurrencies like Bitcoin (BTC) and Ethereum (ETH)?\n\nUnraveling Layer 2: Enhancing Blockchain Efficiency\n\nLayer 2 solutions are advanced protocols built on top of an existing blockchain (referred to as Layer 1). Their primary objective is to enhance transaction speed and reduce costs, without compromising the security of the underlying blockchain. This is akin to adding express lanes to a busy highway; the original road (Layer 1) remains intact, but the new lanes (Layer 2) allow for faster and more efficient travel.\n\nLightning Network and Bitcoin: A Match for Speed\n\nOne of the most prominent Layer 2 solutions in 2024 is the Lightning Network, primarily associated with Bitcoin. This protocol facilitates instant, low-cost transactions by creating off-chain payment channels. It's a game-changer for BTC, transforming it from a digital gold to a viable medium for daily transactions.\n\nEthereum’s Scalability Quest: Rollups and Beyond\n\nEthereum, known for its smart contracts, has also been actively embracing Layer 2 solutions. Rollups have been a significant focus, bundling multiple transactions into a single one on the main chain. This not only speeds up the process but also reduces the infamous gas fees, making ETH transactions more user-friendly.\n\nThe Impact on Decentralized Applications (DApps)\n\nLayer 2 solutions are not just about faster and cheaper transactions; they have profound implications for Decentralized Applications (DApps). By alleviating the congestion on main chains, Layer 2 opens up new possibilities for DApps in terms of complexity and user experience, fostering innovation in the DeFi and NFT spaces.\n\nThe Future of Layer 2: Challenges and Opportunities\n\nWhile Layer 2 solutions offer immense promise, they are not without challenges. Interoperability between different Layer 2 solutions and the main blockchain, and ensuring the security and decentralization of these layers, are ongoing areas of development. However, the potential rewards are enormous, offering a glimpse into a future where cryptocurrencies can scale massively to meet global demand.\n\nEmbracing the Layer 2 Revolution\n\nAs we progress through 2024, the integration of Layer 2 solutions continues to reshape the landscape of cryptocurrency. For enthusiasts, investors, and developers, understanding and leveraging these solutions is key to navigating the future of digital currencies. Layer 2 isn't just a technical upgrade; it's a leap towards realizing the full potential of blockchain technology."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxPQXRCLVJMZDZnX3FGQndqaS1TbkJHUmFJV0NZR0dtSlhjb0tBMTNreW0zTEhUNTRCRExOYW4xTE5waWkwaFhSN3JCODl2OWlTbDQ5UFhZUi1Qc1JqNk5vN0xYZWFNbUpuOEZQeTJnRVpxWjVTS3VvUFBId2dMNk1nNUlfRVY?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jan 2024 08:00:00 GMT",
        "title": "Ethereum: ETH Could Hit $3500 in Q1, But There’s a Catch - Watcher Guru",
        "content": "In a recent tweet, Michaël van de Poppe, the founder of MN Trading, sheds light on Ethereum’s current trajectory, emphasizing its ongoing momentum.\n\nHowever, he points out a significant gap that Ethereum needs to bridge to attain parity with Bitcoin. Van de Poppe anticipates a phase of consolidation before Ethereum can forge ahead, aiming for the ambitious target range of $3,000 to $3,500 in the first quarter of 2024.\n\n#Ethereum is still showing momentum but has a big gap to gain in order to be at the same level as Bitcoin.\n\n\n\nWe'll see some consolidation before continuing towards $3,000-3,500 during Q1 2024. pic.twitter.com/gz3T6dHl6K January 3, 2024\n\nAlso read: Top 3 Cryptocurrencies To Watch In 2024\n\nThe current state of Ethereum\n\nAs of the latest data, Ethereum (ETH) has witnessed a remarkable year-to-date surge of 77.3%. Despite its upward journey, ETH is currently facing a 6% drop in value, trading at $2,219.68. The 24-hour trading range reflects a low of $2,113.93 and a high of $2,385.12, underscoring the inherent volatility in the cryptocurrency market.\n\nChangelly analysts contribute their perspective to Ethereum’s future, projecting a potential surge to $3,000 by July 2024. However, they caution that these predictions are subject to fluctuations based on overall market conditions.\n\nAlso read: Ripple (XRP) or Cardano (ADA): Which Coin Will Hit $1 in January 2024?\n\nThe volatile nature of the crypto market necessitates a cautious approach, emphasizing the influence of various factors on Ethereum’s price trajectory.\n\nSo, while the ride may prove choppy in the interim, ETH’s long-term technical picture remains starkly bullish. Another wave higher appears imminent; its scale is becoming the next key question."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxQaG9UTmd0RFZQQWUxeXU4SmlRTXEwZS1KQjNWVUNlenZpNWEzbU5Ga0lmUElnUTJ0Z1pOU1NvNGV4WE9FMXhpRVF0WmN2dnN0OGlVeUxGR1lJcmVUd2ZTaWhPSXpERkJncDFuOGhyYTZhVWlCaTNUaTdkbG9zemg5d1Fmd0N6bVN0Y0hGLUFVWlNlZzlsMVlaR3AtWDgxY29QbFHSAacBQVVfeXFMTjFLbTBiSjVDb0NKa3kydTBmUlRMekV1NnNIaTIxem9JZ0pLakJvblF5LWQ3cmpMRlI1Q0hPQWxNZENsRkgxdTNSZjVZS2hHMDNMa3VzcXJRQTlXcGMtTHl1ei1JRzlYa3JKa3ZFbllzRDlUZWIydUlVcVE2TjZONWZSS19GU3l5R25MRG9uQml2eDJ5cDFNNGs3X3MyZm5WZXo2REt1bWs?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin’s Historical Bull Run Analysis Points To Potential Peak In October 2025 - ZyCrypto",
        "content": "Advertisement\n\nBitcoin continued to surge higher on Thursday, following a surprise recovery on Monday, which was preceded by weak volatility for most of last week.\n\nBitcoin was trading at $44,240 at press time, marking a 3.43% increase over the past 24 hours. The broader market has also mirrored this growth, with top 10 cryptocurrencies such as Ethereum, BNB, XRP, and Solana experiencing notable increases in the range of 2.28% to 8.6%.\n\nMeanwhile, amidst this resurgence, prominent crypto analyst Ali Martinez has put forth a compelling perspective on Bitcoin’s future trajectory. In a tweet, Martinez drew parallels between the current market dynamics and historical bull runs, with his analysis suggesting that Bitcoin’s next peak could potentially materialize in next year’s fall.\n\n“If we mirror BTC’s past bull runs (2015-2018 & 2018-2022) from their respective market bottoms, projections suggest the next market peak could land around October 2025. That means BTC still has 700 days of bullish momentum ahead!” Wrote Ali.\n\nNotably, reflecting on historical patterns, the surge from $1,100 to nearly $20,000 in 2017 showcased a remarkable 20x increase within 12 months, driven by increased public awareness and retail investor participation. The subsequent years saw significant fluctuations, with the 2020 surge leading to an all-time high of over $68,500 in November 2021.\n\nAdvertisement\n\nHowever, challenges arose as the Bitcoin hash rate plummeted due to China’s decision to shut down mining operations, contributing to a subsequent price drop. The year 2022 further brought about a prolonged bearish trend, with the price dropping to as low as $15,700 due to investor concerns following the collapse of FTX and other high-flying crypto firms.\n\nNonetheless, Bitcoin staged an impressive recovery in 2023, driven by revitalized investor confidence and the anticipation of a spot Bitcoin ETF approval. Year to date, the cryptocurrency has surged by over 170%, outperforming traditional assets such as gold, the US dollar, and the S&P 500 by a significant margin.\n\nAdding depth to the argument on Bitcoin’s potential surge, indicators such as the Puell Multiple and the MVRV Z-score indicate potential upside. The Puell Multiple, standing at 1.53, suggests room for growth, especially after Bitcoin’s upcoming reward halving in March 2024. The MVRV Z-score of 1.6 signals that Bitcoin is not overvalued, supporting a continued rally into the next year.\n\nIn the short term, if Bitcoin can maintain its position above the $40,000 support level, a bullish run is anticipated to persist, with a strong likelihood of testing the $47,000 to $50,000 range."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxPeVBQbktmWWdFS2d1NHlrOXNSQ2k2aVA5MXlsYi05S2taMFVycVppTGZJYThtbURuMERzYVh3cGRlN3JvV3dzM1FfcWZ2MXZ1UVZiMHNwME14RjJPdlVTYjhvaG1UMDlwbm95dExnMEJfeDJrNlYwMTR1eEFxWmNZTDhR0gGHAUFVX3lxTFBrWjdEZkdZUmpSdW10RzJTSDNkb0twMWltU0NWZ0hwMzJXcHFaYUdBUXV4MklpLURRbU1fM0FsVWpzVV9JdmJjODhBa1lUNU5CcXBnbkZqZkdkMFV1RnJ4SEUxMXFldWxQY0NYaHlNX09zd1B6c3VXSnk1UzVNQzBnOW1Oa2NBcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "Top 10 Altcoins To Look Out For in 2024 - TechRound",
        "content": "0 shares Share\n\nTweet\n\nPin\n\nLinkedIn\n\n—TechRound does not recommend or endorse any financial, investment or gambling practices. All articles are entirely informational—\n\nStepping into 2024, the dynamic world of cryptocurrencies continues to evolve, presenting a variety of altcoins that hold promise beyond the dominant Bitcoin. These digital assets, each with unique functionalities and potential use cases, offer a spectrum of opportunities for those interested in the crypto market. Here are ten altcoins that merit attention in 2024, each offering distinct features and developments that could shape their trajectory in the ever-changing landscape of cryptocurrency.\n\nEthereum (ETH):\n\nEthereum continues to be a central figure in the crypto world, primarily due to its platform’s ability to host decentralised applications and smart contracts. Its transition to Ethereum 2.0, aiming for increased efficiency and scalability, could further solidify its position. There are a variety of ways in which to store your Ethereum, including using an Ethereum wallet. Ethereum’s potential in various sectors, from finance to gaming, makes it a key altcoin to watch.\n\nCardano (ADA):\n\nCardano is recognised for its scientific approach and strong focus on sustainability and scalability. Its proof-of-stake mechanism positions it as an energy-efficient alternative to traditional cryptocurrencies. With ongoing developments aimed at enhancing its ecosystem, Cardano could see increased adoption and utility.\n\nXRP (XRP):\n\nXRP stands out for its fast and cost-effective cross-border transaction capabilities. Its backing by Ripple Labs and recent legal victories add to its credibility. XRP’s growing adoption in the payment processing sector makes it a noteworthy contender.\n\nBinance Coin (BNB):\n\nAs the native token of one of the world’s largest cryptocurrency exchanges, Binance Coin has a vast range of applications, from trading fee discounts to payment processing. Its continuous burning mechanism, which reduces supply and potentially increases value, makes BNB an interesting altcoin.\n\nSolana (SOL):\n\nKnown for its high throughput and low transaction costs, Solana offers an efficient platform for decentralised applications. Its unique hybrid consensus mechanism contributes to its scalability, making it an attractive platform for developers and investors alike.\n\nDogecoin (DOGE):\n\nInitially started as a meme, Dogecoin has garnered a massive community and notable attention from influential figures. Its growing use in transactions and payments, coupled with its cultural impact, keeps DOGE in the spotlight.\n\nAkash Network (AKT):\n\nAs AI continues to influence the crypto narrative, Akash Network’s focus on decentralised cloud computing aligns with current tech trends. Its substantial growth in 2023 positions AKT as a potential leader in the AI-driven crypto space.\n\nRender (RNDR):\n\nRender’s role in the emerging field of decentralised graphics rendering, integral to AI and virtual reality applications, marks it as an innovative player in the altcoin market. Its impressive performance in 2023 suggests a bright future.\n\nImmutable X (IMX):\n\nWith its focus on NFTs and blockchain gaming, Immutable X taps into the burgeoning GameFi sector. Its solution for scalable and gas-free transactions on Ethereum makes IMX a key asset in the evolving gaming and digital collectibles space.\n\nRonin (RON):\n\nAs the blockchain behind the popular game Axie Infinity, Ronin’s success in the GameFi arena is notable. Its ability to handle high transaction volumes at lower costs positions it as a promising platform for blockchain gaming.\n\nCrypto expert Michaël van de Poppe explained in a tweet that understanding market trends is crucial for crypto enthusiasts. He emphasises the need for critical thinking in investment choices, especially in a market driven by hype and sentiment cycles. These altcoins are diverse and innovative directions the market could take in 2024. However, as with any investment, it’s essential to conduct thorough research and consider market risks before making decisions.\n\n—TechRound does not recommend or endorse any financial, investment or gambling practices. All articles are entirely informational—"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTFBhLWZNLU9vRlhLbHJfYXFlNl9HdVZiZWU3elZjUzlkU0t5WFBRX1d0U215T09taUs4YWs1U21pWW1pbjhEYnVtZFZiYW5zRXJyVGpacVZSOHhlYUxudV82MkQxNjktZ2FxSUI0QzNwZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "USDT on Tron Network Now Available at GCrypto - BitPinas",
        "content": "GCrypto, a cryptocurrency platform embedded within the GCash app, recently announced the addition of another cryptocurrency to its roster to start 2024 with new digital assets. Tron network’s Tether (USDT)is now available for purchase, sale, and trading on the crypto platform, bringing the total number of available tokens to 27.\n\nUnderstanding USDT\n\nTether (USDT) is stablecoin, a cryptocurrency that is pegged to the value of a fiat currency, in this case, the United States dollar (USD). Tether is designed to maintain a 1:1 ratio with the USD, meaning that one USDT token is intended to be equivalent to one USD. It is used as a medium of exchange and a store of value in the cryptocurrency market.\n\nThe stablecoin is issued by the company Tether Limited and operates on various blockchain networks, including Ethereum (as an ERC-20 token), Tron (as a TRC-20 token), and others. According to the company, the stability of USDT is maintained through Tether Limited’s backing by equivalent reserves in U.S. dollars.\n\nLast year, the stablecoin’s market share surged by 54%. This rise is attributed to challenges faced by its competitor BUSD, with issuer Paxos discontinuing stablecoin issuance under the New York Department of Financial Services’ directive.\n\nEthereum USDT vs. Tron USDT\n\nThe primary distinction between Tether USDT on Ethereum and TRON is the blockchain network on which they are built. Tether USDT on Ethereum is an ERC-20 token, whereas Tether USDT on TRON is a TRC-20 token. The address format of these tokens differs, with ERC-20 tokens identified by their Ethereum address, which begins with “0x”, and TRC-20 tokens using Tron addresses, which typically begin with “T”.\n\nUSDT Price to PHP\n\nCurrent Cryptocurrency Selection on GCrypto\n\nBitcoin (BTC)\n\nEthereum (ETH)\n\nEthereum Tether (USDT)\n\nTron Tether (USDT)\n\nUSD Coin (USDC)\n\nUniswap (UNI)\n\nChainlink (LINK)\n\nAave (AAVE)\n\nBasic Attention Token (BAT)\n\nThe Graph Token (GRT)\n\nEnjin (ENJ)\n\nLitecoin (LTC)\n\nBitcoin Cash (BCH)\n\nAvalanche (AVAX)\n\nPolygon (MATIC)\n\nPolkadot (DOT)\n\nAxie Infinity Shards (AXS)\n\nSmooth Love Potion (SLP)\n\nCardano (ADA)\n\nSolana (SOL)\n\nBinance Coin (BNB)\n\nStellar (XLM)\n\nSushiSwap (SUSHI)\n\nRipple (XRP)\n\nPaxos Gold (PAXG)\n\nShiba Inu (SHIB)\n\nApeCoin (APE)\n\nHow to Trade on GCrypto:\n\nAccess GCrypto through the GCash app. Ensure your GCrypto wallet is funded, with seamless top-ups available via GCash. Choose your desired cryptocurrency. Opt for either buying or selling. Enter the amount in PHP or cryptocurrency. Review and confirm the transaction details.\n\nGCrypto Crypto Additions in 2023:\n\nAdvertisement\n\n\n\n(Read: Beginners Guide to GCrypto | How to Buy & Sell Crypto on GCash)\n\nThis article is published on BitPinas: GCrypto Expands Offerings with the Inclusion of Tron’s USDT\n\nDisclaimer:"
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiZEFVX3lxTFBrRXQxaHdxLTIzRHRMSFBWZlMteko5a0RQcE9zUlpwX3Bha084N292OVRUcUpBSFVOZnlhTFB4NEMyVmt5OVlmdDVpY1pLOXNIZklKQ0RHM2prMkRlTUdONHZoQUnSAWpBVV95cUxPRzA4TkdBa19mTE1MRGV4RnpWM1Fnbl9GYlVneEVLVjBPc2xfQW00eTlLSkFRQkdvX1VoLVpvTEwtRkdTNUFXQkQwbnRobFctR3lyZmxYSXRRS3RiRnQ0eTdsWG9jbDlpaG5R?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "Solana Beats Ethereum in 2023 — What Went Wrong With ETH Army - CoinChapter",
        "content": "Solana beats Ethereum in 2023\n\nNEW DELHI (CoinChapter.com) — Solana (SOL) investment products beat Ethereum (ETH) in 2023, according to the CoinShares digital asset funds flow report. The blockchain platform might continue outperforming Ethereum as L2 blockchains continue taking center stage.\n\nThe CoinShares report noted that Bitcoin (BTC) continued to be the favorite of investors, likely due to the spot ETF hype. BTC investment products attracted nearly $2 billion in inflows in 2023.\n\nSolana beats Ethereum in 2023. Source: CoinShares\n\nSurprisingly, Solana came in second with $167 million in inflows in 2023, while Etheruem investment products only saw $78 million in inflows, about 53% less than Solana.\n\nA few challenges in 2023 helped Solana outperform Ethereum as traders’ favorite. The transition to the Proof-of-Stake (PoS) model introduced new concerns regarding centralization and consensus mechanism complexity.\n\nThe new issues added to the challenges Ethereum was already facing, such as privacy and Layer-1 scalability. Furthermore, the emergence of L2 blockchains with faster transaction processing times and lower gas fees also cut into Ethereum’s user base.\n\nAdditionally, Ethereum’s dominance in the NFT sector declined. Once a favorite of NFT traders, Ethereum experienced a drastic decline in mintings and trading volumes. Ethereum-based NFT trading volume declined by nearly 59% in 2023.\n\nThe trend suggested a loss of investor interest, exacerbated by rising competition from other blockchains.\n\nWhat Went Right For Solana\n\n2023 was a difficult year for Solana, too, thanks to its association with the doomed crypto exchange FTX. However, the blockchain platform continued to build partnerships and expand its ecosystem. The growing interest in the DeFi sector also helped Solana sideline Ethereum.\n\nThe team at Solana has made expansive plans for 2024, with DeFi being a key focus point. Platforms like Orca and Raydium would likely lead the way for Solana’s DeFi expansion plans. The projects focus on yield farming and liquidity provision, making the DeFi sector more accessible to retail traders.\n\nSolana NFTs could outperform Etheruem NFTs in trading volume in 2023.\n\nMoreover, market participants speculate that Solana NFTs might sideline Ethereum NFTs in 2024. One reason behind the speculation is that Solana NFTs are cheaper to trade than those on Ethereum, which could attract new market entrants.\n\nSolana’s TVL also reversed its decline as a result of an increase in deposits and usage of its DApps. It seems likely that L2 blockchains and Solana would likely continue sidelining Ethereum in 2024.\n\nSOL Bulls Defend EMA Support\n\nMeanwhile, the SOL price is currently consolidating above the 20-day EMA (red wave) dynamic support. Despite the bearish pressure, Solana’s price spiked 5.5% to reach a daily high near $102 before retreating.\n\nSOLUSD daily price chart with RSI. Source: Tradingview.com\n\nIf the sell-off continues, the SOL price might drop to the 50-day EMA (purple wave) support near $83. Breaching the immediate support could see Solana price test the 100-day EMA (blue wave) support near $64.\n\nConversely, a rally from here would see the SOL price break above $110 before targeting the resistance near $128.\n\nThe RSI for SOL remained neutral, clocking a score of 56.01 on the daily charts."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxObnkyM21McFdoWE0xUmV0R2dyckg4NkEzWk1XODRMUjlEVEU4ZXJLU1J3VmFkUDBSSGd6anNTWWxoVWZvbUFjbTlta1pxaTNsbW5kTnJFWFNpT3AxVGl5TmxsbW56Y1BFWm1JTFMxX1VKQ3ktUVdmT0dpRE11dWJqSWR1VDc3Z2dIeVZvSzduNzU4bVhZMF93MFZDRlM0UkQ3c1BVR2M5R1VEMGNWWFHSAbMBQVVfeXFMTlBaUm5LOVdhR3lxQ0cwUHNuMnM4SllVbkh4Q1dRY2xVZl9KYzkzV2pzdG15c04xYzJDeU0tOVU2b1d2RGF2NHFYYnBkS0hXd1ZnMFRfVTlIX1FfdC0tSnpJU0JPWkZvbUZnczlXRFUtMndBSW1sMlVWVVRKS0RBblRjR2kxZ1lkOHowSjlERHEzbXZrSEo1ZHFjOU5ld0hVaG5QSGd4Z3k3bGJxOE1qWjV3c3c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jan 2024 08:00:00 GMT",
        "title": "Cardano Surges Nearly 250% In Development Activity, Whale Buying Appetite – Details - NewsBTC",
        "content": "According to the latest findings from CryptoDiffer, Cardano (ADA) has significantly outpaced Ethereum (ETH) in terms of average daily developer activity on GitHub over the past month.\n\nThe data indicates that Cardano has surged ahead with a remarkable 245% lead over Ethereum in this crucial metric. The average daily GitHub commit size for Cardano stands at nearly 450, showcasing a robust and active development environment that is setting a new standard in the blockchain space.\n\nRelated Reading\n\nCardano Surges, Dominates GitHub Developer Activity\n\nThis notable lead by Cardano in developer activity underscores the project’s commitment to ongoing enhancements and innovation within its ecosystem. GitHub, as a collaborative platform for developers, is a crucial indicator of a blockchain project’s vitality and progress.\n\nCardano’s substantial lead in this aspect not only signifies the current momentum in its development efforts but also reflects a dedicated community and a forward-looking approach to blockchain technology.\n\nIn contrast, Ethereum, while maintaining a solid presence on GitHub with a daily average commit size of 183, now faces the challenge of catching up with the accelerated pace set by Cardano.\n\nSource: Santiment\n\nThe data suggests that Cardano has positioned itself as a frontrunner in the development race, indicating a heightened focus on refining and expanding its blockchain capabilities.\n\nAnalysts believe that Cardano’s ongoing spike in development is a favorable indication of an expanding ecosystem. The project’s emphasis on enhancing interoperability and promoting collaboration through international workshops has played a significant role in establishing its prominent position in the blockchain-oriented field.\n\nIf current trends persist as anticipated, there is a likelihood that the price of Cardano will experience an upward trajectory in the upcoming days. This optimistic outlook is substantiated by the observed accumulation of the token by significant market participants, commonly referred to as whales, over the past two weeks.\n\nADA market cap currently at $18.446 billion. Chart: TradingView.com\n\nMeanwhile, analyzing data from Santiment, NewsBTC conducted an assessment of the ADA holder addresses and observed a noteworthy increase in the holdings of the 1 million to 10 million ADA cohort.\n\nSpecifically, on December 20th, the supply held by this cohort stood at 16%. However, as of the latest available data, that percentage has seen a discernible rise, reaching 16.36%.\n\nSource: Santiment\n\nWhale Accumulation: ADA’s Rising Investor Confidence\n\nThe augmentation in ADA holdings within this particular cohort suggests a strategic accumulation of the cryptocurrency by influential market players.\n\nWhales, who typically control substantial amounts of a given asset, are often considered key indicators of market sentiment and can influence price movements. The observed increase in ADA holdings by this cohort implies a growing interest and confidence in Cardano among larger investors.\n\nRelated Reading\n\nMaker Market Heats Up: Over 600 Addresses Complete MKR Trades In Single Day 8 months ago\n\nThe performance of Cardano in 2024 is characterized by a combination of hope and prudence. The ADA coin has shown significant increases in trading volume, reflecting robust investor enthusiasm and market participation. The increase in trade volume indicates a rising belief in the long-term prospects of Cardano, fueled by ongoing development and support from the community.\n\nFeatured image from Freepik"
    }
]