[
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxNOGNQZG11bDJIamNqNndpeXM4VG04dXpMMWxxVkJ2ZjFoMWt0ZjVNN29LZlh3dk9YODV3aWVyR28xTUNQNG5JS2JmZHhENG5rdFNCanJ4VnMzOWhxa3NrNzVuYm1Ob0Z2SEtOeUtSYVdXNXVWajZIZWg3UzNoeWFCeWUxMXdoeWZiMmYyQzRxWWx6UURXZm1IekFTUE8wbWloYjhYZkNwSVVqT0JBZHpjS2NNdGZWS2ZDekF0X3hvemzSAcYBQVVfeXFMTUhWcnhTOElTTzdyM0xOYThxYzFreDUtSFp5QlFIbHVFVnNHRjJ2SllJclM3R1JjVHZ2WkxNMUEzajJYamJsOGsyMWFxUVNZMlpJMGhfaHpVMDY4OEhEZDh6WUFYWnNqTVlpZkJMQW5YOGoySXJLZlQ5NUhQVlBLNldfNHpKdU96ejBTeXA3aFVLWUpUNm00Wk5nQTdVOWp3V2tRaVdKWVFVMVNsRXdQNVRzd3RXMER4NXpFaUdCYUUyLVFjMWhR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Apr 2024 07:00:00 GMT",
        "title": "VanEck CEO Says Transaction Fee Is Bigger Story Than Bitcoin or Ethereum ETFs - CoinDesk",
        "content": "With new solutions for lower and much more predictable transaction fees, developers can now build applications that are much more useful, which Jan Van Eck predicts will be more prominent going forward. \"The most interesting thing happening in crypto to me right now is that you have databases that can scale, that can take a lot of users of high uptime and now have predictable costs. And so real stuff can be built on these databases now,\" he said. \"We're going to see that in the next couple of years.\""
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE8zNU5FdXZ0SWJ3UEdIR0dRV0lYczJybHJpLThyOFpBQkRKbjlwbV9yd20wYVBXdGxaWWdBcTkzNlZibnFELW4yNzFMeHJjRFU3dVh6X2Mwd2lXZ0lGeGVHOXJkakhPWXVBYTRtTWxkcDRRZkk4QUhF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Apr 2024 07:00:00 GMT",
        "title": "Restaking protocol EigenLayer heads to Ethereum mainnet - Blockworks",
        "content": "EigenLayer, the highly-anticipated Ethereum restaking protocol that has attracted billions of dollars worth of customer deposits, went to mainnet Tuesday afternoon.\n\nEigenLayer’s data availability solution, named EigenDA, also went live as an actively validated service (AVS) built on top of EigenLayer.\n\nThe launch came with training wheels of sorts, however, as critical components of EigenLayer are not set to go live until later this year.\n\nEthereum is secured by ether (ETH) that is staked, or pledged to earn yield in return for accurately verifying transactions. EigenLayer takes this a step further with restaking, which allows staked ETH be restaked and used to secure and run AVSs, which are various blockchain-based platforms built on EigenLayer.\n\nRead more: Restaking platform EigenLayer ‘flips’ Aave in TVL\n\nWith the mainnet launch, restakers can now delegate their restaked balance to EigenLayer operators, who can then run AVSs.\n\nEigenLayer’s total value locked (TVL) has raced above $13 billion in the past few months, making it the second-largest DeFi protocol according to DeFiLlama. EigenLayer’s offering of points for depositors, which some speculate will determine allocation in a future token, played a major part in the rapid growth.\n\nIt has also benefited from the popularity of liquid restaking tokens that restake deposits and issue liquid tokens in return, similarly to how Lido’s stETH works.\n\nRead more: DeFi ‘points’ farming has reshaped the crypto investment landscape\n\nSome have expressed concerns over potential risks that could stem from restaking, which until now was a totally unproven model for Ethereum security.\n\nAny risk that EigenLayer could create “feels very systemic,” Sebastian Higgs, chief operating officer of Cordial Systems, told Blockworks prior to the mainnet launch.\n\n“If there is an issue, the knock-on impact could be far reaching and so that’s why I’m proceeding very cautiously and I still have more questions than answers at this point,” said Higgs.\n\nWhatever those risks may be, they aren’t likely to surface quite yet. In an X thread announcing its mainnet, EigenLayer said it would allow its marketplace to “develop and stabilize” before introducing in-protocol payments and slashing later this year. In this case, slashing refers to an EigenLayer operator being financially punished for not adhering to rules set by an AVS.\n\nIf payments are enabled before slashing, operators and liquid restaking tokens would likely support every AVS, Ian Unsworth, co-founder of Kairos Research, told Blockworks. “[B]ut once slashing gets implemented, we will see a ‘de-leveraging’ so to speak, as the stake gets re-delegated to reflect the actual risk.”\n\nThe mainnet launch means some large venture bets will start to play out. A16z invested $100 million into Eigen Labs in February, adding to the $50 million it raised in early 2023. Multiple recently-funded startups are also teed up to become AVSs, including shared sequencer marketplace Espresso and restaked rollup provider AltLayer.\n\nRead more: Espresso lands $28M to become marketplace for shared sequencing\n\nElsewhere, investors have seemingly taken a liking to liquid restaking projects like ether.fi, which announced its $23 million Series A in February.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxPaEtaNmJLaDZBN2hNOWNNTTRVRm1XTHJTdmE4bFJFTXRBYWRIZHBuRmZVWHZKOVlQTDQ5N0V5Wm9ldzc2VkRRR1gxVUVMV3Y5V0E4RGFJWlNQZ2tSZjVkeHAzcFJnX0FDbnRwWmhHQkFSUnZzOXpNQUEzVGpZa21xMUdkOFBNcE5tZy14VXYtZGgyRWVB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Apr 2024 07:00:00 GMT",
        "title": "Why Ethereum, Bitcoin, and Dogecoin Rallied Today - The Motley Fool",
        "content": "Major cryptocurrencies rallied to new highs thanks to multiple tailwinds.\n\nSeveral major cryptocurrencies started the week on a high note today amid a confluence of positive catalysts, including potential short squeezes, technical trading tailwinds, and -- perhaps most surprising -- geopolitical tailwinds from leading Chinese money management firms.\n\nWhen all was said and done, as of the close of Monday's regular session, the price of Ethereum (ETH -1.29%) was up 9.1%, Bitcoin (BTC -1.73%) had rallied 3.8%, and Dogecoin (DOGE -3.75%) gained a little over 2%.\n\nOn a possible crypto short squeeze, technical tailwinds\n\nAccording to Coinglass data this morning, the digital asset market has seen more than $176 million in liquidations over the past 24 hours, the vast majority of which (around $124 million, or 72%) came from liquidations of open short positions.\n\nAs the price of major cryptocurrencies has rallied in recent weeks -- spurred by a combination of factors, including strong inflows into Bitcoin ETFs, an upcoming Bitcoin halving event, and expectations for the possible approval for the first spot Ethereum exchange-traded funds (ETFs) -- it appears that short-sellers are effectively being forced to close their bearish positions. The resulting surge in buying demand can cause a so-called short squeeze, sending digital asset prices even higher in the process.\n\nMeanwhile, technical trading patterns may also be playing a role. According to the widely followed Bitcoin analyst TechDev on social media platform X, the price of Bitcoin appears to be consolidating above key technical levels and trading averages that have historically preceded significant rallies for the world's most prominent cryptocurrency.\n\nIs China entering the Bitcoin ETF market?\n\nIf that wasn't enough, Chinese financial news site Securities Times reported on Monday that multiple China-based financial giants, including Harvest Fund and Southern Fund, have submitted applications through Hong Kong subsidiaries for their own spot Bitcoin ETFs. Those applications are currently awaiting regulatory approval.\n\nThis news is particularly significant, given China's previous public hostility against Bitcoin. In 2021, China's top regulators even banned crypto trading and mining, sending the price of Bitcoin plunging at the time. It became evident in recent years, however, that China's ban on crypto wasn't absolute, and crypto trading and mining has reportedly continued to thrive in the country. If China is indeed softening its stance, it would serve as only the latest significant validation for the global adoption of Bitcoin and other cryptocurrencies.\n\nThe U.S. Securities and Exchange Commission (SEC) only approved the world's first 13 Bitcoin ETFs in January 2024. The historic approvals served as arguably the most prominent validation yet of cryptocurrencies as a legitimate investment asset class. Because ETFs can be bought and sold throughout the normal trading day via nearly any online brokerage -- in contrast to requiring investors to set up separate crypto trading accounts with a crypto-specific firm -- they're a much more accessible investment medium for anyone considering making cryptocurrencies a meaningful part of their portfolio.\n\nBitcoin ETFs have experienced enormous inflows since then; late last month, for instance, the ARK 21 Shares Bitcoin ETF (NYSEMKT: ARKB) registered net inflows of more than $200 million, becoming the third Bitcoin ETF in the U.S. to cross the $200 million mark this year.\n\nFor perspective, China's Harvest Fund and Southern Fund manage over $230 billion and $280 billion in total assets, respectively. So, if their Bitcoin ETF applications pass regulatory muster through their Hong Kong subsidiaries, and the mainland Chinese government continues to opt for a more cautious approach with indirect approval, it could signal a massive positive shift toward more pervasive crypto adoption over the long term from the world's second-largest economy.\n\nThat certainly doesn't guarantee that Bitcoin, Ethereum, and Dogecoin will continue this incredible rally indefinitely. But as cryptocurrencies, in general, continue to enjoy greater adoption on a global scale, it's hardly surprising to see the prices of the most prominent digital assets continuing to reach new highs."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxQdEx5MWtCblFOYzBXT3dGeDlITUJtZGF4X3BpaVBITVlHT09ZSnpMaS1zRTEtdUNkXzlxWXppX1U0b2VNbF93RVZvcm5pZmczS1ZBcHVnb2xTTW9ScHU2VHVRVlJvVnhwUkJoMW85eTEyempUcnU4WGF2YmNfa0lZdkxKMDYwazjSAY8BQVVfeXFMT2ppZkZEamctQXFFRVpadTNvUFlvamdHc2loOHdQVEE0UWpPUVU2bXBSZTJ5WlFHSUxERThEU0tGRndVZHV5ODJKZnBrRzVCc0FGM1Y2bVotUDgxTzhSTmx6cjFmVXY3TW4xajRGWThfMHA5ZDJOQW1NMUpVU3VfMFhHVlAxRE94cndjdWdvSVU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Apr 2024 07:00:00 GMT",
        "title": "What Is Monad? The Ethereum, Solana Rival Just Raised $225 Million - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIn 2024’s largest crypto raise so far, Monad Labs, the firm behind the upstart layer-1 network Monad, secured a whopping $225 million in funding on Monday from a round led by crypto venture juggernaut Paradigm.\n\nThe raise, which was also supported by crypto VC Electric Capital and the tech investment firm Greenoaks, constitutes a significant show of faith by crypto mainstays that Monad—which has yet to launch—will become a speedy, affordable, and dependable decentralized finance (DeFi) alternative to both the Ethereum ecosystem and layer-1 networks like Solana.\n\nFounded in 2022 by Jump Crypto alum Keone Hon, Monad is an Ethereum Virtual Machine (EVM)-compatible network that is seeking to fill what is sees as a gap in the current crypto landscape: A blockchain able to easily interact with the Ethereum ecosystem, that is distinctly more capable of accommodating extremely high traffic while remaining speedy, cheap, and secure.\n\nThere are plenty of blockchains out there that would argue they already fit that criteria, to be sure. Following the landmark Dencun upgrade last month, Ethereum layer-2 scaling networks like Arbitrum, Optimism, and Base have seen transaction costs plummet to near-zero. If any of those networks were to see massive upticks in usage, however, their gas fees would almost certainly spike.\n\nAD\n\nAD\n\nNon-Ethereum layer-1 networks, particularly Solana, have ballooned in popularity in recent months—particularly for DeFi users—due to their speed and lower fees. But Solana has also suffered repeated outages as it attempts to scale to become a linchpin of the crypto ecosystem.\n\nBy offering full capability with EVM—the software that powers Ethereum, and all networks built on top of it—Monad appears to be tapping into the dominant influence Ethereum has over crypto users and developers, while simultaneously attempting to build a more streamlined version of the network from the ground up.\n\nIt also looks like a play for attracting top-level developers. According to a January report from Electric Capital, some 90% of crypto developers working on multiple chains work with EVM.\n\nOther EVM-compatible layer-one networks are already out there, most notably Avalanche and BNB Chain, the latter of which was created by Binance. But Monad Labs’ fundraise today marks the flashiest entry into the crowded blockchain ecosystem in some time—certainly since the crypto crash of 2022.\n\nAD\n\nAD\n\n“We are excited about Monad because it solves one of the critical bottlenecks in scalability for the Ethereum ecosystem: the Ethereum Virtual Machine,” Electric Capital Managing Partner Avichal Garg told Decrypt. “Monad’s parallelized EVM can unlock a 100x improvement in throughput in the EVM ecosystem and make consumer-grade, decentralized applications possible.”\n\nPrior to today’s news, Monad Labs previously raised a $19 million seed funding round in early 2023, led by Dragonfly Capital.\n\nEdited by Andrew Hayward"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE9KaExfMmk4YmsxVGFxcXo4UmNCbUVGMXkydmV3THZtd1RBYUVJN2ZFd3BQNDhRdlVWaG5ZZTlac0J2U1AtdUYxYnRpUkt3SjhyWlBZc2pIMVZZenNpTGtPSDJibEdWaF9XbVJpY2RJaVQxZVBJNmFScnJLRdIBgwFBVV95cUxOUjU0dlhTWW45MU1WNS1NNDM2ZzZKcXNmMENyYzdGWWNTR3RRT253NXl6aGF2ZURqNkNxTkFFWGwwMVpuWl80dG44akZCREhwazFMejFtRkJjZTI4QXBNVUMycUlVRkdDZHhhM2IwVzBwWURSQWV3VzdTNnhNV3pGanRtaw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Apr 2024 07:00:00 GMT",
        "title": "Solana Dominates Ethereum in Stablecoin Payment Volume: Bernstein - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nSolana is winning the payments race, global investment firm AllianceBernstein declared today.\n\nFirm analysts Gautam Chhugani and Mahika Sapra said in a Tuesday note that stablecoin use was growing again during the current bull market.\n\nSolana, the blockchain behind the fifth-biggest cryptocurrency, SOL, is leading the charge among stablecoins that are being used for cross-border payments.\n\nAD\n\nAD\n\n“The big change this cycle has been the dominant market share of Solana (43% highest share) in value of stablecoins transferred vs. prior cycle market leader Ethereum,” the report read.\n\nData from crypto data platform Artemis shows that as of yesterday, Solana’s market share of stablecoins transferred stood at $63.6 billion of the $116.7 billion total. Ethereum came in second with $26.6 billion.\n\nIt’s worth noting that Ethereum still wins in terms of actual stablecoins on its blockchain by market cap—but a lot of that capital is not being used.\n\nThe Bernstein report added that despite Solana’s growth and overtaking Ethereum’s market share for value transferred, the project still has a long way to go—especially when it comes to scalability.\n\n“Further, scalability requirement for consumer payments would require 15-20 fold growth from here,” the Bernstein analysts noted.\n\nAD\n\nAD\n\nDespite Solana being a fast blockchain, it has struggled with congestion issues as of late. Increasing user activity is putting strain on the network, and stakeholders are pondering on what to do to improve its usability.\n\nStablecoins are used in the crypto ecosystem to move around funds without the risk of them suddenly dropping or going up in value—like assets Bitcoin and Ethereum do. Such coins and tokens are backed by something stable like the U.S. dollar or other fiat currencies.\n\nThey run on a number of different blockchains: Ethereum, Tron, and Solana, being examples.\n\nSolana became hot again last year after payments giant Visa said it would use the blockchain’s tech to speed up credit card payments. Then, Solana’s payment protocol Solana Pay integrated with the e-commerce platform Shopify, allowing merchants to accept stablecoin USDC via the blockchain.\n\nThis is likely why Solana is taking up so much of the market share of stablecoins moving around the crypto ecosystem compared to Ethereum.\n\nBut despite being used by the big names, the blockchain still hasn’t broken into more mainstream consumer or B2B payments, the analysts noted.\n\nSome in the industry expected Solana to crash and burn because it was favored by convicted crypto criminal Sam Bankman-Fried and his now-collapsed FTX empire.\n\nBut the opposite happened and its market cap grew—bringing SOL’s price with it. The price of SOL now stands at $174.52, according to CoinGecko. It is still over 33% below its November 2021 all-time high of $259.96.\n\nAD\n\nAD\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxOQmJyeS1FaTQ2TzVsQzZWcjZGVHJCZ0pJUk1sS1VLRFFXT05aWDhWZ3VMZzZUWXdoMkpWVmd2cXdOS21IQ0VSU1Z5Z1VUaHpubnFsNWJqalpVUzA3bWtxWEdzazF4UlFTallFOW1HbXA4ZnpVSFQ4QmxrVG9zMUw1NHM2OXh0WG5hTzZOYnRZTnlQOEIzQThLejEyenk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Apr 2024 07:00:00 GMT",
        "title": "ZkLink looks to solve Ethereum’s fragmented liquidity with a layer 3 — but there are risks - DLNews",
        "content": "Layer 2 blockchains have helped scale Ethereum, bringing transaction costs down to cents compared to those on the main Ethereum network.\n\nBut despite their successes, layer 2s have created a new problem called liquidity fragmentation — the splitting up of once-concentrated capital across multiple separate blockchains.\n\nLiquidity fragmentation poses several problems. Smaller, unconnected pools of capital spurs volatility and means users get worse prices on their trades.\n\nZkLink is one project working to solve liquidity fragmentation on Ethereum.\n\nIt has created a so-called layer 3 network — zkLink Nova — which is connected to eight Ethereum layer 2s. zkLink has launched MergeToken on Nova, which is a smart contract that consolidates assets — bridged from layer 2s to Nova and of equivalent value — into a single token.\n\n“We’re setting the precedent for a practice that we hope more projects will adopt to make the web3 trading environment friendlier,” said Vince Yang, CEO and co-founder of zkLink.\n\nBefore layer 2s, as well as other blockchains like Solana, Ethereum hosted the lion’s share of onchain activity, pushing the network to $102 billion worth of DeFi deposits in 2021.\n\nEthereum liquidity is spread across multiple layer 2 blockchains.\n\nBut in recent years, onchain activity is increasingly moving to layer 2s — separate networks built on top of Ethereum that offer faster and cheaper transactions. Much of Ethereum’s vast capital has jumped ship, flowing to layer 2s like Arbitrum, Optimism and Base, among others.\n\nJoin the community to get our latest stories and updates\n\nMergeToken will initially merge versions of stablecoins USDC, USDT and DAI, followed by Wrapped Bitcoin and Ethereum liquid staking tokens in the future.\n\nThe hope is that by reunifying Ethereum’s scattered liquidity on its layer 3, zkLink can increase capital efficiency within the Ethereum ecosystem and provide a better user experience and trade prices.\n\nBut there are also risks.\n\nIn order to make zkLink’s plan work, users must bridge their assets from other layer 2 blockchains to Nova, then lock them up in an upgradable smart contract controlled by a multi-signature wallet — a crypto wallet that requires multiple password-like private keys to send transactions.\n\nThis system creates a big pool of assets that can become a lucrative target for hackers. In 2022, the Ronin crypto bridge, which also kept assets in a multi-signature wallet, was hacked for $624 million after the private keys that controlled it were compromised.\n\nAddressing security concerns\n\nYang told DL News there are 3 external vulnerabilities zkLink attempts to protect its users from: bridge contract risk, MergeToken smart contract risk and governance risk.\n\nBoth the bridge contract and the MergeToken contract lock up assets in single places — like bank vaults filled with gold bars.\n\nAnd like such bank vaults, which before the advent of digital money were all too often a target of thieves, these smart contracts that hold millions of dollars worth of crypto have also become lucrative targets.\n\nHackers have previously used social engineering techniques to steal the private keys that control smart contracts, while others have used code exploits to trick contracts into giving them their contents.\n\nYang said zkLink’s contracts have been audited by its security partners, ABDK and Secure3.\n\nHe also said that the multi-signature wallet that controls the MergeToken smart contract is tied to a governance committee made up of multiple projects separate from zkLink.\n\nA governance committee made up of 12 projects and institutions, including market maker Wintermute and venture capital firm Ascensive Assets, will oversee all current and future merger proposals.\n\nZkLink said upgrades to the MergeToken smart contract require a two-thirds vote from committee members. Upgrades will also be only executed after a seven-day timelock period, giving the committee and users time to review the changes to the contracts.\n\nFixing liquidity fragmentation\n\nCertain tokens, such as Circle’s USDC stablecoin, are not always equal across different layer 2s. When a user sends USDC to Nova, it is represented as a different asset depending on which layer 2 blockchain it came from.\n\nZkLink Nova offers the same faster and cheaper transactions by using zero-knowledge proofs, the same technology that underpins layer 2s like zkSync and Starknet. But it also reunites liquidity split among several different versions of the same assets issued across the ever-growing list of layer 2s.\n\nBut the boons of reunifying liquidity are only accessible to those on Nova, Yang told DL News.\n\n“The MergeToken is a function unique to Nova and dApps built on Nova can access the aggregated liquidity pool,” he said.\n\nDeFi users will have to look to other projects, such as cross-chain bridge and messaging projects like Wormhole, Axelar and LayerZero to break down the barriers between separate blockchains once and for all.\n\nBut for now, zkLink’s offers one of the first available solutions to liquidity fragmentation that users and developers can start playing around with.\n\nUpdate, April 8: Added that upgrades to the MergeToken smart contract will only be executed after a seven-day timelock period, and clarified that zkLink’s bridge contract and MergeToken contract lock up assets in different places.\n\nTim Craig is DL News’ Edinburgh-based DeFi Correspondent. Reach out to him with tips at tim@dlnews.com."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxOX1owZFhNMkNnbVdhLTR4bkpDZDRWMWo2cjVZYTExQVhDV19kZkdUQVc0M3JWQ2FGY05jSVZtLVpIa2NwSTFPVC1iMURlV05SMjFaMzdrRkJLZ3ZSNkNnRGtXVVFZWFZLSmhPTzNUYlIwTnZ5c0x3dlR1NUV3ZV9tZEgxaVRRcVBONFRXaElYQVU0TVBGR1VScm4taF8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Apr 2024 07:00:00 GMT",
        "title": "Base TVL Hits $4 Billion as Transactions Per Second Surpass Ethereum - Unchained",
        "content": "Base is now the third-largest layer 2 network, after Arbitrum One and OP Mainnet, with $4.17 billion in Total Value Locked.\n\nBase's TVL surged over the last few weeks, driven by a high volume of transactions across decentralized exchanges.\n\nCoinbase’s layer 2 network Base has seen its Total Value Locked (TVL) blow past a new high of $4 billion, rising the ranks to become the third-largest Ethereum scaling solution after Arbitrum One and OP Mainnet.\n\nAccording to data from L2Beat, $2.7 billion of the $4.17 billion Base’s TVL has been minted natively on the blockchain, while $1.46 billion was canonically bridged and $3.64 million was natively bridged. Canonically bridged refers to assets that are locked into Base through cross-chain bridge infrastructure on Ethereum.\n\nTransactions per second (TPS) on Base also surpassed Ethereum, with Base recording an all-time high of 36 TPS compared to the 14 TPS on Ethereum, according to data from L2Beat.\n\n>3m transactions (34 TPS) on @base for the first time yesterday pic.twitter.com/dcVX5X8fTe — Jesse Pollak (jesse.xyz) 🛡️ (@jessepollak) April 5, 2024\n\nBase also surpassed other major layer 2 networks in 30-day transaction count, recording 50.5 million transactions, beating out Arbitrum One’s 40.17 million and Ethereum’s 37.87 million transactions for the period.\n\nOf course, memecoin trading has played a hand in some of this record-breaking network activity in March, with coins like Toshie, Normie, and Base God all seeing double digit rallies over the weekend.\n\nThe more significant factor for long-term network effects has been the resulting surge in trading activity across decentralized exchanges (DEXs) on Base, which surpassed $1 billion in daily trading volume last week.\n\nThe Base-native DEX Aerodrome has been one of the largest beneficiaries of this, growing its TVL by more than 380% to $580 million over the course of nine weeks.\n\nHowever, the biggest expected catalyst for Base that analysts will be watching closely is the upcoming rollout of Coinbase’s smart wallet, with the Wallet as a Service feature compatible with all EVM networks including Base.\n\nCoinbase wants to help bring the next 100 million users into Web3 with its new Wallet as a Service feature, offering a solution where users don’t have to deal directly with the complications of decentralized finance protocol infrastructure.\n\nLast week, Coinbase’s head of consumer products Max Branzburg said the firm plans to move more customer and corporate USDC balances onto Base."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxOUXowTG5vSFJFMkl2NndrWVg1V2xVXy1RY0I2NlRic2ZqMUVkZUJrY0htSklZd3dEVkFPVGdCNEFuQzhueVlHSmE0bWxhc29Ka19UNmVtV0ZIcERleVFnRHA3TjREckFaa2ZLRW5iVVNuTEFtWkMyMTJqZ3FvaG13LXRvSXR2S2tycERqVDU2MUlFUW9PY0Z2OUJWUEtOdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Apr 2024 07:00:00 GMT",
        "title": "Coinbase Ethereum Layer-2 Base Hits $4B TVL Surpasses Blast - Crypto Times",
        "content": "The Coinbase-backed Ethereum layer-2 network Base has surged past $4 billion in total value locked (TVL), marking a 13.2% increase in the past week.\n\nBase TVL Chart | Source : L2Beat\n\nL2BEAT data reveals Base’s TVL at $4.15 billion, with $1.45 billion bridged from Ethereum and $2.7 billion in native assets. Base is now the third-largest Ethereum layer 2, surpassing Blast by $1.4 billion.\n\nIn the past week, Base gained while others like Starknet and Optimism saw losses in TVL. Base’s 30-day transaction count also outpaced Ethereum and Arbitrum, hitting 50.50 million transactions.\n\nBase’s average daily transactions per second (TPS) increased by 29.7%, reaching 35.19 TPS, higher than Arbitrum and Ethereum combined. The platform’s meme token market capitalization exceeded $1.6 billion, benefiting from recent memecoin activity.\n\nHowever, Base faced challenges with an 18-fold increase in successful phishing scams, resulting in $3.35 million stolen last month.\n\nEthereum’s focus on improving layer-2 transaction data processing, like the March 13 Dencun update reducing fees, could benefit platforms like Base. Analysts predict Ethereum’s scaling ecosystem could reach a $1 trillion market capitalization by 2030, benefiting layer-2 solutions like Base."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMi3AFBVV95cUxPLWc5QWI1WkR2TFFUODQySGNFVTZXRjUzOHpMR3J0azRJTEQ5UFdiUjFwaWY2NF9aSnluRnByVlplQWREZzNMMnBjaTN5Q1BiYTNRME1OYVAwQkprTGxTZDViMWk2UjRTcWpzaDA5OVR3SmVJYTUzYWxHcnNJM0pMdmtYUUJXbUNoMUJLc1J0LVp5VHI0RnpBYzVSLW9vZ0p4Nl9JbWxyNnZiTVprblpaeXZPV3JBODdvcGNqNjJrTElUZnF1SW01OXpmS28xZThrdVBsQjQwWnVDRlg20gHiAUFVX3lxTE80X0FBR0lHbWZoOUNYZFhNZ1V0ODYydEJnZTNLbzd4QVNITDQzclM0ZzU3TzIwN1ozdU9rOHZnd3R4ZHRLX0RZNm5TSkFZSzFuWDlhbGlHc1hhejdwLWZyUkxoTVFJem5naTZheWZuX0RMMnE2UWhqdG1ZeW92RWlmNHNlbHpGUkRyOUNXQU1lUEVxdUktdlRnRmFQWU5sVGZESEdGZzNLWXRkeEpDLXgwcVp5VHZTU3lSY3hoTUxkRjRKaXE2bGNzVEx4bmhmVnNEaWNhLXNyaDJ1VzZTYWt0N2c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Apr 2024 07:00:00 GMT",
        "title": "Will Ethereum's classification as a security disrupt Web3 innovation? - The Economic Times",
        "content": "Transitioning to Proof-of-Stake\n\n\n\nChallenges and Uncertainties for Web3\n\n\n\nThe Decentralization Dilemma\n\n\n\nLooking Ahead: A Web3 Future in Question\n\n\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nBlackRock’s CEO Larry Fink has been quoted today in the media stating that even if Ethereum (ETH) is classified as a security, a spot Ethereum exchange-traded fund ( ETF ) might still be possible. The recent launch of several Bitcoin ETFs by the U.S. Securities and Exchange Commission ( SEC ) was a positive step for the crypto industry, offering investors a clearer path to participate in the virtual digital asset class. This regulatory progress has fueled optimism within the crypto space, with many anticipating a similar green light for Ethereum ETFs in the near future.The success of Bitcoin ETFs, alongside the ongoing price rally, has undeniably instilled a sense of excitement about the potential of Ethereum and the broader blockchain landscape.Amidst these, the recent media reports about SEC reportedly investigating the Ethereum Foundation, coupled with the ongoing debate about Ethereum’s native token, ether (ETH) ’s potential classification as a security, raises critical questions about the impact on Web3, the burgeoning decentralized ecosystem built on Ethereum's blockchain technology.Ethereum, conceived by the visionary Vitalik Buterin in 2013, introduced a revolutionary concept: a decentralized platform for building smart contracts and decentralized applications (dApps). Its impact has been profound, fueling the rise of DeFi (Decentralized Finance), NFTs (Non-Fungible Tokens), and a myriad of other innovations that comprise the Web3 industry.Previously Ethereum relied on a proof-of-work system to secure its network. Like in Bitcoin, in Ethereum computers competed to solve complex puzzles, with the winner earning newly minted Ethereum tokens. Every time a transaction is carried out on the Ethereum platform, one has to pay a gas fee or a transaction fee, irrespective of what the nature of that transaction might be. The gas fees previously were high, going up to $150 per transaction.To solve this problem and after years of testing to replace energy-intensive mining, Ethereum switched on its proof-of-stake mechanism in 2022. The new proof-of-stake system eliminated this competition. Instead, users \"stake\" their existing Ethereum holdings to validate transactions and earn rewards. This shift is estimated to have reduced Ethereum's energy consumption significantly. The ecosystem carried out another upgradation recently, called the Dencun upgrade, as a result of which transaction fees are expected to plummet to almost zero. Dencun achieves this by reducing rollup fees through the introduction of \"blobs,\" larger data packets that enable more efficient handling and storage of transaction-related information.Does staking constitute an investment contract, a key characteristic of a security?Since the transition from a proof-of-work to a proof-of-stake system, a debate among regulators and industry experts has sparked: could Ethereum's new model classify it as a security? The US SEC, for instance, in the past suggested this model could grant excessive control to the network's developers, potentially undermining its core tenet of decentralization.The potential classification of Ethereum as a security could have significant ramifications for the Web3 industry, raising critical questions about decentralization, regulation, and accessibility. It might lead to overly broad regulations, potentially impacting trading platforms, investor participation, and the overall market dynamics within the crypto space.Ethereum is the foundation for a vast ecosystem of decentralized applications (dApps) and Web3 projects. These applications, ranging from DeFi to NFTs rely heavily on Ethereum's Layer2 Of late, the total value locked (TVL) in DeFi ecosystem has experienced a significant resurgence, reaching a milestone of $100 billion, Ethereum leads the space with over 60% market share.A security designation for Ethereum could create regulatory hurdles for dApps built on its network, potentially stifling innovation and growth within the Web3 space.Decentralization is a core principle of Web3, aiming to create a more transparent and user-controlled internet experience. However, the SEC's potential classification of Ethereum as a security could centralize control, as exchanges may delist the asset or restrict trading for certain investors.The inherent decentralization of Ethereum, or for that matter any blockchain, presents a significant challenge to the potential enforcement of any forthcoming regulations. The ability of the SEC, or any national regulatory body, to effectively implement restrictions would be limited by the global nature of the crypto market.The ramifications extend beyond Ethereum itself, encompassing the broader crypto space. If Ethereum is classified as a security, it sets a precedent that could potentially impact other blockchains operating on similar principles.Currently, DeFi boasts 15 million daily transacting users, a number projected to surge to 100 million by 2025. The prospect of mass adoption of blockchain technology looms large, and the recent upgrades in Ethereum network were certain to incentivize developers to build even more innovative use cases. While regulations aim to protect investors, and rightly so, finding a balance between investor protection and fostering innovation will be crucial.As we confront these questions, one thing remains clear: navigating a new and innovative space like Web3 requires ongoing collaboration and a commitment to fostering responsible growth. Ethereum holds a significant place in the broader decentralized ecosystem and any such regulatory decision will have profound implications for the future of Web3 and shaping the next chapter of the digital revolution.(The author is Co-Founder, CoinDCX & Okto)(Disclaimer: Recommendations, suggestions, views, and opinions given by experts are their own. These do not represent the views of the Economic Times)"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMi5AFBVV95cUxOU3NZRFpVNjhyTDlvbFdIbV9rQjJFNzZrcGxfSlhZV3B4VnIxbG1ScU5BdXJEUTg3WE85Yl9jU2d1SlJSbnBWclJLOUtWSmVuY3VjSzRfbkk2LXZGSWROVnlwV3dLX0RCanNZTmF1eXVDYU15VUlqRWNURjh1Y2xQZl90aDZMdlhzd3hwcDdvek9abkctVHNxbFl6OGJWTUN1TVhZVkx4QVlfb3BWT21TMnk3QmFfcEdrRGJ6NndPN1ZqTUZzR09rRzg3R2sxcks4YmFoclBOdXFGN2o1ZVFGUElqclM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Apr 2024 07:00:00 GMT",
        "title": "Top 3 Price Predictions for Bitcoin (BTC), Ethereum (ETH) and O2T After Doomsday - GlobeNewswire",
        "content": "Dubai, UAE, April 09, 2024 (GLOBE NEWSWIRE) -- Following a tumultuous phase in the cryptocurrency market, known colloquially as \"Dooms Day,\" the investment community turns its gaze towards the future, seeking clarity on the recovery prospects of Bitcoin (BTC), Ethereum (ETH), and the emergent contender, Option2Trade (O2T) . This analysis endeavors to shed light on the post-crisis resilience of these tokens, delineating their potential growth paths and the unique position of Option2Trade (O2T) as a formidable participant in the cryptocurrency landscape.\n\n\n\n\n\n\n\nPost-Doomsday Recovery\n\nThe aftermath of \"Dooms Day\" has left investors and analysts alike pondering the recovery dynamics of the cryptocurrency market. In this section, we'll delve into the resilience factors inherent in Bitcoin (BTC) and Ethereum (ETH), examining how their foundational roles within the crypto ecosystem contribute to their recovery potential. Additionally, we'll explore the initial impact of the market turbulence on these stalwarts and the mechanisms by which they may regain their momentum.\n\nFuture Trajectories: BTC, ETH, and O2T\n\nLooking ahead, the trajectory of Bitcoin (BTC), Ethereum (ETH) , and Option2Trade (O2T) is of paramount interest to those navigating the post-crisis landscape. This analysis will project the future paths of Bitcoin (BTC) and Ethereum (ETH), considering their historical performance, underlying technologies, and market sentiment. Alongside, we'll introduce Option2Trade (O2T) into the equation, assessing its growth prospects in light of its innovative 'Social Trading' feature and how it stands to benefit from the shifting dynamics in the cryptocurrency market.\n\n\n\n\n\n\n\n\n\nO2T: The Dark Horse\n\nOption2Trade (O2T)'s remarkable ascent in the crypto arena positions it as the dark horse in the race towards recovery and growth. With its unique blend of AI-driven insights and community engagement, Option2Trade (O2T) not only offers a fresh perspective on crypto trading but also embodies the potential for significant market disruption. This segment will spotlight Option2Trade (O2T)’s strategic advantages, exploring how its distinct features may catalyze its rise to prominence in the aftermath of the market's \"Dooms Day.\"\n\nNavigating the New Normal\n\nAs the cryptocurrency market steadies itself in the wake of recent upheavals, the strategic positioning of Bitcoin (BTC), Ethereum (ETH) , and Option2Trade (O2T) will be critical to their success. This contemplation will extend beyond price predictions, considering the broader implications of market recovery, investor sentiment, and technological advancements. The aim is to provide a comprehensive outlook on how these tokens are poised to navigate the evolving crypto landscape.\n\n\n\n\n\n\n\n\n\nConclusion: A Triad of Potential in the Post-Crisis Era\n\nIn the post-\"Dooms Day\" era, the cryptocurrency market stands at a crossroads, with Bitcoin (BTC) and Ethereum (ETH) seeking to reaffirm their dominance, while Option2Trade (O2T) emerges as a potential game-changer. The recovery trajectories of Bitcoin (BTC) and Ethereum (ETH), coupled with Option2Trade (O2T)’s innovative approach to trading, present a triad of potential for investors looking towards the future. As we venture into this uncharted territory, the resilience, innovation, and strategic foresight embodied by these tokens will undoubtedly play a pivotal role in shaping the next chapter of the cryptocurrency saga.\n\nFor more information on the Option2Trade (O2T) (O2T) Presale:\n\n\n\nUse promo code O2TLaunch to get 15% bonus\n\nVisit Option2Trade (O2T) (O2T)\n\nJoin and become a community member:\n\n\n\nhttps://t.me/O2TOfficial\n\nhttps://twitter.com/Option2Trade (O2T)\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxQNGFzMlgtd2lYdXN6aVN4U3pqcUlYZFNrSEJXLXBmV0lwSFNWV3lTdU1LM05RaTFBLWNSYzlLUEZOMVBMMW9MWkxZUEN0S0wtZDlIa29qSWlmX2tSbVQ0QXNZWXVLUmJFZEJzVnNkY2ZaWXJyUlJLRUFJb1VsSHpJQUFJM2IzMGtRemh3YldXQkNHU1JidHE1cE1tcGxvb1o4cENr?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Apr 2024 07:00:00 GMT",
        "title": "Polygon’s AggLayer Wants to Be a Hub for Ethereum Layer 2s. Can It Succeed? - Unchained",
        "content": "Episode 630\n\nPolygon’s Agglayer aims to address the monolithic vs. modular blockchain debate with a decentralized protocol that allows chains to interact with one another.\n\nListen to the episode on Apple Podcasts, Spotify, Fountain, Overcast, Podcast Addict, Pocket Casts, Pandora, Castbox, Google Podcasts, Amazon Music, or on your favorite podcast platform.\n\nPolygon Labs CEO Marc Boiron and co-founder Brendan Farmer discussed everything about the AggLayer, a decentralized protocol built by Polygon that enables fast, secure cross-chain interactions and allows different chains to use the same native bridge. This allows users to seamlessly move assets across chains in the AggLayer ecosystem.\n\nThe AggLayer aims to unify blockspace so that it feels like a single chain, improving user experience. Boiron and Farmer also discussed the potential for Layer 2 solutions to scale Ethereum, the benefits of zero-knowledge technology, and the future of Polygon’s proof-of-stake chain.\n\nLearn more: What Are Zero-Knowledge Proofs?\n\nShow highlights:\n\nBackground of Brendan and Marc and how they joined Polygon\n\nA brief description of what Polygon is overall\n\nWhat the AggLayer is and how it aims to enable the best of monolithic and modular blockchains\n\nHow Brendan differentiates the AggLayer from its competitors, such as Optimism’s Superchain or Cosmos and why he believes that zk-technology is such a game changer\n\nHow the interoperability experience gets better in such a system, according to Marc and Brendan, and what will become possible that’s not now\n\nWhich chains can use the AggLayer and how it works to improve security across chains\n\nThe tradeoffs between the various types of zkEVM provers\n\nHow projects should decide their architecture and when it would make sense to tap the AggLayer\n\nWhy projects should build on the AggLayer, including layer 1s, according to Marc\n\nHow Layer 1s can still join the AggLayer and retain their own consensus and sovereignty\n\nWhy Polygon believes that zk-technology is the future of blockchain architecture\n\nWhy the Polgyon zkEVM suffered an outage on March 30\n\nWhether Layer 3s are needed to scale the Ethereum ecosystem\n\nWhy Brendan believes that EigenLayer is not a good fit for rollups to use\n\nThe transition of the Polygon PoS chain to become an Ethereum L2 using the AggLayer\n\nWhen EIP-4844/Dencun will go live on Polygon\n\nThank you to our sponsors!\n\nGuests:\n\nLinks\n\nAggLayer\n\nzk-Technology\n\nPolygon zkEVM\n\nLayer 3s"
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxOSzdHVjI3MmhfY0hxZTdMUFo2czBYQXV3Qlh6TTloYU9RbmljQjN4MjlPTVNvd08taTR2TjB2a2xqTVRvMUxPbEJDMlI5NF9IQkN3N0ZubWV4ZkNVMkhlaWdLX3BLbUF4RmVZcDFGV2NfOW0weDIzenF6M0VWd1VoZkJtelhmZGpoSmZ5RlhweHY1Q2R5WUtV0gGcAUFVX3lxTE1ValJFLVBhVmt3MTNDUTVvRWFFRE02cXd1cVNkRktRWjJwNi16S1JXTDJhaWdkbUlXUXh5Q2FtMXQ1NlpDWFlaWklHMXkxRmxyMFFEemtUNW16VDlkc2ZNLTVXdWhLQi1DQmhyb3ZROUtMcWJHb0hVU0lOTVFITXYta3podzFxeThiYm9VSkY0dXdVc1hSQUZvMmljUA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Apr 2024 07:00:00 GMT",
        "title": "Bitcoin on Verge of $70,000, XRP Comeback Begins, Ethereum (ETH) Support Plays Out - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nBitcoin is now close to reaching $70,000. Digital gold could be on the verge of a breakthrough. Right now, it is trading around $69,311, and many are watching to see what will happen next.\n\nThe chart shows that Bitcoin has been going up and down, without a distinctive pattern, but it is still close to the $70,000 mark. This is a very important level that could tell us if Bitcoin is going to start moving toward another ATH or keep consolidating. If Bitcoin can get past this level, it could go even higher, which would be big news for the cryptocurrency market.\n\nBut the market is giving mixed signals. This makes it hard to say for sure if Bitcoin will pass $70,000 soon. There is a chance it could go up to test this level, but it is not clear if it will be able to stay above it.\n\nFor Bitcoin to keep growing, the asset should stay at least above 50 EMA, but it is not an easy task considering questionable market inflows right now.\n\nAdvertisement\n\nIf Bitcoin can stay above these support levels and move past $70,000, it could be the start of another big increase in price.\n\nGood news for XRP\n\nAfter a tough period of time for XRP, there is some good news: XRP has moved above its 100-day exponential moving average (EMA) again.\n\nRight now, the price of XRP is at $0.5967. Breaking the 100 EMA line is important because it can be a sign that the price might start moving upward once again. If XRP can keep up this momentum and stay above the 100 EMA, the next big test will be at the 50-day EMA, which is at about $0.62. If XRP can break through this too, it might just prove that it is ready to climb toward an yearly high once again.\n\nHowever, even with this positive move, there is a chance that XRP might not keep rising. It is possible that the price will not go up much more and that this is not the start of a real comeback. To be sure that XRP is really making a comeback, we need to see if it can hold above the 100-day EMA and then break past other important prices like the 50-day EMA.\n\nInvestors and people who watch the crypto markets are going to be paying close attention to XRP. If it can stay strong and move past more resistance levels, then it could mean that XRP is making a real comeback. But if it cannot, and the price falls below the 100-day EMA again, it might suggest that XRP still has a way to go before a true recovery starts.\n\nEthereum is safe\n\nEthereum is at a key threshold. Its price is being squeezed between an upward trendline and the 50-day exponential moving average (EMA), which may lead to a big move in price soon.\n\nCurrently, Ethereum is trading around $3,391. The chart shows that the price is just above the upward trendline, which has been acting like a support, helping to stop the price from falling further. This line is moving up slowly, which could mean that the price of Ethereum might go up with it.\n\nThe 50-day EMA, right now at about $3,400, is right above the current price. This EMA often acts as resistance, which can push the price down. Ethereum is stuck between this resistance above and the support trendline below. If the price can break above the 50-day EMA, it could rise to the next resistance level around $3,545.\n\nBut if Ethereum cannot stay above the trendline, it might fall to the next support level, which is the 100-day EMA at around $3,090. If it drops below this, the price could go down to the 200-day EMA at $2,665.\n\nFor now, the market is sending mixed signals. This means that Ethereum's price could go both ways, and it is not clear which way it will go. Investors are watching closely to see if Ethereum can stay above the trendline and break past the 50-day EMA."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxOYnAyQ2k4OXJNbFhXTUV3ZUlSM1F3YUYxT055eGloMzZDYlAxRGpIaFBEVEJDUGM5QVJlQkdqSk13RGhHSFFXbzB3aUdqcDA5OUg4bDhSLU5jRDJTekhXUi1GOTlyQ2pPM1JzdGxsLUJPVFlFZkRKd1BfUklXRjd3aFZTSmxQSWtQSWdBb0NJZElWXzA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Price Sees 7% Rise As New Green Crypto Etuktuk Nears $3M - CryptoPotato",
        "content": "Amid a broader market recovery, Ethereum has shown strength, pumping over 7% today.\n\nMeanwhile, eco-friendly AI crypto eTukTuk is also outpacing the market, recently crossing the $2.8 million total raised mark.\n\nEthereum Jumps as Analysts Continued Gains\n\nEthereum is currently trading at $3.6K, up 7.6% today as it recovers from last week’s sell-off. Meanwhile, the total crypto market cap is up by 4.6%, illustrating that ETH has outperformed other cryptos.\n\nHowever, analysts are bullish on the second-largest crypto, anticipating it could continue to surge in the coming months.\n\nETH has largely been overshadowed by SOL this year, up 95%, while SOL is up 787%. However, a recent mishap on Solana due to high network activity has damaged its user experience, with many transactions failing.\n\nAs such, Ethereum’s Uniswap has overtaken Solana’s leading DEX Jupiter in 24-hour trading volume after weeks of Jupiter’s dominance.\n\nThis has impacted Solana’s price performance against Ethereum, as evident on the SOLETH price chart.\n\nSOL’s recent pullback against ETH creates a rejection of its macro resistance level, a bearish sign for SOL but bullish for ETH.\n\nProminent analyst Captain Faibik expects a bullish continuation for Ethereum. He predicts a move toward $4,800 and notes that “Ethereum hasn’t hit an all-time high yet,” a nod that Ethereum could catch up to Bitcoin, given that the market leader has already created an ATH this cycle.\n\nSimilarly, Jacob Canfield anticipates Ethereum will outpace Bitcoin on the four-hour chart.\n\n“BTC made a massive push this morning to break range high resistance plus diagonal downtrend. But the real thing to watch is ETH, as it just put in a massive reversal candle on ETHBTC,” he wrote.\n\nReed Carlson also foresees notable upside for Ethereum, noting that it currently trades at “macro range lows.”\n\nHowever, the analyst also highlights the bullish implications for the broader altcoin market as Ethereum’s price rises, speculating that “altcoins are ready for a strong rally.”\n\nAccording to analysts, one of the most promising emerging altcoins is eTukTuk. It is currently in its presale and could explode following its IEO.\n\nGreen AI Presale eTukTuk Raises $2.8M and Offers 94% Staking APY\n\nPresale cryptocurrency eTukTuk unlocks a new paradigm of innovative transportation, combining blockchain, AI, and electric vehicle technology into one protocol.\n\nWidely anticipated to be the next crypto to explode, analyst Jacob Bury recently dubbed it a “New 10x potential green AI crypto.”\n\nThe project will strategically place AI-powered electric vehicles and charging stations in developing nations worldwide, starting with Sri Lanka.\n\nIn a display of commitment to its goal, eTukTuk has already partnered with Capital Maharaja Group, Sri Lanka’s largest privately held company.\n\nAdding to its legitimacy, the eTukTuk team is doxxed and consists of well-versed specialists with experience across a slew of industries.\n\nThe project will integrate AI to ensure the efficiency and longevity of its vehicle fleet, helping with route optimization and predictive maintenance.\n\neTukTuk also boasts a Play-to-Earn game, which provides a high-octane way for users to generate rewards while bolstering the $TUK token’s utility.\n\nIn a two-pronged approach to user rewards, the platform offers a staking mechanism, currently providing a 94% APY. However, this will decrease as more tokens are staked.\n\nWhat’s more, the current presale price is $0.0295, but this will rise throughout the campaign, with the next uptick in two days.\n\nVisit eTukTuk Presale\n\nDisclaimer: The above article is sponsored content; it’s written by a third party. CryptoPotato doesn’t endorse or assume responsibility for the content, advertising, products, quality, accuracy, or other materials on this page. Nothing in it should be construed as financial advice. Readers are strongly advised to verify the information independently and carefully before engaging with any company or project mentioned and do their own research. Investing in cryptocurrencies carries a risk of capital loss, and readers are also advised to consult a professional before making any decisions that may or may not be based on the above-sponsored content.\n\nReaders are also advised to read CryptoPotato’s full disclaimer."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxONExYMkdXOWZPUTI0bmFiRW50eDVSeTJRRkpGaDdkQjBQZTNIdmhmeFUtdUQ4VVA5UG93bVV4MHNtN1NwNFhJdTNlcTlvNmxGY0lHbHFFdmZTTnhDSkE0MzFGWG9Xb19qWGwzOXI0ZVNnbUxhaFVkMjhXdGwzVGptY1Jab2RaUmdVcnhiRDRYNnZydEkxQW80bGM3ck5LVGcxZU03OG90T01RaU1NQ25zN3kxRUtZd9IBuwFBVV95cUxPZmM0TVpLSjUwNDIwMXhleEZ5U3Vla2ppUi11T1FiLVk2cXNjMTZjN0lNS25TN0VaU3ZsRzByQVlEWklVQlF1ZUtuZUwwNHZNSHNsTWVWWXhvRGRxTWFzQ2xVSUJ5NjJwbURVS3ozamRDLVEyQl9tTk5qNEpKMTQ0emVtN0NRaVhvT0g4dGdZRmpRd0ljZmlQTDNSaGJOVDc5X1RrUF80Njh5R1A0NXdiSEtlQmhoN19NbEtF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Apr 2024 07:00:00 GMT",
        "title": "Dogecoin (DOGE) Back to Yearly High? Ethereum (ETH) on Verge of Breakthrough, Solana (SOL) Fell Behind Rest of Market: Reason - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nDogecoin has seen its price jump by 16% since reaching its lowest point. Now, it is near the highest price it has been all year at $0.22. Some people who watch the market think this rise might not last, and the price could fall again.\n\nLooking at the price chart, Dogecoin has been doing quite well lately. It has been staying above $0.179, which is the growth threshold for the asset. If it can stay above this price level, we might see the rally continue, as it coincides with the point at which a reversal begins.\n\nDogecoin's future depends a lot on whether continue keep being interested in it. It has become popular before, especially with the help of social media and some famous people talking about it. But it is difficult to tell if it will keep being popular and if people will start to think it is not just for fun but also useful for other things.\n\nRight now, Dogecoin looks like it might be ready to try for its highest price this year. But people who want to invest should be careful. There are two important price levels – $0.155 and $0.11 – that could help stop the price from falling too much. Also, the Relative Strength Index (RSI) is at 59.97, which tells us that there is room for growth, but the fuel for it is yet to be found.\n\nAdvertisement\n\nEthereum stays relevant\n\nEthereum is getting close to the $3,600 price, which has been tough for it to get past before. This time, Ethereum might just be able to push through.\n\nEthereum's price has gone up and down, testing how strong its support levels are and if the people buying (the bulls) can keep the price going up. The $3,600 mark is important because Ethereum has struggled to get past it before. Now, everyone's watching to see if it can finally do it.\n\nWhen we look at Ethereum's price chart, we can see it is really trying to get over the $3,600 mark. It looks like it is getting ready to make a big move up. There is a sign on the chart that if Ethereum can close above $3,600 solidly, the price might jump up.\n\nThe chart shows us some important prices that have helped Ethereum to not fall too much. One is at $3,474, and an even bigger one is at $3,056, which is where the 50-day moving average is. These prices are like a trampoline for Ethereum — they could help it bounce higher.\n\nWhat happens next for Ethereum might depend on if it can keep up the good work and get over the $3,600 hump. If it does, it could mean the start of a time when the price goes up even more.\n\nSolana stands out\n\nSolana is drawing attention for the wrong reasons. While other cryptocurrencies are gaining value, Solana's price is dropping. This is surprising to many because the overall mood in crypto is quite positive.\n\nPeople are now trying to understand why Solana is falling behind, and it looks like some technical problems with the network are to blame. These issues are causing transactions to fail because of too much traffic, and this has caused the outflow from the network.\n\nWhen we look at Solana's price chart, we notice that its value is around $184.02, which is lower than it has been at recently. This decrease might be related to worries about the network's transaction issues. These concerns have led to some uncertainty about when Solana will be able to sort out these troubles."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQdDVwcDlQMXVHandBanJpNlEwZmJhUUpSMVl4MmsybWpwSm14TTAtZHVJN2Q0YmFTcjBpc1h1WWhNQ20yVW13NXAwdGh2amdkVVVzMTBlc2h4OWMtOFVFUUFoWEdNZGI4RE5XOFUycTIwTFZTb3RNdlhqQU5QMFczWDNKdFVsMjhpQVHSAY8BQVVfeXFMTlRWSFEzSVZlckZVdEdkcTBmR2RMS2UwS2ZyOVY3SDRlSzFYRVBYcjBOVjZXQ0lseFhaTXZjcHF3dGJ6cmFWLXItSjMtYWN6SkJjMW9sNVdyaFFIbkJBMTZsYnMzSFpCZ3U5VU1UZEdTcUhiNGpsQks1bzQ5U18tVXFhSnd3OUU5TUtXcnFnZE0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis: ETH Explodes 7% Dailys, is $4K Next? - CryptoPotato",
        "content": "ETH has recently demonstrated resilience, maintaining support around the critical threshold of $3.2K, leading to a period of consolidation with minimal price movements.\n\nHowever, there are indications pointing towards a potential surge in buying interest in the medium term, possibly setting Ethereum on a trajectory to surpass its yearly peak of $4.1K.\n\nTechnical Analysis\n\nBy Shayan\n\nThe Daily Chart\n\nA thorough analysis of the daily chart showcases ETH’s ability to withstand increased selling pressure, finding strong support around the $3.2K mark. This zone coincides with key Fibonacci retracement levels between 0.5 ($3190) and 0.618 ($2972), further fortified by the critical 100-day moving average at $2972.\n\nThis confluence of support levels suggests significant hurdles for sellers attempting to drive prices lower, indicating prevalent buying activity and demand in Ethereum’s downward path.\n\nHowever, ETH is currently in a phase of sideways consolidation, with many market participants anticipating a bullish resurgence aimed at reclaiming the yearly high of $4.1K in the medium term.\n\nThe 4-Hour Chart\n\nDelving deeper into the 4-hour chart, the formation of a multi-week sideways wedge pattern can be observed, with ETH’s price nearing the apex of this narrowing range. Despite this consolidation, the recent price signals robust buyer presence around the crucial support zone of $3K, resulting in a modest rebound towards the upper boundary of the wedge.\n\nAs the cryptocurrency approaches the narrowing range of the pattern, a breakout in either direction seems imminent in the short term. A potential rejection and breach below the wedge’s lower boundary could pave the way for a bearish extension toward the substantial support at $2.9K.\n\nNevertheless, considering the prevailing market conditions and the dominance of buyers in the perpetual market, a more probable scenario involves a breakout above the pattern, with Ethereum targeting its next resistance at $3.7K.\n\nIn general, heightened volatility and significant liquidations in the futures market are expected, necessitating caution among market participants.\n\nOn-chain Analysis\n\nBy Shayan\n\nThe recent consolidation in Ethereum’s price, following its rapid surge towards the $4K mark, prompts a closer look at sentiment indicators in the futures market to gauge potential future movements. Analyzing the funding rates and Open Interest metric offers valuable insights into the prevailing sentiment among market participants.\n\nThe funding rates metric, alongside Open Interest, serves as a barometer for the aggressiveness of buyers and sellers in executing their orders. Overall, positive values in these metrics suggest a bullish sentiment and heightened activity in the perpetual market, while negative values indicate a more cautious or pessimistic stance.\n\nUpon inspection of the chart, it’s notable that as Ethereum’s price experienced a notable uptrend, there was a corresponding spike in the funding rates metric. This indicates an aggressive execution of long positions by participants. Similarly, the uptrend in the Open Interest metric also reflects heightened activity, signalling an overall heated state in the futures market.\n\nConsidering these metrics, the market appears poised for another significant move in the mid-term, with the potential for long positions to be reinstated in the perpetual market. This suggests a favourable outlook for Ethereum’s price trajectory, potentially pushing it towards its all-time high."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxNWEEtZVdMSjlaWC1yZ3UwS2hEMmJNdjZuWnBXbV9rWVFFY3BqVGlCSVNtZF95a2RHanQzYTN1RXlqWkJBcmJoNy1KV0hBbXVwNXVDZUVISWtzbmtxd2RyRGhQYVZFWFpyUXo3eUxwX1NWc2FPX0NOUWNPOEpGU1Q1LW01eGtnQ2YxMHJPM2R4cXhzUFVLT2ItTkZhbUVIa1d2MVp0VzI3VFREZDdMa3AtQVVENHNCby1Wa05zQlZIRUttdWRxc0s3ZXZhZGZKejJRbFRBSkdB0gHbAUFVX3lxTE1vYkhYX1FPeE5QSXlDRmZfQjN4MkVuUzVFMmxQM1J6RWJwRzhCcU5zWXE0UmxzQTBGSjlRWW5ZcHl2UTQzQXJkODJld21aMTg3dS01cENQUDNZUjZrUzhtTWYyQ2FpbVpBdWhxTkVtRjk5b0I1MGU3eXZGUnYxSzR2S1lxNW83dVpEcFUtN21nYUIyVXVRR0d6ZzdOQ0w1c3oxbk9qemtBUndrVUpxVUkxLTlGcGVKaVdTeFNSZE1KMUhyeHVCUUhEUGRvSy1ZMlFRcEE2WUtVZHR1Yw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Apr 2024 07:00:00 GMT",
        "title": "Ethereum's price recovery looks imminent as ETF approval sees a glimmer hope - FXStreet",
        "content": "Ethereum transitioned from a Proof-of-Work (PoW) to a Proof-of-Stake (PoS) mechanism in an event christened “The Merge.” The transformation came as the network wanted to achieve more security, cut down on energy consumption by 99.95%, and execute new scaling solutions with a possible threshold of 100,000 transactions per second. With PoS, there are less entry barriers for miners considering the reduced energy demands.\n\nStaking is a process where investors grow their portfolios by locking their assets for a specified duration instead of selling them. It is used by most blockchains, especially the ones that employ Proof-of-Stake (PoS) mechanism, with users earning rewards as an incentive for committing their tokens. For most long-term cryptocurrency holders, staking is a strategy to make passive income from your assets, putting them to work in exchange for reward generation.\n\nEthereum uses decentralized blockchain technology, where developers can build and deploy applications that are independent of the central authority. To make this easier, the network has a programming language in place, which helps users create self-executing smart contracts. A smart contract is basically a code that can be verified and allows inter-user transactions.\n\nEthereum is a decentralized open-source blockchain with smart contracts functionality. Serving as the basal network for the Ether (ETH) cryptocurrency, it is the second largest crypto and largest altcoin by market capitalization. The Ethereum network is tailored for scalability, programmability, security, and decentralization, attributes that make it popular among developers.\n\nAs a result, ETH may continue the consolidating move briefly to gather momentum for its next move to test the $3,943 barrier. If ETH successfully breaks past it, it could enter a bullish momentum to break past previous highs of $3,517, $3,570, and $3,655.\n\nEthereum reached its highest price in around the past seven days when it traded at around $3,480 on Sunday before experiencing a correction. However, it has yet to break past its one-week resistance of $3,493, which formed a liquidity void on April 1.\n\nEthereum (ETH) began showing signs of recovery on Monday, briefly trading at $3,460, after consolidating for the past week. This recovery may likely be due to recent whale activity surrounding the largest altcoin and JP Morgan's positive outlook for an ETH ETF approval.\n\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all or a portion of your investment, as well as emotional distress. All risks, losses and costs associated with investing, including total loss of principal, are your responsibility. The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of FXStreet nor its advertisers. The author will not be held responsible for information that is found at the end of links posted on this page.\n\nIf not otherwise explicitly mentioned in the body of the article, at the time of writing, the author has no position in any stock mentioned in this article and no business relationship with any company mentioned. The author has not received compensation for writing this article, other than from FXStreet.\n\nFXStreet and the author do not provide personalized recommendations. The author makes no representations as to the accuracy, completeness, or suitability of this information. FXStreet and the author will not be liable for any errors, omissions or any losses, injuries or damages arising from this information and its display or use. Errors and omissions excepted.\n\nThe author and FXStreet are not registered investment advisors and nothing in this article is intended to be investment advice."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiXkFVX3lxTE1fa0NrVlllaTViRGtrcFEtTHhxcE9CYldLdmhXQnFaTVlXa0NGSVRWRnBUZGhLb2dWZ1QwUlAtWmNBcDdFNTJZcTUxb3owS04yWThwU2FyT0pQcFl6UFE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Apr 2024 07:00:00 GMT",
        "title": "What are blobs? Ethereum's solution for scalability and efficiency - OKX",
        "content": "The introduction of blobs during Ethereum's Dencun hard fork is a major development in blockchain technology. Blobs are data structures that allow for settlement via Layer 2 (L2), rather than using calldata. Blobs were created to improve Ethereum's scalability and efficiency, particularly for rollups, resulting in increased accessibility and cost-effectiveness.\n\nAs Ethereum shifts its attention from addressing the initial \"zero-to-one\" challenge to tackling \"one-to-N\" obstacles, the role of blobs becomes important in enabling this transition. The tool aims to improve the blockchain's capabilities and simplify its operations, paving the way for future scalability improvements and progress in application development.\n\nIn this article, we'll explore what blobs are, how the technology could influence decentralized applications (DApps), and how you can buy the blobs token.\n\nTL;DR\n\nBlobs improve the scalability and efficiency of Ethereum, particularly for rollups, offering easier and more affordable transactions.\n\nAs Ethereum progresses from its initial stages to handling multiple challenges, blobs play a crucial role in supporting this important transformation.\n\nThe role of blobs is crucial in streamlining blockchain processes and laying the foundation for future progress and growth.\n\nEIP-4844 aims to enhance scalability and lower transaction fees on Ethereum by introducing \"blobs,\" which can hold large amounts of data.\n\nThe Dencun upgrade, which includes EIP-4844, seeks to enhance the scalability and cost-efficiency of Ethereum, particularly for L2 solutions.\n\nUnderstanding blobs and their role\n\nImplementing proto-danksharding through EIP-4844 introduces a new concept called \"blobs,\" which are substantial blocks of data stored on the Ethereum blockchain. These blobs aim to improve Ethereum's scalability by enabling the processing of larger amounts of data cost-effectively and efficiently.\n\nUnlike traditional data handled by the Ethereum Virtual Machine (EVM), blobs are stored through KZG cryptographic commitments to enhance the efficiency of L2 rollup methods.\n\nImpact on gas fees and scalability\n\nThe introduction of blobs is expected to reduce gas fees significantly. By providing a specialized data layer that rollups can use, EIP-4844 increases the data space per block, thereby lowering costs. The development is significant because it doesn't fully incorporate data sharding but establishes a new transaction format and storage system on the beacon chain.\n\nThis supports scalability and paves the way for potential sharding implementations in the future. Blobs were created to meet the urgent demand for scalable solutions by providing a temporary solution until complete data sharding is accessible.\n\nTheir introduction is driven by the need to support rollups as a scalable, trustless solution for Ethereum despite the cost advantages rollups offer over the base layer. EIP-4844 seeks to mitigate the prohibitive fees of rollups by introducing this specialized data layer.\n\nThe Dencun Upgrade and its broader implications\n\nScheduled for activation with the Dencun upgrade, EIP-4844 is set to revolutionize Ethereum's infrastructure, making it more scalable, economical, and efficient for users and developers.\n\nThe Dencun upgrade adds cheaper data storage for L2 proofs by only requiring node operators to store this data for approximately 18 days. This period is considered long enough for all network participants to download and store the data, while also keeping hardware requirements manageable.\n\nThis approach benefits L2 rollups by reducing transaction costs and network load and enhancing Ethereum's infrastructure for future advancements. By leveraging KZG commitments for blob storage, EIP-4844 improves the overall efficiency of the Ethereum network.\n\nWhat is the blobs token?\n\nThe blobs token is a new and inventive aspect of the Ethereum blockchain, intricately linked to the Dencun upgrade and EIP-4844.\n\nThe blobs token system is a crucial advancement in the Ethereum community that aims to solve problems with the blockchain's ability to handle a large volume of transactions and expensive gas charges, focusing on improving L2 solutions.\n\nThe division of assets into blobs tokens is fundamental as it supports Ethereum's larger objective of transitioning from tackling initial blockchain obstacles (the \"zero-to-one\" phase) to dealing with scalability and efficiency in a more dispersed setting (the \"one-to-N\" phase).\n\nApplying the characteristics of blobs for tokenization allows Ethereum to process a greater number of transactions with greater efficiency, ultimately decreasing transaction costs and improving the user experience for DApps.\n\nTechnical mechanics of blobs\n\nAt the heart of the blobs token mechanism is \"blob transactions.\" These transactions are integral to EIP-4844 and introduce large data packets (the blobs) that can be included in Ethereum blocks. Unlike typical Ethereum transactions, which are processed and stored permanently by the Ethereum Virtual Machine (EVM), blobs provide a more scalable and cost-effective way to handle large amounts of data.\n\nThe EVM doesn't directly process blobs, but thanks to KZG cryptographic commitments, they can still be included in the blockchain. In other words, they can temporarily store data, which is especially advantageous for L2 rollup solutions requiring proofs to be submitted to the Ethereum mainnet for verification.\n\nUsing blobs allows these solutions to significantly decrease the amount of data they must permanently store, resulting in lower gas fees.\n\nIntegration with Ethereum for gas fee reduction\n\nThe addition of new transaction types and block header fields introduced by EIP-4844 enables the integration of blobs into Ethereum's infrastructure. Every block in Ethereum could contain a set number of blobs, each capable of holding a maximum of 128kb of information. Including blobs enables L2 solutions to transfer a considerable amount of data away from the mainnet, resulting in a notable decrease in gas fees.\n\nThe blobs mechanism's significance lies in its influence on gas fees. EIP-4844 establishes a distinct area for blobs in Ethereum blocks, resulting in a new gas market dedicated to blob storage. This market functions similarly to the current gas market but concentrates on the expenses related to storing blobs.\n\nWhat makes blobs unique?\n\nBlobs stands out from other tokens in the blockchain and crypto space due to its close relationship with Ethereum's structure, plus other key features.\n\nIntegration with Ethereum's blockchain : Blobs are intricately linked to Ethereum's Dencun upgrade, a significant development aimed at reducing gas fees and enhancing scalability by introducing data \"blobs.\" The introduction of blobs is a significant milestone in Ethereum's continuous growth.\n\nMeme integration into blockchain technology : Blobs stands out for its incorporation of memes, which gives it cultural significance and sets it apart as a creative method for connecting with and growing the crypto community. Combining humor and technology, blobs uses the power of meme culture to establish a distinctive presence in the world of digital assets.\n\nEnhancing Ethereum's scalability and efficiency :\n\nEthereum's proto-danksharding, a precursor to full sharding, introduces blobs to address scalability challenges. Blobs act as short-term, effective containers for transaction information, simplifying verification procedures and minimizing storage expenses.\n\nThe implementation of blobs is predicted to decrease charges on L2 platforms by lessening Ethereum's data storage responsibility. This in turn allows for quicker transaction handling at a reduced cost. This technological advancement directly benefits users by making Ethereum-based transactions more cost-effective.\n\nCommunity and developer engagement : Ethereum's incorporation of blobs demonstrates the project's adaptive response to community input and technical obstacles. By tackling issues such as costly gas fees and network congestion, the project showcases a dedication to enhancing user satisfaction and broadening the reach of DeFi applications.\n\nPotential for widespread impact: Blobs have the potential to contribute significantly to the wider usage of Ethereum and its related technologies by making transactions more convenient and cost-effective. This incorporation hints at a future where blockchain is easier to use, has a greater reach, and is more ingrained in mainstream society.\n\nBlobs' unique position at the intersection of technological innovation and meme culture enhances its appeal to diverse users, from crypto-curious to crypto natives.\n\nHow to buy blobs\n\nWhen purchasing blobs tokens, you typically follow a process similar to buying other cryptocurrencies via DeFi platforms.\n\nSelect a crypto wallet: To store your purchased tokens securely, it's essential to select a crypto wallet compatible with the blockchain network on which blobs tokens operate. Purchase a base crypto: You may need to hold ETH before exchanging it for blobs tokens on networks such as Ethereum. This process involves purchasing the primary currency on a crypto platform using currencies such as USD or EUR. Transfer to your wallet: Transfer the main digital currency to your preferred wallet and make sure you hold a small additional amount for gas fees. Choose a DeFi platform: Find DeFi platforms or DEXs that offer blobs tokens for trade. Popular options include platforms such as Uniswap that specialize in Ethereum-based tokens. Swap for blobs tokens: Connect your wallet to the chosen DEX, select the base cryptocurrency and blobs tokens for the swap, and execute the trade. Remember, transaction fees will apply, and they vary by network. Storing and managing your tokens: After making a purchase, you can control your blobs tokens through your wallet. You're able to keep, stake, or use them in DeFi applications according to your strategy.\n\nWhat are the potential uses and applications of blobs?\n\nBlobs could have a significant impact on the Ethereum ecosystem, with many potential use cases possible.\n\nL2 optimization\n\nBlobs are commonly used in L2 solutions, specifically for handling settlement data. This allows L2 networks to efficiently settle transactions on the Ethereum base layer (L1), significantly decreasing operational expenses.\n\nRollups and data availability\n\nRollups have the potential to profit significantly from blobs as they group transactions and handle them outside the main Ethereum chain. By storing transaction information in blobs, rollups can increase their transaction capacity while reducing costs compared to using the Ethereum main chain. This ultimately improves their efficiency and scalability.\n\nCreation of new data markets\n\nBeyond rollups, blobs could enable the creation of new types of decentralized data markets on Ethereum. These markets could facilitate secure and efficient data buying and selling, leveraging the decentralized and secure nature of the blockchain.\n\nDApps\n\nBlobs open new possibilities for DApps, especially those requiring the decentralized storage and sharing of large data sets. They can be used to manage data in a variety of applications, including decentralized file storage systems and data-heavy scientific research platforms.\n\nNetwork efficiency and lower fees for users\n\nThe arrival of blobs offers the typical Ethereum user the potential for quicker transactions and reduced fees, tackling two major concerns of users regarding the current state of the Ethereum network.\n\nWhile the potential for blobs and the EIP-4844 upgrade is high, it's important to note that it's one step towards a bigger goal of full danksharding, which aims to further scale the Ethereum network by splitting it into multiple parallel chains. However, the immediate benefits, such as improved scalability, lower fees, and new applications for Ethereum, mark significant progress.\n\nThe development of blobs in tandem with EIP-4844 and future enhancements could play a significant role in defining the direction of DApps and the overall functionality of the Ethereum blockchain as it progresses.\n\nWhat's next for blobs?\n\nThe roadmap ahead includes further enhancements to increase blob capacity and optimize rollups, alongside implementing data availability sampling (DAS) to allow for up to 16 MB of data space per slot.\n\nVitalik Buterin, Ethereum's co-founder, detailed the future development directions for Ethereum. These directions outline two main strands: increasing blob capacity and improving L2 solutions to make better use of the available data space.\n\nInnovations like PeerDAS aim to scale blobs while preserving network efficiency. And, advancements such as EIP-7623 will impose stricter bounds on execution block sizes, enhancing scalability. Buterin also highlighted the importance of efficient and optimistic data compression techniques to secure L2 solutions.\n\nLooking at the bigger picture, Buterin has compared Ethereum's growth to an S-shaped curve, moving from quick advancement to a slower period of improving the user experience and introducing new applications.\n\nThis change highlights Ethereum's dedication to creating a decentralized platform that efficiently expands and provides a suitable setting for applications that use the blockchain's distinctive features.\n\nExpanding our perspective beyond Ethereum and considering the larger cryptocurrency environment for potential advancements in 2024 would be wise.\n\nFor example, Algorand, along with other blockchain projects, is making notable advancements. Algorand's focus for 2024 is on improving its open blockchain platform, with a focus on enhancing performance and increasing decentralization. Adding dynamic round times and implementing Python for smart contract creation are intended to enhance network efficiency and grow the developer community.\n\nAlgorand plans to increase its network's decentralization by incentivizing consensus and transitioning to a peer-to-peer gossip network. The advancements in popular blockchain networks demonstrate a persistent emphasis on expanding efficiency and decentralization, suggesting a bright outlook for crypto's potential and the creative possibilities it'll bring.\n\nThe final word\n\nSince launching, Blobs have had a major impact on improving Ethereum's scalability and efficiency, which is vital for the success of rollups. In short, this technology makes transactions more convenient and affordable. As Ethereum continues to develop and address difficult obstacles, blobs are instrumental in supporting progress.\n\nMost significantly, introducing blobs through EIP-4844 and the Dencun upgrade aims to lower transaction fees and improve scalability for L2 solutions. As more users feel the benefits of blobs, many are looking ahead at what other possibilities the technology could bring to the blockchain space."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxQRmJTUF9xZlFCLXN5TjVWQnE4REY5RkljR0pZeHczR2tLLWpoMlFpNnRmNjNXc3M5VjNab0pFek9SQzhpWUs4WENIdV9NaFpFMS1SeU5vS0laT2N5TUF3S3UxY3lWa1RheEhPc0tGTmUzM3F6cmdNMDRnR2tVREwxTVo1bjFtM2txQzlnNDNiNTLSAZYBQVVfeXFMTjhMMGgzTHJ4UnNfNGIyQXJEUk5zTmxQNVZZamNyTXJqMjY2TzN4X3RGUFk1NVJYMFpFNGlaVXNHZWM0clBIZVBtV082bW9VVlZIRXpJRjljSGFraVpjLUVCRXpyX0xzWGFBdW9Va2kya2FBVzR0bDRLVkFvZVU3STEycXFtekxxRmRnVmVxWjdPc3I3Qlpn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Apr 2024 07:00:00 GMT",
        "title": "Robinhood's 14% Unexpected Shift From Ethereum to Bitcoin Rattles Markets - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAccording to Conor Grogan, director of Coinbase, who goes by the handle \"Conor\" on X, Robinhood, the popular trading platform, has made significant adjustments to its cryptocurrency holdings over the past six months.\n\nAdvertisement\n\nThe platform has seen a remarkable surge in its Bitcoin holdings, increasing by 14% while decreasing its Ethereum holdings by 9%. Robinhood also doubled its Chainlink (LINK) holdings, per the screenshot provided by Conor.\n\nRobinhood's BTC holdings have increased by ~14% in the last 6 months; meanwhile user ETH holdings have actually decreased ~9%\n\n\n\nRetail users are beginning to come back to crypto, just not to ETH so far pic.twitter.com/PQLCswHHNF — Conor (@jconorgrogan) April 7, 2024\n\nThis unexpected shift in strategy has raised eyebrows within the cryptocurrency community and prompted speculation about the platform's motivations and implications for the broader market.\n\nRobinhood's decision to bolster its Bitcoin holdings comes amid a period of heightened interest in and adoption of the world's largest cryptocurrency. While the exact reason for the shift is unknown, what remains clear is that Robinhood's move has sparked a buzz on the market.\n\nBitcoin, often hailed as digital gold and a store of value, has witnessed a surge in institutional interest and mainstream acceptance, driving its price to new heights.\n\nConor highlights that Robinhood's cold storage address is the third largest single BTC wallet, holding 69% of all BTC ever created. Against this backdrop, Robinhood's move to increase its Bitcoin exposure might suggest growing confidence in the cryptocurrency's long-term potential and investment appeal.\n\nHowever, the platform's simultaneous decrease in Ethereum holdings by 9% has sparked intrigue and speculation. According to Conor, this could indicate that retail users are returning to crypto but not to ETH thus far.\n\nIn a surprising revelation, Robinhood does not hold Solana since they force-sold it on behalf of all of their users for $14, the absolute bottom, missing out on the 1,300% returns since then. Robinhood delisted Solana from its platform in June 2023.\n\nAt the time of writing, BTC was up 4.12% in the last 24 hours to $72,130, while Ethereum was higher at 6.75% to $3,608."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxNYjdBbHVzQ25aZnozU255LVBjVkJrUlhiRWQ4bDg1Rmw4X0tJXzBvOHRKbkYyLXAxcF9PSzQxdV9OenJoRGt1ZG91VjZlUFZlOUpPa3JMVmxFVzdVVzUwcC1sb25xODFQRHlKc0dSek50Mm5WSVk2Nkx1dmJNc1RpWC1FLXVfRUNCeFdZVmlkUk9hYmFQMkZpVXJzQ2c2UmlLVC1F0gGoAUFVX3lxTE4wenV6bFRWWVlaajJ2UEY2R2tlYWpoYmthYmJLNVh3TDZCbUJZeUFOb09zREFreUFHSC1oandfUmlUMzRENWx4OWRMVXpTOVNKSTdocWFPcS1QV192WlF4VW95QjJXRXpsVE5aS3NWOERjXzVDTU1xRG9ZcF9YLUpNSlNDeUJFbTNWQ2UyLTE2TUVhc3loaUpOcE5yU3E1QklOWHhpN0k0Mw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Price: Veteran Trader Peter Brandt Warns Of ETHBTC “Bear Trap”, Rally Ahead - CoinGape",
        "content": "Ethereum price continues to trade under $3,500, failing to gain despite high anticipation surrounding the Dencun upgrade. Also, ETHBTC just had its lowest weekly close since April 2021. However, legendary trader Peter Brandt known for accurate predictions says the Ethereum price could be in a “bear trap“.\n\nIs Ethereum Price In A Bear Trap?\n\nPeter Brandt, last week, said Ethereum is a “junk coin” and Bitcoin pretender, but agreed that it will always attract investors. In the latest post on X, veteran trader Peter Brandt indicated Ethereum price could be in a “bear trap”.\n\nadvertisement\n\nA bear trap is a false technical indication of a reversal and the possibility of Ethereum price in a bear trap is higher than a reversal due to bull market and positive sentiment. ETH price has dipped new 35-month low, with dominance falling below 16%. The reason is Solana’s unstoppable rally and upcoming Bitcoin halving.\n\n“There are enough HUGE whales invested in ETH that it will be difficult for the price to depreciate very much,” said Peter Brandt.\n\nSpot On Chain signaled heavy buying of ETH by whales. For instance, two whales spent a total of $35.11 million in stablecoins to buy 10,322 ETH, causing a recovery in price. The trading activity is also high after ETHBTC is at record low level.\n\nIntoTheBlock revealed on-chain activity to pick up radically and reaching highs of 32 million transactions per week as L2 gas costs dropped significantly after the Dencun upgrade.\n\nAlso Read: Ripple Vs SEC — Good News from Court on Crypto and XRP Secondary Market Sales\n\nETH Price to Rally Towards $4,000\n\nPopular analyst Michael van de Poppe stated Ethereum price looks attractive at the current level as it is at a crucial support zone and is still trending down. “However, this is the region where I’m looking to get myself even more into the Ethereum ecosystem, he added. Also, there is an investment opportunity amid negativity surrounding Ethereum.\n\nETH price jumped over 1% in the past 24 hours, with the price currently trading at $3,426. The 24-hour low and high are $3,370 and $3,458, respectively. Furthermore, the trading volume has increased by 7% in the last 24 hours, indicating a rise in interest among traders.\n\nEthereum futures open interests across exchanges has also increased more than 1% in the last 24 hours. The rise in prices and OI indicates a likely recovery in ETH price.\n\nAlso Read: Bitcoin (BTC) Price Stabilizes Before March CPI Data and FOMC Meet, What’s Next?\n\nVarinder Singh Varinder has 10 years of experience in the Fintech sector, with over 5 years dedicated to blockchain, crypto, and Web3 developments. Being a technology enthusiast and analytical thinker, he has shared his knowledge of disruptive technologies in over 5000+ news, articles, and papers. With CoinGape Media, Varinder believes in the huge potential of these innovative future technologies. He is currently covering all the latest updates and developments in the crypto industry.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxOMzZseEV2S0RkdUNhZmpUbVpFNXZ4R0NPU2IyUXhScW05WFBxY3h3NEFsTE5kVnBKb0o3UnFGMWgyV2FSQUR4XzNudGRRQkh4V2ZsN3Z1VmVCeEkzbDdkOXAwLWgyWDkwX0h4S3FZNjFBaEJhcFpxZ0Etc1VjNUF4T1ZzMXJrTE0yZzNNaNIBkgFBVV95cUxPZXIzbFp2WGNra0dpMVk1WFVOVHNiMjNwUDRfM3F1YmVmOUpIY1dYYWxFcGt6ZUdUWktUeWV6YzZ6VjZCdmI3OHRkSlhxSVBLUG9OSnFvYlZ2Vl9JUlJvand0QXJwY29IS192UW9kTDgxQW5DdERITVZPek1Ha2ZEUlhYbjB2Qy1hUHR6VW15SXM4dw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Apr 2024 07:00:00 GMT",
        "title": "Base tops Arbitrum, Ethereum as it leads with 48M transactions - AMBCrypto News",
        "content": "Base outperformed Ethereum and Arbitrum in terms of activity over the past few days.\n\nInterest in ETH and ARB remained high however prices remained stable.\n\nCoinbase’s Layer-2 scaling solution, Base, surpassed Arbitrum [ARB] and Ethereum [ETH] in terms of daily transactions and activity.\n\nThe L2 sector gets competitive\n\nAccording to L2Beat data, a close race emerged for dominance among the L2s. Base led the pack with a significant 47.78 million transactions processed in the last 30 days, followed closely by Arbitrum One at 39.26 million.\n\nEven Ethereum itself processed a substantial 37.90 million transactions, highlighting the overall network activity.\n\nWhen it comes to processing speed, Base emerged as a clear leader. It achieved a daily Transactions Per Second (TPS) of 35.19, reflecting a remarkable 36.12% increase. This placed it well ahead of Arbitrum with 17.80 TPS and Ethereum with 14.38 TPS.\n\nIn terms of Total Value Locked (TVL), Coinbase’s Base made significant strides. Despite facing network congestion concerns earlier, it managed to secure a TVL of $1.3 billion.\n\nThis was coupled with an impressive 29.71 increase in transaction volume over the past week. The surge placed Base ahead of Arbitrum One, which currently sat at $3.2 billion TVL after experiencing a 1.61% transaction decline.\n\nEthereum remained the TVL leader at $51.6 billion, but it dipped slightly (3.07%) in the last week.\n\nThese trends suggested a potential shift in the L2 landscape. New entrants like Base have outperformed networks such as Arbitrum.\n\nEthereum stands to benefit\n\nEven though Ethereum itself might be losing some ground in terms of raw transaction volume, it remains the foundation upon which these L2s operate.\n\nAs L2 adoption flourishes, the overall Ethereum ecosystem strengthens, leading to a more robust and valuable network in the long run.\n\nDespite these factors, both ARB and ETH witnessed a correction in price over the last few days. Even though the price of the tokens fell, the number of addresses holding both the tokens had grown.\n\nThis suggested that the bullish sentiment around these tokens persisted, however, it wasn’t significant enough to impact price movement.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nAt press time, ETH was trading at $3,386.65. In the past 24 hours, ETH grew by 1.48% in the last 24 hours.\n\nARB, on the other hand, was trading at $1.49 and its price had grown by 0.99% in the last 24 hours."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxNTjRKOUltMVBXZGE5MHBfTG9DZTVpemkxclMwaS16THRDVmk0czhGc3FVYzExSHRJVmxhZ01IcVNrM3NvQWxUTDhDckthN0tsbWlHYzZJcUdFVmFqX2xwWEhMNTdSdEZ0eWh4b2w1SlRxaXRZdzZkX1o3elNjY2tDSkJieTRVNFh1Rm0wQW5iQ1RjZ9IBlwFBVV95cUxOOFdrMXVmM2g2X2ZndjdzdVpFTW1telNZMjR2TFByS2thZUVxMElRNG1vUUVNSkUxc1dSd0pSc2tvVXhUdFF6dG9VSFQ0M3MwamRTamV2QU80bmxkOC1ldDVTckFIUUJ4ZjBOUURJWWNTb1kyOHNwTkRPb3NodlRuaVJDamNvVjRRdGxCZXQzSjhwUmlZUk1V?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Apr 2024 07:00:00 GMT",
        "title": "Betting against Ethereum ETF: How a May rejection could benefit Bitcoin - AMBCrypto News",
        "content": "Ethereum ETF approval odds have dropped below 25% in Polymarket.\n\nVijay Boyapati forecasts ETH ETF May rejection could benefit BTC.\n\nThe overall market is leaning toward a possible US spot Ethereum [ETH] ETF applications rejection in May.\n\nAccording to the prediction markets platform, Polymarket, the bets for ETH ETF May approval have dropped 68% and stood at a 24% chance at press time.\n\nBloomberg ETF analysts Eric Balchunas and James Seyffart, who correctly predicted the US spot Bitcoin [BTC] ETF approval, have echoed Polymarket’s sentiment.\n\nIn a recent post on X, Seyffart highlighted SEC’s “silence” and “no feedback” to recent ETH ETF filings as “violence” to clients.\n\n\n\n“Eric said “Silence is Violence” on a client call last week in regards to the #ethereum ETFs and I loved it.”\n\nSeyffart was reacting to Balchunas’ statement that SEC wasn’t giving “critical feedback” even during in-person meetings. This meant that odds for May approval were still low.\n\nWill BTC benefit from Ethereum ETF May rejection?\n\nWith May fast approaching and approval odds seeming elusive, Vijay Boyapati, commentator and author of “The Bullish Case for Bitcoin,” claimed that,\n\n“All the hot money that flowed into ETH because of ETF hopium is going to go back into Bitcoin once the Ethereum ETFs are all rejected.”\n\nFor Boyapati’s prediction to happen, ETH market dominance will need to drop considerably as BTC’s surge.\n\nAccording to CoinMarketCap, BTC’s market dominance was 52.4% at the time of writing, mainly due to strong ETF flows in the past three months. ETH’s market dominance stood at 16.5%.\n\nShould Boyapati’s thesis be confirmed, ETH market dominance could slip below 16% or 15% as the market re-adjusts to ETH ETF rejection in May. If so, the capital rotation could induce BTC momentum.\n\nIn the meantime, ETH was above a crucial weekly bearish order block (3.2K—3.5K). It was consolidating around the Q1 2022 local top. A slump below 3.2K could cause bears to overwhelm the market, especially if ETH ETF applications are rejected."
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxNcEM1WXhIWkxUM2FyTmR4UW50ZG53aEU2YTZZem13RTl1U0lxVjBkQS1pelFXOUFhN3NoMENyWFZiTld0MVZwWVlFYXJtTG5COHZWUXBTbzhiY0FwdUxrLVRfNG9JVVV4ZWxmRjlhbExxVzBrMmZPeXQ4TWRta1U5RlZn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Apr 2024 07:00:00 GMT",
        "title": "BlockDAG’s 2025 Price Target of $10 Beats SMOG's Market Rise & Ethereum's On-Chain Surge - NFTevening.com",
        "content": "BlockDAG‘s ambitious aim to achieve a $10 valuation by 2025 has stirred excitement in the cryptocurrency realm, overshadowing the market rise of SMOG and Ethereum’s surge in on-chain activities. As the digital landscape evolves, BlockDAG’s strategic vision sets it apart, offering investors a compelling opportunity for exponential growth.\n\nWhile SMOG gains traction in the meme coin market and Ethereum maintains its dominance with increased on-chain transactions, BlockDAG’s innovative approach to blockchain scalability and efficiency positions it as a frontrunner in the industry. With its successful presale and implementation of Directed Acyclic Graph (DAG) technology, BlockDAG is poised to redefine the future of decentralised finance.\n\nSMOG: Emerging Force in Meme Coin Arena\n\nSMOG has quickly established itself as a significant player in the meme coin market, boasting a market capitalisation of $2 million and garnering attention from the community with its upcoming airdrop events. With trading activity surpassing that of its competitors, SMOG demonstrates its potential to become a dominant force in the meme coin landscape in 2024, mirroring the success stories of its predecessors. The swift rise of SMOG underscores the growing interest in meme coins and highlights the potential for significant growth and community engagement within this niche market. As SMOG continues to gain momentum and attract investors, it reinforces the dynamism and innovation present in the broader cryptocurrency space, offering a unique avenue for enthusiasts to participate in the digital asset economy.\n\nEthereum’s Market Vitality\n\nEthereum’s blockchain is experiencing a surge in on-chain activity, characterised by rising transaction volumes and an increase in active wallets. This trend indicates widespread optimism among investors, highlighting Ethereum’s enduring attractiveness and suggesting sustained growth. Ethereum’s pivotal role in the expanding DeFi and NFT sectors further reinforces its position as a leading blockchain platform.\n\nBlockDAG: Pioneering Exponential Growth\n\nProjected to achieve a remarkable $10 valuation by 2025, BlockDAG’s journey from its successful presale to the implementation of Directed Acyclic Graph (DAG) technology underscores its potential to redefine blockchain scalability and efficiency. In its eighth presale batch at an enticing price of $0.0045 per coin, BlockDAG has already raised $15.3 million, selling over 7 billion coins, indicating strong investor confidence and interest.\n\nBlockDAG employs its native BDAG coins for transaction fees within its network, facilitating network maintenance and incentivising validators. Its adoption of DAG technology enables parallel transaction processing, significantly enhancing network scalability and user capacity. The unveiling of BlockDAG’s technical whitepaper and its celebrated showcase on the Las Vegas Sphere highlight the project’s ambition and technological prowess.\n\nWhile Ethereum’s robust on-chain activity and SMOG’s rise in the meme coin market exemplify the diverse opportunities within the crypto space, BlockDAG’s strategic vision for reaching a $10 valuation by 2025 through innovative DAG technology and robust presale momentum illustrates its standout potential for growth and market impact.\n\nBlockDAG’s Scalable Solution to Blockchain Limitations\n\nBlockDAG’s scalable solution to blockchain’s traditional limitations positions it as a compelling investment prospect, capable of accommodating the exponential increase in transaction demand. As the cryptocurrency market evolves, BlockDAG’s distinct approach and ambitious goals place it at the forefront of the next generation of blockchain innovations, promising investors a revolutionary platform and the opportunity for significant returns.\n\nThe Last Call: Invest In BlockDAG\n\nIn summary, as Ethereum consolidates its market presence and SMOG rides the wave of meme coin popularity, BlockDAG’s ambitious pursuit of a $10 valuation by 2025 captivates investors seeking groundbreaking opportunities in the crypto world. With its advanced technology and strategic market positioning, BlockDAG is poised to become a leading force in reshaping the landscape of decentralised finance.\n\nInvest In BlockDAG\n\nWebsite: https://blockdag.network\n\nPresale: https://purchase.blockdag.network\n\nTelegram: https://t.me/blockDAGnetworkOfficial\n\nDiscord: https://discord.gg/Q7BxghMVyu"
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxQRTdadlJZMHE0RFI2OGJMdDN3ZkgtV1lRaEZfbm1UT0JZbk5BcG9VdUVFS2lMNW0teTN6b0NZV2U2NHU1MU04aC1FR0NPYmVPQjF3cjI1azRVSGVBci1jOGx6VUV4enNFTWFkYkxnUzMyVG13S2tvWEZHYUhyeE9HMk43bHRLRnd0UzBnbXNEOWZyRXhLM3ZiSEdLUjZhQdIBowFBVV95cUxQalJpeHFzb3hRRW1MWFM5dklQVS1CS1lkanAtdVliR0ZvcDk5RFdUUUo4NmpydG1kZ1V1QlNHa21pWU9tTXE2Y2VkallwN2ptSm1ra3c0R0pUY1ZQblkxZHQyd3c5eENSQnhod0JxVDdJSjJqemQxUERzZHRvOU5uWldyR2Z6R0x6dVBmTUcyaXVmUmZndnpNaFZMRGlkUEtyR3E0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Apr 2024 07:00:00 GMT",
        "title": "Crypto Prices Today April 8: Bitcoin At $69K, Ethereum Above $3400, XRP & SOL Dip - CoinGape",
        "content": "The top crypto prices today witnessed a bearish turn while the Bitcoin (BTC) price sustained above the $69,000 level. In addition, the Ethereum price gained slightly and traded above the $3,400 mark. Meanwhile, other top altcoins, such as XRP and Cardano (ADA), Solana (SOL) dropped in value.\n\nMajor Crypto Prices Today\n\nThe Bitcoin price was up by 0.29% reaching $69,558.21 at the time of writing on Monday, April 8. On the other hand, it’s trading volume gained by 0.01% to $20.56 billion in the last 24 hours. Whilst, the crypto boasted a market capitalization of $1.36 trillion.\n\nadvertisement\n\nLooking at altcoins, the Ethereum price gained 0.91% to $3,427.74 at press time with a market valuation of $411.57 billion. Whilst, ETH saw its trading volume rise by 3.80%, reaching $9.74 billion. Meanwhile, the Binance Coin (BNB) price dipped 0.76%, reaching $584.27. In contrast, its 24-hour trade increased plunged by 3.42% to $1.38 billion.\n\nThe Solana price continued trading below the $180 mark today. The Solana price declined 2.28%, settling at $177.03. In addition, SOL witnessed a whopping 41.93% decline in trade volume to $1.77 billion in the last 24 hours. Whilst, the XRP price sustained the $0.59 level. The XRP price recorded a drop of 0.43%, reaching $0.5932. On the other hand, XRP’s trading volume surged 9.66% to $958.58 million.\n\nMeanwhile, the Cardano price dropped 1.15% to $0.5836 today. Whilst, ADA recorded a 23.20% hike in its 24-hour trading volume, settling at $309.47 million. As the top crypto prices experienced a mixed action today, the meme coin arena witnessed volatility. The Dogecoin price surged by 1.84% to $0.2006 while its rival, Shiba Inu price slipped by 0.85% and traded at $0.00002811.\n\nAlso Read: Bitcoin ETF Regain Momentum With $484M Inflows, What’s Next For BTC Price?\n\nTop Crypto Prices Today Are\n\nPepe Coin (PEPE)\n\nThe Pepe Coin (PEPE) crypto, a popular Solana meme coin, rebounded significantly despite the bearish sentiment. At press time, the Pepe Coin price was up by 3.34% to $0.000007329 with a market valuation of $3.07 billion. In addition, the 24-hour trade volume for PEPE soared by 60.31% to $519.88 million.\n\nNervos Network Rallies 6%\n\nNervos Network (CKB) recorded a surge of over 6% and ranked as the top crypto gainer today. The CKB price was up by 6.54% to $0.02762 at the time of reporting. However, its trade volume slumped by 2.86% and stood at $297.55 million. Furthermore, the CKB crypto recorded a high of $0.03214 amid the rally today.\n\nAlso Read: Will Dogecoin Price Surpass $0.25 Barrier in April?\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOMjBHZnFZaVlZN3FyTkR4SS05dnA2QVpuaFVjQ05XcGVtM1gwenV0bUVvUnZ4cWhWN2p4Tk9wb1JfUkp1NkNUZi12RlY4UVNJZS13WXFuLXVxczVwLWlhRW4zYkhUUjdHRXVNbmdZVWx3M1QwUl9IVEFtMnA4WXZiYW5COS1vWENJb0pMVjcwc9IBlAFBVV95cUxPc2R4MmUyVHR2aGhGT0owS2VMcFQzUGI3WXNHa193SkMtMnhidFNPcTUxNTVkQVIybWhTUjNyMmxxTlVlay1MYVBUcTZIalN3eWlfMGtxaF8zVGF2S3F1eWRmUGRsMEx5Q2ppTnpZRGpQQk1BOEltWWJmMTZQQkdQdS16Vk5rUlVqeUE3cjNXYU9TTFUz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Apr 2024 07:00:00 GMT",
        "title": "Ethereum’s $15B signal: What Futures say about a return to $4K - AMBCrypto News",
        "content": "Ethereum’s futures open interest show that the coin will reclaim its all-time high in the mid-term.\n\nIts key indicators also confirmed the rise in bullish sentiment in the coin’s spot market.\n\nLeading coin Ethereum [ETH] may be poised for another significant rally in the mid-term, pseudonymous CryptoQuant analyst ShayanBTC noted in a new report.\n\nThe report assessed the coin’s futures market and found that despite the general market consolidation in March, ETH’s funding rates have remained positive, and its open interest has continued to climb.\n\nFunding rates are used in perpetual futures contracts to ensure that the contract price stays close to the spot price.\n\nWhen an asset’s contract price is higher than its spot price, traders who hold long positions pay a fee to traders shorting the asset. Funding rates return positive values when this happens.\n\nConversely, when the contract price is lower than the spot price, short traders pay a fee to traders holding long positions, leading to negative funding rates.\n\nAccording to the analyst, as ETH attempts to reclaim the $4,000 price mark, there has been a “corresponding spike in the funding rates metric.”\n\nThe report added,\n\n“This indicates an aggressive execution of long positions by participants.”\n\nCoinglass data showed that the coin’s funding rate was a positive 0.024% at press time. When an asset’s funding rate is positive and grows, more traders hold long positions. This means more market participants are expecting the asset’s price to rise in the short/mid-term than those anticipating a decline.\n\nRegarding the coin’s futures open interest, its double-digit price rally in the past week has caused this also to grow. Per Coinglass data, ETH’s futures open interest was $15 billion as of this writing. In the last seven days, this had grown by 7%.\n\nAccording to the report:\n\n“Considering these metrics, the market appears poised for another significant move in the mid-term, with the potential for long positions to be reinstated in the perpetual market. This suggests a favourable outlook for Ethereum’s price trajectory, potentially pushing it towards its all-time high.”\n\nAre the bulls regaining their strength?\n\nMarch was significantly marked by bearish sentiments, which caused ETH’s price to consolidate within a tight range.\n\nHowever, readings from some indicators observed on a 1-day chart showed that the rally in the coin’s price in the last week confirmed that the bulls are now attempting to re-enter the market.\n\nFor example, for the first time since 15th March, ETH’s MACD line rested above its signal line.\n\nWhen an asset’s MACD line crosses above its signal line, it suggests that its shorter-term moving average is starting to move upward quicker than its longer-term moving average. This indicates an increase in bullish momentum in the short term.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nAlso, ETH’s Directional Movement Index (DMI) showed that its positive directional index (green) crossed above its negative index (red) on 7th April.\n\nThis confirmed the change in sentiment from bearish to bullish."
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxQTkkwWkJfemU3RHQwNl9jMXZaTjhOcDh4TnlUZDBCVmgzMTJvdU9QLWhGSGhNMEw4R2wzRFNSZmVvSFh1QmY4ZV9jcXA5SHZTZ1czbWR0eDEzbzluaEltWWw3MlNCWnJERmJnTkxydjF3SE94VWxNVjB1ZXdOS0NBZ0FXd2U3V0lEbk9sYVBCdzJwcmV1Z2l2dEFB0gGfAUFVX3lxTFBUSEppQ20yd1ZBYVpYbGF1aDhkOFhEVGhqNzJvVVc4Q0FQX3QtQm5yN3h6U2RRanNCRWdiUDRTVVlxT1IzZG52WWZ2ZU1JNUx1blNIenRaaEphNUJDSjg1amNYeW1BQ1JjS29JNmxudFprclg3WmUzZDFKdFhsTFVYYzdjMERRVWEtQVphV09peDlNdFFLSnc2LUN2Vnp3VQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Apr 2024 07:00:00 GMT",
        "title": "March 2024 Report: Bitcoin vs. inflation, Ethereum NFTs, and April forecast - AMBCrypto News",
        "content": "Context of the article\n\nThe global economy is recovering from the period of saturation, and major indices across the globe are booming. Though inflation has eased in most nations, policymakers warn that achieving the Central Banks’ target of around 2% will be quite hard. Indermit S. Gill, Senior Vice President and Chief Economist of The World Bank Group predicts advanced and developing economies—are set to grow more slowly in 2024 and 2025 than they did in the decade before COVID-19.\n\nSo, the pertinent question – 2024’s crypto boom: Is it a sign of recovery or a bubble in the making?\n\nLet’s find out\n\nFor more than three weeks now, the Crypto Fear & Greed Index has been above the 70 mark. The index ranges from 0 (extreme fear) to 100 (extreme greed), a high value is a warning of a potential market correction. Over the past two months, there has been an unprecedented level of demand – something that the crypto market has never seen in its entire existence.\n\nAMBCrypto’s research report for March 2024 reveals U.S. billionaires have been selling their stocks. Out of all the sales, the much-talked-about has been that of JPMorgan Chase & Co. CEO Jamie Dimon who sold $150 million worth of shares in the banking company for the first time in 18 years. Each billionaire has their own reasons, but it might have something to do with growing interest in cryptocurrencies from big money players.\n\nWhat coins were the March Market Movers?\n\nBitcoin\n\nThe king coin hit a new All-Time-High (ATH) at $73,797.35 on 14 March with its market cap surpassing that of Silver. While analysts have been predicting $100k as the next ATH, the AMBCrypto report argues Bitcoin hasn’t reached its ATH figure yet and investors are trading it with a false sense of achievement in mind.\n\nand investors are trading it with a false sense of achievement in mind. Interestingly, as soon as the coin crossed the $72k level, the Long-Term Holder cohort increased their overall distribution pressure. Consequently, the market saw over $2.6B/day in realized profit .\n\n. Now, if BTC manages to turn the $70k level into strong support, New Yorkers will benefit most from the price surge . It’s important to note the $70k psychological level is a good liquidity area. It has already been tested as resistance multiple times. Thus, strengthening the case for the bulls.\n\n. It’s important to note the $70k psychological level is a good liquidity area. It has already been tested as resistance multiple times. Thus, strengthening the case for the bulls. Meanwhile, the arrival of a Bitcoin spot ETF has been a major boost for the cryptocurrency, with inflows of roughly $12.1 billion by the close of the first quarter .\n\n. The good news is most of the investors holding BTC in their portfolios are profitable, at the moment. As per the Supply in Profit metric, on 1 April, 18M addresses were in profit, this was an increase of 3M from its cycle-low of 15M.\n\nEthereum\n\nWith the Dencun upgrade going live in March , Ethereum unlocked a new level for developers’ growth as the scalability-related challenges and gas fees issue were addressed.\n\n, Ethereum unlocked a new level for developers’ growth as the scalability-related challenges and gas fees issue were addressed. Ethereum’s price has successfully maintained its $3500 support. It reached $4000 recently, the highest point in nearly two years. This could be attributed to various factors, including increased DeFi activity and anticipation of the Dencun upgrade .\n\n. AMBCrypto’s research report reveals that the outlook ahead for Ethereum is positive and the anticipation of a spot ETH ETF could shape its future rally .\n\n. Notably, after a big sell-off on 14 March, the top 10,000 richest wallets bought 42.56 million ETH. This buying spree is expected to help Ethereum have a good start in April 2024 for two main reasons. First, these big investors have a lot of power over the price of Ethereum and can affect how regular people invest too. Second, these wallets usually plan to keep their holdings for a long time, which could mean April might not see a lot of sell pressure.\n\nMemecoins and DePIN sector\n\nIn the past month, meme coins like WIF, PEPE, and FLOKI saw a big surge in their prices, doing even better than popular ones like DOGE and SHIB. Many traders saw their investments surge by triple digits. The trading activity, consequently, reached a peak last seen in November 2021. According to AMBCrypto’s report, many of these traders were hoping to make enough money from meme coins to buy Bitcoin later on.\n\nin their prices, doing even better than popular ones like DOGE and SHIB. Many traders saw their investments surge by triple digits. The trading activity, consequently, reached a peak last seen in November 2021. According to AMBCrypto’s report, many of these traders were hoping to make enough money from meme coins to buy Bitcoin later on. During every big surge in the crypto market, there are popular stories that catch everyone’s attention. For example, in 2017, people were excited about ICO coins and privacy coins. Then, in 2021, DeFi, NFTs, and layer 1s became the big things. Now, analysts predict that during 2024-25, DePIN will be the most important trend in the crypto world .\n\n. Since the start of 1 January 2024, DePIN Market Cap has grown by $35,370.826 million. Solana saw the most significant rise in trading volume among major DePIN projects, with a notable increase of 52% over the past 30 days.\n\nThe biggest loser\n\nAccording to Alex Casassovici, founder of Web3 streaming project Azarus, we are witnessing the first real bear market for NFTs. Indeed, the NFT Sales Volume in the last 30 days has fallen by 8.50% while the NFT transactions have declined by 45.79%. NFT sellers, on the other hand, have increased by 45.25%. Thus, painting a very bleak picture for the overall market.\n\nInterestingly, AMBCrypto’s report reveals a surprising outperformance by Bitcoin NFTs compared to their Ethereum counterparts.\n\nRead Bitcoin’s [BTC] Price Prediction 2024-25\n\nAbout Crypto Market Report – March 2024\n\nAMBCrypto’s latest report is a comprehensive analysis of March’s market trends and it offers valuable insights for predicting market movements in April.\n\nThe report dives into key topics like –\n\nBitcoin vs. inflation\n\nBTC’s next ATH projection\n\nEthereumization of Bitcoin\n\nETH’s price potential\n\nNFT market dynamics\n\nMarket forecast for April\n\nYou can download the full report here."
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxQbXNJakdzTTQ5aXF6U0Ewamp6M2xJQUdScnRoVTZ4S1FhOU9XRDlvWnIxMEh1bVdLdk9TTV9jemhLV244WUJjbGRFaW50bTh1bThDcDd2VjYwMmxWbkVBNHc2eWtOTXJpNkNWTWYyNmp0ckZtX2RtaXk0SFhXWGNLNGttVC1XZ0VUazFhSHZQSdIBlAFBVV95cUxQeW9XcUk1c3VjUXZHVnFCYTFWX3RrU2ZoT2N1bDdIODN4akp0T2phWWxDOFBSNnhNR05aS1ZwTUJmdVNsZFo5NmdlZ3pCWC1iM040aHU5bHdkSXpQOHo0d3Y5Y3htMzR2V0hpdlNTVFVLVmtkcW9DeG95TkUyd0hwOVBhVDYyMm40T0pPeFZNOVpuX3RF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Apr 2024 07:00:00 GMT",
        "title": "$70 million in 24 hours: Can Ethereum crack $4,000 thanks to whales? - AMBCrypto News",
        "content": "Ethereum has seen significant consecutive increases in the past 48 hours.\n\nWhales have bought over $70 million worth of ETH within 24 hours.\n\nOn 7th April, Ethereum experienced its highest returns for the month. This positive uptrend coincided with a recent increase in the volume bought by certain whales.\n\nAdditionally, it occurred while the network’s overall volume remained relatively stable, with Layer 2 (L2) solutions handling most of the transactions.\n\nEthereum increased by 7%\n\nAnalysis of the Ethereum daily timeframe chart revealed that on 7th April, it closed trading with an increase of over 3%, reaching above $3,400. This price trend was notable because Ethereum had experienced significant declines before, making this the first major uptrend observed.\n\nHowever, at the time of writing, Ethereum was experiencing an even larger uptrend with over a 4% price increase. The chart indicates that ETH was trading above $3,600 with this recent surge.\n\nObserving the chart, it was noted that the highest point reached this year was around $4,000. Given the current trend, surpassing this record in the coming weeks is possible.\n\nFurthermore, a study of the chart revealed that the price rise effectively reinstated Ethereum into a bull trend. Data from its Relative Strength Index (RSI) indicated that ETH was now above the neutral zone, signaling a bullish trend.\n\nWhales mop up more Ethereum\n\nAs the Ethereum price continues upward, recent data showed increased buying activity from certain whales. According to Spot on Chain, within the last 24 hours, two whales collectively spent over $35 million to purchase ETH.\n\nSpecifically, these whales acquired 10,322 ETH at an average price of around $3,400.\n\nAdditionally, as the price climbed to approximately $3,455, two more whales withdrew 11,657 ETH, valued at over $40 million, from an exchange. This movement by the whales suggests heightened accumulation, likely in anticipation of further price appreciation.\n\nMore cash flows into ETH\n\nAnalysis of the Ethereum Open Interest trend on Coinglass indicates a recent decline over the past few days. However, there was a slight uptick at the time of writing, with over $13.3 billion in open interest observed.\n\nIs your portfolio green? Check out the Ethereum Profit Calculator\n\nThis suggests that more capital was flowing into Ethereum, potentially acting as a catalyst for further price increases.\n\nWhen considering the current behavior of whales and the uptick in Open Interest, key metrics display positive signs, indicating that a new price level may be imminent."
    },
    {
        "id": 71,
        "url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxOQWRXWnhuamRvLTJCRV9TYlhVd3hCOW9Cb0xoOGZZY3lGTFJZN2pmaHRrdTJJSEctMkg4NE0zV3FSMGdzN1NabW9rMDVhRU1ON0hNVUZrYTNlWGZVVlA4bzR5aEYwb0RVYkdHOHp2XzdLR3RnWUZhVC04YXo5YVRURmREWnoyLXpMN3hGVmhPZ0ZBdnZ1Tmtlb2dRS3pzbG42X19CNGZ4azUxREE2Ykhob25LLVJyWHRfd3ZzSURQSGUzME5GLURtbi1WRUVfT2kwYXh1czdn0gHbAUFVX3lxTE9ZZmZOSFdxcVBOYkQtM0dtYnlXa1Q0NzdYbVFmQzI0ZFRUZkFhY3BCT2RUZDAyQ3hmMnI2VzQ4WURKRWhBa2w1Rm5ESDg5RzdQckQ4RFNvTmtkSnliUGY3azhQaWlDdVBDTURaS2Nya1dGMlktcFFyNXlNcFFRSjJfQlM2Vlh5bzI3TUVEbFI5dXRFRWgwaGhDNnZ0dG9RdGllNnNrdExSalZmQURZOHJadldKRGN4VXdJTHc5SmN6Z19mM1VuTzgzM2t6NVFWSjZWYUNSbXVkbE1nOA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Apr 2024 07:00:00 GMT",
        "title": "Ethereum’s Price Correction Might Not Sustain As Accumulation Increases! Here’s The Next ETH Price Level - Coinpedia Fintech News",
        "content": "As Bitcoin again gained momentum ahead of the halving event, the market is facing increased accumulation from whale investors. As a result, Ethereum has triggered notable surges as it regained its buying demand. Interestingly, several on-chain metrics for ETH have now turned bullish and are defending the ongoing correction on the price chart, aiming to send the ETH price toward resistance channels.\n\nEthereum’s Netflow Defends Price Correction\n\nAfter the BTC price rallied toward $72K, Ethereum witnessed its price surpassing the $3.7K level in no time, resulting in a massive short-liquidation. However, since the Dencun Upgrade in mid-March, Ethereum’s price has struggled to climb back over the $4,000 mark, facing a sharp sell-off.\n\nHowever, with the Bitcoin halving event approaching in less than 10 days, Ethereum traders are showing a notable uptick in leverage use. On April 8, Ethereum’s price saw a 7% increase, sending the leverage ratio to 0.29%, a peak not seen in the past 45 trading days since February 25. This surge in leverage during an uptrend indicates that traders are increasingly borrowing to enhance their positions, betting on Ethereum’s continued rise.\n\nIn the past few hours, the price of Ethereum (ETH) has been dropping significantly. Coinglass reports that there has been nearly $21 million worth of long liquidations in the last four hours alone. Despite the drop, there’s a noticeable increase in accumulation from holders as data from IntoTheBlock indicates that the Netflow metric dipped into the negative region, reaching -17.75K ETH. This suggests that more ETH is being withdrawn from exchanges than deposited, particularly after the price of ETH surged above $3,600.\n\nThis behavior is somewhat unusual during a surge, as holders typically deposit more ETH when they intend to sell, rather than withdrawing it. However, this could potentially strengthen the support levels for ETH’s price, making it challenging for sellers to plunge the price.\n\nWhat’s Next For ETH Price?\n\nBulls failed to hold the price above $3,700 level as sellers defended the resistance level strongly and plunged the price below immediate Fib channels. ETH price is currently declining heavily and is aiming for a retest of the $3,400 level. As of writing, ETH price is trading at $3,506, declining over 3.4% in the last 24 hours.\n\nThe ETH/USDT pair has dropped below the crucial mark of $3,500, warranting close attention. Should sellers successfully hold the price below this barrier, the pair may gain bearish momentum, potentially rallying towards $3,200-$3,300. However, anticipation persists for a bullish comeback at this level as a rebound above the EMA trend line might send the price to retest $3,700.\n\nIf ETH price successfully breaks above $3,700, it will trigger increased purchasing power, resulting in a jump toward $4K. A successful consolidation might strengthen confidence, resulting in further surges for ETH price toward $4,500."
    },
    {
        "id": 73,
        "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxPVGZMY0dUeVptT0hhZloxOThUWEVoYTZEamN3T2VoVTlmUGI3Z3c0b1lOZHc2ODlFX3lzQ0hISjJJSmNfLTY1bFRkbW94ckl3V0tYWkVxc2lNcHN0S245VUZQTlEtOTdyNEZqQnBNM0VMVkp0a2QyVXF4Wm5MZFNaUWwtZG9FMThYQVloQk1sYlR2VmVIYnVNTkxrRm1jNUwxd0VhTmJBQ0ZlRWFy0gGyAUFVX3lxTE9BRERtUXVneEFRdUF4M3UtUGp2dDFkeEduT2lUX19yVUE3R1B5QXJ0QXF5cE9TOGYyekZFWUpDZkoyb1U3RXM4d2xieE0tN1phV3NXTWZlTGk5d21KS1k5ZUt4OGdIT2s3UkdJYjZqaEEyR2tMNUlDNndQbTNyRzVVOWRCekhIMHhyN0FwQ3l2SGtjNkMwVXRzeU0zMEM2dDNJUzg4OTFRc0RhdXBjZlJ2RHc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Apr 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum, and XRP Price Prediction For This Week: What’s in Store? - Coinpedia Fintech News",
        "content": "Sohrab is a passionate cryptocurrency news writer with over five years of experience covering the industry. He keeps a keen interest in blockchain technology and its potential to revolutionize finance. Whether he's trading or writing, Sohrab always keeps his finger on the pulse of the crypto world, using his expertise to deliver informative and engaging articles that educate and inspire. When he's not analyzing the markets, Sohrab indulges in his hobbies of graphic design, minimal design or listening to his favorite hip-hop tunes.\n\nAs the Bitcoin Halving event comes closer, the volatility in the crypto markets grows intense. With the Bitcoin price witnessing sharp fluctuations this week, the altcoins chart a chaotic sea.\n\nAmidst this rising volatility, the top coins like Bitcoin, Ethereum and XRP showcase an opportunity for strong-hearted investors. Bitcoin and Ethereum are projecting a longer bull run based on the prevailing uptrend. In the case of XRP, the prolonged consolidation and the ongoing pullback are approaching a spot of bullish reversal.\n\nSo, will the Bitcoin, Ethereum and XRP price trends enter a bullish frenzy and prove the market predictions right? Let’s look at the detailed price analysis of these tokens for a more educated viewpoint.\n\nGrowing Chances of Bitcoin Hitting $100,000\n\nDespite the recent bullish reversal, the bulls are under pressure, which has led to a side trend in Bitcoin prices. In the 4H chart, the bullish reversal from the 200 EMA fails to sustain above the 50 EMA.\n\nTradingview\n\nFurther, the trend analysis over the past weeks reflects a triangle formation, projecting a contraction in the Bitcoin price range. However, the breakout of either boundary trendline could lead to a massive rally, defining the future trend.\n\nOptimistically, the breakout rally on the upside could drive the BTC price higher to the $100,000 mark. Supporting the bull run, the Bitcoin halving craze and the increased institutional interest might prove as crucial catalysts.\n\nWill Ethereum Take A Bullish Reversal?\n\nTaking a similar route as Bitcoin, the Ethereum price trend shows an intense bear run in the 4H chart. With a downfall to the $3,200 support zone from the peak of $4,000, the sellers are gaining trend control.\n\nTradingview\n\nThe downfall leads to a death cross in the 4H chart and a strong resistance trendline, keeping the bullish reversals under check. Currently, the ETH price trades at $3,338 with a growing sideways trend.\n\nFurther, the lateral trend leads to a consolidation range with an overhead ceiling at the $3,373 mark, aligning with the 23.60% Fib level. Despite the multiple bearish elements, the daily RSI line shows a bullish divergence in the past few dips at the support zone.\n\nHence, with the chances of a bullish breakout, the ETH price could reach the $3,506 level or the 38.20% Fibonacci level. In such a case, the biggest altcoin will reach a pivotal stage and challenge the overhead trendline. Optimistically, the trendline breakout could slingshot the Ethereum token market value to $4,000.\n\nAlso Check Out : Bitcoin Price Facing Crucial Resistance, As Analysts Seek Out Bigger Gains\n\nWill Ripple Mark A Comeback in April?\n\nAfter Bitcoin and Ethereum, the XRP token shows a high potential for a bullish trend this week. Despite the market value being down to the 200D EMA, Ripple’s native token is projecting a potential reversal to the upside.\n\nTradingview\n\nWith a downtick in the 50D EMA, the XRP price is under the $0.60 mark and warns of a death cross. Nevertheless, with the 3% uptick followed by a long-tail candle last night, the daily chart projects a potential reversal in the XRP price.\n\nConsidering the buyers’ ability to sustain momentum, the XRP price is poised for a bull run to the 61.80% Fibonacci level at $0.68.\n\nWhat’s Next For Bitcoin, Ethereum, and XRP Price Trend?\n\nDespite the growing volatility and fluctuations, the market predictions for the top coins remain bullish. Hence, with the ongoing pullback, the sideliners are getting an opportunity to buy the dip before the highly anticipated bull run this April."
    }
]