[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMi6wFBVV95cUxOdkozWlBEcTdJSzdXbExYeUlYRkZRVFNYX3JzQWFSaTZGZGlVS2FlVVJlZ0puNWdVbW9Ua0h2eGg0V3kzOUozUDYtOE52ay1pUHBZQmhMZkVNRmJ1WlN6dy1SbWl3MUIwemJiendPSHNMTGJBSWhSQmwyRkZqYmF3Q1BRWWJiZHN4NldPRUNXaVJhbUJPNUlfSlM5czhOSVpYZHlZWVpnZU80ZlNEdmFlMThac0RBdHJfZFFISHY1a1JLVUZtYjVYNnd5X2JkMW9pV0RRcVBuQlEwNUZkSXdJaFM4UGpVaXd2SkFj?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Feb 2024 08:00:00 GMT",
        "title": "GoDaddy and Ethereum Name Service Simplify Connecting Domain Names and Crypto Wallets for Customers - PR Newswire",
        "content": "Users can now connect their GoDaddy domain with their ENS name for free, seamlessly connecting DNS to ENS and the Web3 ecosystem\n\nTEMPE, Ariz., Feb. 5, 2024 /PRNewswire/ -- GoDaddy (NYSE: GDDY), a global leader in domain registration and web hosting is excited to partner with Ethereum Name Service (ENS), a pioneer in blockchain-based naming systems, to enable domain name users to link their domains to ENS effortlessly, with no additional costs or technical experience required. This collaboration signifies a major step toward bridging the gap between the Domain Name System (DNS) and blockchain technology.\n\nDNS is a naming database that interprets readable addresses (domain names) into a unique string of numbers called an Internet Protocol (IP) address. Similarly, ENS simplifies complex wallet addresses into human-readable names. By connecting the two, it empowers domain owners with the combined security and reliability of GoDaddy, a globally recognized brand, along with the cutting-edge benefits of ENS's blockchain infrastructure.\n\n\"As a long-time domain industry steward, we are always looking for innovative enhancements that benefit our customers,\" stated Paul Nicks, president of domains at GoDaddy. \"Partnering with ENS presents our customers with a unique opportunity to experience the fusion of domains names and blockchain technologies, bringing some great benefits for users in both areas.\"\n\nWhile it has always been feasible to bring domain names over to ENS, barriers like high gas fees have limited the seamless transition. To help, ENS deployed new smart contracts to enable the resolution process of domain names in ENS, at the DNS top-level domain (TLD) level. This allows verification of DNS records, enabling a cost-free method for users.\n\nThis integration not only simplifies user experience but also fosters a sense of trust in digital identities. Domain owners and crypto wallet holders can now enjoy a newfound convenience, effortlessly linking their digital assets for efficient management.\n\n\"With this milestone, we are furthering our mission to build a more secure, decentralized and user-friendly internet,\" said Nick Johnson, founder of ENS. \"ENS, much like DNS, is a public good and a core part of the internet infrastructure. By pairing up ENS names and GoDaddy domains, we will streamline the way users interact with web domains, blending the familiarity of the DNS with the potential of blockchain technology.\"\n\nThis important advancement simplifies the use of digital properties, creating an environment of convenience and trust. Learn more about linking domains at GoDaddy. For additional information about ENS's integration with GoDaddy, click here.\n\nAbout GoDaddy\n\nGoDaddy helps millions of entrepreneurs globally start, grow and scale their businesses. People come to GoDaddy to name their idea, build a professional website, attract customers, sell their products and services, and accept payments online and in person. GoDaddy's easy-to-use tools help microbusiness owners manage everything in one place, and its expert guides are available to provide assistance 24/7. To learn more about the company, visit www.GoDaddy.com.\n\nAbout Ethereum Name Service\n\nThe Ethereum Name Service (ENS) is a distributed, open, and extensible naming system based on the Ethereum blockchain. ENS addresses allow anyone to register a .eth domain which they can then connect to multiple wallets, and use across all of Web3. Founded with an Ethereum grant in 2017 by Nick Johnson, ENS quickly grew as the most widely used permissionless domain name protocol in the world. With over 2 million names registered onchain and over 4 million names offchain, the protocol aims to become the neutral naming protocol for all.\n\nSource: GoDaddy Inc.\n\nSOURCE GoDaddy Inc."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE5SX3FhUkpocG1ubWthQ2NjckpkT3Y3bzlVeFl3dXNrYUN2MXlaYTlvMm5UcnlrMzAzRmlRVUFWRjNWTW5SZjhneEN4UDhoeXRYbjRtY09ybS1KcEdYUmRSUUs4QzdfTlVNdHFvNnd4WlMxMTR3cUlZ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Feb 2024 08:00:00 GMT",
        "title": "ENS partners with GoDaddy to enable users to link wallets to domains - Blockworks",
        "content": "Ethereum Name Service (ENS), a domain naming system on the Ethereum blockchain, has partnered with GoDaddy, a domain registrar, to enable users to easily link their wallets to web pages.\n\nENS can be considered the blockchain-based counterpart to the Domain Name System (DNS) that is widely utilized in Web2.\n\nDNS services assign unique IP addresses to devices, facilitating the translation of these addresses into user-friendly domain names for accessing internet web pages. Similarly, ENS services convert intricate wallet addresses into easily readable names.\n\nThis latest integration with GoDaddy, one of the world’s largest web hosting providers, will allow users to connect their simplified ENS wallet addresses with their DNS.\n\nBridging the gap between Web2 and Web3 comes with its own set of problems, however, like concerns around censorship.\n\nRead more: Ethereum devs consider ‘existential’ upgrade to the EVM\n\nMost recently, Kubi Mensah, the co-founder of Gattaca, noted in a post on X that its domain was suspended indefinitely without any prior notice.\n\nAlthough the issue was resolved after escalating concerns to the senior management of the domain provider, the reason for the suspension was never made apparent.\n\n“We see this incident as a reminder that the fight against censorship is hard but worth every bit of our effort,” Mensah wrote.\n\nGenerally speaking, due to the decentralized nature of Web3 domains, entities themselves can not suspend, take or control an ENS .eth domain, Nick Johnson, the founder and lead developer of ENS, told Blockworks.\n\n“ENS .eth domains are censorship-resistant and tamper-proof by design; even the ENS DAO has no power to revoke or restrict a .eth domain,” Johnson said.\n\nHowever, this latest collaboration is a gateway for Web2 domain users to access blockchain technologies via their domains, and ownership of a DNS domain ultimately remains with the registrar.\n\n“Names that are imported from DNS — using our new integration with GoDaddy or our legacy integration — remain subject to the registrar they are held with, and the rules imposed by the registrar and ICANN,” Johnson said.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxQdmhnVW1QMTNmdkMyaHRzbkx0OEpaTFlLVEdJWTZfb3gwOGEzd0hjLURCenJ1cG5XM1R1bGE0ak9fWGNSbUFEX3BYVkYtT2FleXlhcDZkSWt3akZROXJMdm9OSkM0d2d2SVRsOXl2RnF6cmhMNnZFU195UVlXZS1OZ3oxbmZ6Ql9oamowalJEMndkSXNtZFU4eFRR0gGfAUFVX3lxTE9Kci1QcHJMbXZHLU1oYk9jTDRCQllUaDB0V2RldXE0dlc1YXdZTXRSNjBCRDhLN1FQcjcweVRQUmlyeWFxdU9ncE9uTUZQcmc4Ui0yRkFIMHdPclNHUVcxS0RKa3VQWkUwYm91Uy1xSG4ycnJmSGUtZFZIZ0tIR0U4NlgxNUR4ejR2Z1F3UmVkNWtkWmlqV1AzNGFINkhRUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 04 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Classic (ETC) Aims for $30; Here’s How You Can Profit - Blockhead",
        "content": "Ethereum Classic (ETC) rose by 3.74% on Friday to signal an increase in buying momentum. This built on the positive bounce from the $22.8 support level, as buyers look to reclaim the $30 price mark.\n\nWith the general crypto market still undecided on a trend direction, traders have adopted short term trading strategies. As such, ETC presents a good opening to embark on a bullish run with decent profit targets.\n\nBollinger Bands Support Bullish Thesis\n\nThe short term outlook for Ethereum Classic’s price chart looked positive when examined with the Bollinger Bands (BB). The lower band at the $23.7 price range acted as a dynamic support over the past 48 hours, allowing ETC to break above the mid-way point of the band.\n\nThis opened up the Bollinger Bands with price expected to trend upwards. Furthermore, the RSI (Relative Strength Index) highlighted the growing bullish momentum, as buyers flipped the RSI positive with a strong push above the neutral 50 level.\n\nETC/USDT on TradingView (4H Timeframe)\n\nWith price currently trading at $25, short to medium term traders can enter a long position with a first target level of $27.6 and a second target level of $31.2. Both levels would return gains of 10% and 25% respectively.\n\nWith the long term outlook also looking bullish as evidenced by multiple bull candle closes on the daily timeframe along with the RSI remaining above the neutral 50, buyers can confidently expect to register gains on ETC in the near term.\n\nEntry & Exit Price Levels\n\nCMP: $25.22\n\nTarget 1: $27.6\n\nTarget 2: $31.2\n\nDisclaimer: This article does not constitute trading, investment, financial, or other types of advice. It is solely the writer’s opinion. Please conduct your due diligence before making any trading or investment decisions."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMi9gFBVV95cUxQVV9uVl9IUFNXZGVjS3R5UDg3MExYR3NZUGlEVE4tcWx4RUFVZ09nTU8wbG44YUZfdjUtLUJOYW1wVUtSSl95dzZxZDhqRU9UUnNqRkFiLTBGWTduZGRxTGk3MnBLSlg5blBFSlFsRUgwYmRseVppVDNSaThxX25RSWpBc0poemdjdDZJZm8wRWFaVmw3REJGSGVHeVNQdTVhZWRtYWItb2k3STRGN3FTNm9USjNtREdwRjNNdmpNY1ZkdjF2dVJSVEhvUlIyZTNhcTRrQndPTnpIWGxPUC1DR0dDTk1MQ2J0bXIyVlFPdDRNZVN4NFHSAfsBQVVfeXFMTkRmNy1QazhKRTF3bXJma09mUjJPNmpORV85aXVLVThXTC14RTJCcDVpajFyRk15MDdueDFWVjRHanZtVXZQUWdfcVVLaUthZV9ZekdzVHhnbjJCNzZsSWM3RXFGX3FaUFZsRTZnRUZRZ3dpWkoyeGV4NEVpenpicWtTOTVSbXRZVUdIUWhIMW42bFpPMG01RE9PWnZ2b1dsdllnMzdzOS1jUFFibGstM19SYnF2UTZVaHdjRzcxYXowOF93MU5ra1pXTW5KdHBJMU14RTN2QXJTdUx4RmhBT0g1MGhudWpkazNGbWVrZ2h6OFFzelNOZGVITTA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Feb 2024 08:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: BTC to record rash move soon as Bollinger Bands contract - FXStreet",
        "content": "Bitcoin price could fall 5% to the support confluence between 100-day SMA and horizontal line at $40,650 as boring chop continues.\n\nEthereum price could revisit $2,200, a 4% correction, as the 50-day SMA proves impenetrable.\n\nA retest of the October lows around $0.4734 seems likely for Ripple price as XRP token holders show weakness.\n\nBitcoin (BTC) price continues to record a boring chop, trading horizontally, with altcoins such as Ethereum (ETH) mimicking the price action. Meanwhile, Ripple (XRP) price continues to suffer in the hands of unmotivated traders.\n\nAlso Read: Week Ahead: Crypto markets to turn volatile as AI steals the spotlight\n\nBitcoin price likely to fall 5%\n\nBitcoin (BTC) price is trading within a range, consolidating between the centerline and the upper band of the Bollinger indicator at $41,895 and $44,210, respectively. With the two Bollinger bands contracting, BTC could record an impulsive or rash move soon.\n\nThe Relative Strength Index (RSI) is closely bearish, teasing with a cross below the signal line (yellow band). The Moving Average Convergence Divergence (MACD) also appears subdued with miniature volumes on the histogram bars. This is also reflected in the Awesome Oscillator (AO), tilting the odds in favor of the bears.\n\nIf the bears have their way, Bitcoin price could descend 5% to find support due to the confluence between the 100-day Simple Moving Average (SMA) and the horizontal line at $40,650. If this level fails to hold as support, BTC could extend the fall into the demand zone between $38,496 and $39,582. A break and close below the midline of this order block at $39,196 would confirm the continuation of the downtrend, potentially going as low as the $37,800 support.\n\nBTC/USDT 1-day chart\n\nConversely, if bulls have their way, Bitcoin price could shatter past the upper band of the Bollinger indicator at $44,210. This could see BTC climb to $48,000, or in a highly bullish case, tag $50,000, nearly 20% above current levels.\n\nAlso Read: Bitcoin price gains strength as GBTC outflows shrink\n\nEthereum price could drop to $2,200\n\nEthereum (ETH) price action is almost similar to that of BTC. It could fall 4% to $2,200 as overhead pressure due to the 50-day SMA continues to build. The Proof-of-Stake (PoS) token’s price has made multiple attempts to breach this supplier congestion level to no avail.\n\nWith the RSI below 50, the AO and MACD in negative territory, and below the latter’s signal line (orange band), the odds favor the downside. Ethereum price could slip past $2,200 to test the 100-day SMA at $2,203. In a dire case, the fall could see ETH dip into the demand zone between $2,059 and $2,118.\n\n\n\nETH/USDT 1-day chart\n\nOn the other hand, increased buying pressure could see Ethereum price overcome the 50-day SMA to confront the $2,388 barrier. Flipping this into support could restore Ether into the ascending parallel channel, a gateway to more gains.\n\nAlso Read: Ethereum monthly transaction count climbs to highest level since July 2022\n\nRipple price looks for pullback as XRP holders show weakness\n\nRipple (XRP) looks ready to fall as it is stuck below the foothold of the midline of the descending parallel channel. Increased selling pressure could see XRP price retest the October lows around $0.4734, with technical indicators showing an unmotivated holder community. This is seen by the waning momentum on the RSI below 50 and the position of the AO and MACD in negative territory.\n\nXRP/USDT 1-day chart\n\nOn the flipside, enhanced buyer momentum could see XRP price breach the resistance due to the midline of the channel, bringing the $0.6000 psychological level into focus.\n\nAlso Read: XRP price trades broadly unchanged leading up to crucial milestone in SEC vs. Ripple lawsuit"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE1tU0NqSU5sV2NHYW1ENVBoV2xjdXpQbG9XNFozeTkwbnVFNk9JdWw1OXZYR0k3Qm1RazBpSFFZdkloSTA4QU12QWdXUkN3NE1SRGtHcWd3LVhjMENTUDBic3oyUU9uMFRrQmM1R0JPMGt1Q01UMGZtdm8yNmtVUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 04 Feb 2024 08:00:00 GMT",
        "title": "Top 6 Ethereum Facts: Everything You Need to Know - Global Crypto",
        "content": "Reading Time: 4 minutes\n\nEthereum, or ETH, as it is more commonly called, is one of the biggest cryptocurrencies out there. At $459.16 billion, it is the second biggest crypto by market cap, next only to Bitcoin. It holds 18.4% of the total cryptocurrency market cap. One Ether token is currently valued at $3,520.23. However, there are many more facts to know about Ethereum and its features. In this article, you can also get free Ethereum.\n\n6 Biggest Ethereum Facts\n\n1. It Was a Crowdfunded Project\n\nThe concept of Ethereum as a cryptocurrency came to life in 2013, just four years after the birth of Bitcoin, the first cryptocurrency. Ethereum was the brainchild of Vitalik Buterin, who was a co-founder of the Bitcoin online news website at the time. However, funding was one big challenge to the Ethereum project at that time.\n\nIt came at a time when crypto and crypto trading were still relatively unknown, and only Bitcoin was in the game. In 2013, the almighty Bitcoin started at just $13, so it would have been tough for a newcomer to convince big investors to fund the project.\n\nThat same year, many companies, particularly start-ups, were turning to crowdfunding as an alternative funding source, and the Ethereum team did the same. Ethereum turned to the masses to fund the project. By the end of the crowdfunding period, which was on June 1, 2018, they had been able to raise $4,100,000,000, which is worth 7.12 million ETH. It became the biggest crowdfunded project ever. No one saw it coming, but they were able to pull it off. In the end, it was a win-win for everyone. Happy investors, happy Ethereum team!\n\n2. Ethereum Has No Limited Availability\n\nTo preserve the currency’s rarity and value, many cryptos usually have a fixed number of coins that will ever be in circulation. Bitcoin, for example, has a maximum supply of 21 million, meaning that only 21 million Bitcoins will ever exist; no more can be created or mined. Binance Coin (BNB) has a limited supply of 166,801,148, and Solana (SOL) is limited to 488,630,611.\n\nWell, this does not apply to Ethereum. In other words, Ethereum does not have a limited supply. As of August 2022, over 121.97 million ETH were already in circulation, which means it had already passed Bitcoin’s supply limit by 100 million coins. This is good news for anyone seeking to invest in ETH.\n\nOf course, the founders still put some limits on the supply of Ethereum; it’s not exactly unlimited in the full sense. Like Dogecoin, which has a cap of 5 billion DOGE per year, Ethereum has a cap of 18 million ETH per year, which means only 18 million new ETH can be created in a year.\n\nMoreover, the amount of ETH in circulation is also expected to decrease over the years because of the EIP-1559 burn mechanism, which was designed to address congestion.\n\n3. Ethereum Has an Ice Age Feature\n\nEthereum has an Ice Age feature, but it’s not what you think. This feature is not related in any way to the animated movie “Ice Age.” It is a little bit more “techy.” Ethereum’s Ice Age feature is also known as “the difficulty bomb.” It is a mining adjustment mechanism added to the Ethereum network to help them reach their goals of switching from Proof of Work Ethereum 1.0 to Proof of Stake Ethereum 2.0 by increasing the difficulty of mining new ETH over time. This Ice Age feature was originally added to the Ethereum 1.x blockchain in 2015.\n\nThe rationale for the inclusion of the Ice Age feature is that when Ethereum was first created, its founders initially wanted it to run on the Proof of Stake consensus algorithm. They tried to avoid Proof of Work altogether, but the technology was not quite there yet, and they had to settle for Proof of Work until they could sustainably move to Proof of Stake. However, Ethereum does not want to settle with Proof of Work forever, so they added the Ice Age feature to make things difficult for miners.\n\n4. Ethereum Is More Than a Crypto\n\nYes, Ethereum is the second biggest crypto, but the Ethereum network is much more. The network can host Decentralized Applications, or dApps, as they are popularly known. dApps are just like any other applications we use on our computers except for one thing—they run on the Ethereum network. dApps are just software applications that run on a distributed network. They are not hosted on a centralized server but on a peer-to-peer decentralized network.\n\nThe rationale for dApps is that the current way of dealing with app information is a situation where the owners of the apps have access to information about your social life, health, finances, and everything you do on the internet in exchange for providing you with their services or letting you use their apps. These owners can even completely block you from accessing your information and end their services with you. But with dApps, nobody gets to control your information or monopolize it. dApps decentralize control of information to provide internet freedom and do it with Ethereum.\n\n5. Ethereum Is Inspired by Anime\n\nWhile Ethereum has evolved to become a very complex technological invention, it originated in anime. Vitalik Buterin, the founder of Ethereum, was inspired by Hayao Miyazaki’s anime “Laputa: Castle In The Sky,” where one of the anime’s heroes used a magic crystal called “Aethereum” to extract energy from the air.\n\nThat’s where the inspiration for the second biggest crypto was born.\n\n6. Ethereum Has Gone to Space\n\nBelieve it or not, Ethereum went into space in 2021. That year, SpaceChain launched the first Ethereum node in space through a SpaceX Falcon 9 rocket launched from NASA‘s Kennedy Space Center.\n\nSpaceChain launched its first Low Earth Orbit (LEO) satellite into space in 2018, claiming that the satellite switch is cheaper than geostationary monitoring.\n\nThey use these satellites as blockchain nodes to store, process, transmit data, and develop applications.\n\nExtending the Ethereum network to space is a way to increase blockchain technology’s decentralization and improve its security and resilience.\n\nConclusion\n\nEthereum has become one of the most prominent players in the crypto space, not by being average. What we have discussed in this article are only a few of its unique features; there are still more technological advancements that have made Ethereum stand out. But Ethereum is not stopping anytime soon. With Ethereum 2.0 and the help of the Ethereum community, we expect to see more."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiX0FVX3lxTE9ER09QN1JrbnpYazBRWmdmS1pGalFxR1hUZFZEbGFTaTh2alZZLXd1VVREQS15anZ1Y2ROLWlhTmZXa1lSYlVkSGJUUHktdUlUTFl6d1NfczIzM1djLWpZ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Feb 2024 08:00:00 GMT",
        "title": "Gitcoin is restructuring to focus on grants for the Ethereum ecosystem - Blockworks",
        "content": "Gitcoin, an open-source software funding platform, has announced it will shift focus away from public goods funding and towards enhancing grants infrastructure designed for the Ethereum ecosystem.\n\nSince its launch in May 2021, Gitcoin’s organizational hierarchy has been relatively flat, with no CEO calling the shots. Workstreams, or focused groups dedicated to specific tasks or projects within the organization, have always required budgets to be approved through community voting — an often time consuming process.\n\nAs the DAO has evolved, however, it morphed from an impact-focused organization to something more technology-centric. Gitcoin executive director Kyle Weiss told Blockworks in an interview that this did not align well with the existing DAO structure.\n\n“It was too disjointed,” said Weiss. “In a DAO environment where everyone is fully remote, we have folks contributing from nearly every continent — stability, operations, and software development is really important, you need a core group of individuals who have context.”\n\nRead more: Gitcoin’s co-founder wants to return from the sidelines\n\nAs part of the new restructuring plan, two business units have formed within Gitcoin. One unit will focus on coordinating product-specific work, while a subDAO will manage matters of community and governance.\n\nWeiss noted that over the years, the company has experimented with various products. He said that some of these have been distractions, while others have been valuable to its growth.\n\n“A lot of 2024 is focusing on grants. We want Gitcoin to be much more associated with grants, whereas right now, our narrative has been around public goods funding, and that shift is because we’ve moved from being an impact organization to a technology organization,” Weiss said.\n\nFor this reason, Weiss explained the DAO will transition from independent workstreams towards a structure more akin to a “Labs” structure. This is something that is common among existing protocol development teams, similar to how Uniswap has Uniswap Labs or how Optimism operates with OP Labs.\n\n“We want to make sure there is stability in the software development side and then give the DAO material scopes of work to own,” he said.\n\nWeiss says that by granting software development teams greater leadership and more defined decision-making powers, the community can remain concentrated on achieving results through the grants programs via token voting.\n\n“I don’t know if the token holders are the right people to decide on multi-year roadmap decisions on the technology side,” Weiss said.\n\nGitcoin co-founder Kevin Owocki shared this sentiment.\n\n“It’s not proven that DAOs can develop software, so the Labs team is designed to recognize that in our organizational structure, and make sure that we’re building world-class software.”\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxOX09ScEpEb19pYkhFbmVOQjIwRW5oMXJqcTdrMGtCX25lbmtxZHJJZHk4ZUotMnl6OUJNdExVVkdQWGotNDFReVQzaURiaDE3VFhlY29tckJLWVJjUmxUd0lMQzZia3daamlOQlJINVZpLUJMX0RQak03S2pRNnZWUHpwLURiQdIBjgFBVV95cUxPUUFsMk8tVkY5dm5KWi02WlFSVk55eEQwSnV2THRUX25DeHdWNEZLRDZKWnZHbk1HeUlJZzlPZUpPZnhkNXdtX2NYdXRJLVlXRnhwTHdSWVNiSEtpZFhWd3JLMzR6SHluN1BVeEVkRHdXMXhuMHdoeXFzM3NlSExmZzJZX3V1QmRRQlVUS2Fn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Feb 2024 08:00:00 GMT",
        "title": "What Is Farcaster and Why Is Crypto So Excited About the Twitter Alternative? - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIn the last two years—particularly, since Elon Musk’s divisive purchase and overhaul of Twitter in late 2022—a number of upstart decentralized social media protocols have attempted to harness the transparent, uncensorable power of blockchain networks to improve the online social experience.\n\nFarcaster is the latest such project to do so. Now, it’s making waves after releasing a key update that has attracted thousands of new users in a matter of days. Here's why Crypto Twitter is so optimistic about this new potential replacement.\n\n(Video by Rug Radio Creator Benjamin White.)\n\nAD\n\nAD\n\nWhat is Farcaster?\n\nFounded by Coinbase alums Dan Romero and Varun Srinivasan in 2020, Farcaster is a social media protocol built on Optimism, the Ethereum scaling network. On top of the public and decentralized Farcaster ecosystem, users can create (and have created) a slew of integrated apps that perform various social media functions.\n\nThe most popular app built on the Farcaster network is Warpcast, a Twitter-like platform for writing posts (called “casts”), following other users, and liking or sharing (“recasting”) those users’ posts. Though a slew of apps currently live on Farcaster, Warpcast accounts for almost half of all sign ups across the entire protocol, according to on-chain data from Dune.\n\nMost of Farcaster’s most popular accounts are major players in the crypto space: Ethereum co-founder Vitalik Buterin, Ethereum core developer Tim Beiko, and Base creator Jesse Pollak.\n\nFarcaster shares its main selling points with other decentralized social media protocols: a lack of censorship, control over one’s data, and seamless interoperability of accounts across all apps built on the network. That’s opposed to, for example, the lack of interconnectivity between accounts on Twitter and Instagram.\n\nOne element that particularly distinguishes Farcaster from other social media protocols is the network’s emphasis on eliminating bot activity. To sign up, users must pay a $5 sign-up fee, meant to prevent the creation of spam accounts. Further, users can only post a limited number of “casts” on Farcaster apps, which are tied to packages called storage units.\n\nAD\n\nAD\n\nStorage units, which go for $5 a piece, grant a user 5,000 casts, 2,500 reactions, and 2,500 links or photo posts within a one-year period. Users who wish to buy additional storage units to post more can do so via a fairly technical and complicated process. This storage unit structure was designed to prevent Farcaster apps from being inundated with the millions of bot comments and likes that plague traditional social media platforms like Twitter.\n\nBut far and away, the most popular innovation on Farcaster is called Frames—and it upended the protocol’s trajectory overnight.\n\nWhat are Frames?\n\nLaunched on January 26, Frames are a new Farcaster feature that allows users to perform a suite of functions, both on-chain and off-chain, within Farcaster apps—without exiting to a third party.\n\nOn Warpcast, for example, users scrolling through a feed of casts can now click on a Frame posted by someone they follow, and perform a variety of functions—including minting NFTs, browsing an art gallery, playing games, subscribing to newsletters, and making online purchases—all while staying in their feed.\n\nSome popular Frames include “Girl Scout Cookies,” which enables one-click purchases of the popular dessert, “Nethria,” a text-based monster combat game, and “NFT Mint,” a gasless NFT drop.\n\njust came across one of the coolest new features in social media that I've seen in a decade not being dramatic, it's actually genius@farcaster_xyz Frames TL;DR - you can embed an \"iframe\" (not fully) into your tweets (casts) and people can interact with them without leaving… pic.twitter.com/30e9lgGkfa — mert | helius.dev (@0xMert_) January 28, 2024\n\nFrames is powered by Farcaster’s EdDSA authorization system, which already underlaid the Farcaster ecosystem. According to Farcaster co-founder Dan Romero, that structure eliminates the possibility of wallet drains, spoofing, and other malicious crypto hacks.\n\nAn easy to miss part of frames is it's powered by Farcaster's EdDSA auth system. 1. UX — every Farcaster user already has an EdDSA in the app they are using whether Warpcast or Supercast or something else. Every Farcaster client supports frames under the hood. And for… — Dan Romero (@dwr) January 29, 2024\n\nAD\n\nAD\n\nCurrently, on-chain functionality for Frames is limited to Ethereum-affiliated networks. As soon as next week, however, Farcaster’s founders have indicated the protocol will expand to support Solana.\n\nFarcaster is easily my favourite app in crypto right now and it's now coming to Solana 😱 colossal hint: with Farcaster Frames (embeddable actions into posts) — Solana is the **only** way to go from frames -> onchain without a backend OPOS pic.twitter.com/qrxte8okiy — mert | helius.dev (@0xMert_) February 2, 2024\n\nWithin days of introducing Frames, Farcaster exploded in popularity. The ecosystem, which typically supported around 2,000 daily users in recent months, quickly shot up over 1,300% in activity, to an average of over 28,000 daily users by Monday, according to data from Dune.\n\nThe volume of casts and likes on the platform has increased exponentially over the same period, from an average of 100,000 daily engagements just weeks ago, to over 2.3 million on Monday.\n\nAll in all, just north of 125,000 users have signed up for Farcaster so far—a statistic that pales in comparison to mainstream social media platforms, but nonetheless marks a substantial milestone for an on-chain network that has yet to cater to non-tech savvy users.\n\nEdited by Andrew Hayward"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxOU0FmWERSOEF4My1PUWFDX0lSMy1pQ0s0MDZfWmx0cWsyaFMtZmdDeFRTdEEzazB3UkVjR1R1c0dLOFhYZEk4TURQN1YybGlLMm0tR0RLbk5ra0lGZTZ4Qzk0UjVlLW9uY0d1ZzJlVDF5MzlYN3E2X1hpdjAzX0gzM19nZS1RNzRkMVpPU1JlLXdXNUNDVllINW4zR2h0dGZSMDJF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Dogwifhat: some crypto-wallets pocket over $1.3 million - The Cryptonomist",
        "content": "During the weekend, it seems that some crypto wallets that collected a large supply of the Ethereum version of dogwifhat (WIF) pocketed over $1.3 million. The incident suggests that these are apparent “insiders” of the project.\n\nEthereum Dogwifhat: 12 probable insider crypto-wallets of the project pocket over $1.3 million\n\nOn Saturday, it seems that the Ethereum version of dogwifhat (WIF) was pumped and then dumped within a few hours, showing some suspicious data.\n\nAnd indeed, it seems that there are 12 crypto-wallets that, thanks to their wide supply of the memecoin version Ethereum, have managed to pocket a whopping 1.3 million dollars.\n\nThe suspicions suggest that these crypto wallets are apparent “insiders” of the project. This is confirmed by the on-chain analysis tool Lookonchain, which shows that these crypto wallets have purchased 24 million Ethereum WIF tokens for 3,000 dollars in ETH.\n\nThe purchase took place in the same block in which the deployer opened the negotiations, which implies that the trader knew exactly when the tokens would be issued and traded.\n\nAnyway, on Saturday, the Ethereum WIF went from prices of fractions of a cent to 30 cents in just a few hours, and then crashed by over 80%.\n\nEthereum Dogwifhat: word from the creator\n\nAlways on Saturday, on X, the issa account came forward, claiming to be the creator of the crypto dogwifhat.\n\nAs many of you know, I originally created the meme you all know as \"dogwifhat\". It recently gained a ton of traction within the crypto space, most notably through a coin named $WIF that launched on Solana, currently trading at $270M~ market cap.\n\n\n\nWith so many of you reaching out… — issa (@issa) February 3, 2024\n\n“As many of you know, I originally created the meme that you all know as ‘dogwifhat’. Recently, it has gained a lot of popularity in the cryptocurrency space, especially thanks to a coin called $WIF, launched on Solana and currently traded with a market cap of 270 million dollars. Since many of you have contacted me and the $WIF team has never recognized me as the original creator, I wanted to clarify that I have no affiliation with them and I have never owned or received any allocation. Today I officially announce that I will launch the REAL $dogwifhat, but on Ethereum. The website explaining the origin story of dogwifhat is directly linked below this text. If you are not familiar with the cryptocurrency space, please proceed with caution, this is not financial advice. All other tweets following this can be found on the official website @dogwifhat_eth”\n\nIn practice, the Ethereum version of dogwifhat is not connected to Solana-based WIF, which was launched at the end of November.\n\nSeventh crypto in the “Meme” category\n\nMeanwhile, looking at the meme crypto ranking by market capitalization, the dogwifhat (WIF) based on Solana blockchain is in seventh place.\n\nWIF has a total market cap of over 217 million dollars, not far from the other meme cryptos like FLOKI (265 million dollars) and MEME (227 million dollars).\n\nOn the memecoin scene, the dominant one is Dogecoin (DOGE) with over 11 billion dollars of market cap, followed by SHIB with 5.2 billion dollars and BONK with 655 million dollars.\n\nIn the last month, WIF Solana-based has seen a price pump of 97%, with the price going from $0.09 to the current $0.21. However, during the month, its highest recorded price was $0.45."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxNWmI0bndHdFFpbC1fV1RpZDlScUVKc21tRmRxbEV2XzRoNjhLd1lsUE5FdUJZVGdfdE5WeHlONGhoMlhWVV9PNmNIcERUUHFNY1RXd0s0ek0wU0NTcmtPRkItRkM5Tngxb2ZhOE9aMEJwcm84VDI1czRNd2k2bXNEbUxTb3NRZ0pjRVI4SjdnNm5ud01GeE1IODlsYmZfNEtB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Feb 2024 08:00:00 GMT",
        "title": "Bybit Report Predicts Ethereum Rebound in 2024 - Canada NewsWire",
        "content": "DUBAI, UAE, Feb. 5, 2024 /CNW/ -- Bybit , the world's third largest crypto exchange by volume, has released a new report reviewing the hottest trends in 2023, digging into the reasons behind them, and exploring what is to come in 2024.\n\nIn 2023, among several sectors studied, AI tokens have been the standout performers, outperforming most asset classes including Bitcoin and big tech. This remarkable performance underscores the burgeoning interest in AI technologies and their increasing integration into blockchain applications.\n\nBybit Report Predicts Ethereum Rebound in 2024\n\nAs the market evolves, Bybit boffins anticipate that BRC 20 tokens built on top of Bitcoin will take the limelight as more communities explore Bitcoin's utility as a base-layer.\n\nIn addition, Bybit's analysis suggests that tokens connected with the Decentralized Physical Infrastructure (DePIN) sector, including those used in computing, are expected to hold stable prices in the face of potential selling pressures. This stability is indicative of the sector's resilience and the sustained demand for decentralized privacy and networking solutions.\n\nFinally, this anticipated shift could signal a reconfiguration of market dynamics and investor confidence in Ethereum's long-term prospects.\n\nFor more detailed insights and the full report, please visit here.\n\n#Bybit / #TheCryptoArk\n\nAbout Bybit\n\nBybit is a top-three cryptocurrency exchange by volume with 20 million users established in 2018. It offers a professional platform where crypto investors and traders can find an ultra-fast matching engine, 24/7 customer service, and multilingual community support. Bybit is a proud partner of Formula One's reigning Constructors' and Drivers' champions: the Oracle Red Bull Racing team.\n\nFor more details about Bybit, please visit Bybit Press .\n\nFor media inquiries, please contact: [email protected]\n\nFor more information, please visit: https://www.bybit.com\n\nFor updates, please follow: Bybit's Communities and Social Media\n\nDiscord | Facebook | Instagram | LinkedIn | Reddit | Telegram | TikTok | X | Youtube\n\nSOURCE Bybit"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxNdkh0dTltMWVTcjNvWU42Nk1aTnJyM1Jaek9fbE5CbGtHT2plUjhwaFZYcDNIWklTdkJHWmJlbTdyNXRJNnlCWVZtbEFrUTJucl9kT1dGMVh0OGNmckpPUGtHdE0zMmZCTnNNcXc1cTliemZCOUNMX0Q1THd4UnVldktFQmJaVEpEVzNYRElBZU9PMW5wWnY2enZ4M21JVUk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Feb 2024 08:00:00 GMT",
        "title": "Mollars ICO & What You Need to Know About Ethereum Blockchain’s New Bitcoin - CryptoPotato",
        "content": "The official Initial Coin Offering [ICO] for the Ethereum blockchain token “Mollars” launched on Monday, November 21st. The token price starts at $0.30 in the first phase.\n\nMollars is a hybrid cryptocurrency that will be an alternative to Bitcoin as it’s a store of value tokens. There will be a difference, however, as it’s starting a decade after BTC was first introduced to the world.\n\nWhat are Store of Value Tokens and Coins?\n\nLike Bitcoin, Mollars aims to be a store of value that’s in high demand, and the founder will not hold tokens privately. Possibly as high as 99.5% of today’s cryptocurrency founders have a personal stash of tokens that was likely introduced to investors through the ‘fine print’ in the crypto brand’s whitepaper.\n\nIn Mollars whitepapers, it’s clearly stated that no party involved in the development of this token will be given tokens. A complete 100% of the tokens generated by the founder and developer team will be put onto the crypto market and exchanges.\n\nAnother attribute that makes Mollars a store of value, like Bitcoin, is that it will be fully decentralized.\n\nThe founder will not own the brand. The creator of the token created infrastructure and formulas to give the token longevity, but the enigmatic figure will have no control over the token once it has been released on top crypto exchanges.\n\nMollars ICO and Potential Exchange Listings\n\nThe first exchange that Mollars will be listed on is Uniswap, the world’s #1 decentralized crypto exchange. If the ICO reaches its goal of US$ 2 million dollars, it will have a listing day price of US$0.62.\n\nThe 62-cent listing would mean today’s first-round ICO investors would get ROI Yields of over +200%.\n\nThe price of the listing day could be weaker if the US$2,000,000 milestone is not met with the Initial Coin Offering fundraising.\n\nWith 15,661 tokens sold since its debut on November 21st, the Mollars ICO listing is averaging a daily buy rate of just over 2,610 tokens. At this rate, it would take the Initial Coin offering a substantial amount of time to complete. However, the ‘buzz’ is building, and that daily buy rate is expected to increase.\n\nAnother reason users might begin buying more is the crypto token’s founder’s recent release of the white paper and mission statement. One of those statements includes a ‘catalyst’ to expand the Mollars brand via product.\n\nBitcoin Had a 10-Year Head Start… So Here’s The Catalyst\n\nThe new ERC-20 token will be a necessity for those who wish to use Mollars developers’ coming mystery web3 product. This decentralized app [dApp] will launch in early 2024 at the same time as the hybrid tokens launch on its first major crypto exchange.\n\nWhat exactly is the dApp Mollars will launch? It’s not yet clarified but the web3 ‘goody’ is being believed to target P2E gamers and metaverse enthusiasts of the Ethereum blockchain world.\n\nMollars ICO in 2024\n\nThese claims by the new ERC-20 token’s developers have left some analysts to believe today’s first round ICO investors could generate more than just the typical listing day gains.\n\nAs the Mollars token is being offered at US$ 0.30 cents today, it will list on a major crypto exchange in second quarter of 2024.\n\nMany new tokens see gains when listed on new cryptocurrency exchanges, but having an actual product could lift the token.\n\nICO & Tokenomics\n\nSpecifics for the ICO launch and post-listing plans have been made clear based on the fundraising goal being met successfully. A total of 4,500,000 tokens will be sold. Mollars initial coin offering will have 4 funding rounds. The price of the token pre-exchange will increase with each round incrementally.\n\nFirst-round investors will have the best opportunity to buy Mollars tokens at the previously mentioned rate of US$0.30. After a modest 200,000 tokens have been sold, the second round will begin.\n\nThe ICO price for second-round token investors will be US$0.40, which is a substantial increase. A maximum of 300,000 tokens will be sold in this second stage before the price is bumped upward again in the third round.\n\nAs popularity grows, the supply available in the ICO’s third round will more than double to 700,000 $MOLLARS tokens. By this third round, Mollars will have the first details and possibly a preview of their web3 product.\n\nIn the fourth round of the ICO, investors will have to pay half a dollar to buy tokens early.\n\nIn the 2 rounds following the fourth, the token presale will increase by US$0.05 each round. Specifically, 5th-round investors will have to pay US$0.55 per token, and 6th-rounders will have to buy tokens at a rate of US$0.60 each.\n\nThe total token supply that will be sold in the Mollars presale totals 4,000,000 crypto coins.\n\nAfter the ICO presale is completed, the $MOLLARS coin will appear on a top crypto exchange quickly — according to public plans.\n\nLearn more about the ICO and this new hybrid token at their official website — www.Mollars.com.\n\nDisclaimer: The above article is sponsored content; it’s written by a third party. CryptoPotato doesn’t endorse or assume responsibility for the content, advertising, products, quality, accuracy, or other materials on this page. Nothing in it should be construed as financial advice. Readers are strongly advised to verify the information independently and carefully before engaging with any company or project mentioned and do their own research. Investing in cryptocurrencies carries a risk of capital loss, and readers are also advised to consult a professional before making any decisions that may or may not be based on the above-sponsored content.\n\nReaders are also advised to read CryptoPotato’s full disclaimer."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiXkFVX3lxTE1xUlZqdUkyQm9fYVdvV3dYM2I0OVVTUEJsalVXNDFoWUVlYmtFS0YzNVlpMHRyYm1LNTVtRTAzb1lUSEpzUGZPdXY3Q01mdmhBZWhCOFd3SEpPVE5mRXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Feb 2024 08:00:00 GMT",
        "title": "How to Invest in Ethereum - Moneyland.ch",
        "content": "Ethereum (ETH) is the second-largest and best-known cryptocurrency after bitcoin (BTC). This moneyland.ch guide explains how you can invest in Ethereum.\n\nWhat is Ethereum?\n\nBitcoin clearly dominates the cryptocurrency space by a wide lead. But when ranked with all other cryptocurrencies excluding bitcoin, Ethereum holds first place. The cryptocurrency, which was first introduced at the North American Bitcoin Conference in Miami, currently has a market capitalization of 237 billion Swiss francs (as per February 1, 2024).\n\nStrictly-defined, the term Ethereum denotes the entire blockchain-based infrastructure. The cryptocurrency that enables transactions within the Ethereum platform is called Ether. However, the term Ethereum is widely used to describe the cryptocurrency as well.\n\nUnlike bitcoin, the Ethereum blockchain does not limit the number of Ether that can be generated. Ether is used to settle payment transactions on the platform. Ethereum is best known as a platform for smart contracts – transactions that are performed automatically when predefined conditions are met, without the need for an intermediary.\n\nTable 1: The biggest cryptocurrencies by market capitalization in Swiss francs\n\nCryptocurrency Market capitalization Bitcoin CHF 720 billion Ethereum CHF 237 billion Tether CHF 83 billion BNB CHF 39 billion Solana CHF 36 billion\n\nDate: 01.02.2024.\n\nHow can I invest in Ethereum?\n\nIf you are interested in investing in Ethereum, there are a number of different ways to do it:\n\nBuy Ethereum at ATMs or stores: A number of Swiss cryptocurrency service providers sell Ethereum at vending machines and in certain stores.\n\nA number of Swiss cryptocurrency service providers sell Ethereum at vending machines and in certain stores. Buy Ethereum online: There are many Swiss online service providers that you can use to buy Ethereum online.\n\nThere are many Swiss online service providers that you can use to buy Ethereum online. Exchange Traded Notes (ETNs): ETNs track the price of Ethereum and enable you to profit from price growth without having to buy actual Ethereum.\n\nETNs track the price of Ethereum and enable you to profit from price growth without having to buy actual Ethereum. Ethereum futures ETFs: These ETFs invest in futures – contracts used to speculate on price developments.\n\nThese ETFs invest in futures – contracts used to speculate on price developments. Contracts for difference (CFDs): CFD’s based on the Ethereum price can be used to speculate on positive or negative price developments. Typically, CFDs use leverage, and this exposes you to a lot of risk. For this reason, CFDs generally are not recommended for inexperienced investors.\n\nWhat are the possible costs of investing in Ethereum?\n\nExchange rate markups: All Ethereum service providers and trading platforms use their own exchange rates to calculate the price of Ethereum in Swiss francs. The cost of buying Ethereum largely depends on how high the dealer’s markup over the market price is. Make sure to compare the rate offered with the market price before you buy Ethereum. Even a platform that does not charge fees at all can still be more expensive than other platforms if it uses an unfavorable exchange rate.\n\nAll Ethereum service providers and trading platforms use their own exchange rates to calculate the price of Ethereum in Swiss francs. The cost of buying Ethereum largely depends on how high the dealer’s markup over the market price is. Make sure to compare the rate offered with the market price before you buy Ethereum. Even a platform that does not charge fees at all can still be more expensive than other platforms if it uses an unfavorable exchange rate. Transaction fees: Most trading platforms change a fee every time you buy or sell Ethereum. You also pay a fee – a brokerage fee – when you buy or sell ETNs using a stock brokerage account.\n\nMost trading platforms change a fee every time you buy or sell Ethereum. You also pay a fee – a brokerage fee – when you buy or sell ETNs using a stock brokerage account. Total expense ratios (TERs): Before investing in Ethereum using an ETN (more on this below), you should make sure to compare the total expense ratios (TERs) of Ethereum ETNs. The TER shows the ETN’s ongoing fees, which detract from investment performance.\n\nHow can I buy Ethereum offline?\n\nYou can buy Ethereum at some brick-and-mortar stores and at special vending machines. Simplicity is the main advantage: You can buy Ethereum and pay with cash (or other payment methods, in some cases), without having to first open an account with a service provider. The main disadvantages of buying Ethereum at brick-and-mortar outlets are the high fees and the poor exchange rates.\n\nTypically, you receive a QR code which lets you access an Ethereum wallet that contains the Ethereum you purchased.\n\nTable 2: Swiss service providers for buying Ethereum offline\n\nService provider Are payments in\n\nCHF possible? Limits for Ethereum\n\npurchases Fees Bity ATMs Yes, in cash. Euros are\n\nalso accepted. CHF 1000 per 30 days.\n\nHigher limits with identity\n\nverification. CHF 2 plus 3.5% to 9.5% of the\n\ntransacted amount, depending\n\non the ATM. Cryptonow cards\n\n(Värdex) Yes. The cards are\n\navailable at various\n\nretail outlets, including\n\npost offices, Coop\n\nsupermarkets, and\n\nstores in the Valora\n\ngroup (including\n\nK Kiosk and Avec). CHF 1000 per 30 days 9.9% of the transacted amount,\n\nplus a CHF 1 activation fee. Tibc ATMs Yes, in cash. Euros\n\nare also accepted. CHF 1000 per 30 days.\n\nHigher limits with with\n\nidentity verification. Variable. Värdex ATMs Yes, in cash. Euros\n\nare also accepted.\n\nFor purchases at the\n\ntill at Värdex partner\n\nstores: Debit cards\n\nare also accepted. CHF 1000 per 30 days.\n\nHigher limits with with\n\nidentity verification. CHF 1 plus 6.5% to 10% of the\n\ntransacted amount, depending\n\non the ATM.\n\nWith the exception of Bity, all of the Swiss companies included in Table 2 are registered with Finma. Date: 01.02.2024.\n\nHow can I buy Ethereum online?\n\nThere are many different Swiss online service providers from which you can buy Ethereum online. Most platforms require you to open an account before you can buy Ethereum through them, and that involves some time and effort. The advantage is that the fees are usually much lower than those charged for offline purchases.\n\nTable 3: Swiss service providers for buying Ethereum online\n\nService provider Bank license Are payments in CHF possible? Fees Bitcoin Suisse\n\n(minimum account\n\nbalance: CHF 100,000) No Yes, by bank transfer. 0.95% of the transacted amount. Bity No Yes, by bank transfer (verified\n\ncustomers can also pay with\n\nVisa or Mastercard). 1.2% of the transacted amount\n\n(0.8% for verified customers). DFX No Yes, by bank transfer. 1.49% of the transacted amount. Lykke No Yes, by bank transfer. None. Mt Pelerin No Yes, by bank transfer. Card\n\npayments are also accepted,\n\nbut with a fee of 2.5% to 3.4%. No fees for the first CHF 500 per\n\nyear. A fee of between 0.9% and\n\n1.3% applies to transactions above\n\nthat amount. Lower fees apply to\n\nholders of Mt Pelerin tokens. Smart Valor No Yes, by bank transfer, debit card,\n\nor credit card. 1.29% to 8.9%, depending on the\n\namount transacted. Swissborg No Yes, by bank transfer. Card\n\npayments are also accepted,\n\nbut with a fee of 2.25%. 1.49% of the transacted amount.\n\nLower fees apply to holders of\n\nSwissborg tokens. Swissquote Yes No, only EUR or USD accepted\n\nfor Ethereum purchases. You\n\ncan fund your Swissquote\n\naccount with CHF by bank\n\ntransfer. Debit cards and credit\n\ncards are also accepted, but\n\nwith a fee of 1.9%). 0.5% to 1%, depending on the\n\namount transacted.\n\nWith the exception of Bity, all of the Swiss companies included in Table 3 are registered with Finma. Date: 01.02.2024.\n\nWhat are Ethereum ETNs?\n\nThe principle of exchange-traded notes (ETNs) is similar to that of exchange-traded funds (ETFs). Like an ETF, an ETN aims to replicate the performance of an underlying asset – Ethereum in the case of Ethereum ETNs. These notes enable you as an investor to participate in price growth without buying actual Ethereum. You can invest in ETNs using a stock brokerage account at a bank, as with ETFs. ETNs are passively managed and are best suited to investors who only want to participate in the price developments, without actually holding Ethereum.\n\nThe difference between an ETN and an ETF is that an ETN is not an investment fund, but a promissory note that gives you a debt claim against ETN’s issuer. Your investments are not protected if the issuer goes bankrupt because unlike ETF shares, ETNs are not classified as segregated assets.\n\nThe titles of many ETNs include the abbreviation ETP, which stands for exchange-traded product. This is a broad term that covers many different assets that are traded on stock exchanges, including both ETNs and ETFs.\n\nWhich Ethereum ETNs are there?\n\nThere are many different Ethereum ETNs available to Swiss investors, but the selection varies depending on which stock brokerage account you use.\n\nTable 4: Ethereum ETNs ranked by costs (TER)\n\nETN ISIN Domicile of ETN issuer TER CoinShares Physical Ethereum GB00BLD4ZM24 Jersey 0.00% 21Shares Ethereum Core ETP CH1209763130 Switzerland 0.21% WisdomTree Physical Ethereum GB00BJYDH394 Jersey 0.35% Global X Ethereum ETP GB00BLBDZW12 Jersey 0.65% SEBA Ethereum ETP CH0587418630 Switzerland 0.75% VanEck Ethereum ETN DE000A3GPSP7 Liechtenstein 1.00% Ethereum Staking ETP CH0454664027 Switzerland 1.49% ETC Group Physical Ethereum DE000A3GMKD7 Germany 1.49%\n\nDate: 01.02.2024.\n\nThe ETNs included in Table 4 all use physical replication, meaning the issuer holds actual Ethereum as collateral.\n\nApart from the TER, you should also pay attention to the brokerage fees and custody fees charged by your bank. Typically, the fees for ETNs are the same as those for ETFs.\n\nCan I invest in Ethereum using ETFs?\n\nUnlike bitcoin, there are not yet any ETFs that replicate the market price of Ethereum. Currently, you only have the option of investing in Ethereum futures ETFs, which speculate on future price developments. These ETFs invest in futures.\n\nWhat are the risks of investing in Ethereum?\n\nInvesting in cryptocurrencies like Ethereum can potentially yield high returns, but it more closely resembles a lottery than a genuine investment. The prices of cryptocurrencies are very volatile, and there is no sure way to predict future price developments. Substantial losses are possible over both short terms and long terms, and a total loss cannot be ruled out. Ethereum can be used as an additional component to further diversify your investment portfolio. But it should never be a major part of your portfolio.\n\nYou should be especially careful with leveraged CFDs. Using these is identical to betting on the Ethereum price. Because a part of the investment is paid using a loan, you can end up losing more money than the amount you invested. These products are generally not suitable for inexperienced investors.\n\nMore on this topic:\n\nHow to buy bitcoin in Switzerland\n\nHow to pay with bitcoin in Switzerland\n\nShould I invest in bitcoin & Co?\n\nHow to invest money in Switzerland"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxNS3dVVkl4U3pScm5uLUlGS3ltSENoWGVEeUJqVXlOTU0ybENkcHZwSGs3blRqaktFSnBkRTlaTXlvdllXZ0VHcWFMQTZVODF0Ykh4T1hzaUZkM3JOQjhyakhPR0FzTHZyaDY1WmlTcDlKb1Y2eHpWd2lrcW1pT2dlek0yMTBpOWNHcTRMREV5SnlRcF9YbDFSX1dGamnSAaIBQVVfeXFMTkx2eXVNclRNWWFoc0VONF9fclJSRG94NS1mNDRXYURwZWJBU2hHdFdQLXd4UEFfeUhRNmg1RHNJNlBXa0hmZnNqb3ROLWZXbk95aXVPOFQwc0V5WWRWMzdwQ1c1VE5OQ2tjRTFaX1FRd3l4Sm1lYUJlSThsZVFId3lCYVN5NlFQQTdTQXRVd0lTRFo2T3U1NF91WEwyckVRSmVn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Feb 2024 08:00:00 GMT",
        "title": "Ethereum in the Spotlight- Sell-Offs, SEC Decisions, and Technical Signals - News Welcome",
        "content": "Ethereum, the second-largest cryptocurrency by market cap, finds itself in the middle of a myriad of critical events that are likely affecting its price and future outlook. Here is a glimpse into the recent billion-dollar sell-off, the SEC’s stance on a major ETF proposal, and a brief technical analysis for a comprehensive understanding of Ethereum’s current landscape.\n\nA Billion-Dollar Sell-Off Causing a Stir in the Ethereum Market\n\nA recent large-scale sell-off involving 459,561 ETH, valued at approximately $1.014 billion, by crypto financial services firm Celsius sent shockwaves through the Ethereum ecosystem. This massive transaction, primarily directed towards Coinbase Prime and Paxos Treasury, has raised concerns about Ethereum’s price stability and liquidity. While Celsius retains a significant ETH reserve, the market is reacting cautiously while observing how Ethereum absorbs this major outflow.\n\nSEC Holds the Cards while the Ethereum ETF Debate Continues\n\nTo add another layer of uncertainty, the SEC has hit pause on BlackRock’s proposal for a spot Ethereum ETF. This delay in the decision that was initially targeted for February indicates the SEC’s cautious approach towards crypto investment offerings. The future approval or rejection of this ETF is perceived to hold significant weight as it will likely influence investor sentiment and market movements.\n\nAnalyzing Potential Paths for ETH\n\nLooking at the technical side, Ethereum’s current indicators paint a mixed picture. The RSI (Relative Strength Index) suggests neutrality, while the stochastic %K hints at some bullish momentum. The CCI (Commodity Channel Index) leans towards a growing bullish trend, but the low ADX (Average Directional Index) indicates a lack of strong trend direction. Meanwhile, MACD and Awesome Oscillator readings are further confirming current bullish signals.\n\nSupport levels of $2295.48 and $2375.39 stand ready to cushion potential price dips, while resistance looms at $2573.47 and $2691.64. The 10-day and 200-day Simple Moving Averages (SMAs) at $2226.37 and $2358.42, respectively, suggest there may be a possible consolidation phase.\n\nPrice Predictions- Where Does Ethereum Go From Here?\n\nPredicting Ethereum’s price movements would require circumnavigating a complex interaction of technical indicators and fundamental developments. The SEC’s eventual decision on the ETF proposal and potential commissioner comments regarding the pending approval will no doubt have a significant impact on investor sentiment.\n\nFrom a technical perspective, immediate support and resistance levels will play a crucial role. A bullish scenario could see Ethereum test $2691.64, possibly reaching $2700 if the ETF receives approval. On the other hand, the recent sell-off and ETF delays might push prices toward $2375.39, with a further break likely to test $2295.48.\n\nHope vs. Caution for Ethereum- Final Thoughts\n\nOverall, Ethereum stands at a critical stage. Technical indicators present a balanced picture with hints of potential growth, particularly if the ETF receives a green light. However, the billion-dollar sell-off and regulatory uncertainty stress upon the need for caution. Investor sentiment and regulatory decisions will ultimately determine Ethereum’s path forward, keeping everyone on their toes for the time being.\n\nIt is pertinent to mention that this information is for educational purposes only and should not be considered financial advice. It is advised to conduct your own research and due diligence before making any investment decisions.\n\nhttps://www.investing.com/news/cryptocurrency-news/ethereum-eth-becomes-target-of-massive-1-billion-selloff-whos-responsible-3292047\n\nhttps://www.tradingview.com/news/cryptodaily:b6d7ba892094b:0-is-ethereum-s-stability-at-risk-after-a-gigantic-1-billion-sell-off/\n\n\n\n\n\n"
    }
]