[
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiYkFVX3lxTE80c01MTFBWdXp3YlJFNEZmWENraktsZGdTWF95UE5pSkNwNWhsSUo4ZnlFVGpFSWdTcTJfclgxd1NTVDQ4SEJBY0swZGRvLXQyZHRiNDlGTDFqbUE0bXBwUkFB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 23 Feb 2024 08:00:00 GMT",
        "title": "Grayscale: Ethereum’s Dencun upgrade driving price upward - crypto.news",
        "content": "While a possible spot Ethereum ETF approval looms ahead, Grayscale experts believe an upcoming technological improvement is behind recent price upticks.\n\nGrayscale research analyst William Ogden Moore said in a Feb. 23 report that Ethereum’s Dencun upgrade has most likely triggered rallies in Ether (ETH) prices. According to CoinMarkerCap, ETH is up 34% in the last 30 days and 28% year-to-date per TradingView.\n\nEthereum’s Dencun upgrade, scheduled for March 13th, 2024, represents a major step forward and could help Ethereum compete in terms of scalability with faster chains in the Smart Contract Platforms Crypto Sector, such as Solana. We believe that recent price performance reflects the market’s anticipation of this upgrade. William Ogden Moore, Grayscale research analyst\n\nETH 30D price chart | Source: CoinMarketCap\n\nYou might also like: Coinbase calls on SEC to approve Grayscale’s spot Ethereum ETF\n\nDencun promises to uplift throughput and reduce transaction costs, allowing users to spend less gas fees and make more transactions on ETH’s mainnet and layer-2 scaling solutions like Arbitrum.\n\nDevelopers plan to achieve this key overhaul via proto-danksharding, introducing data blobs.\n\nMoore’s report suggests that Ethereum could seize greater smart contract business share from competitors like Solana if the network can offer cheaper fees. Moore opined that this might unlock a multi-billion market tied to real-world assets.\n\nIf Ethereum can simply become more competitive in throughput and cost, it could position itself to capture smart contract applications that demand high levels of security and censorship-resistance like stablecoins or tokenized financial assets. William Ogden Moore, Grayscale research analyst\n\nGrayscale’s bullish outlook on ETH and its blockchain complements the investment firm’s bid for a spot exchange-traded fund following its successful GBTC conversion last month. According to Yahoo Finance, the company hopes to do the same with its Grayscale Ethereum Trust (ETHE), which holds over $7 billion in assets under management (AUM).\n\nThe U.S. SEC delayed a decision on Grayscale’s application till May, along with several other issuers.\n\nETH YTD chart | Source: TradingView"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTFBVMlpLRTBLakdmSmM0eFBIU21wWEw4LXJ2N3dEeXNQbmtwMGhKVGFLNUIxTEVRUjVyRjBWcHI5QjYtS3ZXcnc3Z1hENmFzWHpUR0hrU0xubGRucDBiUDhLWG9yMjhoOWNtR1UtcW1PSVM4VXBUTDJPaTFMV2tqQdIBgwFBVV95cUxQTnFISkx3WWhrQVhxc1lsOE5WdWRwRndfekpQWkRYbVZYaHcyT3RHR010V2dzWVg3YXBvc3RiVFMtVGxZV2RpZzYtWHllSkFQbHY0c3JKZDFqV2FKY2tQUFFMRE1jUU5KQ1ZsM0RFbHdhclk3MXBJQ2J3a0pudGtXc0xBQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 24 Feb 2024 08:00:00 GMT",
        "title": "Reddit invests in Bitcoin and Ethereum ahead of IPO - Forkast News",
        "content": "Reddit, the popular social media platform, has invested in Bitcoin (BTC) and Ethereum (ETH) as part of its treasury management strategy.\n\nThe company’s initial public offering (IPO) filing with the U.S. Securities and Exchange Commission (SEC) on Feb. 22, also mentioned the acquisition of ETH and Polygon (MATIC) for virtual goods sales.\n\nReddit’s potential IPO is anticipated to be one of the largest tech IPOs of the year, although the company has not yet disclosed the number of shares to be sold or the price range for the offering.\n\nThe S-1 filing unveiled that select Reddit moderators and users could participate in its IPO via a directed share program, diverging from the norm of shares being predominantly bought by large institutional investors.\n\nReddit’s foray into the cryptocurrency market is part of a larger vision to integrate blockchain technology into its network of forums and discussions.\n\nThe social media platform has a history with blockchain technology, though not always successful.\n\nLast year, Reddit announced the shutdown of its community points program associated with its MOON cryptocurrency."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxQdWtXbC1kaEtKcjZ2c09sNHRsMWFqbGdabTE3bHo3dWlXTjlpaHVMaW1MeV9ldHZRRmUxRElxeGhRODJjX2xpeGdFcmVKT0ExU2g5RV9Ka0JBenF0WC1sUmFfV1FOVGtjNGQ4eXQ0amY3SEV2dGxyMWtWV05hWWp6SDlUdFBCZnhFRjh6SjRBMTRmZk9JUUVmSjNaYUU0Q0dkby1R0gGoAUFVX3lxTFBsQWV3MDBJWmJrb3lBbExsSjBLRW1sUzdxZzhUYTFmZHNrRFdOR1BsMFNCaWFOcTc3U0swbFZ0THN4LVRiMl9uVkVfZXJ5R0R0ZFB4VVY3S3ZPTkc0OVhRREV4RUxVMU1GYTl5dVdmLVlGZ0ltMzNnaTNsUTVpSmNaYkZweG5mYmlqaUxxWmV3cFJuNm9Xa3VpcjJ0Sm9LWHo4N0l0OEVkbg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 24 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Competitor Avalanche (AVAX) Suffers Five-Hour Network Outage - The Daily Hodl",
        "content": "Prominent layer-1 blockchain and Ethereum (ETH) rival Avalanche (AVAX) has suffered a five-hour network outage.\n\nAccording to Avalanche data-tracking platform Avalanche Status, the blockchain went through an outage that prevented blocks from being accepted on its primary network.\n\n“Developers across the community are currently investigating a stall in block finalization that is preventing blocks from being accepted on the primary network. Updates will be posted here as the issue is investigated.”\n\nHowever, the issue has since been resolved as of Friday morning due to an update.\n\nAccording to Patrick O’Grady, Ava Labs’ vice president of platform engineering, upgrading to AvalancheGo v1.11.1 solved the issue, which was rooted in node validators excessively communicating.\n\n“Please upgrade your node to AvalancheGo to v1.11.1. This release disables logic added in v1.10.18 that led to validators sending an excessive amount of gossip to each other.\n\nAvalanche Validators provision a stake-weighted bandwidth allocation for each peer and this buggy logic led to each node saturating their allocation with useless transaction gossip.\n\nThis dynamic prevented pull queries issued by the validator from being processed in a timely manner and led to consensus stalling (as no polls were being handled).”\n\nThe outage had little impact on the price of AVAX, which is trading for $35.55 at time of writing, a 1.85% decrease during the last 24 hours.\n\nEarlier this month, Solana (SOL) – another layer-1 competing with ETH – also suffered a five-hour outage, causing crypto exchange UpBit to suspend deposits and withdrawals of both SOL and SOL-based products at the time.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMibEFVX3lxTFBrNmFTQXNVRmJsamlTLWdVeS15N3pWMnNxdjlMZWQ5ZG40UVpWWW5SYlZmamRsdE9fRHJyZThlNmo2RC1XVVVMSGNVY0VjUVpZLTliYU1CSEN0ZTlIZy1vRGZvYXVCczFDS0EteA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 24 Feb 2024 08:00:00 GMT",
        "title": "Is It Too Late to Buy Solana? - Yahoo Finance",
        "content": "The crypto ecosystem has gone through several dramatic changes in the past few years. In 2020 and 2021, the industry was driven by hype and speculation only to crash in 2022 and early 2023. There was no better example of this hype cycle than Solana (CRYPTO: SOL).\n\nIt peaked at more than $250 per token and dropped below $10 per coin after the collapse of FTX. But this continues to be one of the lowest-cost and highest-throughput blockchains in the crypto ecosystem, and if you think the innovation and disruption of crypto is from utility and not just speculation, this is still a cryptocurrency to hold long term.\n\nImage source: Getty Images.\n\nWhat people do in crypto matters\n\nThe health of a blockchain can be seen in the activity of developers and users. This can be judged by developer activity. Solana reports 2,500 to 3,000 developers consistently, short of only Ethereum (CRYPTO: ETH) at about 6,000 developers.\n\nOn the user side, transactions per second is a great gauge of how much activity there is on a blockchain. Solana averages between 3,000 and 4,000 transactions per second compared to a blockchain like Ethereum at around 13 transactions per second.\n\nThese two factors together will give you an idea of the health of the blockchain itself. If developers are building it and users are using it, the blockchain has a likely chance of growing in the future.\n\nETFs and the future of crypto investing\n\nWe have seen billions of dollars flow into the crypto industry over the past month after the approval of spot Bitcoin exchange-traded funds (ETFs) by the Securities and Exchange Commission. This led to speculation that Ethereum will be the next to get an ETF and more cryptocurrencies may follow.\n\nSolana could get an ETF if Ethereum is approved. It has similar characteristics and smart contracts to Ethereum and has strong institutional and consumer interest.\n\nBut I don't think it's likely Solana will hold a place like Bitcoin in the crypto ecosystem. Bitcoin is more like digital gold that investors simply want to hold long term, whereas Solana is more of a utility coin for the blockchain. But there could be buyers for both kinds of assets.\n\nSolana's uncertainty\n\nThe one downside of Solana is the coin itself is not as important to the ecosystem as it is to something like the Ethereum blockchain. Yes, there's a proof-of-stake element to Solana, but a lot of transactions simply happened with USDC stablecoin as the medium of exchange.\n\nThe future of Solana may be driven by a USDC-denominated token or some other fiat-backed token, and not the Solano cryptocurrency that we see today. This may mean less upside with the cryptocurrency itself, despite being the native coin to the blockchain.\n\nStory continues\n\nGiven all of these factors, I think the biggest reason to be bullish on Solana long term is the fact that this is where innovation development and transactions are taking place on the blockchain today. There's more activity and innovation on Solana than almost any other blockchain. And activity and USDC we are using the Solana blockchain for normal financial transactions without even knowing it in the future. That will be a truly disruptive future, and is a great reason to buy Solana.\n\nIs it too late? I don't think it is.\n\nShould you invest $1,000 in Solana right now?\n\nBefore you buy stock in Solana, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Solana wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\n\nSee the 10 stocks\n\n*Stock Advisor returns as of February 20, 2024\n\nTravis Hoium has positions in Ethereum and Solana. The Motley Fool has positions in and recommends Bitcoin, Ethereum, and Solana. The Motley Fool has a disclosure policy.\n\nIs It Too Late to Buy Solana? was originally published by The Motley Fool"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxOTE9BWm9yZVNVbFI1cW9UN2p0SUd2bzNiS1M1SXNNbjg2dlkwUm9Yc045aEhFdU83S0NUc3lXYUdScGVzSVhkS2xMcDhxUTRZVlhoT0NCZzIzOEpGOVlocG9LSS12YnBuVHFUSFIzVk5HNzJQdnZhNUx5UEhGdE00SGNVTHN4TkhoRFhBdzRGNUtRRGpCRlFmekxXYndJM2IyOXV5NnVYVmstN25rVWo4ZWlDTXRURVZIYmRLTmJ4YmIwbGdVckp3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 24 Feb 2024 08:00:00 GMT",
        "title": "Crypto Market Price Analysis Today: Ethereum (ETH), SingularityNET (AGIX), NEAR Protocol (NEAR), CELO, COTI - Blockchain Reporter",
        "content": "[ccpw id=60415] is facing significant resistance around the $52,000 mark, which may signal an upcoming short-term pullback. The market witnessed a withdrawal of approximately $36 million from Bitcoin-focused exchange-traded funds (ETFs) on February 21, as reported by sources like BitMEX Research. However, this trend reversed on February 22, with the ETFs experiencing net inflows of nearly $251 million.\n\nMarket analysts, including the well-known trader and analyst Rekt Capital, suggest that the market might be preparing for a correction ahead of Bitcoin’s halving event in April. Drawing parallels to the bull markets of 2016 and 2020, Rekt Capital speculates that a pattern of a pre-halving dip followed by a post-halving accumulation phase could unfold. The reluctance of Bitcoin to extend its upward trajectory has triggered some investors to cash in profits on certain altcoins. Such corrective actions are deemed beneficial for the market’s long-term stability as they weed out weaker participants, thereby providing opportunities for more committed investors to buy in at lower prices.\n\nWhat are the key support levels that we should keep an eye on for Ethereum and other leading altcoins? We will dive into the charts of the top 5 cryptocurrencies to discover more.\n\nEthereum (ETH) Price Analysis\n\n[ccpw id=60480] attempted to breach the significant $3,000 resistance level but encountered strong opposition from sellers. Though the price declined toward $2,900, it recovered from the low. Currently, ETH price is trading at $2,973, surging over 1.2% from yesterday’s rate.\n\nThe market is witnessing efforts by sellers to initiate a pullback towards the breakout point of $2,700. This level is crucial, especially since it’s in close proximity to the 100-day Exponential Moving Average (EMA) on the 4-hour price chart.\n\nA vigorous rebound from $2,700 would suggest that the bulls have successfully converted this level into a support zone, setting the stage for another push to overcome the $3,000 barrier. A breakthrough could send the ETH/USDT trading pair towards the $3,100-$3,300 zone.\n\nOn the flip side, for the bears to undermine the bullish momentum, they would need to consistently drive and keep the price below $2,700. Should this occur, the pair could potentially fall below moving averages. A decline to such depths might send the ETH price toward $2,400.\n\nSingularityNET (AGIX) Price Analysis\n\nAGIX price continued its upward trend after surpassing the $0.6 resistance, setting its sights on the $1 mark as the next upward milestone. However, bears attempted to hinder progress at $0.85.\n\nIf the bulls manage to hold their position near this level without significant losses, it suggests strong buying interest on minor pullbacks, enhancing the likelihood of an advance to $1.\n\nOn the downside, the initial support is found at 20-day Exponential Moving Average (EMA) at $0.68, followed by $0.6. Should these support levels fail to sustain, the correction might extend to the 100-day Exponential Moving Average (SMA) at $0.48. Holding above this crucial threshold is vital for the bulls, as a breach could indicate a shift in the prevailing trend.\n\nNear Protocol (NEAR) Price Analysis\n\nThe extended lower shadow of the NEAR candlestick indicates that investors continue to see any drops to the Fib levels as an opportunity to buy. As a result, NEAR price continued breaking above resistance lines and is now nearing the ascending line.\n\nInvestors are making efforts to keep the price over the immediate resistance level of $3.8. Should they succeed, the NEAR/USDT trading pair might surge to the crucial resistance point at $4.6. At this juncture, a fierce contest is anticipated between buyers and sellers. However, if the buyers come out on top, the price is likely to climb to $6 next.\n\nConversely, a sharp decline from $3.8 would show that the sellers are effectively protecting this threshold. A fall below the 20-day EMA would indicate a decline in buying pressure.\n\nCelo Price Analysis\n\nSellers attempted to push Celo price back within the symmetrical triangle pattern, but buyers aggressively defended the level. As a result, the price jumped above $0.88; however, bears defended that level. As of writing, CELO price trades at $0.825, surging over 5.7% from yesterday’s rate.\n\nThe 20-day Exponential Moving Average (EMA) at $0.79 is showing signs of a gradual increase, and with the Relative Strength Index (RSI) standing above 62, it suggests that buyers are gearing up for a rally. A successful move past the $0.88 mark could send the CELO/USDT pair toward the resistance zone of $0.9 to $1.\n\nHowever, this bullish scenario could be challenged if the price declines and falls below the moving averages, signaling that sellers are capitalizing on every slight upward movement. A breach below $0.76 could further amplify selling pressure.\n\nCoti Price Analysis\n\nCOTI has experienced a slight downturn within an upward trend, indicating that short-term traders might be cashing in their profits. However, buyers are focused on extending the uptrend above $0.18.\n\nThe upward trajectory is supported by a climbing 20-day EMA (at $0.11) and an RSI that is approaching overbought conditions, signaling that the market momentum is still predominantly bullish. A jump in price and a subsequent climb above $0.18 would confirm that the upward trend is continuing. Following this, the COTI/USDT pair might aim for a target of $0.35.\n\nConversely, should the price decline further and fall below the 20-day EMA, a level that could potentially entice buyers. However, if selling pressure outweighs buying interest, the pair might drop to the consolidated zone of $0.1."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxPa1lRT3pwVzBlNmtjdlAxN2lTazdvQVl0bF9obVRyMTMtMWNFRWVMc3dqYjBUZXRucG44ZHNEUWVSRmdTWUY1SVpnLUxRb2dVQlNWWDNuVnVpZzNiYmZiUndnOUZZRUxaQmhsNEV1T0R2dFJBZGcxVm1PUmxyaHZPbkp4MVV0Q0xVWTdabXdHX3BXOVlaTWlfUGVEN25hUEktcE9v?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 23 Feb 2024 08:00:00 GMT",
        "title": "Superfluid Secures $5.1M to Fuel Ethereum-Based Token Streaming - Crypto Times",
        "content": "Superfluid secures $5.1 million in funding, spearheaded by Fabric Ventures, to innovate real-time crypto transactions on the Ethereum platform. Drawing support from prominent investors, the recent funding round for Superfluid underscores the market’s robust confidence in its innovative vision.\n\nWith the launch of “distribution pools,” the platform heralds a new era in efficient one-to-many crypto streaming. Moreover, Superfluid’s approach to scaling, with its “super tokens,” promises a seamless transaction experience. This innovation allows for predictable gas costs, even as the number of recipients scales up.\n\nStrategic Growth and Community Governance\n\nWith a focus on the Ethereum ecosystem, Superfluid is poised for strategic expansion. The team, primarily engineers, plans to boost its marketing efforts with fresh capital. Additionally, the possibility of a native token launch remains open, reflecting the protocol’s community-first approach.\n\nSuperfluid’s strategic funding and innovative offerings are setting new standards in the crypto transaction space, backed by a strong ethos of community governance and scalable solutions."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxOZWRpNmFaRC1qRHNKbUY2c25TdGk0QmExQ2Y4UUtIdzdvNlNWb1VQTHNOVXhsbnkzQy1LVGtXLWR1NnFaRE1rOGVQZTEySHhONk9sYVlDTktuS1NvMGJKMzlKbjQ2eUt5dkFyVjBrWjZaeWFheWwzazg0S1FlWTVjRlpEQ0phMktaMlVIeEJFaGMwaXY5MjBPVEJzZmJuSXI0a0l1ekdEWmRJV2JqNDZ5MElUMUFxZ9IBuwFBVV95cUxQY3ppN3BjaVhfMGhYT1RjbVdIUzY0LWt4aXBRY052WE5fRGFIb1lzZkFkZFJNYUNGSnhDOG80bGk2dkh0blJSREV6WmZQMEZwT3BmRVNTNXY0R1pmR2llUlpCWDU3N19ZY3N0SWp0UE5XX1dPczl2S3FhZ3pOd2h6ZzMyUDRPdk9vS19tMHo0REFHTnc3RXl4MWJLdkRJNzYwWUNLa1o4WXYzcFpwWEFieXkwMnNTMmRIZmow?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 23 Feb 2024 08:00:00 GMT",
        "title": "Dogecoin (DOGE) 'Hidden Golden Cross' Might Surprise You, Ethereum (ETH) Breaks $3,000 Barrier, How Long Will Solana (SOL) Stay Bearish? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nDogecoin is showing a gleam of technical optimism. The recent crossing of the 100-day and 50-day EMAs is a small version of the much celebrated 50-200 EMA golden cross, often regarded as one of the most bullish signals in technical analysis.\n\nThis mini golden cross, while not as definitive as the classic version, still gives traders a reason to pay attention. Historically, such crosses have been precursors to potential uptrends. For Dogecoin, the price has been oscillating around this crossover region, suggesting a tug-of-war between bears and bulls.\n\nDOGE/USDT Chart by TradingView\n\nDogecoin's current support level can be spotted around the $0.077 mark, which aligns with the 100-day EMA. Should this level hold, it could act as a springboard, reinforcing the bullish sentiment brought about by the EMA crossover. On the flip side, if this support falters, we might see a dip toward the $0.070 threshold, where previous market activities have shown interest.\n\nIf Dogecoin can capitalize on this mini golden cross, the next target would be to test the resistance at $0.088. A break above this level with sustained volume could set the stage for a continued upward trajectory, with the $0.10 psychological barrier as the next significant milestone.\n\nAdvertisement\n\nEthereum finally scores\n\nEthereum has achieved a significant milestone by breaking through the $3,000 price barrier, a bullish signal that many investors have anticipated for the last few months.\n\nThe ascent to $3,000 marks a key psychological and technical level for Ethereum. This breakthrough is supported by a robust volume profile, suggesting that the move is backed by substantial market interest.\n\nLocal support levels now adjust to this new paradigm, with previous resistance around $2,800 potentially becoming a new support zone. Should ETH maintain its position above this level, it would confirm the strength of the current trend and possibly establish a foundation for further gains.\n\nLooking at the potential for a rally continuation from the current levels, the momentum appears strong. Investors and traders will now be eyeing the next resistance levels, which could be around the $3,200 to $3,300 range, where ETH may face a test. A consolidation above $3,000 could provide the springboard needed to challenge these higher thresholds.\n\nIn a bullish scenario, if Ethereum manages to sustain its current levels and market sentiment remains positive, there is a possibility of continued growth, potentially targeting the all-time highs seen previously. The RSI and volume will be key indicators to watch for sustaining buying pressure.\n\nSolana still losing\n\nSolana is currently exhibiting bearish tendencies. A close look at SOL's price trajectory reveals it is navigating through a potentially critical phase.\n\nAs of now, SOL is manifesting a downtrend within a bearish channel pattern. The price has recently faced resistance at the upper trend line of this channel, suggesting a possible continuation of bearish momentum. Key support levels to watch include the psychological round number at $100, followed by a more established support at around $90 which, if broken, could lead to a further slide.\n\nIf SOL fails to hold the $100 level, we could witness a steeper decline, with the next substantial support level at $90. A break below this could potentially open a path toward the $80 mark, especially if broader market sentiment remains negative.\n\nA bullish reversal could occur if SOL finds solid footing at the current support levels. For a shift in trend, SOL would need to break out of the descending channel, pushing past the immediate resistance near $110. This could indicate short-term bearish exhaustion and potentially signal the start of a recovery phase, targeting subsequent resistance levels at $120 and above."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxQajBrRGhpeU5wVVFlMDg1VUtkYzRhbzh4VFhKME1xRVJiQy1SRTZZalhKOXZiME5EWHRuWWtQVVltOVZzdmQ5RjBjcGRGNG1MaDJpSUZUMlhfZlV0MHdEUG1EeGJMbzkxbnN2cEQ2ZG1TUEtUakY3Mm5BajAtd0thUU9FUThiMUtQSF9FUmVPUTRuQTVLemNBc2I0YURNVUJySkI1dnJhM2Jlc05XZ0xDUUVPWTJjdUxGZ3fSAb8BQVVfeXFMUDlDNWFaLUd2WFN2TWtZTFozcF9mdHV3TW9OaUFVTk9vQlFNS3RaX1FCUXNzR0UyQWpRdFpQTGNvWFhNb2VFSmZ6X2FMeVVmdTdmMmh1MVJLV29VdEpia2hTa3BRTUJFUW9OV1BTTEh6WGJVSWFvd0VValNsNXpTdW9Gd2UtYWZaTXMwN2dGY3lCT0xSSU5oNk9jUG9Hc2tackdPMEluZHpkcDJXcjIxWFJDOXlkcXNWclRpeHFwV2M?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 23 Feb 2024 08:00:00 GMT",
        "title": "ETH/BTC Chart Analysis: Is Ethereum’s Rally Against Bitcoin Ushering In the Altcoin Season? - CoinGape",
        "content": "The first quarter of 2024 is proving to be an exciting era for crypto investors. While attention was majorly on Bitcoin in Q4 last year and in early January, interest has been gradually shifting to Ethereum and the altcoin market in general. The ETH/BTC chart analysis takes into account the changing dynamics, that could result in an unparalleled altcoin season.\n\nETH/BTC Chart Analysis: Ethereum Fires Up As Bitcoin Stalls\n\nThe ETH/BTC trading pair with a value of $0.0574 holds above an important support area highlighted by the 0.382 Fibonacci ratio around $0.0573. Slightly below the same demand zone is the 200-day Exponential Moving Average (EMA) (the blue line on the chart).\n\nadvertisement\n\nWith the Relative Strength Index (RSI) neutral but sliding toward the midline and the oversold region, ETH/USD could push harder on the above support area. Holding firmly above the 0.382 Fibo would make Ethereum stronger, insinuating a larger breakout in ETH price. Ethereum will weaken against Bitcoin if the same support caves.\n\nThe technical structure on the daily chart is no different, with the ETH/USD pair expected to bounce off the 0.382 Fibonacci support level. A stronger Bitcoin in January butchered the demand area, causing a flash drop to $0.051, underscoring the importance of controlling sell-side pressure.\n\nThe upcoming Dencun upgrade is likely the secret weapon Ethereum bulls have against Bitcoin. This upgrade has many benefits for Ethereum as a network and its underlying layer 2 scaling solutions such as Arbitrum and Polygon.\n\nAssessing ETH/USD Weekly Technical Structure\n\nSeveral key levels would determine where the ETH/BTC pair heads in the coming days or weeks. For starters, support highlighted by the green band on the weekly chart has been tested more than once — in May, in Dec/Jan, and in February.\n\nThat said, there is a high chance ETH/USD will rebound from the green-colored support area for another targeted attempt at the trend line resistance from September last year. Ethereum will emerge extremely bullish if this resistance is broken, paving the way for widespread rallies in the altcoin market.\n\nA potential spot Ethereum ETF is another key factor to keep in mind while trading the ETH/BTC pair, especially long-term. Experts anticipate the same bullish outlook for Ethereum if the SEC greenlights the products that allow traditional investors to seek exposure to ETH on the stock market without having to worry about the complexities of crypto including exchanges and storage.\n\nHowever, the Bitcoin halving due in April may turn the tables around, bolstering BTC price rally toward the end of the year and subsequently in 2025.\n\nRelated Articles\n\nJohn Isige John is a seasoned crypto expert, renowned for his in-depth analysis and accurate price predictions in the digital asset market. As the Price Prediction Editor for Market Content at CoinGape Media, he is dedicated to delivering valuable insights on price trends and market forecasts. With his extensive experience in the crypto sphere, John has honed his skills in understanding on-chain data analytics, Non-Fungible Tokens (NFTs), Decentralized Finance (DeFi), Centralized Finance (CeFi), and the dynamic metaverse landscape. Through his steadfast reporting, John keeps his audience informed and equipped to navigate the ever-changing crypto market.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxPRlIyTERHTk9XYlJOMTJpM1U3WXRGQ2F3OVQ5NTMwVDVibDNmWkJLM1FOSnliTGtrcXVoS1lxUndyOXA4R0NLaUx3YUg2dUl2ZXBFbFVGSHc2dGNfYkFOVjdiQVpnUjVRZXYzQjE0Q05MU3ZuZlYyY3ZveW9sM1pWR25uRlZpS0JHbXpUQmR3UmbSAZYBQVVfeXFMUHBSUV91bU5lYXNadDlERm83TDhaR1dkRF9ubmU2RFlQMlhDaTcwZi1xMDZ5T2Jia0h6a05xcnhFd1F6MHMtSkRDbzM1NVpBQVZsQ1NFTFM5Y2tUTGNPNTRlN2ppSURWdDVENEMwWmJvNTdnRWZ6OVM1bXdvNnFwYmNsamY4ZHFiSE1TeklaN1oyYnpzaEl3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 24 Feb 2024 08:00:00 GMT",
        "title": "Ripple (XRP) More Popular Than Ethereum in These Countries: Data - CryptoPotato",
        "content": "TL;DR\n\nXRP’s popularity has surged, outperforming ETH in Google searches in several countries.\n\nRipple’s lawsuit outcome and events like the Bitcoin halving could further boost XRP’s prominence and value.\n\nJapan and Many More\n\nDespite the lengthy lawsuit between Ripple and the United States Securities and Exchange Commission, the entity’s native token – XRP – remains among the trendiest cryptocurrencies. Its popularity rose significantly last year when Ripple secured three vital (yet partial) court victories against its opponent.\n\nAccording to most recent trends, XRP has even surpassed Ethereum (ETH) in Google searches in certain countries (over the past month). Japan, the Philippines, and South Africa are the top 3 nations where Ripple’s coin has dwarfed its. XRP searches have also been on the rise in Finland, Malaysia, and Indonesia, albeit in a more modest fashion.\n\nEthereum remains more popular in some leading European economies, including France, Sweden, Spain, Germany, Switzerland, and others.\n\nA few months ago, Solana briefly flipped ETH in terms of Google searches. The trend coincided with SOL’s rapid price increase, which skyrocketed by approximately 1,000% between the beginning of last year and New Year’s Eve.\n\nCan XRP Progress Even More?\n\nSome could argue that Ripple’s coin might surge in popularity even more if its price explodes in the following months. The crypto space is rammed with analysts who have recently predicted colossal surges for the coin.\n\nSeveral important factors and upcoming developments hint that such an ascend is not out of the cards. Perhaps the most obvious one is the outcome of the lawsuit between Ripple and the SEC, which is nearing a grand trial (scheduled on April 23).\n\nA decisive win for the company might trigger huge excitement and cause a bull run for XRP and the entire market. On the other hand, the opposite scenario could pause the advancement of the industry.\n\nThe Bitcoin halving is worth mentioning, too. The event occurs approximately every four years and reduces the rate at which new BTC is mined. Historically, it has been followed by a massive crypto bull run, which might positively impact the XRP price.\n\nThose willing to explore additional factors that could play a role, feel free to take a look at our dedicated video below:"
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiZEFVX3lxTE5QSVIwWVUzdTFZQy1LZ0VRZWZDVWtBcGNfMWFHcWZKV3pKODBzTmVJOXIzeVB3cmloX3BIR0lySzFhXzg1ZEI2SVRNQlgyZ0x3cTViRk5EV3hrYVlzTHo3MWVNRm0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 23 Feb 2024 11:13:40 GMT",
        "title": "How to Buy Smog ($SMOG) in 2024 – The Complete Guide - The Tech Report",
        "content": "How to Buy Smog ($SMOG) in 2024 – The Complete Guide\n\nIn our content, we occasionally include affiliate links. Should you click on these links, we may earn a commission, though this incurs no additional cost to you. Your use of this website signifies your acceptance of our terms and conditions as well as our privacy policy.\n\nWhy Trust Tech Report Tech Report is one of the oldest hardware, news, and tech review sites on the internet. We write helpful technology guides, unbiased product reviews, and report on the latest tech and crypto news. We maintain editorial independence and consider content quality and factual accuracy to be non-negotiable.\n\nSmog is a new meme coin for Solana and Ethereum that’s creating quite a splash. The token is up more than 4,600% since its fair launch and promises airdrops and discounts for investors who buy $SMOG now.\n\nSmog’s airdrop is approaching quickly, so investors don’t have much time remaining to buy $SMOG tokens and still qualify. In this guide, we’ll explain how to buy $SMOG.\n\nSmog ($SMOG) Key Points Launch and Platform: Smog held a fair launch on Solana’s Raydium DEX and exploded 4,600% after launch.\n\nSmog held a fair launch on Solana’s Raydium DEX and exploded 4,600% after launch. Tokenomics: The total supply of $SMOG is 1.4 billion tokens. 35% of the supply is set aside for airdrop rewards.\n\nThe total supply of $SMOG is 1.4 billion tokens. 35% of the supply is set aside for airdrop rewards. Presale: Smog held a fair launch on Solana, but offers a presale on Ethereum where investors can buy $SMOG for a 10% discount.\n\nSmog held a fair launch on Solana, but offers a presale on Ethereum where investors can buy $SMOG for a 10% discount. Staking: Investors who buy $SMOG on Ethereum can stake their tokens to earn 42% APY and qualify for the airdrop.\n\nInvestors who buy $SMOG on Ethereum can stake their tokens to earn 42% APY and qualify for the airdrop. Key Features: Earn token airdrops on Solana or 42% staking APY on Ethereum.\n\nEarn token airdrops on Solana or 42% staking APY on Ethereum. Long-Term Vision: Smog aims to become the biggest meme coin on Solana and deliver additional airdrops for token holders.\n\nSmog aims to become the biggest meme coin on Solana and deliver additional airdrops for token holders. Roadmap: Smog launched in February 2024 and will deliver its first token airdrop in March 2024.\n\nHow to Buy Smog ($SMOG) – A Step-By-Step Guide for Beginners\n\nThere are two ways to buy $SMOG tokens: on either the Solana or Ethereum blockchains.\n\nBuying $SMOG on Solana qualifies investors to earn token airdrops. Buying $SMOG on Ethereum qualifies investors to stake their tokens and earn 42% APY. In addition, investors who buy $SMOG on Ethereum will get a 10% discount and also qualify for the upcoming airdrops.\n\nSo, it pays to buy $SMOG on Ethereum right now. We’ll explain how to buy Smog.\n\nStep 1 – Set Up a Crypto Wallet\n\nInvestors will need a crypto wallet that supports ERC-20 tokens. Reliable, free options include MetaMask and Trust Wallet. MetaMask can be installed on a mobile device or browser.\n\nStep 2 – Add Funds to Wallet\n\nInvestors will need to swap $ETH or $USDT to purchase $SMOG tokens on Ethereum. Purchase any of these tokens from a centralized crypto exchange like MEXC, Binance, or Coinbase.\n\nStep 3 – Connect to $SMOG Sale\n\nTo buy $SMOG on Ethereum, visit the project’s Ethereum token sale site. Follow the on-site prompts to connect the crypto wallet.\n\nStep 4 – Buy $SMOG\n\nChoose whether to pay with $ETH or $USDT, then enter the amount of $SMOG to purchase. When ready, click ‘Buy for 42% APY’ to purchase $SMOG tokens.\n\nInvestors’ newly purchased $SMOG will be staked automatically and begin earning 42% APY. Staked tokens are locked for 90 days before they are released to investors’ wallets.\n\nVisit Smog\n\nHow to Buy $SMOG on Solana\n\n$SMOG has already launched on decentralized exchanges on Solana, so investors can purchase $SMOG directly from these DEXs. The Smog team recommends using Birdeye, but alternative DEXs like Raydium and Jupiter also work.\n\nTo buy $SMOG on Solana, investors will need a crypto wallet with $SOL, $USDT, or $BONK. Visit a DEX and connect a wallet, then search for the $SMOG/$SOL or $SMOG/$USDT trading pair. Enter the amount of $SOL or $USDT to swap, then execute the order to purchase $SMOG. Tokens will be transferred to the crypto wallet immediately.\n\nWhat is Smog?\n\nSmog is a top meme coin that features a fire-breathing dragon that rules over a mythical land. It encourages investors to fill their bags and guard their treasure by buying and holding onto $SMOG tokens.\n\nSmog initially launched on the Solana blockchain with a fair launch on the Raydium DEX. That means it didn’t hold a presale like many other meme coins have.\n\nThe launch saw enormous success, with $SMOG gaining more than 4,600% in its first 2 weeks after launch. According to DEXTools, $SMOG now has a market cap of more than $90 million and is owned by more than 26,000 investors.\n\nSmog may have launched at just the right time. Solana meme coins have been on a massive tear, driving up engagement across the Solana ecosystem and driving renewed development on Solana.\n\nNow, Smog is also planning a launch on Ethereum. The Ethereum launch will follow a more traditional meme coin presale but without a cap on the number of $SMOG tokens that can be sold.\n\nSmog Airdrops\n\nSmog is planning to reward early investors on Solana and Ethereum with an upcoming crypto airdrop of additional $SMOG tokens. 35% of the token supply has been set aside for airdrops.\n\nThe team behind Smog has also hinted in its roadmap that more airdrops could happen in the future.\n\nAll token holders have to do to qualify for the first airdrop is to buy and hold $SMOG before an unspecified cutoff date. The longer users hold $SMOG, the more tokens they stand to earn in the airdrop.\n\nSmog Staking Rewards\n\nInvestors who buy $SMOG on Ethereum can stake their tokens and earn rewards of 42% APY. That’s an impressive return for a project that’s already demonstrated it has explosive potential and a large community behind it.\n\nOn top of that, Smog is offering a 10% discount on $SMOG purchases on Ethereum for a limited time. The discounted price and staking rewards are not available to investors who buy $SMOG on Solana.\n\nSmog Tokenomics\n\nSmog has a total supply of 1.4 billion tokens, which will be distributed across the Solana and Ethereum ecosystems based on demand on each of these blockchains.\n\n50% of the token supply is allocated for marketing efforts, and another 35% is set aside for airdrop rewards. The remaining 15% of tokens are reserved for providing liquidity for exchange launches.\n\nRoadmap\n\nSmog’s roadmap is split into 3 phases.\n\nPhase 1 is complete. It included creating the Smog token and website, launching social channels, and laying the foundations for the $SMOG token airdrop.\n\nIt included creating the Smog token and website, launching social channels, and laying the foundations for the $SMOG token airdrop. Phase 2 is underway. It includes Smog’s fair launch on Solana and the ongoing sale on Ethereum.\n\nIt includes Smog’s fair launch on Solana and the ongoing sale on Ethereum. Phase 3 is planned. It includes $SMOG token airdrops and growing Smog into the biggest meme coin project on Solana.\n\nFor more details about when the Smog airdrop will take place, investors can follow Smog on X or Telegram.\n\nWhy Buy Smog?\n\nLet’s take a closer look at some of the key reasons to buy $SMOG during the Ethereum token sale:\n\n10% price discount: For a limited time, investors who buy $SMOG-Eth can get a 10% discount on $SMOG tokens. That effectively gives investors a 10% unrealized gain.\n\nFor a limited time, investors who buy $SMOG-Eth can get a 10% discount on $SMOG tokens. That effectively gives investors a 10% unrealized gain. Upcoming $SMOG airdrop: The upcoming $SMOG token airdrop is generating a huge amount of hype, and there are a lot of tokens at stake. Smog has set aside 35% of the total supply, equivalent to more than $30 million worth of $SMOG at the project’s current market cap.\n\nThe upcoming $SMOG token airdrop is generating a huge amount of hype, and there are a lot of tokens at stake. Smog has set aside 35% of the total supply, equivalent to more than $30 million worth of $SMOG at the project’s current market cap. Staking rewards: $SMOG-Eth investors can stake their tokens to earn 42% APY, further boosting their returns from holding this meme coin.\n\n$SMOG-Eth investors can stake their tokens to earn 42% APY, further boosting their returns from holding this meme coin. Future airdrop and burn potential: The team behind Smog has hinted that it could hold additional airdrops or burn $SMOG tokens in the future. While nothing is certain, it would make a lot of sense for a dragon-themed meme coin to hold a token burn.\n\nThe team behind Smog has hinted that it could hold additional airdrops or burn $SMOG tokens in the future. While nothing is certain, it would make a lot of sense for a dragon-themed meme coin to hold a token burn. Viral meme growth: $SMOG is experiencing viral growth and appears to be poised for more gains. It’s launched at the perfect time to ride the rally across Solana, which recently surpassed $XRP as the 5th-largest cryptocurrency by market cap.\n\nFor these reasons, it made the best crypto to buy now list in many communities.\n\nConclusion\n\nSmog is an explosive Solana meme coin with huge potential. While investors may have missed out on the token’s initial Solana launch, there’s another chance to ride Smog upwards as it launches on Ethereum.\n\nFor a limited time, investors can buy $SMOG on Ethereum for a 10% discount, plus get 42% staking APY and access to the upcoming $SMOG airdrop. Don’t miss this chance to buy one of the most action-packed meme coins of the year.\n\nVisit Smog\n\nFAQs"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxQYzhNbHJHNEMtTllzdkhiWUhuN3BUdXJhd3pGX1Y0di1KbjBOVWVKQjJSNFJqa0V0M082NEdwWHdwa3p5akZ1WXgxR3BDS0g4eDJMdkxZb3duakQ2YnhoeGlwTF85eVBMSlFpZjBQWmFJRzRBWTY1MHY1TzF3LXNRU210bEVTVmNJejRyS2FXTVBrV2hIaUZvVVdXMEdGVGVheV9ZdjhUbUM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 23 Feb 2024 08:00:00 GMT",
        "title": "Block gained $207M on its Bitcoin Holdings and Ethereum Spot-Exchange Traded Fund - Tekedia",
        "content": "In its fourth-quarter earnings report released recently, fintech company Block reported a remarkable remeasurement gain of $207 million on its bitcoin holdings. As of December 31, 2023, Block held approximately 8,038 BTC for investment purposes with a fair value of $340 million.\n\nThe company’s earnings report highlighted a significant increase in bitcoin revenue, totaling $2.52 billion, representing a 37% year-over-year rise. This growth was driven by both an increase in the average market price of bitcoin and the price appreciation of Block’s bitcoin inventory during the quarter.\n\nBlock’s subsidiary, Cash App, played a crucial role in these gains. The platform generated a gross profit of $66 million on bitcoin sales last quarter, representing an impressive 90% increase year over year. The total sale amount of bitcoin sold to customers—which Block recognizes as bitcoin revenue—was $2.52 billion.\n\nShares of Block (NASDAQ: SQ) surged by 13% in after-hours trading, reaching $76. Overall, Block reported that its gross profit grew by 22% yearly, reaching an impressive total of $2.03 billion. Square, another subsidiary of Block, generated a gross profit of $828 million (up 18% year over year), while Cash App contributed $1.18 billion (up 25% year over year) to the company’s overall performance. In summary, Block’s strategic investment in bitcoin has paid off significantly, positioning the company as a major player in the cryptocurrency space.\n\nEther spot-exchange traded funds (ETFs) may increase institutional investment and power the world’s most-used blockchain, but they are unlikely to create euphoric price surges, according to some market observers. While interest in ether bets has risen significantly, an ETF could create sustained growth rather than explosive growth in the ether market.\n\nLast week, Ethereum’s native token crossed the $3,000 mark for the first time since April 2022, rising 15% in a week and beating bitcoin’s relatively modest 8% rally in the same period. Crypto circles on social application X expect such price action to continue after the expected issuance of ether ETFs later this year. The narrative is that these inflows could later find their way to the broader Ethereum ecosystem.\n\nHowever, some believe an ETF could create sustained, rather than explosive, growth in the ether market. Jag Kooners, head of derivatives at Bitfinex, stated that “Ethereum ETFs won’t cause bubbles.” He further explained that institutional investment through an ETF could stabilize the Ethereum market, similar to what has been observed with bitcoin and gold ETFs, fostering sustained growth.\n\nKooners also highlighted that Ethereum’s Layer 2 solutions which enhance scalability by enabling faster, cheaper transactions outside the main blockchain, play a role in fostering growth. Unlike bitcoin’s security focus, Ethereum’s L2 solutions prioritize rapid expansion, potentially attracting institutional investment and broadening application scope.\n\nBitcoin’s status as a macroeconomic asset has made it increasingly sensitive to global economic developments. As institutional participation in Bitcoin grows, adverse macro events can impact its price significantly.\n\nRecently, Federal Reserve Chair Jerome Powell expressed concern about high inflation, leading to expectations of faster stimulus unwinding. Additionally, Evergrande’s debt crisis and IMF warnings have added to market jitters. In contrast, Ethereum’s deflationary asset credentials and its transition to ETH 2.0 have helped it remain relatively resilient.\n\nHowever, it’s important to note that an ether ETF still faces regulatory headwinds. The classification of ether as a security or commodity remains a key hurdle despite ongoing regulatory discussions. Some traditional finance firms estimate a 50% chance of an ether ETF approval by May 2024 with ether considered the “only digital asset other than bitcoin” to get spot ETF approval in the U.S. Several companies have submitted applications.\n\nShare this: Facebook\n\nTwitter\n\nWhatsApp\n\nLinkedIn\n\nEmail\n\nPrint\n\n"
    }
]