[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxPcTE4NEM1dldvaW5tQzJ4RzBkVDJ0aVdmQXRSMGFJR2R4MXZwZGdZbThVYUo5YkNwVW5NemhJOWNnNEZaM08zNjRObWhFdzE5Y2NiYnN0QjdmY1pxYlpHcmJhMkFwdUp5QUg3TXp3QlRKWDZoMnJiS3JOSWN2QmgxRjVGX2d6TE15MXZtLQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Apr 2024 07:00:00 GMT",
        "title": "3 Must-Know Facts About Ethereum, Before You Buy the Cryptocurrency - The Motley Fool",
        "content": "This top cryptocurrency is certainly on the radar of most investors.\n\nWith a current market cap (as of the afternoon of April 17) of $360 billion, Ethereum (ETH -1.03%) is the world's second most valuable cryptocurrency. It's behind only Bitcoin when it comes to market domination.\n\nJust in the past five years, Ethereum's native token has skyrocketed nearly 1,700% in value. That would have turned an initial $1,000 investment into a jaw-dropping $18,000 balance today.\n\nEthereum has also been on a fantastic run since the start of 2023, benefiting from the broader crypto market's rally. But this digital asset remains 36% off its high. Before you rush to buy the dip, here are three things you should know about Ethereum.\n\nAiming to boost functionality\n\nEthereum's key characteristic is that it allows for the functionality of smart contracts. These are computer programs that automatically execute once separate parties in a transaction satisfy their ends of the agreement. Think about an escrow account immediately releasing funds as soon as a home buyer meets certain conditions. In theory, Ethereum could handle this without human intervention, which could lower costs.\n\nThis feature is what makes this cryptocurrency much more useful when compared to Bitcoin, according to what Ethereum bulls believe. In fact, Ethereum has a sprawling ecosystem of decentralized applications (dApps), ranging from gaming and finance protocols to non-fungible tokens and the metaverse. Smart contracts enable these types of use cases, which could disrupt traditional industry structures.\n\nGiven this background knowledge, it's not surprising that Ethereum is often dubbed the \"world's decentralized computer.\"\n\nA sustainable future\n\nLike Bitcoin long has, Ethereum used to operate a proof-of-work consensus mechanism. This is an energy-intensive way to process transactions and secure the blockchain. Estimates point to how Bitcoin's network uses the same amount of energy as a small country.\n\nBelieving that this was harmful to the environment and not on a sustainable path, Ethereum's developers successfully transitioned the network to a proof-of-stake (PoS) system in September 2022. After the so-called Merge, in this setup, token owners who lock up their holdings have the right to validate transactions. According to Ethereum's website, the PoS consensus mechanism reduces energy usage by over 99%.\n\nThe other hope for the PoS transition is that it'll make Ethereum a much faster and cheaper network. It can only handle 14 transactions per second. And when demand is high, fees can soar. In order for Ethereum to one day usher in multiple new use cases, as many hope it can, the throughput needs to increase. There are other planned upgrades in the pipeline to one day make this a reality.\n\nOngoing technical risk\n\nBesides the Merge, Ethereum's developers have four main updates planned in the future. Each one focuses on a specific area of improvement. The end goal is to have a fully functioning Ethereum network that is good for the environment, fast, cheap, and able to have a vast dApp ecosystem operating on top of it.\n\nOf all the cryptocurrencies in the world, Ethereum has the most developers working on it by far. This bodes well for its future because it means there are smart people focused on solving complex problems to keep progress going. I always say that I believe the ultimate success of a cryptocurrency depends on its ability to bring about real-world utility. Ethereum is trying to do this.\n\nThe issue, though, is that no matter how smart the upgrade pipeline looks on paper, it introduces immense technical risk. We can't forget that blockchain technology is still in the early innings. There is a lot that needs to be learned. Constantly tweaking and messing with the software means there will always be the possibility that something will break along the way.\n\nIf you are bullish on Ethereum, understanding these three key areas should help give you a better understanding before you put your money to work."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiygFBVV95cUxPZjVubFk2YlJrVllrS3VTaTl0a2VGaHA2LVVaZE5pR0ZCOUVZWnpfaThZemtaMlNBTjRNQmIwWmtxSGhCemwwU2VqeFpzd3M3ZmhXY1d0QVgtSzkxQ3NhRUpmbTFVNlJJdDczclhaMU1qOG12MmR4dzdUTXYyWEhrbDJDTDI1akYtVGhxTGs5LTMzWWhFT1MzcmtwZ2huRndhYU1odUdUSkpkblAzX0luQkt6RGZyQ2E4TjhBNXJxN0NnWUhhdkVKbE1R0gHPAUFVX3lxTE5CSXY5UnVxX2ZmUVlrUV95dXZ0WmVsS2loZ1ZlQWc3WUdDTkl1X2dpc3N3c3JGV2twZ19zUHEySndiTTltaGVkOVZCQlpCSkFBc3RhWWdTRDZNRWUwc2xXbXYyVTF2ZkptN21QeUZxY00teU1IMDEyN3pyWUhXdTZDUjNZemhQYWRWOU1vd3lxcU92WlVsYnlJc0p2RGd4elZGUDJjcWptVUpiTm9pVVdDWVpDMnlaVU9SVDZuZGlIYjk0MmxseVFfZTBpb0NFOA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Apr 2024 07:00:00 GMT",
        "title": "Ethereum resumes consolidation after brief dip, buyback yield exceeds that of major S&P 500 companies - FXStreet",
        "content": "Ethereum whale jumps on ‘buy the dip’ opportunity after Israel's attack on Iran.\n\nThe buyback yield of Ethereum exceeds that of major S&P 500 firms.\n\nEthereum may continue trading inside key range as investors await the market's response to Bitcoin halving.\n\nEthereum resumed its sideways movement on Friday after briefly crashing due to Israel's attack on Iran. The move presented a buying opportunity for a whale, who quickly profited from it. This also comes when Ethereum's buyback yield exceeds that of several S&P 500 firms.\n\nRead more: Ethereum shows firm support at key level as its correlation with US indices increase\n\nDaily digest market movers: Israel's retaliation, whale activity, buyback yields, Hong Kong's ETH ETF\n\nEthereum wasn't left out, as the entire crypto market took a hit on Friday following Israel's strike in retaliation to Iran's attack on April 13. Here are your key market movers:\n\nAs ETH dipped briefly on Friday, a whale jumped on the opportunity, spending 9.5 million USDT to buy 3,253 ETH at ~$ $2,925, according to crypto analytics platform Spot On Chain. However, ETH's price has quickly recovered, especially as Iranian officials have downplayed responding to the attack. As a result, the whale made nearly $625,000 in unrealized profit.\n\n\n\nEthereum is outshining major tech and financial giants in terms of buyback yields, according to Token Terminal. In a list of $200 billion+ finance and tech S&P 500 companies, including Apple, Alphabet and Berkshire Hathaway, Ethereum ranks number 16, above Tesla and JPMorgan with a buyback yield of 0.23%.\n\n\n\nBuyback for Ethereum, in this case, is implemented through token burns that began after The Merge in 2022. The number one smart contract blockchain achieved this feat in only nine years compared to the median age of 44 years of other companies in the list.\n\nETH buyback yield\n\nAlso read: Ethereum moves sideways as Q1 report indicates token burns are making it deflationary\n\nMeanwhile, Bloomberg ETF analyst Eric Balchunas expressed doubts that Mainland China investors may not get access to Hong Kong's spot ETH ETFs when they start trading. This pessimism is based on China's ban on all crypto-related activities in 2021. However, other analysts have pointed to Hong Kong's positive reception to crypto investment as a good sign that spot ETH ETFs would see impressive inflows when they launch in the region.\n\n\n\nDespite ETH's brief price decline, ETH's long liquidations weren't heavy, sitting around $34.4 million in the past 24 hours. This may be due to heavy liquidations already seen earlier in the week.\n\nTechnical analysis: ETH may continue trading inside key range\n\nETH attempted to break the $2,852 support on Friday after Israel attacked Iran. However, prices have quickly bounced back, and ETH appears to be continuing its consolidation. The calm may be due to investors exercising caution as they await how the market responds to Bitcoin's fourth halving, which is a few hours away.\n\nRead more: Ethereum declines as crypto market crash increases bearish sentiment\n\nConsidering that many analysts have predicted that Bitcoin halving is already priced in, ETH may experience light volatility in the next few hours.\n\nETH/USDT 4-hour chart\n\nBut in the coming weeks, it won't go outside the range of $2,852 and $3,406 formed in recent price movements, except if major external factors prevail on its price. In the long term, ETH could test the resistance of $3,730. An unlikely approval of spot ETH ETFs by the Securities & Exchange Commission (SEC) would send it past the $4,000 key level to a new all-time high."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxNeThLa2NyODExdkpwOC1xYkVFNFpPTHFNWnU0M1ZXWEpDYTVmbjFVM0Jrb0ZJbHVPVmRIaVN0UWVBNWZ5LVQ0LWxZSEJ3T2RaYnhVWXJNczhSeU96MFRpWFZldkRXSGhsbllmRVRTeXljYzByM2l6MFl6blA5LUswQ1hLTmdRY2VMRzJj0gGQAUFVX3lxTFBCR3pZYlZ2ZGVOTWRqTjdrd3lvWUFXVTRMS2dEbHRsekx4Sjd2REQxNkkzamhxbFZiYkpyMml6QndrYjBkVnFINUtSX0phb0o4NVg1dzRTRkZGbm9KSkdiS3pRODFPSmk4LU9DUkNlNHYyaVJxU2JTTXRZZDgwT011bzJ0Nm5RTVI1VWtzcnR3aw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Apr 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Price Surges 3.66% Amid Ancient Wallet Activation - CoinGape",
        "content": "The cryptocurrency market has witnessed a surge in Ethereum (ETH) price by 3.66% over the last 24 hours, reaching $3,175. This surge coincides with the reactivation of an ancient Ethereum wallet that had been dormant for nearly 8.7 years, according to data from the crypto tracker Whale Alert. The dormant wallet, holding 197 ETH valued at $622,685, has sparked intrigue and speculation within the crypto community.\n\nSpeculation Surrounding Dormant Wallet’s Activation\n\nThe sudden awakening of the long-dormant Ethereum wallet has prompted speculation regarding its owner’s identity and intentions. Some suggest the possibility of the owner rediscovering lost keys, while others speculate that it could be a strategic decision to “hodl” until now. The wallet’s anonymity adds to the mystery, with no clear indication of the early ETH adopter’s identity or the reasons behind its prolonged dormancy.\n\nadvertisement\n\nSome members of the crypto community speculate about potential market movements signaled by the activation of the dormant wallet. In contrast, others view it as a personal decision by an individual or entity. Despite these speculations, the exact reasons behind the wallet’s sudden awakening remain undisclosed, leaving the mystery surrounding it largely unsolved for now.\n\nAs Ethereum regained the $3,000 price mark, on-chain sources reported a significant withdrawal of 10,119 ETH worth $31.83 million from Binance. Withdrawals of this magnitude are often interpreted as a signal of intent to buy within the market. The whale behind the withdrawal has been actively accumulating ETH, purchasing 127,388 ETH worth $405.19 million from decentralized exchanges (DEX) and Binance since April 8. This activity indicates a bullish sentiment towards Ethereum, with the whale consistently buying at an average price of approximately $3,172.\n\nICO Participant Sells Ethereum Holdings\n\nIn a recent development, Coingape reported on an Ethereum whale who acquired ETH during the Initial Coin Offering (ICO) phase and subsequently sold a portion of their holdings. The whale, who initially acquired 33,213 ETH during Ethereum’s Genesis ICO in 2015, has deposited 5,110 ETH to Kraken or sold via DEX at an approximate price of $2,545. Despite this sell-off, the whale still retains a significant amount of ETH, holding approximately 29.7K ETH valued at $89.4 million across three wallets, primarily within staking platforms.\n\nRead Also: XRP Lawyer Bill Morgan Criticizes SEC: Questions $2B Ripple Settlement\n\nMaxwell Mutuma Maxwell is a crypto-economic analyst and Blockchain enthusiast, passionate about helping people understand the potential of decentralized technology. I write extensively on topics such as blockchain, cryptocurrency, tokens, and more for many publications. My goal is to spread knowledge about this revolutionary technology and its implications for economic freedom and social good.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    }
]