[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxPb0pfX0ZjUEtlNHdFMGk3aFJISk96cUFpU20zdHI0Y1gzRXhpekNNZkN4dk9pM2FjcG9QaUp0UkEyUnQ3X0x0UE9FbE5XWVB0aExuWTBjdl83VUpXelVZNFNBX2FrSDRyZkk1SW9lZXVicTdReHBMR25sUWhVYUhlVVVMVm1ZYWEwYmpVWERHVkhkWFF4Mzc1Q1RR0gGiAUFVX3lxTE1ZODVtSUZOZ3NTeU5zdXpsaVg3RjZRZk1iUng4OWZoV01HenduSUNZdGdTUWVXLXdESjg1SVdHUnBfSHhwRFhFeEJFeFpvbXk2NUpGd2FqbExFVHlWdV9ldjBoTDRXcmJfaVJFRWt0OHFjVU5QWkVCUnpHVFJfNGRiSDl0NHlPSlR3c2liV3BqX29oMDUzUHlWMVlzRUFFSVAwdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jan 2024 08:00:00 GMT",
        "title": "This Week in Coins: Despite ETF Hype, Bitcoin and Ethereum Plunge Hard - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIllustration by Mitchell Preffer for Decrypt.\n\nLittle over a week since the launch of spot Bitcoin exchange-traded funds (ETF), and the crypto markets are suffering.\n\nOver the past week, Bitcoin (BTC) has shed more than 10% of its value, according to CoinGecko. The biggest digital coin by market cap is now priced at $41,002.\n\nLast week, it was closing in on $49,000.\n\nAD\n\nAD\n\nThe long-awaited Bitcoin ETFs have been a roaring success—with BlackRock's iShares ETF collecting over $1 billion in assets under management.\n\nSo, why the dip in price? It probably has something to do with investors cashing out their gains from the initial ETF hype.\n\nSome analysts said that ETF approval had already been \"priced in.\" This likely means that traders and investors were unlikely to continue buying after the approval was made official.\n\nThe rest of the crypto market has been hit hard over the past week, too. Solana (SOL) has shed over 7% of its value in the past week and is priced at $92.38.\n\nWhile Avalanche (AVAX) is down by more than 14%, trading hands for $32.82. Both assets had done very well in December as they attracted institutional investor interest.\n\nAD\n\nAD\n\nMeanwhile, Ethereum (ETH), the second-biggest digital coin, has lost 8% of its value in the past week. It's now priced at $2,466.\n\nFollowing the U.S. Securities and Exchange Commission's approval of 10 spot BTC ETFs, the crypto sphere is now awaiting spot ETH ETFs to drop.\n\nWall Street's top regulator on Thursday pushed back its deadline for a decision on Fidelity's proposed spot Ethereum ETF to March 5, leading to a price dip in the asset.\n\nThe entire crypto market now stands at $1.7 trillion, having dropped by 2.8% in the last 24 hours."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTFBGOEV0U0Joa2w1SS1fSWwtRGgwc1JiY0VNc0NkaFlxZWRIRGduTEdOa1FoN3Q2Tm5XV1NGOURCcWV6TzUwV3llSEdIM2ZGYS1YNXgxeE52QThDdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jan 2024 08:00:00 GMT",
        "title": "What Are Parallelized EVMs? A Beginner’s Guide - Unchained",
        "content": "Parallelized Ethereum Virtual Machines (PEVMs) enhance blockchain scalability and efficiency, allowing multiple transactions to be executed at the same time rather than sequentially.\n\nThe blockchain landscape is constantly evolving to overcome limitations and unlock new possibilities. One of the latest innovations to address scalability within the Ethereum ecosystem is Parallelized Ethereum Virtual Machines (PEVMs).\n\nRead on to learn about parallelized EVMs and the potential impact of parallelization on Ethereum’s scalability.\n\nWhat Are Parallelized EVMs?\n\nTo understand parallelized EVMs, let’s first grasp the Ethereum Virtual Machine (EVM).\n\nThe EVM allows for the execution of smart contracts on the Ethereum Network. It provides the infrastructure vital to all transactions happening on the blockchain. The growing adoption of Ether and other Ethereum-based tokens strains the EVM, leading to calls for its scaling.\n\nOne intervention that’s gaining traction is parallelized EVMs.\n\nParallelized Ethereum Virtual Machines (PEVMs) enhance blockchain scalability and efficiency by allowing multiple transactions to be executed simultaneously rather than sequentially.\n\nImagine them as supercharged versions of their predecessor capable of handling multiple transactions together. This approach is crucial in tackling the blockchain trilemma as it significantly reduces latency, boosting transaction throughput.\n\nSome of the front runners in the PEVM adoption are the Sei network, Neon, and Monad. The Sei Network went live in August 2023, attracting roughly 29,000 active users. Neon is also active and working on integrating Ethereum decentralized applications (dApps) into the Solana ecosystem. Meanwhile, Monard is yet to launch despite being production-ready.\n\nHow Do Parallelized EVMs Work?\n\nPEVMs leverage the power of parallel processing to achieve timely and scalable transactions.\n\nUnlike the typical EVMs that handle transactions back-to-back, PEVMs split transactions into smaller, independent tasks that can be tackled simultaneously. This means setting up different points for the concurrent handling of multiple trades.\n\nThere are many approaches to parallel processing, but two popular ones stand out:\n\nSharding : Imagine dividing the Ethereum blockchain into smaller, self-contained shards, each with its own EVM. Transactions are then distributed across these shards, allowing for independent and simultaneous processing.\n\nRollups: These batch transactions off the main Ethereum chain, processing them on a separate layer, and then re-submitting them to the mainnet for verification. This significantly reduces the burden on the main Ethereum network, leading to faster and cheaper transactions.\n\nThe Potential Impact of Parallelized EVMs on Ethereum\n\nPEVMs can significantly reduce transaction times and fees by removing network bottlenecks, making Ethereum more user-friendly and accessible to developers and users alike.\n\nWith PEVMs paving the way for faster and cheaper transactions, Ethereum can potentially handle a much larger volume of activity. This opens the door to widespread adoption of dApps and DeFi, bringing the power of blockchain to a broader audience.\n\nThe increased processing power of PEVMs could unleash a wave of more complex and resource-intensive dApps, pushing the boundaries of what’s possible on Ethereum. Applications that might have previously been impractical on the blockchain could become feasible.\n\nAdditionally, making improvements on Ethereum’s mainnet could significantly impact other Ethereum layers. L2 scaling solutions could gain more attention, leading to further development and adoption among users.\n\nPEVMs, however, also present a possible downside. The technical complexity required to implement parallelized EVMs might lead to centralization if only a few big players can implement it. They could also present backward compatibility and transition challenges to existing smart contracts.\n\nBenefits and Drawbacks of Parallelized EVMs\n\nPEVMs could hold so much promise for crypto enthusiasts. But like any technology, it could have its drawbacks too.\n\nPros\n\nReduced transaction latency: Devolving transaction handling to many units hastens their confirmation. Users will no longer have to endure lengthy completion times due to network clogging.\n\nLower transaction fees: PEVMs streamline transactions, eliminating the need to pay more for prioritized exchanges, which makes transaction fees more affordable.\n\nEnhanced Interoperability: PEVM projects such as Neon are working on bringing Ethereum dApps to Solana. Such initiatives will make it easy for users to interact with their peers on different networks without migrating to their platforms.\n\nCons\n\nIncreased complexity: Implementing and maintaining robust PEVMs can be technically demanding. As such, developers and users may face a steep learning curve.\n\nPotential security risks: Parallel processing introduces new synchronization and coordination challenges, increasing the likelihood of bugs and errors with improper implementation\n\nFinal Word\n\nParallelized EVMs are the latest attempt at achieving Ethereum scalability. By introducing parallel processing capabilities, PEVMs open the doors to various applications, from real-time financial transactions to seamless cross-chain exchanges. However, these novel projects require meticulous development and rigorous security edits to ensure stability."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxOTmdYYXJJVmdvY0FQWlZfNTdMZHF6RUlrbXlzRXBtcVE0ekJ1TmZvSlptMmJDZ1RpMlRNWDF2Sl96d19XWjZIY0M4czVrQTB5eWY4SWdrT0xqaF8yV09KQ2lZa0JfUVVZMmlSQUQ2QVRzWE94MjgxblR4MnFja25FR1ZNNnBmMFBieHRyeHZUREJaUdIBlwFBVV95cUxOa0E2THpfZ1VZMVAzZll2SWpZbXR6V2ZkR0tMdE9wNnFDOVdRWDd0aFJiZFF6d0NQbnpmOUw3OGhyalpCV1hzcjZ3TE1iOWExOHRoVnlydXNlcUFZcFlBRFVqTUhWbjBTV2tSQU9GMV9PRmJYd0JpZkctRVlSMVRhem1YWFJoend0ckR6OXFqMS1Neldkdjl3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Remains the Dominant Blockchain for Developers: Report - CryptoPotato",
        "content": "Ethereum continues to be the number one blockchain among crypto developers, with more than 70% of new contract codes first deployed on the network, according to the latest report by Electric Capital.\n\nAlso, there has been a spread in the distribution of developers globally, with more crypto devs living outside North America, as opposed to steady growth recorded in regions such as Latin America and Western Africa.\n\nMore Devs Involved in Multi-Chains\n\nElectric Capital’s 2023 Crypto Developer Report revealed that most of the smart contract code launched on the Ethereum network is unique, while 71% of contracts are first deployed on Ethereum, making it the top blockchain choice for developers.\n\nMeanwhile, the number of multi-chain developers expanded in 2023. Based on the report, multi-chain developers grew from three percent in 2015 to 34% in 2023, signaling a growth of over 10x in eight years.\n\nIt is also no surprise to see the cross-pollination of developers across Ethereum and Ethereum Virtual Machine (EVM) blockchains. Such blockchains include BNB Chain, Polygon, Avalanche, and several layer 2 networks. These chains all use the same smart contract logic as Ethereum.\n\nAccording to Electric Capital, cross-pollination occurs between BNB Chain, Polygon, and Ethereum, with all three chains sharing “at least 30% of their multi-chain deployers with each other.”\n\nFurthermore, BNB shares the largest number of multi-chain devs, with Ethereum at 39%, followed by Polygon at 36% and Arbitrum at 24%, while Avalanche is the lowest at 18%.\n\n40% of Developers Worked on Ethereum and Bitcoin in 2023\n\nIn all, a fourth of all blockchain developers deploy either on Ethereum or Bitcoin, with the latter accounting for a larger number of monthly active developers at 7,864 as of December 2023, which was, however, a 25% drop from over 10,400 the previous year,\n\nBitcoin, meanwhile, recorded 1,071 monthly active developers, declining 19% from 1,322 in December 2022. Most of the decline came from part-time developers and those working on multi-chains, with the report noting that developers who focused solely on Bitcoin were likely to continue working on the network.\n\nMeanwhile, more than 1000 developers have supported Bitcoin since 2017. The highest number of new developers joined the network in 2022, at over 2,700.\n\nAlthough Bitcoin transaction volumes skyrocketed in 2023 following the resurgence of Ordinals, only three percent of all Bitcoin developers worked on the project, while 40% were dedicated to Bitcoin layer 2 networks and other scaling solutions.\n\nApart from Bitcoin and Ethereum, there were also over 9,300 monthly active developers working on the top 200 crypto ecosystems by market capitalization as of December 2023. The figure, however, is a 31% reduction from 2022 records.\n\nTotal Number of Blockchain Devs Fell By Almost a Quarter in 2023\n\nAs noted on Electric Capital’s report, monthly active developers dropped 24% to 22,411 in 2023, from 29,611 the previous year, with newcomers less than one year in crypto contributing to a majority of the losses.\n\nMost of these developers with the least tenured experience came into the industry during the bull market and tended to leave during the bear market. The number of newcomers peaked in 2022 at over 90,000 after Bitcoin’s value rose to more than $69,000 and the total market capitalization at nearly $3 trillion in November 2021\n\n“Newcomers who joined in 2022 are the ones who churned and are driving the overall -24% developer loss.”\n\nIn contrast, those who have been in crypto for at least over a year continue to grow and contribute to the ecosystem, with 75% of codes by such developers.\n\nBlockchain developers with more than one year of experience in the industry grew 16% in 2023, while their established colleagues — people over two years in crypto — grew 52% in the last five years, reaching an all-time high.\n\nThe report also touched on developer distribution globally, stating that 74% are located outside of North America, while the US lost 14% of its developer share since 2018, controlling only 26% in 2023.\n\nBlockchain developers, however, are growing in Latin America, Western Africa, South Asia, Southern Europe, and Eastern Europe, increasing by 20% since 2018."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxOUE9zYk1POUJNZ1Y4d0ZpcGNzQXp2MDE3TlUwU2xtdDVCc3JJaFAzUnprNTlzMkNBUFVvU0xWTW9WNDJoRGlvN3EyTmYtRnNaY0RmaGFaS2FYd3Flb2pKUmtSeFB0N3A1MXpiRC1YU3BPaXZGTEhldWVKejdYR0haZnM2aV9VemFjc2VNUzFTM1BSWjRFaHMzSVR6R3pSdm5KTFJrSEdkZ0RNcjhVNzJBaUM4RlcyMG5PdUwwOElxa0s5LW9KYnJv0gHMAUFVX3lxTFBiMEJlZVhZd2F4ellMNkdCRDNCdWZPRTJocWVFbDNMQkVTWl9NT2N4M2ZYVlB6SnJlUXdTYnVnT1pTb1M5TGpoSlA2N3pTX0FpMk5Ua2dXTzd1N1cxampDc1RiRjNUVGIwVzdnNzRqTlh4S24wZUZFYjBVczNYNlZrTFRta04xbVQ5cmxURHNTbkNCRlZQODFINjNUOXVLMUNXcjZuWlZJTk9SbFVuMS1WcWdGeWIwM0psUWIyM2tkcFc3ai1fdTVhMnZVcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jan 2024 08:00:00 GMT",
        "title": "Crypto Whales Taking Advantage of Bitcoin, Ethereum and Chainlink Dips, According to Lookonchain - The Daily Hodl",
        "content": "Crypto whales are buying up the correction in digital assets markets, according to blockchain tracking firm Lookonchain.\n\nLookonchain says that as Ethereum dipped in price, a “smart whale” with a solid track record of profitable trades bought up the dip with over 3,600 ETH.\n\n“After the price of ETH dropped [on Friday], this smart whale bought 3,600 ETH ($8.9 million) back at a lower price…\n\nThis whale is very good at buying ETH at low prices and selling ETH at highs.\n\nThe profit is ~$25.8 million currently!”\n\nAt time of writing, ETH is trading at $2,470.\n\nLookonchain also spotted a whale scooping up decentralized oracle provider Chainlink (LINK) as it dipped to the $14.81 level.\n\nAfter the price of LINK dropped [on Friday], a whale spent $8.9 million to buy 601,949 LINK at $14.81 with three new wallets.\n\nThe price of LINK appeared to have stabilized after the large whale purchase. At time of writing, LINK is trading for $15.53.\n\nLooking at Bitcoin, the on-chain data tracking firm says that a crypto whale withdrew nearly $30 million worth of BTC from crypto exchange Binance as the price fell below the $42,000 level.\n\n“It seems that a whale is buying BTC!\n\nIn the recent market drop, a new wallet withdrew 700 BTC ($29.36 million) from Binance at an average price of $41,948.”\n\nAt time of writing, BTC is trading for $41,570.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxNNGZwX0MydE5yOWNrbXVsUzh4UDRZTXFaR3ZETkluLWFidFByOHMzd3IzN1VrUlRGaTBZZzBzV010YWlMRjgtUWJOZkZZMjNuRktVSEs0SDh3TkVkZko1dU9TOVh2NVNldTk4NnBMX20wYTR4LThQaW5iYTlxcmZHNTBXRERNdDRTZVBISkU5cjlBb3RHZFNya3YwWGxzT2llZzFkZXU4WnZTaGo5Tm1TeNIBtgFBVV95cUxPSUpXTU1JcG5IMFMzY0FpdTJqTWRKMW5wQldXcXUzOGY0UkxscFVieFo5WFdsLWZHamJjblVpR2k0dm5SY203U2VDdk0xRnREMmV4dXIybV9QY0tMT1Y3RnU1ejFIZWEzQlNvLVNxajZoSHhqcjdsOUxidWZ5Q1B1NDcwa29jUXU0YWhTeDBBZ1cwbzgtdWZ2TlRNNWw4akY5TGI3eEdhRXdzT1V2WmFldmRZQkl6dw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jan 2024 08:00:00 GMT",
        "title": "Shiba Inu (SHIB) Rapidly Breaks Down, Ethereum (ETH) Loses Traction, While Solana (SOL) Presents Hidden Opportunity - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nShiba Inu has experienced a significant breakdown from its recent consolidation phase. The chart depicts a clear downward trajectory as SHIB failed to maintain its position within the ascending triangle pattern it had formed over the past few months.\n\nThe breakdown was signaled as SHIB prices breached the key support level at $0.000009, which had previously acted as a reliable floor for the price during consolidation phases. Following this, SHIB prices tumbled further, slicing through subsequent support near $0.0000087. This price action marked a decisive shift in market sentiment from accumulation to distribution.\n\nThe next support level to watch is at $0.0000082, where SHIB may find a temporary reprieve from the selling pressure. If this level fails to hold, the next critical support lies at $0.0000076, which could serve as the last line of defense before a more significant drop.\n\nFor a reversal to occur and for SHIB to regain its upward momentum, it would need to reclaim previous support levels and transform them back into supports. This would require a substantial influx of buying pressure, potentially sparked by positive developments within the Shiba Inu ecosystem or broader cryptocurrency market rallies.\n\nAdvertisement\n\nThe first sign of a possible reversal would be a return above $0.0000087, followed by a sustained move above the $0.000009 price level. A breakout above these levels, accompanied by increasing volume, could indicate that the downtrend is losing steam and that bulls are regaining control.\n\nSolana paints reversal pattern\n\nSolana has been developing a subtle yet potentially pivotal chart pattern. The asset has been tracing a slow and steady ascending channel, a formation that suggests a controlled and consistent uptrend. This pattern, characterized by higher lows and higher highs contained within two parallel trendlines, speaks to potential for continued growth.\n\nThe significance of this pattern lies in the momentum it could provide for SOL. Should the price action remain strong within the upper half of the channel, and particularly if it challenges the upper trendline, we could see Solana break through and embark on a more aggressive rally.\n\nSuch a bullish scenario would likely be supported by increased trading volume and positive developments within the Solana ecosystem, such as new project launches or updates that enhance network performance.\n\nThe immediate local resistance stands at around $55, and a confident push beyond this could confirm bullish sentiment. Inversely, if Solana's price dips below the channel's lower boundary, around $48, it could indicate that a bearish narrative is taking hold.\n\nEthereum momentum decreasing\n\nEthereum is exhibiting signs of waning momentum, as observed in recent price movements. The asset, which has long been considered the backbone of the decentralized finance sector, is facing a pivotal moment that could determine its trajectory for the coming weeks.\n\nThe provided chart illustrates Ethereum's struggle to maintain its grasp on the market. The price has been on a downward trend, edging closer to the local 26-day Exponential Moving Average. This level, currently near $2,465, is critical; if Ethereum fails to hold this line, we might see it descend to test the more significant 50 EMA, which stands around the $2,300 mark.\n\nThe 26 EMA serves as a short-term sentiment gauge, and its breach could signal a lack of immediate bullish support. Should this level fail to act as a springboard for price recovery, Ethereum's next stop could indeed be the 50 EMA. A breach below this longer-term moving average could potentially open the gates for a test of lower support levels, highlighting the need for investors to brace for more volatility.\n\nMarket participants are now recalibrating their expectations, understanding that the road to sustainable gains is a long-term journey."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxQTzZFX1M2YVVhekh1SWtHSkRYS3dFaDBrRU9RV2xzdVlqLVZMYk1XcHdkOXQzeWlaXzg4ZVN3QUR3NlZCU1FYa1RkMUJMazdLekJTdjBId0Q1TXR2V3A0ZjBKM2hLaTF6OG5rNHJqMnQ0WjBUa1JESUI1bm52NUlfYmxBYTFaSHROYURlQTN4cmXSAZYBQVVfeXFMTXZBdzdBNXdWcG02V01WYWxmY0tLZUZNelNRTVJXMUw2SnBGLVFnY3lhdXctZGxQUnBrY05XeGF1U3dJRXZmMDYxVmQ5Zzlray1BQ3hwdUJQaHlzRm96WThjUzdjcG9zUWktb1gyU0NrZ1FKLWlaM01jTGMtdElKNTZXUXdYX1FjNzRSR1pMcWZWWGdPSmtn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jan 2024 08:00:00 GMT",
        "title": "Cardano (ADA) Surpassed Ethereum (ETH) on Multiple Fronts: Details - CryptoPotato",
        "content": "TL;DR\n\nCardano’s whale transaction volumes and NFT sales have been notable lately.\n\nADA’s price has recently underperformed compared to ETH, but experts anticipate a potential rally influenced by upcoming events and developments in the crypto industry.\n\nAccording to IntoTheBlock data, Cardano whales have settled an average of $13 billion in large daily transactions for the past week. In comparison, Ethereum’s figure stood at $5 billion.\n\nCardano whales have been quite active for the past few months. $13B in large transactions (>$100k) is being settled on Cardano daily on average. A significant amount, if you compare it to Ethereum’s $5B 7-day average. pic.twitter.com/8rjeQZaonU — IntoTheBlock (@intotheblock) January 18, 2024\n\nCardano has also made progress on the non-fungible token field, with an NFT sales volume of over $7.6 million for the last 30 days. Ethereum might be a leader with approximately $341 million, but this actually represents a 23% decline on a monthly basis.\n\nDespite the aforementioned developments, Cardano’s ADA has performed worse than ETH as of late. The former currently trades at $0.50 (per CoinGecko’s data), or a 14% plunge on a weekly scale. ETH is hovering around $2,470 and is down 5% for the same period.\n\nHowever, some experts think ADA could be on the verge of a rally, taking into account the importance of several upcoming events.\n\nDan Gambardello (Founder of Crypto Capital Venture) outlined the Coinbase v. SEC lawsuit as a major catalyst, suggesting that a victory for the company might trigger a “mega altcoin run.”\n\nRecall that the regulator sued the exchange last summer, accusing it of breaching several laws and offering trading services with alleged unregistered securities such as ADA, SOL, MATIC, and more.\n\nThose curious to check other Cardano price predictions can take a look at our dedicated video below:"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE9HcjY0bGhMYkxVS0g1WEhzUDN6SlA0eFREM3pCOHh3T0drWlh3SWRfWjUwRnRoOHU2ck1NMVpucjN5NFBZNlNLSFM0cHlsRVF2R3g0dUpGWjZaQUhxNWVEUWhIVUpKN3pjaGpIeDM3TVF6ZHQ1QUpCTE1n0gF_QVVfeXFMUFRtT0cxZkREdGhpQUlTajJqczZ3UWJodlRKNlJrMk5FZlNGN01FbjBuYkRTZE9STkgzeFZhNXE0RnJZSi1qWnR6MFp6STdvYV9PZFhnMFRvRjdEZm14ZkZReEdPNWE4TEJHY3BaT3JCNUZYWHR2VmVGOG16ekI0bw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jan 2024 08:00:00 GMT",
        "title": "How Solana, Sui made gains from ETH outflows - AMBCrypto English",
        "content": "Solana and Sui take in Ethereum outflow.\n\nSUI and SOL have seen declines but flash different RSI signals.\n\nSolana [SOL] and Sui [SUI] have experienced significant inflows from Ethereum [ETH] over the past month, according to data from Wormhole. However, it raises the question of whether this has influenced the overall transaction volume on these networks.\n\nSui and Solana take in the Ethereum flow\n\nWormhole data showed that around $370 million in liquidity shifted away from Ethereum in the last month. Sui and Solana accounted for about 90% of this outflow.\n\nPresently, these two networks continue to dominate, with an Ethereum outflow totaling over $106.2 million. Sui received around $68 million, while Solana received approximately $27 million, making up a combined 89% of the outflow from Ethereum.\n\nAnalyzing the Sui and Solana volume\n\nA recent analysis of Sui’s volume on DefiLlama showed a significant uptick in the past few days. Examining the chart reveals that the volume witnessed in January surpassed that of the preceding three months.\n\nThe upward trend peaked on 13th January, reaching over 76 million, marking the highest point in months. As of this writing, the volume was around 44 million.\n\nNotably, Sui’s Total Value Locked (TVL), despite a recent dip from around $344 million to $322 million, remained at its historically highest level.\n\nConversely, Solana has experienced a shift in volume trends. While the network’s volume increased towards the end of the year, it has witnessed a recent decline. Presently, the volume is over $740 million, reflecting a decrease but still outpacing Sui’s volume.\n\nSOL and SUI post different price trends\n\nAnalyzing the daily price trend of Sui showed an uptrend that peaked around 15th January, reaching around $1.3 with a notable 9% increase.\n\nDuring this rise, the price entered the overbought zone, as evidenced by the Relative Strength Index (RSI). After this peak, the price experienced declines, causing the RSI to dip below 60.\n\nAt present, the price has decreased by nearly 5%, trading at around $1.1.\n\nRead Solana (SOL) Price Prediction 2023-24\n\nIn contrast, Solana has dipped below the neutral line on its RSI, reflecting a decline in the price over the past three days.\n\nAs of this writing, SOL was trading at around $92, marking a decrease of over 1% in its price."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxNWGVCWVJ3WGZLMkh3NTJyN1V0NzJpX2s5SnprazJwMmdDcXdGWG1ISEJKekxYRnV4eFR6Sm5yUEZ4M1I4Zy1ZTDFJdndZd2JpTU1CUU84YWNwa1BUWkVwTHhSVmNLc0oyVEZjcUMyVW44M0Q0SVBUTXJpUnB4bm9MeFRKVXdLQdIBiwFBVV95cUxORmlXVjUxSWdVaHpwcTBUZ3J4TEVJRlFTbTY4amlDbmFrN1FRbEhMTG5ISDRzeW05UUlTVUstdzFqNDI5clByZmJuLWJtNjJtRjdiZXRMeXJxZ0FacHJmSnM1X3RoLVdabHNDeUZtYS1meUc0WTFEY21tRy1GSUp6Mndac0t0V0VIMjhB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jan 2024 08:00:00 GMT",
        "title": "Crypto Price Prediction: Ethereum (ETH), Solana (SOL), Luna Classic (LUNC) - CoinGape",
        "content": "Crypto Price Prediction: The cryptocurrency market is experiencing relative stability during the weekend, following a bearish trend earlier in the week. This downturn saw Bitcoin, the largest cryptocurrency, fall from a high of $49,000 to $40,300, marking a 17.85% loss.\n\nThis selling pressure is largely attributed to Grayscale beginning to sell its Bitcoin holdings in response to investors offloading shares of the GBTC ETF. The outflow of $2.2 billion from Grayscale’s GBTC and concerns about the Bitcoin ETF being a ‘sell-the-news’ event have led most major cryptocurrencies into a correction phase.\n\nadvertisement\n\nDespite this, several industry experts view the current downturn as a natural correction, necessary for the major cryptocurrencies to gather strength for future growth.\n\nOn the Bitcoin weekly time frame chart, there’s a notable struggle to sustain above the 50% Fibonacci retracement level, around $42,300. This effort to reclaim 50% of the lost value from the recent downtrend reflects a growing conviction among market bulls and a weakening hold by bears on the asset.\n\nWith a positive outlook for the near future, the following cryptocurrencies Ethereum(ETH), Solana(SOL), and Luna Classic (LUNC) can offer suitable pullback opportunities to traders.\n\nWhy Ethereum (ETH) Price Nearing a 22% Breakout Rally\n\nAmid the current downturn in the crypto market, the Ethereum price recently hit a local high of $2700 before starting a correction phase this week. The price now stands at $2487, reflecting a loss of 8.35% over the past two weeks.\n\nA closer examination of the 4-hour chart reveals that this correction is contained within two converging trendlines, forming what appears to be a pennant pattern. If this pattern proves accurate, it suggests that the current correction phase could be a consolidation period, allowing buyers to gather strength for a potential upward movement.\n\nAdding to this bullish perspective is a notable observation by Ki Young Ju, CEO of CryptoQuant, regarding Ethereum’s staking activity. On January 18th, he highlighted in a tweet that 24% of Ethereum’s total supply is now staked, with only 11% available on exchanges. Contrary to expectations of significant unstaking post the Shapella upgrade, the staking rate continues to rise.\n\nGiven these technical and on-chain developments, the ETH price might break through the pennant’s upper trendline, indicating an end to the correction phase. This breakout could potentially spark a rally of around 22%, pushing the price beyond the $3000 mark..\n\nNew Found Support Bolsters Solana (SOL) Price Rally to $125, But There’s More\n\nSolana, the fourth largest cryptocurrency by market cap, has displayed impressive resilience amid the broader market’s downturn, holding steadily above the crucial $85 mark. This level coincides with the 38.2% Fibonacci retracement, signaling that buyers are maintaining a strong foothold.\n\nAs highlighted in a recent analysis by Coingape, the Solana price correction is shaping the ‘handle’ of a larger Cup-and-Handle pattern, a bullish chart formation. This suggests that the ongoing retracement could rejuvenate the bullish momentum, potentially driving the SOL price up by 35% to breach the critical neckline resistance at $125.\n\nA successful breakout from this neckline, particularly if backed by a daily candle closing above it, would be a robust indication of a trend reversal. Such a development could set the Solana price on a path towards a significant target of $255.\n\nTerra Classic (LUNC) Price Wavering In a Mark-or-Break Scenario\n\nThe Terra Classic (LUNC) price has been in a corrective phase since December 2023, with its price dropping from a high of $0.00028 to its current value of $0.000118, indicating a substantial 60% loss.\n\nThe coin found crucial support at the 78.6% Fibonacci retracement level around $0.0000102, changing its course from a downward trend to sideways. The daily chart shows that this consolidation has evolved into a symmetrical triangle pattern, typically a sign of the continuation of the existing trend.\n\nA breakdown below this triangle’s lower support trendline might lead to further price declines for LUNC, potentially towards $0.0000975 and then $0.0000842. Alternatively, a rare upside break from this pattern could signal an attempt by buyers to regain bullish momentum.\n\nIf buyers manage a breakout, they could be looking at an upward rally towards resistance levels at $0.000147, followed by $0.000173, providing a much-needed boost to reverse the bearish sentiment.\n\nRelated Articles:\n\nSahil Mahadik Sahil is a dedicated full-time trader with over three years of experience in the financial markets. Armed with a strong grasp of technical analysis, he keeps a vigilant eye on the daily price movements of top assets and indices. Drawn by his fascination with financial instruments, Sahil enthusiastically embraced the emerging realm of cryptocurrency, where he continues to explore opportunities driven by his passion for trading\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxQLTBJSU1oYUw1ZHRGc2V3b1hNZVN4ZjE1REFqNkFaMXhEN3o4YWo0MDZWdWtGZ0syVngxRFk5QlFHTlotMXQwYlNma0xNeDk2cUNZMnVwOVlBVWprMlNxR0dBa3BQQ1FRbUl1dE5vNmNvQ3RnNzNEakZFbzZXLTM1N0Vkai15TkctWG9fUWpn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jan 2024 08:00:00 GMT",
        "title": "1 Unstoppable Crypto to Buy Hand Over Fist - The Motley Fool",
        "content": "After skyrocketing in value last year, Solana will be looking for a repeat performance in 2024.\n\nBitcoin may be getting all the headlines in the crypto industry these days, but there are plenty of other cryptocurrencies that have the potential to outperform it this year, including Solana (SOL -1.55%).\n\nSolana started 2023 trading around $10, and ended the year trading around $100 after briefly hitting a peak around $120 in late December. While it will be difficult to duplicate that performance in 2024, there are two big reasons why I think Solana is exactly the type of crypto that you should be buying hand over fist right now.\n\nSolana is the next Ethereum\n\nMost importantly, Solana is finally starting to fulfill its promise as \"the next Ethereum.\" Ethereum is still the acknowledged market leader in nearly every blockchain niche, from non-fungible tokens (NFTs) to decentralized finance (DeFi). But Solana now appears to be gaining market share at Ethereum's expense. At the end of last year, for example, Solana started to post higher NFT sales volume and decentralized exchange trading volume than Ethereum for the first time ever. And I think that momentum will carry over into 2024.\n\nHigh-profile institutional investors are starting to buy into this narrative of Solana as \"the next Ethereum.\" Cathie Wood of Ark Invest, for example, appeared on CNBC at the end of the year, extolling the virtues of Solana as a faster, more cost-effective version of Ethereum.\n\nAs this investment thesis gains momentum, it could lead to more institutional investors putting their money into Solana. At the end of last year, CoinShares (which tracks crypto inflows and outflows) found that institutional investors were moving money out of Ethereum and into Solana. That's obviously going to help push up the price of Solana.\n\nSolana's mobile strategy is taking off\n\nFor the past 18 months, Solana has been working on a mobile crypto strategy. It all started back in June 2022, when Solana announced it was working on a \"crypto phone\" that would be optimized for Solana blockchain users. That was followed up by the official launch of the Saga smartphone priced at $1,000 in April 2023. And now, in January 2024, Solana appears ready to launch a second, more budget-friendly version of the Saga.\n\nIt's easy to see how physical hardware products such as the Saga could spark long-term growth for Solana. They could lead to more developers migrating over to the Solana blockchain ecosystem and the launch of hardware products could be a fantastic way to onboard \"crypto-curious\" people who have a difficult time conceptualizing blockchain technology. Products such as the Saga could eventually become a pathway to onboard millions of new users into the world of Web3 and decentralized applications.\n\nThe big question, of course, is whether the world really needs a $1,000 smartphone that is optimized for crypto. The major selling point of the Saga was the inclusion of a crypto wallet within the phone itself. That's great if you're buying and selling NFTs, or if you're regularly buying and selling crypto tokens on decentralized crypto exchanges. But if you're an average user, it's easy to see why you might not want to replace your current smartphone anytime soon.\n\nWill this Bitcoin diversion last?\n\nThe launch of the new spot Bitcoin exchange-traded funds (ETFs) could have broad ramifications beyond just Bitcoin. They could significantly impact the amount of new money that flows into Solana.\n\nIn the first two weeks of 2024, the flow of money into Solana has slowed to a drip. According to CoinShares, around the time of the spot Bitcoin ETF launch, Bitcoin accounted for a staggering 98% of all investor inflows into crypto.\n\nMaybe this is a short-term phenomenon. But what if it's not? For that reason, I'm keeping a close eye on institutional inflows into Solana over the next few weeks.\n\nAll in all, Solana looks good\n\nAnd, of course, there are many investors convinced that Ethereum will be able to fend off any advances from Solana and retain its position as the preeminent Layer-1 blockchain. There's also hype now building around a potential spot Ethereum ETF. If that ever gets approved, the thinking goes, it could have the same type of impact on Ethereum as the spot Bitcoin ETF has had on Bitcoin.\n\nThat being said, I'm still convinced that Solana is now a better long-term play than Ethereum. Solana has superior technology, as well as a potential game changer in mobile crypto. As a result, I'm bullish on Solana."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMi-AFBVV95cUxNSHNZOUVmWjlZWUlueHVjT3BOdWFuNE0tTi1QN29YNlhKTUZfVFJvSVEtcm9yalR0X3BXNnJueGRfSTRCbTlqeV9WMFZEclRYaEpGeDVReEg4dmpveGNWTkp6dWZTVTZ6WFpGaGd2c3RaVGp0eG9uU3hmYkdZamFYeTF6MGFYZ3NMLWNKdDZMYTl5MzF5eDljTHR2RlFmMkdkWHE4NDVaVzN1NmJsSHB6RlRsQ3FwdjNQTFdfTklTVmNQZG9PS3puTUlnS01HY3ZHRTVWN29NS0hpbDlneHdCY1VlSHRYX0ZDcG1NdGRHa1BQQUxob0U1NQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jan 2024 08:00:00 GMT",
        "title": "Crypto Buzz: XRP ETF Speculations Surpass ETH, While Pullix (PLX) Gains Massive Traction with 11,000 Presale Registrations in a Month - Techpoint Africa",
        "content": "Despite the major bear markets and fluctuations in price that Ripple coin (XRP) is facing, the cryptocurrency has managed to put up well, showing a strong resilience. A speculation about a Blackrock XRP ETF approval after Ethereum came up online last year, leaving most investors wondering what will become of XRP’s price, however, this news was later debunked as fake news.\n\nHowever, this year, the CEO of Ripple foresees an expansion of cryptocurrency-related ETFs to cryptos like Ripple, following the establishment of Bitcoin ETFs. Notwithstanding, Ripple coin still shows a promising price outlook just like Ethereum. On the other hand, Pullix is positioned for a higher rally as over 11,000 users joined its presale in a month.\n\nRipple’s CEO, Brad Garlinghouse Foresees ETFs Approval for Other Cryptocurrencies\n\nRipple (XRP) CEO is optimistic about the approval of various Bitcoin exchange-traded funds (ETFs) in the United States, expecting them to pave the way for similar cryptocurrency investment products in 2024.\n\nWhile he didn't explicitly predict approval for an ETF for Ripple, Garlinghouse anticipates that an Ether ETF will likely receive the green light soon.\n\nIn another talk with Thinking Crypto, James Seyffart doubts the chances of a spot XRP ETF in the U.S. by 2024, attributing it to the unresolved Ripple and SEC lawsuit and the absence of a comparable regulatory framework for Ripple.\n\nHe suggests that only after the Ripple and SEC case concludes and U.S. crypto regulations improve might a spot XRP ETF be considered, possibly in 2025, resolidifying Ripple as one of the top crypto coins.\n\nJP Morgan’s Prospect of an Ethereum (ETH) ETF Approval in the U.S.\n\nMarket optimism surrounds the potential approval of a spot Ethereum (ETH) ETF by May 23, the SEC's deadline for the Ark 21Shares application. JPMorgan gives a 50% chance for approval, influenced by Ethereum being seen as the next ETF candidate after Bitcoin.\n\nSome believe the SEC's omission of Ethereum in recent lawsuits hints at potential commodity classification, a key for ETF approval. However, JPMorgan analysts led by Nikolaos Panigirtzoglou express skepticism, seeing less than a 50% chance for approval by May.\n\nThe recent surge in Ethereum price this year is tied to hopes for an ETF approval, providing U.S. investors exposure to Ethereum without direct ownership. Ethereum price is currently on a weekly range of $2,450 to $2,600\n\nThe shift in how Ethereum operates and the ongoing legal issues with the SEC regarding certain exchange services are making it tough to approve an Ethereum ETF until these matters are resolved.\n\nPullix’s (PLX) DeFi Potential, Innovative Features, and Projected Market Growth\n\nWith over 11,000 participants, the Pullix (PLX) presale has garnered substantial interest in its DeFi market potential. Pullix stands out by merging features from centralized (CEX) and decentralized (DEX) exchanges, aiming to create a platform that overcomes common issues in online trading, such as asset limitations.\n\nThis innovative approach positions Pullix uniquely, allowing trading across various asset classes, including forex, gold, and cryptocurrencies, leveraging the significant $6.6 trillion daily volume of the forex market.\n\nThe presale has seen 70+ million PLX tokens sold, with the current value at $0.08—a 100% increase from its initial price. Experts anticipate a potential 280% increase before the presale concludes, ranking PLX among top crypto coins this year.\n\nWithin the Pullix ecosystem, exciting features include Copy Trading, enabling users to replicate successful trades, and a Lending Protocol, providing a flexible money market for lending and borrowing.\n\nThe PLX native token serves a dual purpose as a trading tool and as part of a revenue-sharing model. Stakers stand to receive a portion of Pullix's daily revenue positioning PLX as a good crypto to buy for gains. Furthermore, users can stake various currencies like DOGE and ETH for a fixed interest rate.\n\nVisit Pullix\n\nJoin The Pullix Communities"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTFBmOG9YV1FMbjFLSGUtSVZpTU5RdDJEU01oOVM5cndWNE1LaW1nNkl2UmtISDNXRkRnZUNVNG02bkxERHkyTTJmSWxlQmhrdzRubzZmNm5HUWFjQU9Ta3pwR3kxM09WM2trTzBTQ3MzTnA2LXliZk4wNG9n0gF_QVVfeXFMTlk1emdSSVl1WVhEX2tENS1wR3dPWnVBT1BJMGFJcGVDTklyaDJFRzljVzlZTm9WRU4xY1Y2WHRYUDRZRlFkR2U4SGNkaE8zdjR6N1NzVEoxWnZ2bGhQM093bDlCaHFhOHFYaTNsdzNsa3l3MXZsZGM1RFlsOXo5dw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jan 2024 08:00:00 GMT",
        "title": "Aave V3 Ready For Solana After This Crucial Vote Passed - NewsBTC",
        "content": "The Aave community has overwhelmingly approved a proposal that will set the ball rolling for deploying Aave V3 on Solana, a smart contracts platform. The motion, put forward by the Neon Foundation and the Aave Chan Initiative (ACI), passed with a majority vote of 83% based on results posted on January 21.\n\nSolana Fast Rising, DeFi Ecosystem Active\n\nSolana has been rapidly expanding, with its native currency, SOL, emerging as one of the top performers in 2023. To put it in perspective, SOL prices exploded from about $10 in 2023 to around $125 by the end of the year.\n\nThis surge saw SOL reverse losses of November 2022 while concurrently catalyzing events on the blockchain, spurring various activities, including the expansion of decentralized finance (DeFi), non-fungible token (NFT), and meme coin activities.\n\nRelated Reading: Bitcoin Price Turns Red, Why BTC Could Tumble Below $40K\n\nOn the other hand, Aave has been expanding to multiple Ethereum Virtual Machine (EVM) compatible networks, emerging as one of the leading decentralized finance (DeFi) protocols. According to on-chain data from DeFiLlama on January 22, Aave manages over $6.9 billion worth of assets across ten chains. A big chunk, over 90%, comprises assets on Ethereum. Aave v3 has a total value locked (TVL) of $4.9 billion.\n\nAave V3 On Solana, What It Means\n\nThe TEMP CHECK proposers are keen on Aave v3 deploying on Solana, considering the blockchain’s rapid growth in the past year. They observe that the blockchain’s DeFi TVL and broad user base would likely benefit the lending and borrowing protocol, cementing its position as a market leader.\n\nIf Aave is deployed on Solana, the protocol will access the deep liquidity on the blockchain. At the same time, users will access Aave services more conveniently. Subsequently, the proposers reiterated this move will cement Aave’s position as the leading liquidity market on-chain. Moreover, it will likely open up new opportunities for collaboration between the Aave, Solana, and other Neon EVM communities.\n\nRelated Reading\n\nXRP Crash Fears Mount As Whale Dumps 26 Million Tokens – Details 8 months ago\n\nNeon EVM is a cross-chain bridge for users to transfer assets between Ethereum and other blockchains. Through this bridge, Aave v3 will go live on Solana without any major reconfiguration of the protocol’s codebase. Among the tokens that will be initially supported is SOL. Users will be free to borrow USDC, a stablecoin.\n\nThe passing of the TEMP CHECK also reflects Aave’s ambition to expand across multiple blockchains beyond EVM networks. So far, Aave has been deployed on various platforms, including layer-2s like Arbitrum and Base, Avalanche, and Ethereum’s sidechain, Polygon.\n\nFeature image from Canva, chart from TradingView"
    }
]