[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTFB3S3FxR2tkVXYyckVFWGx3aGdoVkZXX2pabC1zU1g3bWJaSng2eGFtRnhDWUxGNVo2bTJkNWQydnJBNkVkNlAtOWJsMmJManJJRE9SR3dXYkdidHdMLWRqemcxcWQtN282RjZaRWRmaE5hc1E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 May 2024 07:00:00 GMT",
        "title": "Ethereum and Bitcoin are holding us back - Blockworks",
        "content": "The year is 2024, and the fast-paced realm of crypto shows no signs of slowing. Innovation is the name of the game, and monolithic blockchains like Ethereum and Bitcoin still reign supreme.\n\nBut as someone who’s been knee-deep in the trenches of blockchain development, I can’t help but wonder if these behemoths are really cutting it anymore. Herein lies my thesis:\n\nModular blockchains are the disruptors poised to revolutionize scalability and creativity towards the next Cambrian explosion of Web3 products as we know them.\n\nAs engineers and product developers, it’s time to embrace specialized tools for specialized tasks and leave the one-size-fits-all approach behind. This isn’t to say that prior layer-1s haven’t paved the way for some incredible innovations, but attempting to scale legacy layer-1 blockchains like Ethereum and Bitcoin has proven inefficient and counterproductive. They’re dragging us down, like trying to sprint through quicksand.\n\nBlockchain researchers have grappled with the challenge of creating the optimal system for years. Many architectures attempted to accommodate all users on a single chain or a tightly coupled group of chains. Yet, scaling such systems for billions of users is complex and limited. We’ve thrown everything and the kitchen sink at it with solutions like sharding and layer-2 blockchains to provide additional scaling methods.\n\nDespite this, most efforts still fall somewhat short in addressing all fundamental scalability issues. As a result of these failings, and perhaps in response to them, modular blockchains are strutting onto the scene as a more efficient and scalable alternative. Prime yourself and think, “more legos.”\n\nThe emergence of modular blockchains\n\nThink of modular blockchains like the Swiss Army Knife of blockchain development.\n\nThese chains break down the blockchain into modular components, specializing in specific tasks at the core of a blockchain’s architecture: execution, settlement, consensus and data availability. By distributing tasks across multiple specialized layers, modular blockchains can, in theory, achieve greater scalability, customizability and security at a faster pace. When you distribute the workload like that, magic happens — so why waddle about in intellectual exercises of scaling bloated layer-1s?\n\nAt the core of modular blockchain architecture lies a layered approach that’s as elegant as it is efficient. The old heavyweights like Bitcoin and Ethereum remain the foundational layer of the crypto economy and hold down the fort with their robust security and stability. Meanwhile, layer-2 solutions like rollups and sidechains provide scalability without compromising the security of the base layer. Lastly, layer-3 protocols offer specialized environments tailored to specific development needs.\n\nRead more from our opinion section: Ethereum is too hard to use\n\nOne of the first projects to propose modular blockchain development is the Celestia network. Celestia currently functions by separating execution from consensus and implementing data availability sampling (DAS) as a core feature.\n\nModular blockchains’ adroit-like qualities for specific engineering challenges translate into a targeted effectiveness to service specific industry niches.\n\nTo illustrate, GameSwift, a modular blockchain project, is currently working to facilitate the development of games hosted on-chain. Their goal is to create a network of applications that will help avoid gamers’ in-game purchases or earned assets being stored in a central server and consequently hacked. To highlight the relevance of this innovation, global gaming audiences spent approximately $54 billion on additional in-game content in 2020.\n\nThe shape of things to come\n\nModular projects are already pushing boundaries and redefining what’s possible in the blockchain space. Hybrid optimistic and zero-knowledge solutions are on the horizon, promising even greater scalability and security, as is the application of sharding, incentivized verification and parallelized VMs (virtual machines) on the execution layer of a chain.\n\nWith layer-1s feeling the heat, Ethereum devs released plans for a unified settlement and data availability layer: danksharding, a promising development, and a term I can’t say aloud without curling my lips. But development and on-time delivery for these monolithic chains’ upgrades have been historically slow and unmet.\n\nBy accepting monolithic chains as what might be holding us back, modular architectures offer a glimmer of hope. We are transitioning from monolithic blockchains and siloed consensus layers to modular, application-specific chains with shared consensus layers.\n\nWhile challenges remain in standardizing cross-chain communication and ensuring decentralization at each level, the potential benefits of modular blockchains are too compelling to ignore. These blockchains have the potential, and are already being applied, to impact industries like supply chain management, real estate (property transactions), digital identity verification, energy grid management and even healthcare data management.\n\nWhether you’re a die-hard Bitcoin maximalist or an Ethereum enthusiast, one thing’s for sure: In a modular future, users emerge as the ultimate beneficiaries.\n\nNiko Hosn, CTO of ZTX and founder of RareMint, is an expert in Web3 gaming and blockchain development. At ZTX, leveraging ZEPETO’s IP — the largest metaverse in Asia with over 430 million lifetime users — he empowers blockchain adoption, fostering a thriving on-chain world for communities and creators.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxPelg2Vk1ESVlqb2ZaYm1nNFgtOVh0T1A3T19YanNTUTN3N2toeFd5VWRjUE53TmY3cktmTFJRaGRZVmc2QTBTXzlQWGhYbGF3cmxxczRoS3lrV0JNNkVLOE9leWxLTlY1d3c0T0M0M3g0TXVnTjh1VU55NDdoSVZhVVFCbV9scXl1d3p5Y3JiVTZqUWJtdFE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 May 2024 07:00:00 GMT",
        "title": "5 Things to Know About Ethereum's First Spot Price ETFs - The Motley Fool",
        "content": "The SEC has finally cleared the way for the first Ether spot price ETFs.\n\nOn May 22, the U.S. Securities and Exchange Commission (SEC) approved the first eight applications for Ether (ETH 0.33%) spot price exchange-traded funds (ETFs) from Grayscale, Bitwise, iShares, VanEck, Ark Invest, Invesco, Fidelity, and Franklin Templeton. Ether is the world's second largest cryptocurrency and the main coin of the Ethereum Network.\n\nThat announcement came just four months after the SEC cleared the first spot price Bitcoin (BTC -0.94%) ETFs for trading. But should investors assume these planned ETFs will set a firm floor under Ether's price and become compelling long-term investments? Let's review the five key facts to decide.\n\n1. The first Ether ETFs won't start trading anytime soon\n\nThe SEC approved the initial regulatory filings for the eight Ether ETFs, but they won't start trading until the agency approves their S-1 filings. That process could take several months. For reference, the SEC approved the S-1 filings for the first Bitcoin spot price ETFs approximately three months after clearing their initial regulatory filings.\n\n2. The decision turns Ether into a commodity\n\nIn the past, the Ethereum and Bitcoin blockchains both used an energy-intensive proof of work (PoW) mining method to produce coins. But in 2022, the Ethereum Network switched to the more energy-efficient proof of stake (PoS) method. That transition, known as \"The Merge,\" reduced the network's energy consumption by 99.95% and made it deflationary -- which meant more Ether was being burned than produced.\n\nHowever, the SEC initially claimed The Merge made the Ether coin and Ethereum-based tokens more similar to securities than commodities. The move made a radical change to how Ether coins are created and managed. Regulators then repeatedly declared that Bitcoin was the only cryptocurrency that could be classified and pinned to spot price as a commodity, since it was digitally mined like a precious metal through the PoW method.\n\nTherefore, the SEC's decision to approve the first Ether ETF filings implies the coin can now be classified as a commodity instead of a security. That shift might clear the way for smaller Ethereum-based tokens such as Shiba Inu -- as well as independent PoS-driven cryptocurrencies like Solana -- to get their own spot price ETFs.\n\n3. Ether ETF investors can't stake their holdings\n\nAnother key difference between Ether and Bitcoin is the process of \"staking,\" which allows investors to earn interest by locking up their Ether coins on the network for a period of time. The SEC, which argues that staking-as-a-service solutions should be classified as unregistered securities, previously sued cryptocurrency exchanges including Coinbase (COIN -6.83%) and Kraken for allowing users to stake their own coins.\n\nGrayscale, Ark, and the other firms originally wanted to add staking features in their ETFs, but they removed those proposals in their updated filings last month. That change could make their ETFs less appealing than the actual digital coins.\n\n4. The SEC approved the filings probably to avoid more litigation\n\nLast year, the SEC lost a lawsuit against Grayscale, which had sued the agency for trying to block the conversion of its popular Bitcoin trust into an ETF. That loss softened the SEC's position and cleared the way for the first Bitcoin ETFs.\n\nEarlier this year, blockchain company Consensys sued the SEC for its refusal to recognize Ether as a commodity, while Grayscale and its peers were widely expected to sue the SEC again if it didn't approve their regulatory filings for spot price ETFs. So for now, it seems the SEC has backed off on tightly regulating Ether to avoid more legal battles.\n\n5. The Ether ETFs should attract less attention than the Bitcoin ETFs\n\nGrayscale currently holds nearly $11 billion in assets in its GrayScale Ethereum Trust (ETHE -3.95%), which it's attempting to convert into a spot price ETF. However, that's a lot smaller than the Grayscale Bitcoin Trust before its conversion into its spot price ETF, which now hosts more than $20 billion in assets.\n\nThese new Ether ETFs might attract some attention from mainstream and institutional investors, but they probably won't gain as much momentum as the Bitcoin spot price ETFs earlier this year. Ether also doesn't have any major near-term catalysts that are comparable to Bitcoin's halving, which halved the rewards for mining, earlier this year.\n\nShould you buy the Ether ETFs?\n\nThe Ether ETFs might not attract as many investors as the Bitcoin ETFs, but they might represent an easy way for investors to gain exposure to Ether without directly buying the coins. But investors should still be mindful of the fees, see if they actually match Ether's spot price, and realize they won't be able to stake their holdings.\n\nTherefore, investors shouldn't rush to buy the Ether ETFs once they hit the market. Instead, they should wait and see if the convenience of owning these ETFs in a brokerage account outweighs the advantages of owning Ether in a crypto wallet."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxNYVE4YW9La3owTVBCVHZsUzlXTC1hNWZpWjRxQ0NFM2VFempBSmNncE9ybHotUmZJQ2lvanUxMFQyanRBWFVnMWc4NGNmQUhDWlpjMkk5cFNia3p0SnZOZGt0VkN0U1pNS2VaeFJUbUNsd2pPcmdCSU9TdUc1QkJPR3VTeHo4ZzJOcDlnTGJIY2xKd3djRnBFYnh2N09aZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 May 2024 07:00:00 GMT",
        "title": "Floki, Dogwifhat, and Pepe lead memecoin rally alongside Ethereum ETF approvals - Fortune",
        "content": "So-called memecoins have been rallying over the past week—and among the five cryptocurrencies to gain the most are four Solana-based tokens. Floki leads the way (up 35%), followed by dogwifhat (32%), Pepe (27%), and Bonk (22%), according to CoinGecko data as of Tuesday morning. Bonk reached highs of $0.00004387, missing its all-time high of $0.00004547 in March by a razor-thin edge.\n\nThe price surges overlap with the Securities and Exchange Commission green-lighting eight spot Ether exchange-traded funds, with firms such as BlackRock, Grayscale, and Fidelity among the filers. Memecoins, considered to be the highest risk and highest reward part of the crypto industry, often witness notable price swings during a pro-crypto news cycle. By contrast, Ether has climbed a modest 2% since Thursday’s approvals, trading at $3,847 on Tuesday morning.\n\nThe ETF approvals have “people bullish on the far fringes of the coin space,” Derek Horstmeyer, a professor of finance at George Mason University, told Fortune.\n\nIndeed, Google Trends data shows that search interest for “Ethereum” over the past 12 months is near all-time highs, and memecoins are “heavily driven” by this kind of market attention, says Pat Doyle, a blockchain researcher at Amberdata.\n\n“The theory is that as money flows into the ecosystem through ETFs, it often trickles down to these smaller projects,” Jonathan Bixby, chairman of Phoenix Digital Assets, told Fortune. Memecoins have surged recently because of their “small caps” compared with those of other cryptocurrencies, he says.\n\nMemecoins occupy just a fraction of the market capitalization of major currencies: Floki boasts a market cap of just $2.9 billion, compared with Ethereum’s $460 billion, according to CoinGecko data. In other words, Bixby suggests that investors of fringe coins could be anticipating a rising-tide-lifts-all-boats effect once the ETFs begin trading.\n\nHowever, Matt Ballensweig, managing director at BitGo, told Fortune that he doesn’t attribute the recent growth for some memecoins to the ETF approvals or a single event, but it is “a sign that momentum across other layer 1s (such as Solana) continues to remain strong.”\n\nHe added: “Solana has basically solidified itself as the chain with the most ‘speculative fun’ as traders continue to gamble on memecoins on decentralized exchanges.”\n\nOne reason why Ether has shown minimal price movements since Thursday is likely because, so far, the SEC has approved only the 19b-4 forms. These initial filings submitted by soon-to-be issuers allow the securities to be listed on exchanges. But for trading of the financial instruments to begin, the SEC must next approve the issuers’ S-1 filings. These forms outline to potential investors and the SEC the structure of the asset, how it will be managed, and, in this case, how it plans to mirror the performance of the underlying asset—Ether tokens.\n\n“We can’t recall anytime there would be S-1s not approved after a 19b-4 approval. I don’t think a precedent exists,” Eric Balchunas, Bloomberg’s senior ETF analyst, previously told Fortune. He estimated the forms would take about two weeks to be approved."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQS0VXVjh6ejROTWVpQ2FHTExQV0c0ekhWSkUwaG04ODNzb3E3WkwybEtqcGQweFJWSHFOYVFRMHZBVkZkWVQ3d0VYN3hoQi01UmE0LURWcWQ0bFlmUU5IdGt5bnVEWXByLWNSS1hnZExBYmU4US1wWnZQZDB0dFBlQmxmTjlKLXJkM3Z4bVIxdGNHa2FDVmZHcQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 May 2024 07:00:00 GMT",
        "title": "Why Bitcoin, Ethereum, and Dogecoin Are Taking a Breather Today - The Motley Fool",
        "content": "These three megacap tokens are seeing significant selling pressure to kick off the short week.\n\nAs we kick off a short week, investors in a range of speculative assets are seeing selling pressure build. Of course, there are plenty of macro reasons for this trepidation. Some rather important inflation readings are due later this week, which could impact everything from growth stocks to commodities to cryptocurrencies. Everything is tied to interest rates these days.\n\nIn the crypto world, Bitcoin (BTC -0.95%), Ethereum (ETH 0.32%), and Dogecoin (DOGE -3.81%) are among the megacap tokens seeing declines today. Over the past 24 hours, these three top tokens have slumped 3.8%, 3.5%, and 4%, respectively, as of 2:30 p.m. ET.\n\nLet's dive into what's driving today's price action in these top tokens.\n\nEnthusiasm over key catalysts wears off\n\nInvestors in these three megacap tokens have certainly had quite the run over the past few weeks, and really since the beginning of the year. Bitcoin started the party off with the approval of a dozen spot exchange-traded fund (ETF) products, which conjured up some significant demand for its token. In combination with a halving event, which saw the amount of newly minted Bitcoin slashed in half, this created a supply-and-demand dynamic investors liked.\n\nEthereum recently saw similar catalysts take hold, with the Securities and Exchange Commission (SEC) approving spot Ethereum ETFs last week as well. Additionally, previous upgrades have resulted in Ethereum becoming less inflationary, and depending on the day, deflationary based on token burn metrics relative to transaction volumes.\n\nAs a more speculative asset, Dogecoin has ridden market momentum higher. But with these catalysts now seemingly in the rearview mirror (it's really amazing how quickly the market adjusts to news, particularly in this space), some investors may be looking to sell into this news and wait patiently for another catalyst to take hold. A similar \"sell the news\" effect took place immediately following the anticipated approval of spot Bitcoin ETFs earlier this year.\n\nUntil the next catalyst takes hold, investors appear to be on pause for the next reason to bet big on this sector (and these three tokens by default).\n\nA pause in the rally, or a reversal?\n\nNow, the question is whether this recent dip is a sign of more downside to come, or if it's simply a consolidation period before the next move higher. Earlier this month, a speculative wave hit the crypto sector, driving everything from meme tokens like Dogecoin to large-cap cryptos like Bitcoin and Ethereum higher. But since then, it appears the broader crypto market is awaiting the next catalyst on the horizon.\n\nThere is certainly a tremendous amount of innovation and technological movement happening underneath the surface in the crypto realm. I wouldn't be surprised to see headlines pop up for any of these three tokens that have the ability to move the market higher, with all three benefiting from positive news. I just don't know what the catalyst will be, or when positive momentum can be expected to build again. For now, I'm happily watching this price action from the sidelines."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxPSkxIcTBPUEdxVEY2TkVvSy1qZ2FZeTc5Ym1qb3VMWEZmUGNydS1wYmh4R0hucUE0WHl5d0hyV1dGVDNjTGxoWDZGWGNtYzFJbHpNMTllZlluRFhCeDR4alJRb3Q5MnNXRHpYWG1zM3U1dWtGeEhLMU41S0tScXJVUW9n?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 May 2024 07:00:00 GMT",
        "title": "Ethereum Nears $4,000 as ValueZone Prepares for Potential All-Time Highs Amid Rising Institutional Interest - Yahoo Finance",
        "content": "ValueZone\n\nLondon, UK, May 28, 2024 (GLOBE NEWSWIRE) -- As Ethereum (ETH) approaches the crucial $4,000 mark , ValueZone, a pioneering cryptocurrency trading platform, is strategically enhancing its services in anticipation of Ethereum's potential surge to new all-time highs. This significant uptrend coincides with growing institutional interest, especially with the impending launch of Ethereum spot ETFs, signaling a robust future for the second-largest cryptocurrency.\n\nEthereum's Bullish Market Trajectory:\n\nRecently, Ethereum has seen a remarkable 5% increase in price, moving it closer to the $4,000 threshold. This upward movement is energizing the crypto community and attracting substantial institutional attention, bolstered by the expected launch of Ethereum-based spot ETFs . \"We are closely monitoring Ethereum's performance and are preparing our platform to support our users through what could be a historic market movement,\" said Adam Carl Waldman, CEO of ValueZone.\n\nEnhancing Platform Capabilities for Ethereum Traders:\n\nIn response to this market activity, ValueZone is implementing several strategic enhancements to ensure that traders can fully capitalize on Ethereum's momentum. These include upgraded trading tools designed to handle increased transaction volumes, enhanced analytical features for better prediction accuracy, and more robust security measures to protect user assets.\n\nPositioning for a New All-Time High:\n\nWith Ethereum's price surge and the cryptocurrency community abuzz with the potential of reaching a new all-time high of $5,000, ValueZone is positioning itself as the go-to platform for both seasoned investors and newcomers. The platform is focused on providing comprehensive support and resources that enable users to navigate the volatile crypto market with confidence and insight.\n\nAs Ethereum continues its ascent, ValueZone remains committed to delivering top-tier trading experiences, underpinned by a deep understanding of cryptocurrency market dynamics and continuous technological innovation.\n\nFor more information about how to get started with ValueZone and make the most of the crypto summer, visit https://valuezone.ai or use media contacts.\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency & securities.\n\nStory continues\n\nCONTACT: Media Contact Details Contact Name: r Contact Email: siodinaedgar(at)valuezone.ai Company Name: Wealth Investment Blockchain Company Ltd. City/Country: Essex, United Kingdom Website: https://valuezone.ai\n\n\n\n"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE9UdEJucnhWNXJEVFRSQXRBT0IzaWs1ZlpQQVROQjlXdVRULWo0Z3oxVDdfZzFFYmEyckJTeUwxNXktLUs1VmhNa2t5ZVFsUFdtQUVETnV1cE16eHFZd0NQX0tsSE1jS2N3azhBUTZXTkJtZ1drVkcxMdIBfkFVX3lxTE83WDNNaWtyYl9zWnVSNjVROEwxdFRGelBFSG1fMFdpYi1CeXkxSTI4b1NCanpMbjMtdUxrLURHSDluV1oySnJXeG1BTmdMT194M196cWFWOG5PVVhFSnJjTGhCTkZpeXNobzhjU2Y4UHRxdFctUm94cHJHWTY3dw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 May 2024 07:00:00 GMT",
        "title": "$8 Billion of Ethereum (ETH) in 24 Hours: What's Happening? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nWith the Ethereum ETF craze covering the cryptocurrency market like a fog, the activity of large holders is through the roof. More than $8 billion worth of ETH has been transferred between whales, which creates an interesting situation: the activity is here, but the price is not moving for now, consolidating at around $3,900.\n\nAdvertisement\n\nThis amount of large transactions is remarkable. There have been more than 6,780 large transactions in the past 24 hours and a seven day high of 9,790 transactions, But for all the activity, the price of ETH has been relatively unresponsive.\n\nThe chart reveals that there are extremely high levels of transactions being offered up, amounting to an incredible 2.14 million ETH in the past day. This level of transactions is in line with the current hype over an ETF, since institutional interest tends to drive whale behavior.\n\nThe seven-day high for transaction volume was 3.21 million ETH, while the low was approximately 981,530 ETH. The implications of this volatility are that there is an extremely fluid market in which large holders are very much on the move and shaking about, presumably in the hope of signaling impending price movement.\n\nAdvertisement\n\nOddly, though the transactions are high in the number of units and in value in many cases, there is relative moderation in price volatility. The volatility index lists a 30-day high of 62.38% and a low of 40.72%, and that means the market, with all of its transactions, is not experiencing big price swings.\n\nIf the ETF story continues to play out and more institutional money comes into the ETH space, a breakout higher than $4,000 may become a reality in the future. But, if this action is simply a reprieve to profit, or a redistribution in the face of weakness being perceived below the surface of the market, it may have trouble keeping up its courage."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMi3wFBVV95cUxQcHVvaER6R0tSZUVKS25NeFZUdDlNY0x5Umd3bUJmVmFjOFBURU1lQTVHbjk3OVZsMWJHWVRJNURSR0Y0R0NBT2NQRVNmdkNYS1VzSEQtMHozeWRhVGhLVV9XMkVJUVpRbjZ5eGFhZXdBRllrTHRRbFotQ2FrSkp3Rm96V09wUmJ5OGY0R0dneUdIUFhTSElfM3FibFlUQXVxb0ZpZXdJc3VkOUdjQ0I1OFdpeGV4SG9RUmx2V0x3dWxPRUNwaWlCM3lZQjhFa2NKS21POHpBQVBvalV6VUVZ0gHkAUFVX3lxTE1DekEyZ2ZycjV0cnZwUFF6alZXeFF2ai1YbGZXWFNyWFlPanF1aGFwQ1prRWlSVW9jdjl0LUk2cEhjZnNTSFE0dGJBQnRkaHZNai0wTmx5eHZZekVWa3U5TGdSTjkxQkJNQUtMd0EtbFB2V1EyNmxYWWQ2aDkxVVpHWnBzc1JndWJTVWlYWWdJREtNS1N4Z1NvN0xlSVNRVHlBQlNNRHVKa1RCZUctdUxrSjdiUXpHZlMxdmwzcFFWbC1tVVZHdlhUc25IbXZndnFXd2c0MFZTd0FhTW1LOVFSR0xmNQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 May 2024 07:00:00 GMT",
        "title": "Ethereum may continue outperforming Bitcoin as 'programmable money' may be ETH's new slogan - FXStreet",
        "content": "Ethereum transitioned from a Proof-of-Work (PoW) to a Proof-of-Stake (PoS) mechanism in an event christened “The Merge.” The transformation came as the network wanted to achieve more security, cut down on energy consumption by 99.95%, and execute new scaling solutions with a possible threshold of 100,000 transactions per second. With PoS, there are less entry barriers for miners considering the reduced energy demands.\n\nStaking is a process where investors grow their portfolios by locking their assets for a specified duration instead of selling them. It is used by most blockchains, especially the ones that employ Proof-of-Stake (PoS) mechanism, with users earning rewards as an incentive for committing their tokens. For most long-term cryptocurrency holders, staking is a strategy to make passive income from your assets, putting them to work in exchange for reward generation.\n\nEthereum uses decentralized blockchain technology, where developers can build and deploy applications that are independent of the central authority. To make this easier, the network has a programming language in place, which helps users create self-executing smart contracts. A smart contract is basically a code that can be verified and allows inter-user transactions.\n\nEthereum is a decentralized open-source blockchain with smart contracts functionality. Serving as the basal network for the Ether (ETH) cryptocurrency, it is the second largest crypto and largest altcoin by market capitalization. The Ethereum network is tailored for scalability, programmability, security, and decentralization, attributes that make it popular among developers.\n\nEthereum is trading around $3,837 on Tuesday as it enters a sideways movement. While current price movement suggests bulls may be running out of steam, it may also indicate a temporary slowdown until the market receives clarity on conversations surrounding the spot ETH ETF S-1 approvals.\n\nEthereum (ETH) followed a sideways trend on Tuesday as the crypto community seems to favor the term 'programmable money' as ETH's one-liner. Meanwhile, whales have continued accumulating ETH despite profiting from the recent price spike.\n\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all or a portion of your investment, as well as emotional distress. All risks, losses and costs associated with investing, including total loss of principal, are your responsibility. The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of FXStreet nor its advertisers. The author will not be held responsible for information that is found at the end of links posted on this page.\n\nIf not otherwise explicitly mentioned in the body of the article, at the time of writing, the author has no position in any stock mentioned in this article and no business relationship with any company mentioned. The author has not received compensation for writing this article, other than from FXStreet.\n\nFXStreet and the author do not provide personalized recommendations. The author makes no representations as to the accuracy, completeness, or suitability of this information. FXStreet and the author will not be liable for any errors, omissions or any losses, injuries or damages arising from this information and its display or use. Errors and omissions excepted.\n\nThe author and FXStreet are not registered investment advisors and nothing in this article is intended to be investment advice."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxPQTJWSHhqSktkM0pmRkJ5RXl6Njl0Zkh3Z0tEUW1pQkR1UmZWNHFneS1jOEdFZlhQRE1VYnZKX1JUV3RwWFg2RVFXaThUX1dvNWgxMDA4SDR1Y2RYWGFudENHRG1WNEJQb3QtTGlqenQ4SlZ1Z29IeV9UNVdZUVptZFVQRGFqSGFvRUJfd2c3NHJjdFBjX1VCUUpiekxjQlJmUWJpcWtCLVhtUkpBU3hUREFFZEtzdEXSAbwBQVVfeXFMTlE4VzFKd2dYLVpQUmpkS1NyU1ZFaGVyanNEUTdqaDk5amhncnhCb3JqYmYzWG1YeHNKMkJuSk56NjNSNG5Eanh5RUlBZl9Sa3dseVllWVQydEhIcC1iZG5sVHlMU3pWbVgybEFyYVptVWdyZlhiSmZYX0xpX3ZJdVJZeXlHYnU0LWdCdVhYOVRjOWtmNzJMRG5MV0FfQnk2Sy1GU0lRb1A3YktiRVg4cW43UHh1MlJjZzZjbDA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 May 2024 07:00:00 GMT",
        "title": "Ethereum price surges, breaks out of falling wedge pattern - Forbes India",
        "content": "\n\n\n\nEthereum (ETH) has seen a significant price surge over the past week, rising more than 27% and breaking out of a falling wedge chart pattern. This breakout suggests a potential reversal from the previous downtrend and hints at the possibility of Ether reaching new all-time highs.\n\n\n\nThe falling wedge is a bullish reversal pattern when the price makes lower highs and lower lows within a converging downtrend. The breakout from this pattern indicates that selling pressure is waning, and buyers are gaining control. Additionally, Ether has flipped key resistance areas into support, providing a solid base for further gains.\n\n\n\nThe recent price surge in Ethereum has also been accompanied by a decline in Bitcoin's dominance, suggesting that traders' attention is shifting towards Ether. Bitcoin's dominance, which measures Bitcoin's market share relative to the overall cryptocurrency market, has fallen over 0.98% in the past five days, while Ethereum's dominance has risen 4.4%. Over the past 24 hours, Ethereum's dominance has increased by 1.45%, while Bitcoin's dominance has decreased by 0.57%.\n\n\n\nAnalysts are also bullish on Ethereum's potential to continue its upward trajectory, with some predicting that the cryptocurrency could reach as high as $4,500 before the launch of the first spot Ether exchange-traded funds (ETFs) in the United States.\n\n\n\nArthur Cheong, the founder and CEO of crypto-focused investment firm DeFiance Capital, believes that Ether could rally to the $4,500 mark before the first spot Ether ETFs start trading. In a May 26 post, Cheong tweeted on X that “4.5k before spot ETF go live for trading imo”.\n\n\n\nThe positive sentiment surrounding Ethereum's price outlook is primarily driven by the recent developments around the potential approval of spot Ether ETFs in the U.S. On May 20, Ether's price rose nearly 20% within a day, following reports that the U.S. Securities and Exchange Commission (SEC) has U-turned on spot Ether ETFs, possibly due to political pressure.\n\n\n\nAs of May 28, Ethereum (ETH) is trading at approximately $3,800, with a market capitalisation of USD 463.51 billion.\n\n\n\nShashank is the founder of yMedia. He ventured into crypto in 2013 and is an ETH maximalist.\n\nTwitter: @bhardwajshash\n\n\n\n"
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxOSEtwNEwzXzk0ZVpCVjdRbWZXaEcwZm5IUDA2aVE2VUMtaURvQlFoNDlla2FjdFVLcnB0VlVLM29wOHotSk1JTHdIMU45TDNWRXRtMGY0Y0FCV0VnVnZzN0p3S1lVRGhvSzl3aE1waGJpbGhZb2NFZl92SUM2UERNeGp5Z2VZMmUxdFMwNW5nS04wUUdKRmdRMVpBTTNDTklxQ0JLSTY4cUs0OTl6Nm13R0lFd2RRXy0tLXFNM3dB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 May 2024 07:00:00 GMT",
        "title": "Ethereum Name Service (ENS) propone di espandersi e di lanciare il proprio layer-2 - The Cryptonomist",
        "content": "Yesterday, ENS Labs, the company responsible for managing the decentralized service Ethereum Name Service, presented a governance proposal where it invites the community to expand its dapp into a layer-2 network.\n\nWe still don’t know anything about the prototype of the network that ENS aspires to migrate to: all we know is that as a fundamental criterion the new chain must be EVM compatible, censorship-resistant, decentralized, and open source.\n\nAnche il money market Aave e la piattaforma di restaking Etherfi stanno pensando di tuffarsi nel panorama dei layer-2 lanciando una rete proprietaria.\n\nLet’s see all the details below.\n\nENS wants to launch its own layer-2 blockchain\n\nEthereum Name Service (ENS), protocol for the creation of domini on the Ethereum blockchain, is considering migrating to a layer-2 to address some technical limitations and improve the end-user experience.\n\nQuesto è quanto riportato da ENS Labs, organizzazione non-profit situata a Singapore che si occupa dello sviluppo della piattaforma ENS, che con una proposal di governance ha condiviso ieri l’idea con la community del progetto.\n\nWithout revealing too many details, the company emphasized the potential benefits that would be brought to the protocol, such as improved scalability with reduced gas fees and the introduction of new advanced features.\n\nIl nuovo layer-2 dovrà essere necessariamente compatibile con lo standard EVM, oltre che resistente alla censura, decentralizzato e open source.\n\nIntroducing ENSv2: The Next Generation of ENS 🎉🎉🎉\n\n\n\nENS Labs is excited to announce our proposal to extend the ENS protocol to a Layer 2 network. This move isn't just about migrating parts of the protocol; we're re-envisioning the architecture from the ground up! pic.twitter.com/3xM6owTpKk — ens.eth (@ensdomains) May 28, 2024\n\nIn the world of finance, the terms “bull” and “bear” are often used to describe market trends. A “bull” market is characterized by rising prices and investor optimism, while a “bear” market is marked by falling prices and investor pessimism. Understanding these concepts is crucial for anyone looking to navigate the financial markets effectively.\n\nSince 2017 ENS has established itself as the leading platform for on-chain domain registration, effectively becoming the bridge between traditional internet and the decentralized web.\n\nWith the passage of time, however, the ambitions of this protocol have also changed, which now in order to truly become mainstream aims to offer lower gas costs than Ethereum fees and faster transactions.\n\nThe Ethereum blockchain is indeed excessively expensive to use when there is too much congestion, skyrocketing the commission costs to execute a simple transaction or approve a smart contract.\n\nIf the proposal is accepted by the community, the domain registration phase will move to layer-2, which will become the new platform for user interactions in all respects.\n\nWith the update, a new hierarchical system is also proposed for more effective management of domini, where the holders of these resources will have access to a unique register, where they can check the subdomains and configure the resolvers.\n\nFurthermore, the transition to ENSv2 implies the improvement of l’interoperabilità multi-chain, with the functions of ENS that will also be brought within other cryptographic ecosystems.\n\nWe still do not know the timing of this fundamental transition in the history of Ethereum Name Service, but it is likely that the migration could take place in 2025, provided the proposal passes.\n\nRegarding the news Eskender Abebe, Product and Strategy Manager at ENS Labs, reiterated how the release of Ethereum Improvement Proposal (EIP) 4844 which introduced the function of BLOB in Ethereum rollups with Dencun, was a factor of enormous importance that motivated the team to evaluate the transition to layer-2, effectively making transactions on these second-level networks cheaper. These are his words:\n\n“The release of EIP4844 has made Ethereum-based layer 2 networks much more convenient and scalable, which has been a major driving factor for the ENS proposal.”\n\nAave and Etherfi also consider a proprietary layer2 network\n\nENS non sarebbe l’unico top protocollo della blockchain di Ethereum a pensare ad una migrazione presso un layer-2 più scalabile: dopo il recente successo del trend delle soluzioni di ridimensionamento zk-rollup e degli optimistic rollup, con il TVL di questa nicchia che ha superato i 47 miliardi di dollari, sempre più entità puntano a lanciare la propria chain con appoggio su Ethereum.\n\nOne of these is Aave, a very famous lending protocol that should soon complete the upgrade to Aave V4 with the platform aiming to introduce a unified multi-chain liquidity layer, becoming much more efficient in all respects.\n\nThe founder of the project, Stani Kulechov, in a recent post on X informed his community that after the V4 Aave could launch its own layer-2 network expanding its DeFi ecosystem towards new horizons.\n\nWe remind you that Aave represents the third largest dapp on Ethereum after EigenLayer and Lido, with a TVL of 13 billion dollars: if it landed on an L2, it would effectively become the largest secondary network on Ethereum, even beating the industry leader Arbitrum.\n\nIt would simultaneously also be the third largest chain in the entire Defi sector, behind Tron and obviously the parent company Ethereum.\n\nWe do not know the technical details of the new product but we know that the official launch is scheduled for 2025.\n\nThis is not a drill, Aave Network is planned to come after V4. https://t.co/a43nNlT114 — Stani^ (@StaniKulechov) May 27, 2024\n\n“`html\n\nAnche EtherFi, noto protocollo di restaking di ultima generazione con un TVL di 6 miliardi di dollari, ha in programma di costruire un layer-2 proprietario in futuro.\n\n“`\n\nAfter achieving enormous results in the market, such as the introduction of native restaking on L2s, the launch of its own token as an airdrop, and the release of a debit card to collateralize the balance in the protocol by borrowing USDC, now EtherFi aims for the next step.\n\nEven here, the details of this step are not known, except that it could likely happen in 2025, contributing to making user transactions much faster and cheaper.\n\nThe objective for the protocol is to improve the user experience and expand its connections with the DeFi landscape, aiming to attract as many resources and liquidity as possible."
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQTV9tMmhBVEJoYTlRdXFfMHZqLUtuOUVOd1BoSUtrRU5KZjh3UldSd3pENm9IN3pvdzFaSWYwXzhWdE9qMGtyRlpYSEdOaWJITWw0c19UcHV2Mlg2REwyTUlidm9WZnFWNEh3VHhicmRMbW45bnFZZlB1QWltTnJqekxLQmNCNTdKR213Nmd0OEU3OS0xTFBvUA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 May 2024 07:00:00 GMT",
        "title": "WisdomTree lists physically backed Bitcoin and Ethereum ETPs on LSE - Funds Europe Magazine",
        "content": "WisdomTree has listed its WisdomTree Physical Bitcoin and WisdomTree Physical Ethereum ETPs on the London Stock Exchange ( LSE), making it one of the first issuers approved for listing crypto ETPs on the LSE.\n\nThese ETPs come with a management expense ratio of 0.35%, making them among the “one of the lowest fee levels for institutional-grade Bitcoin and Ethereum ETPs that are 100% backed by the underlying assets”. However, these ETPs are currently available exclusively to professional investors.\n\nBlackRock reports record fixed income inflows in 2023 global ETP market\n\nThe WisdomTree Physical Bitcoin ETP, launched in 2019, is designed to offer a straightforward, secure, and cost-effective way to gain exposure to bitcoin’s price. It ensures easy investor access, tradability, transparency, and institutional custody solutions within a robust structure. Similarly, the WisdomTree Physical Ethereum ETP provides secure and low-cost exposure to Ethereum, allowing investors to access ether and receive staking rewards through a transparent and risk-managed approach.\n\nWisdomTree launches megatrends ETF for thematic investing\n\nAlexis Marinof, head of Europe at WisdomTree, remarked: “As an FCA-regulated business, we have over 250 ETFs and ETPs listed on the LSE. Listing our Bitcoin and Ethereum ETPs is a natural evolution of our offerings and underscores our commitment to supporting UK investors. With rising interest in the asset class among European investors, particularly due to the new fee environment and the launch of US spot bitcoin ETFs, we foresee this development as a pivotal moment for Crypto ETPs in the UK.”\n\nMarinof highlighted that the asset manager’s expertise, combined with robust and scalable business managing over $100 billion in global assets, allows it to “offer highly competitive fees without compromising security or risk management.”\n\nWisdomTree’s European crypto ETPs are now available for sale in multiple countries, including Austria, Belgium, Denmark, Finland, France, Germany, Italy, Ireland, Luxembourg, Poland, Netherlands, Norway, Spain, Sweden, Switzerland and the UK."
    }
]