[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxQd095X01xVE11SFJCRjVmSjFwczh3c0tNa3A0SEg2US1KWHdtUElYOUdFZ3FVa2x2N2ZtTVhDZnQyNXV2eC11WmFFMXBIcVZvU2tMcDJZOGNOdFhSTzJheGxlNmxGYUwtWEpNdS1RbS1VMDk4QVhmbkRMMWFhUjdkcGlIb3lPSkdrWnZlcVpOeW9vc3hURzQ3eVhKVmlyY1JlS2JIM0JUM3Fwb2RQVzEyelZlX2g3YzNlNXpZY29oVGx0SUdQaGpGREJPTXRxUW05bXVxZWhFQ0R0UDNqUGcxQjY2TkFBN0I1?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "EY launches OpsChain Contract Manager solution to support secure private business agreements on public Ethereum - EY",
        "content": "Facilitates the fulfilment of complex, multi-party business agreements, supporting confidentiality and helping improve time efficiency and cost reduction\n\nUtilizes public blockchain's security and accessibility with data privacy through zero-knowledge proofs (ZKPs), enhancing contract integrity and mitigating value leakage\n\nAddresses the enterprise challenge of managing multi-party contracts across siloed systems, internally and with business partners\n\nThe EY organization today announces the launch of EY OpsChain Contract Manager (OCM), a transformative blockchain-enabled solution for contract management. EY OCM helps enterprises to execute complex business agreements, supporting confidentiality, helping improve time efficiency, and achieving cost reduction, with automatic adherence to the agreed terms.\n\nLaunched at the annual EY Global Blockchain Summit, EY OCM helps address the enterprise challenge of managing business agreements that run across internal and external operational and technology siloes. EY OCM synchronizes data across business partners and uniformly enforces key business terms such as standardized pricing, volume discounts, rebates and strike prices.\n\nEnterprises often struggle to fully implement and capture value from their business agreements. Spend gets fragmented across internal enterprise barriers, making it hard to track and qualify for agreed-upon discounts and rebates. Smart contracts enable aggregation of spend across systems and even external business partners and then consistently applies contract terms.\n\nDriven by this value proposition, Zion Market Research predicts that the global smart contracts market will grow to an estimated US $1 billion by 2030 with a compound annual growth rate (CAGR) of roughly 24% between 2023 and 2030.\n\nThe solution runs on the Ethereum public blockchain, enabling truly decentralized operation in a trust-worthy environment. This helps avoid giving a strategic advantage to either a buyer or a seller and assists in eliminating the high costs of setting up and running a private network, as well as the risks that come from sharing sensitive business information with a centralized industry portal. The system maintains enterprise privacy using Zero Knowledge Circuits.\n\nThe EY OCM solution can be easily used in existing enterprise systems through a standardized API. Most business contract types can be supported including volume purchase agreements, standardized rate cards, volume discounts, rebates, and price models that depend on market data feeds. The first test users of the solution are implementing complex Power Purchasing Agreements (PPAs) that include market prices, strike prices with minimum and maximum purchase criteria.\n\nPaul Brody, EY Global Blockchain Leader, says:\n\n“We’ve identified from past client work that contract automation can improve accuracy while cutting cycle times by more than 90%, and overall contract administration costs by nearly 40%. With our zero-knowledge privacy technology, we have industrialized this capability, and we can now get these benefits at a fraction of the up-front cost. Deploying on a public blockchain is not only cheaper, but also much more scalable, helping enable many-to-many integrations on an open platform with no one company having an unfair advantage by controlling the network.”\n\nFor more information about EY Blockchain, visit: https://www.ey.com/en_gl/services/blockchain.\n\n-ends-\n\nAbout EY\n\nEY exists to build a better working world, helping to create long-term value for clients, people and society and build trust in the capital markets.\n\nEnabled by data and technology, diverse EY teams in over 150 countries provide trust through assurance and help clients grow, transform and operate.\n\n\n\nWorking across assurance, consulting, law, strategy, tax and transactions, EY teams ask better questions to find new answers for the complex issues facing our world today.\n\nEY refers to the global organization, and may refer to one or more, of the member firms of Ernst & Young Global Limited, each of which is a separate legal entity. Ernst & Young Global Limited, a UK company limited by guarantee, does not provide services to clients. Information about how EY collects and uses personal data and a description of the rights individuals have under data protection legislation are available via ey.com/privacy. EY member firms do not practice law where prohibited by local laws. For more information about our organization, please visit ey.com.\n\nThis news release has been issued by EYGM Limited, a member of the global EY organization that also does not provide any services to clients."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiXkFVX3lxTE9ud1h2UWIyZlFWcER1ZndyMWZvTC0xQWx4WXptYW5abGRVdE9IMUwxc3QxdUVzRWduUzdfSHl6U0Mxd0hZN0pydlpLNzcyTzNjRllTc3h2ZFRSLURmOEE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Apr 2024 07:00:00 GMT",
        "title": "No, ETH isn’t suddenly a security now - Blockworks",
        "content": "The Securities and Exchange Commission is investigating whether the Ethereum Foundation’s sale of ETH since the September 2022 “Merge” constitutes an unregistered securities offering in violation of US law, according to Fortune.\n\nIf the reports are true, then this investigation — just ahead of the SEC’s May deadline for a decision on an Ethereum spot ETF (more on that later) — raises the question: Did Ethereum’s switch to proof-of-stake transform it into a security?\n\nThe short answer is “no.”\n\nThe slightly longer answer is “still probably no.”\n\nETH tokens are not, in and of themselves, “securities” in the way that stocks or bonds are. They do not confer legal ownership of any business entity or contractual rights to any kind of payments — they are just code in a decentralized database.\n\nWhen we talk about ETH “being a security,” we are instead actually asking whether the offer and sale of ETH tokens (in a particular context, between a particular buyer and seller) constitutes an “investment contract” under the dreaded Howey test. Under the Howey test, the offer and sale of an asset like ETH constitutes an investment contract if (1) someone invested money, (2) in a “common enterprise,” (3) in the expectation of profit and (4) where that expectation is based on the “essential managerial efforts of particular others.”\n\nThe four Howey “prongs” have already been discussed and debated to death in the crypto space, so I’ll avoid beating a dead horse here. But if you look closely at the language from Howey, I think two things quickly become apparent about the sale of ETH tokens over time:\n\nFirst, the sale of pre-mined ETH tokens to investors in Ethereum’s 2014 ICO sure looks a lot like an “investment contract.” ICO participants invested money (BTC) in order to receive their allocation of ETH (Howey prong #1). That BTC was pooled to fund a common effort led by Vitalik and the Ethereum Foundation to develop the Ethereum blockchain and produce the ETH tokens (Howey prong #2). Given that the Ethereum blockchain “pre-launch” at the time of the ICO, the only plausible motivation to take part in the ICO was to make money on the price appreciation of ETH (Howey prong #3). And, at the time of the ICO, if Ethereum was going to succeed as a protocol and ETH was going to succeed as an asset, Vitalik and his developers were going to have to roll up their sleeves and put in some good old “managerial efforts” to make the tokens worth anything (Howey prong #4).\n\nHad the SEC brought suit around the time of the Ethereum ICO, they would have almost certainly won in court, and that may well have been the end of ETH.\n\nHowever, the SEC didn’t bring suit, and the statute of limitations for such a claim (typically five years) would have run out in 2019. And importantly, the Ethereum ecosystem has evolved in ways since its ICO that make current sales of ETH tokens look less like an investment contract than they once did.\n\nFor one thing, the proliferation of applications (think DeFi and NFTs) utilizing ETH for “gas” provides a “consumptive utility” for ETH tokens that challenges the notion that current-day purchases of ETH are solely, or even mainly, based on profit expectation.\n\nEven more important, however, is the so-called “Hinman speech” delivered in 2018 by Bill Hinman, then the director of corporation finance at the SEC, where he proposed that a digital asset’s classification under Howey could evolve over time.\n\nAccording to Hinman’s logic — to the extent that Ethereum’s success no longer hinges on the efforts of a particular entity, like Vitalik or the Ethereum Foundation — the sale of ETH tokens would no longer fulfill the requirement of the final Howey prong that there be “particular others” upon whose efforts a buyer would rely for their profits.\n\nRead more from our opinion section: Staking or not, ETH is no security\n\nTherefore, regardless of the legally dubious nature of the ICO, the Ethereum network (at least from 2018 onwards) has become “sufficiently decentralized.” This means that its native token constitutes a digital commodity like bitcoin, rather than an investment contract, subject to SEC jurisdiction.\n\nSince the Hinman speech, the securities law status of ETH has been at a bit of a stalemate. The SEC has never explicitly endorsed the notion that ETH (even pre-merge) is a digital commodity — which they readily concede with regard to bitcoin. And Gary Gensler regularly ties himself in knots before Congress trying to evade questions about his view on ETH’s current legal status.\n\nBut the fact remains that (at least until now) the SEC has never brought an action specifically alleging that primary or secondary sales of ETH constitute investment contracts under Howey (like they did with over a dozen other tokens in the Coinbase, Binance and Kraken lawsuits). The SEC even went as far as to approve the listing of ETFs based on ETH futures contracts that trade on the CME, which would be hard to understand if the Commission felt that ETH tokens traded as unregistered securities.\n\nBut what about Ethereum’s migration to proof-of-stake? Does the fact that ETH tokens can be staked for “yield” change the legal situation and turn either (A) current-day sales of ETH, or (B) the act of staking ETH into securities offerings under Howey?\n\nIn my opinion (and I spend an unhealthy amount of time thinking about crypto securities law), no.\n\nWith regard to present-day sales of ETH tokens — whether directly from the Ethereum Foundation or on the secondary market — I don’t think ETH’s staking functionality makes much of a difference under Howey. That is, the ability to stake does not make ETH tokens any less useful for individuals who might buy them for their consumptive utility (i.e. gas fees).\n\nAnd while the Ethereum Foundation does indeed still hold a large supply of ETH tokens, there is no reason to think that the introduction of staking makes the foundation’s “managerial efforts” “essential” to the financial success of ETH in some way that was not the case at the time of the 2018 Hinman speech.\n\nThe question of whether the act of staking ETH in order to receive “yield” in the form of staking rewards constitutes an investment contract under Howey is more nuanced — but properly understood, the answer should still be no.\n\nRead more from our opinion section: Ether is the Schrödinger’s cat of crypto\n\nWhen you run a validator node and stake 32 ETH tokens in exchange for rewards, what you are actually doing is providing a service to the Ethereum network and getting paid for that service. You only get the reward if you honestly validate blocks, and you stand to lose your stake to “slashing” if you attempt to validate dishonestly.\n\nThis is very different from the type of passive “yield” you might expect to receive from holding a bond or a dividend-paying stock or real estate asset (which rewards ownership and not activity). Unlike with these traditional financial instruments, you are not relying on “managerial efforts” of other people in order to profit when you stake ETH directly, but rather on your own skill and honestly as a validator.\n\nThis question becomes trickier, however, when we move from direct proof-of-stake validation to “staking services” such as those run by exchanges like Coinbase and collaborative staking protocols like Lido and Rocketpool.\n\nAt one end of the extreme, you could see an argument for how custodial staking services could look quite security-like under Howey (given how reliant depositors would be on the staking service provider’s efforts in order to earn yield).\n\nAt the other end of the spectrum, you could imagine a purely on-chain tool that allowed users to jointly stake their ETH in collective, automated, validator nodes with clearly defined behavior looking much more like direct staking than an investment contract.\n\nWhere the specific services by Coinbase, Lido and Rocketpool fall on this continuum is very much an open legal question — and one that in Coinbase’s case is being actively litigated in federal court in the Southern District of New York.\n\nBut none of this makes ETH itself, even when being used for staking purposes, an investment contract and therefore none of this seems to justify the SEC’s new investigation.\n\nWhy, then, might the SEC be pursuing this type of weak claim about Ethereum?\n\nObserving the success of the Bitcoin ETF — and the SEC’s dissatisfaction with its launch — suggests that the investigation into Ethereum might be a pretext to deny the upcoming spot ETH ETF application.\n\nMoreover, acknowledging Ethereum’s transition to a commodity despite its seemingly illegal ICO genesis could concede a legal strategy meant to apply to other token projects that the SEC believes aiming to circumvent securities classification (in other words, creating a loophole).\n\nThe SEC’s actions could be seen as a strategic move to maintain regulatory leverage over the crypto market, rather than a clear-cut determination of Ethereum’s status as a security.\n\nZack Shapiro is the Managing Partner at Rains and leads the law practice. Previously, he was co-founder and general counsel of BZR, a startup backed by Founders Fund, Greycroft, and Abstract Ventures. Zack is a graduate of Williams College and Yale Law School, and started his legal career clerking in the federal courts for the S.D.N.Y. and the 2nd Circuit, and at Davis Polk & Wardwell. Zack serves in various advisory roles in the crypto industry, including as a member of the Pleb Lab Accelerator advisory board, and as a Legal Fellow at the Bitcoin Policy Institute.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxQQm1QdTVmZV9oclY1cmJjYWwzTmwxak1NV1pqeGE2d1RIb3FCLV9KVm0wb3FxUDNjU0ktNWhDdHZpS3JaeUhGd1R6WlY0bFNhRE5EU3luVHNsSFJKTjRSSFZBNTMzUmZ4X3FHcm1BeTJKcjdZWXI4cFF0bE44Rzh4alR6dXF3b1BXVjA4VkE3QXZZM3doX0RFVTBjSVNCZFdoQzNV?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Apr 2024 07:00:00 GMT",
        "title": "Ethereum falls to lowest level against Bitcoin in 3 years amid panic selling - CryptoSlate",
        "content": "Ethereum fell against Bitcoin to its lowest point in three years amid the carnage that followed Bitcoin’s fall from $70,000 over the weekend. The ETH-BTC chart reached as low as 0.0462 BTC on Saturday, April 13, down 24% from the year-to-date high of 0.085 BTC.\n\nEthereum’s all-time high against Bitcoin came in 2017 when it touched 0.16 BTC before closing the year around similar levels to now at 0.048 BTC. It has since recorded lows around 0.018 BTC in late 2019 before rising significantly throughout the 2020 – 2021 bull market.\n\nThe cycle peak of 0.088 BTC was met with a steady decline throughout 2023, 2022, and 2024. The 0.05 BTC level had been acting as a lower support level until it was breached this month. While the price remains within 7% of the support, it has been almost three years since we’ve seen these prices.\n\nThe decline has been gradual and steady since the start of 2023, with a few bullish breakouts shut down within a couple of months.\n\nWhile Ethereum remains below the 0.05 BTC support level, it has recovered almost 7% from its weekend lows, holding relatively steady amid Bitcoin’s continued struggles. Bitcoin fell from $70,000 to $61,700 over the weekend before recovering to $66,000. However, Bitcoin has retested $61,700 again and is trading around $62,000 as of press time. Ethereum initially followed Bitcoin down from $3,600 to $2,800 – it has since consolidated around the $3,000 mark, aiding it in its price war with Bitcoin.\n\nWhile the overall crypto market often follows Bitcoin, much of the altcoin market follows Ethereum. The ETH-BTC chart highly influences the delicate relationship between digital asset price movements, and it is one of the staples of the industry. Bitcoin dominance, another critical factor, reached a 3-year high this weekend, touching 57%, while Ethereum dominance dropped to just 15% from a recent high of 19%.\n\nMentioned in this article"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxNTlV3NzJPUGpySWNiaHFoM0JKSTU0aVpBVlRtT1piaXRFT0ZXcVJYbXpnNEltTk5LR2R4cW1BaTVwTTBIM3dfbU9EQ2c5UlNBcnpFc2gybGF5WHF0NGJxWlJCUzZCM0xBYzdVRGEtLXd2MzdnalN0SnRRclNhVnVpWVlIRnFaTzZncWY2UjFvYUFGQVJfY05wbVJaWTVRUTZLX19uaHJuNVJIUVRMWXFuSnlRRDFpSy00T25V0gHAAUFVX3lxTE4zd2RiMHp3ZXJOWDcydk16d0xRWEQ5NzZoZTdnQU81WkVWUW1tTzRrNWlVNjdQaVRNN1lndWY1YXl3S1J1cWVPUVF5YTFJRnVmRE5GTW16RGpZSC12dHZDaWgyT0ZkTktMN29pcGVlYVdHbnFPVWpfalZmTlE1ekk4amxNMmlBUVRzV3BXSGtORmtISXRXbW5MNm1iN3dIWHVOa3RlbnJIdXlmSjZBeFNKSy1zdm8zektweFJyNmJ5UA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Crypto Whale Loses $4,500,000 Attempting To Leverage Long Ethereum (ETH) Twice: Lookonchain - The Daily Hodl",
        "content": "A crypto whale recently lost more than $4.5 million attempting to long Ethereum (ETH) twice, according to the digital asset tracker Lookonchain.\n\nLookonchain notes the whale lost $500,000 on their first attempt to long the top smart contract platform, then lost a lot more on their second try.\n\n“This whale sold all 10,701 ETH ($33 million) on Binance to repay debt two hours ago, losing more than $4 million again!\n\nHe went long ETH by depositing ETH on Compound and borrowing USDT to buy more ETH.”\n\nCompound (COMP) is a decentralized lending platform.\n\nLookonchain notes that other whales are accumulating Ethereum. One withdrew 10,000 ETH worth $31.5 million from Binance on Monday and staked it into the decentralized finance (DeFi) project Pendle (PENDLE) and Renzo, a liquid restaking token for EigenLayer. EigenLayer is a restaking protocol built on ETH.\n\nThe other whale withdrew 5,282 ETH worth $48.2 million from the crypto exchanges Binance and OKX on Monday.\n\nETH is trading at $3,093 at time of writing. The second-ranked crypto asset by market cap is down nearly 12% in the past week and more than 14% in the past month.\n\nEthereum is also more than 36% down from its all-time high of $4,878, which it set back in November 2021, according to CoinGecko.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxNZXQ1RFF1V2RUTkI5YndpRXVaMDFKQW1XS09xV0tkYW9WZjJFQ0phdnlnSFVPLW5SRmxtVEhVSzlGZmpLdGxJOGk1eWNtNnU0STNLNHVrNThZeFVISHNnWWlTUklaTEgyZTl0WUdiRi1CRkl1VEtrV1NMQ3FUMFZNcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Bitcoin (BTC) Dominance Hits 52.86%, Ethereum (ETH) Tests $3,000 Support, and Furrever Token (FURR) Secures $800,000 in Presale Phase - Yahoo Finance",
        "content": "Furrever Token\n\nNew York, NY, April 17, 2024 (GLOBE NEWSWIRE) -- In a turbulent weekend for the financial markets, cryptocurrencies felt the strain of geopolitical tensions, with Bitcoin (BTC), Ethereum (ETH), and Furrever Token ( FURR ) each navigating the upheaval in distinctive ways. Bitcoin showed resilience despite significant losses, Ethereum struggled to maintain key support levels amidst declining prices, and Furrever Token capitalized on the volatile market environment, boosting its presale figures significantly as investors looked for promising opportunities in the lead-up to the Bitcoin halving.\n\nDespite a Dip Over the Weekend, Bitcoin's (BTC) Market Dominance Reaches a New High Since April 2021\n\nThis past weekend saw a downturn in asset values as traders adjusted their portfolios in response to conflicts in the Middle East. By late Saturday, it appeared that most assets had reached their lowest points.\n\nOver the weekend, while the stock market was closed and unable to react to the escalation involving an Iranian drone targeting Israel, the cryptocurrency market was active and responsive.\n\nThe general trend saw a decrease in asset prices as traders reevaluated their positions and reduced exposure to higher-risk investments. Bitcoin, despite being the least affected among major cryptocurrencies, dropped from a high of over $70,000 on Friday to just above $63,000 by the end of Saturday, marking an 11.6% decrease.\n\nBitcoin's resilience was notable compared to other cryptocurrencies. Coinglass reported that long liquidations on centralized exchanges totaled over $757 million on Saturday, with Bitcoin accounting for $261 million of those liquidations.\n\nCryptocurrencies like Bitcoin are considered less risky compared to more speculative ones such as Dogecoin, which experienced nearly a 30% drop from its peak on Friday to its trough on Saturday.\n\nThere was a modest recovery across most assets after hitting what seemed to be a floor late on Saturday. Theoretically, Bitcoin could have seen a surge during this turmoil, as it is often considered a \"safe haven,\" akin to gold. Recently, gold has seen significant gains due to the Middle East conflict, potentially benefiting Bitcoin, frequently dubbed \"digital gold.\"\n\nHowever, with the stock market closed, cryptocurrencies like Bitcoin had to absorb the full impact of the market's reaction. Despite these challenges, Bitcoin still emerged as a top performer.\n\nOver the weekend, Bitcoin's market dominance—its market cap's proportion relative to the total cryptocurrency market cap—rose to 52.86% on Sunday, marking the highest point since April 2021.\n\nStory continues\n\nThis increase in dominance comes after a low in February when Bitcoin's dominance fell to 43% due to a surge in altcoins, representing the smallest share since March 2023. This reversal underscores Bitcoin's renewed strength in the market, achieving its most substantial market share in three years.\n\nEthereum (ETH) Remains Above the $3,000 Support Level\n\nEthereum (ETH) has recently faced challenges as its price has seen a decline of 21% between April 9 and April 14, reaching a 50-day low. Despite recovering some losses, Ether continues to struggle, especially after failing to break through the $3,200 resistance on April 14. Currently trading at $3,066, Ether has experienced a daily decrease of 1.46%. This ongoing instability raises concerns about the sustainability of its $3,000 support level.\n\nIn the derivatives market, there is a notable shift in sentiment among professional traders, indicating a decrease in risk appetite. This sentiment is reflected in the ETH options market, where the delta skew metric has reached its highest bearish level in over two months, suggesting a growing demand for downside protection.\n\nAmidst this market uncertainty, there is cautious optimism regarding the approval of a spot Ether ETF in May, although analysts remain mixed due to the conflicting signals from on-chain and derivatives data. Senior Bloomberg ETF analyst Eric Balchunas pointed out the low likelihood of ETF approval given the lack of critical feedback from the SEC during recent meetings.\n\nComparatively, Ether's downturn has been more pronounced than other major cryptocurrencies like Binance Coin (BNB) and Tron (TRX), but less so than that of Solana (SOL). It should be noted that Ethereum's network total value locked (TVL) has surged to its highest in 13 months on April 15, reaching 16.4 million ETH, which is a 14.8% increase month-over-month.\n\nDespite these challenges, the anticipation of a decision on the spot Ether ETF in May could still provide a positive impact on Ether's price and on-chain activity. However, the increasing risk aversion among professional traders, as evidenced on April 16, suggests that the potential for further price corrections below $2,900 should not be overlooked.\n\nFurrever Token (FURR)’s Presale Raises Over $800,000 as Bitcoin Halving Approaches\n\nFurrever Token (FURR) is distinguishing itself as a strong contender, demonstrated by an impressive presale that has already exceeded $800,000. As the crypto community braces for the Bitcoin halving, FURR is strategically positioned to capitalize on the increased interest and investment that typically accompany this event.\n\nOffering a compelling entry at just $0.000564 per token, Furrever Token has attracted a wide array of investors, drawn by the potential for significant returns. This vibrant investment interest is bolstered by FURR's dynamic community, which includes over 4,100 active members on its Telegram channel, providing robust support and fostering lively discussions that enhance the token’s market presence.\n\nAs the market anticipates the Bitcoin halving, Furrever Token is not just riding the wave but actively preparing to leverage this period of heightened activity. The team behind FURR is pushing forward with strategic partnerships and innovative features aimed at boosting the token's adoption and enhancing its value. These efforts are designed to align FURR’s trajectory with the broader market dynamics expected post-halving, ensuring that the token remains appealing to both new and existing investors.\n\nWith its strong presale performance, active community engagement, and strategic market initiatives, Furrever Token is poised for significant growth. As it continues to navigate the evolving cryptocurrency landscape, FURR stands out as a promising investment opportunity, ready to benefit from the upcoming market momentum and deliver substantial returns to its holders.\n\nFor further information or any assistance regarding Furrever Token, reach out only through the official channel at support(at)furrevertoken.com to avoid potential scams.\n\nSecure the Most Exclusive Presale Opportunity of 2024 Today!\n\n\n\nFurrever Token Official Website | Visit Furrever Token Presale\n\n\n\nJoin Official Telegram Group | Follow Official X Account\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\nCONTACT: Media Contact: Robert Smith https://furrevertoken.com/ support(at)furrevertoken.com\n\n\n\n"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxOZnZxUGNFZTRKcUo4MEJpRnpNeGN3b3BfYTB5T3ExcXh4QzhZYmEzdTR0VTRxTXRhYWlNMDZTX00wRTNJRV80NHVOUnIxMWtTZ1Exd2RDdi1iWDJ5bjVDVlUzd0Roa0pSWm4wdERUNWpPaHVUaFl2WlVIMEdwcjhMaXNoZmptZU0y?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Furrever Token Foreseen to Deliver ROI Comparable to Bitcoin (BTC) and Ethereum (ETH)'s Success in 2024 - Yahoo Finance",
        "content": "Furrever Token\n\nNew York City, NY, April 17, 2024 (GLOBE NEWSWIRE) -- The markets have been bleeding out over the past couple of days, with both Bitcoin (BTC) and Ethereum (ETH) experiencing a 2% dip in their prices. However, amidst this downturn, Furrever Token (FURR) has emerged as a bright spot, surpassing the significant milestone of $800,000 during its sixth presale stage. This contrast highlights the dynamic nature of the cryptocurrency landscape, where while some major players face temporary setbacks, newer projects like FURR demonstrate resilience and potential for growth.\n\nBitcoin Faces Geopolitical Headwinds Amidst Price Volatility: Dipped 3.4% Since Yesterday\n\nBitcoin's recent attempt at recovery was abruptly halted yesterday afternoon following renewed geopolitical risks, causing the digital asset to turn downwards once again. The largest cryptocurrency witnessed a 3.4% decline, retracing its gains from the previous day and closing around the $63,400 mark. Today, Bitcoin briefly dipped to the $61,000 range before bouncing back to the $63,000 zone with the opening of the European session. Amidst continued volatile movements in the Bitcoin market, significant liquidations persist in futures crypto trading, with $274 million worth of positions closed in the past 24 hours, 200 million of which were long positions, indicating investors' maintained optimism despite the downward trend.\n\nExternally-driven news dominates the Bitcoin market, with a brief upward movement towards $66,000 seen after the Hong Kong news yesterday, but this positive development was short-lived. However, investors are keeping a close eye on the upcoming halving event scheduled for April 20th, anticipating its potential impact on Bitcoin's supply dynamics and market sentiment.\n\nEthereum Faces Crucial Support Levels Amid Market Turmoil\n\nAmidst a widespread selloff in the cryptocurrency market, Ethereum (ETH) faces scrutiny as its price dips by 2% to approximately $3,059, according to coinmarketcap.com. With attention turning to critical support levels, renowned crypto analyst Ali Martinez highlights a pivotal zone between $2,000 and $2,430, where 9.37 million addresses collectively hold nearly 53 million ETH. Martinez's analysis underscores the significance of this range in determining Ethereum's price direction amidst market volatility.\n\nDespite the downturn, optimism persists within the crypto community, buoyed by recent regulatory approvals such as Hong Kong's green light for Bitcoin and Ethereum ETFs. Moreover, the anticipation surrounding the upcoming Bitcoin Halving event adds intrigue, although concerns over short-term volatility linger. As investors navigate uncertain terrain, Martinez's insights offer valuable guidance, emphasizing the importance of monitoring market dynamics and expert analyses.\n\nAmidst the price dip, Ethereum's one-day trading volume remains near the flatline at $22.42 billion, with the ETH price down 7.48% over the last 24 hours and nearly 16% over the last seven days. The Ethereum Futures Open Interest has also declined by 6.01% to $10.91 billion, indicating ongoing market turbulence.\n\n\n\n\n\nFurrever Token (FURR): Riding the Wave of Market Downturn with Resilience\n\nDespite the broader market downturn, Furrever Token (FURR) stands out as a beacon of resilience, navigating the choppy waters of the crypto landscape with unwavering momentum. Surpassing the significant milestone of $800,000 during its sixth presale stage, FURR demonstrates a remarkable ability to thrive amidst market volatility. This success can be attributed to the project's unique value proposition, centered around infusing the crypto space with an irresistible dose of cuteness. By leveraging the universal appeal of adorable cat imagery, FURR offers users a one-of-a-kind experience that transcends traditional use cases, capturing hearts and garnering enthusiastic support from its growing community.\n\nAt the heart of FURR's appeal lies its commitment to creating a whimsical and heart-warming crypto ecosystem. From cute cat-themed stickers and emojis to captivating visuals, every aspect of the project is meticulously designed to evoke joy and foster a sense of camaraderie among users. This emphasis on community building extends beyond mere aesthetics, as FURR actively cultivates a warm and inclusive environment where members can connect, share experiences, and revel in the shared love for all things adorable.\n\nCentral to FURR's success is the active engagement of both its team and community members. With a shared vision and a passion for spreading happiness through crypto, the FURR community is united in its pursuit of creating a more enjoyable and fulfilling experience for all participants. Whether through lively discussions on social media channels or collaborative efforts to support the project's growth, every member plays a vital role in shaping the future of Furrever Token.\n\nAs of now, FURR is trading at a price of $0.00048 and holds the potential for up to 15X returns, offering investors an enticing opportunity to capitalize on its unique value proposition and strong community engagement.\n\nIs Furrever Token (FURR) Legit?\n\nFurrever Token (FURR) boasts legitimacy with an audited smart contract, a planned PancakeSwap launch, and no buy/sell tax. Team token lock-up and community-driven governance further enhance credibility. With nearly 4,000 Telegram members, support@furrevertoken.com is the sole trusted email address for communications, safeguarding against potential scams.\n\n\n\nSecure the Most Exclusive Presale Opportunity of 2024 Today!\n\n\n\nFurrever Token Official Website | Visit Furrever Token Presale\n\n\n\nJoin Official Telegram Group | Follow Official X Account\n\n\n\nMedia Contact:\n\nRobert Smith\n\nhttps://furrevertoken.com/\n\nsupport@furrevertoken.com\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\n\n\nCONTACT: Robert Smith support at furrevertoken.com\n\n\n\n"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxQdHNObkFWN0RGN2F5Wm5TeFZwX19pTTQwWmdtR19JSjdhNXdyZlNXcVVLTC0zX3NwVlJHcW1sdGozcWZnbHBfd29tZUFmYUZEVGRCZy1hbm9vVUVyWkZISFZGdzczQXprZUdlVndPYnJENHB3UHI3T3FhT3BMX1RMZ090LTJkYk9CR1dxakFfeEl3U2ktQTdBNjVSSXItUHhacHpXN1dESmMzcWMzTzFBNU9KODNqV1k3M2NyQnZ4RGN1T0d5VzJj0gHMAUFVX3lxTE85OU5VdFdmUGdUcWh2NV9DOHlUeW1Kd1FKWHRjTHdEMF9wcFcybTB1Y2c5OHhINFp1RTc0Y2NET1FnQ3Z2RkpmWXdEc2ctVHhXeS1BMDZyWldMWkN5c2pEaGpVUXg2bEFZQllzR3I1MThUdkd4UXJ0ZDdVcGJLVVZVSE41MFpoOVpTcTk2dWZnRlYxdGhBN1c4UFB6UU9yaEdnWkNmdjB3aUZGMlU0VElzYVdSeFRqRVVBQVNGRVI4NVNVN2NKby16OWFZNQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Former Goldman Sachs Executive Says 80% of His Crypto Portfolio Allocated to One Ethereum Rival - The Daily Hodl",
        "content": "Macro guru and ex-Goldman Sachs executive Raoul Pal is revealing that he’s heavily invested in one Ethereum (ETH) competitor.\n\nPal says in an appearance on the Bankless YouTube channel that the native token of the layer-1 blockchain Solana (SOL) comprises about four-fifths of his crypto holdings while the rest is in memecoins, digital collectibles and in a digital assets-focused investment vehicle.\n\n“I am 80% SOL. All of my ETH is now NFTs (non-fungible tokens), I have been buying high-end art NFTs.\n\nI then have a bunch of the portfolio in the fund of hedge funds in Exponential Age Asset Management.\n\nAnd I have 1% in stupid s**t like dogwifhat, Dogecoin and Bonk. Got all of those. But that’s 1%… just to be clear I’ve got like in all of memecoins and everything else, 1% of my portfolio. I am 80% Solana.”\n\nOn what convinced him to bet heavily on Solana, the former Goldman Sachs executive says,\n\n“The chart that was a standout in 2022 was the Solana/Ethereum chart. And that was the chart that got me buying Solana and then going all in. Much like I went into Ethereum all in about September 2020. I just did it earlier in Solana.”\n\nSolana is trading at $133 at time of writing, up by over 1,240% from the 2022 closing price of about $9.89.\n\nOver the same period, Ethereum has increased by around 155% from the 2022 closing price of around $1,200 to the current $3,062.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFBBY3FRaExGTUxHMjdPdE90cEpIbGlkSmF5eUt5cTRiVEZoaVVMZDRoQ0NpTm5Nc3oxdG13ZVNjTzhwaVBHdVAyb1VpdU5tbDJld3BYc0lNNGhNMl9yMURudHg5MGtqekFYY2VaQ3ZMa0hTajg4Q3lzbUJNNy0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Price : Will ETH Price Recover In 2024 ? - CoinGape",
        "content": "Ethereum has been facing challenges in holding onto its top spot in the market among altcoins. The bears causing the global cryptocurrency market decline are also dominating ETH. After dropping more than 11% in the last month, it appears the coin is loosing ground to Bitcoin. With the Bitcoin halving event on the horizon for April 20, 2024, the crypto community is eagerly anticipating whether the price of Ethereum will see a rebound. Let’s explore thoroughly to discover the potential.\n\nMarket Performance of Ethereum Price\n\nadvertisement\n\nIn the last 24 hours, Ethereum experienced a 5.19% drop in its price, falling to $3,086.39. The significant drop in its market performance has also been highlighted by the significant decrease of ETH, by 14.27% and 11.36% in the last week and month respectively.\n\nAccording to CoinMarketCap, Ethereum holds the title of the second largest cryptocurrency with a market capitalization of $371.15 billion. Moreover, the coin experienced a drop of around 5.86% in its trading volume, reaching $21.77 billion, in the last 24 hours. This decrease shows lower liquidity and trader interest in the coin.\n\nETH price reached its highest point at $4,891.70 on November 16, 2021. After that, Ethereum has experienced a decrease of around 36.67% reaching the current price.\n\nFactors Determining the Recovery of Ethereum Price\n\nVarious factors play a role in the recovery of ETH price as discussed below.\n\n1. Bitcoin Halving\n\nBitcoin Halving might also impact the rise in ETH trading price. The event that takes place after every four years, has a notable effect on the cryptocurrency market. It could impact the Ethereum (ETH) price in different ways. Initially, the halving decreases the amount of new coins being introduced into circulation. This limited availability may result in higher demand as investors look to spread out their investments. If the price of Bitcoin increases after the halving, Ethereum and other cryptocurrencies are expected to also see price hikes because of the increased interest in the market.\n\nAlso, Bitcoin halvings result in excitement and speculation within the investment community. This feeling can also affect other cryptocurrencies. Anticipating positive impacts from Bitcoin halving, individuals might choose to invest in other cryptocurrencies such as Ethereum, leading to an increase in their value.\n\n2. Ethereum ETFs\n\nIncreased attention from institutional investors and major companies in Ethereum may bring stability and boost the price. The potential launch of new spot Ethereum exchange-traded funds (ETFs) in May, 2024 could lead to a surge in Ethereum’s value, similar to the impact of Bitcoin ETFs. However, analysts are concerned about the SEC approval process, with the likelihood decreasing from 70% to 30% due to a lack of communication from regulators. Investors should be cautious about expectations surrounding the approval of Ethereum ETFs.\n\n3. General Cryptocurrency Market Recovery\n\nA recovery in the cryptocurrency market can result in Ethereum’s price bounce due to various factors. Firstly, as investor confidence grows with the market’s rebound, more individuals are likely to invest in Ethereum. Secondly, renewed capital inflows into cryptocurrencies typically include Ethereum due to its reputation and use cases. Additionally, Ethereum often follows Bitcoin’s trends, so when Bitcoin’s price rises during a market recovery, Ethereum’s price also tends to increase. Moreover, market liquidity and trading volume can rise during a recovery, leading to smoother price movements and potential upward pressure on Ethereum’s price. Furthermore, increased interest in blockchain technology and decentralized applications can drive further demand for Ethereum. Institutional investors may also be attracted to Ethereum during a recovery, contributing to its price growth.\n\n4. ETH’s Price Forecast\n\nBoth the Exponential Moving Average (EMA) and Simple Moving Average (SMA) show that short-term periods of 10, 20, and 30 days are signaling a bearish trend based on technical indicators. The Ethereum price is below thes moving averages, showing the possibility of a price drop in the short-term.\n\nSimilarly the EMA and SMA for extended durations like 50, 100, and 200 days are also indicating a downward trend. indicating a bearish direction. The current price of ETH is below these moving averages, showing that the overall price movement of Ethereum remains bearish.\n\nThe MACD with 12 and 26 periods is giving a Buy signal, suggesting a possible short-term turnaround.\n\nThe MACD, which is a momentum indicator, calculates the variance between two moving averages, and the Buy signal could indicate a slight move towards an upward trend for ETH.\n\nHowever, there is a Sell signal shown by the EMA across different time periods, ranging from 10 days to 200 days. This indicates that Ethereum’s price might keep experiencing downward pressure in the near to medium future. The RSI (Relative Strength Index) at 37.6 is in the neutral range. It indicates that ETH’s price is neither overbought or oversold, suggesting there may be potential for a price reversal if the RSI moves further towards either extreme.\n\nOn the downside, should the price of ETH, it will find support at $2698.5. Should the decline further past the level, it will find another key level at $2698.5. Any more losses might see the price drop further to $2361.2\n\nIf the bulls fail to protect the $2698.5 support, the price might decline toward $2361.2.\n\nOn the upside, the price is now facing resistance near the $3581.4 level and the trend line. The next major resistance is near the 3789.7 level. A clear move above this level of resistance could send the price toward $4127.\n\nConclusion\n\nDespite facing hurdles and declines, Ethereum price shows indications of potential recovery and opportunities for a comeback. The future Bitcoin halving and possible introduction of Ethereum ETFs may have a positive effect on the price of Ethereum. Moreover, the collective rebound of the crypto market could help reverse the direction of Ethereum’s price movement. Investors need to monitor important support and resistance levels, alongside changes in technical indicators like RSI, EMA, and MACD, to detect any shifts in momentum. Ultimately, Ethereum’s future success will be influenced by various factors, making it crucial for investors to remain informed and prudent."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTFBaSm04UmFNQWZkMmNMbnVVNUV2QWJGbHh2em42a3pYa3A1VkZ5dDIyN3owdmNDdElsUDczbFgzeVo0UVk2bm90RHhoLWxYcDJvR0F2TTR3MUVQYVBobENGanhzLU45LUJhYUU4RWFJYzN6VUdiaVpUMDJvUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Why Are Ethereum Investors Flocking to BlockDAG? - NFTevening.com",
        "content": "Cryptocurrency investment is shifting focus from traditional stalwarts like Ethereum to newer, high-potential projects like BlockDAG. The appeal of BlockDAG is undeniable, with the project recently accumulating $17.9 million from its presale and an additional $2.1 million from miner sales. As debates intensify within the Ethereum community about its future issuance policies, BlockDAG is seizing the spotlight with promises of a 30,000x ROI, courtesy of its groundbreaking mineable network and a keynote video teaser on the Moon.\n\nEthereum’s Present Challenges\n\nCurrently, Ethereum is facing internal contention regarding its issuance curve as it transitions to the Electra upgrade. The community is divided over proposals aimed at reducing token issuance to support solo stakers, with notable figures like Eric Conner and Ahmad Bitar vocal in their opposition. They argue that such changes might compromise Ethereum’s role as a decentralized currency, spotlighting the ongoing struggles to balance evolution with core values.\n\nBlockDAG’s Impressive Presale and Promising Roadmap\n\nBlockDAG is making waves in the crypto presale scene with over $17.9 million already secured in its latest funding rounds, alongside significant earnings from miner sales. The platform’s forthcoming keynote, featuring an innovative display of BDAG on the moon, is set to captivate a global audience. Additionally, promises of enhanced market liquidity, potential listings on major exchanges such as KuCoin and CoinEx, and an initial listing price of $0.05 reflecting a nearly 4900% increase from initial offerings; underscore its ambitious growth plans.\n\nBlockDAG leverages a novel approach to blockchain technology at its core, offering developers a dynamic environment to build, deploy, and monetize their applications efficiently. The platform facilitates various blockchain functions, from crafting smart contracts with popular development tools to running applications on a test network before a full-scale launch. Opportunities for developers to generate income through various channels, including transaction fees and token sales, position BlockDAG as a vibrant ecosystem for blockchain innovation.\n\nFurthermore, BlockDAG’s adoption of Directed Acyclic Graph (DAG) technology ensures that scalability and performance are maintained as the network grows, supporting a diverse array of business applications and fostering ongoing innovation and community engagement.\n\nConcluding Thoughts\n\nAs the crypto community continues its search for the next ample investment opportunity after Ethereum’s monumental success, BlockDAG presents a strong case with its potential for a 30,000x return on investment. Facing internal debates and growing concerns within the Ethereum community, BlockDAG emerges as a more attractive option for discerning investors. With substantial presale revenue of $17.9 million and a supportive community excited by its innovative solutions, BlockDAG is well-positioned to transform the investment landscape following the keynote video teaser over the moon a feature not dared by any crypto before.\n\nThis emerging platform promises significant returns and boasts a robust technological foundation and an ambitious roadmap, making it an appealing prospect for early investors. Discover BlockDAG by visiting their website and considering the investment opportunities available in what could be the next breakthrough in the crypto sector.\n\nBuy BlockDAG Now\n\nWebsite: https://blockdag.network\n\nPresale: https://purchase.blockdag.network\n\nTelegram: https://t.me/blockDAGnetworkOfficial\n\nDiscord: https://discord.gg/Q7BxghMVyu"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE9fNEpsZFd3dUR4Z19ScTVtNHZXUXlsZmtweFowcHlmVlJ6Tjhfc1JDVU9CS0M3NDlBN0l3SjZzU2pQbHBheEFkV0hBSy1oWlJ0RnJZRUJZcnBlWDF2amltcEJfcFdRaU1BS292TUVhcmZjWEZnLW51RU5R0gF_QVVfeXFMTnFOcWNoR09rRUdNVlZGVjBjTWoxTUJyeTdXRWc4elhFVm0zSWw2eEFJdl9kVTVXUjJGNUV2RlhxSy1qQUp1WWNreVdRRlVXQkNiYW1iWEtvRldkUi1lSkFHSzAydVNVWWp6eHlJdm1NQ0IxUEFhUmdRY21lTDczZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Ancient Ethereum Whale's 5,000 ETH Sell-off stirs market - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAccording to on-chain analytics firm Lookonchain, an Ethereum whale who accumulated a substantial amount of ETH at the market bottom in September 2022 has made a notable deposit of 5,000 ETH to popular cryptocurrency exchange Kraken.\n\nAdvertisement\n\nBack in September 2022, when the Ethereum network transitioned to a proof-of-stake consensus, the whale took advantage of the opportunity to buy ETH at what was considered the market bottom. The timing seemed right as the price of Ethereum was nearly $1,567 per ETH, totaling a value of $151.42 million for the bulk purchase.\n\nAccording to Lookonchain, the ETH whale withdrew 96,638 ETH worth $151.42 million at the time from Coinbase at $1,567 from Sept. 3 to Sept. 7, 2022.\n\nThe whale that bought $ETH at the bottom in Sept 2022 appears to be selling $ETH at a profit again.\n\n\n\nHe deposited 5K $ETH to #Kraken 56 minutes ago.\n\n\n\nHe withdrew 96,638 $ETH($151.42M at the time) from #Coinbase at $1,567 from Sept 3 to Sept 7, 2022.\n\n\n\nAnd he currently has 76,638… pic.twitter.com/5FR0TXRGF5 — Lookonchain (@lookonchain) April 16, 2024\n\nFast forward to now, and the same whale has transferred 5,000 ETH to Kraken, presumably to sell it at a profit. When whales deposit their tokens into exchanges, it typically suggests a potential sale, while withdrawals signal an intent to buy.\n\nAt the time of the deposit, the price of Ethereum had risen, indicating a significant profit margin for the investor. The whale still has 76,638 ETH worth $233.56 million remaining, for a total profit of more than $153.7 million.\n\nThe whale's action indicates that the perfect combination of timing and market sentiment can lead to significant returns. The wrong timing might lead to ultimate losses, which was the scenario of another ETH whale who saw significant losses as the ETH price dipped.\n\nEthereum saw selling pressure at the start of the week after reaching highs of $3,281 on April 15. The drop persisted, with Ethereum falling for two consecutive days before slightly rebounding. At the time of writing, ETH was up 0.43% in the last 24 hours to $3,058.\n\nAs reported, an ETH whale sold their 10,701 ETH stash worth $33 million, losing more than $4 million for the second time after going long on ETH. The first time, they lost almost $500,000."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiZEFVX3lxTFBWZXJLMGpCQmdRS2Z4eDJOZGxrcGdtM1hmbGdzOThQWmZ4WGhRSU0zVlhjZkFnajE1dE5JVldfX0MxWnlqTHFYQWxCM2tlUHFCeHdodTI1dExKME94OEVueTFGT2g?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Worldcoin to debut Ethereum layer 2 \"World Chain\" this summer - Crypto Briefing",
        "content": "World Chain aims to offer verified humans priority access and free gas on Ethereum's L2.\n\nShare this article\n\nWorldcoin, the brainchild of OpenAI CEO Sam Altman, unveiled today its latest development: World Chain, an Ethereum layer 2 (L2) network powered by Optimism’s OP Stack. With this new blockchain, Worldcoin’s vision is to build an open and collaborative network “by humanity” and “for humanity.”\n\nIntroducing World Chain, a new blockchain designed for humans ⚪️ pic.twitter.com/qNb7S3vqut — Worldcoin (@worldcoin) April 17, 2024\n\nAccording to Worldcoin’s blog announcement, the new blockchain is designed to prioritize humans over bots, offering verified individuals priority blockspace and a gas allowance for everyday transactions.\n\nWorld Chain aims to provide developers with access to millions of real users globally, focusing on practical applications in daily life, the team noted. The integration with the Worldcoin protocol is set to spur growth and utilize World ID’s Proof of Personhood to ensure security and scalability within the Ethereum ecosystem.\n\nThe network will be permissionless, and open-source, and is planned to be governed independently by the community. World Chain’s anticipated launch is later this summer.\n\nIn just nine months, Worldcoin has achieved impressive adoption with over 10 million users across 160 countries creating World IDs and wallets, facilitating a staggering 75 million transactions, the team shared. This rapid expansion is driving the Worldcoin team to push the boundaries of blockchain technology, focusing on efficiency, user experience, and utility enhancements.\n\nAccording to the team, World Chain is being built to enhance capacity, allowing for the continued growth of its user base and providing a more efficient transaction experience.\n\nBy reducing congestion, World Chain aims to make transactions faster and less expensive. With World ID, users can prove they’re a real person, anonymously, which can get them priority for their transactions and even some free gas. This makes it easier for new people to join without worrying about high fees.\n\nFor developers, World Chain represents a new frontier to engage with on-chain users at scale, offering a suite of decentralized financial and identity applications that cater to everyday needs, the team highlighted. This ecosystem combines the power of Worldcoin ID for secure identity verification with the functionality of Worldcoin, stablecoins, and various financial services.\n\nWorldcoin said it will continue to contribute to Ethereum’s network and collaborate with the broader Superchain ecosystem to advance shared goals in scaling, security, and interoperability.\n\nOptimism also shared its excitement about the introduction of World Chain. Notably, Coinbase’s L2 network, Base, also leverages the OP Stack, highlighting the growing adoption of this innovative scaling solution.\n\n🔴 The Optimism ecosystem continues to grow: @worldcoin announces World Chain will be built on the Superchain. Another L2 choosing the OP Stack:\n\n🧑‍🤝‍🧑 10M+ users joining the Superchain\n\n📈 Revenue contribution to the @Optimism Collective\n\n✨ Collaborative ecosystem development — Optimism (@Optimism) April 17, 2024"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMibEFVX3lxTE90b2FwNy0zQWRMUnJ6UjhYc0czd1M0MThIVVpPRTVUZ0NfdXZEMDAwY1pmOHg2Ukg5bE9YYW1YQzlRNWVkZ0drOUVlVm02elVkY3daTVBuMURmTk5PYl9wQ1EzdUZFWk9uZ1BMLdIBckFVX3lxTFA3dVZ4QnQ3YXNYY2lXUXZtUU1PVTdOM0p3X002UHM0d2luZ29OSmdXUVpGcnRwMnpqZndidTNVdUxLekRxR08wWDkyaU1kakVrbWwyeFFGVWpkSTZYTTBHYno5WllvaElSblN4N3dXWTVyQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Apr 2024 07:00:00 GMT",
        "title": "OKX debuts Ethereum L2 network X Layer - Forkast News",
        "content": "Cryptocurrency exchange OKX has launched X Layer, an Ethereum layer-2 scaling solution, to its public mainnet.\n\nDeveloped using Polygon’s Chain Development Kit, X Layer uses zero-knowledge proofs to enhance security and interoperability.\n\nThe newly introduced X Layer is fully compatible with the Ethereum Virtual Machine (EVM).\n\nX LAYER aims to unlock and accelerate the global adoption of the Web3 economy, ensuring greater individual freedom and opportunity for millions worldwide. We’re incredibly excited about what’s to come and welcome you to join us as we work to bring the vision of X LAYER to life.\n\n“X LAYER is integrated with OKX Exchange (CEX) and the OKX Web3 Wallet,” OKX Chief Marketing Officer Haider Rafique said in a statement on Tuesday.\n\n“Users can seamlessly bridge assets from the two platforms to LAYER to interact with the DApps deployed on the network.”\n\nRafique expanded on three of X Layer’s long-term purposes: to simplify on-chain decentralized applications, to empower creators, and to make transactions faster and cheaper."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxQdkVSQS15M0lGbi1nVVduMVJyb1lKZ19FOC1ScEVDQlVxVGNDd0tPWkM3c2lDRVRDTldXVWQ1a2pMOXEyZWsyMVhOS3hhbDQzVVJMRFNQUGhCX3E0bGdoN3NJbmRCZEhLanFNT0RybjFNU0hLdDZNUUd4VjNpMW0tR195SkpLM2hSWEpGcTYtU0R4MENSLTVCZGRlMjFTc3JmYWxHcThJTU9ObWRrTFhpNWhCR0Jka2tWQ28taDhPM080TzlEYUVPWUJnVjVfbHJsNlhQbEY4cW5OeUNUVkhiOVhqU0MxeE52?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Macro Guru Raoul Pal Says 80% Of His Crypto Investment Is In This Ethereum Rival: 'And I Have 1% In Stupid S**t Like Dogwifhat, Dogecoin And Bonk' - Benzinga",
        "content": "In a surprising shift within the cryptocurrency investment landscape, former Goldman Sachs executive and macro guru Raoul Pal has revealed a substantial reallocation of his digital asset portfolio, favoring Solana SOL/USD over other cryptocurrencies, including Ethereum ETH/USD.\n\nWhat Happened: Pal, during a conversation on the Bankless YouTube channel, disclosed that roughly 80% of his crypto investments are now in Solana, The Daily Hodl reported on Wednesday.\n\nThe macroeconomic expert has replaced his Ethereum holdings with high-end art NFTs and has also invested in Exponential Age Asset Management, a digital assets-focused fund. \"I am 80% SOL. All of my ETH is now NFTs (non-fungible tokens), I have been buying high-end art NFTs.\n\n“And I have 1% in stupid s**t like dogwifhat, Dogecoin and Bonk. Got all of those. But that's 1%… just to be clear I've got like in all of memecoins and everything else, 1% of my portfolio. I am 80% Solana.\"\n\nHe justified his heavy investment in Solana by referring to the Solana/Ethereum chart’s performance in 2022, which led him to go “all in” on Solana, paralleling his earlier decision to invest heavily in Ethereum in September 2020.\n\nSee Also: Will Bitcoin Slump To $20K Amid Increasing Middle East Tensions? Peter Schiff Doesn’t Rule Out Possibilit\n\nWhy It Matters: Pal’s strategic shift to Solana comes at a time when the cryptocurrency is making significant updates to address network issues. on Monday, Solana launched a mainnet beta update to manage network congestion, which was partly due to the high demand for Solana block space from soaring meme coin transactions.\n\nMoreover, the cryptocurrency market has seen a growing interest in meme coins, as highlighted by researcher TradeTheFlow. His thesis suggests that meme coins reflect a societal shift towards high-risk, high-reward investment strategies and are not just a passing trend.\n\nAdditionally, the Ethereum ecosystem has faced skepticism from some market participants. A Bitcoin trader and advocate, Fred Krueger, expressed a pessimistic outlook for Ethereum, indicating that it might be losing its market position.\n\nRead Next: Crypto Markets Tumble Following Iran’s Drone Attack Against Israel, Investor Warns Of Continued Selloff\n\nImage via Shutterstock"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxQUTJYSGNmYXEwQkhIWE81QXYyaHVlelJBQ2VOY2xWY2FmenRJdUJsQjNOU21VcGViZTdBWUN4aGU5NXZEeTlvbkR1RTlGaWIxclZQN1pmZ2FMX0Z2SHhMOHhLenhhYnVRWXRXaFctRWV6NUNHTFFZaGVxdDU4MG9DWnBrWGF5Tmdma3lSWEtyT0ZRUjRDZ2lNMkg0TzZFTHc1QUdOcVRscVJiM2hWYktvRXJHUDg5d3dBVDltVzFMbHEtOUQ1NjFZZFh5My1Sb2NOVVZwMnQ3S2hlS1NsSXRYWEd2eHRFakxG?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Jim Cramer Says Just Go Buy Ethereum Or Bitcoin Instead Of Marathon Digital: 'Let's Not Fool Around' - Benzinga",
        "content": "In a recent episode of “Mad Money,” host Jim Cramer advised against investing in Marathon Digital Holdings Inc. MARA and instead recommended Bitcoin BTC/USD or Ethereum ETH/USD.\n\nWhat Happened: Cramer, in his “Lightning Round” segment, discouraged viewers from purchasing Marathon Digital, a company involved in Bitcoin mining, reported CNBC. He suggested that investors consider Bitcoin or Ethereum as alternatives.\n\n\"If you want to own Marathon Digital, just go buy either Ethereum or buy Bitcoin, ok. Let's not fool around,\" Cramer said.\n\nMarathon Digital’s stock has experienced a tumultuous period, with its value dropping by over 20% in the past month. This decline is attributed to the overall volatility in the cryptocurrency market.\n\nSee Also: NFLX, AMC,UAL, WISA, TSLA: Top Trending Stocks Today\n\nWhy It Matters: Cramer’s advice aligns with the current state of the crypto market. On Tuesday, cryptocurrency analyst Ali Martinez highlighted the importance of Bitcoin’s $62,000 support level. Failure to maintain this level could shift focus to the next significant demand area, approximately $51,500. Conversely, a climb back above $66,250 could significantly boost the chances of a resurgence in the market.\n\nDespite concerns about the crypto market, Wall Street experts remain confident in the bull market‘s continuation. They cite a robust U.S. economy and the potential of artificial intelligence (AI) as key drivers.\n\nOn the broader market front, Cramer has also outlined potential factors that could lead to further market decline, advising investors to be cautious about their buying and selling decisions. His recent advice regarding Marathon Digital is in line with his cautious approach to the current market conditions.\n\nPrice Action: While Marathon Digital Holdings closed at $14.63 on Wednesday, marking a modest 0.21% increase, the stock has experienced a significant decline of 36.20% year to date. In contrast, Bitcoin is currently trading at $61,562, showing a 0.48% increase in the last 24 hours and a notable 39.37% gain year to date. Ethereum, on the other hand, is trading at $3,000, with a 0.61% increase in the past 24 hours and a solid 27.54% gain year to date, according to data from Benzinga Pro.\n\nRead Next: Macro Guru Raoul Pal Says 80% Of His Crypto Investment Is In This Ethereum Rival: ‘And I Have 1% In Stupid S**t Like Dogwifhat, Dogecoin And Bonk’\n\nImage Via Shutterstock"
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE9ITkM3V2lQRGJieV9nYWExRHdZRkVLUDNwQjJXYkl6YWxNelhXb0E2Vlg0NzAzZGhBbHg0d1pZdHE4Z2RaQ0JNc1pWUUxTWWJ3dlJWNlB2QXp4ODVOX2h0VDRFUVl5blBDTE01ZmVQNm9HQTBHM05J0gF_QVVfeXFMUFZZcHYtWVNmeGVvZ05HNWQ1b0RjZmhNdW9JRWVlQk42dnBmTm1XeGs3bWZFLVNXU3ZJQzM4QXZfMV8wQ01NLWpqMnBHM1VGRE1FU3JlcVJHV2k5TTNVWmFVMlNkN2hSQVprQ1ZCei1MSGstNGxWX3AzOUQ5YVpqNA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "'Guy Explaining' Nightclub Meme to Be Sold as Ethereum NFT - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nA popular meme photo of a guy at a club yelling into a girl's ear—about something that she doesn't appear to be into—is going up for auction as an Ethereum NFT on Foundation.\n\n“Milk Edinburgh” received its name from the nightclub where it was taken—Milk, in Edinburgh Scotland. The picture was originally shared around the internet with a watermark of the club's moniker on it, which is why the name stuck, and it’s since been widely used as an example of a “guy explaining” or “mansplaining.”\n\nThe photograph was originally taken in 2018 by David Wilkinson—who along with the help of pseudonymous Feisty DAO member Cryptopathic—is now offering the original artwork for sale as an NFT.\n\nA member of Feisty DAO was able to get ahold of Wilkinson, and found out that he had actually minted the image as an NFT back in 2021 but it had never sold; Cryptopathic and FeistyDAO offered to step in and host the auction for him free of cost.\n\nAD\n\nAD\n\nThe next meme to be auctioned is \"Nightclub Meme\" by David Wilkinson. The reserve will start at 15 ETH, for a 3 day auction beginning at 10am BST on Monday the 22nd of April. pic.twitter.com/40gkrIUbFg — path.eth 🛡️ (@Cryptopathic) April 17, 2024\n\nThis isn’t the first time that they’ve connected with the creator of a meme to sell it as an NFT. He helped the owners of the dog depicted in the Dogwifhat (WIF) meme coin auction off their pet’s photo for $4.1 million in a similar auction. Previously, they helped the owners of Kabuso—the dog used for the logo of crypto’s first dog-themed meme coin, Dogecoin (DOGE), sell NFTs.\n\nPath told Decrypt that their motivation behind all of this is to onboard more creators into crypto, and show them that NFTs are a beneficial way to monetize their work.\n\n“Many of these creators are approached by predatory teams that are looking to take huge cuts, or hugely underpay the artist—making it seem that this space is just as bad or worse than the rest of the art industry,” he said. “With our model, we are happy to benefit purely from PR, and really show people how easy it is to take control of their work in this way.”\n\nAD\n\nAD\n\nThe meme will go up for auction on Monday, April 22 on Foundation at 5am ET. The NFT will have a reserve price of 15 ETH, or about $45,000 at present.\n\nEdited by Andrew Hayward"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiaEFVX3lxTE9Sc09XUkpNZ1F3aG1pOXhudmlzNU1VVGlMeEswX2gySkdHOTNyYVRzN1RJenR0VFRLQWg2a1lSX3IyWUhybE9uU0F2eW4xZ0JMSHJmcTRIUHNLSmczcVgzaGdqU2xWSHI0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "What is Ethereum's Pectra upgrade? Bringing smart contract functionality to wallets - OKX",
        "content": "What if managing your Ethereum wallet could be as easy and secure as sending an email? The Ethereum network has introduced a big change that aims to deliver this kind of simplicity to users, called the Pectra hard fork. The update is expected to make transactions safer, bring added stability to the network, and introduce a host of new features.\n\nEIP-3074 is a key part of the Pectra upgrade. It'll change how transactions are handled, making the network more accessible and bring smart contract functionality to wallets. How will these modifications affect the blockchain community? Read on as we explore the Pectra hard fork and what it means for users of the Ethereum network.\n\nTL;DR\n\nPioneering change: The Ethereum Pectra hard fork aims to change how people use their wallets and make the network more efficient.\n\nEIP-3074 introduction: The proposal allows regular digital wallets to use smart contracts, enabling you to make more complicated transactions that are also safer.\n\nStreamlined transactions: Grouped transactions and paying fees to third parties aim to make usability easier.\n\nSocial recovery feature: The update introduces a new way to regain lost funds, using trusted contacts instead of traditional seed phrases.\n\nCommunity impact: Greater simplicity and safety from Ethereum and its wallets can help increase people's trust in and use of decentralized applications.\n\nWhat is the Ethereum Pectra hard fork?\n\nThe upcoming Ethereum Pectra hard fork is a major milestone in Ethereum's history. It aims to improve wallet capabilities and the overall efficiency of the network. The update, which introduces numerous Ethereum Improvement Proposals (EIPs) — and notably EIP-3074 — is scheduled for launch in late 2024 or early 2025.\n\nThis proposal is designed to change the way Ethereum handles transactions by allowing digital wallets to use smart contracts. EIP-3074 includes capabilities such as grouped transactions, which let users sign a transaction once regardless of how many tasks it contains. The proposal also allows for endorsed transactions, which enable someone other than the asset owner to pay for transaction fees.\n\nThese improvements are intended to simplify a user's interactions with the Ethereum network, greatly enhancing the overall experience by removing transaction complexities and expenses. Meanwhile, EIP-3074 comes with a new \"social recovery\" feature. The feature lets you regain access to your assets without needing the usual seed phrases.\n\nImpressive, but it doesn't end there. These latest upgrades are part of a wider plan to future-proof the Ethereum network and strengthen its status as one of the leading platforms for decentralized applications (DApps) and smart contracts.\n\nWhat are the security implications of EIP-3074?\n\nWhile EIP-3074 helps to make Ethereum more secure and easier to use, it's important to be aware of some security implications brought by the proposal's introduction. For example, the AUTH and AUTHCALL opcodes allow for more flexible transaction management but do introduce potential new vulnerabilities.\n\nSecurity benefits\n\nFormal audits and verification : EIP-3074 went through security audits to ensure safety. Audits are essential for finding and fixing vulnerabilities before they're exploited.\n\nEnhanced user control and recovery: With EIP-3074, you can use digital signatures to give control of your Ethereum accounts to a smart contract. This makes it easier to get your assets back or manage them without risking the safety of your private keys.\n\nSecurity risks\n\nPotential for misuse of invoker contracts : One of the main risks associated with EIP-3074 is the potential misuse of invoker contracts. If these contracts aren't implemented securely, they could be exploited to perform unauthorized transactions or access funds without the user's consent.\n\nNeed for trusted invokers : Building on the point above, transactions made with EIP-3074 need invoker contracts that can be trusted. Developers should use measures like whitelists to allow only confirmed safe entities to be involved in transactions.\n\nComplexity in transaction authorization: Using more complex ways to approve transactions can make new and old contracts easy to attack. Greater complexity occurs because the AUTH opcode changes who's seen as the \"sender\" in transactions. Vulnerabilities can arise if this process isn't managed carefully, putting users at risk of attack.\n\nMitigation strategies\n\nComprehensive auditing: Regular checks of the EIP-3074 implementation and the invoker contracts are important to protect users. These checks can help identify and fix vulnerabilities before they're exploited.\n\nStrict validation of commits: To avoid issues like unauthorized access or replay attacks, commits must include ways to make sure each transaction is authorized correctly and can't be misused. One way to do this is by using unique identifiers or nonces.\n\nHow does the social recovery feature work with EIP-3074?\n\nThe social recovery feature brought by EIP-3074 is one of the most noteworthy updates coming to the network. Let's explore how it works in more depth.\n\nDigital signature for asset control : First, you give control of your assets to a special contract by using a secure digital signature. This step is important because it lets the contract manage the assets, but you can still get them back if needed.\n\nInvoker contract : When the assets move to the new contract, that contract will handle all future actions for you. This setup lowers the chance of losing access to your assets if you forget your private keys.\n\nOperational codes - AUTH and AUTHCALL :\n\nAUTH : This code checks that your digital signature and transaction details match your original instructions.\n\nAUTHCALL : After checking, this command lets the contract send crypto. It also allows others to know you've sent assets, so people can see the link between you and the contract's actions.\n\nSecurity and asset recovery : The digital signature contains a unique code that guarantees you can retrieve your assets if you lose or forget your seed phrase, making it an invaluable feature.\n\nEnhanced security measures: Despite the new features, there are risks of dangerous invoker contracts. To protect against losing assets without permission, the update includes ways to use invoker contracts that have been officially checked and reviewed.\n\nHow will EIP-3074 affect transaction processes on Ethereum?\n\nEIP-3074 will alter the processes involved in Ethereum transactions by adding new features that bring welcome simplicity.\n\nBatch transactions : EIP-3074 lets you combine multiple transactions into a single one. This should make transactions more efficient and may lower fees by distributing costs across multiple actions within the same transaction.\n\nSponsored transactions : Sponsored transactions are a new feature with EIP-3074. Here, a third party can pay the transaction fees instead of the asset holder. This could incentivize the use of DApps as asset holders no longer need to pay gas fees.\n\nSmart contract-like capabilities in EOAs: Now, regular user accounts can do some of the same things as smart contracts. They can give permission to smart contracts to perform actions autonomously.\n\nAlongside reducing the complexity of transactions made through the Ethereum network, the Pectra hard fork also introduces new ways for developers to make disruptive and easy-to-use apps.\n\nWhat other EIPs are included in the Pectra upgrade?\n\nVarious other proposals are set to be introduced as part of the Pectra hard fork, each bringing additional functionality to the network.\n\nEIP-7610 : This proposal is designed to make the system more secure by only letting addresses with storage space create smart contracts. In theory, this change will make it easier to upgrade the system in the future, especially via Verkle trees.\n\nEIP-7523 : EIP-7523 focuses on making the Ethereum network more efficient. With the proposal, empty accounts will be removed from the Ethereum state. This helps reduce the state's size, making the network faster and easier to use.\n\nEIP-7251 (Maxeb) : This addition aims to make the network more scalable by simplifying the management of validators. This is achieved by increasing the maximum effective balance for validators from 32 ETH to 2,048 ETH. Doing so reduces the need to manage multiple validators, which reduces complexity.\n\nEIP-2537 : The EIP-2537 update brings new pre-built functions to the BLS12-381 curve. These functions help make cryptography processes more efficient. Better cryptography means better security and verification on the network.\n\nEIP-3074, 5806, and 7377 : Account abstraction EIPs make it easier to process transactions. EIP-3074 adds new commands (AUTH and AUTHCALL) that allow for transaction contracts to be verified and executed autonomously once certain permissions are set. This helps with complicated tasks like combining multiple transactions into one or having someone else pay for a transaction.\n\nEIP-5920 (PAY opcode): EIP-5920 provides an easier way to share ETH by sending tokens directly without activating the receiver's contract code.\n\nEach EIP contributes to the broader goal of making Ethereum more scalable, secure, and user-friendly, laying the groundwork for future advancements in the blockchain space.\n\nWhat comes after the Pectra hard fork?\n\nFurther updates are planned following Pectra's release in late 2024 or early 2025, most notably the addition of Verkle trees.\n\nAfter Pectra, Ethereum is planning more updates. One important step is adding Verkle trees, which upgrade Ethereum nodes to validate blocks without needing to store large amounts of state data. This upgrade is a significant step towards 'statelessness' for the network. A stateless client doesn't need to store a full state database to validate incoming blocks.\n\nVerkle tress and progress towards statelessness complements Ethereum's wider ambitions to improve scalability through advanced technologies like sharding, which aims to increase the number of transactions the network can process at once. This scalability solution has been a major focus following the network's move to Proof of Stake with the 'Merge' event.\n\nThe final word\n\nThe upcoming Ethereum Pectra hard fork promises to permanently alter how users make transactions on the network and manage their wallets. Efficiency, safety, and uprated features are all key benefits set to be brought about by the development and the arrival of the EIP-3074 proposal.\n\nAlthough this next phase of evolution for the network isn't without its challenges — notably, concerns over potential security vulnerabilities — it marks fresh change for Ethereum and added competitiveness for the network."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQekJRMUJtOGRsSUJEbWE4YlJDalJRMUdCTm1raXNZRDM4cjh4bXZrYXdDTXFpV3oyNlhpdHNUQUs1dkxuWjJ2Sl84bWFUTHFXRmluQ1hLTVl3cElMZEh6dFYzc0taNlhWVVpPNXNBal9JYWZlVE5ldndBanFTYURvUlpTWHg1eEtibWVUS0x6cW1xWFU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Apr 2024 07:00:00 GMT",
        "title": "SOLOWIN HOLDINGS Selected as a Key Participating Dealer for Harvest Global’s First Spot Bitcoin and Ethereum ETF in Hong Kong - Yahoo Finance",
        "content": "Solowin Holdings\n\nHONG KONG, April 16, 2024 (GLOBE NEWSWIRE) -- SOLOWIN HOLDINGS (Nasdaq: SWIN) (“SOLOWIN” or the “Company”), a securities brokerage company that offers comprehensive financial services primarily to Chinese investors, today announced that Solomon JFZ (Asia) Holdings Limited, its operating subsidiary, has been selected as one of the three participating dealers for Harvest Global’s spot Bitcoin and Ethereum ETF in Hong Kong. Harvest Global was one of the just three ETF providers to receive conditional approval from the Hong Kong Securities and Futures Commission (SFC) this week to launch spot Bitcoin and Ethereum ETFs.\n\n\n\nMr. Thomas Tam, Chief Executive Officer of SOLOWIN, commented, \"We are excited to play a crucial role in the launch of Harvest Global’s first spot Bitcoin and Ethereum ETF in Hong Kong. This milestone will not only provide investors with new asset allocation opportunities but also reinforces Hong Kong's reputation as a top international financial centre and a hub for virtual assets. As a key participating dealer, we will leverage our expertise in financial products and our deep understanding of the local market to offer the ETF to a broad spectrum of investors and clients. Our partner, OSL Digital Securities, will act as the trading platform and sub-custodian for the ETF. We are committed to providing the highest quality of services to clients and upholding the highest standards of regulatory compliance and security. Being part of this groundbreaking initiative will position us to attract a wider range of investors and strengthen our position in the virtual asset market.”\n\nThe conditional approval, coming just three months after the U.S. introduced similar ETFs which attracted around US$12 billion in investments, marks a significant regulatory advancement for Hong Kong’s aspirations to be a global virtual asset hub. The virtual asset spot ETFs in Hong Kong will also introduce an in-kind subscription mechanism that allows investors to buy into the ETF using Bitcoin or Ethereum directly. This is expected to act as a transformative vehicle for channelling significant investment into the virtual asset space.\n\nAbout Solowin Holdings\n\nBased in Hong Kong, SOLOWIN HOLDINGS is a versatile securities brokerage company strategically focused on high-net-worth investors worldwide. It offers a wide spectrum of products and services, spanning from traditional assets to virtual assets through its advanced and secure one-stop electronic platform, Solomon Win.\n\nExperiencing robust growth since 2021, SOLOWIN HOLDINGS distinguishes itself through its subsidiary, Solomon JFZ (Asia) Holdings Limited (“Solomon JFZ”), licensed by the Hong Kong Securities and Future Commission. Solomon JFZ empowers the company to deliver unparalleled one-stop financial solutions to both individual investors and corporate clients. The diversified offerings include Securities Brokerage, Investment Banking, Asset Management, Virtual Assets, and cutting-edge FinTech Services. For more information, visit the company’s website at http://ir.solomonwin.com.hk .\n\nStory continues\n\nForward-Looking Statements\n\nCertain statements in this announcement are forward-looking statements. These forward-looking statements involve known and unknown risks and uncertainties and are based on the Company’s current expectations and projections about future events that the Company believes may affect its financial condition, results of operations, business strategy and financial needs. Investors can identify these forward-looking statements by words or phrases such as “may,” “will,” “expect,” “anticipate,” “aim,” “estimate,” “intend,” “plan,” “believe,” “is/are likely to,” “potential,” “continue” or other similar expressions. The Company undertakes no obligation to update or revise publicly any forward-looking statements to reflect subsequent occurring events or circumstances, or changes in its expectations that arise after the date hereof, except as may be required by law. These statements are subject to uncertainties and risks including, but not limited to, the uncertainties related to market conditions and other factors discussed in the “Risk Factors” section of the registration statement filed with the SEC. Although the Company believes that the expectations expressed in these forward-looking statements are reasonable, it cannot assure you that such expectations will turn out to be correct, and the Company cautions investors that actual results may differ materially from the anticipated results and encourages investors to review other factors that may affect its future results in the Company's registration statement and other filings with the SEC. Additional factors are discussed in the Company's filings with the SEC, which are available for review at www.sec.gov .\n\nFor investor and media inquiries please contact:\n\nSOLOWIN HOLDINGS\n\nInvestor Relations Department\n\nEmail: ir@solomonwin.com.hk\n\nAscent Investor Relations LLC\n\nTina Xiao\n\nPhone: +1-646-932-7242\n\nEmail: investors@ascent-ir.com\n\n\n\n"
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxQd3JyS0g1ZE9KNGpleWgtZEN3MkhFVDJHQzBvOHVaNnpWdGxzV3RBV1BINHRUV1QzbmxrX18zRHdiNG1VTmdWNjVzMjhycDV0UFZaai1sQlNmblh4Ykg5Q3dVSGlvUGJ4MnlRUVg0dWh3Qjg3ZkhlVHZwRWlHNHR1QTF1dWdwY2hvb0NidnJEMU9tVGV2VWdIbXhoaFg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Apr 2024 07:00:00 GMT",
        "title": "Ethereum’s Vitalik Buterin pushes Tornado Cash alternative: ‘Privacy is normal’ - DLNews",
        "content": "GM, Tim here.\n\nHere’s what caught my DeFi-eye recently:\n\nThe restaking rush continues with EigenLayer and Karak launches.\n\nUpgradable code costs Blast DeFi users $26 million.\n\n“Privacy is normal,” says Vitalik Buterin after using Tornado Cash alternative Railgun.\n\nKarak challenges EigenLayer in restaking race\n\nEigenLayer just hit a new milestone on its restaking road map, letting those who have deposited tokens to the protocol delegate them to node operators.\n\nNode operators are individuals or organizations that let users delegate their restaked Ether to them. They then opt in to provide actively validated services, which earn delegates a boosted yield on their restaked Ether.\n\nDelegated tokens will secure EigenDA, the first of many protocols expected to benefit from restaking on Ethereum. However, restakers will have to wait a few more weeks to start earning boosted yields.\n\nAnd EigenLayer isn’t the only one. Karak, EigenLayer’s main competitor, has launched private access, letting those with an invite start to restake on the protocol.\n\nSo far, Karak has drawn in $195 million in deposits — still far below EigenLayer’s $12.6 billion.\n\nLike EigenLayer, Karak has launched its own points system, called Karak XP.\n\nJoin the community to get our latest stories and updates\n\nPoints systems usually indicate a DeFi protocol is planning to launch and airdrop a token.\n\nWith two restaking protocols offering potential airdrops, whichever one announces a token first should receive a big boost from the attention.\n\nPac Finance users lose $26 million in seconds\n\nA sudden, unexpected code change at Blast lending protocol Pac Finance cost users $26 million, highlighting the risks of upgradable smart contract code.\n\n“This was a result of the liquidation threshold being altered unexpectedly without prior notification to our team,” Pac Finance said on X.\n\nPac Finance is a fork of Aave, the biggest lending protocol in DeFi.\n\nA fork is where a developer team uses the open-source code from an existing DeFi protocol to launch a similar protocol — often on a different blockchain or with minor changes.\n\n“Fundamental problem with forking code is the lack of in-depth knowledge of the software and the parameters,” Stani Kulechov, founder and CEO of Avara, the company behind the Aave protocol, said in an X post.\n\nThe incident highlights the risk of upgradable code in DeFi protocols. If a protocol chooses to keep its code upgradable, those with permission can change the rules that govern the protocol at any time — often without warning.\n\nNot all DeFi protocols allow for code upgrades. Uniswap, Curve Finance, and many other protocols make their code immutable, meaning once it’s deployed on a blockchain, it cannot be retroactively changed.\n\nVitalik on privacy protocol Railgun\n\n“Privacy is normal,” Ethereum co-founder Vitalik Buterin said in an X post on Monday, responding to the fact that he had just transferred 100 ETH — worth about $310,000 — through privacy protocol Railgun.\n\nPrivacy is normal.\n\n\n\nRailgun uses the privacy pools protocol ( https://t.co/DekkatsMR5 ) which makes it much harder for bad actors to join the pool without compromising users' privacy.https://t.co/MG0huDzpAu — vitalik.eth (@VitalikButerin) April 15, 2024\n\nPrivacy is normal.\n\n\n\nRailgun uses the privacy pools protocol ( https://t.co/DekkatsMR5 ) which makes it much harder for bad actors to join the pool without compromising users' privacy.https://t.co/MG0huDzpAu — vitalik.eth (@VitalikButerin) April 15, 2024\n\nRailgun is similar to sanctioned protocol Tornado Cash in that both allow users to break the chain of traceability between blockchain transactions.\n\nHowever, Railgun uses the Privacy Pool protocol, an idea put forward in an academic paper co-authored by Buterin in September.\n\nPrivacy Pools tries to solve the issues with Tornado Cash — namely that it has facilitated an estimated $1.2 billion worth of illicit transactions for criminal organisations such as North Korea’s Lazarus Group.\n\nIt lets honest users create a cryptographic proof that shows the money they put into the protocol didn’t come from wallets associated with stolen funds or illicit activity, while at the same time keeping the origin of the money secret.\n\nThe hope is that if all honest users generate these proofs, bad actors attempting to launder money through the protocol will be the only ones left without them, letting crypto exchanges and law enforcement identify and exclude these users.\n\nData of the week — Railgun overview\n\nPrivacy protocol Railgun’s popularity has grown, even before Buterin mentioned it in his X post.\n\nRailgun has facilitated almost $1 billion in transaction volume since its launch in May 2022.\n\nrailgun Railgun is processing more transaction volume in recent months. (@railgun_project)\n\nThis week in DeFi governance\n\nVOTE: Uniswap DAO votes for Manta Pacific onboarding package\n\nPROPOSAL: Arbitrum DAO wants to activate the blockchain’s Stylus upgrade\n\nVOTE: SafeDAO votes to make its SAFE token tradable\n\nPost of the week\n\nPseudonymous crypto trader GCR made their first X post in almost a year over the weekend as Iran’s drone attack against Israel jolted the crypto market.\n\nGCR is one of the most revered crypto traders on X, building a strong reputation by making numerous accurate predictions.\n\nWhether you buy into their takes or not, GCR’s posts have the power to move markets and sway sentiment — so they’re definitely worth paying attention to.\n\nIf you've been sidelined, believe this is a good opportunity to scale into high conviction tokens\n\n\n\nIf you're fully invested, just survive, hold your spot positions and do not capitulate\n\n\n\nSomeone once said, liquidations are a forced transfer of wealth from traders who need… — GCR (@GCRClassic) April 13, 2024\n\nIf you've been sidelined, believe this is a good opportunity to scale into high conviction tokens\n\n\n\nIf you're fully invested, just survive, hold your spot positions and do not capitulate\n\n\n\nSomeone once said, liquidations are a forced transfer of wealth from traders who need… — GCR (@GCRClassic) April 13, 2024\n\nWhat we’re watching...\n\nGM\n\n\n\nTether's tokenisation platform will soon be available to everyone.\n\nA masterpiece.\n\nFully non custodial.\n\nMulti chain.\n\nMulti asset type.\n\nSuper customizable.\n\n\n\n+T — Paolo Ardoino 🍐 (@paoloardoino) April 14, 2024\n\nGM\n\n\n\nTether's tokenisation platform will soon be available to everyone.\n\nA masterpiece.\n\nFully non custodial.\n\nMulti chain.\n\nMulti asset type.\n\nSuper customizable.\n\n\n\n+T — Paolo Ardoino 🍐 (@paoloardoino) April 14, 2024\n\nTether CEO Paolo Ardoino hints at his firm’s new tokenisation platform.\n\nThe move comes on the back of BlackRock’s tokenised fund BUIDL, which has attracted almost $300 million on Ethereum.\n\nGot a tip about DeFi? Reach out at tim@dlnews.com."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxNUjVBTTM1TkY1UmZ5aHBuOHZrWEd5RC13WUROZ19vVEE2Z2dTNUtFVFVDV0pmVHVtNEdIYnhoWjVBZnJIOHoyVGFXLU1wY21wUGZjTlE4T1gtWUdEaU05bG4zcF9nZDl1RmNLMlpXRzNJTi0tWGtROHl6QWRUM1A1NTVRd3pvZ0Ez0gGQAUFVX3lxTE1vUzl2MXczRjA2WGtHR01YTXdfTnRCaEpSTTU3U0h1aGZLWUZNZkpyU1lJUjdyZWVaeXJOalZSYXRCRW82enlQMDZ0M185VzBpdzZ4Rjk0QUs0WHJVWTZBYjR1LUE3cFBtU1psMnVyM2VJNUxXajRVSkFuRnpSODdLLV9ZZUhBNlg3VkhISkwxag?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Apr 2024 07:00:00 GMT",
        "title": "Saga Reveals Massive Airdrop With Ethereum, Solana, and Avalanche Projects - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nGaming-focused layer-1 blockchain Saga has announced an airdrop campaign so huge, the team is calling it: Power-Level Over 9000! It’s a “Dragon Ball Z” reference that spawned a memorable internet meme, and now it’s conveying the scale of this sizable rewards push.\n\nIn partnership with over 100—not quite 9,000—projects and games across various blockchain networks, users who stake their SAGA tokens will be eligible for bundles of token and NFT airdrops “over the coming months,” the announcement says.\n\nEach airdrop is grouped in “vaults” that feature multiple projects giving out various prizes. Notable games across various chains, such as Avalanche first-person shooter Shrapnel, Ethereum metaverse game The Sandbox, and Ethereum racing game Wilder World are all involved in the campaign, with more to be announced.\n\n“At Saga, we take immense pride in fostering collaboration and unity within the Web3 gaming community,” Saga said in the announcement, “With partners hailing from diverse ecosystems, including Ethereum, Solana, Cosmos, Polygon, and Avalanche, our airdrop campaign serves as a testament to our unwavering commitment to bringing the Web3 gaming community together.”\n\nAD\n\nAD\n\nWhile there are projects outside of the Saga ecosystem participating in this event, the “majority” of drops will come from “chainlets” that use the Saga network.\n\nSaga is a layer-1 network that enables developers to launch their own layer-1 chains, instead of deploying projects on the Saga mainnet. The chains that developers launch are called chainlets and can support other chainlets within the Saga network.\n\nThe fresh-faced layer-1 network made a name for itself with its previous airdrop campaigns, which led to a record-breaking $13.4 billion staked on Binance to earn SAGA token rewards.\n\nAD\n\nAD\n\nLast week, Saga launched its mainnet alongside its token listing on major cryptocurrency exchange Binance. This new airdrop campaign is its first big marketing push now that the token is live.\n\nEdited by Andrew Hayward"
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE92VUFObnJTODVkdU9nOFpTQS1QVGpDWkdnNFZmVmpqZFlxSFNfd0lrTXBSV3BIbkswd0xaY0FiZnRqUUl3UGZidWRscWhBMF84SHltaGhuUHVvMnN3cnlDcEduX19oV3BoZFI2RjdDOTV4a0lBemxmUW5vOHlxdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Could Drop To $2,000 Level: Here’s Why - Watcher Guru",
        "content": "Ethereum is on the verge of a significant price decline, according to a recent technical analysis by Alan Santana, a well-known crypto analyst. Santana forecasts that Ethereum will reach a price of $2,000 within a few days or weeks, advising investors to brace for the impending decline.\n\nThe analyst points out that Ethereum has been drooping for six weeks straight, yet many investors are still waiting for new highs. Santana presents a compelling five-step sequence that draws parallels between the current market situation and the events that unfolded in November 2021.\n\nAlso read: Can Ethereum (ETH) Hit All-Time High After Bitcoin Halving?\n\nFrom All-Time High to Bearish Momentum\n\nIn early November 2021, Ethereum reached a new all-time high (ATH) but immediately turned red, signaling a potential reversal. Santana emphasizes that while the market is at its most bullish when hitting a new ATH, it also opens up the highest bearish potential.\n\nHe notes that the best time to sell is when prices are trading high and near resistance, as waiting for full confirmation from the market often leads to missed opportunities.\n\nFast forward to early March 2024, Ethereum once again produced a peak, reaching a multi-year high before turning red and starting to drop with bearish momentum growing last week. This pattern closely resembles the events that followed the November 2021 ATH.\n\nAlso read: Can Solana (SOL) Hit $200 After Bitcoin Halving?\n\nEthereum EMA10 Breakdown Confirms Top Is In\n\nFollowing the November 2021 ATH, Ethereum dropped below the 10-week exponential moving average (EMA10) as it turned red. The break and close below EMA10 confirmed that the top was in, and a new bearish wave had begun, leading to the “first drop.” Similarly, last week, on April 8, 2024, Ethereum moved below the EMA10 on the weekly timeframe, confirming that the top is once again in.\n\nFollowing the top confirmation, Santana now anticipates the “first drop,” which could lead to a target range of approximately $2,222 to $2,400. A dead-cat bounce, a temporary recovery in a declining trend, may follow this drop, ultimately leading to a lower low and a bearish impulse.\n\nAlso read: Shiba Inu (SHIB) & Dogecoin (DOGE) Price Prediction This Week\n\nThe analyst suggests that the major flush could reach $2,000, around the 200-week moving average (MA200), which is considered a significant support level. While the price could potentially go lower, Santana identifies this as the key support area to watch."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxPOXNxajhlVGJITnFzRVpEOW1UeW44ejlSWVdHVWVJSzJTQnJ4TVA5Um9VSEYtc0dsaE5oX3REejF4aWVHY1YtZU0yNGU5d3h5a1QxVXlLMU9qd3luZmZHQXdUcklsLU9Gd0R1Z3dESGstcXJPSFFYQUFhbEw2SERFZm9xck00eG11TUxQRmV3cV9OY3ZCX1o1YV9odm4tQUs3SnVYclNaNjhBcGVvTGwyWmc3c9IBuAFBVV95cUxPYnhTcGFmYXRkWXJFaTFXeXVKVVhrdklDUXA2dmE5SlBQc0JiaG9WeHVpOG9OYi1Dc1pPRXUyMTZ1WkVIMjc1X0pYSFcyV2Nac25CNldMVE1kc2JTZG1jVmhBZG5JOW13NFdPeEpBa3EycmNrdU95a0pOaUJKQWpGQ0NxRzZ0d1N6MUgzWUwzV3hFbmtoNHVZTUpLS294SjFYTkZDaW5faldjaUM2TTNnUkcxU04tNFox?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Apr 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Secures $3,000, Cardano's (ADA) Dramatic Drop Irrelevant, Will Shiba Inu (SHIB) Recover After 30% Plunge? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nCardano has witnessed a substantial drop to the $0.4 region, suppressing the price by over 20%. Despite the dip, the ascent suggests a potential rally through the 200 EMA, challenging the downtrend with limited volatility and apathetic trade volume.\n\nCardano's price action has been a roller coaster, with its recent plunge to the $0.4 support level and a subsequent bounce back. At the time of writing, ADA has seen its value soar above $0.48, instilling a fresh wave of inflows into the market.\n\nIt is noteworthy that the descent has not influenced the coin’s longer-term trend, which has been bearish with an absence of significant volume — a hint that the market is still in search of a solid direction. However, the surge above the 200 EMA will push the coin into the bullish zone once again.\n\nIf ADA fails, the $0.4 level remains a crucial bastion of support, and its endurance will be critical in preventing further declines. However, if the marketwide recovery continues, there is a good possibility of a prolonged continuation of the rally.\n\nAdvertisement\n\nShiba Inu takes hit\n\nShiba Inu has seen a sharp 30% decline. But one way or another, the only question in most holders' minds is: \"Will Shiba Inu really recover?\"\n\nThe token's dip to the $0.00002165 mark has been met with a mixture of concern and anticipation. A rebound from this level could signal a strong support base, potentially pivoting SHIB back into an uptrend.\n\nAs for the chart, the Bollinger Bands have been preceding the drop as their narrowing was a strong signal of an upcoming price surge. Now, with SHIB having slipped below the crucial 50-day moving average, the only thing left is to wait for a return above this aforementioned level.\n\nThe trading activity is pretty quiet, which shows that people are not too confident about SHIB right now. The RSI is suggesting that selling pressure prevailed over buys on the market, pushing the value of the token down.\n\nSHIB will face its first big test at the $0.00002880 level. If it can go beyond that, we might see the price move up toward $0.00003.\n\nAs for what's next for SHIB, it is really tough to say, considering the lack of fundamental development around Shiba Inu. However, there is always the possibility of a further price reversal and the return of the buying power on the market in general, which is going to push the value of tokens like Shiba Inu further up - especially if the risk appetite among investors returns.\n\nEthereum's comeback\n\nEthereum has made a strong and sufficient comeback, easily returning above the $3,000 threshold. The pivot suggests that Ethereum could continue its path upward despite this minor setback.\n\nFollowing the dip that moved the market, the price action has been affirmative, reclaiming the $3,000 mark with conviction. This level now forms a bedrock of support, cementing the current price range.\n\nSpecifically, the key support at approximately $2,700 is highlighted, a level where the asset has previously beaten the substantial buying pressure. The resistance can be found around the $3,600 zone.\n\nAs the price started rising, the volume started moving up, showing a lot of interest on the market. This rise in trading, along with the clear increase in price, has helped the upward trend to gain strength.\n\nThe intersection of technical indicators with market sentiment heralds a bullish scenario, where the previous peak at approximately $3,950 is not unreal.\n\nHowever, the most recent surge of volatility on the market might not go unnoticed, and it is important to avoid any risky moves that might drastically affect your portfolio."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxOemlFTjNmU0V5NS1POURtNm8tbUhRQWFTZGItZXNyOHF6Z1hkcUJFYlZJT2hKNEplU0lPbndwdDI3YmlKcG9PdG1lZzdXeHRNeUhzS0dWd0R4MVdMRkdTWHExZFNtSU5aOUtZSTM0S1hDVzFFVHBLdjJVTG1OTGdsdFIzVEZraE96MldRQ25PaDBldmFXa2haZF9XMF90Q3hXS1V2SjhvU19PREV3ajJNUnhTS1pnODRLMUVoY2FVTDDSAcYBQVVfeXFMTl9sOW9OTzM2cGNwWDVMMzFSNVcxQnU3V3A2R3h1UFlSRlNsT1g2c3ZCVDl6clhfbDFvSEVmOERaU1BMUk9vUXFROVllVXJOVXlmNG9VWXBfbEc1Y05Wc2h4blZOXzNVWUtyTHY2MzhUTHl5Q1NzMWJqWHhZcDJSSzFkTkQxZ3N6NEhyVEhwNjR0Q1FycmJXNU5ualN3VWJGSDJJb1psbDhPYkRYRHF2SkVJN3BoWFlaLVVCU2dXc0FTSGNCeTh3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Lido DAO announces new phase on Ethereum with Simple DVT module - FXStreet",
        "content": "Lido DAO voted on the deployment of the Simple DVT module nearly six months ago, it is ready for mainnet as of April 17.\n\nSimple DVT helps to make Lido’s technology accessible to more users.\n\nLDO price is down nearly 3% in the past day.\n\nLido DAO (LDO) announced that the Simple Distributed Validator Technology (DVT) is now officially ready for mainnet deployment. Lido DAO voted on this module nearly six months and laid the groundwork to diversify their node operators with the help of users that stake their assets with Lido.\n\nLDO price lost nearly 3% of its value on Wednesday.\n\nLido DAO plans to bring Simple DVT to stakers, diversify node operators\n\nLido DAO, a Decentralized Autonomous Organization that decides on the key upgrades and key parameters of liquid staking protocols, is ready to release the Simple DVT module on its mainnet. The clusters labeled Obol Cohort 1 are ready to accept Ethereum (ETH) deposits.\n\nThe Ethereum staking protocol’s goal was to diversify the Node Operator set with the participation of community and solo stakers within its ecosystem. The new depositable Ether will flow into the Simple DVT Module, and once it reaches capacity, it will go to the Curated Module.\n\nLido announced in its official blog that the third Obol testnet run in preparation for bringing Simple DVT to the mainnet, surpassed all minimum performance benchmarks.\n\nLido’s post says that the mainnet onboarding of 12 clusters is underway and the performance metrics are currently above the benchmarks.\n\nLDO price failed to keep up with the developments in the Lido ecosystem. LDO price shaved off 3% of its value in the past day and the token is down nearly 28% on the weekly timeframe. At the time of writing, LDO price is $1.947."
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxNb3p5RmV0M0dyU0J2aFBuNGZtSmtTaENhVlBocG1EaTk0RDE1dmhNcDZoTnVWMkFRWXlMNFdUNTBhVlhhRVdvOFpmOThoMkJIaHRrT2JCcHBGaE1JTG1uc0JMRVU3TFF1cmtfRFQ1UUFEUnM0Z3p6ckxnZVk4NHlkYmNvQnFoaWlXVDFhRFJMNDJfcVVDNUJ0TEdfT0NQa2ZKdGZ3OEZjNjRFNG9GSkE0NC1qbi1iTnN2emR1Z1lkOGRNYjTSAcgBQVVfeXFMTU9vMERuU1JoZjl4bWpOSi1uNTNkVjBLcWVLTjdrZmlVUzFDc25UbHhGYVAyYlJSeXNfcnV1TzY5SUpvM2VETjl6LVVPVFh2cGNuVnpDcDJLTEJrel9ZeHdYRW9aN2FfSnl4ZE9qYVBZZEZWOURMMXJIbVR4ZDQ0Y2xOOU1NMUtzYnFJdTNOeEk4UlFJSmxFclB2cHpnOGdPRnJYdTZtZ3ljbWw4MmpGZU1qMWNwYWF1cFVDYVlRVzd1Sm1xYVF0QnU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Forget Ethereum: BlockDAG’s 30,000x Potential Draws Crowds with Its Video Trailer on The Moon - Crypto News Flash",
        "content": "Once an obscure investment, cryptocurrencies like Ethereum have turned ordinary backers into billionaires. Today, Investors are shifting their focus from Ethereum to BlockDAG, attracted by its potential for astronomical returns. BlockDAG’s presale events have already generated impressive numbers, with $17.8 Million raised from presale activities and an additional $2.1 million from miner sales. As Ethereum faces internal debates over its issuance curve, BlockDAG captures the investment community’s attention, promising a 30,000x return on investment through its innovative mineable network.\n\nEthereum’s Current Climate\n\nThe recent debates over Ethereum’s issuance curve have the community in an uproar. As Ethereum moves into its next upgrade phase, Electra, proposals to decrease issuance to preserve solo staker viability are hotly contested. Figures like Eric Conner and Ahmad Bitar oppose these changes, fearing they undermine Ethereum’s established role as a digital currency by responding excessively to unfounded centralisation worries. This division presents a crucial moment for Ethereum, reflecting broader uncertainties in the crypto market.\n\nThe community is divided amid the discussions around Ethereum’s proposed issuance curve adjustments. Proposals for reducing issuance to benefit solo stalkers face strong opposition from prominent developers who argue that these changes could undermine Ethereum’s utility as a decentralised currency. This controversy highlights the challenges of evolving a principal cryptocurrency while maintaining its foundational principles and community trust.\n\nBlockDAG To The Moon Over $17.8 Million In Presale\n\nBlockDAG stands out in the bustling crypto presale market, having already raised over $17.8 Million in presale and $2.1 Million in miner sales. Its upcoming keynote promises an exhilarating revelation with BDAG on the moon, sparking widespread excitement. The current Keynote video denotes a 100 Million market liquidity promise, prospects of Top exchange listings like KuCoin, CoinEx, Gate.io, and Bitget plus a $0.05 listing price a jump of over 4900% from its earlier batch, BlockDAG’s roadmap is impressively ambitious.\n\nAt the heart of BlockDAG’s appeal is its innovative approach to blockchain technology. According to their latest technical whitepaper, BlockDAG enables developers to build, deploy, and earn efficiently.\n\nThe platform supports many blockchain activities, from creating smart contracts using popular development tools to deploying applications on a testnet before launching them on the mainnet. Furthermore, the potential for developers to earn through transaction fees, subscriptions, and token sales makes BlockDAG an enticing ecosystem for blockchain innovators.\n\nMoreover, BlockDAG utilises Directed Acyclic Graph (DAG) technology, ensuring scalability and performance remain robust as the network expands. This technical foundation facilitates many business models and encourages continuous innovation and community engagement.\n\nThe End\n\nAs the crypto community seeks the next lucrative investment following Ethereum’s historic rise, BlockDAG offers a compelling case with its potential 30,000x ROI. As Ethereum contends with internal conflicts and the crypto community’s growing concerns, BlockDAG positions itself as the preferred alternative for savvy investors. With over $17.8 million in presale revenue and a vibrant community rallying around its innovative offerings, BlockDAG is poised to redefine the investment landscape.\n\nThis burgeoning platform offers a significant ROI and showcases a robust roadmap and technological prowess, promising a lucrative future for early adopters. Join the movement by visiting BlockDAG’s website and exploring investment opportunities in what could be the next breakthrough in the crypto space.\n\nJoin BlockDAG Presale Now:\n\nWebsite: https://blockdag.network\n\nPresale: https://purchase.blockdag.network\n\nTelegram: https://t.me/blockDAGnetworkOfficial\n\nDiscord: https://discord.gg/Q7BxghMVyu\n\n[thrive_leads id=\"228374\"]"
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxPSm1wbmtqWmpfc2R6WE44OWotNXJDTkpnNmZKRkw5OWV1ZHM2dUM1bnRaazJHVlZjSFpCeE10VXFFc2dlYzBKUEhYTmZLdEVaMHhJa2F2MnRfZ2Fzd2IyMVlzeV84bnA5TTFyUUVycGJwU3VNZUZ1TExjSVNvVi1VTUV5M2RIX1dCdFhGS3VVRHhfQjBZ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Pepe vs Shiba Inu: Which Ethereum Memecoin To Buy Before Halving? - CoinGape",
        "content": "As the crypto community prepares for the fourth Bitcoin halving on February 20, 2024, the question of which Ethereum-based meme coin—Pepe Coin or Shiba Inu—to invest in becomes a significant topic of discussion. Both tokens share some common traits such and dedicated community and meme-inspired origins, yet their market performance and technical indicators set them apart in terms of their potential as an investment before the halving. In this article we share insights to empower you in making investment decisions, between PEPE and Shiba Inu.\n\nPEPE vs Shiba Inu: Price Market Performance\n\nPepe and Shiba Inu are two popular digital currencies that have attracted a lot of interest in the cryptocurrency market. Despite their similarities as memecoins, they exhibit differences in their price market performance and metrics.\n\nadvertisement\n\nAccording to CoinMarketCap data, SHIB boasts of a market cap of $13.23 billion, earning its position as the 12th largest cryptocurrency by market cap. In contracts, PEPE has a market capitalization of $2.23 billion, securing the 47th position, among the top 50 cryptocurrencies. This shows that Shiba Inu has a significantly greater market presence than PEPE.\n\nPEPE saw a 4.21% rise in price daily and a 24.87% increase weekly, yet encountered a significant 31.33% decline in the past month. On the other hand, Shiba Inu experienced a less significant daily gain of 2.87% and a monthly decline of 10%. SHIB’s weekly decrease was also 18.86%. This implies that although PEPE has faced substantial short-term fluctuations, its long-term results have been more inconsistent.\n\nWhen it comes to daily and weekly performance, Pepe coin experienced an increase of 4.21% in its value over the last week, and a 31.33% drop in the past month. On the other hand, Shiba Inu tokens recorded a slight gain of 2.87%, although it experienced losses of 18.86% and 10% over the past week and month respectively. This implies that although PEPE has faced substantial short-term fluctuations, its long-term results have been more inconsistent.\n\nIn terms of volume, both tokens have been actively traded in the market. PEPE had a trading volume of $722.3 million over a 24-hour period, whereas Shiba Inu’s volume was higher at $846.18 million. PEPE has a volume-to-market cap ratio of 32.53%, showing a greater level of trading compared to its market cap. SHIB’s ratio sits at 6.43%, indicating decreased trading activity in relation to its market cap.\n\nPEPE achieved its all-time high of $0.00001074 just slightly over a month ago, on March 14, 2024, but has since dropped in value by 50.68% to its current price of $0.000005293. On the other hand, Shiba Inu price reached its all-time high of $0.00008845 two years ago, in October 2021, and likewise, it has witnessed a dropped of approximately 74.67% to record $0.00002246.\n\nPEPE vs Shiba Inu: Price Forecast\n\nIn comparing the technical analysis of Pepe Coin and Shiba Inu, we observe distinct trends and patterns in terms of moving averages, oscillators, MACD, RSI, and Fibonacci support and resistance levels.\n\nBeginning with the moving averages, both Pepe Coin and Shiba Inu are showing decreasing patterns in their short-term signals. The 10-day exponential moving average (EMA) for Pepe Coin is 0.000005928279, while the simple moving average (SMA) is 0.000006150416. Shiba Inu has a 10-day EMA of 0.00002415 and an SMA of 0.00002476. Both sets of data indicate a bearish signal since the current prices fall below the short-term averages. In addition, the 100-day and 200-day EMAs and SMAs suggest a possible change in trend, with Pepe Coin displaying a more robust buy signal than Shiba Inu.\n\nRegarding oscillators, both cryptocurrencies present a neutral outlook. The Relative Strength Index (RSI) of PEPE stands at 40.21, while Shiba Inu’s RSI rests at 39.99. This shows that both coins are not experiencing any overbought or oversold conditions.\n\nLooking at MACD analysis, both the Ethereum meme coins indicate ‘sell’. SHIB exhibits a MACD level of -0.00000126, while PEPE’s MACD level is at -0.000000471995. This indicates a potential downward trend coming soon for both coins.\n\nWith regards to Fibonacci levels, should the price of Pepe Coin drop, it will find a strong support level at 0.000007435425, and Shiba Inu will find its support level 0.00002964 should its price drop. Both cryptocurrencies have various levels of support and resistance, but Pepe Coin is closer to its support levels, indicating potential price volatility. Shiba Inu, on the other hand, seems to have more distant support levels, which could imply greater stability in its price movements.\n\nWhich Ethereum Meme Coin Should you Buy?\n\nPepe Coin and Shiba Inu both provide distinct investment opportunities, but they appeal to varying levels of risk tolerance. Pepe Coin’s potential for future expansion makes it an appealing option for individuals looking for greater returns despite the increased risk involved. The market presence and stability of the Shiba Inu coin could attract investors looking for a safer and more consistent choice. In the end, choosing between Pepe Coin and Shiba Inu will be determined by personal investment objectives and willingness to take risks as the halving event nears."
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxNc2J1Q3pjSEVGSE9MZG9tNXRhMjJlY19xTUFuTzN1QUY3bGlucDlNc0YydVlpU3JDV2YyNnZfSUhEcjRsRnZYSjQtVGUzRUQ4Zm1VTmdERHkyMThmcWljajlzMEdEeUlTeGxpVGJ3YlY2dk8teTlhWXV2Rmt3M292WFlmaDZfUDdNUXpSeGVlQTVhUdIBlwFBVV95cUxOZ2c3aGtzSkJUTnpNUXJLVkIwOUxhWGNENENxSHpNaWR1a2I0elFuaXhwMGI4cXpGWkx0WmNzNWJKM0p0c2FEUW1NaWhac2hZMklPV2hRMWwtTkNCODNyUnNQaEdjLUtVNkZpX29uamhLN0lja1h1dGpNR2I0T1VYTXJ2ckUzUHdieENXd2Y4M2JKUFRaUEhV?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "‘Dogecoin purer than Ethereum:’ Elon Musk, execs react to Top 10 move - AMBCrypto News",
        "content": "DOGE surges 4% with Elon Musk tweet amid memecoin frenzy.\n\nDeFi regulations could boost DOGE, paving the path to ETF eligibility.\n\nIn light of the recent crypto bloodbath stirring the crypto market, Dogecoin [DOGE] was amongst a few altcoins that spiked a little amidst the market crash.\n\nThe dog-themed cryptocurrency saw a slight uptick of over 4% in its price following a recent tweet from Elon Musk.\n\nThe memecoin craze\n\nRecently, Musk humorously compared mainstream media to characters from “Monty Python’s Life of Brian,” who have been struggling to report on Dogecoin’s rise amongst the top cryptocurrencies.\n\nThis playful portrayal highlighted the nature of Dogecoin’s success and the influence of social media culture on financial markets.\n\nAs the market turns on the path to recovery, social media is abuzz with memecoin mania, as highlighted by @ApeCryptos in his recent X post,\n\n“U Can’t Stop #Meme Coins.”\n\nShedding light on the regulatory actions against DeFi projects, Will Clemente, co-founder of Reflexivity Research in conversation with Laura Shin, host of “Unchained” podcast, saw this as a potential benefit for meme coins.\n\nHe said,\n\n“I think the one that has the highest likelihood could actually be Dogecoin because it’s a commodity right? I mean I would argue that it’s a much purer commodity profile than like Ethereum.”\n\nClemente believes that if DeFi projects face shutdowns or regulatory hurdles, investors might turn to meme coins as an alternative investment option.\n\nAdditionally, he outlines that the regulatory environment could pave the way for meme coins to gain traction and potentially become eligible for inclusion in cryptocurrency ETFs.\n\nWhat lies ahead for DOGE?\n\nNotably, Even though DOGE has seen losses recently, there are still many holders who refuse to waver.\n\nOn-chain data reveals a notable 18% decline in value over the past week, yet Dogecoin’s long-term investors stand strong while navigating the market with resilience.\n\nMoreover, insights from IntoTheBlock reveal that a staggering 81% of DOGE wallet addresses are still basking in profitability, even amid the recent downward spiral.\n\nEchoing similar sentiments, Crypto Daily Trade Signals, added,\n\n“#Dogecoin will do this soon $1 #Doge coming faster than you think!!”\n\nErgo, despite DOGE currently treading water in its consolidation phase, its potential to shift market sentiments from bearish to bullish remains positive."
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxObVV3czJsZWF4T3BYbWlZLXp0bEJpUXZFWEVMYTR1bUpSYXJQLXh2SmdGaml2VzJ6UXc2akdWUklPY2pMLTVsWFNGZnU1OHpkUWlPdUlESUJqNXRBOGlIdVBDdGthYTFMaXdqREFKVU8wYm0tRER6cmdTRGtacFJRU3EwMGNxZDFwMTdqdHBfRXdEY3UwSlHSAZsBQVVfeXFMTlByREF3cVBnd0Z6R2hGNWNxQ2NGdmhVRTBuc3J4WUZ0bFdJczBqYnh0ZV93NVBGampwOWJNTVloSW5vQ0R2ckpUUVpIZmZnX3RmUFc3cjFXSzdMUUxVdmRyd2Q2cmE3bHJFeENycUd4VEZLS1FLNjBBQ082ZE9CN21BWlo0U21RaGFTRU1mMGpLd2QwemV1SEEyUUU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "‘Ethereum L2s can steal user funds right now’ – Are the allegations true? - AMBCrypto News",
        "content": "Exec claims Ethereum L2s can “steal user funds.”\n\nIndustry figures propose multi-signatories to eliminate single points of failure.\n\nIn a surprising disclosure, it has been revealed that the safety of user funds in Ethereum [ETH] L2s is not guaranteed.\n\nAccording to founder and CIO of crypto-focused Cyber Capital, Justin Bons, L2s like Arbitrum [ARB], Optimism [OP], Base, Blast, Starknet [STRK], and ZkSync can all “steal user funds.”\n\n“Arbitrum, Optimism, Base, Blast, Starknet & ZkSync all have admin keys! All of the top L2s can steal all user funds right now.”\n\nThis is even more disturbing because, according to VanEck analysis, the space is projected to reach a $1T value by 2030.\n\nThe exec compared the current state of L2s to legacy banking and took a swipe at Ethereum for being a “lip service” to decentralization.\n\n“If this is considered safe, then we might as well go back to legacy banking. ETH gives decentralization lip service, but actions speak louder than word”\n\nReaction to safety concerns in Ethereum L2s\n\nSolana [SOL] co-founder Anatoly Yakovenko suggested a “multi-sig” shared sequencer as a solution to the “single admin key.” He stated,\n\n“Each one should volunteer a tribute to be a member of the multi-sig for the shared sequencer.”\n\nMulti-sig means having multiple signatories to increase decentralization, transparency, and eliminate the risk of a “single admin key.”\n\nRaj Gokal, another Solana co-founder, called for an expedited solution,\n\n“Hope this gets fixed soon…”\n\nHowever, the founder and CEO of Helius Labs, a Solana developer platform, vouched for Ethereum [ETH] L2s and preferred them over Binance [BNB], Cardano [ADA], or Ripple [XRP].\n\nHe reiterated,\n\n“Fine, I’ll say something positive about L2s: I’d be much happier if they were in the top 10 instead of Cardano, XRP, and BNB.”\n\nAsked whether Solana should consider some L2s as well, the Helius Labs’ exec quipped,\n\n“Could make sense in some cases.”\n\nA recent AMBcrypto analysis established increased transactions within L2s post-Dencun upgrade, which could tip ETH’s value.\n\nHowever, ETH faced key headwinds, including the SEC’s silence on spot ETFs and ongoing Middle East tensions. At the time of writing, it was barely holding above $3K."
    },
    {
        "id": 72,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxPRzZQOFRlS0N3MTFkYVBPNWt4YlF2Wi1GMktzYnFjQnpyOHlVbGg0SWdOUEE2WFU2LVlRVW4ySGt1WXFsb1RRRlk5WFdYeUFqTUhGMFBlbWNwZjJEOWctNnJxTEdUamZuTEFsTFEyaExIX1AzdUZST19RaVo0WkVfOXRtMFRTemJtWVdiM2hXa2lXMDBpOEpyTUxnMHpFLXo1YWdF0gGoAUFVX3lxTFAtam1Ick9VWEstS01UVVEyVzl1ejJNakYwOVAzRlVYRlgxQjNtRG9TT1k3UjNKNzhEbG1YZWdpT0wwNlFKRkxINGRXdmpBZk4yTm1DUF9GcFdmYTlWRGp1M3NqeGg3cW12TWtHSkQtSkl5ei1pRmhsbXBJNHpKNjI2SWV0UHhfM05kd21hX3hCZWJMbWh2ZXIxQjVJa2JCOVlhZTNsbXRoUA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Crypto Prices Today April 17: Bitcoin At $64K, Ethereum Above $3100, SOL & XRP Recover - CoinGape",
        "content": "The top crypto prices today registered a rebound as the Bitcoin (BTC) price traded below the $64,000 level. In addition, the Ethereum (ETH) price soared past the $3,100 mark. Meanwhile, other top altcoins, such as Cardano (ADA), Solana (SOL) and XRP rebounded notably.\n\nMajor Crypto Prices Today\n\nThe Bitcoin price was up by 2.99% reaching $64,209.56 at the time of writing on Wednesday, April 17. On the other hand, it’s trading volume slumped 8.94% to $40.08 billion in the last 24 hours. Whilst, the crypto held a market capitalization of $1.26 trillion.\n\nadvertisement\n\nIn the altcoin arena, the Ethereum price gained 3.04% to $3,115.86 at press time with a market valuation of $374.12 billion. Whilst, ETH saw its trading volume plummet by 21.31%, reaching $17.64 billion. Meanwhile, the Binance Coin (BNB) price was up by 1.51%, reaching $546.11. On the contrary, its 24-hour trade slipped 16.93% to $1.26 billion.\n\nThe Solana price sustained above the $140 mark today. The Solana price surged by 7.76%, settling at $142.59. In addition, SOL witnessed a 13.46% slump in trade volume to $4.94 billion in the last 24 hours. Whilst, the XRP price hit the $0.50 mark again. The XRP price recorded a gain of 3.69%, reaching $0.5001. On the other hand, XRP’s trading volume plummeted 29.14% to $1.71 billion.\n\nMeanwhile, the Cardano price was up by 2.25% to $0.4636 today. Whilst, ADA recorded a decline of 31.53% in its 24-hour trading volume, settling at $484.74 million. As the top crypto prices recovered from losses, the popular meme coins followed suit. The Dogecoin price rose 3.45% to $0.158 while its rival, Shiba Inu price rallied by 8.21% and traded at $0.00002283.\n\nAlso Read: Bitcoin Price Drops as Powell Signals Delay in Interest Rate Cuts\n\nTop Crypto Prices Today Are\n\nPepe Coin (PEPE)\n\nThe Pepe Coin (PEPE) crypto, a Solana meme coin, rebounded significantly today. At press time, the Pepe Coin price was up by 12.10% to $0.000005416 with a market valuation of $2.28 billion. In contrast, the 24-hour trade volume for PEPE slumped by 17.97% to $732.55 million.\n\nCelestia Soars 11%\n\nCelestia (TIA), a trending crypto, registered an phenomenal rally of nearly 11% and ranked the top crypto gainer today. The Celestia price was up by 10.98% to $10.99 at the time of reporting. Moreover, its trade volume spiked 21.22% and stood at $292.78 million. Furthermore, the TIA crypto attained a high of $11.56 amid the rally today.\n\nAlso Read: Solana Mining Protocol Ore Pauses Operations Due To Congestion\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 74,
        "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTE81SzZGMFY5V0ROOVA2OFNwZnJXamJHSEllUlJnbHo5Y3J2WWE2dmh2QV9MdWdfUWttQTQ4NGg3ME5GVzVNYXcyR3ZyWVdqYnhRbWNvaDZnQW10V2tUbG95aThQbUVqUF9tU1HSAW9BVV95cUxOWWJTZGVGa2JBaGZncEhKVmcxS2J1d3BlaEREdDBMU0tqUmEzXzNmaE1wT1NPYlhWMExYT0hhQ1NPWGsyX3JnR1VlbVQzM2NNbWw5clM5UmhSdlFLRWxLSlA1eGVkN2pLX1F3dTVqTW8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Apr 2024 07:00:00 GMT",
        "title": "Is Ethereum behind Render’s 18% rally? - AMBCrypto News",
        "content": "The token’s value increased, and so did ETH.\n\nRNDR’s popularity grew among traders, suggesting a significant price hike in the long term.\n\nRender [RNDR], the native token of the distributed GPU network built on Ethereum [ETH] jumped by an incredible 18.85% in the last 24 hours.\n\nThis performance made RNDR one of the top assets with the best recovery rate after the broader market experienced a drawdown. Interestingly, the bounce happened as ETH itself was able to reclaim $3,000 and rise above it.\n\nHowever, there were other reasons the price of RNDR increased. The first thing AMBCrypto noticed was the increase in social dominance.\n\nDid ETH “Render” help?\n\nAnalyzing data from LunarCrush, we observed that Render’s social dominance increased by a mind-blowing 116% within the same timeframe the value skyrocketed.\n\nThe increase in social dominance implied that the project’s popularity among traders surged. From our findings, traders were attracted to RNDR because of its fundamentals.\n\nAnyone conversant with the market would have observed that many market participants are bullish on projects with the DePIN narrative. DePIN stands for Decentralized Physical Infrastructure Networks.\n\nIn the crypto space, projects built around this narrative like Render, use tokens to incentivize holders who utilize the protocol.\n\nFurthermore, AMBCrypto observed another proof of the interest in RNDR. This time, it was the trading volume. According to Santiment, Render’s trading volume rose to 556.65 million on the 14th of April.\n\nThis increase represented a 37.72% jump from the value on the 13th. However, the volume decreased slightly at press time, indicating that RNDR might not have a solid backing to continue its upswing.\n\nSentiment stays the same\n\nDespite RNDR’s potential, it seemed traders were not yet convinced about its short-term performance. This was evident from the Weighted Sentiment analyzed on-chain.\n\nThe metric tracks the average positive or negative comment about a project. If the reading is positive, it means most market participants have a bullish view. On the other hand, a negative reading suggests a bearish perception.\n\nAt press time, Render’s Weighted Sentiment was -0.45. With this position, demand for RNDR might decrease in the short term. Should this be the case, the price of the token might fall below $9.\n\nBut that does invalidate the long-term optimism around the project. AMBCrypto concluded this after checking the amount of holders.\n\nOn the 25th of March, the total amount of RNDR holders was less than 80,000. However, that figure had increased to 85,600 at press time.\n\nRealistic or not, here’s RNDR’s market cap in ETH terms\n\nAn increase in the number of holders was a sign of traction on the network and adoption of the token. If this continues, RNDR’s price could head to new highs.\n\nHowever, it is important to note that there might be corrections in the process. But as long as the DePIN narrative remains relevant in the market, the token might be destined for a higher value."
    },
    {
        "id": 77,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxOUVFwbG81Rkd0c0dIaVRDRFZiVVpySGxFb3JrOHI1Q2FOb1dGRDI0NG5OanBVYVI3cnYyTE9ObUxsV0pVTjNXbFBNRWFpY3Q5U1dDeW9YVVdGM0JnQkg3eUVCNmxnX3ZhU3hwaFFSMjRnSzE1RXFNT1pUMGxRbi1Rdk4xRTFVUExwMGdYZGI5UWJUaUpmQTc4R3owVlhOd3FsNURvSUpNSTRwQdIBrwFBVV95cUxNck5PdHVZazYzbWtIeWh4M0Jpc2NpSV9nNFZhLVBZWUhXREZaM3ltTVMzRFBGNXNlUU95bHBDWUZELU4wYllpMEFQcTQtRE51eU9OdDFBMlpRTVRFbGw0ZTdRTkJVQ0VYTWR6d3JCTnh1REllWVpRd2U1bVJhaS1JQ2IwRDdrS2Z1TWNHVnpCUmVidk9qaFc4Y3RVSEhhZUhzOXhvZWE2Tnh2SnFNX0E4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Bitcoin and Ethereum in Eye of Storm? - Action Forex",
        "content": "Market picture\n\nThe crypto market avoided sharp moves on Tuesday, showing low volatility over the 24 hours and remaining near $2.3 trillion. The Crypto Fear and Greed Index added 2 points to 67 (greed) by Wednesday.\n\nBitcoin’s share of the entire crypto market capitalisation exceeded 54%, maintaining its upward trend since December 2022. This is the clear impact of the Bitcoin-ETF, but we also note the diminishing enthusiasm for altcoins.\n\nThe technical picture for Bitcoin is rather worrying, as we saw no rebound after the price drop on Friday and Saturday. On the contrary, the market seems to be getting used to current prices in anticipation of a halving.\n\nSimilarly, Ethereum sold off powerfully at the end of last week from the 50-day MA. Now, the second largest cryptocurrency holds near the psychologically significant $3000 level.\n\nThe pattern of cryptocurrency behaviour this week indicates that we are more likely to be in the eye of the storm, i.e. a temporary lull between violent gusts of wind. If this prediction is correct, Bitcoin could fall towards $52-55K, and Ethereum – to $2500.\n\nNews background\n\nThe crypto market is “halfway to bitcoin euphoria,” according to CryptoQuant. New bitcoin miners, who have held their assets for less than 155 days, hold up to 9% of the circulating BTC volume and continue to build up inventories in anticipation of rising prices. The imbalance between BTC supply and demand will increase over the next six months, potentially driving prices higher.\n\nHong Kong-listed cryptocurrency ETFs will be “lucky” if they manage to raise $500 million in aggregate, Bloomberg said. The agency called Matrixport’s projected $25bn “insane”.\n\nAccording to CoinGecko, there are more than 2.52 million crypto assets in existence today, which is 5.7 times the number at the end of 2021. The pace of new coins accelerated in 2024 when 0.54 million tokens have already been created, which means an average of 5,300 pieces launched per day.\n\nBlockchain team The Open Network (TON) has announced the launch of the Memelandia hub for meme coin developers. The project is part of The Open League’s programme, which was created to support new meme coins and raise awareness of them."
    },
    {
        "id": 78,
        "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxONkNfVkVhQTQ3TEtYVUpOT1VDNy1Pdy1QVjExWU1NRm1ZbUlPdTVtTFBKeXRGOFlTem01Zm85VktkOUxTY2dUT2NNSWVZaENCUDZ5ckN4S3l0dXNyVUJhLXE5MVJYQ1lQTW1WU19NWWNGcTNkY0dCZ2JtME9MUkR4NGdpN2VhWVlNcXNPcDdjMlFZUmtyUzBnbmNUTDZpMDBJeTQwazExTTVBZlVpQjFqb2kwZklhNlpB0gHGAUFVX3lxTE5GcWZaQVJSYmhNUVVtZGxRQVptMkJQSUw3bTk2T0VUSlBOUmg0RTF1Z2d3ZkFoNGJqVDhuY2R1bzJucnpVLWF4MUNEX0I3WkdGRmZmcjVoc005MlY4ZWNjRnBUX0RNakljY3BlSVJ0ZXZ1OGIyUDFxMkNYdXJ0RFRnN0dmUmwwQkN0UDRRR3FkTzdXLWlwWlRwaXBQejBscFc3RktzT3kydXhIeWh6TW04ZkRaVzdFT1o1LUJyVWhMbU1sb3pCQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Apr 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum And Solana Plunge As CORE Pumps 35% - Analytics Insight",
        "content": "Join our WhatsApp Channel to get the latest news, exclusives and videos on WhatsApp\n\n_____________\n\nDisclaimer: Analytics Insight does not provide financial advice or guidance. Also note that the cryptocurrencies mentioned/listed on the website could potentially be scams, i.e. designed to induce you to invest financial resources that may be lost forever and not be recoverable once investments are made. You are responsible for conducting your own research (DYOR) before making any investments. Read more here."
    },
    {
        "id": 80,
        "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxNTmxfemhKd1UtR0luZkxIRm14OWs4Z0R6eTlhQ1AyZXRoTS1KQWVWRGR2eWt1d3N6andVUUFJRklBazZMV2Jpdy10dkNsUW9pZTloVVlPNDdRTXRNRzc2eVM4Z21MVXZOd3hQVUs2VGFBU3pBMFZTQ2hwMThmWTllT2o0R09JbGM4R0ZMTTlYdW1qcld4MEktS0FkVS1CWF9jOE9RUlVWbnZ1eWpPei1tSk9CS3JZT3kxQ3c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "ETHEREUM PRICE ANALYSIS & PREDICTION (April 17) – ETH Continues Selling, Negotiating $3k For Next Big Move - NullTX",
        "content": "Ethereum resumed selling pressure this week after experiencing a little retracement last. While on the verge of breaking down a key price level, it has posted roughly 7% loss in the past week.\n\nRejecting $4,100 and $3,700 in the past weeks, Ethereum has found it difficult to push above the $3,300 level in the recent bounce as it lost momentum again due to the latest decline.\n\nTaking that bounce as a retracement of last week’s drop, the price is now on the verge of dropping off the important $3,000 level. A successful bridge from there could drive the price back to $2,852 – the current holding support.\n\nTechnically, that holding support recently acted as a sub-level to the crucial $2700 level that flipped as resistance during February’s surge. Once the crucial level is retested (probably as this week’s low) in this leg down, we can expect a quick price recovery in no time.\n\nHowever, it is important to note that ETH may extend bearishness below this key retest level if the weekly supply continues to outweigh demand. The $2,500 – $2,400 zone would be an oversold area to watch for a major buyback.\n\nAs of now, there are no signs of the bulls. A reversal pattern above the mentioned holding support could bring them back into the market. But as it stands, the bears are taking charge.\n\nETH’s Key Level To Watch\n\nWhile the bulls are in disbelief of the recent price movement, they may suffer more losses if the price slides through the vital $3,000 support level. Breaking the $2,850 support will activate more drops.\n\nThe $3,202 level now stands as immediate resistance. If the price recovers above $3,300, the resistance levels to watch above it are $3,450 and $3,723.\n\nKey Resistance Levels: $3,202, $3,450, $3,723\n\nKey Support Levels: $3,000, $2,852, $2,712\n\nSpot Price: $3,042\n\nTrend: Bearish\n\nVolatility: High\n\nDisclosure: This is not trading or investment advice. Always do your research before buying any cryptocurrency or investing in any services.\n\nFollow us on Twitter @nulltxnews to stay updated with the latest Crypto, NFT, AI, Cybersecurity, Distributed Computing, and Metaverse news !\n\nImage Source: fellowneko/ 123RF // Image Effects by Colorcinch"
    },
    {
        "id": 81,
        "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxOV2FjVlo2aG5KekJQdHd3eXhqT0tDSW9kc2kzVDR3eEpkVGFVZkswSWRONW5oVkFDWEhmdFg5RkFsTzdmMWJlYUVKSEpwTFRCZXJkZTVWUzBxOGJHVTROTzZjVjdUUkJJam02V0FtQkZISTFxZW5TU01YTWNHeTBLTUpvX3RNT2NVNEttTm9TUGdFUXdGclFJSVlKNF84TjlQZDZNRWp1UmNkRVVQMjB6dTBSTXBoLU1meU8ybTNGQlFZYUlaOGg4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Price Prediction : Analyst Lark Davis Predicts ETH Price Will Hit $15K This Bull Run, Here's Why - Coinpedia Fintech News",
        "content": "Nidhi is a Certified Digital Marketing Executive and Passionate crypto Journalist covering the world of alternative currencies. She shares the latest and trending news on Cryptocurrency and Blockchain.\n\nEthereum Price Prediction : Analyst Lark Davis Predicts ETH Price Will Hit $15K This Bull Run, Here’s Why\n\ncrypto analyst Lark Davis forecasted Ethereum price soaring to an astounding $15,000 this crypto cycle.\n\nHis prediction is backed by compelling catalysts that could propel the leading smart contract platform to new heights.\n\nCoinbase Base Chain Onboarding Surge\n\nThe first reason Davis highlights is that Coinbase’s Base Chain as a pivotal catalyst driving Ethereum’s price surge. With Coinbase’s imminent launch of Base Chain and its smart wallet, the platform is set to onboard its vast user base of 120 million customers, creating an unprecedented surge in Ethereum demand.\n\nAs users flock to Base Chain, Ethereum stands to benefit immensely, with every transaction requiring ETH as fuel, potentially leading to substantial price appreciation.\n\nLayer Two Narrative and Ethereum’s Dominance\n\nBeyond the Coinbase hype, Ethereum’s position as a leader in layer two scaling solutions further strengthens its bullish case. Davis emphasizes Ethereum’s integral role in the broader layer two narrative, with projects like Arbitrum and ZK Sync gaining traction.\n\nAs users embrace layer two solutions for scalability and cost-effectiveness, Ethereum’s dominance in the smart contract space solidifies, driving investor confidence and adoption.\n\nEthereum Staking and Wealth Creation\n\nAnother key catalyst highlighted by Davis is Ethereum’s staking ecosystem, which promises substantial returns and wealth creation opportunities. With the launch of the Ethereum 2.0 beacon chain and the upcoming integration of staking protocols like Igen, Ethereum holders are incentivized to lock up their ETH, further reducing circulating supply and driving up prices.\n\nAdditionally, Ethereum’s thriving DeFi ecosystem and burgeoning NFT market contribute to the platform’s overall economic activity, reinforcing its status as a blue-chip asset in the crypto space.\n\nAlso Check Out : Crypto Expert Lark Davis Reveals 9 Altcoins Set for 9x Growth in 2024\n\nThe ETF Potential\n\nDavis underscores the significance of an Ethereum ETF approval, despite the expected denial of BlackRock’s application in May. While initial rejections may dampen short-term sentiment, Davis remains bullish on the eventual approval of an Ethereum ETF, citing BlackRock’s track record and legal precedents.\n\nOnce approved, an Ethereum ETF could unleash a flood of institutional capital into the market, driving prices to unprecedented levels.\n\nIn Conclusion\n\nWith a confluence of bullish catalysts on the horizon, Ethereum’s journey to $15,000 appears increasingly plausible. Davis’s forecast sheds light on the fundamental drivers behind Ethereum’s potential surge, offering investors valuable insights into the platform’s long-term growth prospects."
    },
    {
        "id": 83,
        "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTE9TTFdSTkg1cnh2NGdWYkR4M2hLR29GREZjeTJKWEF5OXU0cGpNaG5lUTlVRWdDdDJGZFIwczB3OUZJTU5mWEF4TnpJOWhhUEt4bXctcExHZkx6MEJib3U2aEhnZS1XVFM1ajdkMzFiQ2xhSmM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Apr 2024 07:00:00 GMT",
        "title": "Bitcoin and Ethereum in Trouble: What’s Going On? - Coinpedia Fintech News",
        "content": "Elena is an expert in technical analysis and risk management in cryptocurrency market. She has 10+year experience in writing - accordingly she is avid journalists with a passion towards researching new insights coming into crypto erena.\n\nBitcoin and Ethereum in Trouble: What’s Going On?\n\nStory Highlights Major cryptocurrencies like Bitcoin and Ethereum are down significantly, likely due to recent geopolitical tensions.\n\nDespite typical pre-halving surges, the market is tumbling instead, causing investor panic and selloffs.\n\nWhile investors flee, traders are jumping in, but this doesn't indicate overall bullish sentiment.\n\nThe crypto world is once again engulfed in a downward spiral, with major players like Bitcoin and Ethereum showing significant losses. As of now, Bitcoin has dropped by nearly 5% in the past day, while Ethereum’s decrease exceeds 5%. Even BNB and Solana haven’t escaped unscathed, experiencing declines of 7% and 10% respectively.\n\nThe Pre-Halving Frenzy\n\nWith investors scratching their heads over the market’s turmoil, it’s essential to delve into the factors driving this dramatic downturn.\n\nThe much-anticipated Bitcoin halving is just around the corner, set to happen in about four days. Historically, halving events have been met with excitement, leading to significant price surges before, during, and after. At the start of 2024, Bitcoin broke not one but two all-time highs, sparking optimistic predictions from industry experts and outsiders alike. FOMO was rampant, driving market activity into a frenzy. It seemed like smooth sailing for cryptocurrencies.\n\nBut It Was a Bust!\n\nThe party didn’t last long. Corrections, a typical occurrence before halving events, soon kicked in. Experts reassured investors, but over the weekend, the market witnessed a plunge reminiscent of the early-year volatility.\n\nGlobal Turmoil Meets Crypto Chaos\n\nThe brewing geopolitical tensions between Iran and Israel spilled over into the crypto world, as cryptocurrencies became the go-to assets during the crisis. Investors panicked and swiftly sold off their holdings, triggering a market-wide downturn.\n\nThis sparked a flurry of sell-offs, with hundreds of millions of dollars being dumped in just two days. Interestingly, this chaos led to a surge in trading activity on major exchanges like Coinbase, Binance, and Bybit.\n\nAn Opportunity for Investors?\n\nWhile investors fled, savvy traders seized the moment. It’s a common trend; when markets go haywire, opportunities for traders abound. However, it’s important to note that this doesn’t necessarily signal bullish sentiment. Recent data from Coinglass highlights a significant increase in Bitcoin derivatives trading, with volumes soaring by over 10% in a single day, reaching a staggering $99 billion. The prevailing long/short ratio suggests a predominantly bearish sentiment among traders.\n\nDespite the turbulence, experts remain optimistic, maintaining their predictions of Bitcoin soaring to $100k, Ethereum reaching $10k, and BNB hitting $5k."
    },
    {
        "id": 84,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxPdzBkcVdXRS1hLUdheHlWVFhnNHFPYm1UUmxQb3J5UV9EQldzWlJnb3gxbHo1QW14bzZXSGlmV0RLSUc4eU1NVDk4MDZVZVlmMVY4VWRhME1yQUVnZHVwTVd3c0FtWXBzeExlaVhMbm9OWXRPQkFfY2JoVDZSNl9kckNQWTkxRzVLZkVRem85NVhYZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Apr 2024 07:00:00 GMT",
        "title": "Meet World Chain, Worldcoin’s (WLD) New Layer-2 Ethereum Blockchain - Coinfomania",
        "content": "Worldcoin, a pioneering biometric digital identity project utilizing iris scanning, has announced a strategic partnership with Alchemy, a prominent Web3 development platform.\n\nThis collaboration aims to fortify the infrastructure of the World Chain ecosystem, facilitating a more robust framework for developers. The announcement was made on June 26, marking a significant development in the integration of biometric technology within blockchain applications.\n\nThe partnership provides World Chain developers immediate access to Alchemy’s extensive suite of Web3 development tools.\n\nThis suite includes core and data APIs, indexing solutions, and a sophisticated account abstraction infrastructure, which enhances the safety and security of self-custodial wallets.\n\nAlchemy’s integration will also extend to incorporating World ID, Worldcoin’s digital ID technology, offering millions of developers worldwide an opportunity to engage with this cutting-edge technology.\n\nWorld Chain was initially introduced in April 2024 as a part of a larger initiative by Tools for Humanity, spearheaded by OpenAI CEO Sam Altman.\n\nSource: Worldcoin\n\nAlex Blania, who is centrally involved in the development and promotion of the Worldcoin project, plays a crucial role in the ongoing development of this blockchain network.\n\nDesigned explicitly with human-centric principles, World Chain intends to operate alongside other major blockchain ecosystems such as Optimism, Coinbase, and the broader Ethereum network, collectively known as the Superchain.\n\nThis blockchain is particularly tailored to prioritize human interactions over automated processes. By leveraging verified World IDs, World Chain offers holders priority block space and a free gas allowance for regular transactions, thereby reducing the prevalence of bots.\n\nThis design not only secures the network against automated interferences but also ensures that developers have clearer access to real users, enhancing the overall user experience and reliability of blockchain applications.\n\nStrategic Partnership Bolsters World Chain’s Ambitions\n\nSteven Smith, the head of protocol at Tools for Humanity, emphasized the importance of this partnership with Alchemy.\n\nHe noted that Alchemy has demonstrated proven expertise in ensuring guaranteed uptime and reliability for major enterprises, a crucial element as World Chain aims to establish itself as the first human-centered blockchain and the largest entry point for human participation in the blockchain space.\n\nJust in: Worldcoin is partnering with @AlchemyPlatform to bring World Chain to life ⚪️ pic.twitter.com/ECKikbkXby — Worldcoin (@worldcoin) June 26, 2024\n\nThe partnership is expected to make significant strides toward achieving Tools for Humanity’s goal of bringing a billion users into the blockchain ecosystem.\n\nIt aims to increase opportunities for developers to create applications that are not only effective but also intuitively align with human needs and experiences in digital spaces.\n\nWorldcoin Expands Operations Globally\n\nIn addition to its technological strides, Worldcoin is expanding its operational footprint globally. As part of its expansion efforts, Worldcoin has initiated its European operations by launching World ID orb verifications in six locations across two European cities.\n\nThis move marks the project’s initial steps into Europe following successful implementations in various Latin American countries and represents a critical phase in Worldcoin’s strategy to broaden its global influence.\n\nDespite these positive strides, Worldcoin has experienced a minor setback in market dynamics. Over the past 24 hours, there has been a slight decline in open interest by 0.85%, bringing its current valuation to $107.9 million.\n\nSource: Worldcoin\n\nFurthermore, the price of Worldcoin’s token (WLD) has seen a decrease of 1.22% during the same period, with its price currently standing at $2.83 and a trading volume of $193.8 million.\n\nThis partnership between Worldcoin and Alchemy represents a transformative step in making blockchain technology more accessible and tailored to human needs, potentially leading to widespread adoption and innovation in the blockchain sector.\n\nAs World Chain continues to develop, it holds the promise of becoming a pivotal platform in the evolution of blockchain technology, focused on enhancing user engagement and security."
    }
]