[
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPdHQ3UWY4VTUtMnR1eUhhcjVKLWdWU2YtMWo4WmJOd1VXQzlXRE1vcXVHZTBMZmlSWUlIQXoweV9xaTh4Z09EbEVkV2ZMUFNlak9CTnI5RUZBeFRJb3A4WlBMWFo3U0NDQTV3QVVSUXVEUzdGZHFfU0otNXpsTTJmZkpjUGNobHdrZjNtaGRGZGt4bTA5dURvNdIBngFBVV95cUxNTlk2NVZfVTlNb0RmOExWUjRwMFpjQXl1dHQ0andwUWsyZExlcWtRLWtzaTBoZEtpZklFajZ3UWVZMmxaR0VEZDR0NDh2T21Zb1BSVFNBWWMwbGgxOWpFTDRLWWU0a3pmRmdEdHFjVzNVOC1tdENVSUxmRHVMa0NJR2R4UXlSZzJ5dVAtdWR4UFp0M2o5TDdUUlBPcGZPUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Jun 2024 07:00:00 GMT",
        "title": "What Historical Trends Hint for Ethereum Price Behavior in June? - CoinGape",
        "content": "Ethereum Price: Over the past two weeks, the second-largest cryptocurrency Ethereum witnessed shrunk volatility carrying a consolidation trend above $3600. The daily chart projecting short body candles and rejection on both sides indicates a lack of direction among market participants. Will the BTC price drop below $70000 push a prolonged correction in the altcoin market?\n\nAlso Read: Crypto Prices Today June 8: Bitcoin & ETH Take Bearish Turn, Wormhole & INJ Pump\n\nadvertisement\n\nEthereum Price Defend Key Support Amid Broader Uncertainty\n\nDuring mid-May, the Ethereum price rebounded sharply from the $2860 support indicating the investor continued to accumulate this asset at market dips. The renewed buying force uplifted the ETH value by 39% to reach a 10-week high of $3975.\n\nHowever, with broader market uncertainty the recovery momentum in Ether stalled resulting in a sideways action above $3630. This support coinciding closely with the 20-day EMA slope and 23.6% Fibonacci retracement level creates a high area of interest for buyers.\n\nThe notable rejection of candle tails at this support indicates the buyers are defending this support. For risk-averse traders, a breakout above the overhead resistance of $4090 will give a better confirmation of a prolonged rally.\n\nWith sustained buying, the Ethereum price prediction hints at a rally to challenge the ATH (All-time-high) resistance of $4880.\n\nOn a contrary note, a breakdown below $3630 will accelerate the selling pressure and may extend the current correction for a week or month.\n\nAlso Read: Crypto Market Selloff: Here’s Why Bitcoin, ETH, SOL, XRP, DOGE Prices Slips Today\n\nHistorical Trends Show June’s Mixed Fortunes for Ethereum\n\nEthereum’s price performance in June has shown significant volatility over the past years, with both notable gains and sharp declines. The largest drop occurred in 2022 with a steep decline of -44.79%, while the highest gain was in 2017 at +26.19%.\n\nOn average, June tends to yield negative returns, with an average of -6.76% and a median of -2.53%. This negative bias suggests that June is often a challenging month for Ethereum. However, the data also hints at the potential for sharp reversals, as seen in the positive return of +8.86% in 2019 following a significant drop of -21.34% in 2018.\n\nThese variations are likely influenced by broader market conditions, including macroeconomic factors and regulatory news. Given this historical performance, investors might approach June with caution.\n\nHowever, with steady development for the launch of Spot Ethereum ETFs, the market is better leaning in buyers’ favor.\n\nTechnical Indicator\n\nExponential Moving Average: The Ethereum price trading above the daily EMAs (20, 50, 100, and 200) indicates the path to least resistance is upward.\n\nAverage Directional Index: The downtick in ADX slope at 33% indicates the current consolidation could assist buyers in recuperating exhausted bullish momentum.\n\nRelated Articles\n\nSahil Mahadik Sahil is a dedicated full-time trader with over three years of experience in the financial markets. Armed with a strong grasp of technical analysis, he keeps a vigilant eye on the daily price movements of top assets and indices. Drawn by his fascination with financial instruments, Sahil enthusiastically embraced the emerging realm of cryptocurrency, where he continues to explore opportunities driven by his passion for trading\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE5rM2lpQUl6dWtITFAzTjM3aDlPZWZIem1UMnNhbFFMMy1Ub2FwMkx4ZEZZaUhuV0M3dUtfdjkyWVhOV2oxai1hejBidTNaSWdvbHY1RmlTdXBHMDc4SUp3LVpzYzhEdkFOYU9UeWFsMWE5MTF3T3JfTFhGUVk2d9IBhgFBVV95cUxQa19lbzBIMkNCcVB5YlRtVHMycXpycnBQVW5VYzExa0NKcG5yZDluTUkwU08xSHE1d3VSeC1Mdko1T1NWOVc5QzVvbDA3cEMxbFphazcxZnJORnpCNHZPbGRmWEYxZlNlV1FQRW5jTnhNazdCWk8yMVJKWkdPRlNkRHQ4Ui1qUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Jun 2024 07:00:00 GMT",
        "title": "Why Ethereum Layer-2 Network Taiko Is Spending $100K Daily on Blobs - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAn Ethereum layer-2 network named Taiko is dominating the market for so-called blobs, or dedicated data storage for Ethereum scalers—but those endeavors are resulting in tens of thousands of dollars worth of costs for the little-known scaling solution each and every day, even topping the $100,000 mark multiple times this week.\n\nThe Taiko protocol, which went live in late May, seeks to offer users cheaper and faster transactions than on Ethereum's mainnet, while borrowing elements of the network's security. Since going live, Taiko has spent a whopping $900,000 on blobs in less than two weeks to funnel users’ transactions over to Ethereum’s network.\n\nMeanwhile, Taiko’s competitors, such as the Optimism network, rarely spend more than $1,000 per day on Blob-related fees. Introduced in March as part of an Ethereum upgrade, blobs were billed as a new resource for layer-2 scaling networks to post Ethereum transactions more cheaply.\n\nThe protocol’s maker Taiko Labs announced in March that it had raised $15 million in a Series A funding round. Leveraging “zero-knowledge” cryptography in its design, Taiko is striving to differentiate its scaling design in an increasingly competitive field that includes dozens of different scaling networks.\n\nAD\n\nAD\n\n“Taiko just launched its mainnet, and there’s a lot to be figured out before it becomes stable,” Taiko Labs CEO Daniel Wang told Decrypt in a written statement. “We knew that we will use more blobs than other layer-2s. This is a design decision, not a bug.”\n\nLayer-2 networks often work by bundling batches of transactions together and processing them on a separate chain before posting receipts back to Ethereum. However, Taiko’s design differs from that formula, where lots of transactions are rolled up into batches elsewhere.\n\nInstead, the process of ordering transactions, known as sequencing, takes place on Ethereum itself. In a blog post, Taiko Labs said this process, dubbed “base sequencing,” is more decentralized than that of other layer-2s that rely on centralized sequencers—which are controlled by a network’s development team and collect a small portion of users’ fees.\n\n“That sounds expensive,” Alexei Zamyatin, the co-founder of Bitcoin layer-2 network BOB, told Decrypt in an interview. “It makes it more secure, but not as secure as [Ethereum], and you’re also much more expensive than most layer-2s.”\n\nAD\n\nAD\n\nA game of tradeoffs\n\nStill, Wang stated that the costs associated with Taiko’s functionality could easily reach the point of break-even if “Taiko is fully utilized by users,” providing a sustainable amount of gas fees.\n\nWang added that Taiko is fully aware of the pros and cons associated with its sequencing method, and he hopes that Ethereum researchers will study Taiko’s on-chain data to explore improvements that could allow Ethereum to better support similar scaling networks.\n\nSome Ethereum researchers, including Justin Drake, believe that Taiko’s team is trailblazing a new form of decentralized sequencing that could solve key hurdles in Ethereum’s ecosystem.\n\n“It is making a leap forward in the decentralization, credible neutrality, and composability of rollups,” he told Decrypt in a written statement.\n\nIf more layer-2 networks shifted the sequencing of their transactions to Ethereum itself, then fragmentation issues holding the entire space back could be solved, he stated. As of now, liquidity and assets are largely spread out across different layer-2s, effectively siloing users and applications within a given scaling solution while all being tied to Ethereum.\n\nWhen it comes to layer-2 networks on Ethereum, the introduction of blobs represented a significant shift in how those protocols interact with the underlying blockchain. Before blobs were available as a separate fee market, layer-2s could only post bundled transactions in the form of Ethereum “calldata,” a space for data to be contained within transactions.\n\nInstead of trafficking users’ transactions in bulk alongside regular Ethereum activity, blobs serve almost as a dedicated lane on a highway, where less congestion can reduce costs. However, the best way to package those transactions before they’re shipped is still up for debate.\n\nBlobs blobs blobs\n\nIn some cases, centralized sequencers can be leveraged to grind a network to a halt, puncturing the veil of permissionless activity that is synonymous with crypto. Sometimes, centralized sequencers can be abused to delay transactions too. However, Taiko’s commitment to decentralization may not be the most efficient, according to one of its community advocates.\n\nAD\n\nAD\n\n“Sadly, it’s kind of expensive,” the pseudonymous crypto researcher arixon.eth said on Twitter (aka X). “Because of based sequencing, we need to post a blob every 12 [seconds], and if there aren't enough [transactions], then we just won't fill the blobs.”\n\nBecause of based sequencing, we need to post a blob every 12s and if there aren't enough txs then we just won't fill the blobs Sadly it's kinda expensive, so we really need based preconfs — arixon.eth (@arixoneth) June 1, 2024\n\nWang of Taiko Labs said changing this pace could be a potential solution enacted soon, stating that Taiko’s community is “considering lowering the block proposing frequency a bit.”\n\nThe constant stream of blobs, regardless of how full they are, has made Taiko a top user of them. On Sunday, for example, Taiko posted 25% of all blobs on Ethereum, according to a popular Dune dashboard. That day, Taiko spent nearly $63,000 on blob-related fees.\n\nOn Thursday, Taiko paid $123,000 in fees for blobs—representing 73% of all costs paid for them across layer-2s—which was its second straight day with a six-figure fee tally. And while most layer-2s pass cost savings onto their users through lower fees, the premium Taiko is paying for decentralization, as of now, isn’t a bill that users need to foot.\n\n“For now, it's partially subsidized by the team,” arixon.eth said, adding that the process could be modified in the future so that “blocks are missed until there are enough [transactions] in the mempool for a proposer to push a block to [Ethereum] profitably.”\n\nAmid the network’s first airdrop on Wednesday of TAIKO tokens, the network’s native cryptocurrency, the layer-2 averaged around 6.42 transactions per second, according to L2BEAT. Meanwhile, Ethereum registered around 13.6 transactions per second itself.\n\nSo far, the performance of Taiko’s token has been turbulent. After crashing 40% an hour after it launched, to $2.27 from $3.80, the token’s price had recovered to $2.45, as of this writing, showing a nearly 3% decrease over the past day, according to CoinGecko.\n\nAD\n\nAD\n\nEdited by Andrew Hayward"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxPT1BQdFlsYkwtZVlTT2pMdHJTV3Z0WnZGNlJNZ1EwQTlWa2VEQURWYzFoQlZIWVZZcHZHa0U1b0JDTXVOR2E3cHc0a0pzSzVkU2JaaVV5X2luTU1JLWNhVFEweENNWjhMNzJFQXdJaUZlNjYwLTBLSG56TDFDLW9BUXI5cVBQajJYV2RKcTFVcjNUZ0VBdXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jun 2024 07:00:00 GMT",
        "title": "Shanghai Upgrade: How High Can Ethereum (ETH) Go? - DisruptionBanking",
        "content": "Ethereum, a leading blockchain platform for decentralized applications (dApps) and the giant behind the world’s second-largest cryptocurrency by market cap has always been a frontrunner in innovation from the get-go.\n\nThe Shanghai upgrade, also known as “Shapella”— a coinage of Shanghai and Capella, Ethereum’s execution and consensus layers, respectively—implemented on April 12, 2023, marked a major leap forward by finalizing Ethereum’s full transition to a more energy-efficient proof-of-stake (PoS) network. But this is also changing the staking and liquidity of ether (ETH) as we know it.\n\nETH’s adoption growth was mainly driven by the Shanghai upgrade, which allows withdrawals of staked $ETH, and the popularity of liquid staking. pic.twitter.com/iepA0hCHh3 — Crypto.com (@cryptocom) January 26, 2024\n\nThe Technical Side of the Shanghai Upgrade\n\nThe Shanghai upgrade is a “hard fork” that introduced several Ethereum Improvement Proposals (EIPs), with EIP-4895 being the most notable. This proposal introduces a new system-level operation to streamline the process for validators to withdraw their staked ether (ETH), allowing for more freedom and flexibility. Gone are the days of the manual process, as EIP-4895 automatically funnels withdrawals from the Beacon Chain to the Ethereum Virtual Machine (EVM) once they’re eligible.\n\nValidators have staked about 16 million ETH to secure the network. Since September 2022, when Merge shifted Ethereum’s consensus mechanism from proof-of-work to proof-of-stake, validators have played a critical role. Under the new rule, by staking 32 ETH, validators can participate in block validation, with each staked ETH increasing the chance of earning block rewards. However, the Merge required validators to lock up their ETH and rewards until a future update.\n\nEIP-4895 simplifies this process by automatically checking accounts for eligible excess balances every few days instead of requiring manual requests.\n\nIn a nutshell, validators, as key players in Ethereum’s PoS mechanism, stake ETH to secure the network and validate transactions. Each staked ETH acts like a golden ticket, which enhances the odds of being chosen to propose the next block and earn rewards. Before the Shanghai upgrade, staked ETH and rewards were locked. Still, the upgrade now allows validators to withdraw their assets, which has considerable implications for Ethereum’s liquidity and the staking dynamics.\n\nImpact on Staking and Liquidity\n\nThe Shanghai upgrade fundamentally changed the game for stakers.\n\nThe #Shanghai upgrade allows validators to withdraw staked $ETH locked in the Beacon chain\n\n\n\nAfter one year from that, explore the $ETH supply among the top LSD entities since the Shanghai upgrade\n\n\n\nNotable top 3\n\nLido: + 3.47M\n\nBinance: + 896K\n\nRocketPool: + 291K $LDO $RPL $ANKR… pic.twitter.com/5dY26Ob4Tw — Layer2Gather (@layer2gather) April 12, 2024\n\nWith staked ETH now unlocked, validators can freely withdraw their holdings or stakes and claim rewards freely. This newfound liquidity is a win-win for both investors seeking staking rewards and the Ethereum network itself, which benefits from increased security through staking.\n\nMoreover, liquid staking providers, which offer staking services to users with smaller ETH holdings, may see increased usage due to the ability to unlock staked ETH. These platforms, which charge a fee on staking income, could become even more popular.\n\nMarket Position and Ripple Effects\n\nThe Shanghai upgrade caused quite a stir in the crypto market at the time. The release of unlocked ETH potentially tipped the scales for Ethereum’s position and price, as multiple reports have shown.\n\nIn all, during Ethereum’s transition to PoS, ETH’s price hovered around $1,800. Right after “Shapella,” ETH’s price rose slightly, trading 1.4% higher within 24 hours. It jumped more than 6% immediately after the upgrade, crossing $2,000 for the first time in nearly a year.\n\n📰#DidYouKnow that Ethereum staking APY hit 8.76%, a historical high.\n\nAnd $ETH net deposit saw daily growth after Shanghai Upgrade.\n\n\n\n👀Will the fact that the more staked $ETH & the less circulating pump $ETH price soon?\n\nStay close: https://t.co/OfKehFd4Vu pic.twitter.com/Fr5zZ927D5 — Gate.io (@gate_io) May 16, 2023\n\nCrypto trading advisor Laurent Kssis of CEC Capital predicted short-term volatility as traders who bought ETH in anticipation of the upgrade sold their holdings to cash out. Kssis suggested that this selling could lead to a strong supply of ether flooding the market, potentially causing the price to drop. At the time of his prediction, ETH was trading near $1,875, and he speculated that it could drop below $1,700 for the first time in two weeks as investors take profits.\n\nDespite short-term fluctuations, at the time, the long-term impact of the upgrade could be positive, particularly if institutional investors are attracted by the increased security and stability of the PoS system. This could boost institutional demand for Ethereum, potentially driving its price in the long run.\n\nMoreover, the Shanghai upgrade wasn’t just about validator rewards. The upgrade also included proposals to address Ethereum’s major weaknesses: slow transaction speeds and high fees. These issues have been a thorn in the sides of DeFi and NFT applications. The surge in DeFi activity has significantly increased the total value locked (TVL) on the Ethereum chain, and the NFT boom from 2021 to early 2022 has further exacerbated these problems, leading to poor user experiences and high transaction costs.\n\nProposals EIP-3855 and EIP-3860, part of the upgrade, address these issues to make transactions faster and cheaper. This could reignite interest in DeFi and NFTs on the Ethereum network. While EIP-3855 should help address transaction speeds, and EIP-3860 hopes to reduce transaction costs, their broader effect on ETH transactions remains to be seen.\n\nEIP-4895: enables validators to withdraw their stake of 32 $ETH from the staking contract on the Ethereum blockchain since the transition to Proof-of-Stake (PoS).https://t.co/x1mGqv9ZZR — IQ (@IQWIKI) April 3, 2023\n\nThese improvements might encourage ecosystems affected by high gas fees and slow transactions, which had moved to other chains like Solana or Ethereum layer-2 solutions like Polygon, to consider a comeback.\n\nThe Shanghai upgrade is a watershed moment for the platform itself and the entire crypto landscape. By enabling validator withdrawals, the upgrade has not only boosted Ethereum’s liquidity but also has the potential to shape its market position. As Ethereum progresses on its innovative path, it will be interesting to see how these developments shape the future of decentralized finance and digital ownership and ultimately influence the future of the entire crypto landscape.\n\nAuthor: Ayanfe Fakunle\n\nThe editorial team at #DisruptionBanking has taken all precautions to ensure that no persons or organisations have been adversely affected or offered any sort of financial advice in this article. This article is most definitely not financial advice."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxQVVpEczZUd1RQVXNLVGNSUlVwUmJwVVVEaE42dFRxMWdrRzZMZS16bFlOTUxNcjE2OXhYT2FGV3V6azlqeEhfYnVjUDI3cHpwQW51ZE03elBuNEtvRHlydFdoQUtqbkdzdDhPUFF1OHcxdmJwWi03a1VhRmRVMlRpczBHaDVzbWJ4V1Zz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jun 2024 07:00:00 GMT",
        "title": "Robert Kiyosaki Predicts Bitcoin to $100K: How Ethereum and Furrever Token Fit into the Picture - Yahoo Finance",
        "content": "Furrever Token\n\nNew York City, NY, June 07, 2024 (GLOBE NEWSWIRE) --\n\n\n\nThe cryptocurrency market is buzzing with excitement following a bold prediction from Robert Kiyosaki, the renowned author of \"Rich Dad Poor Dad.\" Kiyosaki forecasts that Bitcoin (BTC) will reach $100,000 by June 2024. This bullish outlook has sparked widespread interest and speculation within the crypto community, highlighting Bitcoin's potential and drawing attention to other significant cryptocurrencies like Ethereum (ETH) and Furrever Token (FURR). Here's a detailed look at how these three cryptocurrencies fit into the evolving market landscape.\n\nBitcoin: The Path to $100K\n\nKiyosaki’s prediction is grounded in several key factors that suggest a strong upward trajectory for Bitcoin. As of early June 2024, Bitcoin is trading near $68,500, with technical analyses indicating a symmetrical triangle pattern that could push its price to between $74,000 and $75,000. This bullish continuation pattern, coupled with a surge in Bitcoin ETF inflows and the post-halving supply dynamics, supports a potential breakout.\n\nMoreover, Kiyosaki's forecast is backed by historical trends and macroeconomic conditions. He has emphasized Bitcoin as a hedge against inflation, taxation, and stock market manipulation, urging investors to trust in assets like gold, silver, and Bitcoin. The recent approval of Bitcoin ETFs has further fueled market optimism, attracting substantial buy-side demand and reinforcing the cryptocurrency’s upward momentum.\n\nEthereum: Riding the Wave of Innovation\n\nWhile Bitcoin garners headlines with its dramatic price predictions, Ethereum remains a cornerstone of the cryptocurrency market due to its versatile blockchain technology and widespread adoption. Ethereum’s recent price movements and potential ETF approvals are significant developments that could impact its market performance.\n\nIn late May 2024, BlackRock updated its Form S-1 for the iShares Ethereum Trust, signaling a likely approval of Ethereum ETFs by late June. Such a development would boost investor confidence and likely lead to increased demand for ETH, mirroring the positive effects seen with Bitcoin ETFs. Ethereum’s utility in decentralized applications (DApps) and smart contracts continues to drive its adoption, positioning it as a critical player in the crypto space.\n\nMoreover, Ethereum’s transition to a proof-of-stake (PoS) consensus mechanism through the Ethereum 2.0 upgrade has significantly reduced its energy consumption and increased its scalability. These advancements are expected to enhance Ethereum's appeal to both institutional and retail investors, further solidifying its market position alongside Bitcoin.\n\nStory continues\n\nFurrever Token: A Charming New Contender\n\nAmid the buzz around Bitcoin and Ethereum, Furrever Token (FURR) is making waves as an emerging meme coin with a unique proposition. Launched with the aim of creating a heart-warming crypto ecosystem centered around adorable cat imagery, Furrever Token has quickly attracted attention from investors seeking high returns and community engagement.\n\nCurrently priced at $0.000732, Furrever Token’s presale has already raised over $1.2 million. The project offers a 25% bonus on new purchases until June 10, 2024, providing a compelling entry point for new investors. With its potential for up to 15X returns, Furrever Token appeals to both seasoned crypto enthusiasts and newcomers.\n\nSeveral factors contribute to Furrever Token's potential success. Its engaging community initiatives, regular challenges, and exclusive content are designed to foster loyalty and active participation. The token’s focus on cuteness and fun sets it apart in a market often dominated by technical and financial considerations, offering a refreshing alternative for investors.\n\n\n\n\n\nThe Synergy Between Bitcoin, Ethereum, and Furrever Token\n\nThe interplay between these three cryptocurrencies highlights the diverse opportunities within the crypto market. Bitcoin’s role as a store of value and hedge against macroeconomic risks, coupled with its significant market movements, sets the stage for broader market trends. Ethereum’s ongoing innovations and potential ETF approval underscore its critical role in blockchain technology and decentralized finance (DeFi).\n\nFurrever Token, while distinct in its approach, leverages the growing interest in meme coins and community-driven projects. Its unique appeal and structured incentives make it an attractive investment, especially in a market environment where investor sentiment can be significantly influenced by novelty and engagement.\n\nConclusion\n\nRobert Kiyosaki’s prediction of Bitcoin reaching $100,000 by June 2024 has undoubtedly intensified interest in the cryptocurrency market. As Bitcoin continues its bullish trend, Ethereum's technological advancements and potential ETF approval position it for significant growth. Meanwhile, Furrever Token offers a unique and engaging investment opportunity with its charming community-focused approach.\n\nFor investors, this trio represents a balanced portfolio: Bitcoin for stability and long-term growth, Ethereum for innovation and utility, and Furrever Token for high-risk, high-reward potential. As always, thorough research and consideration of individual risk tolerance are essential when navigating the dynamic world of cryptocurrencies.\n\n\n\nJoin Furrever Token Presale Now:\n\n\n\nFurrever Token Official Website\n\nVisit Furrever Token Presale\n\nJoin Official Telegram Group\n\nFollow Official X Account\n\nMedia Contact:\n\nRobert Smith\n\nhttps://furrevertoken.com/\n\nsupport (at) furrevertoken.com\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\n\n\n\n\nCONTACT: Robert Smith support (at) furrevertoken.com\n\n\n\n"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNMU9wNkxiUGJ6dVFKQ0s0YVpVZldkNzgzTVdPb1IwMm96RHNGOVNzY21OanhITTh5Z3ItazY4RUQ1U0l2SXY1VEZnbVZQcmFuRWJMbjZxaFJ4WklhVTZ1V05aa1NiRWtrT2ZmTVptNmp6MHpQcHpmVUJtRndWajR6THE3dzRiOG9NTnBKYk9udDdjRVdya2t1NtIBngFBVV95cUxQeWdDLURjNHV6bzdlenBzSnRRSVRwNzhzblRSUUNHdTFFb2JxTHNUSjlycmlVYVF3UGJJQjMzalllSXA2TUFibXg0enVJNWJKOU5EZW84MGpSWUJ3aUhGb1JSOEtxYlRic1NDdGx4MWgzX0M5UWcwbWpsQ3JYZ0xZeTdiN3pRLVdyanVxMjBMcW4yLUpqOXVicW9JTGlxZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jun 2024 07:00:00 GMT",
        "title": "ETH/BTC Price Analysis: Why Ethereum Price Can Break Out to $5000 - CoinGape",
        "content": "Ethereum price has been consolidating amid a bigger market structure—the bull flag. Investors are watching closely for when the price of Ethereum decides to move higher, as 30% gains may be at stake if they miss the move. In the meantime, Bitcoin adoption continues to soar as BTC price seeks to break the previous all-time high price.\n\nETH price hovered around $3,811 during European trading hours on Friday, a 1.3% decrease in 24 hours and a 1.4% increase in 7 days.\n\nadvertisement\n\nETH/BTC Price Analysis: Ethereum Price Creeping Up Channel, May Breakout in Less than 1 Week\n\nEthereum price has been stuck in the current consolidation zone for the past eight days. Nevertheless, this chart pattern is part of a previously formed bull flag with massive profit implications if it breaks out.\n\nThe price of Ethereum is trending above the 50-day and 200-day simple moving averages (SMA), signaling bullish sentiment among investors.\n\nAdditionally, ETH price action has been creeping up an ascending channel, which indicates a short accumulation phase before a breakout.\n\nExtending the channel shows ETH price may try a breakout in about 4 days if all factors remain constant. However, fundamental news can either make or break the current Ethereum market structure.\n\nOn the other side, Bitcoin price is also sporting a bull flag, but in a 4-hour timeframe. The price is also trending above the 50-day and 200-day SMA, a bullish signal for the asset. BTC price is currently en route to testing the upper boundary of the range.\n\nIf it manages to break out, we may see a $74,000 Bitcoin price in the coming days. $72,300 may push some resistance, but if the bulls are strong enough, they may slice through this barrier easily. On the flip side, strong support exists around $67,000 that may hold up the price.\n\nETH/BTC Price Future Outlook\n\nEthereum price went from $2,800 to $3,900 in one candle, and it is currently holding up well at $3,700 to $3,800. All this is happening before the S-1 applications are approved and an ETF is launched.\n\nWhile Bitcoin grinds up slowly, ETH price holds the keys to big gains after $4,000 with the ETF launch. The market is eagerly waiting for S-1 clarity as the 10-day window to revoke the ETF has elapsed.\n\nOn the other hand, Bitcoin’s open interest hits a new high at 520,000 BTC, exceeding March’s all-time high. Meanwhile, Bitcoin ETFs are thriving with $488.1 million inflows.\n\nBottom Line\n\nThe crypto markets are full of speculation, which often proves accurate. The Bitcoin ETF represents the best-case scenario. As investors speculate on the ETA of the Ethereum ETF, there is a general sentiment that the SEC is stalling and that ETF approval is inevitable. Investors eagerly await the outcome of this ETF struggle.\n\nRelated Articles\n\nEvans Karanja Evans Karanja is a crypto analyst and journalist with a deep focus on blockchain technology, cryptocurrency, and the video gaming industry. His extensive experience includes collaborating with various startups to deliver insightful and high-quality analyses that resonate with their target audiences. As an avid crypto trader and investor, Evans is passionate about the transformative potential of blockchain across diverse sectors. Outside of his professional pursuits, he enjoys playing video games and exploring scenic waterfalls.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxOUE9Rc3FyMTZUMzVxVlpsejY3QlFaVmM3LXVxR1FTV1huUmhfYnZQNzdWSjV2ajJzVVRvRlBpSDdTSGx2ZEZKWjAtNkp0cmltUGlMQ05UU1dxdFlOV19NckVHdW9YWC1fUW1HNXczRzlKM1pfN2NUZVlXN3hORjd4S1ctUDdlZ9IBjgFBVV95cUxPWmExNGFicWJGUGpEc0EtT0x2cC1TZWstWTdxcjctOHh3Ykx2aV81UFU2emI4UkNHRDU5Y3U1QnI5Q2drQVZqdFgxd1BIbFhtRXZwNXk5TzZicUxzN2RGZXFOM2xLem4zYnk0VjFyY3d3U2tBUWdnejRxZE5FcnBHeE83cmIzeEZGdW1udGJR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Jun 2024 07:00:00 GMT",
        "title": "This Week in Coins: Bitcoin and Ethereum Pump—Then Dump—Amid Roaring Kitty Rush - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIllustration by Mitchell Preffer for Decrypt.\n\nBitcoin and crypto investors received a lot of good news this week, even though the market still can’t manage to break free from its highs three months ago.\n\nOn Tuesday, the US Bitcoin spot ETFs absorbed net inflows of $887 million—the second-best daily performance for the ETFs to date. The price of Bitcoin surged above $71,000 in the process, reaching its highest price since March.\n\nThat performance was followed by not one, but two high-profile Bitcoin ETF sponsors assuring investors that a second, much larger wave of institutions was coming to buy Bitcoin through the funds. Bitwise CIO Matt Hougan wrote in a memo that crypto regulatory progress on Capitol Hill was untapped “alpha” for investors, while Franklin Templeton CEO Jenny Johnson said the ETFs had only been touched by their “first wave of the early adopters.”\n\nAD\n\nAD\n\nJUST IN: Franklin Templeton CEO on #Bitcoin ETF adoption says “This is really the first wave of the early adopters. …the next wave is the much bigger institutions.” WATCH👇 pic.twitter.com/G52jWUEetX — Bitcoin Archive (@BTC_Archive) June 5, 2024\n\nAnd at least in the memecoin world, the bull market appeared to be back in full swing. Bitcoin’s very first BRC-20 token, ORDI, surged by over 30% to $60 as of Friday, while PUPS and Bitcoin Wizards (WZRD) more than doubled in value intraweek, according to CoinGecko data.\n\nOther more popular memecoins like PEPE, BONK, and SHIB weren’t as lucky, all posting losses this week.\n\nThe Solana-based meme coin GME seriously spiked, blasting up 467% at its height this week, building on the momentum of its stock market namesake Gamestop (GME). Meme influencer Roaring Kitty—who sparked the Wall Street-confounding GameStop movement back in 2021—gave the stock a second wind with his surprise returns to both YouTube and live streaming, with his net worth briefly edging toward $1 billion—before a Friday cold shower from the game retailer.\n\nPerformance-wise, between Bitcoin and meme coins is Ethereum, which kept pace with Bitcoin’s gains this week as its progressed toward a spot ETF launch. VanEck analysts posted a lengthy report arguing that ETH will reach $22,000 per unit by 2030, after sucking away financial market share from Apple, Google, and big banks.\n\nAD\n\nAD\n\nFinally, with both the Bank of Canada and European Central Bank lowering interest rates this week, BitMEX co-founder Arthur Hayes told followers that it was officially time to start apeing into Bitcoin and shitcoins.\n\nYet his call may have been a tad premature: at the end the week, a liquidation cascade on Friday sent Bitcoin crashing from $71,000 to $68,000, and ETH down from $3,800 to $3,600. Meanwhile, GME—both the stock and the memecoin—cratered by over 35% each.\n\nRoaring Kitty is the greatest business communicator since Steve Jobs. Dude shows up 30 minutes to the livestream. Builds the tension up to 11. Shows up on the livestream in a fake bandage and cast. And the first thing he says is “oh shit”. pic.twitter.com/YlTesdxJGB — Trung Phan (@TrungTPhan) June 7, 2024\n\nBitcoin is trading for $69,335 as of writing, while Ethereum is priced at $3,686. The price of the GME meme coin has once again settled near $0.014.\n\nPrices current as of 3am ET on June 8, 2024. Edited by Ryan Ozawa."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxPWDZIb1p2clhMc2haOEktQU00NkxSeVZlenBGWUtLS2VvSk9Rb2E5U05zQmtvQ2dNUEVKWUxHV3VNeXc1X0NPZlBuTWRTSEdBVTFWOEVQRks5M1A3QUJIRmhSd0x3NnJ1cnJnT2syczZhUGFkN0pxWmRyRzVXSTgtZ3hYN0lNWGVHdkkyWkJQWThXZ9IBlwFBVV95cUxQdnpvdEd4S05WYWZ3VEprbDY3ZzJBc0dMay1ETk1fY3FVMWp4b3Q5NW1POEZ5UUd1eU5SVm9JbGlGWkFhNlpUR0JyWnRCX3lfT2hwTnRxMmFXZUc4VTg2SWxpWXpEQmdJUE03Q1ZSODJoYVlUdHYwMTAyandvSUkzbUxBbVByelJIVUFxaDJwV1dTaHU3OEFN?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Jun 2024 07:00:00 GMT",
        "title": "Ethereum whale’s $56M sell-off could have THIS impact on the market - AMBCrypto News",
        "content": "A major whale sold part of its ETH holdings\n\nAltcoin’s price fell, while Ethereum’s network growth declined too\n\nEthereum [ETH]‘s price registered a massive hike over the last few weeks, one fueled by news of new spot ETFs for ETH. Despite the optimism around the network, however, a large whale recently decided to sell its holdings.\n\nWhales shy away\n\nOn 8 June, a significant transaction occurred on the Ethereum blockchain. A major whale transferred 15,200 ETH, worth approximately $56.47 million, to Kraken. This particular address received massive holdings of 67,000 ETH directly from the Ethereum Foundation. It is further believed that this same address also received an initial 200,000 ETH during the Ethereum Genesis block, likely signifying participation in the ICO (Initial Coin Offering) that launched the Ethereum network.\n\nHere, it’s worth noting that despite this recent transfer, the wallet still holds a balance of 41,000 ETH – Valued at approximately $151 million.\n\nThis large transaction may be interpreted by some investors as a sign that the whale is losing confidence in Ethereum’s future, prompting it to sell its holdings. This fear-based selling could trigger a domino effect, driving the price down further.\n\nAdditionally, the unknown purpose behind the transfer can spur further uncertainty.\n\nHow is ETH doing?\n\nAt press time, ETH was trading at $3,683.83, with its price down by 3.14% in the last 24 hours. Despite this sudden dip in ETH’s price, however, the overall trend of the price movement looked relatively positive.\n\nAnd yet, the network growth for ETH declined significantly over the last few days, implying that new addresses were losing interest in ETH and were not ready to buy ETH at the current rate. If the price dips further, there may be a chance that ETH may begin to look lucrative to new investors in the future.\n\nCoupled with the declining network growth, the velocity at which ETH was trading also fell materially.\n\nIn terms of overall activity on the network, gas usage on the Ethereum network declined over the last few days. Additionally, the overall NFT trades on the network plummeted as well.\n\nThe lack of activity on the Ethereum ecosystem can be detrimental to both the the network and the price of ETH in the long run.\n\nIs your portfolio green? Check the Ethereum Profit Calculator"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxNMzItTlIyS2h4NFV4NXRsS2ctM2I3SHlPMDhQNnJfdHRFVVlNejByWTZVdC1aaGFDQkhFQkxIdGN2VUpGM1QzWUhUdm1TeWlrSjJ5QzJva3NTQzY1QjI3YzNIN011Y0t6Y2ZRalV3Tm9XdW85MlBHX1RELVVtaHN5VVRzTU5YYlZtTzhfWVVB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jun 2024 07:00:00 GMT",
        "title": "Cryptocurrency: 3 Coins To Buy Now Before Ethereum Hits $5,000 - Watcher Guru",
        "content": "Cryptocurrency investors are always on the lookout for the next big opportunity. With Ethereum, the second-largest cryptocurrency by market capitalization, expected to reach $5,000 in the near future, investors are exploring alternative coins that could potentially offer significant returns.\n\nIn this article, we will discuss three promising cryptocurrencies that are worth considering before Ethereum hits this milestone: PEPE, Optimism, and Arbitrum.\n\nAlso read: Cryptocurrency: 3 Top Coins To Watch As BNB Hits New ATH\n\nPEPE\n\nDespite its lighthearted name, PEPE has shown impressive price performance, currently trading at $0.00001456, up 1.79% in the past 24 hours.\n\nThe coin’s 24-hour low and high stand at $0.00001422 and $0.00001518, respectively, indicating a healthy level of volatility that could lead to significant gains for investors who time their entry and exit points correctly.\n\nAlso read: Shiba Inu Becomes The Most Traded Crypto in India\n\nOptimism\n\nOptimism, with its native token OP, is a Layer 2 scaling solution for Ethereum that aims to improve the network’s scalability and reduce transaction costs.\n\nBy utilizing optimistic rollups, Optimism enables faster and cheaper transactions while maintaining the security of the Ethereum mainnet. OP is currently trading at $2.51, up 0.18% in the past 24 hours, with a 24-hour low of $2.47 and a high of $2.55.\n\nAs Ethereum continues to grow and more users adopt Layer 2 solutions, Optimism is well-positioned to benefit from this trend, making it an attractive investment option.\n\nAlso read: Ripple: Can XRP Hit $0.6 This Weekend?\n\nArbitrum\n\nArbitrum, another Layer 2 scaling solution for Ethereum, has been gaining traction among developers and users alike. By leveraging optimistic rollups, Arbitrum enables faster and cheaper transactions while maintaining compatibility with Ethereum’s ecosystem.\n\nThe platform’s native token, ARB, is currently trading at $1.11, down 0.26% in the past 24 hours, with a 24-hour low of $1.10 and a high of $1.14. As more decentralized applications (dApps) and users migrate to Layer 2 solutions, Arbitrum’s adoption is expected to grow, potentially leading to an increase in the value of ARB.\n\nIt is crucial for investors to identify promising opportunities beyond the well-established players like Ethereum. PEPE, Optimism, and Arbitrum represent three cryptocurrencies with potential for growth, each offering unique value propositions and use cases."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxQYVU2WC1ZVXFQZkx2N0VVeTQ5LWhWQ1RaRGVvYU1CRlM5MnAwQi02UXljZHk4ZmFzUEYwWVNqNHEtcmZ3eHZoZVEzaG90MGxMZUlHZWpkWFoxNzF5dzdWZkhjMTVVQ1M3SzVyUVNOd0YtYWZxYnFXenIxRkZrWmdtcm1mVjhrUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jun 2024 07:00:00 GMT",
        "title": "Vous n’en croirez pas vos yeux : Ethereum atteindra cette valeur en 2030 ! - Cointribune EN",
        "content": "Fri 07 Jun 2024 ▪ 3 min read ▪ by Luc Jose A.\n\nEther (ETH) at $22,000 by 2030? This is the impressive forecast by VanEck for the native crypto of the Ethereum blockchain. This ambitious estimate draws the attention of experts and investors worldwide. But what justifies such an evaluation?\n\nVanEck sees big for Ethereum\n\nCurrently, ether is trading around $3,852, a value that may seem modest compared to VanEck’s ambitious forecasts. The investment company, in its recent report, envisions a future where ether would reach the staggering sum of $22,000 by 2030. This prediction highlights the enormous growth potential of this crypto and its disruptive capabilities in the global financial landscape.\n\nVanEck, renowned for its sharp analyses and bold forecasts, anticipates a major transformation of the market thanks to Ethereum. This projection, though spectacular, is supported by current trends and notable advancements in the Ethereum ecosystem, positioning its native crypto as a key player in the evolution of the digital economy.\n\nThe arguments put forward by VanEck to justify this explosive growth\n\nOne of the main growth drivers for ether, according to VanEck, is its revolutionary aspect. Ethereum offers a robust platform for decentralized applications (dApps) that can transform various sectors, including traditional finance, digital payments, and even artificial intelligence. This capacity to disrupt and innovate positions Ethereum as a potential leader in the new era of the digital economy.\n\nAnother key factor is the development of ether-based ETFs. According to VanEck, the approval and widespread adoption of Ethereum ETFs will facilitate institutional investors’ access to this asset. This opening to large investors could significantly increase the demand and liquidity of ether, thereby consolidating its market position.\n\nFinally, the on-chain data analysis conducted by VanEck reveals promising financial indicators for Ethereum. The report highlights significant cash flows estimated at $66 billion and sustained network activity, reinforcing the robustness and long-term viability of the Ethereum blockchain. These observations enable VanEck to justify its optimistic prediction of $22,000 per ether by 2030.\n\nThe future of ether according to VanEck looks promising with a bold forecast of $22,000 by 2030. It remains to be seen whether these predictions will materialize in an ever-changing crypto market.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxOdFdKbmdFZnZfemRTX1BJbHlJeUtSR29iaVhHQXJQeXBPS0FhMWQzMnlFcWViR2JtdFl0eVM0NnhFOXNhc2RhR21pVkpkdVlkTkNmcUJJazZ3VGZkMmxMQTJoRTVtd3NKODczZGNhaTFYVWhkMXFmUS15V0lwUGZBeEFOY0Y3NDNSQWx5OWptNTBHT19rMjJad3BWXy1RVDg5WUlhWElmSEVDaXVPZEFVZGtpbkFUbF9HV1QwNUN6ZUQyamotcVVZLUhvenVRWnRmZ2wtNQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jun 2024 07:00:00 GMT",
        "title": "StakingFarm CEO Highlights Impact of Staking on Ethereum Liquidity - GlobeNewswire",
        "content": "London, England, June 07, 2024 (GLOBE NEWSWIRE) --\n\n\n\n\n\nStakingFarm, a prominent player in the cryptocurrency staking industry, has released new insights from its CEO, Klajdi Toci, on the significant impact that staking has had on Ethereum (ETH) liquidity. According to Toci, staking has emerged as a major liquidity sink for ETH, a phenomenon that has drawn the attention of analysts and market observers alike.\n\nDespite the surge in Ethereum prices since Q4 of last year, the three-month circulating supply of ETH has not seen a meaningful increase. This stagnation in circulating supply, as noted by StakingFarm's analysts, underscores the profound effect that staking has on the availability of ETH in the market. As more investors lock their ETH in staking contracts to earn rewards, the overall liquidity of Ethereum decreases, influencing market dynamics and price movements.\n\n\"The surge in ETH staking has created a unique situation where a significant portion of the asset is effectively removed from circulation,\" said Klajdi Toci, CEO of StakingFarm. \"This reduction in liquid supply can have various implications for the market, including potential price volatility and changes in investor behavior.\"\n\nStakingFarm, known for its innovative staking solutions and user-centric platform, has observed these trends firsthand. The platform offers a range of staking opportunities, allowing users to lock their ETH and other cryptocurrencies in return for rewards. This practice not only supports the security and operation of blockchain networks but also provides a source of passive income for investors.\n\nHowever, the growing popularity of staking has led to a substantial amount of ETH being locked up, thereby reducing its availability in the open market. This trend highlights the dual-edged nature of staking: while it benefits individual investors through rewards, it also impacts overall market liquidity.\n\n\"Understanding the liquidity implications of staking is crucial for both investors and the broader market,\" Toci added. \"At StakingFarm, we are committed to providing our users with the information and tools they need to navigate these complex dynamics effectively.\"\n\nStakingFarm's analysis aligns with broader industry observations. Analysts have noted that the reduced liquidity resulting from increased staking activities can lead to heightened price volatility. As the circulating supply of ETH remains constrained, even minor market events can trigger significant price fluctuations, creating both opportunities and risks for traders and investors.\n\nIn response to these developments, StakingFarm continues to enhance its platform, offering advanced tools and insights to help users make informed decisions. The platform's commitment to transparency and user education ensures that investors are well-equipped to understand and manage the liquidity dynamics associated with staking.\n\nAs the Ethereum network and the broader cryptocurrency market continue to evolve, StakingFarm remains at the forefront of innovation, providing solutions that cater to the diverse needs of its users. By staying attuned to market trends and investor behaviors, StakingFarm aims to foster a more resilient and informed staking community.\n\nFor more information about StakingFarm and to explore Ethereum staking opportunities, please visit https://stakingfarm.com/.\n\nFor media inquiries, please contact:\n\nName: Klajdi Toci\n\nPosition: CEO\n\nEmail: info (at) stakingfarm.com\n\nWebsite: www.stakingfarm.com\n\n\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency & securities.\n\n\n\n"
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxPMXZSeGxnQXRtNmg0SEZzVjczN1Jrb3V2Sk1aTWhhNE5hYnlpY1NaaWp0NEkwdF95c2hwU0ZJcEEtbjRYSHdzZHI5WkwwcWFiMU4zZTFKeU9rS2hLWjBGNUROQnY2RUh0a056aU91dkc5UnpoUDkzM25EaUJnakVWNEtFbWVQZEgyUlhsZVpzMjhsZFBaSmYzVDNzSWY3d9IBowFBVV95cUxOaTY3aUZRaU0wSGNCU056SHBJYzVRYUhaQlFNY0JKOFlkMXJLX2NzQzdTbTJmZzZjXzZsdHEzY1JUVkc1NTByYzdmSUdBQW5RMTAzLUJSdmtTR2Y3dExFQksxRFhuajRJZGRpV2JEQ0VQcHRHMTVKVmRaMGRBT2lvd3lLbHVRam1NSXA0dWNXR1JXZVpwd0dNQVVPUjJBQVlzQ2ln?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Classic’s bullish outlook fades; Look out for these key signals now! - AMBCrypto News",
        "content": "ETC’s market structure was bullish at press time\n\nMomentum and volume indicators turned bearish on the charts though\n\nEthereum Classic [ETC] retested the $25-support level and nearly flipped its higher timeframe market structure bearishly. This came after an unfavorable U.S May Jobs Report. Its short-term momentum seemed bearish too.\n\nIn a recent report, AMBCrypto noted that the $28.4-$29 zone could be revisited before a bounce. Ethereum Classic dropped more than expected. Ergo, the question – How do traders react to the recent price action?\n\nThe $29-support level did not hold\n\nThe recent higher low was set at $25.19 on 13 May. The price drop on 7 June, touched $25.07, but did not close a daily session below $25.19. Hence, the bulls seemed to have the upper hand on the higher timeframe, though it appeared tenuous.\n\nThe Directional Movement Index saw the -DI (red) jump above the 20-mark. It was an early sign that the trend could be shifting bearishly, as the ADX (yellow) would also need to climb past 20 to signal a strong downtrend in progress.\n\nThe CMF was at -0.09, indicating significant capital flow out of the market. This selling pressure has been present for a week. It would need to turn around for bulls to regain some hope.\n\nFutures market highlighted intense bearishness\n\nOver the past 10 days, Ethereum Classic has steadily risen from $31 to $28.6. The past 24 hours saw a flurry of selling activity spurred by Bitcoin [BTC] though. Hence, ETC fell by 14.32% in a single 4-hour trading session, followed by a bounce from $25.07 to $27.\n\nRead Ethereum Classic’s [ETC] Price Prediction 2024-25\n\nThe Open Interest also fell sharply alongside the price, showing bearish sentiment and a reluctance to enter positions due to volatility. The spot CVD continued its downtrend too. The volume indicators agreed that selling pressure was firm.\n\nThe bulls would need to change this to re-establish an uptrend on the lower timeframes.\n\nDisclaimer: The information presented does not constitute financial, investment, trading, or other types of advice and is solely the writer’s opinion."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxNWmFTN0lkeFl3T1QwV2ljby1pTWtsOGJoZkw4LVlvVWJjTmtOcWFrUGQxdGxXU0hHNk1oSXg3Q3lGYy0yOW9Ja1o1aEpwS2M5cjFQYVZHRTRlT3AtQmNrQVBlMHRFNUpQWTRlTFNQcGNPRHd5c0xDYm55U2U1amtkRWpPTW9OLXBBQk12cTRPZlhpdHNfaElqbzFOUU9NN0XSAaQBQVVfeXFMT2ZtYzIxVU5BWldMbkJSdUxfXzBDV2FURUg5ZllfUlMyVVJucTU5RVNGLVh0cU9QejlpRmJXOF9CVWNCNS1yblQ5WWRQeUNIMHNYcGJObVdLTE1EUGIwM2dyOVpVNGRJSW1jakxEWS1KZ05fY0V6b0doSE1fODJGaHBITFNIcllEbzA5R1oybkhrdHliaTJZdUxxTGZOd04zMlhQUzc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Jun 2024 07:00:00 GMT",
        "title": "Is Ethereum (ETH) Going to Lose $4,000? Solana at $170: Was It Fakeout? XRP Remains Stable - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nEthereum is kind of losing it. It is likely that you have already seen the recent price action near the $4,000 mark. Unfortunately, Ether has failed to move past this mark or even reach it and gain a foothold there.\n\nEthereum has been trading in a narrowing range. Usually, this pattern indicates a phase of consolidation preceding a possible breakout. Here, the important levels to keep an eye on are roughly $3,900 on the upper side and $3,626 on the lower side.\n\nIt has been tested a few times recently, and the immediate support is currently at $3,626. Conversely, any bullish continuation would require a strong breach of the resistance leveled at $3,900.\n\nAnother important factor is volume. A lack of strong buying pressure may be the reason for the lower trading volumes we have seen recently. Since ETH is neither overbought nor oversold and has room to move in either direction, the Relative Strength Index (RSI) is circling 65.88.\n\nAdvertisement\n\nA further drop toward the 50-day moving average, which is currently at $3,298, may occur if Ethereum breaches the $3,626 support level. But ETH might return to the $4,000 region and higher if it breaks above the $3,900 barrier.\n\nSolana pushes to new heights\n\nSolana has indeed climbed toward the $170 threshold and might be actively conquering it in the foreseeable future.\n\nSolana has been moving within a narrow range on the daily chart. The green line indicates the $165.84 support area, where the price appears to be holding steady after reversing below $170. The blue line at $156.52 and the orange line at $151.66 are important support levels to keep an eye on. Historically, these levels have provided a lot of support.\n\nThe levels of immediate support are $156.52 and $165.84. Should these levels hold, SOL may try to make another push for $170.\n\nThe important resistance level is still $170. If SOL breaks above this, it might rise higher.\n\nIf Solana is able to sustain support above $165.84, another attempt to break $170 may occur. Nevertheless, a decline toward $150 or less may be indicated if it closes below $156.52, which would signal a bearish trend.\n\nLong-awaited XRP stability\n\nLately, XRP has been remarkably stable, consistently trading at or near $0.52. Let’s examine the chart to see what is causing this stability and what to look out for going forward.\n\nXRP has been in a consolidation phase on the daily chart. The $0.50 support level, indicated by the green line, has been maintained by the market. Approximately $0.55 (orange line) and $0.57 (black line) are the resistance levels to be aware of.\n\nApproximately $0.50 is the closest support. Strong buying interest is indicated if XRP remains above this level. The $0.55 and $0.57 levels are important resistance points. If these levels are broken, a bullish trend might be indicated.\n\nMoving averages offer more information. Acting as support, the 50-day moving average is situated below the current price. The 200-day (black line) and 100-day (orange line) moving averages are both above the current price level, offering solid resistance levels for the future.\n\nAs always, volume is important. Consistent trading volumes in recent times indicate steady interest. With XRP’s Relative Strength Index (RSI) at 51.89, it is clear that the asset is neither overbought nor over sold, which does not offer much insight but shows that things are relatively steady.\n\nThe $0.55 resistance level may be broken by XRP if it maintains its hold above the $0.50 support level. If the break is successful, XRP may move up to $0.57 and higher. But if it drops below $0.50, that could indicate a bearish trend."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPTHJPWldCWk81VjFqSElPSGxNN3YtTVZkNW9kOXdjUWwwRTJqSFczY2lxT0ppbW5LbVBadGJOUktycXBRNEh4VjlVY1otc3VXSGswVWRQS21FckxFb3RSMTRXd1h1QW1ET3J6TDc1cXE1RmJLa3lQYndwNjVDNnExSzUyem44WVnSAYwBQVVfeXFMT2EyTklFa1BCNnc1LXdWUWlUNV8xaGNPWkhIN0tHRERPbzlHU09wMnQ0aUtXRmxMU21ndjhlODh1Rmx5MXB2UHJEdTVoYkljYnFiOGdNbnhhTExVaTgzaUNQQ3VPb1RYYlZMQ3Q1LVpqeDdfRHhaN25FcWxiUml5RFQ0T0ZWMWpKM285WEE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Pectra Upgrade Expands With 2 EIPs, ETH Road To $5K? - CoinGape",
        "content": "Christine Kim, the Vice President on the Research team at Galaxy just took to the X platform to highlight the latest task that Ethereum (ETH) developers are undertaking regarding Pectra upgrade. The X post comes after the blockchain’s All Core Developers Execution Call (ACDE) on June 6.\n\nEthereum Developers to Expand Pectra With 2 EIPs\n\nAccording to the Galaxy Researcher, Ethereum developers agreed to further expand the scope of the Pectra upgrade yesterday with the inclusion of EOF and EIP 7702 to the Pectra upgrade. The All Core Developers Execution (ACDE) Call #189 held over Zoom and was chaired by Ethereum Foundation (EF) Protocol Support Lead Tim Beiko.\n\nadvertisement\n\nThe simultaneous integration of both solutions is likely to trigger delays in multi-client testing for the upgrade. Hence, the protocol developers plan to activate EOF on later-stage devnets. The developers are also considering conducting the activation on a different activation epoch from other EIPs, just like how developers plan on testing PeerDAS.\n\nThe feedback pooled from various EL client teams and the EF DevOps team suggest that they are in support of the integration of EOF on Pectra.\n\nEL EIPs CONFIRMED FOR PRAGUE:\n\n– EIP 2537\n\n– EIP 2935\n\n– EIP 7685\n\n– EOF\n\n– EIP 7702 pic.twitter.com/uGf6Fm6eFs — Christine Kim (@christine_dkim) June 6, 2024\n\nThere was only one opposition view from Geth. Guillaume Ballet, one of Geth’s developer said, outline notable fears bothering on Verkle functionality.\n\n“My fear is that the more we wait, the longer the Verkle translation will take. Is EOF really that urgent? I don’t think so. I’ve read several the arguments for shipping it in Prague. The more I read those arguments, the more I realize, no, there’s nothing that really justifies EOF,” he said\n\nA significant percentage of the Ethereum protocol developers disagreed with this stance. One “Kamil Sliwak” noted that EOF would be “a huge improvement” particularly for users interacting with the compiler for Ethereum’s smart contract programming language Solidity.\n\nDevelopers Decide on the Integration of EOF\n\nIn the meantime, discussions are ongoing about the preferred approach for integrating EOF. Beiko’s recommendation is that they aim to ship all Pectra EIPs including EOF in one client release. For the present purposes of testing, he encouraged developers to consider the use of devnet to stage the implementation of these code changes.\n\nFor these developers, the inclusion of EIP 7702 is as a replacement to EIP 3074, although there are still certain issues with the specifications for EIP 7702. Ethereum protocol developers are putting efforts and resources in separate breakout room to fix these challenges.\n\nThis potential additions could impact on the price of Ethereum. Noteworthy, the altcoin has been showing bullish signs since the United States Securities and Exchange Commission (SEC) greenlighted spot Ethereum ETFs. Ethereum is currently trading at $3,790.62 with a 1.29% dip within the last 24 hours. Investors are hopeful that it would break through to $5,000 in keeping with projections from top analysts.\n\nRead More: Customers Bank Reportedly Debanks Crypto Hedge Funds Amid FDIC Alert\n\nGodfrey Benjamin Linkedin Benjamin Godfrey is a blockchain enthusiast and journalists who relish writing about the real life applications of blockchain technology and innovations to drive general acceptance and worldwide integration of the emerging technology. His desires to educate people about cryptocurrencies inspires his contributions to renowned blockchain based media and sites. Benjamin Godfrey is a lover of sports and agriculture. Follow him on Twitter\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxOMkhBVkI1ME1HQVctd0M3Q2hFS0NmMmtJSFFjdDJWMTFjSWJRWG5iQXBSaDFwLThQZmNXbDJuaGtSejJwNGVVSWJEWFBScGYzWTJmUm9pT2xvY3hoeUlaeWtBYkhYZFYzeEIxS3FmTU1MUGZlY0pQbWpMOXVJZi1lck0wd0twbTVWc2wxWXZGU3VhcjhvRkF0LWNuM1J6QdIBqwFBVV95cUxObGd4MV9HT19iaTF5NEZrRGU2Rld5eGxyZmdHWlBqY1lKNk9oWXRYS0pPVFlqZ2c0djZObXdqa3FaZDd5X1BLdlBIYzNDcG8ybzRQd3hXZGlReElqZk5faFNHaWFKS1d6aHBjYlJvTHVVaXpjOURlNUFSM3pjNUxYWlpFcVliWUI5YkVuYlNlLVBJWUpjSUlrQXFvZWxQdGpnY0RqcFl6bVpXNGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Code | Official Website | Latest Review Updated 2024! - Outlook India",
        "content": "Ethereum Code - Minimum Deposit\n\nEthereum Code is a free trading system and when we compare this platform to other trading systems, we can see that the former is quite affordable. There is no need to pay a registration fee while registering on this platform. No other fees like platform fees, deposits, or withdrawal charges are levied from the users. Users should deposit an initial amount of $250 to begin live trading. The amount can be increased according to individual choices. Users can also withdraw this fund at any time. It is important to note that customers are not charged any hidden charges or transactional fees.\n\nTry Ethereum Code For Free\n\nEthereum Code - Supported Cryptocurrencies\n\nTraders can diversify their portfolios through the Ethereum Code trading system. They can invest in a wide range of cryptocurrencies through this single system. Some of the mainstream cryptocurrencies supported on this platform are Bitcoin (BTC) Ripple (XRP), Ethereum, Binance Coin (BNC), and so on. Apart from these, the platform also supports Forex pairs, CFDs, and other asset classes. Some of the cryptocurrencies supported on this platform are noted below.\n\nBitcoin (BTC)\n\nEthereum Classic (ETC)\n\nEthereum (ETH)\n\nRipple (XRP)\n\nBinance Coin (BNC)\n\nCardano (ADA)\n\nPolkadot (DOT)\n\nDash (DASH)\n\nMontero (XMR)\n\nRipple (XRP)\n\nYou can visit the official page, to view the complete list of cryptocurrencies supported on this platform.\n\nEthereum Code - Customer Support\n\nEthereum Code has an efficient team of customer support, who can help resolve any issue, such as technical, transactional, or trading doubts. The team is available 24/7 and users can reach out to them by calling their toll-free number or sending an email. The team consists of experts in resolving any issue and they also can help clear any doubts. You can view the Ethereum Code customer support details on the official website.\n\nEthereum Code - Countries Available\n\nThe Ethereum Code trading system is available in most countries across the world, except in some, where strict trading laws are implemented. So, here are the countries where Ethereum Code is available and traders can use it to make profits.\n\nMalaysia\n\nSingapore\n\nJapan\n\nHong Kong\n\nVietnam\n\nUnited Kingdom\n\nGermany\n\nBelgium\n\nSweden\n\nNetherlands\n\nFinland\n\nNorway\n\nSpain\n\nMexico\n\nBrazil\n\nPoland\n\nSwitzerland\n\nSlovenia\n\nSlovakia\n\nTaiwan\n\nThailand\n\nEthereum Code - Customer Support\n\nSo far Ethereum Code has received positive responses from its users. By consistently using this platform many of them have made a lot of profits. They have also said that what made the platform efficient in terms of making higher profits is its user-friendliness, overall market analysis, and the integration of advanced technologies. With the help of this platform, users can identify the right trading opportunities. Authentic reviews are available on different platforms, such as Reddit, Quora, and X. From the Ethereum Code customer reviews, we can understand that it is a genuine and efficient trading system.\n\nIs Ethereum Code Legit?\n\nWe have already discussed different factors about the Ethereum Code system in the previous sections of this review. One of the important factors among these is that this platform is free to use. Users do not have to pay any charges to use this platform. The minimum amount required to start trading is $250 and can be increased according to one’s trading goals. The important thing here is that users have full autonomy over their funds and can withdraw the amount at any time.\n\nWith reviews on Sitejabber, the platform has a total rating of 4.4 out of 5. Most testimonials say the same thing: Ethereum Code is a legitimate platform.\n\nStrict and safe encryption systems have been integrated into this platform to protect user privacy and data. Technologies such as two-factor authentication and other code systems are used to prevent data breaches and external attacks. In addition, Ethereum Code users have testified that the platform has helped them make high profits and expand their trading portfolio. Ethereum Code is a legitimate trading system and worth trying.\n\nEthereum Code Review - Bottom Line\n\nThis Ethereum Code review has discussed all the major factors of the trading system. Here is an overview of what we have talked about so far.\n\nEthereum Code is a free trading system aimed to help traders identify trading opportunities and make more profits. The system has been designed using advanced technologies, like artificial intelligence, algorithms, and analytics. It is said that the system generates accurate trading signals that come into use when searching for profitable times. The technologies make the platform highly efficient and many users have reported that it has helped them to make higher profits. Risk management tools are also integrated into this platform to identify the risks and automatically stop orders.\n\nOverall Rating - 4.6/5\n\nEthereum Code offers a comprehensive and user-friendly platform that excels in multiple critical areas. Its seamless design, extensive educational materials, reliable customer support, robust security measures, and empowering user control make it a top choice for investors of all levels. By focusing on providing a supportive learning environment and empowering users, Ethereum Code stands out as an invaluable tool for anyone looking to navigate the complexities of cryptocurrency trading and investment.\n\nEthereum Code is a secure trading system because all the safety measures, such as two-factor authentication and secure codes are used to protect it from external breaches. Evaluating all these aspects, Ethereum Code looks like a legitimate trading platform and is worth a shot.\n\nTrade With Ethereum Code For Free\n\nEthereum Code - FAQs\n\nCan I use the demo mode to test strategies?\n\nYes. Demo mode provides a free practice session for traders. They can practice trading and test strategies as they want.\n\nI am new to crypto trading. Is Ethereum Code suitable for me?\n\nTrading experts and a novice trader can use the Ethereum Code platform. Newbies can practice in the demo mode to test their skills.\n\nHow long does the registration process take?\n\nThe Ethereum Code registration process only takes about a few minutes. The verification will verify your details and send the confirmation mail immediately.\n\nIs Ethereum Code expensive?\n\nWhen we compare Ethereum Code with other trading systems, it is clear that the former is quite affordable. Users must not pay any charges or fees to use the platform. Only $250 is required to start trading.\n\nIs Ethereum Code available on mobile phones?\n\nYes. Ethereum Code is a web-based platform and can be opened on any browser on your mobile phone.\n\nVisit Ethereum Code"
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMi0AFBVV95cUxPR3dYSVc3SFhESDAzNVFJUThtbFhDNk1NS25hU19HTWRwUXc5OFJwSjA1UGZEcV9SSUNpenN4Q2tGekdNdm5tODRvdjI4aFU5c1ZwbTdGUll2SHpPNFlxUlpFbm03eUV3Wm9sRXNWSjV2TUVLdXVCaUd3cHlUQ0gzQXVJUXZTaXVMTWlwZjU0WEJjQUd6bUpoT3JvS0tHaUo1MFJJVTR0TkY4UnVyREtDSklvSVdDZnI2R0JEaDBndmp1cEFTeGVGa1ppQWhRc1NC?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jun 2024 07:00:00 GMT",
        "title": "Meme Coin Mom Vs. Ethereum Dad: Did Iggy Azalea Just Shade Vitalik Buterin? - Benzinga",
        "content": "Rapper and composer Iggy Azalea, who launched the MOTHER MOTHER/USD token on the Solana SOL/USD blockchain, recently took a jab at Ethereum ETH/USD co-founder Vitalik Buterin.\n\nWhat Happened: Azalea posted a meme depicting herself holding a baby with Buterin's face, along with the caption, \"he was just hangry (sic).\"\n\nHe was just hangry pic.twitter.com/AlTwEtfIKd — IGGY AZALEA (@IGGYAZALEA) June 5, 2024\n\nThis mockery came in response to Buterin’s critical remarks about the trend of celebrity meme coins, where he expressed his disapproval of the “financialization as a final product” premise driving many of these projects.\n\nCommenting on Azalea’s post, Hayden Adams, CEO of Uniswap UNI/USD said, “No issues with memecoins or celebcoins – I think there's value to memetic attention and it's cool to create markets for it. That said, the underlying purpose and value of the tech goes way beyond financial games. And the best builders in the space are motivated by positive social change. Iggy could have responded positively and used profits to donate to a social cause or something. Instead, she condescends the best builder in the entire space, proving his point.”\n\nAlso Read: Bitcoin Could Reach $150K By Year-End If Trump Wins: Standard Chartered\n\nOver the past week, the MOTHER token has experienced a dramatic surge, increasing in value by 1305.7% and reaching a market capitalization of over $200 million.\n\nThis significant growth highlights the ongoing fascination and investment in celebrity-backed cryptocurrencies despite skepticism from industry veterans like Buterin.\n\nWhat’s Next: These developments and their implications for the broader digital asset market will be key discussion points at the upcoming Benzinga Future of Digital Assets event on Nov. 19.\n\nIndustry leaders and experts will delve into the evolving dynamics of cryptocurrency investments and the impact of celebrity endorsements in this rapidly changing landscape.\n\nRead Next: Is Robinhood’s Crypto Exchange Deal Really ‘Massive’ And The ‘First Domino To Fall?’"
    }
]