[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxNY1ZuS3BaTnNuR3BxUkF2TGk5NXU5WjBPaE5JMXQxd1VJNlZHdlVSanlNbE5HVlBlUkVhYVRIRXJyODVNU2F4ZFZmZDVGMDMzQWJHNF9kZl85OUtoZ21pd2IzU0RQTzV4eFAwY3poNXIzYk5TalNmb2ZOdUhjeGdTMlZwM0tZM3R3OWhPYmRn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jul 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum, Dogecoin In Full Meltdown As Mt.Gox Moves $2.7B To New Wallet: King Crypto Decline To $51K Feared By Analyst - Yahoo Finance",
        "content": "Bitcoin, Ethereum, Dogecoin In Full Meltdown As Mt.Gox Moves $2.7B To New Wallet: King Crypto Decline To $51K Feared By Analyst\n\nThe cryptocurrency market bled profusely Thursday, as investors shuddered about the movement of billions of Bitcoin (CRYPTO: BTC) ahead of a probable sell-off.\n\n\n\n\n\nCryptocurrency Gains +/- Price (Recorded 8:30 p.m. EDT) Bitcoin (CRYPTO: BTC) -5.10% $57,248.99 Ethereum (CRYPTO: ETH) -6.78% $3,081.66 Dogecoin (CRYPTO: DOGE) -13.03% $0.1033\n\nRead Next:\n\nIf you invested $100 in DOGE when Elon Musk first tweeted about it in 2019, here’s how much you’d have today .\n\nAmid the ongoing EV revolution, previously overlooked low-income communities now harbor a huge investment opportunity at just $500.\n\nWhat Happened: Bitcoin nosedived to the $57,000 zone, its lowest since Feb. 28. Since the beginning of this week, the world's largest digital asset has slumped 9.5%, nearly 21% down from its all-time high clocked earlier this year.\n\nThe second-largest cryptocurrency, Ethereum, also crashed to a six-week low, erasing all the gains made since the hype of spot ETF approvals in mid-May.\n\nThe sell-offs were precipitated by the movement of 47,228 Bitcoin, worth $2.7 billion, by defunct cryptocurrency exchange Mt. Gox from a cold wallet to a new wallet, possibly in preparation for payouts to its creditors.\n\nThe slump forced the largest wave of liquidations since mid-April, as $541.45 million in future contracts was wiped out in the last 24 hours. Long liquidations accounted for a whopping $472 million.\n\nBitcoin's Open Interest plunged 7% in the last 24 hours. A fall in price, coming alongside a fall in OI, is viewed by some analysts as a good sign because they think the downtrend will end once all long sellers have closed their positions.\n\nTrending: 1 in 4 Americans own a share of Bitcoin according to NASDAQ, how many people got started through this free crypto faucet?\n\nThe Cryptocurrency Fear & Greed Index flashed a \"Fear\" signal, implying that investors were bearish on the market prospects. But such conditions also provide buying opportunity for bold dip buyers.\n\nTop Losers (24-Hours)\n\n\n\n\n\nCryptocurrency Gains +/- Price (Recorded at 8:30 p.m. EDT) Core (CORE) -20.89% $0.9702 ORDI (ORDI) -17.83% $29.62 Beam (BEAM) -17.26% $0.01385\n\nThe global cryptocurrency market cap stands at $2.09 trillion, following a 6.06% fall in the last 24 hours.\n\nStock futures traded flat Thursday night. The Dow Jones Industrial Average Futures is up 0.08%, as of 9 p.m. EDT. Futures tied to the S&P 500 gained 0.01%, while Nasdaq 100 Futures slipped 0.03%.\n\nMarkets will open on Friday after the Fourth of July break. Investors have now set their eyes on the release of June jobs data.\n\nStory continues\n\nSee More: Best Cryptocurrency Scanners\n\nAnalyst Notes: Widely followed cryptocurrency analyst Ali Martinez sounded a bearish alarm, with more potential downsides to follow for Bitcoin.\n\n\"Bitcoin closing below $57,000 could spell trouble, with potential support only at $51,000,\" Martinez stated.\n\n\"If BTC can break past this level, the next significant target is $78,700,\" Martinez explained.\n\n\n\n\n\nOne of the most crucial resistance areas for #Bitcoin is $65,795. If $BTC can break past this level, the next significant target is $78,700! pic.twitter.com/tcxTJlKUo3 — Ali (@ali_charts) July 2, 2024\n\nIn a positive forecast, popular analyst Rekt Capital highlighted the possibility of King Crypto peaking around mid-September or mid-October 2025.\n\n\"The longer Bitcoin consolidates after the Halving, the better it will be for synchronizing this current cycle with the traditional halving cycle,\" the trader opined.\n\n\n\n\n\n#BTC\n\n\n\nIn the 2015-2017 cycle, Bitcoin peaked 518 days after the Halving\n\n\n\nIn the 2019-2021 cycle, Bitcoin peaked 546 days after the Halving\n\n\n\nIf history repeats and the next Bull Market peak occurs 518-546 days after the Halving...\n\n\n\nThat would mean Bitcoin could peak in this cycle... pic.twitter.com/bg6GjkvLlW — Rekt Capital (@rektcapital) July 4, 2024\n\nRead Next:\n\nElon Musk and Jeff Bezos are bullish on one city that could dethrone New York and become the new financial capital of the US. Investing in its booming real estate market has never been more accessible.\n\nGen Z and Millennial millionaires couldn't care less for stocks and bonds — Here's what they're buying instead.\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nGet the latest stock analysis from Benzinga?\n\nThis article Bitcoin, Ethereum, Dogecoin In Full Meltdown As Mt.Gox Moves $2.7B To New Wallet: King Crypto Decline To $51K Feared By Analyst originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiZkFVX3lxTE1udjRBTENJUnJKbnE0NjUzMkdIekpTZnV0OU4xeHdTTmJOb0xrTi1nRVJ0amtBajNFeC1haUlvMWpoUlM1bExqU1ZycVFWUlRWUm5xYWJVa2dOYVJTcmVYYWVTeFRWUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETF, Uniswap V4, and Cardano are major crypto catalysts in Q3 - Crypto Briefing",
        "content": "Ethereum ETF, Uniswap V4, and Cardano upgrade aim to enhance market accessibility and efficiency in Q3.\n\nKey Takeaways Ethereum ETF launch expected to attract institutional investors in Q3 2024.\n\nCardano's Chang hard fork aims to implement decentralized governance by July's end.\n\nShare this article\n\nThree major catalysts are set to impact the crypto market in Q3 2024, according to the latest edition of IntoTheBlock’s newsletter “On-chain Insights”. The events include the trading start of spot Ethereum (ETH) exchange-traded funds (ETF) in the US, the Uniswap V4 release, and Cardano’s Chang hard fork.\n\nThe Ethereum ETF is expected to launch this quarter, potentially attracting institutional investors. Analysts at IntoTheBlock predict ETH ETF inflows could reach 30% of those seen during the Bitcoin ETF introduction, which saw $5 billion in net inflows over its first five months.\n\nSpot Bitcoin ETF inflows. Image: IntoTheBlock\n\nAs reported by Crypto Briefing, asset management firm Bitwise’s CIO predicted that Ethereum ETFs could attract $15 billion by the end of 2025.\n\nUniswap, the largest decentralized exchange by total value locked, plans to release its V4 version. This is the second development in crypto seen by IntoTheBlock analysts as a potential catalyst for prices in Q3.\n\nNotably, the V4 update introduces “hooks” for customization, dynamic fees, on-chain limit orders, and time-weighted average market maker functionality.\n\nCurrent profitability of UNI holders. Image: IntoTheBlock\n\nMoreover, Cardano aims to implement the Chang hard fork by the end of July, introducing decentralized, community-run governance. The Chang upgrade will proceed once 70% of stake pool operators have tested and updated their systems.\n\nThis is also a development in crypto that could boost prices in this quarter, the analysts pointed out.\n\nThese developments follow historical trends of catalysts boosting asset values. During the month leading up to Cardano’s last hard fork in September 2021, ADA’s price increased by 130%, rising from $1.35 to $3.10.\n\nThe On-chain Insights newsletter also mentions the application for a Solana ETF made by Bitcoin ETF issuers VanEck and 21Shares, further expanding institutional crypto access. Although it is unlikely to get approved in 2024, much less in Q3, this movement could boost investors’ sentiment."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxQQ01zVW42bGFtRVN1NGxMRHRSZ2I5WDZ0akpvaGNMaVN0RWtJcEJiX0pqSW40M0lsbGEwRDBpTy1kZDlfSXVRSjM4dmFSbjBramIwYzZLN3BSZVlEQmlucnJpd1k2OUcyb01sdTFQakVUNFpMdlBYMmdBUHBUSXhQdTJadkU2SlI3bk5WRXNDRFhOMHVQdlltbldIWQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jul 2024 07:00:00 GMT",
        "title": "Ethereum staking ETFs will hit Hong Kong in six months — and the financial hub won’t stop there - DLNews",
        "content": "Hong Kong could launch Ethereum staking ETFs within the next six months.\n\nOther crypto products, like a Uniswap ETF or Chainlink ETF, may follow.\n\nThe Bitcoin and Ethereum ETFs launched in April have been warmly received by Hong Kong’s financial sector.\n\nEthereum staking exchange-traded funds are coming to Hong Kong — it’s just a matter of time.\n\nThat’s according to Vivien Wong, partner at HashKey Capital, a crypto asset management firm that played a vital role in getting Hong Kong’s spot Bitcoin and Ethereum ETFs off the ground.\n\n“As soon as spot Ethereum ETFs were approved in the US, people ran to us asking, ‘are you planning to launch an Ether staking product?’” Wong told DL News.\n\nShe said regulators, like Hong Kong’s Securities and Futures Commission, were talking with the industry.\n\n“Last month, I sent a message to regulators to say there was a need for Ether staking,” Wong said. “Without hesitating, they said ‘okay, please send a detailed proposal.’”\n\nThe timing of her comments is notable.\n\nNine spot Ethereum ETFs are expected to launch in the US any day now, as soon as the Securities and Exchange Commission finalises applications.\n\nStaking Ethereum ETFs\n\nEthereum is designed so users can choose to lock in their Ether holdings and earn a 3% yield on the asset — a process called staking.\n\nJoin the community to get our latest stories and updates\n\nWhile spot Ethereum ETFs enable investors to easily get exposure to Ether through their brokerage accounts, they don’t allow them to gain that extra yield.\n\nIn fact, in Hong Kong, holders of these ETF shares must pay a management fee that’s anywhere between 0.3% and 0.99%, depending on the fund they choose.\n\n“For a new Ethereum product to launch, it will probably require another six months or so,” Wong said.\n\nWaiting for the mainland\n\nHong Kong is so keen to offer products that don’t yet exist in the US, because the government wants the city to become a fintech powerhouse, according to Wong.\n\nAnd the process is running “pretty smoothly,” she said.\n\nAlready, the existing crypto ETFs are attracting two types of investors: People who simply want to “buy and hold,” and crypto natives, Wong said. Crypto natives, in particular, have been enticed by the ETF design.\n\nThe funds’ timely creation and redemption process allows investors to use them for over-the-counter trading purposes, according to Wong.\n\nBut by taking the lead and offering advanced products, the hope is for Hong Kong to draw in investors from other jurisdictions — and even, eventually, from the mainland.\n\nMainland investors cannot currently invest in these products. But hopefully, if the regulatory situation changes, “there will be more endorsements from investors in China and we will see more inflows,” Wong said.\n\n”We are waiting for that to open up this market,” she added.\n\nMassive success\n\nHong Kong’s crypto ETFs have hauled in almost $260 million in assets since they launched in April, per The Block data.\n\nCompared to spot Bitcoin ETFs in the US — which have brought in $14.6 billion since January 11 — that might feel small.\n\nBut considering that Hong Kong’s ETF market is 168 times smaller than its US counterpart, the products have been a massive success. “There is definitely excitement,” Wong said.\n\nWhether its financial institutions, wealth managers, distributors, or high net-worth individuals, the entire Hong Kong market is slowly digesting the products and becoming more comfortable with them, she said.\n\nIt wasn’t a guaranteed win.\n\nOpinion about crypto had soured in the region after some of the scandals from the last bear market — notably the fraud case surrounding Hong Kong crypto exchange JPEX.\n\nUniswap ETF?\n\nWong said that other cryptocurrencies will possibly have their own ETFs someday, but none of the choices are obvious, she said.\n\nFor Hong Kong regulators to approve new crypto ETFs, the underlying token must be publicly tradable through registered virtual asset trading platforms.\n\nAnd it must be very liquid, meaning that it must be easy for deep-pocketed market participants to trade.\n\nHaving a robust use case doesn’t hurt either.\n\n”ERC-20 tokens would be generally preferred,” Wong said, referring to tokens issued on the Ethereum network. “Some names like Chainlink or Uniswap.”\n\nAnd a Solana ETF might be in the cards as well.\n\n“We are talking with the SFC right now,” Wong said. “We are getting on with launching new products.”\n\nUpdate: The piece was modified to clarify that investors from mainland China will only be able to invest in the ETFs when Chinese regulation allows it.\n\nTom Carreras is a markets correspondent for DL News. Got a tip about Hong Kong and crypto ETFs? Reach out at tcarreras@dlnews.com."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMi2wFBVV95cUxNVWRaUUJhSExpdm9pbldtaVBSR21xMjc1MXozLW5mLTVyZ0lJWXJOVFdOY1RuYTFPV1ZRQjdfUjZKYURuV2tmbFhlYUJBVTFNWDFCTWVFUTQ3VFk3N2J1amdVN3BUZTRldXFfQ29ObDVVZ0RQdHlsRWlpQ2VMYnVKeDBqV3dBV3NNWk81VlcyV1p1T3FoaWU4SkFxbDBiejc2YldPYjVVVURiSkdSZXlDd2g4OUY2R3pEWHJRTUpLcWoweVVzZ1QwZ1V3SVhiak9HSmtySGlsbUpmTEnSAeABQVVfeXFMTUkyLVVTb0NaUmVSaExMNHk2dE1sOXhaWWl3amx6OHNFY3dfYmxpMEZxMmRtTl9oMmJXaGp3OUZfZHZJLVE1X01lX19qZURPejVvVktELWFqRzlWcTMzdllHbEpPSVZQR2ZWbG1DVUhEUmtnN1dDWDVXdGdZN1BXc1VpNUF3YXRYNjFWT2tPRFlqeDVqUXBHb2QtUHJFTm05WmtZTWFTZlZEUTNnRzhpbzNoS29pMXFfRWk2dTMtaUw3TldiSW1Hc2VSOGRFc2ZXLTNGQ3Q4RG1uT0FoZkdGN04?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jul 2024 07:00:00 GMT",
        "title": "Ethereum records another day of heavy liquidations as Mt. Gox bearish pressure persists - FXStreet",
        "content": "Ethereum sees over $108 million in liquidations as Mt. Gox begins repayment to creditors.\n\nGrayscale Ethereum Trust switched to trading at a premium to net asset value as spot ETH ETF launch draws closer.\n\nEthereum may begin consolidation as key support may prove crucial in coming days.\n\nEthereum (ETH) is down nearly 5% on Friday following the Mt. Gox BTC repayment, sparking more than $108 million in ETH liquidations. The repayment's supply strengthened the bearish momentum on Bitcoin, which spiraled into altcoins like ETH.\n\nDaily digest market movers: Mt. Gox headwind, ETHE discount\n\nThe defunct exchange Mt. Gox began the repayment of creditors today after transferring about $84.87 million worth of BTC to Japanese exchange Bitbank's hot wallets. The move increased the prevailing bearish sentiment in the crypto market as altcoins, led by Ethereum, suffered significant declines.\n\nWhile many expected ETH to be less affected by the wider market sentiment due to the upcoming spot ETH ETF launch, the Securities & Exchange Commission's (SEC) slow move to greenlight issuers’ S-1 drafts likely gave bears the momentum.\n\nThe SEC approved the 19b-4 forms of spot ETH ETF issuers on May 23 but needs to greenlight their S-1s before the products can begin trading. The prospective issuers include VanEck, BlackRock, Bitwise, Grayscale, 21Shares, Fidelity, Franklin Templeton and Invesco.\n\nMeanwhile, the Grayscale Ethereum Trust (ETHE) switched from trading at a discount to net asset value (NAV) to a premium of about 0.31% on July 3, according to data from YCharts.\n\nA trust trading at a discount or premium to net asset value means one share of the trust trades below or above the market price of the underlying asset it tracks.\n\nETHE Discount or Premium to NAV\n\nETHE has been trading at a discount because investors must sell their shares to exit their positions, as the trust doesn't allow them to redeem it for cash. The discount particularly increased between March and May after rumors of the SEC's Ethereum 2.0 investigation.\n\nHowever, the gap has closed and is now at a premium as investors bought the discounted shares heavily following the SEC's approval of prospective issuers' 19b-4 filings. The $9.5 billion ETHE trust will convert to an ETF when spot ETH ETFs go live.\n\nETH technical analysis: Ethereum may begin consolidation\n\nEthereum is trading around $2,984 on Friday, down nearly 5% in the past 24 hours. The further decline from Thursday's lows sparked historic liquidations for ETH, wiping off $134 million of open positions from the market. Long liquidations climbed to $108.4 million, while shorts were shy of $26 million.\n\nETH's price has reached the lows of May, when most investors expected a spot ETH ETF denial following reports that the SEC was investigating Ethereum 2.0. ETH broke below the $2,852 key support level but quickly posted a weak exhaustion liquidity void, considering this represents a key demand zone for the top altcoin.\n\nETH/USDT 8-hour chart\n\nETH has failed to sustain an extended move below this support level since mid-February. Additionally, IntoTheBlock's data reveals investors purchased about 57.02 million ETH around the $2,268 to $2,909 price range.\n\nConsidering these factors, ETH may not sustain an extended decline below the $2,852 support as the weekend approaches. ETH will likely begin a horizontal trend around the $2,852 to $3,367 price range, where it traded for nearly five weeks (April 12 - May 19)."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxOdHhvUnZ0b2lLOE5vVnpTM0VMdVlJaTdDQUJfRU9GRDE3UXJPbnZTT0lpM2FiaFlMNWlaSTdwLXZyMVNqS2hudkhPMmlkWmwxV1ljY2dNZkhLNEdGTDRueW5KOTNyM3NpYzIzNWZoeUxkWGZvc0xTcFNvWUs4ZFRwSl9hbVhxb3JmMXhScEVmUGdHREdYU0gwaUxB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Price Prediction as ETH Drops to $2,900 – Time to Buy? - The Tech Report",
        "content": "Why Trust Tech Report Tech Report is one of the oldest hardware, news, and tech review sites on the internet. We write helpful technology guides, unbiased product reviews, and report on the latest tech and crypto news. We maintain editorial independence and consider content quality and factual accuracy to be non-negotiable.\n\nThe cryptocurrency market has lost almost $800 million in the last three days. BTC is now below $60,000, representing a drop of 4.2%. Ethereum ETH is trading at $2,933, a loss of 6.56% over the last 24 hours. This drop is likely attributed to the massive German sell-off and Mt. Gox saga.\n\nAccording to a report, the German government has sold about $434.9 million worth of BTC since June 19. Unfortunately, this move brought negative sentiment in the market. Can ETH’s price bounce back amid this declining market?\n\nEthereum (ETH) Price Action\n\nETH’s price tried multiple times to break above $3,900 but failed as strong bearish momentum pushed it lower. On July 4, ETH hit a strong support level at $2,800, representing a 28.2% drop from the $3,900 level.\n\nCurrently, ETH is recovering slowly, trading above $2,900. However, the overall market sentiment remains bearish. Analysts warn that this recovery might be short-lived, and the bearish trend could continue, pushing ETH lower again.\n\nBased on that, the $2,800 level will be crucial in determining ETH’s next move. If this support breaks, we could see further drops. On the other hand, a strong bounce could signal a trend reversal.\n\nTechnical Indicators Signal Bearish Market\n\nETH’s technical indicators are predominantly bearish. The 50-day and 200-day Simple Moving Averages (SMAs) hover above the current market price. This positioning typically signals a strong downtrend, as the price is trading below the key long-term averages.\n\nAlso, the Price Volume Trend (PVT) indicator sits at 88K, suggesting decreasing buying pressure. This metric contributes to the downward price movement.\n\nFurthermore, ETH’s price is trading below the Bollinger Bands, indicating that the downward trend is strong and may continue.\n\nAlso, the Moving Average Convergence Divergence (MACD) is below its signal line, while the histogram bars display red candles. This typically signals ongoing selling pressure and reinforces the bearish outlook.\n\nThe SuperTrend indicator is flashing a sell signal, suggesting that the current downtrend may persist in the near term.\n\nLastly, the Relative Strength Index (RSI) currently stands at 27, indicating oversold conditions. While this might suggest a potential bounce, note that assets can remain oversold for extended periods.\n\nGiven this overwhelmingly bearish technical analysis, investors might consider waiting for clear reversal signals before entering long positions. Also, remember that markets can change rapidly at any time.\n\nPeter Schiff Predicts Ethereum Crash to $1,500\n\nEarlier today, renowned economist Peter Schiff predicted that Ethereum could crash to $1,500 based on market factors and technical analysis. Schiff sees Ethereum breaking crucial support regions, which usually signals a further decline in price as the buying strength is low.\n\n#Ethereum is also breaking key support. It’s trading below $2,900, down 30% from its March high. I think a crash down to $1,500 is coming. It looks like those buying the #Ether ETF rumors couldn’t wait for the fact to sell. pic.twitter.com/XXEyX67BXK — Peter Schiff (@PeterSchiff) July 5, 2024\n\nMoreover, Schiff believes the anticipated Ethereum ETF launch is overhyped. Schiff claims the ETH ETF hype will ultimately fail soon. According to him, investors are selling off their positions since the price didn’t go as expected.\n\nUnfortunately, Schiff’s $1,500 prediction may create fear, uncertainty, and doubt (FUD) among investors as they worry about the market’s future. The crypto market is not doing well right now. Most cryptocurrencies, like Ethereum, are losing value.\n\nEven if the U.S. SEC approves ETH ETFs, people might react differently to them because the market is already struggling. So, to be on the safe side, it is best to wait for the market to cool off before investing with proper risk management techniques in place.\n\nSecondly, while the broader crypto market is down, investors can consider a new memecoin on presale, which offers an opportunity to buy low and sell high.\n\nWienerAI: A Promising Alternative to Ethereum in a Bearish Market\n\nThe new project called WienerAI is gaining attention and has raised over $7 million in its presale. WienerAI combines humor with advanced technology. It offers an AI-powered trading bot on the Ethereum blockchain.\n\nThis bot helps users make better trading decisions and protects them from front-running bots. The project has an interesting story involving a mix of AI and a dog.\n\nAdditionally, WienerAI focuses on building a strong community called “The Sausage Army.” WienerAI offers high staking rewards, and holders of WAI tokens can earn substantial returns.\n\nFurthermore, the project has solid tokenomics with a clear allocation plan. Crypto influencers are already talking about WienerAI’s potential, highlighting its innovative features and engaging branding.\n\nAs a result, more investors are showing interest in the project.\n\nWienerAI’s Advantages in the Current Market\n\nWhile Ethereum struggles, WienerAI’s presale is thriving. It has already raised over $7 million. This shows strong investor confidence in the project.\n\nThe team behind WienerAI has a clear roadmap. They plan to list the token on major exchanges soon, which could increase its visibility and value.\n\nWienerAI’s AI-powered trading tool sets it apart from other cryptocurrencies. It promises to enhance trading efficiency and accuracy. This feature could attract traders looking for an edge in the market.\n\nAnother advantage is the project’s community-centric approach. It fosters engagement and loyalty among its users, which could lead to long-term support and growth.\n\nAnalysts believe WienerAI has the potential for a 100X return on investment, making it an attractive option for investors seeking high rewards.\n\nIf you want to join a new crypto project while it is still affordable, rush to the presale page now and grab as many coins as possible.\n\nDisclaimer: The opinions expressed in this article do not constitute financial advice. We encourage readers to conduct their own research and determine their own risk tolerance before making any financial decisions. Cryptocurrency is a highly volatile, high-risk asset class.\n\n🔎Looking for the next 10X crypto?\n\nCheck out the best crypto presales to invest now"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxQQ1JJTFBQeHBOeG1zU2pNSm9qLXF4Z043VUJ0aldXb0ZiZUl5ZlVvdTdQZmVYZ3FWSF84aHpLa1QzMVZJcExlZ0dHR3Rral9IWVJEdUw4a0lSUFVVYTVvTEdWS1J0cGtZZ2J2bGE3aFFhV1pjNm9sMjFqdDMyX2tMRzdjamNybnc3Vy1XV0prRWRoaWVkYk1XRTFB0gGfAUFVX3lxTFBaSnJaRkVxSHlCUjBnR21VX0FnTU5yYzZRdk1WUzNiUkpJNVhfU1ZZei1Bc1Vvb3U2WnFES2NsakJ2MlIxQUduUHJORFhYeHF6Xzg4dmhPY0V2MEZiRkprTVlZMXJiMlcyUGNRR1JnMHNfOUpkTGVQRFFGY2dxdmZMVlFkTHh0MTh0b1dweFFXVC1FbG1kZ0V0aVRjYjZfUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Price Forecast: Will ETH Crash Hit $2,500 Before Spot ETF Trading? - CoinGape",
        "content": "Ethereum Price Forecast: The intense selling pressure impacting most cryptocurrencies has been caused by various factors including the German Government’s Bitcoin selling spree and a colossal transfer of BTC to exchanges by Mt. Gox, a defunct cryptocurrency exchange.\n\nInvestors appear worried as a major correction paints price charts in the cryptocurrency market red in July. Collectively, the market has in the last few months tumbled to $2 trillion from $2.8 trillion—a milestone achieved in March.\n\nadvertisement\n\nLike most cryptos, Ethereum could not withstand the increasing pressure on the sell side. The second-largest digital asset extended the correction below the critical $3,000 level.\n\nEther is down 7% to $2,940 on Friday in addition to 16.5% in the last seven days, CoinGecko data shows. Nonetheless, the trading volume has surged by almost 60% to $30 billion, underlining a dramatic increase in selling activity.\n\nEthereum Price Forecast: Is the Dip a Buying Opportunity or Trap?\n\nDespite the upcoming approval of Ethereum ETFs, bearish sentiment continues to swell. Investors thought the up rally to $3,975 in June marketed the beginning of a long-term bull run but it has in the last few weeks proved to be a trap.\n\nThe Securities and Exchange Commission (SEC) is currently reviewing individual Ether ETF applications ahead of the live trading. However, headwinds in the market are leaving no stone unturned while turning crypto portfolios upside down.\n\nWhile the actual trading of Ethereum ETFs would be a game changer, especially for altcoins eyeing a similar milestone, the ongoing dip has many worried about how far it can go.\n\nBased on the Ethereum price prediction, the token of the smart contracts now holds below all three key Exponential Moving Average (EMAs) including the 20-day, the 50-day, and the 100-day.\n\nChances are that the downtrend will continue into the weekend, considering the Relative Strength Index (RSI) persistent drop.\n\nShould sellers intensify their activities, Ethereum might breach a previously tested support at $2,800, highlighted in black on the chart. Such a move could further destabilize ETH price thus accentuating the sell-off to $2,500.\n\nThe Money Flow Index (MFI) an indicator that tracks the flow of money in and out of Ethereum markets, shows signs of bottoming out above the oversold region.\n\nIf selling pressure equalizes buying pressure, ETH will start to move sideways, giving recovery a chance in the coming days.\n\nA potential double-bottom pattern from support at $2,800 could also influence the trend reversal. The last time Ethereum price tested this support area, a major upswing erupted to $3,975.\n\nIn the short term, traders can watch out for the reclamation of support at $3,000 where, ETH could consolidate awaiting the next catalyst, possibly the spot ETF approval to ignite a major rebound past $4,000.\n\nFrequently Asked Questions (FAQs) 1. Is the Ethereum blockchain the same as Bitcoin? Although they are both cryptocurrencies, ETH and BTC do not share the same blockchain technology. Ethereum is a proof-of-stake protocol while BTC is a proof-of-work network. 2. Can Ethereum topple Bitcoin to become the biggest crypto? Possibly, but considering Bitcoin’s dominance in the market, this achievement would take a long time. 3. When will Ethereum ETFs start trading? ETH ETFs could start trading 3 days after the final S-1 filings. This is projected to be around mid-July.\n\nRelated Articles\n\nJohn Isige John is a seasoned crypto expert, renowned for his in-depth analysis and accurate price predictions in the digital asset market. As the Price Prediction Editor for Market Content at CoinGape Media, he is dedicated to delivering valuable insights on price trends and market forecasts. With his extensive experience in the crypto sphere, John has honed his skills in understanding on-chain data analytics, Non-Fungible Tokens (NFTs), Decentralized Finance (DeFi), Centralized Finance (CeFi), and the dynamic metaverse landscape. Through his steadfast reporting, John keeps his audience informed and equipped to navigate the ever-changing crypto market.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxQNmV5aVBpa2J1MW5vdy1feVNUUUwyUGxfUmd0MmtBSlNKU2kzdS1fRjkzU2FyRFVBdTNnZUpVMmxfOWczb3JqZERFVkxta2M3QkRfaVViS3NTQUFHUkhLRi0zWWRLeVE1SWhJbHhYMm5NUHRzQTRlQlFpYm4zRk4yeTBrUVprN2ZWOE5nZ09OOC1lY09YUFZmVHFuZ0N4NVpLZXdGWTEtZXBKdU9keWJYaVVTcF9nRzA2RzBkendFdlRFQVUtMkVlS3J2bWRPOURCU0Yya3BOR2HSAd4BQVVfeXFMT0VISHVNOUJ2NDJGRjR4VlVrTm9TX2FHQ01mMGtKWlY0dzZwdUFLV2dnSG1yQVVPODQ0amlFdnVVaWJ2Z1V2cDZkMXRSNjFoT1oxa01FSFZJVHpDTi1oaGZwakE4VkdiSzBrUDZIcTViRExra3JfbDR2QjdtV0ltVE9tWmc3Vm95YWt1NDdoU2VUdTd4Z28xR0ZDZEFHSzMtQ19ySlJNZjdjU1NsNGNPeVFzMTcyODhHRWVWT0VOV2RVT1VGNy1ZNFE3VU4tU0ZFTmh0NFFXNzhRVG1QSE93?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Ecosystem Suffers $400,000,000 in Losses Year-to-Date, Amount of Crypto Hacks Rise by Over 50%: SlowMist - The Daily Hodl",
        "content": "New research from cybersecurity firm SlowMist reveals that the Ethereum (ETH) ecosystem has lost $400 million in exploits year-to-date as the number of crypto hacking cases sees a 50% rise.\n\nAccording to SlowMist’s 2024 mid-year report, the second largest digital asset by market cap saw the most funds lost due to exploits as an ecosystem, followed by layer-2 scaling solutions Arbitrum (ARB) and Blast.\n\n“From an ecosystem perspective, Ethereum suffered the highest losses, amounting to $400 million. Followed by, Arbitrum incurred losses of $72.46 million, and Blast suffered losses of $70 million.\n\nAdditionally, Binance Smart Chain (BSC) experienced the highest number of security incidents, totaling 57, with losses of approximately $32.12 million.”\n\nThe firm says that based on its research, the digital assets industry saw a total of 223 security incidents during the first half of 2024 that resulted in a combined $1.43 billion worth of losses. The figure represents an increase of more than 50% from the $920 million lost during the first half of 2023.\n\nSlowMist goes on to note that decentralized finance (DeFi) is the most attacked sector in crypto, comprising nearly 71% of all incidents in the first half of the year.\n\n“From the project track perspective, DeFi is the most frequently attacked area. In the first half of 2024, there were 158 DeFi security incidents, accounting for 70.85% of the total incidents, with losses amounting to $659 million.\n\nCompared to the first half of 2023 (111 incidents with losses of approximately $480 million), this represents a 37.29% year-on-year increase in losses.”\n\nAccording to SlowMist, the top two causes of exploits were contract vulnerabilities and exit scams, which accounted for 56 and 50 incidents, respectively.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxOX0VPS1ZJODBPMXN3Mms5T05zM1lRZmJFSGlydmRVZE9GRnFoRi1wZUZBVHVLU2JqZjFPY0duM0NjTUU0ZDl3TXZIbnNpZFB3WVU5cHAwS1FBNEpTT0tqWjdRNnZaY2VvWHBpM2pxWGExZnNGRnZvSnNVV0xDS0FxNXJ3NjEwelRjM18xRi1n0gGTAUFVX3lxTE5iNzlVLVhWaWlaNkhJZFJCR05ETGFwd2djUTZjek9aSGpuWE94clYxRkpHc21uMVlDdXJPX0p4eG1pbVEyaVJjZ0VhNmF0ZGc5NGRxVXFYUzlvWkp3YVdYNnhhclB0NVljRGNBOWFvX3I2VGx0Zzl4TmtLTGpuaGkwa2N5NlpLYVQ5blJ0ZjFnX3l6VQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 Jul 2024 07:00:00 GMT",
        "title": "ETF Heavyweight Franklin Templeton Unveils Bullish Report on Ethereum - U.Today",
        "content": "Advertisement\n\nFranklin Templeton, a veteran wealth manager with over $1.65 trillion in AUM, shares its bullish take on Ethereum (ETH) as a tech development and economic instrument. Despite savage competition, Ethereum (ETH) remains the backbone of decentralized economy and constantly unlocks new opportunities for the community.\n\n\"Forefront of Web3 innovation\": Franklin Templeton praises Ethereum\n\nGlobal asset management heavyweight Franklin Templeton released its \"Understanding the Value of The Ethereum Network\" report covering the tech impact of the second cryptocurrency. It displays the most important features of the Ethereum (ETH) blockchain, its challenges and opportunities.\n\nImage by Franklin Templeton\n\nThe analysts of the investment giant stressed that Ethereum advanced Bitcoin’s accomplishments to create a robust and accessible tech basis for distributed ledger applications, enabling a comprehensive decentralized economy.\n\nAs the next step, the onset of the Ethereum Virtual Machine (EVM) and its Solidity smart contracts has changed the narrative in app development, making Ethereum the foundation for a wide range of decentralized applications across various segments in B2B and B2C.\n\nAdvertisement\n\nThe report particularly highlights the scaling role of Layer 2 networks in pushing the barriers of Ethereum (ETH) performance metrics and decentralization status:\n\nCollectively, L1 blockchains (Ethereum and others) and L2 blockchains provide the foundations for “Web3,” the new iteration of the World Wide Web (WWW) that enables users’ WWW ownership. The Web3 business models that have emerged are paving the way for a new type of network economy and approach to commercial transactions, creating a protocol-based economy that encourages democratized ownership and rewards participation\n\nAs a result, Ethereum (ETH) managed to establish a vibrant, diversified protocol economy with a diverse array of novel use cases in DeFi, GameFi, NFT, metaverse and other trending segments.\n\nEthereum ETFs: Final call?\n\nAuthors concluded that Ethereum (ETH) stands out as unique combination of a native peer-to-peer payment network, a common developer toolkit and a virtual machine for executing smart contracts that has set a new standard for blockchain technology.\n\nIt should be added that Franklin Templeton is a participant of the Ethereum spot ETF race in the U.S. It filed with the SEC for an ETF approval in February 2024.\n\nAs covered by U.Today previously, major analysts and community participants are sure that Ethereum spot ETFs will be green-lit as soon as this month.\n\nThe final approval of S-1 forms is expected to happen by July 12, said The ETF Store president Nate Geraci. Potentially, this hints at ETF trading launch following on July 15."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxQNDUxOElQMUNlcVI2WVFPQU05bnNPeGhsRm0yVFZERW9NWFRzaWdKdnRzUVVHbUpPZXBiUmJLOEcxcTRCTnoyaEpTR3BHN3hSOE1kMjJ1dndtTmJCdmFBYlE5Y2FWcXJ3QnQ2TUNFcHpxRXM5eU1rV1NHYnBlT1NFa3pFSk5OQTJXeEpORFBKYWJ3T0xWM3dTR2JWeUlUOVhqRG0wUkRmRXJJSjlUbzdMMTFqQXkzVDhCc1pqckJLUnVPUm5NX1FXT1Q2ODhTc2V2RG5sZ9IB2gFBVV95cUxQN2RSSWs2dUdsOFdpQ1lLaVU2dmtiZjNKVHZmVGxmVU1lR0FIVExlU29Fc0dRSld0RE4zRE5TTER5SWkxRGZYMlVyOFhraUpLSTA3RVQyZUctNU0wV0JFZTlLbW9HMjhzdXNBTnRScHZwdGxUQUFaQ0MzNGh3RkwzdkZ6UnA4RUZkd3ZRd0tac2pxeU9FbGZ4OC00YnZLTFNJY1d0UFI4LVpxSlp1Y0pkTmxxN1FmQjUtZmxyb1ZkMFgxdkVKQnJFcjgtMlVsdE1tZk0wNXYtcW9uZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jul 2024 07:00:00 GMT",
        "title": "$2,728,000,000 in Fees Generated by Ethereum Blockchain Annually, Over 5x Above Closest ETH Rival: Lookonchain - The Daily Hodl",
        "content": "Leading smart contract platform Ethereum (ETH) generates far more revenue from fees per year than any other blockchain.\n\nNew data from crypto tracker Lookonchain reveals that the top altcoin earns $2.728 billion in fees per year, or more than 5x its closest rival, Tron (TRX), which earns $459.39 million annually.\n\nEthereum also earned just over twice that of Bitcoin (BTC), the top crypto asset by market cap, which came in at $1.3 billion during the same time frame.\n\nOther top fee-generating chains analyzed by Lookonchain include smart contract platform Solana (SOL) with $241.29 million in revenue per year, Binance Smart Chain (BSC) with $176.56 million, and layer-1 blockchain Avalanche (AVAX) with $68.83 million.\n\nFurthermore, ETH layer-2 scaling solutions zkSync Era, Optimism (OP) and Polygon (MATIC) came in with $59.77 million, $40.4 million and $23.91 million, respectively.\n\nEthereum users pay gas fees paid in ETH and denominated in gwei to successfully conduct transactions and execute smart contracts on the Ethereum blockchain. Gas fees depend on the supply, demand and network capacity.\n\nAccording to Ethereum data tracker Etherscan, the current leading gas guzzler is decentralized exchange (DEX) protocol Uniswap (UNI), which has consumed 129.17 ETH worth $401,815.53 over the last 24 hours.\n\nCurrently, the average gas fee on the Ethereum blockchain is 6 gwei, or $0.39, according to Etherscan.\n\nEthereum is trading for $3,119 at time of writing, a 5.4% decrease during the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE5heW5TbFVoQnlNZWVFWmlYa0s4a2FBVnUxczh2ZVVHbE9YM2hDQXJZQVlacW9ITGxjVVRjSTRyR0NtSUJYaTV4OGNEVkkxRzIyZXZmZG00alh3Z2JqMm5mbjFpUDNOeko0QnplN2JrTGNNS0pBX2Zr?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETF approval: What it means for investors and the crypto market - Verdict",
        "content": "The US Securities and Exchange Commission (SEC) has approved an Ethereum exchange-traded fund (ETF), the second cryptocurrency to have an ETF approved in the US.\n\nLaunched in 2015 with the vision of being a “world computer”, Ethereum has gained interest from tech enthusiasts and investors alike, growing to a market cap of $350bn.\n\nAn exchange-traded fund, or ETF, is a type of investment that tracks a particular index, sector, or commodity that can be traded on a stock exchange like a regular stock. ETFs make it easier to gain exposure to cryptocurrencies. By investing through an ETF, investors avoid the complexities of holding crypto; like securing private keys or dealing with disreputable cryptocurrency exchanges.\n\nThe approval of a second cryptocurrency ETF in the US signals greater acceptance of the asset class and increasing regulatory clarity. Greater access combined with increasing regulatory clarity is likely to drive an increased demand for Ethereum.\n\nThe chart above shows the subsequent price rise of gold following the listing of the first gold ETF in March 2003. When gold ETFs were introduced, they provided an accessible and cost-effective way to invest in gold compared to buying physical gold.\n\nWhy were Ethereum ETFs approved?\n\nThe approval of Ethereum ETFs by the US SEC on May 23 2024, was unexpected, with many market analysts anticipating a rejection.\n\nHow well do you really know your competitors? Access the most comprehensive Company Profiles on the market, powered by GlobalData. Save hours of research. Gain competitive edge. View profiles in store Company Profile – free sample Thank you! Your download email will arrive shortly Not ready to buy yet? Download a free sample We are confident about the unique quality of our Company Profiles. However, we want you to make the most beneficial decision for your business, so we offer a free sample that you can download by submitting the below form By GlobalData Submit Country * UK USA Afghanistan Åland Islands Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bonaire, Sint Eustatius and Saba Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cambodia Cameroon Canada Cape Verde Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos Islands Colombia Comoros Congo Democratic Republic of the Congo Cook Islands Costa Rica Côte d\"Ivoire Croatia Cuba Curaçao Cyprus Czech Republic Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Ethiopia Falkland Islands Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard Island and McDonald Islands Holy See Honduras Hong Kong Hungary Iceland India Indonesia Iran Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati North Korea South Korea Kuwait Kyrgyzstan Lao Latvia Lebanon Lesotho Liberia Libyan Arab Jamahiriya Liechtenstein Lithuania Luxembourg Macao Macedonia, The Former Yugoslav Republic of Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia Moldova Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island Northern Mariana Islands Norway Oman Pakistan Palau Palestinian Territory Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Réunion Romania Russian Federation Rwanda Saint Helena, Ascension and Tristan da Cunha Saint Kitts and Nevis Saint Lucia Saint Pierre and Miquelon Saint Vincent and The Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and The South Sandwich Islands Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Swaziland Sweden Switzerland Syrian Arab Republic Taiwan Tajikistan Tanzania Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkey Turkmenistan Turks and Caicos Islands Tuvalu Uganda Ukraine United Arab Emirates US Minor Outlying Islands Uruguay Uzbekistan Vanuatu Venezuela Vietnam British Virgin Islands US Virgin Islands Wallis and Futuna Western Sahara Yemen Zambia Zimbabwe Kosovo Industry * Academia & Education Aerospace, Defense & Security Agriculture Asset Management Automotive Banking & Payments Chemicals Construction Consumer Foodservice Government, trade bodies and NGOs Health & Fitness Hospitals & Healthcare HR, Staffing & Recruitment Insurance Investment Banking Legal Services Management Consulting Marketing & Advertising Media & Publishing Medical Devices Mining Oil & Gas Packaging Pharmaceuticals Power & Utilities Private Equity Real Estate Retail Sport Technology Telecom Transportation & Logistics Travel, Tourism & Hospitality Venture Capital Tick here to opt out of curated industry news, reports, and event updates from Verdict. Submit and download Visit our Privacy Policy for more information about our services, how we may use, process and share your personal data, including information of your rights in respect of your personal data and how you can unsubscribe from future marketing communications. Our services are intended for corporate subscribers and you warrant that the email address submitted is your corporate email address.\n\nIt has been speculated that the motivation behind the SEC’s decision is that crypto policy has become an election issue since Trump adopted a pro-crypto stance. However, the precedent set by the approval of Bitcoin ETFs in January was likely a key deciding factor in the SEC’s decision.\n\nOff to a bad start: Listings of the Ethereum ETFs are delayed\n\nDespite the approval, the listing of Ethereum ETFs has faced delays. This delay is unusual, as ETFs typically start trading immediately after approval, as was the case for the Bitcoin ETFs launched in January. Pending SEC approval of S-1 forms, trading is expected to begin mid-to-late July, although an exact timeline is uncertain.\n\nThese delays have tempered investor excitement and highlighted the ongoing challenges with crypto regulation. When trading does begin, the Ethereum ETFs will be welcomed into a cryptocurrency market experiencing a summer lull. Both Ethereum and the wider cryptocurrency market are down 30% since their highs in the first quarter.\n\nWhat we can expect when Ethereum ETFs are listed\n\nThe approval of Ethereum ETFs follows the successful introduction of Bitcoin ETFs in January, which exceeded expectations. On the first day of trading, the ETFs saw $4.6bn in trading volume and have since amassed a combined $76bn of assets under management.\n\nHowever, the success of the Ethereum ETFs is not a foregone conclusion. The mood of the cryptocurrency market is very different now from what it was in January, and while Bitcoin and Ethereum share similarities, they are also very different assets. With a fixed limited supply, Bitcoin is viewed as digital gold, whereas Ethereum, with a more technically ambitious goal of “world computer”, is often likened to digital oil.\n\nMore Crypto ETFs to come\n\nThe approval of the Ethereum ETF marks a significant milestone in the cryptocurrency market, reflecting the growing acceptance and integration of digital assets into traditional financial systems.\n\nWhile delays and regulatory challenges persist, the Ethereum ETFs are likely not the last cryptocurrency ETFs the SEC will approve. Indeed 21Shares, issuer of the fourth largest Bitcoin ETF, has already filed an application with the SEC for a Solana ETF."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMi0wFBVV95cUxNS094SnoxLUQ0ZXM1ZlNKSnJMOFhDMHB3NTc2bEdBczI0OFpjUktqaXM1bjZtNFAyWVA5a09Ia0dvQlJkY3VmY1hiTmMtOTlwdnBKUXQxdmFRQmFPM0xmX0NpNlpubXVOd2dfcnRJVktXNVE5NVZOaWtoRGFhRm9kN21EcmpPeDJWVkRyYzFaQVVpc0xJMDlDbFVzUDJxaVNGWjAyMTNCOVE2WWRDejM3Szk5UHZUTmJJUjdBWnU1UmVyc1dRUFhvMkFhelVQbWtmUnNj?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jul 2024 07:00:00 GMT",
        "title": "A conversation with Jerome de Tychey, President of Ethereum France, and Bettina Boon Falleur, Head of EthCC - DLNews",
        "content": "What are the long-term goals of Ethereum France, and how do you see the organisation evolving over the next five years given how quickly narratives and themes change in crypto?\n\nJdT: The long-term goal of Ethereum France has always been to educate the public about blockchain technologies, particularly Ethereum. Over the next five years, we aim to expand our presence in French-speaking regions, reaching as many people as possible to help them understand the transformative potential of this technology.\n\nCrypto themes and narratives change quickly, and we aim to be adaptable and responsive to the industry’s evolution. We’re also seeking to maintain momentum and motivation within our nonprofit organisation, so we have been recruiting for the past two years to bolster operations and ensure sustainable long-term growth.\n\nIn your opinion, what are the most promising use cases for Ethereum in the next decade? How is Ethereum France positioning itself to capitalise on these emerging opportunities?\n\nJdt: The scaling roadmap of Ethereum has already delivered cheap blockspace for new applications. In my opinion, the main waves of blockchain adoption are going to be gaming and social networks. These themes first emerged at EthCC, and we closely monitor their progress to inform the design of our conference tracks.\n\nA core focus at Ethereum France is to encourage the development of these emerging use cases, and to nurture the growth in interest and talent entering the blockchain space. We host monthly meetups where builders can showcase their latest developments and make information accessible to onboard newcomers into the space.\n\nEthCC has grown significantly since its inception. What are some of the key milestones and successes of EthCC over the years, and how has the conference evolved to meet the changing needs of the Ethereum community?\n\nBBF: EthCC has grown organically since its inception, evolving alongside Ethereum. Starting as a small gathering of enthusiasts, it now covers a broad range of themes and attracts a diverse range of industry professionals. We’re proud of the influential speakers and key announcements made on our stage, reflecting the conference’s importance in the industry.\n\nJoin the community to get our latest stories and updates\n\nNow in its seventh edition, EthCC expects more than 6000 attendees and 360 speakers, including at the EthVC programme, which serves as a crucial connection between startups and investors. While we’ve grown a lot in recent years, we maintain an open and welcoming atmosphere. We understand that the event is not just for engineers and developers anymore. Catering to all professionals, we have expanded our services to include networking zones and silent workspaces. We’ve also added childcare services this year, acknowledging the growing number of parents in our community who want to fully participate in the conference.\n\nThe agenda of EthCC covers a wide range of topics within the Ethereum ecosystem. How do you curate the content and select speakers to ensure that the conference addresses the most pressing and innovative topics in the Ethereum space?\n\nBBF: Curating content and selecting speakers for EthCC is indeed a challenging task that keeps us on our toes. There’s no magic formula; we spend the year closely monitoring industry trends to best understand what’s happening in the Ethereum space. Given the fast-paced nature of Ethereum, making these decisions eight months in advance is challenging, and it’s nearly impossible to predict everything flawlessly.\n\nWe encourage everyone to apply to EthCC, and each year we discover small projects and lesser-known researchers with valuable insights. We always try to balance well-known speakers and fresh voices. Importantly, we have a strict policy against accepting payments for speaking slots. While this complicates things—especially when companies try to pressure us—it ensures we maintain high-quality speakers. Our reviewers do an extraordinary job, thoroughly reading every application and making selections based on merit. They avoid choosing speakers solely based on fame or rejecting them due to obscurity, ensuring a comprehensive agenda across different tracks."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxOOWRWSkxfbXlubFEtNVp0ZVhzN3BPWHRSUHlYclUwS3RPTmJrcnVYdzdJbjBQeGR5LWxHSTNHaHBJbkNKcGdhdU1BRzc3dlVJRDVEelJCVF83Y0hpWldidTRHY3NmX2dGdkhSZkN1cmw1bVRvRUVoODdUY0F5bkVqMTVkY0tGSGVINGk4X0E2MEczckdONVJaWWtSQ0g3dWNob2I0aDhISQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jul 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Dropped Following Bitcoin’s Crash, What’s Happening? - FX Leaders",
        "content": "⚡ Trade Forex With High Leverage And No Limitations! – Open an Account Here\n\neth-usd\n\nEthereum’s price drop has breached critical support levels and fallen below the $3,000 mark as the crypto market collapses. Will the decline go further this weekend?\n\nWith a bullish close last Sunday and a 1.75% rise, the investors did not anticipate a crash this week. However, the release of the Mr. Gox Bitcoin payout has caused the crypto market to plummet to critical levels.\n\nThe massive payouts from the 2014 Mt. Gox security breach have increased supply pressure across the broader market. As a result, the crypto market experienced massive declines.\n\nAs buyers struggle to absorb the selling pressure, Ethereum (ETH), has fallen below the $3,000 mark. With this, Ethereum’s price struggled to find support amidst the market crash. Despite HODLers’ hopes for a quick recovery, ETH has fallen below the critical level. With a 16.42% drop this week, bearish patterns and signals still show on the Ethereum price chart.\n\nThe overpowering bears have initiated a decline with an evening star formation, aiming to restest the $3,460 range breakdown.\n\nOver the past four days, including a 6% intraday drop, ETH has broken below a long-standing support trendline, falling 16% in total. This decline has also affected major altcoins and meme coins like Solana, DOGE, and SHIB, which have each seen a drop of 15% or more this week.\n\nWith the increasing moment, the trendline breakout has pushed Ethereum (ETH) to its next support level at $2,875. Additionally, this decline has triggered a bearish phase in the MACD and signal lines, now below the zero lines.\n\nMeanwhile, a whale recently caused a massive stir in the crypto market by dumping 26,600 ETH valued at $82.5 million to repay debt on Aave, resulting in a 3.4% drop in Ethereum’s price. Following this, the whale created a new walley and borrowed 80.9 million USDT from Aavve to purchase 26,235 ETH priced at $3,084.\n\nAt press time, Ethereum (ETH) is trading at $2879, reflecting a 9.70% decrease in the last 24 hours."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxNdlkzOHB5dTlwdVhRbkl0Yk1ldWExc093OE51dzhwbm9QNHVCYXFaQlNjcGtRQnNkSFZOclpoQVZiTzZtU1pDVmlmdWIxaHhGc1ZhbEtLSUxOczVYem5oVFFyVFVIcWtKY1JwOG15QWpSeVViZG5DV1JGNHA2V2dQbjJoTHNjMlJuS1Jsa0FfTzhsM1VhdE9xN2NB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jul 2024 07:00:00 GMT",
        "title": "Mt. Gox shakes up the crypto market: $580m liquidated in a few hours - Cointribune EN",
        "content": "Fri 05 Jul 2024 ▪ 3 min read ▪ by Luc Jose A.\n\nA shockwave has shaken the world of crypto. In a matter of hours, Bitcoin plummeted by 8%, Ethereum tumbled by over 10%, and millions of dollars in long positions were liquidated. As traders try to understand the reasons behind this sudden downfall, concerns are growing over the significant movements of funds related to Mt. Gox, the defunct exchange platform.\n\nA Steep Dive for Bitcoin and Ethereum\n\nThe crypto market was hit by a wave of $580 million in liquidations, a direct consequence of an 8% drop in Bitcoin and similar declines for Ethereum, Solana, and Dogecoin. Long transactions on BTC and Eth saw losses exceeding $380 million, with the largest single liquidation observed on Binance, where an Ethereum transaction worth $18.4 million was forcibly closed.\n\nThese massive liquidations result from highly leveraged positions that traders could not maintain in the face of sudden price drops. Data from Coinalyze shows that this situation led to one of the largest waves of liquidations of the year. Moreover, open interest, which measures the number of unsettled bets on futures contracts, fell by 12%, signaling a capital outflow from the market. This increased volatility reflects a sense of panic among investors, exacerbated by external factors such as the movements of funds related to Mt. Gox and government decisions influencing the market.\n\nMarket dynamics, regulatory developments, and macroeconomic factors all play critical roles in Bitcoin’s price movements. Staying informed and agile is key for those involved in the market. Nickolas Hoog, VP of Marketing at BitMart\n\nThe Role of Mt. Gox and Other Trigger Factors\n\nIn anticipation of repayments to creditors, Mt. Gox transferred more than $2.7 billion in bitcoins to a new address. This move has sparked fears of increased selling pressure, amplifying the price drops.\n\nAt the same time, the German government’s decision to liquidate a portion of its bitcoin holdings added a layer of uncertainty to the markets. Traders, already nervous about macroeconomic uncertainties and the upcoming U.S. presidential elections, reacted by massively selling their positions. This massive liquidation caused significant losses for overleveraged positions, particularly on platforms like Binance, where an Ethereum/USDT transaction of nearly $19 million was liquidated.\n\nThis increased volatility and price drops have generated a sense of fear among investors, with the fear and greed index plunging to alarming levels. The outlook for the market remains uncertain in the short term, with analysts anticipating a challenging third quarter, marked by increased investor caution and persistent volatility.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxOYjlwSjBtNWVlOWhmMVk4VllkVVpHMGxNVWdDWWVUd1VwaEREQ0dxREVvMzIxa1ZFRlBVaTJhZ3FJWUotdHZiMk9ZbVF4cFNvUlAtczN5ZlFtZ0c3ekR1RDJwbm5CbDN0UUtvcFEtbzdCSEVQQllPWjI1MXZGRWNCcEw5dkl5NEZEczFkV21YTWlPMnhtSUVYMDE5TW9XSUR1MXZMSTdtMDJ1VkZCSDlYVXRvZS1DSzd1UGNpbUQ2UXBPdmlsTW95cHlPVVY0bFZRM2RvZXZJNEFTOVhlMXlDQ2hHamRkVmh3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 Jul 2024 07:00:00 GMT",
        "title": "While Bitcoin, Ethereum, Shiba Inu Witness A Meltdown, This Solana-Based Memecoin Has Surged 147% In Last Week - Benzinga",
        "content": "In defiance of the market’s downturn, a memecoin built on the Solana blockchain, Billy BILLY/USD, has experienced a significant surge, with its value increasing by nearly 147% in the last week.\n\nWhat Happened: The value of Billy, a memecoin with a dog theme, has surged by nearly 147% in the last week, reaching $0.182. This surge in value comes after several cryptocurrency exchanges, including Bittrue, Bitget, MEXC, and Gate.io, added support for the coin, reported The Daily Hodl.\n\nBilly, which was launched in June, features a puppy image and has outperformed other popular meme coins during the current market consolidation phase, which has led to significant declines across the board, the report noted.\n\nDespite the market’s downturn, Billy’s market cap is currently at $181.8 million, with a 24-hour trading volume of $55.3 million, according to data from CoinMarketCap.\n\nWhy It Matters: Despite their often whimsical nature, meme coins have been gaining traction and demonstrating significant market resilience.\n\nOther dog-theme assets such as Shiba Inu SHIB/USD and Dogecoin DOGE/USD are trading at $0.00001538 and $0.1081 respectively as of the time of writing this article.\n\nOther top-tier cryptocurrencies like Bitcoin BTC/USD and Ethereum ETH/USD have come under selling pressure over the past week – while Bitcoin has fallen over 7%, Ethereum declined by over 11%.\n\nRead More:\n\nPhoto courtesy: @billydogsolana\n\nThis story was generated using Benzinga Neuro and edited by Anan Ashraf."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxOaXRZaHIyLVQ0bnlOZ3hucmtic08xbkJWY3pMUGdvUGswaE8yMzJfMjZlOG0tUktYRWFYVFFFR2NndUZjS25QVzFTU3E1WXlWUmVYc2hWS1JCVDhWTlhwQ2V1bHE0X2kyQWNCZklLNERmUERQWHJ0eGRPLVFWaTRMMmhVYVTSAYoBQVVfeXFMTXpjWGdLcUttTXY1SUtyOXVZSkc5YzN3MnpoM1FXNlVTTFhOdU9oODVNZVhHSnBjNjU1bDRUREhUM3JhTm9QX0V6aXZKZzdaLWwtRXB1Qy1QNHo3RXA5V3hXU25UcThwT19RZ1JSQzhfVWZ4YWdKN2o3dzFwNUdoYXVHSlc1NWVfXzhB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 Jul 2024 07:00:00 GMT",
        "title": "Ethereum – Up by 3% after 12% drop, what next for ETH’s price? - AMBCrypto News",
        "content": "While ETH’s price dropped, whales deposited tokens worth millions of dollars\n\nFew metrics and indicators suggested that ETH was undervalued\n\nAs the crypto market witnessed a crash last week, the king of altcoins, Ethereum [ETH], also fell victim to a massive price correction. Because of the price decline, many might have lost confidence in the token. However, the trend changed over the last few hours as ETH’s daily chart soon turned green.\n\nEthereum’s high volatility\n\nCoinMarketCap’s data revealed that ETH’s price had dropped by more than 12% in just seven days. AMBCrypto’s assessment of IntoTheBlock’s data also revealed that ETH’s average balance dropped, which can be attributed to the token’s double-digit price decline.\n\nIn the meantime, Lookonchain posted a tweet sharing an interesting development. According to the same, several whales started to sell ETH as its value fell. To be precise, three Ethereum whales deposited 28,558 ETH, worth over $82.2 million, to Binance. Soon after though, ETH’s price registered a trend reversal on the charts.\n\nIn fact, the altcoin’s price has appreciated by nearly 3% in the last 24 hours alone. At the time of writing, ETH was trading at $2,967.81 with a market capitalization of over $356 billion.\n\nHowever, despite the rise in price, its trading volume dropped by double digits. This suggested that ETH might not sustain its bullish momentum for long.\n\nWill ETH’s bull rally last?\n\nLike the trading volume, a few other metrics also looked pretty bearish.\n\nFor instance, though ETH recorded a price hike, selling pressure on the token continued to remain high. This was evidenced by looking at CryptoQuant’s data, with the same highlighting a rise in ETH’s exchange reserves. Simply put, several investors chose to sell.\n\nNonetheless, other metrics supported the possibility of a sustained uptrend as well.\n\nFor example – ETH’s funding rate has been rising, meaning that long-position traders have been dominant and may be willing to pay short-position traders. Its Relative Strength Index (RSI), as per CryptoQuant, was in the oversold zone too. This might help increase buying pressure in the coming days, which might in turn result in a price hike on the charts.\n\nOn top of that, AMBCrypto’s analysis of Glassnode’s data revealed that EThereum’s NVT ratio dropped sharply. A fall in this metric means that an asset is undervalued, which is generally followed by price hikes.\n\nWe then planned to have a look at ETH’s daily chart to better understand what to expect. We found that ETH’s price touched the lower limit of the Bollinger Bands – Underlining the chances of a rebound.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nAdditionally, its Money Flow Index (MFI) was also about to enter the oversold zone.\n\nHowever, the Chaikin Money Flow (CMF) looked bearish, as at press time it had a value of -0.09."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxPRV84Z1hfQUtpWHZYSzNEUy1ybE14ZWpvb3BRYlBHTlFlbThyMThuUlA3MW5OR09fdUNkQWdFWEpQeXpKdFR2S3JiZS1FSFJKVFpJaVl5enF0X2VtWThVVlFjejllaWJSb0Rjdmw4dFRzeE1YZTlWMk5JOGt3MXBRNll4ZEJ5djZUQ3pnUHlfY195UGFFMDR6NlhxVjFqMGJvdVNLdy1VX1NyaWxx0gGyAUFVX3lxTFBGUjZTcmpRQ0lJbTU0SWY4N0kyZTYwTEtKNEdSN2VKc1F2RlFVVVhma2FCWHo2QWY4enlpZ1k5bkZOdm55SXIxWEVSclpsTmZaMlA2ZHh0ajFHbzl5bGVVUklmQXkzYnJ0MVpzc2V5UVBvVUhXY1BwWV9zSDZBS0hoTlNudEZnaTFNR210RUxtLVc5RnhLejQyQnNwVWViZEFiZGcwVTI0dTRncThwOEpUOGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jul 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Lost All 'ETF Gains,' Shiba Inu (SHIB) on Its Way to Add Zero, Solana (SOL) Reaches $135, Critical Support Activated - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nThe second-biggest cryptocurrency on the market has reached \"pre-ETF rumor\" price levels, practically losing all their gains since May. Things are not looking good, and the only relatively positive thing we can see is the descending trading volume amid the price correction.\n\nEthereum's price rose initially as a result of the much-anticipated ETF news. It appears, though, that traders lack the conviction to keep the rally going despite the ETF announcement alone. Ethereum's current price of $3,205 is significantly below its recent highs, indicating that there was insufficient purchasing interest.\n\nThe absence of notable advancements in Ethereum's ecosystem this year is a major contributing factor to the lack of buying support on the market. There have not been any significant additions or innovations to the network that would increase its demand or utility.\n\nThis means that neither new investors nor existing ones are drawn to the Ethereum network and, as a result, usage and demand for it remain low.\n\nAdvertisement\n\nAn uncertain future lies ahead for Ethereum according to the technical analysis, too. There is a bearish trend in the price as it has dropped below the 50 EMA and the 100 EMA critical support levels. The 200 EMA at $3,090 is the next important support level, and if the current trend holds, it may be tested soon.\n\nShiba Inu's disrupted plans\n\nBitcoin plummeting below $60,000 has clearly disrupted a lot of plans on the market. Not many expected the digital gold to drop down so badly in the last 24 hours, which greatly affected the performance of assets like Shiba Inu, which lost a substantial portion of their values.\n\nShiba Inu (SHIB) is down a lot from its recent highs, trading at about $0.00001565. The asset has been steadily losing value, and the recent volatility on the market has made this trend worse. Key moving averages indicate additional bearish momentum, and the chart illustrates SHIB's difficulty finding support.\n\nIt is challenging for SHIB to regain its footing because of the resistance levels set by the 200 and 100 EMAs. The entire cryptocurrency market has been impacted by Bitcoins decline below $60,000. Since Bitcoin is the most popular cryptocurrency, its performance frequently influences other digital assets. Plunging panic sales have clearly affected altcoins such as Shiba Inu.\n\nShiba Inu has long displayed technical weakness. A bearish trend is indicated by the asset's recent trading below its major moving averages. An oversold state is indicated by the RSI at 27, but a recovery is difficult because there are not any significant support levels below the current price.\n\nInvestor caution has increased as the general outlook for the market has turned negative, according to various sentiment indicators. As a result of traders' reluctance to invest in a market that is declining, SHIB is under additional pressure.\n\nSolana goes down\n\nSolana went down with the rest of the cryptocurrency market, hitting a $135 price threshold, which is considered a critical support level as it coincides with the 200 EMA. The drop below it would be a long-term bearish signal that hints at the continuation of the bearish trend.\n\nThere is increasing pressure on Solana, which is currently trading at about $134. Traders' attention is focused on the 200 EMA at $131.29, which is a critical support level. A break below this mark would probably indicate the continuation of a bearish trend and might trigger additional drops.\n\nIn line with the bearish outlook, Solana has recently sold off and is now below its major moving averages, which include the 50 EMA at $147 and the 100 EMA at $144.\n\nBecause of Bitcoin's recent decline below $60,000, the sentiment surrounding the cryptocurrency market as a whole has turned negative. Altcoins such as Solana are facing more pressure due to the wider market downturn. Bitcoin may push Solana down even more if it keeps having trouble.\n\nSolana is getting close to oversold territory. Although this might point to a possible rebound, technical indicators and the general mood of the market point to the possibility that any bounce would be fleeting unless conditions in the wider market improve. Solana may stabilize and possibly rise again if it can maintain its hold above the 200 EMA at around $130."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxPbnV6UGhxelVwdk9aYmg5eDZEeFlRWUpqcUtmZkU0bTdON3EwdWpQcHZmQ1JydGxBa0hucHZEalNjWVVrY3pfYUI0OHg3XzVlaEtvdXkxeVN2R3BNTDNuYnUtUm1ZN0RKY1FzZHo1WWphQ0NFbnFhNS1IY0FQUzFmOVdyN00wUm05UUZFT21yelBZNFdI0gGaAUFVX3lxTE1jRUlFY2Ixb3JoV3V0TW5uN1NxbnhiRWk4aXdfN09hT2NJWW5BSm1fNFE4VEdKcVJZUUpYS2d3ekdRTXdiQldVYVpodkxLand3ZTlobVhhT0xBQTlfY1JrR0xwR3NpQUFWSGhDeW1ZNmN5c29kRGhGLXNRLWN0d1d1VFRDSzhaajVUTTRxUEtrSmZLRTUzbHdvbkE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jul 2024 07:00:00 GMT",
        "title": "Ethereum's L2 INTMAX to Offer $5,000 for Privacy Reward Mechanism Suggestions - U.Today",
        "content": "Advertisement\n\nINTMAX, a new-gen Ethereum ZK rollup with a stateless architecture, is calling on blockchain developers and privacy proponents to submit their ideas for rewarding users who contribute to privacy on its network. The blockchain team is also a partner and sponsor of the most anticipated EVM ecosystem event in Q3, 2024.\n\nINTMAX L2 calls for privacy-centric rewards tool ideas\n\nINTMAX, a key sponsor and supporter of ETHGlobal Brussels 2024, and a cutting-edge Ethereum layer-2 zero-knowledge rollup, shares the details of its new initiative focused on enhancing privacy in the ecosystem. A $5,000 reward will be offered to an entity or individual who proposes a privacy-centric solution for rewarding network contributors.\n\n#Ethereum developers, solve privacy problems and get the prize! We’re looking for ideas and implementations that reward privacy users (mining or airdrop). See you soon in Brussels ✌️ https://t.co/PbWl08r6JM — INTMAX (@intmaxIO) June 25, 2024\n\nThe suggestions might cover both airdrop-based or mining-based reward models on INTMAX. Submitting just an idea is acceptable, but it must be compelling to outperform someone who has also implemented it. As noted in the documentation, rewarding users for privacy without duplication remains a challenging problem for credible and active networks in 2024.\n\nAdvertisement\n\nPrivacy protocols such as INTMAX have a unique dynamic, wherein more participants in the network translates to greater privacy for every user. That is quite unlike most DeFi protocols, where having more users means greater competition for rewards.\n\nThe more participants there are in a privacy protocol contributing their funds and usage, the more privacy is afforded to everyone involved. This is a unique dynamic, where having more \"competitors\" actually benefits each individual user's privacy, unlike typical financial applications, where more users means more competition for rewards.\n\nOn the other hand, the introduction of more users makes it possible for malicious actors to exploit loopholes and obtain lucrative rewards without actually contributing to the privacy of the network. To ensure the integrity of privacy networks and properly incentivize users, it is necessary to close these loopholes.\n\nEnhancing privacy for future token distributions on EVM\n\nThe INTMAX contest is one of several enticing prizes up for grabs at ETHGlobal Brussels, with a total prize pool of more than $450,000 on offer to developers who can stand out from the crowd at one of Europe’s biggest annual hackathon events.\n\nTechnically, the contest invites developers to propose the safest and most resource-efficient implementation of the Quiz mechanism, or else develop a superior solution that solves the challenges of privacy rewards once and for all.\n\nDevelopers are not required to program the deposit and withdrawal process, or even provide any privacy guarantees but simply focus on designing the actual reward system."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMi2gFBVV95cUxPUW15NER3NHEzSFIwSkFfSVVsZFU2OTBicEpWWUNUMUNXOGs1eWVocTVfVEVCOFM1aXNhSmdraFJVcTItRFNUWE91OXg2ZTFQLW9rRF80dkRudS1XVktBX0NsNG9Pc09TRXp5NTgtdEZuTFo4T0RVV05iOHl1NENqdkd2REg1WFFZLS1ic2lkTDFuTVdRY3RNV3NQcHpCNkFTTlFsRGg3VFJCc01pamdGZ25oRklyNTRrbnE0TVBsNEJXTU5lZkszd3hkZVlvanV3NkxIV2pLcHBtd9IB5wFBVV95cUxPTGhVbEg2dWRueEE4anlIcFRTX1pPa3ZQV2pWTFl5djZzVi1UelVEaklkUmNlM2RiMW9lcUpuR2tDYXV3RExMOWNUN0hieHVucjQyS2lJa2ZQZGJONU9CTVFaeUNUUnRVY0llMzJybFU1Y3hnazdNUElZVkU1NHdlRWNoY0dOYlVCb2pBeUJjdmVkanY1cElyYVRVc1hMeFNfNWhUbG01OUV4ZjBtcWw0ZnlmZnVlRWZnSUIyc2t5T1pNZUtOejM1TkpSS3lDcEZXNzVfRXhNWXVoa09qMVhIMkVfOTZGMjA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 Jul 2024 07:00:00 GMT",
        "title": "3 Best Ethereum DeFi Platforms to Get Early Access to the Solana ETF in 2024 - Analytics Insight",
        "content": "Launched in 2020 by Ava Labs, Avalanche aims to address the limitations of existing blockchain technology by providing near-instant transaction finality, high throughput, and low transaction costs. The platform uses a novel consensus protocol known as Avalanche Consensus, which allows it to achieve a high degree of decentralization and security without sacrificing performance."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxPeGNRS2UwbG56N2ZRc2pVdHp1M3VkZnA3ZjlGNzY4X1pucTloUHdHbmdSdS1kNzNiUWloZHBBQy1hRTlKbzg2WDFvU01YUFl0ZmZtOFBNX19zdzFzc3V5dXF1VWxTQUVUbU52VmFfVlF2WWhjZ0Uzb3NrQkRtODRJVk44ejlTdUFOSGhFZWZiV21iZzVQeGVKV0JXWVFtT0h1NVdlYmhETFhma05PRDRmNdIBtgFBVV95cUxPRndPVWcwNXJpQ25VekFZZ2VqRFJXMjAybXM0ZzZNNVlHLTlwb295M0QxWl9veGFadGxHUDVXYXZMaXNoYnhTYzJMSUtiQXY0czZoUElDR0YtbWpzRi1RYnViUWUwU1NhRVdQc0YtWFk2ZV94ZVpwRGFwVVJsLVU5RjNXUVBHY2U1Mm5xN25XalYxd1JkajVycHRaX0J5MmdrUXZqSjJ4cUUxZ2ZEX25QTlQ3UXA0QQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jul 2024 07:00:00 GMT",
        "title": "Justin Sun Potential $66 Million Loss Revealed As Ethereum Price Declines - NewsBTC",
        "content": "Following a widespread crypto market crash on Friday, the price of Ethereum took a severe price hit falling by about 10%. While the prominent altcoin has made a minor recovery since then, its price slip has revealed some vital information on the holdings of Tron founder and key crypto figure Justin Sun.\n\n\n\nRelated Reading\n\nJustin Sun $66 Million Loss, Motive For Massive Bitcoin Buy Offer?\n\nAmidst the market mayhem on Friday, blockchain analytics platform Spot on Chain shared an intriguing report on Justin Sun’s investments in Ethereum. In an X post, Spot on Chain stated that Sun has allegedly acquired 361,000 ETH (worth $1.1 billion) over the last five months.\n\nThe Tron founder reportedly made this investment using three different wallet addresses purchasing 169,604 ETH with “0x7a9” in February at an average price of $2,870, 176,118 ETH with “0x435” in April at $3,177, and 15,416 ETH with “0xdbf” in June at $3,474.\n\n\n\nJustin Sun may have lost $66M after the #Ethereum price plummeted 10% today! From Feb to Jun, he allegedly bought 361K $ETH (est. cost: $1.1B) via 3 wallets, including:\n\n– 169,604 $ETH via “0x7a9” in Feb at $2,870 avg\n\n– 176,117 $ETH via “0x435” in Apr at $3,177 avg\n\n– 15,416 $ETH… pic.twitter.com/bwIezvMRtj — Spot On Chain (@spotonchain) July 5, 2024\n\nSpot on Chain noted that the aforementioned addresses always received ETH deposits from Binance following Sun’s stablecoin deposits on the exchange thus leading to suspicions that the Tron founder served as owner of these wallets.\n\n\n\nFollowing the repayment of creditors by defunct exchange Mt. Gox, coupled with a consistent massive Bitcoin sell-off by the US and German governments, the price of Bitcoin has plummeted by 10% over the last two days falling as low as $53,717.\n\nUnsurprisingly, this decline soon extended across the crypto market, with Ethereum crashing by a similar percentage to trade at $2810, marking its lowest price in the last five months. At that point, Justin Sun’s alleged ETH investments reached a $66 million loss.\n\nInterestingly, the Tron founder had reached out to the German government on Thursday to negotiate the sale of their remaining BTC holdings valued at $2.3 billion in a private transaction order. However, it remains unknown if the German government will take up this offer as Sun attempts to reduce the impact of their constant BTC sell-offs on his personal investments and the general crypto market.\n\nAt the time of writing, Ethereum has shown resilience since its earlier slump rising by about 5% to currently trade at $2,975. In tandem, the token’s daily trading volume is up by 47.33% and valued at $30.47 billion.\n\n\n\nRelated Reading\n\nAnalyst Predicts Ethereum Nosedive, Cautions Investors To Prepare For $2,700 Target 2 months ago\n\nSolana, Others Record Market Gains Amidst Market Crash\n\nWhile the general cryptocurrency remains in a downtrend, with the total market cap down by 1.02%, several assets have managed to stay afloat providing investors with some form of relief. According to data from CoinMarketCap, Solana is one of these assets, with a 4.99% daily gain alongside other prominent tokens such as Avalanche (AVAX) and Shiba Inu with respective gains of 3.99% and 3.70% respectively.\n\nNotably, prominent meme coin dogwifhat leads the resistance with the highest daily gain of 12.28%.\n\n\n\nFeatured image from Bloomberg, chart from Tradingview"
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxQRWhQUUtITWRZUThiZmNSYWRBRnYxQVpSeVZYS242U1VVWHdhVjV1REwtMDBUd05TQXp1N1JueFZuTDNyNUhwbnZHNHNwbzkyNUFBOU9ubk5TcnU4V3p6OUFFb0t0eVVGd0hVRXpCNXpDLWJmSUpJTE94WU0zT2pKZGQ4ektIU183TGVPRnVwa0o3b3Rq?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 Jul 2024 07:00:00 GMT",
        "title": "Spot Ethereum ETF Could See 25% More US Investors: Grayscale Survey - Coinfomania",
        "content": "Grayscale’s recent survey highlighted the approval of a spot Ethereum ETF could increase US investor interest in Ethereum by 25%.\n\nThis increase in interest is driven by economic concerns like inflation and worries about financial stability, particularly among younger individuals and minority communities. 40% of voters from the previous year desired to invest in cryptocurrency. Due to economic instability, that percentage has increased to 47% this year, indicating that more individuals are interested in digital assets.\n\nSource: Grayscale\n\nAccording to Grayscale’s survey, many Americans are drawn to cryptocurrencies because they see them as a way to achieve financial stability and manage their expenses.\n\nEconomic worries have historically influenced crypto interest. Bitcoin’s limited supply allows it to function like gold, acting as a store of value. Grayscale found that familiarity with cryptocurrencies increases the likelihood of seeing Bitcoin as a hedge against inflation and other macroeconomic events.\n\nDemographic Ownership Patterns\n\nNearly 70% of people surveyed said they own some form of investment and around 19% own cryptocurrencies. Men, Black and Hispanic voters, and younger people have higher ownership rates. Gen Z respondents, in particular, reported a 31% ownership rate, with many saying they are more interested in cryptocurrencies because of inflation.\n\nDespite the FTX crash, enthusiasm for crypto remains strong in the US. Approximately 40% of investors believe their future portfolios will include Bitcoin.\n\nGrayscale’s data shows that cryptocurrency interest transcends political boundaries. Ownership rates are similar among Republicans (18%) and Democrats (19%). Voters are split on which party is more favorable to the crypto industry, with 30% believing both parties have a favorable stance on crypto policies.\n\nThis balanced interest aligns with recent bipartisan support in Congress for the resolution of SAB 121, enabling banks to serve as custodians for crypto, making it more accessible.\n\nPolitical Views on Crypto\n\nHowever, differences exist in how each party views the importance of crypto-related issues. Republican voters are more likely to prioritize inflation and the economy, with 54% compared to 33% of Democrats. Conversely, Democrats focus more on issues like gun violence, climate change, and income inequality.\n\nMeanwhile, Bitcoin and Ether prices continue to be affected by government sell-offs and Mt. Gox’s repayment. Bitcoin has stabilized around $57,000, while Ether stands at $3,027 as of press time."
    }
]