[
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiZEFVX3lxTFBLVzhhejNEclJHUURvMXExUEFEOENWOTBTSHlRSWxzMk8xYzVRRHhob196N0xaUGNmbVZDdjNmZFJ4aVo5dWNxTlRrdnJqX0JJc3ZMNlBHTUlObXFQdVZjTk5jWE8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Ethereum is too hard to use - Blockworks",
        "content": "Anyone else think Ethereum is difficult to use these days?\n\nYeah, there’s a bunch of cool stuff on Ethereum — meme tokens, NFTs, DeFi, degens — it’s all there. But over the years as the blockchain evolved, it has become more expensive and more complicated — as in, an already complex technology for users has become even moreso.\n\nNot only do users need to understand crypto basics like wallets, irreversible transactions and addresses, they also now have to contend with getting to know different chains. You can’t just send Ethereum chain ETH to Optimism chain ETH, or Optimism chain ETH to Polygon chain ETH, unless of course you use a bridge which means that this system might be getting a little complex for many users.\n\nEthereum is becoming a multilayered lasagna-like system whereby complexity and fees are pushing people to the margins, causing interoperability and security concerns.\n\nHow did we get here?\n\nI wouldn’t say there’s anyone in particular to blame for this; it’s an ecosystem problem as a whole. When Ethereum launched almost 10 years ago, nobody was using it. At that time, any usage at all was welcomed.\n\nNow, it’s 2024 and there is usage. But there’s also expensive layer-1 fees. Average transaction fees on the layer-1 Ethereum blockchain are at $0.94. If a user wants to interact with a smart contract, like a DEX, fees are averaging $4.70.\n\nSome might say, “Well, maybe it’s time to examine fees themselves.” Problem is, fees are what secure the network. If validators were not being incentivized by staking and reaping fees, what would be the point?\n\nOkay, yeah, but there’s the layer-2 options, right? There are. And Arbitrum and Optimism have both transaction and smart contract fees at less than $0.02. We’re securing the bottom layer, enabling lower fees on the second.\n\nBut as a Coinbase report from late last year noted, there are so many of these layer-2s that fragmentation now exists between all of these different chains. And mainstream users, aka those who could enable mass adoption, want financial apps that don’t make things complicated.\n\nThe sandbox\n\nThe point is clearly that Ethereum is just one big-ass financial experiment. I actually wrote about this way back in 2016, about Ethereum being a fintech sandbox.\n\nAnd it has been one. When I wrote that piece, ICOs were only slowly gaining traction, DEXs were in their infancy and there wasn’t even an NFT token standard yet — just Plain Jane ERC-20s.\n\nRead more from our opinion section: BlackRock clearly wants to take crypto seriously. Too bad it’s forever silly.\n\nTimes have certainly changed. Ethereum’s “world computer” concept, the idea that people could build programmable monetary systems on a verifiable blockchain, has been a success. The Ethereum Virtual Machine, or EVM, is a standard for smart contract development — even outside the Ethereum ecosystem.\n\nThen, there’s the 2022 move to the proof-of-stake model, which to Ethereum’s credit, was pulled off with remarkable execution.\n\nYet I’ve heard of people working on Ethereum layer-3 projects now. That’s an abstraction of two layers — can anyone come up with something comparable for so many layers in technology? Maybe the OSI model? It has seven layers. But it’s used for data in networking, all running at the same speed. And there’s no fees. It’s just categorizing data.\n\nOkay, well, blockchains are just data. So then we arrive back at the fee conundrum. But blockchains are decentralized, so there has to be some incentive to support the network, right?\n\nA fee quagmire\n\nFees secure the Ethereum network, rent the computing power to do things and also limit spam. With that in mind, I suppose there have to be fees in the system — I’m not proposing some grand, new fee-less Ethereum design, that’s for the Vitalik Buterins of the world.\n\nThere are rollups, and that’s promising because they can batch process transactions off of Ethereum while lowering fees with the same level of security. Or maybe some smart startup can somehow increase interoperability — instead of reducing it by having users dig through layers like a Stouffer’s Italiano.\n\nI just am not convinced of the feasibility and long-term viability of so many bridges, some of which have been compromised. It feels like too many vulnerabilities in the margins. Perhaps a standardization of bridges is needed, and many wallets do warn users about interacting with bad smart contracts, so some safeguarding is happening.\n\nBut I’m still trying to coincide my recent experiences with Ethereum as something…\n\nVery.\n\nLasagna-like.\n\nTasty for the taste buds as a food, yes.\n\nBut isn’t it a bit complex for people to use as a blockchain? People want apps that offer free flow of money, not restrictive layers. Hopefully, Ethereum can evolve past this lasagna stage.\n\nDaniel Cawrey has been involved full-time in the crypto space since 2013, including as an editor at CoinDesk. He is author of 2020’s “Mastering Blockchain” and 2023’s “Understanding Crypto” books, both available on Amazon.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxPWEM3MEV6VDJsXzBVSThkMXptWWNrM0NremVoZlMxOEFCM2VLZklVVEhzVDd6Smt3bE5SY1d5VFpMbEp0MC1BNlNLTjJjQ1dIbGRQeXd1d004U0NGQWE5djZUVml1N1pXeFVpcUxCUDVaNnR2MTBlWmFJbUQtdTZLT1c3Z3BsUWNtNkxmVXRBYjBLajhITVE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 May 2024 07:00:00 GMT",
        "title": "Ethereum Soars As SEC Reconsiders Spot Ether ETF Approval - Brave New Coin Insights",
        "content": "Ethereum Soars As SEC Reconsiders Spot Ether ETF Approval\n\nThe price of Ethereum jumped 18% as the SEC reconsiders its position on the approval of an Ethereum Spot ETF.\n\nOn Monday, new developments suggest that the U.S. Securities and Exchange Commission (SEC) might be rethinking its stance on spot Ether (ETH) exchange-traded funds (ETFs). Bloomberg ETF analysts James Seyffart and Eric Balchunas have indicated a shift in the SEC’s approach, raising the odds of approval from 25% to 75% after “hearing chatter” about the financial regulator’s internal discussions.\n\nAnalysts Adjust Predictions\n\nOn Monday Seyffart and Balchunas posted on X to update their predictions regarding the SEC’s decision on spot Ether ETFs. “The SEC might be doing a 180 on their expected denial of spot Ether exchange-traded funds this week,” wrote Balchunas. This new perspective is based on various signals, including recent SEC filings, public statements from SEC Chair Gary Gensler, and insider reports suggesting that the commission might be leaning towards approval following political pressure on Democrats to reverse course on crypto.\n\nSeyffart echoed this sentiment, mentioning that the issue had become “increasingly political.” He hinted at a surge of related filings in the coming days if their sources were correct. “Never gonna hear the end of this from the [Ether] people in my replies if this turns out to be true,” Seyffart remarked, highlighting the potential impact on the cryptocurrency community.\n\nUpcoming Deadlines and Broader Implications\n\nThe SEC’s decision on VanEck’s spot Ether ETF is due by May 23. This decision is critical as VanEck’s application is the first in a series of pending spot Ether ETFs, including those from ARK 21Shares, Hashdex, Invesco Galaxy, BlackRock, and Fidelity. The SEC has already delayed VanEck’s application as long as allowed under regulatory guidelines, setting the stage for a potentially groundbreaking decision.\n\nEthereum soared to $3,636 on the news\n\nIn an April interview, VanEck CEO Jan van Eck expressed skepticism about the SEC’s approval of his company’s ETF application in May. This skepticism seemed justified when Grayscale withdrew its application for an Ether futures ETF on May 7, followed by CEO Michael Sonnenshein’s resignation announcement on May 20 (Cointelegraph).\n\nPolitical and Regulatory Dynamics\n\nThe evolving political landscape could also influence the SEC’s decision. Recently, U.S. lawmakers in both the House of Representatives and Senate voted to overturn an SEC rule impacting banks dealing with companies holding digital assets. This congressional resolution’s future remains uncertain, pending President Joe Biden’s decision to either veto or sign it into law.\n\nFurthermore, the SEC has requested exchanges to update their 19b-4 filings, suggesting a potential move towards approving these applications. This request has led to speculation that the SEC might be progressing towards an approval decision. However, even if the 19b-4 filings are approved, the ETFs would still need their S-1 applications cleared before trading could commence, a process without a defined timeline.\n\nIndustry Reactions and Future Prospects\n\nOne company in talks with the SEC reported a more optimistic outlook, feeling that the regulatory body was no longer dragging its feet. This optimism is bolstered by the reassessment from Seyffart and Balchunas, who increased their approval odds based on new information and insider sources\n\nThe SEC’s investigation into whether Ether qualifies as a security continues to add complexity to the situation. This investigation, launched after Ethereum transitioned from a proof-of-work to a proof-of-stake consensus mechanism, could influence the SEC’s final decision. A recent development from Prometheum, which launched its Ether custody service with plans to offer services for other digital assets considered securities, might also play a role in shaping the SEC’s view.\n\nAs the May 23 deadline approaches, the financial and crypto communities are on high alert. The SEC’s decision could significantly impact the market, setting a precedent for future cryptocurrency ETF approvals, taking crypto centre stage for the upcoming election cycle, and shaping the regulatory landscape for digital assets in the United States."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiZkFVX3lxTE9nX2pJdno5TU5JemxNOEdsazRDV0FZQ2JaTVhlRkZtVHlyU1VRVVFYSjlTWnVNR2c3bEVBRmNfeW9aUUl6RWF2aGN5cXBfSXlPS2FWbUZDYTQzSWFkb3Q1dFlpTG10dw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "What Is the EIP-7022 Proposal on Ethereum? - Unchained",
        "content": "EIP-7702 is a new proposal that will introduce a new transaction type to enhance the security and functionality of EOAs.\n\nEthereum co-founder Vitalik Buterin and a team of developers are spearheading a new Ethereum Improvement Proposal (EIP). EIP-7702 will significantly improve smart contract functionality on Ethereum by temporarily merging it into externally owned accounts (EOA), thus simplifying and improving user experience.\n\nRead on to learn about the EIP-7702 proposal on Ethereum, how it works, its potential impact, and its benefits and drawbacks.\n\nWhat Is EIP-7702?\n\nThe EIP-7702 proposal was introduced as an alternative to EIP-3074, which was approved for inclusion in the Pectra upgrade scheduled for Q4 2024.\n\nEIP-3074 was designed to refine account management within the Ethereum protocol by allowing Externally Owned Accounts (EOAs) to assign control to smart contracts, paving the way for more advanced transaction strategies. EOAs are a type of Ethereum account controlled by users rather than code\n\nThe proposal would achieve this by introducing two new opcodes, AUTH and AUTHCALL, enabling EOAs to transition smoothly into smart contracts without deploying new ones. This would improve transaction efficiency and flexibility in interactive scenarios and complex operations.\n\nHowever, EIP-3074 faced some limitations, including technical issues and security challenges. These issues became evident in practical applications, especially when dealing with high-value or large-scale transactions. Vitalik Buterin, alongside Ansgar Dietrichs, Matt Garnett, and Sam Wilson, developed EIP-7702 in response to these issues and as an alternative to EIP-3074.\n\nEIP-7702 is a new proposal that will introduce a new transaction type to enhance the security and functionality of EOAs. The proposal will enable EOAs to behave momentarily like smart contracts.\n\nSimply put, EIP-7702 will inherit and expand some of the functionalities of EIP-3074, such as batch processing, lowering privileges, and transaction sponsorship.\n\nHow Does EIP-7702 Work?\n\nThe proposed EIP-7702 will provide a new method for EOAs to interact within the Ethereum blockchain. Externally owned accounts will be temporarily able to operate as smart contract wallets during transactions before returning to their initial state after the transaction.\n\nThis technique improves the functionality and security of Externally Owned Accounts without launching new opcodes, making assimilation more efficient than EIP-3074. Moreover, removing opcodes from the process helps decrease complexity, compatibility difficulties, development resources, and potential security flaws linked to them.\n\nEIP-7702 has been developed to be forward-thinking, given its compatibility with ERC-4337. ERC-4337 is an account abstraction standard on the Ethereum network that aims to improve security and user experience by launching smart contract functionality in wallets. This integration can help externally owned accounts attain features such as multi-factor authentication, the potential for people to transact using any token, and social recovery.\n\nEIP-7702 can significantly reduce transaction fees by batching transactions, making the Ethereum network more efficient. The proposal promotes financial inclusion by introducing transaction sponsorship, where one user can offset the transaction fees for another user. It also makes the platform more accessible, lowering the barrier to entry.\n\nEIP-7702 also includes downscaling privileges. Accounts can limit their privileges for certain crypto transactions, boosting the platform’s security against fraudulent and phishing activities.\n\nThe Potential Impact of EIP-7702 on the Ethereum Network\n\nThe new Ethereum proposal, EIP-7702, if included in the Pectra upgrade scheduled for Q4 2024, is expected to impact the Ethereum network positively. Although currently in the discussion stage, EIP-7702 offers a robust solution to enhancing Ethereum by introducing account abstraction.\n\nAccount abstraction makes it more flexible for users to program their security better while enjoying an enhanced user experience. Lowering the barrier to entry for Ethereum enhances accessibility, potentially boosting its adoption in the Web3 ecosystem. In addition, smart contracts can provide better safety features, such as recovering funds in case private keys are lost.\n\nTransaction sponsorship also means that users can easily get started with the Ethereum network as they don’t have to worry about buying ether for gas fees.\n\nThe proposal introduces greater flexibility in the design of smart contract wallets for developers. They can customize their verification logic, incorporating features such as emergency recovery techniques, multi-factor authentication, and spending limits. This opens up new opportunities for developers to explore smart contract wallets.\n\nBenefits and Drawbacks of EIP-7702\n\nWhile still in discussions, EIP-7702 has some benefits and drawbacks linked to it. Below are some benefits of the proposal:\n\nBatched Transactions: The Ethereum network can become much more efficient through the batched transaction feature, which can also reduce transaction costs.\n\nERC-4337 Compatibilit y: The EIP-7702 is a forward-thinking proposal compatible with the ERC-4337 standard on Ethereum, which can enhance the user experience and security of the Ethereum blockchain while advancing blockchain technology.\n\nTransaction Sponsorship : If successfully implemented, EIP-7702 will enable users to cover the transaction fees of other users, making the platform more accessible for everyone.\n\nWidespread Ethereum Adoption : By lowering the barrier to entry for users, more people will be able to access and use the Ethereum platform, leading to its widespread adoption.\n\nWhile there is optimism surrounding EIP-7702, it’s not without its drawbacks. Below are some challenges with the EIP-7702 proposal:\n\nAdjusting Gas Costs : It’s still unclear how EIP-7702 will scale the gas fee costs associated with its transactions.\n\nRevocation of Transactions : Implementing EIP-7702 would mean that users relinquish the control of their externally owned accounts to smart contract codes, which, albeit need to be trusted, can be prone to malice. Therefore, the Ethereum team must ensure users can revoke and revert transactions signed using malicious code.\n\nThe Bottom Line\n\nThe introduction of EIP-7702 is expected to benefit Ethereum. Still, its implementation will depend on its developers finding solutions to the raised issues and getting consensus from the Ethereum community.\n\nAnsgar Dietrichs, one of the researchers at the Ethereum Foundation, suggested implementing EIP-7702 to the Pectra upgrade first and tracking it for several weeks before deciding whether to replace EIP-3074 with EIP-7702.\n\nIf incorporated, it remains to be seen how EIP-7702 will revolutionize the Ethereum blockchain."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPTlV6c0JhcV93Y3pRR2NLVXcyOFVjMzNrVnJDc3RTTW9WZktOd29aclhHQ3hLVzNJamh6ZXJDV0N2OGEtbzJEOTdXQV9hVi1FR1QwWURncHZyR2FibUo5eUlGWjZGRzhDVHpORndUbnpBU0hVRE1hZExaWWZfSEJwMWRuRmR3c24t0gGQAUFVX3lxTE9ob09pNGFHQ3M0V0hHakJVSC1hUmthenZjenpfT25BXzNSelpJU0dQQVR3ak9CcDA1VDNtakNiZXNsU2NjTW9GWUVzcEpQWmRaUjFFcVpWRUNSSkRMdFpJUzhsRUJLanotcXllRW9ZUFJfY3RjeDhadHpWRXhnbUJ3czJvZVVQRGhVWVZBZF84Vg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Solana, Avalanche Soar as Ethereum Price Tops $3,500 - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin and Ethereum are up big today—with the latter soaring on rumors that an ETH-based exchange-traded fund (ETF) could soon hit the U.S. market.\n\nThe price of Bitcoin touched $70,000, triggering a flood of liquidations, while ETH is trading over $3,500 as of writing. But the top two coins by market cap aren't the only ones seeing big gains. The entire crypto market is up, with Solana and Avalanche the top gainers.\n\nSolana, the fifth biggest coin by market cap, is up over 8% in the past day and is now trading hands for $184.17, according to CoinGecko.\n\nAD\n\nAD\n\nThe coin isn't as close to breaking records like Bitcoin is, though—it still has to rise in value by another 29% to hit its 2021 all-time high of $259.\n\nElsewhere, Avalanche is also riding high: of the top 20 coins and tokens, it's doing the best, having shot up by nearly 9% in 24 hours. It is now priced at $38.24.\n\nThe coin, which runs on a network used by developers to build decentralized apps, is the 12th biggest digital asset by market cap and last year made headlines when J.P. Morgan announced that it had used its blockchain to tokenize investment portfolios.\n\nFurther down the list of top cryptocurrencies by market cap, price surges have also hit Uniswap (UNI), Pepe, and Lido DAO (LDO) with 24-hour gains of over 18%, 20%, and 21%, respectively.\n\nEthereum, the second biggest cryptocurrency, is currently up 14% in the past day, coming in priced at $3,511. The asset shot up on news that Wall Street's biggest regulator, the Securities and Exchange Commission, could be close to approving a spot ETH ETF.\n\nAD\n\nAD\n\nSuch an investment vehicle would give people exposure to the second biggest digital currency by market cap via shares that trade on a traditional stock exchange.\n\nThe SEC approved 11 spot Bitcoin ETFs in January but has been coy on the issue of approving an ETH equivalent.\n\nA long-list of big Wall Street firms have filed paperwork to release a spot ETH ETF, including BlackRock, Grayscale, and VanEck. Up until the latest rumors, the prospects of approval seemed dim.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE9vaGV6eDhoU0d3cHVlcG5oMklpMDRiRlVYUnVhYzJzYVB3Yk5vOXl1UlBZTDFncXpDbjNZTDg1N0paMExkOTBILUlYZGRSMEd4bWpqWG1PemFfVVBEVU9pMkF0dmtpQmtVZHViQUN5QkE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 May 2024 07:00:00 GMT",
        "title": "Will Ethereum Reach $5000? - Crypto Times",
        "content": "As the overall crypto market begins to show signs of strength, Ethereum, the largest altcoin, sees an overnight increase in price. The bullish resurgence takes back the psychological $3,500 mark as the underlying demand increases in tandem with the improving sentiment surrounding the approval of the Ethereum ETF.\n\nAdditionally, Ethereum’s bull run is further fueled by the market’s recovery rally, which is being supported by Bitcoin’s surge above $70,000. What’s the deal, then? Will the price of Ethereum surpass $5,000?\n\nHere is an overview of Ethereum:\n\nETH Price Prediction For May 2024\n\nThe Ethereum price is $3,813.68, a change of 23.79% over the past 24 hours as of 8:20 p.m. The recent price action in Ethereum left the token’s market capitalization at $453.80B. So far this year, Ethereum has a change of 66.09%. The recent price jump comes along with high volume as it has surged 335% in the last 24 hours.\n\nTechnical Analysis of Ethereum\n\nFrom a technical standpoint, Ether’s current gains are part of a falling wedge breakout.\n\nA falling wedge forms when the price moves within a descending channel with two converging trendlines. Meanwhile, as a rule of technical analysis, the pattern resolves when the price breaks above its upper trendline and rises to its peak height.\n\nEthereum Technical Analysis | Source: Tradingview\n\nToday, the price surged passed the 50-day EMA (Exponential Moving Average), as it moves toward $4000, expected as the initial target of the falling wedge breakout.\n\nEther open interest, funding rate rise sharply\n\nEther’s price increase coincides with a sharp increase in its open interest (OI) and funding rates.\n\nOn May 21, Ether Futures OI increased by more than $3 billion, and jumped to $14.68 billion, while the funding rate reached a one-month high of 0.567% per week.\n\nA high OI typically indicates increased investor interest and confidence in the asset, implying that traders are preparing for possible price movements.\n\nMeanwhile, a high funding rate indicates that more traders are betting on Ether’s price rising (long positions) than on it falling (short positions). This suggests that traders are bullish and willing to pay a premium to maintain their long positions.\n\nCan Ethereum Reach $5,000?\n\nWhile the current market conditions favor Ethereum, reaching $5,000 depends on several factors, including:\n\nOverall market trends: Continued strength in the broader cryptocurrency market would benefit Ethereum.\n\nContinued strength in the broader cryptocurrency market would benefit Ethereum. Regulatory developments: Approval of an Ethereum ETF could trigger a significant price increase.\n\nApproval of an Ethereum ETF could trigger a significant price increase. Ethereum-specific developments: Progress on Ethereum’s upgrade to Ethereum 2.0 could further boost investor confidence.\n\nOverall, the technical indicators and rising investor sentiment paint a bullish picture for Ethereum. However, external factors will ultimately determine whether the token can reach the $5,000 milestone."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFBJSkg5aXZvWnkzNUVFWTRuNldFT3dWaGpaLTBoTXA3Yi1LLXpfdmVNNFhYeEhrZzBiQjlGYll6YXZsYl9UVWVjVjlSa2Z0bFJLaWM3RVZLZTJGYV8yUnVDaXlhUWNFQWx2a0xwSGhXT2NhYXNwc2JHdXhSN3k?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 May 2024 07:00:00 GMT",
        "title": "Obol Network to fund ‘sustainable’ Ethereum development - Blockworks",
        "content": "As the price of ether increases, the cost of running a full solo staking node — with 32 ETH now worth $115,000 — moves further out of reach for all but the most hard core hobbyists.\n\nOne of the social goals that Oisin Kyne and Collin Myers, founders of Obol Network, care about most is enabling people that don’t have that kind of capital to participate in Ethereum consensus.\n\nThe pair looks forward to the day when the number of entities and locations validating the network will rise tenfold from its current crop of single-digit thousands of operators.\n\nThat includes a fellow in a Kenyan village who, according to Kyne, participates in a distributed validator cluster via EtherFi, running his hardware off a Starlink and a generator.\n\n“It certainly feels good to have people that are staking — that have the technical ability and are really into it, but either weren’t in early or don’t have, you know, bags — that can actually decentralize Ethereum and quite happily do it from the middle of nowhere,” Kyne told Blockworks.\n\nObol has spent the past few years proving out the technology to decentralize projects like Lido, its launch partner, and to enable more solo stakers as well as new paradigms like squad staking.\n\n“We worked with [Lido] to integrate the technology into their stack, and now we’re progressively opening the code base, decentralizing the community, and in the future plan to incentivize the community and bring everyone together around this contribution based mindset,” Myers told Blockworks.\n\nAs a first step, Obol has announced the “1% For Decentralisation” funding model for the DVT middleware provider.\n\nUnder the plan, Obol’s distributed validator (DV) clusters will contribute 1% of their staking rewards “toward projects that add value and impact at the Ethereum consensus layer, including technology partners, researchers, community educators, node operators, and more,” according to a blog post published Tuesday.\n\nThe initiative piggybacks off the EasyRetroPGF — or Retroactive Public Goods Funding — system pioneered by GitCoin.\n\nWhereas public good funding from the Optimism Foundation focuses on the execution layer and user adoption, “there needs to be a more concerted focus around the validator, infrastructure area, the consensus integrity, that whole side of the network,” the Obol founders say.\n\nMiddleware provides an interface between Ethereum’s consensus layer and software further up the modular stack.\n\n“The creation of middleware enables add-on use cases to your existing experience,” Myers explained. “Without middleware, it’s just a boring old validator — you can’t do anything.”\n\nMEV Boost is one example in wide use alongside Obol today, that enables the little guy to earn similar staking yields as large professional operators. And soon validators will be able to participate in EigenLayer Actively Validated Services (AVS) or similar offerings on top.\n\n“All of this is an extension of the validator as a world-class citizen of Web3,” Myers said.\n\nEthereum is sometimes criticized for the complexity of its design, or for tolerating centralizing influences in certain areas, such as block building and the scaling of the execution layer.\n\nBut Myers feels those attacks are misplaced.\n\n“From where I sit, two years ago we went from bad rent extraction, client centralization, a completely monolithic software stack, and now we’ve moved to modular, a bit more decentralized, open source, multiple options, lots of funding, good debate — and for me that’s progress,” he said.\n\nWhile there is some movement in the direction of ossifying the base consensus layer, he pushes back against the notion that the roadmap is decreasing innovation at layer one. Rather, “they are just enabling it to exist elsewhere through decentralization…and DVT is a living example of that,” he said.\n\nThe “stage” framework used by L2beat is a useful gauge of decentralization progress, and Osin agreed with Vitalik’s commitment to push “layer-2s” as such to reach the Stage 1 level by the end of the year.\n\n“It’s an interesting social showing, of people being like, ‘no, we’re not going to tolerate a sidechain masquerading as an L2, unless you can permissionlessly exit back to L1,” Osin said.\n\nLido is backing the new Obol funding approach, with contributor Will Shannon, calling it “a fantastic approach to strengthening the resilience and decentralization of the Ethereum protocol.”\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxQX1U0ci1RT0o2ZFVDbmdYcWROZHo2T1M4YWhqLVBOYlZIVTM3U2d4bTc5S3FBd3A4bE9nY2NRSDJISDFJbjVpeE0tV3NhaXUwQV9iQmVJNWU0T3hPdzl3RDd0NWZ1RHRCSkVuXzVFZWwtTjU4MFZYTUM3enRQR0JUYVFMWndVMGxpRW9oYmtvdVlNbTdqS0dEV2Y2OUJXQmY4bW9OVnR4U3ZiMjlKUnhPStIBtgFBVV95cUxPMWxnNGdVLWZlRXp2R3hmSFYySGExZWFfblVsbXJ1ZXRFaVNTeE12b3l2cmVMR2tiWXBnb2pTQ3B3SnlqZWxHb2hHUFlnYUdFWWZ1Z0FjTEZPVC1LMVl1eXh0TmVYUjdjaFZWZE45R19YY25OdThwaDdaSVlHQllVcXFKMlFlcFV2Nm1odUJKTUFTdGkyYjlsa3dTdEdLUW1lN0FsN3dSc3kxampPZ0lId0dvSF9Udw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 May 2024 07:00:00 GMT",
        "title": "How Ethereum Danksharding Will Impact Decentralized Finance - Finance Magnates",
        "content": "The Ethereum network has encountered significant challenges regarding scalability. The current mainnet can only handle 20 to 30 transactions per second (TPS), significantly lower than traditional payment systems. The high transaction fees on Ethereum have deterred users and restricted network accessibility. Initially, during the early stages of Ethereum 2.0, the leading scaling solution proposed was sharding, splitting the Ethereum network into “shards\" for parallel transaction processing.\n\nHowever, due to concerns about complexity and security risks related to cross-shard communication, sharding became less favored over time. Before danksharding, other solutions, such as sharding and layer-2 scaling methods, such as rollups, were suggested to address Ethereum's scalability problems. These alternatives also had limitations in scalability and complexity, leading to the development of danksharding as a solution for scaling the Ethereum network.\n\nWhat is Danksharding?\n\nDanksharding is a highly technical solution that works with Ethereum’s layer-2 scaling solutions, such as roll-ups, to improve scalability and efficiency on the Ethereum network. Ethereum’s danksharding solutions aim to improve the efficiency of the Ethereum blockchain by handling more transactions. This approach, part of the Ethereum 2.0 upgrade, is crafted to outperform traditional sharding methods. In essence, danksharding segments the blockchain into fragments known as shards to process transactions and data simultaneously, enabling improved data processing without causing network congestion or increased fees.\n\nUsing larger data segments, danksharding boosts transaction capacity, enhancing the blockchain's performance. Danksharding aims to reduce transaction expenses and improve throughput by expanding block space and refining data availability. The Dencun upgrade was officially rolled out on the Ethereum mainnet on March 13, 2024. Expert analysts believe that the Dencun upgrade, which includes proto-danksharding, could be a “bullish catalyst” for the Ethereum price prediction in the second half of 2024, with Bed Baddow projecting the highest value the coin could reach by the end of the year is over $6400. This upgrade will impact Ethereum's price, potentially positively driving prices upwards towards this value.\n\nWhat Is the Difference Between Danksharding and Traditional Sharding Methods?\n\nThe main difference between danksharding and traditional sharding methods for Ethereum is the approach to scaling. Traditional sharding aimed to increase Ethereum's transaction processing capacity by dividing the network into multiple “shard chains.” This created a security issue for Ethereum since the multiple shards would share security at a consensus level. For instance, if the network was divided into ten shards, each shard became vulnerable to malicious attacks due to validators being spread out.\n\nTo address the security concerns with traditional sharding and the shift in Ethereum's scaling roadmap towards lay-2 solutions, danksharding was developed as a more secure and efficient scaling solution. This streamlined process is designed to simplify transactions within the network’s shards, providing a more efficient path for Ethereum’s scalability.\n\nHow Will Danksharding Impact the Decentralization of Ethereum?\n\nThe impact of danksharding on the decentralization of Ethereum is a mixed bag, with potential benefits and drawbacks:\n\nPotential Benefits of Decentralization\n\n● Reduced hardware requirements for nodes: Ethereum nodes will only need to store and process data for their assigned shard rather than the entire blockchain history. This reduction in hardware and storage requirements could make it much easier for more nodes to participate in the network, potentially increasing decentralization.\n\n● Improved scalability and efficiency: Dankshanding is expected to improve Ethereum’s scalability and transaction processing efficiency significantly. This could potentially make the network more accessible and attractive to a broader range of users and developers, which could expand decentralization.\n\nPotential Drawbacks\n\n● Vulnerability of smaller rollups: Unlike traditional sharding, danksharding moves the validation of transactions off-chain, with the Ethereum mainnet acting as a data availability layer. However, this shift away from on-chain validation has raised concerns about the network’s overall decentralization, mainly because the validation has become more centralized.\n\n● Shift from on-chain to off-chain validation: Danksharding’s reliance on rollups might expose less popular rollups to security risks due to their limited number of validators. This could consolidate power and influence within well-established rollups, ultimately threatening decentralization.\n\n● Increased validator concentration: Danksharding could lead to block builders and an increase in validators receiving a larger share of Maximal Extractable Value (MEV) profits. This concentration of power among smaller groups of validators can affect the overall decentralization of the network.\n\nIncreased Transaction Processing Capacity\n\nDanksharding is designed to allow Ethereum to process transactions much faster than it currently does. Ethereum transactions using danksharding have the potential to process over 100,000 TPS. This will dramatically improve Ethereum’s scalability, making it more compatible with traditional payment systems.\n\nAdditionally, this allows DeFi applications to handle a much larger volume of transactions, potentially reducing congestion and delays. The increased transaction processing capacity could help reinforce Ethereum’s competitiveness and decentralization in the future.\n\nCompatibility with Layer-2 Solutions\n\nDanksharding is specifically designed to work with Ethereum’s layer-2 scaling solutions. This integration is expected to improve the efficiency and cost-effectiveness of layer-2 networks, making them more competitive with alternative layer-1 blockchains. One of the biggest benefits of danksharding is its ability to reduce transaction fees up to ten times for layer-2 solutions.\n\nChallenges of Danksharding\n\nFull danksharding will take years to implement. The transition from the initial sharding proposal to the danksharding approach required a massive shift in Ethereum’s scaling roadmap, adding to the complexity of implementation.\n\nThe biggest concern and challenge of danksharding is that it compromises Ethereum’s security in the long run. Many see the shift from on-chain validation as a security risk, making the network vulnerable to potential attacks. Ethereum’s use of smaller rollups that handle blob-carrying transactions is seen as vulnerable due to Ethereum’s mainnet’s weaker protection mechanism. Ensuring the security and integrity of the network as it scales will be critical, and Ethereum would need to address this.\n\nFurthermore, the decentralization risks associated with danksharding are from its reliance on layer-2 rollup solutions, which may result in larger and more established rollup providers gaining more influence and power. Maintaining the overall decentralization of the Ethereum network is a vital consideration as the network scales and evolves.\n\nFinal Thoughts\n\nDanksharding is a positive step in the right direction for decentralized finance on the Ethereum network. It can significantly improve scalability, efficiency, and user experience on DeFi applications. This could lead to increased adoption and growth of DeFi platforms, as the reduced costs and increased efficiency make them more attractive to institutions like crypto exchanges, wallets, blockchain gambling and gaming, and metaverse platforms."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxPSXFZTDVsNEliTUpoOGcwVUNReXp6Wm1kS2REX3AyWFVVRG9scUZkUEFaMWp0MzFXbG9qY1JEUzNMekJXdGpEMDM3dmVneWtJbUJqUmVkWHpJeW1qRmhkZGE1enh0dDdZV2h1b05mN0hWbWRpMFZwSWJvRmQ5aUNyOXJ0eHVmZFpJLXNGLWFPN2xXeU5IamdydkhGMHNaYjQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Ethereum soars as odds of ETF approval jump to 75% — ‘SEC could be doing a 180’ - DLNews",
        "content": "Bloomberg Intelligence ETF analyst Eric Balchunas says the odds of the SEC approving the Ethereum ETFs have greatly improved.\n\nThe SEC's sudden change of attitude is leaving everyone scrambling, Balchunas said.\n\nHe upped his odds of approval to 75%, from 25%.\n\nThe odds that the Securities and Exchange Commission will greenlight Ethereum spot exchange-traded fund applications have just increased.\n\nBloomberg Intelligence ETF analyst Eric Balchunas, long bearish on the products’ odds, posted on X that chances of approval have shot up to 75% from 25%.\n\nBalchunas said he was “hearing chatter this afternoon that the SEC could be doing a 180 on this (increasingly political issue), so now everyone is scrambling (like us everyone else assumed they’d be denied).”\n\n“It’s what we’re hearing from multiple sources,” Bloomberg Intelligence ETF research analyst James Seyffart said. “Should see a bunch of filings over coming days if we’re correct.”\n\nEthereum soared 8% off Balchunas’ tweet, recently trading at $3,400.\n\n“If the spot ETH ETF is approved, it will be a true shock to everyone I know in DC who’s close to this process,” Jake Chervinsky, chief legal officer at Variant fund, posted. “It means approval could signal a major shift in US crypto policy after the SAB 121 vote, perhaps more important than the ETF itself.”\n\nLast Thursday, the Senate voted on a resolution to repeal a controversial accounting guidance from the SEC, called SAB 121, which critics say has deterred investment banks from offering crypto custody at scale.\n\nPresident Joe Biden indicated that he would veto the provision if approved. Prominent Democrats, however, have sided with their Republican colleagues against the rule, raising speculation that the White House may back down.\n\nJoin the community to get our latest stories and updates\n\nDeadline\n\nIf the SEC wants to approve the Ethereum ETF products, it will have to be fast about it. The deadline for VanEck’s Ethereum ETF application is on Thursday — and the SEC is unlikely to approve some of the filings ahead of others in order to avoid playing the role of a kingmaker.\n\nNate Geraci, president of ETF Store, said that even with the tight deadline, it would be possible for the SEC to approve one set of important filings, called 19b-4s, before the deadline, and then “slow play” the second set of filings, called S-1s.\n\nThe SEC must approve both set of filings before the ETFs could come to market.\n\nBalchunas had previously told DL News that in light of the reported lack of engagement from the SEC with prospective issuers, Ethereum ETFs were unlikely to get approved before the end of 2025.\n\nIf the ETFs are rejected, issuers will likely wait until after the US presidential election to file again, because a victory for presumptive Republican nominee Donald Trump would probably mean a change of leadership at the SEC — perhaps in favour of someone less antagonistic toward crypto than current chair Gary Gensler.\n\nTom Carreras is a markets correspondent at DL News. Got a tip about Ethereum ETFs? Reach out at tcarreras@dlnews.com"
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxNSnNCeEtKYi1WeDJIbnhfNWJucDh0ZDltVWQybThnUm9iLWwtUTF0VVFrQS1uaHhpWlhrWEhjcE9HLVRmTnUzU3RYNU1ZbUJmY2Z4RXE2TE1kRWFmNTJkNlBJU3BRZXM1R05sOENKNXhtZWtVQmQ5dkh0ZG5rNHFtUzh2VzVqLTlaZ25WNV8tUFhybF91dGZVOW1EbW9LeFk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Ethereum Funds See $23 Million Outflows Amid ETF Speculation - Crypto Times",
        "content": "Investors poured $932 million into digital asset products this week, but Ethereum (ETH) crypto funds bucked the trend, experiencing outflows exceeding $23 million, according to CoinShares, an asset management firm. Analysts attribute these outflows to growing concerns about the US Securities and Exchange Commission (SEC) approving a spot Ethereum exchange-traded fund (ETF).\n\nInvestors favored Bitcoin, with $942 million flowing in, and minimal short positions, indicating positive sentiment. Altcoins like Solana, Chainlink, and Cardano saw inflows of $4.9 million, $3.7 million, and $1.9 million. However, the weekly trading volume was only $10.5 billion, significantly lower than March’s $40 billion.\n\nImage Source: CoinShares (ETF Flows by Providers, Asset & Country)\n\nIn terms of regions, the US led the way this week with inflows of $1 billion. Grayscale, after experiencing significant outflows totaling $16.6 billion since its ETF launch in January, saw its first inflows of $18 million in a notable shift. Following the US, Switzerland and Germany also saw minor inflows, amounting to $27 million and $4.2 million, respectively.\n\nBlockchain equities have had a tough year, with outflows recorded in 14 of the 20 weeks so far, resulting in a cumulative outflow of $512 million.\n\nThe SEC’s potential disapproval of an Ethereum (ETH) exchange-traded fund (ETF) reflects its cautious approach towards crypto regulation. Concerns about market manipulation, investor protection, and the underlying infrastructure of Ethereum may influence their decision.\n\nAdditionally, the lack of clear regulatory guidelines for cryptocurrencies creates uncertainty, making it challenging for the SEC to greenlight such products. Until comprehensive regulatory frameworks are established, the approval of an ETH ETF remains uncertain, impacting investor sentiment and market dynamics."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxQeXh0V3R6MzVVZjlqbFptMjk2T05xdG9yLWJnTzVPOVRSRnF2MEZSVTdLQXRYUncxOEJrb1l4VVJia3QxSzJBOEZfQVFPT241TXNBRTQ4NDVOeFEzdVpYc0kzOVRfSjVmYlFxcG9UNTZPVmxTYnlyM2x1VUVDbThObUJuZk5tLVlPalRmSURlTVBYNklDRHRhd3ZuYkdPR2fSAaQBQVVfeXFMTkJHbkh0RWRiSUw1QWs3RDVZZmFZcFBFOUZhUi1zcjBHc3VnOENDOXlxRktKN0xJMUxjek50SFpkMVl4THlrMmZyQnhoSzFBOHJJSUxEWGlYNW8wN2ZnN0dmemFvMElaR1FGSFVyenZIUVpHRVZMV2FCb3pQcEdERmR2MW1kNkRSTnpVRldUNm9raUJCVExjdW1TNHZKRnRzLW5vTm0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 May 2024 07:00:00 GMT",
        "title": "Meme Coins MOG, PEPE Rocket as Traders Search for Ether Beta Bets - CoinDesk",
        "content": "The focus on meme coins as a way of betting on growth isn't unique to Ethereum. Several Solana-based meme coin tokens surged from December to March as the network’s SOL tokens took off – contributing to ecosystem growth and attention. Also in December, the Avalanche Foundation, a non-profit that maintains the Avalanche blockchain, said it would invest in meme tokens built on the network in recognition of the online culture and memetic value that such tokens can drive among investors."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxOQ0J1c0pvNlRmaS1OVF9vTjRwWG5OUlBFZEJnLWNPRjNjemtJZkpieW9Ic3UyZDB5MUl2dTN4blVObHBmSmZKMmhSUnpmaUwyWU1oZExWTGtCc2dwUktieTVkLTI5eDdMUjNFeHQxcGZ5MzJPOV9ESDVYRGFkRTNSVVdQUjlIUVI1bFV4RHJyWEZUcklhSkxLdnp2SdIBoAFBVV95cUxNa2NnbnA2aVFzUlJESVc5V0Yxd2twQlJ0LTRUckMybG9Gc2o2ZnlYb3ZOOFpsMU1YbUpUbm1JM1g1aUE3d3BjelpwTDllaFhodXhZaG1QT3RLMm9pbEotZ0FNRU5Ja0lDNE1SdFA1QkNDc21ORnBYVG1BYjhiVjJxQmRta0tfNDZJcUYwakxwZXU4MzVPT2FHMldKWm9WdEpS?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 May 2024 07:00:00 GMT",
        "title": "SEC signals possible approval of anticipated Ethereum spot ETFs - Fox Business",
        "content": "The Securities and Exchange Commission is moving closer to approving a highly anticipated 'spot' Ethereum exchange-traded fund as soon as this week, FOX Business has learned.\n\nAccording to sources close to the Commission, the SEC and its Chairman Gary Gensler are taking cues from recent court rulings and prior guidance on Ethereum futures ETFs to grant nine issuers permission to offer products that track the daily price of the world's second largest cryptocurrency.\n\nSEC CHAIRMAN GENSLER'S STATEMENT ON SPOT BITCOIN ETFS\n\nWhile approval isn't certain, SEC staff have been signaling they're warming up to the idea of at least partially green lighting these products as soon as Thursday, which is the deadline for the agency to decide whether to approve so-called 19b-4 applications filed by the CBOE exchange, requesting to list Ethereum spot ETFs from VanEck and Ark Investments in partnership with 21 Shares.\n\nApproving the 19b-4 applications is the first in a two-part process where the SEC would also have to approve issuers' registration statements, known as S-1s - a process that could take several weeks - meaning the ETFs may not officially launch until later this year.\n\nCONSUMER ETFS SHOWING THE REAL INFLATION PICTURE\n\nBut an SEC blessing would be yet another significant development in the maturation of the $2 trillion crypto industry.\n\nMany had given up hope the SEC would smile on an Ethereum spot ETF, given the lack of engagement on applications and the uncertainty surrounding the Commission's thinking about Ethereum's status as a possible security.\n\nBut on Monday the SEC began actively engaging with issuers and national exchanges ahead of Thursday's deadline, which is what it did before approving eleven ETFs that tracked the daily price of Bitcoin in January.\n\nLIVE CRYPTOCURRENCY PRICES: HERE\n\nThe SEC, through a spokesman, declined to comment.\n\nPotential ETF issuers who spoke on the condition of anonymity tell FOX Business they were surprised by what appeared to be a sudden change of heart by the agency.\n\nMany industry participants have attributed the abrupt SEC engagement to the increasing bipartisan support for the digital assets industry from Congress and former President Trump, who has said he would embrace the use of crypto and end the Biden Administration's regulatory \"hostility\" towards the industry if elected.\n\nOn Tuesday, the Trump campaign updated its website to accept donations in cryptocurrency.\n\nStill, sources familiar with Gensler's thinking say he has been looking at other factors such as the court ruling involving crypto asset manager Grayscale and the Commission's prior green lighting of Ethereum futures ETFs, which came to market in October.\n\nBITCOIN'S BOUNCE IN EARLY INNINGS\n\nLast summer, a federal appeals court rejected the SEC's decision to deny Grayscale's petition to convert its GBTC Bitcoin Trust into a spot ETF, saying the agency failed to make convincing arguments the bitcoin spot ETF was materially different to the futures ETF which had been trading since 2021. The Grayscale ruling laid the groundwork for the rollout of the bitcoin spot ETFs, and now, possibly the Ethereum spot ETFs as well.\n\nAccording to paperwork filed today by issuers, it appears the SEC's main sticking point for approving an Ethereum spot ETF is the so-called \"staking,\" which allows investors to earn passive income by staking their Ethereum as collateral and earning a return. In an ETF format, it may allow for investors to receive greater returns as opposed to the ones they may receive with an ETF that solely tracks the daily price of Ethereum.\n\nIt's staking by which the SEC believes it may have a case that \"Ethereum 2.0\", or Ethereum issued since the blockchain's merge to a so-called \"proof-of-stake\" consensus mechanism in 2022, may qualify as a security.\n\nIndeed, if the SEC approves the Ethereum ETFs on Thursday without the staking component, it doesn't negate the fact that Ethereum issued on today's proof-of-stake network may be a security in the eyes of the Commission. FOX Business reported in April that the SEC's Enforcement Division has been investigating Ethereum, its merge, and companies and individuals associated with it for at least a year.\n\nWhile the SEC maintains outside political factors do not influence it, there's no doubt crypto has become an increasingly political issue in recent weeks.\n\nSPOT BITCOIN ETFS: HOW TO INVEST AND WHAT IT MEANS\n\nThe Biden Administration, including Senate Democrats such as majority leader, Chuck Schumer (D-New York), appear worried that Republicans and GOP presidential candidate Donald Trump could seize on the growing popularity of digital assets, particularly among young voters, and use the administration's crypto crackdown to win votes and take the White House and possibly the Senate.\n\nLast week, Schumer led a group of twelve Democrats to vote to repeal a controversial SEC rule that would limit the ability of crypto companies to get fair access to the banking system. The 60-38 vote to repeal was widely regarded as a breakthrough moment for the industry, who until recently, has grappled with a Democratic party that's shown unwavering support for Gensler and his regulatory crackdown on crypto.\n\nOn Wednesday, the House is scheduled to vote on a first-of-its-kind bill that would establish a comprehensive regulatory framework for digital assets, a base for establishing clarity for crypto companies and investors."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTFBLNkp1bU41M01aNExQcURCVTZWMWFnS1ZrR0xCWlAzVm5XQ3U2bDd6b3QzTlVabnJjbnRqYjJfTHZXSzBoZHdyeUF2LVZramxPd3YzTHhFQWJZbkFtNDltWXpjUjJZX2VwSE03Qlg1eGNyY0NTc1dzQtIBgAFBVV95cUxQRUNHQUJhTERKWlJBYjdINkFja3BtNEhsZzhTNmR4NU9VYVNMTUhKYVZNZDhsOXd4OVc3ZVk3bTcyUFVCTXdCYXlaM1p5eHUzR2V0b2d4eUJoM2I1RE9yM2lGdF9ZZEJRNU52S25JblBYc3czOHRJZHVnWHl2N0NxZg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 May 2024 07:00:00 GMT",
        "title": "Ethereum Futures Market Breaks Record as ETF Euphoria Ensnares Traders - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nOpen interest for Ethereum futures contracts hit $15.5 billion on Tuesday following rumors that the Securities and Exchange Commission was closer to approving ETH exchange-traded funds this week.\n\nThe sudden blast of optimism has fueled a rush of upward movement across markets, and CoinGlass data shows that open interest on all crypto exchanges was at a record of 4.13 million ETH—surging by 32% in 24 hours.\n\nDeribit CEO Luuk Strijers told Decrypt that the trading volume was “unprecedented.”\n\nAD\n\nAD\n\n“This surge [in futures trading] reflects the heightened market activity and interest as traders and investors position themselves to capitalize on the potential approval,” Strijers said.\n\nIn the derivatives market, futures contracts are an agreement to buy or sell an asset at a specific price at a later date. They allow traders to speculate on movements in an asset’s price.\n\nIt’s a marked turnaround for the second largest cryptocurrency after months of hand wringing. Until this week, it was expected by industry observers and analysts that the SEC would not approve a spot ETH exchange traded fund (ETF) by the May 23 deadline.\n\nBut yesterday, ETF analysts at Bloomberg said that they had heard Wall Street’s biggest regulator would go ahead and give the green light to the funds after fund managers started updating paperwork for the potential products.\n\nThe price of ETH has rocketed as a result: ETH is currently trading at $3,752, according to CoinGecko, having shot up 19% in 24 hours.\n\nAD\n\nAD\n\nAnd it isn’t only ETH that is doing well: almost every other coin and token is up. Bitcoin, the biggest and oldest cryptocurrency, yesterday rocketed to over $70,000 per coin. It’s since dropped and is priced at $69,753.\n\nMeme coins and tokens have also surged, as have altcoins like Solana and Avalanche.\n\nLots of top asset managers have filed paperwork with the SEC to release a spot ETH ETF in the United States.\n\nIf approved, ordinary investors could get exposure to ETH by buying shares that track the price of the cryptocurrency, which is the second biggest by market cap.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQYkJFNnhGeXVjYXEzN0wxVFQ5LUliMXpWUHh4VkduZUpEdEtDclRLblhYNW5GSUlpckdIdUNsNFZxS3YtcWtkamxXX3E3MUpqa2hkWUVYZEt1d19aMUtTZmVWRFAwdVdDMnBQOFA2UGdRZ1ZNZVVKWC0tdXRqNGt0TGF2MnRJaHBpMnd3WHhXek9nTTRZQXJjZg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 May 2024 07:00:00 GMT",
        "title": "Why Ethereum, Solana, Avalanche, and Chainlink Are Soaring - The Motley Fool",
        "content": "A potentially historic decision is benefiting Ethereum and several other cryptocurrencies.\n\nOver the past 24 hours, Ethereum (ETH 0.13%) surged more than 25%, rising from just $3,000 to more than $3,700 at one point. This bullish momentum is primarily driven by growing anticipation surrounding the potential approval of a spot Ethereum exchange-traded fund (ETF), a development that could have profound implications for the broader cryptocurrency market.\n\nThe SEC's shift and expedited revisions\n\nFor a long time, the approval of an Ethereum ETF seemed like a distant possibility. Many analysts and market participants believed that the Securities and Exchange Commission (SEC) wouldn't greenlight such an ETF, as they believed it to be a security and not a commodity like Bitcoin (BTC -1.56%), which received its own spot ETF approval in January this year.\n\nHowever, sentiment has shifted dramatically. Rumors are swirling that the SEC has requested several applicants to expedite their revisions to their 19b-4s. These applications, which are essential for listing new ETFs, must be corrected, allowing for the final approval with an S-1 application and thereby pave the way for the ETFs to start trading.\n\nImpact on Ethereum\n\nThe prospect of an Ethereum ETF is significant for several reasons. First, it would provide investors unfamiliar or uncomfortable navigating crypto exchanges and digital wallets an easy way to invest. If approved, then investors can buy the Ethereum ETF off their preferred brokerage, just as with any other stock.\n\nYet the most important aspect of a potential approval comes in the form of institutional investors. Currently, institutional investors face several hurdles when attempting to invest in cryptocurrencies directly, including custody concerns, regulatory uncertainties, and market volatility. An ETF would alleviate many of these issues, making it easier for institutional capital to flow into the Ethereum market.\n\nWith easier access, it is expected that the deep pockets of institutional investors could cause Ethereum's price to soar. The Bitcoin ETFs were already some of the most successful ETFs ever launched, and if Ethereum follows a similar path, it could result in a significant price surge.\n\nRipple effect on other cryptocurrencies\n\nWhile the focus is primarily on Ethereum, the positive sentiment has spilled over into other cryptocurrencies. Solana (SOL -1.43%), Avalanche (AVAX -0.59%), and Chainlink (LINK -1.45%) have all seen their prices rise by more than 25% in the past 24 hours.\n\nThese cryptocurrencies, often referred to as \"altcoins,\" have been subject to heightened scrutiny lately because of their similarities with Ethereum, namely their proof-of-stake consensus mechanisms. Many agency officials believe proof-of-stake cryptocurrencies are closer to a security than to a commodity. But with a potential Ethereum ETF approval this opinion might be changing and could give a boost to other proof of stake cryptocurrencies.\n\nAnalysts' predictions and timelines\n\nWhile the approval of an Ethereum ETF is not yet guaranteed, analysts currently estimate a 75% chance of approval. This optimistic outlook is based on the SEC's recent actions and the growing recognition of Ethereum's importance in the cryptocurrency ecosystem.\n\nIf all goes according to plan, the earliest the ETFs could start trading is around the end of June. Applicants will need to revise and correct their applications, a process that typically takes several weeks.\n\nThe potential approval of an Ethereum ETF represents a monumental shift in the regulatory landscape, offering a more accessible and secure investment vehicle for both retail and institutional investors. While the final decision is still pending, the current sentiment is overwhelmingly positive, and the approval could mark a new era of growth and adoption for the cryptocurrency market."
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxNMEIyeENSLTFUOHBMZkN1WW8xdDRkaFVzOGpWODk3MTk4NmlHWkFoczk1RW00RU0zRXFjRmxNQWphM0dwOWthblRxd3VQc2QwWEVoSDBuNUVqNGdJSmNyYUQ2ZUl6S2lZNWJYRVVhN0xXZDJUYVQxRTBRbERDNGFkYWdFQ24xMUxsOG9jbGstbzlhWFhWZ1lGWTdfV29GcElwcVl4RW5fUWNQcmxDQy1JMjRfNXBaVU9JV0N2Zk10YmIwUjJ6ckE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 May 2024 07:00:00 GMT",
        "title": "The price of Ethereum flies to $3,700 thanks to the news of the ETF: attention to Wednesday! - The Cryptonomist",
        "content": "Yesterday, at 9.00 pm, the price of ETH soared registering an hourly candle of +9.2% following the news leaked on X regarding an approval by the SEC of Ethereum spot ETFs on Wall Street by Wednesday.\n\nAccording to reports from Bloomberg and Coindesk, the chances of an imminent introduction of this investment product on US exchanges have suddenly increased from 25% to 75%, fueling wild speculation on the cryptocurrency.\n\nNow ETH has continued its bullish run up to 3,700 USD and could soon pay another visit to the 4,000 USD area: volatility coming in the next few days.\n\nEverything you need to know below.\n\nThe chances of SEC approval for the ETF ETH are increasing\n\nUntil a few hours ago it seemed like just a mirage, now instead the chances of seeing the Ethereum spot ETF approved on Wall Street have increased dramatically after the latest breaking news arrived on X yesterday evening.\n\nAs publicly reported by Eric Balchunas, senior ETF analyst at Bloomberg, suddenly the Securities and Exchange Commission seems to be strongly inclined to definitively approve both form 19b-4s and the S-1s registration statement for the requests of several investment funds in relation to the fillings submitted in recent months to the US market watchdog.\n\nAs confirmed also by colleague James Seyffart, and by ETFStore president Nate Geraci, at the center of this change in perspective by the federal agency there seem to be political motivations, with President Biden who seems to want to appear more crypto-friendly in view of the US presidential elections in November.\n\nSuddenly the odds of approval for the Ethereum spot ETF by the May 23 deadline have jumped from a mere 25% to 75% (Bloomberg Odds).\n\nUpdate: @JSeyff and I are increasing our odds of spot Ether ETF approval to 75% (up from 25%), hearing chatter this afternoon that SEC could be doing a 180 on this (increasingly political issue), so now everyone scrambling (like us everyone else assumed they'd be denied). See… https://t.co/gcxgYHz3om — Eric Balchunas (@EricBalchunas) May 20, 2024\n\nJust an hour after the news spread by Balchunas, the information portal Coindesk published an article reporting some rumors from 3 different sources close to the SEC, according to which Gary Gensler and company would be asking requesting funds to quickly update the 19b-4 documents by Wednesday.\n\nThis in itself does not necessarily imply approval by the deadline date, considering that in addition to 19b-4 the SEC must carefully review the S-1 documents, and it may take longer than expected before giving a final response.\n\nCoindesk also reports that a company in negotiations with the federal entity believes that the market is on track for an imminent approval, and that ETH will not be considered as security.\n\nThe soap opera of crypto ETFs continues, started at the beginning of the year after the fake news emerged about a supposed approval of Bitcoin exchange-traded funds, then denied by the SEC and finally confirmed a couple of weeks later.\n\nIn this case, given the reliability of the sources, we exclude the hypothesis fake news but remain on alert until the actual communication from the SEC.\n\nWe do not exclude a postponement, precisely for the reasons mentioned above regarding the S-1 document theme, and consequently a negative market reaction, with the price of ETH that could be strongly affected downwards.\n\nAll eyes are on the next two days, especially on the date of Thursday, March 23, deadline for the request of the ETF by Vaneck, even if as Bloomberg analysts affirm, the official announcement could arrive as early as Wednesday.\n\nEthereum price rises by 20% in one day thanks to the news on ETFs: local peak coming\n\nFollowing the news on the ETF ETH, with the chances of approval drastically increasing from one moment to the next, the price of Ethereum has increased sharply in just a few hours.\n\nFrom 9:00 pm yesterday until now, ETH has grown by 17.81% going from 3,150 USD to the current 3,714 USD.\n\nIn the last 24 hours, the price evolution has an impact of 20%, with volumes exploding by +255%: we are talking about one of the most extreme pumps in the last years in the history of Ethereum.\n\nHourly chart of the price of Ethereum (ETH/USD), Coinbase market\n\nAs user X “bx1core” points out, in less than a day about 70 billion dollars of market capitalization have been added, almost as much as the entire market value of Solana.\n\nThis highlights how investors are bullish on the second largest cryptocurrency in the sector, and how their short-term sentiment depends on decisions regarding the approval or rejection of the spot ETF.\n\nIndeed, the news of an approval could bring, as happened analogously with Bitcoin, a strong inflow of institutional capital with consequent increase in the price of the underlying asset.\n\n$ETH literally added Solana’s entire marketcap in one single candle\n\n\n\nSit down the king is home pic.twitter.com/eDziukrHw1 — bx1 (@bx1core) May 21, 2024\n\nIn a blink of an eye, the market outlook of Ethereum changes completely: with the latest rally, the chances of a breakout of the local high at 4,090 USD also increase in the coming days and of a subsequent breakout of the historical high set at 4,860 USD.\n\nIf the ETF is approved definitively, we could celebrate an event that will be remembered for a long time, whose effects will be visible even in the next 10 years.\n\nNow, however, maximum attention to short-term manipulations: those who know the crypto market well know that these are tempting opportunities to generate extreme volatility, perfect for making stellar gains or printing solemn losses.\n\nDO NOT BETRAY the EVENT: despite the news emerged, betting on the rise or fall at the same time as the deadline date is like flipping a coin.\n\nInstead if the goal is to accumulate ETH, a winning strategy could be to place a buy order in the price range from $3,200 to $2,900.\n\nOpen eyes and eye on market volatility: stay safe traders!"
    },
    {
        "id": 73,
        "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE9yRXpjMEhVYk9talpuNVg3YmVTT2ZnMFZLRXN0aXlNQTZMVU4tNVo1YUZBNlA5WlY4X2pUWVlqdTI3QnNTMmo5ZkNIOFZpbHJVcXNhM3pfeGFSTVBZc2hJcFB1SzJVbmllOC15cTFqUWo2OXQ5Q19F0gF_QVVfeXFMTmNEMW1oZGNNOUk4UzctcjdnQkhJalBEdkxVRy1XU3lUeEhJR0Qyek16QTBwQU0zdlNaVE55RW43Y2tOVDNOLTN5TGUydlk3SXM2dnkxSEhFVHMtUTJTaUlLMkcwQTdwTnZqOFRYdDBXNXJjWHR4c0YzQ1hWUDgybw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Ethereum Soars 20%, Lifting Arbitrum and Optimism - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nRumors of a potential approval of Ethereum spot ETFs have fueled a full day of gains for the Ethereum ecosystem, with the price of ETH skyrocketing 20% intraday to just shy of $3,700—trading at $3,687 at time of writing—and sister tokens Arbitrum (ARB) and Optimism (OP) both notching gains of 18% on Monday.\n\nThe optimistic mood had already spread to other cryptocurrencies, including Solana (SOL) and Avalanche (AVAX), which are peaking above $40 and $188 respectively, as of this writing, representing more than 25% gains over the last seven days for both.\n\nThe sudden rally to start the week was sparked moments after two Bloomberg ETF analysts—Eric Balchunas and James Seyffart—revealed their joint prediction that the Securities and Exchange Commission “could be doing a 180 on this increasingly political issue” and approve Ethereum spot ETFs when its first major deadline comes later this week.\n\nThey increased their estimated odds of approval to 75%—a huge upgrade from their prior estimate of 25%, which was already more pessimistic than other analysts who placed the chances at 50-50 earlier this year.\n\nAD\n\nAD\n\nUpdate: @JSeyff and I are increasing our odds of spot Ether ETF approval to 75% (up from 25%), hearing chatter this afternoon that SEC could be doing a 180 on this (increasingly political issue), so now everyone scrambling (like us everyone else assumed they'd be denied). See… https://t.co/gcxgYHz3om — Eric Balchunas (@EricBalchunas) May 20, 2024\n\nCrypto oddsmakers are certainly shifting their views, with the collective probability of an Ethereum spot ETF approval by the end of the month leaping from 10% yesterday to 61% on Polymarket, as of this writing. Optimism had been declining steadily since the betting option appeared in January at 76%, when Bitcoin spot ETFs were unleashed.\n\nAs with the long and meandering Bitcoin spot ETF approval process, the SEC has systematically delayed making a decision on the Ethereum equivalents. Hopes for approval had dimmed, with fears peaking that this week's deadline would prompt the federal regulator to outright declare Ethereum a security, decisively separating it from the commodity status enjoyed by Bitcoin.\n\nLate last week, however, a debate on Capitol Hill prompted many Democrats to join Republicans in defiance of Pres. Joe Biden's pro-SEC stance, a significant battle in a broadly partisan war over U.S. crypto policy.\n\nAD\n\nAD\n\nI don’t think people appreciate how huge that vote was. Warren had a strangle hold over financial policy under the Dems. This is showing the WH and Senate Dems are starting to realize that’s toxic to their election odds. They also realize there are *a lot* of moderates,… https://t.co/w8gsmw6BIn — Adam Cochran (adamscochran.eth) (@adamscochran) May 20, 2024\n\nMeanwhile, leading cryptocurrency exchange Coinbase said it saw Ethereum spot ETFs as an eventuality—if not immediately approved on May 23.\n\nAll of this came as top coin Bitcoin was in the middle of its own rally, the price of BTC clearing $70,000 earlier in the day amid massive short-position liquidiations—heights not seen since April 12, and approaching the $73,737 all-time high set in March.\n\nThe good mood was contagious, and by late Monday, the top 25 cryptocurrencies by market cap were all green for the day—and for the prior 7 days.\n\nAmong meme coins, Bonk and Pepe are both up more than 20% in the last 24 hours."
    },
    {
        "id": 77,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxPamwteWpZU3d1TnZKMzhGQWVZS25tOVNQTDVTeVE4Z19MUU10TzQ4WkZ0ZFVBZmJFRGlMNjdMdXdKWXdLdGFTNFFKcWc2cVJKbzVZQzBNdlJSUkRiMldkbHc1LVY2UFdWQ3F4UHlfMUlUSjNXalU2RWs3bVNkUng4WWVXZzJ6OGpQNElEalBqZWhBY0R3aEE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 May 2024 07:00:00 GMT",
        "title": "Ethereum is shining brightly: Crypto analysis of May 21, 2024 - Cointribune EN",
        "content": "Tue 21 May 2024 ▪ 4 min read ▪ by Family Trading ▪\n\nWhile Ethereum seemed on the brink of oblivion, its price rebounded by nearly 20%. Let’s examine the future prospects for ETH together.\n\nEthereum (ETH) Price Situation\n\nAfter facing downward pressure that pushed it down to $2,900, the Ethereum price stabilized at this price level. It took waiting until the week of the final deadline for the approval of Ethereum spot ETFs by VanEck, 21Shares & ARK, for the cryptocurrency’s volatility to increase. Fortunately for Ethereum, expectations that became more optimistic on Monday, May 20, allowed the cryptocurrency to appreciate by over 20%. Thus, Ethereum reached a resistance level of $3,700, as noted in the analysis of May 9, 2024.\n\nAt the time of writing this article, one Ether is worth $3,650. It seems that the cryptocurrency is now stabilizing below its resistance level. These recent bullish fluctuations have allowed ETH to position itself again above its 50-day moving average, which could reassure investors about the cryptocurrency’s trend. On the side of Ethereum’s momentum, a notable recovery can be observed, as evidenced by the oscillators and the price of Ethereum itself. All these elements thus seem encouraging for the continuation of this movement.\n\nETH/USD Chart (1D)\n\nThe current technical analysis was conducted in collaboration with Elie FT, an investor and passionate trader in the cryptocurrency market. Today, he is a trainer at Family Trading, a community of thousands of proprietary traders active since 2017. There you will find Lives, educational content, and mutual support around financial markets in a professional and warm atmosphere.\n\nHypotheses for Ethereum (ETH) Price\n\nIf the Ethereum price remains above $3,400, we could anticipate a breakthrough of $3,700. The next resistance to consider would be $3,900, or even $4,100. If the bullish movement continues, a new high at $4,400 could be marked. If Ethereum’s momentum accelerates, it would not be impossible for Ethereum to reach its all-time high around $4,800. At this stage, it would represent an increase of over 31%.\n\nIf the Ethereum price fails to stay above $3,400, a return around $3,100 could be considered. The next support to consider, if the bearish movement continues, would be in a price range around $3,050. At this stage, it would represent a decrease close to -17%.\n\nConclusion\n\nFollowing a period of decline, Ethereum has experienced a remarkable recovery, supported by optimistic expectations related to the approval of Ethereum spot ETFs. This positive momentum, illustrated by reaching a key resistance level and a regain of confidence among investors, suggests an encouraging trend for the cryptocurrency. However, we will have to wait for official announcements to confirm the acceptance of these ETFs and, consequently, the continuation of enthusiasm for the cryptocurrency. Thus, it will be crucial to closely observe the price reaction to different key levels to confirm or refute the current hypotheses. It is also important to remain vigilant in the face of potential “fake outs” and market “squeezes” in each scenario. Finally, let us remember that these analyses are based solely on technical criteria and that cryptocurrency prices can also evolve rapidly based on other more fundamental factors.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 82,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxOUUdweGhfajduRzA4Wk9NbTN0Uk9uV0lTZkxuNlN2dWZXWWdRMlJRNGdsbUZxTXVCdTlNSnM3VUVDdkUzR1ZidjFYbm95ZXNxMDMtcUdEaDN5Nk9SZDBnYkVaLUpRQ0JuSGVlNWpUVkhtZVR1U3ZsRTVNeURWNzd3dNIBiAFBVV95cUxQZlNVTE5FZmVETGh3NDdoRWN6UWZvWEhDNi1Bck5GMkJOME5WSlBxRF9ReXhBeFJFVzNVc3MtaHJZVG4yX3FTdkRaZXN2YUF6aUtoUkxpVDFldlA4cE1BdUQtY3VSUnd0MW5QamRaSkZYVnFmS0s5cWtzYW5yY0ZVNG96SUZNNnFW?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 May 2024 07:00:00 GMT",
        "title": "Ethereum Isn't 'Unified' Enough Amid Layer-2 Expansion, Says Vitalik Buterin - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nVitalik Buterin, the prominent co-founder of Ethereum, took to Twitter (aka X) to call for better interoperability between Ethereum layer-2 networks, suggesting that the ecosystem isn’t “unified” amid a growing pack of networks that attempt to scale ETH in various ways.\n\n“The L2-verse doesn’t feel enough like a unified Ethereum,” Buterin said on Twitter. “It's much better than a year ago, but still far from perfect.”\n\nThe Canadian programmer is calling for an “open, decentralized, operator-free, governance-free protocol” that will allow assets to be seamlessly bridged from one layer-2 network to another. This protocol should then be natively integrated into wallets, Buterin added.\n\n“Get the basics done before getting too committed to any fancy toys,” he said, in response to someone calling for more advanced optimizations of Ethereum scalability.\n\nAD\n\nAD\n\nWe need an open decentralized (operator-free, governance-free) protocol for quickly moving assets from one L2 to another, and for that to be integrated into wallets' default sending interface. Get the basics done before getting too committed to any fancy toys. — vitalik.eth (@VitalikButerin) May 21, 2024\n\nCurrently, bridge options—such as Optimism’s Superchain—are being built to allow assets to be moved from one chain to another. But that’s just for chains building on the OP Stack. Buterin believes that having multiple solutions is damaging.\n\n“We need to get serious on doing this Ethereum-wide,” he explained on Twitter. “If there are five separate solutions for five sub-ecosystems, that's needless fragmentation.”\n\nHow could this be achieved? Buterin believes that alongside the Protocol Guild—a collective of Ethereum contributors working to maintain and evolve the protocol—the community should create a “Basic Infrastructure Guild.”\n\nAD\n\nAD\n\nThis new collective should aim to accelerate cross-layer-2 bridging solutions, develop zero-knowledge Ethereum Virtual Machines (zkEVMs), and work on other “public good” infrastructure solutions.\n\n“Set the standard that these things are ecosystem-wide public goods, and not products of individual companies,” Buterin said on Twitter. “Though like Linux, individual companies should absolutely be welcome to participate and even take initiative.”\n\nEdited by Andrew Hayward"
    },
    {
        "id": 83,
        "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE13YVFsTVl1SlhYTlFYTzRrOXRkRHNfYmxQZm9Ua0lPd0xNUkhtNTNrazUwQ0JuVmhqdjNCUjNJWUFJMkxEY19iQzlCX05UejBPa29lWjByeklHRmZROEpLWmZ3aDR4LUZIQXdBWGZ2SGkyUdIBekFVX3lxTE05YUJyZGplVEVjUkY0RjF3bXNselBSelI2R0xxSzFSQ3VfSEF6a3FTZTZPUTM1aHNMSmJrcHlfSkVVWWZORkd1R3FINjBnaWt5SlJ1cEtRVFNtZXZuU3o0M0xFWW8zMV9mdVc2Z3ptdDdHSVBHS1hqVjdR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 May 2024 07:00:00 GMT",
        "title": "Ethereum Still Above $3,600 as ETF Approval Hopes Swell - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEthereum took a big leap last night and early this morning on reports that the Securities and Exchange Commission has asked spot ETF applicants to submit revised 19b-4 filings.\n\nThe 19b-4 filings are what firms use to propose rule changes to the SEC. In this case, applicants would need the regulator to change their rules to allow for Ethereum spot ETFs to trade on exchanges.\n\nWhen this happened for spot Bitcoin ETF applicants in January, the industry was just days away from an historical approval of all 11 spot Bitcoin ETFs. There's no guarantee, of course, that things will play out quite the same as they did then. But sentiment around this week's upcoming deadline has taken a big swing and sent ripples throughout the market.\n\nAt the time of writing, the Ethereum price is holding above $3,600 and has seen volumes increase 219% in the past 24 hours, according to Coinglass.\n\nAD\n\nAD\n\nStablecoin Open Dollar founder Joseph Schiarizzi noted on Twitter last night that Ethereum increased its market capitalization—now $439 billion—in 3 minutes by as much as half that of Ethereum competitor Solana.\n\nETH just added half of Solana's market cap in 3 minutes. — JOSΞPH 🍩 (@CupOJoseph) May 20, 2024\n\nDelegate Labs and Clusters founder Foobar noted on Twitter that the spike in price had created the largest ETHUSD daily candle in history as the price went from $3,070 to $3,661.\n\nMeanwhile the open interest, or open ETH futures contracts, has swelled 26% in the past day to $15 billion. And call options—which are opened by optimistic traders who think the price of an asset is going to increase—outnumber put options almost 2:1, according to Coinglass.\n\nAD\n\nAD\n\nThere's now $3 billion worth of open interest in Ethereum options that expire at the end of May and June.\n\nThe potential approval, or at least a step towards it, has gotten analysts wondering how the SEC could grant an approval while also fighting court battles over ETH's status as a security.\n\n\"If the speculation about a 180 from SEC on the Ethereum ETFs is true, I would guess they try to thread a needle between 'ETH' NOT being a security and 'staked ETH' (or even more flimsily, 'staking as a service ETH') as BEING a security,\" wrote Alex Thorn, head of research at Galaxy Digital, wrote on Twitter.\n\nif the speculation about a 180 from SEC on the ethereum ETFs is true, i would guess they try to thread a needle between “ETH” NOT being a security and “staked ETH” (or even more flimsily, “staking as a service ETH”) as BEING a security. that would be somewhat congruent with… — Alex Thorn (@intangiblecoins) May 21, 2024\n\nJust a month ago, Ethereum software giant Consensys filed a lawsuit against the SEC over its attempts to regulate ETH like a security. It was only a few weeks ago that court filings from that lawsuit revealed that a leaked internal memo from the SEC showed that the regulator has considered Ethereum to be a security for more than a year.\n\nIf the SEC does approve spot Ethereum ETFs to begin trading, Singapore trading firm QCP Capital predicts ETH could quickly close the gap to $4,000 and rise as high as $5,000 before the end of the year.\n\n\"⁠If not approved, we could expect an ugly move back to 3k,\" the firm wrote in a blog post. \"This uncertainty has resulted in higher volatility, but the better trade might be spot-futures basis which is now yielding above 10% again.\"\n\n(Disclosure: Consensys is one of 22 investors in Decrypt)\n\nAD\n\nAD"
    },
    {
        "id": 91,
        "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxQSk1lbFhvSVNHb2U1YXhVRFlaVkwwWTJMTzNNLXJkdFJ2N0NtMkpTODc3a2RaWFZJbEM1NUZmWm9EaVkxWlhvYzNFR29ucEltc2hqTmJHZEx4Um1RZ0JjbHkwQ2N3YU0yaVB5Qks5STFUSkx2d1F6ZW1aVTl3UnRmbzBBZUdBOUpZS0RGZ3ZRektNbzIxVGEyeWJiVkE0cmUyOGRjWl8wdWtfN1Y5UUhmVnhDNElOeGdONmRCUnhtZkFLRVd3LVZYbGlRYm54anfSAdQBQVVfeXFMT2R4V1NXU2VUTE9NYlNoNTVSS01UdFVHcXVKS0s0dmlNUDZBZk90aDlscG1MLUJYWW15VUNJV1B0bnRaUVRVd1V6bEdoU1VXWHQ1NUhnaGVmajhXakV1ZlVsWHRSZjFDTW5HN3RLY0RIQ2dhd3YzR1piYU44bVl2cGplNVY1alYxZEFsbm5OTkRQbjlldVBJeEt5d0cwZjZfSkNRZXhEZmFwbHYxQ1kxdl8wOXRaNFdhNFFTSTBuM2FLdUU1QzlLaXZuamdjSzVHbUFaeks?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Crypto Analyst Predicts Ethereum Season, Says Solana Following in Footsteps of ETH’s 2021 Market Cycle - The Daily Hodl",
        "content": "A popular crypto analyst says that it’s likely Ethereum’s (ETH) time to shine and that its biggest rival is in for a parabolic run.\n\nPseudonymous trader Inmortal tells his 213,900 followers on the social media platform X that Ethereum will rally and leave many traders on the sidelines.\n\nThe analyst lays out an initial target of about $4,000 with a chart suggesting that ETH found support at around the $2,800 level.\n\n“ETH season about to start.\n\nFueled by disbelief, as all the other times.”\n\nAt time of writing, Ethereum is trading for $3,107.\n\nThe analyst also has his eye on Ethereum rival Solana (SOL). According to Inmortal, Solana has so far resembled Ethereum’s 2021 market cycle, and if SOL were to continue, it could be trading well above the $360 mark later this year.\n\n“ETH 2021 vs SOL 2024”\n\nSOL is trading at $177.54 at time of writing.\n\nLooking at Bitcoin (BTC), Inmortal says that the crypto king is currently in a range between $74,000 and $56,000. If BTC manages to convincingly hold the $66,000 level, the trader says that another run-up to all-time highs is possible.\n\n“BTC KEY levels.\n\nPrice rejected at first level of resistance (mid-range)\n\n> IF price manages to reclaim mid-range, THEN range high ($74,000) is on the table.\n\n> Below blue box = bad\n\nVery simple.”\n\nAt time of writing, BTC is trading at $67,024, slightly above Inmortal’s mid-range.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 98,
        "url": "https://news.google.com/rss/articles/CBMi3wFBVV95cUxQWko0QnJTODVWVkFOZDQtRkJnTHZwSkhMWnJMSW1GdXlEVVlob2NVdnFxYUxBeW9DXzZiU3AtTWhZZmZmazhHemY0YWliZjBUcTdrOXRycUlBMzExN1B3dnVBd1hTREhVVmZWU19fVTFjb2tGZk1hOWJGcDZEWjFGNUp3Uk94Y3RGalBNeXo1TnFjekR4amZnRUlKX0ZmRE5lYTBSZDliLURKeVhlakc5WlN4bms3YTYxbEdZdVFYY25aVmdOb04wRTVxcGlaMVRyaTV6eGRWbU5xS1RtVzQ00gHkAUFVX3lxTE9qdVV6YUN3ZzBnZnIxWlJmdEdrdlRwMGZTeTFZdC1XRnhCaFphNG05OFlZakZaZDVJUmxiN2tGREVYREhPaS1rVnF0OE81S2NUQUUtTC1LZjdtYVZfZkFkcHd0YnkyY2RkZ1VBdWlqVzY2V3h0Y0FiZkc1dzREWXFheTdwdi1sUDNMXzRkQnJyak9kRi1RQkMybm1uT2FYVGkzTVJwU2RpMzctck93TExTNFkyRjgxSDVTMUN6bWh2YTVENmRxbVRkVU9tRjdOamlMdHhkT1BSY1N0SWVWQkdGa2dYNA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Trader Predicts More Rallies for Surging Ethereum Rival, Updates Outlook on Chainlink and Two Additional Altcoins - The Daily Hodl",
        "content": "A closely followed crypto strategist says he’s bullish on one Ethereum (ETH) competitor that surged by as much as 43% last week.\n\nPseudonymous trader Altcoin Sherpa tells his 216,300 followers on the social media platform X that Fantom (FTM) will see more rallies in the coming months.\n\n“FTM is going to $1-ish before any pullback and should go even higher in the next six months, in my opinion. Interesting upgrades/pivots coming here, and I have a bag. This looks strong in the short term.”\n\nAt time of writing, FTM is worth $0.856.\n\nLooking at the native asset of the decentralized oracle network Chainlink (LINK), the trader says the altcoin is in a position to ignite a breakout rally.\n\n“LINK goes to $20 if it can break past this $16 mark, in my opinion.\n\nStill wouldn’t personally buy here though.”\n\nAt time of writing, LINK is trading at $16.53.\n\nNext is the memecoin dogwifhat (WIF), which the analyst says is approaching a potential bounce level.\n\n“WIF: $2.30 should provide a bounce area. Thought it would break past the range high but definitely was wrong. Could also see the wick tapped again, too, around $1.80. Those should be good short-term bounces overall.”\n\nAt time of writing, WIF is worth $2.54.\n\nThe last altcoin on the trader’s radar is the native asset of the Solana (SOL)-based decentralized exchange (DEX) aggregator Jupiter (JUP). According to Altcoin Sherpa, JUP is currently in the process of carving a bottom.\n\n“Some of these charts look pretty good overall. JUP for example. expecting some sort of slow grind up after forming some sort of short-term bottom.”\n\nAt time of writing, JUP is trading for $1.18.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    }
]