[
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxPanVtV05KNkZKSzdLSGNqb1o3cUxkajRhVnlrLWpVTmRIVjNMbHYtRmR0VjhFV2tDV3RXUUZua3VOenp5OEp5by1lU0ltVHVCN0N0blF4MUVYd1I2OHZhX0E4dHBDY3FOUDdVdXlCSDdBWkRoaHNENHc5UDRiM0UtRTdWVDdMc1FydFdTdkhCNDB0eXRyXzc1bjhGZjdmZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Blackrock updates S-1 filing for Ethereum ETF, marking step toward launch - CryptoSlate",
        "content": "BlackRock amended the S-1 registration statement for its spot Ethereum ETF in a May 29 filing, marking a step toward approval.\n\nThe filing builds on BlackRock’s original registration statement, which was initially filed in November 2023.\n\nBloomberg ETF analyst James Seyffart called the filing a step toward launch after the SEC approved 19b-4 listing rule changes on May 23.\n\nHe said:\n\n“This is almost certainly the engagement we were looking for …”\n\nSeyffart reaffirmed his belief that the S-1 statements could gain approval in the coming weeks, leading to spot Ethereum ETF launches, but admitted that the “norm is months.”\n\nPlaceholder data filled\n\nThe S-1 filing fills several placeholder fields, including details about seed funding.\n\nAccording to the filing, the fund has generated $10 million in proceeds via a seed capital purchase by BlackRock Financial Management of 400,000 shares at $25 per share.\n\nThe sponsor, iShares Delaware Trust Sponsor, may collect up to $500,000 in fees per annum. The latest filing does not calculate a percentage-based sponsor fee.\n\nThe trust will issue and redeem shares only in blocks of 40,000. The fund’s ticker is ETHA.\n\nWilmington Trust, National Association will act as the Delaware trustee. Bank of New York Mellon will act as trust administrator and cash custodian.\n\nIn-kind redemptions considered\n\nThe new S-1 also reintroduces the possibility of in-kind creation and redemptions, which would allow for crypto rather than cash transactions among authorized participants.\n\nIt acknowledges that approval of in-kind transactions is not guaranteed and that timing is uncertain.\n\nBlackRock’s original S-1 statement mentioned the possibility of in-kind creations and redemptions in passing. However, an amendment notice to Nasdaq’s 19b-4 filing in April said that authorized participants would rely solely on cash when creating and redeeming shares in the fund.\n\nThe latest S-1 also explicitly states that BlackRock will not engage in ETH staking, aligning with Nasdaq’s second May 22 19b-4 amendment on behalf of BlackRock.\n\nAll other ETH ETF issuers have also removed the possibility of staking from their applications.\n\nMentioned in this article"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxORUNSbXk4YTlPSzM0MDZET0puMjdNUFdsVTNWdHIyU1BEY1Y0aW50QTJuMDRYVFdKdTZFeXV1cnpDXzhZeUR4czhqRWdmMnlpYmVONW5qTFRiY0hyUGZBZV9ZNUhucjliWUE2YkRDOHZoalV1a19XcXNWcG0tN0RtU0hiSUhlRnl1OW1leUU3LV9JZVJVTUg0Zm1nYw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Vitalik Buterin reveals five ways he’d rebuild Ethereum from scratch - DLNews",
        "content": "Ethereum's architect shares thoughts on smart contracts, EVM, and other features.\n\nButerin says Ethereum developers should have shipped Proof of Stake sooner.\n\nEthereum is going mainstream with advent of ETFs.\n\nWhen 620 weary developers emerged after three days of nonstop coding at this year’s ETHBerlin event last week, few expected Vitalik Buterin to be speaking on stage.\n\nThe co-founder and prime architect of Ethereum was a surprise guest.\n\nWhat was even more surprising were some of his reflections on building the industry’s second-largest blockchain. Buterin described some of the regrets he had about the initial design of Ethereum in detail.\n\nFor many in the audience, his discourse not only evoked the halcyon days of the network’s birth in 2014, but it also helped fill in the road map for what comes next for a cryptocurrency now worth $448 billion.\n\nThe US has just approved a spot Ethereum exchange-traded fund, and BlackRock, the world’s largest asset manager, has launched its own tokenised fund on the blockchain.\n\nThe Ethereum network has spawned a sprawling ecosystem of developers and financial applications worth more than $63 billion, and it has become a byword for decentralised finance.\n\nList of things\n\nStill, Buterin, a 30-year-old Canadian-Russian programmer, said he has a list of things he would have done differently. They range from the development of Ethereum’s Virtual Machine to smart contracts to the Proof of Stake consensus mechanism.\n\nAnd he remarked that even as Ethereum goes more mainstream, it’s still misunderstood.\n\nJoin the community to get our latest stories and updates\n\n“Bitcoin has a simple narrative which is digital gold,” Buterin said. “But like with Ethereum, it’s like ‘Whoa, what the heck is Ethereum?’”\n\nETHBerlin04 in numbers 🧮\n\n\n\n- 802 super humans in total\n\n- 627 hackers\n\n- 83 project submissions\n\n- 56 volunteers\n\n- 40 experience hosts\n\n- 33 judges\n\n- 18 mentors\n\n- 15 core team\n\n- 13 speakers\n\n- 20ish dogs — ETHBerlin04 (@ETHBerlin) May 26, 2024\n\nETHBerlin04 in numbers 🧮\n\n\n\n- 802 super humans in total\n\n- 627 hackers\n\n- 83 project submissions\n\n- 56 volunteers\n\n- 40 experience hosts\n\n- 33 judges\n\n- 18 mentors\n\n- 15 core team\n\n- 13 speakers\n\n- 20ish dogs — ETHBerlin04 (@ETHBerlin) May 26, 2024\n\nSeated on comfy couches on stage with ETHBerlin organisers Afri Schoedon and Franziska Heintel, Buterin opened his chat by sharing his fondest memories of the German capital over the years — hacking in the old office with Ethereum co-founders Gavin Wood and Jeffrey Wilcke, launching Devcon Zero, and celebrating the Merge upgrade in 2022.\n\nThen Schoedon popped the question.\n\n“With everything you know and everything you learned over the last 10 years, how would you build Ethereum differently today if you could start from scratch?” Schoeden asked.\n\nVitalik Buterin (centre) discussed Ethereum's vision, then and now, in a discussion at ETHBerlin. Photocredit: Liam Kelly/DL News.\n\nToo many bits, too early\n\nButerin’s first qualm concerns Ethereum’s Virtual Machine, which is key to making the network function as a kind of decentralised mega crypto computer.\n\nHe explained that Ethereum’s original EVM design used 256-bit processing instead of 64- or 32-bit.\n\nIn computer architecture, the size of computing is measured in bits, with larger bits offering better efficiencies and processing more data. But 256 bits is very inefficient for most operations, and can create a lot of bloat on a blockchain, even for simple tasks.\n\nFor a network in its early days, Ethereum didn’t need to optimise for this.\n\n“The original design was way too overfitted for 256-bit,” Buterin told the audience.\n\nOptimise smart contracts\n\nSecond, Buterin said the early Ethereum developers should have focused on making it easier to write smart contracts with fewer lines of code.\n\nThe reason? Added transparency.\n\nWith fewer lines of code, he said, “people can properly see and check what’s going on inside of them.”\n\nVolunteers and developers playing music at a hackathon in Berlin. Photocredit: ETHBerlin.\n\nSwitch to a ‘crappier’ version of staking\n\nInstead of custom-built computers — called miners — running nonstop to secure a blockchain network, Ethereum switched to a different model.\n\nEthereum’s switch from a Proof of Work consensus mechanism — the way nodes in a blockchain like Bitcoin’s agree on the state of transaction data — to Proof of Stake in 2022 should have happened much earlier, Buterin said.\n\n“When we switched to Proof of Stake, we should have been willing to switch to a somewhat crappier version of Proof of Stake earlier on,” he said. “We ended up wasting a lot of cycles on really trying to make Proof of Stake perfect.”\n\nInstead of miners, Ethereum is now secured by validators who have staked 32 Ethereum, worth roughly $124,000, to do the same thing — and be rewarded for it. If they misbehave by validating fraudulent transactions, for example, they are penalised.\n\nIn sum, the switch swapped out raw, energy-intensive computing power with economic incentives.\n\n“We could have saved a huge amount of trees if we had a much simpler proof-of-stake in 2018,” Buterin said.\n\nIssue logs from day one\n\nFrom big-money token transfers to backdoor honey pots, users can follow the money quite easily in crypto. That’s thanks in part to automatic logging.\n\nBut as the industry advances, notably moving from externally owned accounts like MetaMask to smart wallets like Safe, certain aspects of that crucial logging are lost.\n\nNotably, automatic logs for Ether transfers.\n\n“It should have been in there from the beginning,” Buterin said. “It could have been like 30 minutes of coding from myself, Gav and Jeff. Instead, it’s an EIP.”\n\nEthereum Improvement Proposals are formal proposals made by developers to change certain aspects of the Ethereum network.\n\nEIP-7708, which Buterin submitted on May 17, would make this precise change.\n\nAmeen Soleimani, strategic advisor at 0xbow and co-founder of MolochDAO and Reflexer Finance, discussing the Tornado Cash case. Photocredit: Liam Kelly/DL News.\n\nDrop Keccak\n\nButerin also said he would have used SHA-2 for Ethereum’s hash function rather than the current function called Keccak.\n\nTo understand the difference, one must dig into a bit of cryptography lore, specifically about how SHA-3 became a standard. Remember, before crypto became synonymous with celebrity memecoins and nine-figure initial coin offerings, it was about complicated math.\n\nWhen Ethereum was being built, the hash it used was in a “hash function competition” — yes, that’s a thing.\n\nThe National Institute of Standards and Technology organised the competition to create a new hash standard alongside SHA-2.\n\nPrevious standards had been attacked and debunked. But SHA-2 was unscathed and the NIST simply wanted a safe alternative. After all, variety is the spice of life (and apparently cryptography).\n\nKeccak was just one of several contestants that entered the competition. During the competition, the team made some minor changes to its algorithms, eventually leading to them being crowned the winner. In other words: SHA-3.\n\nThe early Ethereum team had, however, already implemented a non-standardised version of Keccak. Essentially, Ethereum is using a pre-SHA-3 iteration.\n\nCo-founder and CPO of ChainSafe Gregory Markou and founder and CEO of Phylax Systems Odysseas Lamtzidis speaking on stage at ETHBerlin. Photocredit: ETHBerlin\n\nBig whoop, right?\n\nWell, this meant that Ethereum developers needed a custom library — collections of reusable code that needn’t be rewritten from scratch — to accommodate both SHA-3 and Keccak.\n\n“We’re not compatible with other systems using SHA-3,” Marius van der Wijden, a core Ethereum developer, told DL News. “We have to support both algorithms in the EVM.”\n\nIt’s essentially been solved. Today, big libraries support both encryption mechanisms.\n\nSo, yeah, big whoop indeed.\n\n“It doesn’t matter in the grand scheme of things, and current development is definitely not impacted by it,” said van der Wijden.\n\nEthereum’s crack team\n\nDespite the list of minor design misses, Buterin said it’s inevitable for any project to have a few.\n\n“I’m just really happy that I feel like our core devs and their execution capacity feels like it just keeps increasing with each passing year,” he said.\n\n“We’re in a position to effectively and safely correct some of these mistakes.”\n\nLiam Kelly is a DeFi Correspondent at DL News. Got a tip? Email at liam@dlnews.com."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxPelg2Vk1ESVlqb2ZaYm1nNFgtOVh0T1A3T19YanNTUTN3N2toeFd5VWRjUE53TmY3cktmTFJRaGRZVmc2QTBTXzlQWGhYbGF3cmxxczRoS3lrV0JNNkVLOE9leWxLTlY1d3c0T0M0M3g0TXVnTjh1VU55NDdoSVZhVVFCbV9scXl1d3p5Y3JiVTZqUWJtdFE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 May 2024 07:00:00 GMT",
        "title": "5 Things to Know About Ethereum's First Spot Price ETFs - The Motley Fool",
        "content": "The SEC has finally cleared the way for the first Ether spot price ETFs.\n\nOn May 22, the U.S. Securities and Exchange Commission (SEC) approved the first eight applications for Ether (ETH 0.17%) spot price exchange-traded funds (ETFs) from Grayscale, Bitwise, iShares, VanEck, Ark Invest, Invesco, Fidelity, and Franklin Templeton. Ether is the world's second largest cryptocurrency and the main coin of the Ethereum Network.\n\nThat announcement came just four months after the SEC cleared the first spot price Bitcoin (BTC -0.37%) ETFs for trading. But should investors assume these planned ETFs will set a firm floor under Ether's price and become compelling long-term investments? Let's review the five key facts to decide.\n\n1. The first Ether ETFs won't start trading anytime soon\n\nThe SEC approved the initial regulatory filings for the eight Ether ETFs, but they won't start trading until the agency approves their S-1 filings. That process could take several months. For reference, the SEC approved the S-1 filings for the first Bitcoin spot price ETFs approximately three months after clearing their initial regulatory filings.\n\n2. The decision turns Ether into a commodity\n\nIn the past, the Ethereum and Bitcoin blockchains both used an energy-intensive proof of work (PoW) mining method to produce coins. But in 2022, the Ethereum Network switched to the more energy-efficient proof of stake (PoS) method. That transition, known as \"The Merge,\" reduced the network's energy consumption by 99.95% and made it deflationary -- which meant more Ether was being burned than produced.\n\nHowever, the SEC initially claimed The Merge made the Ether coin and Ethereum-based tokens more similar to securities than commodities. The move made a radical change to how Ether coins are created and managed. Regulators then repeatedly declared that Bitcoin was the only cryptocurrency that could be classified and pinned to spot price as a commodity, since it was digitally mined like a precious metal through the PoW method.\n\nTherefore, the SEC's decision to approve the first Ether ETF filings implies the coin can now be classified as a commodity instead of a security. That shift might clear the way for smaller Ethereum-based tokens such as Shiba Inu -- as well as independent PoS-driven cryptocurrencies like Solana -- to get their own spot price ETFs.\n\n3. Ether ETF investors can't stake their holdings\n\nAnother key difference between Ether and Bitcoin is the process of \"staking,\" which allows investors to earn interest by locking up their Ether coins on the network for a period of time. The SEC, which argues that staking-as-a-service solutions should be classified as unregistered securities, previously sued cryptocurrency exchanges including Coinbase (COIN -6.83%) and Kraken for allowing users to stake their own coins.\n\nGrayscale, Ark, and the other firms originally wanted to add staking features in their ETFs, but they removed those proposals in their updated filings last month. That change could make their ETFs less appealing than the actual digital coins.\n\n4. The SEC approved the filings probably to avoid more litigation\n\nLast year, the SEC lost a lawsuit against Grayscale, which had sued the agency for trying to block the conversion of its popular Bitcoin trust into an ETF. That loss softened the SEC's position and cleared the way for the first Bitcoin ETFs.\n\nEarlier this year, blockchain company Consensys sued the SEC for its refusal to recognize Ether as a commodity, while Grayscale and its peers were widely expected to sue the SEC again if it didn't approve their regulatory filings for spot price ETFs. So for now, it seems the SEC has backed off on tightly regulating Ether to avoid more legal battles.\n\n5. The Ether ETFs should attract less attention than the Bitcoin ETFs\n\nGrayscale currently holds nearly $11 billion in assets in its GrayScale Ethereum Trust (ETHE -3.95%), which it's attempting to convert into a spot price ETF. However, that's a lot smaller than the Grayscale Bitcoin Trust before its conversion into its spot price ETF, which now hosts more than $20 billion in assets.\n\nThese new Ether ETFs might attract some attention from mainstream and institutional investors, but they probably won't gain as much momentum as the Bitcoin spot price ETFs earlier this year. Ether also doesn't have any major near-term catalysts that are comparable to Bitcoin's halving, which halved the rewards for mining, earlier this year.\n\nShould you buy the Ether ETFs?\n\nThe Ether ETFs might not attract as many investors as the Bitcoin ETFs, but they might represent an easy way for investors to gain exposure to Ether without directly buying the coins. But investors should still be mindful of the fees, see if they actually match Ether's spot price, and realize they won't be able to stake their holdings.\n\nTherefore, investors shouldn't rush to buy the Ether ETFs once they hit the market. Instead, they should wait and see if the convenience of owning these ETFs in a brokerage account outweighs the advantages of owning Ether in a crypto wallet."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxONG5obHF2blJXNlNkSXhISjdHaHQ1c2EwSGY4LVoxTUtiRm9sSmFzSmM2d3N1LXc4Zk5pcElCRWJhQmtXZHNObDNUVnpZSU9BTnRnM0xaR081WEtUUERZWmRGT250VS0zcGtlV1FINnQ0WHIwSU5kcGZJQ1ViY1g4NnlQQjJYLTlSbG94Y2tpNHRrVy1DRGg4ZW9QRWpTbkt5SDRtQXl1WGt0LWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Solana — why Ethereum's lesser-known rival is steadily rising - Yahoo Finance UK",
        "content": "Solana claims its blockchain platform offers faster transactions for a fraction of the cost compared with ethereum. (NurPhoto via Getty Images)\n\nSolana has long been heralded as the main contender to knock ether (ETH-USD) from its perch as the world’s pre-eminent network for decentralised finance.\n\nThe Swiss-developed “high-performance, permissionless” blockchain was launched in March 2020, by lead designer Anatoly Yakovenko.\n\nIts sol (SOL) token has soared in value by more than 88% since the beginning of this year, now trading at $168.46 (£132.35). However, this is still significantly lower than the token's all-time-high of $260 (£204.27) on 7 November 2021.\n\nApproximately 63% of sol is staked on the solana blockchain — this limits the supply of the token and has acted as a tailwind on the price. The market capitalisation for the blockchain has grown to over $77bn, ranking fifth in terms of cryptocurrency market cap, just behind Binance's BNB (BNB-USD).\n\nRead more: Ether price rallies on spot-ETF launch speculation as solana surges\n\nThis week, PayPal (PYPL) announced that its stablecoin PYUSD would launch on the solana network, nearly a year after debuting on the ethereum blockchain. PayPal senior vice-president of blockchain, Jose Fernandez da Ponte, praised solana's cost and speed efficiencies, stating: \"Ethereum works well enough, but if you’re interested in retail payments as we are, basically you need at least 1,000 transactions per second and you need transaction costs in the pennies, not in the dollars.\"\n\nThe ability of solana to handle large-scale blockchain movements is key to its value proposition. Solana can average 65,000 transactions per second (TPS). When compared with Ethereum’s 30 TPS, it becomes evident that the Swiss-developed blockchain is a major challenger to Vitalik Buterin’s brainchild, Ethereum.\n\nEthereum founder Vitalik Buterin. (John Phillips via Getty Images)\n\nSolana has many key innovations that could see its native SOL flip Binance's BNB token, which is next in line in the market capitalisation rankings. However, Solana is more decentralised than Binance, with over 1,000 validators, compared to only 21 validators on the BNB smart chain (BSC). The lack of decentralisation on the BSC leaves it vulnerable to manipulation or even a blockchain-wide hack, which in the long-term makes institutional players wary of deploying smart contracts on it.\n\nThus, the real target for solana is ethereum and it is expected to continue munching away at large chunks of ethereum’s market share because of its advanced transaction speed, lower transaction costs and attractive programming language.\n\nEase of use for application development accelerates the wider adoption of a blockchain by users and developers, a key factor in long-term success.\n\nStory continues\n\nRead more: Bitcoin price dips ahead of FTX and Mt Gox bankruptcy payouts\n\nThe developers of the solana blockchain have a mechanism for validating transactions called \"proof of history.\" This involves a cryptographic time-stamping mechanism that speeds up the settlement of on-chain (recorded on the main blockchain) transactions. This fundamental innovation in solana’s blockchain validation method, where every block is time-stamped, allows a multitude of transactions to be processed simultaneously.\n\nThe Solana Foundation’s website states that it maintains “a single global state as the network scales and never deals with fragmented layer two systems or sharded chains.” Thus, it does not need a layer two solution as its main blockchain can settle transactions at high speeds and with a fraction of the costs required on the ethereum network.\n\nRead more: What is a spot bitcoin ETF and why has it sparked a crypto rally?\n\nEthereum must rely on layer two solutions to handle large-scale transactions, as its layer one main network, where monetary settlements are recorded, experiences crippling congestion when a large number of transactions need to be verified. Layer two solutions can handle transactions at high speeds and with a fraction of the usual gas-fees, but are settled 'off-chain.' and then validated on the main blockchain network in a singular bundle at a later time.\n\nYahoo Finance asked Austin Federa, head of communications at Solana Labs, to explain why solana’s transaction speeds are faster than ethereums.\n\nHe said: “Solana is a proof of stake blockchain whose architecture unlocks network speeds and transactional capacity comparable to NASDAQ. It leverages proof of history, a decentralised clock before consensus, to timestamp incoming transactions, allow for faster block finalisation and increased transaction throughput.”\n\nFedera described how solana’s 'proof of history' consensus mechanism has a low energy requirement when compared to the 'proof of work' method used to validate bitcoin settlements. He said that: “Solana's consensus mechanism is greener because it doesn't use energy and it allows for the next generation of optimisations in technology improvements to make these networks much faster and scalable.”\n\nThe programming language that solana is based upon is attractive to developers — a key factor in accelerating the rate of blockchain adoption.\n\nIf many decentralised applications are developed for a blockchain, then the proportion of users who flock to the network will appreciate.\n\nRead more: What are bitcoin runes?\n\nFedera described solana as being “built on Rust, one of the most-loved programming languages by developers. It can be used to create smart contracts on solana using a universal coding language that possesses a powerful toolkit of community resources developed by Google (GOOG), Amazon (AMZN), and Facebook (FB). Combining these tools with Rust’s compiler means developers can use less energy thinking about technical errors and spend more time focusing on smart contract logic, so it’s easier to write safe code for DeFi.”\n\nAnother reason why capital is pouring into Solana is because the platform has exploited the growing interest in non-fungible tokens (NFTs). Purchasing these one-of-a-kind digital artefacts on solana is much cheaper than the gas-fees that must be forked out to buy equivalents on the ethereum network.\n\nThe ethereum network has average gas fees of $16 per transaction. On the solana network, the average gas fee is $0.00025 per transaction.\n\nRead more: Crypto live prices\n\nSome critics of ethereum suggest that Vitalik Buterin’s network is hanging on solely because of its first-mover advantage, which has seen it consolidate the majority of all known DeFi applications (dApps). But there are reasons to hesitate before concluding that solana will supersede its older rival.\n\nLast December, Yakovenko, the co-founder of Solana Labs, took to X.com to shoot down any descriptions of the solana network as an \"ethereum killer.\" He doesn’t “see a future where solana thrives and somehow ether dies.”\n\nHe wrote on X.com: \"Don’t bring back last cycle 'eth killer' bs. It’s lame. Pareto-efficient technologies can have overlapping features and will compete, but that’s all ok. I am such a techno-optimist that I am certain that eventually danksharding will have enough bandwidth for all of solana’s data.\"\n\nAlso, hardware costs to run a solana node could see a diminishing number of validators on the network over time, making it less decentralised and at a higher risk of network weaknesses long-term.\n\n* This story is an updated version of the original article published in November 2021.\n\nWatch: What London Stock Exchange debut of Bitcoin ETNs mean for Europe's crypto market\n\nDownload the Yahoo Finance app, available for Apple and Android."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxPMG9YelFLRDM5S2djTXVBbGcyN1N4cDBXbmtEMG42MzU5eHVvanB6QlNqYU5rZmhoMzk5V1V6b2NmQjJIdnZuUEF0WTBETUl0b1h5aWFuY09nTlRmMzJPNG1xd3NYaUZzLTIyTm1fVkxpVWFuMFp2QkxWdnB2VVEwTmdaN0ZVODdTMTloVTY1TTMtQ241dW9RUlpZV1JzQUM1dGQyMnRWTmllYU5OMjQ1Vlp3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Babylon Raises $70M To Bridge Bitcoin And Ethereum - Benzinga",
        "content": "Babylon, a crypto startup co-founded by Stanford University engineering Professor David Tse, has raised $70 million in its latest funding round.\n\nWhat Happened: The round was led by crypto venture capital firm Paradigm and included investments from Polychain and Bullish Capital, the company announced on Thursday, according to a Bloomberg report.\n\nThis follows an $18 million raise in December from investors such as Hack VC and Framework Ventures.\n\nAlthough Babylon did not disclose its current valuation or investment details, a representative confirmed that the funds will be used to expand staff and further research and development.\n\nThis latest investment highlights a renewed interest in Bitcoin-focused projects among venture capitalists.\n\nTraditionally, Ethereum ETH/USD and other blockchains have been favored for software development, particularly in decentralized finance (DeFi) applications.\n\nHowever, the success of Ordinals, a type of nonfungible token (NFT) on the Bitcoin blockchain, has sparked renewed interest in building within the Bitcoin ecosystem.\n\n\"So Bitcoin is kind of really undergoing a renaissance in the sense that now there's a new wave of projects building on Bitcoin,\" Tse said.\n\n\"Historically, Bitcoin was the first blockchain, but over the years the developer community has shifted away from Bitcoin BTC/USD to new chains…Recently, for multiple reasons, there has been a shift of attention back to Bitcoin.\"\n\nThe increased interest also follows the approval and launch of Bitcoin exchange-traded funds (ETFs) in the U.S. earlier this year, as well as the Bitcoin \"halving\" event in April, which reduced the mining rewards by half.\n\nThese developments have contributed to a growing focus on Bitcoin projects.\n\nAlso Read: Robinhood Unveils Crypto Trading API For Advanced US Users\n\nWhy It Matters: Babylon’s primary aim is to enable Bitcoin to be used as a staking asset to secure other blockchains.\n\nStaking, a mechanism used by proof-of-stake blockchains like Ethereum, involves locking up cryptocurrency deposits to validate transactions and secure the network, earning rewards in return.\n\nBitcoin, traditionally a proof-of-work blockchain, uses miners to solve complex puzzles for transaction validation.\n\nBabylon seeks to allow Bitcoin holders to participate in transaction validation on proof-of-stake networks, thereby earning yields on their idle Bitcoin.\n\n\"You can think of our project as analogous to Ethereum's staking, but for Bitcoin,\" Tse explained.\n\nFor Babylon and its investors, making Bitcoin a staking asset presents a significant opportunity, as many Bitcoin holders have long sought ways to generate yield from their assets.\n\nEthereum’s recent transition to a proof-of-stake model, known as the Merge, has increased the appeal of staking as a revenue-generating activity in the digital asset sector.\n\n\"In our mind, in the crypto Web3, a very important value is security,\" said Tse.\n\n\"So it is this security that drives this underlying decentralized world that we're building. And so what we're trying to advocate is that Bitcoin being such a large asset can sort of underwrite the security layer for essentially the entire Web3 ecosystem.\"\n\nStaking remains one of the most lucrative areas in decentralized finance.\n\nAccording to data tracker DefiLlama, Lido Finance and EigenLayer, two of the top three DeFi projects by total value, fall under the staking category.\n\nUsers have collectively sent over $50 billion in cryptocurrencies to these platforms to generate returns.\n\nWhat’s Next: These developments and their implications for the digital asset market will be key topics at Benzinga’s Future of Digital Assets event on Nov. 19.\n\nRead Next: BlackRock Moves Closer To Launching First Spot Ethereum ETF"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE9UdEJucnhWNXJEVFRSQXRBT0IzaWs1ZlpQQVROQjlXdVRULWo0Z3oxVDdfZzFFYmEyckJTeUwxNXktLUs1VmhNa2t5ZVFsUFdtQUVETnV1cE16eHFZd0NQX0tsSE1jS2N3azhBUTZXTkJtZ1drVkcxMdIBfkFVX3lxTE83WDNNaWtyYl9zWnVSNjVROEwxdFRGelBFSG1fMFdpYi1CeXkxSTI4b1NCanpMbjMtdUxrLURHSDluV1oySnJXeG1BTmdMT194M196cWFWOG5PVVhFSnJjTGhCTkZpeXNobzhjU2Y4UHRxdFctUm94cHJHWTY3dw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 May 2024 07:00:00 GMT",
        "title": "$8 Billion of Ethereum (ETH) in 24 Hours: What's Happening? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nWith the Ethereum ETF craze covering the cryptocurrency market like a fog, the activity of large holders is through the roof. More than $8 billion worth of ETH has been transferred between whales, which creates an interesting situation: the activity is here, but the price is not moving for now, consolidating at around $3,900.\n\nAdvertisement\n\nThis amount of large transactions is remarkable. There have been more than 6,780 large transactions in the past 24 hours and a seven day high of 9,790 transactions, But for all the activity, the price of ETH has been relatively unresponsive.\n\nThe chart reveals that there are extremely high levels of transactions being offered up, amounting to an incredible 2.14 million ETH in the past day. This level of transactions is in line with the current hype over an ETF, since institutional interest tends to drive whale behavior.\n\nThe seven-day high for transaction volume was 3.21 million ETH, while the low was approximately 981,530 ETH. The implications of this volatility are that there is an extremely fluid market in which large holders are very much on the move and shaking about, presumably in the hope of signaling impending price movement.\n\nAdvertisement\n\nOddly, though the transactions are high in the number of units and in value in many cases, there is relative moderation in price volatility. The volatility index lists a 30-day high of 62.38% and a low of 40.72%, and that means the market, with all of its transactions, is not experiencing big price swings.\n\nIf the ETF story continues to play out and more institutional money comes into the ETH space, a breakout higher than $4,000 may become a reality in the future. But, if this action is simply a reprieve to profit, or a redistribution in the face of weakness being perceived below the surface of the market, it may have trouble keeping up its courage."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE85b2pPdmphU29UMVNnVHZZSU1zbGR4Wmhsc2VCMDhoVVZjbXF3Z2NOSk1wSnBSMEpuM29zM0NFbDVSeVJGbEE4VDlsYVBNOEhPeUZEMktHVm15ZnJoVi1TY2hqQ0dXTjBUWXJPRHRsM1Zsc19BX2tjMNIBfkFVX3lxTE5kdVhFaHpTaEJOWWh4WXBlMmdMSUdrY05IWHF6cnQ2T1RNMkg4WXVrLUhuUTBYLU5hSUVRazlSSmVXRGV4OFNzSUpCOHhpVllUVE14aFNVeW4yYW1GX052LTRRQlF4aEU4d1B1WUdRak9zWlhJdy05Z0pXMDhtUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Solana (SOL) Dominates Ethereum (ETH): Glassnode Cofounder - U.Today",
        "content": "According to Glassnode cofounder Yann Allemann, capital rotation within the cryptocurrency market has begun .\n\nAdvertisement\n\nAllemann has noted that Solana (SOL) is currently dominating Ethereum (ETH). His assessment comes after the former gained roughly 10% against the latter since May 27.\n\nThe SOL/ETH pair experienced a significant decline following the approval of several spot Ethereum exchange-traded funds (ETFs) by the U.S. Securities and Exchange Commission (SEC) earlier this month. On May 27, the price of Ethereum peaked at $3,973 on the Bitstamp exchange. However, the excitement surrounding the SEC's much-coveted nod quickly dissipated, with ETH shedding 7% in several days. The SEC is yet to approve S-1 registration statements for these ETFs to go live.\n\nAt the same time, Bitcoin's market dominance has collapsed more than 4% since May 6 after breaching the 56% mark.\n\nAdvertisement\n\nOnce a certain cryptocurrency rallies, it tends to cool off, while traders take profits and place bets on other assets. Capital rotation within cryptocurrencies can also take place internally, meaning that the same cryptocurrency gets acquired at different prices.\n\nDespite its recent weakness, Bitcoin is still neck-and-neck with Ethereum on a year-to-date basis. The two cryptocurrencies are up 77.71% and 79.38%, respectively.\n\nSolana ETF?\n\nAfter Bitcoin and Ethereum have benefited from the ETF hype, analysts are now eyeing other potential cryptocurrency contenders.\n\nAs reported by U.Today , CNBC contributor Brian Kelly has predicted that Solana could end up being the next major digital asset to get its own ETF. This view is also shared by American financier Anthony Scaramucci and British bank Standard Chartered .\n\nAt the same time, the Chicago Mercantile Exchange (CME) recently shut down rumors about potentially launching Solana-based futures."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxNblNpQ01sYnlBbWVLT1F3bjRmeWd0d1dmWVBQSGtucnlIQ2JSeGxqQi1tQ0QxeklZZVBQRnZwbl9ad0VibkYwY0ZONTNNZ3p1T25JbUdnMHhMZnN0aWh1TU5Vcm1CbmpLY0tQWWpSS1NfWFVrXzVDMl9LdTZ1TWNIMTRxM2lSV1pHUHA0dUliZWpzSy1uZVBIVElUSdIBowFBVV95cUxORXVQNC1sX2s0cWdSb0NOYzFreUxveDcyNVBVQlVva1ZqcjI5QUg4aHVoU1lMQVgyb0ZjVEdBSHRJWWJPQm4xUF9ENDRHbzV0aFdORldJdXE1TUFXcWpobEJGS2E5SHdteXBHNzBMSElGcWpjTGIxVkdSbDlMMlRFSl9WTUM1TnVNcE1RNjNFcUNTUGdlYmV3TC1XVVVBaE54V1JN?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Bitcoin Startup Babylon Raises $70 Million to Bring BTC Staking to Ethereum and Solana - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nA crypto startup seeking to use Bitcoin for native staking on other blockchain networks has secured $70 million in fresh funding to fuel its ambitious goals.\n\nBabylon, which is aiming to do something never accomplished before, secured the cash from lead investor Paradigm, a prominent crypto venture capital firm. Other contributions came from Bullish Capital and Polychain Capital.\n\nThe startup wants to use Bitcoin, the biggest cryptocurrency by market cap, as a resource for staking. Previously, the firm told Decrypt that it’s building infrastructure to use Bitcoin staking to validate nodes on networks such as Ethereum and Solana.\n\n“This funding will accelerate our mission to make Bitcoin the security backbone of proof-of-stake systems,” Babylon founder David Tse said in a statement. “Our team is dedicated to advancing the utility of Bitcoin beyond its traditional roles and enhancing the security of the entire blockchain ecosystem.”\n\nAD\n\nAD\n\nCurrently, Bitcoin runs on a very different system to staking protocols because it uses a system called proof-of-work.\n\nProof-of-work requires lots of computing power—in the form of miners—to process transactions. It’s an expensive and energy intensive process.\n\nBut with proof-of-stake, anyone can participate by “locking up” their assets to power a crypto network. Staking networks include the likes of Ethereum, Solana, and Cardano.\n\nBabylon wants those holding Bitcoin to be able to earn a yield by pledging their coins to staking networks. It’s a bold challenge, but the startup—led by a Stanford professor and a former Dolby engineer—says it has found a way. Last year, it raised $18 million from investors.\n\nAD\n\nAD\n\nIf it does achieve what it wants, those sitting on satoshis (aka the smallest denomination of Bitcoin) will soon be able to earn yield.\n\n“Babylon will be the catalyst that redefines the utility of BTC and paves the way for a new era of Bitcoin-native applications,” said Luke Pearson, General Partner at Polychain Capital, in a release.\n\nEdited by Andrew Hayward"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxPZEpyQ3hLR013bjlJYzQ3QXlrN1prd3VhQVE1VjFtNHNGS1pFdUIyRFRIUzJMRTJRcUxOcElXTzJmS3A1dHh2RnE1cUkwU0ZtbGl3eGZhelhzQ085bWlMdExXYkJiV09QQnhjS1ZVbDNqbEtzQ2ZDMU91czZQNTROWk56MXNDZktJR0xuUHRIRnRHU2NjYlE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Ethereum ETF approval is a game changer, believe experts - Economy Middle East",
        "content": "It could be a paradigm shift, not just for Ethereum, but cryptos in general\n\nIndustry insiders believe the approval of Ethereum ETFs could see a slew of othger crypto-based ETFs\n\nLate last week, the US Securities and Exchange Commission (SEC) cleared the way for the approval of spot Ethereum ETFs.\n\nThe SEC approved 19b-4 forms for the ETFs from BlackRock, Fidelity, Grayscale, Bitwise, VanEck, Ark, Invesco Galaxy and Franklin Templeton.\n\nThe approval takes Ethereum-based ETFs one step closer to reality. Once available, traditional investors will be able to buy shares that track the price of the second-biggest cryptocurrency.\n\n“Ethereum (ETH) is currently in the spotlight as the SEC asked applicants for the ETH ETF to update their filings this week, increasing the odds of approval,” says Hao Yang, head of financial products at crypto exchange Bybit. “Although ETH has faced challenges in recent months, this move suggests a potential turnaround for the second-largest cryptocurrency.”\n\nThe surprise approval is sort of a volte-face at the SEC. In fact, virtually everyone was expecting the SEC to decline the applications.\n\n“The green light for Ethereum ETFs is a landmark decision that highlights Ethereum’s status as a non-security,” says Zina Ashour, founder, Women in Crypto Arabia.\n\nRead | Cryptocurrency market set to surpass $5 trillion in 2024: Ripple CEO\n\nShe explains that this distinction is pivotal “as it exempts Ethereum from the strict regulations that govern traditional securities, thereby broadening the avenues for both institutional and retail investment”.\n\nBroader impact\n\nAshour believes the SEC’s move could set a precedent for the classification and regulation of other cryptocurrencies in the future.\n\n“The SEC’s endorsement of Ethereum ETFs marks a significant turning point not only for Ethereum but also for the wider cryptosphere,” says Ashour.\n\nShe argues the approval will drive the entry of institutional investment into Ethereum. The Ethereum ETFs, Ashour explains, will take away the complexity of directly purchasing and storing the crypto. Secondly, they’ll also offer a regulated and familiar path for investors to buy the crypto. This leads Ashour to believe that Ethereum ETFs could potentially have a positive impact on Ethereum’s price.\n\n“Moreover, the Ethereum ETFs could amplify market liquidity by drawing in more participants,” says Ashour. “Enhanced liquidity could stabilize prices and temper volatility, rendering Ethereum a more attractive investment proposition.”\n\nShe also points out that there are over 20,000 altcoins in Ethereum’s ecosystem. “The approval of Ethereum ETFs could indirectly influence these altcoins, potentially sparking increased interest and investment in them,” argues Ashour.\n\nOpen the floodgates\n\nSECs approval of the Ethereum ETF forms follows approval of spot Bitcoin ETFs back in January. These spot Bitcoin ETFs now collectively hold more than 1 million Bitcoin, worth over $70 billion.\n\nRead | Bitcoin ETFs approval: A game-changer for cryptocurrency market\n\nAs the news of the approval made its way into the markets, the price of Bitcoin and Ethereum actually dropped. Experts believe this was the classic case of traders selling the news after buying the rumor, earlier in the week.\n\nWhile the price of both cryptos has gone up since, Yang believes the prices will continue to fluctuate until the ETF decision is finalized.\n\nInterestingly, market analysts believe the approval of Ethereum ETFs could open the door to more crypto-based ETFs. In a note last Friday, Geoffrey Kendrick, Standard Chartered’s head of crypto research and emerging market foreign currencies, speculated that Solana and XRP might soon get their own ETFs.\n\nChanging political winds\n\nThe SEC approval of the Ethereum ETFs is just the first step of a long-winded process. Experts estimate that could take weeks, or even months, before the actual ETFs land on the trading floor.\n\nThe Ethereum ETF approval is being hailed as a symbolic victory for crypto. Looking at the bigger picture, many believe SEC’s change of heart has everything to do with politics in the US.\n\nRead | Economy Middle East Guide: Regulated crypto exchanges\n\n“The broader political landscape also favors a friendlier regulatory environment for crypto, driven by younger voters’ preferences, which could lead to improved crypto-government relations,” says Yang.\n\nA recent survey by Harris Poll bodes well for crypto going forward. It finds that a third (33 percent) of US voters will evaluate a candidate’s position on crypto before voting. An overwhelming majority (77 percent) think a U.S. presidential candidate should know crypto.\n\nReportedly, even Ethereum co-founder Joe Lubin believes the approval of the Ethereum ETFs, and the crypto-friendly political environment in the US is a “game changer”.\n\nFor more technology news, click here."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxNd3dCZVlRMnA2NFNjSExyTkdldzlWbkRVLUpTck1xVkplckFlWWphVUY3cVpIWjFUbG5QY0ZTcDFvemo3YTRBc1pIdjU5VkRwdTFjOHhZZDhLNzVrMkIzSGdtdlE5bFhZVGtOTXpiQ1RydUhYNHkyYlM2YVBWbVEtNA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Ethereum Whale Stakes $580M ETH In One Epic Move - TronWeekly",
        "content": "Ethereum whales have once again reinforced their faith in the smart contract network. Onchain data revealed that over half a billion dollars worth of ETH was staked in a single transaction. Etherscan captured the transaction worth a whopping 146 ETH, valued at over $580 million. This is likely the record for the most amount of ETH staked in a single transaction, one market observer noted.\n\nThis colossal move is a testament to the growing trust and interest in Ethereum’s staking mechanism, especially as the upcoming Ethereum 2.0 upgrade is on the horizon.\n\nEthereum Whale Stakes $580M ETH in One Epic Move 3\n\nMoreover, whales, individuals, or entities that hold large amounts of cryptocurrency have been the key players, as their significant stakes highlight the evolving landscape of decentralized finance [DeFi] and the increasing role of Ethereum as a foundational layer for various DeFi applications.\n\nDigging deeper, the amount of 146,110 ETH was staked via Lido, as revealed by the Lido DAO Bot on social media. The whale’s contribution through Lido not only boosts the total value locked [TVL] in the platform but also highlights the growing trend of using liquid staking solutions to maximize returns while retaining flexibility.\n\nIn a decentralized staking solution such as Lido, users can earn staking rewards while maintaining the liquidity of their assets through stETH, a tokenized form of staked ETH. This dual benefit is that it attracts whales, entities, or individuals with substantial holdings, to contribute large amounts to the staking pool.\n\nEthereum Fork In Q1 2025\n\nAs reported by TronWeekly, core developers announced their plan to implement the Pectra upgrade by the first quarter of 2025. This decision emerged from a recent execution layer meeting, marking Pectra as the next pivotal advancement for ETH, following the successful Dencun upgrade of March 2023.\n\nPectra is slated to bring several critical enhancements, led by the integration of the Ethereum Virtual Machine Object Format [EOF]. The EOF will bring forth approximately 11 improvement proposals aimed at refining the ETH Virtual Machine [EVM] code on both Layer 1 and Layer 2 levels. These enhancements are expected to optimize the efficiency and functionality of the EVM, which is the backbone of ETH’s smart contract operations."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxPNjZYTU0zVjA0OVFOWFF3Z0d6LUktc1VSQ0o5bndjYUw5eWxPTGZGTGplWkVrUWYxY0Nad1F5OFFRV1cxRW1mUnhoTDhGZlRrcHpVOWEtV0ZQVWJZMWdGUXdvU2prNTdFbkdIRFViWkkzT1BsajRlREgwdWxaU3ZQSUh3R0VvZklDQ0VNRklVU1g4S3M0OXM3UDZkaXlDVHJXODFNbEN30gGrAUFVX3lxTE5OcU9GWlVxWDFIekpWdkQyQy1INkxKek11QjI1MHVnTERWeU1nMDFJdl9tejRiRENmdjgxbWcteEIyLUM4ek9xM3kwWV9rejJkVmlzMF9ncG1BUnZxQ1Q2OVYzd1daSmlERFVPMmxhUmFMeVB2cExuTnU2bXM5VzBwTkZxNjZPNmx6alJza20yY2lla3kxVXRDZ0xZSm04TWk3Rmd1N2ZEMkRrYw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Here’s When BlackRock’s Spot Ethereum ETF Could Launch After Updated S-1 Filing - CryptoPotato",
        "content": "BlackRock has submitted a revised registration statement for its proposed spot Ethereum ETF. The updated S-1 filing also included details about the company’s seed capital investor.\n\nNow, analysts suggest that U.S. spot Ether exchange-traded funds (ETFs) could launch by late June.\n\nBlackRock Reveals Seed Capital Investor Information\n\nThe world’s largest asset manager submitted an amended S-1 registration statement nearly a week after the U.S. Securities and Exchange Commission (SEC) approved 19b-4 forms for eight Ethereum ETFs, including its proposed iShares Ethereum Trust. Both filings need approval before the ETF can begin trading.\n\nIn the updated one, BlackRock disclosed information about its seed capital investor, who committed to acquiring $10 million worth of shares on May 21, 2024. The investor ultimately received 400,000 shares priced at $25.00 each. The asset manager also said the shares will be listed and traded under the ticker symbol “ETHA.”\n\nEric Balchunas offered insights on the development, expressing optimism about its significance. He anticipated others to follow soon, likely accompanied by another round of fine-tuned comments from Staff. While Balchunas suggested an end-of-June launch as feasible, he emphasized higher approval odds around July 4, regarding an earlier approval as a “long shot.”\n\nGood sign. Prob see rest roll in soon. Then prob one more round of fine-tune comments from Staff. End of June launch a legit possibility altho keeping my o/u date as July 4th https://t.co/WymshkTvat — Eric Balchunas (@EricBalchunas) May 29, 2024\n\nBloomberg ETF analyst James Seyffart remarked that BlackRock’s updated S-1 is “almost certainly the engagement we were looking for on the S-1s following the 19b-4 approvals. Issuers and SEC are working towards spot Ethereum ETF launches.”\n\nHashdex Withdraws Spot Ethereum ETF proposal\n\nThis development comes the same day as a filing showing Hashdex recently withdrew its proposal for a spot Ether ETF, a day after its competitors, including BlackRock and seven other issuers, received approval for it.\n\nNo information has been provided regarding the reasons for Hashdex’s decision or whether it plans to resubmit its proposal. According to its initial September 2023 filing, Hashdex’s proposal for a spot Ethereum ETF combined spot Ether holdings with Ether futures contracts within the same product to reduce potential manipulation risks.\n\nHashdex also aimed for its spot Ether ETF to reflect daily changes in the Nasdaq Ether Reference Price to address regulatory concerns about market manipulation.\n\nCompetitors like Fidelity, ARK 21Shares, and Franklin Templeton have focused solely on spot-based Ether ETFs, making late amendments such as removing support for ETH staking in response to SEC feedback."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxQWXA3eXc0Z2xTLURYLVJGc2dPTC1SdVNNd1c1cUk1TzZhR3VaRkpHMEhaS05XQkJrT1J0a0tXM2J3LW93VzRDYkdtcjZ1R3pfeWFZWDFXN3puN05kdy1HTERDOF9QZnh0S0s0dkVwclpCNWV3SHlNd1Z1T05UXzdqdHl3T1ZXWE9Eb2VhLUd3UnTSAZgBQVVfeXFMTlUxc3FSNERoVjRrWnI2LU5acFBPYnhwakRNZXF0ekUzdkpYNXdsVkg2MU5oV3VkbDhoZ21VRGJub194ZjNfWldqcWVXcmhsejdnUnFoaW5HdmxvTVN4a3pNRmpld2NPV25UTUs4N29BLVJSUkN5ZDYtcUh2NFhiQXFWdUtmM3JZVEJQYWxtQzZvU3FOTU1IQjE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Caitlyn Jenner Solana Meme Coin Crashes After Launching Ethereum Token to Support Trump - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nCaitlyn Jenner’s recently launched Solana meme coin has dived 66% in price over the past 24 hours after the former Olympian announced a new token on Ethereum—this time with the goal of donating a share of fees to support Donald Trump’s presidential campaign efforts.\n\nEarlier this week, media personality Jenner announced her Solana meme coin JENNER, with many crypto observers initially assuming that her account had been hacked. But that wasn’t the case, and she was actually behind the project in tandem with crypto promoter Sahil Arora. Jenner claims that she didn’t have custody of any of the tokens and that Arora owes her “lots of money” after he went “radio silent.”\n\nJENNER spiked in value and led to a growing wave of celebrity-backed meme coins, including from rapper Iggy Azalea and musician Davido, but Jenner's own token took a dive on Wednesday after she tried to expand upon that initial success.\n\nLate Wednesday, the decathlon gold medal winner launched a new version of the JENNER token on Ethereum, but with some tweaks to the formula. Investors apparently didn’t like this move, with the Solana token's price dropping 58% in the two hours that followed the announcement, and now 66% over the past 24 hours.\n\nAD\n\nAD\n\n$Jenner on $ETH\n\nNO team tokens.\n\nNO Dev tokens.\n\nNO founder tokens.\n\nOfficial contract address here: 0x482702745260Ffd69FC19943f70cFFE2caCd70e9 pic.twitter.com/fwXW4Cb2gS — Caitlyn Jenner (@Caitlyn_Jenner) May 30, 2024\n\nArora, who has since launched other celeb-themed tokens, confirmed to Decrypt that he had no part to play in this new token. “She’s a greedy granny,” he said via Telegram DMs.\n\nAn hour later, Jenner took to Twitter Spaces to announce that her new coin has a 3% tax applied to all transactions which, once a $50 million market cap is achieved, will be donated to support Donald Trump’s presidential campaign via a Super PAC.\n\nWhen $Jenner on $ETH hits $50m market cap we will donate to @realDonaldTrump from the tax revenues! We have to protect crypto! It’s ULTRA MAGA! — Caitlyn Jenner (@Caitlyn_Jenner) May 30, 2024\n\nAD\n\nAD\n\nHer previous Solana token peaked at a $42 million market cap, according to DEX Screener, amid the industry-wide confusion that followed its launch. However, her new Ethereum project topped out at a $4.75 million market cap a few hours after it launched, according to DEX Screener. Now, less than 24 hours later, the token is sitting at a $2.4 million market cap—far off its $50 million Trump inspired goal.\n\nJenner has also slowed down tweeting since the heyday of her Pump.fun token. And when she does post, she’s often met with criticism and abuse, now that the Solana version of JENNER has plunged 81% since its Tuesday peak.\n\n\"Give Solana the love back!” one Twitter user replied.\n\nEdited by Andrew Hayward"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMi3wFBVV95cUxQcHVvaER6R0tSZUVKS25NeFZUdDlNY0x5Umd3bUJmVmFjOFBURU1lQTVHbjk3OVZsMWJHWVRJNURSR0Y0R0NBT2NQRVNmdkNYS1VzSEQtMHozeWRhVGhLVV9XMkVJUVpRbjZ5eGFhZXdBRllrTHRRbFotQ2FrSkp3Rm96V09wUmJ5OGY0R0dneUdIUFhTSElfM3FibFlUQXVxb0ZpZXdJc3VkOUdjQ0I1OFdpeGV4SG9RUmx2V0x3dWxPRUNwaWlCM3lZQjhFa2NKS21POHpBQVBvalV6VUVZ0gHkAUFVX3lxTE1DekEyZ2ZycjV0cnZwUFF6alZXeFF2ai1YbGZXWFNyWFlPanF1aGFwQ1prRWlSVW9jdjl0LUk2cEhjZnNTSFE0dGJBQnRkaHZNai0wTmx5eHZZekVWa3U5TGdSTjkxQkJNQUtMd0EtbFB2V1EyNmxYWWQ2aDkxVVpHWnBzc1JndWJTVWlYWWdJREtNS1N4Z1NvN0xlSVNRVHlBQlNNRHVKa1RCZUctdUxrSjdiUXpHZlMxdmwzcFFWbC1tVVZHdlhUc25IbXZndnFXd2c0MFZTd0FhTW1LOVFSR0xmNQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 May 2024 07:00:00 GMT",
        "title": "Ethereum may continue outperforming Bitcoin as 'programmable money' may be ETH's new slogan - FXStreet",
        "content": "Ethereum transitioned from a Proof-of-Work (PoW) to a Proof-of-Stake (PoS) mechanism in an event christened “The Merge.” The transformation came as the network wanted to achieve more security, cut down on energy consumption by 99.95%, and execute new scaling solutions with a possible threshold of 100,000 transactions per second. With PoS, there are less entry barriers for miners considering the reduced energy demands.\n\nStaking is a process where investors grow their portfolios by locking their assets for a specified duration instead of selling them. It is used by most blockchains, especially the ones that employ Proof-of-Stake (PoS) mechanism, with users earning rewards as an incentive for committing their tokens. For most long-term cryptocurrency holders, staking is a strategy to make passive income from your assets, putting them to work in exchange for reward generation.\n\nEthereum uses decentralized blockchain technology, where developers can build and deploy applications that are independent of the central authority. To make this easier, the network has a programming language in place, which helps users create self-executing smart contracts. A smart contract is basically a code that can be verified and allows inter-user transactions.\n\nEthereum is a decentralized open-source blockchain with smart contracts functionality. Serving as the basal network for the Ether (ETH) cryptocurrency, it is the second largest crypto and largest altcoin by market capitalization. The Ethereum network is tailored for scalability, programmability, security, and decentralization, attributes that make it popular among developers.\n\nEthereum is trading around $3,837 on Tuesday as it enters a sideways movement. While current price movement suggests bulls may be running out of steam, it may also indicate a temporary slowdown until the market receives clarity on conversations surrounding the spot ETH ETF S-1 approvals.\n\nEthereum (ETH) followed a sideways trend on Tuesday as the crypto community seems to favor the term 'programmable money' as ETH's one-liner. Meanwhile, whales have continued accumulating ETH despite profiting from the recent price spike.\n\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all or a portion of your investment, as well as emotional distress. All risks, losses and costs associated with investing, including total loss of principal, are your responsibility. The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of FXStreet nor its advertisers. The author will not be held responsible for information that is found at the end of links posted on this page.\n\nIf not otherwise explicitly mentioned in the body of the article, at the time of writing, the author has no position in any stock mentioned in this article and no business relationship with any company mentioned. The author has not received compensation for writing this article, other than from FXStreet.\n\nFXStreet and the author do not provide personalized recommendations. The author makes no representations as to the accuracy, completeness, or suitability of this information. FXStreet and the author will not be liable for any errors, omissions or any losses, injuries or damages arising from this information and its display or use. Errors and omissions excepted.\n\nThe author and FXStreet are not registered investment advisors and nothing in this article is intended to be investment advice."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMi3gFBVV95cUxNSVhNcUtTYjRZSTlPNy1aM1A2VWdEQmc4LTBNX3g4UXcwMG9qYTZCb0tsTG0yOHJJUUI3aHk2cXdBRzljX1ZuaklWMzQ5LUI3dHpZYW1JTTlEMGJpN2djSEs0d1g2WFduU2txZjdLNFFwSFJwNFFjZDQ0YkVDN3Eybkxtd2dmRjE4SHRGTW9pQl92WEM3REZvOGNtLUZ0Y3k0Z1FWaXFKWDFVNkdQSi1EZXFWRjNkSVEzcld5S2p5VEN0bGJlQjdLb2tCTXgwOHNrVHQyU1JxYVNXRVQ1VFHSAeMBQVVfeXFMT1lPVzhFTmkyRFFJaWNfTlJhcm5Hd3RCeDdkNUZ3c2NfR3VjTUpZc002VmpRc2dkQ0J5QWdMUWIyMnZJdEFpanVmWkxycWNZRmtFSnhIdkRDX1ViX3VzOWV6bmttUnJEYUF6Mmd0bkxIWkIwdFFGekcyZ2wzeUZRTUdDbTBsSzJUMjhSUXNaYmxpaWZmOFhid25yVVZYd2dNaTNiUDZLNmt4R2lFZzFWUk9vUzlKaHNJMzlKaXRrejIyM1F1VjBzaDJlUlNibWhqUVBuM2Q2TFJRMnJMNzJzTEw2UUU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: Facing correction after ETFs led rally - FXStreet",
        "content": "Bitcoin price is unable to overcome the $69,712 to $71,907 area of resistance.\n\nEthereum price will likely pullback into the major support level of $3,360.\n\nRipple price could end the consolidation between $0.463 and $0.572 range.\n\nBitcoin (BTC) price continues to consolidate in a range that offers a buying opportunity, while other major cryptocurrencies, such as Ethereum (ETH) and Ripple (XRP), look set for a potential price correction. ETH and XRP rallied 10% and 5%, respectively, right after the US Securities and Exchange Commission (SEC) approved Ethereum’s spot Exchange Traded fund (ETF).\n\nBitcoin price eyes for a rally\n\nBitcoin price rallied 8% on May 20, but such an impulsive move could lead to a retracement. As seen in the chart below, BTC is currently being rejected by the order block between $69,712 and $71,240, which also harbors the weekly close at $71,280.\n\nSideline investors looking for buying opportunities could do so at the following levels:\n\nThe volume profile high node range that extends from $67,090 to $66,035. The 100-day Exponential Moving Average (EMA) is currently at $62,533, coinciding with the bullish order block range between $62,985 and $61,427.\n\nIf BTC bounces off the $62,533 level, it could rally 10% to the local top formed at $69,712.\n\nThe Relative Strength Index (RSI) and Awesome Oscillator (AO) indicators support the aforementioned bounce, which are firmly present above their respective mean values of 50 and 0, suggesting that the bulls are in control.\n\nBTC/USDT 1-day chart\n\nOn the other hand, if Bitcoin's price closes below $58,271, it would invalidate this bullish thesis by producing a lower low in the higher timeframe, leading BTC to crash an extra 10% and hitting the previous support level of $52,400.\n\nEthereum price wants to move higher\n\nEthereum price broke above the falling wedge pattern and the 50 EMA level at $3,144 on May 20 and rallied 21%. Currently, ETH is being rejected by the bearish order block of March 12, ranging from $3,980 to $4,093.\n\nEthereum price could rally upwards in two ways:\n\nA break out above the daily bearish order block, extending from $3,980 to $4,093, flipping it into a support zone. ETH could pullback into the major support zones of 50-day EMA at $3,558, which roughly coincides with the bullish order block, stretching from $3,393 to $3,119.\n\nIf the conditions mentioned above are to play out, then the Ethereum price could revisit its all-time high (ATH) of $4,868.\n\nETH/USDT 1-day chart\n\nOn the other hand, if Ethereum's daily candlestick price closes below the $2,864 level, it would produce a lower low and signal a break in the market structure. This move would invalidate the aforementioned bullish thesis, potentially triggering an extra 8% crash to the previous support level of $2,600.\n\nRipple price likely to end its consolidation phase\n\nRipple price is currently consolidating between $0.572 and $0.463 after a major 33% fall in mid-April. This 46-day consolidation has seen XRP forming higher lows in the daily time frame, indicating a decrease in selling pressure.\n\nIf Ripple price breaks above the $0.561 —$0.572 range, it could rally 8% to revisit the 61.8% Fibonacci retracement level at $0.621.\n\nXRP/USDT 1-day chart\n\nHowever, if the Ripple price breaks below the range of $0.463, then XRP would crash an additional 10% to its previous support at $0.419."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxPa3BDQndMNXBtZnRUXzFhRUdOaWVhX085NW9kcWFrcWFBRllTMXFIQzBzN2NRM2ZRTU9xMXUxNk1yN0V2Z0ZscjFCZ080b19Xa1lScTN3em5FX2E4V0V0ZFdWZkMzeFFBcEszanpMZTZXakd3ZjBRSE1fYmRReU5ocNIBiAFBVV95cUxPZDNJYmdPNExGckRQQ1gtcG9uOHF6MmpJalZmeHJkSEN6VWg5bFhWZ2lndlY3WHVaaWMzeFlyaDJzVnhMWlhJdjNvN0J3MnEzb0VSWXBnbUxON0M1SjNENTV6X0xvamttdUpDT3RfXzRHS2Z2Y0V2S0NKME92dXhLQ2VyMG1FaVJ0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Singapore Bank DBS Says It Isn't an Ethereum Whale - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIt would have been awfully bullish for Ethereum if DBS, the largest bank in Singapore, were a whale with $650 million worth of ETH on its balance sheet.\n\nBut that's not the case, according to the bank.\n\n\"In relation to the post, DBS does not have this position on our books,\" a bank spokesperson told Decrypt in an email.\n\nThe post they were referring to is one from blockchain analytics platform Nansen. The firm said on Twitter early Thursday morning that they had linked an Ethereum wallet to the bank.\n\nAD\n\nAD\n\nWe've identified this $650m $ETH Whale holding 173.7k ETH as DBS, the largest bank in Singapore with assets totaling S$739 billion as of 31 Dec'23 This address has made over $200m by holding ETH... 🤯 Track the address on Nansen here: 0x9e927c02c9eadae63f5efb0dd818943c7262fb8e pic.twitter.com/2rkM3cZ6gJ — Nansen 🧭 (@nansen_ai) May 30, 2024\n\n\"We have it under good authority, via several independent sources, that DBS owns the private key of this wallet and these assets are most likely a part of their custody solution,\" Edward Wilson, a Nansen analyst, told Decrypt. \"This may be similar to how we see institutions, both crypto native, like exchanges such as Binance or Coinbase custody funds on behalf of their users and how non-crypto native funds custody digital assets for their clients. The institution may be the custodian and responsible for managing the security of the funds.\"\n\nWhen asked if the wallet is instead one that the bank uses to custody funds on behalf of its crypto clients, the spokesman declined to comment.\n\nIt's not totally implausible that DBS would hold Ethereum—even if only on behalf of its clients. It's got a long track record as a crypto early adopter.\n\nAD\n\nAD\n\nThe Singapore bank has seen its market capitalization grow substantially since the start of the year, from $63 billion to $75 billion at the time of writing. It added support for China's CBDC, the e-CNY, last summer. And in 2020, when many banks were still blocking crypto transactions, the Singapore firm launched its DBS Digital Exchange.\n\nAnd when the exchange proved popular with its clients, the bank added a custody service as well.\n\n\"In 2022, DBS reported an 80% increase in the volume of Bitcoin traded on its DBS Digital Exchange,\" the bank wrote last year. \"Capitalizing on this momentum, the bank expanded its services to include digital asset custody, which resulted in a doubling of the number of Bitcoins under custody.\"\n\nAt the time of writing, DBS's shares are trading for $35.85 Singapore dollars, or approximately $26.55 in U.S. dollars. And Ethereum is currently trading for $3,756.96. That's a 1.5% drop since yesterday, but a 25% gain since last week when the U.S. Securities and Exchange Commission approved Ethereum spot ETFs to trade on exchanges."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxNbEh6V0F1WUhjend5NzUwaTl4UGJiOTZSa2luSEZYZzBRdXQtTFNWbkVBY2EtRVY0ZUpyMi1JWVNwR1RnclFJN0RhY05LV1Y2dnR2WnlJNDh1NmU5ZC03OVZSV3FuZ19oaUtZeUxPM2hRSjJQLVFEQXhrNG5ESGZoNXhmbnZKZEZZR3FCMkc4eDlpbzZQREt1eHZfcnYtbzhKQzB6cmNSa3JQQnppMVA0cUsxRm1rT1g4dEVFZnZKYnJVUEtIWmpsT3lzcTlYaU1vdU02TXdGLTV1RWx6RVl0TkNwZHpWaW5Z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Cathie Wood Of Ark Invest Believes Ethereum ETF Approval Linked To US Politics, Sees Likelihood Of A Solana ETF As Well - Benzinga",
        "content": "ARK Invest CEO Cathie Wood has stated that cryptocurrency has become a significant political issue in U.S. elections, leading to the unexpected approval of key Ethereum ETH/USD ETF filings.\n\nWhat Happened: Wood made this remark at Consensus 2024, as reported by CoinDesk, attributing the sudden approval of Ether ETF filings to the growing importance of cryptocurrency in U.S. election debates.\n\nWood expressed surprise at the approval, stating, “The read was it was not going to be approved. It was absolutely not going to be approved.” She further explained that the sentiment around the Financial Innovation and Technology for the 21st Century Act (FIT21) evolved in the House, leading to its recent bipartisan approval.\n\nWood also pointed out former President Donald Trump’s increasing comfort with Bitcoin and other cryptocurrencies, including his recent decision to accept campaign donations in crypto, as a factor that has drawn attention to the sector.\n\nSee Also: Shiba Inu, Dogwifhat Post Double-Digit Gains As Memecoins Shrug Off Dips In Bitcoin, Ethereum: What’s Goi\n\nWhile Wood suggested that a Solana SOL/USD ETF could be approved, she deemed meme coin-focused funds unlikely, stating that large brokerage firms and investment advisory companies would not accept more than “the majors.”\n\nWhy It Matters: Wood’s comments come in the wake of her earlier predictions about the potential of cryptocurrencies, especially Bitcoin ETF/USD. In April 2024, she raised her Bitcoin prediction by $2.3 million, suggesting that a $1,000 investment could be worth a significant amount by 2030.\n\nDespite Ether’s recent spotlight due to the ETF approvals, Wood maintained her bullish sentiment on Bitcoin, stating, “Bitcoin, hands down. No question about it. It is a global monetary system. It is a technology, and it is a new asset class.”\n\nEarlier this week, she also highlighted how El Salvador’s push for Bitcoin and AI could potentially increase its GDP 10X in five years.\n\nARK 21Shares Bitcoin ETF ARKB attracted inflows of $4 million on May 29, and around $ 3 billion since the ETFs started trading in January, according to SoSo Value.\n\nRead Next: Bitcoin, Ethereum, Dogecoin Edge Lower As Inflation Fears Grip Investors: Less And Less Of King Crypto Available For Masses, An ‘Enormous’ Bull Market Inevitable, Says Analyst\n\nDisclaimer: This content was partially produced with the help of Benzinga Neuro and was reviewed and published by Benzinga editors."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiggJBVV95cUxQMmM1UVpBMlZaNFR2aFFBTjBfQ1dNV2pfRUU3THhMcC1VREJrYUw4ek1naFQ5MzhLUFpJSTYxWUNBRmcyYTNZUFBiTHJOYXdoa3FEYTJFS29TOU5yVkpVN2xjZjR5SVdHT21WUng0cUVNWEJWTTFlcFpZZ2ltOWkwS2M4UnpDQUlEckZabXVndFhwb3pjSVVRdVBEak1YUUh2dUlJYWpMWXhUNjJmcHVEOTBaWDJjUGpkVjVZNmUzZVVDbTFxSDlHZ2l5OFUweUdOWDFadWtkZFdpLTI3WUQyWU83dDAzRHIxTVJWU3RzWDBRdGttaTgyeUlKYXhVQ3d6N0HSAYcCQVVfeXFMT0FZNkFWLVFUdVRMTzZsV0ZvczY0SUM5Q0lZcmxMbEJmejVsSENRTmxlRVdpUV9XT0g1Ykl2VUxNTUtnNGVlaDZJb2tremJTX0NtREYzd2E1Wmp5SkpSNUJmSEpRdjREVTB6OGtJaGllNHI2Y0o3RmVPbVJXdjZDM1FIRjlXclJwWU1lMHg1bVVzN3JzOWJvdHJ4U2VVYnJWQ2Nvb1RlTVF5ZHZhWHhoUmxXemlqT1JlZ0VseFlJRVlFNHFRZm0wb1VvZjMwQ3hvblFLeHlfSFN5NHVPNHF5VEZuby1zcGtnR2pRTEEya2p0VEs2VXZac0psNy1ZdzAtUXNlVTIyaGs?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "BlackRock’s Ethereum spot ETFs listed on DTCC: Five cryptos to diversify with and capitalise on this trend - The Economic Times",
        "content": "KangaMoon (KANG) raises over $7.2 Million and reaches 32,000 Users\n\nNear Protocol crypto on the rise as network surpasses $200M in issued USDC\n\nEthereum Classic Price at an uptrend following latest updates\n\n\n\nEthena (ETA) rises 27% – How far can it climb in 2024?\n\n\n\nBlackRock’s spot Ethereum ETF has been listed on top of the Depository Trust and Clearing Corporation (DTCC) with the ticker symbol ETHA.This listing follows the SEC’s approval of a total of eight spot Ethereum Exchange Traded Funds (ETFs). Following this major move for ETFs in the Web3 space, traders have begun to diversify their holdings in order to get the most out of the market. Out of the thousands of available altcoins, five have stood out the most as cryptos that can surge in value immensely, and these include KangaMoon (KANG), NEAR Protocol (NEAR), Ethereum Classic (ETC), Chainlink (LINK) and Ethena (ETA). Let’s take a look at these cryptocurrencies:KangaMoon ( KANG ) will revolutionise the meme coin landscape through the construction of a sustainable ecosystem that fosters significant token utility, one that transcends hype-driven trends. This is achieved through a strategic fusion of Social-Fi elements and Play-to-Earn (P2E) mechanics, which cultivates long-term value beyond just hype.In addition, the token’s blockchain ICO has garnered significant traction, as the project now boasts a user base surpassing 32,000, while the token has experienced a growth of 400%. The presale itself also secured over $7.2 million in funding, which further solidifies investor confidence, as it is projected to break past $8 million by the end of the month. Moreover, KANG’s initial price point was at $0.005 but now trades at $0.025 during the bonus presale stage.Not only does this reflect significant growth but the round also represents a limited-time opportunity to get KANG at a discount before it explodes in value. In addition, KangaMoon has already established its presence on prominent platforms such as CoinMarketCap and CoinGecko, facilitating investor analysis, and will soon get listed on BitMart, a major CEX. As a result, analysts are now projecting a 100x price increase following its launch.NEAR Protocol (NEAR) surpassed $200 million in natively issued USDC , which is a major milestone that can send the ecosystem demand and utility further. This will also have the effect of increasing demand for the NEAR Protocol crypto, which can result in a price uptrend.The on-chart metrics for the crypto are now bullish, as the NEAR Protocol price has found support at $7.70 after briefly passing the $8 price barrier. Now, the RSI and MACD data showcase a positive price momentum, and according to the NEAR Protocol price prediction, it can end Q4 of 2024 at $11.46.Ethereum Classic (ETC) is also experiencing an upswing in trader interest following its most recent integrations. For example, now anyone can mint the Ethereum Classic crypto through the usage of the F2Pool The on-chart metrics for the Ethereum Classic price are bullish, as the weekly price increase was by 20%, further solidifying it as a major contender. Based on the Ethereum Classic price prediction, by Q4 of 2024, the crypto can end the year at $45.71. Chainlink (LINK) expands services in nine different blockchainsChainlink (LINK) is consistently expanding the offering of its ecosystem, as within the past week, it saw 12 integrations of six chainlink services, all across nine different blockchains, including Arbitrum, Base, Ethereum, Linea, Metis, Optimism, Polygon, Scroll and zkSync.The Chainlink crypto has also increased in value as its weekly chart suggests a 10% uptrend, and could soon result in further gains. Based on the Chainlink price chart, it recently surpassed the $17 price barrier, indicating that $20 marks a major resistance point that it now needs to pass in order to reach new heights. According to the Chainlink price prediction however, the crypto can end Q4 of 2024 at $25.08.Ethena (ETA) is also at an uptrend as it experienced a 27% price increase during the past week fueled by ecosystem expansion. The team recently announced that USDe is the first integration, with the new UX layer of DeFi , Infinex. As a result, anyone can now deposit USDe and earn from Ethena while also earning Infinex governance Points (GP). The Ethena crypto could see a major uptrend as a result, further appealing to traders.According to the Ethena price chart, it broke above the $0.90 price barrier, and is closer than before to passing even above $1. According to the Ethena price prediction, it can end Q4 of 2024 at $1.33.With Ethereum ETFs being approved, the race is now on for more cryptocurrencies to get the same treatment. Out of the many cryptocurrencies available, the key ones that stood out the most include NEAR Protocol, Ethereum Classic, Chainlink and Ethena.However, the biggest growth was seen with KangaMoon as it's up 400% on the charts, and it has raised over $7.1 million so far. With a unique blend of Play-to-Earn (P2E) features, Social-Fi elements, and a community-driven approach, it is poised to dominate the charts in 2024 . Discover the Exciting Opportunities of the KangaMoon (KANG) Presale Today! Join the Telegram Community:The above content is non-editorial, and TIL (Times Internet Limited) hereby disclaims any and all warranties, express or implied, relating to the same. TIL does not provide investment advisory services in any manner and the publication of this content does not mean TIL's or Economic Times endorsement. TIL strongly recommends the users to take all steps necessary to ascertain that any information and content provided is correct, updated and verified and/or speak with a qualified investment professional before making any investment decisions."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxOV0hKUTU3ZWdyN09mWkxYZXRKb05RdnY5NnJjX09mRjRSRzVZS2VSQ29vbXk5VkFsYVhnMjR4NGx1MTl1dk1lbl9KM3J5VGZiU1NQVjllV20zNUE3bXFzZ1NkYmtVY2VjT3FudnptSS1BdURybHNzVjdOQUZJSFVqb3JBOTdNNm5RaWo4NTRrQ0NjOVBWMFMyTi1zQ0g5VmJwSEJ0V2VQUDNUUWItX1plS0tCTXNhaXgxdTU4MmZzX1V2cjVYbVYweXRSUGZrbWZRMUhabDBybXk5dHVtSnBNWUJoenNGdFF4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Telegram-Associated Notcoin, Sam Altman-Founded Worldcoin Outshine Bitcoin, Ethereum On A Weak Day - Benzinga",
        "content": "Telegram-linked cryptocurrency Notcoin NOT/USD and Sam Altman-founded Wordlcoin WLD/USD raked in major gains on a day when market heavyweights slipped lower.\n\nWhat Happened: NOT accumulated double-digit gains to emerge as the best-performing cryptocurrency in the last 24 hours. The coin, which is backed by top executives from Telegram, has more than doubled in value over the week, according to CoinMarketCap.\n\nNOT logged a trading volume of $928 million in the last 24 hours, with its market cap surpassing $1 billion.\n\nThe rally outstripped the broader market's performance as Bitcoin BTC/USD, Ethereum ETH/USD, and Dogecoin DOGE/USD traded lower as of this writing.\n\nCryptocurrency Gains +/- Price (Recorded at 10:00 p.m. EDT) Notcoin NOT/USD +17.06% $0.01071 Worldcoin WLD/USD +4.75% $4.89\n\nAlongside, biometric-based cryptocurrency, Worldcoin, rose significantly in the last 24 hours, with trading volume more than doubling to $525 million.\n\nWhy It Matters: NOT's exponential growth comes as users hop on to mine the cryptocurrency through the play-to-earn Web3 game hosted on Telegram. The game's cryptocurrency offerings have grabbed the attention of Telegram's massive user base.\n\nMeanwhile, WLD's gains snapped a losing streak, as the project launched by OpenAI Chief Sam Altman, faces opposition over privacy concerns. Worldcoin was asked to shut down operations in Hong Kong recently.\n\nCapital flows to altcoins indicated a healthy market trend in a year where Bitcoin’s market dominance has increased.\n\nIn an X post Wednesday, popular cryptocurrency analyst Michaël van de Poppe noted that Bitcoin was in a consolidation phase, while altcoins are bracing for their breakout.\n\nWhere are we in the cycle?\n\n\n\nWe're at the stage where #Bitcoin consolidates and #Altcoins are waiting for their breakout to come.\n\n\n\nTo me, the trigger is going to be the listing of the Ethereum ETF.\n\n\n\nFrom there, it could be going quite fast in a positive sense. — Michaël van de Poppe (@CryptoMichNL) May 29, 2024\n\nPhoto by stockphoto-graf on Shutterstock\n\nRead Next: BlackRock’s Bitcoin ETF Dominates Market with Nearly $20B in Assets: Report"
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNcm5SeFpvZDBIZ3Y2ZEF5dzlTQVZXWnlOS29DVkZvQXdJWjNaUHFiajNKTzhyRjVwOFF5VXVtTzFraXRzVG9KbDFDc3dyT005cHg3RFlnRXJXNXQ2VjVWRHhpN3dra2pYdlZhWGhVUU5Ha0tXSXZjZlo1Y3BnVEZOUDZwNG15N0kxRzhFZ9IBkgFBVV95cUxNbm5WZUVqTzBiN0J0ZWdrS2pQemZPdVRRQzQ3QW5aLWN2RnNQTVNsRnBlOVdtZkJBRXVTLS1jWDZXVFNvNjJqc29QM2RMMEZCRXFKZUNDTFh3c1h5d1hSRi1LbUdVY0liS2JUSVpyQ2lIYjRhaXl3dWlXcnhHV2stNG5VelNzNG1XSzlLQTI2ZDZaQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "BlackRock Submits a Revised S-1 Form for its Spot Ethereum ETF - CoinGape",
        "content": "BlackRock has submitted an updated S-1 filing for its iShares Ethereum Trust, signaling a robust move towards the launch of a spot Ethereum ETF. This follows the Securities Exchange Commission’s (SEC) initial approval of Form 19-b last week.\n\nBlackRock Leads with New Ethereum ETF Filing\n\nThe SEC recently approved spot ether ETFs from major financial entities, including VanEck, Fidelity, and others, with BlackRock‘s iShares Ethereum Trust at the forefront. The amended S-1 document, a crucial step after the initial nod, has garnered attention for its detailed disclosures and BlackRock’s commitment.\n\nadvertisement\n\nThis update is pivotal as it comes amid preparations for a possible launch at the end of June or early July. James Seyffart from Bloomberg views this as a clear indicator of the ongoing collaboration between issuers and the SEC, emphasizing the market’s readiness for these financial products.\n\nErick Balchunas, a senior ETF analyst, also remarked positively on the developments. He noted on social media that the updated filing is a “good sign” for the industry, suggesting a sequence of events leading to the likely introduction of these ETFs in the market soon.\n\nHashdex Retreats from Ethereum ETF Race\n\nBlackRock has not only demonstrated its leadership during the Bitcoin ETF era but is now setting significant benchmarks with Ethereum as well. The recent filing details include information about seed capital investments, which are crucial for the ETF’s initial phase.\n\nOn May 21, 2024, an affiliate of BlackRock, referred to as the Seed Capital Investor, acquired 400,000 shares at a price of $25.00 each. This substantial investment underscores BlackRock’s confidence and readiness to lead in developing Ethereum-based financial products.\n\nThe company has announced that these shares will be listed under the ticker symbol “ETHA,” enhancing the accessibility and transparency for investors interested in cryptocurrency investments. This move is expected to strengthen BlackRock’s position in the market, offering a new avenue for investors to engage with digital assets through a regulated framework.\n\nHashdex recently withdrew its proposal for an Ethereum ETF, a day after its competitors received approval. The reason behind Hashdex’s decision remains undisclosed, highlighting the unpredictable and competitive nature of the ETF landscape.\n\nAlso Read: Solana Congestion Issues Poked As CME Puts Out SOL ETF Hopes\n\nMaxwell Mutuma Maxwell is a crypto-economic analyst and Blockchain enthusiast, passionate about helping people understand the potential of decentralized technology. I write extensively on topics such as blockchain, cryptocurrency, tokens, and more for many publications. My goal is to spread knowledge about this revolutionary technology and its implications for economic freedom and social good.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxONW45RG1qXzkwWFhLYV9iUHFieDUzSm1pTjZ2Ty05dlhoZjEyUzBvY1FjS2RiSlQ5Z1M1Y193X0pKNmFLaHRaMGhqeEdOVmNuam55aWY4TGxoTXdhTlR6aEthVXZROHZXdUd1OWlRUExPOUhGMU1iMXg4cHJOWFkwRnVjZl9GeTVDdFM3eHpuTFk5c2hNTmhDczllaHBwaF9BWThwVVVB0gGrAUFVX3lxTFA4ZFFwanhXREtlUl9CRUk4blVnNTNlcTlOWVRFcHV3STdjZE1pVmF0YW12V3l5YWhOb1FvdGFfWmRobkJadTVTY2lzYTVuSWo1WEJqalJJc1prdmZpc0l5RWZneWxrM1VWbS1EYmdwUjRjREt3dWRhT3F0emNfRzRsUmpwMkVmU29TVndkb2dQRnBmR1REalM3VjlyV2RlWUoyR0RSQ24tVnRGZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Singapore’s Largest Bank Revealed as Ethereum Whale Holding $650M in ETH: Nansen - CryptoPotato",
        "content": "Blockchain analysis firm Nansen has identified DBS Bank, one of Singapore’s largest banking institutions, as a cryptocurrency whale.\n\nAccording to Nansen, a crypto wallet reportedly owned by DBS Bank holds 173,753 Ether (ETH), valued at around $650 million at the current market price.\n\nDBS Sitting on a $200M Profit?\n\nNansen’s analysis states that the address, flagged on May 30, has already generated a paper profit of $200 million from its Ether holdings.\n\nWe’ve identified this $650m $ETH Whale holding 173.7k ETH as DBS, the largest bank in Singapore with assets totaling S$739 billion as of 31 Dec’23 This address has made over $200m by holding ETH… 🤯 Track the address on Nansen here: 0x9e927c02c9eadae63f5efb0dd818943c7262fb8e pic.twitter.com/2rkM3cZ6gJ — Nansen 🧭 (@nansen_ai) May 30, 2024\n\nWhile DBS Bank has not officially confirmed ownership of the ETH, a community member suggested that the assets might belong to its digital exchange, which caters to accredited investors. They speculated that the bank holds the ETH on investors’ behalf rather than it being direct bank assets.\n\nDBS Bank is no stranger to the cryptocurrency sector. It offers various services, including digital asset custody, a trading exchange for security tokens, and a portfolio management app that integrates traditional and crypto assets.\n\nIn 2020, DBS Bank launched a crypto trading and custody service and a platform for conducting security token offerings. At the time, the bank emphasized that it would not hold any assets on the exchange but would provide custody services for investors. “All digital assets are kept at DBS Bank, which is globally recognized for its custodial services,” the bank stated. The services supported major cryptocurrencies, including Bitcoin, Bitcoin Cash, Ethereum Classic, and Ether.\n\nDBS’s Digital Currency Initiatives\n\nSince then, DBS Bank’s crypto sector has witnessed significant growth. In 2022, it reported a four-fold increase in Bitcoin purchases on its digital exchange, doubling total trades between April and June 2022. In 2023, it reported an 80% increase in Bitcoin trading volume, attributing this growth to the market instability following the crypto collapses of 2022.\n\nDBS has broadened its digital currency efforts beyond cryptocurrencies, engaging in government-related Web3 projects in Singapore like Project Guardian. This initiative successfully acquired tokenized Singapore dollars using tokenized Japanese yen.\n\nAdditionally, DBS is involved in Project Orchid for government vouchers and conducted a cross-border e-Chinese yuan transaction test for shipments between Singapore and India.\n\nFurthermore, its Chinese subsidiary, DBS Bank China, introduced an e-CNY merchant solution for businesses to accept payments in the central bank digital currency (CBDC). The bank also provides trading exchanges for security tokens and a portfolio management app catering to traditional and DeFi assets."
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxOSEtwNEwzXzk0ZVpCVjdRbWZXaEcwZm5IUDA2aVE2VUMtaURvQlFoNDlla2FjdFVLcnB0VlVLM29wOHotSk1JTHdIMU45TDNWRXRtMGY0Y0FCV0VnVnZzN0p3S1lVRGhvSzl3aE1waGJpbGhZb2NFZl92SUM2UERNeGp5Z2VZMmUxdFMwNW5nS04wUUdKRmdRMVpBTTNDTklxQ0JLSTY4cUs0OTl6Nm13R0lFd2RRXy0tLXFNM3dB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 May 2024 07:00:00 GMT",
        "title": "Ethereum Name Service (ENS) propone di espandersi e di lanciare il proprio layer-2 - The Cryptonomist",
        "content": "Yesterday, ENS Labs, the company responsible for managing the decentralized service Ethereum Name Service, presented a governance proposal where it invites the community to expand its dapp into a layer-2 network.\n\nWe still don’t know anything about the prototype of the network that ENS aspires to migrate to: all we know is that as a fundamental criterion the new chain must be EVM compatible, censorship-resistant, decentralized, and open source.\n\nAnche il money market Aave e la piattaforma di restaking Etherfi stanno pensando di tuffarsi nel panorama dei layer-2 lanciando una rete proprietaria.\n\nLet’s see all the details below.\n\nENS wants to launch its own layer-2 blockchain\n\nEthereum Name Service (ENS), protocol for the creation of domini on the Ethereum blockchain, is considering migrating to a layer-2 to address some technical limitations and improve the end-user experience.\n\nQuesto è quanto riportato da ENS Labs, organizzazione non-profit situata a Singapore che si occupa dello sviluppo della piattaforma ENS, che con una proposal di governance ha condiviso ieri l’idea con la community del progetto.\n\nWithout revealing too many details, the company emphasized the potential benefits that would be brought to the protocol, such as improved scalability with reduced gas fees and the introduction of new advanced features.\n\nIl nuovo layer-2 dovrà essere necessariamente compatibile con lo standard EVM, oltre che resistente alla censura, decentralizzato e open source.\n\nIntroducing ENSv2: The Next Generation of ENS 🎉🎉🎉\n\n\n\nENS Labs is excited to announce our proposal to extend the ENS protocol to a Layer 2 network. This move isn't just about migrating parts of the protocol; we're re-envisioning the architecture from the ground up! pic.twitter.com/3xM6owTpKk — ens.eth (@ensdomains) May 28, 2024\n\nIn the world of finance, the terms “bull” and “bear” are often used to describe market trends. A “bull” market is characterized by rising prices and investor optimism, while a “bear” market is marked by falling prices and investor pessimism. Understanding these concepts is crucial for anyone looking to navigate the financial markets effectively.\n\nSince 2017 ENS has established itself as the leading platform for on-chain domain registration, effectively becoming the bridge between traditional internet and the decentralized web.\n\nWith the passage of time, however, the ambitions of this protocol have also changed, which now in order to truly become mainstream aims to offer lower gas costs than Ethereum fees and faster transactions.\n\nThe Ethereum blockchain is indeed excessively expensive to use when there is too much congestion, skyrocketing the commission costs to execute a simple transaction or approve a smart contract.\n\nIf the proposal is accepted by the community, the domain registration phase will move to layer-2, which will become the new platform for user interactions in all respects.\n\nWith the update, a new hierarchical system is also proposed for more effective management of domini, where the holders of these resources will have access to a unique register, where they can check the subdomains and configure the resolvers.\n\nFurthermore, the transition to ENSv2 implies the improvement of l’interoperabilità multi-chain, with the functions of ENS that will also be brought within other cryptographic ecosystems.\n\nWe still do not know the timing of this fundamental transition in the history of Ethereum Name Service, but it is likely that the migration could take place in 2025, provided the proposal passes.\n\nRegarding the news Eskender Abebe, Product and Strategy Manager at ENS Labs, reiterated how the release of Ethereum Improvement Proposal (EIP) 4844 which introduced the function of BLOB in Ethereum rollups with Dencun, was a factor of enormous importance that motivated the team to evaluate the transition to layer-2, effectively making transactions on these second-level networks cheaper. These are his words:\n\n“The release of EIP4844 has made Ethereum-based layer 2 networks much more convenient and scalable, which has been a major driving factor for the ENS proposal.”\n\nAave and Etherfi also consider a proprietary layer2 network\n\nENS non sarebbe l’unico top protocollo della blockchain di Ethereum a pensare ad una migrazione presso un layer-2 più scalabile: dopo il recente successo del trend delle soluzioni di ridimensionamento zk-rollup e degli optimistic rollup, con il TVL di questa nicchia che ha superato i 47 miliardi di dollari, sempre più entità puntano a lanciare la propria chain con appoggio su Ethereum.\n\nOne of these is Aave, a very famous lending protocol that should soon complete the upgrade to Aave V4 with the platform aiming to introduce a unified multi-chain liquidity layer, becoming much more efficient in all respects.\n\nThe founder of the project, Stani Kulechov, in a recent post on X informed his community that after the V4 Aave could launch its own layer-2 network expanding its DeFi ecosystem towards new horizons.\n\nWe remind you that Aave represents the third largest dapp on Ethereum after EigenLayer and Lido, with a TVL of 13 billion dollars: if it landed on an L2, it would effectively become the largest secondary network on Ethereum, even beating the industry leader Arbitrum.\n\nIt would simultaneously also be the third largest chain in the entire Defi sector, behind Tron and obviously the parent company Ethereum.\n\nWe do not know the technical details of the new product but we know that the official launch is scheduled for 2025.\n\nThis is not a drill, Aave Network is planned to come after V4. https://t.co/a43nNlT114 — Stani^ (@StaniKulechov) May 27, 2024\n\n“`html\n\nAnche EtherFi, noto protocollo di restaking di ultima generazione con un TVL di 6 miliardi di dollari, ha in programma di costruire un layer-2 proprietario in futuro.\n\n“`\n\nAfter achieving enormous results in the market, such as the introduction of native restaking on L2s, the launch of its own token as an airdrop, and the release of a debit card to collateralize the balance in the protocol by borrowing USDC, now EtherFi aims for the next step.\n\nEven here, the details of this step are not known, except that it could likely happen in 2025, contributing to making user transactions much faster and cheaper.\n\nThe objective for the protocol is to improve the user experience and expand its connections with the DeFi landscape, aiming to attract as many resources and liquidity as possible."
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxOeTZPX0dMT3B1YkNSbE5yTHF3cXpVb3N1NEZLQno0WjJXXzh0VVRwY3hud1JtY05QVHFWMzczNmJSUDA3MG55V2t6ckVWc1BYMjlKVkhKbHRSSUszOVZ6djEyOFVGcGdLS3pBUUgzZWVWLXNqazZoS2F0YjFNY0tNNWxEV1NpWFJnQjBKNjFQRHPSAZYBQVVfeXFMUHNLcGlSaEtBdW91eHV4dzh4eHdBbzFLOUVfZHZ0MEJ3VFdvaU1BZHlDOG9mSGlrSVlaVE9xcVVpc2xxcXBCSGlUS21LRklDZVZWMGNWLVlnZkFNeF9pYTk0Qm1KdGhUNF91MGMyY1VyaFdPMGhZM1VyU1Njcm01azJROUJxTHRLc3BWNG9oZEpmRmJLMjlR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Crypto Prices Today May 30: Bitcoin & Ethereum Prices Ride Rollercoaster While NOT Continues To Soar 18% - CoinGape",
        "content": "The crypto prices today have continued to raise eyebrows across the broader industry. Bitcoin (BTC) & Ethereum (ETH) have again shown a volatile price movement, while altcoins too majorly traded in the red. The global crypto market cap was down 1.40% to $2.54 trillion in the past 24 hours. Further, the total crypto market volume over the past day saw a 9.30% decrease to $82.63 billion. However, Notcoin (NOT) has continued to pump, defying broader market expectations.\n\nHere’s a brief report on the top cryptos and their price action for today, May 30.\n\nadvertisement\n\nTop Crypto Prices Today\n\nBitcoin Price\n\nThe flagship crypto, BTC, showed a trading session primarily in the red today. BTC’s price rested at $68,037.54, a 0.98% decrease from yesterday. Its 24-hour lows and highs are $67,101.49 and $68,852.23, respectively.\n\nBesides, Bitcoin’s dominance at press time is 52.68%, an increase of 0.16% over the day.\n\nEthereum Price\n\nMeanwhile, Ethereum’s price continued to show a period of sideways trading in the broader time frame chart, dipping 1.51% in the past 24 hours to $3,786.83. It’s worth mentioning that the token’s 24-hour lows and highs are $3,742.04 and $3,880.65, respectively.\n\nDespite the recent spot ETH ETF approval by the U.S. SEC, the global crypto community awaits Ethereum’s much-anticipated rising price action.\n\nSolana Price\n\nIn the interim, amidst talks of a potential SOL ETF next in the pipeline surfacing in the crypto community, Solana witnessed a 1.53% dip in its price in the past 24 hours, reaching $169.54. Its 24-hour lows and highs are $167.32 and $173.64, respectively.\n\nXRP Price\n\nThe cryptocurrency brought by American blockchain payments giant Ripple Labs, XRP, continued to showcase a rollercoaster ride and traded at $0.526, slipping 0.46% over the past day. The token’s 24-hour lows and highs were $0.5201 and $0.5321.\n\nDOGE & SHIB Prices\n\nIn the meme coins sector, Dogecoin (DOGE) tumbled 2.49% over the past day to reach $0.00002788. Shiba Inu (SHIB), Dogecoin’s rival, fell 0.13% over the past day to $0.00002791.\n\nIt’s noteworthy that prominent meme-themed cryptos such as Bonk and PEPE also dipped remarkably, emerging in the top losers list.\n\nTop Crypto Gainers Today\n\nNotcoin (NOT) price soared 18.73% to $0.01107.\n\nBitget Token (BGB) price jumped 7.75% to $1.32.\n\nArweave (AR) price rose 6.09% to $40.72.\n\nORDI price saw a 3.99% increase to $43.22.\n\nAlso Read: RWAs Get A Date In Court Next Week Amid Push For ‘Efficient Markets’\n\nTop Crypto Losers Today\n\nBonk (BONK) price corrected 11.78% to $0.00003734.\n\nPepe coin (PEPE) tumbled 7.96% to $0.00001507.\n\nBook Of Meme (BOME) saw a 9.43% decrease to $0.01427.\n\nOndo (ONDO) fell 7.03% to $1.18.\n\nUpon looking at the hourly timeframe charts, it can be seen that BTC & ETH rebounded 0.33% and 0.30%, respectively. Meanwhile, despite the recent turbulent performance of the crypto sector, U.S. Sen Cynthia Lummis asserted that crypto assets remain poised to become an essential part of the nation’s economy should people not fail to capitalize on the emerging market.\n\nAlso Read: BlackRock Submits a Revised S-1 Form for its Spot Ethereum ETF\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQTV9tMmhBVEJoYTlRdXFfMHZqLUtuOUVOd1BoSUtrRU5KZjh3UldSd3pENm9IN3pvdzFaSWYwXzhWdE9qMGtyRlpYSEdOaWJITWw0c19UcHV2Mlg2REwyTUlidm9WZnFWNEh3VHhicmRMbW45bnFZZlB1QWltTnJqekxLQmNCNTdKR213Nmd0OEU3OS0xTFBvUA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 May 2024 07:00:00 GMT",
        "title": "WisdomTree lists physically backed Bitcoin and Ethereum ETPs on LSE - Funds Europe Magazine",
        "content": "WisdomTree has listed its WisdomTree Physical Bitcoin and WisdomTree Physical Ethereum ETPs on the London Stock Exchange ( LSE), making it one of the first issuers approved for listing crypto ETPs on the LSE.\n\nThese ETPs come with a management expense ratio of 0.35%, making them among the “one of the lowest fee levels for institutional-grade Bitcoin and Ethereum ETPs that are 100% backed by the underlying assets”. However, these ETPs are currently available exclusively to professional investors.\n\nBlackRock reports record fixed income inflows in 2023 global ETP market\n\nThe WisdomTree Physical Bitcoin ETP, launched in 2019, is designed to offer a straightforward, secure, and cost-effective way to gain exposure to bitcoin’s price. It ensures easy investor access, tradability, transparency, and institutional custody solutions within a robust structure. Similarly, the WisdomTree Physical Ethereum ETP provides secure and low-cost exposure to Ethereum, allowing investors to access ether and receive staking rewards through a transparent and risk-managed approach.\n\nWisdomTree launches megatrends ETF for thematic investing\n\nAlexis Marinof, head of Europe at WisdomTree, remarked: “As an FCA-regulated business, we have over 250 ETFs and ETPs listed on the LSE. Listing our Bitcoin and Ethereum ETPs is a natural evolution of our offerings and underscores our commitment to supporting UK investors. With rising interest in the asset class among European investors, particularly due to the new fee environment and the launch of US spot bitcoin ETFs, we foresee this development as a pivotal moment for Crypto ETPs in the UK.”\n\nMarinof highlighted that the asset manager’s expertise, combined with robust and scalable business managing over $100 billion in global assets, allows it to “offer highly competitive fees without compromising security or risk management.”\n\nWisdomTree’s European crypto ETPs are now available for sale in multiple countries, including Austria, Belgium, Denmark, Finland, France, Germany, Italy, Ireland, Luxembourg, Poland, Netherlands, Norway, Spain, Sweden, Switzerland and the UK."
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMi3AFBVV95cUxPWTNLTDVLbmF1eG1xb3dVSTZST3VIdUN5a2xZV29LM2c4THRfT3BLU3lzZ0lNb3RBc2luNmMwRllIVWUzVFdNcnVWZ2ZLejZmRW4yRlRLNVlWb3VlZjVoS0pVNUl3TmF6djZqUlpRWm5ab2N6U2kxOE9QN3Z5alJWM2d6RjNtZTllSnVnZk45ZU40aVZNeVF4aVlwX3d5S1J0QklrU0xSQy1rUm5CMDBoMklKU2NSY1pDSHk1LVo5bjB1NVJqSElUWHNuRUI2aWs5b0hHUnI5MUpyYXA20gHiAUFVX3lxTE5VNWtUUFB6UWZMQlFjLTN2czFDa2RZMm9vLTJvT2hMSjJuc0dOQnVFbVREcUZ1QUJyaFBwNDlaQk9kd2pWeHlJYkM5dGtsaUNrYXJBZmxqTXZVeUFwYng2WjRhZkIyU2lQcmp6NFVmNzl1RGhQclVyeFlpUTlVMnZkZVIyejRtM3JybkxSeERrRmdCVjd5Z29Odk9jWHVxTVdWVW45ejBqb0VySnZhRF9ZWDljWVBuVVRrV0dkOW1acmo5b0o2RlUyZ1RWX2RVSHcwWloxUzBYMUZObE1yVllGd0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Ethereum ETF approval boosts Bitcoin, says Michael Saylor; Raboo Presale soars - The Economic Times",
        "content": "The legitimisation of Bitcoin Exchange Traded Funds (ETFs) has had a positive effect on cryptocurrencies. So, it’s not surprising that an Ethereum ETF approval is towing the same line. It ushered in an influx of new investors, which boosted crypto token prices.Raboo ($RABT), a new kid on the block, is one of the biggest beneficiaries of this boost. Now, in presale, Raboo has raised an astonishing $1.5 million, which has been up 40% since its launch. Industry watchers expect $RABT to make a 100x gain before the end of the presale. That’s why investors are rushing it.Crypto enthusiasts always believed that ETFs would boost crypto adoption. They allow traditional investors to get exposure to the tokens without directly owning them.The SEC took almost a decade to okay the first Bitcoin ETF application. But once approved, it boosted crypto prices. Ethereum ETF applications didn’t take as long, and as expected, they’ve had a positive impact on the market.Crypto prices have soared significantly in response to this development. ETH itself appreciated by 12% and drew near $4,000, which is remarkable. The Ethereum ETF approval is expected to spur the market on, with ETH set to appreciate further.To Michael Saylor, Ethereum ETFs are good news for Bitcoin. According to him, they ‘serve as another line of defense for Bitcoin,’ and would make the blue-chip asset more stable price-wise.Michael Saylor also thinks the development would accelerate institutional adoption of Bitcoin. Going by history, this would further boost crypto prices. Bitcoin has been trading around $70,000 in the last seven days. . It’s a considerable increase when compared with its price action last year. The general feeling is that BTC will appreciate further and hit new all-time highs before the year runs out.Raboo is an enterprising new project primed to make substantial price gains, thanks to the Ethereum ETF approval. It infuses artificial intelligence with meme culture, birthing a dynamic space filled with engaged users. In essence, it provides a platform where crypto meme lovers connect, earn, and prosper.The ecosystem boasts NFTs, AI-generated memes, exclusive merchandise, and other mouth-watering rewards. Even more, the smart contract has been examined by leading crypto audit firm Solidproof. This guarantees security, eradicates worries, and puts investors' minds at ease.These unique offerings put Raboo ahead of the pack. Since it’s still in presale, there’s a decent chance it will appreciate significantly when it launches on exchanges. That’s why experts say it's poised to hit a 100x profit once the presale ends.As Michael Saylor fancies a BTC boom following recent Ethereum ETF approval, Raboo is primed for huge price gains. That’s because it offers several benefits for investors and has significant moon potential. It’s still in presale, and for $0.0042, you can partake in this movement and benefit from the impending 100x price gain.The above content is non-editorial, and TIL (Times Internet Limited) hereby disclaims any and all warranties, express or implied, relating to the same. TIL does not provide investment advisory services in any manner and the publication of this content does not mean TIL's or Economic Times endorsement. TIL strongly recommends the users to take all steps necessary to ascertain that any information and content provided is correct, updated and verified and/or speak with a qualified investment professional before making any investment decisions."
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQR01NSVVHS0V3eUttSTBUWUM0cHRha0hHLUVBclRZc2huMzc1Y2NaN1FYR3BmS3kzVGhUdVpiSDUtUTV2eW02by1vSUJjQWg2ODZHNVYxRlBpdFJNMHVMU0picU92XzdfazRaUHdGVjdieV9Ndlp2ZWRCUk9QRjJmeUJsZHQzSEhqUWVwel93VTdoc0Q4Vkp30gGcAUFVX3lxTE5MOVlyODJFZ09sbnpQanVJQmM4XzlvX2VsdlhKbHRjSW0xNjFXaUR4aDNQU3VUZGdzeU8xQzhRaUxkZnRtd0x4bHZSMENJVXBKa29wQ2dlM0g5dndqYnhqc2wya3VRdEVuZ3BsbGdVdGdoQW5USHZHeEotMUZpVUFnNmZwTkR3ZmNSRWhXQVRVM0VGV2R0TU1kTmk1WA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Shibarium TVL Soars 17% Amid Expedited BONE Token Transfers To Ethereum - CoinGape",
        "content": "Bone ShibaSwap token trading volume is up 15% after recent Shibarium bridge enhancements that have reduced BONE transfer time significantly.\n\nBONE Transfers To Happen In 45 Minutes On Shibarium Bridge\n\nThe Bone ShibaSwap token holders will be able to move their BONE holdings in a record 45 minutes. It marks a significant upscale, reflecting Shibarium’s resolve to embrace technological advancement. It also reflects a broader commitment to delivering streamlined operations and more efficiency.\n\nadvertisement\n\nAccording to the Shiba Inu development team on TheShibDaily post, users had to endure a seven-day wait before their BONE tokens could move from Shibarium to Ethereum. During the week-long wait, the BONE tokens would be subjected to a lock-in period meant to elongate the length of time users would interact with the Layer 2 (L2) solution, Shibarium.\n\nThis interactive period was seen as a possible driver for the Bone ShibaSwap price. The improvement is also bullish for the Bone ShibaSwap price, marking a strategic transition from an era leveraging interaction time to influence price. Instead, the network is prioritizing user experience, network efficiency, and ecosystem stability as possible market value drivers for BONE.\n\nShibarium and the Shiba ecosystem technology and marketing specialist, Lucie Sasnikova revealed the improvement in a post on X (formerly Twitter).\n\nShibarium Bridge Enhancements Decrease BONE Transfer Time from 7 Days to 45 Minutes – The Shib Daily https://t.co/2yH964q8uI — 𝐋𝐔𝐂𝐈𝐄 | SHIB.IO (@LucieSHIB) May 29, 2024\n\nHenceforth, ecosystem participants would enjoy more seamless processes for the convenience of community members and network inhabitants.\n\nThe dominance of the Shibarium L2 is also primed to benefit from this upscale among Decentralized Finance (DeFi) protocols.\n\nData according to DefiLlama shows that the Total Value Locked (TVL) of Shibarium has soared by 17% in five days, from $2.11 million on May 24 to $2.47 million at press time.\n\nBONE Token Transfers Under New System Of Operation\n\nThe development team highlights that based on the new system, there will be a checkpoint for all BONE token exits from the Shibarium ecosystem. Under the new system:\n\nBONE holders will be able to manage their assets faster\n\nProject builders can develop complex and urgent applications on the L2 chain.\n\nNotably, this enhancement will only apply for current transfers, meaning those that had been initiated before the upgrade would be subject to the seven-day wait.\n\nBONE price is up almost 2% in the past 24 hours to trade for $0.6865 as of 21:05 GMT, on trading volume that surged 15%.\n\nAlso Read: Terra Luna Classic Takes Down LUNC Burn Once And For All\n\nLockridge Okoth Lockridge transitioned from a career in Molecular and Cell Biology to pursue his interest in the chaos of the crypto and financial markets. He is a cryptocurrency journalist and market analyst with over 3,000 articles to his name. Conducting on-chain analysis, breaking down market-triggering events, and publishing Op-Ed pieces, he finds gratification in diving deep into the crypto space, earning himself significant knowledge and experience. Aside from ATZCrypto, Blockster and InsideBitcoins, Lockridge’s works can also be found on FXStreet.com. Outside work, you can find Lockridge watching movies or horse riding.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxQNzdpVGdOUDNQd2FRUVVhSXdPaFRpT3UxQ2ZaS2tPWFFtZHU1cVpzMnh4OTVGVDdGWGM3aHNUQlZKOXFBeTFIc080ZXltTG5QQS1iSUdHMUxrMktpMDZ2VzcxQ1JNZUFVWlVqX0NrMWFYUS1aZVptV05wZG52dVRtc1RRSHJneEd2a3M2WnBYYVF1ckpVUzgwN0Vn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Ethereum Price Prediction Post-SEC ETF Approval – Will 5thscape Step Up? - Coinfomania",
        "content": "Sandbox (SAND) has grabbed much attention by charging the existing financial sector’s development through its growth in the crypto gaming category. Analysts are predicting an economic upturn in July 2024 due to the anticipated adoption of the 5thScape project. These markets are also expected to bring the use of Sandbox to a new level in virtual environments, which will excite investors. They should also learn more about the charts before investing and follow every trade cautiously. Now, with 5thScape out front, Sandbox is set to transform the future of the play-to-earn category in crypto games.\n\n5thScape’s Ethereum-based virtual reality (VR) ecosystem is bringing a change into the world of blockchain gaming. Its immersive content and native broad-utility cryptocurrency token “5SCAPE” has crypto investors and entertainment-seekers excited about the future possibilities of the platform. As 5thScape is about to reach its $7 million presale raise in its 6th of 12 presale stage, it is receiving substantial global attention. 5thScape’s brand value is set to outshine the Sandbox platform.\n\nA Look Into 5thScape’s VR Ecosystem\n\nThe 5thScape platform has different types of VR-compatible content including VR games, VR movies, learning videos, VR animations, and more. It lets platform users explore their choice of entertainment options in a new and immersive way. The ERC-20 token “5SCAPE” gives 5thScape’s users unlimited access to its content hub.\n\n>>Click Here To Visit 5thScape Presale Page\n\n5thScape’s team is working on turning it into a “mixed reality” platform by adding augmented reality features.\n\nFurthermore, they plan to enter new categories in their VR content options as well, like medical training, enterprise training, and a marketplace for VR content developers where they can offer their creations. The developers will be able to earn the platform’s “5SCAPE” tokens for their content, which can be exchanged for real money. 5thScape’s team has divided the project’s launch into 4 phases. Each quarter of 2024 has something new for the platform users and investors of “5SCAPE tokens”.\n\nSince we are now in the 3rd quarter of the year, we can expect the project to surprise us with many new announcements. 5thScape recently made an announcement on their X handle (@5th_scape) about a new feature – a leaderboard for investors of the 5SCAPE token. Its spin-the-wheel feature to get an extra discount on the token’s purchase is a piece of thrilling news for new investors.\n\nVR Blockchain-Gaming: A Revolution by 5thScape\n\nThe platform’s latest gaming launch – the “Cage of Conquest” MMA fighter VR game has helped it get attention in the online gaming community. Its other gaming titles, “Thrust Hunter,” “Epic Cricket Arena,” “Archery Master,” and “Immersive Kickoff”, are currently in the pipeline and will be slowly rolled out. Gamers can use the “5SCAPE” token as a digital currency within the VR games available on the platform to get in-game content and exclusive upgrades. These upgrades and contents can make their gaming experience better.\n\nThis is one of the reasons why regular gamers who are not active cryptocurrency investors have chosen to become one so that they can enjoy the VR gaming experience of 5thScape. Investing $500 or more in 5thScape’s presale stage can give you lifetime free access to its gaming zone. There are more bonus rewards on investments made in multiples of $500.\n\nFuture of 5SCAPE & VR Technology’s Growth Momentum\n\nExpert crypto investors consider 5thScape’s presale as the perfect opportunity to make an investment in the future of immersive entertainment. VR technology’s user adoption is growing fast. While currently, only 1 in 5 Americans have access to VR accessories, the ratio will soon increase as VR headsets become easier to purchase. The 5thScape project itself has launched two important physical VR accessories: the “Ultra HD VR headset” featuring high-resolution visuals and perfect movement tracking and the “SwiftScape VR Gaming Chair” for maximum comfort.\n\nA reputed organization – Grand View Research predicted the CAGR of VR technology to jump to 27.5% in 2030 from 2023. There is no doubt that 5thScape will use its first-mover advantage and its large VR library to grab a large share of this modern technology’s new user base.\n\nBoth Sandbox (SAND) and 5thScape (5SCAPE) projects will give high returns to their current investors in the coming times as VR technology’s usage becomes more common. Those looking for a way to build wealth through the growth of the VR industry should add these two projects to their cryptocurrency watchlist.\n\n5thScape will be a more prominent leader in this space as the Sandbox platform’s virtual universe has become a bit boring for gamers. The VR ecosystem of 5thScape is going to attract a larger audience base due to its variety of content options and secure Ethereum-based blockchain network that promises privacy and transparency with transactions. Get ready for lucrative returns with 5SCAPE once the project gets listed on the famous crypto exchange. The crypto gaming sphere will not be the same once the 5thScape project’s gaming titles are popularized within online gaming communities."
    }
]