[
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxQVXoweUFVRHIzZW5kRzlSY2hJSzZlbWFDbHRuNUFKQ2dSUGI4bExWcGtRcFhyTzVYVUJPcG53dVVtMkxiLVFfM3ZpODkyV1F0NDNiSV8tVTU1Z2JHZjg5VnVuYzJZMWNLV3RNc25BdEVMNDdDeEtYT0RDeG1OM0lSckluOTMta1lQWTZKYzVFM2lQWHJpZHlyWW5FakhTQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 10 Mar 2024 08:00:00 GMT",
        "title": "Vitalik Buterin Proposes a Quantum-Resistant Hard Fork for Ethereum - Blockchain.News",
        "content": "Vitalik Buterin Proposes a Quantum-Resistant Hard Fork for Ethereum Jessie A Ellis Vitalik Buterin proposes a hard fork strategy for Ethereum to protect funds against quantum computer attacks, sparking a community-wide discussion on quantum security.\n\nEthereum co-founder Vitalik Buterin has proposed a hard fork strategy. This preemptive measure is designed to protect user funds in the event that quantum computers become capable of breaking current cryptographic defenses.\n\nThe proposal, outlined in a discussion on the Ethereum Research forum, highlights the urgency of preparing for quantum computers' ability to solve problems like the discrete logarithm, which underpins the security of many current cryptographic algorithms including those used by Ethereum.\n\nThe proposed hard fork would entail the following steps:\n\nReversion of all blocks following the detection of large-scale quantum attacks. Disabling traditional externally owned account (EOA) transactions to prevent further vulnerability. Introduction of a new transaction type for smart contract wallets, in line with the anticipated RIP-7560 standard. Implementation of a new transaction type or opcode allowing users to submit STARK proofs, demonstrating the knowledge of a private preimage and a public address derived through approved hash functions. The user's account code would then be replaced with a new, quantum-resistant validation code.\n\nThe conversation in the Ethereum community is informed by a range of expert inputs. One participant shared a visual aid to help understand the proof statement, while others discussed existing quantum-secure fallbacks for wallets and the integration of preimages into ECDSA signature nonces to create fail-stop signature schemes.\n\nSome community members have cautioned that if quantum computers capable of cracking Ethereum wallets are already in malicious hands, it might be too late to differentiate between legitimate owners and attackers. They suggest that instead of relying on stateful post-quantum algorithms, Ethereum should use NIST standardized ones in hybrid mode with a classical algorithm, like combining Dilithium with ed25519. This would, however, increase block sizes due to the large signature and public key sizes of current post-quantum schemes.\n\nOthers have proposed the development of machine learning systems to monitor and detect abnormal transactions as an early warning system to trigger a fail-safe fork.\n\nThe community's response underlines the importance of staying ahead in the security arms race against quantum computing. Innovations such as Lamport signatures and ERC 4337-based quantum-resistant smart contract wallets are already in development, as is the integration of quantum-safe cryptographic measures in other digital signature applications.\n\nThis initiative by the Ethereum community reflects the broader blockchain ecosystem's commitment to resilience and adaptability in the face of emerging technological threats. As quantum computing advances, the blockchain sector's proactive stance on security promises to be a critical factor in its long-term viability and trustworthiness.\n\nThe Ethereum team and community's proactive approach to quantum security demonstrates a clear recognition of the challenges ahead and a willingness to address them head-on. This ongoing conversation will likely shape the future of Ethereum's infrastructure and set a precedent for other blockchain platforms."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxQUHlRa2pMOWItWHNqODh3aTdSMWlGazdRem0wNzUwOTZJN2pOM0JicXpCcFlrOWwyLV9mWnFBS1VwNTJ3TV9Fc3pmQ3F6SEJFSmZ5TUlvVHE5eW9jckFxdl9KcksxQ0E2SGlGUkoxNVUxaTRIbFNadWpzYTBUUWRtMC1MXzNhUVlXbU5HMHA4ZXQtaUN40gGaAUFVX3lxTE1DSVR1cFdacFA1a0FBQmlNZHc5UG5fVlhqRDZpcUpqWlcxakpCUjFlcHRWMDVZZWQ5cGtpU3RNalJONXBJa1llaElUb1lKMFlNQkdKQnJPdktzNVgxWEdyQ2Jna0xZbVJ2UWpWNi1mQ3FlMW82UW8xNndDT3BHVmdzZEppZ1A4UWRpMVljUXdiMXNDSVlBRjI3REE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 09 Mar 2024 08:00:00 GMT",
        "title": "Ethereum’s Dencun Upgrade Set to Drive Near-Zero Transaction Fees - CryptoPotato",
        "content": "The forthcoming Ethereum Dencun upgrade scheduled for March 13 offers a chance for near-zero transaction fees for layer 2 (L2) solution users, possibly drawing in more new ones, as per a research report by Fidelity Digital Assets.\n\nThe forthcoming upgrade marks the initial step in Ethereum’s rollup-focused roadmap. This advancement will empower the network to function as a resilient database, enhancing the efficiency and cost-effectiveness of data storage for layer 2 blockchains.\n\nDencun Upgrade to Reduce Costs for L2 Blockchains\n\nAnalyst Max Wadington wrote that the Dencun upgrade would provide the necessary scaling capability to accommodate millions of users on layer 2 blockchains, positioning Ethereum as a more suitable distributed database for other blockchains. These enhancements are anticipated to attract significantly more users to the Ethereum ecosystem and broaden the network’s total addressable market (TAM).\n\nMoreover, the upgrade is poised to reduce costs for layer 2 blockchains to store data on the main network. This cost reduction is expected to be transferred to users through lower fees.\n\nLayer 2 solutions are separate blockchains constructed on top of layer 1, or the base layer, to alleviate scalability issues and efficiently manage data. However, the upgrade is not expected to benefit Ethereum users significantly, as the fee reductions promised to layer 2 users will not extend to those transacting on the base Ethereum blockchain.\n\nWadington explained that in the short term, users seeking to capitalize on this fee adjustment would need to compromise some decentralization and security by conducting transactions on layer 2 solutions instead of directly on the Ethereum network. Hence, it will likely encourage more users to bridge assets to other platforms.\n\nThe report added that conducting transactions on Ethereum for application-specific purposes would remain the preferred choice in the medium term, especially as layer 2 platforms mature.\n\nEthereum Price Surges\n\nEthereum surpassed the $3,000 mark and surged to over $3,900 earlier this week, reaching its highest value in almost two years.\n\nInvestor sentiment reflects optimism regarding the forthcoming Dencun upgrade and the potential approval by the U.S. Securities and Exchange Commission (SEC) of Ethereum exchange-traded funds(ETFs). Additionally, on-chain data reveals that nearly $200 million worth of ETH was burned in the past week, reducing the altcoin’s circulating supply and potentially fueling further price appreciation.\n\nAccording to CoinGecko data, Ethereum is trading at $3,789, up 8% in the last week. Notably, the second crypto by market cap has surged over 60% over the last month."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxPWHdSaG5nb1BET3RXVElISDFGUzhma0trSnRCM3FpXzVlbk1EWnM3alhLMFNzSVVvMlRKc3N0QV9JbjNSTWpLbXRKS0lHbGFaMFJseE8tZ1IzSkhaazFVOWtobXBSbU94T1FsajdXR0JpU2hpM2pYRXJsRnJKVjJmYlY5RG8tR2FYY3YzeUZOZkRIR2U0S21uN3RwQURJTTZVXzd2cEpVS1ZWOVl3dDNSWDBucThwWFZrT1QtQWdZWE4waThScEJCTmk2MWNNeFFxNnBUcNIB2gFBVV95cUxOV0xHcC1DWWctdjFIdjYxOFJ2dEpBYVhGTlIwckcwNFRKd0hEb2lIWVVxY09jcDk5R3ZPWTgxS2VXamRYZnd2Nll6TjNXS2RhNTlnazA0X3puMVBFaWJ1S3ltT19fYmJzV3VQWk5iZFdKc2dONmxaQ2ZvY2RGbjQtNVFjSEdIR2F3b0I1d1JWdnU4OEhvZ05hSF9OYzlBbVJpTTZKbU9JM0MzWXN3NW5rcFNvdlhWczRoMXh6MjZJME9JcTdDOW56bFZ1TVM1X0hOVjNZb25GMDdWUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 10 Mar 2024 08:00:00 GMT",
        "title": "In bitcoin's shadow, another cryptocurrency, Ether, stages its own rally - The Economic Times",
        "content": "New York, Mar 10, 2024 -Bitcoin has captured the limelight in recent weeks as it surged to a new record high, yet another major cryptocurrency , Ether, has been enjoying its own meteoric rise.Launched in 2015, Ether, also known as Ethereum , is by far the second-largest digital currency in terms of total value, now estimated at over $460 billion.Along with other cryptocurrencies including Solana and Dogecoin, it benefited from the regulatory approval in the United States of a new bitcoin investment product, the exchange traded fund -- or ETF -- in mid-January, said James Butterfill of the investment company CoinShares.These ETFs allow investors to profit from any change to the price of cryptocurrencies without having to buy them directly, while also letting them sell at any time.The launch of crypto ETFs has led to an influx of new money, sending bitcoin to a fresh record on Friday of $70,085.Bitcoin's rise has been well-documented, but Ether's has been even more impressive, surging almost 72 percent year to date in comparison to bitcoin's 61 percent rise.This strong performance is largely due to \"expectations that an Ethereum ETF could be approved in the United States,\" according to Dessislava Aubert of research firm Kaiko.Several asset management companies have applied for authorization from the US financial markets regulator, the Securities and Exchange Commission (SEC), to market these Ether investment products.The SEC must rule on the first such applications, from VanEck and Ark 21Shares, by May 23 at the latest.\"Ethereum has started to wake up as investors are anticipating a potential approval,\" Michael van de Poppe of MN Trading told AFP, adding that \"people are rotating from Bitcoin to Ethereum as a potential investment opportunity.\"Beyond the ETF effect, the digital currency dreamed up by Russian programmer Vitaly Buterin has several other cards up its sleeve.For Simon Peters of cryptocurrency exchange eToro, Ethereum is also buoyed by the prospect of \"Dencun,\" a major upgrade to the technology underlying this digital currency, scheduled for March 13.This major change will improve transaction processing capacity and cut transaction costs, but also has the potential to unleash the growth of an ecosystem with multiple applications.\"Bitcoin's primary use is as store of value, while Ethereum has much more potential use cases,\" Peters told AFP.For example, it is the destination of choice for non-fungible tokens -- or NFTs -- the certificates of digital authenticity that caused such a stir three years ago.The two cryptocurrencies are not in direct competition, according to van de Poppe from MN Trading, because Bitcoin is \"hard money,\" while Ether \"is basically an investment for the entire blockchain and smart contract ecosystem.\"Ethereum has already successfully negotiated two major technical transformations in recent years, including the switch to a less energy-intensive system in September 2022.James Butterfill said there is \"increasing optimism\" that a \"Dencun\" upgrade will \"go without a hitch,\" which would reinforce the currency's credibility.He added that Ether, by the very nature of its operation, offers the \"added benefit\" of interest generated by its holders.The mechanism for creating this currency involves owners putting up existing Ether coins as collateral in a process known as \"Proof of Stake,\" which differs from bitcoin's energy-intensive method involving highly complex calculations, known as \"Proof of Work.\"Ether investors who agree to put up some or all of their holdings receive a fee of a few percent a year, in addition to any potential capital gain if the currency appreciates in value.The \"Proof of Stake\" process adopted in September 2022 has significantly increased the amount of Ether used as collateral, notes Simon Peters, currently at 21 percent compared with just 10 percent 18 months ago.\"There is less Ethereum in circulation,\" he said, adding: \"If demand increases, given the squeeze in supply, then price should follow.\"\"I think that Ethereum is going to be outperforming Bitcoin,\" said Michael van de Poppe, adding the total market capitalization of Ethereum could end up exceeding that of bitcoin."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxQQWpOOTZhREZVQ0tiQU93Nm5peld6UzFSTG5kcTB5cEROb1hqd21IQWd2TGdnRmIzNVI2QzRpX0JuNXRQNExKVXNmOVczakpRSGw4UmRkT2dzU1YtM0FJMlFIU0FKWHVNUjd1QjdnT0dUQzYzWDR5U3Bxd185c1V2b05BX2FVUmxKM3dUbVdITlVVcGh4TlU2U3VzVUViOEdCVmlUNGQtT1dHdXhmVDhnU3ZNSnA4QVN0dW13alhUNDdfZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 10 Mar 2024 08:00:00 GMT",
        "title": "Ethereum Price Starts Consolidation – Why Pullbacks Could Be Limited - TradingView",
        "content": "Ethereum price is still struggling to clear the $4,000 resistance zone. ETH might consolidate for some time above $3,600 before the bulls gain strength.\n\nEthereum traded to a new multi-month high above $3,980.\n\nThe price is trading near $3,850 and the 100-hourly Simple Moving Average.\n\nThere is a short-term breakout pattern forming with resistance at $3,950 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could resume its increase if it clears the $3,950 resistance zone.\n\nEthereum Price Revisits $4K\n\nEthereum price extended its rally above the $3,900 level, like Bitcoin. ETH cleared the $3,950 level and traded close to the $4,000 resistance zone. It traded to a new multi-month high above $3,990 and recently started a consolidation phase.\n\nThere was a pullback below the $3,920 level. The price tested the 23.6% Fib retracement level of the recent wave from the $3,211 swing low to the $3,9983 high. Ethereum price is now consolidating near $3,850 and the 100-hourly Simple Moving Average.\n\nThere is also a short-term breakout pattern forming with resistance at $3,950 on the hourly chart of ETH/USD. If the pair stays above the $3,800 level, it could attempt another increase. Immediate resistance on the upside is near the $3,900 level.\n\nNewsBTC\n\nSource: ETHUSD on TradingView.com\n\nThe first major resistance is near the $3,940 level. The next major resistance is near $4,000, above which the price might gain bullish momentum. In the stated case, Ether could rally toward the $4,120 level. If there is a move above the $4,120 resistance, Ethereum could even rise toward the $4,220 resistance. Any more gains might call for a test of $4,350.\n\nAre Dips Limited In ETH?\n\nIf Ethereum fails to clear the $3,950 resistance, it could start another downside correction. Initial support on the downside is near the $3,800 level.\n\nThe first major support is near the $3,600 zone or the 50% Fib retracement level of the recent wave from the $3,211 swing low to the $3,9983 high. The next key support could be the $3,400 zone. A clear move below the $3,400 support might send the price toward $3,250. Any more losses might send the price toward the $3,120 level.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone.\n\nHourly RSI – The RSI for ETH/USD is now below the 50 level.\n\nMajor Support Level – $3,800\n\nMajor Resistance Level – $3,950"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMizgFBVV95cUxOU2I2Q0tQQkhVX3NwT20wZ0t5ZC1Bb3FJMVVqakFXYUFydko4dWpxWjdzNGZLVUdUVHVScTgxbXhJRVlzeWp6ejJTUl9CWExPQ093WHpMd1k3VmZaaWVrUVVRbTBoT2R5T0s2U2VLLWp0Mno3WWV4TDc5X01Beng5OTlQLTl6NGI3cF9mLTNwZmdleVZVYVNIYzYwcEQwQTE1ZVEyNHpjMzg4TnpLZjBtYVlIcFk0UGtoSFpyWnFNMTRqRFJCQXhWSzdDVWJQQdIB0wFBVV95cUxPdTFmaEJtSERSRUp1REh3dTQzQUViZE05VV93UjdabW1ZVzZNMFFXQ1NWT0F2U1ptY3o1eFBvdjA3U1JXRzhtY2lSLTF5TmpEd01GWDJodHdRemlGRDloMEN6d29YMTVEZjdGV2t3R01BVDFXY19nbktjSTc0NUd3UDRrc2RxOU9vX1VjVUozOGNnM2V2Sm9DOEgxSndtNTFNM1ZFdDE1bkxqOG5hdEd2a21CUlVvQ0gzUUktS3AwQ0hLZDhXV1lKZ1ZfbDRSeGhKYy1V?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 09 Mar 2024 08:00:00 GMT",
        "title": "Ethereum Hits $3,900 As Experts Believe NuggetRush Could Be A Potential Leader In Coming Altcoin Run - Crypto News Flash",
        "content": "Ethereum (ETH) is nearing the $4,000 milestone following Bitcoin’s recent surge. Altcoins like Dogecoin and Shiba Inu have also experienced significant gains, contributing to a bullish market sentiment.\n\nNuggetRush (NUGX) is an emerging token positioned in GameFi, DeFi, impact gaming, and play-to-earn (P2E). Still, in the ICO phase, it introduces a P2E game with governance tokenomics and deflationary features.\n\nIn the dynamic cryptocurrency landscape, Ethereum (ETH) is surging towards the significant psychological milestone of $4,000.00, propelled by the recent ascent of Bitcoin (BTC). On the other hand, NuggetRush (NUGX) emerges as an advanced token strategically positioned at the center of GameFi, DeFi, impact gaming, and play-to-earn (P2E). Here are reasons why Ethereum investors believe NuggetRush could lead the upcoming altcoin run.\n\nEthereum (ETH) Surges Toward $4,000 Amidst Bullish Crypto Landscape\n\nEthereum (ETH) is constantly heading towards the psychological $4,000.00 milestone after Bitcoin’s (BTC) rise to $68,537.15 on March 4, 2024. Multiple altcoins, including Elon memecoins like Dogecoin (DOGE) and Shiba Inu (SHIB), have seen remarkable triple-digit gains, strengthening the current bullish sentiment in the market.\n\nCoinMarketCap data reflects a massive surge in Ethereum’s (ETH) liquidity and trading volume, hitting $33 billion, while its market cap has surged past $450 billion. These figures highlight the massive fundamental factors helping propel the current Ethereum (ETH) rally, especially the imminent Dencun upgrade set for March 13.\n\nThe upcoming Ethereum (ETH) Dencun upgrade, preceded by three successful test introductions, promises many boosts for Ethereum’s (ETH) ecosystem. Prominent aspects include decreased transaction fees on layer-2 protocols and easing network congestion, accomplished by raising the block size to 25 MB, up from the existing 12.5 MB.\n\nThe implementation of proto-danksharding will enable Ethereum (ETH) to resolve scalability issues efficiently.\n\nThe Dencun upgrade, combined with optimistic market sentiment fueled by Bitcoin’s surge to its all-time high and the potential for a spot exchange-traded fund (ETF), has strengthened Ethereum’s (ETH) upward momentum.\n\nOn March 7, 2024, Ethereum (ETH) was valued at $3,936.27, up 14.71% in the past week. Analysts say ETH will rise to $4,050.00 by the End of March, supported by increased bullish momentum in the crypto space.\n\nNuggetRush (NUGX): Unveiling an Advanced GameFi Token with Deflationary Features\n\nNuggetRush (NUGX) is an advanced token perfectly positioned at the center of GameFi, DeFi, impact gaming, and play-to-earn (P2E). Since it is still in the early stages of development, it is still available as a blockchain ICO.\n\nIn that context, NuggetRush (NUGX) will introduce a play-to-earn (P2E) game while blending tokenomics, consisting of a governance token. Interestingly, the token has a deflationary mechanism and characteristics. The rapid growth of an active community and massive interest in NuggetRush (NUGX) in its presale is subject to different factors and elements.\n\nThe main factors include community-driven progress, advanced technology, and a vision that supports decentralized finance (DeFi) non-fungible token (NFT) and gaming enthusiasts to engage with and derive considerable value from NuggetRush’s (NUGX) “ecosystem of rewards.”\n\nAlthough it is a relatively new project, NuggetRush dominates the crypto space. Its mission goes beyond its presale phase, and the team plans to help push NUGX toward a crypto market cap of $100 million. The significant target and many use cases confirm a growing momentum that may help NuggetRush (NUGX) become the best GameFi crypto.\n\nAdditionally, no taxes were charged on transactions executed in the presale space. On that note, NuggetRush has become attractive for most investors. The project has sold over 211 million NUGX tokens and raised over $2.7 million.\n\nCurrently, NUGX is valued at $0.019 in the Launchpad round of its presale. At the end of this round, NuggetRush will rise to $0.020, its mainstream listing price. The many utilities and growth potential make NUGX the best crypto investment today.\n\nVisit NuggetRush Presale Website\n\n[thrive_leads id=\"228374\"]"
    }
]