[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxOM2F4VjlyRUh2M2xRcUFkUTRVWXRZN1N2a21TRklGbnBEWThrOWRzZldqYzdVSU5nZHNKeDlYZXl2SE0wdjdOc0NPelhuRjVVSmFzQzB4aFFiRjNPYmZxenpzb2RZUEpqRUY0UnpmalNaNTgzTWx4TFZ0a1loOXpYemZiV3hDQTRMLUJOcXNFZVJyc3RYcXpzbUg5a19falE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Feb 2024 08:00:00 GMT",
        "title": "SEC may be forced to declare Ethereum a security after controversial new launch - Fortune",
        "content": "Prometheum plans to announce on Wednesday the launch of custodial services for Ether, the native cryptocurrency of the Ethereum blockchain, whose $280 billion market cap is second only to Bitcoin’s. The move may be part of a larger strategy by the crypto firm to get regulators to identify Ether as a security—a position widely unpopular among industry peers.\n\nSo far, the Securities and Exchange Commission has avoided taking a position on Ethereum’s legal status even while declaring more than a dozen other popular cryptocurrencies to be securities. The latest gambit by New York–based Prometheum, which claims it has discovered a compliant path for crypto within existing laws, could force the agency’s hand.\n\nLegal experts have told Fortune that Prometheum’s plan to launch its custodial service may compel the SEC to resolve the long-running Ethereum question. If the agency does indeed proclaim Ether to be a security, Prometheum could be in a pole position when it launches its planned trading platform next quarter—even as the rest of the industry insists crypto can’t be viable without new laws.\n\nA controversial new player\n\nLongtime crypto exchanges like Coinbase and Kraken offer trading platforms in the U.S., allowing users to buy and sell popular cryptocurrencies like Bitcoin and Ether. While many of the firms have been around for more than a decade, they still operate outside the regulatory framework of the existing financial system, which has led lawmakers to propose new rules for the industry.\n\nSEC Chair Gary Gensler, who has stepped up enforcement after the disastrous collapse of FTX, has said existing rules are sufficient and filed lawsuits against exchanges for failing to register with the agency. In response, companies like Coinbase have argued that the existing rules are outdated.\n\nWhile much of the U.S. crypto industry has sided with Coinbase, Prometheum has taken a different—and contentious—approach.\n\nFounded by two brothers, Aaron and Benjamin Kaplan, Prometheum received regulatory approval in 2021 to operate an alternative trading platform—similar to a stock exchange—where users can buy and sell different securities. The company went on to gain widespread attention in mid-2023 when it announced a first-of-its-kind approval from the Financial Industry Regulatory Authority (FINRA)—an industry oversight body that’s independent of the SEC—to operate as a special purpose broker-dealer for digital asset securities. The SEC first created the designation in 2021, but no other firm has succeeded in obtaining a license, though others, including Robinhood, have tried.\n\nPrometheum’s claim to have found a compliant path for crypto trading immediately drew condemnation from legal figures in the crypto industry, who argued that even if the SEC and FINRA approved Prometheum’s structure, it would not have any assets available for trading. That is because, skeptics argue, the SEC has jurisdiction over securities, while cryptocurrencies like Solana and Ether are more like oil or gold—assets that don’t fit the legal definition of a security and so can’t be registered.\n\nThe Kaplan brothers, in contrast, agree with the SEC’s assessment that most cryptocurrencies are securities. They argue that Prometheum will be able to list different crypto assets as securities under an exemption called Rule 144, which is used to trade restricted stocks, and that they can use blockchain data to determine whether the assets have been in circulation for more than a year—a key factor for the exemption. As an alternative trading system (or ATS), Prometheum will not have to work directly with the issuers but instead can choose which assets to list.\n\nPrometheum’s claims have not only riled the crypto industry but Republican lawmakers, who have argued that Gensler had propped up the little-known firm to further his own regulatory agenda. In a June appearance on CNBC, for instance, Gensler touted Prometheum’s registration as a special purpose broker-dealer as an example of a compliant path for the industry. And last June, the company received a prized invitation to testify at a congressional hearing about crypto despite having virtually no presence in the industry.\n\nThe debate over Prometheum’s proposal has until now been theoretical, but Wednesday’s announcement of Ether custodial services, which are slated to launch by late March for institutional clients, means the company is on the cusp of becoming the first crypto exchange to compliantly offer assets like Ether for trading.\n\n“We want to work with the crypto industry,” Benjamin Kaplan said in an interview with Fortune. “Our goal is not to destroy, it’s not to harm, it’s not to undermine—it’s to help build.”\n\n‘Move the ball forward’\n\nIn the traditional world of stock markets, the various steps that make up a trade are divided among different firms. For instance, a retail trader visits a broker like Fidelity to buy a share of Apple stock, leading Fidelity to turn to a broker-dealer like Citadel Securities to fill the order. Next, a firm called the National Securities Clearing Corporation, a subsidiary of the Depository Trust and Clearing Corporation, figures out who owes what in all the trades the broker has made that day—a process known as clearing.\n\nAt this point, another DTCC subsidiary called the Depository Trust Company steps in to oversee the funds and securities moving from one party to another—a process called settlement. Finally, an institution—either the original broker or a firm like State Street or BNY Mellon—serves as the custodian, meaning it holds the actual securities on behalf of the investors.\n\nOne of the reasons for separating these various functions is to prevent conflicts of interest. If Citadel, for example, was serving as both an exchange and a broker-dealer, it could digest customer trade information and front-run orders. Separating brokers into distinct entities also prevents markets from having a single point of failure, as happened with FTX.\n\nJames Angel, an associate professor at Georgetown focused on financial regulation, told Fortune that much of the separation is also historical—a convention that the crypto industry is seeking to disrupt with the help of blockchain technology.\n\nFirms like Coinbase offer clearing, settling, custody, and trading services under one roof, an arrangement that provided partial fodder for the SEC’s lawsuit against the exchange. The agency’s primary complaint, though, was that Coinbase and others had not registered with the SEC to offer any of these services—even as it sold what the agency deemed to be securities.\n\nPrometheum, meanwhile, believes it has found a way to sell crypto without triggering any of these objections from the SEC, in part by dividing itself into two entities.\n\nOne, the alternative trading system, is a member of FINRA and registered with the SEC, and will provide a front-end platform for investors to buy and sell crypto assets. The other entity, Prometheum Capital, is the company that received the special purpose broker-dealer license and a final go-ahead from FINRA in January to offer the clearing, settling, and custody services necessary to complete the trades.\n\nThe upshot is that, while firms like Coinbase have been battling with the SEC, Prometheum has been getting approvals from FINRA, which is nominally independent of the agency but also works closely with the SEC and is ultimately subject to its oversight. It is also notable that, while other firms have applied to receive the special purpose broker-dealer license—the one created by the SEC in 2021 and issued by FINRA—Prometheum is the only one to receive it.\n\nNow, Prometheum’s custodial services for Ether announcement suggests the company is on track to offer the popular cryptocurrency for trading to institutional investors later this spring. More consequentially, by offering custodial services for Ether, Prometheum is claiming that Ether is a security—a critical question that the SEC has yet to decide on—and doing so as a FINRA- and SEC-regulated business.\n\n“You have to be able to custody before you trade,” Aaron Kaplan told Fortune. “This is hopefully going to move the ball forward.”\n\n‘It’s a gamble’\n\nFortune spoke with four lawyers and academics with expertise in digital asset regulation who agreed that Prometheum’s custody launch could lead the SEC to finally rule on Ethereum’s legal status, especially because Prometheum prominently displays its registered status with the two organizations on its website—a decision that Boston University lecturer Mark Williams described as “marketing.”\n\n“It’s a gamble,” Williams told Fortune. “Maybe it’s part of their business strategy to force the hand of the SEC.”\n\nWilliam Brannan, vice chair of the crypto practice at Lowenstein Sandler, said that Prometheum would be creating “unnecessary controversy” by announcing Ether as the first asset it would custody, given the SEC’s reluctance to take a stance on it.\n\nEven though Prometheum’s primary regulator is FINRA, which operates separately from the SEC, Brannan said FINRA likely would be working with the SEC on the question of Prometheum’s launch of Ether custodial services, owing to the decision’s magnitude.\n\n“My hunch would be that, particularly for these types of issues, FINRA is in very close contact and consultation with the SEC, and would likely be liaising with them and seeking to get some clarification on their position,” Brannan told Fortune.\n\nAccording to a company spokesperson, since Prometheum received the special purpose broker-dealer license from FINRA, it doesn’t require further approval to make assets available for custody, but it has informed FINRA of its plans to offer services for ETH.\n\nSpokespersons from FINRA and the SEC both declined to comment when reached by Fortune.\n\nIf the SEC took action to stop the offering, it would likely come after Prometheum launched its custodial services for Ether. Still, Ron Geffner, a partner at Sadis & Goldberg and a former SEC enforcement attorney, said that he does not expect the SEC to block Prometheum’s approach given Gensler’s stated desire to find a company that can operate under the SEC’s preferred guardrails. “The SEC, given their position on crypto being a security, wants successful registrants in the marketplace that are complying with federal securities laws and supporting their position,” he told Fortune.\n\nThe question remains whether Prometheum can draw investor interest—and whether its approach will survive subsequent SEC administrations. The Kaplan brothers argue that creating a compliant approach will drive institutional participation in the crypto industry, although they haven’t specified if the trading platform has potential clients lined up. Williams expressed skepticism that Prometheum would pull off its bold move. “They’re not market-tested, so I would just have some caution in regard to their ability,” he told Fortune.\n\nBut even if Prometheum can’t drum up demand, or running the operation proves too expensive, a successful launch could upend the industry’s argument that crypto is incompatible with existing securities laws. And that clarity, Brannan said, wouldn’t be the worst thing.\n\n“There’s a certain degree of value,” he told Fortune, “in just knowing exactly what the rules of the road are.”"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE9EVm9TVlNVbGlJemJjSWtVZnJoeGlsd19OZ0JBeVlkNUQwUVlJeURRZ3BjcTMzUnVDZ2w0cmlPNXdpT3dwanBqbXpfVDdCc0RtNEpwY1E0Qy0xemZSYVBRQnJQZk94Z3FGOTlOaUlyVHRycFZ3ZHR3aW5Jenlndw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Feb 2024 08:00:00 GMT",
        "title": "UBS issues tokenized warrant on Ethereum blockchain - Ledger Insights",
        "content": "Today UBS announced the issuance of an investment-grade tokenized warrant in Hong Kong on the Ethereum public blockchain. It used the UBS Tokenize issuance solution. It was a call warrant on Xiaomi stock and was sold to OSL Digital Securities.\n\n“The introduction of the UBS tokenized warrant reinforces the bank’s position as the leading derivative products issuer in Hong Kong,” said Winni Cheuk, Head of Sales, APAC Public Distribution, UBS Global Markets. “Created natively on a public blockchain in a permissioned environment, this innovative product enhances transparency, reduces transaction fees, streamlines settlement processes, and allows for more flexible trading hours.”\n\nUBS has long been active in the institutional DLT space – it was cofounder of the institutional payment system Fnality. Recently it has been flexing its muscles in web3.\n\nUBS’s expanding tokenization initiatives\n\nIn late 2022 UBS Wealth Management issued $50 million in digital debt securities to Asian high net worth individuals. That was followed last year by the Bank of China Investment (BOCI) issuing digital structured notes on Ethereum using the UBS Tokenize platform.\n\nAdditionally, UBS participated in multiple public blockchain trials as part of Singapore’s Project Guardian. One involved a pilot for a tokenized money market fund issued on Ethereum. Another was for cross border repo – the sale and repurchase of a natively issued digital bond on a public blockchain. SBI and DBS partnered for the experiment, which spanned Japan, Singapore, and Switzerland.\n\nBeyond public blockchain trials, UBS is in production with intraday cross border repo. It was one of the first banks to adopt Broadridge’s Distributed Ledger Repo (DLR), a permissioned blockchain infrastructure. A few months before the Project Guardian repo, UBS used DLR for a cross border intraday repo involving an Asian bank.\n\nIn related news, UBS is one of the five banks participating in Hong Kong’s second government digital green bond issuance. Goldman Sachs’ tokenization platform was used for the first bond, with HSBC’s Orion for the second. Hence, UBS Tokenize could be used in a future issuance."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiZkFVX3lxTFA4TVI1bXdxQUhaMlJ3cTlzVm1LNUtDQXdzeElvTUloRjlrLU1XLVBPeWpaNlpLa2RLNUg3V1F3VEhQUDV2c28zN0NyaVlaWmVXRVVVTlhYakRtNmloM01lSVp6NVlOUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Feb 2024 08:00:00 GMT",
        "title": "What is Ethereum fragmentation? - Crypto Briefing",
        "content": "Share this article\n\nEthereum’s evolution is marked by the adoption of Layer 2 scaling solutions (L2s), designed to alleviate the network’s congestion and high transaction fees.\n\nL2s operate on top of Ethereum (Layer 1 or L1), processing transactions more efficiently before finalizing them on the main chain. However, this has led to a new challenge: each L2 functions in its isolated environment, creating silos that hinder interoperability—a state we refer to as fragmentation.\n\nWhat is Universal Synchronous Composability (USC)?\n\nThe core issue with fragmentation is the loss of “universal synchronous composability” (USC), a feature allowing different applications to interact with each other seamlessly in real time. Imagine Ethereum as a bustling city where roads (L2s) connect buildings (applications).\n\nFragmentation is akin to having roads that don’t interconnect, forcing you to take a long detour to move from one building to another.\n\nThe proposed solution, “shared sequencing,” is like establishing a city-wide transit system that links all roads, enabling direct travel routes between any two points without detours.\n\nTo further simplify, consider shared sequencing as the internet of Ethereum. Just as the internet allows different computers to communicate directly regardless of their physical location, shared sequencing enables different L2s to interact seamlessly. This system removes barriers, allowing for immediate transactions across the network, akin to sending an email from one side of the world to the other in seconds.\n\nTechnical Explanation of Shared Sequencing\n\nShared sequencing coordinates the order of transactions across all L2 solutions on Ethereum. It uses a centralized mechanism to sequence transactions identically across different L2s without requiring major infrastructure changes.\n\nShared sequencing leverages Ethereum’s existing data availability capabilities. It proposes adding functionality for L2 solutions to sequence transactions in a unified manner. By sequencing transactions in the same order everywhere, shared sequencing enables instant interactions between L2s across Ethereum.\n\nPotential Use Cases for Shared Sequencing\n\nAdopting shared sequencing could revolutionize Ethereum. It would enhance liquidity and reduce transaction costs by enabling seamless communication between L2 solutions. This would eliminate the need for complex bridging between L2s.\n\nShared sequencing could enable more robust decentralized applications (dApps) and services that integrate across L2s. This would improve user experience and accessibility. By restoring composability across L2 solutions, shared sequencing would strengthen Ethereum’s network effects and dominance as a platform for blockchain applications.\n\nThe Road Ahead for Ethereum’s Ecosystem\n\nWhile Ethereum’s journey through fragmentation may resemble a challenging phase of growth, the horizon holds promise for a unified and efficient ecosystem. Shared sequencing represents a leap towards realizing this vision, offering a roadmap to re-establish Ethereum’s composability and network effects.\n\nAs we look to the future, continued innovation and collaboration within the Ethereum community will be pivotal in overcoming current limitations and unlocking the platform’s full potential. Through these efforts, Ethereum can evolve into a more interconnected and powerful platform, paving the way for the next generation of blockchain applications."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxQaVk5YTdwRDhSNXlMQV9hRTRtdHYyOEZYWlhGS1U4R2lrUzRCYXg2ekJ6emxUWktvQTBwOW5FUXJDeVplMjBEZjFYZE83My1aakJ3LUc2UnhGOWllTko1SGNwbm9zZWNYMF9pTVVWTlFHNGlHNGVtRWRQeFJlUndFc3U3NjBWUnd3elJFNG5TQkMxakFKT2ptWlY5akNVTWxfdm5N?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Feb 2024 08:00:00 GMT",
        "title": "Watch K33 Research Senior Analyst on Solana, Ethereum - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxORE1xX2llQ1dKTUJXbUcxNjBtRjB2U3dlU242cFI4N2hLYV96OVc1d3RHVkNkTWhuNmxtMkZDcUxrVFIxNnpZRDExSFJCaVQtN25KQlB2WTk2aG9ITXFWSXZoQzY4dzV5RlhoeUM1Y2FsWm5STVN1Tklic3p4VHRqTmdBaGszRFgt?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Restaking App Approaches $4 Billion In Deposits: Biggest Airdrop In History Incoming? - Yahoo Finance",
        "content": "EigenLayer is a new liquid restaking platform for Ethereum. The protocol allows users to stake the same amount of Ether (ETH) across multiple projects simultaneously to earn additional rewards. Proponents of the technology say that it will increase capital efficiency and spur innovation. Those against the technology believe that it could cause overleveraging and is susceptible to slashing.\n\nThough the new technology is causing a debate among ETH enthusiasts, it is impossible to deny the project’s popularity. Initially, EigenLayer put a 200,000 ETH cap on each protocol so that it could test the concept without extreme amounts of volume. The limit was removed on Feb. 5. Within 24 hours, over 700,000 ETH, or over $1.6 billion was deposited into EigenLayer. According to data from DefiLlama, this brought EigenLayer's total volume locked (TVL) to nearly $4 billion, which is over 1% of all Ethereum in circulation. For comparison, EigenLayer had less than $300 million in TVL for most of December 2023.\n\nDon't Miss:\n\nWhile the limit on deposits has been temporarily removed, a new limit will be put in place on February 9th. While the exact limit is unknown, it will likely be close to the TVL on February 9th. However, the project has also stated that it hopes to eventually remove any deposit limits, though this will likely happen some time in the future, if it happens at all.\n\nOn February 5th, ETH appreciated more than 3.5%, causing its market cap to approach $300 billion. Despite the strong day, ETH was still down more than 1% over the previous 7 days.\n\nTo make the project even more enticing, EigenLayer has begun showing EigenLayer Points, which are a calculation consisting of the time spent restaking, volume restaked, etc. to formulate a numerical value. While there is no guarantee that this could lead to an airdrop, other staking platforms have used a similar system in the past to mete out tokens in the event of an airdrop. One example from recent memory was the Jito (JITO) airdrop on the Solana chain. This project also used a point system, which allowed users to be placed into tiers that gave different amounts of JITO on the day of the airdrop. Again, there is no guarantee that EigenLayer will use the points system for an airdrop, but it has been used in the past.\n\nTrending: This brokerage offers custom rewards for users to switch – the biggest reward so far for 1 user is $19,977.48. Will yours beat it?\n\nEigenLayer and restaking is certainly an interesting system, especially considering the potential for spot Ethereum ETFs and Ethereum chain upgrades potentially coming soon. As the protocol continues to grow and we start to see its use cases, we will gain a better understanding of where liquid restaking could potentially play a role in the future of blockchain.\n\nStory continues\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nGet the latest stock analysis from Benzinga?\n\nThis article Ethereum Restaking App Approaches $4 Billion In Deposits: Biggest Airdrop In History Incoming? originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMi7wFBVV95cUxQd2tFMFFGQ0FyaFFkWmtXbFRzbFJBTjBoQVIxLTBaMFJTcmxkX0YxbW1aTFp0Z2FWcFpwcmZyYTFfU1FVSVlBZm1ablZzRHZKZld0S3JqTHNqNVFacUh1R3BHTDQ4Wjl3ME83RHZfekg5YTQxMFMxOEUyZkdBZDhsdm9DVGh5NUFnZzVDNTBaUTRvZGFWbVBVcGE1a2xfdG1uM0hhZUMzRjBJOS13emxZVXZkV3RqMDUwSEEtV1dLQlNDemRCNHpUMzZUTUVxZXlDdlJjeHJSdVlMS1FwemdTY3hkUXF1V093bUVoZ1B6Zw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Feb 2024 08:00:00 GMT",
        "title": "Prometheum Announces Custodial Services for Ether (ETH), Opens Account Sign Up For Institutional Clients - Business Wire",
        "content": "NEW YORK--(BUSINESS WIRE)--Prometheum Inc., today announced that its subsidiary Prometheum Capital LLC will initially provide custodial services for Ethereum’s ether (ETH) token. This development follows the company’s recent approval of its membership application from the Financial Industry Regulatory Authority (FINRA) as a Special Purpose Broker-Dealer (SPBD) permitted to custody, clear, and settle digital asset securities.\n\nPrometheum Capital has opened its signup process for institutional clients encompassing asset management firms, hedge funds, Registered Investment Advisors (RIAs), banks, and financial institutions, in anticipation of the platform’s custodial services launch in Q1 2024.\n\nETH will be custodied at a FINRA member firm and a SEC-registered broker-dealer for the first time, setting a precedent for the digital asset sector. Prometheum Capital plans to introduce additional digital assets for custody, with further announcements forthcoming.\n\n“Prometheum Capital's custodial services, starting with ETH, are tailored to meet the stringent regulatory and compliance standards promulgated by the Federal Security Laws,” Prometheum, Inc. Co-CEO Aaron Kaplan said. “Our unwavering commitment to compliance and investor safeguarding drives this milestone, signifying substantial progress towards establishing a new paradigm for blockchain-enabled market infrastructure.”\n\nPlans are in place to extend trading, clearing, and settlement services to both retail and institutional clients in 2024, fostering an inclusive and accessible platform for all.\n\nTo inquire about Prometheum’s custodial solutions, please contact business@procustody.com.\n\nAbout Prometheum\n\nFounded in 2017 by a group of Wall Street attorneys, Prometheum provides an end-to-end, blockchain-enabled ecosystem for the trading, clearance, settlement and custody of digital asset securities.\n\nPrometheum, Inc. Disclosure\n\nNon-solicitation\n\nThis press release is issued for informational purposes only and does not constitute an offer to sell, a solicitation of an offer to buy, or a recommendation of any security or any other product or service by Prometheum Inc., Prometheum ATS, and Prometheum Capital (collectively “Prometheum’’), or any other third party regardless of whether such security, product, or service is referenced in this press release. Furthermore, nothing in this press release should be construed as a recommendation to buy, sell, or hold any investment or security or to engage in any investment strategy or transaction. Prometheum does not represent that the securities, products, or services discussed in this press release are suitable for any particular investor.\n\nForward-looking statement\n\nStatements herein that are not historical or current fact are “forward-looking statements” that are based on the Company’s beliefs, assumptions, and expectations of future events, taking into account the information currently available to the Company. These forward-looking statements are subject to numerous uncertainties and factors relating to the Company’s proposed business and operations, as well as uncertainties relating to capital markets, some of which are difficult to predict and many of which are beyond the Company’s control. Any forward-looking statements herein are based upon information available to the Company on the date this was first sent by the Company. The Company does not undertake to publicly update or revise its forward-looking statements even if experience or future changes make it clear that any statements expressed or implied therein will not be realized."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxPS1loZ0VGaHpCSlVNQzBPNlJYdWhfX3NjUklVTFl5SjdWbVVRbFhfdjNnbFFwOS1keGVDc2kybXUzb3k5SXROa0pycEZqRVhSZlBKUDJSOU4ydnBjdXBjdzl3cWVWOUVaeFRlQmRzelhrVjNFeEtDVVpjV2FwTW5xN2FUcTc5czktUzFUWXJZcndKQTBaVFdGS0xzVElfOEdocTdfb2ctc3l1Z9IBrwFBVV95cUxNMFdhWkxEWWZFeGJveUM4bHVmdEFoU3dvUUtRM2w2aDFCbWhqZVVKOTQ2WVBRaDQwc1NzS0NQNll1b19EWW1DSHAzREJmLS1PM2pOU21EcGpSTC1GUEFxemc2WDJlNF9DcmI1blVBdDZjOFRQd2cxbGJVbHE3UGgxdF9wN1V4VzNFal9lZWZtSFVmcmlnX3hEelFKblhucmpuUFpHNEpmQkgtVmdXbWhB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Feb 2024 08:00:00 GMT",
        "title": "UBS Launches Investment-Grade Tokenized Warrant on Ethereum Blockchain - The Tokenizer",
        "content": "UBS has introduced Hong Kong’s inaugural investment-grade tokenized warrant on the Ethereum public blockchain network. Leveraging the on-chain issuance product framework provided by UBS Tokenize, the bank’s in-house tokenization service, this groundbreaking product is a call warrant featuring Xiaomi Corporation as the underlying stock. Notably, the tokenized warrant marks the first natively issued warrant on a public blockchain and was successfully sold to OSL Digital Securities Limited, a licensed virtual asset platform operator and wholly-owned subsidiary of OSL Group (formerly BC Technology Group).\n\nWinni Cheuk, Head of Sales, APAC Public Distribution at UBS Global Markets, highlighted the significance of the UBS tokenized warrant, reinforcing the bank’s position as a leading issuer of derivative products in Hong Kong. This innovative product, created natively on a public blockchain in a permissioned environment, brings enhanced transparency, reduced transaction fees, streamlined settlement processes, and flexibility in trading hours.\n\nPatrick Pan, Chairman and Chief Executive Officer at OSL Group, expressed pride in collaborating with UBS, simulating the entire product life cycle of an equity-linked structured product token. From token minting through simulated secondary market transactions to token burning at maturity, the transaction represents a major milestone in Hong Kong’s regulated virtual asset landscape.\n\nKey features and benefits of tokenized warrants include improved accessibility, leveraging blockchain technology for better access to digital structured products and extended trading hours. The utilization of smart contracts facilitates automation, streamlines trading and administrative processes, and lowers handling costs, contributing to increased efficiency compared to traditional channels. The transparency provided by blockchain technology ensures that all transactions and ownership records are securely stored on a decentralized ledger.\n\nThis tokenized warrant is part of UBS’s ongoing effort to advance its tokenization services. Since 2015, UBS has been at the forefront of blockchain technology and digital assets, exploring various opportunities with a focus on developing institutional-grade infrastructure for tokenized assets. UBS Tokenize, an integral part of UBS’s broader work in tokenization services and global distributed ledger technology, supports opportunities across origination, distribution, and custody, with an initial focus on tokenization of bonds, funds, and structured products. In 2022, the bank achieved another milestone by issuing the first-ever USD 50 million tokenized fixed-rate note, sold to Asia Pacific clients through the UBS Tokenize platform.\n\nImage by pat pat from Unsplash\n\nRead other stories: Bitfinex Securities Expands to El Salvador\n\nWhat investor protection measures are suggested when dealing with security tokens or other digital assets?"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxOckdHWW1IOUlJZzc0SndHOEpFc28xSFBRRUN3RjhWOVJpdUhFVlhaUVREeVB6ZjFKa0NmWTBnUnVEQk1qNU15SG9iMExXOGYyMWR4cU01ZGxWRmsxY19DVmpGcWxiU1BFcnRqQXVkZGpUVElWVzVYSFNKWUZ5R21kSTBkOUhaVm16V2w5eXZwZm9Gc1ZxbWfSAZsBQVVfeXFMUDVsMFQ5dndPdUc0bG5naDAyNUhwVFU4MmY0M2k0UUNNdlhPaWRQYVhZZHRyTU9VRHUtWnVTdzY4dHlLV1F2TmdEcjZWQUdUazcwMy1la1NIVkNzU2JvNDlJY1NURjdrVGVFVzBkcEVlSUtrS1RhNW9xai0xRTNPd3I2ODJ3NlN2WEdob2dnNGFwQlJHbjdSa1gtZ2c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Feb 2024 08:00:00 GMT",
        "title": "Ethereum (ETH) Supply Drop Starts: Are We Seeing Beginning of New Ethereum Era? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nThe Ethereum network has recently observed a noteworthy supply drop, entering further into the deflation area. This week's data showcases a supply change with a decrease of 393.60 ETH, leading to a total supply of 120,179,017 ETH. This decline does not immediately impact the asset's price; however, a sustained deflationary trend could signal a positive development for Ethereum's market performance.\n\nAdvertisement\n\nDeflation in a cryptocurrency like Ethereum signifies that the number of coins being burned — taken out of circulation — is exceeding the number being created or issued. Such a supply contraction, especially when continuous, can be beneficial for an asset's valuation, as it may enhance scarcity and potential demand over time.\n\nETH/USD Chart by TradingView\n\nAnalyzing the current Ethereum chart, we observe that ETH has been maintaining a steady posture above the 100-day EMA (orange line), a significant indicator of long-term market sentiment. This positive position, juxtaposed with the recent supply deflation, provides a solid foundation for a potential growth scenario.\n\nAdvertisement\n\nThe deflationary mechanism introduced by Ethereum's EIP-1559 is expected to play a vital role in the asset's price dynamics in the long-term future. As the network reduces its overall supply, each ETH token's relative value could increase if demand remains constant or grows. We might also consider this as a precursor to a new short-term era for Ethereum, where increased network activity causes severe deflation.\n\nThe recent outage of the Solana network adds an intriguing layer to the narrative. Historically, when alternative layer-1 networks face technical difficulties, Ethereum often benefits as the leading smart contract platform. The current downtime in the Solana ecosystem may redirect attention and activity back to Ethereum, potentially strengthening ETH's market position."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxQdk5EZFBoS1hBNVBtWDB3SlJSQ3JHVXhXbWZQdlo5VWV6RzVGRTBDNm1ic3ZJX0ZRMUJfajZTSjlVZFhmSWFFQnlTd2t1c29rZ0Zqak15N2lxdHVPOGF2M2hrWlYxQjY5WXowSHNiWW9PQk5KdzRvX1VINTl3TXpocFlDV1poUmM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Feb 2024 08:00:00 GMT",
        "title": "Bitcoin halving will impact Kangamoon, Ethereum, and Optimism - crypto.news",
        "content": "Disclosure: This article does not represent investment advice. The content and materials featured on this page are for educational purposes only.\n\nIn 2024, Bitcoin halving will happen. This event will likely impact altcoins like Kangamoon (KANG), Ethereum (ETH), and Optimism (OP).\n\nEthereum is evolving\n\nIn the coming years, Ethereum will continue to upgrade.\n\nAs it is, more institutions are adopting Ethereum, which has led to an increase in its total value locked and transition to a deflationary asset.\n\nDespite potential challenges, experts are bullish.\n\nETH is steady, with supporters bullish that a spot Ethereum ETF will be approved.\n\nOptimism navigating trends\n\nOptimism, a layer-2 scaling solution for Ethereum, has made notable progress ahead of the Bitcoin halving in 2024.\n\nIt has upgraded and integrated with Orderly Network.\n\nOP is trading at $3.16, down from $4.20.\n\nThe integration of OP’s Stack on January 21, 2024, is a significant milestone for decentralized finance (defi).\n\nIt is expected to bring more users and liquidity to Optimism, boosting its overall economic activity.\n\nThe integration has led to an 800% increase in address count on Optimism, indicating growing interest and adoption.\n\nMarket analysts have mixed predictions for OP’s future price. Still, the overall sentiment remains optimistic, given its role in the expanding Ethereum ecosystem and its contribution to scaling solutions.\n\nKangamoon’s future\n\nKangamoon combines social and gaming elements.\n\nIt aims to create a community where members can participate in various challenges and earn rewards and KANG.\n\nKANG is changing hands at $0.005 in the ongoing presale, but analysts expect more gains.\n\nYou might also like: Cardano takes on Ethereum, analysts bullish on KangaMoon\n\nKangamoon doesn’t have taxes on buying or selling KANG.\n\nAs the cryptocurrency market changes, Kangamoon’s unique approach and focus on the community could make it a significant player in the meme coin and digital gaming markets."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxQTThLaEdubHZBUUNjR1pHX1lPc2hpZ0t2SmpMTXFvRXVPS1c1X191Z1JUUjA4OVlqOGtVNFpHSDVtckpOcVc0ZHIyTWI2dHZWQl9iVEhJOEFBNVRkM3I4ZjVIVDVac1l5Zk9lZlRxSFg1QkdLQTBGWHV3SEhNUWdBedIBiAFBVV95cUxOQ05KVmpiZmhFMkxVT3hBNHRJZ2huT0gzWE42VVdsMGFwVGRhU0xQN3ZQV3F3aWVTNVlHSFcyV1ViOWFSYzJqS1FyZ1B4RDRCYkxsOE01U1VHWHY3azBsR0kzLVNraWV4WlRFWVh1Unp5QU1rcjNFM2R4c0VrTUNVODZlcm55QW43?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Feb 2024 08:00:00 GMT",
        "title": "Dymension Goes Live, Airdrops $390 Million in DYM to Solana, Ethereum Users and More - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nDymension’s anticipated airdrop took place on Tuesday as the network’s mainnet went live, serving up over $390 million worth of DYM tokens for early users and select communities as the token surged in value following the launch.\n\nDYM is currently up 58% on the day to a current price of $5.60, according to data from CoinGecko, with some $246 million worth of trading volume already on exchanges including Binance, ByBit, and KuCoin. The airdrop spans 700 million DYM tokens, representing 7% of the total supply.\n\nDymension is a network built to let developers deploy app chains that it calls RollApps, and it’s a layer-1 blockchain built using Cosmos tech and the inter-blockchain communication protocol (IBC) to connect with various other chains. Builders can choose from various virtual machines and tokens on their RollApps.\n\nThe “genesis rolldrop,” as Dymension called it, was available to more than a million unique wallets across various chains and communities, including users on the networks Solana, Celestia, and Ethereum scaling networks such as Arbitrum, Optimism, Base, and the upcoming Blast.\n\nAD\n\nAD\n\nCertain communities could also take part in the airdrop, including holders of the popular Pudgy Penguins NFT collection on Ethereum, as well as Mad Lads and Tensorians on Solana.\n\nWhile more than a million wallets could have claimed a share of the 700 million airdropped tokens, the claim already took place in January—and only 528,523 wallets ultimately made a claim, which means that around half of eligible users left money (or DYM) on the table. Those tokens were ultimately redistributed to other users.\n\nDYM is currently the second-largest token airdrop of 2024 based on the total value of the dropped tokens. It follows decentralized exchange (DEX) aggregator Jupiter on Solana, which airdropped 1 billion JUP last week—which, at the current price, puts the total value of that drop at $527 million.\n\nEdited by Ryan Ozawa.\n\nAD\n\nAD"
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxPOHcxRzFVNG1fVGk0MkFWektiRVJMdEZzelJPbUVRa0xpQVo5aVVHOXBkYktmY0VuSGFVSlVKYzBwdDI5OXNqUHFOMVdBNlg5ZWtMVmdMekpGVW1QcjhjY1EtT1RVLVBxb2xjWU9wYzZnbHJOc0RleEU1cmdZXzB1MlZ5YWo2WjFTY2c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Feb 2024 08:00:00 GMT",
        "title": "Analyst: this coin may outperform Bitcoin and Ethereum in 2024 - crypto.news",
        "content": "Although the broader market has been relatively flat, the Bitcoin Minetrix presale has been active, pushing raised amount to over $10.3 million. Some supporters now believe Bitcoin Minetrix (BTCMTX) could outpace top coins like Bitcoin (BTC) and Ethereum (ETH) in 2024.\n\nThe project incorporates a stake-to-mine model for utility, adding value to its ecosystem.\n\nBTCMTX versus BTC and ETH\n\nSince Bitcoin and Ethereum are considered some of the safest (least volatile) cryptocurrencies, market participants often expect more sizable returns when buying other projects.\n\nNew coins typically have more upside potential because of their lower market caps.\n\nMeanwhile, the prices of Bitcoin and Ethereum are less volatile in each market cycle as liquidity grows from expanding market caps.\n\nBitcoin Minetrix will lists on various exchanges at a later stage; an opportunity some investors plan to exploit.\n\nBitcoin Minetrix’s stake-to-mine model\n\nBitcoin Minetrix takes a novel approach to one of crypto’s most pressing issues: Bitcoin mining.\n\nThe project has created a cloud mining solution on Ethereum for users to mine Bitcoin.\n\nYou might also like: Analyst says Ethereum can reach $10k in 2024, new altcoin likely to follow\n\nIt requires no specialist hardware or technical expertise. This addresses the problems of high-startup capital and skill requirements to begin Bitcoin mining.\n\nBitcoin Minetrix enables anyone to easily get started.\n\nTo get started, users stake BTCMTX, in exchange for Bitcoin mining credits. They can then burn these credits for cloud mining power, mining BTC.\n\nEarlier cloud mining solutions are regarded as shady due to a series of scams that have been carried out.\n\nThe Bitcoin Minetrix whitepaper highlights this issue, explaining that cloud mining protocols would lure investors with decent gains and then present “unwarranted complexities” once users deposit more cash.\n\nHowever, Bitcoin Minetrix believes in transparency and fairness, ensuring all transactions are recorded on-chain.\n\nFurthermore, no cash changes hands with Bitcoin Minetrix thanks to its stake-to-mine model.\n\nWill Bitcoin halving impact BTCMTX\n\nThe Bitcoin halving has correlated with the beginning of every crypto bull market.\n\nThe event, set for early April 2024, will halve miner rewards, creating a supply and demand discrepancy in the market.\n\nYou might also like: Next Bitcoin halving just 15k blocks away\n\nThis development might drive prices higher, possibly lifting altcoins like BTCMTX thanks in part to the project’s correlation to Bitcoin.\n\nSince Bitcoin Minetrix users earn real BTC rewards, the value of Bitcoin Minetrix is tied to the Bitcoin price.\n\nBitcoin Minetrix tokenomics and presale\n\nBitcoin Minetrix tackles the mining problem but captures value using BTCMTX.\n\nSince BTCMTX is key to earning rewards and can be staked, it will relieve the token of selling pressure.\n\nAlso, staking rewards are primarily paid in mining credits, not BTCMTX. This differs from most other staking coins, which pay rewards in their native token, leading to sustained sell pressure.\n\n42.5% of Bitcoin Minetrix tokens are allocated to Bitcoin mining, 35% to marketing, 12.5% to staking, and 10% to the community.\n\nIn the current presale stage, BTCMTX is available for $0.0133."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPYTZPQkQxWWNLNVhBcUxDd3ZuNTh6d0hlTjVxZUJ6SkIxbDd2V0I3azFJRGhybVd4OGxNVlZ2SDNBNmxlNHE4UEZxejN3NXZJNkdqYTU3OWVJTzBSUWRBRFJEazV2aV91aU5OZTJLN1FpUEg4ZFN4WUFVWFU1ZkVpdTA2RUVPbmozM3Rv0gGQAUFVX3lxTE54QThLTGN3T3hFVGdaejBlXzlZcE5nVGdMcFh2SFhicTRrRk1taFJPd3AyYmxScmtqV1N4WjFJWXR3dGhmXzF4dXBPQ01kbVd4V19KNXpxVExrYVJMX2JRZGZHTTBjV2xRMXpKLTg4YmhZUDl5eDZEd3ZBMjdRSkpqd2g3NDRHbExKeWlleUR6NA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Price Rallies Toward $2400 As Dencun Upgrade Goes Live - CoinGape",
        "content": "The Ethereum crypto has witnessed a notable rally, with its price soaring towards $2400, buoyed by the excitement surrounding the imminent deployment of the Dencun upgrade. Ethereum’s core developers recently implemented the Dencun upgrade on the Holesky testnet, marking the final phase before its expected mainnet rollout in early to mid-March.\n\nThe integration of EIP-4844, a key feature of Dencun, is anticipated to revolutionize Ethereum’s scalability and cost-effectiveness, particularly for Layer 2 rollup chains. Notably, the Ethereum price rally today also sparked curiosity, despite the SEC delaying the spot Ethereum ETF approval from Invesco and Galaxy Digital.\n\nadvertisement\n\nEthereum Dencun Upgrade Live On Holesky Testnet\n\nDespite market consolidation, Ethereum has experienced a surge in price, fueled by optimism surrounding the upcoming Dencun upgrade. The successful implementation of Dencun on the Holesky testnet, as confirmed by Ethereum Foundation developer Parithosh, signifies a crucial milestone before its anticipated mainnet deployment.\n\nThis upgrade, featuring EIP-4844, notably promises significant enhancements to Ethereum’s scalability and transaction cost reduction, positioning the network for further growth and adoption in the evolving crypto landscape.\n\nMeanwhile, the Ethereum Dencun Upgrade underscores Ethereum’s dedication to ongoing advancement and innovation. With a focus on scalability through proto-danksharding, improved security measures, and enhanced network efficiency, Dencun is poised to strengthen Ethereum’s standing as a premier blockchain platform substantially.\n\nEthereum Price To $3,500?\n\nIn a recent analysis, prominent crypto analyst Michael van de Poppe highlighted the imminent uptrend for Ethereum (ETH), particularly as a focus on the Dencun upgrade. Van de Poppe predicts that the Ethereum price surge is imminent, with a target set at $3,500.\n\nExpressing confidence in Ethereum’s potential, van de Poppe emphasized that the market is currently undervaluing the significance of ETH. He further disclosed his strong preference for the Ethereum ecosystem, foreseeing it as a major driving force in the months ahead.\n\nMeanwhile, Bloomberg Intelligence analyst James Seyffart stated that he continues to expect more delays in spot Ethereum ETF approval in the coming months. According to Seyffart, the focal point for Ethereum spot ETFs currently revolves around May 23rd, which marks the final deadline set by VanEck, another ETF issuer seeking approval from the SEC.\n\nAccording to a study by Coingecko, Europe leads the global Ethereum (ETH) ETF market, holding an 81.4% share. The region boasts 13 ETH-backed ETFs, covering both spot products and futures funds, with assets under management (AUM) totaling $4.6 billion.\n\nCanada also plays a significant role in the ETH ETF market, holding a 16.6% share with $949 million in AUM. ETFs have emerged as a popular entry point into the crypto space for many Canadian investors.\n\nAs of February 2nd, the total global AUM for ETH ETFs reached $5.7 billion, spread across 27 ETFs offering both spot and futures funds\n\nBhushan Akolkar Bhushan is a FinTech enthusiast with a keen understanding of financial markets. His interest in economics and finance has led him to focus on emerging Blockchain technology and cryptocurrency markets. He is committed to continuous learning and stays motivated by sharing the knowledge he acquires. In his free time, Bhushan enjoys reading thriller fiction novels and occasionally explores his culinary skills.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxNQVFlWTZpdkFNNVR5QlpCdk1GYXVTSGdyQVJ1UDltajdkM09sRUxvOElDckszaVlfaXl4WVFROFpVSTVXeDNuYWt5eFpma1pXVTVaU2Z1RDc5b1YxUmV4R1BKZUwtX3VCdkdydTM5MnQzS2RXOXU5dkR0bmFHUVFpWNIBiAFBVV95cUxQRFJLMWRLOEw2MXg1SmJnaVdnR2dXQ081ZDRKb0ZKd2g3Y3BtNzExRXBGem1QMEg2bGh0dHBJQWRLOHB4S3hyUVhOOWhsTGJiOVdCWFFvQ2ZKbTY4YmpudlFKUnZRZV9DMldwaWdOaUpUWVJPVjBUZ2tVX19WUkhZNDJpU3NsVkNM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Feb 2024 08:00:00 GMT",
        "title": "'Heroes of Mavia' Airdrops Token to 100,000 Gamers, Ethereum NFT Owners - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nHeroes of Mavia, a recently released mobile strategy game, today launched its MAVIA token and conducted an airdrop to 100,000 players—along with holders of some 10,000 Ethereum NFT land plots in the game.\n\nThe MAVIA token on Ethereum debuted early Tuesday and has spiked in value, jumping about 36% to a current price of nearly $3.10, per data from CoinGecko. The platform reported about $95 million worth of trading volume on exchanges like Bybit and Crypto.com, with a current market cap of over $92 million.\n\nDeveloped by Skrice Studios, Heroes of Mavia is a iOS and Android strategy game that’s very similar in approach to the smash mobile hit Clash of Clans. Heroes of Mavia will implement the MAVIA crypto token, however, and Skrice has sold NFT land plots that will be integrated into the game.\n\nAccording to Skrice, more than a million people downloaded the game following its release last week. The studio launched an airdrop program for 100,000 total players who synced their game account to the Heroes of Mavia website, and all 100,000 slots were quickly filled ahead of the token launch.\n\nAD\n\nAD\n\nHeroes of Mavia has reached 1,000,000 global downloads on iOS and Android 🎉 Join us on our mission to bring mass adoption to Web3 gaming - one player at a time! pic.twitter.com/5KyknZaOQA — Heroes of Mavia (@MaviaGame) February 4, 2024\n\nFurthermore, people who own the Ethereum land plots and participated in NFT staking programs that began in early 2022 will also receive a share of tokens.\n\nSkrice Studios has raised over $8 million in funding to date, with backers including Binance Labs, Crypto.com Capital, and Animoca Brands.\n\nEdited by Ryan Ozawa.\n\nAD\n\nAD"
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxQLWZSVjhEUkxnNkM3VTIxclM3MkxkRWxWaktRM29jcXpadFhPcHVtSkxrNWJWV1ZzSmF1N0loZXB2MXRoVUViVi16SlNySVdibWlmUUxDNmRHdmxOZXQwSUpRUUlFLU4zMDg3S250dEdOLTdmb1dia09ZWWtmNHZES2o0aDBKNzVEWjg1ZGhzYjdPcTQ3UzZLQlZ0ODJRUDIxY1UzSHVzdjN0NExaSVluag?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Feb 2024 08:00:00 GMT",
        "title": "Paxos Adopts Chainlink’s PayPal USD Price Feed to Accelerate Tokenized RWA Economy - Paxos",
        "content": "To accelerate the adoption of PayPal USD (PYUSD), PayPal’s USD-backed stablecoin issued by Paxos, Chainlink now supports a PYUSD Chainlink Price Feed on Ethereum mainnet. Secured by the industry-standard oracle network Chainlink, this new PYUSD Price Feed allows users to view highly accurate, reliable and decentralized market data for PYUSD on the blockchain. This provides users the information needed to help create secure markets around PYUSD and adopt it as their preferred stablecoin to facilitate on-chain payments.\n\nPYUSD is an open and programmable stablecoin backed by dollar deposits, US treasuries and cash equivalents and is issued by Paxos, the leading regulated blockchain infrastructure and tokenization platform. PYUSD is transferable on Ethereum, where it serves as collateral for DeFi projects and facilitates payments. Together, Chainlink and Paxos are advancing the use of tokenized real-world assets (RWAs) and helping scale on-chain finance to billions of users across the globe.\n\nHow Chainlink’s Market-Leading Security Helps Drive Adoption of PYUSD\n\nApplications and users across the DeFi space require high-quality, tamper-proof market data in order to establish a secure market around an asset and bootstrap liquidity. Without secure data, applications and the funds held within them would be vulnerable to market manipulation attacks and other exploits. By securely delivering accurate PYUSD data on-chain, Chainlink Price Feeds help PYUSD to attract initial liquidity and kickstart ecosystem-wide adoption.\n\nAs the market-leading price data solution in Web3, Chainlink already helps secure leading DeFi protocols responsible for tens of billions of dollars in smart contract value, maintaining robust security and high availability even amidst unexpected events, such as exchange downtime, flash crashes, and data manipulation attacks via flash loans.\n\nChainlink Price Feeds provide a multitude of critical features such as:\n\nHigh-Quality Data —Chainlink Price Feeds source data from numerous premium data aggregators, leading to price data that’s aggregated from hundreds of exchanges, weighted by liquidity depth and cleaned from outliers and suspicious volumes. Chainlink’s data aggregation model generates precise global market prices that are resistant to API downtime, flash crash outliers and data manipulation attacks like flash loans.\n\n—Chainlink Price Feeds source data from numerous premium data aggregators, leading to price data that’s aggregated from hundreds of exchanges, weighted by liquidity depth and cleaned from outliers and suspicious volumes. Chainlink’s data aggregation model generates precise global market prices that are resistant to API downtime, flash crash outliers and data manipulation attacks like flash loans. Secure Node Operators —Chainlink Price Feeds are secured by independent, security-reviewed oracle nodes run by leading blockchain DevOps teams, data providers, and traditional enterprises with a strong track record for reliability, even during high gas prices and extreme network congestion.\n\n—Chainlink Price Feeds are secured by independent, security-reviewed oracle nodes run by leading blockchain DevOps teams, data providers, and traditional enterprises with a strong track record for reliability, even during high gas prices and extreme network congestion. Decentralized Network —Chainlink Price Feeds are decentralized at the data source, oracle node, and oracle network levels, generating strong protections against downtime and tampering by either the data provider or the oracle network.\n\n—Chainlink Price Feeds are decentralized at the data source, oracle node, and oracle network levels, generating strong protections against downtime and tampering by either the data provider or the oracle network. Transparency —Robust, publicly available reputation frameworks and on-chain monitoring tools allow users to independently verify the historical performance of node operators and oracle networks, as well as check the real-time prices being offered.\n\n—Robust, publicly available reputation frameworks and on-chain monitoring tools allow users to independently verify the historical performance of node operators and oracle networks, as well as check the real-time prices being offered. Economy of Scale—Chainlink Price Feeds benefit from an economy of scale effect, where increasing adoption allows multiple projects to collectively use and fund shared oracle networks to fetch commonly required datasets. This allows DeFi projects to get premium data quality and robust oracle security for a lower total cost.\n\n“We’re excited to collaborate with Chainlink in driving the adoption of tokenized real-world assets (RWAs) across a variety of use cases, including on-chain payments. Paxos’ platform enables PayPal to issue PYUSD on-chain, while Chainlink’s industry-standard PYUSD/USD Price Feed helps accelerate the stablecoin’s adoption across the smart contract ecosystem.” –Nick Robnett, Senior Director of Stablecoin Partnerships, Paxos\n\n“We’re thrilled to launch a PayPal USD Chainlink Price Feed and help provide Paxos with the secure, reliable and decentralized price data needed to boost the adoption of PYUSD. With enterprise-grade infrastructure and a proven history of reliability, Chainlink enables premier financial organizations to enter and grow the world of on-chain finance.”– Johann Eid, Chief Business Officer of Chainlink Labs\n\n\n\nAbout Chainlink\n\nChainlink is the industry-standard decentralized computing platform powering the verifiable web. Chainlink has enabled over $9.3 trillion in transaction value by providing financial institutions, startups, and developers worldwide with access to real-world data, offchain computation, and secure cross-chain interoperability across any blockchain. Chainlink powers verifiable applications and high-integrity markets for banking, DeFi, global trade, gaming, and other major sectors.\n\nLearn more about Chainlink by visiting chain.link or reading the developer documentation at docs.chain.link.\n\nAbout Paxos\n\nPaxos is the leading regulated blockchain infrastructure and tokenization platform. Its products are the foundation for a new, open financial system that can operate faster and more efficiently. Its blockchain solutions are used by leading global enterprises like PayPal, Interactive Brokers, Mastercard, Mercado Libre, Nubank, and more, It is the issuer of numerous regulated digital assets including PayPal USD (PYUSD), Pax Dollar (USDP) and Pax Gold (PAXG). Prudentially regulated by the NYDFS in the US and the MAS in Singapore, Paxos is a top-funded fintech company with more than $540 million raised from leading investors including Oak HC/FT, Declaration Partners, Founders Fund, Mithril Capital and PayPal Ventures. With offices in New York, London and Singapore, Paxos takes a global approach to modernizing the financial system. Learn more."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMi8gFBVV95cUxQcGdQUzB5a2h6VEc4MGpudzFfaXZURkhFWjlDcHNiaTZCTm5tNzBoOE5lQWhDSXVNcHd2VVdkNFJYSnpUTGNWX0ZSenJGcl9KNTd0ZVVrby1ReTZJUGNxMG9yaV9mOXMzc092aWxPTjlRcVRVYUk2b1BoQUdoY0tjMHU0TDRENzRmbEZ0a0JTZDRwQzMtZGVxWkJpVHdiRXd2LWdCLTY2NU01aXlSNTRVd3BIRm1ZMGtidTl6MEdob3p6enlJV3pqa1RDZk9XZWxDNVFVaG5TTGhxcmVNRHh6cUJMaU5TYlNLU2JFVFlkMUFZQdIB9wFBVV95cUxOMUREekZyYmh1VXM0Sm9SWDd0SlBGQUZqWTktS1F6Vjg4ZURxZENUUVlJYWd3TWFsSVdNT1pMZFo0VEFGM1gtQXFIX0hWZ3NyQW44R3NRbW1ST3RacEp5U1g1ci14b1VIVGNwd0dlLUplTkVDOEFRRi1jc3hqUmpwQm5naFpScWxGX1FqcHpiY3ZVeHNDLTR0Ul9jM2tMLUVpVlA1S3lHQllETjRkb0lfVHVzZjYxOHgyZkotUTE4OFF6T29KazBhMVVNLWduSktvUVBYOUJwT1hqWnY3YzN2YzNPckl4cVFhOUdSWGZsUk1WbWpVeUxn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Feb 2024 08:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: Crypto markets primed, await directional bias from BTC - FXStreet",
        "content": "Bitcoin price continues its consolidation inside the $41-43,000 range for more than a week.\n\nEthereum price is likely to slide lower, allowing sidelined buyers an opportunity to accumulate ETH around $2,167.\n\nRipple price needs another sweep before it can kickstart an ascent to $0.532.\n\nBitcoin (BTC) price shows no directional bias whatsoever as it trades inside a tight range. Investors, however, are looking at Ethereum (ETH), Ripple (XRP) and other altcoins for volatility.\n\nAlso read: Bitcoin price sustains uptrend as Chinese investors stampede out of local market in favor of US-focused ETFs\n\nBitcoin price squeezes\n\nBitcoin price action over the past week shows that volatility is nowhere to be found. As BTC trades inside a $41-43,000 range, investors are anticipating a move in either direction. Some forecast that a crash to $34,000 needs to occur before the pioneer crypto rallies higher. Others are playing a contrarian approach, expecting BTC to continue its uptrend as it breaches the tightening range.\n\nRegardless of what direction Bitcoin price goes after its breakout, this analysis will focus on a smaller time frame outlook. The key levels that investors need to be watching are\n\nMonday’s high at $43,567 Monday’s low at $42,229 and Previous Monday’s low at $41,167.\n\nUsing a range-bound trading strategy, if price sweeps liquidity above/below one of these points it will suggest it is about to move back within the range toward the lower or upper bound, continuing an extension of the ranging market.\n\nFrom the looks of the ongoing consolidation, the chances of an upward move to the $43,567 level first appears high, which would then likely be followed by a sweep of $41,167.\n\nBTC/USDT 1-hour chart\n\nOn the other hand, if Bitcoin price sweeps the $41,167 support level first, it would allow investors to open a long position targeting $43,567.\n\nEthereum price wants to move higher\n\nEthereum price trades inside the $2,167 to $2,719 range and is targeting a retest of the resistance zone, extending from $2,400 to $2,600. But considering the Relative Strength Index’s (RSI) position, a sweep of the $2,167 level first looks likely.\n\nA sweep followed by a quick recovery will be a key buy signal for sidelined buyers. This move is likely going to result in a retest of the range’s midpoint at $2,443.\n\nIn some cases, Ethereum price might extend higher if the buying pressure ratchets up.\n\nAlso read: Over 50% of Ethereum’s ERC-20 tokens listed on DEXes show characteristics of pump and dump\n\nETH/USDT 1-day chart\n\nRegardless, if Ethereum price breaches $2,167, it will invalidate the bullish thesis by producing a lower low. In such a case, ETH could revisit $2,000 and lower levels.\n\nRipple price at the end of its downtrend\n\nRipple price shows that it is approaching a potential bottom on the three-day chart. Investors should expect a potential sweep of the $0.468 support level before an uptrend kickstarts.\n\nIf this liquidity run is followed by a quick recovery off the aforementioned level, it will be a buy signal. In such a case, investors can expect XRP to eye a 13% rally to retest the weekly barrier at $0.532.\n\nAlso read: XRP price could deteriorate with Ripple’s request for deadline extension in SEC lawsuit\n\nXRP/USDT 3-day chart\n\nWhile the outlook for Ripple price is logical, a break below and then flipping of the $0.468 support level from the Autumn 2023 lows, into a resistance level will invalidate the bullish thesis. In such a case, XRP could nosedive 19% and tag the next key support level at $0.379."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxPMXpHeDRQTVVvaENTcVpiQl9yVXZIRmZYbkdWV0t3NDZsaTd5Z2VOTzFpdl9HTFBrb2VJTzAzNlBiNHktR0t5TEgtZE1LN3NtZWduNHh3R0tJSmg5NHdtbVBHYmVhRlFSX28zcjlrckJ1VTM2OTl2am43a3lJb1JfQVc4VGVwdE1aX0VoU3ZyeElxWEJId2N1c052RHc3cVU1Z3JhSDV3clhCblZkblVMQVBUVdIBuAFBVV95cUxOY3dDNk5rMXFTMU9HcGVEcWhGRm5LWUFtb1dOVm5JdmhBaXdaMzNyUWNlSWZYeVpzVHNEWjQzNGdnRVA4NjZnZDljWl8tal9TVWNLRHhrMmd3VWwtQ2RoVFpKc1JpMlhBLV9wZ3ljeEprTHdwWlRiUENkWXA5X3UyUWs3M254UE1RUURxX25JRzd0cWxpa3FkTXpvYTZ0c1AzTnU1MzNUQzFvTHZabktFdS1oYXFLRXNm?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Feb 2024 08:00:00 GMT",
        "title": "Solana (SOL) Gains Crucial Foothold, XRP's Movements Are Too Predictable, Last Resort for Ethereum (ETH)? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nSolana is showing signs of a potentially significant technical development on its trading chart against Ethereum. The asset is currently engaging in a critical battle at the 50-day EMA, a level that will determine the medium-term trend direction for the asset.\n\nAt this juncture, the 50 EMA is acting as a dynamic resistance level. Solana's attempts to break above this level have been met with resistance, but there is a persistent effort from the bulls to push through. Should Solana manage to decisively close above the 50 EMA, it would likely confirm an important new support level, which could bolster investor confidence and potentially lead to a new leg up in its price against ETH.\n\nHowever, despite the bullish attempts, the volume profile suggests that there is not substantial buying activity to give Solana the powerful push it needs to sustain above the 50 EMA. The volume, a crucial indicator of market enthusiasm, is somewhat lacking, indicating that the current push may not have the necessary momentum to create a reliable new support level.\n\nThe support level to watch, if Solana fails to break the 50 EMA, is positioned around the 100-day EMA. A retracement to this level could provide a bounce-back opportunity for the asset, but it would also reflect short-term bearish sentiment, indicating that the market is not ready for a breakout.\n\nAdvertisement\n\nXRP stays irrelevant\n\nUnpredictability is often the name of the cryptocurrency game. However, XRP has recently been tracing a path \"too predictable\" for a cryptocurrency. A few days ago, XRP appeared to be gathering momentum, but a swift correction quickly dispelled the budding optimism, bringing it down to lower support levels.\n\nThe focal point for traders now is the $0.47 support level. This key threshold is anticipated to be the springboard for a potential reversal. Yet, the timing of when XRP might reach and rebound from this level remains nebulous. The lack of volatility in XRP's price movements is serving to complicate predictions further.\n\nVolatility is a measure of trading opportunities, with larger price swings offering more potential for profit (and loss). The current state of flatlined price action limits these opportunities, potentially driving traders to look for more dynamic assets to trade.\n\nThe resistance levels to watch are at $0.5714 and $0.5633 which, if broken, could suggest the beginnings of a reversal pattern. However, without significant buying activity, these levels may continue to cap any upward movements.\n\nEthereum's last stop\n\nEthereum approaches a key technical indicator, and the outcome could dictate the asset's trajectory in the coming weeks. Currently, Ethereum's price hovers near a crucial point, engaging with the 50-day EMA.\n\nAt this juncture, the 50 EMA serves as the immediate resistance level. The ability of ETH to break above this mark is crucial — if successful, it could signal a return of bullish momentum, with potential targets set at higher resistance levels, such as the recent high around $2,436. Failure to breach this level, however, could spell trouble for Ethereum's short-term prospects.\n\nA rejection at the 50 EMA could lead to a price retracement toward the 100 EMA (the orange line), which is currently near the $2199.9 mark. This would not only negate the recent progress but could also result in bearish sentiment, potentially establishing a downward trend.\n\nFurther complicating the picture is the volume profile. The descending volume as the price approaches the 50 EMA suggests a lack of conviction among traders, which could imply that the push to overcome this resistance might not be supported by strong buying pressure. In market terms, a decrease in volume during a price increase often precedes a reversal, indicating that the current movement might lack the necessary fuel to sustain a breakout."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE8yYUVGaHlOY002dnoyZHJLRmQtWVp0am1TUUpJNXgtX05BZl9fckZJV28yZnFEd1d6bWdPaXl5SE12aEU4NUo5Y2s5NkxMQVRmMVBaREg1bEYyenZzUHlLMFV0U3JDZ2JmYjlZQlVHa0R2a3I4eTM0R3dyVdIBgAFBVV95cUxQUGh6WHZiWVExRHNTRmJlNWtVWmxWVEpmVS1pWGpwUFZFaTdpdy16eS00d1d1SkNYODBGYXVJSEhCT1JLbGYxTFFaZlVid0VaLTZIem5fclk1aElSOFhiaUwyNUJPWkVqRDNiczBoUGIzZVRsaEVNQ3dmN1BhYzltVA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Feb 2024 08:00:00 GMT",
        "title": "Ethereum: How FTX, Alameda offloads can affect ETH - AMBCrypto News",
        "content": "ETH continued to trade above $2,300 despite the transfer.\n\nThe price might climb above $3,000 if market conditions improve.\n\nAccording to Spot On Chain, Ethereum [ETH] was part of the cryptocurrencies let go by defunct crypto exchange FTX and its sister firm Alameda.\n\nBased on the post, the firms sent 1,000 ETHs to Coinbase. However, the altcoin was not the only cryptocurrency affected by the sale.\n\nOthers included ALPHA, POWR, NEXO, and more. The sale was one of the numerous ones FTX and Alameda had been involved in recently.\n\nAs AMBCrypto reported earlier, the moves were in line with the go-ahead to offload some of their assets to pay back creditors and customers affected by the exchange crash.\n\nETH works under pressure\n\nHowever, ETH has been able to resist the selling pressure. At press time, the price of the altcoin was $2,321. According to the 4-hour chart, the 20 EMA (blue) and 50 EMA (yellow) were around the same area.\n\nThis trend suggested that ETH’s next direction looked indecisive. As such, the price might keep hovering around the $2,300 region.\n\nIn terms of the Accumulation/Distribution (A/D), the indicator showed that there has been more accumulation than distribution.\n\nThis was confirmation that the participants were taking advantage of the dip and buying Ethereum at a discount.\n\nIf accumulation intensifies more than it has recently done, then ETH’s price could rise to $2,500 in the short term.\n\nOn the other hand, a decline in the A/D would suggest distribution. If this is the case, ETH might become bearish while the price might fall as low as $2,215.\n\nHowever, this might not happen because of the signals shown by the Money Flow Index (MFI).\n\nThe MFI swings between 0 and 100. Values above 80 suggest that a cryptocurrency is overbought. On the other hand, a reading below 20 implies an oversold point.\n\nIn Ethereum’s case, the MFI was 64.25, indicating that the level of buying pressure was enough to keep ETH above $2,300.\n\nFair enough! But more could be on the way\n\nAMBCrypto proceeded to check the Market Value to Realized Value (MVRV) ratio. This ratio gives an idea if a cryptocurrency’s value is fair, undervalued, or overvalued.\n\nValues of 3.7 indicate price tops. But when the MVRV ratio is less than 1, it implies that the price might have hit the bottom.\n\nHow much are 1,10,100 ETHs worth today?\n\nETH’s MRVR ratio was 1.51 according to data from Glassnode. This ratio implies that the altcoin was changing hands at a fair value during press time.\n\nHowever, this also means that ETH’s long-term potential remains a bullish one. Should the market conditions improve, ETH’s price might jump and a move toward $3,500 could be plausible."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxQN3lYMjhUZHZZUEhfeEVsNlZ4UHdUbFp3bWNRcFdiMFNQN0ZIci1YcWExeTNSSnJEcDN4MXZQU1psY2docjZ1b05zNkFrY2dZVVdqTUNwVExGSDZxRzdBUUtudVlMdkwyMDU4TXFQT05qcEptdW9SS1dJRHdpdERkclhsZGE0NFIzLWNkUk54WmdJNzZvaXdQTTJvM1VaZzhGY0VVNkhfd2tvOWtOc1ZZVmt0UzZ2Z9IBuwFBVV95cUxQU3FmdERWa2ZGWHI5dmhEd3hDQVNndWtfS1JBaGQ4bktGSTRXamNuT2V0YlJFdzlTVnZDRGVOWDZfd1lHX3FtbHk3OGRjWDBWMUdvQS1RUU5LakpTNmRjM1lVcHUzLTh6UHRGNTBpSmdJRVV6Tm9UMDh6THhpcGI3Wkw2Q2FOTmxnYllDZXc1LXN3ZTdpVXlEVEJyRlM1djdXNjkxWUhJT2J1cnBHX0FkM1VRLTdwbVpNdU9n?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Feb 2024 08:00:00 GMT",
        "title": "Kelexo (KLXO) Cryptocurrency Sale Becomes Spotlighted in February as Ethereum Classic (ETC) and Cardano (ADA) Holders Remain Optimistic - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nIn the midst of a market resurgence, Ethereum Classic (ETC) and Cardano (ADA) holders eye potential profits, with Ethereum Classic’s (ETC) upside supported by discussions of an Ethereum ETF. Cardano (ADA) faces challenges but remains crucial at the $0.5 psychological support.\n\nAmidst this, Kelexo (KLXO) steals the spotlight, revolutionizing decentralized lending within Web3. The ongoing presale witnesses growing interest, offering profit-sharing opportunities, a Kelexo (KLXO) wallet-linked debit card and a disruptive approach to traditional lending processes. Kelexo's (KLXO) comprehensive ecosystem and ongoing success position it as a significant influencer reshaping the landscape of online lending in 2024.\n\nSupporters of Kelexo (KLXO) can take part in pre-sale and buy tokens here .\n\nEthereum Classic (ETC): A potential upside\n\nWith discussions about an Ethereum ETF in May 2024, Ethereum Classic (ETC) emerges as an intriguing option with the potential for sharper moves. As a smaller-cap coin compared to Ethereum (ETH), Ethereum Classic (ETC) presents a higher upside. The coin's current price, hovering around $24.45, indicates a potential uptrend continuation, supported by its resilience above the 38.20% Fibonacci level at $23.24.\n\nAdvertisement\n\nCardano (ADA): Navigating turbulent waters\n\nCardano (ADA) faces turbulent market conditions, reaching a critical psychological support level at $0.5. This level holds significance, triggering emotional trading decisions. Cardano’s (ADA) price action around this level is crucial, as a bounce could signal a potential reversal toward upper resistance levels. Conversely, a breach of the $0.5 support may lead to further declines, with key support at $0.4738 and a possible last stand at $0.42.\n\nKelexo (KLXO): Lending redefined within Web3\n\nKelexo (KLXO) is a unique decentralized lending platform that simplifies borrowing and lending using smart contracts. Investors are attracted by the opportunity for profit sharing and a Kelexo (KLXO) wallet-linked debit card for global transactions. The ongoing presale indicates a growing interest in decentralized financial solutions, positioning Kelexo (KLXO) as a notable player in the cryptocurrency world.\n\nThe platform's Web3 model, without Know Your Customer (KYC) requirements and featuring instant transactions, disrupts traditional lending processes burdened by bureaucracy. Kelexo (KLXO) addresses common issues like high fees, paperwork and limited access, making it an attractive alternative for borrowers and lenders. The ongoing presale reflects a growing interest in decentralized financial solutions.\n\nKelexo (KLXO) offers a complete system, including a worldwide spending debit card, immediate cryptocurrency exchanges with no fees and a rewards scheme. Those who invest early can receive a portion of the fees generated by the platform according to their holdings. The platform supports decentralized governance, enabling users to propose and vote on enhancements. Additionally, a VIP program provides users with account managers, cashback perks and interest payments, enhancing user involvement."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxNZmJxeGhNSzV6ZVJ6MFRzcUtNa3FXbU14MkxzNkE5bWozRDIwWlVFSmNmekw3eWxqT045cnFaVVY0cURBdFRWbHU1RmJaNzZzUnZwQnVPc1RSRUpnaEpNX2Z4YmRxOFFBY2FwVmNSWmV5NlpUcUNiSGhRZDdrN1Y5UFRxVUZxOTQ0UXoxeXlINFd4MDVMWHU4Yi1QR2w4MFRCNThTaFM4OHVkU2NVeWlTMWE2Vi1TOU80QW5JNGpPbW5nOVFTVVZXcWFwT1V5N1hMNVdKSNIB2gFBVV95cUxQdWdIbjVLb2hQNEF5ZzJUYWJGcW15TDJVZ1JtdDN5VUZVWlF2Nmh1MTRIVVVvX3gtWi15Z0tDVTRGdlluOXplWjFqSW40NjU3cEt2ZlUtWDRaT011c1FZN3VSNEJvMEp3UVQtcHJDd3d1RWZPM3NXcVpDUzJ0MGRoVERCSlc1bnJrbUpyTHNQb010U1o2VWdYVkhETkVzSFcxUlF0dUVKQ2owSVhTS2NJbVlXNmc0cEJ3dHFqYmU3M1dfY2R2VWZ3LW9nOHJSWUhWazhSOU5zcURmdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Feb 2024 08:00:00 GMT",
        "title": "Types of Cryptocurrencies: From Bitcoin to Altcoins and beyond - The Economic Times",
        "content": "Bitcoin (BTC): The Pioneer Cryptocurrency\n\nAltcoins: Diverse Alternatives to Bitcoin:\n\nStablecoins: Minimizing Volatility for Stability:\n\nUtility Tokens: Powering Blockchain Ecosystems:\n\n\n\nSecurity Tokens: Bridging Traditional Finance with Blockchain:\n\nPrivacy Coins: Enhancing Anonymity in Transactions:\n\nCentral Bank Digital Currencies (CBDCs): Government-Backed Digital Money:\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nCryptocurrencies have revolutionized the financial landscape, offering innovative solutions to traditional monetary systems. As digital assets built on blockchain technology, cryptocurrencies provide decentralized and secure transactions. However, the crypto space is not a monolith; it comprises various types of cryptocurrencies with distinct purposes and functionalities.Types of Cryptocurrencies:Bitcoin, created by an anonymous entity known as Satoshi Nakamoto in 2009, is the first and most well-known cryptocurrency. Often referred to as digital gold, Bitcoin operates as a store of value and a medium of exchange. Its primary focus is on security and decentralization, making it a preferred choice for long-term investment.Altcoins, or alternative coins, encompass all cryptocurrencies other than Bitcoin. These coins aim to address specific shortcomings in Bitcoin or introduce new features. Examples include Ethereum (ETH), Ripple (XRP), Litecoin (LTC), and many more. Ethereum, for instance, enables smart contracts and decentralized applications (DApps), expanding the use cases beyond simple transactions.Designed to minimize the volatility inherent in many cryptocurrencies, stablecoins are pegged to traditional fiat currencies like the US Dollar or commodities like gold. Tether (USDT), USD Coin (USDC), and DAI are popular stablecoins. These digital assets provide a reliable medium of exchange and a store of value while retaining the efficiency of blockchain technology.Utility tokens are native to specific blockchain platforms and serve as a means of accessing and utilizing features within that ecosystem. For example, Binance Coin (BNB) is used to pay for transaction fees on the Binance exchange, while Filecoin (FIL) is a utility token for decentralized file storage on the Filecoin network.Security tokens represent ownership of real-world assets such as real estate, stocks, or bonds. These tokens are subject to securities regulations, providing a bridge between traditional financial markets and blockchain technology. Security tokens offer fractional ownership and increased liquidity for traditionally illiquid assets.Privacy coins focus on enhancing user anonymity by implementing advanced cryptographic techniques. Monero (XMR) and Zcash (ZEC) are examples of privacy coins that prioritize transaction privacy and fungibility. These coins appeal to users seeking enhanced confidentiality in their financial transactions.Some governments are exploring or developing their own digital currencies, known as Central Bank Digital Currencies (CBDCs). CBDCs are digital versions of a country's fiat currency issued and regulated by the central bank. These digital currencies aim to provide the benefits of blockchain technology while maintaining control over the monetary system."
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE0wcnpGNEh3YWRscDJ4N0diT01nUk5ZUjNtTkpVdlBIb1pCY29FYTZxYUxnT3JCckhzc2N0anRxNXFTVFVleU1fSFdNRkoxNHJMenRTWWE4dzJzbjN5X0FQQ1NuTjk1cFJ5RXAyUFMwUkdLS3dyZkQwdDZBTFNFWTjSAYcBQVVfeXFMT1dfb0JVek5EbW4yQjQzanhiYkwxSjV0THU5bkswYmV2azNKbURhSWhQX2lGMjczVDFVYnlPT0lsQjFQMlpnSVVMMFhRQ2JBOThyNXVyQ194QW9tX1E2ZzRmU3dLckFWN29IbVJPX1pPeFZxOG1CcjZqa1hVWXFPZnpmR2pkT3NF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Feb 2024 08:00:00 GMT",
        "title": "What could happen to Ethereum in 2024? - Nairametrics",
        "content": "The prediction that the U.S. Securities and Exchange Commission (SEC) could approve the Ethereum Spot ETF by 2024 has sparked a lot of interest in the cryptocurrency world.\n\nThis event would be notable as it signifies the second time a cryptocurrency would be listed on the New York exchange, following the approval of the Bitcoin spot ETF earlier this year.\n\nDespite initial objections from some SEC officials, mounting pressure both internally and externally suggests that the regulator could finally give the Ethereum ETF the go-ahead.\n\nAnalysts believe the odds are high that several Ethereum ETFs will be approved this year. This forecast is based on a similar approval pattern as Bitcoin ETFs and the removal of Ethereum from the SEC’s list of unregistered securities.\n\nThis expectation has generated a climate of optimism among cryptocurrency investors, who expect greater diversification and accessibility in the financial market.\n\nIt is expected that Ethereum’s price could reach all-time highs again, reaching the $4,800.00 per ETH area following the ETF’s approval.\n\nAnalysts suggest that Ethereum may not follow the same volatility patterns as Bitcoin, which could contribute to greater stability in its value. In addition, the potential approval of the Ethereum ETF is expected to have a significant bullish impact on the market, especially since Ethereum’s Grayscale trust has a relatively small stake, meaning its liquidation would not exert significant selling pressure on ETH.\n\nThe eventual approval of the Ethereum ETF Spot could have a profound and lasting impact on the cryptocurrency market. In addition to representing greater legitimacy and accessibility for Ethereum, it is likely to generate renewed investor interest and wider adoption of the cryptocurrency across various financial sectors.\n\nIn conclusion, the potential approval of the Ethereum ETF generates positive expectations and could represent a milestone in the evolution of cryptocurrencies in traditional financial markets.\n\nThis event is seen as an important step towards legitimacy and wider acceptance of cryptocurrencies in mainstream finance. The decision by the U.S. Securities and Exchange Commission (SEC) could have a lasting impact on the market and spur greater investor interest in Ethereum.\n\nThe approval of this second ETF in 2024 has the potential to transform the global financial landscape and solidify the position of cryptocurrencies in the mainstream economy."
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMi3AFBVV95cUxOdVdQY3pTallIaUF6ZkFuV2NRMkpfVnJ3YlRMOUpqVldZbWRtdlZrVlNHY1VzdVJqTjdlU2dWb0xJckVvYW9iN2ZlLW8yRjRSUzBxa05rZDk5cS1tQjB0ZmFId1dZNVM5VXRUSTNlamxuVnFwSE1yZmFUdi1zMWxOVkZQdXROcWR2VVByVnEtR1VIQkFfc3dyemJxMDREeTAtSUtoZ3pKMFRYRjRPbjFQbWtabHVzYlJQNEZpMFZuQUtOYjZTMlRNT1BzRF9JZ29NM2pMR1dPV1BuZFdU0gHjAUFVX3lxTE9jUzBvUW9YLVZnSTJSR3NxNXozOExldVdUODVrTkRjTnczd2dkRVNsTlh6dlBNT0FTZndBX29qSEhXWFRlNlV4R25heVR4MVhyVFZhNGdEWFFuRGtITTFvM1drQ0d1ZjNtcUlaQmo2TlNtV3YzWkJhRlV1azF6ZTNfR2tWMjFERlo0cG5zNFpkdUg5UE1kMFYwRnlIaXRaNlI5TFFGTllQc1puTHlOYWZqamR6OTJTUnRQUUNvZDVrbUNHWVFyWUp5X0ptX1lOek1Ucm9QVmJWaWw3RGgwZUVNXzdz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Feb 2024 08:00:00 GMT",
        "title": "After spot Bitcoin ETFs, is the spot Ethereum ETF approval next in line? - The Financial Express",
        "content": "As far as cryptocurrencies are concerned, it seems that the buzz for exchange-traded funds (ETFs) is only getting started. Recently, the US Securities and Exchange Commission (SEC) approved 11 spot Bitcoin (BTC) ETF applications, which resulted in the cryptocurrency crossing the $47,000 level. Despite BTC’s volatile nature, this step is believed to have bolstered the cryptocurrency’s inclusion into traditional financial systems. So, what is next in store for this market? From what it’s understood, the Ethereum blockchain has emerged as a likely candidate for spot ETF approval. “I think Ethereum ETFs are investment funds that are traded on stock exchanges and track the price of Ethereum, the second-largest cryptocurrency by market capitalisation. These ETFs can allow investors to gain exposure to the price movements of Ethereum without owning the cryptocurrency itself. Investing in Ethereum ETFs can offer a way to gain exposure to Ethereum, which can bypass the complexities of cryptocurrency ownership,” Sumit Ghosh, co-founder and CEO, Chingari, a Web3.0 live streaming application, told FE TransformX.\n\nIn layman’s terms, an Ethereum ETF refers to a monetary instrument which helps supervise Ethereum’s price changes and allows its trading on conventional stock exchanges. Market research suggests that Ethereum ETF-based investments should be taken into account based on factors such as diversification, which allows expansion of one’s portfolio, liquidity, which enables share trading at stock exchanges, simplicity, which prevents one from the need of actually having Ethereum, accessibility, which permits Ethereum transactions using established brokerage accounts, and regulations, which keep Ethereum-based transactions under the supervision of conventional monetary markets. Going by media reports, a spot Ethereum ETF approval could be on its way as early as May 2024. While analysts of JPMorgan Chase & Co, a multinational finance corporation, have predicted a 50% chance of the spot Ethereum ETF approval happening in 2024, Matt Kunke, research analyst, GSR, a crypto market expertise platform, gave a 75% possibility through an official blog post. According to market experts, the principal cause behind SEC not yet authorising spot Ethereum ETFs is that the blockchain still hasn’t been classified as either a security or a commodity, which can lead to regulatory drawbacks.\n\n“I believe the Ethereum ETF approval would imitate the performance of Ethereum, providing access to Ether’s (ETH) value but without the difficulties that come with owning the crypto. Along with accessibility, diversification in investment portfolios is one of the benefits. Ethereum could be more accessible to traditional investors, thus increasing the adoption of ETH which would bring higher liquidity to the ETH market. It has a less chance of being approved because the SEC hasn’t given clarity on whether ETH is a security or not,” Roshan Aslam, founder and CEO, GoSats, a BTC rewards platform, highlighted.\n\nAlso Read New study reveals abundant water sources on the Moon and not just on poles Kerala HC denies bail to Malayalam actor Siddique amid ongoing investigation in alleged rape case Oppo Find X8 could beat Apple iPhone 16 in this area IMD predicts light to moderate rain as monsoon retreats, no heavy rainfall alerts for Sept 20 – Check region-wise forecast\n\nAlso Read HTS Solutions Pvt Ltd’s Pallav Agarwal on the need of affordable cloud solutions\n\nDespite mixed reactions around the Ethereum ETF approval timeline, market reports have shown Ethereum’s native cryptocurrency ETH to benefit largely from it. Insights from a report published by Standard Chartered, a multinational bank, has shown that ETH could clock a roughly 70% increase in value from its prevailing price and reach the $4,000 price level by May. Depending on how the spot BTC ETF approval increased ETH’s price by nine percent to a 20-month high within 24 hours, traders are expected to look forward to the spot Ethereum ETF approval for more rise in ETH value. Standard Chartered has also given the prediction that ETH wouldn’t have to endure the amount of selloffs that BTC endured after ETF authorisation. For example, the current Grayscale Ethereum Trust constitutes a lesser amount of total Ether market capitalisation in comparison to the BTC amount kept by Grayscale Bitcoin Trust (GBTC). Reportedly, platforms which have applied for spot Ethereum ETFs include Hashdex, Ark Invest, Grayscale, BlackRock, VanEck, Invesco-Galaxy, and Fidelity. Overall, the spot BTC ETF authorisation is understood to have set the tone for spot Ethereum ETF approval in the second and third quarters of 2024. As of February 6, 2024 (1.26 pm, Indian Standard Time), Ethereum’s value stood at nearly the $2,350 level with a total market capitalisation worth nearly $300 billion, as per CoinMarketCap, a crypto price-tracking website.\n\n“Looking ahead, the future of Ethereum ETFs seemingly depends on regulatory developments and market demand. If approved and launched in 2024, they could play a role in mainstreaming Ethereum and cryptocurrencies as investment assets. However, there are also risks and uncertainties, including regulatory hurdles and market volatility which could affect their success. Overall, Ethereum ETFs have the potential to reshape the crypto landscape by providing accessible and regulated investment opportunities for a wider range of investors,” Sathvik Vishwanath, co-founder and CEO, Unocoin, a cryptocurrency exchange, concluded.\n\nFollow us on Twitter, Facebook, LinkedIn"
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxOQ3N2ZXRrLUM3SXc2U2U3aURTUVFKRjFFTE5LaTdEanlONFNheEZDekEtWmVDMHF6NmxWdmpmQ2x4QVQyQ09adGhyVmVmc3lUd1NQcHBzNlJyVkh2RHY3ZFVrNFNmWEF3bnoyeURFc3BtYi1kYjV1cDhBQmRRZ3FBQ3hnUktlSjNwa1h3dkgtb3VtYVpENG9CLWNsVFl0Zw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Feb 2024 08:00:00 GMT",
        "title": "DeFi developer Ameen Soleimani takes another stab at peg-less stablecoin - DLNews",
        "content": "It’s a cypherpunk’s dream: a stable cryptocurrency backed entirely by Ether, rather than real-world assets under the purview of hostile governments.\n\nBut RAI never took off. Its founder, prominent Ethereum developer Ameen Soleimani, hopes a newer version called HAI will prove decentralised stablecoins can thrive without being wedded to the dollar and, in turn, a central bank he believes is hellbent on gradually inflating away its value.\n\nPeople who hold a related token, KITE, will govern HAI. Beginning today, people who’ve used RAI and the Optimism blockchain can check their eligibility for a February 13 airdrop of KITE.\n\n“I would like to have money that doesn’t get rugged — for me, for my friends, for everybody on the planet,” Soleimani told DL News.\n\n“By providing an alternative, it’s a check on other systems that might try to exploit you. So it’s similar in ideology to Bitcoin.”\n\nBitcoin’s proponents consider it a decentralised hedge against inflation, an appreciating asset beyond the reach of governments that often wield their control of money to cow dissidents. But it has been too volatile to serve as “electronic cash” as first envisioned.\n\nCrypto developers have long sought to fix that by creating decentralised stablecoins such as RAI and Liquity’s LUSD. They have been mostly popular with DeFi natives, but Soleimani hopes that HAI, which is slated to launch February 20, will appeal to a broader range of people due to it its lower cost and a greater range of collateral assets.\n\nRAI vs HAI vs DAI\n\nLiquity accounted for a paltry 0.13% of the stablecoin market at the end of 2023, according to stablecoin ratings firm Bluechip. With a market capitalisation just under $5 million, RAI was even smaller: its share of the market was just 0.01%.\n\nJoin the community to get our latest stories and updates\n\nAbout $23 million in Ether backed RAI as of Tuesday.\n\nThat’s partly because both rely solely on deposits of Ether to back their stablecoins. That became less appealing after a pair of Ethereum upgrades that de-risked staking, a process in which investors lock up their Ether for a modest annual yield.\n\nUnlike RAI, HAI can be minted against multiple forms of collateral, such as Optimism’s OP and liquid staking tokens like stETH. Users who hold a separate token called KITE will have a say over what collateral HAI will accept.\n\nIn a February 12 airdrop, the developers behind the new stablecoin will give away one-fifth of the KITE supply to about 18,000 crypto wallets that belong to people who have used RAI, Optimism, and a prototype version of HAI.\n\nHAI will exist on Optimism, a low-cost blockchain that settles on Ethereum for security purposes, technically called a layer 2 blockchain.\n\n“We wanted to have multiple forms of collateral so that we could work with a broader base of users,” Soleimani said, “and we wanted to do it on a Layer 2 so that we could actually have smaller value loans and more everyday users can use it instead of, like, rich Ethereum whales.”\n\nAnother decentralised stablecoin, Maker’s DAI, gradually lost that moniker as it accepted greater amounts of centralised collateral in the form of USDC and US Treasuries.\n\nSoleimani said HAI could guard against mission drift by requiring a higher voting threshold to add collateral than to change other parameters; by delaying implementation of new collateral after a vote, giving anyone unhappy with the decision the opportunity to exit their position; and by limiting the amount of certain collateral users can deposit to mint HAI.\n\n‘Make more float coins’\n\nHAI will also start trading at $1, rather than RAI’s arbitrary $3.14 soft peg. RAI floats freely against that peg, but never too far from it. Similarly, HAI is expected to gradually drift from $1.\n\nSoleimani has taken to calling these tokens “float coins.” He hopes their popularity will show people that “stability” is not synonymous with tracking the value of the dollar.\n\nMarket values of top stablecoins\n\nTo ensure stability, it uses a self-correcting mechanism akin to a Chinese finger trap: the more someone tries to manipulate its value on the market, the more expensive the effort becomes.\n\nThe mechanism has worked well for RAI: according to data gathered by pseudonymous data analyst Kyoronut, RAI has been less volatile relative to the dollar than other world currencies.\n\nWhile Soleimani hopes HAI becomes a popular stablecoin, its market capitalisation isn’t the only measure of success, he said.\n\nHAI’s code is easy to copy, tweak, and deploy. Soleimani wants people to take advantage of that.\n\n“Make more float coins,” he said.\n\n“In the future that I want, instead of, like, going to the bank to get a loan against your farm or whatever, you and your friends — high tech farmers — would be able to make your own bank. You would have the digital tools to do so.”\n\nCorrection: This article was updated on January 7 to clarify that 18,000 wallets will receive KITE in an airdrop. The article originally stated 18,000 KITE would be distributed in the airdrop."
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxNRDZCNnJNZlNHUEhCZkVqUVJqajFGbzVKUjl0N1RpNHBqR2ZhWWlzSVZjN05XTzlscVF6Nlg2dUllYW9WS2syUjZ2RFhhb1JUV3VGUUJOclhzWGRCelpYWk16YTRTc2F4bUQ2c3ljR09WaWY4OWdtQTNYVzNWYkNlRWNVd29ITFBVdUZnNHNVSl9JQWJjYjRvMFdn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Feb 2024 08:00:00 GMT",
        "title": "Ronin is making a comeback two years after its $624m hack - DLNews",
        "content": "A version of this story appeared in our The Decentralised newsletter. Sign up here.\n\nGM, Tim here.\n\nHere’s what caught my DeFi-eye recently:\n\nAxie Infinity’s Ronin blockchain is making a comeback\n\nA new liquid restaking protocol wants to ‘vampire attack’ Lido\n\nThe Curve team is gearing up for another big launch\n\nRonin trading volume and TVL soar\n\nOn March 23, 2022, the bridge connecting the Ronin blockchain to Ethereum was hacked for $624 million, the biggest onchain crypto hack ever.\n\nThe situation looked bleak. In addition to the huge loss, user activity on Axie Infinity, the Ronin Blockchain’s flagship game, plummeted.\n\nFast-forward two years, and despite the odds, Ronin is thriving again. On Monday, Binance listed the blockchain’s RON token for trading after a 74% rally since the start of the year.\n\nThe RON token now trades higher than before the Ronin bridge suffered a $624 million hack in 2022 (CoinGecko)\n\nRonin is a so-called layer 1 blockchain. It was originally launched as a low-cost alternative to Ethereum.\n\nIn recent months, activity on Ronin has spiked. Trading volume on the blockchain is up 54% this week, while total value locked — a measure of funds locked in protocols on Ronin — jumped 28% this month.\n\nJoin the community to get our latest stories and updates\n\nGames such as Pixels have brought a new wave of users to Ronin, while existing projects — like early NFT franchise Cyberkongz — are planning to migrate to Ronin.\n\nRonin’s recent success could be a bellwether for a wider resurgence in crypto gaming, following its boom and bust during the previous bull market.\n\nPuffer Finance wants Lido’s blood\n\nPuffer Finance, a new entrant to the nascent liquid restaking sector, has drawn in over $440 million in deposits in less than a week.\n\nPuffer isn’t just competing against rival liquid restaking protocols like Kelp DAO and ether.fi — it wants to take on Lido, the biggest liquid staking protocol with more than $21 billion of deposits.\n\nIt plans to conduct what’s known in DeFi circles as a vampire attack — a type of aggressive growth strategy where a protocol targets users of a rival protocol by offering additional incentives.\n\nPuffer requires users to lock up Lido’s stETH to mint its restaking token called pufETH. Once the protocol fully launches later this year, Puffer will convert the stETH tokens backing pufETH into Ether and restake them itself in permissionless validators.\n\nIf successful, the plan should help chip away at Lido’s market dominance — a hot issue within the Ethereum community.\n\nCurve isolated lending is coming\n\nThe team behind decentralised exchange Curve Finance and the crvUSD stablecoin is about to launch its own lending market.\n\nDubbed Llamalend by the Curve community, the new protocol will allow users to borrow and lend using any Ethereum-based crypto as collateral. It uses the LLAMMA soft liquidation mechanism outlined in Curve co-founder Michael Egorov’s crvUSD whitepaper.\n\nThis means that instead of loans hitting an all or nothing liquidation threshold — as they do on other lending markets such as Aave — Llamalend will liquidate delinquent positions gradually. The algorithm can even buy back sold collateral if prices recover.\n\nEgorov told DL News that he tentatively expects Llamalend to launch by the end of the week.\n\n(Full disclosure, DL News’ founders were core contributors to the Curve protocol.)\n\nData of the week\n\nThe Ronin blockchain’s TVL has increased 250% over the past three months. And since the start of the year, the number of stablecoins on Ronin has also jumped 36%.\n\nThe fact that users are depositing stablecoins to Ronin is important. It shows that the TVL increase isn’t just due to the price increases of tokens already on Ronin, and that users are depositing new funds to the blockchain.\n\nAfter a long period of inactivity, stablecoin deposits to the Ronin blockchain are increasing. (DefiLlama)\n\nThis week in DeFi governance\n\nTEMP CHECK: Uniswap set to greenlight deployment on Zora\n\nVOTE: Frax makes more progress toward onchain US Treasury bills\n\nVOTE: Arbitrum DAO wants to diversify its holdings with real-world assets\n\nPost of the week\n\nMemecoins broke through into the real world this week after someone adorned the iconic raging bull statue near Wall Street with a pink crocheted hat — a nod to Solana memecoin dogwifhat.\n\nIt’s not the first time memecoin investors have pulled a similar stunt. In 2021, pictures of the giant brass bull facing off against a Shiba Inu went viral in appreciation of Dogecoin.\n\nYes this is real pic.twitter.com/oAKRJv2H1J — OJC 💫 𓃓 (@OjCrypto) February 2, 2024\n\nYes this is real pic.twitter.com/oAKRJv2H1J — OJC 💫 𓃓 (@OjCrypto) February 2, 2024\n\nWhat we’re watching\n\nI'm excited to share our latest research on adjusting the block gas limit.\n\nTogether with @VitalikButerin, we're exploring paths to reduce the maximum block size, balance calldata pricing, and ultimately raise the block gas limit.https://t.co/Thvyw9Yog3 — Toni Wahrstätter ⟠ (@nero_eth) February 5, 2024\n\nI'm excited to share our latest research on adjusting the block gas limit.\n\nTogether with @VitalikButerin, we're exploring paths to reduce the maximum block size, balance calldata pricing, and ultimately raise the block gas limit.https://t.co/Thvyw9Yog3 — Toni Wahrstätter ⟠ (@nero_eth) February 5, 2024\n\nEthereum Foundation researcher Toni Wahrstätter and Ethereum co-founder Vitalik Buterin have co-authored a proposal to increase the block gas limit and the price for nonzero calldata bytes.\n\nDoing so, they argue, should reduce block sizes and incentivise the transition to using blobs for data availability.\n\nGot a tip about DeFi? Reach out at tim@dlnews.com."
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxQLXZqVXJmUFNpTDVjRmVCX1BaWE55cXp6clhOQlZiRWc1VEJ3WFptTGZfYVFwNjZJVWxnM0NueDNrMFJ1UWZDelpacmVkVWZ6d0p2bHFnVjZ5dXNTSW4wMlVWcm5zU3hBN0VhYklCaTBqb2VPbnVvZU1La29BRDVQTXR1ZFVQNnRhZHBPZ0xqWXVtV0hfRHd3TXVzUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Feb 2024 08:00:00 GMT",
        "title": "Farcaster NFTs are already selling for thousands of dollars. Here’s why - DLNews",
        "content": "Crypto’s latest decentralised social media app has taken center stage as users are now busy trading Farcaster IDs.\n\nEarly IDs have been eligible for various airdrops, likely driving trading activity.\n\nFarcaster is crypto Twitter’s main character these days, attracting interest from many crypto notables, including Ethereum co-creator Vitalik Buterin.\n\nTrading on Farmarket is booming, with users spending large on Farcaster IDs.\n\nSo far, the highest-selling FID on the Farcaster account marketplace earned the previous owner almost $7,000 in Ethereum.\n\nEarly joiners to Farcaster, an Optimism-based social media platform, claimed low FIDs — between one- to five-digit IDs. FIDs have now reached the six-digit level.\n\nFarcaster IDs are displayed as digits, with lower digit IDs attracting higher bids. They are also NFTs that can be bought and sold.\n\nUsers are offering each other as much as $34,000 for account NFTs on the Farcaster account marketplace FarMarket. (FarMarket)\n\nInterest in low FIDs is likely tied to some Farcaster apps having started airdropping viral meme coins to low-digit FIDs. One token called DEGEN has already surged 800% since late January, CoinGecko data shows.\n\n“I think this is a fad that will die soon, and [that] is why I immediately listed my ‘rare’ FID for a reasonable price — top sale at the moment for 3 ETH,” pseudonymous X user kcaz told DL News, referring to the hype around low FIDs.\n\nThey were the ones that sold the FID worth nearly $7,000, ID #4323.\n\nSecondary markets all the way down\n\nLaunched in August 2022, the protocol has over 293,000 users from over 41,000 Ethereum wallets and has already attracted several notable crypto personalities, including Ethereum co-creator Vitalik Buterin.\n\nJoin the community to get our latest stories and updates\n\nSpeculative interest in low-digit crypto IDs is not a new phenomenon.\n\nLow-digit Ethereum Name Service names have also sold for thousands of dollars in the past with 000.eth selling in July 2022 for 300 ETH, worth $315,000 at the time.\n\nAs was the case for digit-ENS domains, tiered floor prices have also emerged for FIDs based on how low they are. The floor price is the lowest offer for an NFT and can be used to calculate the minimum value of an NFT collection.\n\nFIDs lower than 20,000 currently have a floor price of a few hundred dollars, Farmarket data shows.\n\nFarcaster on the rise\n\nThe speculative FID trend comes amid a broader increase in Farcaster adoption metrics.\n\nThe protocol’s daily active user count soared 400% last week, coinciding with the protocol’s launch of Frames — a feature letting users turn social posts on Warpcast into mini-apps for use cases like NFTs and gaming.\n\nWarpcast is one of the many apps built atop the Farcaster protocol. Many are touted as decentralised alternatives to popular web2 social media platforms. Warpcast is similar to X, formerly Twitter. Fancord resembles Discord.\n\nWhile Farcaster has enjoyed soaring metrics, its competition struggles to maintain pace.\n\nFriend.tech, last year’s dominant SocialFi protocol, has seen its user numbers plummet 96% from its peak in September.\n\n“Bad gamefi is using financial speculation as a substitute for fun,” tweeted Buterin, responding to commentary on Friend.tech’s recent drop in user activity. “I believe a similar thing for crypto social.”\n\nThe Ethereum co-creator predicted that Farcaster, along with another web3 media protocol Lens, “will not be deserted in 4 months, or 1 year.”\n\nOsato Avan-Nomayo is our Nigeria-based DeFi correspondent. He covers DeFi and tech. To share tips or information about stories, please contact him at osato@dlnews.com."
    },
    {
        "id": 73,
        "url": "https://news.google.com/rss/articles/CBMi-gFBVV95cUxOeXZFenNzczdCWTF3T2hYYVNyMHNZcUxTTjItQ1AwbFVlZ2RoR3pzczR1ZjRIZmFtd0FhUkdkMHJrLVVHOV9XZU92eWdtZENZYmRRLXY4OS1qd2pkRm5XMVltZmc2X3pWRU1uOHN5bXNqeXlXcG91aEZZUzN6VWpiMVR5RWstNlhiNEZScWlqRDItdy1WRllhTDd0dkNObmRpZ3R5TnhQZ3RScTJkTkkyZTdRQmlEYjdyV3Z0cGI0cTRtVDF3a0h2WGxVR09Ycm9pclBGM05uNENUaHFlVm9YSXpGSFpEOFhhVm1lbWtnMGZKVUZBdGVQblVn0gH_AUFVX3lxTE5iTk1rc3R4OVFPdDY4UTFYZE1xVjUzVHZENVhjLVhkTGFEZ2hodHpfcWNxWThQN1Y2TzFMNVVaem1USldwMFB4VENlYXhLZDJwYXZCeG12OGQ1U0xOSjNYdGRLNF9qSlBrSGV3Tm95a21MbERORDFQM1p2eVNiMWEtb3pyRjNZZTkwRDltS0pZRElNVFotY1NGVzVvbEI4NGxvSEtCVDBxQmx4RU1hb0R0QkFZbXkzLU40dGlWSl9QbWxjSEpUM3ZOMXlHNDF0NmRjQjA3MWlfRVZrQ0ZpaDhRNXAzUVMtamlUTmRERm9Rekxwc0oyQmJxR1JtdjhjVQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Feb 2024 08:00:00 GMT",
        "title": "Cryptocurrency Price Today: Bitcoin Dips Below $43,000, Ronin Loses Over 25% - ABP Live",
        "content": "Bitcoin (BTC), the oldest and most valued cryptocurrency in the world, dipped below the $43,000 mark early Tuesday. Other top coins, including the likes of — Ethereum (ETH), Dogecoin (DOGE), Solana (SOL), Ripple (XRP), and Litecoin (LTC) — saw minor gains and losses across the board. The Ethereum Name Service (ENS) token emerged to be the biggest gainer of the lot, with a 24-hour jump of over 13 percent. Ronin (RON), on the other hand, became the biggest loser, with a 24-hour dip of over 25 percent.\n\nThe global crypto market cap stood at $1.64 trillion at the time of writing, registering a 24-hour gain of 0.42 percent.\n\nBitcoin (BTC) Price Today\n\nBitcoin price stood at $42,792.43, registering a 24-hour gain of 0.27 percent, as per CoinMarketCap. According to Indian exchange WazirX, BTC price stood at Rs 37.74 lakh.\n\nEthereum (ETH) Price Today\n\nETH price stood at $2,312.58, marking a 24-hour gain of 0.81 percent at the time of writing. As per WazirX, Ethereum price in India stood at Rs 2.02 lakh.\n\nDogecoin (DOGE) Price Today\n\nDOGE registered a 24-hour jump of 0.21 percent, as per CoinMarketCap data, currently priced at $0.07834. As per WazirX, Dogecoin price in India stood at Rs 6.90.\n\nLitecoin (LTC) Price Today\n\nLitecoin saw a 24-hour gain of 0.86 percent. At the time of writing, it was trading at $67.73. LTC price in India stood at Rs 5,871.87.\n\nRipple (XRP) Price Today\n\nXRP price stood at $0.5066, seeing a 24-hour jump of 0.17 percent. As per WazirX, Ripple price stood at Rs 44.50.\n\nSolana (SOL) Price Today\n\nSolana price stood at $95.92, marking a 24-hour dip of 0.95 percent. As per WazirX, SOL price in India stood at Rs 8,401.\n\nTop Crypto Gainers Today (February 6)\n\nAs per CoinMarketCap data, here are the top five crypto gainers over the past 24 hours:\n\nEthereum Name Service (ENS)\n\nPrice: $20.80\n\n24-hour gain: 13.70 percent\n\nSui (SUI)\n\nPrice: $1.59\n\n24-hour gain: 8.87 percent\n\nOptimism (OP)\n\nPrice: $3.21\n\n24-hour gain: 7.02 percent\n\nGnosis (GNO)\n\nPrice: $231.89\n\n24-hour gain: 6.05 percent\n\nImmutable (IMX)\n\nPrice: $2.26\n\n24-hour gain: 5.97 percent\n\nTop Crypto Losers Today (February 6)\n\nAs per CoinMarketCap data, here are the top five crypto losers over the past 24 hours:\n\nRonin (RON)\n\nPrice: $2.53\n\n24-hour loss: 25.69 percent\n\nPyth Network (PYTH)\n\nPrice: $0.465\n\n24-hour loss: 7.43 percent\n\nFlare (FLR)\n\nPrice: $0.02913\n\n24-hour loss: 6.67 percent\n\nInternet Computer (ICP)\n\nPrice: $12.17\n\n24-hour loss: 6.19 percent\n\nOasis Network (ROSE)\n\nPrice: $0.1121\n\n24-hour loss: 3.55 percent\n\nWhat Crypto Exchanges Are Saying About Current Market Scenario\n\nMudrex co-founder and CEO Edul Patel told ABP Live, “Bitcoin held its position above the $42,000 mark despite a 14 basis points increase in the 10-year US Treasury bond yield. Federal Reserve Chair Jerome Powell's statement that the Fed had little intention to cut rates in March did not shake the bullish sentiment, with the $42,000 level being defended. Despite this, the $42,000 level has seen defence by bullish investors. The next resistance for BTC is at $43,800, with support at $41,300. Meanwhile, Ethereum is presently at the $2,300 mark, with a potential bullish move anticipated if it surpasses $2,400, aiming for $2,600. Until then, Ethereum is expected to trade sideways.”\n\nCoinSwitch Markets Desk noted, “As BTC has been trading in a narrow channel for more than a week now, the up-trend still remains intact with $42k being the level to break on the down side and $44k on the up-side. However with Blackrock now holding more than $2 billion worth of BTC, bears will have to instill some massive amount of fear for breaking it to the downside. One of the biggest news from yesterday came from GoDaddy. The company announced that its users can now link domain names with Ethereum Name Service, ENS (+13%) at no extra cost. This is a big boost for both Ethereum (+1.68%) and the ENS token.”\n\nRajagopal Menon, Vice President, WazirX, said, “The potential liquidation of Genesis's assets could exert a negative impact on market prices. The selling pressure that started after the approval of spot BTC ETFs persists, influencing the market ahead of the anticipated Genesis sell-off. Bitcoin's price has retreated from $43,000 levels and faces a challenging struggle to avoid a further decline back to the $40,000 support level, which held during the bullish market sentiment at the end of last year. Ethereum's pricing signals indicate overbought conditions, suggesting a potential lull at the resistance level and a possible market downturn. Contrary to market expectations of a rally, XRP continues its downward trajectory, surprising investors. The Relative Strength Index signals oversold conditions amid a bearish sentiment, with moving averages indicating a prevailing 'Sell' sentiment.”\n\nShivam Thakral, CEO of BuyUcoin, said, “The total crypto market cap stands around $1.64T, a 0.73% increase over the last day. The selling pressure by Grayscale which has sold 141,00 Bitcoin is being absorbed by 175,000 Bitcoin bought through ETFs.The Cumulative spot Bitcoin ETF volume has also crossed the $30B threshold reflects a huge demand for Bitcoin in the Spot ETFs. Bitcoin has persistently attempted to breach the $44,000 level for several weeks but it has been hindered by low trading volume.”\n\nSathvik Vishwanath, CEO and co-founder of Unocoin, said, “Bitcoin's January surge in trading volume to $16.01 billion, the most since September 2022, pushed its value past $43,000. Factors such as reduced grayscale bitcoin sales and a strong US stock market contributed to this. Upcoming events, including the US Federal Reserve meeting, can affect market trends. Despite the potential uncertainty, Bitcoin's market capitalization rose 2% to $1.66 trillion in 24 hours. Federal Reserve Chairman Jerome Powell's plan to cut interest rates three times in 2024 aims to take advantage of the strong US economy and control inflation. Crypto analyst DonAlt predicts that Bitcoin could reach $60,000 if it clears key barriers and maintains a bullish outlook.”\n\nCoinDCX Research Team told ABP Live, “In the past 24 hours, the crypto market initially remained stable but later saw a decline, impacted by the fall in the US market and Coinbase shares. The overall market has been relatively quiet recently as BTC consolidates around the $43,000 level. However, on a higher time frame, BTC exhibits a bullish trend with confirmations from EMAs. ETH is following a similar price action to BTC, and both cryptocurrencies need to break out of their current consolidations to signal a significant move in either direction.”\n\nSubscribe And Follow ABP Live On Telegram: t.me/officialabplive\n\nDisclaimer: Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Cryptocurrency is not a legal tender and is subject to market risks. Readers are advised to seek expert advice and read offer document(s) along with related important literature on the subject carefully before making any kind of investment whatsoever. Cryptocurrency market predictions are speculative and any investment made shall be at the sole cost and risk of the readers."
    },
    {
        "id": 74,
        "url": "https://news.google.com/rss/articles/CBMi-gFBVV95cUxQVHhWQXRQODZic0FWMlI4WnFEUDUtN1NndGlDS05CanlZR2k4VFNxazA4cVhlWHBhVm92MEJuQXlzUnpJaFRxWGVPNTUxLVIySzdKMjBkZUZKZmxNM1JmamZrYkdTZWc2emhhX0lnLWZBczRTcS12a3d3aU9KZ3BVSnlRUVBZYkpRZVE1a1ItRVRIRUlqSVpmOEtnaDB1SmxVT21LcUZCbk1CTDFqUXg2V0Z5dGx4b1UwT2pRYVQxaWxSTWFnM3Z5RnVzLS1TVm91VzRmeVJkR2puVERuUVh3bmc1NkRKV2dieFVIMWRHT3MzM3pwZnpzei130gH_AUFVX3lxTE1TaXJjd1p0NmhWQ2dURXpUQ2dGaHk5dVZzVGpvWXF6RVREMUR6UUUxemJnNUx5ZlZMNkxXVnBITXVsbTRLTGwtNXlXNXEtRTBWUno3czNpbThNeWIxLUoxZnRIMWpzX09CcjhWbjB3MzZ3Z1FvVVRHT2taRDRVUV9rU21GWWhMUHJTNFhLTHhrOG9DSGNmTUdJMGJqanlZSy1VblJ0OFRXSzVTUGQyaFFuUnlQN3JxMjZTZHZmUjJ6M2hnbWdOdUdRTUdfRS1LM0NkSWFPNzVPbUdSODM2OEFTTW1yeFhFVDQ2RWc0eTQyMTh1MHpDMmFsc2tmamRjRQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Feb 2024 08:00:00 GMT",
        "title": "Cryptocurrency Price Today: Bitcoin Nears $43,000 Mark, Dymension Gains Nearly 25% - ABP Live",
        "content": "Bitcoin (BTC), the oldest and most valued cryptocurrency in the world, remained within the $42,000 range early Wednesday. Other top coins, including the likes of — Ethereum (ETH), Dogecoin (DOGE), Solana (SOL), Ripple (XRP), and Litecoin (LTC) — saw minor gains and losses across the board. The Dymension (DYM) token emerged to be the biggest gainer of the lot, with a 24-hour jump of nearly 25 percent. Monero (XMR), on the other hand, became the biggest loser, with a 24-hour dip of over 27 percent.\n\nThe global crypto market cap stood at $1.65 trillion at the time of writing, registering a 24-hour gain of 0.37 percent.\n\nBitcoin (BTC) Price Today\n\nBitcoin price stood at $42,901, registering a 24-hour gain of 0.22 percent, as per CoinMarketCap. According to Indian exchange WazirX, BTC price stood at Rs 37.75 lakh.\n\nEthereum (ETH) Price Today\n\nETH price stood at $2,361.77, marking a 24-hour gain of 2.07 percent at the time of writing. As per WazirX, Ethereum price in India stood at Rs 2.07 lakh.\n\nDogecoin (DOGE) Price Today\n\nDOGE registered a 24-hour jump of 0.21 percent, as per CoinMarketCap data, currently priced at $0.07849. As per WazirX, Dogecoin price in India stood at Rs 6.88.\n\nLitecoin (LTC) Price Today\n\nLitecoin saw a 24-hour gain of 0.07 percent. At the time of writing, it was trading at $67.83. LTC price in India stood at Rs 5,888.\n\nRipple (XRP) Price Today\n\nXRP price stood at $0.5044, seeing a 24-hour dip of 0.39 percent. As per WazirX, Ripple price stood at Rs 44.44.\n\nSolana (SOL) Price Today\n\nSolana price stood at $95.38, marking a 24-hour dip of 0.27 percent. As per WazirX, SOL price in India stood at Rs 8,322.01.\n\nTop Crypto Gainers Today (February 7)\n\nAs per CoinMarketCap data, here are the top five crypto gainers over the past 24 hours:\n\nDymension (DYM)\n\nPrice: $4.99\n\n24-hour gain: 24.92 percent\n\nWOO (WOO)\n\nPrice: $0.3549\n\n24-hour gain: 5.90 percent\n\nRonin (RON)\n\nPrice: $2.67\n\n24-hour gain: 5.26 percent\n\nSynthetix (SNX)\n\nPrice: $3.24\n\n24-hour gain: 4.80 percent\n\nPyth Network (PYTH)\n\nPrice: $0.4858\n\n24-hour gain: 4.44 percent\n\nTop Crypto Losers Today (February 7)\n\nAs per CoinMarketCap data, here are the top five crypto losers over the past 24 hours:\n\nMonero (XMR)\n\nPrice: $120.06\n\n24-hour loss: 27.82 percent\n\nFrax Share (FXS)\n\nPrice: $9.15\n\n24-hour loss: 9.40 percent\n\nFlare (FLR)\n\nPrice: $0.02751\n\n24-hour loss: 6.29 percent\n\nChainlink (LINK)\n\nPrice: $18.24\n\n24-hour loss: 3.89 percent\n\nCelestia (TIA)\n\nPrice: $17.27\n\n24-hour loss: 3.42 percent\n\nWhat Crypto Exchanges Are Saying About Current Market Scenario\n\nMudrex co-founder and CEO Edul Patel told ABP Live, “After a few days of decline, Bitcoin rebounded, reaching $43,000 in the last 24 hours. BTC is currently consolidating above the $42,500 support zone but has not yet surpassed the $43,500 resistance, indicating a potential lack of momentum for a substantial upward movement. If BTC closes below the support level, a bearish trend may follow. Meanwhile, Ethereum is making efforts to stabilize above $2,328, with the next resistance at $2,400.”\n\nCoinSwitch Markets Desk noted, “As BTC (+0.3%) continues to trade in the uptrend narrow channel, its volatility continues to be on the lower side. BTC has already printed five consecutive monthly green candles in the wake of the recent ETF and upcoming halving in April. It should be interesting to see if we see one more monthly green close as it has only happened once in the last 7 years. Facing headwinds, XMR saw a decline of 30% after Binance delisted the privacy token. According to @monero handle on X, the delisting is happening because the exchange requires all deposits to come from a publicly transparent address, which is not possible by design for a privacy coin like XMR. Its futures pair however will continue to trade as usual.”\n\nSathvik Vishwanath, CEO and co-founder of Unocoin, said, “Bitcoin recently fell below $43,000 amid swings in the US stock market, yet held resiliently above $42,000, supported by \"buy the dip\" sentiment. Despite rising US Treasury yields and Powell's remarks tempering rate cut expectations, Cathie Wood's bullish stance attributing Bitcoin as \"digital gold\" boosts investor confidence. Conversely, the approaching Hong Kong crypto exchange licensing deadline brings initial uncertainty, but underscores growing acceptance by regulators, potentially strengthening bitcoin's legitimacy and stability. Technical analysis shows Bitcoin facing resistance at $42,895 and support at $41,444, with RSI indicating balance and MACD indicating bearish pressure. Overall, Bitcoin's cautious market stance suggests optimism above $42,200, signaling potential upside momentum if it sustains or breaks through.”\n\nRajagopal Menon, Vice President, WazirX, said, “Bitcoin's pre-halving surge has overshadowed market sentiment related to the Federal Reserve's interest rate decisions. In recent weeks, increased activities on the Bitcoin network and growing use cases for BRC 20 have driven prices upward, despite uncertainty surrounding Genesis's asset sell-off. Bitcoin’s price movement is predicted to be stable with an increased inflow leading up to the pre-halving stage and ETF exposure. While the market is still moving sideways, it has managed to ward off volatility despite external conditions.”\n\nShivam Thakral, CEO of BuyUcoin, said, “The Crypto market has experienced a slight increase overnight with Bitcoin regaining $43,000 and Ethereum almost crossing $2400. Market data shows that institutional investors remain highly bullish on Bitcoin. Microstrategy, a business intelligence enterprise known for its strong Bitcoin support has reported the acquisition of an additional 850 BTC for $37.2 million and now holds a total of a staggering 190,000 BTC. At the same time,the Bitcoin spot ETF craze has not slowed down as BlackRock and Fidelity now own a combined of 138,489 BTC which is roughly worth around $5.9 billion in Bitcoin. All these moves only reflect positive institutional sentiments around Bitcoin before the halving.”\n\nCoinDCX Research Team told ABP Live, “In the past 24 hours, the crypto market stayed stable, with ETH showing stronger performance compared to BTC, as indicated by the rising ETH/BTC pair. BTC continued to hover below the crucial resistance zone of $44,000-$45,000, remaining in a consolidation phase.ETH, on the contrary, approached the upper boundary of its range at $2,380, currently holding just below it. It's also above the 20 and 50 Exponential Moving Averages (EMA), which is a positive signal.”\n\nSubscribe And Follow ABP Live On Telegram: t.me/officialabplive\n\nDisclaimer: Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Cryptocurrency is not a legal tender and is subject to market risks. Readers are advised to seek expert advice and read offer document(s) along with related important literature on the subject carefully before making any kind of investment whatsoever. Cryptocurrency market predictions are speculative and any investment made shall be at the sole cost and risk of the readers."
    },
    {
        "id": 75,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTFBGd3ZjRm9fd1UxVGV3ZUk4YWdEZ0p6UUdlSzR2VEFKeElHRURVX1ZBdVZHNEhCOWFEZFVKTTNVYVRUMTlWZ0JNQVFkZVFmREtnc2pQMzRGSXNnWUhLWDBldlptZmo0S1NwTWxUT1ZGQUVvQUhpRU5USGE5NExVQdIBggFBVV95cUxPUTMxX0tUR0JzZGg5X3JqbmtXUXFLT2tiNUxlOXFTQ2pGWjRMZ3d0OHkyanM4S0REdUY3WHpaU3B1MFNTMlVrbFQ5dGg0SW83blVWZUNUaWdZWU9qZnN0MkpvdU5qUENtZXB4S1hiQ2RWWFhXVWY1SWtUeFFabW1SWktn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Price Prediction – ETH Price Estimated to Reach $ 2,538.89 By Feb 11, 2024 - CoinCodex",
        "content": "Disclaimer: This is not investment advice. The information provided is for general purposes only. No information, materials, services and other content provided on this page constitute a solicitation, recommendation, endorsement, or any financial, investment, or other advice. Seek independent professional consultation in the form of legal, financial, and fiscal advice before making any investment decision.\n\nEthereum is up 3.17% today against the US Dollar\n\nEthereum is currently trading 6.09% below our prediction on Feb 11, 2024\n\nEthereum gained 6.35% in the last month and is up 44.19% since 1 year ago\n\nEthereum price $ 2,384.40 Ethereum prediction $ 2,538.89 (8.10%) Sentiment Bullish Fear & Greed index 64 (Greed) Key support levels $ 2,281.10, $ 2,254.32, $ 2,222.03 Key resistance levels $ 2,340.18, $ 2,372.47, $ 2,399.25\n\nETH price is expected to rise by 8.10% in the next 5 days according to our Ethereum price prediction\n\nis trading at $ 2,384.40 after gaining 3.17% in the last 24 hours. The coin outperformed the cryptocurrency market, as the total crypto market cap increased by 3.12% in the same time period. ETH performed well against BTC today and recorded a 1.83% gain against the world’s largest cryptocurrency.\n\nAccording to our Ethereum price prediction, ETH is expected to reach a price of $ 2,538.89 by Feb 11, 2024. This would represent a 8.10% price increase for ETH in the next 5 days.\n\nETH Price Prediction Chart\n\nBuy/Sell Ethereum\n\nWhat has been going on with Ethereum in the last 30 days\n\nEthereum has been displaying a positive trend recently, as the coin gained 6.35% in the last 30-days. The medium-term trend for Ethereum has been bullish, with ETH increasing by 25.24% in the last 3 months. The long-term picture for Ethereum has been positive, as ETH is currently displaying a 44.19% 1-year price change. On this day last year, ETH was trading at $ 1,653.62.\n\nEthereum reached its all-time high price on Nov 10, 2021, when the price of ETH peaked at $ 4,867.17. The current ETH cycle high is $ 2,714.13, while the cycle low is at $ 897.01. ETH has been displaying low volatility recently – the 1-month volatility of the coin is at 5.25. Ethereum recorded 15 green days in the last 30 days.\n\nEthereum technical analysis for today - Feb 06, 2024\n\nThe sentiment in the Ethereum markets is currently Bullish, and the Fear & Greed index is reading Greed. The most important support levels to watch are $ 2,281.10, $ 2,254.32 and $ 2,222.03, while $ 2,340.18, $ 2,372.47 and $ 2,399.25 are the key resistance levels.\n\nBullish sentiment for Ethereum\n\n25 indicators are currently signaling a bullish prediction for Ethereum, while 4 indicators are showing a bearish forecast. With 86% of indicators favoring a positive prediction. This results in an overall Bullish sentiment for Ethereum.\n\nCrypto market is currently experiencing Greed\n\nCurrently, the Fear & Greed index is at 64 (Greed), which signals that investors have a positive outlook on the market. The Fear & Greed index is a measure of sentiment among cryptocurrency investors. A “Greed” reading suggests that investors are currently optimistic about the cryptocurrency market, but can also be an indication that the market is overvalued. A “Fear” reading, on the other hand, signals that investors are currently hesitant about the cryptocurrency market, which potentially represents a buying opportunity.\n\nEthereum moving averages & oscillators\n\nLet’s take a look at what some of the most important technical indicators are signaling. We’ll be going through key moving averages and oscillators that will allow us to get a better idea of how Ethereum is positioned in the market right now.\n\nPeriod Daily Simple Daily Exponential Weekly Simple Weekly Exponential MA3 $ 2,372.86 (BUY) $ 2,342.19 (BUY) - - MA5 $ 2,315.28 (BUY) $ 2,342.89 (BUY) - - MA10 $ 2,275.38 (BUY) $ 2,316.66 (BUY) - - MA21 $ 2,319.52 (BUY) $ 2,241.23 (BUY) $ 3,083.51 (SELL) $ 2,068.40 (BUY) MA50 $ 2,321.73 (BUY) $ 2,087.63 (BUY) $ 2,685.39 (SELL) $ 1,923.03 (BUY) MA100 $ 2,196.73 (BUY) $ 1,955.41 (BUY) $ 1,545.55 (BUY) $ 1,888.48 (BUY) MA200 $ 1,976.76 (BUY) $ 1,861.02 (BUY) $ 2,148.26 (BUY) $ 1,666.57 (BUY)\n\nPeriod Value Action RSI (14) 46.87 NEUTRAL Stoch RSI (14) 100.00 SELL Stochastic Fast (14) 61.00 NEUTRAL Commodity Channel Index (20) -66.67 NEUTRAL Average Directional Index (14) 7.31 NEUTRAL Awesome Oscillator (5, 34) -60.55 NEUTRAL Momentum (10) 34.04 NEUTRAL MACD (12, 26) -3.45 NEUTRAL Williams Percent Range (14) -39.00 NEUTRAL Ultimate Oscillator (7, 14, 28) 47.26 NEUTRAL VWMA (10) 2,306.87 BUY Hull Moving Average (9) 2,309.05 SELL Ichimoku Cloud B/L (9, 26, 52, 26) 2,441.28 NEUTRAL\n\nThe Relative Strength Index (RSI 14) is a widely used indicator that helps inform investors whether an asset is currently overbought or oversold. The RSI 14 for Ethereum is at 46.87, suggesting that ETH is currently neutral.\n\nThe 50-day Simple Moving Average (SMA 50) takes into account the closing price of Ethereum over the last 50 days. Currently, Ethereum is trading below the SMA 50 trendline, which is a bearish signal.\n\nMeanwhile, the 200-day Simple Moving Average (SMA 200) is a long-term trendline that’s calculated by taking an average of the ETH closing price for the last 200 days. ETH is now trading below the SMA 200, signaling that the market is currently bearish.\n\nThe bottom line about this Ethereum prediction\n\nAfter considering the above factors, we can conclude that the current forecast for Ethereum price prediction is Bullish. ETH would have to increase by 8.10% to hit our $ 2,538.89 target within the next five days. Moving forward, it will be important to monitor the ETH market sentiment, the key support and resistance levels, and other metrics. However, we have to keep in mind that the cryptocurrency markets are unpredictable, and even the largest crypto assets display a lot of price volatility. For long-term Ethereum price predictions click here.\n\nDisclaimer: This is not investment advice. The information provided is for general purposes only. No information, materials, services and other content provided on this page constitute a solicitation, recommendation, endorsement, or any financial, investment, or other advice. Seek independent professional consultation in the form of legal, financial, and fiscal advice before making any investment decision."
    },
    {
        "id": 81,
        "url": "https://news.google.com/rss/articles/CBMiqgJBVV95cUxOdHdvZDEySjJXanhvbVlzLU4zSFYwSm82QS1WQlF6dU4zSF9XMmV5aWhKUWg4X3JRYk9vZzBOMjNkaHNCUFlITjJDTnh4WDVYYVM4V192Q2RYeVhOWWZndHZhZktKYnh5MldBNk1kdFcwbThCel9sclpoNnVSdFczRnhNUnp2V1lkQ3FubnpLbkNxQnN2R1R6bGpGQWFYVzgwanZVM201RTA3SE1SWVFHTWE1bVZ4QlR2WUZtNUdGUW1Vbjl4T2hDZDB5ZTNpQTlER2Y2MWFtSkVTWVpMMjBaRFhQTGVmdHdZSi1pSVRkaTloMHZGb2dTWVFDSk5rOTI1eldSQ3p3YlBwT1lrcVpBUGU2ZUozSUhsVC1wNWItTDZ5dFBZRFo5Mmhn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Feb 2024 08:00:00 GMT",
        "title": "First Digital USD (FDUSD) investors buy up Kelexo (KLXO) presale as revolutionary lending coin gains big investment from also Ethereum (ETH) Holders alike - Crypto Reporter",
        "content": "Revolutionary DeFi protocol Kelexo (KLXO) is closing out stage 1 of its presale in style as it nears a sellout. With 5,000+ new joiners entering the ranks of Kelexo (KLXO) holders, the future looks bright for the first decentralized P2P lending marketplace entering February. A good number of inflows have come from First Digital USD (FDUSD) and Ethereum (ETH) holders capitalizing on Kelexo (KLXO)’s stage 1 prices of $0.022—learn why.\n\nFirst Digital USD (FDUSD) Gaining Wider Adoption in 2024\n\nFirst Digital (FDUSD), one of the leading digital asset custody and trust services in Asia, has announced that its stablecoin First Digital (FDUSD) has smashed past a market capitalization of $2.58 billion in under a year since it listed, with First Digital (FDUSD) being adopted by major crypto exchanges such as Binance. First Digital (FDUSD) is fast solidifying its position as a major player in the global digital asset landscape and its partnerships with major exchanges is expected to make it a major player in the years to come.\n\nEthereum (ETH) Closes January on a Decline\n\nEthereum (ETH) closed out January on a decline, as Ethereum (ETH) prices slipped below $2,280. However, it was just a matter of time before the second-largest cryptocurrency by market capitalization regained support levels of $2,300, which it attained as of this writing. Market analysts believe that while Ethereum (ETH) could continue to trade sideways in the near future, Ethereum (ETH) prices could be in for a big May. May 2024 is, after all, when the US SEC is expected to approve the first spot Ethereum ETFs, which could coincide with a big run for Ethereum (ETH) prices past the $3,500 to $4,000 mark.\n\nKelexo (KLXO) Close to Selling Out Stage 1 of its Presale\n\nAs evidenced by Kelexo (KLXO)’s rise to prominence, the decentralized P2P lending marketplace has gained major traction with its presale. Market analysts believe Kelexo (KLXO) could be one of the best investment opportunities of the year, with stage 1 of its presale fast approaching a sellout. The 5,000+ new holders are a testament to Kelexo (KLXO)’s vast potential to generate big gains in 2024 and propel its native Kelexo (KLXO) token to new heights.\n\nKelexo (KLXO) is revolutionizing the landscape of peer-to-peer lending by eliminating the bureaucratic obstacles commonly linked with conventional lending platforms. To be precise, Kelexo (KLXO) eliminates the need for Know Your Customer (KYC) processes, credit assessments, and prolonged waiting periods for approval. Potential lenders can effortlessly showcase their loans on the platform, specifying the desired amount, payment schedule, long-term value and other relevant details. On the flip side, borrowers can conveniently access loans that align with their requirements. The entire process, involving both parties, can be completed in under 5 minutes, sans the necessity for intermediaries.\n\nKelexo (KLXO) token prices are still available at $0.022 during stage 1 of its presale—but prospective investors looking to capitalize on this ideal entry point ought to act fast, as a sellout is looming. This means time is running out before the Kelexo (KLXO) presale enters stage 2—and before token prices increase. Act now and secure your spot on the Kelexo (KLXO) presale today.\n\nFind out more about the Kelexo (KLXO) presale by visiting the website here\n\nDisclaimer: The statements, views and opinions expressed in this article are solely those of the content provider and do not necessarily represent those of Crypto Reporter. Crypto Reporter is not responsible for the trustworthiness, quality, accuracy of any materials in this article. This article is provided for educational purposes only. Crypto Reporter is not responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods or services mentioned in this article. Do your research and invest at your own risk."
    }
]