[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiYkFVX3lxTE1GR1Zpd2RTT1Z3c2Utbzlndk9uRWRqNTAxajROS2lpSW5qTnd0OU1lOENwQ1l5WElqa3YxbjlyRDYtYnZpNERvTUJLZ2lqY2xJUG5RSzVRMkFuUFJfRDA5RXFB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Apr 2024 07:00:00 GMT",
        "title": "What is EIP-7251 (MaxEB) in Ethereum? A Beginner’s Guide - Unchained",
        "content": "EIP-7251, also known as MaxEB, is an improvement proposal for Ethereum that aims to address the issue of redundant network validators.\n\nThe growth of Ethereum has led to the continued increase of validators who participate in the network’s consensus process. Ethereum researchers have expressed concerns about the potential instability in the network due to the continued increase of validator sets.\n\nRead on as we discuss EIP-7251 and its role in addressing these concerns.\n\nWhat Is EIP-7251 (MaxEB)?\n\nEIP-7251, or MaxEB, is an improvement proposal for the Ethereum network that aims to address the issue of ‘redundant validators.’\n\nEIP-7251 proposes lifting the maximum amount a validator can stake from the current 32 ETH to 2048 ETH while maintaining the minimum staking balance limit at 32 ETH.\n\nThe goal is to allow large node operators to consolidate their validator sets, potentially reducing the number of validators and increasing the network’s efficiency. Validators won’t have to fully exit and re-enter the protocol to merge their effective balances.\n\nFor solo stakers, EIP-7251 will enable them to earn compounding rewards and stake their ether in more flexible increments. For example, a large node operator with 2048 ETH can consolidate 64 validator sets into one, while a solo staker with a 45 ETH balance only has to dedicate resources to one validator set.\n\nAs of March 2024, the Ethereum network has over 950,000 validator sets. Theoretically, this means the network is truly decentralized. However, while the network recognizes each validator as a unique entity, a party can run several validators on the same device.\n\nEIP-7251 proposes lifting the maximum effective balance limit to allow consolidation and accurately reflect the network’s decentralization levels.\n\nHow Does EIP-7251 Work?\n\nEIP-7251 proposes to reduce the number of validators while maintaining high economic security on the Ethereum network.\n\nEIP-7251 relies on four key features that make it work:\n\nCreating a minimum balance and increasing the maximum balance: EIP-7251 proposes creating a minimum activation balance of 32 ETH and increasing the maximum effective balance from 32 ETH to 2048 ETH.\n\nCombination of multiple validator sets: With the increased maximum limit, large node operators combine their validators without cycling through the exit and activation queues. This helps speed up the staking process while decreasing costs due to the in-protocol consolidation.\n\nAdding execution layer partial withdrawals: Execution layer messages trigger partial withdrawals in addition to full exits. For example, a validator with 200 ETH staked can remove 50 ETH without exiting. This increases the flexibility of staking configurations, allowing validators to control the moment and amount they withdraw.\n\nCustom effective balance ceiling: EIP-7251 enables validators to customize the maximum amount that activates partial withdrawals.\n\nReasons For and Against MaxEB\n\nThere are several compelling reasons to make the case to increase the maximum effective balance:\n\nAddressing Consensus Layer Challenges\n\nUnder the current limits, the network experiences high withdrawal loads from exceeding the maximum effective balance. Additionally, the large validator sets strain the resources and cause network delays.\n\nConsequently, reducing the number of validators addresses this problem, especially as the network continues to scale.\n\nAllows for Future Upgrades\n\nUpgrades to the Ethereum network, as noted on the roadmap, such as single-slot finality and enshrined proposer-builder separation, rely on a low validator set. The consolidation helps lay the groundwork for the implementation of such upgrades.\n\nCompetitive Solo Staking\n\nWhile large node operators appear to be the key EIP-7251 beneficiaries, solo stakers also have something to gain. Individual stakers can stake flexible amounts of ETH and enjoy the compounding rewards.\n\nReduced Overhead Costs\n\nFor large node operators, the 32 ETH ceiling presents the logistical challenge of running thousands of validators on a single machine. EIP-7251 minimizes the hassle by reducing the number of validators. This also brings the operating cost down, which maximizes the returns.\n\nThere are several reasons against MaxEB:\n\nSlashing Risk\n\nA Proof of Stake (PoS) network such as Ethereum promotes economic security through slashing. Slashing involves partial or full destruction of a validator’s staked assets if they are deemed responsible for actions that threaten the network’s security. MaxEB raises the maximum limit a validator can stake, increasing their slashing risk.\n\nThe Ethereum community is aware of this risk and proposes modification of the slashing penalties. The idea is to introduce non-linear slashing mechanisms that will encourage consolidation.\n\nComplexity\n\nThe current ceiling of 32 ETH per validator makes it simple to consider different consensus aspects. Raising it to 2048 ETH may draw focus away from other critical areas. This may lead to a drop in the network’s security levels.\n\nDecentralization\n\nAs of March 2024, there are over 950,000 validator sets on the Ethereum network. Consolidation under MaxEB will significantly reduce that number. Consequently, there might be an imbalance in committee influence. This goes against the principles of decentralization, as a malicious actor can potentially dominate a committee and execute a 51% attack.\n\nRegulatory Interference\n\nWith auto-compounding validator rewards possible after implementing EIP-7251, regulators may find grounds to argue that ETH is an interest-bearing security.\n\nCurrently, validators are considered service providers who earn rewards for securing the network. Implementing EIP-7251 will lead to more rewards for validators with a higher balance, which may offer regulators grounds to argue that being a validator is the equivalent of a savings account in a traditional bank.\n\nThe Bottom Line\n\nEIP-7251 proposes significantly reducing the number of validators without making major changes to the Ethereum network.\n\nThere are key issues that the community needs to address to ensure its implementation doesn’t affect the network negatively. The community has acknowledged challenges such as slashing concerns and has made proposals to address them. However, others, like regulatory concerns, have yet to be fully explored.\n\nOverall, EIP-7251 presents a pathway to an efficient Ethereum network, provided the community addresses all concerns before implementation."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxQUDdiVDh0aTBKTlRwZW5nc1NuRVZWVmxlcTg1ZDlxekRHcTRURGdtaVExNzgySlNPbDU3WUR6bUN2bEdKZ0l1ZVRMOFBnUE4wYTdmNGtNUjB4OWlOWF9Ja3hGcHFWajAxX1hNc1NQaml5Qk9ROEN3WWM2THpJQ2NXTGxJbzNQUGlXYklsQmFVRUFnOXpFemc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Apr 2024 07:00:00 GMT",
        "title": "Will Ethereum Reach $10,000 After Bitcoin Halving 2024? - Crypto Times",
        "content": "Ahead of the Bitcoin Halving 2024 event, the spotlight is on Bitcoin, the hottest cryptocurrency, even as it appears that Ethereum has been quietly sidelined in the market trend. However, trade analysts, pundits and anybody with little-over technical understanding in crypto know that Ethereum, the second most popular cryptocurrency, holds strong potential and could emerge as a major player in future.\n\nAs the halving date is approaching, the chatter among the crypto community grows louder regarding Ethereum’s potential to cross the $10,000 barrier post the event. There are several predictions that Ethereum’s price will rise exponentially in the upcoming crypto cycle.\n\nHowever, these predictions lack any concrete data or evidence to explain the exact trajectory of Ethereum unlike the prediction of Bitcoin price reaching $150,000 post the 22024 halving.\n\nIn this article, we discuss if Ethereum price could really break the $10,000 barrier and what are the factors that could lead to it after the upcoming Bitcoin halving event.\n\nFactors That Could Send ETH Above $10,000\n\nThere are several major factors supporting Ethereum’s rise to $10,000 and some of them are as below.\n\nEthereum-Bitcoin (ETH-BTC) Price Correlation\n\nIt is historically proven that ETH price closely follows gain in BTC price due to Bitcoin’s major dominance in the cryptocurrency space. As both these crypto assets are largely fueled by speculations rather than actual use, the gain in Bitcoin price pushes Ethereum price upward because of the shared ecosystem.\n\nThere is also another major factor where both these assets are bought and sold using one another. For instance, ETH becomes cheaper in the ETH-BTC market when BTC price rises and vise-versa, ETH becomes expensive against BTC when its price decreases. This cycle is a major driver of the correlation between Ethereum and Bitcoin prices.\n\nBTC-USD vs ETH-USD – PortfoliosLab\n\nHowever, this case has been found unsteady due to major technical differences between both blockchain networks. Over the past year, Ethereum price has only gained 87% while Bitcoin has recorded a gain of over 133% – according to data from PortfoliosLab. This above chart shows that Ethereum has broken its price correlation during the past few months while lagging behind amid aggressive moves from Bitcoin.\n\nThe Pump Followed By Bitcoin Breakout\n\nAs mentioned above ETH prices tend to follow Bitcoin’s moves, the rapid increase in Bitcoin price could lead ETH to new highs. While there are speculations about Bitcoin price hitting $150,000 – which is a surge of 160% from its current market price – the ETH price is also likely to reach $10,000 due to the market correlation, which will be a surge of over 200% as it is currently placed at $3400-$3700.\n\nLiquidity rotation also plays a major role at the cycle peak where profits in one major asset usually flows into other assets. In such a case, the massive amount of realized profit in Bitcoin could directly flow into Ethereum that might lead ETH price to shoot up beyond $10,000.\n\nPotential Ethereum ETF Approval\n\nAfter the approval of spot Bitcoin ETFs, the crypto community was much optimistic about the potential approval of spot Ethereum ETFs. However, the sentiment around ETH ETF has turned gloomy after the VanEck CEO Jan van Eck expressed doubts on it in a recent CNBC interview. He said that the Ethereum ETF will likely face rejection from the regulatory agency. A statement like this coming from one of the first Bitcoin ETF issuers holds much significance.\n\nTo counter this statement, analysts from Bitwise believe that there are 50 to 60% chances for ETH ETF to be approved by the SEC as it will happen “sooner or later.” The approval will bring billions of inflow from traditional investors as traditional finance players sees Ethereum as a more convenient option due to its smart contract functionality and massive adaptability in real world use cases.\n\nAmid all the bullish speculations for 2024 bullrun, few reports also suggested that ETH will outperform BTC in 2024. There are supportive studies giving solid baking to the claim, so would it really happen?\n\nWill ETH Outperform BTC in 2024\n\nIn the highly volatile and unpredictable cryptocurency market, various possibilities exist including Ethereum outperforming Bitcoin in gain. As witnessed in 2021, ETH outperformed BTC, gaining nearly 400% compared to Bitcoin’s 66%.\n\nIt is also acknowledged by exporters that Ethereum has a promising future due to several use cases and its unique functionality than Bitcoin. There are slight chances it may perform against Bitcoin in the upcoming rally in 2024. However, it could only outperform in periodic price gains rather than Bitcoin’s market cap and price which is currently far beyond Ethereum.\n\nConclusion\n\nBitcoin halving is considered a kick starter for bullrun and it majorly impacts the whole cryptocurrency ecosystem besides Bitcoin. As the second largest blockchain and crypto asset, Ethereum has the potential to unlock the most benefits out of this. While there are speculations about crypto market reaching record highs in the next months, Ethereum price will surely hit a new all-time high while possibly breaking the $10,000 target.\n\nFAQs"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxNNW05bjM2bjVLSGlQVVVKajYycnU3VUJZcnFHY1V1dGFkaTRwX09UYVpDdW9nZXhhUFJ0RDNheGIwOEtmXzYyRjFCRjlVeVg1YllSaEhXWEZiMGVFWlRnM0FWazN4SW94TGhaR2lwbndnN3JVb2RGckdhYnB5TElsbjN5ZkNjVm5DQ084?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Apr 2024 07:00:00 GMT",
        "title": "Ethereum's Pectra upgrade slated for Q4 2024, bringing smart contract features and improved UX for wallets - Crypto Briefing",
        "content": "The name \"Pectra\" is derived from \"Prague\" and \"Electra\" — a combination of two simultaneous upgrades occurring on different layers of Ethereum.\n\nShare this article\n\nEthereum’s upcoming Pectra upgrade, expected to be implemented by late 2024 or early 2025, is set to introduce significant improvements to cryptocurrency wallets, including the addition of smart contract capabilities to standard externally owned accounts (EOAs).\n\nThe inclusion of Ethereum Improvement Proposal (EIP) 3074 in the Pectra upgrade will bring a range of new features and enhancements to the user experience.\n\nThe Pectra upgrade follows the recent Dencun update, which focused on lowering transaction fees on layer-2 solutions. The name “Pectra” is derived from the combination of two simultaneous upgrades occurring on different layers of the blockchain. The execution layer, responsible for enforcing protocol rules, will undergo the “Prague” upgrade, while the consensus layer, which ensures the validation of blocks, will go through the “Electra” upgrade. This naming convention follows the Ethereum developers’ tradition of combining the names of the upgrades, as seen in previous instances like “Dencun” and “Shapella.”\n\nOne of the key benefits of EIP-3074 is the ability for regular wallets, such as those created using MetaMask, to function similarly to smart contracts. This upgrade will enable features like transaction bundling, allowing users to sign multiple transactions at once, and sponsored transactions, where a wallet can delegate funds to be used by another entity. These functionalities are reminiscent of the account abstraction introduced in ERC-4337.\n\nEIP-3074 introduces two new operating instructions: AUTH and AUTHCALL. As explained by anonymous Web3 adviser Cygaar, AUTH verifies signatures and actions, while AUTHCALL calls the target contract(s) with the originator address as the caller instead of the message sender. These instructions work together to enable the smart contract-like behavior of EOAs.\n\nIn addition to the features mentioned above, EIP-3074 also includes a social recovery feature that eliminates the need for the traditional 12-to-24-word seed phrase, further simplifying the user experience and potentially reducing the risk of lost or stolen funds.\n\nAnother significant change expected to be included in Pectra is an increase in the staking limit for validators, from the current 32 ETH to 2,048 ETH – a substantial 64-fold increase. This proposal, known as EIP 7251, would allow large staking providers, such as Coinbase or Lido, to consolidate their validators operating the Ethereum blockchain. By doing so, these providers can avoid the need to constantly create new validators each time they have an additional 32 ETH to stake, thereby reducing the operational load and resources required for staking and validating.\n\nThe need for this change has become apparent as the number of validators on the Ethereum network has surpassed 1 million, raising concerns about excessive latency. EIP 2751 is seen as a potential solution to slow the rate at which new validators enter the system, preventing performance issues and ensuring the blockchain’s smooth operation.\n\nOther EIPs under consideration for Pectra include enabling validator withdrawals from smart contracts, incorporating a code change known as BLS precompile, and removing the deposit window. These relatively minor changes will allow developers to work on smaller improvements while focusing on more significant upgrades in the future.\n\nLooking beyond Pectra, the subsequent upgrade will introduce the highly anticipated “verkle trees” – a novel data system designed to help Ethereum nodes efficiently store large amounts of data. Tim Beiko mentioned that the Pectra upgrade is expected to be released sometime in late 2024 or early 2025, allowing developers to work on two forks in parallel and deliver small wins while preparing for the more complex verkle trees transition.\n\nAs Ethereum continues to evolve and improve, the Pectra upgrade represents another step forward in enhancing the network’s performance, user experience, and overall functionality. By addressing key issues such as wallet UX and staking limits, developers aim to ensure that Ethereum remains at the forefront of blockchain technology, providing a solid foundation for the growing ecosystem of decentralized applications and services."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPVUY4eDc0ZWNfMlJLZm8tYW91N1ZXQXJlUzZJVU15WGI4aWZfSDBCeHV1clM1ZTJVazVDTjJJdWJvQjAxeHNEWTBwTVEzY090eG4wY1B5ajVWalBIeElacnJ6aDVwN1NvYU1vb01tVUR0R3BITy1LMjB0TFVSSFRSQVJBWkpBV1B5MTRB0gGTAUFVX3lxTE9yM2wyUGVBZDVQUEFrZHpiU0Rvd29vS25lM3RYbDNFcl9FVkJOVTNBYXNyLUtzLVlkQkxIc05oTTFCZmdLMTJZQ1l4VGN6TjRzb2ROdzFWZHFrVU15MjhoU0dkTUw2REZjMFA1SzNaUU5qcE9zQXNLUXJFMmh3dlI3RmtiV25aQ0xuZ1Zjdk9nOWQwdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Apr 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum, Solana Sink as Over $200 Million in Crypto Longs Liquidated - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nTop cryptocurrencies—including Bitcoin and Ethereum—are down bad as $200 million in long positions have been liquidated.\n\nThe price of Bitcoin now stands at just under $68,008 per coin, according to CoinGecko. That's a drop of over 3% in 24 hours—and a fair drop from its March all-time high price of $73,737.\n\nMeanwhile, Ethereum's price has taken a bigger 24-hour hit of 5%; the coin is now trading hands for $3,413.\n\nFaring worse are Solana, the fifth biggest cryptocurrency, which has nosedived by nearly 7%; and Toncoin, which had been on a roll this week—and nearly flipped Dogecoin in the process. It's now priced at $6.65, having dropped by over 7%.\n\nAD\n\nAD\n\nThe crypto market has dipped, and traders betting on the price of major cryptocurrencies going up in price have had their positions liquidated. CoinGlass data shows that in the past hour alone, over $200 million in positions have been liquidated.\n\nOver the past day, that number stands at close to $359 million.\n\nLongs are derivative contracts that allows investors to bet that the price of an asset is going up. If a long is liquidated, then the trader has lost the bet and their position is closed.\n\nEdited by Andrew Hayward\n\nAD\n\nAD\n\nDisclaimer The views and opinions expressed by the author are for informational purposes only and do not constitute financial, investment, or other advice."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxOMW0wM3FSSXN4d2YzWWpmNVhSeDdSbFhkZWRpelJuNXZDV3hfellXeVc3OExHNnZva2hnc1UwVmYxcFpVaGVnRk4tY0Z3c2FxNFFvZXRGcmsxVnpaZnpjQjJJangwQmJTQzBVZlpBNl9idS1CUjc0RGZrYV9zVERYUmVGelVJQmZxcUJLNFlveVVybGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Apr 2024 07:00:00 GMT",
        "title": "Navigating High ROI in Cryptocurrency: Ethereum (ETH), Shiba Inu (SHIB), and Furrever Token (FURR) - Yahoo Finance",
        "content": "Furrever Token\n\nNew York, NY, April 12, 2024 (GLOBE NEWSWIRE) -- Amidst the turbulent seas of the crypto markets, Ethereum (ETH) and Shiba Inu (SHIB) find themselves navigating stormy waters, facing challenges in their quest for a new rally. Despite efforts to regain solid footing, both ETH and SHIB encounter obstacles that hinder their upward momentum. In stark contrast, Furrever Token (FURR) emerges as a beacon of success, surpassing the impressive milestone of $770,000 in fundraising within just one month. While ETH and SHIB grapple with market dynamics, FURR's rapid ascent highlights its growing appeal and investor confidence in its promising trajectory.\n\nEthereum (ETH) Could See $4,000 Again Soon\n\nEthereum (ETH) is currently priced at around $3,502.22, marking a nearly 1% increase since yesterday. Despite recent fluctuations, Ethereum's price chart suggests signs of potential recovery, with indicators like the 30-day moving average stabilizing and the Relative Strength Index (RSI) climbing from 30 to approximately 45, indicating momentum.\n\nThe recent bounce-back of Ethereum's support level is also a positive indicator, alongside a doubling of trading volume, indicating heightened market activity. This surge in volume, potentially due to large investors' selling pressure, is encouraging as it hasn't significantly impacted Ethereum's price.\n\nConsidering the broader crypto market conditions, Ethereum seems poised for positive performance in the near and long term. It's expected to benefit from potential rallies following Bitcoin's upcoming halving event. Additionally, the potential approval of spot-based Ethereum ETFs could be a significant development, similar to the impact of Bitcoin ETFs on BTC's price.\n\nEthereum's robust fundamentals, particularly its significant share in the total value locked (TVL) aspect of the market, suggest it's primed for a substantial uptrend. This could see Ethereum reaching levels around $4,000 in the coming weeks and potentially $5,000 in the second half of the year.\n\nDespite experiencing a 5% increase over the past week, Ethereum saw a 12.5% decline last month. However, it's important to note that Ethereum saw an 89% increase over the past year.\n\nAnalyzing Shiba Inu (SHIB): Consolidation, Potential Opportunities, and Market Indicators\n\nShiba Inu (SHIB) is currently trading at around $0.00002737, reflecting a 1% decrease since yesterday. The popular meme token has been in a phase of retreat and consolidation over the past six weeks. However, the cryptocurrency's price movement chart hasn't shown any reasons for investors to panic. On the contrary, experts suggest that a further 15% drop in SHIB's price could present a good buying opportunity.\n\nA recent report on Shibarium revealed a decline in transaction fees on the network, which could raise concerns about diminishing user activity and a potential decrease in demand. The 12-hour price chart for the meme token has highlighted the significance of the $0.00003 level since March 15. Bulls briefly turned to support in the last week of March but failed to hold, with the latest bounce also stopping just below this level at $0.00000295.\n\nThe Relative Strength Index (RSI) underscores the indecision with a reading of 47, while the Chaikin Money Flow (CMF) remains similarly uncertain. Notably, the cryptocurrency's price action and indicators indicate that SHIB is in a consolidation phase. CMF movement could potentially signal increasing buying (or selling) pressure and an imminent SHIB movement in that direction.\n\nThe 30-day MVRV ratio dipped into negative territory earlier this month, suggesting the token may be undervalued. Conversely, the average cryptocurrency age has shown a strong upward trend since early March, particularly signaling a robust buying signal due to strengthening under resistance levels.\n\nOpen positions have also significantly decreased in the last ten days. While the average cryptocurrency age rapidly declined in early March, stagnant circulation has largely increased since then. This quietness in stagnant circulation may signal a lack of significant selling pressure and token movement in recent weeks.\n\nFurrever Token (FURR) Soars: How it Amassed $770,000 in a Month with Up to 15X Returns\n\nFurrever Token (FURR) surged to amass over $730,000 in just one month, propelled by a strategic blend of captivating marketing, unique tokenomics, and a robust community-driven ethos. With an enticing offer of up to 15X returns and a current price of $0.00048, FURR's presale phase garnered significant attention and investment.\n\nThe token's allure stems from its innovative vision to inject the crypto sphere with an irresistible dose of cuteness, providing users with a delightful and charming experience distinct from conventional blockchain ventures. FURR's presale strategy strategically allocated 65% of tokens to early investors, incentivizing participation and capitalizing on the potential for substantial returns. Additionally, the dedication to lock 10% of tokens for a year underscored a steadfast commitment to project longevity, instilling confidence and stability within the community.\n\nFURR's engagement initiatives, including regular challenges, launch events, and growth endeavors, fostered a vibrant and inclusive community atmosphere. The integration of adorable cat-themed stickers, emojis, and visuals into the ecosystem further enhanced user engagement, attracting a diverse audience beyond traditional crypto enthusiasts.\n\nThe absence of buy and sell taxes during trading streamlined transactions, while the active presence of admins and moderators on platforms like Telegram ensured prompt resolution of queries and issues, bolstering trust and credibility.\n\nOverall, Furrever Token's captivating concept, strategic tokenomics, stringent security measures, and active community involvement propelled its rapid fundraising success, positioning it as a promising contender in the crypto landscape.\n\n\n\nSecure the Most Exclusive Presale Opportunity of 2024 Today!\n\n\n\nFurrever Token Official Website | Visit Furrever Token Presale\n\n\n\nJoin Official Telegram Group | Follow Official X Account\n\n\n\nMedia Contact: Robert Smith support(at)furrevertoken.com https://furrevertoken.com/\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\n\n\n\n\n\n\nCONTACT: Robert Smith support at furrevertoken.com\n\n\n\n"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxNcE5UQTFMeWwxM0N5QjZUVUVWWHNWdGhyajJWdXl2TE5VVERfSF9wcTdEc3VZSW43SzZnQjRtXzJnQ3AyZE81TFQ2MWxRR3dHLWVva0Q1ZldvZThWbU5CRHYwaFRpUE9tamFmTVNuYjlEMFhxLXh3SkhmbThGeEViWUNGUFY3Vm5xVzdiYXdjUE1pbW9tZXdYem92YVBsQkl6d3c2eElkUVhIQlhWaUE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Pectra upgrade promises major wallet improvements with EIP 3074 integration - CryptoSlate",
        "content": "Ethereum developers are currently deliberating the Pectra upgrade, which is poised to enhance various facets of the blockchain’s functionality.\n\nTim Beiko, the Ethereum Foundation‘s protocol support lead, confirmed the development, revealing that the developers have agreed to include Ethereum Improvement Proposals (EIP) 3074 in the network’s slated overhaul.\n\nEIP 3074\n\nEIP 3074 is a pivotal advancement within Ethereum’s ecosystem and was introduced by Lightclients in 2020. The proposal has garnered widespread support from the crypto community as it aims to enhance the user experience (UX) of Ethereum wallets.\n\nFundamentally, EIP 3074 enables conventional crypto wallets like MetaMask to function akin to smart contracts.\n\nThis upgrade facilitates various functionalities, including transaction bundling, streamlining the signing process to a single step, and sponsored transactions. The latter feature empowers wallets to delegate funds for others to utilize, offering a more versatile and efficient transaction framework.\n\nTrading a new token on a DEX such as Uniswap will now only require one signature from a user’s wallet as opposed to having to approve the new token and then sign the transaction to purchase.\n\nCrypto community reacts\n\nThe announcement of the impending upgrade has sparked various reactions within the crypto community.\n\nGeorgios Konstantopoulous, Paradigm’s CTO, highlighted the update’s potential to enhance wallet usability tenfold, noting Reth’s successful implementation and testing.\n\nEchoing this sentiment, Hayden Adams, the mind behind Uniswap, lauded the upgrade as a significant boost to Ethereum’s user experience. He added:\n\n“Industry should make an effort to create compatibility for 4337 wallets to interact with 3074 contracts (much like eip1271 has created compatibility between safes and EOAs today).”\n\nHowever, EVM developer Alex Watts cautioned against solely focusing on user experience improvements, emphasizing the broader implications for application and mechanism design.\n\nDespite the optimism, concerns linger among some community members regarding the EIP 3074 upgrade.\n\nAnsgar Dietrich, an Ethereum Researcher involved in the proposal’s inception, expressed ambivalence, reflecting on the lengthy journey to its impending mainnet integration and questioning its alignment with the evolving account abstraction roadmap.\n\nSimilarly, 0xngmi, the pseudonymous developer of DeFiLlama, raised apprehensions about the upgrade potentially enabling the complete depletion of addresses, encompassing tokens, NFTs, and other DeFi assets.\n\nMentioned in this article"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxNZHVrd3VRZC1zMGFvZXZHeGM0Y1lES19DZEFiUm9sMTlhRVZZZktxUGVRRzZnLU9jQmpCaFZOc3RxTTRqTkxKaEI5XzJaMGtCdzZyWmEzSGZQR29yTnpLQlE1Y1hCQXVkREo1bS16U096VlI2SWVPR085SVpDN3FTTjZ3QXd6djUxQVY2RTFPck1BQmktY1BNbTVpRnloLU9wa2kw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Apr 2024 07:00:00 GMT",
        "title": "5 Charts That Highlight How Ethereum Has Changed One Year After Shapella - Unchained",
        "content": "As Ethereum celebrates its one-year Shapella anniversary, here’s a breakdown of how the network has changed.\n\nStaking activity on Ethereum has been on the rise over the last year.\n\nEthereum on Friday reached its one-year Shapella upgrade anniversary, which transitioned the blockchain from a proof-of-work validation system to the more energy-efficient proof-of-stake.\n\nThe upgrade occurred on April 12, 2023, which allowed stakers to withdraw ether (ETH) that had been securing and validating the second-largest blockchain network.\n\nOne year later, Ethereum has changed in several ways, from fluctuations in staked ETH to the number of validators in its ecosystem. Here are five charts to illustrate how Ethereum has progressed since Shapella:\n\n1. Total Staked ETH Securing Ethereum\n\nStaked ether has grown considerably in the past year to 32.2 million ETH, up from 20 million, Nansen data shows.\n\nDespite the slight decrease in staked ETH from centralized exchanges initiating withdrawals following the rollout of Shapella, staked ETH has since ballooned 61%, marking a $42 billion influx into Ethereum’s staking infrastructure, based on recent pricing.\n\nBefore Shapella, would-be validators had one option: depositing ETH into Ethereum’s staking contract. Withdrawing assets was not possible.\n\n“Based on how the total amount of ETH staked on Ethereum grew dramatically since the Shanghai [or the Shapella] upgrade, it’s clear that the activation of staked ETH withdrawals on the network was a major de-risking event for the activity of staking,” said Christine Kim, Galaxy’s vice president of research, in an email.\n\nShapella helped de-risk Ethereum, because stakers gained an exit window — without suffering slashing penalties for ditching duties. As of publication, staked ETH represented 26.94% of the 120 million total supply.\n\nMike Neuder of the Ethereum Foundation outlined in a March blog factors set to fuel demand for staked ETH. Those include ETH appreciation, increased demand for restaking, lower interest rates that may lead institutions to look for alternative yield, the popularity of liquid staking and the potential of exchange-traded fund providers pushing for staked ETH.\n\nEthereum developers, however, are concerned regarding increased demand causing staked ETH supply to rise “too much and too quickly,” Kim noted.\n\nRead More: Why the Ethereum Community Is Up in Arms Against a Proposal to Change the Monetary Policy\n\n2. Number of Validators\n\nValidators have grown substantially since Shapella, easing “some fear in the Ethereum community that the ability to withdraw ETH from the Beacon Chain would lead to a mass exodus of validators,” Austin Blackerby, EVM analytics manager at Flipside Crypto, told Unchained via Telegram.\n\nNearly 563,000 validators secured Ethereum as of April 12, 2023. The figure has since jumped over 74% to roughly 981,000 validators.\n\n“Additionally, interest to join the active validator set has shown a thorough increase over the past 30 days, with the current queue time for new validators sitting over 9 days,” Blackerby said. “Conversely, there is practically no queue to exit the validator set. This means there is a lot more demand to be a validator than there is demand to leave the network.”\n\nContinued validator growth has raised additional concerns among protocol developers and researchers. Galaxy’s Kim noted two main reasons in a September 2023 report.\n\n“First, a large validator set size creates strains on peer-to-peer networking and messaging that may cause node failures from high computational load and bandwidth requirements,” Kim wrote. A large validator set also makes future upgrades “harder and riskier to achieve,” she added.\n\nThe next upgrade, “Electra,” is expected to address the rising validator set. Electra includes EIP-7251, an improvement proposal to reduce validators by increasing the maximum ETH a validator can stake. EIP-7251 aims to allow validators a maximum of 2,048 staked ETH, instead of the current limit of 32 ETH.\n\nRead More: What is EIP-7251 (MaxEB) in Ethereum? A Beginner’s Guide\n\n3. Total Value Locked (TVL)\n\nEthereum’s TVL surged after withdrawal activations. On April 12, 2023, users locked $54.69 billion on decentralized finance (DeFi) applications, with 54% from liquid staking. Since, TVL has grown over 131% to $126.75 billion, with liquid staking comprising about 42%.\n\nEthereum maintains its top TVL position, followed by Tron, Binance Smart Chain, and Solana, according to DefiLlama. One factor driving growth is ETH appreciation, which surged 79% from $1,920 during the Shapella rollout to about $3,440 as of publication.\n\n4. Lido Leading the Pack\n\nETH holders have two ways to stake: solo home staking or using a third party.\n\nSmart contract protocol Lido, widely known for its liquid staking techniques, commands nearly 9.4 million staked ETH, representing about $33 billion — or 29% of all staked ETH.\n\nLiquid staking refers to staking ETH and receiving a “receipt” token, which represents a principal deposit, as well as rewards. While the ETH is locked, a staker can use their “receipt” token as liquidity on DeFi applications.\n\nLido led the pack in terms of staked ETH at the time of Shapella, boasting a lead of 2.97 million ETH over Coinbase. Lido has grown its lead over the past year. At publication, Lido’s staked ETH stood at almost 9.4 million.\n\nLiquid staking competition has been heating up. Consider that protocols Renzo, Stader, Mantle and Ether.Fi did not have any ETH staked when ETH withdrawals went live, but are now responsible for 2.16 million staked ETH.\n\n5. Unstaked ETH\n\nWhile staking withdrawals haven’t exceeded deposits, withdrawal patterns have changed since Shapella.\n\nCentralized exchanges were the primary withdrawers of staked ETH in the 2023 aftermath of Shapella. Exchanges that week withdrew 138,912 ETH that had secured the blockchain, dwarfing the collective 72,792 ETH withdrawn from all other categories, per the Dune dashboard.\n\nA year later, staked ETH withdrawals were largely activated by liquid staking protocols. Since Monday, centralized exchanges withdrew 84,128 staked ETH, while liquid staking protocols were responsible for 121,472 staked ETH withdrawals. Lido, which withdrew staked ETH Thursday, has seen its staked ETH decrease 1% in the past week and 4% over the past month."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxQNXBZLUVKaUNCWkx3amlrdVFCWDdwd21VRjNwS2w1alRwNXdPMlFwVVViTXRITXVJa3NVUXJjVTVfWEYzcXRWT3dCa3JVdTh0QzhmSXp1SGF1SnJvWnlzOVRHTEllUXRDUEZSWnUwVTl6djdVUTA2Q3ZiRnBibW5NQ09ud0FzQmVH?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Apr 2024 07:00:00 GMT",
        "title": "The Latest in Crypto: A Spotlight on Bitcoin (BTC), Ethereum (ETH), and Furrever Token Today - Yahoo Finance",
        "content": "Furrever Token\n\nNew York, NY, April 12, 2024 (GLOBE NEWSWIRE) -- The cryptocurrency market continues to evolve with significant movements in key digital currencies, including Bitcoin (BTC), Ethereum (ETH), and the emerging Furrever Token (FURR) . This article provides a detailed analysis of these cryptocurrencies, highlighting their current market positions, underlying value propositions, and potential future directions.\n\n\n\nBitcoin's Market Value: A Comparative Analysis\n\nOn April 10, 2024, the value of a single bitcoin reached an impressive milestone, exceeding $70,000, with a specific value of $70,665. The total circulation of bitcoin at this time was over 19.68 million, culminating in a market capitalization exceeding $1.39 trillion. This marks a significant increase from the previous year, where the market cap was around $472 billion with approximately 19.35 million bitcoins in circulation.\n\nTo understand the proportion of global wealth represented by bitcoin, it's crucial to consider the overall monetary wealth. According to calculations by Credit Suisse, global wealth was estimated at $454.4 trillion by the end of 2022. Assuming a steady growth rate, the total global wealth by 2024 would be around $469.8 trillion, placing bitcoin at 0.3% of this figure.\n\nGold has traditionally been seen as the ultimate safe-haven asset. With an estimated 244,000 tons of gold discovered to date and a price per ounce of $2,334.90 as of April 10, 2024, the total value of all gold amounted to approximately $18.23 trillion. In this context, bitcoin's total value represented about 7.6% of the total value of all gold.\n\nWhile bitcoin is the most well-known cryptocurrency, it is far from the only one. Including other major cryptocurrencies like Litecoin, Monero, and Ethereum, the total market cap for cryptocurrencies was around $2.6 trillion as of April 10, 2024. This constituted roughly 0.56% of the total global money supply.\n\nCryptocurrencies, including bitcoin, are known for their volatility, liquidity issues, and susceptibility to price manipulation. Potential investors are advised to thoroughly understand the risks associated with these digital assets.\n\nBitcoin, as a pioneering cryptocurrency, occupies a unique position in the global financial ecosystem. Its comparison to traditional assets like gold highlights its growing relevance and potential as a store of value, despite constituting a small fraction of the world's total monetary wealth. As the digital currency landscape evolves, bitcoin continues to be a significant player, reflecting broader trends in the move towards virtual assets.\n\nStory continues\n\nEthereum's Price Recovery: A Path to $3,600\n\nEthereum has shown resilience by holding above the crucial $3,400 support zone, indicating a possible recovery from recent losses. However, to sustain an upward trajectory in the near term, it must breach the $3,600 mark.\n\nThe digital currency witnessed a downturn, dipping below the $3,500 threshold and momentarily breaching the $3,450 support level. Ethereum found its lowest point at $3,408 before initiating a recovery, paralleling Bitcoin's upward movement. This recovery saw Ethereum surpass the $3,500 resistance, reaching the 50% Fibonacci retracement level from its previous high of $3,726 to its low of $3,408. Additionally, Ethereum managed to break through a downward trend line on the ETH/USD hourly chart, signaling a potential reversal of the bearish trend.\n\nEthereum currently hovers around the $3,500 mark, closely aligned with the 100-hourly Simple Moving Average, suggesting a balanced market sentiment. Immediate resistance is identified near $3,600, correlating with the 61.8% Fibonacci retracement level from the recent high to low swing.\n\nShould Ethereum overcome the $3,650 resistance, it might target the $3,725 level, setting the stage for a possible move towards $3,780. A decisive break above $3,800 could catalyze a bullish momentum, possibly propelling the price to the $3,880 zone and, in an optimistic scenario, to the $4,000 mark.\n\nConversely, failure to surpass the $3,600 resistance could trigger a new round of selling. Immediate support is found near $3,520, with significant support at the $3,500 and $3,400 levels. A breach below $3,400 might lead to a decline towards $3,320, and further losses could potentially push the price down to $3,240.\n\n\n\n\n\nFurrever Token: A Charming Alternative in the Cryptocurrency World\n\nIn the dynamic realm of cryptocurrency, Furrever Token (FURR) is making waves as an innovative alternative to the more traditional altcoins. Standing out with a unique blend of charm and community spirit, FURR is distinguishing itself amidst giants like Solana (SOL) and Ethereum (ETH).\n\nWhat sets Furrever Token apart is its commitment to adding a touch of charisma to the crypto industry. Moving beyond mere transactions and functionalities, FURR captures the hearts of its users with enchanting digital cat imagery, offering an enjoyable and lighthearted experience. This not only differentiates FURR from its counterparts but also fosters a sense of community and collective enjoyment among its enthusiasts.\n\nAt its heart, Furrever Token prioritizes creating a welcoming and inclusive community. The introduction of cat-themed visuals, stickers, and emojis into its platform not only enhances user engagement but also promotes a sense of unity and camaraderie among its members. This focus on community building is a cornerstone of FURR's strategy, making it more than just a cryptocurrency but a shared experience.\n\nFurrever Token's approach to token distribution is equally impressive, with about 9 billion tokens in total supply. A significant 65% of these tokens are allocated for a presale, aimed at ensuring a broad and fair distribution. Additionally, locking 10% of the total supply for a year underscores the team's dedication to the project's longevity and the trust of its community.\n\nThe market has responded favorably to Furrever Token, with over $720,000 raised within a month of its launch. This remarkable feat underscores FURR's growing appeal and its viability as an investment in the crypto market. With its price currently at $0.00048, Furrever Token demonstrates a steadily increasing value, attracting the attention of investors and cryptocurrency enthusiasts alike.\n\nFurrever Token (FURR) presents a compelling case for those looking for an alternative in the cryptocurrency space. Through its unique charm, strong community focus, and thoughtful tokenomics, FURR is carving out a niche for itself against competitors like Solana and Ethereum. As it continues to build momentum, Furrever Token stands as a testament to the potential of innovative and engaging approaches in the world of digital currencies.\n\nWrapping Up\n\nThe cryptocurrency market remains a dynamic and complex ecosystem, with Bitcoin and Ethereum continuing to dominate the landscape, while new entrants like Furrever Token offer fresh perspectives and opportunities. As these digital currencies evolve, they reflect broader trends towards virtual assets and the increasing integration of cryptocurrencies into the global financial system. Investors and enthusiasts alike are advised to stay informed and consider the unique characteristics and potential of each cryptocurrency. The future of the cryptocurrency market holds both challenges and opportunities, with innovation and community engagement at the heart of its growth and sustainability.\n\nDiscover one of the exclusive opportunities in the 2024 pre-sale stage now:\n\nFurrever Token Official Website | Visit Furrever Token Presale\n\nJoin Official Telegram Group | Follow Official X Account\n\nMedia Contact: Robert Smith support(at)furrevertoken.com https://furrevertoken.com/\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\n\n\n\n\nCONTACT: Robert Smith support@furrevertoken.com\n\n\n\n"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE5Zd0xCNFpRZ0s1djdZckVPckJpZWlONzhtZlBlYnZmMTliY1RsLUNiQWR6WW83ZjhUUGFkZmUwZlBwV2hmYmNnT3d4YXhfbFgtRzRHYWlrUEZYMXFBVUJsbUd3eGR1WkhLS29fOEdVVlMwQ3JYc3Bz0gF8QVVfeXFMTWw1RWw2eGxOZG9QM0ZtVm5kVmNlekVDSkNwZTdkUDUweHJ4THBYYVRRWEpWZ3QxWV8tSWVPUG16a21sbk1YcFI5WlBZZUpLWjlEc0V1MW5IZjRXRzMzbklROUxnQTRXVkNEaFo5NGhsV1J0ZnhfWWxiRTBJNg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Apr 2024 07:00:00 GMT",
        "title": "Ethereum ETF Nearing Approval on Monday in Hong Kong - U.Today",
        "content": "Hong Kong is reportedly nearing a significant milestone on the cryptocurrency market, with indications suggesting the imminent approval of spot exchange-traded funds directly investing in Bitcoin (BTC) and Ethereum (ETH). Bloomberg's sources have suggested that regulatory approval could be granted as soon as Monday.\n\nAdvertisement\n\nAmong the anticipated issuers are the international arm of Chinese asset manager Harvest Fund Management and a partnership between Bosera Asset Management and HashKey Capital. These entities intend to launch spot Bitcoin and Ethereum ETFs pending approval from the SFC and finalizing listing details with Hong Kong Exchange.\n\nThe potential approval of crypto-oriented ETFs in Hong Kong mirrors recent developments in the United States, where the introduction of spot Bitcoin solutions earlier this year has garnered significant attention and market activity.\n\nAdvertisement\n\nWhen Ethereum ETF in US?\n\nInterestingly however, while Bitcoin ETFs have been approved in the US, solutions for Ethereum are still very much a question there. In Hong Kong, however, neither of these instruments is available yet, but if rumors become facts, both solutions will be presented on this market at once.\n\nThe situation with Ethereum ETFs in America is in an unclear state. It is known that the deadline for the SEC to make a decision on the applications is set for May 23. However, not only does the regulator not comment on the whole situation, but it also initiates investigations against the Ethereum Foundation - a key nonprofit organization associated with the altcoin.\n\nIn the absence of specifics, the discussion field is full of the opinions and assessments of various experts from the banking sector. If we gather some consensus from them, the picture for Ethereum ETFs on the U.S. market does not look favorable so far."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxOOUNQZVZIX0NmZWxXQnp3dHhpOG5PaFJmZWFFTHlaMEJnclZCUlBpRGRYZTFTbEZ5UU5IRjJjZHBIZm5nYjJqZWZZWVpSd3g3bUpqLUVXN2hzaE80cmZkUG5NUlpDMWNFaTNkV2Z5TUZmazFUc2NXMlhDREQyRUN3SnlZd1RGaE5I?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Apr 2024 07:00:00 GMT",
        "title": "BlockDAG's DAGpaper Launch Sparks 20,000x ROI Predictions Amidst SHIB & Ethereum L2 Optimism - Yahoo Finance",
        "content": "BlockDAG Network\n\nLondon, UK, April 11, 2024 (GLOBE NEWSWIRE) --\n\nBlockDAG's unveiling of the V2 Whitepaper, the DAGpaper, in Las Vegas signifies a monumental breakthrough in the crypto realm. Amidst optimistic forecasts for SHIB's price and Ethereum's Layer-2 solutions, BlockDAG's $15.8 million presale surge cements its status as a trailblazer, setting the stage for exponential growth in the crypto market.\n\n\n\n\n\n\n\n\n\n\n\nSHIB Price Predictions and Market Enthusiasm\n\nThe Shiba Inu community's push for a dedicated SHIB ETF, accompanied by a petition boasting over 5,000 signatures, sets an optimistic tone for SHIB's future. Insights from BitMEX Research suggest a potential inflow of $2.425 billion into SHIB if it captures 20% of Bitcoin ETF inflows, amplifying positivity around SHIB's price trajectory.\n\nUtilizing Bank of America's multiplier effect, SHIB's market cap could surge by $24.25 billion, leading to a substantial 157.6% increase in value. Such projections showcase SHIB's potential to rise from its current $0.00002654 to $0.00006838, presenting a lucrative opportunity for investors in the meme coin space.\n\nEthereum Layer-2 Scalability and Ecosystem Growth\n\nEthereum Layer-2 solutions, including Arbitrum, Blast, and Optimism, enhance the blockchain's scalability and efficiency. These platforms have witnessed significant growth, evidenced by their impressive rankings in total value locked (TVL) on DefiLlama. Anticipated upgrades like EIP-4844 aim to streamline Ethereum Layer-2 operations further, reducing data posting costs and enhancing overall performance.\n\nVanEck's report forecasts a promising future for Ethereum Layer-2 platforms, projecting their expansion into diverse sectors beyond finance, including gaming, social media, and infrastructure. This evolution positions Layer-2 solutions as fundamental components of the global blockchain ecosystem by 2030, promising extensive opportunities for growth and innovation.\n\n\n\n\n\n\n\n\n\nBlockDAG: Pioneering the Crypto Revolution\n\nIn the heart of Las Vegas, BlockDAG made waves with its V2 Technical Whitepaper launch and remarkable presale success, surpassing $15.8 million across eight batches. With over 7 billion coins sold and more than 4500 miners distributed, BlockDAG has emerged as the fastest-growing crypto project, epitomizing innovation and community-driven progress.\n\nBlockDAG's ecosystem encompasses a range of offerings, including X series miners, BDAG coins, and the innovative Crypto Payment Card, poised to revolutionize everyday transactions with cryptocurrency. Introducing Low Code and No Code smart contract features further enhances BlockDAG's appeal, democratizing development and promoting inclusivity within its ecosystem.\n\nStory continues\n\n\n\n\n\n\n\n\n\nPositioning for Unprecedented Growth\n\nAmidst SHIB's bullish trajectory and Ethereum's Layer-2 advancements, BlockDAG's strategic initiatives solidify its position as a leader in blockchain solutions, attracting a diverse user base worldwide. With experts projecting a staggering 20,000% ROI and strong demand evident in its presale phase, BlockDAG stands poised for unparalleled growth and evolution in the crypto landscape.\n\nIn conclusion, BlockDAG's DAGpaper release ignites excitement and optimism, offering investors a gateway to participate in the next phase of the crypto revolution. With its innovative technology, strategic vision, and robust community support, BlockDAG epitomizes the future of digital currencies, promising substantial returns and transformative advancements in the blockchain sphere.\n\nInvest In BlockDAG Now\n\nWebsite: https://blockdag.network\n\nPresale: https://purchase.blockdag.network\n\nTelegram: https://t.me/blockDAGnetworkOfficial\n\nDiscord: https://discord.gg/Q7BxghMVyu\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\n\n\n\n\n\n\n\n\n\n\n\n\nCONTACT: Brown Williams support at blockdag.network\n\n\n\n"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMibkFVX3lxTFBEaGh5cmNHVVhuMzFiTGZGYVhtd1hRQm9PWmd0V2sxVkVLNnRVTWpqZFIxN2xfZUp4aFdLS194UjI1XzVyY0dPdThUeUpXTW5GZ2tfYnZQX2ZmWVNBVFRtWDJXVU9SSmxsWHJ1V1hn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Apr 2024 07:00:00 GMT",
        "title": "NFTs and the Environment: What You Need to Know - Investopedia",
        "content": "Non-fungible tokens (NFTs) and ordinals are assets that are tokenized using a blockchain. Because blockchains use energy, NFTs can contribute to greenhouse gas emissions and climate change through their production, exchange, and storage.\n\nLearn more about NFTs and ordinals, their environmental impacts, and steps users can take to be more aware.\n\nKey Takeaways Non-fungible tokens (NFTs) may contribute to wasteful energy use and carbon output, depending on how they are produced.\n\nEthereum is the leading blockchain used to mint NFTs. It transitioned from a Proof-of-Work (PoW) to a Proof-of-Stake (PoS) consensus mechanism on Sept. 15, 2022. The transition, called The Merge, caused a significant reduction in NFT energy use.\n\n\n\nBlockchain developers and communities are working to find ways to lessen or eliminate the environmental impact NFTs have.\n\nUsers can lower their impact by choosing blockchains with less energy-intensive requirements.\n\n\n\nHow NFTs Impact the Environment\n\nNFTs are generally built on Ethereum or blockchains similar to it. Ordinals are similar to NFTs but created on the Bitcoin blockchain or blockchains like it.\n\nDepending on the programming and design of the blockchain on which these NFTs and ordinals reside, these transactions can consume significant amounts of energy.\n\n\n\nThis article uses \"NFT\" to refer to NFTs and ordinals for brevity.\n\nEnergy consumption occurs when an NFT is minted, bought, sold, and stored. Here's a look at each of these stages of the NFT lifecycle:\n\nNFT is minted : The NFT creator uploads an image or other digital asset to a blockchain (including its metadata), which tokenizes and stores the NFT's information on the blockchain. Tokenization is the process of generating a public key and a private key to access a cryptocurrency wallet. The NFT is minted through this process.\n\n: The NFT creator uploads an image or other digital asset to a blockchain (including its metadata), which tokenizes and stores the NFT's information on the blockchain. Tokenization is the process of generating a public key and a private key to access a cryptocurrency wallet. The NFT is minted through this process. NFT is listed : Once the NFT is minted on a blockchain, the creator can list it for viewing on an NFT marketplace at a set or auction price.\n\n: Once the NFT is minted on a blockchain, the creator can list it for viewing on an NFT marketplace at a set or auction price. NFT is sold/purchased : When the NFT is purchased, a blockchain transaction is initiated. The blockchain network goes to work validating the transaction and transferring ownership of the NFT to the new owner.\n\n: When the NFT is purchased, a blockchain transaction is initiated. The blockchain network goes to work validating the transaction and transferring ownership of the NFT to the new owner. Storage: The asset—a file, image, and so on—is stored off-chain, such as on the interplanetary file system (IPFS).\n\nMinting an NFT is a separate transaction on a blockchain, as is transferring ownership during a sale. All transactions use energy.\n\nNon-Transactional Energy Use\n\nNFTs also require storage, even if there isn't transaction activity. These tokenized assets are generally digital assets such as documents, images, and videos, all requiring digital space. Blockchains themselves are not equipped to store these assets, so only the tokens (alphanumeric sequences that are the result of hashed data) are stored on the blockchains. The assets are stored elsewhere, such as on the interplanetary file system (IPFS). The IPFS was created as a decentralized and distributed storage system for platforms that need it, like blockchains.\n\nData storage requires energy. As the number of NFTs grows, the overall energy consumption and storage space of NFTs are likely to increase.\n\nElectronic Waste\n\nIn addition to energy consumption, electronic waste (e-waste) is an issue. If a blockchain relies on mining, like Bitcoin does, hardware is continuously improved and upgraded.\n\nMining typically uses hardware such as central processing units (CPUs), graphics processing units (GPUs), and application-specific integrated circuits (ASICs) to solve increasingly difficult cryptographic problems. This hardware can quickly become outdated—it's also subject to 24-hour 100% usage, which wears electronic circuits out. Updating and replacing faulty equipment creates tons of e-waste.\n\nE-waste contains hazardous materials, such as lead, mercury, and cadmium, which can leach into the environment if improperly disposed of. Additionally, the processing of e-waste is energy-intensive and can contribute to greenhouse gas emissions. Hardware that isn't recycled ends up in landfills, releasing toxins into the environment.\n\nRecycling e-waste significantly lowers the energy consumption of manufacturing new electronic products by reducing the mining and processing of new raw materials, particularly precious metals.\n\nImproving the Sustainability of NFTs\n\nGiven the potential environmental impact of NFTs, there is a movement to develop more sustainable blockchain and NFT protocols. Additionally, artists, buyers, and sellers can choose to use NFT platforms and blockchains that use less energy. These would likely include less energy-intensive consensus mechanisms and, to a point, blockchains with hotspots in areas that use renewable energy sources.\n\nTo determine blockchain sustainability, you must inspect where nodes are located and determine the significant energy sources in those areas. For example, the Ethereum network has 2,900 nodes (the most) in the U.S., the energy generation of which is 79% from petroleum, natural gas, and coal. The U.S. also has about 1,600 reachable Bitcoin nodes. It's safe to say that platforms using a blockchain with a significant presence in the U.S. are not as energy efficient as they could be. However, Ethereum uses less energy, so in the U.S. it's a better choice.\n\nRenewable Energy\n\nBlockchain mining and hardware recycling often rely on burning fossil fuels, leaving a significant environmental footprint. Renewable energy sources, such as solar energy, wind energy, hydroelectric energy, geothermal energy, and biomass energy, offer eco-friendly alternatives to power these operations.\n\nSolar Energy : Solar panels are installed to capture energy from sunlight, which is then converted into electricity.\n\n: Solar panels are installed to capture energy from sunlight, which is then converted into electricity. Wind Energy : Wind turbines erected in windy areas can generate electricity from the kinetic energy of the wind.\n\n: Wind turbines erected in windy areas can generate electricity from the kinetic energy of the wind. Hydroelectric Energy : Hydroelectric power is taken from water sources, such as rivers or dams.\n\n: Hydroelectric power is taken from water sources, such as rivers or dams. Geothermal Energy : Geothermal power comes from active geothermal resources, such as volcanoes or hot springs.\n\n: Geothermal power comes from active geothermal resources, such as volcanoes or hot springs. Biomass Energy: Biomass energy consists of organic materials. Plants, crops, and agricultural waste can be burned to generate heat or converted into biofuels.\n\nConsensus Mechanisms\n\nShifting from Proof-of-Work (PoW), the consensus mechanism for Bitcoin and other mining-based blockchains, to more energy-efficient ones, such as Ethereum's Proof-of-Stake (PoS) model, can significantly reduce the environmental impact NFTs have. PoS eliminates the competitive mining and reward process altogether.\n\nPoS consumes significantly less energy than PoW because PoS does not require miners to expend energy in a competition to solve a cryptographic problem. Instead, PoS uses a system called staking, where validators who have staked cryptocurrency—basically locking it from being used—on the network are randomly chosen to verify transactions and propose new blocks.\n\nEthereum is expected to consume about 5.36 gigawatt hours of electricity annually, while Bitcoin is expected to consume about 173.19 terawatt hours annually, more than Poland and Egypt.\n\nSome notable PoS blockchains include:\n\nEthereum : The Ethereum blockchain is used for almost everything from simple token exchanges to NFTs, smart contracts, decentralized apps (dApps), and more. The NFT marketplace OpenSea is built on Ethereum.\n\n: The Ethereum blockchain is used for almost everything from simple token exchanges to NFTs, smart contracts, decentralized apps (dApps), and more. The NFT marketplace OpenSea is built on Ethereum. Solana : The Solana blockchain supports a broad range of NFT marketplaces, including Magic Eden, Solanart, and Rabbit Hole.\n\n: The Solana blockchain supports a broad range of NFT marketplaces, including Magic Eden, Solanart, and Rabbit Hole. Algorand : The Algorand blockchain supports Aorist, an NFT blockchain, and several other NFT marketplaces.\n\n: The Algorand blockchain supports Aorist, an NFT blockchain, and several other NFT marketplaces. Cardano : Hosts some NFT marketplaces like Galaxy of Art.\n\n: Hosts some NFT marketplaces like Galaxy of Art. Tezos: The Tezos blockchain hosts several NFT marketplaces, such as Rarible, which operates an NFT marketplace and supports the artistic creation of NFTs.\n\nWhy Does an NFT Use So Much Energy? Non-fungible tokens use energy because they require a blockchain network to conduct work verifying them as transactions. More transactions require more energy.\n\nAre NFTs Harmful to the Environment? Creating, selling, and buying an NFT require energy and hardware use, which can lead to pollution or e-waste that would not otherwise be necessary if they did not exist.\n\nWhat Is the Carbon Footprint of an NFT? It is hard to determine what one NFT costs regarding carbon generation, but it's safe to say that they add to human activities' total carbon output.\n\nThe Bottom Line\n\nNFTs leave a carbon footprint at every stage of their existence, but conscious choices and prioritizing eco-friendly practices in how they are created, traded, and stored can offset their potential impact on the environment.\n\nCryptocurrency developers can reduce NFT energy consumption by improving or switching to less energy-intensive blockchain consensus mechanisms. NFT minting and hosting platforms can use blockchains that don't require large amounts of energy.\n\nThe comments, opinions, and analyses expressed on Investopedia are for informational purposes online. Read our warranty and liability disclaimer for more info.\n\n\n\n"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxPdkpLWU5mejlCVTlWZXdYWGtMdExSUnE4SEtXX3hTQy14TTczc3RqanRSd0NOYi1RNGFKckFtM1ByZmFsZnVxYkRVMzBjTHZFcXZYVktUbFBPa2pwRkFVa2VTTDBYRVowVjAtaU83cmQtaDZ1YnlJRDd5Wkw3SUtnZHlFTk5xa1d0TFdLWG1Qd9IBlwFBVV95cUxNSEFpSk5FNFkzaEd6YkVRaEYzZUV3U3Z3RTFzaHFKdFFYaHliM3l3V0NKMF9jMEpVOFBqSGgyQzIyUXlXU2tYUlM4T1l3V0dKVm9vdC1xWEh0eWtudzdFWDBuYzdGdUhxUjA5NlB0OU5wbGphSVo2NE5qM05rNDBSSEg0SFdMUFI0TE5mRXBvaG1PTnltQU5R?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Apr 2024 07:00:00 GMT",
        "title": "What Is Berachain? The Latest Ethereum, Solana Challenger to Raise Big Money - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nPseudonymous founders with bear-themed names have raised $100 million in funding for Berachain—a layer-1 blockchain built with Cosmos tech.\n\nAnnounced Friday, the Series B funding round was co-led by Brevan Howard Digital, an investment management platform, along with crypto-native VC firm, Framework Ventures. Additional backers include Polychain Capital, Samsung Next, Hack VC, and Hashkey Capital, with angel investors such as Polygon co-founder Sandeep Nailwal and Animoca Brands Chairman Yat Siu.\n\nInvestors signed a SAFT agreement, which exchanges current funds for future tokens. The move comes just days after Monad Labs announced its own $225 million raise to build a layer-1 chain to rival giants like Ethereum and Solana.\n\n“We see this raise as a major validation of our approach to building a blockchain that’s built on feedback from real users and developers, and driving value to those groups who are actually contributing to the network’s growth,” Berachain co-founder Smokey the Bera said in a press release.\n\nAD\n\nAD\n\nBerachain plans to use the $100 million raised to strengthen its “economic growth initiatives and engineering resources,” as well as expand its global presence into Hong Kong, Singapore, South East Asia, Latin America and Africa.\n\nPlenty of capital, plans to expand, and confidence from big investors—but what is Berachain?\n\nWhat is Berachain?\n\nFounded by Smokey the Bear, Homme Bera, and Dev Bear, the EVM-compatible layer-1 blockchain Berachain aims to align incentives for security and liquidity at the network level.\n\nBuilt on the Cosmos SDK, the layer-1 chain uses the proof-of-liquidity consensus mechanism. This model builds on what proof-of-stake created and attempts to address its limitations.\n\nAD\n\nAD\n\nBy providing liquidity to pools, using the network’s native BERA tokens, users earn Bera Governance Tokens (BGT). You can then delegate these tokens to validator(s) who will produce blocks based on the amount of BGT delegated to them. Then, validators vote on future BGT inflation across liquidity pools and distribute block rewards (called bribes) to delegators.\n\nBerachain argues that this model “increases security by increasing liquidity,” decentralizes inflation, and aligns all parties involved in the ecosystem.\n\n“The Berachain team has essentially built a blockchain that allows users to play a direct role in incentivizing certain apps and even industries to build on their chain, which is a fascinating model for ecosystem growth that we’ve never seen before,” Vance Spencer, co-founder of Framework Ventures, said in the funding announcement.\n\n“The Berachain community is one of the most energized I’ve seen in all of crypto,” Spencer continued, “and I’m excited to see what they will do once they’ve been given the ability to directly shape the future of their chain.”\n\nThe project was originally an NFT project called Bit Bears, which the Berachain website says was simply started for a bit of fun. It saw great success, however, leading to a “massive cult community.” This was when the founders saw the vision for what Berachain has become today.\n\nTwo months ago, the Berachain testnet was launched, which the press release claims was the “most utilized testnet in blockchain history” with over 300,000 users and 1 million transactions processed in its first 48 hours. Berachain plans to launch its mainnet sometime this quarter.\n\nEdited by Andrew Hayward\n\nAD\n\nAD"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxNaUlPaldFR051VEwtbkV1cWNBUnM1MkpzdkJSRGQ1eldkZjYzUkI0RzJsVjV6cEJBODBkZDhrR3l2MUJORFhMS09oTWp4S2VHN2tFZE5IZGpSN3pRcFhuQnFSTEQxMXRfWXQ3RWo0c2ZjdXlOUWJ1ZWZTaWlXVEpSeGFEamlJVlBGUnkyUkpJZm5OcnMxQWY4alQweERSb2NROG1GVG5ia0dTUXgwZk9OV3ZralNYa1dKUDlNZUwybFllSWhab1Q5NkR5X094LWMwcnJZRE5B0gHbAUFVX3lxTE5XODhoSXppZmhmcTR3eWI2NTliNXZOVlJMLTB0RjBSZkItQzFDN1dCVEVDMXBfNkswdzFDLWJqZXAtdGI0RUZ5MVFnZUh3WkZCVWc1UzRqN3V1SndVZ0h5dFZkVV9rLUFwalJ3cDVqbmtmOHZBX1NuYVBYeEd6LUhHbzZ1dnAzaWhxRGhUWWFqaDRDN2VDT0w2WVAwUmp6MV9MbHhRLWd4ek0waTdUalR5c002am1fc0Y1RzR3eDdGejB1OVZzODFXQTh1cTBFY0pZNlRzWk0zRDRRbw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Layer-3 Altcoins Have ‘Serious 100x Potential’, Says Coin Bureau’s Guy Turner – Here Are His Top Picks - The Daily Hodl",
        "content": "The host of the Coin Bureau channel Guy Turner is expressing bullish sentiment on Ethereum (ETH) layer-3 scaling solutions.\n\nTurner tells the 2.46 million subscribers of the Coin Bureau YouTube channel that the native tokens of layer-3s (the scaling solutions built atop layer-2s) have massive upside potential going forward.\n\n“The thing is layer-3s are also super efficient, making them perfect for things like gaming, decentralized finance (DeFi) and much much more besides. As such, layer-3 chains and the cryptos launching on them have some serious 100x potential.”\n\nAmong Turner’s top layer-3 picks include Degen Base (DEGEN) which is built on the Base layer-2 project, an Ethereum scaling solution backed by Coinbase crypto exchange, and Xai (XAI).\n\nSays Turner,\n\n“Not surprisingly its native Degen [chain] token was originally launched as a meme coin but also aims to reward engagement on its channel on Farcaster, a sort of decentralized version of Twitter. Since then Degen has garnered the attention of developers, content creators and enthusiasts alike…\n\nAnother layer-3 is Xai, a gaming-focused project that’s built on Arbitrum.”\n\nDEGEN is trading at $0.0355 at time of writing while XAI is changing hands at $1.02.\n\nNext up is Orbs (ORBS).\n\n“Now Orbs is a layer-3 that’s actually sandwiched between the layer-1 and the layer-2s serving as a decentralized backend to enhance EVM (Ethereum Virtual Machine) and non-EVM compatible smart contracts to support things like web3, DeFi, NFTs (non-fungible tokens) and GameFi (gaming and DeFi).”\n\nORBS is trading at $0.0431 at time of writing.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMi-AFBVV95cUxNWmlfOENkNkFXX2F5UDJYVTlfSVpubklrcEVyQWo3Y3c4UTZ5SWRvNjRqZE5RRC0zU2QyQ255MFNpYmRXSkFxRFVhM2dRYzVJeHNaenM0dWlyWGwxTm56angxMDhKTXI0UTlYMGxzWXB5dV9rY1owdnRQYWtyNmduUWhuX1VQQTJuaFc2MUVPSkdSc0MwZXRxSnlLWGNQa01TS29TNmFVODl4UERaV05ja18yeUxFSlU1akQ0NXRJN0VFWlZmU2VwOGJQU1dLQlNJVzNUYnptc2p5dGlOS01SdDRWWVY2bXNPSHY2LUVVZ19TOVRxZDdiSNIB_gFBVV95cUxNY3FITm9BM3ZDSWo2RjhIeExvN0FjRThuelN1WGE5d1BsdUR1T05peXo4WHFlUXdIbWkyQXhiUUZzSnk1NkFKa0FOek85ZVJuWGhGYmZNekFvcVJvSEhvZ2VOa2t0Y21mclJWcGJTRGdybHBqODJfQ1Q3QUVVa19sWDFYd25oTUJYb3FjYS1mTC1McENIbjNpN1otY1ZYVmtyTjdUeHJLQmdISTdBN0N0TEhETFpfaklDWlMtME9SYXRCa0RFbVBNN3RzYTlZU3pqTnJoT2pYWW1lUk9sUUVyOXpUeW5kaTJKRmlnX2dMeWs4Z0xJQTdNRzRhbTRnUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Apr 2024 07:00:00 GMT",
        "title": "Ethereum extends correction as Van Eck CEO dampens chances of spot ETH ETF approval - FXStreet",
        "content": "Van Eck's CEO says Ethereum ETFs are less likely to be approved in May because the SEC has remained silent.\n\nFollowing the crypto market correction, Ethereum is down 3.8% as ETH's long liquidations have topped Bitcoin's.\n\nEigenLayer's launch on Ethereum Mainnet could add momentum to DeFi's liquid restaking boom.\n\nEthereum (ETH) is expected to see a price increase in the coming weeks, considering the upcoming Bitcoin (BTC) halving and a potential spot ETH approval. However, on Tuesday, Jan Van Eck, CEO of investment firm Van Eck, stated that the Securities & Exchange Commission's (SEC) silence already indicates a negative outcome as the May 23 deadline for a decision approaches.\n\nRead more: Ethereum could be set for growth as Vitalik Butein shares update on its future\n\nDaily digest market movers: Ethereum ETF approval, low transaction fees, restaking boom\n\nIn the wake of a rally that saw ETH tagging $3,730, a general market correction has forced the largest altcoin back to a previous consolidation range formed in March. Here are the recent ETH market movers:\n\nJan Van Eck, CEO of investment firm Van Eck, has said that the SEC's approval of a spot Ethereum ETF by the May deadline is unlikely as the regulator has yet to respond to filings. \"We've filed our S1, and we haven't heard anything. So that's kind of a sign. It won't happen without getting the disclosure documents in order,\" he said to CoinDesk. The SEC faces a May 23 deadline to decide whether or not to approve Van Eck's spot Ethereum ETF filing.\n\n\n\nUnlike Bitcoin ETF applications, which the SEC commented on and engaged institutions about before approval in January, the SEC hasn't commented on Ethereum ETF filings. As a result, other analysts like Bloomberg's Eric Balchunas and James Seyffart have also expressed similar sentiments to Jan's, lowering their odds of an ETH ETF approval in May to 25%. However, Grayscale's chief legal officer, Craig Salm, has previously stated that silence from the SEC doesn't hurt Ethereum's chances of approval.\n\nAlso read: Ethereum's price recovery looks imminent as ETF approval sees a glimmer hope\n\nWhile Ethereum ETFs have grabbed most of the headlines, Jan told CoinDesk that reduced transaction costs via Layer 2s and the Solana network is the most important story in crypto that people don't often talk about. He mentioned how these networks can scale, improve adoption, and keep costs predictable. Ethereum Layer 2s have enjoyed low fees since the Dencun upgrade on March 13.\n\n\n\nFollowing Jan's comment, restaking protocol, EigenLayer went live on the Ethereum Mainnet on Tuesday after accumulating $13.56 billion in total value locked (TVL) since its launch. With its Mainnet launch, Ethereum may experience increased restaking activity in addition to the boom of liquid restaking tokens already making waves on its blockchain. EigenLayer also launched the EigenDA, an actively validated service that aims to address Ethereum's data availability problems by \"ushering in an era of cost-effective scalability.\"\n\nTechnical analysis: Ethereum could test the $3,406 support\n\nEthereum's price resumed a consolidating move on Wednesday after a bearish move that saw it shed nearly 4% of its value in the past 24 hours. The move indicates liquidity is still being collected after the bullish spike on Monday.\n\nRead more: Ethereum on course to post weekly losses as debate over security status continues\n\nWhile Ethereum's price movement mimics that of the general crypto market - as many altcoins have also been consolidating - its long traders have been affected the most by the market correction. ETH long liquidations crossed $60 million on Wednesday, higher than that of Bitcoin long traders despite lesser volume, according to data from Coinglass. As a result, long traders may exercise more caution while leaving room for bears to prevail.\n\nETH/USDT 1-hour chart\n\nIf this happens, ETH will likely break the $3,406 support. At the time of writing, Ethereum is trading at $3,483."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE85NFF3OXhSY1ZQS2FtUFRGNm1kNDRVMUVsUUV5dFpPR2NIMmRteldFTUtDZE5abzhXckwxRS1JSEVqYVhldFBRWEVDYVFvc1I0V1ltZFNQV1VpV2NhemlaeXp6MWFJdnhnS0IxQmlIZVA2d2RrT0I5OTZzWHY1dw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Apr 2024 07:00:00 GMT",
        "title": "5 Reasons Ethereum is Losing Ground to Bitcoin - CoinGape",
        "content": "Ethereum has frequently been recognized as the foundation of smart contracts, and decentralized finance (DeFi). However, it has recently faced challenges in preserving its status in comparison to Bitcon. Despite the fact that ETH started the year strongly even hitting new highs, it has slowed down in its progress, compared to BTC. In this articles, we will delve into reasons why Ethereum, the top altcoin, is losing ground, and finding it difficult to compete with Bitcoin.\n\nReasons Ethereum Is Loosing Ground Against Bitcoin\n\n1. Performance Disparity\n\nEthereum experienced a drop of 12.2% in its value over the past month, however Bitcoin has only decreased 1.5% over the same period. This is a big difference, demonstrating that ETH is struggling to match BTC’s bullish performance.\n\nBeyond Bitcoin, Ethereum is also underperforming its layer 1 competitors. Solana (SOL) and Binance Coin (BNB) have shown significant performance, increasing in prices by 14.2% and 17.1% respectively. This shows that Ethereum is also struggling to hold on to its dominance position amid increasing competition within the crypto market. Moreover, Polkadot, Cardano and Solana are increasingly becoming popular by handling issues of scalability, offering new features that attract users and developers. As they innovate and gain market share in NFTs and DeFi, there is no longer market dominance assurance for Ethereum.\n\nadvertisement\n\n2. Declining On-Chain Activity\n\nAn essential part of Ethereum’s attractiveness is found in its lively ecosystem of decentralized applications (DApps). Yet, recent information indicates a troubling decrease in Ethereum’s activity on the blockchain, indicating a drop in user participation and transaction rates. . Core indicators like active addresses and transaction volumes have seen significant declines in the last month, showing a decrease in interest in the Ethereum network.\n\nThe decrease in transaction volume of Ethereum DApps, especially in platforms such as Uniswap and MetaMask Swap, highlights a larger pattern of decreased interest in Ethereum services. According to Glassnode, the number of active addresses on Ethereum decreased from 622,963 to 499,448, over the pasat 30 days. Although the top altcoin according to CoinMarketCap remains dominant in the DeFi industry, rivals such as Solana are starting to gain market share thanks to the surge in activity caused by meme coin craze and stablecoin transactions.\n\n3. Uncertainty Surrounding Spot Ethereum ETF\n\nOne major reason Ethereum is struggling against Bitcoin is the unknown approval status of an ETF for ETH. Hopes for the ETF have decreased in recent weeks, as it could bring in institutional investment and improve liquidity. The creators of the initial U.S. spot bitcoin ETF, like VanEck and CoinShares, do not believe the SEC will give approval for ether applications. Regulatory issues and postponements have raised uncertainty regarding the approval of an Ethereum ETF, leading to decreased investor confidence in Ethereum.\n\nThe doubts about the approval of a spot Ethereum ETF arise due to the limited communication by regulatory agencies, specifically the SEC in the United States. Even though they were initially hopeful, analysts and industry experts have now adjusted their expectations, with some foreseeing a slim chance of approval by the May deadlines.\n\nNice scoop from @joelight. Def interesting but no change our odds. As we've said, need SEC to give comments on the filing documents (the \"critical feedback\" he mentions) and that still ain't happening, even in person they offering nothing. Silence is violence. https://t.co/z76KTtdmHU — Eric Balchunas (@EricBalchunas) April 8, 2024\n\n4. Upcoming Bitcoin Halving\n\nBitcoin halving has been the center of attraction in the cryptocurrency industry since the year began. Approaching in less than 10 days, the event has shifted the focus of investors and finances towards BTC. Usually, the crypto community eagerly waits for halving, an event that results in the reduced supply of Bitcoin, and higher values for the coin. This change in focus and funding could result in Ethereum and other alternative coins not performing well.\n\nInvestors are optimistic about Bitcoin before the halving event, causing them to adjust their portfolios in favor of Bitcoin instead of assets like ETH. After the halving, market cycles typically become more optimistic, as investors focus on acquiring Bitcoin and pay less attention to Ethereum. With the growing interest in Bitcoin, its market dominance is expanding and impacting the performance of altcoins like Ethereum. Rumors surrounding the halving event may lead to increased volatility and a shift of capital towards Bitcoin, causing a larger performance difference between BTC and ETH.\n\n5. Regulatory Hurdles\n\nThe regulatory landscape for Ethereum presents obstacles for its expansion and acceptance. Bitcoin has achieved regulatory clarity, while Ethereum’s status is still uncertain, especially regarding its classification as a security. Ambiguous regulations hinder institutional involvement and investor trust in Ethereum, which limits its competitiveness with Bitcoin as a value store and investment option.\n\nAt the time of writing, Ethereum price is trading at $3,519.61, down 2.15%, while Bitcoin price is trading at $70.783 , up 0.21% over the last day.\n\nConclusion\n\nThe competition between Ethereum and Bitcoin is complex, arising from differences in performance, a decrease in on-chain transactions, upcoming Bitcoin halving, regulatory ambiguities, and a competitive environment. Although Ethereum continues to be a fundamental component of the cryptocurrency landscape, it is essential to tackle these obstacles in order to ensure its sustainability and importance in the future. As investors explore the changing crypto world, it is crucial to remain attentive and well-informed to spot potential opportunities and manage risks linked to Ethereum’s uncertain path."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxOZUxGRF90YXBvcGJTczUzcW1oX3N6dHkyQlUwTkxZNVlHTlJ6VnUtb3NRaEJHaUVJNFNjWERQU3NVVmlsQ3M5VHlEUmgzWW8wb2hjN2JPSnJxTFY4dGdGRTlYdTgyZ256WVEtRFhUTnBUeFR1cmplOVh4S25odEtMdU9YSFJmMndhMGtZc1hrN25yd1JndlgwV0V4bw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Apr 2024 07:00:00 GMT",
        "title": "Here is Shiba Inu Price if SHIB Hits Ethereum Market Cap - The Crypto Basic",
        "content": "Shiba Inu (SHIB) could see its price skyrocket by more than 24 times if it grows to capture the current market cap of leading altcoin Ethereum (ETH).\n\nShiba Inu’s market cap has seen a drastic decline since the cryptocurrency collapsed from the $0.000045 high on March 5. At this peak price, SHIB’s market cap hit a high of $26.5 billion, putting it among the top 10 assets by valuation and bringing it closer to flipping Dogecoin (DOGE).\n\nHowever, SHIB’s market cap has dropped to the current figure of $16.7 billion, representing a 37% drop from the recent high. Consequently, Shiba Inu has ceded its position within the top 10, descending to the 12th position as both Toncoin (TON) and Avalanche (AVAX) have surpassed it.\n\n- Advertisement -\n\nDespite the prevailing turbulence, Shiba Inu enthusiasts expect SHIB to eventually recover, with projections of a possible push above Dogecoin. Such a scenario would result in mind-blowing price gains for Shiba Inu.\n\nShiba Inu Price if It Hits Ethereum Market Cap\n\nAmid these sentiments, we assessed how much the price of Shiba Inu would be if it soared to hit the market cap of the king altcoin, Ethereum. ETH has solidified its spot as the largest altcoin in the market, boasting a market capitalization of $407.58 billion.\n\nNotably, Ethereum accounts for 15.8% of the global cryptocurrency market cap of $2.58 trillion. At the current valuation, Ethereum’s price currently sits at $3,388. We leveraged a data analytics tool to evaluate how much Shiba Inu’s price would be if it equaled ETH’s market cap.\n\nThe data indicates that Shiba Inu’s valuation is about 0.04x under Ethereum’s, emphasizing the massive gap between both assets. If SHIB captures Ethereum’s market cap, its price will skyrocket by as much as 24.36x to reach $0.0006898, representing a new ATH.\n\nInterestingly, some analytical platforms have projected timelines for Shiba Inu to reach prices around this region. The Crypto Basic revealed in February that Changelly analysts expect SHIB to reach $0.000712 by 2030. At this price, Shiba Inu’s market cap would soar to $419.5 billion, above Ethereum.\n\n- Advertisement -\n\nSHIB’s Current Position\n\nNotably, SHIB’s all-time high market cap was $43 billion, attained on Oct. 28, 2021, when Shiba Inu soared to its ATH price of $0.00008616, according to CoinGecko data. Shiba Inu would need to rally by another 206% to reclaim this all-time high price and slip into a price discovery phase.\n\nThe crypto market is already on a recovery path following the recent turmoil, with prices witnessing gradual growth over the last two days. Shiba Inu has leveraged this campaign to push toward reclaiming the $0.000028, $0.000029 and $0.000030 levels.\n\nAmid a 2.6% rise over the past 24 hours, Shiba Inu currently trades for $0.00002810. SHIB has reclaimed $0.000028, but its position above this price level remains delicate. It attempted to push above $0.000029 earlier but faced stern opposition."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxPYTQtOXdYUmVJMG9scHlIdXJDTkF5V1NRcFg3dnFRUjRRamVLM3pxVW9Lc1p1Um1fQ3Y4bFN2ZVA1NXpHY1NMSWpzZ0loS1JWWjlFaUh6VUtrWHkxOWs2U3FRM2hwX1hDTVgwNTdzZmRsMC1IUGgtX3dCc0l4RWxJb0ZUcF9GcGRvXzM2eWUxaXJTZW_SAZgBQVVfeXFMTU9mMG0xcHFfSDNzOGp0dUN6Y3B2akJlTlpzNEtMLVBKN3llcC1fclFramRjX0NETXlXeVlGdVFoTVVWa29tTjY1ZTR3TTNVREVHbS16clItbDVEVDVpTDhCX0VpSjM0Zk9DVy05amR3ak9LZGVBZkNwSkd0NnNLUWFCR0VOSW5BdFdVWkhUZlVlVEZmUGRhOTA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Apr 2024 07:00:00 GMT",
        "title": "A closer look at Ethereum’s market moves post CPI report - AMBCrypto English",
        "content": "Inflation has increased by 3.5%.\n\nEthereum has seen over 2% increase in the last 24 hours.\n\nEthereum [ETH] experienced a positive response following the release of the latest CPI report. This report garnered significant attention and discussions among traders, with many expressing a greater inclination towards crypto assets in light of the findings.\n\nCPI shows 3.5% inflation increase\n\nThe CPI for March surpassed expectations, rising by 0.4% compared to the anticipated 0.3% and February’s 0.4%. On a year-over-year basis, CPI increased by 3.5%, slightly higher than the expected 3.4% and February’s 3.2%.\n\nYear-over-year core CPI saw a slight uptick to 3.8%, slightly surpassing the expected 3.7% and remaining unchanged from February’s figure. This data suggests that a rate cut is unlikely soon.\n\nAccording to Santiment data, this month’s CPI report generated significant attention, evidenced by the highest number of mentions in social discussions. The social volume spiked to over 257, with social dominance reaching around 1.58%.\n\nAt the time of this writing, social volume had decreased to 49, while social dominance stood at 1.05%. The implications of this report have led to increased interest in crypto assets like Ethereum.\n\nBuy calls put Ethereum in a favorable position\n\nThe CPI report wasn’t the sole topic driving increased interaction; discussions around buy and sell calls also saw heightened engagement. According to Santiment data, on 10th April, the social volume for buy calls reached 814, with a social dominance of 4.97%.\n\nConversely, the social volume for sell calls was 533, with a social dominance of 3.25%.\n\nAt the time of this writing, the buy social volume had decreased to 210, while the sell social volume was 144. Additionally, the buy social dominance stood at 4.48%, while the sell dominance was 3.07%.\n\nThese figures indicate a stronger inclination towards buying among traders, a sentiment reflected in Ethereum outflows.\n\nEthereum sees more exchange outflow\n\nAnalysis of Ethereum’s exchange netflow reveals that the increase in buy calls following the CPI report is mirrored in its exchange flow. Data showed that outflow dominated ETH exchange flow, with over 15,800 ETH leaving various exchanges on 10th April.\n\nAs of this writing, outflow continued to dominate, with over 800 ETH already withdrawn from exchanges. This suggests heightened activity in ETH buying and selling post-CPI report.\n\nRead Ethereum (ETH) Price Prediction 2023-24\n\nEthereum continues to climb post-CPI\n\nThe daily timeframe chart showed that Ethereum closed with a gain on 10th April, suggesting that the CPI report did not have a negative effect.\n\nAnalysis of the chart revealed that ETH closed with over a 1% increase, trading at around $3,400. As of the latest data, the increase has persisted, with ETH trading at around $3,580, reflecting a further over 1% increase."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxQSG4zLW50ZEw0dHB1bHhMWjRoMUlLUjgzVG5PUVUtNUpwbm9HTHZtYUJGbHhBSGFtMk0zdEdTbnh5aUVSNGRBcEhaUXAwZ3duYnNRQ2c1eXZQSVAyU0NiU2tYZE9nZkpYQUtZcFpkMVJWbHNHMDJsdm9VbnVYX1h6NHhlR2lhLTB4UzZBWGVxcDBGRlJqZUJtYnhyUWVpbW94ckdQUFZfMk55Y2JqMU45QUV0VVIxZ3ZZWHMyRWZuYV94aEwtQ1U3V2ZLVmVyS1BkdzZpeHY4WdIB3AFBVV95cUxQUlhyQzlndDdqOGszMDNnLXlUejBVTDNhVDdEOVVFbXQ4M3A1UUpvSXpRX19RZVI1UXFVeTB4b005NVdyeGJ5UkVVbUFNUzlONG1DemxvZUI3QTU1WFdoVWhFSXVoUkcwRDlsSzBUTk5KMUFPLWZzZERPbFJzQlNuTzR2bG9ZY1pCczZaXy0tX0IwYk1SS0oxWEdFenBrZ3lEXzdQM2VubkJVY0g1cWhKQ0dEQXpkcmg4Z0RJYXNoanQxMk1xMHBWMWxRYlV5MGh4QUNSV2ozdlpOTXJP?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Apr 2024 07:00:00 GMT",
        "title": "Trader Says This Ethereum-Based Altcoin ‘One of the Strongest Coins,’ Updates Outlook on Solana and Chainlink - The Daily Hodl",
        "content": "A widely followed crypto strategist believes the token of one layer-2 blockchain project is among the best market performers.\n\nPseudonymous analyst Altcoin Sherpa tells his 214,100 followers on the social media platform X that Mantle Network (MNT), an Ethereum (ETH) scalability solution, could soar beyond all-time highs (ATHs).\n\n“MNT: going to buy some more Mantle here. I think this continues to grind up beyond ATHs, still one of the strongest coins.”\n\nMNT is trading for $1.30 at time of writing, down 4.5% in the last 24 hours. MNT reached an ATH of $1.54 on April 8th.\n\nNext up, the trader says Solana (SOL) could decline to $140, the bottom of a previous trading range.\n\n“SOL: still thinking just buying in this range of $175-$200 is a good decision. Would load up at $140 if it comes. Despite its challenges of late, I still think it’s a good buy.”\n\nSolana is trading for $167.83 at time of writing, down 2% in the last 24 hours.\n\nMeanwhile, the trader says Chainlink (LINK), a provider of decentralized oracle services for smart contracts, has strong fundamentals but is unable to break out of a resistance level at $20.82.\n\n“LINK: continues to disappoint. I expected more from this one. Still one of the better fundamental coins overall, but I thought we’d see more upside.”\n\nLINK is trading for $17.17 at time of writing, down nearly 2% in the last 24 hours.\n\nLastly, the trader believes Bitcoin (BTC) could have short-term volatility within its current trading range but predicts a breakout eventually.\n\n“BTC: don’t get chopped to death in this range. You will die and lose your stack and miss the fun.”\n\nBitcoin is trading for $69,385 at time of writing, up slightly in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiZkFVX3lxTE1NVlhleVpYWGRBbHFobmM5aE9uWWd2djYxaDFZZUo1UXRROU5YN2MwRnI0UTQ1ZGk5TTNSdGZpSURZLWx0dzRQXzFtQ1pBV21qdm9CVHN5SXg4bzdpQWkwWElCMHJvdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Apr 2024 07:00:00 GMT",
        "title": "Cardano (ADA): What It Is, How It Differs From Bitcoin - Investopedia",
        "content": "What Is Cardano (ADA)?\n\nCardano (ADA) is a decentralized Proof-of-Stake (PoS) blockchain designed to be more efficient than blockchains that rely on Proof-of-Work (PoW). Similar to Ethereum, Cardano's PoS consensus mechanism uses and rewards cryptocurrency for work done to review and expand the historical blockchain record.\n\nCardano is intended to evolve into a system for decentralized applications (dApps) with multiple use cases governed by stakers. The blockchain's cryptocurrency token is named ADA after Augusta Ada King, Countess of Lovelace, an English aristocrat commonly regarded as the first computer programmer. ADA can also be purchased on most major cryptocurrency wallets and cryptocurrency exchanges.\n\nKey Takeaways Cardano is a blockchain platform that was founded in 2015 by Charles Hoskinson. It was launched in 2017.\n\nCardano aims to be a decentralized application (dApp) development platform with a multi-asset ledger and verifiable smart contracts.\n\nCardano runs on the proof-of-stake Ouroboros consensus protocol using its native token, Ada.\n\nHistory of Cardano (ADA)\n\nCharles Hoskinson, an Ethereum co-founder who left the project due to disagreements with the direction of Ethereum, began developing Cardano in 2015 and launched the blockchain network with the first mined block in 2017.\n\nCardano considers itself an updated version of and has positioned itself as an alternative to Ethereum, anointing itself a “third-generation” platform compared with Ethereum’s “second-generation” credentials. Cardano has a self-proclaimed goal of providing banking services to the world’s unbanked.\n\nAn eponymous non-profit foundation, the Cardano Foundation, was established in 2017 to oversee the development of the Cardano blockchain and to promote its adoption. Prior to that, IOHK, an engineering company, was the primary developer of the Cardano blockchain. Throughout its history, the Cardano blockchain has undergone four notable hard forks in its history: the Shelley, Alonzo, Vasil, and Valentine hard forks.\n\nThe Shelley hard fork transitioned Cardano from a federated Byzantine Fault Tolerance (fBFT) consensus mechanism to a more decentralized PoS consensus mechanism called Ouroboros. The Alonzo hard fork enabled smart contracts on the Cardano blockchain for the first time, opening up the possibility for a wide range of dApps to be built on Cardano. The Vasil hard fork brought scalability upgrades to further improve dApp functionality, such as increased block size, improved transaction processing, and new scripting capabilities.\n\nIn February 2023, the Valentine upgrade occurred, causing another (planned) hard fork. The purpose of this update was to allow more efficient cross-chain applications to be built and add support for other protocols.\n\n\n\nCardano vs. Ethereum\n\nBoth the Cardano and Ethereum blockchain platforms are used for responsive applications and aim to build a connected system similar to the Apple and Android store, but decentralized. The most prominent features offered by Cardano and Ethereum to support dApps are their use of smart contracts and a PoS blockchain algorithm. Cardano had a staking mechanism long before Ethereum did, but it only recently supported smart contracts.\n\nSmart Contracts\n\nCardano implemented smart contract support in 2021 with its Alonzo update. This update took place on Cardano's test network, a beta version of the blockchain, and was the first iteration of bringing promised scalability and interoperability to users.\n\nSmart contracts allowed Cardano developers to create dApps such as non-fungible tokens (NFTs) and manage multiple cryptocurrency assets associated with these dApps. Future releases and forks of Cardano are expected to formally bring smart contract capabilities to the main network, the official version of the blockchain.\n\nCryptocurrency Staking\n\nCardano uses a PoS consensus mechanism, in which users \"stake\" the blockchain's cryptocurrency for the opportunity to become a validator. A stake is a pledge of a certain amount of ADA cryptocurrency to represent and secure validator rights in the Cardano network. ADA cannot be used or spent while it is staked because it must be held as collateral to incentivize honest validation behavior.\n\nValidators open and finalize blocks of transactions and are rewarded with ADA from other validators based on the number of tokens they have staked. Users can participate in the validation process by creating or joining a pool, which can be public or private.\n\nStaking pools consist of one or more trusted server nodes that conduct the work of validating transactions, updating the ledger, opening new blocks, and earning rewards. Public pools distribute rewards to members based on how much Ada they have staked. Private pools, as the name suggests, give rewards to their sole owners.\n\nA Cardano staking pool must be run by an operator with the technical knowledge and skills to maintain the stake pool by renting servers, monitoring the node, holding the pool key, and conducting other pool administration tasks.\n\nCardano vs. Bitcoin\n\nBitcoin was developed as a peer-to-peer payment system, while Cardano is focused on fostering a general blockchain ecosystem that allows developers to create other tokens, dApps, or any uses a scalable blockchain network can host.\n\nThe Cardano platform's PoS consensus mechanism relies on staking to validate transactions and reward cryptocurrency to validators, whereas Bitcoin's PoW relies on cryptocurrency mining. Cardano's PoS expends drastically less energy than Bitcoin's PoW by removing the need to have computers gobbling up large amounts of electricity to power complex mining calculations.\n\nCardano's PoS consensus mechanism also makes its validation process more accessible to the average user than Bitcoin's PoW. Cardano staking can be done simply by installing compatible wallet software on computers or devices—Bitcoin mining can also be done this way, but it is not very efficient, even if it is done through a pool, which is the least commitment-intensive option for mining.\n\n\n\nFuture of Cardano\n\nCardano is designed to be developed in “eras” named after notable figures in poetry and computer science history: Byron, Shelley, Goguen, Basho, and Voltaire. Basho, Cardano's current era, is focused on bringing scaling and optimization capabilities to Cardano. As of April 2024, Cardano is anticipating the transition from Basho to Voltaire.\n\nVoltaire, Cardano's final era of development, is intended to bring voting and treasury management to the blockchain network through particular smart contract functionalities and system improvements.\n\n\n\nDoes Cardano Have a Future? As with all blockchains and cryptocurrency projects, it is difficult to say how long they will last. Cardano is still being developed and maintained, so it appears that it still has potential, at least in the short term.\n\nIs Cardano a Hold or a Sell? It depends on your outlook, risk tolerance, and investing strategy.\n\nWhat Is the All-time High Price for Cardano? Cardano's all time high was about $3.16 on Sep. 2, 2021.\n\nThe Bottom Line\n\nCardano is a decentralized PoS blockchain founded in 2015 and launched in 2017. It has positioned itself as an alternative to PoW blockchains like Bitcoin because it is more energy-efficient and scalable.\n\nThe plans behind Cardano’s development are ambitious. Its developers see Cardano as eventually becoming fully decentralized when voting and treasury management of blockchain are added to its capabilities in the future.\n\nThe comments, opinions, and analyses expressed on Investopedia are for informational purposes online. Read our warranty and liability disclaimer for more info. As of the date this article was written, the author does not own cryptocurrency."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxOYk9KS3J5alNodkpLUjN2MW9WczJna2FYNHNzSzZILTVsOU55RnBkYUJGUm9mem1KTElnT05fV1pKTXE1ZUYzeDVQSWJ5ekFpZ24ydG5FYmZwaHo2WVUtVU4yaTA3d0hvbjJsRS1CRWluR0dpZmxmRFNiRU44dU1RY1Y0dXlsdlhBMGxVWVFUOW1sRW1BdUgyQVJJeGpweXg2dTZzVg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Apr 2024 07:00:00 GMT",
        "title": "Ethereum’s Stream Trading Raises $1.5 Million Amidst Crypto Surge - Crypto Times",
        "content": "Stream Finance, a newcomer to the Ethereum blockchain’s crypto derivatives space, successfully secured $1.5 million during its seed funding round. The round, led by Polychain with participation from angel investors, values Stream Finance at $20 million.\n\nThis financial boost has elevated the company’s market valuation to an impressive $20 million. At the heart of Stream Trading’s operation is its innovative protocol, which offers depositors the opportunity to engage in high-yield rate arbitrage trades.\n\nFor this service, the company imposes a fee of 10% or more, underscoring its revenue-generating mechanism.\n\nRapid Growth Amidst a Crypto Bull Market\n\nThe founding duo, Diogenes Casares and Solal Afota, swiftly assembled a talented team to leverage the ongoing crypto bull market. Their strategic moves are bearing fruit, as trading platforms across the decentralized finance (DeFi) landscape are witnessing substantial gains.\n\nStream Trading, having just concluded its beta testing phase, has already amassed $5 million in total value locked, positioning it on the brink of profitability.\n\nMoreover, Casares has articulated a visionary trajectory for Stream Trading, aspiring to evolve into a leading decentralized perpetuals exchange. This ambition sets it on a competitive path against established names like dYdX within the nascent yet dynamic DeFi derivatives sector.\n\nDespite its nascent stage, Casares claims Stream is nearing profitability. Their protocol offers depositors access to high-yield rate arbitrage trades, with fees exceeding 10%. Stream’s long-term vision is to become a decentralized perpetuals exchange, rivalling the likes of dYdX in the young, five-year-old DeFi derivatives market.\n\nCasares believes current protocols prioritize low fees over improving funding rates, the interest paid by traders speculating on asset prices. “Our focus is on the funding rate side, not the swap fees,” he stated.\n\nStream Trading differentiates itself by focusing on optimizing funding rates rather than merely reducing swap fees, a strategic pivot from the conventional approach adopted by most protocols.\n\nStream Trading’s successful funding round highlights the innovative approaches being adopted by new entrants to carve out their niche."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxPd1ctdnpHcEZVU0tXRU9BZ1cxanY0eWp4SkNMZC13Q0VQaG4zU0pJODlZY01hQmxqMTh0d1NfSTd6amE2WlFLYjc5OTdSd3R3MUdvbk40VjJjVXBFLWQza0hNVjRkaWlDREZEUkRQMTFxTHBEYlFBVDF4enFKdHJlNFhCb0lUTmlOU2dlQkZnTmN5YlgyOU5pR2hjdkI0RXZ6dG1Hekh1UWVsUkd6RGJLR9IBtgFBVV95cUxPYlBXYW1mOW5jZXdEV2ZPX19CZkZodnNocVFxVVllS0V1Ukl6amNKQlI2VkhMZm1SYkswaUZCTWRLRHMxM2RfTXk5VWlUN2hvb2NTa2Z0Y1BMSDhoT0V2ejFoa1JiRlRnT1c2WEJCbWl0QUlWVzhBcDRoYXoyS2hoUmo5X3ZzMkFrOERMVk1oNnJtTnBXTHZNSFVIY2t2dDNiY01VdWJ2RE8wa0c2RG9wYVBoZ0FmQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Apr 2024 07:00:00 GMT",
        "title": "Ethereum's (ETH) $4,000 Is New Goal, Shiba Inu (SHIB) to Explode in Symmetrical Triangle, Cardano (ADA) on Verge of Reversal - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nCurrently, ETH is carving out what appears to be an ascending channel, a structure that could signal a steady climb toward $4,000.\n\nThe ascending channel is outlined by two upward sloping parallel lines on the chart. This pattern captures the swings of the price between higher highs and higher lows, showcasing a gradual but consistent upward trend.\n\nFor Ethereum, the lower line of the channel seems to be providing a stepping stone from which the price bounces back up, and the upper line is where the price peaks before retreating slightly.\n\nA key level to watch is the recent resistance Ethereum has encountered near the $3,500 level. A decisive push past this point could pave the way for a test of higher resistances, ultimately aiming for the channel's upper boundary and beyond to $4,000. Currently, the chart shows Ethereum hovering around $3,500, which aligns with the channel's midpoint — a crucial area for bulls to defend.\n\nAdvertisement\n\nOn the support side, the $3,072 mark stands as the channel's lower boundary. As long as the price remains within the confines of the channel, optimism remains. A dip below, however, could signal a need to reassess the bullish scenario.\n\nLooking ahead, the main goal for Ethereum is to maintain its momentum within this ascending channel. A breakout above could confirm the bulls' strength, leading to a significant rally. On the flip side, a breakdown could shift market sentiment.\n\nShiba Inu's positive dynamic\n\nShiba Inu is showing the possibility of a volatility explosion as the asset is on the verge of reaching the tip of the aforementioned formation. This pattern is formed when the price of an asset consolidates within converging support and resistance lines, hinting that a significant price move could be on the horizon — either a sharp rise or a decline.\n\nThe pattern's apex draws nearer, suggesting that a big move is imminent. Symmetrical triangles are notorious for their unpredictability in terms of direction. The breakout could lead to a surge in price if it moves upward or a fall if it breaks down.\n\nCurrently, SHIB is trading within a tight range, and the specific price to watch is the triangle's upper boundary, around $0.00002776. A consistent move above this level could signal a breakout to the upside, with the next resistance possibly forming near the $0.00002987 mark. Conversely, if SHIB breaks below the triangle's lower support at $0.00002515, it may experience a downturn, with the next level of significant support at $0.00002236.\n\nThe future of SHIB, within this symmetrical triangle, remains unclear, and so does the direction of the token and its future. SHIB might leverage this pattern for a bullish breakout if the market remains bullish.\n\nCardano on reversal point\n\nCardano's indicators suggest an upcoming reversal. The asset has reached a crucial price level that, in the past, has served as a beginning point of a bullish reversal.\n\nADA is hovering around the $0.57 mark, a significant level that has historically acted as a pivot point. This price acted as a strong support in previous trading sessions, hinting at the potential for a bounce back. The critical resistance to overcome for a solid reversal stands at $0.62 which, if broken, could see ADA rally toward the next resistance point at $0.65.\n\nIf ADA fails to maintain this support level, the next significant floor is expected near the $0.5266 mark, where buyers may reemerge to bolster the price. This zone remains crucial for the bulls to defend to prevent further declines that could dampen the short-term outlook for ADA.\n\nA successful rebound from the current support could validate Cardano's readiness to climb. An upswing backed by increased trading volumes and positive market sentiment could carry ADA to retest its recent peaks and potentially establish new ones."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE9hcVQ1V0Y4VWI2Y2pSQmFBM3Ywc2dZWE9tSFU2LTNYVXUyWGdZNVBsdC02Vlg0RTJUb2k4aXZRdmNUSVkzT25YUzEtQjdoNTZBOWdweGJNUW1BcDh3NnV5YUxqTW1WY2JqZVBGUG9zSXBDNDR1UjFjczFR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Apr 2024 07:00:00 GMT",
        "title": "Rootstock’s Blockchain Revolution Aims to Bridge the Bitcoin-Ethereum Gap - Block Telegraph",
        "content": "Blockchain technology is redefining technology, from security to decentralization and financial autonomy. Among the platforms pushing the boundaries is Rootstock (RSK), which is integrating the strengths of the two titans of the crypto world: Bitcoin and Ethereum.\n\nTori Madison, the host of BlockTelegraph’s CryptoCurrents podcast, sat down with Daniel Fogg, CEO at RootstockLabs, to shed light on how Rootstock is enhancing the blockchain ecosystem and setting a new standard for what blockchain platforms can achieve.\n\nFogg eloquently articulates the mission, challenges, and groundbreaking achievements of Rootstock, offering listeners a comprehensive overview of a platform that’s bridging the gap between Bitcoin’s robust value transfer system and Ethereum’s programmable flexibility.\n\nRootstock’s Foundation Combines Security and Smart Contracts\n\nRootstock ingeniously blends two titans, taking Bitcoin’s secure storage and transfer of value with Ethereum’s smart contract capabilities. In short, Fogg explains that “Rootstock combines the security and store of value of Bitcoin with the programmability of Ethereum.”\n\nThe integration facilitates the use of Bitcoin for computational services and secures transactions with Bitcoin’s cryptographic mechanisms. It is an innovation that makes Rootstock highly secure, highlighted by Madison pointing out its position as the “most secure and decentralized smart contract platform globally.”\n\nThe platform’s security, backed by over 60% of Bitcoin’s hashing power, solidifies Rootstock’s role in the DeFi arena on Bitcoin. It showcases an astounding harmonization of Bitcoin and Ethereum’s strengths, with over 300 million in total native value locked on the platform.\n\nBridging Bitcoin and Ethereum\n\nDuring the discussion, Fogg brought up Rootstock’s two-way peg mechanism, a cornerstone of its robust bridge between Bitcoin and Ethereum. He explained, “It allows you to essentially take the asset, the biggest, most widely held, most trusted cryptocurrency the world has ever seen, which is Bitcoin, and do stuff with it,” rather than just storing it in a wallet.\n\nThe seamless integration maintains Bitcoin’s value integrity while enabling its active participation in smart contract applications. By transforming Bitcoin from a passive store of value into an active, working asset, Rootstock opens up a realm of possibilities for Bitcoin holders to engage in advanced DeFi applications.\n\nThe real-world implications of this integration are vast, ranging from basic financial transactions to lending and borrowing in advanced DeFi applications. Rootstock’s vision goes beyond DeFi, aiming to activate dormant Bitcoin assets and invigorate the global economy. This initiative makes Bitcoin a secure foundation for a wide range of economic activities, offering financial stability and independence to the underbanked and unbanked populations globally.\n\nOvercoming Developmental Challenges\n\n“Launching a blockchain in itself is a huge effort,” Fogg states, acknowledging the underestimated complexity and collaborative effort needed to bring Rootstock to life. It was an effort that required the collective effort of hundreds of contributors for the RSK network.\n\nMoreover, the DeFi boom on Ethereum presented both a challenge and an opportunity for RSK, initially perceived as niche within the Bitcoin-based DeFi sector. However, RSK’s resilience and innovation eventually positioned it at the heart of the expanding Bitcoin DeFi ecosystem.\n\nDecentralization and Security\n\nIn the RSK ecosystem, decentralization and security have a symbiotic relationship where they reinforce each other, creating a robust and scalable blockchain network. “The decentralization journey, why decentralization and centralization initiatives matter, is that centralization points are points of attack,” Fogg remarks, underlining the intrinsic link between decentralization and security crucial for blockchain scalability.\n\nAs RSK grows, its reliance on Rootstock Labs diminishes, showcasing a transition toward community-driven governance. This model for future blockchain technologies achieves scalability without sacrificing security or decentralization, fostering innovation and participation from a global community.\n\nThe Rootstock Grants Program\n\nWorth mentioning is the Rootstock Grants Program, with its $2.5 million fund. “We use this essentially as an incentive to encourage developers who are interested in Rootstock and they’ve got an idea or they’ve got a protocol from one network to try and bring it to Rootstock,” Fogg explains.\n\nBy encouraging developers to bring their ideas to Rootstock, the program has catalyzed the launch of significant projects, enhancing the blockchain ecosystem. This initiative reflects Rootstock’s dedication to expanding its ecosystem, promoting a diverse and vibrant blockchain community based on Bitcoin.\n\nThe strategic focus on supporting advanced and everyday DeFi projects aligns with Rootstock’s vision of making financial tools and services inclusive and efficient.\n\n“Right now in 2024, we’re just laser-focused on getting as many DEXs, as many swap mechanisms, as many exchanges, as many wallets onto the network so that we can get the economy spinning,” Fogg emphasizes. These foundational economic protocols lay the groundwork for a decentralized economy where blockchain tech can serve everyday financial activities, promoting global financial inclusivity and independence."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxNQXV3aElaMUFNWGtPaWU1SmlVQlAzSFdsYWFsb0s2RGlMOXdWOTVPOTA2aFFoNVRYdVRnQTY5cmtMcVJ3SXNkVWVDOFd3YXBiZ05veEVfX0kxbkdnZnpJeHg0TVQ2eVZZRE5XSFp6aDZ6RGJKaTdidXhGcnF6ZmJwNU84a1FRNWYzZzR2dzVwWTJQRmNhSVphXzc4X3VxMUVta2NWSkRTa0I4OWU0aU9aRjg5b18zdmdLNm1odmh1LUNSdEg2ejFVcHVWS1NlWUpxemhlOWRHenQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Apr 2024 07:00:00 GMT",
        "title": "Nektar Network Unveiled to Elevate Ethereum’s Trust Layer and Combat Centralization By Chainwire - Investing.com",
        "content": "Berlin, Germany, April 11th, 2024, Chainwire\n\nNektar Network - the multilayered Re-staking network is designed to optimize 's security model while scaling distributed solutions, paving the way for more decentralized infrastructure.\n\nThe team behind Diva Staking unveils the Nektar Network, a pioneering restaking ecosystem poised to redefine the Ethereum trust model and extend its utility across distributed systems. The Nektar Network launches with a vision to democratize Ethereum’s validation process while addressing the challenges of centralization and resilience.\n\nPopularized by EigenLayer, already with $14 billion in re-staked ETH, Re-staking implies repurposing a staked asset to secure additional tasks or duties by the validators using such staked assets as collateral. Users can opt into Nektar to augment their staking activities, earning additional rewards from AVSs.\n\nNektar Network tackles critical challenges within the blockchain space by empowering different agents. Nektar facilitates the seamless establishment of PoS-based distributed systems, enhancing trust and security for applications utilizing its services.\n\nThe crypto ecosystem is rapidly evolving into a more sophisticated and developed landscape. There are now specialized actors vital for a smooth bootstrapping of the network. We are confident that with their help, the Nektar Community will grow at lightning speed to become one of the most relevant actors within the Ethereum ecosystem.\n\nNektar Network aims to be a response to the growing problem of centralization in the Ethereum ecosystem. While there are major concerns about a limited number of actors controlling the validation layer, at a Re-staking level the ecosystem was in need of viable alternatives to diversify the growing interest in Re-staking. Nektar Network intends to position itself as the most resilient alternative within this vital component of Ethereum’s scaling.\n\nFurthermore, the integration of Distributed Validation Technology (DVT) within Nektar enhances Ethereum's resilience, presenting a robust infrastructure for developers, operators, and validators to engage with the Ethereum network more securely and efficiently.\n\nThe Ethereum ecosystem has reached a critical juncture. On one hand, liquid staking has democratized access to Ethereum validation. On the other, it has created a centralization problem where a handful of entities could, in theory, collude to control the network. Continuing down this path would contradict one of Ethereum’s core tenets and send the wrong message to stakeholders. Nektar provides a restaking network as decentralized as possible, powered by DVT.\n\nUsers can find more information here.\n\nMedia inquiries\n\nRedhill (on behalf of Nektar Network)\n\nTien Ma\n\ntien@redhill.world\n\nAbout Nektar Network\n\nNektar Network is a multilayered restaking network built on top of Ethereum. It consists of components that together form a comprehensive incentives system designed to democratize access to Ethereum's trust model.\n\nFor more information about Nektar Network, users can visit our website or follow on Farcaster and X.\n\nAbout Diva Staking\n\nFounded in 2023, Diva Staking is the company behind Distributed Validator Technology (DVT). It aims to increase the decentralization of Ethereum staking through its proprietary DVT solution that balances the interests of stakers and operators. In January 2023, Diva Staking raised $3.5 million in seed funding from A&T Capital, OKX Ventures, Alphemy Capital, and Metaweb Ventures, among others.\n\nContactTien MaRedhill GmbHtien@redhill.asia\n\nThis article was originally published on Chainwire"
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMi0wFBVV95cUxNS1pqUFF4endfVUVJb3JmSjQyanZoVWhnMmpOZDhwY0hZYnEyb1pVNGlLeTJzZlVzazB4S2pnRHpXVF9Qeml0RUNESktPVm5seVZxS2xSYWlDVzRfNFY2RGlRcWNOa05aMlY2YXJ2U2VBNGlzYU5ZeEprOGRBd1pqUVlrZ2Y3WUhuZlI2N3JHTVJHN3ZfZEJXRzZaZ05EbDh0UERibzZadnd3WGVSMF9JYlJ4VkxuNXA0Qi1oQTc1SnZ2enNRM2owWjVjLTREMFkwd2lz0gHYAUFVX3lxTE5Va3cyYzVUUnhuTFVLNDZGdmNVSmtUdGhXUTZfaGxHWEdFbjlkUXZnTGNUY3IyZkZEczVKWk5XMlE1eG5uUjJEbXd1YkxjaHdUQ0pQeENVeTg2MTNWQUMzWHRDUXdad1EwX1B4RkZBYXVtMG9HY09ZVUFnLVREY1JYWmdwRzlqUTItazNCM25XeGNzYWJyZTVWV3hfbXFDWFExaVhtXy0wYUFMbXNoc29ISktLVmZRb2IzcjY0WnJSR3E3YXYzcTRBU2dNVThGU2ZzNURpWkI1Sw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Apr 2024 07:00:00 GMT",
        "title": "Ethereum price recovers slightly as whales begin accumulation spree - FXStreet",
        "content": "Ethereum's recent price movement has shown that it's still significantly correlated with Bitcoin.\n\nWhales are accumulating Ethereum, with the aim to participate in the ETH restaking boom.\n\nThe SEC's recent Wells notice to decentralized exchange Uniswap could affect Ethereum, considering it is home to a large portion of DeFi.\n\nEthereum (ETH) showed signs of recovering its bullish momentum on Thursday, briefly rising to $3,618 as whales entered a buying spree. Despite the movement from whales, the US Securities and Exchange Commission (SEC) Wells notice to Uniswap could affect Ethereum in the long run.\n\nRead more: Ethereum extends correction as Van Eck CEO dampens chances of spot ETH ETF approval\n\nDaily digest market movers: Whales accumulation, Bitcoin correlation, Wells notice\n\nEthereum joined a host of other altcoins in trading in the green on Thursday after two days of sustaining a bearish move. Here are your key market movers for the largest smart contract blockchain:\n\nAfter ETH's slight increase on Thursday, large ETH whale Ox347 deposited 9000 ETH tokens to Binance at $3,560 in a bid to book profits, according to onchain insights from Spot On Chain. Although this is the whale's largest ETH deposit to date, its address still holds 29,738 ETH worth a whopping $106 million with an estimated profit of $68.5 million.\n\n\n\nDespite the profit-taking from whale Ox347, onchain data from Lookonchain indicates that some other whales are taking opposite actions:\n\n\n\nWhale 0x4359, who had earlier bought 10,309 ETH ($35.82 million) at the bottom of the price drop on Wednesday, withdrew another 3,092 ETH ($11.12 million) from Binance on Thursday. As a result, his total ETH withdrawals from Binance in the past three days have reached 24,044 ETH ($86.5 million).\n\n\n\nAnother whale, 0xACc7, withdrew 22,251 ETH ($80.06 million) from exchanges on Thursday, taking their total exchange withdrawals in the past three days to 33,925 ETH ($122.06 million).\n\n\n\nSome crypto community members have speculated that the whales' recent move may be to participate in the restaking boom that's heating up in DeFi, especially with the Mainnet launch of EigenLayer. Data from Lookonchain confirms this as whales/institutions withdrew ETH from Binance and staked it into Pendle and Bedrock.\n\nWhile the recent price increase may have several factors layered in, it shows Ethereum still maintains a significant correlation with Bitcoin (BTC). Like several other large-cap altcoins, Ethereum's price movement has largely mimicked Bitcoin's since the beginning of the year. Hence, the Bitcoin halving – less than eight days away – could prove critical in determining ETH's price movement in the coming days.\n\n\n\nOn Wednesday, the US Securities and Exchange Commission (SEC) issued a Wells notice to Ethereum's largest decentralized exchange, Uniswap. The Wells notice, a formal document indicating the SEC's intention to take legal action against an individual or firm, was issued based on claims that Uniswap operated as an unregistered securities broker and exchange.\n\n\n\nIf the SEC succeeds in taking legal action against Uniswap, it could significantly affect the broader DeFi landscape. This would have telling effects on Ethereum, the underlying home to roughly 80% of DeFi solutions. Earlier in March, the SEC had issued subpoenas to three firms that had dealings with the Ethereum Foundation. Many crypto community members have stated that the SEC aims to classify Ethereum as a security.\n\nAlso read: Ethereum could be set for growth as Vitalik Butein shares update on its future\n\nTechnical analysis: ETH may continue sideways movement\n\nETH's price has been following a sideways pattern after recovering from the one-week correction that followed the high of $4,094 on March 11. While traders expected a rally back to the $4,094 high when ETH tagged the key resistance of $3,730 on Monday, the price retraced. The continued sideways move indicates traders are exercising caution and are indecisive on whether to go long or short.\n\nETH/USDT 4-hour chart\n\nRead more: Ethereum's price recovery looks imminent as ETF approval sees a glimmer hope\n\nThe constant switch between increased long and short liquidations in the past two weeks confirms this indecision. ETH may continue this sideways movement until key events like the Bitcoin halving and the SEC's spot ETH ETF approval decision take place. However, a bearish trend may begin if the price breaks key supports of $3,210 and $3,056 formed on April 5 and March 20, respectively.\n\nEthereum is trading at $3,500, up 0.8% at the time of writing."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxPa0t2WVJEcExrSnFGOFBwajZrTEktUWpwUUJFLVhZQVpQbDhvblp4Z2FjdVNjdy0tWkJPVXdpTXA4aW5iQ29kbHNBVU9IV2JoSkphelUyTEY3Q0M1NVVCbVhyeE9QWllJOENZNTkwaHBNaE5ORDdTUVZzMVlrajN6NmEyRdIBiAFBVV95cUxPMnpDMEk5TjkybXkyODBJSlp6R01XTnBfal83RmQzMHZrTjROdjNoOG1CNm54VVAtSWlobmhkVFlFTGYzamRuSUdzYndTVE9pbk9NREJQNTF5T3Zpc1RkWjZsbmNLbmVodUFDS1VaMTZJRFgxYXowR1FzVFc4MWdvTHU5LTdNUW1u?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Apr 2024 07:00:00 GMT",
        "title": "Breaking: Hong Kong To Launch Spot Bitcoin, Ethereum ETF On Monday- Bloomberg - CoinGape",
        "content": "A recent report showed that Hong Kong is forwarding with its plan to potentially allow exchange-traded funds (ETFs) for major cryptos like Bitcoin and Ethereum as early as the coming Monday. This move, as reported by Bloomberg, has bolstered the sentiment of the crypto market enthusiasts, especially following the remarkable success of Spot Bitcoin ETFs in the United States.\n\nIn addition, the update underscores Hong Kong’s ambition to solidify its position as a leading hub for digital assets.\n\nadvertisement\n\nHong Kong To Green-light Bitcoin & Ether ETF\n\nA recent report from Bloomberg suggests that Hong Kong may soon approve Spot ETFs directly investing in Bitcoin and Ethereum, two of the most prominent cryptocurrencies. If the speculation holds true, international entities like Harvest Fund Management Co. and a collaboration between Bosera Asset Management (International) Co. and HashKey Capital are expected to receive the green light to launch spot-crypto ETFs.\n\nNotably, these ETFs in Hong Kong are planned to be launched by the end of the month pending regulatory clearance from the Securities and Futures Commission (SFC) and finalization of listing details with the Hong Kong Exchanges & Clearing Ltd.\n\nMeanwhile, the reported approval comes on the heels of earlier indications that Harvest Fund Management Co. was on track to secure permission to introduce a Spot Bitcoin ETF in Hong Kong. However, neither the SFC nor Harvest has offered any official comments on the matter.\n\nIn addition, despite the anticipation surrounding the approvals, it’s worth noting that the timeline remains subject to potential last-minute changes, according to sources familiar with the matter. Besides, a previous report from CoinGape showed that Hong Kong previously planned to launch the Ethereum ETF before the U.S.\n\nAlso Read: XRP & BTC Could Bounce After Bitcoin Halving\n\nPotential Implications Of The Approval In Crypto Market\n\nThe imminent approval of Bitcoin and Ethereum ETFs in Hong Kong could have far-reaching implications for the global crypto market. Notably, the advent of Spot Bitcoin ETFs in the United States earlier this year has already been instrumental in revitalizing the market, with assets under management for such ETFs reaching approximately $59 billion.\n\nThis influx of institutional investment has played a pivotal role in driving the price of Bitcoin to new highs, recently hitting over $73,700 mark in mid-March. Considering that Hong Kong’s move to embrace crypto ETFs also underscores its ongoing competition with cities like Singapore and Dubai to establish itself as a premier destination for digital asset firms.\n\nHowever, despite the positive update, the Bitcoin price traded near the flatline at $70,762.75 during writing. Its trading volume over the last 24 hours dropped by 20.76% to $29.64 billion at the same time.\n\nAlso Read: Messari CEO Eager To Join SEC Investor Advisor Committee, A Pro-Crypto Move?\n\nRupam Roy Rupam is a seasoned professional with three years of experience in the financial market, where he has developed a reputation as a meticulous research analyst and insightful journalist. He thrives on exploring the dynamic nuances of the financial landscape. Currently serving as a sub-editor at Coingape, Rupam's expertise extends beyond conventional boundaries. His role involves breaking stories, analyzing AI-related developments, providing real-time updates on the crypto market, and presenting insightful economic news. Rupam's career is characterized by a deep passion for unraveling the complexities of finance and delivering impactful stories that resonate with a diverse audience.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxOQkZuRzNmUWozci1aN1VMUWJMQm1aRnhvd19tTFlzc3RiWXlwU0s3Ykc5dHQwR18zUVpzN0YtTDZrVlVHZHdXdG1oMjg0dXJnMkE2Q19FODM3WUZ0eUM5bkJ3d3htSVlrdUVWVFlyV2piVnpBQzNZbmtQci1UeFcyNDdvVk5pZzRscFFWT1RQUy1wbVd0Z1RNZXZFbGxZS2dsN1FWa29jeVY2TzRUWDJYX3l6NlBhWXJ4ejE4VGV2TUtUaS1xb0FmRkpmR295SmFSMDFMb3F3QdIB3AFBVV95cUxOOGR1cHlyX1F3NzE3cFFRUGdKdV82ZzUtT1FqZXlnTDlMRVVHTXhwVEd5cE9tWEtfeXYwSFdfd2ZzVURkdGVFa2dGRzM1dkR5MkQ4WF80MjlPTmZjdXNmTGkwNFpyWmtxQkhwS1lsRUxhYTlVaDNJZ3BHZnR1WXZDTG1VYUY5R2hBbkVNUEVvZWRXXy04LXFsZVhTRXFucWstVjVWamt1d08zQWp0SWtRazNmR2o0Z1JjRHNRanhwS2VmTDdDTHB0ZExuVkdTSW1wVkRDQWxjUmVuMUtT?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Apr 2024 07:00:00 GMT",
        "title": "Cryptocurrencies Price Prediction: Ethereum, Solana & Cryptos – American Wrap 12 April - FXStreet",
        "content": "Ethereum's (ETH) price took a slight dip on Friday following the general stagnancy in the crypto market. While ETH's price movement has been slow in the past week, its long-term future could prove interesting as Ethereum developers approved that EIP-3074 be included in the upcoming Pectra hard fork\n\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all or a portion of your investment, as well as emotional distress. All risks, losses and costs associated with investing, including total loss of principal, are your responsibility. The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of FXStreet nor its advertisers. The author will not be held responsible for information that is found at the end of links posted on this page.\n\nIf not otherwise explicitly mentioned in the body of the article, at the time of writing, the author has no position in any stock mentioned in this article and no business relationship with any company mentioned. The author has not received compensation for writing this article, other than from FXStreet.\n\nFXStreet and the author do not provide personalized recommendations. The author makes no representations as to the accuracy, completeness, or suitability of this information. FXStreet and the author will not be liable for any errors, omissions or any losses, injuries or damages arising from this information and its display or use. Errors and omissions excepted.\n\nThe author and FXStreet are not registered investment advisors and nothing in this article is intended to be investment advice."
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxOYld6NFNGNllzck41VWRqSjEwUXgwa2tPdXhYYmtuTDhYUEdzTFIyNmRySGtkcjRhZmRZcTV6WVA4Q0M3ZV94SWl3VXVOc0hORnIyWFVMcG0tUmpQdWthRTJBTmJ4RHgwM1JYckhqV3FEMnNiaWd4SXF3ZUIzWWxFX1Nhbk9YeWlFakFBR0NCZDdZMnNCOTQ3a3g5Wk82MlRUZTBTMw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Eyes $5,000 After Pectra Upgrade and Bitcoin Halving - FX Leaders",
        "content": "⚡ Trade Forex With High Leverage And No Limitations! – Open an Account Here\n\neth-usd\n\nEthereum (ETH), the world’s second-largest cryptocurrency by market capitalization, is consolidating around $3,500 after several weeks of sideways movement. Despite the recent lull, analysts remain optimistic about Ethereum’s future, citing upcoming upgrades and potential tailwinds from the approaching Bitcoin halving.\n\nEthereum Pectra Upgrade to Enhance User Experience\n\nThe highly anticipated Pectra upgrade, expected in late 2024 or early 2025, promises to bring significant improvements to Ethereum wallets and user experience. A key feature of Pectra is EIP-3074, which grants standard crypto wallets smart contract-like capabilities. This allows functionalities like transaction bundling (reducing signing frequency) and sponsored transactions (similar to account abstraction).\n\nHowever, some experts warn of potential security risks associated with EIP-3074, emphasizing the importance of responsible wallet management. Another exciting feature of Pectra is the social recovery option, eliminating the need for complex seed phrases for wallet recovery.\n\nEthereum ETF Approval Remains Uncertain\n\nJP Morgan analysts expressed doubt regarding a spot Ethereum ETF getting approval from the SEC next month. The SEC’s recent investigations into Ethereum-related entities contribute to this pessimism.\n\nIf the ETF is not approved by the May deadline, applicants might challenge the SEC’s decision, potentially leading to legal battles similar to those involving Grayscale and Ripple. While a future approval is likely, it may not happen as soon as May.\n\nEthereum’s Strong Fundamentals\n\nEthereum’s price has benefited from the mass adoption of web3 projects and digital assets. It remains the dominant tokenization blockchain despite competition from other Layer-1 solutions.\n\nHigh demand for Ether persists, particularly among institutional investors seeking to diversify their crypto holdings. The potential ETF approval further fuels bullish sentiment.\n\nEthereum’s shift to a deflationary model through EIP-1559 burn mechanisms adds another layer of value proposition.\n\nPost-Halving FOMO Rally Anticipated\n\nWith the fourth Bitcoin halving event approaching, some analysts predict a surge in Ethereum’s price due to fear of missing out (FOMO) among investors. Popular crypto analyst Captain Faibik believes Ether has the potential to reach $5,000 in the coming weeks on the back of this post-halving sentiment.\n\nETH/USD Technical Analysis Suggests Potential Breakout\n\nEthereum’s current price action indicates a possible breakout from its consolidation phase. A clear break above $3,550 is seen as a bullish signal."
    },
    {
        "id": 74,
        "url": "https://news.google.com/rss/articles/CBMilgJBVV95cUxPN0dEQXN2dXV6cWdibnRFdGFGd05ESE5IN2VDbExTUkptNG13dkVRWEJGVjZrdjU4TmRmODNHMXhnSDI1NDM4YnVmaDhDMzV6V2pVMl9VQjI1TmtvUkRMZk54MU81X0hMTl9zRFY4Ykt5MkY0azFrMkhoWlFYSWpKMXc0RHh2Wi1sdVVMczMtWDAzMjB0MHA1eENERGNibDRsbTNfdVRTaU5qanNKeUJQT0NIbHM5VGozTVAtdy0wZ29YQ2JBbkxBU29kOU5sVjY3UDNSVHhQckxEX3M2STR0ZHdtR004MWt5RERocUlaUTFXU0duR29rbVdYeThFUXFQS3UyV1EyejlIMzZSZXhiOXpjb18tZ9IBmwJBVV95cUxNcjZHMGUxbHNtaEJUbTNYMnBhZ1JJdHVJQVF2S0JpT3NRZk0xQ0d1UUdIak52V2Nuc2dkTkpHNUVkV2Zhc1lPX1ZiaGRMZUhNVTBkSWxvUDRZSjVpNko2dGVtdS1vY2FfRVJmOVFMU0ktY29MWWdZaVJrQXNxTTM1anpDTUVjS2JzeTJTcjFEZXdkRnZ6ZnZOMVJTRDZFb2xkckR4eG5fdk5DX1FGc0RBanVtOEwzeWlVdW91Q1VoWEZnRmF5U1RTdURwTkNoOEVxWThkR0ctcmV0TTJSNUFXR1lOZTY2d3psWmpjZUw5ZUdWTVpvSGpabEtmZF8yV3dJQm43Rkt6eGNwRVZmNFFrZUczMk9jc3BuSjhn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Apr 2024 07:00:00 GMT",
        "title": "Cryptocurrency Price on April 12: Bitcoin trades above $71,000; Ethereum, Toncoin decline up to 3% - The Economic Times",
        "content": "\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nIn Friday's trading session, the crypto tokens displayed mixed performance. Bitcoin, BNB , Solana, Dogecoin , and Cardano showed gains, trading up to 2% higher. Meanwhile, Ethereum, XRP , Toncoin, Internet Computer, and Uniswap experienced losses, trading 1-3% lower.The global cryptocurrency market cap rose marginally by 0.13% to around $2.64 trillion in the last 24 hours.Bitcoin was up 0.7% at $71,025 as of 11:03 a.m., while Ethereum was below the $3,550 level.Edul Patel, CEO of Mudrex, said, \"Bitcoin has climbed back above $70,000, a level not seen since March 25th in anticipation of the upcoming Bitcoin Halving. The $71,200 level presents the next resistance, with support at $69,100. If current momentum persists and buying interest holds steady, Bitcoin may retest its previous all-time high.\"Meanwhile, Parth Chaturvedi, Investments Lead at CoinSwitch, said, \"BTC continues to trade above its newly found base at $70k. However, Bitcoin’s 7-day average mining hashrate has started approaching its ATH value, increasing the mining difficulty by 4%. An increased hashrate results in increased security for the network. This may bring buying pressure for BTC, with potential resistance at around $71.2k.\"The total volume in DeFi is currently $7.54 billion, 9.56% of the total crypto market 24-hour volume. The volume of all stablecoins is now $72.24 billion, which is 91.65% of the total crypto market 24-hour volume, as per data available on CoinMarketCap.In the last 24 hours, the market cap of Bitcoin, the world's largest cryptocurrency, rose to $1.396 trillion. Bitcoin's dominance is currently 52.97%, according to CoinMarketCap. BTC volume in the last 24 hours fell 26% to $30.3 billion.Technical indicators such as the 30-day moving average and relative strength index suggest increasing momentum without entering overbought territory. Converging resistance and support levels indicate a significant move forward, potentially fueled by a halving.Analysts anticipate a short-term sell-off after the halving but expect long-term price appreciation due to reduced supply. With BTC only 4% off its all-time high, projections suggest it could reach $75,000 by May and $80,000 to $90,000 by Q3 2024."
    },
    {
        "id": 75,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxQZGJTdklMR0s4bGctcUhEbkdaZ0M1MUZJNEFzc216ekJNWVE0aXJPZzRnVVdPOTZWbVRTNzV0cTBnc3hCQW5BeHhEWW9CUUo4Y2txT0cxY1gtQmVXRllIeHB4ZFhxY1JVWTJ6aklIVVZGeE1ZS3BMLS13UjBaTkQxMXJfOS1Kc0kwSzVr0gGQAUFVX3lxTFBDMDZPbE13b01uS2NOc0F4VXJhYVdMUlYzUTlqMUQ1b2oyUEVGQjZyS21tY2lncHFPeXhCNkdCTUFFLXZhUnA5TlVPQmRhT0pKaUFENFVmSUlRTUJlMWlhWFNjSjZFMWlaWV9QaFNINWhXazZmUHJZeE9sWU9zaDRHaEhNRFdVbnVCeVM3QlAxdg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Apr 2024 07:00:00 GMT",
        "title": "How Bitcoin captured 40.7% of the NFT market – destroys Ethereum - AMBCrypto English",
        "content": "Bitcoin has taken 40% of the NFT market share.\n\nThree Bitcoin collections are now among the top 10 NFTs.\n\nThe introduction of Bitcoin [BTC] NFT Ordinals inscriptions marked the beginning of the NFT revolution on the platform. Since then, NFT activity has surged, with BTC NFTs now surpassing others in rankings.\n\nAdditionally, recent data indicates that Bitcoin holds the highest market share in the NFT space.\n\nBitcoin takes charge of NFT volume\n\nAnalysis of data from NFT Pulse showed that Bitcoin currently holds the highest volume in the NFT market. At the time of this writing, the total trade volume on the platform amounts to $195 million, with Bitcoin accounting for $79.4 million of this volume.\n\nFurther examination showed that it now commands a market share of 40.7%, marking a significant shift from previous trends where Ethereum dominated.\n\nRecords also highlight its gradual ascent from holding the second-highest market share to its current position as the market leader in NFT trading volume.\n\nBitcoin NFT collections emerge as top contenders\n\nAccording to data from DappRadar, three Bitcoin collections have secured positions among the top 10 NFT collections. Over the last 30 days, Runestone, Ordinal Maxi, and NodeMonkez have emerged as prominent players in the NFT space.\n\nAmong these, Runestone currently holds the top spot in popularity. It boasts over 48,000 traders and has witnessed a remarkable 100% increase in volume.\n\nRecent discussions about an upcoming token launch and airdrop for holders have further fueled Runestone’s popularity.\n\nAdditionally, DappRadar data reveals that Ordinal Maxi and NodeMonkez hold the eighth and ninth positions, respectively, in the rankings.\n\nA new leader in NFT volume?\n\nFurther analysis on Crypto Slam showed that Bitcoin currently boasts the highest NFT sales volume among all networks. As of this writing, it has recorded a sales volume of over $24 million in the last 24 hours, securing the top position.\n\nEthereum follows closely behind with a sales volume of $10.2 million, ranking second.\n\nIs your portfolio green? Check out the BTC Profit Calculator\n\nFurthermore, when examining the top trading collections, a Bitcoin collection leads the pack with over $10 million in sales. Zooming out to longer time frames, data from the past 7 and 30 days also reaffirms Bitcoin’s dominance in NFT sales.\n\nOver the past seven days, its collection has generated sales totaling over $51.6 million, while over the last 30 days, it has surpassed $169 million in sales, further solidifying its position at the forefront of the NFT market."
    },
    {
        "id": 77,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxOX0tLbzJtZlI4Ym4yX0xMUTVqbWV6QVB4WWRaYWFnQkZ6S0JFRTRDVHJ2b0ZrdnRrcTRCQV9FaWxtQnVmekZwSVlwRUcyRnE5Y3NTSjJCRHJTTmxoTDB0VUNwQVE5M05nd01fVjl5WGtwUW5VNzFoczRfXzdjRFlsaFFvNTZmSXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Apr 2024 07:00:00 GMT",
        "title": "How high can Ethereum go in the next five years? - Times of Malta",
        "content": "Ethereum was launched in 2014 through an initial coin offering with an initial price of $0.311. Although it traded below $1 until January 2016, the price reached an all-time high of $1,270 in January 2018.\n\nDue to its rapidly rising popularity, Ethereum has often been compared to Bitcoin, the world's first cryptocurrency. So, investor curiosity surrounding Ethereum (ETH) has always been high – people want to understand its worth in the next few years before investing.\n\nSo, before you decide whether to buy Ethereum, let us find out what analysts have to say.\n\nEthereum’s price history\n\nIn 2021, following a significant surge, the price reached an all-time high of $4,891.70 on 16 November. However, this all-time high was followed by a crypto bear market, which caused Ethereum's price to go down to $890 on 18 June 2022. Despite this, the price has increased since then. ETH has risen 130% from its June 2022 low of $890 and 71% this year. However, it is still down 58% from its record high.\n\nIn 2023, Ethereum's price saw high volatility, primarily due to the Securities and Exchange Commission (SEC) in the US.\n\nThe recent news that BlackRock is planning to file an Ethereum ETF has boosted ETH prices above $2000 for the first time since July 2023.\n\nPrice prediction for ETH in 2025\n\nGeneral predictions predict that Bitcoin halving in 2024 will dominate cryptocurrency narratives in 2025. Bitcoin and many altcoins are also expected to reach historic all-time highs 12-18 months after these halving events, so 2025 may be the year we see these increases.\n\nBased on these projections, ETH might achieve an all-time high of $6,600, a new low of $2,800, and an average of $3,200.\n\nPrice prediction for ETH in 2026\n\nBitcoin’s halving event in April 2024 is expected to impact Bitcoin prices in 2025. However, experts say that we can expect a dip in 2026.\n\nSince cryptocurrency prices were in the spotlight last year, we expect governments to implement cryptocurrency regulations soon. There may be a slowdown in the current economic downturn if these regulations are positive and promote crypto evolution.\n\nMoreover, Ethereum is likely to undergo scaling by this time, making it much more valuable. Despite no latest all-time highs, Ethereum is projected to average $4,500 in 2026, with sustained highs of $5,800, lows of $3,500, and no upcoming all-time highs.\n\nPrice prediction for ETH in 2027\n\nEthereum is expected to see a great year in 2027 due to its continued institutional use and absence of price-halving events. After several big regulatory moves are implemented, the global economy is expected to grow steadily after the recession scares of 2022 and 2023.\n\nHowever, technical improvements are expected to make ETH more affordable and easier to use, which should counteract the growing demand. Due to these factors, ETH prices may fall into a narrow range in 2027.\n\nPrice prediction for ETH in 2028\n\nIn the years leading up to the 5th Bitcoin Halving in 2028, cryptocurrencies are gaining popularity. Investors are becoming more aware of the cycle and the expected rise in cryptocurrency prices. Ethereum's price might rise due to investor speculation. Whether Bitcoin and Ethereum undergo decoupling at this point remains to be seen. However, Ethereum's price will continue to be influenced by Bitcoin.\n\nThese factors predict that Ethereum's price might hit $6,300, close to its all-time high in 2025. Investors are unlikely to buy at higher prices. The median price fluctuates from $4,200 to $5,800.\n\nPrice prediction for ETH in 2029\n\nEthereum is expected to implement most upgrades by 2029. We may see more institutional and public networks used for business and personal stuff. Ethereum's widespread adoption is expected to transform commerce and value transfer.\n\nEven though many people believe the Bitcoin Halving event is already priced in, prices continue to rise. The price of Ethereum might hit a first-time 5-figure price of $10,200, with a low of $7,100 and an average of $8,800 if it retains its position among the world’s most popular and widely-used smart contract platforms.\n\nFinal words\n\nEthereum is predicted to grow significantly over the next five years. However, it is important to remember that several factors can affect its price, like demand, development, competition, and market sentiment. The success of Ethereum depends on how well it can solve scalability issues, expand its applications, and stay on top.\n\nDisclaimer: The information, view and opinions provided in this article are being provided solely for promotional and informational purposes and should not be construed as investment, tax or legal advice."
    },
    {
        "id": 78,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxOYUo3OGU1VzRjOUUySWFXZThsbXFOSXJOTkwzS3E4dGNkX2c1TXhsUVc5Ry1aaWhTTDQ5OEwxTkNmMUo0WGdGOXFfcTNWMlFhTnpTM0hodC10VXhrTFU3Qm4tN2dZU3hhaFdZY0RWamhzSnVtVHVnWUlFQm5FWlJXWFVDUTBzUUk1ckhV0gGQAUFVX3lxTE5LUWg0VC1fZHNiZ3Npdmdfd2VpR3NPc0tRU1pMcUpULWhMX21fa3czR1ZBbVlPYXJEcThfdkx1c2dfanhTbVVoM2tJMS1NRnRNWGhJWnBCUzg5Y2x3eXdMMGtKMDNJNXBFTGV0YWJ0eTlycWtNWmVnTGNacnNjSHNDOWF0alNZajRsbGR3YmtsMg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Apr 2024 07:00:00 GMT",
        "title": "Ethereum vs BNB: 5 key differences in crypto futures this April - AMBCrypto News",
        "content": "BNB’s funding rate has been mostly negative since the beginning of the month.\n\nBNB accumulation remains steady in the coin’s spot market.\n\nBinance Coin [BNB] is showing signs of weakness in the perpetual futures market. Coinglass’ data showed that this month, it has experienced the most negative funding rates of the top five leading crypto assets.\n\nInformation retrieved from the data provider revealed that between the 4th and 8th of April, the coin’s funding rate across exchanges was negative.\n\nFunding rates are used in perpetual futures contracts to ensure that an asset’s contract price stays close to its spot price.\n\nWhen an asset’s contract price is higher than its spot price, traders who have placed bets on a price rally (long traders) pay a fee to traders anticipating a decline (short traders). When this happens, the asset’s funding rate will be positive.\n\nConversely, when the contract price is lower than the spot price, short traders pay a fee to traders holding long positions, resulting in negative funding rates. When an asset’s funding rate is negative, more traders are holding short positions than there are traders expecting a price rally.\n\nEthereum vs BNB In comparing Ethereum and BNB, particularly in the volatile arena of crypto futures this April, several key differences emerge. Firstly, Ethereum’s funding rates have remained more stable compared to BNB’s dramatic shift from negative to positive within days. Secondly, while BNB showed a significant 29% increase in futures open interest, Ethereum’s growth in this area has been more consistent, reflecting its broader market acceptance. Thirdly, BNB’s quick rebound in the futures market contrasts with Ethereum’s steadier, more predictable market movements. Fourthly, the negative funding rates experienced by BNB highlight a market sentiment that differs markedly from Ethereum, which typically enjoys a more balanced view among traders. Finally, the comparison of key momentum indicators, such as the Relative Strength Index (RSI) and Money Flow Index (MFI), would likely show differing trends between the two, with BNB recently witnessing a surge in accumulation not necessarily mirrored by Ethereum. These differences underscore the unique dynamics and investor sentiment driving each cryptocurrency, providing insightful perspectives for traders navigating the futures markets.\n\nSeparately, according to Coinglass, BNB’s futures market sentiments have improved in the past four days, as the funding rate has remained positive. This has also been accompanied by a rally in the coin’s futures open interest.\n\nAt $747 million at press time, BNB’s futures open interest has increased by 29% since 8th April.\n\nThe market steadies\n\nAs of this writing, BNB exchanged hands at $611. Per CoinMarketCap’s data, its value has grown by 5% in the last week.\n\nAs the coin attempts to consolidate within a range, market volatility has reduced significantly. An assessment of BNB’s Bollinger Bands showed a narrow gap between the upper and lower bands that make up the indicator.\n\nWhen the gap between these two bands is narrow, the market experiences low volatility. However, traders also interpret this as a signal that a breakout or significant price movement may occur in the short term.\n\nRead Binance Coin’s [BNB] Price Prediction 2024-25\n\nFurther, BNB’s key momentum indicators rested above their respective center lines at the time of writing. Its Relative Strength Index (RSI) was 61.19, while its Money Flow Index (MFI) was 51.44.\n\nThese values showed that BNB accumulation persisted among market participants."
    },
    {
        "id": 79,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxObnQ0eFcxMlRzRGVSMm5mRjQ0OWZOZTRscXY5ZVpoZTd2b1VPZUlFdVlGUHBsRVdyUnhhMWRFMTJsblY1M25pYm93UVpVckFLTzA3RHp4NkRXVnZNcllzLW9BYlY1ZmZpYVZJaVVEaWhlT0pfSVhIMThHUjFkbVRRZDBXYUpBR0ZJOUHSAY8BQVVfeXFMTWxZZDYyS0I4RnFKNFBYNXlzVTNUcm95NVRGZVhvMnVrR2stMTc2MEFrZS1tTHZfQmx5djV4OXdKanRVVHZ0Z2dxQi1BXzNsM3AxLXFJRWdjOHdJZXlWUk1oSzBRZU9yekEtaTNISUZOLTdRQkphT0pBX1lrRGxLLXJFUTg0b1luZ0NVNFpXVFU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Apr 2024 07:00:00 GMT",
        "title": "Ethereum outdone! Tron’s $110B USDT transfer sets new highs as… - AMBCrypto News",
        "content": "USDT’s reserves on Tron accounted for more than 52% of its total circulating supply.\n\nUSDT and Tron have gained notoriety in the past for links to terrorism.\n\nTron [TRX] solidified its position as the most sought-after chain for transacting USDT, the world’s largest stablecoin.\n\nTron and USDT: Match made in heaven?\n\nAccording to on-chain analytics firm IntoTheBlock, USDTs worth a whopping $110 billion were transferred on Tron last week, more than twice of what was settled on Ethereum [ETH].\n\nUSDT reserves on Tron have expanded sharply in the last year, accounting for more than 52% of its total circulating supply as of this writing, AMBCrypto examined using data from Tronscan.\n\nThe reserves have increased by 16% since 2024 began, and nearly 26% over the year.\n\nThe dominance was observed in the other way round as well. USDT accounted for more than 98% of Tron’s total stablecoin market cap of $54 billion, according to DeFiLlama.\n\nIntoTheBlock cited low network fees as the major driver behind the stablecoin’s increasing supply on Tron network, a view shared by most observers in the crypto space.\n\nTron’s cost advantages in transferring USDT have attracted users in hordes. The Justin Sun-founded chain has remained the undisputed leader in daily active users over the last year, AMBCrypto noticed using Artemis’ data.\n\nWill past blemishes come to haunt?\n\nWhile Tron’s growing USDT reserves were praiseworthy, there have been blowbacks.\n\nThe network came in the eye of the storm last year when it emerged as most favored crypto transfer network by terrorist organizations to fund their operations during the Israel-Gaza war.\n\nIs your portfolio green? Check out the TRX Profit Calculator\n\nIsraeli counter terror agencies cracked down on wallets linked to such groups and seized funds, most of which were in USDT.\n\nWhile there was no direct evidence to suggest this, the aforementioned revelation might have had a bearing on the discontinuation of USDC, the second-largest stablecoin, on the network."
    },
    {
        "id": 81,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQS2F5aWt5RE1NZnp6NU5BemtUejVXWWl6ZFBaRmVyeDA2bkdGTlE4b0YxdUpoQXJ6eDE5OFlfbWVZdlFZT25Ha3RHcmE1LXRvNG0xdno3blZmUndYYjNDV1RHV3hLT3RXT2FYenZGN05TclRxeWhxQVR2WXJCOERobTlONV9VbFpCWW5QLTU3SEhXQkI3MFEw0gGcAUFVX3lxTFA4LWo3R0l2TndTUFZralpCSFNNY2VMclR5dTdlQnI2X3BLNTljOE1Fa1NETEZHcHdCbk93NzRpODFMcGpWOGtLdGVaaTVmMUVLMnlta1hxYUJMLXlyTmVMUVEyRDRvNFF2NlRtVm5uVmF2VTJjVUlpdnRYa0dtendkdVhkX1dEeGtVMVhPMjNOSjlYWnhfWEVFWE5TUA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Apr 2024 07:00:00 GMT",
        "title": "Hong Kong All Set to Launch Landmark Bitcoin and Ethereum ETFs - Coinpedia Fintech News",
        "content": "Elena is an expert in technical analysis and risk management in cryptocurrency market. She has 10+year experience in writing - accordingly she is avid journalists with a passion towards researching new insights coming into crypto erena.\n\nStory Highlights Hong Kong is expected to approve its first Bitcoin and Ethereum ETFs soon, aiming to become a leader in the Asian crypto market.\n\nThis move is seen as positive for investor protection and attracting investment, but some worry regulations might be too strict.\n\nThe approval is a big step for digital asset development in Asia and could set a new standard for crypto in traditional finance.\n\nHong Kong is on the edge of a breakthrough as it awaits approval for its debut Bitcoin and Ethereum exchange-traded funds (ETFs). Reports hint that the Securities and Futures Commission (SFC) could give the green light as soon as Monday, marking a significant moment for the city’s financial landscape.\n\nHarvest Fund Management’s international division and a collaboration between Bosera Asset Management (International) and HashKey Capital are driving this initiative forward. It’s a united effort within the industry to embrace the growing crypto market.\n\nWhat’s the Vision?\n\nThe impending approval perfectly aligns with Hong Kong’s strategic vision to cement its position as a global player in cryptocurrency. Taking cues from successful ventures in the United States, these ETFs aim to tap into the rising demand for digital assets across Asia’s financial markets. It’s not just about embracing innovation; it’s about leading the way in transforming financial instruments.\n\nFor Hong Kong, introducing spot ETFs marks a significant milestone in its journey toward becoming a crypto-friendly hub. These ETFs are poised to attract substantial investment, enhance investor protection, and bring order to the crypto market.\n\nFurthermore, Hong Kong’s spot ETFs could kickstart the integration of digital asset platforms with traditional financial institutions. This seamless integration sets the stage for a harmonious relationship between conventional and digital finance, setting a new standard for the financial industry.\n\nChallenges and Criticisms\n\nHowever, despite the optimism, challenges lie ahead. Critics worry that Hong Kong’s regulatory framework might be too restrictive, deterring global investors and hindering market growth. Questions linger about the limited number of available licenses and their potential impact on market dynamics.\n\nAdditionally, there are calls for maintaining reasonable fees and stringent custodial standards to ensure investor protection and regulatory compliance.\n\nAnticipation is Building\n\nDespite these challenges, anticipation is high among stakeholders eagerly awaiting the approval of spot Bitcoin and Ethereum ETFs. Analysts predict these ETFs could attract significant investment, further solidifying Hong Kong’s reputation as a safe and regulated hub for crypto trading.\n\nThe impending launch marks a significant milestone in the maturation of digital asset investments in the region. It’s a move that not only aligns with global trends but also has the potential to set a new standard for the financial sector’s approach to digital assets."
    },
    {
        "id": 82,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxQQW5SaEZFcmRFakZ0UXhWb25meld5eDg1ZF9wc2xUNEtaWWVwQXJUOUs1NGtsNVN2VjBlVVQ4MzZYSHRSUmJWRk9TX0FuSHVOcnlzeDBmZHNZYmJhWmViSnRCYklVb1BMQnJjUEtWQ1NWa3RqdVhrU3kxbDc4UllLUElIOTdmWktKeXFQOEV4bmFoUzNxbHfSAZsBQVVfeXFMTjlSeENxTTY1THhEQnVaYWVGTm92djdLZlBBczNGall4WlllUjZYOUdqQksyZk1NQ1A1amVhV3FVVXg3U2JaUmJDNWVtOVhYcmcyOHlMeHhPbUtJZjNnbl9ndEJBR1FCdmhPVWJlX2FtcEM1YzV0MjFXRkZZeGtEeHNkNlM1dXVzYlZJU25KVFA4N2N5MU5tSTVoem8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Apr 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum And XRP Price Prediction For Q2 2024! - Coinpedia Fintech News",
        "content": "Elena is an expert in technical analysis and risk management in cryptocurrency market. She has 10+year experience in writing - accordingly she is avid journalists with a passion towards researching new insights coming into crypto erena.\n\nWith Bitcoin Halving around the corner, the cryptocurrency industry has regained momentum and displayed significant price action over the past few weeks, highlighting an increased number of, buyers and HODLers in the crypto market.\n\nAll the top categories in the industry have witnessed a massive bounce back in the chart. The market is recording a bullish price action from elite crypto tokens to low-cap altcoins. Will the top tokens of the industry, which are Bitcoin, Ethereum, and XRP achieve their major targets by the end of Q2?\n\nBitcoin Price To Hit $100,000 In Q2?\n\nThe BTC token continues to display a consolidated price action after achieving a new ATH during March, indicating increased bullish influence for the market leader in the cryptocurrency industry. Moreover, the Bitcoin price has added approximately 7% within the past seven days.\n\nTradingView: BTC/USDT\n\nAt the time of writing, the price of one BTC token was $70,704 and its Year-to-Date (YTD) returns stood at 68.45%. Positively, the Cross EMA 50/200-day acts as a support, indicating a bullish outlook for the token during the upcoming weeks.\n\nThe technical indicator, MACD, shows a constant decline in the chart, suggesting a strong bullish sentiment in the market. Moreover, the averages display a bullish convergence, highlighting increased buying-over-selling pressure for the Bitcoin price in the crypto industry.\n\nWill Ethereum Price Price Hit A New ATH This Month?\n\nAfter recording a yearly high of $4,094, the Ethereum price continues to display a neutral trend by trading between $3,149 and $3,697. Positively, the leader of altcoins, ETH tokens has given its investors a return of 58.24% this year, indicating increased bullish influence for the altcoin in the cryptocurrency industry.\n\nTradingView: ETH/USDT\n\nWith a trading price of $3,577 and a market cap of $432,006,702,193, the Ethereum token is predicted to hit a new all-time high (ATH) with its price possibly achieving the $5,000 mark for the first time.\n\nThe Moving Average Convergence Divergence (MACD) shows a rising green histogram, highlighting an increase in the bullish influence in the market. Furthermore, the averages display a bullish convergence, highlighting a positive price action for this month’s ETH price.\n\nXRP Price Displays A Bullish Sentiment!\n\nDespite the increased market volatility in the crypto industry, Ripple’s XRP price has displayed a neutral trend for most of the year, indicating a rise in disinterest among investors in this altcoin.\n\nThe XRP token repeatedly failed to breach its important resistance level at $0.67, highlighting a strong liquidation point for the Ripple price at that level in the market.\n\nTradingView: XRP/USDT\n\nHowever, the altcoin is predicted to record major price movements post-halving, highlighting a high possibility of the XRP token breaking out of its major resistance level this month.\n\nThe MACD displays a flatline in the chart, indicating weak buying and selling pressure in the cryptocurrency industry. However, the averages show a strong bullish sentiment in the market for the XRP price, suggesting the price will continue gaining value in the coming time.\n\nWhat’s Next For BTC, ETH, And XRP Prices This Month?\n\nThe Halving month prepares the industry to record significant fluctuations in their respective portfolios. Further, the Bitcoin, Ethereum, and XRP price is projected to hit a new high this year, indicating a rising adoption of this technology in the financial world.\n\nNote: Make sure to DYOR before investing in any digital asset as the market sentiments of the cryptocurrency industry are currently too high."
    }
]