[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiYEFVX3lxTE15bGt4OUg4cW12dHJmMEJFVmdGTUt5RG9LdnoyNi1ZYUtzanJwamJIWHE1eE1Nclh0a1p1WEViZktBdkI1R2hSek8takJqTGtiNWZlQlFSdGZFN0w2REY2Tg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jan 2024 08:00:00 GMT",
        "title": "State of Ethereum Q4 2023 - Messari",
        "content": "Key Insights\n\nQ4 2023 was a growth quarter for ETH, but it underperformed the larger Bitcoin and the younger platform chain challengers.\n\nthe larger Bitcoin and the younger platform chain challengers. However, all of Ethereum’s fundamental metrics returned to growth. The return in crypto market sentiment, reflected onchain as transaction and user activity grew.\n\nThe return in crypto market sentiment, reflected onchain as transaction and user activity grew. Ethereum’s rollup network now laps the mainnet three times in terms of transactions. Strong growth in rollup activity bodes well for Ethereum’s scaling vision.\n\nin terms of transactions. Strong growth in rollup activity bodes well for Ethereum’s scaling vision. Total value locked (TVL) on Ethereum grew by 35% in Q4 , with DEX volumes growing by 26% and NFT volumes by 31%.\n\n, with DEX volumes growing by 26% and NFT volumes by 31%. Ethereum's upcoming Cancun-Deneb (Dencun) is finally around the corner. The upgrade aims to make rollup transactions more cost-effective , potentially rivaling alt-Layer-1s. The upgrade is being tested and is expected to be released later in Q1 2024.\n\n(Dencun) is finally around the corner. The upgrade aims to , potentially rivaling alt-Layer-1s. The upgrade is being tested and is expected to be released later in Q1 2024. Ethereum promises an exciting 2024 with much-hyped launches of EigenLayer and Blast as well as a potential spot ETF approval.\n\nPrimer\n\nEthereum (ETH) is a distributed blockchain computing platform for smart contracts and decentralized applications. Ethereum’s smart contracts have enabled the creation of various new assets and industries, such as Decentralized Finance (DeFi), Non-Fungible Tokens (NFTs), Decentralized Autonomous Organizations (DAOs), and more. It features an execution engine optimized for smart contract processing, the Ethereum Virtual Machine (EVM).\n\nEthereum utilizes a Proof-of-Stake (PoS) consensus mechanism where users can run validators to secure the network and participate in block production. Users that meet the hardware requirements, run the latest execution and consensus clients, and deposit 32 ETH into the Beacon Deposit Contract can permissionlessly operate an Ethereum validator.\n\nInstead of scaling at the base layer, Ethereum has chosen a scaling strategy through a network of Layer-2 protocols. Through this strategy, Ethereum plans to scale while maintaining a high degree of decentralization. These protocols rely on Ethereum for data availability and security, while they only focus on fast execution. Ethereum is planning a network upgrade in Q1 2024 that will allow it to better serve the needs of these protocols by creating a separate transaction type to store data and reduce the costs for the Layer-2s.\n\nWebsite / Twitter\n\nKey Metrics\n\nPerformance Analysis\n\nFinancial Overview\n\nA single job-risking (probably job-costing) fake X (formerly Twitter) post was all it took for investor interest and sidelined capital to return to crypto. On October 16, 2023, the Cointelegraph X account published that the Bitcoin spot ETF had been approved. The market reacted instantly, with BTC surging by 7% from $28,000 to $30,000. While the news was later confirmed to be fake, the market had shown its hand. Investors and capital realized that the Bitcoin spot ETF approval would be a big catalyst and piled in. So ended the two-year-long crypto bear market and began the first leg of the current crypto cycle.\n\nETH performed well, with its price surging by 37% for the quarter, however, it was the second worst-performing non-stable asset above $10 billion. It underperformed both its larger peer Bitcoin, and younger platform chain challengers like Solana and Avalanche. Bitcoin was driven by the ETF narrative, while the younger platform chains saw a sentiment reversion after being sold off more heavily during the bear market.\n\nHowever, not all was bad for Ethereum. With a broad recovery in sentiment, fundamental ETH metrics improved compared to last quarter. Over the quarter, 216,000 ETH was issued, but 270,000 ETH was burnt through transaction fees. This burn led to a net deflation of 50,000+ ETH at an annualized deflation rate of 0.2%.\n\nIn the first half of 2023, certain high volatility periods generated greater real yields for validators, but there were no events of similar magnitude in the second half. In Q4, the annualized real yield for stakers was 4.3%, flat compared to the previous quarter. The growing amount of ETH staked and lower MEV opportunities meant validator rewards were lower by 0.2%. However, their impact on real yield was offset by higher net annualized deflation for the quarter of 0.2%, compared to the previous quarter’s inflation of 0%.\n\nNetwork Overview\n\nCensorship Resistance and Decentralization\n\nIt seems that every quarter, a new attack vector on Ethereum surfaces. Like the Lernaean Hydra, as one head is dealt with, another takes its place.\n\nIn Q4 2022, relays were censoring transactions by addresses sanctioned by the U.S. Office of Foreign Assets Control (OFAC). This threat was mitigated by Flashbots open-sourcing its relay, allowing for more competition. In the subsequent quarters, relay censorship fell below 50%.\n\nThe next attack vector surfaced in Q3 2023, with block builders increasingly censoring transactions. This remains high at 60-70%, with potential solutions under discussion.\n\nIn Q4 2023, Ethereum is facing a new threat. Some validators are playing “timing games” where they propose a block slightly later but still in time to meet the network cutoff. Proposing the block later gives them more time to capture greater MEV. However, this is a zero-sum game, as the excess MEV captured in one block lowers the MEV of the next block. Further, if all validators delay their blocks, no one captures excess MEV, and a new equilibrium is reached. However, blocks being built later do have negative implications for the network.\n\nIt encourages validator colocation to reduce latency. A validator that is closely located with other validators can propose a block later and still meet the network cutoff. As such, it penalizes geographically distributed home stakers and rewards professionally managed colocated validators.\n\nDelays in proposing blocks may lead to more missed blocks, causing greater network instability.\n\nThe core developers have suggested some solutions to discourage and mitigate the impact of these timing games. A short-term solution is coordinating the relay layer to enforce block requests at an earlier time. Longer-term solutions include adding explicit penalties for missing blocks, rewarding earlier block production, and introducing variable block times.\n\nTransactions and User Activity\n\nIn Q4, average daily transactions grew sequentially by 6% to 1.07 million, the highest for any quarter in 2023. However, the growth was led by simple wallet transfers, stablecoins, and infrastructure transactions. Layer-2, NFT, and DeFi transactions declined over the quarter by 29%, 9%, and 5%, respectively. The fall in Layer-2 transactions may be explained by hype receding from friend.tech, which had peaked in Q3.\n\nAs user interest increased, active addresses trended slightly higher for the quarter, growing by 4% to ~400,000. However, there was slower growth in unique addresses, suggesting fewer new users joined. The growth rate in unique addresses fell for the second quarter in a row, down to just 3% in Q4, compared to 4% in Q3 and 5% in Q2 2023.\n\nEcosystem and Development Overview\n\nRollup Network\n\nThrough all the ups and downs, a trend is emerging clearly that Ethereum is actually scaling through its rollup network. Major rollups have cumulatively increased Ethereum’s throughput by almost three times to 4 million average daily transactions. There was a boost in L2 activity in December as inscriptions mania spread beyond Bitcoin to Ethereum rollups.\n\nzkSync Era had the highest transaction activity in Q4 at 900,000 average daily transactions. Sequential rollup transaction growth came from Linea, Arbitrum, and Scroll. Linea transactions grew 3x to 300,000, Arbitrum transactions increased by 30% to 800,000, and Scroll was a new launch in Q4 with average daily transactions of 120,000.\n\nSectoral Performance\n\nEthereum’s total value locked (TVL) grew by 35% to $30 billion, in line with its price performance. Lending protocols Spark and Aave had the highest growth among the top applications, growing by 286% and 33%, respectively. Curve DEX underperformed, with its TVL falling by 13% for its fourth down quarter in a row.\n\nBlast, a rollup by the Blur team, and EigenLayer, a restaking platform, were new entrants among the top applications. While neither product is live, they each attracted TVL of more than $1 billion with points incentives with the promise of a future airdrop. Blast and EigenLayer collect most of their TVL in liquid staked tokens (LST) of ETH and, invariably, further incentivize liquid ETH staking.\n\nWith growing incentives to stake ETH, its staking ratio has grown throughout the year. The staking ratio almost doubled in 2023, growing from 13% to 24%. However, the growth rate was somewhat slower in Q4. There was a net inflow of only 2 million ETH into the staking contract in Q4, compared to 3.6 million in Q3. Celsius, the bankrupt crypto lender, in preparation for the distribution of its assets, has been unstaking its ETH.\n\nIn Q4, among the large staking entities, Lido, Coinbase, and Rocket Pool grew their ETH staked by 5-6%, while Binance and Figment saw outflows of 9% and 3%, respectively. A large part of the growth in Q4 2023 came from smaller liquid staking protocols like Ether.Fi, Stader, and Swell, whose ETH stake grew by 200%+. EigenLayer has been a key catalyst in promoting the growth of long-tail LST protocols, as it allowed deposits for multiple LSTs.\n\nWith higher prices and greater user interest, volumes surged on decentralized exchanges (DEXs). Daily volumes through Q4 2023 averaged $1.3 billion, up 26% from Q3. Uniswap was the primary driver for volume growth, with its average daily volumes growing by $330 million to $930 million. Curve, Dodo, Maverick, and Balancer all had lower volumes in Q4 2023 compared to Q3 2023, with the largest fall in Curve volumes of 35% to $140 million.\n\nSimilar to DEXs, NFT marketplace volumes recovered over Q4 2023. Daily average NFT volumes grew by 31% in Q4 to $15 million, reversing the trend of the last two quarters. It was the sector leader again that led the growth, with Blur volumes growing by 38% sequentially to $10 million. Daily average OpenSea volumes grew by 23% to $4 million. Smaller challengers, LooksRare and X2Y2, lost market share as their volumes dropped by 52% and 8%, respectively.\n\nDevelopment Activity\n\nCrypto has lost developers over the 2 years of the bear market. As sentiment turns, we expect this trend to flip. Ethereum has fared somewhat better than its peers for developer retention. Its share of weekly active developers has increased to 31%, marginally better sequentially and 1% higher compared to Q4 2022. As Ethereum’s rollup infrastructure grows and attracts more opportunities, it may retain its developer share even in a bull market.\n\nQualitative Analysis\n\nCancun and Deneb Upgrades\n\nEthereum’s vision of scaling through rollups is materializing. Ethereum rollups now have significantly more transactions than the mainnet, and as they become more battle-tested, they likely benefit from a TVL migration from the mainnet.\n\nHowever, despite all the optimizations in compressing and posting data to Ethereum, rollups are still an order of magnitude more expensive than alt-Layer-1s in terms of transaction costs. The greatest challenge for rollups is competing with Ethereum mainnet applications for block space and paying higher gas prices when Layer-1 trends drive up usage. The next upgrade to Ethereum, Cancun-Deneb (Dencun), seeks to address this issue through EIP-4844 or proto-danksharding.\n\nEIP-4844 will introduce a new transaction type to Ethereum where rollups may post data to be stored in blobs by Ethereum validators for a short period of time. This data is stored on the consensus layer (CL) clients and does not interact with the execution layer (EL). As such, blobs will not only significantly reduce the costs of rollup transactions, but they will also make their costs independent of any Layer-1 transactions. Rollup transactions will likely become as cheap, if not cheaper, than alt-L1s after the upgrade.\n\nDencun is also expected to include other ecosystem upgrades, such as EIP-1153, EIP-4788, and EIP-7514.\n\nEIP-1153 is the foundation for Uniswap’s upcoming V4 implementation, as it relies on the transient storage opcodes in the upgrade.\n\nEIP-4788 will expose CL data to the EL, increasing the scope for innovation in staking pools like Rocket Pool.\n\nEIP-7514 caps the churn rate for Ethereum validators, reducing the rate at which more ETH is staked. This is a stop-gap solution aimed to buy time for researchers to figure out a more long-term solution for controlling the amount of ETH staked.\n\nDencun is expected to go live on the Goerli testnet on January 17, 2024, with Sepolia and Holesky testnet upgrades in the following weeks. There is no planned date for the mainnet release, but it is expected later in Q1 2024.\n\nPrague and Electra Upgrades\n\nAfter Dencun, the Prague and Electra (Pectra) fork is next. The upgrades in Pectra are still under discussion, but there seem to be two major camps -\n\nThe Geth client team wants to prioritize upgrading Ethereum’s state organization to Verkle tree proofs instead of the current Merkle Patricia tree proofs. This upgrade will help Ethereum unlock stateless clients, reducing the storage requirement for validators and helping the blockchain scale. However, this would be a more complex upgrade, taking over a year to ship.\n\nThe other camp, which includes Nethermind, Besu, Reth, and other execution client teams, wants a smaller feature upgrade before focusing fully on Verkle. These other upgrades may include the following EIPs - EIP-7002 will let execution layer transactions trigger exits on the consensus layer. This upgrade helps liquid staking protocols kick any offending validators. EIP-7251 allows the maximum effective balance on the consensus layer to exceed 32 ETH, allowing for easier compounding for solo stakers and fewer validators for large node operators.\n\n\n\nThe client teams will finalize the upgrade plan in the coming months, and the release will vary based on its scope.\n\nClosing Summary\n\nEthereum had a strong end to the year 2023 as market sentiment improved. All its key fundamental metrics returned to growth after a few quarters of decline, with very strong growth in its rollup ecosystem. However, despite all the positives, ETH was far from central to the crypto narrative as top dog BTC and younger platforms like SOL and AVAX stole the show.\n\nGoing into the new year, ETH has a slew of upcoming positive developments. The much-awaited Dencun upgrade promises to bring new life and lower transaction fees to its rollup network. Additionally, EigenLayer and Blast launched could create a wealth effect for the ETH faithfuls. Finally, after the BTC spot ETF approval, all eyes have turned to a potential spot ETH spot ETF approval. As the second largest crypto asset and the only other crypto asset with a futures ETF, the path for the ETF may be clear. 2024 promises to be exciting!\n\nLet us know what you loved about the report, what may be missing, or share any other feedback by filling out this short form. All responses are subject to our Privacy Policy and Terms of Service.\n\nAll content was produced independently by the author(s) and does not necessarily reflect the opinions of Messari, Inc. Author(s) may hold cryptocurrencies named in this report. This report is meant for informational purposes only. It is not meant to serve as investment advice. You should conduct your own research, and consult an independent financial, tax, or legal advisor before making any investment decisions. Nothing contained in this report is a recommendation or suggestion, directly or indirectly, to buy, sell, make, or hold any investment, loan, commodity, or security, or to undertake any investment or trading strategy with respect to any investment, loan, commodity, security, or any issuer. This report should not be construed as an offer to sell or the solicitation of an offer to buy any security or commodity. Messari does not guarantee the sequence, accuracy, completeness, or timeliness of any information provided in this report. Please see our Terms of Service for more information.\n\n\n\nNo part of this report may be (a) copied, photocopied, duplicated in any form by any means or (b) redistributed without the prior written consent of Messari®."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiX0FVX3lxTE9xR0hzVzB5aWdkcWlVTmFnQV9wM0UtdHZxZ3FPNnFlVTJFMjZ6Zjk3N2xYSTcyTjFLUUZBLTRwN2NyRGUxd2trQWNxMmNTc3lhM1cyeUkweGhfcVcwbThV?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jan 2024 08:00:00 GMT",
        "title": "Solana takes break from eating Ethereum’s lunch — for now - Blockworks",
        "content": "Finding the next big thing is the secret sauce for many investors, whether it’s startups, stocks, bonds, commodities or crypto.\n\nObsession with discovering “the next Ethereum” — or even an “Ethereum killer” — then seems only natural.\n\nEthereum’s smart contracts set the industry standard nearly a decade ago and have since inspired dozens, if not hundreds or even thousands, of rival networks.\n\nSolana is generally considered Ethereum’s primary competitor right now. Comparing market values shows nothing has really come close to eclipsing Ethereum. Yet.\n\nIn fact, BNB Chain (BNB) and Cardano (ADA) have come the closest over the past three years.\n\nThe market cap of BNB in April 2021 and late 2022 was about 33% of ether’s (ETH).\n\nADA had up to 25% of ether’s cap during the last bull market.\n\nSolana (SOL) set a new record relative to ether last month with 19%.\n\nRead more: It’s a Solanaissance: These 5 charts will cure the Ethereum vibecession\n\nPrice ratios — dividing one assets’ price by another and comparing over time — are commonly used to gauge the relative strength of cryptocurrencies.\n\nAnalyzing price alone is problematic due to inflation and deflation rates of many top cryptocurrencies.\n\nSolana’s market cap ratio against ether has retraced by a quarter since Christmas, now about 14%\n\nTake ATOM, the native asset for multichain ecosystem Cosmos. Over the past year, ATOM’s circulating supply has swelled by a third and its token price has slipped by 20%, according to data from The Tie.\n\nMeanwhile, ATOM’s market cap has grown 15%. Price alone implies ATOM is struggling, when it could be the market is simply absorbing fresh supply — and then some.\n\nSolana, on the other hand, has almost 17% more circulating supply than this time last year. Its price has quadrupled across that period, while its market cap has nearly quintupled. Comparing only SOL’s price would leave a chunk of the asset’s growth unaccounted for.\n\nMuch of Solana’s outsized growth over the past year can be attributed to its gradual recovery since the FTX debacle.\n\nRead more: Rebuilding trust: Solana’s roadmap after a challenging year\n\nDisgraced FTX co-founder Sam Bankman-Fried was a significant investor in Solana and its ecosystem, leading SOL to collapse by up to 65% directly following FTX’s implosion in late 2022. Ether fell less than 30% and completely recovered in about two months.\n\nMarket caps are just one metric by which to compare cryptocurrencies and blockchains. Total value locked, unique addresses, on-chain volumes, developer activity, fee revenues and transaction counts are among others. Each has its flaws.\n\nIn any case, Ethereum isn’t exactly threatened right now. But going by market cap growth alone, Solana is well on track to become Ethereum’s primary competitor over BNB.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxQVGJsSmxiaHNETXk3SzVVQTFlV2t0dTlXTkpWOGRkMG1XRlNGV3BDdklTSU53YU5xZXNqSU9oR05UdjV3OGFwUXp0ZEpMZnJoa19HakVrREZjTmNCSDAzM3A2eUFBaHNjeUdUeUlMQjEyajVSenV4bUlmRDM4UTZnWVRUUzlReFo4eVEzeXF4bVE5ekVaY2NIWjIyb3Q5a2I0b09EVUtpWVo5QkY2aE5Halp2dkVMZXF4TDdjZNIBwgFBVV95cUxQVFpXSXh0emZJNHBneVNZcVdseXkzZjFZeWlFeXdiZWZhV1pnWnlLRHFBTllPSXUyQVNfZkdqdmtCVU1kSjlCRWZiQXh0QlpBRU5VR1FQdm96c3ZYelQwV1REdUFCWDFERjdzOW5iSks4bWxtX21UTEQ0aEc1ZDFMekloSmc5bldCRjZtZmpjOGtVMVg2a1lUaF9qcE4za2lrTEpKUWJRd3hhSFV4MWt4THJRdHJhaVNaZUxNX2Y2MGVaUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Gearing Up for More Than 35% Surge, According to Top Analyst – Here’s the Timeline - The Daily Hodl",
        "content": "A closely followed crypto analyst says Ethereum (ETH) is setting up for a sizeable rally after successfully completing a long consolidation phase.\n\nThe pseudonymous crypto analyst known as Pentoshi tells his 742,000 followers on the social media platform X that he believes Ethereum is on its way to the $3,500 range, the upper level of a range he sees ETH trading in.\n\n“ETH.\n\nWent to the mid-range of the new range we are in.\n\nYear-long consolidation into mid.\n\nExpect the higher range sometime Q1 early Q2.”\n\nAt time of writing, ETH is trading for $2,511.\n\nPentoshi is also keeping an eye on ETH’s biggest rival, Solana (SOL). According to the popular analyst, SOL, which had a dramatic run in the latter part of 2023, needs to consolidate for some time before making any new moves.\n\nHe pinpoints the $70 level as potential support for Solana.\n\n“SOL.\n\nThink this is just going to take time to play out. So far following squiggly [line]. While there is support just below here where it bounced from, think there has to be at least 30 days of consolidation somewhere. Even if we don’t see that $70 area.”\n\nSOL is trading for $95.49 at time of writing.\n\nLooking at Bitcoin, Pentoshi says that the recent approval of the spot BTC exchange-traded funds (ETFs) is a huge win for the crypto markets.\n\n“Day one volume record already broken on the BTC ETF. What [does it] mean?\n\nAnd what does it mean for other digital currencies?\n\nWill give a few hints:\n\n1. Others in line for ETF\n\n2. This is a great advertisement for the space. A ton of new eyes and entrants will come as a result\n\n3. You aren’t bullish enough long term.”\n\nBitcoin is trading at $42,625 at time of writing.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxOcmlLTWxGTGxzMEZpa1VBOWFhWmRRY01idEVwLWxrczk2eWZGbXJMMktKNmxkQ3hWelcyaEVlM294THVyUnBMaEJvTy1sZ0dud0FYLTM4OW03ekc1UFpaNmY4bWdGeEpWVEJ5ZkVqb29TNGh4SEM5VWw2RUFaR0xhU08xd0VRZ2hORFRibUJlUTFsSkRkT0xaZS1XVkx6Z0h2ZDNpY1NKaGRaTVNyMGfSAbMBQVVfeXFMTkRwSUZXQkhaOTB1bHFab3l1Um4xbVRFdGViczBNVFpwNEtfMjJ6N3JYa1ozNXdkaUJpQ1JHblBaRlJjS19ubzl3SDhxcndKVGJEcnFqZXRkNkZrNlVqWWZCd0ktLTg2QXJ0RXl5cU5QUmpUOU82TklqVEJvZ2liekxoT3M0ZGRvaU5EYzdOMEU2S014bHRCdEhicW9NbF9ybVhHdW1vdmJ6aHdCdmVJdHZYUjQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jan 2024 08:00:00 GMT",
        "title": "Shiba Inu (SHIB) Becoming Bullish, Ethereum (ETH) Price Screams Rally Continuation, Bitcoin (BTC) Not Giving up Market Dominance - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nShiba Inu currently displays an ascending triangle pattern on the SHIB/USDT chart. This technical formation is widely recognized and could be a signal to a significant price surge for the meme.\n\nAdvertisement\n\nAn ascending triangle is characterized by a flat upper resistance line and a rising lower support line. This pattern suggests that buyers are gradually gaining ground against sellers, as each dip is bought up at a higher level than the previous one, indicating accumulating pressure for an upward breakout.\n\nSHIB/USDT Chart by TradingView\n\nFor Shiba Inu, which has been lingering in a period of relatively nonexistent activity, this pattern could serve as massive fuel for volatility in the near future. Recent market conditions have seen a decline in interest toward legacy meme coins, with SHIB being no exception. The lack of significant developments within the Shiba Inu network has contributed to the muted activity around this cryptocurrency.\n\nIn contrast, the majority of the action in the meme coin sector has been taking place on the Solana network. This platform has become a hotbed for the deployment of new meme coins, which are exhibiting far greater volatility than those on the Ethereum network, where Shiba Inu resides. The brisk activity on Solana contrasts sharply with the sluggishness observed in Ethereum's meme coin space, drawing in traders and investors looking for quick gains and high excitement.\n\nEthereum's correction is temporary\n\nThe Ethereum market is currently exhibiting a correction, and there are patterns that suggest a rally may not only be on the horizon but could also be in continuation. The asset has recently experienced a sharp downturn, movement that is readily apparent on intraday timeframes. However, such stark movements are often precursors to reversals, signaling that Ethereum could be gearing up for an upswing.\n\nA closer look at the charts shows Ethereum's price action respecting a series of key technical indicators which, together, build a case for potential upward momentum. The asset has been tracing back to touch base with its moving averages, a behavior that is typically followed by a rebound, as these levels can act as dynamic support zones.\n\nThis corrective phase is noteworthy, especially considering the robust rally Ethereum enjoyed in the preceding weeks. Corrections are a natural and healthy part of any asset's price trajectory, allowing for consolidation before the next leg up. For Ethereum, the current pullback could be shaking out weak hands, setting the stage for a stronger rally propelled by a more committed investor base.\n\nBitcoin's dominance not going anywhere\n\nAfter a brief breach below the 50-day EMA — a critical indicator of medium-term market sentiment — Bitcoin has clawed its way back above this pivotal level. This move indicates a bullish signal for market observers, suggesting that Bitcoin is not yet ready to relinquish its market dominance.\n\nHowever, the ascent above the 50 EMA has not been met with the kind of vigorous momentum that bulls would hope for. The growth has been moderate, hinting that Bitcoin might encounter selling pressure as it ascends. This is not unusual on the crypto markets, where significant moves often face immediate resistance as traders take profits and skeptics cast doubts.\n\nThe recent price action has been a roller coaster for Bitcoin, which saw its value tumble from highs around $47,000 to lows near $41,000. This downturn briefly shifted the spotlight to altcoins, which seized the moment to stage local rallies. The diversification of gains across the crypto spectrum during Bitcoin's periods of weakness is a trend that has become more pronounced as the overall market matures.\n\nYet Bitcoin's ability to push back above the 50 EMA serves as a reminder of its underlying strength and the confidence investors have placed in it. Despite the opportunity for altcoins to rise, Bitcoin remains the anchor of the crypto market, with its moves often dictating broader market sentiment. This recent rebound above a crucial technical level could be interpreted as Bitcoin's silent assertion that it is not ready to give up the throne just yet."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxPR190aFQyR1BzOHlTbWV0Nk1kVklfa3ctbkptSlRPY1BVdnNzQzM3UW1LOVJZWm9RYXlpZzR3VG01MTI0R0NqNjg3c3d3QndTNU5JUXVMcFptRFJnQ2xYRDJRLVdjUkg0M1lnSVo2V0dkMFN5anJvdE0zYnQ2TktYWFNwV3lsUk8zY2I4SHVIRTRFRWhQT21RUEZHa2RCZ2t2NEpj0gGoAUFVX3lxTE9VWVU2MUpCNDlnX0hHRzNCVXY4c0JlLWtjODdXNEpNek8tQkNkamFWSlFjV0hNdXZtanFKNUkxOWNSMVEtaDc0aTlxcnNGR0dpbW1SalNVQklsODFfeXpxRDZaRFZxMXpSb25tWTBJenFYSUF1TDRoTE01dU5pUGlvcjc3ZTFJNWJ2aUlHZDloQnJCczROZEhTTXE1NVBpcURsdUJQT0N2Qw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jan 2024 08:00:00 GMT",
        "title": "Will Solana (SOL) Flip Ethereum (ETH)? One Key Metric Tells All - Investing Haven",
        "content": "Solana’s meteoric rise to close out 2023 (91% gain over the past month) has left crypto enthusiasts pondering whether SOL can flip ETH as the second most-popular token.\n\nWe’ve recently shared our thoughts on a Solana prediction for 2030 (hint: it’s bullish), and also noted that analysts are predicting an uptrend for SOL in 2024.\n\nNow, we’re going to need to zoom out a little to a ‘35,000-foot view’ to see whether these short-term trends could lead to long-term implications.\n\nOne thing we should note is that sentiment in crypto changes rapidly.\n\nIt feels great to see a 90% gain over the span of a month — but it hurts to then see your favorite token decline 10% the following day.\n\nWill Solana Flip Ethereum?\n\nLet’s get some other opinions here as we pull out our crystal ball.\n\nJulian Deschler, the Co-Founder of Elusiv, a Solana-based Web3 encryption layer, shed some insights on the topic.\n\nGranted, we do want to point out that he chose Solana for his project, an implicit bias toward the chain.\n\nIn a recent interview, Deschler first addressed why Solana had a breakout year in 2023.\n\nHe cited insanely high network speeds and increased dev activity as two primary reasons for picking SOL.\n\nIt’s no surprise that he alluded to high gas fees on ETH being a deterrent to devs and investors alike.\n\nHe also shared his belief that Solana’s growth isn’t limited to the short term.\n\nWe agree on that point for the future, but let’s cast some doubt on SOL flipping ETH anytime soon.\n\nMarket Cap Says Otherwise\n\nAs we can see from the drastic difference in market cap, SOL has significant ground to gain. That’s not to say it couldn’t happen in the next decade, but with institutional adoption coming soon (May?) via an ETH-spot ETF, it looks like the gap could grow wider. We’ve been bull tweeting the $BTC etf since 25-28k Soon, we get to do this all again with the $ETH ETF in 2024 No matter what you believe, it’s all game theory. as the date approaches people will be less willing to sell, and others will feel the need to buy $2,7xx and 3.4k… https://t.co/a1yufMX6l7 pic.twitter.com/bbO3EQIkNx — Pentoshi 🐧 euroPeng 🇪🇺 (@Pentosh1) December 23, 2023 In the short term, we wouldn’t be surprised to see Solana trade sideways for a bit, and see some reallocation go towards ETH in 2024. Solana vs. ETH NFTs As the crypto winter starts to thaw — price action has slowly warmed up for NFTs. The ETH vs. SOL battle rages on in the digital art world, with Ethereum leading the way. While Solana offers digital collectors and creators higher speeds and lower fees, the big money projects still live on ETH. Now, if you asked us whether I’d rather own a Picasso painting or a Crypto Punk (ETH chain), we’d take the Picasso. But if you ask us again tomorrow — we might opt for NFT history and side with a crypto punk. Our point being, things are changing so quickly in the world of blockchain. Massive upswings followed by violent downswings have become commonplace. This is why our conviction needs to remain high in all market conditions — even when you see the massive declines in price over the general NFT marketplace. This is to say that while SOL might be crowned ‘crypto king’ of 2023 — it wouldn’t surprise us to see ETH outperform it in 2024. See related: Our ETH prediction for 2024 Summary We do not believe Solana will flip ETH in the next five-to-ten years. However, as blockchain enthusiasts/analysts, we are pleased to see each token competing and making the other stronger as a byproduct. We remain bullish on each SOL and ETH, but see ETH as being a more complete chain (except for those pesky gas fees) in the longer term. Disclaimer: this is not financial advice. Please consult with a licensed financial advisor prior to making any investments. For more detailed research and top crypto picks, we recommend to follow our premium crypto charting alerts in which we share much more details across 35 tokens (including SOL and ETH), with timely insights combined with buy alerts."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNdEpmT0RuX2thaWpIal9jMzk4SGpjVWJyaDhvSXo0STZkNEJ1YU10aUNWcFh0dU5NcDJuQmE2OE8ySW04VFdvQ25UcG01LWpLNEVRMnl2c01xWm5uOEtCTUh4VXdjQmRnajFqS3oydGU4aUt0M21Mb1JlU2ZHY1lMY2FLR1BrR1BuY3Y3UNIBlAFBVV95cUxQeDJpUms4ckNjZmFseEVtNG4yNVExN0c4UzRlS2JRbUlUQXc3Q29EVFNBVjFyS19mLTlEVV8tTmYxbWNLMGh0dXZ4TjBqT3NVRURRQV9Hb0xvUHBWdVo5R3ItMWkxQTJDaWZ0V2M0NEg5eUNhM1Z1cUZwUm1GemxZZjdWbUZDcFFsSlhfMWJmR09iY0lJ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jan 2024 08:00:00 GMT",
        "title": "'Dookey Dash' Gets Free-to-Play Reboot With Token Rewards for Ethereum NFT Owners - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEver wished you could run endlessly through a sewer? Soon you’ll be able to—again—as Bored Ape Yacht Club maker Yuga Labs is bringing back its Dookey Dash game in a new free-to-play “Unclogged” edition thanks to a collaboration with game studio Faraway.\n\n“Looks like Curtis needs to get the plunger out, there’s something in the toilet,” a post from Yuga Labs reads.\n\nThe crypto startup will bring Dookey Dash back sometime this quarter, according to the post. In the single-player original Dookey Dash, gamers had to race through a 3D sewer tunnel as an ape riding a vehicle underwater to gain as many points as possible while avoiding obstacles that, if hit, would eliminate them from the game.\n\nUnlike the first release—which required a Sewer Pass NFT on Ethereum, granted free to Bored Ape and Mutant Ape NFT owners—anyone will be able to play the sewer-themed endless runner.\n\nAD\n\nAD\n\nToken benefits for BAYC, MAYC, Kodas, BAKC, and HV-MTL. pic.twitter.com/4RHnb2tKtN — Yuga Labs Gaming (@yugalabsgaming) January 16, 2024\n\nDookey Dash saw quite a bit of competition during its previous launch. Back in February 2023, the pro Fortnite player known as “Mongraal” won the first version of Dookey Dash with the highest score—and sold his winning NFT key to billionaire Adam Weitsman for $1.63 million.\n\nThat said, those who do hold Yuga Labs Ethereum NFTs like Bored Apes, Mutant Apes, Kodas, Bored Ape Kennel Club dogs, and HV-MTL Forge NFTs will be eligible for “token benefits,” according to the company. The trailer posted to Twitter shows ApeCoin logos, suggesting the Ethereum token for Yuga’s Bored Ape ecosystem will be given out as rewards. However, a Yuga Labs representative would not confirm that detail.\n\nThe new Dookey Dash: Unclogged game will be released for iOS, Android, Mac desktop, and Windows desktop users—suggesting it won’t be a web browser-based game like before. Mobile and desktop app-based games tend to run more smoothly and securely than browser-based games, so this is a win for fans of the stinky original.\n\nAD\n\nAD\n\nA Bored Ape and gaming influencer known as The Fortnite Guy or “TFG,” who was part of the latest Dookey Dash playtest and Yuga Labs’ gaming council, added Tuesday that the game is slated for a mid-February launch and that select Yuga NFT holders may get more NFTs via the game.\n\nTFG showed a video that displays different playable character skins, new game vehicles, a leaderboard, and purchasable in-game currencies in the new upcoming game version. Yuga Labs’ official gaming account on Twitter shared TFG’s video.\n\nThe new version of Dookey Dash appears to offer “Coins,” “Boosters,” “Energy,” “Skip-It” passes, and other items available for purchase using fiat currency. TFG also stated that coins can be earned by playing the game.\n\nDOOKEY DASH IS BACK!🤯 I've been invited to the @YugaLabsGaming council to playtest, create content, and work alongside the Yuga team to improve the game ahead of launch!🙏 There is SO MUCH new information about the game and I created a full length video discussing the updates… pic.twitter.com/MLFqaEw8e0 — TFG (@TFGmykL) January 16, 2024\n\nThe video also shows a new “Sewer Rank” system to show the game’s different competitive tiers. There’s Amateur at the bottom, followed by Semi-Pro, Professional, All-Star, Champion, Hall of Famer, and GOAT listed as the game’s ranked tiers, each with a different respective “boost” percentage. Players will be able to select different boosters before the game starts, with options like a “slow booster,” a “magnet booster,” and a “power shart,” for example.\n\nPresumably, the slow booster slows down the game to make it easier to navigate the cramped tunnels, while the magnet pulls in desirable items for the player to collect, and the “power shart” is… well, mostly likely Dookey Dash’s version of a very putrid nitro boost through the cartoonish game world.\n\nThe game’s updated version and re-release appears to be an effort to draw in the broader crypto community. Hopefully, this new version won’t suffer from quite the same levels of reported cheating and boosting as its original.\n\nEdited by Andrew Hayward\n\nAD\n\nAD"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxOczdtMmRLMGtsdXdEU01KVk1IRnVYbFhmd2lLSVhUUEhEZnF1bE9wM0JPeHZIQmI4elpON204LURveXJPYngwazRrckI2cUpQdmhpTHlNYXY0Z1dydl9hbHIzYUNaYlBpNXQ2UGY3VU5CNHpfYS1mb2c4emJVNE03RHZ2OWNTMFh1LXNqa3libTZZcTNWNjFxcWJORWVob0Z2ckdseDRreUMwRVJoRm5TRmpGVEZMc1dYeFNTQdIBwgFBVV95cUxPYWNCZlAwZldVRE54ZEVaX19wU3pDd2pIanI2eC1aN0xwRXZ6cm1VYVBtaDRpcG42N1pjQzdqSFhLd1BqR2hjYjJRQnFCV1FsNnRRLWpkSDZ5Y2VDTDdtNExJWTBJajdGWVl5TjlLUDdTRHZzRWZQUzhVZV9YMkxaMEgwdnp4MzFyUnlxczhRN0hMcklYZDd1UjNaZG1ZN0h4ZzdmcER0NmNCZ0RhamI4aXhkQ1ZXaUpoc2FIZW1VMlhJUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Rival Records Nearly 2,000% Growth in Unique Active Wallets Last Year: DappRadar - The Daily Hodl",
        "content": "Crypto intelligence platform DappRadar says user activity on one Ethereum (ETH) challenger exploded in 2023 as decentralized applications (DApps) saw remarkable growth during the period.\n\nAccording to DappRadar’s yearly industry report, smart contract platform Near (NEAR) recorded 302,000 new unique active wallets (UAWs) last year, marking a year-over-year (YoY) increase of 1,902%, the most out of any chain.\n\nEnterprise-grade blockchain Klaytn (KLAY) and layer-2 scaling solution Arbitrum (ARB) rank next to Near as the networks with the highest UAW increase gain with 73,000 new UAWs, representing a 1,099% increase, and 88,000 UAWs, a 624% increase, respectively.\n\n“In terms of chain performance, Near, Klaytn, and Arbitrum were the top gainers in UAW percentage increase. They had also a good performance looking with their token, as Near had an increase of 200% since the beginning of the year, Klaytn a 20% and Arbitrum a 32% increase since its launch in March 2023.”\n\nConversely, DappRadar says Ethereum rival Solana (SOL) recorded only 65,000 new UAWs in 2023, a 76% drop on a year-over-year basis. Web3-focused blockchain Hive (HIVE) saw 77,000 new UAWs, representing a 68% drop, as per the firm.\n\n“Solana experienced a rough start of the year, influenced by its association with the FTX fallout. However, the Solana ecosystem saw an impressive recovery during the last months of 2023. Hive, primarily hosting the trading card game Splinterlands, also had a difficult year, missing financial targets and reporting significant losses.”\n\nOverall, DappRadar says the DApp industry had a good run in 2023 with a 124% YoY increase in UAWs and ending the year with an average of 4.2 million daily UAWs.\n\n“In 2023, the DApp industry surpassed all expectations, and reinforced the notion that it’s an enduring and evolving part of the global financial and technological landscape.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxOblI4Z2F1c1FkTXdfWmR6cHJjb0lCV2c0X0dEbmxtLTBIampXUlRkOC1zSEp1bExvODA3TDBfWUhKVktGZWxELXNNLWdTTExJbEZPWHVQeTFZcXdIdThXNDFQZEhMTUQ4Qmdaei1nVU5EVHF1NkJEM3pIaVdDZmtuMEo2aEZVa2NDejFyM1VvZ2tjNjZ6eU04RkxQaDMtam5ISWJLT0RReW1HQ3pKRTdiN2VpWWZpbGRoZE9ya0xKeldhMUd6Um1LblVQMkExQVE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jan 2024 08:00:00 GMT",
        "title": "REPORT | Solana Had the Second Largest Ecosystem of Total Monthly Active Developers in 2023 After Ethereum - bitcoinke.io",
        "content": "The Solana developer ecosystem boasts more than 2,500 monthly active developers engaged in open-source repositories, Solana said in a report.\n\nSolana’s native token SOL has surged by over 700% since reaching its market low at the end of 2022, with activity driven by dedicated developers working on interesting projects across the ecosystem. This drew the interest of Vitalik Buterin, founder of Ethereum.\n\nSome smart people tell me there is an earnest smart developer community in Solana, and now that the awful opportunistic money people have been washed out, the chain has a bright future. Hard for me to tell from outside, but I hope the community gets its fair chance to thrive🦾🦾 — vitalik.eth (@VitalikButerin) December 29, 2022\n\nAccording to Solana Foundation, there is a continual influx of professional developers joining the ecosystem, and the developer environment is progressively maturing.\n\nAccording to the report:\n\n“This past year [2023], we have had a steady number of around 2500 – 3000 monthly active developers building on Solana throughout the year.\n\nMoreover, throughout 2023, 3-month developer retention within the Solana ecosystem has increased from 31% to >50%, keeping more developers that join in the ecosystem.”\n\nSolana has actively cultivated a good experience for developers by making onboarding easier and providing assistive documentation and scaffolding, making joining the ecosystem a clearer choice for developers.\n\nDespite its relatively recent establishment, with the Solana mainnet beta going live in March 2020, the developer ecosystem has rapidly expanded, positioning it as the second-largest ecosystem in terms of total monthly active developers.\n\n“Through multiple developer bootcamps that vary in focus and difficulty, there are 400 -500 senior developers graduating every 6 months with the intention of building on Solana. Data from the recent Solana Hyperdrive Hackathon shows that ~50% of the top 150 submissions and ~50% of the winners had completed one of these bootcamps.”\n\n– Solana Foundation\n\nOver half of the developers entering the ecosystem possess a minimum of three years of experience, contributing to a more seasoned level of input in the development of applications on the network.\n\nThe Solana Foundation’s latest hackathon, HyperDrive, witnessed the participation of representatives from 151 countries. Among them, participants from 65 countries, including Nigeria, submitted final projects for consideration.\n\n273 projects from Nigeria registered for the HyperDrive hackathon, with 41 submitting the projects while 2 are listed as winners.\n\nFollow us on Twitter for the latest posts and updates\n\nJoin and interact with our Telegram community\n\n_________________________________________\n\n_________________________________________"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMi7wFBVV95cUxQM2JkcTB2RVJMMC1ZSlV0anNRMzJHM2REamhBVWxaTVlQamN2MUp1SHVBQm5YaHBMZHJiRzl5QmQ3MGloU0tNeUc4clhLWVVFa1BDbEg5NTFzVDVWX3FXY05RVjlBWWp2RHFFT3NKSi1oR09QeGpwTGc2LWUyeDJENjQyNmdJV3RQak8xWkhZT1g5dGFBbnpUZWdpbklmX0lQZENlTUxHeV9QOGlTQjZjTDg3anJYR1ByODRES2pyT0h1Q1N4Zm05LU9uM2xGY040UGNSQWM4amV3SW1RN2hYUTUtcWszZlJGUXd0WUp2ONIB_AFBVV95cUxOcTBERzdLSExiTE13MWYyRi1ZLUZ3U3VWdzVCSENuMnNLdDJhbkdaMkNuZl9oVXVEYmlPVTFQeG56LWlwNVd3VWhJQ3Bjd2pvRXM2dzJFc2lLUjBoMTF3Vk10VDhmRnhoNmp3NVpqeW8zRDl0Ml9lREdPNDZSMkpDYWdnLVF3MV9Md0ZnN2hVdE90azBTQnBScDFvTGtYbW9jcWJJOXBmMUVJWG1OVGVjRkpuZURJa0o0X3VlaVNuWmNzcjNHc192ci04RnRqaVByVnZfemszMGdhdG5Ed0E0MXdwcXFWM2V5X3l1Nkk0VHR1c3hCemRmM1hvenQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jan 2024 08:00:00 GMT",
        "title": "Analyst Eyes 786% Ethereum Growth; Render and Borroe Finance Rises as Key AI Crypto Contenders - Analytics Insight",
        "content": "Following the analyst who shared his beliefs on X, ETH could reach a minimum of $10,000 in 2024 and a maximum target of $20,000. As of the time of his post, he envisaged a potential growth of 786%. While his projections might appear wild, his perspective aligns with current happenings in the space. As of this writing, ETH had risen past the $2,400 resistance level and sold for $2,543.06."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxOTy1FUlhUbEoyei0tOXpHc3cwRmVyb0IwcUNhcXlldGpUQmJyOHQxcUhvNTVfU0dkNGdmWDZmYXItLTM0cFRLUHRDX1ZuYXV4alc3VkNRQ3VCUUNYUHdYMnhTSnBsNXZ3TndMcUxJR1B2dVg2WUN3Nl92b3ZOVG1CVUl4Yk5qdENRRkNSMm4wMVdkLUhRMTlpbWRYc3puVzdwZmfSAacBQVVfeXFMTmhBZXZvdWJpa0U2NTJoYXZxZkpfTGRsV0loLTFRQURNanJRVGFLN1d0a3R6MkMyNDZrYTdIUnJ5VUJxT2F5dl9fay1GdGpoR0Rpd2w5NW5IUm45aFRiMzZnRkdsNmdQUUJUUWkzM2dvS3lOTnZRUUtFcVBiLUo3Q2VtemhpdFMzaE5sN0RLNEkzWEttcjFqUmFOYVBNelBFRkNfUnJBR1E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jan 2024 08:00:00 GMT",
        "title": "Terra Luna Classic Commits To Introduce EVM Support, LUNC Price Rebounds? - CoinGape",
        "content": "The Terra Luna Classic community looks beyond the typical chain developments to a more diverse approach by enabling Ethereum virtual machine (EVM) support on the chain. It will help the community-led Terra Classic chain to become compliant with new and emerging technologies, introducing many advantages.\n\nInterestingly, the EVM support will allow Terra Luna Classic to use the Solidity programming language, mostly used on EVM chains.\n\nadvertisement\n\nTerra Luna Classic EVM Functionality\n\nProposal 11978 “Investigate EVM Functionality” is under voting on the Station wallet and has already surpassed the pass threshold. The EVM will expand Terra Luna Classic use cases by bringing the programmability and composability of the EVM and sovereignty and interoperability of the Cosmos.\n\nThe proposal has received over 62% votes in favor, with 29 validators supporting the proposal. The deadline for voting is January 17.\n\n“Terra Classic will have the potential to become compliant with new and emerging technologies like Optimistic transactions, where Terra Classic does not need to send direct security information on each transaction, and Rollups, which allow significantly more transactions to be processed at once, dramatically increasing the processing power of Terra Classic,” said ClanMudhorn of Terrarium validator.\n\nEVM support on Terra Classic presents a strategic move toward interoperability and adoption of widely-used blockchain development standards. This can attract projects such as Curve DAO, Uniswap, ChainLink, Hedera, and others.\n\nMoreover, the limitations of inter-blockchain communication (IBC) on EVM will provide added advantage to Terra Luna Classic. The proposal outlines potential approaches, emphasizing a cautious and governance-driven decision-making process.\n\nRead More: Judge Denies Terra & Do Kwon’s Request For Reconsidering Court Ruling\n\nLUNC and USTC Price Momentum Fades\n\nLUNC price jumps over 5% in the last 24 hours, with the price currently trading at $0.000127. The 24-hour high and low are $0.000118 and $0.000126, respectively. Moreover, trading volume has increased by 40% in the last 24 hours, indicating a rise in interest among traders.\n\nMeanwhile, USTC price trades at $0.027, up over 10% in a week. The 24-hour high and low are $0.0266 and $0.0286, respectively.\n\nAlso Read:\n\nVarinder Singh Varinder has 10 years of experience in the Fintech sector, with over 5 years dedicated to blockchain, crypto, and Web3 developments. Being a technology enthusiast and analytical thinker, he has shared his knowledge of disruptive technologies in over 5000+ news, articles, and papers. With CoinGape Media, Varinder believes in the huge potential of these innovative future technologies. He is currently covering all the latest updates and developments in the crypto industry.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxNcy02VTgxYWt1TWZhUWxPemlidy1zdldrWDhNbEZBMnZUcTFGNVc2QTlPWUh0cmM0X254RUFwenZGck9vaTU1Yjl0ZXdJNzByd1llMDB1QlFrX2kyeXNJMU1CYldSUTF2cW5BdXBRWXdqY3hqemFWRlhJWkNpVVhsZzQ1ZmhvNVU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jan 2024 08:00:00 GMT",
        "title": "Total value locked in Ethereum surges 230% as ETH targets $3k - Finbold - Finance in Bold",
        "content": "Ethereum (ETH) has reached yet another remarkable achievement, dominating decentralized finances (DeFi) total value locked (TVL) by 80%. Meanwhile, its native token, Ether, aims at the $3,000 price zone, threatening a short squeeze soon.\n\nRemarkably, the total value locked on Ethereum’s first layer surged 231% in the last 24 hours to $100.31 billion. This sums up to recent increases, resulting in 255% and 283% changes in the last seven and 30 days, respectively.\n\nTotal value locked on the top 5 DeFi chains. Source: DefiLlama\n\nIt is worth mentioning that the above data, retrieved by Finbold from DefiLlama, does not include Ethereum’s second layers. For example, Arbitrum (ARB) has its own $2.62 billion in total value locked, ranking fourth among the DeFi chains.\n\nEthereum’s 80% dominance on DeFi by total value locked\n\nInterestingly, Tron (TRX) holds the second place with over 13 times less TVL than Ethereum, with $8.063 billion.\n\nIn this context, Ethereum layer-1 now dominates the DeFi ecosystem with an impressive 80.62% TVL dominance. Tron gets a share of 6.23%, mostly on stablecoins, while BNB Chain (BNB) and Arbitrum have over 2%. Solana (SOL) is the fifth most valuable DeFi chain with a $1.34 billion TVL and a 1.04% dominance.\n\nPie chart: Total value locked in all chains. Source: DefiLlama\n\nEthereum’s total value locked is distributed among 1004 DeFi protocols, contributing to its ecosystem.\n\nEthereum price analysis\n\nMeanwhile, ETH is trading at $2,554 per token by press time, slightly up 2% in the last 24 hours. Ether reached $2,714, its highest price of 2024, so far. On the other hand, $2,140 was the lowest for the first month of the year.\n\nETH/USD 4-hour price chart. Source: TradingView\n\nEthereum has around $307.09 billion of market capitalization at these prices. This is three times more than its DeFi ecosystem has in total value locked, evidencing how meaningful its dominance is among other chains.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiS0FVX3lxTE1wZHdyUzVnWWRQbUo1Mmpnbk1wcnBJb1V2WEZFRER1bjc0UkkzQlFRMjVtREQtc0o2MWE3QjdUYlpVU1FWTlVzM3RrUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jan 2024 08:00:00 GMT",
        "title": "SSV Network: Transforming Ethereum Staking with Distributed Validator Technology - Blockonomi",
        "content": "With Ethereum’s recent upgrade to proof-of-stake (PoS) consensus, staking has become vital to securing the network. But even after the Merge, operating validator nodes still requires 32 ETH, advanced technical skills, and reliable infrastructure. This creates barriers to participation for many people.\n\nEnter SSV – an open source protocol enabling decentralized and accessible Ethereum staking built atop the post-Merge landscape.\n\nHow does Ethereum staking currently work?\n\nUnder PoS, validator nodes add new blocks rather than miners. To become a solo validator, you must lock up 32 ETH and set up nodes to do the validation work – whether on hardware you control or using a third-party service. These validators then earn rewards in the form of additional ETH proportional to their stake. However, there are significant hardware demands and the risk of penalties if your validator goes offline.\n\nThe SSV solution\n\nSSV is a staking infrastructure protocol developed by a community-driven DAO. It works by distributing validator keys among non-trusting nodes called “operators”. This means multiple operators can jointly run a validator without any one operator having full control.\n\nAnyone can join SSV as an operator by running an open-source node and registering keys. The protocol handles distributing validator key shares among operators automatically. Validators with 32 ETH at stake provide the keys to the network to have their ETH staked across the operator pools. This gives them effortless access to staking without infrastructure costs. Even if some operators go offline, rewards keep accruing due to the distributed nature.\n\nBenefits of the SSV model\n\nSSV unlocks Ethereum staking for regular users in a decentralized way. By splitting up infrastructure needs, it offers:\n\nReduced barriers to entry: No need for 32 ETH or to maintain validator hardware Enhanced security: Collective validation by operators, with distributed keys More decentralization: Anyone can be an operator or staker Fault tolerance: The network sustains some operator downtime Flexibility: Stakers can choose operator pools based on geography, hardware etc. Censorship resistance: Decentralized operators make collusion unlikely Community-oriented: Open source network governed by a DAO\n\nBy innovating staking infrastructure for the Web3 era, SSV helps move Ethereum towards greater decentralization and accessibility. Now anyone can play a role in shaping consensus and earning rewards.\n\nThe SSV Token\n\nSSV is the native token and has two core functions:\n\nNetwork Governance\n\nSSV holders can create and vote on proposals to steer policies, partnerships, tech upgrades, and more. Just as tokens enable on-chain governance for DeFi protocols, SSV puts the direction of the network in community hands.\n\nValidators pay fees to operators for securing and managing their staked ETH using SSV as interoperable currency. With skin in the game, SSV holders are strongly incentivized to contribute to and monitor the network’s growth.\n\nPayments Between Staking Actors\n\nThe SSV token facilitates exchange of value between validators, who deposit ETH to earn staking rewards, and operators, who maintain infrastructure for validators and take a cut of yields.\n\nValidators fund their accounts with SSV, which operators draw from as a fee in proportion to the staking rewards they generate. Operators also get compensated for actions like submitting slashing proofs. This mechanic aligns incentives – the more rewards an operator enables, the more SSV they earn.\n\nBridging Incentives Through Tokens\n\nThis tokenized model is key to decentralizing staking on Ethereum in practice. By bridging incentives between essential participants, and allowing validators choice based on real-time operator performance, staking becomes open and efficient like never before.\n\nThrough clever tokenomics design, SSV is bolstering accessibility and decentralization of the rapidly evolving Ethereum network.\n\nKey Moments and Achievements\n\n2023 marked a significant chapter in the evolution of Ethereum staking, with the SSV Network pioneering a transformative approach through its permissionless mainnet deployment. Underpinning this revolutionary shift is the innovative Distributed Validator Technology (DVT) introduced by the SSV Network, which promises to enhance the security, decentralization, and robustness of Ethereum’s staking ecosystem.\n\nThe SSV Foundation’s creation of four testnet versions set the stage for the network’s progress. Boasting 92 active operators from five continents and staking 70,000 ETH, the SSV Network exhibited impressive global participation. The launch of the Shifu testnet V2 marked a significant milestone, enabling operators to engage in Ethereum’s Proof-of-Stake consensus using DVT.\n\nETH Denver’s ‘BUIDLWeek’ in February 2023 showcased the SSV Network’s commitment to fostering development and creativity. With a $50 million ecosystem fund and the announcement of the Shifu testnet V2, the SSV Network provided a robust foundation for aspiring developers.\n\nThe SSV Network’s commitment to autonomy reached new heights with the establishment the SSV DAO Verified Operators (VOs). These individuals, selected for their strong work ethic and technical expertise, were vital in overseeing a subset of the network’s validators during the Limited Launch period.\n\nDecentralized Governance and Expansion\n\nWhen the Multi-Sig Committee and Quorum Proposal were first introduced in August of 2023, it was a momentous day for the SSV Network. The purpose of these suggestions, which were included in the second round of DAO projects, was to improve network security, simplify decision-making processes, and support efforts that contribute to the expansion of the network.\n\nThe SSV Network’s governance system, combined with the Karma dashboard and Vote Delegation, significantly reduced the barriers that prevented community members from participating in decision-making processes.\n\nThe SSV Network’s open-source ETH staking architecture, powered by DVT, addresses critical challenges in Ethereum staking. Active-Active Redundancy and Fault Tolerance ensure uninterrupted validator operation, even in the face of node failures. The unique approach of securing ETH without custody, where validator keys are generated, split, and securely stored offline, enhances the safety of staking for users.\n\nDecentralization and Diversity are cornerstones of the SSV Network, as independent node operators globally contribute to the network’s infrastructure. This strengthens the Ethereum blockchain and reduces risks for individual stakes.\n\nFlexibility and Lack of Coordination are integral to SSV Network’s implementation of DVT. Stakeholders can choose validator operators without collaboration, all managed through smart contracts. The ability of distributed validators to swiftly switch nodes adds a layer of flexibility to the network.\n\nHistorical Evolution and Notable Achievements\n\nThe SSV Network’s inception traces back to the team’s involvement in Blox Finance in 2017, evolving into a non-custodial ETH staking provider, Blox Staking. The adoption of the Ethereum Foundation’s DVT technology idea in 2020 led to the creation of the SSV protocol, with the mainnet launch in 2023.\n\nFounder Alon Muroch, a leading Ethereum POS specialist, spearheaded the team’s efforts, securing strategic partnerships with Coinbase, Digital Currency Group, and OKEx. Over three years, the team achieved significant milestones, including the release of the SSV protocol, DAO creation, testingnets, DAO fundraising, and a $50 million green fund.\n\nSSV Network’s Impact on Ethereum Staking\n\nA revolutionary change in Ethereum staking has occurred due to the recent deployment of the permissionless mainnet made available by SSV Network. Within the framework of the staking paradigm, the employment of DVT technology answers issues about centralization. It is in line with the vision of decentralized validators that Vitalik Buterin, one of the co-founders of Ethereum, has.\n\nThrough its incentive program, which rewards users with one million SSV tokens, the SSV Network is committed to constructing a diverse ecosystem and fostering acceptance of the cryptocurrency.\n\nAs a result of three years of concentrated development that ended in a mainnet that does not need permission, the SSV Network has emerged as a critical player dedicated to expanding Ethereum’s staking environment. This is because the mainnet does not require permission.\n\nOne year ago, the Ethereum Decentralized Autonomous Organization (DAO) network presented a groundbreaking Ecosystem Fund funded with fifty million dollars.\n\nSome of the parties participating in this transaction are venture capitalists, angel investors, and staking enterprises, including DCG, OKX, HashKey, NGC, Everstake, HackVC, GSR, and Chorus. Developing stake solutions for the future generation was a collaborative effort between One SevenX and 1kx.\n\nMore Adoption Is Likely\n\nA significant number of companies use the ssv.network, and they do so by using DVT. Core Development Lead Alon Muroch places significant emphasis on expanding the number of individuals who can use Ethereum’s security. It is anticipated by the DVT protocol that there would be a substantial rise due to the establishment of the Eco Fund.\n\nAfter presenting the ssv.network DAO, which allocated $3 million for developer awards, firms including Blockscape, ANKR, Stader, and Moonstake were given over $1.2 million in prizes for using DVT in product development. These companies were honored for their accomplishments.\n\nIn addition, Vitalik Buterin’s concept for Ethereum 2.0 involves introducing a decentralized virtual token (DVT) to improve the system’s level of security. Each validator uses DVT, made possible by ssv.network, which is positioned as Ethereum’s Layer 0. Ethereum is developing toward a global decentralized and censorship-resistant network. This is a step in the right direction.\n\nTo demonstrate its dedication to decentralization, innovation, and the empowerment of communities, the SSV Network will begin on a journey that will be revolutionary in the year 2024. With rising interest in blockchain, SSV is well placed to rise along with the wider market.\n\nA paradigm shift has occurred in the Ethereum staking given by the network due to the use of DVT technology, which has improved security, fault tolerance, and flexibility. As the SSV Network continues to shape the future of distributed Ethereum staking, it is projected to have a substantial impact on the blockchain technology ecosystem.\n\nThe SSV Network is a driving force in the development of Ethereum’s staking environment because of its commitment to a staking landscape that is open, decentralized, and permissionless."
    }
]