[
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNek9xZF91SkJHY01nSVgtS3lkejM4VG9RWkkxSWRBRzFTOE15WEFuQTcyZjI1dF9lZ3owbDV1SF9JbDFIVWJnc2Frdk5zUG9sR1RrYTVoeGxrQkp0bHRUeHdKd1V5MndWNkFweU1ZT0IyV3g1YnNxX0dTOXZoaWhVUnF0V1hleGRoanQtbzRmMWxVY0xVZ1g1Vg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Jan 2024 08:00:00 GMT",
        "title": "Why Bitcoin, Ethereum, and Marathon Digital Jumped Today - The Motley Fool",
        "content": "The SEC could approve the world's first spot Bitcoin ETF later this week.\n\nSeveral major cryptocurrencies jumped on Monday as investors anticipate the first potential approval by the U.S. Securities and Exchange Commission of spot Bitcoin (BTC -0.30%) exchange-traded funds (ETFs) later this week. In particular, the SEC is widely expected to issue a favorable determination for Ark Invest's 21Shares Bitcoin ETF application before Wednesday.\n\nThe price of Bitcoin surged 6.7% by the end of the regular trading day, after briefly exceeding the $47,000 milestone for the first time since April 2022. Ethereum (ETH 0.01%) is also up more than 6%, while Marathon Digital (MARA -1.31%) -- a crypto mining firm whose fortunes tend to ebb and flow with the price of Bitcoin -- rose as much as 10.5% this morning before settling to close up 7.7%.\n\nCrypto investors have marked their calendars for Jan. 10\n\nThe price of Bitcoin alone has nearly tripled over the past year. But its rally more recently gained steam back in October 2023 after the SEC declined to appeal a federal court's August reversal of an order that had prevented crypto-asset manager Grayscale Investments from converting its popular Grayscale Bitcoin Trust into an ETF. When the D.C. Circuit of Appeals subsequently formalized Grayscale's court win the following week, the onus moved back to the SEC to move forward with its approval processes for several other pending spot ETF applications from providers including BlackRock, Fidelity, and Ark Invest.\n\nFast-forward to today's rally -- and as I noted back in October -- the first of those deadlines happens to be this Wednesday, Jan. 10. That's specifically the date by which the SEC must approve or deny Ark Invest's open application for its \"21Shares\" Bitcoin ETF.\n\nThis is a big deal for the crypto market as a whole because ETFs would be a much more accessible medium for investors to put their money to work in cryptocurrency assets, at least compared to setting up a separate crypto account or wallet with a crypto-specific broker. ETF shares can also be bought and sold throughout the trading day through virtually any broker, similar to publicly traded stocks.\n\nExpect several spot Bitcoin ETF approvals at once\n\nFew expect Ark Invest's 21Shares to be the only spot Bitcoin ETF to receive approval this week, however.\n\nThe SEC could technically approve or deny each individual spot Bitcoin ETF application as their respective deadlines arrive in the coming months. But that would also effectively mean the earliest to receive approvals enjoy a so-called \"first-mover\" advantage, with the lion's share of investors' capital flowing into those early spot Bitcoin ETFs right away. That would be a massive windfall for those ETF providers, considering some estimates indicate the approval of Bitcoin ETFs could potentially increase the value of the overall crypto market by more than $1 trillion.\n\nInstead, the SEC will almost certainly approve multiple applications in tandem with the Ark Invest 21Shares deadline this week. This scenario has been repeatedly supported by industry watchers observing several hopeful ETF providers simultaneously filing amended registration statements with the SEC over the past few months. Indeed, just last week crypto news site Cointelegraph reported that Ark 21Shares, VanEck Bitcoin Trust, Grayscale Bitcoin Trust, and Fidelity's spot Bitcoin ETF each filed new 8-A Forms with the SEC to register their shares as securities listed on multiple exchanges, indicating they're in the late stages of approval.\n\nThat said, investors shouldn't ignore the risk (however unlikely at this stage) that the SEC might deny those multiple spot Bitcoin ETF applications this week. The SEC previously rejected Ark's proposal almost exactly one year ago, for example, citing a lack of measures \"to prevent fraudulent and manipulative acts.\" If the regulatory body offers any similar unexpected opposition this time, I would be shocked if assets like Bitcoin, Ethereum, and Marathon Digital didn't experience a sharp pullback as crypto investors took their recent profits off the table."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxOYnI2bzVXT3FJRUFjc2RweVFodl84Y1FkcEsxYm5zeEgxSXlGUy1oekl6b2xNOWUyQ0VZamxjUEFkSDBRdWdHY2JVeEdJcGp6M1JtQ0s2d2FDd25Tb2ZwUVJfR2s0UzczWEhWRTNQOXc0ZUZVWllFaEZtLUZ6ajVIbVFFdkFVUEtZbXo3QmY3WmZDem5KNF9HXzdWZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Founder Vitalik Buterin Shares 4 Financial Tips - The Crypto Basic",
        "content": "Ethereum’s co-founder Vitalik Buterin offers four financial tips to help new and seasoned investors mitigate risks amid massive volatility in the crypto space.\n\nThe Ethereum boss shared the tips after famous blogger Alexander Voigt highlighted how diversification strategy helped Microsoft founder Bill Gate to build his net worth.\n\nHow Microsoft Founder Boosts Portfolio Using Diversification Strategy\n\nVoigt noted that when Gates became friends with prominent American businessman Warren Buffett, he sold most of his Microsoft shares. According to Voigt, the move helped Gates to diversify his portfolio and acquire other stocks.\n\n- Advertisement -\n\nAs a result of the decision, the Microsoft founder built his fortune to $138 billion. Voigt emphasized that Gates would have been worth only $1.33 billion if he did not diversify his portfolio.\n\nEthereum Founder Reacts, Offers 4 Financial Tips\n\nReacting, Buterin characterized Voigt’s financial tip as awful. However, he offered four tips, which he described as “actual financial advice.”\n\nThis is awful advice. Some actual financial advice: * Diversification is good.\n\n* Save. Get to the point where you have enough to cover multiple years of expenses. Financial safety is freedom.\n\n* Be boring with most of your portfolio.\n\n* Don't use >2x leverage. Just don't. https://t.co/CIvDJcD3UG — vitalik.eth (@VitalikButerin) January 7, 2024\n\nThe Ethereum founder first recognized the importance of diversification. Diversifying one’s portfolio cannot be overemphasized, as it helps mitigate risks. Spreading your investment across various assets would ensure that the negative performance of one asset does not entirely affect your portfolio.\n\nSecondly, Buterin pointed out the importance of saving. He recommended that people should accumulate sufficient funds to the point where they can cover multiple years of expenses. It bears mentioning that there is no guarantee in investing, given the recent economic downturn that has wreaked havoc on most financial markets. Hence, saving more could help shield one from the problems associated with investing.\n\n- Advertisement -\n\nFor the third point, Buterin encouraged investors to be boring with most of their portfolios. The concept of being boring with one’s portfolio suggests that people should opt for low-cost and low-risk assets. Here, Buterin recommends that people be prudent with investing instead of committing their funds to high-risk assets.\n\nLastly, the Ethereum founder warned against using high leverage when investing in the futures markets. Specifically, he cautioned against using over 2X leverage. This advice is necessary, especially in crypto trading, where volatility is rife. Recall that following a 7% dip in Bitcoin price last week, over $655 million worth of long positions were liquidated. The majority of long traders who got liquidated were mainly those who used high leverages.\n\nButerin’s financial tips are suitable for both new and seasoned crypto investors. They serve as a reminder, urging people to be prudent as they seek to bolster their portfolio."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxNb1huODdlbXZCSU5JVk1ITGpwTmdmS0szZm9tZThMOUtuLWFhbjVKRWE5T0lkeENDbHlZQlBQNGU3Si11MUNJdkhOUFB5NEtxbi1LdjhWbnFkRmtzWURaSV85cVNMcWlaaE84dFpCU29NamsybEZ5WGZYUTdvejNFNUYzRXJMbEZSS1FkV3ktNThnN3hKMmRSb1Q2M3cwRXB5VVctSktzTmtzdTctTUJqZNIBtgFBVV95cUxOVlMzRmliazJONHZvTm5DNUV3cjB2OUJJVGFMTXY3eUxydVBnNTY4akpzSDZ1SXcwbGZTZ0NGMmdUei1zLWNwcTJjcGgwYzVIb3VfelhNWTJVZkJaTkZKRldoTng2WmNYMjFtQ0ttS3NIVVF4M0JBbFduNzVQM0NtOUdUTHB0OGhVdWk5bU1yUTdsbFR0b0dEeldaMkp2Nkx2VEtfdEd2bUluZ0hTSnhqcGtCQkVrUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Price Eruption Past $3k Imminent? Investors Unpack Vitalik ‘s Bull Run Tips - CoinGape",
        "content": "Ethereum, a leading cryptocurrency, has been on an upward trajectory for the past few months. The cryptocurrency value has soared from under $2,000 to $2,400, indicating a positive trend. However, the current market displays mixed sentiments about its future direction. The digital currency has been fluctuating within a defined range, showing signs of both strength and uncertainty.\n\nAs of the time of writing, Ethereum price value has impressively hit $2,270, marking a 0.78% increase in just 24 hours. This rise suggests a positive market mood. The trading volume, according to data by CoinMarketCap, has also seen an 84% jump in the same period, reaching $509 million. With a market capitalization of $10 billion, Ethereum ranks second among cryptocurrencies.\n\nadvertisement\n\nDespite these gains, Ethereum faces a consolidation phase, especially under the $2,400 mark. The leading smart contracts token has been oscillating between $2,100 and $2,400 in the past week, with bears and bulls struggling. In the past year, Ether experienced a significant increase of over 79%, demonstrating resilience and optimism as bullish sentiment prevails despite occasional minor dips.\n\nVitalik Buterin’s Investment Tips for Ethereum Enthusiasts\n\nVitalik Buterin, the co-founder of Ethereum, recently shared some investment wisdom. This came after a noted blogger, Alexander Voigt, discussed how diversification aided Bill Gates in wealth accumulation. Buterin, however, termed Voigt’s advice as subpar and offered his own financial guidelines.\n\nThis is awful advice. Some actual financial advice: * Diversification is good.\n\n* Save. Get to the point where you have enough to cover multiple years of expenses. Financial safety is freedom.\n\n* Be boring with most of your portfolio.\n\n* Don't use >2x leverage. Just don't. https://t.co/CIvDJcD3UG — vitalik.eth (@VitalikButerin) January 7, 2024\n\nButerin’s tips are simple yet profound. He emphasizes the importance of diversification, suggesting that a varied portfolio can reduce risk. He advises investors to save enough to cover multiple years of expenses, stressing the value of financial safety and freedom. Buterin also recommends keeping the bulk of one’s portfolio in stable investments and strongly advises against using more than 2x leverage.\n\nThese guidelines are particularly relevant for both new and seasoned investors in the volatile cryptocurrency market. Adhering to such prudent strategies could potentially pave the way for Ethereum’s price to surge past the $3,000 mark. If the bullish trend persists, this milestone could soon be within reach.\n\nEthereum Technical Indicators Supporting a Bullish Outlook\n\nTechnical analysis of Ethereum’s price movement adds another layer of optimism. The Relative Strength Index (RSI) is currently around the 50 mark, suggesting a balance in market momentum. On a 4-hour chart, Ethereum’s price has increased since breaking above the 200-day moving average and exiting a major descending channel. This bullish trend is visually evident through the formation of three four-hour green candlesticks.\n\nMoreover, the Moving Average Convergence Divergence (MACD) line has overtaken the signal line, indicating a positive market outlook. The rising histogram supports this bullish sentiment. The 20 Simple Moving Average (SMA) is on an upward curve, and the 50-day MA crossing over the 200-day MA reaffirms the bullish market sentiment. The Chaikin money flow indicator is also in the positive region at 0.04, indicating a bullish outlook.\n\nRelated Articles\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxNdjRxYS1RUkJjdGpqbHRveUhZeDlyandqdW53aWtOS2tSNnRlN0pybXFwWGVwYzdhZGQxUjJaYlB3ak9qVFZsajlPOG9GalhpODFtbTVLZjNFZFVhQllZLUg0TmdrWkk3MkNKMU9GQ256QVoyZHFXRklXWjc3bXB5bXA3dm4tby0td3JRT1hZWnMwWnBxMC1xUVhxTQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Jan 2024 08:00:00 GMT",
        "title": "Solana may outperform Ethereum in 2024; this meme coin could flip Shiba Inu - crypto.news",
        "content": "Disclosure: This article does not represent investment advice. The content and materials featured on this page are for educational purposes only.\n\nCrypto is bullish, and some experts speculate that Solana (SOL) may surpass Ethereum (ETH). Meanwhile, Galaxy Fox (GFOX), a meme coin on Ethereum, continues to gain momentum.\n\nGalaxy Fox is proceeding to the sixth phase of its presale despite the Bitcoin (BTC) contraction, which also affected Shiba Inu (SHIB) prices.\n\nGFOX dominance\n\nGalaxy Fox combines GameFi with memecoin.\n\nIt aims to outperform other play-to-earn (P2E) tokens like ApeCoin (APE), Gala (GALA), The SandBox (SAND), and ICP.\n\nYou might also like: Polkadot holders shifting attention to GameFi Coins, including Galaxy Fox\n\nIn the ongoing presale, Galaxy Fox has sold over 2.1 billion GFOX.\n\nAnalysts expect GFOX to edge even higher in the months ahead due to its unique hybrid nature.\n\nFeatures\n\nGalaxy Fox supports staking.\n\nGFOX holders can participate in NFT markets and play games.\n\nThrough staking, GFOX holders can receive a share of rewards from the Galaxy Fox Stargate.\n\nDespite falling BTC prices, GFOX remains stable in the ongoing presale.\n\nWhy Galaxy Fox is unique\n\nGalaxy Fox’s web3 runner game players can use GFOX to enhance their gaming attributes and gain an edge over competitors.\n\nHolding GFOX also grants privileges to acquire Galaxy Fox NFTs.\n\nYou might also like: Polygon holders focusing on new memecoin project, Galaxy Fox\n\nIn addition to the gaming experience, players can convert GFOX into real money and purchase items in Galaxy Fox NFTs’ market and other community projects.\n\nSOL takes on ETH\n\nSolana has achieved a lot with meme coins and defi.\n\nThe project has partnered with traditional foreign banks and corporations like Shopify and Visa to improve their payment processes.\n\nYou might also like: Solana flips Ethereum in 7-day stablecoin volume\n\nSolana offers more cost-effective options than Ethereum.\n\nMoreover, SOL prices rose 530% from October to December. At one point, it was the fourth-largest crypto by market cap.\n\nTake away\n\nCrypto analysts are bullish on Galaxy Fox. It aims to be a play-to-earn sector leader, outperforming other meme coins. Ahead of GFOX listing, investors can explore the project’s potential."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxQZVpqRGhOLWtLQUZfeWI5azF5TlJFd3MxNW8zcU01cVZGX1d0aDd1WW9xd25NLVJfSEIwRWJQcUk4ckJLWW5GTTNyODdyN2h2ZFJSbDU0NGRua0JsOS1BaXRfLS1fbEFFRTROLW01ZjJFZEJ1dDZjWVRLeE5vQmtrU1ZMOU10U09jLTJrN0hTYW5sU25PUkdPMDcwRGtKMUNHaEs1Q19RaTVxRzNnT1EzMUlYWdIBuwFBVV95cUxNakZxbDZGQjlkMjlveUw5NG9oeFI0LWZoVHp5RE1sRlNZdFMzeW8tSlhvYk5oZXdHT0JHaGRvc3NKNFg5SzNMbU51ZkhDSVZlME14aGlVYWlROFBJR0ttZUJIZ1VnUnJNNW05YS11cVlja2dXRzNDSzRLdU15QWFJdkkwWGZwbWEwWUFudnNoZ3lfUElqcS1nMDlWbnI4U2o2dk1fYkhjcmExZzlWbkZtdzB2MW5LVmplaVpj?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Jan 2024 08:00:00 GMT",
        "title": "Surfing the New Wave: Why Artists Should Embrace Solana and Other Blockchains - NFT Culture",
        "content": "Riding the Shift from Ethereum to Solana in the NFT World\n\nIn the dynamic realm of NFTs, artists are often confronted with the challenge of finding the right platform to showcase their work. While Ethereum (ETH) has long been a dominant force in the NFT space, recent trends indicate a shift in energy and excitement towards alternative blockchains like Solana. This shift underscores a crucial message for artists: adaptability is key, and venturing into new territories can be a game-changer.\n\nThe Rise of Solana: A Beacon for NFT Artists\n\nThe past few months have seen a substantial increase in collector activity on platforms like @exchgART, particularly within the Solana ecosystem. This uptick is more than just a fleeting trend; it represents a significant movement of collectors exploring alternatives to Ethereum. Solana’s appeal lies in its cost-effectiveness and faster transaction times, making it an attractive option for both artists and collectors. As the NFT landscape evolves, Solana is quickly becoming a hub of innovation and engagement.\n\nEthereum’s Challenges: A Call for Diversification\n\nDespite Ethereum’s pioneering role in the NFT space, it faces challenges that can be daunting for emerging artists. High gas fees and a highly competitive environment, coupled with a currently lower collector base, make it difficult for new entrants to gain traction. This situation necessitates a strategic pivot, encouraging artists to explore other blockchain ecosystems where opportunities are burgeoning.\n\nEmbracing Change: The Importance of Exploring New Frontiers\n\nThe key takeaway for artists is clear: to stay relevant and successful in the NFT market, one must go where the people – and in this case, the collectors – are heading. Solana, with its growing collector base and artist-friendly environment, presents a compelling alternative. But the exploration shouldn’t stop there. The NFT world is vast, with numerous other blockchains offering unique opportunities. Artists must remain agile, continually seeking new ideas, wallets, chains, and communities to engage with.\n\nTLDR: As the NFT landscape shifts, with excitement and energy moving from Ethereum to Solana, artists must embrace this change to thrive. Exploring Solana and other blockchains is not just an option but a necessity for artists seeking growth and engagement in the evolving NFT market."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiXEFVX3lxTFBWQTZZYXZESGR1aFV1Z1Q3OG0xVElIVFVxQUFNYnYzU1pKd2tLbVU1MXBEbFIzcVRYbS11MnZOeUlkbWlRZXhQTElod01iUHBGS1pQai1ZNkp4emp0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Jan 2024 08:00:00 GMT",
        "title": "State of 1inch Q4 2023 - Messari",
        "content": "Key Insights\n\n1inch dramatically increased volumes and market share in Q4’23, executing over $30 billion in volume and claiming 64% of the Ethereum DEX aggregator market share.\n\nexecuting over $30 billion in volume and claiming 64% of the Ethereum DEX aggregator market share. Volume from external sources nearly doubled the fourth quarter’s from last year , likely showing the adoption of 1inch as a backend solution as well as the growth of aggregators .\n\n, likely showing the adoption of 1inch as a backend solution as well as the growth of aggregators New products are driving transaction growth. Transactions on the Limit Order Protocol (LOP) and 1inch Fusion increased in the quarter, while transactions in the Aggregation Protocol fell.\n\nFusion transactions rose by 66% in the fourth quarter , a strong rebound after falling 29% in the previous quarter.\n\n, a strong rebound after falling 29% in the previous quarter. The amount of 1INCH staked increased, as the DAO worked to configure the resolver competition to improve token accrual through a fair and competitive market.\n\n\n\n\n\nPrimer\n\nThe 1inch Network (1INCH) is an all-in-one decentralized finance (DeFi) service provider operating on Ethereum, Arbitrum, Optimism, Polygon, zkSync Era, Avalanche, BNB Chain, Gnosis, Fantom, Klaytn, and Aurora. Launched in 2019, 1inch Aggregation Protocol (AP) allows users to route trades across various markets and realize the best available rate compared to any individual decentralized exchange (DEX). In late 2020, the 1inch Liquidity Protocol introduced a native automated market maker (AMM) to the network, which enabled users to provide liquidity and earn passive liquidity mining rewards.\n\nThe network’s third product, the 1inch Limit Order Protocol (LOP), was introduced in June 2021 to support conditional limit and stop-loss orders with no fees. In late December 2022, the 1inch Swap Engine enabled Fusion mode, which is partially based on the existing tech, including the 1inch Limit Order Protocol and the 1inch Aggregation Protocol. This new feature empowers DeFi users to place orders with a specified price and time range without paying network fees. All three protocols, and Fusion mode, are governed by the 1inch DAO using the network’s native 1INCH token.\n\nNote: This report includes data from Ethereum, BNB Chain, Polygon, Optimism, Arbitrum, Avalanche, Gnosis Chain, Fantom, and Base. Data from zkSync, Klaytn, and Aurora are currently not included. We are working to improve access to this data.\n\nWebsite / Twitter / Telegram\n\nKey Metrics\n\nPerformance Analysis\n\nProtocol Usage\n\nAs the leading DEX aggregator, 1inch has benefited from increased trading activity in the space. Beneath the surface, the newer protocols and products from 1inch led the volume growth. While volumes on the Aggregation Protocol increased 59% from the previous quarter, volume on the limit order protocol (LOP) increased over 90% in Q4. 1inch LOP executed over $6.4 billion of trades for the first time since Q1’23. Volume through 1inch Fusion also increased by 88% in the quarter, surpassing $5 billion and showing a growing user preference for the new execution venues.\n\nAggregation Protocol volume growth was broad, with four 1inch EVM deployments doubling their volume or more from Q3 to Q4. Aggregation Protocol volumes on mainnet increased by 45% to roughly $173 million per day. Not including Gnosis and Base, which launched at the end of Q3, Avalanche and Arbitrum volume increased the most, by 176% and 129%, respectively. Arbitrum ended the quarter accounting for 16% of 1inch Aggregation Protocol volume, responsible for $3.8 billion in Q4. In its first full quarter, 1inch’s Base deployment grew volumes to over $220 million in Q4. Fantom was the only chain that saw a fall in volume in the quarter.\n\n\n\n\n\nThe average size of a transaction in USD terms grew substantially in Q4, especially for the Aggregation Protocol, as volumes rose while transactions fell nearly 3% QoQ. For the Aggregation Protocol, the fall was largely driven by Polygon, which made up 32% of 1inch transactions in Q3 but only 22% in Q4. While volumes on Fantom fell in the quarter, the number of transactions increased by 31%. The increase surpassed every other 1inch deployment besides BNB Chain and Base, which was only live for part of the third quarter. BNB Chain accounted for the most transactions in the quarter, representing 28% of 1inch transactions or over 22,000 per day. Ethereum transactions increased by 15.5% from 14,000 per day to over 16,000 per day in Q4.\n\nThe Limit Order Protocol saw transactions fall on Gnosis, Optimism, and Fantom, even though transactions rose overall by 44% in the quarter. Ethereum, Arbitrum, and Polygon activity increased dramatically, with daily transactions rising 95%, 82%, and 81%, respectively. Those three EVM deployments made up 70% of 1inch LOP transactions in the fourth quarter, or nearly 8,000 per day.\n\nFusion transactions rose by 68% in the fourth quarter, a strong rebound after falling 29% in the previous quarter. Average trade size rose on all three protocols, increasing by 60% in the Aggregation Protocol, by 35% in the LOP, and by 23% on 1inch Fusion.\n\n\n\n\n\nFusion volumes grew 88% in the fourth quarter, and 1inch Labs resolver increased its share to 44% of volume. A new competitor, Rizzolver, began competing at the end of September and grew its market share to 26% in Q4, executing over $1.2 billion of Fusion orders. Rizzolver achieved its growth by offering the most 1INCH rewards to delegates. The top 3 resolvers executed 88% of volume in Q3, but only made up 83% of volume in Q4. However, there were fewer total successfully participating resolvers, with only 7 completing transactions in Q4 versus 12 in Q3.\n\nAs discussed in depth in the Qualitative Analysis section, the DAO is focused on increasing competition for resolvers. This quarter, DAO members voted to set a cap for gas consumption for resolvers, which should enable resolvers to earn more and thus be able to pay more in rewards to stakers.\n\n\n\n\n\nMarket Share Analysis\n\nIn the fourth quarter, the share of 1inch trades executed on Uniswap V3 and V2 increased by 8 and 3 percentage points to 40% of trades and 8% of trade volume, respectively. Volume from 1inch on the two Uniswap versions increased from $5.6 billion in Q3 to $10 billion in Q4. The share gains largely came from Curve and Dodo, the second and now sixth most common execution venues. PancakeSwap received over $1 billion of trade volume from 1inch for the second consecutive quarter, or 7% of 1inch volume in Q4.\n\n1inch’s fourth-quarter growth in volume was significantly higher than peers, helping it increase its market share from 59% of trades in Q3’23 to 63% in Q4’23. The only large competitor to increase share in Q4 was CoW Swap, which commanded 11% of aggregator volume on Ethereum in the quarter. ParaSwap and 0x respectively commanded 11% and 10% of aggregator volume in Q4.\n\n\n\n\n\nTreasury and Staking\n\nThe 1inch DAO continued to invest its treasury and diversify its stablecoin holding, swapping 1 million USDC into DAI and depositing to earn interest as sDAI. This is the first allocation following the 1 million USDC deposited in Aave to earn interest in Q2. On the expense side, the DAO spent just over $1 million split between three different transactions. On December 30, the DAO sent $890,000 USDC to fund support services for 1inch Network users (discussed in depth in the Qualitative Analysis section).\n\n\n\n\n\nThe amount of 1INCH staked increased by 7% in the fourth quarter. Staking 1INCH gives Unicorn Power (UP), which can be used to vote in governance and delegate to resolvers. Staking and delegating to resolvers create an important value accrual pathway for the token, as resolvers give 1INCH rewards to attract delegates so the resolver can compete in completing Fusion transactions. The top resolvers are currently offering over 45,000 1INCH to delegates.\n\nQualitative Analysis\n\nImproving Resolver Competition\n\nOn October 7, 1inch DAO voted to create new rules governing resolvers interacting with 1inch Fusion. In the past, only five resolvers competed to fill orders, which was insensitive to gas costs to win the transaction. As a result, the resolver business turned into a gas war, significantly increasing expenses and thus hurting resolvers’ profitability. If resolvers were more profitable, they would be able to better compensate 1INCH stakers.\n\nThe core of the proposal revolves around the introduction of a smart contract-enforced gas fee limit, aimed at regulating the priority gas fees in the 1inch Fusion mode. This cap is designed to fluctuate based on the block's baseFee:\n\nBaseFee < 10.6 gwei: PriorityFee capped at 70% of the baseFee.\n\nBaseFee 10.6 - 104.1 gwei: PriorityFee capped at 50% of the baseFee.\n\nBaseFee > 104.1 gwei: PriorityFee capped at 65% of the baseFee.\n\nAttempts to circumvent this limit (including direct payments to block builders) will be considered violations.\n\nThe proposal also introduces a stringent penalty system for violators. Using a tiered approach, it ranges from an official warning to a substantial 365-day block from filling orders for repeat offenders.\n\nThe proposal intends to lower the Unicorn Power (UP) requirement for Resolvers from 10% to 5%, in order to democratize access to the Fusion Mode ecosystem. The more lenient entry threshold has already led to more diversity and robustness within the system. From a market perspective, the changes could mean a more competitive environment with more options for stakers and hopefully increased resiliency for traders.\n\nThe rationale behind these proposed changes is grounded in a pragmatic approach to tackling the high operational expenses currently faced by resolvers, primarily due to the inflated gas fees during auctions. Given that this situation often escalated into “resolver gas wars,” it has been a pain point for participants in the 1inch Network, affecting both profitability and trade rates. The proposed solution seems to be a well-considered strategy to address these challenges head-on.\n\nHowever, there are concerns that need to be addressed. For one, this new system might inadvertently penalize resolvers who are more gas-efficient, especially since builders tend to prioritize transactions based on total ETH paid on gas. While the proposal argues that this shouldn't be an issue as builders are incentivized to maximize fee collection, it still requires careful monitoring post-implementation.\n\nIn conclusion, the proposal comprehensively addresses current challenges faced by resolvers in the 1inch network. Its success hinges on competition between resolvers and continuous monitoring to ensure its changes do not lead to unintended consequences. Higher earning resolvers should attract new resolvers, which will need to attract UP by giving rewards to 1INCH stakers.\n\n\n\n\n\nSupport for an Improved User Experience\n\nThe 1inch DAO has approved a proposal to fund comprehensive support services aimed at enhancing the 1inch Network ecosystem's growth and user experience. These support services encompass various aspects, including issue management and reporting across multiple communication channels, documentation management, monitoring reviews, special investigation for complex refund cases, and support for the token listing and delisting process. The 12-month subscription fee for these services amounts to $890,000. The primary motivation behind this proposal is to ensure that 1inch Network users receive efficient and responsive technical support, which is crucial for brand credibility, user retention, and network expansion.\n\nAs crypto matures and the initial products grow beyond just finding product-market fit, winning the consumer becomes more important. The support services will enhance the overall experience for 1inch Network users, potentially leading to higher user satisfaction and retention. Effective customer support can establish brand credibility and reputation, contributing to the long-term success and growth of the 1inch Network ecosystem. The proposal covers various aspects of support, including bug-bounty program management and participation in conferences, which can contribute to the continuous improvement of the network.\n\nThe proposal is not without risks, namely an annual subscription fee of $890,000 paid upfront. In addition, the DAO relies on the service provider to meet the specified KPIs, and there is a risk of service quality not meeting expectations, which could harm the network's reputation.\n\nIn sum, the approved proposal seeks to provide valuable support services to the 1inch Network ecosystem, aiming to enhance user satisfaction and brand reputation. 1inch DAO and Network continue to focus on winning the consumer as part of its growth strategy.\n\n\n\n\n\nClosing Summary\n\nThe return of the bull market in Q4’23 helped the category leader grow, as volumes soared to over $35 billion in the quarter. The work in the bear is helping, as 1inch’s limit order protocol and Fusion product drove transaction usage, while L2 deployments led volume growth. Resolver competition and market design remain in flux, as the DAO tries a new approach by setting a gas limit. The amount of 1INCH staked in the quarter increased, and $1 million from the treasury was newly invested. 1inch grew its dominant market share as the leading DEX aggregator on Ethereum in the quarter.\n\nLet us know what you loved about the report, what may be missing, or share any other feedback by filling out this short form. All responses are subject to our Privacy Policy and Terms of Service.\n\nThis report was commissioned by 1inch DAO. All content was produced independently by the author(s) and does not necessarily reflect the opinions of Messari, Inc. or the organization that requested the report. The commissioning organization does not influence editorial decision or content. Author(s) may hold cryptocurrencies named in this report. This report is meant for informational purposes only. It is not meant to serve as investment advice. You should conduct your own research, and consult an independent financial, tax, or legal advisor before making any investment decisions. Past performance of any asset is not indicative of future results. Please see our Terms of Service for more information.\n\n\n\nNo part of this report may be (a) copied, photocopied, duplicated in any form by any means or (b) redistributed without the prior written consent of Messari®."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxPS00zN3NsRGdKQV9zbFVvVXlVR3BEZHZoaktqLTJWMDJSdzJKbHhBWXYzNjZOaW4taC13Z0FkU2FLbkVtYlM1V3FzM25yWC04bFZ0UDF3Nkdrajc4dkFEU1l2LW1wRHloaXphMlc1clB2UThEUWZFd0p6cl92M0VFcl83Yw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Jan 2024 08:00:00 GMT",
        "title": "Top 5 Blockchains for Low-Cost Gaming Development - PlayToEarn",
        "content": "The blockchain gaming sector has seen impressive growth, driven by platforms offering unique benefits such as high transaction speeds, scalability, robust ecosystems, and low gas fees. Let's take a look at 5 leading blockchains that have emerged as frontrunners due to their low transaction costs: Solana, Polygon, Avalanche, Ethereum, and Immutable X.\n\nSolana's High-Speed, Low-Cost Gaming Landscape\n\nSolana is a standout blockchain, mainly due to its high transaction throughput and low cost. It processes transactions at an impressive speed, handling tens of thousands per second. This is attributed to its Proof of History (PoH) consensus mechanism, which significantly reduces processing time.\n\nWith that, Solana's network allows for smooth and delay-free gameplay. The platform is rapidly expanding and hosts various top-tier gaming studios. It's quickly becoming a hub for gaming development, underpinned by its vast developer community and a range of AAA games.\n\nPolygon: Ethereum's Scalable Companion\n\nInitially known as Matic Network, Polygon operates as Ethereum's layer-2 (L2) scaling solution. It's renowned for offering enhanced transaction speeds and lower costs than Ethereum's mainnet. Polygon's architecture, which by theory, supports up to 75,000 transactions per second (TPS), is a testament to its scalability and performance.\n\nPolygon features a multi-layered design that separates validation and execution processes. Its EVM compatibility also allows developers to harness Ethereum's infrastructure while benefiting from Polygon's superior performance. This has made it a popular choice among game devs in the Web3 space.\n\nAvalanche: A Rising Force in Web3 Gaming\n\nAvalanche sets itself apart with its high-performance capabilities, capable of processing thousands of transactions per second. Its unique consensus mechanism contributes to rapid transaction finality and minimal fees.\n\nWhile Avalanche's gaming ecosystem is still in the early stages, it's gaining momentum among developers for its efficient transaction handling and smart contract support. It represents a growing force in the gaming sector, offering a viable platform for game devs looking for speed and cost-effectiveness.\n\nImmutable X: Zero Gas Fees for Blockchain Gaming\n\nImmutable X (IMX) is noteworthy for offering a solution that eliminates gas fees with fast transaction confirmations. As an L2 solution built on Ethereum, it provides the security and decentralization of Ethereum without its drawbacks.\n\nIMX is appealing for Ethereum-based games and NFT platforms, as it addresses issues like high gas fees and slow transactions. The platform has partnered with prominent games and platforms like Polygon to introduce technologies like zkEVM, allowing developers to access Ethereum's ecosystem more efficiently. This has positioned IMX as a go-to platform for game devs prioritizing cost efficiency and high throughput​​.\n\nEthereum: A Major Leader Facing Modern Challenges\n\nDespite struggling with transaction speed and high gas fees, Ethereum holds a major position in crypto gaming. It's the largest and most established platform for dApps, including games. Popular blockchain games like Axie Infinity and The Sandbox debuted on Ethereum. However, these limitations are set to be addressed with the Ethereum 2.0 upgrade, which aims to enhance scalability and reduce costs.\n\nFinal Thoughts\n\nIn short, selecting the most suitable blockchain for game development depends on factors such as transaction speed, scalability, ecosystem development, and, notably, gas fees. Solana, Polygon, Avalanche, Ethereum, and Immutable X each offer distinct advantages that cater to various requirements. Their respective features – from Solana's high TPS to Immutable X's zero gas fees – illustrate the diversity and potential of blockchain tech in reshaping the gaming sector. Developers must weigh these attributes against their project's specific needs to choose the most appropriate blockchain platform."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTFBRMGpjWjVxcVhVYmNTeTktemFJaVZRMmZ1dzI5NFNMWG9faEJzZTM4YU1nUnptMTBWbGV6YmRSbmMxMjYtM0JfMFp6X25KVmFiXzNpd0R0VXdYM0lsWS1rRHVqemZ6RXluVHF1MkNGd2ZZaVN2?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Jan 2024 08:00:00 GMT",
        "title": "How to Buy Ethereum in Australia in 2024 - Crypto News Australia",
        "content": "Too long, didn’t read? Buying Ethereum in Australia is very simple and can be done with just a few clicks. There are several exchanges to choose from, each with their pros and cons. Our pick as the best exchange to purchase ETH is Swyftx due to their easy-to-use app, low trading fees, helpful customer support and wide range of additional features. Simply sign up, verify your identification, deposit AUD and then purchase your desired amount of ETH.\n\nWhat is Ethereum?\n\nEthereum is a decentralised ledger that runs on blockchain technology. It was designed to host decentralised applications (dApps) and execute smart contracts, the first of its kind. Additionally, projects can easily create tokens that reside on the Ethereum blockchain. These types of tokens are known as ERC-20.\n\nUnlike Bitcoin, the Ethereum network runs on a Proof of Stake consensus mechanism, which requires network participants to stake ETH instead of mining crypto.\n\nRelated: Ethereum staking guide\n\nThe Ethereum platform is powered by Ether (ETH), the native cryptocurrency of the Ethereum blockchain and the second largest cryptocurrency in the world based on market cap.\n\nAdvertisement\n\nHow to buy Ethereum safely in Australia\n\nThe safest way you can buy Ethereum (ETH) in Australia is through a reputable crypto trading platform or exchange. Some exchanges offer more crypto assets than others, however, most crypto exchanges will allow trading for popular coins like Bitcoin and Ethereum. Australian Transaction Reports and Analysis Centre (AUSTRAC) monitors and regulates digital currency exchanges so that it complies with national standards, it is highly recommended to go through an AUSTRAC-registered exchange.\n\nBelow are four key steps to purchasing Ethereum:\n\nCreate an account with a registered exchange Verify your identification Deposit Australian Dollars Buy Ethereum\n\nFor this example, we’ll be using the Swyftx cryptocurrency exchange to demonstrate how you can buy and store Ethereum in Australia. Swyftx is an AUSTRAC-registered exchange with offices located in Brisbane and Sydney. Their beginner-centric Ethereum exchange is very easy to sign up for, and they have Australian-based customer support to help if you need assistance along the way. Other Australian exchanges like Coinspot, Digitial Surge and Coinjar have similar sign-up processes.\n\nStep One: Create a Swyftx Account\n\nCreating a Swyftx account couldn’t be simpler. You will have to supply some basic information – your phone number, full name, and email address. When this is complete you will be asked to create a password. It is important to create a password that is unique and secure. Once your password is created, make sure to write it down and keep it in a secure place or use a password manager like LastPass.\n\nClick here to create your account.\n\nStep Two: Complete account verification\n\nAll AUSTRAC registered exchanges require users to complete identification checks by uploading a photo of their identification document. Once you are logged in, you will need to peruse the left-hand menu and select ‘profile’ > ‘verification’. Your account’s verification is necessary for depositing fiat or purchasing crypto.\n\nA form of government-issued identification, such as a passport or driver’s license is required for verifying your account.\n\nTo further enhance the security of your Swyftx account, it is strongly recommended that you enable two-factor authentication (2FA). This adds an extra layer of security in case your login details fall into the wrong hands. Google and Microsoft Authenticators are supported by most crypto exchanges.\n\nStep Three: Deposit Funds\n\nOnce your account is verified, you can then deposit funds which can then be used to buy and sell Ethereum.\n\nMost exchanges will allow you to deposit through bank account transfers, Swyftx included. You can also deposit funds via your chosen payment method: POLi, PayID or credit or debit card. Swyftx does not charge any fees when you deposit via bank transfer.\n\nIf you already have cryptocurrency in an external crypto wallet, you can deposit these assets directly into Swyftx using your new wallet address. These assets can then be swapped for ETH.\n\nStep Four: Purchase Ethereum\n\nOnce you have a sum of Australian dollars (AUD) in your wallet, you are able to buy Ethereum instantly. To get started, click Trade and search for Ethereum (ETH).\n\nOnce you’re on the Ethereum page, select Buy. A window will then pop up allowing you to input the details of your order. For instance, you can select how much ETH you wish to buy or input the AUD equivalent. Once you have reviewed your order details, simply click Place Order.\n\nWhere is the best place to buy Ethereum?\n\nChoosing the best place to purchase ETH can be overwhelming with so many options available. Selecting an Australian-based exchange is recommended as they are almost guaranteed to accept Australian dollars (AUD). This makes it easy to deposit funds to purchase crypto quickly.\n\nIt is also important to consider other aspects like the exchange’s security reputation, user-friendliness, customer support, regulation, and trading fees.\n\nRead our comparison of the best crypto exchanges in Australia for more information.\n\nIs it legal to trade Ethereum in Australia?\n\nYes, buying and selling Ethereum is legal in Australia as long as you’re doing it on an AUSTRAC-registered exchange. However, it is important to note there are tax laws that apply to crypto. As it stands, the Australian Tax Office (ATO) considers digital currencies to be assets, meaning Capital Gains Tax (CGT) applies to profit or losses on your Ethereum investment.\n\nFor a comprehensive breakdown of crypto tax, read this Australian crypto tax guide.\n\nIs it safe to buy Ethereum?\n\nNo investment is ever guaranteed to be safe. Whilst Ethereum is one of the more popular cryptocurrencies on the market, it is still at the mercy of market volatility. Any crypto purchase you intend to make should be thoroughly researched, so that you properly weigh the risks, and understand how your investment will operate.\n\nThere is a lot to learn about your potential ETH investment; however, for a beginner, it is necessary that you understand price volatility, exchange vulnerabilities, and regulatory uncertainty. Doing so allows you to better gauge whether your investment could be considered a ‘safe’ one.\n\nRegulatory uncertainty: You must be aware that the regulatory ecosystem for cryptocurrency is young and prone to change. Keeping an eye on both national and international shifts may be useful when deciding when, and how, to invest.\n\nYou must be aware that the regulatory ecosystem for cryptocurrency is young and prone to change. Keeping an eye on both national and international shifts may be useful when deciding when, and how, to invest. Price volatility: Crypto is a very new market compared to traditional stocks and equities, meaning it has greater exposure to new regulations and reaches new audiences, which can cause the price to fluctuate heavily.\n\nCrypto is a very new market compared to traditional stocks and equities, meaning it has greater exposure to new regulations and reaches new audiences, which can cause the price to fluctuate heavily. Exchange vulnerabilities: Scams, theft, hacks, and poor fiscal management, are common exchange vulnerabilities to look out for. Ensure you are engaging with a secure and reputable crypto exchange to protect your Ethereum investment.\n\nIf you’re not yet confident to buy Ethereum, some exchanges offer free crypto demo accounts where you can trade crypto with artificial money. This is a great way to learn about the market and practice your trading strategies.\n\nWhy is Ethereum so popular?\n\nVitalik Buterin created Ethereum in 2013, and it then went on to become the first network to facilitate smart contracts. The Ethereum blockchain gained a lot of its popularity by hosting a number of decentralised applications, allowing users to interact with DeFi, play-to-earn crypto games, the Metaverse, and NFTs. Possessing more than $40 billion in Total Value Locked (TVL), the blockchain quickly became the world’s largest smart contract platform.\n\nIf you’ve ever engaged with, or heard of, MetaMask, OpenSea, The Sandbox, Axie infinity or UniSwap, you have Ethereum to thank.\n\nSolana has emerged as a key competitor of Ethereum. You can view our Ethereum vs Solana comparison.\n\nFrequently asked questions"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxOU1BvUGdCTG9BMTRRVEdxU0VvcWZ3VGUzQjlQRzhVQmxpNU9RT2Q0LVJOa2RLRVR4Qm9JVG15MEY0OVVtU0tpQk1jTkR2Rk1rMGdaM1FVekhqbk5zUjlzYUpZLUJMQXB6VXY3WWNsaUVwYjFTSWM5OG9KRjY5Sk1uX0VQZnBFWV9MZmNsZ3ZUQkZQamF6X3JYelA2ampmX3FaTmhjNnp3VkdLYnPSAbABQVVfeXFMUHVtOVB3REFxQlFTcmN5aVlEb1Y0OW5QVlI1a0ZwSl9lYm56MVR2VDhkdjBPdW1Bblp3YU1Bcmszd2xkWnJ4Wm9xNHRNaUFQTGk0ejExdWFQQ215a2lVZWRJVW5JeU5RbUIxRkg3OF9IdzhIRkx6SjBIeWZpc0U5QnJJa3RFRUNWMGM5Y0ppVVgyak52LUI2V0QyN015eWxLbHVaU1NvMWtSZWNXUEhIek0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Jan 2024 08:00:00 GMT",
        "title": "Crypto Prices Today: Bitcoin Price (BTC) Breaks Above $44K, Ethereum (ETH) Still In The Red, Pepe Price Drops 5% - CoinGape",
        "content": "The crypto market observed a strong recovery over the last 24 hours, with Bitcoin and other cryptocurrencies trading in the green. While Bitcoin had fallen below $43,310 earlier today, the OG cryptocurrency has now zoomed past $44,000 levels.\n\nLast week, the US Securities and Exchange Commission (SEC) issued a “Fear of Missing Out” warning to investors amid renewed speculation that spot Bitcoin exchange-traded funds (ETFs) will get the regulator’s nod this week. While the SEC warning briefly caused turbulence in the market, the pessimism was short-lived.\n\nadvertisement\n\nBitcoin’s price rose 0.5% over the last 24 hours to $44,210, sending its market cap soaring to $865.2 billion. Trading volumes over the last 24 hours jumped over 28% to $21 billion.\n\nHowever, Ethereum saw a 0.3% decline in its prices over the last 24 hours. As of writing, the ETH price stood at $2,277, with its market cap sliding to $267.8 billion. However, trading volumes surged over 29% to $7.7 billion over the last 24 hours.\n\nOther cryptocurrencies also bled, with BNB price falling over 3%, Solana (SOL) price sliding over 3%, XRP slipping over 1.3%, and Cardano (ADA) plummetting over 4.6%.\n\nMeanwhile, the global crypto market cap fell nearly 0.9% over the last 24 hours to $1.64 trillion. The fear and greed index score stood at 67, indicating investor sentiment was muted.\n\nTop 3 Cryptos For Today\n\nPepe Coin Price Falls Over 10%\n\nPepe’s price plummetted over 10% to $0.000001062 in the past 24 hours, wiping out a significant chunk of its market cap, which shrank to $447.3 million. However, trading volumes over the last 24 hours rose over 26% to %85.1 million.\n\nShiba Inu (SHIB) Price Falls 8%\n\nThe Shiba Inu meme coin saw its prices sliding by over 8% to $0.0000088 in the past 24 hours, with its market cap falling to $5.2 billion. Trading volumes over the last 24 hours, however, appreciated over 46% to $170.8 million, indicating growing retail interest in the meme coin.\n\nLido DAO (LDO) Price Slumps 8.5%\n\nAfter a magnificent rally of 14% last week, Lido DAO’s price plunged over 8.5% to $2.85, sending its market cap tumbling to $2.53 billion. Meanwhile, trading volumes over the last 24 hours declined by 16% to $176.4 million, signaling diminishing retail interest in the token.\n\nAlso Read: Blackrock Positions $2B for Imminent US Bitcoin ETF Approval\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxNODZENU05Wkl6WnRzbEJGaXhSUjhDLUJxSmZtTU0xdUNNTGlSc3pTdUpFYTVjS09Qa05oOGVzaGJLRHIyVC1aMDh1OXp5aXpjamdEeFlFMnMySGNmTGg5MDgwTHBpSmJPWWR0NWV3TEd6N0o4eURFWUVxZktXeXlFTmZMU3JiZU16c3gtcnlyWkotalV1R1ZRdmh1MXdoWWE1TEl1c3RHMERPbWZacVkxdS00aWNkb2R5T3ZaNXpn0gHDAUFVX3lxTE11OE9uWENENGlkNTZ3a3BJa3VhVXVhbnVkSVdlME1fWFRSN29uY1JoTnl6cC13YzZtVWhKTGtDUFMzM0Jwd19GamRJNFQtZDRLTjhVaWpIazBEd1cxMkJfb3RtR0ZxWXpCYU43d21RdkFycHhLYjR6TGlBT3oyZ08tb2NWaVNtbmFQVHlTbXFIZ3BySFdtRldSZUFHY2FkajY2aDQtX3FuV1E3OHYxWVZOYTRWVjA0SmFGVkhyRjdFQUlYRQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Jan 2024 08:00:00 GMT",
        "title": "Crypto Whales Accumulate Nearly $1,000,000,000 in ETH in Just One Month, According to Trader - The Daily Hodl",
        "content": "A closely followed trader says that crypto whales are rapidly accumulating the leading smart contract platform Ethereum (ETH).\n\nAnalyst Ali Martinez tells his 39,700 followers on the social media platform X that deep-pocketed crypto traders have purchased 410,000 ETH, worth about $1 billion, in just the last month.\n\nThe trader shares a chart suggesting that the amount of Ethereum held in wallets with one million to 10 million ETH has been steadily rising since early December.\n\nEthereum is trading for $2,219 at time of writing, a fractional increase on the day.\n\nMoving on to layer-2 scaling solution Polygon (MATIC), Martinez says that the Tom DeMark (TD) Sequential indicator, which aims to identify turning points in a market with a value of nine signaling a possible reversal, is flashing a bullish signal for the altcoin.\n\n“Polygon: the TD Sequential presents a buy signal on MATIC four-hour chart. A spike in buying pressure around the current levels could see MATIC rebound, potentially toward $0.88, and even as high as $0.96.”\n\nAt time of writing, MATIC is worth $0.781.\n\nWrapping up his analysis with crypto king Bitcoin (BTC), Martinez says he remains bullish on the top digital asset as long it stays above its immediate support level.\n\n“As long as Bitcoin maintains its position above $41,800, the outlook remains bullish. This crucial level is bolstered by 2.41 million addresses holding over one million BTC, forming a substantial support zone. Additionally, the resistance ahead appears relatively minor, further strengthening the potential for stable or rising prices.”\n\nBitcoin is trading for $44,069 at time of writing.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxNaWxHU2pVNUZmLTk3d3lYYmtxNVVvYWF5UXhWMzZGZ002eFNIRUs1ZjE4eWdmTTVmZldwOFBhMXlDbS1TMUhmcUJVWnpoZ0RXRjFRNUZIOTBONWdTbVVvYkFUMTZjdEhSTW1uajczU29qZGNTTGpfNmViYlVQWWdFUDJtSHl6T1ByMzRGallwNTlXU2xOZ2puREhUc9IBoAFBVV95cUxOazhHaU9kWks4RGJJSXcxQ3BwNW85Y0NEOXVFR1g3eFM4T25td3pTRkFBUmZYR01oQUt4OWVxam56Y3VTTjNydG5HX0M5NGVKRjVjV2hQa2tFeXVtSDZHOEoyQ2RaTW1JS1dmVGxmQlVFaTl4OXEydjhrUGJTVWVpQkpVRjdpc2RCMWNiOFMwT2o2Z2hMc05zbm53WE51aVZu?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Jan 2024 08:00:00 GMT",
        "title": "Solana’s Co-Founder Drops Bombshell: Massive Shift in Road Map - Crypto News Flash",
        "content": "Solana doubles down on Layer 1 scaling, aiming to synchronize a global atomic state machine while welcoming Layer 2 solutions.\n\nIn contrast, Ethereum leans on Layer 2 options to tackle congestion, with over $20 billion TVL in these solutions.\n\nIn a recent announcement, Anatoly Yakovenko, co-founder of the blockchain platform Solana (SOL), has reaffirmed the project’s commitment to scaling at the Layer 1 level and achieving a global atomic state machine.\n\nWill @solana ever require Layer 2 solutions? There's nothing stopping developers from creating Layer 2s on Solana. However, Solana's aim is to synchronize a global atomic state machine as fast as the laws of physics allow. In this end state, any Layer 2, side chain, or… — toly 🇺🇸 (@aeyakovenko) January 5, 2024\n\nThis stance contrasts with other blockchain networks like Ethereum, which increasingly rely on Layer 2 solutions to address scalability challenges. Yakovenko’s remarks shed light on Solana’s unique design principles and determination to provide a high-performance, low-cost environment for decentralized applications (dApps).\n\nLayer 1 Scaling Takes Center Stage\n\nSolana’s primary objective is to synchronize a global atomic state machine as rapidly as the laws of physics permit. While developers are welcome to create Layer 2 solutions on the Solana network, the platform’s core focus remains on scaling at the Layer 1 level. This approach starkly contrasts Ethereum’s strategy, which leans heavily on Layer 2 solutions to alleviate network congestion and high transaction fees.\n\nSolana’s commitment to Layer 1 scaling means any Layer 2, side chain, or zero-knowledge proof valadium. However, valuable innovations, in their own right, are seen as external execution environments that do not ensure atomic composition with the rest of the Layer 1 state. The platform aims to enhance the single virtual machine instance on Layer 1, ideally through future hardware upgrades.\n\nSolana’s Confidence in Its Unique Design\n\nYakovenko acknowledged the innovative nature of technologies like side chains, data availability validating bridges, and zero-knowledge proof valadiums but stressed that they do not expand the atomic global state machine. This strategic decision underscores Solana’s confidence in its ability to meet global demands without resorting to external execution environments, a path many other blockchain networks have chosen.\n\nIt is important to note that Solana has faced challenges related to network reliability in the past, raising questions about its ability to provide a consistent and stable platform for dApps. To address these concerns, the platform has plans to upgrade its client by introducing “Firedancer,” a development aimed at increasing node reliability and overall network performance.\n\nWhile Solana focuses on Layer 1 scaling, Ethereum has taken a different route by increasingly relying on Layer 2 solutions. In a recent developer call, they decided not to increase Ethereum’s gas limit beyond the 30 million gwei level. This decision indicates a delay in Ethereum’s on-chain scaling ambitions, as it looks toward off-chain and sidechain solutions to alleviate congestion and reduce transaction costs.\n\nLayer-2 options such as Optimism and Arbitrum have gained popularity within the Ethereum community for their ability to offload transactions from the mainnet while maintaining compatibility with existing smart contracts. Data from L2Beat shows that these Layer 2 solutions have a combined Total Value Locked (TVL) of over $20 billion, with Arbitrum leading the pack at $10 billion in managed assets as of January 5.\n\nIn addition to discussing Solana’s commitment to Layer 1 scaling, Yakovenko highlighted potential vulnerabilities in Ethereum and Solana. He pointed out that Ethereum’s major threat lies in the centralization of value in execution hotspots, potentially compromising decentralization.\n\nOn the other hand, Solana’s vulnerability is tied to the importance of atomic composability in the blockchain industry, a fundamental aspect of Solana’s design.\n\nAs of the latest update, Solana’s native token, SOL, traded at $95.53, representing a 6% decline in just seven days. The market’s reaction to Solana’s strategic development and Yakovenko’s insights into potential vulnerabilities adds an intriguing layer to the ongoing narrative in the blockchain space\n\nRecommended for you:"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTFBKMTktUTd3Z2M0UTMzR3hOaHFWQVNzMVgyVXVTamgzbVJ0NTg1RHVSRGduRTQ4YlF2VUtQcEEyUE1RdnlUbGVQeGoxYXM3QXRkaWhnZVdZU3FwNFVlNlRGVWx2OHd1OVBQRnhDdXcwSQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Jan 2024 08:00:00 GMT",
        "title": "Core Dao Vs Bitcoin Comparison, Which is Better? - Indodax",
        "content": "With rapid developments in blockchain technology, one project attracting attention is CORE DAO. CORE DAO has become an innovation pioneer with a strong vision and use of advanced technology.\n\nThrough the integration of Zero-Knowledge Proof (ZKP) technology, CORE DAO offers guaranteed privacy, scalability, and an unprecedented level of security.\n\nCore DAO is a decentralized autonomous organization (DAO) active in developing the Satoshi Plus ecosystem. This ecosystem, a Layer-1 blockchain, combines the decentralization and security advantages of Bitcoin with the scalability and utility offered by the Ethereum blockchain.\n\nSo, to understand what CORE DAO is, its history and inventor, how it works, its main role in the ecosystem, and how it compares to other blockchains, check out the following review!\n\nWhat is Core DAO?\n\nCORE or Core DAO is a Layer-1 blockchain project that integrates systems from Bitcoin and Ethereum through a consensus mechanism known as Satoshi Plus.\n\nThis approach is an optimal combination of Proof of Stake (PoS) and Proof of Work (PoW) features. CORE aims to introduce the growth of Satoshi Plus consensus as well as harness the power of blockchain technology.\n\nBased on the Core DAO white paper, the main vision is to provide a blockchain that is scalable, secure, decentralized, and transparent for all users.\n\nIn other words, Core DAO is here to overcome the limitations of scale and decentralization support that PoW and PoS have. These experiments reflect principles such as sharding, sidechain, and state channel mechanisms.\n\nWith this approach, Core DAO aims to create a new blockchain independently, allowing it to operate within the Web3 ecosystem.\n\nHowever, the identity of the creator of Core DAO is not revealed. Even though an event poster named BlockSplit listed Schwarze Katze as the figure behind Core DAO, his identity remains unclear.\n\nAdditionally, one of the leading figures at Core DAO is Brendan Sedo, a Portuguese developer who previously served as CEO at Joist, a financial invoicing app for contractors.\n\nHistory and Inventors of Core Dao\n\nRich Rines, one of the early contributors to Core DAO, provides an in-depth perspective on the unique approach taken by Core DAO in solving the blockchain trilemma through the Satoshi Plus consensus mechanism.\n\nBy combining Bitcoin’s computational advantages to achieve decentralization and Delegated Proof of Stake (DPoS) advantages that enable scalability, Rines noted that Core DAO succeeded in creating a layer-1 solution that unites the three core elements of blockchain technology.\n\nHow Core Dao Works\n\nQuoting coinmarketcap.com, Core DAO created an innovative consensus mechanism called “Satoshi Plus,” a complex combination of Bitcoin proof-of-work and Ethereum proof-of-stake. The following illustration explains the complex network of relationships of Satoshi Plus:\n\n\n\nCore Dao’s Primary Role in the Ecosystem\n\nQuoting coinmarketcap.com, there are several main roles in the Core ecosystem that you need to know. The following are the main roles of Core Dao in the ecosystem, including:\n\nValidator: Responsible for block production and checking transactions. Validators register and deposit CORE to qualify for validator selection.\n\nResponsible for block production and checking transactions. Validators register and deposit CORE to qualify for validator selection. Relayer: Tasked with sharing information from Bitcoin to the Core network. Relayers also need to register and deposit CORE.\n\nTasked with sharing information from Bitcoin to the Core network. Relayers also need to register and deposit CORE. BTC Miner: Helps secure the Bitcoin network. BTC diggers can join the Core blockchain by handing over their mining power to a validator.\n\nHelps secure the Bitcoin network. BTC diggers can join the Core blockchain by handing over their mining power to a validator. CORE Holders: Own CORE and can participate in staking by handing over their holdings to a validator.\n\nOwn CORE and can participate in staking by handing over their holdings to a validator. Verifier: Checks for any bad behavior on the network and can report it. Bad behavior by validators may result in deductions from their deposits.\n\nValidator Selection Process\n\nValidator Selection: A mechanism to select the top 21 validators using a score based on how much BTC hash power and CORE assets the validator owns. Updated every 200 blocks.\n\nA mechanism to select the top 21 validators using a score based on how much BTC hash power and CORE assets the validator owns. Updated every 200 blocks. Round: A time period in which validators take turns creating blocks. At the end of each round, rewards are distributed, and new validators are selected.\n\nA time period in which validators take turns creating blocks. At the end of each round, rewards are distributed, and new validators are selected. Slot: A small part of a round where a validator can create a block.\n\nA small part of a round where a validator can create a block. Epoch: A period during which the system checks that all validators behave correctly. Incorrect behavior may result in removal from the validator group.\n\nSatoshi Plus Consensus\n\nThe Satoshi Plus mechanism uses the hash power delegated by BTC miners to Core validators to synchronize blocks mined by BTC miners with the Core network.\n\nAdditionally, DPoS consensus allows token holders to vote and select a set of validators. This allows small token holders to participate in network governance.\n\nThe validator selection process follows a complicated formula, which selects validators from PoW and DPoS consensus mechanisms.\n\nA total of 21 validators with the highest scores in the formula were selected for the 200-block period. Validator misbehavior results in withholding and holding mechanisms. Blocks are mined every 10 minutes, like in the Bitcoin network.\n\nRewards are distributed among validators and the System Reward Contract. Currently, 90% of the rewards are paid to validators. Reward Contract The system pays rewards to relayers and verifiers.\n\nCore DAO Tokenomics\n\nQuoting coinmarketcap.com, CORE is the original utility token of the blockchain. Used for staking and paying gas fees. Core follows the Bitcoin token model, with a total CORE supply of 2.1 billion.\n\nCore also promises to burn a percentage of block rewards and gas fees, similar to the Ethereum model.\n\nThe token emission schedule will be paid for over 81 years. The network hopes to encourage Bitcoin miners to hand over their hash power to the network once significant mining rewards in Bitcoin cease around 2040.\n\nToken supply is allocated as follows:\n\nMining Nodes (839.9 million CORE tokens; 39.995% of total supply): distributed over 81 years.\n\nUsers (525.6 million CORE tokens; 25.029%): Core launched its first airdrop in February 2023.\n\nContributors (Current and Future) (315 million CORE tokens; 15%)\n\nReserve (210 million CORE tokens; 10%)\n\nWealth (199.5 million CORE tokens; 9.5%)\n\nRelayer Rewards (10 million CORE tokens; 0.476%)\n\nWhen Did Core Dao Become Popular?\n\nCore DAO has adopted zero-knowledge proof (ZKP) technology into its blockchain structure, increasing privacy, scalability, and security.\n\nZKP allows users to prove the truth of a statement without having to reveal additional information, thereby maintaining confidentiality and protecting sensitive data.\n\nBy incorporating ZKP technology, Core DAO opens the door to innovations in smart contract functionality and expands the scope of applications that can be implemented on the Core DAO platform.\n\nWith a strong vision, advanced technology, and support from the community, Core DAO promises a bright future in the blockchain world. As the blockchain industry continues to evolve, zero-knowledge-proof technology is expected to play an important role in shaping the future of decentralized applications (dApps) and the blockchain ecosystem.\n\nComparison of Core Dao with Blockchain, Which is Better?\n\nQuoting coinmarketcap.com, Core DAO emphasized that this platform significantly leverages the advantages of other blockchains and combines the strengths of each while reducing their weaknesses. The results can be seen from the comparison of Core with other blockchains, including:\n\n1. Core vs Bitcoin\n\nBitcoin was the first popular blockchain and the first blockchain to introduce proof-of-work. It has become the most decentralized chain but can only process seven transactions per second. According to Core, the Core blockchain improves Bitcoin with higher throughput.\n\n2. Core vs Ethereum\n\nEthereum is the most popular smart contract blockchain and created the Ethereum Virtual Machine. Ethereum can also process more TPS than Bitcoin but is still limited to 15 TPS.\n\nCore aims to improve Ethereum with better scalability and less centralization, which he says is still a risk even with Ethereum’s scalability plans.\n\n3. Core vs Solana\n\nSolana is a chain with high TPS and short block times. However, the requirements for validators go far beyond those of other blockchains.\n\nAdditionally, Solana’s network availability lags behind other chains. Core aims to excel in both aspects.\n\n4. Core Dao vs BNB Chain\n\nBNB Chain was initially forked from the Ethereum chain and uses a Proof of Stake Authority consensus mechanism. It has faster transaction times and higher throughput, although this comes at the cost of decentralization.\n\nPi Network and Core DAO, Which One is Superior?\n\nEveryone has a personal view on which is better between Pi Network and Core DAO. However, if asked to determine which is better, the answer depends on the needs and preferences of each user.\n\nFor example, Pi Network can be ideal for beginners new to blockchain technology. This project is also suitable for those looking for a blockchain platform with the convenience of free coin mining.\n\nMeanwhile, Core DAO may be better suited to those interested in a community-based governance model, including recognizing new blockchains as a way to interact. It is important to note that both of these blockchain projects are still in the development stage.\n\nJudging the merits of either of the two can be quite difficult. Although theoretically, Core DAO has an advantage with projects already active on mainnet.\n\nOn the other hand, the Pi Network hackathon stands out in terms of utility with various unique protocols in its ecosystem. Core DAO also has the advantage of building a complex user ecosystem after operating on the mainnet.\n\nPi Network’s testnet ecosystem also provides an overview of how the mainnet ecosystem will function when released.\n\nWith more than 360 hackathon submissions in the first quarter of 2023, despite superior comparisons, both offer such exciting prospects that they have become a topic of discussion on social media.\n\nCrypto asset projects, with their uniqueness, have an appeal to various individuals. Considering the many interesting crypto projects available, the choice can be tailored to individual wishes and preferences.\n\nConclusion\n\nIn conclusion, CORE DAO, a decentralized autonomous organization, is important in depicting innovation in the blockchain ecosystem.\n\nBy understanding the essence of CORE DAO, we see how the platform incorporates the latest technologies, such as zero-knowledge proof, to increase privacy, scalability, and security within its blockchain.\n\nCORE DAO in the blockchain ecosystem is important because of its major contribution to solving the blockchain trilemma, namely providing a balanced solution between decentralization, scalability, and security.\n\nCORE DAO has also pioneered new consensus mechanisms, such as Satoshi Plus, which combines the power of Proof of Work and Delegated Proof of Stake. Therefore, CORE DAO plays an important role in shaping the future of blockchain technology by introducing its innovative approach.\n\nAs an evolving platform, CORE DAO has the potential to significantly impact the blockchain ecosystem’s evolution towards a higher level of maturity.\n\nInvest in Crypto Assets on INDODAX\n\nSo, now you understand what CORE DAO is, its history and inventor, how it works, its main role in the ecosystem, and how it compares to other blockchains.\n\nNext, if you are interested in investing in crypto, you should check the crypto market on INDODAX Market. Later, after checking the price, you can buy crypto assets on a trusted crypto exchange only on INDODAX. It is important to know that INDODAX is a leading platform and a pioneer in trading (buying and selling) crypto assets in Indonesia.\n\nApart from that, as a trusted crypto asset buying and selling platform to date, INDODAX continues to provide reliable services to investors. INDODAX also provides easy and comfortable access to the crypto asset market and guarantees user transaction security.\n\nSo what are you waiting for? Let’s start investing in crypto assets now with INDODAX!"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiYEFVX3lxTE55RVJkQnc3RGg1MTZHbVF4T0t0aEs5cnk0bFN4b0dxNVpnT0I2YVdVemhBOUxGNDkyTjQwdXdveTQ4VVFtTlhweXhFMk1VdVRWcm96MDlaLUwtQkZWdzQ0UQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Mining Software for Windows 10: Best to Use in 2024 - WindowsReport.com",
        "content": "Read our disclosure page to find out how can you help Windows Report sustain the editorial team Read more\n\nReaders help support Windows Report. We may get a commission if you buy through our links.\n\nBitcoin is undisputedly the king of cryptocurrencies. However, given its tendency to be volatile, other crypto coins have grown in popularity. Perhaps, the main competitor to Bitcoin is Ethereum, which was created by Vitalik Buterin in the early 2000s. If you are interested in mining Ethereum, and you’re not sure where to start, then you will want to read this list of best apps to mine Ethereum Windows 10. These apps are fairly easy to use and all work on the Windows 10 platform.\n\nTopping our list with NiceHash, the right platform for anybody who is considering investing in Ethereum. This full-featured tool offers you all the services needed to grow your crypto coins wallet.\n\nIf you start mining cryptocurrency from scratch and need rounded support, rely on this software capabilities to help you reach more hash power and exponentially grow your profit. Hence this solution aims to offer proper resources for any people who desire to capitalize from the Ethereum market.\n\nFor instance, the platform includes features like secure trading services, fast exchange currencies, or guides to help beginners make the first bitcoin trade. Afterward, it won’t be long for any newcomer to start mining or trade between the preferred currencies.\n\nConsidering Ethereum as your cryptocurrency it’s a smart choice due to its blockchain interface and decentralized service which doesn’t store confidential data on others clouds or devices.\n\nThus, NiceHash is a solution that helps you to buy and sell multiple currencies, and also offers a hash power marketplace that connects hash power buyers and sellers with hash power miners.\n\nNiceHash Choose the most convenient software for Ethereum mining and be one step forward from other markets. Check priceVisit website\n\nThe next one is MinerGate, which was created by a group of cryptocurrency devotees. This application works on Windows, Ubuntu, macOS, and Fedora. It has a very user-friendly interface and offers several unique features. The primary unique feature MinerGate provides is its merged mining service. With this service, you can mine several different crypto coins at the same time, without any decrease in the hash rate! In addition to mining Ethereum, you can also mine Bitcoin, Litecoin, Dashcoin, and other popular cryptocurrencies. All in all, MinerGate is a great tool for mining Ethereum that is both quick and easy to use. It has been reported to be capable of using your hardware’s maximum processing power. You can also choose how much you want your hardware to be working on mining crypto coins. In other words, if you are using a mining computer for other tasks, then you will find this software to be useful. ⇒ Get MinerGate\n\nWineth is another extremely simple application that works perfectly on the Windows 10 OS. It has a good deal of positive reviews and has a great reputation. One reason why Wineth is popular is that it takes little to no configurations to get things running. The software also comes with a wallet and access to proxy servers (Useful for users in restricted areas). This Ethereum mining software automatically pays you and updates their systems. If you are planning on using your hardware for other tasks, then you can switch Wineth to background mode. In background mode, Wineth will only use a small portion of your computer’s processing power. You can also choose for Wineth to only run/mine when your computer is idle. This way you don’t have to worry about it interfering with your work or play. Perhaps one of the best things about Wineth is that it is validated by DigiCert. This should mean that you will be using servers that have very strong security. On the other hand, Wineth is not completely free. Yes, it is free to download, but you pay the developers by giving 1% of your mining time for them. In other words, the way it seems to work is that if you were to mine for 100 hours, 1 hour will mine Ethereum exclusively for the team behind Wineth. It’s debatable whether or not this deal is good or not. If you don’t mind lending your computer’s processing power to mine Ethereum every now and then, then Wineth is a great application to use, especially for beginners. ⇒ Get Wineth\n\nThe application is promoted to be immune to fraud, censorship, downtime, and third-party interference. You can use the application as a standalone client or as part of a library. The standalone project named Geth works on all major operating systems, including Windows 10. Go Ethereum can also be embedded in your Android, iOS, or Go projects for greater convenience. Thus you can install this client in various ways, choosing the standalone pre-built bundle or other package managers you want. You can also run this program as a Docker container if you prefer. We recommend this application because it is one of the safest clients to use and there doesn’t seem to be any fees like Wineth. It might take some time to learn how to use Geth, but it will be worth it in the end. ⇒ Get Official Go Ethereum"
    }
]