[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiZEFVX3lxTFBLVzhhejNEclJHUURvMXExUEFEOENWOTBTSHlRSWxzMk8xYzVRRHhob196N0xaUGNmbVZDdjNmZFJ4aVo5dWNxTlRrdnJqX0JJc3ZMNlBHTUlObXFQdVZjTk5jWE8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Ethereum is too hard to use - Blockworks",
        "content": "Anyone else think Ethereum is difficult to use these days?\n\nYeah, there’s a bunch of cool stuff on Ethereum — meme tokens, NFTs, DeFi, degens — it’s all there. But over the years as the blockchain evolved, it has become more expensive and more complicated — as in, an already complex technology for users has become even moreso.\n\nNot only do users need to understand crypto basics like wallets, irreversible transactions and addresses, they also now have to contend with getting to know different chains. You can’t just send Ethereum chain ETH to Optimism chain ETH, or Optimism chain ETH to Polygon chain ETH, unless of course you use a bridge which means that this system might be getting a little complex for many users.\n\nEthereum is becoming a multilayered lasagna-like system whereby complexity and fees are pushing people to the margins, causing interoperability and security concerns.\n\nHow did we get here?\n\nI wouldn’t say there’s anyone in particular to blame for this; it’s an ecosystem problem as a whole. When Ethereum launched almost 10 years ago, nobody was using it. At that time, any usage at all was welcomed.\n\nNow, it’s 2024 and there is usage. But there’s also expensive layer-1 fees. Average transaction fees on the layer-1 Ethereum blockchain are at $0.94. If a user wants to interact with a smart contract, like a DEX, fees are averaging $4.70.\n\nSome might say, “Well, maybe it’s time to examine fees themselves.” Problem is, fees are what secure the network. If validators were not being incentivized by staking and reaping fees, what would be the point?\n\nOkay, yeah, but there’s the layer-2 options, right? There are. And Arbitrum and Optimism have both transaction and smart contract fees at less than $0.02. We’re securing the bottom layer, enabling lower fees on the second.\n\nBut as a Coinbase report from late last year noted, there are so many of these layer-2s that fragmentation now exists between all of these different chains. And mainstream users, aka those who could enable mass adoption, want financial apps that don’t make things complicated.\n\nThe sandbox\n\nThe point is clearly that Ethereum is just one big-ass financial experiment. I actually wrote about this way back in 2016, about Ethereum being a fintech sandbox.\n\nAnd it has been one. When I wrote that piece, ICOs were only slowly gaining traction, DEXs were in their infancy and there wasn’t even an NFT token standard yet — just Plain Jane ERC-20s.\n\nRead more from our opinion section: BlackRock clearly wants to take crypto seriously. Too bad it’s forever silly.\n\nTimes have certainly changed. Ethereum’s “world computer” concept, the idea that people could build programmable monetary systems on a verifiable blockchain, has been a success. The Ethereum Virtual Machine, or EVM, is a standard for smart contract development — even outside the Ethereum ecosystem.\n\nThen, there’s the 2022 move to the proof-of-stake model, which to Ethereum’s credit, was pulled off with remarkable execution.\n\nYet I’ve heard of people working on Ethereum layer-3 projects now. That’s an abstraction of two layers — can anyone come up with something comparable for so many layers in technology? Maybe the OSI model? It has seven layers. But it’s used for data in networking, all running at the same speed. And there’s no fees. It’s just categorizing data.\n\nOkay, well, blockchains are just data. So then we arrive back at the fee conundrum. But blockchains are decentralized, so there has to be some incentive to support the network, right?\n\nA fee quagmire\n\nFees secure the Ethereum network, rent the computing power to do things and also limit spam. With that in mind, I suppose there have to be fees in the system — I’m not proposing some grand, new fee-less Ethereum design, that’s for the Vitalik Buterins of the world.\n\nThere are rollups, and that’s promising because they can batch process transactions off of Ethereum while lowering fees with the same level of security. Or maybe some smart startup can somehow increase interoperability — instead of reducing it by having users dig through layers like a Stouffer’s Italiano.\n\nI just am not convinced of the feasibility and long-term viability of so many bridges, some of which have been compromised. It feels like too many vulnerabilities in the margins. Perhaps a standardization of bridges is needed, and many wallets do warn users about interacting with bad smart contracts, so some safeguarding is happening.\n\nBut I’m still trying to coincide my recent experiences with Ethereum as something…\n\nVery.\n\nLasagna-like.\n\nTasty for the taste buds as a food, yes.\n\nBut isn’t it a bit complex for people to use as a blockchain? People want apps that offer free flow of money, not restrictive layers. Hopefully, Ethereum can evolve past this lasagna stage.\n\nDaniel Cawrey has been involved full-time in the crypto space since 2013, including as an editor at CoinDesk. He is author of 2020’s “Mastering Blockchain” and 2023’s “Understanding Crypto” books, both available on Amazon.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiZkFVX3lxTE9nX2pJdno5TU5JemxNOEdsazRDV0FZQ2JaTVhlRkZtVHlyU1VRVVFYSjlTWnVNR2c3bEVBRmNfeW9aUUl6RWF2aGN5cXBfSXlPS2FWbUZDYTQzSWFkb3Q1dFlpTG10dw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "What Is the EIP-7022 Proposal on Ethereum? - Unchained",
        "content": "EIP-7702 is a new proposal that will introduce a new transaction type to enhance the security and functionality of EOAs.\n\nEthereum co-founder Vitalik Buterin and a team of developers are spearheading a new Ethereum Improvement Proposal (EIP). EIP-7702 will significantly improve smart contract functionality on Ethereum by temporarily merging it into externally owned accounts (EOA), thus simplifying and improving user experience.\n\nRead on to learn about the EIP-7702 proposal on Ethereum, how it works, its potential impact, and its benefits and drawbacks.\n\nWhat Is EIP-7702?\n\nThe EIP-7702 proposal was introduced as an alternative to EIP-3074, which was approved for inclusion in the Pectra upgrade scheduled for Q4 2024.\n\nEIP-3074 was designed to refine account management within the Ethereum protocol by allowing Externally Owned Accounts (EOAs) to assign control to smart contracts, paving the way for more advanced transaction strategies. EOAs are a type of Ethereum account controlled by users rather than code\n\nThe proposal would achieve this by introducing two new opcodes, AUTH and AUTHCALL, enabling EOAs to transition smoothly into smart contracts without deploying new ones. This would improve transaction efficiency and flexibility in interactive scenarios and complex operations.\n\nHowever, EIP-3074 faced some limitations, including technical issues and security challenges. These issues became evident in practical applications, especially when dealing with high-value or large-scale transactions. Vitalik Buterin, alongside Ansgar Dietrichs, Matt Garnett, and Sam Wilson, developed EIP-7702 in response to these issues and as an alternative to EIP-3074.\n\nEIP-7702 is a new proposal that will introduce a new transaction type to enhance the security and functionality of EOAs. The proposal will enable EOAs to behave momentarily like smart contracts.\n\nSimply put, EIP-7702 will inherit and expand some of the functionalities of EIP-3074, such as batch processing, lowering privileges, and transaction sponsorship.\n\nHow Does EIP-7702 Work?\n\nThe proposed EIP-7702 will provide a new method for EOAs to interact within the Ethereum blockchain. Externally owned accounts will be temporarily able to operate as smart contract wallets during transactions before returning to their initial state after the transaction.\n\nThis technique improves the functionality and security of Externally Owned Accounts without launching new opcodes, making assimilation more efficient than EIP-3074. Moreover, removing opcodes from the process helps decrease complexity, compatibility difficulties, development resources, and potential security flaws linked to them.\n\nEIP-7702 has been developed to be forward-thinking, given its compatibility with ERC-4337. ERC-4337 is an account abstraction standard on the Ethereum network that aims to improve security and user experience by launching smart contract functionality in wallets. This integration can help externally owned accounts attain features such as multi-factor authentication, the potential for people to transact using any token, and social recovery.\n\nEIP-7702 can significantly reduce transaction fees by batching transactions, making the Ethereum network more efficient. The proposal promotes financial inclusion by introducing transaction sponsorship, where one user can offset the transaction fees for another user. It also makes the platform more accessible, lowering the barrier to entry.\n\nEIP-7702 also includes downscaling privileges. Accounts can limit their privileges for certain crypto transactions, boosting the platform’s security against fraudulent and phishing activities.\n\nThe Potential Impact of EIP-7702 on the Ethereum Network\n\nThe new Ethereum proposal, EIP-7702, if included in the Pectra upgrade scheduled for Q4 2024, is expected to impact the Ethereum network positively. Although currently in the discussion stage, EIP-7702 offers a robust solution to enhancing Ethereum by introducing account abstraction.\n\nAccount abstraction makes it more flexible for users to program their security better while enjoying an enhanced user experience. Lowering the barrier to entry for Ethereum enhances accessibility, potentially boosting its adoption in the Web3 ecosystem. In addition, smart contracts can provide better safety features, such as recovering funds in case private keys are lost.\n\nTransaction sponsorship also means that users can easily get started with the Ethereum network as they don’t have to worry about buying ether for gas fees.\n\nThe proposal introduces greater flexibility in the design of smart contract wallets for developers. They can customize their verification logic, incorporating features such as emergency recovery techniques, multi-factor authentication, and spending limits. This opens up new opportunities for developers to explore smart contract wallets.\n\nBenefits and Drawbacks of EIP-7702\n\nWhile still in discussions, EIP-7702 has some benefits and drawbacks linked to it. Below are some benefits of the proposal:\n\nBatched Transactions: The Ethereum network can become much more efficient through the batched transaction feature, which can also reduce transaction costs.\n\nERC-4337 Compatibilit y: The EIP-7702 is a forward-thinking proposal compatible with the ERC-4337 standard on Ethereum, which can enhance the user experience and security of the Ethereum blockchain while advancing blockchain technology.\n\nTransaction Sponsorship : If successfully implemented, EIP-7702 will enable users to cover the transaction fees of other users, making the platform more accessible for everyone.\n\nWidespread Ethereum Adoption : By lowering the barrier to entry for users, more people will be able to access and use the Ethereum platform, leading to its widespread adoption.\n\nWhile there is optimism surrounding EIP-7702, it’s not without its drawbacks. Below are some challenges with the EIP-7702 proposal:\n\nAdjusting Gas Costs : It’s still unclear how EIP-7702 will scale the gas fee costs associated with its transactions.\n\nRevocation of Transactions : Implementing EIP-7702 would mean that users relinquish the control of their externally owned accounts to smart contract codes, which, albeit need to be trusted, can be prone to malice. Therefore, the Ethereum team must ensure users can revoke and revert transactions signed using malicious code.\n\nThe Bottom Line\n\nThe introduction of EIP-7702 is expected to benefit Ethereum. Still, its implementation will depend on its developers finding solutions to the raised issues and getting consensus from the Ethereum community.\n\nAnsgar Dietrichs, one of the researchers at the Ethereum Foundation, suggested implementing EIP-7702 to the Pectra upgrade first and tracking it for several weeks before deciding whether to replace EIP-3074 with EIP-7702.\n\nIf incorporated, it remains to be seen how EIP-7702 will revolutionize the Ethereum blockchain."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPTlV6c0JhcV93Y3pRR2NLVXcyOFVjMzNrVnJDc3RTTW9WZktOd29aclhHQ3hLVzNJamh6ZXJDV0N2OGEtbzJEOTdXQV9hVi1FR1QwWURncHZyR2FibUo5eUlGWjZGRzhDVHpORndUbnpBU0hVRE1hZExaWWZfSEJwMWRuRmR3c24t0gGQAUFVX3lxTE9ob09pNGFHQ3M0V0hHakJVSC1hUmthenZjenpfT25BXzNSelpJU0dQQVR3ak9CcDA1VDNtakNiZXNsU2NjTW9GWUVzcEpQWmRaUjFFcVpWRUNSSkRMdFpJUzhsRUJLanotcXllRW9ZUFJfY3RjeDhadHpWRXhnbUJ3czJvZVVQRGhVWVZBZF84Vg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Solana, Avalanche Soar as Ethereum Price Tops $3,500 - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin and Ethereum are up big today—with the latter soaring on rumors that an ETH-based exchange-traded fund (ETF) could soon hit the U.S. market.\n\nThe price of Bitcoin touched $70,000, triggering a flood of liquidations, while ETH is trading over $3,500 as of writing. But the top two coins by market cap aren't the only ones seeing big gains. The entire crypto market is up, with Solana and Avalanche the top gainers.\n\nSolana, the fifth biggest coin by market cap, is up over 8% in the past day and is now trading hands for $184.17, according to CoinGecko.\n\nAD\n\nAD\n\nThe coin isn't as close to breaking records like Bitcoin is, though—it still has to rise in value by another 29% to hit its 2021 all-time high of $259.\n\nElsewhere, Avalanche is also riding high: of the top 20 coins and tokens, it's doing the best, having shot up by nearly 9% in 24 hours. It is now priced at $38.24.\n\nThe coin, which runs on a network used by developers to build decentralized apps, is the 12th biggest digital asset by market cap and last year made headlines when J.P. Morgan announced that it had used its blockchain to tokenize investment portfolios.\n\nFurther down the list of top cryptocurrencies by market cap, price surges have also hit Uniswap (UNI), Pepe, and Lido DAO (LDO) with 24-hour gains of over 18%, 20%, and 21%, respectively.\n\nEthereum, the second biggest cryptocurrency, is currently up 14% in the past day, coming in priced at $3,511. The asset shot up on news that Wall Street's biggest regulator, the Securities and Exchange Commission, could be close to approving a spot ETH ETF.\n\nAD\n\nAD\n\nSuch an investment vehicle would give people exposure to the second biggest digital currency by market cap via shares that trade on a traditional stock exchange.\n\nThe SEC approved 11 spot Bitcoin ETFs in January but has been coy on the issue of approving an ETH equivalent.\n\nA long-list of big Wall Street firms have filed paperwork to release a spot ETH ETF, including BlackRock, Grayscale, and VanEck. Up until the latest rumors, the prospects of approval seemed dim.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxPSXFZTDVsNEliTUpoOGcwVUNReXp6Wm1kS2REX3AyWFVVRG9scUZkUEFaMWp0MzFXbG9qY1JEUzNMekJXdGpEMDM3dmVneWtJbUJqUmVkWHpJeW1qRmhkZGE1enh0dDdZV2h1b05mN0hWbWRpMFZwSWJvRmQ5aUNyOXJ0eHVmZFpJLXNGLWFPN2xXeU5IamdydkhGMHNaYjQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Ethereum soars as odds of ETF approval jump to 75% — ‘SEC could be doing a 180’ - DLNews",
        "content": "Bloomberg Intelligence ETF analyst Eric Balchunas says the odds of the SEC approving the Ethereum ETFs have greatly improved.\n\nThe SEC's sudden change of attitude is leaving everyone scrambling, Balchunas said.\n\nHe upped his odds of approval to 75%, from 25%.\n\nThe odds that the Securities and Exchange Commission will greenlight Ethereum spot exchange-traded fund applications have just increased.\n\nBloomberg Intelligence ETF analyst Eric Balchunas, long bearish on the products’ odds, posted on X that chances of approval have shot up to 75% from 25%.\n\nBalchunas said he was “hearing chatter this afternoon that the SEC could be doing a 180 on this (increasingly political issue), so now everyone is scrambling (like us everyone else assumed they’d be denied).”\n\n“It’s what we’re hearing from multiple sources,” Bloomberg Intelligence ETF research analyst James Seyffart said. “Should see a bunch of filings over coming days if we’re correct.”\n\nEthereum soared 8% off Balchunas’ tweet, recently trading at $3,400.\n\n“If the spot ETH ETF is approved, it will be a true shock to everyone I know in DC who’s close to this process,” Jake Chervinsky, chief legal officer at Variant fund, posted. “It means approval could signal a major shift in US crypto policy after the SAB 121 vote, perhaps more important than the ETF itself.”\n\nLast Thursday, the Senate voted on a resolution to repeal a controversial accounting guidance from the SEC, called SAB 121, which critics say has deterred investment banks from offering crypto custody at scale.\n\nPresident Joe Biden indicated that he would veto the provision if approved. Prominent Democrats, however, have sided with their Republican colleagues against the rule, raising speculation that the White House may back down.\n\nJoin the community to get our latest stories and updates\n\nDeadline\n\nIf the SEC wants to approve the Ethereum ETF products, it will have to be fast about it. The deadline for VanEck’s Ethereum ETF application is on Thursday — and the SEC is unlikely to approve some of the filings ahead of others in order to avoid playing the role of a kingmaker.\n\nNate Geraci, president of ETF Store, said that even with the tight deadline, it would be possible for the SEC to approve one set of important filings, called 19b-4s, before the deadline, and then “slow play” the second set of filings, called S-1s.\n\nThe SEC must approve both set of filings before the ETFs could come to market.\n\nBalchunas had previously told DL News that in light of the reported lack of engagement from the SEC with prospective issuers, Ethereum ETFs were unlikely to get approved before the end of 2025.\n\nIf the ETFs are rejected, issuers will likely wait until after the US presidential election to file again, because a victory for presumptive Republican nominee Donald Trump would probably mean a change of leadership at the SEC — perhaps in favour of someone less antagonistic toward crypto than current chair Gary Gensler.\n\nTom Carreras is a markets correspondent at DL News. Got a tip about Ethereum ETFs? Reach out at tcarreras@dlnews.com"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxNSnNCeEtKYi1WeDJIbnhfNWJucDh0ZDltVWQybThnUm9iLWwtUTF0VVFrQS1uaHhpWlhrWEhjcE9HLVRmTnUzU3RYNU1ZbUJmY2Z4RXE2TE1kRWFmNTJkNlBJU3BRZXM1R05sOENKNXhtZWtVQmQ5dkh0ZG5rNHFtUzh2VzVqLTlaZ25WNV8tUFhybF91dGZVOW1EbW9LeFk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Ethereum Funds See $23 Million Outflows Amid ETF Speculation - Crypto Times",
        "content": "Investors poured $932 million into digital asset products this week, but Ethereum (ETH) crypto funds bucked the trend, experiencing outflows exceeding $23 million, according to CoinShares, an asset management firm. Analysts attribute these outflows to growing concerns about the US Securities and Exchange Commission (SEC) approving a spot Ethereum exchange-traded fund (ETF).\n\nInvestors favored Bitcoin, with $942 million flowing in, and minimal short positions, indicating positive sentiment. Altcoins like Solana, Chainlink, and Cardano saw inflows of $4.9 million, $3.7 million, and $1.9 million. However, the weekly trading volume was only $10.5 billion, significantly lower than March’s $40 billion.\n\nImage Source: CoinShares (ETF Flows by Providers, Asset & Country)\n\nIn terms of regions, the US led the way this week with inflows of $1 billion. Grayscale, after experiencing significant outflows totaling $16.6 billion since its ETF launch in January, saw its first inflows of $18 million in a notable shift. Following the US, Switzerland and Germany also saw minor inflows, amounting to $27 million and $4.2 million, respectively.\n\nBlockchain equities have had a tough year, with outflows recorded in 14 of the 20 weeks so far, resulting in a cumulative outflow of $512 million.\n\nThe SEC’s potential disapproval of an Ethereum (ETH) exchange-traded fund (ETF) reflects its cautious approach towards crypto regulation. Concerns about market manipulation, investor protection, and the underlying infrastructure of Ethereum may influence their decision.\n\nAdditionally, the lack of clear regulatory guidelines for cryptocurrencies creates uncertainty, making it challenging for the SEC to greenlight such products. Until comprehensive regulatory frameworks are established, the approval of an ETH ETF remains uncertain, impacting investor sentiment and market dynamics."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxObmN6enI2SXpqc3lXOW9BS1pEOVdIWWFiRjZsa2VJT3c5aWhpcjhjeUtxTTFNTnlZTllEV1JhYUNrenZSUkM5WkNtaUJneXRjc0RiVHh1RmMzR2V4cWlyLXRyRXItVlEzUnFFbktldVRSenIySGlaSVpWV1N3WjJYNmYyd1ZEa213OFV1Qm5WNHpMNVRZd3JN?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 May 2024 07:00:00 GMT",
        "title": "IBC to Ethereum: Building the interconnected Internet of Blockchains - CryptoSlate",
        "content": "Since the advent of Bitcoin in 2009 and the explosion of innovation that followed, the web3 industry has faced many challenges. Beyond dealing with regulators, improving UX, and weeding out bad actors, blockchain engineers continue to tackle two major hurdles: scalability and interoperability.\n\nWhile many Layer 2s are working to scale Layer 1s like Bitcoin and Ethereum by improving throughput and reducing transaction fees, protocols like Union enable both—interoperability at scale.\n\nThe need for blockchain interoperability\n\nWhatever your opinion on the WEF, its 2020 whitepaper on blockchain interoperability hit the nail when it stated, “Organisations do not want to find themselves on a blockchain platform that may limit their options for external collaboration in the future.”\n\nTo elaborate further on that point, imagine having a Gmail account, sending a message to a Yahoo account, and being unable to exchange communications. The internet was able to develop as quickly as it did because it factored in interoperability from the early days, and blockchains must do the same.\n\nA notable player in the interoperability space is Cosmos, whose flagship Inter-Blockchain Communication (IBC) protocol has enabled a host of sovereign chains to connect, transact, exchange, swap tokens, and perform other actions without compromising sovereignty. Map of Zones shows 91 zones now connected via IBC transacting more than $2.1 billion over the last 30 days in more than 8.7 million transactions.\n\nIBC isn’t limited to Cosmos chains, either. The trustless interoperability protocol has broadened its scope to include EVM-compatible chains such as Ethereum, Polygon, and Avalanche. However, most bridging solutions so far have been offered by centralized providers, meaning users must trust the bridging protocol.\n\nUnion provides a permissionless bridging protocol that connects modular blockchains and rollups trustlessly, without depending on trusted third parties, oracles, multi-signatures, or MPC, using advanced zero-knowledge (ZK) cryptography.\n\nAlready connecting several ecosystems, Union recently announced a partnership with L2 developer Polygon Labs that will tap into Polygon’s AggLayer “to facilitate message passing and asset transfers between the Polygon ecosystem and IBC-enabled chains,” bridging two of the largest blockchain ecosystems: Polygon and Cosmos.\n\nPermissionlessly bridging Polygon, Cosmos, and beyond\n\nUnion founder and prior CTO at Composable Finance Karel Kubat told CryptoSlate, “It’s not just a Cosmos to Polygon bridge but anything that’s IBC-enabled, which includes Scroll, and soon Arbitrum, Berrachain, Movement Labs, M2… They can build and connect into the Agglayer using Union,” permissionlessly tapping into the liquidity of one of the largest blockchain Layer 1s, Ethereum.\n\n“Right now it’s very interesting because we have big L1 ecosystems that really only have permissioned centralized bridges or something in between. You need to go to the bridge provider to get support for a small ecosystem. What Union does, is if you’re building a new Cosmos chain or a new rollup that’s IBC enabled, you don’t need to go to a centralized provider to get support. You just open the connection to Ethereum and you’re done… So we’re going quite quickly from a world with only 200 to 300 ecosystems to a world with thousands and thousands.”\n\nThis type of seamless interoperability isn’t possible with centralized solutions because the “wait queue” is too long. Every chain wanting to connect needs to request the bridging protocol’s permission.\n\nWith Union, chains can permissionlessly open a channel with Ethereum, enabling a seamlessly interconnected future… of potentially millions of chains. Karel gives the example of dYdX, one of the largest decentralized exchanges that began as a smart contract on Ethereum and moved ecosystems to become a sovereign Cosmos app chain.\n\n“We all went into crypto for sovereignty,” he says. “Any successful smart contract is contemplating going to their own L2 or app chain.” This means the total addressable market for Union is potentially vast. “It isn’t anyone that wants to build a blockchain. It’s any existing app on Ethereum and Solana that could benefit from making this move.”\n\nUnion’s IBC to Polygon bridge should be completed by the end of this year and you can keep up with the latest developments by following Union on X.\n\nMentioned in this article"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE9yRXpjMEhVYk9talpuNVg3YmVTT2ZnMFZLRXN0aXlNQTZMVU4tNVo1YUZBNlA5WlY4X2pUWVlqdTI3QnNTMmo5ZkNIOFZpbHJVcXNhM3pfeGFSTVBZc2hJcFB1SzJVbmllOC15cTFqUWo2OXQ5Q19F0gF_QVVfeXFMTmNEMW1oZGNNOUk4UzctcjdnQkhJalBEdkxVRy1XU3lUeEhJR0Qyek16QTBwQU0zdlNaVE55RW43Y2tOVDNOLTN5TGUydlk3SXM2dnkxSEhFVHMtUTJTaUlLMkcwQTdwTnZqOFRYdDBXNXJjWHR4c0YzQ1hWUDgybw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Ethereum Soars 20%, Lifting Arbitrum and Optimism - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nRumors of a potential approval of Ethereum spot ETFs have fueled a full day of gains for the Ethereum ecosystem, with the price of ETH skyrocketing 20% intraday to just shy of $3,700—trading at $3,687 at time of writing—and sister tokens Arbitrum (ARB) and Optimism (OP) both notching gains of 18% on Monday.\n\nThe optimistic mood had already spread to other cryptocurrencies, including Solana (SOL) and Avalanche (AVAX), which are peaking above $40 and $188 respectively, as of this writing, representing more than 25% gains over the last seven days for both.\n\nThe sudden rally to start the week was sparked moments after two Bloomberg ETF analysts—Eric Balchunas and James Seyffart—revealed their joint prediction that the Securities and Exchange Commission “could be doing a 180 on this increasingly political issue” and approve Ethereum spot ETFs when its first major deadline comes later this week.\n\nThey increased their estimated odds of approval to 75%—a huge upgrade from their prior estimate of 25%, which was already more pessimistic than other analysts who placed the chances at 50-50 earlier this year.\n\nAD\n\nAD\n\nUpdate: @JSeyff and I are increasing our odds of spot Ether ETF approval to 75% (up from 25%), hearing chatter this afternoon that SEC could be doing a 180 on this (increasingly political issue), so now everyone scrambling (like us everyone else assumed they'd be denied). See… https://t.co/gcxgYHz3om — Eric Balchunas (@EricBalchunas) May 20, 2024\n\nCrypto oddsmakers are certainly shifting their views, with the collective probability of an Ethereum spot ETF approval by the end of the month leaping from 10% yesterday to 61% on Polymarket, as of this writing. Optimism had been declining steadily since the betting option appeared in January at 76%, when Bitcoin spot ETFs were unleashed.\n\nAs with the long and meandering Bitcoin spot ETF approval process, the SEC has systematically delayed making a decision on the Ethereum equivalents. Hopes for approval had dimmed, with fears peaking that this week's deadline would prompt the federal regulator to outright declare Ethereum a security, decisively separating it from the commodity status enjoyed by Bitcoin.\n\nLate last week, however, a debate on Capitol Hill prompted many Democrats to join Republicans in defiance of Pres. Joe Biden's pro-SEC stance, a significant battle in a broadly partisan war over U.S. crypto policy.\n\nAD\n\nAD\n\nI don’t think people appreciate how huge that vote was. Warren had a strangle hold over financial policy under the Dems. This is showing the WH and Senate Dems are starting to realize that’s toxic to their election odds. They also realize there are *a lot* of moderates,… https://t.co/w8gsmw6BIn — Adam Cochran (adamscochran.eth) (@adamscochran) May 20, 2024\n\nMeanwhile, leading cryptocurrency exchange Coinbase said it saw Ethereum spot ETFs as an eventuality—if not immediately approved on May 23.\n\nAll of this came as top coin Bitcoin was in the middle of its own rally, the price of BTC clearing $70,000 earlier in the day amid massive short-position liquidiations—heights not seen since April 12, and approaching the $73,737 all-time high set in March.\n\nThe good mood was contagious, and by late Monday, the top 25 cryptocurrencies by market cap were all green for the day—and for the prior 7 days.\n\nAmong meme coins, Bonk and Pepe are both up more than 20% in the last 24 hours."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxQSk1lbFhvSVNHb2U1YXhVRFlaVkwwWTJMTzNNLXJkdFJ2N0NtMkpTODc3a2RaWFZJbEM1NUZmWm9EaVkxWlhvYzNFR29ucEltc2hqTmJHZEx4Um1RZ0JjbHkwQ2N3YU0yaVB5Qks5STFUSkx2d1F6ZW1aVTl3UnRmbzBBZUdBOUpZS0RGZ3ZRektNbzIxVGEyeWJiVkE0cmUyOGRjWl8wdWtfN1Y5UUhmVnhDNElOeGdONmRCUnhtZkFLRVd3LVZYbGlRYm54anfSAdQBQVVfeXFMT2R4V1NXU2VUTE9NYlNoNTVSS01UdFVHcXVKS0s0dmlNUDZBZk90aDlscG1MLUJYWW15VUNJV1B0bnRaUVRVd1V6bEdoU1VXWHQ1NUhnaGVmajhXakV1ZlVsWHRSZjFDTW5HN3RLY0RIQ2dhd3YzR1piYU44bVl2cGplNVY1alYxZEFsbm5OTkRQbjlldVBJeEt5d0cwZjZfSkNRZXhEZmFwbHYxQ1kxdl8wOXRaNFdhNFFTSTBuM2FLdUU1QzlLaXZuamdjSzVHbUFaeks?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Crypto Analyst Predicts Ethereum Season, Says Solana Following in Footsteps of ETH’s 2021 Market Cycle - The Daily Hodl",
        "content": "A popular crypto analyst says that it’s likely Ethereum’s (ETH) time to shine and that its biggest rival is in for a parabolic run.\n\nPseudonymous trader Inmortal tells his 213,900 followers on the social media platform X that Ethereum will rally and leave many traders on the sidelines.\n\nThe analyst lays out an initial target of about $4,000 with a chart suggesting that ETH found support at around the $2,800 level.\n\n“ETH season about to start.\n\nFueled by disbelief, as all the other times.”\n\nAt time of writing, Ethereum is trading for $3,107.\n\nThe analyst also has his eye on Ethereum rival Solana (SOL). According to Inmortal, Solana has so far resembled Ethereum’s 2021 market cycle, and if SOL were to continue, it could be trading well above the $360 mark later this year.\n\n“ETH 2021 vs SOL 2024”\n\nSOL is trading at $177.54 at time of writing.\n\nLooking at Bitcoin (BTC), Inmortal says that the crypto king is currently in a range between $74,000 and $56,000. If BTC manages to convincingly hold the $66,000 level, the trader says that another run-up to all-time highs is possible.\n\n“BTC KEY levels.\n\nPrice rejected at first level of resistance (mid-range)\n\n> IF price manages to reclaim mid-range, THEN range high ($74,000) is on the table.\n\n> Below blue box = bad\n\nVery simple.”\n\nAt time of writing, BTC is trading at $67,024, slightly above Inmortal’s mid-range.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMi3wFBVV95cUxQWko0QnJTODVWVkFOZDQtRkJnTHZwSkhMWnJMSW1GdXlEVVlob2NVdnFxYUxBeW9DXzZiU3AtTWhZZmZmazhHemY0YWliZjBUcTdrOXRycUlBMzExN1B3dnVBd1hTREhVVmZWU19fVTFjb2tGZk1hOWJGcDZEWjFGNUp3Uk94Y3RGalBNeXo1TnFjekR4amZnRUlKX0ZmRE5lYTBSZDliLURKeVhlakc5WlN4bms3YTYxbEdZdVFYY25aVmdOb04wRTVxcGlaMVRyaTV6eGRWbU5xS1RtVzQ00gHkAUFVX3lxTE9qdVV6YUN3ZzBnZnIxWlJmdEdrdlRwMGZTeTFZdC1XRnhCaFphNG05OFlZakZaZDVJUmxiN2tGREVYREhPaS1rVnF0OE81S2NUQUUtTC1LZjdtYVZfZkFkcHd0YnkyY2RkZ1VBdWlqVzY2V3h0Y0FiZkc1dzREWXFheTdwdi1sUDNMXzRkQnJyak9kRi1RQkMybm1uT2FYVGkzTVJwU2RpMzctck93TExTNFkyRjgxSDVTMUN6bWh2YTVENmRxbVRkVU9tRjdOamlMdHhkT1BSY1N0SWVWQkdGa2dYNA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Trader Predicts More Rallies for Surging Ethereum Rival, Updates Outlook on Chainlink and Two Additional Altcoins - The Daily Hodl",
        "content": "A closely followed crypto strategist says he’s bullish on one Ethereum (ETH) competitor that surged by as much as 43% last week.\n\nPseudonymous trader Altcoin Sherpa tells his 216,300 followers on the social media platform X that Fantom (FTM) will see more rallies in the coming months.\n\n“FTM is going to $1-ish before any pullback and should go even higher in the next six months, in my opinion. Interesting upgrades/pivots coming here, and I have a bag. This looks strong in the short term.”\n\nAt time of writing, FTM is worth $0.856.\n\nLooking at the native asset of the decentralized oracle network Chainlink (LINK), the trader says the altcoin is in a position to ignite a breakout rally.\n\n“LINK goes to $20 if it can break past this $16 mark, in my opinion.\n\nStill wouldn’t personally buy here though.”\n\nAt time of writing, LINK is trading at $16.53.\n\nNext is the memecoin dogwifhat (WIF), which the analyst says is approaching a potential bounce level.\n\n“WIF: $2.30 should provide a bounce area. Thought it would break past the range high but definitely was wrong. Could also see the wick tapped again, too, around $1.80. Those should be good short-term bounces overall.”\n\nAt time of writing, WIF is worth $2.54.\n\nThe last altcoin on the trader’s radar is the native asset of the Solana (SOL)-based decentralized exchange (DEX) aggregator Jupiter (JUP). According to Altcoin Sherpa, JUP is currently in the process of carving a bottom.\n\n“Some of these charts look pretty good overall. JUP for example. expecting some sort of slow grind up after forming some sort of short-term bottom.”\n\nAt time of writing, JUP is trading for $1.18.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxNcmFOTWNzVWxkREwyX3drM3N1SU80aEVtVTJCenhmTVRCRnFIOE9jVWV0WkdlZjAtdV9SZWVKdm1pWmVZd29lVHlhUDFLUUhVUDRXYnVkZ21pT2RHbUIwV3NvSkhoaVNTTzZKS0hfTG9FekVMcFVXWGN0Z1o3YU9HSkxBU0VJMklRZ1HSAY8BQVVfeXFMUDNfYWRWdjhuWlJnMXFCNldsN0stV3JFTHlWY3FDUnFlUkNfR3ltdFU0Y0tENFBWT1hOcWtyQVFVN1J4WFcyc25RYnEyVHFJWGNlMEYwci1kdGxoTWg3T2lwUVM2bWpQdDI2YlBQbE9wVEVVSVlVU0N6VHZBN2RBTk02aEo0b1ZDVG56RHJlZlk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "U.S. SEC To Approve 19b-4 for Spot Ethereum ETF, What It Means? - CoinGape",
        "content": "With the spot Ethereum ETF decision pending this week, Nate Geraci, President of the ETF Store, offers insights into the potential outcomes for the week ahead. Approval from the SEC for spot Ethereum ETFs to trade on Wall Street hinges on the clearance of both the 19b-4s (exchange rule changes) and S-1s (registration statements).\n\nSpot Ethereum ETH Approval\n\nAs we know, the spot Ethereum ETF will directly hold Ether as its underlying asset, and will trade on the stock exchanges just similar to stocks. However, for them to trade on exchanges, they must receive the SEC nod for both – 19b-4s as well the S-1 filings.\n\nadvertisement\n\nSEC decision deadline this week on spot eth ETFs… SEC must approve both the 19b-4s (exchange rule changes) & S-1s (registration statements) for ETFs to launch. Technically possible for SEC to approve 19b-4s & then slow play S-1s (esp given reported lack of engagement here). — Nate Geraci (@NateGeraci) May 19, 2024\n\nRule 19b-4 refers to the filing that a national securities exchange, such as the NYSE or Nasdaq, submits to the SEC when proposing to change rules or introduce new products. For Ethereum ETFs, the exchanges need SEC approval on these filings to list the ETFs. Essentially, this process involves the exchange requesting permission to add these new Ethereum products to their trading platforms.\n\nThe S-1 is the initial registration form required for new securities offered to the public. It provides the SEC and potential investors with detailed information about the company’s business operations, financial condition, and management. For ETFs, this document details the structure of the fund, its management, and how it intends to replicate the performance of Ethereum.\n\nThe SEC must approve both the 19b-4 filings and the S-1 registration forms in order to legally sell the ETFs to the public. The SEC typically has a statutory timeframe of 45 days, extendable up to 240 days, to make an initial decision on the 19b-4 filings. Approval of the 19b-4s permits the ETFs to be listed on exchanges. However, without approval of the S-1s, the ETFs cannot be legally sold to investors.\n\nChances of A Delay\n\nEven if the U.S. SEC approves the 19b-4s, it can go slow with the approval of the S-1s. This also means that the regulator can take even longer in order to review and approve these documents. Also, the lack of engagement between the issuers and the SEC highlights that the regulator could undertake a more cautious approach due to the complexities and risks involved with crypto products.\n\nThe decision on Ethereum ETFs is crucial, as approval could boost mainstream adoption of Ethereum and offer a more regulated and secure investment environment for those interested in cryptocurrency. Conversely, a delay or denial might indicate ongoing regulatory concerns about the stability and security of cryptocurrency investments.\n\nAs the decision looms around, the Ethereum price has given a partial bounceback to $3,100 over the last weekend.\n\nBhushan Akolkar Bhushan is a FinTech enthusiast with a keen understanding of financial markets. His interest in economics and finance has led him to focus on emerging Blockchain technology and cryptocurrency markets. He is committed to continuous learning and stays motivated by sharing the knowledge he acquires. In his free time, Bhushan enjoys reading thriller fiction novels and occasionally explores his culinary skills.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxNcWZnTHNNNHAwUURCZ2tCMjAzbG5RTzMzbEsxU0xpNjhReGF1SHlsV0ZhdDhVZlFvbkFXWWEtaGtDNE91UjgxWGN5czA4LW1uMWZiVWN4MG9ueUNRZHN4RlNlM282Vjh3WTB1Y2stbEZJOUJOZG9tMmdudXhQUDQtQTJFb1N4dVZvZlN2UWlpTGx4QU9JQnc5NVdLUTYxSWtpSmx2MzNjTEZYQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Vitalik Buterin is concerned about the decentralization of Ethereum - The Cryptonomist",
        "content": "In a recent blog post, Vitalik Buterin expressed his opinions on three key issues regarding the decentralization of Ethereum: MEV, liquid staking, and node hardware requirements.\n\nButerin explained that many of the concerns related to the centralization of Ethereum can be addressed through smart protocol designs and updates, some of which are already being implemented.\n\nLet’s see below all the details.\n\nDecentralization of Ethereum: Vitalik Buterin’s response\n\nAs anticipated, Vitalik Buterin, co-founder of Ethereum, responded to the criticisms directed at the blockchain in a detailed blog post, analyzing three fundamental issues for the centralization of Ethereum.\n\nMEV (Miner Extractable Value), liquid staking and hardware costs for managing a single node are the three key points.\n\nButerin has observed that concerns about the design of Ethereum in these three key areas are “widely shared” and added:\n\n“These are concerns I have personally had on many occasions.”\n\nHowever, according to Buterin, these problems might not be as difficult to overcome as some argue.\n\nIn his post, published on May 17th, Buterin first addresses the issue of MEV, which is the financial gain that sophisticated node operators can obtain by reordering transactions within a block.\n\nButerin distinguishes two approaches to MEV: “minimization” (reducing MEV through the design of intelligent protocols, like CowSwap) and “quarantine” (attempting to reduce or eliminate MEV altogether through in-protocol techniques).\n\nAlthough the MEV quarantine may seem like an appealing option, Buterin notes that this perspective carries some risks of centralization:\n\n“If builders have the power to completely exclude transactions from a block, attacks can easily arise-”\n\nHowever, Buterin has supported builders working on MEV quarantine through concepts like transaction inclusion lists, which “take away the builder’s ability to completely exclude transactions from a block.”\n\n“I think that the ideas in this direction – really pushing the quarantine box to be as small as possible – are really interesting, and I am in favor of going in that direction.”\n\nButerin: reducing barriers for solo stakers, a crucial step\n\nVitalik Buterin has addressed the issue of the low number of solo stakers on Ethereum.\n\nIn particular explaining that many prefer to use centralized staking providers like Coinbase or decentralized solutions like Lido and RocketPool.\n\nThis choice is due to the complexity, hardware requirements, and the minimum of 32 ETH needed to run an Ethereum node independently.\n\nWhile acknowledging the progress made in reducing the costs and complexity of managing a single node, Buterin emphasized that “there is still more that we could do.”\n\nSuggesting the possibility of reducing the time required to withdraw ETH in staking or lowering the minimum requirement of 32 ETH to become a solo staker, as stated:\n\n“Incorrect answers could lead Ethereum down a path of centralization and ‘recreation of the traditional financial system with additional steps’; correct answers could create a shining example of a successful ecosystem with a wide and diversified set of individual stakers and highly decentralized staking pools.”\n\nHigh hardware requirements for nodes: the civil debate\n\nRegarding the high hardware requirements for nodes, Buterin admitted that the issue is more complex.\n\nHowever, he acknowledged that with the implementation of Verkle Trees and the upcoming EIP-4444, “the hardware requirements of a node could plausibly eventually decrease to less than one hundred gigabytes, and perhaps almost to zero if we completely eliminate the responsibility of storing the history (perhaps only for non-staking nodes).”\n\nButerin concluded his post urging the Ethereum ecosystem to confront difficult questions rather than avoid them:\n\n“… We should have a deep respect for the properties that make Ethereum unique and continue to work to maintain and improve those properties as Ethereum grows.”\n\nIn a post on X, Buterin added that he is happy to see a civil debate among community members:"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNSGZJbENhSjMwSmxZZGh5cHpYQTlEcGMxbFVhUjg4UlZyV0NzTWZLR3p1ZnBlVC1PbzktUlhCbHYxYkxmek53ZFlfcW56YXhjLTYwTW9CUjI0bHhfdlIzRlU5RHQwcmhsdWtuVkdWS0pqdzF2VEM0allQalJkX0Q1RHh0ck1aOXNNRDlORDNWTnhPdXBTaS1uStIBngFBVV95cUxQUWZHSEhoOU5PQndTOEV6d3BGU3hFYTlmcDhPdVByQmFfQUExQjB4QVluY3FJY2ZzQmtFb1BWZ1d2YVltX21Pc3FUdlhnRkNDRjVHX183VnRVUHEycVJ6dnAxQ1h4NmhCQmt4LTlVTDI1ZFVWSDhBaEVLNFp1OVEzV0NRVnhmT0c2THhYdmZna3oxQ2ptYk5oalVxV0p1UQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Here’s Why the Ethereum (ETH) Price is Rising Heavily - CoinGape",
        "content": "Ethereum has made a shocking recovery as the token gained a 30% surge in the last few days, pushing the value to the highest of the month. At the time of writing, Ethereum price is valued at $3,758.22 with a market capitalization of $451,726,002,955. Moments before surging, ETH price was shallow around the $31K mark, but within 34 minutes, the price jumped to $34K, with a big surge in its number of transactions. Because of that, the trading volume jumped 253% yesterday, pumping the value to $ 33.2billion.\n\nadvertisement\n\nSo, why the Ethereum price is rising so much? Let us look into that.\n\nWhat’s Behind The Ethereum Price Rally?\n\nAfter creating history for being the most preferred cryptocurrency network, ETH hit its peak in 2021 when it surged to its ATH of $4,891.70. But with the declining market conditions, Ethereum was laying low for years before witnessing a surge in March 2024. And now after weeks of break, Ethereum price has started to rise again with a major pump in the last 48 hours solely because of two factors related to the market recovery and new updates on Ethereum ETF.\n\nBullish Market Conditions\n\nAfter weeks of neutral sentiments restricting the market conditions, finally, bulls appeared in the market with a 68/100 score on the fear and greed index. This along with the rise in overall market cap to $2.6 Trillion and the trading volume of $120.57 Billion confirms the bullish market conditions today. As a result, all the cryptocurrencies, including Ethereum have recovered after gaining decent gains in the last 48 hours.\n\nMoreover, Bitcoin price targeting the ATH target of $73,750.07 after rising to $69,822.46 also pushing the altcoins up.\n\nEthereum Spot ETF Approval\n\nThe SEC’s decision over Ethereum ETF will be out on Thursday but one thing has changed, making it the main reason behind creating a surge. After the SEC portrayed disagreement with Ethereum, the investors lost hope of hearing positive news on the result day. Also, the analysts presented a very low probability of approval of Ethereum Spot ETF due to the issues of Ethereum status between Commodity and Security. However, finally, the analysts have presented a 75% approval rate in the ETH ETF case, much higher than the prior 25%.\n\nBloomberg ETF analysts, Eric Balchunas and James Seyffart openly announced the approval ods rising to 75% based on the SEC advising the exchanges to update their 19B-4 filings on an instant basis for Spot ETH ETFs. This single move changes the trajectory of people’s opinions about the SEC approval, including these Bloomberg analysts.\n\nUpdate: @JSeyff and I are increasing our odds of spot Ether ETF approval to 75% (up from 25%), hearing chatter this afternoon that SEC could be doing a 180 on this (increasingly political issue), so now everyone scrambling (like us everyone else assumed they’d be denied). See… https://t.co/gcxgYHz3om — Eric Balchunas (@EricBalchunas) May 20, 2024\n\nHow High Ethereum Price Can Go?\n\nEthereum is still under the bullish sentiments and might continue to surge more. Agreeing with the same, crypto analyst Oliver Isaac said that the Ethereum price charts are forming the biggest daily Ethereum candle of the five years which is almost equal to the entire market cap of Solana (SOL). He further predicted the Ethereum price to hit $10K next.\n\nLargest daily Ethereum candle in 5 years$ETH is up almost the entire mcap of $SOL today If they approve the Ethereum ETF, they are approving the entire industry. ETH to $10,000 next target pic.twitter.com/3KLgjUu7Xe — Oliver Isaacs (@oliverzok) May 21, 2024\n\nRegardless, the ongoing hype around the Ethereum ETF is supposed to be behind the Ethereum bull run, pushing the value to a $4K mark easily. The Fibonacci level indicates an upsurge in the Ethereum price, where if the trend continues the value can surge up to $4749 by the end of the month. Moreover, the Ethereum Spot ETF approval can push this value even harder to $6K.\n\nPooja Khardia With a deep-seated passion for reading and five years of experience in content writing, Pooja is now focused on crafting trending content about cryptocurrency market. As a dedicated crypto journalist, Pooja is constantly seeking out trending topics and informative statistics to create compelling pieces for crypto enthusiasts. Staying abreast of the latest trends and advancements in the field is an integral part of her daily routine, fueling a commitment to delivering timely and insightful coverage\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxOSFE4T0pYcG1INlZ6XzhYWkhWd2xNWDJQNGxNbjRNVm83SkdGaW1CeEZiN0JzdkQ4NV9jeWdPSHBKWklEcHpRd1oydzgxVjdUZFdRMDExUjMxQUV3ZnJVdWN1MVllRXB6dGhENTVJSGVjeW1neWZPazNOX3EzN2JmNGpLNFdkendKS081MkQ4RzBQRENQaEpZdXZYaHJoRkHSAaQBQVVfeXFMTUJNNUdJU3dtQTM4LWlkY0VqWWJvYWcwaXo0RjY1M2ZiajVIaUlQdXoxdXFLNFBDb2dKdkJLZnZlcThmTUdMQ1dYazJadUhrNXdQVTJyMzZkSXM4djIzdUlldjlqVllNM1VnRklNZlhuSjVoMGM3UEtTOTlIZ2RDX1hKYUgyTXd1MmZuZFd5dUFQbUJERTBBZFR6YjZuZkRKbl9FbTI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "ETH Soars Past $3K But Will the Sellers Come Back? (Ethereum Price Analysis) - CryptoPotato",
        "content": "Ethereum’s price has faced challenges breaking below the critical $3K support region, with a recent bullish rebound driven by heightened demand near this level.\n\nHowever, a substantial resistance region looms ahead, potentially halting the current momentum.\n\nTechnical Analysis\n\nBy Shayan\n\nThe Daily Chart\n\nAn analysis of the daily chart shows that Ethereum sellers have been attempting to push the price below the crucial $3K support region, which aligns with the 0.5 ($3133) and 0.618 ($2906) Fibonacci levels.\n\nDespite these efforts, ETH recently experienced a bullish rebound due to significant demand around this key threshold, reaching the upper boundary of a multi-month descending wedge and the crucial 100-day moving average at $3.2K.\n\nA sudden breach of this critical resistance zone could trigger a surge, with the next target being the $3.4K resistance region. However, the $3.2K resistance region has the potential to halt the upward momentum, as it includes a notable amount of supply. If a bearish rejection occurs, a plummet toward the wedge’s lower boundary becomes imminent.\n\nThe 4-Hour Chart\n\nA closer look at the 4-hour chart reveals a multi-week range-bound phase, with Ethereum consolidating between the significant support at $2.9K and the critical resistance at $3.2K. Recently, the price saw a notable surge near the $2.9K threshold, retracing towards the wedge’s upper boundary, which corresponds to the $3.2K resistance region.\n\nThis indicates a slight increase in market demand.\n\nIf buyers successfully breach the wedge’s upper trendline at the $3.2K resistance level and the bullish momentum strengthens, a strong bullish trend could emerge in the mid-term. However, if buyers fail to push the price above this threshold, a reversal may occur, leading to the continuation of the current sideways range phase towards the $2.9K support.\n\nSentiment Analysis\n\nBy Shayan\n\nAmid Ethereum’s recent sideways consolidation and uncertain price action, investors are closely watching futures market behavior to gauge potential sentiment shifts. The accompanying chart displays the Ethereum Open Interest metric, which measures the number of open perpetual futures contracts across various cryptocurrency exchanges.\n\nHigher values suggest potential market volatility and trend sustainability, while lower values indicate a cooling off in the perpetual markets.\n\nThe chart shows a significant surge in Open Interest following a short period of sideways consolidation, highlighting increased futures market activity and more aggressive long or short positions. Depending on the direction of these positions, this suggests a potential notable price move in the short term. If the funding rates metric also rises, the market could be set for renewed bullish trends in the mid-term. However, heightened volatility may accompany this activity, so traders should exercise caution."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMi-gFBVV95cUxOTlh2R043cnZTUC16cTVYcXJuMlp3UTFuMmNUdllzTG5wek5LRVl3d1VWQ24tSEZqa2x6S1dLaDdNTXV2dEJwOWN2NHhLNXlrYnpQWnpraExWUENESzV3R2oyZ3AxMy1DMTk2WjNyVUp1OWtocnIyZ1U4N1ZnWDhPYW00T0puUHlzSWxmR010d1M1T2xsSVVHQ3pSVlMtZnBHRDNXSXMyanU1UjREdnU5eHBiaDFBc1hVd2RrX2REc1c0WWhEdVBvY094TXByX0hNZlR0MDY5RXpzMFQ4S2JKSVFoanp5a2k1RVpsMldKNUJGQ3BYZXFsdGF3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Bitcoin Climbs 10%, Ethereum 5%, and Furrever Token Promises 15X Returns: How Will the Market React? - GlobeNewswire",
        "content": "New York City, NY, May 20, 2024 (GLOBE NEWSWIRE) --\n\nInvestors are happy with this week as most cryptos surged during this period. Bitcoin climbed by an impressive 10%, and Ethereum followed suit with a 5% increase, signaling a strong bullish sentiment across the market. Amid these gains, Furrever Token has captured significant attention with its promise of up to 15X returns post-launch. As these developments unfold, the crypto community is abuzz with speculation on how the market will react to these exciting prospects.\n\nBitcoin Surged 10% in 7 Days: Optimism Amidst Market Momentum\n\nLast week proved remarkably optimistic for cryptocurrencies after a prolonged period of uncertainty. Despite higher-than-expected Producer Price Index (PPI) data, US inflation for April was reported lower, offering relief to risk markets previously jittery over fears of additional Fed interest rate hikes. Now, attention turns to upcoming data releases, particularly on employment and other economic indicators, until the June 12 meeting.\n\nLabor market figures are weakening, while the latest wage growth data has been supportive for risk markets. Overall, with inflation figures gradually softening over the past few months, the likelihood of further Fed tightening and prolonged peak interest rates diminishes.\n\nOn the front of spot Bitcoin ETFs, this week's data has been supportive for Bitcoin. We're now seeing inflows rather than outflows in the GBTC space, pushing ETF total value above $12.4 billion. If we witness renewed inflows in IBIT and FBTC spaces totaling hundreds of millions of dollars, it could signal a more impressive resurgence akin to the rapid ascent witnessed until mid-March.\n\nEthereum’s 5% Surge Caught Attention: Thrilling Market Outlook and Potential Catalysts\n\nEthereum (ETH) is presently valued at approximately $3,098.41, showing a slight decrease of 1.2% from yesterday while experiencing a notable increase of over 5% from the previous week. Despite Ethereum's recent performance, it has trailed behind Bitcoin throughout 2024, indicated by the ETH/BTC ratio hitting a three-year low of 0.044. However, following Ethereum's transition to proof-of-stake (the Merge), its correlation with Bitcoin has witnessed a decline of 45%, diminishing the probability of the much-awaited \"flippening.\"\n\nNevertheless, despite encountering hurdles, market sentiment remains cautiously optimistic. Analyst Michael van de Poppe suggests Ethereum is primed for an upward trajectory, particularly amidst adverse market conditions. Coinbase shares this positive outlook, emphasizing Ethereum's minimal supply-side pressures and the potential approval of a spot Ethereum ETF. Regulatory clarity, especially regarding the SEC's decision on the ETF, holds significant importance. While initial rejection is plausible, Coinbase contends that legal action could potentially reverse it.\n\nThe approval of a spot Ethereum ETF would signify a milestone, likely attracting increased institutional interest and investment in Ethereum, potentially elevating its price. The current ETH/BTC ratio, at a three-year low, indicates potential for growth should Ethereum narrow the gap with Bitcoin. Overall, market sentiment displays cautious optimism, with analysts anticipating Ethereum's resilience, particularly amidst potential regulatory advancements.\n\nFurrever Token Sparks Excitement in the Crypto Industry\n\nIn the midst of the recent market upswings observed in prominent cryptocurrencies such as Bitcoin and Ethereum, a fresh contender has entered the scene, drawing attention from the crypto community due to its distinctive allure and auspicious prospects. Furrever Token, characterized by its endearing feline-themed identity and intuitive interface, has swiftly garnered enthusiasm and intrigue among both investors and enthusiasts.\n\nFurrever Token stands out in the crowded crypto space by offering a whimsical and heart-warming experience that goes beyond traditional use cases. Its mission to integrate cute cat-themed stickers, emojis, and visuals into its ecosystem has resonated with a broad audience, making crypto engaging and fun. This light-hearted approach, combined with strong fundamentals, has helped Furrever Token carve out a niche in the market.\n\nThe tokenomics of Furrever Token are strategically designed to ensure growth and stability. With a total supply of 9 billion tokens, 65% allocated for presale, 25% for DEX allocation, and 10% for team allocation (locked for a year), the project demonstrates a commitment to security and longevity. The recent presale success, raising over $1.1 million and nearing the final stages, highlights the growing investor confidence.\n\nAdding to the excitement is Furrever Token's promise of up to 15X returns, a compelling proposition for those looking to capitalize on new opportunities. The ongoing $20,000 Highest Total Buys Competition further incentivizes participation, fostering a vibrant and engaged community. This competition ends on 27/05/24 at 12:00 UTC, giving investors a limited time to join the race for significant rewards.\n\nWith its current price at $0.000648 and exclusive availability on its official website, furrevertoken.com, Furrever Token is poised to make a significant impact. As the crypto industry buzzes with anticipation, all eyes are on how this charming newcomer will perform in the dynamic market landscape.\n\n\n\nJoin Furrever Token Presale Now:\n\n\n\nFurrever Token Official Website\n\n\n\nJoin $20,000 Furrever Token Giveaway\n\n\n\nJoin Official Telegram Group\n\n\n\nFollow Official X Account\n\n\n\nMedia Contact:\n\nRobert Smith\n\nhttps://furrevertoken.com/\n\nsupport@furrevertoken.com\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\n\n\n"
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxOSVZkNmVCUFpIbXJmbHZGVnBZeTRMNnZNbnNwWmZsUm8wUE9HcDRxUklwdDlUR2NrOXN4YTQ4eUVlamc1S3BVOXdtS1d5anFIUWZrN3h3ZmtYM2hqX2dWdlBXMkdTZHV6UkhuQVBCS2phV0NhUlpNa2xJUHlndTZsd2tVU01DSUVGMl8wRkdR0gGTAUFVX3lxTE8zSHlBX2o3Vk1DNHFXMVJtMG85dWkzdmp5MWg3ZkhHNlhlVXlHa1prc1dBUnNCOXc0TzZCM2xBX1NfOG0yRVZCNVJfQmxYSXdoUmh5WnBrNDQwTnNXOVZiazBOZzYzeFZqVC1Mc3F3VFVIcWlfb0E2MmtXcXYzWnlkTlk3ZVpuU1NreHBDNWU4bEVxYw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 May 2024 07:00:00 GMT",
        "title": "Ethereum sets sights on $4K: Will THIS spark a new rally for ETH? - AMBCrypto News",
        "content": "ETH was up by more than 6% over the last seven days.\n\nA few of the metrics suggested that the bullish momentum might not last.\n\nEthereum [ETH] caught investors off guard as its price gained bullish momentum on the 17th of May.\n\nWhile the token’s price moved up, it broke above a bullish pattern that could allow the king of altcoins to touch $4k in the coming days or weeks.\n\nEthereum eyes $4k again\n\nCoinMarketCap’s data revealed that ETH investors enjoyed profits last week, as the token’s price had surged by more than 6%.\n\nThings heated up in the last few hours as ETH’s value increased by over 2.6% over the last day. At the time of writing, ETH was trading at $3,108.31 with a market capitalization of over $373 billion.\n\nThe bullish price action had a positive impact on the token’s social metrics, as its Social Volume remained high last week.\n\nIts Weighted Sentiment also entered the positive zone, meaning the bullish sentiment around ETH became dominant in the market.\n\nThanks to the price uptick, ETH broke above a bullish pattern that hinted at a price rise towards $4k.\n\nWorld Of Charts, a popular crypto analyst, recently posted a tweet highlighting that ETH broke out of a falling wedge pattern.\n\nThe pattern appeared on ETH’s chart during the beginning of March, and since then, ETH has consolidated inside it.\n\nThe tweet mentioned that the breakout could result in a 50% price rise, in turn allowing Ethereum to reclaim $4k once again.\n\nWhat to expect in the short term?\n\nAMBCrypto then analyzed ETH’s metrics to see whether they support the possibility of it touching $4k anytime soon.\n\nOur analysis of CryptoQuant’s data revealed that ETH’s net deposit on exchanges was low compared to the last seven days’ average, signifying less selling pressure.\n\nAnother positive metric was the Coinbase premium, as it indicated that buying sentiment was dominant among U.S. investors. However, not everything looked bullish for the king of altcoins.\n\nAMBCrypto’s look at Glassnode’s data revealed that ETH’s Network To Value (NVT) ratio registered a sharp uptick. A rise in the metric suggests that an asset is overvalued, hinting at a price decline.\n\nEthereum’s Money Flow Index (MFI) also indicated a possible price correction as the indicator registered a decline. Nonetheless, the MACD displayed a bullish crossover.\n\nThe Chaikin Money Flow (CMF) also supported the bulls as it went northward.\n\nRead Ethereum (ETH) Price Prediction 2024-25\n\nTo see what targets it might reach if its bull rally sustains, AMBCrypto analyzed Hyblock Capital’s data. We found that ETH’s liquidation would rise near the $3.2k zone.\n\nA successful breakout above that would allow it to reach $3.5k in the coming days before it targets $4k. However, if ETH’s price turns bearish, then its value might plummet to $2.85k."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMi0wFBVV95cUxOajFFeWNmNEo4XzhjbTJSeUtIRXBPNmFTZTZXeFQxZkkzRVBxTE1aM0dpZGg0b2FfWmV0ZHV4S0ZhamxrZlIyaG9qYUVUcHRwaUFXUkFXSkxjTDgtUm1HUFNWdGxJSVY3STQtMFBPenRrLTdzTlUzNGc0M20yWXI4VG5LenN4c3R3ZncwZklFTVd1NFZ0Rll6UE9kZlExdlJwTkhBNlFlSjM4MHdPVnd2ZjhpZzRRUGZJeHRQUUVZRXpaSGQxNzNCMjBKV1dxZXVDeHI40gHYAUFVX3lxTE9WZDZBRDdVdjFkTUpZTGJhbl9KdDJaQWdxZXZjUnJMdGJGMUZYdGEtLVZFd0VzTnhrX3lFb2YxM1hJY0c5NWpmbGxHa1FzQnNOWmUtSzF3dnNSdDNsbmM1dTdMcFU5b0dqYmJJdnY0WWhndU9nTnByZUN6bU5PeXlENDZ6aDBLZ1BGdzY4a1ZjSV83NUsyRHd4VzVjTFhHU0ZpV0pNdjktczJrejQyeEJ5d2FzZ01scU9NMjF5UDdkdnVraXYzaG9MMDVha0UtX3BpX243TDRXSA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 May 2024 07:00:00 GMT",
        "title": "Analyst Says Markets ‘100% Underestimating’ Odds of Ethereum ETF Approval, Warns Top for Memecoins in Sight - The Daily Hodl",
        "content": "A closely followed crypto analyst thinks that market participants are too pessimistic about the odds that regulators will green-light a spot Ethereum (ETH) exchange-traded fund (ETF).\n\nPseudonymous analyst Altcoin Psycho tells his 501,800 followers on the social media platform X that people are not bullish enough on ETH right now.\n\n“Markets 100% underestimating odds of an ETH ETF.\n\nIt’s also underestimating the price impact it’ll have.\n\nBuying ETH under $3,000 pre-ETF will eventually be an obvious hindsight trade. Just like how it’s now obvious you should have bought Bitcoin pre-ETF.”\n\nData from the Ethereum-based prediction market platform Polymarket shows that only 13% of traders believe that an ETH ETF will be approved by the end of the month.\n\nLooking at the broader digital asset market, Altcoin Psycho thinks that market participants will eventually rotate their capital to blue-chip crypto projects at the expense of memecoins.\n\n“At some point all this scattered attention will narrow via a flight to quality, which also means a memecoin sell-off. I don’t think the cycle top is in but I think the memecoin top is not far away. Memecoins are a gateway drug not the end game, study past cycles if you disagree.”\n\nAs for the emerging artificial intelligence (AI) sector, the analyst says that while many are calling for the AI bubble to burst, he thinks it’s still in its earlier stages and set to become one of the biggest speculative manias ever seen.\n\n“Most say the AI bubble will soon burst, I’ll be the contrarian and say the bubble’s just starting.\n\nIt’s my highest conviction take since saying SOL at $15 was a must-buy…\n\n99% of AI startups will fail. When this happens, naysayers will prematurely claim victory. But once the dust settles, the surviving 1% will be so valuable that they’ll alone carry the bubble beyond any other bubble we’ve seen.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxQY3IxU3lwNEJEc2xIM2dUY3RMdnNyU2RRd2prWVFZTXJmbDBwWUNxci1QMDdUaG1CMVNzcUFCeGdyQ0xxa2VQSlV5a1JMay1BcmR6eVlncWVXSGFXM0p5NmEtanNDcWlxUGR6MzNNRVpielQ5T0xxZUFLd0d5WkwxY1VoVE5uVTdDZS1LWGNTYW8tNk10a2NKVXMzTzNZdEw5QjQ2QmFJakFWM0g1YXI4RUh5aUVBUzdvME9fc25TbXJSdkdpM1hFeC14MldRY3EtdEt4cXVLUFBjaTJtLW1wX2NTMWM1T0dj?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Bonk, Pepe Outstrip Gains Of Bitcoin, Ethereum Amid Searing Hot Rally — Beat Biggies Dogecoin And Shiba Inu In Trading Volumes - Benzinga",
        "content": "Memecoins took center stage on one of the best days for the cryptocurrency market, with the likes of Pepe PEPE/USD and Bonk BONK/USD turning out to be the highest gainers.\n\nWhat Happened: The market rallied on higher expectations of an Ethereum ETH/USD spot ETF approval by the SEC, resulting in the highest market cap growth in three months, according to Santiment.\n\nPrice Action: While the rally was spurred by developments around Ether, memecoins stole the highlight yet again, as popular coins like PEPE and BONK grew by 27% and 23% respectively, according to data from Benzinga Pro.\n\nEthereum ETH/USD-based PEPE rose to an all-time high of $0.000011, while the Solana SOL/USD-based meme coin BONK bumped to a two-month high of $0.000031. The rest of the meme coin market also reported significant gains.\n\nCryptocurrency Gains +/- Price (Recorded at 10 p.m. EST) Bonk BONK/USD +27% $0.000031 Pepe PEPE/USD +23% $0.000011 Floki FLOKI/USD +10.48% $0.000211\n\nPepe's trading volume surged to $2.16 billion in the last 24 hours, exceeding bigger coins with larger market caps like Dogecoin DOGE/USD and XRP XRP/USD, Bonk clocked a volume of $850 million, trumping Shiba Inu SHIB/USD\n\nWhy It Matters: The latest rally reflected a strong appetite for meme coins, the class of cryptocurrencies that has witnessed significant gains in the year.\n\nSocial analytics platform LunarCrush highlighted bullish social media discourse around the two coins, with 82% of all BONK posts, and 80% of PEPE posts being positively weighted.\n\nSuch degrees of optimism could potentially help sustain the rally for the two meme coins.\n\nImage via Shutterstock\n\nRead Next: Bitcoin, Ethereum, Dogecoin Shoot Up On One Of The Best Days For Crypto In 2024 Amid Ether ETF Approval Buzz: Analyst Flags ‘Robust’ US Investor Demand for King Crypto"
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxQOGRwVmdMSnRTVTJDX1c4X3NaMGVjVXl1bEJXY1VHRWh3X2p5YWdnYjF3ejN6ODAzUTZwZmJhcXRKU0JQZ0pwSzZIRTdJbi1OMmtoV1lGeFFjLVdjQi1JLTlMcktmODFfY29sUGV5NFQ1MWtjTHFMQV9LMmxnbkJsTExzcDFlNXdicWFmNV9xcFRiZDJ4eDc1NlkwamkwQ0swX3VVUWVnYkJNLWRBS3lsWGNBTQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Coinbase Reveals Optimistic View on Ethereum ETF Approval, Expert Weighs in - Crypto News Australia",
        "content": "Coinbase analysts are optimistic about Ethereum’s future, citing strong demand drivers and unique scaling advantages despite current underperformance.\n\nThey believe Ethereum maintains key strengths such as its Solidity community, EVM platform use, and crucial role in DeFi, supporting a strong case for the approval of spot ETH ETFs.\n\nDespite challenges, the potential for regulatory and market acceptance of ETH ETFs remains high, with a 30-40% chance of approval noted amidst growing political attention to crypto.\n\nDespite Ethereum’s relative underperformance compared to Bitcoin and the overall crypto market, Coinbase analysts hold a positive view toward the second largest crypto. They anticipate ETH could surprise investors with a better-than-expected performance later in the cycle.\n\nDavid Han, research analyst for Coinbase Institutional, wrote that they “believe that Ethereum has some of the strongest persistent demand drivers in crypto, and retains unique advantages to its scaling roadmap”.\n\nRelated: Analyst Who Sold All His Bitcoin Says He Hasn’t Lost Faith In BTC, Makes Bold Bet On Altcoins\n\nHan added that ETH can draw from its historical trading patterns, which indicate its dual benefit as both a “store-of-value” and a “technology-token”.\n\nAdvertisement\n\nDespite Solana being a potential threat to Ethereum and the potential for a Spot ETH ETF rejection in May, Coinbase still believes in the long-term outlook of the network.\n\nWe continue to believe that Ethereum’s long-term positioning remains strong and that it has important advantages that meaningfully distinguish it from other smart contract networks. David Han, Coinbase David Han, Coinbase\n\nHan adds that the strengths of Ethereum include the well-established Solidity developer community, widespread adoption of its EVM platform, the role of ETH as crucial DeFi collateral, and the robust decentralisation and security of its mainnet.\n\nAdditionally, upcoming advancements in tokenisation are expected to benefit ETH more than other Layer 1 blockchains in the near term.\n\n30-40% Chance of Approval, Says Analyst\n\nHan further believes that the approval of spot ETH ETFs is likely due to their potential to offer regulatory clarity and access to new capital, similar to previously approved BTC ETFs.\n\nThese ETFs would allow ETH to access the same capital pools as BTC, significantly benefiting its market position. The rationale behind the BTC ETF approvals, based on the correlation between CME futures and spot rates, is applicable to ETH as well, supporting a strong case for approval, the analyst wrote.\n\nWe believe the odds of approval are close to 30-40%. As crypto begins to take form as an election issue, it’s also less certain in our view that the SEC would be willing to front the political capital necessary to support a denial. David Han, Coinbase David Han, Coinbase\n\nDespite uncertainties, such as the SEC’s current non-committal stance and the unique challenges posed by Ethereum’s proof-of-stake mechanism, Han remains optimistic. Market indicators and political dynamics could sway the SEC towards approval, with potential reversals of initial rejections through litigation also likely, he concluded.\n\nMatt Hougan: Bitcoin ETFs Opened Doors for Crypto\n\nBitwise Asset Management’s Matt Hougan agrees with that analysis, saying the Spot Bitcoin ETFs have opened the door for crypto ETFs. Hougan told CNBC that the United States’ outdated securities laws don’t fit with the digital asset world – but in the end what everyone wants is a “safe, secure platform where investors are protected, and innovation is protected”.\n\nHougan added:\n\nWe’ve entered the ETF era for crypto. We’ve seen the Bitcoin ETFs come to market. We’ve seen the great things they’ve done for investors: lowering costs, improving regulation, improving sort of safety, security and peace of mind. I think we will get there on Ethereum as well. Matt Hougan, Bitwise Asset Management Matt Hougan, Bitwise Asset Management\n\nGet the most important crypto news delivered to your inbox by subscribing to the CNA newsletter"
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNOXh6TXFHRDU1TlFrZWw5eDNRSkxCQlFkYy1HU3Y5LU9RX29XRUxQUFY0MmdsYXA0Qzl2UWloRWdxRmhHR1dXTkJMZ01aZmkxdW1pbUVjZWk5cDlDZFdBUVE1Vmk1WGMyYVoxOU5UaFJlNFYxNmNFNUVKRklUM043VUZZVHNqOThobDhNNW8xOUdIZHlOLWFaeg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 May 2024 07:00:00 GMT",
        "title": "Could Investing $10,000 in Solana Make You a Millionaire? - The Motley Fool",
        "content": "Could Ethereum's rival generate major multibagger gains?\n\nSolana (SOL -1.70%) has minted a lot of millionaires since its launch in 2020. The cryptocurrency started trading at $0.95 and hit its all-time high of $260.06 on Nov. 6, 2021 -- which would have turned a $10,000 investment into $2.74 million.\n\nSolana was widely seen as an alternative to Ethereum (ETH -0.02%) for the development of decentralized apps. Solana's blockchain was faster, more scalable, and had lower transaction costs than Ethereum. It accomplished that by using its unique proof-of-history (PoH) mechanism to accelerate the proof-of-stake (PoS) mining method used by Ethereum.\n\nHowever, a series of network congestion and security failures caused Solana to lose its luster, and rising rates subsequently crushed the cryptocurrency market. To make matters worse, failed crypto exchange FTX hastily liquidated its Solana tokens in several huge auctions to raise more cash to pay off its creditors. As a result, Solana's price dipped below $10 by the end of 2022.\n\nYet Solana bounced back, reaching $163; your original $10,000 investment would still be worth $1.72 million. It was tough for investors to stick with Solana through those wild swings, but it's now the world's fifth largest cryptocurrency with a market cap of $71 billion. Could it keep growing and turn a fresh $10,000 investment to $1 million again?\n\nWhat's next for Solana?\n\nSolana's powerful recovery suggests it will remain a formidable rival for Ethereum as a platform for the development of decentralized apps and tokens. Its network has already been used to produce a wide range of meme coins, including notable ones like BONK (BONK 5.68%) and WIF (WIF 2.21%), as well as decentralized exchanges like Jupiter and Orca. The expansion of that ecosystem could make it a fertile environment for more crypto projects.\n\nNew decentralized wallets and financial apps could also help Solana (and Ethereum) disrupt traditional financial institutions. The introduction of Solana Pay, which was integrated into Shopify last year, marked a major step in that direction. Visa also started to run its stablecoin settlement program on Solana, while Circle recently added native Solana support for its EURC stablecoin.\n\nSolana Labs' subsidiary, Solana Mobile, even launched its own Saga smartphone last December. The Android device is still a niche gadget, but it targets Web3 enthusiasts with its integrated digital asset management and Solana blockchain tools.\n\nSolana's rapid expansion is impressive, but Ethereum is scrambling to match Solana's speed and scalability with its own network upgrades. In a recent essay, Ethereum's co-founder and chief architect, Vitalik Buterin, proposed the introduction of \"multidimensional gas fees\" which sound similar to Solana's variable project-by-project user fees across its \"local fee markets.\" If Ethereum closes that gap, it could throttle the long-term growth of Solana's blockchain ecosystem.\n\nHow much higher can Solana soar?\n\nSolana seems to have overcome its initial growing pains. It resolved the congestion issues caused by the market's feverish interest in non-fungible tokens (NFTs) in 2021, survived FTX's large liquidations, and still processes transactions faster than Ethereum. Developers are still launching new apps on Solana and promoting their new tokens with airdrops.\n\nHowever, it's tough to tell how much larger Solana's blockchain can grow as long as it's overshadowed by Ethereum's larger network. For now, CoinPedia estimates that Solana's price could hit $500 by the end of the year and $1,672 by 2030.\n\nYou should take those estimates with a grain of salt, but they imply that Solana will remain one of the world's top cryptocurrencies as it attracts more developers and becomes more widely adopted for mainstream payments. But even if Solana's price hits $1,672 by 2030, it would only turn a new $10,000 investment into about $100,000.\n\nTherefore, Solana might still have a lot of upside potential -- but it probably won't make you a millionaire by the end of the decade. It could also easily be cut in half before it generates bigger gains, so investors should brace for a lot of volatility."
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxOYnRHUjM2M0ZuMGF3S1dCQ1ZsbTBsX19zWkVBYnV0TUgtVmZZX0t5b3ZmdWE4YjBDQXRpQ3p4TERvc2JhcXFkUE1YcUJ4dUxiak5GcEZQVWpqdXZJMVZjU29QdXpBQnQzcFUwRHA0Q2RuLUdNdkFCeEFXcWpqbmNVZE1TS01qSmvSAYwBQVVfeXFMTzRicVl3bDJnNm9RWUg4enBBRTQtR0hxc1dkaDkxMzdoV1NHenEyNHg4a2FHQk5sblMwNktrQWRWeFkxQnlwbWFvUk1uaXMwbm1sQi1LU21LUzlXSTg1WTFLc3JWS2hNck0wR2tTa05OdjZXcXhya2VfdUhycEZ2aWk3c3VSMkZUdmxoNG8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Ethereum clears THIS key hurdle: What’s next for ETH’s price? - AMBCrypto News",
        "content": "Ethereum’s price only moved marginally in the last 24 hours.\n\nMarket indicators hinted that Ethereum’s bull rally might resume soon.\n\nEthereum [ETH] successfully broke above a bullish falling wedge pattern a few days ago. Since then, the king of altcoins has been on track and has earned investors profit.\n\nIf the trend lasts, then ETH has a long way to go.\n\nEthereum bulls are slowing down\n\nWorld Of Charts, a popular crypto analyst, recently posted a tweet highlighting how ETH managed to break out of a falling wedge pattern.\n\nThe token’s price has consolidated inside the pattern since March and finally broke out a few days ago. Since then, ETH seemed to be on the right track, as its price increased by almost 5%.\n\nHowever, this gain could just be the beginning, as the breakout has the potential to push ETH’s price by 45%. However, the last few hours showcased less volatility, which somewhat paused ETH’s gaining spree.\n\nAccording to CoinMarketCap, ETH’s price only moved up marginally in the last 24 hours. At the time of writing, ETH was trading at $3,131.77 with a market capitalization of over $376 billion.\n\nTo see whether this sluggish 24-hour price action could lead to a price correction, AMBCrypto checked Ethereum’s on-chain metrics.\n\nOur analysis of CryptoQuant’s data revealed that ETH’s net deposit on exchanges was low compared to the last seven days’ average.\n\nThis meant that selling pressure on ETH was low. Additionally, both its Transfer Volume and Active Addresses remained high, which was an optimistic sign.\n\nTroubles still persist for Ethereum\n\nThough the aforementioned metrics looked promising, a few of the others raised concerns. AMBCrypto’s look at Glassnode’s data revealed that ETH’s NVT ratio had increased sharply over the last few days.\n\nFor the uninitiated, the NVT ratio is computed by dividing the market cap by the transferred on-chain volume, measured in USD.\n\nA rise in the metric meant that ETH was overvalued, which indicated a possible price correction soon.\n\nApart from this, another key indicator looked bearish. Ethereum’s fear and greed index had a value of 83% at press time, meaning that the market was in an “extreme fear” phase.\n\nWhenever the metric hits such levels, it suggests that an asset’s price has high chances of dropping.\n\nTherefore, AMBCrypto planned to check ETH’s daily chart to better understand whether a price correction was around the corner.\n\nIs your portfolio green? Check the Ethereum Profit Calculator\n\nThe MACD displayed a bullish crossover. Additionally, ETH’s Relative Strength Index (RSI) registered an uptick from the neutral mark. Its Money Flow Index (MFI) also followed a similar trend.\n\nThese indicated that the chances of a major price correction were slim."
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMi2wFBVV95cUxNVVpJLTdXb1pQUl9iSk1KUXR1cENNZmpRLThmUXAtMTFtZ1R3M25rMTJubkt3NVQyRXNCXzFrblFRMXNGYjFrNEs3bnd6eHMxcFlSQ1lKT0VHNUJFZS1vZ2J1S1cxc2JWY2ZmbnlrRW5nX0t2bGc1dEVyVGMyX0Z5UmhOUDhsTndvSUJvdUhoSmhHRmZKdU56NC1WSFVkRE91akw3ZHVLR19BYWtTNTBwQ2toM1h3T2JWVTNyMVh4VlVtVTF1YWU5dU5XOHl0RnJtSHRVZmlMNHNGbzg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 May 2024 07:00:00 GMT",
        "title": "BlockDAG's Enhanced Dashboard and Strategic Roadmap Drive $28.3M in Presale, Outshining Ethereum and Polkadot - Techpoint Africa",
        "content": "As Ethereum and Polkadot face market struggles, BlockDAG is currently a standout in cryptocurrency, thanks to its cutting-edge dashboard features and articulated roadmap. This approach has successfully captivated investors, culminating in a substantial $28.3 million in presale.\n\nThe platform’s innovative dashboard, which includes features like current rankings and a leaderboard, provides critical insights and encourages competitive interaction among users. In contrast, Ethereum faces uncertain price predictions, and Polkadot continues to develop its smart contract capabilities. These elements position BlockDAG as a premier Layer 1 cryptocurrency with significant return potential.\n\nEthereum Faces Price Instability Amid Market Trends\n\nEthereum (ETH) is trading at $2,904, marking a slight decline over the past day. Ethereum remains trapped within a bearish pattern despite some bullish attempts, potentially indicating further drops. From a recent high of $4,000 in March, Ethereum has fallen by 31%, with the price stabilizing around $2,870—a critical support level now contested by bulls and bears.\n\nThe outlook for Ethereum remains uncertain as both the 50-day exponential moving average and the Relative Strength Index (RSI) appear to lean toward a bearish sentiment. A break below $2,870 could depress prices to $2,800 or even $2,200, making it crucial for investors to watch these levels closely.\n\nPolkadot Advances with New Smart Contracts\n\nPolkadot is enhancing its blockchain framework by integrating smart contracts through the ink! language, which facilitates the creation of robust, DOT-compatible applications. This move is set to tackle one of Polkadot’s significant limitations and drive its platform forward. With the Pop Network’s solution already operational on the Paseo testnet, Polkadot is preparing for its next development phase, including features to improve network efficiency and scalability.\n\nBlockDAG’s Dashboard and Roadmap Accelerate Market Impact\n\nBlockDAG's updated dashboard provides many features that enhance user interaction and offer valuable insights. Users can view their current ranking and the necessary purchases to advance, fostering a competitive spirit through a leaderboard that showcases top investors. Additional tools like transaction previews, referral tracking, and detailed personal profiles simplify investment tracking and enhance user engagement.\n\nMoreover, BlockDAG's ambitious roadmap is meticulously laid out in four distinct phases: initial development, expansion through strategic partnerships, the launch sequence, and finally, the closing of the presale leading to the mainnet launch. A key highlight of this roadmap is the X1 Miner app, designed to be user-friendly with functionalities such as a wallet, send/receive options, and a performance leaderboard. The app is geared towards easing the mining process and enhancing community involvement with dedicated sections for user interaction and streamlined onboarding.\n\nThese enhancements to the dashboard and roadmap have greatly appealed to investors, propelling the presale quickly through its phases. In Batch 13, priced at $0.008, the presale has successfully raised $28.3 million, demonstrating strong investor trust and the potential for significant returns.\n\nBlockDAG Sets a High Standard in the Crypto Market\n\nWhile Ethereum struggles with price volatility and Polkadot develops its smart contract infrastructure, BlockDAG is making significant strides with its innovative dashboard and comprehensive roadmap. These developments not only boost user engagement but also enhance BlockDAG's investment appeal, positioning it above established players like Ethereum and Polkadot. With a robust $28.3 million presale and over 9.2 billion BDAG coins sold, BlockDAG offers a promising investment opportunity in the blockchain space, poised for substantial future growth.\n\nJoin BlockDAG Now!\n\nWebsite: https://blockdag.network\n\nPresale: https://purchase.blockdag.network\n\nTelegram: https://t.me/blockDAGnetworkOfficial\n\nDiscord: https://discord.gg/Q7BxghMVyu"
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxPYVAxLUJXYnh5cG9DRXdJZjRoQkV1Rk5xUFZmdzQ0NGJ1RklFbnZMSENGMk51a0JrSHFRMkU1WEJ4RHlnR0t2c082Xzd3LTZ0Mm9zMGowQmRULXFqckZIaDVrcTg0d2NjRk0yT2wtdG42Y3BqRDd2X1o5Z1ZFb2Vhcg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "BREAKING NEWS: Did the SEC Approve Ethereum ETF? - CryptoTicker.io - Bitcoin Price, Ethereum Price & Crypto News",
        "content": "The cryptocurrency market is experiencing a significant surge as prices skyrocket, fueled by the anticipation of a potential game-changing regulatory approval. Over the past 24 hours, the crypto market has seen a remarkable gain of more than 6%, driven by reports that the SEC is poised to legalize spot ETH ETFs. This development has investors and enthusiasts buzzing with excitement and speculation.\n\nWhat is an ETF?\n\nAn Exchange-Traded Fund (ETF) is a type of investment fund that is traded on stock exchanges, much like stocks. ETFs hold assets such as stocks, commodities, or bonds and generally operate with an arbitrage mechanism designed to keep trading close to its net asset value, though deviations can occasionally occur. ETFs provide investors with a diversified portfolio of assets, which can be bought and sold throughout the trading day at market-determined prices.\n\nWhat is a Spot ETH ETF?\n\nA spot ETH ETF would be a fund that directly holds Ethereum as its underlying asset, rather than derivatives or futures contracts. This means that the ETF would track the actual price of Ethereum, providing investors with direct exposure to the cryptocurrency's performance. Such a product would offer a more straightforward and potentially safer way for institutional and retail investors to gain exposure to Ethereum without having to manage the complexities of owning and storing the cryptocurrency themselves.\n\nBreaking News: SEC to Approve ETH ETF?\n\nThe buzz around a potential SEC approval stems from recent actions by the regulatory body, which has requested exchanges to update their 19B-4 filings on an accelerated basis for a spot Ethereum ETF. Form 19B-4 is a filing that exchanges must submit to propose new rules or rule changes, including the listing of new financial products like ETFs. The accelerated review process indicates that the SEC is prioritizing the consideration of these proposals, suggesting that approval could be imminent."
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxPR2g5bFdEbWtxUm5HVnJ2WmRZamJSNnFSTC1ZSF81eEZ3b3hoUGt0dmI2VDFZcHBDQkRxcVhLSzdvdlhFQzdoclJWbkI0VjJ0OVR1MFJTNkt4eUZPUE1rTm9uVDhDWVpCTUR5NjJVYmlpa014eGtEREpGQWNhRTIwYUxnaTdFdllqS01XXw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Experts Forecast Ethereum to Surge to $10,000 Before Year-End - Coinfomania",
        "content": "2024 started with an incredible upswing for crypto tokens, like Bitcoin (BTC) and Ethereum (ETH), creating enthusiasm among digital asset users.\n\nHowever, Bitcoin’s anticipated Bull Run is not going as expected. As of August 31, 2024, BTC price is currently trading at $58,872.26, representing a 1.16% decrease in the last 24 hours, down 2.89% in the last 7 days, and an 11.59% decrease in the last 30 days. It is currently trading below the $63,500 support level, which it had held in the past few days.\n\nThe current decline can be attributed to macroeconomic pressure and reduced activity of the Bitcoin network. The US home price increase outpacing inflation and wages is adding pressure to the economy ahead of the election season.\n\nDeclining Bitcoin network usage due to a decreased investor interest is also another cause of the current BTC price plunge. In the last two months, the number of BTC active addresses has reduced to their lowest levels, signaling decreased retail activity. Although institutional investors and whales could be on the buying spree, data shows that there is a decreasing adoption by the broader audience.\n\nWhy Rajagopal Feels Optimistic\n\nCrypto enthusiasts are questioning how much further Bitcoin value might drop if it fails to find its $61,000 support levels. Cryptocurrency experts believe that if BTC maintains the $45,000 level and above, it could surge to $60,000 by the end of the year.\n\nRajagopal Menon, the vice president of India-based cryptocurrency exchange WazirX, believes that, amid current consolidation, Bitcoin is eyeing a breakout. Bitcoin eyes to rise past the $60,000 mark, before it enters the “parabolic phase” of another bull cycle, potentially pushing towards the $100,000 mark by the end of 2024. According to Rajagopal, if Bitcoin successfully breaks out from this level in the next few weeks, the flagship cryptocurrency could propel its way to $90k-100k. The $90,000 threshold is a significant milestone, as it is logical for BTC to pause around 90k, potentially surging above the level but hovering below 100k.\n\nDespite Bitcoin losing its steam to soar to greater heights, Perplexity AI, an AI-powered bot, recently stated some factors that could propel the token to experience another bullish trend by the end of the year.\n\nRegulatory developments and market sentient\n\nIn March, Bitcoin experienced a massive price rise due to its tremendous demand. The recent Bitcoin halving and approval of BTC ETFs led to increased optimism that the 2024 bull run would be remarkable and could eventually trigger the crypto to surge to the $100,000 target.\n\nWhile Bitcoin reached a new all-time high of $74,000 in March, it experienced a price decline in May and early June and consequently dropped under $50,000 in early August.\n\nAccording to Perplexity AI, Bitcoin could overcome the current slowdown on the condition that overall investor confidence and market sentiment improve.\n\nOn the other hand, Perplexity AI admitted that global regulators have continued to bring in tighter oversight of crypto assets across the world. The AI bot is optimistic that things could change after the upcoming US elections, especially if a pro-crypto candidate enters the White House.\n\nAdoption and the Global Economy\n\nPerplexity AI also believes that continued growth in Bitcoin adoption for transaction purposes and its integration into financial services and products could create a robust foundation for a bullish trend.\n\nLastly, the AI chart acknowledged that macroeconomic conditions, like interest rates and inflation, have historically affected the entire cryptocurrency market. The AI bot believes that a favorable economic condition could trigger an increased interest in alternative investments, like Bitcoin, to experience another bull run."
    }
]