[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxOa0QwY0lWTWRzcFJoaXZqUW54V09oTHlER2VyWm9WWmJJZnVZZ2sxZGtsVkpEc3ZCYWlPcUliemtYeGYyaHJHRGpKc3BRUkRLbWxtMkEzbjB5RkNqOTFyNW5uNGFEeElWMkg2ZkY0bUxQaU5GbzRYb29ocU9Gd0EwcFZIeU9zakw4M1JKTlZfQWJ2dGNGTmc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Price Predictions for 2024: Comprehensive Insights with MEXC Research - Yahoo Finance",
        "content": "MEXC\n\nSingapore , Jan. 12, 2024 (GLOBE NEWSWIRE) -- The cryptocurrency market is buzzing with excitement, especially after the approval of a Bitcoin ETF. This development has significantly sparked interest in Ethereum-based tokens, leading to a notable surge in their value. Ethereum's price, in particular, has reached its highest point since May 2022. Investors are optimistic about the possibility of an Ethereum (ETH) ETF receiving SEC approval, contributing to this upward trend.\n\n\n\n\n\nAdding to enthusiasm, Vitalik Buterin's recent proposal to increase Ethereum's gas limit further fueled the surge, with Ethereum's price surpassing the $2,600 mark for the first time since May 2022. This has set a promising stage for Ethereum price climbing towards the $3,000 milestone.\n\nTechnical analysis using Bollinger Bands on the daily timeframe supports this bullish perspective. Ethereum is currently trading at $2,655, having moved above the upper Bollinger Band at $2,539, indicating a shift to bullish market momentum.\n\nTo reinforce the prediction of Ethereum reaching $3,000, a significant challenge must be overcome: breaking through the psychological resistance around $2,800. Successfully navigating past this point could pave the way for Ethereum to hit the anticipated $3,000 mark.\n\nMEXC Research's collection of market insights reveals substantial growth in Ethereum markets, driven by strong buying interest. This trend suggests a possible broader upward trajectory in the cryptocurrency market, with Ethereum poised to benefit significantly from this momentum.\n\nRenowned experts have weighed in with their predictions for Ethereum's price in 2024:\n\n• Anthony Sano's Optimistic Forecast: Predicting Ethereum to reach an impressive $10,000 by 2024, Sano emphasizes Ethereum's unique staking feature and the likelihood of an Ethereum ETF introduction, which he believes will attract institutional investors.\n\n• Rekt Capital's Analysis: Suggesting a 22% increase, Rekt Capital believes Ethereum could surpass $2,600 if it maintains firm support at $2,274.\n\n• FieryTrading's Bullish Trend Prediction: Ethereum has maintained a bullish trend for over 1.5 years, according to FieryTrading, with the potential to reach $5,000 by late 2024 or early 2025.\n\n• Nikolaos Panigirtzoglou's Long-term View: The JPMorgan Managing Director highlights Ethereum's potential, especially with the \"Protodanksharding\" upgrade, projecting a price towards $8,000 by 2026 and possible outperformance over Bitcoin in 2024.\n\n• Michaël van de Poppe's Forecast: Anticipating a correction to around $1,900, followed by a rise to $3,400-$3,800 in early 2024.\n\n• Credible Crypto's Ambitious Predictions: Predicting ETH could reach a minimum of $10,000 and possibly soar to $20,000 in 2024, representing a substantial increase from its current value.\n\nStory continues\n\nSupporting these optimistic forecasts, data from Santiment Information indicates a significant increase in Ethereum accumulation by top holders. The top 150 self-custody wallets now hold a record-breaking 56.25 million ETH, demonstrating considerable confidence in Ethereum's future.\n\nIn conclusion, Ethereum's price predictions for 2024, as compiled by MEXC Research, range from a conservative estimate of $6,000 to a striking $10,000, heavily influenced by market sentiment and the anticipated introduction of an Ethereum ETF.\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, or intended as investment advice, financial advice, or trading advice. It is strongly recommended that you practice due diligence (including consultation with a professional financial advisor) before investing in or trading securities and cryptocurrency.\n\n\n\n\n\nCONTACT: Isabella Kensington MEXC marketing at mexc.com\n\n\n\n"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxNOTBGdGR3Wm9RdFZZeExDNHR6MmNBcVppeDhMblZORVBjaTlNcDZDSzhYR3JOZ1BQbGFBZnlzVDJuQm9GbDNaT3ZySGxFTU56ZWxlR0kzdmdvaFRQNmR4T2hfNUdZSGQ1d1c5V1VBTk00TVR6TW10c3NmVThZSk0xakVtQjdUZFlqS1c3V0VKMXg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jan 2024 08:00:00 GMT",
        "title": "Should You Buy Ethereum While It's Still Down? - The Motley Fool",
        "content": "A deeper dive reveals why Ethereum remains an overlooked gem in the crypto market.\n\nTo say Ethereum (ETH 0.21%) is down would be exactly correct. However, when considering the gains made among its peers during 2023, its 90% increase makes it feel like Ethereum more or less watched from the sidelines while other cryptocurrencies had triple-digit percentage gains.\n\nGiven its position as the second-most-valuable cryptocurrency on the market, it seems unnatural for Ethereum not to have had a more considerable jump. But all this means is that Ethereum has some catching up to do in 2024. Here's why Ethereum remains an attractive buy.\n\nThe smart contract pioneer\n\nEthereum's launch in 2015 altered the trajectory of crypto forever. Its novel smart contract functionality provided the foundation for developers to create innovative applications of blockchain technology that have now become common. Without Ethereum, things like decentralized finance (DeFi), non-fungible tokens (NFTs), stablecoins, and much more would not exist.\n\nAlthough newer cryptocurrencies like Solana and Avalanche provide similar or even superior capabilities today, Ethereum remains the clear-cut leader of decentralized innovation. Several metrics demonstrate Ethereum's dominance over hopeful competitors, but two in particular highlight just how tight the original smart contract blockchain's grip on the market remains.\n\nThe undisputed champion of the decentralized economy\n\nFirst is total value locked (TVL). Quantifying the total value of assets currently staked or locked in a particular blockchain, TVL is a metric used to compare the amount of liquidity within varying DeFi ecosystems. The thinking goes that the greater the TVL, the more robust and valuable a blockchain is. As a disclaimer, this statistic has some limitations, but it does a good enough job of leveling the playing field to make comparisons.\n\nToday Ethereum's TVL is worth roughly $31 billion and accounts for 55% of the TVL across all blockchains with DeFi capabilities. Solana has just $1.3 billion in TVL, and Avalanche has $856 million.\n\nThe distance separating Ethereum from competitors undoubtedly results from its first-mover's advantage. As the first smart contract-capable blockchain, it was the only option for quite a while. Yet even as competing blockchains have joined the DeFi race and attracted significant hype, none has been able to challenge Ethereum where it matters most.\n\nFollow the developers\n\nGoing beyond TVL, assessing the number of active developers provides valuable insights into a cryptocurrency's potential. Developers are key players, responsible for creating applications, fixing issues, and introducing new features -- all critical for the sustained success of a blockchain.\n\nYet again, Ethereum shines. As of the latest count in October 2023, Ethereum had twice as many active developers as Polkadot, and nearly three times more than Solana.\n\nEthereum's extensive developer community is arguably its most valuable asset, giving it a significant competitive advantage over other blockchains. With developers involved in day-to-day maintenance, further upgrades, and exploring new use cases, Ethereum is typically the top choice for new projects seeking a reliable blockchain.\n\nMost importantly, a robust developer community not only ensures long-term viability, but also attracts more projects. Since the value of most cryptocurrencies is tied to their utility, a blockchain supporting numerous use cases often commands a higher price.\n\nEthereum's value proposition today\n\nConsidering its lackluster performance in 2023, Ethereum simply holds too many advantages compared to other blockchains not to be a leader in the crypto market this year. With an expansive and flourishing ecosystem of tokens, decentralized exchanges, NFTs, stablecoins, and much more, Ethereum provides investors with unparalleled exposure to the burgeoning landscape of decentralized finance.\n\nAs it currently stands, Ethereum remains almost 50% off its all-time high of nearly $4,900. Considering its position as a DeFi leader and the likelihood of a looming crypto bull market, Ethereum holds plenty of upside for the upcoming year. While the rest of the crypto market focuses on newer or more glamorous blockchains, don't forget about Ethereum. It still has plenty of room to run.\n\n\n\n\n\n"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiaEFVX3lxTFBVeE5zbmtrT1E2SUE3OXdFZGNwZG9mUEVHNVM0dk4yek44SHZUWG5JMTdFaldCNWhqM3hBbFRyTnMtTkZxTGstUE1DTGJPS3ZkNE0xYWN4UkZsRVdqLTNiM3hsMFZydk1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Nodes and Clients Explained - LCX",
        "content": "Types of Ethereum Nodes\n\nThe Ethereum Node system functions according to the Point-to-Point network architecture. Three varieties of nodes exist:\n\nFull Nodes: A full node is tasked with the verification and validation of every transaction occurring within the network, in addition to upholding the blockchain’s state. In the event of a smart contract transaction, full nodes proceed to execute every instruction contained within the smart contract. It ascertains whether the execution of the smart contract is yielding the anticipated outcomes. Each of these nodes upholds an exact replica of the blockchain data.\n\nIt continues to receive locally stored duplicates of the entire blockchain, including its own transactions and retains the most recent transaction state. In the event of a smart contract transaction, full nodes proceed to execute every instruction contained within the smart contract. It ascertains whether the execution of the smart contract is yielding the anticipated outcomes.\n\nLet us consider a scenario in which individual A conducts a transaction with individual B, which is subsequently appended to the blockchain. Subsequently, the full nodes examine the transaction to ensure that it adheres to all Ethereum specifications. If the transaction fails to comply, they either append the specification to the blockchain’s current state or remove it. A transaction involving a discarder occurs when one individual transfers X ETH to another, but the recipient’s account now contains a lesser amount of ETH.\n\nArchive Nodes: Archive nodes are full nodes that have been configured with the “archive mode” option. In contrast to Full Nodes, which solely retain the most recent transaction state, Archive nodes preserve the complete blockchain history, commencing from the genesis block.\n\nWhen requiring blocks anterior to the most recent 128 blocks, the Archive node is utilised. For instance, an archive node is necessary to utilise functions such as eth_getBalance of a historic address and to interact with smart contracts that were initiated in an earlier stage of the blockchain.\n\nArchive Nodes require more than 6 Terabytes of disc space due to their unique characteristic, whereas Full Nodes require only about 500 Gigabytes. Thus, it can be deduced that archive nodes are not practical for the general public; however, they prove to be advantageous when it comes to wallet vending, block perusing, and chain analytics.\n\nLight Nodes: A light node, in contrast to a full node, retains solely the block header and not the complete current blockchain state. It is appropriate for devices with limited memory and computational power, as the maintenance of a light node requires minimal hardware investment, operating expenses, and technical expertise. Full nodes are required for light nodes to operate. These nodes are not required to perpetually operate or transfer substantial volumes of data to and from the blockchain. It offers a straightforward method for creating a wallet, particularly for novices. Solid-state drives, for instance, are financially incapable of storing the gigabytes of data that other nodes consume. However, it is indisputable that light nodes have certain limitations; for instance, the availability of the light wallet provider during critical periods cannot be guaranteed.\n\nWhat Is Ethereum Client?\n\nA software application that implements the Ethereum specification and establishes connections with other Ethereum clients via a peer-to-peer network is known as an Ethereum client. Inter-client communication on Ethereum is feasible provided that each client adheres to the reference specification and predefined communication protocols. Although these numerous clients are developed using different programming languages and by different teams, they all “speak” the same protocol and comply with the same regulations. They are consequently capable of interacting with and operating on the identical Ethereum network.\n\nThese exchanges occur among numerous clients in the network utilising programming languages such as Erigon (Go/Multi), Geth (Go), OpenEthereum (Rust), and Nethermind (C#,.NET). The Ethereum protocol, represented by the yellow paper, enables any user to execute a client and create a node.\n\nThe formal prerequisites that constitute the Ethereum blockchain set it apart from the Bitcoin blockchain. Bitcoin Core does not establish standardized behaviours that are mandatory for all Ethereum clients, in contrast to Ethereum. By utilizing a straightforward programming language and standardized documentation, Ethereum’s specifications enabled the blockchain to support non-interoperable software implementations of its clients.\n\nTypes of Ethereum Clients\n\nThere are three types of Ethereum Clients:\n\nFull Client: Full clients store the entire Ethereum blockchain, which, according to the most recent estimates, requires more than one terabyte of disc space and may take several days to synchronize. Complete clients facilitate the ability of interconnected nodes to perform every network operation, such as mining, validating transactions and block headers, and executing smart contracts.\n\nLight Client: Ethereum clients are not always required to retain all data; therefore, developers frequently employ “light clients” when data storage and performance are critical. Light clients offer only a fraction of the capabilities of full clients. By virtue of not retaining the complete Ethereum blockchain, light clients are capable of facilitating expedited delivery while simultaneously liberating space for data storage.\n\nThe functionality of a light client is modified to suit the Ethereum client’s requirements. For instance, light clients are extensively implemented in wallets for the purpose of preserving private keys and Ethereum addresses. Moreover, they oversee the broadcasting of transactions and smart contract interactions. In addition to exchange rate data and web3 instances embedded within JavaScript objects, light clients are also advantageous for Dapp browsers.\n\nRemote Client: A light client and a remote client are comparable. A key differentiation lies in the fact that a remote client does not maintain an independent copy of the blockchain or perform transaction or block header validation. In contrast, remote clients are solely dependent on a full or lite client in order to establish communication with the Ethereum blockchain network. The primary function of these clients is to operate as wallets for transaction transmission and reception.\n\nEthereum Node vs Ethereum Client\n\nEthereum Node Ethereum Client A machine running Ethereum client software is referred to as an “Ethereum Node”. A client is an Ethereum implementation that validates all transactions in each block, ensuring the network’s security and data accuracy. The three types of Ethereum Nodes are Full, Light, Archive, and Miner Nodes. The three types of Ethereum Clients are Full, Light, and Remote Clients. The Ethereum node operating system allows us to access the internet. The Ethereum client computer allows a user to access the node operating system.\n\nConclusion\n\nDelving into the intricate world of Ethereum nodes and clients reveals the backbone of this groundbreaking blockchain network. Nodes serve as the decentralized pillars, ensuring the network’s resilience, security, and decentralization. On the client side, the diverse array of Ethereum clients, showcases the flexibility and openness of the Ethereum ecosystem. As Ethereum continues to evolve and transition, understanding the nuances of nodes and clients becomes increasingly crucial."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiaEFVX3lxTE82cThJTWl5OU9mYmxsUlFsVnJoQmxwYzhkOEdNbC1YT1RraXl1d0F5LWNYaXZKX3FUdDJBb21ObW1vXzdoUU9LX3NpdzBZa3hab0hLMk1nblZKVko2ZGdhN1dYN0x2T1ph?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jan 2024 08:00:00 GMT",
        "title": "Buying the rumor paid off for spot bitcoin ETFs — and Ethereum looks to be next - Blockworks",
        "content": "Bitcoin ETFs backed by actual bitcoin finally hit US exchanges on Thursday after more than a decade of attempts. So far it’s done mostly nothing for bitcoin’s price.\n\nBitcoin briefly neared $49,000 after the spot ETFs went live but it has since shed about $3,000 to retrace by 6%.\n\nThat’s even slightly below where it was before the SEC’s social media hacker posted an authorized approval announcement about the ETFs on Tuesday, about 24 hours before legitimate confirmation.\n\nAny boon to the price of bitcoin seems to have come way earlier. Bitcoin traded around $25,000 before BlackRock filed for its spot ETF last June and rallied 20% within days.\n\nWith the post-BlackRock pump, bitcoin had reclaimed its pre-Terra implosion price.\n\nBitcoin would give up those gains in the weeks following. But by mid-October, a fake news tweet claiming the SEC had approved BlackRock’s bid set bitcoin on a major uptrend.\n\nThere was immediate volatility around the tweet — climbing $2,000 and down again within 30 minutes — but bitcoin ended up shooting nearly two-thirds in two months, from $27,700 to $44,000 in December.\n\nAt this rate, ether could soon overtake bitcoin for six-month returns\n\nAbout there it hovered until earlier this week. Analysts, researchers, traders and pundits were generally in consensus that the SEC would indeed approve spot ETFs for launch in the US, and come Monday bitcoin had jumped 8% to clear $47,000 for the first time in almost two years.\n\nAll things considered, the bitcoin spot ETF approval was massively front-run by those trading on the rumor. Anyone who bought bitcoin when word of BlackRock’s filing first broke last year would now be up by more than half.\n\nAnyone who bought bitcoin when the ETFs were officially approved would now be about even and could even be down slightly.\n\nHad they opted for ether, they’d be up to 8% in the green, as traders appear looking to frontrun the next potential wave of crypto spot ETF approvals in the US.\n\nBlackRock and other issuers including Fidelity, VanEck and Invesco Galaxy have filed for a spot ether ETF since lodging their equivalent bitcoin applications. The SEC has between late May and early August to make its first decision.\n\nRead more: Bitcoin and ether diverge after SEC’s bitcoin ETF snafu\n\nIn the meantime, markets seem to be waiting to find out exactly how much bitcoin BlackRock, Fidelity and other ETF issuers actually bought to back their respective funds after a busy day-one session, when more than $4.6 billion in spot ETF shares were traded in the US overall.\n\nIn and outflow figures would be the first indications of investor interest and could shed light on their potential influence on bitcoin prices moving forward.\n\nSome preliminary figures have been floated on social media but analysts warn they may not be totally accurate. Confirmed data is only expected to be completely accurate later in the day, or even early next week.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxOb1htaVZyMDZXbm9VQlJQQnlfcFdodU12ZHNoWlBJTWFmdy1NUUlGQmpybHpNQ09Ed1d1RHlBYkh3cExWR2t2VldjZWN6ZDNPcmQyOS1LVzlBU0xTbjVCeGhFSmpxQXB4VnRxVzBwdm1jWm0zaGZ6R3dZX3pBQUc5M09RVQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jan 2024 08:00:00 GMT",
        "title": "Liquid staking protocols: new era for Ethereum validators - crypto.news",
        "content": "Discover how Ethereum’s shift to PoS and liquid staking protocols transform blockchain technology and address the 32 ETH staking challenge.\n\nEthereum staking has revolutionized the way we use and interact with blockchain technology. With its security now relying on capital rather than computing power, Ethereum’s (ETH) shift to proof-of-stake (PoS) offers numerous benefits, including a reported 99% reduction in the network’s carbon footprint.\n\nHowever, it still presents several drawbacks, chief among them being the 32 ETH economic requirement for participants to run a dedicated node on the network.\n\nYou might also like: What is proof-of-stake (PoS)?\n\nLiquid staking protocols: what to look out for\n\nAs of January, 32 ETH is about $84,724. Not many would-be validators can easily afford that amount, especially in regions with lower incomes.\n\nAdditionally, staking funds become locked and lack liquidity, pushing stakers to join staking pools instead. These pools often prove more profitable than individual validators due to the advantages of smoothing effects, safety mechanisms, and insurance they offer.\n\nThe situation has led to a concentration of power on the Ethereum network, with a small number of stakers controlling a significant share of the blockchain. Since these entities hold most of Ethereum’s validator keys, it gives them full control over crucial aspects like block production, transaction censorship, and MEV (maximal extractable value) choices.\n\nBreakdown of top depositors on Ethereum | Source: Etherscan\n\nAnd as these pools grow larger, they gain more strength, eroding the core decentralization principles of Ethereum. As a result, there have been calls for more decentralized and pocket-friendly solutions to address this concern.\n\nThis is where community-driven liquid staking protocols come in. These platforms offer a new way to stake ETH and enjoy the benefits of staking while maintaining liquidity and flexibility. To shed light on this groundbreaking trend, we sat down with the teams behind three emerging liquid staking protocols: ether.fi, Diva, and Tenderize.\n\nYou might also like: Vitalik Buterin unveils major overhaul of Ethereum staking\n\nether.fi: unlocking liquid staking\n\nEther.fi team has pioneered a non-custodial protocol that enables users to stake their ETH holdings while keeping their private keys securely in their possession.\n\nether.fi business model | Source: ether.fi\n\nAmong the people associated with this project is Arthur Hayes, an investor who actively contributes to ether.fi through his family office, Maelstrom.\n\nYou might also like: Arthur Hayes dumps Solana for Ether, cites divine inspiration\n\nWhen we asked the ether.fi team about their target audience, they responded,\n\n“We cater to individuals who have a keen interest in staking Ethereum.”\n\nHowever, they also highlighted the regulatory uncertainties surrounding ETH staking in the United States. Consequently, ether.fi has temporarily geofenced U.S. users until the Securities and Exchange Commission (SEC) provides more precise guidance.\n\nYou might also like: Staking rewards are now taxable, says IRS\n\nThe ether.fi team prioritized security for their protocol, employing auditors like Nethermind, Omniscia, Zellic, and Solidified to enhance safety measures.\n\nEther.fi offers loyalty points and membership programs, providing rewards for users. The platform adopts a non-custodial approach, allowing users to maintain control over their keys, aligning with the principle of “Not your keys, not your coins.”\n\nTo tackle liquidity and volatility issues in staked tokens, ether.fi has made provisions for users to withdraw or trade their assets through the eETH liquidity pool.\n\nAs of Jan. 12, ether.fi was one of the major liquid staking protocols per the amount of ETH staked in the last six months.\n\nhttps://twitter.com/ether_fi/status/1745565800830763314\n\nDiva: another approach to liquid staking\n\nDiva, a liquid staking protocol that will be launched in 2024. Diva’s distributed validator technology (DVT) allows the entire network to perform validation, reducing the risks associated with centralization. Per developers, Diva’s security model, based on DVT, offers improved uptime and a diverse range of operators without requiring permission.\n\nDiva liquid staking model | Source: Diva on Medium\n\nIt provides an alternative to solo staking, which demands 32 ETH per validator and requires considerable technical expertise. Diva’s operator union model makes staking more accessible by allowing users to lock as little as 1 ETH while providing better rewards and flexibility, according to the protocol’s developers.\n\nThe platform engages its community through Discord channels, encouraging users to contribute to early testing and provide feedback. According to the team, the community plays a significant role in governance decisions, ensuring the protocol evolves in response to the needs and concerns of its users.\n\nThe Ethereum Shanghai upgrade has played a crucial role in accelerating the growth of liquid staking for ETH. This upgrade completed the circle for Diva, particularly by making liquid staking tokens (LSTs) fully functional. This functionality allows LSTs to trade closely to their fair value, significantly reducing the cost of providing liquidity in defi.\n\nYou might also like: Ethereum Shanghai upgrade for geeks: unpacking the tech side\n\nWith deep liquidity pools now more accessible, protocols like Diva may gain a competitive advantage over established players like Lido Finance.\n\nTo ensure the stability and liquidity of the stETH derivative token, Diva employs divETH tokens, which closely track ETH at a 1:1 ratio. This approach, combined with DVT-based security, is how Diva mitigates significant price deviations from ETH.\n\nThe protocol has also adopted a special approach to navigate legal challenges and ensure regulatory compliance globally. Instead of operating as a traditional company or platform, Diva positions itself as a pure software extension of Ethereum. Its immutable code, similar to contracts such as Wrapped ETH or Liquity, ensures that no central entity offers services or charges fees. Diva aims to establish regulatory equivalences by staking on Ethereum itself, simplifying compliance efforts.\n\nAt the time of writing, Diva has not yet launched. However, by offering an Operator Testnet Alpha and proposing a Pre-Launch Vault, Diva aims to encourage early commitments of total value locked (TVL) in ETH or stETH.\n\nhttps://twitter.com/divastaking/status/1737879212625719690\n\nTenderize: empowering validators\n\nTenderize is a liquid staking solution that allows any validator on the network to participate, potentially unlocking as much as $30 billion worth of crypto previously neglected in liquid staking.\n\nAccording to the Tenderize team, the platform has attempted to tackle issues of neglected assets by providing each validator with highly-liquid staked tokens, promoting decentralization in the ecosystem.\n\nTendirize ecosystem | Source: Tenderize website\n\nThe platform has a new upgrade dubbed Tenderize v2, and what sets it apart, in the words of its creators, is its self-custodial nature, which eliminates the need for intermediaries. It means users can swiftly exit staking through a native decentralized exchange (DEX), with the shared liquidity approach ensuring greater flexibility and liquidity access without centralizing stake on whitelisted nodes.\n\nMuch like Diva, the Ethereum Shanghai upgrade played a vital role in accelerating the growth of liquid staking for Tenderize, with the platform reportedly experiencing its fair share of positive impact.\n\nPrior to the upgrade, TenderSwap, a crucial component of the Tenderize protocol, faced limitations in facilitating unstaking. However, with the upgrade, users could unstake ETH, which paved the way for the launch of tETH through Tenderize v2.\n\nThe protocol emphasizes community involvement in its development, with Tenderize offering grants to validators and liquidity providers for their input and testing. The platform also involves token holders in governance decisions, such as fee and reward determination.\n\nIn liquid staking, addressing stability and liquidity concerns is crucial. Tenderize offers two methods for converting tTokens back to their original form.\n\nOne method is through TenderSwap v2, where users can exchange their tTokens (like tMATIC, tLPT, or tGRT) for the corresponding asset (MATIC, LPT, or GRT) at a 1:1 ratio, subject to a service fee. The alternative method requires waiting for the unstaking period to end, which varies by blockchain. Tenderize aims to maintain a 1:1 swap ratio on TenderSwap to manage price deviation risks and support user stability and liquidity.\n\nThe mainnet launch is scheduled at Jan. 29, according to Tenderize X account.\n\nhttps://twitter.com/tenderize_me/status/1745799023569879411\n\nLiquid staking protocols: the future of staking?\n\nEthereum staking represents a notable development in the cryptocurrency space, with various projects contributing to this trend. These projects enable users to stake amounts less than 32 ETH, supporting Ethereum’s transition to proof-of-stake.\n\nAdditionally, these projects offer methods for users to liquidate their staked assets without undergoing a full withdrawal process, enhancing the flexibility of cryptocurrency staking.\n\nProjects supporting ETH staking below the 32 ETH threshold provide an opportunity for users to participate in staking with smaller investments."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPTC12dXA4SUd2MUFnMzFtd1BCN1NmS3R0ME9OaTk1RzVvLWJCdnYweUg5cUNxTFlGeHVZZTJhSVNJTVJnT01EbjZnOFBnRFByTDhOLWpCTVBXb2h2eHRva3JIQnc0cDBMR3hpSmd0OEJ3Q2h6MEVLeERLcFk0dmVuTzl2SDNwQlRLS09J?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jan 2024 08:00:00 GMT",
        "title": "Top 9 Blockchain Platforms to Consider in 2024 - TechTarget",
        "content": "Interest in blockchain platforms has been growing significantly as a way to streamline supply chains, improve traceability, simplify trade and improve financial transactions. A lot of this interest started with the speculative frenzy surrounding Bitcoin, which is based on an older blockchain platform that faces challenges with energy consumption and speed.\n\nModern blockchain platforms have been developed to help overcome these limitations and provide practical value for other business uses and applications. \"We are seeing multiple enterprises adopt blockchain platforms for some of their application needs,\" said Suseel Menon, practice director at Everest Group, an IT advisory firm.\n\nMenon has seen the most interest in areas that require multiparty cooperation or data exchange. Blockchain applications in supply chain tracking, trade finance, digital assets and identity management are going beyond the pilot stage. Menon has also seen a fair bit of activity in using blockchain platforms for building certain functions of ERP, such as vendor management and supply chain management (SCM).\n\nAlex-Paul Manders, a partner at Information Services Group, an IT advisory firm, said the evolution of blockchain platforms to date has promoted heightened awareness of decentralized finance, or DeFi, for driving new business models that pose significant threats to traditional banking, finance and supply chain finance.\n\nAlex-Paul Manders Alex-Paul Manders\n\nManders predicted that blockchain platforms could disrupt legacy supply chain businesses and technology processes. For example, U.S. requirements for pharmaceutical companies to track and trace products and materials call for a new approach for supply chain participants to share and transact data more efficiently and with more transparency than previously required. Blockchain technology could be the answer.\n\nAccording to Menon, the top three blockchain frameworks for these use cases are R3 Corda, Hyperledger and Ethereum, with EOSIO and ConsenSys Quorum gaining ground.\n\nHere are nine of the top blockchain platforms to consider.\n\n1. Ethereum Introduced in 2013, Ethereum is one of the oldest and most established blockchain platforms. It provides a truly decentralized blockchain that is comparable to the Bitcoin blockchain network. Manders said its key strength is that it enables true decentralization with support for smart contracts. Its key weaknesses include slow processing times and higher transaction processing costs compared to other platforms. Besides its role as a blockchain platform that underpins enterprise applications, it has its own cryptocurrency called Ether. Suseel Menon Suseel Menon The Ethereum platform has seen widespread adoption by technologists who build decentralized applications, or dApps, on the Ethereum network. For example, there are numerous platforms and exchanges for non-fungible tokens (NFTs) -- a type of digital asset that can be exchanged on a blockchain. It has a mature ecosystem of tools for writing smart contracts using the Solidity programming environment, which runs on the Ethereum Virtual Machine. However, alternative blockchain networks can process transactions much faster at potentially lower cost than Ethereum, though many observers expect this to change after Ethereum adopts a more efficient security mechanism. It also has an active developer community orchestrated by the Enterprise Ethereum Alliance, which has more than 250 members, including Intel, JPMorgan and Microsoft. The Ethereum community migrated from a proof of work (PoW) consensus mechanism to proof of stake (PoS), which is more energy-friendly. The migration required an elaborate process to spin up a separate, new type of blockchain called a Beacon Chain that has been merged into the existing main Ethereum blockchain. The Ethereum Foundation estimated this reduces energy use by 99.95% compared to the older approach. The community was previously considering sharding, which involved splitting up the Ethereum blockchain to expand the capacity to store data, scale throughput and cut network fees. However, new techniques for combining transactions to be processed together, called layer 2 rollups, evolved faster than expected, and sharding was dropped from the roadmap. Now the community is focusing on a simpler approach, called Proto-Danksharding, which streamlines layer 2 rollups. The goal is to eventually support up to 100,000 transactions per second using this new approach. There are many things to consider when choosing a blockchain platform, including performance and cost.\n\n2. IBM Blockchain IBM Blockchain is a private, decentralized blockchain network that has been the most successful with enterprise clients who are less risk-averse, Manders said. He has seen the biggest opportunities in using it to link into enterprise cloud and legacy technologies more seamlessly than is possible in other decentralized networks. The IBM Blockchain developer tool was designed to be flexible, functional and customizable. IBM has also invested in creating a user-friendly interface to simplify critical tasks, such as setting up, testing and rapidly deploying smart contracts. Rakesh Mohan, IBM director of development, blockchain, said the company has seen significant progress in financial services and banking, as well as supply chain. Rakesh Mohan Rakesh Mohan Some examples of successful blockchain apps include IBM Food Trust, which has completed more than 18 million transactions representing more than 17,000 products, and Blockchain Community Initiative in Thailand, which supports services such as payment obligations and enterprise auctions for 22 Thai banks. IBM Blockchain Transparent Supply is designed to help enterprises improve traceability in supply chain management. Top features support quality assurance for validating the provenance of materials, improved forecasting and tools to reduce the cost of dispute resolution, product recalls and document sharing. Various tools help manufacturing, retail, pharmaceutical and consumer goods companies jump-start their blockchain rollout.\n\n3. Hyperledger Fabric Hyperledger Fabric is a set of tools for creating blockchain applications. Championed by the Linux Foundation, it was built from the ground up with enterprise distributed ledger uses in mind. It has a rich ecosystem of components that can be plugged into a modular architecture. It works well in closed blockchain deployments, which can improve security and speed. It also supports an open smart contract model that can support various data models, such as account and unspent transaction output (UTXO) models. Hyperledger Fabric can also improve data privacy by isolating transactions in channels or enabling the sharing of private data on a need-to-know basis in private data collections. It also enables high-speed transactions with low latency of finality and confirmation, according to its proponents. It is supported by leading cloud providers including Amazon Web Services, IBM, Google, Microsoft Azure and Oracle. Arnaud Le Hors, senior technical staff member of open technologies at IBM, said the latest developments add support for an organization to join a channel without copying the whole history of the ledger. This enables a quicker startup process with less storage required. There is an active and diverse community around Hyperledger Fabric that is working on adding more features related to consensus algorithms, additional privacy options for GDPR compliance and operational improvements. Key features to consider Blockchain platforms consist of a wide range of components, which enables enterprises to select the appropriate components for different kinds of capabilities, said Chris Georgen, founder and managing director at Topl, which built a blockchain for sustainability. Chris Georgen Chris Georgen Georgen recommended examining four features when evaluating platforms: Whether a platform is open (public) or closed (private) and how that affects speed and security. Anyone can join a public blockchain, which can make it easier to set up for small businesses. The downside is open blockchains aren't as fast. Many blockchain codebases can be modified to be either open or closed. Consensus mechanism, such as PoW, PoS or Byzantine fault tolerance. PoW is the older mechanism used in Bitcoin and Ethereum. The others are newer and less proven but faster and more efficient, Georgen said. Ledger technology and how it records transactions. Popular approaches include an account model and UTXO. An account model records the balance, whereas UTXO is analogous to cash with serial numbers. The account model is used in Ethereum, Stellar, Tron and EOSIO. IBM Blockchain, Hyperledger Fabric and Hyperledger Sawtooth use UTXO. Smart contract functions for capturing business logic on the blockchain. Popular programming languages include Ethereum Solidity, WebAssembly languages and Digital Asset Modeling Language.\n\n4. Hyperledger Sawtooth Another open source blockchain initiative hosted by Hyperledger and the Linux Foundation is Hyperledger Sawtooth. One of its key advantages is that it allows enterprises to choose from several consensus mechanisms for different use cases. One novel consensus mechanism called proof of elapsed time can integrate with hardware-based security technologies to enable \"trusted execution environments\" of program code to run in secure enclaves, which are protected areas of computer memory. It also supports practical Byzantine fault tolerance which can allow nodes to reach consensus if hackers or other bad actors compromise some nodes. Sawtooth Raft uses a leader-based consensus algorithm that provides crash tolerance for a private and controlled group of users. Shawn Amundson Shawn Amundson Shawn Amundson, principal consultant at Bitwise IO, said the most common applications are for developing supply chain systems and customizing Sawtooth for specific purposes, such as novel consensus algorithms. A Sawtooth library enables developers of custom distributed ledgers to pick and choose which pieces of Sawtooth they use in their application. Sawtooth also supports Splinter for networking, which provides dynamic private circuits (groups of nodes); Hyperledger Transact for transaction processing to enhance smart contract capabilities; and Augrim for consensus, which expands the number of supported algorithms.\n\n5. R3 Corda There is some debate whether R3 Corda is technically a blockchain or an alternative type of distributed ledger. It uses a novel consensus mechanism in which transactions are cryptographically linked but does not periodically batch multiple transactions into a block. Even the official Corda site describes it as \"both a blockchain and not a blockchain.\" One of the key benefits of this approach is that all transactions are processed in real time, which can improve performance compared to other types of blockchains. The R3 consortium has a strong following in the financial industry, since Corda provides an attractive approach for financial transactions and smart contracts with strong security. Leading proponents include Bank of America, HSBC, Intel and Microsoft. It supports tools that automate business logic that can execute across company boundaries. In 2022, the group launched a technical preview of Corda Payments, which it claimed will simplify the process for building distributed payment capabilities into apps. A recent platform update purportedly improves availability and scalability and supports interoperability with other platforms. One key innovation is a delivery-versus-payment mechanism designed to improve settlement with other distributed ledger platforms. Manders said Corda has a strong chance of becoming the de facto network of insurance-related transaction processing. However, it faces competition from other federated blockchain networks that can process transactions faster and cheaper.\n\n6. Tezos In development since 2014, Tezos is an older platform that supports decentralized applications, smart contracts and novel financial instruments, such as NFTs, which can be thought of as a modern variation on trading cards that are tied to digital assets. The platform supports a dynamically upgradable protocol and modular software clients that enable it to adapt to new uses. It supports a PoS consensus mechanism that improves efficiency compared to Bitcoin and the original Ethereum implementation. An on-chain upgrade mechanism allows developers to add new features without forking, which would require spinning up a new blockchain and migrating users over. The Tezos community has been upgrading the platform at a rapid clip with enhancements that improved performance and increased the size limit on smart contracts. It has also developed tools to help automate the process of weaving NFTs into enterprise supply chains. The latest update proposal, called the Oxford 2 protocol, promises several new enhancements. An improved PoS mechanism creates new roles for nodes. The update also reintroduces a new version of timelocks (which was previously removed), to improve security and smart rollups to speed up the transaction rate.\n\n7. EOSIO The EOSIO blockchain platform was first launched as an open source project in 2018. It's optimized for developing decentralized applications and smart contracts. It uses a complex consensus mechanism based on PoS that provides better performance than older mechanisms, such as Ethereum, according to its proponents. It also includes support for a governance feature for voting on changes to the platform. Key strengths include fast transactions and advanced account permission features for deploying applications. Over 400 applications have been developed on the platform, including identity management, SCM and gaming. The community also provides tools for customizing blockchain implementations for various decentralized use cases in SCM, healthcare and DeFi. EOSIO-Taurus, a new blockchain released in June, was forked from the EOSIO codebase and is designed for enterprise performance on private blockchains. It includes features to handle a larger volume of transactions more securely and to improve resilience, automatic failover and disaster recovery. In addition, it could make it easier to connect the blockchain to external systems. New debugging tools are meant to improve smart contract development.\n\n8. Stellar Stellar is a newer blockchain platform optimized for various kinds of DeFi applications. It uses Stellar Consensus Protocol, which purportedly can speed up the time required to process and finalize transactions on a public blockchain network. It also includes security mechanisms for shutting out bad or questionable actors in a financial transaction. It has been adopted by several companies for international trade and exchanging money across borders. Examples of applications built on the Stellar blockchain include MoneyGram for money transfer, Circle for payments and treasury infrastructure, and Flutterwave for integrating payment processing into enterprise applications. The Soroban smart contract platform helps streamline development of Web 3.0 and DeFi applications on Stellar."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxORXdqd3BTXzJBbGlieE9MN0ZraWVLTzJMNnFrZzEwWGxWc1hCM0s0R2JqYnFxTFBSZjROMUxOc3JzM2hjRHFLN2lVblUyeG9SaHNzVTlGeEJzYlFtTmh1Nk9GTG9LcG1RUU5YR2liejZOZWZqOER6S0U3NmhNRi16aVBlb0dSdXlVWnlsd1h0Tmo2RDJmYTRV?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin Drops 6.3% and Drags Ethereum and Dogecoin Down With It - The Motley Fool",
        "content": "Traders continue to sell the news of the Bitcoin ETF.\n\nThe approval of a Bitcoin (BTC -0.15%) ETF was supposed to bring billions of dollars into the crypto industry, but in typical fashion, investors bought the rumor and sold the news. As of 2:30 p.m. ET, Bitcoin is down 6.3% in the last 24 hours, and the selling accelerated early this morning.\n\nEthereum (ETH 0.21%) has rallied the last few days but dropped 3.7% between 10 a.m. ET and 2:30 p.m. ET. Dogecoin (DOGE -0.56%) plunged 3.9% in just the last few hours as well.\n\nBuy the rumor, sell the news\n\nThe Bitcoin ETF approval was months in the making, and when these ETFs were announced on Wednesday, Jan. 10, the market started to sell off. A lot of traders had bought in anticipation of the ETFs (buying the rumor) and then began selling when there was no longer a catalyst to count on in the future (sell the news).\n\nTo be fair, Bitcoin has been flat in the past week, Ethereum is up 10%, and Dogecoin is down just 0.4%. So there hasn't been a big move if you pull back a bit.\n\nI do think it's notable that Ethereum has gained as much as it has. The speculation trade has likely moved to the second-largest cryptocurrency, which could eventually be a popular ETF asset as well.\n\nTechnology takes it on the chin\n\nCryptocurrency doesn't trade in a vacuum, either. Over the last three years, cryptocurrency has traded with high-growth tech stocks, and they're having a terrible day.\n\nLayoffs at Cloudflare, Alphabet, Discord, and dozens of other companies are calling into question the growth we should expect for 2024. There's still a delayed realization in parts of the tech industry that growth is slowing and costs need to come under control if companies are going to be profitable.\n\nThis doesn't necessarily impact cryptocurrencies directly, but if cryptocurrencies trade with growth tech stocks, it's not surprising to see a sell-off.\n\nWhat we don't know matters most\n\nThe theory of the last few months in cryptocurrencies was that an ETF approval would bring new buyers into the crypto market, bringing billions of dollars with them. But will that be the case?\n\nIt seems to me that buying cryptocurrencies is easy enough for anyone who wanted to buy some over the last few years. An ETF may make it easier in some ways, but it also comes with fees that are unnecessary for cryptocurrencies you can hold in self-custody.\n\nI wouldn't be surprised if cryptocurrencies continue to fall as the market realizes that new money isn't coming in as expected following ETF approvals. And there's no increased utilization of the blockchain for innovative purposes if assets are held in an ETF.\n\nThis week has been more volatile than even a normal week in crypto. Don't be surprised if that's the theme for the next few weeks as the market figures out who is buying crypto to hold and who was just speculating on ETF approvals. There may be more speculation going on than investors would like to think."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE80RUhVY0xDX1drNWFLN2ZTWG1xNE1EX2lSRld1akhDbTVGdWt2Z3hSekJsQUZLTEJWdURJMjBjbmowMC05dTY4UUVoTmJJMDNFSTdMS2FzOWxYNUdOQ21tZnd6aTNZaGJNa01RUklXalE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jan 2024 08:00:00 GMT",
        "title": "Parallelized EVMs are gaining popularity, but they won’t scale blockchains alone - Blockworks",
        "content": "Improving technology for scaling blockchains requires tackling multifaceted problems. New attempts to parallelize the Ethereum Virtual Machine (EVM) have gained interest in recent weeks, as developers look for possibilities to increase transaction throughput.\n\nThe EVM is the execution environment that runs on Ethereum and its layer-2 rollups, and also has been adopted by other layer-1 networks such Avalanche, Binance Chain and many others, which use it to process smart contract code.\n\nIn typical EVM implementations, transactions are processed one after the other in the order they arrive. This simple approach can lead to longer processing times and higher costs when there are many transactions, explains Marina Guryeva, the CEO of Neon Labs, which is implementing the EVM as a smart contract on Solana.\n\n“For Ethereum, the traditional sequential execution model simplifies hardware requirements, but on the downside, it creates limitations in handling the increasing volume of transactions,” Guryeva told Blockworks. “This worsens during peak usage times resulting in longer transaction wait times, higher gas fees vis-a-vis demand surge, and an overall fractured user experience.”\n\nGuryeva said that much of the growing interest in parallel EVMs is due to its ability to tackle these challenges around blockchain scalability, addressing issues related to the blockchain trilemma.\n\n“The parallel processing approach addresses the longstanding challenges of scalability and transaction processing efficiency within the Ethereum network,” Guryeva said.\n\nMany transactions can be processed at the same time, instead of sequentially, so long as they don’t depend on each other.\n\nThere are other ways to achieve parallel processing, such as at the database-level with approaches such as sharding, that essentially divide Ethereum’s state into smaller “shards” but full sharding remains years away.\n\nRead more: Dencun and Pralectra: Ethereum core devs chart an ambitious 2024\n\nParallelized EVMs, however, including the likes of Sei network, Monad and Neon, are already production ready or nearly so. The Sei network launched its mainnet in August 2023 and has seen recent monthly trading volume of about $136 million with a little over 29 thousand active DEX users, according to data compiled by Flipside Crypto.\n\nIts native token, SEI, has surged from around $0.23 at the beginning of December to around $0.68 today — an almost 200% jump. Neon too, has seen a significant increase in its token price, with NEON trading from $0.50 on Dec. 1 to roughly $2.55 today.\n\nMonad has yet to launch and does not yet have its own token.\n\nA look into popular parallel EVM protocols\n\nMuch of the work being done on the Neon EVM is to bring the Ethereum dapps into the Solana ecosystem, Guryeva said.\n\n“It is a fully compatible Ethereum environment on Solana and allows developers to scale Ethereum dapps using Solana as the settlement layer,” she said.\n\nGuryeva notes that Ethereum remains the dominant blockchain that supports smart contracts and dapps, but Solana’s Sealevel technology — which enables virtual machines to process multiple transactions simultaneously through distributing transaction workload across multiple threads on a validator’s hardware — enables lower gas fees and higher scalability.\n\nJay Jog the co-founder of Sei Labs shares this sentiment, he notes that Ethereum rollups struggle to get over 30 sustained transactions per second, which limits the design space on the blockchain.\n\n“A parallelized EVM lets you get the best of Ethereum and Solana — the EVM and all of the mindshare/tooling around it and the fast execution environment that Solana offers,” he said.\n\nSei’s latest version has its EVM built into the chain, Jog added.\n\n“Sei uses Geth — the Go implementation of the EVM — to get full EVM bytecode compatibility. Geth is very battle tested and currently processes ~85% of [Ethereum] blocks,” he said.\n\nThis is different from its competitor Monad, which is creating a custom EVM implementation, Jog notes.\n\nDespite these differences, both Monad and Sei are using optimistic parallel execution to achieve parallel processing.\n\nWith this technique, virtual machines run in parallel on separate threads within the network computer. Each thread would execute transactions and generate what Keone Hon, the co-founder and CEO of Monad Labs, calls “pending results.”\n\nThese pending results track the inputs and outputs of the transactions which are then committed back into their original linear order. If any pending result has inputs that have been invalidated, then a transaction must be rescheduled.\n\n“This means that Monad still supports linear blocks and linear transactions within the blocks,” Hon told Blockworks. “Monad can basically take transaction formats that are exactly the same as Ethereum and then, under the hood, implement parallelism without any changes from the user perspective.”\n\nOptimistic parallel execution is different from what Solana uses, for example, where dapps have to pre-specify dependencies of the transactions, Hon said, analogous to the access list approach on Ethereum.\n\nParallelized EVMs are a stepping stone\n\nIt is important to note, Hon adds, that parallel execution is a small fraction of the bigger picture, with Monad’s more general mission being centered around accelerating EVM execution to make it as performant as possible.\n\n“The real bottleneck is actually the state access that all of those transactions are being run, they all have dependencies on state, and that state lives on SSD (solid-state drive),” Hon said.\n\nThe majority of smart contract work has relatively simple computation, he said, and bigger constraints for smart contracts are often the input/output component — the process of reading from the SSD and then writing back data.\n\nParallelism only cuts a small fraction of costs, according to Rachel Bousfield, the tech lead at Offchain Labs, because parallel execution is rarely possible in practice across current Web3 dapps.\n\nLoading Tweet..\n\nEthereum-like blockchains generally use commodity databases for reading and writing data. These have the advantage of being widely accessible, purchased “off the shelf,” but they are not optimized for the problem of storing the Merkle tree data, necessary for parallel processing on the blockchain, Hon notes.\n\nThis means that, fundamentally, in order to decrease transaction processing times and gas prices, infrastructure around the database will have to change.\n\n“So one of the other really major things that Monad is building is a custom state database from scratch that supports parallel access so that when there are many threads running in parallel, touching the database — to get inputs, or write outbacks back to it — those can proceed in parallel,” Hon said.\n\nMonad is not alone in focusing on alleviating state dependencies. Sei too, is working to make improvements in this area, Jog notes.\n\n“We are doing a lot of work on the state layer to improve state access, state commit, and state storage,” he said.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxOdHhZT20zcmU3YVk3NE5kS25iem5FNWdQd2dpdWJrMnZqcUhyVmM4dXkxVUZLb0JnaHpTU29taDY5YmJ4djluVjhWTThuWGJUZlRZNG9INGZZdTktRVdsTDhUQXl0NDNXbUMzT1l3aU1xSGEyekt1M1hrREpYUnh5NXRLcU_SAYoBQVVfeXFMT21tRWFuVGZUekxNc3dnNFlCVmNKOFdVYUp1cjcweGdCRGhYV2I0Qm1yS0VQNkFldk5PbjJQZThqUlVPUklxVVRIMkRqZkpOdTJYRU9UdzhqZ3kwd2lnMEFiYzA0NGpfTDM3ZU1ZR3NhYnFVQ0g3NXF3M19ySHk4Vk5zNGxwT0tKVkt3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jan 2024 08:00:00 GMT",
        "title": "Crypto Price Analysis Jan-12: ETH, XRP, ADA, SOL, and BNB - CryptoPotato",
        "content": "This week, we take a closer look at Ethereum, Ripple, Cardano, Solana, and Binance Coin.\n\nEthereum (ETH)\n\nThis week, Ethereum broke above the resistance at $2,500 and, in the process, increased by 14.7%. This is a spectacular performance, considering it came in the context of the Bitcoin ETF listing being approved.\n\nThis means Ethereum appears undervalued in the eyes of investors and maybe the next big cryptocurrency to be listed later this year.\n\nLooking ahead, ETH is found in a rally and may not stop until it reaches the current target of $3,000. The support is now at $2,500.\n\nRipple (XRP)\n\nXRP struggled this week and booked only a 3% price increase while many Ethereum-based tokens rallied in double digits.\n\nBuyers don’t appear that interested right now since most of the action was taken by the two market leaders, BTC and ETH.\n\nLooking ahead, XRP remains in a channel with key support at 54 cents and key resistance at 68 cents. Until one of these two levels breaks, major moves seem less likely.\n\nCardano (ADA)\n\nCardano’s correction ended this week, and buyers managed to re-test the key resistance at 60 cents. However, they failed to break it. Still, ADA booked a 4% price increase.\n\nThe support at 46 cents held strong, and if buyers persist, it may not be tested again as they have another go at the key resistance.\n\nLooking ahead, ADA remains competitive and appears keen to break higher. Watch the key resistance, as that will be decisive in where the price goes next.\n\nSolana (SOL)\n\nSolana failed to break the resistance at $104 and lost 3% of its valuation this week. This is a show of weakness, while other altcoins performed much better.\n\nIt appears that SOL had its moment in late 2023 and is now struggling to gather the same momentum. The support is found at $78.\n\nLooking ahead, as long as buyers can’t break above $104, Solana will have a hard time making new highs.\n\nBinance Coin (BNB)\n\nBinance Coin continues to hold well onto its recent gains but closes the week with a 3% loss. Despite this pullback, its price is still above $300 at the time of this article.\n\nThe nearest support is found at $260, and BNB may test it if sellers take over the price action.\n\nLooking ahead, Binance Coin is in an uptrend, with the most important target found at $360. If buyers persist, they could eventually reach that level after this pullback ends."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxORjJVS1A4a0t6NGVaM1M1WHUwRFZZVzVHa2Y2SDlIdk8zT2pnLVljRlhIS2hqR242cGRQVUVZcjhtWmg1YWRRaTd3U1BSdkx0ZE0wak1HQ0VBQ0FNUjkwNXBhUHczTjJfODFHeG9abjItMm44ZHJ4R09VQXE5RlVMeXR3NHcwRG5ZanVjblNIMDlBM1dwLVdBRDl3MWhhaTR4YmllT3VTSGYzVnZjN1hKbHNXRnVVLTZqeFFz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jan 2024 08:00:00 GMT",
        "title": "UK-based Blockchain startup Bitfinity coins $7M funding to incorporate Ethereum and Bitcoin - Tech Funding News",
        "content": "UK-based Bitfinity, a blockchain startup building a Bitcoin Layer 2 network, has secured $7 million in funding. This total investment came in two parts – $1 million in 2021 and the recent round of $6 million, which values the company at $130 million. The round was led by prominent investors – Polychain Capital and ParaFi Capital. It also saw participation from Warburg Serres, Dokia Capital, and Draft Ventures.\n\nThe funds will bolster Bitfinity’s efforts to integrate Ethereum Virtual Machine (EVM) capabilities with Bitcoin, potentially enabling faster and cheaper Bitcoin-enabled decentralised finance (DeFi) services. Also, it comes at a time when the mainnet launch is slated for either late January or early February.\n\nRevolutionises DeFi space\n\nFounded by Max Chamberlin in 2021, Bitfinity distinguishes itself as a Bitcoin scaling solution built on the Internet Computer protocol, offering compatibility with the EVM. It enables Ethereum developers to create Bitcoin-enabled decentralised applications (dApps) on the Bitfinity network. The Bitfinity EVM is touted to boast speeds 100 times faster than Ethereum. Some of the dApps that have joined Bitfinity include Sonic, Synthetix, and Liquity.\n\nThe innovative platform is currently in its testnet phase, aiming to revolutionize the DeFi space by enabling high-speed transactions at a fraction of the cost associated with Ethereum. Bitfinity’s solution boasts an impressive capability of processing over 1000 transactions per second (TPS), which could significantly outpace the current transaction speeds on the Ethereum network.\n\nAs per the company, the key component of Bitfinity’s technology is its Chain-Key technology, which is part of the Internet Computer Protocol (ICP)’s Threshold Relay consensus mechanism. This feature is designed to bolster security through a cryptographic scheme that refreshes key shares periodically, thus providing an additional layer of protection against potential security threats.\n\nBitfinity currently employs around 20 team members but plans to expand headcount to 25 following the upcoming mainnet launch. The hiring process aims to further enrich the project’s ecosystem by broadening its feature set.\n\nAdditionally, several cryptocurrency exchanges are expected to list Bitfinity’s native token after its mainnet debut. This presents an opportunity to improve liquidity and accessibility for the token."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxQQ2R6b3J3T2FmOXRUaUQxeko1aGFnb2VpcU1TSThoYXpHNUFwOExxYmRObXV6UmhQeUxTdEFYcXY1a29Da2NoWVpSeWRpRU0wajVqU0Q3RElva0xtVXozaGtIQlFBdkN1SThsY25mWlZYX2FKOGJOOFMwY2xYem15bXpyVDFzLVhHRFBjWjBjYW5LRklZS2c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jan 2024 08:00:00 GMT",
        "title": "Forget XRP: This Crypto Could Be Unstoppable in 2024 - The Motley Fool",
        "content": "Unlike XRP, Solana has a number of high-upside growth catalysts in place for 2024.\n\nAt the end of December, Solana (SOL -0.17%) flipped XRP (XRP 4.27%) to become the fifth-most valuable cryptocurrency. This capped off an impressive run for Solana in 2023. At one point, Solana was up more than 1,000% for the year.\n\nAll this has me thinking it's finally time to forget about XRP. The former crypto market darling is still bogged down in litigation with the Securities and Exchange Commission (SEC). Until that regulatory matter is cleared up, XRP shows no signs of breaking through the $1 price level. Contrast that to Solana, which now seems to have a very bright future ahead of it. Let's take a closer look.\n\nSolana is on pace to topple Ethereum\n\nThe primary investment thesis for Solana is that it is the new Ethereum (ETH 0.24%). Since 2020, crypto investors have been touting Solana as a potential \"Ethereum killer,\" and that scenario now seems to be finally playing out. While there are plenty of other Layer 1 blockchain challengers out there, Solana seems to be the one with the best chance of displacing Ethereum.\n\nSimply stated, Solana is a faster, cheaper, more efficient version of Ethereum. While Ethereum had to pull off a very complicated technical transformation (known as The Merge) to become an energy-efficient, proof-of-stake blockchain back in 2022, Solana launched right out of the box as a proof-of-stake blockchain. Whether it's transaction processing speed or overall transaction throughput, Solana seems to have the superior technology.\n\nGranted, the \"best technology\" does not always win. There are a lot of other factors to consider, including first-mover advantage and network effects. That's why Solana has taken nearly four years to finally catch up to Ethereum. But the investment narrative around Solana certainly seems to be shifting. A number of very smart investors -- including Cathie Wood of Ark Invest -- now seem to buy into the idea of Solana as a faster, more cost-efficient version of Ethereum.\n\nSolana has some big-time growth catalysts in place\n\nWhile Ethereum has been around longer than Solana, Solana has one thing Ethereum does not: a mobile crypto strategy. First announced back in the summer of 2022, this mobile crypto strategy has steadily been taking shape over the past 18 months.\n\nLast May, Solana finally launched the first-ever mobile crypto phone, the Saga. The goal of the crypto phone was to usher in a new mobile-first approach to crypto. Think about it -- today's smartphones are not crypto-native. They are designed for neither crypto users nor crypto wallets or for buying non-fungible tokens (NFTs) while waiting in line for a coffee from your favorite barista. So, Solana -- led by a talented team of former Qualcomm (QCOM -1.47%) engineers -- decided to change all that.\n\nThis mobile crypto strategy also includes a mobile payments component. In February 2022, Solana launched Solana Pay, a blockchain-based payment protocol for merchants who want to accept crypto at the point of sale. Again, this builds on a very intuitive idea: Some people want to pay with crypto, and most merchants want to avoid high credit card processing fees. As a proof-of-concept, Solana announced an integration with Shopify (SHOP -1.91%) at the end of August.\n\nYes, of course, these mobile crypto initiatives could absolutely fail. But they are the types of big-time growth catalysts that XRP simply does not have right now. As long as the legal drama with the SEC stretches on (which could be until the end of 2024), it's highly unlikely that XRP will be able to do much of anything in the U.S. market.\n\nAt the same time, the company behind the XRP token (Ripple Labs) is hemorrhaging cash to pay lawyers. According to Ripple executives, these legal costs could wind up being more than $200 million.\n\nBefore you dump all your XRP tokens\n\nWhile I'm highly confident that Solana could be an unstoppable crypto in 2024, there's also a chance that XRP could soar in price this year. Last summer, when XRP scored a major legal win in its ongoing SEC court case, the price of XRP doubled nearly overnight. So, there is upside potential. If you're currently holding XRP tokens, it could be worth waiting to see what develops.\n\nOver a long-term horizon, though, Solana appears to be a far superior investment. As soon as Solana flipped XRP at year-end, that should have been a wake-up call to XRP investors. It's finally time to look for a new crypto champion, and right now, that champion appears to be Solana."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxQczluXzgza1M0TGFNek9WenliT3Nwc1JaTUhQSTRVVExiUlhNdjFNbGxXTjduNFlXV0ZlSm1TOHNMZ1pydmdsX1BMT3ExYTNrYTJyNUozN2xqdU1LTnFRWTJQZzBGbXR0dllRQjJBQmtBbUFHOTI1UFNGTk5BU0pCR0lmS3BXaV9GQ1hyUUtDR1RfODhEU1pNY0J3clNjX0J3T0ZNZDhfaG85MndzcU1MaGdn0gG3AUFVX3lxTE1DT0w4UW5TS2dxdHpVNzZieGc1VlVnRmFKMnF5QTdRekkzSnlZOV9NWXkwMnJydzNqRUFQdS1tVEVfVE5QVVdHZnFBS0tqYU00TVkzeFNtb0M2NVIwU1pJLWliSHg2azdxQVJyQ29kb3pweGk3SS1jcUpPUHVsTkR1UWJTeWp5TVdSSFlZT2daYjdCc2RqT2ZJdEZUalJJaV9DWUFpTERCLXcybmdnTkFUdVBsdmgzbw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jan 2024 08:00:00 GMT",
        "title": "Cardano Outpaces Bitcoin, Dogecoin, and XRP In Wallet Growth As ADA Sees Heightened Interest - ZyCrypto",
        "content": "Advertisement\n\nIn a significant milestone for the Cardano ecosystem, Cardano (ADA) has emerged as a leader in wallet growth, outshining major cryptocurrencies such as Bitcoin (BTC), Dogecoin (DOGE), and (XRP).\n\nAccording to a post shared by on-chain analytics firm Santiment on Monday, the number of wallets holding ADA with more than zero coins surged by an impressive 38% over the past year, bringing the total to 4.5 million wallets. This places ADA ahead of other prominent cryptocurrencies, including XRP with a 26% growth, DOGE with a 22% growth, and even Bitcoin with a 32% growth in the number of wallets.\n\nNotably, the only cryptocurrency to surpass ADA in this metric was Ethereum (ETH), with a 54% growth and 112.1 million wallets.\n\nThese statistics indicate a growing interest and adoption of Cardano despite the ongoing struggle with FUD, as it successfully emerged from the harsh crypto winter.\n\nThat said, adding to Cardano’s momentum has been its robust development activity on GitHub. According to data shared on Friday by CryptoDiffer, Cardano was seen to have taken a substantial lead over Ethereum in December, with an average daily GitHub commit size of 449 compared to Ethereum’s 183, showcasing a 245% difference.\n\nAdvertisement\n\nThe implications of this active development are crucial for ADA’s market performance. As Cardano attracted more developers, there was a heightened expectation of increased demand and usage for its native blockchain token, ADA.\n\nTurning attention to price performance, despite a short-term price fall of around 17% over the past week, the cryptocurrency has shown resilience and potential for further growth after a 75% growth in the past year. Presently, ADA is exhibiting a bullish trend on the weekly chart after successfully converting the critical $0.45- $0.46 resistance zone into solid support.\n\nThat said, Cardano’s surge in wallet growth, coupled with its attractive development activity, growing community support and positive price performance, positions it as a cryptocurrency to watch in the coming months.\n\nAt press time, ADA was trading at $0.56, reflecting a modest 3.30% decrease over the last 24 hours. However, amidst this slight dip, the asset’s trading surged by an impressive 60%, reaching approximately $597 million during the same period, indicating heightened trader activity and market engagement."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMi8AFBVV95cUxNZGg2X2JhYlFJTWJSTmJCZnNPX3k2Y3ZvNVFfV0Z1aHBJcHNqMnI0Y2xiTmZFNTNHa25TWm9ZY2RLdm00U1J4ajU3Q1UxUHhxMVNjNGQ4aFdoSm00WUdDcmNTR01odmF0LWdNSEtFR3JHVTdxUGxDWFl1SVN0RDdMNHJ5NDhjelBTNWdpRTk4MXFqRUpZbnJ2MDZRRWlzcFlUSUJQYW1Ba1Ywc1RDYkthU3J4UFRUdmVON19URGRQRjJiTWYyenJhRHlWZndMcjZXLVlVbnJyZS01X20tRi1tYUNEWE1LR0l2bFpIbU5VRlnSAfABQVVfeXFMTWRoNl9iYWJRSU1iUk5iQmZzT195NmN2bzVRX1dGdWhwSXBzajJyNGNsYk5mRTUzR2tuU1pvWWNkS3ZtNFNSeGo1N0NVMVB4cTFTYzRkOGhXaEptNFlHQ3JjU0dNaHZhdC1nTUhLRUdyR1U3cVBsQ1hZdUlTdEQ3TDRyeTQ4Y3pQUzVnaUU5ODFxakVKWW5ydjA2UUVpc3BZVElCUGFtQWtWMHNUQ2JLYVNyeFBUVHZlTjdfVERkUEYyYk1mMnpyYUR5VmZ3THI2Vy1ZVW5ycmUtNV9tLUYtbWFDRFhNS0dJdmxaSG1OVUZZ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jan 2024 08:00:00 GMT",
        "title": "Best Cryptos in 2024: Top Cryptocurrencies Today Featuring ApeMax, Bitcoin, Ethereum, BNB, Solana, Ripple, Cardano, and Avalanche - - Disrupt Africa",
        "content": "The world of cryptocurrency saw a significant increase in activity in 2023, marked by notable price increases in major cryptocurrencies like Bitcoin, Ethereum, Solana and the introduction of innovative newcomers such as the Boost-to-Earn token, ApeMax.\n\nWith the arrival of 2024, the crypto market is preparing for what could be a game-changing year. The upcoming Bitcoin halving event in 2024 is expected to play a crucial role, as it has historically led to significant increases in cryptocurrency prices.\n\nTo provide you with a list of the top cryptocurrencies today, we’ve scoured the web, gathering information from trusted Web3 sources and top crypto charts.\n\nThe Ultimate List of Top Cryptocurrencies Today\n\nApeMax (APEMAX)\n\nApeMax has swiftly risen to prominence as a frontrunner in the meme coin arena. Its unique “Boost-to-Earn” staking feature allows token holders to boost their preferred entities and potentially earn rewards. The coin’s standout feature includes instant token access for eligible presale buyers, facilitating immediate staking opportunities.\n\nWith an ongoing presale generating heightened anticipation, ApeMax is positioned as a key player in the market, having gained 9,000 token holders and billions of tokens staked on the ApeMax platform already.\n\nBitcoin (BTC)\n\nAs the pioneer of crypto, Bitcoin continues to be the digital gold standard, boasting unparalleled security and decentralization. Bitcoin functions as a peer-to-peer electronic cash system independent of central banks. This week, BTC has reached $47,000 for the first time since April 2022.\n\nEthereum (ETH)\n\nMaintaining its status as the second-largest crypto by market cap, Ethereum spearheads the smart contract revolution. Empowering decentralized applications (DApps) and smart contracts, Ethereum’s robust infrastructure remains at the forefront of NFTs and Web3 gaming, solidifying its relevance in the crypto space.\n\nBinance Coin (BNB)\n\nBinance Coin, representing the world’s largest crypto exchange, has proven resilient even during bearish market conditions. Binance Coin is now trading at $301.15 with a market cap of $45 billion.\n\nSolana (SOL)\n\nSolana, a third-generation blockchain platform, utilizes PoS and PoH mechanisms to provide efficient smart contract functionality. Positioned as a potential “Ethereum rival”, SOL stands out for its high speeds, low costs, and overall efficiency.\n\nRipple (XRP)\n\nRipple’s cryptocurrency token, XRP, facilitates low-cost and instant cross-border fund transfers. Serving as a bridge currency for financial institutions to exchange both crypto and fiat currencies more cost-effectively, XRP remains a notable player in the crypto landscape.\n\nCardano (ADA)\n\nCardano, with its layered architecture and Ouroboros PoS consensus mechanism, focuses on scalability and security for smart contracts and DApps. Founded by Charles Hoskinson, a co-founder of Ethereum, Cardano continues to evolve with a market cap exceeding $18 billion.\n\nAvalanche (AVAX)\n\nAvalanche provides a decentralized infrastructure for building DApps and executing smart contracts. Distinguished by its use of subnets, Avalanche’s child chains offer flexibility in launching dedicated blockchains for diverse use cases.\n\nWhat Will be the Next Big Crypto in 2024?\n\nMany tokens, including newcomers like ApeMax, are garnering increased attention. However, predicting the next standout coin in 2024 is challenging. The dynamics of crypto, shaped by external influences, introduce an element of uncertainty to the trajectory of any given token.\n\nWill ApeMax Reach $1?\n\nThe potential $1 milestone by ApeMax remains speculative, with its value trajectory being subject to factors such as market demand and circulating supply. Despite these uncertainties, ApeMax stands out as a distinctive player in the crypto market, thanks to its ongoing presale momentum and innovative tokenomics.\n\nIn Conclusion\n\nAs we navigate through 2024, the crypto market shows signs of dynamism fueled by bullish sentiment. ApeMax, alongside Bitcoin, Ethereum, and other innovative coins, exemplifies the continuous creativity within the industry.\n\nHowever, it is imperative for crypto enthusiasts to conduct thorough and independent research and consider the associated risks and volatility of the crypto space. This article does not offer crypto or financial advice. For those interested in ApeMax, please be aware of geographical purchase restrictions, particularly in the US, Canada, and other restricted regions. Refer to the official ApeMax website for up-to-date information."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxNcUQzQTVxNVFTUHlVMU9MdTdNRXMwU3dockJONzJ4Mm5nRXZhRW5wV3pIc0JqMWV5S2NaRWFLNVFpZHpxWGlFSUhYUXgza0dvcXFwY1ppald3eExVSG5GVm81LTNHS1F5YlNhTEYtRWItSVctZHZPRWo5Nnlmb19HMVhTTU1Yc3ZWT2lrWmg2cmZ3SFVnYTZMbF9NYU54dHB1aGhDckFJaVFMQVF0bHlXa2JB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jan 2024 08:00:00 GMT",
        "title": "Optimism (OP) Earns High Praise from Vitalik Buterin for $100M Public Goods Initiative - Blockchain.News",
        "content": "Optimism (OP) Earns High Praise from Vitalik Buterin for $100M Public Goods Initiative Jessie A Ellis Ethereum Co-Founder Vitalik Buterin praised Optimism for distributing over $100 million in RetroPGF Round 3, emphasizing its role in funding public goods and supporting the Ethereum ecosystem.\n\nEthereum Co-Founder Vitalik Buterin has applauded the efforts of Optimism for their RetroPGF Round 3 initiative. This round saw an impressive distribution of over $100 million to 501 contributors, marking a pivotal moment for the funding of public goods within the blockchain space.\n\nOptimism's Innovative Approach to Funding\n\nOptimism has taken a novel approach to supporting the development of public goods through the Retroactive Public Goods Funding (RetroPGF) program. This initiative rewards contributions that have a lasting positive impact on the Optimism ecosystem and, by extension, the broader Ethereum network. The third round of this program, known as RetroPGF Round 3, was particularly noteworthy for its scale and impact.\n\nVitalik Buterin's Endorsement\n\nVitalik Buterin, a prominent figure in the crypto community, has recognized and praised the endeavors of Optimism. His comments underline the significance of funding mechanisms that support developers and contributors who are engaged in building public infrastructure, especially those who do so without a traditional business model. Buterin's commendation has brought considerable attention to Optimism's efforts and highlights the importance of funding public goods in the blockchain domain.\n\nThe Impact and Reach of RetroPGF Round 3\n\nIn RetroPGF Round 3, Optimism allocated 30 million OP tokens to a diverse group of contributors, including builders, writers, creators, educators, and other contributors within the Optimism ecosystem. These awardees were recognized for their contributions across four critical categories: OP Stack, Collective Governance, Developer Ecosystem, and End User Experience and Adoption.\n\nOptimism's Contribution to the Ethereum Ecosystem\n\nOptimism plays a crucial role in the Ethereum ecosystem by providing layer-2 scaling solutions. This technology enhances the performance of Ethereum by facilitating faster and cheaper transactions. The funding and support provided through programs like RetroPGF are vital for the continued growth and development of such technological innovations.\n\nDespite the positive news and Buterin's endorsement, the market response to Optimism's native token (OP) has been somewhat muted, with a slight dip in its value. However, this does not detract from the long-term significance of Optimism's initiatives for the Ethereum ecosystem.\n\nConclusion\n\nThe successful execution of Optimism’s RetroPGF Round 3 is a testament to the evolving landscape of blockchain funding and development. It not only demonstrates the potential of community-driven support mechanisms but also signifies a broader shift towards recognizing and valuing public goods within the blockchain space. As the industry continues to grow, the efforts of platforms like Optimism in supporting the backbone of the Ethereum network will likely become increasingly important.\n\nImage source: Shutterstock"
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMi-AFBVV95cUxNakMwMFBETE4xRHpLcnp2cVpFcW9rZXl1a0N0dW9wX19zcEJNZWZoTkhHdlBweldYOUc5Y0tZSGUzRVBISEdkcHJGcVpZdVVvRUlyeTFCRVZGaF9qNm4ySGRoZkwzMG12Q3MyTWV3UUdWSUYxS0IzMUJldFplZnpVNm8teW9yQlR1ZWNVYVVvWXJKaEFCbHBuZmZlcFJ3NDd6WEtlblVpUDA4WXBSMHVhRzhnd3FtYkNSSXNSZENTOUZreG5KdkItZHdYOUFGLUhxYUlxRkE0MkdBRnc4MWFuVzdXeDFPY1FxNF9YOXhFc3lyUW5kb1VjZdIB_gFBVV95cUxPU1U3anRBSlM4SzlCVFhvSVozc1R5SWRLUWV2QVpaVHNXcWQyQzVmR2R3WVU0NW1DZDJEMU5OSldNM1IxUVdCaFplbF9zUmRsNUw1V1U5U1lUZEhmSXlhUGNydVhxbUJGN3VOM0hRRUpnVURzTnBOcHhLSVhnaE5PalFELTBzSnlqbV8xZENhZ01Pa3lReGF4bXdITGNXY2JyS0JHa1dZaUNTNkdkbEhjNkdCRWd4WXQyRWZISDkwYWlib1gyaDdKa096cHFOVm1VR2tsMzItb29vUDJQdHNoV2VBUW05T1NiRDNYbUZYc1E3cmFqTWVDc0V1LXhpUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jan 2024 08:00:00 GMT",
        "title": "Cryptocurrency Price Today: Bitcoin Stable At $46K, Ethereum Remains Above $2.5K - ABP Live",
        "content": "Bitcoin (BTC), the oldest and most valued cryptocurrency in the world, briefly breached the $47,000 mark as the US Securities and Exchange Commission (SEC) approved BTC exchange-traded funds (ETFs). While this is considered to be a major win for crypto, it is largely being speculated that Ethereum (ETH) ETFs could be next on the table, as the coin touched a 20-month high of $2,500 before climbing up to $2,600.\n\nThe global crypto market cap stood at $1.76 trillion at the time of writing, registering a 24-hour dip of 0.25 percent.\n\nBitcoin (BTC) Price Today\n\nBitcoin price stood at $46,030.72, registering a 24-hour dip of 0.90 percent, as per CoinMarketCap. According to Indian exchange WazirX, BTC price stood at Rs 40.80 lakh.\n\nEthereum (ETH) Price Today\n\nETH price stood at $2,587.46, marking a 24-hour dip of 1.10 percent at the time of writing. As per WazirX, Ethereum price in India stood at Rs 2.29 lakh.\n\nDogecoin (DOGE) Price Today\n\nDOGE registered a 24-hour dip of 0.20 percent, as per CoinMarketCap data, currently priced at $0.08375. As per WazirX, Dogecoin price in India stood at Rs 7.46.\n\nLitecoin (LTC) Price Today\n\nLitecoin saw a 24-hour gain of 2.20 percent. At the time of writing, it was trading at $72.93. LTC price in India stood at Rs 6,400.\n\nRipple (XRP) Price Today\n\nXRP price stood at $0.5986, seeing a 24-hour loss of 0.66 percent. As per WazirX, Ripple price stood at Rs 51.92.\n\nSolana (SOL) Price Today\n\nSolana price stood at $98.67 marking a 24-hour dip of 2.12 percent. As per WazirX, SOL price in India stood at Rs 8,750.\n\nTop Crypto Gainers Today (January 12)\n\nAs per CoinMarketCap data, here are the top five crypto gainers over the past 24 hours:\n\nEthereum Name Service (ENS)\n\nPrice: $22.59\n\n24-hour gain: 24.84 percent\n\nSui (SUI)\n\nPrice: $1.07\n\n24-hour gain: 21.07 percent\n\nFTX Token (FTT)\n\nPrice: $3.07\n\n24-hour gain: 15.21 percent\n\nTezos (XTZ)\n\nPrice: $1.09\n\n24-hour gain: 14 percent\n\nEthereum Classic (ETC)\n\nPrice: $29.50\n\n24-hour gain: 9.25 percent\n\nTop Crypto Losers Today (January 12)\n\nAs per CoinMarketCap data, here are the top five crypto losers over the past 24 hours:\n\nBeam (BEAM)\n\nPrice: $0.01901\n\n24-hour loss: 9.12 percent\n\nAkash Network (AKT)\n\nPrice: $2.94\n\n24-hour loss: 7.26 percent\n\nLido DAO (LDO)\n\nPrice: $3.57\n\n24-hour loss: 6.76 percent\n\nWEMIX (WEMIX)\n\nPrice: $2.72\n\n24-hour loss: 6.16 percent\n\nInternet Computer (ICP)\n\nPrice: $12.82\n\n24-hour loss: 5.17 percent\n\nWhat Crypto Exchanges Are Saying About Current Market Scenario\n\nMudrex co-founder and CEO Edul Patel told ABP Live, “Bitcoin started with an upward trend, surpassing the $46,000 milestone and peaking at $49,000, only to experience a retracement that wiped out all gained momentum. Currently, Bitcoin consolidates around the $46,000 level, propelled by widespread liquidation of short positions across the market. Resistance is encountered at $47,300, with support maintaining a foothold at the $45,500 level. Optimism prevails following the recent launch of spot Bitcoin ETFs, and this positive shift is evident in the fear and greed index, indicating a market sentiment skewed towards greed. A market dynamic unfolds as bears and bulls engage in a battle for control.”\n\nParth Chaturvedi, Investments Lead, CoinSwitch Ventures, noted, “After the start of BTC ETFs with a whopping collective trading volume of over $4.5 billion on Day 1, BTC (-0.7%) briefly inched close to $49k, hitting its 13-month high. The largest crypto was showcasing a rangebound performance of around $46.5k before peaking, which was followed by selling pressure and its return to the initial range. Even though the volatility has increased, the investor sentiment around BTC seems to have further strengthened, with a revision in analyst predictions including Cathie Wood, ARK Invest's CEO. Cathie, who had previously predicted BTC’s price to reach $1 million by 2030, has revised her prediction to $1.5 million in a bullish scenario. Other entities, such as the Standard Chartered Bank continue to predict BTC prices to be close to $200k by the end of 2025.”\n\nRajagopal Menon, Vice President, WazirX, said, “Bitcoin (BTC) surged past $49,000, a level unseen since December 2021, as U.S.-based spot Bitcoin Exchange-Traded Funds (ETFs) began trading. The rally saw BTC climbing from below $46,000, peaking at $49,042 during the early U.S. trading hours. However, it subsequently retraced its gains, settling above $46,000 with a 1% increase over 24 hours. The ETF debut hasspurred significant BTC price volatility.”\n\nSathvik Vishwanath, CEO and co-founder of Unocoin, said, “Bitcoin recently surged to over $47,000, credited to the US Securities and Exchange Commission (SEC) approving 11 new Bitcoin ETFs. Despite stabilizing around $46,600, this marks significant mainstream acceptance of cryptocurrency. Grayscale Investments, which won an SEC victory, plans to transform its $29 billion bitcoin trust into an ETF, which could boost investor confidence. \"Rich Dad, Poor Dad\" author Robert Kiyosaki predicts Bitcoin will hit $150,000 after SEC approval and defends Bitcoin, gold, and silver amid inflation fears. The 4-hour chart suggests a positive trend, with Bitcoin potentially challenging the $47,743 resistance. However, a drop below $45,026 could trigger a bearish reversal, highlighting the importance of market sentiment.”\n\nCoinDCX Research Team told ABP Live, “In the past 24 hours, the overall market displayed volatility, especially after the launch of the BTC spot ETF. Notably, Spot Bitcoin ETFs achieved a trading volume surpassing $4.5 billion on their first day, indicating positive market sentiment. BTC touched a new higher high at $49,000 but experienced a quick drop to $46,000, influenced by higher-than-expected CPI data, which had a negative impact on the market. BTC dominance has been on a declining trend, providing room for altcoins to gain traction. ETH is positioned near the key level of $2,640 and is currently consolidating below that resistance. The key support level for ETH stands at $2,450.”\n\nSubscribe And Follow ABP Live On Telegram: t.me/officialabplive\n\nDisclaimer: Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Cryptocurrency is not a legal tender and is subject to market risks. Readers are advised to seek expert advice and read offer document(s) along with related important literature on the subject carefully before making any kind of investment whatsoever. Cryptocurrency market predictions are speculative and any investment made shall be at the sole cost and risk of the readers."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMi0wFBVV95cUxQdlFXaG85Mm9GTW5CMTQyN29Camh3NHZ2OF9Fb1pBWWwtQWQ4WHZQTjBKdHlOZHJZazNsX0trYWdFMDVnLWdSRzZWMzFSYzdubTRJZ3VXRTQ5TWl5d2pyM2xQVzlQUnduZHBrTkI2a1phaEYwNGxLS3dGSXZ0RHh0T3IxZ09UekpoUE1fNFFETzIyTlJLM2QyNDB6VzdaWjVSMnFFQW9hbUMyQzhIQ0tuWWNjemk5QzdzZTgwTWZBeGR2TTh0QU5TQVVwQk9FTDNaWFB30gHTAUFVX3lxTFB2UVdobzkyb0ZNbkIxNDI3b0JqaHc0dnY4X0VvWkFZbC1BZDhYdlBOMEp0eU5kcllrM2xfS2thZ0UwNWctZ1JHNlYzMVJjN25tNElndVdFNDlNaXl3anIzbFBXOVBSd25kcGtOQjZrWmFoRjA0bEtLd0ZJdnREeHRPcjFnT1R6SmhQTV80UURPMjJOUkszZDI0MHpXN1paNVIycUVBb2FtQzJDOEhDS25ZY2N6aTlDN3NlODBNZkF4ZHZNOHRBTlNBVXBCT0VMM1pYUHc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jan 2024 08:00:00 GMT",
        "title": "The Power of Community in Crypto: The Self-Sustaining Economies of Avalanche, Toncoin and Meme Kombat - - Disrupt Africa",
        "content": "From its beginning, cryptocurrency aimed to be the currency for everyone and this birthed the concept of decentralised finance (DeFi) where individuals have complete ownership of their money. This money is stored on personal devices without third-party overseers like banks monitoring or creating it and it’s the crypto communities that distribute and govern the currency.\n\nHowever, not all cryptocurrencies embody the qualities expected from DeFi. If a cryptocurrency fails to cater to the community’s needs, it risks falling apart. This is why critics believe Dogecoin (DOGE) is struggling to reach its $1 price target—due to a lack of community incentives for building a self-sustaining economy driven by community involvement.\n\nCryptocurrencies like Avalanche, Toncoin and Meme Kombat are successfully achieving self-sustaining economies. They offer enticing Web 3.0 ecosystems and passive income opportunities. The question is, which cryptocurrency stands out as the most enjoyable and profitable among this group?\n\nToncoin: The Crypto for Staking, Gaming, Collectibles and More\n\nToncoin (TON) stands as the native cryptocurrency of the TON network, creating a dynamic ecosystem designed to meet diverse community needs. Acting as the fuel for network operations, transactions and various activities like gaming and collectables—Toncoin powers the TON blockchain.\n\nA standout feature of Toncoin lies in its staking functionality, providing users with the opportunity to earn passive income by actively participating in network security.\n\nValidators stake their Toncoin to uphold the blockchain, ensuring its stability and security. This system not only enhances the network’s robustness but also rewards community members for their contributions.\n\nBeyond staking, Toncoin serves as a versatile asset. It acts as a processing fee for transactions and smart contracts and is used in payment services offered by applications built on the TON platform.\n\nMoreover, Toncoin plays a crucial role in TON’s on-chain governance program, empowering community members to actively participate in decision-making processes.\n\nGenerate Passive Income in Avalanche’s Dynamic Ecosystem\n\nAvalanche (AVAX) stands as a layer one blockchain positioned to compete with major players such as Ethereum, Cardano and Solana. With its architecture and impressive transaction output, Avalanche presents a compelling ecosystem where a community can earn passive income.\n\nUtilising the DeFi exchange platform Trader Joe, which is built on the Avalanche network, users can stake their crypto assets and receive JOE tokens as rewards.\n\nThis avenue for passive income has attracted numerous community members eager to benefit from Avalanche’s staking payouts. In contrast to its counterparts, Avalanche boasts higher staking rewards, with AVAX averaging an 8.55% yearly payout compared to SOL’s 5.5%.\n\nThe integration of Trader Joe with Avalanche’s ecosystem grants community members easy access to decentralised finance. This access enables participation in various DeFi activities such as yield farming and liquidity provision.\n\nMeme Kombat’s Unmatched Community Incentives in Crypto\\\n\nMeme Kombat (MK) is an Ethereum-based meme coin currently in its presale phase. MK aims to bring a blend of gaming, gambling, staking and decentralised finance (DeFi) into a singular platform that revolves around popular internet memes.\n\nOne of the standout features of MK is its approach to incorporating various meme types into its DeFi platform. Users can bet their native MK tokens on virtual battles between iconic meme characters like Doge, Pepe, Wojak and more.\n\nWinners not only receive payouts in MK but can also take advantage of the staking feature, enabling token holders to earn yields as high as 147% APY.\n\nMeme Kombat has witnessed remarkable demand during its presale, securing over $6.4 million out of its $10 million hard cap goal. The presale price, currently at $0.279, is subject to increase in subsequent stages until MK officially launches on Uniswap.\n\nReputable crypto analysts, including YouTubers Michael Wrubel and ClayBro, have recognised the project’s potential, with predictions ranging from it being the “next 100x gaming meme crypto” to potentially the “biggest meme gaming token of 2024.”\n\nMeme Kombat stands out by providing staking APY on presale purchases, currently at an attractive 156%. This strategic move mitigates the risks associated with early pump-and-dump scenarios, offering a more stable and sustainable growth trajectory.\n\nBeyond being a meme coin, Meme Kombat distinguishes itself by combining GameFi, GambleFi and AI utilities. The project’s core revolves around an AI-powered battle arena, where combats between various meme coin combinations take place.\n\nLeveraging the social media feud between meme coin communities, MK channels this rivalry onto its platform, driving organic demand for its native token.\n\nIn contrast to the anonymity often seen in meme coin projects, Meme Kombat’s team, led by Matt Whitman and based in the Netherlands, is fully doxxed and prioritises transparency. The project has completed all necessary security measures, setting a new benchmark for accountability in the meme coin space.\n\nAs Meme Kombat approaches its official launch, the project is positioned to create a unique space within the crypto community, combining entertainment, utility and a strong sense of community involvement.\n\nEmbracing Community Empowerment in Crypto\n\nThe success stories of Avalanche, Toncoin and Meme Kombat explain how thriving communities contribute to the creation of self-sustaining economies within the crypto space.\n\nToncoin’s dynamic ecosystem, driven by staking, gaming and collectibles, highlights the importance of community engagement. By actively participating in network security, users not only contribute to the stability of the TON blockchain but also earn passive income, reinforcing the symbiotic relationship between the project and its community.\n\nAvalanche’s ecosystem offers higher staking rewards and access to decentralised finance through Trader Joe. The platform provides a space for users to stake their assets and earn JOE tokens.\n\nMeme Kombat takes community incentives to the next level by infusing entertainment and competition into its DeFi platform. The project’s innovative approach to meme battles, staking incentives and transparent team practices set a precedent for responsible and engaging community development in the meme coin space.\n\nYou can enter the Meme Kombat presale on the Ethereum chain using either ETH or USDT. Alternatively, on the Binance Smart Chain (BSC), participation is possible with USDT. It’s important to note that $MK is set to be launched on the Ethereum chain. Therefore, if you choose to enter the presale on BSC, remember that you will need to claim your tokens on the Ethereum chain."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMi2wFBVV95cUxOazNibDlkd0E2d1BlUGJaVEdYeUwxWWhxa1lDSHViV3IzcDJQZ2xHV2xfeGNya0lQNzNieXBWVU1PRUh4Nmh2M2pQVFhodm9vdUQySFU5eF9DT2FRWFdfLW5jQzc4ektiUjN5MnFTZjVPZ3RwY0xtV3Z0RUpYbFFfY3lMYk5IZnl3dWM5NTkweVkza1R0R0Z2Z3Rud20yb2YzejF4YmI1cUh4cTBPaGlWTjVqUGJuNnliUzhsY3psc29ZcVo0ZFlyS0g4UFdKWTZlaEY1Qjhld0VFZTg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jan 2024 08:00:00 GMT",
        "title": "Investor's Top Crypto Staking Options in 2024: Earn Passive Income with Avalanche, Ethereum and Bitcoin Minetrix - TechCabal",
        "content": "Passive income generation is a constant pursuit for cryptocurrency investors. While traditional staking options like Ethereum (ETH) and Avalanche (AVAX) have been popular choices, a new contender has emerged with an intriguing Stake-to-Mine method – Bitcoin Minetrix (BTCMTX).\n\nCan Bitcoin Minetrix outperform the staking options of Cardano and Avalanche, leading to exciting possibilities for passive income in the crypto world?\n\n[ad]\n\nEthereum’s New Way to Earn Passive Income\n\nEthereum, the leading blockchain network, has recently embraced a significant change that opens up new financial opportunities for a wider audience.\n\nIn the past, Ethereum faced criticism for not shifting away from the Proof-of-Work (PoW) mechanism which they had used since inception. However, the network has evolved to embrace Proof-of-Stake (PoS), allowing users to earn passive income with a variety of cryptocurrencies.\n\nWith PoS, users can become validators by locking their assets into a pool for validation. In return for participating in the validation process, users receive interest in the form of staked rewards, creating a straightforward method for generating passive income.\n\nStaking not only provides a way to earn in bullish markets but also offers the potential to profit during bearish periods, as stakers can have their crypto ready to trade when the market becomes favourable.\n\nOne concern with staking has been the lack of access to locked crypto until the validation process is complete. Ethereum addresses this issue with liquid staking. When users stake ETH, they receive a liquid token version that can be freely traded while still allowing them to earn passive income through staking.\n\nThis innovative approach makes staking more accessible and user-friendly for a broader audience interested in exploring the world of passive income through cryptocurrencies.\n\nStaking Opportunities with Avalanche’s Trader Joe\n\nAvalanche, a layer-1 blockchain network launched in 2020, is stepping up to compete with well-known players like Ethereum, Cardano and Solana. While Avalanche might not claim faster transaction speeds than Solana, it distinguishes itself by offering higher staking payouts. AVAX boasts an average yearly payout of 8.55%, outperforming SOL’s 5.5% yearly payout.\n\nTrader Joe, a DeFi exchange platform built on Avalanche, offers a range of activities including token swapping, yield farming, staking, borrowing, lending and even featuring an NFT marketplace.\n\nUsers can passively earn JOE tokens, the platform’s native currency, by staking crypto to provide liquidity. Thanks to Avalanche’s appealing staking payouts, Trader Joe has become a go-to destination for those seeking to earn passive income that can be easily traded for various currencies.\n\n[ad]\n\nBitcoin Minetrix: A Simplified Path to Bitcoin Mining?\n\nTraditional Bitcoin mining involves complex hardware setups and high energy consumption, often keeping it out of reach for many crypto enthusiasts, but Bitcoin Minetrix aims to change this with its ‘Stake-to-Mine’ model, offering a user-friendly and potentially lucrative alternative.\n\nInstead of battling algorithms with expensive rigs, Bitcoin Minetrix lets you stake the project’s native token, BTCMTX. This unlocks access to cloud mining resources that do the heavy lifting, eliminating the need for technical expertise and hefty upfront costs.\n\nThis approach boasts several advantages:\n\nAccessibility: Opens Bitcoin mining to a broader audience, democratising the process and removing technological barriers.\n\nEfficiency: Eliminates the need for expensive hardware and reduces energy consumption.\n\nDouble Rewards: Earn two income streams – potential staking rewards of up to 87% annually and a share of the mining profits.\n\nSecurity & Transparency: The token-based system offers higher levels of decentralisation and security compared to standard cloud mining services.\n\nWith Bitcoin Minetrix’s features and user-friendly approach, it presents itself as a more efficient and accessible path to mining crypto than traditional Bitcoin mining methods.\n\nNew Choices for Crypto Passive Income: Stake-to-Mine vs. Staking\n\nAs the crypto market grows, so do the ways to earn passive income within it. Ethereum’s transition to Proof-of-Stake and the success of staking platforms like Avalanche demonstrate the growing demand for these options.\n\nBitcoin Minetrix adds a new dimension to this discussion with its Stake-to-Mine model, offering a simplified and more inclusive approach to Bitcoin mining. The innovative concept of earning Bitcoin rewards through staking BTCMTX tokens challenges the status quo and provides an alternative path for those looking to benefit from the potential crypto boom.\n\n[ad]\n\nWhile traditional staking methods provide a reliable means of earning passive income, the emergence of Stake-to-Mine models introduces exciting possibilities.\n\nFor those seeking substantial growth, directing your focus towards presale tokens such as Bitcoin Minetrix presents a strategic choice. This token carries the potential for a remarkable surge of 50x – 100x. As it approaches its final presale stage, now is a prime moment for investors to get in early.\n\nShare this article"
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxOaTBnb291emltMnp2ckw5V3JFMWpGWkotbUtfaGlOcFhjSDlxamFxMUdxaDlhcG9MU092N0RvcklaYTlIbXQ2V0RvV2tGM0k1WkEyc1pCbG1HUGdCQXRoSmdSYl9fMzN3c1BrVmdMYVNxcF9kYlllaWp4eS1qWERDNXpWWXZMcWhUVzFGZGU1TVp5a0RLOGxYTlJrM1MzR0xzXzFJeVJNMms?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jan 2024 08:00:00 GMT",
        "title": "What Canadian investors need to know about bitcoin ETFs - BNN Bloomberg",
        "content": "Ethereum ETFs could be next in the U.S.: Invesco-Galaxy partnership Steve Kurz, global head of asset management at Galaxy, joins BNN Bloomberg to discuss the launch of Invesco Galaxy Bitcoin ETF (BTCO). He believes crypto products will thrive in Canada and the U.S.\n\nBitcoin made headlines this week after U.S. regulatory changes made investing in the cryptocurrency more accessible – and experts say investors should be knowledgeable about the industry and understand the risks before diving in to cryptocurrency and related products.\n\nOn Wednesday, the U.S. Securities and Exchange Commission approved 11 exchange-traded funds (ETFs) that invest directly in bitcoin, with many opening trading platforms the next day.\n\nExperts and stakeholders believe the change is transformational for the industry and represents a major step towards legitimizing cryptocurrency.\n\n“It’s a big day for (the Grayscale Bitcoin Trust), its shareholders, and really the whole bitcoin and crypto communities overall,” Craig Salm, chief legal officer of Grayscale Investments, told BNN Bloomberg in a television interview on Friday.\n\nWith more people taking interest in bitcoin ETFs in light of the news, BNNBloomberg.ca spoke with Purpose Investments CIO Greg Taylor and Ninepoint Partners managing director Alex Tapscott to discuss what curious investors need to know about bitcoin ETFs.\n\nWHAT IS A BITCOIN ETF?\n\nAn ETF is a way for investors to add exposure to an asset, such as gold or oil, without actually owning the product. These ETFs can be traded just like shares of a company.\n\n“An ETF is an exchange-traded fund, which is like a mutual fund, but it trades with a stock, meaning you can buy and sell at any point in time of the day,” Tapscott said in the telephone interview.\n\n“It's a category that's grown very quickly for many investors who prefer the convenience and liquidity of being able to invest directly through an ETF.”\n\nThe big difference between ETFs and the actual currency is that cryptocurrency requires a crypto wallet to exchange, while ETFs are available to anyone with a stock account and can be bought or sold at any time through the stock trading platforms.\n\n“You have to open an account with a crypto broker or deal with a crypto exchange, and then once you actually purchase your real crypto asset, you have to find a way to store it,” Taylor said to explain the process of trading a cryptocurrency directly.\n\n“These are all different things which a lot of people just weren’t comfortable doing and didn't really want to.”\n\nWHAT OPTIONS ARE AVAILABLE IN CANADA?\n\nSpot-bitcoin ETFs have been available in Canada since 2021 and as a result, there are several options for Canadians to invest in.\n\nTapscott said there are about 20 different Canadian ETFs on the market, each with varying fees and levels of attractiveness. He pointed to Purpose Investments, CI and 3iQ as among the biggest companies with bitcoin ETFs on offer in Canada.\n\nCanadians can also access the new U.S.-based ETFs if their stock trading accounts have access to U.S.-based stocks.\n\nAdditionally, Canadians can buy ETFs in ethereum, the world’s second-largest cryptocurrency. Ethereum ETFs are not yet approved in the U.S., but they have been approved in Canada and some of these products are available.\n\nTaylor’s firm, Purpose Investments, current offers both ethereum and bitcoin ETFs, which are backed by the cryptocurrencies.\n\nHOW DOES THE U.S. REGULATORY CHANGE AFFECT CANADIAN INVESTORS?\n\nTapscott said the new U.S. regulations themselves don’t affect Canadian investors, but they could pressure Canadian platforms to lower their fees in order to compete.\n\n“If you're an investor, then you have the option to buy something that's got better liquidity and lower fees, I think you're probably going to make the switch,” he said.\n\n“It doesn't happen overnight. A lot of people are in these funds, they've got a taxable gain they’d rather not sell, but I think over time you're going to see money move away, or you're going to see the Canadian players forced to cut their fees to match what the U.S. providers are charging.”\n\nSome Canadian players are already lowering fees to compete with their U.S. counterparts.\n\nFidelity Investments, which is among the 11 to receive U.S. approvals earlier this week, recently dropped the fees of its Fidelity Advantage Bitcoin ETF account in Canada to 0.39 per cent.\n\nBecause Bitcoin ETFs trade like stocks, anyone with access to the New York Stock Exchange can invest in the U.S.-based ETFs.\n\nTaylor agreed that the U.S. market adds more competition in the space, but said he believes the Canadian products are best for Canadian investors.\n\n“We still think that the Canadian products are best in class and are always going to be offering investors exactly what they’re designed to,” he said.\n\n“We've had three years of trading basically at net asset value, so there's no premium or discount.”\n\nWHAT SHOULD INVESTORS CONSIDER WITH BITCOIN ETFS?\n\nTapscott said investors need to understand that all crypto investments can be volatile, but that volatility can be a “double-edged sword.”\n\n“Something can go up a lot or down a lot in any period of time, so there's the potential for gains but also for losses,” he said. “I think that people need to appreciate that before diving in.”\n\nTapscott added that he hopes people become educated in cryptocurrency before getting involved in the market, so they can make educated decisions about whether to invest.\n\nWHAT ARE THE POTENTIAL RISKS?\n\nVolatility remains the biggest risk when it comes to investing in cryptocurrency, and both experts agreed that investors should be comfortable with the volatile nature of the assets before investing.\n\n“It's more volatile than other parts of the market so people need to be wary that this is not something you make into the core of your portfolio, it’s something that you can use as a complement to your portfolio and maybe offer some diversification,” Taylor said.\n\nTapscott also cautioned that investors should be wary of potential compromises or hacks of the companies providing these assets.\n\n“That’s not something an investor can control, that's up to the issuer, like BlackRock or Fidelity, to manage in a prudent way,” he said, adding that while the possibility is remote, it’s something investors “may want to keep in mind.”"
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE1aaGlOQ3ZfcnRvc0lVdGxwam1YRlRkT2JQV2ppdEFIWkgtVUsxMjlyZldqcWFyVjNiTlF0OFlCOTlPRW4tMUtpajJwc1J6U2d1c0k1YUFvcEVKcDFiMy00NXJSTGdoWk1EbEpIcnZrTlUwM1VPMWYtbi16UdIBgAFBVV95cUxNaEYzZkF5dnEtRElpdGRSV2Zod29SSjcxemxtMVJLSjRXY1dxbU04cmpGbUtqNmxFbVJ0TVhKdlNNUzRwcTJHS0RuY0V0ZEk0dHJsMVF5elUwb1dEajlHU0xHa09jM1hXbzhZMU9ZLXpfQUNMS1d3Z1lrYjRBOVJfbw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jan 2024 13:04:36 GMT",
        "title": "Crypto Analyst Unveils Bullish End Of Year Predictions For Ethereum - NewsBTC",
        "content": "Crypto Expert Anthony Sassano has provided a bullish narrative for the Ethereum ecosystem. Based on this, he believes that Ethereum could hit a new all-time high (ATH) this year. The analyst also went as far as predicting what price level ETH could hit in particular.\n\nETH Could Rise To As High As $10,000 This Year\n\nSassano stated that ETH could hit $10,000 if the Ethereum Spot ETF hype were to get “ahead of itself.” These ETFs are believed to be next in line for an approval order by the Securities and Exchange Commission (SEC). That could explain why the crypto expert has handpicked them as the catalyst for this massive increase in ETH’s price.\n\nRelated Reading\n\nIs Cardano The Next Solana? Institutional Investors Clamor For ADA Exposure 8 months ago\n\nMeanwhile, even if the $10,000 price level isn’t attained, Sassano believes that ETH could still rise to as high as $6,000 before the year runs out. Before making these price predictions, he had explained why he was so bullish on the Ethereum ecosystem. According to him, Ethereum is going to gain a lot of interest from institutions because of the yield it affords them.\n\nEthereum, being a proof-of-stake network, provides an opportunity for investors to stake their ETH tokens and earn some rewards in return. This institutional interest in Ethereum is going to be further driven by the launch of Ethereum Spot ETFs, Sassano opined. He further suggested these yields will also give Ethereum an edge over Bitcoin.\n\nInterestingly, crypto analyst Altcoin Daily had before now stated that ETH hitting $10,000 was “programmed.” He alluded to the higher yields on the network as one of the reasons for his assertion. However, unlike Sassano, Altcoin Daily didn’t suggest a timeline for when the crypto token will hit this price level.\n\nETH price crosses $2,600 resistance | Source: ETHUSD on Tradingview.com\n\nIs The Market’s Attention Turning To Ethereum?\n\nETH rallied following the SEC’s approval of the Spot Bitcoin ETFs on January 10, while Bitcoin didn’t see much action. That could suggest that the market was already turning its attention to the Ethereum Spot ETFs. It also shows that the Bitcoin market was likely already priced in before the approval came in.\n\nRelated Reading\n\nCrypto Analyst Reveals Why $0.087 Is A Key Profitable Level To Watch For Dogecoin 8 months ago\n\nIf that is the case, the second-largest crypto token by market cap could begin to post some major gains ahead of a potential approval of the Ethereum ETFs in May. This would be something similar to what happened with Bitcoin, which resurged on the back of rumors involving the Spot Bitcoin ETFs.\n\nAt the time of writing, ETH is trading at around $2,580, down in the last 24 hours, according to data from CoinMarketCap.\n\nFeatured image from Cointribune, chart from Tradingview.com"
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE5Yc0ZjRUpOTkJWbjB6UTFYN0txend5aUhuWjdxX0FHYTJPOEhlY1I4RW9zSW5VeTE1cXFhUjRGRFRaUzhQaGF2WlZRMVBHOU9sNzAtVGFLM2tCbWx4dTA4UUVya2pnRTBpSnFTbVliZU81cm5pampwTdIBfkFVX3lxTE44S1JiZVlsOG1sX3BycmVJTGFab0ZySlZfYnhCdE02YUROampLYmZjclpIVEZ2UUN6NlA3U0VqMXBTdmpmSy1OMHVMbEFXOVBhRGNYTjdPbElKUVpMSjlPUF9CSWl1bTRxcE9pOWo2ZmpoSTVfcnU0OHRRamY2QQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Bloodbath Incoming? Celsius’ $125 Million Move Threatens ETH Price - NewsBTC",
        "content": "The Ethereum price might be doing well post-spot Bitcoin ETF launch, but recent moves by Celsius threaten to destabilize the price movement. The now-bankrupt crypto lender seems to have begun its reimbursement plan to its creditors, as on-chain data reveal the movement of its ETH holdings to crypto exchanges.\n\nAccording to crypto market intelligence company Arkham Intelligence, Celsius Network carried out transfers worth over $125 million worth of ETH last week to various crypto exchanges.\n\nCelsius Transfers ETH To Exchanges\n\nData shows that between January 8 and January 12, Celsius executed transfers worth $95.5 million to crypto exchange Coinbase while also sending $29.73 million to FalconX. At the time of writing, Celsius Network’s balance sheet has 584,601 ETH worth $1.47 billion. Notably, it also has 9,799 BTC worth $418.2 million and 659 million CEL tokens worth $133.2 million on its books, among other cryptocurrencies.\n\nRelated Reading\n\nBitcoin Hashrate Hits New All-Time High Amid Spot ETF Frenzy 8 months ago\n\nLooks like Celsius took the opportunity to unload >$125M of ETH over ETF Week. In the past week, they’ve deposited $95.5M to Coinbase and sent $29.73M to FalconX. They still have $1.4 billion (540K ETH) remaining.https://t.co/jp1PJbN46r pic.twitter.com/xgfX6yU5Ye — Arkham (@ArkhamIntel) January 13, 2024\n\nCelsius’s motive behind the transfers into exchange points to nothing apart from an intending selloff, as the company is well on its way to clearing its liabilities under bankruptcy proceedings.\n\nCelsius filed for bankruptcy in July 2022 shortly after the fall of TerraUSD and the LUNA ecosystem, leading to creditors having their funds trapped on the platform for the last 18 months. However, the defunct crypto lender has been making major moves in its bankruptcy proceedings to refund creditors. According to reports, the company sold $240 million worth of ETH in December 2023.\n\nNotably, the company communicated its decision earlier this month on January 5 to unstake $465 million worth of Ethereum (ETH) which will be distributed to its creditors.\n\nETH price shows strength as new trading week opens up | Source: ETHUSD on Tradingview.com\n\nIncoming Ethereum Price Crash?\n\nEthereum is currently on a roll, still on a 13% gain in the past seven days. However, huge selloffs like this tend to shake market confidence, leading to a sell-off from other investors. On the other hand, some tend to believe that the crypto is sufficiently resilient.\n\nRelated Reading\n\nHow To Buy, Sell, And Trade Tokens On The BSC Network 8 months ago\n\nIt’s important to note that Ethereum retained its bullish sentiment during the time these transfers were made, as price action revealed a 23% jump from $2,191 on January 8 to $2,706 on January 12. Ethereum has declined since then and is now trading at $2,514. According to Coinglass, $23.84 million worth of ETH positions were liquidated in the past 24 hours.\n\nDespite the recent large transfers, Celsius still retains significant cryptocurrency assets including ETH, BTC, MATIC, and LINK. A decision to continue the selling off of these assets could lead to a bigger dent in the price of the assets, particularly Ethereum, which is now testing the $2,500 support level.\n\nOn-chain data from Spotonchain also reported FTX and Alameda Research moving 1,000 ETH worth $2.33 million to crypto exchange Coinbase during the week.\n\nFeatured image from The Daily Hodl, chart from Tradingview.com"
    }
]