[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxOOE9EV3J4VkRLMnVQQWxWMnVMVEwxUV85bmdpeTNRUFFGck1oTGh1N044N0l2RWFJOGdMWXBiSWROZ3J4dDAwRU1sTmVsamFENmxqNmRaOUQ3UnNvWFliOXNQbmNYZGNaTGczZ2xaOGRhMi1nMk04TmNmQzFsSTlxeldoa0FyM0VfV3c2QjJBNFcwTkFINUZIRzdJLUpzWThGamcxa2VfWGlMdnEyeFFDSnZkb3dzX0RzWGRIVUZB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jul 2024 07:00:00 GMT",
        "title": "Invesco and Galaxy to Launch the Invesco Galaxy Ethereum ETF (QETH) - PR Newswire",
        "content": "ATLANTA, July 23, 2024 /PRNewswire/ -- Invesco Ltd. (NYSE: IVZ), a leading global provider of exchange-traded products (ETPs), in partnership with Galaxy Asset Management,1, one of the world's largest digital assets and blockchain investment managers, today announced the launch of the Invesco Galaxy Ethereum ETF (QETH). QETH is a spot ETP that invests directly in physical Ethereum to offer investors access to the performance of the market price of Ethereum, as measured by the Lukka Prime Ethereum Reference Rate2. QETH begins trading on the Cboe BZX Exchange today, granting investors access to Ethereum investing.\n\nQETH offers investors a differentiated and accessible way of participating in the disruptive ether market. It will leverage Invesco's track record of pioneering innovative ETPs and Galaxy's deep institutional-grade infrastructure and significant expertise in digital asset management.\n\nThe launch of QETH builds on Galaxy's and Invesco's successful joint track record following the launch of the Invesco Galaxy Bitcoin ETF (BTCO) in January of this year.\n\n\"Today's launch of Invesco Galaxy Ethereum ETF will leverage Invesco's experience in managing ETPs and Galaxy's expertise with digital assets to provide investors with efficient and secure exposure to Ethereum,\" says Brian Hartigan, Global Head of ETF and Index Strategy at Invesco. \"QETH joins Invesco Galaxy ETP's BTCO, SATO and BLKC in providing easier access and additional safeguards to US investors looking to create a varied digital assets portfolio with ETFs.\"\n\n\"ETH has served as a core asset in crypto portfolios for a long time, driven by the tremendous success of the Ethereum blockchain,\" said Steve Kurz, Global Head of Galaxy Asset Management. \"With the launch of QETH, we are excited to offer investors exposure to this burgeoning asset class in a format that is familiar, safe, and easy to trade. By combining our unrivalled collective experience in developing best-in-class investment solutions across both traditional and digital asset markets, Invesco and Galaxy Asset Management are well-positioned to continue at the forefront of enabling institutional exposure to the most value-creative corners of the digital asset ecosystem.\"\n\nTo view the full prospectus for the Invesco Galaxy Ethereum ETF, please visit this link: https://connect.rightprospectus.com/Invesco/TVT/46148D107/P?site=ETF\n\n1 Galaxy Asset Management is not affiliated with Invesco. Galaxy Asset Management is the Galaxy Division that operates Galaxy Digital Funds, the execution agent of QETH.\n\n2 The Lukka Prime Ethereum Reference Rate represents a fair market value for Ethereum that is aligned to GAAP and IFRS guidelines.\n\nAbout Invesco Ltd.\n\nInvesco Ltd. (TickerNYSE: IVZ) is a global independent investment management firm dedicated to delivering an investment experience that helps people get more out of life. With offices in more than 20 countries, our distinctive investment teams deliver a comprehensive range of active, passive and alternative investment capabilities. Invesco managed US $1.7 trillion in assets on behalf of clients worldwide as of March 31, 2024. For more information, visit www.invesco.com/corporate.\n\nAbout Galaxy\n\nGalaxy (TSX: GLXY) is a digital asset and blockchain leader providing access to the growing digital economy. We serve a diversified client base, including institutions, startups, and qualified individuals. Since 2018, Galaxy has been building a holistic financial platform spanning three complementary operating businesses: Global Markets, Asset Management, and Digital Infrastructure Solutions. Our offerings include, amongst others, trading, lending, strategic advisory services, institutional-grade investment solutions, proprietary bitcoin mining and hosting services, network validator services, and the development of enterprise custodial technology. The company is headquartered in New York City, with global offices across North America, Europe, and Asia. Additional information about Galaxy's businesses and products is available on www.galaxy.com.\n\nThe Fund is speculative and involves a high degree of risk. An investor may lose all or substantially all of an investment in the Fund. The Fund is not a mutual fund or any other type of Investment Company within the meaning of the Investment Company Act of 1940, as amended, and is not subject to regulation thereunder.\n\nShares in the Fund are not FDIC insured, may lose value and have no bank guarantee.\n\nThis material must be accompanied or preceded by a prospectus. Please read the prospectus carefully before investing.\n\nThe Fund currently intends to effect creations and redemptions principally for cash, rather than principally in-kind because of the nature of the Fund's investments. As such, investments in the Fund may be less tax efficient than investments in ETFs that create and redeem in-kind.\n\nThe Trust will not participate in the proof-of-stake validation mechanism of the Ethereum network (i.e., the Trust will not \"stake\" its ether) to earn additional ether or seek other means of generating income from its ether holdings.\n\nEther has historically exhibited high price volatility relative to more traditional asset classes, which may be due to speculation regarding potential future appreciation in value.\n\nThe value of the Trust's investments in Ethereum could decline rapidly, including to zero.\n\nThe further development and acceptance of the Ethereum network, which is part of a new and rapidly changing industry, is subject to a variety of factors that are difficult to evaluate. The slowing, stopping or reversing of the development or acceptance of the network may adversely affect the price of ether and therefore an investment in the Shares.\n\nCurrently, there is relatively limited use of ether in the retail and commercial marketplace in comparison to relatively extensive use as a store of value, contributing to price volatility that could adversely affect an investment in the Shares.\n\nRegulatory changes or actions may alter the nature of an investment in bitcoin or restrict the use of ether or the operations of the Ethereum network or venues on which bitcoin trades. For example, it may become difficult or illegal to acquire, hold, sell or use ether in one or more countries, which could adversely impact the price of ether.\n\nIn the past, flaws in the source code for ether have been discovered, including those that resulted in the theft of users' ether. Several errors and defects have been publicly found and corrected, including those that disabled some functionality for users and exposed users' personal information. Discovery of flaws in or exploitations of the source code that allow malicious actors to take or create money in contravention of known network rules has occurred.\n\nThe Trust's returns will not match the performance of ether because the Trust incurs the Sponsor Fee and may incur other expenses.\n\nThe Market Price of shares may reflect a discount or premium to NAV.\n\nThe price of ether may be impacted by the behaviour of a small number of influential individuals or companies.\n\nThe Ethereum network and ether face scaling obstacles that can lead to high fees or slow transaction settlement times, and attempts to increase the volume of transactions may not be effective.\n\nCompetition from central bank digital currencies (\"CDBCs\") and other digital assets could adversely affect the value of ether and other digital assets.\n\nPrices of ether may be affected due to stablecoins, the activities of stablecoin users and their regulatory treatment.\n\nA temporary or permanent \"fork\" in the Ethereum network could adversely affect an investment in the Shares. A disruption of the internet may affect the use of Ethereum and subsequently the value of the Shares.\n\nRisks of over or under regulation in the digital asset ecosystem could stifle innovation, which could adversely impact the value of the Shares.\n\nFuture regulations may require the Trust and the Sponsor to become registered, which may cause the Trust to liquidate.\n\nThe tax treatment of ether and other digital assets is uncertain and may be adverse, which could adversely affect the value of an investment in the Shares.\n\nThe venues through which ether trades are relatively new and may be more exposed to operations problems or failure than trading venues for other assets.\n\nThe Trust is subject to the risks due to its concentration in a single asset.\n\nEther spot trading venues are not subject to the same regulatory oversight as traditional equity exchanges.\n\nEthereum transactions are irrevocable and stolen or incorrectly transferred bitcoin may be irretrievable. As a result, any incorrectly executed bitcoin transactions could adversely affect an investment in the Trust.\n\nThe opinions expressed herein are based on current market conditions and are subject to change without notice. These opinions may differ from those of other Invesco or Galaxy investment professionals.\n\nThis does not constitute a recommendation of any investment strategy or product for a particular investor. Investors should consult a financial professional before making any investment decisions.\n\nShares are not individually redeemable and owners of the Shares may acquire those Shares from the Fund and tender those Shares for redemption to the Fund in Creation Unit aggregations only, typically consisting of 10,000, 20,000, 25,000, 50,000, 80,000, 100,000 or 150,000 Shares.\n\nInvesco Distributors, Inc. is the US distributor for Invesco's retail products and private placements, and Invesco Capital Management LLC is the investment adviser for ETFs. Both entities are indirect, wholly owned subsidiaries of Invesco Ltd.\n\nNA 3687270 7/24\n\nMedia Relations Contact: Stephanie Diiorio, 212-278-9037, [email protected]\n\nSOURCE Invesco Ltd."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiqgJBVV95cUxPSWtFWVhFczJOLVEtckZjb3o0WVA1T01VVFN6VWRTOFNweTVqbTAxRjctSWMxbVlzLUZmaWhJZ19WOTZMS1JFMWEtN2t4X2tmQ2lUQVlVX3M3d1BBc2VxWHdVWGlIRjZDTkJ1WUFZajRmZ1prVFpQdzhWMENKaFVmVVBWaTV3T1NiOGZ3SHVlaHRlSDVwSWpad2lkYWdKY3JaOUlZS1FBYklTeE5iTC0tNmNOS1lEV2h2UVBQN3pvZHpWNjRNcF9FMnljZExiVGpNaG1BdnBMY3lBMWFxMXdDdmpOQ0s2OHZmTmdTdjhFeTlFcTFfTjMxbnN2Q3N4eVZQVEFibE1tUDFuWjcyRDNybkFmQXR6UU0zemJfTGp2VUdVRkdwa0dNSE13?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jul 2024 07:00:00 GMT",
        "title": "Grayscale Ethereum Mini Trust (Ticker: ETH) and Grayscale - GlobeNewswire",
        "content": "STAMFORD, Conn., July 23, 2024 (GLOBE NEWSWIRE) -- Grayscale Investments®, the world’s largest crypto asset manager*, offering more than 20 crypto investment products, today announced that Grayscale Ethereum Trust (Ticker: ETHE) and Grayscale Ethereum Mini Trust (Ticker: ETH) have begun trading on NYSE Arca as of 4:00 AM ET today as spot Ethereum ETPs following the recent regulatory approval by the U.S. Securities and Exchange Commission (SEC). The launch and commencement of trading for ETH and ETHE represents a groundbreaking achievement for Grayscale’s clients and the broader Ethereum community.\n\nGrayscale Ethereum Mini Trust (“ETH”) and Grayscale Ethereum Trust (“ETHE”) are not funds registered under the Investment Company Act of 1940 and are not subject to regulation under the Investment Company Act of 1940, unlike most mutual funds or ETFs. Investing involves significant risk, including possible loss of principal. The Trusts may not be suitable for all investors.\n\nETHE has become the largest spot Ethereum ETP with $9.19B AUM as of July 23, 2024, and has come to market with an established and diverse investor base across retail and institutional investors alike.\n\nETH launched today as a lower fee** spot Ethereum ETP through the innovative mechanics of initial seeding by distributing 10% of ETHE's underlying Ethereum. As such, ETH has commenced trading as the second largest spot Ethereum ETP*, with a uniquely diversified investor base, and $1.02B AUM as of July 22, 2024. ETHE’s distribution event is colloquially known as a “spin-off,” and is a corporate action that is not expected to be a taxable event for ETHE nor any beneficial owner of ETHE shares as of the previously announced Record Date of July 18, 2024. Investors are encouraged to consult a tax advisor for related tax guidance.\n\n\"The Grayscale team could not be more excited for ETH and ETHE to begin trading today as spot Ethereum ETPs on NYSE Arca,” said Grayscale Senior Managing Director, Global Head of ETFs David LaValle. “Spot Ethereum ETPs will provide U.S. investors, financial professionals, and asset allocators reliable and convenient access to Ethereum for the first time in the familiar, time-tested ETP wrapper. This is a huge milestone for investors and the ETF market, and demonstrates Grayscale’s ongoing commitment to advancing digital asset investing in the United States.”\n\nGrayscale remains committed to addressing increasing investor and market demand for Ether by expanding its range of Ethereum-focused investment products – aiming to build a product suite that can cater to investors' unique needs at every stage of their Ether investing journey. Grayscale has been and remains unwaveringly focused on working constructively with its investors, partners, regulators, and policymakers to help deepen the understanding of Ethereum and the Ethereum fee protocol to expand familiar access to the second largest crypto asset by market cap***.\n\n“ETH and ETHE will allow investors to invest in Ethereum's potential to create markets, transform financial systems, utilize Decentralized Finance (DeFi), and drive innovation through the trusted ETP wrapper -- without the need to buy, store, or manage Ethereum directly,” said Grayscale Managing Director and Head of Distribution and Strategic Partnerships John Hoffman. “Client demand is growing alongside the maturation of the crypto asset class, and Grayscale is proud to offer pioneering financial products that provide our clients’ choice when considering convenient, registered exposure to crypto assets, like Ethereum.\"\n\nFor additional information about ETH, please visit: https://etfs.grayscale.com/eth For additional information about ETHE, please visit: https://etfs.grayscale.com/ethe.\n\n*By AUM as of July 22, 2024\n\n**Low cost based on gross expense ratio at 0% for the first six months of trading for the first $2.0 billion. After the fund reaches $2.0 billion in assets or after a 6-month waiver period, the fee will be 0.15%. Brokerage fees and other expenses may still apply. See prospectus for additional fee waiver information.\n\n*** By Market Cap as of July 22, 2024\n\nNO OFFER OR SOLICITATION\n\nThis communication is for informational purposes, solely in your capacity as a shareholder of ETHE, and does not constitute an offer to sell or the solicitation of an offer to buy any securities or a solicitation of any vote or approval, nor shall there be any sale of securities in any jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of such jurisdiction. No shareholder approval of the distribution is required by applicable law, and we are not seeking ETHE shareholder approval.\n\nADDITIONAL INFORMATION AND WHERE TO FIND IT\n\nA definitive information statement on Schedule 14C will be furnished to ETHE shareholders for the purpose of informing ETHE shareholders of the distribution, in substantial compliance with Regulation 14C of the Exchange Act. The information statement will describe the Grayscale Ethereum Mini Trust, risks of owning shares of the Grayscale Ethereum Mini Trust and other details regarding the distribution, and will be made available on our website at www.grayscale.com/documents#regulatoryfilings. ETHE shareholders will not need to pay any consideration, exchange or surrender existing ETHE shares, or take any other action to receive shares of the Grayscale Ethereum Mini Trust in connection with the distribution.\n\nGrayscale Ethereum Trust (ETHE) and Grayscale Ethereum Mini Trust (ETH) (collectively the “Trusts”) have filed registration statements (including a prospectus) with the SEC for the offering to which this communication relates. Before you invest, you should read the prospectuses in the registration statements and other documents the Trusts have filed with the SEC for more complete information about the Trusts and this offering. You may get these documents for free by visiting EDGAR on the SEC Website at www.sec.gov. Alternatively, the Trusts or any authorized participant will arrange to send you the prospectus (when available) if you request it by calling (833)903-2211 or by contacting Foreside Fund Services, LLC, Three Canal Plaza, Suite 100, Portland, Maine 04101. Foreside Fund Services, LLC is the Marketing Agent for the Trusts.\n\nInvesting involves significant risk, including possible loss of principal. The Trust holds Ethereum; however, an investment in the Trust is not a direct investment in Ethereum. There is no certainty that an active trading market for shares will develop or be maintained which will adversely affect the liquidity of shares of the Trust.\n\nGrayscale Ethereum Trust and Grayscale Ethereum Mini Trust Risk Disclosures:\n\nAn investment in the Grayscale Ethereum Trust or Grayscale Ethereum Mini Trust may be deemed speculative and is not intended as a complete investment program. An investment in ETHE or the Grayscale Ethereum Mini Trust should be considered by persons financially able to maintain their investment and who can bear the risk of total loss associated with an investment in ETHE or the Grayscale Ethereum Mini Trust. Extreme volatility of trading prices that many digital assets, including Ethereum, have experienced in recent periods and may continue to experience, could have a material adverse effect on the value of ETHE and the Grayscale Ethereum Mini Trust and the shares could lose all or substantially all of their value. Digital assets represent a new and rapidly evolving industry. The value of ETHE and the Grayscale Ethereum Mini Trust depends on the acceptance of the digital assets, the capabilities and development of blockchain technologies and the fundamental investment characteristics of the digital asset. Digital asset networks are developed by a diverse set of contributors and the perception that certain high-profile contributors will no longer contribute to the network could have an adverse effect on the market price of the related digital asset. Digital assets may have concentrated ownership and large sales or distributions by holders of such digital assets could have an adverse effect on the market price of such digital assets. The value of ETHE and ETH relates directly to the value of the underlying digital asset, the value of which may be highly volatile and subject to fluctuations due to a number of factors.\n\nA registration statement related to Grayscale Ethereum Mini Trust has been filed with the SEC but has not yet become effective. An investment in the Grayscale Ethereum Mini Trust cannot be made, nor money accepted, until the registration statement is effective. An investor should consider the investment objectives, risks, and charges and expenses of the Grayscale Ethereum Mini Trust carefully before investing. A preliminary prospectus which contains this and other information about Grayscale Ethereum Mini Trust may be obtained by emailing info@grayscale.com. The information in the preliminary prospectus is not complete and may be changed. The final prospectus should be read carefully before investing, and when available may be obtained from the same source. This communication is not an offer to sell shares and is not soliciting an offer to buy shares in any state where the offer or sale is not permitted.\n\nGrayscale Investments, LLC is the Sponsor of Grayscale Ethereum Trust and Grayscale Ethereum Mini Trust.\n\nAbout Grayscale Investments®\n\nGrayscale enables investors to access the digital economy through a family of future-forward investment products. Founded in 2013, Grayscale has a proven track record and deep expertise as the world's largest crypto asset manager. Investors, advisors, and allocators turn to Grayscale's private placements, public quotations, and ETPs for single asset, diversified, and thematic exposure. Grayscale products are distributed by Grayscale Securities, LLC (Member FINRA/SIPC).\n\nMedia Contact\n\nJennifer Rosenthal\n\npress@grayscale.com"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxOZWVlLUJzYkE4cFpJMWxaZWJrLXlqMU40YnFmUDdYbGFqTXppN1BUeWFtOUctcWNSY3JZdlluUTJHbkZBQld3TER4SUFWSjhUWXAtTlNDb0MzendudlZCS1dHV0VtMzdJZGhhNlNJZktPYUhsVFRpbnJSbWhGZkp5cnRNSFpDdzdrV3BzRGJQVkN2a2xzOGNkOWp1OUw4enExRnV1dmIxSkFWaGFVOGJzMUZwZWRHajNx?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jul 2024 07:00:00 GMT",
        "title": "BlackRock’s iShares Ethereum Trust ETF Set to Launch - Business Wire",
        "content": "NEW YORK--(BUSINESS WIRE)--The registration statement for BlackRock’s iShares Ethereum Trust ETF (ETHA), has been declared effective by the U.S. Securities and Exchange Commission (SEC). ETHA seeks to track the price of Ethereum’s native token, ether, and is expected to begin trading on Nasdaq on July 23, 2024. ETHA carries a 0.25% sponsor fee with a one-year waiver reducing the fee to 0.12% on the first $2.5B assets under management (AUM)1.\n\n\" Our clients are increasingly interested in gaining exposure to digital assets through exchange-traded products (ETPs) which provide convenient access, liquidity and transparency,\" said Jay Jacobs, U.S. Head of Thematic and Active ETFs. “ Ethereum’s appeal lies in its decentralized nature and its potential to drive digital transformation in finance and other industries.”\n\nThe iShares Ethereum Trust ETF (ETHA) offers exposure to the Ethereum's native token, ether, the second largest cryptocurrency by market capitalization.2 Ethereum, a global technology platform, is similar to an app store that generates value for ether as usage increases and more applications are built on top of it.\n\nOver the last 12 months, iShares has launched 170 ETFs and ETPs including the iShares Bitcoin Trust (IBIT), driving innovation and providing investors with more choices to help them meet their investment goals.\n\nWith over 20 years of experience and more than 1,400 ETFs globally, iShares has helped millions of investors access different corners of the market. Every iShares product is underpinned by decades of investment expertise and institutional grade technology.\n\nTo learn more about the iShares Ethereum Trust ETF filing visit: https://www.sec.gov/Archives/edgar/data/2000638/000143774924023199/iset20240720_424b3.htm\n\nAbout BlackRock\n\nBlackRock’s purpose is to help more and more people experience financial well-being. As a fiduciary to investors and a leading provider of financial technology, we help millions of people build savings that serve them throughout their lives by making investing easier and more affordable. For additional information on BlackRock, please visit www.blackrock.com/corporate | Twitter: @blackrock | LinkedIn: www.linkedin.com/company/blackrock\n\nAbout iShares\n\niShares unlocks opportunity across markets to meet the evolving needs of investors. With more than twenty years of experience, a global line-up of 1400+ exchange traded funds (ETFs) and $3.86 trillion in assets under management as of June 30, 2024, iShares continues to drive progress for the financial industry. iShares funds are powered by the expert portfolio and risk management of BlackRock.\n\nImportant Information\n\nA registration statement has been filed for the iShares Ethereum Trust ETF (“the Trust”) and the registration statement has become effective. However, shares of the Trust are not yet available for purchase or sale. Carefully consider the Trust’s investment objectives, risk factors, and charges and expenses before investing. This information must be accompanied or preceded by a current iShares Ethereum Trust ETF prospectus and iShares Bitcoin Trust Prospectus. Please read the prospectuses carefully before investing.\n\nThe iShares Trusts are not investment companies registered under the Investment Company Act of 1940, and therefore are not subject to the same regulatory requirements as mutual funds or ETFs registered under the Investment Company Act of 1940. Investments in these products are speculative and involve a high degree of risk.\n\nInvesting involves a high degree of risk, including possible loss of principal. An investment in the Trust is not suitable for all investors, may be deemed speculative and is not intended as a complete investment program. An investment in Shares should be considered only by persons who can bear the risk of total loss associated with an investment in the Trust.\n\nInvesting in digital assets involves significant risks due to their extreme price volatility and the potential for loss, theft, or compromise of private keys. The value of the shares is closely tied to acceptance, industry developments, and governance changes, making them susceptible to market sentiment. Digital assets represent a new and rapidly evolving industry, and the value of the Shares depends on their acceptance. Changes in the governance of a digital asset network may not receive sufficient support from users and miners, which may negatively affect that digital asset network’s ability to grow and respond to challenges Investing in the Trust comes with risks that could impact the Trust's share value, including large-scale sales by major investors, security threats like breaches and hacking, negative sentiment among speculators, and competition from central bank digital currencies and financial initiatives using blockchain technology. A disruption of the internet or a digital asset network would affect the ability to transfer digital assets and, consequently, would impact their value. There can be no assurance that security procedures designed to protect the Trust’s assets will actually work as designed or prove to be successful in safeguarding the Trust’s assets against all possible sources of theft, loss or damage.\n\nThe Trust may incur certain extraordinary, non-recurring expenses that are not assumed by the Sponsor.\n\nThe iShares Ethereum Trust ETF (the “Trust”) is not sponsored, endorsed, issued, sold or promoted by Stiftung Ethereum (the \"Ethereum Foundation\"), nor does the Ethereum Foundation make any representation regarding the advisability of investing in the Trust. BlackRock is not affiliated with the Ethereum Foundation. Ethereum Marks are owned by the Ethereum Foundation, used under license.\n\nShares of the Trust are not deposits or other obligations of or guaranteed by BlackRock, Inc., and its affiliates, and are not insured by the Federal Deposit Insurance Corporation or any other governmental agency. The sponsor of the trust is iShares Delaware Trust Sponsor LLC (the “Sponsor”). BlackRock Investments, LLC (\"BRIL\"), assists in the promotion of the Trust. The Sponsor and BRIL are affiliates of BlackRock, Inc. The bitcoin and ether Custodian is Coinbase Custody Trust Company, LLC, which is not affiliated with BlackRock, Inc. The Sponsor is not responsible for losses incurred due to loss, theft, destruction, or compromise of the trust's bitcoin or ether.\n\n©2024 BlackRock, Inc. or its affiliates. All rights reserved. iSHARES and BLACKROCK are trademarks of BlackRock, Inc., or its affiliates. All other trademarks are the property of their respective owners.\n\n_________________\n\n1 BlackRock will waive a portion of the Sponsor’s Fee for the first 12 months commencing on July 23, 2024, so that the fee will be 0.12% of the net asset value of the Trust for the first $2.5 billion of the Trust’s assets. If the fund exceeds $2.5 billion of the Trust’s assets prior to the end of the 12-month period, the Sponsor’s Fee charged on assets over $2.5 billion will be 0.25%. All investors will incur the same Sponsor’s Fee which is the weighted average of those fee rates. After the 12-month waiver period is over, the Sponsor’s Fee will be 0.25%.\n\n2 Source: The Block, as of May 21, 2024. Ethereum’s market capitalization of $450 billion is measured by its native token, ether."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxQcTVoMV90Um9FT1h3eGJjMG8yX0hjT2c2b1lZMDZPMGRCOElaZ1NTb2RyNVd2d3F2YVRoQUhWUUREaVJhQlNGOEdTRUxWQUpmU0R3SU1RVDN0SUFTVWwxRmMzYnZTMThLT3gzaFhOaWh5Rllhb3FBVGZsWWdKWmNsamNMdXpyRXozOFNncXpGTkZJQU9fbnVRekZtU1QzeXlJdW1heTExdUp1bUg1bkFmadIBtgFBVV95cUxQcUF1RGJKY0thUll2UzZRT0o3RVBGWklMbXRmaFVuQWI0OXJKVW9RWXE2OVJMcUpjTnQ0dloyMHU0Q2JENVE1dlJDSVNDSjdVTHJiZ0VNS0JFX1F1UThURHRjZnZJQTRHdW5KY2hJclhsdzltaXRGWWMxeU5ZUmZRcW8wTDNZRDRGMm5Ibnk5SjFMdV9JVGVXd1h1ZDlKU1pCc1U0c2FRNGY5RUxVd3pUdGhfdnBHQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jul 2024 07:00:00 GMT",
        "title": "Spot ether ETFs are set to trade Tuesday. Here’s what it means for the Ethereum blockchain - CNBC",
        "content": "Nurphoto | Nurphoto | Getty Images\n\nSpot ether exchange traded funds are set to begin trading on Tuesday. Crypto enthusiasts are hopeful it will broaden the investor base for Ethereum, a blockchain technology many argue has a far wider use case than bitcoin. These ETFs will invest directly in ether, which is the cryptocurrency used in the Ethereum network. There are already ether ETFs that track futures contracts, but these are the first to track spot ether. Spot ether ETF applications Grayscale Ethereum Mini Trust (ETH)\n\nGrayscale Ethereum Trust (ETHE)\n\nBitwise Ethereum (ETHW)\n\nVanEck Ethereum (ETHV)\n\n21Shares Core Ethereum (CETH)\n\nInvesco Galaxy Ethereum (QETH)\n\nFidelity Ethereum (FETH)\n\nFranklin Ethereum (EZET)\n\niShares Ethereum Trust (ETHA) Like the spot bitcoin ETFs that launched in January, most are waiving fees initially — in many cases for up to a year.\n\nBitcoin ETF have been a hit. Will ether ETFs be the same?\n\nBy the standards of ETF launches, spot bitcoin ETFs have been a success: They recently topped $17 billion in net flows year to date since their debut. For a new asset class, that is a big hit. However, at $1.3 trillion in total assets, bitcoin has about three times the value of ether, which has about $414 billion in assets. That may limit the initial appeal of ether ETFs. Bitcoin prices rose going into the launch of spot bitcoin ETFs. Ether has been a bit spottier: It is up 50% in 2024, but most of the gain came in the first three months of the year. Still, for Ethereum enthusiasts, the primary value of a spot ether ETF is that it's a perfect vehicle to educate the public about the use cases for Ethereum, which are far greater than anything bitcoin has to offer. Ben Johnson, Morningstar's head of client solutions and an ETF research veteran, noted that while bitcoin is often advertised as digital gold, \"Ethereum is more like picks and shovels.\" \"The case for the former is that it is finite and could be a store of value, the latter is not finite and being used to build some real-world applications,\" he said.\n\nWhat the Ethereum platform does\n\nMany investors have never been impressed with bitcoin, primarily because the use case seems limited: It is purely a digital currency. But the Ethereum platform is different. Bitcoin and Ethereum both utilize blockchain, which is a decentralized, immutable ledger to record transaction histories, but they have very different purposes. Bitcoin uses the blockchain as a digital currency. Ethereum utilizes digital money just like bitcoin, but its blockchain has broader purposes. (Ether is the cryptocurrency used in the Ethereum network, but in practice the terms Ethereum and ether are often used interchangeably.) Ethereum is a platform for building smart contracts, which are self-executing programs that enforce a pre-existing contract or agreement. It can be as simple as \"If I do this, you do that.\" The key is that they execute automatically, are done on the blockchain (the Ethereum network) and produce the same result each time they are executed. They also have a wide variety of applications. The most common use is for decentralized finance, or \"DeFi.\" This is just a fancy term for using financial services on the blockchain. In theory, you could perform almost any banking services: Users can send, lend or borrow money, open a savings account, trade stocks or derivatives or other cryptocurrencies, get insurance. Theoretically, you could also do real estate transactions. Users can perform these functions using software called \"decentralized apps.\" The use case goes beyond financial services. Users can play games. Corporations could use it for tracking supply chains. It could even be used as a clearing platform to settle stock trades. Another application for Ethereum: stablecoins. These are cryptocurrencies whose value is pegged to another asset, usually the dollar. Because cryptocurrencies like bitcoin and ether are volatile, many DeFi applications rely on stablecoins for lending, borrowing and trading. The promise is a transaction network that — in theory — could be a much cheaper and faster way to do business.\n\nDoes this open the floodgates for more crypto ETFs?\n\nIt's not clear whether this latest development will open the floodgates for more crypto ETFs — or whether the U.S. Securities and Exchange Commission will find a way to stop the potential tidal wave. Any applicant for other crypto ETFs would still need to show that the underlying market was not subject to manipulation, a crucial requirement for approval of these funds. But a lot may depend on the political climate. In the past, for commodities, the SEC has traditionally required a regulated futures market to trade alongside the asset. Right now, that only exists for bitcoin and ether, so it would take time to develop futures markets for other crypto products. \"Under the current regime in Washington, that would not change,\" Matt Hougan, chief investment officer of Bitwise told me. \"But if you get a change of regimes in Washington, that could change.\" Regardless, expect a lot of trading. \"These new ETH ETFs will likely trade a lot,\" Johnson at Morningstar told me. \"I'd guess that if and when options on these ETFs become available, this will all go into overdrive.... These ETFs effectively add a whole new wing to the crypto casino.\"\n\nIs Ethereum essentially a tech play?"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxQX1hOLVE5R3JWRC1DVWUyMVlSY1RzWFo0bVZFMDV4aGpucTA3RE5yemh0T0RYME9JVG80dUFlNXM0VHJua2xVTk40bkdKeUZEaDJEblYtc1hNbkxMMTM5dWtCNVVnb3o2LXp5aFBQTHBUUkxJQ3g4cldpcnM4QjJDR2RLU2hPZXprdlVCNEpmN0s5b2ViMlRKdVc1eVI1V0Q0UXlIMzQxZDFZXzRuckNTdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jul 2024 07:00:00 GMT",
        "title": "Franklin Templeton Launches Franklin Ethereum ETF (EZET) - Business Wire",
        "content": "SAN MATEO, Calif.--(BUSINESS WIRE)--Franklin Templeton today launched its second digital asset-backed exchange-traded fund (ETF), the Franklin Ethereum ETF, under the ticker EZET. It is offered on the Cboe BZX Exchange, Inc. and priced at 0.19%, or 19 basis points. Franklin Templeton has agreed to fully waive fees to 0.00% until January 31, 2025, for the first $10.0 billion in fund assets. The fund is a spot ether (ETH) ETF available for U.S. investors and seeks to reflect the performance of the price of ether, less the expense of fund operations. EZET is the latest offering on the growing Franklin Templeton Digital Assets and ETF platforms.\n\n“After the success of our spot bitcoin ETF (EZBC) launch in January, we are proud to add EZET to our growing lineup of digital asset ETFs,” said Patrick O’Connor, Head of Global ETFs for Franklin Templeton. “With EZET, we are thrilled to offer our clients additional access to the digital asset ecosystem within a regulated fund structure that integrates seamlessly into traditional portfolios.”\n\nSince 2018, Franklin Templeton Digital Assets has been building blockchain-based technology solutions, running node validators, and developing a wide range of investment strategies. The firm’s dedicated digital assets research team leverages fundamental “tokenomic” analysis, insights from an embedded data science team and deep industry connections to help inform product development and investment decisions.\n\n“We have been active participants and builders in the digital asset ecosystem since 2018 and have seen the transformative power of blockchain technology firsthand,” said Roger Bayston, Head of Digital Assets at Franklin Templeton. “Ethereum has been at the forefront of Web3 innovation with things like smart contracts and the Ethereum Virtual Machine and we're excited to bring that technology revolution to our clients.”\n\nEstablished in 2016, Franklin Templeton’s U.S. ETF platform provides solutions for a range of market conditions and investment objectives through active, smart beta and passively managed ETFs. Franklin Templeton offers over 100 ETFs globally with combined assets under management (AUM) of over $20 billion as of June 30, 2024.\n\nAbout Franklin Templeton\n\nFranklin Resources, Inc. [NYSE:BEN] is a global investment management organization with subsidiaries operating as Franklin Templeton and serving clients in over 150 countries. Franklin Templeton’s mission is to help clients achieve better outcomes through investment management expertise, wealth management and technology solutions. Through its specialist investment managers, the company offers specialization on a global scale, bringing extensive capabilities in fixed income, equity, alternatives and multi-asset solutions. With more than 1,500 investment professionals, and offices in major financial markets around the world, the California-based company has over 75 years of investment experience and over $1.6 trillion in assets under management as of June 30, 2024. For more information, please visit franklintempleton.com and follow us on LinkedIn, X and Facebook.\n\nThe Fund has filed a registration statement (including a prospectus) with the Securities and Exchange Commission (“SEC”) for the offering to which this communication relates. Before you invest, you should read the prospectus in that registration statement and other documents the Fund has filed with the SEC, when available, for more complete information about the Fund and this offering. You may obtain these documents for free by visiting EDGAR on the SEC website at sec.gov or by visiting franklintempleton.com.\n\nAll investments involve risks, including possible loss of principal. Before you invest, for more complete information about the Fund and this offering, you should carefully read the Fund's prospectus.\n\nThe Fund is not an investment company registered under the Investment Company Act of 1940 (1940 Act), and therefore is not subject to the same regulatory requirements as mutual funds or ETFs registered under the 1940 Act. The Fund is not a commodity pool for purposes of the Commodity Exchange Act (CEA) and accordingly is not subject to the regulatory protections afforded by the CEA.\n\nThe Fund holds only ether and cash and is not suitable for all investors. The Fund is not a diversified investment and, therefore, is expected to be more volatile than other investments, such as an investment in a more broadly diversified portfolio. An investment in the Fund is not intended as a complete investment plan.\n\nAn investment in the Fund is subject to market risk with respect to the digital asset markets. The trading price of the ether held by the Fund may go up and down, sometimes rapidly or unpredictably. The value of the Fund’s Shares relates directly to the value of ether, which has been in the past, and may continue to be, highly volatile and subject to fluctuations due to a number of factors. Extreme volatility in the future, including substantial, sustained or rapid declines in the trading prices of ether, could have a material adverse effect on the value of the Shares and the Shares could lose all or substantially all of their value.\n\nCompetitive pressures may negatively affect the ability of the Fund to garner substantial assets and achieve commercial success.\n\nDigital assets represent a new and rapidly evolving industry, and the value of the Fund’s Shares depends on the acceptance of ether. Due to the relative unregulated nature and lack of transparency surrounding the operations of digital asset exchanges, which may experience fraud, manipulation, security failures or operational problems, as well as the wider ether market, the value of ether and, consequently, the value of the Shares may be adversely affected, causing losses to Shareholders.\n\nDigital asset markets in the U.S. exist in a state of regulatory uncertainty, and adverse legislative or regulatory developments could significantly harm the value of ether or the Shares, such as by banning, restricting or imposing onerous conditions or prohibitions on the use of ether, validation activity, digital wallets, the provision of services related to trading and custodying ether, the operation of the Ethereum network, or the digital asset markets generally.\n\nThe Index price used to calculate the value of the Fund’s ether has a limited performance history and may be volatile, adversely affecting the value of the Shares. Moreover, the Index Administrator could experience system failures or errors. Errors in the Index data, computations and/or construction may occur from time to time and may not be identified and/or corrected for a period of time or at all, which may have an adverse impact on the Fund and the Shareholders.\n\nA temporary or permanent “fork” in the Ethereum blockchain could adversely affect the value of the Shares. The Fund does not have the ability or intention to hold any asset (including any crypto asset) other than ether and cash. Shareholders may not receive the benefits of any forks or “airdrops.” Forks or airdrops may result in extraordinary expenses borne by the Fund.\n\nThe Fund is a passive investment vehicle and is not actively managed, meaning it does not manage its portfolio to sell ether at times when its price is high, or acquire ether at low prices in the expectation of future price increases. Also, the Fund does not use any hedging techniques to attempt to reduce the risks of losses resulting from ether price decreases. The Fund is not a leveraged product and does not utilize leverage, derivatives or similar instruments or transactions. The Fund's Shares are not interests or obligations of the Fund's Sponsor or its affiliates, and are not insured by the Federal Deposit Insurance Corporation or any other governmental agency.\n\nThe amount of ether represented by each Share will decrease over the life of the Fund due to the sales of ether necessary to pay the Sponsor’s Fee and other Fund expenses. Without increases in the price of ether sufficient to compensate for that decrease, the price of the Shares will also decline and you will lose money on your investment in Shares.\n\nSecurity threats to the Fund’s account at the Ether Custodian or Prime Broker could result in the halting of Fund operations and a loss of Fund assets or damage to the reputation of the Fund, each of which could result in a reduction in the value of the Shares.\n\nThe Fund will not stake the ether it holds, so an investment in the Fund’s shares will not realize the economic benefits of staking.\n\nIf the process of creation and redemption of Creation Units encounters any unanticipated difficulties, the possibility for arbitrage transactions by Authorized Participants intended to keep the price of the Shares closely linked to the price of ether may not exist and, as a result, the price of the Shares may fall or otherwise diverge from NAV.\n\nFranklin Distributors, LLC. Member FINRA, SIPC. Marketing agent for the Franklin Ethereum ETF.\n\nNOT FDIC INSURED | NO BANK GUARANTEE | MAY LOSE VALUE.\n\nCopyright © 2024. Franklin Templeton. All rights reserved."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiYEFVX3lxTE42M0ltX3l5NjdrVkZLckFNV0FGT2wwejQ0WVRIWTZFNVNKdFNBWWRCcHVxNmoySXpBdWVIN2ozdGJTcmJkQkp6QXBUcmpXN25lMnFkUWZVQlR3VTFaLWhEMw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jul 2024 07:00:00 GMT",
        "title": "Spot Ethereum ETFs debut on US markets as trading commences - Crypto Briefing",
        "content": "Ethereum's utility has been highlighted as ETFs launch on major US exchanges.\n\nKey Takeaways First-ever spot Ethereum ETFs begin trading in the US today.\n\nEthereum ETFs expected to attract up to $1 billion in initial monthly inflows.\n\nShare this article\n\nToday marks a watershed moment in the US financial markets as the first-ever spot Ethereum ETFs commence trading.\n\nApproved by the US SEC, these funds allow investors to directly engage with the world’s second-largest cryptocurrency.\n\nJay Jacobs, BlackRock’s US head of thematic and active ETFs, highlighted Ethereum’s utility, stating, “You could think of Ethereum as a global platform for applications that run without decentralized intermediaries.”\n\nThe SEC allowed S1 registration statements to become effective on Monday afternoon, giving final approval for the funds to begin trading. This development comes less than three months after spot Bitcoin ETFs were launched in January.\n\nEight issuers are offering spot Ethereum ETFs with varying fee structures:\n\nGrayscale Ethereum Mini Trust (NYSE: ETH): 0.15% post-waiver fee\n\nFranklin Ethereum ETF (CBOE: EZET): 0.19%\n\nVanEck Ethereum ETF (CBOE: ETHV): 0.20%\n\nBitwise Ethereum ETF (NYSE: ETHW): 0.20%\n\n21Shares Core Ethereum ETF (CBOE: CETH): 0.21%\n\nFidelity Ethereum Fund (CBOE: FETH): 0.25%\n\niShare Ethereum Trust (NASDAQ: ETHA): 0.25%\n\nInvesco Galaxy Ethereum ETF (CBOE: QETH): 0.25%\n\nAdditionally, Grayscale’s existing Ethereum Trust (NYSE: ETHE) will continue trading with a 2.5% fee. Six of the funds will use Coinbase as a custodian, while VanEck has chosen Gemini and Fidelity will self-custody its ether.\n\nAnalysts project more modest inflows for Ethereum ETFs compared to their Bitcoin counterparts. Citigroup estimates between $4.7 billion and $5.4 billion in inflows over the first six months of trading. Nate Geraci, president of The ETF Store, suggests Ethereum ETF demand may reach about one-third of what was seen with Bitcoin ETFs.\n\nThe ETFs are available to both institutional investors and retail traders. Notably, six of these funds have chosen Coinbase as their custodian, with others opting for different custody solutions. The trading platforms and their respective fees vary, with the Grayscale Ethereum Mini Trust and the Invesco Galaxy Ethereum ETF among those listed.\n\nComparatively, Ethereum ETFs are expected to see lower initial inflows than their Bitcoin counterparts, with projections suggesting up to $1 billion in net inflows monthly for the first half-year. Despite the smaller market size relative to Bitcoin, the introduction of these ETFs is poised to provide a new avenue for cryptocurrency investment."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxPTGM3MUlyczNvWEZ2SW8weHlQTTBuZU5QVV8zaEc1YkNQelBoZ1AzaFlpZUNuLXlsWXdYeUQtYWVHNUJiUkhxRTg2cV9OZ2FBaVFWZjFza1VSVVNMdUFsaUJBdEJtX3dKZmxTcDBZQzU0Ujk0UDVWUE56MXkySTBSeVFTcXR3YUhtR1FNc1ZDckc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETFs: Potential inflows and Ethereum price impact analysis - crypto.news",
        "content": "Today, Ethereum ETFs made their long-awaited debut on major stock exchanges. This article will analyze projected inflows for Ethereum ETFs and how they might influence the future price of ETH. By comparing the recent success of Bitcoin ETFs, we will explore the potential impact on Ethereum prices in the coming months.\n\nUnderstanding Bitcoin ETF inflows and their implications for Ethereum\n\nWhile Bitcoin ETFs have seen substantial inflows, expectations for Ethereum ETFs are more modest. Since their inception, Bitcoin ETFs have attracted significant investor interest. As of July 18, these financial instruments saw a net inflow of $16.67 billion over approximately six months. Despite being the second-largest cryptocurrency, Ethereum is often perceived differently from Bitcoin. It is not typically seen as a store of value or “digital gold.” This distinction, combined with Bitcoin’s more established market position, suggests that Ethereum may not attract the same level of ETF inflows as Bitcoin.\n\nSource: Farside Investors\n\nEric Balchunas, a senior ETF analyst at Bloomberg, has provided conservative estimates for Ethereum ETF inflows and believes that these funds will attract only 10-15% of the inflows seen by Bitcoin ETFs.\n\nI think me comparing Ether ETFs following Bitcoin ETFs to a concert where Sister Hazel comes on after Nirvana is prob why a few ppl coming at me on this and that's ok. Maybe that was harsh but I still see the ether etfs getting 10-15% of the assets of the btc ETFs (altho James is… — Eric Balchunas (@EricBalchunas) May 21, 2024\n\nYou might also like: Election politics or crypto evolution? Speculation abounds as SEC hints at approving Ethereum ETFs\n\nAdditionally, when looking at the derivatives market, the open interest for Ethereum futures and options on the CME is approximately $1.67 billion, while Bitcoin’s open interest stands at $12.56 billion. The CME, which mainly serves institutional investors, shows that Ethereum’s share is about 13.3% of Bitcoin’s. In the broader derivatives market, Ethereum’s total open interest is $20.74 billion compared to Bitcoin’s $54.1 billion, which translates to a 38.34% ratio. These figures reinforce the conservative projections for Ethereum ETF inflows compared to Bitcoin.\n\nAcademic insights into ETF effects on market prices\n\nA question often arises: why would ETF inflows impact the price of an underlying asset, such as Ethereum? Several academic studies have confirmed ETFs’ significant influence on underlying asset prices. Research by Ben-David et al. (2018) demonstrates that ETFs can lead to increased volatility and price deviations from fundamental values in the securities they track. The study attributes these effects to the mechanical rebalancing and trading strategies employed by ETFs, which can amplify price movements and introduce non-fundamental shocks into the market.\n\nFurther supporting evidence comes from Luca J. Liebi’s literature review. The research highlights ETFs’ role in improving market liquidity and price efficiency under normal conditions. Empirical evidence suggests that ETFs, particularly those with high leverage, can magnify price changes in underlying assets due to their rebalancing activities. These studies collectively indicate that ETF inflows tend to push up the prices of the assets they track, lending credence to the hypothesis that Ethereum ETFs could similarly impact ETH prices.\n\nPotential inflow scenarios for Ethereum ETFs\n\nBased on the analysis above, four potential scenarios for Ethereum ETF inflows emerge:\n\nPercentage of Bitcoin ETF Inflows Ethereum ETF Inflows 10% $1.67B 15% $2.50B 20% $3.33B 25% $4.17B\n\nThese projections estimate the potential inflows Ethereum ETFs might experience by the end of 2024, using the $16.668 billion figure for Bitcoin as a baseline.\n\nEthereum price impact analysis\n\nTo estimate the price impact of these potential inflows, four multipliers are considered: 0.5x, 1x, 1.5x, and 2x. These multipliers reflect varying degrees of price sensitivity to ETF inflows.\n\n10% 15% 20% 25% 0.5x $3,570 $3,655 $3,740 $3,825 1x $3,740 $3,910 $4,080 $4,250 1.5x $3,910 $4,165 $4,420 $4,675 2x $4,080 $4,420 $4,760 $5,100\n\nAssuming a current Ethereum price of $3,400, the estimated price impact by the end of 2024, solely from ETF inflows, would range from $170 to $1,700. With more likely multipliers (1x to 1.5x), the price increase would be between $340 and $1,275. This suggests a potential Ethereum price range of $3,740 to $4,675."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxQX3RhbnZhTks2VVgwOHpldUh2a0N5UThyTDhFTTJVaE91YUdZTlE1TW1aZUp0djZPVUhYbFI4X0QwRGU4SWpMWkxYeEtTWmUwUFlxZEhmN3dVTkJzRXcwRC1XbEtZV0JKUzZSb0JZd2FKU0JPNG5nWmt0YnFid2d0TEc5Ung3RHhxcU83VTE4S3BPbTZYT1VSdVNxV0k1TXpjOEhZ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jul 2024 07:00:00 GMT",
        "title": "Why Savvy Investors Are Turning to Ethereum ETFs After SEC Approval - Brave New Coin Insights",
        "content": "Why Savvy Investors Are Turning to Ethereum ETFs After SEC Approval\n\nThe SEC's approval of Ethereum ETFs marks a new era for wealth-building in the crypto market. Investors can now trade Ethereum’s ether through spot exchange-traded funds, following the significant milestone of Bitcoin ETFs' approval in January.\n\nThe U.S. Securities and Exchange Commission (SEC) has granted final approval for spot exchange-traded funds (ETFs) that hold Ethereum’s ether (ETH), marking a significant milestone for the crypto market. With this decision, American investors now have access to a second major cryptocurrency through easily tradable vehicles, following the earlier approval of Bitcoin (BTC) ETFs in January.\n\nEthereum ETFs: A Gateway to Crypto Investment\n\nPackaging Ethereum in an ETF wrapper is expected to make it more appealing to conventional investors, who can now buy and sell these funds through traditional brokerage accounts. Since their debut earlier this year, Bitcoin ETFs have attracted substantial investment, and experts predict a similar trend for Ethereum ETFs. Matt Hougan, Chief Investment Officer at Bitwise, stated, “We’ve now fully entered the ETF era of crypto. Investors can now access more than 70% of the liquid crypto asset market through low-cost ETPs.” Hougan says he expects the first few weeks could be choppy, “as money may flow out of the $11 billion Grayscale Ethereum Trust (ETHE) after it converts to an ETP,” although he expects a new ETH all-time high by the end of the year.\n\nAs noted, the conversion of Grayscale’s Ethereum Trust (ETHE) into a spot ETF will be a crucial development. ETHE, which offers institutional investors exposure to ETH, previously enforced a six-month lock-up period on its shares. With the transition to an ETF structure, traders can buy and sell more easily. The narrowing discount of ETHE to net asset value suggests that investors who bought Ethereum below par may redeem shares at NAV price upon conversion.\n\nEthereum vs. Bitcoin ETFs: A Comparison\n\nAnalysts often compare Bitcoin to “digital gold” and describe Ethereum to the “open-source App Store.” While Bitcoin serves as a store of value, Ethereum’s underlying technology enables a wide range of decentralized applications (DApps). Investors seeking exposure to the thousands of applications utilizing blockchain technology are likely to find Ethereum ETFs appealing.\n\nPrice Sensitivity and Inflows\n\nThe approval of spot Bitcoin ETFs earlier this year significantly impacted BTC’s price, driving it to new all-time highs. Now, attention turns to Ethereum. Crypto analytics firm Kaiko suggests that ETH’s price will be “sensitive” to inflows from the newly approved ETFs. Investors are keenly watching the potential impact on the market, especially considering the underwhelming demand for futures-based ETH ETFs launched in late 2023.\n\nBlackRock and Other Asset Managers Join the Fray\n\nAsset management giant BlackRock is actively preparing for the launch of its ETH ETF. The fee structure for BlackRock’s Ether ETF indicates its commitment to establishing a competitive presence in the emerging market. Other asset managers are following suit, each offering varied fee structures to attract investors.\n\nThe Road Ahead\n\nAs Ethereum ETFs begin trading, the crypto community eagerly awaits their impact on prices and broader altcoin markets. For example, a potential driver for Solana’s alpha momentum in the last week may be an indication that following Ether’s spot ETF launch, SOL may be next in line. Eric Balchunas, a popular Bloomberg ETF analyst who has often been the first to break pertinent news and information wrote on X last week, that after the ETH ETF launch “then Solana, and then.. it’s prob never going to end. The dam has broken.” His tweet didn’t just create momentum for ETH, but also for a few other large-cap alts like Avalanche (AVAX).\n\nIndeed, investor confidence in the broader altcoin market may also receive a boost. As Ethereum gains more mainstream exposure through ETFs, other altcoins could benefit from increased attention and investment. At the same time the interplay between Bitcoin and Ethereum prices will be closely watched, as both cryptocurrencies often influence each other.\n\nConclusion\n\nThe approval of Ethereum ETFs opens new avenues for investors, potentially reshaping the crypto landscape. Whether ETH’s price reaches $4,000 remains to be seen, but the crypto ETF era has undoubtedly arrived."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxNMHU4Y2JxR0J3SjMzS2sxbEx3anJxY3lfOU5IU2g2VGhxRnItZ2t5UXFxdEVxSm5NcVJjak16SXZ2eWtJb1A3VHdLcGJDX01wb3RvTUlJQm00bHZheFZGcTNpVElVRDlmUjNMWENLbWRvTUYxY2hRR05xMWtpZUxSbnhCWkZ4MmU4UGMxRFlaUE05aTQ0Mmc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jul 2024 07:00:00 GMT",
        "title": "Grayscale Transfers $1.01B Ethereum to Coinbase Prime - Crypto Times",
        "content": "Recent reports indicate that Grayscale transferred $1.01 billion worth of Ethereum to Coinbase Prime. This is in preparation for the U.S. debut of Ethereum-based exchange-traded funds (ETFs), which have been approved to start trading as from today.\n\nThis early transfer has led market speculators to wonder if Grayscale might reallocate its Ethereum holdings to other cryptocurrencies like Solana.\n\nHowever, Jon Campagna, the managing partner at crypto hedge fund Nexyst Digital and a former associate at Coinfund and BlackRock, refuted these claims. In a post on X, Campagna stated that Grayscale is unlikely to reallocate its Ethereum assets.\n\nThis is a bit deceiving. On July 18th Grayscale carved off 1/10 of all ETHE holdings into a new “ETH” ticker for their ETF. They said the new ticker “ETH” would go live and ETHE holders would get their 1/10 ETH etf position tomorrow, July 23rd. In order to fund the 1/10 or 10% of… — Jon Campagna (@thecampsishere) July 22, 2024\n\nThis move follows Grayscale’s recent decision to shift 10% of its Grayscale Ethereum Trust (ETHE) holdings into a separate Ethereum ETF (ETH) on July 18. This transition is part of the preparations for the new fund, which is expected to become active on Wednesday, with ETHE holders receiving proportional ETF positions.\n\nDespite maintaining a 2.5% fee on ETHE, which is higher than its competition, Grayscale’s strategy seems to be aimed at retaining more assets under its management by offering the lower-cost ETH ticker.\n\nFollowing the SEC approval for Spot Ethereum to commence trading, Wintermute, an algorithmic trading firm, predicted that demand for Ethereum ETFs might be lower than anticipated.\n\nHowever, Matt Hougan, chief investment officer at Bitwise Asset Management, remains optimistic and has projected that Ethereum ETFs could reach $15 billion within the first 18 months of trading.\n\nMoreover, Grayscale is just one among several major investment firms, including BlackRock, Fidelity, and Franklin Templeton, preparing to launch Ethereum ETFs, with demand for these funds projected to be between $3.2 billion and $4 billion."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxOM09nOUNCWGpLbXJRWE9adURTQkFzZ2llWEtfWklibk9Ody0xVzNST1RraVFwVzdHdUp3bWxTYk9HU0V4RVp6MU4zM3IyZWQ5SWsyMk8yZEZJazlnWTYxcHpSZXdtcXlRaHBHVDFqQ2FOUXp6QUpNQlQzTkJiXzdLdHRYME1GcFgz0gGOAUFVX3lxTFA2Z3lGQnZPOGFOV0xTTWJMOE5YWXRBSU9YcHVGRXVfbk10WjN3S1U3X2N1ckNGNUVvamRKRDQzTGhYMzVMQkFVcy1GZC13NDltNDYzTldDNzJTYmJCV19ZQkw5V0Y3WEt5QWx4RGVqVXRnWnBwUHhjRWQzcjh0ejl3WnN0VHZ5U25BOFJ1M1E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jul 2024 07:00:00 GMT",
        "title": "Ether ETFs Make Their Bow, With Uncertainty Ahead - PaymentsJournal",
        "content": "Five spot ether exchange-traded funds (ETF) are slated to begin trading on the Chicago Board Options Exchange. They follow the nine bitcoin ETFs that began selling earlier this year as the only two cryptocurrency plays available to investors on the regular stock market.\n\nThe new ETFs include the 21Shares Core Ethereum ETF, Fidelity Ethereum Fund, Invesco Galaxy Ethereum ETF, VanEck Ethereum ETF, and Franklin Ethereum ETF. To jumpstart the introduction, virtually all of the ETH ETF issuers have announced plans to temporarily waive or discount their fees. The discounts run from 50% fee reductions to full waivers and will be in place anywhere from six months to a year.\n\nThe bitcoin ETFs have been highly successful, with more than $17 billion in net inflows since their introduction. The ether ETFs will face an uphill climb in replicating that success, with some industry experts expecting them to garner anywhere between 10% and 20% of the inflows garnered by the bitcoin ETFs.\n\nAs a less widely traded asset, ether is expected to endure more price volatility than bitcoin. As the world’s second-largest cryptocurrency, ether has a market cap of just over $400 billion, while bitcoin’s market cap is well over $1 trillion. Analysts looking at the ether ETFs are expecting significant price fluctuations after the introduction. For instance, data from research firm Deribit shows that the implied volatility of ether options rose from 56% to 70% in the past week.\n\nNot Mined but Staked\n\nOne key difference between the two cryptocurrencies is that bitcoin is mined, while Ethereum has switched to staking. In September 2022, Ethereum replaced its energy-intensive Proof-of-Work (PoW) mining mechanism with a Proof-of-Stake (PoS) mechanism rooted more in financial transactions. Technically speaking, Ethereum is the blockchain platform, while ether is the cryptocurrency derived from that platform.\n\nThis change transformed how new Ethereum is created, making traditional mining obsolete. Staking involves committing ether as collateral to validate transactions on the Ethereum network, which allows you to earn more ether.\n\nOne upshot of the ether ETFs is that they will almost certainly increase demand for the cryptocurrency, potentially leading to a severe supply shortage. The Ethereum Exchange Reserve, which tracks the amount of ether available on cryptocurrency exchanges, is already at multi-year lows."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxPM3B1NDNGSnJ6dU1yNXdyU1JtWlB5MDlsTTVYUXJYeEg3Tm5aQ0tMeEM1eDdWaHVvX1ROT2tRQWFvU1J2WC1ObHE2M1N6SHBtbFlxRWVDMkJvQVozVWo0SUNheUo1OFFvZWJIamJMSW8tMzZTejBYbXduaWtNbmQyOWJVWUFHSndDVU9pejNrekXSAZgBQVVfeXFMTURIWloyaVlrckRoTFdFbGRERnpBMlY4SURaOUwwRjVqcEVVak1ydk84elRnNGpXUjUxdXVwREhQMUJ0VnhYWkEzaFl0dG5halFlblB1NEhWeG9lNUlHcDZ2RzhsanhYTVI3aXA4bzItUDhoc3hQNWpkXzJVdE1NeXFOR3BJYkdZR082Wkw0b05HNHhSZFpxSlk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Price Climbs to $3,500 Ahead of Spot ETF Trading in US - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEthereum (ETH), the second-largest cryptocurrency by market capitalization, experienced a notable price surge Tuesday hours ahead of spot Ethereum exchange-traded funds (ETFs) officially beginning to trade in the U.S..\n\nTrading for Grayscale’s Grayscale Ethereum Trust (ETHE) and its new Grayscale Ethereum Mini Trust (ETH) has already begun on the NYSE Arca, which opened at 4 a.m. Eastern Time. But trading for other spot Ethereum ETFs, like BlackRock’s iShares Ethereum Trust (ETHA), will begin when the Nasdaq opens at 9:30 a.m. ET.\n\nThe price of ETH jumped from $3,450 to $3,541 over the course of an hour during European trading hours, following the confirmation from digital asset manager Grayscale that its two spot Ethereum ETFs would commence trading.\n\nAD\n\nAD\n\nAs of the latest data, ETH is trading at $3,525, showing a 0.1% increase in the last 24 hours and a more substantial 4.5% gain over the past week.\n\nThe launch of Ethereum ETFs has generated significant interest in the crypto community, with various predictions about their potential impact on the market.\n\nCrypto market maker Wintermute forecasted that spot Ethereum ETFs could attract up to $4 billion in capital inflows over the next year, potentially driving the price of ETH up by 24%.\n\nBitwise CIO Matt Hogan told Decrypt said he's heard traders doubting whether the new ETH funds will see much success—but he's not buying it.\n\n\"Some people are skeptical that the Ethereum ETPs will be successful, and think the Bitcoin ETPs sucked up all the oxygen. They may be right,\" he said. \"But everywhere I look—from the European ETF market to the Canadian ETF market to Coinbase and other exchanges—when you give investors the choice to buy Bitcoin or Ethereum, they end up buying both. I'm not sure why things would be different here.\"\n\nAD\n\nAD\n\nAdding to the positive sentiment, Bitwise, one of the ETF issuers, announced its plans to donate 10% of the profits from its Ethereum spot ETF to Ethereum open source developers, saying it wants to highlight the importance of supporting the underlying technology and ecosystem.\n\nThe enthusiasm for the new ETH funds follows a recent surge in digital asset investment products.\n\nAccording to CoinShares' latest Digital Asset Fund Flows Weekly Report, the crypto market saw inflows of $1.35 billion last week, bringing the total inflows over the past three weeks to $3.2 billion.\n\nNotably, ETH funds have seen a string of weekly net outflows. But last week, ETH funds saw a reversal in their fortunes as investors deposited $45 million. That was enough to outpace Solana funds as the altcoin with the most inflows, year-to-date, at $103 million.\n\n\"The outlook for Ethereum seems to have turned a corner, seeing a further US$45m of inflows last week, overtaking Solana for the altcoin with the most inflows year-to-date,” wrote James Butterfill, Head of Research at CoinShares in a blog post.\n\nEdited by Stacy Elliott."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE56SFhqS2dRaV80SXE1Sjhwem1hVW1EcTE3UTdoSFNnbmpaV2NsemlsaXhBcW5QdUZ6VTk3UEFhVzhvTnNYUjFKMGRaZXg1Q2s5M2JfaEMyVmNyRnNQNklIQ3VqckVlOW1WMlVONU1keHJtcW9KNXVxVTd4YWI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jul 2024 07:00:00 GMT",
        "title": "US Spot Ethereum ETFs Due to Start Trading - Markets Media",
        "content": "Daily Email Feature US Spot Ethereum ETFs Due to Start Trading\n\nThe US Securities and Exchange Commission has approved the start of trading of spot ethereum exchange-traded funds just six months after spot bitcoin EFTs launched in January this year.\n\nTom Duff Gordon, VP international policy at Coinbase, said in an email that the approval marks a significant milestone in the crypto ecosystem, emphasising the ongoing shift towards the global transition to digital assets. He added: “This development highlights that crypto is not merely a trend; it illustrates the transformative digital shift in the financial system. We’re proud to be the custodian for eight of the nine newly approved ETH ETFs, entrusted by many leading financial institutions as a reliable,safe, and secure partner.”\n\nHistory often happen gradually, then suddenly. Crypto is no exception. The approval of spot ETH ETFs today is yet another one of those moments. And it validates what we’ve been saying for years: ETH is not a security. https://t.co/1OGfaNr6ro — paulgrewal.eth (@iampaulgrewal) July 22, 2024\n\nThe SEC approved the launch of bitcoin EFTs in January this year when 10 new ETFs began trading and digital asset manager Grayscale Investments also converted its the Grayscale Bitcoin Trust into an ETF. In May this year the SEC also approved spot ethereum ETFs with market participants expecting trading to begin on 23 July 2024. Ether’s $420bn market cap was second only to bitcoin’s $1.3 trillion market cap as of 19 July 2024, according to data provider Morningstar.\n\nIssuers of ethereum ETFs have already listed bitcoin ETFs – Fidelity, iShares, Bitwise, VanEck, 21Shares, Invesco Galaxy, Franklin Templeton, and Grayscale added Morningstar. The data provider said in a report that WisdomTree and Valkyrie are the two spot bitcoin issuers missing from the spot ethereum list, while 21Shares is issuing its ethereum ETF alone, after joining forces with Ark Invest on its bitcoin ETF. Grayscale Investments will convert its Grayscale Ethereum Trust into an ETF, as it did with its bitcoin trust.\n\nRegardless of your feelings about ether or crypto, this kind of first class TradFi treatment (translating benefits into Boomer-ese and and delivering it in the most preferred inv vehicle on Planet (the ETF) is a major deal. These issuers have over $15T in collective aum. pic.twitter.com/uXR1AL1BxX — Eric Balchunas (@EricBalchunas) July 22, 2024\n\n1/ Hello, X! This is Jenny Johnson, CEO of Franklin Templeton, taking over the account. Our lawyers help keep me measured in my comments, but to say the least, I am THRILLED about $EZET, our second crypto ETF to launch in the market. 🧵 pic.twitter.com/SFyfyDj5Xj — Franklin Templeton (@FTI_US) July 23, 2024\n\n“If spot bitcoin ETFs are an indicator, expect iShares and Fidelity to quickly take over Grayscale as the top ethereum ETFs by assets and volume,” added Morningstar.\n\nBlackRock said in statement that the registration statement for BlackRock’s iShares Ethereum Trust ETF (ETHA), has been declared effective by the SEC and is expected to begin trading on Nasdaq on 23 July 2024. The ETF carries a 0.25% sponsor fee with a one-year waiver reducing the fee to 0.12% on the first $2.5bn assets under management. The asset manager described ethereum, a global technology platform, as similar to an app store that generates value for ether as usage increases and more applications are built on top of it.\n\nJay Jacobs, U.S. head of thematic and active ETFs at BlackRock, said in a statement: “Our clients are increasingly interested in gaining exposure to digital assets through exchange-traded products which provide convenient access, liquidity and transparency. Ethereum’s appeal lies in its decentralized nature and its potential to drive digital transformation in finance and other industries.”\n\nAnnouncement: Today, the Bitwise Ethereum ETF (ETHW) became the first U.S. ETP to publish its Ethereum addresses and set ENS subnames for each address. 1.ethw.bitwise.eth -> 0xa15c…2A69\n\n2.ethw.bitwise.eth -> 0xEd92…b4eF\n\n3.ethw.bitwise.eth -> 0x3339…7cB5\n\n4.ethw.bitwise.eth… pic.twitter.com/SdOGiXkyqP — Bitwise (@BitwiseInvest) July 23, 2024\n\nMany of the largest tradfi asset managers in the world are launching crypto ETPs. It's one of the best things that has happened to the space. They bring a huge endorsement to the validity of this asset class to mainstream investors who were unsure, and they have incredible… https://t.co/vO61qd63mF — Hunter Horsley (@HHorsley) July 22, 2024\n\nOn the eve of the launch of the first spot Ethereum ETFs, a look at the current state of play in #bitcoin ETFs. Most striking (but least surprising) to me is just how much these have traded. Since they listed, this group's turnover (total value traded/avg. daily assets) has… pic.twitter.com/hQ8KKzIBZO — Ben Johnson, CFA (@MstarBenJohnson) July 22, 2024\n\n💥BREAKING💥 BlackRock’s #Bitcoin ETF has surpassed the Nasdaq ETF $QQQ in flows this year Most successful ETF launch ever! pic.twitter.com/C4zY9Ps5cB — Quinten | 048.eth (@QuintenFrancois) July 22, 2024\n\nMorningstar added that SEC only approved ether ETF filings after staking was disallowed, and the average annual reward for ether staking is roughly 2%-4%. As a result, unlike bitcoin, holding ether directly could hold a meaningful performance edge over spot ether ETFs for investors willing to engage in staking.\n\nCrypto ETFs and ETPs listed globally gathered net inflows of $44.5bn through to the end of May this year according to ETFGI, the independent research and consultancy firm. ETFGI said in a report that this is a contrast to the $135.6m of net outflows at the same time last year.\n\nSubstantial inflows can be attributed to the top 20 ETFs/ETPs by net new assets, which collectively gathered $3.1bn during May according to ETFGI. BlackRock’s iShares Bitcoin Trust (IBIT US) had the largest individual net inflow of $1.2bn in May.\n\nBlockworks Research said in a report that the majority of the eight issuers filing for the ether ETF have set fees between 0.19% and 0.25%, with the exception of Grayscale. The Grayscale Ethereum Trust ETF will maintain a fee of 2.5%, and the mini trust will offer a 0% fee for the first six months of trading, up to $2bn in assets under management. Then the mini trust will then charge 0.15%, undercutting all the competitors’ currently advertised rates.\n\n“Interestingly, the mini trust will be seeded with 10% of trust’s current AUM, and investors will receive a proportional distribution of the mini product at creation,” added Blockworks. “Grayscale is likely moving some of its client’s capital into this lower fee product in an attempt to dampen the exodus of funds that was observed with bitcoin trust’s conversion to an ETF. As trading begins, we’ll get our first glimpse into how well this strategy may work for them.”\n\nLaw firm Foley & Lardner said in a blog that the ether ETF approval is a significant milestone for increased institutional and retail investments in crypto ETFs.\n\n“The approval of these applications occurred without much resistance, which is a notable departure from the contentious process that preceded the approval of bitcoin ETFs,” added the law firm.\n\nThe SEC was forced to approve bitcoin ETFs after losing a lawsuit against Grayscale Investments, which had challenged their previous rejections. However, the SEC approved ethereum ETFs without a lawsuit.\n\n“While this maneuver might have been to avoid more litigation and public scrutiny, the approval shows a steady departure from “regulation by enforcement” and a movement toward actions that promote growth in the cryptocurrency industry and investor freedom,” added the law firm.\n\nFoley & Lardner highlighted that the SEC noted the high correlation between spot ether prices and the CME’s futures market. Morningstar also added that the SEC is unlikely to approve another spot cryptocurrency ETF without them first having a regulated market, which has so far been the CME futures market.\n\n“The CME doesn’t currently list any other cryptocurrency futures,” said Morningstar. “It stands to reason that ETF approval is distant for cryptocurrencies other than bitcoin and ethereum.”\n\nInstitutional interest\n\nFoley & Lardner said: “In the coming years, it is very possible we will view the SEC’s decision to approve ether ETFs as an important step in what became a trend of integrating cryptocurrency assets into traditional finance networks through ETFs and other financial instruments.”\n\nCrypto ECN Finery Markets said in its second quarter over-the-counter (OTC) review that the recent approval of crypto-related vehicles has sparked institutional interest in adopting crypto for the long term, demonstrated by the increase in crypto OTC flows. In the first half of this year, the OTC institutional crypto market’s total spot transaction volume rose 95% from the first six months of last year.\n\n“The approval of ETH ETFs may further drive institutional participation in the market,” added Finery Markets “However, we believe that the full impact of ETF approvals on the market may not be fully realized until six to nine months later, as it typically takes this amount of time for innovative products to be fully integrated into financial players’ product portfolios and widely adopted.”\n\nFinery Markets noted that the recent launch of a bitcoin ETF in Australia, and similar launches in the US and Hong Kong, reflect global interest in crypto investment vehicles. In addition, issuer VanEck’s recent application for a Solana ETF highlights this growing trend.\n\nWe at @vaneck_us are pleased to announce that @CBOE just filed our 19b-4 to list and trade shares of the FIRST Solana exchange-traded fund in the US! We look forward to engaging with the SEC during the review period. — matthew sigel, recovering CFA (@matthew_sigel) July 8, 2024\n\n“These developments signify a changing regulatory environment that is becoming more favorable towards digital assets,” added Finery. “This shift is important as it provides traditional financial institutions with a clear path to enter the crypto space using established financial instruments, taking advantage of current market conditions.”\n\nFuture trends\n\nNate Geraci, president of The ETF Store, said:\n\nPrediction… An ETF issuer will file for combined spot btc, eth, & sol ETF in next few months. We’re quickly heading down path towards index-based & actively managed crypto ETFs. — Nate Geraci (@NateGeraci) July 22, 2024\n\nBrett Harrison, founder and chief executive of Architect Financial Technologies, said:\n\nNow that spot ETH ETFs are set to begin trading next week, a question remains — what is holding the SEC back from approving spot BTC ETF options? Options on BTC future ETFs were available within days of their underlying ETFs’ listings, but to list options on spot commodity ETFs… — Brett Harrison (@BrettHarrison88) July 17, 2024\n\nIn May this year the New York Stock Exchange said in a statement it is collaborating with CoinDesk Indices to launch cash-settled index options tracking the CoinDesk Bitcoin Price Index, which has been operating since 2014.\n\nThe XBX index benchmarks $20bn in ETF assets under management, and tracks the spot price of bitcoin, denominated in U.S. dollars, in real time across multiple crypto exchanges. It is calculated and published once per second, 24 hours per day, 365 days each year.\n\nAndy Baehr, head of product, CoinDesk Indices, said in a statement at the time: “Collaborating with the NYSE to launch XBX index options opens a new chapter in digital assets, placing important and familiar risk-management tools in the hands of U.S. and global investors.”\n\nIn July this year Eurex said it is expanding its crypto derivatives portfolio with the launch of FTSE Ethereum index futures and options as of 12 August 2024. The derivatives arm of Deutsche Börse Group launched FTSE Bitcoin Index futures and options in 2023 and more than 100,000 contracts, equivalent to over $3.5bn in notional, have been traded.\n\nFTSE Russell developed the index with Digital Asset Research. The index captures data from vetted assets and exchanges to meet EU Benchmarks. The final settlement rate of the Eurex contracts is determined as the volume time-weighted average of the FTSE DAR Digital Asset Price over a 15 minute period prior to the fixing time."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxPVFdXQXpvSm40QUFlSTdjRGFka1VnS2NLQUJEcVJ5aUVDRldsUXN4R3hEVi1HSDNkMkcxVm1yVzBjdEI3ZHpNaWs3VC1ud3ZiWVFDU01IRGZET2MyQVRvR29vNV9UWDMtNG53RDBVRXhXazh4UUx2d19kWjRWZTU0SUNQONIBiAFBVV95cUxNU3VwVGF6dE80Sl9oYVBaU2lLU2pqM1lxSUQwbkVSbDZ6bENJV3ZrZldDXzZuYkdKSWExUjRIVmRXbzdyd3Vrb2lvcHRPR1ZpdXRaY1JhWGQyYnItTmhGcGE5N3JSamNxejNneVljdkUzUlZlVkRUd3djUk9JQW1XSmR1RU5HVEhF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Turns 10: A Decade of Blockchain Revolution - CryptoPotato",
        "content": "Over the past ten years, Ethereum has transformed the blockchain landscape.\n\nFrom its initial coin offering to becoming the second-largest crypto by market cap, Ethereum has continuously evolved, implementing major upgrades like the shift to Proof-of-Stake (PoS) and Layer 2 scaling solutions and cementing its position as a cornerstone of the Web3 ecosystem despite the emergence of several alternatives over the years.\n\nEthereum’s 10-Year Journey\n\nReflecting on its origins, Ethereum Foundation researcher Justin Drake pointed out that Ethereum’s initial coin offering (ICO) began on July 22, 2014, with the price being 2,000 ETH per sale unit per BTC in a fully permissionless environment devoid of venture capital influence or vesting periods.\n\nThis rate only applied for the first 14 days. After that, the price began to decrease gradually, with each subsequent day offering fewer ETH per unit. By the end of the sale period on September 2, 2014, the rate had dropped to 1337.077 ETH per unit.\n\nFast forward to today, and the value dynamic has shifted dramatically. Now, 1 BTC buys less than 20 ETH. Drake pointed out that few assets have matched Bitcoin’s performance over the past decade, and even fewer have surpassed it by a factor of 100.\n\nEthereum has evolved into a crucial component of the blockchain ecosystem. So far, 4.3 million ETH has been burned for gas fees since the introduction of EIP-1559, and many more are expected to be burned with the introduction of blob transactions.\n\nAdditionally, Ethereum’s staking mechanism now provides $100 billion in economic security, ten times more than Bitcoin, and supports DeFi and restaking, vastly improving the Internet of Value’s economic bandwidth.\n\nEthereum’s Institutional Journey Begins\n\nAll eyes are on the spot Ether ETF, which, according to Drake, further signified Ethereum’s growing recognition as a digital commodity, marking the beginning of the crypto asset’s institutional journey.\n\nThe Chicago Board Options Exchange (CBOE) will debut five spot Ethereum exchange-traded funds (ETFs) on July 23, pending final regulatory approval, as announced by the agency last week. This follows the US Securities and Exchange Commission’s (SEC) approval on May 23, which greenlighted the listing of several spot Ether ETFs.\n\nThe five Ethereum ETFs scheduled for launch are the 21Shares Core Ethereum ETF, Fidelity Ethereum Fund, Invesco Galaxy Ethereum ETF, VanEck Ethereum ETF, and Franklin Ethereum ETF.\n\nTo attract investors and secure a market position, most of the ETH ETF issuers are planning to offer temporary fee reductions or waivers as the funds start trading."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxOS3BNQ3B5WVJEcnM3ckE2YlREdzlGS3Mxd1phalBrSXhNMXFiaFVnQ3NqZHFOTlJCTkpGLWpza3M2Y1ZiX2NSS0dmX1Z0Y0haQ3hYTGlRYzVfN3dxLVcxNTRrRGNLUVRiTXBoZ3ZZSWZRWG1aV3I4YUExUkU1TkM5T3Z4bm5hXzFFSXdXNGJ1azhTa0FObEFPTEdQMEFlTnptbmhtbmNXa25YMlJXTFVocFJaV3JZblhCLVgw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jul 2024 07:00:00 GMT",
        "title": "Crypto Specialist Bitwise Launches Spot Ethereum ETP (ETHW); Firm’s Seventh ETP Since 2021 - StockTitan",
        "content": "Crypto Specialist Bitwise Launches Spot Ethereum ETP (ETHW); Firm’s Seventh ETP Since 2021\n\n07/23/2024 - 09:15 AM\n\nBitwise’s eighth publicly traded crypto fund, ETHW, has a management fee of 0.20% , is publishing the fund’s public wallet addresses for transparency, and will donate 10% of annual profits to Ethereum open-source developers\n\nSAN FRANCISCO --(BUSINESS WIRE)-- Crypto specialist Bitwise Asset Management announced today the launch of the Bitwise Ethereum ETF (ticker: ETHW) on the New York Stock Exchange. ETHW has a low management fee of 0.20% , with the fee set to 0% for the first six months on the first $500 million in assets.1 The fund invests directly in ether (ETH), the world's second-largest crypto asset2 and the driving force behind the Ethereum blockchain.\n\nInvestors should note that, unlike many other exchange-traded products, ETHW is not registered under the Investment Company Act of 1940 and is not subject to its regulations.\n\n“The World’s Most Interesting Crypto Asset”\n\n“We believe Ethereum is the world's most interesting blockchain, and an exchange-traded product gives investors much-awaited exposure to its potential,” said Bitwise CIO Matt Hougan. “Investing in ETH is like making a 'picks and shovels' investment in the underlying infrastructure behind tokenization, stablecoins, DeFi, NFTs, decentralized social media, and other killer apps in the blockchain space. Ethereum is also the platform of choice for big brands like Nike, JPMorgan, and others as they experiment with public blockchains.3 And now, thanks to ETHW, investors can gain exposure to Ethereum's growth potential and diversify their crypto exposure with the ease and familiarity of buying a stock.”\n\nEthereum has become the primary platform for stablecoins and DeFi, whose markets today are around $150 billion each.4 Growing awareness of Ethereum’s potential has driven ETH, the asset that powers it, to a market cap of more than $400 billion—second only to bitcoin among digital assets.5\n\nETHW: Blockchain-Native Features, Managed by Veteran Crypto Asset Manager\n\nETHW features several key characteristics:\n\n10% of gross profits to be donated to Ethereum open-source developers. Bitwise has committed to donating 10% of all ETHW profits to two organizations: Protocol Guild, a grassroots funding organization that supports more than 170 core contributors to Ethereum Layer 1 protocol research and development, and PBS Foundation, a non-profit that funds open-source Ethereum block relays and surrounding research. “Ethereum, as an open-source technology, is maintained by a dedicated community of open-source developers,” said Hong Kim, Bitwise’s Chief Technology Officer. “Every investor in ETHW wants Ethereum to continue to advance, and this donation program contributes to that goal.”\n\nBitwise has committed to donating of all ETHW profits to two organizations: Protocol Guild, a grassroots funding organization that supports more than 170 core contributors to Ethereum Layer 1 protocol research and development, and PBS Foundation, a non-profit that funds open-source Ethereum block relays and surrounding research. “Ethereum, as an open-source technology, is maintained by a dedicated community of open-source developers,” said Hong Kim, Bitwise’s Chief Technology Officer. “Every investor in ETHW wants Ethereum to continue to advance, and this donation program contributes to that goal.” Builds on the historic success of Bitwise’s spot bitcoin ETP. ETHW’s debut comes just over six months after the launch of Bitwise’s first spot bitcoin ETP, BITB, which became one of the top 25 fastest-growing exchange-traded products of all time. 6 Today, BITB has more than $2.7 billion in assets and is one of the most liquid bitcoin ETPs. BITB is not registered under the Investment Company Act of 1940 and is not subject to its regulations.\n\nETHW’s debut comes just over six months after the launch of Bitwise’s first spot bitcoin ETP, BITB, which became one of the top 25 fastest-growing exchange-traded products of all time. Today, BITB has more than in assets and is one of the most liquid bitcoin ETPs. Built by a crypto specialist firm. Investors in ETHW gain access not only to a product built with Bitwise’s specialist expertise, but high-quality insights, industry-leading research, and a nationwide distribution team they can call on to understand what’s happening in the industry.\n\nInvestors in ETHW gain access not only to a product built with Bitwise’s specialist expertise, but high-quality insights, industry-leading research, and a nationwide distribution team they can call on to understand what’s happening in the industry. Becomes Bitwise’s 20th crypto product. Bitwise’s comprehensive array of crypto products grows to 20 with the addition of ETHW. It joins a suite that features seven other publicly traded funds—including the world’s largest crypto index fund—along with separately managed accounts, private placement vehicles, and multi-strategy solutions.\n\n“2024 has been a landmark year for crypto as it moves firmly into the mainstream,” said Bitwise CEO Hunter Horsley. “The launch of both spot Bitcoin and spot Ethereum ETPs has opened up crypto’s groundbreaking potential to millions of people through one of the most popular investment vehicles in the world.7 The debut of the Bitwise Ethereum ETF reinforces the core mission that has driven us since 2017: Day in and day out, we’re here to help people understand and access the opportunities in crypto.”\n\nBitwise Offers Wide Range of Crypto Insights\n\nIn addition to its expansive product suite, Bitwise offers a wide range of insights, including the Weekly CIO Memo, topical white papers, interactive tools, and other key resources—including an Ethereum library—available in the Bitwise Expert Portal.\n\nETHW and BITB are not suitable for all investors. An investment in ETHW or BITB is subject to a high degree of risk, has the potential for significant volatility, and could result in significant or complete loss of investment.\n\nTo view the Fund's prospectus, click here.\n\nTo learn more about ETHW, visit ethwetf.com.\n\nRisks and Important Information\n\nThis material must be preceded or accompanied by a prospectus. Please read the prospectus carefully before investing. To obtain a current prospectus visit ETHWetf.com/prospectus.\n\nThe Bitwise Ethereum ETF (“ETHW” or the “Fund”) is not suitable for all investors. An investment in ETHW is subject to a high degree of risk, has the potential for significant volatility, and could result in significant or complete loss of investment.\n\nETHW is not an investment company registered under the Investment Company Act of 1940 (the “1940 Act”) and is not afforded its protections.\n\nShares of ETPs are bought and sold at market price (not NAV) and are not individually redeemed from the Fund. Brokerage commissions will reduce returns. The NAV may not always correspond to the market price of ether and, as a result, Creation Units may be created or redeemed at a value that is different from the market price of the Shares. Authorized Participants’ buying and selling activity associated with the creation and redemption of Creation Units may adversely affect an investment in the Shares.\n\nETHW will not participate in the proof-of-stake validation mechanism to earn additional ether or seek other means of generating income from its ether holdings.\n\nThe amount of ether represented by a Share will continue to be reduced during the life of the Fund due to the transfer of the Fund’s ether to pay for the Sponsor’s management fee, and to pay for litigation expenses or other extraordinary expenses. This dynamic will occur irrespective of whether the trading price of the Shares rises or falls in response to changes in the price of ether.\n\nThere is no guarantee or assurance that the Fund’s methodology will result in the Fund achieving positive investment returns or outperforming other investment products.\n\nInvestors may choose to use the Fund as a means of investing indirectly in ether. An investment in the Fund is not a direct investment in ether. Because the value of the Shares is correlated with the value of the ether held by the Fund, it is important to understand the investment attributes of, and the market for, ether.\n\nEther Risk. There are significant risks and hazards inherent in the ether market that may cause the price of ether to fluctuate widely. The Fund’s ether may be subject to loss, damage, theft or restriction on access. Investors considering a purchase of Shares should carefully consider how much of their total assets should be exposed to the ether market, and should fully understand, be willing to assume, and have the financial resources necessary to withstand the risks involved in the Fund’s investment strategy.\n\nLiquidity Risk. The market for ether is still developing and may be subject to periods of illiquidity. During such times it may be difficult or impossible to buy or sell a position at the desired price. Possible illiquid markets may exacerbate losses or increase the variability between the Fund’s NAV and its market price. The lack of active trading markets for the Shares may result in losses on investors’ investments at the time of disposition of Shares.\n\nRegulatory Risk. Future and current regulations by a U.S. or foreign government or quasi-governmental agency could have an adverse effect on an investment in the Fund.\n\nBlockchain Technology Risk. Certain of the Fund’s investments may be subject to the risks associated with investing in blockchain technology. The risks associated with blockchain technology may not fully emerge until the technology is widely used. Blockchain systems could be vulnerable to fraud, particularly if a significant minority of participants colluded to defraud the rest. Because blockchain technology systems may operate across many national boundaries and regulatory jurisdictions, it is possible that blockchain technology may be subject to widespread and inconsistent regulation.\n\nNondiversification Risk. The Fund is nondiversified and will hold a single issue. As a result, a decline in the market value of a particular issue held by the Fund may affect the Fund’s value more than if it invested in a larger number of issuers.\n\nRecency Risk. The Fund is recently organized, giving prospective investors a limited track record on which to base their investment decision. If the Fund is not profitable, the Fund may terminate and liquidate at a time that is disadvantageous to Shareholders.\n\nBitwise Investment Advisers, LLC serves as the sponsor of the Fund. Foreside Fund Services, LLC serves as the Marketing Agent for ETHW, and is not affiliated with Bitwise Investment Advisers, LLC, Bitwise, or any of its affiliates.\n\nBITB Risks and Important Information\n\nThis material must be preceded or accompanied by a prospectus. Please read the prospectus carefully before investing. To obtain a current prospectus visit BITBetf.com/prospectus.\n\nThe Bitwise Bitcoin ETF (“BITB” or the “Fund”) is not suitable for all investors. An investment in BITB is subject to a high degree of risk, has the potential for significant volatility, and could result in significant or complete loss of investment.\n\nBITB is not an investment company registered under the Investment Company Act of 1940 (the “1940 Act”) and is not afforded its protections.\n\nShares of ETFs are bought and sold at market price (not NAV) and are not individually redeemed from the Fund. Brokerage commissions will reduce returns. The NAV may not always correspond to the market price of bitcoin and, as a result, Creation Units may be created or redeemed at a value that is different from the market price of the Shares. Authorized Participants’ buying and selling activity associated with the creation and redemption of Creation Units may adversely affect an investment in the Shares.\n\nThe amount of bitcoin represented by a Share will continue to be reduced during the life of the Fund due to the transfer of the Fund’s bitcoin to pay for the Sponsor’s management fee, and to pay for litigation expenses or other extraordinary expenses. This dynamic will occur irrespective of whether the trading price of the Shares rises or falls in response to changes in the price of bitcoin.\n\nThere is no guarantee or assurance that the Fund’s methodology will result in the Fund achieving positive investment returns or outperforming other investment products.\n\nInvestors may choose to use the Fund as a means of investing indirectly in bitcoin. Because the value of the Shares is correlated with the value of the bitcoin held by the Fund, it is important to understand the investment attributes of, and the market for, bitcoin.\n\nBitcoin Risk. There are significant risks and hazards inherent in the bitcoin market that may cause the price of bitcoin to fluctuate widely. The Fund’s bitcoin may be subject to loss, damage, theft or restriction on access. Investors considering a purchase of Shares should carefully consider how much of their total assets should be exposed to the bitcoin market, and should fully understand, be willing to assume, and have the financial resources necessary to withstand the risks involved in the Fund’s investment strategy.\n\nLiquidity Risk. The market for bitcoin is still developing and may be subject to periods of illiquidity. During such times it may be difficult or impossible to buy or sell a position at the desired price. Possible illiquid markets may exacerbate losses or increase the variability between the Fund’s NAV and its market price. The lack of active trading markets for the Shares may result in losses on investors’ investments at the time of disposition of Shares.\n\nRegulatory Risk. Future and current regulations by a U.S. or foreign government or quasi-governmental agency could have an adverse effect on an investment in the Fund.\n\nBlockchain Technology Risk. Certain of the Fund’s investments may be subject to the risks associated with investing in blockchain technology. The risks associated with blockchain technology may not fully emerge until the technology is widely used. Blockchain systems could be vulnerable to fraud, particularly if a significant minority of participants colluded to defraud the rest. Because blockchain technology systems may operate across many national boundaries and regulatory jurisdictions, it is possible that blockchain technology may be subject to widespread and inconsistent regulation.\n\nNondiversification Risk. The Fund is nondiversified and may hold a smaller number of portfolio securities than many other products. To the extent the Fund invests in a relatively small number of issuers, a decline in the market value of a particular security held by the Fund may affect its value more than if it invested in a larger number of issuers.\n\nRecency Risk. The Fund is recently organized, giving prospective investors a limited track record on which to base their investment decision. If the Fund is not profitable, the Fund may terminate and liquidate at a time that is disadvantageous to Shareholders.\n\nBitwise Investment Advisers, LLC serves as the sponsor of the Fund. Foreside Fund Services, LLC serves as the Marketing Agent for BITB, and is not affiliated with Bitwise Investment Advisers, LLC, Bitwise, or any of its affiliates.\n\n_______________________\n\n1 Until January 22, 2025, the Sponsor has waived its fee on the first $500 million in assets. Other fees such as brokerage and commission expenses may apply.\n\n2 Source: CoinMarketCap.com as of June 30, 2024.\n\n3 ETHW does not invest in Nike or JPMorgan.\n\n4 Source: The Block, DeFi Llama, and Coin Metrics as of June 30, 2024. DeFi market size refers to total value locked (TVL) on decentralized finance applications.\n\n5 Source: CoinMarketMap as of June 30, 2024.\n\n6 Source: Bloomberg.\n\n7 Source: NYSE. https://www.nyse.com/data-insights/2023-the-year-in-us-etps-part-1\n\nView source version on businesswire.com: https://www.businesswire.com/news/home/20240723353039/en/\n\nMedia\n\nFrank Taylor/Stephanie Dressler\n\nDukas Linden Public Relations\n\nBitwise@DLPR.com\n\nSource: Bitwise Asset Management"
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxNQnprWUpZWmxkVHVtVklubTh6VFFGQ2VBR2czR00xa3JkVWVma25LaGZyX2dZcHRLVldoREhFNDdjbUtRTlVnZEZsZWVTMm0xTEVFVzhnRmVBM1g5bnliM2JuMkJqRWVINGJIRWhGVkY1b19JWWhfVl9nQ0FFVU55eF9kVDRLQ1hQNUxKbm5yTU8zRG8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jul 2024 07:00:00 GMT",
        "title": "Still no bank custodians amongst nine approved ETH ETFs - Ledger Insights",
        "content": "Today’s the day that trading starts in Ether ETFs following the long awaited approval by the SEC yesterday. Eight of the nine ETFs have the cryptocurrency held in custody by Coinbase Custody. The only exception is Fidelity Digital Assets, which is looking after the cryptocurrency that underpins the Fidelity ETF. Hence, there are no bank custodians looking after the cryptocurrencies.\n\nThis is despite a reported recent relaxation of rules that previously blocked bank custodians. Either the rule relaxations came too late for these ETFs. Or the ETF issuers decided to stick with the same custodians they used for their Bitcoin ETFs.\n\nIn theory, the SEC’s accounting rule SAB 121 blocks banks from custody because it forces them to include the cryptocurrency on their balance sheet. Given cryptocurrencies are considered high risk, the banks would have to set aside a lot of capital, making custody too expensive.\n\nSAB 121 is still in force despite the House and Senate voting to cancel it. President Biden vetoed their resolutions and an attempt to overturn his veto failed.\n\nCongresswoman Waters revealed that the SEC was discussing SAB 121 modifications with custody banks. This came to light during House debates about overturning the veto. Later that day, Bloomberg reported that banks had been discussing the issue with the SEC since late 2023 and some had satisfied the SEC with their safeguards. Hence, the SEC had agreed they did not need to include the assets on their balance sheets.\n\nIf that’s the case, given custody banks have far higher security budgets than the likes of Coinbase, one would have thought that some of the ETFs might have given the bank custodians a try.\n\nEthereum without staking\n\nMeanwhile, until recently the SEC had treated Ether 2 as if it was a security. It made an about turn in May when it classified it as a commodity, opening the path for yesterday’s approval.\n\nNine ETFs were approved by eight issuers: 21Shares, Bitwise, iShares (BlackRock), Fidelity, Franklin Templeton, Grayscale (2 ETFs), Invesco Galaxy and VanEck.\n\nSeveral asset managers are offering reduced fees, with Van Eck, Bitwise and Franklin Templeton amongst those offering zero sponsor fees for limited periods.\n\n“After the success of our spot bitcoin ETF (EZBC) launch in January, we are proud to add EZET to our growing lineup of digital asset ETFs,” said Patrick O’Connor, Head of Global ETFs for Franklin Templeton. “With EZET, we are thrilled to offer our clients additional access to the digital asset ecosystem within a regulated fund structure that integrates seamlessly into traditional portfolios.”\n\nOne notable difference is that in Europe the popular Ether physical ETPs involve staking. 21Shares Ethereum staking ETP has a market capitalization of $510 million and Coinshares’ equivalent ETP is $293 million. However, Ethereum doesn’t rank in the top five ETPs in Europe. 21Shares Solana staking ETP is number three at $987 million.\n\n“One of the negatives we have seen in the applications is the dropping of staking,” said Chanchal Samadder, Head of Product at asset manager ETC Group. “We believe staking is a fundamental positive within our Ethereum ETP, ET32. Ethereum investments generate cash flows via staking rewards and, therefore, could be valued like a tech stock.”"
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxNT0NHSzZqN1I0T002UVZRWlR3NW5LdktBT0lFNWhpWkpnWTFmbE1zOGVfX0tndGlEUEpjQVZzRXN6cjZqUGMtcTd6eEdpM2JUTGpqa3JTNGJtM05oa2stX24xTHJTdy1oT3hGRGEtVldLQ1dOUzVIWkh3S0k1aEFtTGtXSzl5T0JDTVJnaWNIbFI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETFs soar with $361 million volume in first 90 minutes - CryptoSlate",
        "content": "Spot Ethereum exchange-traded funds (ETFs) debuted to robust investor interest within the first 90 minutes of trading, amassing a total volume of $361 million across the nine newly launched ETFs.\n\nBloomberg senior ETF analyst Eric Balchunas shared the initial data on social media and noted that the impressive start ranks these ETFs among the top 1% in overall ETF volume, comparable to well-established funds such as TLT and EEM.\n\nLeading the pack, Grayscale’s ETHE reported the highest volume at $147.8 million, followed by BlackRock’s ETHA with $71.4 million and Bitwise’s ETHW at $50.4 million. Fidelity’s FETH also saw significant activity — recording $49.3 million in volume.\n\nThe other ETFs that contributed to the remarkable 90-minute total include Grayscale’s ETH with $18.4 million, VanEck’s ETHV with $9.3 million, Franklin Templeton’s EZET with $8.5 million; Invesco’s QETH with $4.0 million and 21Shares’ CETH with $2.0 million.\n\nThese figures highlight the strong demand for Ethereum-based investment vehicles, far surpassing the typical volume for new ETF launches, which often struggle to exceed $1 million on their first day.\n\nAccording to Balchunas:\n\n“As a group, that number [$361 million] would rank them about 15th overall in ETF volume. Compared to a normal ETF launch, which rarely sees more than $1 million on Day One, all of them have cleared that number and then some.”\n\nEarlier, Balchunas had reported that within the first 15 minutes of trading, Ethereum ETFs had already amassed $112 million in volume. This initial surge, while impressive, was about half the volume pace of Bitcoin ETFs on their first day.\n\nBalchunas noted that Ethereum ETFs are performing at about 20% to 25% of the volume recorded by Bitcoin ETFs when accounting for Grayscale outflow, which still represents a very solid showing and is in line with his previous projections.\n\nThe successful initial trading of these Ethereum ETFs reflects growing investor interest in digital assets and their integration into mainstream financial products. This development is expected to further boost the crypto’s visibility and adoption in traditional markets.\n\nFor now, market watchers will be keen to see if this strong start can be maintained throughout the day and what it signals for the future of crypto ETFs.\n\nMentioned in this article"
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxPY1VyQUhUVGZ5LXpJQ1R3cUdONnZmRDhaVnVYOTlnc3BrZC1Sd1V4NTJrOGU2WVBUb1MtQzNuZEF1TF90TjZfUzdSRXEzOTZEbEJHRENaZUEzM01CRHI2REcxVF9DUUlITGZkdzlhMUI3X0ZJUzFwV3AxTjhWZTdIUXBobjdKaFh2UEVPcVN5ekMxbTdpN3BDMFI4R2ZqUDJzcnAwa1JYQ1o3UdIBsgFBVV95cUxOSE9uQTBweHRFZU9zMXRSQTN3cDFHUXVYQUpDcnA2Q2RTZXdCTzhsTmFzRkdtZmNzQ3lCbjFLNVFUYTlPWkV2RHRhbkxrX2pTRnFFMXB0aWRrR2tMZ3hKNFhHMW5wRGNoOE5uZTg4RWpMeVBWQ19heFZpcnFhUWdQNTRhczN0T1NfMnU2UHNjX0FDd01NNmpTNTFYUlI4Zm1yYV9XQy1kV0NiVXF3OUpMMlJB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jul 2024 07:00:00 GMT",
        "title": "Grayscale Shifts $1 Billion in Ethereum to Coinbase Ahead of US ETF Trading Debut - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nCrypto asset manager Grayscale has transferred a hefty sum of Ethereum to Coinbase Prime as exchange-traded funds (ETFs) associated with the asset gear up for a trading debut in the U.S. this week.\n\nGrayscale's transaction of $1.01 billion to Coinbase Prime on Wednesday prompted market participants to suggest Grayscale might be preparing for a sell-off to reinvest in another crypto, such as Solana.\n\nJon Campagna, managing partner at crypto hedge fund Nexyst Digital and formerly associated with Coinfund and Blackrock, dismissed these claims in a Tuesday post on X, saying Grayscale is unlikely to reallocate its Ethereum holdings.\n\nIt comes as Grayscale tipped 10% of its Grayscale Ethereum Trust (ETHE) holdings into its separate Ethereum ETF (ETH) on July 18, Campagna explained.\n\nAD\n\nAD\n\nThe new fund is expected to become active on Wednesday, with ETHE holders receiving their proportional ETF positions.\n\nTo facilitate the move, the asset manager transferred $1 billion, or 10% of their $10 billion AUM in ETHE, to Coinbase Prime, as announced a week earlier by Grayscale, Campagna wrote.\n\n\"What will be interesting is to see the outflows from ETHE as they refuse to lower their ... fee,\" Campagna said. \"My guess is those outflows get recycled into inflows into the lower-cost ETFs, like Grayscale's own 15 basis point fee ETH ticker. Brilliant move by them as they quasi-guarantee more assets stay in-house this way.\"\n\n\"Grayscale is not lowering at all,\" Eric Balchunas, an ETF analyst at Bloomberg, wrote in a post to X on July 18. \"This means they are ten times higher than competition.\" Grayscale is expected to maintain a 2.5% fee on ETHE.\n\nAD\n\nAD\n\nWhile algorithmic trading firm Wintermute has indicated that the demand for Ethereum ETFs might be lower than expected, analysts remain optimistic about their debut on Wednesday.\n\nMatt Hougan, chief investment officer at Bitwise Asset Management, has said Ethereum could reach as high as $5,000, Decrypt previously reported.\n\nEthereum has already begun to move higher, surpassing $3,500 on July 17 after a significant drop earlier in the month.\n\nGrayscale is among several major investment firms, including BlackRock, Fidelity, and Franklin Templeton, preparing to launch Ether ETFs.\n\nDemand for the funds is projected to be between $3.2 billion and $4 billion.\n\nEdited by Sebastian Sinclair"
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxORlRBZi0tSHI5YTlBYXd5bUpGZ0FzN21iRFFxSUJxWVc4NnBFMVI1MnVCSFFTbGpFVXNDRTZxc3hfQU9iWk14c3BFMDNJMlU5a0NHMWJVOFZCbE1QTzdieFJrblBGdVpmX1hHVVdmdG5zMFlsbVRpdHB4U2dzNzJ6N0Z3bnpxdVNKLUhLQXdnQjhtZEY1SkNkam1lWnphSnB2T0ZMc0VLTDhHWTNTTE9vdko2eXJWNWNBR0djcFdxR21nN1RlUExsVkI0UkhuaEM0aElCM1ZDemTSAd4BQVVfeXFMTXVsRWVVa0EyTjBtcEd1R0M4YWlzSjg2b1hJQk8zd3BuTlFCVGFzSVdYcUlRejNfdzNIQ2E2MGFTSmxkVmlCQmxBQmVyZFRyVG1EdGpxNHgxNjJhZXRUdFE0TUp5V2Z0NWYtVGoydnBOWXJlZzhLbGs2V1JWTUkzV2wzMzdKR1BjTkFTQ3dXUnA1aUMtTmkxc09oY29uenBQYm5uT285ellkbWpHWjVMNlVaU0o5TzNIaDFObTBQOHdPMF9ISEJqc3dXU0R4WGRka1BaNjc0SVFQMWIyTkN3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Overtakes Solana With Most Altcoin Inflows Year-to-Date As Positive Sentiment Continues: CoinShares - The Daily Hodl",
        "content": "Digital assets manager CoinShares says that institutional crypto investors are going in heavy on the leading altcoin Ethereum (ETH).\n\nIn its latest Digital Asset Fund Flows report, CoinShares says crypto investment products enjoyed $1.35 billion in inflows last week.\n\n“Digital asset investment products saw further buying with inflows of US$1.35bn last week, bringing the last 3 week run of inflows to US$3.2bn. ETP (exchange-traded product) trading volumes also increased substantially, up 45% week-on-week to US$12.9bn, but representing a lower than usual 22% of the broader crypto market volumes.”\n\nRegionally, the United States and Switzerland saw inflows of $1.3 million and $66 million, respectively.\n\nMinor outflows were experienced in Brazil and Hong Kong to the tune of less than $7.5 million in total.\n\nBitcoin (BTC), per usual, enjoyed the lion’s share of inflows at $1.27 billion.\n\nHowever, the biggest story of last week’s inflows was Ethereum, according to CoinShares.\n\n“The outlook for Ethereum seems to have turned a corner, seeing a further US$45m of inflows last week, overtaking Solana for the altcoin with the most inflows year-to-date (YTD) at US$103m.”\n\nSolana (SOL) enjoyed $9.6 million in inflows. Multi-asset crypto investment vehicles enjoyed $16.7 million in inflows. Litecoin (LTC), Chainlink (LINK), XRP and Cardano (ADA) also brought in inflows of $2.2 million, $0.7 million, $0.5 million and $0.4 million, respectively.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 71,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxObGVaYnZoNzJWMHF6am84aklOQTJlSHI2SnFDTnpNV1REaTRpUGphX01CM0lfVVBDaEsxNURyOUNpUE05ZTMwdEZQbXM5UFRlZWZHRmJyWkJ2Tm9PLTJOX2xEalRXWUwyR0ROSTFfTklHTlBhNTA0bDVtLVRHUU9nZ2lIN3hvMjNfQXfSAZIBQVVfeXFMTUUxeW5YcG1GUi1RQ0lTVjlvR1ozSjRUTHJlQlpYQ3dCeEQ1aURfWjBaUWZKUU5idUpKSURwc19LS1V5RDNqT0RGQ2U1U1MzUTZLTHM1eTk1dW5CTk5PZVAyZjRFbVQwVkVBQjBqTVNUVDl5b1NMTlJDUmdWZzhyM2lSYW9UTjJQbE1wZWs3OVVUQ3c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETFs Hit $107 Million Inflows on Debut: 'Very Solid First Day' - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nU.S. spot Ethereum exchange-traded funds have only been trading for a day, but fresh data from Bloomberg shows they’re off to a “solid” start.\n\nDespite substantial outflows from Grayscale’s Ethereum Trust (ETHE) topping $484 million, the combined total inflows from eight other competitors have dragged the performance into positive territory.\n\nFunds belonging to BlackRock (ETHA) and Bitwise Asset Management (ETHW) topped the list, clocking $266 million and $204 million, respectively, pushing the total inflows, excluding Grayscale, to $590 million.\n\n“The Ethereum ETFs took in $107 million,” Bloomberg analyst James Seyffart tweeted on Tuesday alongside accompanying ETF data. “Very solid first day.”\n\nAD\n\nAD\n\nThe volume for the full day’s worth of trading for the funds also topped $1.1 billion, doubling its $600 million figure achieved halfway through Tuesday, data shows.\n\nIn May, the U.S. Securities and Exchange Commission gave preliminary approval to ETF issuers, providing a pathway to begin listing the funds on exchanges—much to the surprise of crypto industry participants at the time.\n\nWith the initial excitement stemming from that approval now out of the way, some analysts forecast significant holdings flowing into the funds over the next year, bolstering their total assets under management.\n\n\"We may see $5 billion to $10 billion aggregate AUM over the next 12 months,\" Katalin Tischhauser, head of investment research at digital asset banking group Sygnum Bank, told Decrypt.\n\nAD\n\nAD\n\n\"However, it’s likely that the demand from new types of investors will occur more in the first half of 2025 than during this year,\" Tischhauser said. \"Hedge funds will probably move the fastest.\"\n\nThe range and scope of ETH ETF takings is likely to be impacted by the direction and pace of change in the U.S. political and regulatory environment against the crypto industry, she said.\n\nPolitical winds have shifted considerably in recent months, with Vice President Kamala Harris now tipped to lead the Democratic Party in their fight against Former President Donald Trump for a White House bid.\n\nPresident Joe Biden’s decision to bow out of the presidential race this week has renewed optimism among crypto types for a more favorable approach to regulation under a Trump administration.\n\nDespite the changing political landscape, Ethereum ETFs will need to see a build-up in inflows to prove it has an attractive market fit for large investors, Ryan McMillin, chief investment officer at crypto fund manager Merkle Tree Capital, told Decrypt.\n\n“The lead-up for Ethereum was different to Bitcoin as Bitcoin rallied hard into the launch of its ETFs then sold off as entities rotated out of Grayscale,” he said.\n\n“Ethereum didn't really rally into the launch. It caught a bit of a bid, McMillin added. \"Now we need to see sustained demand. That is the real test.”"
    },
    {
        "id": 79,
        "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxNS0dmbHhBd2puWFZrbWZoWThuNUV0ZzB5a2tyQkpMdC1JS1ZXYzhhV3RFWFhWRnNwUFE2UHlNQ3ZkMHNIU0FfZTJOVU1hVWlXUndHeE83Rk1yOHgyUm1fUVNrcURmMXhLdE9yLXZMX2hWbk92M3U1SU5oeDZkMVFSbHNxTWRJamZRNUtXUlVJZ291dzdVQXVRZDloSy1HYWtUODJMd25kbThlZ1J0Qk1ia1JjRy04XzdNdmZTcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jul 2024 07:00:00 GMT",
        "title": "VanEck Launches ETHV: Ethereum ETF Providing Spot Ether Exposure - Business Wire",
        "content": "NEW YORK--(BUSINESS WIRE)--VanEck is today launching the VanEck Ethereum ETF (ETHV), which provides spot ether exposure through an exchange-traded product. ETHV trades on the Cboe BZX Exchange. Sponsor fees will be waived through 7/22/2025 or the first $1.5B in AUM. After that, the sponsor fee will be 0.20%.\n\n“Investing in Ethereum presents an opportunity for pure play exposure to the economics of blockchain software, and we’re pleased to be able to deliver in the U.S.,” said Jan van Eck, CEO of VanEck. “We look forward to engaging with clients about the role ether can play in a diversified portfolio, particularly as an aggressive growth investment.”\n\nVanEck has long been an advocate and vocal leader bringing direct digital assets exposure to the exchange-traded product space. VanEck took the lead in filing for an exchange-traded spot ether product in 2021, and previously was the first established ETF issuer to file for a futures-based bitcoin ETF in 2017, followed by a filing for a spot bitcoin exchange traded fund in 2018. At the start of this year, the firm launched the VanEck Bitcoin Trust (HODL), which provides spot bitcoin exposure.\n\nVanEck’s efforts around digital assets, like in many of the categories where the firm has been an established leader, have been global in focus. The firm’s European arm currently manages 12 crypto exchange-traded products, while its MarketVector index subsidiary was the first regulated index provider to launch a suite of digital asset indexes featuring its flagship Bitcoin & Ethereum Benchmark Rates. A timeline of VanEck’s industry-leading efforts in digital asset thought leadership and product development can be found here.\n\n“This is an exciting day not just for our team, but for investors more broadly,” added Kyle DaCruz, Director, Digital Assets Product at VanEck. “ETHV opens the door for investors who may have been curious about the role ether can play in their portfolio, but who might have been precluded from accessing it for a variety of reasons. It’s important to note that ether and bitcoin are very different assets, providing very different types of exposure. While we’re excited to be introducing ETHV, we’re just as excited to be at the forefront of educating all types of investors as to just what ether is and what makes it unique.”\n\nETHV joins growing suite of VanEck digital assets offerings\n\nETHV joins HODL in a VanEck digital assets fund family that also includes the VanEck Digital Transformation ETF (DAPP), which focuses on those companies driving the growth of the digital assets economy. The firm also oversees several digital assets-focused private vehicles for institutions and accredited investors, and was the first established global asset manager to market in Europe with a range of digital assets ETPs, bringing the firm’s total assets in crypto-linked products to approximately $2B globally.\n\nVanEck’s X feed, @vaneck_us, is a go-to source for updates on the firm’s digital asset efforts and much more. The firm’s digital assets research team, led by Matthew Sigel, regularly publishes deeply researched commentary, insights and predictions for the space, which can be accessed here.\n\nAbout VanEck\n\nVanEck has a history of looking beyond the financial markets to identify trends that are likely to create impactful investment opportunities. We were one of the first U.S. asset managers to offer investors access to international markets. This set the tone for the firm’s drive to identify asset classes and trends – including gold investing in 1968, emerging markets in 1993, and exchange traded funds in 2006 – that subsequently shaped the investment management industry.\n\nToday, VanEck offers active and passive strategies with compelling exposures supported by well-designed investment processes. As of June 30, 2024, VanEck managed approximately $107.7 billion in assets, including mutual funds, ETFs and institutional accounts. The firm’s capabilities range from core investment opportunities to more specialized exposures to enhance portfolio diversification. Our actively managed strategies are fueled by in-depth, bottom-up research and security selection from portfolio managers with direct experience in the sectors and regions in which they invest. Investability, liquidity, diversity, and transparency are key to the experienced decision-making around market and index selection underlying VanEck’s passive strategies.\n\nSince our founding in 1955, putting our clients’ interests first, in all market environments, has been at the heart of the firm’s mission.\n\nGeneral Disclosures\n\nThis is not an offer to buy or sell, or a recommendation to buy or sell any of the securities, financial instruments or digital assets mentioned herein. The information presented does not involve the rendering of personalized investment, financial, legal, tax advice, or any call to action. Certain statements contained herein may constitute projections, forecasts and other forward-looking statements, which do not reflect actual results, are for illustrative purposes only, are valid as of the date of this communication, and are subject to change without notice. Actual future performance of any assets or industries mentioned are unknown. Information provided by third party sources are believed to be reliable and have not been independently verified for accuracy or completeness and cannot be guaranteed. VanEck does not guarantee the accuracy of third party data. The information herein represents the opinion of the author(s), but not necessarily those of VanEck or its other employees.\n\nImportant Disclosures – VanEck Bitcoin Trust (“HODL”) and VanEck Ethereum ETF (“ETHV”)\n\nThis material must be preceded or accompanied by a Prospectus (HODL: click here, ETHV: click here. An investment in the VanEck Ethereum ETF (“ETHV”) or the VanEck Bitcoin Trust (“HODL”) (collectively, the “Trusts”) may not be suitable for all investors. Before investing you should carefully consider the Trusts’ investment objectives, risks, charges and expenses.\n\nInvesting involves significant risk, and you could lose money on an investment in the Trusts. The values of ether and bitcoin are highly volatile, and the value of the Trusts’ shares could decline rapidly, including to zero. You could lose your entire principal investment. For a more complete discussion of the risk factors relative to the Trusts, carefully read the prospectuses.\n\nThe Trusts’ investment objectives are to reflect the performance of the price of ether (in the case of ETHV) or bitcoin (in the case of HODL) less the expenses of each Trust’s operations. The Trusts are passive investment vehicles that do not seek to generate returns beyond tracking the price of ether or bitcoin.\n\nThe Trusts are not investment companies registered under the Investment Company Act of 1940 (“1940 Act”) or commodity pools for the purposes of the Commodity Exchange Act (“CEA”). Shares of the Trusts are not subject to the same regulatory requirements as mutual funds. As a result, shareholders of the Trusts do not have the protections associated with ownership of shares in an investment company registered under the 1940 Act or the protections afforded by the CEA.\n\nAn investment in either of the Trusts is subject to risks which include, but are not limited to, the historically and potentially future extreme volatility of ether and bitcoin, various potential factors that may adversely affect the liquidity of the Trusts’ shares, the limited history of the indices from which the value of ether or bitcoin and hence the value of Trusts’ shares will be determined, potential threats to the Trusts’ respective custodians, and the unregulated nature and lack of transparency surrounding the operations of ether and bitcoin trading platforms, all of which may ultimately adversely affect the value of shares of the Trusts. Please note that this is not an exhaustive list of risks pertaining to the Trusts. Please read carefully the prospectuses for a complete list of potential risks.\n\nBecause shares of the Trusts are intended to reflect the price of the digital assets held in the Trusts, the market price of the shares is subject to fluctuations similar to those affecting digital asset prices. Additionally, shares of the Trusts are bought and sold at market price, not at net asset value (“NAV”). Brokerage commissions will reduce returns.\n\nThe Trusts’ shares trade like stocks, are subject to investment risk and will fluctuate in market value. The value of the Trusts’ shares relate directly to the value of the digital assets held by the Trusts (less their expenses), and fluctuations in the price of the digital assets could materially and adversely affect an investment in the Trusts’ shares. The price received upon the sale of the shares, which trade at market price, may be more or less than the value of the digital assets represented by them. The Trusts do not generate any income, and as the Trusts regularly issue shares to pay for the Sponsor’s ongoing expenses, the amount of digital assets represented by each Share will decline over time.\n\nThis content is published in the United States for residents of specified countries. Investors are subject to securities and tax regulations within their applicable jurisdictions that are not addressed on this content. Nothing in this content should be considered a solicitation to buy or an offer to sell shares of any investment in any jurisdiction where the offer or solicitation would be unlawful under the securities laws of such jurisdiction, nor is it intended as investment, tax, financial, or legal advice. Investors should seek professional advice for their particular situation and jurisdiction.\n\nThe Sponsor of the Trusts is VanEck Digital Assets, LLC. The Marketing Agent for the Trusts is Van Eck Securities Corporation. VanEck Digital Assets, LLC., and Van Eck Securities Corporation are wholly owned subsidiaries of Van Eck Associates Corporation.\n\n© Van Eck Associates Corporation, 666 Third Avenue, New York, NY 10017\n\nPhone: 800.826.2333\n\nEmail: info@vaneck.com\n\nImportant Disclosures – VanEck Digital Transformation ETF (“DAPP”)\n\nThe VanEck Digital Transformation ETF (“DAPP”) does not invest in digital assets directly or indirectly through derivatives.\n\nThe further development and acceptance of digital asset networks, which is part of a new and rapidly changing industry, is subject to a variety of factors that are difficult to evaluate, the slowing, stopping or reversing of the development or acceptance of the digital asset networks may adversely affect the price of digital assets and therefore cause the Funds to suffer losses, regulatory changes or actions may alter the nature of an investment in digital assets or restrict the use of digital assets or the operations of the digital asset networks or venues on which digital assets trade in a manner that adversely affects the price of digital assets. Digital assets generally operate without central authority (such as a bank) and are not backed by any government, digital assets are not legal tender and federal, state and/or foreign governments may restrict the use and exchange of digital assets, and regulation in the United States is still developing.\n\nAn investment in the VanEck Digital Transformation ETF (DAPP) may be subject to risks which include, among others, risks related to investing in digital transformation companies, special risk considerations of investing in European issuers, equity securities, small- and medium-capitalization companies, information technology sector, financials sector, foreign securities, emerging market issuers, market, operational, index tracking, authorized participant concentration, no guarantee of active trading market, trading issues, passive management, fund shares trading, premium/discount and liquidity of fund shares, non-diversified and industry concentration risks, all of which may adversely affect the Fund. Emerging market issuers and foreign securities may be subject to securities markets, political and economic, investment and repatriation restrictions, different rules and regulations, less publicly available financial information, foreign currency and exchange rates, operational and settlement, and corporate and securities laws risks. Small- and medium-capitalization companies may be subject to elevated risks.\n\nInvesting involves substantial risk and high volatility, including possible loss of principal. An investor should consider the investment objective, risks, charges and expenses of a Fund carefully before investing. To obtain a prospectus and summary prospectus, which contain this and other information, call 800.826.2333 or visit vaneck.com. Please read the prospectus and summary prospectus carefully before investing.\n\n© Van Eck Associates Corporation, Distributor, a wholly owned subsidiary of Van Eck Associates Corporation\n\n666 Third Avenue, New York, NY 10017\n\nPhone: 800.826.2333\n\nEmail: info@vaneck.com"
    },
    {
        "id": 83,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxOUHlHU2lWSnNnLURtb0ZjY3NqbExVWXBWSmJDdFk4cGN0S3phQUU0b1E1SWtyZnRwa1cyMXRZLTUtSjQxQTQ2LWRibkVpMk1oenhnNWo4cGM5Vk9rUlEtTXREN0dEUUZKR2ZMTXJxdFI4YkFNOWhGVE80d2RHZ0Y4c190ZElSa1h3Y0Rhaw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jul 2024 07:00:00 GMT",
        "title": "Industry group releases Ethereum DeFi handbook - DLNews",
        "content": "A version of this article appeared in our The Decentralised newsletter on July 23. Sign up here.\n\nGM, Aleks here.\n\nHere’s what caught my DeFi-eye recently:\n\nWhy EigenLayer is losing steam.\n\nOne Ethereum group is trying to get ahead of DeFi regulations.\n\nA wrinkle in the $125 million Multichain mystery.\n\nEigenLayer cools off\n\nEigenLayer started the year on a tear.\n\nThe protocol that pioneered “restaking” launched in June 2023. But after folks like Ethereum co-founder Vitalik Buterin warned it could destabilise Ethereum, EigenLayer capped its own growth at the outset, limiting how much crypto users could deposit.\n\nEarly this year, it lifted those caps.\n\nWithin a month, it became the second-largest protocol on Ethereum. As of February 1, EigenLayer users had deposited a little more than $2 billion in crypto.\n\nBy March 1, that figure was just under $10 billion.\n\nJoin the community to get our latest stories and updates\n\nVenture capitalists got in on the action. Andreessen Horowitz invested $100 million. Affiliated “liquid restaking” projects raised millions, too.\n\nAt the time, I wondered: How much of EigenLayer’s value came from users who really believed the protocol was a “groundbreaking evolution” and how much came from the “airdrop farmers” using it as their latest cash cow?\n\nWe’re getting our answer now.\n\nThe total value of crypto in EigenLayer peaked in June at $20 billion. It’s since fallen to just under $16 billion.\n\nThat’s because airdrop farmers are leaving, according to one analyst. Now that restaking airdrops have come and gone, investors seek greener pastures.\n\nBut it isn’t all bad.\n\n“Restaking will continue to be a massive market, and an important influence on the overall Ethereum network,” the analyst, Ian Unsworth of Kairos Research, told me.\n\nA DeFi handbook?\n\nWhile politicians and regulators pass laws that cover stablecoins, centralised exchanges, and crypto-based exchange-traded funds, they’ve largely steered clear of DeFi.\n\nMake no mistake, though: Those regulations will come. And one project is trying to get ahead of the next regulatory onslaught.\n\nThe Enterprise Ethereum Alliance, an industry group, has released its DeFi Risk Assessment Guidelines, an in-depth handbook detailing the risks involved in working with DeFi and how to assess, manage, account for, and mitigate them.\n\nThe guidelines will enable DeFi protocols to take a proactive approach to compliance, while also helping regulators draft regulation that doesn’t stifle innovation.\n\nRegulators in the United Arab Emirates and the European Union are already using the EEA’s guidelines, according to Dyma Budorin, co-chair of the EEA’s DRAMA working group and CEO of blockchain security firm Hacken.\n\nBudorin said the handbook will be useful to traditional financial institutions that are considering jumping into DeFi.\n\n“They don’t know what DeFi risks are, and that’s why they don’t step into DeFi,” he told us. “DeFi protocols that plan to cooperate with old money can use the DeFi Risk Assessment Guidelines as best practice references.”\n\nMultichain hack\n\nWhen crypto bridge Multichain shuttered last summer, citing pressure from Chinese police and an apparent $125 million hack, Fantom Foundation CEO Michael Kong dismissed speculation that it was an inside job.\n\nHe isn’t so sure anymore.\n\nKong, whose firm lost money in the hack, tells me he can’t rule out that someone affiliated with Multichain made off with the loot.\n\nThe Fantom Foundation has made a similar accusation in a Singapore court.\n\n“I was a little bit too trusting of what Multichain was saying to us,” Kong said.\n\nThe Fantom Foundation was able to confirm that Multichain CEO Zhaojun He was arrested and is awaiting charges.\n\nIt was also able to confirm that other employees were arrested, though they were eventually released.\n\nWhile none of the information is conclusive, certain facts have fanned suspicion that last summer’s event wasn’t a garden-variety hack.\n\nFirst of all, the movement of the stolen crypto post-hack was highly unusual.\n\nSecond, Multichain briefly reopened in November, allowing someone to make a complicated, lightning quick arbitrage trade for $1 million.\n\n“We believe it to be someone (or some individuals) from Multichain’s former team,” Kong said.\n\nA Multichain representative could not be reached for comment. The company has not defended itself at any stage in Fantom’s lawsuit in Singapore, which began in 2023.\n\nAnd a person familiar with the inner workings of Multichain told DL News the company’s team didn’t plan an inside job.\n\n“The truth will be known when the police make the case public,” said the person, who requested anonymity out of concern for their family in China.\n\nData of the week\n\nKeep an eye on political memecoins, which have been fluctuating wildly amid the political chaos in the US.\n\nOn Sunday, President Joe Biden dropped out of the race and endorsed Vice President Kamala Harris.\n\nDoland Tremp, a memecoin based on Republican candidate Donald Trump, soared 30% to about 55 cents.\n\nJeo Boden, a play on the president’s name, plunged 59% to about one cent.\n\nA token dubbed Kamala Horris (chart below) skyrocketed 131%.\n\nKamala memecoin jumps on Biden withdrawal. A memecoin inspired by Vice President Kamala Harris jumped after President Joe Biden said he would not seek reelection. (Aleks Gilbert/CoinGecko)\n\nThis week in DeFi governance\n\nVOTE: Arbitrum seeks members for Gaming Catalyst Program council\n\nVOTE: Arbitrum wants to oust DeFi aggregator for “misuse” of grant money\n\nVOTE: Aave considers adding Ethena’s USDe as collateral\n\nPost of the week\n\nHappy birthday to a very special digital asset.\n\nETH is 10 years old today!\n\n\n\nThe ether ICO started July 22, 2014. Back then ETH was sold on Bitcoin at a rate of 2,000 ETH per 1 BTC—totally permissionless, no VCs, no vesting.\n\n\n\nToday 1 BTC buys less than 20 ETH. Few assets have outperformed BTC over 10 years; even fewer have… — Justin Ðrake 🦇🔊 (@drakefjustin) July 22, 2024\n\nETH is 10 years old today!\n\n\n\nThe ether ICO started July 22, 2014. Back then ETH was sold on Bitcoin at a rate of 2,000 ETH per 1 BTC—totally permissionless, no VCs, no vesting.\n\n\n\nToday 1 BTC buys less than 20 ETH. Few assets have outperformed BTC over 10 years; even fewer have… — Justin Ðrake 🦇🔊 (@drakefjustin) July 22, 2024\n\nWhat we’re watching\n\nThis is a neat innovation in KYC. If you pass Binance's due diligence process, you can mint a token that proves this fact, then export your proof-of-KYC to various DeFi tools, including mixers, that proactively screen out bad actors.https://t.co/qLYgh68Vhb\n\n\n\nThoughts? pic.twitter.com/89p73dCadw — John Paul Koning (@jp_koning) July 19, 2024\n\nThis is a neat innovation in KYC. If you pass Binance's due diligence process, you can mint a token that proves this fact, then export your proof-of-KYC to various DeFi tools, including mixers, that proactively screen out bad actors.https://t.co/qLYgh68Vhb\n\n\n\nThoughts? pic.twitter.com/89p73dCadw — John Paul Koning (@jp_koning) July 19, 2024\n\nThere have been several proposals to find common ground between crypto and the government.\n\nOne oft-discussed idea would be to use zero-knowledge technology to vet customers, and create a sort of digital passport they can use from one DeFi protocol to the next. Binance, the world’s largest crypto exchange, has just launched its own crypto passport, which it’s calling an “Binance Account Bound Token.”\n\nBut will it really satisfy lawmakers and regulators?\n\nGot a tip about DeFi? Reach out at aleks@dlnews.com."
    }
]