[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMibEFVX3lxTFBoV3ZmLVNxSlpkbEF0amVYZTVoUnFLcGdWbWVwY21ia05pU3UzOWtlSWwwWmNaSEc5b1otcU1QSlQ1QW5DVGJoQVBIT1BwaVpTalViMG9rVUQwMXVpT0MxSE03TmN2OEEtT0otRQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jul 2024 07:00:00 GMT",
        "title": "Is Ethereum a Good Investment? - Benzinga",
        "content": "Decided Ethereum is a good investment? You can get ETH on eToro or Robinhood today!\n\nJOIN THE MOON OR BUST EMAIL LIST Our team is diligently working to keep up with trends in the crypto markets. Keep up to date on the latest news and up-and-coming coins. EMAIL* Submit Cancel eth Ethereum $2485.06 * *prices delayed up to 10 minutes -5.00% 24H Buy Ethereum MOON BUST 1125 votes\n\nAs one of the leading cryptocurrencies in terms of market capitalization and technological advancements, Ethereum has established itself as a leading blockchain platform with strong utility and potential for growth. But with the volatile nature of the cryptocurrency market, many investors are left wondering, is Ethereum a good investment?\n\nIn this guide, we will delve into the factors that make Ethereum an attractive investment option, as well as the potential pitfalls to look out for. Whether you are a seasoned investor or a curious beginner, gaining insights into Ethereum's investment potential can help you navigate the complexities of the digital currency market.\n\nUnderstanding Ethereum: An Overview\n\nEthereum is not a cryptocurrency — it’s a global computer for running decentralized apps (dApps). Ether (ETH) is the cryptocurrency that powers the Ethereum network, and it's the required form of payment for running your app or processing your transaction on the highly-desired Ethereum blockchain.\n\nWhile Bitcoin is really good as a store of value, it doesn't support smart contracts like Ethereum does. Arguably, Ethereum is equally capable as a store of value. This being said, many prefer bitcoin to store value because of its hard-capped supply. While both the supply of Bitcoin and Ether are increasing, there will never be more than 21 million bitcoin in circulation. With Ethereum 2.0 and EIP-1559 however, Ether may become deflationary, that is, the supply of the token will actually decrease with time.\n\nEther has been competing with Bitcoin for the top spot as the largest cryptocurrency by market capitalization since its release in 2015 and came close to overtaking Bitcoin in February 2018. Both of these coins have hit new all-time highs since then, and there appears to be more room for both to grow in 2024. Some experts predict Ethereum will \"flip\" Bitcoin this market cycle to become the dominant cryptocurrency in the industry.\n\nHow Ethereum Has Performed Since Launch & in 2024\n\nEthereum has had a volatile price history since its launch in 2015. In its early days, Ethereum was trading at just a few dollars per coin. However, during the cryptocurrency boom of late 2017, Ethereum reached a high price of over $1,400. In Nov. 16, 2021, it reached an all-time high of $4,891.70. Since then, Ethereum's price has fluctuated significantly, driven by factors such as market speculation, technological developments, regulatory news and overall market sentiment.\n\nHow Did Ethereum Perform in 2023?\n\nIn 2023, Ethereum performed exceptionally well, experiencing significant growth in its value and market capitalization. The implementation of Ethereum 2.0 brought about scalability improvements and lower transaction fees, making the platform more efficient and attractive to investors and developers. The rise of decentralized finance (DeFi) applications also boosted Ethereum's performance, as more projects were built on its blockchain. Overall, Ethereum solidified its position as a leading smart contract platform and continued to show strong growth potential.\n\nHow Much is Ethereum Right Now?\n\nAs of Jul. 18, 2024, Ethereum (ETH) is priced at $3,406.85\n\nEthereum Price Prediction\n\nPrice predictions are not always accurate, but a Ethereum price forecast can highlight potential investment opportunities. Benzinga has compiled important information regarding ETH future prices to address questions about whether Ethereum will rise in value. Discover ETH price forecasts here.\n\nWhere to Buy Ethereum\n\nDecided you want in on the Ethereum action? Listed below are a handful of exchanges where you can purchase Ether. If you're new to crypto, jump to our guide on How to Buy Ethereum or compare exchanges with the Best Cryptocurrency Exchanges guide.\n\nAdvantages of Ethereum\n\nThe overwhelming performance of Ethereum has attracted traditional and institutional investors alike. Ethereum and other cryptocurrencies provide you with the following advantages over traditional investments that point to Ethereum being a good investment:\n\nVolatility: While this was previously seen as a negative, smart investors have realized market cycle patterns and are able to capitalize on the parabolic gains produced by market bubbles.\n\nWhile this was previously seen as a negative, smart investors have realized market cycle patterns and are able to capitalize on the parabolic gains produced by market bubbles. Liquidity: Ethereum is arguably 1 of the most liquid investment assets due to the worldwide establishment of trading platforms, exchanges and online brokerages . You can easily trade Ethereum for cash or assets like gold instantly with incredibly low fees. The high liquidity associated with bitcoin makes it a great investment vessel if you’re looking for short-term profit. Digital currencies may also be a long-term investment due to their high market demand.\n\nLower inflation risk : Unlike world currencies — which are regulated by their governments — Ethereum has a transparent inflation plan that is subject to less meddling. The blockchain system is infinite, and there’s no need to worry about your crypto being deflated.\n\n: Unlike world currencies — which are regulated by their governments — Ethereum has a transparent inflation plan that is subject to less meddling. The blockchain system is infinite, and there’s no need to worry about your crypto being deflated. Decentralized finance : Ethereum and DeFi are relatively young — non-fungible tokens (NFTs) and many other new applications are becoming more mainstream on a daily basis. This newness brings unpredictable swings in price and volatility, which may create opportunities for massive gains.\n\n: Ethereum and DeFi are relatively young — non-fungible tokens (NFTs) and many other new applications are becoming more mainstream on a daily basis. This newness brings unpredictable swings in price and volatility, which may create opportunities for massive gains. Finality : The consensus mechanism of a blockchain ensures the integrity and security of the transaction record. Ethereum offers customizable consensus methods such as RAFT and IBFT for enterprise networks, which provide quick transaction finality and require less infrastructure than the Proof of Work algorithm.\n\n: The consensus mechanism of a blockchain ensures the integrity and security of the transaction record. Ethereum offers customizable consensus methods such as RAFT and IBFT for enterprise networks, which provide quick transaction finality and require less infrastructure than the Proof of Work algorithm. Tokenization: Ethereum enables businesses to represent any digitally registered asset as a token. By tokenizing assets, companies can diversify their product offerings (e.g. unique paintings), develop new incentive models, as well as fractionalize previously large assets (e.g. real estate) and allow for crowdsourced data management.\n\nDisadvantages of Ethereum\n\nEthereum may play a part in the future of monetary exchange and global computing systems, but it is equally important that you are aware of the concerns surrounding cryptocurrency investing. However, a few are certainly overblown (or will be fixed soon) and mistakenly make some investors think that Ethereum is a bad investment.\n\nVolatility: If you happened to buy Bitcoin on December 17, 2017, the price was $20,000. Weeks later, you couldn’t sell your investment for more than $7,051. Although you would be doing great now, to avoid painful losses in the short term, keep a close eye on the market. This isn't a unique disadvantage for Ethereum as all cryptos (except for some stablecoins) are volatile so this alone doesn't make Ethereum a bad investment by any means..\n\nIf you happened to buy Bitcoin on December 17, 2017, the price was $20,000. Weeks later, you couldn’t sell your investment for more than $7,051. Although you would be doing great now, to avoid painful losses in the short term, keep a close eye on the market. This isn't a unique disadvantage for Ethereum as all cryptos (except for some stablecoins) are volatile so this alone doesn't make Ethereum a bad investment by any means.. High transaction fees : Arguably Ethereum's largest drawback, transaction fees, hold back the network from reaching mainstream adoption. Using Ethereum's blockchain can cost hundreds of dollars, so retail investors with smaller amounts of capital are priced out from using the network. While other smart contract blockchains have cheaper fees, Ethereum has the most applications and use cases built on its blockchain.\n\n: Arguably Ethereum's largest drawback, transaction fees, hold back the network from reaching mainstream adoption. Using Ethereum's blockchain can cost hundreds of dollars, so retail investors with smaller amounts of capital are priced out from using the network. While other smart contract blockchains have cheaper fees, Ethereum has the most applications and use cases built on its blockchain. New regulation: The government is unlikely to let cryptocurrencies remain completely unregulated for long. New regulations could interfere with business models, and cause crashes that are entirely out of your control.\n\nThe government is unlikely to let cryptocurrencies remain completely unregulated for long. New regulations could interfere with business models, and cause crashes that are entirely out of your control. Threat of online hacking : Hacks are a threat facing many cryptocurrency investors. Most exchanges let you buy and sell your cryptos using a mobile app or website. However many users also store their crypto on exchange wallets. This leaves them susceptible to losing their investments should the exchange get hacked, and their private keys being stolen. Cryptocurrency held on most exchanges isn’t insured by the Federal Deposit Insurance Corporation (FDIC).\n\n: Hacks are a threat facing many cryptocurrency investors. Most exchanges let you buy and sell your cryptos using a mobile app or website. However many users also store their crypto on exchange wallets. This leaves them susceptible to losing their investments should the exchange get hacked, and their private keys being stolen. Cryptocurrency held on most exchanges isn’t insured by the Federal Deposit Insurance Corporation (FDIC). Competition: There are a ton of emerging smart contract platforms giving Ethereum a run for its money, namely Binance Smart Chain, Cardano and Polkadot. While these cryptocurrencies offer better scalability than ETH, they lack decentralization and the robust DeFi ecosystem that Ethereum has on its network.\n\nThere are a ton of emerging smart contract platforms giving Ethereum a run for its money, namely Binance Smart Chain, Cardano and Polkadot. While these cryptocurrencies offer better scalability than ETH, they lack decentralization and the robust DeFi ecosystem that Ethereum has on its network. Proof of Work consensus: Although Bitcoin also uses proof of work consensus, this is more of a con for Ethereum. Transactions on Bitcoin are only necessary to transfer the crypto, while Ethereum's network is used for a variety of functions. Proof of work is more expensive and slower than proof of stake, which is currently being used by many ETH competitors.\n\nEthereum Trading Signals\n\nIntoTheBlock provides a fantastic suite of fundamental and technical trading signals to help you make your own informed decision on whether Ethereum is a good investment or not.\n\nHow to Store Ethereum Safely\n\nSo, is Ethereum a good investment? It can be if you do your research, manage your coins properly and keep an eye on the market. Crypto investing is not as simple as calling a broker and buying or selling. You are actively involved in the process, and that means you need a wallet. Cryptocurrency wallets are a fundamental part of the ecosystem, giving you the ability to easily send and receive money.\n\nThere are two types of wallets: software and hardware. MetaMask and Exodus Wallet are typically the best route to go for software wallets, and the Ledger Nano X is the best hardware wallet.\n\nBZ Pro Tip: If you lose access to your wallet’s private key, whatever cryptocurrency was associated with the wallet is now lost forever. The best way to prevent this, is to handle your private key and seed phrase with extreme care. A forgotten seed phrase can remove currency from circulation forever. A memorized seed phrase can carry billions of dollars across borders with 0 physical evidence.\n\nEthereum NFTs\n\nA key driver for Ethereum's blockchain is the rise of NFTs. Almost every high-value NFT is secured by Ethereum's blockchain, including CryptoPunks, Bored Ape Yacht Club, and Art Blocks. Many new users on Ethereum were drawn to its network to invest in NFTs, so if NFTs continue to breach into the mainstream, it's likely Ethereum will continue to gain adoption. While other platforms like Solana and Avalanche have NFTs, the market for non-fungible tokens on these blockchains is magnitudes smaller than that of Ethereum.\n\nDisclaimer: Do not take out a loan to invest in cryptocurrencies like Ethereum. Do not purchase them with credit. Do not do anything that could endanger you or jeopardize your financial future. If you aren’t sure how much risk you are capable of handling, consult a financial advisor who is trained for this.\n\nEthereum vs. Other Investment Options\n\nBitcoin and Ethereum have completely different use cases. Bitcoin acts as a store of value, similarly to gold. Ether acts as a store of value too, while the Ethereum Virtual Machine enables a host of innovative applications such as DeFi, NFTs and the metaverse.\n\nThe Ethereum Virtual Machine allows coders to write programs called “smart contracts.” Ethereum smart contracts can automate thousands of financial products and are the building blocks of NFTs. These smart contracts enable full-fledged applications like decentralized exchanges (DEXs) and automated market makers (AMMs).\n\nWhile very basic smart contracts are technically possible on Bitcoin's blockchain, Ethereum's custom programming language and huge team of developers make it the likely long-term settlement layer. Bitcoin's blockchain acts as a decentralized ledger for processing payments. Ethereum is a ledger with a full computer attached, allowing much, much more than just processing payments.\n\nAs far as which of the two is a better investment, it's impossible to say for sure. It’s likely that both Bitcoin and Ethereum will stand the test of time and coexist peacefully in the future. Bitcoin is ahead now but Ethereum seems to be the clear winner in terms of utility though it is generally more volatile. At the end of the day, your investment decisions must be made by you (or an investment advisor). The best thing you can do is to educate yourself as much as possible before risking any of your hard-earned money, and never invest money you aren’t willing to lose entirely. You don't want to end up on the front page of Wall Street Bets, after all.\n\nShould You Invest in Ethereum?\n\nInvesting in Ethereum can be a risky but potentially rewarding venture. As one of the largest and most established cryptocurrencies, Ethereum has a strong community and a wide range of use cases beyond just digital currency. Its smart contract functionality has enabled the development of decentralized applications and other blockchain innovations. However, like any investment, there are risks involved, including market volatility and regulatory uncertainties. It's important to do thorough research and understand your risk tolerance before deciding to invest in Ethereum.\n\nFrequently Asked Questions\n\nQ Does Ethereum have a future? A Ethereum’s future looks promising with the implementation of Ethereum 2.0, the rise of decentralized finance applications, and the recent adoption of ETH ETFs. Its scalability, security, and adaptability make it an attractive choice for users and developers in the blockchain space. Q How do you mine Ethereum? A Ethereum is an unregulated digital currency that can be mined effectively by most modern graphics cards (GPUs). Mining Ethereum is actually quite simple, and can generate passive income for people with low electricity costs. Q Can Ethereum reach 100k? A According to Changelly, Ethereum could hit $100,ooo by 2033.\n\n***Information is not intended for U.S. users"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxQUGxyZ0ZUXzR2Mm5fcjJudVFNRVhvZ3lNSmU0dHN4QlNEc1l1eGE1bVJZdE9OZHQ1ZXhnYTlvTFJmblZSVkRhNW4zelBscEJ3VUdlMFFiVXpXQjlmQy1jMjZOMUJFOS02VDl6Szk3dnpxNF8tRXJpdk1aVFI5RXRtdF80R2lTTW9YVWJDQw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jul 2024 07:00:00 GMT",
        "title": "What’s Next for Ethereum ETFs Following SEC Approval? - Foley & Lardner LLP",
        "content": "Following the approval and launch of Bitcoin Exchange Traded Funds (EFTs) in January 2024, the U.S. Securities and Exchange Commission (SEC) approved eight Ethereum ETFs for listing and trading on SEC-regulated exchanges on May 23, 2024. The approval represents a significant milestone that paves the way for increased institutional and retail investments in crypto ETFs and addresses critical regulatory issues that have surrounded Ethereum for years. The approval of these Ethereum ETFs is especially noteworthy in light of recent comments by SEC Chairman Gary Gensler who suggested that Ethereum, due to its staking mechanics, might be classified as a security under SEC regulations.\n\nThe approval of these applications occurred without much resistance, which is a notable departure from the contentious process that preceded the approval of Bitcoin (BTC) ETFs. As outlined in our prior article, the SEC only approved BTC ETFs after three federal judges ordered the SEC to grant approval following Grayscale Investments’ victory in court. In Grayscale Investments v. SEC, the D.C. Circuit found the SEC was “arbitrary and capricious” in rejecting Grayscale’s application to list a BTC ETF.\n\nIn contrast, this time the SEC approved the Ethereum ETF applications of its own volition. While this maneuver might have been to avoid more litigation and public scrutiny, the approval shows a steady departure from “regulation by enforcement” and a movement toward actions that promote growth in the cryptocurrency industry and investor freedom.\n\nThis piece begins by explaining what the SEC has approved and why. Next, our team comments on what to expect in the future and what this all means for the cryptocurrency industry and investors going forward.\n\nThe Approval Order\n\nThe SEC approved the listing and trading of eight Ethereum (ETH) ETFs: the Grayscale Ethereum Trust, the Bitwise Ethereum ETF, the iShares Ethereum Trust, the VanEck Ethereum Trust, the ARK 21Shares Ethereum ETF[1], the Invesco Galaxy Ethereum ETF, the Fidelity Ethereum Fund, and the Franklin Ethereum ETF. All the ETH ETF sponsors are familiar names from the first round of BTC ETFs.\n\nThe most important development from the approval order was the SEC heavily implying that ETH is a commodity and not a security. The SEC approved the applications under the rules for commodity-based trust shares. None of the sponsors filed applications under the Investment Company Act of 1940, which is required for ETFs that trade securities. Additionally, the SEC only cited court precedents that involved commodities and not securities to support approving the applications.\n\nThe SEC further justified its approval in ways reminiscent of how it explained approval of the BTC ETFs. Notably, the commission cited the high correlation between spot ETH prices and the Chicago Mercantile Exchange (CME) ETH futures market. This is significant because CME surveillance of spot ETH markets would help detect any market manipulation that could affect the integrity of ETH ETFs.\n\nThe SEC’s approval of the Ethereum ETFs comes with specific conditions, including a prohibition on staking ETH via ETH ETFs. If the sponsors of these ETFs want approval to stake ETH, they will need to submit a proposed rule change and wait for SEC approval.\n\nWhat’s Next?\n\nAlthough the SEC, in late May, approved the sponsors’ applications to list ETH ETFs on public exchanges, we likely will not see the ETFs listed for trading on those exchanges until mid-to-late July, at the earliest. Each sponsor must submit an S-1 filing as a registration statement and wait for SEC approval before the ETFs can actually be listed for trading. Recently, the SEC returned the submitted S-1 forms with slight comments, asking sponsors to resubmit by July 8, 2024, which delayed the expected launch. Bloomberg ETF analyst Eric Balchunas had previously stated that an end of June launch for the ETH ETFs was a “legit possibility,” but recently revised his prediction, suggesting an expected launch date of mid-to-late July, pending the SEC’s review and final approval of the resubmitted S-1 forms.\n\nSimilar to our prediction for the BTC ETFs, we again expect a heated battle for market dominance. Generally, the first movers in the ETF industry box out competitors by gaining significant market share early on. Other factors, such as brand recognition, price competition, commitment to the crypto industry, and developments in disruptive technology may also prove important. But at the moment, it is unclear what factors will affect the ETH ETF market or to what degree each factor will affect the market. Price and market power will likely be important to investment banks, but analyst prowess may be relatively unimportant considering that the ETH ETFs are single-asset funds.\n\nWhile the SEC’s approval of ETH ETFs represents a clear and positive step in the classification of ETH as a commodity, the SEC remains free to argue that ETH staking is an investment contract (a.k.a., a security) subject to its jurisdiction. That said, the SEC cannot rationally assert that ETH alone is not a security in the case of ETH ETFs but that it is a security in other cases. If sponsors want to stake the ETH in the ETFs, the SEC may put up much more a fight than they did in approving the ETF applications in the first place. Notably, the Financial Innovation Technology for the 21st Century Act (FIT21) aims to classify ETH and many other crypto assets as commodities. The House of Representatives passed FIT21 on May 22, 2024, but the bill’s prospects in the Senate are uncertain. It remains to be seen if FIT21 will be the first piece of federal cryptocurrency asset legislation.\n\nThe Approval Order only covers ETH ETFs, not any other single-crypto-asset fund or any multi-asset-crypto-fund. However, the fact that the SEC has now approved two cryptocurrency ETFs shows a shift in the political and regulatory landscape regarding cryptocurrency assets. Even if the SEC treats the “vast-majority” of cryptocurrency assets as securities, the focus will undoubtedly shift to which cryptocurrency asset will be the next to gain ETF approval.\n\nOur Perspective\n\nOverall, this is a positive step forward by the SEC and for the cryptocurrency asset industry, which is piercing mainstream financial markets in aggressive fashion, pushing innovative investment and technology opportunities to the forefront.\n\nThe Approval Order demonstrates that crypto assets can start life as a security and transition to a commodity (or other non-security) over time. Thus, Ethereum’s founders, and the founders of many other cryptocurrency assets, can rest easier knowing that their assets either are or can become so decentralized that the SEC cannot classify them as securities.\n\nEven following the Approval Order, we still expect SEC Chairman Gary Gensler to reiterate his position that most cryptocurrency assets are still securities in the eyes of the SEC. Chairman Gensler affirmed this belief in the wake of approving BTC ETFs, and again in the days leading up to the ETH ETF Approval Order. But we are optimistic that the SEC’s decision to approve two cryptocurrency ETFs demonstrates the SEC staff’s commitment to a “merit-neutral” perspective.\n\nThe Approval Order will stimulate growth in the fledgling United States cryptocurrency retail market. When the ETFs are listed on public exchanges, U.S. investors will be able to buy, sell, and hold ETH in their IRAs, 401Ks, and brokerage accounts. In the coming years, it is very possible we will view the SEC’s decision to approve ETH ETFs as an important step in what became a trend of integrating cryptocurrency assets into traditional finance networks through ETFs and other financial instruments.\n\nWhile the SEC’s action is certainly a good step forward for investor freedom, the SEC is still preventing investors from unlocking the full potential of their investment. The decision to prohibit sponsors from staking ETH in the ETFs likely deprives investors of an average additional 2.61% return on ETH staked for one year. The staking issue will pose many crucial questions going forward: How will sponsors and investors craft staking agreements for each ETF? What will the SEC do when a sponsor submits a proposed rule change to allow staking? Can the SEC resolve this issue amicably by cooperating with the industry, or will the courts have to decide?\n\nWe believe that the SEC cannot credibly assert that ETH alone is a security in some cases but not in other cases, so the freedom to stake ETH in the ETFs should not be as big of an issue the SEC is setting it up to be. Still, the SEC may need to hear that from a judge before it concedes.\n\nIn conclusion, we would be remiss to not remind readers that good governance by cryptocurrency-savvy, ETF-savvy officers and directors, and expert SEC legal advice by counsel, will all be necessary for sustainable market success in this industry. The digital assets industry is still a young, volatile, and highly creative technology sector that is fraught with perils identified as legal and regulatory “risk factors” in several prospectuses.\n\nETFs are complex. Cryptocurrency assets are beyond complex. Sponsors and banks should not seek SEC approval for a cryptocurrency asset ETF, nor should a bank, broker, or RIA contract with a cryptocurrency asset ETF sponsor or authorized participant, unless led and advised by seasoned counsel.\n\nSpecial thanks to Ryan Chatoo, a summer associate in Foley’s Miami office, for his contributions to this article.\n\n[1] On May 31 ARK Invest ended its partnership with 21Shares and is no longer involved with the ETF. The SEC has approved 21Shares to continue under the rebranded name of 21Shares Core Ethereum ETF."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTE9qLVVGQkhfbGFwWG9GbUlYREpaSEl2OW9vVmVONUlzZDJrT0NQMUFQOWlDVXZQOGRpVmx5MVVHQ1gwVmVLV1pKZ0JVdmpaQzJERVhLbmJYQkZFbUFIZUtpU2RpVUlPMmgwTFE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Price History: 2015 To 2024 - Bankrate.com",
        "content": "Advertiser Disclosure\n\nWe are an independent, advertising-supported comparison service. Our goal is to help you make smarter financial decisions by providing you with interactive tools and financial calculators, publishing original and objective content, by enabling you to conduct research and compare information for free - so that you can make financial decisions with confidence.\n\nOur articles, interactive tools, and hypothetical examples contain information to help you conduct research but are not intended to serve as investment advice, and we cannot guarantee that this information is applicable or accurate to your personal circumstances. Any estimates based on past performance do not a guarantee future performance, and prior to making any investment you should discuss your specific investment needs or seek advice from a qualified professional.\n\nHow We Make Money\n\nThe offers that appear on this site are from companies that compensate us. This compensation may impact how and where products appear on this site, including, for example, the order in which they may appear within the listing categories, except where prohibited by law for our mortgage, home equity and other home lending products. But this compensation does not influence the information we publish, or the reviews that you see on this site. We do not include the universe of companies or financial offers that may be available to you.\n\nEditorial disclosure\n\nAll reviews are prepared by our staff. Opinions expressed are solely those of the reviewer and have not been reviewed or approved by any advertiser. The information, including any rates, terms and fees associated with financial products, presented in the review is accurate as of the date of publication."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNTGt5eGF2dWFEVVp0YWhYdndBZGxUaVBFY0RjSjRvQXRXQjkzNVdpMHZKNDJ4TnpmNk1uclVEOThLYzIyR1NUSXIxeTBHVktZS0k0dEMwNkVFR0lxdklHN3lrVGtNSVVVZHVQdXlwN2hrZ3o5c3FUMnBCRGgtYmQ4UERBT1lZNVp2X3RTN0FVa1czZmplUnhwRw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jul 2024 07:00:00 GMT",
        "title": "Is Ethereum a No-Brainer Buy After the Bitcoin Halving? - The Motley Fool",
        "content": "The world's second largest cryptocurrency still has near-term catalysts.\n\nMany cryptocurrencies pulled back a couple of years ago from their all-time highs as rising interest rates drove investors toward more conservative investments. Yet three tailwinds have lifted the broader market this year: expectations for lower rates, the approvals of the first Bitcoin (BTC -4.01%) spot exchange-traded funds (ETFs) in January, and Bitcoin's halving in April.\n\nBut now that Bitcoin has concluded its long-awaited halving, which reduces the rewards for mining Bitcoin every four years, there will probably be fewer near-term catalysts for the world's top cryptocurrency. So is it time to turn our attention toward Ethereum (ETH -6.78%), the world's second largest cryptocurrency, for bigger gains this year?\n\nThe differences between Ethereum and Bitcoin\n\nEther is the native token of the Ethereum blockchain, which was launched in 2015. Ethereum initially used the same energy-intensive proof of work (PoW) mining method as Bitcoin, but it transitioned to the more energy-efficient proof of stake (PoS) method in a process called The Merge in 2022. That transition reduced Ethereum's mining energy consumption by 99.95% and made it deflationary -- which meant more coins were being burned, or permanently removed from circulation, than created. PoS blockchains also allow investors to stake, or lock up, their tokens for fixed periods to earn interest-like rewards.\n\nThe Ethereum blockchain was also developed to support smart contracts, which can be used to create decentralized apps (dApps), smaller tokens, and other crypto assets. Bitcoin's blockchain can be used only to mine more coins. That's why Ethereum is usually valued by the expansion of its developer ecosystem, while Bitcoin is often compared to gold or silver.\n\nThat key difference drove the U.S. Securities and Exchange Commission (SEC) to say that Bitcoin was the only cryptocurrency that could be classified a commodity. That classification supported its approvals of the first spot Bitcoin ETFs.\n\nYet the SEC was reluctant to call Ethereum and other PoS coins commodities, saying the staking process made it similar to securities. Nevertheless, the SEC still cleared the way for Ethereum's first spot-price ETF applications earlier this year.\n\nThe tailwinds and headwinds for Ethereum\n\nEthereum's biggest near-term catalyst will be the potential approvals of its first spot ETFs. The SEC has already reportedly granted preliminary approvals to at least three of the eight planned spot-price ETFs, according to Reuters, and the latest speculation suggests most of those funds could start trading as early as July 23.\n\nEthereum's price has already risen about 50% this year, but the first spot ETFs might drive its price even higher. For reference, Bitcoin's price has rallied more than 40% since the approvals of its first 11 ETFs on Jan. 10.\n\nAnother major catalyst is Ethereum's recent Dencun upgrade, which increases its speed and reduces the gas fees -- essentially network user fees -- for its Layer-2 blockchain. Stabilizing and declining interest rates could also drive investors back to Ethereum and other cryptocurrencies.\n\nYet Ethereum still faces unpredictable headwinds. The Dencun upgrade made Ethereum inflationary again, and its supply will keep rising unless more tokens are burned. It also still processes transactions at a slower rate than newer PoS blockchains such as Solana (SOL -6.89%) and Cardano (ADA -9.13%) -- and those limitations could curb the expansion of its ecosystem.\n\nEthereum's planned spot ETFs also won't feature any staking mechanisms like its underlying tokens, so it might not be a compelling alternative to directly owning the cryptocurrency. Lastly, the market's expectations for lower rates and ETF approvals might have already been baked into its current price.\n\nSo is Ethereum a no-brainer buy right now?\n\nEthereum is trading at about $3,400 as of this writing, but some bullish investors expect it to generate huge gains during the next few years. VanEck's Matthew Sigel and Patrick Bush expect its price to more than triple to $11,800 by 2030, while Ark Invest's Cathie Wood says it could be worth a whopping $166,000 by 2032.\n\nWe should take those rosy estimates with a grain of salt, but I believe Ethereum's spot-price ETF approvals and lower interest rates should limit its downside potential this year. The Ethereum network's next planned upgrade, Pectra, should further increase its speed and lower its gas fees to keep pace with Solana and Cardano. Therefore, I believe Ethereum is still a good cryptocurrency to accumulate right now -- but investors shouldn't necessarily expect it to blast off in the next few months."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxNZVRaYkZCeG50OHdZcG1UR0NlZWhSRGRWX0tEbmh4a0c1YVJIRGp2MmEyMUV4cGs1dkZVRkVOTnFlVG9kaWQ3eVpJdERUTjlEaVNoNWJCOS0zSEhKMER0UTR6eWtmM3BRM1VSSEVrY1hOMmNzcWxfRjhodlR2eGFxSEJQRmgwYzctR2tWM3k5WVFYUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jul 2024 07:00:00 GMT",
        "title": "Cboe confirms trading launch of 5 spot Ethereum ETFs on July 23 - CryptoSlate",
        "content": "The Chicago Board Options Exchange (Cboe) issued listing notifications for five new spot Ethereum exchange-traded funds (ETFs) scheduled to begin trading on July 23 — confirming reports from earlier in the week.\n\nThe notifications clarify that the funds are pending final regulatory approval. The five ETFs are 21Shares’ CETH, Fidelity’s FETH, Franklin Templeton’s EZET, Invesco’s QETH, and VanEck’s ETHV.\n\nEach ETF will be listed on Cboe’s BZX Exchange and quoted on the SIAC Tape B data feed.\n\nSenior Bloomberg ETF analyst Eric Balchunas reported on July 15 that the SEC had instructed issuers to submit final amendments in preparation for a trading launch next week.\n\nSources told Balchunas that the regulator would give the final green light on July 22, setting the stage for a Tuesday trading launch. The issuers subsequently filed amended S-1 forms on July 18, revealing the final details for their funds, including sponsor fees.\n\nThe introduction of these ETFs is anticipated to enhance Ethereum’s liquidity and market depth. Analysts predict that the ETFs will attract a broad range of institutional investors who have been cautious about direct cryptocurrency investments due to regulatory uncertainties.\n\nThe ETFs are expected to pave the way for further institutional adoption, potentially driving Ethereum prices higher. Some analysts project that the token will climb above $5000.\n\nThe launch of these ETFs could mark the beginning of a broader trend of integrating digital assets into traditional financial products. The SEC’s decision may influence other jurisdictions to follow suit, potentially leading to a global expansion of crypto ETFs.\n\nSome firms have already begun work on ETFs linked to other major crypto tokens like Solana and Injective. However, some experts believe the lack of a regulated futures market for these tokens could be a challenge in securing approval.\n\nEthereum was trading at $3515 as of press time, up 2.2% over the past 24 hours, based on CryptoSlate data.\n\nBitcoin Market Data At the time of press 12:43 am UTC on Jul. 20, 2024, Bitcoin is ranked #1 by market cap and the price is up 4.22% over the past 24 hours. Bitcoin has a market capitalization of $1.32 trillion with a 24-hour trading volume of $36.95 billion. Learn more about Bitcoin › Bitcoin $66,736.68 4.22% Crypto Market Summary At the time of press 12:43 am UTC on Jul. 20, 2024, the total crypto market is valued at at $2.43 trillion with a 24-hour volume of $83.85 billion. Bitcoin dominance is currently at 54.19%. Learn more about the crypto market ›\n\nMentioned in this article"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxPUlFIS0J6RDY4RjJpX1B2TkY2eGItWjNzWHUzNnMwOXpYMTFCa3FlX3dmN0thd193MU13LWs5X29pNHdWNklteExfZWtHLXBTUmUzMXVQNVJvYXRZRUVzQ190d193Ukh3ci0tam9lMS1QLUNMMmFpTzI5bHFuRG94YVJYUVNMVjl5emlBcS10dUhpWkU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jul 2024 07:00:00 GMT",
        "title": "Protocol Village: Shape, Creator-Focused Ethereum L2 in Optimism Superchain, Makes Testnet Available - Yahoo Finance",
        "content": "(PROTOCOL VILLAGE EXCLUSIVE) July 18: Shape, a creator-focused layer-2 network atop Ethereum and part of the Optimism Superchain, announced the availability of its testnet, with GA going live in Q3. According to the team: \"The network is an open space where everyone is free to create whatever they want – from high art to weird experiments. Shape ensures creators that thrive on the network share in its success through 'Gasback.' This mechanic rewards cultural impact directly by giving 80% of sequencer fees back to smart contract owners. Shape is powered by Optimism and, as part of the Superchain, contributes 15% of sequencer fees to the Optimism Collective to fund public goods.\"\n\nChainlink Releases 'Digital Asset Sandbox' for Financial Institutions\n\nJuly 18: Chainlink, the blockchain oracle project, announced the launch of the Chainlink Digital Assets Sandbox (DAS), \"designed to accelerate digital asset innovation within financial institutions.\" According to the team: \"The Chainlink DAS is the ideal solution for financial institutions that want to quickly innovate and experience the potential of generating new revenue opportunities, increasing efficiencies, improving time-to-market, and more. With the DAS, institutions can seamlessly access ready-to-use business workflows for digital assets.\" CoinDesk 20 asset: {{LINK}}\n\nSchematic illustrating an\n\nBitrue Ventures Launches $40M Fund for 'Nascent Web3 Companies'\n\nJuly 18: Bitrue Ventures, the research and investment section of crypto exchange Bitrue, has launched a $40 million investment fund and \"is putting out the call to aspiring developers,\" according to the team. A blog post reads: \"Individual recipients of funding can receive up to $200,000 of investment funds that can be allocated however they feel is most appropriate. In addition, Bitrue will make available their various avenues of expertise to provide further support to these projects. While Bitrue Ventures will consider investing into any niche within the crypto space, we believe that the most successful projects right now are likely to be building in the sectors of Artificial Intelligence (AI), Real World Asset tokenization (RWA), GameFi, Decentralized Physical Infrastructure Networks (DePIN), and Decentralized Finance (DeFi). As such, projects building within these industries will stand a better chance of receiving funding.\"\n\nInfStones, Blockchain Infrastructure Provider, Launches Node-as-a-Service\n\nJuly 18: InfStones, a blockchain infrastructure provider, \"launched its node-as-a-service (NaaS) product, empowering emerging protocols to jumpstart their DePIN projects while making sophisticated blockchain node operations accessible to mainstream users,\" according to the team: \"Since 2018, InfStones has provided enterprise-grade node management services to industry-leading groups such as Binance, CoinList and BitGo. In the recent node sale for cloud computing platform Aethir, InfStones’ NaaS product helped to successfully convert over 26,000 of its Checker Node license holders into long-term node operators.\"\n\nStory continues\n\nRaise to Provide Payment Rails for Polkadot Mobile App, Enabling Retail Purchases\n\nJuly 18: Raise, a payments provider and with a white-label gift card infrastructure, has partnered with Parity Technologies \"to provide the payment rails for the Polkadot mobile app, enabling DOT payments at over 1 million stores and websites across the U.S.\" According to the team: \"Users can make purchases and earn up to 20% cash back in DOT. This integration, previewed at Polkadot Decoded, bridges the gap between crypto and retail, making it easier and more rewarding to use crypto for everyday transactions. The app is set to launch in Q3, with plans to expand internationally by the end of the year.\" {{DOT}}\n\nZivoe, RWA Credit Protocol on Ethereum, Raises $8.35M\n\nJuly 18: Zivoe, a real-world asset credit protocol atop Ethereum, raised $8.35 million in their last round, aiming to broaden credit access by connecting blockchain liquidity with real-world borrowers, according to the team: \"The round comes in tandem with Zivoe launching its RWA credit protocol on mainnet on July 31 and their Initial Tranche Offering (ITO), a unique liquidity bootstrapping mechanism.\"\n\nAI-Focused Layer-1 Chain Nuklai Announces Launch of DAO for Governance, Say on Use of Funds\n\nJuly 18: Nuklai, a layer-1 blockchain built for artificial intelligence, announced the launch of the Nuklai DAO, \"a decentralized autonomous organization designed to empower its community and ecosystem,\" according to the team: \"With this development, the company moves towards greater community-driven governance and collaboration. This initiative allows community to have a direct say in the allocation of these funds through proposals and votes on Commonwealth and Snapshot. The launch of the Nuklai DAO will manage the 400,000,000 NAI Community token allocation.\"\n\nPolygon, Google Cloud, Accenture Release White Paper on Web3 Loyalty Programs\n\nJuly 18: Polygon Labs, in collaboration with Google Cloud and Accenture, jointly released a white paper that highlights how Web3 solutions can build high-margin loyalty programs. According to the team: \"The paper highlights how users can enjoy rewards such as tokenized privileges, gamification, collectibles and community-generated content. This not only improves the user experience but also generates new revenue streams for brands while empowering users to actively participate in loyalty programs.\" {{MATIC}}\n\nChainbase Raises $15M to Grow Omnichain Data Network\n\nJuly 18: Omnichain data network Chainbase has raised $15 million in Series A funding with Tencent Investment Group, Matrix Partners and Hash Global among the investors. Chainbase is an interoperability layer that is building the \"first crypto world model,\" to deliver data from across the cryptocurrency spectrum, according to an emailed announcement on Thursday.\n\nFantom Foundation, Sonic Labs Partner With Alchemy for RPC on Opera Chain\n\nJuly 18: The Fantom Foundation and Sonic Labs announced a partnership with Alchemy \"in which the leading Web3 infrastructure provider immediately contributes RPC support (mainnet and testnet) and key development tools to developers on Fantom’s Opera chain.\" According to the team: \"Alchemy will also support the new Sonic network in the same capacity, enhancing its performance and scalability when it launches later this year.\"\n\nOutlier Ventures Partnership With Morgan Creek Digital Brings Accelerator to Latin America\n\nJuly 18: Global Web3 accelerator Outlier Ventures has announced a new strategic partnership with Morgan Creek Digital, to launch their first-ever accelerator program in the Latin American region. According to the team: \"The program seeks to identify startups developing solutions to drive technological and financial innovation across Latin America. The virtual program starts in September and lasts for 12 weeks, offering selected startups support from Outlier Ventures’ in-house team of experts, tailored mentorship from industry experts, networking opportunities with investors, and up to 200K investment.\"\n\nVisa's Data Partner Allium Labs Raises $16.5M as Their New Findings Show Stablecoin Activity is Back Up\n\nJuly 18: Data platform Allium Labs, which provides enterprise-grade blockchain data to companies like Visa, Stripe and Uniswap Foundation, has raised $16.5 million in a Series A funding round, it announced Thursday. The funding round was led by venture capital firm Theory Ventures whose founder Tomasz Tunguz will join the board as part of the investment. Tunguz said “The demand for cryptocurrencies and tokens has just started\" and that Allium will provide the data to \"foster broader adoption.\"\n\nPundi X Launches Payment Solution for Merchants\n\nJuly 18: Pundi X, a blockchain developer, has launched a crypto payment solution, Pundi X Pay for merchants, according to the team: \"This innovative solution is set to transform the landscape of physical store crypto transactions with the omni QR code payment layer, making it easier for merchants and customers to embrace cryptocurrency payments. Pundi X Pay InStore QR Code features include extensive wallet integrations (over 500+ direct wallet apps), flexible payment options, instant digital receipts, and AI-powered multi-chain transactions and security: powered by Pundi X AI.\"\n\nBitGo Integrates Stacks, Enabling Delegate and Solo Stacking\n\nJuly 18: BitGo has integrated Stacks, \"enabling delegate and solo stacking for its clients,\" according to the team: \"This grants them the ability to earn BTC directly within their wallets via a secure and risk-controlled process. Additionally, BitGo now supports the Stacks token standard and acts as a network Signer, contributing to consensus and block production. This Signer role will be crucial for the future launch of sBTC, a decentralized Bitcoin-backed asset.\"\n\nZeebit, Solana-Based Casino, to Rely on Sonic L2 Infrastructure\n\nJuly 18: Zeebit, describing itself as \"Solana's first on-chain casino,\" is \"launching the first fully decentralized risk-on gaming platform on Solana using SonicSVM infrastructure,\" according to the team: \"This on-chain platform features casino classics, PVP games, and novel Web3 experiences with provable fairness and non-custodial settlement. Leveraging Sonic’s scalable L2, Zeebit will migrate its current Solana-based platform, including player histories. Supported by major Web3 VCs and incubated by Solana Labs, Zeebit’s testnet launch will offer various games, followed by a mainnet launch with incentivized campaigns.\"\n\nAethir, DePIN for GPUs, Teams With Beamable for Cloud-Based Game Development, Distribution\n\nJuly 18: Aethir, a DePIN project specializing in GPUs for AI and pixel streaming, and Beamable, a creator-centric platform for building live games, announced a \"strategic end-to-end solution that will empower game studios to develop, build, scale and distribute live games entirely in the cloud,\" according to the team: \"With the launch of this end-to-end solution, developers will be able to store, manage, and process data all on one platform to create more engaging and scalable gaming experiences.\"\n\nProtocol Village is a regular feature of The Protocol, our weekly newsletter exploring the tech behind crypto, one block at a time. Sign up here to get it in your inbox every Wednesday. Project teams can submit updates here. For previous versions of Protocol Village, please go here. Also please check out our weekly The Protocol podcast.\n\nTON Foundation Says Trustless Bitcoin Bridge for DeFi Launched\n\nJuly 17: TON Teleport BTC, a trustless bridge facilitating secure bitcoin (BTC) transfers to and from The Open Network (TON) blockchain, has launched. According to a message from the TON Foundation team: \"This development enables BTC holders to securely engage in DeFi on TON and participate in decentralized exchanges (DEXs), lending platforms, and other applications. The TON Teleport BTC process is entirely trustless and transparent, operating without a centralized issuer. Each BTC on TON is 100% backed by actual BTC, pegged through the teleport process, ensuring secure and reliable transactions.\" {{TON}}\n\nIoTeX 'DePIN Infrastructure Modules' to Reduce Development Time\n\nJuly 17: IoTeX, an Ethereum compatible blockchain platform optimized for decentralized physical infrastructure projects (DePIN), is launching its 2.0 platform to democratize access to DePIN by partnering with NEAR, Filecoin, RISC Zero, Espresso and more, \"to enhance data availability, storage, computation and sequencing,\" according to the team: \"IoTeX 2.0 features DePIN Infrastructure Modules (DIMs) and Modularity Security Pool (MSP) to cut development costs and support sustainable growth for DePIN projects, positioning itself as the largest decentralized hub for devices and data that will be deployed by both humans and AI agents.\" According to a press release: \"The introduction of Modularity Security Pool (MSP) enables DePIN layer-1s to restake their Proof-of-Stake security to DIMs, fueling growth and fostering sustainability within the ecosystem.\"\n\nSchematic illustrating how IoTeX's Modular Security Pool works in conjunction with its DePin Infrastructure Modules (DIMs), designed to reduce development time and initial costs for DePIN applications (IoTeX)\n\n\n\n"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTFBVelRFZ3VWQ3NVaFZfM3FVR181MlRQYV9EVlN3bGVpejNfUks0UFZyTzhwMkNyeWl5NTE0b3hiV3hKM253OFJHR3MxUXQyNENpV0JTT2tERkgtN3I5UjVvbHg3U1ItN0xTQTlxOHU1cnZPbUlGazVJ0gF8QVVfeXFMTjVHalc2MU5ob0dzN3pTZHk5a29TY3dpM2FtTzdBem8wSHg3czZWVVYtT0N3VnFtWm5VRW1FWlhYTERvSXVXWmh6UUFZb2ZldWFvRmFmLUNPVWg2V2cyb0QtTFlUWXdTODlVYXhPYXJuam9TajBkUV9mT3FYSw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jul 2024 07:00:00 GMT",
        "title": "Ethereum VS Solana: Which Blockchain is Better for Minting NFTs? - CryptoPotato",
        "content": "If you’re struggling to decide between choosing Solana or Ethereum to mint your Non-Fungible Tokens (NFTs), you have come to the right place. In this guide, we’ll explore each blockchains’ strengths, capacities, weak points, and overall differences so you can make a better decision that suits your goals in the NFT market.\n\nEthereum: Ecosystem, Marketplace, and Security\n\nEthereum is undoubtedly the largest ecosystem in the DeFi (decentralized finance) sector, with thousands of projects of all kinds building on it. So it’s no surprise that the vast majority of NFTs are running on it as ERC-721 tokens.\n\nTo be accurate, roughly 95% of all the NFT ecosystem uses Ethereum, so it’s no coincidence that when investors look for an NFT marketplace, the first one they usually run up to is OpenSea, Rarible, Nifty Gateway, and more.\n\nWhen it comes to size, Ethereum takes the lead with a much bigger pool of buyers and sellers – or, in other words, trading volume. So if you mint NFTs in an Ethereum-based marketplace like OpenSea, you could get more exposure and people willing to buy or place bids on your NFTs. On the other hand, everyone knows there’s also a huge supply of NFTs that no one would ever like to buy or bid for.\n\nWant to mint your first NFT on OpenSea? Check our step-by-step guide here.\n\nEthereum’s attributes make it one of the top ecosystems for starting a DeFi project. Its data architecture and security components are the reason why so many developers are building on top of its blockchain.\n\nHowever, when network activity increases exponentially (which is something frequent), the network suffers a major transaction backlog, which leads to an enormous spike in transaction fees that usually surpass the digits per transaction, something that could be affecting the number of users who can afford to mint NFTs.\n\nThis has prompted NFT creators and collectors to seek alternative blockchains with higher throughput, scalability, and lower gas fees. One option that has become a very serious competitor is Solana —a high-performance blockchain that leverages different cryptographic mechanisms to scale its network (we’ll discuss this later.)\n\nWhile paying elevated gas fees can be a crippling experience sometimes, the upside is there’s more money flowing in Ethereum, so the flipping ceiling is way higher. Data from CryptoSlam shows that Ethereum has had a whopping selling volume of over $1.8 billion in the last 30 days, compared to $120 million from Solana-based marketplaces.\n\nAccording to current data from CryptoSlam, the most popular NFT collections in the market exist on the Ethereum blockchain. These include CryptoPunks, the Bored Ape Yacht Club (BAYC), the Mutant Ape Yacht Club (MAYC), and so forth.\n\nAdditional data shows that the average NFT sale price in Ethereum (as of Q4 2021) was around $3,000 compared to Solana’s $1,000.\n\nSolana: Throughput, Low Fees, Growing Ecosystem\n\nSolana takes the lead in terms of technology, functionality, and versatility.\n\nSolana is a high-performance blockchain that uses a consensus mechanism called Proof-of-History, which leverages a set of protocols to execute transactions with high throughput— more than 60,000 transactions per second (TPS).\n\nIn Solana, transaction costs are usually less than a dollar. Many NFT projects and collectors are migrating to Solana to benefit from its scalability and low transaction fees. They have more freedom to build their projects without suffering from technical limitations, which is why Solana is turning into a hub for general NFTs.\n\nMinting NFTs with a Solana-based marketplace like Solsea is remarkably cheap, fast, and easy to profit from once it hits the secondary market. Usually, Solana mints are quickly snapped up, and royalties in Solana-based markets are also frequently higher compared to Ethereum-based ones.\n\nWhile Solana’s ecosystem isn’t nearly as big as Ethereum’s, it doesn’t mean it isn’t growing. In fact, Solana’s user base has been growing at a much faster pace since the beginning of 2022, and even analysts from investment bank JP Morgan have claimed that it could overtake Ethereum in the long run.\n\nAccording to data from CryptoSlam, the NFT market in Solana gained significant momentum throughout the third quarter of 2022. By the end of January, the ecosystem’s sales volume crossed the $1 billion mark.\n\nOne of the most popular collections on the Solana blockchain is the Degenerate Ape Academy, a collection of 10,000 unique NFT Apes.\n\nWhile they may look similar to the Bored Apes from Ethereum, they have their own set of unique traits.\n\nThey can be pretty expensive, too—the highest sale price for a Degen Ape was $1.1 million in September 2021. However, in mid-December, an NFT from the Solana Monkey Business collection was sold for over 13,000 SOL, or about $2 million.\n\nGrowing ecosystems frequently offer early adopters a great opportunity to establish themselves at the top of the list by the time they reach a larger audience. However, one of their problems is that the risk is usually higher. Since the beginning of 2022, the Solana network has suffered several downtimes, forcing users to liquidate their positions as they were unable to top up their collateral during the outages.\n\nAnother concern that developers have addressed lately is the rise of rug pulls in Solana. This is usually the problem with emerging technologies, as scammers will try to spot and take advantage of any weak points they can find. However, rug pulls and scams can happen on both sides of the story, so it’s not only about security issues but rather making sure you do good research before investing in an NFT or any DeFi projects.\n\nRugpulls are the most common type of scam in the DeFi ecosystem. If you want to learn how to spot them, check our latest guide on the matter.\n\nClosing Thoughts\n\nEach blockchain has its own pros and cons, so it really comes down to what you want to do with each one. If you’re looking for a high-throughput blockchain with scalability and low gas fees, then Solana might be more suitable for you.\n\nSolana\n\nPros:\n\nHigher throughput and scalability.\n\nGrowing ecosystem.\n\nLow gas fees and environmentally friendly.\n\nMinting NFTs is cheap and relatively straightforward.\n\nCons:\n\nLess secure network.\n\nLower exposure with a smaller market.\n\nDowntimes are more frequent.\n\nNow, if you want exposure to a bigger market and benefit from the security aspects, then you might be better off with Ethereum.\n\nEthereum\n\nPros:\n\nAccess to a larger market.\n\nHigh network security.\n\nNFTs are sold for a much higher price on average.\n\nCons:\n\nNetwork congestion can cause transaction delays.\n\nLower throughput and scalability.\n\nTransaction fees can become unpayable for a good percentage of users who want to mint NFTs."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxQQkVPU3F1dzNaZ2NkYnMxUU14azhZcE1wRFh2RjJDOVJrNldZWnVFTnFGLUExSDFXTkh6eTBrNkZ3MWFZNFNUeUU1NUsxNFNydEFKOWlUdnRGMXhIV0ZHMmgyQ2p2NzRiWnhVTHhCWU54Z1NJZTNlQnpaQUxOSDh0YUZkaU5Zc1lNUVZISC12S0hqWkZ4bTNRSEl0bVRmY0hLYndaRFgzSzZQa0lpVGNsT1ZvTUg1bEctMlpDbUpub3dVRE9WRGh1NnU2eGRYSzV1X3R0UFhn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jul 2024 07:00:00 GMT",
        "title": "Ethereum co-founder Vitalik Buterin warns against voting on crypto policy, as a16z founders endorse Trump - Fortune",
        "content": "One of crypto’s most influential voices has warned the industry to refrain from voting for political candidates based solely on their digital asset policies. In a blog published Wednesday, Ethereum’s co-founder Vitalik Buterin argues that electing candidates simply for being crypto “friendly” could hurt the industry more in the long-run. Considering whether candidates are ideologically at-odds with what crypto stands for, is more important than if they endorse the right to trade coins in the here and now, he argues.\n\n“If you care about freedom, you might want the government to respect your freedom to have the kind of family you want. If you care about building more efficient and equitable economies, you might want to look at the implications of that in housing,” he continues. Buterin added that losing site of these bigger questions could lead crypto voters to lose sight of the ideals that “originally created crypto in the first place.”\n\nIn his view, crypto payments are just one iteration of the decentralization movement’s larger ideological goal of freedom, and a party’s commitment to protecting this goal is what should be on the ballot. “Decentralized networks are good at protecting freedom, and money is an important sphere where such networks can be applied – but it’s one important sphere among several,” he writes.\n\nAgainst choosing your political allegiances based on who is \"pro-crypto\"https://t.co/rEbRjZYtFB — vitalik.eth (@VitalikButerin) July 17, 2024\n\nTrump, who has committed to be the “crypto president,” will speak at Bitcoin 2024 next week, an annual conference that also serves as a tribal gathering for fans of the original cryptocurrency. Details of what he will discuss have not been disclosed. David Bailey, CEO, BTC Inc., the organizer of the Bitcoin Conference, told Fortune in a statement that Trump will “share his vision for the future of the American Bitcoin industry and its impact on the U.S. economy.”\n\nIn his blog post, Buterin also listed examples of technologies that should also be protected in the name of freedom, beyond just crypto and blockchains. This includes encrypted messaging, privacy from centralized AI companies, and prediction markets and Community Notes that he argues help people form “high-quality opinions about important topics in an adversarial environment.”\n\nButerin’s appeal to higher ideals, however, was quickly met with suggestions he was ignoring political reality.\n\n“Much of this seems too clever by half. Good crypto policy requires electing pro-crypto candidates, period. Political reality beats idealism every time,” responded prominent crypto layer Jake Chervinsky on X. Another user added, “The underlying goal has to be mass adoption, which requires good policy. The tech is inherently democratic.”\n\n‘Sorry mum’\n\nButerin’s blog comes just one day after Ben Horowitz and Marc Andreessen, co-founders of tech venture capital firm a16z, announced their endorsement of Donald Trump on a podcast. “For little tech, we think Donald Trump is actually the right choice. Sorry mum, I know you’re going to be mad at me for this, but we had to do it,” Horowitz said. On that same podcast, Andreessen expressed his fears over how the Democrats might regulate Silicon Valley: “My big concern is what we saw in crypto was the foreshadowing of what’s gonna happen in AI.”\n\nThe a16z founders aren’t the first prominent members of the industry to make their support for Trump public.\n\n“I am going to vote for the person who’s going to do the best job for our economy…I am a voter when it comes to economics, and on that basis, Trump.” ARK Invest CEO Cathie Wood said during an interview with YouTuber Kevin Paffrath last month.\n\nIn addition, this week it was reported that Tesla CEO and meme coin enthusiast Elon Musk is donating $45 million per month to a new pro-Trump super political action committee, called America PAC. Further donors to the lobbying group include the Winklevoss twins, who founded crypto exchange Gemini, and former U.S. Ambassador to Canada, Kelly Craft, who has lobbied on behalf of the Bitcoin mining industry.\n\nProminent crypto figures turning to Trump is also indicative of a wider shift. A June survey by Paradigm found that 13% of Republican swing voters are now more convinced to vote for him in light of his recent crypto conversion. Moreover, just over one third of Republicans view crypto positively, the survey found."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxQdlpFVnN0UzVNVkgwVjYxeTZ5R05aSEVaeFJFVTJDLVJ5c250RG43ZFB6djN2REFuVzBFc0FVVnlTT1ZJRHBmLTlRQ3diLTFlQUFMZEFQa2VnREtQcFFPeHdONzVleHlqS0NUOVRnRlVuQ1lzT0pKQ0VwaEswLTB5Rl9vR0tYejFzV0tRYmp3dWpEb1E4LUpMRVo5Q3Jac0pxMjdvb05Fb2dsQdIBrwFBVV95cUxOdEJORG1DNEw3NmVOa3BULUlCbk5hanAweUg3TF9yenpzX3RQbS1NcnVidlRUMDRVLWFwT2pJN1A2UXdFNUdzQkl3czBDUnRSOF9fMC1uc2RMVFUxZ3A5NUZDNG5vdlZxczZ5Tkw2cnE4Mzk4RFBwRzNUaUNnUkVSMHdObjB5NzBFYkVua2RUTWk4TWZrREJ0MEJ4c1I4R3dTTTUyX3VzdldQZ1hwdGZr?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jul 2024 07:00:00 GMT",
        "title": "‘Ancient’ Ethereum (ETH)-Based Altcoin Jumps Over 50% on New Coinbase Listing - The Daily Hodl",
        "content": "A gaming altcoin built on Ethereum (ETH) is seeing 50% gains after being suddenly listed on top US crypto exchange platform Coinbase.\n\nIn a new post on the social media platform X, Coinbase says it is now listing ETH layer-2 gaming blockchain Ancient8 (A8) with an experiment label, meaning the asset could have low trading volume and high volatility.\n\n“Ancient8 is now live on coinbase.com and in the Coinbase iOS & Android apps with the experimental label. Coinbase customers can log in to buy, sell, convert, send, receive or store these assets.”\n\nAccording to A8’s official website, the protocol uses Ethereum scaling solution Optimism (OP)’s blockchain to significantly boost performance and lower fees when developing games.\n\n“As the pioneer gaming ecosystem on the Optimism Superchain, Ancient8 leverages OP Stack Layer2 tech to offer blockchain games the best of Ethereum with no code changes needed, at a significantly lower cost.”\n\nAncient8, which first launched its testnet in 2023, currently features five games: Onchain Clash, Omnizone, MasterDuel, Wee Pepe, and DeWorld. The project says it sees a future where gaming, interoperability, and decentralization seamlessly intertwine.\n\n“Looking ahead, Ancient8 aims to strengthen network decentralization and build a robust gaming community. With that goal in mind, we envision a continuously evolving Web3 gaming forefront, where decentralized technology and community collaboration coexist in harmony.”\n\nThe news sent A8 soaring from a 24-hour-low of $0.172 to a 24-hour-high of $0.261, a 51% leap. The token has since corrected, trading for $0.194 at time of writing.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Yurchanka Siarhei"
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxPM25TX1Uwd1dzOWJBWFQweldXNnZKSnhzd09IeFBEMk90cUw1RTl2dHlzbmVDcWE1ekQ5bVlYRlZNbnp6SGhtUDBuYnBVN010QUdSTDZmQTc0T1IzalNIRVEwczBVcGpDWU1lakVqQmZFcWZfWlI4QTB3M3I3ejljcEpPdk5obllzQ0pMUDU1eWNOU25tRVFVb3hIdzE4Qi1STFBJTmVpYkN2aWvSAbABQVVfeXFMUHV5SWhQbU93N1U1ZFZVUXY2NE1vWTFGUHlmbm9fLWR2a0cxOTJ6TWQ5MlhmMFVrVGtsS0RnNXJQaHhPaE51UUk0QmZ2WFBaM2FkS1hZTUwxbmkzVVpSSm5jc0JiWU01dnFPX2VjY0N0ZVRfV1ZCSnBjUDFvM1NoQV9SMkhEOUY2NktSNnBfb0pIbWlOaWx6dVBCdU9OMnVHZGhZTm9ERkJoZG9BeUFVYVM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis: Is $3.7K Realistic for ETH or is a Correction to $3K Coming? - CryptoPotato",
        "content": "Following a revival in buying interest and demand, Ethereum’s price has surged, reclaiming the 100 and 200-day moving averages.\n\nThis price action suggests a shift towards a potential rally, with buyers targeting a new yearly high in the mid-term.\n\nTechnical Analysis\n\nBy Shayan\n\nThe Daily Chart\n\nA detailed analysis of Ethereum’s daily chart reveals that after a notable increase in buying pressure near the substantial $3K support region, the cryptocurrency initiated a bullish spike, surpassing the 100-day ($3340) and 200-day ($3152) moving averages.\n\nAdditionally, ETH has reclaimed the significant resistance region of $3.5K, a crucial barrier for buyers in recent months. This price action indicates a strong buyer presence in the market, aiming for a new yearly high.\n\nHowever, Ethereum has formed a sideways wedge pattern over the recent months. It is expected to continue its upswing after a short-term period of market consolidation, aiming to breach the wedge’s upper boundary at $3.7K. Successfully surpassing this level could lead to a new yearly high above $4K.\n\nThe 4-Hour Chart\n\nOn the 4-hour chart, an increase in bullish momentum led to an impulsive surge, breaking the multi-month descending trendline.\n\nThis impulsive move also saw the price reclaim the significant $3.3K resistance region, previously filled with supply. This development reflects strong buyer interest in the market, aiming for higher levels in the long run.\n\nHowever, Ethereum reached its prior major swing high in the 4-hour timeframe, resulting in sideways consolidation.\n\nThis swing serves as a robust resistance level, and breaking above it could pave the way for another impulsive surge toward the key $3.7K resistance zone. The ongoing consolidation phase is a positive sign for the market, confirming the recent breakout above the trendline and completing a pullback to it. If the price surpasses its prior central pivot of $3524, the continuation of the bullish movement will become imminent.\n\nSentiment Analysis\n\nBy Shayan\n\nWhile Ethereum’s price has experienced a bullish reversal, a closer examination is essential to determine if the bullish trend will persist. The chart highlights the Taker Buy/Sell Ratio, a crucial metric for evaluating futures market sentiment. Values above 1 indicate aggressive buying by bulls, while values below 1 suggest bearish selling pressure.\n\nAs depicted in the chart, the Taker Buy/Sell Ratio surged above 1, simultaneously with the bullish revival in Ethereum’s price. This surge indicates strong buying interest in the perpetual market, suggesting a notable bullish sentiment. If this upward trend in the Taker Buy/Sell Ratio continues, it confirms a potential mid-term bullish trend in the market, with the price likely rallying toward higher values."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxQTGlmaWxXVnFHRFpzelpFc0Q5RlhPWEdOdFpjSkt2Y0ZmS1hZcVhwX3dZSUVyTjVEQ1hfLTZ3TUR1S0JncFNkdTVJN09LcWxna21FYWRWc2RGdWdpWjZFY3NtTEk4RVpOaWJobzhLZ1FFSEU2UjF3Q21RNC1Eblc4eGoyRFo2ZGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jul 2024 07:00:00 GMT",
        "title": "Five Spot Ethereum ETFs To Launch on July 23, CBOE Says - Watcher Guru",
        "content": "Five Spot Ethereum ETFs, including Fidelity and VanEck, are set to launch on July 23rd, according to the CBOE exchange. Cboe posted new issue notifications Friday afternoon, which are procedural for ETF launches, revealing the Ethereum ETF launch date.\n\nJUST IN: Five Spot Ethereum ETFs to launch on July 23, Cboe confirms.\n\n\n\n• VanEck\n\n• Invesco\n\n• Fidelity\n\n• 21Shares\n\n• Franklin Templeton — Watcher.Guru (@WatcherGuru) July 19, 2024\n\nCboe will house most of the first trading of Ether ETFs. The exchange has revealed that trading will commence next week. These include the Fidelity Ethereum Fund, the Franklin Ethereum ETF, the Invesco Galaxy Ethereum ETF, the VanEck Ethereum ETF, and the 21Shares Core Ethereum ETF. “We are pleased to announce that 1 Exchange Traded Product (‘ETP’) will be listed on Cboe and will begin trading as a new issue on July 23, 2024,” the exchange said.\n\nAlso Read: Ethereum: Will ETH ETF Have a Bigger Impact Than Bitcoin Did?\n\nHow Are Firms Pricing Their Ethereum ETFs?\n\nSource: Unsplash\n\nEther ETF applicants first received 19b-4 form approvals back in May. However, there has been a delay in wrapping up final loose ends. In addition, firms disclosed fee amounts in amended registration statements on Wednesday:\n\nFidelity set its fee at 0.25% and said it would waive it through the end of 2024.\n\nFranklin Templeton said it will waive its fee until Jan. 31, 2025, on the first $10 billion of the fund’s assets.\n\nVanEck said it will waive its fee for a year after the fund is listed for the first $1.5 billion.\n\n21Shares set a 0.21% fee, which will be waived for six months starting when the shares are listed or during the first $500 million, whichever comes first.\n\nAlso Read: Pepe Coin’s 390% Boom: Next Big Crypto?\n\nFurthermore, an interesting note is the timing of the approval. The SEC is greenlighting the launch date of the Ethereum ETF during the biggest Bitcoin conference of the year. That week will be a memorable one for all of crypto, as BTC and ETH represent the only two cryptocurrencies with an ETF in the US.\n\nNow, all eyes are on what token could be next. There has been a lot of anticipation surrounding a possible Solana ETF soon. Crypto ETFs have entered the spotlight. As a result, the opening week performance of Ether ETFs may dictate how easily the next ETF is approved in the future."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMi0wFBVV95cUxOTGtxY3E5RGVJZkE3ZFFvcVJ4bnVCeVJmdzcwU3FRYlZpTnVzRDZ5enJkNXZvZUlCOWZiMThOcU8tcjZhTDdEWGFvZHRnbTJSb1JkUEQwVUpaSkZXMlpfeE0xVnlweE5rVWNiVDFrLXJQLThxRzhmN1pZWlBjc01TMHU5WVI5QmE3d0pTdnZuVzFBUWRMZ0FrX2drX2hiMlQyU3dWV3lBeFZYWGpUNjYwajNWaUtoZmd4ZmY2amtaWUgxRnY5eW1BZS0tVHdwVWVTREI00gHYAUFVX3lxTE9rdVZpbVBrRmxhcWZZR0VVUzk5WUwwdVNuYlJ4NjItRzV4MW1HVExVQ0RTbzdLQ3hlOWN6bko4MlkyMG9qdVRwQjVhQzhtd083MXcxSDNkRWFEU1ZtY1NJR3lGWmRYcTMzSUk3YzlHV2ZZSTg4ODZiZkgwWUE0ZUwwQkNwSUgzX1JwMXZGXy0zQUR1V3JMZzNKZXR6OVEyTDNieWJ0RmZhcHNnLUVyVWtPR21NM0hEWERKQVlDeERwLUVvMWppUjdjT1hkMlBvbTNMbXJzbGxraQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jul 2024 07:00:00 GMT",
        "title": "Crypto Exchange WazirX Hacked, Loses Over $230,000,000 in Ethereum, Shiba Inu and Other Assets: On-Chain Data - The Daily Hodl",
        "content": "Hackers have breached and siphoned large amounts of assets from the India-based crypto exchange WazirX.\n\nAccording to blockchain tracking firm Lookonchain, an analysis of on-chain data shows that the exchange lost more than $230 million worth of crypto in the incident.\n\nThe stolen funds include $52.5 million worth of Ethereum (ETH), $102 million worth of Shiba Inu (SHIB), $11.24 million worth of Polygon (MATIC), $7.6 million worth of Pepe (PEPE), $3.5 million worth of Gala (GALA) and $5.79 million in Tether (USDT).\n\nLookonchain says that the hacker is dumping funds and has so far sold all of the stolen PEPE and SHIB tokens.\n\n“Currently, wallet “0x04b2” is dumping these assets, and has dumped 640.27B PEPE ($7.6 million).\n\nWazirX Exploiter has sold all 5.43T SHIB for 26,535 ETH ($92 million)!”\n\nWazirX confirms that its platform was compromised and is investigating the incident.\n\n“A cyber attack occurred in one of our multisig wallets involving a loss of funds exceeding $230 million. This wallet was operated utilizing the services of Liminal’s digital asset custody and wallet infrastructure from February 2023.”\n\nThe exchange says it is also temporarily suspending withdrawals to protect user funds.\n\n“This is a force majeure event beyond our control, but we are leaving no stone unturned to locate and recover the funds. We have already blocked a few deposits and reached out to concerned wallets for recovery. We are in touch with the best resources to help us in this endeavor.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxNb2RDRk1YS1I5RjZUNTNZY18tbi14dzJsTXJ1UnVWMHoxakt2dDRzZWZSMXJhOWZDclRUcWZWRUNWQUsxRDZzNmg5MGtYeWh4UTRZOVhfTF9qRGRxMHkteHJCMWlWdTFuejItRTdMNDl4SjZKT1VldndLbFZMWWpqZFJQaXBQb0pjQldRZnFB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jul 2024 07:00:00 GMT",
        "title": "Ethereum: Will ETH ETF Have a Bigger Impact Than Bitcoin Did? - Watcher Guru",
        "content": "With the Ethereum ETF set to debut next week, the market is waiting to see how its impact compares to that of Bitcoin. Indeed, BTC became the first crypto to get spot ETF approval in the United States, breaking the US Securities and Exchange Commission’s (SEC) rejection streak in January.\n\nThere is no denying the impact that Bitcoin had on the market after its debut. Just three months after launch, the leading crypto surged to a $73,000 price, setting a new all-time high mark. Yet, one expert predicts that the upcoming crypto ETF could actually be more impressive.\n\nSource: Watcher.Guru\n\nAlso Read: Ethereum ETFs Expected to Officially Launch July 23\n\nEthereum ETF to Have a Bigger Impact Than BTC?\n\nEarlier this month, Kraken’s head of strategy, Thomas Perfumo, told Bloomberg that Ethereum’s ETF was a “rising tide lifts all boats,” situation. He reinforces the importance of the arrival, and what it means for crypto. Now many have wondered if the Ethereum ETF could actually have a bigger impact than its Bitcoin counterpart.\n\nOne such person who believes in its potential is Bitwise chief investment officer Matt Hougan. In a recent report, the executive highlighted what the crypto market could expect from the product. Moreover, he discussed how it could be the biggest crypto-based ETF yet.\n\n“The first few weeks could be choppy, as money may flow out of $11 billion Grayscale Ethereum Trust (ETHE) after it converts to an ETP,” Hougan said. “By year-end, I’m confident the new highs will be in,” he added.\n\nAlso Read: Bitwise Says SEC is Open to Solana ETF After Ethereum Launch\n\nAfter discussing the impact that Bitcoin had on the market, Hougan asked if ETh could “see the same sort of impact,” when it arrives. He answered, saying he thinks, “It might be bigger.”\n\n“I think the new Ethereum ETPs will attract billions. And I think the money flowing into these new ETPs will have a bigger impact than it did with Bitcoin,” he stated. Hougan notes that lower short-term inflation rates and ETH staking play a role. It will be interesting to observe, as crypto could be heading toward a monumental bull rally."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxPdWdsbVk1MGRuY0RSdXhhWmpOWmxFMEFnRDlXeVJSZkNXWlJkckUtT2NWUDd2TlJUTGlzLXItbGI4ekUwZXVzRC1Ja2tHZnBNUlNuZ2xScFBTM0UtUjBNV25WQkN2QUhsa2V4Y2YwcWtXb1ZNcnhYWHJtM2JjZnAzWGUxS2ZfeDBid2tYbTM1U0NFU3pLcXRoc1lNcWZ6clVTVHhDcU02ajFBZDDSAbABQVVfeXFMTWpXR0RRVXN3aEVzU3A2emVKZ0FEb0g5RVRFcEs4aF9sY0tidzZCUTFHNXVKcTVobVAwazl6aTVSc255eWx2VlZXOXZuVnVoWGNxaEg5WWFORGN5YmxlT1JZdVZXTmN0REp2NjY2UUtqeDBrMVV3LXlGNHZ0U0RQYXpER3YtczlJVTB0VUd1ZnNraWFqbEFuVUhJc2E2cnpuVW9aQ01WNDdHS2pwbDRVWWs?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jul 2024 07:00:00 GMT",
        "title": "XRP Loses 7%, Here's How Ethereum (ETH) Going to Move Now, Toncoin (TON) Loses Crucial Support at $7 - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nXRP is in the process of correction as its price printed a 7% drop in the last 24 hours, potentially pushing the market to its first major correction. However, it could be temporary, and things could turn bullish again in a few days.\n\nThe 50-day moving average is the first major support level for XRP. If XRP remains above this barrier, it may level off and even rise once more. As a psychological barrier for traders, this level has historically served as a foundation for price rebounds. The support level at $0.50 is followed by the 100-day moving average. In the past, during downtrends, it has provided solid support. If XRP drops below $0.55, this level may act as a safety net to stop further losses.\n\nTraders frequently scan these levels for opportunities to buy, which could aid in a price reversal. Recovering from a drop below the 200 EMA level may indicate a longer-term bearish trend for XRP. Sustaining this level is critical to XRP's bullish outlook, as it is regarded as a long-term trend indicator.\n\nEthereum can't break it\n\nEthereum could not break the 50 EMA resistance level and is currently sliding below the moving average. Unfortunately, the lack of a breakthrough will lead us to a drop below $3,300. There are a few levels for traders to watch.\n\nAdvertisement\n\nEthereum encountered significant resistance during its most recent attempt to breach the 50 EMA, suggesting that bearish momentum may be developing. A critical technical indicator, the 50 EMA frequently acts as a level of support or resistance. The failure of an asset to cross this threshold may signal waning bullish sentiment and potential losses.\n\nThe 50 EMA has consistently demonstrated its ability to predict market trends. Ethereum frequently retraces its losses when it is unable to rise above this level. This pattern implies that there may be more selling pressure on the market in the near term.\n\nIt is critical to avoid a drop below the $3,000 barrier. Ethereum may experience panic selling if it drops below that barrier, which would accelerate the decline. It has historically served as both support and resistance.\n\nThe amount of $3,200 represents yet another crucial support level. This threshold has previously been tested several times and has frequently served as a buffer against additional declines. Ethereum must stay at this level in order to stabilize and prevent a more severe correction. The 200 EMA acts as a longer-term support at around $3,200. That is why long-term investors need to keep an eye on this level, as a decline below it might signal a longer bearish phase.\n\nToncoin does not attract bulls\n\nToncoin's success was enormous during the market downturn, but as soon as the majority of digital assets retraced, TON quickly lost most of its momentum and even dropped below the crucial 50 EMA support.\n\nCertain investors have perceived Toncoin as a possible hedge against the larger cryptocurrency market, notwithstanding its recent performance. Due in large part to its integration with the Telegram ecosystem, this thesis's strength lies in its foundation.\n\nOne of the main benefits of Toncoin is its integration with Telegram. Telegram offers TON an audience that is already there and the chance to be widely adopted thanks to its enormous user base. TON may be more resilient than other cryptocurrencies due to this fundamental strength, particularly in times of market turbulence.\n\nIn times of market turbulence, investors frequently seek investments that offer some degree of stability. Its ability to function as a more stable investment was demonstrated by Toncoin's performance during the market slump.\n\nTON is not totally immune to larger market movements, though, as seen by the most recent decline below the 50 EMA support level. The support of a significant platform such as Telegram, and Toncoin's strong technological base, contribute to its increasing popularity.\n\nInvestors seeking long-term stability over short-term gains may be drawn to this strength. The theory is that despite difficulties facing the market as a whole, Toncoin's strong fundamentals will enable it to weather storms better than its competitors."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxQcHZ0SHc3X1djUjE0U1pUbTJLS3BROWdDRktkNWc2WkMzUWJpV0FCZEdzWXZIbmdwSnBFeFJOYVduMjlTdXhNajlQaHFBdlBBaE5CcVF6TXZYSzZTZ1F3YXk5MmZZQ29UanNiSm93WEhCSTNMUnE3RWl3blJMd1Vkc1Y2Q2hJay0wWHFTN1Uya2RtQ1oyNUZQS3o1bjIyR03SAaQBQVVfeXFMTnEzQVE1ZXJsZFJ1X0NIYVNvTVk0ZF9GRjlESUFHdDZWbVhEVVdVNkdNSFZMWXRNZ082ZzVsMWFUcnlPQ2J4d1hObGJKdV9rMzhPLTR5dW92LVU1X1I0ZGJJSWdvdl9RS2ctY1dLb1U1R0p4SllEODZldXgzQkN6OS1RQlFYOW15dFJ6cmVmSmpudGRraDdCSmlwQTlnLTJSUTdWWDk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jul 2024 07:00:00 GMT",
        "title": "Grayscale Ethereum ETF Mini-Trust Announces Full Fee Waiver Up to This Limit - CoinGape",
        "content": "With just four days left into the launch of the spot Ethereum ETF, Grayscale has announced some major changes to its fee structure thereby making its ETH mini-trust the cheapest among its competitors.\n\nGrayscale Ethereum ETF Fee Waiver\n\nEarlier this week, Grayscale announced the Ethereum ETF fee structure at a staggering 2.5% making it 10x more costly than all of its competitors in the market. This move put Grayscale in a bad light with analysts stating that the asset manager hasn’t learnt enough lessons despite outflows from its spot Bitcoin ETFs in the past six months.\n\nadvertisement\n\nAs part of this course correction, Grayscale cut short the fees of its Ethereum mini-trust to just 15 basis points. Furthermore, the asset manager has announced a complete fee waiver for up to $2 billion in inflows or six months whichever is early.\n\nLowered to 15 bps, with full waiver for first $2 bn. This is what I was expecting yesterday. Grayscale wised up. https://t.co/Y0sXyTS0JT pic.twitter.com/nyuuDuTUxq — Scott Johnsson (@SGJohnsson) July 18, 2024\n\nInterestingly, this fee revision makes the Grayscale Ethereum mini-trust the cheapest among all of the ETH ETF issuers currently in the market.\n\nAlso Read: Ethereum ETF Launch Doesn’t Guarantee Solana ETF Approval\n\nNate Geraci Praises Grayscale\n\nETF Store President Nate Geraci has applauded Grayscale for undertaking this strategic shift and competing with other market players. Geraci stated, “Bravo, Grayscale… This is how you go for the jugular.”\n\nGeraci further added that Grayscale has paved the regulatory path for the spot Bitcoin ETF and Ethereum ETFs. Thus, he added that there is no reason not to capitalize on this advantage by taking a leadership position in the spot crypto ETF category.\n\nBravo, Grayscale… This is how you go for the jugular. Grayscale paved regulatory path for spot btc & eth ETFs. Period. No reason not to capitalize on that by taking leadership position in how they approach competition in spot crypto ETF category. Smart move IMO. https://t.co/j9EvuoxdA4 — Nate Geraci (@NateGeraci) July 18, 2024\n\nThe Ethereum price has remained largely stable after rallying all the way up to $3,500 earlier this week. As of press time, ETH is trading around $3,400 as investors cautiously await the ETF launch next week.\n\nAs per data from Deribit, Ethereum options with a notional value of $0.48 billion are set to expire today. The put/call ratio is only 0.36 which suggests that the market is majorly bullish. On the other hand, the max pain point stands at $3,150.\n\nAlso Read: Is Ethereum ETF Launch “Sell The News” Event Like Bitcoin ETF?\n\nBhushan Akolkar Bhushan is a FinTech enthusiast with a keen understanding of financial markets. His interest in economics and finance has led him to focus on emerging Blockchain technology and cryptocurrency markets. He is committed to continuous learning and stays motivated by sharing the knowledge he acquires. In his free time, Bhushan enjoys reading thriller fiction novels and occasionally explores his culinary skills.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxNY3hBQjhLNjZLZjlFVFhxSjFhZHJnYlp5U2paYy1DR2VWcWs1YXllRS1kQk5HcGJXNXFvc185OGxOTlpkZ1Q1TzRsM3dVSGpNYnNsOG5fY0FMQXFDU08zZDQ4WU9XaEw5MjBpNWllYnk3RWt2YzBvZ1pjaDAxMDVmV21sUkxvME3SAYwBQVVfeXFMUGJqZG1HVDU3Ylk4bk5md1ZtT0YwWmJCNzdFTTloMFpPVjhUWXNuUGZjN0pMOXQyNHY3UWhRb3BXUjZxY25iTEFmeVNBVUZPdEhxUkVGc1NnbEhjOHItTERUSUd2T0RoUVlqLU1OWXN0YWZJTEIyeHFzOW45NG9DcTNZOWxIYWR5RmFyMlE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Pectra Devnet nears launch: Will ETH climb higher? - AMBCrypto News",
        "content": "Developers continued to work on Plectra upgrade for the Ethereum network.\n\nChanges in staking rewards were discussed to mitigate centralization and other risks to the network.\n\nApart from the market recovery, the increasing attention around Ethereum [ETH] has helped it soar over the past few days. The upcoming Plectra update could further help Ethereum see green.\n\nDevelopers continue with their work\n\nIn the 137th All Core Developers Consensus (ACDC) call, the primary focus was on the progress of two testnets, Pectra Devnet 1 and PeerDAS Devnet 1.\n\nPectra Devnet 1 is nearing its launch, with both Consensus Layer (CL) and Execution Layer (EL) clients prepared. The Ethereum Foundation DevOps team is rigorously testing various client combinations to ensure compatibility and stability.\n\nPeerDAS Devnet 1 is currently undergoing bug fixes before its planned relaunch. Once these issues are resolved, the devnet is expected to be restarted by the end of the week.\n\nIn addition to testnet updates, the call also covered research on fork choice testing by the TxRX team at Consensys. Their newly developed test generator aims to identify potential bugs and deviations in client software from CL specifications.\n\nThe successful launch of Pectra Devnet 1 is a significant step towards the Pectra upgrade, which is expected to introduce several improvements to the Ethereum network.\n\nThe ongoing development of the fork choice test generator is crucial for enhancing the reliability and security of the Ethereum ecosystem.\n\nNew changes for stakers\n\nAdditionally, Ethereum is also considering adjusting its staking rewards to maintain a lower staking rate, potentially around 25% or 12.5%.\n\nThis change could have a substantial impact on the returns ETH holders receive from staking. The Ethereum Foundation is exploring this option to address several concerns.\n\nA lower staking rate is seen as a way to mitigate the risk of centralization, where a significant portion of ETH becomes concentrated in a few large staking pools.\n\nThis centralization could potentially threaten the network’s security and decentralization.\n\nAdditionally, a lower staking rate might reduce the likelihood of a mass slashing event leading to a chain split, a scenario where ETH holders might pressure the protocol to restore lost funds.\n\nHow is ETH doing?\n\nAt press time, ETH was trading at $3,455.17 and its price had grown by 1.16% in the last 24 hours. Despite the recent surge in price, the network growth for the Ethereum token had declined, suggesting that new addresses were slowly losing interest in the ETH token.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nMoreover, the velocity at which ETH was trading at had also fallen significantly, implying that the frequency at which ETH was trading at had also fallen.\n\nIf these trends continue, ETH’s chances of rallying further would diminish even further."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxNZE1jMTI3b0xmMHUyYllrX280dUpOcjdtMWVzU2hBbXV3c01fdnhNYkw4c09HVXhPb0ZoQnBKa25seG1Pc1oxY1JpNHh5UHV6eWR0QWYyZFZkNGhuNk83Uy1wZTBpTnF0Wnh3OFZ0R2FyeC1Id0pHSVpNVV9JSm9nbGd4UFVaUdIBiwFBVV95cUxQMHlJMHEyRnBGZnVLVGU3NTZqR2FqVDhXZXZlZUFYNlVnRjZhcHlKYVFKQmd3T3ZURE1TVmFOTjlKMXpyenYyVjRrT1I5VkhJclRicGNDaWhLNmxpTTBaaGJFYTE4VVk3YjdHd2tabmZVdmN2UDVkeW82OTFuWnB5bnVoQjBEb2hOLUQw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jul 2024 07:00:00 GMT",
        "title": "$149 Million of Altcoins Sold By WazirX Hacker to Buy 43,799 Ethereum - CoinGape",
        "content": "According to the latest on-chain data, the WazirX hacker has converted all of the stolen altcoins into Ethereum (ETH). Reportedly, the hacker now holds more than $201 million in Ethereum after recent swapping. This development coincides with the anticipated launch of the spot Ethereum ETF in just four days.\n\nWazirX Hacker Swaps Alts for Ethereum\n\nOn-chain data provider Spot on Chain reported that the total Ethereum holdings of the WazirX exploiter have surged to 59,097 ETH, valued at $201 million. This includes:\n\nadvertisement\n\n15,298 ETH ($52 million) stolen directly from the exchange.\n\n43,799 ETH ($149 million) obtained by liquidating various assets, notably 5.43 trillion SHIB ($90.2 million), 20.5 million MATIC ($10.2 million), and 640.27 billion PEPE ($7.48 million).\n\nAs per Spot on Chain, the exploited hasn’t made any further moves with these ETH holdings. Interstingly, the exploiter still holds $12-$15 million worth of other altcoins including CHR, CELR, OOKI, and FRONT.\n\nIt seems that the WazirX hacker is also betting on the upcoming Ethereum price rally as the spot Ether ETFs will go live for trading next week. While the rest of the altcoins saw a major price correction after the exploit, Ethereum has remained stable trading around $3,420.\n\nOn Thursday, Shiba Inu crashed more than 10% amid the massive selling coming from the hacker.\n\nAlso Read: Over 5 Tln SHIB Sacked From Indian Exchange Amid Hack\n\nEthereum Price Action Ahead\n\nEthereum investors remain quite excited before the approval of the spot Ethereum ETF scheduled for next week. Over the last week, the ETH price has already surged by 10% amid the broader market recovery shooting all the way to $3,500. Market analysts are predicting ETH to rally to $4,000 and beyond in the weeks following the ETF launch.\n\nThe technical chart setup for Ethereum also looks bullish at this stage. As per analyst Income Sharks, ETH can see a minor pullback to retest the trendline before resuming a strong uptrend ahead.\n\n$ETH – Looking good. That could have been it for the pullback or we could still go lower and that’d still be bullish. Finally have the double supertrends flipped bullish and OBV is close to giving the official send off signal. pic.twitter.com/Nnekh4TKVP — IncomeSharks (@IncomeSharks) July 18, 2024\n\nAlso Read: Is Ethereum ETF Launch “Sell The News” Event Like Bitcoin ETF?\n\nBhushan Akolkar Bhushan is a FinTech enthusiast with a keen understanding of financial markets. His interest in economics and finance has led him to focus on emerging Blockchain technology and cryptocurrency markets. He is committed to continuous learning and stays motivated by sharing the knowledge he acquires. In his free time, Bhushan enjoys reading thriller fiction novels and occasionally explores his culinary skills.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxOTk9SUE9zejVtMUxMSGFCaFNKWXFQZGN5RWxPZUM2bEhfV0JhZTJoSEVTNXBFaG1RMXJEdl80a0I1VmdobzdqWGNveWFlem4xM1ktZmV5UUdwYkJ2SF9BcW1mQ0Fha3RXQlJQemJaNFBJZjVUU0V1NURmN0NHc2Zsd293Y2dfQ3FSd2hZVGZhanpCMDNwNU9pUzFoUlAtRWxRaUpZOXRQZzJVT0pmYmJhalhDNlTSAboBQVVfeXFMTWU4S2JmZlAwSUZqdkpCNktuSHkwcnJzQTRFXzlpZG01SUl6Z3pLQng2QTlrVE5tdkprUjZRLW9IYVVMMkl1NHBobV9HbGcxS1dwdHlyYXF4ZUFVanZrZGRoVmJndXF1NzhtbkpKclhZQkdHR3c3ZlJuRWJ2bWZhZFpHX2gzV25XSUhRcmQ0c1pCM0gxdVFhbVpFLVhINExpOTM2YlNPTDBwWGt1amFnTkFfZWctUVNKb0RB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Price Forecast: Will WazirX Hacker Sell $202M In ETH Triggering Another Crash? - CoinGape",
        "content": "Ethereum price forecast shows that the asset remained stagnant in the past day. This comes as the WazirX hacker converted his loot into ETH. At 2:53 a.m. UTC, the attacker had accumulated $201.67 million in ETH. If the hacker, who on-chain sleuth ZachXBT suggests may be linked to the Lazarus Group, decides to sell his ETH, what will the market implications be?\n\nEthereum Price Forecast: Can $200M ETH Dump Upstage ETF Launch in 3 Days?\n\nEthereum price forecast remains stable despite the WazirX hacker consolidating the stolen crypto assets into Ethereum, probably because the Ethereum blockchain is the most liquid. ETH/USD price is trending above the 50-day and 200-day simple moving averages (SMA) in the 4-hour timeframe, which confirms that the bullish uptrend is still intact.\n\nadvertisement\n\nETH is also inside a symmetrical triangle, forming a bullish pennant. The price of ETH is expected to trend inside this market structure over the weekend and into next week.\n\nTechnical indicators reveal some weakness from bulls, but the Ethereum price forecast remains optimistic.\n\nThe relative strength index (RSI) hit 60.68 on July 15 before retracing downward. It is currently near the RSI moving average, which may offer support from which to bounce. The current 57.49 RSI reveals ETH’s bullish momentum is decreasing. The Chaikin money flow (CMF) indicator supports the RSI, barely above the zero line, and shows signs of reducing buying pressure.\n\nEthereum price prediction shows the asset may bounce off between $3,400 and $3,500 over the weekend. A break to the upside of the symmetrical triangle may result in an 18% price upswing to $4,100. Conversely, the ETH price may find support at $3,300.\n\nETH ETF vs Sell-Off: Which Will Take the Day?\n\nWazirX hacker’s intentions with the accumulated Ethereum are unknown for now. However, the market anticipates that the attacker may dump the loot at any moment. The news of the hack comes days before the launch of the Ethereum ETF on July 23.\n\nMeanwhile, ETF issuers filed their S-1 final drafts on Wednesday, with Grayscale charging the highest fees. However, on Friday, the ETF issuer dropped its starting fee to 0.15% and will now be the cheapest, surpassing Franklin Templeton at 0.19%.\n\nBottom Line\n\nThe crypto market is on edge as the WazirX hacker’s potential sell-off of $202 million in Ethereum looms. This significant amount of ETH hitting the market could trigger a gloomy Ethereum price forecast, potentially leading to a broader market crash and upstaging the anticipated Ethereum ETF launch.\n\nFrequently Asked Questions (FAQs) 1. How much was stolen in the recent WazirX hack? The recent hack of the WazirX cryptocurrency exchange resulted in a loss of approximately $235 million. This includes significant amounts of various cryptocurrencies, such as $96.7 million in Shiba Inu (SHIB) and $52 million in Ether (ETH). 2. How will the Grayscale Ethereum Trust fee waiver affect ETH ETFs? Grayscale has announced a full fee waiver for their Ethereum Mini Trust for up to $2 billion in inflows or for the first six months, whichever comes first. This reduction makes the Ethereum Mini Trust significantly more competitive in the market, aligning it with other low-fee or zero-fee promotional offers from competing Ethereum ETFs. 3. Will Ethereum price soar past $5,000? There is still high likelyhood that Ethereum price will soar above $5,000 in the coming days especially after the launch of spot ETH ETFs.\n\nRelated Articles\n\nEvans Karanja Evans Karanja is a crypto analyst and journalist with a deep focus on blockchain technology, cryptocurrency, and the video gaming industry. His extensive experience includes collaborating with various startups to deliver insightful and high-quality analyses that resonate with their target audiences. As an avid crypto trader and investor, Evans is passionate about the transformative potential of blockchain across diverse sectors. Outside of his professional pursuits, he enjoys playing video games and exploring scenic waterfalls.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxNM1FXaHhQMXMyZVVrbngyMllGaUYxRllJdU1wc2xKN002cUkzYmVFNzZva0dtLWZIeDZKWTFVeHhMamhFazQyX2JRUGRjOEgwOG8zR0pXZ2VqMURLUVBmTkVrTWN0REE3Nk95VWNtVUh3ZmM1NWdldW16U3AxR3l2UDhhX0PSAYoBQVVfeXFMTzNpYmRrdzZyQVJNWTlZTXNiY2tHZTY5QVZjc1lzRnl1TDlYRUFSbHRLMHY4ZUZwSjZRRXZ1RG1WNWFJT1BpYTEwYV9BdmVjektzYUl6eUZzeVMyUmlNdDVPU3c1REJaWWxpa0ZmeWhMVXgxR242ajNzWFNncE0xaElFZHowQWdPbVJB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jul 2024 07:00:00 GMT",
        "title": "Solana gains spotlight as Ethereum ETF countdown begins - AMBCrypto News",
        "content": "Ethereum ETF set to launch on 23rd July, paving way for Solana.\n\nVanEck’s filing signals growing institutional interest.\n\nThe crypto world is on edge as Ethereum ETF launch approaches. The Ethereum [ETH] launch is set for 23rd July, according to a renowned crypto analyst. This milestone comes after Bitcoin’s ETF success.\n\nAmidst these developments, VanEck’s recent filing for a Solana ETF has intensified market anticipation.\n\nSolana in the Spotlight\n\nAs Ethereum takes center stage, Solana [SOL] emerges as the next potential ETF candidate. Known for its speed and low costs, Solana could be the third major crypto to secure an ETF.\n\nThis prospect has already boosted Solana’s market position and investor interest.\n\nEric Balchunas, a senior ETF analyst for Bloomberg, recently replied to an ETF approval week tweet and added more fuel to the Ethereum ETF launch speculations. In the tweet, he stated that the the launch could be on 23rd July.\n\nSocial buzz and whale activity\n\nAMBCrypto’s analysis of Solana’s social volume data shows recent stability with a slight downward trend.\n\nHowever, whale holdings have increased since January. The total supply held by whales stood at 42% of the total supply at press time.\n\nThis indicated strong institutional interest despite waning social volume trends, which may result from Ethereum stealing public attention.\n\nSolana correlation insights\n\nAMBCrypto’s analysis of the Hyblock buy volume in the last two years indicated that the correlation between Ethereum and Solana stood at 0.44. This suggests a moderately positive relationship between the two giants.\n\nThe connection could benefit SOL as Ethereum’s ETF launch approaches, potentially driving increased interest in both assets.\n\nIs your portfolio green? Check out the SOL Profit Calculator\n\nAt press time, Solana was trading around $160.79, forming a bullish pennant pattern. The recent breakout above key resistance signals potential for further gains.\n\nIf it breaks through the bullish pennant resistance, the rally will continue. Both the RSI and MACD indicators support an optimistic bullish outlook."
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxOVnh2WkpON0h3NWg4NHVmLVJOQlNtUkU2U0hNUDZvUUluQTY4OUtQS19hajQ3NEgyMW9Eb1NPZ01POXE1QXNaMkVpS0Rhc1BMdWxNeXhBNkpab00yN1lpSzBpSUw2X3VXMXh0SlFRb0F4di0wUGdwcUp6TWN4cEw4VEw2cjNTVFJ4eVE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETF potential launch on 23 July sparks excitement - City A.M.",
        "content": "Ethereum ETF potential launch on 23 July sparks excitement\n\nThe Securities and Exchange Commission (SEC) has set a timeline for the launch of Ethereum ETFs.\n\nEach day, Coinrule will run through the state of the digital assets market for Blockbeat, your home for news, analysis, opinion and commentary on blockchain and digital assets.\n\nThe Securities and Exchange Commission (SEC) has set a timeline for the launch of Ethereum (ETH) ETFs. The major date to note is 23rd July, when these ETFs are expected to start trading in the US. This announcement marks a significant development for both the cryptocurrency space and the broader financial markets. By establishing a concrete timeline, the SEC is finally opening the doors for a new wave of institutional and retail investments in Ethereum. This move follows the successful launch of Bitcoin ETFs earlier this year, which saw substantial inflows and market interest.\n\nThe latest update from the SEC indicates that fund issuers have been asked to submit their final S-1 forms by Wednesday, including all necessary fee details. This step is crucial as it ensures that all required information is available for public scrutiny. By Monday, July 22nd, issuers must request the “effectiveness” of their registration forms, which essentially activates the ETFs. If the SEC does not intervene with any unexpected issues, trading will commence on July 23rd. This structured process reflects the meticulous regulatory process involved in launching an ETF.\n\nAs we await the final S-1 filings, fees remain a hot topic. The cost of investing in these ETFs can significantly impact their attractiveness to investors. The race is heating up with asset managers like BlackRock, Fidelity, 21Shares, Grayscale, Bitwise, and Invesco Galaxy all submitting their final S-1 filings. The filings revealed management fees, with Grayscale setting a high fee of 2.5% for its main product but 0.25% for its Mini Ethereum Trust. BlackRock and Fidelity will charge 0.25%, while 21Shares set a fee of 0.21%. Bitwise, VanEck, and Invesco Galaxy are at 0.2%, and Franklin Templeton at 0.19%. ProShares has yet to disclose its fee at the time of writing.\n\nMarket sentiment remains cautiously optimistic. The approval of Bitcoin ETFs earlier this year brought in $16 billion in net inflows and boosted Bitcoin’s price. However, experts and investors have tempered their expectations for the Ethereum ETFs due to potential volatility and current market conditions. Still, many see significant potential for inflows and price appreciation over time. They view this as a pivotal moment for the broader crypto market.\n\nExcitement builds as the final S-1 submission deadline draws near. If the documents meet all necessary conditions, major issuers can roll out their ETFs together. This could pave the way for other crypto ETFs, like those for Solana, for which VanEck already filed a few weeks ago. With July 23 approaching, the market will closely observe the performance of these new ETFs and their influence on cryptocurrency investments. This launch could be a pivotal moment in integrating digital assets into mainstream financial markets."
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMi0wFBVV95cUxOWkI0Y2lOZG14eGs0NWhSLXFDQlBTTUg5S2NyVWxxTzM0MVdaMUVpczEzMExLUkZGVndqX3dNS0UwWWpkMkJPeDlmdE1QVmNINUU2SzBtZ2VWUkRiZXVtY2J1TDdiYWxmSTI3bV8wZS1mMkhRcXBZWHNHamY2YXplVEFrN2hwMmJiVkdLM3pzcVlaMC1vdkN5ejJ3OWREMXFBWWhvQ2lXWmwyQ0JHUVdkaGxGMTcwLTlfNldLeE05bDV3YkVsUEhjaWtTdktKbnFydFdB0gHgAUFVX3lxTE5WcHhTMGpoWVJ2T0x0b3hnOVlyX2loVmpIellDZnF0WEpvUUhGdzNUUmNFSUhqUEFZZDBXUnlBc1RXX2NEOWwyQWhXeDhpb3NNak1fSmc1bTZEc3NTd2ttVndtLVJFRGFUVHp1V2lCUUhTekVpdk9vRWRQdGxFTVVld1dVUGtmZXhCeXBINkpDVlJEcDFwb01DVUd4eWhQUjBOMk1LeFdBUk9sZUEyajNwcHhPOVBPZTBLbzFya1lQTE4yRWZHUThBWFo2MUxfY0h2Y3hSZ2E4Nk5Mdzlxbzgx?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jul 2024 07:00:00 GMT",
        "title": "DeFi Sensation ETFSwap (ETFS) Set To Launch Trading Platform For Bitcoin, Ethereum, And Solana ETFs - Outlook India",
        "content": "While ETFSwap gives its investors a free hand, it ensures transparency and security on its own end. Consequently, its team members have undergone and passed a KYC verification by the renowned security auditing firm SolidProof . Likewise, cybersecurity giant CyberScope has run an audit on the ETFSwap (ETFS) infrastructure, and the result showed its resistance to cyberattacks. These measures are implemented to re-emphasize asset security on the ETFSwap (ETFS) trading platform, giving investors peace of mind about their investments."
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMi6wFBVV95cUxOY19hVDRzTm11M003NzRBajBtRkVfZVVvTzRFNm4tVElXbXNuaWxGcnVHaUJ1c1M0OXYxSFMtOUFQODBZQWJXcWpodXFveC0tbWxsWnN0TzFTSDRiNkFPSGtNY29xbDBNYnF0cU81R29TX0FFWjBhZnVjakxMUzA1WnNhUVptenpCRzNPcThEbGxzblhJX2hJM254YVJ0SW5OS3c2SnBnTGdkSlZhaG1tcHJyOXQwMDR3dVpkcmFHZHJQbXJKVkZYbUZpNThOVGltWTNKdDB0TFZIaDJUOFY3NEFPN2pMUG5hMWZj0gHwAUFVX3lxTE5hblc3bW40QjMzbG9ObktSNEJaMUJwejc2dFlGZFVaamw5RlpvNEdYSERPNzYtbklMZXZ4STNoQzZsX2J0bmF5REwzTEprUGZWWmNodTJacXZfUi0tMXZPNE5tMmFrTGo1RlpPMkg0bDNHTHZuemlIai1Fc1JCVFlMeno0Ri1OQjBtVVYzZi1HSGo0cUFSVTZ1Nk5MallxeW1JRTA3OWMzZDMzYl9nWGQxa0Y3SmIwSVFVSkR1QzlZM2NGSzlSRkUzOEJzMXItVWpsN0pSbVF6RmwwaHpqWEVvV0pjV3JsUnVtYm8yNWdXWA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jul 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum, XRP gains grind to a halt as traders turn cautious ahead of ETH ETF approval - FXStreet",
        "content": "While I am impressed by the current bounce in Bitcoin $BTC it should be noted that the sequence of lower highs and lower lows continues despite the halving, despite the ETf, despite the hype pic.twitter.com/V5M6FFaMpJ\n\nUPDATE: The WazirX Hacker is out of SHIB. $102.1M SHIB was stolen this morning from WazirX and has now been fully sold off by the attacker. pic.twitter.com/sjCSZJhdIv\n\nSAVE THE DATE: MATIC → POL After community consensus, the long-awaited upgrade is set for September 4th • Initial phase: POL replaces MATIC as the native gas and staking token for Polygon PoS • Subsequent phases: POL will serve a crucial role in the AggLayer More details pic.twitter.com/SyxsFAlOeZ\n\nEthena (ENA) trades at $0.478 at the time of writing. ENA is rallying early on Thursday. The token could extend gains by 20% and hit the lower boundary of the Fair Value Gap (FVG) between June 22 and June 24 at $0.573.\n\nThe Ethereum ETF may not be as bullish as you think for the first few months and here is why… As soon as the Ethereum spot ETF gets approved, the Grayscale Ethereum Trust of ETHE will get converted into an ETF. Blackrock fees are .25% Vaneck fees are .25% Grayscale fees are… pic.twitter.com/Cydcbkqusb\n\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all or a portion of your investment, as well as emotional distress. All risks, losses and costs associated with investing, including total loss of principal, are your responsibility. The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of FXStreet nor its advertisers. The author will not be held responsible for information that is found at the end of links posted on this page.\n\nIf not otherwise explicitly mentioned in the body of the article, at the time of writing, the author has no position in any stock mentioned in this article and no business relationship with any company mentioned. The author has not received compensation for writing this article, other than from FXStreet.\n\nFXStreet and the author do not provide personalized recommendations. The author makes no representations as to the accuracy, completeness, or suitability of this information. FXStreet and the author will not be liable for any errors, omissions or any losses, injuries or damages arising from this information and its display or use. Errors and omissions excepted.\n\nThe author and FXStreet are not registered investment advisors and nothing in this article is intended to be investment advice."
    },
    {
        "id": 73,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPVVNMYTVNWGhEX2pnR1pxT2pIUHN3aUdvSG5RRDNKSzFPNHZsb21HME51T1dhTFBIQ3RhTWs3UlRDN09RZHpzVFRBa2dzaG9vendBYkk5ZHVYNjFwNEZDUjc2ck96Q25DdUJSa1FPQ0ZBVDdmTzN2YkZzMXdhWC0yYlM0c1JBQ0tCNjR5UUdB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jul 2024 07:00:00 GMT",
        "title": "Grayscale prepares for Bitcoin and Ethereum ETF spinoffs in July - Finbold - Finance in Bold",
        "content": "Grayscale is preparing for a Bitcoin (BTC) and Ethereum (ETH) exchange-traded funds’ (ETFs) spinoff on July 23 and 31.\n\nIn a recent thread on X, James Seyffart, Senior ETF Analyst at Bloomberg, provided an in-depth explanation of Grayscale’s upcoming Bitcoin and Ethereum ETF spinoffs.\n\nDoing a thread on the situation for @Grayscale's spinoff for $ETHE & $ETH because I've gotten about a million questions on it. The mechanics will be essentially the same for $GBTC & $BTC spinoff. If you own 1,000 shares of $ETHE, you should receive 1,000 shares of mini $ETH. 1/ pic.twitter.com/Er66mj5L46 — James Seyffart (@JSeyff) July 19, 2024\n\nThese spinoffs, set to launch later this month, aim to offer lower-fee options for investors. Seyffart clarified the mechanics and timelines, responding to numerous inquiries about the spinoffs. For the Grayscale Ethereum Trust (ETHE), the spinoff will occur on July 23, while the Grayscale Bitcoin Trust (GBTC) will spin off on July 31.\n\nAdditionally, the spinoffs will function similarly: every share of the original fund gets a corresponding share in the new mini-fund. Seyffart further explained that to qualify, shareholders must own the relevant shares by the record date, which was July 18 for ETHE and will be July 30 for GBTC.\n\nHow will Grayscale’s spinoff affect investors?\n\nGrayscale’s blog post on spin-offs outlines how the process will affect shareholders. A spin-off is essentially a portion of a larger product moved out to create a smaller, independent product. This new, lower-cost product aims to cater to diverse investment needs while maintaining the total value of an investor’s assets. Shareholders don’t need to take any action; they will automatically receive the new shares, which might take several days to reflect in their accounts post-distribution.\n\nSelect Grayscale products may be undergoing a spin-off in the near future 😉 Not sure what that means? Read our blog and watch our informational video here for what you need to know.https://t.co/RXUkx8GWJb pic.twitter.com/oiNWn0pCfw — Grayscale (@Grayscale) July 18, 2024\n\nGrayscale reasons that these spin-offs allow investors greater choice. This strategy helps existing shares gain the same value spread across the original and new funds, promoting more flexibility and potentially lower fees. Specifically, the Bitcoin Mini Trust will offer fees as low as 0.15%, compared to GBTC’s current 1.5% fee.\n\nGrayscale’s market strategy\n\nGrayscale’s move to spin-off the mini trusts is a maneuver to cope better with competition and current market conditions. As reported by The Block in April, Grayscale’s Bitcoin Mini Trust aims to charge the lowest rate in the industry at 0.15%. In contrast, high fees of up to 1.5% are currently associated with GBTC. This aggressive adjustment positions Grayscale advantageously against competitors like BlackRock and Fidelity, whose funds have attracted considerable inflows.\n\nFurthermore, Seyffart noted that comparable pricing actions would be visible for the ETH mini trust, which will likely trade at a fraction of the typical price due to the smaller fund structure. With these spinoffs, Grayscale expects to democratize market access, making it less costly for investors to get involved in these digital assets.\n\nImplications for Grayscale and broader market dynamics\n\nGrayscale’s strategic shift to mini-trusts comes amidst industry-wide trends of reducing fees for better investor appeal. As highlighted in Reuters‘ March report, the company’s legal fight with the SEC paved the way for the approval of spot bitcoin ETFs. This change has been significant, with an influx of investments observed in lower-fee ETFs like those managed by BlackRock and Fidelity.\n\nThe strategic acumen displayed by Grayscale through these spin-offs might reinvigorate their standing in the market. Strong competition and investor demand for lower fees highlight the intense dynamism within the ETF space—evidence of which can be seen in Lookonchain’s reports showing mixed ETF flows and fluctuating investor confidence.\n\nOverall, Grayscale’s anticipated Bitcoin and Ethereum mini trust ETFs symbolize not just a tactical shift but a broader evolution within the crypto ETF landscape. By offering a lower-cost alternative, Grayscale may well solidify its leadership status in the crypto-focused asset management arena. Investors will be keen to see how these developments unfold in the coming weeks."
    }
]