[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxOcU83RHZGWDFrSGFlMVJVZ29WRktpM20yaU5DNDFIRWNxNkR3eVk2MDVPVkJxMkZvdEJrWUlDRXE0V3hIN1RBWlMtdmNTVzNNYWQwYnRzemtmRnRRcXczNmNlRG0wODVHVmMwRFc4WmdHQjE2aU54WG01b0ZlOUxHTG8xV19zelZOQ1dBVXlmT2RtYV80MGhmNVJBZ1R1aWN5Wmc1azQzSWZYbUNQVzk2aG4zU1piRFZoaGlsQ184dUFTeXZk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Mar 2024 07:00:00 GMT",
        "title": "Vitalik Buterin Proposes Hard-Fork Strategy to Protect Ethereum From Quantum Attacks - The Quantum Insider",
        "content": "Insider Brief\n\nEthereum co-founder floats a hard fork strategy to safeguard Ethereum funds against potential quantum computer attacks.\n\nVitalik Buterin’s strategy involves a series of measures designed to fortify Ethereum’s defenses.\n\nSome community members have voiced concerns over the efficacy of such measures if quantum computers capable of decrypting Ethereum wallet.\n\nEthereum co-founder Vitalik Buterin has proposed a hard fork strategy aimed at safeguarding Ethereum funds against potential quantum computer attacks. This proposal has ignited a widespread discussion on the necessity of quantum security measures within the blockchain ecosystem, as reported by Blockchain.News.\n\nButerin’s proposed strategy involves a series of measures designed to fortify Ethereum’s defenses in the event of a quantum computing breach.\n\nA quantum computer’s theoretical ability to solve certain mathematical problems far more efficiently than classical computers are the cause for concern. These cryptographic techniques serve as much of blockchain’s security. Quantum computers could — again, theoretically — undermine Ethereum’s cryptographic bedrock by decrypting private keys and compromising the integrity of smart contracts. This quantum capability could also disrupt consensus mechanisms, centralizing control or threatening the security of staked assets, which would Ethereum’s long-term viability and undermining trust in the platform.\n\nKey Steps\n\nKey steps were discussed in the Ethereum Research forum. The steps include the reversion of all blocks subsequent to the detection of a quantum attack, the suspension of traditional externally owned account (EOA) transactions to prevent further vulnerabilities, and the introduction of a new transaction type tailored for smart contract wallets that aligns with the anticipated RIP-7560 standard.\n\nThe proposal also outlines the implementation of an innovative transaction type or opcode that would enable users to submit STARK proofs. These proofs verify the user’s knowledge of a private preimage and a public address generated through approved hash functions, culminating in the replacement of the user’s account code with a quantum-resistant validation mechanism.\n\nAmong these deliberations, the web site reported that some community members voiced concerns that these measures would not be effective if people with malevolent intentions secure quantum computers capable of decrypting Ethereum wallets. These skeptics argue that distinguishing between legitimate owners and attackers could be extremely difficult under such circumstances. They advocate for the adoption of NIST standardized algorithms in a hybrid configuration with classical algorithms, such as combining the Dilithium and ed25519 algorithms, despite the resultant increase in block sizes due to the high number of signature and public key sizes of many current post-quantum schemes.\n\nAlternative propositions include the development of machine learning systems dedicated to the surveillance and identification of anomalous transactions, serving as an early warning mechanism to activate a fail-safe fork.\n\nThe Ethereum community’s engagement with these quantum security challenges underscores the sector’s proactive stance in navigating the security arms race posed by quantum computing advancements. Innovations such as Lamport signatures and ERC 4337-based quantum-resistant smart contract wallets, along with the integration of quantum-safe cryptographic solutions in digital signature applications, epitomize the blockchain sector’s commitment to resilience and adaptability in the face of technological threats.\n\nIf you found this article to be informative, you can explore more current quantum news here, exclusives, interviews, and podcasts."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxOU01NcjByVGZSVlg1SWFqRGpJRmU3MEdaUWpRVURCR1Y0NXpubXpmVDRMY28yN1dJMGRfczBaNnA5SDkyYUJueUlkb3piX2ZUU0ZFR2hzOUFHRWVLb3J2YTVvZjVpTHBFNU85aGJGWWpySzNnZU92OW9MOFhhX2NVR0xTNEthTGdrZFZ1RDFndDV2cE5WY1gyWlZBcUo?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 12 Mar 2024 07:00:00 GMT",
        "title": "Punters put 79% odds on Ethereum all-time high even as ETF approval chances shrink - DLNews",
        "content": "Ethereum has a four-in-five chance of hitting a new record high in 2024, according to bettors on Polymarket.\n\nAt the same time, analysts and online punters’ hopes for an Ethereum ETF approval are dwindling.\n\nSo what’s driving the surge?\n\nOnline punters put the odds of Ethereum breaking a record this year at 79%, according to a bet on crypto predictions platform Polymarket. That’s up from 31% in mid-February.\n\nYet bettors and analysts are putting slim chances of a Securities and Exchange Commission approval of a spot Ethereum exchange-traded fund.\n\nThe deadline for an SEC decision on VanEck’s application is on May 23.\n\nBettors on Polymarket give a spot Ethereum ETF a 31% chance of being approved, down from 82% at the beginning of January.\n\n“I get all the reasons they should approve it — and we personally believe they should — but all the signs/sources that were making us bullish [two and a half months] out for Bitcoin spot are not there this time,” Eric Balchunas said in a post on X.\n\nHe and his fellow Bloomberg Intelligence analyst James Seyffart revised their approval odds to 35% on Monday, down from 70% in February.\n\nThe hope is that if and when spot Ethereum ETFs are approved, they will give the asset a similar growth as Bitcoin had on the back of ETFs in January.\n\nThe news comes as Bitcoin hit a new all-time high of $71,000 on Monday, with many wondering if Ethereum will follow suit.\n\nJoin the community to get our latest stories and updates\n\nEthereum surged to a yearly high above $4,070 on Monday and is up more than 60% over the last 30 days.\n\nEthereum reached a record $4,878 in November 2021.\n\nAnalysts have identified several key factors that could super-charge it to new peaks.\n\nThey include broad optimism, supply-side dynamics, and the upcoming Dencun upgrade.\n\nSupply constraints\n\nAnother Ethereum tailwind: its shrinking supply due to tokens being locked up for staking, Pratik Kala, senior digital asset investment analyst at crypto fund manager DigitalX, told DL News on Monday.\n\n“Less supply to go around is always bullish,” Pratik said. “This also indicates strong long-term investor demand to buy/hold/stake ETH versus using it for short-term speculation.”\n\nStaking in Ethereum parallels Bitcoin mining by generating additional tokens, verifying transactions, and safeguarding the blockchain.\n\nLocking up tokens for staking effectively means removed them from the circulating supply, which can lead to a decrease in the overall available supply.\n\nRoughly 26% of Ethereum’s estimated circulating supply of more than 120 million tokens are locked away, according to blockchain explorer beaconcha.in.\n\nDencun upgrade\n\nInvestment bank JPMorgan and spot Bitcoin ETF provider Grayscale are among those that have identified the Dencun upgrade as a catalyst for Ethereum.\n\nThe upgrade, due Wednesday UK time, is designed to enhance scalability and reduce transaction fees on layer 2 platforms.\n\n“With layer 2 solutions built on top of Ethereum, the blockchain is becoming the settlement layer for a whole new digital infrastructure encompassing gaming, trading, and investing,” Eugene Cheung, Bybit’s head of institutions, told DL News earlier in March.\n\n“The value of all of this will tend to accrue to the ETH asset.”\n\nCorrection: A previous headline misstated the Polymarket odds of an Ethereum record at 56%. It has been corrected to 79%.\n\nSebastian Sinclair is a markets correspondent for DL News. Have a tip? Contact Seb at sebastian@dlnews.com."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTE9tTHRKZUlyZHNudEVvM3hHVVh3QlkxWHFaRzFVZGhreFJNUFAyYTAyYzltSmRBRHpURVF0WXNTQ21MUExIOWpwQXROaWFWYklRNTNwQnRRS3RBMGJlb1l4dUs1ekExWHZRUDcwVHBZVnhnMXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 12 Mar 2024 07:00:00 GMT",
        "title": "Cheatsheet: Ethereum on track to burn $10B ETH over next year - Blockworks",
        "content": "This is Cheatsheet, a primer on what’s happening in crypto today.\n\nCrypto has hit that point of the bull market where anything and everything is rallying without any real link between star performers.\n\nToday, toncoin (TON) is beating the top end of the table, up 25% as of 8 am ET. While TON is its own layer-1 blockchain, the token finds utility with a web of Telegram trading bots rapidly gaining popularity over the past year.\n\nXRP is second for the day with 12.5%, followed by flow (FLOW), the native crypto for the NFT-focused chain built by Dapper Labs, which is up 9%.\n\nBitcoin (BTC) and ether (ETH) have ended up flat over the same period. Crypto’s total market capitalization is now only 7% shy of its $3 trillion record high, set in late 2021.\n\nOn-chain mail\n\nAfter plateauing for six weeks, Ethereum is now burning supply faster than at any point in the past nine months.\n\nThe ETH supply has shrunk by 74,603 ETH ($300 million) over the past month.\n\nBurns were totally stagnant between Christmas and the second week of February.\n\nEthereum will burn $10 billion ETH over the next year at its current pace (and current prices), per ultrasound.money.\n\nAs of August 2021, the Ethereum network burns a small amount of ETH with every transaction — specifically the base fee paid by users.\n\nThe ETH supply has shrunk by 0.31% over the past year and is currently on track to reduce by 1.42% over the next if on-chain activity keeps up.\n\nThe network still issues fresh ETH with every block: without burns, the circulating ETH supply would increase by 0.5% every year.\n\nTop DEX Uniswap still burns more ETH than any other platform — more than 22,000 ETH ($87.9 million) over the past month.\n\nTelegram trading bot Banana Gun is burning more ETH than layer-2s Arbitrum and Optimism.\n\nETH supply is tipped to dip below 120 million sometime in May, which would return it to Aug. 2022 levels.\n\nEthereum supply may have peaked in September 2022 (source)\n\nCrypto business\n\nBitcoin’s strength still hasn’t converted to gains for crypto stocks, with only two set to open Tuesday higher: MicroStrategy and Coinbase.\n\nMicroStrategy gained 4.11% on Monday and added another 5% after hours as of 7 am, ET.\n\nCoinbase slipped nearly 1% but regained 1.5% post-bell.\n\nCleanSpark and Marathon took a beating, down 17.24% and 13.2%, respectively.\n\nStill, CleanSpark is the only miner to beat S&P 500 over the past month, now up 20% to the S&P’s 2%. The Las Vegas-headquartered firm announced plans to double its hashrate in February.\n\nOver the year-to-date, CleanSpark’s 52% gains are second only to MicroStrategy, now up 147%. Coinbase trails slightly with 48.3%.\n\nCleanSpark, now the second-largest mining stock by market value, flipped Colorado-headquartered Riot earlier this month, worth $3.34 billion to $2.98 billion.\n\nFormer MicroStrategy CEO Michael Saylor has sold $167.4 million in MSTR shares this year, per OpenInsider.\n\nSaylor sold those shares for $688.29 on average, MSTR currently trades for more than double that price.\n\nHe announced a plan to sell 315,000 shares in January — he’s more than three-quarters of the way through that stack.\n\nOn the ground\n\nLoading Tweet.. We never stood a chance\n\nLoading Tweet.. Prometheum is bleeding cash\n\nLoading Tweet.. Analysts in disbelief\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxPSEpVNTBMWFhoREdkZmJvN1Z3Y0g5ZncxRUNfRGlSYlBfakxxX0haZ3d5LUtVZnJvMl9oM190NDh2RTdwc3N6Nm5tRnlKOFl6VTF4eFJKbEloVTZLemJUQXEwdHlOYXlzQVBEeWx1SzJJbW1hZFRnaUZVam1Rcy1VZFFOWUpKOFhkUlE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Mar 2024 07:00:00 GMT",
        "title": "London Stock Exchange To Accept Bitcoin and Ethereum ETNs Applications Starting Next Quarter - Yahoo Finance",
        "content": "London Stock Exchange To Accept Bitcoin and Ethereum ETNs Applications Starting Next Quarter\n\nThe London Stock Exchange (LSE) has announced plans to accept applications for Bitcoin and Ether crypto exchange-traded notes (ETNs) in the second quarter of 2024. However, the exact date has yet to be confirmed.\n\nAccording to the LSE's Crypto ETN Admission Factsheet, eligible ETNs must be physically backed and non-leveraged. They must also be backed by Bitcoin or Ether and have a market price or value measure of the underlying asset that is publicly available.\n\nThe underlying crypto assets must be held in a cold wallet or similar storage solution, including cold staking, and by a custodian subject to Anti-Money Laundering laws in the United Kingdom, the European Union, Switzerland, or the United States.\n\nETNs are debt securities that provide exposure to an underlying asset. They allow investors to trade securities that track the performance of crypto assets during the exchange's trading hours.\n\nThe U.K.'s Financial Conduct Authority (FCA) has stated that it will not object to requests from Recognised Investment Exchanges (RIEs) to create a market segment for crypto-backed ETNs.\n\nHowever, these products can only be offered to \"professional investors,\" such as credit institutions and investment firms. However, it will not be available to retail investors, with the statement saying:\n\n“The FCA continues to believe cETNs and crypto derivatives are ill-suited for retail consumers due to the harm they pose. As a result, the ban on the sale of cETNs (and crypto derivatives) to retail consumers remains in place.”\n\nThe FCA has also emphasized that cryptocurrencies are still deemed “high risk and largely unregulated,” and warns the public that their investments could go to zero. The UK government has recently ramped up regulatory efforts in the crypto industry, including allowing law enforcement to seize crypto assets suspected of being involved in illicit activities without a conviction."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxQbU1uYllpaE9JeGx5b0JIXzJxVlBfQ1R5OHJnNXIwVDN3V1BBaGxWOGlidXhwQ2R6NXNrRG54S0hjcWJMdHl6am5vYWtoRTduRUlIU3VDRjd2cjZ1eE1TblFIVTctcXZ2RWltdk9PMG5ZVHRWbnZCMEUtanlTTk5DNXVUSlU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 12 Mar 2024 07:00:00 GMT",
        "title": "Bitcoin and ethereum’s intrinsic valuations - ETF Stream",
        "content": "Robert Greer, author of What is an asset class anyway?, argues assets that lack an objective measure of value and have a supply constraint are more vulnerable to irrational exuberance, citing the ‘dot-com’ bubble as an example.\n\nCrypto assets lack an objective measure of value today among investors, similar to emerging tech companies in the late 1990s.\n\nWe can value any asset using two approaches – intrinsic or relative. Intrinsic valuation measures an asset’s value based on its capacity to generate cash flows.\n\nOn the other hand, relative valuation methods, also called “pricing”, estimate how much to pay for an asset based on what others are paying for comparable ones.\n\nInvestors might use a discounted cash flow method (DCF) to value a stock, but they would not use that for a piece of fine art.\n\nSimilarly, we must outline the various types of crypto assets to understand the differences we may expect in their value accrual and specific valuation approaches.\n\nIn this regard, it is helpful to categorise crypto assets according to the three asset superclasses proposed by Robert Greer:\n\nCapital assets: “An ongoing source of something of value” (e.g., bonds and stocks). Consumable/transformable assets: “You can consume it. You can transform it into another asset. It has economic value. But it does not yield an ongoing stream of value” (e.g., physical commodities). Store of value assets: “They cannot be consumed, nor can they generate income. Yet they do have value” (e.g., currencies and collectibles).\n\nLike the internet architecture, cryptoassets and blockchain technology have two layers: (1) infrastructure and (2) applications.\n\nIn his 2019 work, Chris Burniske categorised crypto assets at the infrastructure layer based on the consensus mechanism of the blockchain:\n\nProof-of-Work (PoW): In PoW networks like bitcoin, the native asset (BTC) relies on a computationally and energy-intensive lottery called mining to determine which block of transactions to settle on the blockchain and reward the miners. Hence, they belong to the consumable/transformable asset superclass, as they essentially create “a digital-native commodity in the form of secure, globally accessible ledger space”. Investors can use the mining cost of production as a fundamental metric to gauge the lower-bound price of PoW crypto assets like BTC. Proof-of-Stake (PoS): In networks like ethereum and solana, validators must commit a portion of their capital – the “stake”, in this case, ETH – to gain access to a recurring value stream generated by the network’s rules. Hence, they fall in the capital asset category, and their value may be derived from the net present value of annual flows to validators using a DCF method.\n\nWhile we will not delve too deeply into the application layer, we can apply the same first-principles thinking:\n\nGovernance tokens yield voting rights and represent ownership of the application. They are analogous to common stock in traditional finance, so they fall in the capital asset class. Utility tokens drive the economics of the system as their sole function, meaning they fall in the Consumable Asset category. Non-fungible tokens (NFTs) are collectibles like fine art in their most typical form today, falling in the Store of Value category.\n\nIntrinsic valuation: Ethereum\n\nFrom the standpoint of a validator, PoS assets like ETH are akin to a stock paying a dividend yield, which means we can conduct a DCF valuation following four simple steps:\n\n1. Estimate the cash flows during the life of the crypto asset\n\na. Transaction fees within the network accrue to validators. Just so, fees are a proxy for revenue. Ethereum validators received $401.7m in transaction fees (net after the burn mechanism) from 28 January 2023 to 28 January.\n\nb. Token issuance does not dilute the value of validators. On the contrary, they have the right to new issuance, similar to how shareholders may receive stock-based compensation. ETH Issuance from January 28 2023, to January 28, 2024, amounted to $1.5bn.\n\nc. Total cash clows: a + b = ~$1.9bn in the first year.\n\n2. Estimate expected future cash flows and the lifespan of the crypto asset\n\na. Future cash flows: We propose a slight variation of the three-stage growth model to project ethereum’s future cash flows. Specifically, we forecast an initial period of aggressive growth, followed by an incremental decrease that eventually stabilises at a more moderate growth rate.\n\nb. Lifespan of the asset: With public companies that at least in theory can last forever, equity analysts generally assume that cash flows beyond a specific point in time continue in perpetuity. Investors may apply the same logic to PoS crypto assets, but for simplicity’s sake, we assume ETH’s life will be 20 years.\n\n3. Estimate the discount rate to apply to these cash flows\n\na. Lower-bound discount rate (9.9%): In the past 10 years, the Invesco QQQ Trust ETF obtained a 9.90% compound annual return.\n\nb. Higher-bound discount rate (21.9%): Obtained using the Fama and French Three-Factor Model (market premium, size premium and value premium).\n\n4. Estimate the net present value (NPV) of cash flows using the above parameters\n\nAssuming a discount rate of 9.09%, the implied price per one ETH today would be ~$5,315, a 134% increase from ETH’s price ($2,268) as of January 28, 2024.\n\nOn the other hand, if we use a 21.90% discount rate, the implied price per one ETH would be **$1,349**, a ~41% decrease from ETH’s price, as of 28 January.\n\nInvestors should interpret the results of this DCF valuation with caution and run their own assumptions regarding projected cash flows and discount rates.\n\nThe rationale behind our approach was to be conservative and capture the high volatility of ETH in the discount rate to accurately reflect the asset’s riskiness.\n\nAnother implicit assumption of this approach is that the asset’s monetary premium (Store of Value) is embedded into the DCF.\n\nSource: https://ark-invest.com/articles/analyst-research/bitcoin-new-asset-class\n\nIntrinsic valuation: Bitcoin\n\nWhen it comes to crypto-commodities, the marginal cost of production is vital as it sets the price floor at which producers (miners) are willing to sell. From the outset, it is crucial to emphasise that we are not suggesting that the price of BTC should be determined by its marginal cost of production.\n\nTo do so would be to adopt a labour theory of value, which is ostensibly false. Instead, the marginal cost of production is a tool that can help investors estimate a lower bound price level for BTC and other crypto-commodities.\n\nSource: 21Shares\n\nIn 2019, Charles Edwards proposed a methodology to estimate the global average US dollar cost of producing one BTC. The first component of the method is the Cambridge Bitcoin Electricity Consumption index (CBECI), which provides an up-to-date estimate of the bitcoin network’s daily electricity load.\n\nEdwards estimates the cost of production per BTC by:\n\nCalculating the number of BTC mined per ray (based on miner rewards) Calculating the daily electricity cost to mine one BTC (daily electrical cost) Estimating the global average “elec-to-total cost ratio” = (bitcoin electrical cost)/(daily cost of running a bitcoin mining business).\n\nAn investor can then compute bitcoin production cost as (daily electrical cost)/ (elec-to-total cost ratio).\n\nFinally, the bitcoin production cost is compared to the “bitcoin miner price”, which attempts to capture the revenue one BTC provides to miners.\n\nBitcoin miner price is calculated as follows: BTC price + (daily transaction fees)/(daily BTC mined).\n\nWhen the BTC price is below the total cost of mining one BTC, it signals that bitcoin miners may be struggling and potentially taking short-term losses.\n\nThe estimated global average electricity cost to mine one bitcoin is $23,211.1, as of 28 January, while the estimated global average total cost to mine one bitcoin is $38,685.1.\n\nTo reiterate, investors should not interpret this range as the fundamental value of bitcoin, which is subjective, but rather as an estimate of its price floor based on miner profitability and subsequent behaviour patterns.\n\nThis article first appeared in ETF Insider, ETF Stream's monthly ETF magazine for professional investors in Europe. To read the full edition, click here."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxOanpvamlQN3VJVWpLLWh1dWdIdUM3TVZoQ2xIckJGZl9zMUpjNzVwQi1DNk5RTlhxeDZ4OHZORXVTVGRkNUczbWk5TlpBZDBXUXV2YmlwanZUaXNfN3o2NUZTUVFmWDZZTlRsTHpLdndOOVVZMkYyZk9WNXFXb0xtMHVfcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Mar 2024 07:00:00 GMT",
        "title": "3 Reasons Ethereum Price Could outperform Bitcoin in 2024 - crypto.news",
        "content": "Ethereum price broke above $3,9500 barrier again on Feb. 22, while Bitcoin price rally struggles for momentum: 3 vital market metrics suggest ETH could further extend its lead over BTC in the weeks ahead.\n\nEthereum (ETH) and Bitcoin (BTC) are historically closely correlated, but in 2024, ETH seems to have gained the upper hand. A deep dive into the on-chain data trends and expert analysis provides key insights into which asset would come out on top as the year unfolds.\n\nIs Ethereum better than Bitcoin in 2024?\n\nSo far in 2024, Ethereum and Bitcoin, the two largest assets in the crypto sector have attracted billions of dollars in capital inflows. As of March 2024, BTC is trading at historic all-time highs of $71,200, while ETH price attempts to establish a steady support above the $4,000 milestone.\n\nHowever, a closer look at the price charts shows that ETH currently has the upper hand having outperformed BTC by 7% in terms of year-to-date performance.\n\nEthereum (ETH vs. Bitcoin (BTC) Price action January to March 2024 | Source: TradingView\n\nThe chart above shows that ETH price has increased 79% between Jan 1 and March 11 2024, which is significantly higher than Bitcoin’s 72% price gains.\n\nHowever, while ETH currently has the upperhand, to determine which asset is a better value for money in 2024, it is important to examine the market catalyst driving both assets.\n\nFirst, it is important to note that both assets are driven by separate narratives and market catalysts in 2024.\n\nFor Ethereum, the ongoing ETH ETF filings, liquidity staking derivatives, the Eigen-layer re-staking and Dencun upgrade have emerged major themes within the ecosystem in Q1 2024. Meanwhile, the dominant themes for Bitcoin are the rapidly growing demand from the 10 newly-approved BTC ETFs and the upcoming halving event scheduled for April 19 2024.\n\nThese key events have triggered diverse changes in on-chain transaction trends and investment patterns across both ecosystems, leading to Ethereum price outpacing Bitcoin.\n\n3 reasons Ethereum price could outperform Bitcoin in 2024\n\nRetail investors are rallying behind ETH as Institutions dominate BTC markets\n\nThe US Securities and Exchange Commission (SEC) approved 10 new Bitcoin ETFs on Jan 11 2024 marking a real milestone moment for the cryptocurrency sector. Within the 2 months post-launch the ETFs have rapidly acquired about 800,000 BTC, about 4.2% of the total supply in circulation.\n\nEvidently, Bitcoin price has benefited immensely from record-breaking inflows made by the corporate institutional investors in 2024. But interestingly, the ETF’s dominance has triggered a skittish reaction among BTC retail investors, much to the apparent advancement of the Ethereum ecosystem growth.\n\nSantiment’s total holders metric estimates the total number of active or funded wallet addresses that currently exist on a blockchain network. It serves a proxy for measuring the level of adoption among retail investors and the mass markets.\n\nEthereum (ETH) Total Holders vs Bitcoin (BTC) | Source: Santiment\n\nIn the last 50-days dating back to Jan. 21, the Ethereum network has attracted 3.59 million new holder addresses, while 200,000 BTC addresses emptied their wallets and exited the network.\n\nThis rare on-chain trend suggests that the retail mass markets are overwhelming behind Bitcoin. As Bitcoin becomes more concentrated in the hands of fewer whale investors and corporate entities, it puts BTC price at risk of market manipulation and external shock from the macroeconomic fronts.\n\nThe significant increase in new holder addresses on the Ethereum network compared to the number of BTC addresses emptying their wallets suggests a divergence in retail investor sentiment between the two cryptocurrencies.\n\nFirstly, this trend indicates that retail investors are increasingly favoring Ethereum over Bitcoin, potentially due to Ethereum’s promise of profit-optimization and passive income from its low-risk staking yield to its retinue of decentralized finance applications (DApps).\n\nFurthermore, the growing dominance of institutional investors and corporate entities in the Bitcoin market introduces a new layer of uncertainty and potential risk. While institutional adoption has been a key driver of Bitcoin’s recent price rally, it also increases the susceptibility of the market to large-scale sell-offs or coordinated trading strategies by these influential players.\n\nIn the event of a tradfi market downturn or macroeconomic policy changes, the concentrated ownership of Bitcoin in the hands of highly-sensitive Wall Street players could exacerbate BTC price declines and lead to heightened market volatility.\n\nBitcoin Miners Trading Bearish while Ethereum Node Validators remain bullish\n\nThe divergence in the current trading disposition of Bitcoin miners and Ethereum node validators is another vital market catalyst that could drive ETH price further ahead of BTC. On the Bitcoin network, miners dedicate computing resources to validate transactions and secure the network in exchange of BTC block rewards. Ethereum, since its transition to Proof of Stake (PoS), now relies on its node validators for that critical function.\n\nBitcoin’s next halving event slated for April 19, will see miners’ rewards slashed from 6.25 BTC to 3.13 BTC. With the event now less than 40-days away Bitcoin miners have entered a selling frenzy in a bid to cash-in before the halving date.\n\nBitcoin (BTC) Miner Reserves December 2023 to March 2024 | Source: IntoTheBlock\n\nAs of Dec. 29 2023, Bitcoin miners held a total of 1.96 million BTC. But as the halving date drew closer, the miners rapidly offloaded 300,000 BTC, cutting down their balances to just 1.93 million BTC at press time on March 11 2024.\n\nValued at the current prices of $71,200, the miners have sold $21.5 billion worth of BTC in Q1 2024 ahead of the halving.\n\nIf the Bitcoin miner’s selling trend persists, it could slow down the BTC price rally, especially in comparison to Ethereum whose node validators have been accumulating more coins in recent months.\n\nEthereum node validators have doubled down on their bullish positions, depositing 2.4 million ETH worth $9.7 billion into the beacon chain staking contracts since Jan. 2024, meanwhile Bitcoin miners entered a $21.5 billion selling spree.\n\nEthereum (ETH 2.0) Staking Deposits Jan 2024 – March 2024 | Source: Beaconcha.in\n\nAt press time on March 11, the total staking deposits on the ETH 2.0 beacon chain stood at $1.4 million ETH, representing a 2.4 million ($9.7 billion) increase in 2024.\n\nUnlike Bitcoin miners, Ethereum node validators continue to double-down on their long-term bullish positions as ETH price edges further above the $4,000 mark. Positive speculations surrounding the Dencun upgrade, and progress of ETH ETF filings are key catalysts incentivizing ETH stakeholders’ bullish disposition.\n\nWith these catalysts still in play, ETH could witness even more coins taken out of circulation, while BTC circulation supply increases as miners increase selling pressure as the halving approaches.\n\nVanEck’s Head of Digital Assets to Cryptoquant also echoed this stance in a recent interview with Cryptoquant.\n\n“Over the medium term, ETH tends to outperform BTC in the halving year, right? So I don’t want to lose the forest for the trees. I don’t think there will be flippening, but I do think when the year (2024) is said and done, ETH will have outperformed BTC.\n\nIf these scenarios play out as predicted, ETH price will likely extend its lead over BTC in the weeks ahead.\n\nTechnical Indicators Highlight Ethereum’s Path to $5,000\n\nIn summary, Ethereum is expected to pull greater retail market demand than Bitcoin and also experience a temporary decline in circulation supply amid rising staking deposits. These key factors put ETH price on a path to a new all time highs above $5,000.\n\nETH is currently trading above the $4,030 range at the time of writing on March 11. IntoTheBlock’s in/out of the money chart shows that Ethereum has a relatively clear path to reaching a new all time-high.\n\n\n\nAs seen below, the chart highlights the $4,500 territory as the largest resistance cluster above the current prices. At that range, 617,760 addresses had acquired 1.6 million ETH at the average price of $4,557.\n\nEthereum (ETH) Price Prediction | Source: IntoTheBlock\n\nConsidering that they have been holding at a loss for 3-years, many of those holders could move to close their positions once Ethereum prices approach their break-even point.\n\nIf ETH price can establish a steady support level above that $4,500 area, it could potentially propel ETH price to a new all-time high above $5,000."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTFBiQnltT3pCcENTd01jRXRrOFlQRDktNWxTTEVERzB1MDRkSmhlTmxOVnZJR0dWdnpFdlhpX01qRVBrVmNxeUc0QWRrY3YtTUN1VmQ0bW9kWW1WakNqVm5JXzJtcGdXRUxlMTd2QzdTQnJLRHRQSkVCVW5rNNIBgAFBVV95cUxQSkhYbzEzemYtdVhlLVpESnBIWnlmdFJJYlhPazhGV3FmSkI3OXUxX2d5Y3hGREVDYnlqRWEtSGotNTd1Rm04X0FxMms2V04tUElVTmtsZUs5OERpNlVqWmJjdFlPRjNQTndTUXczMjd1Zkd2Vklod0h0N0Z0Vmh3bQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 12 Mar 2024 07:00:00 GMT",
        "title": "Ethereum surpasses US$4,000 ahead of Dencun upgrade - Forkast News",
        "content": "Ethereum is set to undergo a significant upgrade named Dencun this Wednesday, which is anticipated to reduce gas fees for scaling networks.\n\nThe upgrade, which combines elements from previous upgrades Cancun and Deneb, aims to improve the blockchain’s scalability, security, and user experience.\n\nThe Dencun hard fork will introduce nine Ethereum Improvement Proposals (EIPs), including proto-danksharding with EIP-4844, which is expected to lower transaction fees and increase processing speed.\n\nThe Dencun upgrade follows roughly a year after the Shanghai upgrade and is considered one of the most significant changes to the Ethereum network since the Merge.\n\nIt is designed to enhance the network’s layer-2 scaling solutions, which are platforms built on top of the Ethereum blockchain to increase its transaction capacity\n\nThe upgrade will not directly affect mainnet gas fees but is expected to encourage more users to utilize layer-2 networks.\n\nThe Dencun upgrade also includes EIP-7044, which allows validators and stakers to set conditions for exiting their staking positions, providing additional security and flexibility."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE54S2hTaUtMeUs4bXc4M1VPU2xRX25ULVdkVzd4ajBkaEkyR0FDMmJVWVg3cWxUbXd1eXdMVE53a1FhQlloMVBfX01vRkJIRWZpaDIyc200OTVLS0psWFlXUTYtYmREYUFFRXVKOFVmc2pzUdIBekFVX3lxTE9Xb1lmZ0ltLVBTbXZwaUVCd19GQkdMSVV2V2lvZzl2ZEVxUkl0bnVaZHVWTWl5aHVpeHpHVlZoTGRDZ1BHM0lJUHJlOGsxekg5Nk5wTzJQSVgwcGNfaXkyVUozQkJCTTViZWs2eDZTSFFTWWoyWlBtbkJB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Mar 2024 07:00:00 GMT",
        "title": "Ethereum Dencun Upgrade Is This Week—Here's What to Expect - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEthereum developers will roll out the much-anticipated Dencun upgrade on Wednesday, March 13. Developers have told Decrypt that the impact on gas fees for Ethereum scaling networks will be dramatic, with some estimating that they'll drop by 75% immediately.\n\nThe name is a portmanteau of Cancun and Deneb, two separate upgrades that have been combined to create the term \"Dencun.\" A word of caution for Ethereum upgrade first-timers: There's nothing that users need to do. Be wary of any blog, email, or Twitter (aka X) post that says otherwise and asks you to click a link or connect your wallet.\n\nLeading up to the upgrade, Dencun has already been pushed live on several of Ethereum's testnets. But the real push, to Ethereum's mainnet, will occur later this week. The upgrade is happening roughly a year after the Shanghai upgrade from April 2023, when the newly upgraded proof-of-stake network made it possible for users to unstake their ETH.\n\nThis new upgrade is targeted at addressing core aspects of Ethereum’s framework, including its scalability, security, and overall user experience.\n\nAD\n\nAD\n\nAt the heart of the Dencun upgrade is the implementation of proto-danksharding, a cutting-edge concept designed to significantly reduce transaction fees and increase processing speed across the network.\n\n\"This is the beginning of a new paradigm for how Ethereum operates,” Karl Floersch, the CEO of OP Labs, which builds layer-2 network Optimism, told Decrypt earlier this month.\n\nThe optimization is expected to make Ethereum a more attractive network to build on for startups, which could add even more protocols to its already bustling decentralized finance (DeFi) ecosystem.\n\nEthereum has long hosted the largest DeFi ecosystem when measured by the number of protocols. In fact, it has seldom accounted for less than half of the entire total value locked in DeFi projects. At the time of writing, there are 990 Ethereum-based projects, according to DeFi Llama.\n\nAD\n\nAD\n\nThe upgrade also includes several key Ethereum Improvement Proposals (EIPs), each tailored to enhance specific functionalities within the network. For example, EIP-7044 will introduce programmable staking exits.\n\nValidators secure the Ethereum network by locking up 32 ETH as their pledge to keep their validator client running and handle the transactions that come their way. If they don't, they stand to lose a portion of their 32 ETH to penalties.\n\nFor users who don't have 32 ETH to become a solo staker, there are pooled staking options. They allow users to deposit any amount of Ethereum and earn a share of the staking rewards (minus the pool fees, of course).\n\nBut what happens if the validator with whom you've staked your ETH experiences downtime and part of your staked funds get slashed?\n\nEIP-7044 will make it possible for ETH validators and stakers to store instructions for when to exit their position—called perpetually valid signed voluntary exits—in smart contracts, and specify when they should be carried out.\n\nFor example, someone running a validator node may want to exit if their hardware remains inactive for a certain number of blocks processed. This is an important protection for validators because they could face mounting fines if they're unable to process transactions on time.\n\nEdited by Andrew Hayward"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxNS2I5SDBKTHRUY2VlSVdsWHVWdThmdFlJX1FkY3RSay0wU2xFWUxjcUlPc01FeU9fVTE0UGk4THFBZGR3WkdsbVo5amgyR1kzLVpxeC1SNmxCNlJlSG9BVnU4bHNGUXZHQWpNa2JtbzVDV1FWT1BlQnZVZ20xc3RFQmNvTTZCcEFpWVHSAY8BQVVfeXFMTzdKRmZZWmRpLVJ2dU92d2NIWXliTUNBT3RpNFZJWnZCRF8xckU4RHI2UE5GbkM5SHNqMDlKbS1vekRmMmY5X2RZTWpISDlPbG9Xa3ZlWWZTZG9DUGFFampidEE2OVkwVzlMNzlRemo0N3RmRjBOOUxUOFlIY0FxV2NYSmdxN3ZxU2MtZjNkcGM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Mar 2024 07:00:00 GMT",
        "title": "Raoul Pal Issues Epic Bitcoin, Ethereum and Solana Price Prediction - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nLegendary trader Raoul Pal has doubled down on his forecast for the trio of Bitcoin (BTC), Ethereum (ETH) and Solana (SOL).\n\nAdvertisement\n\nHow high can Bitcoin soar?\n\nIn a YouTube chat with Anthony Scaramucci, Raoul Pal noted that he believes the Bitcoin price can end this current cycle with a massive price of $250,000. For reference, the Bitcoin price is actively in discovery mode, and it just recorded another all-time high (ATH) above $71,000 as optimism surrounding the coin remains sustained.\n\nDespite the $250,000 price target, Raoul Pal is not convinced this is the best the digital currency could do. He noted that the valuation could be higher depending on the trend in the spot Bitcoin ETF ecosystem.\n\nThe spot Bitcoin ETF has remained the dominant catalyst driving the price of BTC to new heights. The daily accumulation from spot Bitcoin ETF issuers, including BlackRock, Fidelity Investments, Ark Invest and Bitwise, notably surpassed the amount of BTC generated through mining.\n\nWhile an average of 5,000 BTC to 10,000 BTC is stacked up daily, only about 900 BTC are generated across the board, creating a notable supply shock that might help drive the price toward the estimated $250,000 in the long term.\n\nEthereum and Solana get high targets\n\nIn addition to the Bitcoin forecast, Raoul Pal projected a $17,000 to $20,000 surge for Ethereum this bull cycle, while he noted that Solana might jump as high as $700 to $1,000.\n\nWhile the duo of Ethereum and Solana have not retested their respective ATHs at $4,800 and $260 this ongoing bullish run, Raoul Pal has always highlighted their fundamentals as a key catalyst that can drive growth in the long term.\n\nOther analysts have even more bullish projections for Bitcoin as well as Ethereum and Solana, and time will tell how high the three digital currencies will grow this bull cycle."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxQS2luYVJGN1lMNWU4VXJvUTRXSzd0eDNiX3YwQ2hPazMyTzI3SmFjaUo3aXoxb1dtNjd2SHBjWk9RcUxna1Nva0tVbVI2NWtWWXRWUGg4dkZJWmZGS1d2TW96T3hMVml0c214YlA5T1NKSVdNZVZDMjRmR29qNll6TU5nZElja3k2cU5MaA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Mar 2024 07:00:00 GMT",
        "title": "Bitcoin ETFs Are a Smashing Success, and Ethereum ETFs May Be Next - Yahoo Finance",
        "content": "Bitcoin (CRYPTO: BTC) ETFs have been a huge success in the U.S., and it makes sense Ethereum (CRYPTO: ETH) ETFs are next. We learned last week that Coinbase (NASDAQ: COIN) is pushing for exactly that.\n\nIn this video, Travis Hoium explains why Ethereum ETFs may not only drive crypto higher, but also could be a double benefit for Coinbase.\n\n*Stock prices used were end-of-day prices of March 9, 2024. The video was published on March 11, 2024.\n\nShould you invest $1,000 in Coinbase Global right now?\n\nBefore you buy stock in Coinbase Global, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Coinbase Global wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\n\nSee the 10 stocks\n\n*Stock Advisor returns as of March 11, 2024\n\nTravis Hoium has positions in Coinbase Global, Ethereum, and Solana. The Motley Fool has positions in and recommends Bitcoin, Coinbase Global, Ethereum, Polygon, and Solana. The Motley Fool has a disclosure policy. Travis Hoium is an affiliate of The Motley Fool and may be compensated for promoting its services. If you choose to subscribe through their link they will earn some extra money that supports their channel. Their opinions remain their own and are unaffected by The Motley Fool.\n\nBitcoin ETFs Are a Smashing Success, and Ethereum ETFs May Be Next was originally published by The Motley Fool"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxNeGdZM3RERjB0Q3FjelB5NDNGT2xJbk1WTEYxdnJaSHFFcVk2a0ZRcnVmVnhtR2tJM1NwT1hqRkJXaUIwdlBsQkRjSWlRNnpfSXJzczZCOTFJUC1ERjN0QkZXVGZIMFozUnhoYWlEa3FMbVVLZ1JPa2hnNGQ4ZzAzQUx6cUxRVlV5TW1TVWtoM1M2d3U0LVMwUWl4UjFoQnN3RDQ5WVItVkFJb1RzbUtz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 12 Mar 2024 07:00:00 GMT",
        "title": "Ethereum Is Making Itself Future Proof: What to Expect From the Ethereum Roadmap in 2024 - hackernoon.com",
        "content": "Never have I ever seen so much anti-Ethereum propaganda on my Twitter timeline.\n\n\n\n\n\nEvery other day, there’s a new Layer 1 that is doubted as the “Ethereum killer”, but Ethereum doesn’t know it, so it remains undeterred, focusing on its growth and improvement.\n\n\n\n\n\nThis commitment to progress is evident in the recently unveiled Ethereum roadmap for 2024, spotlighting key developments that promise to enhance scalability and user experience.\n\n\n\n\n\n\n\n\n\nAmong those, finally, a date was set for EIP-4844, which will make it much easier for Layer 2 to publish data on Ethereum.\n\n\n\n\n\nWhile competition becomes fierce, these new ERC and EIP are set to greatly improve Ethereum's scalability and user experience.\n\n\n\n\n\nLet's dive into these exciting updates, including ERC-4337, EIP-4844, EIP-3074, and EIP-5003.\n\nERC-4337: Revolutionizing Smart Contract Wallets\n\n\n\n\n\nThe introduction of the ERC-4337 standard is a significant leap in the evolution of smart contract wallets.\n\n\n\n\n\nThis improvement introduces a novel concept called \"account abstraction.\"\n\n\n\n\n\nERC-4337 is an Account Abstraction proposal that completely avoids the need for consensus-layer protocol changes. Instead of adding new protocol features and changing the bottom-layer transaction type, this proposal introduces a higher-layer pseudo-transaction object called a UserOperation.\n\n\n\n\n\nMore on ERC-4337: https://twitter.com/johnrising_/status/1629470535397539840\n\n\n\n\n\nTraditionally, Ethereum accounts are separated into externally owned accounts (EOAs) and smart contract accounts. However, user-operated EOAs often pose challenges in terms of usability and security.\n\n\n\n\n\nERC-4337 blurs these lines, allowing users to interact with smart contracts more intuitively.\n\n\n\n\n\n\n\n\n\nThe way users interact with Ethereum needs to step up to the enhanced complexity of the landscape. We have already seen the emergence of Account abstraction-based solutions, such as Creso Wallet and Avocado Wallet.\n\n\n\n\n\nThe introduction of ERC-4337 will pose the foundation for a series of improvements to wallet designs, as well as reduced complexity for end users.\n\n\n\n\n\nAmong other things, ERC-4337 greatly improves the end-user experience as well as enables new possibilities such as gasless transactions or social logins and password recovery.\n\nKey Features of ERC-4337 Include:\n\nEnhanced Security: By integrating more complex logic into wallets, users can set conditions for transactions, like multi-factor authentication or daily spending limits.\n\n\n\n\n\nUser-Friendly: It simplifies interactions for non-technical users, making the Ethereum ecosystem more accessible.\n\n\n\n\n\nGas Fee Payments in Tokens: Users could potentially pay transaction fees in tokens other than ETH, adding a layer of convenience.\n\nEIP-4844: Boosting Layer 2 Efficiency\n\n\n\n\n\n\n\n\n\nWhy EIP-4844: To create a cheap place for L2 solutions to post data on Ethereum and reduce overall transaction fees users pay on L2 by a lot.\n\n\n\n\n\nProblem: L2s produce an increasing amount of data. If there’s a way to post that data cheaply, this will immediately reduce how much the networks charge users to transact.\n\n\n\n\n\nSolution: New transaction format for “blob-carrying transactions”. It contains a large amount of data that “cannot be accessed by EVM execution, but whose commitment can be accessed.” Instead of embedding the full contents in the body, the contents of the blobs are propagated separately, as a “sidecar.”\n\n\n\n\n\nEIP-4844, often referred to as \"proto-danksharding\" is a significant stride towards solving Ethereum's scalability issues. It introduces a new transaction type that allows \"shard blobs\" – temporary data that can be used by Layer 2 solutions like rollups.\n\n\n\n\n\nEIP-4844 introduces a new kind of transaction type to Ethereum which accepts \"blobs\" of data to be persisted in the beacon node for a short period.\n\n\n\n\n\n\n\n\n\nInstead of containing transactions being executed in the Ethereum blocks, shard blocks would just contain “blobs of data” and would be the responsibility of L2 to use that data space to create a secure and more scalable experience for their users.\n\n\n\n\n\n\n\n\n\nWhat is important about EIP-4844 is that its value will trickle down to users, as we will all be able to benefit from lower L2 fees.\n\nWhy Will L2s Fees Be Lower?\n\nEIP-4844 separates fees for transaction computation and storage.\n\n\n\n\n\nL2 will use a different function to submit “blobs” to Ethereum.\n\n\n\n\n\nInstead of using “CALLDATA”, which stores data forever, they would use blobs, which are pruned after a pre-defined period.\n\n\n\n\n\nThe blobs of data don’t have to be available forever, but for a certain period (e.g., 1-3 months), long enough to allow L2s to ensure at least 1 honest actor to reconstruct the state and challenge or replace the bad sequencer. The data gets then pruned.\n\n\n\n\n\nEIP-4844 provides significant scaling relief for rollups by allowing them to initially scale to 0.25 MB per slot, with a separate fee market for blobs allowing fees to be very low.\n\n\n\n\n\nRead: transactions will be 10x cheaper.\n\n\n\n\n\nThe Potential Impacts of EIP-4844 Include\n\n\n\n\n\nReduced Costs for Layer 2: By lowering the data costs, it makes Layer 2 solutions more economical, encouraging broader adoption.\n\n\n\n\n\nIncreased Transaction Throughput: This can lead to a more scalable network, capable of handling more transactions per second.\n\n\n\n\n\nEnhanced User Experience: With faster and cheaper transactions, the overall user experience on Ethereum improves dramatically.\n\n\n\n\n\nI wrote an extensive article on this a while ago:\n\n\n\n\n\nEIP-3074: Streamlining Transactions\n\n\n\n\n\n\n\n\n\nThe EIP-3074 is a new primitive, that will open the doors for more seamless UX on Ethereum, without the need for additional trust assumptions.\n\n\n\n\n\nEIP-3074 introduces a fundamental change in how Ethereum transactions are authorized and executed. The proposal allows a user to authorize a third party to execute transactions on their behalf, using a new type of operation.\n\n\n\n\n\nEIP-3074 aims to update Ethereum’s EOAs so they can delegate control to smart contracts — allowing smart contracts to approve transactions originating from user accounts.\n\n\n\n\n\nIn practice, EIP-3074 would allow the execution of complex operations with a single signature, with no need for multiple approvals, greatly improving the UX as well as allowing the execution of complex operations seamlessly.\n\n\n\n\n\nEnd users will be able to send batched transactions, expiring transactions, and more.\n\n\n\n\n\nMore on EIP-3074: https://twitter.com/lightclients/status/1371911245561917441\n\n\n\n\n\n\n\n\n\nHowever, for this to work, the Ethereum protocol would need to be modified, with two new EVM “opcodes”: AUTH and AUTHCALL.\n\n\n\n\n\nFor this reason, EIP-3074 is usually viewed less favorably compared to other Account Abstraction proposals, such as EIP-4337.\n\n\n\n\n\nRead more on the concerns about this EIP:\n\nhttps://twitter.com/scupytrooples/status/1418441829314220032\n\n\n\n\n\nNonetheless, EIP-3074 would introduce new use cases, such as:\n\nSmart Contract wallets: with wallet recovery solutions you will never lose your funds again.\n\nBatch Transactions: saving on gas costs.\n\nAutomations: automate transactions thanks to smart contract accounts.\n\nThe Benefits of EIP-3074 Include:\n\nSimplified User Interactions: Especially beneficial for complex DApp interactions, reducing the steps and gas costs for users.\n\n\n\n\n\nIncreased Flexibility for Developers: This allows for more creative and efficient smart contract designs.\n\n\n\n\n\nPotential Security Enhancements: Though it introduces new security considerations, it also offers the opportunity for more robust security mechanisms.\n\n\n\n\n\nEIP-5003: Network Resource Optimization\n\n\n\n\n\nThis proposal combines very well with EIP-3074, which provides the “opcodes” to delegate EAOs signing authority to a smart contract.\n\n\n\n\n\nWhile EIP-3074 authorizes smart contracts, EIP-5003 completely migrates the signing key of Ethereum EOAs accounts to smart contract accounts.\n\n\n\n\n\n\n\n\n\nA limited application of only EIP-3074 would create new vectors of attacks around the authority delegation to smart contracts.\n\n\n\n\n\n\n\n\n\nWhile EIP-5003 is less publicized, it plays a crucial role in enhancing the Ethereum network's efficiency and security.\n\nThe Expected Advantages of EIP-5003 Are:\n\nImproved Security: This EIP combines with EIP-3074 to solve its shortcomings and ensure there are no new vectors of attack from the Account Abstraction’s migration.\n\n\n\n\n\nMigration away from EOAs: This EIP is the final migration away from EOAs.\n\nConclusion: A Future-Proof Ethereum\n\nWhile its development is often considered to be slow and controlled to prioritize security, Ethereum does not stay idle, and it would be incorrect to observe and assess its technology only according to what it looks like at every specific moment in time, for it is always evolving and improving.\n\n\n\n\n\nIn particular, Ethereum's 2024 roadmap illustrates a clear vision for the future, and a commitment to addressing critical areas like scalability, security, accessibility, and usability and making sure the network remains future-proof.\n\n\n\n\n\nA strong focus is placed on redefining how users interact with Ethereum, shifting from EOA accounts to more flexible smart contract wallets.\n\n\n\n\n\nThe implementation of ERC-4337, EIP-4844, EIP-3074, and EIP-5003, each plays a pivotal role in this evolutionary journey:\n\n\n\n\n\nERC-4337 revolutionizes smart contract wallets through account abstraction, offering enhanced security and user-friendliness. This standard is poised to significantly simplify the user experience and broaden accessibility to the Ethereum ecosystem.\n\nEIP-4844, or \"proto-danksharding\" is a breakthrough in reducing costs and enhancing the efficiency of Layer 2 solutions. By introducing a new transaction format for blob-carrying transactions, it promises to lower transaction fees and increase throughput, benefiting the end users with more affordable and faster transactions.\n\nEIP-3074 and EIP-5003 together represent a significant step in streamlining transactions and optimizing network resources. While EIP-3074 introduces new operational capabilities for authorizing transactions, EIP-5003 complements it by transitioning signing authority from Externally Owned Accounts (EOAs) to smart contract accounts, bolstering network security and efficiency.\n\n\n\n\n\nAs Ethereum continues to innovate and improve, it will continue to fight for its relevance in the face of heightened competition.\n\n\n\n\n\nThe main purpose of this piece is to incentivize readers to look at Ethereum not as a static network but as a network in constant development and evolution, actively working to become future-proof against emerging technologies and alternatives.\n\n\n\n\n\nWe’ll continue monitoring the implementation of EIP and how Ethereum will evolve over the year.\n\nThe author of this post is not associated with the projects mentioned in this article in any way. All of the content above is not financial advice, and you are always encouraged to do your own research.\n\nAlso published here"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxNVzNzNURQZS1BLWx1WWlNZnY4NUVoZEY2VWtBMFhRSmh2b2pIdy1FaWl6Y3dIajR4bjYxNjdlcE9lMnhxV2d3VUZScE5teV9LUWY4dmY2NmRpZUR5dDhsNTB6Y29uQUREOHREWDNkVjEwWllzZEJ1ZWVzaGF4djlDaFRoS2RTajAzSGxCWUs3MEpOYV9RQV92c2N3d3haSU5s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 12 Mar 2024 07:00:00 GMT",
        "title": "Why EigenLayer May Be the Most Innovative New Ecosystem Since Ethereum - Unchained",
        "content": "Episode 618\n\nListen to the episode on Apple Podcasts, Spotify, Fountain, Overcast, Podcast Addict, Pocket Casts, Pandora, Castbox, Google Podcasts, Amazon Music, or on your favorite podcast platform.\n\nSreeram Kannan, founder of EigenLayer, and Olaf Carlson-Wee, founder and CIO of Polychain Capital, an investor in EigenLayer, say that the developer ecosystem around EigenLayer is sprouting up very fast, which reminds Carlson-Wee of the developer excitement in Ethereum’s early days.\n\nThey discuss the potential of EigenLayer, which uses a restaking mechanism to allow ETH stakers to reallocate their staked ETH and Liquid Staking Tokens (LSTs) to bolster security for other protocols. They cover how it could turbocharge Ethereum’s rollup scaling roadmap and enable Ethereum to become a stack of decentralized software as a service providers. Additionally, they discuss the potential risks associated with restaking as well as how EigenLayer could work with AI.\n\nRead more: What Is EigenLayer? A Guide to the Decentralized ETH Restaking Protocol\n\nShow highlights:\n\nSreeram’s explanation of what EigenLayer is and what it allows on Ethereum\n\nwhy Polychain invested in EigenLayer’s seed round\n\nwhy Sreeram believes that there are not just going to be three modules in blockchains, but thousands\n\nthe types of applications that can be built with actively validated services, according to Sreeram\n\nwhy they both believe that EigenLayer will improve smart contracts\n\nwhether EigenLayer will help solve the liquidity fragmentation issue in Layer 2s\n\nwhat Ethereum inclusion guarantees are and why they are important\n\nthe potential risks of EigenLayer and why Olaf doesn’t agree that EigenLayer results in rehypothecation\n\nhow attribution claims work in EigenLayer, allowing for “elastic scaling of security”\n\nEigenLayer’s points program and the likelihood of a token\n\nwhy Sreeram believes that an EigenLayer governance token wouldn’t have the same issues as Lido’s LDO\n\nwhether EigenLayer should be a core part of the Ethereum protocol itself\n\nhow AI and EigenLayer intersect and how to have permissionless innovation in the AI space\n\nThank you to our sponsors!\n\nGuest:\n\nLinks\n\nEigenLayer\n\nPoints"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE94cDFpd2VkRlc5d0ZqbG44a01wZGhDdnAxSm4wSWdSVmhCYnZPS3BVMTZSWV9NRkdnYTlhV1QtTjd4TG1kYXlaUlRfcVlUNjh4b2JFaTZmNmJVZFRQdHh3NkV3dGk1V0gtbzFGQ0xPVDlJZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Mar 2024 07:00:00 GMT",
        "title": "Ethereum Hits $4,000: How High Can ETH Go? - Watcher Guru",
        "content": "With Bitcoin surging above $71,000 for the first time, altcoins like Ethereum have embarked on renewed waves of recovery so far in March 2024. Amidst this bull run, ETH prices tapped new yearly highs, feeding optimism around the crypto’s outlook. The big question now is: just how high can Ethereum trend in the months ahead?\n\nAnalysis of price charts reveals Ethereum, with its $479 billion market cap, has surged past the $4,000 level for the first time in two years. A 75% increase in trading volumes to $22 billion supports this signal of strengthening upside momentum.\n\nAfter logging 15% gains last week, ETH has rallied 60% across the past 30 days. Ethereum has notched a bullish milestone that hints at a trend reversal.\n\nAlso read: Cryptocurrency: Top 3 Coins To Buy Under $10 For Better Gains\n\nCan Ethereum hit $5,000 next?\n\nIf Ethereum’s price is able to sustain support around the $4,000 area in the coming weeks, some analysts estimate the next likely upside target could be around $6,835 based on the 1.618 Fibonacci extension level.\n\nThis would represent the next key price milestone if the current bullish momentum is maintained. However, prices could also consolidate or correct before any potential further upside.\n\nEthereum hit its all-time high of $4,891 on November 16, 2021. However, the second-largest cryptocurrency is just 18% away from breaching its previous all-time highs.\n\nAlso read: Shiba Inu (SHIB) Forecasted To Surge 540% & Hit New ATH: Here’s When\n\nOf course, if existing market conditions deteriorate again, Ethereum may see a downside. However, indicators presently favor the ongoing bullish structure persisting through February.\n\nSo, with ETH firmly back in recovery mode, early technical clues support the growing narrative of history repeating itself this cycle. If Bitcoin manages to sustain the $71,000 level, ETH and other altcoins could stage a bullish outlook in the coming days."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxPTHpGbmhmMk1Cc3NmR2RER2RzeDJ5YVZFYTNnSGxjOS1OTWd3NVU3RnpLV1dNZDdEUDM4RkV5RGtVZHM2TkxwUG52X1hQLTJoMTcyWkNvYUl6T1JrU293Rk9TU195dHJ3NWJYVlZWZFhxT25KNkYtZU9GbmM4VHB6N1UtbHdRR0RkTVd2OU1QU0ZtRVlsaVE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 12 Mar 2024 07:00:00 GMT",
        "title": "Gnosis Chain Activates Dencun Hard Fork for Ethereum - Crypto Times",
        "content": "Gnosis Chain, a proof-of-stake blockchain mirroring Ethereum, has successfully activated the Dencun hard fork, which aims to reduce transaction costs on Ethereum. At approximately 2:30 pm ET, the fork went live, introducing a dedicated data storage channel called blobs to enhance scaling on layer-2 networks.\n\nThe Dencun upgrade focuses on improving Ethereum’s scalability by facilitating cheaper transactions on rollups, which leverage Ethereum for data availability. Ethereum core developers confirmed no errors were reported after the fork, and the chain is now finalizing with blobs.\n\nMartin Koeppelmann, Gnosis co-founder, stated that while rollups might not achieve sub-cent transaction fees, the Dencun hard fork on Gnosis Chain serves as a horizontal scaling solution complementing layer-2s. “We still think we need more, so we have Gnosis Chain as our horizontal scaling similar to Ethereum, and now we also do layer-2s on top of Gnosis Chain,” Koeppelmann said.\n\nPhillippe Schommers, Gnosis’ infrastructure director, emphasized the chain’s compatibility with Ethereum. “We really want to stay exactly like Ethereum so that an application developed for Ethereum can come to Gnosis Chain seamlessly,” Schommers stated.\n\nOne of the first applications leveraging layer-2s on Gnosis Chain will be Gnosis Pay, a payments network currently operating on the base layer but set to migrate to layer-2s for regulatory submission."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxOaTl2SDBWQkI3X2phSEEwT085UDFqWS1mbXJKdGRON0pJMk9sYTlCNWJQMVN6SkFtaS1jdmZiRmpGYkJpcFJuTnE2eXF5V2xESDNEOEY4VjYzQVEycnVMczhqUkJkQmIyUmp0N21qQmFFWXlmb2hWN2lZOEEyLTNVb1R0QW1wbkxrc3c5eNIBkgFBVV95cUxOUnhqSVJMd1Fwb2FRUU9DeWlFSjBmaTRiOTVlcmZqaF9SZ2Y3dTB1M1UxaUQzVGN6LTRHaTQydU9wNlYtSjFmQklkbUtrUjU4R2VBeVN3aTl4U1R4cVJiNjVZRlNXZFdEajl0dlN3LVgybEEtbkxoemNVWmVYX1JCc1l3T3VkdHdwTHB0czlJeHBpZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Mar 2024 07:00:00 GMT",
        "title": "Comparison Between Solana and Ethereum - ForexLive",
        "content": "When evaluating the blockchain space, two platforms frequently come up for comparison: Solana and Ethereum. Both have garnered significant attention, each with its own set of strengths that appeal to different users and developers in the cryptocurrency ecosystem.\n\nPerformance and Transaction Speed\n\nOne of the most notable differences between Solana and Ethereum is in terms of performance, particularly transaction speed. Solana has made a name for itself with its high throughput capacity, being able to handle about 65,000 transactions per second (TPS), while Ethereum currently processes roughly 30 TPS. This stark contrast is due to Solana’s unique consensus mechanism known as Proof of History (PoH), combined with the Proof of Stake (PoS) model, which allows for quicker validation of transactions and blocks.\n\nEthereum, on the other hand, is transitioning from Proof of Work (PoW) to a PoS system through its Ethereum 2.0 update, aiming to increase its transaction speed and reduce energy consumption. However, until this transition is complete, Solana takes the lead in performance.\n\nScalability\n\nScalability is another crucial factor in the comparison. Solana's architecture gives it a significant scalability edge, allowing for the support of thousands of nodes without sacrificing speed. Ethereum, with its current architecture, faces challenges in scaling, although layer two solutions like Optimism and Arbitrum are providing off-chain scaling options. The shift to Ethereum 2.0 also promises to address these concerns by introducing sharding, which will spread the network load across 64 new chains.\n\nCost\n\nTransaction costs are vastly different on Solana compared to Ethereum. Solana boasts extremely low transaction fees due to its efficient processing capabilities. Ethereum's fees, however, can vary widely and tend to be much higher, especially during periods of network congestion. This aspect makes Solana more attractive for microtransactions and decentralized applications (dApps) requiring a large number of transactions.\n\nDecentralization and Security\n\nEthereum is widely recognized for its level of decentralization and security, having a large and diversified network of nodes. While Solana’s architecture has led to a smaller node count, its newer network hasn't yet faced the same level of scrutiny or attack as Ethereum. Thus, Ethereum might be seen as more secure and decentralized at this moment.\n\nEcosystem and Adoption\n\nEthereum has a first-mover advantage, being the pioneer for smart contracts and dApps. It has an enormous and thriving ecosystem with a multitude of dApps, tokens, and decentralized finance (DeFi) applications. Solana is newer but growing quickly, developing its ecosystem and attracting developers with its performance benefits.\n\nConclusion\n\nWhether Solana is \"better\" than Ethereum depends largely on what metric you're measuring. If transaction speed and cost are your primary concerns, Solana may appear to be the superior platform. If decentralization, security, and ecosystem maturity are more important, Ethereum might be the preferred choice. Ultimately, the \"better\" platform will depend on the specific needs of the users and developers, and the continuous evolution of both platforms keeps this as an ongoing conversation in the blockchain community."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxPdWlzWlhnTnRUWWdMZ1JLMGhBYnNTY2drM0pxNU85OUVWSFpaODNpT0l3VkU4cmRmWnpKdDB5cExEZzJaUWJfNGVVZjdrMjN2QlFmQUstNjZvd3ItamVtTkU3c0RCYTRKQXczSXJZQmthYUs2dlFacnNpWTBxbkx5NFYwdFNpbVNZRDNtY0x2TW1PZnZVU29HeGd5MnppZnVaTGZ5Yw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 12 Mar 2024 07:00:00 GMT",
        "title": "Ethereum’s Dencun upgrade will make DeFi a lot cheaper to use - DLNews",
        "content": "A version of this story appeared in our The Decentralised newsletter on March 12. Sign up here.\n\nGM, Tim here.\n\nHere’s what caught my DeFi-eye recently:\n\nLower Ethereum transaction fees are almost here.\n\nMakerDAO ups borrowing rates to over 15%.\n\nJito takes steps to stop Solana MEV bots.\n\nDencun to lower Ethereum layer 2 fees\n\nIt’s about to get a lot cheaper to transact on Ethereum thanks to a new upgrade set to go live this week.\n\nCancun-Deneb, or “Dencun” for short, contains nine different EIPs, or Ethereum Improvement Proposals.\n\nAmong them, EIP-4844 is the most highly anticipated. It promises to dramatically cut the costs of interacting on layer 2 blockchains like Arbitrum and Optimism.\n\nLayer 2 fees will drop by a factor of 10 after the upgrade. That means swapping tokens on decentralised exchanges, which currently costs $1-2, should fall to around 20 cents, and could even go as low as a single cent on some layer 2 networks like Base.\n\nEIP-4844 will not, however, lower transaction costs on the Ethereum mainnet.\n\nJoin the community to get our latest stories and updates\n\nBy reducing transaction fees, Dencun may also unlock new use cases, such as onchain gaming, generative art, and artificial intelligence, which were previously not practical due to high transaction costs.\n\nEIP-4844 ushers in Ethereum’s “Surge” phase, as Ethereum co-founder Vitalik Buterin specified in his updated network roadmap in December.\n\nThe end goal during this phase is to hit 100,000 transactions per second.\n\nAfter Dencun, Ethereum developers can start looking towards other improvements, such as letting users run Ethereum nodes on mobile phones.\n\nMakerDAO almost runs out of USDC\n\nCrypto cooperative MakerDAO is making urgent changes to its borrowing rates after the protocol’s peg-stability mechanism, or PSM, almost ran out of funds last week.\n\nThe PSM lets holders of MakerDAO’s DAI stablecoin redeem it for $1 worth of other stablecoins, most prominently Circle’s USDC. The PSM’s main function is helping to keep DAI pegged to a dollar.\n\nBecause Maker offered low borrowing rates compared to the market, DeFi users locked up assets like Ether and Wrapped Bitcoin to borrow DAI. But due to Maker locking the yield on DAI at 5%, borrowers exchanged it for USDC through the PSM, which they could use to earn much higher yields in other protocols.\n\nIn response, MakerDAO pushed through a proposal to increase lending and borrowing rates for DAI to bring them inline with the broader market.\n\nIn ~2 hours, @MakerDAO will implement some unprecedented rates moves. There’s been some confusion about the cause, reasoning behind, and likely effect of these changes. Let’s go through them (in that order) 1/n pic.twitter.com/FdNvbNCJ4P — PaperImperium (@ImperiumPaper) March 10, 2024\n\nIn ~2 hours, @MakerDAO will implement some unprecedented rates moves. There’s been some confusion about the cause, reasoning behind, and likely effect of these changes. Let’s go through them (in that order) 1/n pic.twitter.com/FdNvbNCJ4P — PaperImperium (@ImperiumPaper) March 10, 2024\n\nAccording to PaperImperium, a MakerDAO community member and governance liaison for GFX Labs, the higher rates will encourage borrowers to repay their loans, preferably by swapping USDC to get the DAI for repayment.\n\nHigher yields on DAI should also encourage DeFi users to move funds into DAI, hopefully using the PSM.\n\nJito suspends mempool after MEV bots fleece memecoin traders\n\nJito Labs, a company creating Solana staking and MEV software, has just suspended its mempool — a waiting room for transactions before they are added to a blockchain.\n\nJito Labs has decided to suspend the mempool offered through the Jito Block Engine due to negative externalities impacting users on Solana.\n\n\n\nThe decision has been made after deliberate conversations with the Jito Labs team and key Solana ecosystem stakeholders. — Jito Labs (@jito_labs) March 8, 2024\n\nJito Labs has decided to suspend the mempool offered through the Jito Block Engine due to negative externalities impacting users on Solana.\n\n\n\nThe decision has been made after deliberate conversations with the Jito Labs team and key Solana ecosystem stakeholders. — Jito Labs (@jito_labs) March 8, 2024\n\nJito Labs said in an X post that it had made the decision due to “negative externalities” impacting users on Solana.\n\nThe move makes it more difficult for those running MEV bots to hit unsuspecting traders with sandwich attacks — placing transactions before and after a trade in order to extract value from price movements.\n\nSandwich attacks cost traders millions every year. They make it so traders get worse prices on their trades than they otherwise would. The effect of sandwich attacks is much more prominent in assets with low liquidity, such as memecoins.\n\nMemecoin trading volume on Solana soared last week, hitting $2 billion in 24 hours.\n\nData of the week\n\nBlockchain data platform Metrika has created a dashboard to track Ethereum’s Dencun upgrade.\n\nIt allows users to monitor the upgrade as validators switch over to the new version of the network. It also provides an estimate of the time until the upgrade is set to take place.\n\n69% of Ethereum validators are running client versions that are ready for Dencun. (Metrika)\n\nThis week in DeFi governance\n\nVOTE: Aave to add GMX’s gmETH to its Arbitrum liquidity pool\n\nVOTE: Jupiter DAO concludes vote on LFG launchpad candidates\n\nVOTE: Arbitrum votes on new $4 million grants programme\n\nPost of the week\n\nEthereum co-founder Vitalik Buterin slaps back at an X user complaining about high transaction fees.\n\nThe big hard fork that will help a lot with that is coming in three days. pic.twitter.com/u00MsaeI6W — vitalik.eth (@VitalikButerin) March 10, 2024\n\nThe big hard fork that will help a lot with that is coming in three days. pic.twitter.com/u00MsaeI6W — vitalik.eth (@VitalikButerin) March 10, 2024\n\nWhat we’re watching\n\nUSDC market on Compound v3 is 99.82% utilized and only has $5M in liquidity, and offers 30% APR\n\n\n\nWill we see failed withdrawals soon? pic.twitter.com/jUTF8uxYRA — Mustafa Al-Bassam (@musalbas) March 11, 2024\n\nUSDC market on Compound v3 is 99.82% utilized and only has $5M in liquidity, and offers 30% APR\n\n\n\nWill we see failed withdrawals soon? pic.twitter.com/jUTF8uxYRA — Mustafa Al-Bassam (@musalbas) March 11, 2024\n\nDemand for US dollar leverage in DeFi is surging.\n\nLending protocol Compound’s $478 million USDC pool is over 99% utilized — meaning borrowers have taken out USDC loans close to the total amount available.\n\nGot a tip about DeFi? Reach out at tim@dlnews.com."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMi7AFBVV95cUxPVWk3T0ZYd1FTdVR3YkFwam1lX0VWcHd1RHloX3VJYTBpcWpUaW9CWjd5MWFNV1RFQnBVYUM2NVNaZUhOUzBEZWkwN3ZLekpxZHdOQnFGRVl1ajRuWUZaZFlzTXJNbThVSEhCTFh4SC1wRmZPNlVHazRQX081QWNuWllYX214XzF6cTJWVXpQamN1VzNrbGdXYWJhejk5OGNzaUdhUjRIY3oyM1o0djNwazZWdUZpdE1QZ2xCOWdqdkpPZjJlME9CalZBb1Q4RFpPNEYzUU8zTFFHVk55SGItNG9ZZnl1R2JnbGk1MdIB8gFBVV95cUxOakF1Y3NJS2VUeHU3UGR6Yzc0UTJ3UmFzTVNhcnUyUWpwdzBtWjZuU1Rmd0R5bENCeFRpdU16ckcxWVNoRXBlVi1CVTNTOV91YWpRSnFiSkxkWWJsY1F3VlYzSlpuR3cxOGFqUjdnWnI1WGJZeEtnX1h6TUtLX01jTGF4aW4yMXVmU1ZlV2hIeENzOVpHeGZ3blZGOURRc3JjU0J4ZlBCekJBXzdXV0V4eTY1VGxsUUJHRzdqV0wtYnN3MkpwckYtc2JHUU91REExWkNyS0hJcXBTRDM2dXl3MTN4QXZ0U1h2eEVpS3hTOG9CZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 12 Mar 2024 07:00:00 GMT",
        "title": "These cryptos bleed ahead of Ethereum Dencun upgrade - FXStreet",
        "content": "Whales have shed their Ethereum Layer 2 token holdings ahead of the Dencun Hard Fork scheduled for Wednesday.\n\nMATIC, IMX, OP, ARB and MNT prices decline on Tuesday while Ethereum price sustains above $4,000.\n\nEthereum Layer 2 tokens could offer a “buy the dip” opportunity ahead of Dencun upgrade, which will lower transaction costs.\n\nPrices of Ethereum Layer 2 tokens are declining sharply on Tuesday, ahead of Ethereum’s Dencun Upgrade lined up for Wednesday. The upgrade is expected to reduce the transaction cost for Layer 2 tokens that scale the Ethereum network.\n\nPolygon (MATIC), ImmutableX (IMX), Optimism (OP), Arbitrum (ARB) and Mantle (MNT) prices dropped between 3% and 5% on the day..\n\nAlso read: Ethereum price unlikely to be moved by SEC ETF decision as approval odds diminish, analysts say\n\nLayer 2 tokens bleed\n\nEthereum is facing criticism from crypto experts for its upcoming upgrade as it focuses on reducing transaction costs for Layer 2 solutions and not the underlying blockchain.\n\nJustin Bons, Founder and CEO of CyberCapital, argues that Ethereum is now “fully committed to mediocrity.” Bons said in a recent tweet on X that the Layer 1 chain has zero plans to scale its underlying blockchain and Ethereum is pushing users to Layer 2 chains instead. The Dencun upgrade has indeed divided the ETH community into supporters and critics.\n\nETH is now fully committed to mediocrity\n\n\n\nWith ZERO L1 scaling plans! Fees will remain high far into the foreseeable future\n\n\n\nThey gave up on sharding & they are not even trying to parallelize the EVM\n\n\n\nFeats competing L1s have accomplished, while ETH pushes users to L2s instead! — Justin Bons (@Justin_Bons) March 12, 2024\n\nThe Dencun upgrade is a day away and L2 tokens have noted a sharp decline in their prices.\n\nThe drop could be considered a “buy the dip” opportunity for traders waiting to jump in on the narrative of L2 gains following the decline in transaction fees. MATIC, OP, and ARB prices declined 4% in the past 24 hours. IMX price dropped 5% on Binance and MNT yielded nearly 3% losses to holders in the past day.\n\nSome large wallet investors, popularly known as whales, are swapping their L2 tokens for stablecoins or other cryptocurrencies, on-chain data shows.\n\nSpotonchain tracked two large wallet investors’ which recently shed their L2 token holdings. The first wallet, identified as dForcenet, deposited 2.45 million ARB worth $5.05 million to Binance, and the second swapped 1.03 million ARB worth $2.13 million for USDC. Both transactions occurred on Tuesday, likely contributing to the overall decline in L2 token prices.\n\nEthereum price hit its 2024 high of $4,093 on Binance earlier today. The altcoin has experienced a pullback since then and is exchanging hands at $4,026, at the time of writing."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxQZlNDYUdQUDU0azg1WWxQQnkyNXZJZVM4UVhjQVBEUExSeDFsQkx4dy04WjM2R1RpNERJbkdsRWxxNk9nMEF3enpSNkFaOU1UcWJmV3V6RWxxRk0tUXdkdW5GalhXN0tfVm5sS0pRZFplN3lZQkZuM1d1RzJ5VnRaWW1qUnM1MjJtenVGaFdhczVfcVJRWHFRLVpBM3RYVTNWeWxqbzFXNFMzRXRTdXA3TFE3VmRyZHc1ODhlRl930gHDAUFVX3lxTE5NZ1hPbEpGWXFkVUtqMFE1Y3dhZl9RZTNBMlFCSG5zeGU3LVBfRDFUMVJjMUQ4MmpkeXZoaTJzcUdWQnhrdTNJaXR6N3hRbkJQa1JjMUdJMUluM1V0YUlVaUx1UG8tTGotY1NrWEFtM3Y1X0k4ZkNnZy1YU0VqazlkOXdDcVc5QTg1bzBncTVWVG5ZWld3TmNJZDVvNFZ4MXB0NjJrWmRFYnJKTjdtSGkzYUJaM2VQeEZSZXJKMk1HUXdGTQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 12 Mar 2024 07:00:00 GMT",
        "title": "Ethereum Layer-2 Skyrockets After Earning Surprise Support From Crypto Exchange Binance - The Daily Hodl",
        "content": "One Ethereum (ETH) layer-2 altcoin project is soaring after a sudden listing by Binance, the world’s largest crypto trading platform by volume.\n\nAs Binance announced on Monday spot trading support for ETH scaling solution Metis (METIS), the token rallied by double digits.\n\nSays Binance,\n\n“Binance will list Metis (METIS) and open trading for these spot trading pairs at 2024-03-11 12:00 (UTC). New Spot Trading Pairs: METIS/BTC, METIS/USDT, METIS/FDUSD and METIS/TRY.”\n\nMETIS aims to offer lower fees and faster transaction times than the leading smart contract platform Ethereum. The MetisLab Foundation project, which launched in 2021, uses optimistic roll-up technology to execute transactions outside of Ethereum’s blockchain while recording transactional data. Optimistic rollups automatically assume transactions are valid.\n\nBinance is listing METIS with an attached seed tag, which the exchange applies to lower-liquidity projects that may exhibit higher volatility compared to other listed tokens. Binance requires users who own assets with seed tags to pass quizzes every 90 days to ensure they’re aware of the risks before trading the tokens.\n\nAmid the Binance news, METIS rallied to a high of $147.87 on Monday, a more than 39% increase from Sunday’s low of $106.18. METIS retraced since and is trading for $137.28 at time of writing, still up 25% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxPcVZGczk1bXhMaEttUG81bElhdUNKU3NXMWYzc2V4cU9ZS0VlOTVHa255TUt2TDk2Q09qQTNSU2NaalBLaEdJdzlJQk1USExJUGRSRWx3NE1DZXhfc0UtVldranFWTmtKWXZhVXdqRUVVUnVQYm8zMzNBd2F6TG5RUEtoNDRIa3huZlQyWDJjVy0xbWV4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 12 Mar 2024 07:00:00 GMT",
        "title": "Ethereum Price Has Crossed 4,000 mark: Will ETH Hit All-time High? - CoinGape",
        "content": "Bitcoin crossed the $70,000 mark to hit an all-time high of $72,242.51 before retracing to its current price of $71,947. As BTC soared, Ethereum price also tagged along crossing the $4,000 mark, having grown by 60% in the past 30 days. The leading altcoin by capitalization achieved its all-time high of $4,891.70 on Nov 16, 2021. Now the price of ETH is only 18.03% away from this peak, will it meet the expectations of optimistic investors and enthusiasts and achieve this milestone?\n\nEthereum Price Market Performance\n\nadvertisement\n\nEthereum price is trading at $4,009 having decreased by 0.6% in the past day. However, it has experienced increasing investor activity demonstrated by the 2.18% increase in trading volume to reach $23.9 billion in the last 24 hours. Its market cap of $481.29 has positioned it on CoinMarketCap as the 2nd cryptocurrency in the market, with a circulating price of 120,093,479 ETH. The coin value has grown by 32% since it crossed the $3,000 mark on March 20, 2024, which is only 20 days ago.\n\nFactors That Could Drive Ethereum Prices Higher\n\nThere are various factors that would possibly propel Bitcoin price towards its all-time high.\n\n1. Ethereum Dencun Upgrade\n\nThe anticipation surrounding the upcoming Ethereum Dencun upgrade and the introduction of “proto-danksharding” has sparked a wave of excitement among investors and developers within the platform’s ecosystem. Scheduled to go live on March 13, this upgrade promises to reduce congestion and transaction fees significantly for Layer 2 platforms like Arbitrum and Optimism. The upgrade tackles major scalability hurdles making Ethereum more accessible to both users and developers.\n\nAdditionally, developments in Ethereum’s protocol are anticipated, where proto-danksharding will lead the way to full danksharding in future upgrades thereby enhancing its scalability potential even more. Secondly, the upgrade enhances Ethereum’s security through measures such as adding new EVM opcodes while phasing out obsolete ones making it more attractive and reliable. Through infrastructure and capability enhancements like Dencun, Ethereum is likely to attract greater investor interest, fueling a bullish sentiment that could propel Ethereum to new all-time highs.\n\n2. ETH Burning and Staking Initiatives\n\nDune’s data indicates that the amount of ETH locked in Ethereum’s proof-of-stake layer protocol is steadily decreasing the altcoin’s circulating supply. Presently, over 31.68 million ETH, worth $126 billion, is staked on the Beacon Chain. This accounts for approximately 26.4% of Ethereum’s circulating supply being staked and unavailable in the market, with more than 990,000 validators actively engaged.\n\nIn addition, the availability of liquid staking options like Lido has simplified the process of staking on the Ethereum network. Lido alone accounts for 31% of the overall staked Ether.\n\nFurthermore, recent data from ultrasound money reveals a substantial amount of ETH being burned in the last seven days, resulting in a reduction of Ether’s circulating supply by 49,931 ETH, equivalent to approximately $200 million. This burning mechanism serves to decrease the selling pressure on the price by reducing the available supply of ETH in circulation. Ethereum’s scarcity is amplified, driving up demand and potentially propelling its price to new heights.\n\n3. London Stock Exchange (LSE) plans\n\nThe London Stock Exchange (LSE) has announced that it will accept Bitcoins and Ethereum applications for Crypto exchange-traded notes (ETNs). ETNs are investment products that track Bitcoin and Ethereum’s value, allowing investors to trade similar to traditional stocks during regular trading hours.\n\nThe LSE has set up criteria for the ETNs including, the need to be physically backed and non-leveraged, meaning they have to have real assets backing them up, and they can’t involve borrowing to amplify returns. Plus, they must be backed by Ethereum and Bitcoin and have a publicly available market price or value measure.\n\nSince Financial Conduct Authority (FCA) is ready to support the creation of a market segment for these crypto-backed ETNs, the LSE’s move opens up a whole new avenue for investors to acquire exposure to Ethereum through regulated channels and sleep have openly complied due to legal concerns it may attract significant attention from institutional investors and traditional financial players Hesitate to enter the crypto-space\n\nThis move by the London Stock Exchange adds legitimacy and accessibility to Ethereum as an economic asset, increasing demand and potentially increasing its value in the long term.\n\n4. Ethereum exchange-traded funds (ETFs)\n\nAnother force driving the Ethereum price to soar is the upcoming possibility of the United States Securities and Exchange Commission (SEC) approving spot Ethereum exchange-traded funds (ETFs). Unlike Bitcoin ETFs, which faced a delay, spot Ethereum ETFs appear to be on a fast track to obtaining regulatory approval.\n\nThe successful deployment of spot Bitcoin ETFs since January 11 has set a precedent, indicating that a similar Ether-based product could attract substantial capital to ETH. This accelerated approval process for Ether ETFs has garnered significant attention from institutional investors, who may now look to diversify their holdings beyond Bitcoin. This shift in focus towards Ether ETFs could stabilize liquidity at higher price points and foster long-term price surges, further solidifying Ethereum’s position as a cornerstone of the cryptocurrency market.\n\nTechnical Analysis of ETH\n\nThe 50-day exponential moving average (EMA) suggests a robust buying sentiment, pointing towards a favorable trend in the short to medium run. Likewise, the 200-day EMA and SMA are both displaying an upward trend, signaling a positive long-term outlook for Ethereum’s price trajectory. Meanwhile MACD levels indicate the possibility of Ethereum price appreciation, traders should be wary of overbought conditions with the RSI (14) indicating 81.8.\n\nSupport amounts: $2546.6 and $1751.5\n\nResistance: $3829.2 and $4316.7\n\nThe attainment of $4,800 by Ethereum hinges upon a confluence of technical aspects, market dynamics, and overall market circumstances. In order to make prudent investment choices within the cryptocurrency market, traders and investors must diligently engage in comprehensive research, evaluate various sources of information, and effectively mitigate risks."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxQMENtRDdTNkE5R2ozQ3hCMlFGZnptTE96Rk45bXJWcThILW5ZYVU1eEQxZFd2d0QyQ0ljMXdIRHNGdlJvVlpvanNlcHNBc0p6Z1BwVS1rNTNmM1NNR241Yk1DdVRGd2k1QW93bWtRb1ZfRVIxZXdXMmNla1BLdEFlVXQxb1dwa291WkduVGtlWTk2Ym5MVnN3Wjk2SlU2MVhwZnJnd1ItSzRRZmhFVjhrOXoyX2t5TDJ0TDY4SThlUVlpcEhuVklZdmV3X1dZNlZPY3BIVQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 12 Mar 2024 07:00:00 GMT",
        "title": "'Solana Is The Ethereum Of The Last Cycle,' Says Raoul Pal: SOL Up 11% In A Week - Benzinga",
        "content": "Layer-1 blockchain Solana SOL/USD is up 11% over the past week, taking back the spotlight from meme coins and looking to build further bullish momentum.\n\nWhat Happened: \"Macro guru\" and Real Vision CEO Raoul Pal stated that \"crypto summer\" just started and is \"up only\" in his latest interview on the Rug Radio YouTube channel.\n\nHe described crypto summer as being in the middle of a strong uptrend, wherein you can get 30% pullbacks in the short term. Pal foresees 2024 as a crypto summer year:\n\n“This is the time when ETH outperforms Bitcoin, Solana outperforms ETH, a bunch of alts will outperform Solana… The big trade is now on.”\n\nSpecifically highlighting Solana, he predicts the token to peak at fresh all-time highs this market cycle, saying that “Solana is the Ethereum of the last cycle.”\n\nDepending on the upcoming crypto cycle, Solana is likely to witness a surge between 235% and 570% from current levels, Pal said.\n\nAlso Read: Bitcoin Rally Sparks Hope For Altcoins Revival Despite 72% Of Projects Dying Since 2020: 'BTC Increasing Lifts All Boats In A Way'\n\nWhy It Matters: The rise in Solana addresses and total value locked indicates rising adoption of the token and genuine user engagement on the network.\n\nThe surge in addresses comes amid a weekly 8% price rally, taking its monthly gains to 35%.\n\nZeta Markets Founder Tristan Frizza told The Block, “With Solana already recording more daily transactions than Ethereum, Arbitrum, Optimism, BNB Chain, Tron, and Avalanche combined, its ascent to a top three blockchain by market cap seems inevitable.”\n\nBased on The Block’s Data Dashboard, the number of daily active addresses on Solana has surged to 1.01 million as of March 11, compared to 779,080 addresses one week prior.\n\nAdditionally, the number of new addresses on the Solana network surged to 717,960 as of March 11, compared to 513,270 one week prior.\n\nSolana's value moved on-chain, daily, standing at $3.18 trillion as of March 10, compared to $1.13 trillion as of last week.\n\nWhile meme coins have been witnessing a rally for some weeks now, Layer-1 coins may be heating up to catch the market rally.\n\nRead Next: Dogecoin, Pepe, Shiba Inu Rally Raises Hopes For Impending Altcoin Season: '...Will Start Outperforming About The Time We Are Now'\n\nImage: Rcc_Btn/Shutterstock"
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPdnRtaDhYczNYVG9OMHJmb1FnOGNzczVvWFF5bl82dXdMWTVNY0RMalBlVVpsWllxRUpCaG9hRDFreFU4MnlnWkRUaEM1TjduWHgxOHkwV1IwZi15SThfNDRXMmxxRHVfb3ZhX0c0QWdHQnpCZEliUHpkRTJVM3JIMkVvNVMtTl9PdmpNZngxWnF1eVpfcUJuRA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 12 Mar 2024 07:00:00 GMT",
        "title": "Ethereum Unleashes Another Major Upgrade with the Dencun - Blockhead",
        "content": "Ethereum, the world's second-largest blockchain by market capitalization, is set to undergo another major upgrade on March 13, 2024. On this date, the highly anticipated Dencun upgrade goes live, ushering in a new era of functionality and, most importantly, scalability for the dominant smart contract platform.\n\n\"Dencun\" is a clever portmanteau of \"Deneb\" and \"Cancun,\" two separate upgrade proposals that have been meticulously combined to form a single, powerful update. Ethereum's dominance in the crypto space is undeniable. Its robust smart contract functionality has fueled the explosive growth of Decentralized Applications (dApps), revolutionizing everything from finance (DeFi) to gaming (NFTs). However, a dark cloud has loomed over Ethereum's success: scalability. Transaction fees have skyrocketed during periods of high network congestion, creating a major barrier to entry for new users and projects.\n\nThis is where Dencun comes in. This landmark upgrade represents a significant step forward in Ethereum's ongoing quest to address scalability woes and solidify its position as the premier platform for decentralized innovation.\n\nEthereum Improvement Proposals\n\nEthereum upgrades are usually built on the foundation of Ethereum Improvement Proposals (EIPs). EIPs outline potential new features or processes for Ethereum. They also contain technical standards and specifications for the proposed changes, acting as a credible source for the Ethereum community. These allow network upgrades to be discussed and developed through the EIP process.\n\nThe EIPs are similar to Bitcoin Improvement Proposals (BIPs), as they play a central role in how changes happen and are documented on Ethereum.\n\nThe earliest Ethereum upgrade was Byzantium in 2017 which reduced block rewards from 5 ETH to 3 ETH and implemented new smart contract functionalities.\n\nConstantinople and Istanbul upgrades followed in 2019. These introduced multiple EIPs that enhanced Ethereum’s efficiency, optimized transaction fees and made the network more supportive of Layer 2 chains.\n\nThe transition from proof-of-work (PoW) to proof-of-stake (PoS) was started with the launch of the Beacon Chain in 2020 and completed with the Merge in 2022. This allowed for staking of Ether, improving Ethereum’s environmental friendliness and reducing the issuance of ETH.\n\nA full history of all Ethereum upgrades can be seen here.\n\nThe Dencun Upgrade\n\nDencun comes with a series of technical improvements designed to optimize Ethereum's performance with added benefits for Layer 2 networks on the blockchain.\n\nThe central feature of the Dencun upgrade is the introduction of proto-danksharding, which is contained in EIP-4844. Proto-danksharding significantly reduces data storage costs for Layer 2 rollups.\n\nThis is accomplished through \"data blobs,\" which are holders for large amounts of data associated with Layer 2 transactions. The improvement that data blobs bring is that unlike traditional transactions, they are not executed on the main chain. Instead, they are stored briefly on the main chain with a data reference included in the transaction. Blobs are available for 18 days then dropped from the network. This decreases the computational burden on the main chain, potentially reducing the gas fees for L2 rollups.\n\nBefore Dencun, Layer 2 networks had to submit all transactions to the main chain in one chunk. This limited scalability as only a specific amount of data could be handled by the main chain. After the Dencun upgrade, L2 chains such as Arbitrum, Optimism, Base and others can use data blobs to slash transaction fees on their chain.\n\nBenefits for Ethereum Users & Traders\n\nThe Ethereum Dencun upgrade brings several benefits to users and traders alike. According to statistics from IntoTheBlock, the gas fees for DEX swaps are projected to reduce on Aribitrum from $2.02 to $0.4. On Optimism, fees are projected to reduce from $1.42 to $0.28, and on Base from $0.58 to $0.01.\n\nUsers will also benefit from improved scalability with proto-danksharding allowing the Ethereum blockchain to handle a significantly higher number of transactions per second, reducing congestion and improving overall performance.\n\nLayer 2 Blockchains like Optimism and Arbitrum will also see increased adoption with improved compatibility and performance, as more developers and users seek scalable alternatives to Ethereum's mainnet. Layer 2 solutions already complement Ethereum's mainnet by offering scalability without sacrificing security or decentralization. This synergy strengthens the overall Ethereum ecosystem and fosters innovation in decentralized finance (DeFi), gaming, and other dApp sectors.\n\nLayer 2 solutions also provide a flexible scaling solution that can dynamically adjust to network demand, ensuring smooth operation even during periods of high congestion on the Ethereum mainnet.\n\nImpact on Ethereum’s Price Action\n\nWith Ethereum breaking the $4,000 price barrier and the continued growth of Layer 2 solutions, demand for ETH is projected to grow.\n\nA look at the on-chart indicators highlight the sustained inflow of capital and strong buying pressure, as evidenced by the Chaikin Money Flow (CMF) and Relative Strength Index (RSI) readings. This could see ETH hit a new all-time high, following in Bitcoin’s (BTC) steps.\n\nETH/USDT on TradingView (Daily Timeframe)\n\nEthereum's Dencun upgrade represents another significant milestone in the blockchain's journey towards scalability, efficiency, and mass adoption. This upgrade will ensure Ethereum is poised to offer a better user experience while maintaining its position as a leading blockchain platform. Moreover, the enhanced compatibility with Layer 2 solutions like Optimism and Arbitrum opens up new possibilities for scalability and innovation, benefiting both Ethereum and the broader blockchain ecosystem. Buckle up, crypto world – the future of decentralized applications is about to get a whole lot brighter."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMizgFBVV95cUxQX3lUYmlDcE1WMXdYeDZzcmVWeEFkWkk0Z3Jva1ptQ3BibUI1ZzFZcGt2X0lRb0VWUXNNVkcwUXdDdW5MNmhRY0thdWVnbFBmUHcyQzlyY056NEliRHg1R1VJTndMbF9PdWRpZ1dJQlRBbG52TV94eFFiUHI4alJCZTZoT1h3ZVNvRGMwY3R2enlqd2dfbnMzWnI1NzdLbC1hNy16VGFPblNidGx3VE5FTEVoS0tBMG0xS05YLXB3VXRoX080TlhUNXp0b3RBQdIB0wFBVV95cUxOWFNHQVFyMG5uNklUWFdFX05RSWdiYnJnWUNJNjUxS3JPSXVJVGg1MWlucFVZT25maTZhVHFVN1RTVmU3MV9iekgtemRGNEVMYktaSi10aUZBZzNJbFA5V1oydE9Uc3RkNU1EMlRQeHFYZHVGcVZQb0ZFaTB6cG9LNlBqZ0szdmlWS3ZaVFVxV3ZpSV9lZGdYaVUzdGhIWVpvT2FpYWw4ekRlU28tQlFxTTBVRWZfMVVycmtLaGpwZ09NdDZWdmlOaFdpNHhYdDRkdGNF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Mar 2024 07:00:00 GMT",
        "title": "Rallies Incoming for Ethereum and One ETH Rival, According to Crypto Strategist – Here Are His Targets - The Daily Hodl",
        "content": "A closely followed crypto analyst believes that rallies are in store for two top smart contract platforms including Ethereum (ETH).\n\nPseudonymous analyst Loma tells his 301,200 followers on the social media platform X that he thinks Ethereum will likely continue its slow grind up.\n\nThe crypto strategist shares a chart suggesting that ETH will eventually return to all-time high at around $4,871.\n\n“Can steadily just trail stops under that $3,200 area. Price closes below $3,200 on any meaningful timeframe and maybe you can start calling tops.\n\nUntil then, it’s just a game of patience. Slow is smooth; smooth is fast.”\n\nAt time of writing, ETH is trading for $3,963, down about 1.33% in the last 24 hours.\n\nThe analyst is also keeping an eye on ETH rival Solana (SOL). Loma says he’s bullish on Solana and that dips are opportunities to accumulate SOL.\n\n“Any consolidations forming on lower timeframes around $140s (and maybe mid $130s) are good for compounding, in my opinion.\n\n$200 or the market is wrong.”\n\nAt time of writing, SOL is worth $143.52, down over 2% in the past day.\n\nAs for the broader crypto markets, Loma thinks that digital assets may go through a period of consolidation before witnessing the next leg up.\n\n“One month sideways cool-off period where people chop themselves to smithereens instead of slowly building out positions?”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMiZEFVX3lxTE9SS2ozWTBoZlZOSTNHWmNnejhwNE1pazMtaG9aVEZQeXY5bVRwX09URmpQeGwtZ0tiTWxDWnRrTUZjb3huS3B5bC04VE5iOGo4amVCeUFPNXNaLXlvNHltbFZYU0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Mar 2024 07:00:00 GMT",
        "title": "Ethereum Breaks Through $4,000 Again After More Than Two Years - Bitcoinsensus",
        "content": "Ethereum (ETH) has surpassed $4,000, reaching a new yearly high and marking a significant milestone in its recovery.\n\nThis price surge reignites interest in ETH and signals strong momentum within the broader crypto market.\n\nCatalysts like the upcoming Dencun upgrade, potentially reduced gas fees, and growing DeFi & NFT sectors drive ETH’s growth.\n\nThe world’s second-largest cryptocurrency, Ethereum, has finally made a triumphant comeback, breaking through the $4,000 barrier for the first time since late 2021. This surge in price occurred right alongside Bitcoin’s successful attempt at setting a new ATH at over $71k. ETH’s present price milestone underscores the leading altcoin’s resilience and further highlights the increasing optimism surrounding the crypto industry’s future.\n\nClaim up to $30,030 in Bonus 100x Leverage Start Trading\n\nThe recent climb of Ethereum’s price can be attritbuted to a number of different related factors. These include the upcoming Dencun upgrade, which promises significant improvements in the Ethereum network’s scalability and reduced transaction fees, and is expected to happen sooner rather than later. Ethereum also remains as the dominant platform for decentralized finance (DeFi) and NFTs, which have continued to thrive and keep growing up to now.\n\nKeeping Up with Bitcoin\n\nThe news of ETH’s $4,000 breakthrough coincides with BTC’s surge to an entirely new ATH price of more than $71,000. As Bitcoin spends more time trading sideways in the next few weeks or months, it is highly expected that altcoins like Ethereum will take over the narrative as part of the typical “altcoin season” that comes along with every recorded instance of increased institutional and retail interest.\n\nThe last time that ETH’s price was at the $4,000 level was back in late 2021, which is more than 24 months ago. Its return to this price level now is taken by some experts as a signal of bullish sentiment resurgence. At the same time, it can also be seen as reinforcement of the positive correlation between BTC’s price performance and the broader altcoin market.\n\nUnleash the potential of leverage trading! Join Bybit today with our link, complete KYC, and earn up to a $40 bonus on a $100 deposit. Don’t miss out on this exclusive offer; claim your bonus now!\n\nAs of this writing, ETH is pretty much in price discovery mode. Will it reach $5,000 any time soon? Well, the current momentum is strong, but it’s still absolutely crucial to remember the inherent volatility of crypto assets. The truth about the sustainability of ETH’s upward movement will likely be unraveled soon enough.\n\nEnhance Your Crypto Trading Skills With Our Legends’ Trading Masterclass\n\nEmpower your crypto trading skills with our Legends Masterclass. Sign up now and take advantage of our limited-time discount offer! Join the class today."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxPSGo1VVd3UGlmeVI3cF9vX3Q2Y3lkVk1jclJGd2VtYmd4UXlfdFlxT0JCZDJVYzV5bm5WcDJfelNhbjhSNXBhajJiNk9JbXgwWEdGU2VxNmtFSV84emRneDJMN0VudU1OQ3RBTXJYbDdNa0VBellpUWU4cjJPd1JIdDZvdHhPNFpUMDZDTVkxRHpzbDBid1d1azMxbVdjNTlIaGhlMHpDQUd2ZUxFZHZqNkp1azFZWjRjNTNEZUhydw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 12 Mar 2024 07:00:00 GMT",
        "title": "Ethereum Price Dips Attractive As Bulls Aim For Move Above $4,200 - TradingView",
        "content": "Ethereum price is consolidating near the $4,000 zone. ETH is again moving higher as the bulls seem to be aiming for a move above the $4,200 level.\n\nEthereum traded to a new multi-month high above $4,080 before correcting lower.\n\nThe price is trading above $4,000 and the 100-hourly Simple Moving Average.\n\nThere was a break above a key contracting triangle with resistance at $4,025 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could resume its increase if it clears the $4,085 resistance zone.\n\nEthereum Price Regains Strength\n\nEthereum price spiked above the $4,000 resistance zone, like Bitcoin. ETH traded to a new multi-month high above $4,050 before there was a downside correction.\n\nThe price declined below the $4,000 level, but the bulls were active near the $3,850 zone. A low was formed at $3,830 and the price is now rising. There was a move above the $4,000 resistance. The price cleared the 50% Fib retracement level of the recent decline from the $4,088 swing high to the $3,830 low.\n\nEthereum price is now trading above $4,000 and the 100-hourly Simple Moving Average. There was a break above a key contracting triangle with resistance at $4,025 on the hourly chart of ETH/USD.\n\nIt is now showing positive signs above the 76.4% Fib retracement level of the recent decline from the $4,088 swing high to the $3,830 low. If the pair stays above the $4,020 level, it could attempt another increase. Immediate resistance on the upside is near the $4,085 level.\n\nNewsBTC\n\nSource: ETHUSD on TradingView.com\n\nThe first major resistance is near the $4,120 level. The next major resistance is near $4,150, above which the price might gain bullish momentum. In the stated case, Ether could rally toward the $4,280 level. If there is a move above the $4,280 resistance, Ethereum could even rise toward the $4,350 resistance. Any more gains might call for a test of $4,500.\n\nAre Dips Limited In ETH?\n\nIf Ethereum fails to clear the $4,085 resistance, it could start a downside correction. Initial support on the downside is near the $4,020 level.\n\nThe first major support is near the $3,965 zone or 100 hourly SMA. The next key support could be the $3,880 zone. A clear move below the $3,880 support might send the price toward $3,830. Any more losses might send the price toward the $3,740 level.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is gaining momentum in the bullish zone.\n\nHourly RSI – The RSI for ETH/USD is now above the 50 level.\n\nMajor Support Level – $3,965\n\nMajor Resistance Level – $4,085"
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxPZUtrQ2JaYU42S0JwUzV3N09CQzhldzdveU43d29VZHJjN1o4XzJ3SjBlVHg3Wk1HdVpvYTdhdnFmUjl6S0JlSGhLRDlVTV9fZmpUUXREQk1Yc2FOYkx3Tk5QODEyMDJPdC1RYnZHU1h5WGlxT1VxU0xIT2I4eHpqSHFWd2lDMWxwVV9Cd1JOSEgwcDZOQl9yZG82VVFPbkk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Mar 2024 07:00:00 GMT",
        "title": "Unibot token slumps 40% amid schism between project’s Ethereum and Solana devs - DLNews",
        "content": "Unibot’s native token fell past $50 today.\n\nConflict has broken out between the popular Telegram bot’s Ethereum and Solana developers.\n\nBoth sides traded accusations of breach of trust.\n\nUnibot’s token fell more than 40% today as news emerged of infighting between its Ethereum and Solana developers of the popular Telegram trading bot with over $1.1 billion in volume.\n\nUnibot’s Ethereum developers said they had ended their collaboration with their Solana counterparts, accusing them of reneging on previous agreements.\n\nThe Solana group confirmed the split, announcing plans to rebrand from Unibot’s Ethereum team.\n\nUnibot is a Telegram trading bot on both Ethereum and Solana. It first emerged on the Ethereum mainnet last May, followed by a Solana deployment in January.\n\nUnibot users, especially those who use the Solana-based iteration, now find themselves in the lurch.\n\nToday’s split is the latest problem to rock Unibot, which was previously hacked for $5.6 million last year. These problems have contributed to the project falling further behind its major rival, Banana Gun bot.\n\nUnibot and Banana Gun bot belong to a class of projects that allow crypto users to trade tokens using only a few simple commands on Telegram.\n\nUnibot token slumps below $50 amid in-fighting between project teams\n\nTelegram bots have evolved into a crypto niche in their own right and boast a $1.6 billion market capitalisation, according to Coingecko.\n\nJoin the community to get our latest stories and updates\n\nApart from trading, several bots also share revenue with users, and some of them help traders automate airdrop farming activities.\n\nUnibot developers lance accusations\n\nThe Ethereum developers behind Unibot accused the Solana group of a breach of trust because the latter also launched a version of the bot on the Blast blockchain without its approval. Blast is a layer-two blockchain built by the same team behind the NFT marketplace Blur.\n\nUnibot’s Ethereum developers accused its Solana counterparts of refusing to undergo the KYC identification process, too.\n\nAs such, the Unibot Ethereum team demanded the Solana group change its name which is currently Unibot on Solana.\n\nFollowing the split, the Unibot Ethereum developers launched a Unisol X frontend for users on Solana as an alternative to the Unibot on Solana bot. They decided to launch a second front because they are no longer working with the Solana group.\n\nResponding to Unibot’s accusations, Reethmos, the pseudonymous Unibot on Solana builder, said the split would not affect its users.\n\nUnibot has earned over $53 million in revenue since inception. (whale_hunter/Dune)\n\nReethmos countered Unibot’s statement and accused the Ethereum developers of engineering the split because the Solana team blocked their access to the bot’s revenue.\n\n“They farmed $30 million from tax farming but apparently it wasn’t enough,” Reethmos said on X, formerly Twitter. Tax farming is the practice of levying fees on token swaps, and Unibot’s Ethereum developers earn 40% of the tax imposed on trading the token.\n\nUnibot generates revenue across all chains, which is shared among token holders. To qualify for the revenue share, holders must hold at least 10 Unibot tokens.\n\nOf the $53 million in cumulative revenue the bot has generated, $48.2 million has been realised on the Ethereum deployment.\n\nOsato Avan-Nomayo is our Nigeria-based DeFi correspondent. He covers DeFi and tech. To share tips or information about stories, please contact him at osato@dlnews.com."
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxQQVB2bXZ1d3ZSc0NPYjA1N2hhcmlFZ1lHNXNEMlVrWTlHTTVGX2FUX1JzdVBVR1g5TTg4RHNTNzdEY2Y5Yms0UmJuMEFPNVhDaDVKaEViLVZndFZENTc5X3pieXZCbkRNbjg1dkFDZ1JpLXhhcWNEdTlPREpfcnVCb2gteEVGRl9XdVFucExwTW5aSE1tU214V3ZkUXpxVGplS1BGTldDMkV1bVo3SHJtSXp2S0hyZkJGU1pXR3JJc2PSAcYBQVVfeXFMUFBOeDRNUTFIN19aVGdiak9pQUdfdkRoSU1BSFp5dl90LUQ0Yk9mMkNWZWlMMEtPQlZ4dnc5X2d4eFpoLWoyTmhTWkxkZjd4YXRQTUszWWw2T0VEWGZRSy1ucTlOajhsQ2EwbmI2bGFuZ2JmaDhYQzZ3QjVzNldOTkNpN1RWbGF6Q3UyMy1BUGFoVGl2bUszOEJaVllsSkJXWXgxeTFMQ0YxTklDb0REcUVjdTdZN3lGMEM3ZmNUN0FUOENOM2pR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 12 Mar 2024 07:00:00 GMT",
        "title": "Bitcoin and Ethereum back to 2021 levels: What’s next for crypto? - FXStreet",
        "content": "Bitcoin and Ethereum prices have cleared the $70,000 and $4,000 psychological levels, respectively.\n\nThis development has pushed the Fear and Greed index to extreme greed as the indicator points to 81.\n\nMajor altcoins seem to have stopped in time as they move sideways, devoid of volatility.\n\nThe cryptocurrency bull rally that started in January 2023 is going strong, with Bitcoin clearing old all-time highs (ATH) at $69,000 and Ethereum clearing the $4,000 psychological level. This cycle has caused many altcoins to grow by multiples in short durations. But as BTC dominance reaches April 2021 levels, what’s next for crypto markets?\n\nAlso read: El Salvador is sitting on $84M profit from its Bitcoin holdings\n\nCrypto market sentiment screams cautiousness\n\nThe Fear and Greed Index (FGI) stands at 81, which indicates that the crypto markets are in “extreme greed” conditions, where potential corrections could erupt due to profit-taking.\n\nThe FGI ranges from 0 (extreme fear) to 100 (extreme greed), reflecting crypto market sentiment. The lower range, aka extreme fear, signals that the markets are oversold, while the upper limit indicates that a potential market correction could be around the corner.\n\nCrypto Fear & Greed Index\n\nBitcoin dominance on the rise\n\nBitcoin dominance, the ratio of BTC’s market capitalization vs. the rest of the crypto market, is currently hovering around 54.05%. In less than two months, Bitcoin dominance has risen roughly by 8 percentage points and is fast approaching a tipping point of 56.62%. This level is the midpoint of the 39.62% to 73.63% range formed in the first two quarters of 2021.\n\nTypically, a declining Bitcoin dominance suggests that investors are interested in altcoin opportunities and vice versa. The recent spike suggests that altcoin profits or new capital could be moving back to BTC. Additionally, the London Stock Exchange (LSE) accepting BTC was a factor that helped Bitcoin’s price to break above $70,000.\n\nBTC Dominance\n\nThe rise in BTC dominance, while bullish for Bitcoin, could translate into a potential correction for altcoins.\n\nEvaluating potential altcoin market reset\n\nA hypothetical scenario that could occur in the next few days is that altcoins lose momentum as BTC's dominance continues to rise. This outlook could push investors to book partial profits, causing altcoins to slide lower.\n\nDogwifhat (WIF), Pepe coin (PEPE), Dogecoin (DOGE), Shiba Inu (SHIB), and other meme coins that noted a raging rally in the past few weeks are already correcting.\n\nEventually, this profit-taking scenario could spread to major altcoins like Solana (SOL), Avalanche (AVAX), Wordlcoin (WLD), and Fetch.aI (FET), pushing investors to convert their unrealized gains into profits.\n\nMeme coin performance\n\nOther considerations\n\nWhile a potential correction could be brewing, some altcoin exceptions could trend higher. These altcoins could rebel against the dominant trend and potentially rally with Bitcoin.\n\nRead more about trending altcoins here - link\n\nHere are the top three altcoins that could rebel against a potential correction and rally higher:\n\nArbitrum (ARB): The Arbitrum Gameathon, which began on Monday, has already caused gaming tokens to surge in the past week. This event will end on March 18, which means it could continue to influence gaming-related altcoins. Worldcoin (WLD): The Artificial Intelligence (AI) ecosystem could see a massive uptrend due to the upcoming Nvidia AI conference, which will take place from March 18 to 21. Ethereum Dencun upgrade: This much-awaited upgrade will be implemented on March 13, making prices of ETH-related altcoins like Arbitrum (ARB), Optimism (OP), LidoDAO (LDO) and others to shoot up.\n\nAlso more: Arbitrum Arcade launch could fuel narrative for crypto gaming tokens"
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxOMkdEcUZxZFFSMXpFUmx1RnVtXzk2b3dwLWJUNzdIS2J2MVBoYl9hS1pPSnpHRU1MbE1sZGZJaWJmVlBKZFgtbmZBdjQ4Q1ZJWjJCZmtmU3RfcnBhWlo4eUNEclFCQ2NLU2EybnpRN2VQLWVjSzZIMkZHbm1ISjBqWUpQQWFnZW5XN1VDZEVGbVNlX3FvUTBUV19wUjlfWGtpUmJsaGVVeDJvN1RaY1JOdnFPLXJFczEtM1JR0gHAAUFVX3lxTFBnVkw1a2dnZ0xSdVZXV1J5U2pLVVVSTEtmdXJLdVlvVlc5TXBxZXEyWVBWUXEwTktMenZidnJzYU5MLUlWSjdWZWo5em91UlBWMGZDeklUdWNUVzVZTVlYcGdsU3BrUTVqdnROeWlkMG0tR01PbW9fLUNzc2MwclMwZzQzd0FFaXMwdEhkZ1k5WjFJdVlKcC15bF9vbU5PclV5eE0wWnhlVGRmRjRfVElzTkQ3Z3VLNEtFWWVjS0VHZA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Mar 2024 07:00:00 GMT",
        "title": "Ethereum surges past $4,000 for the second time in its history - Forbes India",
        "content": "\n\n\n\nThe Ethereum (ETH) price neared the $4,000 mark for the first time since December 2021 on March 8, 2024. As of March 11, it has gone past $4,000, the second time in the entire price history of Ethereum. The upward movement in Ether's price seems to be fueled by anticipation surrounding Ethereum's upcoming Dencun upgrade and the potential approval of a spot Ether exchange-traded fund (ETF) by the United States Securities and Exchange Commission (SEC).\n\n\n\nAs of writing, ETH is holding down at $4,010 and continues to be on the rise, while other major cryptocurrencies are also displaying positive sentiment, with Bitcoin at $71,085.\n\n\n\nThe Dencun upgrade, considered the most substantial enhancement to the Ethereum network since the merger, aims to incorporate several Ethereum Improvement Proposals (EIPs), including EIP-4844, which introduces \"proto-danksharding.\"\n\n\n\nProto-danksharding is a feature designed to enhance transaction processing by utilising blobs, thereby expediting transactions and reducing costs for layer-2 chains and rollups dependent on Ethereum. The Ethereum developers have scheduled the Dencun mainnet launch for March 13.\n\n\n\nAdditionally, there is optimism about the SEC's potential approval of spot Ether ETF applications. It's expected that the SEC will announce its decision on all spot Ether ETF applications simultaneously, similar to its approach with Bitcoin ETFs on January 10, to maintain fairness among issuers. The statutory deadline for the SEC's decision on ETFs is set for May 23.\n\n\n\nIt is believed that the SEC's decision-making process for Ether ETFs won't be as prolonged as it was for Bitcoin ETFs. Drawing from the success of spot Bitcoin ETFs since their launch on January 11, a spot Ether ETF product is anticipated to attract significant capital inflow into the second-largest cryptocurrency by market capitalisation.\n\n\n\nIt is possible that institutional investors may increase their exposure to Ether once attention shifts from Bitcoin's recent all-time high to the potential of an ETH ETF. This could lead to liquidity consolidating at higher levels, potentially triggering price rallies in the long term. With the potential for increased institutional interest and capital inflow, Ethereum's position as the second-largest cryptocurrency is poised for further growth.\n\n\n\nShashank is the founder of yMedia. He ventured into crypto in 2013 and is an ETH maximalist.\n\nTwitter: @bhardwajshash\n\n\n\n"
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxPWFJXQ0lFVS1tN21GQ2M3SDRlTmhRYzhKWkdILWNUNE5iV1JSX2UyTVBTRk5neGRPb1RpS2VHM09pVnNXNzZEa0VjT0V2TG1SaWFJVy05dHBkMm81N1dPV0c5S2l3dkt4cXQ1WllDSFI3WDh5T3VGOWxmNmxSY2pvVWo2V0l1eUhxQVJ3TXlhclE3RTRqZldXQ3ZocVE0R3VTVGNVVGJjYzlRRTM0RmlJ0gG0AUFVX3lxTE9DNmRodGlrMmdEM2lpblBMbS1fb2Z1ci04ZnRZVWQ0WEo3N2pndTZHSXJ1bUJ4WmJLeU9BZmZOSHd0YTV0NXg4QnlWVVB2WkVac285QVNzOUs5Qi1nbXo4MTlxYWhmTTZ5RThyY0V4VkRoWVZxT1gxTW44ekM2VUk2UHNqbXQyZENfbUs0VURoYmRPUktxdThUYi1UcC15RGJaa1Z6TWhMQlhhMTdUcUl4TFRsNQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Mar 2024 07:00:00 GMT",
        "title": "Ethereum Explodes Past $4,000 as Bulls Now Eye All-Time High Levels (ETH Price Analysis) - CryptoPotato",
        "content": "Ethereum’s price has been rallying rapidly over the last few weeks, breaking past several resistance levels. Yet, the price has reached a significant level that could hold the market for a while.\n\nTechnical Analysis\n\nBy TradingRage\n\nThe Daily Chart\n\nOn the daily chart, the price has been steadily rising, making higher highs and lows. The market has left the 200-day moving average far behind, a behavior typically seen during crypto bull markets.\n\nCurrently, the ETH price is trying to pierce through the $4,000 resistance level after failing to do so last week.\n\nIf the breakout occurs, ETH will likely reach a new all-time high. However, judging by the massive overbought signals on the RSI, a pullback looks pretty probable in the short term.\n\nThe 4-Hour Chart\n\nLooking at the 4-hour timeframe, it is evident that the price has been consolidating below the $4,000 level for a while. Yet, the bullish momentum has seemingly kicked in again, and ETH is on the verge of blowing past the $4,000 resistance zone.\n\nThe Relative Strength Index also shows values above 50% but is still not overbought in this timeframe. Therefore, the market might still rise higher before an eventual correction.\n\nSentiment Analysis\n\nBy TradingRage\n\nEthereum Funding Rate\n\n\n\nWhile Ethereum’s price has yet to reach a new all-time high, market participants expect the price to rally much higher. This optimistic behavior can easily be witnessed in future market sentiment.\n\nThis chart presents the Ethereum funding rates, which indicate whether the buyers or the sellers are executing their orders more aggressively on aggregate. Positive values indicate bullish sentiment, while negative values point to pessimism by market participants.\n\nThe chart demonstrates that the funding rates have been showing extremely high values recently, even higher than during the last all-time high. While this aggregate buying pressure is not inherently bad, it can lead to a potential long-liquidation cascade that could cause short-term price drops."
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxQNDlhZGhxUzdUT09VZkY2dTh1NUJuVU0zZjlJUVA0R09uYzhiR2lPTGstLWRWa0lwN19JTi1pdFpjMHJadUJKcHhrb0dadWVKQ0p3QmhPQ1lYLUgzWU5lNFBUNHlYVzNSdlJUY3ZwMTVHR0FqVXRLMVY0WktoeTdoemJKTlJNMjYxbzRKeGhYbm5SYWYzbDRSVGxYNWstU2lnRzFwbUVxeDBxYzhOdGE4dGxxVjY2VnRsYkREU1Z2U0YwWDZpbkE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 12 Mar 2024 07:00:00 GMT",
        "title": "With bitcoin hitting new highs, it’ll likely reach the US$100,000 milestone before 2024 is out - The Conversation",
        "content": "Cryptocurrencies are surging again. Bitcoin has just hit an all-time high of more than US$72,000 (£56,300), pushing past the level of circa US$69,000 where it turned back during its last bull phase in late 2021.\n\nOther top cryptocurrencies like ethereum and solana have reached their highest prices in three years, on the back of a run that has been going since the autumn. The value of the whole cryptocurrency market has raced up to US$2.6 trillion, triple what it was worth at the beginning of 2023 and not far off its previous US$3 trillion peak.\n\nMuch of this run has occurred at a time when the US dollar has been strengthening against other currencies (though it has fallen in the past couple of weeks). This can often be a time when cryptocurrencies get weaker, so it shows how strong they have been lately.\n\nMany other fiat currencies around the world have been losing value against the US dollar during this period, so bitcoin reached all-time highs in many of them long before it finally took out its high in the US currency.\n\nSo what has contributed to this explosion in prices and where is the market going for the rest of 2024?\n\nBitcoin ETFs\n\nA major driver for this appreciation in prices has been the US authorities’ approval in January of an investment vehicle known as an exchange-traded fund or ETF for the general or “spot” bitcoin market. An ETF is an easy way for the average saver to get exposure to an asset, since they buy shares in the vehicle, usually through their financial advisor, rather than having to go to the trouble of buying the underlying asset.\n\nA total of 11 bitcoin ETFs were approved in the US, and their daily trading volume has now exceeded US$10 billion – driven by frontrunners Blackrock and Fidelity Investments. This demonstrates the large interest from traditional market participants, and as the spot ETFs become more mature, their providers will offer more promotional material and education to get more customers onboard.\n\nBitcoin/US$ price\n\nThe cryptocurrency market is always adapting and innovating, and one possible future innovation is the offer of option contracts on the new spot ETFs. Options allow traders to hedge their bets on whether the crypto market will go up or down, and would likely attract even more new money into the space.\n\nHowever, US regulator the Securities and Exchange Commission (SEC) has just postponed a decision on this innovation until late April. Some experts think approval may take longer than that as it is unclear which regulatory body would be responsible for policing this new class of derivative contracts.\n\nThe bitcoin halving\n\nOne feature of the bitcoin system which was built in at the beginning is that, roughly every four years, the rewards to companies using arrays of computers to create or “mine” bitcoin get cut in half.\n\nThe last halving took place in May 2020, where miners went from receiving 12.5 bitcoin for each unit of work they do to 6.25 bitcoin. The next is due to take place on April 19, cutting the reward down to 3.125 bitcoin.\n\nBecause each halving means less new bitcoin coming on to the market, they have coincided with strong price appreciation in the cryptocurrency. What isn’t clear is whether this is already priced in and therefore not actually the reason price is going up.\n\nOne theory is that the institutions behind the spot ETFs are buying aggressively now because they know there will be less bitcoin on the open market once the halving takes place.\n\nEthereum prospects\n\nMeanwhile, the crypto market could also be boosted by spot ETFs for the ethereum cryptocurrency system in the coming months. At least ten firms, including Blackrock and Fidelity, have applied to launch them and the SEC has until May to make a decision.\n\nWhereas the online ledger that underpins bitcoin, known as its blockchain, has been seen largely as a store of value, ethereum has become the leading blockchain for developers to write applications using this technology.\n\nSEC Chair Gary Gensler believes that most cryptocurrencies should be treated differently to bitcoin, as financial instruments known as securities rather than as more straightforward commodities. This adds complexity to the ethereum ETF approval process. If the US authorities were to decide it was the case, it would mean that ETFs couldn’t buy ethereum from crypto exchanges until those exchanges had received approval to trade it as a security.\n\nWhile that uncertainty continues, ethereum could be boosted by the so-called Dencun upgrade (also known as Duncan or EIP-4844). Ethereum has competition from other blockchains such as solana and avalanche due to its relatively slow transaction speed and high costs.\n\nIt already completed its first major step in a long-term plan to reduce costs and cope with many more users (known as scalability) when it transitioned in 2023 to a different system for verifying transactions known as proof of stake. The Dencun upgrade, which goes live on March 13, will further improve scalability by making data storage more efficient on the network, while also lowering transaction fees.\n\nWhere next\n\nPredicting cryptocurrency prices is not for the faint-hearted. The market is very volatile, and often exceeds expectations when it goes up or down. The behaviour of individuals determines market prices and, as Isaac Newton put it, you can “calculate the motions of heavenly bodies, but not the madness of the people”.\n\nHowever, the majority of commentators expect crypto prices to keep rising over the coming months. Election years tend to be good for investments in general, while a second Trump administration would probably create a more favourable regulatory environment for crypto assets (as would a Rishi Sunak victory in the UK, however unlikely that seems at present).\n\nAs bitcoin becomes more and more mainstream and integrated with traditional assets, it isn’t inconceivable that it could hit US$100,000 in 2024 – an extraordinary feat for a invention that was worth nothing as recently as 2009."
    },
    {
        "id": 71,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxNRkExWE9abElfOTVwckU5RmNSc0pYdVFsNkNTb3ItZnY0N1VOVEZjLXpWOXM3Y09adFZwckRMNkk5eFp2TG1Ea1dlT0VIekR0ZkhBQjJ5NWpFVTVyYlRoZlZFcTFhRHdzanhDYlJ0TGtKcUtxMGNHMWVvRnBPRDczU3RGM1BxVVRnZG10cVFsOGJYV3JiOEE00gGcAUFVX3lxTE1VS3BCYlAydkFoSnZRdzJqSlFGRHRMVWM5aHoxN3JxUDR3REhDUHY1ZTIxazJ2N2NjWHhybXlTU1JELUZEaXEzZ3dOUE1VT1Z0ZlF2LXJ3bjVhV0RPaERZeGw1aF9TempDNDdpMTdRdGd0V1hSWjZpZU84SnBEaWZyQ1VjZGF2c2RHWHRMX1NKWUY4Qi1fTXQwVHNiXw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 12 Mar 2024 07:00:00 GMT",
        "title": "Crypto Price Prediction: Top Layer 2 Tokens to Watch Ahead of Ethereum Dencun Upgrade - CoinGape",
        "content": "Crypto Price Prediction: So far in 2024, Bitcoin has been the main focus of crypto investors likely attributed to the first-time launch of Spot BTC ETF. The US SEC’s green light for 11 new ETFs in January sparked a substantial influx of capital from the traditional market, significantly fueling the surge that propelled Bitcoin to a new all-time high of $72,600.\n\nHowever, analysts believe the market participant’s focus may shift to the second largest cryptocurrency Ethereum due to the upcoming launch of the Decun upgrade and potential approval of ETH ETF this year.\n\nadvertisement\n\nProto-dank sharding, introduced in the Ethereum Dencun upgrade, is designed to enhance the network’s scalability and efficiency by improving how data is stored and accessed. It represents a precursor to full sharding technology, aiming to significantly reduce the costs associated with Layer 2 rollups, which are critical for Ethereum’s scalability.\n\nThis development will benefit Layer 2 projects by driving greater adoption and offering new opportunities for integration and innovation.\n\nAlso Read: Michael Saylor Says Bitcoin Will “Eat” Gold, Emerging as Top Asset, Price Surges Over $72k\n\n1)Arbitrum(ARB)\n\nArbitrum is a leading Layer 2 scaling solution for Ethereum, aimed at improving the scalability and efficiency of Ethereum transactions. By employing Optimistic Rollup technology, Arbitrum allows for the execution of smart contracts and transactions at a lower cost and higher speed, without sacrificing Ethereum’s security\n\nInsights provided by IntoTheBlock indicate a stark decrease in transaction costs for decentralized exchange (DEX) swaps. Post-upgrade, the gas fee for utilizing Arbitrum is expected to drop from $2.02 to $0.4.\n\nAs per recent chart analysis, the ARB price is witnessing a mid-term sideways trend under the influence of a triangle pattern. A recent reversal from the pattern’s resistance trendline plunged the altcoin from $2.27 to $2 registering a 12.2% loss within a week,\n\nIn the last 24 hours, the Arbitrum market cap dropped to $2.5 Billion while the trading surged 10.8% to hit $763 million. A potential breakout from the triangle pattern will set the ARB price to chase the $2.42 and $3.2 price targets.\n\nAlso Read: Robert Kiyosaki Advocates Bitcoin (BTC) As US Debt Crosses $34T\n\n2)Optimism (OP)\n\nOptimism operates as a Layer 2 scaling solution for Ethereum, designed to enhance transaction throughput and reduce gas fees while maintaining security and Ethereum’s decentralization principles.\n\nFollowing the Decun upgrade scheduled for March 13, Optimism will see a gas fee reduction from $1.42 to $0.28. OP, the native cryptocurrency of the network, has been witnessing a steady recovery utilizing an ascending trendline in the daily chart.\n\nAn active recovery trend has uplifted the Optimism price from $1.16 to $4.3 registering 275% growth within the five months, while the market cap surged to $4.39 Billion.\n\nThe OP price facing renewed supply pressure at $4.85 may trigger a fresh correction and plunge altcoin to potential support of $4.2 and the rising support trendline.\n\nAlso Read: Spot Ethereum ETF: What Are The Chances of Approval In May?\n\n3)StarkNet(STRK)\n\nStarkNet is a decentralized, permissionless, Layer 2 scaling solution for Ethereum, utilizing STARK-proof technology to achieve high scalability and privacy. Developed by StarkWare, it enables the processing of transactions off-chain while leveraging the security and composability of the Ethereum mainnet.\n\nFollowing the upgrade, the projected Dex Swap Cost for Starknet will drop from $1.16 to $0.12. Amid the Bitcoin price rally above $70000, the STRK price rebounded from $1.744 last week and hit $2.67 to register 53% growth.\n\nThe market cap of Starknet witnessed a 1.41% drop reaching $1.75 Billion, while the trading volume plunged 5.47% to hit $505 Million. A look at the traditional pivot levels indicates the STRK price may face overhead supply at $2.75 and $3.08, while the $2.248 and $1.92 can provide suitable support.\n\nAlso Read: Blackrock Brings Ethereum ETF Enthusiast on Board to Focus on Crypto Offerings\n\nTakeaway\n\nThe upcoming Decun upgrade on the Ethereum network is set to bolster scalability, fortify security, and ramp up overall network efficiency. A more robust and efficient Ethereum network could also bolster the overall ecosystem, potentially benefiting Layer 2 projects by driving greater adoption and attracting natural growth in these assets.\n\nRelated Articles\n\nSahil Mahadik Sahil is a dedicated full-time trader with over three years of experience in the financial markets. Armed with a strong grasp of technical analysis, he keeps a vigilant eye on the daily price movements of top assets and indices. Drawn by his fascination with financial instruments, Sahil enthusiastically embraced the emerging realm of cryptocurrency, where he continues to explore opportunities driven by his passion for trading\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 74,
        "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxNVFlIdU44a0wxWUFnNlktUXJRLXJEZUNwLWhnMkVlZ2tIdGFFR2xRZ29pVXV2eUY0TjdITGxBc005eTZOOV9LRjJsX0QzaXFpNlFTT0NLdmFVRUdrQV95N1Fsc2xuUjNZNlRxTEl6bG8xd0F1eU96ekJkTV9Wa0F4X3lKU1cxUXlMdnpjVUFJUzc5YVptWHpJY2ZkdzVNZXhQMU1KMnhHb09KRGQ5?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 12 Mar 2024 07:00:00 GMT",
        "title": "Eclipse Labs Secures $50 Million to Advance Ethereum Layer-2 Solutions - Crypto Times",
        "content": "Eclipse Labs has clinched a $50 million Series A funding round. This sum, co-led by industry leaders Placeholder and Hack VC, propels the total capital raised to $65 million, marking a milestone in Eclipse Labs’ journey.\n\nThe investment attracted heavyweight backers, including Polychain Capital and Delphi Digital, signaling robust confidence in Eclipse’s vision. The initiative seeks to integrate the Solana Virtual Machine’s (SVM) high performance seamlessly with Ethereum’s abundant liquidity.\n\nWe're excited to announce that Eclipse Labs, the development team contributing to Eclipse Mainnet, has raised a $50M Series A co-led by @placeholdervc and @hack_vc, bringing our total capital raised to $65M.\n\n\n\nEclipse brings Solana performance to Ethereum with the first SVM L2. pic.twitter.com/akq46v34lN — Eclipse (@EclipseFND) March 11, 2024\n\nNeel Somani emphasized the project’s ambition to craft a Layer-2 chain capable of supporting various use cases with efficiency and versatility. “Our integration of SVM’s high performance with Ethereum’s liquidity pools aims to redefine blockchain technology’s capabilities,” Somani stated, highlighting the project’s innovative approach.\n\nWith the clock ticking towards an anticipated mainnet launch in Q2, Eclipse Labs is laying the groundwork for deploying decentralized applications in collaboration with platforms like Rarible and Pyth Network, underscoring their commitment to broadening blockchain’s reach.\n\nAs the blockchain community eagerly awaits Eclipse Labs’ next steps, the project’s blend of innovation, strategic partnerships, and forward-thinking could set a new standard for what’s possible in Ethereum Layer-2 solutions."
    },
    {
        "id": 78,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxPY2JMc0xnOHFqLXIxd3VUOUFOOFdNYmpndVNablZkUF90YmplTWMxemM5OHJlWE9XVy1xSmpTRmNjVm9ja0NVYlFzR2w1OEhnTnlfa2N4VkVzXy0yWEVYeE5xd0lFbjlYcVNETXBnQS1NenAyWmJIejRBd19rQVZlRUVDeTN2aGpHOGtHUNIBkgFBVV95cUxQU3lzTm1MUE1qYTE1YTVWUDdCandtakljZmMwNWdNak15R2tYZ2YxRjU3bDZvazE1aHoxRDl4eU5rb3AtX1pTekVLVWZVc1lvOGJrY1dLbEcxYnhGSXZDV1BFODBibG5BSXlmQTZ5QVdwOXJ1cF9vT2VNZl82QW5NNnE2bFBwNFRvUzczMnpMZUl3QQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 12 Mar 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum, and XRP price predictions for the coming week! - AMBCrypto News",
        "content": "Capital flowed out of Bitcoin, suggesting that the price might dip below $69,000.\n\nDespite increasing gains for holders, ETH’s price might hit $4,500 soon.\n\nTop cryptocurrencies including Bitcoin [BTC], Ethereum [ETH], and Ripple [XRP] have had a great start to March, despite earlier predictions that the month could be bearish for the market.\n\nFor instance, Bitcoin rallied to a new All-Time High (ATH) as it zoomed past $72,000 on the 11th of March,\n\nEthereum, which was once lagging, has been catching up. According to AMBCrypto’s assessment of the altcoin, ETH’s price gained 8.59% in the last seven days.\n\nThis performance ensured that the value rose above $4,000. Then, there is XRP, which has been a subject of controversy following Ripple’s long-standing lawsuit with the U.S. SEC.\n\nBut in the last 24 hours, XRP seemed not to care about its predicaments as its price pumped 18% and almost tapped $0.74. But can the cryptocurrencies maintain this momentum in the coming week?\n\nBitcoin price prediction\n\nBitcoin’s impressive performance since the year began has been connected to the surge in institutional interest through ETFs.\n\nBut the past few days have seen a spike in retail interest, indicating that the bull run might already be here.\n\nHowever, a look at the Hodler Net Position Change revealed that the high-flying price might take a chill pill. Employing Glassnode’s data, we noticed that the metric had dropped into negative territory.\n\nIf the Hodler Net Position Change was positive, it would have meant that investors were accumulating BTC. But the metric being at -31.531 BTC means that holders were cashing out.\n\nIf investors continue to book profits, then Bitcoin’s price might decrease.\n\nA considerable price that it could hit in the coming week could be below $69,000 which was a key resistance area. However, traders might need to watch out for institutional inflow.\n\nShould inflows from the ETFs hit new highs, then Bitcoin’s price might rally to another ATH.\n\nEthereum price prediction\n\nFor Ethereum, AMBCrypto considered the Market Value to Realized Value (MVRV) ratio.\n\nAt press time, the 30-day MVRV ratio was 19.30%, which means that if all ETH holders sell their tokens, they would make an average gain of 19.30% profit.\n\nIn a bull market, this reading is considerably low and might imply that the altcoin was undervalued. For instance, the bull market of 2016-2017 saw the MVRV ratio rise as high as 81.6%.\n\nIn 2021, the metric also surged higher. With this state, ETH’s price might rise higher in the coming week, and a 10.22% hike to $4,500 might be plausible.\n\nAnother reason for this could be a decline in Bitcoin’s dominance. Should this be the case, ETH might get a big share of the redistribution, which could drive the price upwards.\n\nXRP price prediction\n\nXRP seems to be enjoying the capital rotation from Bitcoin into altcoins. Previously, AMBCrypto reported how the token was struggling to rise past the $0.62 resistance.\n\nAs of this writing, the price had declined to $0.69 after initially hitting $0.71. When we considered the 90-day Mean Dollar Invested Age (MDIA), we observed that the metric slid.\n\nRealistic or not, here’s XRP’s market cap in BTC terms\n\nDips like this indicate a sudden movement of previously idle tokens. Concerning the price, it could indicate distribution. If this continues, XRP’s price might decrease to $0.65.\n\nHowever, the metric showed signs that a rising slope could be in the works. A confirmation of this slope might invalidate the bearish bias, and drive XRP toward $0.75.\n\nDisclaimer: The information presented does not constitute financial, investment, trading, or other types of advice and is solely the writer’s opinion."
    },
    {
        "id": 86,
        "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxNclFjMUpYcnFvMFJVMkxacnVDcDl4SXBTVGVnbjBTcXh3QTA3ZnkyOE1zcE00WVhTeXE0ZUdCQ0ROT1IyT001TmM4N2dlZS1rbFY1U1FTYlp4WHU2WV9SYTBYVGxrWER3ZDdwRnl2a2oyeUk1MHlTaC14V1lfeWFtYVhtS3FXSXJucXl3cmJ5MWw3RGVwMHVpT1FhbjFHcDdDb1NxNHZCbXdIZHE0SzBQcm0ta1FQVjg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Mar 2024 07:00:00 GMT",
        "title": "Ethereum Stalls Below $4,000 After Weekly Rally: Consolidation or Correction? - FX Leaders",
        "content": "⚡ Trade Forex With High Leverage And No Limitations! – Open an Account Here\n\neth-usd\n\nEthereum (ETH), the world’s second-largest cryptocurrency by market capitalization, has seen its price hover stubbornly below the $4,000 mark in recent days, despite registering over 10% gains in the past week. This consolidation phase has analysts pondering whether it’s a healthy pause before further ascension or a sign of a potential correction.\n\nETH/USD Technical Analysis Paints a Mixed Picture\n\nLooking at the ETH/USD technical indicators:\n\nResistance: The immediate hurdle for ETH bulls lies at the $3,850 level. A decisive break above this point could propel the price towards $4,000 and potentially higher.\n\nSupport: The first line of defense in case of a pullback sits at $3,740. A clear breach below this level could see ETH revisit the $3,650 zone or even the 50% Fibonacci retracement level of the recent rally, around $3,550.\n\nMoving Averages: The 20-day and 50-day Exponential Moving Averages (EMAs) are currently acting as dynamic support for ETH prices, indicating a short-term bullish bias.\n\nMomentum Indicators: The Moving Average Convergence Divergence (MACD) on the hourly chart is losing some momentum in the bullish zone, suggesting a potential slowdown in the upward trend. However, the Relative Strength Index (RSI) remains above 50, signifying that the market isn’t yet overbought.\n\nPossible Reasons for Consolidation in Ethereum Price\n\nSeveral factors could be contributing to ETH’s current consolidation:\n\nProfit-taking: After a significant weekly rally, some investors might be taking profits, leading to a temporary price pullback.\n\nWider market correction: If the broader cryptocurrency market experiences a correction, ETH could be dragged down along with it.\n\nMacroeconomic factors: Global economic uncertainties, such as rising interest rates, could dampen investor sentiment across riskier assets, including cryptocurrencies.\n\nLatest Developments to Know Before Trading Ethereum\n\nSpot Ethereum ETF Approval Delays: Fox Business journalist Eleanor Terret reported diminishing optimism surrounding the U.S. Securities and Exchange Commission (SEC) approving spot Ethereum ETFs by May 23rd. Her sources suggest a lack of engagement from the SEC staff compared to Bitcoin ETF applications. Additionally, prominent anti-crypto politicians are reportedly opposing Ethereum ETF approval.\n\nEthereum’s Quantum Readiness: Ethereum co-founder Vitalik Buterin expressed confidence in the platform’s ability to counter a potential quantum computing attack through a hard fork and new transaction types. This would involve a network rollback and user software updates to protect existing wallets.\n\nDeFi Resurgence: The decentralized finance (DeFi) ecosystem has seen a significant uptick, reaching a $100 billion total value locked (TVL) for the first time since May 2022. Ethereum maintains its dominance in DeFi with a 59% market share. Lido, an Ethereum-based staking protocol, remains the leader with $39 billion TVL.\n\nLooking Ahead\n\nThe next few days will be crucial for determining the direction of ETH’s price. A sustained break above $3,850 could signal a continuation of the uptrend. Conversely, a drop below $3,740 with increasing selling pressure could indicate a more significant correction."
    },
    {
        "id": 87,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxQd3l4TlhESUQwbWZ3RVROUDQxTmdBVmdPQXNwelNfamlOTGtnUkhJUmk4eFRoZHBSOWxDMXZmRzNqRDJfUUVNS0FCWkhSbTF0cUZKeDRtYTRCNElTUl9hYU1uMHlnYnpjaWI1clI4b1l0M2NYRUFxaVQxSl9mcGpoaTZIcFdCaEtQZFRxSm9yQlJaZGVKRjZOOVlGS2JCRThNZEFTWmYzMlXSAa4BQVVfeXFMTU5NTGVRVjVGN2cxa1ktZElqZmNWSnB2alRHVTlUZWNRbWpRNnJoQmtNRDdDNXpBdkZ0R1hpSkktY2dDUjNfU2xhTEN0WFphTFZPQVo2ZVUzNkNEcUZHbVlxVVRfMUMxaFhaalVUdl9BOEJDY3d6WXJMd3dJM0dSYVQ3QVRKVDVwQUJfWEY3Q043TW1EeGY3UFlJcVpsMXg5QWM0Yk1ZdEtaTTJ6eDF3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Mar 2024 07:00:00 GMT",
        "title": "Crypto Prices Today March 11: Bitcoin Drops To $68K, Ethereum At $3,800, SOL, XRP, PEPE Dip - CoinGape",
        "content": "The top crypto prices today registered a bearish turn as the Bitcoin (BTC) price slumped to the $68,000 level after attaining a peak at $70,000. In addition, the Ethereum price dropped below the $3,900 mark. Meanwhile, other top altcoins, such as Solana (SOL), XRP, Cardano (ADA) dipped in value.\n\nMajor Crypto Prices Today\n\nThe Bitcoin price sustained above $68,000 despite the pullback The Bitcoin price was down by 1.50%, reaching $68,508.25 at the time of writing on Monday, March 11. On the other hand, it’s trading volume surged by 43.47% to $36.63 billion in the last 24 hours. Meanwhile, the crypto boasted a market cap of $1.34 trillion.\n\nadvertisement\n\nIn the altcoin arena, the Ethereum price dropped 2.54% to $3,854.68 at press time with a market valuation of $462.93 billion. Whilst, ETH saw its trading volume increase by 37.73%, reaching $17.60 billion. Meanwhile, the Binance Coin (BNB) price defied the bearish trend and surged by 5.61%, reaching $521.25. In addition, its 24-hour trade volume spiked by 127.41% to $5.71 billion.\n\nThe Solana price geared up to extend below the $140 level. The Solana price was down by 4.05%, settling at $141.35 On the contrary, SOL witnessed a 35.39% hike in trade volume to $3.95 billion in the last 24 hours. Whilst, the XRP price dropped below $0.62 amid the pullback. The XRP price recorded a dip of 2.52%, reaching $0.61. However, XRP’s trading volume increased by 11.98% to $1.76 billion.\n\nMeanwhile, the Cardano price dropped 2.99% to $0.7142 today. Whilst, ADA recorded a 19.48% hike in its 24-hour trading volume, settling at $723.09 million. As the top crypto prices witnessed a hike, popular meme coins also followed. The Dogecoin price slipped 5.84% to $0.1681 while its rival, Shiba Inu price plummeted by 7.35% in value and traded at $0.00003242.\n\nAlso Read: Bitcoin (BTC) Price Consolidates As ETF Issuers Eyes Crucial Week Ahead\n\nTop Crypto Prices Today Are\n\nPepe Coin Declines\n\nThe Pepe Coin (PEPE) crypto, a popular meme coin, slumped significantly today. At press time, the Pepe Coin price was down by 8.89% to $0.000008381 with a market valuation of $3.53 billion. In addition, its 24-hour trade volume plunged by 20.23% to $1.26 billion.\n\nPyth Network Rallies 50%\n\nPyth Network (PYTH), a trending crypto, recorded an impressive surge of 20% and ranked as one of the top crypto gainers. The PYTH price soared by 19.78% to $0.8291 at the time of reporting. Moreover, its trade volume skyrocketed by a whopping 317.39% to $513.31 million. Furthermore, the PYTH Network crypto recorded a new all-time high of $0.8934 amid the rally recently.\n\nAlso Read: SHIB Vs DOGE Vs Pepe Coin; Who Is Winning The Memecoin Bull Run?\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 88,
        "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTE9sYkdIcWtzczVCakRQZGs4MDlENDk5TEZvVlYySVB5LURTSlZzXzZmNHpsR2tBb0xlT29VTUFaeHl2Ukx6U2lnT2ZYTzNEaEtMY084WkIzak9WYmxNMk5SU01WdHhROGFHcEUtTkRIYXVkX0U?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 12 Mar 2024 07:00:00 GMT",
        "title": "Ethereum exceeds $4,000 as Dencun day lands - City A.M.",
        "content": "Ethereum exceeds $4,000 as Dencun day lands\n\nToday is the day of the long-awaited Ethereum Dencun upgrade. Dencun will reduce Layer 2 transaction fees and involve “blobs” and “Proto-dank sharding”. On Monday, Ethereum punched above $4,000 for the first time since December 2021. This new cycle high has happened even in the face of the perceived diminishing likelihood of an Ethereum spot exchange-traded fund (ETF) being approved by the SEC.\n\nEach day, Coinrule will run through the state of the digital assets market for Blockbeat, your home for news, analysis, opinion and commentary on blockchain and digital assets.\n\nToday is the day of the long-awaited Ethereum Dencun upgrade. Dencun will reduce Layer 2 transaction fees and involve “blobs” and “Proto-dank sharding.” On Monday, Ethereum punched above $4,000 for the first time since December 2021. This new cycle high has happened even in the face of the perceived diminishing likelihood of an Ethereum spot exchange-traded fund (ETF) being approved by the SEC.\n\nOver the past week, the probability of the Ethereum ETF being approved has been declining even as the asset has continued to soar. Eric Balchunas, Bloomberg’s senior ETF analyst, estimates the odds of the 23 May deadline being approved now stand at 30%. This is a decline from his 70% January estimate. Balchunas’s pessimism, he claims, stems from the lack of comments and interaction from the SEC regarding the filings so far. The Bitcoin ETFs took multiple edits and refilings along with meetings with the regulator to get the process over the finish line. In an attempt to aid the process, Coinbase met last week with the regulator to advocate for the spot ETF. They demonstrated the potential lack of manipulation and the strong correlation to the futures ETF. However, we are still 71 days away from the 23 May deadline. This is a lifetime in crypto, but maybe not in the traditional finance world where filings, regulatory bureaucracy and politics are involved.\n\nRegardless of the ETF’s approval, Ethereum’s fundamentals are improving each day. According to The Block, active addresses have increased to over 500,000 – their highest since December 2022. Last week also saw Ethereum’s revenue breach $200 million for the first time since May 2022. Today’s Dencun Upgrade also aims to make layer 2s more usable. The Block also estimates the Dencun Upgrade will considerably lower DEX swap gas fees. Aribitrum’s fees will be reduced from $2.02 to $0.4 and Base’s will be reduced significantly from $0.58 to $0.01. The declining costs will potentially drive more cost-conscious participants onto Ethereum Layer 2s and away from Ethereum’s arch-nemesis – Solana. With both the overall crypto market outlook and Ethereum fundamentals improving, maybe denial of the Ethereum ETF wouldn’t be the end of the world for the asset. 71 sleeps to go."
    },
    {
        "id": 90,
        "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxNWnhPdTF0VWVuX29oWVBwODZpalBoNHJGUVpZalF0WUJFU2EwUGE2OXFRM1Q3c0pPMkNDTHZhTkFOeGJXQTlCbkJpeVZUY3pOYUJSV1hBaWlBdXIyMW1BV1JGclJrVnhURVZhUWNLQ0lOY3AzcWVMWGF6UVpsb3dkSFZPTjBGcEdjUXhTdHlYTTNnTW80OTAyc2Q0eUxpeTlvTEc2dXVZV2pjUTVEeDI1Sjd6SElKel9BcWJRRg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Mar 2024 07:00:00 GMT",
        "title": "Here's how Bitcoin, Ethereum, and other tokens are performing on Monday - NewsBytes",
        "content": "Summarize Simplifying... In short Cryptocurrency prices are fluctuating with BNB, Solana, and Shiba Inu seeing significant gains, while XRP, Cardano, and Dogecoin are down.\n\nThe top five gainers of the day include Gala and Pyth Network, while JasmyCoin and Shiba Inu are among the biggest losers.\n\nThe global crypto market cap is currently $2.61 trillion, marking a slight increase from the previous day. Was a long read? Making it simpler... Next Article Next Article\n\nMarket capitalization of Bitcoin stands at $1,365 billion\n\nToday's cryptocurrency prices: Check rates of Bitcoin, Ethereum, Dogecoin, Tether\n\nBy Akash Pandey 10:42 am Mar 11, 202410:42 am\n\nWhat's the story Bitcoin has lost 1.52% in the last 24 hours, trading at $68,533.35. It is up 7.71% from last week. The second most popular token, Ethereum, has dropped 2.48% from yesterday, and is trading at $3,854.36. From the previous week, it is up 10.62%. Bitcoin and Ethereum have a market capitalization of $1,365 billion and $463.42 billion, respectively.\n\nAltcoins\n\nHow have other prominent cryptocurrencies performed?\n\nBNB is trading at $521.69, a 5.65% increase from yesterday and 25.71% higher than last week. The current price of XRP is $0.66, down 2.86% in the last 24 hours. It is 3.76% lower compared to last week. Cardano and Dogecoin are trading at $0.77 (down 3.49%) and $0.11 (down 6.53%), respectively.\n\nOther tokens\n\nSolana's price has increased by 8.37% since last week\n\nSolana, Polka Dot, Shiba Inu, and Polygon are currently trading at $140.64 (down 4.48%), $10.43 (down 0.55%), $0.000033 (down 8.45%), and $1.19 (up 1.94%), respectively. Looking at the weekly chart, Solana has gained 8.37%, while Polka Dot has gained 6.75%. In the past week, Shiba Inu's value has increased by 40.96%, whereas Polygon is 8.1% up.\n\nData\n\nTake a look at top 5 gainers of the day\n\nThe top five gainers on the basis of the 24 hourly movement are Gala, Pyth Network, Theta Network, NEAR Protocol, and FLOKI. They are trading at $0.077 (up 26.13%), $0.88 (up 20.59%), $3.47 (up 12.76%), $6.83 (up 12.12%), and $0.00022 (up 11.27%), respectively.\n\nStable tokens\n\nWhat's going on with the popular stablecoins?\n\nA stablecoin is a cryptocurrency with extremely low volatility. Its value is pegged to a real-world asset such as fiat currency or gold. Talking about some of the popular tokens, Tether, USD Coin, and Binance USD are trading at $1 (down 0.14%), $1 (flat), and $536.9995 (up 11.87%), respectively.\n\nData\n\nToday's top 5 losers\n\nThe biggest losers of the day are JasmyCoin, Shiba Inu, Pepe, Bonk, and Ronin. They are trading at $0.022 (down 8.87%), $0.000033 (down 8.32%), $0.0000088 (down 7.75%), $0.000033 (down 6.89%), and $3.66 (down 6.87%), respectively.\n\nDeFi\n\nTake a look at leading DeFi tokens\n\nDeFi, short for decentralized finance, refers to all global, peer-to-peer financial services on public blockchains. Some of the popular DeFi tokens are Avalanche, Chainlink, Uniswap, Internet Computer, and Dai. They are trading at $41.55 (down 3.71%), $21.31 (up 6.91%), $14.11 (down 1.23%), $13.99 (down 3.85%), and $0.99 (down 0.03%), respectively.\n\nNFT\n\nTop 5 NFT tokens of the day\n\nNon-fungible tokens (NFTs) are cryptocurrencies that lack the attribute of fungibility, which means they cannot be exchanged for one another like other tokens. Among the popular NFT tokens are Internet Computer, Immutable, Render, Stacks, and Theta Network. They are currently trading at $13.98 (down 3.87%), $3.49 (up 0.59%), $11.65 (down 2.82%), $2.99 (down 3.08%), and $3.48 (up 12.89%), respectively.\n\nMarket outlook\n\nTotal cryptocurrency market capitalization\n\nThe current global crypto market cap is $2.61 trillion, a 0.26% increase over the last day. The total crypto market volume over the last 24 hours is $110.85 billion, which marks a 25.28% increase. The global cryptocurrency market valuation was $1.8 trillion last month, in comparison to $1.64 trillion three months ago."
    },
    {
        "id": 91,
        "url": "https://news.google.com/rss/articles/CBMi7wFBVV95cUxNOVNxWHVPMVNFT2dlWFY3ODFtMHlNNTEtRzlWSVBRX3cxb2ZYVWJPMXQ3WDRGYTRtNEhHOW5fWllxUmt3X183cHE3OXVXQWV4QjVscGV6djJkWWpCYmhYMlRoSmk3MXhlN1NtOW5SZHRqb2I4Mm9LNkFYdlJCMm85Z09CTmNLcjBSOWNNVi1USGs0bmc4RXNVVE5oUjhKZ3A2cmpMWkhWVEJKcG1PeDVxdXktdG5WZ19TWEtSbUg2eHBPZnNoLS1qZkxEOFFwSkI4REUxWnZTSWlSNV9ZUW9NTEpaVnRGMllXcjFFZ29DTdIB9AFBVV95cUxQMzFhTFdVS3FHb3dDNXBibzBkZ1ZGUHk4UmwwT3ZxX1EyRWxZTlFDbXphaEtvMmtBMzBJa0M2TEVWVUd1Wm9PZ1ZzSVZVbTRRb2RaSkhTRzZsRlg3Z0lwMU1pbTZsUW84dTBtYkxYWkIyTmc3dkFhYVBsd3pQNDJxUjVPNG5UeGtGOGtSd1JsYUJRNnR6RjNXUkJzdjBqTlQ1LVhvc1poWjhSd1prYXdlYkxQUGxhMVExMWx5SzlWeTRiTE5tTmo5bjVfblpLRC1TY3d0TUtNQXVIOFh4c0ZXalBOOVdmYVhHR0RuOXVKQXZic2F2?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 12 Mar 2024 07:00:00 GMT",
        "title": "Cryptocurrency Price Today: Bitcoin Charts New High Of $72,000, Ethereum Crosses $4,000 - ABP Live",
        "content": "Bitcoin (BTC), the oldest and most valued cryptocurrency in the world, crossed the $72,000 mark early Tuesday, before settling down at around $71,800 at the time of writing. According to industry experts, the sudden rise in investors’ interest in Bitcoin exchange-traded funds (ETFs) continues to be the primary driver. Ethereum (ETH), on the other hand, finally managed to cross the $4,000 mark and appears to remain stable. Other popular altcoins — including the likes of Dogecoin (DOGE), Ripple (XRP), Solana (SOL), and Litecoin (LTC) — landed in the greens across the board. Toncoin (TON) emerged to be the biggest gainer of the lot, with a 24-hour gain of nearly 25 percent. Memecoin dogwifhat (WIF) turned out to be the biggest loser, with a 24-hour dip of nearly 7 percent.\n\nThe global crypto market cap stood at $2.72 trillion at the time of writing, registering a 24-hour gain of 4.72 percent.\n\nBitcoin (BTC) Price Today\n\nBitcoin price stood at $71,871.57, registering a 24-hour gain of 4.77 percent, as per CoinMarketCap. According to Indian exchange WazirX, BTC price stood at Rs 62.10 lakh.\n\nEthereum (ETH) Price Today\n\nETH price stood at $4,039.04, marking a 24-hour gain of 4.79 percent at the time of writing. As per WazirX, Ethereum price in India stood at Rs 3.50 lakh.\n\nDogecoin (DOGE) Price Today\n\nDOGE registered a 24-hour jump of 4.81 percent, as per CoinMarketCap data, currently priced at $0.1741. As per WazirX, Dogecoin price in India stood at Rs 14.90.\n\nLitecoin (LTC) Price Today\n\nLitecoin saw a 24-hour gain of 14.24 percent. At the time of writing, it was trading at $99.21. LTC price in India stood at Rs 8,456.52.\n\nRipple (XRP) Price Today\n\nXRP price stood at $0.6922, seeing a 24-hour jump of 13.95 percent. As per WazirX, Ripple price stood at Rs 59.72.\n\nSolana (SOL) Price Today\n\nSolana price stood at $153.76, marking a 24-hour gain of 9.10 percent. As per WazirX, SOL price in India stood at Rs 13,150.\n\nTop Crypto Gainers Today (March 12)\n\nAs per CoinMarketCap data, here are the top five crypto gainers over the past 24 hours:\n\nToncoin (TON)\n\nPrice: $3.48\n\n24-hour gain: 24.79 percent\n\nAvalanche (AVAX)\n\nPrice: $48.08\n\n24-hour gain: 15.69 percent\n\nLitecoin (LTC)\n\nPrice: $99.74\n\n24-hour gain: 14.94 percent\n\nRipple (XRP)\n\nPrice: $0.6943\n\n24-hour gain: 14.31 percent\n\nSynthetix (SNX)\n\nPrice: $4.75\n\n24-hour gain: 12.63 percent\n\nTop Crypto Losers Today (March 12)\n\nAs per CoinMarketCap data, here are the top five crypto losers over the past 24 hours:\n\ndogwifhat (WIF)\n\nPrice: $1.97\n\n24-hour loss: 6.36 percent\n\nGala (GALA)\n\nPrice: $0.07363\n\n24-hour loss: 3.55 percent\n\nSingularityNET (AGIX)\n\nPrice: $1.25\n\n24-hour loss: 3.14 percent\n\nThe Graph (GRT)\n\nPrice: $0.4382\n\n24-hour loss: 2.92 percent\n\nFetch.ai (FET)\n\nPrice: $2.74\n\n24-hour loss: 2.92 percent\n\nWhat Crypto Exchanges Are Saying About Current Market Scenario\n\nMudrex co-founder and CEO Edul Patel told ABP Live, “Bitcoin jumped above the $72,000 level in the past 24 hours with its market capitalization rising to $1.42 trillion surpassing that of silver at $1.38 trillion. The positive momentum in the market is attributed to growing interest in Bitcoin spot ETFs and the approaching Bitcoin Halving event, which has historically impacted the price of Bitcoin. Bitcoin has been up by 250% since the past year. There has been a steady rise of mainstream acceptance and investments from both retail and institutions since the Bitcoin spot ETF approval. The next resistance is at the $76,000 level. On the other hand, Ethereum also surged above the $4,000 level rising 174% in the past year.”\n\nCoinSwitch Markets Desk noted, “Crypto markets continue to surge amidst volatility. The overall M.Cap has ballooned over $2.8 trillion, with all-time highs of Crypto M.Cap now in sight at just above $3 trillion. Bitcoin (BTC, +4.5%) was able to successfully move past the $70k resistance level, and now trading near the $72k mark. Similarly, Ethereum (ETH, +4.7%) moved past the $4k level and now trading above this level. The broader market is in the green, while the fear and greed index continues to be in the ‘Extreme Greed’ signifying a very strong investor sentiment.”\n\nRajagopal Menon, Vice President, WazirX, said, “Bitcoin's Exchange-Traded Fund (ETF) volumes continue to uplift market sentiment, driving the token to an all-time high amid increased adoption. Despite awareness of potential pre-halving corrections, investors maintain optimism regarding the token's price trajectory. In the last 24 hours, Bitcoin's Hull Moving Average has transitioned into a 'Buy' sentiment, coinciding with significant gains in Litecoin, Ripple, and STX. While uncertainties linger around Ethereum ETFs, the token is witnessing gains as part of the broader market surge, showcasing resilience and positive momentum. Investors remain attentive to developments in this dynamic market landscape.”\n\nSathvik Vishwanath, CEO and co-founder of Unocoin, said, “Institutional involvement, exemplified by BlackRock's large bitcoin holdings and the SEC's approval of ETFs, is reshaping the bitcoin story. As BlackRock's ETF outperforms MicroStrategy's holdings, institutional interest is driving Bitcoin's rise. MicroStrategy remains committed to strengthening its Bitcoin reserves, reflecting the company's growing belief in the long-term value of Bitcoin. Bitcoin's current rise to $72,500 underscores its market dominance, with technical indicators pointing to a bullish trend. Resistance levels at $73,824, $76,749 and $79,904 pose challenges, while support levels at $67,154, $64,861 and $62,192 offer cushions against downside. Despite potential overbought conditions, Bitcoin's break above $70,000 and bullish candlestick patterns indicate an upward trajectory, with a target above $73,800. The 50-day EMA at $66,860 reinforces this bullish sentiment and suggests a positive outlook for Bitcoin above $72,200.”\n\nShivam Thakral, CEO of BuyUcoin, said, “Bitcoin's price surpassed $72,000 on Monday, creating a new ATH at $72,800. The largest cryptocurrency now has a total market cap of $1.4T, surpassing silver to become the world's eighth most valuable property. MicroStrategy purchased an additional 12,000 BTC for approximately $821.7 million in cash. This takes MicroStrategy's Bitcoin holdings to over 205,000 BTC. The crypto market continues to demonstrate remarkable growth and adoption worldwide.”\n\nCoinDCX Research Team told ABP Live, “In the past 24 hours, the crypto market remained bullish as BTC surged to a new all-time high of $72,800 and ETH reached a new yearly high. Alts also experienced significant upside moves. BTC's stability at this high level indicates strong underlying strength, with futures open interest also rising sharply. This stability in BTC led to 5-10% gains in altcoins, with Layer 1 tokens leading the charge. ETH nearly touched $4,100 and is currently consolidating around that level. Additionally, the ETH/BTC pair is showing major support, suggesting that ETH may take the lead in the near term. The next key level for ETH to watch is $4,380.”\n\nSubscribe And Follow ABP Live On Telegram: t.me/officialabplive\n\nDisclaimer: Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Cryptocurrency is not a legal tender and is subject to market risks. Readers are advised to seek expert advice and read offer document(s) along with related important literature on the subject carefully before making any kind of investment whatsoever. Cryptocurrency market predictions are speculative and any investment made shall be at the sole cost and risk of the readers."
    },
    {
        "id": 92,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxQcGI1WFY3ZjZUVnFwN0JpclBaSUhvaUtoMGNyeUpMZF92c19xOHFlbE5KM3ZLb2VwdDNiR0hreExpTC12SFBKUWdFUVVLNWJaQ1JqZDhvYmFUbGRjNGpEZU90MUFSeW1TVWZaaFFMNkdZcm80Y05PdjVCQ3Vzc25JSkVhT3o2NVBtbzJNbG9fcHFNS2M3M1daU3NoVdIBoAFBVV95cUxNUm85MTVKVXZGSnlYczc3WllQOEY4Nm1iMTB0MnMwb0h4ckUwekt0Z2V0enlBUXpQcnRqR0x0MlNlRHY2aU5EUVBaNFktR1hYNExiSWRwQVIwbnhWMHpTVjhpMWtXMDlpNVRpYkozQWx0YXRnTi1UUldjRUJnLXVEajJ0dGZHbGQ2ZE9vX2ZYbkFsdDNrVVc5YmkxSmpubEQ1?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 11 Mar 2024 07:00:00 GMT",
        "title": "Bitcoin Ethereum And XRP Price Prediction For Coming Week! - Coinpedia Fintech News",
        "content": "Elena is an expert in technical analysis and risk management in cryptocurrency market. She has 10+year experience in writing - accordingly she is avid journalists with a passion towards researching new insights coming into crypto erena.\n\nThe crypto industry concluded the first week of March positively with top tokens adding significant value to their respective portfolio. Further, the price of Bitcoin successfully achieved a new all-time high (ATH) of just over $70,000 on 08th March.\n\nThe leader of altcoins, Ethereum (ETH), has added over 14% to its portfolio during the previous week. Ripple (XRP) token on the other hand has successfully recovered its losses during this week, indicating an increase in the bullish influence within the crypto market.\n\nBitcoin (BTC):\n\nThe market leader, Bitcoin, traded in a closed range between $47,705 and $50,540 for a while, following which the bulls recorded a jump of 9.35%. However, the price faced rejection at $52,853, after which the price traded sideways for the next twelve days. As the market volatility grew, the BTC price jumped 27% within the next two days.\n\nAfter displaying a neutral trend for five days, the BTC token jumped 11.33%, recording a new ATH. Following this, the bulls lost momentum and recorded a correction of over 10%. The bulls quickly regained momentum, resulting in a bounce back in the chart.\n\nTradingView: BTC/USDT\n\nThe Moving Average Convergence Divergence (MACD) displays a constant flatline in the chart, indicating a neutral trend for the coin in the crypto market. Further, the averages show a similar trend, indicating an uncertainty in future price action.\n\nIf the bulls hold the price above the support level of $68,296, the price will continue to gain momentum and attempt to test its upper level of $72,000 during the coming week. However, a negative trend reversal may pull the price toward its support level of $64,287.\n\nEthereum (ETH):\n\nThe Ethereum price displayed a neutral trend for a while, after which the market gained momentum and the ETH token recorded a jump of over 8% in value. After trading sideways for a while, the bulls regained momentum and the price jumped 22.5% over the next five days.\n\nFollowing this, the price traded sideways for the next few days. After testing its low of $3,176, the ETH price regained momentum and recorded a jump of over 24% and since then the price has been trading in a closed range.\n\nTradingView: ETH/USDT\n\nThe technical indicator, MACD, displays a rising red histogram, indicating an increase in the selling pressure in the market. Moreover, the averages show a bearish convergence, suggesting the price may continue losing value in the coming time.\n\nIf the market pushes the ETH price above the resistance level, the bulls will regain momentum and prepare to test its upper resistance level of $4,200 in the coming days. Conversely, if the bears overpowered the bulls, the price would lose momentum and fall to test its support level of $3,533.\n\nRipple (XRP):\n\nThe XRP price traded in a consolidated range between $0.530 and $0.5626 for a brief period during which the token displayed significant volatility in its price. As the bulls regained momentum, the Ripple price added approximately 25% over the next seven days.\n\nUpon facing rejection at $0.6624, the Ripple token traded under a bearish influence and recorded a correction of 14% in valuation. After testing its low of $0.5626, the XRP price recorded a jump of 11.80%. Since then, it has been attempting to break out of its important resistance level at $0.6290.\n\nTradingView: XRP/USDT\n\nThe MACD shows a neutral trend in the histogram, highlighting a weak buying and selling pressure in the market. However, the averages show a bullish convergence, suggesting a mixed sentiment in the crypto industry.\n\nIf the market holds the XRP price above the support level of $0.6290, the bulls will continue to gain momentum and prepare to test its upper resistance level of $0.680 by the coming weekend. Negatively, a bearish trend may pull the price toward its lower support level of $0.583."
    }
]