[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxOZEc2bDFGVW5VakR6YldBTHBmZVlwNk5XRW1pQ3ZXTENhSWpySUNTbC1EZkVkUlgxYnhZcWlIZkhLTXJuU055V1d5UF9Hc3ZIaDlXUmhfVXVxdXdjZXBxdEVuY3dUb3UwN2ZGQkVnbmlHak8zMmd1Tllxdm9vQW44RG1rUlhwcExGRGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Jun 2024 07:00:00 GMT",
        "title": "What are the factors that can push Ethereum’s price upwards? - The Gila Herald",
        "content": "Ethereum’s price has grown significantly since January 2022, reaching high values. But what led to this change? Some say that the increase in Ethereum’s value has appeared thanks to speculations about a potential spot Ethereum ETF, an idea that emerged after the introduction of spot Bitcoin ETFs.\n\nAdditionally, people are optimistic about Ethereum’s future due to the successful implementation of the Capella Hard Fork and Shanghai upgrade, which increased its value quickly. Ethereum price prediction looks positive, as the second-largest cryptocurrency could finally reach the $4K mark. Here are some good factors that could drive its price upward.\n\nIncreasing interest from people\n\nOne of the main reasons behind the rise in Ethereum’s price is the increasing interest of people both in the digital coin and in the innovations brought by the blockchain, including decentralized finance (DeFi), smart contracts, and NFTs. For example, DeFi applications allow people to borrow and lend digital coins, which have attracted a lot of interest lately, thus driving more demand for Ether. Plus, more major corporations have become interested in digital coins, which drives demand for the second-largest digital currency by market cap. Large companies, like JPMorgan Chase and Microsoft, have become interested in the Ethereum network, which has increased individuals’ confidence in investing in Ethereum.\n\nA reduced supply in the crypto exchanges\n\nAnother thing that pushed Ether’s price upward is the reduced supply on crypto exchanges. Individuals who buy digital currencies can keep their cryptocurrencies in exchange wallets or opt for a cold storage wallet. Now, the data shows that people have started withdrawing their digital currencies from crypto exchanges, meaning that investors don’t intend to sell the digital coin soon, as they expect a price increase in the future. This happened in October 2023, when people withdrew the digital coins from the crypto exchanges, which accompanied a 130% raise in the price of Ether.\n\nThe Dencun Upgrade\n\nThe Dencun Upgrade, which occurred in March, can also increase the price of Ethereum, as with this upgrade, Ethereum improves its efficiency and scalability. The Dencun upgrade comprises two different upgrades, “Cancun” and “Deneb,” and it will introduce the notion of proto-dank sharding, which reduces the cost of transactions because of layer two solutions. The upgrade has brought positive changes in the price of Ethereum, as the virtual coin has increased its value since the upgrade occurred.\n\nThe Spot ETF\n\nPeople have perceived the approval of the spot Bitcoin ETF as a major milestone in the crypto industry, as this proves that BTC is an important asset, and more individuals will be able to invest in the largest digital coin without involving the complexities of the crypto technicalities. The spot Bitcoin ETF approval made people believe that an Ethereum ETF approval is next to come. Additionally, all the hype surrounding Bitcoin for the spot ETF event can be a catalyst that could push the prices of Ethereum upward.\n\nStaking\n\nEthereum functions on a Proof-of-Stake consensus mechanism, where validators must stake at least 32 ETH to make the blockchain function and validate new transactions. At first, Ethereum functioned on a Proof-of-Work (PoW) model, but it changed as this consensus mechanism raised concerns about the negative impact that this measure would bring to the environment because of the huge electric consumption that the mining process required. However, the transition to the PoS model made Ethereum more interesting to investors, thus increasing its price.\n\nIf 2023 and 2022 were years when Ethereum experienced a drop in staked assets, 2024 could be a better year, as it already looks positive, which could benefit investors from a long-term bullish outlook. Additionally, an increase in staking could reduce sell-side pressure on the crypto market. Usually, investors stake the tokens they don’t intend to sell in the future, expecting the prices to grow.\n\nHow can Ethereum perform in the future?\n\nEthereum is not only a blockchain that powers Ether, the native coin of the network, but also a platform with a lot of capabilities, as it has many features, including dApps, NFTs, smart contracts, DeFi, and others.\n\nEven if, in the past, Ethereum prices seemed to drop, now it looks like the prices are going upwards, and ETH could reach $5,000 by the end of 2024. However, the future looks bright for 2025 as well, where ETH will have an average of $5,500, a maximum of $6,500, and a minimum of $4,500. In 2030, Ethereum might even experience a maximum of $20,500. In 2030, Ethereum could finally hit the $10,000 mark, where the price will go on an upward trend. This is why ETH might even be able to surpass its all-time high of $12,000 levels and prepare the crypto world for a new record.\n\nCan Ethereum outperform Bitcoin?\n\nAs the crypto space is very volatile, every scenario can happen, which is why people have even said that Ethereum might be able to outperform Bitcoin. Ethereum is a unique blockchain, and because of this, it will have a stable future and might perform better than the largest crypto king. Still, it is not very likely that Ethereum will surpass the price of Bitcoin, but it is more probable to reach a comparable market capitalization because ETH doesn’t have a capped supply, unlike Bitcoin.\n\nConclusion\n\nEthereum is the second-largest digital currency by market cap, after Bitcoin, and because of all its innovations and capabilities, Ether is here to stay. As Ethereum goes through continuous growth with all the constant upgrades, people believe that both 2024 and the following years will be good for the cryptocurrency, as ETH will probably become more popular, increasing investors’ confidence."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQSldxVmJ4ak01NlZEcDRxZ0FLdkVBTVg4ZksyU1lYQ2JaclBJanNPSElPWjc4UUc0NGJHRWpUSU9tdndOVmM4aUF0emJVRnlqN2dVU3dwQXZQaVg2MjYtdzZvZk9keHlSYjVnYTgzS2VQLWR6STJMNG9OOUoyX0hNRk5Ta2dOQ0hTR1E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Fever Rises as Issuers Propose New ETFs - Yahoo Finance",
        "content": "ETF Investing Tools\n\nEthereum fever has ticked higher over the past two trading days with two companies submitting applications for new funds based on the performance of ether, and a third issuer setting its fee for a proposed spot Ethereum exchange traded fund.\n\nRex Shares proposed separate long and inverse ETFs that depend on the performance of yet-to-debut spot Ethereum funds. A Roundhill Ether Covered Call Strategy ETF fund aims to provide income but also \"exposure to the price return of one or more exchange-traded funds with exposure to ether.\"\n\n\"The Fund will purchase and sell a combination of call and put option contracts that utilize an Ether Futures ETF as the reference asset,\" Roundhill's S-1 registration statement said.\n\nNeither the Rex nor the Roundhill products will invest directly in ether, the native cryptocurrency of the smart contracts Ethereum blockchain.\n\nArk, Franklin Templeton\n\nIn separate, updated S-1 filings, Franklin Templeton announced that it would charge a 0.19% fee for its proposed spot Ethereum ETF, but Ark Investment Management was absent from its latest filing for a similar product that it had initially proposed with 21Shares, which is now listed as the sole issuer for the product.\n\nThe latest developments come as the Securities and Exchange Commission weighs spot Ethereum applications from eight issuers, and amid demand for cryptocurrency-focused assets that has soared this year following the approval of the first spot bitcoin ETFs.\n\nRead More: SEC Changes Ethereum Rule, Sets Stage for ETF Approval | etf.com\n\nLast month, the regulator permitted a rules change that significantly increased the likelihood that the new spot Ethereum products will begin trading in the not-so-distant future. The spot bitcoin products have generated almost $14 billion in inflows since they debuted on Jan. 11, according to U.K.-based Farside Investors.\n\nEther was recently trading at $3,780, up a few fractions of a percentage point over the past 24 hours, according to cryptocurrency markets provider CoinMarketCap. It has risen 23% during the past month as optimism about a spot Ethereum approval has grown. Bitcoin also rose slightly from the previous day.\n\nT-Rex's New Funds\n\nThe T-Rex 2X Long Ether Daily Target ETF and T-Rex 2X Inverse Daily Target ETF will aim to meet daily investment objectives that, respectively, \"magnify\" the performance of ether and the inverse of to ether's performance with the latter \"a result opposite of most mutual funds and ETFs,\" according to the S-1. The funds will not invest directly in ether.\n\nStory continues\n\nMeanwhile, Ark said in a statement that it continued to believe in \"the transformative potential and the long-term value of the Ethereum blockchain,\" but that would \"not be moving forward with an Ethereum ETF.\"\n\n\"We will continue evaluating efficient ways to provide our investors with exposure to this innovative technology.\"\n\nIt also said that it would remain \"fully committed\" to the spot bitcoin ETF, which it issued jointly with 21 Shares and that has generated about $2.5 billion in inflows since its January unveiling.\n\n\n\n\n\nPermalink | © Copyright 2024 etf.com. All rights reserved"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiaEFVX3lxTE9iczZ3R2k5cEFYNjlqaTRhMDBoODhMWHR0LTBhZGFpS2xVTnlUUVpYaF9Md0tXbUprZklLdEh0eXE3RWQ2WUMwWmdYU0NwbGVWdDlULWdqMVpFVllsWUV4aV9iZmVCZlJh?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Jun 2024 07:00:00 GMT",
        "title": "Ethereum options traders turn bullish following ETF approval, says Nansen analyst - Crypto Briefing",
        "content": "Ethereum ETF nod spurs $33.5M inflow, options market turns bullish.\n\nShare this article\n\nThe approval of spot Ethereum (ETH) exchange-traded funds (ETF) in the US on May 23 made ETH options traders more bullish, according to Aurelie Barthere, Principal Research Analyst at Nansen. Despite failing to spark a significant spot market upside, the implied volatility of call and put options on ETH has decreased slightly since the approval.\n\nYear-to-date implied volatility of call and put options on ETH, 90-day plus expiry. Image: Nansen\n\n“Funding rates are neutral now, though the recent news about ETH ETF has led to ETH call prices jumping relative to put. So, options traders are now bullish ETH. ETH put options were the most expensive YTD, in absolute terms and relative to call options, on March 28, 2024 (option traders most bearish). After this date, put option prices declined till May 16, and then recouped some of this decline (possibly in anticipation of the ETF approval). Call options have been more expensive than puts in the last few days, which is to be expected,” stated Barthere.\n\nTherefore, traders could use the relatively cheap implied volatility to hedge against the scenario where the ETH price tops, the Principal Research Analyst at Nansen added. “Looking at the z-score of the difference between calls and puts could be used as a mean-reverting strategy.”\n\nImplied volatility of call and put options on ETH, 90-day plus expiry in 2020. Image: Nansen\n\nEthereum metrics spike\n\nEthereum-related funds registered negative $22 million in year-to-date flows until May 25. However, the ETF approval attracted investors, with ETH-indexed exchange-traded products (ETP) registering $33.5 million in inflows last week. As a result, these ETP flows are positive again in 2024.\n\nMoreover, the total value locked (TVL) on Ethereum-based decentralized applications has risen 21% in the last 30 days, according to data aggregator DefiLlama, amounting to over $116 billion and granting 70% dominance in the decentralized finance ecosystem."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPdnNXTXNReHpCYXBUTzV2R1BOMUxuYndibW5UYlFUQl9VMXRhQWkycm5RaFNfeHB3LW5kRFVkY1EtWFJZcnFXSnowV19XazBWNEMzZk1EY2ZfY01nblVHTnNfT3owQ1U0TlNtVTBPcnpKRmVfQ29XLWhaODMzTTVab2s4YjkyR0FKUHJ0LUVB0gGTAUFVX3lxTE5iTzZ0eTJZSXg0enNzOGdOMDRKWTVzb2U4NU5tUG9tOGdCZzlBY0l2ZVFaRjFlVG8xQWNXYXJkUFMxWlNWNnJVbEpOb1dwNFJ6RTR5Sl80TTRYU2FlMjA1bXlTbkJzQzBpQUNKZ2NtRDBSdWluOTkzYVR5ZEVFcklHQnllMlY4c2xFeXlxWHU3cVZKYw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 04 Jun 2024 07:00:00 GMT",
        "title": "Will Ethereum break through $4k in June? Key indicators to watch - AMBCrypto News",
        "content": "Ethereum’s price inching closer to $4k as key indicators hint at a potential breakthrough.\n\nMarket sentiments are bullish as Ethereum’s long positions outweigh short positions.\n\nAfter breaking out of the bullish flag Ethereum [ETH] tested $3.7 three times, a resistance level that has turned into a support level since 21st May.\n\nThe bulls have not yet accumulated enough momentum to push the price over Ethereum’s all time high of $4k, but now they can glimpse the target point.\n\nThe price is building a bullish momentum that has pushed ETH’s price from $3.7k to the press time price of $3.8k, in the last three days, representing a 3.94% increase. If the run continues, Ethereum price may hit its all time high at $4k.\n\nWhales spikes or social likes steering Ethereum?\n\nAMBCrypto analyzed the Santiment social volume and whale transaction chart.\n\nThe whale transaction chart indicated an increase in whales, which increased price peaks recently. The involvement of large holders indicated a bullish rally in the price.\n\nThe social volumes correlated with the price spikes indicating an increased market interest and discussion in the social media platforms, which may lead to a price surge.\n\nAMBCrypto also analyzed Ethereum’s long/short ratio, indicating a notable increase in the long positions compared to the short positions. This suggested that traders are increasingly bullish on ETH.\n\nThe stochastic relative strength indicator (45.59) indicated that Ethereum was neither overbought nor oversold.\n\nIs your portfolio green? Check the Ethereum Profit Calculator\n\nThis neutral position may leave room for a potential price surge or drop. The MACD histograms show a positive momentum, with the MACD line above the signal line indicating a bullish trend.\n\nThe MACD value of 1.67 further supports the upward momentum."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxQZ0lRM1pIelYzSlQ4WmwwRzdpS3RvTkY3YzJFV3dMSWNCdVhCdi1DUHgzbkNhX3ZucWxjamJNY2N2emhfWnNDOTlpLTU0UlhSMFI3SGdOWEpWajhCZFBaU3B6YWE4SE1vaFJSOWVnYV82OGRiNVllTW9TblhJWm5jNUFwaGZzQWt1dFo1eDZkRFZ0a3UtZ3hnMG1DRmdmMVZTOHVPTDV6UWswaFNpZzdOQnl2bkRfVHlxT09EYWNCS2p6bnPSAcgBQVVfeXFMT1EwWlJQM0h2ZzhUUURQNWRaMW1lb1Z1SEZ3R3VnZGZ4VE1ObHVtall1aG1kbFBNc0dTam5SZGpReGM0dWs0R2VnVkhUQWpiNEt0SXA4Q09vSl95OThjZXlMaEtXTmFJdi1wSzA2WE1meTVrZWRGano5UE0wazhPWW1hT1pZdEJ5YTJaNlBxVUdfVjcxMGNBNUx2SzRpRjdJYlRNWG1QbWNnWFZvWWR0MFZ6THJ3Z04tMU5aaWJXcHlVYml1SVhSajg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 04 Jun 2024 07:00:00 GMT",
        "title": "Ethereum leveraged ETFs go live as price fails to react - FXStreet",
        "content": "Volatility Shares leveraged Ethereum ETFs have officially launched for trading on the Cboe.\n\nEthereum options implied volatility surpasses Bitcoin as investors anticipate launch of spot ETH ETFs.\n\nEthereum could see a new all-time high of around $5,000 following the official launch of spot ETH ETFs.\n\nEthereum (ETH) sustained its sideways trend again on Tuesday following the launch of Volatility Shares leveraged ETH ETFs and an increase in implied volatility across ETH options.\n\nDaily digest market movers: Leveraged ETH ETFs increase Ethereum implied volatility\n\nEthereum surpassed Bitcoin in a key derivatives metric on Tuesday.\n\nThe 2x Ether ETF (ETHU) launched on Tuesday after the Security & Exchange Commission’s (SEC) approval as Fox Business’s Eleanor Terrett confirmed. The ETF, which is the first leveraged Ethereum ETF in the US, will track twice the price performance of futures ETH.\n\n\"Like our 2x Bitcoin ETF (BITX), ETHU may pave the way for 1x spot ETFs in the near future,\" said company cofounder Stuart Barton in an interview with Eleanor Terrett.\n\nAlso read: Ethereum sustains week-long consolidation, sees over $3 billion exodus from exchanges\n\nVolatility Shares is one of the largest holders of Bitcoin futures contracts at the Chicago Mercantile Exchange (CME) after launching a Bitcoin 2x fund in June 2023. With ETHU's launch, many have speculated that the SEC will likely approve spot ETH ETFs S-1 registration statements in the coming weeks.\n\nMeanwhile, according to QCP Capital, Ether options are experiencing high implied volatility compared to Bitcoin as the anticipation surrounding the launch of spot ETH ETFs is causing prevailing bullish sentiment among investors.\n\nImplied volatility indicates how much the market expects the price of an option to change within a given timeframe.\n\nRead more: Ethereum on-chain and derivatives data indicates bullishness following updated ETH ETF S-1s from issuers\n\n\"This bullishness is likely to continue as the market waits for the ETH spot ETF to usher in new demand. The options market certainly reflects this, with ETH vols still trading 15% over BTC vols,\" said QCP analysts.\n\nETH technical analysis: Ethereum to set new all-time high in next major move\n\nEthereum's horizontal trend is gaining strength daily as it continued moving sideways, trading at $3,796 on Tuesday. The consolidation has also seen a decline in ETH liquidations, with long liquidations at $6.33 million and shorts at $4.08 million.\n\nWith derivatives data indicating bullishness, ETH is unlikely to experience any major decline. The $3,618 level may prove crucial in case of a potential dip.\n\nETH/USDT 8-hour chart\n\nETH's next major move will likely follow an upward trajectory to break the $4,093 resistance. Considering ETH's current consolidation, it may see a major rally to a new all-time high of around $5,000 if or when the SEC gives the go-ahead for spot ETH ETFs' official launch.\n\nAlso read: Ethereum price lags, investors potentially reallocating capital after BlackRock's updated S-1 filing\n\nETH options data also aligns with this prediction, with several June call options hovering around the $5,000 level. The bullish thesis will be invalidated if ETH falls below the $3,301 key support."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxOMkUwdmNEU1ZnQTR6M0pUM1cza2tEVWpxTDRxbkJrRjBpa0N6cGZZelY0SGllTWJnb2lhVGRaV05YSHhMWEJQbGU5bld0Sm9Bb3dRd2lwWE5ucG5fWWpzbnBJZnMxU1pyZHoxMGp3ZVdNVVl5S3F3WDk5b3pZaXVWY0szR3AxejRW?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Jun 2024 07:00:00 GMT",
        "title": "$3B ETH Withdrawals from Exchanges Signal Potential Supply Squeeze for Ethereum - Yahoo Finance",
        "content": "$3B ETH Withdrawals from Exchanges Signal Potential Supply Squeeze for Ethereum\n\nFollowing the U.S. approval of spot Ethereum (ETH) exchange-traded funds (ETFs) on May 23, over $3 billion worth of Ether has been withdrawn from centralized crypto exchanges, hinting at a possible future supply squeeze. CryptoQuant data reveals that between May 23 and June 2, approximately 797,000 Ether, valued at $3.02 billion, were moved off exchanges.\n\nThis significant reduction in exchange reserves suggests that investors are transferring their Ether to self-custody solutions, indicating a preference for holding over immediate selling. Fewer coins on exchanges typically imply reduced availability for sale, which can lead to tighter supply conditions. Supporting this trend, data from Glassnode, shows that the percentage of circulating Ether held on exchanges has dropped to its lowest level in years, now standing at just 10.6%.\n\nThe approval of Ether ETFs has sparked considerable interest, with Bloomberg ETF analyst Eric Balchunas suggesting that these ETFs could realistically launch by late June. Some market analysts predict that the introduction of spot Ethereum ETFs could propel Ether to surpass its all-time high of $4,870, set in November 2021.\n\nHowever, concerns remain about the potential impact of Grayscale’s Ethereum Trust (ETHE), which manages $11 billion in assets. If it follows the pattern of the Grayscale Bitcoin Trust (GBTC), which saw $6.5 billion in outflows shortly after approval, it could significantly influence ETH’s price dynamics."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxPZENNS0VjYk1kSDFFWjROV0FWTkQzaEt6cWlHcGw4NVVBVC1UOWVnaV8welhIY1k0UHJ3QVE4RVJPU2UzVDZZLWpkc05VMjl0cXJIYUlpTm1fdTlibHNqWHktdHBPOHJqeVE3VzBfSWszY0lxRnpuXzhUajd6eV9XbjZJcnotNTcyeU9TWHJ3LWh4VmwxS2VVcDBoWXVld1RkY1B0cWZmbHFEUmdTcmk3bmR5UGZKS0pZQ1E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 04 Jun 2024 07:00:00 GMT",
        "title": "What The Ethereum ETF Means For Altcoins And Meme Coins - Benzinga",
        "content": "The much-anticipated launch of a spot Ethereum ETF has analysts divided about its impact on altcoins, meme coins and competing Layer-1 (L1) blockchains.\n\nA Double-Edged Sword For Altcoins:\n\nThe potential influx of new investors drawn by the funds could lead to a “rising tide lifting all boats” scenario, according to analysts.\n\nEstablished altcoins with strong utility functions, like Cardano ADA/USD and Polkadot DOT/USD, which power smart contracts and decentralized applications (dApps), could experience significant price increases.\n\nThese projects offer real-world solutions and have established developer communities, making them attractive options for investors seeking exposure to the broader blockchain ecosystem beyond just Ethereum.\n\nHowever, analysts also warn of a potential “flight to quality.”\n\nNew investors, unfamiliar with the intricacies of the crypto space, might prioritize the perceived stability of Ethereum over riskier altcoins.\n\nThis could lead to a temporary decline in the prices of smaller altcoins, especially those struggling with scalability or unclear project roadmaps.\n\nWill Meme Coins Benefit?\n\nMeme coins, the internet’s darlings like Dogecoin DOGE/USD and Shiba Inu SHIB/USD, are a unique case.\n\nPlatforms like Binance and Square anticipate a meme coin frenzy fueled by increased interest in the crypto space.\n\nThis could lead to short-term price spikes for these highly volatile assets.\n\nHowever, other analysts believe this might be a short-lived phenomenon.\n\nMeme coins often lack strong utility and rely heavily on social media hype.\n\nAs the market matures, investors might prioritize projects with long-term value propositions and proven technologies.\n\nA “meme coin top” could be on the horizon, with only the strongest meme coins with real-world applications or unique features surviving the long haul.\n\nAlso Read: Roaring Kitty Return Yields Investor $300K Unrealized Profit On Ethereum-Based GME Meme Coin\n\nWill Ethereum Outperform Solana?\n\nThe rivalry between Ethereum ETH/USD and Solana SOL/USD for dominance in the smart contracts space continues to be a focal point.\n\nThe immediate impact of the Ethereum ETF could see the price of ETH surpass all time highs due to increased investor interest.\n\nHowever, the playing field might level out in the long term if a Solana ETF receives regulatory approval.\n\nUltimately, the success of both platforms hinges on their ability to address scalability issues.\n\nEthereum’s upgrade to Ethereum 2.0 promises significant improvements in transaction speeds and fees.\n\nSolana, on the other hand, boasts impressive speed and low fees but faces challenges regarding network congestion and potential centralization.\n\nOnly the platform that can provide a balance of speed, security, and scalability will truly dominate the smart contracts space.\n\nLayer-1 Blockchains: A Potential Resurgence?\n\nThe recent struggles of Layer-1 blockchains like Avalanche AVAX/USD and Cardano have raised concerns about their future.\n\nWhile the ETH ETF might initially divert attention away from these projects, a broader market surge could benefit established L1s with unique functionalities.\n\nFor example, Avalanche offers high transaction speeds and low fees, while Cardano boasts a strong focus on security and a research-driven approach.\n\nThese projects need to attract developers and build robust decentralized ecosystems to thrive.\n\nL1s that can carve out a niche within the blockchain landscape, offering genuine alternatives to Ethereum, are more likely to experience a comeback.\n\nThe Takeaway: Navigating A Dynamic Market\n\nThe arrival of the ETH ETF marks a significant shift in the cryptocurrency market, with potential benefits and drawbacks for different sectors.\n\nFocus should be placed on the specific use cases, technological advancements, development roadmaps, and community engagement of different projects.\n\nBeyond the immediate impact of the ETF, staying informed about regulatory developments and technological innovations is crucial for navigating the Web3 space.\n\nWhile meme coins might offer a fleeting thrill, established altcoins and L1s with strong development teams and clear value propositions could be better bets for long-term gains.\n\nThese issues and a lot more will be discussed at Benzinga’s Future of Digital Assets conference on Nov. 19.\n\nRead Next: MicroStrategy And Michael Saylor Settle $40 Million Tax Fraud Lawsuit\n\nImage: Shutterstock"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxNSzhkVnR6bDFZNzc4eUhXX1Q5NVMzTjdsenl5WDlsN3VQWnVSVF9kRFIyS0FYOUFWMlZMZy1oWTZOTHZ6OXh5LTRMODQwQVJacjdXTFY4VXNJcjFJQktnQ1IwQUt2QmhuUVNrMi1FN3Vja1ptVkxzam5aUFY0UzlpTjlvSVlOZnI4eGk3SG4zcmVZNG9LN1lTd1ZmbTlTUE41?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 04 Jun 2024 07:00:00 GMT",
        "title": "Spot Ethereum ETFs will legitimize crypto, lead to ETH supply crunch – Integral - CryptoSlate",
        "content": "The launch of spot Ethereum ETF will potentially result in a supply crunch upon launch, crypto accounting software firm Integral on June 3.\n\nThe projection mirrors the sentiment around spot Bitcoin ETFs before their launch earlier this year. The ETFs connected to the flagship crypto have since experienced record inflows, with the BTC supply on centralized exchanges falling notably in tandem.\n\nEthereum supply crunch\n\nIntegral anticipates that ETF issuers will buy and hold large amounts of ETH, thereby removing a portion of ETH from the open markets and driving up the crypto’s price.\n\nThe trend is arguably already underway. Integral cited crypto entrepreneur Oliver Isaacs, who revealed that more than $3 billion of ETH had left exchanges since the SEC approved spot ETH approvals on May 23 — putting ETH exchange reserves at a six-year low.\n\nIntegral said that separate staking trends will intensify the supply crunch and noted that about 25% of the ETH supply is currently staked. ETF issuers will not engage in staking directly, but staking participants stand to benefit from rising prices, according to the company.\n\nAdditionally, Integral believes that approvals will increase institutional adoption of ETH and validate crypto as a legitimate asset class. Furthermore, it said that approvals could spark an “altcoin season” as demand for ETH spills over into other cryptos.\n\nSpot ETH ETFs are expected to launch in the coming weeks or months.\n\nIBIT accounts for 25% BlackRock flows\n\nMany are waiting to see whether Ethereum will follow the trend set by Bitcoin after ETFs connected to the flagship crypto began trading in January.\n\nThe Newborn Nine spot Bitcoin ETFs have cemented Bitcoin as a viable investment option in the traditional financial industry, as evidenced by their staggering and continued growth. BlackRock and Fidelity‘s IBIT and FBTC stand out in particular, following a record-setting streak of inflows in the history of ETFs.\n\nThe two funds now account for a significant portion of the overall ETF flows for both asset managers.\n\nBloomberg ETF analyst Eric Balchunas said BlackRock’s IBIT accounted for 26% of the company’s $65 billion ETF inflows since the start of the year. Notably, BlackRock is the largest ETF issuer in the US, with 429 exchange-traded funds under its belt.\n\nIBIT has recorded total inflows of $16.7 billion since its launch.\n\nMeanwhile, Fidelity’s competing FBTC fund accounts for 56% of its $15.8 billion total ETF flows this year. FBTC has seen $8.9 billion in total inflows to date.\n\nFidelity has launched and manages 70 ETFs.\n\nBalchunas’ data indicates BlackRock and Fidelity are the second and fifth leading ETF issuers based on year-to-date flows. The two companies rank first and second when solely considering firms that have launched a spot Bitcoin ETF.\n\nMentioned in this article"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxOdDIxQnNDNzFfcHdMNEtkNUlOM0pGekFRcTBLbVhGX2Z5OEtKX3k2Qy1ZdWVhOGZwUi1ybVlpc0RzV0xHa1NCdmRIU2pqWnNJVkw3TVQ2T2o0Q2ROWjg4Y1ZNZmJyS21lNkNJM0JzTlBmcmcxaGV0d2F5MVhNMWtiUDFyanE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 04 Jun 2024 07:00:00 GMT",
        "title": "Bitcoin and Ethereum Funds See Surge in Inflows Ahead of ETH Spot ETFs Trading - Yahoo Finance",
        "content": "Bitcoin and Ethereum Funds See Surge in Inflows Ahead of ETH Spot ETFs Trading\n\nAccording to CoinShares, global Bitcoin funds registered net inflows totaling $148 million last week. In contrast, short Bitcoin products saw outflows amounting to $3.5 million. Ethereum funds also attracted $33.5 million, marking the second consecutive week of positive inflows after a prolonged period of minimal activity.\n\n“This reflects a shift in investor sentiment for Ethereum, which had endured a 10-week stretch of outflows totaling $200 million,” CoinShares noted. This renewed interest in Ethereum has also positively impacted Solana, which saw $5.8 million in inflows amid speculation about potential Solana ETFs and other altcoin products.\n\nWhile the majority of these inflows originated from the United States, significant crypto investments were also reported in Canada and Switzerland, where Ethereum maintains strong institutional support alongside Bitcoin.\n\nExperts are projecting that Ethereum ETFs could debut in July, potentially capturing about 20% of the demand seen by Bitcoin ETFs. “Securing 20% of Bitcoin ETF demand would signify an enormously successful launch by typical ETF standards,” Bloomberg ETF analyst Eric Balchunas commented last week."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFBWalhpcTFuNnpFRTdpUnRrMFNlaUFsQmJLcjAxRmp0ZEJyaEVtTmtuSVM5MFlueFhxNGNzLWtyaUs2X0hjMUNFdFBXUktueE5LcFFTMEpCa1RNTXpoTUhMZkNzeFVfSVdSVTlFdGdST2VMMnY1c2ZIV3NUa0LSAYIBQVVfeXFMT2VHU1pVNmRiSUFYbFloczhMaXJDblVhOUQ0aHpXNGlJM0d4VDZrRjBEaDhsSGRmZy1aeEpRaE0xQUpaOTlKNnZpOVFzc05uWV8zZV90OEVWbWxSRTBWdHVkeDlYRXBSR0RMMG5pR0hOaDRPZHozQnlsYkZmZktFUklwUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 04 Jun 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Whales Make $32 Million Move - What's Happening? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nIn a significant development on the cryptocurrency market, a massive Ethereum (ETH) transfer has caught the attention of investors and analysts alike. Whale Alert, a prominent blockchain tracking service, tweeted that 8,759 ETH, worth around $32.96 million, have been transferred from an unknown wallet to Coinbase.\n\nAdvertisement\n\nThis transfer signals a potential sell-off from an Ethereum whale. Whale movements often serve as significant indicators of market sentiment. Large transfers, especially those heading toward exchanges like Coinbase, typically suggest that the whale might be preparing to sell a portion of their holdings. Such actions can lead to increased volatility and potential price adjustments as the market reacts to the influx of supply.\n\nCurrent market sentiment\n\nThe cryptocurrency market is known for its volatility, and whale movements often exacerbate this characteristic. While the exact intentions behind the recent transfer remain speculative, the market's response has been cautious. As of the latest data, the price of Ethereum stands at $3,761, marking a 1.40% decline in the last 24 hours.\n\nThe recent whale movement has added a layer of intrigue to the market, as investors speculate on the potential impact of such large transfers on ETH’s price trajectory. ETH's price dip in the last 24 hours could be partially attributed to the transfer news, as traders and investors react to the potential implications.\n\nAdvertisement\n\nDespite the recent dip, Ethereum’s overall performance has been strong. The 20.86% increase over the last 30 days highlights the cryptocurrency’s upward momentum, driven by several factors, including the broader market recovery, the spot Ethereum ETF approvals, and the ongoing development within the Ethereum network.\n\nOverall, the recent transfer of ETH to Coinbase has certainly stirred the waters within the market. While the exact intentions of the whale remain unclear, such large movements are always noteworthy and can significantly impact market dynamics. As Ethereum continues to navigate through its price consolidation phase, all eyes will be on broader market reactions and subsequent whale activities."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxPU0lTMWRLRl9zMlc1YkJIaXl5OVEzdnZKZUpOLWxLWFZwbng3dDJEOVBfenNaREdrVTRfekM1bHBlUVJpT0JoUTN2TEVBZ2lvNXE3OHltZmw1N3lsUXFrdEV2ZHNTd3hzQjl6ME9LY3JwbWNvd1l3eXZkcXpDeU5pR1VTMW9zeDY1Mk1KU29pVFFvTjhVVXVvTzR4Vk81NkZfc2Y3d1RILVd0c2RhVEpXTHc5MjRWRWFrTUs5Nmc1aVJvbFlIT3JRRDhmWHQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Jun 2024 07:00:00 GMT",
        "title": "Ethereum news: massive withdrawal of ETH from centralized exchanges after the approval of ETFs - The Cryptonomist",
        "content": "According to the latest news, recently over 3 billion dollars of ETH have been withdrawn from centralized exchanges (CEX) after the approval of Ethereum ETFs in the United States. What does this mean? Let’s see all the details below.\n\nLatest news: The approval of Ethereum ETFs in the USA triggers the withdrawal of ETH from centralized exchanges\n\nAs anticipated, since the approval of spot exchange-traded funds (ETF) on Ether in the United States on May 23, over 3 billion dollars of Ethereum have been withdrawn from centralized crypto exchanges (CEX).\n\nIndicating a possible imminent contraction of the supply. The data from CryptoQuant show that between May 23 and June 2 the amount of Ether held on exchanges decreased by approximately 797,000 ETH, equivalent to 3.02 billion dollars.\n\nThis decline in reserves indicates that fewer coins are available for immediate sale, as investors transfer their holdings to self-custody for various purposes other than immediate sale.\n\nAccording to the data shared by the BTC-ECHO analyst Leon Waidmann, coming from Glassnode, the percentage of circulating Ether supply held on exchanges is currently at the lowest level in recent years, standing at just 10.6%.\n\nThe decrease in the available supply on exchanges could contribute to increasing the demand pressure on Ether. Bloomberg ETF analyst Eric Balchunas suggests a “legitimate possibility” of the launch of Ether ETFs by the end of June.\n\nSome analysts hypothesize that the trading of spot ETFs on ETH could increase the demand for Ethereum.\n\nPushing the price beyond the all-time high of $4,870 reached in November 2021, similar to the effect observed with Bitcoin after the introduction of spot ETFs on Bitcoin in January.\n\nThe political influence on the approval of spot ETFs on Ethereum\n\nCompared to Bitcoin, Ether could benefit even more from demand pressures due to its lower “structural selling pressure,” as indicated in a report by DeFi analyst Michael Nadeau.\n\nWhile Bitcoin miners occasionally sell BTC to cover mining expenses, Ethereum validators do not face the same operational costs. Potentially contributing to a stronger price performance for Ether.\n\nHowever, there are concerns regarding the influence of the Ethereum Trust (ETHE) by Grayscale, which manages 11 billion dollars of funds, on the price action of Ether.\n\nIf it follows the model of the Grayscale Bitcoin Trust (GBTC), significant outflows from ETHE could occur, influencing the price of Ether.\n\nThe Bloomberg ETF analyst James Seyffart believes that the approval of spot ETFs on Ethereum was likely influenced by political decisions rather than purely financial considerations.\n\nIn a recent interview, Seyffart suggested that the political climate, including the actions of the Biden administration and the responses of the crypto community, played a significant role in the approval.\n\nSeyffart also noted that, in addition to Bitcoin and Ethereum, the approval of other ETFs on criptovalute, including Solana, is unlikely without significant regulatory changes.\n\nHe indeed emphasized the need for a regulated market to monitor these assets in search of fraud and manipulations.\n\nOn the other hand, the investor and cryptocurrency trader Brian Kelly has suggested that Solana could potentially become the next cryptocurrency to have a spot ETF in the United States.\n\nIn a recent episode of “Fast Money” on CNBC, Kelly, founder and CEO of the BKCM Digital Asset Fund, raised the question:"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiZkFVX3lxTFA4UkNLZ21hcU1TRlJpMzNmY0ozdXo3Qmh5WXdmbmt4dUljajM0M0hDUzhjd01Ud1lvZkRBdUJiUWMyNk1rTnFxZ1U1Tm1fNWJ2Nm5VT3pDT3VBRlptU2ZIeDJHY21Bd9IBa0FVX3lxTE5PdWVDS1NCbUYwLVRHZGFHVEVRS1JNUXpWZjYwbVJlWDlVTVhLMEpvMGZBU001Mzl6ZWs2alhzWG5JbjUxbktJd3o4cW83eG5RaFJhT1JGVERwWEVhNFAyOFNOWk1IUHBvNEtF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 04 Jun 2024 07:00:00 GMT",
        "title": "Is Ethereum (ETH) in Danger of Price Drop? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nEthereum might drop below a crucial price level, especially if the historical support level does not hold. For now, Ethereum is moving at the $3,760 price level, with support at $3,720. In case of a drop below the aforementioned support, the 26 EMA is the next level for a bounce.\n\nAdvertisement\n\nPotential volatility is indicated by Ethereum's current price action. Since the $3,720 support level has already been put to the test multiple times, bulls must protect it. The 26 EMA, which is currently at $3,568, is the next major support if this level is broken.\n\nIt will be carefully observed if this moving average can offer support, as it has in the past during corrections. The signals from the technical indicators are conflicting. The fact that the RSI is circling 62 indicates that ETH is not yet in overbought territory, but more downside is possible before oversold levels are reached.\n\nAdvertisement\n\nThe low volume, on the other hand, suggests that there is not much buying interest to drive prices higher. Additionally, it is generally regarded as a bearish signal that Ethereum has been moving in a consolidation for more than a week. This implies that there may be a slowing of the recent upward momentum.\n\nIn comparison to other cryptocurrencies, Ethereum has performed rather well, considering the larger market environment. External variables though, like news about an ETF or notable changes in the price of Bitcoin, might have an effect. However, the market is relatively bullish, which could be beneficial to ETH."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxNc2M2QWxxcHFjMnlzTTVXWm9DRkNFbGRXZFJkTDhFZE1TNF92QkxlUE9XSDk4Wk10M0djZG9rZG5mY3ZjOGFjTTI2SVN1bW1idUJ1djBoSDRmRjU3TTBuR19XMXFRMmJRdmRSMTZURkY1bERzRzJsaG14MnlnOTBUelpGUkl2alRMTkxqelRxaWRQYlpjRGpxcnNUSTNINU9kUVJyd2I1LU84T2dDSEJhMFpfZlVJM3RPZDdJZU5VQzAxLWZGUldNbFV0NERGdnFzb0ZyVlhmcXHSAd4BQVVfeXFMTlpQUGpTR2xWOXZuNWpmeXozdmFJQjhlTTR2SnFPcVVnY3pYRTJrdklJNjJSZWszdXM3cVE3cGNnTTNkeTMxcEh2OV9QeG1fcGFYLUdQRjB2Q2hoMUlaSXBHUW9KNmRNVGZTS3pmSDhfNW54M3I3eFpJWUN1NW91ZHNhSEVpemxBOWpHQkRkTnVhcHY0SDZfd0trWXlOLU5xd1ZaVmI3TlJOcjF5ZEx6dTktbUNYTVFLdVJlX3NGTmFHSk91OTNhNmtjRlpFN1p5X3JWckVrMUJ4dnNWQ0Nn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Jun 2024 07:00:00 GMT",
        "title": "Trader Says Ethereum-Based Altcoin ‘About To Get Sent,’ Predicts Massive Q4 Rallies for Bitcoin, ETH and Solana - The Daily Hodl",
        "content": "Widely followed trader Inmortal says this year will see massive rallies for Bitcoin (BTC), Ethereum (ETH), Solana (SOL) and one additional altcoin.\n\nThe pseudonymous trader tells his 214,000 followers on the social media platform X that API3 (API3), a decentralized data oracle network that aims to connect traditional APIs with blockchain applications, is ready to “get sent” after a long consolidation period.\n\nInmortal mentions API3’s recent strategic funding round led by digital asset investment firm DWF labs and the bullish technicals on the altcoin’s chart.\n\n“API3 about to get sent.\n\nAPI3 has successfully concluded a strategic funding round, allocating treasury assets in exchange for four million USDC.\n\nAbout the chart? nothing more to add, it’s just hyper bullish.\n\n> +600 days accumulation over\n\n> Clean retest of acc zone.\n\nSend it.”\n\nLooking at the trader’s chart, he seems to predict that the Ethereum-based altcoins will hit $6. At time of writing, API3 is trading at $3.37, up over 9% in the past day.\n\nLooking at the broader markets, Inmortal is predicting strong 2024 finishes for BTC, ETH and SOL. According to the analyst, the next couple of months will likely be uneventful for much of the digital asset markets but expects a full-blown “parabolic uptrend” in Q4.\n\n“> Boring June-July (chop + some traps for both sides)\n\n> Uptrend resume in August\n\n> Parabolic trend all Q4\n\nBTC goes above $100,000, ETH above $10,000, $SOL above $500.\n\nAltcoins do a x2-x5\n\nCharts never lie.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Salamahin/Viktoriia Bondarenko"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxOT19hU3lFd0ZFMFVQOENRVC0tYXZLOFBNa3lZMnduVjRzbUYxeFRaejNtSGcxb1RQcVVpZTVFQXJYZzFITEw2XzQ5UzJ2OTA4N3ZfX0pfamVVZW8xTk1peEc2RTNiSW9Da2pnUkhpaXMxVjdlYTZfXzFVRmdiSUlaTFphbG5mcmwtaXExZk4wNjI2R245SkdnZmVEcXp0V2kyX0EtbFZaaDNIX1U0aU9YQVhZX3d4dElSZ19lbDBlUU1USy04djFwcWhjWW5rOWE3WlVSYWF30gHbAUFVX3lxTFBVZVV5VndHVnBVRlktS0stZDhrbG1MVDNuS1pQOFhwNDFEZzNDSlR5dTY0eEc0SWdzcG9Ma3hkOFJ4V3F1VUVDNHVMQ0hzWk5OcGRwSkRJck1PcEZtZXRyQUVCU29IWWFCSThkZDloT3NnRmw0ekNhemI5ZTVwX25uYUFzNzlrMExjNlB0ZEg2WWpwWjI1cXk1WUFhYnZ5RkswNVlKcU9HYWE4X3lxZ09mdDJPR0xWbGtMSTVpLXljTERLTzdyWG9qTnBiZEdTM0QtVlJIaHd2MTl3bw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Sees Sentiment Reversal Among Institutional Investors Amid $2,000,000,000 Monthly Inflows: CoinShares - The Daily Hodl",
        "content": "Digital assets manager CoinShares says institutions poured two billion dollars into crypto products last month.\n\nIn its latest Digital Asset Fund Flows report, CoinShares says digital asset investment products reached $185 million in inflows last week.\n\n“Digital asset investment products saw inflows for the 4th consecutive week totaling US $185 million, with May seeing US $2 billion inflows, pushing year-to-date inflows past the US $15 billion mark for the first time on record. Volumes were down for the week though, falling to US$8bn, relative to US $13 billion the week prior.”\n\nThe US region brought in $130 million in inflows while Switzerland and Canada saw inflows of $36 million and $25 million, a stark turnaround for Canada, which saw overall outflows last month.\n\nWith investor sentiment remaining bullish on Bitcoin (BTC), the crypto king raked in $148 million last week while short-BTC products saw outflows of $3.5 million.\n\nMeanwhile, Ethereum (ETH) products brought in $33.5 million last week.\n\n“This represents a turnaround in investor sentiment in an asset that had seen a 10-week run of outflows prior, totaling US $200 million. This positive news for Ethereum has also had an impact on Solana, which saw a further US $5.8 million inflow last week.”\n\nSolana (SOL) enjoyed $5.8 million in inflows during the period, as Chainlink (LINK), XRP, Litecoin (LTC) and Cardano (ADA) saw inflows of $1 million, $0.8 million, $0.6 million and $0.3 million, respectively.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMi6gFBVV95cUxNQ1hab2k1djNMdGNtYmp0WVhaaU1rM3FZU2dRLXh5RUVxVlRSc1lJNFNENFBYY3RQdVdoMy1iRVlyVXp1cER2cHNPa01tdVJHOUZBOVViUTlHSHJIczFnNE1oemViUkxRSmV0eXJ6V3hRdnVRUkxKOGdaS1JzQkFqeldicnQ5VWhRb3gtOC1jd3ZjUDB5ajVsU3k2MVdmbHprYzNfOW0tODdWQjhIbzQ3ckhXNkpCRV9FTThQRTFCLUxrZjFyc3pfZzd4RTBHUUxWTy1xVThiQzVTZEJ1NTQ0eU5vYWdrVGEtdHfSAe8BQVVfeXFMTVFpSXhiSDl0UTN2VE45dUJJUkdVRjVDNXV1dlFESE02WG1FOUVVd1A0cGZWSTZqTVNGT0VkVEJwUmdQUzZ3RFZXa19ScGFHdGo4LWFJZW1sNGJ6TXNGeUZzR3g1TnNIUFNjVVBWZERzVnpqWHRoS09oNkExNTJ0X3dDaTNsU1VHVE5hVmdjOFRKTDg2UlZPMWhqUHF5Und0N0l2b053QVBvZFNlWDIzMzBKTTQ5S0NsdngwZk9NTERqMFR4S3ByUFVMTzlONzFnWHdTWk8wbTNxeEpMb1lOZnlfZTZPUGRrdFZjakhtUWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Jun 2024 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: Bitcoin’s momentum poise to propel crypto market - FXStreet",
        "content": "Bitcoin price gets squeezed between the trendlines of a symmetrical triangle pattern.\n\nEthereum price likely to have a pullback into its major support area between $3,400 and $3,200.\n\nRipple price is poised to end the 50-day consolidation between $0.467 and $0.571 range.\n\nBitcoin (BTC) price consolidates in a symmetrical triangle pattern, showing directional bias. Ripple (XRP) also follows BTC’s footsteps as it continues on its 50-day consolidation streak. Ethereum (ETH) price, on the other hand, shows signs of an incoming correction.\n\nBitcoin price ready for triangle breakout\n\nBitcoin price has produced three lower highs and higher lows since May 19. Connecting these swing points using a trend line reveals a symmetrical triangle formation in the 4-hour chart. This technical pattern has no bias, and the target is obtained by adding the triangle’s height to the breakout point.\n\nAssuming BTC triggers a bullish breakout at roughly $67,700, the height of the triangle sets the target near $73,777, its all-time high.\n\nBTC/USDT 4-hour chart\n\nHowever, if BTC breaks the upward trendline of the triangle and closes below $67,700, the bullish thesis could be invalidated, leading to a crash of 8%, which is the technical target given by the height of the triangle, to $61,734.\n\nEthereum price looks promising\n\nEthereum's price broke above a falling wedge pattern in the 4-hour chart on May 20 and rallied 21%. However, the bearish order block from March 12, extending from $3,980 to $4,093, is rejecting ETH price.\n\nInvestors looking to buy ETH could do so at the following levels:\n\nAt the 50% Fibonacci retracement level, drawn from the swing high of $3,984 on May 27 to the swing low of $2,864 on May 13, at $3,424. At the 61.8% Fibonacci retracement level of the same movement at $3,279.\n\nIf the conditions mentioned above are to play out, then the Ethereum price could revisit its previous resistance level at $4,000.\n\nETH/USDT 4-hour chart\n\nOn the other hand, if Ethereum's daily candlestick price closes below the $2,864 level, it would produce a lower low and signal a break in the market structure. This move would invalidate the aforementioned bullish thesis, potentially triggering an extra 9% crash to the previous support level of $2,600.\n\nRipple price to end the consolidation phase\n\nRipple price is currently consolidating between $0.571 and $0.467 after a major 33% fall in mid-April. This 49-day consolidation has seen XRP volume weakening.\n\nIf Ripple price breaks above $0.571 and the 50% Fibonacci retracement level from the swing high of $0.744 on March 11 to the swing low of $0.419 on April 14 at $0.581, it could rally 8% to revisit the 61.8% Fibonacci retracement at $0.621.\n\nXRP/USDT 4-hour chart\n\nHowever, if the Ripple daily candlestick closes below $0.467, then XRP could crash an additional 10% to its previous support at $0.419."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxOUmxHMDVGNkk3UEJ3bkxhUHlSV0FRaURUZmNiQWtOaEs0Q1hGZ2loNkQxNUprb3pqcjZjZ0JIMU1sSXE3YU05LVBWQmMtTnVTRmxaUHBqeWgzUmIzbjVNUmVTTzZMSjVHeGdKWlBYYkdIV3Yzbzd2VTNrdENodktRRUlSZTdPZmlfd3RwaNIBkgFBVV95cUxOY2JsYVlKVlM5NFFJZm5EZEJLbUc3REpTOGkyN2daRHVETVZlbEZjT3pQSkVacE1sal90ai1oWXI3Q3JraW5oRjI3ZGJKRVpoT1ZhOXZ2SWxTc3VQMUxkNERpM3c2WnNmV0J5ajdKYkp0b2ozblJzSFg2ZVBja0dndEZGQzVNRVJPaFhEamtQMXhKUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 04 Jun 2024 07:00:00 GMT",
        "title": "Ethereum exodus: Big ETH players gearing up for post-ETF rally? - AMBCrypto News",
        "content": "800,000 ETH (worth $3 billion) were withdrawn from exchanges post-ETF approval.\n\nLarge investors and institutions may be positioning for a bullish future.\n\nEthereum’s [ETH] market performance has shown remarkable resilience in the face of recent fluctuations, maintaining a stable price level below the $4,000 mark despite slight volatility.\n\nOver the past week, Ethereum’s value oscillated between $3,800 and $3,700, closing recently at approximately $3,768.\n\nThis relatively steady state, characterized by a modest 2.1% decline over the week and a 1.1% dip in the last 24 hours, might seem uneventful at first glance.\n\nHowever, this could be indicative of a more profound dynamic at play within the crypto market.\n\nThe recent calm in Ethereum’s price coincides with significant developments in the regulatory landscape and market structure, particularly with the U.S. Securities and Exchange Commission’s (SEC) approval of the Ethereum Spot Exchange-Traded Fund (ETF).\n\nThis regulatory milestone has set off a notable reaction in the crypto exchanges, leading to a substantial shift in Ethereum holdings.\n\nWhale movements and market impact\n\nPost-ETF approval, Ethereum saw a dramatic increase in activity, with around 800,000 ETH, valued at nearly $3 billion, being withdrawn from exchanges within just eight days.\n\nThis mass exodus of Ethereum from exchanges mirrors a similar pattern observed previously with Bitcoin following its ETF approvals, suggesting a strategic positioning by investors in anticipation of heightened demand.\n\nThese withdrawals were highlighted by Cryptoquant’s analysis, which pointed to a possible orchestrated move by institutional players preparing to cater to their clients’ needs in the wake of the ETF launch.\n\nThe implications of such significant market movements are quite profound.\n\nCrypto analyst Burak Kesmeci, reporting on the CryptoQuant QuickTake platform, speculated that either large-scale investors (“whales”) or institutions might be gearing up for a bullish future for Ethereum post-ETF.\n\nThe massive outflow, according to Kesmeci, is likely to positively impact Ethereum’s price in the medium term, as these large holdings reduce available market supply, potentially leading to price increases as demand continues to rise.\n\nInvestor appetite for ETH grows, but what do fundamentals say?\n\nSupporting this analysis, data from IntoTheBlock revealed a growing concentration of Ethereum holdings among large investors.\n\nAs of 31st May, 2024, 41% of Ethereum wallets held more than 1% of total circulation, a significant increase from earlier in the year. This concentration suggests a growing confidence among significant stakeholders in Ethereum’s long-term value.\n\nHowever, it’s essential to consider the broader market dynamics. Despite the potential for a supply squeeze, the overall circulating supply of Ethereum has continued to rise, indicating that not all large holders are in accumulation mode.\n\nFurthermore, trading metrics such as open interest and trading volume on futures markets have shown substantial increases, suggesting a robust and active trading environment that could influence Ethereum’s price trajectory.\n\nIn the past 24 hours, Ethereum’s open interest has seen a significant uptick, rising by nearly 3% to a valuation of $17 billion. This surge has also boosted open interest volume, which has increased by approximately 15% to $21.40 billion.\n\nIs your portfolio green? Check the Ethereum Profit Calculator\n\nMeanwhile, an analysis of Santiment’s data by AMBCrypto reveals that holders of 0.01-10 ETH have reduced their overall ETH holdings, while addresses with more than 10 ETH have also sold off a portion of their assets.\n\nThis profit-taking behavior, observed among both retail investors and whales, has not been intense enough to negatively impact prices."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxQS0FucVMxZGxWaHRCVWd1QzJsdmpuWDRMUGJONkdZXzlUS2xsbE1fc1FibWx2V2tMNDNlYktvNTE4aXRnbmFKMUV1RlQ2a1NIdzloMmcyd2RGMzlzWmxtTklpWlRDTVRJU3hkd0tvQ2ZsVk14cVJ6eldPREhqa04xUkpCUXN4QVFMa0RDQjdpdHVFbTI1X3NJMW9JV0NNWnMwQUVuMno3Q0JlYXptUTFlRWZ2YlNYLW83Z1Fv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 04 Jun 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Set For ‘Glorious Year,’ Analyst Eyes $10,000 Target - TradingView",
        "content": "Ethereum (ETH) saw a significant upswing at the end of May due to the rumors of a spot ETH ETF (Exchange-Traded Funds) approval in the US. This bullish momentum propelled the token’s price from the $3,000 price range to the $3,900 mark.\n\nAfter the approval, the second-largest cryptocurrency has shown a strong performance, consolidating between the $3,700 and $3,800 levels. Some crypto analysts believe ETH is preparing for a crucial test and eye bullish targets above the $10,000 price range soon.\n\nETH’s “Glorious Year” Depends On This Level\n\nAccording to crypto analyst Jelle, a community sector is currently driven by a negative sentiment towards Ethereum. The bearish sentiment, seemingly fueled by Ethereum’s failure to regain the $4,000 resistance level, has made “lots of people overcomplicate things here.”\n\nAs a result, Jelle urged investors not to panic, arguing there’s no reason to “flip bearish.” The crypto analyst highlighted the key movements the King of Altcoins has seen in the past two weeks.\n\nDue to the spot ETH ETF approval, Ethereum broke out of a multi-moth falling wedge pattern. At the time, ETH successfully regained the $3,600 price range and briefly tested the $3,900 price range.\n\nNewsBTC\n\nAfter reclaiming this key support level, ETH has been consolidating above it, hovering between the $3,700 and $3,800 price range since May 28. According to the analyst, the cryptocurrency is “reclaiming the range lows of a 3-year-long reaccumulation range.”\n\nPer Jelle’s chart, ETH is regaining the lowest range of the previous bull run, which could lead to an expansion period. If the second-largest cryptocurrency by market capitalization holds above this key level, Ethereum “will have a glorious year.”\n\nAdditionally, the analyst considers that ETH’s last hurdle to overcome this cycle is the $4,000 resistance level. Once “it breaks $4,000, it’s clear skies ahead” to potentially reach the price target of $10,000.\n\nSimilarly, known crypto analyst Il Capo of Crypto noted that his main scenario is a bullish continuation. Per Il Capo, Ethereum is “looking good” above the $3,650 range. This performance seemingly sets the cryptocurrency for a “bullish continuation” towards the previous cycle’s all-time high (ATH).\n\nEthereum ETFs, The Catalyst For New ATH?\n\nDespite the doubts, Ethereum’s recent performance resembles Bitcoin’s (BTC) in previous cycles. According to crypto trader Ash, ETH is following the path of the flagship cryptocurrency in 2018-2021. If it continues this track, “$10,000+ ETH is programmed.”\n\nAs the crypto market awaits the listing of the spot ETF, some analysts consider it the catalyst for an “explosive” alt season this year.\n\nSimilarly, Ali Martinez noted that over 777,000 ETH, worth around $3 billion, have been withdrawn from exchanges since the US Securities and Exchange Commission (SEC) approved the investment products. Due to a supply squeeze, this development could propel ETH’s price to higher levels.\n\nHowever, Lookonchain recently revealed that two participants of Ethereum’s Initial Coin Offering (ICO) deposited around 4.5% of their holdings on a crypto exchange. Per the post, the ICO participants received 200,000 ETH, worth around $767 million, at Ethereum’s Genesis.\n\nThe holders deposited 9,518 ETH, or $36.33 million, into Kraken on Monday, which has alarmed investors. Despite the fear of a possible dump, some community members think this movement could suggest that these long-term holders believe ETH’s price will reach unprecedented highs soon."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxNcG95UWs4RUIwWVVSaHdfUWdKMnB2a0pQaGxUb1daZE5kMWtaQkJUWEJqQW9Mamk3cG5zUXl6Zk1qczc3N1BORnFzb1VqOW02VXB5QlNTZ0pMQ3JUYmxzWVRHdEcwRTRXUC1SR1V6TDdrYy02UlBxX1NTdnJhN01GZ3ZwUi04VElGcE83cU1paHYwc0p2a0xz0gGcAUFVX3lxTFBMcFBQekI5bXowcjlxMEwtdVdkQ2RlMkxhblhIRjRycUtvUjFoRFA5LV9VSWtjQXNXb2VKTUN6RmNBajJibXVIQzN3Ynp3bFItbnl1TENJZnMzMkdwcFVMOHJnTVFPVW01X2dsd0hKQThxMWpBbHFhV0U1RTlnNWFqS0pqWXZhcDdzTVZPWmVTM2FoMUF5ZmJGeUY2SA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Classic – Expect this buying opportunity from ETC’s price IF… - AMBCrypto News",
        "content": "Fibonacci levels and the OBV supported the idea of a bullish ETC\n\nLiquidity pocket below a key support level could attract prices to it\n\nEthereum Classic [ETC] saw a strong breakout past the $29-resistance level on 20 May. The subsequent hype around the approval of spot Ethereum [ETH] exchange-traded funds [ETFs] also benefited Ethereum Classic. That’s not all either, with the network seeing its fourth halving on 31 May.\n\nNow, the last ten days have seen some volatility around the $32-level, but ETC shed 8% of its value in just five days. Ergo, the question – Is its next price move set in motion, or was this a healthy pullback before another move higher?\n\nRe-test of a vital ETC support level\n\nSince 13 April, the $29.1-level has been a stern resistance level for the bulls. They were unable to beat the bears until 20 May. The OBV had been rising for a month by that point and something had to give.\n\nThe breakout strength was also aided by the hype around Ethereum, which invariably has a positive effect on ETC as well. Since then, the momentum has slowed down. This was seen by the RSI’s drop to 49.\n\nEthereum Classic retested the $29 former resistance level as support and is expected to react positively. However, some lower timeframe volatility could develop on Monday.\n\nBased on its early 2024 rally, the retracement in March and April did not fall under the 78.6% level at $22.5. At press time, the 50% level at $29 was the support, which suggested that a move towards its $39.7 high could follow in the coming weeks.\n\nLiquidity pocket below $29 as a magnetic zone\n\nThough the $29-level would likely see a bounce, it might come after a sweep of the $28.4-level. The one-month look back liquidation levels heatmap revealed that the $28.4-$29 zone was filled with short liquidations.\n\nIs your portfolio green? Check the Ethereum Classic Profit Calculator\n\nA move into this zone would collect the liquidity present here before the next rally. Hence, traders should use a drop towards $28 as a buying opportunity based on the evidence at hand.\n\nDisclaimer: The information presented does not constitute financial, investment, trading, or other types of advice and is solely the writer’s opinion."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxOVF81QVJncVMwbnNhTXExal9RbDFnYS1tcVAwd0ZzcDVVREpvRzlRdkpHQnN1UW9mYjluNGs5cFFMMmpmTFpzbkM1a05hcmhteVliVlJQNHNLLVpiRFlnNGhadG1pTWlvaHdWVW02d2UtV18ySjQwM053RF9WVmIwaXl5Ty1SOC1EdEljbHNKMG5vdnZYaS1Yc3J3b9IBoAFBVV95cUxQR19kUGlvX1FDVURlNEoxQ2gtbXJQRXgzUzI1RHpPZHF1Rlp1V3Iya216b2tnN2RoTHlUb0R0Ny0wdGZ0cXJwV1hmUjIwQndZcFo2QjhzRVptNFhWMkppdXV4XzRZVlZ3VTdIQlZxNU1PU05jZnZ0VWVycXMxRG90U2FtZmxmMGhGR3BIRXB0cTFjSWpZaGcyeC1vdnhpMW95?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 04 Jun 2024 07:00:00 GMT",
        "title": "Crypto Prediction: Ethereum Price Risks Losing $3,500 Support, End Of The Road For Bulls? - CoinGape",
        "content": "Over the past two weeks, the crypto market has been wavering in uncertainty showcasing no clear commitment to a particular direction. The leading digital assets Bitcoin and Ethereum price represent this indecisive nature with several short-bodied candles in the daily chart.\n\nHowever, in the recent analysis shared by Ki Young Ju, CEO of CryptoQuant, the Bitcoin Thermo Cap Ratio was highlighted as an insightful metric for understanding Bitcoin’s valuation relative to its network fundamentals.\n\nadvertisement\n\n#Bitcoin is not currently overvalued based on network fundamentals. pic.twitter.com/fFLQF34VQv — Ki Young Ju (@ki_young_ju) June 3, 2024\n\nThe Thermo Cap Ratio rarely highlighted in mainstream analysis, measures miners’ cumulative security spend (or thermo cap) against the market cap. According to Ki Young Ju, Bitcoin is “not currently overvalued based on network fundamentals despite recent price increases.”\n\nTherefore, the market appears to be regaining its bullish momentum through ongoing consolidation and could continue the existing rally shortly.\n\nAlso Read: Top Reasons ETH Price Could Reach a New All-Time High Soon\n\n1) Ethereum Price Treading Dangerously\n\nEthereum stands out as a decentralized platform that not only supports cryptocurrencies like Ether but also enables the creation and execution of smart contracts and decentralized applications (dApps).\n\nEthereum price traded at $3762 on Tuesday, with the market cap holding at $452.1 billion. Amid the current market uncertainty, the leading altcoin has stabilized above $3700 support.\n\nThe daily chart projecting several lower-price rejection candles at this $3700 indicates the buyers are actively defending the support. A potential rebound from this support will push the ETH price by 8.5% to challenge the $4,090 peak and resistance. Note that a breakout from this barrier is crucial for buyers to resume the prevailing uptrend.\n\nHowever, if the current consolidation is prolonged it would indicate weakness in buyers’ conviction, suggesting a potential breakdown from $3500 support.\n\nAlso Read: Ethereum Price Analysis: Can Bulls Push Price to $5,000 on the RWA Narrative?\n\n2) Cardano (ADA)\n\nCardano (ADA) is a third-generation blockchain platform known for its research-driven approach and commitment to security and sustainability. It distinguishes itself through a layered architecture that separates the settlement and computational layers, enabling more flexible updates and maintenance.\n\nThe Cardano price has been trading sideways for nearly two months, resonating within two converging trendlines of the symmetrical triangle pattern. The altcoin rebounded twice from the upper boundary and thrice from the lower indicating the trades are following the lead of this pattern formation.\n\nCurrently, the ADA price trades at $0.455, seeking support at the lower trendline. The Cardano coin currently holds a market cap of $16.27 Billion and maintains its position as the 10th largest cryptocurrency.\n\nUnder favorable market conditions, the coin buyers are likely to breach the overhead trendline signaling the end of the consolidation trendline. The post-breakout rally could lead the ADA price to $0.62, followed by $0.68.\n\nAlso Read: Cardano (ADA) Breaks May Bearish Streak, But Major Twist Lies Ahead\n\n3) PEPE Coin (PEPE)\n\nPEPE Coin is a meme-themed cryptocurrency inspired by the popular internet meme, Pepe the Frog. This project stands out for its community-driven approach and its focus on the playful, irreverent culture that characterizes many meme-based digital assets.\n\nAn ascending trendline in the daily chart carries the current recovery trendline in PEPE price. The coin buyers witnessing suitable pullback support have managed to uplift the asset from the April low of $0.00000393 to the $0.00001725 high registering a 339% gain.\n\nHowever, the PEPE price reverted 17% to $0.00001434 with the market correction, while the market cap plunged to $6.035 Billion.\n\nThe coin price heading close to the aforementioned trendline could again bolster buyers with demand pressure. A potential rebound from the support will challenge $0.00001725 and aim for a higher target at $0.00002, followed by $0.000024.\n\nAlso Read: Pepe Coin Price Prediction As Bullish Sentiment Bursts, Rally To $0.00002 Incoming?\n\nTakeaway\n\nThe current market consolidation evidenced by Bitcoin price prediction and the Ethereum price sideways action has stalled the recovery momentum for most major altcoins. However, with on-chain indicators like the Thermo Cap Ratio, the broader trend remains bullish and currently stabilizes for future moves. Thus, the ongoing consolidation could bolster buyers to replenish recovery momentum and provide new entry opportunities for investors.\n\nRelated Articles\n\nSahil Mahadik Sahil is a dedicated full-time trader with over three years of experience in the financial markets. Armed with a strong grasp of technical analysis, he keeps a vigilant eye on the daily price movements of top assets and indices. Drawn by his fascination with financial instruments, Sahil enthusiastically embraced the emerging realm of cryptocurrency, where he continues to explore opportunities driven by his passion for trading\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxQYWVaMWV3aHgwc1NtSXJFbHpialo4RHlVcFZQOUNYUGlfQ2pkXzN1RTdmbzlGTkhnM0JUbkNwTkZnM3NwUHF3amhSNmo0RjNtRGhiaHpxZmJlenFoQ2VnMEdic2VfQTdkdUw2eGN4YXFPZHZUYlh4VWozdU9EWGJzN19saUJiTXYxQ2twVEVIN3R0SWVQQ3VYSkY3Skg4T0dCazFHY3NKSlFnUHU5bWlEVXFWTGkzMk1z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 04 Jun 2024 07:00:00 GMT",
        "title": "Voici le récap des infos les plus marquantes de la semaine écoulée autour du Bitcoin, Binance, Ethereum et Ripple - Cointribune EN",
        "content": "Tue 04 Jun 2024 ▪ 4 min read ▪ by Luc Jose A.\n\nBetween revolutionary announcements, technological advancements, and regulatory turmoil, the crypto ecosystem continues to prove that it is both a land of unlimited innovations and a field of regulatory and economic battles. Here is a summary of the most notable news of the past week around Bitcoin, Ethereum, Binance, and Solana, etc.\n\nBitcoin Hashrate Reaches All-Time High\n\nBitcoin’s hashrate has reached an all-time high, demonstrating the miners’ resilience and confidence in crypto despite post-Halving concerns. The total computing power deployed surpassed its previous records, supported by technological advancements and a recent increase in BTC price. These factors have compensated for the block reward reduction, strengthening the mining ecosystem. This performance underscores Bitcoin’s robustness and reassures investors about its long-term fundamentals.\n\nBlackRock Invests $10 Million in Ethereum for Its New ETF\n\nBlackRock, the asset management giant, is preparing to launch an Ethereum ETF, following the success of its Bitcoin ETF. The company invested $10 million to purchase Ether to create a fund with an initial net asset value of $10 million. The ETF, which will be traded under the ticker ETHA, will have the Bank of New York Mellon as the custodian and Coinbase as the holder of the underlying Ether. The ETF’s launch is expected by the end of June, according to Bloomberg analyst Eric Balchunas.\n\nXRP ETF: Imminent Approval, According to Ripple\n\nBrad Garlinghouse, CEO of Ripple, announced at the Consensus 2024 conference that the approval of an XRP ETF is inevitable, despite current regulatory challenges. This prediction follows that of Standard Chartered, which anticipates an XRP ETF launch by 2025. Although the crypto is currently down, trading below $0.549, optimism around the ETF could be a game changer. Regulatory clarity remains crucial, and a favorable decision for Ripple in its legal battle against the SEC could accelerate institutional adoption of XRP.\n\nChangpeng Zhao of Binance Incarcerated for 4 Months\n\nThe founder of the crypto exchange Binance, Changpeng Zhao, has been incarcerated for four months in a low-security federal prison in Lompoc, California, after admitting his responsibility in money laundering operations via his platform. This sentence, shorter than the three years required by prosecutors, marks a decisive turning point for the crypto sector. Zhao expressed his regrets and acknowledged the importance of regulatory compliance. The future of Binance, under new leadership, is full of uncertainties.\n\nBitcoin: Institutional Frenzied Accumulation Resumes\n\nLarge institutional investors reiterate their strategy of Bitcoin accumulation, reminiscent of the pre-bull rally period of 2020. Ki Young Ju, CEO of CryptoQuant, reported a strong activity similar to what was observed before the price surge in late 2020, with daily transactions exceeding a billion dollars. Although volatility is moderate, this accumulation could signal a new bullish cycle. Analysts are divided on the immediate consequences, but many anticipate that Bitcoin could break through the $69,000 resistance, paving the way for new highs.\n\nThat’s the main takeaway for this week. However, if you want a more detailed recap and in-depth analysis delivered directly to your inbox, feel free to subscribe to our weekly newsletter.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxOdEgtbVItUTQ3SE12N2JkNGZnYVdSZTFjczNUVlc4dzFtbi1tVkdiU3N5allPSmtuMnMzRm9IQWNtbWs5N3MyT0Z1eUxNSzd5eUpMWDFlcWVtc2JzMUxWdWNXQzlSSTFtV1VVYTRPTU9BNXJ5UkpBYnp1X3NnNEliZjlMNllHU0VaRW44cDBDV3BXZ9IBlwFBVV95cUxNVS1CTjdYY2haSkdNaUpvYXloVlNRTDZzcUpIS0pHZF9xNldoS0YzdjUzekVMd0o4MmY5NWRWenBBdlB4UUxad2dQSWxIU1hfNnlNcnpJa0MtM0Z0MVJyQzVwTlQzZEFmeFB4SnFKLTFhNEt2M2FqbmswYkozbTJ2QWQ1a195NUFLZGs0LUFFZ0FfbFE1YTFj?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Jun 2024 07:00:00 GMT",
        "title": "ETH’s Inflows Hit $33.5M With SEC’s Approval of Spot Ethereum ETF - CryptoPotato",
        "content": "Ethereum is seeing a turnaround in sentiment owing to the SEC approval of a spot Ether ETF that is set to go live sometime next month.\n\nAccording to CoinShares’ latest report, Ethereum-based investment products experienced a second consecutive week of inflows marking a reversal from a 10-week outflow streak amounting to $200 million. Over the past week, Ethereum saw $33.5 million in inflows which pushed its monthly inflows upwards of $21 million.\n\nAltcoins Follow Ethereum’s Lead with Inflows\n\nInvestment products focused on digital assets experienced an influx of capital for the fourth week in a row, amounting to $185 million. The month of May witnessed inflows totaling $2 billion, driving the year-to-date inflows past the whopping $15 billion mark.\n\nHowever, trading volumes decreased during the week, dropping from $13 billion in the previous week to $8 billion, as per the latest edition of CoinShares’ Digital Asset Fund Flows Weekly Report.\n\nMeanwhile, Bitcoin witnessed inflows amounting to $148 million, while short-BTC encountered another week of outflows totaling $3.5 million, indicating continued positive sentiment among ETF investors.\n\nIn addition to Ethereum, other investment products based on altcoins also saw comparable inflows for the week. Solana led with $5.8 million in inflows, trailed by Chainlink with $1 million. Following behind are XRP with $0.8 million, Litecoin with $0.6 million, and Cardano with $0.3 million during the same period.\n\nDespite recent achievements in direct investments in digital assets, blockchain equities have continued to face challenges, with outflows of $7.2 million observed last week and a total of $516 million outflows recorded this year.\n\nUnited States Leads Weekly Inflow\n\nThe United States dominated the weekly inflows, recording a $130 million influx. Switzerland also witnessed significant inflows amounting to $36.8 million during the same week. Canada followed closely with the next highest inflows of $24.6 million.\n\nWhile Hong Kong, Australia, and Germany experienced modest inflows of $1.7 million, $1.4 million, and $0.5 million respectively, Sweden and Brazil saw outflows. Sweden recorded outflows of $5.1 million, while Brazil had outflows of $4.4 million for the week."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxQdUtsdnRHdVFldTJKYmM3MmdHYVU2elJJRGFCcmlLUjVrSjd4R191eDJ0UERlZlZFTjdwLW04TE1ITjlDcW1UcU1qVTZzdktWZ2I4a0g4SWJiaFJUTUdDY0VZRS1EaVc0X3FQdzA4eVVCZ0tyNkExT2FVcVEzX1B5NjBDaER4Rm9D0gGOAUFVX3lxTE5LNU9HSUVoa3VYNFdjWlNDYVdWSVEzWkNNYU41eEVuSDFNY1lhdU5YeGNZcmNHUWN0S0ZmVWxVeklQd2pLRE9IdFB4MzM4WGREOUZ6VEZQM2lhLUVOWEx6MGdtcmJJWUwxVWNta2lhTjBNSlRJWC1laUd6U0xPWGc3ZFBtV0hFWmhTbEJYQnc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 04 Jun 2024 07:00:00 GMT",
        "title": "Ethereum weekly inflows hit $34 million – Are ETFs the reason? - AMBCrypto News",
        "content": "Year-to-date inflows into crypto products have surpassed $15 billion.\n\nEthereum recorded its second week of inflows.\n\nDigital asset investment products recorded inflows totaling $185 million last week, marking the fourth consecutive week of inflows, digital asset investment firm CoinShares found in its new report.\n\nAlthough this marked an 82% decline from the $1.05 billion recorded in inflows the previous week, it still pushed May’s inflows to $2 billion. Also, it brought the year-to-date (YTD) inflows into cryptocurrency funds above the $15 billion mark.\n\nAccording to the digital asset investment firm, trading volumes declined during the week under review. They totaled $8 billion, a 38% drop from the $13 billion registered the previous week.\n\nAt the end of the week, as observed by CoinShares, the total assets under management (AUM) for crypto-based investment products were above $97 billion. This was a 1.3% decline from the $98.43 billion recorded the previous week.\n\nRegionally, most of last week’s flows into crypto funds came from the U.S. According to CoinShares:\n\n“The majority of inflows were from the US, seeing a net US$130m, although incumbent ETF issuer outflows rose to US$260m. Switzerland saw its second largest week on inflows this year at US$36m, while Canada saw a turnaround with inflows of US$25m despite seeing a net outflow in May totaling US$39m.”\n\nLuck smiles on Ethereum\n\nSince the U.S Securities and Exchange Commission (SEC) approved the first set of applications for spot Ethereum [ETH] exchange-traded funds (ETFs) from Grayscale, Bitwise, iShares, VanEck, Ark Invest, Invesco, Fidelity, and Franklin Templeton on 22nd May, ETH-based products have recorded significant inflows.\n\nThe week under review was the same. According to CoinShares’ report, Ethereum-backed products recorded their second week of inflows, which amounted to $34 million.\n\nThis represented 18% of all inflows recorded during that period. Also, last week’s liquidity flows into Ethereum pushed the altcoin’s YTD inflows to $11 million.\n\nIs your portfolio green? Check the Ethereum Profit Calculator\n\nCoinShares said:\n\n“This represents a turnaround in investor sentiment in an asset that had seen a 10-week run of outflows prior, totaling US$200m.”\n\nCoinShares found that last week’s inflows in Ethereum impacted Solana [SOL] due to the statistically positive correlation between them."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxQN2Rlc05aVmpkeXg5YlNIa2xPSmt3SDFybTF4dng1azlaSWhWSHhwcW9JZDBDLVlzQ1diMjZqLWpSZUFDcjk0N1Nyam91aE1XTDdZVmtaNnZjOTBTbl8zOE9sSzQ5VC1fUEF1d0FOdWtrb1BaVWRZcWJ3ZDg1UUtiNTdrZVhuZ0d3bkVHVGxoYXJsd0F3UUF0VW8tdUp6c1lESlN3YjMyM2lTQ2hYd2wzVThtcWZkVFZaUHNr?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 04 Jun 2024 07:00:00 GMT",
        "title": "Ethereum In A Bull Flag: Massive ETH Withdrawals Ahead Of Super Cycle To $4,900? - FX Leaders",
        "content": "⚡ Trade Forex With High Leverage And No Limitations! – Open an Account Here\n\neth-usd\n\nEthereum is a mixed bag when writing. Even so, the uptrend remains for now. While bulls might be loading up, buying on every correction, traders should be wary of what happens at the $3,700 level. This line is an immediate support zone that bulls must reject for uptrend continuation. Considering the formation in the daily chart, the path of least resistance is upwards, but buyers must convincingly close above $4,000. If not, ETH prices might consolidate horizontally in continuation of last week’s formation.\n\nThe general inactivity in price action means bulls seem to be slowing down. For now, Ethereum is stable in the past 24 hours but down 3% in the past week. Since prices are quite literally stuck, engagement is also low. At the time of writing, the average trading volume in the last 24 hours is around $14 billion, which is way lower than expected.\n\nNonetheless, traders are closely monitoring fundamental events. The following Ethereum developments are noteworthy:\n\nFollowing a hack, Linea, an Ethereum layer-2 platform , chose to shut down the sequencer to prevent more losses. Critics are now raining down on its developers, claiming it is not a blockchain but a centralized scaling solution.\n\nAnalysts think ETH bulls are preparing for a super-cycle in the coming weeks. As the United States SEC prepares to approve spot ETFs , over 800,000 ETH have been withdrawn from top exchanges.\n\nEthereum Price Analysis\n\nETH/USD prices are consolidating inside a wedge, printing a bull flag.\n\nStill, even with the lower lows, the uptrend remains.\n\nOptimistic bulls can look for entries to buy on dips above $3,700.\n\nHowever, as mentioned earlier, the accumulation might provide a spring for a decisive breakout above $4,000.\n\nThis development will align with the May 20 bull bar that continues to shape the current price action.\n\nA close in either direction ($3,700 or $4,100) is crucial for trend definition.\n\nIf bulls succeed, Ethereum would quickly explode to as high as $4,900."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxOMk84amE1SlpmVzljRTNwQV9mTkp0OG5nNnBtZ0h2RXl6cXZHMncwUmlNU0I0MEF0Zk42MXJPelBjR21tTEx2TzMwZ1VVT2E2eWZYMU81RUdxSV9fNVdMeDhXT0JfX1FITm1MMTFaUXgwNnRXOHNxdjhDSFh0aHJ4TWprZE5saENQc0hEMmQwUTRWWXd6dWdLUFl3QVFKRjkzU1pRMzc0aHhBNG5iNXZQTzRabjhnNVhU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 04 Jun 2024 07:00:00 GMT",
        "title": "ETH vs ADA vs RBLK: Is Ethereum, Cardano or Rollblock The Best Investment for 2024? - Techpoint Africa",
        "content": "The introduction of Ethereum ETFs sent waves throughout the cryptocurrency market. Several projects saw significant gains, with Ethereum rallying over 20% in just one week. But how does Ethereum compare to Cardano and Rollblock? Being significantly more affordable projects, Cardano and Rollblock could make better investments. Experts believe that both projects will rally throughout the upcoming bull run, and in the process, they could offer higher returns.\n\nEthereum Soars 28% Following ETF Update\n\nThe SEC recently approved eight Ethereum ETF applications. This is a huge milestone for the cryptocurrency market and sent Ethereum’s daily trading volume soaring to over $47 billion.\n\nEthereum’s price has also rallied since this update. Over the past week Ethereum’s price increased by 28.7%, and ETH is now trading at $3,816. This bullish momentum temporarily made Ethereum the second most traded cryptocurrency and has resulted in bullish predictions.\n\nAccording to Daniel Bernstein, Ethereum could hit a new all-time high of $6,000 by the end of Q2, and as a result investors are keeping a sharp eye on ETH developments.\n\nCardano Founder Critiques Bitcoin\n\nIn a recent interview Charles Hoskinson called into question Bitcoin’s future. He argued that Bitcoin is now reliant on the broader DeFi ecosystem, stating that it could be replaced by an asset with greater security and functionality.\n\nHoskinson believes that Cardano’s native currency, ADA, is a better alternative. He states that recent Cardano developments make it an ideal candidate, further stating that Cardano is energy efficient and fully decentralized.\n\nThat said, Cardano’s price has increased by just 1.16% over the last month. As a result, many investors believe that Cardano has lost its appeal and are instead choosing other altcoins to boost their portfolios.\n\nStage 2 Of The Rollblock Presale Sells Out\n\nAfter a massive surge in new investors, stage two of the Rollblock presale has quickly sold out. Rollblock’s returns have now hit 40%, and experts believe this is just the start of the project's growth.\n\nRollblock is a market disruptor. It looks to replace current systems in the casino market using blockchain technology. The use of GambleFi technology will solve issues with security and transparency, offering a greater gambling experience.\n\nRollblock’s platform is already live, licensed, and lets investors play over 150 different game modes. These include casino classics, live poker, digital games, and more, all of which are compatible with over 20 cryptocurrencies. Furthermore, Rollblock plans to add sports betting, further enhancing its appeal.\n\nOne feature that’s caught the attention of crypto analysts is Rollblock’s revenue-sharing model. Rollblock will share up to 30% of its daily revenue with investors who hold and stake $RBLK tokens. To share its revenue, Rollblock will buy $RBLK tokens from the open market. Half of the tokens it buys will be burned, and the remaining half will be used for weekly rewards.\n\nAt the start of its presale, experts predicted that Rollblock would increase by over 720%. Having already increased by 40% in less than a month, Rollblock is on track to surpass this goal, making it a great opportunity for early adopters.\n\nRollblock Presale Soars Amid Bullish Price Predictions\n\nInvestors can buy $RBLK for just $0.014 to participate in the Rollblock presale. Given its potential, Rollblock could outperform Ethereum and Cardano in 2024, and as a result, $RBLK is selling out at its fastest rate since its presale started.\n\nDiscover the Exciting Opportunities of the Rollblock (RBLK) Presale Today!\n\nWebsite: https://presale.rollblock.io/\n\n\n\nSocials: https://linktr.ee/rollblockcasino"
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxPOE5hMHZfc3BkNFRzMU90YzEyM1BWa2xkWHppVG1jOGNtZDZ6d3NTVjRmWVduN0hVdlY5bXo0bTRzZ1BtVTA4ZGV1ck0tTFlRYWRJYWF3TW9ZWUFHeDAtQkNEcElPc0V6VzBWUWNWeldVZ2xVOUFMSDJPYjBOcWh1Yg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Jun 2024 07:00:00 GMT",
        "title": "Are NFTs Dead? - Rolling Stone",
        "content": "To most people, non-fungible tokens (NFTs) are those weird, often abstract and (they think) ugly pieces of digital art that sell for thousands of dollars if not more. On the surface, that seems right. Strange digital artwork of apes, dogs, cats and other abstract images are being sold for a lot of money. To be exact, these are priced in crypto such as Ethereum, Solana and most recently in Bitcoin.\n\nBut are NFTs just about digital art?\n\nOn the contrary, NFTs are more akin to digital certificates of ownership rather than the art itself. When you buy a real physical painting, you might be issued some sort of certificate by Sotheby’s or Christie’s that you bought or won the painting from them through auction. Or you could have bought the real painting from an art gallery. In any case, normally there is official paperwork that accompanies the painting to prove that you are its current owner.\n\nSo think of NFTs that way; you are buying the digital certificate of ownership of that artwork that proves you are the new owner.\n\nNFTs are different from crypto tokens. Crypto tokens such as Ethereum and Solana all have the same price at a given point in time. So for example, if the spot price of Ethereum today is $2,000, then everyone who holds one Ethereum has that same spot price for today.\n\nThe Rolling Stone Culture Council is an invitation-only community for Influencers, Innovators and Creatives. Do I qualify?\n\nNot so with NFTs. Just like a particular house, car, watch or artwork has its own unique price, so does each NFT. So a Banksy NFT that is a unique piece of digital art might be worth $500,000, but that price is specific to that particular NFT. An NFT by unknown artist Joe Smith might sell for $100, but it is specific to that NFT or NFTs in that collection.\n\nThe thing to remember is that NFTs are actually digital certificates of ownership. So in the future, if a jurisdiction allows it, the land title of a property might have both a paper certificate and a digital NFT that you need to possess to be called the owner of that land. Editor’s picks\n\nNFTs track provenance, or the sequential chain of ownership. Since the NFT is on a blockchain, a buyer or seller can see who previously owned that asset (represented by the NFT), who sold what for how much, any modifications to the property (if tracked) and whatever the NFT is designed to track. It then makes it easier to establish provenance. The blockchain explorer on the web would show that the asset used to be owned by Bob, then it got sold to Susan, then sold to Luther and so on. Trending He Played with the Beatles, the Rolling Stones, and the Who — A New Documentary Tells His Story Sinéad O'Connor Was Booed Offstage. Kris Kristofferson Came to Her Defense Sean Combs' History of Controversies and Allegations Trump Says No One Could Have Predicted Hurricane at Peak of Hurricane Season\n\nLarry Fink, the CEO of asset management firm Blackrock, sees a future where many of our transactions that involve asset transfers are done on the blockchain. It is one good way to mitigate — if not eliminate — fraud and fake certificates of ownership, since the provenance is on-chain and cannot be faked.\n\nNFTs are definitely alive. They are more than just digital images of apes, dogs, cats and other amusing animals. On the contrary, some of our future transactions involving our major assets and possessions such as physical art or land may involve holding the NFT of that asset to prove that we are the owner."
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTFAzUTFLT1Nmdk1SSkpZVVU0MjRXZHM1cHY0U0lKNGFiZ0NkUmR2cHFQdE9pV18wbzFqSVJ4SmFtdVdnQXlRQnU1SkFIR2E0SUs0NVY1a01aQ3lwSjZadTlyZ0NPVVN5S3FXeHlrZUhiSVRRWko2RmhGSXpB0gF_QVVfeXFMUG5UT2NfZTQ4M3dKU2g3Vnc3VXhid1lDckx6M203LVNaTm45R3Y4ZHRoYV8ydTBQQTY0VnhNc01naTdTNHhPa2sxeEJkSHA5OXJ5SUpMaWtPTEViY0Y4Q2pOYkNiUENmQlFOX09nQkFVM05Ob0ZaMEtpZGJxVFp1aw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 04 Jun 2024 07:00:00 GMT",
        "title": "Solana beats Ethereum: Time to ditch ETH for SOL? - AMBCrypto News",
        "content": "Solana and Ethereum saw varying volumes of daily active addresses.\n\nThe ETH TVL has remained ahead of SOL’s by considerable volume.\n\nAccording to a recent report, Solana [SOL] had more activity than Ethereum [ETH] in the past 24 hours. Additionally, this increase in activity led to Solana experiencing higher trading volume than Ethereum.\n\nData showed that Solana had a busy 24 hours, with impressive numbers in some key metrics. Solana had more active addresses than Ethereum and Bitcoin combined, the two largest networks.\n\nA deeper analysis of both platforms revealed a significant divergence in their active addresses over the past few days.\n\nComparing Solana and Ethereum\n\nAn analysis of Solana’s active addresses on its scanner revealed an interesting trend. The chart showed that in the past few weeks, the network’s lowest number of active addresses remained above 800,000.\n\nThe chart indicated that the number of active addresses had surpassed 1 million at the time of this writing. This suggests that the network has been experiencing increased activity recently.\n\nHowever, the analysis of Ethereum’s active addresses showed a decline over the past few weeks. The chart revealed that the number of active addresses remained below 500,000 throughout the previous month.\n\nIt gradually decreased to the 400,000 range and has not risen above this level in recent days. According to data from Santiment, the number of active addresses was approximately 141,000 at the time of this writing.\n\nSolana trumps Ethereum volume\n\nAnalysis of the volume trends of both networks on DefiLlama showed that Ethereum has had higher volumes than Solana in the past few weeks. However, at one point, Solana’s volume surged past Ethereum’s.\n\nAs of this writing, Solana’s network volume was around $1.1 billion, while Ethereum’s was around $1.5 billion. This indicates that ETH’s volume has declined while SOL’s network volume has maintained momentum.\n\nAdditionally, it’s worth noting that ETH’s Total Value Locked (TVL) remains higher than SOL’s. According to DefiLlama, ETH’s TVL was over $65 billion, while SOL’s TVL was around $4.8 billion.\n\nETH and SOL see varying bull trends\n\nAMBCrypto’s analysis of Ethereum on a daily timeframe chart showed that it has remained in a bull trend. The Relative Strength Index (RSI) was above 60 at the time of this writing, indicating a strong trend.\n\nHowever, its price has not seen significant movement in the last few days. Previously, ETH experienced a daily decline of less than 1% for the past two days. As of this writing, it was trading at around $1,877, with an increase of less than 1%.\n\nRead Solana (SOL) Price Prediction 2024-25\n\nAnalysis of Solana’s RSI showed that it rested on the neutral line at the time of this writing. This indicates that while Solana is still in a bull trend, it is currently weak.\n\nAs of this writing, Solana was trading at around $165, with an increase of less than 1%. Like Ethereum, it has not seen significant movements in the last few days."
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE44Yk1sbnN3MVpPSjhEMDZzNDhOa2FHem9FZEVFVklrYmc5ZjV2SHJJZTh4djU0LXQ5VlotcXQ1QlIzYlJJTGVENUdfaWx5cTdqLUtnNjVUNW1EdHJMUEVEeUMydXdMMk5CTXRHd25nb081QQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Jun 2024 07:00:00 GMT",
        "title": "Ethereum price prediction 2024 - finder.com.au",
        "content": "Finder analyses expert price predictions each quarter. We surveyed 32 crypto industry specialists in July 2024 on their thoughts on how ether (ETH) would perform through 2030.\n\nAll prices mentioned in this report are denominated in US dollars.\n\nOn average, our panel thinks ether (ETH) will be worth $5,368 by the end of 2024 before rising to $7,359 by year-end 2025 and then $23,549 by 2030.\n\nEther (ETH) price predictions for 2024, 2025 and 2030\n\nETH's price is expected to rise to $5,368 by year-end 2024, according to the average prediction from Finder's panellists. This prediction is a little more bearish than their $5,710 prediction in the April report.\n\nThe panellists also predict ETH will hit $7,359 by 2025 and $23,549 by 2030. Both predictions are slightly more bearish than our panelists' average predictions from our April 2024 survey, when they projected ETH to reach $7,996 by 2024 and $29,380 by 2030.\n\nJosh Fraser, the cofounder of Origin Protocol, is one of our more bullish panel members on ETH's potential in 2024, predicting it will end the year worth $13,500 off the back of the incoming ETH exchange-traded fund (ETF).\n\n\"Ethereum ETF inflows have the potential to impact the price of ETH even more than bitcoin ETFs impacted the price of bitcoin (BTC). I anticipate ETH ETFs will be a major catalyst for both ETH and the broader industry and that ETF inflows will bring the price of ETH above $10,000 in the mid-term.\"\n\nJulian Hosp, CEO Cake Group, also references the incoming ETF as the reason he's so bullish on ETH, predicting it will be worth $10,000 in 2024.\n\nPedro Febrero, the VP of Web3 at Realfevr, is by far the most bullish on ETH's 2024 potential, predicting it will end the year worth $20,000, in part due to its use case.\n\n\"ETH is underpriced considering 90% of all cryptos protocols and devs use the Ethereum Virtual Machine (EVM). It's the de facto world computer. Plus, the ETF will put ETH on a similar level to BTC for institutional buyers.\"\n\nShubham Munde, research team lead at Market Research Future, provided a prediction for ETH to end 2024 a touch over the panel average ($5,600). However, due to ETH's versatility, Munde says it could hit $9,000 at some point this year and has a bright future.\n\n\"Multiple use cases, large and active community, and smart contract functionality are some key factors I believe will raise the ETH prices sky high.\"\n\nAt the other end of the spectrum is John Hawkins, senior lecturer at the University of Canberra, who sees the price of ETH falling to $2,700.\n\n\"ETH may perform better than other crypto in the short term as more Ethereum ETFs are listed. But in the medium term, all crypto (other than stablecoins) are a speculative bubble, and their prices are highly correlated.\"\n\nHow high and low will ether (ETH) go in 2024?\n\nOur panellists predict that ETH's average peak price in 2024 will be $6,050, with some predicting it will climb as high as $20,000.\n\nThe average lowest price our panelists predict ETH will hit in 2024 is $2,669, with some predicting it will fall as low as $1,500.\n\nClose to a quarter (23%) of our panelists feel that ETH's price will rise into the $5,000 to $5,999 range at its highest before the close of 2024, while a little over a quarter (19%) believe we'll see ETH's price within the $4,000 to $4,999 range within the same time frame.\n\nAround two-fifths of the panel (42%) think ETH's price bottom for the remainder of the year is somewhere between $2,000 and $2,500. An additional 35% say ETH's price will fall somewhere between $3,000 and $3,999 in 2024.\n\nMorty Tollo, the CEO of Elbaite, provided an above-average max price prediction for ETH ($8,000) as \"Ethereum ETF inflows have yet to start.\"\n\nDaniel Polotsky, the founder and chairman of CoinFlip is also quite bullish and thinks that ETH will hit $8K, citing market conditions, high-interest rates and the upcoming ETFs as reasons for his bullish stance.\n\n\"It seems like during periods of speculation and euphoria, risk assets like ETH outperform BTC. Since we are coming out of a period of high interest rates and entering a post-halving, lower-interest-rate phase, it is possible that a speculative bubble forms. This may help Ethereum even more so than bitcoin and cause a boom in its price. Ethereum will also be bolstered by Ethereum ETFs, which will begin trading shortly. Ethereum continues to provide scaling and restaking solutions but also has competitors such as Solana nipping at its heels. While it will likely survive this cycle as the top non-BTC dog, it cannot rest on its laurels if it wants to continue its reign as the number one alternative crypto asset.\"\n\nIs now the time to buy, hold or sell ether (ETH)?\n\nThe vast majority of the panel (64%) say it's time to buy, with a little under a third (29%) saying to hold and just 7% saying sell.\n\nNicole DeCicco, the CEO of CryptoConsultz, sees ETH as a strong buy based on its fundamentals.\n\n\"Ethereum's value is rooted in several key factors that continue to propel its price and ecosystem forward … Our positive outlook on Ethereum is underpinned by its technological advancements, growing adoption and the vibrant ecosystem it supports. We believe that Ethereum's strong fundamentals and continuous evolution will drive its value higher in the long term.\"\n\nMitesh Shah, the founder and CEO of Omnia Markets, also says that now is the time to buy ETH.\n\n\"Ethereum's current price may not fully reflect its long-term value due to its transition to a proof-of-stake model, which is expected to significantly reduce its energy consumption and increase transaction speed. Additionally, the growing adoption of DeFi applications and non-fungible tokens (NFTs) on the Ethereum network indicates increasing demand for ETH. On-chain data also reveals a decrease in ETH supply on exchanges, suggesting strong investor confidence and a potential supply shortage, which could drive prices higher by the end of the year, similarly with BTC.\"\n\nPaul Levy, a senior lecturer at the University of Brighton, is in the \"hold\" camp and says that \"while Ethereum has the potential to grow significantly, possibly reaching $5,000 to $6,000 by the end of the year, it is also experiencing short-term negative signals and market volatility.\"\n\nIs ether (ETH) overpriced, underpriced or priced fairly?\n\nThe vast majority of our panellists feel that ETH is either underpriced or fairly priced.\n\nIn fact, 64% feel that ETH is currently underpriced, and 25% feel that it's priced fairly.\n\nOnly 11% feel that it's overpriced.\n\nMartin Froehler, the CEO of Morpher, says that ETH is undervalued since \"Ethereum will become the global settlement layer.\"\n\nSathvik Vishwanath, the CEO of Unocoin Technologies, says ETH's utility and ongoing development show that it is here to stay and fairly priced.\n\n\"Ethereum's price predictions are influenced by its ongoing development, including Ethereum 2.0 upgrades and its dominant position in the DeFi (decentralized finance) and NFT spaces. The current price reflects its utility and potential for growth as the backbone of decentralized applications. Market dynamics and increasing adoption by institutions and developers suggest that ETH is priced fairly and has strong long-term prospects.\"\n\nAjay Shrestha, a professor at Vancouver Island University, thinks that ETH is overpriced based on its inherent volatility:\n\n\"ETH could potentially reach new highs if it continues to be adopted for DeFi and other applications. But market volatility and external factors like regulatory changes can also influence its price.\"\n\nIs ETH going to be the BTC killer?\n\nAs to whether ETH could ever become a better store of value than BTC, the panel is evenly split, with 79% sitting in either the \"yes\" or \"no\" camp and the remainder unsure.\n\nBTC and ETH EFTs\n\nThere has been a lot of talk about combined BTC and ETH ETFs, and the vast majority (93%) think these will positively impact the price of ETH.\n\nDigging a little deeper, over half (54%) think combined BTC/ETH ETFs will have a significantly positive impact on the price of ETH, and 39% say it will have a moderately positive impact on ETH's value.\n\nMeet the panel\n\nNicole DeCicco + Read Nicole DeCicco's reasoning Nicole DeCicco + Read Nicole DeCicco's reasoning Prediction N/A Buy/sell/hold Buy shopping_basket Ethereum's price trajectory is influenced by a combination of technical advancements, market dynamics, and macroeconomic factors. While I tend to steer clear of hard and fast price predictions, Ethereum's value is rooted in several key factors that continue to propel its price and ecosystem forward. The anticipation and successful implementation of Ethereum 2.0- transition to a proof-of-stake consensus mechanism- has not only impacted its valuation but does so by improving the network's scalability and security all while reducing its energy consumption. Ethereum's role as the backbone of decentralized finance (DeFi) through an ever-growing demand for Defi applications has driven the value of ETH to unprecedented levels. This utility enhances Ethereum's intrinsic value and supports a robust demand outlook. Ethereum's active development community and its innovative contributions have led to the successful launch of new features, such as Layer 2 scaling solutions, further solidifying its position as a leading blockchain platform. The introduction of Ethereum ETFs is poised to have a significant impact on its price. These financial products provide traditional investors with easier access to Ethereum, broadening its appeal and increasing market liquidity. ETFs encourage more institutional and retail investors to gain exposure to ETH, driving demand and supporting higher price levels. Like other cryptocurrencies, it's important to consider broader market conditions. Macroeconomic factors such as inflation, regulatory developments, and global economic trends play a significant role in shaping investor sentiment and market dynamics. The ongoing global economic uncertainty, inflation, and currency devaluations, along with the shift to a more digital economy, are additional factors likely to boost Ethereum's value. At CryptoConsultz, we leverage our deep understanding of the crypto landscape to provide nuanced insights and guidance. Our positive outlook on Ethereum is underpinned by its technological advancements, growing adoption, and the vibrant ecosystem it supports. We believe that Ethereum's strong fundamentals and continuous evolution will drive its value higher in the long term.\n\nMitesh Shah + Read Mitesh Shah's reasoning Mitesh Shah + Read Mitesh Shah's reasoning Prediction $6,500 Buy/sell/hold Buy shopping_basket Ethereum's current price may not fully reflect its long-term value due to its transition to a proof-of-stake model, which is expected to significantly reduce its energy consumption and increase transaction speed. Additionally, the growing adoption of DeFi applications and NFTs on the Ethereum network indicates increasing demand for ETH. On-chain data also reveals a decrease in ETH supply on exchanges, suggesting strong investor confidence and a potential supply shortage, which could drive prices higher by the end of the year, similarly with BTC.\n\nDaniel Polotsky + Read Daniel Polotsky's reasoning Daniel Polotsky + Read Daniel Polotsky's reasoning Prediction $8,000 Buy/sell/hold Buy shopping_basket It seems like during periods of speculation and euphoria, risk assets like ETH outperform BTC. Since we are coming out of a period of high interest rates and entering a post-halving, lower-interest-rate phase, it is possible that a speculative bubble forms. This may help Ethereum even more so than Bitcoin and cause a boom in its price. Ethereum will also be bolstered by Ethereum ETFs, which will begin trading shortly (https://www.coindesk.com/markets/2024/07/15/sec-tells-eth-etf-issuers-fund-can-start-trading-tuesday-source/). Ethereum continues to provide scalingand restaking solutions but also has competitors such as Solana nipping at its heels. While it will likely survive this cycle as the top non-BTC dog, it cannot rest on its laurels if it wants to continue its reign as the number 1 alternative crypto asset.\n\nFred Schebesta + Read Fred Schebesta's reasoning Fred Schebesta + Read Fred Schebesta's reasoning Prediction $7,500 Buy/sell/hold Buy shopping_basket ETH ETF coming. Trump president. More SEC positive rulings. Rate cuts.\n\nSathvik Vishwanath + Read Sathvik Vishwanath's reasoning Sathvik Vishwanath + Read Sathvik Vishwanath's reasoning Prediction $5,500 Buy/sell/hold Hold back_hand Ethereum's price predictions are influenced by its ongoing development, including Ethereum 2.0 upgrades and its dominant position in the DeFi and NFT spaces. The current price reflects its utility and potential for growth as the backbone of decentralized applications. Market dynamics and increasing adoption by institutions and developers suggest that ETH is priced fairly and has strong long-term prospects.\n\nShubham Munde + Read Shubham Munde's reasoning Shubham Munde + Read Shubham Munde's reasoning Prediction $5,600 Buy/sell/hold Buy shopping_basket Multiple use cases, large and active community, and smart contract functionality are some of the key factors i believe will rise the ETH prices sky high.\n\nAlexander Kuptsikevich + Read Alexander Kuptsikevich's reasoning Alexander Kuptsikevich + Read Alexander Kuptsikevich's reasoning Prediction $4,500 Buy/sell/hold Buy shopping_basket We have witnessed a bull market in crypto since last year. The recent decline was just a correction on the way up. ETH got support after the price closed to the $2800 area in July as it was in April and May.\n\nJohn Hawkins + Read John Hawkins's reasoning John Hawkins + Read John Hawkins's reasoning Prediction $2,700 Buy/sell/hold Sell sell ETH may perform better than other crypto in the short term as more Ethereum ETFs are listed. But in the medium term, all crypto (other than stablecoins) are a speculative bubble and their prices are highly correlated.\n\nBen Ritchie + Read Ben Ritchie's reasoning Ben Ritchie + Read Ben Ritchie's reasoning Prediction $5,000 Buy/sell/hold Buy shopping_basket Ethereum has several ongoing catalysts that could push its price even higher. We believe Ethereum is still underpriced, as its ecosystem continues to grow, even with network participants moving to Layer 2 networks instead of transacting on the mainnet. Our prediction of US$5,000 this year is primarily a result of the introduction of an Ethereum Spot ETF, which has potential to increase demand and as we anticipate institutional investors will accumulate and hold spot ETH long-term. Additionally, Ethereum's low inflation rate, and the potential for negative inflation when the network becomes congested, may also contribute to this price target.\n\nPaul Levy + Read Paul Levy's reasoning Paul Levy + Read Paul Levy's reasoning Prediction $4,200 Buy/sell/hold Hold back_hand While Ethereum has the potential to grow significantly, possibly reaching $5,000-$6,000 by the end of the year, it is also experiencing short-term negative signals and market volatility.\n\nMarkus Kraus + Read Markus Kraus's reasoning Markus Kraus + Read Markus Kraus's reasoning Prediction $3,300 Buy/sell/hold Hold back_hand 31 December 2024 (USD per ETH): $3,300 Current market trends and historical data indicate a moderate growth trajectory for Ethereum. The price predictions for 2024 reflect cautious optimism based on past performance and market sentiment. Technological advancements, including Ethereum 2.0 upgrades, will likely enhance its utility and adoption. Regulatory clarity and the deflationary mechanism from EIP-1559 will also support its value. 31 December 2025 (USD per ETH): $4,500 By 2025, Ethereum's broader integration into traditional financial systems and mainstream applications will likely boost its value. The continued interest of institutional investors and the growing acceptance of Ethereum ETFs will be significant drivers. Technological improvements and the deflationary aspects of Ethereum's tokenomics will reduce supply and potentially increase its value. Ethereum's role in DeFi, NFTs, and other blockchain applications will also drive demand. 31 December 2030 (USD per ETH): $16,000 Looking ahead to 2030, Ethereum could become a cornerstone of the digital economy. Its extensive use in DeFi, NFTs, and other applications will solidify its position as a leading platform. Technological advances will make Ethereum more secure and efficient, attracting a larger user base. Global economic factors, like concerns about inflation, may drive more individuals and institutions to seek Ethereum as a store of value and a hedge against economic instability. Highest price (USD per ETH): $3,400 Ethereum could peak at $3,400 if technological advancements and market conditions are favorable. The ongoing improvements to the Ethereum network and its applications in DeFi and NFTs will support this growth. Positive market sentiment and increased adoption will be crucial. Lowest price (USD per ETH): $2,600 Ethereum might drop to $2,600 during market corrections. Volatility in the cryptocurrency market is always a factor. Potential regulatory challenges or economic downturns could affect prices. Changes in investor confidence and market sentiment could lead to this low point.\n\nDesmond Marshall + Read Desmond Marshall's reasoning Desmond Marshall + Read Desmond Marshall's reasoning Prediction $3,800 Buy/sell/hold Hold back_hand Too many celebrity knockoff tokens are still in the market, trying to cash in on the inexperienced. ETH is very heavily manipulated by the team behind, and when crypto market is booming, most likely when Trump takes on the presidency, there will be a new wave of meme coins, NFTs, etc back in the mix to mess with normal people.\n\nDiego Apaza + Read Diego Apaza's reasoning Diego Apaza + Read Diego Apaza's reasoning Prediction $5,000 Buy/sell/hold Hold back_hand Technical Analysis on the charts and price action based on its current performance and trend. Areas of consolidation and dollar amount on their previous breakout.\n\nRuslan Lienkha + Read Ruslan Lienkha's reasoning Ruslan Lienkha + Read Ruslan Lienkha's reasoning Prediction $4,000 Buy/sell/hold Hold back_hand ETH as the second crypto will continue to correlate with BTC's bullish long-term trend with some periods of divergence. At the moment, Ethereum remains to be the most used blockchain for layer 2 projects\n\nRonen Cojocaru + Read Ronen Cojocaru's reasoning Ronen Cojocaru + Read Ronen Cojocaru's reasoning Prediction $5,500 Buy/sell/hold Buy shopping_basket With ETF approval, many new projects are in the pipeline and existing ones are growing.\n\nPedro Febrero + Read Pedro Febrero's reasoning Pedro Febrero + Read Pedro Febrero's reasoning Prediction $20,000 Buy/sell/hold Buy shopping_basket ETH is underpriced considering 90% of all cryptos protocols + devs, use the Ethereum Virtual Machine (EVM). It's the de facto world computer. Plus the ETF which will put $eth on a similar level to $btc for insitutional buyers.\n\nDimitrios Salampasis + Read Dimitrios Salampasis's reasoning Dimitrios Salampasis + Read Dimitrios Salampasis's reasoning Prediction $4,000 Buy/sell/hold Buy shopping_basket The Ethereum Blockchain is undergoing substantial technical upgrade, which however, is not really aligned with the much needed business transformation. The business model around the 'global computer' foundation of DeFi and DApps is valid however competition is increasing. Therefore it will interesting to see how Ethereum will respond to competitive dynamics.\n\nJosh Fraser + Read Josh Fraser's reasoning Josh Fraser + Read Josh Fraser's reasoning Prediction $13,500 Buy/sell/hold Buy shopping_basket Ethereum ETF inflows have potential to impact the price of ETH even more than Bitcoin ETFs impacted the price of Bitcoin. I anticipate ETH ETFs will be a major catalyst for both ETH and the broader industry, and that ETF inflows will bring the price of ETH above $10,000 in the mid-term.\n\nAjay Shrestha + Read Ajay Shrestha's reasoning Ajay Shrestha + Read Ajay Shrestha's reasoning Prediction $2,500 Buy/sell/hold Hold back_hand ETH could potentially reach new highs if it continues to be adopted for DeFi and other applications. But market volatility and external factors like regulatory changes can also influence its price.\n\nMorty Tollo + Read Morty Tollo's reasoning Morty Tollo + Read Morty Tollo's reasoning Prediction $7,000 Buy/sell/hold Buy shopping_basket Ethereum ETF inflows have yet to start\n\nSimon Peters + Read Simon Peters's reasoning Simon Peters + Read Simon Peters's reasoning Prediction N/A Buy/sell/hold Buy shopping_basket spot ETF approval hopefully coming soon, which could allow significant inflows into ETH.\n\nMethodology\n\nFinder surveyed 32 fintech specialists in late June to early July 2024. Panellists can answer as many or as few questions as they like, meaning the number of responses received varies by question. 26 panelists gave their price prediction for ETH by year-end 2024, 2025 and 2030. Panelists may own some cryptocurrencies, including ETH. All prices are listed in USD per ETH.\n\nChanges to methodology: In 2021, this research was conducted using the simple mean of all answers supplied to Finder. From 2022, we switched to using the truncated mean, with the top and bottom 10% of responses removed to attain a more consistent result. Any 2021 results quoted in this analysis have also been re-calculated using the truncated mean.\n\nFinder analyses expert price predictions each quarter. We conducted our most recent survey in October 2023 in which our panel of 31 crypto industry specialists shared their thoughts on how Ether (ETH) would perform through 2030. All prices mentioned in this report are denominated in US dollars. On average, our panel thinks Ether (ETH) will be worth US$1,840 by 2023 before rising to US$5,824 by 2025 and then US$14,411 by 2030. Ether (ETH) price predictions for 2023, 2025 and 2030 ETH's price is expected to rise to US$1,840 by year-end 2023, according to the average prediction from Finder's panellists. This price prediction was down significantly from US$2,451, the average prediction for Ether's price by year-end 2023 from our July 2023 survey. The panellists also predict ETH will hit US$5,824 by 2025 and US$14,411 by 2030. Both of these predictions are lower than our panellists' average predictions in our July 2023 survey, which were US$5,845 by 2025 and US$16,414 by 2030. July 2023 report Price predictions\n\nHistorical Price Predictions \"ETH has a huge growth potential,\" Ruslan Lienkha, chief of markets at YouHodler, says. \"Growth is [currently] limited by high rates in TradFi. In [the] case of reaching a soft landing by US authorities, ETH['s] price will increase dramatically, but not until the middle of next year.\" Ben Ritchie, managing director at Digital Capital Management Pty Ltd, is also bullish on ETH and the Ethereum ecosystem on a longer time horizon, but feels we could see a lower price for ETH in the short term. \"The growing interest in Ethereum staking and [ETH's] exceptionally low inflation rate suggest the possibility of a short squeeze in the future, hinting at promising upside within the Ethereum ecosystem\" Ritchie says. \"[However,] we've adjusted our short-term Ethereum price forecast downward mainly because of potential economic challenges that could lead to a more cautious approach in the overall markets.\" Ryan Grace, head of tastycrypto, has a forecast similar to Ritchie's. \"Like BTC, Ethereum and broadly crypto as an asset class face macro headwinds that likely limit upside price action in the near-term,\" Grace says. \"With short-term rates at +5%, there's less incentive for capital flows into crypto.\" Pav Hundal, lead market analyst at Swyftx, argues that ETH's price is currently low because it's simply following a pattern we've seen before. \"Historically, as we approach a Bitcoin halving, Ethereum tends to revisit its price valuations from earlier that year,\" Hundal says. \"This trend aligns with the repeated observation that Bitcoin's dominance (proportion of the total [crypto] market capitalisation) swells as we near the halving event. We can anticipate that there will be a potential shift from altcoins [like ETH] back into Bitcoin in the lead-up to the halving.\" How high and low will ETH go in 2023? The average peak price our panellists predict ETH will hit by year-end 2023 is US$1,932, with some predicting it will climb as high as US$2,800. The average lowest price our panellists predict ETH will hit by year-end 2023 is US$1,352, with some predicting it will fall as low as US$885. 45% of our panellists feel that ETH's price will rise into the $1,751–$2,000 range before the close of 2023, while 69% think the lowest ETH's price will dip is into the $1,251–$1,500 range. Highest projection\n\nLowest projection\n\n\"While Ethereum (ETH) is still likely to follow where Bitcoin (BTC) leads in terms of overall price trends, its intrinsic value and utility set it apart,\" Nick Ranga, senior cryptocurrency and forex analyst at ForexTraders.com, says. He thinks we'll see ETH at $2,250 before the year is out. \"Due to the wealth of use cases for the Ethereum network and the Ether cryptocurrency, it's future is assured.\"\n\nDamian Chmiel, senior analyst and editor at Finance Magnates, thinks we could see ETH's price as high as $2,000 before the year is out but also as low as $1,000.\n\n\"I wouldn't expect any significant movements in Ethereum for the rest of this year,\" Chmiel says. \"I anticipate it will consolidate between $2,000 and $1,000.\"\n\nDesmond Marshall, MD at Rouge International and Rouge Ventures, believes we could see ETH at $1,200 before the year is out, as he thinks regulatory uncertainty around the asset as well as macroeconomic factors may be holding its price down.\n\n\"The new ETH futures-linked ETFs were a major disappointment to the ETH supporters,\" Marshall says. \"As the regulatory confusion lurks, general retail investors and institutions are weary of jumping on the bandwagon too soon, esp[ecially] with a dwindling job market, employment stats, and a dipping stock market.\"\n\nIs now the time to buy, hold or sell ETH?\n\nAlmost half of our panellists (48%) believe it's a good time to hold ETH, while just over two-fifths of them (41%) believe it's time to buy ETH.\n\nOnly 10% think it's time to sell ETH.\n\n\"Ethereum has great intrinsic value,\" Natalja Zaharova, head of operations at FXOpen LP Ltd, says. \"Its network keeps becoming bigger.\"\n\nPaul Levy, senior lecturer at the University of Brighton, is also bullish on ETH and believes that now is the time to hold the asset.\n\n\"Ethereum is still much talked about, mostly for good reasons,\" Levy says. \"[It's] rooted in iterative innovation, often releasing new features and enhancements that are grounded in decent testing regimes.\"\n\nJeremy Britton, CFO of BostonTrading.co, also believes ETH is a hold, but he's somewhat bearish on ETH for technical reasons.\n\n\"Changing from POW to POS has made ETH less decentralised and less 'crypto',\" Britton says. \"Some of ETH's competitors may cut ETH's market share as people want lower fees and more decentralisation.\"\n\nAlexander Kuptsikevich, senior market analyst at FXPro, thinks it's time to sell ETH based on his technical analysis.\n\n\"Ethereum has tried to stay afloat above 50- and 200-week MAs,\" Kuptsikevich says. \"It went below them, and this move may continue in the following weeks.\"\n\nIs ETH overpriced, underpriced or priced fairly?\n\nThe vast majority of our panellists feel that ETH is either underpriced or fairly priced.\n\nThat is, 43% feel that ETH is currently underpriced and 40% feel that it's priced fairly.\n\nOnly 17% feel that it's overpriced.\n\n\"Ethereum will become the global settlement layer,\" Martin Froehler, CEO at Morpher, says. \"Ether is the first yield-bearing deflationary asset.\"\n\nTristan Thoma, director of government and payments at AlphaPoint, believes that ETH is priced fairly, pointing out that ETH's price will likely continue to increase as crypto becomes more widely adopted.\n\n\"The price is still likely to increase over time as [the] crypto user base grows globally with more confident compliance structures,\" Thoma says. \"[This should] result in [an] organic price increase.\"\n\nJohn Hawkins, senior lecturer at the University of Canberra, thinks ETH is overpriced, despite the uses of the Ethereum network.\n\n\"Ethereum has more uses, [than] Bitcoin,\" Hawkins says. \"[However,] the crypto mania is dying down; Google Trends show interest declining since 2021.\"\n\nHow will the Ethereum community respond to the \"over staking\" of ETH?\n\n41% of our panellists believe that the Ethereum community will not provide a significant response to the \"over staking\" of ETH.\n\nJust over a quarter of our panellists (26%) think the Ethereum community will propose curbing the influence of liquid staking protocols like Lido, while 22% believe the Ethereum community will respond by suggesting a cap of ETH deposits on the beacon chain.\n\nThe following is commentary from some of our panellists who voted \"Other\" in response to the question in the chart above.\n\nMatiu Rudolph, COO at Layer One X, points out that an Ethereum Improvement Protocol – EIP 7514 – \"has been proposed as a short term solution to slow down growth of the active validator set.\"\n\nJosh Fraser, co-founder of Origin Protocol, says \"the Ethereum community will come up with solutions to over staking, such as Origin Ether (OETH). Instead of just earning yield from staking rewards, users can find ways to optimise yield in innovative ways, such as optimising yield through DeFi and liquid staking.\"\n\nBen Ritchie, managing director of Digital Capital Management Pty Ltd, says \"In our perspective, we strongly advocate for the Ethereum community to prioritise thorough due diligence when selecting staking platforms, particularly those aligned with the principles of decentralisation, such as Rocketpool and similar projects aiming to promote network decentralisation.\"\n\nWhen will the tokenisation of real-world assets hit the mainstream?\n\n41% of our panellists think the tokenisation of real-world assets will go mainstream by 2030, while 31% believe we will see this by 2025.\n\nOnly 10% of our panellists think it will go mainstream by 2024 and 7% believe it will never go mainstream.\n\nJosh Fraser believes we'll see the tokenisation of real-world assets go mainstream by 2030.\n\n\"It's not unlikely that total value locked in NFTs will surpass that of DeFi,\" Fraser says, \"as NFT value will include real estate, IP, luxury goods, and beyond.\"\n\nWill the market cap of ETH flip that of BTC?\n\n43% of our panellists don't see ETH's market capitalisation ever flipping BTC's.\n\n23% think it will happen but not until 2030, while 20% are unsure.\n\nRuadhan O, creator of Seasonal Tokens, believes that Ethereum has more utility than Bitcoin, but that ETH won't flip BTC because ETH will be competing with the native coins of other smart contract platforms.\n\n\"Ethereum remains expensive to use [and] it will lose market share to cheaper alternatives,\" O says. \"Bitcoin isn't useful. Nobody needs a Bitcoin. There's no demand for Bitcoin's utility at a lower price, because there's no utility. This is why Bitcoin isn't losing market share to other proof-of-work coins.\"\n\nJosh Fraser feels differently and believes this will happen by 2030 or later.\n\n\"It's likely ETH will eventually flip Bitcoin in terms of market capitalization,\" Fraser says.\n\nMeet the panel\n\nMethodology\n\nFinder surveyed 31 fintech specialists in October 2023. Panellists are able to answer as many or as few questions as they like, meaning the number of responses received varies by question. 29 panellists gave their price prediction for ETH by year-end 2023, 2025 and 2030. Panellists may own some cryptocurrencies, including ETH. All prices are listed in USD per ETH.\n\nChanges to methodology: In 2021, this research was conducted using the simple mean of all answers supplied to Finder. From 2022, we switched to using the truncated mean, with the top and bottom 10% of responses removed in order to attain a more consistent result. Any 2021 results quoted in this analysis have also been re-calculated using the truncated mean.\n\nWas this content helpful to you? Yes No Thank you for your feedback!"
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxQTVZTbFZiaVV4aElLazJuSUpuZVVLRWhKNHNpSWRVVV9IeTJWNWhwSU1PTlRubjZmam5HWjcxSXhZN0pzSVVyODB3aUVDbGVFX3dJRUpCN2VhR0xNR2o0WGJiMGRQVHJVRTNLX0ozaVgzdldiX3UzSVAydzdFU2pYR2VDcnlLTXNPeGY1M2c2b3ljR2tUQ2w2bi0xcVTSAaIBQVVfeXFMTy1Ld0FfMV8tY1JqNERsdV9tNlFDQWdlSnVfYW1VZEpwZmZJMk9VVGZFQkdCOE1iU3F4TlJaYlVSTFBtY0tzMWU5M3RMVlhieEZuTVdNOWJrZ3c4dVRkNHVuVk1UQVFLcHZIcWxteFhpVEpVTzRwd09mVEljTGE3RERXLTE3Y2VHdWMxYnN1X2ZoZnVnV3hqR2V1WVVaQ05iTVlB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Jun 2024 07:00:00 GMT",
        "title": "Crypto Prices Today June 3: Bitcoin Tops $69K, ETH Breaks Above $3,800 Notcoin Soars 16% - CoinGape",
        "content": "The crypto prices today continued to wrestle with volatility, leaving traders and investors speculating about future movements. Bitcoin (BTC) and Ethereum (ETH) have continued to battle market turbulence, with BTC winning the claim above the $69K mark and ETH breaking above the $3,800 mark. However, Notcoin (NOT) extended its price rally to attention-nabbing levels.\n\nThe global crypto market cap increased modestly by 0.35% from yesterday, reaching $2.54 trillion. Besides, the total crypto market volume surged by a staggering 42.15% in the past 24 hours, reaching $64.02 billion.\n\nadvertisement\n\nHere’s a brief overview of some of the top cryptos and their price movements today, June 3.\n\nTop Crypto Prices Today\n\nBitcoin Price\n\nThe flagship crypto, BTC, traded at $68,471.68, a jump of 1.07% over the past day. Its 24-hour lows and highs are $67,315.53 and $68,743.08, respectively.\n\nBitcoin’s dominance, per Coinmarketcap’s data, rested at 52.89%, an increase of 0.23% over the past day. The token’s market cap rested at $1.34 trillion, an upswing of 0.89% during the same period.\n\nAs the day longed, BTC topped the $69K mark, resting at $69,669.\n\nEthereum Price\n\nMeanwhile, ETH’s price saw a trading session dominantly in the red territory, slipping 0.19% at press time to $3,798.25. The token’s 24-hour lows and highs are $3,752.41 and $3,819.97, respectively.\n\nIt’s worth noting that the Ethereum balance on exchanges has been experiencing a dry stock spell since the approval of spot ETH ETFs. Nonetheless, the price trajectory continues to move sluggishly.\n\nHowever, as the day passed ETH claimed a break above $3,800, resting at $3,833.\n\nSolana Price\n\nThe crypto SOL witnessed a 1.56% dip over the past day to $163.45, mimicking the broader market’s performance. The token’s 24-hour lows and highs are $161.65 and $166.33, respectively.\n\nXRP Price\n\nSimilarly, the Ripple Labs-backed crypto fell 0.43% in the past 24 hours to $0.5164. Its 24-hour lows and highs are $0.5093 and $0.5194, respectively.\n\nDOGE & SHIB Prices\n\nDogecoin (DOGE) and Shiba Inu (SHIB) prices waned in the past 24 hours, aligning with the tumbled movement of the meme coins sector. DOGE’s price saw a slip of 0.05% to $0.1598. SHIB’s price slipped 1.47% to $0.00002472. However, Pepe coin (PEPE) jumped 0.19% to $0.00001469.\n\nTop Crypto Gainers Today\n\nNotcoin (NOT) price rallied 31.32% to $0.02277\n\nAevo (AEVO) price surged 14.29% to $1.06.\n\nToncoin (TON) price pumped 10.30% to $6.96.\n\nKlaytn (KLAY) price soared 9.40% to $0.2398.\n\nAlso Read: Notcoin (NOT) Extends Weekly Rally to Over 350% Hitting New All-Time High\n\nTop Crypto Losers Today\n\nORDI’s price fell 6.28% to $45.45 today.\n\nBonk (BONK) price tumbled 5.18% to $0.00003146.\n\nBeam (BEAM) price slipped 5.29% to $0.02744.\n\nBook Of Meme (BOME) plunged 4.65% to $0.01287.\n\nUpon scoping into the top cryptos’ hourly time frame charts, it can be seen that BTC’s price waned 0.03%, whereas ETH jumped 0.06%. Simultaneously, altcoins saw a bag of mixed price actions.\n\nAlso Read: Ripple Vs SEC: Is XRP Prepared For Unexpected Twist Ahead?\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxORkVaNDhmZDg1azhidHUwRHBQN201UGdOSm9YMXNzSWpuSU9RUlZFM0oyekhJSWR1RzY3anlCTEdMOGhUVWNjb0szaGpPbjlTYjNIZDRhcFhTWkFILVZNUjlSRlJ4Z0RDdUtmZFYwM0k4YzFaWG12ZHN3Sm5teEpJdWRXVno?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 04 Jun 2024 07:00:00 GMT",
        "title": "ChatGPT Predicts Ethereum (ETH) Price For June 30, 2024 - Times Tabloid",
        "content": "The Ethereum (ETH) price has been a topic of constant debate and speculation in the cryptocurrency market. Currently trading at $3,750, Ethereum has seen a significant rise compared to the beginning of the year and as June draws to a close, many investors are left wondering where Ethereum’s price is heading.\n\nChatGPT’s Bullish Outlook\n\nOne interesting take comes from ChatGPT, a large language model known for its ability to process information and generate text faster. When prompted about Ethereum’s price on June 30th, 2024, ChatGPT offered a bullish prediction.\n\nWhile it’s important to remember that ChatGPT isn’t specifically designed for financial forecasting, its analysis suggests a potential increase to $4,500, representing a roughly 20% jump from the current price.\n\nWhat’s Driving Ethereum’s Rise?\n\nEthereum’s recent rise can be attributed to a confluence of factors. The Dencun upgrade rolled out in April, improved efficiency and lowered transaction costs, making the network more attractive.\n\nThis upgrade is a stepping stone for future scalability enhancements. Additionally, the thriving DeFi and NFT markets built on Ethereum, fuel demand for ETH as their popularity surges.\n\nNews and Developments Shaping Ethereum’s Future\n\nBeyond the immediate price predictions, other developments could shape Ethereum’s long-term trajectory. Here are a few key areas to watch:\n\nThe Rise of Layer-2 Solutions: Layer-2 scaling solutions like Polygon and Arbitrum are built on top of the Ethereum blockchain to handle transactions faster and cheaper. Continued growth and adoption of these solutions could alleviate congestion on the mainnet and contribute to overall network growth.\n\nInstitutional Adoption: While significant hurdles remain, 2024 has seen increased interest from institutional investors in the cryptocurrency space. If major financial institutions embrace Ethereum, it could provide a significant boost to its price and market cap.\n\nWe are on twitter, follow us to connect with us :- @TimesTabloid1 — TimesTabloid (@TimesTabloid1) July 15, 2023\n\nA Word of Caution\n\nThe cryptocurrency market is notoriously volatile, and past performance is not necessarily indicative of future results. While ChatGPT’s prediction and the current trends paint a promising picture for Ethereum, investors must conduct their research and understand the inherent risks involved before making investment decisions.\n\nWhether Ethereum reaches the $4,500 mark by June 30th as ChatGPT suggests remains to be seen. However, one thing is clear: Ethereum’s future holds immense potential. It will be fascinating to see how it unfolds in the coming months and years.\n\nFollow us on Twitter, Facebook, Telegram, and Google News"
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxOOFlPeUFJYzBZUFl4MWFhaXo0dEJUVnREOFE3TWxyV2FkODBoTEpTWVhKYkY4T1hsXzZVbkptZFItRXJCdEc1bHQwVzJ1UHIyU0l0akFSbWdudUpsZWk4SW5TM3JMLW14dUFuTHhDZjNEUkhKWVE4Y1RyU0p2TzRiTDlfQVh5UDZ1Y29PWnhTcl82LWg1R2hn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Jun 2024 07:00:00 GMT",
        "title": "Solana (SOL) vs. Ethereum (ETH): Which Blockchain Has Better Meme Coins? - CryptoTicker.io - Bitcoin Price, Ethereum Price & Crypto News",
        "content": "Investors in the cryptocurrency market are always on the lookout for high-reward opportunities, especially with meme coins. As the meme coin craze continues, the competition between Solana (SOL) and Ethereum (ETH) has intensified. This article explores which blockchain offers better meme coin investment opportunities.\n\nEthereum Meme Coins\n\nFor those seeking high leverage from Ethereum investments, established meme coins like SHIB, FLOKI, and PEPE are popular choices. Ethereum's robust DeFi ecosystem and recent bullishness from retail investors, particularly around the anticipated Ethereum ETF approval, have fueled a multi-month rally, making these coins attractive for high-risk, high-reward investments.\n\nSolana's Exceptional Rise\n\nSolana has seen a tremendous influx of capital over the past year, climbing the market cap ranks and even surpassing Binance’s BNB Coin at times. Known for its speed, Solana boasts the highest transactions per second (TPS) among major blockchains, making it an appealing choice for many investors. Solana's rapid transaction speeds and lower costs contrast with Ethereum’s slower, more secure network, which is preferred by institutions for its stability and higher cost deterrents against cyber exploits.\n\nSpeed vs. Security: Solana's Advantage\n\nRecent data highlight Solana's impressive performance, clocking 1,053 TPS, significantly higher than Ethereum. While Solana's speed and efficiency appeal to many, Ethereum's slower speeds and higher transaction costs are seen as beneficial for security and institutional adoption.\n\nInstitutional Interest in Solana and Ethereum\n\nInstitutional investment firms like Franklin Templeton and Ark Invest have shown strong interest in both Solana and Ethereum. Franklin Templeton has highlighted Solana as one of its top holdings, predicting accelerated adoption. Meanwhile, Ethereum continues to attract institutional interest, bolstered by potential regulatory approvals and high-profile endorsements.\n\nEmerging Meme Coins: Ethereum's Kai Cat Coin (KAI)\n\nFor investors looking for undiscovered meme coins with high potential, Ethereum's new Kai Cat Coin (KAI) is gaining attention. Currently in presale at $0.0042 per token, KAI has been featured in prominent publications like CoinPedia and Blockchain Today, making it a noteworthy candidate for those seeking the next big meme coin.\n\nBluechip Blockchain Investments\n\nBoth Solana and Ethereum are considered blue chip blockchain assets, offering promising investment opportunities. While Ethereum remains the leader in DeFi with strong institutional backing, Solana's speed and efficiency make it a formidable contender. Investors should consider their risk tolerance and investment goals when choosing between these two networks. For those willing to take higher risks for potentially higher rewards, emerging meme coins like Ethereum's Kai Cat Coin offer exciting possibilities."
    },
    {
        "id": 72,
        "url": "https://news.google.com/rss/articles/CBMiV0FVX3lxTE1Yd2tTN24ySUlrMGktRUJWa1Y3YlNlaVBtRC0xeWlicGRJS2dIWDRtM0ZZd0cyTGVVNXlfZkpyZDhUUjBRUVV4dlAxYjVmcVRoeFhyd0pxOA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 04 Jun 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Prognose 2024 bis 2030 – Knackt ETH die 10.000 €-Marke? - Blockchainwelt",
        "content": "Kryptowährungen\n\n0x 1eco 1Inch Network 8×8 Protocol Aave ABBC Coin Abyss AC Milan Fan Token Acala Token Achain Adshares Alchemy Pay Algorand Alien Worlds Alpine F1 Team Fan Token Amp Ankr Anyswap ApeCoin APENFT API3 Aragon Arcblock Ardor Ark Arweave AS Roma Fan Token ASD Astar Atletico Madrid Fan Token Audius Augur Aurora Avalanche Aventus AVINOC Axie Infinity Baby Doge Coin Balancer Bancor Network Token Band Protocol Basic Attention Token BICONOMY Bifrost Binance Coin Binance USD BinaryX Biswap Bitcoin Bitcoin BEP2 Bitcoin Cash Bitcoin Gold Bitcoin Standard Hashrate Token Bitcoin SV BitDAO Bitgert BitShares BitTorrent BitTorrent-New BNB Bonfida BORA Braintrust Cardano Cartesi Casper cDAI CEEK VR Celer Network Celo Celsius Centrifuge cETH Chain Chainbing Chainlink Chia Chiliz Chromia Civic Coin98 Coinbase Wrapped Staked Ethereum Compound Conflux Constellation ConstitutionDAO Convex Finance Cosmos COTI Counos X Cronos Crypterium Cryptex Finance Curve DAO Token Dai DAO Maker Dash Decentraland Decred DeFiChain Dent DerivaDAO DigiByte district0X Dogecoin Dogelon Mars Dusk Network dYdX Dypius eCash Echelon Prime Ellipsis Elrond Energy Web Token Enjin Coin EOS Ergo Ethereum Ethereum Classic Ethereum Name Service Euro Coin Everscale Exchange Union Fantom FC Barcelona Fan Token FC Porto Fan Token Fei USD Fetch.ai Filecoin Firo Flow Flux Frax Frax Share Freeway Token Fruits FTX Token FUN Token Function X Gala GateToken Gemini Dollar GensoKishi Metaverse Gnosis Goldfinch Protocol Golem Green Satoshi Token Harmony Hedera HedgeTrade Helium HEX Hive Holo Horizen Humanscape Huobi BTC Huobi Token HUSD Hxro ICON iExec RLC Immutable X Injective inSure DeFi Internet Computer Inverse Finance IOST IOTA IoTeX Jupiter JUST Juventus Fan Token Kadena Kava Keep Network Klaytn Kryll KuCoin Token Kusama Kyber Network Crystal v2 Lazio Fan Token League of Kingdoms Lido DAO Lido Staked Ether Link Liquidity USD Liquity Lisk Litecoin Livepeer LooksRare Loom Network Loopring Lukso MAGIC MaidSafeCoin Maker Manchester City Fan Token Maple MATH Mdex Media Network MediBloc Metacraft Metadium Metal MetisDAO Mina MobileCoin Monero Moonbeam Moonriver Muse MVL MX TOKEN mxc MyNeighborAlice Nano NEAR NEM NEO Nervos Network NEST Protocol Neutrino USD Nexo NuCypher Numeraire NXM Oasis Network Ocean Protocol OG Fan Token OKB Olympus OMG Network Ontology Ontology Gas Optimism Orbit Chain Orbs Orca Orchid Origin Protocol OriginTrail Osmosis Pancakeswap Paris Saint Germain Fan Token Pax Dollar Pax Gold Pepe Perpetual Protocol Persistence Pirate Chain PlatonCoin PlayDapp Polkadot Polygon Polymath Powerledger Project Galaxy Prom Propy Proton Pundi X (New) Qtum Quant Quantstamp Radicle Radio Caca Rai Reflex Inidex Rakon Rally Ravencoin Raydium Reef Ren Render Token Request Reserve Rights Revain Ripple Rocket Pool Safe SafeMoon Santos FC Fan Token Secret Seedify.fund SelfKey Serum Shapeshift FOX Token Shentu Shiba Inu SHPING Siacoin SKALE Network Smooth Love Potion Solana Spell Token ssv.network Stacks Stargate Finance STASIS EURO Status Steem Stella Stellar STEPN Storj Storm X Stratis Strike SUKU SuperFarm sUSD SushiSwap Sweatcoin SwftCoin SwissBorg SXP Symbol Synapse Synthetix Syscoin TE-FOOD Telcoin Tellor Terra Terra Classic TerraClassicUSD Tether Tether Gold Tezos The Graph The Sandbox Theta Theta Fuel THORChain Threshold Toncoin Tribe Tron TrueUSD Trust Wallet Token Ultra UMA Uniswap UNUS SED LEO Uquid Coin USD Coin USDD USDX Utrust Vai VeChain Velas Venus Venus USDC Verge Veritaseum Voyager Token Vulcan Forged VVS Finance Waves WAX WazirX WEMIX WINkLink Wirex Token WOO Network Wrapped Bitcoin Wrapped BNB Wrapped Centrifuge Wrapped Everscale Wrapped TRON Wrapped Velas XDC Network XYO yearn.finance Yield App Yield Guild Games yOUcash Zcash Zeon ZeroSwap Zilliqa ZKSpace"
    }
]