[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMi0gFBVV95cUxPUzY2YlpPMU1uQTZpcHdRVHFDX3dWaUwzOEE4WFJrWEZaOUtjMy1LalJaYjFfdDYyTU9QdkhKaElRY1c2U3ZZRnRYUjlidGtkeDlrUGVfclZHVnhYUXY5TmN4bFAxQkhIRUJrX1Itbk9zdW1EbjN4SFN3bnRkb0JlQTFWM0xUY1lveXpYcFlLOUxRcU5rUnRkdkIwdGlLWkV0Rkwtc0lRU1QtRkoyNmkzYjk4czE1RGdCaGdXTG9vcFBqNXVtLWR5WXlFTTdGZm9SR3c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jan 2024 08:00:00 GMT",
        "title": "Most Ethereum Staking Pools Are Using Just One Execution Client, Potentially Increasing Risks to the Network - Unchained",
        "content": "The Ethereum community’s concerns about execution client diversity has intensified, as roughly 84% of all validators are running Go Ethereum.\n\nMost Ethereum staking pools use just one execution client: Go Ethereum (Geth). As a result, some Ethereum enthusiasts have publicly encouraged people to avoid using Geth for their validator duties because of the potential risks of over-relying on one client.\n\nMore than four-fifths of all validators, which are in charge of proposing and validating new blocks of transactions to the Ethereum blockchain, use execution client Geth, according to data provided by the crypto analytics website clientdiversity.org, which covers about 60% of the entire Ethereum network.\n\nEthereum clients are software implementations people can download to run the Ethereum network. In order to perform its duties, a single validator typically runs two clients simultaneously to address different components of Ethereum — the consensus side and the execution side.\n\nNethermind, the second-largest execution client for Ethereum running on about 8% of validators encountered a bug yesterday, Ethereum core developer Łukasz Rozmej said on X. The bug, which has since been resolved, has sparked a conversation about a hypothetical bug impacting Geth.\n\nWhile the consensus side has seen its client diversity improve, execution client diversity on Ethereum is weak. Specifically, the following Ethereum staking pools and service platforms — per execution-diversity.info — likely use Geth as their only execution client for their validator duties: Allnodes, Ankr, Blox Staking, Binance, Bitcoin Suisse, Bitfinex, Coinbase, Kraken, and Stakefish.\n\nIn addition, Lido, the largest liquid staking platform with more than nine million ETH staked, has connected over three-quarters of its validators to Geth as well.\n\nA ‘Supermajority Client’\n\nVitalik Buterin, Ethereum’s co-founder, designed Ethereum to work on different software clients, not just one, so that a bug affecting a single client would not adversely impact the whole blockchain.\n\nHowever, Geth is considered a “supermajority client.” As such, validators that run Geth have the capability to finalize the Ethereum blockchain without agreement from validators running other software clients, such as Nethermind, Besu, and Erigon. This has the potential for disastrous results such as a network split, loss of funds, and reputational damage to Ethereum.\n\n“Should Go-Ethereum, likely to be the majority execution client after the Merge, produce an invalid block, it could get finalized and thus cause the catastrophic failure described in scenario 3,” wrote Ethereum researcher Dankrad Feist in a 2022 blog post. Scenario three entails a hypothetical situation where a client with more than two-thirds of the stake has a bug in its software and includes an invalid block to the Ethereum blockchain.\n\nValidators running a minority client would only lose a small amount of rewards for having a bug, while the cost of having a bug for validators running a supermajority client would be massive.\n\n“Counterintuitively: staking with a minority client bears significantly less risk – those affected by the recent Nethermind bug hardly lost the rewards of one to two days. Being on the wrong side as part of a majority, however, can lead to significant loss of stake,” wrote co-founder of Gnosis Chain Martin Köppelmann on X on Monday.\n\nMeanwhile, Lefteris Karapetsas, the founder of portfolio tracker Rotkiapp, noted on X that “In case of a supermajority Ethereum client bug that leads to complete loss of the stake of those stakers at the moment this would burn > ~20% of the entire ETH supply.”\n\nLido did not immediately reply to Unchained’s request for comment.\n\n\n\nOn Monday night, Coinbase announced on X its goal of including an additional execution client in its validator infrastructure, after the Ethereum community expressed concerns about Coinbase’s single client staking steup revolving around Geth.\n\nThe largest publicly traded crypto exchange in the U.S. said it relied solely on Geth for validation because it was the only execution client that met the company’s technical requirements. But Coinbase said it is open to change.\n\n“Although we’ve evaluated execution clients since 2020, none have met Coinbase Cloud’s requirements to date,” wrote Coinbase on X. “Many other operators on the network have reached the same conclusion, which is part of the reason why 84% of Ethereum validators run Geth. However, the tide is turning.”\n\nCoinbase is currently assessing alternative execution clients, and said it would share their next steps by the end of February.\n\nUPDATE (January 23, 2:00 pm. ET): Updated with details of Coinbase’s announcement."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxOYlhhR1R6eFlydE9na2pTblJGUzVkWC1qOWlVQVQ1ekltSUlfZUU1Z0Y2ZGZxazJlVWFPOGdtelBCU3JrZkUtaGVjLXg4bTlQUldlUV9oQ0EwVEtDRW5xVGFib21PSWwtY3RHYXlJRWFIRWpkY193RG45WGFFODJHR2ZDVnltcUdR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jan 2024 08:00:00 GMT",
        "title": "Why Ethereum Slumped More Than 6% Today - The Motley Fool",
        "content": "Ethereum is seeing significant declines today as sentiment sours around the world's No. 2 cryptocurrency.\n\nMegacap cryptocurrency Ethereum (ETH -1.82%) has continued to sell off in today's session, now having given up most of its gains since the sector-driven mania following the approval of spot Bitcoin ETFs earlier this month.\n\nAs of 3 p.m. ET, Ethereum declined 6.1% over the past 24 hours, dropping below the $2,350 level. This move appears to be tied to a number of market-driven forces, but also some token-specific headwinds that investors are pricing in today.\n\nHere's what's behind today's big downside move in Ethereum.\n\nSignificant Ethereum selling pressure impacting this token\n\nWhen certain investors sell a given cryptocurrency or stock, investors pay attention. Accordingly, news that the Ethereum Foundation (the nonprofit doing much of the behind-the-scenes work to keep Ethereum up and running) sold more than $1.6 million worth of the world's second-largest cryptocurrency has sent shockwaves reverberating through the market.\n\nRecent reports show that this large sale, in which 700 Ether were sold, continues a trend of capital-raising from the Ethereum Foundation. A previous sale of 100 Ether tokens on Jan. 16 from the same wallet suggests that the ongoing development work may be more costly than initially thought, providing some downside selling pressure on this token.\n\nEthereum does have another upgrade on the go, with its so-called Dencun upgrade already underway as of last week. Thus, it's possible that these token sales could dry up as development activity slows, but it's a key factor in the supply/demand equation investors are digesting right now.\n\nAdditionally, concerns around capital flight from the crypto sector, evidenced by more than $2 billion of Bitcoin ETF outflows, has some concerned about the secondary impacts on Ethereum. So far, the excitement around these exchange-traded products hasn't stoked the kind of investment many initially thought would come. For future Ethereum ETFs, that's not great, and this sector-wide selling pressure will likely continue to flow through to the Ethereum ecosystem as well.\n\nWhat to make of today's move\n\nOccasionally, it's important to reflect on the cost impacts various development initiatives have on various blockchain networks and their associated tokens. Given Ethereum's aggressive upgrade schedule and top-tier talent in terms of the developers working diligently on ensuring this protocol's stability, these token sales may not be surprising. But it does appear some in the market have been caught off guard by the corresponding selling pressure and sentiment shift caused by these sales.\n\nThat said, it could also be true that these ongoing upgrades provide outsized value relative to their initial up-front costs. Crypto investors and users want to see an Ethereum network that's as low cost and efficient as possible. That's what this Dencun upgrade aims to achieve.\n\nAdditionally, some recent news around MetaMask launching an Ethereum validator staking feature could result in more locked-up Ethereum tokens, potentially offsetting some of the recent selling pressure we've seen from the Ethereum Foundation and others.\n\nThese effects likely won't offset the institutional capital flight we're seeing from the crypto sector. However, it's the longer-term supply-and-demand dynamics investors will need to consider when it comes to this top-tier crypto.\n\nThus, I think the jury remains out with respect to how Ethereum will perform as it continues its ongoing upgrades in the coming months. For now, sentiment has soured, but long-term investors may want to consider this dip as a potential buying opportunity, as traders look elsewhere to take on bullish positions."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxOdm41ZjdvTUlWZ3JFNU5ld1RTV2ZDNTNFbFRSMjRmVkFtZ0xWVnpiMXpleGd0eWZvSVAwSUUxdlZvRGJaYWZySFNPcG5pNTNUUkVudHNrZ3QtZnR0RXU1MHU5M3lrejI5TE9XSEtzZlpPQlFyQmxiWDltME1hUEtpT0NiY0QzbFhQdlZXQTl3STZOVF91aVNkZy1RczY5WjVwcDhZ0gGoAUFVX3lxTFBCSHhVTzQyOHhQSFQtT3BaZDJHdEZvSjVxZUx6TDhFeDhKZ0J3NUxlOUdvQktBMk9HVko1Wm1lRkM1cTliSmlDWnJZUXVWMFJwQTRQWlJUcGpscXFsOTVXOFRPb3NnZ3VjMlJxOGZmSUZPWlNocmdaRThTcjVzRXBkWngzS1hNQVpzeUFTUk9KbWQyS3hpUXJPVV90TGVRZS1UaERLNDZ0WA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jan 2024 08:00:00 GMT",
        "title": "Here’s How Low Can ETH Go Following Recent 4% Decline: Ethereum Price Analysis - CryptoPotato",
        "content": "In the recent market developments, Ethereum showcased a remarkable upswing, surging to a yearly high of $2717.\n\nHowever, this ascent was met with considerable selling pressure, prompting a slight retracement and setting the stage for a potential short-term consolidation correction.\n\nTechnical Analysis\n\nBy Shayan\n\nEthereum Price Analysis: The Daily Chart\n\nA thorough examination of Ethereum’s daily chart uncovers a significant recent surge, with the price reaching a yearly peak of $2.7K. Simultaneously, ETH has emerged within an ascending expanding wedge pattern, identifiable by the orange lines. This pattern holds the potential for a bearish reversal, contingent upon the price breaking below the lower boundary.\n\nDespite this, after Ethereum’s notable upward movement, the price encountered a pivotal resistance zone, notably – the static $2.7K level aligning with the upper boundary of the ascending wedge pattern.\n\nThis led to a slight retracement. Considering recent market sentiment and price action, there is an anticipation of a continuation in the correction leg, possibly resulting in a pullback to the multi-month ascending wedge pattern (green lines), coinciding with the lower boundary of the recent short-term expanding wedge.\n\nThe 4-Hour Chart\n\nAnalyzing the 4-hour chart, the price faced considerable selling pressure following the impulsive surge, initiating a correction phase. Accordingly, Ethereum seems confined within a crucial range, bounded by substantial support at $2.4K and notable resistance at $2.7K, resulting in a mild downward consolidation.\n\nCurrently, the price has approached the lower boundary of this significant range. Notably, the lower boundary aligns with a significant support region, defined by the price range between the 0.5 ($2408) and the 0.618 ($2335) levels of the Fibonacci retracement. Hence, this offers robust support to the price.\n\nGiven the potential presence of buyers within this critical support zone, an expected scenario is for the price to find support, facilitating a renewed upward movement. However, in the event of a bearish breakout, sellers may target the multi-week ascending trendline as their next objective.\n\nOn-chain Analysis\n\nBy Shayan\n\nThe funding rates are critical in the analysis of Ethereum’s futures market sentiment, as illustrated in the accompanying chart. This metric serves as a pivotal gauge to discern whether buyers or sellers are executing their orders with heightened aggression.\n\nThe chart prominently reveals an upward trajectory in the funding rates metric, mirroring the robust surge in price. This alignment signals a pronounced bullish sentiment prevailing in the market. However, it’s crucial to note that elevated values in funding rates raise concerns about a potential overheated state in the perpetual markets, signaling the possibility of an impending long-squeeze event.\n\nIn the wake of a recent short-term correction, a noteworthy development is the substantial decline in funding rates. This decline signifies that the overall sentiment remains bullish, concurrently indicating a cooling-off in the perpetual markets from their previously overheated state. Consequently, there exists the potential for the price to resume its upward trajectory following the completion of the ongoing correction stage."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMi2gFBVV95cUxPMjZLWXlvN0tibS1IREpENG5RMUVKZU5WTUNZQnlhMXVHSGc0OTdLUUIzSkdOR3NBSjZhNzN1b0lBUlNPWUxCMTNjRC1pN1hGS1htU3ZyQU50QVZmZm1sTTlQa0VJdzJ5dlZURHlGcllOZ1g4YVVmZmZReF9ZSnhGMTA0dVo3NzVJNjJaT04zZFlpamZxRDkwem5yYXBfN3VTdEFQWm1KdUVPNzh3VG1oMUFORE1MWTF2TFNILVFZYm9SOEthRjNidVNCbU5ULUthcWc0OGU4VzhnUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin and Ethereum decline on the week, Worldcoin to launch a new Orb and Terraform Labs files for bankruptcy - TechCrunch",
        "content": "Welcome to TechCrunch Crypto, formerly known as Chain Reaction.\n\nTo get a roundup of TechCrunch’s biggest and most important crypto stories delivered to your inbox every Thursday at 12 p.m. PT, subscribe here.\n\nHello, and welcome back to the second edition of the new and improved TechCrunch Crypto newsletter. As previously mentioned, alongside our regularly scheduled news bits, I’ll be adding some fresh recurring segments and features — so if you do (or don’t) like what you see, let me know at jacquelyn@techcrunch.com.\n\nThankfully, the crypto world wasn’t too chaotic this week — but let’s get into the biggest headlines.\n\nThis week in web3\n\nCrunching numbers\n\nThis week the crypto market saw red as the two biggest cryptocurrencies by market capitalization, Bitcoin and Ether, dropped 7% and 13.5%, respectively, on the week, according to CoinMarketCap data. Even with that said, the global crypto market cap was relatively unchanged on the week around $1.55 trillion.\n\nIn the NFT world, sales volume declined 16.4% over a seven-day period to $248 million, but the number of buyers — and sellers — increased around 50%, according to CryptoSlam data. The top three collections by sales volume were CryptoPunks at $19.33 million, CryptoUndeads at $12.36 million and Ordinals at $8 million, during the same period.\n\nOur favorite ‘Crypto Twitter’ post\n\nBinance went to court on Monday to dismiss the U.S. Securities and Exchange Commission June lawsuit against them — and the judge wasn’t entertaining some of their arguments, as Fortune reporter Leo Schwartz, highlighted below.\n\nIn today’s hearing for Binance’s motion to dismiss the SEC’s lawsuit, Binance’s lawyers are echoing Coinbase from last week that Howey needs a contract. This time, the judge is pushing back. “You’re being a little too cute,” she says, arguing its language is broader. — Leo Schwartz (@leomschwartz) January 22, 2024\n\nThe latest pod\n\nFor this week’s episode, I interviewed Anatoly Yakovenko, co-founder of Solana Labs, the technology company that aims to help grow the ecosystem for the layer-1 blockchain Solana.\n\nThe conversation focused on Solana Mobile and its flagship web3 Android smartphone, Saga, which sold out in mid-December, as well as its new phone, Chapter 2 — which was announced last week.\n\nWithin its first 30 hours, Chapter 2 had over 30,000 preorders — signaling a lot of demand for the next-generation Android-based phone. At the time of recording, Anatoly shared there were over 40,000 preorders.\n\nAnatoly and Jacquelyn discussed the long road to selling out Saga, how important rewards and developers are and the nitty-gritty details for Chapter 2. They also dove into the company’s strategy and long-term mission of going up against Google and Apple app stores and how long it may take for Solana Mobile to break even.\n\nIf you need a refresher on Solana Mobile’s Saga phone, we’ve got you covered:\n\nSubscribe to Chain Reaction on Apple Podcasts, Spotify or your favorite pod platform to keep up with the latest episodes, and please leave us a review if you like what you hear!\n\nFollow the money\n\nPolymer Labs raises $23M to build out the Ethereum blockchain’s interoperability Avalanche-based Masa raised $5.4M to build a “personal data network” Scene Infrastructure Company raised $3M from a16z to expand FWB token’s utility Web3 gaming startup Arcade2Earn raised $4.8M in private token round Ingonyama raised $21 million to improve zero-knowledge technology\n\nThis list was compiled with information from Messari as well as TechCrunch’s own reporting.\n\nWhat else we’re writing\n\nWant to branch out from the world of web3? Here’s some articles on TechCrunch that caught our attention this week."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTE1xcDhBaUp1cWtOY1h5SkNWSWI4cGwxbDduR3R5cHFheTdSd21HTVdLbWxHU0dJT1NyclJuNF9BQmt5S2Rack9BcG1mRXpaZldyLVJsNGZIVVhZOVVzTVBvZk1aMEVxc0FneUc4bFpQSdIBd0FVX3lxTE05VTBCUGN6alVMX2RfZXJsZDJLVFhEOFRCUXU4bjRPaG8yenVOYW1ET3VNVk9XYlo5MnV5cy1yby1oNmtZeVdzMGNwbHNBYXRIQzZNNmhOS3BvQy1MSDVGSDFadVJwY05IdngyQjJNOHVxbHp0aHkw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jan 2024 08:00:00 GMT",
        "title": "Ethereum DeFi Gets ‘Gasless' Trading With New 0x API - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIf you're a regular DeFi user on Ethereum, you’ve likely had transactions fail from time to time because you didn’t pony up enough ETH for gas—0x aims to solve that.\n\n0x—a prominent developer of web3 infrastructure, including the popular decentralized exchange (DEX) Matcha—today announced the launch of their newest trading API: Tx Relay.\n\nTx Relay facilitates “gasless” swaps, or the ability to swap between cryptocurrencies without spending any ETH on gas fees. Gas fees are the costs a user pays to execute a transaction—whether it’s a swap, a mint, or a token approval, it needs gas.\n\nThe problem is, on average, 8-10% of DEX transactions fail, and this figure spikes up to 20% during times of network congestion (when Ethereum is experiencing an abnormally high volume of transactions). The Tx Relay API abstracts away the usual process of pre-emptively setting how much gas you want to use on your transaction by covering all the gas needed for the transaction and combining it into the transaction itself.\n\nAD\n\nAD\n\nThe cost of the gas is then added to the swap, and paid by the user in the form of the token they’re swapping. The API is available today on Ethereum and Polygon, but the team plans to launch on Arbitrum shortly after in Q1 of 2024.\n\nCoinbase Wallet Product Manager Claudia Haddad believes that network fees have been a top pain point for the last few years. The simplified trading experience gasless swaps create is a “huge UX unlock,” she told Decrypt.\n\nCrypto users are no strangers to gas fees and the headaches that come with them. Coinbase, which is both an investor in 0x and a beta tester for the new API, claims that 69% of Ethereum swaps encounter a “not enough gas” error when the user starts the trade. Figuring out gas fees, or getting your transactions to execute at all during times of high congestion, are common pain points for the average crypto trader. They’re also common hurdles for new crypto users.\n\nFor example, gas can typically only be paid in the blockchain’s native token. For example, on Ethereum you pay in ETH. A common mistake many new crypto traders make is not leaving enough Ethereum in their wallet to cover transaction costs.\n\nAD\n\nAD\n\nIn a similar vein, crypto wallet Giddy last year announced what it called the \"first-ever Autogas feature for Polygon,\" which allowed users perform transactions on Polygon without holding MATIC in their balance—paying with the USDC stablecoin instead. “We believe ‘Autogas’ will become an industry standard in the not so distant future,”said Giddy co-founder and CEO Eric Parker at the time.\n\nWith 0x’s new gasless swap, users don’t have to worry about maintaining a balance of whatever their blockchain’s gas token is, the fee is deducted from their trade in the background.\n\nGasless swaps made using the Tx Relay API also benefit from MEV protection. In simple terms, that means protection against bots and other advanced tools. While sophisticated traders often run their trades through private mempools or custom RPCs, most users are either unaware or just plain too lazy to implement the basic protections available. The Tx Relay API aims to abstract this too away from the user.\n\nExample of how a trade using Tx Relay works. Image: 0x\n\nLast year, crypto wallet Giddy announced what it called the \"first-ever Autogas feature for Polygon,\" which allowed users perform transactions on Polygon without holding MATIC in their balance and paying with USDC instead. “We believe ‘Autogas’ will become an industry standard in the not so distant future,”said Giddy co-founder and CEO Eric Parker at the time.\n\nGasless swaps have been pretty popular with 0x users during their beta. Coinbase reported thousands of users using them in December alone. Matcha has also reported that using the feature reduced failed trades by 85%. When asked how the new API would deal with large spikes in network congestion, 0x co-CEO and co-founder Amir Bandeali said cases of congestion-related failed transactions were rare, but when they occur, the transactions would be automatically resubmitted and executed.\n\nIf everything works as expected, this could create a much better overall user experience for crypto traders, and make the task of conducting on-chain transactions less intimidating to new users.\n\nEditor's note: this article was updated to add mention of the Giddy wallet's gasless approach."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTFBGOEV0U0Joa2w1SS1fSWwtRGgwc1JiY0VNc0NkaFlxZWRIRGduTEdOa1FoN3Q2Tm5XV1NGOURCcWV6TzUwV3llSEdIM2ZGYS1YNXgxeE52QThDdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jan 2024 08:00:00 GMT",
        "title": "What Are Parallelized EVMs? A Beginner’s Guide - Unchained",
        "content": "Parallelized Ethereum Virtual Machines (PEVMs) enhance blockchain scalability and efficiency, allowing multiple transactions to be executed at the same time rather than sequentially.\n\nThe blockchain landscape is constantly evolving to overcome limitations and unlock new possibilities. One of the latest innovations to address scalability within the Ethereum ecosystem is Parallelized Ethereum Virtual Machines (PEVMs).\n\nRead on to learn about parallelized EVMs and the potential impact of parallelization on Ethereum’s scalability.\n\nWhat Are Parallelized EVMs?\n\nTo understand parallelized EVMs, let’s first grasp the Ethereum Virtual Machine (EVM).\n\nThe EVM allows for the execution of smart contracts on the Ethereum Network. It provides the infrastructure vital to all transactions happening on the blockchain. The growing adoption of Ether and other Ethereum-based tokens strains the EVM, leading to calls for its scaling.\n\nOne intervention that’s gaining traction is parallelized EVMs.\n\nParallelized Ethereum Virtual Machines (PEVMs) enhance blockchain scalability and efficiency by allowing multiple transactions to be executed simultaneously rather than sequentially.\n\nImagine them as supercharged versions of their predecessor capable of handling multiple transactions together. This approach is crucial in tackling the blockchain trilemma as it significantly reduces latency, boosting transaction throughput.\n\nSome of the front runners in the PEVM adoption are the Sei network, Neon, and Monad. The Sei Network went live in August 2023, attracting roughly 29,000 active users. Neon is also active and working on integrating Ethereum decentralized applications (dApps) into the Solana ecosystem. Meanwhile, Monard is yet to launch despite being production-ready.\n\nHow Do Parallelized EVMs Work?\n\nPEVMs leverage the power of parallel processing to achieve timely and scalable transactions.\n\nUnlike the typical EVMs that handle transactions back-to-back, PEVMs split transactions into smaller, independent tasks that can be tackled simultaneously. This means setting up different points for the concurrent handling of multiple trades.\n\nThere are many approaches to parallel processing, but two popular ones stand out:\n\nSharding : Imagine dividing the Ethereum blockchain into smaller, self-contained shards, each with its own EVM. Transactions are then distributed across these shards, allowing for independent and simultaneous processing.\n\nRollups: These batch transactions off the main Ethereum chain, processing them on a separate layer, and then re-submitting them to the mainnet for verification. This significantly reduces the burden on the main Ethereum network, leading to faster and cheaper transactions.\n\nThe Potential Impact of Parallelized EVMs on Ethereum\n\nPEVMs can significantly reduce transaction times and fees by removing network bottlenecks, making Ethereum more user-friendly and accessible to developers and users alike.\n\nWith PEVMs paving the way for faster and cheaper transactions, Ethereum can potentially handle a much larger volume of activity. This opens the door to widespread adoption of dApps and DeFi, bringing the power of blockchain to a broader audience.\n\nThe increased processing power of PEVMs could unleash a wave of more complex and resource-intensive dApps, pushing the boundaries of what’s possible on Ethereum. Applications that might have previously been impractical on the blockchain could become feasible.\n\nAdditionally, making improvements on Ethereum’s mainnet could significantly impact other Ethereum layers. L2 scaling solutions could gain more attention, leading to further development and adoption among users.\n\nPEVMs, however, also present a possible downside. The technical complexity required to implement parallelized EVMs might lead to centralization if only a few big players can implement it. They could also present backward compatibility and transition challenges to existing smart contracts.\n\nBenefits and Drawbacks of Parallelized EVMs\n\nPEVMs could hold so much promise for crypto enthusiasts. But like any technology, it could have its drawbacks too.\n\nPros\n\nReduced transaction latency: Devolving transaction handling to many units hastens their confirmation. Users will no longer have to endure lengthy completion times due to network clogging.\n\nLower transaction fees: PEVMs streamline transactions, eliminating the need to pay more for prioritized exchanges, which makes transaction fees more affordable.\n\nEnhanced Interoperability: PEVM projects such as Neon are working on bringing Ethereum dApps to Solana. Such initiatives will make it easy for users to interact with their peers on different networks without migrating to their platforms.\n\nCons\n\nIncreased complexity: Implementing and maintaining robust PEVMs can be technically demanding. As such, developers and users may face a steep learning curve.\n\nPotential security risks: Parallel processing introduces new synchronization and coordination challenges, increasing the likelihood of bugs and errors with improper implementation\n\nFinal Word\n\nParallelized EVMs are the latest attempt at achieving Ethereum scalability. By introducing parallel processing capabilities, PEVMs open the doors to various applications, from real-time financial transactions to seamless cross-chain exchanges. However, these novel projects require meticulous development and rigorous security edits to ensure stability."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxOUE9zYk1POUJNZ1Y4d0ZpcGNzQXp2MDE3TlUwU2xtdDVCc3JJaFAzUnprNTlzMkNBUFVvU0xWTW9WNDJoRGlvN3EyTmYtRnNaY0RmaGFaS2FYd3Flb2pKUmtSeFB0N3A1MXpiRC1YU3BPaXZGTEhldWVKejdYR0haZnM2aV9VemFjc2VNUzFTM1BSWjRFaHMzSVR6R3pSdm5KTFJrSEdkZ0RNcjhVNzJBaUM4RlcyMG5PdUwwOElxa0s5LW9KYnJv0gHMAUFVX3lxTFBiMEJlZVhZd2F4ellMNkdCRDNCdWZPRTJocWVFbDNMQkVTWl9NT2N4M2ZYVlB6SnJlUXdTYnVnT1pTb1M5TGpoSlA2N3pTX0FpMk5Ua2dXTzd1N1cxampDc1RiRjNUVGIwVzdnNzRqTlh4S24wZUZFYjBVczNYNlZrTFRta04xbVQ5cmxURHNTbkNCRlZQODFINjNUOXVLMUNXcjZuWlZJTk9SbFVuMS1WcWdGeWIwM0psUWIyM2tkcFc3ai1fdTVhMnZVcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jan 2024 08:00:00 GMT",
        "title": "Crypto Whales Taking Advantage of Bitcoin, Ethereum and Chainlink Dips, According to Lookonchain - The Daily Hodl",
        "content": "Crypto whales are buying up the correction in digital assets markets, according to blockchain tracking firm Lookonchain.\n\nLookonchain says that as Ethereum dipped in price, a “smart whale” with a solid track record of profitable trades bought up the dip with over 3,600 ETH.\n\n“After the price of ETH dropped [on Friday], this smart whale bought 3,600 ETH ($8.9 million) back at a lower price…\n\nThis whale is very good at buying ETH at low prices and selling ETH at highs.\n\nThe profit is ~$25.8 million currently!”\n\nAt time of writing, ETH is trading at $2,470.\n\nLookonchain also spotted a whale scooping up decentralized oracle provider Chainlink (LINK) as it dipped to the $14.81 level.\n\nAfter the price of LINK dropped [on Friday], a whale spent $8.9 million to buy 601,949 LINK at $14.81 with three new wallets.\n\nThe price of LINK appeared to have stabilized after the large whale purchase. At time of writing, LINK is trading for $15.53.\n\nLooking at Bitcoin, the on-chain data tracking firm says that a crypto whale withdrew nearly $30 million worth of BTC from crypto exchange Binance as the price fell below the $42,000 level.\n\n“It seems that a whale is buying BTC!\n\nIn the recent market drop, a new wallet withdrew 700 BTC ($29.36 million) from Binance at an average price of $41,948.”\n\nAt time of writing, BTC is trading for $41,570.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxOTmdYYXJJVmdvY0FQWlZfNTdMZHF6RUlrbXlzRXBtcVE0ekJ1TmZvSlptMmJDZ1RpMlRNWDF2Sl96d19XWjZIY0M4czVrQTB5eWY4SWdrT0xqaF8yV09KQ2lZa0JfUVVZMmlSQUQ2QVRzWE94MjgxblR4MnFja25FR1ZNNnBmMFBieHRyeHZUREJaUdIBlwFBVV95cUxOa0E2THpfZ1VZMVAzZll2SWpZbXR6V2ZkR0tMdE9wNnFDOVdRWDd0aFJiZFF6d0NQbnpmOUw3OGhyalpCV1hzcjZ3TE1iOWExOHRoVnlydXNlcUFZcFlBRFVqTUhWbjBTV2tSQU9GMV9PRmJYd0JpZkctRVlSMVRhem1YWFJoend0ckR6OXFqMS1Neldkdjl3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Remains the Dominant Blockchain for Developers: Report - CryptoPotato",
        "content": "Ethereum continues to be the number one blockchain among crypto developers, with more than 70% of new contract codes first deployed on the network, according to the latest report by Electric Capital.\n\nAlso, there has been a spread in the distribution of developers globally, with more crypto devs living outside North America, as opposed to steady growth recorded in regions such as Latin America and Western Africa.\n\nMore Devs Involved in Multi-Chains\n\nElectric Capital’s 2023 Crypto Developer Report revealed that most of the smart contract code launched on the Ethereum network is unique, while 71% of contracts are first deployed on Ethereum, making it the top blockchain choice for developers.\n\nMeanwhile, the number of multi-chain developers expanded in 2023. Based on the report, multi-chain developers grew from three percent in 2015 to 34% in 2023, signaling a growth of over 10x in eight years.\n\nIt is also no surprise to see the cross-pollination of developers across Ethereum and Ethereum Virtual Machine (EVM) blockchains. Such blockchains include BNB Chain, Polygon, Avalanche, and several layer 2 networks. These chains all use the same smart contract logic as Ethereum.\n\nAccording to Electric Capital, cross-pollination occurs between BNB Chain, Polygon, and Ethereum, with all three chains sharing “at least 30% of their multi-chain deployers with each other.”\n\nFurthermore, BNB shares the largest number of multi-chain devs, with Ethereum at 39%, followed by Polygon at 36% and Arbitrum at 24%, while Avalanche is the lowest at 18%.\n\n40% of Developers Worked on Ethereum and Bitcoin in 2023\n\nIn all, a fourth of all blockchain developers deploy either on Ethereum or Bitcoin, with the latter accounting for a larger number of monthly active developers at 7,864 as of December 2023, which was, however, a 25% drop from over 10,400 the previous year,\n\nBitcoin, meanwhile, recorded 1,071 monthly active developers, declining 19% from 1,322 in December 2022. Most of the decline came from part-time developers and those working on multi-chains, with the report noting that developers who focused solely on Bitcoin were likely to continue working on the network.\n\nMeanwhile, more than 1000 developers have supported Bitcoin since 2017. The highest number of new developers joined the network in 2022, at over 2,700.\n\nAlthough Bitcoin transaction volumes skyrocketed in 2023 following the resurgence of Ordinals, only three percent of all Bitcoin developers worked on the project, while 40% were dedicated to Bitcoin layer 2 networks and other scaling solutions.\n\nApart from Bitcoin and Ethereum, there were also over 9,300 monthly active developers working on the top 200 crypto ecosystems by market capitalization as of December 2023. The figure, however, is a 31% reduction from 2022 records.\n\nTotal Number of Blockchain Devs Fell By Almost a Quarter in 2023\n\nAs noted on Electric Capital’s report, monthly active developers dropped 24% to 22,411 in 2023, from 29,611 the previous year, with newcomers less than one year in crypto contributing to a majority of the losses.\n\nMost of these developers with the least tenured experience came into the industry during the bull market and tended to leave during the bear market. The number of newcomers peaked in 2022 at over 90,000 after Bitcoin’s value rose to more than $69,000 and the total market capitalization at nearly $3 trillion in November 2021\n\n“Newcomers who joined in 2022 are the ones who churned and are driving the overall -24% developer loss.”\n\nIn contrast, those who have been in crypto for at least over a year continue to grow and contribute to the ecosystem, with 75% of codes by such developers.\n\nBlockchain developers with more than one year of experience in the industry grew 16% in 2023, while their established colleagues — people over two years in crypto — grew 52% in the last five years, reaching an all-time high.\n\nThe report also touched on developer distribution globally, stating that 74% are located outside of North America, while the US lost 14% of its developer share since 2018, controlling only 26% in 2023.\n\nBlockchain developers, however, are growing in Latin America, Western Africa, South Asia, Southern Europe, and Eastern Europe, increasing by 20% since 2018."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxQTzZFX1M2YVVhekh1SWtHSkRYS3dFaDBrRU9RV2xzdVlqLVZMYk1XcHdkOXQzeWlaXzg4ZVN3QUR3NlZCU1FYa1RkMUJMazdLekJTdjBId0Q1TXR2V3A0ZjBKM2hLaTF6OG5rNHJqMnQ0WjBUa1JESUI1bm52NUlfYmxBYTFaSHROYURlQTN4cmXSAZYBQVVfeXFMTXZBdzdBNXdWcG02V01WYWxmY0tLZUZNelNRTVJXMUw2SnBGLVFnY3lhdXctZGxQUnBrY05XeGF1U3dJRXZmMDYxVmQ5Zzlray1BQ3hwdUJQaHlzRm96WThjUzdjcG9zUWktb1gyU0NrZ1FKLWlaM01jTGMtdElKNTZXUXdYX1FjNzRSR1pMcWZWWGdPSmtn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jan 2024 08:00:00 GMT",
        "title": "Cardano (ADA) Surpassed Ethereum (ETH) on Multiple Fronts: Details - CryptoPotato",
        "content": "TL;DR\n\nCardano’s whale transaction volumes and NFT sales have been notable lately.\n\nADA’s price has recently underperformed compared to ETH, but experts anticipate a potential rally influenced by upcoming events and developments in the crypto industry.\n\nAccording to IntoTheBlock data, Cardano whales have settled an average of $13 billion in large daily transactions for the past week. In comparison, Ethereum’s figure stood at $5 billion.\n\nCardano whales have been quite active for the past few months. $13B in large transactions (>$100k) is being settled on Cardano daily on average. A significant amount, if you compare it to Ethereum’s $5B 7-day average. pic.twitter.com/8rjeQZaonU — IntoTheBlock (@intotheblock) January 18, 2024\n\nCardano has also made progress on the non-fungible token field, with an NFT sales volume of over $7.6 million for the last 30 days. Ethereum might be a leader with approximately $341 million, but this actually represents a 23% decline on a monthly basis.\n\nDespite the aforementioned developments, Cardano’s ADA has performed worse than ETH as of late. The former currently trades at $0.50 (per CoinGecko’s data), or a 14% plunge on a weekly scale. ETH is hovering around $2,470 and is down 5% for the same period.\n\nHowever, some experts think ADA could be on the verge of a rally, taking into account the importance of several upcoming events.\n\nDan Gambardello (Founder of Crypto Capital Venture) outlined the Coinbase v. SEC lawsuit as a major catalyst, suggesting that a victory for the company might trigger a “mega altcoin run.”\n\nRecall that the regulator sued the exchange last summer, accusing it of breaching several laws and offering trading services with alleged unregistered securities such as ADA, SOL, MATIC, and more.\n\nThose curious to check other Cardano price predictions can take a look at our dedicated video below:"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxNWGVCWVJ3WGZLMkh3NTJyN1V0NzJpX2s5SnprazJwMmdDcXdGWG1ISEJKekxYRnV4eFR6Sm5yUEZ4M1I4Zy1ZTDFJdndZd2JpTU1CUU84YWNwa1BUWkVwTHhSVmNLc0oyVEZjcUMyVW44M0Q0SVBUTXJpUnB4bm9MeFRKVXdLQdIBiwFBVV95cUxORmlXVjUxSWdVaHpwcTBUZ3J4TEVJRlFTbTY4amlDbmFrN1FRbEhMTG5ISDRzeW05UUlTVUstdzFqNDI5clByZmJuLWJtNjJtRjdiZXRMeXJxZ0FacHJmSnM1X3RoLVdabHNDeUZtYS1meUc0WTFEY21tRy1GSUp6Mndac0t0V0VIMjhB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jan 2024 08:00:00 GMT",
        "title": "Crypto Price Prediction: Ethereum (ETH), Solana (SOL), Luna Classic (LUNC) - CoinGape",
        "content": "Crypto Price Prediction: The cryptocurrency market is experiencing relative stability during the weekend, following a bearish trend earlier in the week. This downturn saw Bitcoin, the largest cryptocurrency, fall from a high of $49,000 to $40,300, marking a 17.85% loss.\n\nThis selling pressure is largely attributed to Grayscale beginning to sell its Bitcoin holdings in response to investors offloading shares of the GBTC ETF. The outflow of $2.2 billion from Grayscale’s GBTC and concerns about the Bitcoin ETF being a ‘sell-the-news’ event have led most major cryptocurrencies into a correction phase.\n\nadvertisement\n\nDespite this, several industry experts view the current downturn as a natural correction, necessary for the major cryptocurrencies to gather strength for future growth.\n\nOn the Bitcoin weekly time frame chart, there’s a notable struggle to sustain above the 50% Fibonacci retracement level, around $42,300. This effort to reclaim 50% of the lost value from the recent downtrend reflects a growing conviction among market bulls and a weakening hold by bears on the asset.\n\nWith a positive outlook for the near future, the following cryptocurrencies Ethereum(ETH), Solana(SOL), and Luna Classic (LUNC) can offer suitable pullback opportunities to traders.\n\nWhy Ethereum (ETH) Price Nearing a 22% Breakout Rally\n\nAmid the current downturn in the crypto market, the Ethereum price recently hit a local high of $2700 before starting a correction phase this week. The price now stands at $2487, reflecting a loss of 8.35% over the past two weeks.\n\nA closer examination of the 4-hour chart reveals that this correction is contained within two converging trendlines, forming what appears to be a pennant pattern. If this pattern proves accurate, it suggests that the current correction phase could be a consolidation period, allowing buyers to gather strength for a potential upward movement.\n\nAdding to this bullish perspective is a notable observation by Ki Young Ju, CEO of CryptoQuant, regarding Ethereum’s staking activity. On January 18th, he highlighted in a tweet that 24% of Ethereum’s total supply is now staked, with only 11% available on exchanges. Contrary to expectations of significant unstaking post the Shapella upgrade, the staking rate continues to rise.\n\nGiven these technical and on-chain developments, the ETH price might break through the pennant’s upper trendline, indicating an end to the correction phase. This breakout could potentially spark a rally of around 22%, pushing the price beyond the $3000 mark..\n\nNew Found Support Bolsters Solana (SOL) Price Rally to $125, But There’s More\n\nSolana, the fourth largest cryptocurrency by market cap, has displayed impressive resilience amid the broader market’s downturn, holding steadily above the crucial $85 mark. This level coincides with the 38.2% Fibonacci retracement, signaling that buyers are maintaining a strong foothold.\n\nAs highlighted in a recent analysis by Coingape, the Solana price correction is shaping the ‘handle’ of a larger Cup-and-Handle pattern, a bullish chart formation. This suggests that the ongoing retracement could rejuvenate the bullish momentum, potentially driving the SOL price up by 35% to breach the critical neckline resistance at $125.\n\nA successful breakout from this neckline, particularly if backed by a daily candle closing above it, would be a robust indication of a trend reversal. Such a development could set the Solana price on a path towards a significant target of $255.\n\nTerra Classic (LUNC) Price Wavering In a Mark-or-Break Scenario\n\nThe Terra Classic (LUNC) price has been in a corrective phase since December 2023, with its price dropping from a high of $0.00028 to its current value of $0.000118, indicating a substantial 60% loss.\n\nThe coin found crucial support at the 78.6% Fibonacci retracement level around $0.0000102, changing its course from a downward trend to sideways. The daily chart shows that this consolidation has evolved into a symmetrical triangle pattern, typically a sign of the continuation of the existing trend.\n\nA breakdown below this triangle’s lower support trendline might lead to further price declines for LUNC, potentially towards $0.0000975 and then $0.0000842. Alternatively, a rare upside break from this pattern could signal an attempt by buyers to regain bullish momentum.\n\nIf buyers manage a breakout, they could be looking at an upward rally towards resistance levels at $0.000147, followed by $0.000173, providing a much-needed boost to reverse the bearish sentiment.\n\nRelated Articles:\n\nSahil Mahadik Sahil is a dedicated full-time trader with over three years of experience in the financial markets. Armed with a strong grasp of technical analysis, he keeps a vigilant eye on the daily price movements of top assets and indices. Drawn by his fascination with financial instruments, Sahil enthusiastically embraced the emerging realm of cryptocurrency, where he continues to explore opportunities driven by his passion for trading\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE9HcjY0bGhMYkxVS0g1WEhzUDN6SlA0eFREM3pCOHh3T0drWlh3SWRfWjUwRnRoOHU2ck1NMVpucjN5NFBZNlNLSFM0cHlsRVF2R3g0dUpGWjZaQUhxNWVEUWhIVUpKN3pjaGpIeDM3TVF6ZHQ1QUpCTE1n0gF_QVVfeXFMUFRtT0cxZkREdGhpQUlTajJqczZ3UWJodlRKNlJrMk5FZlNGN01FbjBuYkRTZE9STkgzeFZhNXE0RnJZSi1qWnR6MFp6STdvYV9PZFhnMFRvRjdEZm14ZkZReEdPNWE4TEJHY3BaT3JCNUZYWHR2VmVGOG16ekI0bw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jan 2024 08:00:00 GMT",
        "title": "How Solana, Sui made gains from ETH outflows - AMBCrypto English",
        "content": "Solana and Sui take in Ethereum outflow.\n\nSUI and SOL have seen declines but flash different RSI signals.\n\nSolana [SOL] and Sui [SUI] have experienced significant inflows from Ethereum [ETH] over the past month, according to data from Wormhole. However, it raises the question of whether this has influenced the overall transaction volume on these networks.\n\nSui and Solana take in the Ethereum flow\n\nWormhole data showed that around $370 million in liquidity shifted away from Ethereum in the last month. Sui and Solana accounted for about 90% of this outflow.\n\nPresently, these two networks continue to dominate, with an Ethereum outflow totaling over $106.2 million. Sui received around $68 million, while Solana received approximately $27 million, making up a combined 89% of the outflow from Ethereum.\n\nAnalyzing the Sui and Solana volume\n\nA recent analysis of Sui’s volume on DefiLlama showed a significant uptick in the past few days. Examining the chart reveals that the volume witnessed in January surpassed that of the preceding three months.\n\nThe upward trend peaked on 13th January, reaching over 76 million, marking the highest point in months. As of this writing, the volume was around 44 million.\n\nNotably, Sui’s Total Value Locked (TVL), despite a recent dip from around $344 million to $322 million, remained at its historically highest level.\n\nConversely, Solana has experienced a shift in volume trends. While the network’s volume increased towards the end of the year, it has witnessed a recent decline. Presently, the volume is over $740 million, reflecting a decrease but still outpacing Sui’s volume.\n\nSOL and SUI post different price trends\n\nAnalyzing the daily price trend of Sui showed an uptrend that peaked around 15th January, reaching around $1.3 with a notable 9% increase.\n\nDuring this rise, the price entered the overbought zone, as evidenced by the Relative Strength Index (RSI). After this peak, the price experienced declines, causing the RSI to dip below 60.\n\nAt present, the price has decreased by nearly 5%, trading at around $1.1.\n\nRead Solana (SOL) Price Prediction 2023-24\n\nIn contrast, Solana has dipped below the neutral line on its RSI, reflecting a decline in the price over the past three days.\n\nAs of this writing, SOL was trading at around $92, marking a decrease of over 1% in its price."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxObWpkWlVvSDJmM2tKbUJobW1XUzBVcnNieExRZnlJYUJSdVhNaEdsZHhlN2x2MlF5N25pT3Q5TkRSXzRtMXVkUlhXVjBfVGppOVNjN1FzTU5pQnNLekQ0bDQ1aC1sQy1DXy1wZXVhZDRUTUxnMmJOQ2N1Wk1kcWdIRE1YaUNGczdYYjdYVWNlaFlIejM3c2NfQWVYNWk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jan 2024 08:00:00 GMT",
        "title": "Does stETH have a liquidity issue? Lido says no but not everyone’s convinced - DLNews",
        "content": "If Ethereum's validator exit queue becomes congested, Lido may not be able to redeem stETH for Ether during that time.\n\nstETH holders must then rely on existing liquidity to sell their tokens.\n\nA lack of liquidity for Lido's stETH token could cause it to depeg during a period of extreme market volatility.\n\nAt the start of the year, defunct crypto lender Celsius announced it would withdraw $1.6 billion worth of Ether that it had previously staked onchain.\n\nThe move instantly clogged Ethereum’s staking withdrawal queue so no other Ether stakers could execute withdrawals.\n\nFor most stakers, waiting a few days to withdraw their Ether is nothing more than a minor inconvenience.\n\nBut according to some analysts, such a delay could become a major problem for Lido and stETH — the biggest Ether liquid staking token with over $23 billion worth in circulation.\n\n“The decline of stETH liquidity is a serious issue,” Riyad Carey, an analyst at crypto research firm Kaiko, told DL News.\n\nThe fear is that with low levels of liquidity and a clogged exit queue, stETH, which acts as a receipt on staked Ether deposits, could break its peg with Ether again, causing mass liquidations among those leveraging the token on lending protocols.\n\nInvestor deposits in Lido\n\nAlthough there was no depeg this time, many fear that if the crypto market experiences another sudden drawdown, the Ether staking queue could quickly become extended as investors rush to unstake their Ether and cash out.\n\nLido maintains that stETH is sufficiently liquid, and that there are mechanisms in place to prevent another depeg.\n\nJoin the community to get our latest stories and updates\n\nBut with stETH increasingly intertwined with the broader DeFi ecosystem, the threat posed by a potential liquidity crisis is only becoming more pronounced.\n\nNot enough liquidity\n\nAccording to data from Lido’s stETH liquidity Dune dashboard, there’s currently about $274 million worth of liquidity across decentralised exchanges.\n\nLido’s head of protocol relations Marin Tvrdić said in a recent X post that liquidity for stETH on centralised crypto exchanges is between seven and eight figures.\n\nCarey argues that the current stETH liquidity is insufficient.\n\nHe says that in situations where Ethereum’s validator exit queue becomes congested, there is not enough liquidity to support the more than $3 billion worth of leveraged bets on stETH on DeFi lending protocol Aave, should these positions suddenly need to unwind.\n\nWith the validator queue clogged, there’s no immediate way for Lido to convert stETH into Ether. This means it falls to trading pools that facilitate swaps between stETH and Ether to pick up the slack.\n\nIf stETH starts to break from its peg amid a demand imbalance, it could set off a cascade of liquidations on Aave. “If any large stETH holder gets impatient and sells, things could get ugly,” Carey said.\n\nAnd Carey isn’t the only one who is concerned.\n\nAriah Klages-Mundt, co-founder of stablecoin protocol Gyroscope, said there was a “high likelihood” that stETH will depeg in the future.\n\n“Don’t be too surprised if it happens at some point. You have to plan for things like this to happen at some point in finance,” Klages-Mundt said in a recent X post. Multiple other Ethereum thought leaders have shared similar views, though not all specifically pointed to Lido’s stETH.\n\nTotal market capitalisation of Atheneum's liquid staking derivatives\n\nLeveraging stETH on lending markets like Aave is a popular DeFi strategy to boost returns. Investors deposit stETH to Aave and borrow Ether, which they then deposit to Lido, receiving more stETH.\n\nRepeating this loop compounds the staking yield earning on stETH, but also risks investors getting liquidated if their stETH collateral falls in value against the borrowed Ether.\n\nA strong track record\n\nStill, not everyone agrees Lido’s current levels of liquidity are a concern.\n\nAdcv, a pseudonymous contributor at Lido DAO, told DL News it’s “inaccurate” to say there is insufficient stETH liquidity “in light of the observable on-chain evidence.”\n\n“StETH has institutional-grade liquidity, both on and off chain in major trading venues on mainnet, layer 2 AMMs and major CEXs,” Adcv said.\n\nTo back his claims, Adcv pointed to Lido’s strong track record of fulfilling stETH redemptions.\n\nOut of the 3 million Ether withdrawn from Lido since last year’s Shapella upgrade activated withdrawals, fewer than 30,000 took more than 120 hours to process, he said.\n\nAave, on the other hand, defers to the judgement of DAO service providers such as Chaos Labs and Gauntlet to assess the risks of letting its users leverage stETH.\n\nIn November, Chaos Labs proposed that Aave could increase the supply cap on stETH deposits by another 1.1 million tokens “without introducing significant risk to the protocol.”\n\nBut the recommendation, which was also supported by Gauntlet, came with a caveat: Chaos Lab’s risk calculation assumed no significant price divergences between Ether and stETH.\n\nPreventative measures\n\nAccording to Carey, Lido’s liquidity issues began when it stopped giving out LDO token incentives to liquidity providers of its stETH-ETH pool on Curve Finance.\n\nLido stopped incentivising liquidity because Ethereum’s April Shapella upgrade allowed stakers to start withdrawing their Ether from the blockchain’s staking contract.\n\nThis meant that instead of having to rely solely on the stETH liquidity on exchanges, Lido could instead redeem stETH for Ether if a supply imbalance were to occur.\n\nLido’s own data shows that since the Shapella upgrade, stETH liquidity on Curve Finance fell from around $800 million to $274 million.\n\nOnchain stETH liquidity has fallen sharply since Ethereum's April Shapella upgrade. (Dune/Lido)\n\nAccording to Carey, Lido could do more to shore up liquidity.\n\n“I wrote back in July that I thought Lido should consider engaging with a market maker to help boost off-chain liquidity,” he said. “While off-chain liquidity has improved since then, I do think this would still be worth exploring.”\n\nIt appears Lido is looking for ways to further secure stETH liquidity.\n\nIn August, crypto analytics platform Glass Markets posted a proposal on the Lido research forums requesting a grant to assess stETH liquidity and write a research report laying out the best way to address its recommendations.\n\nA December post from a member of Lido DAO’s operations workstream confirmed that Glass Markets had been granted funds to pursue the research report.\n\nDL News reached out to Glass Markets and Lido to ask about the status of the research report but did not receive an immediate response.\n\nTim Craig is DL News’ Edinburgh-based DeFi Correspondent. Reach out with tips at tim@dlnews.com."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxNUU5EWVhKODNBdWhaNEZiQzg1enFWeFhzemY5UXJydWhURWRtVW5xZEY1VUZ3RU0yWW51RFVORlBvVmNSa2xjZzJvMVVpTGRDUVR0ZVg4VzdCTmtmRGJfU0xMZGxRaWd1R3dhZ1kwSFcxbzNVQ1VoLTRLN1RrSlZKNkp2YUpaVUtUYTJIUkh3dDFsSElyYTRvblp0eGYtbjBMUzVxbjFDQVlyYW1yTXfSAbMBQVVfeXFMUHYzUmM3bDBqUXdpV2dwRXowandXc2hQZ3BZRGM0MVJaVmRweUpUN1dSVHRSeHBQU01LRHFkY3kxNTlScHZ1eEREV0FjRWNkS2NuVGlRaUlmYmY5Qjd4SU9oTDJ1U1JBeXhOa0c3ckxzaS1xZlo1R3FMNUMxc2NXajloZUdndWNvOGRyMUV6b083U0prb1pWWHhEdHNMdWt0QWtlRWxjVWhvdHhnMm1zdU9iV2s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Price Prediction As Spot ETF Speculation Sparks, When Will ETH Hit $4,800? - CoinGape",
        "content": "Ethereum price prediction indicates a bullish trend in the cryptocurrency market. Currently priced at $2,281, Ethereum has experienced a slight dip of 0.41% in the past day. Despite this minor decrease, the currency has shown remarkable resilience, maintaining a value above $2,200 in recent months. This pattern demonstrates a strong bullish inclination among investors.\n\nEthereum price has witnessed a significant rise of over 46% in the past year, an indicator of increasing investor interest. The last 24 hours have been particularly optimistic for Ethereum, with its trading volume soaring to $9.29 billion. This surge points to a heightened bullish sentiment, suggesting potential for further growth in its value.\n\nadvertisement\n\nEthereum Price Prediction: ETH Resilient Amidst Market Volatility\n\nOver the previous week, Ethereum’s price fluctuated between $2,300 and $2,400. Despite this 6% weekly decline, the current market momentum leans towards optimism. Ethereum continues to hold its position as the second-largest cryptocurrency by market capitalization, now valued at $285 billion. This stability in the market underscores Ethereum’s growing prominence in the cryptocurrency sphere.\n\nEthereum price dynamics have recently been the focus of Crypto Busy, renowned crypto educators, and market analysts. They shared insights on Twitter, noting Ethereum’s market behavior post-speculation around an Ethereum-based Exchange Traded Fund (ETF). After the initial surge attributed to the ETF buzz, Ethereum is now experiencing a consolidation phase. This period is characterized by the market stabilizing after the notable increase in Ethereum’s value.\n\n#EthereumNameService $ENS chart update: 👇 Currently consolidating after getting a huge pump from the $ETH ETF speculation. We can see a double resistance as it approach the diagonal and horizontal trendline. Watch out! pic.twitter.com/5TD9IDUvEB — CryptoBusy (@CryptoBusy) January 22, 2024\n\nCrypto Busy’s analysis highlights Ethereum’s critical juncture, highlighting a double resistance scenario. This resistance is encountered as Ethereum’s price trajectory intersects with a diagonal and a horizontal trendline. In the wake of the ETF speculation, Ethereum’s value soared, reaching above $2,600. This peak signifies a substantial milestone and signals the potential for additional market gains.\n\nIf Ethereum successfully breaks through the critical $3,000 resistance level, it could be on the verge of a significant price increase. The next major barrier it faces is at around $3,500. Surpassing this could lead to a bullish trend, pushing Ethereum’s value towards the $4,000 mark. Should this upward momentum continue beyond $4,000, Ethereum might see its value rise as high as the $4,800 resistance level.\n\nDaily Technical Indicators: Will ETH Continue to Soar?\n\nConversely, a failure to overcome the $3,000 threshold could result in a downturn for Ethereum. The first level of support in such a scenario is nearly $2,000. A further decline, especially a close below the $1,900 mark, could intensify the drop, leading to a more pronounced decrease in Ethereum’s value. This makes the $3,000 and $1,900 levels crucial for determining Ethereum’s short-term market trajectory.\n\nThe Moving Average Convergence Divergence (MACD) indicator showcases a bullish trend on the daily chart. This is evident as the MACD line currently hovers above its signal line. Contrasting this, the Relative Strength Index (RSI), also on a daily chart basis, signals a bearish market environment. Its readings linger below the 50 mark. The Chaikin Money Flow (CMF) is also positive at $0.11, indicating a bullish pressure in the near term.\n\nRelated Articles\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxQLTBJSU1oYUw1ZHRGc2V3b1hNZVN4ZjE1REFqNkFaMXhEN3o4YWo0MDZWdWtGZ0syVngxRFk5QlFHTlotMXQwYlNma0xNeDk2cUNZMnVwOVlBVWprMlNxR0dBa3BQQ1FRbUl1dE5vNmNvQ3RnNzNEakZFbzZXLTM1N0Vkai15TkctWG9fUWpn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jan 2024 08:00:00 GMT",
        "title": "1 Unstoppable Crypto to Buy Hand Over Fist - The Motley Fool",
        "content": "After skyrocketing in value last year, Solana will be looking for a repeat performance in 2024.\n\nBitcoin may be getting all the headlines in the crypto industry these days, but there are plenty of other cryptocurrencies that have the potential to outperform it this year, including Solana (SOL -1.55%).\n\nSolana started 2023 trading around $10, and ended the year trading around $100 after briefly hitting a peak around $120 in late December. While it will be difficult to duplicate that performance in 2024, there are two big reasons why I think Solana is exactly the type of crypto that you should be buying hand over fist right now.\n\nSolana is the next Ethereum\n\nMost importantly, Solana is finally starting to fulfill its promise as \"the next Ethereum.\" Ethereum is still the acknowledged market leader in nearly every blockchain niche, from non-fungible tokens (NFTs) to decentralized finance (DeFi). But Solana now appears to be gaining market share at Ethereum's expense. At the end of last year, for example, Solana started to post higher NFT sales volume and decentralized exchange trading volume than Ethereum for the first time ever. And I think that momentum will carry over into 2024.\n\nHigh-profile institutional investors are starting to buy into this narrative of Solana as \"the next Ethereum.\" Cathie Wood of Ark Invest, for example, appeared on CNBC at the end of the year, extolling the virtues of Solana as a faster, more cost-effective version of Ethereum.\n\nAs this investment thesis gains momentum, it could lead to more institutional investors putting their money into Solana. At the end of last year, CoinShares (which tracks crypto inflows and outflows) found that institutional investors were moving money out of Ethereum and into Solana. That's obviously going to help push up the price of Solana.\n\nSolana's mobile strategy is taking off\n\nFor the past 18 months, Solana has been working on a mobile crypto strategy. It all started back in June 2022, when Solana announced it was working on a \"crypto phone\" that would be optimized for Solana blockchain users. That was followed up by the official launch of the Saga smartphone priced at $1,000 in April 2023. And now, in January 2024, Solana appears ready to launch a second, more budget-friendly version of the Saga.\n\nIt's easy to see how physical hardware products such as the Saga could spark long-term growth for Solana. They could lead to more developers migrating over to the Solana blockchain ecosystem and the launch of hardware products could be a fantastic way to onboard \"crypto-curious\" people who have a difficult time conceptualizing blockchain technology. Products such as the Saga could eventually become a pathway to onboard millions of new users into the world of Web3 and decentralized applications.\n\nThe big question, of course, is whether the world really needs a $1,000 smartphone that is optimized for crypto. The major selling point of the Saga was the inclusion of a crypto wallet within the phone itself. That's great if you're buying and selling NFTs, or if you're regularly buying and selling crypto tokens on decentralized crypto exchanges. But if you're an average user, it's easy to see why you might not want to replace your current smartphone anytime soon.\n\nWill this Bitcoin diversion last?\n\nThe launch of the new spot Bitcoin exchange-traded funds (ETFs) could have broad ramifications beyond just Bitcoin. They could significantly impact the amount of new money that flows into Solana.\n\nIn the first two weeks of 2024, the flow of money into Solana has slowed to a drip. According to CoinShares, around the time of the spot Bitcoin ETF launch, Bitcoin accounted for a staggering 98% of all investor inflows into crypto.\n\nMaybe this is a short-term phenomenon. But what if it's not? For that reason, I'm keeping a close eye on institutional inflows into Solana over the next few weeks.\n\nAll in all, Solana looks good\n\nAnd, of course, there are many investors convinced that Ethereum will be able to fend off any advances from Solana and retain its position as the preeminent Layer-1 blockchain. There's also hype now building around a potential spot Ethereum ETF. If that ever gets approved, the thinking goes, it could have the same type of impact on Ethereum as the spot Bitcoin ETF has had on Bitcoin.\n\nThat being said, I'm still convinced that Solana is now a better long-term play than Ethereum. Solana has superior technology, as well as a potential game changer in mobile crypto. As a result, I'm bullish on Solana."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMimAJBVV95cUxOMFlJbExicGd4RWtka0FLS3o5WVZPdmNBVldvbTVZSGFqZ1d1Y3R4YjFpY0d4dUJ6N09ESHVLNFhBeHRZcXNOM1lYQVFGT2hjVGZhbkp6LUtUaWE2X3FCRldqbmhPeXFRcTdJaHUyVlRrX0xOVTNfaVlVYkJsWVJwVENwYkZNQU9ObVZZT3ozUkxZZ3RHREV5MTFXZktFYm1FeWppakFLemNiMVJVSVo4Z29vdG1UMVlIQk5CZzNaNW82cmczSDk1YzNURExwUGd0UjNidFdHQVI5LTJWZlRpYTBOc3ZNZjRDanA5ZVhkRGFJMC1qMzV6UnhqclBLNHd4QzlXLUE5OUJpX09xOFJ4R2VlRjR6aDcz0gGeAkFVX3lxTE92bXhkRDFJanh4Z3E1cWZ5RGkzZGpfSkQ2S005dDdBWm9Jd08wRU1VMkFMY0Y0VFdNT25OV2FxMmtvUHppaF9EWnlWVEI2TUtwTFdVczZqNF9HblZuYnJMNWdrWXlzUkJnWFZOYklBNmlGbmFvNUh3X0FISFl2MTZFalNKcjVoVHFzcmZfWUxRa1p3eTFTeWN2eHBKcmh2TWRkYV9vZ1k4YlBoX0huT1hyT05PcXlmY3AxeFRIZ3FsRV91UTJ1R2tKQmhxTXJxZUpfakU1LUNuMnE2czlneERtMEIxa01Ya2lQUGZfMnp6dndZQlN4VzlTMzA4Tm53eGM0RUxhTXk5cnFNaTF5Ri1UdmpRXzhKQVFFZGZONkE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jan 2024 08:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin falls below $41,000; Solana, Dogecoin decline over 4% - The Economic Times",
        "content": "Did you Know?\n\nThe world of cryptocurrencies is very dynamic. Prices can go up or down in a matter of seconds. Thus, having reliable answers to such questions is crucial for investors."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxOSGJ0amg4eUlvdEpFcDRRazlGMWJzUmhDeHdOSlEzaThTRHhuTE15Z2NVVTlMdFdFY2lOS2RZU0Q1NzduSFFnM2tZaURsUkZFWGJLazhNQ3Y0TTBWcGVJV3J0cE5tYUd0UzA4VFZfTWFOWmFEbjMyY2VaUWdyYWhHbU82WTBpMmR5SmtqeG9UTEloWFFtN3hYRWRIUEJKUVlOVExmVVhKV0xjRVlORFBnbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jan 2024 08:00:00 GMT",
        "title": "Protect Yourself From Identity Theft By Using Zero-Knowledge Proof, Solidity, and Ethereum - hackernoon.com",
        "content": "Identity theft is a growing concern in the insurance industry. According to a Javelin Strategy & Research report, identity theft has risen in recent years, with over $17 billion stolen directly from U.S. consumers in 20171.\n\n\n\n\n\nBlockchain technology, specifically Zero-Knowledge Proof (ZKP), Solidity, and Ethereum can provide a secure and efficient solution to prevent identity theft.\n\n\n\n\n\nIdentity theft can have devastating consequences for its victims, including damage to their credit, finances, and reputation.\n\n\n\n\n\nThe insurance industry is particularly vulnerable to identity theft, as it deals with sensitive personal and financial information on a daily basis.\n\nHow Zero-Knowledge Proof Can Prevent Identity Theft in the Insurance Industry.\n\nZKP can be used to verify an individual's identity without revealing any personal information. By using ZKP, insurance companies can verify the identity of their customers without storing sensitive personal information in a central database, which is vulnerable to hacks and data breaches.\n\n\n\n\n\nThe three fundamental characteristics that define a ZKP include:\n\nCompleteness: If a statement is true, an honest verifier can be convinced by an honest prover that they possess knowledge about the correct input.\n\n\n\n\n\nSoundness: If a statement is false, then no dishonest prover can unilaterally convince an honest verifier that they possess knowledge about the correct input.\n\n\n\n\n\nZero-knowledge: If the state is true, then the verifier learns nothing more from the prover other than the statement is true.\n\nHow It Works:\n\nZero-knowledge proof (ZKP) algorithms are cryptographic algorithms that allow one party to prove to another party that a given statement is true without revealing any additional information beyond the mere fact of the statement’s truth.\n\n\n\n\n\nA common analogy used to explain ZKP is that of a person trying to prove they have visited a country. The verifier can ask a series of questions that only someone who has visited the country would know the answer to.\n\n\n\n\n\nIf the person answers the questions correctly, the verifier can be certain that the person has visited the country.\n\n\n\n\n\nHowever, the person does not have to reveal additional information, such as the names of people they met while visiting the country. This way, sensitive information is protected.\n\n\n\n\n\nThis innovative approach offers a potent shield against identity thieves. They can't steal what they can't see, making fraudulent claims based on stolen identities significantly harder to pull off.\n\nBuilding Using Solidity and Ethereum\n\nBut how do we put ZK-Proofs to work in the insurance world? That's where Solidity, a programming language specifically designed for smart contracts on the Ethereum blockchain, comes in.\n\n\n\n\n\nSmart contracts are self-executing agreements stored on the blockchain, a decentralized and secure public ledger.\n\n\n\n\n\nIn this scenario:\n\nIdentity data encrypted: Your identity information is encrypted and stored on the Ethereum blockchain using ZK-Proofs.\n\nSmart contracts control access: Insurance companies build smart contracts that interact with your encrypted identity data on the blockchain using ZK-Proofs.\n\nClaims verification streamlined: When you file a claim, the smart contract automatically verifies your identity through ZK-Proofs without revealing your personal information. This allows for faster, more secure claim processing and minimizes the risk of fraudulent claims.\n\nCreate a Solidity Identity Verification Smart Contract.\n\nBuilding a Solidity smart contract with zero knowledge (ZK), proofs involves implementing a system that allows parties to prove the authenticity of certain information without revealing the details of that information.\n\n\n\n\n\nIn this tutorial, you'll create a basic smart contract for identity verification using ZK-SNARKs (Zero-Knowledge Succinct Non-Interactive Arguments of Knowledge) as an example.\n\nPrerequisites:\n\nRemix IDE: Access Remix at Remix. Zokrates Toolbox on Remix: Open Remix IDE and go to the \"Plugins\" section.\n\nSearch for \"Zokrates\" and enable the plugin.\n\nStep 1: Write the Solidity Smart Contract\n\n// IdentityVerification.sol pragma solidity ^0.8.0; contract IdentityVerification { struct User { string name; string email; string country; } mapping(address => User) public users; mapping(address => bool) public isVerified; function verifyIdentity( uint256[2] memory a, uint256[2][2] memory b, uint256[2] memory c, uint256[3] memory input ) public { require(!isVerified[msg.sender], \"Already verified\"); // Verify the zk-SNARK proof using the provided parameters require(verifyProof(a, b, c, input), \"Invalid proof\"); // Mark the sender's address as verified isVerified[msg.sender] = true; } // Function to verify the zk-SNARK proof function verifyProof( uint256[2] memory a, uint256[2][2] memory b, uint256[2] memory c, uint256[3] memory input ) internal view returns (bool) { // TODO: Implement zk-SNARK verification logic here // Use Zokrates-generated verifier.sol or implement your own logic. // For simplicity, this example assumes you have a verifyProof function. // Replace the following line with your verification logic return true; } }\n\n\n\n\n\nThe IdentityVerifier contract is an ERC721 token representing identities.\n\n\n\n\n\nThe contract owner can create identities using the createIdentity function.\n\n\n\n\n\nThe verifyIdentity function is called by the owner to verify an identity using a ZK-SNARKs proof.\n\nStep 2: Write the ZoKrates Program\n\nCreate a file named root.zok with the following content:\n\ndef main(private field a, private field b){ assert(a * a == b); return; }\n\n\n\n\n\nStep 3: Compile the ZoKrates Program\n\nOpen Zokrates Toolbox on Remix IDE.\n\nIn this example, you will prove knowledge of the square root a of a number b:\n\n\n\n\n\nClick on \"Compile\" to compile the ZoKrates program.\n\n\n\n\n\nIf no errors occurred, you should see a successful compilation message.\n\n\n\n\n\nNext, click on compute (Computes a witness for the compiled program.), and input the correct values in the fields a and b .\n\nThe keyword field is the basic type we use, an element of a given prime field.\n\nThe keyword private signals that we do not want to reveal this input but still prove that we know its value.\n\n\n\n\n\n\n\n\n\nIf everything is successful, then you will get a response similar to this\n\nComputed successfully!\n\n\n\n\n\nClick on setup (Creates a proving key and a verification key); if the setup is successful, you will see this message. Click the accept button.\n\nIf successful, you will get a similar response with a file created as verification_key.json\n\n{ \"scheme\": \"g16\", \"curve\": \"bn128\", \"alpha\": [ \"0x210423c94fc66d164c8bd2468f84f8c9a7d968fa6387b3b93b0ceeac46fd82e5\", \"0x0ebb3f8d44c365d2d8f2e2291b462dba174119094a6d2b0ec2d4d8eb5c22022f\" ], \"beta\": [ [ \"0x081d89caafe161719b18d52eba13b4d49bbf1773df90ef557fecc15df3e754da\", \"0x175b8d80b480f5a657720e09187ea07e0f652646cb0eef8cac65101266b7d996\" ], [ \"0x0de3c067c14984ff114248511f6ab765fef3ed50cb1976041f3a6050abe4de18\", \"0x206e47582c1032a44cdf5482d42d5f3efee886096f6b463f2ea1b12fdc005625\" ] ], \"gamma\": [ [ \"0x0ddca49b4ddd0e4d72d47577c8ff1e7b38f10236d09076ad34940f5a7dd6c551\", \"0x1257c4524fc1d08ccf3d2b400a6df7096b3023fe76cac8c88702e3b66e5faec6\" ], [ \"0x10636e95862ef1dc713a1cde4a484e83702e4adf518eb7cc3c0f18c696d8647a\", \"0x126e8393f2e8d6d5e283b496f478203bd4778d36ac761970f8e25103b05c698a\" ] ], \"delta\": [ [ \"0x22beccba27f69307089b2204564cac62c6da1c36b8715ef5104c0a7995239a6d\", \"0x02e36e20e8398e7b894123f164e08cd36cce842893929901d00aed2adc939a63\" ], [ \"0x07a981bf40998e83f012638d25a1aa6443144c87d8a559344879cdcd354004fe\", \"0x304d5624ba0c6331808865534aae8426c23b82ea908fc2f0ecf96e33318099e1\" ] ], \"gamma_abc\": [ [ \"0x0b51d2854f317c749ff6b08ae0a141b7910ef4f9f89cfe8792848da778a17292\", \"0x2f0183ef10bb7039a39c1fd99be786cae7243bccaf0efb15856a293d5f70691a\" ] ] }\n\n\n\n\n\nClick the Generate button to generate a proof for computation of the compiled program using the proving key and computed witness.\n\nClick the accept button, copy your Verifier inputs, and save it in a safe place; you will need it later.\n\n[[\"0x1899357b6a4dde55cf33faa0e44d0a20bc6493a5431b0cc08f725b9f72a2469a\",\"0x148015243e143145b3156befd13f956b9384774bdfc028ce3de4b3573dbf596c\"],[[\"0x2f255b3eaae2bb31993384cf5d7dd99a1298418a945a4fca963dea30089e7832\",\"0x27419401db75b3494397179a8fb29df56d83661651380b9cd0911b01d73a7996\"],[\"0x040a7240b43396c13acaf09a7623a931357e085e51507804e4d0f69290804951\",\"0x118c58bbb70afc6eeb400c3c41b7a65462cc42fc1523ec0ca31d4aabcfcb983f\"]],[\"0x2e93bc4b403285b54f7010585abd43baf1d9ded3c6ec45a8f5efcba5f66aae10\",\"0x143ebda58260d826feddc28223505dcf95c2a7d5308b004348755e0a12c16323\"]]\n\n\n\n\n\nVerify\n\nTo validate the proof, go to the Deploy & Run Transactions plugin, paste the remix-compatible parameters into the verifyTx field, and click the transact button.\n\n\n\n\n\nExport Verifier and click the Export button; this generates a Solidity contract containing the generated verification key and a public function to verify a solution to the compiled program.\n\nIf everything is successful, you will get a generated Solidity code.\n\n\n\n\n\nCompile your solidity smart contract by clicking on Solidity compiler and this button Compile verifier.sol\n\nOnce you are done, go to Deploy & run transactions plugin , and choose Verifier — verifier.sol from the dropdown list. Click Deploy.\n\nIf successful, you will get a response similar to this:\n\n[vm]from: 0x5B3...eddC4to: Verifier.(constructor)value: 0 weidata: 0x608...70033logs: 0hash: 0x2b9...89208 status 0x1 Transaction mined and execution succeed transaction hash 0x2b9a4491c6063adfb13e1d594d3cb98cef9bbac44c4c14d60953b302dd989208 block hash 0xc225885a56852a274e6e22af6c52dd3b89a09a7294fb8c3f52c94c93a260afec block number 2 contract address 0xd8b934580fcE35a11B58C6D73aDeE468a2833fa8 from 0x5B38Da6a701c568545dCfcB03FcB875f56beddC4 to Verifier.(constructor) gas 1229172 gas transaction cost 1069141 gas execution cost 941773 gas input 0x608...70033 decoded input {} decoded output - logs []\n\n\n\n\n\nConclusion\n\nThe fight against identity theft in the insurance industry requires innovative solutions. By harnessing the power of Zero-Knowledge Proof, Solidity, and Ethereum, you can create a future where identities are secure, claims processing is streamlined, and trust is restored.\n\n\n\n\n\nWhile challenges remain in terms of technical complexity and industry adoption, the potential benefits of this technology are undeniable.\n\n\n\n\n\nProtecting policies and people from the invisible thieves of the digital age is no longer a futuristic dream but a tangible possibility within reach by embracing blockchain technology."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxNNU9kM3U3STVwcDZHek1BVTJNb0V1czJzTzV1Qm5MSFdfN0RVS1F6dzk5dG9UZl82bkpOZ0lXSi1LWXRQdkd6NjI2UHR4Zm9KNlFYVjN1ZzhHa0xLaDJtYjhKRkRiSWlqdUxaLXI4UWx1dDQwelVBaEdyOWotWFh3Y3lod2ZGSXdxZWtCZG9CVV9RVXZiVGtHcHR3SDR3bkNPSk9HSENxRzJMVlJKcnc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jan 2024 08:00:00 GMT",
        "title": "Cardano ($ADA) Outshines Bitcoin, Ethereum, and Polkadot in Key Metric - CryptoGlobe",
        "content": "The popular smart contract platform Cardano ($ADA) has maintained its top stop in cryptocurrency development activity, outperforming other major digital assets including Bitcoin ($BTC) and Ethereum ($ETH).\n\nThat’s according to data from on-chain analytics firm Santiment, which noted that the “blockchain of blockchains” Polkadot ($DOT) and its public pre-production environment Kusama ($KSM) came in second and third place respectively. Notably Optimism ($OP) came right after, ahead of other major digital assets.\n\nThe term “development activity” refers to the amount of work completed by a cryptocurrency project’s developers on the project’s public GitHub repositories within the past 30 days.\n\nUnlike other measures, Santiment’s metric focuses on “events” rather than the total number of commits. Events encompass various actions taken on GitHub repositories, such as pushing a commit, forking a repository, or creating an issue.\n\nThis approach provides a more accurate representation of the developers’ actual work, as it prevents duplication or inaccuracies that may occur when measuring development activity solely by commits.\n\nFor instance, forking creates a duplicate copy of a repository, including all previous commits. By counting the forking action as a single event, Santiment avoids falsely attributing older commits to new developers.\n\nSantiment’s data comes at a time in which the total value locked on Cardano’s decentralized finance (DeFi) protocols has started dropping from a high above the $400 million mark, to now stand close to $330 million.\n\nDespite the drop, some analysts are bullish on ADA. According to popular cryptocurrency analyst Ali Martinez, Cardano’s current consolidation phase mirrors that of late 2020, when the cryptocurrency was trading at around $0.10 per token.\n\nIn 2021, Cardano witnessed a significant price surge amid a wider cryptocurrency market bull run, surging to the $2 mark before correcting to $1.12 by mid-2021. The cryptocurrency then kept on surging, to hit an all-time high near the $3 mark. Cardano’s price then started dropping amid a wider crypto bear market, and now trades at $0.5 per token.\n\nPer the analyst, if history repeats itself, ADA could resume its upward trend around April to hit $0.8 in the near future, before enduring a brief correction to $0.6. ADA’s price could then skyrocket to the $7 mark.\n\nFeatured image via Unsplash."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMi-AFBVV95cUxNSHNZOUVmWjlZWUlueHVjT3BOdWFuNE0tTi1QN29YNlhKTUZfVFJvSVEtcm9yalR0X3BXNnJueGRfSTRCbTlqeV9WMFZEclRYaEpGeDVReEg4dmpveGNWTkp6dWZTVTZ6WFpGaGd2c3RaVGp0eG9uU3hmYkdZamFYeTF6MGFYZ3NMLWNKdDZMYTl5MzF5eDljTHR2RlFmMkdkWHE4NDVaVzN1NmJsSHB6RlRsQ3FwdjNQTFdfTklTVmNQZG9PS3puTUlnS01HY3ZHRTVWN29NS0hpbDlneHdCY1VlSHRYX0ZDcG1NdGRHa1BQQUxob0U1NQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jan 2024 08:00:00 GMT",
        "title": "Crypto Buzz: XRP ETF Speculations Surpass ETH, While Pullix (PLX) Gains Massive Traction with 11,000 Presale Registrations in a Month - Techpoint Africa",
        "content": "Despite the major bear markets and fluctuations in price that Ripple coin (XRP) is facing, the cryptocurrency has managed to put up well, showing a strong resilience. A speculation about a Blackrock XRP ETF approval after Ethereum came up online last year, leaving most investors wondering what will become of XRP’s price, however, this news was later debunked as fake news.\n\nHowever, this year, the CEO of Ripple foresees an expansion of cryptocurrency-related ETFs to cryptos like Ripple, following the establishment of Bitcoin ETFs. Notwithstanding, Ripple coin still shows a promising price outlook just like Ethereum. On the other hand, Pullix is positioned for a higher rally as over 11,000 users joined its presale in a month.\n\nRipple’s CEO, Brad Garlinghouse Foresees ETFs Approval for Other Cryptocurrencies\n\nRipple (XRP) CEO is optimistic about the approval of various Bitcoin exchange-traded funds (ETFs) in the United States, expecting them to pave the way for similar cryptocurrency investment products in 2024.\n\nWhile he didn't explicitly predict approval for an ETF for Ripple, Garlinghouse anticipates that an Ether ETF will likely receive the green light soon.\n\nIn another talk with Thinking Crypto, James Seyffart doubts the chances of a spot XRP ETF in the U.S. by 2024, attributing it to the unresolved Ripple and SEC lawsuit and the absence of a comparable regulatory framework for Ripple.\n\nHe suggests that only after the Ripple and SEC case concludes and U.S. crypto regulations improve might a spot XRP ETF be considered, possibly in 2025, resolidifying Ripple as one of the top crypto coins.\n\nJP Morgan’s Prospect of an Ethereum (ETH) ETF Approval in the U.S.\n\nMarket optimism surrounds the potential approval of a spot Ethereum (ETH) ETF by May 23, the SEC's deadline for the Ark 21Shares application. JPMorgan gives a 50% chance for approval, influenced by Ethereum being seen as the next ETF candidate after Bitcoin.\n\nSome believe the SEC's omission of Ethereum in recent lawsuits hints at potential commodity classification, a key for ETF approval. However, JPMorgan analysts led by Nikolaos Panigirtzoglou express skepticism, seeing less than a 50% chance for approval by May.\n\nThe recent surge in Ethereum price this year is tied to hopes for an ETF approval, providing U.S. investors exposure to Ethereum without direct ownership. Ethereum price is currently on a weekly range of $2,450 to $2,600\n\nThe shift in how Ethereum operates and the ongoing legal issues with the SEC regarding certain exchange services are making it tough to approve an Ethereum ETF until these matters are resolved.\n\nPullix’s (PLX) DeFi Potential, Innovative Features, and Projected Market Growth\n\nWith over 11,000 participants, the Pullix (PLX) presale has garnered substantial interest in its DeFi market potential. Pullix stands out by merging features from centralized (CEX) and decentralized (DEX) exchanges, aiming to create a platform that overcomes common issues in online trading, such as asset limitations.\n\nThis innovative approach positions Pullix uniquely, allowing trading across various asset classes, including forex, gold, and cryptocurrencies, leveraging the significant $6.6 trillion daily volume of the forex market.\n\nThe presale has seen 70+ million PLX tokens sold, with the current value at $0.08—a 100% increase from its initial price. Experts anticipate a potential 280% increase before the presale concludes, ranking PLX among top crypto coins this year.\n\nWithin the Pullix ecosystem, exciting features include Copy Trading, enabling users to replicate successful trades, and a Lending Protocol, providing a flexible money market for lending and borrowing.\n\nThe PLX native token serves a dual purpose as a trading tool and as part of a revenue-sharing model. Stakers stand to receive a portion of Pullix's daily revenue positioning PLX as a good crypto to buy for gains. Furthermore, users can stake various currencies like DOGE and ETH for a fixed interest rate.\n\nVisit Pullix\n\nJoin The Pullix Communities"
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMi_gFBVV95cUxNZTdBSllhc1BjSlZwSWtPcG9MX1dERmItb2VYN2FHLV9SUmJwdjlLbkNEZE1leFNyYS1zOXR0cXd2TmZuWVgxTXNZWXhaUG1BYXdScnp2cDktQkplUXFpOXloT0YzMmNIZU1ocVpxd3Z0SmpmMEMzSnBKczc4X3FmeXZSLWptVzdIclBqYUZDRU5FRERtc2tSUlBKd19DdGNzMGF6R1QtS19WaTJhdlFsQzZEN3JNTTZLX1o5dmtzY2E0R3hhMVFaa0RZZllOcG1LXzFwSy1ORE5yeGpUTE9IbHRrdGNmLVJvdlFUX3hIbEFaa194dk1FcE16U3RxZ9IBgwJBVV95cUxObkJRamlfOHBxcDQyT0VQREVWVDJHaGtDRHZnaEh2T19DSWZyUGVIODN2TjUxTzh5WlRMTmNFSUJsc3RqdXk4a3RfZndHdzBKQUJfNUozQVlNVURXZU0tSXhfekV3OWtzZmU5NVkzcWpKNmNLcTQybUlHdXdzN3otTF8tMlk3QUhyOTRoaVNMcUgwdS1kOXhXR1lWUDU2WTcxN0tkOTNMa2FKVTlCU2RvWG90WV95LUdmbHRXdFV1c2ZCcFVRcnYzelVUa3A1YUoxeXB5UG5yblpJaTdCc1psekVGZUdXWVBZb2stVGcybGI3dERHZGZfbEh3eXlnc0VQWnc4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jan 2024 08:00:00 GMT",
        "title": "Cryptocurrency Price Today: Bitcoin Dips Below $41,000, Helium Becomes Biggest Loser - ABP Live",
        "content": "Bitcoin (BTC), the oldest and most valued cryptocurrency in the world, slipped down to the $41,000 mark early Monday. Other top coins — including the likes of Ethereum (ETH), Dogecoin (DOGE), Solana (SOL), Ripple (XRP), and Litecoin (LTC) — landed in the reds across the boarrd. The Manta Network (MANTA) token emerged to be the biggest gainer of the lot, with a 24-hour jump of over 15 percent. Chiliz (CHZ) became the biggest loser, with a 24-hour dip of over 10 percent.\n\nThe global crypto market cap stood at $1.62 trillion at the time of writing, registering a 24-hour loss of 1.65 percent.\n\nBitcoin (BTC) Price Today\n\nBitcoin price stood at $40,999.03, registering a 24-hour dip of 1.50 percent, as per CoinMarketCap. According to Indian exchange WazirX, BTC price stood at Rs 36.55 lakh.\n\nEthereum (ETH) Price Today\n\nETH price stood at $2,421.45, marking a 24-hour dip of 2.11 percent at the time of writing. As per WazirX, Ethereum price in India stood at Rs 2.15 lakh.\n\nDogecoin (DOGE) Price Today\n\nDOGE registered a 24-hour loss of 4.33 percent, as per CoinMarketCap data, currently priced at $0.08322. As per WazirX, Dogecoin price in India stood at Rs 7.40.\n\nLitecoin (LTC) Price Today\n\nLitecoin saw a 24-hour gain of 1.20 percent. At the time of writing, it was trading at $71.99. LTC price in India stood at Rs 6,240.49.\n\nRipple (XRP) Price Today\n\nXRP price stood at $0.5409, seeing a 24-hour loss of 2.23 percent. As per WazirX, Ripple price stood at Rs 47.46.\n\nSolana (SOL) Price Today\n\nSolana price stood at $89.15, marking a 24-hour dip of 3.68 percent. As per WazirX, SOL price in India stood at Rs 7,902.\n\nTop Crypto Gainers Today (January 22)\n\nAs per CoinMarketCap data, here are the top five crypto gainers over the past 24 hours:\n\nManta Network (MANTA)\n\nPrice: $2.60\n\n24-hour gain: 15.44 percent\n\nFrax Share (FXS)\n\nPrice: $9.42\n\n24-hour gain: 1.96 percent\n\nRonin (RON)\n\nPrice: $2.35\n\n24-hour gain: 1.76 percent\n\nFlow (FLOW)\n\nPrice: $0.8053\n\n24-hour gain: 1.65 percent\n\nLitecoin (LTC)\n\nPrice: $71.90\n\n24-hour gain: 0.91 percent\n\nTop Crypto Losers Today (January 22)\n\nAs per CoinMarketCap data, here are the top five crypto losers over the past 24 hours:\n\nChiliz (CHZ)\n\nPrice: $0.09424\n\n24-hour loss: 10.39 percent\n\nSei (SEI)\n\nPrice: $0.6164\n\n24-hour loss: 9.48 percent\n\nSui (SUI)\n\nPrice: $1.02\n\n24-hour loss: 8.10 percent\n\nBlur (BLUR)\n\nPrice: $0.5832\n\n24-hour loss: 6.58 percent\n\nMina (MINA)\n\nPrice: $1.08\n\n24-hour loss: 6.33 percent\n\nWhat Crypto Exchanges Are Saying About Current Market Scenario\n\nMudrex co-founder and CEO Edul Patel told ABP Live, “Bitcoin consolidated at the $41,000 level over the weekend with a battle between bulls and bears for market control. As BTC trades above $40,000, the likelihood of a sideways movement between $41,000 and $42,000 is significant. On the Ethereum front, the current valuation stands at $2,400, but a failure by bulls to reclaim the $2,500 zone could prompt a drop to $2,400 in the upcoming week.”\n\nCoinSwitch Markets Desk noted, “Even as the US stock market index S&P5000 saw its biggest one-day gain last Friday, Bitcoin failed to impress investors as it is still hovering around the $41k mark. With every slight lower move of BTC however, altcoins have been bleeding as the ETH/BTC pair too failed to hold above the 0.06 bitcoin per ethereum mark. With a lot of hot altcoins like Arbitrum currently trading on trend line support, Monday US hours would be very crucial to see which way the market will take this week.”\n\nSathvik Vishwanath, CEO and co-founder of Unocoin, said, “Bitcoin is holding steady above $41,000 and has seen a slight gain of 0.25% followed by 0.75% decline quickly, right now bitcoin is trading at $41,300 .The speculation comes as X (formerly Twitter) unveils plans for a dedicated Payments account, fueling anticipation of cryptocurrency integration. But the Commodity Futures Trading Commission's shadow looms as Debiex falls victim to a $2.3 million romance scam, highlighting ongoing challenges in the digital asset space. Ethereum is holding steady around $2,400, with traders monitoring signals for a potential rally. Bitcoin and Ethereum are facing pivotal points, with price forecasts indicating cautious optimism while acknowledging neutral market trends. Investors continue to monitor key levels and potential developments in the evolving cryptocurrency landscape.”\n\nCoinDCX Research Team told ABP Live, “The bearish trend persists for BTC, displaying a downtrend movement as it encounters resistance from the 20EMA on the 4-hour chart. Presently, it is hovering above the $40,500 support level; however, there's no clear confirmation of a reversal or uptrend at this point. ETH, too, is navigating below the 20EMA D after a considerable duration and is currently slightly below the support level at $2,450. It's positioned just above the $2,390 support level. The overall outlook for ETH appears bearish, and a potential pullback might be anticipated from the key level at $2,390.”\n\nSubscribe And Follow ABP Live On Telegram: t.me/officialabplive\n\nDisclaimer: Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Cryptocurrency is not a legal tender and is subject to market risks. Readers are advised to seek expert advice and read offer document(s) along with related important literature on the subject carefully before making any kind of investment whatsoever. Cryptocurrency market predictions are speculative and any investment made shall be at the sole cost and risk of the readers."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMi-wFBVV95cUxPaWlKcm40ZTdPSDlqSXVEY1ZuQThDNG1aN3NyRy04akpEYXZHY1c0akM3ZHRPOVBPLXdMM2hkQmxEZFpEZTZ6T1ZjY0t3Rl8xTFFJVUFubGVEeXNVc29SVWN2Zi1ZVW5VNXJ2OG8yNERncWNBbjVDQ1YxcTJSa1NBTDRUZzlZcVNSaktWc0pyQTVyaUw3MmNIUVdVWVpKc0RaNHdQaFNiaTB2a0lodlo0S2tBVlBBREtLWHJNVUJkd2lTMDRMWGVUZl9NOHU1MVhMcXBOTkxHNWx3ajR3VS1VMk1ya3BCc0xOeWNmc1c4SnpLdTNaMHJXMUxBMNIBgAJBVV95cUxNTXZSUE5qZ0EzSXo0ejc4eGJVQ2wzaEdUZERxa0tKeXZRSl9Fd1lEaHNDRXVUTlRwSVVZOHp0dTlILVdrSE8wNDNPR0VuVTRoUERZWDQtdXVUZGdPbDVPR1RIMnVKb1FPUkp3M0pYdWlRc0xlSjFSQzNGV1NmMTdNdkhOTENrUkxGQXo1UTZJX1I1SDlKdzBUMG1lMVVkX2hRMXlCMUx6d1dieVE1b1pkbUQ1NFZ3MWEyajZiazQzcHdoV1RtMzJTNE55RVh5dkFJeFUyc0xBS0hSVXctbUhWVmhwTFFvcC1lT3k4OWJVQURtUkQ5S1UzZzk1Z3FwUmVt?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jan 2024 08:00:00 GMT",
        "title": "Crypto News Highlights: Crypto Community Reacts to Warren’s Sanction Claims - CoinGape",
        "content": "Crypto News Highlights: Terraform Labs (TFL) files for Chapter 11 bankruptcy protection in Delaware. The debtor reports assets between $100-$500 million and liabilities of $100-$500 million. The petition declares that funds will be made available to unsecured creditors. CEO Chris Amani stated that bankruptcy filing will help the company come out of the legal and other setbacks.\n\nThe crypto market cap falls nearly 2% to $1.61 trillion amid a broader selling pressure. Bitcoin price pullback to trade near $41,000, down almost 2% with no major change in trading volume in the last 24 hours. Top altcoins Ethereum, Solana, XRP, Cardano, and others tumbled 2-5%. Ethereum price is trading at $2,431, down 2% in the last 24 hours."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTFBmOG9YV1FMbjFLSGUtSVZpTU5RdDJEU01oOVM5cndWNE1LaW1nNkl2UmtISDNXRkRnZUNVNG02bkxERHkyTTJmSWxlQmhrdzRubzZmNm5HUWFjQU9Ta3pwR3kxM09WM2trTzBTQ3MzTnA2LXliZk4wNG9n0gF_QVVfeXFMTlk1emdSSVl1WVhEX2tENS1wR3dPWnVBT1BJMGFJcGVDTklyaDJFRzljVzlZTm9WRU4xY1Y2WHRYUDRZRlFkR2U4SGNkaE8zdjR6N1NzVEoxWnZ2bGhQM093bDlCaHFhOHFYaTNsdzNsa3l3MXZsZGM1RFlsOXo5dw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jan 2024 08:00:00 GMT",
        "title": "Aave V3 Ready For Solana After This Crucial Vote Passed - NewsBTC",
        "content": "The Aave community has overwhelmingly approved a proposal that will set the ball rolling for deploying Aave V3 on Solana, a smart contracts platform. The motion, put forward by the Neon Foundation and the Aave Chan Initiative (ACI), passed with a majority vote of 83% based on results posted on January 21.\n\nSolana Fast Rising, DeFi Ecosystem Active\n\nSolana has been rapidly expanding, with its native currency, SOL, emerging as one of the top performers in 2023. To put it in perspective, SOL prices exploded from about $10 in 2023 to around $125 by the end of the year.\n\nThis surge saw SOL reverse losses of November 2022 while concurrently catalyzing events on the blockchain, spurring various activities, including the expansion of decentralized finance (DeFi), non-fungible token (NFT), and meme coin activities.\n\nRelated Reading: Bitcoin Price Turns Red, Why BTC Could Tumble Below $40K\n\nOn the other hand, Aave has been expanding to multiple Ethereum Virtual Machine (EVM) compatible networks, emerging as one of the leading decentralized finance (DeFi) protocols. According to on-chain data from DeFiLlama on January 22, Aave manages over $6.9 billion worth of assets across ten chains. A big chunk, over 90%, comprises assets on Ethereum. Aave v3 has a total value locked (TVL) of $4.9 billion.\n\nAave V3 On Solana, What It Means\n\nThe TEMP CHECK proposers are keen on Aave v3 deploying on Solana, considering the blockchain’s rapid growth in the past year. They observe that the blockchain’s DeFi TVL and broad user base would likely benefit the lending and borrowing protocol, cementing its position as a market leader.\n\nIf Aave is deployed on Solana, the protocol will access the deep liquidity on the blockchain. At the same time, users will access Aave services more conveniently. Subsequently, the proposers reiterated this move will cement Aave’s position as the leading liquidity market on-chain. Moreover, it will likely open up new opportunities for collaboration between the Aave, Solana, and other Neon EVM communities.\n\nRelated Reading\n\nXRP Crash Fears Mount As Whale Dumps 26 Million Tokens – Details 8 months ago\n\nNeon EVM is a cross-chain bridge for users to transfer assets between Ethereum and other blockchains. Through this bridge, Aave v3 will go live on Solana without any major reconfiguration of the protocol’s codebase. Among the tokens that will be initially supported is SOL. Users will be free to borrow USDC, a stablecoin.\n\nThe passing of the TEMP CHECK also reflects Aave’s ambition to expand across multiple blockchains beyond EVM networks. So far, Aave has been deployed on various platforms, including layer-2s like Arbitrum and Base, Avalanche, and Ethereum’s sidechain, Polygon.\n\nFeature image from Canva, chart from TradingView"
    }
]