[
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxNeWR6bnJUUHhaZFo2MjBCZjkyZkhQNlBuVHBqMUNMcmFISXJ6TGhyYXU0VnNseE9KT0tnbU0tM0ZDYmZmX1NHUkwwS3Axa25GV0RkX2VjZElWUnNod2w4aXFTcjM5UmRGSlg4YnV5MS1iY1BfbjQxQ3RHZnA1U3lMbGFva1JQTEhE0gGOAUFVX3lxTE1SZlZSMFJrRWt6ODZNRjlEa2FYMXo0enJmSWtqcHdkYkllR2R2NlhET1dFTzItUE9EU09YZTFIbGY1ZDhDVG84WV9HbGJKemFETkNzaXB2cFJGMjlwSVcwMTkzenJSVVAybmk1UUliNGNOOUNOZHJDYmhmeTlJVTBpakNyZ1VoNllOYVVlakE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 17 Mar 2024 07:00:00 GMT",
        "title": "Ethereum: Will fresh demand again push ETH past $4K? - AMBCrypto News",
        "content": "New demand for Ethereum now sits at a year-to-date high.\n\nIts DeFi and NFT sectors, however, witnessed declines in the past week.\n\nThe daily count of new addresses on Ethereum [ETH] assessed on a seven-day moving average reached a year-to-date (YTD) high of 116,000 on 14th March, according to The Block’s data dashboard.\n\nThis marked a 35% increase from the 86,000 unique addresses that appeared for the first time in a transaction of the native coin in the network on 1st January.\n\nEthereum’s rally in new demand to a YTD high came amidst a surge in its on-chain volume. AMBCrypto found that transaction volume on the network, also assessed using a seven-day moving average, attained a YTD high of $7 billion on 11th March.\n\nAs transaction volume rallied, the average fee paid per transaction on the network also climbed. According to The Block’s data, this reached a YTD high of $25 on 11th March.\n\nThe DeFi and NFT sector fails to react\n\nDespite the recent uptick in demand for the Ethereum network, its decentralized finance (DeFi) and non-fungible token ecosystems have witnessed declines.\n\nFor example, the total value of assets locked (TVL) across the DeFi protocols housed within the chain declined by 5% in the last week. Per DefiLlama’s data, Ethereum’s TVL was $53.4 billion.\n\nOut of the top 10 DeFi protocols on Ethereum, only one (ether.Fi) recorded a TVL hike in the past seven days. The rest of them witnessed a decline.\n\nThe network’s NFT sector recorded a 21% decrease in sales volume in the last seven days.\n\nAccording to CryptoSlam’s data, despite the 90% uptick in the number of traders trading NFTs on the network during that period, the transaction count fell by 2%.\n\nIn the last seven days, 166,000 NFT transactions worth $130 million were completed on the Ethereum network.\n\nLook before you leap\n\nThe network’s native coin ETH sold for $3,721 at press time. Per CoinMarketCap’s data, its value dropped by 6% in the last week. The decline followed a sharp fall in Bitcoin’s value on 14th March, when its value was below $68,000.\n\nHow much are 1,10,100 ETHs worth today?\n\nAn assessment of ETH’s performance on a daily chart revealed that its Awesome Oscillator (AO) indicator has posted red upward-facing histogram bars since 11th March.\n\nAn asset’s AO measures market trends and changes in momentum. When it displays red upward-facing bars, it suggests increasing negative momentum in the market. Traders often interpret this as a signal to consider selling or entering short positions."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMi2wFBVV95cUxOM1dhODZKeTM2bVAyYjg5NWlHQlU3bDkwRXJMaGpRbTlDSVdxT1h1dnRHQnpMN3ExLUREZkxKZDAwWFlXQ3ZKVE9jRVBwMUJfajZKdXZDdEN4cWo3RUV2b0ltR2VLdEY4dzU2TDZDZGdWVFN0Z2lyZjhVWHRjU0p4TGxVVGNjRkZlZ1FSQkRKMXVZV0tvSFVLb0hPUW5yTGdtYk1FeFJfR0JuY2V5d1JULVltelVtd0k1M29qeEtKOHFEYklweFhrQVA4bWlMUXJSeWtmRUFwaDM4TTjSAeABQVVfeXFMUEJSSkQ3MUdWZ0xsQUl1LXk2U28yX1pfMG90QllSRmFhb3FEcWRmbExWVlJzMWlJTmpUOXVOeHpYcWVmY0VGQ2lOeS0wM2lDN3JvRmJNTmY5TUdQYlNYcF9ENmNseVo1cnpoai1rX2RKcG53NWQxWUFWS0Q0MWxQcTlEUzUzdV9oUXhHR18wWkgxVFpodHpsT0NzdVdlVjZ1cWRBTHAtRU1UeE9EWC0wd0ZCdWU0VXBYQVc4cTR2bDZLTmt1VlhQSTlHemdNbC1aSVhiVzhZcTlGd2RsTDdfTmc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Mar 2024 07:00:00 GMT",
        "title": "Trader Says Large-Cap Ethereum Rival To Explode by Over 180% This Cycle, Updates Outlook on Floki and Chainlink - The Daily Hodl",
        "content": "A widely followed analyst and trader is offering his forecast on three crypto assets.\n\nStarting with the fifth-largest crypto asset by market cap, the analyst pseudonymously known as Inmortal tells his 209,800 followers on the social media platform X that Solana (SOL) could replicate its rival Ethereum’s (ETH) explosive rally from early 2020 to late 2021 and skyrocket by similar multiples.\n\nEthereum went up from the low of a price of just under $90 reached in March of 2020 to an all-time high price of just below $5,000 which was recorded in November of 2021.\n\nFrom the current price, Solana could go up by approximately 182% from the current level, according to Inmortal. If the fifth-largest crypto asset were to reach Inmortal’s peak-of-the-cycle target, Solana would have recorded a 60x gain from the December of 2022 low.\n\n“Previous cycle ETH went from $80 to $4,800.\n\nThis cycle SOL will go from $8 to $480.”\n\nTurning to Floki (FLOKI), Inmortal says that the memecoin is undergoing vertical accumulation, a situation where the price of an asset range-trades while gradually inching upwards.\n\nBased on the pseudonymous analyst’s chart, it appears that Inmortal is suggesting that FLOKI could fall significantly after breaking above the all-time high of slightly under $0.00034 before going on to rally in a parabolic move.\n\nFLOKI is trading at $0.000247 at time of writing.\n\nNext up is the blockchain oracle Chainlink (LINK). According to the pseudonymous analyst, LINK could be preparing for the second wave of a rally.\n\nBased on Inmortal’s chart, it appears that the analyst sees LINK rallying by around 68% from the current level to a price of $32.\n\nChainlink is trading at $19 at time of writing.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMi5AFBVV95cUxOaDFYSEs1ejN4M0RGdnFnOTlpX1pnZnpLSWU1MVIxQTgtb1hYQ2Q4TXYyRVM2QkFBS0diX1djX2pHU01Ic1JfQlhuZ0xxOGJYQ1RBVkNGamlLM3Bwdm9fSXhqTnhFYzFOZFBnbF9RVHA4VlVaVm1JMTR2VkdIN0l0UzdYMFYxT0hVcnNfdVdGM1RndndCRVcya2RSMnByeUxBdzlwSXFTTldPeUVfSXg3c3BWZ2ZOY2F3SHVDZjdVdXFVOWE0OTJ3UDRKdkp0VHRGVWhmOXFXMG95dEJHUnZtdHMxZG_SAeQBQVVfeXFMTmgxWEhLNXozeDNERnZxZzk5aV9aZ2Z6S0llNTFSMUE4LW9YWENkOE12MkVTNkJBQUtHYl9XY19qR1NNSHNSX0JYbmdMcThiWENUQVZDRmppSzNwcHZvX0l4ak54RWMxTmRQZ2xfUVRwOFZVWlZtSTE0dlZHSDdJdFM3WDBWMU9IVXJzX3VXRjNUZ3Z3QkVXMmtkUjJwcnlMQXc5cElxU05XT3lFX0l4N3NwVmdmTmNhd0h1Q2Y3VXVxVTlhNDkyd1A0SnZKdFR0RlVoZjlxVzBveXRCR1J2bXRzMWRv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 17 Mar 2024 07:00:00 GMT",
        "title": "Stellar Lumens Challenges Ethereum: Ripple Rival Expands Reach with Smart Contracts – XLM Poised to Dominate The World - Crypto News Flash",
        "content": "Stellar Lumens is set up to challenge Ethereum in the smart contract space after the launch of the Soroban project.\n\nThe Ripple rival is looking to dominate the market, and with the launch of the smart contracts platform and its innovative financial technology infrastructure, it is set up to lead its rivals.\n\nEarlier this year, the Stellar Development Foundation (SDF) confirmed the launch of the much-anticipated Soroban platform. Deployed through the “Protocol 20” upgrade, which was deemed the greatest upgrade since the launch of the Stellar Lumens network, this platform sees the network rival Ethereum.\n\nAs CNF reported, with the new Soroban project, the network will compete with Ethereum, which has been the leader in the smart contract space. It will further enable the network, which was primarily built as a payment blockchain, to attract developers, users, and new applications.\n\nWith the capability to host decentralized applications (DApps) and smart contracts, this marks a new era for the Stellar blockchain. The network becomes a direct rival of Ethereum, which is regarded as the king of smart contracts and the platform for building them. Over the years, several blockchain platforms, including Cardano, Solana, and Polkadot, have challenged Ethereum, but none has been able to topple the world’s second-largest cryptocurrency project.\n\nBut with Stellar, this could be the greatest test for Ethereum yet. Stellar Lumens has already shown its superiority in financial applications. Often regarded as a Ripple rival, not only was it co-founded by a former Ripple co-founder, but it also sought to shake up the financial sector. Specifically, Stellar aims to bank the bankless, bringing financial solutions to those who lack access.\n\nAs highlighted by CNF, the project has recorded numerous successes in this regard. More recently, the Stellar Development Foundation (SDF) has made a case for open banking innovations. In an open letter to the US Treasury, the Stellar Development Foundation (SDF) responded to the U.S. Department of the Treasury’s Request for Information on Financial Inclusion, emphasizing the importance of access and leveraging technology to advance financial inclusion efforts, supported by Stellar Lumens (XLM).\n\nWith the new upgrade, the project will look to lead the finance revolution with tokenization, digitizing real-world assets for faster transactions. The adoption of Soroban could be accelerated due to its working relationship with traditional financial institutions, including WisdomTree, Deloitte, Franklin Templeton, and Circle.\n\nGoing after Ripple and Ethereum, both of which are ranked higher by market cap, could be a big undertaking for Stellar. But it could offer a chance to become the only go-to network that encompasses everything a user and developer could want or need.\n\nAt the time of writing, XLM is trading at $0.13 after a drop in the past 24 hours. The token is now down by nearly 10% on the weekly chart. Although the altcoin is struggling to break out of its long-term bearish trend, popular crypto analyst EGRAG expresses optimism for Stellar (XLM) and foresees a rise to $5 due to its expanding potential.\n\nRecommended for you:\n\n[thrive_leads id=\"228374\"]"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxPejhZdk11STE4QVpyT2trSVo4aGhMRmtfX3B3aUtmSnktdlJrci1SMUp4QW1nWVdfM1l2WDduanVyUnZnR2RWU0NjOUhfS0x2T0ZsVHBocm5IRGl3dUFRakZwQjhQTTNvdzdyOU5wdl9oTXo3WEdkbkI4ZzQzV1E0VkY2NEZMb3ZTUEM2S2ZwNGUxZ0F4OHlmcVRGT0VoX1E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Mar 2024 07:00:00 GMT",
        "title": "The crypto future of Ethereum: the launch of the Metis Alpha - The Cryptonomist",
        "content": "Crypto news: the launch of Alpha marks the activation of the decentralized sequencer of Metis, representing a significant step forward for the scalability of Ethereum through the implementation of this milestone.\n\nLet’s see below all the details.\n\nMetis Crypto Sequencer: Steps Forward for Ethereum\n\nAs anticipated, Metis, the Layer-2 scalability platform of Ethereum comparable to the EVM, has launched the Alpha version of its innovative Decentralized Sequencer. This marks a significant step towards the decentralization of rollups.\n\nThe decentralized Sequencer represents a significant advancement compared to the single sequencer model currently adopted by other Layer-2 rollup solutions.\n\nThis launch positions Metis as the first rollup of Ethereum to adopt a decentralized approach to its sequencer. Rollups represent one of the most promising scalability solutions, but currently they have some drawbacks.\n\nTo fully ensure the security of Ethereum, a decentralized fraud/validity proof system and a decentralized sequencer are needed.\n\nSo far, no other rollup has focused on the decentralization of the sequencer, making them vulnerable to single points of failure and potentially subject to censorship.\n\nWith this new feature, instead, by keeping control over a single sequencer, the foundations maintain almost total control over the network and its revenues.\n\nSecurity, fairness, and community involvement in the crypto network\n\nThe adoption of a decentralized sequencer by Metis allows multiple entities to manage the sequencers. This improves the security and decentralization of the network and enables a more equitable revenue sharing with users.\n\nA distributed sequencer also paves the way for crucial functions such as seamless and secure sequencer rotation, the ejection of malfunctioning or harmful entities, and increased network stability.\n\nUsers can contribute to maintaining the decentralization, transparency, and stability of the network by becoming sequencers and participating in the consensus process.\n\nThe participation of multiple entities makes it more difficult for malicious actors to control or compromise the order of transactions.\n\nThe Sequencer nodes can earn rewards in METIS tokens for their role in block production and transaction processing within the network.\n\nActive participation from the community can lead to greater recognition within the group, paving the way for future collaborations or potential partnerships.\n\nFurthermore, during the first year, all sequencer nodes will benefit from a Mining Rewards Rate (MRR) of 20%.\n\nMetis gets a price rally with listing on Binance\n\nMetis has experienced a significant increase of about 27-30% after the announcement of its inclusion on the Binance trading platform.\n\nThe inclusion on Binance of the crypto has effectively introduced the project to a wide range of traders and investors, increasing its liquidity and accessibility.\n\nThe surge in the token price can be attributed to various factors, including the increase in visibility and credibility resulting from being listed on Binance, as well as the growing market interest in Layer 2 scalability solutions like Metis.\n\nParticularly significant is the fact that Binance has waived the listing fee for Metis, demonstrating confidence in the potential of the project and commitment to promoting innovation in the cryptocurrency sector.\n\nThe designation of “Seed Tag” conferred to Metis by Binance highlights its status as an innovative project, which could involve greater volatility and risks compared to other listed tokens.\n\nThe increase in Metis prices and its listing on Binance have coincided with a broader recovery in the cryptocurrency market.\n\nBitcoin has recently surpassed its previous all-time high, exceeding $71,000.\n\nOn the other hand, Ethereum has temporarily exceeded $4,000, further contributing to the bullish sentiment around Metis and other promising blockchain projects."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxNZVVMMEdyVl9YUGluSm1TMGVRRjZoREFrazliTmxtcDF1Q1ptWHBxb2JiWENvSndFSGU3c2NMLVE1V3ZpR05nMFpKSFJZZEYwQ080TkhYbTZCX0RVOG9XTGdxNjRfS1lKMUhTcE9SSEF1VTZYNEl1dDFnMzlVOXRsd0I3V0REVnpSMm8xcmEtSXhrNG55T1ZnRlBxSkFHYUI0LUlKWVpkaVh1WHZfdXZ2Q2VsT291dHVtdWpjU3R0bmp6dDE1cHc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 17 Mar 2024 07:00:00 GMT",
        "title": "Ethereum Blockchain, Chiliz token burn, BlockDAG, keynote, best crypto - Techpoint Africa",
        "content": "The crypto world is buzzing with anticipation as major developments unfold, promising to reshape the landscape of digital currency investments. At the heart of these changes are Ethereum's Dencun upgrade, Chiliz's innovative token burning mechanism and BlockDAG's ambitious $600M roadmap. Each of these entities brings something unique to the table, targeting investors looking for the next big crypto opportunity with a mix of technology enhancements and strategic initiatives.\n\nEthereum's Dencun Upgrade\n\nEthereum just launched its Dencun upgrade this week, a much anticipated event of 2024. This upgrade, the most substantial change to the Ethereum blockchain in over a year, introduces \"proto-danksharding\" via Ethereum Improvement Proposal (EIP) 4844. Aimed at reducing fees for layer-2 (L2) rollups, this move is expected to enhance Ethereum's scalability by improving data handling capabilities for auxiliary networks. L2s like Arbitrum, Optimism, and Polygon stand to benefit the most, potentially enjoying reduced operational costs and fostering a more efficient transaction process. This step towards sharding indicates Ethereum's commitment to solving high gas fees in the short term, potentially boosting its appeal to investors and users.\n\nChiliz's Strategic Move with Token Burning\n\nChiliz, the powerhouse behind fan tokens, has introduced a token burning mechanism to reignite interest in this niche. By burning tokens whenever a team scores or wins, Chiliz aims to reduce the overall token supply, thereby increasing scarcity and potentially boosting token value. This innovative approach not only adds excitement to the Champions League but also positions Chiliz as a forward-thinking player in the crypto space. The immediate response was positive, with the CHZ token witnessing a 2.47% rise in value following the announcement. This strategy could significantly enhance the attractiveness and utility of fan tokens, setting Chiliz apart in the competitive crypto market.\n\nBlockDAG's Keynote: An Ambitious Roadmap For 2024\n\nBlockDAG is setting the stage for monumental growth with its impressive keynote for the year 2024. Having raised over $4.8 million already and eyeing a $600 million milestone that could outpace all presale competitors, BlockDAG has sold out its Batch 2 and has jumpstarted in Batch 3 with a price of $0.002. With plans for top exchange listings on platforms like KuCoin and Gate.io, BlockDAG is not just aiming for visibility but also for accessibility to a broader audience. The promise of 50X returns for early investors highlights the project's confidence in its value proposition.\n\nGone are the days when miners needed high powered specialised equipment BlockDAG has introduced a user friendly app - BlockDAG X1 app, which is available in various platforms like AppStore and Google Play. For those naive to the crypto world about the prospects of mobile mining convenience, get enlightened with the fact that it allows users to mine up to 20 BDAG coins daily effortlessly from their smartphones. This innovative approach offers a passive income stream, further sweetened by the specialised mining units for enhanced profits. BlockDAG offers state of the art mining rigs that make mining easier with added processing power and extended operational life. Miners can trade their coins and resale at much established platforms like Amazon, Ebay and Shopify.\n\nWhy BlockDAG Stands Out\n\nIn a market teeming with opportunities, BlockDAG distinguishes itself through a blend of ambitious goals, strategic exchange listings, and user-friendly mining solutions. As Ethereum works to lower operational costs for its network and Chiliz explores new ways to engage and reward its community, BlockDAG's comprehensive approach addresses the investment and participation angles, making it a noteworthy contender for those looking to dive into crypto. With its Layer 1 Presale now live, BlockDAG invites investors to be part of a project poised for significant growth, promising not just returns but also an active role in the evolving crypto ecosystem.\n\nTo know more about BlockDAG:\n\nWebsite: https://blockdag.network\n\nPresale: https://purchase.blockdag.network\n\nTelegram: https://t.me/blockDAGnetworkOfficial\n\nDiscord: https://discord.gg/Q7BxghMVyu"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxOM0xfQ3E5LXdvT1NVamY3LWl2X3FKTDVWMXlFbWlkTnlkLVY2a3hUQWUxVy10cVByY21ISUotN3pkMzY3Ykg5VVpxMkREcWtWc0RjNFQwOVd4Zno3aVVHaTdRUG9EaTRkSUlnZ1Q1dEh5bjJGOWJlRDdVY0JWR25Yazc3Q0ZsVWo5Yk8xVdIBkgFBVV95cUxQLVVvZGN3ZHpIT1UxVDAxSGdjN0hTLTZDTl9rVUt2aEJDYzVPUGNMeDQxWWVwd0R3cUxxc0ZmbUYweGZUVi1tN3JtRkgyRlVNMElOT0hURTNESWd0SmdvQkQ2ZUhMN19CXzlZRmo2OXBuODI1Z3AzSkFLTml0SllzMkhuOWZxcVk2cnBNaHdHekpmdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 17 Mar 2024 07:00:00 GMT",
        "title": "Ethereum could drop as low as $3100 – Time to rethink your moves? - AMBCrypto News",
        "content": "Ethereum broke its lower timeframe bullish structure.\n\nThe liquidation levels heatmap outlined two support zones.\n\nEthereum [ETH] saw a sizeable pullback over the past few days after its steady bullish march over the past month. The $4.1k level was almost reached before the bulls were forced to retreat. Investors need not worry about this dent in prices too much.\n\nBitcoin [BTC] also faltered just above the $73k level and dragged the rest of the market down. While the rally is expected to continue higher in the long run, further losses are anticipated over the next few weeks.\n\nTraders need to be prepared for a fall below $3500\n\nThe 12-hour chart showed that the bullish bias remained intact based on the price action. Yet on the 4-hour timeframe and lower the structure has flipped bearishly. Even the 12-hour RSI fell below the neutral 50 mark to reflect bearish momentum was rising.\n\nThe recent pullback is not a flush of the overleveraged bulls as we saw on the 5th of March. The rally saw its momentum stutter after the 12th of this month, followed by an increase in selling pressure.\n\nThe OBV began to drop lower to support this idea. The Fibonacci retracement levels (pale yellow) highlighted that the 61.8%-78.6% region at $3100-$3315 would likely be retested as support. The $3463 level could also halt the bearish progress.\n\nLong-term investors need to brace for further losses\n\nAMBCrypto’s analysis of the liquidation levels heatmap showed that ETH would likely post more losses. The $3560 level was estimated to trigger $2.6 billion worth of liquidations.\n\nThese large liquidation levels were concentrated in the $3520-$3560 region, marking it as a support zone. Ethereum could see a bullish reaction from here.\n\nIs your portfolio green? Check the Ethereum Profit Calculator\n\nBelow the $3520 level, the next large liquidation levels sat at $3300 and $3130. The former was estimated to have $2.2 billion in liquidations, and the latter to have $5.4 billion.\n\nIt also had confluence with the 78.6% retracement level at $3102.\n\nDisclaimer: The information presented does not constitute financial, investment, trading, or other types of advice and is solely the writer’s opinion."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxPaWh4ZU5tcUt2d2YyNGc4SDF1Q2o0a3NyYjNmb2p6ZVhWUmpsQnBTRFZxcy1NNlBPOG5IUEROZ0tOaGRpTDZwN29FTDZmNjU4aHVQU29YMkhTM2VmY1ZhUkxqS2Vsd2VvN1M4QWI5N0hfWkFyQ0hZSm9BVzdUc1FUODZIQkJvdFF4aGNIZGpvMUgtOGdlenRmVEhGaUt1dnhxYlJlaEJjLUdwcGcwOWhQRGoyWXFKMW94N3VPQzhSSjNCZFptLWdn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Mar 2024 07:00:00 GMT",
        "title": "Grayscale Submits Revised Application For Ethereum Spot ETF – What’s New? - TradingView",
        "content": "Asset management firm Grayscale Investments has updated its application for an Ethereum spot ETF (exchange-traded fund) with the United States Securities and Exchange Commission (SEC).\n\nEthereum Spot ETF Case Just As Solid As Bitcoin’s, Grayscale Argues\n\nAccording to a recent post on X by Craig Salm, Grayscale’s chief legal officer, the asset management firm has revised its 19b-4 form for an Ether spot ETF. Salm claimed that this move was “important” in an effort for Grayscale to list and trade shares of its Ether Trust on the New York Stock Exchange (NYSE) Arca.\n\nThe chief legal officer stated in his post that investors “want and deserve access” to Ethereum via a spot exchange-traded product, likening the situation to the Bitcoin ETF story. “We believe the case is just as strong as it was for spot Bitcoin ETFs,” Salm said.\n\nThe asset manager is amongst the numerous firms looking to issue the first Ethereum spot ETF in the United States, having filed an application with the SEC on October 10, 2023. However, these ETF applications have faced delays multiple times, with the most recent coming against BlackRock’s filing on March 4, 2024.\n\nAs a result, the likelihood of the SEC approving an Ethereum spot ETF has taken a nosedive in recent weeks. Once-optimistic Bloomberg ETF expert Balchunas even revealed in his latest analysis that the ETH funds now have only a 35% chance of approval.\n\nSEC Chairman Faces Pressure Over Crypto Approval\n\nTwo US senators of the Democrat party, Sens. Laphonza Butler of California and Jack Reed of Rhode Island, have urged the SEC chairman to avoid approving crypto investment products. In a letter dated March 11, the lawmakers, who are also members of the Senate Banking Committee, asked the Commission to limit future crypto ETF applications.\n\nAlexander Grieve @AlexanderGrieve The success of the BTC spot products clearly ruffling some feathers on the Hill. @SenatorJackReed and @Senlaphonza write to the @SECGov urging:-no further ETPs for other tokens-make life difficult (i.e. examinations/reviews) for brokers and advisers that recommend BTC ETPs pic.twitter.com/enxdumC02N\n\nFollowing the approval of 11 Bitcoin spot ETFs in January, the attention of the crypto public has somewhat turned to whether the SEC will do the same for the Ethereum versions. However, this latest letter from the senate seems to further hurt the chances of an ETH ETF approval.\n\nA part of the letter read:\n\nRetail investors would face enormous risks from ETPs referencing thinly traded cryptocurrencies or cryptocurrencies whose prices are especially susceptible to pump-and-dump or other fraudulent schemes,” they said. “The Commission is under no obligation to approve such products, and given the risk, it should not do so.\n\nAs of this writing, the price of the Ethereum token stands at $3,731, reflecting a 1.2% increase in the past day."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxQX2JfOWZqTDQxaWJtOERFR3Bxc1E0NVlHX2ZvY2Z1RjNOeWFjRGFXSnpkOEhGU0NzMmJkVXVmUGZrN01NVXFfbHQ3c0xyWnE3WEVtRmMxRXVyXzhqc1R2QUR4RDhIT1JKWi1va2c0MlFPa2FsU041T3FpV1ZuRWsyV3d4angyQ2IzU1YwQkZLemF6anFYOXp0OHlXMmo5Um5SLUNrMy10T3ltUGVBUWRtWTFrYXIzQTFhRFE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 17 Mar 2024 07:00:00 GMT",
        "title": "Ethereum and SEI Crypto Holders Move to BlockDAG for 5000x Returns - Businessday",
        "content": "In the dynamic world of cryptocurrency investments, Ethereum holders are navigating a delicate balance of optimism and caution as the market experiences significant shifts. Alongside Ethereum’s trajectory, blockchain innovators like Sei Labs are shaping the landscape with groundbreaking projects aimed at revolutionizing scalability.\n\nAs investors seek the best crypto to invest in, the allure of emerging opportunities such as BlockDAG beckons with promises of substantial returns. With the potential to deliver more than 5000x returns BlockDAG is actively pulling away Ethereum and SEI holders.\n\n\n\nEthereum’s Balancing Act: Navigating Optimism and Caution\n\nIn the wake of Ethereum’s surge past the $4,000 mark, excitement and caution mingle among investors. The anticipation of a US-based Ethereum ETF approval and the impending Bitcoin halving fuels bullish sentiments, but the surge in short-term Ethereum holders suggests a potential price pullback. This analogy likens Ethereum’s price to a jump rope, where excessive momentum could lead to a stumble.\n\nAdding complexity, regional disparities in investor sentiment, with a thriving “Coinbase Premium” in the US and a declining “Korea Premium” in South Korea, highlight diverse market dynamics. While positive factors like ETF prospects and increased network activity paint a bullish outlook, technical indicators signaling an overbought market and contrasting sentiment across regions introduce a note of caution.\n\nSei Labs Unveil Parallel Stack\n\nSei Labs, the blockchain startup, has introduced The Parallel Stack, an open-source project aimed at revolutionizing Ethereum scalability. By leveraging parallel processing, Sei Labs seeks to address the current bottleneck in Ethereum’s transaction speed and affordability. With aspirations to achieve 10,000 TPS by the end of the year, Sei Labs underscores its dedication to enhancing EVM performance through parallel processing.\n\nThis initiative aligns with Sei Labs’ broader vision of scaling the EVM and empowering existing Ethereum developers. By providing a high-throughput alternative, The Parallel Stack has the potential to significantly impact the Ethereum ecosystem, facilitating the development of larger and more intricate applications. Sei Labs’ decision to make The Parallel Stack open-source reflects its commitment to transparency and community-driven development, fostering a more decentralized and accessible future for blockchain technology.\n\nBlockDAG: Seize the Opportunity for Potential Profits and Success\n\n\n\nExperience the excitement of being an early investor in BlockDAG, the best crypto to invest in and the next big crypto coin poised to shake up the market. With its project offering unprecedented opportunities for potential 5000x returns, you won’t want to miss out on this chance to ride the wave of optimism and potential profits. BlockDAG’s ambitious goal of reaching a $600 million valuation by 2024 signals its determination to soar to new heights.\n\nInspired by the success of the Kaspa protocol, BlockDAG has already secured an impressive $5.06 million in presale funding, showcasing strong investor interest. Don’t wait until it’s too late – join the ranks of early investors in Batch 3, where a projected 5000% ROI awaits. With analysts forecasting a price surge to $10 per coin by 2025-2030, the time to invest in BlockDAG is now. Don’t let the chance pass you by – seize this opportunity and embark on a journey towards potential wealth and success.\n\nBlockDAG’s community involvement strategy, featuring a 10% referral bonus from all referred investors, establishes a symbiotic relationship between the project and its supporters. This referral system incentivizes existing community members to participate actively in the project’s growth and serves as an organic marketing channel. The sense of community and shared success created through referral bonuses fosters a loyal and engaged user base.\n\nThe Final Resolution\n\nNobody can afford the chance of losing such a secure investment, that will generate up to 5000X profit, BlockDAG is considered the best crypto investment of 2024,the cryptocurrency landscape is marked by a delicate balance between optimism and caution, exemplified by Ethereum’s current trajectory. While bullish sentiments are fueled by anticipation surrounding ETF approval and the Bitcoin halving, the surge in short-term Ethereum holders and regional disparities in investor sentiment introduce elements of caution.\n\n\n\nJoin the BlockDAG Presale:\n\nWebsite: https://blockdag.network\n\nPresale: https://purchase.blockdag.network\n\nTelegram:https://t.me/blockDAGnetworkOfficial\n\nDiscord: https://discord.gg/Q7BxghMVyu"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxPZlBHQUs2amtNdkcwdGNyS1ZWYmtuckJZc294Y3pHOU8xTlQxeUFfZjZUTkdfZzVVekZyUERqekx3UUJGWlN3WkwzdGdUbEhQZlMzX0wyUkZ0X1Ytb2hqQUdGbnpEV1Z2QWFSZHhHc0M2aU9jNkxSY0pjRDJpa0k2UTlYdWRFWHNUSkVuVmltV3pwdG5uVENCeXZDMTE1NWNj0gGmAUFVX3lxTFBsODJ0QWV6bm1SbV9lWUZaVDQ4NFdIUWxtNFp0UWxKNFhwbkhBTnNaNVNoY1VlWEVCU1RXejFDUDlneXpFdHh4Ym1MeldRRGtyZEV1SENqRzkwVTNVRHQ0dXpBYUtEdWI0UFhjWmptTjdMdENIWFhqY3R0c1pMYnlPZHdlZVVqMDFiVk1aWUNKY1UzZzRwa0dRYTZlSlpnYTBnN3dwTnc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Mar 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum, and XRP Price Prediction For The Coming Week! - Coinpedia Fintech News",
        "content": "Elena is an expert in technical analysis and risk management in cryptocurrency market. She has 10+year experience in writing - accordingly she is avid journalists with a passion towards researching new insights coming into crypto erena.\n\nThe cryptocurrency industry continues to display a significant fluctuation in the chart, suggesting an increased price action in the market. Further, the market leader, Bitcoin price, has successfully claimed a new all-time high of over $73,000, highlighting a positive outlook for the market in the coming time.\n\nOn the other hand, the altcoin leader, the Ethereum token, had successfully crossed the $4,000 market during the previous week, following which it experienced a significant correction in valuation. Further, the XRP token has displayed a similar trend, indicating increased volatility in the crypto space.\n\nBitcoin (BTC):\n\nThe Bitcoin price traded in a closed range between $50,540 and $52,853 for a brief period. As the volatility in the market increased, the bulls jumped 24.53% within three days, following which the price faced rejection at $64,287. After trading sideways for a while, the bulls regained momentum and jumped 11.03% before facing rejection at $68,296.\n\nThe bulls then lost momentum and tested their low of $61,025, but the bulls quickly regained momentum and leveled all their losses. Following this, the bulls constantly traded under a bullish influence and recorded a new ATH of above $73,000. Since then, the price has been trading under a bearish influence.\n\nTradingView: BTC/USDT\n\nThe technical indicator, MACD, displays a decline in the red histogram, indicating a decrease in the bearish influence in the crypto space. Further, the averages show a high possibility of a bullish convergence, suggesting a bullish price action for the BTC price in the coming time.\n\nIf the market holds the price above the support level of $68,296, the bulls will regain momentum and prepare to test its upper resistance level of $73,844 during the coming week. Conversely, if the bulls fail to regain momentum, the price will lose momentum and fall to test its lower support level of $64,287.\n\nEthereum (ETH):\n\nThe ETH price traded in a closed range between $2,609 and $2,883 for over a week, after which the bulls gained enough momentum to break out of the resistance level, where the price displayed a neutral trend for the next few days. As the volatility increased, the Ethereum price jumped 16.25% within the next three days, following which the price displayed a neutral trend.\n\nAfter testing its low of $3,369, the bulls reimagined momentum and recorded a jump of 17.42% before facing rejection at $3,956. Recently, the bulls recorded another jump and successfully reclaimed the $4,000 mark, where the price traded sideways for a while. Since then, the price has been trading under a bearish influence.\n\nTradingView: ETH/USDT\n\nThe Moving Average Convergence Divergence (MACD) displays a constant red histogram, indicating an increased bearish influence in the crypto space. Moreover, the averages show a flatline, suggesting uncertainty in the future price action of the coin in the market.\n\nIf the market pushes the price above the resistance level of $3,733, the bulls will regain momentum and prepare to test its upper resistance level of $4,200. Negatively, a trend reversal may pull the price toward its lower support level of $3,369 in the coming time.\n\nRipple (XRP):\n\nThe Ripple (XRP) token traded in a consolidated range between $0.530 and $0.578 for about two weeks, following which the bulls gained momentum, and the XRP price jumped 13.5% before facing rejection at $0.6015. After this, the price displayed a neutral trend by trading between $0.578 and $0.601 for a while.\n\nAs the market volatility grew, the bulls successfully broke out of the resistance level, where they traded between $0.6015 and $0.6625 for a brief period. Recently, the bulls jumped 21.52%, after which it faced rejection at $0.7310. Since then, the price has been displaying a negative trend in the chart.\n\nTradingView: XRP/USDT\n\nThe MACD displays a constant decline in the red histogram, highlighting a decrease in the selling pressure within the crypto industry. Further, the averages show a potential bullish curve, suggesting the price may undergo a bullish price action during the coming week.\n\nIf the market holds the price above the support level of $0.6290, the bulls will regain momentum and prepare to test its upper resistance level of $0.6930. Conversely, if the bears overpowered the bulls, the price would lose momentum and fall to test its lower support level of $0.5780 in the upcoming week."
    }
]