[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiXkFVX3lxTE10V0hDNDBOQTd4dnNHOS02b0pwS081Rk9oTTgyTUZVNkpveFpBTE1xNWo5cDEtWElMZzNXb3IxLU1FUnpHYjQwZnVPMEJWbTktT09WbDhXNl9jN3VBUnc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 12 Feb 2024 08:00:00 GMT",
        "title": "Ethereum spot ETFs are next - Blockworks",
        "content": "The new bitcoin spot exchange-traded funds mark the brink of an era that will see trillions pour into tokenization.\n\nThe moment BlackRock filed its iShares Bitcoin Trust application with the US Securities and Exchange Commission, it was obvious it would get approved. The evidence was on page 36 of the 111-page filing, which references the “surveillance-sharing agreement” between NASDAQ and a US BTC Spot Market Platform (read: Coinbase). Add to that BlackRock’s 575-1 ETF application approval record, and the writing was on the wall.\n\nBut the SEC was also explicit about its real concerns with crypto market manipulation. Manipulation related to bitcoin prices was cited in most, if not all, previous ETF rejections. The SEC isn’t convinced Coinbase and other crypto exchanges can be trusted to “prevent fraudulent and manipulative acts and practices.”\n\nAfter the ETF approval, we may not be experiencing the record flows of billions of dollars in its aftermath that reporters predicted. But, we are experiencing “crypto’s top enemy” and arguably the largest opponent to blockchain adoption in the US finally acquiescing to its place in the market.\n\nIncoming will be an imminent approval of an Ethereum spot exchange-traded fund with parallels to the legal precedents set by the bitcoin spot ETF.\n\nI’ve been in the tokenization space since 2017. And I’ve been saying since then that every financial asset will one day be on a blockchain. Larry Fink, the CEO of BlackRock, finally agrees. ETFs, he says, are just a mere stepping stone to “the technological revolution in financial markets” that includes “the tokenization of every financial asset.” Fink’s future vision looks something like this: “Every bond will have its own CUSIP, it will be on one general ledger” and “this eliminates all corruption, by having a tokenized system.”\n\nHistorically, markets have been plagued with integrity issues. Transactions require trust that the other party will uphold their end of the bargain. Financial institutions, both commercial and regulatory, have blossomed as a way to mediate this. Yet, all this does is require participants to place their trust in centralized third-parties whose operations are opaque and, quite frankly, not immune to corruption.\n\nBlockchain technology reduces this reliance on third parties and the risks it brings. It’s optimistic for Fink to say blockchain can eliminate all illicit behavior — criminals will always find a way to be criminals. But blockchain can offer more transparent, traceable transactions in real-time that prevents fraud and lets regulators track illicit behavior much more easily and effectively.\n\nRead more from our opinion section: Bitcoin ETFs are not crypto’s finish line\n\nMore industry players like Fink, and even more regulators, are now starting to see the real, tangible benefits of blockchains. That’s why I predict that it will be hard for the SEC to justify not approving many other products once it approves the Ethereum spot ETF. We’ll have NFT ETFs, DeFi ETFs and even ETFs for the top tokenized real-world assets.\n\nInstitutions with trillions in capital will finally be able to access tokens via regulated vehicles on venues with approved counterparties. They’ll push for blockchain in use cases of greater institutional benefit, like the tokenized bonds we’ve seen issued in Europe or the tokenized securities now legal throughout nations in APAC. Legacy finance in the US will finally open to tokenization.\n\nBut this tokenization won’t be on one public ledger as Fink hopes. While it would be great for BlackRock if everything happened on Ethereum — this would drive value to its future Ethereum spot ETF — it’s just not what regulators or markets want.\n\nRegulators and institutions have repeatedly indicated a preference for public permissioned networks or private permissioned networks.\n\nIn a report by EY Parthenon, 60% of institutions said they preferred a public permissioned network for asset tokenization. Likewise, public permissioned networks were of interest to regulators interviewed for a report by the Global Financial Markets Association and Boston Consulting Group.\n\nPermissioned networks will be the networks of choice for many. They’re either comparable to existing infrastructure in capital markets (private permissioned), or come with frameworks for regulatory and institutional risk-management and tools to enable know-your-customer/AML compliance (public permissioned).\n\nIs the SEC’s approval of the bitcoin spot ETFs exciting?\n\nYes.\n\nIs it giving the greenlight for institutional capital to pour into crypto and tokenization?\n\nYes.\n\nBut, we’re only in the first inning of this revolution. We haven’t seen anything yet.\n\nGraeme Moore is the Head of Tokenization at the Polymesh Association, a not-for-profit dedicated to the growth of the Polymesh blockchain ecosystem. He is also the author of B is for Bitcoin, the first ever ABC book about Bitcoin. Prior to Polymesh, Graeme was the first employee at Polymath; the creative director at Spartan Race; and an associate at Canada’s largest independent investment advisory firm.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxPNGwyOVh3dkswWnZhejlvVlVXSVZrUVY3ZkNCY3BIemItYWlaQVdUYzRqZmFWeHVfOW85VmR5VEtCa2Q3ZTVrVUdvUDdfWm1zdXhlT1JkT0dtQ0JUWUl5aWtTWS1xOXVaS0lzQ1l5c1dSR2ZFblA0QVFBRkJlTEVBMTNLNFRLRVNlZlZuelBLQ3l1VURnN2dUVVdfYm4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 12 Feb 2024 08:00:00 GMT",
        "title": "Franklin Templeton joins BlackRock, ARK Invest in Ethereum spot ETF race - Crypto Briefing",
        "content": "Coinbase will be one of the fund’s custodians.\n\nShare this article\n\nFranklin Templeton, the company that manages $1.5 trillion in assets, has become the latest Wall Street giant to file for a spot Ethereum exchange-traded fund (ETF), according to an S-1 form registration dated February 12, 2024. The firm now joins BlackRock, ARK Invest, and five other asset managers in the spot Ethereum product race.\n\nFranklin Templeton has selected Coinbase Custody Trust Company and the Bank of New York Mellon as the fund’s custodians. As an ETF custodian, Coinbase is responsible for the safekeeping and management of the cryptographic keys that control the underlying assets of an ETF.\n\nLike BlackRock and ARK Invest, Franklin Templeton has also adopted a cash-only policy for the creation and redemption of shares. The proposed ETF is slated for listing and trading on the CBOE BZX Exchange, offering investors an accessible avenue to gain exposure to Ethereum without the complexities and operational challenges typically associated with direct crypto investments.\n\nFranklin Templeton previously shared a bullish outlook for the future of Ethereum, Solana, and other layer 1 chains. The firm also generated headlines when it embraced the “laser eyes” meme, a social media trend in the crypto community where individuals, especially crypto enthusiasts, edit their profile pictures to include red laser beams coming out of their eyes.\n\nThe new filing comes on the heels of a recent move by the US Securities and Exchange Commission, which sought public feedback on a proposed rule change to list and trade an Ethereum spot ETF from Galaxy Digital and Invesco."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxOU0tFZkdYRUhRMUxnUjg3dk40THRBbkhWcnBJV0FGZl9HY0twVmctTTVXOE5ad095SkN5OUZjOVdKNldhRVdKSG16TzNzZVVCUF9lSWxSTzl4X3d5MVhmUjFDcnNuM2JmN2xMRUlheFZHTEFQNVJOSU9VdjFuZzM5Ti1EVUxnRnM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Feb 2024 08:00:00 GMT",
        "title": "Is Ethereum (ETH) Price on the Verge of a $3,000 Rally ? - crypto.news",
        "content": "On Feb. 12, Ethereum (ETH) price peaked at $2,633, just shy of its 2024 top, while Bitcoin (BTC) raced above the $50,000 for the first time since 2022.\n\nBitcoin (BTC) attracted the media attention after breaking the $50,000 barrier on Feb. 12, but Ethereum bulls are making strategic moves to stage a similar breakout.\n\nWill ETH price reclaim $3,000 in the coming days?\n\nEthereum derivative traders have intensified bullish bets\n\nEthereum and Bitcoin price action have been closely correlated for many years. This has sparked optimism that BTC hitting the $50,000 milestone on Feb. 12 could open the doors to ETH making a similar bullish upswing.\n\nIn the ETH derivatives markets, there has been an noticeable increase in the spate at which speculative traders are placing leveraged bullish bets.\n\nCryptoQuant’s funding rate represents the aggregate percentage of fees paid by perpetual futures traders to keep their positions open.\n\nThe chart below, shows the ETH funding rate rose to 0.4% on Feb. 13, signaling that speculative traders are placing more leveraged bets on an imminent ETH price upswing.\n\nNotably this is its highest in more than 40-days dating back Jan. 8, when investors were piling on bullish positions ahead of the Bitcoin spot ETF verdict.\n\nEthereum (ETH) Funding Rate vs Price Source: CryptoQuant\n\nConcisely put, rising values of positive funding rates indicates that long position holders are showing paying increased fees to short traders, in anticipation that an imminent price upswing will yield outsized profits.\n\nETH is trading just below the $2,660 mark, at the time of writing on Feb. 13. Hence, this surge in ETH funding rates right after BTC crossing the $50,000 milestone indicates an overwhelming bullish outlook that an Ethereum price rally toward $3,000 could soon follow.\n\nUS whales are ramping their ETH purchases\n\nUS-based corporate entities have further intensified efforts to score an ETH spot ETF approval in H1 2024. On Feb. 12, Frank Templeton became the latest asset manager to file ETH derivative applications with the US Securities and Exchange Commission (SEC).\n\nIt appears that the institutional participants are backing up their optimism with rapid ETH purchases in the spot markets. Cryptoquant’s Coinbase Premium index tracks the intra-day difference in Ethereum prices quoted on Coinbase Pro exchange and Binance.\n\nAs depicted below, Ethereum Coinbase Premium index stood at 0.04 on Feb. 13 and has been trending in positive values since Feb. 8. And during that\n\nEthereum (ETH) Binance vs. Coinbase Premium index | Source: CryptoQuant\n\nThis critical metric is based on the premise that Binance dominates the retail trading market, the majority of Coinbase pro clientele is dominated by US-based corporates and high-networth investors looking to trade within a more regulated environment.\n\nHence, positive values of the Coinbase Premium index means that ETH quoted prices on Coinbase have been consistently higher than Binance, indicating that the whales’ buying pressure on Coinbase Pro has exceeded retail activity on Binance.\n\nThis pattern has often appeared in the build up to major ETH price rallies. Unsurprisingly, ETH price has gained 11% since the whales dialed up the buying pressure on Feb. 8.\n\nCombined with the dominant bullish sentiment among the speculative traders, this unusual buying trend observed among the whales could send ETH price to its next milestone target at $3,000.\n\nETH price forecast: $3,000 target in focus\n\nIn summary, speculative traders showing optimism with rising funding rates and the buying pressure from US-based whales have put ETH price on an upward trajectory.\n\nAnd based on the historical patterns associated with these bullish metrics, Ethereum price is likely to make another leg-up toward the $3,000 area.\n\nHowever, the bulls face major roadblock at the $2,750 range. IntoTheBlock’s in/out of the money data shows that, 878,100 addresses had acquired 671,830 ETH at the average price of $2,760.\n\nIf the bulls can scale this initial resistance level, it could generate momentum to push for $3,000 target as predicted.\n\nEthereum (ETH) Price Forecast, February 2024 | Source: IntoTheBlock\n\nOn the flip side, ETH price could enter a negative trend if the bears can force a downswing below $2,000. But this scenario seems unlikely in the short-term. The chart above shows that 3 million holders acquire 6.2 million ETH at the average price of $2,300. If those holders defend their position ETH will like a solid short-term support around the $2,350 level."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxPdkJrZkcwdWtTWUN6VnZ6bkd4cE1JZkptOWRqOFNtRmtES0hqYmZNVEFDNG9MdVVoV3RnZnpFbGlHUXV4M1BCaU9abExHVXRBa2N2YUpQS1FCampfcmEwejg2cXVHUmZnRkhVTUJlZHB0azNKY1ppQXAxUGk3bUdfV2ZqTmVsOEpCbldUQW85aXpfRU05UzdNelVDYzNFZ1QwZXF6WlMwYXR6RHN4ZTRjd1pKdmR5WGxVU3VveGZ3QlQzekVvYndWNXM1TnA4dTI0Yi1lVmJpRQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 12 Feb 2024 08:00:00 GMT",
        "title": "Ethereum in 2024: PoS, Scalability, and Market Predictions - The News Leader",
        "content": "William Mullane\n\nContributor\n\nStory by Binance\n\nEthereum is set to be one of the names to watch out for in crypto in 2024. Transitioning from an old way of operating (Proof of Work) to a new method called Proof of Stake, or PoS for short, Ethereum is getting a notable update. This makes it more energy-efficient and fair for everyone involved. Investopedia explains that this could be a game-changer for Ethereum's market worth.\n\nWhy is PoS Important?\n\nThe transition of Ethereum to Proof of Stake (PoS) marks a big change. Previously, Ethereum relied on a system known as Proof of Work (PoW) which involved computer competition to solve puzzles for transaction processing and Ether creation. This process consumed large amounts of energy.\n\nHowever, with the implementation of PoS, efficiency has improved. PoS allows users who hold and 'stake' their Ether to process their transactions, instead of heavily relying on mining. This approach significantly reduces energy usage, thereby making Ethereum more environmentally friendly.\n\nIt's not just about being environmentally friendly. The implementation of PoS in Ethereum aims to enhance the network's security. In the PoW system, an individual attempting to manipulate the Ethereum network would need to control over 50% of its computing power, which is an extremely difficult and costly task. However, with PoS they would have to possess than half of all staked Ether making it more complex due to the substantial investment required. Consequently, this makes the network more resilient against attacks.\n\nMoreover, PoS has the potential to bring fairness to Ethereum. Unlike in the PoW system where individuals with expensive computers have a significant advantage over others, PoS levels the playing field as it does not necessitate super powerful hardware; instead it depends on how much Ether one is willing to stake.\n\nCan Ethereum Handle More Traffic?\n\nScalability has been one of the big headaches for Ethereum for ages now. When too many people use it at the same time, it gets slow and expensive to use. Imagine a highway jam-packed with cars — that's been Ethereum on a busy day. But now, they're working on splitting this traffic more efficiently (something called 'sharding') and even creating express lanes (these are the Layer 2 solutions like Optimism and Arbitrum). A recent Forbes issue highlighted how these upgrades could make Ethereum faster and cheaper.\n\nWhat's the Word on Ethereum's Money Value in 2024?\n\nTalking about money, especially in crypto, is like predicting the weather — you know the general trend but can't be sure if it will rain or shine. However, the general feeling among experts, like those analyzing the market on Binance, is pretty optimistic for Ethereum. They think its value could go up with all these updates and that Ethereum is becoming rarer to own (thanks to the PoS model). But remember, crypto can be unpredictable, and government regulations can shake things up.\n\nThe Takeaway\n\nEthereum is transforming itself in a big way, becoming more attractive to everyday users and big investors as it looks to be faster and greener. However, there are challenges, especially with all the rules and regulations still being figured out in the crypto world. For those considering Ethereum, it is certainly a space to watch.\n\nThis article is for informational purposes only. Investing in digital assets carries a high level of risk and may not be suitable for all investors. Potential investors should ensure that they have an understanding of the risks involved, seeking professional advice where appropriate."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxNcnhFT2NWaEtvZUlMVDVXMGRiTkxPWW5wUV8tVEdTWGhfWUJGd1c4V3pWOU1SNUN4Qlp2cGwtd2E5YzcycHEzc2ltdkQ5Q3Vza1dPdjlEUVp2MU5ob21qY2EzNVgyVExyeWN6cXBuWXZiR3VpTFJCcUxwWHl1dUVUZ1JSUnRpLXNRSUNWOERDb2k3VWNDR09QS1oxbzBRdHZWcFFhVWVPUlZLSDVRUFR1MjNB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Feb 2024 08:00:00 GMT",
        "title": "Ethereum, Solana see gains as Bitcoin's rally above $50,000 causes $184 million liquidations - CryptoSlate",
        "content": "Bitcoin’s surge past $50,000 catalyzed a broader market upswing, propelling numerous large-cap alternative digital assets such as Ethereum (ETH), Solana (SOL), and others to significant gains.\n\nAccording to data from CryptoSlate, Ethereum saw a 7% uptick, reaching $2,661, while SOL surged 8% to hit $114. Among the top 10 digital assets, Avalanche’s AVAX spiked 6% to $41, Cardano’s ADA rose by 3.74% to $0.5574, while BNB Coin (BNB) and Ripple’s XRP experienced more modest gains, each climbing by less than 3%.\n\nMarket analysts attribute this bullish trend to the buzz surrounding the multiple spot Bitcoin exchange-traded funds (ETFs) in the US. Vetle Lunde, a senior analyst at K33 Research, noted that inflows into these ETFs have remained robust more than a month after their launch.\n\n“Yesterday saw a net inflow of 9,870 BTC, pushing the net U.S. spot ETF flow since launch to 72,312 BTC. The new nine now hold 228,000 BTC,” Lunde added.\n\nDuring the past day, BTC’s price crossed the $50,000 threshold for the first time since late 2021. The top crypto’s value has risen 4.2% to $50,146 as of press time, extending a positive run that had seen it gain 16% over the past week.\n\n$184 million in liquidation\n\nThe broader crypto market rally resulted in a significant liquidation totaling over $184 million from more than 56,000 traders, according to Coinglass data.\n\nShort traders, or speculators betting against price increases, bore losses amounting to $134 million, while long traders betting on price increases lost approximately $50 million.\n\nAcross assets, Bitcoin led the liquidation charts with a total loss of $69.80 million. Short Bitcoin traders accounted for $55.04 million in losses, while long traders lost $14.76 million. Ethereum followed closely, contributing $39.85 million to the overall liquidation.\n\nOther assets like Solana, LINK, and ORDI also experienced liquidations of $10.14 million, $5.93 million, and $4.81 million, respectively.\n\nAcross exchanges, Binance witnessed the highest proportion of liquidations at 43.13%, totaling $79.42 million. Other platforms like OKX and ByBit recorded liquidations of $58.29 million and $18.73 million, respectively.\n\nNotably, the most significant liquidation order occurred on Bitmex for LINKUSD, amounting to $3.14 million.\n\nMentioned in this article"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxOeFRBSVdfajVsSUhCZjM3Zm1iR0lQOTNHdHlaellrV1VNTmRPaWRlSkttaVZfTUVScWZmMG4yVFJLUVdZOWlET0NqcWhNREt0eEhxWEVUZ25EdWZHa01YUWVKMDJ4T2dqb1YtdWlpa0dQZGlfa2Y4blBVRzdSVXRaTFVMcWM5ZXBpNWgzTzNTVkpLcDZ5M0x0WVlxbGZzSlBCZUROYlFoclN0d3dQZWNrT0NfUkdwZEV1dGfSAb8BQVVfeXFMTjhMb3pzTGtQNmtfRXZFQ1Zha3ZfNE5BTVZoVWJBOVJ2RVpmVzdzdHAyM2QwRG9IY2JqVUxZc0xIellVY1NSc2xWeHFFcW5ScnJ0b1NTZjEwSG0tcEpVRDF5S3BBYW5sWWtpVWRrVFRCcW1KLXhtU2Ixc3hRWTRGaTJGSC00NldIeWJhRVQxTDFmaVJlUzVsc3BCbHgwcGRRdUU0ZDZmanJneUVzZHZCS2lMRV9fMzF5YXJ2bmJBSXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Feb 2024 08:00:00 GMT",
        "title": "Crypto Trader Says Ethereum Accumulation Phase Now Over, Predicts Rally for ETH Rival - The Daily Hodl",
        "content": "A closely followed crypto strategist believes that Ethereum (ETH) is now in an uptrend after a lengthy period of accumulation.\n\nPseudonymous analyst Inmortal tells his 206,500 followers on the social media platform X that ETH has convincingly broken out of a trading range after retesting the lower $2,000 level several times in the past few months.\n\n“Wake up honey, bear market accumulation is over.”\n\nEthereum is trading for $2,670 at time of writing, up more than 6% in the last 24 hours.\n\nNext up, the trader thinks there is a price correlation between ETH-rivals Solana (SOL) and Avalanche (AVAX) and is expressing bullish sentiment on both tokens.\n\n“If SOL pumps, AVAX will follow. Muscle memory.”\n\nSOL is trading for $113.94 at time of writing, while AVAX is trading for $41.27.\n\nThe trader is also bullish on open-source gaming blockchain Beam (BEAM).\n\n“My unspecified amount of BEAM is up.”\n\nLooking at his chart, the trader suggests BEAM is in an uptrend after bouncing off the bottom of a trading range at around $0.0170.\n\nBEAM is trading for $0.0294 at time of writing, up more than 14% in the last 24 hours.\n\nLastly, the trader is predicting Bitcoin (BTC) will go on a massive rally when retail traders sitting on the sidelines enter the crypto market.\n\n“No new participants in crypto and we are at $48,000, chilling. Imagine when the masses come in like they did in 2021. We are going much higher, soon.”\n\nBitcoin is trading for $49,777 at time of writing, up more than 3% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiVkFVX3lxTE1ReGNIcmV5WXNYNXNydDM5S0VQRDFxdV9rTUh3NDFtelY4ZU9vYTZ4dmpaSmRXSFFQRXFtdlh0enRCbXh3N2ItVUhqN1FPXzhvaENLRm1n?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 12 Feb 2024 08:00:00 GMT",
        "title": "What Is ERC-404? A Guide to the New Semi-Fungible Token Standard - Unchained",
        "content": "The new, experimental ERC-404 standard combines the elements of ERC-20 and ERC-721 tokens to create semi-fungible digital assets.\n\nEthereum is home to a wide range of token standards that enable specific functionalities for crypto tokens. ERC-20 and ERC-721 are the two most popular token standards on the Ethereum blockchain. ERC-20 is the token standard for fungible tokens, while ERC-721 is the standard for non-fungible tokens (NFTs).\n\nAnd now, a new experimental token standard has emerged called ERC-404. The token standard combines the elements of ERC-20 and ERC-721 tokens into one semi-fungible digital asset.\n\nRead on to learn what the ERC-404 token standard is, how it works, and how it differs from ERC-20 and ERC-721.\n\nWhat Is ERC-404?\n\nThe ERC-404 is an experimental token standard that merges the features of the ERC-20 and ERC-721 token standards to create a ‘semi-fungible’ token with the characteristics of both fungible and non-fungible tokens.\n\nPseudonymous creators “ctrl” and “Acme” on the Ethereum network created the unofficial token standard.\n\nThe ERC-404 standard allows developers to develop fractionalized NFT collections that can be freely used and openly traded in NFT marketplaces. Currently, unlike with fungible tokens, NFT holders cannot purchase fractions of a digital asset.\n\nAlthough fractionalized NFTs exist, they primarily rely on an institution specializing in NFT fractionalization to lock the fractionalized NFTs in a crypto wallet and issue tokens depicting that non-fungible token. While these fractionalized NFTs are freely traded in the market, they may not precisely match the value of the locked NFTs.\n\nAnd this is what the ERC-404 token standard aims to solve.\n\nHow Does ERC-404 Work?\n\nThe ERC-404 token standard enables the creation of semi-fungible tokens by utilizing token burning and token minting mechanics to allow for fractional NFT transfers.\n\nThe token standard links issued tokens to a non-fungible token. The associated NFT is minted to your wallet if you purchase a full token. If you opt to sell a fraction of the token, the linked NFT representing that fraction is burned.\n\nThus, the token standard makes it possible for multiple wallets to hold fractions of one NFT.\n\nA new NFT is automatically minted if a wallet holding multiple fractions of a token buys enough to hold an entire token.\n\nIn short, if ERC-404 goes through the official Ethereum Improvement Proposal (EIP) process and is added to the Ethereum ecosystem, it will provide room for the native fractionalization of non-fungible tokens, which will make it possible to experiment with NFT use cases.\n\nHow Does ERC-404 Differ from ERC-20 and ERC-721\n\nLet’s take a look at how the ERC-404 token standard differs from the ERC-20 and ERC-721 token standards in the table below.\n\nERC-404 ERC-20 ERC-721 EIP Lacks a formal EIP Proposed and introduced through EIP-20 Proposed and introduced through EIP-721 Token standard Semi-fungible token standard Fungible token standard Non-fungible token standard Asset class represented Represents fractionalized digital assets Represents a specific type of fungible digital asset Represents a class of unqiue digital assets Tokens standard creators “ctrl” and “Acme” Fabian Vogelsteller William Entriken, Dieter Shirley, Jacob Evans, and Nastassia Sachs Token IDs Not known Lacks a token ID Features a unique token ID for each asset Status Under development Developed Developed\n\nWho’s Already Using ERC-404?\n\nThe ERC-404 token standard is experimental and hasn’t undergone the official EIP process. Still, developers are already using it when building their projects.\n\nBelow is a list of the three projects created using the ERC-404 token standard.\n\nPandora : Pandora is a newly launched token. It’s the first project employing the ERC-404 token standard to launch. Pandora is made up of 10,000 PANDORA ERC-20 tokens and 10,000 linked ‘Replicant’ non-fungible tokens. A correlated Replicant NFT is minted to your wallet if you purchase a full PANDORA token.\n\nDeFrogs : DeFrogs offers 10,000 Pepe the Frog-based NFTs and is considered the first ERC-404 picture-for-profile (PFP) NFT collection.\n\nMonkees : Monkees is also a PFP collection utilizing the ERC-404 token standard. It comprises 100 NFTs that have six traits and ten attributes.\n\nThe Takeaway\n\nWhile the ERC-404 token standard continues to show the adaptability of the Ethereum blockchain, it’s important to remember that the standard is only experimental and not official. It has yet to be submitted for review as an EIP and hasn’t undergone the required external audit.\n\nAs such, although already being utilized, the token standard could have some unknown flaws, which introduces a risk to token holders. Additionally, as an unofficial token standard, major NFT marketplaces and platforms currently don’t support it.\n\nWhile there’s no denying that the ERC-404 token standard opens up new use cases for NFTs on Ethereum, it remains to be seen whether its developers will successfully propose and get the approval needed for it to become part of the Ethereum ecosystem."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxQUHdRZF9ja2Z3OEJ1Qmp1RXpUc0ZMQ0VvTERaa0k3T0h5S0lWQXZWVW9PdnB6WWl2cWRmbko2NHRvNk5GalFLRl9wcElRX3RKOXJOcE9NaFdtbDJFNTVSMnZ5dDd6eFZBMHpKTTRaRVdockhKUWRacktfSFlzaGFFZkZ3NWNXaEcycG9jMkVyN0xOOXV2a29aUTVvbUVCZ9IBpgFBVV95cUxPOFh6WERnbk1TQTdWYlZfZUFoTTU4aU4wVVdhZE53eElIQzJaQlNKZ1RETEtrSy05dXV4dDRiWU5kWmhXRFFVYVA3elEzbFBkNTJIUGlLODNHVmVkbEc2b0tHbXJGZXdhQ0t6djUxcFh4ZE9NNHVROXRWbEJVZEh6dVRUN2ZDWmxTb0lsbU80bk05d2tkTllFUGFGT3BhTkd6VFdlUTFR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Feb 2024 08:00:00 GMT",
        "title": "Glenlivet Distillery Mixes Ethereum NFTs and AI Into Whiskey Collection - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe Glenlivet, a celebrated distillery in Speyside in northeastern Scotland, has launched a 50-year-old whiskey collection to commemorate its 200th anniversary. Additives to this pristine liquor, however, include blockchain technology via NFTs and utilizes generative AI for label design—checking all the hype boxes from the last few years.\n\nThe collection, titled \"The Twelve Elements,\" pays homage to the twelve essential components that shape Glenlivet's renowned single-malt whiskey. Cask expert Kevin Balmforth explained that the whiskeys composing the collection are among the brand’s oldest official releases.\n\nBalmforth also pitches the release as innovative, highlighting the distillery's embrace of technology while honoring its rich heritage. “This ultra-rare collection represents a look to the future and offers whiskey enthusiasts worldwide a foray into the evolution of luxury investments,” he said, as reported by Decanter.\n\nOne of the bottles being sold by The Glenlivet\n\nAD\n\nAD\n\nEach bottle in \"The Twelve Elements\" collection is paired with a unique NFT on the Ethereum blockchain, available through The Whisky Exchange's Cabinet marketplace. These NFTs serve as digital certificates, ensuring irrefutable proof of ownership—reinforcing its appeal to whiskey collectors. And generative AI was tapped to design unique labels gracing each bottle, with one-of-a-kind designs based on the respective element.\n\nThe release extends a wider shift in the NFT landscape, where experts anticipate a growing emphasis on utility and real-world applications. As Decrypt previously reported, experts like Pedro Herrera, Head of Research at DappRadar, believe there’s an ongoing change in the dynamics of the NFT space.\n\n\"Collectibles that we were so used to in 2021, like Bored Apes and CryptoPunks, have slowed down,” Herrera told Decrypt in a previous interview. “People are starting to grasp the real concept behind NFTs, which is proving ownership, authenticity, and so on.”\n\nOther major brands like Mastercard, Budweiser and Nike are also exploring this potential. Besides the appeal of NFTs as unique digital items, businesses have been exploring ways to leverage decentralized solutions to increase transparency and traceability and fight counterfeit and forgeries.\n\nAn auction for The Glenlivet “The Twelve Elements” collection begins on February 21, where prices are expected to surpass $43,000 (or 16.4032 ETH). Each bottle will be shipped later this summer with a digital certificate.\n\nAD\n\nAD\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQLVI2MUd0bDdteXlYUEM0dmxIcFM4VUV6ZTRCSHFaaF96OTJiOS1jT3dZR2x1NXJlM3Bxb19DbVRIZnZUZ0haa3RFX2RUUkxaRUJCekxaYTRRU0pKRVZwVlcwcFJZWEJvQ2lxSWhFbFlEOTlYQXVMVjVEMGVhUmZmV2QtWno4TjdUNlFSTUVlMHhEX2s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Feb 2024 08:00:00 GMT",
        "title": "Ethereum: Over 35% of ETH now locked, crypto demand explodes! - Cointribune EN",
        "content": "Tue 13 Feb 2024 ▪ 4 min read ▪ by Fenelon L.\n\nThe amount of Ether (ETH) locked in smart contracts on Ethereum has reached a new record, surpassing 35% of the total supply. This strong demand reflects the growing utility of the Ethereum network.\n\nEthereum Drains Its Available Supply, 35% of ETH Now Locked\n\nSince the successful deployment of the proof-of-stake consensus mechanism with the famous “The Merge”, the number of active validators on Ethereum has continued to grow. Now, according to a recent tweet by analyst Leon Waidmann from BTC-ECHO, more than 35% of circulating ETH are locked in smart contracts.\n\nThis record proportion reflects the steady increase in Ethereum’s actual use, beyond mere speculation. An increasing amount of ETH is being “committed” to the future of decentralized finance through staking, DeFi protocols, or DAOs, rather than just being traded or sold.\n\nThis underlying trend can be explained by two factors:\n\nFirstly, the voluntary locking of ETH in smart contracts proves a sustained demand from users convinced of Ethereum’s long-term potential. They agree to lock up their funds, sometimes for long periods, in exchange for gains such as interest or transaction fees.\n\nSecondly, this new record reflects the growing utility of the Ethereum blockchain, now perceived not only as a speculative asset but also as a technological platform that enables the creation of cutting-edge decentralized applications in areas such as finance (DeFi), identity, and governance (DAO).\n\nA Premise for the Takeoff of ETH Price?\n\nWith the major technical update Cancún scheduled for March 13, 2024, which is expected to significantly reduce transaction fees, and the high expectations surrounding the possible forthcoming approval of Ether spot ETFs by the SEC, Ethereum today seems poised to initiate a powerful bullish movement.\n\nThe price of Ether has indeed crossed its early 2024 highs. And with all these ETH locked in smart contracts, the available supply on the markets is drastically reduced. A situation that further enhances the bullish potential of Ether.\n\nMany analysts therefore expect the “Ethereum rocket” to take off soon, driven by the combination of a very strong demand and a real utility that continues to progress. The blockchain seems to have reached a critical mass, a premise for a new historic surge in the months to come.\n\nIn summary, with more than a third of ETH now locked on the blockchain, Ethereum seems to have reached a tipping point that bodes well for the coming days. The enthusiasm of investors and developers suggests that new records are on the horizon for the star crypto.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxNNTFJZC0zckVpZ0ZMZk5GY1lCaFJBalNBVlhQdHpCV0ZxSnZnZ2Q3ZktPR1N6bzlmUU1JZE5IalRzeEVrYjY1b01VRVFGYVNpWjlOUldTZzF6STBDalBuYWNsU3N2YlM0ZmtybE9LUFF3Q2ttRXZGSVpZdjhJT3lybjVVdE85emZ6V1V3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 12 Feb 2024 08:00:00 GMT",
        "title": "7 Cryptos Expected to Outperform Bitcoin in 2024 - Yahoo Finance",
        "content": "Bitcoin (BTC-USD) has been on a tear lately, with the price of the world’s largest cryptocurrency recently surpassing $49,000 per token at the time of writing. However, while Bitcoin is set up for more potential gains in 2024 due to major catalysts like the upcoming halving in April, savvy crypto investors know that smaller altcoins can often outperform Bitcoin, especially during bull market cycles.\n\nI will look at seven cryptos that I believe have the potential to outperform Bitcoin’s returns in 2024. A smaller market capitalization leaves a lot of room for upside. That said, some of these picks are still established names that should deliver steady returns, with the majority of these picks centered around more speculative “moonshot” bets that could exponentially increase in value if certain catalysts play out. Let’s dive in!\n\nEthereum (ETH-USD)\n\nA stylized version of the Ethereum logo. Ethereum Price predictions.\n\nSource: shutterstock\n\nEthereum (ETH-USD) has outperformed Bitcoin in every cycle since its inception, and I believe this cycle will be no different. As the primary driver behind Web 3.0 innovation, Ethereum seems poised for tremendous growth in 2024.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nThe top decentralized applications and NFT projects continue to be built on Ethereum, cementing its status as the leading smart contract platform.\n\nImportantly, Ethereum recently transitioned to a proof-of-stake consensus model. This greatly reduced the issuance rate of new Ethereum tokens, making the world’s second-largest cryptocurrency deflationary for the first time. With Ethereum’s burn rate now exceeding that of its mint rate, a supply shock could strongly benefit prices. Additionally, as more developers build Web 3.0 apps on Ethereum, demand for Ethereum via transactions on its network should continue climbing.\n\nI’m especially bullish on Ethereum due to this network’s ties to some of the most promising metaverse, DeFi, and NFT projects that rely on the Ethereum network. These applications relay on Ethereum to power transactions and run smart contracts. As these nascent sectors grow, Ethereum adoption should surge as well. With strong network effects firmly in place, I expect Ethereum to continue to outpace Bitcoin’s gains.\n\nEthereum also boasts top-notch security with its large community of validators. Attacks are virtually impossible at this scale. Thus, with no serious “Ethereum killer” in sight yet, Ethereum enjoys a dominant position in the world of Web 3.0 infrastructure. Unless unforeseen circumstances arise, I believe the runway is clear for Ethereum to exponentially increase in value in 2024.\n\nStory continues\n\nKaspa (KAS-USD)\n\nHand pointing upward next to upward trend stock chart in purple and blackish blue lighting, symbolizes growth stocks\n\nSource: shutterstock.com/Lemonsoup14\n\nScalability remains one of the biggest challenges in the crypto realm. However, Kaspa (KAS-USD) offers an elegant solution with its cutting-edge blockDAG protocol called GHOSTDAG.\n\nUnlike traditional blockchains, GHOSTDAG leverages a directed acyclic graph structure. This allows parallel blocks to coexist, while allowing the network to maintain quick consensus ordering. As a result, Kaspa can handle extremely high throughput with miniscule transaction confirmation times.\n\nInnovative architectures like GHOSTDAG will become highly valued as scalability pressures increase across decentralized networks. By avoiding the inefficiency of wasted orphaned blocks, Kaspa unlocks a lean and effective scaling approach that is not bogged down by excessive hardware requirements.\n\nFrom my first recommendation of Kaspa back at 2 cents back in July 2023, this token has already climbed 600% to 14 cents at the time of this writing. Yet, its current $3-billion market cap still seems small compared to its potential. As developers recognize the scalability promise of GHOSTDAG, Kaspa could achieve a market cap of $10 billion or more.\n\nIn an era where high Ethereum fees occasionally throttle applications, blockchain projects would do well to evaluate alternatives like Kaspa. Its novel hybrid PoW/PoS consensus and ability to run public and private networks make Kaspa surprisingly versatile. For these reasons, I believe this project has plenty of upside ahead, despite already generous gains for early investors.\n\nLibra Incentix (LIXX-USD)\n\nAn image of a hand holding a cell phone with several visualizations of digital building blocks floating above it. representing sto platforms\n\nSource: Marko Aliaksandr/ShutterStock.com\n\nLibra Incentix (LIXX-USD) seems positioned for a major breakout in 2024 driven by high-profile partnerships at the intersection of sports and commerce. Libra’s loyalty platform has teamed up with ComAve, an online shopping portal which has surged in popularity due to its partnerships with major football clubs like AC Milan and Crystal Palace.\n\nAdditionally, Libra Incentix is collaborating with Tamias POS, which also continues to secure deals with prominent sports teams and brands. As the exclusive loyalty token provider for these platforms, Libra offers fans a tokenized incentive program.\n\nThis focus on mainstream sports partnerships marks just the initial phase in Libra becoming the most widely adopted crypto loyalty solution. By catering to the massive global sports fan demographic, Libra Incentix can drive significant organic user growth and transaction volume for its network.\n\nThe opportunities appear tremendous still. The sports industry is on pace to reach a staggering $681 billion valuation by 2031, and I think this number could be higher as it benefits from crypto adoption.\n\nWith LIXX serving as the backbone loyalty mechanism across multiple major players in this booming niche, this project’s real-world usage is set to accelerate exponentially. As the LIXX token becomes deeply integrated into mainstream fan experiences and shopping through influential partners, Libra may emerge as one of the most promising crypto projects in terms of user reach.\n\nSolana (SOL-USD)\n\nSolana logo on phone screen stock image. Solana price predictions.\n\nSource: sdx15 / Shutterstock.com\n\nWhile Ethereum remains the dominant smart contract platform, “Ethereum killers” like Solana (SOL-USD) have managed to carve out solid market share in areas like NFTs. With transaction fees under 1 cent, Solana provides a fast and ultra-affordable blockchain environment for developers. This has fueled tremendous adoption, despite Solana’s previous struggles with stability (given a number of big outages).\n\nHowever, the Solana team continues refining the network, and outages are becoming less frequent. As demand for scalable Layer 1 solutions grows exponentially in 2024 and beyond, Solana’s upside remains enormous at these levels.\n\nUnless catastrophic failures occur, significant market share gains from Ethereum seem likely as congestion and high gas fees push developers to seek alternative platforms to build on. I think Solana’s unique infrastructure could solve Ethereum’s speed and cost problem, making this a top token to consider for long-term growth.\n\nAleph Zero (AZERO-USD)\n\nAn image of a speedometer with the words \"exponential technology\" at the maximum\n\nSource: iQoncept / Shutterstock\n\nAleph Zero (AZERO-USD) represents another emerging Ethereum competitor that aims to resolve lingering issues like congestion and uptime struggles. Leveraging a novel consensus protocol, Aleph Zero has achieved exceptional transaction finality in under one second, while being able to handle tens of thousands of transactions per second.\n\nHowever, Aleph Zero’s design compromises raw decentralization for that speed. With just 162 validators securing the network, it utilizes a model similar to Tron (TRX-USD). Still, Aleph Zero directly tackles recurring network capacity and stability problems developers face. With robust functionality catering to builders through EVM support, NFT/token capabilities, and multi-language SDKs, Aleph Zero remains well-positioned to capture dissatisfied talent if ecosystems like Ethereum and Solana stall in providing reliable infrastructure.\n\nConsidering its relatively tiny $188 million market cap, Aleph Zero offers tremendous upside potential if it attracts an influx of builders and users over the coming years as part of the next generation of blockchain ecosystems.\n\nRender Token (RNDR-USD)\n\nThe Render (RNDR) crypto logo displayed on a smartphone screen.\n\nSource: Maurice NORBERT / Shutterstock.com\n\nRender (RNDR-USD) is a decentralized GPU render farm and 3D visualization platform. It is primed to capture tremendous growth as demand for computer graphics and GPU compute resources scales exponentially with trends like the metaverse, AR/VR, 3D modeling, and video gaming.\n\nThe Render network has already rendered 2.36 million frames in Q3 2023, using GPU capacity provided by regular computer owners looking to passively earn crypto. As more digital assets get created for emergent digital worlds and immersive experiences, Render’s spare capacity becomes extremely valuable.\n\nWhile RNDR currently trades 47% below its 2021 high, I expect surging adoption once crypto markets turn bullish again. Relative price resilience shows institutional interest in this low-key project. With a fixed token supply and staking incentives, Render has major upside as its network usage expands.\n\nInjective (INJ-USD)\n\nLogo for Injective Protocol (INJ-USD)\n\nInjective Protocol (INJ) cryptocurrency coin symbol. Blockchain technology. INJ in bubble\n\nDecentralized finance has seen tremendous growth recently. However, I would argue that DeFi remains an under-appreciated crypto sector. That’s because DeFi provides a central value proposition for the entire cryptocurrency sector, enabling private, decentralized financial access.\n\nInjective Protocol (INJ-USD) is one DeFi project uniquely-positioned for massive upside. In recent weeks, Injective has gained traction by offering robust decentralized trading infrastructure for next-generation DeFi innovation. This infrastructure includes a fully on-chain order book resistant to exploitation.\n\nAdditionally, Injective fully supports all major financial instrument types on-chain, including spot contracts, futures, perpetual contracts, and options. Its Cosmos-based blockchain leverages the Tendermint consensus for instant trade finality and lightning-fast 10,000+ transactions per second throughput.\n\nAdvanced interoperability and bridging across Ethereum, alternative networks like Solana, and non-EVM chains also gives Injective a key advantage. It basically provides the flexible core “Lego pieces” for developers to build multi-chain DeFi products.\n\nAs the cryptocurrency sector gets further integrated into mainstream finance over time, critical backbone infrastructure projects like Injective seem primed to benefit.\n\nOn the date of publication, Omor Ibne Ehsan did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nOmor Ibne Ehsan is a writer at InvestorPlace. He is a self-taught investor with a focus on growth and cyclical stocks that have strong fundamentals, value, and long-term potential. He also has an interest in high-risk, high-reward investments such as cryptocurrencies and penny stocks. You can follow him on LinkedIn.\n\nMore From InvestorPlace\n\nThe post 7 Cryptos Expected to Outperform Bitcoin in 2024 appeared first on InvestorPlace."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxQR21hLWg4RndxdVBET2tpQnA3WklxR0tsdkdheGxzYmVENUg2V2RLMW5rY1BRTkM2emNpNzZwZWNzalluSlZzdUl0YzVUQV9PYWlLQ0t4anZ1MjRsZTVCTng2bXBLamNqY25BWXVBZGstSXgwajhjQVRIZmxIOUhOUEpDeWJDZnBBa0U0VTVVT2lyOE1UMTFCOFN0dDNTQWFyZ0RwYnVNSW44N2t4WVNQWnBvRkFSbm1FZThpQW92X1ZUYUwtZGtQMmhiSk1xaE5zcTRsRER5U3rSAd4BQVVfeXFMTUFuRUp4TDdkbDJ2VUhNWDBST05ldC00MGRINTJ4WXBMbjBkb1MyZVBZS1hPVHZZeTJnaXFXYTBxZlhJb0xEbl9wd283RV9aZU1GeDlNR2xzblJac000WFJwUFhnZWswUmFOdUFHeWdUNHd4blFNU0dKbG9sVWhhY3h0Yl9Qd2twdXBubWRySngzUUJqVTEwSmJLVVpZQTdGd3ZYZkRmTnZSaGJ6aWlabXl2WDdRLS1vZml6Qm1Gd2JreDF4SEFYVGw0dDV0UWF6UmIzam5BTHR6YS0yZUFB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 12 Feb 2024 08:00:00 GMT",
        "title": "Whales Abruptly Move $350,000,000 in Bitcoin, Ethereum, Solana, Litecoin and XRP – Here’s Where the Crypto Is Headed - The Daily Hodl",
        "content": "Wealthy crypto investors are moving hundreds of millions of dollars worth of digital assets, including Bitcoin (BTC) and Ethereum (ETH), as a new week begins.\n\nAccording to the address tracker Whale Alert, crypto whales have abruptly shifted $350 million worth of virtual currencies in the last 36 hours.\n\nSeveral gargantuan transactions involving Bitcoin and Ethereum are on Whale Alert’s radar.\n\nAll three transactions sent BTC from unknown wallets to crypto exchanges, where the crypto could potentially be sold on the open market.\n\nBitcoin is trading for $49,777 at time of writing, a 3% increase during the last day while ETH is worth $2,559 at time of writing, up 1.6% in the last 24 hours.\n\nOther transactions noted by Whale Alert involve altcoins Solana (SOL), Litecoin (LTC) and XRP.\n\nThe XRP transactions appear to be connected to the crypto payments company Ripple.\n\nMeanwhile, the Litecoin in question was moved off an exchange, and a multi million-dollar pile of Solana was sent to Binance.\n\nSolana, LTC and XRP are trading for $109, $0.53, and $0.082 at time of writing, respectively.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE4zeFVubGc1My16cGxGWUVvMG81SWRiMHBqN2ZjQ0NycE1qdUp3QUgwLWpHd3JWVmw2cFc5RkFsTjk1Q0F1NjF1QW1DNnUyYVJLeGotNGUwMWo1c1JhQkVodkdfUHY0NFV1QUdWQ3draFZFNkU1MTBYTjRJRHA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Feb 2024 08:00:00 GMT",
        "title": "3 Cryptos to Buy Before Bitcoin’s Next Major Move - Yahoo Finance",
        "content": "Bitcoin has been on fire lately! After a relatively quiet 2023, the king of crypto has awoken from its slumber over the past week. Bitcoin (BTC-USD) has gained over 13% in the last week alone, barreling over the key psychological $50,000 per token resistance level.\n\nThis recent surge signals that we may officially be entering a new crypto bull market. The last major Bitcoin bull run started in late 2020 after Bitcoin undertook its quadrennial halving event. Prices skyrocketed until a blow-off top in November 2021.\n\nThis time, the spark likely has more to do with an influx of institutional cash rather than the token’s upcoming halving. With 11 spot Bitcoin ETFs approved last month, billions in fresh capital is entering the crypto sector. Add on the fact that the next halving is likely happening in April 2024, and the stage seems set for even more fabulous fireworks this cycle.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nWhen Bitcoin starts pumping, history shows many altcoins follow suit in a big way. Here are three to consider before they do.\n\nEthereum (ETH-USD)\n\nA stack of ethereum coins\n\nSource: shutterstock\n\nAs the second largest cryptocurrency behind Bitcoin, Ethereum (ETH-USD) has cemented itself as the most correlated altcoin when compared to this crypto benchmark. When Bitcoin pumps, Ethereum almost always follows suit. Historically, Ethereum tends to see amplified gains relative to Bitcoin, delivering even higher returns for investors.\n\nI believe Ethereum is poised to outperform Bitcoin in the next major crypto bull market rally. It still has a smaller market capitalization than Bitcoin, giving it much more upside potential in terms of its valuation multiple. Additionally, Ethereum has recently become deflationary due to its proof-of-stake consensus mechanism and token burning. The token’s current annualized deflation rate sits around 2%, meaning existing Ethereum tokens become more scarce over time.\n\nBut what truly gives Ethereum an edge over Bitcoin as an investment is its role as the dominant smart contract-enabled blockchain network. Ethereum is the foundation for most decentralized applications and Web 3.0 use cases, from NFTs to DeFi. It is spearheading innovation in the blockchain space, while Bitcoin remains primarily a store of value commodity.\n\nFor these reasons, Ethereum has beaten Bitcoin’s performance in every bull market cycle. I expect this trend to continue in the next bull market, as more developers build on Ethereum and more investors recognize its network effects over other chains. The stars are aligning for potentially parabolic gains for Ethereum if Bitcoin’s momentum continues.\n\nStory continues\n\nKaspa (KAS-USD)\n\nAn image of a hand holding a cell phone with several visualizations of digital building blocks floating above it. representing sto platforms\n\nSource: Marko Aliaksandr/ShutterStock.com\n\nKaspa (KAS-USD) has seen tremendous growth over the last year to cement itself as a promising medium-sized layer-1 blockchain. With a market capitalization now above $3.1 billion at the time of writing, Kaspa is catching the eye of both developers and investors.\n\nAs I’ve discussed previously, Kaspa distinguishes itself through its unique DAG-based architecture called GHOSTDAG. By generalizing the blockchain into a directed acyclic graph structure, Kaspa is able to achieve significant scalability improvements in both transaction throughput and processing speed.\n\nThe protocol handles security and ledger ordering by distinguishing “blue blocks” created by honest actors from potentially malicious “red blocks.” The largest strongly connected cluster within the acyclic graph identifies trustworthy blocks to favor. This prevents attacks like double spends or transaction rollbacks. I think Kaspa has the potential to reach a market cap of over $10 billion if the project’s tech becomes more time-tested.\n\nPolygon (MATIC-USD)\n\nA phone, on top of a laptop keyboard, displaying the logo for Polygon. Polygon Price Predictions\n\nSource: sdx15 / Shutterstock.com\n\nPolygon (MATIC-USD) seems primed to ride any Ethereum bull run as a leading Ethereum scaling solution. Originally launching as a sidechain, Polygon has rapidly expanded its capabilities to become a versatile layer-2 network. Its core advantage lies in significantly improving Ethereum’s transaction speeds and reducing gas costs on the Ethereum network.\n\nPolygon now has two main components – Polygon PoS and Polygon zkEVM. Polygon PoS offers compatibility with Ethereum smart contracts by functioning as a sidechain alternative. Polygon zkEVM replicates the Ethereum virtual machine environment with zero-knowledge proof cryptography to enable private transactions.\n\nThis multi-faceted approach aims to maintain Ethereum’s censorship resistance and security guarantees while drastically increasing scalability. Polygon essentially tries to offer developers the best of both worlds – Ethereum-equivalent functionality with faster and cheaper transactions.\n\nNotably, Polygon’s roadmap indicates even bigger ambitions, including upgrading Polygon PoS to a zkEVM chain and launching new standalone chains. With abundant room for growth in both its network infrastructure and token price, Polygon could be one of the top performers if the crypto bull market returns in a big way.\n\nOn the date of publication, Omor Ibne Ehsan did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nOmor Ibne Ehsan is a writer at InvestorPlace. He is a self-taught investor with a focus on growth and cyclical stocks that have strong fundamentals, value, and long-term potential. He also has an interest in high-risk, high-reward investments such as cryptocurrencies and penny stocks. You can follow him on LinkedIn.\n\nMore From InvestorPlace\n\nThe post 3 Cryptos to Buy Before Bitcoin’s Next Major Move appeared first on InvestorPlace."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxOQllVZWhrQ1NxellJRnNiNmhqQl9RTlRFUjVqYUQ4VkNuT0dzSEU2UTF3UlE5UHdTRnpXQzE0MElXXzRsTVdQWWk2UFdKa0NUMFpIRS0weFVWZEdUblpNNEdnTklQSWQ5VFlLVTlkM2k4aHItVmFiV1ZlLVB1RC1sZEk3TUZKNVo5QmtNaGNMOEFYTFZUbi1DZjBsUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Feb 2024 08:00:00 GMT",
        "title": "The price of Solana grows more than Bitcoin and Ethereum - The Cryptonomist",
        "content": "Recently, the price of Bitcoin has risen significantly, breaking through the historical $50,000 mark, with Ethereum closely following. However, Solana has gained even more in percentage terms.\n\nCrypto markets tend to move in a coordinated manner, albeit accidentally, but with some variations. Sometimes these variations are dramatic, while other times they are just movements of different magnitude, but in the same direction.\n\nThe price performance of Bitcoin, Ethereum, and Solana\n\nIf we exclude stablecoins, BTC, ETH, and SOL are the three largest cryptocurrencies in the world by market capitalization.\n\nThe Bitcoin price has gained 4% in the last day, and 16% in the last seven days.\n\nThe ETH (Ethereum) price is up +7% compared to yesterday, but up +14% compared to seven days ago.\n\nSOL from Solana is instead showing a great +8% compared to yesterday accompanied by a +20% compared to seven days ago.\n\nThe fourth cryptocurrency in the world by market capitalization excluding stablecoins, namely BNB, is only showing a +2% increase compared to yesterday and a +7% increase compared to a week ago.\n\nTo find performances similar to SOL, you have to go down to the ninth position (AVAX by Avalanche), while for higher performances you have to go down to the 22nd position of IMX (Immutable).\n\nHowever, if we compare the performance during 2024, from January 1st until today, SOL stands at +11%, while BTC is at +18% and ETH at +17%.\n\nSo the real boom in this 20245 is being done by Bitcoin and Ethereum, among the main cryptocurrencies, while Solana is doing it especially in the last week.\n\nThe growth of SOL\n\nIn reality, the price growth of Solana started much earlier.\n\nUntil mid-October 2023, it was not exceeding $25.\n\nIn late October, it had already risen above $30, and during the month of November, it had doubled, reaching over $60.\n\nHowever, its rise continued even in December, first reaching above $70 and then making an even bigger leap to over $120 at the end of December. This last jump recorded a sensational +120% in just over a month.\n\nIn other words, from mid-October to the end of December, it recorded an incredible +450% in less than two and a half months.\n\nIn addition, since the failure of FTX in November 2022, it had never risen above $30 until October 2023, and since the implosion of Terra/Luna in May 2022, it had never risen above $80 until December.\n\nHowever, it must be said that during 2024 it has not yet risen above $120, so its performance in the beginning of this new year is not at all remarkable.\n\nThe reason why it has recently risen a lot is that at the end of January it had dropped well below $90, so the recent increase is actually a rebound after a strong 30% correction.\n\nThe growth of the price of Bitcoin and Ethereum compared to Solana\n\nA different story can be told for BTC and ETH, because in 2024 they have already reached price peaks higher than those of 2023.\n\nBitcoin at the end of 2023 had gone from $27,000 in mid-October to $43,000 at the end of the year, with a +60% increase in two and a half months.\n\nIn the course of 2024, it had already made a brief jump to $49,000 on the day of the launch on the markets of the new ETFs, but only to then drop below $39,000. So the $50,000 reached yesterday is the new all-time high post-bubble, and the growth of the last seven days has not only been a rebound.\n\nEthereum, on the other hand, had gone from $1,600 in mid-October to $2,300 at the end of 2023, with a gain of 45% in two and a half months.\n\nIn January, it briefly rose to almost $2,700, only to then drop to $2,200. Yesterday’s return near $2,700 is a middle ground between Solana’s rebound and Bitcoin’s new annual record.\n\nThe price of ETH is currently still only at the levels of early May 2022, which is well below the almost $4,900 of November 2021.\n\nSo in the long run, Bitcoin’s performance remains the best among the three, compared to the levels of 2021, while Solana’s performance remains particularly the best in 2023.\n\nLow interest from retailers\n\nOne really interesting thing is that there doesn’t seem to be any FOMO going on.\n\nIn fact, the interest of investors and retail speculators is still quite low, despite BTC only returning to -27% from its all-time highs.\n\nBitcoin hit $50k.\n\n\n\nMeanwhile, Google search volumes relative to price are at all time lows.\n\n\n\nThis is a new era. pic.twitter.com/8DnsadIclt — Yassine Elmandjra (@yassineARK) February 12, 2024\n\nThis is probably due to the decreasing interest that retailers have in Bitcoin, as many of them are mainly looking for the big hit with stellar profit percentages that BTC probably can no longer guarantee.\n\nIf true FOMO were to arrive, perhaps brought by some memecoin or shitcoin in a rapid and astonishing rise, the crypto markets could react with further increases, even on Bitcoin and Ethereum.\n\nCertainly what is happening in these weeks in the crypto markets is not yet able to bring real FOMO, because for many retail investors a +16% in seven days is not attractive enough.\n\nThe real madness, which has already been observed several times in the crypto markets, could only come in the face of performances like Solana’s at the end of 2023, namely with a +100% in a few weeks.\n\nNeither Bitcoin nor Ethereum seem to be able to do similar things anymore, at this time, and Solana has already done them by the end of 2023.\n\nThe memecoins and shitcoins, on the other hand, are able to do even better, although large pumps almost always lead to large dumps."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxONU5mcXpwM25UNXhNdlBKbXdoT2lSejl0UkM2Mk56RXpDTkNlZXUzU1ZJeEViWFlNMzJob3Q5UDdUYTBrRFNFMjhfOGZFbVJXT3JjUjFacDJZejhUeDlNd0xBSE1pQU1pZ2FqdjRncmpibWlrNVUwUWJiWWc3QzVlYjUyZ3BtQThVRk9TX3N3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 12 Feb 2024 08:00:00 GMT",
        "title": "The crypto ICP is approaching the Kingdom of Ethereum - Cointribune EN",
        "content": "Mon 12 Feb 2024 ▪ 4 min read ▪ by Evans S.\n\nIn the crypto sphere where each day brings its share of news and challenges, a thunderous announcement has just shaken up the landscape: the arrival of the EVM RPC Canister in beta version marks a giant leap towards a long-awaited merge between ICP crypto and colossal Ethereum. This innovation promises to redefine the boundaries of interoperability and security within the blockchain ecosystem.\n\nA revolutionary innovation in the crypto sphere\n\nThe EVM RPC Canister presents itself as a fluid crypto gateway facilitating integration between ICP smart contracts and those of Ethereum. This technical advance eliminates many of the previously insurmountable obstacles for developers eager to merge these two worlds.\n\nBy streamlining the process of acquiring, managing, and paying for API keys for various EVM RPC providers, this service opens the door to more robust and secure decentralized applications (dapps).\n\nOne of the major contributions of the EVM RPC Canister lies in its ability to guarantee the security of dapps. With an ingenious mechanism of automatic consensus inference, each outgoing request to multiple RPC providers ensures unprecedented reliability and crypto data integrity. This aspect is crucial in a field where trust is the cornerstone.\n\nThe management of API keys, often tricky and a source of risky centralization, is greatly facilitated. Developers can now focus on innovation without being hampered by technical complexities and cost constraints associated with Ethereum’s RPC services. The promise of seamless interoperability with Ethereum is now more tangible.\n\nA bridge between two giants\n\nThe process of integrating this innovative crypto service is both simple and intuitive, demonstrating its creators’ commitment to democratizing access to blockchain technology.\n\nAn example of rapid implementation perfectly illustrates the ease with which developers can now weave links between ICP and Ethereum, paving the way for a multitude of unprecedented cross-chain applications.\n\nBeyond technical simplification, this initiative marks a step toward a broader vision of crypto interoperability. By making interactions between ICP and Ethereum not only possible but also straightforward and secure, the EVM RPC Canister lays the foundation for a more integrated and flexible decentralized ecosystem.\n\nA promising future\n\nThe excitement around the EVM RPC Canister reflects the community’s appetite for innovative blockchain interoperability solutions. Developers, users, and visionaries in the sector are now scanning the horizon, eager to discover the revolutionary applications that will emerge from this new dynamic.\n\nAlthough the project is still in its infancy, the prospects for improving and expanding its features are vast. Feedback from the crypto community will play a crucial role in the evolution of the EVM RPC Canister, ensuring its adaptation and refinement over time.\n\nThe arrival of the EVM RPC Canister Beta represents a significant milestone in the quest for smooth and secure interoperability within the blockchain ecosystem. By breaking down barriers between ICP and Ethereum, this service opens a field of unprecedented possibilities, promising an era of collaboration and innovation like never before. The journey is just beginning, and the transformative potential of this technological convergence is immense. Let’s stay on the lookout, for the story of crypto is being written before our eyes, and it promises to be exciting.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxQUTVOOEwyLUpBSFRNSTFPT0xtQXFoT3ZMaHJ4dm5LSTh4RGVzRjN0eDdxNXJjZFdCSVJlcXhEZ01aQXh6Z3p3VHgtNU5mcU1tUjVTWHptS0NYV2dtTGNZYlNGNlU1eXNQSDlnTHJhcHNWRUh5Yy1pUEVFdGNCZGNuTEY1UnBVYjdy?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Gas Fees : Did Someone Pay Transaction Fee of 42 $ETH? - CoinGape",
        "content": "After the Ethereum merge, the investors hoped for reduced gas fees on the Ethereum network. Instead, many users had to make transactions with hefty transaction fees. Starting with today’s example(13 February), a single transaction on the network was charged 42.88 ETH gas fees, worth around $113531.\n\nadvertisement\n\nEthereum gas fee concerns are getting out of hand, where this time, a user had to spend 42 ETH to transfer 10 ETH. People are questioning the sense of such a transaction where the fee is four times the transaction itself.\n\nIt hasn’t happened for the first time, as many similar past events are also in the records. Last year, an investor paid 64 ETH ($118,600) for a single transaction.\n\nAfter the merge, we didn’t see many unreasonably high gas fees, but even the few examples were a lot to handle because of the hefty amount people had to pay.\n\nEthereum was known to be the future of transactions, but events like this are pushing people to more layer 2 solutions like Polygon and Arbitarum. Because of this, more and more people are shifting towards these solutions that charge just a fraction of the original chain but deliver the same amount of security.\n\nWhy A Network Charge Transaction Fee?\n\nAlmost every blockchain requires transaction fees to complete any transaction on their network. Those fees vary depending on the blockchain. Among these blockchains, Ethereum is known for its security but also a high gas fee application. There are four scenarios where you will have to pay a gas fee for Ethereum: –\n\nWhile Making a Transaction (Sending Ethereum) During Minting NFT’s Utilizing Ethereum-based Smart Contracts Creating Dapps\n\nThe gas fees can vary depending on your purpose of use and supply and demand on the platform. During the 2017-18 bull run, the average recorded gas fee was in-between $5-6. We only saw it moving up from there, increased Ethereum prices and network congestion take the blame for that.\n\nIs Ethereum Cancun-Deneb (Dencun) a Solution For Gas Fees?\n\nDencum is yet another highly anticipated upgrade for Ethereum that will happen in the first quarter of 2024. This upgrade promises to work on major ongoing issues of Ethereum, including scalability, security, and efficiency. This upgrade will introduce nine EIPs ( Ethereum improvement proposals), including implementing the EIP-4844. EIP-4844 is supposed to reduce the gas fees on the platform by introducing new blob-carrying transactions. For now, we can understand that these blob-carrying transactions will cost less because of the large blob sizes. Overall, we will get some relief from the high gas fees. After the successful implication of this upgrade, we will have to see whether they work for real to improve the shortcomings of the network or not.\n\nConclusion\n\nEthereum’s gas fee is necessary for the proper functioning of the platform. The complex transactions require more gas fees compared to the easier ones. Yet, sometimes, the charged fees are not worth the value of the transaction. The solution for such a situation isn’t that close, so the people can opt for the other layer2 options to transact after carefully analyzing the timing of transactions."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxPbm1lSHM3Q3dQQkx0TEY1eDdFTEEzS3RDLUZlNVhEUGZaWGo2clBSbnZIMENoZ0V3bkhpMDc3RGxpaFh1NFRCV19GYmVmYmRORnBCalFsVzQwTTZqUVlTRno5bjZubVpCVU5wa21BamtpWUJOWlcyUktBT0JSUS02WGQxdGFIWFYwOWg3UWxFbm12aDZkWks1UVlpbENrSFhHbFNuRU5sZ3BtMVg4ZDlQRU1fYlBMcWk3OF9uc3JoMFdmWVk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 12 Feb 2024 08:00:00 GMT",
        "title": "In free fall the ERC-404 tokens, while the Ethereum blockchain awaits the Dencun update - The Cryptonomist",
        "content": "A few days ago, the trend of ERC-404 tokens exploded within the Ethereum blockchain, leading to an increase in interest in this new digital innovation and at the same time an increase in network gas fees.\n\nNow the prices of these new coins are plummeting, and they are recording double-digit daily losses.\n\nMeanwhile, Ethereum eagerly awaits the Dencun update, which will be completed on March 13th: ETH, in anticipation of these improvements, could soon see new yearly highs.\n\nAll the details below.\n\nEthereum blockchain: the hype for ERC-404 tokens ends immediately\n\nJust 10 days ago, a new token standard was launched within the Ethereum blockchain, namely ERC-404, which immediately caught the attention of enthusiasts with a crazy increase in the prices of these new experimental resources.\n\nThe most well-known, as well as the first to have made its debut in this new market niche, is PANDORA, which has grown by 400% in just 3 days of trading.\n\nBy itself, the ERC-404 standard represents a mere experiment by the Pandora team, which combines the characteristics of the ERC-721 and ERC-20 standards typical of the Ethereum blockchain, creating a hybrid token between an NFT and a fungible token (a semi-fungible).\n\nThe central idea behind this new standard is that when someone owns less than a whole NFT, the NFT disappears and the user only owns a fraction of a token. If they combine enough tokens to obtain a whole one, the NFT is returned to them, only it might be a different NFT.\n\nOver the weekend, after traders flocked to new ERC-404 tokens like PANDORA, DEFROGS, and MONKEES, causing frightening price increases, the first capital outflows were observed.\n\nSince February 9th, PANDORA, the crypto leader of this new trend, has lost over 50% of its value, seeing more than 100 million dollars evaporate.\n\nEven DEFROGS and MONKEES have dropped significantly compared to weekend prices.\n\nCoinMarketCap: PANDORA-USD chart\n\nThe enthusiasm for this novelty was immediately dampened after the news spread of a team of Ethereum blockchain developers who are working on an alternative implementation of ERC-404.\n\nThis alternative will be called “Divisible NFT“, abbreviated as DN-404, more performant and definitely much cheaper than the previous one.\n\nIts main developer, known as cygaar, said that the new standard could arrive soon, potentially shifting the focus of the degens.\n\nThere are also rumors that the developers of Pandora and those of Divisible NFT have entered into conflict with each other because they are working on similar technology.\n\nFor now, it seems that the market has priced in a greater interest in the upcoming novelty, which will significantly lower the fees of the Ethereum blockchain.\n\nAccording to The Block data, during the past week the 7-day moving average of transaction fees on the network reached $11, after increasing from $4 at the end of January.\n\nParsec Finance has pointed out on X that this rapid increase in fees is mainly due to ERC-404.\n\nAnalysis of ETH price awaiting Dencun: new highs coming\n\nWhile the prices of ERC-404 tokens suffer from competition from new competitors, ETH consolidates its bullish structure waiting for the long-awaited Dencun update of the Ethereum blockchain, scheduled for March 13th.\n\nThis will introduce new functionalities within the network, such as the so-called proto-danksharding, which is a basic version of the scaling solution “sharding”, aimed at compressing the weight of a block by separating data storage, thus managing to lower validation fees.\n\nDencun is mainly focused on making Ethereum’s layer-2, which represent the most solid trend of the past year for the smart contract blockchain, significantly more scalable and cost-effective.\n\nThe ETH crypto at the time of writing the article has a price of $2483, well above the 50 EMA on a weekly time frame.\n\nThe currency quotes, after going through a terrible 2022 and a less encouraging first half of 2023 compared to bitcoin, start 2024 with a bang.\n\nEther aims for $3000 after being rejected at $2700 in conjunction with the approval of the Bitcoin spot ETF on US exchanges.\n\nThe bulls need to break the psychological barrier of $2500 as soon as possible, and subsequently the one of $2700 (with a weekly close above) to fuel the hopes of buyers, while the bears try to crack the chart by bringing prices below $2150.\n\nThe break of one of the two extremes will determine the price action of the coming weeks, which however tends to rise and register new annual highs.\n\nWeekly chart of Ethereum price (ETH/USDT)\n\nIt is also very important to consider the ETH-BTC chart, for a 360° view of what is happening in the crypto market.\n\nThe currency belonging to the Ethereum blockchain is in fact subordinate to Bitcoin, which always and in any case remains the king of this sector.\n\nThe moments in which ETH records its best price performances are in fact those in which it outperforms the trend of BTC.\n\nFor this reason, identifying possible levels on which the ETH-BTC chart can find new bullish strength is essential to predict an increase in value against the dollar.\n\nIn the coming weeks, we could finally see a recovery of ETH on the digital gold, with the threshold of 0.05 sat potentially acting as a shield against further bearish incursions.\n\nIf it were to maintain its level by forming a double bottom, ETH-BTC could easily reach 0.06 sat, reversing the short-term trend and pushing for an appreciation of the asset.\n\nIn an optimistic context like the one described, in addition to ETH and altcoins, even ERC-404 tokens could benefit from it, with the Ethereum blockchain shining among the many decentralized networks in the crypto landscape."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxQRGNfOEFQdlRCSkVJNExYQTVjRFF1bkRUMmhTRktuSThoZnR4VGVXbWF4aXlzUEFQZk9SUG9kbE9HNS14akljZ1dIS2czLXM5SEpVY2tiYnlYb09NSGdHeWZybTRlUHVWMk5vNDgxSW5ZQkRjcHZlcDltRjdpdElkQUYzWS0zWlo0SnBzcVZrRTE4N1lqSWdYb0g1YjE5X0tBV0tnTm9lVU1ZRUtWQ3BkZ2x1Q2VmV3A5V21OdEN4RdIBxAFBVV95cUxQcFdnNmF6YU1fSF81TUVvNHlENXVQYmZCd0taZUFGQmxKV3FQcVJJNkxQbHNfNWtKMzI0UkJsMk02ajZMUEFReUtnaWI2Sk5Fb0ZQRUVLZ1RJTkRPWlc1cUI5QW9ONjM4YTFLUm9hME9GR0RBaXJuSVNSclo3T19tOHRteEQzSE9CTmpXYnFkNXJ5S0NmRGJVZm9OZUhTeFRpQ1ZXUmZ0OG1xcTRBUkd4SDc5aExmeTV5eGNqLXpnVW9pbUFQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 12 Feb 2024 08:00:00 GMT",
        "title": "Solana Leads Gains in Crypto Majors, Bitcoin Metric Suggests Low Retail Growth - CoinDesk",
        "content": "“There’s no upcoming news that may have a price correlation with bitcoin except the halving, which may provide returns in the medium to long term,” shared Ryan Lee, Chief Analyst at Bitget Research, in a note to CoinDesk. “It’s also important to take market’s psychological levels, such as BTC prices ranging from $50K to previous ATH, which may cause larger price retracements.”"
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMi9wFBVV95cUxQNDNQZXZidGJyaG1abktyalp4NWlZQy1sSVM1UnJIdUJkcXZha1BPQThoenliZ1RpMmxYVFJGdFNaRFNkai1qRlMwaWdUal9EZUlITUtDcV96VDVxOElaUDhNb3hOUWMzbXlUZTc0by1FUGdkTnBCRERMTW1iRlpVUElROVhaN0c5UlYxUjZEb2tZQmlPWGdIQmR5RmtWWS1QUVBveXF4NTd1MmYzeHJESGxQdFdKWHY2RHVlRDV6MTV0Tnh0blRrQ0hMRDVqdi04aVF4M19YSW5sOFdUT185TlYtZFpITjJfWGdNcnNIOFo4N2FvSzVj0gH8AUFVX3lxTFA2QWJIMW5PZmNjY3NXUGhMNnJ1aUtZV3FNMzFEb29FWUhNVGJuZy01bVQ0T1ZiVDRmRXgzd2dQNWxjdURFQVc0eFRiUDdLQUFSaHozbHVtcTRMM0R6WmM5NlZnd3haMVY2UGpESGxULU5BMlN2aXBZTnc3a05zLUhhd1dxRnZXOXVTUFY3Ym0zNWR6QnhLVGhrNng3M2g4YTdSWUVyU0YzY3NxZVVkQlRtamRCT0ZqR2hjS3BUVHRYTFBscUEtSWcyaHlxQWtIakp5R1lnazNjZGxWUmlyVXBjdEN5WVVqbWtsamE4QTJiRXg4czg4YjktTUNjdg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Feb 2024 08:00:00 GMT",
        "title": "Cryptocurrency Price Today: Bitcoin Crosses $50,000 For The First Time Since December 2021 - ABP Live",
        "content": "Bitcoin (BTC), the oldest and most valued cryptocurrency in the world, climbed above the $50,000 mark early Tuesday, for the first time since December 2021, before climbing down to $49,750 at the time of writing. Several factors, including the likes of ETF inflows, upcoming Halving event, and a healthy US stock market, have led to BTC’s much-needed rally. Other top coins, including the likes of — Ethereum (ETH), Dogecoin (DOGE), Solana (SOL), Ripple (XRP), and Litecoin (LTC) — landed in the greens across the board. The BEAM token emerged to be the biggest gainer of the lot, with a 24-hour jump of over 13 percent. FLARE, on the other hand, became the biggest loser, with a 24-hour dip of over 2 percent.\n\nThe global crypto market cap stood at $1.87 trillion at the time of writing, registering a 24-hour gain of 3.52 percent.\n\nBitcoin (BTC) Price Today\n\nBitcoin price stood at $49,785.67, registering a 24-hour jump of 3.30 percent, as per CoinMarketCap. According to Indian exchange WazirX, BTC price stood at Rs 42.88 lakh.\n\nEthereum (ETH) Price Today\n\nETH price stood at $2,639.92, marking a 24-hour gain of 5.54 percent at the time of writing. As per WazirX, Ethereum price in India stood at Rs 2.27 lakh.\n\nDogecoin (DOGE) Price Today\n\nDOGE registered a 24-hour jump of 1.68 percent, as per CoinMarketCap data, currently priced at $0.08179. As per WazirX, Dogecoin price in India stood at Rs 7.11.\n\nLitecoin (LTC) Price Today\n\nLitecoin saw a 24-hour gain of 1 percent. At the time of writing, it was trading at $71.95. LTC price in India stood at Rs 6,194.58.\n\nRipple (XRP) Price Today\n\nXRP price stood at $0.5286, seeing a 24-hour gain of 0.91 percent. As per WazirX, Ripple price stood at Rs 45.88.\n\nSolana (SOL) Price Today\n\nSolana price stood at $113.15, marking a 24-hour jump of 6.17 percent. As per WazirX, SOL price in India stood at Rs 9,650.\n\nTop Crypto Gainers Today (February 13)\n\nAs per CoinMarketCap data, here are the top five crypto gainers over the past 24 hours:\n\nBeam (BEAM)\n\nPrice: $0.02928\n\n24-hour gain: 13.33 percent\n\nORDI (ORDI)\n\nPrice: $69.95\n\n24-hour gain: 12.49 percent\n\nHelium (HNT)\n\nPrice: $8.83\n\n24-hour gain: 9.67 percent\n\nSei (SEI)\n\nPrice: $20.7338\n\n24-hour gain: 8.99 percent\n\nGnosis (GNO)\n\nPrice: $275.72\n\n24-hour gain: 8.24 percent\n\nTop Crypto Losers Today (February 13)\n\nAs per CoinMarketCap data, here are the top five crypto losers over the past 24 hours:\n\nFlare (FLR)\n\nPrice: $0.0327\n\n24-hour loss: 2.40 percent\n\nImmutable (IMX)\n\nPrice: $2.93\n\n24-hour loss: 2.13 percent\n\nKaspa (KAS)\n\nPrice: $0.1403\n\n24-hour loss: 1.18 percent\n\nAxie Infinity (AXS)\n\nPrice: $7.69\n\n24-hour loss: 0.63 percent\n\nUNUS SED LEO (LEO)\n\nPrice: $4.09\n\n24-hour loss: 0.20 percent\n\nWhat Crypto Exchanges Are Saying About Current Market Scenario\n\nMudrex co-founder and CEO Edul Patel told ABP Live, “Bitcoin crosses the $50,000 threshold, marking its first break since 2021. The surge is attributed to the strong showing of the US stock market, substantial investments in spot Bitcoin ETFs, and an impending halving event. The next resistance for Bitcoin is at the $50,250 level, suggesting the potential for a continued climb beyond $51,200. Positive investor sentiment is reflected in active bullish activity in the market. At the same time, Ethereum sustains a position above $2,600, with bullish investors aiming for the $2,717 threshold.”\n\nCoinSwitch Markets Desk noted, “After a long wait of more than 2 years, BTC finally hit the prestigious figure of $50k once again yesterday as the total crypto market cap inches towards the 2 trillion dollar mark. Incidentally, BTC has printed 8 consecutive green candles, a fit previously achieved in July 2021 which led us to the last all-time high at $69k. With the market picking up pace, the world’s second biggest crypto by market cap, Ethereum (+6%) and its top layer-2 solutions, OP (+8.3%) and ARB (+7.5%) have also started to show strength to move towards another local high if the momentum in BTC is sustained with just two months to go in the most sought after event in the crypto ecosystem — the BTC halving.”\n\nSathvik Vishwanath, CEO and co-founder of Unocoin, said, “Bitcoin's rise above $50,000 is causing losses for bears, supported by its strongest weekly close since December 2021. Bitcoin is trading more than 3% higher, having gained 13.5% last week, marking its biggest weekly gain since October. Bears expecting a deeper pullback after bitcoin's plunge below $40,000 last month are thwarted by the nearly 30% recovery since late January. Spot bitcoin ETFs saw net inflows of $1.1 billion last week, surpassing $10 billion in assets under management. Macro tailwinds from US stock markets reaching record highs and Fed rate cut expectations further boost Bitcoin. While bearish concerns persist due to an overbought RSI and nearing market highs, bullish resistance around $52,000 with aggressive buying is likely to persist, spelling more woes for Bitcoin bears.”\n\nCoinDCX Research Team told ABP Live, “In the last 24 hours, BTC reached a significant milestone, breaking the $50,000 mark and hitting its highest level of the year. This led to a widespread increase in altcoins, contributing to the overall crypto market cap nearing $2 trillion. From a technical perspective, both BTC and ETH are showing bullish momentum. BTC has its sights set on $51,800, while ETH aims for $2,700. Traders should pay attention to the US CPI announcement today, as it has the potential to impact market volatility. Being cautious in response to such events is advisable.”\n\nRajagopal Menon, Vice President, WazirX, said, “Bitcoin surpassed $50,000 for the first time since December 2021, fueled by the positive impact of ETFs, solidifying its position among the top 10 most valuable assets. Bitcoin's recent surge saw a 3.59% increase in the last 24 hours, with a notable 16.87% gain over the past 7 days, currently priced at $49,915.98. Ethereum (ETH) is trading at $2,654.07, experiencing a 5.88% rise in the last 24 hours and a 15.28% increase over the past week.”\n\nShivam Thakral, CEO of BuyUcoin, said, “The Total Crypto Market Capitalisation has risen to $1.87T with Bitcoin crossing $50,000 for the first time in 2 years. As expected, Bitcoin soared to $50,000 after holding and breaking above the $49,000 support. On the Other hand, Ethereum is trying to break the $2700 resistance which might be successful when Bitcoin Dominance decreases from the current 52%. There are Approximately 60 days until the Bitcoin Halving in April 2024 which could potentially push the Cryptocurrency market to new highs.”\n\nSubscribe And Follow ABP Live On Telegram: t.me/officialabplive\n\nDisclaimer: Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Cryptocurrency is not a legal tender and is subject to market risks. Readers are advised to seek expert advice and read offer document(s) along with related important literature on the subject carefully before making any kind of investment whatsoever. Cryptocurrency market predictions are speculative and any investment made shall be at the sole cost and risk of the readers."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxOS1hPdXhhVXY0dlhjVnAzWmJ5bmRoRWpnTzk3bk1FN0lsZmRJc2NqUVFjYm5IMEpBOEhXSmxoMHQ4TzcwMXVXazF3MG10YkFkN3g0cjZ4OWJHNy00cXdTamtCUTZJdkdDYkJrd0dVZF9MbDVLU3hIa2J3TkhGMlduaFpucHNOQkFic0dWUkN1YnE3UHZ0M1FsNGRZNE0tNnRETUlUWjhDNA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Feb 2024 08:00:00 GMT",
        "title": "Solana & Ethereum Lead Top Crypto Gainers – 5 Best Coins to Buy Now as Prices Pump - Watcher Guru",
        "content": "The crypto market has started the week bullishly, with Solana (SOL) and Ethereum (ETH) posting gains of over 7%. Other top altcoins also saw significant boosts as crypto investors became even more optimistic.\n\nThis article will discuss the price rises of SOL and ETH and highlight five alternative cryptocurrencies that could also be worth buying while the market is hot.\n\nSolana & Ethereum Surge as Cryptocurrency Market Turns Bullish\n\nOver the past 24 hours, Solana and Ethereum have posted substantial gains and look likely to continue their upward trajectory.\n\nSOL now trades around $114, up nearly 10% since yesterday.\n\nThe layer-1 blockchain’s native crypto has seen its market cap swell to almost $50 billion, with spot trading volume surging by 85%.\n\nMeanwhile, ETH hit $2,685 earlier today, marking a 7% increase in the past 24 hours.\n\nETH’s market cap now exceeds $320 billion, cementing its status as the second-largest cryptocurrency behind Bitcoin (BTC).\n\nThe price rises of SOL and ETH come amid a broader altcoin surge, with investor sentiment turning decidedly bullish over the past week.\n\nMoreover, with the Crypto Fear & Greed Index now in “Extreme Greed” territory, there seems to be support for further upside soon.\n\nWhat Are the Best Coins to Buy Now as Crypto Prices Rise?\n\nAs the cryptocurrency market posts strong gains, investors may be wondering what other coins are worth buying.\n\nThis section will highlight five cryptocurrencies beyond Solana and Ethereum that could also see their prices pump in the days and weeks ahead.\n\n1. Jupiter (JUP)\n\nJupiter (JUP) has emerged as one of the most talked-about cryptos amid the ongoing altcoin surge.\n\nAs the governance token of the Jupiter decentralized finance platform on Solana, JUP allows holders to guide decisions on liquidity plans, token emissions, and other essential parameters.\n\nThe token also serves as a crucial part of Jupiter’s offerings, like perpetual swaps and its upcoming stablecoin, SUSD.\n\nWith 40% of the total supply airdropped to nearly 1 million wallets, JUP has seen impressive adoption and usage so far.\n\nAs Solana continues seeing developer and user growth and Jupiter builds out its DeFi offerings, JUP has significant room for price appreciation in 2024 and beyond.\n\n2. Meme Kombat (MK)\n\nNext on our list is Meme Kombat (MK), a presale cryptocurrency hosted on the Ethereum blockchain.\n\nMeme Kombat combines elements of crypto gaming with meme coin virality, offering a virtual battle arena where users can bet on hilarious animated fights.\n\nEach fight features two well-known meme coin mascots, with fight outcomes determined on-chain.\n\nAside from wagering, MK holders can also stake their tokens to earn passive income.\n\nMore than $8.6 million has been raised through Meme Kombat’s presale, meaning the hard cap of $10 million could be reached very soon.\n\nWith DEX listings on the horizon, Meme Kombat could be another crypto worth buying as the market continues its bullish surge.\n\nVisit Meme Kombat Presale\n\n3. Dymension (DYM)\n\nAs one of the pioneers in the “modular blockchain” space, Dymension (DYM) is another crypto that may be worth considering.\n\nDymension is building a network of high-speed “RollApps” – easily deployable blockchains tailored for specific use cases.\n\nThe DYM token serves as the native asset facilitating transactions, staking, governance, and cross-chain transfers.\n\nWith an innovative RollApp Development Kit allowing rapid blockchain creation, Dymension offers an easy solution to scalability issues that hamper the adoption of dApps.\n\nAt the time of writing, DYM is trading for just $7.17 and has recently passed a market cap of $1 billion – suggesting that the token could be gearing up to explode soon.\n\n4. Bitcoin Minetrix (BTCMTX)\n\nBitcoin Minetrix (BTCMTX) is a first-of-its-kind “Stake-to-Mine” platform hosted on Ethereum.\n\nUsing Bitcoin Minetrix, crypto enthusiasts can mine Bitcoin without needing expensive computing hardware.\n\nThe process involves staking BTCMTX tokens to earn mining credits, which are then burned to receive hash power.\n\nNot only that, but BTCMTX holders can also generate further tokenized income through staking – with yields currently set at 63% per year.\n\nOver $10.7 million has been raised in Bitcoin Minetrix’s presale, with BTCMTX tokens on offer at the discounted rate of $0.0134.\n\nGiven the massive buzz around Bitcoin’s upcoming halving event, Bitcoin Minetrix could attract enormous attention once launched later this year.\n\nVisit the Bitcoin Minetrix Presale\n\n5. Manta Network (MANTA)\n\nConcluding our list of the best coins to buy now is Manta Network (MANTA).\n\nManta is building dual modular networks in Manta Pacific and Manta Atlantic.\n\nThe former is a layer-2 ecosystem for private Ethereum dApps, and the latter is a high-speed standalone blockchain on Polkadot.\n\nPowered by zero-knowledge proofs, Manta allows private and compliant on-chain transactions at scale.\n\nDISCLAIMER: THIS IS A SPONSORED POST"
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxNc2dwY0lQUWhrMzA4WjZSMGYwdmNIeERNb0h6ZXhCcjRmbzEyY0NaNFhGZTNjcDh0N2c4azNPOTlseTFjTGhGTDNhdWU1SWJlMEFaYnVTemx2b0llYlZnS3RGTi0tZXdRNk9sZVREczFXSU9SdmNXYW0yalNnRnZwMHJSZ19IcVdIeVJILVRtUDZzSzJ0Z1NqYnBadnRuZ3ZzcS1wc1ZqTHplX3VZVGRHcHZUUURQWVRvQkxWV0h6SW56bWhfUHlV?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Feb 2024 08:00:00 GMT",
        "title": "Crypto Market Price Analysis Today: Ethereum (ETH), Aptos (APT), Internet Computer (ICP), Optimism (OP), IOTA - Blockchain Reporter",
        "content": "Bitcoin has surged to the critical $50,000 milestone, fueled by the robust performance of the U.S. stock markets and significant investments into Bitcoin-specific exchange-traded funds (ETFs).\n\nMany experts are bullish about the ongoing upward trend. However, several analysts have issued a note of caution to investors on social media, pointing out that the percentage of Bitcoin’s total supply that is currently in profit is approaching 95%, a level that often brings a decline.\n\nDespite the potential for short-term setbacks, the outlook for [ccpw id=60415] remains positive over the longer term. Glassnode indicated in a post that certain on-chain metrics suggest Bitcoin might be at the early stages of a bull market.\n\nCould this upward trajectory of Bitcoin also lift certain altcoins? Let’s dive into the charts to explore this possibility.\n\nEthereum (ETH) Price Analysis\n\nAttempts by bears to hinder Ether’s recovery were observed around the 61.8% Fibonacci retracement mark of $2,700, but bulls are strongly defending a decline below immediate Fib channels. As of writing, ETH price trades at $2,616, declining over 1.6% from yesterday’s rate.\n\nThe upward trend of the 20-day Exponential Moving Average (EMA) at $2,640 and the Relative Strength Index (RSI) declining from the overbought region suggest that the volatility is stabilizing. If [ccpw id=60480] surpasses $2,700, it might consolidate within $2,900-$3,000.\n\nThe critical support level to keep an eye on is at $2,400. Should this support be breached, we might see an escalation in selling, potentially driving the price down to a significant support level at $2,250, where it is anticipated that buyers will mount a strong defense.\n\nAptos (APT) Price Analysis\n\nAPT’s attempt to recover is being met with resistance at the 20-day Exponential Moving Average (EMA) of $9, suggesting a negative sentiment as traders opt to sell during price rallies.\n\nShould the price decline from its current position, the bears will aim to push and keep the price beneath the solid support level of $8.8. Achieving this could lead the APT/USDT pair to fall towards the vital support at $7.9, where it is anticipated that buyers will robustly defend the level.\n\nConversely, a breakthrough and sustained closure above the 20-day EMA would signal a shift towards strength. Following this, the APT price might ascend to the descending trend line, poised to be a significant obstacle for the bulls. Surpassing this resistance could pave the way for a potential surge to $11.1.\n\nInternet Computer (ICP) Price Analysis\n\nICP has been oscillating within a symmetrical triangle pattern for several days, reflecting a standoff between buyers and sellers.\n\nThe 20-day Exponential Moving Average (EMA) at $13 is leveling off, and the Relative Strength Index (RSI) hovers around the midpoint, suggesting an equilibrium in market forces. To seize control, buyers need to push the price out of the triangle’s confines. Following this breakout, the ICP/USDT pair could aim for a surge towards the resistance zone between $14 and $16.\n\nConversely, if sellers manage to drive and keep the price beneath the triangle’s uptrend line, it could trigger a decline towards the firm support level at $9.8, and possibly extend to $9. This level is expected to witness vigorous defense from buyers.\n\nOptimism (OP) Price Analysis\n\nOptimism is currently at a critical juncture, with buyers and sellers contesting the price near the EMA20 trend line.\n\nThe bulls managed to push the price above $3.3, yet they struggled to capitalize on this breakout the following day near $3.9. The bears attempted to seize control by pushing the price below immediate Fib channels, but the bulls stood firm and strongly defended, indicating strong buying interest at lower levels. The aim for buyers is to drive the OP/USDT pair towards $4.1.\n\nOn the flip side, the bears are plotting to pull the price back under the moving averages. Succeeding in this effort could see the pair tumble to the crucial support level at $3.2, a level which buyers are keen to protect. Failing to hold this line could lead to a further decline to $2.9.\n\nIOTA Price Analysis\n\nThe bulls successfully pushed IOTA beyond the neckline of its inverse head and shoulders (H&S) pattern and are now working to hold onto these gains amidst a retraction near $0.27.\n\nShould the buyers keep the price north of $0.27, the IOTA/USDT pair could quickly move up to $0.32, followed by a potential rise to $0.35. Surpassing this barrier would indicate that the upward trend is set to continue, with $0.4 as the subsequent bullish target.\n\nOn the other hand, a sharp decline and fall below the moving averages would suggest that the breach above $0.27 might have been misleading, setting a trap for the bulls. Under such a scenario, the pair could drop to $0.23, and possibly further down to $0.2."
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxQcHdfY3RhcWZ3TzZhYmFodV9veUl1U3lSUlBVQmRhVS1qMUhMbWpYemt1M0pkZEFpeVhhZFljM1lQNWVqQktVUC1SY3NjdDA0M2dIU0NoYUVyaGJIRGdFVXdEN2UwZmh5cU1FcTktWjBDenQ0eU1GdTJZUHdwSVNrR09QQkJPbDNrQkRhRm9mWUVHWVlYczBWaXd0MkpsbHRRT1hxenBRSTVjdGNMaEtiNC1SdmJxdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Feb 2024 08:00:00 GMT",
        "title": "Bitcoin Pre-Halving Rally 'Has Begun,' but Ethereum and Altcoins Will Follow BTC - Here's Why - Captain Altcoin",
        "content": "Home » Journal Bitcoin Pre-Halving Rally ‘Has Begun,’ but Ethereum and Altcoins Will Follow BTC – Here’s Why Journal Bitcoin Pre-Halving Rally ‘Has Begun,’ but Ethereum and Altcoins Will Follow BTC – Here’s Why Samuel Munene\n\nAccording to analyst Rekt Capital’s newsletter, the Bitcoin “Pre-Halving Rally” phase began earlier than expected. Rekt Capital noted that Bitcoin had broken away from its Pre-Halving Downside period and entered a new Pre-Halving Rally phase. “The Pre-Halving Rally phase has begun, a little ahead of schedule,” noted Rekt Capital.\n\nThis Bitcoin breakout has major implications for the wider altcoin market. Rekt Capital explained that it is “kickstarting a new Money Flow Cycle.” Altcoins have started to react to Bitcoin’s new pre-halving rally stage. Besides, Rekt Capital analyzed that altcoin market capitalization broke out from its bullish pennant formation over the past few weeks, representing a historic breakout from this structure.\n\nBreaking Out: Altcoins Follow Bitcoin’s Lead\n\nAs Rekt Capital pointed out, “After extended consolidation at highs, Altcoin Market Cap is ready for a new uptrend. Historically, yellow-circled retests have preceded uptrends to revisit the blue level at $250bn, which would set up another retest (blue-circled retest). Altcoins are going to increase in valuations over the coming several weeks.” Hence, with the altcoin market cap breakout, valuations of individual altcoins like Ethereum are anticipated to rise.\n\nRekt Capital discussed Ethereum’s price movement in detail . As predicted, Ethereum has rallied 15% from its range low and is moving towards its range high of $2791. “Generally, the fact that Altcoin Market Cap and Ethereum have broken out, shows that Ethereum is following Bitcoin and with time – Altcoins will too,” noted Rekt Capital.\n\nAltcoins Bottoming Out for a Bullish Cycle\n\nMoreover, this timing is beneficial as altcoins are currently in their lowest hype period for Q1 after experiencing significant retracements from late 2023 highs, according to Rekt Capital’s analysis. “Now, Altcoins should be bottoming in preparation for their next wave up,” commented Rekt Capital.\n\nCelebrate Dogecoin and Make Big Gains with Doge2014! Doge2014 raises 500K in days celebrating Dogecoin. Make potentially big profits and get in on exclusive airdrop! Show more + Show less –\n\nAs per highly-regarded analyst Rekt Capital, the Bitcoin halving pre-rally has started alongside bullish breakouts in the altcoin market cap and Ethereum price. Individual altcoins are anticipated to follow the upward trajectory of Bitcoin and Ethereum over the coming weeks as they bottom out of their low hype cycle.\n\nYou may also be interested in:\n\nJoin and Get 10k Tokens FREE! Sponsored Visit Meme Arcade by FOFAR Now Early access bonuses with 10k $BACON for joining now\n\nEngaging community with games and crypto incentives\n\nIntegrated platform with GameFi and NFT functionalities\n\nSimple interface that’s easy for new users to explore crypto gaming"
    }
]