[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxOTEJRdHVJOVFOcERpQzVHSmFfSk1za0hvY2JTajlPSjRLYWVxNTZYOHRIU2x4dWV4Q3BPalBoYmE2RVBHSHNyckNsUW5qV21jN05EZ3dEOXZxRFJZYmhyWGkwLWlEQ1Q5bWtmNXV4U2UzdGxEeVctN3B4NGJ5T0FUNkxxSWRaZ0dEU2F0b3BDSExfN2ZJa0RhdjVKcDF0Zw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 27 Feb 2024 08:00:00 GMT",
        "title": "4 Crypto Stocks to Watch in the 2024 Ethereum Institutional Rally - Nasdaq",
        "content": "The second-largest cryptocurrency in the world, Ethereum (ETH), has started 2024 on a great note. While Bitcoin (BTC), too, has been fast off the blocks, rising 20% year to date, ETH has risen 33%. Ethereum, which trails only Bitcoin in the crypto world, is known for its uses as a blockchain-powered, open-ended decentralized software platform.\n\nThe network has, over the past year, completed the Shanghai Upgrade. The upgrade has ensured that it shifts its blockchain validation system from proof-of-work to proof-of-stake. Under the proof-of-stake system, miners of Ethereum will rely on Ether holders who will act as validators, thus lending more assurance to the system. In essence, proof-of-stake allows holders of Ether to lock up their funds as collateral to validate transactions and create new blocks, reducing the need for extensive computation and energy consumption.\n\nThis has led to far stricter trading, and ETH supply has remained stagnant as a result. Also, the amount of Ether locked up has risen significantly, with ETH held on exchanges at an all-time low of 11%.\n\nHowever, per Bybit Research, the biggest boost has come from the new institutional investments. Institutions are over-allocating their portfolio to ETH compared to BTC. This is in contrast to the retail crypto market, where investors lean on Bitcoin.\n\nMajor players like Franklin Templeton and Fidelity, which already had Bitcoin ETFs approved by the Securities and Exchange Commission, are among firms that have submitted applications for an ether ETF. In fact, demand has gone up over the past few weeks, with market participants expecting a probable ether spot ETF approval by May of this year. ETH is currently trading above $3200, and the next earmarked resistance level is $3500.\n\nSo, with Ethereum already starting to make good of the state of the market, it might be prudent to keep a watch on stocks exposed to this open-source, decentralized blockchain platform. Here is a selection. These currently carry a Zacks Rank #1 (Strong Buy), #2 (Buy) or #3 (Hold). You can see the complete list of today’s Zacks #1 Rank stocks here.\n\nAccenture plc ACN: This global system integrator provides consulting, technology and other services markets Ethereum-based blockchain solutions to businesses to make it easier to process payments.\n\nAccenture’s expected earnings growth rate for the current year is 4.7%. The Zacks Consensus Estimate for its current-year earnings has improved 0.1% over the past 60 days. Accenture currently carries a Zacks Rank #3.\n\nCME Group Inc. CME: This company operates as one of the world's largest futures exchanges and offers a wide range of derivatives contracts and various solutions to invest in cryptocurrencies like Ethereum.\n\nCME Group’s expected earnings growth rate for the current year is 2.8%. The Zacks Consensus Estimate for its current-year earnings has improved 1.5 % over the past 60 days. CME Group currently carries a Zacks Rank #3.\n\nHIVE Digital Technologies Ltd. HIVE: This cryptocurrency mining company that operates in Canada, Sweden and Iceland, engages in the mining and sale of digital currencies, including Ethereum Classic.\n\nHIVE’s expected earnings growth rate for the current year is 66.5%. The Zacks Consensus Estimate for its current-year earnings has improved 11.9% over the past 60 days. HIVE currently carries a Zacks Rank #3.\n\nBlackRock, Inc. BLK: This publicly owned company, which is one of the world’s largest investment managers andwas one of the first companies from the traditional market to join the Bitcoin ETF race back in June 2023 and got it approved this January, has already entered the ETH fray by applying for spot ETF.\n\nBlackRock’s expected earnings growth rate for the current year is 4.9%. The Zacks Consensus Estimate for its current-year earnings has improved 5.2% over the past 60 days. BlackRock currently carries a Zacks Rank #2.\n\nJust Released: Zacks Top 10 Stocks for 2024\n\nHurry – you can still get in early on our 10 top tickers for 2024. Hand-picked by Zacks Director of Research, Sheraz Mian, this portfolio has been stunningly and consistently successful. From inception in 2012 through November, 2023, the Zacks Top 10 Stocks gained +974.1%, nearly TRIPLING the S&P 500’s +340.1%. Sheraz has combed through 4,400 companies covered by the Zacks Rank and handpicked the best 10 to buy and hold in 2024. You can still be among the first to see these just-released stocks with enormous potential.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nCME Group Inc. (CME) : Free Stock Analysis Report\n\nAccenture PLC (ACN) : Free Stock Analysis Report\n\nBlackRock, Inc. (BLK) : Free Stock Analysis Report\n\nHIVE Digital Technologies Ltd. (HIVE) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxQR0VJaXdaNTcwQ0w3NmpCWGEwX2EtckFPLTNoSl9tUW9jaldLczVfT2ZvaS1PTm1PWG1rVzZKSFYtSk9wOUlmeWhyMy1INS1vc0ZSb0NhNndaVzZYdENCVFNMWWJQRm4xNFc2NWEyMkFicGk5cWttYkZrQXJycmpxcmZ0TU8talFuYVZVUHFzMEZBX2pzcEE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Feb 2024 08:00:00 GMT",
        "title": "Forget Bitcoin and Ethereum: This Cryptocurrency Is Poised for an Incredible Run - Yahoo Finance",
        "content": "Cryptocurrencies are waking up after another long slumber. Ethereum (CRYPTO: ETH) has gained 92% over the last year, while Bitcoin (CRYPTO: BTC) climbed 128% higher. From the introduction of new crypto-based investment vehicles to the upcoming halving of Bitcoin-mining rewards, many forces have combined to thaw the latest crypto winter.\n\nBut not every cryptocurrency has been invited to the party yet, even if their growth prospects look at least as promising as Bitcoin's or Ethereum's. In particular, Polkadot (CRYPTO: DOT) seems undervalued and poised to break out in a market-beating run. The official blockchain network of the Web3 Foundation isn't getting the market respect it deserves.\n\nPolkadot's low price sticks out like a freshly stubbed toe if you agree that a decentralized and personalized internet is the future.\n\nI'm not saying you should sell all your Bitcoin and Ethereum to reinvest it in Polkadot today. A diverse portfolio always makes more sense, even in the uncharted waters of the crypto industry.\n\nBut in case you haven't considered adding some Polkadot yet, let me explain why this token is in a prime position to beat both the stock and crypto markets over the next few years.\n\nImage source: Getty Images.\n\nWhat is Polkadot, anyway?\n\nPolkadot is a blockchain network designed to solve a fundamental problem of the crypto world: different blockchains can't easily talk to one other. Imagine a world where your Apple iPhone couldn't connect directly to a Samsung Galaxy device -- that's the old blockchain reality. Polkadot acts as a translator and bridge, allowing blockchains with different purposes and designs to seamlessly communicate and share data.\n\nThe Web3 vision for the internet is all about decentralization and user control. Polkadot makes this possible by enabling customized blockchains (so-called \"parachains\") to plug into its network. These parachains can be tailored for specific uses like gaming, finance, or social media, creating an interconnected ecosystem where value and information flow freely.\n\nThis programming ecosystem supports quick and easy development of apps and programs that take advantage of the best features in many different blockchains. Polkadot makes it easy to store monetary value in Bitcoin, execute Ethereum's smart contracts, collect real-world data from Chainlink (CRYPTO: LINK), and more.\n\nAnd the DOT token (commonly referred to as Polkadot) is the lifeblood of this decentralized system, passing data between different blockchain networks with ease while ensuring the security of data transfers. Plus, its multichain design allows for many transactions to be processed quickly, avoiding the bottlenecks of less scalable blockchains.\n\nStory continues\n\nHow the DOT blockchain makes money\n\nRunning transactions through Polkadot's proof-of-stake ecosystem generates a tiny fee for the validation nodes that process every request. This toll fee for traveling on the next-generation information superhighway serves as an incentive for helping the system work.\n\nIn this way, increased use of the Polkadot network directly translates to higher demand for DOT tokens, since they are needed to pay transaction fees. As the ecosystem grows and more value flows through Polkadot, the underlying DOT token becomes more valuable.\n\nThe current reward rate for staking your Polkadot tokens stands at 17.3%. That's quite high, in order to motivate more DOT owners to stake their tokens and take a more active role in the system. Less than 53% of all DOT tokens are staked today, below the target rate of 60%. So the reward rate could change over time as the staked portion grows or shrinks. Staking also lets DOT holders participate in network governance, further influencing the value of their holdings.\n\nPlus, that's the raw reward rate for people running their own nodes on the DOT network under ideal conditions. The rate will be lower if your chosen crypto-trading service keeps a part of the staking revenue for itself. For example, my Coinbase (NASDAQ: COIN) account currently shows a 6.9% earning rate for staking DOT tokens.\n\nThese mechanisms ensure that DOT's value is tied to the growth and success of the Polkadot network.\n\nPolkadot Price Chart\n\nPolkadot has room to grow, but many market makers haven't noticed yet\n\nDOT's 14% gain over the past year pales in comparison to Bitcoin's and Ethereum's returns. Yet those larger crypto names operate in different, often less-dynamic market segments.\n\nWith its interoperability focus, Polkadot sits at the leading edge of Web3 innovation. Market caps are often imperfect metrics in rapidly evolving industries, and DOT's $10.5 billion market value should grow much larger in 2024 and beyond.\n\nIt seems like a gross undervaluation given Polkadot's pivotal role in the emerging decentralized internet. Astute investors can see this mispricing as a chance to buy into a leading Web3 infrastructure play at a significant discount.\n\nShould you invest $1,000 in Polkadot right now?\n\nBefore you buy stock in Polkadot, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Polkadot wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\n\nSee the 10 stocks\n\n*Stock Advisor returns as of February 26, 2024\n\nAnders Bylund has positions in Bitcoin, Coinbase Global, Ethereum, and Polkadot. The Motley Fool has positions in and recommends Apple, Bitcoin, Chainlink, Coinbase Global, and Ethereum. The Motley Fool has a disclosure policy.\n\nForget Bitcoin and Ethereum: This Cryptocurrency Is Poised for an Incredible Run was originally published by The Motley Fool"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMia0FVX3lxTE9UbE14ekUweGt0SDJwaHpnQl94b3lJdy1zaW9kQVRLa3FLazBxSzV1Q2UyMVE0OXo4NG1nVkFyNmdNdVliVXJiZkRnR200X2tJUGNrZ3dFZXNQZW1hRmhSVXFTUGJHWjktM3Bn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 27 Feb 2024 16:07:10 GMT",
        "title": "Ethereum Foundation gives Dencun upgrade an activation time on March 13 - Blockworks",
        "content": "The Dencun network upgrade has been “successfully activated on all testnets,” the Ethereum Foundation Blog announced on Tuesday.\n\n“Two years after its ETHDenver inception, dozens of testing calls and devnets later, protodanksharding is finally going live on mainnet,” the Ethereum Foundation said.\n\nDencun will be activated on the Ethereum mainnet on March 13 at epoch 269568, the blog post added. The activation will take place at 13:55 UTC, or 8:55 am ET.\n\nAccording to a post on X from Galaxy’s Christine Kim, March 13 was the expected date for the activation, though the exact timestamp was unknown.\n\nLoading Tweet..\n\nStakers will need to update their beacon nodes and validator clients to be compatible with the upgrade.\n\nAs of Feb. 22, according to Kim, “all client teams, except Lodestar, have released final software versions for the Dencun upgrade.”\n\nRead more: Ethereum’s Dencun is now live on the Holesky testnet\n\nThe upgrade was run successfully on the Holešky testnet earlier this month. It previously ran on the Goerli and Sepolia testnets.\n\nThe upgrade will introduce proto-danksharding to the Ethereum blockchain. Rollups, under EIP-4844, can add “blobs” of data on a beacon node.\n\n“The data in these blobs is not accessible to the EVM and is automatically deleted after a fixed time period (1-3 months). This means rollups can send their data much more cheaply and pass the savings on to end users in the form of cheaper transactions,” a post on the Ethereum Org’s website said in early January.\n\nThe name Dencun, the Ethereum Foundation post added, comes from a combination of star and Devcon city names. Specifically, Dencun is the combination of Deneb — a star — and Devcon 3 location Cancun.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxQOWtQREJZUGVvb3lSUXRPcC1JOHBwR1EwbXFhYkYyekRWNXRQdng2M0s0dll3X3lISC1YdG1tdmdjTmlYMXlkU2w3cm56bkNfbnlKTmZPNEFRX3MwTVRXQXhXX2ZISkNnX0NwUldfa2l1SEt5R3JLanlFaVZLYmUzcVJzMGkxQlVJalFJODBMM0c0V0U3SkpSSEFUbUVfUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Feb 2024 08:00:00 GMT",
        "title": "ETHDenver Comes at a Critical Time for Ethereum: Here’s What to Expect - Unchained",
        "content": "For the past decade, Denver has acted as a physical gateway to a new internet intended to be both permissionless and open-sourced. This year’s ETHDenver finds itself at the convergence of several significant events in the crypto space.\n\nThis year’s ETHDenver comes a few weeks before Ethereum undergoes its Dencun upgrade.\n\nDenver is not just home to the Rockies, the largest mountain system in North America. The Mile-High City is where ETHDenver takes place, an annual community-run gathering for those curious about smart contracts, decentralized finance, and blockchain networks.\n\nFor the past decade, Denver has acted as a physical gateway to a new internet, serving as the entry point for people to meet others and coordinate building a digital landscape intended to be both permissionless and open-sourced.\n\nAs snow falls, some crypto enthusiasts are already in Denver, participating in hackathons, networking for potential investment deals, and learning more about the underlying technologies that power decentralized networks.\n\nThis year’s ETHDenver finds itself at the convergence of several significant events in the crypto space. It comes a few weeks before Ethereum, the second-largest blockchain network by market cap, will undergo its Dencun upgrade, which is expected to substantially improve transaction cost efficiencies for layer 2 rollups.\n\nThe “innovation festival,” as ETHDenver’s landing page calls it, also comes as competition among layer 2 scaling solutions is ramping up, with some networks maturing and others just joining the race.\n\nArbitrum\n\nand\n\nOptimism\n\n, with a total locked value of $3.186 billion and $929 million respectively, according to blockchain analytics firm\n\nDefiLlama\n\n, have been operational for several years, gearing up for the next stage of their blockchain networks.\n\nRead more: Is Ether Heading for $3,500?\n\nOn the other hand, new layer 2s, some connected to centralized exchanges such as Base and Mantle, have gone live on public mainnets within the past 12 months.\n\nOne newer layer 2 blockchain network, Blast, has attracted over $2 billion in crypto assets from a total of about 165,000 users, and yet the protocol has yet to activate its public mainnet. The Blast team announced on X that they would roll out Blast’s mainnet on Thursday, the same day ETHDenver founder John Paller and Colorado governor Jared Polls conduct the conference’s opening ceremony.\n\nRepresentatives of Arbitrum, Optimism, Base, and Mantle, among other Ethereum rollups, will be in Denver.\n\nNew Proposals and Techniques\n\nIn addition to fresh layer 2 entrants, applications and protocols on Ethereum have seen new proposals and techniques. For example, EigenLayer, widely known for introducing a new mechanism called “restaking,” has accumulated $8.88 billion in locked value in its smart contracts since it launched in June 2023.\n\nMeanwhile, the largest decentralized exchange by trading volume, Uniswap, is undergoing community discussions following Uniswap Foundation governance lead Erin Koen’s proposal to distribute fees generated by the protocol to UNI token holders.\n\n“2024 will be a year of growth, but also a year of evolution for crypto”, wrote Alex Thorn, head of research at Galaxy, in a report published in late January. In that vein, Ethereum’s multifaceted landscape is simultaneously maturing and changing, marked by technological experiments and strategic shifts within the space.\n\nContributors from EigenLayer, Uniswap, and other protocols will also be taking part in ETHDenver, and so those attending the conference can expect discussions inspired by panels, fireside chats, and even casual small talk, about the various elements of Ethereum: layer 2 scaling solutions, governance proposals, and staking techniques.\n\nPolitics\n\nETHDenver also comes as crypto lobbyists, lawyers, and regulators are preparing for the upcoming U.S. primary elections slated to start in April. As such, attendees can anticipate people sharing their views on the United States’ current political scene.\n\nPolicymakers have historically played an integral role in the crypto space through legislation and public remarks.\n\nSenator Elizabeth Warren said on Feb. 2 in a hearing of the U.S. Senate Committee on Banking, Housing, and Urban Affairs that “cyber criminals are exploiting cryptocurrency to scam American consumers out of billions of dollars every year.”\n\nFormer U.S. President Donald Trump, the frontrunner for the Republican presidential nomination, has not only released a few NFT collections but also said in a Fox News town hall event in South Carolina on Feb. 24 that he could “live with” people wanting to pay with BTC, after previously being fairly critical of the cryptocurrency.\n\nNotably, the United States Securities and Exchange Commission also approved several spot bitcoin exchange-traded funds (ETFs) last month, causing investors to speculate on when the SEC, headed by Gary Gensler, will approve spot ether ETFs.\n\nAt ETHDenver, several political figures will be speaking as well. On Thursday, SEC Commissioner Hester Peirce will be part of a fireside chat about public goods. U.S. presidential candidate Robert F. Kennedy Jr. will have a conversation on Saturday with the founder and CEO of Custodia Bank, Caitlin Long, about the role of blockchain policy. Colorado’s congressional representative Brittany Pettersen, who is a member of the House Financial Services Committee, will also be speaking on Saturday about the “Crypto Conversation in D.C.”\n\nBitcoiners, Solana Enthusiasts, and Avalanche Loyalists Pull Up, Too\n\nWhile ETHDenver initially was started by people intimately tied to the Ethereum community, the annual multi-day conference has drawn in individuals and communities outside of Ethereum, such as Bitcoin, Avalanche, and Solana.\n\nLast Friday, Solana Foundation developer advocate Nick Frostbutter spearheaded a workshop at ETHDenver to help people get started on Solana.\n\nCrypto enthusiasts can also attend the Hack House hosted by Ava Labs, the software development firm behind Avalanche, another layer 1 blockchain like Ethereum and Solana. “Looking forward to attending ETHDenver next week, going to check out the Avalanche hack House and catch up with some of my good friends in the Ethereum community,” Emin Gün Sirer, founder and CEO of Ava Labs, wrote on X last week.\n\nDenver will have Bitcoiners, too, as Bitcoin Renaissance, an event focused on the “synergies between Bitcoin and [Proof of Stake] chains,” like Ethereum, takes place on Thursday.\n\nAttendees will have the opportunity to engage, learn, and listen generously to individuals from a diverse range of blockchain ecosystems within and beyond Ethereum, the incumbent leader of smart contract functionality.\n\nIn the waning days of winter, Denver, already a physical portal to a new internet some have named “Web3,” heralds a dynamic atmosphere where people are meeting up to push the boundaries of decentralized networks.\n\nUnchained is a media partner of ETHDenver and will cover the conference. Stay tuned!"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxONUVLaFNSUG9DVHR2VHlfWEtuYVRXaExCMTdxWEQtSmNTS0otVWlZRkJ6RUJKeWlseGxpVnY3UzhrWEYzRTdGZWJtaDAtYl9rX0lwSXFFTXRaUlh3UjluN2NCVC1zd3h0d2RGcWxtcldlVGU0WEZXM2c3dUFfQWdQbWY3T2NrOVppTTlnSWFjR2JfN1RBcmxidWtxbmg2STQzQ0x4ZEVLT3UzTlVnWDhNLS1icXdXUGttOXJLcnJtNmpNbjFP?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Emerges As CRE's Preferred Crypto As Investor Interest Reignites - Bisnow",
        "content": "Nearly a dozen companies, including investors like BlackRock and Fidelity Investments, filed applications this week to launch exchange-traded funds using ethereum, the favored cryptocurrency of the commercial real estate world.\n\nMany in CRE dipped their toes into crypto when the craze first hit the financial world years ago. But the renewed interest in the opaque digital currency spurred by a key Securities and Exchange Commission approval last month could open new doors for property investment.\n\nPhoenix-based NAI Horizon Executive Vice President Jeffrey Garza Walker told Bisnow he is hearing new buzz in CRE about crypto, and particularly ethereum, especially as major ETFs roll out. Garza Walker's specialty is industrial assets, and he believes that blockchain will be a normal way to transact commercial real estate within two years.\n\n“Certainly, there's a lot more momentum behind it now, a lot more velocity,” Garza Walker said. “There's a system in place to look at and start to get comfortable with. As people get more comfortable and feel that this is a safe way to transact, they are going to learn that it's quicker and much more easy than what's been traditionally done.”\n\nEther trades on the ethereum blockchain, and the two terms are often used interchangeably.\n\nCrypto is having its biggest week since before the crash in 2022, with investors pouring into the sector. Investments are being made in vehicles that didn't exist two years ago, such as ETFs that can invest directly in cryptocurrencies, like BlackRock's iShares Bitcoin Trust, which pulled in a record $520M in a single day on Tuesday.\n\nUntil recently, ETFs were only allowed to invest in crypto-adjacent entities, such as bitcoin miners. In January, the SEC approved ETFs that invest directly in bitcoin, and the agency may approve ETFs for ethereum in May.\n\nAs the erratic bad boy of the crypto world, bitcoin gets the glory and notoriety, but not wide acceptance by commercial real estate. As crypto's No. 2 entity, ether is a different story, quietly working its way into CRE.\n\nEther experiences less volatility than bitcoin, the stock price of which has whipsawed in the last five years, hitting a two-year high of more than $60K this week. Ether’s share price, meanwhile, reached over $3K this week, a 45% increase over last year.\n\nIn addition to being the more predictable of the two front-runners, ether is widely regarded as the best option for executing smart contracts, which are perhaps the most commonly used application of crypto among CRE professionals. Smart contracts can be executed automatically on ethereum, removing the need for intermediaries, and the system uses a special programming language that allows for high levels of customization.\n\nEthereum is the “settlement layer” of choice of Coinbase, the largest U.S. crypto exchange platform, according to Aaron Rafferty, co-founder of StandardDAO, a tech company that counts proptech among its specialties. In a crypto context, a settlement is the finalization of a transaction, such as a property sale, when it is stored within the blockchain.\n\n“Any platform utilizing the ethereum blockchain is essentially using smart contracts, which takes money in and distributes dividends once conditions are met,” according to The Crypto Realty Group CEO Piper Moretti. “The transactions are more transparent due to blockchain technology, but what investors really care about are the ease of trading and liquidity and not having to wait months or even years to get their money in or out of a deal.”\n\nEthereum is also pivotal in the tokenization of assets, which allows investors to acquire relatively small pieces of real property, with ownership registered via blockchain.\n\nThe tokenization concept, which uses blockchain to create “tokens” — essentially ownership units in an asset — has gotten more attention for artwork than real estate, but commercial property is moving in that direction.\n\nEarly attempts at tokenizing real estate taught the industry some important lessons, particularly around which properties would work with the strategy.\n\nIn 2018, tokenization firms Fluidity and Propellr attempted to tokenize part of a commercial property in Manhattan and failed because investors weren't able to wrap their heads around the concept, Moretti said.\n\n“The world wasn't ready for it, as only a small number of investors understood,” she said.\n\nBut when the owners of the prestigious St. Regis hotel in posh Aspen, Colorado, decided to tokenize not long after, investors were ready.\n\nInvestors wanted in on the name and reputation of the St. Regis, Moretti said. The property sits at the base of Aspen Mountain in one of the priciest ski towns in the country. It is frequented by celebrities and high-paying business magnates.\n\nThe St. Regis hotel in Aspen, Colorado\n\nWhile crypto-associated ETFs are grabbing headlines, ethereum is poised for an upgrade. An update called Dencun is scheduled to roll out on March 13, promising to make ethereum more efficient and, importantly for real estate, increase scalability for smart contracts.\n\n“Ethereum’s upcoming Dencun upgrade will generally reduce the cost to use smart contracts via Ethereum Layer 2s, while retaining the Ethereum network’s underlying security,” Grayscale Investments research analyst Will Ogden Moore told Bisnow via email.\n\nGrayscale is the world’s largest crypto asset manager, with more than $10B in assets under management.\n\n“This dynamic, plus the fact that Ethereum is the second largest crypto protocol by market cap, could encourage commercial real estate industry participants to choose Ethereum Layer 2s as they explore future projects on the blockchain,” Ogden Moore said.\n\nStill, there there are limits to what blockchain tech can do in a real estate context, said DGIM Law partner Isaac Marcushamer, adding that smart contracts might be more automated, but they won't take the place of courts in dispute resolutions or affect due diligence much.\n\n“You look at zoning, pro formas, environmentals, mechanicals and architectural surveys. I can't conceptualize how blockchain affects any of that,” Marcushamer said.\n\n“Blockchain appears to be a secure way of tracking transactions that you want to make public,” he said. “That's a really cool way to replace the hundreds of thousands of pages, or millions of pages, that are sitting in the county clerks’ offices.”\n\nBut there's a catch: government approval of such transfers. Control over how that process plays out remains with state or local governments in the United States, and Marcushamer isn't sure that they will come around anytime soon.\n\n“I don't see how, in the buying and selling of real estate, blockchain has the right ingredients yet to make something happen,” Marcushamer said. “Maybe someone will use it as a way to vet that you want to lease an apartment and use it to sign your lease, sure. But those are relatively friction-free transactions today.”\n\nCRE is edging into ethereum-associated blockchain technology, but real estate is still real estate, Marcushamer said, in that it is a slow adopter of new tech.\n\n“Blockchain isn't in its infancy anymore,” Marcushamer said. “I think it's a toddler or a preteen in its evolution. It's starting to have an identity, to be understood for what it is. But the pace of adoption in the blockchain field is going to be slow as we kind of continue to go through this period of uncertainty in real estate.”\n\nThe spiking value of bitcoin and other cryptocurrencies in February is drawing attention to the sector, but since values are volatile, the normalization of crypto ETFs will be more lasting in its impact, Moretti said. Once the big players are in crypto, others will jump in, including real estate players.\n\n“It's not just a fad, and it's not something that's just played out, because we have these large-scale financial institutions embracing it who have figured out a way to make it more accessible to traditional investors in ETFs,” Moretti said.\n\nWide-scale adoption isn't going to happen instantly, but the momentum is there, with the approval of ethereum-associated ETFs adding to it, she said.\n\n“The more adoption, the easier it is for the real estate industry to embrace something like this,” Moretti said, referring to the use of ethereum for smart contracts and tokenization. “Companies like mine are primed for this kind of thing. We're ready for it. Other companies in the real estate industry, not so much, because they haven't been paying attention.”"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxOQjhGWGFFRU92YlVOdkFGdm1VWUNfVFZYSWhVeWNPTTZtQzlDSzVQTjBUTzhndUtMZ1p1UUVKMXdiR29ZLTNwaHZjRFk0T2pxTG1tRklVTnJyNjJzbWY1d0RQN1lHUEhFSnFmRGU3U3dveE56QndhMFM5MzhSdXlDa3Bsbmk4ejdoZ09EWk1pLTlLbzFN?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 27 Feb 2024 08:00:00 GMT",
        "title": "Why Bitcoin, Ethereum, and Dogecoin Rallied on Tuesday - The Motley Fool",
        "content": "Major cryptocurrencies jumped amid speculation for another extended rally ahead of the first Ether ETFs.\n\nSeveral major cryptocurrencies rallied on Tuesday amid news of growing crypto adoption and speculation surrounding the timing of the first spot Ethereum-centric exchange-traded fund (ETF) approvals.\n\nWhen all was said and done during today's regular trading session, the price of Bitcoin (BTC -0.09%) was up 4.5%, Ethereum (ETH -0.78%) had gained 1.8%, and Dogecoin (DOGE 3.96%) climbed 12.2%.\n\nWith Bitcoin ETFs approved, are Ether ETFs next?\n\nThe price of Bitcoin climbed above $57,000 today for the first time since December 2021, apparently bolstered by record inflows into Bitcoin ETFs. Around $2.5 billion flowed into digital asset investment products last week, according to data from crypto research firm CoinShares, with Bitcoin funds responsible for 99% of those inflows. That influx of capital followed a historic decision last month by the United States Securities and Exchange Commission (SEC) to simultaneously approve the first 13 applications for spot Bitcoin ETFs.\n\nThose approvals, of course, were the culmination of months of speculation after the SEC declined to appeal a federal court's ruling in August that prevented crypto-asset manager Grayscale Investments from converting its popular Grayscale Bitcoin Trust into an ETF. That inaction put the onus back on the SEC to move forward with its Bitcoin ETF approval process.\n\nFor several weeks leading up to the SEC's multiple thumbs up, many opportunistic traders capitalized on a broad crypto rally while noting that ETFs are a much more accessible medium for investors hoping to put their money to work in cryptocurrencies. ETFs can be bought and sold throughout the normal trading day through nearly any online brokerage, in contrast to the previous need for investors to set up separate crypto accounts or wallets with a crypto-specific broker. The approvals also stand tall as a de facto vote of confidence from a government agency in crypto ETFs as a legitimate investment medium.\n\nStill, it's worth noting that after a multi-month rally that began in October, major cryptocurrencies initially pulled back following the official launch of the first spot Bitcoin ETFs six weeks ago.\n\nAccording to data analytics firm CryptoQuant, however, the capital influx stemming from spot crypto ETFs -- including a potential Ether ETF next -- has the potential to increase the overall cryptocurrency market capitalization by a total of more than $1 trillion over the long term.\n\nTo that end, crypto traders have now turned their eyes toward the date of May 23, 2024 -- which is the final deadline for the SEC to approve (or deny) spot Ether ETF applications from multiple investment management companies including VanEck and Ark's 21Shares.\n\nWhat's next for crypto investors?\n\nThere are no guarantees, of course, that spot Ether ETFs will be approved in May. But given the similarity of the assets and the precedent set by the dozens of now-live Bitcoin ETFs, the likelihood of an SEC denial seems extraordinarily low with the proverbial crypto ETF floodgates already opened.\n\nBut with the May 23 deadline now less than three months away, analysts at both Bloomberg and Standard Chartered have mused in recent weeks that anticipation of the first Ether ETFs could spark a similar extended rally to what we saw leading up to the first Bitcoin ETF approvals. Considering the Bitcoin ETF hype cycle appeared to spark its own rally around three months prior to those approvals, it's no surprise we're now seeing increased speculation surrounding the potential Ether ETF approval timeline.\n\n\"The Ether spot [ETF] is tied to the hip of Bitcoin spot for sure,\" mused Bloomberg ETF analyst Eric Balchunas last month. \"It's gonna go wherever it goes -- it's basically like on a 15-foot rope following it.\"\n\nIn the end, keep in mind these hype-based gains could be fickle over the short term. But there's obviously multiple billions of very real dollars each week flowing into crypto assets as the world steadily appears to be accepting it as a valid place to park capital. If that keeps happening, it will be no surprise to see the prices of major cryptocurrencies continue to rise accordingly."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxPa2tfb0c2Nk5UMFFoS0hSYUF3WXBUdGc5el9raWd6OUVBTko2cHVwVnV2N3lFSTlxdmxfNnM5d0E4dTM2VmZxU3l3RmxKUk9UcmctM1h4OFc0ZDJjeENxZk1ZeS0yR010XzhPcWNlTWFXQy1UT3R0ZXpNeTdadjJYVmJwdzN0cXppaDVaNndjZEYwcm1lVnA2UGg5MDQ2WHNoUTBiMUgxTEFzWlRoNEFRS2tfUdIBuAFBVV95cUxQTXdvZEpGNEVrWWdXdmVITnVMSWdKdnFRUFFXRVlFQVd6YldzVHJNWkctb3BvX05fSVRxSXdNSzJndW52ZEJYVFAyTXNRMDFKdDJXdEVna1JJVVpEejZnTl9LWndXX2FQTjkyaVJNbEFYbDhMNXN4SUhxMGJKTGVtaWkxck8xTkVMOXlDOF8tc3pQZDRaN21XdWR3V0x3b2JSWWZHZnJDcVNtOWZWa05YcWFoUGpRM2Zu?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 27 Feb 2024 08:00:00 GMT",
        "title": "PEPE and WIF Jump 50%, Putting Ethereum and Solana Meme Coins in Focus - CoinDesk",
        "content": "Such tokens are usually considered to have no intrinsic value – have recently risen in prominence as a beta bet on whichever ecosystem they are based on. Some, like the Avalanche Foundation, a non-profit that maintains the Avalanche blockchain, have even started to invest in meme tokens built on the network in recognition of the online culture and memetic value that such tokens can drive among investors."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxQLXczUjJiMzFNSFREaks5aHYtZ3VlNFZycklpa0dqcURORExnbW0xSzRaLTV0a0dndWxsdVdTT1BtYm9MRFQ5b1lPX3dpVjVUbGFuTHJqSzFyZG1vZGoxWGY3S0FGNE5CVkRNTFRuRzFWVkxkdDhsYjMtd2tUMXVkWDZB0gGHAUFVX3lxTE12Y3VRWXNfbnBDcnNQWlBqT2hlWXBjelo3cFFhLUh4YkdsRjFPYnZ1dm1XMnF2RTJWSlR5bkp5M2N1aEtCWVVRV2I2empMVE5VSnQxZTlvM0dzczZ2SXpvMnM2MXc0SmFMZFVQQjNnQTJKUmQ5R3BheTk3OVZUSmstRzh4UENyVQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Feb 2024 08:00:00 GMT",
        "title": "Ethereum (ETH) Pushes Above $3k. What’s Next? - Blockhead",
        "content": "Ethereum (ETH) hit a key price mark over the past 24 hours, climbing solidly above the $3k level. This came after significant whale movement on Ethereum, as shown by on-chain metrics from Lookonchain.\n\nThis whale accumulation hinted at strong bullish sentiment on ETH with market participants responding with an 68% uptick in Ethereum’s daily trading volume. This resulted in a 4.4% increase in ETH’s marketcap.\n\nAt the time of writing, ETH’s prospects for further gains look good, especially with Bitcoin (BTC) hitting $56k.\n\nEthereum Still Leads the Way\n\nDespite the rise of several other altcoins, Ethereum has retained its place as the leading altcoin. This has established the blockchain’s dominance in the altcoin space with Ethereum providing the base for several other blockchains.\n\nEthereum launched in 2015 with a core feature for smart contracts which has become an essential tool behind decentralized applications (dApps). This has made Ethereum the preferred blockchain of choice for developers and enterprises creating technology with real-world use cases.\n\nETH serves as the native token of Ethereum and despite the challenges with gas fees, its price action continues to serve as a reminder of the surging demand for ETH.\n\nCan ETH Reach $3.6k before February is Over?\n\nEthereum’s daily price chart showed the second largest cryptocurrency has been on a bullish run since the start of February. It rose by over 43%, as the price moved from $2.2k to its current price of $3.2k.\n\nETH/USDT on Trading View (Daily Timeframe)\n\nThis swift increase in price over a 25 day period was powered by increased capital inflows to Ethereum. The Chaikin Money Flow (CMF) remained above the neutral zero mark throughout February, hitting a February high of +0.33. This signified that investors and traders alike were super bullish on Ethereum.\n\nConsequently, this translated to a strong bullish trend, as evidenced by the Relative Strength Index’s (RSI) reading of 81.\n\nParticipants in the futures market reacted to the break of the $3k price level with a rise in ETH's Open Interest and Funding Rate. The Open Interest rose by 8% in the past day while the Funding Rate rose significantly which showed more short positions were getting liquidated than long positions.\n\nETH/USDT Open Interest - Funding Rate | Source: Coinalyze\n\nWith a clearly established trend and the break of the $3k resistance, buyers can look to ride ETH’s bullish trend up to the $3.6k price zone. However, this is where buyers will need to be wary due to ETH’s previous price action.\n\nThe weekly timeframe showed that the last time ETH reached the $3.6k price zone in March 2022, it led to an aggressive sell-off over a three month period that saw ETH fall from $3.6k to $900.\n\nAs such, buyers should anticipate profit taking at the $3.6k level and the possibility that selling pressure could still exist at that price zone.\n\nDisclaimer: This article does not constitute trading, investment, financial, or other types of advice. It is solely the writer’s opinion. Please conduct your due diligence before making any trading or investment decisions."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxQbXprV19seWFzYUZCUnU5aTRZOGdzVVZIXzc3dzN0WS1qUURzQ3diSDM1NmFZaFN2dW5PUE5sOW8wajdRdE44MmEzOUM4cUcxcExLdTZ1ZXlwbFlqLUhDUWszUVJ5eGY4MzFPVmpoQ1cxLUZvTThoRVpzemRHMVZxSw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 27 Feb 2024 08:00:00 GMT",
        "title": "BNB Chain vs. Ethereum: who is winning the dapp race? - crypto.news",
        "content": "The competition heats up in the dapp arena as developers weigh Binance Smart Chain against Ethereum. How do factors like scalability and transaction costs affect their decisions?\n\nThe blockchain space is fiercely competitive, particularly when it comes to decentralized applications (dapps).\n\nAs of Feb. 2, according to data from DappRadar, a prominent analytics platform, Binance Chain (BNB) is at the forefront with 5,215 dapps and a user base exceeding 5.3 million unique active wallets (UAW) over the last 30 days.\n\nEthereum (ETH), on the other hand, holds the second position with 4,497 dApps, although its user base of approximately 1.36 million UAWs pales in comparison to Binance Chain.\n\nLeading blockchain platforms for dapp development | Source: Dapp Radar\n\nHowever, Ethereum’s dapps volume stands at an impressive $115 billion, more than six times Binance Chain’s $17.5 billion, highlighting Ethereum’s substantial developer engagement.\n\nAmid this, Xin Jiang, a former Vice President at Binance, proposed that the market might not require further infrastructure enhancements, as dapps could emerge as the next catalysts for the crypto space.\n\nWhat is happening? Let’s dive deeper into how the dapp market is performing, which chains are leading the development frontier, and which sectors are propelling the dapp market to new heights.\n\nThe current state of dapp market\n\nAccording to a report from DappRadar, the dapp industry witnessed an impressive 124% year-over-year increase in its UAW, culminating in a daily count of 4.2 million UAW by the close of 2023.\n\nFast forward to the beginning of 2024, and the momentum shows no signs of slowing. As of Feb. 1, the dapp industry notched up a new milestone with 5.3 million daily UAW. This represents an 18% surge from the previous month and the highest since 2022.\n\nBreaking down the numbers by industry segments provides insights into the diversification of dapp usage.\n\nSource: Dapp Industry Report 2023\n\nBlockchain gaming continues to lead the pack with a steady 1.5 million dUAW, maintaining its dominance from the previous month. This translates to a 28% dominance over the entire dapp ecosystem,\n\nSimilarly, the decentralized finance (defi) sector remains strong, holding steady at 1 million dUAW.\n\nHowever, it’s not just gaming and finance that are driving growth. The non-fungible token (NFT) space has experienced a notable expansion, with a 4% uptick this month, reaching 697,959 dUAW.\n\nAmid this, the social dapp sector has gained headlines, boasting an impressive 868,091 dUAW. This surge, a 262% increase over the previous month, is largely attributed to platforms like CARV and Dmail Network, indicating a surge of interest in social networking on decentralized platforms.\n\nRise of social dapps\n\nThe growing popularity of social dapps comes in response to increasing worries about data privacy breaches and online scams on traditional platforms.\n\nThe acquisition of Twitter by tech magnate Elon Musk in 2022 triggered a wave of discontent among its user base. Subsequent changes, like considering a paywall, led to a drop in monthly active users, expected to continue into 2024.\n\nAmid this, social dapps like Friend.tech gained traction. Launched in Aug. 2023, Friend.tech quickly became a major player in the social crypto scene, with over 100,000 users and $25 million in revenue.\n\nBut the shift to decentralized apps isn’t just about dissatisfaction with centralized platforms. Analysts highlight that regulatory scrutiny and privacy concerns, particularly in the EU, also drive this trend.\n\nDapps differ from traditional platforms by avoiding centralized data collection for ads, with some being non-profit and prioritizing user privacy.\n\nHowever, while decentralized platforms offer more freedom and anonymity, they also attract communities with extreme views, raising concerns about the spread of extremist content.\n\nAs of Feb. 26, based on data from DappRadar, CARV, Galxe, and Dmail Network have emerged as the foremost social dapps, gauged by total UAWs in the past 30 days.\n\nCARV and Dmail Network have seen significant growth, with volumes up by 330% and 120%, respectively. However, Galxe has experienced a substantial decline of up to 100%.\n\nWhy is Binance Chain leading the dapp race?\n\nWhen comparing Binance Smart Chain (BSC) and Ethereum in dApps performance, scalability, transaction fees, and consensus mechanisms, we gain insights into their strengths and weaknesses.\n\nBSC stands out for its low transaction fees and high scalability, enabling swift transaction processing at a fraction of the cost compared to Ethereum.\n\nAs of Feb. 26, BSC can handle up to 45.3 transactions per second (TPS), a significant improvement over Ethereum’s current throughput, which remains under 15 TPS but aims for a substantial increase with Ethereum 2.0.\n\nTransaction fees on Ethereum have been a persistent concern, averaging at $0.89 as of Feb. 25. During periods of network congestion, these fees can skyrocket even further, posing challenges for users and developers.\n\nIn contrast, BSC offers notably lower transaction fees, averaging at $0.15 as of this writing, presenting a compelling advantage for those seeking more cost-effective blockchain interactions.\n\nChoosing between BSC and Ethereum depends on the specific needs and priorities of dapp developers and users. Each platform has its trade-offs in decentralization, security, transaction speed, and cost.\n\nBSC excels in providing an efficient and economical solution for high-frequency trading and applications requiring swift transaction speeds and low fees.\n\nOn the other hand, Ethereum’s strength lies in its robust decentralization and security measures, along with a diverse array of dapps and a vast ecosystem.\n\nThe road ahead\n\nThe success of decentralized applications relies on improving user experience to make blockchain-based solutions more accessible. Simplifying interactions, refining interfaces, and incorporating familiar features are crucial to attracting a wider audience.\n\nIn today’s security-conscious digital world, dapps must also prioritize robust privacy and security measures. Innovations in cryptographic techniques like zero-knowledge proofs and secure multi-party computation will be essential for enhancing security.\n\nWhile finance and gaming have dominated the dapp scene, there are opportunities for expansion into new areas such as social media, education, and healthcare.\n\nUltimately, the goal for dapps is mainstream adoption. Achieving this requires not just technological advancements but also educational initiatives to showcase the practical benefits of dapps in everyday life."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxOYTFpbUx1Rk5hVU52b2FNZTNJLXFMU3NLZ2lyZ21ReDhDcVktNmZQUmk4SWtrY2tXSWpiQlhCWU5pLTQ1RHQyZ25DRGVNcXdzcUlJajZFLWJxbm5qUGxMSTQ5bUpWMnN3T3EtbHFwMzJkQjRUdmUwRFFkbncyWW5yaTY3OUlCYm1vSE0wU3BIQmFxV20wWnlraE4tSTdDRnJlUTlIWlg4bFRxLThJaHQwb0dn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 27 Feb 2024 08:00:00 GMT",
        "title": "Magic Eden's Ethereum Marketplace with Yuga Labs Now Live - PR Newswire",
        "content": "SAN FRANCISCO, Feb. 27, 2024 /PRNewswire/ -- Magic Eden's new Ethereum marketplace , created in collaboration with Yuga Labs is live today, introducing the industry's first major Ethereum platform to honor creator royalties. Magic Eden, the leading cross-chain NFT platform, and Yuga Labs, the leading web3 lifestyle and media company and home of Bored Ape Yacht Club (BAYC), Otherside, CryptoPunks, Meebits, Twelvefold, 10KTF and PROOF, joined together with one simple mission: to ensure a thriving web3 ecosystem by recognizing and rewarding the vital role creators play in shaping the future of NFTs.\n\nMagic Eden’s Ethereum Marketplace with Yuga Labs Now Live\n\nIn addition to its new Ethereum marketplace, Magic Eden has also established The Magic Eden Creator's Alliance to show solidarity with platform creators. The Creator's Alliance is an initiative that promotes a sustainable royalty framework, ensuring fair compensation for creators industry-wide. Yuga and Magic Eden will exclusively support marketplaces that honor creator royalties, leaving non-compliant ones behind. Dozens of projects and companies from around the industry have joined the alliance, including Yuga Labs, RTFKT, Pudgy Penguins, Azuki and more.\n\nMagic Eden's Ethereum marketplace gives users access to all the prominent mints from top creators and gives users the ability to receive incentives through Magic Eden's industry-leading rewards program. Users of the platform receive Diamonds for platform activity, including retroactive diamond airdrops for delisting and relisting NFTs on the new marketplace.\n\n\"Royalties are the lifeline that keep creators building fun, weird, and innovative activations in web3,\" said Greg Solano, CEO & Co-Founder of Yuga Labs. \"Magic Eden is the first major marketplace that partnered with creators to launch a platform that we can all be proud of - with custom pages for collectors, loyalty rewards, and contractual royalty enforcement.\"\n\n\"We've always had a goal to expand and build an Ethereum marketplace but we wanted to do it right, and we were able to with amazing creators like Yuga Labs, innovators like Limit Break and the community support through our Creator's Alliance,\" said Magic Eden CEO and co-founder, Jack Lu. \"We're thankful for the collaboration with our partners as they share a strong commitment towards the future of web3, which includes respecting creator royalties and incentivizing growth within the industry.\"\n\nTo further celebrate the launch of the Ethereum marketplace – Magic Eden, Yuga Labs, and other members of the Creator's Alliance have collaborated to create a commemorative NFT art piece designed by Clon of Cool Cats. The collaborative piece will have 1,000 minted: 500 NFTs will be randomly airdropped to those who have used the platform during the first month; the remaining 500 will be awarded to those whose transactions generated the most royalties for creators on Magic Eden.\n\nThe rollout of the Ethereum marketplace and The Creator's Alliance is just the next step in Magic Eden's robust 2024 innovation pipeline, with the company announcing the launch of its cross-chain, self-custody wallet, cross-chain rewards program, and open-sourcing and contributing major protocols to Non-Fungible DAO, all in the last month.\n\nAbout Magic Eden\n\nMagic Eden is the leading cross-chain NFT platform, building a user-friendly platform for minting and collecting NFTs. Magic Eden brings dynamic cultural moments onto the blockchain, empowering users across thousands of digital communities to create, discover and collect unique NFTs. For more information, please visit magiceden.io.\n\nAbout Yuga Labs\n\nYuga Labs is the leading web3 lifestyle and media company offering creative brand IP/NFT projects, gaming, and community experiences. Guided by the belief that the potential of web3 can be realized when we start with imagination, not limitations, Yuga's initiatives aim to reinvent what NFTs look like and push the space forward as a whole. Yuga Labs' mission is to build culture on the blockchain, and owns the IP to the most significant projects in web3, including Bored Ape Yacht Club, MAYC, CryptoPunks, 10KTF, Meebits and PROOF.\n\nSince their launch in April 2021 with flagship collection Bored Ape Yacht Club, they've made headlines as one of the first companies to release IP licenses to their NFT holders, acquired and released rights to other top collections (CryptoPunks and Meebits), and made web3 history with record-breaking synchronized player participation in Otherside. One of the most ambitious interactive metaverse projects to date, Otherside is built with the community, rebelling against traditional walled gardens in gaming spaces.\n\nSOURCE Magic Eden"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiZEFVX3lxTE0wRnlnandhWTRTeDdLWWJqTDZoVXhWYVQ1RkZROUlfUjFvbDM0bEVvMERBZ05KZTgyc2lLRVYyYzRFdlZLZjhZakxDMWgwWFNqbVhsN05CdkJGSm5QNEJfak1tSE_SAWpBVV95cUxQaThGaERVMnBDZWd4WkhXSjd6OXRRLTNIcG80TUNZZFdkbDBJODE2NG1LNF91SVBTYy1LTldfMmZrcEd0eXMwM1lLR2JoM3ltdndiQjRjREQwbXBwY1U2YlVoRzZmQUx6Rnpn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 27 Feb 2024 08:00:00 GMT",
        "title": "Magic Eden ETH Marketplace Goes Live Today – Get the Full Scope - NFT Plazas",
        "content": "Magic Eden ETH Marketplace Goes Live Today – Get the Full Scope\n\nIn the ever-evolving realm of NFTs, today marks a pivotal moment as the highly anticipated Magic Eden marketplace finally goes live, springing to life on the Ethereum blockchain.\n\nIn partnership with Yuga Labs, this platform marks a pivotal advancement in advocating for creators’ rights within the Web3 domain. It emphasizes ethical practices, bolsters artists’ independence, and excludes marketplaces that fail to uphold royalty commitments, as recently announced on X.\n\nCelebrating its introduction, Magic Eden has announced a temporary reduction in royalty rates. For the first 69 days, royalties will be adjusted downward to 2.5% for newly enforced collection rates and 1% for pre-existing legacy collections.\n\nWhat’s more, the marketplace is shortly launching a Mint-to-Earn (M2E) program with a 50% Diamond Bonus on Yuga Labs collections. Users will also be able to get their hands on Diamonds when minting other, specific Ethereum projects.\n\nRoyalty Protection Measures\n\nMagic Eden has been fervently working with the Yuga team to redefine the dynamic between NFT creators and enthusiasts. Their concerted efforts have led to bespoke pages for collectors, schemes to reward loyalty, and, most crucially, strict royalty protection measures that aim to secure regular income streams for creative talents.\n\nAhead of this new marketplace launch, it was announced that support is being withdrawn from platforms not enforcing universal royalty payments, highlighting its initiative to ensure creators receive due compensation.\n\nThe stance on supporting only platforms that uphold royalty payments aims to benefit the entire NFT ecosystem, allowing creators to focus on innovation without worrying about monetization.\n\nY00ts recently declared its participation in this trend, committing to the platform with a strategy that ensures all royalties are funneled back into acquiring its virtual collectibles.\n\nMagic Eden’s M2E Initiative\n\nStarting today, Magic Eden will launch its 50% Diamond Bonus on purchases across Yuga Labs’ collections. Eligible collections include BAYC, MAYC, BAKC, Meebits, Moonbirds, Mythics, 10KTF, G Tags, Stockroom, Gucci Grails, Combat Gear & Crates, Kagami, Otherside Expanded, Vessels, Maras, Koda, Loot, Ship Parts, and others.\n\nMoreover, Magic Eden’s M2E program is set to revolutionize the way creators and collectors engage with digital assets, starting with its inaugural ‘Season 1’ at the end of February. Throughout this initiative, Diamonds will be accumulated and later distributed to those who mint selected projects via the marketplace’s Launchpad, rewarding users for their participation and support.\n\nAlready boasting an impressive lineup of participants, Season 1 includes: Planet Mojo, OSF, ThankYouX, CryptoNinja, SK8PES, Okay Dogs, RENGA, Chimpers, traf, Quirkies, Ironbelly Studios, and SanFran Tokyo, among others.\n\nAs this prized initiative unfolds, Magic Eden eyes Season 2’s shift to the Solana blockchain, signaling a commitment to explore new opportunities and expand its ecosystem across diverse blockchain environments, promising broader horizons for users and partners.\n\nNevertheless, today signifies a significant milestone in the realm of NFTs as the Magic Eden Ethereum marketplace officially debuts, advocating for creator rights, equitable compensation, and strategic collaborations — all while rewarding its users with cherished Diamonds and more.\n\nWant more? Connect with NFT Plazas\n\nSubscribe to our Newsletter\n\nJoin our Discord\n\nFollow us on Twitter\n\nLike us on Facebook\n\nFollow us on Instagram\n\n*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxOUlE1SGFOUjFSN3BiNTdEUlNmVFh2WUlsaGkwR1NxeTFTTU5KSnVqNlY5d0hRMHRfU2JGbXduUWh1WnhuMjgzMFhxTEotZGFHbjhLSkh0bWc0Sldvb3VYbzNmOW9YeWxSNms4cU1zNlotU1hPeGlqSWxpZkJHMkFMR0ZvdTVNRzhWVmZvb1UxbUNEdnllRFRZcUY2WGZKQ05leUhWSjdpVnRmVDItMnJZSmpHRdIBuAFBVV95cUxQbE40bm1GaGFjZk5pRXItM2dENjQ1WGRWX3dhNWdYeHNyTGNhcWZSaWZiZnUtSkRCNlE0OW5wei1LUzRmc0N6aHhYZTExTTI5VTV3d2JvUTBOUkJ1ekJyNHI3eFF0T2pnX3J3TFJMZ2xxcGJIZ2p0d2JWSnMyb3F4ZmYwNklYQkI1cGpHaW1CX3FwWS1kWjNWbTJaZzIwWmVpaDFsUkxjTl9zbXEtbVRLY0g0QUlsR0Fx?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Feb 2024 08:00:00 GMT",
        "title": "Should We Wait for Bitcoin (BTC) at $60,000, Ethereum (ETH) Secures Way to $3,500, Dogecoin (DOGE) at Pivotal Level - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nBitcoin has experienced a substantial rally, pushing past several resistance levels with a vigor that points to positive market sentiment. Currently, the price hovers around the $56,000 mark. A critical observation is the lack of volatility preceding this surge, which appears to have contributed to a short squeeze, catching bearish traders off guard and propelling the price upward as they rush to cover their positions.\n\nSupport levels for Bitcoin are now pegged at $53,000 and $49,645, which align with the recent consolidation range and the 50-day moving average, respectively. These levels are crucial for Bitcoin to maintain its bullish momentum. On the resistance side, the immediate hurdle lies at $58,000, followed by the psychological and substantial barrier of $60,000.\n\nBTC/USDT Chart by TradingView\n\nBitcoin's trend is bullish, with the asset trading well above its moving averages, a sign that could indicate sustained bullish pressure. The trading volume has seen a significant uptick during the rally, suggesting strong buyer interest and the possibility of continued upward movement.\n\nIn a bullish scenario, if Bitcoin can breach the $58,000 resistance, it may well be on its way to testing the $60,000 threshold. Such a move would likely require continued institutional interest, positive developments in the cryptocurrency space and the maintenance of a favorable macroeconomic environment.\n\nAdvertisement\n\nEthereum's lead\n\nEthereum has seen a robust upward trend, with the price currently floating around $3,225. The bullish momentum has pushed ETH well above its moving averages, and it seems that the next target will be the long-awaited $3,500 price mark. The 50-day moving average, currently near $2,650, followed by the 100-day moving average at $2,414, are key supports that have historically propelled prices higher upon retesting.\n\nAs for resistance, Ethereum is looking to challenge the $3,300 level, having recently broken past it. A sustained move above this level could open the door to $3,500, a psychological and technical barrier that may see some selling pressure. However, the strength of the current trend suggests that this resistance could be tested soon.\n\nEthereum's trend is decisively bullish, with a steep and consistent climb in price. However, the asset appears to be in overheated territory, as indicated by the Relative Strength Index, which is hovering near overbought conditions. There might also be a divergence forming, as the RSI is not confirming the new highs that the price is reaching, which could be an early sign of a potential pullback.\n\nIf the buying pressure maintains its course, Ethereum could comfortably reach and potentially surpass $3,500. This would likely be fueled by continued positive sentiment on the market, advancements in the Ethereum network and increasing adoption of its blockchain.\n\nDogecoin aims at breakthrough\n\nDogecoin is currently at a crucial point that could define its trajectory in the coming weeks. Currently trading at around $0.09152, DOGE has been experiencing an uptick in buying pressure, pushing it toward a key resistance level at $0.092. This level is significant not only because of the psychological round number effect but also because it has served as a strong resistance point in the past. A break above this level could signal strong bullish momentum, potentially leading to yet unseen performance highs for the token.\n\nSupport for DOGE is currently established at $0.08451, which aligns with the 50-day moving average. This moving average has historically provided support during uptrends, offering a bounce back point for prices following retracements. Further support is found at $0.08216, marked by recent lows that have been tested and held firm.\n\nThe trend for DOGE is currently bullish, with the price above both the 50-day and 100-day moving averages, indicating positive sentiment among traders. The moving averages are sloping upward, suggesting that the trend has strength and may continue."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE9pWnktMjc3OGJveXVNVFRHUjlmSDN5SHA1TzdlRWlCTWkwcVpnM1lTSGw0dnJFMWVFd0FtWktWVkxtV1EtQzItUi1NRkNMVC01Q0VIRnpHRGpmSkQ1OHVuSk9CWjcyVm42SXdSeU1SRTA1YS1LMkUtVHVkRWRmQdIBhgFBVV95cUxPSVhDRHNCdmF0ell0UlI1TjlXOFdtbFBsTUlseW85Y2pkMEdEVXBuNEJsa3JuT3JITjJtY0xWR1FYSlg5VTNva25waE92MVFOUEdTQS1CQi1uYm9nUFBUZlVRUVRGM0hHS2tpS2VNemM5M1dyemR6SFA1akRmTlQ0cUtwdkpZUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 27 Feb 2024 08:00:00 GMT",
        "title": "Portal Pre-Market Trading Spikes Ahead of Ethereum Gaming Token Drop - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe pre-market trading price of cross-chain gaming token Portal (PORTAL) has steadily grown in recent days ahead of Thursday’s announced listing on Binance, further validating the substantial demand for the long-awaited launch.\n\nPre-market PORTAL trading on Whales Market has tallied over $5.3 million since last week, with a current price of $2.85 per token. It has gradually climbed since Friday, when the price sat around $2.00 per token.\n\nThe estimated price would put the market cap of PORTAL at about $476 million, based on the initial circulating supply of 167.1 million tokens. If so, it would land in the top 200 cryptocurrencies by market cap, above the newly launched PIXEL token for Ronin farming game Pixels, which has a nearly $426 million market cap as of this writing.\n\nAhead of the token listing, Binance is currently holding a Launchpool campaign that lets customers stake Binance Coin (BNB) or the FDUSD stablecoin into pools that pay out a share of PORTAL staking rewards. A total of 50 million PORTAL tokens are up for grabs through the promotion.\n\nAD\n\nAD\n\nAs of Friday, the Launchpool campaign for Portal had already amassed more than $8.6 billion worth of staked cryptocurrency, setting a new record for Binance’s rewards program. Rising crypto prices in recent days have helped push that tally to $8.8 billion as of this writing.\n\nPortal is a cross-chain gaming platform that aims to connect crypto games across various chains on a single platform with a shared token, single sign-in, and uniform asset management tools. It will be integrated with networks such as Solana and Ethereum scaling network Polygon.\n\nThe Portal team includes leadership and advisors to SuperDuper, the crypto startup behind the Creepz NFT project on Ethereum. Rockstar Games co-founder Jamie King is among the prominent advisors.\n\nPortal held an airdrop farming campaign in November and December that rewarded crypto users for tweeting about Portal and interacting with other users’ tweets about it. While the campaign irritated some Crypto Twitter users, it also drove substantial hype around the token.\n\nAD\n\nAD\n\nThe company told Decrypt’s GG last week that it will share airdrop distribution details ahead of the Binance token listing.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxObER2UmFQbHBaN3hzR3NseFdDVzZ5REdHTk9fVXZsTVpvTE1kOUtEb3dfbzRLSG1QZktJaU45d3Zvd1paN245aWFZMHhycDNmbU1NRkpiNzBDbjRYQzZkVXMtWnlvb2hOcnJSaW1Sckp1S3dpVWd5N2owZVFlU09yYkdhNXRzV011dmc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Feb 2024 08:00:00 GMT",
        "title": "What Will Be My Portfolio If Ethereum (ETH) Price Hits 5K ? - CoinGape",
        "content": "As Ethereum (ETH) enjoys a period of significant growth, many investors are taking notice. Over the past year, its value has doubled, reaching a noteworthy milestone of over $3,000 on February 20, 2024. Now, experts are predicting that Ethereum could potentially reach $5,000 by the end of this year, 2024. With the market buzzing and investors eager to seize opportunities, you might be wondering: What will happen to your investment if you buy Ethereum now, and what kind of returns can you expect if it reaches $5,000? Let’s delve into this exciting scenario.,\n\nEthereum (ETH) Market Performance\n\nAs of February 28, 2024, Ethereum holds a value of $3,256.38, alongside a robust 24-hour trading volume of $21.6 billion, representing a slight decrease of $21.67 within the past 24 hours. Despite this minor setback, Ethereum has seen a 1% price increase over the same period. Retaining its position as the second-largest cryptocurrency, Ethereum boasts a live market capitalization of $390.93 billion, with a circulating supply of 120.15 million ETH according to CoinMarketCap. This demonstrates its significant presence in the digital asset landscape.\n\nadvertisement\n\nAlthough Ethereum reached its peak of $4,891.70 on November 16, 2021, it has since experienced a decline of 33.41% compared to its current price. However, recent trends offer promise, with Ethereum witnessing a notable increase of 9.25% over the last 7 days and an impressive surge of 100% over the past year.\n\nEthereum (ETH) Market Performance chart\n\nEthereum’s price surge is driven by various factors. The anticipation of a spot Ether ETF approval by the SEC, with a 45% likelihood by May 31, has fueled market optimism. The upcoming Dencun upgrade on March 13, introducing EIP-4844 for improved efficiency and scalability, is also a contributing factor. Open Interest in Ethereum futures has reached a record-breaking $11.32 billion, reflecting increased market activity and investor interest. Whale activity, particularly large ETH purchases, suggests confidence in Ethereum’s long-term potential.\n\nAdditionally, the surge in Ethereum restaking protocols, highlighted by EigenLayer’s $100 million funding and TVL increase, signals bullish momentum. Successful airdrops like Starknet (STRK) and Blast’s upcoming token launch further boost investor confidence in Ethereum’s ecosystem.\n\nWhat Will Be My Portfolio if Ethereum (ETH) Price Touches $5,000?\n\nImagine you’ve set aside $300, ready to dip your toes into the world of cryptocurrency. Ethereum gets your attention, priced at $3,256.38 per coin. Now, let’s fast forward to a scenario where Ethereum’s value climbs to $5000. What could this journey look like for your investment?\n\nStarting with your initial $300, you’d acquire approximately 0.092 ETH at Ethereum’s current price. If Ethereum reaches $5000, your investment would appreciate to $460. That’s a respectable profit of $160, translating to a solid Return on Investment (ROI) of around 53.33%.\n\nNow, what if you decide to scale up your investment? Doubling your initial stake to $1000, you’d secure roughly 0.307 ETH. If Ethereum hits $5000, your investment would grow to $1,535, resulting in a profit of $535 and an ROI of approximately 53.50%.\n\nAnd for those willing to commit $2000, you’d acquire about 0.614 ETH. Should Ethereum reach $5000, your investment would soar to $3,070, netting a profit of $1070, again with an ROI of 53.50%.\n\nWhether you’re starting small with $300 or venturing into larger sums, Ethereum presents an intriguing investment opportunity. So, as you weigh your options, remember: that Ethereum’s potential could offer a compelling path forward in the world of digital assets.\n\nEthereum Forecast : Will Ethereum (ETH) Hit $5,000?\n\nEthereum price is showing strong performance, currently hovering around $3,256. The steady price rise has surpassed its usual levels, with analysts suggesting a potential climb to $3,500 soon. Ethereum is now eyeing the $3,300 resistance level, recently breaking through it. If the price manages to surpass $3,500, it could face some selling pressure as this marks a significant psychological and technical barrier. The current bullish trend in Ethereum’s price is evident, with a consistent rise of around 1% in the past day.\n\nLooking ahead, some analysts predict that by the end of 2024, Ethereum could touch $5,000. BitMEX founder Arthur Hayes recently divested his Solana holdings in favor of Ethereum, foreseeing a surge that could propel the cryptocurrency to $5,000.\n\nThis optimism is further fueled by upcoming events such as the Dencun upgrade and the potential approval of an Ethereum spot ETF by the SEC, both of which are expected to bolster ETH’s value. Additionally, the Bitcoin Halving scheduled for April 2024 could also contribute to Ethereum’s growth trajectory. If Ethereum maintains its current momentum, it has the potential to surpass its previous all-time high."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxNRmdzVHFXNXJyLUt6c1UtcVo2OXJxTzNPSlBERUdsOWpERkZQUkl2QzVldHlic3Q1MDJKTEJmSnozZHBkczJ2c04wTURZVkVMVENyakM5LTlJN0xobE5PTWg0YW9GUGZIUGVLT0tBTnRjVU1CN3JsOWNZVldnRW1WeXRmeC1oOERsZWhoSDVJVklvUHRESUp4V19ETEJEYW5IUGpGM2dMMzJhUWdacUMtSGFobnRRWnlqZ3hEUVJzQ3FFM2pIaFZTcVFHTEFONFI2V04xbmNxONIB3AFBVV95cUxOV2RsSWZLbWdPM0dGOVpoWTU3bUVEcFNTNEYwWFlmM3FEUG5DS0NuVU5jeWVmUWtreHpZUHFmYTEzSExXdnlUQUlLUE94SU84TkdjbGlCSzhEbTV5NG53OXUyeFc1UjBFVmJWVERwMUVBd2M4cVZLR3RDb1BBNDVBMXpHUjVoNkp2Y0RoY1dOek54TXd6aThIWU5XTy0yRHRIU092eVpfOWQ0X2lwTmxOLTdIbzgxWnY1QnUzYV9RVm4zUGVrcXRzUDRCbDVzb29hXzJSdTI4V2IyRmc1?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 27 Feb 2024 08:00:00 GMT",
        "title": "Macro Investor Raoul Pal Details ‘Absolute Stunner’ Chart Signaling Potential Next Big Move for Ethereum (ETH) - The Daily Hodl",
        "content": "Former Goldman Sachs executive Raoul Pal believes Ethereum (ETH) is gearing up for a massive breakout against Bitcoin (BTC).\n\nPal says on the social media platform X that the Ethereum versus Bitcoin ratio (ETH/BTC) is on the verge of breaking above the diagonal resistance of a massive wedge on the weekly chart.\n\n“The ETH/BTC chart is an absolute stunner and ready for the next big move: the break of the mega wedge. Let’s see how it pans out.”\n\nLooking at his chart, the trader suggests that ETH/BTC has already broken out of a descending channel, indicating an imminent bullish trend reversal. His chart also suggests that ETH/BTC may break out of a years-long falling wedge pattern.\n\nETH/BTC is trading for 0.0573 BTC ($3,241) at time of writing, down 1.58% in the past 24 hours.\n\nOther analysts are also turning bullish on Ethereum.\n\nThe founders of analytics platform Glassnode, Jan Happel and Yann Allemann, recently said that ETH/BTC made a sudden move to the upside, indicating that ETH itself and other altcoins are about to soar.\n\n“When ETH/BTC rallies, altcoins rally. And we have just broken higher after a long consolidation since late 2021.”\n\nCEO and founder of Morgan Creek Capital Mark Yusko believes that Ethereum could reach the $15,000 level if Bitcoin hits $150,000.\n\nSaid Yusko,\n\n“I probably have no reason to go against what has existed for a long time which is the ratio between Bitcoin and Ethereum. It used to be almost exactly 10-to-1…\n\nSo let’s say Bitcoin gets to $150,000… let’s say it gets all the way back to 10-to-1. Then that would be [an Ethereum price of] $15,000. So, comfortably somewhere between $10,000 and $15,000.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxQR1J3VlpKVE4tNHNIWllBWEh2anRrU1BXV1E2S2RHQTFab25MNjB0WE42RTNBRURXSF9HWDhZZG53eVRmdGFaY2UxMEQ3U29CWGhELXNfT0hvTnlJRnNWUGJRcHR4QUNTSlJuR0RNbWs2dHk5MGVEbTJoczFWbUotQlkyNDdqX3B30gGOAUFVX3lxTE1ic09ZbUgtdjdiOUlGY2xVME50LXF4UkNROXhVbU1rV1lWRXVpOTNnc05aOXNjYnhIbmhUUHp0Q0c5ZlcwUXZoLWRmeDZZelBqSU5sLU54eEFtbjQybEk2LTJfZmRmRDh6dGVXeG5JZ2dXUFlqZ0h4XzBVcVhXaFJjemlKSlZnMGJsWU9icmc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 27 Feb 2024 08:00:00 GMT",
        "title": "Ethereum (ETH) Price Up 5% As Layer-2 DeFi TVL Hits $30 Billion - CoinGape",
        "content": "With Bitcoin leading the broader market rally, Ethereum (ETH) too joined the party with an additional 5% gain on Monday. As of press time, the Ethereum price is up 4.34% trading at $3,230 and a market cap of $387 billion.\n\nEthereum Layer 2 TVL Nears $30 Billion Milestone\n\nEthereum’s Layer 2 (L2) ecosystem is experiencing a surge in Total Value Locked (TVL), nearing the significant milestone of $30 billion as cryptocurrency prices climb.\n\nadvertisement\n\nData from L2Beat reveals a notable uptick in Ethereum L2 TVL, which has surged by over 9% in the past week, reaching a new high of $29.42 billion. Of this total, Arbitrum constitutes the largest share at 45%, with a TVL of $13.26 billion. Other notable contributors include OP Mainnet with $7.57 billion, Manta Pacific with $1.89 billion, and StarkNet with $1.36 billion.\n\nThe substantial growth in Ethereum L2 TVL underscores the increasing adoption and utilization of Layer 2 solutions, highlighting their importance in scaling Ethereum’s network and mitigating congestion and high gas fees. The recent rally in L2 DeFi tokens is due to the optimism surrounding the upcoming Dencun upgrade with the EIP-4844 proposal to help significantly reduce the gas fee.\n\nEther Exchange Supply At Just 11%\n\nDespite the spot Bitcoin ETFs continuing to see massive inflows, some market researchers continue to lean towards Ether due to the anticipated advancements in the upcoming Dencun upgrade.\n\nBernstein researchers Gautam Chhugani and Mahika Sapra highlighted the growth of Ethereum’s DeFi ecosystem and layer-2 networks as crucial factors strengthening ETH’s market resilience compared to Bitcoin.\n\nBernstein also underscores the significance of the amount of ether being locked up, highlighting that ETH held on exchanges has reached a record low of 11%. This trend indicates a growing tendency to lock up more of the cryptocurrency.\n\nMeanwhile, Ether (ETH), ranked as the second-largest cryptocurrency globally, has exhibited a noteworthy 33% increase year-to-date, surpassing its larger counterpart, Bitcoin (BTC). This surge is attributed to various catalysts beyond the anticipated approval of a spot exchange-traded fund (ETF).\n\nETH Price Action\n\nETH maintained its position comfortably above the 50-day and 200-day Exponential Moving Averages (EMAs), indicating bullish signals for its price trajectory.\n\nShould ETH surpass the Tuesday morning high of $3,276, it could pave the way for further upward momentum toward the $3,500 mark. Conversely, a drop in ETH below the critical support level of $3,200 could bring the $3,000 mark into focus.\n\nThe 14-period Daily Relative Strength Index (RSI) registering at 81.79 signals ETH’s entry into overbought territory. Consequently, heightened selling pressure might emerge around the Tuesday morning high of $3,276.\n\nBhushan Akolkar Bhushan is a FinTech enthusiast with a keen understanding of financial markets. His interest in economics and finance has led him to focus on emerging Blockchain technology and cryptocurrency markets. He is committed to continuous learning and stays motivated by sharing the knowledge he acquires. In his free time, Bhushan enjoys reading thriller fiction novels and occasionally explores his culinary skills.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiygFBVV95cUxQcDQ2em4tZ09EdVBpQVFsNmFHaUpOX1lYYVZIRjZncjJfZEY3ZERpWHcxN2FtMUtuMk02VEl4Qmt6M2ZuVnVDUmlEQkhJek84U2dfWndHb2FxcGt6ellXd1prVnpPVy02T3UwV2pQZXl1V3pPZ1pMY210SE40RGxBQ3dTcV9OZHNTS3ZDSXIyYkRpVFNyOHJNMU0zdzk0M1JBbjl0UUs2cVVmcU9jSmVaVURSclBzM1BTUXZiYmdNSGxiWE9BdVdVRnN3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 27 Feb 2024 08:00:00 GMT",
        "title": "Unstoppable growth in Ethereum’s liquid staking: the dApp surpasses 30 billion dollars in TVL - The Cryptonomist",
        "content": "Lido Finance, the most famous Ethereum dapp and undisputed leader in the liquid staking sector, yesterday surpassed the $30 billion threshold in Total Value Locked (TVL).\n\nThis metric indicates the overall value of assets locked within a dapp or a chain, and studying its trend can be useful to see where capital is moving within the web3 world.\n\nThe growth of Lido scares Ethereum supporters, who see a potential risk of centralization of the network consensus: however, the new trend of restaking could limit Lido’s absolute dominance by creating a broader and more decentralized market.\n\nAll the details below.\n\nEthereum dApp: Lido surpasses $30 billion in TVL and expands the liquid staking sector\n\nThe liquid staking sector seems to continue unabated growth, with Ethereum’s flagship dapp, Lido Finance, setting another record and surpassing 30 billion dollars in Total Value Locked (TVL).\n\nAccording to the on-chain research company The Block, on February 26th Lido reached a locked capital value never achieved before by any existing dapp, closing the day at 30.66 billion dollars.\n\nToday, thanks to the latest rally in the price of ETH, the protocol records a TVL of 31.7 billion dollars.\n\nFrom July 2022 onwards, following the great depression created by the collapse of the stablecoin UST and the Terra Luna project, Lido has recorded a steady growth in the adoption of liquid staking, gradually expanding its presence in the crypto market\n\nHowever, after the Shapella update of the Ethereum blockchain, which enabled withdrawals of ether previously staked on the Beacon Chain, the upward trend in Lido’s TVL has seen a substantial acceleration\n\nFrom May 2023 to today, in about 10 months, approximately $19.3 billion in value has been added\n\nLido has become so popular among Ethereum dapps, representing alone 63% of all funds locked on it, ahead of the historic MakerDAO protocol that controls 17.8% of the market share. MakerDAO\n\nEven within the niche of liquid staking, Lido holds a position of relevance, as it is well above the second decentralized application in this ranking, Rocket Pool, which currently has a TVL of 3.8 billion dollars.\n\nBy now this protocol, celebrated as an institution in the context of decentralized finance, has become the largest validator on the proof-of-stake Ethereum blockchain, controlling 32% of the ether in staking.\n\nAnyway, although it represents a single entity, Lido in turn controls 36 different operators that run nodes and manage the delicate phase of block production within the world’s most famous smart contract blockchain.\n\nRestaking as a new solution to counter the risks of centralization of Lido\n\nAs Lido becomes increasingly important as a reference dapp in the liquid staking sector of Ethereum, concerns within the community are also growing in the face of evident risks of centralization of the consensus market.\n\nAlready in August 2023 among the main providers of liquid staking solutions, such as Rocket Pool, Stader Lads, Diva Staking and Puffer Finance, there was talk of joining forces and making a pact that unequivocally established that none of them could ever control more than 22% of the market.\n\nAlthough this coalition has gone down in history as one of the first occasions in which a group of dapps set a hard cap for their TVL, Lido has continued to grow without paying too much attention to its competitors.\n\nIn June of the same year, at Lido’s house, this “issue” was discussed, leading to the polls among participants in the governance of the project to establish whether to introduce threshold limits to the protocol’s power: the result is that 99.81% of LDO token holders (those with voting power) voted against imposing any limits.\n\nIt will certainly not be collective common sense that can change the cards on the table, now that the protocol is reaching giant dimensions and there are several billion dollars at stake.\n\nAnyway, there is a new trend that could limit the uncontrolled expansion of Lido: we are talking about restaking, which is the practice of reusing the consent offered by Ethereum with previously locked ether.\n\nPlatforms like Eigenlayer, a top-tier dapp for the restaking sector, are attracting a significant amount of capital, contributing to the decentralization of network sequencers and therefore also to the overall decentralization of Ethereum.\n\nAs of today Eigenlayer controls a TVL of 8.81 billion dollars, ranking as the 3rd dapp by locked value behind Maker and Lido, and actually represents the only piece of the web3 world capable of creating the conditions for a real slowdown of Lido’s power.\n\nWith several options on the table to restake with this protocol, and the need to find the highest yield or farm airdrops as much as possible, Lido no longer serves as the only solution on the market but integrates with the rest of the emerging protocols, which are gradually diversifying and decentralizing the various network operators."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQYUltc01SM2VZVmZoaTZJVFdDOVRFTWJSbVBMNlpBellkYzlDbmxQa0o1Q1RYMXZ5bUZiTWJrSFBFUmxJT3BXazJxUW1McHVGdjk2bkRLY0YxQ211aVNIMTZKWWhoenFUbmZvcnAxNjJJTFlOY2EzX2hCQnBSWXZHX3Q5SkZCTWotaDVtcDZaZUc0NUxxYjVrRNIBoAFBVV95cUxPUjgtNFpmTVExdWFYMWtOb29fS3oxVjZnbERfYmZLSC01Z3gwRndzT3hFNzRRbS16S2sxV3Q3NVBCNUlxOGtPYWR5UnNma19BRnFEd2tEV1JOdU8zYXQ3RVEtTTgxQ0c3VC1qVmJ5R0ZkYllxYm5QRG80dGJZejM2OWFtZFNlQTBXSEhCVlV6YUY3bVA4dGlOQy02STVYZnpo?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 27 Feb 2024 08:00:00 GMT",
        "title": "Blast: Ethereum’s L2 with Native Yield a New Dawn for NFTs - NFT Culture",
        "content": "In the ever-evolving landscape of blockchain and NFTs, a groundbreaking development has emerged that promises to redefine the norms of Ethereum’s Layer 2 (L2) solutions. Enter Blast, an innovative L2 network that stands out as the first of its kind to offer native yield for both ETH and stablecoins directly on the platform. This feature is a game-changer in the realm of digital finance, setting a new standard for the Ethereum ecosystem.\n\nA Leap into the Future with Native Yields\n\nBlast differentiates itself by harnessing the power of ETH staking and Real-World Asset (RWA) protocols to generate yield. This yield, unlike the default 0% interest rate on other L2s, is a robust 4% for ETH and an even more impressive 5% for stablecoins. This mechanism ensures that Blast users automatically receive the benefits of these yields, marking a significant advancement in the way L2 solutions operate.\n\nIntroducing Blast: The only Ethereum L2 with native yield for ETH and stablecoins. We’ve raised $20m from @Paradigm and @StandardCrypto to build the L2 that helps you earn more. Details on how to get early access at the end of the thread👇 pic.twitter.com/AYYmK8YFx4 — Blast (@Blast_L2) November 20, 2023\n\nRationale Behind Blast: Bridging the Yield Gap\n\nThe inception of Blast is a direct response to a critical observation post-Ethereum merge: the necessity for L2 solutions to integrate native yield for ETH and stablecoins. Traditional L2s lack this feature, creating a gap where users potentially lose out to inflation. Blast, designed from the ground up as an EVM-compatible, optimistic rollup, not only fills this gap but also elevates the baseline yield for both users and developers, without compromising the cryptonative experience.\n\nInnovations Powering Blast\n\nBlast introduces several groundbreaking features that distinguish it from other L2 networks:\n\nAuto Rebasing : Blast features native rebasing for ETH and its own stablecoin, USDB, ensuring that balances automatically adjust to reflect accrued yield.\n\n: Blast features native rebasing for ETH and its own stablecoin, USDB, ensuring that balances automatically adjust to reflect accrued yield. L1 Staking Integration : Thanks to Ethereum’s Shanghai upgrade, Blast can directly transfer L1 staking yields to users, with future plans to diversify beyond initial protocols like Lido.\n\n: Thanks to Ethereum’s Shanghai upgrade, Blast can directly transfer L1 staking yields to users, with future plans to diversify beyond initial protocols like Lido. T-Bill Yield for Stablecoins : USDB yield is sourced from MakerDAO’s T-Bill protocol, with options for future community-driven protocol selections.\n\n: USDB yield is sourced from MakerDAO’s T-Bill protocol, with options for future community-driven protocol selections. Gas Revenue Sharing: In a move away from the norm, Blast returns net gas revenue to Dapps, allowing developers to either retain this revenue or subsidize user fees.\n\nBlast and Blur: A Synergistic NFT Ecosystem\n\nThe narrative of Blast is intertwined with Blur, an NFT marketplace, through their shared founder, Tieshun Roquerre (aka Pacman). The recent $20 million funding round led by Paradigm, alongside significant contributions from other investors, underscores the ambition behind Blast: to address high transaction costs and introduce innovative trading instruments in the NFT space. This support is further bolstered by an impressive $81 million in assets already deposited on Blast, signifying strong market confidence.\n\nThe collaboration between Blast and Blur exemplifies a strategic alliance aimed at enhancing the NFT ecosystem. With plans to deploy L2 apps, including NFT perps on Blast, Blur is set to leverage Blast’s technological advancements to foster a more vibrant and efficient market.\n\nTL;DR\n\nBlast emerges as a pioneering Ethereum L2 network offering native yield for ETH and stablecoins, revolutionizing the digital finance landscape. With features like auto rebasing, L1 staking integration, and gas revenue sharing, Blast sets a new benchmark for L2 solutions. The synergy between Blast and Blur heralds a promising era for the NFT market, underscored by significant funding and market confidence."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxQRW81SlBVUE9aVERiRzlfckFwS25aWktzM3UtRk4yV3VJZUNqOVJ6Y0QxaUdzcUxfRWZ3TkNZN25PTE9VcDAwbzM3SHFpaFZERHpDVFdOcG1YaUl2S0lQZVM4WWgtT3V0WlV2bWtDVTNmaVF2eUIwTS10MDJFY2o2SnJWelc3aFRQMDU4YlZBVzZLdUVnZmVoaUlvaDUzZUtL0gGmAUFVX3lxTE9FS08yeDBzZU9qY1Q1OUVSdW91NVZWcWpDSi1RQV80d2JaNG1VY1dyZUpqb09heFAwTlhYYmVsU0VycFljQmk3aWxKOFlwZjFWZE1adXVWUy1rZkczRUdZLXo5ZXZQbWtvWHVEYnVUQVFUSjdTUWVfa2Y4bElhMkNpdnJWNWo2T05JQnN5dFMtcXhJdkZ0RWl6NnBLM0VOTkFRN2FGWmc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 27 Feb 2024 08:00:00 GMT",
        "title": "Ethereum ICO Investor Ignites Massive Coinbase Dump As ETH Price Soars To $3200 - CoinGape",
        "content": "Ethereum (ETH), the second-largest crypto, has grabbed the spotlight after it soared past $3,200 yesterday. However, the rally has led to an increased selling pressure since long investors are trying to realize their profits. Amid the price jump and sell-offs, an Ethereum ICO participant, dormant for 8.6 years, resurfaced.\n\nEthereum ICO Investor Dumps ETH Reserve\n\nAccording to data from Lookonchain, an onchain data tracking platform, the dormant Ethereum ICO investor deposited 238.75 ETH, worth $770,000 to Coinbase, a popular crypto exchange. The investor acquired the ETH reserves at Ethereum Genesis for $0.31 per ETH, marking a whopping 10,980,000% profit. The dump of Ethereum reserves on Coinbase could be a significant catalyst in impacting the prices if the whale decides to sell the entire reserve.\n\nadvertisement\n\nSuch dormant Ethereum whales generally resurface whenever the ETH price surges, hence, the update doesn’t come as a surprise. Last week, an early investor in Ethereum, who had been inactive for nearly a decade, transferred 1,732 ETH, equivalent to $5.15 million at the time, to the cryptocurrency exchange Kraken. This move coincided with the Ethereum price surpassing the $3,000 mark.\n\nThe investor had originally purchased their ETH during the ICO period at a price of $0.31, similar to that of the dormant whale who became active today. Moreover, the Ethereum ICO investor got his hands on a potential return of 10,000 times their initial investment if sold above $3,000.\n\nCurrently, there is still 1,733 ETH remaining in their wallet, valued at over $5 million. While it remains uncertain whether they sold the reserves or not, transferring funds to Kraken suggests they were considering the possibility.\n\nAlso Read: Ethereum (ETH) Price Up 5% As Layer-2 DeFi TVL Hits $30 Billion\n\nETH Price Today\n\nThe Ethereum price soared 6.11% to $3,246.33 at the time of writing on Tuesday, February 27. The crypto held a market cap of $389.80 million. Moreover, the 24-hour trading volume for Ethereum spiked by 60.94% to $22.14 billion. The recent rally could have been spurred by the overall optimism in the market owing to the rise in Bitcoin funding.\n\nAccording to Coinglass, the ETH open interest gained by 1.50% to $11.33 billion. While long investors increased the sell pressure, short traders braced for a short squeeze. Ethereum witnessed $66.87 million total liquidations of which $45.66 million accounted for short liquidations. Since the ETH price shot up unprecedentedly, these traders would liquidate and buy their positions back to minimize losses.\n\nThe increased purchasing pressure could propel the ETH price even higher. However, in case of a bearish turn, these short traders would start dumping their holdings, further catalyzing the downfall. Hence, extreme volatility could ensue in the coming days.\n\nAlso Read: KyberSwap Attack Update: $2.5M in Ether Transferred to Ethereum Network\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxNNE5UbXBvdldaMUtZR3FYd2c4N0Y2cmE4bWRKOEhMZDU3TDFLbVlKalJuSXNpNHZPSzlvRDZYZmlkWV9BSGU0NXJQZzVZUGQ1MXF5c212ZnVxdHRaVE9xa3gwN0RpX256RXI2V3VZNW5qcEoxMEgtVWxfTkhIVFJGOWpQY1hMNmF0aHlQV2l6MNIBlAFBVV95cUxPVWpfMUdLclhCRUVwWVBQOFhPUjBRVWQ3b3Bfb0tzaXUzZXo0VHJJX2dlaTFXQ084NEFmTWd6WkxTY2pLTTRNYjU2cHdocldUNFpENUdrRUMycUFkX2ZKeWhWZVVGTTJhZExUdzdoTXVWLU12UTNoSmludWkzeENSakFLckNmeV83SEVSZVkydUM1UXcy?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 27 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Layer-2 Adoption Surge Pushes TVL Close to $30 Billion: Details - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nIn an unprecedented surge of adoption, Ethereum's layer-2 solutions are witnessing a significant uptick, pushing the total value locked (TVL) close to the $30 billion threshold. Recent data from L2Beat indicates substantial growth in Ethereum L2 TVL, now standing at $29.60 billion, marking an increase of over 12.08% in the past week alone.\n\nAdvertisement\n\nThis remarkable growth trajectory underscores the accelerating usage of layer-2 platforms, with Arbitrum and Optimism leading the charge in scaling Ethereum's capacity for decentralized applications (dApps). Arbitrum, a prominent player in the layer-2 space, now accounts for a staggering 45.18% of the total L2 TVL, amounting to $13.37 billion.\n\nFollowing closely is OP Mainnet, with a TVL of $7.56 billion, demonstrating the growing confidence and reliance of the crypto community on these scaling solutions. Other notable platforms contributing to the surge include Manta Pacific and Starknet, with TVLs of $1.89 billion and $1.39 billion, respectively.\n\nEthereum's Dencun upgrade\n\nThe momentum behind this surge is partly attributed to the heightened anticipation surrounding Ethereum's forthcoming Dencun upgrade . This significant update is expected to introduce major gas fee reductions, alongside greater storage efficiency and an enhanced experience for developers. By addressing the long-standing issue of high transaction fees on Ethereum, the Dencun upgrade is set to make rollups even more cost efficient, thereby incentivizing greater adoption.\n\nAs layer-2 solutions continue to evolve, they offer a promising avenue for scaling Ethereum's network, allowing for higher transaction throughput and lower fees. This not only benefits developers by providing a more efficient environment for building and deploying dApps but also enhances the user experience by making transactions faster and more affordable.\n\nThe adoption of Ethereum layer-2 solutions is a critical step toward resolving the network's scalability challenges. As the ecosystem continues to mature, the integration of these solutions is expected to drive further innovation and growth within the DeFi sector. With the TVL nearing the $30 billion mark, the Ethereum community remains optimistic about the potential of layer-2 platforms to revolutionize the blockchain space."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxOUGVfV0Q5MXNUd3lsRXpGTXViVG1URDR5b3dzWm1LeGZGX3lUTkVuUzl3QzB4TDJsaEtpbS1Qa0tQZkQ4UW1EUk5zM194b0V3WFhwR3JGMGxJaFNGc1JXVEQ4eUUxX3JxUXVNazRQdzBZcTR5YXNGUzVZajFBWE0zam5WNUVaMXhpYkRnbUdNSGJBOFYxS0syVTJhTWx5dkFDazNHNnpFdnpNeGVJRU9DUEt2aC1WX1RJYl9yLWZLRWV4MTJnS3Bv0gHMAUFVX3lxTE1JRGdLU0MtakxoN3EtYUFyUm1KWmNoelZ0UFc1dWhDcDdHLTQ5Q3JzNzF5cllDdHRZcWU2NDJWZTNINk4yT1EtSGtwaDdmNTdHY25GMm14Q2VMX2d2YVBaVTBhVGJiLTlkNG11Wk1wVkRGbjhMSlJDaHNhS0s1OEEtLXBJc09WazRZc2tXTXU0S3BYd1NELVdyTnFoem84T0FsbGhxclloZU1tT1NmeHl1cEV4QVJrRkdJM0pXTld6QXlhWWdPakU4dXpFUg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 27 Feb 2024 08:00:00 GMT",
        "title": "Analyst Says XRP and One Ethereum Rival Flashing Bullish Signal, Updates Outlook on Bitcoin (BTC) - The Daily Hodl",
        "content": "A closely followed crypto strategist says XRP and one additional altcoin are giving off a bullish reading that could lead to a move to the upside.\n\nPseudonymous analyst Ali Martinez tells his 47,900 followers on the social media platform X that XRP looks bullish based on the Tom DeMark (TD) Sequential indicator.\n\nThe TD Sequential indicator is typically used to identify trend direction and potential price reversals.\n\nSays Martinez,\n\n“The TD Sequential indicator has issued a buy signal on the XRP weekly chart, indicating potential bullish momentum. If XRP manages a sustained weekly close above $0.57, it could be the catalyst for a push toward $0.63 or even higher, reaching $0.65.”\n\nAt time of writing, XRP is worth $0.55.\n\nAnother altcoin that’s flashing a bullish signal based on the TD Sequential indicator is the Ethereum (ETH) rival Solana (SOL), according to Martinez.\n\n“The TD Sequential indicator presents a buy signal on the Solana daily chart, suggesting a potential upswing that could span one to four daily candlesticks for SOL.”\n\nAt time of writing, SOL is worth $110.58, up over 7% in the past day.\n\nAs for Bitcoin (BTC), Martinez says the crypto king may be en route to rallying above $60,000 after breaking out of a bullish megaphone pattern.\n\n“Bitcoin shows a megaphone pattern on its daily chart. If BTC maintains its position above $50,000, achieving a sustained close above $53,000 could be the catalyst for a rally toward $60,520!”\n\nAt time of writing, Bitcoin is trading at $56,359, up over 9% in the past day.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxOamVCMWdtaTQ3ZXZxU1JrMzhqTVJ4WHM5MHZRV21nekE2cGJJX1pNNnFZb05SazQ5c3dMbFp3WkxrTVJSQ1NjbGd2MzQ0WHZnZDRMNEUyd1hiVGg0Qkt0OWJjSzZQZzF4TkF5SzdVY0x0QldnVm16YktMcE44X242QWgtWUdsRExWLW9sVjM4Rkg3UXc1LTdOV2dfTF9CbzRKVEdLZDQ4SUw5Mm9QcjNINFFDOEZzWEJEYXlhMXNRRk94b0xITl9OdU1qWWfSAdIBQVVfeXFMT0JhR2t3UUpQTmZZM0JkS2E3VW50el9nZVgyZVdQNGtvWk1oN1ZnVDJ6ckdBOEZxdURDTWdiVTV6ZnZBY2VSVlN1bTJYMldMM1c5bmhCSjZtczFjZUZFb2xlQWVIV215Q0QxUEFTWW5zR1NiSzhZRi1BUDJwUXp2R3lZWTVSMjZqSlBLanphVmJMbHpMcWwyR2NPRUh6d0N6WS1HUjh2QS0xVkl2cElaMEcwRTlNekxhaW5nNGZxck83eVlUOTRIdUlnb0pRVUNiUVRB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Feb 2024 08:00:00 GMT",
        "title": "Here’s the Upside Potential for Solana (SOL) in the Coming Crypto Bull Run, According to InvestAnswers - The Daily Hodl",
        "content": "A popular crypto analyst is laying out the potential upside for Ethereum (ETH) competitor Solana (SOL).\n\nIn a new YouTube video, the anonymous host of InvestAnswers notes to his 478,000 subscribers that Solana hit 20% of Ethereum’s market cap in December but has been outperformed by the second-largest crypto asset in the months since then.\n\nThe InvestAnswers host says that if Solana returns to that 20% level, that would mean a SOL price of around $171, based on what ETH’s currently trading for.\n\n“If we go to one-third of the market cap of Ethereum, that’s $277. If we go to half of Ethereum, that’s $421, and if we go to 70% of Ethereum – $585. A lot of people talk about it becoming parity, but I’m not going to go there, because ETH is still a big machine, a big monster. And remember, we’ve been at some of these levels before in the past, and we can probably go to them again.\n\nBut the other good news is, as the value of Ethereum rises, technically Solana will rise too. But there’s a lag in between — so the future’s very bright.”\n\nSOL is trading at $108.62 at time of writing. The fifth-ranked digital asset by market cap hasn’t experienced the 2024 gains that most of the crypto market has and is priced at roughly the same point it was at the start of the year.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxNS1RRNS1UdXA4Zm4zSURWVm5xcHlXZENrZnpfTG9MSG1wdmpmNHh6TndybVZQbUJRNklQUlV1a0picmZtbml5X3Voc2lNcHhHYVJsaU9nRDZnb1NzX3RTTkZwZktRV2JHN1lma2JVMzZyaVdvdXJMMFBqVDN5SHFoaGg0c1B1dmlfMnFUWXMzb2JFOEg3c3h2UVF1dkNKbFZHS0w3TNIBqgFBVV95cUxOd1pOUE9QX2d6a2xCcW04WjRaT0txWnV3b2x4UVd2SFRySG9ISGtsWDE2YkxxS2tGM0EzTGZJcnEtaGpPZ18zREtncWJISkxDVWphdW1ieUhmZmNUSmFwemR4c3JPY1lBcUdiSlFReW9mcXJJNklJQ3hIRVZha1BwTlp0T0J2TmFrMW5Tak9nSmxyQkFjOW50M09FZUV0R0xPY3hzREZnREJPdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Feb 2024 08:00:00 GMT",
        "title": "Bitcoin, Ethereum Tag New 2024 Highs But These 3 Altcoin Gems Could Hit $1000 - CoinGape",
        "content": "Bitcoin price continued with its bullish streak closing February with a 45% increase from the monthly open. The largest crypto ascended to $64,000 before high volatility caused a sharp but brief sell-off to $60,000. Ethereum also doubled down on its bullish efforts, rising above $3,500. As the largest cryptos breakout, investors may want to consider 3 altcoin gems could hit $1000 in 2024, including Binance Coin (BNB), Bitcoin Cash (BCH), and Bittensor (TAO).\n\nAs the Bitcoin halving approaches, a pivotal moment anticipated to kickstart a new bull market in April 2024, cryptocurrency enthusiasts are looking for lucrative alternatives. BNB, BCH, and TAO are three such altcoins expected to soar to $1,000 before the halving, presenting themselves as attractive investment avenues in the lead-up to this crucial event.\n\nadvertisement\n\nBinance Coin (BNB)\n\nBinance Coin (BNB), the proprietary token of the Binance ecosystem, operates on both the Binance Chain (BEP-2) and the Binance Smart Chain (BEP-20), serving as the cornerstone of these platforms. Its dominance stems from the substantial trading volumes seen on Binance, coupled with its crucial role across the exchange’s dual blockchain infrastructure.\n\nNotably, the BNB Chain stands out as the primary blockchain, facilitating a wide array of decentralized applications that rank among the top in the market.\n\nRecently, Coinbase made headlines by broadening the scope of its asset recovery tool to encompass the BNB Chain and Polygon networks. This development has notably contributed to a bullish Bitcoin market value trend.\n\nAs of the latest updates, BNB has successfully breached the $400 resistance barrier, showcasing a commendable performance. Currently, the token is priced at $414, reflecting an impressive increase exceeding 4% in its market value.\n\nBitcoin Cash (BCH)\n\nBitcoin Cash (BCH), designed to function as a peer-to-peer digital currency, envisions itself as a robust global currency facilitating swift transactions, nominal fees, enhanced privacy, and expanded block sizes. Born as an alternative to Bitcoin, the original and most esteemed cryptocurrency, BCH has climbed its way into the top 20 digital currencies, solidifying its position as a leading Bitcoin fork.\n\nThe value of BCH has recently broken through the $300 resistance mark, signaling a strong bullish trend. Presently, BNB stands at $303, exhibiting a growth of 1.29% in the past 24 hours and an impressive 16.88% over the last week, cumulating a monthly increase of 24%. Predictions suggest BCH could soar to the $1000 milestone as the Bitcoin halving event approaches.\n\nBittensor (TAO)\n\nBittensor (TAO), an innovative open-source protocol, underpins a decentralized network for machine learning on the blockchain. This network enables collaborative training of machine learning models, rewarding them with TAO tokens based on their contribution’s informational value.\n\nThe overarching aim of Bittensor is to establish a genuine marketplace for artificial intelligence, where both creators and consumers of AI can engage freely, supported by a trustless, transparent, and open framework.\n\nRecent trends on the price chart indicate a consistent upward trajectory, marked by successive higher highs and lows. Bittensor has broken through the upper edge of its ascending channel, hinting at a potential resistance challenge. At the time of writing, the price of Bittensor surged past the $600 mark, now trading at $616, signaling robust bullish momentum.\n\nBottom Line\n\nIn conclusion, the impending Bitcoin halving catalyzes market movements, historically marking the onset of a bull market. Investors are diversifying their portfolios with promising altcoins like BNB, BCH, and TAO, all poised for significant gains, potentially reaching $1,000 before the halving event in April 2024.\n\nRelated Articles\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMi6wFBVV95cUxPcUc3eGk4NWxSVmlmVWs3eGtBNGYwV25CVHhEU1pvMUszMjRyazB1blVhaG1wdmZIUktZZXJBSmYxcTlLNVBPMHdRMkJVZ2JnSVR0S0ZDNkhiR1Vpdm4yTG5tVE9FM2JZODhHNFVwU1VkNVRCQnc0MW1aSlZMemt5WlJMN3pMdjNZS3ZZVXk5cGlBT2U4WEViVGNQZ1h1UEVQVlBRSjBUMTNpanRLeVNMZ0ZLYzVCak9PME1SbnpvNlVuaS1WSnZKOWlOVW13Z1E1ZC11M1FtQnVwYnMzSHo1NFA5ckRFMTlYMFdV?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Feb 2024 08:00:00 GMT",
        "title": "BingX Launches Ethereum Layer 2, Bitcoin Layer 2, and Web3 Game Token Airdrop Guide for 2024 - Media OutReach",
        "content": "The issuer is solely responsible for the content of this announcement.\n\nSINGAPORE - Media OutReach Newswire - 28 February 2024 - BingX QA, known for its innovative approach to cryptocurrency research, has unveiled the 2024 Airdrop Guide featuring Ethereum Layer 2, Bitcoin Layer 2, and Web3 Game tokens.In 2023, BingX QA released Airdrop Guides for tokens such as Starknet and Arbitrum, providing users with valuable insights into airdrop opportunities. Following these guidelines, numerous users participated in the Starknet airdrop in February 2024 and received a minimum of $1000 worth of STRK tokens. In response to inquiries from users eager for more airdrop opportunities, BingX QA intensified its exploration and research efforts.The latest Airdrop Guide includes promising projects such as Ethereum Layer 2 Blast, Bitcoin Layer 2, Celestia, Ronin Network , and the ERC404 protocol.Blast, developed by the NFT trading market Blur, is an Layer 2 public chain where users can receive airdrops by staking ETH.The development of Bitcoin Layer 2 has been a hot topic, with the recent Merlin coin airdrop requiring staking of Bitcoin ecosystem's BRC-20 Ordi tokens.Celestia, being one of the earliest modular public chains, also requires staking of Tia tokens for airdrop eligibility.Additionally, the ERC404 protocol released its first token, Pandora, in February 2024, with the promise of future airdrops for holders of Pandora tokens.In order to facilitate user participation in airdrops, BingX has listed coins such as Ordi, Celestia, and Pandora on the spot trading market. Investors can use BingX Price Tools to access price estimates, valuations, and risk assessments to decide whether to purchase tokens for airdrop participation.Peter, BingX QA's Researcher, stated, \"Despite the abundance of bull market airdrop projects, Ethereum's price performance continues to correlate with Bitcoin's price fluctuations. Since acquiring airdrops requires staking tokens of the respective public chains, investors should also be mindful of the risk of token price declines due to Bitcoin price depreciation .\""
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxPM3lfVmpzR1QwYXVJX1pRLUZXRXhYWVlzeFpzSVlKNDNSQXJKb3QxeGR3Ukd3a1I1c21Pb1hndDBUMTNtRU1hMUo3TjltcWh6WkpCOHJqMmVvNnVyak1odEt1QTVOY2J6S1hzVkVNUlpuQWE1a1RDa00wTmRqOERMMUtvb3lZcDVYRFo3YnJTVmnSAZYBQVVfeXFMTkVHM3hDSWplOVlrejRNbDlmQVFtcE1jTW92MWtReG5mVDE3NEJGSVFpY1BnQm9HOFo3b3dPVlJuNXNNSzVpTEZvc3VzU1cxV3pnU01KTE02N1lhY3ZPRjZGSkRLM3R5QU9YQ3RWNWt6TV9fRGtGZlp2aDYydHJtOURTbHhaQndHYkRMWDlUblN6eWg5N09B?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 27 Feb 2024 08:00:00 GMT",
        "title": "Ethereum’s Vitalik Buterin Asks Elon Musk to “Join Us” - CoinGape",
        "content": "In a remarkable and unforeseen turn of events witnessed recently, Ethereum founder Vitalik Buterin invited Elon Musk, the founder of X Corp. and Tesla, to team up, according to a post shared on X today, February 27. This came as a surprise to industry enthusiasts across the globe as Vitalik’s statement could have brought about a paradigm shift for Ethereum. In a reply to Musk’s post about Microsoft’s PC laptop login fiasco, Vitalik stated, “Would be amazing to have you join us and become a desktop linux enjoyer!”\n\nWould be amazing to have you join us and become a desktop linux enjoyer! advertisement — vitalik.eth (@VitalikButerin) February 27, 2024\n\nThis statement echoed a sense of frenzy among crypto market enthusiasts across the globe as Musk’s potential welcoming to the Ethereum Foundation could position Ethereum as a pioneer across the cryptocurrency realm. However, with no replies by Musk on Vitalin’s post as of press time, industry specialists speculate over such potential phenomenal partnerships and their impact within the cryptocurrency realm.\n\nMeanwhile, Vitalik’s Ethereum recently marked a storm of breakthroughs across the broader crypto market, with its Dencun Upgrade integration on Mainnet nearing. Ethereum simultaneously traded in the green as of press time, nabbing global attention.\n\nMusk Slams Microsoft’s PC Laptop’s Account Creation Feature\n\nAligning with the aforementioned chronicle, Musk’s post shared on X, dated February 26, cracked down on Microsoft’s account creation feature on PC laptops. Musk stated that Microsoft’s feature prohibits anyone from using a laptop until and unless a Microsoft account is created. Regarding this, Musk cautioned about the potential risks of giving AI access to one’s computer, claiming it to be messed up.\n\nIt is this post to which Buterin replied, piquing the interest of industry prominencies. Intriguingly, Doge Designer, UX/UI Designer at Dogecoin, further took a sarcastic stand in a reply to Musk’s post slamming Microsoft’s this particular feature.\n\nAlso Read: Binance Waives Fees For BTC, ETH, XRP, SOL, But There’s A Catch\n\nVitalik’s Ethereum Soars\n\nAs of press time, Ethereum’s price continued its upward momentum past the $3200 mark. With a 4.20% rise in the past 24 hours, ETH currently rests at $3,229.28. The token’s 24-hour trading volume and market cap also surged 68.97% and 4.18%, respectively. As the Dencun upgrade for ETH Mainnet nears, positive sentiments for the token appear to be birthing.\n\nAlso Read: Veteran Trader Raises Bitcoin (BTC) Price Target to $200K\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMiywFBVV95cUxPWldxcm1Eakx2WDRYcEpXd1hiaENPSjZGX1pGVTZKSk5lWUdTcnRBdzd3c3JJTHZqM0p4X3lzT2xfWjRBajhXbHRSMjBfTU9FdEl2cVBNWE9DMmJOM28tdWx4RkpuYjFybWZfVzQ3eExlcHNmMmtraU1LSFlpamF5NThveVBDM0Y1UjhsY0JsdHFSbGVEQW81eExvT0RsZTZ0OEFYVGlsRzJCckh1NEhSZjBGMmZ5TENzWVEzbVR2cU1uS2dMSGxNbHoyY9IB0AFBVV95cUxOM1VJMV9tVElVNURiM0FUd2FZaFpLZFIyZDF6cWJBbWZ4QURPRTdaYVdpR3d6VnNycDctZHlQWV9CU1Q1bXl1aWc3VU1ScVNHUmtleTlVYlJJZm0xZVFVYWxVWVZBOHY1VXBVOHFoNHNhWjVxcnVlVC04bUhRLVpDbE5kb3dQS2NGajlDWjBjUmlLdlVmOFI4S3JkMU1qOEl1Yk44bDhZcVV6a01GZFlydkJLY2ZrNTM1Nlc5T2ZZWGlDZTIzQk82OWJKRlk3TUdQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Feb 2024 08:00:00 GMT",
        "title": "Stacks Creator Ali Calls Bitcoin 'Apex Predator' as Development Flourishes on OG Blockchain - CoinDesk",
        "content": "And now coming to your second question, I do think that in the overall industry right now, there's a lot of capital and developers who have the model that there will be some alt L1 like a Solana or something else, they're going to start eating on Ethereum's market share. I think there's some truth to it. Solana is gaining a lot of traction and it's popular in developers and so on. But I think what the market is beginning to see right now is that there's a much bigger category, which is Bitcoin L2s, because these Bitcoin L2s can match the alt L1s or Ethereum head-to-head on every single feature. It could be speed, it could be expressivity, and so on, but they can match it. And I think that could potentially be a much bigger market simply because of the fact that they're not starting from zero. Like whenever you launch a new project, you're sort starting from zero in terms of how much capital there is in that ecosystem. When you launch a Bitcoin L2, you're launching something on top of a trillion dollars of capital, right? So I think there's a much easier path to that capital getting deployed and Bitcoin L2s as a category growing. So I do think they're going to start giving Eth L2s some competition, but even like Eth L1 might start seeing competition coming from Bitcoin L2s, which is something that I don't think a lot of people are talking about."
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTFBIbVpFVGxEV3BvaGZGeVVXcjFjdXVkQlBJc1NvZW4wbmU2alk4V1YwZ3hpNVFrLTdrOS0wTWIwanVIdGdvTlBJc0QxSFFXUGVzM3JOcEpNRERNOHZhN0JNc3liZ3JaV3NGYUNtb3Vua9IBd0FVX3lxTFBHQVJ1bTh4UGF4RmlYQkd4Smc3QVFRblhSZjBqdkk0aUU3OE5WUVV1SzFvbXVEcnRfZzV3WF9MTWRVQlctN2stajlpYjg1WHY0SmhUbzRCMXgzcXp4dTZsbGI1U2ZXZmdUOWNEalRhb19Wcl91Y25N?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 27 Feb 2024 08:00:00 GMT",
        "title": "Ethereum's PEPE Leaps 36% While Solana Meme Coins WIF and BONK Rally - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEthereum meme coin Pepe and its Shiba Inu-themed Solana competitors Dogwifhat and BONK have posted some huge gains while riding the wave of Bitcoin's 11% gain past $56,000.\n\nPepecoin (PEPE) has leapt 36% in the past 24 hours and is trading for $0.00000215 at the time of writing. That's an 80% gain from just a week ago and the highest PEPE has been since May 2023, according to CoinGecko data. At the time, PEPE had just entered the top 100 digital assets with a market capitalization of $540 million.\n\nTo put in perspective just how much the crypto market has grown since then, PEPE has seen its market cap almost double to $900 million and ranks as only the 102nd largest coin.\n\nAs the price has skyrocketed, a number of PEPE holders have cashed in. Six different wallets account for roughly $4 million worth of PEPE tokens sold today on Binance today, netting the holders about $2 million worth of profit.\n\nAD\n\nAD\n\nMeanwhile, the Shiba Inu-themed meme coins on Solana have seen big gains as well.\n\nDogwifhat (WIF) has gained 46% in the past day and is currently trading for $0.5634. The meme coin has been in new all-time high territory since yesterday, when it surpassed $0.45 yesterday afternoon.\n\nAnd BONK, which was originally airdropped to Solana developers in 2022 and then saw a massive surge in December that culminated in the token setting an all-time high of $0.000025, has increased 16% since this time yesterday. At the time of writing, BONK is trading for $0.00001445, according to CoinGecko data.\n\nDogecoin (DOGE) and Shiba Inu (SHIB), two of the original meme coins, have seen their own—albeit, much smaller—price rallies over the past day. DOGE, the first ever meme coin, is currently trading for $0.09652 after having gained 12% since Monday morning. And SHIB has gained 8% since yesterday, and is currently trading at $0.00001051, according to CoinGecko data.\n\nAD\n\nAD\n\nFor the past couple weeks, Dogecoin has been struggling to remain in the top 10 ranking of cryptocurrencies by market capitalization on price aggregators, like CoinGecko and CoinMarketCap. Today it's still solidly outside the top 10, with a $13.8 billion market cap compared to the next largest coin, Avalanche (AVAX), which is sitting at $14.8 billion market cap.\n\nEdited by Andrew Hayward"
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxQTWg2b2ZjWWNHQW5ka2FCWUg3SktLUWQ3dVNsT3plTkw1MXdVUHoxREpaSGxRNHhxYTloMkRLTjFCWjZiOHVVRllpLWVjcC1HejdNR1lmcTZXejFIYURZNHZrWDZ0R0RhX2ZIaXlISS1DdXZoY3hsNThKT21mQkVtcThCaDFCT1NJQXFFNg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 27 Feb 2024 08:00:00 GMT",
        "title": "Bitcoin NFTs now dominate trading volume on Magic Eden - DLNews",
        "content": "What you'll learn Bitcoin NFTs now dominate trading volume on Magic Eden.\n\nInscriptions-based Bitcoin NFTs have reached $100 million in trading volume this month.\n\nPopular collections NodeMonkes and Puppets are leading the charge.\n\nBitcoin NFTs are having a barnstorming February.\n\nOrdinals-inspired Bitcoin NFT trading has crossed $100 million on Magic Eden this month, data from the platform’s Dune dashboard shows. Ordinals is a protocol that allows users create non-fungible tokens and crypto tokens on the Bitcoin blockchain.\n\nFebruary’s Bitcoin mark is a record for monthly NFT trading for a single blockchain on Magic Eden, a marketplace that supports NFTs created on four different blockchains.\n\nBitcoin NFTs now account for almost two-thirds of the trading volume on Magic Eden, generating $2 million in fees for the platform, the data shows.\n\nMagic Eden used to support only Solana-based NFT collections when it launched in September 2021, but it now supports collections on the Polygon, Bitcoin, and Ethereum blockchains. Support for the Ethereum-based NFTs started today.\n\nFebruary’s record-setting Bitcoin NFT trading volume comes amid an uptick in trading activity on popular collections NodeMonkes and Puppets.\n\nNodeMonkes claims to be the original 10,000-item collection inscribed on Bitcoin.\n\nThe collection’s floor price on Magic Eden is at a hefty $20,800, an increase of 105% from the prior week’s floor price.\n\nJoin the community to get our latest stories and updates\n\nA floor price is the lowest price on offer for an NFT from a particular collection on a marketplace like Magic Eden.\n\nTraders can use floor prices to determine the minimum value of an NFT collection. By that measure, NodeMonkes is now worth $208 million.\n\nBy comparison, Bored Apes, the most valuable NFT collection by floor price, is worth $773 million.\n\nPuppets, the other high-performing Bitcoin NFT collection, had an even greater increase in floor price in the last week, rising 130%.\n\nBoth of the NFT collections are made possible on Bitcoin by a method called “inscriptions” — a way to embed images and audio files on the Bitcoin blockchain by placing them onto a Satoshi, the smallest Bitcoin denomination.\n\nUnlike Ethereum, Bitcoin doesn’t have native smart contract support.\n\nBut with inscriptions, developers can mimic Ethereum’s smart contract functionality on Bitcoin to create applications like NFTs and memecoins.\n\nWhile inscriptions have opened a new vista for Bitcoin functionality, the market segment has its detractors. Bitcoin purists cast a jaundiced glance at inscriptions, often dismissing them as spam clogging up the blockchain.\n\nVeteran Bitcoin developer and vocal Inscriptions critic Luke Dashjr has even tried to push for filtering mechanisms that target these so-called spam transactions.\n\nOsato Avan-Nomayo is our Nigeria-based DeFi correspondent. He covers DeFi and tech. To share tips or information about stories, please contact him at osato@dlnews.com."
    },
    {
        "id": 71,
        "url": "https://news.google.com/rss/articles/CBMiZEFVX3lxTE5wUzA1ZW5BejJGVG9qajlsRUxhZlZpT0xqWERFd1kwVldFdXA5dDVoNFRyVDlib18zVHBNNEVPY2J5U3FRRDAxbk4wSktuRFFIUm8tZjN0TndHbUVZM1h6MC05VnjSAWpBVV95cUxNQ0F2blpXSE9nbVNveTEyQTF6ZlNFOXR3MkhMTWN0aThIWkJrc3diUEg3Y2NtMUpLR0pfOFBVVGowYWVDR0pJT0hjSk54TTNJZnhBUnlNM0JrYXBoZmZJbHlPVXJQMTlJc0R3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 27 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Pre-Mine Address Dormant For 8.6 Years Awakens As ETH Hits $3,200 | Bitcoinist.com - Bitcoinist",
        "content": "A dormant Ethereum address has roared to life to take advantage of the price surge that has rocked the digital asset in the last day. The wallet, which had not seen any activity in almost a decade, made its first transaction after the price of ETH moved above $3,200. Given that this investor has managed to hold all through these years, are they ready to sell?\n\nDormant Pre-Mine Ethereum Address Wakes Up\n\nOn-chain data tracking platform Whale Alert reported in the early hours of Tuesday that a dormant Ethereum address had awakened. The address in question is a pre-mine address, which means that it has been in existence before the official launch of Ethereum.\n\nLooking at the address on-chain, we can see that the address had received 238.75 ETH at Block 0, which is the Genesis block. Now, given that at that time, there was basically no value for ETH, it is possible that this could’ve been a test transaction at the time, only worth a couple of dollars at launch.\n\n💤 A dormant pre-mine address containing 238 #ETH (771,893 USD) has just been activated after 8.6 years!https://t.co/Py2J5EO1T8 — Whale Alert (@whale_alert) February 27, 2024\n\nHowever, as the years have passed, the value of the ETH has ballooned. With the Ethereum price currently above $3,200, the value of the wallet’s holding has risen to more than $770,000 at the time of writing. This increase in price could’ve been the prompt for the wallet owner to re-enter the market.\n\nAn initial transaction of 1 ETH was first carried out from this wallet to another “0x785c8E…3e77ED7c” and once that transaction was confirmed, the entirety of the wallet balance was then transferred out to the same wallet. In total, the wallet was dormant for 8.6 years before being reactivated today.\n\nWhere Did The ETH End Up?\n\nFor the investor behind this dormant address, it seems that the end game is indeed to sell, given where the ETH ended up. After transferring the balance to “0x785c8E…3e77ED7c”, which is a brand new wallet, another test transaction of 1 ETH was carried out with the destination being Coinbase. Subsequently, the entirety of the balance was sent to Coinbase as well, leaving the new wallet empty.\n\nGiven that the major reason why investors send coins to centralized exchanges such as Coinbase is to sell, it is possible that this investor is looking to sell their coins. In such a case, the coins may have been long sold at the time of this publication.\n\nHowever, given that the balance of this address was worth less than $1 million, it is unlikely to have any negative effect on the Ethereum price even if the investor is selling their coins. Even now, Ethereum continues to hold strongly above $3,200 as bulls dominate the market.\n\nETH price bounces above $3,200 | Source: ETHUSD on Tradingview.com\n\nFeatured image from Forkast News, chart from Tradingview.com"
    },
    {
        "id": 72,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTFBsUHkxbW9NQTRVVTFpR2RfVEVYZWRmd0xpMWgtTHZodHMtTmFKdFJuQVN2SV9FdTNGb211ZjhzSXhWb3FMV2szU3dhZTZ0cjd4NlhDc05wNlhYdmdySkRZY050c2FSUEFXNWlOTE9uZGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 27 Feb 2024 08:00:00 GMT",
        "title": "Getting to Know ERC-777: History, Benefits, & Features - Indodax",
        "content": "The Ethereum blockchain protocol that specifies the types of tokens that can operate compatibly with ETH is ERC-777. The ERC-777 is a more advanced token standard on the Ethereum network that was designed as a development of the ERC-20 token standard.\n\nThe addition of new security features and functionality characterizes ERC 777. As a token standard on the Ethereum network, ERC-777 is of particular interest due to its full compatibility with decentralized exchanges and its focused development goals.\n\nTo understand what ERC 777 is, its history and purpose, its benefits and advantages, and its main features, check out the full review below!\n\nWhat is ERC 777?\n\nQuoting coinmarketcap.com, ERC-777 is a token standard for creating token equivalents on the Ethereum network. This standard can fully integrate with existing decentralized exchanges.\n\nIn simpler terms, ERC-777 is the Ethereum blockchain protocol that governs the types of tokens that can operate compatibly with ETH.\n\nHistory and Purpose of ERC-777\n\nJordi Baylina, Jacques Dafflon, and Thomas Shababi proposed ERC-777 in November 2017 as a new token standard on the Ethereum platform.\n\nThey aimed to improve the ERC-20 standard by introducing more features while ensuring backward compatibility with existing ERC-20 applications.\n\nBenefits and Advantages of ERC-777\n\nERC 777 simplifies interactions in complex token trades and helps resolve ambiguities around decimals, minting, and burning. ERC-777 uses a highly efficient feature known as a hook.\n\nWhen tokens are delivered to a computer-based analytics contract, the hook mechanism is activated, thus simplifying the interaction between the account and the contract when receiving tokens. Additionally, tokens are less likely to get trapped in the contract with ERC-777 tokens, which is an improvement over the problems commonly associated with ERC-20 tokens.\n\nMain Features of ERC-777\n\nThe following are some of the advantages or benefits provided by the ERC-777 standard, among others:\n\nERC-777 implements a new standard, ERC-820, which enables the registration of metadata for contracts to provide basic introspection capabilities. This approach enables backward compatibility as well as the extension of additional functionality. Contracts in the ERC-777 standard interact similarly to contracts in the ERC-20 standard.\n\nWhen tokens are sent to a computer-based analytics contract, activation of the hook mechanism eases the interaction between the account and the contract during the token acceptance process.\n\nGet to Know ERC 777 Improvements Over ERC 20\n\nQuoting ethereum.org, ERC-777 brings further improvements compared to ERC-20, among others:\n\nHooks are functions described in the smart contract code. Hooks are called when tokens are sent or received through the contract, allowing the smart contract to respond to incoming or outgoing token events.\n\nHooks are registered and identified using the ERC-1820 standard. The following are some of the benefits of hooks, namely:\n\nHooks allow sending tokens to a contract and notifying the contract in a single transaction, unlike ERC-20, which requires multiple calls (approve/transferFrom) to achieve this.\n\nContracts that have not registered hooks cannot communicate properly with ERC-777. If the sending contract uses a hook and the receiving contract has not registered a hook, the transaction will be aborted, thus preventing accidental transfers to non-ERC-777 smart contracts.\n\nHooks can also reject transactions.\n\nConclusion\n\nIn conclusion, ERC-777 exhibits some important advantages as a more advanced token standard on Ethereum. Among these are enhanced security features and functionality compared to previous token standards such as ERC-20.\n\nFurthermore, to fully understand the future development potential of tokens, it is important to delve further into the innovative features introduced by ERC-777. That way, we can take full advantage of the opportunities offered by the evolution of this token standard within the Ethereum blockchain ecosystem.\n\nFor additional information, you can also read other interesting articles about the difference between ERC 721 vs ERC 1155 and ERC 404 in the best article collection from INDODAX Academy, and you can also read crypto terms in the Academy glossary.\n\nTo increase your knowledge of blockchain technology, you are strongly encouraged to read the latest articles available on INDODAX Academy.\n\nINDODAX Academy presents a variety of materials covering basic concepts and more in-depth aspects of blockchain technology.\n\nBy reading various articles on INDODAX Academy, you can gain a deeper understanding of this technology, including its applications, and get the latest information about the crypto world.\n\nInvest in Ethereum on INDODAX\n\nWell, now you understand what ERC 777 is, its history and purpose, its benefits and advantages, to its main features.\n\nFurthermore, to invest crypto assets in Ethereum at INDODAX, you should check the Ethereum price today on the INDODAX Market.\n\nThe following are the steps to buy Ethereum on INDODAX:\n\nLogin to your INDODAX account.\n\nMake a deposit if your balance is still empty.\n\nOpen the marketplace and find Ethereum.\n\nAfter that, find the sales column and enter the desired Ethereum price and the available balance. You can choose the instant or limit method.\n\nAlternatively, you can place a sell order at the desired price immediately after you have Ethereum. Be sure to pay attention to the previous price movements.\n\nAs a disclaimer, it is important to understand the risks associated with crypto trading, given its high volatility, before making any transactions.\n\nThe decision to buy Ethereum is entirely the user’s responsibility. In addition, be sure to research before making an investment decision.\n\nStart investing in Ethereum now only on INDODAX!"
    },
    {
        "id": 74,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxPbElVUWZndWVXXzc0bEUxbXpNTTNQU1o0QUdqSGsxOWhOZ0FKY0ZiUEZjd09ZRHY3cEhnYzctSWRudEpRVHBHVVJOajJSSExaTjdGYTU1ZGF4TnZHWnNyVlNMQkJudndsakJDenVBcGFWalltWnYxeVlVRHA3VU1aLWJCNmRhcjdid2p2ekVuV244ZUhvek9r0gGcAUFVX3lxTE4wRFV1VWp2cTBHaFBwUjJpUi02RWZwVmUzSGxJUm9acFdjeE4wNTd3YnZmeTdGSWVhY3pXU3k5blpyTGUwLVBVYWJsZlpIVE9EU0NUcjM4SHpsT0hVQXFDZjFOZlY5TWRpa0FLX3Z5OHhta3ZWM3FpelNDZzVBRU1GcFdKWHZfOEphamRRNklVRlJ1bm5TOXR5bWFwNA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Feb 2024 08:00:00 GMT",
        "title": "Altcoin Market Cap Break From “Wyckoff Accumulation Phase”: Will Ethereum, XRP Fly? - NewsBTC",
        "content": "In a post on X, one analyst observes that the altcoin market capitalization has broken from the Wyckoff accumulation phase. With this upswing, the trader expects altcoin prices to move higher.\n\nThis refreshing breakout coincides with Bitcoin’s (BTC) stellar performance when writing on February 28. At spot rates, the coin is trading above $60,000, a psychological round number- now supported- and is closely approaching $70,000.\n\nThe Altcoin Breakout From Accumulation\n\nThe “Wyckoff accumulation pattern” is a concept developed by technical analysts to pick out potential buying opportunities, in this case, altcoins. Whenever prices are in this phase, it is widely believed that the so-called “smart money” or large institutional players are accumulating at low prices.\n\nCurrently, prices consolidate at tight ranges and with low trading volumes. A signal marking the end of this accumulation is a sharp breakout, lifting prices above the defined range. Often, this upswing is with rising trading volume.\n\nRelated Reading\n\nEthereum Price Primed To Hit $3.5K After Bitcoin Rallies Past $60K 7 months ago\n\nLooking at the chart, the altcoin market cap has broken above the accumulation phase. With previous resistance and support, the altcoin market cap will likely continue floating higher. As such, top altcoins, including Ethereum (ETH), Solana (SOL), and XRP, will follow suit, posting fresh 2024 highs.\n\nWhy Spot Bitcoin ETFs Give BTC Edge In This Bull Run\n\nSo far, Bitcoin is leading the way, posting over $10,000 in less than a week. However, with the coin trading above $60,000, its demand-side drivers differ entirely from what’s influencing altcoins. The approval of spot Bitcoin exchange-traded funds (ETFs) by the United States Securities and Exchange Commission (SEC) has seen billions of dollars flow to the world’s first cryptocurrency.\n\nTherefore, while altcoins have historically outperformed BTC when crypto prices rally, there is an edge with spot Bitcoin ETFs. As such, this bull run will likely differ from 2017 and 2021. This forecast is because institutions will likely favor a regulated asset over altcoins whose status remains undefined.\n\nAs of late February 2024, the United States SEC has not approved spot ETFs of any altcoin, including that of Ethereum. Additionally, the agency has labeled several top altcoins, including Cardano (ADA), unregistered securities. The agency even filed lawsuits against major exchanges like Binance and Coinbase, accusing them of facilitating the trading of what the commission described as “unregistered securities.”\n\nRelated Reading\n\nCEO Of German VC Firm Predicts XRP To Become ‘World Reserve Bridge Currency’ 7 months ago\n\nIt is not immediately clear whether the United States SEC will change their preview of leading altcoins, especially Ethereum (ETH), which has a market of over $400 billion. Wall Street heavyweights like BlackRock and Fidelity remain interested in launching spot Ethereum ETFs.\n\nFeature image from DALLE, chart from TradingView"
    }
]