[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxQaGJ6RElPWXhnU0ViY0RPZGNaWXRNRG1oS0JQTEJZWnhOX0lqVnZvWkRKY3E3ZDlBVU13Smc4TFItMHMtaU0zQmExUTJuYkFCR2ZpbmlZVWtfR1ZLQ241UTZuS2pDZDZ2VXBQU2l5dTJjQmhoWG5ENUVhUlBGdnpBNWZtN0Z5a1ZrcDBHS2E3TXpZOEkzd2xzR0FiY0FqUWU5Y1BLSlZJOTliSzlmVk4tLXhlZ0dxdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 May 2024 07:00:00 GMT",
        "title": "Two Reasons Why Ethereum ($ETH) Is Underperforming Bitcoin ($BTC) As an Asset - CryptoGlobe",
        "content": "The Ethereum blockchain has long faced issues with scalability, particularly during high activity periods that lead to network congestion, slow transaction times, and high gas fees. These challenges affect user experience and limit the network’s capacity to support a diverse range of applications. The Dencun upgrade, introduced in March 2024, represents a significant advancement towards resolving these issues by laying the groundwork for future scalability improvements.\n\nDencun, which combines elements from the Cancun and Deneb upgrades, does not provide an immediate solution to all scalability problems. However, it is a crucial milestone in Ethereum’s development. Central to the Dencun upgrade is the concept of “proto-danksharding,” which sets the stage for future sharding implementations. Sharding involves partitioning the blockchain into smaller shards, each capable of processing transactions independently. This parallel processing is expected to substantially increase Ethereum’s transaction throughput in the future. While Dencun does not implement sharding directly, it establishes the necessary technical foundation for its eventual deployment.\n\nThe primary focus of Dencun is not directly reducing transaction fees on the Ethereum mainnet. Instead, it aims to optimize fees within Layer 2 networks. Layer 2 solutions function on top of the Ethereum blockchain, aggregating transactions off-chain before submitting them back to the mainnet. This process helps mitigate congestion on the main network and can potentially lower fees for users.\n\nA significant feature of Dencun is EIP-4844, which lowers the cost for Layer 2 networks to submit their bundled transactions to the Ethereum blockchain. This improvement is expected to enhance the efficiency of Layer 2 solutions, potentially reducing fees for their users. However, the actual fee reductions observed may not be as substantial as initially projected, and the long-term effects on fees will need further monitoring.\n\nOne unintended consequence of the Dencun upgrade has been its impact on the Ethereum supply. The reduction in transaction fees led to a decrease in the amount of ETH burned. Previously, higher network activity and fees resulted in more ETH being burned, contributing to a deflationary effect on its total supply. Following the Ethereum Merge, which transitioned the network from proof-of-work to proof-of-stake, this deflationary mechanism was an anticipated benefit. However, with fewer fees being burned and the natural increase in supply, the total supply of ETH has started to grow at a faster rate, shifting back towards an inflationary model.\n\nThe Dencun upgrade has prompted a fresh analysis from CryptoQuant, a respected South Korea-based blockchain analytics firm. This upgrade, according to CryptoQuant, may significantly alter Ethereum’s progression towards becoming an “ultra sound money” – a concept that denotes a currency that appreciates or maintains its value over time.\n\nSee our full analysis 👇https://t.co/6KYAcn0KQ8 — Julio Moreno (@jjcmoreno) May 13, 2024\n\nThe other problem for Ethereum is that once the U.S. SEC approved 11 spot Bitcoin ETFs, many people thought that probably within a few months, the SEC would start approving some, if not all, of the several pending spot Ethereum ETF proposals. Unfortunately, with the SEC’s recent crackdown against the Ethereum ecosystem (e.g. Uniswap receiving a Wells notice last month), it seems that SEC Chair Gary Gensler sees Ether (ETH) as a security (which is what Consensys CEO Joseph Lubin suspects) and therefore the expectations for spot Ethereum ETFs getting approved in the U.S. sometime in 2024 have been dramatically lowered. Eric Balchunas, a Senior ETF Analyst at Bloomberg, says he wouldn’t be surprised if we do not see an approval until 2025.\n\nBloomberg ETF analyst Eric Balchunas said that the U.S. SEC may reject Ethereum spot ETF on May 23, and approval may not be until the end of 2025. If Trump wins, the SEC will likely face a change in leadership that may be friendlier than Gary Gensler's. DLNews… — Wu Blockchain (@WuBlockchain) May 11, 2024\n\nThe following ETH-BTC price chart shows the extent of ETH’s underperformance against BTC: In the past one-year period, ETH is down 30% compared to BTC.\n\nFeatured Image via Pixabay"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxPaFItMlVrVTFhOTRaa1pqcUlCdW83Y2VFMnRETk1SZk1pcncweUdiUjUwVXdMbzlGU0FGWW9IdTRUNUVLY2tjZjhyZDVfZm9DWDJaSV9SSkxjYTdrbkw2RkxkZFdQTzhJcDVGOENDekF4MzZ5Mm9aVUllOFB2UzNvN0FURW5vcHpHRlNtTURKMWNtaDVBZlQ5SVN5cHlOQVpxZlNsRlNTeXdsYllFX3FpR2hR0gG3AUFVX3lxTE5UZXh0R2FYbDRHWDdMdzh1NEU4TlBFRVJKV0QxX01TWUs0RnR2MURqLUJvb2d3T29qbmFRVmdlRWVwMEVXRkduQ3AzYmw5SXVQZlRoRjVjOHZrZjI3Wkc1T0NUeUhsRUxMRXp5WVkzLUhZSmhNMEI4S0w3WTVBOWlRU1dKd2pHWjJBNmY2STFCa04tdDRkNk12S09weWdoVl96cG9KX25wcy04UkxWUzR0RG5IZFpTMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 May 2024 07:00:00 GMT",
        "title": "Brothers Accused of $25M Ethereum Exploit as U.S. Reveals Fraud Charges - CoinDesk",
        "content": "The brothers created 16 Ethereum validators and targeted three specific traders who operated MEV bots, the indictment said. They used bait transactions to figure out how those bots traded, lured the bots to one of their validators which was validating a new block and basically tricked these bots into proposing certain transactions. The brothers allegedly frontran the bots on certain trades and also used their validator to \"tamper with\" the new block by sending a false digital signature that gave them access to the block's full contents and replaced \"lure transactions\" with \"tampered transactions.\" In those tampered transactions, the brothers allegedly sold illiquid cryptocurrencies they had tricked the victims' trading bots into placing buy orders for."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPa2pPbXB5cjdDMEpXekJOaVJTVW5HYmNEWlE2TFFRbmlzUUR3MjgxeWJoQ2FrTnFGUDRBQUdVSzVSSExKOGRKbkREb3FONDd2SFJhVks3V1Fnak5rZmNtM2NSWmpNNXB3TUEzaGIzMGotaW5JQXRZaXF5RVJQQUhZMENjWlNxTzd5T2lkVGMwQTQ2WDNZbW1Meg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 May 2024 07:00:00 GMT",
        "title": "2 arrested for $25 million exploit of Ethereum’s proof-of-stake validators - CoinGeek",
        "content": "Homepage > News > Business > 2 arrested for $25 million exploit of Ethereum’s proof-of-stake validators\n\nGetting your Trinity Audio player ready...\n\nEthereum’s already wobbly foundation looks even shakier following the arrest of two brothers who exploited the network’s vulnerabilities to steal $25 million from transaction validators.\n\nOn May 15, the United States Department of Justice (DOJ) announced the arrest of two brothers—Anton and James Peraire-Bueno—on charges of conspiracy to commit wire fraud, wire fraud and conspiracy to commit money laundering. If convicted on all counts, the brothers face up to 20 years in prison.\n\nThe MIT-educated pair are accused of netting around $25 million worth of tokens in a 12-second span—the duration of a block validation ‘slot’ on Ethereum—by manipulating vulnerabilities in the process by which Ethereum verifies transactions. Damian Williams, U.S. Attorney for the Southern District of New York, said the “novel” scheme “calls the very integrity of the blockchain into question.”\n\nThe scheme involved Ethereum’s so-called ‘maximal extractable value’ (MEV), the process by which Ethereum’s transaction validators can preview and reorder pending transactions. MEV allows validators to personally profit from this advance knowledge by front-running significant or large transactions. European regulators recently flagged MEV for its potential for market abuse.\n\nThe DOJ says the Peraire-Bueno brothers stole funds that would otherwise have gone to a group of Ethereum validators using MEV-Boost. This open-source software outsources the creation of new Ethereum blocks to a network of ‘searchers,’ ‘builders,’ and ‘relays.’\n\nSearchers utilize automated bots to scan the Ethereum mempool for profitable arbitrage opportunities, then forward a bundle of preferred transactions to the builder. This bundle prioritizes the searcher’s ‘frontrun’ transaction, aka buying a token on the expectation that the transactions that follow will boost the value of said token. The searcher also includes a ‘sell’ transaction further back in the bundle to cash out this expected spike in token value.\n\nBuilders sent these bundles to a relay, which initially submits only the blockheader to a validator. Only after the validator accepts the block for publishing to the chain does the validator see the complete ordered transaction list.\n\nTaking the bait\n\nAs detailed in the indictment, the brothers began plotting their heist around December 2022, just months after Ethereum made its transition from a consensus mechanism based around proof-of-work (PoW) to one based on proof-of-stake (PoS).\n\nThe brothers established 16 validators, then engaged in a series of ‘bait transactions’ to figure out what motivated MEV bots to propose bundles containing these transactions. The brothers thus identified three ‘victim traders’ that specialized in crypto arbitrage trades.\n\nThe brothers then initiated “at least eight” transactions (the ‘Lure transactions’) they knew would cause the victim traders’ MEV bots to propose bundles containing these transactions. The bundles also included the victim traders’ own ‘buy’ transactions in which they paid $25 million in stablecoins and other tokens to acquire “substantial amounts of particularly illiquid cryptocurrencies” (aka shitcoins of little or no utility).\n\nThe victim traders also included their ‘sell’ transactions after the Lure transactions, but with coded conditions that the frontrun transactions couldn’t be executed unless the Lure transactions “took place immediately after the frontrun trades” and the sell transactions occurred immediately after the Lure transactions.\n\nBut the brothers had identified a vulnerability in the MEV-Boost relay code that prematurely exposed the full content of proposed blocks. This allowed the brothers to tamper with the victim traders’ proposed blocks when one of the brothers’ 16 validators was selected to approve the next block.\n\nOnce the victim traders’ $25 million buy transactions had gone through, the brothers “replaced the Lure transactions with Tampered transactions. In the Tampered transactions, the defendants sold the same illiquid cryptocurrencies that the victim traders had recently purchased as a result of the Lure transactions and, for which the defendants already held as a result of information gathered through the bait transactions. In effect, the Tampered Transactions drained the particular liquidity pools of all the cryptocurrency that the Victim Traders had deposited based on their frontrun trades.”\n\nThe net result was that the victim traders’ sell orders couldn’t go through, leaving them with worthless shitcoins while the brothers collected around $25 million in stablecoins and more liquid tokens. The brothers then published the re-ordered block to the Ethereum network.\n\nThe victim traders eventually caught on to what had occurred and reached out to the brothers, as did “a representative from Ethereum.” The brothers ignored these pleas and set about laundering their stolen loot through exchanges with minimal ‘know your customer’ controls as well as some decentralized finance (DeFi) protocols.\n\nWhile the brothers may have graduated from MIT, they failed OpSec 101 by googling phrases such as ‘money laundering’ and ‘does the United States extradite to [insert country here]’ ahead of their heist.\n\nDeputy Attorney General Lisa Monaco said the brothers’ high-tech antics “were no match for DOJ prosecutors and Internal Revenue Service (IRS) agents, who unraveled this first-of-its-kind wire fraud and money laundering scheme.” IRS Criminal Investigation unit special agent Thomas Fattorusso added that his office had “simply followed the money” using “cutting-edge technology and good-ole-fashioned investigative work, on and off the blockchain.”\n\nWhile the company behind MEV-Boost released an update to prevent future exploits of this kind, the reputational hit that Ethereum has taken since its shift to PoS shows no sign of ending. In fact, PoS is considered one of the primary reasons why the U.S. Securities and Exchange Commission (SEC) is (allegedly) preparing to designate ETH as an unregistered security.\n\nA significant chunk of ETH was already concentrated in relatively few hands, most of them belonging to Ethereum insiders who were the primary beneficiaries of 2014’s controversial crowdsale. PoS was guaranteed to further concentrate control of the network, trigging more planks of the Howey test. Regulatory blowback was/is inevitable.\n\n‘Compromised and partially drained’\n\nStill more ‘crypto’ bro-on-bro violence made the news this week courtesy of a hack of the BlockTower blockchain-focused institutional investment firm.\n\nOn May 14, Bloomberg reported that BlockTower’s main hedge fund had been “compromised and partially drained by fraudsters,” citing sources familiar with the situation who didn’t want to be identified. The total amount of the stolen assets, as well as the nature of the hack went unspecified, but BlockTower has reportedly hired blockchain forensics experts to get to the bottom of this mess.\n\nAs a private company beholden only to its well-heeled investors, BlockTower has so far offered no official statement about the report. The company’s main fund held around $1.7 billion worth of assets under management prior to the hack.\n\nThis isn’t the first time BlockTower has suffered losses via exploits, having lost $1.5 million worth of TRU tokens after hackers targeted its wallet on the Dexibel decentralized exchange in 2023.\n\nBlockTower describes its Flagship fund’s M.O. as “focused on liquid crypto assets via a multi-strategy approach analyzing both top-down market regimes and bottom-up asset selection (beta augmented with alpha), and incorporating market neutral strategies where appropriate to the opportunity set.”\n\nIn 2022, BlockTower launched a dedicated venture capital fund that has taken stakes in numerous ‘crypto’ entities, including memecoin-factory Solana, struggling NFT-focused Dapper Labs, Sky Mavis (parent of the Axie Infinity game, which suffered a nine-figure hack of its Ronin Bridge network in 2022) and fraudulent ‘algorithmic stablecoin’ issuer Terraform Labs.\n\nHonestly, given that stellar track record, we’re a little surprised there was anything left to steal.\n\nMake it stop\n\nBlockTower wasn’t the end of this week’s hackery. The Sonne Finance ‘decentralized non-custodial lending protocol’ was taken for $20 million worth of ‘wrapped’ ETH and USDC tokens. Sonne Finance said it’s prepared to offer the hacker a ‘bug bounty’ that would allow him/her/they to keep 10% of their loot as payment for pointing out the gaping security flaws if they return the other 90%.\n\nBut the hacker has reportedly already swapped some of their ill-gotten gains for nearly 1,200 ETH and 183,000 DAI (an Ethereum-based stablecoin maintained by the MakerDAO decentralized autonomous organization). From there, the ETH will almost certainly tread the well-trodden path to Tornado Cash, the ETH-based coin mixer that helps obfuscate a digital asset’s digital trail.\n\nWe say that with some confidence because on May 14, Reuters revealed a United Nations Security Council (UNSC) sanctions committee report that found Tornado Cash helped launder $147.5 million worth of ETH that was stolen from Justin Sun’s HTX (formerly Huobi) exchange last year by North Korea’s hackers.\n\nThat nine-figure sum was funneled through Tornado Cash in the month of March alone. A further $66.3 million worth of ETH that was stolen from the Sun-linked Poloniex exchange has been similarly washed. With apologies to ancient Rome, when it comes to stolen tokens, all roads lead to Tornado Cash.\n\nThe UN report, based on data provided by PeckShield and Elliptic analysts, also found that North Korea was the likely culprit behind 97 suspected attacks on ‘crypto’ firms that netted the Hermit Kingdom some $3.6 billion between 2017 and 2024. The same report indicates that North Korea may have been responsible for 11 ‘crypto’ heists so far this year that netted nearly $55 million.\n\nIronically, many of the victims of these heists were likely among the legions of ‘crypto bros’ loudly denouncing this week’s sentencing of Tornado Cash co-founder Alexey Pertsev to 64 months in a Dutch prison for money laundering. Code is law, after all… that is, until it’s your bits of code that have been stolen and laundered. Still, man up and take one for the team, right?\n\nOne imagines that, within crypto crook circles, it’s hard to get angry when they get caught thieving from each other. After all, it’s the dominant ethos of this game, in which the much-ballyhooed notion of ‘building’ doesn’t so much take a backseat to ‘grifting,’ it gets relegated to a rickety trailer haphazardly hitched to the back of this out-of-control 18-wheeler.\n\nFor those of you who crave a more productive, utilitarian and (ta-da!) legally- and regulatory-compliant worldview, there’s a little shindig going on in London next week that might be just what you’re looking for.\n\nWatch: Teranode & the Web3 world with edge-to-edge electronic value system"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMibEFVX3lxTE43VEJKZHBYNndrb29FZW1mdzExTWZBbTNzVXhlYXFzMlNKVTRvMlVUdWhnVFdyaEUtdG9JTFZzQVI4LW5vajdqSWJ6MmVpVzUxZGMyRlZXamxQeWxJSk43UGxFalFjWkZ2NmJCQw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 May 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum prices rise after U.S. inflation report - crypto.news",
        "content": "Bitcoin and stocks experienced a notable price increase following the release of the April U.S. inflation data.\n\nThe Consumer Price Index (CPI), which measures the average change over time in the prices paid by urban consumers for a market basket of consumer goods and services, indicated a 3.4% increase in consumer prices from last year.\n\nThe year-over-year inflation figure represents a slight decrease from March’s inflation rate of 3.7%, as reported by the U.S. Bureau of Labor Statistics (BLS).\n\n24-hour price of BTC from CoinMarketCap\n\nShortly after the BLS published its findings, Bitcoin’s price (BTC) reached $64,492, marking a 4% rise over the past 24 hours and a 1% increase within the last hour, according to CoinMarketCap.\n\nYou might also like: Legal experts weigh-in on case against Roger Ver\n\n24-hour price of ETH from CoinMarketCap\n\nSimilarly, Ethereum (ETH), the second-largest cryptocurrency by market capitalization, increased its price to $2,960.94, up 1.87% from the previous day and 1% from an hour earlier.\n\nThe BLS highlighted housing and gasoline as the primary contributors to the inflation rate in April, reflecting ongoing economic pressures in these sectors."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE5naUZEd2pvcUw5NWJWckptYXJZNFRrYTNVd2ExMURvLXZsN3BFVUF6aGI5Vk8xVmRRSm9VUmNYeDBtU3RwTngxelEtQTZVU1ZRQ0UyM0l5NjREMXp5amtZeUJPVHU0QnVmZktQd3kxaXRNczFodGR5R9IBgAFBVV95cUxOa2RzOFREVVdIRDlGUjFmYkF3WGJKcEdzdFhEU01SSlNqdlJiNjd6M1I3cGRwRDhNYklDN0J0Wk0zdzlRYm1LXzVyVXFxUjl4WnhoSS01S3FwWmt0RTBEQ3FDeFVhUENHdGVrbVZVZkZFaGlFVkJjRVoyaFhxRm9pRg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 May 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Price Prediction 2024 2025 2026 - AlexaBlockchain",
        "content": "As the world’s second-largest cryptocurrency by market capitalization, Ethereum has attracted the attention of investors and industry experts. With advancements in blockchain technology and the increasing popularity of decentralized applications (dApps), the future of Ethereum (ETH) continues to be a subject of widespread debate.\n\nIn 2021, the price of Ethereum hit an all-time high of $4,600, fuelled by the launch of Ethereum 2.0. Yet, what causes the price of Ethereum to continue to fluctuate wildly? Could Ethereum one day witness a value overflow of this cryptocurrency at a higher growth rate?\n\nIn this article, we bring you a detailed review regarding the factors that could influence the economic predictions of ETH in the coming years. We will also give you the anticipated costs in 2024, 2025, and 2026.\n\nEthereum Overview\n\nEthereum is an innovative cryptocurrency that takes the shape of a decentralized, open-source blockchain. It first emerged in 2015 and came alive via people looking for a network that encourages smart contracts and decentralized apps to be developed and used without manipulating, hacking, or being influenced by fraud.\n\nThis platform further aids creators in planning goods and performing contracts quickly without any negative consequences. Indeed, compared to other cryptocurrencies, Ethereum has a wider scope that includes cryptocurrencies such as Bitcoin. For this type of machines like those that are required to reach a new level of these apps, the ‘Ethereum Virtual Machine‘ (EVM) lies in the epicenter of Ethereum.\n\nHistorical Price Analysis\n\nEver since 2015, prices of Ethereum have seen quite some lows and some highs at the same time; thus, it’s been quite a volatile ride for the fintech asset. Ethereum prices had been determined and influenced by a lot of things such as the overall market sentiment, advances in technology and how well they were adopted within the Ethereum ecosystem.\n\nA particular craze worth mentioning about 2017 was the ICO, and the buying using ETH alone brought about a surge in the demand for ETH. About $8 was its initial price at the beginning of 2017, and its price has reached an all-time high of over $1300 before 2018 ended. From there, a bear market showed continuous decline of ETH prices through months. ETH’s price had leveled at around $130 at the end of the year.\n\nThe 2020 pandemic catalyzed the institutional adoption of cryptocurrencies and a lot of mainstream interest and recognition which it didn’t have before. The rise of decentralized finance of the DEFI was primarily seen as very bullish for the evolution of the Ethereum Network, and subsequently, the price of ETH lifted from then. Each ETH was priced at $4600 at the end of 2021 and at the beginning of 2022.\n\nBy the end of 2022, Ethereum saw another dip which continued through all of 2023 with the fintech asset priced as low as 1100$. The market came back by the end of 2023 at a ranging price of around $4000. And in May 2024, the price of Ethereum is currently around $3080.\n\nEthereum Price Predictions for 2024, 2025, and 2026\n\nPrice Prediction 2024\n\nAs the Ethereum network grows and expands, the demand for its native cryptocurrency will also grow in 2024. More sharding and scaling solutions will strengthen the network’s capacities and speed and draw more users into the system. Henceforth, the bull run is likely and the currency will hit the $3,500 – $4,000 mark, by mid-2024.\n\nBy the end of 2024, ETH’s integration into traditional finance and major corporation adoption could cause the predictions to increase to $4,000 – $5,000 if foreign exchange and other layer-2 scaling solutions tonight volumes.\n\nPrice Prediction 2025\n\nBy 2025, the Ethereum ecosystem might further mature and absorb into various fields. By solving all the scaling issues (if there are any) and introducing new layer-2 solutions, it will become far more efficient and will attract even more users and developers. So, the price might rise in the years to come.\n\nSlowly, when more real-world uses are implemented, and Ethereum-based app usage increases, the use could potentially even make the demand rise up. Since it can be noted from many experts that big investors and traditional finance sectors have also increased their interest in Ethereum. It might also make a profit to much extent as it is considered that Ethereum will become a dominant blockchain platform.\n\nIf this continues, the price predicted might reach within the range of $6000-$7000 by the end of the year 2025. The cryptocurrency market is notorious and high volatility is one of the aspects preventing it since unexpected events happen in the market frequently, which might increase or decrease the prices. Any legislative shift can also increase or decrease the prices of any cryptocurrency.\n\nPrice Prediction 2026\n\nIn 2026, Ethereum may prove to be unbeatable and may have shown much progress. The powerful Ethereum ecosystem and scaling solutions may probably absorb almost all industries. By not having any stress to adapt and evolve as it is upgraded or updated regularly, it can potentially cause several organizations or even governments to adopt blockchain technology.\n\nThe price for Ethereum (according to experts’ speculation) might reach a range of $8000-$10000 by the end of 2026 if significant developments occur.\n\nForecasted Price Range for Ethereum (ETH) 2024-2026\n\nYear Forecasted Price Range for Ethereum (ETH) 2024 $3,500 – $5,000 2025 $6,000 – $7,000 2026 $8,000 – $10,000 Forecasted Price Range for Ethereum (ETH)\n\nInvestment Strategies\n\nEthereum is no different than any other investments and it is important to do thorough research, understand the risks involved, and consult with financial advisors before making any investment decisions. Here are some effective tips for people looking to invest in Ethereum:\n\nTechnical Analysis: Some of the technical indicators are moving averages, relative strength index (RSI), chart patterns and so on. These pinpoint the price areas where one should sell and buy.\n\nSome of the technical indicators are moving averages, relative strength index (RSI), chart patterns and so on. These pinpoint the price areas where one should sell and buy. Dollar-Cost Averaging: Instead of investing all at once, consider spreading your investments over time through dollar-cost averaging..\n\nInstead of investing all at once, consider spreading your investments over time through dollar-cost averaging.. Risk Management: Implement strict risk management practices, such as stop-loss orders and position sizing.\n\nImplement strict risk management practices, such as stop-loss orders and position sizing. News and Sentiment Monitoring: Stay updated on Ethereum-related cryptocurrency news, announcements, and market sentiment.\n\nStay updated on Ethereum-related cryptocurrency news, announcements, and market sentiment. Diversification: Diversifying your portfolio by investing in other promising cryptocurrencies or traditional assets to reduce overall risk.\n\nIt’s important to remember that crypto has its risks, and volatile market conditions can lead to losses if not approached with caution and proper risk management strategies. Check out cryptocurrency exchanges like Crypto Pie to get the best strategies, market analysis, and stay updated with the latest crypto news in your country.\n\nFinal Words\n\nThe future of the 2nd largest cryptocurrency looks bullish. The upcoming years do have anticipated short-term volatility. However, the price growth potential it has is huge and is expected to grow significantly. Technological developments, scalability solutions, and increasing interest from institutions are driving such a surge. Investors are advised to do comprehensive research, frame proper strategies, and be cautious while playing around in the ever-volatile cryptocurrencies market.\n\nRead Also: Is Vanguard Charting a New Path with the Appointment of Outsider CEO Salim Ramji?"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxOUC1YOGhqeGVzNjZHY2w5SHlFWlVJZnBYUGdPTXBxOW5ObnhWYk1uYlQ3WGlsMnZDU2s1UU5YQXNjbjUxT3JfRklST2JHa1cxUGc5bHpMc2UzZ0pnVXJNS2FGMTBTNnZoYU1nTEowMDFHcTVDcDBTa0ZuN3MtT3k0QVNIbEFHN05vTFRYZzRwUVY4MG1XOHhrN0RGSEFKaXZGM3lWbzJhSUtTUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 May 2024 07:00:00 GMT",
        "title": "Ethereum Scaling With L2s Has Damaged Its Tokenomics. Is It Possible to Fix It? - Unchained",
        "content": "While Ethereum layer 2s are at an all-time high in terms of active addresses and transactions, the mainnet may not be doing as well.\n\nEthereum, often celebrated for being “ultrasound money” owing to its deflationary bent, has turned inflationary again over the past month, challenging the foundational principles that its community thought drove its value. A recent report from CryptoQuant has declared the ultrasound money narrative dead, sparking debates and concerns about the tokenomics of ETH.\n\nLearn more: What Is Tokenomics? A Beginner’s Guide\n\nThe core of the issue lies in the balance between Ethereum’s main chain and its Layer 2 scaling solutions (L2s). While L2s have successfully improved Ethereum’s scalability by handling transactions off the main chain, they have inadvertently reduced the demand for Ethereum’s native token, ETH, on the main chain. This reduction in demand has led to lower transaction fees, measured in gwei, and subsequently, less burning of ETH. Currently, gwei sits at around 8, significantly lower than in previous times, indicating that at this level, ETH is far from being deflationary.\n\nRead more: Why Ethereum Gas Fees Have Fallen to Their Lowest Level Since 2020\n\nEthereum can shift from deflationary to inflationary due to changes in network activity and the balance of Ether burned versus issued. Under EIP-1559, when transaction volumes are low and the burned base fees are less than the Ether issued in block rewards, the total supply of Ether increases, making Ethereum inflationary. This dynamic demonstrates how Ethereum’s supply is not fixed but responsive to network usage, potentially impacting its value and scarcity when shifts from a deflationary to an inflationary state occur.\n\nMeanwhile, Ethereum L2s are ripping, processing 10 times more transactions than the main chain, while reaching an all-time high in weekly active addresses.\n\nGiven these levels of gas fees, the question arises: how much activity needs to happen in the L2s for ETH to become deflationary again?\n\nRead more: Horizontal Scalability Is the Solution to L2 Fragmentation\n\nA Complex System\n\nAnsgar Dietrichs, a researcher from the Ethereum Foundation, told Unchained that the deflationary mechanism of ETH is directly tied to its market cap and the balance between revenue and expenses. At low prices, the burning mechanism can exceed the issuance, making ETH deflationary. However, as the market cap grows and if revenues don’t keep up proportionally, ETH can become inflationary.\n\nThis bidirectional influence means that the market cap not only affects the deflationary or inflationary nature of ETH, but also that this nature, in turn, affects the market cap through investor perceptions and behaviors.\n\nTo reverse this trend and restore the deflationary status of ETH, a significant increase in activity on L2s is required. This means that more transactions and fees need to be funneled back to the Ethereum main chain to increase the burning of ETH. However, according to Dietrichs, research has not been done to assess exactly how much activity it would take. Neither the Ethereum Foundation nor researcher Justin Drake responded to several emails requesting additional information on how much L2 activity is needed to keep ETH supply deflationary.\n\nIn addition, Dietrichs pointed out that for any given revenue and issuance level, with constant investor preferences, there is essentially one specific equilibrium market cap that the market would trend towards. Any change in these factors—revenue, issuance, or investor preferences—shifts this equilibrium market cap point. This dynamic feedback loop suggests that addressing the deflationary challenge is not just about tweaking a few parameters, but about understanding and influencing a complex system of interrelated factors.\n\nAs Ethereum continues to evolve, the question remains: Can the foundational promise of ultrasound money be restored, or will Ethereum have to adapt to a new economic reality?\n\nLearn more: A Beginner’s Guide to Ethereum Layers: Data Availability, Consensus, and Execution"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxNZTV1bS1ZWWh2NEpOMlU1clNqX3Vub0VIdW1KUV9TSUc3eXRxU3FEeEFEUzBvUGxPY0hfWjNUOXhVd1dqZ3BRZ2JkUnBBQ2NaNnVxdXlzdDlSX3JkRl85eWRoZFlpOHFiNl92ZzZFLXhFYWxIVkVVYzJ0YjgwUFhab1BWcFdzRzJ4bnUwcWhXN21Id2hJcS1sRFBFemtrOV9nM2dWTEhXNmxfZ9IBrwFBVV95cUxNNUI1T25uVlM1OGZ4MDEyalY2VmFERzA0NlRlTVVSWVAzZFFfOWxFUEhDRmp5aTN3WWJqYWNDSy1BVnFBNS0zYzBQQWtkQWEtWkFKSkRkUFdlWDY4YWVMVzZzaXE2NlVIODlnRDFITmNmWDRlOGFXRmo1U1AyZ09XemkwYXNQQTc3LThrN3lIRG9zaFYyamxsdXVwX1ktcVhBYzY2enV1bFBkRnU0SFNj?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 May 2024 07:00:00 GMT",
        "title": "Why A Drop In The Price Of Ethereum Will Be Bullish Long Term - Investing Haven",
        "content": "There is a lot of fear for a decline in the Ethereum price. While the expectation of a drop is justified, confirmed by our latest Ethereum outlook research, it would not be a bad thing. Here is why an Ethereum price drop could be very bullish, long term that is.\n\nRelated – Can Ethereum Hit $100,000? An In-depth Analysis.\n\nThe way to think of financial markets, Ethereum being no exception, is in terms of structures. Particularly, chart structures with areas defined by support and resistance is the most simplified way to approach financial market analysis.\n\nEthereum’s 2024 support and resistance\n\nWe highly recommend not getting lost in the wild wild west of social media. Check this, it’s pure noise.\n\nEveryone has an opinion nowadays. Those who are able to collect lots of likes seem to be the smartest in the room. Very often it’s the exact opposite.\n\nIn order to understand the investment opportunity for Ethereum, we do the simplest possible thing, i.e. zoom out and remove all annotations.\n\nBelow is the weekly chart, no trendlines nor annotations.\n\nWhat do you see? How does it compare to the pattern in 2019?\n\nThere is tons of resistance even if ETH would rise to $4400. There is amazing support right above $1750, arguably in the $2200 area.\n\nIn case ETH drops in the coming months, it could be setting a gigantic cup and handle pattern. That’s not bullish, that’s a very bullish pattern!\n\nFrom our ETH predictions page:\n\nInvestingHaven’s Ethereum price forecast for 2024 is based on the bullish cup and handle chart formation. ETH should drop to its 50% Fibonacci level $2,250 in order to be bullish. A drop to $2,250 should offer an epic buy opportunity in 2024.\n\nEthereum’s 2025 chart pattern\n\nAs explained above, the $2250 area is a key Fibonacci level.\n\nNow, what follows may be counterintuitive to most, but it’s a reality – a drop may not feel good, but a drop to specific levels may be very good!\n\nProvided Ethereum respects $2250, on an 8 to 13 day closing basis, it will come with a very bullish outcome in 2025.\n\nA bullish cup and handle formation, which is what we forecast will be the outcome in case of an Ethereum price drop, has the intention to move much higher than resistance. For ETH, we expect a breakout to ATH, with targets well above former highs.\n\nFrom our Ethereum predictions page:\n\nInvestingHaven’s top analyst has a very bullish ETH forecast 2025. If the area $2,050 to $2,300 holds strong on a 3-week closing basis, ETH will resolve higher in 2025. The current long term bullish chart pattern has bullish targets in the $5,000 to $9,000 area provided support is respected.\n\nInvalidation considerations\n\nNow, there is always the possibility of an invalidation. In the case of ETH, what if it continues to rise to $5000 in 2024?\n\nWe don’t see this happening, there is not enough momentum in markets.\n\nMoreover, a rise to $5000 would qualify as a breakout, so the targets in that scenario would be much higher.\n\nIt’s one thing to rise to $5000, it’s another thing to continue to rise well above $5000.\n\nA rise to $5000 will be confusing for investors and traders alike – which decision do you take at $5000 in 2024?\n\nHowever, with a cup and handle formation, a rise to $5000 (which we anticipate will occur in 2025) will be very bullish. The take-away: it will continue to rise well above $5000.\n\nWhen does our bullish cup and handle forecast invalidate? If ETH will have risen well above $5000 by Sept of 2024. Unlikely to happen, also not good, long term, if it would happen.\n\n10-YEAR ANNIVERSARY OFFER: Go to our anniversary deals >> InvestingHaven.com celebrates 10 years. Temporarily, you can enjoy a discount on our premium gold/silver and crypto reports. Or you can become a VIP member. Receive our crypto FREE newsletter alerts Download 50 crypto investing tips"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxOeml5NHJWQmpJY0hPdWZQR1VWcXpuZ1N5TzZRUHZPZlpJNDFybzJmVmNzdzNQOHVfVWN4N0hkQ2VxdUJHMlpPVl9lNzB5TDEtcTB2dFJ3R2NDMjFvQXp0M0pJRVI3NjRydmJYU3lqZHZEeG9hMDdIY1hBX0ZhZVdqMTJDc9IBiAFBVV95cUxOTWdWeEJLaUVMSndJTmVucW9Hb01WdVpyWDJoTFc2dVVrNG1adkRqbnI4UEZwN3BVUF93d2s3ZG4yNzNtZ1VlWDNONXJ2eHNGLXJsUGFIeWttdHdjTFBvdHdBOG5BazhoR1hmUWloV094NllHNnF6MGFVRFhTMHVmRERDOEM3M0hK?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 May 2024 07:00:00 GMT",
        "title": "Exploring Ethereum's Staking Expansion: Potential for Growth and Innovation - CoinDesk",
        "content": "The next Ethereum upgrade, Pectra, will likely take place by the end of 2024, or in early 2025. One of the key proposals, EIP 7251, can provide a better UX for validators to earn staking yield. This proposal will increase the max effective balance of validators from 32 to 2048. Leading staking service providers, like Coinbase, are managing more than 130,000 validators already. The lift in maximum effective balance allows these providers to consolidate the number of validators and ultimately increase efficiency and lower the cost of operation."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPX1AyS09BNnFETzNJMF90UXE2R21rZUxrNjdDN0p3M2ZlS2FLeW9yS05Pdnp2SW1aTkNGcUYzdk5uQS1Vd2NtTjFxZ2pjYzZ5dnpDZzVCYmlnQUU3eFM3VzVHall6Y2FmR0NmeEo4enhiM1FYTnc2cXFfVTJudEY5VnBMMm9OVlRTWjJB0gGQAUFVX3lxTE1wTlNmUEJwRXdvRTlfMEQ1ZUUxWHBrWnVWVEF4SGhEQ1k3aUFGeE1TSnlCNnltQVZzWTU3elhvblRLX1g0ejFSYW13RjA3VTJqbGJTc0piQ29pZmxuWjlhNWtjdzlvZG5YWV9GTU5EOHFYanZyT3ZfY1BVWHlBZGFSZWxvbXR4M0dQOS0zWEJUWg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 May 2024 07:00:00 GMT",
        "title": "U.S. regulators shun spot Ethereum ETFs: What about ETH’s price? - AMBCrypto News",
        "content": "Expectations for an Ethereum spot ETF has gotten significantly low in the community.\n\nEthereum’s market performance continues to lag behind the majority of its peers.\n\nGary Gensler’s SEC is known for playing power games with the cryptocurrency industry, like taking their time to approve any kind of application for crypto products.\n\nThey eased up a bit this year with the approval of eleven spot Bitcoin [BTC] ETFs.\n\nEthereum Spot ETF, when?\n\nNow, all eyes have turned to Bitcoin’s immediate sibling, Ethereum [ETH]. Applications have been filed quite some time ago for what the community sees as Gensler’s only preferred crypto to have its own spot ETF.\n\nNone has been approved, and the SEC has been noticeably quiet about it all. Just a few days ago, Grayscale withdrew their application for the ETH ETF., and didn’t reveal their reasons for it either.\n\nThe lack of engagement from the SEC with applications from ETF issuers plus Grayscale’s withdrawal have fueled speculation in the community that approval is not on the horizon.\n\nThis sentiment is mirrored in the market, with outflows totaling $14 million last week, according to data by CoinShares.\n\nFurthermore, ARK Invest and 21Shares have revised their proposal for a spot Ethereum ETF, removing plans to engage in staking.\n\nIn the latest filing, submitted on Friday, the previous clause that allowed 21Shares to stake a portion of the fund’s assets through third-party providers was omitted.\n\nBloomberg ETF analyst Eric Balchunas mentioned that this update could be an attempt to refine the application based on possible feedback from the United States Securities and Exchange Commission (SEC)/\n\nHowever, there have been no official statements.\n\nBalchunas also proposed that this amendment might be a strategy to minimize the details the SEC could use to potentially deny the application.\n\nEthereum’s market movements\n\nTurning our attention to Ethereum’s market, the second-largest cryptocurrency in the world is not having a good time at the moment.\n\nThough all the other cryptos in the top ten have seen modest rises in the past twenty-four hours, Ether hardly budged. At press time, it is still way below its critical support level of $3,000.\n\nData from Santiment reveals that there is a lot of bearishness among Ethereum traders.\n\nTrading volumes have gone down, liquidations are low, but not because investors are staying put, but likely because they’re bored.\n\nUnlike Bitcoin, Ethereum hasn’t made any kind of major price movements this year. And the bulls are now unimpressed.\n\nAMBCrypto took a look at the ETH/USDt pair on TradingView and discovered extreme volatility with multiple ups and downs.\n\nThe highest peak approaches the $3,340 level, indicating strong buying interest, while the lowest nears $2,840, where selling pressure intensifies.\n\nThe price repeatedly tested support around $2,900 this past month, as indicated by multiple touches on this line but without actually breaking it, showing resilience at this level.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nRecently, the price shows a slight upward movement around $2,968, suggesting a tentative recovery or consolidation phase. But still, it failed. Ethereum was worth $2,958 at press time.\n\nGiven this context, the short-term prediction for Ethereum would lean towards a continuation of bearish trends."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxPaS1WeC1MdUcwNkhfcTVRQnlzVC1sakFQM1NCNVJrcUU0MkxleVRzTHpxbkdIZHl2ZGRFWWhxbnpCLTlSdXVObWR6UEh5SWdGYVZCTEFkcm80a3NMX0pZRUdtd2FNMHBNU3BKaHUxWlJ6Z0s4ejU0SkpKX2xRWkxLWE9R?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 May 2024 07:00:00 GMT",
        "title": "US indicts Ethereum validators for exploiting MEV trader - Protos",
        "content": "Anton Peraire-Bueno and James Peraire-Bueno, two brothers who operate Ethereum validators, have been indicted in the Southern District of New York on charges of wire fraud, conspiracy to commit wire fraud, and conspiracy to commit money laundering.\n\nThe charges related to a scheme that has been described as exploiting the ‘very integrity of the Ethereum Blockchain to fraudulently obtain approximately $25 million.’\n\nThe brothers allegedly worked together on a complex exploit that allowed them to take advantage of traders searching for ‘maximum extractable value’ (MEV) on Ethereum.\n\nBy operating multiple Ethereum validators, the brothers were allegedly able to submit blocks that included exploited transactions.\n\nAllegedly, once the brothers were aware that their validators would soon have opportunities to submit blocks, they would create ‘bait’ transactions that seemed to have significant upside for the MEV traders and wait for those traders to attempt to ‘sandwich’ their trades.\n\nThese sandwich bots will often look for transactions with the potential for arbitrage and place transactions that buy shortly before and sell shortly after.\n\nWhen the traders were baited into submitting these ‘bundles’ of transactions, the brothers allegedly submitted a fake signature to MEV-Boost Relay, which at the time resulted in the relays prematurely releasing the whole proposed block.\n\nThey then allegedly took advantage of the fact that they were operating validators to disassemble the block and allow the traders to still front-run. However, instead of buying the asset the MEV trader believes they are interested in, they actually sold that asset at the higher price.\n\nA rogue validator on Flashbot seems to be exploiting MEV bots. Over 25m USD already stolen.\n\n\n\nThe validator takes a sandwich bundle from the MEV bot and replaces the victim transaction with it's own that exploits the MEV bot instead.\n\n\n\nHere's how it works – pic.twitter.com/il3o9r41J1 — Mudit Gupta (@Mudit__Gupta) April 3, 2023\n\nRead more: How Flashbots is taking over Ethereum block proposals\n\nThis technique did potentially put their validators at risk of slashing, but the $25 million they were able to take outweighed the economic costs.\n\nThe indictment additionally details some of the steps the brothers allegedly took to plan for the exploit and to launder the funds once received. This allegedly included creating an ‘exploit plan’ that broke down the exploit into four steps:\n\nThe bait Unblinding the block The search The propagation\n\nAfter the exploit, the brothers turned to internet searches to manage the risk of their decisions, allegedly searching for:\n\n‘Top crypto lawyers’\n\n‘How long is US statute of limitations’\n\n‘Wire fraud statute/wire fraud statute of limitations’\n\n‘Money laundering statute of limitations’\n\n‘Computer fraud abuse act’\n\n‘Does the United States extradite to’\n\nIn order to help clean the funds they received from this exploit, the brothers allegedly transferred some to a ‘second-layer exploit address,’ which was subsequently frozen. Much of the remainder, totaling approximately $22 million, was converted to Dai, a stablecoin.\n\nAfter going through a lending protocol, this Dai was allegedly exchanged for Circle’s stablecoin USDC. These funds were then allegedly transferred to an exchange account controlled by Pine Needle Inc., the company set up by the brothers, before being transferred again to a bank account associated with their business.\n\nThis indictment represents the first time that anybody has been indicted in the United States on fraud charges related to changing the expected ordering of transactions on Ethereum.\n\nGot a tip? Send us an email or ProtonMail. For more informed news, follow us on X, Bluesky, and Google News, or subscribe to our YouTube channel."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxPVGNnWkViaWxFNUVMTGVpdFRfUFphRVBXbDlmNXJjbDUzUkxIM3JsWmlRUVA5QVZTdWVNTF9oQ3Blc0ZZd2xyR0ZDd055NXR5QldMT1V1U0xXYXNOZzgyeU8xX3BuOVdCWTNEcDlvbEZWVnJ6djhfSk9LOHJkaTlDck1RcXV5ZUc5NVQ3aElMaUZjdVHSAZsBQVVfeXFMUFVfMGdhblByQnNTUWE3SmExamlua19LeGMwenZUZEJQQkxpMFIyUlRUN2MxemUwckFybDJ4WDZJaEMwYzFyUFlZU19ka1ZXdEViV3dxSmVnbWZNRl91V3ZaRVlseHlvQU8wZEFsb0NuQ0VTWVlQeW5BNUhfRnRrNnNEYmxLa2FWM1JEUEJQMk5WLWhnd0R3cFJzdTA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 May 2024 07:00:00 GMT",
        "title": "Bitcoin and Ethereum Steady Ahead of U.S. Consumer Prices Report - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin and Ethereum, the two largest cryptocurrencies by market capitalization, were steady hours heading into another U.S. Bureau of Labor Statistics consumer prices report.\n\nThe new Consumer Price Index report will be released at 8:30 a.m. EST. For now, things seem pretty tame in crypto markets.\n\nBitcoin price sitting just above $62,000—up 0.6% compared to the same time yesterday. And the Ethereum price, which had sunk to around $2,900, was down 0.2% since Tuesday morning, according to CoinGecko data.\n\nEconomists have been forecasting that the market is in for another disappointingly high Consumer Price Index report today. The CPI is one of the key metrics that the Federal Reserve uses to determine whether it should lower the federal interest rate. But analysts have flagged that gas prices have been on the rise and prices have been inching upwards in the services sectors.\n\nAD\n\nAD\n\nIt's bad, but not necessarily terrible news, Michael Pugliese, senior economist at Wells Fargo, told Morningstar.\n\n“The trajectory is still down,\" he said, \"but it’s been a more gradual downward move relative to the expectations coming into 2024.”\n\nWhen the BLS issued its March Consumer Price Index report last month, it showed that personal expenditures in the U.S. had grown by 3.7%. The news that the U.S. economy had been growing slower than expected caused BTC and ETH to dip.\n\nBitcoin started the month having sunk below $60,000, briefly touched $65,000, and triggered the liquidation of hundreds of millions worth of derivatives positions along the way. More recently, the mix of macroeconomic factors—including the war in Israel's War on Gaza and slowed growth in major economies like the U.S.—has sparked pessimism in crypto markets.\n\nAD\n\nAD\n\nBut there's a little good news: Bitcoin billionaire Arthur Hayes said earlier this month that the bottom for BTC is already in.\n\n\"I expect prices to bottom, chop, and begin a slow grind higher,\" he wrote in a recent blog post. But he noted that he wasn't planning to add more Bitcoin to his bags.\n\n\"The recent intense puke out provides an excellent opportunity to unstake my USDe and spend synthetic dollars on high beta shitcoins,\" Hayes said. \"I’m buying Solana and doggie coins for momentum trading positions.\""
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxON2VIUDZZNk9HVkU5UzVWb0JTTUlGQXN3YjRFSzBNQklmN282VVdOckktY2djTHBaMU1kQW1ISUlHX1Fmc3hucFY3dGRRUko0V1dreUs2bkV2d3M2YUY1M3l0Rm5nQ0NiWHJERTJ2dmFoT09Xd3hRUlNBWUVPUHp1dmY5TFBXZDNuVzAzVW9Fd2dyT3VGWXNfVjVtR3Rqdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 May 2024 07:00:00 GMT",
        "title": "Cryptocurrency: “Mass Institutional Adoption” Underway, with Bitcoin, BlockDAG Network, and Ethereum Value Surge - Yahoo Finance",
        "content": "BlockDAG Network\n\nLondon, U.K., May 14, 2024 (GLOBE NEWSWIRE) -- Cryptocurrency is a growing interest for the world's financial institutions and massive investment establishments. Digital finance is no longer just about testing the waters and gaining a broader presence on online portfolios, they are an everyday reality for the majority of the world’s individuals and businesses.\n\nFrom its humble beginnings, the digital asset class has evolved into a global phenomenon. What started as an experimental concept has now become a burgeoning industry, with a market capitalization surpassing trillions of dollars. The proliferation of cryptocurrencies has sparked a paradigm shift in the financial landscape, offering decentralized solutions and disrupting conventional models of banking and commerce.\n\nCryptocurrency and the Mass Institutional Adoption\n\nIn recent years, the industry has witnessed a significant uptick in institutional adoption, signaling a seismic shift in mainstream acceptance. Institutions, ranging from hedge funds to multinational corporations, are increasingly recognizing the potential of digital assets as legitimate investment vehicles and store of value.\n\nThis mass institutional adoption is driven by several factors, including growing confidence in the technology, hedging against inflationary pressures, and diversification of investment portfolios. Moreover, regulatory clarity and enhanced infrastructure have bolstered both institutional and individual confidence, paving the way for broader adoption and integration of cryptocurrencies into traditional financial systems.\n\nBitcoin and other cryptocurrencies like Ethereum and BlockDAG Network have seen a surge in value this year, driven by recent developments in the financial sector.\n\nIn a notable move, some of Wall Street's biggest banks are collaborating with Visa and Mastercard to experiment with tokenizing their assets. This initiative, predicted by Citi analysts to grow into a $5 trillion market by 2030, involves banks like JPMorgan, Citi, U.S. Bank, and Wells Fargo, alongside Visa, Mastercard, and Swift. This could mean a significant step toward mass institutional adoption.\n\nTokenization of assets is considered the \"next generation for markets\" by BlackRock chief executive Larry Fink, who has embraced Bitcoin and cryptocurrency over the past year. BlackRock has quietly begun the second stage of its plan for a crypto-based \"revolution in financial markets\" by launching a tokenized private equity fund. Sovereign wealth funds are also showing interest in digital currencies, with potential trading activity expected in the coming months, according to BlackRock executives.\n\nStory continues\n\nBitcoin: Leading the Way\n\n\n\nAt the forefront of this cryptocurrency revolution stands Bitcoin, the pioneering digital currency that ignited the spark of decentralization. Since its inception over a decade ago, Bitcoin has captured the imagination of investors worldwide, becoming synonymous with the concept of digital gold. With its finite supply, decentralized nature, and immutable ledger, Bitcoin has emerged as a hedge against fiat currency devaluation and geopolitical uncertainty.\n\nIn March 2024 Bitcoin surpassed its previous all-time high, reaching around $73,000 per BTC, boosting the combined market capitalization of cryptocurrencies to approximately $2.5 trillion. Analysts speculate that former U.S. president Donald Trump and the Federal Reserve could trigger a massive price boom for Bitcoin.\n\nBlockDAG Network: A Promising Contender\n\nAmong the emerging contenders in the cryptocurrency space, BlockDAG Network has garnered attention for its innovative approach to blockchain scalability and efficiency and real-world use. Leveraging a Directed Acyclic Graph (DAG) structure, BlockDAG Network aims to overcome the scalability limitations of traditional blockchain architectures, offering high throughput and low latency solutions for decentralized applications. With recent funding of up to $25 million and a growing community of supporters, BlockDAG Network is poised to challenge existing digital projects and reshape the future of decentralized finance.\n\nEthereum: The Surge in Value\n\nAnother key player in the cryptocurrency market experiencing a surge in value is Ethereum, the leading platform for decentralized applications and smart contracts. Ethereum's native cryptocurrency, Ether, has witnessed a remarkable rally, driven by the explosive growth of decentralized finance (DeFi) and non-fungible tokens (NFTs). As the backbone of the DeFi ecosystem, Ethereum continues to attract developers, investors, and users, cementing its position as a fundamental pillar of the cryptocurrency industry.\n\n\n\n\n\nIn conclusion, the mass institutional adoption of cryptocurrency represents a pivotal moment in the evolution of finance, with Bitcoin, BlockDAG Network, and Ethereum leading the charge. As institutional investors flock to digital assets, this 2024 cryptocurrency market stands poised for unprecedented growth and innovation. While challenges and regulatory hurdles remain, the trajectory of cryptocurrency adoption points towards a future where decentralized finance becomes the cornerstone of global finance.\n\nRead About BlockDAG Presale:\n\nWebsite: https://blockdag.network\n\nPresale: https://purchase.blockdag.network\n\nTelegram:https://t.me/blockDAGnetworkOfficial\n\nDiscord: https://discord.gg/Q7BxghMVyu\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\nCONTACT: Brown Williams support (at) blockdag.network\n\n\n\n"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxPQ1JITF9ySVR5ckxlQTFaZU43RXpaYkhfYUZnNlZjQ0puWUsyVHI1OW9JY0x5dVB1RVBsSzdQcXhMOHRHU3lvN0cwbDVFY29OZ3NsU0VCa1hTNVhlU0tSelUwaW5YVHVsUGk4Q19vaUNFdmN2NnhpN1pjR245UHMzMVd2a05DU09kbVpmWXBuazRIZ9IBlwFBVV95cUxOaG41LTFYQkE4OUFXZG9maGVrdll1TDZ6R3Z0dGxzNnhTQkZPMXhTZTJvbFlBMkswVG9oMXh6LXhRVlI4U0xSdXF1OVUwZEg0enJUNFZzdjFSbkN0SjRLVVJTZzc3aGwzcFhnbER2Mmc1UmRqcDE0R040dTIzN1hXNDVkcmVXY19uc05yelpsRVduZlNST3Bj?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 May 2024 07:00:00 GMT",
        "title": "Ethereum headed to ‘the grave’ if SEC rejects ETH ETFs, say analysts - AMBCrypto News",
        "content": "ETH faces immense odds as the ETF deadline approaches\n\nAnalysts predict BTC or SOL as potential beneficiaries of ETH woes\n\nEthereum [ETH] could face a bumpy ride and even a massive bloodbath if recent analysts’ outlook comes true.\n\nAccording to crypto analyst James Van Straten, ETH could lose more ground against Bitcoin [BTC] if the SEC rejects spot ETH ETF applications at the end of May.\n\n“Ethereum looks like it’s going to the grave. A rejection of the spot ETF sends the ETHBTC ratio lower from 0.047 to 0.03 as a long-term projection.”\n\nThe SEC’s decisions on most ETH ETF filings are due between late May and August. VanEck and Hashdex’s decisions are due on the 23rd and the 30th of May, respectively.\n\nThese are the immediate dates the markets are tracking from next week. Straten projects that an ETF rejection could further lower the ETHBTC ratio.\n\nThe ratio tracks the value of ETH against BTC. If the ratio is 0.047, it means ETH is worth 0.047 BTC.\n\nIn an ETF rejection scenario, negative market sentiment and sell pressure could make ETH worth less in BTC terms.\n\nEthereum’s inflationary ‘state’ could worsen price prospects\n\nEthereum is currently “issuing” more ETH than it “burns,” making it inflationary. This is the complete opposite of BTC’s fixed supply of 21 million coins.\n\nStraten added that ETH’s inflationary nature and a dip in transaction fees after the Dencun upgrade tipped Bitcoin to lead on the fees front,\n\n“Bitcoin fees continue to outpace ETH, with very little activity occurring on BTC. ETH has now transitioned into an inflationary state (lol). Dencun upgrade reduces transaction fees, and the ETH burn rate increases the supply.”\n\nAMBCrypto evaluated ETH’s inflationary state using Ultra Sound data. It showed that 4.2K ETH was burnt in the past seven days, but 17.6K ETH was issued over the same period.\n\nThat means Ethereum issued four times the token burnt last week, a massive surge in supply that could drag ETH prices down.\n\nBitcoin maximalist Fred Krueger shared the same sentiment. Krueger stated that ETH was “headed lower” after Solana [SOL] outcompeted it through lower fees.\n\n“But then, they (Ethereum) get clobbered by Solana with the low fees. So, enter Phase 2. The new upgrade lowers fees and makes ETH inflationary again.”\n\nBloomberg ETF analyst Eric Balchunas maintained a pessimistic view on May approval for ETH ETF filings.\n\nIf rejection plays out, ETH could witness a massive bloodbath on the price charts and affect its long-term holders, who are yet to book profit.\n\nIt remains to be seen how BTC or SOL will benefit from ETH woes if the SEC rejects the ETFs starting next week."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMi2gFBVV95cUxNWFVEellZU1RPekZFR05tYjl5VzBvQlp0V3dxZmZLNGstbkdWcTJla0w2RFJqRHNoUlVIbDJUcUdQU1hEbjlsaVJjZEZzelA2UFFkRVgycjUyc2pDU2VtWFNTeGVlZEthTTdydU9uQlZiMDRCYnVwZHhFb3lJaGZ6TjliSkZKOW0tRDItU1Vkd2NkQ2R0MEJ6c2stczlZNV9wTXNIRGI1alEtbEJTSUloYTBfYUVhZjhOS1ZqTGduY2xJelN6VW5xNVVTQ05yekphQ2NieDBjaml5d9IB3wFBVV95cUxONEtKMV93QkZMUnNyWkp2WFlTTHRnMkJXeUN3bVpucXZMYzZqSGpqcGtwX2lyZ2c3Sl9XUkxndUdwNDB5Z19VdmpiVm1scVQzWVZ3R1A3Sjh3MER2NlZpOFVXRWNKcDFXaUpsNWhKVFA3RU5yMTJzVzJMVXhFQVBZY3FyMVRGZ21NVlI2b1o4QVBoS0FjdDFTby1KNndRYVRGbnBSdmtlMllKbVA5YUlDazBnc1RXZHF1TkU5SXN2S2ttbmdVV1JFTVJVS1R2WWdxVWZxNDdXZHlSV0xLNWdV?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 May 2024 07:00:00 GMT",
        "title": "Ethereum, Solana and One More ETH-Rival Will Benefit From Rise of Artificial Intelligence: Real Vision Analyst - The Daily Hodl",
        "content": "Real Vision analyst Jamie Coutts believes Bitcoin (BTC) and a certain breed of altcoins will be beneficiaries of artificial intelligence’s (AI) rise to prominence.\n\nThe former Bloomberg analyst tells his 16,200 followers on the social media platform X that AI will need a money system, and that BTC may be the best available form.\n\nHowever, Coutts says that stablecoins and the native tokens of smart contract platforms, such as Ethereum (ETH), Solana (SOL), and NEAR, are also well-suited.\n\n“AI needs a money.\n\nBitcoin is the best form factor, but it won’t be the only one. Stablecoins and native tokens for smart contract platforms will also see widespread use.\n\nSOL ETH NEAR.”\n\nCoutts recently said that artificial intelligence (AI) technology could send the total market cap of the layer-1 crypto sector soaring from the current $1.9 trillion valuation to as high as $25 trillion by 2030.\n\nThe analyst shares an excerpt from his firm’s Pro-Crypto November 2023 report that suggests AI will increase the demand for on-chain verification and authentication services.\n\nThe report also says that human-directed or autonomous AI agents could make use of smart contract platforms to exchange value, significantly increasing the growth rate.\n\n“By incorporating an ‘AI growth factor’ starting in 2026, which adds 10% to the annual growth rate, we can begin to gauge this impact. Initially, the effect is modest, but by 2030, AI agents could comprise over 40% of total daily active users (DAU). This obviously creates some rather astronomical valuations for the blockchain assets, which will benefit from the transaction fees generated by an increasing number of AI agents.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/studiostoks"
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMi4AFBVV95cUxPazNCeE1jLVhmNTNwenlPc2NwOWV5dktxSGV6X3Fob2ZiLTA5S1pCVzFlSEVUSldGSi04UDdGWWhoQUEwcjl2TVJmb0tmY1hCdU5sLW05bUE4UDUwaG5UTkJzUXBMOWg1ZFpSS3c2WU9MUC1lZFkzVzZYa2RIUEJoOUd1eFhkSEp4bDM2MmJjZGpFRTBtS3JnOU1aQVU0QTBtMHBFZFVCdW51a1g1ek9oWmkwaU94bFpCNDdSdTlyTktpbDNjQXFaMWNLS2MzV3VQc3lFNEtRRWUtRVZmV2VvdtIB5gFBVV95cUxNUWlIWU92eVlSSVdrU283RWR0YnpfcHl3NFpOaE1uaVJBeUtnTFdTZ1dmR0tOdUNMQmZBbGNoREF4ZDE4bmM4M2dVR3B5Wjdva1JTX3owNHdfWUhQTGxKd1RKV2pubE4tR0l5M0VCVnBUVFpTaUxHdTlHUXdlbzdLd3pBb2ZGWmgxdVFiVXU1dFo3YTd2VFlFcUpuTzYtRkc3N3VadXI5Q0d6UjJxNlNpUWNNVU0zNm9KMHJSQmlNS2c5clpKX3pJNmV4c3B2bXN3ajFvUWRlbnh4S2I3WjVXOTdQcnMtQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 May 2024 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: Altcoins rescued as BTC acts on CPI data - FXStreet",
        "content": "Bitcoin price could achieve a market structure change toward further upside if BTC holds stable above $65,500.\n\nEthereum defends $2,900, but 26% upside potential will only be activated after breaching $3,212.\n\nRipple price’s RSI must record a stable higher high above mean level of 50 for XRP to become attractive.\n\nBitcoin (BTC) price rescued altcoins on Wednesday following US inflation data, which was measured by determining change in the Consumer Price Index (CPI). Like the core CPI, the CPI came in cooler than previous months at 3.4%.\n\n❖ U.S CPI (MOM) (APR) ACTUAL: 0.3% VS 0.4% PREVIOUS; EST 0.4%\n\n\n\n❖ U.S CPI (YOY) (APR) ACTUAL: 3.4% VS 3.5% PREVIOUS; EST 3.4%\n\n\n\n❖ U.S CORE CPI (MOM) (APR) ACTUAL: 0.3% VS 0.4% PREVIOUS; EST 0.3%\n\n\n\n❖ U.S CORE CPI (YOY) (APR) ACTUAL: 3.6% VS 3.8% PREVIOUS; EST 3.6% — *Walter Bloomberg (@DeItaone) May 15, 2024\n\nMarkets like this so far with yields falling as well as the US Dollar (USD). Cryptocurrency assets moved higher, which means the data release was a much-needed catalyst.\n\nAlso Read: Bitcoin price restores early May highs as US CPI surprises to downside\n\nBitcoin price is a fraction away from market structure change\n\nBitcoin price is trading with a bullish bias, gliding along an ascending trendline with higher highs. After a sequence of lower highs, BTC could change the market structure if it manages a stable close above the $65,500 resistance level.\n\nThis is likely, provided BTC holders keep their profit appetite in check and buyer momentum increases. The higher lows on the Relative Strength Index (RSI) show a growing bullish trend. Traders looking to enter long positions for BTC may consider waiting for a higher reading on the RSI.\n\nA stable close above $65,500 on the one-day time frame would encourage more buy orders, with the ensuing buying pressure sending Bitcoin price to $70,000. Beyond this level, BTC would have a chance at taking back the $73,777 peak. Notably, the DXY Compare indicator is also dropping, which has often displayed a countercurrent flow against BTC price.\n\nBTC/USDT 1-day chart\n\nConversely, if traders book profits for the Wednesday god candle, Bitcoin price could drop. A slip below $63,354 would spook panic sellers like it did on two recent occasions, May 9 and 13, where BTC was rejected from the aforementioned level.\n\nIn a dire case, Bitcoin price could descend below the ascending trendline and ultimately fall below the $60,630 support level. Below this level, BTC could roll over to $58,000, or worse, $56,552, levels last tested on May 1.\n\nAlso Read: Will GameStop stock resurgence have downstream effect on BTC and alts?\n\n$3,212 level is critical for Ethereum price’s upside potential\n\nEthereum price is attempting to reclaim ground above the ascending trendline after a slip below on Tuesday. The governing chart pattern is a falling wedge, which is a bullish reversal technical formation. For the 26% target objective to be realized, however, ETH must manage a candlestick close above $3,212.\n\nETH/USDT 1-day chart\n\nOn the other hand, increased seller momentum could see Ethereum price drop. If the slump extends to close below $2,781, it would invalidate the bullish thesis.\n\nNotably, the RSI continues to chop sideways with equal lows as it remains subdued below the mean level of 50. This shows the bears still have the upper hand.\n\nAlso Read: Ethereum faces key resistance in attempt at short-term bull run, Solana flips ETH Mainnet in terms of revenue\n\nXRP bulls sitting on their hands\n\nRipple price remains range-bound as XRP bulls continue to sit on their hands. This is seen with the RSI stuck below the mean level of 50 since April 11. If the RSI records a higher high within the upper segment of the range, Ripple price could extend the climb.\n\nIn the meantime, Ripple price is likely to consolidate along the 50% Fibonacci placeholder of $0.4952, with the horizontal chop likely to continue.\n\nXRP/USDT 1-day chart\n\nConversely, enhanced profit-booking could see Ripple price wipe out the ground covered, slipping below $0.4952. In a dire case, XRP price could extend the fall to $0.4500, or worse, extend a leg down to $0.4188, levels last tested on April 13.\n\nAlso Read: XRP holds gains as attorneys debate relevance of discounts offered to Ripple’s institutional clients"
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxOUkRzelkyZE10UWw3WGEyWTQ5Q3BKRXpyWWw0Y0pwWjBqRUVOQmR6UVhYejVEZ2E2dVh3YlJVMzJaR1prRFlTeFVHdzRVR3JLMlI2OERRbU5FRDF3bHhyTkx4dUpNb19DSFRlNHN4RUpkS3ZPVTlmWnpfY2ozSHZwbjlib0VRcmlvUWJJazBzUXDSAZYBQVVfeXFMUEZ1Y1NaY2xaYnVHOG9XenpsbWVRR1EyMGRSNGh6MWdpM1N1UEpqelI5RnNpOUJ3M2tFcm1uTzZ0MFJqU0hMbjZkZ01SV0pQWC03ekg1UWZ0Q3dMWWJCVEY1a2lSLTRLM1ZhVEUwWlIyTTlNenM5T0F4NDFhYlNhdWtTTGM3MjhuaTNyeHhHdFU5ellpNXdR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 May 2024 07:00:00 GMT",
        "title": "Ethereum supply up by 100,000: What about ETH’s ‘deflationary status’? - AMBCrypto News",
        "content": "Ethereum loses ultrasound money status.\n\nTotal supply has increased by over 100,000.\n\nEthereum [ETH] has transitioned from being labeled “ultrasound money” due to the EIP-1559 upgrade, which has altered its deflationary characteristics.\n\nThis upgrade reduced Ethereum’s burn rate, leading to a slowdown in the rate at which Ether is removed from circulation.\n\nThe total supply of ETH has increased, and there has been a recent rise in the supply of ETH on exchanges. How does the supply on exchanges compare to the total supply?\n\nEthereum total supply and fees burnt display contrasting trends\n\nThe analysis of Ethereum’s supply metric on CryptoQuant reveals notable fluctuations in total supply dynamics over recent months.\n\nFrom November 2023 to early April 2024, there was a discernible decrease in ETH’s total supply, dropping from over 120.2 million to approximately 120.06 million, marking a reduction of over 100,000 Ether.\n\nHowever, beginning from the 19th of April, Ethereum’s total supply started to ascend, reaching around 120.1 million at the time of this analysis.\n\nThis recent increase in total supply is attributed to a decline in the fees burnt, which commenced following the Dencum upgrade.\n\nAn examination of the fees burnt metric illustrates a significant decrease, starting around March.\n\nDuring this period, fees burnt were approximately 6,000 Ether, contrasting sharply with the current value of around 890 ETH at the time of this analysis.\n\nThis significant reduction in fees burnt accounts for the observed uptick in Ethereum’s total supply, indicating a shift in its deflationary dynamics.\n\nAlso, the decline in fees burn is due to the decline in fees on the network.\n\nEthereum sees a decline in overall fees\n\nThe recent Ethereum upgrade has led to a reduction in transaction fees, both on the main network and its Layer 2 solutions.\n\nData from Coin98 Analytics indicated that Ethereum transaction fees has reached a yearly low, averaging 0.00017E, which translates to approximately $0.5 per transaction.\n\nThis fees marks a significant decrease compared to levels observed around February.\n\nFurthermore, analysis of the overall fees generated on the Ethereum network revealed a noticeable decline in recent times.\n\nAs of this writing, the total fees were around $3.6 million, contrasting sharply with the peak recorded in March, which stood at approximately $7.8 million.\n\nThis downward trend in fees commenced about a month ago.\n\nEthereum supply on exchanges climbs\n\nAnalysis of the Ethereum exchange supply indicates a notable upward trend, albeit with some interesting nuances.\n\nThe increase in exchange supply began before the total supply started to rise, with the growth, observed between March and press time, amounting to over 3 million Ether.\n\nAs of this writing, the total exchange supply was over 16.8 million.\n\nDespite this significant growth, the exchange supply remained relatively low compared to the total supply of Ethereum. This suggests that Ethereum is facing a manageable risk of oversupply.\n\nFurthermore, the proportionately low exchange supply indicates that the current price of Ethereum is not under immediate threat from inflationary pressures.\n\nETH continues to trend below $3,000\n\nAnalysis of the Ethereum price trend on the daily timeframe is reflecting a challenging period. Following its drop below the $3,000 price level in the previous week, ETH has struggled to regain its footing.\n\nAs of this writing, it was trading at around $2,900, experiencing a decline of approximately 1.5%.\n\nRead Ethereum (ETH) Price Prediction 2024-25\n\nBoth the Stochastic indicator and the Relative Strength Index (RSI) were signaling a negative price trend. The RSI, in particular, indicated a bearish trend as it remained below the neutral line.\n\nHowever, the current position of these indicators suggested a potential price reversal in the near future, with ETH poised for a possible uptick."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxQNHRSekVES1NDeTZDUDdzSmlpeUJXNXZhOXJVdnZvcUQtVDBzNjduclRuQVpoemVlMW5JOGFoOGhJWDRqWUpDUWJNYkRmc25uUDI5TXRMXzRUREZDMDduYjFZQ1dUei1YWUpoYVRFM01xM3lDU0FSUGFSYUtOZDZQYnl2aVByRk96WHRCOUdPVkdnQdIBlwFBVV95cUxQaHUxdnFBUlJPN2I5Ti1GNEJQRjhSZVRQb25LTnRDb3VUOFlNODN2bkxSdll5V0FQRWR5a1ZmdlBUb1I1TzVIbDMyY3YwMmZDeGdjZ0o2UzNReXFtN0w5VzRETjhJeFVqa1ptS3JSazluUEozNzk2Q2lxQkwxaGVGZ3NuN0ZobmN5Wi1XUkMzX1pmUUU4Uk1F?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 May 2024 07:00:00 GMT",
        "title": "Ethereum price prediction: Is $2500 the next bearish target for ETH? - AMBCrypto News",
        "content": "Ethereum showed a bearish market structure and could be headed for $2.5k.\n\nThe OBV slipped below a key level as selling pressure increased.\n\nEthereum [ETH] was in a bearish trend on the daily timeframe after dropping below the $3k mark six weeks ago.\n\nReports that the spot Ethereum exchange-traded funds (ETFs) applications in the U.S. were likely to face rejection would reinforce the bearish sentiment in the market.\n\nAnalysts projected far lower prices for Ethereum in the coming months in the event of a rejection. This lined up with the technical analysis, but it was unclear just how long the downtrend would persist.\n\nThe bearish market structure continued to hold sway\n\nA set of Fibonacci retracement levels were plotted based on ETH’s drop from $4093 to $3056.\n\nWhile this move did not shift the higher timeframe market structure bearishly, in mid-April, ETH fell below the $3k mark.\n\nThis swung the structure bearishly, and the OBV also fell below a significant level. At press time, the $3k resistance zone appeared strong, and the momentum was in bearish favor with an RSI reading of 40.5.\n\nThe Ethereum price prediction shows that a drop below $2.8k is likely, given the Fibonacci extension levels.\n\nThe 50% and 61.8% extension levels might be tested, but it is unclear if Ethereum would have a V-reversal or would consolidate at those levels.\n\nThe liquidity chart showed the short-term bounce was over\n\nJust over 24 hours before the time of writing, the cumulative liq levels were deeply negative. This indicated that the short liquidations outnumbered the longs.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nA few hours later, the price bounced from $2870 to $2990 to take out the late short sellers.\n\nAt press time, the cumulative liq levels were negative but less extreme. Hence, there is space for the prices to go further south. The $2840 region is a short-term Ethereum price prediction target.\n\nDisclaimer: The information presented does not constitute financial, investment, trading, or other types of advice and is solely the writer’s opinion."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxPOTVEUF9NODNIcFQtVUhaMXJCQ1VqVEhXMlZ3Qk5EbVlsLThIbkRLMU1GeHZiU21FNzBnSkhabDNrbE9RSGxrUkd6V2dLWjJJcEF6RkFxU2pRSnVkT0VvNmxCYUdSZHdTbktqZHhmLXhUa2N4eVlzcU5QWjdSX0lBMjc2dGFjZTZaYkxKWXR2RTFFMktrZDlsc1VhR3BFVVB0VUNiNnRR0gGrAUFVX3lxTE4zcUFyX2s5MEZoNXBEUm9jM2M1a1laNTBOWkd1aVBjQS1uTVVxVEg2bXVFV1IxYWU0bEp4cHl2SUU2WFJNaDZ1WFFnblVRblpLYjM4M3dBYkZxd3ZJZzRxa0dsakpIc2dXbjVjNnpNUWVVcFJaa3NqeWtib3p2a3YtVDFNa3hTdURvdTNpSEVGUlNDT1pIRWUxdUVZMFNpUFdoYXpPYlZTRHF1dw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 May 2024 07:00:00 GMT",
        "title": "Crypto Prices Today May 14: Bitcoin Crosses $62K, Ethereum & Altcoins Mirror Sentiment - CoinGape",
        "content": "The top crypto prices today witnessed a rebound as the Bitcoin (BTC) price extended above the $62,000 mark. Moreover, the Ethereum (ETH) gained notably and sustained the $2,900 level. In addition, other top altcoins, such as Solana (SOL), XRP, Cardano (ADA) also noted a significant uptick.\n\nMajor Crypto Prices Today\n\n1. Bitcoin Price\n\nThe Bitcoin price soared 2.57%, reaching $62,487.50 at the time of writing on Tuesday, May 14. On the other hand, it’s trading volume spiked 65.26% to $27.70 billion in the last 24 hours. Whilst, the crypto’s market capitalization stood at $1.23 trillion.\n\nadvertisement\n\n2. Ethereum Price\n\nThe Ethereum price gained 1.88% to $2,941.82 at press time with a market valuation of $353.40 billion. Whilst, ETH saw its trading volume jumped 53.71%, reaching $12.23 billion.\n\n3. Solana Price\n\nThe Solana price approached the $150 level amid the rebound frenzy today. The Solana price rallied 6.39%, settling at $148.59. In contrast, SOL witnessed a 69.38% hike in trade volume to $2.23 billion in the last 24 hours.\n\n4. XRP Price\n\nWhilst, the XRP price managed to attain the $0.50 mark again. The XRP price recorded a gain of 2.99%, reaching $0.5069. On the other hand, XRP’s trading volume shot up by 39.31% to $849.93 million.\n\n5. Cardano Price\n\nMeanwhile, the Cardano crypto price was up 2.42% to $0.4372 today. Whilst, ADA recorded a massive surge of 78.38% in its 24-hour trading volume, settling at $360.23 million.\n\n6. Dogecoin & Shiba Inu Price\n\nThe Dogecoin price rallied 9.83% to $0.1508 while its rival, Shiba Inu price soared 8.31% and traded at $0.0000236.\n\nAlso Read: Toncoin Price Prediction: TON Poised to Break Past All-Time High Amid TVL Growth\n\nTop Crypto Gainers Today\n\nBounceBit (BB): The BounceBit price rallied 27.8% to $0.4205.\n\nThe BounceBit price rallied 27.8% to $0.4205. Pepe Coin (PEPE): The PEPE price soared 21.5% to $0.00001018.\n\nThe PEPE price soared 21.5% to $0.00001018. Floki (FLOKI): The Floki crypto price surged 20.8% and traded at $0.0001939.\n\nThe Floki crypto price surged 20.8% and traded at $0.0001939. Grok (GROK): The Grok price rose 12.7% to $0.01201.\n\nTop Crypto Losers Today\n\nOmni Network (OMNI): The OMNI price lost 8.82% to $14.89.\n\nThe OMNI price lost 8.82% to $14.89. Lido DAO (LDO): The Lido DAO crypto price slumped 5.47% to $1.64.\n\nThe Lido DAO crypto price slumped 5.47% to $1.64. THORChain (RUNE): The RUNE price dipped 3.70% to $5.66.\n\nThe RUNE price dipped 3.70% to $5.66. Worldcoin (WLD): The WLD crypto price slipped 1.48% to $5.29.\n\nCelestia (TIA), Bitget Token (BGB), Core (CORE) also made it to the top crypto losers list today. Whilst, the rebound in the Bitcoin price could be triggered by the positive ETF flows. On Monday, May 13, the Spot Bitcoin ETFs recorded an influx of $66 million, marking a resurgence.\n\nAlso Read: Bitcoin Price Forecast: Will It Be $70,000 Or $56,000 This Week?\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxQNXFiWW9qUzhqRWdCcGZqbDc4WndLdVRYLXVmNlBlTnBrbllZX3RqWVo5WWYyQlp6OVNQb01CcHVUTzRWakl6a2hEWUNUV1VoQWVTZy1mUjQ5dFZlS0E4cXMtNGo2Sm0xcTlNc08xNi1VNzF6Qmg3SkFRZkpCdVViU2Z1Wnhqekk3Wi03Yk9PZEZMczZSQlpzR0I1V3nSAaIBQVVfeXFMTTJVd2plcDdJUkdnal9CRkJfYzV5Q2lTbk1aREctLWVGQkV0ZUU2LW1wTWd3UUhUOG9YcGd5RUMyT1FwQ1lRUmJmcU1kVWlWMUdwRTlKQmh4WlZOblpoZ0VfeTM1dTA0QU53QjU0amhQNktLMlBHMS1ONV80T3hya2FhNGlZazdOM29fbGxuZ3FCZlN4OEczcHpTNVJjNnYzenhB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 May 2024 07:00:00 GMT",
        "title": "Crypto Prices Today May 15: Bitcoin & Ethereum Suffer Amid Market Decline As Pepe Coin Shines - CoinGape",
        "content": "The top crypto prices today registered a decline as the Bitcoin (BTC) price extended lower than the $62,000 mark. Moreover, the Ethereum (ETH price struggled to sustain above the $2,900 level. In addition, other top altcoins, such as Solana (SOL), XRP, Cardano (ADA) also noted a significant drop.\n\nMajor Crypto Prices Today\n\n1. Bitcoin Price\n\nThe Bitcoin price dropped 0.95%, reaching $61,909.06 at the time of writing on Wednesday, May 15. On the other hand, it’s trading volume slumped 5.31% to $26.27 billion in the last 24 hours. Whilst, the crypto’s market capitalization stood at $1.21 trillion.\n\nadvertisement\n\n2. Ethereum Price\n\nThe Ethereum price dipped 1.12% to $2,905.97 at press time with a market valuation of $346.58 billion. Whilst, ETH saw its trading volume fell 1.14%, reaching $12.09 billion.\n\n3. Solana Price\n\nThe Solana price distanced from the $150 level amid the declines today. The Solana price slumped 2.68%, settling at $143.90. In contrast, SOL witnessed a 6.75% hike in trade volume to $2.47 billion in the last 24 hours.\n\n4. XRP Price\n\nWhilst, the XRP price inched closer to drop below the $0.50 mark again. The XRP price recorded a drop of 0.89%, reaching $0.502. On the other hand, XRP’s trading volume shot up by 25.49% to $1.06 billion.\n\n5. Cardano Price\n\nMeanwhile, the Cardano crypto price was down 1.81% to $0.4289 today. Whilst, ADA recorded a slump of 19.33% in its 24-hour trading volume, settling at $290.99 million.\n\n6. Dogecoin & Shiba Inu Price\n\nThe Dogecoin price plunged 3.04% to $0.1464 while its rival, Shiba Inu price tumbled 2.20% and traded at $0.00002305.\n\nAlso Read: Render vs Theta; Which DePIN Altcoin to Buy In May\n\nTop Crypto Gainers Today\n\nPepe Coin (PEPE): The PEPE price soared 7.47% to $0.00001092.\n\nThe PEPE price soared 7.47% to $0.00001092. Arweave (AR): The AR price rallied 4.01% to $40.93.\n\nThe AR price rallied 4.01% to $40.93. Wormhole (W): The Wormhole price rose 3.22% to $0.354=\n\nThe Wormhole price rose 3.22% to $0.354= Floki (FLOKI): The Floki crypto price surged 1.22% and traded at $0.000196.\n\nTop Crypto Losers Today\n\nRender (RNDR): The RNDR price lost 8.54% to $10.12.\n\nThe RNDR price lost 8.54% to $10.12. Chainlink (LINK): The Chainlink crypto price slumped 4.09% to $12.90.\n\nThe Chainlink crypto price slumped 4.09% to $12.90. Near Protocol (NEAR): The RUNE price dipped 3.97% to $6.99.\n\nThe RUNE price dipped 3.97% to $6.99. Hedera (HBAR): The HBAR crypto price slipped 3.11% to $0.106.\n\nMonero (XMR), Sui (SUI), Injective (INJ) also made it to the top crypto losers list today. The decline in the crypto market could have been triggered by the hot PPI data released on Tuesday, May 14. The latest report highlighted that the U.S. PPI for last month, i e. April, surged by 0.5%, which is substantially higher than what the market estimated.\n\nAlso Read: Solana Price Analysis: Flag Pattern Suggests Imminent Breakout Rally to $200\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxPNW96aEhsVDh1WkVWcTRHaDRZMS0wd3pmMWRqbFlYMXJma1RjTFhqLV9KRnEtd1JKWjJvdGZNQmFFX3Y1cXVRWjFpVVlZZGpUVy01ejk1VGpWRkNwZEMwR2xVckV3MW9EYWh6elZZSjZSWXF3bnpQd1BzUmdIT29IUEZOVzRVZFZZelJXVUlxX3lJbUpGenE4WjZoZmFBOGpFY19YRktR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 May 2024 07:00:00 GMT",
        "title": "Consensys is revolutionizing crypto with Smart Transactions on MetaMask - Cointribune EN",
        "content": "Wed 15 May 2024 ▪ 3 min read ▪ by Fenelon L.\n\nConsensys, leader in the Ethereum ecosystem, has just announced the launch of Smart Transactions, a new optional feature on MetaMask that promises users safer, faster, and cheaper transactions. This major innovation aims to solve recurring issues faced by crypto users.\n\nA New Era for Ethereum Transactions\n\nMetaMask users now have the option to enable Smart Transactions, a revolutionary feature offered by Consensys.\n\nAvailable as an option for users worldwide, this solution aims to optimize the user experience by improving transaction success rates, reducing gas fees, and protecting against MEV (Maximal Extractable Value) attacks such as front-running and sandwich trading.\n\nAccording to the analysis by EigenPhi, these forms of MEV have cost Ethereum users the astronomical sum of 124,000 ETH, or more than 350 million dollars, in the year 2023 alone. With Smart Transactions, users’ transactions remain confidential until their on-chain confirmation, making it impossible for malicious bots to exploit them.\n\nFurthermore, users benefit from higher success rates and reduced gas costs thanks to the presimulation of each Smart Transaction via MetaMask’s just-in-time simulation service. The real-time status of the transaction is also directly displayed in the MetaMask wallet, offering increased visibility and peace of mind.\n\nThese improvements build on a new mempool virtualization technology developed by Special Mechanisms Group, Consensys’ advanced research division. The whole package offers users more privacy, control, and visibility over their crypto transactions.\n\nConcrete Benefits for Users\n\nIn beta tests, Smart Transactions achieved a success rate of 99.5%, significantly higher than industry standards. Users save money by avoiding costly frontrunnings and failed transactions. They can also track the status of transactions in real-time directly in MetaMask.\n\nJason Linehan, director of SMG, emphasizes the importance for users to better manage their transactions sent to the blockchain. In 2023 alone, more than 52,000 ETH (153 million dollars) were wasted in failed transactions, while sophisticated bots profited from transactions after their submission.\n\nGal Eldar, executive director of products at MetaMask, acknowledges the complexity and frustration associated with submitting transactions on a distributed network. Smart Transactions aims to address these issues head-on.\n\nIn summary, with the launch of Smart Transactions, Consensys is taking a major step in its quest for a more efficient and user-friendly Ethereum ecosystem. By offering MetaMask users safer, cheaper, and more transparent transactions, this innovation could mark a turning point in the mass adoption of cryptos. It remains to be seen how its gradual deployment and impact on the market will unfold in the coming days.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxNZzM2QUQtcDdGM1dRdmo3bFM5SWNudk16T1JSN2o5U1BnYmI1OUdTZFVreERiV0hSQ09oMldBcF9fQU02U013Mk5HNWdqSUx4RG42UFoxaGw3QzZuaENGQ3lWRlM3WFBkbllsLXhDekEyWE9sTExtT3FScFFqbEcwaUladW90QUFYUXZUcVNadUNFR1Z4UGxjczBfcHJONGw2b2tKUEZHa194OEZKemFMZm5Ec1hSb3FQOG05Qnl3aTZCRmVRSS1xeWZaMWRSdE40VFZjeXNLWjZXamF4amdvVC1YWlVEZ1R2?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 May 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum, Dogecoin Dip As Wholesale Prices Breach Estimates: Analyst Explores Possibilities Of A Bitcoin Jump To $68K - Benzinga",
        "content": "Major cryptocurrencies inched lower on Tuesday on higher-than-expected wholesale inflation data for last month.\n\nCryptocurrency Gains +/- Price (Recorded 8:30 p.m. EDT) Bitcoin BTC/USD -2.10% $61,719.45 Ethereum ETH/USD -2.11% $2,890.58 Dogecoin DOGE/USD -1.67% $0.1467\n\nWhat Happened: World's largest cryptocurrency, Bitcoin slipped below $62,000, failing to sustain its gains from the previous trading day.\n\nThe market dip triggered $144 million in liquidations in the last 24 hours, with long liquidations touching $114 million. Bitcoin led the pack with $39.5 million in liquidations.\n\nThe price drop influenced the derivatives market's sentiment as traders taking short positions on Bitcoin sharply increased vis à vis those gunning for price increases in the last 24 hours.\n\nThe negative sentiment permeated as the U.S. Bureau of Labor Statistics reported a 0.5% increase in wholesale prices in April, higher than analysts' estimates, lowering expectations of an interest rate cut by the Federal Reserve\n\nTop Gainer (24 Hour)\n\nCryptocurrency Gains +/- Price (Recorded 8:30 p.m. EDT) Ethena (ENA) +4.10% $0.8947 Lido DAO (LDO) +3.11% $1.97 UNUS SED LEO (LEO) +2.61% $5.93\n\nThe global cryptocurrency market cap stands at $2.24 trillion, shrinking 2.12% in the past 24 hours.\n\nIn contrast, the equities market surged on the day. The Dow Jones Industrial Average added 126.60 points, or 0.32%, to close at 39,558.11. The S&P 500 gained 0.48% to end the trading session at 5,246.68 points. The tech-heavy Nasdaq Composite closed at a record high of 16,511.18, following a 0.75% uptick.\n\nInvestors chose not to overreact to the hotter-than-expected wholesale inflation data ahead of the more significant consumer price index data, slated to be released on Wednesday.\n\nSee More: Best Cryptocurrency Scanners\n\nAnalyst Notes: According to on-chain analytics firm Santiment, bearish sentiment for large-cap cryptocurrencies was on the rise, as they failed to recover strongly. The firm also blamed Coinbase’s recent downtime for fueling the FUD.\n\n😒 Crowd negativity is very prevalent among top caps as they have failed to show sustained rebounds to keep traders interested. #Coinbase's outages and withdrawal freezes appear to be exacerbating this. #FUD could be big enough to propel a rebound soon. https://t.co/lntwhLetB1 pic.twitter.com/TRmSEM4LhX — Santiment (@santimentfeed) May 14, 2024\n\nHowever, Santiment added that rising negativity may play a significant role in accelerating a market recovery.\n\nProminent technical analyst Kevin spotted a falling wedge pattern for Bitcoin, noting, \"BTC is currently compressed between a ton of support and resistance and it’s gonna pop one way or the other within days.\"\n\nThe researcher pointed out that an upward breakout from this zone may propel the coin to $68,400, exceeding which could lead to price discovery. To the contrary, a breakout to the downside might see Bitcoin plummeting to $50,000–$52,000.\n\nUpdate on #BTC daily chart. BTC is currently compressed between a ton of support and resistance and its gonna pop one way or the other within days. Even though its not well defined I guess you can say we are in this falling wedge type pattern or a bull flag. 100 EMA is below with… pic.twitter.com/ZM4csGBnBX — Kevin (@Kev_Capital_TA) May 15, 2024\n\nRead Next: Ethereum’s Underperformance Against Bitcoin, Solana Means It ‘Will Need More Demand Sources,’ Says Trader"
    }
]