[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMi7AFBVV95cUxOSDA0djYtVW9jRnJqRnJZd09ScHV3Yl9QT05GeHpjWUxFeVFWeGtCWkpvbzJJdVhjaU04bVQxZHhyNVBfdzJabWk2bE5RaVBxczRob3Y2b0FoYXhHTUloVGhYYnBvRXg3WjE2NXpZVFdqUXdoX0R3WTFtcC10YjZNbXM1cmsxRzlmczBWWmgxMjhLaUhNWU1XellPOWIxTnlGSHJ0NDVIUmt1MDExWm1oV3Q0b29uYTZGTHI5SEhfQ3B2ZG9YNVQ3VXU5NHo0eWgwMDRXaVExOHF3czQtMnNPLVRBRFFzclZJUFpsYQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Mar 2024 08:00:00 GMT",
        "title": "Nodle Introduces Click, The World's First Digital Trust Network, On Ethereum Through Rollup Integration - PR Newswire",
        "content": "Click Unlocks Truth in a World of Fake News with NFTs for Social Good\n\nDENVER, March 1, 2024 /PRNewswire/ -- Nodle (NODL), a long standing force in blockchain innovation, with 100,000 daily active users, proudly announces their Click camera app on Ethereum Layer 2. Click is the world's first Digital Trust Network to be deployed on Ethereum via a rollup, and marks a significant advancement in using blockchain technology for media authentication to fight fake news. Click is an innovative photo and video app which leverages the scalability and efficiency of Ethereum as an L2 solution. The NODL token is not yet available on Ethereum.\n\nClick runs on the Digital Trust Network which was developed by Nodle (NODL) and redefines the concept of trust via digital Proof of Authenticity. Through Click, users can securely capture, sign and share media content with real-time authenticated location, timestamp and device data, all on the blockchain. Click enables such data to be verified and transparently tracked in a wide range of applications, including journalism, elections, public safety, finance, proving identity, confirming deliveries, content creation, and many more emerging use cases for social good.\n\nBy integrating Click with Ethereum via a rollup, Nodle brings a very needed real-world consumer use case to blockchain and NFTs. This rollup enables Click to process transactions off-chain while maintaining the security and decentralization of the Ethereum network, significantly increasing throughput and reducing transaction costs.\n\n\"We are thrilled to be part of the Ethereum ecosystem and look forward to contributing to the community by bringing Click, the world's first Digital Trust Network, through a rollup integration and EVM compatibility,\" said Garrett Kinsman, Co-Founder of Nodle. \"With Click on Ethereum, content creators and influencers finally have a tool that enables them to publish their content on any existing web platform and trace ownership permanently.\"\n\nNodle's rollup enables:\n\nScalability: By processing transactions off-chain and bundling them into a single transaction, Click achieves significant scalability improvements, enabling high throughput and lower transaction fees.\n\nSecurity: Leveraging Ethereum's robust security model, Click ensures the integrity and immutability of transactions while maintaining user privacy through advanced cryptographic techniques.\n\nInteroperability: Click's EVM compatibility enhances interoperability across decentralized applications (dApps) and blockchain networks, enabling seamless asset transfer and data exchange between different platforms.\n\nAccessibility: The rollup makes Click's Digital Trust Network accessible to a broader audience of developers and users within the Ethereum ecosystem, fostering innovation and collaboration in decentralized finance and beyond.\n\nThe NODL token is not yet available on Ethereum but will become available in the coming months. In addition to bringing the NODL token to Ethereum, Nodle is actively expanding the Nodle network , which recently hit a new milestone of 100,000 daily active users. Nodle's SDK is currently being integrated into Click directly, which will quickly expand Nodle's reach and footprint on Ethereum.\n\nAbout Nodle and Click:\n\nThe Nodle network connects the world by using smartphones as nodes to create a digital trust network for social good. Nodle enables unique applications that can leverage the network for things like public safety, sourcing trusted user generated content, locating assets or accessing remote sensors. The Nodle network is decentralized, secure, private, and scalable making it perfect for digital witnesses, smart missions and micro-transactions. Anyone with a smartphone can join the Nodle network today. Download Nodle on iOS or Android and visit us at nodle.com .\n\nClick empowers creators and consumers everywhere to easily create authentic media content. Click is on a mission to combat misinformation and bring truthful photos and videos to everyone via an immutable digital proof of authenticity. Click makes it easy to confirm it's real and actually happened at a specific location, time and via a specific mobile device and camera. This is all made possible by ContentSign, Click's proprietary technology which proves the integrity of data from its moment of capture via blockchain. Click is the first app to leverage the Nodle network as an app for social good. Click supports the Coalition for Content Provenance and Authenticity (C2PA) and is a member of the Adobe-led Content Authenticity Initiative (CAI). Download Click on iOS or Android and visit us at clickapp.com .\n\nSOURCE Nodle"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMibkFVX3lxTE5mQm1HYllCMmVwWV9vRlNHSEFtam9GTWktNThtSmFWOHVSR0hIYTZTbTA0SzNxUW9pdHRLSE8wcTRScktldFBFTUVpb01DeHdHODJoYXRZTlRJYnlqdXpMUmNsck5FS2stdV9KQ3ZB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Feb 2024 08:00:00 GMT",
        "title": "Cheatsheet: Ethereum staking at record high, exchange balances at 6-year lows - Blockworks",
        "content": "This is Cheatsheet, a primer on what’s happening in crypto today.\n\nBitcoin is doing well but it smells like altcoin season out there — with a hint of wet dog.\n\nDog coins dogecoin (DOGE), bonk (BONK) and shiba inu (SHIB) lead the top end of the market with gains between 32% and 25% over the past day.\n\nBitcoin (BTC) and ether (ETH) had managed about 6.5% as of 7 am ET, still a sizable gain considering their scale.\n\nArweave (AR), the “permaweb” blockchain geared for decentralized file storage, continues to enjoy a moment, also climbing by a quarter.\n\nAR is the second-best performing top-100 crypto after PEPE over the past week. Arweave has tapped into AI hype, having just launched a testnet for an adjacent blockchain built to power decentralized computing.\n\nWhat’s happening on-chain\n\nEthereum holders on the whole continue to stake their ETH as prices reach nearly two-year highs.\n\nThere’s more than 31 million ETH ($107.1 billion) staked as part of consensus, up 7% in one month.\n\nMore than a quarter of the circulating supply is staked — over double the ETH on crypto exchanges.\n\nETH staked is at an all-time high, while exchange balances are at near six-year lows.\n\nThere are now almost 1 million validators on the network. About half are either managed by liquid staking protocol Lido or Coinbase on behalf of their users.\n\nBarring this Tuesday, there has been more ETH queued to be staked than unlocked every day this month. Another 13.4% of the supply (16.1 million ETH worth $54.4 billion) is kept in the network’s DeFi apps after dropping half a percent overnight.\n\nNewly-launched re-staking platform EigenLayer just surpassed Maker — the protocol behind major stablecoin DAI — now with 2.85 million ETH ($9.7 billion), a figure that tripled this month.\n\nRead more: EigenLayer’s $100M haul ignites series of adjacent investments\n\nEigenLayer could soon topple Aave\n\n88% of the SOL supply is still staked ($50.15 billion) but that number has slipped over the past two epochs (about four days).\n\nNearly 5% of SOL is locked in DeFi, up from 3.7% at the start of the month. Lending protocols Kamino and marginfi, alongside liquid staking app Jito, are gaining deposits.\n\nBitcoin’s budding DeFi sector could soon surpass Solana’s for total value locked, even if still getting off the ground.\n\nCrypto business\n\nVolatility came for crypto stocks yesterday, with only four rising across Wednesday’s session and into after hours trade.\n\nMicroStrategy is on track to open 15% higher than yesterday (its bitcoin is now worth $12 billion).\n\nCore Scientific, a bitcoin miner, may still stick the landing after bankruptcy, set for 9.5% higher.\n\nCleanSpark, another miner, corrected by 13.5% before adding 6% after hours.\n\nDespite its retracement, CleanSpark is still the best performing crypto stock this year, having added two-thirds to its share price (MicroStrategy and Marathon are second and third).\n\nNevada-headquartered CleanSpark is on an acquisition spree, buying up three Mississippi data centers with aims to boost its hashrate by more than 15 EH/s, the equivalent of around 2.8% to bitcoin’s total right now.\n\nHut 8 however has lost 34% year-to-date amid leadership changes and a “merger of equals” with US Bitcoin Corp. The dip especially hurts considering bitcoin has climbed more than 40% and threatens new all-time highs.\n\nRead more: New Hut 8 CEO prepared to make ‘hard decisions’ to nix inefficiencies\n\nOnly six of about two dozen crypto stocks have outperformed the S&P 500 this year.\n\nProShares’ fund offering short exposure to bitcoin, BITI, is one of the worst performing ETFs on the market this year, down 32%.\n\nMicroStrategy execs have sold $155 million in company shares this year, three-quarters coming from former CEO Michael Saylor.\n\nOn the ground\n\nLoading Tweet.. iykyk\n\nLoading Tweet.. Ether ETFs could impact Ethereum in very complicated ways\n\nLoading Tweet.. Should’ve spun up a DAO\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQZ0JqUWs5OUVSMWhMcndLY2s4enVJS2lhWHFrTWdzR1RrOUE2SG9iaWFCVDVCV3BfSXVrNzJkenQ1S1BjckNHdExETzBzeGp1VGJFTXctcFFEbVJFMVVSNW1XNllxV0VQWkJNQnVfcnBBOWJZNW8wWUFwYzFfR1VPdFJJaE9uOHliZWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Feb 2024 08:00:00 GMT",
        "title": "Spot Bitcoin ETFs are here and thriving. Is Ethereum next? - Yahoo Finance",
        "content": "As Bitcoin (BTC) celebrates its 15th birthday, it is revelling in a long-awaited gift: a bump-up in price and newfound liquidity, thanks in no small part to the US Securities and Exchange Commission's recent approval of spot Bitcoin ETFs.\n\nSpurred by a Grayscale court victory, The SEC's early January decision to grant 11 firms license to offer spot Bitcoin ETFs ushers in a new era for the oldest and most widely accepted digital asset by offering traditional retail investors easier access and giving it more mainstream credibility.\n\nWith the price of Bitcoin jumping more than 50% in 2024 and with Ethereum (ETH) and other digital currencies climbing back to near-record highs, the question now is what's next for Bitcoin, Ethereum, and other cryptocurrencies.\n\nIs it a store of value, like gold? Is it a digital replacement to 'paper money,' or fiat currency? Is it a way to help investors diversify their investment portfolios? Or is it the framework for ledger technology that will continue to re-define how digital information is stored, encrypted and valued?\n\nIn the short term, as well, other factors are driving the price of Bitcoin, including an expected “halving,” which cuts in half the amount of tokens that Bitcoin miners receive as reward for their work. The next halving, which happens once every four years is so, is due to occur in April.\n\nIn this segment sponsored by Grayscale, Yahoo Finance Senior Contributor Corey Goldman sat down with a who's who of Bitcoin experts, including Grayscale CEO, Michael Sonnenshein, CoinDesk Indices Managing Director Andy Baehr, Matt Kohrs, host of the crypto-focused Matt Kohrs show, and TechCrunch Senior Cryptocurrency Reporter, Jacquelyn Melinek, to break it all down.\n\nFor more expert insight and the latest market action, check out Yahoo Finance Live Monday through Friday.\n\nEditor's note: This article was written by Corey Goldman and Luke Brooks.\n\nVideo Transcript\n\nCOREY GOLDMAN: Bitcoin celebrating its 15th birthday this year with the SEC giving the digital asset the gift of additional credibility by allowing retail investors to invest in the tokens via spot ETFs. Indeed, the SEC's early January decision to grant 11 firms license to offer spot Bitcoin ETFs ushers in a new era for the oldest and most widely accepted digital asset by offering traditional retail investors easier access and giving it more mainstream credibility. The question now is, what's next?\n\nTo unpack what's in store for Bitcoin, Ethereum, and other cryptocurrencies I'm joined by several cryptocurrency experts, including Grayscale CEO Michael Sonnenshein, CoinDesk Indices Managing Director Andy Baehr; Matt Kohrs, host of the crypto-focused \"Matt Kohrs Show;\" and TechCrunch Senior Cryptocurrency Reporter Jacquelyn Melinek.\n\nStory continues\n\nSo some time has passed since the SEC gave license to these new spot Bitcoin ETFs. We know that. For starters, why don't we talk about why it was such a landmark decision? So maybe, Matt, you can talk about it first. You know, what do you feel really sort of pushed the ball forward in terms of this particular SEC stamp of approval?\n\nMATT KOHRS: I think from the retail side, it was more of the first opportunity that the average person now has the accessibility to protection from the government. And now with the continual debasement of the dollar, little protection from that. So I think it's exciting times that we got that regulatory clarity, very much thank you to Grayscale.\n\nCOREY GOLDMAN: Fair enough. And, you know, Jacquelyn, I mean, what are your thoughts? What have we learned so far, do you think, in terms of the SEC's move?\n\nJACQUELYN MELINEK: I think this was a matter of when, not if this will happen. I've talked to Michael in the past about this. And he said this was a 10-year long process waiting for this moment. The first spot Bitcoin ETF application was filed over a decade ago. And nobody really gave up from that point to this day. And I think in a way, it brought in so much more demand than we even anticipated.\n\nCOREY GOLDMAN: In terms of what the investor behavior has been-- I mean, you've seen that so far, I mean, what's that taught us? What have we seen so far?\n\nANDY BAEHR: You know, cryptocurrencies are a really unique asset class in that it started from the bottom. It started from individuals and enthusiasts. And it's kind of swimming its way upstream to institutional adoption. So the ETF is the first way at least for Bitcoin for people to have conversations with advisors and advisors to put Bitcoin into their portfolios in a way which reflects their kind of primary financial planning. So it's been a tremendous success.\n\nCOREY GOLDMAN: All music to your ears, I'm sure.\n\nMICHAEL SONNENSHEIN: Indeed.\n\nCOREY GOLDMAN: You know, I guess the question is, how much of that momentum have you been seeing? What was your-- what's your perspective?\n\nMICHAEL SONNENSHEIN: Well it is-- I really think crypto's mainstream moment, right? I think for so long, crypto had been outside of mainstream financial services. And the spot Bitcoin ETF wrapper now being in market, now having over 10 spot Bitcoin ETFs in market really does weave Bitcoin firmly into the fabric of the financial services landscape. So I do think it's a very, very important moment and one that certainly my team and a lot of folks around the industry are really excited about and wanting to now capitalize on that momentum.\n\nCOREY GOLDMAN: I mean, in terms of, you know, where things have gone, a bit of time has passed. Have there been any unforeseen surprises?\n\nMICHAEL SONNENSHEIN: You know, I think if anything, a lot of folks maybe thought that it would take longer to see the advised market come online. You know, here in the US, there's about $40 trillion of advised wealth. And so starting to see our clients increasingly move towards that financial advisor audience wanting to have those conversations.\n\nIt really has kind of been two buckets. And they've come online really quickly. One is I'm really scared, and I don't know what to do about this. But my clients are asking about it. Or it's two, I'm personally excited about this. What's going to be the best way to have that conversation with clients? What's the best way to integrate it into portfolios?\n\nCOREY GOLDMAN: And, Jacquelyn, what about you for your audience? You know, what are you guys focusing on? And what have you seen that's maybe not what you were expecting?\n\nJACQUELYN MELINEK: Yeah, I think this just adds a lot of legitimacy to the digital asset sector. I mean, having the SEC approve 11, not 1, 2, 3, 5, but 11 issuers is just like a massive move for the industry. And while there's still an uphill battle for future ETFs-- I'm sure we'll talk about that-- I think it just adds to the fact that this is getting Wall Street and crypto together and providing a bridge for the two.\n\nCOREY GOLDMAN: Now one thing you definitely see-- and I'm going to start with you over here-- I mean, that we've seen since the SEC's approval has been the shift in the price of Bitcoin itself. So maybe you talk-- tell us a little bit about what that means. How does the price of Bitcoin, how is that affected by what the SEC has decided to approve?\n\nANDY BAEHR: For sure. And, you know, just to touch on the earlier point, the market structure around the launch of the ETFs worked immaculately well. And it was probably-- I can't imagine a more difficult 11 different ETF launches, futures markets, spot markets, 24/7 intersecting with 9:30 to 4 o'clock. And everything went off without a hitch.\n\nI think the market gained tremendous confidence that the crypto-native market structure was there to meet the demand for the ETFs and continues to do so. That's critically important considering that banks aren't really participating in this asset class yet. So I think a lot of the strength has come from the fact that the network effect is now going to include ETF holders and their advisors. And that means there's just a wider audience.\n\nSo one of the long-term drivers of the price of Bitcoin is the network, how many people need it and for what they're holding purpose is and for what they're holding duration is. There are other macroeconomic factors which we think drive the price of Bitcoin. There are technical things like the halving coming up, which some people predict will put us-- some stability or some support underneath the price.\n\nBut for the newer investors, especially those who are working with advisors who have more of a long-term view of an allocation, they really should be able to gain some confidence from the stability of the first month out.\n\nCOREY GOLDMAN: Now, one of the things that we saw-- Jacquelyn, I'll just throw this quickly to you-- it was this by the, you know, sort of sell the fact kind of movement once the SEC made its decision or announced what it was doing. What do you attribute to that? I mean because at this point, it has recovered from what we can see. But what was going on in terms of the Bitcoin price itself? And what's next?\n\nJACQUELYN MELINEK: I think, you know, there's been over $40 billion already put into the Bitcoin spot ETFs across all 11 by market cap. And so as a result, I think you're going to see price go up. And similar to the comment about Bitcoin having supply and demand, constraints will exist there. And I think it's just going to be a pretty positive year for Bitcoin. There's so many points that are just signaling that the demand will continue to increase for Bitcoin, the ETFs, and just the market in general.\n\nCOREY GOLDMAN: The SEC's approval of spot Bitcoin ETFs is arguably given the digital currency a long awaited seal of approval, though it's also created new factors to consider like volatility and, of course, regulation. Or has it?\n\nQuick question around the room here. We're going to talk a little bit more about exactly what it means. It's one thing to actually have the SEC give it seal of approval. But there's a lot of stuff that goes behind the scenes in terms of what they actually now require. So I'm going to hand that one off to you to start. What's your view? I mean, how are things shaping up there?\n\nANDY BAEHR: Market structure, as we said earlier, has been performing spectacularly well. All of the Bitcoin ETFs are tracking the price of Bitcoin quite well. A lot of people don't understand, the Bitcoin market structure that exists in the crypto-native world is extremely robust and is made up mostly of people who used to be in traditional finance.\n\nSo there are futures markets. There are options markets. There are lending and borrowing markets. I think that the market structure has proven itself clearly robust enough to support spot Bitcoin ETFs in this country as it has in other countries for many years.\n\nAlso, about volatility, Bitcoin used to be about four or five times as volatile as, say, equities. Due to a number of factors, including the growth of the network, Bitcoin actually over the summer was a little bit more volatile than equities are during a turbulent period.\n\nSo the volatility has come down quite a lot as the market has expanded. I think that we have a very good asset to underlie an ETF market that the regulators should be very pleased with.\n\nCOREY GOLDMAN: Just a question related to that. I mean, in terms of what and when is going to be reported to the SEC because that's what they all want-- they want lots of information, you know, regular filings, all that. What are your thoughts, or what are you hearing about what people maybe have to do to prepare based on what's now been approved?\n\nMATT KOHRS: In terms of volatility, gold was volatile. A lot of the times, that's the biggest thing of like, How could this be a store of value? up until 2004 in November when we sold the gold ETF, right? Before that, it was common to have 20% drawdowns. Like, it was nothing.\n\nAnd then once again, as Wall Street actually entered in and there was more money, things settled down. And it started to act the way it was perceived to be. And I have no hesitation that Bitcoin will do the exact same thing.\n\nAnd then with the SEC in terms of regulations and paying attention, well, that kind of gets into the world of, are we talking on Wall Street or native crypto? Obviously, two very distinct veins. I myself prefer to be in control of my own Bitcoin. But I also understand how there's some hesitation that maybe don't fully understand the technological aspects that they would prefer someone to hold the Bitcoin for them, obviously, a trusted party.\n\nCOREY GOLDMAN: And, you know, maybe that's a great question to pass over to you, which is the focus here is on the retail investor.\n\nMICHAEL SONNENSHEIN: Sure.\n\nCOREY GOLDMAN: Right? So at the end of the day, how much do they need to worry about what the SEC is actually looking at versus the institutional players, everybody else behind the scenes?\n\nMICHAEL SONNENSHEIN: Well, this is something that at Grayscale we've been committed to for many, many years. GBTC, the Grayscale Bitcoin Trust ETF, actually became the first SEC reporting company in January of 2020. And so in many ways, the 10-Ks, the 10-Qs, the 8-Ks, all of the disclosure that we've put into those documents, that has really paved the way forward, not just for GBTC to come to market as an ETF but for all the other spot Bitcoin ETF issuers as well.\n\nAnd so we've really had a constructive dialogue with the SEC to continue to expand our disclosures, expand our reporting, and really continue to try and bridge that educational gap because crypto does move quickly. That's one of the things we've all been talking about today is really that the ecosystem continues to evolve, demonstrate its resiliency. And it's incumbent upon us as industry players to make sure that we're, you know, giving them a trusted source of information.\n\nCOREY GOLDMAN: Fair enough. And, Jacquelyn, I mean, from your perspective again, you know, just looking at your audience, how closely do we have to watch what the SEC is going to say once that reporting starts to come through?\n\nJACQUELYN MELINEK: I think it's extremely important to watch what the SEC is saying and also what they're not saying. I think the delays last month with the Grayscale and BlackRock spot Ethereum ETF applications speaks volumes by itself. They don't have to say much. And also, the decision, a 3 to 2 vote to approve the spot Bitcoin ETFs, was also them saying something that it was like a push/pull situation. Not everyone was on board with each other. And the conversations are still going to be an uphill battle.\n\nCOREY GOLDMAN: As we all know, Bitcoin is structurally different. It's different than other cryptocurrencies. The question is, you know, how has that impacted the NAV, you know, in terms of looking at some of these spot Bitcoin ETFs and even just other products in general? And how might it affect that net asset value of some other types of potential cryptocurrencies or spot ETF cryptocurrencies going forward?\n\nMICHAEL SONNENSHEIN: Well, I think one of the most important takeaways for this audience or really anybody thinking about Bitcoin is that there are multiple use cases. And there are multiple truths around Bitcoin. I'd say the narrative that is most solidified itself on Wall Street is probably looking at Bitcoin as digital gold or a digital store of value.\n\nBut that's not to say that other investors aren't also getting very excited about the potential for Bitcoin to be a transactional mechanism to allow us to move value at the same speed that we move information. Other folks may be attracted to Bitcoin for the underlying blockchain technology and all the new use cases that we're beginning to unlock around using that distributed ledger technology to really take care of things like ownership and provenance and authenticity.\n\nAnd that's OK. It's OK for it to mean multiple things to multiple people. And I do believe over time, it will mean even more things to even a larger audience of people.\n\nCOREY GOLDMAN: Matt, I'll throw that same question over to you.\n\nMATT KOHRS: I think from a philosophical standpoint, it's a store of value. I think from a technological standpoint, it's a protocol. But then I think from a realistic standpoint, it is the first globally accessible public money. Right now in this world, half of our population has no access to a bank.\n\nThis, obviously, with other technological developments globally allows them to not have access to a bank but allows them to be a bank. We are on the forefront of an exponential growth of what this means for the financial sector. We've seen this before historically. Money goes in the way of being the most efficient, the most usable. This is the next logical iteration that is being propelled because of the technology that we have, which is blockchain.\n\nCOREY GOLDMAN: And is the idea behind that-- and I'll ask you this question that-- you know, and again, some people will think of it as, OK, well, if a-- one Bitcoin is worth $50,000-- and then you have this halving coming up-- how does that work? Like, how do you actually create a whole ecosystem of a currency, a global currency, as you mentioned, around something that's very finite and static and--\n\nANDY BAEHR: Yeah, couple of--\n\nCOREY GOLDMAN: --has a really high price tag?\n\nANDY BAEHR: --interesting points there. When you say a Bitcoin is worth $50,000, there's two values there. There's Bitcoin, and there's dollars, right? So the value of Bitcoin being linked to dollars might be a way to express a view on Bitcoin. It might be a way to express a view on dollars.\n\nIf you think that dollars are going to come under a tremendous amount of pressure, you're going to hop over to Bitcoin for relative safety. But it can also have a macroeconomic interpretation because what? Dollars have inflation. Dollars have an interest rate. Dollars have policy that's driven by the Federal Reserve.\n\nBitcoin has none of these things, right? Its supply is locked in. There's no policy that's going to change the amount of supply. And that can be an attractive alternative for diversification or just for certainty. So for a small allocation to portfolio, it can actually have a lot of power. Add to that its diversification properties to traditional assets. Add to that its historical right skewed distribution. And suddenly, you might be asking your advisor, can we add more Bitcoin rather than should we be adding any at all?\n\nMICHAEL SONNENSHEIN: And I think, Andy, the other thing that's so interesting about that is that when you look at correlations amongst different asset classes, where you are today in terms of risk/reward on equities, on fixed income, on all the different places that investors have to park cash capital, it's become so concentrated. And so investors are looking to assets like Bitcoin looking to assets like Ethereum to provide that diversification benefit to their portfolios.\n\nAnd as more and more investors do this, they look back at their portfolios. And they talk to their advisor at the end of the year. And they question, well, did I beat the S&P 500 or not? But they also now may start having to ask themselves, well, am I behind from a returns perspective because I also didn't have that incremental additive of Bitcoin or Ethereum in my portfolio?\n\nCOREY GOLDMAN: So many of the SEC's approval of spot Bitcoin ETFs is only the beginning with many more types of digital currencies and assets starting with Ethereum, next up. In fact, Coinbase recently wrote about the SEC and the benefits of Ethereum and why a spot ETF makes sense. So what does the future investing in digital currencies and assets look like? I will throw this one over to you, Michael. What is your view?\n\nMICHAEL SONNENSHEIN: Grayscale operates Grayscale Ethereum Trust tickery, ETHE. It's the largest Ethereum fund in the world. We have applied to the SEC to uplist ETHE to a spot Ethereum ETF. I think when we examine the crypto landscape, very similar to what we saw in Bitcoin when I was being asked these exact same types of questions, Ethereum has a very, very similar setup in the sense that there is an inextricable tie, almost 100% correlation between Ethereum derivatives, right, the Ethereum futures market and the spot Ethereum market.\n\nAnd so the fact that we now have an ecosystem of Ethereum futures-based ETFs here in the US, there really is no reason to deny the uplisting or the approval of spot Ethereum ETF to come to market as well. Certainly, Bitcoin and Ethereum are the two largest assets by market cap within the crypto landscape. And so my belief, the Grayscale belief is that spot Ethereum ETFs are a matter of when, not a matter of if.\n\nCOREY GOLDMAN: I think there is maybe some discussion and debate about the when and if scenario. Maybe, Jacquelyn, I can ask you a little bit more about that and what your thoughts are.\n\nJACQUELYN MELINEK: Yeah, I actually interviewed SEC Commissioner Hester Peirce last month. And I asked her, of course, about the spot Ethereum ETF applications and what the timeline for that is. Of course, she declined to comment. But at the same time, she also said like when the spot Bitcoin ETFs were approved, it wasn't like the day of crypto dawned on the SEC. It was a big moment for the industry, yes. But that didn't mean everything was changing. There's a whole new leaf.\n\nBut at the same time, she said, we have to be prepared for when that day does come. And maybe it is a matter of when, not if. But the timeline for that is unclear. But I think the amount of demand that we've seen with the spot Bitcoin ETF will show that this is something institutions and investors want regardless if the SEC is in favor of it.\n\nCOREY GOLDMAN: I mean, there are differences. We know that. So I mean, it's not all going to be the same process necessarily of getting these things approved. Is that fair to say?\n\nMATT KOHRS: To my understanding-- and, obviously, the rest of the panel would love for you to weigh in-- is there a major difference with it currently being a security and not necessarily defined as a commodity when coming into the initial lawsuit that you guys had. It was Bitcoin, clearly, a digital commodity.\n\nANDY BAEHR: The market structure around Ethereum is just about as robust as Bitcoin's. In Canada, you've had Bitcoin and Ether ETF for several years now. I think that the idea-- and actually, the idea of a spot Ether ETF is great because it allows these investors and advisors to think about a completely different investment story with Ethereum as to Bitcoin.\n\nBitcoin being a store of value, a macro asset, having its own properties. And Ethereum really representing kind of the growth of all these projects, smart contracts, and adoption. They really kind of pair well together. And they work really well as educational tools, which in-- with two-- only two tokens show you the whole breadth of what digital assets can do.\n\nSo we can't wait for that to be the case. We feel that after that, after the two majors are available independently, people will want to move towards an index so that they can get all the next winners of the next generation.\n\nCOREY GOLDMAN: So, Michael, all of this really speaks to the various types of use cases, right? What about the average investor? I mean, how does an increasing roster, if you will, of cryptocurrencies, what-- how did-- how does that apply? And what do people do with that?\n\nMICHAEL SONNENSHEIN: Well, I think for the average retail investor, what's been interesting about crypto as an asset class-- I think we were talking about this earlier-- is it actually landed in the hands of retail before it landed in the hands of institutions, which it's never really been the case as other asset classes have been developed on Wall Street. And so there have been some retail investors that have certainly gone involved in crypto, buying Bitcoin directly, or perhaps even buying shares of GBTC in their brokerage account. That's now been mainstreamed not just to retail but to advised wealth and even institutions through the onset of Bitcoin ETFs.\n\nWhat we have been hearing, though, from investors, to Andy's point, is that they want to diversify now. They understand the use case of Bitcoin. They understand the role that it plays in their portfolio. And they're not only looking at assets like Ethereum and just kind of going down the market cap list of crypto assets. But then they're starting to think about, well, what else is out there?\n\nAnd so now that Bitcoin has kind of had its mainstream moment, a lot of those questions coming in from investors as to, well, what else should I be focused on? What other areas of crypto can I help even diversify my Bitcoin holdings across?\n\nCOREY GOLDMAN: Right, that makes sense. And, you know-- and when you had mentioned earlier about it sort of the idea of Bitcoin being this global currency-- so you have sort of two layers there. You have one where you have one digital currency that's actually something that could be used to buy and sell stuff. And then you have another type of currency or future types of cryptocurrencies where you're going to build out investment products. So what do you think is the more, I guess, the quicker route here? Like, what do you think is going to take off first?\n\nMATT KOHRS: I think it's comparing the equivalent would be two blue chip stocks, two different addressable markets, two completely different things. One is a store of value, you-- your own bank. The other one is a completely new vision on technology itself. And I myself, if available on the market, would happily invest in both. I don't think you have to pick between the two because I think strongly that both have a bright future.\n\nCOREY GOLDMAN: Jacquelyn, what are your thoughts?\n\nJACQUELYN MELINEK: I think there are separate groups of people in this. So there will be people who are in it for solely speculative purposes. There are people who are investing long-term. And then as Michael mentioned and Matt, that there will be people who will see the value of this and then explore beyond just buying Bitcoin. There are so many, like, use cases and sectors within this industry beyond just the token. And I think once people dive in and get a little bit of education, curiosity will grow.\n\nANDY BAEHR: Yeah, the-- that first intuition meeting, right? You can only kind of teach or provide intuition for kind of one thing at a time. And Bitcoin's a great place to start, right? So relatively simple blockchain. It's 15 years old. It hasn't changed very much. It kind of has one job.\n\nOnce people get over that and get their intuition together about how blockchain technology really works to the extent that it gives them confidence, moving into Ethereum and saying, oh, I'm going to use that same technology to build stuff on top of, I get that. And now I'm going to use that same blockchain technology to do entertainment or gaming or other kind of functions. And kind of, that's how the world changes a little bit, both in terms of finance and other things that impact. And when-- so when people say digital assets have the same potential as the internet or mobile telephones or things like that--\n\nMICHAEL SONNENSHEIN: I think Andy is spot on, no pun intended, with our conversation today. It is-- you know, I think there's a lot of questions from investors as to whether or not it's too late. It's too late to start learning. It's too late to start investing in crypto just because it's had the run up that it's had.\n\nIt is still in the early early, early days of this ecosystem. And we are going to continue to see new use cases come unlocked. As the monetary base within crypto becomes larger, that is going to kick off really a flywheel that will lead to development work, new addressable markets, new users. And that's the kind of stuff that I think gets everybody on this panel really, really excited. So it's not too late. And if you're confused, no better time than the present to really start bridging that educational gap.\n\nCOREY GOLDMAN: Michael Sonnenshein, Grayscale's CEO, thank you for joining us today. Andy, likewise, thank you. Matt, appreciate your time. And, of course, Jacquelyn, thank you for joining us."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNUk9rdmRrUTdlQXpTNG95ejBIbHJ1bnVSazZRbDdtTVV6b0RhRE80RDRHcTR3Umx2a3U2WVlZYzFvWUxPdnRDQXFUZjM1V1Z1THdVcVRpRFdyenAwYUU1SUZjbFdtUk5aS2xLajUtRTNYQ2xIN292enU5Zi0tT0xXMkVlNHhZMWVpNG9BMWhEcEZ4aGZyQU5oMw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Mar 2024 08:00:00 GMT",
        "title": "Ethereum’s Dencun Upgrade Can’t Come Soon Enough as Gas Fees Surge - Unchained",
        "content": "Ethereum users say they are spending upwards of $100 on gas fees for swaps and NFTs during peak times. The upcoming Dencun upgrade will lower fees, but there is a caveat.\n\nEthereum users are struggling with high gas fees as usage increases on the network.\n\nBitcoin’s renaissance\n\nand a\n\nspectacular rally\n\nin cryptocurrency prices is making life difficult for users of the Ethereum network.\n\nAs user demand and interest in both bitcoin (BTC) and ether (ETH) surges—on the back of the approval of spot bitcoin ETFs in the US and the potential approval of spot ether ETFs — gas prices on Ethereum are spiraling out of control.\n\nAt peak times, users are reporting paying over $100 in transaction fees for swaps, which is the exchange of one crypto token for another on the network. The average gas fee for a swap transaction is currently around $79, according to data from Etherscan.\n\nGas prices for swaps back above $100 lmao — Pentoshi 🐧 euroPeng 🇪🇺 (@Pentosh1) February 28, 2024\n\nThe “top gas guzzlers” are decentralized exchange Uniswap and Blast, an Ethereum layer 2 network that launched on mainnet yesterday. Respectively, they’ve earned $2.5 million and $1.4 million in fees within the last 24 hours, per Etherscan data.\n\n400 fucking dollars to migrate .1 ETH to Blast mainnet. It's so over. Pack it up. Ethereum is unusable today. pic.twitter.com/hZRrwRAMlz — Pop Punk (@PopPunkOnChain) February 29, 2024\n\nThe high transaction fees once again draw attention to Ethereum’s scaling challenges and how difficult it can be to onboard new users to the network during times of increased interest.\n\nEthereum is not blind to these issues, which continue to reoccur in bull market cycles. Ethereum has an ambitious multi-year roadmap to reduce transaction fees, increase security, and future proof the network.\n\nRead more: An Overview of Ethereum Scaling\n\n“Ethereum is trying to learn from this mistake of pricing away marginal users to other, cheaper chains,” said Luke Nolan, Ethereum research associate at digital asset investment manager CoinShares. “The proposed and implemented solution is to scale through layer 2 solutions, mostly rollups.”\n\nTwo key upgrades from the roadmap have already been implemented including “The Merge,” which was Ethereum’s transition to the proof-of-stake consensus mechanism, and the “Shapella” upgrade, which enabled the release of staked ether withdrawals. The next major upgrade is Dencun, which is scheduled for March 13.\n\nRead more: What Is the Cancun-Deneb (Dencun) Update on Ethereum?\n\nOne of the key introductions in the Dencun upgrade is a new transaction type called “blobs.” Ethereum layer 2 rollups currently post data to Ethereum using calldata. This is costly and makes up around 90% of the gas fees that rollups pay to post bundled transactions to the network. After Dencun, layer 2s will post the data to blobs, which are highly optimized and are much cheaper than calldata.\n\n“Overall, yes fees will reduce on Ethereum, but only for layer 2s,” Nolan said. “The general hope here is that layer 2s will become sophisticated enough over time, with seamless UX, high speed and low transaction costs … In this end state, Ethereum can compete with any new fast chain that comes out of the box because layer 1 continues to be the secure settlement layer, and layer 2 becomes the data availability layer that allows it all to scale to new heights.”\n\nUnder the upgrade, transaction fees on layer 2s will decrease between 10 to 100 times depending on the chain, said Nolan, adding that it could get very close to “Solana-esque transaction fees.”\n\nSolana’s Surge\n\nThis fee reduction couldn’t come soon enough for many users. Many Ethereum users, particularly those who trade NFTs, are talking about moving to Solana, which is a layer 1 blockchain that offers much cheaper transaction fees.\n\nIt costs 52 dollars to purchase a standard ERC-721 off Blur right now. It costs another 20-30 dollars per marketplace you want to list that NFT on. and that's with gwei relatively low (70) by bull market standards ETH does not make sense for the majority of NFT collections. — root (@rootslashbin) February 27, 2024\n\nThe average transaction costs for NFTs on Ethereum is around $140, per Etherscan, which is sometimes more than the cost of the actual NFT being traded. While on Solana, the average cost of a transaction is 0.000036 SOL, which is $0.0047, according to data from Solscan.\n\n“As of the last few months, a lot of attention has shifted to Solana NFTs, which has certainly taken some of Ethereum’s market share,” said Nolan, adding that Ethereum NFT trading is not back to the same transaction volume levels as last year.\n\nMost activity on Ethereum is centering around collections with high floor prices such as Bored Ape Yacht Club and Moonbirds, Nolan said. They have floor prices of $75,000 and $4,000 respectively. In these scenarios, a trader is unlikely to be phased by a $100 transaction fee.\n\nDaily NFT trade volume on Ethereum in millions (CoinShares)\n\n“Whilst on Solana I would venture to say that the activity for smaller collections (as well as big ones) has been picking up because transaction fees are 100x smaller on average and so the smaller value accounts have logically flocked over there,” Nolan said. “It has made for a much more enjoyable speculative playground for participants.”\n\nWeekly NFT volume on Solana in millions (CoinShares)\n\nThis is echoed by Anastasia Melachrinos, a DeFi product manager at crypto data firm Kaiko, who notes that new users are generally entering the blockchain ecosystem through centralized exchanges or directly via Solana.\n\n“It is without a doubt that high throughput upgradeable chains like Aptos or Solana will receive most of the non crypto native traffic, which is most of the world in the case mass adoption does take place,” said Sharvin Baindur, chief of staff at investment firm Saison Capital, who focuses on investing and supporting high performance and low cost blockchains.\n\nEven if gas fees on layer 2s are reduced to Solana levels, Nolan notes that Ethereum layer 2s still face challenges around fragmentation and poor user experiences, which can act as a barrier to capturing those smaller value transactions. On the flip side, Ethereum and layer 2s have a strong reputation and a very complete ecosystem, so once the execution cost is fixed the barriers to entry to those chains will be lowered, Melachrinos said."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQdmg0Tm5fbXk2cnJ2THlIdzRIUEpkdnFXWTdWY2VVcXlUTzVGYkZSTHNlMGVrbm5faUhRZTQ4UVpoQ2EyTkNFcnpjT19xcFAwbnBfTlVlajVZU1RnV0k0ejItem1ydVlCd1ROMmZtZzE0eFltYVNvTXV1YWZfeEFWQ3JKQ0ZCUEQzdnRrNnNEWlR2ajg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Feb 2024 08:00:00 GMT",
        "title": "Why Bitcoin, Ethereum and Dogecoin Are Trending Higher Today - The Motley Fool",
        "content": "Bitcoin's incredible rally to near-all-time highs is providing a rising tide lifting all boats.\n\nIt's been a wild and wacky few days in the cryptocurrency world. Megacap tokens are seeing continued volatility, with Bitcoin (BTC 0.23%), Ethereum (ETH -0.22%) and Dogecoin (DOGE 2.68%) still up materially from yesterday's close (4 p.m. ET). These three tokens rose 2.8%, 3.8%, and 12.9%, respectively, over this time frame, as of 1:45 p.m. ET.\n\nNow, these increases are markedly lower than the previous increases these tokens saw during yesterday's session. Bitcoin, largely viewed as the benchmark for the entire sector, surged to a multiyear high of more than $63,000 per token yesterday, before giving up a good chunk of these gains. Currently, Bitcoin continues to hover around the $60,500 level, still substantially higher than the $45,000 level the token started the year at and the sub-$20,000 level investors saw late last year.\n\nLet's dive into what's driving this positive price momentum among these three megacap tokens today.\n\nCapital inflows are the story to watch with these cryptos\n\nBitcoin's run toward its record price (nearly $69,000 per token in late 2021) has been remarkable. Initial interest around the world's largest cryptocurrency following the approval of spot Bitcoin ETFs by the Securities and Exchange Commission gave way to selling pressure, due to a range of factors, including FTX's liquidation of assets in a bid to make investors whole. However, a turn of events has materialized, with capital flows into spot Bitcoin ETFs surging more than $7 billion over the past two months, as institutional investors jump on digital assets in a manner reminiscent of the previous bull market rally.\n\nInvestors banking on a supply/demand dislocation in terms of Bitcoin have been proven right, with momentum driving additional interest in leveraged products such as perpetual contracts, which traders and speculators can use to bet on short-term spikes in a token's price. Notably, the funding rate for Bitcoin perpetual futures hit the highest level since the last bull market peak in 2021. This signals there's plenty of speculative capital being put to work, in addition to the billions of dollars of institutional capital flowing into Bitcoin alone.\n\nFor even more speculative assets such as Dogecoin, these sorts of trends are very bullish, and are a key reason why we're seeing even greater moves in meme tokens. Dogecoin's price action has largely depended on broader sentiment in this sector. And with Bitcoin remaining the benchmark asset others are valued against, a rising tide appears to be lifting all boats.\n\nAdditionally, speculation around when spot Ethereum ETFs could be introduced is building. If the wave of capital hitting Bitcoin flows into Ethereum as well, investors could be due for big upside. Accordingly, the market is doing what it does best, and discounting these potential catalysts ahead of time, with Ethereum getting to multiyear highs on this sector-wide momentum as well.\n\nWhere do we go from here?\n\nIf many investors were asked yesterday if Bitcoin were to hit an all-time high this year, the answer would likely have been a resounding yes. And given the fact that the world's largest crypto is now within 15% of its all-time high, there's certainly something to this thesis. I wouldn't be surprised if this period of consolidation we're seeing today gives way to another rally in the coming days or weeks that takes Bitcoin and its megacap counterparts near, or above, all-time highs.\n\nLong-term investors who have stuck with megacap tokens through the 2022 and 2023 bear market period have been rewarded. Now, the question is how much profit-taking will take place at current levels, and whether institutional capital flows and speculative activity can be enough to push these tokens over the top. Certainly, these are three tokens every investor needs to watch closely right now."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE93LWtvS1dPQm1RbFlaeEMtc2tVLW9uUmFZaWVyZG94d0l2REMtVG96Z0J5U3QtOWhVNnVMUElrYXQzblBBQnRaNzl6R0ZHR1lPT09Rb0dfcS1aeUlyMWI0RkRjZ1g2T2RqQXRjUUNEZzZhY2tqNUE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Feb 2024 08:00:00 GMT",
        "title": "Ethereum devs debate future of account abstraction - Blockworks",
        "content": "Ethereum’s Dencun upgrade is all set for March 13, as Thursday’s core developer call reiterated that client teams are all-systems-go for mainnet.\n\nAttention quickly returned to the candidates for inclusion in the next upgrade after Dencun, now referred to as Pectra — and specifically the Ethereum Improvement Proposals (EIP) that deal with issues of account abstraction.\n\nThe challenge: making the account abstraction roadmap more concrete.\n\nEthereum co-founder Vitalik Buterin, who rarely participates in core developer calls these days, kicked off the discussion by calling for “long-term goal alignment.”\n\nRead more: Ethereum Improvement Proposals to watch in 2024\n\nAside from a few “smaller things,” there are four main goals for an account system revamp, on Ethereum, Buterin said. It should:\n\nallow for key rotation and key deprecations; be quantum computer resistant; allow batching; allow sponsored transactions.\n\nThe first two goals are clearly not satisfied by Ethereum’s “end user account” (EOA) model, hence the need to move the entire EVM ecosystem towards smart contract accounts (SCAs).\n\n“One thing that would be good to avoid is essentially creating two totally separate developer ecosystems for smart contract wallets and for EOAs,” Buterin said.\n\nCore developers have previously identified a need to deliver feature upgrades that improve the user experience in the short term, even as they work to deliver on a multi-year roadmap for Ethereum.\n\nRead more: Ethereum devs consider ‘existential’ upgrade to the EVM\n\nEthereum’s first mainnet foray into account abstraction was EIP-4337, which debuted at the ETHDenver conference in 2023.\n\n“It was meant to be a testbed,” Ethereum developer Yoav Weiss reminded his colleagues on the call. “It allows [us] to experiment with account abstraction on different EVM chains without having to reach consensus on how account abstraction works.”\n\nSince then, the improvement has yielded millions of smart contract accounts. Layer-2 networks zkSync and Starknet have even enshrined their own 4337-based native account abstraction approaches.\n\nBut there’s a catch. These bespoke implementations caused wallet fragmentation — you can’t use Starknet’s Argent wallet on other chains — and potentially new attack vectors, according to Weiss.\n\nThe solution is to have a standardized and secure version that any layer-2 can use, enabling a better user experience across chains.\n\n“It’s something that’s going to happen with or without us, so we may as well help them get it right,” Weiss said.\n\nNext steps\n\nDevelopers focused on two competing EIPs that are being considered as a stepping stone towards a more comprehensive smart contract account system on Ethereum: EIP-3074 and 5806.\n\nCore developers Lightclient and Andrew Ashkhmin favored the former, while Weiss outlined some advantages of the latter.\n\nThe consensus was that more discussion is needed, but one thing is clear: Whatever option wins out for Pectra, it should keep open the path for further innovation.\n\n“We need to make sure no EIPs make it hard for us to do account abstraction later, and both of these [3074 and 5806] are fine in that sense,” Weiss agreed.\n\nDevelopers must weigh the need to improve Ethereum for its current users, while remaining aligned on the future trajectory of the network.\n\nAccording to Ashkmin, a software engineer with the Erigon client team, EIP-3074 is fairly EOA-specific but has “a pretty natural path to extend it to be smart contract focused as well.”\n\nThat’s a good thing, said Ahmed Bitar, a core developer at Nethermind, noting that EOAs aren’t going anywhere until “normal users” (think: your mom) can readily deal with smart contract accounts.\n\nButerin, who doesn’t make decisions but whose opinion carries weight in the Ethereum community, embraced that approach.\n\n“I think that’s exactly why 3074 and 5806 are being discussed,” he said. “In the long term, if there is an endgame where EOAs get removed as a protocol feature, that will not mean any kind of forced wallet change for users.”\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxNNzN4M2EwRXotaUdxYlFkOEV0QWpXRG5jNGZVbFJCM3B5SVdIejVCTXhibGZENTlqUEdBdEZyTERTenNVVFVndk9ES0c1aUdPWUs1a0lwZU1fTEhQTi1QMFhiUW5iVm9ibVk4aHUzdGxjbjBwbExaYVNVSUxKWjVoQzRrMVdJZmPSAY8BQVVfeXFMT3dPS08ydVZ2cXZXdm5IQ2FFLTNyTVVIMldjcjFhUGRFcDVJZjRCVTU2cXI0T0xBaTdNRGppclVmcWh0R0pKelV5Sk5OTGlqM1pYa2tSbXo3X1RyeFBZMDFUYWVXWVd4aU1Ycl95U1dmWXRsSUpST2hSYW9JMXBraEo2RkFlblpWeXd1djgxN0k?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Feb 2024 08:00:00 GMT",
        "title": "Top Dogs: Dogecoin, Shiba Inu and Bonk Outpace Bitcoin, Ethereum Gains - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe crypto markets are sizzling, but it's the dog-themed meme coins like BONK, Dogecoin, and Shiba Inu that are stealing the show, with massive gains in the last 24 hours.\n\nAs Bitcoin and other major cryptocurrencies experience a bullish surge, the meme coin phenomenon has grabbed some of the spotlight.\n\nIn an industry known for its volatility and unpredictability, memecoins have emerged as a unique and intriguing segment of the crypto landscape. And they can be the subject of some of the most intense volatility since their prices can be so dependent on market sentiment.\n\nInitially created as a joke or for fun, these digital assets have gained significant traction, becoming an integral part of the crypto culture alongside DeFi degens, NFT holders, Bitcoin maxis, and other subcultures.\n\nAD\n\nAD\n\nBonk (BONK): The hot thing on Solana\n\nLeading the meme coin pack is Bonk (BONK), the first dog-themed token on the Solana blockchain. In the past 24 hours, BONK has skyrocketed by 54%, climbing from $0.00001573 to its current price of $0.000024. The coin reached a daily high of $0.000025 just a few hours ago, and its meteoric rise shows no signs of slowing down.\n\nBONK's impressive performance extends beyond the short term, with a staggering 105% gain in the last seven days and a mind-boggling 3,240% increase over the past 12 months. This remarkable growth has propelled BONK to the top of the crypto charts in terms of price performance today, outperforming all of the top 100 digital assets by market capitalization.\n\nDogecoin (DOGE): The original meme coin isn’t done\n\nAD\n\nAD\n\nHot on the heels of Bonk is Dogecoin (DOGE), the OG meme coin that started it all. Over the last 24 hours, Dogecoin has surged by 33%, jumping from $0.098 to its current price of $0.13. The coin's weekly performance is equally impressive, with a 55% gain. It’s up 62.7% compared to where it was a year ago according to Coingecko.\n\nDogecoin's popularity has been fueled by high-profile endorsements from celebrities and influential figures such as Elon Musk, who has frequently expressed his support for the meme coin on social media. But it should be noted that Musk is currently facing allegations of insider trading, market manipulation, and fraud over the timing of messages he sent about DOGE on X and when a wallet supposedly belonging to him bought or sold the meme coin.\n\nShiba Inu (SHIB): The Late Bloomer\n\nRounding out the top three meme coin performers is Shiba Inu (SHIB). In the last 24 hours, SHIB has soared by 28%, rising from $0.00001094 to its current price of $0.000014. The coin reached a daily high of $0.0000146, demonstrating the incredible volatility that has become synonymous with meme coins.\n\nSHIB's recent performance has been particularly noteworthy, with a 45% gain in the last seven days. However, its 12-month performance has been relatively modest, with a 13% increase. This is largely due to the coin's underperformance in 2023, only beginning to gain traction in early 2024.\n\nThe current bullish trend in the cryptocurrency market, driven by institutional appetite for Bitcoin and Ethereum, has undoubtedly contributed to the rise of meme coins. As altcoins tend to be more volatile than Bitcoin, the gains and losses experienced by memecoins are often amplified. That’s why they’re cherished (and sometimes hated) by risk seekers like degens.\n\nIt's important to note that meme coins are among the most volatile tokens in the crypto ecosystem. That means a coin that surges one moment can crash in mere minutes, wiping out whatever unrealized gains a trader might have. Many meme coins enjoy short-lived success, mainly because they are created as rug pulls, or because, just like memes, people lose interest shortly after they go viral.\n\nEdited by Stacy Elliott.\n\nAD\n\nAD"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxQbGprRnB3bE1FdGp4YkZXRjZsM3c0YjFvN1NtVTQ5c3p3RkVYdGtScnJnTEtLS0RyMElvYWZsNXJ2Sm10eGlPcHF0Rko0VzlCVkt5S2xfeFZnVVkzd2FKMVlwaXZvZXdhRTRST2FwNmt2a29KalhRcUs0cXp3bmF3b2FLbC1vYVFjeGx1bENsdmhQaDltZ3gwM3liTkxvcXVlMGcwbWtnSVB0TnNRdHpvQTNn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Mar 2024 08:00:00 GMT",
        "title": "DeFi Made Easy: Robinhood Wallet Joins Forces with Arbitrum - CryptoGlobe",
        "content": "Robinhood is well-known as a financial services company that offers a trading platform accessible via a mobile app and website. Robinhood has gained popularity for democratizing investing by offering commission-free trades of stocks, exchange-traded funds (ETFs), and cryptocurrencies. This approach has made financial markets more accessible to a broader audience, including younger and more tech-savvy investors who might be interested in cryptocurrencies alongside traditional investments.\n\nRobinhood’s platform supports trading of several cryptocurrencies, including Bitcoin, Ethereum, and Dogecoin, among others. It allows users to buy and sell cryptocurrencies without paying a commission, similar to its policy for stock trades. This feature has contributed to the platform’s popularity among cryptocurrency enthusiasts and investors looking for an easy and cost-effective way to enter the crypto market.\n\nIn a groundbreaking announcement made at ETHDenver on February 29, Robinhood unveiled a strategic collaboration with Arbitrum, a leading Layer 2 scaling solution for Ethereum. This partnership aims to simplify access to decentralized finance (DeFi) and Layer 2 networks, promising to enhance the way Robinhood Wallet users interact with the crypto ecosystem.\n\nArbitrum is a Layer 2 scaling solution for Ethereum, designed to improve the scalability, speed, and cost-effectiveness of Ethereum transactions. As a Layer 2 solution, Arbitrum operates on top of the Ethereum blockchain (Layer 1) and aims to address some of the main challenges faced by the Ethereum network, including high gas fees and slow transaction times, without compromising on security.\n\nArbitrum uses a technology called Optimistic Rollups to achieve its goals. Optimistic Rollups essentially bundle (or “roll up”) multiple transactions into a single transaction on the Ethereum mainnet. This process significantly reduces the amount of data that needs to be processed and stored on the Ethereum blockchain, leading to faster transaction speeds and lower costs.\n\nThe collaboration between Robinhood and Arbitrum is set to open doors for Robinhood Wallet users, granting them seamless access to Arbitrum swaps through decentralized exchanges. According to Robinhood’s press release, this integration addresses some of the most pressing challenges in the crypto space: high transaction costs and slow transaction speeds that have hindered the broader adoption of blockchain technologies. By leveraging Arbitrum’s advanced scaling solutions, users can now enjoy the benefits of low transaction fees and enhanced speed on one of the crypto ecosystem’s most popular networks.\n\nLooking ahead, Robinhood and Arbitrum have committed to expanding their partnership to include support for cross-chain swaps and launching campaigns aimed at reducing the barriers to utilizing web3 functionalities within the Robinhood Wallet.\n\nJohann Kerbrat, General Manager of Robinhood Crypto, emphasized the critical role of Ethereum gas fees in securing the network, while also acknowledging the deterrent effect these fees can have on new adopters. He highlighted how Layer 2 solutions like Arbitrum, renowned for its total-locked value, address these concerns by making L2 access and transactions more user-friendly for those new to the web3 space. The Robinhood Wallet now serves as a gateway, removing the complexities traditionally associated with navigating the DeFi landscape.\n\nA.J. Warner, Chief Strategy Officer at Offchain Labs, the team behind Arbitrum, expressed enthusiasm about integrating Robinhood Wallet into the Arbitrum ecosystem. This move is anticipated to significantly impact the DeFi community on Arbitrum, bringing Robinhood’s vast user base into the fold with low-cost in-app swaps. Warner views this collaboration as a pivotal moment for web3 democratization, empowering users to delve deeper into the possibilities of decentralized finance.\n\nThe Robinhood Wallet, a self-custody solution, empowers users to take full control of their digital assets across multiple networks, including Ethereum, Bitcoin, Dogecoin, Arbitrum, Polygon, Optimism, and Base. By allowing users to hold their private keys, Robinhood ensures that users maintain complete ownership of their crypto assets. The wallet is designed to cater to a broad spectrum of users, from beginners seeking intuitive interfaces to experienced traders looking for advanced tools.\n\nThe Robinhood Wallet is available for download on iOS, with an Android version slated for release soon.\n\nFeatured Image via iOS App Store"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxObjQzdHQxcmw4UXNNVzNBUXdhSkc2UG43VkNsNGlGczc4UWdlb1YyVnoyeHRLUTJ3WnRQRFNQdy1WNXNqQTJfdGRDVFZEbEoyV2F5YlRscHVzX1Y4Y2s5RUt5b294Sm0xOHFac0xCX1pMSzlxMnN6a205NlZRbTZ6cHBXV0lKdVV6OFB4SGJteW9NNVVIdllTZTFZMl8xMUowdlJ6TUZqeEhMbDkwaS1GVmhua9IBuAFBVV95cUxPV1ZxdTVERG40N00yOTFNWkJvak5oTHJTc0UyOW8yY05aZEFGVE9SbTJxZ1M2Tk5tQWg3WjlmX0ZZUjdmSF95b1FFcFFfV0hQcjZhWncxNktZMXdGc2lUX0NhV1lQUUNvMUJSQWF5OURMVkM2WVpjWnVCdVNGUDdKSGtwYTJFVWdQMVI0bjF2SngzcDVfQkxzSXZoWG5CemJuc2ZLY3pWOFVZa2l6S3ZRcHJ6NGFlbXY0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Feb 2024 08:00:00 GMT",
        "title": "XRP Breakthrough: What's Next? Cardano (ADA) to Break $0.65 Level, Solana (SOL) Loses to Ethereum Massively - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nXRP is eyeing the next significant hurdle at $0.6. The recent trading sessions have witnessed a commendable performance by XRP, which has successfully breached several local resistances, positioning itself for a potential upward trajectory.\n\nAnalyzing the price dynamics, we observe a robust volume spike, which is indicative of strong buyer interest and may signal the start of a sustained bullish trend. This is a vital factor as volume often validates price movement, giving credence to the breakthrough and setting the stage for the next leg up.\n\nXRP's current trend shows it maneuvering above the crucial moving averages, a bullish indicator that suggests the asset has ample support for its ascent. The intersection of these moving averages has served as a springboard for the price, pushing it toward the $0.6 mark.\n\nLooking at the resistance and support framework, the immediate resistance is indeed at the $0.6 threshold. A decisive close above this level could pave the way for an extended rally toward higher resistance zones.\n\nAdvertisement\n\nConversely, if XRP faces rejection at this level, it might retreat to test the fortitude of its newfound support levels, potentially around the $0.55 to $0.53 range, where the confluence of moving averages may offer a buffer against a deeper pullback.\n\nCardano on verge of bull market\n\nCardano's native token, ADA, is showing signs of a strong bullish trend as it approaches a significant resistance level at $0.68. This move is particularly noteworthy as it positions ADA to potentially surpass the highest price point it has achieved in 2024. The trading community is attentively monitoring ADA's performance for a decisive break that could establish new benchmarks for the year.\n\nA detailed price analysis reveals that ADA has been consistently forming higher lows, which is indicative of accumulating strength and buying pressure. The recent uptrend has been supported by increasing volume, suggesting that the bullish sentiment is backed by active market participation. The $0.68 level is critical; a convincing move above this price could trigger further buying as it would confirm a breakout from the recent consolidation pattern.\n\nFrom a technical standpoint, ADA has sustained itself above both the 50-day and 200-day moving averages, which traditionally act as dynamic support levels. The convergence of these averages provides a strong base for the token, making the path toward the $0.68 resistance more attainable. A successful break above this threshold could open the door to testing previous yearly highs and, potentially, the all-time high (ATH).\n\nLooking at the current trend, the next major resistance after $0.68 is anticipated to be in the region of $0.75 to $0.80, where ADA may encounter a tougher barrier due to historical price actions. On the support side, the key levels to watch are $0.61 and $0.55, which have previously acted as both support and resistance.\n\nSolana's failed battle\n\nSolana has been a strong contender with its high-speed and low-cost transactions. However, recent market developments have seen Ethereum reclaiming its dominance, overshadowing the advancements of its competitors.\n\nA comparative price analysis shows that while Ethereum has been gaining in both market cap and price, Solana has been lagging behind. The SOL token is struggling to keep up, as evidenced by its performance on the price charts. After a period of consolidation, Solana is now grappling with resistance levels that were once strong supports, particularly around the $108 mark.\n\nAs of the latest trends, SOL is trading in a channel, with its immediate resistance near $120. The key support to watch is at $100, a psychological level that may dictate Solana's short-term price direction. Should this level fail, the next support is at the $89 zone, marked by previous price interactions."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxQd29pS0lGR1oxdEZnZmVqNzE2N1BhbUJhb2o2MHJ5V05OUEJ2UFRXaTg3WG9zU2lianJiY2plMndZRzBhbWFRMG41ZUtiYUJDcVVtbWlUTHU0WFdZVTk4TDBuMzNsajlpM3pmRlRHUE1EZWQybUhfVWd3d0JUd3RWbGlqUndqTkVSU1RKQlhn0gGWAUFVX3lxTE00UHRIdTJPOTk0TmhGWDVoWUtiNGpZSkV5TGdMVlFiZmlBeldncFU5UWRJbENSdHlDdUU1R3RVOURuWUlYSW8yX1RvTlhyTzE0V3J3MjVndXY5NlNaN2F1SG5zdklfaFhoTjRzNDN5WTRsMS12bTNkUHB6cUZCVmZJSEEyQm8wZ21QeDUtWkVoYnJMOS0yZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Feb 2024 08:00:00 GMT",
        "title": "Portal Airdrop Begins as Ethereum Gaming Token Hits $425 Million Market Cap - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nGaming token and cross-chain platform Portal made its long-awaited debut early Thursday, rewarding airdrop farmers and Binance token stakers ahead of launching staking rewards and rolling out other features.\n\nPORTAL, minted on Ethereum, is currently priced at $2.54 per token according to data from CoinGecko, with just over 167 million tokens currently on the market—nearly 17% of the total supply of 1 billion tokens. That puts the market cap at about $425 million as of this writing.\n\nNewly launched tokens are famously volatile, and PORTAL is down significantly from the initial price of $3.36 upon listing with crypto exchange Binance. That 24% dip in less than 10 hours is sizable but also typical for new, heavily traded crypto tokens. Nearly $500 million worth of PORTAL has already been traded.\n\nNot only is the Portal token now available to trade, but crypto users who participated in the project’s airdrop farming campaign on Twitter late last year can also claim their share of the initial airdrop. While some users on social media have griped about claiming issues and regional restrictions, others have shared that they received thousands of dollars’ worth of the gaming token.\n\nAD\n\nAD\n\nOther users sharing in the launch day buzz include Binance customers who staked tokens in reward pools to earn a share of 50 million PORTAL tokens allotted for the crypto exchange’s Launchpool campaign. More than $9 billion worth of crypto was staked at Wednesday’s peak, setting a new record for Binance’s launch platform.\n\nWhat is Portal? It’s billed as a cross-chain platform that serves as a central hub for crypto and NFT games across multiple networks, giving gamers one place to access games, transact funds, interact with their owned assets, and more. It’s set to support games on Solana and Ethereum scaling network Polygon, among others.\n\nThe team behind Portal includes employees from the crypto startup SuperDuper—which is behind the Creepz NFT project on Ethereum—as well as video game industry veterans from Rockstar Games and Electronic Arts. Prominent Hollywood agency WME is representing the project.\n\n$PORTAL staking coming soon! Stake for access to the Portal Launchpad. Gain VIP access to top-tier token presales, NFT mints, & drops from your favorite brands. 🚀 Stake more, get more access\n\n💥 Higher scores = elite reward tiers\n\n🏅 Snatch unparalleled Web3 rewards pic.twitter.com/pcmjmKolIq — Portal (@Portalcoin) February 29, 2024\n\nAD\n\nAD\n\nThe token is live after a months-long run-up: Now what?\n\nPortal has tweeted about special token staking benefits launching in the coming days, letting players stake (or lock up) their tokens within the platform to gain various perks, such as “VIP access” to token and NFT sales, as well as early access to upcoming blockchain video games.\n\nPortal will also hold more seasons of its engagement-driven “Crystal Dash” airdrop campaign to generate more user rewards. It will also launch nodes that users can presumably purchase to help support the network in exchange for incentives, akin to what the Xai gaming network on Ethereum scaler Arbitrum has done.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxNSTVqUWF1czVWR3h3ZnZaSU8wcDBEWEtrM00zMFRVUFl2UElxMU9DdXlNWEtTMjZyRTdOcUNOaDE5R2tsX2EzMEl1UmY3SnBTbHdvMDBBNEwyaC02LUp4LTRudWpkdGNyNFZuOGdEU1M0ZWM2TXVpVHhJWWw4R3R3ZldkUmI0VWVzSzRsV2FwLU5LLVBsWnc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Feb 2024 08:00:00 GMT",
        "title": "Ethereum: Your ETH Investment in Nov 2022 Would Be Worth This Much - Watcher Guru",
        "content": "The Ethereum network underwent a dramatic transition from the proof-of-work mining model to the proof-of-stake model on September 15, 2022. With an astounding 99.95% decrease in energy use, this much-anticipated change has ushered in a new era of sustainability and environmental friendliness in the blockchain sector.\n\nHowever, the second-largest cryptocurrency plummeted in 2022 following the FTX collapse, reaching a low of around $1,142 on Nov. 22, 2022. Nonetheless, ETH’s price has made significant gains in 2024.\n\nIf you had invested $1000 in Ethereum every month since November 2022, you would have purchased $16,000 worth of ETH till now. However, the portfolio’s value would have surged to $31,024.33, a spike of 93.90%. In other words, your initial investment would have almost doubled in 15 months.\n\nAlso read: Dogecoin Surges 31%: Can DOGE Reach $1 in 2024?\n\nCan Ethereum hit $4,000?\n\nIf Ethereum’s price is able to surge and sustain support around the $3,800 area in the coming weeks, some analysts estimate the next likely upside target could be around $6,835 based on the 1.618 Fibonacci extension level. This would represent the next key price milestone if the current bullish momentum is maintained. However, prices could also consolidate or correct before any potential further upside.\n\nOf course, if existing market conditions deteriorate again, Ethereum may see a downside. However, indicators presently favor the ongoing bullish structure persisting through February.\n\nAlso read: Cryptocurrency: 3 Coins To Watch As Bitcoin Eyes $60,000\n\nEthereum is up by 15% in the last seven days and 51% in the last 30 days. In the last 24 hours, ETH has spiked by almost 5%.\n\nSo, with ETH firmly back in recovery mode, early technical clues support the growing narrative of history repeating itself this cycle. With a major upgrade coming and the anticipation of the ETH ETF, Ethereum is poised for further growth."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxOTmplWGlIeWRFdzk2dUhlUXdWRzQ2R1M3TGIzV1FpNkdhaTB1S0xsMGZKUEZwaFZmLXluQUp3MmZMV2VDUnlTTUcyeUl1WlNFSjQ5OGZuSFhwS0s0ckZkSE52eGkzQ0t5WjU0MTZJMGZxOGxfRWJ2QXJhOTNYaGZOWEhFLTExcEo0Q0lrS2lfVVdWVVhy0gGaAUFVX3lxTE1VSEQ0cHBzQ2lQWERHdWtXWjZpdXBZa2NFaWZUR2xUakhIWVp0SEdfRzdGRmliZ1FUcHJlZGcwSl9UbWdKQ1dSeTBtMjdRYjRBdFVtMTg1THJsY2xTSWpocFhNbkpyNFBfTXhSRi1rTWtlalZQbVA1WVQ2cE1PWC13TFVJNXdUQTVEMVhLOEgtUVFRZmtmZWxhSmc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Mar 2024 08:00:00 GMT",
        "title": "Ethereum Price Prediction: Is ETH Headed for $5,000 in the Mid Term? - CryptoPotato",
        "content": "Renowned trader and technical analyst Michael van de Poppe believes altcoins are rising, and Ethereum is set to benefit from the upcoming upswing.\n\nVan de Poppe, who shares insights with his 697,000 followers on X, predicts a surge in the altcoin market, which could lead Ethereum (ETH) to potentially reach $5,000 as investors turn their attention away from Bitcoin towards altcoins.\n\n#Altcoin market capitalization is slowly moving upwards. The upside could be captured on Bitcoin, meaning a rotation towards altcoins. Therefore, Ethereum to $4,500-5,000 is likely, while altcoins will accelerate with 2-4x returns. pic.twitter.com/FKEaPpjrZv — Michaël van de Poppe (@CryptoMichNL) February 29, 2024\n\nIt’s worth recalling that layer-2s on Ethereum are experiencing a boom in Total Value Locked, pushing ETH to new peaks. Moreover, it seems the attention is shifting to the possibility of an Ethereum spot ETF by May 2024.\n\nThis week, multiple altcoins have exploded in price, especially meme coins like WIF and PEPE. Solana reached an intraday high of $134, gaining over 10% in 24 hours.\n\nPossible Bitcoin Correction?\n\nRegarding Bitcoin, Van de Poppe hinted at a possible correction following the substantial net inflows driven by institutional demand. He pinpoints possible support levels at $46,000 or $53,000.\n\nPoppe is not the only analyst warning about retraces. Daniel Yan, co-founder at Matrixport, warned against a possible correction of 15% by the end of April, which would be around $52,000-$53,000.\n\nSimilarly, well-known crypto trader Ali (Ali_Charts on X) reports a notable increase in profit-taking by Bitcoin whales, highlighting that over the past three days, they’ve sold off more than 80,000 BTC, equivalent to around $4.8 billion.\n\nAli also pointed out that the TD Sequential indicator has signaled a sell on the 4-hour chart for Bitcoin. He notes that since February 15, “every sell signal from this indicator has been spot-on, leading to $BTC price corrections between 1.50% and 4.20%.”\n\nHowever, only time will tell whether Bitcoin will find and sustain support above $50K or correct below that figure. One thing remains true —Bitcoin and the overall crypto market have had their best month in years, with BTC adding thousands of dollars to its price daily and most altcoins going vertical this week."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxNYVRWQ1QzZmYtNHFhOEVUT1UwcVRLaWNacGdPNlFkc1lPVk53Vms0MVBJa2Y4OUl6TGlqc2JXcXlQQ0twRHdsRHdORVNWZmdXeFhWVVQ4c3lBOXRJdWhlWEE4Q0RBanZkRWY0U0RYQ0pVR09rdjNJYlk5REZWQ0cwTmdlSS1aQWV3Y3pLSXRQbEN0VkVwN1BVai1rS2k?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Mar 2024 08:00:00 GMT",
        "title": "Ethereum memecoins go viral with $6.4bn traded in February - DLNews",
        "content": "Ethereum memecoin trading volumes surged by 61% in February, reaching over $6.4 billion.\n\nMemecoin market dynamics are influenced by their meme appeal rather than by utility, showcasing a unique aspect of crypto speculation.\n\nSmaller market cap memecoins on Ethereum, MOG and GROK, saw extraordinary gains of 920% and 172%, respectively.\n\nTrading volumes for memecoins on Ethereum soared by 61% in February from January, reaching over $6.4 billion.\n\nMemecoins are cryptocurrencies that draw their inspiration from internet memes, pop culture phenomena, and trends that have gone viral.\n\nThe coins hold no inherent value. Instead, their price appreciation is driven by the attention they garner from traders and speculators.\n\nThe prices of memecoins on the Ethereum blockchain with market capitalisations of over $1 billion exploded in February. Pepe, Shib, and Doge all soared, rising 292%, 57%, and 59%, respectively.\n\nSmaller market caps on Ethereum, MOG and GROK, rose 920% and 172% in February from January.\n\nPrice history of memecoin MOG\n\nMOG describes itself as “effortless cosmic domination and unadulterated success distilled into computer photons, wrapped into ERC-20 tokens, and placed directly on the Ethereum blockchain.”\n\nThe GROK memecoin was inspired by the release of GROK AI from Tesla CEO Elon Musk, but it has no official relationship with GROK AI. Rather, GROK, the memecoin, describes itself as “establishing a community of GROK AI enthusiasts who want to save the world and love making memes while doing it!”\n\nThis is all to say that memecoins are quite random and their price performance doesn’t come from utility, but rather from how well the meme behind the coin resonates with crypto traders.\n\nJoin the community to get our latest stories and updates\n\nIn December, memecoin trading was largely dominated by Solana, but now volumes have shifted back to the Ethereum mainnet.\n\nVolumes on Telegram trading bots, which are apps designed to simplify onchain trading by letting users trade on decentralised exchanges through the popular messaging app Telegram, have also shifted to Ethereum mainnet over the last month.\n\nThe top trading pairs on Telegram bots are generally memecoins, and so it provides insight where memecoin trading volumes might be.\n\nPrevious 30 days of Telegram trading bot volumes. (Whale Hunter)\n\nAlthough trading volumes are dominated by Ethereum, memecoins have still been successful on other chains.\n\nPopular Solana memecoin dogwifhat, WIF — named after an internet meme of a dog wearing a pink knit hat — hit an all-time high today of $1.10, giving it a total market cap of $1.1 billion. This is a 70,000% gain since the coin launched on December 13 at a price of $0.0015.\n\nBase, an Ethereum layer 2 blockchain, witnessed its native memecoin, Toshi—named after the cat of Coinbase CEO Brian Armstrong—reach an all-time high of $0.00018. The surge pushed its market cap to over $75 million.\n\nGot a tip about DeFi? Reach out at ryan@dlnews.com."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiU0FVX3lxTE10R3JKa3RDa19wcTJXdFVBVlJhcHNKeGdWSjhqRUdsQ0dvSWV0VzZXWFBaZVQxamJldGFmQnZ1UUpXLWVEZjNSSGJ0MjM2QlNSY3ZR0gFYQVVfeXFMTWxWNzEtU0JRQVdUZkl3VmEzbjlKQ0xOSWJiUEY1eEdsZVMxU3FOeGVfVkl2Ry1WTEt0NGtPVnpqaGwtN3RLNzkxNU1iS3FSUjFKc3pYUUxoQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Feb 2024 08:00:00 GMT",
        "title": "Ethereum NFT Card Game Parallel Evolves in Open Beta - NFT Plazas",
        "content": "Ethereum NFT Card Game Parallel Evolves in Open Beta\n\nThe Ethereum-based NFT card game Parallel extends an open invitation to gaming enthusiasts across the globe, transitioning into its Open Beta phase today.\n\nHaving previously been accessible solely in Closed Beta, this Sci-Fi card game steps up its ranks by promising to engage a broader audience, opening its competitive PC-based title to the general public.\n\nWith the introduction of five distinct factions, a new playable NFT card, exclusive cosmetics, and an array of additional rewards and adjustments, gamers can now choose their allegiance and craft a unique path to victory, blending skill, strategy, and creativity.\n\nA Rebirth in Card Games\n\nMerging the classic charm of trading card games like ‘Hearthstone and Magic: The Gathering’, Parallel introduces a distinct space-themed twist on Coinbase’s Layer-2 scaling network, Base.\n\nCelebrated for its innovative approach to the card game scene, Parallel has evolved through numerous extensive developments, which have led to the launch of its Open Beta debut:\n\nBaseline emissions have been raised by 15%\n\nProduction costs for ‘Echo’ cards have significantly decreased\n\nThe modifier for the highest rank has been enhanced\n\nPRIME bonus for ‘Prismatic Key’ victories increased from 35% to 50%\n\nPrevious in-game bug issues have been fixed\n\nMinimum standard specifications have been revised.\n\nOn top of experiencing a thrilling shift in the game’s dynamics, Parallel is notably introducing ‘Premium Battle Passes’, alongside ‘Masterpiece’ and ‘Special Edition’ raffles to offer exclusive perks.\n\nAdditionally, gamers can brace themselves for a card adjustment involving the iconic ‘Master Thief Kozo’, with an intriguing new NFT card in the mix.\n\nWhile the opportunity to claim the Closed Beta Season 7 ‘Battle Pass’ card and cosmetic enhancements comes to a close on March 8, a new door opens.\n\nNow, it’s time to step into a new realm of gaming greatness as Parallel’s Open Beta embarks on an intriguing, revamped journey.\n\nWant more? Connect with NFT Plazas\n\nSubscribe to our Newsletter\n\nJoin our Discord\n\nFollow us on Twitter\n\nLike us on Facebook\n\nFollow us on Instagram\n\n*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiW0FVX3lxTE5QWUx1ZExST3UtTVVMenFzRXZFR0xHajZpNWZ0LTRETVhGWG1kOHdIUE5iN3F3c2Y3SEtwTmhHWXVCN3R5WFJfSV9ENTJ6S3hUSkFicGdOT1MtQ1k?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Feb 2024 08:00:00 GMT",
        "title": "What Is EigenLayer? A Guide to the Decentralized ETH Restaking Protocol - Unchained",
        "content": "EigenLayer is an Ethereum-based protocol that uses a restaking mechanism to allow ETH stakers to reallocate their staked tokens to bolster security for other protocols built on the network.\n\nAn important part of the growth of Web3 is the development of innovative solutions that drive down the cost of building dApps without compromising security. EigenLayer is a marketplace that offers developers on the Ethereum network access to a marketplace of Ethereum stakers ready to provide validation services at significantly low costs.\n\nRead on to learn about EigenLayer, how it works, and its benefits and risks.\n\nWhat Is EigenLayer?\n\nEigenLayer is an Ethereum-based protocol that uses a restaking mechanism to allow ETH stakers to reallocate their staked ETH and Liquid Staking Tokens (LSTs) to bolster security for other protocols.\n\nStakers on EigenLayer earn extra restaking rewards for their efforts, while the protocols enjoy access to an already-built validator set.\n\nEigenLayer commoditizes decentralized trust by allowing protocols to leverage Ethereum’s highly secure trust network, driving down the cost of kickstarting protocols since they don’t have to spend on reward incentives to create a validator set.\n\nHow Does EigenLayer Work?\n\nEigenLayer enables users to repurpose their staked ETH to extend Ethereum’s security to other dApps built on the network.\n\nUsers can opt into EigenLayer and agree to grant additional enforcement rights on their staked ETH. The opt-in feature creates additional slashing conditions to meet the conditions of projects, such as data availability layers and bridges. The slashing conditions enforce honesty among the participants and ensure the security of the dApps utilizing EigenLayer is upheld.\n\nEigenLayer operates as a marketplace where developers get to incentivize validators to allocate their restaked ETH to secure their protocols. Alternatively, dApp would have to create a native token for the validators’ reward incentives and bootstrap their own trust network from scratch.\n\nWith Eigenlayer, developers can make it attractive for validators to choose their projects through attractive yields. The financial and time resources involved here are significantly lower than those involved in creating an entirely new trust network.\n\nTypes of Staking on EigenLayer\n\nUsers can choose between two staking options on EigenLayer: native staking and liquid restaking. Let’s take a look below.\n\nNative Restaking\n\nNative restaking involves having the Ethereum validator’s withdrawal credentials to the EigenPod, which is the protocol’s smart contract. Users must operate an Ethereum Validator node to participate in native staking.\n\nLiquid Restaking\n\nUsers can also choose to restake by locking their liquid staking tokens, LSTs, into EigenLayer smart contracts. The validator takes their LSTs already staked on protocols, such as Rocket Pool and Lido, and restake them on EigenLayer.\n\nBenefits & Risks of EigenLayer\n\nEigenLayer presents both benefits and risks.\n\nBenefits\n\nAdditional rewards for stakers: Restaking allows stakers to earn rewards from multiple protocols.\n\nTrust aggregation: The large capital pool improves the trust model by reducing the chances of and increasing the protocol’s corruption cost should a 51% attack occur.\n\nReduced capital costs: On the validators’ side, reusing capital across multiple services amortizes its cost. On the developers’ side, EigenLayer solves the bootstrapping problem by offering a large validator set at a comparatively lower cost (both financially and in terms of time) than building the set from scratch.\n\nSimplified network security: Restaking on EigenLayer presents flexibility to the Ethereum ecosystem, where projects can easily access and utilize the network’s security. Small projects no longer need large capital outlays to develop security systems as they can rely on Ethereum’s. An increase in the number of projects on Ethereum due to the lower entry barrier increases adoption and leads to further decentralization.\n\nRisks\n\nYield risk: The open marketplace may lead stakers to opt for the protocols offering the highest yields. This may lead to competition between projects to adjust their yields to attract stakers, leading to limited or no demand for projects that offer lower yields.\n\nCentralization: EigenLayer’s promise of increased yields may lead to ETH stakers redirecting their withdrawal credentials to the protocol. This risks the Ethereum network if bad actors identify and exploit EigenLayer’s potential vulnerabilities.\n\nSlashing: A staker agrees to the potential slashing of up to 50% of their staked ETH. Additionally, they have to comply with the protocol’s conditions. If the rules determine they exhibited malicious behavior, they stand to lose the remaining 50%.\n\nThe (S)Takeaway\n\nEigenLayer holds significant promise in benefiting multiple parties, especially developers looking to focus on their dApp’s features and trusting EigenLayer to provide validator sets. This can potentially lower the entry barrier and see more decentralized protocols built on Ethereum.\n\nHowever, EigenLayer also comes with a set of risks, including yield risk, centralization, and the potential for stake slashing. How the protocol will address those challenges will significantly impact its future."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxNMUh0Wkxwc0FfbFE3cWVXWmxGWC1yYUZuMzd5UWZUN3VaY2dBNjVPWDlBNWdwOWNOcGlhZ1dxVmxSTlJFQkFKc0QwclNrNzd3cm1TMGIwenlYTkxJVVphY3ItRzU2WmdCMnpnYklHdmMtVVJUUk1JcG9GenU5dFlWUUx0dkE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Mar 2024 08:00:00 GMT",
        "title": "Blast Mainnet Launch Boosts Ethereum L2 - Crypto Times",
        "content": "The Blast optimistic rollup, an Ethereum layer 2 solution, officially launched its mainnet on 29th February at 9 PM GMT. Since November, over $2.3 billion in ether and stablecoins have been deposited onto Blast, allowing users to earn staking yields and interest.\n\nThe Blast Mainnet is NOW LIVE\n\n\n\nEarly Access users can bridge to Mainnet and use Blast-native Dapps that don’t exist anywhere else👇 pic.twitter.com/mt5dJOADMp — Blast (@Blast_L2) February 29, 2024\n\nThe launch enables the first withdrawals from the network after deposits have been locked since Blast’s beta launch. The news comes after criticism from Paradigm’s Dan Robinson over the inability to withdraw funds.\n\nBlast aims to attract developers by allocating 50% of its community airdrop to mainnet protocols.\n\nA bonus goes to winners of its Big Bang competition that drew over 3,000 participating protocols.\n\nSome users found a way to deposit funds into Blast before the official launch by sending them to a smart contract address. Over $50 million has already been traded, mostly in memecoins like BlastCat. But depositing early carries risks as tokens can rug pull by removing all liquidity.\n\nNow live, Blast is the 7th largest blockchain and 2nd largest Ethereum layer 2 by total value locked at over $2.3 billion. Users can still earn Blast points until the token airdrop in May. Blast futures trading on Aevo implies a fully diluted valuation of $6.7 billion."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxNM2phdXo1N0lTOWRCbVRxeVM3aW53V2NQV3ExM3J5QkFISnhUaklzcDNuWUFGa2VMb0g3WU5vZmtpLTFtVXkxczVBam1wUEFrSnZBZDBsY0RrUmVxaWNnM2kyaWFHX0wtcmFkcVZyWnk2bTJQOHNtRTFHaUJlTjFjS3A4VDdFVnZsUWoybGZYSGRyanpFa2tiejlKbVVoQ215c1haOHZpNWtLMHJjNzdZQ0J30gG3AUFVX3lxTE5ra3VLc3VMRVBUUEI5V28tNWx4TTFmZml5eldOOVVWWHZVS2FubVEtQkIyTnlXMGFFZ0pDLXhvREpUZE84dEUwTnliRlI2NEpqdnZ2S2txcnVQTUxmcnB2NVBGbFhnalJlYzJaZE5BQk5EanNzUUFjSEJYVnpVOWZvMUFLRjhCZ3R4ZUdsOWNhZTE1TERlZ3QxcW82SFJkdURicFFWUHhXNVVFMUc0TTFpb3o1Nkp1aw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Mar 2024 08:00:00 GMT",
        "title": "Solana (SOL) Performs Enormous Breakthrough, Ethereum (ETH) Euphoria Continues, Will Bitcoin (BTC) Reach ATH in Next Few Days? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nSolana has broken through a critical resistance level, marking a potential trend shift for the cryptocurrency. The chart indicates a significant break of the upper trendline resistance, establishing a new movement scenario for the asset.\n\nSolana has showcased remarkable price performance, as evidenced by its latest rally past the upper trendline of its ascending channel. This breakthrough is a classical technical confirmation of bullish sentiment, and it suggests the possibility of a sustained upward trajectory. With SOL's price pushing through the $130 mark, the cryptocurrency has not only defied immediate resistance but has set the stage for testing further highs.\n\nLooking at the support levels, Solana's price is comfortably positioned above the 50-day (orange line) and 100-day (blue line) moving averages, which have historically acted as dynamic support in uptrends.\n\nThe immediate support level now stands around the $107 mark, which coincides with the previous resistance-turned-support trendline. The robust volume accompanying the breakout adds credence to the bullish outlook, indicating strong buyer interest.\n\nAdvertisement\n\nConversely, the next resistance level to watch is near the $140 zone, where profit-taking and psychological round numbers may temporarily stall the rally.\n\nEthereum looks unstoppable\n\nEthereum continues its meteoric rise, currently showcasing a price surge that has left investors and enthusiasts in a state of euphoria. However, amid the celebration, if a vigilant eye is cast toward the chart, signs of a potential bearish reversal loom, warranting a closer analysis of the second-largest cryptocurrency's extraordinary rally.\n\nEthereum's rally has been nothing short of spectacular, with prices breaking past resistance levels with apparent ease. As of the latest trading sessions, ETH stands tall above $3,500, yet this unstoppable rally may have investors questioning the sustainability of such growth.\n\nShould a reversal occur, the focus would shift to potential support levels that could cushion Ethereum's descent. The $2,695 mark emerges as a critical juncture, aligning with the 50-day moving average, a dynamic level that historically serves as a battleground between bulls and bears. A breach below this level could see Ethereum testing the $2,065 support, near the 100-day moving average, which may provide a stronger foundation for the digital asset.\n\nThe current trend indicates that while the market is riding a wave of optimism, caution is advised. Ethereum has defied traditional market expectations, but no asset is immune to corrections. The foreseeable future suggests that if traders begin to lock in profits, a bearish scenario could unfold, triggering a sell-off toward the identified support zones.\n\nBitcoin's strength is rising\n\nThe cryptocurrency flagship, Bitcoin (BTC), is showcasing a formidable display of strength on the market, with its price trajectory pointing sharply upward. As the market rides a wave of euphoria, the question on many investors' minds is whether Bitcoin is poised to reach new all-time highs in the near future.\n\nBitcoin's price has been on a relentless climb, and the latest candles on the chart reflect significant buyer confidence. Currently, the price has surged past the $60,000 resistance level, an important psychological barrier that could now be serving as a platform for further gains. The steep ascent is accompanied by a substantial increase in trading volume, indicating a strong conviction behind the move.\n\nThe moving averages - 50-day, 100-day and 200-day - are aligned in ascending order, which is a classic bullish signal. These lines are likely to act as dynamic support levels in the event of a price retracement. The 50-day moving average, in particular, has been a reliable support throughout the recent rally, suggesting that any dips might be viewed as buying opportunities by bullish investors.\n\nAs of now, the RSI is trending toward overbought territory, suggesting that Bitcoin is extending into an area where a reversal could occur. However, during strong trends, assets can remain overbought for extended periods, defying the traditional expectations of an immediate pullback."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQX1dDWWV3a0MtU0pRYmNlRzMyREtHaUJxRTY1SjhRYzlQYWt4ODZiYm9SLXZsZHJlTngyNjgxTkgwZFhJUDdCN25KdHFXUVBNRFdCaFZlLWU1cl9nbHRwOU02T3lkbm5DdlhiVEhVbUFGcnlWTEkzX1gyb1ZhTkRxTGRVUDFSbFc2T2c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Feb 2024 08:00:00 GMT",
        "title": "Bull Run Price Predictions: Ethereum (ETH), Solana (SOL), and Nugget Rush (NUGX) - The Cryptonomist",
        "content": "SPONSORED POST*\n\nTLDR\n\nEthereum breaks $3,100, driven by ETF hype.\n\nSolana and Nugget Rush show bullish momentum.\n\nNUGX’s play-to-earn model and NFT integration attract investors, while SOL may hit $195.\n\nFor the first time since April 2022, one of the top-ranking altcoins, Ethereum (ETH), has pushed above the $3,100 level. This rally represents a monthly growth of over 38% for the token. There are speculations that the hype surrounding a potential approval of Ethereum spot ETF in the US triggered Ethereum’s rally, especially as giant cryptocurrencies like Bitcoin (BTC) and Ripple (XRP) didn’t pick up on any bullish run. With ETH targeting ATH, investors are excited about the highs it’ll hit soon.\n\nThis excitement has triggered bullish expectations for other cryptos like Solana (SOL) and Nugget Rush (NUGX). SOL and NUGX have been bullish since last year, earning them the potential to deliver explosive prices with time. While Solana maintains its innovation, investors have been so excited about Nugget Rush’s upcoming launch after it finished its trending presale. These stellar performances of both altcoins have sparked predictions of a bullish price run for the year.\n\nLet’s explore price predictions for Ethereum, Solana, and Nugget Rush.\n\n>> Buy NuggetRush Now <<\n\nNugget Rush’s (NUGX) Early Stage Performance Foreshadows Incoming Long-term Uptrend\n\nThe play-to-earn gaming masterpiece Nugget Rush recently announced that its NUGX meme token will debut on top-tier exchanges after its ongoing presale event ends. The announcement has triggered positive sentiment for NUGX’s price potential, which will be revealed during the upcoming exchange listings. But investors are already wondering if Nugget Rush could be the best crypto to invest in compared to giants like Dogecoin (DOGE) and Shiba Inu (SHIB).\n\nNUGX’s price performance shows a lot of bullish momentum that isn’t showing signs of slowing down soon. When the token was listed for its presale, investors bought in at $0.010 in preparation for its launch. With subsequent presale stages, NUGX is sold at $0.018. During this surge, early investors could pocket considerable gains regardless of the stage they got in at. Although investors who bought at $0.010 are up 80%, holders who got in before the fifth presale round have pocketed over 20% of profits.\n\nInvestors are excited for the token to rally to $0.020 before listing on exchanges. The excitement has led to an impressive presale of over 200 million tokens, showcasing high demand for NUGX. The presence of large investors has also helped Nugget Rush raise a milestone sum of over $2.5 million, which will quicken its rise to rank among the top DeFi projects.\n\nNugget Rush’s mix of play-to-earn gaming, NFTs, and staking benefits positions the platform for quick adoption. Players can mine in-game assets to be exchanged for real value. Nugget Rush’s character-based NFTs can be traded for tangible value, while its rare RUSHGEM collection can fetch holders real gold, showcasing their high-value potential. By having these NFTs baked into the gaming experience, Nugget Rush is set to experience an explosive bull run, making it the best crypto to invest in for 2024.\n\n>> Buy NuggetRush Now <<\n\nEthereum’s (ETH) Push To Peak Prices Set Stage For Meteoric Surge\n\nThe price of ETH went through the roof lately, hitting a two-year high of $3,100. This surge shocked investors when top DeFi projects like Cardano (ADA) delivered little to no bullish momentum. Being the second-largest market cap cryptocurrency, Ethereum has achieved an impressive reputation as the best DeFi ecosystem. With the token’s price targeting new highs, analysts are confident that Ethereum could revisit its all-time highs.\n\nUpcoming impact events like the Dencun upgrade and the Bitcoin halving could push ETH higher. This surge above $3,100 shows that the hype surrounding agitations for an Ethereum ETF is already affecting the ETH. If approval for an Ethereum-based ETF falls through, ETH is expected to deliver new all-time highs as adoption skyrockets. Ethereum is already raking in the dividends of its transition from proof-of-stake to proof-of-work. If ETH continues on this path, it could hit $5,000 by the end of the year.\n\nSolana’s (SOL) Impressive 2024 Start Signals Potential Bullish Run\n\nThis year has been one of Solana‘s most expansive years. The platform’s popularity has heightened compared to last year, when it delivered over 1,000% growth. Since this year started, Solana has been on the front page of every positive crypto news, thanks to its affiliations with trending meme coins and airdrops from top exchanges. Solana’s reach has helped it stabilize despite its bearish correction at the beginning of February.\n\nAlthough the token surge has slowed compared to last year, investors are confident that SOL could rally higher, following the momentum that the Bitcoin halving will introduce into the market. In addition to an already bullish path, Solana-based memecoins have been gaining pace for a while. Dogwifhat (WIF), Bonk (BONK), and Myro (MYRO) have been hinting at an incoming bull run that would reflect on SOL. According to experts, SOL might hit $195 by the end of the first half of this year.\n\nFinal Thoughts\n\nNow that events surrounding ETH are pointing towards bullish prices, Solana and Nugget Rush are following suit. Solana is set to skyrocket, according to her recent performance. Despite being in its early stages of development, NUGX has been pumping for months courtesy of its mouthwatering offerings. Not only has the coin set record impressive growth, but its momentum has stayed solid. NUGX’s exchange listing could deliver life-changing returns to investors, as they’re known to pump the prices of tokens to new ATH. These benefits are what make Nugget Rush the best memecoin to buy now.\n\nVisit NuggetRush Presale Website\n\n*This article was paid for. Cryptonomist did not write the article or test the platform."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxOMDFtdXpvSWZKWlNnNHBjRjNSbUxxWllzd2tpVHNyeUFOaHdiV3NWaHVBWGVaaDlIdU8wOUlKWWd2Q3hyVEVTMFpjYjNTSVFBdWNjM3dxa25FQkI1LVQ3RWNTY2U4ZVR1aEtPMm05SHZiVVhzVnloMkF1ZE1CVDNtWnVITQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Feb 2024 08:00:00 GMT",
        "title": "Polygon: Scaling Ethereum With MATIC - Markets.com",
        "content": "The Polygon blockchain technology, coupled with the MATIC token ecosystem, provides a robust infrastructure for Ethereum scaling.\n\nBy leveraging the power of Polygon, developers and users can enjoy faster transactions, lower costs, and an overall seamless experience within the Ethereum ecosystem.\n\nBut what exactly are the benefits of using Polygon for scaling Ethereum? Well, for starters, Polygon's scalability solutions are designed to enhance transaction speed, reduce gas fees, and increase the efficiency of the Ethereum network. It's a win-win situation for both developers and users alike.\n\nIntegrating the MATIC network for Ethereum scaling is a straightforward process that brings exponential benefits. By following a few simple steps, developers can seamlessly integrate their dApps with the MATIC network, unlocking the full potential of Ethereum scalability.\n\nAs we look ahead, the future of scaling Ethereum with MATIC looks bright. Ongoing research and advancements in the field are paving the way for even more innovative solutions.\n\nThe integration of Polygon and the MATIC network is set to transform the Ethereum landscape, opening up new possibilities for decentralised finance and beyond.\n\nPolygon and the MATIC network offer a game-changing solution for scaling Ethereum. By harnessing the power of Polygon's blockchain technology and the MATIC token ecosystem, developers and users can enjoy a faster, more efficient Ethereum experience.\n\nSo brace yourself for the future, where the scalability of Ethereum meets the capabilities of Polygon and MATIC network integration.\n\nMust Read: Crypto Trading: The ultimate beginner’s guide Content\n\nUnderstanding Ethereum Scaling Challenges\n\nScaling Ethereum has become an urgent concern due to the challenges it faces in terms of scalability and rising gas fees. The need for Layer 2 scaling and reducing gas fees has become a critical focus for the Ethereum community.\n\nThe Challenge of Scalability\n\nEthereum, the world's leading smart contract platform, is experiencing scalability issues as its popularity and usage continue to grow. The network's current capacity is limited, resulting in slower transaction speeds and increased congestion.\n\nHigh Gas Fees\n\nOne of the main challenges faced by Ethereum users is the soaring gas fees. These fees, paid by users to miners for processing transactions, have surged to unprecedented levels during peak demand periods. This has made it less feasible for smaller transactions and has hindered user adoption.\n\nLayer 2 Scaling Solution\n\nTo address these challenges, Layer 2 scaling solutions are being developed for Ethereum. Layer 2 scaling refers to off-chain solutions that aim to increase the network's capacity and reduce congestion.\n\nThese solutions enable faster and cheaper transactions while maintaining the security and decentralisation of the Ethereum network.\n\nReducing Gas Fees\n\nReducing gas fees is another crucial aspect of Ethereum scaling. By optimising transaction processing and implementing more efficient fee structures, the aim is to make Ethereum more accessible to users and encourage broader adoption. This will allow Ethereum to be used for smaller transactions without the burden of high fees.\n\nLayer 2 scaling for Ethereum\n\nEthereum gas fee reduction\n\nBy addressing the scalability challenges and reducing gas fees, Ethereum can become a more efficient and cost-effective platform, attracting a wider range of applications and users.\n\nIntroducing Polygon Blockchain Technology\n\nPolygon, formerly known as Matic Network, is a protocol and framework for building and connecting Ethereum-compatible blockchain networks. It aims to address the scalability issues faced by Ethereum and enable faster more efficient transactions.\n\nBy leveraging Polygon's Layer 2 scaling solutions, developers can create scalable dApps and smart contracts that retain all the security benefits of the Ethereum mainnet. Polygon achieves this through its unique architecture, which combines Ethereum's security with the flexibility of a standalone blockchain.\n\nOne of the key features of Polygon is its ability to support multiple sidechains, also known as \"Polygon chains.\" These chains are designed to be highly scalable and interoperable, allowing developers to build and deploy their own customised blockchain networks.\n\nThe MATIC Token Ecosystem\n\nWithin the Polygon ecosystem, the MATIC token plays a vital role. MATIC is the native cryptocurrency of the Polygon network and serves as a utility token for various functions within the ecosystem.\n\nFirstly, the MATIC token is used for securing the network through staking. Validators stake MATIC tokens to validate transactions and secure the network against potential attacks. In return, they earn rewards for their contributions.\n\nMATIC also acts as a gas fee token, allowing users to pay for transaction fees on the Polygon network. This helps to reduce the overall cost of transactions and make decentralised applications more accessible to users.\n\nFurthermore, MATIC is used for governance and decision-making within the Polygon network. Token holders can participate in the voting process to influence the protocol's direction and development.\n\nPolygon's blockchain technology offers a scalable and efficient solution for scaling Ethereum. With its Layer 2 scaling solutions and the MATIC token ecosystem, Polygon provides developers and users with the tools and resources needed to build and interact with decentralised applications on a larger scale.\n\nBenefits of Polygon Scaling for Ethereum\n\nOne of the key benefits of using Polygon for scaling Ethereum is the significant improvement in transaction speed. The MATIC network, integrated with Ethereum, enables faster and more efficient processing of transactions.\n\nWith Polygon, you can experience quicker confirmation times and reduced waiting periods, enhancing the overall user experience.\n\nBenefits of Polygon Scaling:\n\nEnhanced Scalability: Polygon provides a Layer 2 scaling solution for Ethereum, allowing for the execution of a larger number of transactions in a shorter time frame.\n\nThis scalability boost enables the Ethereum network to handle more users and applications, facilitating its growth and adoption.\n\n\n\n\n\nReduced Costs: One of the primary concerns in the Ethereum network has been the increasing gas fees. Polygon offers a cost-efficient alternative, enabling instant and low-cost transactions.\n\nBy leveraging the MATIC network, users can enjoy reduced transaction fees and minimise their overall expenses.\n\n\n\nInteroperability: Polygon's technology allows for seamless integration with other blockchains and networks, providing enhanced interoperability.\n\nThis interoperability opens up countless possibilities for developers and users, enabling the creation of innovative decentralised applications (dApps) and expanding the reach of the Ethereum ecosystem.\n\nScalability for dApps: With Polygon, developers can easily build and deploy scalable dApps on Ethereum.\n\nThe Layer 2 solution provided by Polygon ensures that dApps can handle a higher volume of users and transactions without compromising performance. This scalability enables a smoother and more efficient experience for DApp users.\n\nEcosystem Growth: The scalability solutions offered by MATIC and the seamless integration with Ethereum contribute to the overall growth and development of the blockchain ecosystem.\n\n\n\nPolygon's technology attracts developers and users, fostering innovation and creating new opportunities in the rapidly evolving decentralised finance (DeFi) space.\n\nPolygon's scaling solutions bring numerous benefits to the Ethereum network. From enhanced scalability and reduced costs to increased interoperability and ecosystem growth,\n\nPolygon is playing a vital role in addressing Ethereum's scaling challenges and paving the way for a more efficient and sustainable blockchain ecosystem.\n\nExploring the Future of Scaling Ethereum with MATIC\n\nAs the demand for Ethereum continues to grow, the need for effective scaling solutions has become more pressing than ever. The integration of the MATIC network offers a promising path towards achieving scalability and enhancing the overall performance of Ethereum.\n\nWith the continuous advancements in research and development, the future of scaling Ethereum with MATIC looks bright. Here are some key aspects to consider:\n\nOngoing Research: Researchers and developers are actively exploring innovative approaches to further enhance the scalability of MATIC and Ethereum. Ongoing studies are focused on addressing the limitations and optimising the existing solutions. Layer 2 Improvements: The introduction of Layer 2 solutions has already demonstrated significant improvements in transaction speed and cost reduction. The future holds even greater potential for advancements in Layer 2 scaling techniques, offering a more seamless experience for Ethereum users. Adoption and Integration: As more projects realise the benefits of scaling Ethereum with MATIC, the adoption and integration of the MATIC network are expected to expand. This increased adoption will further drive the development of MATIC's infrastructure and contribute to the growth of the Ethereum ecosystem. Enhancing Interoperability: The future of scaling Ethereum with MATIC also involves enhancing interoperability with other blockchain networks. This will enable the seamless transfer of assets and data across different platforms, fostering collaboration and expanding the possibilities of decentralised applications. Community Involvement: The MATIC community plays a vital role in shaping the future of Ethereum scaling. Through active participation, feedback, and contribution, community members contribute to the continuous improvement and evolution of MATIC's scalability solutions.\n\nBottom Line\n\nThe integration of the MATIC network with Ethereum provides a powerful solution for scaling the Ethereum blockchain. With the growing demand and usage of Ethereum, there is an urgent need for effective scaling solutions to improve transaction speed and reduce costs. Polygon, with its innovative blockchain technology, offers a viable answer.\n\nBy leveraging the benefits of the MATIC network, Ethereum can achieve faster and more scalable transactions, enhancing user experience and opening up new possibilities for decentralised applications.\n\nAs the demand for Ethereum continues to grow, the scalability provided by Polygon and the integration of the MATIC network will play a vital role in shaping the future of the blockchain industry.\n\nReady to trade with markets.com? Creating an account is easy.\n\nStart Trading Now Start to trade now Join the 100.000s that have made markets.com their home for trading. Learn about trading as you grow your portfolio. More power in our platforms Ready to trade?\n\nCreate an account! Enter valid email Please enter a valid password Passwords must be between 8 and 15 characters long Passwords must contain at least 1 numeric character Passwords must contain at least 1 uppercase character Passwords must contain at least 1 lowercase character Password must contain ~!@#£%^&*()_-+=:;<>{,[]?,. Password can not be commonly used Password cannot contain non-latin characters Passwords cannot contain spaces By creating an account, you agree to our Privacy Policy, Cookie Policy and receive marketing emails. Subscriptions can be managed under Notifications settings in your account. Trading CFDs carries a considerable risk of capital loss. Trustpilot\n\n“When considering “CFDs” for trading and price predictions, remember that trading CFDs involves a significant risk and could result in capital loss. Past performance is not indicative of any future results. This information is provided for informative purposes only and should not be considered investment advice.”"
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxOcXRPTF85U0VVVmR0TlhfMXlobTIyWXZPbkgyY0xfWDQ3WXVTV1E4X3RGU25EZVlEQUs2TERHWEdWV0o4cllBSUhoTmd4UnQ1RzRHNjg3X0hVeGRoNFNwZFJGMEM4YWxMQlNPY0dhaE1VWDI4WWVlZmU3ZWhyQ3BzMGdra9IBiAFBVV95cUxQMHIxa2NqRVZRNWU3MjBKX2V4M1JDV2kwU2pCeTVMNHU5YjVwZktBUEplR1BnRGVPcWhMNmplQm1adDdkM0xwX1pIVlp3Tm1mWXlnQ3ljbFlLenJuUEoyS0FENTZiNDBnd2t6T3d1VUxBWXVZQWxKbFA3WmNqZ0JENnlWMGZacFVX?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Mar 2024 08:00:00 GMT",
        "title": "Crypto Price Analysis Mar-1: ETH, XRP, ADA, SOL, and BNB - CryptoPotato",
        "content": "This week, we take a closer look at Ethereum, Ripple, Cardano, Solana, and Binance Coin.\n\nEthereum (ETH)\n\nEthereum impressed with its rally this week after booking a 16.3% price increase. In the process, buyers managed to break the resistance at $3,340 and re-test it as a key support.\n\nWhile the trend remains firmly bullish, the momentum indicators appear a bit over-extended, which could make buyers exhausted if they continue at this rate. Only in February ETH increased by over 50% with little pullbacks.\n\nLooking ahead, the most important target for ETH is found at $4,000, which will also act as a resistance.\n\nRipple (XRP)\n\nDespite the volatility this week, XRP still managed to close in profit with an 11% price increase, and buyers successfully defended the support at 54 cents.\n\nBulls have a good shot at taking XRP higher in March after the correction that started back in November ended last month. The next target and resistance is found at 69 cents.\n\nLooking ahead, XRP has turned bullish, and the buying volume has returned to levels not seen since 2023. These are clear signals that the buyers are in charge.\n\nCardano (ADA)\n\nCardano impressed with a 17.6% price increase this week after briefly reaching 70 cents. This performance allowed bulls to make a new local high.\n\nThe support is found at 60 cents, and the current target for this rally is 82 cents. If buyers continue at this rate in March, then the next target is only a week away.\n\nLooking ahead, ADA bulls have returned in full force after the most recent correction ended in late February. The trend is bullish, and March looks primed for higher levels.\n\nSolana (SOL)\n\nSolana made a new high this year and nearly reached $138, making it the best-performing cryptocurrency on our list this week, with an impressive 31% price increase.\n\nSOL also broke above the $126 resistance, which has since turned into a key support. Considering the buy volume, this rally seems more likely to continue.\n\nLooking ahead, after the latest breakout, Solana’s target has moved to $163, which will also act as a key resistance.\n\nBinance Coin (BNB)\n\nBinance Coin reached $400 and managed to close the week with an 8% price increase. The current support is at $377, and resistance is at $437.\n\nEven if this rally enters a pullback later, the larger trend remains bullish. If it continues, it could see BNB continue to make higher highs.\n\nLooking ahead, this cryptocurrency is well-positioned to challenge the all-time high at $692 this year and maybe even exceed it."
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxPMHU0T21qaU0tMkl0R2VRRXo3MVNRZnhQUWlPbW9FMnUtZS1oRTAxY3hjYy1veHF5eF90OFIwS0VzQW5RT2NwQVB4MXpVNnVCZ05nRzliRllieVZUc0pmaVpsZDVGbnFLQzJLZ0Z2TGI2U3J5S0I1SVJESHdLam8xRV9RYjM2aFNMcnlWczZ3SmJvM3ZCNUxOVDR3eHhLdzZGalIwcERrZmtDTnd2UTNDSjFNWGRYcUY2MzJscDY4Z1pOM1Nh?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Mar 2024 08:00:00 GMT",
        "title": "Dormant Ethereum Whale moves ETH; Rising curiosity in Near Protocol and emerging AI Altcoin - Cyprus Mail",
        "content": "Never say never. That’s what seemed to be the case after a dormant Ethereum (ETH) whale woke up to send tokens worth $5.15 million. There had been no activity in the wallet address for around a decade. The tokens were sent to the crypto exchange Kraken. The development comes days after Ethereum crossed $3,000.\n\nThe sudden whale activity also highlights the potential of Ethereum as the next token to power a crypto exchange-traded fund (ETF). As concerns about the legal aspects of BTC ETF continue, many analysts have suggested Ethereum ETFs might be a solution to the problem because of their versatility.\n\nThe altcoins that have been seeing rising user interest were NEAR Protocol and InQubeta (QUBE). While NEAR Protocol is a developer-friendly protocol for deploying Web 3.0 solutions, InQubeta is a fundraising service for AI projects. Its presale funding recently crossed $10.4 million.\n\nInQubeta: Helping AI startups discover new milestones\n\nInQubeta is an Ethereum-based cryptocurrency that doubles up as a business development ecosystem for AI startups. Its collection of services helps startups shed inhibitions and grow their business models using blockchain-based solutions.\n\nFor crypto users, InQubeta is among the best cryptocurrencies to buy now. It facilitates seamless investments in AI projects. The startups selected by InQubeta have to go through intensive screening to ensure that only the best make the cut. Startups can then raise funds by minting equity based NFTs that can be bought by investors on the InQubeta platform.\n\nIts native cryptocurrency, the QUBE token, is a deflationary asset and can be staked. By adding InQubeta to their portfolio, people wouldn’t have to think about what cryptos to buy now for a long time.\n\nA total token supply of 1.5 billion is split between different uses like presale, paying legal fees, compensating developers, funding marketing campaigns, and giving out staking rewards – that’s what InQubeta’s tokenomics looks like. The largest share of the token is for the presale. Only 35% of the stock of coins goes towards the expenses.\n\nGiven its presale success, the QUBE token today is a part of top analysts’ best cryptocurrency ICO lists.\n\nEthereum L2 Zircuit draws $128 million in deposits within 24 hours\n\nEthereum is a popular blockchain technology that can be customized to roll out a range of solutions like decentralized identities, blockchains, and crypto assets.\n\nTransactions made using its native token ETH are validated with the proof-of-stake consensus protocol. Its popularity has also drawn attention to its potential to power the next crypto ETF.\n\nMarket experts suggest that the ETH token can do a better job of countering regulatory challenges for ETFs.\n\nThe cryptocurrency has been in the news after Zircuit, a Layer 2 blockchain built on Ethereum, drew over $128 million within 24 hours after it started accepting deposits. Zircuit allows crypto users to stake restaked and staked assets.\n\nNEAR Protocol’s new wallet gains 300,000 users in 48 hours\n\nNEAR Protocol is an emerging crypto that offers new-age tools for building powerful dApps. Developers can find multiple resources to upskill and share their ideas with professionals from the Web 3.0 industry.\n\nThe platform’s native token NEAR is used for all on-chain transactions. The Near protocol has registered a strong interest from developers due to its easy to use interface and ability to deploy dApps at the click of a button.\n\nThe platform recently released a self-custodial wallet called HERE. The wallet created a record of sorts after it clocked around 300,000 registrations within 48 hours of launch.\n\nIts USP is that Telegram users can seamlessly set up a blockchain-powered wallet.\n\nConclusion\n\nInQuebea, Ethereum, and NEAR Protocol are altcoins to watch out for this year as they haven’t let market volatility get to them till now. These tokens have posted consistent returns that have even trumped analysts’ expectations.\n\nThese crypto projects have been in the news for different reasons which has enabled them to garner more token holders. As Ethereum drew more users because of its upcoming Dencun upgrade, NEAR Protocol hit the headlines with an airdrop. InQubeta, meanwhile, grabbed the spotlight with its presale success. The collective impact of these tokens also helped with market recovery.\n\nMarket experts suggest that these tokens have a long way to go as they have high growth potential. Chances are people might see InQubeta, NEAR Protocol, and Ethereum leading the next crypto bull rally.\n\nDISCLAIMER – “Views Expressed Disclaimer: Views and opinions expressed are those of the authors and do not reflect the official position of any other author, agency, organization, employer or company, including NEO CYMED PUBLISHING LIMITED, which is the publishing company performing under the name Cyprus-Mail…more"
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxPZS0xbUJwN0JPWWp0ZDN0cm9LU2xEbk9tTEIxRTBNQlVnelpFWkVnUVdmM3Qtem5iOGZ0TVlKd0JtaFZHLVc5WUVBZE81SmdsY3FQQlBfUVRqZ253c21oVHRiRjNZcUFmT2dmdHV1UUVTZXNJbXNHeGZnUU9Mb1ZDQV9mQ0dkcDVjS3V2U09pN1ZhUk91RG5XZUtKRjJLX3dYMEdiZm1vcGU4Z9IBrwFBVV95cUxPM2EzZGZpSkFfY2pRNG1SbHVySlAwSTN6NXAxbTBzU0VFTm4zWnFGZTNzZ0hzV0htREhCa083YzRIbmhYUVNUSUhsM3lGdjFUUS1mNGpWYnlNVVd5dEFhTmhlZ2NKbzF4d1Fac3FmNldsVGhKYURNUFBZaTB5dmJzUFdxVjNEc2NTZjVWdnFzclpJUXJNcGdtRTA3bFhaTWxmTFo1bWVNbnhRcWVqNlow?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Mar 2024 08:00:00 GMT",
        "title": "Crypto Market Prediction for $10 Trillion: Bitcoin, Ethereum, Solana Poised to Explode? - Coinpedia Fintech News",
        "content": "Mustafa has been writing about Blockchain and crypto since many years. He has previous trading experience and has been working in the Fintech industry since 2017.\n\nStory Highlights Lark Davis predicts a massive market cap of $10 trillion for the cryptocurrency space.\n\nThis projection, if realized, would mark a historic moment for the industry, attracting substantial capital.\n\nWhile the prediction is optimistic, achieving a $10 trillion market cap would bring its own set of challenges.\n\nProminent crypto investor Lark Davis has stirred conversations with his audacious projection: a monumental $10 trillion market cap for the cryptocurrency space.\n\n10 Trillion dollar market, highly possible this cycle, equates to…\n\n\n\nBitcoin $250,000\n\nEthereum $15,000\n\nSolana $700 — Lark Davis (@TheCryptoLark) February 29, 2024\n\nLet’s delve into the figures and unravel the potential implications.\n\nCurrent Market Momentum\n\nPresently, the overall market cap of the cryptocurrency space has reached $2.4 trillion, showcasing a substantial rise from the $800 billion recorded at the start of the year.\n\nThis surge follows a period of recovery from a bear market, where Bitcoin, the flagship cryptocurrency, experienced a significant decline from its all-time high of $69,000 to a low of around $16,000.\n\nShould Davis’s foresight materialize, Bitcoin (BTC) is poised for an extraordinary surge from its current trading price of $61,500. This represents a potential increase of nearly 400%, reaching the projected price of $250,000. Achieving this valuation would necessitate a significant influx of capital into the Bitcoin market, currently valued at around $1.19 trillion.\n\nEthereum’s $15,000 Vision\n\nIn Davis’s forecast, Ethereum (ETH) is predicted to trade at around $15,000, signaling a substantial increase from its current value. Ethereum, with a current market cap of approximately $280 billion, would need considerable capital inflow to reach the projected price.\n\nThis surge would position Ethereum as a formidable player in the market, underlining its pivotal role in decentralized finance (DeFi) and smart contract technology.\n\nSolana Isn’t Far Behind Either!\n\nDavis’s projections extend to Solana (SOL), earmarked for a surge to $700. With Solana’s current market cap standing at approximately $23 billion, achieving the predicted price would involve heightened investor interest and significant capital injection. This potential surge positions Solana as a significant player in the blockchain ecosystem, contributing to the ongoing narrative of scalable and high-performance blockchain platforms.\n\nImplications of a $10 Trillion Market Cap\n\nBeyond the exciting projections lies the potential realization of a historic milestone—a $10 trillion market cap for the cryptocurrency space. This achievement would not only mark a significant moment in the industry’s history but also introduce new opportunities and challenges for market participants."
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQQ2J4TmpQYWxUSkxUY2RfT0tYMFh1MjZnSWUyZTB3NzFuY2Vubng1MVpkUWdPYXFxQmlqcDgyRHhIc0dXTXBGOUU5U080cHhtSkowOUdSUFB3ZWRlanF0eVBUVmdxVTMxRGphOS1OUXVTUkZRMzNrN0hKRkVwaTFnQmw5aUgxR0xPcXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Mar 2024 08:00:00 GMT",
        "title": "Ethereum Deflationary Meme Coin, $PEPE, Surges Over 145% In 7 Days - NullTX",
        "content": "The Ethereum deflationary memecoin, $PEPE, has experienced a remarkable surge of over 145% in its price over the past seven days, capturing the attention of investors and enthusiasts alike.\n\nIn a recent development, a smart whale identified as 0x37d has made significant moves in the $PEPE market. The whale recently deposited a staggering 1.97 trillion $PEPE tokens, valued at $6.06 million, to Binance just a few hours ago.\n\nThis strategic move potentially positions the whale to capitalize on substantial gains, with an estimated profit of $3.47 million, representing a remarkable 135% increase if the tokens are indeed sold at current prices.\n\nAfter $PEPE reached new ATH, smart whale 0x37d deposited all 1.97T $PEPE ($6.06M) to #Binance ~7hrs ago, making $3.47M (+135%) if truly selling. Moreover, the whale withdrew 75.91B $SHIB ($893K) from #Binance for the first time ~1hr ago. Bullish for a $SHIB pump soon? 🤔 Follow… pic.twitter.com/dEX9SgQXrR — Spot On Chain (@spotonchain) February 29, 2024\n\nThe smart trader behind these transactions has been actively involved in the $PEPE market dynamics. Notably, the trader deposited 470 billion $PEPE tokens to Binance at a price of $0.000003007.\n\nThe cumulative deposits amounted to 1.97 trillion $PEPE tokens over the past few hours, with an average acquisition price of $0.000003073, translating to a substantial investment of $6.06 million.\n\nPepe Whale Address Reveals Further Movements And Holdings\n\nAnalysis of the whale’s portfolio reveals insights into past and current profit and loss scenarios.\n\nWhile the whale once realized an estimated profit of $614,000, representing a 21.9% increase from ETH holdings, current holdings in SAND and MANA indicate losses of $116,000 and $20,100, respectively, totaling $136,100.\n\nDespite the recent surge in $PEPE price, reaching a new all-time high of $0.000003524 nine hours ago, the market experienced a slight downturn of 3.38% in the past hour.\n\nThis decline may be attributed to the impact of the whale’s selling activity, reflecting the significant influence of large investors on market dynamics.\n\nAs $PEPE continues to capture attention within the crypto community, the actions of whales and traders play a pivotal role in shaping its market trajectory, driving speculation and interest among investors.\n\nDisclosure: This is not trading or investment advice. Always do your research before buying any cryptocurrency or investing in any services.\n\nFollow us on Twitter @nulltxnews to stay updated with the latest Crypto, NFT, AI, Cybersecurity, Distributed Computing, and Metaverse news!"
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE9wamQxWndsUW54dXZ4VWxMc01US2paVm52VFlaUW5NOVRITnRyNkVOUGJhWHN0RzByNzZRTzRuMnRpZ3VINGdVWmM1N3Ewek5lOTFILUlRYW9RMUNsZFVwbWdEaklrdFdkaWxoa3FUVVhWYTRIOE9KUHFB0gF-QVVfeXFMUDItU1Vpd3RWclNVUVFmeGV2UnFpdTJVamFQQ3VCOFBzV3lLSmxrX1hwRHk4M2wzUmxxMndVZTJ6YnVnV1dXVFVYbjlRVFhSbFJyaTAta3hFTjVaM1ZnTlFScTljLXJrdHFEaHlna3NfTDhxTVAzdXVlMW51SFZR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Mar 2024 08:00:00 GMT",
        "title": "6 Best Crypto Wallets For Beginners in 2024 - CoinCodex",
        "content": "Choosing the right cryptocurrency wallet can be one of the most intimidating aspects of getting started with crypto. We’ll get you started off on the right foot by providing a list of the best crypto wallets for beginners.\n\nThe best crypto wallets for beginners\n\nWe’ve made sure to include a variety of wallets to provide options for every type of crypto investor, regardless of whether you’re a long-term holder or frequent user of crypto.\n\nLedger Nano S Plus - Best hardware crypto wallet for beginners\n\n- Best hardware crypto wallet for beginners Trust Wallet - Best software crypto wallet for beginners\n\n- Best software crypto wallet for beginners Coinbase Wallet - Best crypto wallet for Coinbase users\n\n- Best crypto wallet for Coinbase users MetaMask - Best Ethereum wallet overall\n\n- Best Ethereum wallet overall Electrum - Best Bitcoin wallet for desktop\n\n- Best Bitcoin wallet for desktop Phantom - Best Solana wallet for beginners\n\n1. Ledger Nano S Plus - Best hardware crypto wallet for beginners\n\nIf you’re approaching cryptocurrency with a long-term buy and hold strategy, you should strongly consider getting a hardware cryptocurrency wallet. A hardware cryptocurrency wallet is a secure device that stores the private keys necessary to access your cryptocurrency without exposing them to devices that could potentially be compromised (computers and phones that are connected to the internet).\n\nThe Ledger Nano S Plus is a hardware wallet that offers very strong security at a reasonable price of $79. This wallet is an upgraded version of the Ledger Nano S, which had established itself as the go-to hardware wallet for crypto investors worldwide.\n\nThis hardware wallet can be used to store more than 5,500 different cryptocurrencies. It implements advanced, independently audited security systems and works seamlessly with the Ledger Live software for easy portfolio and transaction management.\n\nGet a Ledger Nano S Plus\n\n2. Trust Wallet - Best software crypto wallet for beginners\n\nOne of the main reasons why we believe Trust Wallet is the best software crypto wallet for beginners is that it supports a diverse range of cryptocurrencies. This allows users to manage their cryptocurrency with one app instead of having to hop to a different app for each coin they hold.\n\nThe wallet is compatible with Bitcoin, Ethereum (including blockchains compatible with Ethereum's Virtual Machine), XRP, and various other well-known cryptocurrencies.\n\nTrust Wallet is user-friendly, featuring an interface that accommodates both novice and experienced crypto investors. It enables users to track the value of their crypto portfolio in their preferred currency, review their on-chain transaction history, and efficiently manage a variety of cryptocurrencies.\n\nIn addition, Trust Wallet includes a decentralized application (DApp) browser, which allows interaction with DApps through the wallet. Trust Wallet also has features for buying and selling cryptocurrencies, swapping tokens, and staking capabilities.\n\nGet Trust Wallet\n\n3. Coinbase Wallet - Best crypto wallet for Coinbase users\n\nCoinbase Wallet is a cryptocurrency wallet developed by the Coinbase cryptocurrency exchange. Coinbase Wallet is non-custodial, which means that the responsibility of managing private keys is completely up to the user.\n\nThis wallet supports multiple blockchains, including Bitcoin, Ethereum, Solana, XRP, Stellar, Litecoin and Dogecoin. In addition, Coinbase Wallet supports various Ethereum-based layer 2 networks and can also be used to store ERC-20 tokens.\n\nBeyond the basic features of holding and transacting cryptocurrency, Coinbase Wallet also offers some advanced features, such as the ability to make token swaps through decentralized exchanges directly from the wallet’s interface.\n\nIn addition to cryptocurrencies, Coinbase Wallet can also be used to manage and transact with NFTs.\n\nCoinbase Wallet is a great choice if your centralized exchange of choice is Coinbase. This is because the wallet can be linked with a Coinbase account for streamlined crypto transfers.\n\nGet Coinbase Wallet\n\n4. MetaMask - Best Ethereum wallet overall\n\nMetaMask is a wallet designed to work with Ethereum and other blockchains that are with the Ethereum Virtual Machine (EVM). It's available both as a web browser extension and a mobile application. MetaMask enjoys widespread adoption within the Ethereum ecosystem, with nearly all Ethereum-based decentralized applications (DApps) supporting it.\n\nMetaMask can of course be used to hold and transact with ETH and Ethereum-based tokens, but the wallet also offers features for buying, selling, and swapping crypto tokens directly on the blockchain. MetaMask also has a portfolio tracker which you can use to easily monitor the performance of your crypto holdings.\n\nMetaMask is a great choice for beginners, as well as advanced users who often interact with DeFi protocols or NFT marketplaces. It can function as a hot wallet for everyday use, but if you want to use it to manage larger amounts of crypto, we recommend you pair it with a hardware wallet like the Ledger Nano Plus for enhanced security. You can learn more about this topic in our article comparing hot wallets vs. cold wallets.\n\nGet MetaMask\n\n5. Electrum - Best Bitcoin wallet for desktop\n\nIf you are a Bitcoin holder and want a wallet for your desktop or Android device, Electrum is a great choice. This non-custodial wallet is easy to use for basic transactions, but also offers advanced features that will come in handy as you level up your knowledge of Bitcoin. For example, Electrum can be used as a multisig wallet, and it also supports third-party plugins.\n\nYou can use Electrum as a hot wallet for everyday Bitcoin transactions, but the wallet has also integrated support for hardware wallets from manufacturers such as Ledger and Trezor if you want to use it to manage more substantial transactions.\n\nA great thing about the Electrum wallet is that it connects to a decentralized server network, which means you’re not very likely to experience any issues with downtime. While it is a very solid wallet, Electrum is limited to Bitcoin, so you should look for alternatives if you also want to store other cryptocurrencies.\n\nGet Electrum Wallet\n\n6. Phantom - Best Solana wallet for beginners\n\nPhantom is a wallet that has become the go-to option for many Solana users. Since its launch, however, the Phantom team has expanded the scope of their wallet to also include support for the Bitcoin, Ethereum and Polygon blockchains.\n\nPhantom provides a slick user interface, strong support for NFTs, as well as built-in token swapping and staking features. The Phantom wallet is non-custodial and can be used in tandem with hardware wallets, which also makes it suitable for long-term crypto storage.\n\nThe Phantom wallet has a feature that detects when the user is about to approve a transaction that’s identified as potentially malicious. For example, the user might be connecting to a phishing website that’s designed to trick users into approving a transaction that drains their wallet.\n\nPhantom is available either as a mobile app on iOS and Android, or as a browser extension in Chrome, Firefox and other popular browsers.\n\nGet Phantom Wallet\n\nThe bottom line\n\nEven though the wallets we have featured in this article are suitable for beginners, they are all high-quality pieces of software that will serve you well even as you become a more advanced cryptocurrency user. When picking among these wallets, consider which cryptocurrencies you want to store and whether you want to use your wallet as a mobile app, desktop program or browser extension.\n\nAll of the wallets we have featured in this article are non-custodial, which means that the user has the sole responsibility of securing their private keys. This is great since you don’t have to trust any third parties to keep your crypto safe, but it also means you have to ensure to back up your recovery phrases and never share your private keys with anyone.\n\nIf you’re trying to learn more about everything you need to keep in mind when starting your crypto journey, make sure to take a look at our ultimate guide to investing in crypto."
    }
]