[
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxQejR6Qkd2cW1EdTEwQzVPaC1jNTdSY0xMaVdMMFZJYmk2ODExbXdfZmxKOEZDcFdibklHbzBxdTR2NkZsREFONlZIUEtxbUJiUzhZU09xWE5tYlN2QVp0Rmp5SEhsaU5IbTdYYkYyOUE1bndiZi1vdi1JQklIWENDZnJDNE1xTkoxeVhuLVRxX19MN2hEUHpJT1lsVktFeHp6Wk40Nw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Apr 2024 07:00:00 GMT",
        "title": "Ripple to launch USD-pegged stablecoin on XRP ledger and Ethereum - The Banker",
        "content": "Ripple plans to launch a stablecoin, pegged 1:1 to the US dollar, later this year. The US-based crypto and blockchain solutions provider will make the stablecoin available on XRP ledger, which it developed, as well as the Ethereum blockchain — both public permissionless ledgers — with plans to expand over time.\n\nThe stablecoin will be backed by US dollar deposits and short-term government Treasuries, with all reserve assets audited by a third-party accounting firm, alongside monthly attestations."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxPN0ZOUjRLM29jNDZaTjZUS2p0dEdna3ZrdlRlb1dYRXpTUF83ZG1FUkpjZTZodkZ3U3lEZXJtRTdhcjhsVjNBSzhlQ0pJR1VfV2lJcWxXdzdhbGRUX19uVlBTSm9WaFZwX2FvZkFCd3c4VkVqYWlTcG91akFWSU9IVUlzZG14aGs2RjJKMjlXdlRkeWk0d19lMnA4SHh5WDF6Skg2Vno1Rk1BQXpCdk5SWA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Apr 2024 07:00:00 GMT",
        "title": "Bitcoin Halving, Ethereum ETF: The Most Important Trends in the Cryptocurrency Market 2024 - hackernoon.com",
        "content": "The upcoming bitcoin halving is a significant event that happens about once every 4 years and is of great importance to the entire crypto industry.\n\n\n\n\n\nThe year 2024 has seen and is expected to see several important milestones for the crypto industry: the approval of the Bitcoin ETF, the Ethereum Dencun upgrade, as well as the upcoming bitcoin halving and the possible approval of the Ethereum ETF. These events reflect important milestones in the development of the cryptocurrency space and are attracting increasing attention from investors and the general public.\n\n\n\n\n\nIn this article, I will dive into the specifics of bitcoin, review the nature of the halving and its significance, compare bitcoin to ethereum, and discuss other key events. The rapid growth of this sector inevitably leads to many questions and discussions, and this article will help you better understand the nature of the ongoing changes and their implications.\n\nWhat is bitcoin?\n\nBitcoin is the first and most famous cryptocurrency that was created in 2009. It is a digital currency powered by blockchain technology that allows users to make decentralized transactions. This means there is no centralized control in this network and no need for a third party. It was designed to be a non-inflationary cryptocurrency, and the mechanisms that limit the issuance of the new BTC cryptocurrency are fundamentally built into the Bitcoin protocol itself. The mechanism that ensures a permanent reduction in issuance is called halving. Let's take a look at how it works. The bitcoin network is organized into nodes. Each node maintains identical copies of the blockchain. These copies are agreed upon by the nodes according to rules called a consensus mechanism.\n\n\n\n\n\nProof of Work (PoW) consensus is used in bitcoin. Proof of Work is a mechanism that ensures the safety and reliability of the bitcoin network. As part of PoW, miners use special hardware to solve complex mathematical challenges. When a miner solves such a challenge faster than other ones, he creates a new block with transactions and adds it to the blockchain, receiving a reward in the form of BTC cryptocurrency. According to the rules built into the protocol, new blocks are formed by miners about every 10 minutes.\n\n\n\n\n\nThis means that bitcoin issuance takes place as miners are rewarded for forming blocks. In fact, all BTC that are created in the network are miners' rewards for mined blocks. Bitcoin is divided into smaller units - they are called \"Satoshi\".\n\n\n\n\n\nSatoshi is the smallest unit of bitcoin and represents one hundred millionth part of bitcoin.\n\n\n\n\n\n1 Satoshi = 0.00000001 Bitcoin (BTC)\n\n100 Satoshi = 0.000001 Bitcoin (BTC)\n\n10 000 Satoshi = 0.0001 Bitcoin (BTC)\n\n1 000 000 Satoshi = 0.01 Bitcoin (BTC)\n\n10 000 000 Satoshi = 0.1 Bitcoin (BTC)\n\n100 000 000 Satoshi = 1 Bitcoin (BTC)\n\n\n\nWhat is halving?\n\nHalving is an event in the bitcoin protocol where the mining reward for creating a new block is reduced by half. It occurs approximately every 4 years and is a built-in mechanism that limits the total number of bitcoins that can be created.\n\n\n\n\n\nHalving is hugely important for bitcoin, as this event directly affects its economic model. As the miners reward for each block decreases, the number of new bitcoins coming into circulation also decreases, which helps maintain bitcoin's value in the long-term.\n\n\n\n\n\nThe bitcoin protocol was designed with the idea of a limited supply. The protocol includes a rule that limits the maximum total number of bitcoins that can be created. This limit is 21 million bitcoins and its issuance will stop by 2140.\n\n\n\n\n\nWhen the bitcoin blockchain was launched in 2009, the reward to miners for a new block was 50 BTC, which is its issuance. During the history of bitcoin there have already been 3 halving, in 2012, 2016 and 2020. In 2012, the first bitcoin halving took place and the miners' reward for mining a block decreased from 50 BTC to 25 BTC, in 2016 during bitcoin halving the miners' reward per block was already reduced to 12.5 BTC, and in 2020 after bitcoin halving the miners' reward per block became only 6.25 BTC.\n\n\n\n\n\nThe next bitcoin halving will occur in April 2024 and miners' reward per block will be reduced from 6.25 BTC to 3.125 BTC.\n\n\n\n\n\n\n\n\n\nThe impact of bitcoin halving on its price and market dynamics is significant. The expectations associated with halving that supply will decrease and demand will increase often leads to positive market sentiment. The decrease in available bitcoins after halving creates scarce demand, which in turn increases their price and makes this cryptocurrency more attractive to investors.\n\n\n\n\n\nHowever, it is important to realize that past performance does not guarantee that it will be repeated in the future, and the price of the bitcoin cryptocurrency can be affected by various factors other than halving events. In addition, an increase in the price of the bitcoin cryptocurrency following halving events may also be justified by an increase in press coverage of cryptocurrencies or an increase in real-world options for its use. Although past bitcoin halvings have stimulated a bullish trend of bitcoin cryptocurrency price in the long term, one should keep in mind the unpredictability of the market.\n\nWhat is Ethereum?\n\n\n\n\n\n\n\n\n\nEthereum is the second largest capitalized cryptocurrency after bitcoin. It is a decentralized protocol based on blockchain technology. It was launched in 2015 and its key idea is to support smart contracts that allow creation of decentralized applications. Smart contracts are programs that are hosted and running in the Ethereum environment.\n\n\n\n\n\nAnyone can deploy smart contracts on the network or interact with existing ones. The advantage of this model is that there is no need to trust third parties or intermediaries. There are a huge number of decentralized applications built on Etherium, from DeFi and NFT to decentralized autonomous organizations. It also opens up the possibility of tokenizing any tangible and intangible assets, which brings many benefits in the form of automating transactions and reducing transaction costs by eliminating the need for intermediaries. This is one of the major trends in the industry right now. Smart contracts also allow even traditional money to be tokenized, transferred and used in a decentralized digital world. The native cryptocurrency in Etherium is called Ether, and it is used to pay transaction fees on the network.\n\n\n\n\n\nThis means that Ether cryptocurrency is needed when sending any transaction that represents actions on the network. The Ether cryptocurrency is also divided into smaller parts. Up to 18 decimal places. The smallest unit is called Wei. Below is an example of converting Ether to Wei.\n\n\n\n\n\n1 Ether = 1000000000000000000 Wei\n\n0.01 Ether = 10000000000000000 Wei\n\n0.000000001 Ether = 1000000000 Wei\n\n0.000000000000001 Ether = 1000 Wei\n\n0.000000000000000001 Ether = 1 Wei\n\n\n\n\n\nWhat is the difference between Ethereum and Bitcoin?\n\n\n\n\n\nThe main difference between Ethereum and Bitcoin lies in their functionality. Bitcoin provides the ability to send basic value transfer messages between users without the need for centralized intermediaries, and is designed primarily as a digital payment system. Ethereum, instead, extends this concept by allowing the creation of any kind of program (smart contracts) that can be executed on the network. Almost any decentralized applications can be created on Ethereum, which drives innovation and growth in various areas: decentralized finance, exchanges, tokenization of real-world assets and currencies, games, social networks, decentralized autonomous organizations, and others.\n\nSo unlike Bitcoin, Ethereum is focused not only on financial transactions, but also on creating digital decentralized ecosystems and applications.\n\nBitcoin ETF\n\n\n\n\n\n\n\n\n\nThe approval of the bitcoin ETF on January 10, 2024 had a significant impact on the cryptocurrency market as well as the price of bitcoin itself. Shortly after this event, the bitcoin price rallied from a level of around $46,000 to a new all-time high of around $73,740 within two months.\n\n\n\n\n\nThe approval of the spot bitcoin ETF opened up new opportunities for investors by giving them access to the digital currency through traditional investment accounts, leading to a visible increase in interest in bitcoin from institutional and individual investors.\n\nThe approval of bitcoin ETFs has also brought a new set of benefits. It has opened up opportunities for capital inflows from traditional financial markets, as bitcoin is now available to institutional investors who can do transactions through their regular brokerage accounts. Hedge funds, pension funds and other large institutional players who previously did not have access to this asset class can now do transactions in bitcoin ETFs.\n\n\n\n\n\nThe approval of bitcoin ETFs has also increased the liquidity of the cryptocurrency market, as it has stimulated more capital inflows and increased bitcoin trading activity. Increased liquidity may help improve the structure of this market and reduce volatility.\n\n\n\n\n\nThus, this event has the potential to affect the further progress of the cryptocurrency market and raise even more interest in bitcoin from investors. In general, this year is very significant for bitcoin, because its halving is expected ahead, which will reduce miners' reward per block by 2 times, which means that the issuance of new BTC will be reduced in the same amount.\n\nEthereum ETF\n\n\n\n\n\n\n\n\n\nRequests for an Ethereum ETF have been submitted and a decision is expected to be made in the near future. Potentially, the approval of the Ethereum ETF could have a major impact on Ether and cryptocurrency market price rates in general. Approval of the Ethereum ETF could lead to increased demand for Ether cryptocurrency from investors, including institutional investors for whom it may become available, interested in diversification of their portfolios. Such an injection of capital could boost Ether's price and overall popularity. But it is important to realize that the impact on the exchange rate may be unpredictable and dependent on many other factors.\n\n\n\n\n\nThe possible approval of an etherium ETF also opens up new opportunities for investors by giving them access to Ether price movements through regular brokerage accounts. This will allow investors familiar with traditional investments to access new markets without having to manage digital wallets or navigate complex cryptocurrency exchanges.\n\n\n\n\n\nThus, the approval of an Ethereum ETF could make investing in the Ether cryptocurrency more accessible and attractive to a wide range of investors, opening up new horizons for capital inflows.\n\nWhat's next?\n\nThe next major event that is expected is the bitcoin halving. According to the bitcoin protocol, the next halving will take place in April 2024, when the reward for miners for mining a block will be reduced from 6.25 BTC to a reward of only 3.125 BTC per block. This event could significantly affect bitcoin's market dynamics and raise investors' attention to its potential.\n\n\n\n\n\nThe approval of bitcoin ETFs has brought significant price impulse to the cryptocurrency market, and helped drive the bitcoin price to a new all-time high. The move has opened up new opportunities for investors, allowing them to invest through traditional investment accounts. The approval of the Ethereum ETF could also lead to increased investor interest in the Ether cryptocurrency.\n\n\n\n\n\nIt should be pointed out that one of the key factors that will also have an impact on cryptocurrency price rates is the Ethereum Dencun upgrade. This upgrade, which introduces proto-danksharding, not only improves the scalability of the Ethereum network, but also reduces fees in L2 rollups, which may become an additional motivation for investors and increase interest in the cryptocurrency market as a whole.\n\nHowever, it is worth remembering that the actual impact of these events on cryptocurrency price rates can be complex and multifaceted. Other factors such as regulatory changes, technical innovations and macroeconomic conditions can also have a significant impact on market dynamics. Therefore, it is important to take all aspects into consideration and base your decisions on a multitude of other factors. Only time will tell the real impact of these events on the market and the crypto industry.\n\n\n\n\n\nThe information presented in this article is the subjective opinion of the author and should not be considered a recommendation or a call to action. The information presented in this article may be incomplete or not fully accurate and readers are advised to conduct their own research to confirm and supplement the information presented. Readers should understand that making any decisions based on this information involves risks, including loss of capital or other negative consequences. Readers are advised to seek professional advice and evaluate their own circumstances before making any decisions. The author shall not be liable for any loss or damage resulting from the use of information from this article. Not an investment recommendation.\n\n\n\n"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMia0FVX3lxTE95eTh0UkpBZlQ0V2w1NmEzemJnYjc2WXl3ZG0ydDMxMlJmYWd3V0ZmYUlRVXNBZGhiMTFtRktmQk5UZEg1eWl3TG1acGtqd1pRUFVPNDd1SXRldlE0VjQxRDhEak5zVkV1dnJF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Apr 2024 07:00:00 GMT",
        "title": "DWS Group debuts Bitcoin and Ethereum ETCs in Germany - Crypto Briefing",
        "content": "Coinbase and Zodia Custody act as custodians for the digital assets underlying the ETCs.\n\nShare this article\n\nDWS Group (DWS), an asset management firm managing almost €900 billion in assets, has partnered with Galaxy Digital Holdings Ltd. to introduce two new Xtrackers exchange-traded commodities (ETCs): the Xtrackers Galaxy Physical Bitcoin ETC securities and the Xtrackers Galaxy Physical Ethereum ETC securities. These new ETCs are now listed on Deutsche Börse, as DWS shared in a recent press release.\n\nAn exchange-traded commodity (ETC) functions as a debt security similar to an exchange-traded note (ETN) but with added protections for investors. These protections include collateral, limited recourse, and bankruptcy remote issuer. Unlike ETNs, ETCs can track single assets or smaller, focused baskets of assets.\n\nAccording to Manfred Bauer, Global Head of DWS’ Product Division and Member of the Executive Board at DWS Group, the growing value of Bitcoin and Ethereum is making it impossible for investors and financial institutions to simply ignore them. With this launch, DWS seeks to provide investors with direct access to Bitcoin and Ethereum.\n\n“Since the first Bitcoin transaction in 2009, digital assets have developed from a niche technology innovation to a globally recognized asset class. With a combined market capitalization of more than USD 1.7 trillion, Bitcoin and Ethereum alone are now too significant for investors and asset managers to ignore,” stated Bauer.\n\nThe strategic partnership between DWS and Galaxy aims to accelerate digital asset adoption in Europe, leveraging their collective expertise, noted DWS. Through this collaboration, Galaxy will equip DWS with the tools and expertise to offer institutional-grade access to digital assets for European investors.\n\n“We are delighted to be working with Xtrackers to offer investors institutional-grade access to digital assets and to support them with our deep digital asset expertise,” commented Steve Kurz, Global Head of Asset Management at Galaxy.\n\nAs noted in the press release, each ETC is supported by segregated offline storage solutions provided by Zodia Custody and Coinbase, ensuring the safekeeping of digital assets.\n\nWith an annual product fee of just 0.35%, DWS expects that these ETCs will be a cost-effective option for investors looking to tap into the digital asset market. The firm claims that its new products will offer the ease of trading an ETP with the perceived safety of having an underlying physical asset."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMibkFVX3lxTFBndG9iQVRnVHhpUEEwT1p5c2ZOUV9LVkl4MDlKOFlJNElVSGlyVWhwOElSb2wxZlNiR1k1UnE4NV83MU5lTFdkdVFIZWhlN3JoaURFeFAxSFdyVUNsM2JFUW9Lb3hzZUxtampiR1Vn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Vs. Solana In Viral Video Showdown - TronWeekly",
        "content": "Superteam, a pool of skilled individuals within the Solana ecosystem, became widely popular after its promotional video critiquing Ethereum and disapproving ETHMAXI went viral. The two-minute ad showcased a fictional scenario with a patient exhibiting symptoms of ETH MAXI, alongside a doctor conducting an extensive ‘Ether Scan.’ The doctor diagnosed millions of developers with this condition and urged them to cross-chain to Solana via Wormhole.\n\nAs reported by TronWeekly earlier, the decentralized messaging protocol Wormhole announced its token airdrop. Per the roadmap, W will kickstart its journey as a native SPL token on the Solana blockchain and will gradually expand to all Wormhole-connect EVM chains thanks to Wormhole Native Token Transfers [NTT]. After debuting on Solana, NTT will allow seamless transfer of W across Solana [SOL], the Ethereum mainnet [ETH], and layer two protocols.\n\nEthereum vs. Solana In Viral Video Showdown 3\n\nThe timing of the ad and the Wormhole airdrop was a strategic maneuver, garnering retweets from both the official Solana account and the chairman of the Solana Foundation. A proponent of Ethereum defended its blockchain design choices, emphasizing the advantages of a decentralized, capitalist approach to innovation.\n\nEthereum and Solana: Uniting for Progress\n\nHe emphasizes how Ethereum’s constraints foster innovation across a multi-billion dollar industry. The post suggests that Ethereum’s design encourages competition and diverse solutions, resulting in platforms that advance the ecosystem while maintaining security and decentralization. It acknowledges concerns about fragmentation but argues that competition will drive solutions. He then ends his post by asserting that Ethereum’s prioritization of innovation over control is a smart approach.\n\nEthereum’s simplistic design (e.g., low TPS and minimal feature set) is seen as a constraint–or worse, a bug. But that design choice has led to a multi-billion dollar industry made of up different platforms trying to tackle that constraint while ensuring application users can benefit from Ethereum’s decentralization and security. Rollups, coprocessors, AVS protocols, off-chain (hybrid) applications–all of these appeared because developers needed to work around Ethereum’s constraints without completely eroding guarantees of trust minimization and security.\n\nFollowing the intense debate on superiority, the Superteam issued a statement, “Well, that blew up. while we’re focused on Solana, we respect everything Ethereum core devs and engineers have built. we stand together in advancing an open financial internet and resisting unfair regulation. Let’s have fun and move the space forward together!”"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxONGE2aVRicm9Wc3ZqcFZwUEdETFJxY09Lc2FQS2I1dUhmM0ZiWTZIWWNJWDRQNzVmWThSTUFqOThxUWtweTBiS2hKSFRGUENoYm9YMTVKNUFJUjhKUmpmbTdwVHA2c2xJRU1GUXM5RUhwREE5b1gwM1A2bWx0RHdwTWFvc1JIU3lW0gGOAUFVX3lxTE1EX01TT3NzT1pkWnAyNjVsZjg2d2huZGozNzBfVWFNZEVaVnFmSHJlVHNLTmVvSHVNMkhxQkNaVU9XYmtuel9nZ2FJN1hyQVhXWnB1bWFSOUVaT2tmMXlScDAxVG40b0FnRnhlOGZFZFd4VGtudG01OFBmSFRBa3Z4ME9FaUVRNlg5SFdzMmc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 Apr 2024 07:00:00 GMT",
        "title": "Ethereum leads NFT market with over US$10 million in sales - Forkast News",
        "content": "Ethereum is the top-ranking blockchain in the non-fungible tokens (NFT) market for the second consecutive day, with sales exceeding US$10.24 million in the past 24 hours.\n\nIt was also the second straight day that Ethereum was the only blockchain to surpass $10 million in sales.\n\nThe leading platform saw a slight increase of 5.61% in sales volume, according to data from CryptoSlam.\n\nBitcoin and Solana followed as the second and third top-performing blockchains, with sales of US$7.71 million and US$4.60 million respectively.\n\nBitcoin experienced a notable increase of 8.97% in sales, with a significant drop in wash sales by 95.26%, leading to an overall positive change of 7.72% in total sales volume.\n\nBitcoin, which frequently challenged Ethereum’s dominance throughout March stayed below the US$10 million daily sales mark for the entire trading week.\n\nBitcoin’s US$514 million edged out Ethereum’s US$490 million in NFT sales last month.\n\nSolana faced a downturn, with sales plummeting by 24.06% and wash sales decreasing by 68.77%, resulting in a 41.97% decline in total sales volume.\n\nThe fourth-ranked BNB blockchain showed a remarkable surge in sales, jumping by 400.6%, although starting from a lower base, with total sales reaching nearly US$956,000.\n\nThe majority of BNB Chain’s sales came from LockDealNFT, which had a 563% increase to US$871,689."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE5CUzd4UmFuMVdKbDZ2Q0ZUSnpVdzZKN0U3T1ZINHpGRnBOdGNHcWZ6bVNjdjVvaDN4NFUyemZ3VVdDT25oUFVpMjhxaTVDbHZFUTc1OEFQRVN0M3liWkFOdFNPOHN1Wi1va20yNlc3eFpKNmVrNi1Jc3JuWWM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Apr 2024 07:00:00 GMT",
        "title": "Solana 2024 Surges 3.2x Faster Than Ethereum 2020: Fractal Analysis Signals Growth - TronWeekly",
        "content": "Solana’s potential growth traje­ctory parallels Ethereum’s past pe­rformance, according to a recent twe­et by crypto analyst MartyParty. The analyst drew a fractal comparison betwe­en SOL’s projected traje­ctory in 2024 and Ethereum’s performance­ in 2020, fore­casting a substantial valuation increase for Solana. The e­stimate suggests a 3.2x rise in SOL’s price­, propelling it to reach $600 during the ne­xt distribution oscillation.\n\nTradingView\n\nThe analysis shows the past price fluctuations of Ethere­um and Solana, with annotations highlighting their respective­ values at various intervals. Ethere­um’s price reached its pinnacle­ around $5000, while SOL’s apogee occurre­d at approximately $600, indicating a parallel trajectory in the­ir ascent.\n\nSolana eme­rges as a formidable contende­r in the blockchain realm. Its exce­ptional throughput and minimal transaction costs, driven by the innovative Proof of History (PoH) conse­nsus algorithm coupled with Proof of Stake (PoS), position SOL as a viable alte­rnative to Ethereum. While­ Ethereum’s pionee­ring role in smart contracts and decentralize­d applications is undeniable, Solana’s technological advance­ments present a compe­lling case for its future growth and potential impact.\n\nSolana’s design e­nables parallel transaction exe­cution, a significant advantage over single-thre­aded blockchains like Ethere­um. MartyParty­ underscores Solana’s architecture­, which concurrently processes multiple­ transactions, departing from Ethereum’s se­quential approach. This parallel processing e­nhances efficiency and scalability.\n\nSolana Price Prediction\n\nCurrently, SOL’s trading value stands at $188, maintaining its position above the crucial support le­vel of $181. Its current objective­ is to reclaim the 50-day Exponential Moving Ave­rage (EMA) as a supportive factor. Despite­ potential efforts to surpass the $200 barrie­r, there exists a like­lihood that SOL may experience­ a decline back to $165.\n\nSource: TradingView\n\nThe blockchain platform re­tains an advantage among institutional investors despite­ obstacles. CoinShares’ report on ne­t institutional inflows reveals SOL attracted approximate­ly $25 million over the prece­ding month, surpassing the influx for other altcoins, eve­n Ethereum, over the­ same period.\n\nSOL’s potential upward traje­ctory, bolstered by substantial investor backing, could prope­l its price beyond the $200 thre­shold. This surge might defy current be­arish sentiments, enabling it to re­ach a pinnacle unseen for ove­r two years, a remarkable 28-month high.\n\nRelated Reading | Avalanche (AVAX) Successful Retest Signals Potential Price Rally"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxOQzU3Zm1kdmNfeXpNaVVZdlhzNVNHVDduWFNqN2dhRm16dVgxSlFKUjFqampDazFIYnM5aXpRY1FUalBxcVdHNHJteERnQ3Q3ODhfaXJtOFBZZm95YWZvSEwyOGtyenhKbXkyek9HWkRoRXRmd01Nbm5paHJDWm9ORTFiZll3S3ZhdDZ3M1ZqY0JaUdIBlwFBVV95cUxOLVRrLVBycXVXUjZrWFdxMlQySlJtN3EwQjVzbkQxdUNXMDhnSEd1NS15QmNJWjZIV0NTM2NhSThqNVo0VUpkTjFWbThKUi1aVFA5NTBqSWp5WnFiS0FjbDU0end3Q0ZlQjRKTWhBbzFPdXlUcDBvbm12bVhobkNFTGRuZ0l3ZTJTUzgyWlRVUHJNR0lMcjFJ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Apr 2024 07:00:00 GMT",
        "title": "Legendary Trader Peter Brandt Unleashes Fury on Ethereum: 'It's a Junk Coin' - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nLegendary trader Peter Brandt has unleashed a torrent of criticism aimed exclusively at Ethereum (ETH), labeling it a \"junk coin\" in a harsh assessment of the popular alternative cryptocurrency. Brandt, known for his insights into the financial markets, held no words as he criticized Ethereum, dismissing it as a useless challenger to Bitcoin's dominance.\n\nAdvertisement\n\nBrandt's disrespect for Ethereum was evident in a recent social media post where he disdained its status, asserting that it lacks the fundamental qualities necessary for long-term viability. He pointed to its alleged shortcomings as a store of value and criticized its functionality, citing difficulties with layer-2 solutions and exorbitant gas fees.\n\nBacking up his claims, Brandt referred to the Ethereum/Bitcoin price chart, highlighting Ethereum's steady decline against Bitcoin since the end of 2021. According to Brandt's analysis, ETH's recent drop to a critical support level of 0.05 BTC per altcoin signals further weakness compared to BTC.\n\nAdvertisement\n\nI get tired of saying it, but $ETH is a junk coin despite mindless devotion of Etheridiots.\n\nAs a store of value it is junk - a $BTC pretender\n\nIts functionality is also junk - difficult to deal with L2s and outrageous gas fees\n\nOf course it will always attract \"investors\" pic.twitter.com/7KAYMiwsnf — Peter Brandt (@PeterLBrandt) April 4, 2024\n\nThis is not the first time Brandt has expressed skepticism toward Ethereum. In January, he publicly announced a short position on the altcoin when it was trading at $2,265, citing weak price behavior. Despite Ethereum's subsequent price surge, Brandt admitted a month later that the trade did not go as planned.\n\nBrandt's criticism of Ethereum reflects his broader conviction that Bitcoin reigns supreme on the cryptocurrency market. He previously declared his belief that everything apart from Bitcoin is \"junk,\" emphasizing the main cryptocurrency's role as a primary store of value with significant potential for appreciation."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNd1dJUlBmRTJiTjIwY1E1V2VYdDBwLTBEckJWeGlYcElJdHEzemVxckZ4dU13Tnh1X3lhSUV0dkJ4OEQ2Qm10aTBFa3hnbnVXcWFmT3B2a0xFV28zenp6RmNZZWw0UG96Qk9pa3JBanRYUlh1NVRNcm95cm8xLWNLZmxHYVdFeV9OWmVmcNIBkgFBVV95cUxNZ2JfZlJmR0lsWWU0WFo4Q1ZkVGd2M1hrN0QtM1ZhOHlRS2ZuY0F4YmpTN1lDRnF0Unp1UUtKeG5pTDFFQkx4dUk4a3Q1Q0NkN0ctbDlsRElzQkhCM19IUjBvSWVPdmhzQTB4NlRkUjNxb0xKdTA3cU16RGZGd1VwNjJ3QlBadUdmYjVkakpzR3RIdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 Apr 2024 07:00:00 GMT",
        "title": "Veteran Trader Peter Brandt Makes Epic Solana vs Ethereum Prediction - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nPeter Brandt, a well-known figure in the trading community with decades of experience, recently predicted Solana price's potential to outperform Ethereum, triggering intrigue and speculation within the cryptocurrency community.\n\nAdvertisement\n\nIn a recent tweet, Brandt, a veteran trader, predicted that Solana (SOL) might double its value against Ethereum (ETH) if a significant resistance level is breached. This forecast comes amid ongoing market volatility, as evidenced by price drops.\n\nThe $SOLETH chart is at huge resistance. Resistance = supply. If this supply line is absorbed, then there is a prospect of $SOL doubling in value vs. $ETH.\n\nBTW, if you have not figured it out yet, I love dumping FUD on ETH -- I am actually not as bearish as my FUD indicates pic.twitter.com/jCiOey7SyU — Peter Brandt (@PeterLBrandt) April 5, 2024\n\nBrandt has identified a key resistance point on the SOL/ETH chart. In his words, he mentions that the SOL/ETH chart is a huge resistance.\n\nThe resistance level that Brandt refers to is a technical barrier where sell orders are clustered. If buyers manage to absorb this selling pressure, SOL's price relative to ETH might rise significantly, with the prospect of SOL's worth doubling against ETH.\n\nWhile it might seem that Brandt is bearish on Ethereum, he adds that he is not as bearish as his views might seem.\n\nBrandt expressed his skepticism about ETH in an April 4 tweet, referring to it as a \"junk coin.\" In what seemed like a shift in his position, Brandt said in a different tweet that he would not hesitate to take a leveraged long position in ETH if the charts indicated it.\n\nAt the time of writing, the SOL/ETH indicator was somewhat lower, at 0.0524. Solana was up 0.56% in the previous 24 hours to $174, while Ethereum rose 1.83% to $3,319.\n\nSolana addresses network congestion\n\nAnza, a Solana-focused dev shop building the Solana client Agave, has released updates on progress in addressing the present congestion on the Solana network. The fixes are likely to be issued next week.\n\nAnza, in collaboration with other core contributors, is analyzing the root cause of the network congestion on Solana and evaluating several potential changes.\n\nThe core issue relates to a QUIC implementation and the behavior of the Agave validator client on Solana when asked to process a large number of requests. In this light, the Anza team will be testing a patch to address current network congestion, and if successful, the patch might have a wider rollout.\n\nIn a bid to increase network performance, more improvements and changes are expected to be rolled out over the coming months."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMi8AFBVV95cUxOZ1RhbXU3WWFYZ3lod192MFlqTmx6RVRfNGVkbC15Qy1JZWIwcjROX1dCd2xGazE4eWp4Ul9leWhYTEJQUnNackxad0NXeW5uWU1wS2JuNlVrODVwcHBTaHhHX1hJZ2ZYWjhxTTBlQVFDazNXeUZpQUxGc0VHbWF2c0xBbFFCU3BYUEJvaW10STZTbExfMks2TDF2ODBvRkdGR2haWXEyLVpzX0Nfbjgwa0VvaGNqUzRvOTVSRDlmQXQxd1dHLUcyQS1uT0ktQUFfVDctQk5HMjRUX1l1UUhsWE5RdGc5T18xWWtLZkdvSVfSAfYBQVVfeXFMTW5pRnFpY3NqSU9pZ0RFc1hDbTZwUGJ5MWRldEdMVmcxWGFpWG5yNTU2anFqSklZZ2U1ZkQ5ZUp3S1ZLTi1RMEwtb0duU3ZiNFRYenl3NFp2WnhzLW5TNXlJTkZtZ3hvdUROdElGT0dEc0czcmNLdmtja0JwVldoeFRZU0tvZlNaY1lWN09nd1Y1dkhNZEtMTWZKSDEzQ1NMUlBENkliMFA4ZTdRSGZFVGl3NEdoYzAyd3RTak9ncS1GdGhQUjdzSWJwM0lQWmJqSkliXzZPTjBwdXBTd0Z1bWJDeFA3MGhOdkhPOTN0Zk1wM1NKTmJ3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Apr 2024 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: BTC coils up for a final shakeout before next leg up - FXStreet",
        "content": "Bitcoin price could revisit $60,000 before returning to the $73,777 peak as pre-halving dips are common.\n\nEthereum price could reclaim $4,000 if BTC closes above $69,000.\n\nRipple price could go as low as $0.5000 before XRP becomes attractive to buyers.\n\nBitcoin (BTC) price continues to drive markets, with the effects of its show of strength and weakness being felt across the industry in kind. As the market walks into the weekend, volatility is expected to increase as trading volumes reduce, which is characteristic of the weekend.\n\nAccording to analysts, the market could be due for a final shakeout before we continue on our next leg up. If there is any truth to this prediction, then three things stand:\n\nPre-halving dips should not be a surprise if history is enough to go by. The recent meme coin mania inspired euphoria across the market, with the current correction making it seem like the bull market has been canceled. This dip is probably the cheapest traders can buy altcoins for possibly the rest of the bull run.\n\nAlso Read: Bitcoin price upside potential grows as BlackRock draws more of Wall Street players into BTC market\n\nBitcoin could provide another buying opportunity\n\nWith the BTC halving barely two weeks out, Bitcoin price could provide a buying opportunity by retesting the supply zone between $58,375 and $65,518. BTC is already overbought, as shown by the Relative Strength Index (RSI), which is falling. The Awesome Oscillator (AO) is also recording dwindling histogram bars.\n\nAs BTC price consolidates along the $69,000 threshold on the weekly time frame, a pullback is likely before the bulls can decisively overcome this blockade.\n\nBTC/USDT 1-week chart\n\nOn the other hand, increased buying pressure above current levels could confirm the continuation of the primary trend. The first confirmation of this would be a candlestick close above $69,000, above which more buy orders could send BTC price to reclaim $73,777 or even higher to take $75,000.\n\nAlso Read: Layer 3 tokens see double-digit losses dragged by Bitcoin price drop\n\nEthereum price eyes $4,000, but there is a catch\n\nEthereum (ETH) price remains well above the ascending parallel channel and sits atop the ascending trendline. A successful bounce above this technical formation could see ETH price extend north to the $4,000 psychological level. Such an outcome, however, is contingent on BTC price decisively reclaiming ground above $69,000.\n\nETH/USDT 1-day chart\n\nOn the other hand, if the Ethereum price extends the fall in the hands of ETH sellers, the altcoin could fall back into the channel. A break and close below the upper boundary of the governing chart pattern would delay the uptrend. For it to be invalidated, however, ETH must break and close below $2,500.\n\nAlso Read: Ethereum on course to post weekly losses as debate over security status continues\n\nXRP price eyes $0.5000\n\nRipple (XRP) price could extend the fall to the $0.5000 psychological level if the bears can see the price close below $0.5783. A breakdown of this buyer congestion level could see XRP holders exit the market to avoid more losses.\n\nThe position of the RSI below 50 points to a bearish stance, reinforced by the Moving Average Convergence Divergence (MACD) in negative territory and the bearish histogram of the AO.\n\nXRP/USDT 1-day chart\n\nOn the other hand, if the bulls find their way, Ripple price could push above $0.6685. A candlestick close above this level could set the tone for XRP price to foray into the supply zone between $0.7311 and $0.7942. A candlestick close above its midline at $0.7655 would confirm the continuation of the trend, likely going as high as $0.8000.\n\nAlso Read: XRP price ranges below $0.60 despite Ripple stablecoin launch announcement"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxOQUszdFN3LXhxelhQNGpTY2Vydi02d0ZuT1ZFbkQ4NXJLeGFhel9MZktYbFRhZW1KZ0xHU3V3bVdfeHowSnA5UnpVdm1JNUZUTTJWTEVPVm9DcktiTmljQUcxNjBqR0REWUd0NUlHTk9HRGpURnlYVi1pMTF6cml3d1F1X0tNQndRcE9uT1ZLZ3d5TDRF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 Apr 2024 07:00:00 GMT",
        "title": "Explosion of L2 networks: Ethereum ready to tame its rivals - Cointribune EN",
        "content": "Sat 06 Apr 2024 ▪ 3 min read ▪ by Mikaia A.\n\n▪ Blockchain\n\nThe battle of Layer 2 solutions is raging among Ethereum, Binance, and Coinbase. But is it mere vanity or a lifeline for Layer 1 blockchains suffering from congestion problems? According to VanEck analysts, containing the rise of L2 networks will be challenging. By 2030, the market capitalization of similar mechanisms deployed on Ethereum could explode to reach 1 trillion dollars.\n\nEthereum L2: Prediction of Colossal Capitalization\n\nThere is currently a rush toward Layer 2 solutions such as Base (Coinbase), Arbitrium One, OP Mainnet, and many others. The reason? Their remarkable scalability, which constitutes a major asset as a blockchain infrastructure.\n\nVanEck analysts forecast a spectacular rise of Ethereum Layer 2 (L2) networks, reaching a market capitalization of 1 trillion dollars by 2030, reports CoinSpeaker.\n\nThe report, authored by Patrick Bush and Matthew Sigel, highlights the challenges of Ethereum in terms of data processing. Despite its dominance in smart contracts, its scalability limitations remain a hindrance.\n\nHowever, Ethereum is striving to improve its Layer 2 transaction processing capabilities, as demonstrated by the recent Denizen upgrade.\n\nThe bold prediction of VanEck is based on the belief that L2 networks are ready to capitalize on Ethereum’s weaknesses and meet the growing needs of an expanding ecosystem.\n\nWith rising transaction fees and prolonged processing times on Ethereum (ETH), the adoption of L2 networks seems like an inevitable solution for the future of blockchain.\n\nThe New Titans of Blockchain\n\nIn a striking report, VanEck analysts predict a future where Ethereum’s Layer 2 networks will surpass the base network in terms of revenue. According to Bush and Sigel, this rise is inevitable in the face of Ethereum’s inability to compete in terms of transactions and user experience.\n\nThis futuristic blockchain landscape, depicted by VanEck, reveals a dynamic ecosystem comprised of thousands of specialized L2 networks, promising to redefine industries and open new horizons. From decentralized social media platforms to specialized financial applications, the possibilities for innovation seem limitless.\n\nDiscover our newsletter This link uses an affiliate program.\n\nHowever, enthusiasm must be tempered, warn analysts. Despite the opportunities offered by L2 tokens, the competition is fierce. The top seven Ethereum Layer 2 tokens already display a valuation of 40 billion dollars, which raises the possibility of market saturation.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxOV1ZBMTdIVGVNRGVjeXd4S0RlUndNMzJGSndmdE03ckJrcGVUWkhXbkZtd045ckJ2eWU2LTVaNGxYblA3MDdSOG84NlVmeFZvZjFqT1FhRHJRS3lHY0J6NjRXUkFjQWRuMWs2UklJN1JMZzI1blFHcnhMM3hxa21FNTAzOG9BT3NYRlY00gGQAUFVX3lxTE0xODVCYlVPZUtXUk5ma0dRSmtQYlNsak5xakRwYzE1NXdWZkVzdXBpOThXb0d3QnFkN3FXRGZkNDA3dXNLSTN0Y0x0UjRLWlFaSFV4cTZNVnI5dzlVbkhyZFhhMlNlSDRRS1V1NUpkZXBsYnhCSUxsUmxnYVJtY2dOQ3U0TWp1OEZEUDVtUThGVg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis: Is ETH in Danger of Falling to $3K? - CryptoPotato",
        "content": "Ethereum’s price has been correcting over the past few weeks after setting a local high around the $4,000 mark. While the price is yet to recover, the bull market may be far from over.\n\nTechnical Analysis\n\nBy TradingRage\n\nThe Daily Chart\n\nOn the daily timeframe, the price has been consolidating between $3,000 and $3,600. Following the recent rejection from $3,600, the market is once again targeting the support at $3,000.\n\nThe Relative Strength Index has also dropped below 50%, as the momentum has seemingly shifted bearish. A break below $3,000 would lead to a potential crash toward the 200-day moving average around the $2,400 mark.\n\nOn the contrary, a rebound from the $3,000 zone could push the price back toward $3,600 and likely higher this time around.\n\nThe 4-Hour Chart\n\nLooking at the 4-hour chart, the recent price action seems very choppy. The price has tested the $3,600 resistance zone several times but has failed to continue higher toward $4,000.\n\nThe market structure is clearly bearish in the short term, as the price has been making lower highs and lows consistently. Therefore, a drop back toward the $3,000 zone will be imminent, if the price breaks below $3,200."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxQclUyRVhjbnFfelo4MDExU003MExBR0IxNGNuSjdaZEFvZmgyeHdVWFUwN2hGTkJyM1Z6NFB6a2VlWVhOVnlXZWFvVkJBNUt4RERQWU1maWtGV2p1ZXA5RjZRSDRncmdVVlN1UEI2ellWOGRPZEptN3VaOWNUakZNUFlhRGM0eXFxalR6Njc0WG5RbExBV3A5cUNYX0IxZEk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Apr 2024 07:00:00 GMT",
        "title": "Ethereum weak graphically against bitcoin: altseason at risk! - The Cryptonomist",
        "content": "At this moment the long-awaited altseason phase, in which most of the alternative coins record performances superior to those of Bitcoin, is at risk after a dangerous death cross appeared on the ETH/BTC chart on the weekly chart.\n\nThe downward crossing of the 50-period simple moving average with the 200-period moving average generally indicates a downtrend in prices.\n\nWith ETH weaker than BTC, it will be difficult to see a positive reaction in the altcoin sector in the short term, however the altseason could be closer than the market expects.\n\nAll the details below.\n\nDeathcross on the weekly chart ETH/BTC puts at risk the altseason phase of the bullish market\n\nWhile Bitcoin travels indecisively within the trading range of 62,000-71,000 USD, Ethereum moves with less conviction marking a worse graphic performance compared to the first cryptocurrency by market capitalization, and diminishing the hopes of retail investors to enter altseason in the near future.\n\nGenerally, in fact, the phase in which alternative coins mark monstrous value increases outperforming the digital gold, begins when the ETH/BTC chart shows signs of strong upward movement during the bull market.\n\nToday, looking at this chart on a weekly time frame we can notice a predominantly bearish trend of prices, with the simple moving average of 50 periods crossing downwards that of 200 periods.\n\nTechnically known as “death cross” this condition usually ends up generating a decline in prices, signaling the start of a potential prolonged underperformance cycle of ether and other altcoins compared to bitcoin.\n\nEthereum to Bitcoin ratio chart (ETH/BTC), Binance market\n\nIn the last few weeks of trading, market indecision has led ETH to record 5 red candles out of 6, after the currency had tried to attack the 0.06 sat zone but was rejected by bitcoiners.\n\nNow the loss of 0.05 sat could set the stage for further downward price flushing with the next support in the 0.04 sat area.\n\nThe difficult situation for ether is also confirmed by analysts from the company QCP Capital, based in Singapore, who stated in a recent market note:\n\n“The ETHBTC cross is testing a critical support level after dropping below 0.05. There has been a significant and persistent selling of ETH call options that has crushed [volatility] and also exerted some downward pressure on the price. It could once again be a very early signal of a FOMO [bullish] turning into fear in ETH as a proxy for alternatives.”\n\nWith the ETH/BTC ratio already down 10% since the beginning of the year, retail traders are starting to stop dreaming of an imminent altseason in the market, making room for different scenarios.\n\nHowever, the bullish reaction of ETH could be closer than we think: the cryptocurrency is approaching a support zone that in June 2022 managed to keep prices high, so it could also prove to be good this time.\n\nFurthermore, the ETH/BTC pair has been registering a continuous downtrend since September 2022, when each ether was worth 0.08 BTC: the bulls could soon take control of the situation again after such a long distribution period.\n\nHistory teaches us that when fear spreads through the streets, it is the ideal time to do business: if the dip in ether is absorbed, the chances of an altseason by the beginning of summer could revive.\n\n#Altcoins\n\n\n\nETH/BTC reaches the lower trend line of the falling wedge. We may see a fakeout, but I wouldn't bet on it.\n\n\n\nEither way, the whole chart looks pretty exciting.\n\n\n\nBiggest Altseason since 2017 is ahead of us imo.\n\n\n\nAll you need? Patience. pic.twitter.com/yNZlrTufSI — 𝕄𝕠𝕦𝕤𝕥𝕒𝕔ⓗ𝕖 🧲 (@el_crypto_prof) April 5, 2024\n\nBitcoin dominance still strong: too early for the altcoin golden moment, but memecoins are already showing excellent performance\n\nAnother very important chart to observe in order to understand when the long-awaited altseason phase will begin is the dominance chart of Bitcoin (BTC.DOM)\n\nThis chart shows the dominance rate, expressed in terms of market capitalization, of Bitcoin compared to the rest of the altcoin world.\n\nIndicatively, the altseason begins when, within a generally bullish market phase, BTC loses market share compared to competing coins\n\nHere too we can observe a situation that does not bode well for the arrival of an altseason, with BTC.DOM continuing its bullish rally since November 2022, bringing dominance to 54.68%.\n\nBitcoin (BTC) dominance trend chart\n\nIt might be too early to shout about the rise of the entire altcoin sector, at least until we see the first signs of weakness in the chart just presented.\n\nA first breakdown of 53% value, followed by a bearish continuation below 50%, could open the doors to a new market phase led by ETH and smaller cryptocurrencies.\n\nFor now, there are no encouraging signs in this sense, even though within the niche memecoin we observe a trend that seems to anticipate the arrival of the altseason.\n\nIn the Solana and Base blockchains, we notice a strong speculative activity on meme-based cryptos, which indicatively demonstrate the traders’ willingness to expose themselves to riskier products than Bitcoin.\n\nThis could be seen as a prelude to an even more aggressive phase, in which memes and low cap tokens could be targeted by the degens of the crypto world, abandoning bitcoin as the most attention-grabbing asset to make room for other alternatives.\n\nTo give an idea of how strong this memecoin mania is, we report the data from DefiLlama which shows a volume increase of about 10 times on the Base blockchain from February to today, from 50 million dollars per day to the current 500 million."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxOVm5EUlVBYk1hM0Fkb3BPamM0bENUTHlUYVhFZG5Gb2JpY19YQmtPSm1CQjkwazlYTG5Fa3J5RC1sb1dHcU5XYkxSQVFJYTFsUzFLT3JzYURVWXJKNmhQVzNxeF9xZnJTaEpVTU85SUhOdFA4dk9YMnlsR0dUNUY1TVpYVG4waHNiUlZueTRQdklkZURfLXNRWGNiSdIBoAFBVV95cUxQcnlRS1JTd0p3b1pIenR2Y0tpZEliZEFrMkhhUWlPenBnWHlTTHhONC1TN182cUR1eE8tZEpUTVNtTWJfX3AwdUpxTDRmZ0NqWEJOcmk5YTVtTHQ4NGNzX2xQV0pmMDRGS3RYNFVrdlJjU3UzZ3VfZWFNTFFFcWhMbG0xTkZzbnFaMFdFZ1lFOFZLNlk4cFRzeFg5X2RocHhX?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Apr 2024 07:00:00 GMT",
        "title": "Ethereum layer-2 market cap to reach US$1 trillion by 2030, VanEck predicts - Forkast News",
        "content": "Investment firm VanEck has predicted Ethereum layer-2 networks will collectively reach a market capitalization of US$1 trillion by 2030.\n\nThe projection, detailed in a report released on April 3, underscores the potential of layer-2 solutions to significantly enhance the scalability and efficiency of blockchain technology.\n\nThe analysis by VanEck points to Optimistic and Zero-Knowledge Roll-Ups as pivotal in addressing Ethereum’s scalability hurdles, setting the stage for a transformative impact on the digital asset sector and solidifying layer-2’s integral role within the Ethereum framework.\n\nVanEck examines various facets of the Layer-2 ecosystem, including transaction costs, user and developer experiences, trust requirements, and overall ecosystem size.\n\nIt emphasizes the anticipated benefits of the EIP-4844 upgrade, known as “Blob Space,” which is expected to drastically cut data posting expenses and financially benefit layer-2 operations.\n\nThe report also identifies transaction sequencing as a key revenue stream for layer-2 solutions and forecasts that by 2030, these networks will command a significant share of Ethereum’s transaction and total value locked, a measure for assets locked in a network’s decentralized finance ecosystem."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxOSndzUFAybzdMR1RjS0pEZjV5V3cxcEhlSjJGWXotNGZQWGhIUEwyTzhXRUlrNlJsOGJyZ1N6R01DcTRaeHYyQkcyMXRDaU9UYmFXZVJWRG9iTHM5anhSQ3hrVVp1UFhkV1NrVEUzUVlDR1JDSzVwNWc3YjU5bFhySlkyVmJZdnpoc1E4Vk01dHVUYWFmU3cySU1qaV9uUdIBowFBVV95cUxNamNiLXVqVnNJUXJUS1g5eHcyYkFWSUMxLUMtalJfTncyd3lYSjFQVTBtLVdwQXhDVFZscTd5Zm5WRThiQkk2LUhWTlI5QUh5N3ZfbmZ5N2pIak9KcDRkZXdDeWhCa2hiMnNmXy1hamxESHNWdkFGZnZEZzYtYndreVRrX0k0UnJfelpiUmNhclZLbDA1NnhZRGVQTXI5allFb2Nr?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Apr 2024 07:00:00 GMT",
        "title": "Crypto Prices Today April 5: Bitcoin At $67K, Ethereum Nears $3300, ADA & XRP Recover - CoinGape",
        "content": "The top crypto prices today witnessed a mixed action as the Bitcoin (BTC) price rebounded above the $67,000 level. In addition, the Ethereum price neared the $3,300 mark. Meanwhile, other top altcoins, such as XRP and Cardano (ADA)) recovered while Solana (SOL plunged significantly.\n\nMajor Crypto Prices Today\n\nThe Bitcoin price was up by 3.28% reaching $67,663.81 at the time of writing on Friday, April 5. On the other hand, it’s trading volume jumped 11.53% to $35.12 billion in the last 24 hours. Whilst, the crypto boasted a market capitalization of $1.33 trillion.\n\nadvertisement\n\nLooking at altcoins, the Ethereum price gained 0.40% to $3,295.34 at press time with a market valuation of $394.90 billion. Whilst, ETH saw its trading volume drop by 1.85%, reaching $14.62 billion. Meanwhile, the Binance Coin (BNB) price dipped 0.99%, reaching $573.70. in addition, its 24-hour trade volume slumped by 5.63% to $2.13 billion.\n\nThe Solana price dropped below the $180 mark today. The Solana price declined 2.99%, settling at $176.84. In contrast, SOL witnessed a 8.58% hike in trade volume to $4.17 billion in the last 24 hours. Whilst, the XRP price recovered and approached the $0.59 level. The XRP price recorded a gain of 2.41%, reaching $0.5833. On the other hand, XRP’s trading volume surged 40.82% to $2.15 billion.\n\nMeanwhile, the Cardano price rose 1.36% to $0.5835 today. Whilst, ADA recorded a 1.42% hike in its 24-hour trading volume, settling at $468.73 million. As the top crypto prices experienced volatility today, the meme coin arena followed suit. The Dogecoin price was down by 0.47% to $0.1743 while its rival, Shiba Inu price gained by 1.65% and traded at $0.00002673.\n\nAlso Read: XRP Price Market Sentiment Targets $1 Milestone Amid Rigorous Regulatory Debates\n\nTop Crypto Prices Today Are\n\nPepe Coin (PEPE)\n\nThe Pepe Coin (PEPE) crypto, a hyped Solana meme coin, didn’t see much change in price today. At press time, the Pepe Coin price was down by 0.26% to $0.000006737 with a market valuation of $2.83 billion. In addition, the 24-hour trade volume for PEPE slumped 16.19% to $510.13 million.\n\nPendle Soars 28%\n\nPendle (PENDLE), an Olympus Pro ecosystem token, recorded an impressive surge of nearly 28% and ranked as the top crypto gainer today. The Ethena price was up by 27.64% to $6.27 at the time of reporting. Moreover, its trade volume skyrocketed by a staggering 229.37% and stood at $332.14 million. Furthermore, the Pendle crypto recorded a new all-time high of $6.63 amid the rally today.\n\nAlso Read: Ethereum Price Forecast: Can ETH Still Hit $4,000 Pre-Bitcoin Halving?\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxNeVNWVXZUdTdNRzRXSE1TZXVBQmNaV0lZMkx5S3JxeGhsQzBiQ0hOMUtCbVpUX3FPTTYwYU56Sm1WczJrOV9LaVlWTHVDcHZmaERwZ2pJdmhjYk9XcFZUaTBzTkoyZ0h6ZVgzUXVjd1JBM2RYWlZMbVpuSWpfOUluNkhZamdKdTNGaFBNdWRnbHY0djRaMXd6NmFDSF9NSWo2M0RWNGpqb3ZyamtheXZTVXNjcG9lS29JVW1ManVKYkZfYU9uTVZZV0RwdS1pdWdEWXRmckZ1RG7SAeABQVVfeXFMUEVVakZJZ2lNNnBOcHhPVFpKZXQxZEtMa1duWUlubkVGbFhSVFFaVXlmTHB5eldfSDE4aW51YXdCOExYWFQwbTNQdGtsOHFJNGllQTdPMzZ3eHgzQ2ZscW9xSl9WWXowdGU2cXpaSEx3MVN4MDdsMGNMemltamdlU183QVRTTlQ3ZUdQVHo1YWVkQ1R1VHk3b1BaVEVXSUo5UkxKMFVBTDlPQjd1aFhxQ3dKaE5QUFVTd1QxYms1VzNYXzZ6Ymo2dmU0SVpNWlBHbDBmZGZGS0JkaWgzR1hzZjM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 Apr 2024 07:00:00 GMT",
        "title": "From DAG Chains To BlockDAG: A 20,000x Investment Surge Amid MEW’s Market Rise And Ethereum’s Wallet Expansion - Crypto News Flash",
        "content": "The ascent of Ethereum wallets to record levels combined with the significant rise in MEW’s value highlights the increasing interest of investors in the cryptocurrency market. BlockDAG stands out in this burgeoning field, promising an investment return of up to 20,000 times. With a successful presale raking in $13.5 million and selling over 6.6 billion coins, BlockDAG is rapidly becoming a major player in the cryptocurrency realm.\n\nBacking rumors from major tech companies, alongside a robust presence on social media and the integration of DAG, further elevate BlockDAG’s attractiveness, positioning it as a prime investment for those aiming to ride the next big wave in cryptocurrency investments.\n\nSurge in MEW Value Challenges the Dominance of Solana’s Memecoin\n\nA remarkable increase of 269.95% in MEW’s value over the last week has drawn the attention of major Solana investors and enthusiasts. This pivot to MEW from the previously preferred memecoin BOME showcases the potential of MEW in the cryptocurrency market. A significant purchase by a whale, acquiring 9.6 billion MEW or 10.8% of its total circulation, underscores the growing trust in MEW’s value.\n\nThis uptick in MEW’s value has also increased its market cap by 140.78% to $639.45 million, with trading volumes seeing a 322.97% jump. As MEW’s price trends upward, paralleling Solana’s 5.78% increase, it begins to challenge WIF, positioning MEW to become a key player in the memecoin arena.\n\nEthereum Wallets Achieve New Heights as Ether Makes a Comeback\n\nThe recent increase in Ether’s price, the cryptocurrency native to Ethereum, correlates with a peak in Ethereum wallet numbers, now reaching 118,230. This surge reflects the growing investor interest, despite Ether’s recent dip. After experiencing a 25% decrease in value, Ether has bounced back, exceeding $3,600, as the number of Ethereum wallets continues to rise.\n\nThe Market Value to Realized Value (MVRV) index suggests a potential undervaluation, coinciding with the rise in Ethereum wallets, hinting at a future price increase. With Ethereum wallets at an all-time high and Ether’s price nearing $3,590, the ecosystem’s vitality suggests further growth, particularly if the historical relationship between Ethereum wallets and market value persists.\n\nBlockDAG Sets Sights on 20,000x Return: The Premier Investment in Crypto\n\nBlockDAG emerges as a leading cryptocurrency, attracting investors with its sustainable blockchain technology and an impressive $13.5 million raised in its presale. Selling over 6.6 billion BDAG coins by batch 7 at a price of $0.0035 each, the project’s dedication is evident. The publication of its technical Whitepaper V2 with right to be displayed at Las Vegas’ The Sphere further establishes BlockDAG’s foundation, reinforcing its position as a top investment opportunity. BlockDAG’s integration of DAG technology underscores its commitment to sustainable and energy-efficient blockchain solutions.\n\nSpeculation about support from tech giants and substantial social media buzz enhance its appeal, marking BlockDAG as a top investment choice for those seeking a 20,000x return. Though specific investors’ names remain unconfirmed, the speculation surrounding BlockDAG boosts its attractiveness, indicating a strong potential for the project and encouraging further investment. BlockDAG’s innovative approach and focus on environmental sustainability set a new standard, drawing investors to this promising opportunity.\n\nThe Final Say\n\nIn the midst of the Ethereum wallet boom and MEW’s price surge, BlockDAG stands out as a luminary for investors, offering a 20,000x return that positions it as a formidable entity in the cryptocurrency arena. Its commendable presale achievements and the buzz about potential support from leading tech companies underscore the project’s robust potential.\n\nBlockDAG’s forward-thinking approach to blockchain technology and its emphasis on environmental considerations make it an enticing option for those seeking substantial returns. As interest in BlockDAG grows, it cements its place as a key player to watch for anyone looking to invest in the cryptocurrency market’s future.\n\nJoin BlockDAG Presale Now:\n\nWebsite: https://blockdag.network\n\nPresale: https://purchase.blockdag.network\n\nTelegram: https://t.me/blockDAGnetworkOfficial\n\nDiscord: https://discord.gg/Q7BxghMVyu\n\n[thrive_leads id=\"228374\"]"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMi9AFBVV95cUxPcTZsVW9tM1JrMnYyV055U0dNTlJReFU0YUcyQ2p3Y3hqTDBUd2xPTURvcEhpempSU1VXU0ZoUmlVT1VMNGJPV09FTVBjZi1xbXlLNmp5TVVjb21tSkZQNjZsdDlXWTY1d1NlX1VYa0Rka2U0alhDRkpZd1JEMEtyblZWbFN0MW16bTNScTRjWmJBMFZhMHpibnA0M2UtaXFvUF9vMDh5cVlUM0lwQTZSMHhPWUdKeHNfZXBYZWNOYVZhMXpYZTVIa1hvTkx0aHhnRm9uY3FkTWRPZGsyM0lhN1Nydlppa19kQ1VDMmIyUlJ3SDJE0gH6AUFVX3lxTE1GeC0xSW9mSWxwcTNlV3gyS01STmVxa25fanh5SDhJNjBuNzk3LVBoQmIxczVDTEk3ckVQdTRxZUwtWFNSUXo2S2pwd1lsVGhRZWthUERNdHlkRUcxOFNfdHhhcWdvOXd6RkhXdENVLWY4NXVVVDBDX1d5T010aERFOWZ1M2JXUHNEb01hM1lMeXZJX3Z0WUVtdlZ4dWlHTGRLQ0R3TnQ4VTVESW1SSzgtMmxSNHlvSmhvYTlZbm9mNG5pZHQtUkp2a1QyWWlXRkFLeFZYcWN2MXFSN3R1SUpZclBaamtScXpGNHRia1BMMjVTZTB5NEhHSnc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Set for New All-Time Highs, Shiba Inu (SHIB) Poised for 2x Gains, But Trader Predicts Parabolic Run for This New Meme Coin - Crypto News Flash",
        "content": "According to Criptopaul, Ethereum is due for new all-time highs this month.\n\nShiba Inu is expected to see a 2x price rally following a symmetrical triangle breakout.\n\nNuggetRush is a new hybrid meme coin poised to lead the 2024 bull market.\n\nCriptopaul, a top crypto analyst, has predicted that Ethereum will hit new all-time highs in April. Shiba Inu (SHIB) is another meme coin poised for a 2x price breakout following its symmetrical triangle breakout. However, these top altcoins will be outperformed by NuggetRush, a project changing the meme coin narrative.\n\nEthereum (ETH) Set for New All-Time Highs: Criptopaul\n\nCriptopaul, a top crypto trader, has shared a bullish outlook for Ethereum (ETH). Although ETH has underperformed BTC in 2024, Criptopaul has predicted that the leading altcoin historically outperforms Bitcoin during the month of the halving event.\n\nWith the halving event scheduled to happen in April, the Bitcoin trader expects Ethereum to form new all-time highs in April. He expects a new ATH in the next 30 days, making Ethereum one of the top crypto to invest in.\n\nBased on the predictions, an ETH bullish reversal is expected over the next few days. While ETH has dropped to lows of $3,300, the leading altcoin is expected to trade above $5,000 in April, making it one of the top crypto coins for every investor to add to their portfolio.\n\nNuggetRush (NUGX) Could See a Parabolic Rise in April\n\nAll eyes in the crypto space have been on NuggetRush (NUGX) as it recorded several milestones in its blockchain ICO phase. Amidst interest in its upcoming mining game, NuggetRush sold over 270 million NUGX tokens, raising more than $3.75 million in the process.\n\nThe rising momentum for NuggetRush is backed by its unique gaming ecosystem. NuggetRush is a hybrid project that innovatively combines GameFi with meme culture, NFTs, and staking. Within the game, players will perform various mining tasks, including recruiting miners, collecting mining equipment, finding gold, and selling them.\n\nThe exciting part of NuggetRush is its partnership with artisanal miners, allowing players to convert their virtual gold to real gold and cash. The interesting part of NuggetRush is its cooperation with craft miners, letting players transfer their virtual gold to real gold and money. Furthermore, NuggetRush has trending NFTs, RUSHGEMs, that can be staked for APYs of up to 20%.\n\nThe incentive rewarding system of NuggetRush has created increasing NUGX demand. However, NUGX is an ERC20 coin of the platform. NUGX benefited from this demand, rising by 100% to hit its listing price of $0.020. Analysts expect NUGX to be one of the 100x tokens of 2024, making it a must-have coin in 2024.\n\nShiba Inu (SHIB) To Record a 2x Surge, Crypto Analyst Predicts\n\nOver the last few weeks, Shiba Inu (SHIB) has been one of the most impressive top memecoins. SHIB price has risen over 150% so far this year. The crypto trader, Captain Faibik has forecasted that it may continue its bullish run into the weeks ahead.\n\nCaptain Faibik pointed out that Shiba Inu has printed a multi-week symmetrical triangle. On this bullish pattern, he has predicted a return of at least 2x within the next few weeks. The next uptrend marked a high of $0.0000580 by the crypto trader.\n\nClosing Thoughts\n\nEthereum and Shiba Inu are both poised for significant gains in the near future. However, traders are also looking to the next big thing, NuggetRush, as its new exciting model could be the future of the GameFi market.\n\nVisit the NuggetRush Presale Website\n\n[thrive_leads id=\"228374\"]"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxQYVBINDJjSmM1RGxoYVBJS2wxRlFUWFgxemZpU2Ixc0tGcEZMYUlBc29ERUZxT3dZa2xqYzFiVklnZl9LdFZvUjhmNThMNnVHeEx0cXdmSlpxeGhXblpCcWRRSTNLdVJrT0M5YTFPOHNfT0pzVnNFS0VLZzhpeXVLbFExbWhLVlg3NHRDa2NfbWNJb2dhdFpfcTdNVjVseDZKMG5nQXhVdFJMa205VG5pTm9XaW7SAboBQVVfeXFMUHFZM0hXcTNvV0QzY3dOemxGQ1hPV3c4U2hnTzhfQ3gta01SajkxaVFYM1EzR0lCSkxxUUsyMUlabWhERDFVMWZuSjloZWIwZzVPWEdURlQxVW03LXdUS0drTXluWk1oejJIVHR3djd1ZUZQVlg3ZmlPS25PUzk4WVExakVhUV8yQUZmZURBcDVHcTFlMjVwMFo0VmU0Z2xUSUJoM3BlNDJuV3A3S0p1Yy1MRWRKWmNHdUFn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Apr 2024 07:00:00 GMT",
        "title": "XRP's Unexpected Breakthrough, Shiba Inu (SHIB) at Crucial Resistance Level, Ethereum (ETH) Stronger Than You Think - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nXRP has recently seen a surprising increase in its price. It has gone over the important level of $0.6, which many traders think is a sign that its price might keep going up.\n\nPeople who invest in XRP might even go higher than the 50-day Exponential Moving Average (EMA). If they do, it could mean that XRP is becoming more stable on the market.\n\nWhen we look at the XRP price chart, we see that it has been moving in a strong way. It was stable for a while, but then it went past the $0.6 mark quite unexpectedly. Previously, this level stopped the price from going higher. Now that it has passed this level, it looks like people are more interested in buying XRP.\n\nIf XRP stays above $0.6, we might see it try to go past the 50-day EMA. If it can end the day higher than this average, we could see the price go up even more, possibly reaching $0.65.\n\nAdvertisement\n\nHowever, we must also think about what happens if the price starts to fall. The chart shows good support around $0.55, which has been a point of a previous price reversal. But if it falls below $0.55, the next big support is at $0.50. If the price reaches this lower level, we might see people start buying XRP again to stop the price from falling further.\n\nShiba Inu hits ceiling\n\nShiba Inu approaches the resistance posed by the 21-day Exponential Moving Average (EMA). If SHIB can surpass this resistance, it may signal the beginning of a rally, leading to a potential acceleration in price growth.\n\nLooking closely at the SHIB chart, we notice that the price moves near $0.00002756, closely challenging the 21 EMA. This movement comes after SHIB's price experienced a considerable surge, followed by a period of consolidation. The key to future momentum will be whether SHIB can maintain its strength and break through the EMA line.\n\nA definitive break above the 21 EMA could open the door to a further recovery, with the next resistance possibly around the $0.00003 mark. This area may act as a new challenge for SHIB, where it has previously encountered selling pressure.\n\nConversely, support levels are clearly established. The first level of significant support is found at approximately $0.00002256, a region where SHIB has found buyers in the past. If the price were to fall below this level, the next major support is around $0.00001941, which might serve as a stronger line of defense for the price to rebound.\n\nEthereum stays strong\n\nEthereum's resilience is often debated, especially during 2024's bullrun. A close examination of Ethereum's price chart suggests that the second-largest cryptocurrency is displaying a strong stance against prevailing market trends.\n\nThe current price of Ethereum stands at $3,378, with the asset showing signs of maintaining above significant support levels. The key support to watch is around the $3,011 mark, where the 100-day Exponential Moving Average (EMA) lies. It has previously acted as a strong support and may act like one again.\n\nOn the upside, Ethereum faces immediate resistance near the $3,500 zone, which coincides with the 50-day EMA. A consistent close above this average could signal a return of buying pressure, potentially leading to a test of higher resistances, possibly around the $3,600 to $3,700 range.\n\nAs for the positive scenario, if Ethereum can break through the $3,500 barrier, it may set the stage for a bullish run toward $3,600. This would be an indicator that Ethereum is not only recovering from sell-offs but also gaining momentum for a continued upward trajectory.\n\nHowever, a slip below the 100-day EMA might push ETH near the $3,011 level, which could act as a secondary support. Falling below this could bring the next critical support into play around $2,625, corresponding with the 200-day EMA."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxPaDdjX3docGVyOGhoY1U4RHZPQnFXazlKNXYtcEpUYjZrVjVSdnYwOXlpV1Itd3c1bU95Ty10QUs0N3d3d2ZwMURKYll3aXZoalJkSVdYTFZSak5QOTVqLXVlYzNjT1JfX0kxdW1YaG1rUnpqZ3RaV2czSEZJVjE5VFNRcXU1MnBSVHBFWFhQcTBiYTNpNlozWmp6VjhHVmJJOUZFN1lZVnpDTTNqM0pxY0Rsd3NnaFQzSkE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Apr 2024 07:00:00 GMT",
        "title": "Ripple Dips Into Stablecoin Market, With Plans to Launch a Stablecoin on XRPL and Ethereum - The Fintech Times",
        "content": "Ripple, the provider of enterprise blockchain and crypto solutions, plans to launch a stablecoin, pegged 1:1 to the US dollar (USD).\n\nRipple’s stablecoin will be 100 per cent backed by US dollar deposits, short-term US government treasuries, and other cash equivalents. These reserve assets will be audited by a third-party accounting firm, and Ripple will publish monthly attestations.\n\nThe stablecoin market is about $150billion, and is forecasted to exceed $2.8 trillion by 2028. There’s clear demand for stablecoins that deliver trust, stability, and utility. To meet this growing demand, Ripple will issue a stablecoin, leveraging its decade-plus of experience building real-world financial solutions for institutions around the world.\n\nAt launch, the stablecoin will be available on the XRP Ledger (XRPL) and Ethereum (ETH) blockchains, with plans to expand to additional blockchains and decentralised finance (DeFi) protocols and apps over time.\n\n“This is a natural step for Ripple to continue bridging the gap between traditional finance and crypto,” said Brad Garlinghouse, Ripple CEO. “Institutions entering this space are finding success by partnering with compliant, crypto-native players and Ripple’s track record and resiliency speaks for itself, as we launch new products and acquire companies through multiple market cycles. This move is also monumental for the XRP Ledger community, driving more use cases, liquidity and opportunities for developers and users.”\n\n“Issuing our stablecoin on the XRP Ledger and Ethereum will serve as a pivotal entry point to unlock new opportunities for institutional and DeFi use cases across multiple ecosystems,” added Monica Long, Ripple president. “The XRP Ledger’s native capabilities, including a decentralised exchange and automated market maker, were built to utilise XRP as the bridge asset https://dev.to/ripplexdev/xrpl-feature-spotlight-the-power-of-auto-bridging-2p2i. Bringing a trusted stablecoin onto XRPL will drive more adoption and development, contributing to a vibrant ecosystem.”\n\nKey benefits of Ripple’s stablecoin include:\n\nRipple specialises in blockchain-based enterprise grade solutions that financial institutions and enterprises need. Ripple will leverage both XRP and the stablecoin in its payment solution to further improve the customer experience and serve as the first enterprise use-case of the asset at scale. There is demand from Ripple’s customers in emerging markets to enable stablecoin payouts.\n\nRipple is committed to regulatory compliance and has a growing license portfolio in key regions around the globe. The company and its subsidiaries collectively hold a New York BitLicense, nearly 40 money transmitter licenses across the US, a Major Payment Institution License from the Monetary Authority of Singapore, and a Virtual Asset Service Provider registration with the Central Bank of Ireland.\n\nEarlier this year, Ripple agreed to acquire Standard Custody, one of the few crypto companies that holds a NY Trust Charter. In doing so, it expanded its license footprint to better serve enterprise customers. – liquidity on the decentralised exchange (DEX).\n\nWorking on the XRP ledger\n\nWhile XRP is the native currency on the XRPL, the Ledger was built to support any type of asset issued to trade on the DEX and quickly settle anywhere in the world with low transaction costs. Bringing more credible assets on the DEX, such as Ripple’s stablecoin, will drive numerous benefits for users, developers, and apps.\n\nBacked by a 1:1 reserve of cash and cash equivalents, Ripple’s stablecoin is designed to ensure transparency and reliability. Once the stablecoin is available, Ripple will publish monthly attestations of the assets.\n\nThe Ripple stablecoin will be issued on the XRP Ledger. It will also be issued on the Ethereum network using XRPL native functionality and ERC20 token standards. Developers on both XRPL and ETH will be able to incorporate the Ripple stablecoin so that users can transact with stability, confidence, and trust. Furthermore, The Ripple stablecoin will expand native issuance to other blockchains, allowing users to benefit from cross-chain interoperability."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxNSy0zRmFKOS1WeE5qUjVjZHlRTzVVT0Rpc3lVYlZfb0tWUkp6YnhBWThnM0tMLXdoTGlXelNnNzB2MEd0VFkybkVObDJJUUN4M0J5QUhaXzkzQlMtc1Qwc2kwQWMxZlJEQks2NXJXZkpyOG05ckhYRFViZlpCcDdRbmVMdlhmMy13UkxxVGFtM1VJd9IBlwFBVV95cUxQWk1QUVNKWFVOcmZZc2VhX1dzZTQ3aGJNM3FqeTZsbUp4clAyOEh0ZkZxQnN4R0phcWZMYmZVSnNkLXhKZFdKTnhncGNCTkozOGgxdlhTS2RTeFNoallyYkprcVN1YTdMa2xROFpCTHcwUm81NmF2bmhJaVlXMUFEQldQZjhGZFE5WTJCQU9ETU1obWdNdS13?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 Apr 2024 07:00:00 GMT",
        "title": "Ethereum: Still bullish on ETH’s price? Here’s why you might be right - AMBCrypto News",
        "content": "Ethereum outflows surged despite ETH’s price seeing volatility\n\nWhile traders got liquidated, long-term hodlers remain hopeful\n\nOver the last few weeks, Ethereum [ETH] has remained stagnant around the $3,500-price range. However, a recent correction pulled down ETH’s price on the charts significantly, fueling a change in sentiment.\n\nOutflows on the rise\n\nDespite this correction, however, there have been significant outflows of approximately 1,000,000 ETH, equivalent to $3.41 billion, from exchanges since March. This trend persists despite macroeconomic challenges and apprehensions regarding a potential rejection of a spot ETH ETF by the SEC.\n\nSuch outflows indicate that individuals are actively engaging in real activities on the Ethereum network, such as transaction payments, staking, and restaking. This also means they are confident in holding ETH despite unfavorable market conditions, rather than solely engaging in speculative trading. Nevertheless, liquidity for spot ETH remains highly valued.\n\nTraders bleed\n\nAt press time, ETH was trading at $3,254.80, with its price down by 2.68% over the last 24 hours. Due to the swift decline in ETH’s price, many traders’ positions got liquidated too. In fact, according to Coinglass’ data, $57.22 million worth of positions were liquidated over this period. Of this amount, approximately $41 million worth of long positions were liquidated.\n\nThe velocity at which ETH was trading at also fell in the last few days. This implied that the rate at which ETH was being traded declined materially. Moreover, the network growth of ETH has also decreased considerably, indicating that new addresses have been losing interest in ETH.\n\nA lack of interest from new addresses could affect buying pressure for ETH in the future and may impact its ability to climb back to the $3,500-level.\n\nLong-term holders show faith\n\nDue to the price correction, ETH’s MVRV ratio fell significantly. This indicated that most ETH holders were not profitable, at the time of writing. This could be interpreted positively as most of these holders don’t have any incentive to sell their holdings and the price of ETH could sustain its current levels going forward. Moreover, the Long/Short difference for ETH also spiked over the last few weeks.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nA rising Long/Short difference means that long-term holders outnumber the short-term holders. These long-term holders are less likely to sell their holdings and don’t tend to react impulsively to price fluctuations."
    }
]