[
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxQMzVNVGRmaVBSbTJwMm5OZWY2RktRRHlhdU94NVgwTTJUT0VMRkdzejBUMG9hY1dEOVJ3WGhZVk9tTXRJSTBKbU0zZjI3amsyZjRTSjlKWDZ2V1A5YmtaSm9aQzVmRXZ2aDR0TEFnTTRYNEhpam15MTBBTkNBSWdDcGhuTElkTEdfdnVPZEgwbXhuRHc5T2ZYaXpn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Mar 2024 07:00:00 GMT",
        "title": "BlackRock tokenizes money market fund on Ethereum. Invests in Securitize - Ledger Insights",
        "content": "Last night BlackRock elaborated on its plans for its first digital fund on the Ethereum blockchain, the BlackRock USD Institutional Digital Liquidity Fund (BUIDL), a money market fund that aims to offer a stable $1 value. It also confirmed it invested in tokenization partner Securitize, which is acting as transfer agent, tokenization platform and placement agent.\n\n“We are focused on developing solutions in the digital assets space that help solve real problems for our clients, and we are excited to work with Securitize,” said Robert Mitchnick, BlackRock’s Head of Digital Assets.\n\nThe BlackRock statement added that “Tokenization remains a key focus of BlackRock’s digital asset strategy.”\n\nTokens are available to eligible accredited investors as this is a Rule 506(c) issuance. Transfers can only take place between pre-approved investors, although that can happen 24/7/365. Round-the-clock trading is a key advantage and opens up 24/7 indirect access to Treasury markets.\n\nBNY Mellon is the custodian of the underlying assets, fund administrator and provides interoperability between digital and traditional markets. That latter point reinforces that this fund may target not only the crypto crowd but also institutions looking for 24/7 access.\n\nBUIDL’s assets will include cash, US Treasuries and repurchase agreements. In BlackRock’s words, this allows “investors to earn yield while holding the token on the blockchain.” That’s something that most stablecoins don’t provide, including USDC, where BlackRock manages the reserves. However, USDC can be used in any denomination, whereas initially the minimum BUIDL investment is $5 million, illustrating a different target audience. Per its recent SEC filing, that figure could come down to $100,000.\n\nTokenized securities and regulations\n\nWhile the role of Securitize as the transfer agent may seem like a throwback, it’s a regulatory requirement. So far the SEC has required regulated issuers to keep traditional book entry records, which are the definitive record of ownership. That includes the likes of Franklin Templeton’s OnChain U.S. Government Money Fund, which has more than $300 million in assets under management (AUM).\n\nGiven Securitize has experience and is both a regulated transfer agent, has tokenized feeder funds for KKR and Hamilton Lane, and operates an Alternative Trading System (ATS), it ticks all the boxes. One little piece of trivia – years ago, Securitize acquired a company called BUIDL, a Japanese blockchain development firm.\n\nFor the BUIDL token, several options are available regarding custody of the tokens. These include Anchorage Digital Bank, BitGo, Coinbase, Fireblocks, and others. All the firms are startups, highlighting the pressing need for incumbent custodians in the tokenized asset space. Their absence is due to the SEC accounting rule SAB 121, which makes it prohibitive for incumbent banks to provide crypto-asset custody at scale."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiaEFVX3lxTFBvdnpySjRrRlJIWGowQ1dUTDNlVll6LUNIaGJHYmRsUnNMaVh4U1ozeG9DUzVPWW9vaFhwV3FfNzBHalRfam44QXhVZTF6N00xZDc0MzZZYnp2V0pJSlQwanVOR2xOdTVV?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Mar 2024 07:00:00 GMT",
        "title": "Ethereum core devs campaign for gas limit raise to 40 million - Crypto Briefing",
        "content": "While the campaign aims to reduce transaction fees, critics have noted that such a change may negatively affect network performance.\n\nShare this article\n\nA group of Ethereum core developers has launched a new initiative called “pump the gas” to increase the blockchain network’s gas limit from 30 million to 40 million, with the goal of reducing transaction fees on layer 1 by 15% to 33%.\n\nCore Ethereum developer Eric Connor and former head of smart contracts at MakerDAO Mariano Conti unveiled the “pump the gas” website on March 20, calling on solo stakers, client teams, pools, and community members to support the initiative.\n\n“Raising the gas block limit 33% gives Layer 1 Ethereum the ability to process 33% more transaction load in a day,” the developer group claimed.\n\nThe Ethereum gas limit, which refers to the maximum amount of gas spent on executing transactions or smart contracts in each block, has remained at 30 million since August 2021. Gas is the technical term in Ethereum smart contracts which refers to the fee required (in gwei, a unit of Ether) to complete a transaction or execute a smart contract call.\n\nGas limits are standardized and set to ensure that block sizes are maintained at a level that will not overload or congest the Ethereum network, affecting its performance and synchronization. Based on specific parameters, validators can also dynamically adjust the gas limit as blocks are produced.\n\nThe direct effect of increasing gas limits is more space for transactions on each block. Theoretically, increasing the gas limit creates a correlational increase on a network’s throughput and capacity. The downside, though, is that the load on hardware is also increased, opening the risk of network spam and external attacks.\n\nHistorically, the gas limit has steadily increased as the Ethereum network grew. Ethereum co-founder Vitalik Buterin noted earlier in January that the three-year period since August 2021 was the longest that the limit has not been raised. Buterin thus suggested a raise to 40 million back in January, dovetailing with similar calls that have been gaining momentum in recent months.\n\nThe Pump the Gas website also notes that data blobs, introduced in the Dencun upgrade with EIP-4844, significantly reduced L2 transaction fees, but this was not replicated in L1 transaction fees. Ethereum developers behind the campaign believe that a combination of blobs and a 33% increase in the gas limit to 40 million would help scale both L1 and L2 networks.\n\nVarious opposing figures have raised concerns about the potential impact of the proposed raise on the size of the blockchain state, such as Ethereum developer Marius van der Wijden, who said that access to (and modification of) the blockchain state would gradually slow down over time. This argument over the concept of “state growth” is also echoed by former Ethereum chief decentralization officer Evan Van Ness, who believes that raising the gas limit should be done carefully, citing the lateral effects of EIP-4844 on block size."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiygFBVV95cUxNOFRNaFBlUHQtX09LRVlPaVZzVlFQMl9YU3Z0alZSYTlZeWFRdnc4YjdqY2hpRUxLUUdZTXh3a05IS1VsUS05Nk5QVTFYbEdhZUp5TkllYzlFb1BjVXZpajRrWE9LZTVrblNpbnJuVnVCZUdqUU5JbDVsWEVUblRpRzRfd0JMclQwaHpLMUpQZmhsWGkzRkFjOHJOOEhiZ2RRZ2JkUVdFUmN3amF1TEw2OXBLb0xMSWZINGstUzdjdTZ1N0VUUlNrUV9n?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "BlackRock Launches Its First Tokenized Fund, BUIDL, on the Ethereum Network - Business Wire",
        "content": "NEW YORK--(BUSINESS WIRE)--BlackRock today unveils its first tokenized fund issued on a public blockchain, the BlackRock USD Institutional Digital Liquidity Fund (“BUIDL” or the “Fund”). BUIDL will provide qualified investors with the opportunity to earn U.S. dollar yields by subscribing to the Fund through Securitize Markets, LLC.\n\n“ This is the latest progression of our digital assets strategy,” said Robert Mitchnick, BlackRock’s Head of Digital Assets. “ We are focused on developing solutions in the digital assets space that help solve real problems for our clients, and we are excited to work with Securitize.”\n\nTokenization remains a key focus of BlackRock’s digital asset strategy. Through the tokenization of the Fund, BUIDL will offer investors important benefits by enabling the issuance and trading of ownership on a blockchain, expanding investor access to on-chain offerings, providing instantaneous and transparent settlement, and allowing for transfers across platforms. BNY Mellon will enable interoperability for the Fund between digital and traditional markets.\n\n“ Tokenization of securities could fundamentally transform capital markets. Today’s news demonstrates that traditional financial products are being made more accessible through digitization. Securitize is proud to be BlackRock’s transfer agent, tokenization platform and placement agent of choice in digitizing and expanding access to its investment products,” said Securitize co-founder and CEO Carlos Domingo.\n\nBUIDL seeks to offer a stable value of $1 per token and pays daily accrued dividends directly to investors' wallets as new tokens each month. The Fund invests 100% of its total assets in cash, U.S. Treasury bills, and repurchase agreements, allowing investors to earn yield while holding the token on the blockchain. Investors can transfer their tokens 24/7/365 to other pre-approved investors. Fund participants will also have flexible custody options allowing them to choose how to hold their tokens.\n\nThe initial ecosystem participants in BUIDL include Anchorage Digital Bank NA, BitGo, Coinbase, and Fireblocks, among other market participants and infrastructure providers in the crypto industry.\n\nBlackRock Financial Management, Inc., will be the investment manager of the Fund and Bank of New York Mellon will serve as the custodian of the Fund’s assets and its administrator. Securitize will act as a transfer agent and tokenization platform, managing the tokenized shares and reporting on Fund subscriptions, redemptions, and distributions. Securitize Markets will act as placement agent, making the Fund available to eligible investors. PricewaterhouseCoopers LLP has been appointed as the Fund's auditor for the period ending December 31, 2024.\n\nThe Fund will issue shares pursuant to Rule 506(c) under the Securities Act of 1933 and Section3(c)(7) of the Investment Company Act. The Fund’s initial investment minimum is $5 million.\n\nBlackRock has also made a strategic investment in Securitize. As part of the investment, Joseph Chalom, BlackRock’s Global Head of Strategic Ecosystem Partnerships, has been appointed to Securitize’s Board of Directors.\n\nAbout BlackRock\n\nBlackRock’s purpose is to help more and more people experience financial well-being. As a fiduciary to investors and a leading financial technology provider, we help millions of people build savings that serve them throughout their lives by making investing easier and more affordable. For additional information on BlackRock, please visit www.blackrock.com/corporate\n\nAbout Securitize\n\nSecuritize, the leader in tokenizing real-world assets, is driving the compliant digitization of financial assets through next-generation blockchain technology. Securitize, or through its subsidiaries, is a registered broker-dealer (member Finra / SIPC) and operates a primary marketplace, an alternative trading system, as well as a top 10 transfer agent and has an exempt reporting adviser. Learn more at http://www.securitize.io.\n\nDisclosures\n\nInterests in BUIDL have not been registered with the Securities Exchange Commission under the Securities Act of 1933, as amended, and may not be offered or sold in the United States absent registration or an applicable exemption from registration requirements. Interests in BUIDL will not be listed on any exchange.\n\nPrivate market investments are speculative and considered risky, including potential loss of your investment, and may not be appropriate for every shareholder. Any discussion of liquidity is purely speculative. Past performance is not indicative of future results.\n\nSecurities are offered through Securitize Markets, LLC, (“Securitize Markets”) a registered broker-dealer and member FINRA/SIPC. Neither Securitize Markets, nor any of its affiliates provide any investment advice or make any investment recommendations to any persons, ever, and no communication through herein or in any other medium should be construed as such. Securities offered by Securitize Markets have not been registered under the Securities Act of 1933 and may not be offered or sold in the United States absent registration or an applicable exemption from registration requirements.\n\nBUIDL may not be able to maintain a stable value of $1.00 per token at all times. Investments in tokens using blockchain, such as an investment in BUIDL, involve a high degree of risk, including risks that are different from the risks of investing in traditional assets. These risks include, but are not limited to, risk of regulatory uncertainty, market adoption, market manipulation, market exiting, price volatility and security risk and may expose investors to loss of principal. Investments in private placements are also speculative and involve a high degree of risk. Investors must be able to afford the loss of their entire investment. Offers to sell, or the solicitations of offers to buy any security can only be made to qualified investors through official offering documents that contain important information about risks, fees and expenses associated with the applicable securities. Investors should conduct their own due diligence and are encouraged to consult with a financial advisor, attorney, accountant, tax advisors, and any other professional that can help them to understand and assess the risks associated with any investment opportunity. Past performance is not indicative of future results.\n\nBlackRock Financial Management, Inc. (the “Investment Manager”), a Delaware corporation that is an indirectly wholly-owned subsidiary of BlackRock, Inc., is the investment manager of the Fund and is responsible for its investment activities subject to the policies, control and supervision of the board of directors of the Fund. The Investment Manager is registered with the U.S. Securities and Exchange Commission as an investment adviser under the U.S. Investment Advisers Act of 1940, as amended.\n\nIn connection with its services as placement agent for BUIDL, the Investment Manager will pay to Securitize Markets cash compensation as follows: (i) an upfront flat fee and (ii) a quarterly fee with respect to each investor who is introduced to BUIDL by Securitize Markets generally equal to a percentage of the average daily net asset value of such investor’s interests in BUIDL for the applicable calendar quarter, with the amount of the upfront fee to be credited against the quarterly fee.\n\nThe compensation paid by the Investment Manager to Securitize Markets for acting as placement agent to BUIDL creates a conflict of interest for Securitize Markets. In particular, the amount of compensation received by Securitize Markets will depend on the number of investors that are introduced to BUIDL. As a result, Securitize Markets is incentivized to recommend that prospective investors invest in BUIDL. In addition, BlackRock’s investment in Securitize Markets creates a conflict of interest for the Investment Manager.\n\nSecuritize Markets or one or more of its affiliates may be a BlackRock client or investor."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTFBVSFJxSDNENHlwVUlnd0ZsUmU0ZTRxb1haUVcyYTR0ajFZY0ZtWkZkOXNtRWRENDFRVk9kTWh4TUx5VzRuYWJITkY3ZVg1emdTZVdULU1rVGl6UXlrQnFxWE05ei1NU1dpQmVpbEF6ZzdNTnREU1JkZA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 16:25:04 GMT",
        "title": "Ethereum Foundation removes warrant canary after ‘voluntary enquiry from a state authority’ - Blockworks",
        "content": "The Ethereum Foundation, a non-profit supporting the Ethereum ecosystem, removed the warrant canary indicating it’s never been served a government subpoena from its website on Feb. 26.\n\n“[W]e have received a voluntary enquiry from a state authority that included a requirement for confidentiality,” Ethereum web developer Pablo Pettinari wrote alongside a code commit removing the canary.\n\nThe Ethereum Foundation performs functions such as handling grants and providing research for the Ethereum ecosystem. It emphasizes that it does not control or lead Ethereum. Ethereum co-founder Vitalik Buterin serves on its executive board.\n\nThe Ethereum Foundation erroneously removed its warrant canary in 2019 — though this time seems to be for real.\n\nThe price of ether (ETH) fell more than 2% immediately after the news broke, furthering a bearish week for the token.\n\nIndustry watchers were quick to point out that the Ethereum Foundation’s “voluntary enquiry” could be no big deal.\n\n“It’s extremely common for crypto protocol foundations to receive voluntary requests for information from federal and state regulators. And subpoenas are about as sure as the sunrise for a crypto entity,” Mike Selig, partner at Willkie Farr & Gallagher, said on X.\n\nThe Ethereum Foundation did not immediately return a request for comment.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxQMkdJd0YxeHlNdTg1OHMwTjhCZkxNTmM2OEtlYkxpaDE4dkdhRFpiM2VuUTNJQW9UbGxYaDZUdnVMRlZYOUVJeWkzNTM0SUZwaENKOWsxMjRtNHZXTTlYdVRBSXlxVmdGdF80OVFuSHBOQXJHWXhsWDNJaENRSVp3OWdNb0ZWSkhi?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "What Happened in Crypto Today: Are Ethereum ETFs in Trouble? Analysts Are Losing Faith - Yahoo Finance",
        "content": "What Happened in Crypto Today: Are Ethereum ETFs in Trouble? Analysts Are Losing Faith\n\nThis week in crypto felt like we all got roped into a real-life Squid Game. The high-stakes challenges just kept coming at the community from every angle.\n\nIt started off with Bitcoin hitting a fresh new all-time high of around $73,000 last Thursday. The community was euphoric, dreaming of life-changing riches as the OG coin blasted through resistance like it was nothing.\n\nSource: BTC price page\n\nBut then, brutal reality struck. BTC retraced all the way back down to $63,000 as an aggressive sell-off neutralized the epic rally in a heartbeat.\n\nAs the market was trying to process the price chaos, a major drama erupted on another front. Trezor - one of the most trusted names in the crypto security game - got its social media account compromised. Their X account was used to shill a fake \"TRZR\" token sale in what felt like a cruelly personalized variation of the Red Light/Green Light game.\n\nAnd just when we thought things couldn’t get worse, the SEC made a move (well, not really!). Those awaiting rulings on the proposed ETH ETF applications got slammed as the SEC elected to kick those all-important decisions down the road yet again with delays.\n\nIn the midst of this password-pocalypse, the crypto news cycle kept on spinning with more major players making power moves. So let’s round up the top crypto stories!\n\nHere's a TLDR of the top headlines:\n\nLet’s get into the details of each of these stories!\n\nWe Hope You Didn’t Fall for TRZR…\n\nYesterday, things went south in the world of wallets - and it all started with one of the most trusted names in the hardware wallet game.\n\nOn March 19th, none other than Trezor, the cryptocurrency hardware wallet firm that's sold over 2 million devices worldwide, fell victim to a major security breach. And trust us, it wasn't pretty.\n\nAccording to reports, Trezor's official account on the bird app was hacked in what's suspected to be a SIM-swap attack. And once the attackers had control, they wasted no time in pushing an elaborate crypto scam.\n\nThe compromised account started promoting a fake token presale for \"TRZR\" token on the Solana blockchain.\n\nHow much money did its followers lose? Did Trezor make any official announcement following the incident? Read the full story!\n\nAnother Big Move by BlackRock\n\nThe world's largest asset manager has just filed with the SEC to launch a tokenized asset fund. And we're not talking about some small-time operation here – this is a big move from one of the most influential players in the finance game.\n\nStory continues\n\nAccording to the filing, BlackRock's new fund will be called the \"BlackRock USD Institutional Digital Liquidity Fund,\" and it'll be registered in the British Virgin Islands.\n\nBut here is the problem - if you want to get in on the action, you better have some serious cash to throw around because the minimum investment is $100,000.\n\nOn the bright side, if approved, we will probably see trillions pouring into tokenization and RWAs soon! Read the full story!\n\n$100M Web3 Gaming Fund?\n\nAnother day, another blockchain gaming investment fund, right? 🥱\n\nThis time it's Immutable, Polygon Labs, and VC firm King River Capital teaming up to launch a $100 million \"Inevitable Games Fund.\" Sounds impressive on paper, but what's in it for the average crypto degen?\n\nThey've already secured backing from big names like Abu Dhabi's Alpha Wave Ventures and Mike Arrington's family office. Moreover, the fund has its hands in a few buzzy gaming projects like Pixelmon and Guild of Guardians.\n\nBut at the end of the day, it's just another VC money pit...unless there's something truly game-changing in store.\n\nMaybe this trio has cracked the code on delivering an actual fun and worthwhile Web3 gaming experience? One that doesn't feel like a cash grab or tech demo, but an innovative blend of gaming and crypto that hasn't been seen before? Read the full story!\n\nMatter Labs Makes Moves\n\nIt's time to talk about a power move in the world of layer-2 scaling solutions and institutional finance.\n\nMatter Labs has teamed up with the digital asset bigwigs over at Sygnum Bank to tokenize $50 million of their treasury reserves. That's right – Fifty. Million. Dollars.\n\nBut wait, there's more! This tokenization extravaganza isn't just some random crypto flexing. Nope, these funds are being tokenized onto the very blockchain that Matter Labs built – zkSync itself.\n\nNow, for those of you who aren't familiar with the world of traditional finance (or \"Trad-Fi,\" as we like to call it), these tokenized funds will represent Matter Labs' investment into the Fidelity Institutional Liquidity Fund. And we're not just talking about some fly-by-night operation here – this Fidelity fund is an open-ended money market behemoth.\n\nFeels like RWA and tokenization are in line to be the next big trend to follow. Read the full story!\n\nSEC and ETH ETFs\n\nThe SEC has decided to keep us all in suspense a little while longer by delaying its ruling on the proposed spot ETH ETFs from Hashdex and ARK 21Shares.\n\nAccording to the SEC's announcement on March 19th, the final decision on these ETH ETF applications has been pushed back to late May, leaving the crypto community on the edge of their seats for at least another couple of months.\n\nIt seems that the market analysts over at Bloomberg are starting to lose faith in the prospect of these ETFs getting the green light. Yep, you read that right – even the seasoned experts are starting to doubt the SEC's willingness to play ball.\n\nWeren’t Bloomberg analysts too optimistic about ETH ETF approval in May? What happened? What did they say? Read the full story!\n\nPopular Game Developer Goes Web3\n\nThe masterminds behind iconic franchises like Final Fantasy and Kingdom Hearts are diving headfirst into blockchain gaming. And they're not just dipping their toes in the water – Square Enix has formed a partnership with HyperPlay, a Web3 games platform built on blockchain.\n\nThis collaboration isn't just a handshake deal – Square Enix made an undisclosed investment in HyperPlay, with the goal of expanding and scaling the platform's game store offerings.\n\nAnd as if that wasn't enough, Square Enix is also set to launch \"SYMBIOGENESIS,\" an art experience based on the popular cryptocurrency wallet MetaMask, on the HyperPlay storefront. Read the full story!\n\nThat’s a wrap! See you tomorrow with more crypto stories."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxQNm1XS2Y1aVY0MF9GNEc4U3I3cW5RVjhQalVVYXV0b3cyYVZXb2d1a21rbU4teXIyNG9RdWN2bGdWOVFJekpuR2hPV2o1dktPZG9YY3ZsenhHd2RmXzJMRGotdmVYaHBGb2Z6alg2WW9VMFdzVnRIb0ZGZ3FvNFBvV1Ntb1FGZl85?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Mar 2024 07:00:00 GMT",
        "title": "BlackRock is launching its first Ethereum-based tokenized fund - Quartz",
        "content": "In its latest foray into crypto, financial giant BlackRock has launched its first tokenized fund on the Ethereum blockchain. The BlackRock USD Institutional Digital Liquidity Fund, also known as BUIDL, is fully collateralized by cash, U.S. Treasury bills, and repurchase agreements. It provides qualified investors with an opportunity to earn U.S. dollar yields.\n\nThe top 15 cities for startups Share view video The top 15 cities for startups\n\nThe top 15 cities for startups Share The top 15 cities for startups\n\nBlackRock has partnered with Securitize as a transfer agent and tokenization platform, and BNY Mellon as the custodian of the fund’s assets. The fund’s ecosystem also includes Anchorage Digital Bank NA, BitGo, Coinbase, and Fireblocks, which will provide infrastructure to the fund.\n\n\n\nAdvertisement\n\n“This is the latest progression of our digital assets strategy,” said Robert Mitchnick, BlackRock’s head of digital assets. “We are focused on developing solutions in the digital assets space that help solve real problems for our clients, and we are excited to work with Securitize.”\n\n\n\nAdvertisement\n\nThe BlackRock USD Institutional Digital Liquidity Fund was first registered in the British Virgin Islands last year. It filed a U.S. Securities and Exchange Commission Form D for the fund.\n\nAdvertisement\n\n“BUIDL will offer investors important benefits by enabling the issuance and trading of ownership on a blockchain, expanding investor access to on-chain offerings, providing instantaneous and transparent settlement, and allowing for transfers across platforms,” BlackRock said.\n\nWhat is tokenization and how the BlackRock Fund will work\n\nIn simple terms, tokenization is the process of representing real-world assets digitally on the blockchain. BlackRock has consistently mentioned its digital asset strategy involves the launch of ETFs and the tokenization of financial assets.\n\n\n\nAdvertisement\n\nFor BUIDL, qualified investors who have at least $25 million in investable assets will create a digital wallet and sign up with Securitize to be able to invest in the fund. The fund’s initial investment minimum is $5 million. Investors can purchase a token at a stable price of $1 and earn interest in the form of the token. The tokens can be easily transferred from one wallet to another on the blockchain network.\n\nEverybody wants a piece of blockchain\n\nBlackRock’s latest move comes a few months after it launched the largest Bitcoin ETF, iShares Bitcoin Trust, which has continued to attract record inflows. Other investment titans, such as Franklin Templeton and Ondo Finance, have both introduced tokenized versions of money-market funds and ETFs, respectively."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxOMzZBeUQ3NFcyRjVaNm1UYVQ2RVEwaVAzWXgzXzQzT0Zoc1AxdjREMWhxNmxzZjFiNXpCNUpNcDRSS3FnaExwOVN6a1dpOTBxT0Q3Qnk1LTdueWVubVgtbDJUM2R0YmxXX3F3bC1PZEdCQk1rMVBXeTljaDJXVnlmWmc3REVRVW9BSE5OdFMtWW1UVU9SVTZHcnh3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Mar 2024 07:00:00 GMT",
        "title": "Solana’s Memecoin Boom Has Many Recalling Ethereum’s 2017 ICO Mania - Unchained",
        "content": "The popularity of memecoins on Solana such as BONK is stress-testing the layer 1 blockchain's throughput capacity.\n\nPressures on the Solana blockchain caused by a dramatic rise in the number of memecoin presales have drawn comparisons with the 2017 ICO craze that took Ethereum by storm.\n\nAs crypto markets have boomed in early 2024, tokens inspired by memes — frequently meme-friendly animals such as dogs, cats, frogs and sloths — have gained a large chunk of crypto investors’ mindshare. However, some traders have begun launching memecoins on Solana to such an extent that the network is facing challenges in performance.\n\nAs a result, some have noted how the current atmosphere and Solana’s struggles amid heightened activity closely resemble Ethereum in 2017 when initial coin offerings were all the rage and Ethereum became clogged up with congestion issues.\n\nWhat Solana ecosystem is experiencing now is extremely similar to what Ethereum went through during the 2017 ICO bubble. There is massive demand for SOL to speculate on new asset issuance on Solana Study Ethereum ICO bubble during 2017/2018 — Arthur (@Arthur_0x) March 16, 2024\n\nChris Eberle, who worked in sales and marketing at Facebook until 2017 and is now an angel investor and DAO contributor, said the comparison between Solana in 2024 and Ethereum in 2017 is “totally valid.”\n\nSimilarities to ICO Boom\n\nThe Ethereum ICO craze in 2017 tested the network’s capacity to handle congestion. During the year, Ethereum’s daily transactions surged from 38,730 on Jan. 1 to 946,981 by the end of the year, a 24x increase, according to Etherscan.\n\nIn 2017, startup SophiaTX delayed its planned ICO by 48 hours to ensure a smoother token launch. At the time, CryptoKitties, a decentralized application where users could breed and trade digital kittens, had clogged the Ethereum network because of the number of transactions on the dapp.\n\nMany now see a similar situation unfolding. The number of daily active addresses on Solana has more than doubled from around 600,000 on Jan. 1, 2024 to more than 1.4 million on March 18.\n\nSome Solana-based memecoin projects that have already conducted presales, including SMOLE and MOONKE, have delayed their token roll outs as a result of Solana’s congestion. “To keep everything fully transparent, with the current congestion of the Solana network we are going to bullishly delay our launch,” the MOONKE team wrote on X Tuesday.\n\nTesting Performance\n\n“The Solana network has been experiencing extremely high usage which has tested components of the network — specifically the implementation of priority fees and the transaction scheduler, both of which play important roles in block optimization,” the Solana Foundation wrote in a blog post on March 15.\n\nTom Wan, who works in strategy and business development at the parent company of crypto asset manager 21Shares, noted on X that the percentage of failed transactions on Solana has recently increased to 72%, although a large majority of these appear to be related to bots that are spamming the network because of the new token opportunities.\n\nRead More: Solana at 4, Memecoins Help Drive Network to All-Time High in Market Cap Post FTX Collapse\n\nMert Mumtaz, the CEO of the Solana-based developer firm, Helius, also indicated that Solana is facing challenges in performance from all this memecoin activity. In a private message to Unchained on X, he acknowledged the presence of bugs and said that improvements are “coming soon” to address Solana’s challenges. Despite this, Mumtaz highlighted Solana’s performance compared to Ethereum’s rollups, noting that “We’re able to do about 20x more TPS [transactions per second] than all [Ethereum] rollups combined currently (so roughly 2,000 tps).”\n\nQiao Wang, founding partner of crypto accelerator AllianceDAO, wrote on X this week that “Solana right at this moment is similar to the Ethereum 2017 ICO era.” He cited the demand among Solana users to trade memecoins and “an increasing demand for SOL to participate in those imos (initial meme offerings).”\n\nAngel investor Eberle noted that one similarity is how businesses aiding the launch of memecoins are mirroring firms that facilitated ICOs back in 2017. “It’s getting a bunch of people excited to speculate to try to get rich quick, again. We’re seeing businesses pop up in support of the memecoin ecosystem just like we saw the ‘ICO experts’ pop up back then,” Eberle wrote in a Telegram message to Unchained.\n\nRead More: Crypto Enthusiasts Raise Nearly $690,000 to Put Dogwifhat Meme on Las Vegas Sphere\n\nOne such ICO business in 2017 was Ambisafe, a company that was founded in 2015 to help people and institutions with fundraising and capital management. In the same vein, Blockchain App Factory is now providing services to support people and entities rolling out new memecoins on the Solana blockchain.\n\nSolving Problems Versus Producing Speculative Riches\n\nWhile both memecoins on Solana in 2024 and ICOs on Ethereum in 2017 have attracted lots of attention and massive amounts of liquidity, crypto users have criticized both for their emphasis on get-rich-quick schemes. “It’s frustrating to see billion-dollar-cap memecoins overshadow hardworking teams building legit products to advance this industry,” wrote Ki Young Ju, founder of blockchain analytics firm CryptoQuant, on X this week.\n\nEven though memecoins can show flashes of creativity and humor, Eberle noted that “we have to find more ways to lead with the power of blockchains to solve problems in new ways vs. speculative get rich opportunities.”\n\nAs Ju noted, “easy money can’t drive industry-wide progress, as shown by the 2018 ICO burst.”"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxPNE1CcERCZS1lUTlCbUVlVjJRRUZ1YlNRSkpQRDJSeUJYRGNHQWJVM2ZtLS1TOXA5amhHRWtvMjBKcFJadkQ0b3F3YlZVRF8xY3pDQk1IdFh6bVBFRFV2Q1RReEpaZk1GVjFpSGlpZUY1SUlkcXVHRmNXdkZjMllZQ0NGWG84SFBvRWtKb0JiTm0yOUNKYTY1TGVNWHpfdE0weFhZWg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "SEC’s reported move to brand Ether a security called an ‘excuse to not approve’ ETF - DLNews",
        "content": "Fortune reported the SEC sent subpoenas to three companies as part of probe of Ethereum Foundation.\n\nCrypto lawyers say it could be pretex to deny Ether ETFs.\n\nNews roils crypto industry as long simmering categorisation of Ethereum heats up.\n\nThe US Securities and Exchange Commission is attempting to classify Ether, the world’s second-largest cryptocurrency, as a security, according to a media report published Wednesday.\n\nCiting unnamed sources who said they feared reprisal from the SEC, Fortune said at least three companies have received subpoenas seeking information related to the Ethereum Foundation, the Swiss-based nonprofit that contributes to the development and promotion of the Ethereum blockchain.\n\nBut attorneys who spoke to DL News said the SEC’s classification of Ether as a security would have little real-world impact unless it was backed up by US courts.\n\n“The only thing that would matter is if they get a final, binding judgement from a court of competent jurisdiction, and even then I believe they would have a very hard time enforcing that in any practical way, beyond just charging the Ethereum Foundation a fine,” crypto attorney Gabriel Shapiro told DL News.\n\n“But it could give them an excuse to not approve an ETH ETF, which is likely their biggest objective here.”\n\n‘Voluntary enquiry’\n\nThe news that the SEC is investigating the Ethereum Foundation was preceded by reports from CoinDesk and The Block that said the Foundation had received a “voluntary enquiry” from an unnamed “state authority.”\n\nSEC Chair Gary Gensler has repeatedly said he believes Bitcoin, the original cryptocurrency, is a commodity like gold or wheat.\n\nBut he has remained noncommittal when asked whether Ether should be classified as a commodity or as a security, which is subject to more stringent and costly oversight.\n\nJoin the community to get our latest stories and updates\n\nWednesday’s reports suggest he has made up his mind.\n\nThe SEC has requested documents and financial records that detail the companies’ dealings with the Ethereum Foundation, according to Fortune.\n\nEther was down 0.5% over the last 24 hours in late afternoon trading UK time on Wednesday, according to CoinGecko.\n\n“[The] SEC has been pretty transparent that it informally thinks ETH is a security,” said Matt McGuire, a former senior prosecutor for the attorney general of Virginia and general counsel at Violet, a crypto identity platform.\n\n“It’s not surprising to me to read that they’re issuing a lot of subpoenas gathering information, but doesn’t tell us exactly what they’ll do with that information.”\n\nLightning rod\n\nThe investigation began shortly after Ethereum’s transition to a Proof of Stake “consensus mechanism” to tend its blockchain network, according to one source cited by Fortune.\n\nCryptocurrencies issued by blockchains that rely on Proof of Stake, or PoS, technology to confirm and order transactions could be classified as securities, Gensler has previously said on several occasions.\n\nSince taking the helm of the SEC in 2021, Gensler has become a lightning rod for criticism in the industry after the commission sued players large and small for alleged violation of securities laws.\n\nMost notably, the SEC sued three of the world’s largest crypto exchanges: Binance, Coinbase, and Kraken.\n\nThe SEC accused them of selling unregistered securities such as Solana’s SOL, Polygon’s MATIC, Cardano’s ADA, and several other tokens.\n\nThe industry has treated the crackdown as something of an existential crisis, arguing that applying 90-year-old securities laws to cryptocurrencies would amount to a death sentence given their unique features and the cost of complying with government regulations.\n\nEther ETF in the balance\n\nThe news comes as traditional financial institutions seek the SEC’s approval of a spot Ether ETF in the wake of the release of Bitcoin ETFs in January.\n\nBut hopes for its approval have been dwindling: Bloomberg Intelligence analysts this month lowered their odds of a May approval to just 35%.\n\nThose odds fell from 25% to 14% Wednesday on crypto prediction market Polymarket.\n\nAleks Gilbert is DL News’ New York-based DeFi correspondent. You can contact him at aleks@dlnews.com."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxPVkJxT1lzV0FneHFmcnA4Ymp6eldYY2pCQXNLSjgtRExkSGo1d2Y4aG0ybzR1Z0J1RG4tNTZkS0pORzJCYjlXWXNqR29JbE1vVFBwOGN4QS01ZjdabHJBa3VXb2NBUnRUc2NmODUyUXBwTXdEaHlTeDd6NFEtNURkc1FvTUItSDI3ZUNhT9IBkgFBVV95cUxPcG1GbnhDd1ZlUzcwTkVXbHJPRlRyUEh2aXlydTY3Yy1YY09oMS1ZTEJpLTlMLUJ3YU9lZUtHWWNJUDRlZjZueTNPaFYwbzhueUw2dzREVHRoYzBGV21yTEVnajRGRVlmampIRUpPUmFjeXd4bFJ2YXdwLXNHZWFjVGp0TEt4TXV4eEZ6Y2hnQTlrdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "Solana Leapfrogs Ethereum on DEX Volume - CoinDesk",
        "content": "At press time, the top trending tokens for the past 24 hours on the DEX Screener were from Solana. Such has been the speculative frenzy that 2,300 meme coins came into existence in a single hour on March 13 and the supply of stablecoins on Solana hit a multiyear high of $2.80 billion."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxOOTdwdTZ4UnU0eWVIWFdHVUM5M25GOHg2c3BMUnNzYTQ5ZTBxRGpsQTVBUXJta3pFa3JmQzVvaDJMVzg5LXpLd0FDZWlPT1p6dXhjcnU2YXI5Y1hUcXdrWk13NkdQZlpocklReXhKSExqWUZQaUlLNF85VkFSTExoanA5dnduaFRrRXlKUFM4ZmtNY0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "Grayscale Looks to Add Staking in Proposed Spot Ethereum ETF - Unchained",
        "content": "Grayscale Investments plans to add staking to its proposed spot Ethereum ETF, following a similar move from Fidelity Investments earlier this week.\n\nGrayscale Investments says that having the ability to stake ether would allow the fund to mitigate inflationary pressures and preserve value for shareholders.\n\nGrayscale Investments has included a provision to stake ether in its application for a spot Ethereum exchange-traded fund (ETF).\n\nIn a preliminary proxy statement filed on Tuesday, Grayscale put forth four proposals in a consent solicitation statement for its proposed Grayscale Ethereum Trust (ETHE) — a close-ended ether fund that it intends to convert into an ETF if approved.\n\nOne of the four proposed items included the ability for the fund to stake ether through the trust in a Proof-of-Stake validation protocol.\n\n“We hope you share our view that these amendments both modernize and simplify ETHE Shares for the ultimate benefit of current and future ETHE shareholders,” wrote Grayscale CEO Michael Sonnenshein.\n\nThe provision follows a similar one filed by Fidelity Investments in its application for a spot ether ETF, which the firm amended on Monday.\n\nMeanwhile, the outlook for a spot ether ETF being approved has started to look less promising, with Bloomberg ETF analysts now predicting that the U.S. Securities and Exchange Commission (SEC) will likely reject all applications in the pipeline.\n\n“We haven’t seen signs of SEC engagement with the issuers on this topic and we would have expected to see more substantial signs of interactions between the SEC and these issuers by now if the SEC were planning to approve,” Bloomberg ETF analyst James Seyffart said in an email to Unchained.\n\nThe overwhelming demand for spot bitcoin ETFs following their approval aided bitcoin’s push towards a new all-time high, and it is fair to assume that the price of ether might follow a similar trajectory if spot ether ETFs were to be approved. However, the SEC’s stance on the status of ether as an asset is markedly different from its view on bitcoin.\n\nSEC Chairman Gary Gensler has stated on a number of occasions that bitcoin is the only digital asset that can be considered a commodity, and “everything other than bitcoin” could be classified as a security.\n\nIn April, Gensler avoided giving a direct response to a question from House Financial Services Committee Chair Patrick McHenry on whether Ethereum was a security or a commodity."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMi0gFBVV95cUxOOXFoV2RQaXlKS2pGdG5IS0lXRUlSZjZ6RC04OU11aEJ4cC11MENMU2xfY3VjemlPVnR2VzlMTVNlSzZ3YlhTRHZ1N2lBemhFdXR6OG15TkFzMmJyRXBIY1NTTlZMUWxxVnVhMGNOOU5iUEJxR0xGSUJMVGJvUUpUTEtqWEFUMVdSNkJjb1ViZThBalJIajFFcXpjT3FhOW82SkV4amFSU1NLZW9ycktERlpmanlCeXkwU2FaUTg0M1Q4X2NncjBacnhhMW1VN0NKaGfSAdcBQVVfeXFMUGhvOHc0bGwzZGhKZnl0aDdCbVZ5M2k5Q3dZY1liWmdVMlowX0MzOFpEdXBjYzdrN3RBNkJHQjcyb0c5Tlg5eVljOVBBTmFGZEFGa2dfSFNUVnVxMnVEb0VyQ2t6SDduRnl5Nmc2UklfT3JxLUlveENuU3QtUl80YUZROFdYQ3J6emZYdkdYOU9KbjZlOUpkSHhDLU9VcVcxTXAzRE11cXB1aVRuUXdFZ2dLUDNTLWFYQ0ZKQk5YVXFIWkliSUtVU2F4N25sYXdHYVo5VEdCZFE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Mar 2024 07:00:00 GMT",
        "title": "BlackRock to launch tokenized fund on Ethereum as battle for ETF intensifies - FXStreet",
        "content": "Investment giant BlackRock says it wants to bridge TradFi and the crypto market.\n\nEthereum is up 11% amid speculations of a real world assets bull run.\n\nETH is a commodity and not a security, says Coinbase's chief legal officer.\n\nEthereum (ETH) could be set for further growth after $10 trillion asset manager BlackRock announced on Tuesday it's launching a tokenized asset fund on the largest smart contracts blockchain. However, the Security and Exchange Commission's (SEC) battle to classify Ethereum as a security may spoil the fun.\n\nBUIDL to debut on Ethereum\n\nEthereum has been rising in the past 24 hours after BlackRock announced its decision to launch its first blockchain-based tokenized fund, BlackRock USD Institutional Digital Liquidity Fund (BUIDL), on the Layer One chain.\n\n\"BUIDL will offer investors important benefits by enabling the issuance and trading of ownership on blockchain,\" as stated on Business Wire. The announcement said this would “expand investors' on-chain offerings, provide instantaneous and transparent settlement, and allow for transfers across platforms.”\n\nBUIDL aims to maintain a $1 peg per token as the fund would invest 100% of its underlying assets in cash, US Treasury bills, and repurchasable agreements. Investors who subscribe to the fund will earn yields paid as new tokens to their wallets at the end of every month.\n\nBank of New York Mellon will serve as custodian and administrator for BUDL's underlying assets, while Securitize will serve as the tokenization platform and transfer agent. BlackRock's partnership with Securitize also includes an investment into the latter to solidify bonds. Other key infrastructure providers for the fund include Coinbase, Fireblocks, Anchorage Digital Bank NA, and BitGo.\n\nThis comes a few months after the SEC's Bitcoin spot ETF approval saw BlackRock debuting their iShares Bitcoin Trust (IBIT). Additionally, BlackRock's CEO, Larry Fink, said in a recent interview, \"I believe the next step will be tokenization of financial assets...tokenization of securities.\"\n\nRead more: Ethereum faces steep correction as whales opt for profit-taking\n\nETH price growth faces fierce battle from the SEC\n\nAfter the announcement, some analysts in the crypto community speculated that this was a potential igniter to spark real-world assets (RWA) narrative growth. The real world assets category has recorded huge gains in the last 24 hours according to data from Coingecko.\n\nTop real world assets\n\nBut more importantly, Ethereum reaped gains of about 11% in the last 24 hours following BlackRock's update and currently trades at $3,566.\n\nETH/USDT 1-hour chart\n\nThis follows the latest update on the spot ETH ETF, which saw the SEC issue subpoenas to three US companies dealing with ETH transactions, according to Fortune. Speculations are that the subpoenas are related to an investigation aimed at classifying Ethereum as a security. The investigation is said to be based on the 2022 timeline when Ethereum transitioned to proof of stake.\n\nThis would hurt any chances of the commission approving a spot Ether ETF, potentially causing a drop in Ethereum's price. Furthermore, the Ethereum Foundation acknowledged it has been receiving inquiries from \"state authority,\" which many believe to be the SEC.\n\nRead more: Ethereum Foundation subpoenae threatens ETH ETF approval odds\n\nHowever, Paul Grewal, chief legal officer at Coinbase, has defended Ethereum in a recent post on X (formerly Twitter), stating that \"ETH is a commodity, not a security,\" as confirmed by several federal courts and the Commodity and Futures Trading Commission (CFTC). He cited instances where senior SEC officials, including Gary Gensler, had said ETH isn't a security before he became SEC Chair.\n\n\"The SEC has no good reason to deny the ETH ETP applications. And we hope they won't try to invent one by questioning the long established regulatory status of ETH, which the SEC has repeatedly endorsed\", he further expressed."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxQbmota29qYk52a1dUbzZkRmdib0RYN2xsUUN0Y0FPY1lBbVBISGhYemJzdWtJTXRYV0FvMkFVbHRIQnc2U0FPS2U3emNIUWlZbmh4UzV4MXlBdG1FMmlXeDE0bWpOdVdvU05GeWNoMEpQbTlmYTVFTmVHblBGLTc3U0lRVGh0TTJpNXc3YnozLUVqVExPUDhJeGxfZHprM25wV0drLWJ0b0sydDFGcjB5NlJWdU1uSWprd0tQT0lpZnhUcDQybHlFTS1OVXR1YmPSAdQBQVVfeXFMT2JRNUozalNuZHFZZlRGUElKbkItbXN0SjhaTjZIMXF4SmtaaDduTE1kNFc4WjFzdjlMbC0zUk1rd3p1Nnc2Z0pYUUk3QV9tYmxXTjVBVzh1dmhhQW5Dd2Q1dFZPcjFZVnN4Tjd6VThEdnQwT3ZDQm1TUjROWk5SZ3J2alB6WjUtR0FOS0ppTDNrdWE3Rk1fbG9KRldJVkRJSjgzbVJNakJCa3ZSZ3FFb21jZnJuQm5SOWo4Zm41RkN2ZWJNdm1vWGNPaDZSTGx0dXZtQzQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "Starknet, an Ethereum Layer 2, Plans 'Parallel Execution' to Mimic Solana's Speed Feature - CoinDesk",
        "content": "The feature will go live as part of an upgrade set for the second quarter, allowing Starknet to \"process a greater number of transactions simultaneously, resulting in improved throughput and faster L2 finality,\" according to a press release distributed by a representative of the developer StarkWare. It is part of the 2024 road map released Wednesday."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxNYnI1Wll0Z2g0WEtSUE94TkVBeGJ0V01NOTc3QllTbU5nWmNMNnJPWmdSLU5pTDllcV8wekthRFl2Y0J6SUVYZVpsajA2bjEzcGpvQVJZSUNfQ1lDS3dXZnAzSmROT3ZCTE1IMDdZUUdmQ0REa2hfVjJ1X3VvNXV1LWpiY21UOGIyaUxUb3hpQVlnbHZvMHVidy1mUG9DT1hTRzRr?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Mar 2024 07:00:00 GMT",
        "title": "Ethereum Killers, Layer2 Solutions, and Ethereum Dencun Upgrade: Who Will Benefit? - hackernoon.com",
        "content": "Using the Ethereum blockchain has become really expensive recently, with fees for sending Ethereum from one wallet to another reaching up to $2 and fees for swapping tokens within the network surging to over $50 when the network is congested. The problems of surging gas fees and scalability were solved in two ways:\n\n\n\n\n\nBy developing Layer-2 solutions for the Ethereum network\n\nBy launching projects that would offer the same functionality but without the most hurting problems.\n\n\n\nNow, there are over 45 L solutions for the Ethereum blockchain , and over 35 such solutions are in development. The Dencun upgrade allowed for a reduction in the Ethereum fees and resolved the issue of network congestion by allowing L2 solutions to keep some transactions off-chain and bundle transactions before sending them to the Ethereum mainnet. And only the most important transactions would be processed on the Ethereum blockchain. Ephemeral data blobs are also introduced, which are the storage units where intermediate results during transaction processing are stored.\n\n\n\n\n\nWith these solutions, the problems of scalability and high fees will be resolved.\n\nLet’s see whether it really worked.\n\n\n\n\n\nSoon after the upgrade, the fees on the layer-2 solutions dropped drastically. Here, you can have a look at the changes in fees for the main L2 networks.\n\n\n\n\n\n\n\n\n\nThe first part, the one with fees, has worked out. It is still not completely clear whether the second part has developed as expected, but we will learn about it soon.\n\n\n\n\n\nSo, with it, it is expected that these developments will allow Layer2 solutions and the main network to benefit in the long term.\n\n\n\n\n\nHowever, some experts warn that the introduction of blobs may have impacted the fees positively for a short time. In the long term, when Layer2 networks start competing for blobs, fees may rise again. Only the time will show how correct these forecasts are.\n\nBut what about the so-called Ethereum killers? How will this upgrade impact them?\n\nEthereum Killers: How Do They Work and How the Dencun Upgrade Will Impact Them\n\n\n\n\n\nEthereum killers - this is the name for projects that compete with Ethereum. While offering the same or similar functionality as Ethereum, all those projects use different technologies that allow them to overcome Ethereum’s shortcomings.\n\n\n\n\n\nLet’s start with some history.\n\n\n\n\n\nEarlier, Ethereum killers bragged about using a more environmentally friendly proof-of-stake consensus mechanism and its variations. But after the Merge upgrade on September 15, 2022, the Ethereum network moved to the proof-of-stake consensus mechanism, which reduced energy consumption by more than 99%.\n\n\n\n\n\nMany people expected that this would end with at least some of the “Ethereum killers” - at least with those who couldn’t offer anything but their environmentally-friendly approach. However, reducing energy consumption didn’t solve the issues of scalability and high gas fees. On the contrary, gas fees surged. Thus, eventually, none of the so-called Ethereum killers was impacted seriously.\n\n\n\n\n\nNow, let’s return to the recent upgrade.\n\nThe Dencun upgrade solved two main problems that the Ethereum network used to face: high gas fees and scalability issues.\n\n\n\n\n\nThis means that those Ethereum killers who relied only on faster transaction processing speed and low gas fees could indeed be impacted heavily. I doubt that projects running on such Ethereum killer blockchains will switch to the Ethereum network, but in the future, developers will prefer an established network, which Ethereum is, rather than networks that used to be competitors but lost their competitive advantage.\n\n\n\n\n\nHowever, some networks offer something completely different along with Ethereum’s set. Here they are, and this is why they will survive.\n\nPolkadot\n\nPolkadot is focused on something that is very important for Web3 - interoperability. It allows for the connecting of several blockchains and interchanging data between them without compromising security. Interoperability is essential for the future of Web3, and thus, the demand for Polkadot will be growing.\n\nSolana\n\nIt is cheap, fast, and backed by some major financial players such as JPMorgan and a venture capital firm, Andreessen Horowitz. The first two benefits of the Dencun upgrade have been added, and the last ones are raising concerns about the network’s centralization. Even though thanks to the financial support and already high adoption level, Solana may stay around for a while, I believe its importance will decline over time.\n\nCardano\n\nIt is a nice project with a lot of developer activity. However, its competitive benefits, such as eco-friendliness, low fees, and fast transactions, are not there anymore. Although many people love it, and thus it may survive just because many developers pick it based on personal preferences.\n\nBottom Line\n\nThe Dencun upgrade is an important milestone not only for the Ethereum network but also for the entire world of crypto and blockchain. Its impact is still to be assessed, but for sure, many changes are coming.\n\n\n\n"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE9GTmJMOWVRME1BMlI3Mms1VWFELTR1b0kyX2otYXk0SEJTWW1QWDBfNGJmR2s1eXRlY193eXZ6LXBvRzBrUVNBb3FzbmN4NTF4UlJEZmFSRENBbjhUSXlzTE8teURoSUNyWndYaVVfU29GNEs3Q0ZGLXh5SVg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Mar 2024 07:00:00 GMT",
        "title": "Why the SEC Shouldn’t Classify ETH as a Security - Yahoo Finance",
        "content": "Recent reporting from CoinDesk and Fortune suggests the U.S. Securities and Exchange Commission is preparing to classify ether {{ETH}}, the native token of the second-largest blockchain, Ethereum, as a security. The move would undoubtedly have severe repercussions for the entire crypto industry, including derailing plans for an spot ETH exchange-traded fund.\n\nThis is an excerpt from The Node newsletter, a daily roundup of the most pivotal crypto news on CoinDesk and beyond. You can subscribe to get the full newsletter here.\n\nCiting several unnamed sources, Fortune reported that the SEC has subpoenaed several U.S. companies for documents related to their dealings with the Ethereum Foundation, the non-profit that organized the launch of the eponymous blockchain and is based in Switzerland. Apparently, the probe began shortly after the Merge event that introduced ether staking in 2022.\n\nSee also: What Happens if Ether Is a Security?\n\nShortly after Ethereum’s proof-of-stake upgrade, SEC Chair Gary Gensler said that proof-of-stake chains, which pay users token rewards for locking up their coins as a security model, resemble investment contracts and could be classified as securities — though he did not mention ETH by name.\n\nHe has, however, launched lawsuits against a number of U.S.-based and international crypto exchanges including Coinbase, Kraken and Binance on the grounds that they were selling securities to U.S. investors without the appropriate registrations. These include assets like Cardano’s {{ADA}} and Solana’s {{SOL}}.\n\nETH has never been named outright as a security in an SEC enforcement action, a point that strikes crypto attorney Ignacio Ferrer-Bonsoms as contradictory. In a recent blog, Ferrer-Bonsoms compared Ethereum to Cardano to argue that if the SEC considers one to fall afoul of securities laws then it must consider the other the same way.\n\nBoth the Ethereum Foundation and Cardano Foundation raised millions via token sales to fund network development ($18.3 million in bitcoin versus $62 million, respectively); both govern their respective networks through foundations based in Zug, Switzerland; and both allocated tokens to their founders and foundations.\n\nMoreover, both foundations contribute work specifically to increase the value of their tokens. Ferrer-Bonsoms noted Ethereum’s burn mechanism, introduced in the EIP-1559 upgrade in August 2021, that made the network (sometimes) deflationary. “In this way, investors may perceive the token as an investment with expectations of value appreciation,” he wrote.\n\nIndeed, unlike bitcoin {{BTC}}, the only cryptocurrency that is hands-down a commodity under U.S. law, members of Ethereum’s founding team are still highly active in the industry. Vitalik Buterin, despite announcing a soft retirement on his 30th birthday, regularly introduces new ideas for Ethereum tools and influences the network’s roadmap while Joseph Lubin oversees the influential Etheruem incubator ConsenSys.\n\nStory continues\n\nSee also: How Much ETH Does Joe Lubin Hold? | Opinion\n\nAnd while technically there is a Bitcoin Foundation, it has almost no influence and does not pay salaries for Bitcoin Core developers.\n\nThe case against classification\n\nThat said, not everyone agrees that Ethereum is a security. Most importantly, the Commodities Futures Trading Commission (CFTC), the SEC’s smaller sister agency, has for years allowed ETH futures trading, implying that it is a commodity. And, in the CFTC’s lawsuit against Sam Bankman-Fried, the agency outright said ETH is a commodity (alongside BTC and {{USDT}}.\n\nIndeed, the SEC’s unilateral determination that ETH is a security would have severe repercussions for U.S. businesses and investors that already interact or rely on Ethereum, including major exchanges like CME Group and Cboe Global Exchange that trade millions of dollars of ETH futures per day.\n\nThe best argument that ETH isn’t a security is that it hasn’t been up to now and changing status would have harsh impacts. It’s “the whole ‘you can't just arbitrarily change your mind and damage people for hundreds of billions of dollars after a decade’ and also by the way the CFTC will likely fight back” argument, Austin Campbell, a Columbia Business School assistant professor, told CoinDesk in an interview.\n\nBrian Quintenz, a former CFTC commission and now head of policy at a16z Crypto, echoed this point on X, saying that when the SEC approved ETH futures ETFs to trade on its regulated security exchanges in October 2023 (months after the Merge), \"it explicitly acknowledged the status of the underlying, ETH, as being a non-security and outside of its jurisdiction.\"\n\n\"It will be interesting to watch what, if any, excuse the SEC uses if it were to delay or deny an ETH ETF given it has already informed the market on ETH being outside its jurisdiction,\" Quintenz added. It's worth noting that the news comes a day after the SEC was hit with unprecedented court sanctions for its \"gross abuse of power\" in a lawsuit it brought against the crypto company DEBT Box.\n\nBrian Frye, the Spears-Gilbert Professor of Law at the University of Kentucky, said the best reason against classifying ETH as a security “is that ETH looks more like BTC than any other token.” He added that “the SEC has repeatedly said it considers BTC a commodity, rather than a security ... primarily because of the lack of centralized control.”\n\nSee also: Coinbase Tried to Rein in a Renegade SEC | Opinion\n\nThe existence of the Ethereum Foundation casts a shadow of a doubt on that argument, Frye admitted. However, it is undeniable there are thousands of stakeholders in Ethereum beyond the founding corporation. In some areas even, Ethereum could be considered more decentralized than Bitcoin — including the number of applications running on it and developer count.\n\nFurther, IntotheBlock found that, as of six months ago, there are more than double the number of long term ETH holders (73.5 million) than bitcoin (33.61 million). There are 5,370 addresses holding between 1,000-10,000 ETH but only 1,920 addresses with between 1,000-10,000 BTC.\n\nNone of this may matter considering Gensler’s apparent warpath against crypto, an industry he sees as rife with fraud and financial abuses. The ironic thing is nearly everyone in crypto wishes Gensler would spend his time prosecuting actual crime, rather than harassing legitimate business or attacking decentralized protocols.\n\nFrye sees this apparent overreach as potentially Gensler’s undoing. “The SEC is getting too far out over its skis and is liable to crash. It's relying on Howey, which provides an extremely broad definition of ‘security’ and consequently gives the SEC very broad regulatory authority,” he said, referring to one of the tests the agency uses to define “investment contracts.”\n\n“But the Supreme Court can change Howey. And, the more aggressively the SEC regulates, the more likely a case will go to SCOTUS. As soon as one gets there, the Supreme Court is likely to ‘clarify’ Howey by narrowing it.”"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPam81RGZqUWw3akd5RE5CNVBqT3dXdy1IaHBHUVA5ZW9zT2I4SDVXZ0VLSldmOGhHNGhQQXRVM1pTRmFVU2RWWkhxTDI1ci1kTzhYUklNZmF2MnpZS2FyMFBiMW5UQ3ZEM1daN0I3OTA1bGZwVWRhclJKb0lIUVdsZTRSU2xOV3RJcUZvdzl2QUZQN2hlQUtUbg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "Morph, an Ethereum layer-2 for app building, announces $19 million seed round - Fortune",
        "content": "Morph, a layer-2 Ethereum Virtual Machine, today announced a $19 million seed round led by Dragonfly Capital.\n\nMorph is a fully permissionless EVM L2 that uses a combination of optimistic and zero-knowledge rollup technology to enable a user-friendly option for developers who require a chain on which to build finance, gaming, social media, and entertainment apps.\n\nFrom a technical stance, Morph has focused on blockchain’s trilemma problem—how to balance decentralization, safety, and scalability.\n\n“If we want to really bring blockchain to the next step, into mass adoption, we have to find a vertical which can really create value that the end users realize—so that’s why we focus on the consumer side,” Morph cofounder and CEO Cecilia Hsueh told Fortune.\n\nMorph is designed to offer the most “founder-friendly pipeline” for projects in the L2 space, the company said in a statement. The technology is built within three key pillars: decentralized rollup technology, optimistic zkEVM integration, and modular design. Developers building on Morph have access to tools to help transition from the earliest stages of building up through a potential token listing.\n\nIt’s also the first layer-2 on Ethereum to launch with a decentralized sequencer, meaning multiple entities or nodes can participate in the sequencing process, meaning the opportunity for any single node to manipulate transaction order is significantly reduced.\n\n“The existing L2 market is focused solely on short-term gains to be able to win the next casino round, rather than building for sustainable success. At Morph, we proudly help developers to create dApps that can truly make a long-term difference and win over a mainstream user base,” cofounder and COO Azeem Khan said in a statement.\n\nThe company plans to use the fresh capital on hiring, marketing to bolster its visibility within the L2 ecosystem, and refining its technical infrastructure. Additional investors include Pantera, The Spartan Group, and MEXC, with a further $1 million raised in an angel round. Bitget, the world’s leading cryptocurrency exchange, is an original investor in Morph and plans to continue playing a role in the Morph ecosystem.\n\n“We believe Morph’s technology can be exactly what developers in the consumer vertical need to pave the way for wider mainstream adoption,” Paul Veradittakit, a managing partner at Pantera Capital, said in a statement."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxNY3JYMDFBcEhtRjBfOUNiV1FWMHFLTGx1T3NGanp5dUZBTnlWVG1DcDZOUWdTZEVpX2pzRGwzM0NtS0NkY05YUE5ma1dNYVJyR2NKSlE1MnNOc1FScVB0MWtDWDdRRmp4UGswLXVhendaQmhWRFlfcWdsVDFZYkNLeEJsdDFFcnRUb1ZN0gGTAUFVX3lxTE56cmJhVEJMQ3lsTEg0U09nd1ZfR3NxdVJnbm1ESWR2UFVEbXNtcnRDU1pBTFlyN2o3bkNjdnRuN2FxZkpMYnNqLVIyRlY2U25PUGdHcFc3Z2pValM5Y1l4RkJJU0JxNHB5S212Rk9CWnU2aHhka29Nc1Q3UzhNNDAzWlhISjhjOFFONERHa1V1TThfbw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "How Much Has the Ethereum Dencun Upgrade Cut Layer-2 Gas Fees? - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nHeralded by Ethereum developers as the technical milestone they’d been “dreaming of,” last week’s Dencun upgrade was supposed to forever alter the Ethereum ecosystem—by making transactions on its layer-2 networks exponentially cheaper and thus more accessible.\n\nOne week later, how do things stand?\n\nOn the whole, Dencun has delivered exactly as promised. Across layer-2 networks that have already integrated the software update, gas fees have plummeted to unprecedented lows, in most cases by over 90%.\n\nAt writing, median transaction fees on layer-2 networks Arbitrum, Starknet, Optimism, and Optimism-based chains Base and Zora have all fallen to one cent or below, according to data from Dune and Ethereum analytics platform Grow The Pie. That’s a 91% to 95% drop in cost for each of those networks.\n\nAD\n\nAD\n\n2 hours ago, @arbitrum's gas fee dropped by another 80%. Now you only need 0.000004 ETH (about $0.01) to complete a transaction on this chain. This is fucking insane man! https://t.co/GgEv4AbGbz pic.twitter.com/2DNZlcLjmN — Larvandweb3.eth 🦇🔊 (@Larvandweb3) March 19, 2024\n\nDay by day, those costs continue to fall—from one cent down to mere fractions of a penny.\n\nEnabling Dencun’s near-elimination of gas fees is a novel data storage solution called proto-danksharding, which is powered by blobs. Blobs allow layer-2 data to be stored on-chain for a temporary period of about a month, as opposed to forever—the only previously available option.\n\nGm to 4844, welcome to @Optimism & @base Swaps now costing 1/10 of a cent Modularity scales. pic.twitter.com/CcZPshm836 — AureliusBTC (@AureliusBTC) March 14, 2024\n\nAD\n\nAD\n\nDencun’s drastic reduction of on-chain fees has impacted not just ETH transfers and token swaps, but also heftier NFT-related transactions.\n\nOn Zora—a layer 2 network built by the homonymous NFT minting platform—the most common transactions are (expectedly) NFT transfers. Nonetheless, the median transaction cost on the network is currently 9/10ths of a penny.\n\nCompare those minuscule figures with the Ethereum mainnet, where an NFT sale currently costs $72 on average, per Etherscan. Just weeks ago, due to network clogs, that cost neared $400 per NFT transfer.\n\nThis is huge Reducing transaction fees and confirmation times on Layer 2 will open up so many more use cases for crypto. We're finally getting scalability. https://t.co/X7K3TzkMno — Brian Armstrong 🛡️ (@brian_armstrong) March 14, 2024\n\nNot all layer-2 networks are quite there yet, however. Some are taking a bit longer to integrate Dencun-related updates across their settlement contracts. Polygon, for instance, has yet to see its gas fees fully drop off; mean transaction costs on the network are currently hovering around $0.72. Polygon Labs VP of Product David Silverman previously told Decrypt that he expects all layer-2s, including Polygon, will be fully integrated with Dencun within a month or two.\n\nWhile the impact of Dencun is clearly already substantial, some critics outside the Ethereum ecosystem—and even developers within it—have noted that transaction costs are likely to rise with increasing network traffic.\n\nWhile blob-enabled L2 gas prices are very cheap right now, we can expect them to increase a bit over time as demand for blobs increases. This is expected behavior & is why 4844 is only the beginning - blobs are an evolving primitive & are part of the wider danksharding roadmap. — sassal.eth/acc 🦇🔊 (@sassal0x) March 14, 2024\n\nAnd yet, most layer-2s with slashed gas fees have already seen dramatic increases in network activity. Daily transaction volume has more than doubled on Optimism, Base, Arbitrum, and Zora in the week since the upgrade; on Starknet, it has almost tripled. Gas fees on all those networks are still currently one cent or less on average.\n\nAD\n\nAD\n\nMany L2 developers hope that such sustained drops will prompt a fundamental shift in how users engage with Ethereum—moving the bulk of routine transactions onto L2s, and away from the costly mainnet.\n\nBut recent gains of layer 2s don’t appear to be at L1’s detriment—at least not yet. Traffic on the Ethereum mainnet remains consistent with figures from the past year, according to Etherscan; in fact, it’s slightly up since last week.\n\nEdited by Andrew Hayward"
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPS0VuYkNJalNJZzU2YnJLTm8yRjlaTjJVa2FONHRlM1V4Y283a0RfbEM2NDlSSTE1QmIxR2RKTDVGZEVqMEwyUjNkVUFrbktoZGRUNThXNWdDNVdZYnFpU1NEal9LWUFHVzk2aGRZdzlYWW1GMkZuMVVJLTJySXBfUjJZS2FRSTRlZW0w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "Solana overtakes Ethereum on DEX volume amid memecoin ‘presale’ frenzy - Fortune",
        "content": "Solana is now the top smart-contract blockchain by trading volume, surpassing Ethereum, according to data from DeFiLlama.\n\nThe volume of tokens trading on Solana-based decentralized exchanges, aka DEXs, climbed by 67% to $21.3 billion over seven days, whereas volume on Ethereum-based equivalent exchanges rose by just 3% to $19.4 billion. Likewise, the number of daily active addresses on Solana has also spiked, rising from 400,000 to 600,000 in January to February to roughly 1.25 million on Tuesday.\n\n“A lot of the surge we’ve seen in Solana DEX trading volumes will likely come from the memecoin wave that we’ve seen over the past few weeks,” Martin Lee, a data analyst at Nansen, told Fortune.\n\nSpeculative buzz around Solana-based memecoins dogwifwhat (WIF), bonk (BONK), book of meme (BOME), MAGA (TRUMP), and slerf (SLERF) is partially behind Solana’s recent successes. On March 13, 2,300 Solana memecoins were minted in one hour, meanwhile stablecoins on Solana reached a multiyear high of $2.80 billion.\n\nIn the last 1 hour, 2,500 Solana memecoins were created. — Ram Ahluwalia CFA, Lumida (@ramahluwalia) March 13, 2024\n\nThe speculative frenzy behind Solana’s memecoins has been catalyzed by a trend called “presales” whereby tokens are sold before officially launching. A buyer sends funds to a crypto address and receives the set number of tokens at a later date. Some estimate that over $100 million worth of tokens were sent to various memecoin presales over the weekend, mainly on the Solana blockchain, CoinDesk reported.\n\n“There’s a bastion of memecoins attracting users with the lure of outsized returns: Speculation on these are likely currently driving an influx of users, but I’m hopeful that new entrants will stick around,” Philip Forte, founder and CEO of Elixir, told Fortune.\n\nThe hype of presales has grown with the success of BOME. Last week, its creator took to X to offer a presale, and the result was that early investors turned a few hundred dollars into hundreds of thousands over a few days. Meanwhile, BOME’s market capitalization soared from zero to $1.6 billion in a few days, with over $100 million in daily trading volume, CoinDesk reported.\n\nThis BOME presale meta is the worst thing to happen in this space in a while https://t.co/06cOaB48W7 — Franz (@Franz_0x) March 17, 2024\n\nBut the presale frenzy has drawn criticism from some on-chain watchers, with one X user posting: “2 years later and everyone is right back to bidding ponzis. People can do what they want with their money but sending money to a ‘memecoin presale’ that has a 99.9% chance of rugging is actually just dumb as hell.” (BOME prices did drop after its launch, about 50% at the week’s start—steeper than a wider market correction.)\n\n“The reason Solana is able to capture all the memecoin volume as opposed to ETH L2s is because Solana’s transactions fees have been historically much lower,” Pat Doyle, Blockchain Researcher at Amberdata, told Fortune. “This makes investing in the speculative memecoins much more attractive as you don’t have a larger percentage of your transfer consumed by fees.”\n\nDoyle added: “Looking at this from a broader view, the memecoin craze is showing the ability for Solana to handle high volume and throughput.”\n\nAnd, to be fair, many investors had an eye on Solana before the latest memecoin boom: The blockchain’s native token SOL—though down about 8% today, to $168—is up almost 70% in 2024.\n\nAustin Federa, head of strategy at Solana Foundation, told Fortune in a statement that although the company expects some of the new users associated with the memecoin blitz to exit, \"We see this as a catalyst for a wave of new users to discover the usability and power of the Solana network—and stay for the long term.\""
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE91Sy16SDc3YUVwaklhM2dwRndTU0R5NlREMjFQUGF6MWNYcVg5NXpsTTZHZnRKUnNDclRKWTI0aE1ocUd4dHRWeWhuV1NXUFY5NlVJWmkwel9LTS03TjJRV1B2ZEVtZko3TVRRbkdqeFlHcVVDTFE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Mar 2024 07:00:00 GMT",
        "title": "BlackRock debuts BUIDL, its first tokenized fund on Ethereum - Crypto Briefing",
        "content": "Coinbase has been chosen as a key infrastructure provider for the new fund.\n\nShare this article\n\nGlobal investment manager BlackRock announced on Wednesday the launch of its first tokenized fund powered by the Ethereum blockchain. The BlackRock USD Institutional Digital Liquidity Fund, also known as BUIDL, is designed to offer qualified investors a new way to earn US dollar yields through subscriptions via Securitize Markets, LLC.\n\nAccording to on-chain data , BUIDL was initially seeded with $100 million USDC after BlackRock filed with the US Securities and Exchange Commission (SEC) to launch it on March 15.\n\nCommenting on the launch, Robert Mitchnick, BlackRock’s Head of Digital Assets, said that it is a critical milestone in the company’s digital assets strategy.\n\n“This is the latest progression of our digital assets strategy,” Mitchnick stated. “We are focused on developing solutions in the digital assets space that help solve real problems for our clients, and we are excited to work with Securitize.”\n\nThe tokenization of BUIDL allows for the issuance and trading of fund shares on the blockchain, offering benefits such as immediate settlement and enhanced liquidity, thus broadening the appeal to a more global investor base, as noted in the press release. BNY Mellon will facilitate the fund’s interoperability between digital and traditional financial markets.\n\nCarlos Domingo, co-founder and CEO of Securitize, lauded the initiative. He said:\n\n“Tokenization of securities could fundamentally transform capital markets. Today’s news demonstrates that traditional financial products are being made more accessible through digitization.”\n\nThe fund targets a stable token value of $1, distributing dividends as new tokens monthly. Its assets are entirely allocated to cash, US Treasury bills, and repurchase agreements. BlackRock Financial Management, Inc. will manage the fund, with BNY Mellon acting as custodian and administrator. Securitize will oversee tokenization and act as the transfer agent. The fund’s initial minimum investment is set at $5 million, and it will issue shares under specific SEC rules.\n\nThe fund’s ecosystem includes key players, including Anchorage Digital Bank NA, BitGo, Coinbase, and Fireblocks, alongside BlackRock Financial Management, Inc. as the investment manager, and Bank of New York Mellon as custodian and administrator. PricewaterhouseCoopers LLP has been appointed as auditor.\n\nFurthermore, BlackRock’s strategic investment in Securitize signifies a deep commitment to exploring digital asset solutions, with Joseph Chalom, BlackRock’s Global Head of Strategic Ecosystem Partnerships, joining Securitize’s Board of Directors.\n\nFor years, financial institutions have been exploring ways to harness blockchain technology to achieve tokenization of real-world assets. BlackRock’s CEO, Larry Fink, is not part of those skeptical; he has repeatedly expressed his bullish outlook on the future of tokenization.\n\nIn a January interview with CNBC, Fink outlined a two-step vision for the future of financial markets. The first step, he said, has been realized with the launch of Bitcoin exchange-traded funds (ETFs). The second step, according to Fink, is “the token digitalization of the assets.” He said that ETFs are key steps toward tokenization .\n\nBlackRock is currently pursuing regulatory approval for its spot Ethereum ETF filing, alongside other asset management giants like ARK Invest and VanEck. The SEC has a deadline of May 23 to make a decision on these applications."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxPMFktLWpOZm1ZQlhlODhybDR2WVVEdVUtSGJ1Qkt1QmJUcm1jSWxRd2RWdjlZNHc5bDdKTjl3b3kweFJjUEZDT0taN3B2Y0dTZGxJSFhmM2s5YnE3d1RqTW1RcmFJOHhWTDdaMTFKVTV0bWw1d1psSmEwQWI0N3JJNi1Od25DMnhiaUlycTVCOG14NUNGd0JFZWJjUXdmSjhxcjM40gGrAUFVX3lxTE9wZ0dPelViajFQMHR2cEhGYXlxQl84aXQxaG9hQ3JnTkZ3ekdIaThxdTFaODg0X1VBcWZIT0hsUE8zNWZxQ1ROYUlQaVRUZE5zaWZUSlE2T2x3ZktWU1pocGp6Y3NFRTJxc1MxUm1MRVNzbGV6cXlieFdyNS1LWDlpQkRkWTZOSHA5QmlVUWlWbk8zQkNnaURZUV9hTy1iOTBjQnVRUGI4cHlMSQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "Coinbase Transactions Are Failing Due to Congestion on Ethereum Scaler Base - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nLeading American crypto exchange Coinbase is having issues again Wednesday—but while other recent instances were blamed on a surge in crypto trading activity amid Bitcoin's rise to a new all-time high price, this wave of problems is being blamed on Base, the Ethereum scaling network that Coinbase itself incubated.\n\n\"Due to network congestion on the Base network, transactions on Coinbase Wallet and Coinbase.com may experience intermittent failures,\" Coinbase's status page reads. \"If your transaction is not confirmed by the network, please wait or submit your transaction again on Coinbase.com. We advise that Coinbase Wallet customers wait for congestion to resolve before submitting transactions on the Base network.\"\n\nFollowing the initial publication of this story, Coinbase representatives sent the following statement to Decrypt:\n\n\"Due to high network traffic on the Base network, transaction fees increased over the last 24 hours. Some user transactions that were submitted with lower fees may be stuck in a 'pending' state. If possible, users with pending transactions should cancel their transaction and resubmit with the latest estimated gas fee. If you are unable to cancel your pending transaction, the transaction will complete once traffic subsides. Rest assured, your funds are safe. Pending transactions will process once fees reduce. The Coinbase Wallet team is working on implementing a transaction cancellation feature, and will provide an update once available.\"\n\nAD\n\nAD\n\nBase transactions have spiked dramatically in recent days following last week's launch of the Ethereum Dencun upgrade, which promised to cut transaction fees on layer-2 scaling networks. Indeed, Base—which is based on Optimism's scaling tech—has seen a dramatic decrease in fees, falling by 90% or more alongside some other networks.\n\nPublic blockchain data curated by Dune shows a sizable leap on transaction volume on Base, rising from a daily average of about 400,000 daily transactions before the Dencun upgrade to a million or more each of the last several days. Base hit a new daily transaction record of 2.12 million on Saturday.\n\nEditor's note: This story was updated after publication with additional details."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxPTEU2U1lDRmR1alJEMVZ6RzdlUnBKYkszQnJDWXdZLVcySE4xcURYUk5nb0pfZGlrd1hrMkZmYlNaTy1TYjFvUjU5b2lRbHJvbjVpb3NLbW5IZkg3b3pIbV9Rd2JCNkdxQTlxSGZTWm5TeVJwY2x1TzJ3eTg2Sk5mSFFkcHA3SW1aVG1idWJlVDFpM1N0Y1kyR2NDRzc1dElZalE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Mar 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Price Recovers 7% Amid SEC’s Issue – Can Price Hit $4,000? - The Tech Report",
        "content": "Why Trust Tech Report Tech Report is one of the oldest hardware, news, and tech review sites on the internet. We write helpful technology guides, unbiased product reviews, and report on the latest tech and crypto news. We maintain editorial independence and consider content quality and factual accuracy to be non-negotiable.\n\nOn Monday, March 18, Ethereum native token ETH dropped closer to $3,200 as challenges caused by government regulation harmed the market. Based on reliable sources, the expected ETH spot ETFs will likely not be approved by the SEC in May again.\n\nHowever, despite this news and the negative sentiment it has caused, the price is gradually recovering now. 06:38 ETH is above $3,500, indicating a 24-hour increase of more than 6%. This suggests there’s still confidence and demand in the market for Ethereum.\n\nBut, considering the SEC’s power and influence on crypto assets, can ETH’s price reach $4,000 by Q2? Read on to find out.\n\nEthereum’s Strength Against SEC Scrutiny\n\nIn a surprising turn of events, the SEC considers Ethereum a security, just like they did with XRP. This could make trading Ethereum harder in the U.S., with more rules and paperwork.\n\nAlso, businesses using Ethereum might have to deal with stock-like regulations, making things tricky.\n\nIf Ethereum becomes a security, it might be delisted on some exchanges or might move to platforms for securities. This news could make investors nervous and cause them to sell, causing the price to drop. Already, Ethereum’s price reacted to these ideas, showing ups and downs.\n\nBut some known persons in the space are defending the digital, saying it’s not a security. Coinbase’s CLO, Paul Grewal, shared some information regarding the Ethereum issue via the X platform.\n\nEx. A. Senior SEC officials have said ETH is not a security, see e.g. SEC Director of Corporation Finance Hinman’s statement https://t.co/efXqCx4iyw 3/10 — paulgrewal.eth (@iampaulgrewal) March 20, 2024\n\nThe legal officer asserted that millions of U.S. citizens have held this coin since its launch in 2015. Therefore, it will be hard to classify this coin as security. Instead, Grewal said, “ETH is a commodity.” Further, he added a restricted document where an SEC senior officer said the coin is not a security.\n\nGiven the evidence in Grewal’s hand, it may be hard for the SEC to win any legal battles with Ethereum. Apart from Grewal, Anatoly Yakovenko, the cofounder of Solana, also supported Ethereum. Taking to the X platform a few hours after Grewal’s post, he said,\n\nIf the state is against Ethereum, then I am against the state.\n\nIf the state is against ethereum then I am against the state — toly 🇺🇸| bip-420 (@aeyakovenko) March 21, 2024\n\nCrypto enthusiasts should understand that even if the SEC imposes limits, people outside the U.S. could still trade Ethereum. Also, considering the current price gains, investors are seemingly not worried about the SEC problems.\n\nEthereum Token Price Analysis: Bulls on the Rise\n\nRecent news about plans to call Ethereum a “security” caused its price to dip. But the chart below shows green candles climbing back up, suggesting a recovery from that bearish mood.\n\nAlso, Ethereum is still above both the 50-day and 200-day Simple Moving Average (SMA) lines. That’s like a big thumbs-up from the market, indicating confidence in the coin’s potential. The red bars in the MACD are getting fainter. This means the bearish vibe is fading, making room for a more positive outlook.\n\nNow, the RSI is hanging out at 51. It’s in the middle ground. Not too overbought, not too oversold. This suggests there’s still room for growth without things getting too crazy.\n\nPlus, the price is heading toward the moving average line of the Bolinger Band indicator. It could signal a bullish trend if the bulls keep pushing and breaking through that level. So, should investors buy Ethereum now or hold off?\n\nBased on this analysis, things are looking up. The indicators are showing positive signs, and if the momentum keeps going, it could be an excellent time to buy in. But remember, nothing is guaranteed in the crypto market. So, trade with caution.\n\nMeanwhile, there’s another gem flying under the radar, promising potential gains. Investors scared of the SEC’s influence should consider this low-cap project before it starts mooning.\n\nEthereum Alternative Smog Set for Binance Listing – Time to Bag?\n\n>>>Visit Smog Token<<<\n\nSince Smog was introduced into the Solana ecosystem, it has been on a bullish ride, surging more than 1339%. This significant surge is because the project has a clear purpose, and a lot of exciting stuff is planned for the future.\n\nAlso, there have been rumors that Binance will soon list the coin on its platform.\n\nAlso, there’ll be potential token burning that will reduce the number of tokens in circulation. Further, prominent YouTubers like Jacon Bury and Matthew Perry have announced the coin has the potential to be the next 100x crypto in the Solana ecosystem. All these have created excitement within the community, causing the token price to climb.\n\nWhy Should You ADD Smog to Your Portfolio?\n\nFirstly, SMOG’s small market capitalization and cool dragon theme make it stand out. It’s not just another cryptocurrency; it’s got personality. Plus, the potential listing on Binance could mean big things for its value. This March, it shot up from $0.16 to $0.25, 56% in just one day.\n\nThis kind of growth has caught the eye of big investors, and they’re now making hefty purchases. Secondly, SMOG has a strong community behind it, which means stability and support for a coin’s value.\n\nEven though it’s still new, it already has over 50,000 holders and a thriving social media presence, with 34,000 Twitter followers and over 17,000 members in its Telegram group.\n\nLastly, SMOG is currently doing airdrop campaigns and teaming up with partners like Zealy for fun quests. This will keep holders interested and encourage them to stick around for the long term.\n\nOverall, SMOG’s combination of growth potential, community strength, and innovative engagement tactics makes it worth considering for those looking to diversify their altcoin holdings.\n\nDisclaimer: The opinions expressed in this article do not constitute financial advice. We encourage readers to conduct their own research and determine their own risk tolerance before making any financial decisions. Cryptocurrency is a highly volatile, high-risk asset class.\n\n🔎Looking for the next 10X crypto?\n\nCheck out the best crypto presales to invest now"
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxOYklJNmhzdnpxUEh3MDY4YnpFOVRrbWVDUzRfZFpheVFIWENmLUlFVndSMGhGOWRuMEZrM3kxYUtsQ2RzTF9vTjI1MC04eVJSMGJEVEV4U29NUU5sR1FiSjlyVVdqbDBLSkY2aWNmZUpKU2lPSUVIby1RUkxhVVc5aDZKb9IBiwFBVV95cUxNMGNpaWozQlg1SldDVzd4djUxZkM2anBRS1ZjS0xFSDBBWVBvQlhFNmp2YjNoQ1h2cEMzaUJpM1ZlNkFsblpLUHJhSXdJbm0tdjcyZy1MME1FU2E4MlMySUhiQ2o1TWt1Tm1yX2pyRk9KNGEtdjlPQ2JaRVJQZlZ6bk9iZWpfQW1oMVhV?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "Another CryptoPunks NFT Just Sold for $16 Million in Ethereum - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEthereum is down this week despite recently setting its highest price in over two years, but the market lull didn’t stop someone from spending big on Wednesday: A CryptoPunks NFT was just purchased for more than $16 million worth of ETH.\n\nPunk #7804, one of just nine Alien Punks in the influential Ethereum NFT collection, traded hands for 4,850 ETH on Wednesday afternoon, or $16.42 million at the time of the sale. That makes it the second-largest CryptoPunks sale ever whether measured in ETH and USD.\n\nThe sale comes just weeks after another Alien Punk (#3100) sold for 4,500 ETH, which was worth $16.03 million worth at the time of the transaction on March 3. As with that purchase, the buyer of this latest Punk has yet to be publicly identified. The Ethereum wallet used for the purchase was funded for the first time Wednesday via Coinbase.\n\nHowever, the seller of Punk #7804—who purchased it in 2021 for 4,200 ETH, or $7.57 million at the time—posted a message on Twitter, lamenting that they did not “elevate” the profile of that particular Punk during their time holding it.\n\nAD\n\nAD\n\nEnd of an era. I've long since felt like an imposter. Holding punks, and potentially NFTs a whole hostage by not elevating 7804 in the way he deserves. After over a year of looking around I feel I've found the right buyer with the right vision to appropriately elevate this asset https://t.co/onngtTumrJ — Peruggia (@peruggia_v) March 20, 2024\n\n“End of an era. I've long since felt like an imposter. Holding Punks, and potentially NFTs [as] a whole hostage by not elevating 7804 in the way he deserves,” the pseudonymous Peruggia wrote. “After over a year of looking around, I feel I've found the right buyer with the right vision to appropriately elevate this asset.”\n\nThe top CryptoPunks sale of all time happened in February 2022, when a crypto startup CEO purchased another Alien Punk (#5822) for 8,000 ETH, or $23.7 million.\n\nToday’s purchase now ranks as the fifth most expensive NFT sale of all time. The record is still held by Mike “Beeple” Winkleman, whose digital artwork collage “Everydays: The First 5000 Days” grabbed international headlines when it was auctioned for $69.3 million by Christie’s in March 2021, helping to ignite the initial fever around NFTs.\n\nAD\n\nAD\n\nMinted in 2017 by Larva Labs, CryptoPunks helped set the standard for tokenized profile pictures—one that would later be expanded upon by the Bored Ape Yacht Club and countless other collections that followed. The NFTs were originally given away for free, yet have generated nearly $2.8 billion worth of secondary trading volume to date, per data from CryptoSlam.\n\nEven the cheapest available CryptoPunks NFT on a marketplace is listed at about 51 ETH, or $177,000 worth. The CryptoPunks IP was ultimately acquired by Bored Ape Yacht Club creator Yuga Labs in 2022.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxPa3NHRm5HNE42UnpMdjlQTTFucWlSRkhZRERZYXZocldfTi1MRDNHbUs0alMtbzIzOVNQRklsT3hWYkFCQ2FUOVZtdXBhMTN5UVgxRFhSTV9sQXo1YTcxaGIxLU9xbHljZVRMcnZnWjRQbnFkWmVDLWE0bzRBN0ZmSXNlQkhzcGVxdVd0Q3F5dw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "BlackRock Enters Asset Tokenization Race With New Fund on the Ethereum Network - Yahoo Finance",
        "content": "BlackRock to start a new real-world asset (RWA) tokenization fund on the Ethereum network.\n\nThe asset management giant also made strategic investments in asset tokenization company Securitize.\n\nAsset management giant BlackRock (BLK) officially unveiled its tokenized asset fund on the Ethereum network on Wednesday.\n\nThe BlackRock USD Institutional Digital Liquidity Fund is represented by the blockchain-based BUIDL token, is fully backed by cash, U.S. Treasury bills, and repurchase agreements, and will provide yield paid out via blockchain rails every day to token holders, according to a press release.\n\nSecuritize will act as a transfer agent and tokenization platform, while BNY Mellon is the custodian of the fund's assets, BlackRock said. Anchorage Digital Bank NA, BitGo, Coinbase, and Fireblocks also participate in the fund's ecosystem.\n\nBlackRock also made a \"strategic investment\" in Securitize, the press release added, but the terms of the deal weren't disclosed.\n\n\"This is the latest progression of our digital assets strategy,\" said Robert Mitchnick, BlackRock’s Head of Digital Assets. \"We are focused on developing solutions in the digital assets space that help solve real problems for our clients, and we are excited to work with Securitize.\"\n\nThe announcement came after a regulatory filing revealed that BlackRock incorporated a fund with Securitize, spurring speculations of a tokenized fund as observers pointed to blockchain transactions to seed the vehicle, CoinDesk reported Tuesday.\n\nBlackRock is the latest traditional finance giant to enter the tokenization field after Citi, Franklin Templeton and JPMorgan have already made headways with the technology. Creating blockchain-based tokens of traditional investments such as bonds and funds – known as tokenization of real-world assets (RWA) – is a fast-growing use case for blockchains as digital assets and traditional finance (TradFi) are becoming more intertwined. Tokenized U.S. Treasuries , for example, have grown to $730 million from $100 million in early 2023 as crypto firms seek to earn a steady yield by parking their on-chain funds.\n\nBlackRock CEO Larry Fink said earlier this year in a CNBC interview that the company's spot BTC ETF was \"stepping stones towards tokenization.\"\n\nRead more: The Tokenization of Real-World Assets (RWA) Explained"
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE5OUTY3ZHVvOExkWEpzYl9ENDBnT3Vqakl2d2I2U1BzM2pUQXFTLXpKRTQ1TUJLV3c1VmxzOXBTazFJbjktMnZNZ1dmcnU2RG5qZ3gtQ2pSczZOZEdMOXhGbnRTNEJ2emk4bGl2dFlKR0hJUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Mar 2024 07:00:00 GMT",
        "title": "The Most Successful ICOs of All Time - Investopedia",
        "content": "In the trendy world of cryptocurrencies, the greatest levels of hype and anticipation have often been reserved for initial coin offerings (ICOs), the crowdsourced fundraising sales used to launch new tokens, coins, and services. ICOs have come to be seen as a significant risk for the everyday investor.\n\nThey are highly speculative since few ICOs go on to see the tokens they launch meet with real success—and many ICOs are actually fraudulent and are scrutinized heavily by regulators. Nonetheless, investors continue to watch the ICO space closely for the next big opportunity, and some ICO projects materialize. Below, you'll read about some of the biggest ICO events in history according to the amount fundraised or the return on investment (ROI).\n\nKey Takeaways An initial coin offering (ICO) is a fundraising method used by cryptocurrency and blockchain startups.\n\nThe startup develops a new cryptocurrency token with specific functions or utilities within its planned ecosystem. These tokens might provide access to a platform, voting rights in governance decisions, or a stake in the project's future value.\n\nThe success of an ICO is most commonly measured by the amount of money raised during the token sale, regardless of the cryptocurrency's price.\n\nOther investors measure the success of an ICO by the cryptocurrency token's return on investment (ROI) since it was purchased during the sale, taking into account the price.\n\nICOs by Amount Raised\n\nEOS\n\nBlock.one is a private Hong Kong-based blockchain company founded in 2017 by Brendan Blumer and Dan Larimer. Block.one conducted an ICO from June 26, 2017, to June 1, 2018, that raised $4.1 billion to create EOS, a blockchain platform with a native cryptocurrency of the same name, EOS. Block.one marketed EOS as a solution to some of the limitations of earlier blockchains, such as high transaction fees, slow processing speed, and a lack of network scalability.\n\nThe EOS ICO holds the record for the largest ICO ever and represented nearly a quarter of the entire ICO boom of the era in which it launched. Over 1 billion EOS tokens were sold, purchased using Ethereum's ether cryptocurrency (ETH), and distributed over 350 weekly periods, each lasting five days. The EOS ICO was conducted through a smart contract on the Ethereum blockchain.\n\nThe EOS blockchain was launched on June 14, 2018, shortly after the ICO was completed. The EOS cryptocurrency can be used for paying EOS transaction fees, staking for block producer elections, and participating in decentralized applications (dApps) built on the EOS blockchain.\n\nTelegram\n\nThe Telegram Open Network (TON) ICO raised over $1.7 billion in 2018. The ICO sought to build a fast, scalable, and user-friendly blockchain specifically for a decentralized application associated with the Telegram messaging app. Although it faced legal hurdles and technical delays, the launch of the TON mainnet in early 2020 sparked renewed interest in the project and its potential impact on the future of messaging and communication. However, the effort was terminated in mid-2020 after the SEC filed charges and won a lawsuit against Telegram for selling non-registered securities.\n\nTezos\n\nThe Tezos Foundation conducted the Tezos ICO from July 1 to 13, 2017. The ICO raised $232 million, primarily in Bitcoin and Ethereum. The funds raised were to be used to develop the Tezos blockchain platform and XTZ cryptocurrency, a project aiming to achieve high scalability, security, and self-governance through an on-chain amendment process. The fundraising structure was unique, employing \"non-refundable donations\" instead of traditional token sales. This led to some controversy, with some participants seeing them as investments rather than donations.\n\nFilecoin\n\nFilecoin, a non-profit organization, secured a staggering $233 million in 2017 when it sold its cryptocurrency token FIL through an ICO. The Filecoin project introduced decentralized storage solutions, a critical infrastructure component for Web3, and offered token holders the potential to earn from providing storage space under a sustainable economic model.\n\nPolkadot\n\nThe open-source blockchain project Polkadot successfully raised $145 million in 2017 to focus on building a blockchain that could provide interoperability between different blockchains. The Polkadot protocol and its cryptocurrency token DOT, which was eventually launched, allow seamless communication and data transfer across independent blockchains. Polkadot is seen as a key solution for blockchain fragmentation and fostering a diverse ecosystem.\n\nICOs by Return on Investment\n\nEther (ETH)\n\nEther, the native token for Ethereum, remains the second-largest digital currency by market cap as of March 2024. While Bitcoin is a blockchain and cryptocurrency, Ethereum is a blockchain designed to be a platform for decentralized applications to be built on. Its native token, ether, is used on the blockchain to pay for transactions and as collateral for honest blockchain work. Ether can also be used as a payment method, similar to Bitcoin.\n\nAt the ICO, ether sold for 2,000 ETH per 1 BTC, and the token's market value was $3,496 on March 21, 2024, providing a hefty ROI for the lucky investors who bought in during the ICO.\n\nNEO (NEO)\n\nNEO (NEO) is a Chinese open-source blockchain project that has gone by several different names in its short history. One of the most common is not an official name, however, but rather a nickname—China’s Ethereum. NEO gained this distinction by utilizing smart contract applications and decentralized commerce.\n\n\n\nThe company had a massive ICO thanks in no small part to support from the Chinese government, Microsoft Corp. (MSFT), and other major companies. From an initial token price of just over $0.03 to an all-time high price of roughly $180, NEO investors who timed their investments right stood to make an incredible amount of money. On March 21, 2024, NEO traded about $14.83.\n\nAlias (ALIAS)\n\nAlias (ALIAS), formerly known as Spectrecoin, launched in November 2016 as a purported privacy-focused cryptocurrency. One of the touted features of the coin is that it can be sent and received around the world with complete anonymity.\n\n\n\nAlias seeks to push the boundaries of what governments around the world are willing to tolerate from digital currencies, but it has not yet broken through to the mainstream. Nonetheless, an investment of $0.001 per token in late 2016 during the ICO would have been worth close to $0.15 in September 2021, making it one of the highest returning ICO tokens at one time. On March 21, 2024, ALIAS had a market price of $0.01341.\n\nArk (ARK)\n\nArk (ARK) is designed to be as efficient as possible. The digital currency platform allows for the quick integration of other cryptocurrencies into its own blockchain. With a global focus and a commitment to decentralization, Ark seems to have been destined for success.\n\nThe initial token price was $0.04 during the ICO. At its highest levels, one Ark token climbed to nearly $11, but traded at $1.12, on March 21, 2024.\n\nStratis (STRAX)\n\nStratis is another cryptocurrency that has not yet made it big into the world of leading digital currencies. The company, based in the U.K., prides itself on having a platform that is compatible with various programming languages, allowing businesses the ability to create and design custom applications easily.\n\n\n\nMicrosoft (MSFT) was a prominent supporter of the Stratis ICO, and that led to major success. The project raised nearly 1,000 BTC over a period of five weeks, and individuals paid just $0.01 per token. On March 21, 2024, the cryptocurrency traded for $1.50.\n\nAre ICOs and IPOs the Same Thing? An IPO, or initial public offering, is when a company's stocks are first offered to the public for trading. It is a long and regulated process for a company to \"go public\" through an IPO. In the past, ICOs were not as regulated, but the Securities and Exchange Commission cracked down on the practice and began requiring that ICOs that meet the criteria to be securities must be registered and approved.\n\nAre ICOs Subject to Investor Regulations and Protections? If an ICO token satisfies all four criteria of the Howey Test, it is likely considered a security and subject to securities regulations. This means the ICO must comply with relevant registration and disclosure requirements, offering significant investor protection.\n\nHow Does the Amount Raised by an ICO Differ From the Token's Market Cap and ROI? Unlike return on investment (ROI), measuring how much money an ICO raised alone doesn't account for inflation or changes in market value over time. A cryptocurrency token's market capitalization measures the total value of all outstanding tokens issued by the project at the quoted open market price, often at the current timeframe. Cryptocurrency tokens can be sold during ICOs at variable prices to different investors at the discretion of the token issuer.\n\nThe Bottom Line\n\nWhile success is subjective, it is largely agreed upon that the most impactful ICOs have launched an actual cryptocurrency and raised billions of dollars in capital to fund the ecosystem development of some of the most widely used blockchains.\n\nThe comments, opinions, and analyses expressed on Investopedia are for informational purposes online. Read our warranty and liability disclaimer for more info.\n\n"
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE9mLWxtR0huX0V2S3dFZkdiQmZNWWU3dlV4bzVlQ2hzX0xrdnk0MjEtUXdqZFFjc1pZVVBRWUw1TkpjdGI1VU9pZjJuSkpNZVFCSzhTelRvdnN4UzFwNzI1ZHYzVEdPZll0VzREMHEyTVoweGpXSDRn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "Solana Passes Ethereum on DEX Volume - CoinDesk",
        "content": "Solana has replaced Ethereum as the No. 1 smart-contract blockchain as trading volume in Solana-based decentralized exchanges (DEX) has increased 67% to $21.3 billion in seven days, according to data tracked by DeFiLlama. Could the increase in volume be catalyzed by the hype around Solana-based meme coins? CoinDesk's Jennifer Sanasie presents the \"The Chart of the Day.\""
    },
    {
        "id": 74,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTFBOd3p4VUh3ajBWblFnRzFreDNqM2tmbldfVEtOVUVzeWRZU281cHdwRHJBV0YyUVZfUDJyU0IwVnNodEZfRE1uZ2phWG84dlVtdjVWMkdQVFpPYjVCSS1Id1lNWDZXbjZaUzZ2cFhQajJJbjdUMnNKM3ln0gGCAUFVX3lxTE9helY1MkpiTk5tWXdSU1JZOU54M3JuV01rdEo0UWJvd0VRZTU5eWRMWktTc3hwRFlhZWdPQXQwRldiT0lUOWp1UGZyd1BpMlB0cW5pTjZ0dW1DdVZ5a3NSczc1VmhucmlMbExUY0FpOWNLQmVWMFQyd2pRTjV3SVpPaXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Mar 2024 07:00:00 GMT",
        "title": "Ethereum, Solana and Their Meme Coins Bounce Back - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nSolana and Ethereum, homes to some of the biggest and most popular meme coins, have both posted gains in the past day.\n\nAt the time of writing, SOL has increased by 10% and ETH by 6% compared to this time yesterday. That puts Solana at $189.98 and ETH at $3,541 at the time of writing.\n\nThe 7-day comparison tells a very different story, though. ETH is currently 10% lower than it was this time last week, when it was still basking in the afterglow of devs having rolled out the Dencun upgrade on mainnet. The upgrade was much-anticipated because the impact it will have on fees and transaction times on Ethereum Layer-2 networks. But the realization of those benefits has so far been gradual.\n\nAD\n\nAD\n\nOver the same period, SOL has gained 10.2% since this time last Thursday. And as is usually the case, what's good for the underlying network has also been good for many of the tokens that trade on it. In this case, that means a bunch of meme coins are seeing a resurgence.\n\nFloki Inu (FLOKI) is leading the pack, having posted a 27% gain since this time yesterday. But at $0.0002297, it's still trading 19% lower than it was last week. Last week's crypto market rally was enough to push the Ethereum-based meme coin towards its all-time high. But it fell just shy of surpassing $0.0003365, which the Shiba Inu-themed coin last saw in November 2021.\n\nFLOKI AND TOKENFI TO BE THE OFFICIAL CRYPTO PARTNER FOR WORLD TABLE TENNIS CHAMPIONSHIP IN SOUTH KOREA, SET TO REACH HALF A BILLION PEOPLE#Floki and #TokenFi are making waves in the sports world by becoming the Official Cryptocurrency Partner for one of the largest World Table… pic.twitter.com/OxkXkzjcvh — FLOKI (@RealFlokiInu) March 21, 2024\n\nThe latest for FLOKI is that it has again been named one of the official crypto partners for the World Table Tennis Championship in South Korea.\n\nFloki is a play-to-earn cryptocurrency that originated as a meme coin based on Elon Musk’s dog. It has since evolved into a fully functioning Web3 ecosystem with NFTs, a metaverse, DeFi, and prepaid Floki Visa and Mastercard gift cards.\n\nAD\n\nAD\n\nMeanwhile, Dogecoin (DOGE) and PepeCoin (PEPE), have picked up double-digit gains since yesterday. At the time of writing, the DOGE price has reached $0.154 up 15% over the past 24 hours. And PEPE, an Ethereum meme coin based on the Pepe the Frog meme, has seen its price increase by 12% since Wednesday.\n\nBoth of the meme coins tend to follow Bitcoin and the rest of the broader market. But their meme status means that they're a lot more volatile than most assets. In fact, the vast majority of meme coins die young because it's incredibly difficult to find staying power in a category that relies so heavily on trader sentiment.\n\nAnd on Solana, it's Dogwifhat (WIF) that now has its Shiba Inu-themed competitor, BONK, thoroughly beat. WIF, whose community last week succeeded in raising money to put its picture on The Sphere in Las Vegas, has gained 15.5% since yesterday. It's currently trading for $2.39, according to CoinGecko."
    },
    {
        "id": 77,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNQl9wN3FhSHlqdHdOb1NXcXNwTWRUTVR3alM0cTM4aXFFbmxLcWkwTm95NnFvUWVvclkweXoyc1lhOTVUcDNPcENBdVB0WmotRTcydk1MUURDcktBRWRwUlNWZlZwSWJQYjZvNklUZFFENHlQaXdQa2R6a3M3N1p2b2RDS1E1eTNVR3NZQdIBlAFBVV95cUxOQjNYMmk3S2habk9HXzBabm5iVG80NmdZNEM4OHhvTXp0S0VJVW5sbzA1U0kzNWV4cG5PY3BYcHpIeWN1czJfZExERkJORS15TFpiUnhGZkNUcEdEbVh1djYxRVN1VHBCb181dXktQldhOHBQRDBTUmpBYWI3ZmFEWGVfQlN6SEFBeE1obW9wVDg2OTlR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Mar 2024 07:00:00 GMT",
        "title": "Ethereum Founder Vitalik Buterin Surprised by L2 'Usage' Since Dencun - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEthereum co-founder Vitalik Buterin said Thursday that the amount of \"usage\" he’s seen from layer-2 networks following last week’s milestone Dencun upgrade has been lower than expected.\n\nIn response to a question submitted by Rug Radio at ETH Taipei on Thursday, Buterin hedged when asked whether Dencun’s implementation has been better than he expected.\n\n“It depends what you mean by better,” the prominent crypto developer replied.\n\nButerin proceeded to laud Ethereum’s developers for implementing the update “flawlessly,” before reflecting on what he considered to be Dencun’s lackluster contribution to network traffic on layer-2 networks since going live last Wednesday.\n\nAD\n\nAD\n\n“The amount of usage is interestingly low, right?” Buterin said.\n\nDencun introduced blobs, a novel data storage solution that—via a process called proto-danksharding—now allows layer-2 data to be stored on-chain for a temporary period of about a month (instead of forever), drastically reducing layer-2 gas fees to near-zero.\n\nButerin said Thursday that Ethereum core developers had hoped, going into Dencun, that layer-2 networks would use three blobs on average per block; current levels are about 67% lower than that target.\n\nTo be clear, it’s not that layer-2 networks have dropped off in traffic since Dencun; on the contrary, most of them have more than doubled in transaction volume since last week.\n\nAD\n\nAD\n\nTraffic reached such highs on Coinbase’s layer-2 network Base yesterday that transactions on Coinbase.com and Coinbase Wallet began failing intermittently yesterday. This morning, gas fees on Base suddenly spiked to about a third of pre-Dencun levels, after trading bots flooded the network in a meme coin-related frenzy.\n\n1/ Transaction costs on Base spiked today. The cause appears to be increased activity from trading bots willing to pay high priority fees. As a result, Base has been more expensive to transact on today than other L2s that use blobs. pic.twitter.com/smjsd1lcNl — Kofi (@0xKofi) March 21, 2024\n\nNonetheless, Buterin and other Ethereum stakeholders appear to have expected even greater spikes in layer-2 traffic, given Dencun’s dramatic lowering of L2 gas fees—especially at a time when gas fees on the Ethereum mainnet are spiking to levels intolerable for many retail users.\n\nMarius Van Der Wijden, an Ethereum core developer, said it might be too early to assess the success of blobs, as some layer-2 networks have yet to integrate Dencun.\n\n“Not all L2s have switched to blobs yet,” Van Der Wijden told Decrypt. “It means that L2s have lots of room to grow.”\n\nPolygon, for example, has yet to fully update to Dencun. Polygon Labs VP of Product David Silverman previously told Decrypt that he expects all layer-2s, including Polygon, to be fully integrated with Dencun within a month or two.\n\nVan Der Wijden also said that a silver lining of relatively low blob usage on layer-2s so far has been the rock-bottom gas fees that such traffic has permitted. Rising demand for blob space will likely increase layer-2 transaction costs, though to what degree is yet to be seen.\n\nIn Taipei on Thursday, Vitalik Buterin echoed that sentiment.\n\nAD\n\nAD\n\n“I do think it is good for present-day rollups that [transaction costs] are very cheap,” he said.\n\nBut the Ethereum creator emphasized he’s more excited about blob usage eventually meeting his expectations.\n\n“Definitely looking forward to usage going up over the next few months,” he added.\n\nEdited by Andrew Hayward"
    },
    {
        "id": 81,
        "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE5Sc2NobFN4VDRfd05Td3RrYndINW5maUxIQ3BsR0phT2xFMm1xZ0FpNVFKMmhreC1pelNVV21QWDJubzUyUDRzWk9LZlJyOXI0ZGJVajZJdmRrUllUdFlOR21kSEFPX0M5Ukc1NkV2MVhIOER6REpFa1NsQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "Solana surpasses Ethereum on DEX - The Cryptonomist",
        "content": "It is not the first time it happens, but the fact that the volume of trades on decentralized exchanges on Solana has exceeded that of DEX on Ethereum always makes headlines.\n\nEthereum not only has existed since 2015, but has been dominating the world of DeFi uncontested for years now.\n\nSolana instead landed on the crypto markets just under four years ago, but has transaction fees that are far lower.\n\nSolana’s Overtake on Ethereum\n\nIt should be noted, however, that in terms of key metrics Solana has not yet surpassed Ethereum.\n\nBy market capitalization SOL (the native cryptocurrency of Solana) is around 75 billion dollars, just surpassed by BNB with 78. ETH, the native cryptocurrency of Ethereum, is still on another level, with 386 billion dollars.\n\nFor TVL (Total Value Locked on DeFi protocols), Ethereum surpasses everyone with its 46 billion dollars, with Solana in fourth place with only 3.7 billion, surpassed also by Tron as well as BSC. However, the majority of TVL on Tron is due to USDT, while in the Solana ecosystem it is due to DEX.\n\nIt is no coincidence that the overtaking occurred precisely on decentralized exchanges, especially in terms of daily trading volumes.\n\nMoreover, even among DEXs, Uniswap still dominates in terms of TVL, although now a portion of its trading volumes does not occur on Ethereum but on layer-2 solutions like Arbitrum.\n\nUsing as a reference the trading volumes per chain, in the last seven days Solana has exceeded 21 billion dollars, while Ethereum stopped at 19.\n\nHowever, it should be added that there have been more than 6 billion dollars in trading on Arbitrum, so overall the Ethereum ecosystem with its layer-2 still surpasses the Solana ecosystem.\n\nNote that in third place in this ranking there is BSC, with 12 billion, and in fourth place Avalanche with 4.\n\nThe reason for the overtaking\n\nThere are two reasons that have led to this overtaking.\n\nThe first, simply, is the much lower fees on transactions.\n\nIn fact, it is no coincidence that the fifth chain by trading volume on DEXs is Arbitrum, the main layer-2 solution for Ethereum that enables transactions at very low costs.\n\nSolana still has lower costs, so it’s not surprising that it’s the preferred chain at the moment.\n\nHowever, there was another reason behind this boom.\n\nThe boom of memecoins played an important role.\n\nMany memecoins are now being launched on low-cost chains, such as Solana or even Base. Moreover, anyone can list their new token on a decentralized exchange, so DEXs are the ideal place to launch new memecoins.\n\nIt was a real boom, with some truly colossal proportions.\n\nIn the last 1 hour, 2,500 Solana memecoins were created. — Ram Ahluwalia CFA, Lumida (@ramahluwalia) March 13, 2024\n\nNow that the temporary boom of memecoins seems to be fading, it is possible that Ethereum will return to dominate this ranking, even though Arbitrum has now become a strong competitor.\n\nThe historical volumes\n\nHowever, the situation changes if historical volumes are taken into consideration.\n\nOn a monthly basis, in March Ethereum still dominates with over 51 billion dollars so far, while Solana is at about 45.\n\nIn February, even BSC had surpassed Solana, with 25 billion dollars compared to 22.\n\nIn January, for example, Arbitrum had almost caught up with Solana, both at 22 billion, so it is evident that the overtaking of the last week is due to a perhaps temporary boom, largely driven by memecoins.\n\nIn November 2021, at the peak of the bubble, DEXs on Ethereum recorded a record of $107 billion in monthly trading volumes, followed by $74 billion on BSC.\n\nThey were numbers far superior to the current ones, so it seems that there is still room for growth for DEX. At that time Solana didn’t even make it into the top 10, so in just over three years it has come a long way.\n\nEven Arbitrum has grown a lot, because back then it was under 4 billion, while in the first 20 days of March 2024 it is already over 18.\n\nThe prices of SOL (Solana) and ETH (Ethereum)\n\nInterestingly, both ETH and SOL are currently priced 34% below their all-time high.\n\nHowever, in the last seven days ETH is losing 20%, while SOL is gaining 12%. Also since the beginning of the year SOL is performing better, with a +68% compared to the +42% of ETH.\n\nThe key point to understand these differences actually lies in the bear market of 2022/2023.\n\nETH in 2022 has dropped less, and in 2023 it immediately recovered together with BTC.\n\nInstead SOL lost much more in 2022, and especially in 2023 it recovered only in October, when the entire crypto market restarted.\n\nAlthough in some ways it may seem that Solana is challenging Ethereum, in reality for now it is still the latter that dominates, even on DEX (especially thanks to its second layer)."
    },
    {
        "id": 82,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxPODVQUV9ValdwcUlQQVpueDRNWEFpMTJEXzdiSm83Mndyd1BDTDY0ZmZkSE5QME02cmlNanB4V3FnSGhqbTc2dXNpLUhoNnBubzU5a01yYnVxWVhpeEFfVkdfWERHejdaRlp2M2dUU0l0TWJEVkY5ZmUxR2FQVTdsVzdITEZzd01TQUFNaWIwcEM4UmRDakdhdkxIX051SzljVkxmdkpvODlCMlFDVVJJUg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Mar 2024 07:00:00 GMT",
        "title": "Solana Founder Stands with Ethereum to Fight SEC Security Classification - The Crypto Basic",
        "content": "The Solana community, led by co-founder Anatoly Yakovenko, is backing Ethereum and taking a stand against the U.S. SEC amid push to categorize Ether (ETH) as a security.\n\nSolana Stands Against SEC\n\nAnatoly Yakovenko, Solana’s co-founder, has opposed the Securities and Exchange Commission’s (SEC) underground moves against Ethereum. According to disclosures by The Crypto Basic, the SEC is initiating a campaign to potentially classify ETH as security.\n\nInsiders familiar with the situation have revealed that the SEC has demanded financial records and other documents from U.S. firms that have had a deal with the Ethereum Foundation.\n\n- Advertisement -\n\nNotably, the regulator has not officially remarked on this development at press time. Yet, the disclosure has sparked various reactions among prominent figures in the crypto community, including Yakovenko of Solana.\n\nYakovenko voiced opposition to ETH’s potential classification as security, stating:\n\n“If the state is against Ethereum, then I am against the state.”\n\nIf the state is against ethereum then I am against the state — toly 🇺🇸 (@aeyakovenko) March 21, 2024\n\n“This is the energy we need in this space,” remarked X user Yuge on the Solana founder’s remark.\n\n- Advertisement -\n\nSolana Could be Next after ETH\n\nFurthermore, some Community members pointed out that despite Ethereum being an adversary to Solana, it was right to stand in solidarity with ETH. They see safeguarding the space from detrimental classification as outweighing any internal competition within the industry.\n\nFor instance, another commenter stated, “ETH maximalists may be idiots. But they are our idiots,” echoing the rivalry among members of various crypto communities.\n\nAdditionally, some believe that Solana could be next in line if the SEC’s move against Ethereum succeeds.\n\nIt is worth mentioning that the SEC has already tagged Solana as security. This classification occurred within the context of a lawsuit against the Binance exchange last June.\n\nHowever, unlike its approach with XRP in previous years, the SEC has not lodged a formal complaint against other tokens categorized as securities alongside Solana.\n\nUS Politician Reacts\n\nNonetheless, considering the regulator’s history with Ethereum founders, the SEC’s alleged move to classify ETH as a security has surprised many. U.S. Congressman Patrick McHenry highlighted that the move contradicts the assessment of the CFTC and the SEC’s previous actions.\n\nReports indicate @GaryGensler is moving to unilaterally classify #ETH as a security. This is contrary to the @CFTC's assessment and the @SECgov's prior actions. Congress decides the SEC's jurisdiction and budget, Chair Gensler doesn't get to make it up as he goes along. https://t.co/83DUkCjMVA — Patrick McHenry (@PatrickMcHenry) March 20, 2024\n\nMeanwhile, some ETH critics like attorney Steven Nerayoff, renowned in the XRP community for his contribution to ETHGate, suggest the SEC’s move is justifiable. According to him:\n\n“The truth behind Ethereum and the SEC’s involvement is dark. It is about time we shine a light on the extensive corruption intertwining Ethereum and our government.”"
    }
]