[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTFBPQjlnRWt5bnM3NHV3Y0FZSXkzX040b3JpZG4yMVZ2c1JaVkp6RnZRd09TVlZ5eThTdHNzaEJqZmNrVmgyLU1TcDRtbjRJTnFFUmcxN2hXLTRfdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Apr 2024 07:00:00 GMT",
        "title": "What Is Blast on Ethereum? A Beginner’s Guide - Unchained",
        "content": "Blast is a new Ethereum layer 2 that introduces the concept of native yield for ETH and stablecoins.\n\nBlast is a new Ethereum layer 2 network that has made waves after introducing the concept of native yield. Unlike other layer 2 solutions, Blast users can earn yield paid in crypto simply by having certain tokens in their wallets.\n\nRead on to learn about Blast, how it works, and what it is bringing to Ethereum.\n\nWhat Is Blast on Ethereum?\n\nBlast is an EVM-compatible Ethereum layer 2 platform that offers native yield for ether and stablecoins. It operates as an optimistic rollup solution to tackle scalability issues on Ethereum by increasing the network’s capacity for more transactions at lower costs.\n\nBlast’s testnet went live in January 2024, and its mainnet launched in February. The platform, founded by Tieshun Pacman Roquerre (the creator of NFT marketplace Blur), has surpassed $1 billion in total value locked at the time of writing.\n\nThe project is different from other Ethereum layer 2 solutions as it offers native yields for both ETH and stablecoins.\n\nHow Does Blast Work?\n\nBlast yield income for decentralized finance (DeFi) users comes from the concept of Ethereum staking. Ethereum staking is a process on the Ethereum network whereby users can temporarily lock tokens to validate transactions.\n\nTraditionally, managing staking requires individual attention from users. However, Blast simplifies this process by handling staking on behalf of its users within its ecosystem, making it an L2 platform with native yield.\n\nWhen assets are bridged to the Ethereum mainchain within Blast’s network, they are automatically staked, initiating the interest-earning process. Blast’s smart contracts facilitate the collection of this interest, which is automatically redistributed to users in the form of ether (ETH) and stablecoins.\n\nHow Does Blast Offer Yield?\n\nBlast offers a 4% interest rate for ETH and a 5% interest rate for stablecoins like USDT, USDC, and DAI deposited on the network. These interest rates are compounded, meaning they apply to the balance over time rather than the initial deposit.\n\nThe native yield feature is powered by rebasing tokens and is based on the Risk-free Interest Rate (RFR) yield structure.\n\nThe 4% yield on Ethereum is sourced through liquid staking on the Ethereum network. After the merge, the proof-of-stake (PoS) on the Ethereum network offers a 4% APR on staked ETH. Blast utilizes this feature through partnerships with platforms like Lido, leveraging staked user assets for yield generation.\n\nSimilarly, stablecoins bridged to Blast are routed to T-bill protocols, such as MakerDAO, where they generate yields. Blast channels them to MakerDAO’s T-bill protocol, and users receive USDB on Blast. USDB accumulates stablecoin profits over time at a 5% APR, and users can redeem the asset for USDC when they bridge back from Blast.\n\nWhat Does Blast Bring to the Ethereum Ecosystem?\n\nBlast’s main aim is to enhance transaction efficiency on the Ethereum network. The layer 2 solution operates on Ethereum but doesn’t rely on the full processing power of the main chain. The move ensures that transactions remain reliable and decentralized while enhancing scalability.\n\nThe L2 also tackles asset depreciation by providing users with a “risk-free” interest rate, regardless of the coin’s value. By providing both ETH and T-Bill yields, Blast ensures users receive benefits similar to those on the mainchain but adds optimistic rollup services and other layer 2 network scaling solutions.\n\nCompared to Ethereum’s core network, which can only process roughly 15 transactions per second, Blast can process thousands of transactions per second by grouping them together. Thus, transactions can be confirmed more quickly, resulting in a more responsive and seamless user experience.\n\nThe Blast Airdrop\n\nTo participate in the airdrop, users need to obtain an invitation link from their peers through a referral. Users can then register on the airdrop page to claim their sign-up reward. Registered participants can unlock additional rewards by bridging assets to the platform or inviting other users.\n\nNotably, airdrop points are granted based on the value of assets bridged and the number of users successfully referred.\n\nWhile the bridge to Blast is operational, participants in the airdrop campaign can only redeem their accumulated airdrop points beginning May 2024. Part of the airdrop is designated for Season 3 of Blur participants.\n\nFurthermore, part of the airdrop is set aside for developers, particularly winners of the Big Bang contest and mainnet dApps. Developers can reallocate their airdrop points to users, thus enhancing liquidity and expanding the user base.\n\nChallenges and Controversies Associated With Blast\n\nThe crypto community has raised some questions regarding the project’s operations and the validity of its promises.\n\nBlast’s holding contract for deposited assets is safeguarded by a multi-signature mechanism involving five participants. At least three of these participants must consent to approve any withdrawal request. However, the identities of these five participants remain undisclosed, as the project founder operates under a Twitter pseudonym. Furthermore, the criterion for signature approval remains unclear.\n\nFurthermore, questions have been raised regarding the rebase structure and the native yield arrangement. While Blast developers and project partners have strongly supported the project, comments on the rebase token design suggest differing opinions on its feasibility and efficiency.\n\nThe network’s security has also recently become an issue. Munchables, a GameFi platform operating on Blast, disclosed recently that it experienced a security breach resulting in a loss of $62 million. Additionally, an associated vault on Juice Finance avoided a $25 million loss due to a typographical error.\n\nHowever, unlike other hacks, the hacker lacked leverage due to Blast’s multiple centralized components, which eliminated any chance for the attacker to attempt to launder the stolen funds. Eventually, the attacker relinquished control of the private keys.\n\nConclusion\n\nBlast has gained traction, achieving a total value lock (TVL) exceeding $1 billion. The network aims to transform the crypto and gaming industries by providing a layer 2 solution with native yield.\n\nHowever, the project is still in its early stages and has much to prove, including liquidity efficiency and native yield arrangement over time."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiaEFVX3lxTE8yVzktOTRXSklVc3NWSEFaazhSOHQtX21EQnZaaVdMRTJCX0RjM1pGLUp0c1ZyZEJnZm52WW9GbGphMGdhbnZjYmdLdnhRRnJ1UzJQQXFXeDg3cVdESjI3TmtWTWpVRzQ0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Apr 2024 07:00:00 GMT",
        "title": "What Is Ethereum Restaking? - Ledger",
        "content": "What Is Ethereum Restaking?\n\nBy Ola Kalejaye\n\nBeginner\n\nSHARE\n\nKEY TAKEAWAYS: — Ethereum restaking is a novel concept that aims to extend the cryptoeconomic security of Ethereum to new protocols while compounding rewards for stakers.\n\n\n\n— The process involves using staked Ether or Liquid Staking Tokens to simultaneously stake on another Ethereum protocol, which some commentators warn could ultimately compromise the base network’s resilience.\n\n\n\n— EigenLayer, the protocol that introduced restaking, sees it as a way to supercharge innovation in the Ethereum ecosystem by establishing pooled decentralized security.\n\nAs the heart of all blockchain networks, the importance of consensus mechanisms can’t be overstated. In the case of the world’s second-largest cryptocurrency, Ethereum, its proof-of-stake consensus model is a crucial part of its security and function. At present, the Ethereum network is shored up by nearly 1 million network validators and over 31 million staked Ether, lending it formidable security.\n\nOf course, creating a network of validators even a fraction of the size of Ethereum’s is a challenging and costly task. This serves as a major roadblock for new and emerging protocols in the ecosystem, stifling what might otherwise be promising innovations.\n\nBut what if there was a way to leverage Ethereum’s established security for new projects being built on the network? Could that unlock a whole new level of progress for the ecosystem as a whole?\n\nThat’s the thinking behind Ethereum restaking, a concept that wants to share Ethereum’s validator network for the benefit of new protocols, stakers, and the Ethereum community at large.\n\nBut just what is ETH restaking? How does it work, and are there any risks when it comes to restaking your ETH? In this article, Ledger Academy will walk you through all of that and more.\n\nEthereum Staking and Restaking: Explained\n\nTo understand restaking, let’s take a step back and look at what staking is and how it works on the Ethereum network.\n\nHow Does Ethereum Staking Work?\n\nEthereum staking is the basis for the network’s proof-of-stake consensus model. One way to look at staking is as a collateral system that helps keep Ethereum secure.\n\nIf someone wants to act as an Ethereum validator, they must first put up a stake of (at least) 32 ETH. In return for processing transactions, they receive staking rewards. Conversely, if the validator acts dishonestly or does anything that could harm the network, they may lose their staked ETH via a process called slashing.\n\nWhat is Ethereum Restaking?\n\nAs the name implies, Ethereum restaking is the process of taking ETH that has already been staked on Ethereum and using it to simultaneously secure other decentralized protocols. As with normal staking, restaking earns users staking rewards from the protocol(s) they help to secure.\n\nWhile earning extra rewards is a major incentive for restaking, it isn’t the main reason for the concept. The larger idea behind restaking is so that less developed protocols can take advantage of Ethereum’s robust community of network validators: something that is costly and resource-intensive to do otherwise.\n\nNotably, the restaking mechanism did not come about as the result of an Ethereum Improvement Proposal (EIP) or the Ethereum Roadmap. Rather, it was designed by a third-party protocol, EigenLayer.\n\nEigenLayer: The Origin of ETH Restaking\n\nFounded in 2021, EigenLayer is an Ethereum middleware platform, which simply means that it sits between the Layer 1 network and other applications, allowing them to interact. As of yet, EigenLayer is the only decentralized protocol that offers ETH restaking.\n\nEigenLayer deploys Ethereum smart contracts that allow stakers to restake their ETH on compatible protocols. The platform also acts as a staking marketplace, allowing the three main parties involved—stakers, network validators, and protocols—to find each other.\n\nSince its initial launch in June 2023, EigenLayer has enjoyed massive growth, becoming one of the largest blockchain protocols out there. Over $10 billion worth of ETH has been restaked through EigenLayer, giving it a higher total value locked (TVL) than major DeFi platforms such as Aave, Rocket Pool, and Uniswap.\n\nEigenLayer’s rapid ascent speaks to an obvious demand for restaking and the added rewards that it brings users. But how exactly do users earn these rewards? To understand fully, let’s dive into how Ethereum restaking works\n\nHow Does Restaking ETH Work?\n\nCurrently, EigenLayer is the only option you have to restake your ETH. So let’s explore how this project approaches the mechanism.\n\nSmart Contracts: EigenPod\n\nRestaking on EigenLayer allows its smart contracts to place additional slashing conditions on your staked ETH. This is how EigenLayer extends Ethereum’s security to the protocols In its ecosystem, which it calls Actively Validated Services (AVSs). If a restaking validator doesn’t perform their duties for their AVS, they are subject to having their ETH stake slashed.\n\nThis happens through on-chain slashing contracts and specific smart contracts called EigenPods. You can think of these as an additional account that sits between a restaker’s wallet and their stake. Staking withdrawals and rewards all have to go through the EigenPod before going to a validator’s account, which gives EigenLayer the ability to enact penalties on validators who act poorly.\n\nNative Restaking vs. Liquid Restaking\n\nNative restaking follows a similar process to natively staking ETH, meaning that this option is only available to those willing to run (or already running) an Ethereum validator node. The only difference with native restaking is that an EigenPod becomes the withdrawal address for your stake.\n\nAs for liquid restaking, it’s important to first consider how liquid staking works.\n\nSimilarly to native staking, liquid staking involves locking tokens up in a smart contract. The key difference, however, is that the liquid staking platform then gives you liquid staking tokens (LSTs) in return. You can then use these LSTs as you would any other token on DeFi applications. Liquid restaking, therefore, is when users deposit LSTs into the EigenLayer contracts.\n\nEigenLayer currently supports staking for 12 LSTs, including popular options like Rocket Pool Ether (rETH), Lido Staked Ether (stETH), and Coinbase Staked Ether (cbETH).\n\nSignificantly, some platforms expand liquid restaking utility even further. For example, the protocols Renzo and EtherFi both serve as liquid restaking platforms for EigenLayer. These protocols accept users’ LSTs and give them Liquid Restaking/Receipt Tokens (LRTs) in return.\n\nSeveral liquid restaking platforms have emerged recently, looking to expand restaking utility even further. Similarly to liquid staking, users restake their LSTs with these platforms and receive Liquid Restaking/Receipt Tokens (LRTs) in return.\n\nDelegation\n\nOnce you have successfully staked your ETH or deposited your LSTs, you then have to delegate your stake. The entities that you delegate to – the ones directly helping to run Actively Validated Services on EigenLayer – are called operators.\n\nSimilarly to staking ETH, there are two options here. You can either act as an operator and self-delegate, or you can delegate your stake to an existing operator. While simply delegating your stake to an operator is the simplest option, self-delegation gives you more control and responsibility. Importantly, stakers can not dictate to operators what AVS they operate.\n\nWhat Are the Benefits of Restaking ETH?\n\nMore Rewards for ETH Stakers\n\nThe clearest benefit of restaking Ether is that it compounds rewards for stakers. While the exact rate of staking rewards fluctuates over time and varies depending on the staking platform, ETH stakers can expect an annual percentage yield of roughly 3%. In other words, you would earn around 3% of the amount you stake over one year.\n\nBy restaking, you can supplement your ETH staking rewards with rewards from multiple other protocols. Of course, the rate of rewards will depend on the specific AVS that your staked ETH is going towards.\n\nLower Costs for Startup Protocols\n\nThe other major benefit of ETH restaking is how it lowers costs for new protocols being built on Ethereum. To explain, before the arrival of restaking, new protocols would have to go through the costly process of developing their own validator networks. Thanks to restaking, new protocols can now take advantage of Ethereum’s well-developed validator network. This concept, where decentralized protocols can share validator-powered security, is known as pooled security.\n\nAvoids Layer 2 Restrictions\n\nDue to the high costs associated with launching a new protocol on Ethereum, projects previously went to Layer 2 blockchains as a solution. While these networks can lower costs for new protocols, they also come with some drawbacks.\n\nThe design of some Layer 2 chains can lead to certain constraints on protocol architecture such as customization options and the kinds of transactions a protocol can access. Staying and building on Ethereum and using the pooled security that restaking brings means that protocols are freer to build the architecture that best suits their needs, without constraints.\n\nBesides being good for the individual protocols, this is also a major benefit to the Ethereum ecosystem as a whole. The more protocols that can be built on Layer 1, the more innovation can happen without liquidity siphoning off to other chains.\n\nWhat Are the Risks of Restaking?\n\nIncreases The Risk of Slashing\n\nAs previously mentioned, slashing is a vital component of proof-of-stake systems that helps to keep participants honest. That being said, the nature of slashing means that it can also have negative consequences for people even when they’re not doing any explicit harm to the network.\n\nFor example, many ETH stakers do not act as network validators themselves, meaning that they simply delegate their stake to a validator. If their delegated validator behaved poorly, these stakers could still stand to lose their stake to slashing.\n\nSlashing can also be a risk even for validators who are acting honestly. To sum up briefly, because validators can get a slashing penalty if their node goes offline, many validators set up backup rigs. However, if the network detects the same validator keys coming from two different servers, it also punishes this with slashing (to prevent double-spending).\n\nThat’s all to say that, no matter how it is done, staking always comes with some level of slashing risk. Therefore by restaking, you are necessarily increasing the risk that you could become subject to slashing.\n\nEffect on ETH Liquidity\n\nAlthough restaking arguably works to keep more ETH within the ecosystem, you must remember that staked ETH is not available. Not to mention that even when you unstake your restaked ETH, you will likely have to wait longer than you would otherwise to withdraw it.\n\nCentralization Concerns\n\nIf more restaking protocols like EigenLayer entice enough people with the promise of higher staking rewards, this could lead to fewer independent stakers, and more people staking via such protocols. This effectively causes staking to become more centralized over time.\n\nConcerns Around LRTs\n\nAs previously mentioned, the growth of restaking has brought about a new class of instruments: liquid restaking tokens (LRTs). As these tokens mimic the surge in popularity of LSTs, it’s important to be aware of the risks they carry.\n\nFor one thing, there’s the convoluted nature of LRTs. After all, an LRT is a token representing a staked token, which is itself a representation of a staked token. This added complexity raises questions on exactly how LRT providers will distribute losses and gains.\n\nAdd onto this the newness of the asset class, and there are likely to be some hiccups as platforms look to hook new users with promises of large yields and unproven tokenomics.\n\nPotential Effect on Ethereum’s Social Consensus\n\nFinally, some believe that using Ethereum’s validator network as the basis of pooled security can have a destabilizing effect on the base network. One such critic is none other than Ethereum co-founder, Vitalik Buterin.\n\nIn a May 2023 blog post, Buterin examines the growing trend of protocols leveraging Ethereum’s validator network and argues that certain use cases can introduce high systemic risks to the ecosystem. Specifically, Buterin warns that protocols relying on Ethereum’s social consensus could be a slippery slope.\n\nEthereum’s social consensus refers to the large global community of Ethereum developers and other users, who are constantly monitoring the network. This social consensus is vital for the health of the network, as the community can always act to secure the network if its cryptoeconomic consensus fails due to a bug or attack.\n\nButerin’s concern is that the people building protocols could begin to view hard forks as a way of bailing them out if anything goes wrong. Ultimately, he goes on to say that as long as projects only seek to use Ethereum’s validator set, and not its social consensus, they remain low risk. Notably, EigenLayer founder, Sreeram Kannan, agrees with Buterin’s conclusions, reiterating that an Ethereum fork should never be viewed as a potential solution for a protocol’s issues.\n\nHow To Restake ETH on EigenLayer\n\nThere are two ways to use EigenLayer to restake Ether: native restaking and liquid restaking.\n\nHow to initiate Native restaking on EigenLayer\n\nHere’s how you can natively restake ETH on EigenLayer:\n\nConnect your wallet to the EigenLayer App, ensuring you are connected to the Ethereum mainnet. Click “Create EigenPod” If you are successful, you will see the EigenPod address come up on the right of your screen. Now that you have your Eigen Pod address, you can deposit your 32 ETH stake to the Beacon Chain just as you normally would to stake ETH. The key step here is that you must set the EigenPod address as the withdrawal credentials for your staking rewards. Once you deposit your stake, it takes about four hours to finalize. After that, you’re free to choose an operator to delegate your stake to.\n\nHow to initiate Liquid restaking on EigenLayer\n\nIf you’re looking to get involved in liquid staking you can take the following steps to deposit your LSTs into EigenLayer.\n\nRemember, you can easily exchange ETH for LSTs through Stader Labs or Lido directly from Ledger Live.\n\nConnect your wallet to the EigenLayer app, ensuring you are connected to the Ethereum mainnet. Select the LST you want to restake from the list. Enter the amount of LSTs you want to restake and click “Deposit”. If it’s your first time depositing an LST you’ll need to set a token approval in order to restake. After confirming the token approval, you can confirm the deposit transaction. If the transaction is successful, you’ll see your deposit in your “Restaked balance” on the app.\n\nThe Future of Ethereum Restaking and Pooled Blockchain Security\n\nAll in all, Ethereum restaking is a thoroughly exciting proposition that has brought the concept of pooled security to the forefront of blockchain innovation. Not only can it increase the benefits of staking Ethereum, but it also creates exciting opportunities for up-and-coming blockchain protocols.\n\nAnd if you’re ready to jump into the world of Ethereum staking and staking rewards then look no further than Ledger! Staking Ether on Ledger Live couldn’t be easier. When paired with the power of self-custody unlocked by Ledger hardware wallets, you’ll have everything to take on the world of Ethereum staking.\n\nSo what are you waiting for? Find the Ledger device that’s right for you and start enjoying the freedom of secure self-custody."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxQejR6Qkd2cW1EdTEwQzVPaC1jNTdSY0xMaVdMMFZJYmk2ODExbXdfZmxKOEZDcFdibklHbzBxdTR2NkZsREFONlZIUEtxbUJiUzhZU09xWE5tYlN2QVp0Rmp5SEhsaU5IbTdYYkYyOUE1bndiZi1vdi1JQklIWENDZnJDNE1xTkoxeVhuLVRxX19MN2hEUHpJT1lsVktFeHp6Wk40Nw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Apr 2024 07:00:00 GMT",
        "title": "Ripple to launch USD-pegged stablecoin on XRP ledger and Ethereum - The Banker",
        "content": "Ripple plans to launch a stablecoin, pegged 1:1 to the US dollar, later this year. The US-based crypto and blockchain solutions provider will make the stablecoin available on XRP ledger, which it developed, as well as the Ethereum blockchain — both public permissionless ledgers — with plans to expand over time.\n\nThe stablecoin will be backed by US dollar deposits and short-term government Treasuries, with all reserve assets audited by a third-party accounting firm, alongside monthly attestations."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxPN0ZOUjRLM29jNDZaTjZUS2p0dEdna3ZrdlRlb1dYRXpTUF83ZG1FUkpjZTZodkZ3U3lEZXJtRTdhcjhsVjNBSzhlQ0pJR1VfV2lJcWxXdzdhbGRUX19uVlBTSm9WaFZwX2FvZkFCd3c4VkVqYWlTcG91akFWSU9IVUlzZG14aGs2RjJKMjlXdlRkeWk0d19lMnA4SHh5WDF6Skg2Vno1Rk1BQXpCdk5SWA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Apr 2024 07:00:00 GMT",
        "title": "Bitcoin Halving, Ethereum ETF: The Most Important Trends in the Cryptocurrency Market 2024 - hackernoon.com",
        "content": "The upcoming bitcoin halving is a significant event that happens about once every 4 years and is of great importance to the entire crypto industry.\n\n\n\n\n\nThe year 2024 has seen and is expected to see several important milestones for the crypto industry: the approval of the Bitcoin ETF, the Ethereum Dencun upgrade, as well as the upcoming bitcoin halving and the possible approval of the Ethereum ETF. These events reflect important milestones in the development of the cryptocurrency space and are attracting increasing attention from investors and the general public.\n\n\n\n\n\nIn this article, I will dive into the specifics of bitcoin, review the nature of the halving and its significance, compare bitcoin to ethereum, and discuss other key events. The rapid growth of this sector inevitably leads to many questions and discussions, and this article will help you better understand the nature of the ongoing changes and their implications.\n\nWhat is bitcoin?\n\nBitcoin is the first and most famous cryptocurrency that was created in 2009. It is a digital currency powered by blockchain technology that allows users to make decentralized transactions. This means there is no centralized control in this network and no need for a third party. It was designed to be a non-inflationary cryptocurrency, and the mechanisms that limit the issuance of the new BTC cryptocurrency are fundamentally built into the Bitcoin protocol itself. The mechanism that ensures a permanent reduction in issuance is called halving. Let's take a look at how it works. The bitcoin network is organized into nodes. Each node maintains identical copies of the blockchain. These copies are agreed upon by the nodes according to rules called a consensus mechanism.\n\n\n\n\n\nProof of Work (PoW) consensus is used in bitcoin. Proof of Work is a mechanism that ensures the safety and reliability of the bitcoin network. As part of PoW, miners use special hardware to solve complex mathematical challenges. When a miner solves such a challenge faster than other ones, he creates a new block with transactions and adds it to the blockchain, receiving a reward in the form of BTC cryptocurrency. According to the rules built into the protocol, new blocks are formed by miners about every 10 minutes.\n\n\n\n\n\nThis means that bitcoin issuance takes place as miners are rewarded for forming blocks. In fact, all BTC that are created in the network are miners' rewards for mined blocks. Bitcoin is divided into smaller units - they are called \"Satoshi\".\n\n\n\n\n\nSatoshi is the smallest unit of bitcoin and represents one hundred millionth part of bitcoin.\n\n\n\n\n\n1 Satoshi = 0.00000001 Bitcoin (BTC)\n\n100 Satoshi = 0.000001 Bitcoin (BTC)\n\n10 000 Satoshi = 0.0001 Bitcoin (BTC)\n\n1 000 000 Satoshi = 0.01 Bitcoin (BTC)\n\n10 000 000 Satoshi = 0.1 Bitcoin (BTC)\n\n100 000 000 Satoshi = 1 Bitcoin (BTC)\n\n\n\nWhat is halving?\n\nHalving is an event in the bitcoin protocol where the mining reward for creating a new block is reduced by half. It occurs approximately every 4 years and is a built-in mechanism that limits the total number of bitcoins that can be created.\n\n\n\n\n\nHalving is hugely important for bitcoin, as this event directly affects its economic model. As the miners reward for each block decreases, the number of new bitcoins coming into circulation also decreases, which helps maintain bitcoin's value in the long-term.\n\n\n\n\n\nThe bitcoin protocol was designed with the idea of a limited supply. The protocol includes a rule that limits the maximum total number of bitcoins that can be created. This limit is 21 million bitcoins and its issuance will stop by 2140.\n\n\n\n\n\nWhen the bitcoin blockchain was launched in 2009, the reward to miners for a new block was 50 BTC, which is its issuance. During the history of bitcoin there have already been 3 halving, in 2012, 2016 and 2020. In 2012, the first bitcoin halving took place and the miners' reward for mining a block decreased from 50 BTC to 25 BTC, in 2016 during bitcoin halving the miners' reward per block was already reduced to 12.5 BTC, and in 2020 after bitcoin halving the miners' reward per block became only 6.25 BTC.\n\n\n\n\n\nThe next bitcoin halving will occur in April 2024 and miners' reward per block will be reduced from 6.25 BTC to 3.125 BTC.\n\n\n\n\n\n\n\n\n\nThe impact of bitcoin halving on its price and market dynamics is significant. The expectations associated with halving that supply will decrease and demand will increase often leads to positive market sentiment. The decrease in available bitcoins after halving creates scarce demand, which in turn increases their price and makes this cryptocurrency more attractive to investors.\n\n\n\n\n\nHowever, it is important to realize that past performance does not guarantee that it will be repeated in the future, and the price of the bitcoin cryptocurrency can be affected by various factors other than halving events. In addition, an increase in the price of the bitcoin cryptocurrency following halving events may also be justified by an increase in press coverage of cryptocurrencies or an increase in real-world options for its use. Although past bitcoin halvings have stimulated a bullish trend of bitcoin cryptocurrency price in the long term, one should keep in mind the unpredictability of the market.\n\nWhat is Ethereum?\n\n\n\n\n\n\n\n\n\nEthereum is the second largest capitalized cryptocurrency after bitcoin. It is a decentralized protocol based on blockchain technology. It was launched in 2015 and its key idea is to support smart contracts that allow creation of decentralized applications. Smart contracts are programs that are hosted and running in the Ethereum environment.\n\n\n\n\n\nAnyone can deploy smart contracts on the network or interact with existing ones. The advantage of this model is that there is no need to trust third parties or intermediaries. There are a huge number of decentralized applications built on Etherium, from DeFi and NFT to decentralized autonomous organizations. It also opens up the possibility of tokenizing any tangible and intangible assets, which brings many benefits in the form of automating transactions and reducing transaction costs by eliminating the need for intermediaries. This is one of the major trends in the industry right now. Smart contracts also allow even traditional money to be tokenized, transferred and used in a decentralized digital world. The native cryptocurrency in Etherium is called Ether, and it is used to pay transaction fees on the network.\n\n\n\n\n\nThis means that Ether cryptocurrency is needed when sending any transaction that represents actions on the network. The Ether cryptocurrency is also divided into smaller parts. Up to 18 decimal places. The smallest unit is called Wei. Below is an example of converting Ether to Wei.\n\n\n\n\n\n1 Ether = 1000000000000000000 Wei\n\n0.01 Ether = 10000000000000000 Wei\n\n0.000000001 Ether = 1000000000 Wei\n\n0.000000000000001 Ether = 1000 Wei\n\n0.000000000000000001 Ether = 1 Wei\n\n\n\n\n\nWhat is the difference between Ethereum and Bitcoin?\n\n\n\n\n\nThe main difference between Ethereum and Bitcoin lies in their functionality. Bitcoin provides the ability to send basic value transfer messages between users without the need for centralized intermediaries, and is designed primarily as a digital payment system. Ethereum, instead, extends this concept by allowing the creation of any kind of program (smart contracts) that can be executed on the network. Almost any decentralized applications can be created on Ethereum, which drives innovation and growth in various areas: decentralized finance, exchanges, tokenization of real-world assets and currencies, games, social networks, decentralized autonomous organizations, and others.\n\nSo unlike Bitcoin, Ethereum is focused not only on financial transactions, but also on creating digital decentralized ecosystems and applications.\n\nBitcoin ETF\n\n\n\n\n\n\n\n\n\nThe approval of the bitcoin ETF on January 10, 2024 had a significant impact on the cryptocurrency market as well as the price of bitcoin itself. Shortly after this event, the bitcoin price rallied from a level of around $46,000 to a new all-time high of around $73,740 within two months.\n\n\n\n\n\nThe approval of the spot bitcoin ETF opened up new opportunities for investors by giving them access to the digital currency through traditional investment accounts, leading to a visible increase in interest in bitcoin from institutional and individual investors.\n\nThe approval of bitcoin ETFs has also brought a new set of benefits. It has opened up opportunities for capital inflows from traditional financial markets, as bitcoin is now available to institutional investors who can do transactions through their regular brokerage accounts. Hedge funds, pension funds and other large institutional players who previously did not have access to this asset class can now do transactions in bitcoin ETFs.\n\n\n\n\n\nThe approval of bitcoin ETFs has also increased the liquidity of the cryptocurrency market, as it has stimulated more capital inflows and increased bitcoin trading activity. Increased liquidity may help improve the structure of this market and reduce volatility.\n\n\n\n\n\nThus, this event has the potential to affect the further progress of the cryptocurrency market and raise even more interest in bitcoin from investors. In general, this year is very significant for bitcoin, because its halving is expected ahead, which will reduce miners' reward per block by 2 times, which means that the issuance of new BTC will be reduced in the same amount.\n\nEthereum ETF\n\n\n\n\n\n\n\n\n\nRequests for an Ethereum ETF have been submitted and a decision is expected to be made in the near future. Potentially, the approval of the Ethereum ETF could have a major impact on Ether and cryptocurrency market price rates in general. Approval of the Ethereum ETF could lead to increased demand for Ether cryptocurrency from investors, including institutional investors for whom it may become available, interested in diversification of their portfolios. Such an injection of capital could boost Ether's price and overall popularity. But it is important to realize that the impact on the exchange rate may be unpredictable and dependent on many other factors.\n\n\n\n\n\nThe possible approval of an etherium ETF also opens up new opportunities for investors by giving them access to Ether price movements through regular brokerage accounts. This will allow investors familiar with traditional investments to access new markets without having to manage digital wallets or navigate complex cryptocurrency exchanges.\n\n\n\n\n\nThus, the approval of an Ethereum ETF could make investing in the Ether cryptocurrency more accessible and attractive to a wide range of investors, opening up new horizons for capital inflows.\n\nWhat's next?\n\nThe next major event that is expected is the bitcoin halving. According to the bitcoin protocol, the next halving will take place in April 2024, when the reward for miners for mining a block will be reduced from 6.25 BTC to a reward of only 3.125 BTC per block. This event could significantly affect bitcoin's market dynamics and raise investors' attention to its potential.\n\n\n\n\n\nThe approval of bitcoin ETFs has brought significant price impulse to the cryptocurrency market, and helped drive the bitcoin price to a new all-time high. The move has opened up new opportunities for investors, allowing them to invest through traditional investment accounts. The approval of the Ethereum ETF could also lead to increased investor interest in the Ether cryptocurrency.\n\n\n\n\n\nIt should be pointed out that one of the key factors that will also have an impact on cryptocurrency price rates is the Ethereum Dencun upgrade. This upgrade, which introduces proto-danksharding, not only improves the scalability of the Ethereum network, but also reduces fees in L2 rollups, which may become an additional motivation for investors and increase interest in the cryptocurrency market as a whole.\n\nHowever, it is worth remembering that the actual impact of these events on cryptocurrency price rates can be complex and multifaceted. Other factors such as regulatory changes, technical innovations and macroeconomic conditions can also have a significant impact on market dynamics. Therefore, it is important to take all aspects into consideration and base your decisions on a multitude of other factors. Only time will tell the real impact of these events on the market and the crypto industry.\n\n\n\n\n\nThe information presented in this article is the subjective opinion of the author and should not be considered a recommendation or a call to action. The information presented in this article may be incomplete or not fully accurate and readers are advised to conduct their own research to confirm and supplement the information presented. Readers should understand that making any decisions based on this information involves risks, including loss of capital or other negative consequences. Readers are advised to seek professional advice and evaluate their own circumstances before making any decisions. The author shall not be liable for any loss or damage resulting from the use of information from this article. Not an investment recommendation.\n\n\n\n"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMia0FVX3lxTE95eTh0UkpBZlQ0V2w1NmEzemJnYjc2WXl3ZG0ydDMxMlJmYWd3V0ZmYUlRVXNBZGhiMTFtRktmQk5UZEg1eWl3TG1acGtqd1pRUFVPNDd1SXRldlE0VjQxRDhEak5zVkV1dnJF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Apr 2024 07:00:00 GMT",
        "title": "DWS Group debuts Bitcoin and Ethereum ETCs in Germany - Crypto Briefing",
        "content": "Coinbase and Zodia Custody act as custodians for the digital assets underlying the ETCs.\n\nShare this article\n\nDWS Group (DWS), an asset management firm managing almost €900 billion in assets, has partnered with Galaxy Digital Holdings Ltd. to introduce two new Xtrackers exchange-traded commodities (ETCs): the Xtrackers Galaxy Physical Bitcoin ETC securities and the Xtrackers Galaxy Physical Ethereum ETC securities. These new ETCs are now listed on Deutsche Börse, as DWS shared in a recent press release.\n\nAn exchange-traded commodity (ETC) functions as a debt security similar to an exchange-traded note (ETN) but with added protections for investors. These protections include collateral, limited recourse, and bankruptcy remote issuer. Unlike ETNs, ETCs can track single assets or smaller, focused baskets of assets.\n\nAccording to Manfred Bauer, Global Head of DWS’ Product Division and Member of the Executive Board at DWS Group, the growing value of Bitcoin and Ethereum is making it impossible for investors and financial institutions to simply ignore them. With this launch, DWS seeks to provide investors with direct access to Bitcoin and Ethereum.\n\n“Since the first Bitcoin transaction in 2009, digital assets have developed from a niche technology innovation to a globally recognized asset class. With a combined market capitalization of more than USD 1.7 trillion, Bitcoin and Ethereum alone are now too significant for investors and asset managers to ignore,” stated Bauer.\n\nThe strategic partnership between DWS and Galaxy aims to accelerate digital asset adoption in Europe, leveraging their collective expertise, noted DWS. Through this collaboration, Galaxy will equip DWS with the tools and expertise to offer institutional-grade access to digital assets for European investors.\n\n“We are delighted to be working with Xtrackers to offer investors institutional-grade access to digital assets and to support them with our deep digital asset expertise,” commented Steve Kurz, Global Head of Asset Management at Galaxy.\n\nAs noted in the press release, each ETC is supported by segregated offline storage solutions provided by Zodia Custody and Coinbase, ensuring the safekeeping of digital assets.\n\nWith an annual product fee of just 0.35%, DWS expects that these ETCs will be a cost-effective option for investors looking to tap into the digital asset market. The firm claims that its new products will offer the ease of trading an ETP with the perceived safety of having an underlying physical asset."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMia0FVX3lxTFBDdmJZc24wTldJX000Y1hKSUFoLWtkbjIzS2RFSVVqWGFYLV84UWFjTEw3VUU4WFhXOFhDdm9HWTREcVlPeUNmS01hMU1ZTGpPZTJBb3J1ZHRveUVhYm9nbTVfMndEcmNFYm8w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Apr 2024 07:00:00 GMT",
        "title": "Ripple to debut a dollar-pegged stablecoin on XRP Ledger and Ethereum this year - Crypto Briefing",
        "content": "Ripple aims to tap into the growth potential and niche opportunities within the stablecoin market.\n\nShare this article\n\nRipple plans to issue a stablecoin tied to the US dollar, which will be 100% backed by USD deposits, short-term US bonds, and other cash equivalents. Expected to debut later this year, Ripple’s stablecoin will be deployed on the XRP Ledger and the Ethereum blockchain, with plans to extend to other blockchains and DeFi platforms, Ripple said on its website.\n\nTo ensure transparency and address potential concerns about reserve quality, Ripple will publish monthly attestations of its stablecoin reserves. Additionally, these reserves will be audited by a reputable third-party accounting firm. Specific details regarding the chosen firm have not yet been disclosed.\n\nBrad Garlinghouse, Ripple CEO, explained that the launch is to address the growing demand for stablecoin with a compliant and trusted solution and drive development and use cases within the XRPL ecosystem.\n\n“Institutions entering this space are finding success by partnering with compliant, crypto-native players and Ripple’s track record and resiliency speaks for itself, as we launch new products and acquire companies through multiple market cycles. This move is also monumental for the XRP Ledger community, driving more use cases, liquidity and opportunities for developers and users,” said Garlinghouse.\n\nRipple claims its stablecoin offers a unique combination of features tailored for enterprise use, regulatory compliance, and a thriving developer ecosystem. The firm seeks to fill a gap in the market for institutions seeking stablecoin integration for large-scale payments.\n\nA lucrative market\n\nStablecoins are an integral part of the crypto ecosystem. According to data from the Federal Reserves, over 80% of trading volume on major centralized crypto exchanges in 2022 involved stablecoins. This popularity can be attributed to their role as a frictionless on-chain intermediary. Unlike converting to traditional fiat currency, stablecoins allow traders to quickly move between positions without leaving the crypto ecosystem.\n\nWith a value of around $150 billion, Ripple CTO David Schwartz expects the stablecoin market to reach over $2 trillion by 2028. Currently, the market is dominated by Tether’s USDT and Circle’s USDC. However, Schwartz sees opportunities for niche players to carve out their space.\n\n“We think it will be over $2 trillion by 2028, and there’s only two market leaders. We don’t think it’s a winner-take-all-all ecosystem, particularly on the DeFi side,” said Schwartz.\n\nThe stablecoin market is not just sizable, it’s highly profitable. Leading stablecoin issuer Tether recently reported a nearly $3 billion in quarterly profits last year, with $1 billion coming from US bonds. Last month, Tether hit a $100 billion market cap; this level of growth puts Tether in the same league as established giants like British oil and gas giant BP and Shopify in terms of market capitalization."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE5CUzd4UmFuMVdKbDZ2Q0ZUSnpVdzZKN0U3T1ZINHpGRnBOdGNHcWZ6bVNjdjVvaDN4NFUyemZ3VVdDT25oUFVpMjhxaTVDbHZFUTc1OEFQRVN0M3liWkFOdFNPOHN1Wi1va20yNlc3eFpKNmVrNi1Jc3JuWWM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Apr 2024 07:00:00 GMT",
        "title": "Solana 2024 Surges 3.2x Faster Than Ethereum 2020: Fractal Analysis Signals Growth - TronWeekly",
        "content": "Solana’s potential growth traje­ctory parallels Ethereum’s past pe­rformance, according to a recent twe­et by crypto analyst MartyParty. The analyst drew a fractal comparison betwe­en SOL’s projected traje­ctory in 2024 and Ethereum’s performance­ in 2020, fore­casting a substantial valuation increase for Solana. The e­stimate suggests a 3.2x rise in SOL’s price­, propelling it to reach $600 during the ne­xt distribution oscillation.\n\nTradingView\n\nThe analysis shows the past price fluctuations of Ethere­um and Solana, with annotations highlighting their respective­ values at various intervals. Ethere­um’s price reached its pinnacle­ around $5000, while SOL’s apogee occurre­d at approximately $600, indicating a parallel trajectory in the­ir ascent.\n\nSolana eme­rges as a formidable contende­r in the blockchain realm. Its exce­ptional throughput and minimal transaction costs, driven by the innovative Proof of History (PoH) conse­nsus algorithm coupled with Proof of Stake (PoS), position SOL as a viable alte­rnative to Ethereum. While­ Ethereum’s pionee­ring role in smart contracts and decentralize­d applications is undeniable, Solana’s technological advance­ments present a compe­lling case for its future growth and potential impact.\n\nSolana’s design e­nables parallel transaction exe­cution, a significant advantage over single-thre­aded blockchains like Ethere­um. MartyParty­ underscores Solana’s architecture­, which concurrently processes multiple­ transactions, departing from Ethereum’s se­quential approach. This parallel processing e­nhances efficiency and scalability.\n\nSolana Price Prediction\n\nCurrently, SOL’s trading value stands at $188, maintaining its position above the crucial support le­vel of $181. Its current objective­ is to reclaim the 50-day Exponential Moving Ave­rage (EMA) as a supportive factor. Despite­ potential efforts to surpass the $200 barrie­r, there exists a like­lihood that SOL may experience­ a decline back to $165.\n\nSource: TradingView\n\nThe blockchain platform re­tains an advantage among institutional investors despite­ obstacles. CoinShares’ report on ne­t institutional inflows reveals SOL attracted approximate­ly $25 million over the prece­ding month, surpassing the influx for other altcoins, eve­n Ethereum, over the­ same period.\n\nSOL’s potential upward traje­ctory, bolstered by substantial investor backing, could prope­l its price beyond the $200 thre­shold. This surge might defy current be­arish sentiments, enabling it to re­ach a pinnacle unseen for ove­r two years, a remarkable 28-month high.\n\nRelated Reading | Avalanche (AVAX) Successful Retest Signals Potential Price Rally"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxPZWF6X1QtTzJidHJ2dDd3STdjbXh5TUJkTjdKM0JxOUNYTmlIaWpBcHJpMGE4RVZNYllMSjFPWmxkTnRzWTFjVXRFWFZjRW5zc2JpTERmNzluUDRoejVYRWw0WHBKOElWa2sxYzdWdUkyZmtyUWo0OUV2Nmt4U2xoTHhlZ2h3QTNjNDFRZGh3WVk5U0lPRnhPWGdVV0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Apr 2024 07:00:00 GMT",
        "title": "Picasso Network Integrates with Ethereum via IBC Protocol - Crypto Times",
        "content": "Based on a medium post, Picasso Network is now entitled to Ethereum’s Inter-Blockchain Communication (IBC) protocol. It facilitates sending assets and data across Ethereum and all Cosmos network nodes, considerably increasing communication between separate blockchains.\n\n🎨 @Ethereum @IBCprotocol is live on https://t.co/AJSBStq1qm!\n\n\n\nWe're thrilled to announce the official mainnet launch, connecting Ethereum with @Cosmos and @Polkadot – and soon, @Solana. This milestone brings us closer to a universally interoperable and secure DeFi ecosystem.… pic.twitter.com/aS4hCwYHDh — Picasso 🎨 (@Picasso_Network) April 3, 2024\n\n“By connecting Ethereum with Cosmos through IBC and designating Osmosis as the primary liquidity hub, we are setting the stage for a new chapter in DeFi,” Henry Love, Composable Foundation Executive Director, stated.\n\nDeveloping this integration and a greater security level over the conventional bridge methods by creating a common platform to work together with Ethereum and Cosmos community members."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxOQzU3Zm1kdmNfeXpNaVVZdlhzNVNHVDduWFNqN2dhRm16dVgxSlFKUjFqampDazFIYnM5aXpRY1FUalBxcVdHNHJteERnQ3Q3ODhfaXJtOFBZZm95YWZvSEwyOGtyenhKbXkyek9HWkRoRXRmd01Nbm5paHJDWm9ORTFiZll3S3ZhdDZ3M1ZqY0JaUdIBlwFBVV95cUxOLVRrLVBycXVXUjZrWFdxMlQySlJtN3EwQjVzbkQxdUNXMDhnSEd1NS15QmNJWjZIV0NTM2NhSThqNVo0VUpkTjFWbThKUi1aVFA5NTBqSWp5WnFiS0FjbDU0end3Q0ZlQjRKTWhBbzFPdXlUcDBvbm12bVhobkNFTGRuZ0l3ZTJTUzgyWlRVUHJNR0lMcjFJ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Apr 2024 07:00:00 GMT",
        "title": "Legendary Trader Peter Brandt Unleashes Fury on Ethereum: 'It's a Junk Coin' - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nLegendary trader Peter Brandt has unleashed a torrent of criticism aimed exclusively at Ethereum (ETH), labeling it a \"junk coin\" in a harsh assessment of the popular alternative cryptocurrency. Brandt, known for his insights into the financial markets, held no words as he criticized Ethereum, dismissing it as a useless challenger to Bitcoin's dominance.\n\nAdvertisement\n\nBrandt's disrespect for Ethereum was evident in a recent social media post where he disdained its status, asserting that it lacks the fundamental qualities necessary for long-term viability. He pointed to its alleged shortcomings as a store of value and criticized its functionality, citing difficulties with layer-2 solutions and exorbitant gas fees.\n\nBacking up his claims, Brandt referred to the Ethereum/Bitcoin price chart, highlighting Ethereum's steady decline against Bitcoin since the end of 2021. According to Brandt's analysis, ETH's recent drop to a critical support level of 0.05 BTC per altcoin signals further weakness compared to BTC.\n\nAdvertisement\n\nI get tired of saying it, but $ETH is a junk coin despite mindless devotion of Etheridiots.\n\nAs a store of value it is junk - a $BTC pretender\n\nIts functionality is also junk - difficult to deal with L2s and outrageous gas fees\n\nOf course it will always attract \"investors\" pic.twitter.com/7KAYMiwsnf — Peter Brandt (@PeterLBrandt) April 4, 2024\n\nThis is not the first time Brandt has expressed skepticism toward Ethereum. In January, he publicly announced a short position on the altcoin when it was trading at $2,265, citing weak price behavior. Despite Ethereum's subsequent price surge, Brandt admitted a month later that the trade did not go as planned.\n\nBrandt's criticism of Ethereum reflects his broader conviction that Bitcoin reigns supreme on the cryptocurrency market. He previously declared his belief that everything apart from Bitcoin is \"junk,\" emphasizing the main cryptocurrency's role as a primary store of value with significant potential for appreciation."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxQd1ZiV2hrLWNxNlVzaEVJblFmMGlPS3U5WWpfeEw3dGpkdnlNSlNQMGdaQkEtWm5lclYxdjhGRUFnMVBiblBjUERSRE9tRzY4N3ZobG5aa3JsM2huZkx2U1UzcE1OeG92Ykl3RVZ3OVc3dHU1SjBGZy1ncmJlNUc5Uml6NEdtT25tX3lSVVY5OE5WUUdXbkRzQXZ0eDFqNFdxX1dn0gGoAUFVX3lxTE9MVm5pTTdETFRwZVFKbjZkRUZoZjg3bklXUVg0NEMzcFJmd1F4REVmdUFoVllUU294aFR6S08taHVpR2NmS09IM3FpcUpkUzFNSUxleVNueVpvdUVublppSFNrc0pFejlwS2NFX1ZsbENZRDlleXo1MFdyNi1xMmhvNlFrNGhUc3VqOTBLaGQxMjE1YkFjRWZNY1U0dmxPZ2pEX1d0amFKaA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Apr 2024 07:00:00 GMT",
        "title": "US Gov Moves $40M Bitcoin & Ethereum Seized In 2022, Will It Disrupt Price Recovery? - CoinGape",
        "content": "The US government has been observed transferring $40 million worth of Bitcoin (BTC) and Ethereum (ETH) on Thursday, April 4. This crypto reserve was seized from two Estonian citizens back in 2022. This move comes amidst a turbulent period for the leading cryptocurrency as the Bitcoin price just managed to rebound above $67,000.\n\nUS Gov Makes Massive Bitcoin & Ethereum Transfer\n\nThe seized Bitcoin and Ethereum, now in the possession of US authorities, holds the potential to impact the crypto market dynamics significantly. According to Arkham Intelligence, the US government made two subsequent transfers today for BTC and ETH, respectively. The first transfer was of 4,567 ETH worth $15.21 million.\n\nadvertisement\n\nIn addition, the authorities transferred 374 BTC worth $24.80 million to an unknown wallet. With the market eagerly watching the US government’s next steps, speculation is rife regarding the potential impact on the Bitcoin and Ethereum price.\n\nIt is estimated that the eventual sale of the seized crypto reserve by the US government could exert downward pressure on the Bitcoin and Ethereum price. The influx of such a substantial amount of Bitcoin into the market may trigger selling pressure, expediting the current dip in prices.\n\nEarlier, late Tuesday morning, a wallet associated with the US government transferred a massive 30,175 Bitcoin. Considering the Bitcoin price of around $65,000 at the time, this transaction amounts to approximately worth $2 billion.\n\nThe last confirmed instance of the government selling Bitcoin dates back to March 2023. During this event, they sold 9,861 coins for $216 million. This sale followed the government’s seizure of around 50,000 Bitcoin linked to the Silk Road website in late 2022.\n\nAmong the recent transfers, approximately 2,000 Bitcoin were sent to a wallet identified by Arkham Intelligence as belonging to the crypto exchange Coinbase. The remaining Bitcoin was transferred to a wallet flagged by Arkham as being owned by the government.\n\nAlso Read: Bitcoin Short-Term Investors Lose $5.2B Amid BTC Price Crash\n\nBTC & ETH Price Rebound\n\nAfter plummeting over 11% from the recent high of $73,750.07, Bitcoin has recovered significantly. As of writing, BTC price was $67,534.94, gaining 2.58%. Meanwhile, the market cap for BTC stood at $1.32 billion. In contrast, the trading volume plunged 20.20% to $30.11 billion.\n\nHowever, if the recent US government Bitcoin and Ethereum transfer is made for a selloff, the rebound could be short-lived. In addition, Michaël van de Poppe predicted that the Bitcoin consolidation will continue and there’s not much upside as of now. On the contrary, he expects a surge in altcoin prices, which could benefit Ethereum despite the potential selloff.\n\nAt press time, the ETH price was up by 1.35% to $3,374.15 with a market cap of $404.99 billion. Whilst, the trading volume for Ethereum slumped 24.82% to $13.12 billion in the last 24 hours.\n\nAlso Read: Ethereum L2s May Outshine Main Blockchain, VanEck Reports\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMi8AFBVV95cUxOZ1RhbXU3WWFYZ3lod192MFlqTmx6RVRfNGVkbC15Qy1JZWIwcjROX1dCd2xGazE4eWp4Ul9leWhYTEJQUnNackxad0NXeW5uWU1wS2JuNlVrODVwcHBTaHhHX1hJZ2ZYWjhxTTBlQVFDazNXeUZpQUxGc0VHbWF2c0xBbFFCU3BYUEJvaW10STZTbExfMks2TDF2ODBvRkdGR2haWXEyLVpzX0Nfbjgwa0VvaGNqUzRvOTVSRDlmQXQxd1dHLUcyQS1uT0ktQUFfVDctQk5HMjRUX1l1UUhsWE5RdGc5T18xWWtLZkdvSVfSAfYBQVVfeXFMTW5pRnFpY3NqSU9pZ0RFc1hDbTZwUGJ5MWRldEdMVmcxWGFpWG5yNTU2anFqSklZZ2U1ZkQ5ZUp3S1ZLTi1RMEwtb0duU3ZiNFRYenl3NFp2WnhzLW5TNXlJTkZtZ3hvdUROdElGT0dEc0czcmNLdmtja0JwVldoeFRZU0tvZlNaY1lWN09nd1Y1dkhNZEtMTWZKSDEzQ1NMUlBENkliMFA4ZTdRSGZFVGl3NEdoYzAyd3RTak9ncS1GdGhQUjdzSWJwM0lQWmJqSkliXzZPTjBwdXBTd0Z1bWJDeFA3MGhOdkhPOTN0Zk1wM1NKTmJ3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Apr 2024 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: BTC coils up for a final shakeout before next leg up - FXStreet",
        "content": "Bitcoin price could revisit $60,000 before returning to the $73,777 peak as pre-halving dips are common.\n\nEthereum price could reclaim $4,000 if BTC closes above $69,000.\n\nRipple price could go as low as $0.5000 before XRP becomes attractive to buyers.\n\nBitcoin (BTC) price continues to drive markets, with the effects of its show of strength and weakness being felt across the industry in kind. As the market walks into the weekend, volatility is expected to increase as trading volumes reduce, which is characteristic of the weekend.\n\nAccording to analysts, the market could be due for a final shakeout before we continue on our next leg up. If there is any truth to this prediction, then three things stand:\n\nPre-halving dips should not be a surprise if history is enough to go by. The recent meme coin mania inspired euphoria across the market, with the current correction making it seem like the bull market has been canceled. This dip is probably the cheapest traders can buy altcoins for possibly the rest of the bull run.\n\nAlso Read: Bitcoin price upside potential grows as BlackRock draws more of Wall Street players into BTC market\n\nBitcoin could provide another buying opportunity\n\nWith the BTC halving barely two weeks out, Bitcoin price could provide a buying opportunity by retesting the supply zone between $58,375 and $65,518. BTC is already overbought, as shown by the Relative Strength Index (RSI), which is falling. The Awesome Oscillator (AO) is also recording dwindling histogram bars.\n\nAs BTC price consolidates along the $69,000 threshold on the weekly time frame, a pullback is likely before the bulls can decisively overcome this blockade.\n\nBTC/USDT 1-week chart\n\nOn the other hand, increased buying pressure above current levels could confirm the continuation of the primary trend. The first confirmation of this would be a candlestick close above $69,000, above which more buy orders could send BTC price to reclaim $73,777 or even higher to take $75,000.\n\nAlso Read: Layer 3 tokens see double-digit losses dragged by Bitcoin price drop\n\nEthereum price eyes $4,000, but there is a catch\n\nEthereum (ETH) price remains well above the ascending parallel channel and sits atop the ascending trendline. A successful bounce above this technical formation could see ETH price extend north to the $4,000 psychological level. Such an outcome, however, is contingent on BTC price decisively reclaiming ground above $69,000.\n\nETH/USDT 1-day chart\n\nOn the other hand, if the Ethereum price extends the fall in the hands of ETH sellers, the altcoin could fall back into the channel. A break and close below the upper boundary of the governing chart pattern would delay the uptrend. For it to be invalidated, however, ETH must break and close below $2,500.\n\nAlso Read: Ethereum on course to post weekly losses as debate over security status continues\n\nXRP price eyes $0.5000\n\nRipple (XRP) price could extend the fall to the $0.5000 psychological level if the bears can see the price close below $0.5783. A breakdown of this buyer congestion level could see XRP holders exit the market to avoid more losses.\n\nThe position of the RSI below 50 points to a bearish stance, reinforced by the Moving Average Convergence Divergence (MACD) in negative territory and the bearish histogram of the AO.\n\nXRP/USDT 1-day chart\n\nOn the other hand, if the bulls find their way, Ripple price could push above $0.6685. A candlestick close above this level could set the tone for XRP price to foray into the supply zone between $0.7311 and $0.7942. A candlestick close above its midline at $0.7655 would confirm the continuation of the trend, likely going as high as $0.8000.\n\nAlso Read: XRP price ranges below $0.60 despite Ripple stablecoin launch announcement"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMi0gJBVV95cUxORGpTaE9NM205Q25sTFZWa0wxT25LT0d4RW9RV0lnTjViVlAyeHhENnQ3Qk1CaldBc3J6UFhnTlVXRjVGNEV0Y2xobm9VN0cwSlFtam9xN2NOLTBjcHhzZFFxcV9ycXRPT1dFME83enB2U3JLYy1Ha21TeTJwMV9feENZOVkzS2dEem1PYzM2cEtrNndpbTkwRmRQNjQtMEY4R0I5RzR3Y01QTHlid2FWTWNFSkdOTzI3YXFMQVdwdncxcUI4RVB4ekRneWJ0c1VTXzQzREVVSUZ4dVFSQUlXdzZWWUVnbU5CdHNXWUU5UHExaFpxV3dteWxSY0N6RnBUT290TlluNENaS0JEOTh4NmpkQjVFanlLTE9odThhaUk5aWdybzdVaXBHT3lSYnR1OHIxWjNUVUVJcVVCSHZPaWZaNE5ybmRhNTI1aDV2OVBfUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Apr 2024 07:00:00 GMT",
        "title": "Grayscale® Digital Large Cap Fund, Grayscale® DeFi Fund, and Grayscale® Smart Contract Platform Ex-Ethereum Fund Announce Rebalancing of Funds for First Quarter 2024 - GlobeNewswire",
        "content": "STAMFORD, Conn., April 04, 2024 (GLOBE NEWSWIRE) -- Grayscale Investments® , the world’s largest crypto asset manager*, and manager of Grayscale® Digital Large Cap Fund ( OTCQX: GDLC ) (Digital Large Cap Fund), Grayscale® DeFi Fund ( OTCQB: DEFG ) (DeFi Fund), and Grayscale® Smart Contract Platform Ex-Ethereum Fund (GSCPxE Fund), today announced the updated Fund Component weightings for each product in connection with their respective first quarter 2024 reviews.\n\n\n\nIn accordance with the CoinDesk Large Cap Select Index methodology, Grayscale has adjusted GDLC’s portfolio by selling Cardano (ADA), and using the cash proceeds to purchase existing Fund Components in proportion to their respective weightings. As a result of the rebalancing, Cardano (ADA) has been removed from GDLC. At the end of the day on April 3, 2024, GDLC’s Fund Components were a basket of the following assets and weightings.**\n\nBitcoin (BTC), 70.96%\n\nEthereum (ETH), 21.84%\n\nSolana (SOL), 4.52%\n\nXRP, 1.73%\n\nAvalanche (AVAX) 0.95%\n\n\n\nNo new tokens were added or removed from DeFi Fund. At the end of the day on April 3, 2024, DEFG’s Fund Components were a basket of the following assets and weightings.**\n\nUniswap (UNI), 48.74%\n\nMakerDAO (MKR), 20.41%\n\nLido (LDO), 13.17%\n\nAave (AAVE), 9.99%\n\nSynthetix (SNX), 7.69%\n\n\n\nIn accordance with the CoinDesk Smart Contract Platform Select ex ETH Index, Grayscale has adjusted GSCPxE’s portfolio by selling Cosmos (ATOM), and using the cash proceeds to purchase existing Fund Components in proportion to their respective weightings. As a result of the rebalancing, Cosmos (ATOM) was removed from GSCPxE. At the end of the day on April 3, 2024, GSCPxE’s Fund Components were a basket of the following assets and weightings.**\n\nSolana (SOL), 58.41%\n\nCardano (ADA), 14.56%\n\nAvalanche (AVAX), 12.25%\n\nPolkadot (DOT), 8.53%\n\nPolygon (MATIC), 6.25%\n\n\n\nNeither GDLC, nor DEFG, nor GSCPxE Fund generate any income, and all regularly distribute Fund Components to pay for ongoing expenses. Therefore, the amount of Fund Components represented by shares of each fund gradually decreases over time.\n\nFor more information, please visit grayscale.com .\n\nThis press release is not an offer to sell or the solicitation of an offer to buy any security in any jurisdiction where such an offer or solicitation would be illegal, nor shall there be any sale of any security in any jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of that jurisdiction.\n\n*Largest by AUM as of April 4, 2024\n\n**The compositions of the GDLC, DEFG and GSCPxE Fund are evaluated on a quarterly basis to remove existing Fund Components or to include new Fund Components, in accordance with the index methodologies established by the Index Provider. Holdings and weightings of each Fund are subject to change. Investors cannot directly invest in an index.\n\nAbout Grayscale® Digital Large Cap Fund\n\nDigital Large Cap Fund seeks to provide investors with exposure to large-cap coverage of the digital asset market through a market cap-weighted portfolio designed to track the CoinDesk Large Cap Select Index. Digital Large Cap Fund holds the largest and most liquid digital assets that meet certain trading and custody requirements and are classified in the CoinDesk Digital Asset Classification Standard (DACS); the weightings of each Fund Component change daily and are published around 4:00 p.m. NY-time. Additional information on the Index methodology can be found at: https://www.coindesk.com/indices/dlcs/ .\n\nDigital Large Cap Fund’s investment objective is for its Shares to reflect the value of Fund Components held by the Digital Large Cap Fund, less its expenses and other liabilities. To date, the Digital Large Cap Fund has not met its investment objective and the Shares quoted on OTCQX have not reflected the value of Fund Components held by the Digital Large Cap Fund, less the Digital Large Cap Fund's expenses and other liabilities, but instead have traded at both premiums and discounts to such value, with variations that have at times been substantial.\n\nAbout Grayscale® DeFi Fund\n\nDeFi Fund seeks to provide investors with exposure to a selection of industry-leading decentralized finance platforms through a market cap-weighted portfolio designed to track the CoinDesk DeFi Select Index. DeFi Fund holds the largest and most liquid digital assets that meet certain trading and custody requirements and are classified in the DeFi sector defined by CoinDesk Digital Asset Classification Standard (DACS); the weightings of each Fund Component change daily and are published around 4:00 p.m. NY-time. Additional information on the CoinDesk DeFi Select Index methodology can be found at: https://www.coindesk.com/indices/dfx/ .\n\nDeFi Fund’s investment objective is for its Shares to reflect the value of Fund Components held by the DeFi Fund, less its expenses and other liabilities. To date, the DeFi Fund has not met its investment objective and the Shares quoted on OTCQB have not reflected the value of Fund Components held by the DeFi Fund, less the DeFi Fund's expenses and other liabilities, but instead have traded at both premiums and discounts to such value, with variations that have at times been substantial.\n\nAbout Grayscale® Smart Contract Platform Ex-Ethereum Fund\n\nGSCPxE Fund seeks to provide investors with exposure to a selection of industry-leading Smart Contract Platforms through a market cap-weighted portfolio designed to track the CoinDesk Smart Contract Platform Select Ex ETH Index. GSCPxE Fund holds the largest and most liquid digital assets, excluding ETH, that meet certain trading and custody requirements, and are classified in the Smart Contract Platform sector defined by CoinDesk Digital Asset Classification Standard (DACS); the weightings of each Fund Component change daily and are published around 4:00 p.m. NY-time. Additional information on the CoinDesk Smart Contract Platform Select Ex ETH Index methodology can be found at: https://www.coindesk.com/indices/scpxx/ .\n\nGrayscale intends to attempt to have shares of this new product quoted on a secondary market. However, there is no guarantee this will be successful. Although the shares of certain products have been approved for trading on a secondary market, investors in this product should not assume that the shares will ever obtain such an approval due to a variety of factors, including questions regulators such as the SEC, FINRA or other regulatory bodies may have regarding the product. As a result, shareholders of this product should be prepared to bear the risk of investment in the shares indefinitely.\n\nAbout Grayscale Investments®\n\nGrayscale enables investors to access the digital economy through a family of regulated and future-forward investment products. Founded in 2013, Grayscale has a proven track record and deep expertise as the world’s largest crypto asset manager. Investors, advisors, and allocators turn to Grayscale for single asset, diversified, and thematic exposure. Grayscale products are distributed by Grayscale Securities, LLC (Member FINRA/SIPC)."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxOV1ZBMTdIVGVNRGVjeXd4S0RlUndNMzJGSndmdE03ckJrcGVUWkhXbkZtd045ckJ2eWU2LTVaNGxYblA3MDdSOG84NlVmeFZvZjFqT1FhRHJRS3lHY0J6NjRXUkFjQWRuMWs2UklJN1JMZzI1blFHcnhMM3hxa21FNTAzOG9BT3NYRlY00gGQAUFVX3lxTE0xODVCYlVPZUtXUk5ma0dRSmtQYlNsak5xakRwYzE1NXdWZkVzdXBpOThXb0d3QnFkN3FXRGZkNDA3dXNLSTN0Y0x0UjRLWlFaSFV4cTZNVnI5dzlVbkhyZFhhMlNlSDRRS1V1NUpkZXBsYnhCSUxsUmxnYVJtY2dOQ3U0TWp1OEZEUDVtUThGVg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis: Is ETH in Danger of Falling to $3K? - CryptoPotato",
        "content": "Ethereum’s price has been correcting over the past few weeks after setting a local high around the $4,000 mark. While the price is yet to recover, the bull market may be far from over.\n\nTechnical Analysis\n\nBy TradingRage\n\nThe Daily Chart\n\nOn the daily timeframe, the price has been consolidating between $3,000 and $3,600. Following the recent rejection from $3,600, the market is once again targeting the support at $3,000.\n\nThe Relative Strength Index has also dropped below 50%, as the momentum has seemingly shifted bearish. A break below $3,000 would lead to a potential crash toward the 200-day moving average around the $2,400 mark.\n\nOn the contrary, a rebound from the $3,000 zone could push the price back toward $3,600 and likely higher this time around.\n\nThe 4-Hour Chart\n\nLooking at the 4-hour chart, the recent price action seems very choppy. The price has tested the $3,600 resistance zone several times but has failed to continue higher toward $4,000.\n\nThe market structure is clearly bearish in the short term, as the price has been making lower highs and lows consistently. Therefore, a drop back toward the $3,000 zone will be imminent, if the price breaks below $3,200."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxPWDFNcDFZb0pUMXFLLWtpemIxakRPQk9MSlhmRkNyN2J1MVBiaVNUNFByTE5TbTlabll3ZmVpS1MzQVlkZ1FyM2lib0FfanRvdjJIbC14N3FmbDZrbDFTbEdzZXZzOENETDJscmxrSDZxX2tiZU4wN1VwVG5uWUNHNnVIaGdnM1ZhQloyQXB5eTVjc0NjTzZ2cENxYk9sMHpXbVl0QVR2THZyYk9kMWhkSzUyUlhtMXY4ZDNIS1RKU0M0bnN6WnVDY2ctMEt2ZkZIVkRfWNIB2gFBVV95cUxNRXU0d19JS3E4TUltYklpUDVkaE52SUc3UmNMVTNqUnp5YVE3QkthNmJ1ZHdZVkl2a3ZkVGJtdjJsVGZyUjZSMUk1NVZnZjdjWk5jdjJuU1gtRXZTeDVoaGpKVVF4ZXdPbUhGWDU1Z0x0VGZZUGdhV0xmcG5nLXUwTmFZb1ZXdlBnaFdKZVAtWGwzYldOMDNnQzBtbHZfTTlEX0tZNV82bFd6VVVrbmRhVExBRVN0aFJpMGZFX25hZEdrM2hFaEg4NjRERXRyVmZjTkZ5Q21GTlhsdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Apr 2024 07:00:00 GMT",
        "title": "Ethereum continues consolidating as Q1 results show massive growth for the largest altcoin - FXStreet",
        "content": "Ethereum's network Q1 financial report shows that it tripled its earnings quarter-on-quarter to around $370 million.\n\nBitcoiner argues about ETH's security status as Bloomberg analyst James Seyffart labels it as a commodity.\n\nVanEck expects Ethereum Layer 2 chains to accrue more revenue than the main Ethereum chain by 2030.\n\nEthereum (ETH) sustained its consolidating movement for the second day on Thursday, trading above $3,300 after crashing earlier in the week. While this may signify indecisiveness among bulls and bears, its Q1 results show steady growth across various sectors even as community members debate on its commodity status.\n\nRead more: Ethereum drops further as Bitcoin’s decline, uncertainty over ETF weigh\n\nDaily digest market movers: L2s, Q1 earnings, ETH commodity status\n\nEthereum has been one of the most trending cryptocurrencies in the past few weeks. Despite expectations that anticipation for Bitcoin's halving would be the main subject of discussion, the SEC's decision on Ethereum ETFs and the recent crackdown on Ethereum Foundation appears to have taken center stage in the crypto community. That said, here's a quick breakdown of the latest happenings surrounding the largest altcoin:\n\nIn a report released on Wednesday, global asset manager VanEck analysts expect Ethereum Layer 2 networks to accrue more revenue than its main chain. They sighted data from crypto analysis firm Artemis XYZ, showing the increasing growth of the underlying Ethereum ecosystem against its Mainnet declining market share. L2s offer superior throughput and user experience, especially with the Dencun upgrade on March 13, which introduced Blob space – a data layer for L2 that reduces data overhead and gas fees – noted VanEck analysts.\n\nThe analysts further predicted that Ethereum L2s may be worth more than $1 trillion by 2030, considering several application, sector, or function-specific Layer 2s may emerge – like an asset management L2 or rollups that host a social media sector. They noted that these L2s reinforce \"the value of ETH as the true ‘oil’ powering the entire ecosystem of connected chains.”\n\nEthereum's Q1 financial report, released on Wednesday by Coin98 Analytics, showed significant growth in revenue and earnings. Ethereum's revenue grew nearly 84.6% quarter-on-quarter (QoQ) to reach $1.035 billion, and earnings reached $369.11 million, a 198.8% QoQ change. Much of this increase is attributed to the spike in gas fees before the Dencun upgrade. Other metrics from the report include 107 million transactions conducted with 9.7 million new addresses in Q1.\n\nFollowing ETH Q1 results was Cory Klippsten, CEO of Bitcoin financial service firm Swan.com, arguing in an X post on Wednesday that Ethereum was a security when it launched. He claimed the SEC didn't want to get in the way of another agency when it allowed the CME to start trading ETH futures ETF.\n\nHowever, Bloomberg analyst James Seyffart, who was tagged in the post, responded by stating that the ETH futures ETF was registered as \"commodities futures, not securities futures.\"\n\nIf the SEC wanted to come out and call Eth a security, they should not have approved the listing of #Ethereum futures ETFs which rely on these contracts. To go back and change that would likely mean the delisting and closing of CME ETH futures AND the ETH futures ETFs. Thus why… — James Seyffart (@JSeyff) April 3, 2024\n\nJames Seyffart also said in another X post that the SEC asking for public comments on spot Ethereum ETF filings is a normal procedure and \"not ‘bullish’ in any capacity for Ethereum ETFs.\"\n\nAlso read: Ethereum drops further as Bitcoin’s decline, uncertainty over ETF weigh\n\nTechnical analysis: Indecisiveness persists\n\nTraders are exercising more caution as Ethereum's price continues its horizontal move for a second consecutive day. This indicates reduced bullish sentiments for the largest altcoin.\n\nETH/USDT 1-hour chart\n\nRead more: Ethereum consolidates above $3,500 as Bitwise CIO says ETF delay would be positive\n\nIf Bitcoin’s price shows signs of recovery, ETH could resume an upward move to break past the $3,493 level, which is the high from April 2. . Further up, next resistances are at $3,517, $3,570, and $3,655, which also align with recent swing highs seen in the past few days.\n\nHowever, this thesis would be invalidated if ETH moves below the $3,204 support level, the low from April 2.\n\nThe SEC's decision on the May 23 deadline to respond to VanEck spot Ethereum ETF filings is expected to have a major effect on prices."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxQclUyRVhjbnFfelo4MDExU003MExBR0IxNGNuSjdaZEFvZmgyeHdVWFUwN2hGTkJyM1Z6NFB6a2VlWVhOVnlXZWFvVkJBNUt4RERQWU1maWtGV2p1ZXA5RjZRSDRncmdVVlN1UEI2ellWOGRPZEptN3VaOWNUakZNUFlhRGM0eXFxalR6Njc0WG5RbExBV3A5cUNYX0IxZEk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Apr 2024 07:00:00 GMT",
        "title": "Ethereum weak graphically against bitcoin: altseason at risk! - The Cryptonomist",
        "content": "At this moment the long-awaited altseason phase, in which most of the alternative coins record performances superior to those of Bitcoin, is at risk after a dangerous death cross appeared on the ETH/BTC chart on the weekly chart.\n\nThe downward crossing of the 50-period simple moving average with the 200-period moving average generally indicates a downtrend in prices.\n\nWith ETH weaker than BTC, it will be difficult to see a positive reaction in the altcoin sector in the short term, however the altseason could be closer than the market expects.\n\nAll the details below.\n\nDeathcross on the weekly chart ETH/BTC puts at risk the altseason phase of the bullish market\n\nWhile Bitcoin travels indecisively within the trading range of 62,000-71,000 USD, Ethereum moves with less conviction marking a worse graphic performance compared to the first cryptocurrency by market capitalization, and diminishing the hopes of retail investors to enter altseason in the near future.\n\nGenerally, in fact, the phase in which alternative coins mark monstrous value increases outperforming the digital gold, begins when the ETH/BTC chart shows signs of strong upward movement during the bull market.\n\nToday, looking at this chart on a weekly time frame we can notice a predominantly bearish trend of prices, with the simple moving average of 50 periods crossing downwards that of 200 periods.\n\nTechnically known as “death cross” this condition usually ends up generating a decline in prices, signaling the start of a potential prolonged underperformance cycle of ether and other altcoins compared to bitcoin.\n\nEthereum to Bitcoin ratio chart (ETH/BTC), Binance market\n\nIn the last few weeks of trading, market indecision has led ETH to record 5 red candles out of 6, after the currency had tried to attack the 0.06 sat zone but was rejected by bitcoiners.\n\nNow the loss of 0.05 sat could set the stage for further downward price flushing with the next support in the 0.04 sat area.\n\nThe difficult situation for ether is also confirmed by analysts from the company QCP Capital, based in Singapore, who stated in a recent market note:\n\n“The ETHBTC cross is testing a critical support level after dropping below 0.05. There has been a significant and persistent selling of ETH call options that has crushed [volatility] and also exerted some downward pressure on the price. It could once again be a very early signal of a FOMO [bullish] turning into fear in ETH as a proxy for alternatives.”\n\nWith the ETH/BTC ratio already down 10% since the beginning of the year, retail traders are starting to stop dreaming of an imminent altseason in the market, making room for different scenarios.\n\nHowever, the bullish reaction of ETH could be closer than we think: the cryptocurrency is approaching a support zone that in June 2022 managed to keep prices high, so it could also prove to be good this time.\n\nFurthermore, the ETH/BTC pair has been registering a continuous downtrend since September 2022, when each ether was worth 0.08 BTC: the bulls could soon take control of the situation again after such a long distribution period.\n\nHistory teaches us that when fear spreads through the streets, it is the ideal time to do business: if the dip in ether is absorbed, the chances of an altseason by the beginning of summer could revive.\n\n#Altcoins\n\n\n\nETH/BTC reaches the lower trend line of the falling wedge. We may see a fakeout, but I wouldn't bet on it.\n\n\n\nEither way, the whole chart looks pretty exciting.\n\n\n\nBiggest Altseason since 2017 is ahead of us imo.\n\n\n\nAll you need? Patience. pic.twitter.com/yNZlrTufSI — 𝕄𝕠𝕦𝕤𝕥𝕒𝕔ⓗ𝕖 🧲 (@el_crypto_prof) April 5, 2024\n\nBitcoin dominance still strong: too early for the altcoin golden moment, but memecoins are already showing excellent performance\n\nAnother very important chart to observe in order to understand when the long-awaited altseason phase will begin is the dominance chart of Bitcoin (BTC.DOM)\n\nThis chart shows the dominance rate, expressed in terms of market capitalization, of Bitcoin compared to the rest of the altcoin world.\n\nIndicatively, the altseason begins when, within a generally bullish market phase, BTC loses market share compared to competing coins\n\nHere too we can observe a situation that does not bode well for the arrival of an altseason, with BTC.DOM continuing its bullish rally since November 2022, bringing dominance to 54.68%.\n\nBitcoin (BTC) dominance trend chart\n\nIt might be too early to shout about the rise of the entire altcoin sector, at least until we see the first signs of weakness in the chart just presented.\n\nA first breakdown of 53% value, followed by a bearish continuation below 50%, could open the doors to a new market phase led by ETH and smaller cryptocurrencies.\n\nFor now, there are no encouraging signs in this sense, even though within the niche memecoin we observe a trend that seems to anticipate the arrival of the altseason.\n\nIn the Solana and Base blockchains, we notice a strong speculative activity on meme-based cryptos, which indicatively demonstrate the traders’ willingness to expose themselves to riskier products than Bitcoin.\n\nThis could be seen as a prelude to an even more aggressive phase, in which memes and low cap tokens could be targeted by the degens of the crypto world, abandoning bitcoin as the most attention-grabbing asset to make room for other alternatives.\n\nTo give an idea of how strong this memecoin mania is, we report the data from DefiLlama which shows a volume increase of about 10 times on the Base blockchain from February to today, from 50 million dollars per day to the current 500 million."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxOVm5EUlVBYk1hM0Fkb3BPamM0bENUTHlUYVhFZG5Gb2JpY19YQmtPSm1CQjkwazlYTG5Fa3J5RC1sb1dHcU5XYkxSQVFJYTFsUzFLT3JzYURVWXJKNmhQVzNxeF9xZnJTaEpVTU85SUhOdFA4dk9YMnlsR0dUNUY1TVpYVG4waHNiUlZueTRQdklkZURfLXNRWGNiSdIBoAFBVV95cUxQcnlRS1JTd0p3b1pIenR2Y0tpZEliZEFrMkhhUWlPenBnWHlTTHhONC1TN182cUR1eE8tZEpUTVNtTWJfX3AwdUpxTDRmZ0NqWEJOcmk5YTVtTHQ4NGNzX2xQV0pmMDRGS3RYNFVrdlJjU3UzZ3VfZWFNTFFFcWhMbG0xTkZzbnFaMFdFZ1lFOFZLNlk4cFRzeFg5X2RocHhX?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Apr 2024 07:00:00 GMT",
        "title": "Ethereum layer-2 market cap to reach US$1 trillion by 2030, VanEck predicts - Forkast News",
        "content": "Investment firm VanEck has predicted Ethereum layer-2 networks will collectively reach a market capitalization of US$1 trillion by 2030.\n\nThe projection, detailed in a report released on April 3, underscores the potential of layer-2 solutions to significantly enhance the scalability and efficiency of blockchain technology.\n\nThe analysis by VanEck points to Optimistic and Zero-Knowledge Roll-Ups as pivotal in addressing Ethereum’s scalability hurdles, setting the stage for a transformative impact on the digital asset sector and solidifying layer-2’s integral role within the Ethereum framework.\n\nVanEck examines various facets of the Layer-2 ecosystem, including transaction costs, user and developer experiences, trust requirements, and overall ecosystem size.\n\nIt emphasizes the anticipated benefits of the EIP-4844 upgrade, known as “Blob Space,” which is expected to drastically cut data posting expenses and financially benefit layer-2 operations.\n\nThe report also identifies transaction sequencing as a key revenue stream for layer-2 solutions and forecasts that by 2030, these networks will command a significant share of Ethereum’s transaction and total value locked, a measure for assets locked in a network’s decentralized finance ecosystem."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxOSndzUFAybzdMR1RjS0pEZjV5V3cxcEhlSjJGWXotNGZQWGhIUEwyTzhXRUlrNlJsOGJyZ1N6R01DcTRaeHYyQkcyMXRDaU9UYmFXZVJWRG9iTHM5anhSQ3hrVVp1UFhkV1NrVEUzUVlDR1JDSzVwNWc3YjU5bFhySlkyVmJZdnpoc1E4Vk01dHVUYWFmU3cySU1qaV9uUdIBowFBVV95cUxNamNiLXVqVnNJUXJUS1g5eHcyYkFWSUMxLUMtalJfTncyd3lYSjFQVTBtLVdwQXhDVFZscTd5Zm5WRThiQkk2LUhWTlI5QUh5N3ZfbmZ5N2pIak9KcDRkZXdDeWhCa2hiMnNmXy1hamxESHNWdkFGZnZEZzYtYndreVRrX0k0UnJfelpiUmNhclZLbDA1NnhZRGVQTXI5allFb2Nr?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Apr 2024 07:00:00 GMT",
        "title": "Crypto Prices Today April 5: Bitcoin At $67K, Ethereum Nears $3300, ADA & XRP Recover - CoinGape",
        "content": "The top crypto prices today witnessed a mixed action as the Bitcoin (BTC) price rebounded above the $67,000 level. In addition, the Ethereum price neared the $3,300 mark. Meanwhile, other top altcoins, such as XRP and Cardano (ADA)) recovered while Solana (SOL plunged significantly.\n\nMajor Crypto Prices Today\n\nThe Bitcoin price was up by 3.28% reaching $67,663.81 at the time of writing on Friday, April 5. On the other hand, it’s trading volume jumped 11.53% to $35.12 billion in the last 24 hours. Whilst, the crypto boasted a market capitalization of $1.33 trillion.\n\nadvertisement\n\nLooking at altcoins, the Ethereum price gained 0.40% to $3,295.34 at press time with a market valuation of $394.90 billion. Whilst, ETH saw its trading volume drop by 1.85%, reaching $14.62 billion. Meanwhile, the Binance Coin (BNB) price dipped 0.99%, reaching $573.70. in addition, its 24-hour trade volume slumped by 5.63% to $2.13 billion.\n\nThe Solana price dropped below the $180 mark today. The Solana price declined 2.99%, settling at $176.84. In contrast, SOL witnessed a 8.58% hike in trade volume to $4.17 billion in the last 24 hours. Whilst, the XRP price recovered and approached the $0.59 level. The XRP price recorded a gain of 2.41%, reaching $0.5833. On the other hand, XRP’s trading volume surged 40.82% to $2.15 billion.\n\nMeanwhile, the Cardano price rose 1.36% to $0.5835 today. Whilst, ADA recorded a 1.42% hike in its 24-hour trading volume, settling at $468.73 million. As the top crypto prices experienced volatility today, the meme coin arena followed suit. The Dogecoin price was down by 0.47% to $0.1743 while its rival, Shiba Inu price gained by 1.65% and traded at $0.00002673.\n\nAlso Read: XRP Price Market Sentiment Targets $1 Milestone Amid Rigorous Regulatory Debates\n\nTop Crypto Prices Today Are\n\nPepe Coin (PEPE)\n\nThe Pepe Coin (PEPE) crypto, a hyped Solana meme coin, didn’t see much change in price today. At press time, the Pepe Coin price was down by 0.26% to $0.000006737 with a market valuation of $2.83 billion. In addition, the 24-hour trade volume for PEPE slumped 16.19% to $510.13 million.\n\nPendle Soars 28%\n\nPendle (PENDLE), an Olympus Pro ecosystem token, recorded an impressive surge of nearly 28% and ranked as the top crypto gainer today. The Ethena price was up by 27.64% to $6.27 at the time of reporting. Moreover, its trade volume skyrocketed by a staggering 229.37% and stood at $332.14 million. Furthermore, the Pendle crypto recorded a new all-time high of $6.63 amid the rally today.\n\nAlso Read: Ethereum Price Forecast: Can ETH Still Hit $4,000 Pre-Bitcoin Halving?\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxQYVBINDJjSmM1RGxoYVBJS2wxRlFUWFgxemZpU2Ixc0tGcEZMYUlBc29ERUZxT3dZa2xqYzFiVklnZl9LdFZvUjhmNThMNnVHeEx0cXdmSlpxeGhXblpCcWRRSTNLdVJrT0M5YTFPOHNfT0pzVnNFS0VLZzhpeXVLbFExbWhLVlg3NHRDa2NfbWNJb2dhdFpfcTdNVjVseDZKMG5nQXhVdFJMa205VG5pTm9XaW7SAboBQVVfeXFMUHFZM0hXcTNvV0QzY3dOemxGQ1hPV3c4U2hnTzhfQ3gta01SajkxaVFYM1EzR0lCSkxxUUsyMUlabWhERDFVMWZuSjloZWIwZzVPWEdURlQxVW03LXdUS0drTXluWk1oejJIVHR3djd1ZUZQVlg3ZmlPS25PUzk4WVExakVhUV8yQUZmZURBcDVHcTFlMjVwMFo0VmU0Z2xUSUJoM3BlNDJuV3A3S0p1Yy1MRWRKWmNHdUFn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Apr 2024 07:00:00 GMT",
        "title": "XRP's Unexpected Breakthrough, Shiba Inu (SHIB) at Crucial Resistance Level, Ethereum (ETH) Stronger Than You Think - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nXRP has recently seen a surprising increase in its price. It has gone over the important level of $0.6, which many traders think is a sign that its price might keep going up.\n\nPeople who invest in XRP might even go higher than the 50-day Exponential Moving Average (EMA). If they do, it could mean that XRP is becoming more stable on the market.\n\nWhen we look at the XRP price chart, we see that it has been moving in a strong way. It was stable for a while, but then it went past the $0.6 mark quite unexpectedly. Previously, this level stopped the price from going higher. Now that it has passed this level, it looks like people are more interested in buying XRP.\n\nIf XRP stays above $0.6, we might see it try to go past the 50-day EMA. If it can end the day higher than this average, we could see the price go up even more, possibly reaching $0.65.\n\nAdvertisement\n\nHowever, we must also think about what happens if the price starts to fall. The chart shows good support around $0.55, which has been a point of a previous price reversal. But if it falls below $0.55, the next big support is at $0.50. If the price reaches this lower level, we might see people start buying XRP again to stop the price from falling further.\n\nShiba Inu hits ceiling\n\nShiba Inu approaches the resistance posed by the 21-day Exponential Moving Average (EMA). If SHIB can surpass this resistance, it may signal the beginning of a rally, leading to a potential acceleration in price growth.\n\nLooking closely at the SHIB chart, we notice that the price moves near $0.00002756, closely challenging the 21 EMA. This movement comes after SHIB's price experienced a considerable surge, followed by a period of consolidation. The key to future momentum will be whether SHIB can maintain its strength and break through the EMA line.\n\nA definitive break above the 21 EMA could open the door to a further recovery, with the next resistance possibly around the $0.00003 mark. This area may act as a new challenge for SHIB, where it has previously encountered selling pressure.\n\nConversely, support levels are clearly established. The first level of significant support is found at approximately $0.00002256, a region where SHIB has found buyers in the past. If the price were to fall below this level, the next major support is around $0.00001941, which might serve as a stronger line of defense for the price to rebound.\n\nEthereum stays strong\n\nEthereum's resilience is often debated, especially during 2024's bullrun. A close examination of Ethereum's price chart suggests that the second-largest cryptocurrency is displaying a strong stance against prevailing market trends.\n\nThe current price of Ethereum stands at $3,378, with the asset showing signs of maintaining above significant support levels. The key support to watch is around the $3,011 mark, where the 100-day Exponential Moving Average (EMA) lies. It has previously acted as a strong support and may act like one again.\n\nOn the upside, Ethereum faces immediate resistance near the $3,500 zone, which coincides with the 50-day EMA. A consistent close above this average could signal a return of buying pressure, potentially leading to a test of higher resistances, possibly around the $3,600 to $3,700 range.\n\nAs for the positive scenario, if Ethereum can break through the $3,500 barrier, it may set the stage for a bullish run toward $3,600. This would be an indicator that Ethereum is not only recovering from sell-offs but also gaining momentum for a continued upward trajectory.\n\nHowever, a slip below the 100-day EMA might push ETH near the $3,011 level, which could act as a secondary support. Falling below this could bring the next critical support into play around $2,625, corresponding with the 200-day EMA."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxPaDdjX3docGVyOGhoY1U4RHZPQnFXazlKNXYtcEpUYjZrVjVSdnYwOXlpV1Itd3c1bU95Ty10QUs0N3d3d2ZwMURKYll3aXZoalJkSVdYTFZSak5QOTVqLXVlYzNjT1JfX0kxdW1YaG1rUnpqZ3RaV2czSEZJVjE5VFNRcXU1MnBSVHBFWFhQcTBiYTNpNlozWmp6VjhHVmJJOUZFN1lZVnpDTTNqM0pxY0Rsd3NnaFQzSkE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Apr 2024 07:00:00 GMT",
        "title": "Ripple Dips Into Stablecoin Market, With Plans to Launch a Stablecoin on XRPL and Ethereum - The Fintech Times",
        "content": "Ripple, the provider of enterprise blockchain and crypto solutions, plans to launch a stablecoin, pegged 1:1 to the US dollar (USD).\n\nRipple’s stablecoin will be 100 per cent backed by US dollar deposits, short-term US government treasuries, and other cash equivalents. These reserve assets will be audited by a third-party accounting firm, and Ripple will publish monthly attestations.\n\nThe stablecoin market is about $150billion, and is forecasted to exceed $2.8 trillion by 2028. There’s clear demand for stablecoins that deliver trust, stability, and utility. To meet this growing demand, Ripple will issue a stablecoin, leveraging its decade-plus of experience building real-world financial solutions for institutions around the world.\n\nAt launch, the stablecoin will be available on the XRP Ledger (XRPL) and Ethereum (ETH) blockchains, with plans to expand to additional blockchains and decentralised finance (DeFi) protocols and apps over time.\n\n“This is a natural step for Ripple to continue bridging the gap between traditional finance and crypto,” said Brad Garlinghouse, Ripple CEO. “Institutions entering this space are finding success by partnering with compliant, crypto-native players and Ripple’s track record and resiliency speaks for itself, as we launch new products and acquire companies through multiple market cycles. This move is also monumental for the XRP Ledger community, driving more use cases, liquidity and opportunities for developers and users.”\n\n“Issuing our stablecoin on the XRP Ledger and Ethereum will serve as a pivotal entry point to unlock new opportunities for institutional and DeFi use cases across multiple ecosystems,” added Monica Long, Ripple president. “The XRP Ledger’s native capabilities, including a decentralised exchange and automated market maker, were built to utilise XRP as the bridge asset https://dev.to/ripplexdev/xrpl-feature-spotlight-the-power-of-auto-bridging-2p2i. Bringing a trusted stablecoin onto XRPL will drive more adoption and development, contributing to a vibrant ecosystem.”\n\nKey benefits of Ripple’s stablecoin include:\n\nRipple specialises in blockchain-based enterprise grade solutions that financial institutions and enterprises need. Ripple will leverage both XRP and the stablecoin in its payment solution to further improve the customer experience and serve as the first enterprise use-case of the asset at scale. There is demand from Ripple’s customers in emerging markets to enable stablecoin payouts.\n\nRipple is committed to regulatory compliance and has a growing license portfolio in key regions around the globe. The company and its subsidiaries collectively hold a New York BitLicense, nearly 40 money transmitter licenses across the US, a Major Payment Institution License from the Monetary Authority of Singapore, and a Virtual Asset Service Provider registration with the Central Bank of Ireland.\n\nEarlier this year, Ripple agreed to acquire Standard Custody, one of the few crypto companies that holds a NY Trust Charter. In doing so, it expanded its license footprint to better serve enterprise customers. – liquidity on the decentralised exchange (DEX).\n\nWorking on the XRP ledger\n\nWhile XRP is the native currency on the XRPL, the Ledger was built to support any type of asset issued to trade on the DEX and quickly settle anywhere in the world with low transaction costs. Bringing more credible assets on the DEX, such as Ripple’s stablecoin, will drive numerous benefits for users, developers, and apps.\n\nBacked by a 1:1 reserve of cash and cash equivalents, Ripple’s stablecoin is designed to ensure transparency and reliability. Once the stablecoin is available, Ripple will publish monthly attestations of the assets.\n\nThe Ripple stablecoin will be issued on the XRP Ledger. It will also be issued on the Ethereum network using XRPL native functionality and ERC20 token standards. Developers on both XRPL and ETH will be able to incorporate the Ripple stablecoin so that users can transact with stability, confidence, and trust. Furthermore, The Ripple stablecoin will expand native issuance to other blockchains, allowing users to benefit from cross-chain interoperability."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxQTjdvdkRXQW42RjJIRkZ0RlFBcVhMYVNmYjNEb2tQbU9RMmphUUNWWTB4Ry1nSmtlcDFGbFFhdVlwTFZYeUdiRDc2QjR6SWI5VEJUZEVtY0ZJOXFRZzFRbzJ3UHRfM3FKMkd3VDNsUmRmcEFWNXVfZV9YSHM4WjFsYXlzYUxadXB5XzBCY2Z3LVIxUEdsaU5BWVFOSHR2cFlfY0ZUbTJyeTJuNDdQMmtGSjR5NWgtVTQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Apr 2024 07:00:00 GMT",
        "title": "VanEck’s opinion on Ethereum’s layer-2: evaluation of 1 trillion dollars by 2030 - The Cryptonomist",
        "content": "Recently, the prestigious investment company VanEck has published its vision regarding the medium-term future of Ethereum’s layer-2, now on the lips of all users of the decentralized world.\n\nThe hedge fund predicts a bright future for this sector niche, which could reach a valuation of 1,000 billion dollars by 2030.\n\nAt the same time, however, a parallel failure of many solutions that will not be able to emerge in the midst of fierce competition is expected.\n\nBelow all the details.\n\nVaneck on Ethereum’s layer-2: bullish even if many will disappear\n\nThe US Fund Manager VanEck, recently involved in the loud request for an ETH spot ETF to the SEC, has just revealed a contrasting medium-term view on the future of Ethereum’s layer-2 solutions.\n\nAccording to studies by the well-known investment company, the sector could experience growth of up to $1 trillion by 2030 in a context where blockchain is able to overcome the scalability limits currently affecting it.\n\nEthereum Layer-2 market cap hitting $1 trillion by 2030\n\n\n\nCiting scalability solutions like Optimistic and Zk Roll-Ups.\n\n\n\n-According to a new research report published by VanEck on April 3. 👇#Ethereum #EthereumETF #Bitcoin pic.twitter.com/2ksarqs4pb — Bitinning (@bitinning) April 4, 2024\n\nSpecifically, VanEck analysts Patrick Bush and Matthew Sigel estimate that Ethereum will eventually capture 60% of the market share across all public decentralized networks, establishing itself as the most widely used cryptographic network in the world.\n\nCurrently, the Ethereum layer-2 market is worth 39 billion dollars, with Arbitrum, Optimism, and Base leading the ranking:\n\nOn one hand, VanEck shows a predominantly bullish trend for this niche of the Ethereum universe, on the other hand, it believes that the competition in the sector will make several projects obsolete.\n\nOn the long-term prospects of many of these second-level networks, the company actually considers them “generally bearish“, with a good portion of them destined to disappear.\n\nVanEck has predicted that out of the 46 L2 chains currently on the market, despite the positive outlook that will attract new investments, the emergence of dozens of other competitors will lead to the failure of many of these.\n\nAs shown by the data from L2Beat, the top 3 layer-2 solutions on Ethereum alone capture about $29.3 billion, more than 70% of the total TVL of the sector.\n\nSigel and Bush also believe that the tokens of these infrastructures have a still too high unlocked supply, potentially harmful to the market due to a too aggressive dilution.\n\nHere is what the analysts reported verbatim:\n\n“The first 7 tokens for L2 collectively already have a $40 billion FDV and there are many strong projects planning to launch in the medium term. This means that there is potentially an additional $100 billion in FDV in L2 tokens that will enter the market in the next 12-18 months. It seems like a bridge too far for the cryptocurrency market to absorb even limited amounts of such supply without huge discounts.”\n\nIn such a scenario, only the most innovative solutions capable of obtaining a constant flow of active users and on-chain volumes will be able to survive and benefit from the growth of the Ethereum world.\n\nThe Outlook of the Ethereum World: The Most Promising L2 Solutions\n\nWhile the Ethereum layer-2 sector shows more and more signs of congestion, significant of excessive competition, the best solutions are preparing to attract the next phase of mass adoption.\n\nAt this moment, the safest L2s to bet on for the future are the top 3 networks Arbitrum, Optimism, and Base which form a separate market thanks to their much higher valuation compared to other contenders.\n\nBase in particular could have a preferential adoption channel in the future, being supported by the large cryptocurrency exchange Coinbase which boasts a sum of about 7 million monthly active users.\n\nFollowing are other layer-2 solutions that likely have a chance to establish themselves in this world of sharks: Blast, Starknet, ZkSync Era, Zora, Scroll, Linea, Fraxtal, Mantle, and Mode Network.\n\nAmong those who can rely on luxury backers, such as Consensys for Linea or Matter Labs for zkSync, and among those with innovative infrastructural features like Fraxtal and Mode, all these solutions could play a crucial role in the future of Ethereum.\n\nMany other networks, on the other hand, which generally have a TVL lower than 100 million dollars, may struggle to find their ideal role.\n\nAs layer-2 solutions, these blockchains serve solely as an alternative channel to reduce the workload on the Ethereum mainnet, helping the main network in terms of scalability.\n\nThe most requested qualities, in addition to the presence of a rich ecosystem of opportunities guaranteed by important backers, are therefore those of fast transaction execution and competitive commission costs.\n\nOnly the best will survive this race for cryptographic efficiency.\n\nSpeaking of fees, we emphasize how the recent Dencun update has allowed for a significant reduction in fees on L2."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxNMk5iZUxaQkFLdDlhTGpZMkQtVWwzSXpiMjRzX3pCNUEyWENrS3hDUzM0OXREUmw2ejhkNlhzNUl5TTExZXpVQ2ZiazU2WldxUEl1SGliZjVCNXo0STkyX1NxLWtNbElCMnY1Z20yQUhPNVkweTBwaUNUVG9WVTRCOHNqc0QwYjV6M3NUbnFPRFdVMFE0SjZwLVd6aEhjNXNGWXlJT2t4SGVSSU5SOGZlUlU1Y1hxTEJ1VG5OSEp1QWTSAcYBQVVfeXFMT21ZRTFJaEpucllNMkhqQTA5T2EzZy15QWQ4T2wyLWNjTDJQcEJPdmdmT1NJN0oxWTNCaU1sckZYdnJDMU40Mk1UNmdiV0pQVnhhZkt1U3pJZjNpNkQ5em40WV9ZWTI3U3FEbFpsYndsQUM2cjV0Zmw1VmFOckhTQXdmY016bm43UTdCY241cFp1a2sxNlZYT2R2SmY5QzN1RUNxQmVEYzA1aGVGMkg2NHdlNzlHdWZsdGZSWFRtajYtNUJqZFR3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Apr 2024 07:00:00 GMT",
        "title": "Ethereum L2 tokens to hit $1T market cap by 2030: Van Eck analysts - Forbes India",
        "content": "\n\n\n\nCrypto is expecting a significant bull run, with the total crypto market cap at over $2.5 trillion as of April 4, 2024. Bitcoin has a big share here, at about $1.302 trillion, breaking into the top 10 assets in the world by market capitalisation and taking the ninth spot.\n\n\n\nExperts have been issuing optimistic forecasts in the long term across all sectors of the crypto economy, including a recent prediction from Van Eck analysts: they expect Ethereum layer 2 tokens to hit $1 trillion in market capitalisation by 2030.\n\n\n\nTo elaborate on this: said Van Eck analysts were bearish on these L2 tokens owing to tight competition, but they do see Ethereum layer 2 scaling networks reaching $1 trillion in market cap and being made up of many use case-specific chains by 2030.\n\n\n\nAs Van Eck’s Patrick Bush- senior digital assets investment analyst, and Matthew Sigel- digital assets research head, stated, these layer 2 blockchains are all about solving for the primary challenge Ethereum faces, which is “limited capacity to process, store, and compute data.” They expect Ethereum to expand to about 60 percent of the market share throughout all public blockchains, and the estimation of the volume of assets harboured on Ethereum based on this prediction amounts to the $1 trillion amount they have mentioned.\n\n\n\nNotably, Ethereum’s scalability challenges have long been highlighted by the crypto community, especially as Ethereum situated itself at the heart of DeFi with its smart contract functionality. As the aforementioned Van Eck analysts stated, “Ethereum’s dominance in smart contracts faces a critical hurdle: scalability…. While the network offers unparalleled security and decentralisation, transaction fees and processing times soar when usage intensifies.”\n\n\n\nThe proof of stake transition is expected to take care of a part of these challenges in the coming years, but layer 2 protocols to share the burden are expected to remain as relevant as ever.\n\n\n\nThe recent Dencun upgrade for Ethereum in March brought down layer 2 transaction fees through data-saving features called ‘Blobs’, which shows the network is putting thought into making layer 2 data processing more efficient. As institutional interest grows in Ethereum, the blockchain seemingly has an upward trajectory ahead.\n\n\n\nShashank is the founder of yMedia. He ventured into crypto in 2013 and is an ETH maximalist.\n\nTwitter: @bhardwajshash\n\n\n\n"
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE5CSWxKYkxqNU5UbzF3SjA4X0lKdkx5dUs5NkV1SWE2RmdaLUV4Ymh4X1EzZVN4OElUX21BSldFYTRneUFhbkRqeFN2UWw0YU5lVGRjM3VUUHlJbzBFM2NZNWZFQmJmdGp3dDlQM3NfZ1RZcVJQWUxoSXNWMUZKUdIBgwFBVV95cUxPb2ZEWjZKeXB2ZjctdEo1OTlRNjR1cy1OZ1M3d1VZMGVvd3hLaElBcUJmbE5fWF9DY2c1SjN1U3B3UlJBV3A4VU9jeUtGNnlGanlOZE5Vb3dHQVEtZnNwb2pzWmR2dTN6XzNNNDBQX3FnM1JpYXM1STFJbng0VG4xTi15OA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Apr 2024 07:00:00 GMT",
        "title": "Ethereum: How L2 activity helped its fees remain steady - AMBCrypto News",
        "content": "L2 scaling recently saw an all-time high.\n\nEthereum’s overall fee was over 13.4 million.\n\nThe Ethereum [ETH] Layer 2 (L2) ecosystem has been expanding, with a recent surge in the number of transactions per second (TPS).\n\nNotably, within the L2 space, Base has emerged with particularly impressive performance metrics.\n\nEthereum L2 registers more scale\n\nBased on information from L2 Beat, Ethereum scaling experienced a notable increase at the beginning of April, reaching a new peak on the 2nd of April.\n\nAMBCrypto’s look at the Layer 2 data indicated a surge in the transaction count, surpassing 156 transactions and marking a record high.\n\nThe scaling metric rose to approximately 11.2, indicating it handled more transactions than the Ethereum mainchain.\n\nAs of press time, the transactions per second (TPS) had slightly decreased to around 147, but the scaling trend has remained upward. Presently, the scaling figure stands at about 11.3.\n\nBase dominates Ethereum L2 space\n\nBased on data from IntoTheBlock, Base has established itself as a prominent Ethereum Layer 2 (L2) solution, which is evident from recent statistics.\n\nIt boasted approximately 890,000 active addresses, indicating the highest number of active addresses among L2 platforms.\n\nAdditionally, its transaction volume surpassed $1.6 billion, three times greater than its nearest competitor, Optimism [OP]. On the 2nd of April, the network processed 2.6 million transactions.\n\nHowever, when considering Total Value Locked (TVL) and Transactions Per Second (TPS), data from L2 Beat revealed that Base lagged behind other L2 networks.\n\nEthereum fees remain low\n\nDespite the increased activity witnessed on its Layer 2 (L2) solution, Ethereum’s fees have remained relatively low. As of the time of writing, the total fee was over $13.4 million.\n\nAMBCrypto’s analysis of the fee trend indicated an overall decline over the past few weeks.\n\nThis decline commenced around the 13th of March, coinciding with a significant network upgrade and contributing to lower gas prices on L2 networks.\n\nETH was trading at around $3,301 at the time of writing, experiencing a less than 1% decrease.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nThe daily timeframe chart analysis revealed that the king of altcoins was among the few assets that closed the previous trading session with a profit.\n\nThe altcoin concluded trading on the 3rd of April with a price increase of over 1%."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxOcnZBblVZU3g1ODdpN29yd012TGlGYTlMZmVxLWlVVFFvQk5TTWtpYlFSd1FUX014bW9WOTJPVFBIWmEwMEI5N2UtTl9tOU9GbW4yZzFNZUthRlBhRzhHM3Fsdmltc0RCR3Ewbm5wUVpoNVktNmZ1d1g2TDNTNV9MR09URk1fSWFMNmQ4Y3ctaFRKb01UU1lnaHlPdXLSAaIBQVVfeXFMT0ppUTlUUWI3dlhrRk53Q2YzUGRRci1RdGJKTmVTVGktRmtacHZvYVh2TjN6RDFYYVgwVXRrUmQ2SlpNbWx6dm4wLXdVQjFtUmVLai1zRm1rRFlwdUdYSk1IdTNiOUxKY2pVNTNlUzV2aVpUbVpJR2MyX3BGWk1ubEdEVUJZdWMwUFQ0ekN6NE5LeGpmbDFoRTA0VUI0STFsSVpR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Apr 2024 07:00:00 GMT",
        "title": "Ethereum’s new ATH, BlockDAG’s 20,000x projections outshine WAX’s AWS alliance - AMBCrypto News",
        "content": "Ethereum has continued to break new ground, reaching unprecedented heights and securing its spot as a cornerstone in cryptocurrency. Meanwhile, a new contender is making waves: BlockDAG, with its audacious promise of a 20,000x return on investment, is turning heads and setting the stage for a potential market shake-up. This remarkable projection is particularly striking against the backdrop of WAX’s strategic collaboration with Amazon Web Services, showing the diverse and dynamic nature of the crypto investment scene.\n\nAs Ethereum reinforces its legacy, BlockDAG’s bold ambitions are catching the fancy of investors, offering a tantalizing glimpse into the future of cryptocurrency growth and profitability.\n\nEthereum Hits ATH in Addresses: What’s Next for ETH Price?\n\nEthereum (ETH) is showing signs of a strong recovery, bouncing back from its March lows of $3,000 to trade at $3,615. The surge in the number of Ethereum addresses with non-zero balances to an all-time high of 118.23K indicates heightened investor activity.\n\nWith whale transactions on the rise and the ETH price maintaining support above $3,550, there is potential for further upward momentum.\n\nWAX’s Web 3 Partnership with AWS\n\nWAX has joined forces with Amazon Web Services (AWS) to integrate its blockchain tools into the Amazon Managed Blockchain (AMB), streamlining the development of blockchain-based games and applications. This collaboration allows developers to deploy WAX blockchain nodes directly from the AWS console, simplifying the development process for both the WAX mainnet and testnet.\n\nBy providing fast and reliable blockchain infrastructure, including WAX Blockchain nodes for real-time interactions and data queries, this partnership aims to facilitate the creation of Web3 gaming experiences.\n\nBlockDAG’s Presale Bull Run Positions it Among Top Crypto Investments\n\nBlockDAG Network stands out for its exceptional transaction speed, achieving 10,000 to 15,000 transaction confirmations per second (TPS), surpassing traditional blockchains like Bitcoin and Ethereum. In addition to its speed advantage, BlockDAG’s Explorer platform offers a comprehensive search tool for real-time network data, allowing users to track transaction histories, inspect public wallet addresses, review smart contracts, and view network nodes, ensuring transparency within the BlockDAG ecosystem.\n\nBlockDAG’s presale has sold over 6.4 billion coins, raising approximately $12.7 million. Currently in its sixth presale batch, BDAG coins are priced at $0.0035 each, with a listing price set at $0.05. This translates to a remarkable ROI potential at launch. Analysts are bullish about BlockDAG’s future, projecting a staggering 20,000x growth by 2025 following the mainnet launch.\n\nThe Last Call\n\nEthereum’s resurgence and WAX’s partnership with AWS mark pivotal moments in the crypto world, but BlockDAG steals the spotlight with its unmatched transaction speed and impressive presale achievements. As industry analysts predict a jaw-dropping 20,000x growth for BlockDAG by 2025, this emerging powerhouse is quickly becoming the focal point for savvy investors.\n\nIts promise of rapid expansion and innovation positions BlockDAG not just as another player in the crypto market, but as a potential leader, offering a unique and potentially lucrative investment avenue that stands out amidst the buzz of other significant crypto developments.\n\nJoin the BlockDAG Presale now, as it is set to create a major shift that will reshape cryptocurrency.\n\nInvest In BlockDAG\n\nWebsite: https://blockdag.network\n\nPresale: https://purchase.blockdag.network\n\nTelegram: https://t.me/blockDAGnetworkOfficial\n\nDiscord: https://discord.gg/Q7BxghMVyu\n\nDisclaimer: This is a paid post and should not be treated as news/advice."
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMiZkFVX3lxTE05Ty1tUkoyanpwclQzUUZsMVhqcm1tSHk0bzA2VWpOY1dkeXVjWm1rbEhsR0I1eWxhLWdLeHNHcXdkY3pNamNLdFRJeEFVN2Jua3k0Y2RYR3Z0X3pKQU4yVHp0eWpBUdIBa0FVX3lxTE5fbmwtNUNkcWVXaHdpMHJCYmxMQ3R4N21pekFZS3duLURWYThCRWtkblBnYXRBLVF4ODRsMFZ6MzFFcVB3MERJckRvZ1pITUhuZTRiT3RtdG1mMHR4QzRnZDhLQUwzSDJnZ204?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Apr 2024 18:02:56 GMT",
        "title": "Here’s How One Crypto Trader Turned $100 To $8.3 Million On An Ethereum L2 Network | Bitcoinist.com - Bitcoinist",
        "content": "The crypto space is filled with stories of individuals who have become millionaires and billionaires by trading crypto tokens. This time, another individual has been revealed to have made $8.3 million in just six days.\n\nHow This Trader Made $8.3 Million\n\nOn-chain analytics platform Lookonchain revealed in an X (formerly Twitter) post that pseudonymous crypto trader Larp von Trier turned 0.1 ETH ($353) into $8.3 million on layer-2 network Base. He is said to have made a 23,770x profit by investing in $KEYCAT, a meme coin on Base, while it was still trading at a market cap of $2,200.\n\nVon Trier used the $353 to buy $1.3 billion worth of $KEYCAT tokens (13.16% of the token’s total supply) and then sold 344.7 million $KEYCAT for 497 ETH ($1.75 million) through two of his wallets. The trader still holds 971.2 million $KEYCAT (9.71% of the token’s total supply) in six other wallets. These tokens are said to be currently worth about $6.64 million.\n\nThis trade looks to have been a breakthrough moment for Von Trier as Lookonchain further revealed that the pseudonymous crypto trader hadn’t had much luck investing in meme coins before now. Before buying $KEYCAT, Von Trier had purchased two other Base meme coins, $NORMIE and $NORMILIO, losing $820 and $9,700 from both trades.\n\nRevelations about Von Trier’s profitable trade have drawn mixed feelings from members of the crypto community. Some allege that it must be some sort of insider trading, while others complimented his trading skills, considering what it takes to have invested such an amount in a meme coin with such a market cap.\n\nJust Another Day In Crypto\n\nBitcoinist also recently reported about a meme coin trader who turned $1,800 into $11 million by investing in Dogwifhat (WIF) while it was still trading below $0.2. Unlike Von Trier, this trader tried to paperhand his holdings but could not offload his WIF tokens, leading him to opt against selling and instead holding.\n\nMeme coins continue to provide a means for crypto traders to make such an enormous amount of money within a short time. This is mainly because meme coins are more volatile than the traditional crypto tokens in the market and could quickly go from one to a hundred within the twinkle of an eye.\n\nAt the moment, Solana and Base look to be the two primary chains where meme coin trading is at its peak. Base, in particular, has seen a jump in its transaction volume due to this meme coin frenzy.\n\nETH price above $3,300 | Source: ETHUSD on Tradingview.com\n\nFeatured image from Coinpedia, chart from Tradingview.com"
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQMGlPWXIyMHRUNFVuNXY0VzRvY1NIM01ZY2NSdkN6OXkzV0VaU3NCb201YmJycURObmZFbzlrdDRhME92bERDRnVvRlJ6d1gtYm92aGZ2NG1POWRZVUpIWW9JdVFQMzN4MHpkTDVDejM2UGR2Z1N3eGFBMnNUZUdDQ01kNzNSNUV2RHfSAY8BQVVfeXFMTUJNNnZEQ01YWm85UnluZ0VRR2ptRTVQcGppZEh2d041eENXa2Q1cjhIN2NoMXRyZG9hd3Q1ZjRpZTZYVDVhcmg2UE53OFllTjg0cEpQdkJuTXkzLVVYUGNsRzNNaEoxOEVleDlBZUVvTzVBLUV6LVFxSzM4NE1MeTM1UGxXWkNlYkFVZUQ1SE0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Apr 2024 07:00:00 GMT",
        "title": "VanEck’s Ethereum Layer-2 Prediction: $1 Trillion by 2030 - Coinpedia Fintech News",
        "content": "Qadir Ak is the founder of Coinpedia. He has over a decade of experience writing about technology and has been covering the blockchain and cryptocurrency space since 2010. He has also interviewed a few prominent experts within the cryptocurrency space.\n\nVanEck, the global investment manager, has recently released its $1 trillion base case for Ethereum’s Layer-2 (L2) solutions by 2030. The L2 solutions are expected to surpass the main blockchain in revenue generation for addressing scalability issues.\n\nTechnologies like ZKUs (zero-knowledge roll-ups) and ORUs (optimistic roll-ups) are to process transactions off the main blockchain. This would enable L2s to outperform Ethereum’s main blockchain.\n\nSource: VanEck\n\nRole of Airdrop in Ethereum L2 Solutions Success\n\nDespite the optimism about L2s, VanEck has cautioned about most L2 tokens, stating that they are not the primary currency within the cryptocurrency ecosystem. Some notable L2 solutions that are recognized for their success due to successful ecosystems and strategic airdrops are Arbritrum, Blast, and Optimism.\n\nAccording to DefiLlama data, Arbitrum ranks fifth in total value locked ($3.17 billion), Blast sixth ($1.3 billion), and Optimism eleventh ($952.69 million).\n\nThe criteria for evaluating the success of L2 are costs of the transaction, user experience, assumptions of trust, the size of the ecosystem, and of course, the developer experience.\n\nEthereum co-founder Vitalik Buterin also revisits the layer-3 (L3) solutions concept. He emphasized the importance of different layers serving distinct purposes for effective layering.\n\nAlso Check Out The : GBTC Outflows Drop to $75 Million, Ahead of Bitcoin Halving\n\nHow will Ethereum L2 Solve Scalibility?\n\nThe VanEck report highlights the EIP-4844 upgrade, which would “Blob Space” to reduce data posting costs significantly, thereby benefiting L2 operations financially.\n\nVarious revenue models of L2 solutions are explored as well. It has been identified that transaction sequencing would be the primary source of income along with on-chain and off-chain cost structures.\n\nTotal Value Locked (TVL) within Ethereum Ecosystem\n\nBy 2030, a significant transaction value portion and TVL of L2s are expected to be captured. This would be partly driven by Maximal Extractable Value or MEV’s potential in augmenting revenues.\n\nVanEck foresees a much broader application of blockchain technology that will be beyond finance. It will include gaming, social media, and infrastructure, denoting a future with L2s becoming the central components of the global blockchain ecosystem."
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxQOW1BTnhqRXlYOXBOa3U1d256ZVgzNmdvYlpsdEw4MGFmVDZnb0FMczVxbVZPdUpwZ004NUlIUWNFT1lBdGticl9yRWt6cTRQano0SVVnOWZTZXVubllUMFl0cmF0NHdBRVB3Z2p3NEtlMzRob0dTVVJUczRxTWJ5ZVhHNNIBiAFBVV95cUxQazQtWU5QV1JhWnJQZEZDZWxRT2pvWXppaXJVZGxfb1ViaWw0NXg4Y2ZFd3ROUUU0X2s0RTB0bzI5aUxlcDgwS21DWHJMMlNvWS1IZUdULWVLQzJsRF9oMjRlUlI5emdkXzRWRzVzamJsUXVKekZnbGRLX3ZGVDRKcm0xTWJHV2xY?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Apr 2024 07:00:00 GMT",
        "title": "Lido’s Ethereum Staking Market Share Plunges Below 30% - CoinChapter",
        "content": "Lido’s Ethereum Staking Market Share Plunges\n\nLUCKNOW (CoinChapter.com) — Lido, the leading Ethereum liquid staking solution, has seen its market share in ETH staking drop below 30% amid increasing competition. According to data from Dune Analytics, Lido’s Ethereum staking market share fell to 29.57% as of April 4, 2024, down from 32% in December 2023. This decline alleviates concerns about Lido’s growing influence on the Ethereum ecosystem.\n\nSource: Dune Analytics\n\nCertainly, while Lido remains a prominent player, other entities are gaining ground in the Ethereum staking arena. Crypto exchanges Coinbase and Binance hold 14.04% and 3.75% of the staked ETH market share, respectively. Additionally, the Ethereum staking platform Kiln accounts for 3.5% of the market.\n\nSource: Dune Analytics\n\nNotably, the second-largest entity in ETH staking remains unidentified, representing 16.9% of the market. In total, 26 known entities contribute to Ethereum staking, including exchanges like Kraken (2.4%), Bitcoin Suisse (1.6%), OKX (1.2%), and Upbit (1.1%).\n\nLido’s Ethereum Staking: Decentralization Concerns and Solutions\n\nNotably, Lido’s previous dominance in Ethereum staking raised concerns within the Ethereum community, as any entity controlling over 33% of the market could potentially influence various aspects of the Ethereum chain. To address this issue, Ethereum co-founder Vitalik Buterin suggested that stake pools should not exceed 15% control and should adjust their fee rates to remain below this threshold.\n\nIn May 2022, the Lido DAO community proposed a hard limit to solve the ETH staking dominance problem. However, the proposal was rejected with a 99.81% vote in June 2022.\n\nThe Lido DAO community voted against self-limiting. Source: snapshot.org\n\nEther fi and Renzo Protocol Steal the Spotlight\n\nInterestingly, the flow of Ethereum stakers is moving towards platforms that offer liquid restaking options. Among these platforms, Ether fi and Renzo Protocol have seen a significant influx of stakers. Ether fi has received over 400,000 staked Ether, while Renzo Protocol has received over 280,100 staked Ether.\n\nSource: Dune Analytics\n\nEther fi boasts a total value locked (TVL) of $3.1 billion, while investments in Renzo Protocol have exceeded $2.1 billion. In total, users have locked over $8 billion across these protocols.\n\nThe shift of Ethereum staking from Lido to platforms like Ether fi and Renzo highlights the increasing popularity of Eigenlayer’s solutions. These liquid restaking protocols utilize the Eigenlayer framework. This allows Ethereum stakers to participate in other networks and solutions while staking their ETH.\n\nMoreover, the adoption of flexible staking solutions gained momentum after Ethereum’s transition to a proof-of-stake consensus mechanism in September 2022. Certainly, Eigenlayer’s approach, facilitating the staking of ETH across multiple platforms, has resonated with the Ethereum community. It has driven the growth of liquid restaking protocols like Ether fi and Renzo.\n\nRisks and Opportunities in Ethereum Restaking\n\nIn addition, as competition in the ETH staking market intensifies, the issuance of liquid restaking tokens (LRTs) has emerged as a potential risk. According to a recent Coinbase report, restaking protocols like Eigenlayer could compound risks by allocating the same funds to similar validators for increased yield.\n\nThe report warns that restaking can increase earnings. However, LRTs may be incentivized to maximize yields at the cost of a higher, albeit hidden, risk profile."
    }
]