[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMi3gFBVV95cUxQSzhTRjFEQ1dFM3Y1UmpyR0ZOWHdFbXpxTnBxU3BhMHJseW5ZS1VRLThyQ0R4MlNmSlhua2hNQ2dXc203eTdLSlZHMkxvUm15QTM3d2VmcnRLVFZBWi11ZU95T005UktNS3lublV6R20tTFNvVmg1TnJxNFIwdFRJS21uQlFhQjRZeXBJeE1rb285SzhuNHNucV9uTlVNR3dfcmY3alR3eTlyS1FFclFnNzVCT0FueDVZa3ZqOHJDSjVOUjJGYzI0SWk0TEJmQmlCcmNGeWhwNERPYndiQXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Products Face $61M Outflows, While Solana Sees $1.6M Inflows Amid Broader Crypto Market Decline - CryptoGlobe",
        "content": "Cryptocurrency investment products as a whole saw outflows of $30 million over the past week, with Ethereum-focused products seeing their largest outflows in nearly two years over the same period after investors moved $61 million off of these products.\n\nThat’s according to CoinShares’ Digital Asset Fund Flows weekly report, which details cryptocurrency investment products saw their third consecutive weekly outflows over the past week, with most product providers seeing minor inflows that were offset by larger outflows from Grayscale.\n\nTrading volumes, the firm’s report adds, rose 43% week-on-week to $6.2 billion, while remaining below the $14.2 billion weekly average seen so far this year. While Bitcoin investment products saw $10 million in weekly inflows, Ethereum-focused products saw massive outflows of $60.7 million.\n\nMeanwhile, Ethereum rival Solana saw $1.6 million in inflows, while Litecoin saw $1.4 million and XRP $300,000, below Chainlink’s $600,000 inflows. Products offering exposure to multiple digital assets saw $17.9 million in inflows.\n\nAs report, crypto trading firm GSR has taken a long position on the smart contract platform Solana citing its “superior technology,” and suggesting its “likely just a matter of time” before Solana gets a spot exchange-traded fund (ETF) trading in the United States.\n\nIn a recently published note GSR highlighted Solana’s features including its Proof-of-History mechanism and its “ultra-cheap transaction costs” and “wide array of decentralized applications,” as well as its “bustling user and developer communities.” It touted the release of innovations like token extensions over its technology which the firm said “provides a sustainable competitive advantage.”\n\nThe firm acknowledged that Solana’s focus on speed and security may come at the expense of some decentralization, but added it believes this trade-off will become less significant as hardware costs decline.\n\nGSR’s bullishness on Solana coincides with a political twist. The firm suggests that former President Trump’s recent support for the cryptocurrency industry, coupled with a potential softening stance from Democrats in a tight election year, could pave the way for a more favorable regulatory environment. This, in turn, could accelerate the approval of spot ETFs for cryptocurrencies beyond Bitcoin.\n\nCoinShares’ report also details that blockchain-related equities suffered outflows of $545 million this year, a figure that represents 19% of assets under management.\n\nFeatured image via Pixabay."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxQWTFUZ05jbk83UGZjeWJ0VkFuX0N1TzRkSFhLdXZaVnhndkNtNlNmQUxZeDM3UVVSRmRTRGZGaklfdmZUUTc3U1ZNZmNWdFhWUTJ1UnNWZEVqOWljaWVkY3VGU09NLU1Tb3owVGE5ZFF5cURkLWxlVnZTcTR0VkMxajJubXR5dGZTQ2pLcUdaS0FhSnFBc3ZUMWFQLXhmSE9FQUNNOTljZFdlVVFtNnhLakdtSdIBuAFBVV95cUxNWktHSzVkSGh3Vmh5S3hyZDlIWExPMVhXYjBVWG4wTDc2N3lkeTBOVUoxb05HRWNvZ0U4SVRKcG1MUC1VM2JaZTc1LVk1bG12ci0xVkJJd3QzaGNzdDNHS05iNUltUTdLY2V4bWZDem5WZkd2TG5ybzA0dzFvUTVaM3IwTUhBM1NKVzBTVklPUm1BUmQtQm5ZYUU3b2lDQmozb1hsRmo2ZXQ5LXliZnphc054ZUE5dms5?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jul 2024 07:00:00 GMT",
        "title": "Post-ETF Approval: What the Marketing Ethereum Community Needs Now - Finance Magnates",
        "content": "May marked a historic month for the crypto market after the SEC finally greenlit Ethereum exchange-traded funds (ETFs). After years of relentless pushback and tireless advocacy from pro-crypto activists, this approval presented a golden opportunity to market Ethereum in ways that have not been previously anticipated.\n\nThe timing of this approval couldn’t be better. It comes at a moment when global financial markets are increasingly open to on-chain investments, such as the $11.7 billion capital inflow to Bitcoin ETFs since January 2024. This article explores how the Ethereum community can leverage these new circumstances to position ETH as a leading global investment vehicle.\n\nETH Enters the Commodity Market\n\nWith the SEC’s approval of Ethereum ETFs, ETH is now effectively recognized as a commodity. This institutional endorsement has launched Ethereum Ethereum Ethereum is an open source, blockchain-based distributed computing platform and operating system featuring smart contract functionality. Created in 2014, Ethereum now stands as the second largest cryptocurrency by market cap at the time of writing.As a decentralized cryptocurrency network and software platform, Ethereum represents the most prominent altcoin. Ethereum also enables the creation Distributed Applications, or dapps. Understanding EthereumEthereum boasts its own programming language, Ethereum is an open source, blockchain-based distributed computing platform and operating system featuring smart contract functionality. Created in 2014, Ethereum now stands as the second largest cryptocurrency by market cap at the time of writing.As a decentralized cryptocurrency network and software platform, Ethereum represents the most prominent altcoin. Ethereum also enables the creation Distributed Applications, or dapps. Understanding EthereumEthereum boasts its own programming language, Read this Term into a new level of financial credibility previously reserved for assets like gold and oil. Investment giants like BlackRock and VanEck, which have already established sizable positions in Bitcoin ETFs, are now setting their sights on ETH.\n\nThis week, this day, has been a rollercoaster unlike any other I’ve seen. ETH is effectively deemed a Commodity as we’ve always known it to be. I’m proud to be on team @Coinbase, the trusted partner and custodian for many of the issuers who had 19b-4’s approved tonight. pic.twitter.com/nz1HHFbBSQ — paulgrewal.eth (@iampaulgrewal) May 23, 2024\n\nFresh coverage of these new narratives by mainstream media is primed to catapult Ethereum out of its crypto-native niche. Already, ETH is becoming a mainstay in major business news outlets, even as political leaders like Donald Trump have utilized the Ethereum network to launch projects.\n\nGone are the days when Ethereum market sentiment was determined solely by the attention span of crypto communities. We now face a future where Ethereum will be the subject of wider discussion as more attention settles on ETH as the most exciting crypto commodity.\n\nInvesting in the \"World Computer\"\n\nThe massive capital influx into Bitcoin following the BTC ETF approval on January 11, 2024, set a precedent that Ethereum is certain to follow. While Bitcoin is often seen as digital gold, Ethereum offers something uniquely compelling—it powers a decentralized “World Computer.”\n\nBitcoin, by design, is primarily a digital currency meant for value exchange. Ethereum, on the other hand, introduced a new era of decentralized and secure networks powered by ETH, the world’s first programmable crypto.\n\nSince its inception, Ethereum’s smart contracts have advanced computing technology's capabilities, enabling applications in sectors ranging from encryption and trading to data verification and digital wallets. As I often tell people, \"If fiat was a horse, Bitcoin is a train, and Ethereum is an airplane.\"\n\nIn marketing ETH, the Ethereum community should bring these superior traits to the forefront by emphasizing that it is the real key to unlocking real-world applications of crypto technology.\n\nHunter + Dog S1 are timeless. https://t.co/tJ82Ly5dtW — CollectTrumpCards (@CollectTrump) May 31, 2024\n\nEthereum Is Reshaping Global Industries\n\nEthereum’s smart contracts are actively reshaping both traditional and digital industries. In finance, Ethereum has pioneered the decentralized finance (DeFi) sector, which now boasts a market cap of $104.55 billion. We could also discuss how the millennia-old real estate market is being disrupted by the concept of tokenization Tokenization Tokenization represents the process of substituting a sensitive data element with a non-sensitive equivalent, i.e. token, which bears no extrinsic or exploitable meaning or value. In essence, the rights to the ownership of an asset are converted into a digital token. Tokenization can be used to own an entire unit of an asset. For example, one token that represents the ownership of a piece of real estate or to split ownership of a single unity of an asset such as 200,000 tokens, each one represen Tokenization represents the process of substituting a sensitive data element with a non-sensitive equivalent, i.e. token, which bears no extrinsic or exploitable meaning or value. In essence, the rights to the ownership of an asset are converted into a digital token. Tokenization can be used to own an entire unit of an asset. For example, one token that represents the ownership of a piece of real estate or to split ownership of a single unity of an asset such as 200,000 tokens, each one represen Read this Term, which has made housing markets more accessible and secure.\n\nReal-world assets (RWAs) are powered by the smart contract technology pioneered on Ethereum, rewriting the rules on the ownership and trade of landed properties while blurring the lines between virtual and physical items.\n\nEmerging technologies like decentralized physical infrastructure (DePIN) are merging physical and network infrastructures, unlocking new uses for a growing list of applications, including data networks and digital geographical mapping. Additionally, smart contracts are pushing the boundaries of artificial intelligence by enabling decentralized AI computing.\n\nIt’s clear that the diverse applications of smart contracts highlight ETH’s utility, making it a highly sought-after crypto commodity over Bitcoin and even conventional commodities with limited use cases.\n\nScaling Hurdles with Ethereum\n\nL2 networks, one of Ethereum’s biggest criticisms has been its scalability issues. The processing speed and usage costs of the Layer 1 Ethereum network have resulted in challenges to its widespread adoption despite the versatility of smart contract technology. However, the emergence of Ethereum Layer 2 (L2) networks, such as Arbitrum, Base, and zkSync, has mitigated these issues.\n\nThese L2 networks, all powered by the native ETH token, enhance Ethereum’s scalability and efficiency, enabling the type of growth discussed earlier. They operate on top of the Ethereum blockchain, enhancing its efficiency by handling transactions off the main chain before settling them on the main network layer.\n\nThis reduces congestion and lowers costs without compromising on security or decentralization, making Ethereum more accessible and user-friendly.\n\nEther ETF Approved: Why Investing in Ether is Much More Sensible than Bitcoin in 5 Points\n\n\n\nA thread 🧵\n\n\n\n1. Ether is Much Scarcer and Even Deflationary Compared to Bitcoin 📈\n\n\n\nUnlike Bitcoin, transaction fees on the Ethereum blockchain do not go directly to miners (validators,… pic.twitter.com/1xDgWp8KD0 — tobbykitty.eth 🦇🔊 (@TobbyKitty) May 24, 2024\n\nThis adaptability ensures that Ethereum remains relevant as new technologies emerge. Perhaps this is Ethereum's strongest selling point in the post-ETF era: ETH’s ability to efficiently scale while retaining Bitcoin's core crypto values, along with its unique added benefits, makes it a formidable contender in the crypto commodity space.\n\nIf the ETF approval was a validation of ETH’s maturity as an asset class, then it is time to remind the world why Ethereum has made it this far."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTE1OdHU3U1o3eWRPSERjRk5DTk93UHBlejJtekxPa3Y2T2V2LUdGanV0WDNiR3h5VUlXVmt2Sk52RGdUQmYtMDAteUlZZTdDX0gxMFNaanVZNWZEYjNER3U2NlBHTFJaN3E3eHNLWDZoT3VjVGM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Is Poised For Major Breakout, Analyst Predicts 180% Surge - TronWeekly",
        "content": "Ethere­um, the second-largest cryptocurre­ncy by market capitalization, is poised for a major breakout, with its price­ increasing by approximately 180% soon. Crypto analyst Javon Marks has highlighted this bullish tre­nd, suggesting that Ethere­um is on the­ cusp of an even more substantial bre­akout.\n\n“$ETH (Ethereum) may only be preparing here for the overtaking and surpassing of $4,723.5 which could then open $8,000+!” said Marks.\n\nMarks’s prediction indicate­s a potentially massive surge in Ethereum’s value, projecting it could more­ than double its current price. Marks’ twe­et emphasized the­ critical $4,723.5 level as a pivotal point for Ethere­um’s continued growth.\n\nSource: Javon Marks\n\nThe chart shows Ethere­um’s steady upward trajectory, refle­cting the 180% increase since­ its previous lows. This rally is marked by periods of consolidation and minor pullbacks, which, according to Marks, are­ essential for a healthie­r and more sustainable bull run. These­ pullbacks help to stabilize the price­ and prevent overe­xtension, setting the stage­ for a robust ascent towards higher targets.\n\nMarks’ analysis sugge­sts that surpassing the $4,723.5 mark could trigger a new wave­ of investor interest and marke­t activity. Ethereum’s potential to re­ach $8,000 or beyond is based on its strong technical foundation and the­ current bullish sentiment surrounding the­ cryptocurrency market.\n\nEthereum’s ETF Launch Hope\n\nDespite­ a recent rally, Ethereum’s price is struggling to get back to its all-time high. The­ rush past $3,395 came from spot ETH ETFs approval, still, lacked power afte­r a small dip mistaken for rollback at the beginning of the­ month. Market worries and stronger pe­ssimistic trends intensified the­ pullback.\n\nThe upcoming launch of ETFs may change the game­ and give the same be­nefits of the price of Bitcoin in case­ of its spot ETF’s launch. By indicating greater investor appe­tite through the ETFs, the price­ could return to the north and cross the $3,829 barrie­r, an important target.\n\nThis figure is also the 61.8% Fibonacci Re­tracement leve­l which would pave the way for another le­g up following previous resistance now turne­d to support. It may be that the target is far too high for ETH, but the­ demand is still in place for $4,000 in ETH. Howeve­r, a firm move above this leve­l is more likely to inspire furthe­r bullish sentiments.\n\nHoweve­r, a failure to go through the $4,000 barrier could provoke­ an adjustment below this leve­l. at least 3,700-3,800 the price could go flat. On the­ downside a break under this zone­ would make historians of the bull market.\n\nRelated Reading | Nigeria’s Cryptocurrency Market Surpasses $400 Million, SEC Director General"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTE1KSkpQWVdKQUxONkw0Uk1wajNSZldjcktGUlZjcW5rS3VhUlZoaUUyaDFjdG5VTnZKVXJWMkZEVzRrYW1xXzYtS3o5eV9Od29EWUctSVhucHB6c00wQXYwQVJJNWZhbHNhREo3akJIaEphM2fSAXhBVV95cUxPM3JFZ21PV2dVTW5SMkVCNGFIU0psVXFjYnc5NEdNVXZKS244UzV6WmN4dnR0dk9UeEZrSFRURk1IZVhBNjcwbW83MW40YlhnZkduQVRpY0RHT0xXam5KVV9taUlzbnF1dDlNTmR5d2V1Qy1pUEhlbVA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Jun 2024 07:00:00 GMT",
        "title": "Solana Just Dethroned Ethereum in This Key Metric - U.Today",
        "content": "According to data provided by DefiLlama, Solana has managed to destroy Ethereum in daily DEX trading volume ($1.148 billion and $745 million, respectively).\n\nAdvertisement\n\nSolana-based Raydium, Meteora, Orca, Phoenix and Lifinity are among the top 10 DEXes by daily trading volume. Uniswap and PancakeSwap, of course, remain in the lead.\n\nAs noted by Patrick Scott, the founder of Dynamo DeFi, Solana's DEX volume dominance is also on the rise . In fact, it is on track to surpass the 25% level for the first time this June.\n\nAdvertisement\n\nOverall, DEX volume has hit $26 billion over the past seven days, according to data provided by Dune Analytics .\n\nEarlier this year, trading on Solana-based DEXex spiked due to the growing popularity of meme coins.\n\nSOL summer?\n\nThis comes as the \"Ethereum killer\" is benefiting from increasing ETF buzz. As reported by U.Today , New York-based investment firm VanEck filed to launch an ETF for Solana on Thursday; 21Shares followed suit with its own filing for the red-hot altcoin on Friday.\n\nHowever, those who expect this ETF to see the light in the near future should cool their jets. According to leading analysts in the field, the product is now expected to be approved this year.\n\nAfter initially seeing a sharp price spike due to the ETF hype, the SOL price is currently in the red, slipping by 0.2% over the past two weeks.\n\nThe popular altcoin is currently valued at $65.2 billion, according to data provided by CoinGecko. This puts it in the fifth place by market capitalization (behind only Bitcoin, Ethereum, Tether and BNB)."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPM3E5VG1TR0Itc2ZpbV96aEYxNU1GM29zd1Y3Y3RhQndrcFJFbjhxaXRqREZYVFFscTI2ZzlCbE1aUDM2LXRSSzBKOWJrSGxFM2dXdUloeVlINFMzemZiUk1RVFFNT3hrV3kzU2RLSFpvMV9qcG1aLTRIWGkyd0JQRlp6M1pHdDR3dDBz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jul 2024 07:00:00 GMT",
        "title": "SEC Sues Ethereum Developer Consensys Over Alleged Unregistered Broker Activities - Yahoo Finance",
        "content": "SEC Sues Ethereum Developer Consensys Over Alleged Unregistered Broker Activities\n\nThe United States Securities and Exchange Commission (SEC) has filed a lawsuit against Ethereum software firm Consensys. The SEC's filing claims that since January 2023, Consensys has engaged in the unregistered offer and sale of securities via its crypto asset staking programs and acted as an unregistered broker through its MetaMask Staking service, allegedly collecting over $250 million in fees.\n\nIn April, Consensys preemptively sued the SEC after receiving notice of the agency's intention to sue over MetaMask’s staking programs. The firm claimed that the SEC had secretly considered Ethereum to be a security for over a year and was quietly assembling a broader case against the crypto asset. Earlier this month, Consensys announced that it had been informed by the SEC that the regulator was closing its case against Ethereum, a development that was celebrated within the crypto industry.\n\nIn the SEC's lawsuit, the agency highlights Consensys's facilitation of ETH staking via third-party services like Lido and Rocket Pool through MetaMask. The SEC argues that these staking programs are offered and sold as investment contracts, and therefore, should be classified as securities.\n\nThis lawsuit emerges during a turbulent period for the SEC and crypto regulation. Earlier on Friday, the U.S. Supreme Court's conservative majority struck down the \"Chevron doctrine,\" a critical piece of American law that had allowed federal agencies, including the SEC, considerable latitude to interpret their regulatory powers. Consensys appeared to reference this Supreme Court decision, forcefully asserting that the SEC lacks the authority to regulate crypto products like MetaMask."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxQcWRiTzJMNExQZVUyZHBCM2RSQ2VzWkRCOU03MkJiLXdtUkVOVmlqYm1SVk8wTC1meExtUF9lRnNmdHFxTjB2a1JDUDVDSURXTThodml4NkY5UUV5UFY3eVk5dGRuRXQyU1pRWTlQbnNSQzlRY2NLbjRTbHNXWUJrb1hxWlBBdEtnemhkdVBxbUExLWlaTG1lY3dPbWRFb0xYZTFF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jul 2024 07:00:00 GMT",
        "title": "Vitalik Buterin suggests ways to speed up Ethereum transaction confirmations - CryptoSlate",
        "content": "Ethereum co-founder Vitalik Buterin has suggested ways to help the blockchain improve its transaction confirmation times.\n\nButerin, in a June 30 blog post, explained that Ethereum’s Gasper consensus mechanism uses a slot-and-epoch architecture that contains certain complexities, like bug interactions and a 12.8-minute confirmation time, that makes it “more and more uncomfortable” for user experiences.\n\nSo, he highlighted some of the “practical options” Ethereum has to improve its user experience further.\n\nSSF\n\nButerin stated that the single-slot finality (SSF) mechanism is similar to the Tendermint consensus, as it allows the finalization of blocks as soon as they are produced.\n\nHowever, unlike the Tendermint consensus, Ethereum will keep the “inactivity leak” mechanism to allow chains to remain functional even if a third of the validators go offline. Buterin added that the single-slot finality mechanism also has its faults. Notably, all Ethereum stakers must publish two messages every 12 seconds, overloading the chain.\n\nMeanwhile, Buterin furthered that while there are ideas to mitigate this issue, users may still have to wait 5-20 seconds. He wrote:\n\n“There are clever ideas for how to mitigate this, including the very recent Orbit SSF proposal. But even still, while this improves UX significantly by making ‘finality’ come faster, it doesn’t change the fact that users need to wait 5-20 seconds.”\n\nRollup preconfirmations\n\nRollup preconfirmations aim to improve Ethereum’s Layer 2 (L2) solutions. These solutions process transactions with the same security as the Ethereum base layer (L1) but on a larger scale.\n\nRollups confirm transactions much faster than the current 5-20 seconds, targeting latencies of hundreds of milliseconds. This method divides responsibilities — the L1 network remains stable, censorship-resistant, and reliable, while the L2s offer faster transaction times and address user needs directly.\n\nTo achieve faster confirmations, L2s create decentralized sequencing networks. These networks have smaller groups of validators who quickly sign off on blocks, often within milliseconds, and commit them to the blockchain.\n\nHowever, validators must ensure their commitments are consistent and trustworthy. If a validator signs conflicting blocks, they risk losing their deposits.\n\nBased preconfirmations\n\nBased preconfirmations leverage Ethereum proposers’ advanced capabilities, driven by Maximum Extractable Value (MEV) prospects.\n\nThe concept involves establishing a standardized protocol where users can pay an extra fee for immediate assurance that their transaction will be included in the upcoming block. This service, known as preconfirmations-as-a-service, would assure users of swift transaction confirmation.\n\nProposers who fail to fulfill their commitment or breach the agreement face penalties (slashing). Buterin noted that this framework will apply to L1 transactions and extend to L2 solutions. By treating all L2 blocks as L1 transactions, the preconfirmation mechanism ensures accelerated confirmations throughout the Ethereum network.\n\nButerin noted that Ethereum implementing SSF and rollup or based preconfirmations could significantly reduce transaction confirmation times.\n\nHowever, he pointed out that this would return to the initial “epoch-and-slot architecture” the blockchain was trying to ditch. He stated:\n\n“There is a deep philosophical reason why epoch-and-slot architectures seem to be so hard to avoid: it inherently takes less time to come to approximate agreement on something, than to come to maximally-hardened ‘economic finality’ agreement on it.”\n\nHe suggested that the network developers explore other options that are not as tightly interwoven as Gasper.\n\nMentioned in this article"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxPV3BIUVJvYl9McU9TRjBtdlhNem1YTlVJUFc3QWlkUEV1eTR4Szh1RjRPY3VTOHFtMWJOSmRncHhSWFk4VExlak0yNFUtZHpaOU9VTlhpLUN0SW5pQy1qdHN6WlZTR0FTYVdoWHc0UExNSFZ0NDRRbTdob0lJc2g4NmFyc3pVaWJGOFVjRTNVTEZwOWZWMnFUTGMtc1J6YmNQZXRwZExudk1RRXlqUHhDamJFbnY4TExTRXdN0gHAAUFVX3lxTE55UVFRUG0zRGx2R21hN3NqTm5nbXI0YUlSSlBhYzVIbVBrcW96RkRpV013VGJRS3Y4X1NoemFkZ2NiMGQxeU5FY1FudUhRZ2tEZ29SaGx0b25YN0FuelFxaVI1Zm1hT2dGNnFjLWtLeDN6d2lVdzE2MmJRRXMyYjFXX2dqbnJyek1wclJIaE5OYTcxSDl3YTR1ZW0zaG9ZczJoU2dTSDVFR1pvakZxZ2hZUXk1YW5fbFNiMUxNVS1WbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jul 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Products See Largest Institutional Outflows Since August 2022: CoinShares - The Daily Hodl",
        "content": "Digital assets manager CoinShares says that institutional crypto products sustained outflows last week for the third week in a row.\n\nIn its latest Digital Asset Fund Flows report, CoinShares says digital asset investment products suffered $30 million in outflows last week.\n\n“Digital asset investment products saw a third consecutive week of outflows totaling US$30m, with last week indicating a significant stemming of the outflows. In contrast to prior weeks, most providers saw minor inflows, although this was offset by incumbent Grayscale seeing US$153m outflows.”\n\nDespite overall outflows, the US, Brazil and Australian regions saw $43 million, $7.6 million and $3 million in inflows, respectively.\n\n“Negative sentiment pervaded Germany, Hong Kong, Canada and Switzerland with outflows of US$29m, US$23m, US$14m and US$13m respectively.”\n\nWhile the leading crypto by market cap Bitcoin (BTC), multi-asset investment vehicles, Solana (SOL) and Litecoin (LTC) brought in $18 million, $10 million, $1.6 million and $1.4 million in inflows, Ethereum (ETH) had one of its worst weeks in years.\n\n“Ethereum saw the largest outflows since August 2022, totaling US$61m, bringing the last two weeks of outflows to US$119m, making it the worst performing asset year-to-date in terms of net flows.”\n\nChainlink (LINK) and XRP also brought in $0.6 million and $0.3 million, respectively.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/phive/Sensvector"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMibkFVX3lxTFAzRV80ajkzbWs5UlAxNURid0FiU0hhYUE4Umcta3ZBdzVzQ1ZFNDFVN3hhbFZLR3FRY2hVSHRuMGEzemlMSm5LMXVGTlUtaTdQZVI2eTQyOVlaM0p3am1tQXZ1RnRzUHljWWRiX3pn0gFzQVVfeXFMUEpUNWEyNllxWjJOMzZrc0FtNUo3ZmlsVGF5aEdCTkQ3VEtaVjR2YlByNE1ZSld1b00zeU5fQ3hvSDlUVi01TlVOSXhGcVFWZ05QYUVvdktwYUd4WHBZM1hZa3lYTS00NmNyTmlxRklxYnFiQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Records Lowest Gas Prices Since 2016 - U.Today",
        "content": "On June 30, the Ethereum network recorded its lowest fees since 2016. According to data provided by Etherscan, the average gas fee is currently sitting at just 3 Gwei ($0.14), according to data provided by Dune Analytics.\n\nAdvertisement\n\nGas fees refer to the cost of various operations on the Ethereum blockchain. By paying gas fees, users help to ensure the security of the network. Apart from incentivizing validators, gas fees are also meant to prevent various spam attacks.\n\nDuring the 2021 bull run, Ethereum's gas fees were exorbitantly high due to high demand in the non-fungible sector (NFT). This prompted some pundits to argue that the network was unsustainable and gave rise to more affordable alternatives such as Solana.\n\nAdvertisement\n\nThis time around, Ethereum gas fees are hitting extremely low levels despite the fact that the network is also experiencing strong transaction activity. In fact, the volume of the leading altcoin is on the same level as it was during the beginning of the year.\n\nThe plunging fees can be explained by a higher level of efficiency of the Layer-1 market due to the combination of Layer-2 volume and the introduction of “blob transactions” with EIP-4844 that helped to significantly boost Ethereum's scalability.\n\n\"We will still see gas spikes above 15 gwei in times of higher activity. It’s just that overall the gas market has been more efficient post 4844. So we’ll have more affordable days than expensive ones,\" Pistachio Fi founder Brian Smocovich said in a post on the X social media network.\n\nBack to inflation\n\nThe massive drop in fees means that Ethereum is no longer a deflationary network since the amount of fees to burn is very small. This flies in the face of those who were pushing the narrative about \"ultra sound money\" prior to the Dencun upgrade.\n\nOver the past seven days, 14,393 ETH has been added to the network, according to data provided by ultrasound.money. This translates into annual supply growth of 0.62%.\n\nThe total supply of Ethereum currently stands at 120,185,061 ETH, which means that it is on track to reach a new 2024 peak."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxNcUVpNG56ZUd5dFA3MlhkZjFQSU5adEdheHkxYlhtdmdFUU5saHQ5dVhVUzI4N1c5NTdlRUlIcnF5bFdVZGMzdFpTUUl6X2IxMVBVRHFDR3BuaF9EMVA4Ty12M3JqVEp1cHdwLTZ4ei1iV0JfXzZlQVNUbzVfZjJ0aDc5U0xYSHNIV21OOHZDRmFNVE01Tlc4UXJJT3JSb3gxS1E4WUNuUUVsaHlhd3BMRWFQcWh4QnBodDlKNENiMVp2Z9IBxwFBVV95cUxPWUhUNjJSbG4xeGs5RzBGNVhBeno0cm9Ra0RiNlRhcndJbi0xa1lWVTFkTThxdTRNOGM5c3pfdndTZnJjaTUwY1J4Qm9QXzYtazJuNjFpenJ3ZG5hVWdWOUxvdl8wQW5aWlV3RTJ3MGJDM1ZOT25BMm92MFdHOVhSQ1FoLWJNRm9USmI1bTFvdUswSlI4cjB3eEhnV3JyTGpGdUZ6N3VtQ1Q2QTllNENFbjduaVhNNDYwNUw5b0Z6WFI5Y0pZdkU0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jul 2024 07:00:00 GMT",
        "title": "Bloomberg ETF Expert Moves Estimated Ethereum ETF Approval Date Following New SEC Comments - The Daily Hodl",
        "content": "An exchange-traded fund (ETF) expert at Bloomberg is moving his estimated date for the approval of spot market Ethereum (ETH) ETFs following recent comments made by the U.S. Securities and Exchange Commission (SEC).\n\nIn a new thread on the social media platform X, Bloomberg ETF specialist Eric Balchunas says that spot ETH ETFs likely won’t be greenlit until after the July 4th holiday weekend, which extends to the 8th, since many SEC staff members will be on break until then.\n\n“Unfortunately, I think we [are] gonna have to push back our over/under till after [the] holiday. Sounds like SEC took extra time to get back to people this week (although again, very light tweaks) and from what I hear, next week is dead because holiday = July 8th. The process resumes and soon after that they’ll launch.”\n\nLast month, Balchunas had predicted that the SEC would approve the ETFs by July 2nd after the SEC responded to several S-1 filings submitted by financial giants.\n\nAt the time, it was found that the regulatory agency sent back the filings to the firms for modifications, hinting that approvals were coming soon.\n\nOver a week later, SEC Chair Gary Gensler indicated that the regulatory body would be approving ETH-based spot market ETF applications, but did not give a specific date. At the time, Gensler said the agency was currently working through the required disclosure statements needed.\n\n“It’s really about the asset managers making the full disclosure so that those registration statements can go effective and those lawyers know what that is.\n\nIt’s something our Division of Corporation Finance handles hundreds, if not thousands of times over anybody’s career. It’s smoothly functioning. It’s really up to the asset managers to make the proper disclosures.”\n\nSpot market Bitcoin (BTC) ETFs were approved by the SEC in January, bringing in billions of dollars worth of inflows to the top crypto asset by market cap. Recently, firms have also been filing bids to create ETFs based around Ethereum rival Solana (SOL).\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxNbWRlSzhHYTNJZHNQVml5VERhY2NVMHFuWmE1Z3A2eF9GQ012LWJwT19icmk1aVJxd0pHV0VDRVRxR1M0UnRSU2htM1JlOHc4TUxXZm5hLWxPN3VIUGRCdS1ueUNRWVBZbnpKM0lqR2d0aXpZdWlyRWFrWEJqbEhZdXo3SURLajlra1dzVXF1eS1Ba1J1aTkw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jul 2024 07:00:00 GMT",
        "title": "Solana Surpasses Ethereum in Daily DEX Trading Volume - Crypto Times",
        "content": "Solana has overtaken Ethereum in daily decentralized exchange (DEX) trading volume, according to recent data from DefiLlama. Solana-based DEXes reported $1.148 billion in daily trading volume, outpacing Ethereum’s $736.62 million.\n\nBREAKING🚨\n\n\n\nSolana just dethroned Ethereum in daily DEX trading volume.\n\n\n\nSolana ETF is also filed.\n\n\n\nSeems like the $SOL summer is here👀\n\n\n\nWhat coins on SOL is the next 100x?👇 pic.twitter.com/pao6OKwX4z — EvanLuthra.eth (@EvanLuthra) June 30, 2024\n\nSeveral Solana platforms, including Raydium, Meteora, Orca, Phoenix, and Lifinity, now rank among the top 10 DEXes by daily trading volume. Uniswap and PancakeSwap continue to lead the market overall.\n\nImage Source: Defillama\n\nPatrick Scott, founder of Dynamo DeFi, reports that Solana’s DEX volume dominance is approaching 25% for the first time this June. This increase is partly attributed to the popularity of meme coins on the Solana network earlier this year.\n\nSolana’s DEX volume dominance (red) is still rising, on track to break 25% for the first time ever this month. pic.twitter.com/swUUJbG7Ad — Patrick Scott | Dynamo DeFi (@Dynamo_Patrick) June 28, 2024\n\nDespite the recent trading volume success, Solana’s price has experienced a slight 0.5% decrease over the last 24 hours. According to CoinMarketCap, Solana currently holds the fifth position in cryptocurrency market capitalization at $65.2 billion, following Bitcoin, Ethereum, Tether, and BNB.\n\nThe total DEX volume across all platforms reached $26 billion in the past seven days, according to Dune Analytics, underscoring the growing importance of decentralized trading in the crypto ecosystem."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxNUmk2cExjdGp4SXhOMlZ2RXItQUJfUE5MYWM5eDZqeUxfN2F1aTROaXZHbU9hdTFCWkt0ME5VaTBwSWIzbkpFbXZMTWl3RW5uUkFCbUtPYjlkV2FPeXVkRzkxaUNCOWVNMDFiWmxqV3pTTFV4UXBjSDdDVU9fckdHd2E4T2ZJeVN20gGOAUFVX3lxTE5VT2hab24yU19LUlhKS0IwaWh2enNsSE9GSE4wY3FmLUVGWVNnX0xPd1hJaXl6TEs1c0xUamx2ZjFUNHBxLUx5MmY5b25pZzRjYnVKZFNWM3FsWDEzM1NsVmloeW5rRFRrcjBQRkFnaHVqcHNuVEstNURTSFk3bGI4eDliV2NHVmFSNjJjTXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Jun 2024 07:00:00 GMT",
        "title": "Ethereum’s ‘failed’ breakout – When will ETH’s price breach $3.5K? - AMBCrypto News",
        "content": "Ethereum’s price dropped by over 3% in the last 7 days\n\nA key metric revealed that ETH was undervalued, hinting at a recovery on the charts\n\nEthereum’s [ETH] price action turned bullish on 28 June, giving investors hope for a recovery from their past losses. Unfortunately, this bullish trend didn’t last for long, as the coin recorded a price correction soon after. This led to both its weekly and daily charts flashing red.\n\nEthereum faces rejection\n\nAfter the aforementioned hike in price, ETH’s bears stepped up again and pushed the altcoin’s price down by more than 3%. At the time of writing, the king of altcoins was trading at $3,391.51 with a market capitalization of over $407 billion.\n\nThe worst news was that Ethereum got rejected from the upper limit of a bullish wedge pattern in the recent past. As per a tweet from ZAYK Charts, a popular crypto analyst, the token’s price started to consolidate inside the pattern in late May. A successful breakout could have resulted in a 30% price rise, which might have allowed Ethereum to go past $4k.\n\nInterestingly, a similar pattern had emerged earlier in March, only to break out in May. This allowed the altcoin to hit $3.89k on the charts. However, since ETH got rejected this time, the chances of history repeating itself might be slim.\n\nWon’t ETH recover?\n\nAMBCrypto then took a closer look at Ethereum’s current state to see whether it would fail to break out of the bullish pattern.\n\nWe found that market sentiment around the king of altcoins remained bearish. This was evidenced by the dip in its weighted sentiment after spiking on 28 June. Its network growth also dropped slightly, meaning that fewer addresses were created to transfer the token.\n\nNonetheless, a few of the metrics were in favor of a successful breakout.\n\nFor example, the MVRV ratio has improved over the last few days, which can be interpreted as a bullish signal.\n\nAMBCrypto’s assessment of Glassnode’s data also revealed that Ethereum’s NVT ratio had declined sharply. A drop in this metric usually means that an asset is undervalued – Implying an incoming price hike.\n\nAMBCrypto then took a look at Hyblock Capital’s data to look for immediate support and resistance levels.\n\nAs per our analysis, it would be crucial for ETH to touch and go above the $3.5k-mark in order to sustain a bull rally as liquidations would rise sharply. Generally, a hike in liquidations often results in price corrections on the charts.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nOn the other hand, if bears continue to dominate and ETH’s volatility rises in a southbound direction, then it might fall to $3,060."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxQMlZ5bjR3RjMyLUpZWFYwWkl1aER6MFFiOVcxX3JlcElkQUpodUZ4N3E3RkxfTXVpSlFsRmpTc2F0Rll6c1V3ejlwcmVBbk1KZzJSbjRjTHNzOEJwaVRKa1c5YXg1bTAtUUxRSGRxcUh5bEFsVjYzTEZKTVM5cWRYVFdkMktZb2FEeEE0N25VMWhnU2ppQWN5Tkw4VjZBYVZHVkJjbzZB0gGrAUFVX3lxTE92NXJDQkFlX1NHTE5Fc3dOQXFLeTRpVUNacnZUWlkwa3htWFRYa3lzLXV3aEpUbUVMN3VabDM2bWlOS2UxVk1hQXhHVDZjNmZ0bE1OQ005OWh0R2Y3NWE0LXF1S2RwdzVJMDIySHBnbkUyRHJiUzJXdWRIS1c3VEJ4YzBoTHZLeUlrVEZ5NC05SU5VZk9XWUEtNkRsSVdPWndQUkJESVFXNVZXbw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jul 2024 07:00:00 GMT",
        "title": "XRP to Skyrocket Next Week? Ethereum (ETH) Not Losing $3,370, Will Solana (SOL) Reach $150 Again? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nXRP might have been in a downtrend, but the current state of the asset implies the possibility of a reversal. The current state of XRP is perfectly described by saying that not many people are selling it, but almost no one is buying it either.\n\nThe chart shows that XRP has had difficulty increasing in value over the previous few months. The lack of movement in the price can be explained by the volume profile, which shows minimal trading activity.\n\nGiven the state of the market, it appears that neither buyers nor sellers are willing to take large positions based on the low volume. A spike in volume might be interpreted as a sign of renewed interest and could raise the price.\n\nWith an RSI of approximately 41, XRP is in the lower neutral zone. This implies that there may yet be room for growth before overbought conditions materialize. An increase in buying pressure and the potential beginning of a new uptrend would be indicated by an RSI rise above 50.\n\nAdvertisement\n\nEven with the recent decline, XRP still has solid fundamentals. When the legal dispute between Ripple, the company that created XRP, and the SEC is resolved, it may benefit XRP's price. Further providing a strong basis for future expansion are Ripple's continuing partnerships and technological developments.\n\nEthereum stays composed\n\nEthereum has been actively trading at around the $3,400 price threshold, but it has also been showing some worrying signs, while the 100 EMA is not considered the most reliable technical level for an asset. However, things may turn out better than expected.\n\nBecause it closely resembles the 100-day exponential moving average (EMA) (orange line), the chart indicates that Ethereum has been able to maintain above the $3,370 mark. With the recent market turbulence, this level has served as a support zone, stabilizing the price of ETH. Volume analysis shows inconsistent signals.\n\nEven though trading volume has not increased significantly, the consistency shows that interest in Ethereum at these prices is stable. It is important to monitor this metric, because a spike in volume may indicate a more forceful move in either direction.\n\nEthereum is presently in the lower neutral zone, according to the relative strength index, which is circling 43. This points to potential upward movement before overbought conditions materialize. Additional proof of bullish momentum would be provided if the RSI could move closer to the 50-point level.\n\nIndicators of long-term trends, the 26-day and 200-day EMAs, are also displayed on the chart. As of right now, Ethereum is trading above the 200-day moving average, a bullish indication for the long run. It is still below the 50-day EMA, suggesting some short-term pessimism.\n\nEthereum's price action is heavily influenced by market sentiment. The overall trend is still positive despite a few negative signs. Potential price increases for Ethereum are well-founded due to its strong fundamentals, which include continuous network upgrades and growing user adoption.\n\nSolana struggles on way up\n\nSolana has been actively fighting for the $150 threshold for the last few weeks. However, despite positive fundamental developments that include the introduction of Blockchain links (or blinks), which are a specification that allows a user to complete an on-chain transaction on any website capable of displaying a URL, the price of the asset has not been moving actively.\n\nIn order to verify a bullish reversal and pursue the $150 target, Solana must close above numerous moving averages. Solana has recently found support at the 200-day EMA or roughly $130. Numerous tests of this support level show that there is significant buying interest at this price.\n\nMixed signals can be seen in the volume profile. Although there has been some trading activity, not much to indicate strong bullish momentum has emerged. The market's growing confidence in Solana's price action would be indicated by an increase in volume. For bulls, a move in the RSI above 50 would be positive."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE1BbG9LWVRjUWtxVVNZaFk3MzZGczJKdl82ZVVxMnJCbE9SUW9seUk3TG4wN1VZQ1RWWWt6bjVxWWVTVl9aMktOTzM0M2J4eDlORU1VemctaDJCR3hhVmUtbC1HVzJpaE85a1IyZlRxT180eTdZb1A2bzMtQk1NZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jul 2024 07:00:00 GMT",
        "title": "Le lancement des ETF Ethereum encore repoussé. Découvrez pourquoi… - Cointribune EN",
        "content": "Mon 01 Jul 2024 ▪ 3 min read ▪ by Luc Jose A.\n\nInitially expected in early July, the launch of Ethereum ETFs has just been postponed by the SEC, plunging crypto investors into palpable uncertainty. This unexpected decision, underpinned by additional requests for reviews of the S-1 forms, highlights the persistent regulatory challenges faced by the adoption of digital assets.\n\nThe SEC’s new decision regarding Ethereum ETFs\n\nThe U.S. Securities and Exchange Commission (SEC) has decided to delay the much-anticipated launch of Ethereum ETFs, initially planned for early July. This decision follows additional comments issued by the American financial regulator on the S-1 forms submitted by potential issuers of these ETFs. Issuers now have until July 8 to resubmit their revised forms, potentially pushing the launch of Ethereum ETFs to mid-July or later.\n\nThis delay is part of a two-step process for the approval of Ethereum ETFs. The first step, involving the approval of form 19b-4, was completed in May. However, the S-1 forms, which represent the second step, do not have a fixed deadline, leaving the issuers dependent on the SEC’s timeline for their review and approval.\n\nMarket Reactions\n\nWhile some crypto industry players remain optimistic about a quick approval following the revisions of the S-1 forms, others worry that this delay signifies deeper regulatory challenges. Analysts estimate that final approval could come within two to three weeks following the submission of revised forms, but the exact date remains uncertain. Crypto investors, who had initially anticipated approval in early July, now need to reassess their short-term strategies.\n\nMoreover, the implications of this delay extend beyond just the launch of the ETFs. It is indeed a critical test for the entire crypto sector. Once approved, Ethereum ETFs could not only gain institutional recognition but also transform the landscape of crypto investments, offering new opportunities for investors and consolidating Ethereum’s position in the global financial market.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxOUmY1amVoa2tWdjk2MWJhRFVKVGM0cmNEY3JJQUd1T1VTR0g1Tjc3VERfTjc3Z2dBNVVoZFFBVmpXSUdDZlU2VUxYaHVwTDVEUEpvYl9uTXRDTVhybEo3TVJsbTNSNzlfN1NjZG1lN2J0SloweFhVQ2FOZWhueUlHOUtGTHdQaTDSAYwBQVVfeXFMTUJBU2MzaWFnMzNfRzRKckJtRGNMZEd4SkRnX0x0TG9CNWVqQzFRS01YMnQxb2JBaHIxRnBkb0lZRklzWm9fTkQ0MFhnMEhJMEZCc2gyVjZWeXoxVDl2MzZNRmtNNDNfNUZaa1VEZE5zYkRaNXZXWk5QM3hFRVJJVDQyeUdibzl4dExWd24?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jul 2024 07:00:00 GMT",
        "title": "Vitalik Buterin Hints at Model to Speed up Ethereum Transactions - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nEthereum cofounder Vitalik Buterin has hinted at new technologies that might fuel faster transaction confirmation times for users. As shared in a lengthy blog post, Vitalik Buterin hinted at epochs and slots as the go-to models to help the Ethereum network stay competitive.\n\nAdvertisement\n\nEthereum needs speedy transactions\n\nIn Buterin's view, Ethereum is better off than it was five years ago in terms of transaction finality metrics. The blockchain now averages 5 to 20 seconds for transactions, which compares well with its traditional finance competitors.\n\nEpochs and slots all the way down: ways to give Ethereum users faster transaction confirmation timeshttps://t.co/lfCXrFm6A1 — vitalik.eth (@VitalikButerin) June 30, 2024\n\nHowever, with the slots and epochs architecture, the Ethereum cofounder argued that finality could drop down to 16 seconds. While the protocol has worked hard to pilot this slot and epoch architecture, Buterin noted that more improvement to this tech stack is still needed.\n\nButerin noted that Ethereum has always created an enabling environment for its constituent protocols, like layer 2, to create their own model for transaction confirmation. While this strategy has worked well, with layer-2 solutions proven to be faster, he believes it is time to guarantee efficiency.\n\nHe remains optimistic about the future of the Ethereum blockchain and how advances in transaction speed times on L1 can make the lives of L2 developers easier.\n\nMatching competition\n\nThe layer-1 blockchain space might be considered saturated, however, it has continued to evolve, with each new entrant boasting of enhanced capabilities. Ethereum’s key competitors, including Solana (SOL), Cardano (ADA) and Fantom (FTM), all boast advanced technology in terms of transaction speed.\n\nWhile Ethereum still dominates the DeFi ecosystem, and the new proposals to increase its confirmation speed might only help make it more endearing to users. Overall, if the developers of the Ethereum ecosystem are able to promote this new futuristic architecture, the biggest beneficiary will be ETH.\n\nCombined with the expectations for spot Ethereum ETF trading this month, there might be a massive uptick in price moving forward."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxQUjVub1Q3R0FlNGdLc3l2TFd0NzN5bWwwN2czWTBUdXlVcE5aVjRsS2ZJc2ZYNTFSbUREMjl0dWdJWXRTYi0tMHFmbkVIUGdCNFdiem9pTXNOVlA5VkwxQXFHWDNLbG52Skk4WVVzSktmRlVqWHdGNVdHdm0ya2JsaENWbHZMZjYxVm1nVlRXaXY4aVBpblHSAZsBQVVfeXFMTnJJSE12YmQ4NUR2c0poaXJBd3ZQS2I5bTF5THg4dzJXZ3ljOE5WblFJbThPemg2dXd5bkZReVlMbTR2ZE9xWFFjQjZ6c0NqYXNUaHlOdDFJY1NqbF83NDJfUjdxYTdZMDlYTWJGYk9qZTRicUJRVkg3SlhMM094MlFCNFY2akNnejJpQUVvX0U0c0RSaDhQMWIwQW8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Suffers $61M Outflows, Worst Performance Since August 2022 - CryptoPotato",
        "content": "Digital asset investment products experienced their third consecutive week of outflows amounting to $30 million, although last week showed a significant decrease. While outflows for Ethereum continued, investor sentiment surrounding Bitcoin appears to be slowly changing.\n\nAccording to the latest edition of CoinShares’ Digital Asset Fund Flows Weekly report, most providers recorded minor inflows, but this was counterbalanced by Grayscale, which saw $153 million in outflows.\n\nTrading volumes increased by 43% week-on-week to $6.2 billion but are still well below the yearly average of $14.2 billion, the asset manager said in its report.\n\nOver the past week, multi-asset and Bitcoin ETPs led the inflows with $18 million and $10 million, respectively. Short-bitcoin products experienced outflows of $4.2 million last week, suggesting a possible shift in sentiment. Several altcoins saw inflows, with Solana receiving $1.6 million and Litecoin recording $1.4 million. Chainlink and XRP also witnessed inflows of $0.6 million and $0.3 million respectively.\n\nInvestment products based on Ethereum experienced the largest outflows since August 2022, totaling $61 million, bringing the two-week outflow total to $119 million, making it the worst-performing asset year-to-date in terms of net flows.\n\nDespite positive sentiment towards crypto this year, blockchain equities have faced outflows of $545 million, representing 19% of assets under management.\n\nIn terms of region, the US dominated the charts with inflows of $143 million, followed by Brazil and Australia with $7.6 million and $3 million in weekly inflows respectively.\n\nContrastingly, Germany, Hong Kong, Canada, and Switzerland faced outflows of $29 million $23 million, $14 million, and $13 million respectively during the same period. Sweden also recorded outflows of $4.3 million."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxOVUFEaUgySlU3Y25YN1BNb1hwdXk5VWd6TElrX0JEOVpuaVhUbzhNeG8zdmxTT3VyOWc3R3AtWWRadGMxbzVYcUM5N1BDREFrWWNXcTUtTzAyaV9WbGdwZUdWWU1ndnZXLVQ1QldWVUI3ak1qNDk4NE9NMGdncVRZY1VmejRESkZZdGs1UWh1MXBGdEXSAZgBQVVfeXFMUEtaM1NsSFlsMGNNVFhtNEo2dVFXWWxRaHdYYTc5bDYwLVFZbzRyUnBTclp6NTdPNkc5SDh6QWtWdFgyLXhZSjNXYm83TVVvdndFNTZkbDV3T3lEYUFVTVdqZUx4OGtlbmVFdzBza2gyakZWT3JSR002YzVlZlVCcEdTRnVQdzN3eTFoc3QzWXBWUWJjR1FiUk4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Jun 2024 07:00:00 GMT",
        "title": "Is Ethereum’s price under pressure? A look at on-chain data suggests… - AMBCrypto News",
        "content": "The number of addresses on the network has been falling for the last seven days\n\nETH supply on exchanges fell, reducing the potential of a sell-off\n\nThough Spot Ethereum [ETH] ETFs would begin active trading in a few days, activity on the blockchain’s network has been discouraging. AMBCrypto found that out after evaluating the project’s network activity.\n\nAt press time, we observed that Ethereum’s active, new, and zero-balance addresses had dropped. By definition, new addresses refer to unique users making their first successful transaction on the network.\n\nActivity falls, but there is a catch\n\nThis metric acts as a measure of traction or adoption. On the other hand, active addresses track the number of users participating in transactions. When this metric rises, it means an increase in the level of user engagement and growth.\n\nHowever, at the time of writing, active addresses had fallen by 15.45%. in the last seven days. New addresses were not spared either with a 6.50% decline.\n\nThis development comes as a surprise considering how close the projected ETF launch is. If this decline lingers, the price of ETH could be affected. This, because a drop in Ethereum’s network activity could mean less demand for the cryptocurrency.\n\nAccording to CoinMarketCap, ETH’s price was $3,379 at the time of writing. This represented a depreciation of 3.35% within the last week.\n\nAnother indicator AMBCrypto examined was the Exchange Supply Ratio. This is the ratio of coins reserved in exchanges, relative to the total ETH supply.\n\nWhen it hikes, it means that the number of coins sitting on exchanges is moving up. A potential consequence of this is a rise in selling pressure which could later on lead a price fall.\n\nHowever, at press time, the ratio seemed to be falling, according to data from CryptoQuant. This decline lowers the risk of a sell-off as holders seem to be comfortable locking their assets for safekeeping.\n\nETH traders are not confident\n\nAs funds move away from exchanges, the potential for a bull run rises. However, for this to affect ETH in a positive manner, buying pressure needs to rise.\n\nIf this is the case, ETH’s price could climb towards $3,600 within the first few days of July. However, if the opposite happens, the value could consolidate between $3,200 and $3,400.\n\nAdditionally, Ethereum’s Open Interest dropped from the value it had on 27 June. OI, which is its short form, refers to the value of open positions in the derivatives market.\n\nAn increase in this metric implies that traders are involved in a lot of speculative activity. On the contrary, when it falls, it means that traders are closing existing positions and taking money out of the market.\n\nWith a value of $13.14 billion, ETH’s OI implied that participants are not refraining from opening positions to capitalize on movements from the price.\n\nRead Ethereum’s [ETH] Price Prediction 2024-2025\n\nShould the value continue to fall, ETH’s price could also follow in the downward direction. However, this prediction might be invalidated if open contracts increase and buying pressure in the spot market follows.\n\nIf this is the case, ETH could begin a hike towards $4,000."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxQX09mZlVYY2p6R2QzbzNLS2JlSDBxY25OUS1NRkJJRTU0R3ZQcmFnbkF4N1gtM2dBT2ZPV3pTdUhHV193eENISEFlSGNJUlhjVnd2MHg4LUVoSGpnWmJMdm9ndFU5YVdoY212ODBZUUlwajVMZGU2UC1UMUpVZGlOcWE2eGIzX1ZUVmZIYlVSQTdJZUtyOXVveWhWVFY?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jul 2024 07:00:00 GMT",
        "title": "Frais de gaz Ethereum au plus bas : Découvrez ce que cela cache vraiment ! - Cointribune EN",
        "content": "Mon 01 Jul 2024 ▪ 4 min read ▪ by Luc Jose A.\n\nOn June 30, 2024, a historic milestone was reached for Ethereum: the network recorded its lowest gas fees since 2016, a piece of news that resonates like an earthquake in the crypto ecosystem. This unexpected phenomenon occurs in a context of high transactional activity, redefining the economic dynamics of the world’s second-largest blockchain. Why this spectacular drop in gas fees, and what are the implications for the future of Ethereum and the crypto sector as a whole?\n\nA historic drop in gas fees\n\nSo, on June 30, 2024, the Ethereum network recorded an average gas fee of 3 Gwei, or about 0.14 dollars, according to Dune Analytics data. This drastic decrease marks the lowest level since 2016, offering a sharp contrast to the exorbitant fees observed during the NFT bubble in 2021. At that time, massive demand in the NFT sector drove transaction fees to new heights, leading some analysts to question the viability of the Ethereum network and explore more affordable alternatives like Solana.\n\nToday, despite sustained transactional activity, gas fees are surprisingly low. This situation is attributable to a series of technological improvements, including increased efficiency of the layer 1 market and the integration of layer 2 volumes. The introduction of “blob transactions” with EIP-4844 also played a crucial role in increasing the network’s scalability. These innovations have smoothed transactions while keeping costs to a minimum, a technical feat that redefines Ethereum’s capabilities.\n\nImplications for the Ethereum ecosystem\n\nFirst, this reduction in transactional costs could revitalize Ethereum’s appeal to crypto developers and users, particularly those who had migrated to more economical alternatives. By making transactions more affordable, Ethereum once again positions itself as a preferred platform for decentralized applications (dApps) and daily transactions, potentially increasing adoption and innovation on the network.\n\nThis development also has significant implications for the network’s security. Historically, high gas fees served as a protective mechanism against denial-of-service (DDoS) attacks by making attacks costly. With the decrease in fees, it is crucial that the scalability and efficiency improvements introduced by recent updates are sufficient to maintain network security against a potential increase in attacks.\n\nFrom an economic perspective, the decrease in fees also means that the second-largest crypto by market capitalization is less deflationary than before. With the amount of fees burned being reduced, Ethereum’s total supply is increasing again, altering the dynamics of supply and demand in the market. This situation could influence investor perception and the long-term strategy of network stakeholders.\n\nIn conclusion, while the decrease in gas fees is positive news for users in terms of cost and accessibility, it demands continued attention to security and economic sustainability issues. The next steps for Ethereum will be to balance these different aspects while continuing to innovate to stay competitive in an increasingly saturated and demanding blockchain environment.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPZjVDS0JfRjAxclpZWHFsVjVTQ3RIMlR2MHQ5TG56cm1zQlZTR0dEQWg1azZ0ekIwMndpbkpWS21Wc09DZlQ3UHdGOVB0SDNkSzNIaFhVTm5pelhDUHh3OEpaeWVHRHhlLV9hOWFYaEpNcnc0dy1xeTlBWVJnQTVaYy1iTGpIZXROdXZj0gGQAUFVX3lxTE14dHo4MnpjQ0YyQVozT1Rrc3J0d2NjU2NqUVJHbG1keDFBcVVnNWhFOTJNOUxrN2U5YXBlT0dLb0x4aDlUS0VOZGd3SHBEWDdUN1hFV1FUOURmSVFYb1ByV3AtdzlsemZmRG5QXzR5ZElfTU9kaUFobFhKMk9FTW5BMUVhMmNQdUZrZkliaEhVUg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jul 2024 07:00:00 GMT",
        "title": "Ethereum to ATH in 2024? Why ETH’s surge has excited investors - AMBCrypto News",
        "content": "Selling pressure on Ethereum was high in the last week.\n\nMarket indicators were bullish on the token.\n\nEthereum [ETH] finally gained bullish momentum at press time. If the latest data is to be considered, then ETH might be getting ready to reach new highs by the end of this year.\n\nLet’s take a closer look at what’s going on.\n\nEthereum to breakout soon\n\nAMBCrypto’s look at CoinMarketCap’s data revealed that ETH’s price increased by over 2% in the last seven days. In the last 24 hours alone, the token’s price surged by more than 3%.\n\nAt the time of writing, ETH was trading at $3,488.88 with a market capitalization of over $419 billion. Thanks to the recent price increase, only 10% of ETH investors were at a loss, as per IntoTheBlock’s data.\n\nThings can get even better for the token as a bullish pattern appeared on ETH’s chart. World of Charts, a popular crypto analyst, recently posted a tweet highlighting a bullish falling wedge pattern.\n\nETH’s price started to consolidate inside the pattern in May, and at press time, it was on the verge of a breakout.\n\nIt was interesting to note that ETH got rejected from the upper limit of the pattern a few times earlier. However, World of Charts mentioned that there were still chances of a breakout.\n\nIf that actually happens, then investors might witness the token touching new highs by the end of this year.\n\nWhat’s there in the short term?\n\nAMBCrypto then planned to take a closer look at ETH’s metrics to better understand what to expect in the short term. We found that selling pressure on the token increased.\n\nAs per our analysis of Santiment’s data, Ethereum’s Exchange Inflow spiked last week. Its Supply on Exchanges also increased, meaning that investors were selling the token.\n\nWhales remained confident in the token, as ETH’s supply held by top addresses increased.\n\nA few other market indicators also looked optimistic. For instance, the MACD displayed the possibility of a bullish crossover.\n\nThe Relative Strength Index (RSI) also registered an uptick and was headed towards the neutral mark at press time.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nMoreover, the Chaikin Money Flow (CMF) followed a similar increasing trend, indicating that the chances of a price uptick were high.\n\nIf that happens, then investors might witness ETH touching $3,895 in the coming days. But if things get bearish, then ETH might drop to $2,877."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxOVlJLc19ON3NKZ194QmxrWm0tbWdTYXRmQ1ZWRXlhQ09HczFyRnRXM0pCRWZwcDRHOTFNOFd6eE1vclBMdDVia09HeVF3aWZ0TGlOX1RWYm5jbG9ta3d4VEZJa1lLYl8xRGVHMjdvOFVvdFB3cnQtdU1kb05FcmlEaDE0ZzY3cnBT?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jul 2024 07:00:00 GMT",
        "title": "Crypto: Vitalik Buterin, His Bold Strategy Unveiled! - Cointribune EN",
        "content": "Mon 01 Jul 2024 ▪ 3 min read ▪ by Fenelon L.\n\nVitalik Buterin, co-founder of Ethereum, has just unveiled innovative proposals aimed at significantly reducing transaction confirmation times on the network. These innovations could transform the user experience and strengthen Ethereum’s position in the crypto ecosystem.\n\nEthereum in search of speed to dominate the crypto market\n\nAlthough Ethereum has made notable advances in recent years, the network still struggles to match the speed of newer blockchains.\n\nWith a block time of about 12 seconds, Ethereum lags behind competitors like Solana, capable of generating blocks in 0.4 seconds. This limitation hinders Ethereum’s adoption for certain applications requiring minimal latency.\n\nTo address this challenge, Buterin proposes several technical innovations. The most ambitious of which is the “single-slot finality (SSF)” or “finality in a single slot”, which would radically simplify the network’s architecture.\n\n“The main challenge of SSF is that, naively, it seems to imply that each participant of Ethereum would have to publish two messages every 12 seconds, which would be a significant load to manage for the chain.” Vitalik\n\nThis approach would eliminate the current system of epochs and slots, which is considered too complex. However, its implementation raises questions about the load supported by the blockchain.\n\nA delicate balance between speed and decentralization\n\nAnother promising path involves “based pre-confirmations”. This mechanism would allow users to pay additional fees in exchange for a guaranteed inclusion of their transaction in the next block. Compatible with layer 2 solutions, it would offer an almost instantaneous experience for demanding applications.\n\nWhile speed is crucial, Buterin insists on the importance of not compromising Ethereum’s fundamentals. Decentralization and security remain absolute priorities.\n\nEthereum’s current block time already represents a significant improvement over Bitcoin (10 minutes). Nevertheless, Buterin believes that some applications require latencies on the order of “hundreds of milliseconds, or even less”.\n\nThe challenge is therefore to find the right balance between performance and network integrity. Buterin’s proposals aim to push the limits while preserving the very essence of Ethereum.\n\nIn short, the forward-thinking ideas of Vitalik Buterin could redefine the standards of the crypto industry. If they come to fruition, these innovations would allow Ethereum to consolidate its leadership position while paving the way for new revolutionary applications in the blockchain universe.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPUXlMQzEtUXR4NXFxaHpQQ0dCZlFHYUJUM2NUTUtsZnFwbVk0elJWZm5DelYxMndWeVRPQllxOFB1aUJoa2x2WTVQXy1saHk4cDVYT3h1ODlqeU5XVUhYVm8yOXNlejg1RlVnMldtcHBZRklMSTdnanRUQldyTEp4bktIYUNhMzBXZWtUeERrZmRZMHE0NEVJX9IBngFBVV95cUxQQlQ0dEJDR29aQW9UZWo1VkVPR3ZUNk1ab3RRUzhncGU0Nm1NTFlLNHhpUmp5cXNEQzZMeFhRNlhCcmxBRVM4Mlcxa05PbjVoZWVtbHNnTkYzRGdyd2l0X1JxYzFiaE13UnMwSkVlczJBWGJPM3ZJVVgzZjN6dXkxbTkzR0owRUpEdl9SWmxwZGNzUUp4OUJzQUNITGI5Zw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Network to Get Major Boost With SSF Roadmap, Says Vitalik Buterin - CoinGape",
        "content": "On Sunday, June 30, Ethereum co-founder Vitalik Buterin published a blog post explaining the road ahead for Ethereum and how they might have to part ways with the epoch-and-slot mechanism of its existing rollup-centric roadmap. Buterin proposes a new SSF mechanism to improve the transaction time latencies of the order of hundreds of milliseconds or even less.\n\nEthereum Eyes Single-Slot Finality\n\nCurrently, the Ethereum Gasper consensus employs a slot-and-epoch mechanism wherein validators cast votes in each 12-second slot. Also, all validators get the opportunity to vote once, over 32 slots. Later, a PBFT-like consensus algorithm takes care after two epochs (12.8 minutes), thereby providing a strong economic assurance known as finality. However, there are two major concerns with this approach.\n\nadvertisement\n\nThe complexity and several interaction bugs between the two slot-by-slot voting mechanism as well as the epoch-by-epoch finality mechanism. The 12.8-minute finality period is pretty slow and inconvenient for the users.\n\nTo simplify this, Buterin proposes a single-slot finality mechanism similar to the Tendermint consensus, wherein Block-N is finalized even before the creation of Block N+1. The major difference from Tendermint is the retention of the “inactivity leak” mechanism. This will allow the Ethereum blockchain to continue and recover even if nearly one-third of validators go offline. Vitalik Buterin calls this a “Secure Speed Finality” SSF mechanism.\n\nAlso Read: Vitalik Buterin Spotlights Innovative Idealist DApps in Web3\n\nAddressing A Few Challenges With the SSF Mechanism\n\nVitalik Buterin also highlighted some key challenges associated with Single-slot finality (SSF) in the Ethereum ecosystem. He explained that the naive implementation of the SSF would require every Ethereum staker to publish two messages every 12 seconds, imposing a significant load on the Ethereum network. In his blog post, Buterin said:\n\n“While there are clever ideas to mitigate this issue, including the recent Orbit SSF proposal, it remains a challenge. Although SSF significantly improves user experience by accelerating ‘finality,’ it doesn’t eliminate the need for users to wait 5-20 seconds.”\n\nWhile implementing the SSF mechanism in Ethereum, Buterin suggests implementing Orbit-like techniques in order to reduce the total number of validators signing per slot and address the key goal of lowering 32 ETH minimum staking.\n\n“This approach might cause the slot time to increase to approximately 16 seconds,” added Buterin. However, he added: “Designs like Orbit SSF are very recent, suggesting that the design space of slot-and-epoch designs where something like Orbit SSF is the epoch is still quite under-explored”.\n\nThe Ethereum developers are still figuring out the ideal solution in order to improve the finality. Last month, Buterin shared updates made with Ethereum Layer-2 solutions. The Ethereum L2 activity has touched fresh all-time highs recently.\n\nEthereum is thriving as an ecosystem right now with L2 activity hitting fresh all time highs every other day and the L1 roadmap being executed on with laser precision Meanwhile, crypto twitter is acting like Ethereum is failing and in dire need of an emergency intervention — sassal.eth/acc 🦇🔊 (@sassal0x) July 1, 2024\n\nThe Ethereum Layer-2 Blast recently announced the launch of its native token and BLAST airdrop.\n\nAlso Read: ETH Price Shoots 5% As Whale Activity Spikes Ahead of Ethereum ETF Approval\n\nBhushan Akolkar Bhushan is a FinTech enthusiast with a keen understanding of financial markets. His interest in economics and finance has led him to focus on emerging Blockchain technology and cryptocurrency markets. He is committed to continuous learning and stays motivated by sharing the knowledge he acquires. In his free time, Bhushan enjoys reading thriller fiction novels and occasionally explores his culinary skills.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxPZkVKWEkyaE9rYUtVZWFtdHhXa1dxdmo3aG1GU2dMLVNqMVhyS1VERjFSTkNxQTlXdFdnY21UTTdDQVdKT2RUMFNlcmtFYXJjZHFOQWtiWTlDOTBQZ1hnSi05bkk2dDZEajViZVJxT2NPcDJFMDBKTzNFNUJ0aW1reWFnb0pQWTYyWjZYU0lJQTNGSmVSU2xTeG1QU0ZNc0NETnMxS09oam92TXdzeUxJa250LVhYeFoyVlRVaDNMY2g1ejJu?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETFs Trigger 40,000% ROI Potential For ETFSwap (ETFS), Filecoin (FIL), And Dogwifhat (WIF) - Techpoint Africa",
        "content": "Ethereum ETFs have received approval from the Securities and Exchange Commission (SEC) and are scheduled to launch on July 4th. The news of this approval has resulted in bullish swings for ETFSwap (ETFS), Filecoin (FIL), and Dogwifhat (WIF). Analysts believe these cryptos will yield up to 40,000% ROIs for investors.\n\nETFSwap (ETFS) Set To Generate 40,000% ROIs As More Investors Adopt Ethereum ETFs\n\nFor weeks, ETFSwap (ETFS) has been the receptor of mass hype and multiple accolades. This coin's integration of the exchange-traded fund (ETF) industry into its utility makes it a must-have token. As the metaverse waits eagerly for the launch of these Ethereum ETFs, investors gear toward ETFSwap (ETFS).\n\nThis crypto's primary aim is to completely revolutionize the current system of trading tokenized ETFs. Borderless ETF trade is possible with the platform’s high-quality AI-powered protocol. This protocol consists of the ETF Tracker and ETF Screener, which offer useful investment recommendations that are in line with market conditions.\n\nExcluding this scheme, Ethereum ETF investors are also dazzled by the platform’s unique perks. ETFSwap (ETFS) investors that contribute to the liquidity pool through staking events will receive an APR yield of 87%. ETFSwap (ETFS). They will also earn progressive trade perpetuals up to 10X via leveraged trading.\n\nThe presale of this token has a myriad of investors from multiple ecosystems, particularly Ethereum ETFs. ETFS is the platform’s cryptocurrency that grants investors access to all governing processes of the network. The token is available on the ETFSwap (ETFS) website for $0.01831, which may yield up to 40,000% when the event ends.\n\nFilecoin (FIL) Price Heads To The Moon As It Eyes $10 Value\n\nAnother cryptocurrency that has benefited from the Ethereum ETFs craze is the DeFi network, Filecoin. Filecoin has enjoyed a smooth ride in Q2, maintaining its green zone. Contrary to its Q1 performance, this altcoin has impressed investors by shaking off the bear's effects extensively.\n\nFilecoin is a blockchain-based storage system that functions as a secure unit for important market data. Its initial aim was to run as a subsidiary layer for IPFS and individual data storage. Filecoin (FIL) is the utility token of this chain that ushers investors into decentralized storage.\n\nAs market participants began to lose faith in its comeback, Filecoin surprised investors with an astonishing surge. Its incredible display has led to presumptions that the Filecoin price can overcome the bear while propping the bull. Filecoin currently trades at $4.46 and has continued to make attempts to recover its 2023 price of $10.\n\nEthereum ETFs Spark Dogwifhat (WIF) Buying Pressure\n\nThe price of the Dogwifhat (WIF) token has revolted against the plunging tide of the metaverse. On June 25th, Dogwifhat (WIF) began to trade above $2, breaking out of its previous descent. Meanwhile, on-chain analysis has disclosed that a likely Ethereum ETF enthusiast has acquired $4.67 million worth of Dogwifhat (WIF).\n\nThis acquisition indicates that a possible rally may be in sight. Evidently, Dogwifhat (WIF) is a forerunner of the 2024 meme coin comeback. Experts believe that this cryptocurrency may drive the revival of the Solana (SOL) marketplace and push it to a new all-time high.\n\nConclusion On The Capability Of ETFSwap (ETFS), Filecoin (FIL), And Dogwifhat (WIF) To Push Investors’ Profits By 40,000%\n\nThe crypto market has made a lot of buzz in the financial industry since Ethereum ETFs made headlines concerning SEC approval. This move has ignited global traffic as traditional investors seek alternative investment opportunities in cryptos like ETFSwap (ETFS). The presale of this token offers investors the opportunity to acquire the ETFS token at a discounted rate before it becomes too late.\n\nFor more information about the ETFS Presale:\n\nVisit ETFSwap Presale\n\nJoin The ETFSwap Community"
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxOQWNjWDN1dU5JQmFxVTRPS0ZwdUYzaEI2d093MU1FX2hGX1N3T081QWtoTEctbFR0OTMtbnphLWh4RFJvTW1WZFhqc0RmQ2drY2plaHBPX3VYdzdFSjFOUzd6QUN1QUdTZzNCemdJZ1ZheXhLdkJrX2VDZW54ZmdIVGp2RXdRU1dxbkRFcTBmN0wyTWpoQmpiYThGbS1qeEduWVJmclRDMkRqMnI2?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jul 2024 07:00:00 GMT",
        "title": "BlockDAG’s Presale Surges Beyond $54.9M Amid Ethereum’s Fluctuations and Polygon’s Strategic Advances - The Cryptonomist",
        "content": "SPONSORED POST*\n\nIn the fast-evolving realm of cryptocurrency, BlockDAG emerges as a beacon of innovation and success, with its presale now soaring past $54.9 million. As Ethereum struggles to maintain price stability below $3,500, and Polygon expands with Google Cloud’s recent endorsement, BlockDAG shines brightly.\n\nCurrently in its 19th batch, priced at $0.014 with the upcoming batch set at $0.015, BlockDAG has not only captured the attention but also the confidence of the global crypto community.\n\nEthereum’s Price Challenges Amidst Market Volatility\n\nEthereum’s journey through the crypto market remains turbulent as it struggles to break past the $3,550 resistance mark. Recent trading sessions saw Ethereum dip to $3,385, igniting cautious optimism among investors. The cryptocurrency now wrestles with a key bearish trend line established at $3,465 and trades below the 100-hourly Simple Moving Average.\n\nTechnical analysts suggest that if Ethereum fails to breach the $3,465 and $3,550 resistance levels, it could face potential declines, targeting major support levels at $3,350, with further dips possibly reaching $3,220 and $3,100.\n\nPolygon Pushes Forward with Notable Ecosystem Developments\n\nPolygon continues to stand out as a prominent Layer 2 scaling solution for Ethereum, strengthened by significant milestones such as Google Cloud’s role as a validator. This collaboration not only enhances the network’s security but also boosts its technological robustness, broadening Google Cloud’s involvement in blockchain technology.\n\nThe recent launch of Astar Network’s Astar zkEVM with Gelato, and the introduction of native USDC on Polygon, supported by Circle, marks crucial steps in enhancing liquidity and facilitating institutional transactions. These developments, combined with a vibrant community growth of 29% and an increase in MATIC’s price to $0.5607, underscore Polygon’s expanding influence and innovation in the blockchain space.\n\nBlockDAG Dominates with Robust Presale and Community Engagement\n\nBlockDAG continues its impressive trajectory in the cryptocurrency presale arena. With over $54.9 million raised and maintaining strong sales momentum across 19 batches, BlockDAG’s appeal is undeniable. The presale has successfully marketed over 11.8 billion BDAG coins and over 8250 miners, amassing an additional $3.5 million in fundraising. With a price surge of 1300%, BlockDAG is quickly becoming a formidable force in the cryptocurrency market.\n\nThe robust support from crypto influencers and the broader community amplifies BlockDAG’s market presence, enticing a wider audience to its innovative approach. These strategic endorsements have positioned BlockDAG as the breakout cryptocurrency of 2024, promising substantial returns for early investors. As it progresses toward batch 45, market experts anticipate a potential 30,000x return on investment, illustrating the exciting and lucrative future that lies ahead for BlockDAG.\n\nAt the core of BlockDAG’s impressive performance is its unique Directed Acyclic Graph (DAG) technology, which allows it to handle between 10,000 and 15,000 transactions per second (TPS). This exceptional capacity ensures nearly instantaneous transaction confirmations, crucial in high-stakes, time-sensitive scenarios.\n\nSuch technical prowess makes BlockDAG an attractive choice for investors prioritizing efficient and rapid transaction capabilities. Furthermore, BlockDAG’s commitment to maintaining low transaction fees and high scalability makes it a versatile and powerful platform, suitable for a wide range of applications from microtransactions to large-scale business operations.\n\nAs Ethereum navigates its price fluctuations and technical challenges, and Polygon advances its ecosystem with innovative partnerships and technological integrations, BlockDAG sets a new standard in the presale landscape. BlockDAG’s presale success, characterized by its rapid growth and strong community trust, highlights its potential to not only compete with but potentially outperform established cryptocurrencies like Ethereum and emerging platforms like Polygon.\n\nFinal Analysis: The Rising Star of Crypto Presales\n\nBlockDAG’s journey through its presale phases clearly marks it as a standout performer in the 2024 crypto market. With $54.9 million raised, substantial community and influencer support, and a promising technological foundation, BlockDAG is well-positioned to revolutionize the cryptocurrency presale paradigm.\n\nIts robust performance and promising ROI potential establish it as a prime investment opportunity for those seeking significant returns in the crypto world. For investors and crypto enthusiasts looking for the next big breakthrough, BlockDAG offers a compelling narrative and an even more promising future.\n\nJoin BlockDAG Presale Now:\n\nWebsite: https://blockdag.network\n\nPresale: https://purchase.blockdag.network\n\nTelegram: https://t.me/blockDAGnetworkOfficial\n\nDiscord: https://discord.gg/Q7BxghMVyu\n\n*This article was paid for. Cryptonomist did not write the article or test the platform."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxOOVJMM0duUnpXdkJncFNYdm5VeGdBV19mZmk5djUzVUZaSF9zMG1xSlhtay05OFJIQjB3dVYzdjYzLXNCcnhaQ1lFcUZhNTVjTmRvMjIyZVZKVV9GUzVpTk5FdnRwUFQwZmxDNGRZaGt4Zm5DU1FlSk9rU0Z4bHp4eDhBV19FS1FEc2NTeWlOSUxfTkJjVGJrbWhIeDJxX0NVR1HSAacBQVVfeXFMTUdaWTFEWHJ4ODNocDZjT0swX1JVT1NhYTRHLUxDTWk0d09mdmlxZjZrTDRQX2NYZGVhWFU3WXFINi04RHdaNXZIS3h1eS10N3FCdXB3LTFweXVna0JXbDVZRW1RdUhBd285VmJtWlg1OWJfNURsNnQyQlh2MjhJVzlpS3MyMk1BVk1qNUJjSTREY1ZlV0x0b3B4dUVKYTJKSkNEdkhnT28?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Name Service (ENS) Outperforms Major Cryptos in Early July - Crypto News Flash",
        "content": "Ethereum Name Service (ENS) is a leading name in the blockchain industry, with over 2.14 million registered names.\n\nThe upcoming ENSv2 upgrade is eagerly anticipated for its focus on scalability and affordability.\n\nUnbelievably, Ethereum Name Service (ENS) has been one of the top gainers this year. Its token is at its highest level since January 2022, after rising for two weeks running. With the market’s attention on memecoins and AI, it was surprising when ENS rose to the top of the crypto market in early July.\n\nThis year, ENS has grown by an incredible 253%, much exceeding other cryptocurrencies like Ethereum and Bitcoin, which have risen by 57% and 47%, respectively.\n\nCoinMarketCap data show that the ENS price at the time of writing is about $32.53, representing a bullish position over the previous seven days with a 46.01% increase and a 27.41% rise in the previous 24 hours.\n\nUnderstanding ENS and Its Significance\n\nAmong the most well-known names in the blockchain space is Ethereum Name Service. With this site, users may quickly and cheaply register ETH domains to build customized Web3 identities like john.eth.\n\nThis function is essential since it gives the industry a memorable and simple identity in place of the usual random characters.\n\nIn addition, most blockchains—including well-known ones such as Optimism, Solana, Arbitrum, and Base Blockchain—can be used with ENS domains.\n\nOver the years, ENS has gathered 409 integrations and over 2.14 million identities. Its goal of simplifying the Web3 sector has won industry observers, including Vitalik Buterin, co-founder of Ethereum, approval.\n\nAnticipation of ENSv2 Upgrade\n\nA further factor driving up the price of ENS tokens is investor excitement over the impending ENSv2 upgrade. The emphasis of this improvement is on flexibility, cost, and scalability. Presently, developers are focusing on reserve resolution and name resolution enhancement.\n\nThough the roadmap suggests it will take a few months to deploy, the developers have not disclosed a precise timetable for the V2 upgrade."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxNZ2xnOGxjcTNOck9IU3dtWGlFbGN3TWJxajV1V1MzU214RnV5aXUxZk9Fa2NkY3dBN0pPd1poLXNmZ0RMa21CaUxVX2NpSFAzb1o1cjBzU0lPSklqdmYydmpwR3Z3NDNrZl9jUmZDQ0Z1T3FsRkttNm85OUluWEFLYmk2WkZaS1FVMTdUaHJCeVhoWGd5aENEN3ZOONIBoAFBVV95cUxPNDJnbHpZU2lGdEtObVFsTTVEcDdGVVdxVWlnZ01IZ2x0dTNyTnlXdUtWYm9HWUMtR0RIM0VlbW9TLTVlSC13bFJmVGhKNEU2LS1Pdm1OcThBZE82X0pkRXcxb1JUcGFDNXR2Zy1nVE1ILVFFNDRtaEFvVnpuXzVTQnNISTh1R3RwTFFxM2drZDM5Wk5xcGV0aDZkU1RldFFh?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jul 2024 07:00:00 GMT",
        "title": "What Bitcoin, Ethereum exchange flows say about the crypto market’s future - AMBCrypto News",
        "content": "An exchange flow metric showed that the local bottom might be in for BTC, ETH.\n\nThe market sentiment was not bullish and holder behavior at crucial support levels would be key for the next price move.\n\nBitcoin [BTC] and Ethereum [ETH] bulls struggled to shift the market dynamic in their favor. The large losses of the past ten days meant that the price was back at a support zone where buyers are expected to halt the sellers.\n\nEthereum’s MVRV and NVT ratios showed the asset might be undervalued. The liquidity pocket at $3500 could see a short squeeze, but momentum was bearish otherwise.\n\nMeanwhile, another BTC investigation showed that mining activity had receded and that miners were selling Bitcoin. However, the selling pressure had begun to drop in intensity over the past two days.\n\nAMBCrypto decided to look at the movement of both assets from exchanges to gauge the market sentiment. It revealed that bulls might not have too much to cheer for yet.\n\nWhat does the exchange netflow metric indicate?\n\nThe exchange net flows metric offers valuable insights into the market. When the flows are positive, it shows inflows are greater.\n\nThis in turn is a sign of potential selling pressure on the asset, as it implies participants are sending the crypto to exchanges to sell them.\n\nValues below zero mean that outflows are greater, which is a good sign for buyers.\n\nIt indicates that market participants are withdrawing their assets from exchanges, likely to place them in safer storage, and indicates accumulation.\n\nThe 30-day simple moving averages were used to better understand the exchange flow trends. The ETH inflows were considerable in mid-March and toward late May.\n\nBoth occurrences marked a local top for the price.\n\nIn the past month, the net flow was heavily negative, showing accumulation. Over the past eight days, the outflow has slowed down, but the 30DMA net flow remained in negative territory.\n\nMeanwhile, Bitcoin saw consistent accumulation in February and March. The 30DMA showed that the flow of BTC out of the exchanges continued to dominate.\n\nIn late April and on the 21st of May, there were spikes in the BTC inflow, but they were exceptions to the trend.\n\nAre Bitcoin, Ethereum headed for a consolidation?\n\nAMBCrypto’s examination of the in/out of the money data from IntoTheBlock highlighted key support regions.\n\nThe in/out of money around the price showed Ethereum has a strong bastion of support from $3080-$3180 and $3280-$3381. Similarly, the $3486-$3586 is also a staunch resistance.\n\nRead Bitcoin’s [BTC] Price Prediction 2024-25\n\nFor Bitcoin, the $59,450-$61,263 is support and $63,148-$64,960 resistance.\n\nThis meant that the current price consolidation of both these crypto market leaders could be confined within these levels and lead to a range formation."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxNeUwwNjhWRE5XcllvZmhIaW5UbUZiT3pwT1ZPc1FlSmRqUTRlaFFsUkZKbE9ZM0ttSWJHTE1JdU9zcWFDeXNJMjBaZW5LVVJEaHotT29ZeE0xbUhFaFpaRFdraExrRklEbGJ5WDNhN3NnYURkeGV4MUNXY0NYR3N2UUtZZWlrdWVJQlRpLVpmLXHSAZYBQVVfeXFMTW4wVExzWlUyNllaUm1oR3JGSWo2WGN3SDZTM0J0aXd5SGRiTVlJdHNVV3k0aTJnMEdISGRBZEFOUVdWblQ0QWhhWmxLYlp0VjBfcUpGUDlldURyNEhGUnlaSktoWFhCd1k1OVJlQTRNWEVPbkl4bHQ2U2h0UWhfMkNLNldhQVgyRjluaFFCV1RYNUZsWlRn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jul 2024 07:00:00 GMT",
        "title": "Solana vs. Ethereum: Assessing how DEX volume has impacted SOL, ETH - AMBCrypto News",
        "content": "Solana outperformed Ethereum in terms of DEX volumes.\n\nThe price performance of both SOL and ETH tokens were positive over the last 24 hours.\n\nSolana [SOL] and Ethereum [ETH] have been one of the top cryptocurrency networks in the space.\n\nEven though Ethereum has managed to retain its dominance in various areas for the most part, recent developments suggest that Solana could catch up with Ethereum soon.\n\nSolana shows promise\n\nData from DefiLlama showed Solana surging ahead of Ethereum in daily DEX trading volume. Solana captured a significant lead, processing $1.148 billion compared to Ethereum’s $745 million.\n\nThis marks a shift in dominance within the DEX landscape, and could signal a growing preference for Solana’s faster transaction speeds and lower fees.\n\nIt’s worth noting that Ethereum remains the leader in overall DeFi total value locked (TVL), but Solana’s strong showing in DEX volume could help propel the protocol to new heights.\n\nEven though Solana’s TVL was far behind Ethereum, Solana blew Ethereum out of the water in terms of overall activity.\n\nIn terms of daily active addresses, the overall number of addresses on Solana had grown to 1.4 million whereas, the number of daily active addresses on the Ethereum network were 644,000 at the time of writing.\n\nIn terms of daily transactions, Solana showed significant dominance. At the time of writing, Solana 42.9 million transactions that were occurring on its network. Whereas on Ethereum, the number was around 1.1 million.\n\nLooking at the finer details\n\nEven though Solana managed to outgrow Ethereum in terms of activity, it is important to note that Layer-2s have not been taken into consideration while calculating activity.\n\nL2s like Arbitrum [ARB] and Optimism [OP] act as scaling solutions for Ethereum, processing transactions off the mainnet but still leveraging Ethereum’s security.\n\nActivity on these L2s translates to interest in the Ethereum ecosystem as a whole.\n\nHowever, Solana’s impressive numbers raise questions about long-term sustainability.\n\nThe high transaction volume might be partly driven by speculative activity or meme coin trading, which may not translate into long-term value creation.\n\nIt’s crucial to see if this activity translates into building solid DeFi applications and attracting established projects.\n\nMoreover, Solana’s architecture boasts faster speeds and lower fees, but it has faced criticism regarding network congestion and outages in the past.\n\nIs your portfolio green? Check out the SOL Profit Calculator\n\nIf outages continue to occur on the Solana network, it could thoroughly impact the sentiment around Solana network and may steer some users away from the protocol.\n\nAt press time, both SOL and ETH tokens had benefited from the recent bullish sentiment rising in the crypto markets and grew by 6.6% and 3.4% respectively in the last 24 hours."
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTE5CT1dlY0piMGVaV1RTcmxqY3pRSFoyQVg2WHpkUTFXbDctaWl0Z2NxY0FOdF9SdEhpNm9YUk9WZWZQQkhmZlc0a2MxWmZpY0xYSDE1SEpway1yWG5mVmRuMVo1S01MUVFaZVhmQ3BENzdjUW_SAXhBVV95cUxNV2NmZVl2UmU4M1NQVFk1bjJDMzJOQVVPUGJoWHlUU1JFNWNxN2MwUWxpbWRTeS1LOE5ueGFndWkyMTBaXzJYZFdDZGFicVZhVTlrZG0yUjdEVVV4REZoRGxTYkpFWkVydFp3cXJHN3VMcXNfMXlOdUk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jul 2024 03:53:41 GMT",
        "title": "Ethereum Price Bounces Back Yet Lacks Strong Bullish Drive - NewsBTC",
        "content": "Ethereum price is attempting a fresh increase above the $3,450 resistance zone. ETH must settle above $3,550 to continue higher in the near term.\n\nEthereum slowly moved higher above the $3,450 zone.\n\nThe price is trading above $3,450 and the 100-hourly Simple Moving Average.\n\nThere was a break above a key bearish trend line with resistance near $3,415 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair must clear the $3,520 and $3,550 resistance levels to continue higher.\n\nEthereum Price Faces Resistance\n\nEthereum price started a decent recovery wave above the $3,400 level. ETH even cleared the $3,420 level to move into a short-term positive zone like Bitcoin.\n\nThere was a break above a key bearish trend line with resistance near $3,415 on the hourly chart of ETH/USD. The pair even cleared the $3,500 resistance zone. A high was formed at $3,516 and the price is now consolidating gains.\n\nThere was a move below the $3,500 level, but the price remained above the 23.6% Fib retracement level of the upward move from the $3,350 swing low to the $3,516 high.\n\nEthereum is trading above $3,450 and the 100-hourly Simple Moving Average. The current price action is positive and calling for more upsides. On the upside, the price is facing resistance near the $3,500 level. The first major resistance is near the $3,520 level.\n\nThe next major hurdle is near the $3,550 level. A close above the $3,550 level might send Ether toward the $3,650 resistance. The next key resistance is near $3,720. An upside break above the $3,720 resistance might send the price higher. Any more gains could send Ether toward the $3,880 resistance zone.\n\nAre Dips Limited In ETH?\n\nIf Ethereum fails to clear the $3,550 resistance, it could start a downside correction. Initial support on the downside is near $3,480. The first major support sits near the $3,440 zone and the 50% Fib retracement level of the upward move from the $3,350 swing low to the $3,516 high.\n\nA clear move below the $3,420 support might push the price toward $3,350. Any more losses might send the price toward the $3,320 level in the near term.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is gaining momentum in the bullish zone.\n\nHourly RSI – The RSI for ETH/USD is now above the 50 zone.\n\nMajor Support Level – $3,420\n\nMajor Resistance Level – $3,550"
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxQR3Rwdi1Gd3VRS2RLSkxtQmNqZ1Jka3hSamxyOERuV3c0Qk90WjBQeEFOS2ZzcG9hUkxld21hN2pFdmVLdGlMUWVtT0YzWjY4eGQwV2xCajlVUmNCTlJ4NXdQWE5uV2hqMzNLaWxobzhBRWZDSktxbEFiYVRmQ3p4dFZwemZXeU1fUnlnY3pta2FlUXBuQmE5cDdOOEx0UQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Jul 2024 07:00:00 GMT",
        "title": "Massive Whale Withdraws 60K ETH From Bitfinex Amid Ethereum Price Uptick - Coinfomania",
        "content": "Trending memecoin Shiba Inu started the week in the red zone after a massive 100 billion SHIB tokens were transferred to the Coinbase exchange. Amid the ongoing price corrections experienced by the global crypto market, large investors are moving huge amounts of tokens, sparking speculations about the intent.\n\nToday, May 13, the general crypto market cap has fallen by 0.66% over the last 24 hours to $2.24 trillion. The prices of top cryptocurrencies like Bitcoin and Ethereum have dropped significantly. According to CoinMarketCap data, BTC and ETH are currently trading at $61k and $2,900 respectively. Consequently, the sentiment across the crypto market as measured by the crypto fear and greed index, rests at 52 points, indicating a period of investor uncertainty. Moreover, SHIB whales are carrying out hefty transactions regardless of the state of the market. Let us look at the transaction in detail.\n\nSHIB Whale Moves 100 Billion Tokens to Coinbase\n\nEarlier today, the blockchain transaction tracker, The Data Nerd, reported that it had spotted a mouthwatering amount of SHIB tokens changing hands. According to the provided data, the whale transferred a staggering 100.4 billion SHIB tokens from his wallet to the centralized exchange, Coinbase. Following this, the price of the token has suffered a loss of up to 3%.\n\n7 hours ago, a whale 0x462 just deposited 100B $SHIB (~$2.24M) to #Coinbase. Within a week, he accumulated those tokens with avg entry $0.00002408.\n\nIf sold at current price, he will have a small loss ~$178k. His address:https://t.co/NrkJwBbVb1 pic.twitter.com/cAJ7FZdRXg — The Data Nerd (@OnchainDataNerd) May 13, 2024\n\nThe aforementioned tracker also mentioned that the whale had accumulated the Shiba Inu tokens over the week at an average price of $0.00002408. Notably, if the whale sells the holding now, he will suffer a loss of up to $178,000. With this, it is safe to say that the latest transaction is not intended for sale, but could be a part of a distribution strategy by the investor.\n\nA further look at the whale’s wallet reveals that he has other tokens in holding, however, most of the recent transactions involved SHIB. For example, between May 5,6, and 7, the whale accumulated over 100 million SHIB tokens as revealed by the OKlink tracker.\n\nSHIB Price Dynamics Amid Large Transaction\n\nMeanwhile, this crypto move to the Coinbase exchange has sparked discussion across the SHIB community about the effect on the price of the token. According to CoinMarkeCap data, the price of SHIB has slumped by 3% over the last 24 hours. This is worrisome particularly because the dedicated Shiba Inu community has been anticipating a price rebound. As a result of this, its market cap has plummeted by 2.5% to $13 billion.\n\nConversely, the activities surrounding Shiba Inu, as measured by its trading volume, have witnessed a spike within the recorded time. Per CMC data, SHIB has a 24-hour trading volume of $233.7 million, signifying a 32.11% increase over the last day. Lastly, according to Coinglass data, SHIB’s open interest dropped by 1.68% to $57.99 million, and the number of derivatives increased by 46.46% to $84.39 million."
    }
]