[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTFBSRi1wbllzS0FaRGkyV1ZzbkhQTml2SDY5R2ZZRHcwWlNQWHFhbzJiYV85SVFkLVlObHpQc3dkbXFvcU5tYWhsNFp3V0pKSUxzdy1ZNkdOVHBwVnhrX3dpTjVpQzFkSzZFTVVONEdpZGlEWEcyTHN6WDFRUm85UQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 May 2024 07:00:00 GMT",
        "title": "Enterprise Ethereum Alliance (EEA): Meaning, Examples, and Membership - Investopedia",
        "content": "What Is the Enterprise Ethereum Alliance (EEA) ?\n\nThe Enterprise Ethereum Alliance (EEA), launched in February 2017, brings together various start-ups, Fortune 500 companies, technology vendors, academics, and Ethereum subject matter experts to work on Ethereum as an enterprise-grade technology.\n\nKey Takeaways The Enterprise Ethereum Alliance (EEA) \"...is a member-led industry organization whose objective is to drive the use of Ethereum blockchain technology as an open standard to empower enterprises.\"\n\nThe EEA's mission is to deliver an open, standards-based architecture and specification to accelerate the adoption of Enterprise Ethereum.\n\nThe EEA provides its members a community and access to educational material and various technical and media resources.\n\nHow the Enterprise Ethereum Alliance (EEA) Works\n\nAlthough many technology giants and businesses had been supporting Ethereum via Cloud services and working towards its adoption, most efforts towards its scalability, privacy, and interoperability remained scattered until the Enterprise Ethereum Alliance came into being.\n\nThe alliance aims to build, promote, and support Ethereum blockchain technology best practices, standards, and a reference architecture capable of handling real-world applications and usage.\n\nLaunched in 2015, Ethereum is a blockchain-based, decentralized software platform that enables smart contracts and Distributed Applications (dApps) to be built and run without downtime, fraud, control, or interference from a third party.\n\nEthereum is not just a platform but also a Turing complete programming language running on a blockchain that helps developers build and publish distributed applications.\n\nThe potential applications of Ethereum are wide-ranging, and this has attracted several enterprises to explore the technology. Ether, the cryptographic token used on the Ethereum platform, is the second most popular cryptocurrency in terms of market capitalization, with an aggregate market cap of around $456 billion as of May 2024.\n\nEEA Efforts\n\nRecently, member companies (and others) have initiated and worked on multiple pilot projects covering areas such as supply chain provenance tracking, inter-bank payments, reference data, securities settlement, and many others.\n\nHowever, real-world enterprise use calls for collaborative efforts to build architectures allowing permissioned and public Ethereum networks. The formation of EEA is an important step in this direction.\n\nThe EAA also provides education and training for members. The organization publishes newsletters, videos, and webinars as part of its public service mission.\n\nEEA Membership\n\nThe board members of the Enterprise Ethereum Alliance included Accenture, BlockApps, ConsenSys, Ethereum Foundation, EY, J.P. Morgan, Microsoft, and Santander.\n\nAccording to the EEA website, there are over 100 associate and organizational members of EEA. Associate members are represented by the Blockchain Research Institute, Hyperledger, and SAE ITC. Social impact partners include the Blockchain for Social Impact Coalition and the Decentralized Identity Foundation.\n\nThe members of EEA represent varied businesses from every region of the world, including technology, banking, government, healthcare, energy, pharmaceuticals, marketing, and insurance.\n\nWith a focus on solving the real-world challenges of deploying Ethereum at an enterprise scale, the Enterprise Ethereum Alliance is an important initiative in the adoption of blockchain and decentralization.\n\nEEA Benefits\n\nOrganizations that join the EEA get to leverage Ethereum technology in their business operations. It also exposes them to over 20,000 Ethereum community members. Members can network, establish partnerships, and showcase technology within the largest Ethereum ecosystem.\n\nEEA membership provides market opportunities through branding, speaking, and advertising, and facilitates building solutions on globally trusted EEA standards. The EEA also offers speaking and advertising opportunities at events, RFP inclusion, and prominent placement in the Ethereum Ecosystem stack.\n\nEEA membership also drives industry adoption by contributing to best practices and utilizing EEA resources to design enterprise-level solutions. Members participate in working groups to address Ethereum challenges, vote on technical developments, and access the EEA Testnet for testing. EEA even offers certification to ensure solutions meet industry standards and interoperability requirements.\n\nFinally, EEA members can join interest groups, access member service discounts, and use EEA branding. Members can access the global developer community of 3,000+ contributors and 15+ user groups across 25 industries and six continents to enhance collaboration. To gain access, EEA provides a password-protected member collaboration site.\n\nWhat Is the Ethereum Enterprise Alliance? The EEA is an organization that collaborates to promote the Ethereum ecosystem for business uses.\n\nWho Are the Partners of the Enterprise Ethereum Alliance? There are over 100 member organizations partnered with the EEA. Notable members you may recognize are Ernst & Young, FedEx, Microsoft, and VMWare.\n\nWhat Are the Main Objectives of the Enterprise Ethereum Alliance? The alliance is a group of organizations interested in using the Ethereum blockchain and ecosystem to deliver business solutions.\n\nThe Bottom Line\n\nThe Enterprise Ethereum Alliance (EEA) is an industry-led organization. Its objective is to promote using the Ethereum blockchain to empower enterprises. The EEA works to deliver an open, standards-based architecture created to accelerate the adoption of Enterprise Ethereum in the business world."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMia0FVX3lxTE1FMjV1SGZxWWFtU0Q2TlZfMGlxY2E0QVJDQmpLRlZyQ3huTlFydmRXQ3YtWGxOeEdTOVJpWHVOc1dOdzBmdUxsajJ2azd4LTFzMFBFSzRTcGl3OUVEUEh6V2ZUd3JCV2dBdGgw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 May 2024 07:00:00 GMT",
        "title": "Ethereum devs set Pectra upgrade for Q1 2025 - Crypto Briefing",
        "content": "The upgrade will replace EIP-3074 with EIP-7702, proposed previously by Ethereum developers, including Vitalik Buterin.\n\nShare this article\n\nEthereum’s anticipated Pectra upgrade is now scheduled for release by the end of Q1 2025, according to recent updates from Ethereum developers. Pectra is the next major milestone on Ethereum’s development roadmap, following the Dencun upgrade which was successfully deployed in March.\n\nSome more up to date thoughts the next hard fork after Cancun, Pectra (Prague + Electra):\n\n* Ship Pectra by end of Q1 2025.\n\n* Include PeerDAS for Rollups to scale.\n\n* Include EOF for improving the EVM on both L1 and L2. Longer doc inside.\n\nExcited for the conversation to continue. https://t.co/lNwYg0I4vj pic.twitter.com/80dJfALaSv — Georgios Konstantopoulos (@gakonst) May 23, 2024\n\nThe decision comes after Ethereum developers evaluated multiple timeline scenarios. The team has opted against a rushed release before Devcon in November 2024, favoring a more cautious approach that allows for the inclusion of additional, impactful user features.\n\n“We are observing that this is also what happened with Cancun, so being realistic, my vote would be to aim to ship Prague in Q1 2025. With today’s scope, delaying Prague seems to have marginal impact on users and allows us to consider expanding the scope to include more impactful features for users,” Ethereum developers noted in a document.\n\nDevcon is the largest developer summit in the Asia Pacific region. This year, the event will take place in Bangkok, Thailand, from November 12-15, aiming to bring together developers, technology leaders, and dev-tool companies to learn, discuss, and debate the key opportunities and challenges in the developer ecosystem.\n\nAvoiding releasing the Pectra upgrade before/during Devcon will allow the developer team to effectively monitor the execution of Pectra.\n\nDuring the deployment of Dencun on the Goerli testnet in January, Ethereum developers encountered difficulties achieving consensus within the expected timeframe. The issue was then resolved, allowing the Goerli testnet to finally reach consensus.\n\nIn addition to the upgrade timeline, the focus is on improvements in the consensus layer scope and execution layer scope. Developers aim to integrate PeerDAS into Pectra to enhance Ethereum’s Data Availability capacity ahead of the Osaka upgrade, as noted in the document.\n\nEthereum’s Osaka upgrade is a future hard fork that is expected to include features that were previously considered for the Pectra upgrade but have been postponed. Specifically, the Osaka upgrade is likely to include the implementation of Verkle Tree, a new data structure designed to enhance Ethereum’s scalability and decentralization.\n\nDevelopers also considered the inclusion of EOF to improve smart contract security and developer experience, as well as other enhancements like replacing EIP-3074 with EIP-7702 for better account abstraction compatibility, and patching EIP-2935.\n\n“We need to decide on EIP7702 on ACDE, and if so, implement it as a replacement for EIP-3074. We think it makes sense to do so as it’s a more native-AA compatible solution because of the new transaction type vs an opcode,” Ethereum developers wrote.\n\nEIP-7702 is a new transaction type proposed by a group of prominent Ethereum developers, including Vitalik Buterin, earlier this month. The proposal is expected to bring similar benefits to EIP-3074 while addressing its potential risks."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxQeGg2clVRVmNsdTRaYy1Xc2U2Z3cyM2hBeWJtdlVUajlPTlBfTmhCUXdESGN3TFlTTG1aZVhTT1c2R2wtN2pRSW80eWhOaHlaOUhldV96N3llSHd4c1Bhd0U0TG9KLUkxeEpCVVNnZVFwRkc0M3JJOG0ydGhVcmhDT1Q3akRUSnowdmR6U3Z1NkN5NDZG0gGaAUFVX3lxTE9XSVJtZnRYUUFYRG51ajFHbFhmRmJYNEtjenkwZDNPRHV1Zm5JQjVmS1Rpdzg0emFjNFBjaVhtVlhIM3E3V2JiWEcycGJ2MWQ0UEJBRGdtUDc5OElJNk00UkNISkNSNlVXbF9aTS1fZUxnNHI2eTZtRk4wakxIdDcyUXpTOUpnT0FORFlSWTk0S1RKQ3haR1lEYWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 25 May 2024 07:00:00 GMT",
        "title": "Ethereum ETFs Are Here. Will ETH Be Bullish or Bearish? - Blockhead",
        "content": "The crypto market was filled with euphoria over the past day with the approval of spot Ethereum ETFs by the U.S. Securities and Exchange Commission (SEC). This came after months of speculation on the possibility of Ethereum ETFs.\n\nDespite the wave of joy that rippled across the crypto market, ETH’s spot market price responded sluggish with buyers unable to seize the bullish sentiment. ETH’s price traded between $3.5k and $3.9k during the time.\n\nHow will the ETF approval after Ethereum’s price action in the short and long term?\n\nETH Move Priced In Before ETF Approval\n\nA look at the ETH price action on the four-hour timeframe showed that buyers could have seized the initiative, based on social sentiment to register a significant pump ahead of the approval.\n\nETH/USDT on TradingView (4H Timeframe)\n\nOn 20 May, ETH pumped 15% rising from $3.1k to $3.7k with the Relative Strength Index (RSI) noting the buying strength by rising to 93. Similarly, the Chaikin Money Flow (CMF) surged to a monthly high of +0.53.\n\nHowever, the aftermath of the ETF approval showed profit taking moves with price dropping sharply below the $3.7k support level. This presents two trading plays for ETH, based on the short term and long term.\n\nShort term, ETH could dip from $3.7k to $3.4k offering 6.6% profit opportunities. From the $3.4k support level, ETH could go on a strong upward move toward a new all-time-high (ATH) above $4k for 12% profit.\n\nOpen Interest Supports Short Term Bearish Outlook\n\nETH Open Interest | Source: Coinalyze\n\nData from Coinalyze showed that market participants in the futures market leaned bearish in the short term with the Open Interest dropping by 3.49% over the past 24 hours.\n\nShorting ETH over the next few days could yield the best profit making opportunity on the altcoin before the Ethereum ETFs start trading, driving bullish sentiment in the long term.\n\nDisclaimer: This article does not constitute trading, investment, financial, or other types of advice. It is solely the writer’s opinion. Please conduct your due diligence before making any trading or investment decisions."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxNSTBEZU54c2NYNmVOLTlZM042ZGtGRFZwbWVLQndMaDdDeEo5dVFmU2l6bk01NVBPXzVNMVhxQ1dWV2VfektsYVIyV3luclBuenJERXVDVmYzZFAwZVN6LWxDQ3dvZ3doWnJlNGc5cy0wbE1qYVZTdDRFZ1htb0N4c1pFbzRaeVhPNDhiX2duOGTSAZYBQVVfeXFMTm5DbmZ3Y3k0WkxKZ0N6LVdUZWtPTDBMX0Iyd0ZLQmJQQWtBck9POW1hd2IwVU1OQ25wUE1wUkExaVVoUlAyTV9jbFNPcVFmbFE0LTFVaERUNlhsaEZsU2dOampZSlZBd2JUV0hfUFF5djE5WnlxQmRZd0dSV05TUFFicXNpbDFXMmtMdnJhUElkRm4tTDJR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 25 May 2024 07:00:00 GMT",
        "title": "ETH vs. ADA: Is Cardano or Ethereum a Better Investment in 2024? - CryptoPotato",
        "content": "Markets got a big spike in Ethereum price this week on crypto exchanges. What’s behind it and what factors can investors take into consideration to determine whether Ether or its friend Cardano is the better buy?\n\nEthereum has a birthday coming up on July 30. It was launched in 2015 to create a “world computer” with the same Web3 blockchain properties as Bitcoin has for storing cash and making payments.\n\nCardano was launched on September 23, 2017 by initial coin offering (ICO) and founded by an Ethereum co-founder, Charles Hoskinson. Today it’s the 10th largest cryptocurrency by market capitalization.\n\nEthereum Market Cap (May 22): $451.8 billion\n\nCardano Market Cap (May 22): $17.2 billion\n\nCertain differences between the two cryptocurrencies are an advantage for one or the other and a good reason to be bullish or bearish for ETH or ADA tokens.\n\nBut some of the two networks’ differences are tradeoffs that are more complex to evaluate as yielding an advantage for either crypto. Here are 7 key factors at play in the future Ethereum price against Cardano:\n\n1. ETH vs. ADA – Technical Analysis (a tie)\n\nEthereum price is nearly all the way back to its ATH (all time high) after spiking this week on Ethereum spot ETF buzz. Cardano has a long way to go. That might actually be more bullish for ADA, with more upside left in its price.\n\nThe recent Ethereum ETF approval will shake up the entire meta for investing in Ether. If bulls take the price past $4,000, another 12.5% increase would pump ETH to $4,500— within striking range of the previous Ethereum ATH of $4,721 in Nov. 2021.\n\nForbes recently mentioned an Ethereum price prediction of $5,000 by the end of 2024. Bitcoin ETF issuer VanEck predicts $11,800 by 2030. An even more bullish outlook forecasts $10,000 ETH by the end of the year.\n\nOver the short term, Cardano technical indicators and moving averages over the weekly span recommended “Sell” on Thursday. Meanwhile, Ethereum technical indicators for the seven-day span recommended “Strong Buy,” according to data from Investing.com.\n\n2. Ether Spot ETF – Regulatory Analysis (bullish ETH)\n\nThere’s no denying it. Charles Hoskinson would certainly agree: U.S. regulators seem to favor Bitcoin and Ethereum over Cardano and other DeFi networks.\n\nThe SEC said okay to Ethereum futures ETFs in October, revealing it didn’t seem to think of Ether as an unregistered security. However, the U.S. regulator has classified Cardano and other cryptocurrencies as unregistered securities in lawsuits against multiple blockchain companies, while ignoring Bitcoin and Ether.\n\nAs Fortune Magazine reported on May 1, “Furthermore, despite launching a number of lawsuits against crypto companies since April 2023, the agency has never named Ether to be a security in its complaints.”\n\nThe SEC lawsuit against Ripple has taken years (since Dec. 2020) and still has not yet been resolved. It is costly and leaves the future unsure for the currencies under the government’s crosshairs.\n\nMarkets abhor uncertainty.\n\nIt may not be fair, but it’s a bullish factor for ETH and bearish for ADA.\n\n3. ADA vs. ETH – Fundamental Analysis (a wash)\n\nFundamental analysis is the preferred method of investors who are not total degenerates. Instead of chart technical analysis or meme currency voodoo economics, the fundamentalist looks at an investment prospect and asks what would “The Intelligent Investor” author Benjamin Graham do if he were here?\n\nGraham says:\n\n“The intelligent investor is a realist who sells to optimists and buys from pessimists. In the short run, the market is a voting machine but in the long run, it is a weighing machine.”\n\nIf a business’s expected future revenues discounted to the present day exceed its current market value, then it may be a good investment. If they match or fall short of the business’s market cap, then it may be a poor investment.\n\nADA: $263.8 million TVL (3% annual reward rate + 121% annual growth rate) / Market Cap: $16.4 Billion\n\nETH $64.9 Billion TVL (5.5% annual reward rate + 145% annual growth rate) / Market Cap: $453 Billion\n\nGoing by the data above without any further context, it appears Cardano would be the winner, because its inflows make up a much smaller portion of its market cap than Ethereum (0.019 to 0.22), but only if we expect it to grow at the same rate as Ethereum in the future.\n\nThe lopsided institutional adoption between the two will make that difficult for Cardano unless it finds a use case, a feature/benefit, and a narrative that shakes up the retail Internet markets for cryptocurrency.\n\n4. Cardano vs. Ethereum – Gas Fees (cat’s game)\n\nThere are lower and more predictable fees on Cardano, but higher fees on Ethereum are also a feature, not necessarily a bug. They make it more expensive to misuse the network for cybercrime that doesn’t pay, so it’s more secure. Big institutions like that.\n\nThat’s one reason why the industry leader, Bitcoin’s slow, expensive network, with a low transaction bandwidth holds its capital so well. In many ways these built-in costs qualify participants better than Know Your Customer policies and automatically and without discriminating on any basis other than ability and willingness to pay the network’s fees.\n\nStill for newcomers, enterpreneurs, startups, and investors starting out with a smaller cash pile, smart contract blockchain networks with lower fees like Cardano have an advantage. Transaction fees on both networks are highly variable and spike during periods of high network use.\n\n5. Ease Of Use – Cardano (another tie)\n\nSome people in Web3 feel Ethereum has an ease-of-use problem. It’s become too overgrown with complicated, byzantine layers on top of layers, creating a steeper learning curve and potential security threats.\n\nBlockchain advocate Daniel Cawrey wrote in a recent opinion article on Blockworks:\n\n“Ethereum is becoming a multilayered lasagna-like system whereby complexity and fees are pushing people to the margins, causing interoperability and security concerns.”\n\nWhile true, much like Ethereum’s higher transactions fees— the complexity of Ethereum may be a reason to be bullish for ETH. It could simply be proof of the network’s success. As Cawrey acknowledges in the piece, the network is beginning to achieve its “world computer” concept.\n\nAny computer architecture expert would be hard-pressed to explain how a Turing-complete global computer that anyone can use on a peer-to-peer network would become anything but a flying spaghetti monster of complexity.\n\n6. Ether vs. Cardano Whales (bullish ADA)\n\nA massive 15,000 ETH whale deposit to Kraken on May 18 spotted by Whale Alert suggested a bear run on Ether by whales could be incoming, but after the SEC approved the spot Ethereum ETF a surge in whale-sized transactions has been net positive for the network, according to IntoTheBlock data.\n\nMeanwhile, Cardano whales have been extremely bullish for ADA in May. They boosted holdings in Cardano tokens by 11% in a month. Whales tend to be smart money with some of the most advanced analytics and market outlooks to know what they’re doing, so that’s positively bullish for Cardano.\n\nhttps://x.com/intotheblock/status/1790774801277042863\n\n7. Ethereum vs. Cardano Memes (bullish ETH)\n\nMeme coins are a definite advantage for Ethereum. While Cardano does have meme coins, none of them are notable and they have not topped the market cap charts like Ethereum’s SHIB, PEPE, and FLOKI.\n\nCardano has succeeded in making a simpler, lower-fee Ethereum, but crypto markets tend to reward projects that leaven their technology with some meme karma. Maybe an Orange Pill Moon Boys NFT collection or something with a dog on it would do the trick."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMibEFVX3lxTE1POEJkS3ZkRWtibGZWeEt1bWhMd0NZQmJMeUJTczJzUUpheVhUNnF3bU1fRGw1azJrQ0dJZjh5TGJ2cHk2ejg4M0lrN2Y3NEdhRjhibWpsOXpOTTNPYlBZckRDaS1TMEN5ZHQtcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 25 May 2024 07:00:00 GMT",
        "title": "How far will Ethereum (ETH) go? - Cointribune EN",
        "content": "Sat 25 May 2024 ▪ 10 min read ▪ by Thomas A.\n\nBull markets in cryptocurrencies generally benefit altcoins in a second phase. In the month of May, Ethereum (ETH) performed over 15%, and nearly 65% since the beginning of the year. This resurgence of Ethereum comes after the SEC approved the establishment of ETFs on the world’s second-largest cryptocurrency. While the correlation between Bitcoin and Ethereum remains high, the cyclicity of Ethereum’s price seems to act with as much precision in the structure of this bull market. Decoding the indicators and the dynamics of Ethereum’s price.\n\nSoon an ETF to boost the market?\n\nAs with Bitcoin (BTC), the U.S. Securities and Exchange Commission has approved the establishment of an ETF on Ethereum. Thus, this decision will allow major global managers to expand the cryptocurrency offerings to their clients. However, the SEC still needs to approve its commercialization…\n\n“This decision follows the successful introduction of Bitcoin ETFs in January, which quickly attracted $13.3 billion in net inflows, setting performance records for ETFs at their launch. The arrival of Ethereum ETFs could experience similar success, attracting a new influx of capital to the second-largest cryptocurrency.” Crypto: Ethereum ETFs approved by the SEC! – Cointribune\n\nThis same announcement for Bitcoin had particularly favored the price hike to historical highs. The arrival of an ETF on Ethereum thus leaves potential for a return to the November 2021 highs of $4,868. In May 2024, ETH thus represents nearly 17.7% of the market capitalization. This market share is still far behind Bitcoin, with a dominance near 53%.\n\nThe approval of Ethereum ETFs could thus instigate a catch-up effect compared to Bitcoin. Moreover, these ETFs could also be used to create ETFs representing a basket of cryptocurrencies in the future.\n\nTaking a look at fractals: the rise persists\n\nA major indicator for measuring the viability of the trend on ETH is to use fractals. Indeed, the Hurst exponent (read more) allows measuring the degree of trend persistence from one time scale to another. Furthermore, the Hurst exponent is ideally bounded between 0 and 1. With Ethereum, a Hurst exponent close to 1 indicates significant upward potential, and consequently a good symmetry with major lows. Conversely, a Hurst exponent close to 0 will indicate that the trend is anti-persistent and is likely to turn downward.\n\nEthereum (ETH) price (top chart) and Hurst exponent (bottom chart). Measures the positive (>0.5) or negative (<0.5) persistence of the trend. Graph and data by Thomas ANDRIEU.\n\nGraphically, we see that ETH gained significant upward potential in mid-2022, and reconfirmed it in early 2023. The ensuing bull market, in accordance with theory, was accompanied by a decrease in the Hurst exponent, signaling the loss of upward potential. In March 2024, the Hurst exponent was below 30%, indicating a bearish risk, or at least, the absence of upward potential. Nevertheless, the recent rebound in Ethereum seems to reaffirm a renewal of upward potential, thereby limiting the bearish risks observed in spring 2024.\n\nDespite everything, this approach encourages us to be more cautious about the nature of the bull market compared to 2023. Indeed, it appears clear that the bull market has exhausted a significant portion of its overall potential.\n\nThe cycles acting on ETH\n\nIn several papers, we have had the opportunity to highlight a cycle close to 3.6 years on Ethereum. Furthermore, this dominant cycle corresponds to the same dominant cycle as Bitcoin (BTC). The timing of this cycle thus allows us to judge, and compare, the different bull or bear markets. For example, the bull market observed on Bitcoin since 2023 is strongly symmetrical to previous bull markets.\n\n“Indeed, we know that two cycles of 4 months and 22 months synchronized in February 2018. We are now looking for the time period needed to achieve the next constructive interference. By calculating the LCM(4,22), we get 44 months (3.6 years), which strongly correlates with the cyclicity of equities and Bitcoin (Bitcoin Cyclicity (BTC) – Cointribune).” Technical Indicators: Constructive Interferences and Destructive Interferences – Cointribune\n\nThus, a little more than 3.6 years separate the major peak of 2018 from that of 2021 on Ethereum. Likewise, 3.6 years separate the major low of early 2019 from that of mid-2022, etc. We see here a clear cyclical dynamic, mainly fueled by the correlation of Ethereum with Bitcoin. In this perspective, which remains admittedly theoretical, we could expect an Ethereum peak around mid-2025. We will finally mention the good symmetry observed so far between the current bull market and the previous bull market.\n\nCurrent cycle for Ethereum and previous cycle\n\nETH remains correlated with Bitcoin\n\nIn our previous paper, we highlighted the importance of the correlation between Ethereum and Bitcoin. The lows and the major lows of the cryptocurrency market are indeed linked to the relationship that exists between the two main cryptocurrencies.\n\n“We notice in our case that a high correlation coefficient between Bitcoin and Ethereum is conducive to translating major lows on Bitcoin. Conversely, a low correlation coefficient (prominent low of the coefficient) is likely to translate a sharp weakening of market strength, and major peaks. A major explanation would be that, during bull markets, the dependence of altcoins on Bitcoin decreases.” Bitcoin (BTC) decorrelates from other assets – Cointribune\n\nETH price (top chart) and 6-month correlation coefficient with Bitcoin price (bottom chart). Graph by Thomas ANDRIEU.\n\nGraphically, we can verify that major lows on ETH are linked by a very high correlation with Bitcoin. However, before major bull markets on ETH, we notice that the BTC/ETH correlation is minimal. In March 2024, the 6-month correlation between Bitcoin and Ethereum thus reached a low around 70%. By symmetry, this indeed signaled the likely arrival of an intense bull market on ETH. The study of the correlation between the two assets, however, does not allow us to effectively judge the probable highs on Ethereum.\n\nDespite everything, we see that the correlation between the two assets remains generally high. It is mostly above 80%, which is significant.\n\nTowards $6,000?\n\nThe Technical Analysis of Ethereum’s price can provide us with additional elements. Indeed, we notice that the consolidation of March/April 2024 does not undermine the bullish trend initiated since 2023. On the contrary, the recent bullish breakout allows us to set an initial target (almost reached) towards the recent peaks around $4,000.\n\nEthereum (ETH) price\n\nThen, as we have highlighted, it would be coherent, given the correlation with Bitcoin, to reach the historical peaks at $4,800. In the continuation of this theoretical bullish movement, the next extended target of the consolidation pattern (flag, logarithmic scale) would be near $6,000. This level does not seem graphically and statistically impossible. Conversely, continued difficulties in surpassing recent peaks, or a prolonged drop below $3,000, would signal a probable exit from the bullish trend.\n\nWe have also mentioned the good timing of this dynamic, similar to that of Bitcoin. Nevertheless, we see that a continued upward trend would be with less foundation than the rise of 2023 and early 2024. This necessarily encourages greater attention to market strength indicators.\n\nIn conclusion\n\nThe approval of Ethereum ETFs seems to have triggered a break in the consolidation since March. The upward trend on Ethereum thus continues:\n\nWith an extension of demand to ETFs and the rebound of Bitcoin’s price.\n\nA weakening of bullish strength in terms of fractals. Nevertheless, the upward potential seems to be maintained in April/May concerning the price rebound.\n\nAdditionally, the market’s timing and cyclicity still seem relevant. So far, a certain symmetry persists between the current bull market and the previous one. The upward dynamic is thus accompanied by the market’s structural cycles.\n\nThe correlation with Bitcoin is maintained despite a decorrelation in March 2024. This signal indicates that the bull market on ETH is likely to continue in line with Bitcoin.\n\nFinally, Technical Analysis clearly shows a potential for continuation. The target towards previous peaks, then towards historical peaks, would thus be likely in a bull market. If the bullish strength is maintained, some extended targets are around $6,000, and beyond by extension.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxQWkxVWGZmQ0RmM0ViX2pPLUd2NUNOTS10b211azk2dm95Zk42U0Y0aDU1QUVyaTNzYWpUdTdYNEl4dVhyZ3lEUHlLZkgxT21KSzlueG5xUVpwMW9SQk9aOWZUbWJZa0xJQTZHb0xpWktnbUtzbE1IeWY1UTdBSDRVckY5Zw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 25 May 2024 07:00:00 GMT",
        "title": "1 Top Cryptocurrency Will Soar 116%, According to Standard Chartered. Is It a Buy? - The Motley Fool",
        "content": "A Standard Chartered analyst expects Ethereum to more than double by the end of the year. Here's how that bullish analysis checks out, and how it moved markets this week.\n\nAnalysts from a major British bank say that Ethereum (ETH 0.07%) should more than double from here to the end of 2024. Does this projection make sense?\n\nStandard Chartered's bullish Ethereum analysis\n\nGeoff Kendrick, head of crypto research and emerging markets foreign exchange at Standard Chartered (OTC: SCBF.F), hung an $8,000 year-end price target on Ethereum (ETH 0.07%) earlier this week.\n\nSpeaking to the crypto news site The Block on Tuesday, Kendrick predicted that the U.S. Securities and Exchange Commission (SEC) would approve the first exchange-traded funds (ETFs) tracking Ethereum's spot price. He argued that the approval would inspire large money inflows into the Ethereum cryptocurrency, similar to the inflows that followed after the approval of spot Bitcoin ETFs in January.\n\nThe analyst also noted that he called the money-flow effects of the Bitcoin ETF approval correctly, and underscored the long-term price boosts that should result from these substantial investment moves.\n\nMind you, Kendrick based his Ethereum price target on his latest Bitcoin (BTC -1.31%) target. In other words, the Ethereum ETFs strike him as good news for the crypto market as a whole, not necessarily driving Ethereum prices any faster than the rest of the sector. Historically, Ethereum has closely followed Bitcoin's price movements due to their strong market correlation and shared investor sentiment.\n\n\"Given that we now see Bitcoin reaching the $150,000 level by end-2024, this would imply a level of $8,000 for Ether,\" the Standard Chartered analyst said.\n\nSEC moves closer to approving Ethereum ETFs\n\nTwo days later, the SEC approved a rule change that will result in the first Ethereum-based ETFs on the American markets. The funds aren't hitting the market right away, as the SEC must review each application in detail before approving anything. While this process could take months, the established precedent of Bitcoin ETFs suggests that the SEC's approval may be expedited. It's still a big move in the direction of final approvals, which looks like a matter of time now.\n\nCrypto investors were enthusiastic about Standard Chartered's forecast, driving Ethereum's price 23% higher the next day while Bitcoin rose as much as 7%.\n\nMarket reactions to the forecast and ETF news\n\nThe two largest cryptocurrencies barely moved on the actual ETF news, though. Ethereum has stayed steady since Kendrick's forecast and Bitcoin is down by a couple of percent on Friday.\n\nBut Kendrick's analysis still looks directionally correct. The combination of ETF approvals and the recent Bitcoin halving should indeed power another price surge in Bitcoin, Ethereum, and many smaller altcoins over the next year or so. Growth investing star Cathie Wood of Ark Invest also pegged her year-end Bitcoin target at approximately $150,000, with much loftier long-term goals in mind.\n\nEvaluating Kendrick's analysis and its implications\n\nFrom a perspective of simple logic, the idea of rising crypto prices makes sense.\n\nBitcoin's market value is receiving boosts from both sides of the supply and-demand calculation. The halving of Bitcoin mining rewards makes it harder to come by freshly minted digital coins. At the same time, the new ETFs open the floodgates to nearly direct Bitcoin investments by several new types of buyers -- retail investors can now access Bitcoin ETFs (and soon Ethereum ETFs) in their retirement accounts, while institutional money managers can rely on familiar ETFs instead of opening new accounts in unapproved crypto exchanges.\n\nBurning the value candle at both ends, Bitcoin is experiencing higher demand and strictly limited supply. That's a recipe for higher prices, especially since the necessary Bitcoin mining process stops making economic sense unless coin prices increase enough to make up for the smaller rewards.\n\nAnd where Bitcoin goes, other cryptocurrencies tend to follow. In particular, Ethereum tends to follow Bitcoin's price chart quite closely:\n\nBalancing your portfolio with crypto investments\n\nStandard Chartered's Ethereum target stands 116% above the smart contracts pioneer's current price (and 160% beyond where it sat before Kendrick spoke to The Block). I can't promise that it will meet this exact goal, but I'm convinced that both Ethereum and Bitcoin will rise as the year plays out.\n\nUnexpected twists can throw a spanner in the works, of course, and other unplanned events might drive the cryptos even higher instead. You never really know what will happen in this young and volatile market until it happens.\n\nHence, I wouldn't recommend backing up the truck, betting the literal farm, or otherwise going overboard with crypto investments right now. A diversified approach with crypto playing a modest part in a diversified portfolio will let you enjoy the benefits of a price surge without risking it all. Ethereum looks like a solid buy today, but I wouldn't hold my breath waiting for Kendrick's specific $8,000 target to materialize."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxONEtLOEJ2UTlCNWRINkROUV9wSWFPN2VUM1FQblpwU201V1FhMzFOSUpWUm05MEIzc2pUSkpiWTJ2U0gySmN6NHN0Mk1BcjlDM1g3bEtnd1Q2dnZvNGVQVUJuVW5EOXFhcGlyVkRYekNMTFF4dUNVMEI2NGZVMUdvbkZReDNadWthMHZoNE1kOHZweTkxWU1qemRn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 25 May 2024 07:00:00 GMT",
        "title": "Ethereum Foundation Sets New Policy for Conflict Issues - Crypto Times",
        "content": "The Ethereum Foundation is swiftly developing a formal policy to address potential conflicts of interest. This initiative follows the revelation that two of its researchers received substantial incentives from the EigenLayer project.\n\nExecutive Director Aya Miyaguchi emphasized the importance of maintaining the foundation’s neutrality to effectively serve the ecosystem.\n\nThe Ethereum Foundation’s credible neutrality is critical for us to perform our role in the ecosystem. We are aware of the current conversation about potential conflicts of interest, and share the community’s concerns.\n\n\n\nIt is clear that relying on culture and individual judgment… — Aya Miyaguchi (ayamiya.eth) (@AyaMiyagotchi) May 24, 2024\n\nThe foundation’s action comes after researchers Justin Drake and Dankrad Feist disclosed receiving significant EigenLayer token incentives. Drake highlighted the substantial value of the tokens, potentially surpassing all his other assets.\n\nMiyaguchi reiterated the foundation’s dedication to its role within the blockchain community. She acknowledged that previous reliance on culture and individual judgment was insufficient. The new policy aims to formalize the approach to conflict resolution and enhance the foundation’s integrity.\n\nLefteris Karapetsas, a former Ethereum software engineer and the founder of the cryptocurrency portfolio tracking tool Rotki, believes the Ethereum Foundation should adequately compensate its employees so that they do not feel the need to seek additional compensation packages elsewhere.\n\nThis development marks a significant step in addressing community concerns and ensuring the foundation’s actions align with its ethical standards."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE1pQ0hvVl9ldnVOMnBGZDNiek0waDJKUVNVVW4xeXotWVl4S294NkVfTEZXWWhOODZ4WF84SEtrNEJQcEFqeHE1aTF1VWgwanc5UEM1N1hnNWVycTc2a003M21FZGIwcTQ0Nk45Ym5jQ2JLSjJVbmFIN1l3VQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 25 May 2024 07:00:00 GMT",
        "title": "Ethereum Sets Sights On Pectra Upgrade For Q1 2025, Promising Major Enhancements - TronWeekly",
        "content": "Ethereum core developers have set their sights on launching Pectra, the blockchain’s next major upgrade, by the end of the first quarter of 2025. This ambitious timeline hinges significantly on the inclusion of the EVM Object Format (EOF), a collection of about 11 Ethereum Improvement Proposals (EIPs) designed to introduce an opt-in container for Ethereum Virtual Machine (EVM) code. The EOF represents a pivotal advancement, promising enhanced efficiency and flexibility for developers and users alike.\n\nPectra’s upgrade is poised to be transformative, with the integration of PeerDAS, a cutting-edge data availability sampling solution. PeerDAS leverages Ethereum’s existing peer-to-peer infrastructure to enhance data integrity and accessibility, thus bolstering the overall robustness of the network. This innovation is crucial for maintaining ETH’s competitive edge in the rapidly evolving blockchain landscape.\n\nAnother significant aspect of the Pectra upgrade is the replacement of the existing account abstraction EIP-3074 with a newly proposed EIP-7702, authored by Ether co-founder Vitalik Buterin. EIP-7702 aims to elevate externally owned accounts (EOAs) by enabling them to operate as smart contract wallets during transactions. This enhancement is expected to streamline user interactions with decentralized applications (dApps), making Ether more user-friendly and versatile.\n\nEthereum’s Dual Upgrades: Prague And Electra In Pectra\n\nPectra comprises two main components: the Prague upgrade on the Execution Layer and the Electra upgrade on the Consensus Layer. Together, these updates will usher in a series of technical improvements designed to enhance Ether’s scalability, security, and functionality. Despite the forward momentum, some elements of the upgrade remain under discussion. Notably, there is a consideration to postpone the implementation of Verkle trees, a complex and critical upgrade aimed at optimizing data storage and retrieval on the Ethereum network, to the subsequent Osaka hardfork.\n\nThe development community is actively debating the final scope of Pectra, ensuring that all changes align with Ethereum’s long-term vision and objectives. This collaborative approach underscores the dynamic and open nature of Ethereum’s development process, where community input and rigorous testing are paramount.\n\nAs the proposed launch date for Pectra approaches, the level of excitement building around the Ethereum ecosystem is increasing. It is said that these planned upgrades will considerately boost the performance and usability of the platform in cementing its position as one of the leading blockchain networks. Strong momentum for future innovations and scaling towards greater deployment within the decentralized tech space.\n\nRelated Reading | Dogecoin Analyst Foresees 13x Surge to $2 Amid Potential Altseason Boom"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE1PbFA2WWpDWFZuSEtFWkhvcGlSY3lqSXJGQ2ctM0VDUG16ZHpIci1DWkF5cmQyRmFWbDRiSlJ2M1lvNFNnNDl1cVVTVm1ISzNWTEdVa2JWbzFMcVAxUU5wbGw3NTBSRmhWaUMybXhxNEI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 25 May 2024 07:00:00 GMT",
        "title": "How To Invest in Crypto Without Buying Crypto - Investopedia",
        "content": "You can gain exposure to cryptocurrency without buying any by purchasing shares of Bitcoin Spot ETFs, Bitcoin Trusts, or ETPs linked to cryptocurrency futures through cryptocurrency exchanges. The Securities and Exchange Commission also gave three exchanges the green light to begin listing eight Ether Spot ETPs in May 2024.\n\nThese indirect ways of investing in crypto are much cheaper and possibly less risky than purchasing crypto outright. Here’s what you need to know if you want to invest in crypto without buying crypto.\n\n\n\nKey Takeaways Although cryptocurrency has existed for some time, many consider it a relatively new investment with a major learning curve.\n\nInvesting directly in cryptocurrencies can be challenging because of their volatility, and some investors prefer using more traditional investments.\n\nYou can indirectly invest in crypto through funds and cryptocurrency-related stocks.\n\nOptions include spot and futures-based crypto exchange-traded funds (ETFs).\n\nWhat Is Indirect Crypto Investing?\n\nYou have options if you don’t want to open an account on a crypto exchange and buy cryptocurrencies. You can invest in cryptocurrency indirectly through traditional methods like stocks, mutual funds, and ETFs.\n\nThere are pros and cons to consider, including security, fees, and the risk of losses. When you buy cryptocurrency through third parties, those funds are going to earn their keep somehow, so you should consider any additional costs when deciding whether to buy crypto using an indirect method.\n\n\n\nHere are some ways you can invest in crypto indirectly.\n\nCrypto ETFs\n\nWhen trying to get broad access to a particular asset class, the first port of call is usually ETFs. Investment funds can be found that track pretty much everything, from gold to the S&P 500. Unfortunately, with cryptocurrency, it’s a little more complicated.\n\nAfter many years of denying spot cryptocurrency ETF applications, the Securities and Exchange Commission (SEC), under pressure from a 2023 D.C. Court of Appeals decision, approved the first 11 in January 2024. Previously, the regulator only gave the green light to ETFs that owned bitcoin futures contracts. Here are some:\n\nProShares Bitcoin Strategy ETF (BITO)\n\nValkyrie Bitcoin Strategy ETF (BTF)\n\nVanEck Bitcoin Strategy ETF (XBTF)\n\nGlobal X Blockchain & Bitcoin Strategy ETF (BITS)\n\nHere are the first Bitcoin spot ETFs to be approved:\n\nARK 21shares Bitcoin ETF (ARKB)\n\nBitwise Bitcoin Trust (BITB)\n\nFidelity Wise Origin Bitcoin Fund (FBTC)\n\nFranklin Bitcoin ETF (EZBC)\n\nGrayscale Bitcoin Trust (GBTC)\n\nHashdex Bitcoin ETF (DEFI)\n\nInvesco Galaxy Bitcoin ETF (BTCO)\n\nIshares Bitcoin Trust (IBIT)\n\nValkyrie Bitcoin Fund (BRRR)\n\nVaneck Bitcoin Trust (HODL)\n\nWisdomtree Bitcoin Fund (BTCW)\n\nIn May 2024, the SEC gave three exchanges approval to list certain Ether Spot ETFs. NYSE Arca, Nasdaq, and Cboe BZX are able to list and trade shares of:\n\nGrayscale Ethereum Trust (NYSE Arca)\n\nBitwise Ethereum ETF (NYSE Arca)\n\niShares Ethereum Trust (Nasdaq)\n\nVanEck Ethereum Trust (Cboe BZX)\n\nARK21 Ethereum ETF (Cboe BZX)\n\nInvesco Galaxy Ethereum ETF (Cboe BZX)\n\nFidelity Ethereum Fund (Cboe BZX)\n\nFranklin Ethereum ETF (Cboe BZX)\n\nThere are catches to investing in crypto this way. First, futures contracts and ETF shares don’t necessarily deliver the same returns as their target assets. Second, ETFs for crypto can be complex and have fees that can eat into your potential returns.\n\nFees and underlying investments vary based on which fund you choose, so be sure to read the prospectus carefully to know what you’re getting.\n\nEthereum ETFs\n\nOnce spot Bitcoin ETFs were approved, calls became louder for Ethereum's native token, ether, to get the same treatment. Ether-based ETFs were only able to use futures contracts to track the price of ether rather than directly holding the digital currency, as traditional ETFs and now many Bitcoin ETFs can do. However, this has changed following the SEC's May 2024 exchange proposal approval.\n\nAsset managers like VanEck, Grayscale, and Fidelity have filed for permission to launch Ethereum ETFs, which would give investors exposure to the world's second-largest cryptocurrency via SEC-regulated funds. This would likely give Ethereum greater liquidity, improve price tracking, and lead to potentially lower fees than futures-based ETFs can offer.\n\n\n\nOther countries, including Canada, have been quicker in adopting spot crypto ETFs.\n\nCrypto ETFs vs. Crypto ETPs\n\nETPs are financial instruments that track underlying securities, an index, or other financial products traded on exchanges. They can be purchased and sold throughout the trading day, like stocks. ETFs are the most common form of ETP. Other types of ETPs are exchange-traded notes, which specialize in debt securities, and exchange-traded commodities, which track the performance of commodities such as precious metals, agricultural products, and energy resources.\n\nWhen the SEC approved spot bitcoin ETFs in January 2024, they were classified as ETPs under the Securities Act of 1933 rather than ETFs as defined by the Investment Company Act of 1940. Thus, the term ETP is a bit of a misnomer, though Investopedia has followed the more common usage in the investment community despite the SEC's determination.\n\nWhat are the implications? Besides having a less diversified portfolio, ETPs are governed by slightly different rules. Diversification and the type of assets held played a role in this designation. With bitcoin ETPs, physical spot exposure is given to a single commodity of cryptocurrency. Conventional funds, like other ETFs and mutual funds, must hold a more diverse range of assets. Registered under the Securities Act of 1933, ETPs are not subject to the same diversification and leverage restrictions as ETFs. This provides more flexibility in the types of assets they can hold, including cryptocurrencies.\n\nWhile ETPs are subject to securities regulations, they do not offer the same level of investor protection as ETFs. Investors should exercise more caution and conduct thorough due diligence. The tax treatment of ETFs and ETPs can also differ. Investors should consult with tax professionals to understand the tax implications of investing in crypto ETPs. Lastly, the crypto market in which crypto ETPs are now players (since they have to trade crypto tokens) is not SEC or CFTC-regulated.\n\nCryptocurrency and Blockchain Stocks\n\nAnother way to invest in crypto without buying digital tokens is to purchase shares in companies that work in blockchain or hold cryptocurrency on their balance sheets.\n\nCompanies specializing in blockchain technology are often involved in crypto mining, software development, and other blockchain-based services. Notables include Riot Blockchain (RIOT), Canaan Inc. (CAN), HIVE Blockchain Technologies (HIVE), and Bitfarms (BITF). These companies have different risk and reward trade-offs than those directly invested in cryptocurrencies.\n\nAlternatively, some companies hold cryptocurrencies or are directly involved in them. For instance, Coinbase (COIN), a publicly traded company, is one of the largest and best-known cryptocurrency exchanges. As of its Dec. 31, 2023 Form 10-K, it held more than 74,000 bitcoin, ether, solana, and other cryptocurrencies.\n\nGenerally, as crypto prices decline, related stocks also struggle. This volatility is one of the risks inherent in this sector, a key point to remember when exposing your portfolio to crypto-related products. Given the rapid changes in cryptocurrency regulations and market moves—and as a general rule of thumb for investing—it's prudent to diversify your portfolio to guard against crypto's risks and consult a trusted financial professional to review your investment plans.\n\nThere are also ETFs that specifically invest in companies with links to cryptocurrencies.\n\nCrypto and Your 401(k)\n\nYou can invest a part of your retirement funds in cryptocurrencies with minimal effort. In 2022, Fidelity announced that clients could add Bitcoin to its 401(k) accounts. Fidelity buys the coins and holds them in a digital asset account.\n\nThis was a major step toward bringing cryptocurrencies fully within the mainstream through traditional retirement investment portfolios. Ultimately, it's often up to your employer to decide on the specific portfolio of funds available to you for your 401(k).\n\nCredit Card Rewards\n\nCredit card rewards are one final method to fill your cryptocurrency portfolio without opening your fiat wallet. Several cards allow you to earn crypto when you swipe, tap, dip, click, or do anything else to use a credit card for payment.\n\nExamples of cryptocurrency credit cards include the Gemini Credit Card, and cards offered by the Crypto.com and Coinbase exchanges.\n\nSome cards, like the Venmo credit card, offer flexible redemption options, including cryptocurrency. When you earn crypto as a credit card reward, you invest in crypto without buying crypto.\n\nIs Crypto Worth Investing in? There are many risks when investing in crypto—fraud, hacks, significant losses from price fluctuations, regulatory changes, and more. It's best to talk to a financial advisor familiar with cryptocurrency to learn if it's suitable for your financial circumstances and portfolio.\n\nHow do Beginners Invest in Cryptocurrency? Knowing how to invest in crypto can be intimidating, given the complexity of blockchain technology, the hype surrounding it, and the many available currencies. The first step is to get up to speed on the fundamentals of cryptocurrencies, how blockchain technology underpins them, the kind of crypto wallet you will need, and the differences among cryptocurrencies like bitcoin, ether, and altcoins. Reputable resources such as Investopedia and courses offered by universities—many freely available online—can be invaluable. Platforms like Coinbase or Binance might be a good choice for your initial steps into the market since they have accessible interfaces and resources to guide you. Once in, stay updated on crypto news and regulatory developments.\n\n\n\nWhich Crypto Is Best to Invest in Now? Investing in cryptocurrency comes with many risks, the most prevalent being the loss of capital from wild price swings. If you feel you must invest in cryptocurrency, it's best to talk to a financial advisor who is familiar with it and find out if it's suitable for your financial circumstances. Additionally, it's essential to remember you should never invest more than you can afford to lose, especially when investing in cryptocurrency.\n\nThe Bottom Line\n\nInvesting in cryptocurrency directly requires getting set up on an exchange and finding ways to store your digital coins safely. It can also mean potentially having a lot of money tied up in a volatile asset.\n\nFortunately, there are alternatives. You can invest indirectly in cryptocurrencies through ETFs that own future contracts tied to currency prices, bitcoin ETFs that securitize bitcoin holdings, or by purchasing shares in companies involved in cryptocurrency mining, software development, and other services. Alternatively, you can consider a credit card with cryptocurrency rewards or see if your employer offers this asset class through your 401(k).\n\nThe comments, opinions, and analyses expressed on Investopedia are for informational purposes only. Read our warranty and liability disclaimer for more info. As of the date this article was written, the author does not own cryptocurrency.\n\n"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxQV1BOdHBiMXhsYVUtakFqN0lqc1F3dnBsWUVmNFp0WFA2M0F1OFpCNU5wQ2ppb3gwMThzNGFHWVMzUGRVTHkyU1UwakhRdC1LUm85NExxUnhVUkdmNV96M2JZRlBZbVZ1eVMyekdsbjAzMVVCSmNONmlIYVJINXlyWGM4WWEycXU0ejUwZlFtNk9mejFIQWRoV2g0ZUltb05MM3dobjh1c3dMMFJMV2JzV2pLM2lBelAxSVFmdm5lYUdvWHdmNnYzYTV6SDdYVGJ4NFFGTVpqZjLSAd4BQVVfeXFMUGRHZTRDaW1ac3BCQkN6UkN6QXdla2R1SkVCY3hHWHVfTVI2a3FhbzByckFyaGQ5NDE4WjQtRUxNRFdRVWE2cDB4QVlBZ25EblJVa251Z3VrSkZvWUVwcFBzOUpSOHJHdkRBWTNwbXNRRzJtLVRlcWx1TVdxOEN4cDFHT1pSYW84Qy14UmhKT0JNS19xN2ZQZVRXOFBwNWtuWHJtMkVreW5sYmI4d0NaWTZVZFpCcHpYWE40REFjSGltMGVpQ1FJV09tT3J4bnFqY1ZGUTFoa0lTTnFUelVR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 25 May 2024 07:00:00 GMT",
        "title": "This Ethereum Rival Could Skyrocket by Nearly 2x Over the Short to Medium-Term, Says Coin Bureau’s Guy Turner - The Daily Hodl",
        "content": "The host of the Coin Bureau YouTube channel, Guy Turner, is expressing bullish sentiment on one Ethereum (ETH) competitor.\n\nTurner tells the 2.47 million subscribers of the Coin Bureau channel that the layer-1 blockchain Fantom (FTM) possesses more upside potential based on technical analysis.\n\n“The weekly chart appears to be painting a wonky head and shoulders pattern that looks eerily similar to the topping pattern FTM saw in late 2021. Notably, this pattern implies that there could be one more leg higher.”\n\nAccording to Turner, Fantom could go up by approximately 98%, nearing double its current price.\n\n“Zooming out on the weekly chart suggests that FTM could rally as high as $1.60 in the short to medium term where it will likely stall out due to resistance, also known as bag holders, from the previous bull market. After that, it’s anyone’s guess.”\n\nFantom is trading at $0.810 at time of writing.\n\nOn the reasons supporting his bullish thesis for Fantom, the Coin Bureau host says,\n\n“FTM has some solid ‘pump-a-mentals,’ so to speak. It has a low price tag and a market cap that isn’t so large as to prohibit an epic pump.\n\nThe fact that FTM’s supply has already vested to investors and the team suggests there will be minimal sell pressure from their side, particularly when you factor in the Fantom Foundation’s apparently enormous runway…\n\nThe only thing that FTM is missing is a narrative that retail investors can understand. And more retail accessibility. Specifically, FTM is not currently listed on Coinbase though it’s possible this could change if regulations in the US change.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxPYWprM1RoaEtXMHFVQ2VjUmp1REpRUXNhTm53V3YybXI2OVo4UTI5MGw0dV9iU2U0TlNMVVZqYlhqeWRFME5ZMDdwTkladW0zTjV6YlhONkF4a1VySzV4ajNCQWl6S3V0a2dUMVotMDBuZEtWMGl5N01rSXJZNU9PdThpbjJyUmhNQjVRd2RYM0JPc1k3eVozaUFlTWk1eUYyVTk3dTlJZjZiYmlPRUx5TtIBtgFBVV95cUxNU25hSENnU2FoRFpRbzRuZjdxS0NuWVJQTGV3SzNNYUJtOGZJS0xsMWx6NG1IV19xTFNiVXAzRjY5TE5ac0lKdXFHVjc4aVFYTV93TnRTUzFJYlRJN0NjczF3dzd6Q0JLd1JzMFc4aTJoNFM0aFU5REZONHpudHM4b2Q0eXhCS2xSb1EyTm90RkE5ZmEwVUF6S2R4NWJGd0ZYRnBUS3Fpa3dzck5rRkU5aWRaSVVBQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 25 May 2024 07:00:00 GMT",
        "title": "Tons of Volatility Amid SEC’s Ethereum ETF Approval: BTC and ETH Drop by 4% (Market Watch) - CryptoPotato",
        "content": "The crypto market is quite susceptible to ETF approvals, as it seems, and the past 24 hours brought even more enhanced volatility for the entire sector.\n\nAfter the hype from the start of the business week settled, the largest cryptocurrencies, including the one that got the green light from the SEC, have turned red.\n\nBTC Drops Below $67,000\n\nThe start of the current business week couldn’t really foresee what was going to happen. BTC had calmed at around $67,000 after the quiet weekend, but it all changed on Monday evening when reports emerged that the SEC could actually greenlight a spot Ethereum ETF by the end of the week.\n\nBitcoin, alongside most of the crypto market, went on a wild ride and soared by five grand in hours. This resulted in tapping its highest price tag in almost two months of nearly $72,000.\n\nThe rally came to a halt at that point and BTC started losing value gradually. Still, it traded in a range around $70,000 until yesterday evening when it slumped by a few grand to under $68,000. This came hours before the SEC’s deadline to make a decision on whether it will approve or reject all ETF applications.\n\nAlicia Bakery CMO - A really good agency Did you like this market update?\n\nThis is all you need not to miss any price action in the raging crypto markets. Start receiving this recap, for free, every day: Invalid email address Your privacy is guranteed. Thanks for subscribing, you will get your first report in the next hours!\n\nMore volatility ensued when the regulator actually approved eight Ethereum ETFs, and BTC went down to $66,400 before it shot up by two grand. However, it has lost some ground once again and now struggles below $67,000.\n\nIts market cap is down to $1.310 trillion, and its dominance over the alts is 50.2%.\n\nAlts in Red\n\nThe aforementioned developments around the Ethereum ETFs impacted the underlying asset’s price the most, as expected. ETH skyrocketed by over 20% on Monday to a six-week peak of its own at over $3,900. It also went down and up yesterday ahead of the SEC approval but now sits 4% down on the day at $3,655.\n\nThe rest of the larger-cap alts are in no better state. Solana, Dogecoin, Toncoin, Cardano, Avalanche, Polkadot, and Shiba Inu have all dumped by 5-8%. BNB, XRP, TRX, and BCH are also in the red.\n\nThe total crypto market cap has lost over $100 billion since yesterday and is down to $2.617 trillion on CG."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxQa2Q2MHBsQUxRODlrTzNIUGlhLXhFSngwTkJoTmpEZ2JEZmJyWldhSEhsQU93TWxQVGZDcGFLM3NCTklKMEF3bWpzeTBrOXFSUUlOT01IR0FqcGo3Y25Od3V0SERlMVZMNXpVandHaldaTGMzTTRlVjgwLWl6VVM0Um8wY1hfTE1DRVJQSTZpaHdwSVBZaDNDTmU5a3Nod3BHWmx4SkNyYU9wOXVRaFJKaUdFdk5rQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 25 May 2024 07:00:00 GMT",
        "title": "Spot Ethereum ETF Approval: How is This Milestone Different to the Bitcoin ETF Approval? - The Fintech Times",
        "content": "The crypto industry has completed another step towards mainstream acceptance as spot Ethereum exchange-traded-funds (ETFs) have been approved by the Securities and Exchange Commission (SEC). But how is this approval different to Bitcoin’s in January?\n\nOn 23 May 2023, the SEC approved a spot Ethereum ETF meaning that, to begin with, certain investment firms could now offer an ETF of the cryptocurrency. While the SEC still needs to sign off on registration statements for VanEck, BlackRock, Fidelity, Grayscale, Franklin Templeton, ARK 21Shares, Invesco Galaxy, and Bitwise, in theory, it shouldn’t be long before these firms can start officially trading Ethereum ETFs.\n\nInterestingly the news comes at a time when the regulator is deciding whether to classify the digital asset as a security. Furthermore, the approval follows more news in the crypto world as the United States House of Representatives voted in favour of legislation to provide greater regulatory clarity over digital assets.\n\nEric Demuth, co-founder and CEO of Bitpanda, the trading platform, explains how these discussions fit within the larger picture of cryptocurrencies’ global acceptance: “The SEC’s approval of the ETH spot ETF, after months of politically driven objections, was overdue but is very welcome. Despite the SEC’s stance that ETH is somehow a security, we are seeing another key part of the crypto industry unlocked for institutional investors.\n\n“It’s yet another sign of how the crypto industry is changing and another step towards crypto rightly being treated the same as any other asset class. This approval means new institutional investors from the US, less volatility, and more evidence for crypto’s long-term future in the world of finance. But let’s be honest: Even a rejection would not have changed much about the positive future for ETH and the entire crypto space.”\n\nAnother milestone in one year?!\n\nEarlier this year, the crypto industry rejoiced as the US regulator announced a huge milestone that many had been calling for: Bitcoin ETFs. As a result of this move, US investors, both institutional and retail, could track the movements of Bitcoin and make purchases without having to set up an account or digital wallet with an unregulated exchange.\n\nWith the newly approved Ethereum ETFs, we set out to find out if this has solidified cryptocurrencies as a legitimate investment recognised by the masses, or if they are still viewed as a niche and dangerous investment.\n\nReacting to the SEC’s first stage approval, Alex Saleh, head of partnerships at Coincover, the blockchain protection company comments: “This is a welcome surprise given the challenges of the Bitcoin ETF approvals and the SEC’s historical hostility towards crypto. The US is the largest market for ETFs in the world, and where the US moves, others usually follow.\n\n“The launch of Ethereum ETFs still needs to go through a second stage of approval, but if given the green light, would represent a major vote of confidence in the role that digital assets will play in our financial system and open the floodgates to more of these products.”\n\nMore exposure\n\nSaleh continues: “The SEC’s move is another sign of the growing appetite for crypto ETFs and could introduce fresh demand pressure on Ethereum spot prices, since exposure to Ethereum would be opened to a wider pool of investors.\n\n“With that said, there is still a lot of uncertainty on the timing of when Ethereum ETF products will hit the market, and which market players will be participating. This uncertainty makes it difficult to predict any changes in demand for the underlying asset that will lead to further price discovery.”\n\n“This is an exciting moment for the crypto community, but there are still risks that come with any new financial instrument. Volatility is a given, and widespread adoption of Ethereum ETFs would lead to fund managers accumulating large amounts of Ethereum across a range of custody methods. This will be a prime target for hacks, attacks, and possible human error. We anticipate greater expectations around risk mitigation and security capabilities, meaning security is paramount and must be a top priority for ETF managers.”\n\nFollowing in the footsteps of the Bitcoin ETF\n\nDaniel Seifert, UK country director of Coinbase, the global crypto exchange notes how this approval further roots cryptocurrencies in the mainstream world of investing. He says: “Coinbase welcomes this ETF approval and believes it will have a similar, positive impact on the industry, as experienced upon the approval of BTC ETFs.\n\n“This move solidifies the fact that cryptocurrency is not merely a trend, representing a global transition towards digital assets in order to reshape the existing financial system. The expansion of crypto’s utility will have significant effects on innovation, and we expect to see an escalation of activity in the market. Coinbase is excited to serve asset managers with the full suite of Prime products and further the positive impact on the industry.”\n\nA good step in the right direction but we need to be cautious\n\nMona El Isa, founder of Avantgarde Finance, a crypto asset management firm, explains that while this is a good move for the crypto industry, an ETF takes away some of what makes Ethereum Ethereum.\n\nShe explains: “The approval of the Ethereum ETF is a positive development, boosting institutional demand as it is packaged in a way that traditional investors understand. However, the risks lie in the details of how these ETFs will implement, monitor, and manage risk, especially if they involve staking Ethereum.\n\n“The centralised nature of these funds contradicts the ethos on which the asset class was built. Owning an ETF makes your investment purely speculative and ironically removes some of the key features that originally drove the popularity of cryptocurrency.\n\n“There are also concerning centralisation risks in the current Ethereum staking landscape that need addressing. The top three staking pools control over half the total stake, with a measly 9% left for truly decentralised options. Lido dominates liquid staking with 85% of the market. It’s clear we urgently need new on-chain, decentralised staking alternatives to break up these monopolies.\n\n“While ETFs may boost institutional demand short-term, the space must solve these centralisation issues to maintain crypto’s value proposition long-term. The rushed ETF timing also seems more politically motivated than grounded in addressing these crucial risks.”"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxQeVBpYkh4T1pJaVl1ckljTkE3VTFNdk9RSGJHd1I3RjYzME5Mc3lZMFhjNDdqdHBKZHg2dlkzbGdBVnpZaHNzeGRjLTdQX3NjdTZXQ0NkSjM5UFh1V3FSZEhqc01RSjV4STkzaEZndHhRN1dDTXh0U0ptT2hEWVZZYTZ3UVU3cHo1dDJNYVdsQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 May 2024 07:00:00 GMT",
        "title": "Ultimate Investment Guide: Furrever Token Set to Achieve Bitcoin and Ethereum-Level ROI in 2024 - Yahoo Finance",
        "content": "Furrever Token\n\nNew York City, NY, May 26, 2024 (GLOBE NEWSWIRE) --\n\nBitcoin (BTC) has fallen below $68,000, trading at $67,183 with a 3% decrease in the last 24 hours, raising concerns of a potential downtrend. Meanwhile, Ethereum (ETH) remains stagnant at $3,800 despite the approval of eight spot Ethereum ETFs, showing no significant uptrend. On the other hand, Furrever Token (FURR) captivates investors with its promising presale, nearing $1.1 million raised, and potential for a 1500% increase in value post-launch.\n\nBTC Falls Below $68,000 – Will the Decline Persist?\n\nInvestors and traders are especially showing new interest to Bitcoin strategies now that its current position and price fluctuations are driving this new found wave. Bitcoin which was trading at $/$67,183 began to decrease by 3. 3% in the last 24 hours, has a transaction volume of 36$, a monthly volatility of 4%, a monthly average price of 350$ and a Year to date return of 19%. 7 billion.\n\nAnalyzing the global market, it is possible to say playing a Capstone project budget of $1. 2.3 Q It is worth mentioning that bitcoin remains the most valuable coin in the market of cryptocurrencies with the worth of more than 3 trillion. Bitcoin (BTC/USD) is down 3% to 67,183 from its price earlier today. While analyzing the overall price fluctuations of this token, users are going to observe that in the last 24 hours 3% price swing indicates a bearish trend. Yet, these figures $68,263, especially emphasizing the pivot point belong to the direction of the current increase trend.\n\nThe 50-day Exponential Moving Average (EMA) is located at $68,615, which forms a resistance level near the pivot point. Technically, Bitcoin is trading below the pivot point, indicating a potential downtrend. As an entry strategy, selling below $68,263, targeting a take profit level of $66,357 and setting the stop loss at $70,029 could be recommended. This strategy can enable investors to take advantage of possible further declines while managing risk.\n\nHow Did Ethereum Price React After Approval: Has the Expected Rise Come?\n\nFollowing the approval of eight spot Ethereum ETFs by the SEC last night, ETH price remained stagnant at $3,800 and showed no signs of a significant uptrend. Despite this, ETH experienced a significant increase of over 30% last week. Investors are currently taking a cautious stance and are watching to see if this development will result in a “news sell” event.\n\nAhead of the US SEC announcing its Ethereum ETF approval decision, ETH price witnessed some sharp fluctuations. In the tense hours before official approval, ETH initially fell to $3,500 during the traditional US market close. It later approached $3,900 after initial unconfirmed reports emerged pointing to confirmation, and ultimately settled above $3,800 after confirmation. In the midst of these huge price swings, it turned out that a whale made a staggering sale of 7,900 ETH worth $29 million.\n\nStory continues\n\nDuring the turbulent period, liquidation of leveraged crypto derivatives positions reached over $350 million throughout the day, the highest figure since May 1, according to CoinGlass data. The majority of these liquidated positions were long positions anticipating price increases and totaled approximately $250 million. This shows that traders who had overextended themselves with leverage were surprised by the sudden price drop. Among those affected, ETH traders bore the brunt, with $132 million in liquidations.\n\nApproval of spot Ethereum ETFs could bring inflows of more than $500 million, as analysts estimate. However, it may take some time for this to happen and the uptrend to begin. Some on-chain indicators suggest that Ethereum could form a base above $4,000 and continue to rise to $5,000-6,000 by August this year. While the approval of Bitcoin ETFs has led to strong institutional inflows, it will be interesting to see whether the ETH ETF launch will lead to greater institutional adoption.\n\n\n\n\n\nFurrever Token: The Upcoming Game-Changer in Meme Coins\n\nFurrever Token is poised to capitalize on the growing interest in meme coins with its charming cat-themed imagery. Currently in the final phase of its presale, the token has already raised over $1.1 million, aiming to reach $1.9 million before its official launch on PancakeSwap. The potential for a 1500% increase in value post-launch positions Furrever Token as a highly attractive investment. Early presale participants, with tokens priced at $0.000648, stand to benefit significantly from this anticipated growth.\n\nFurrever Token's engaging approach, featuring cat-themed stickers, visuals, and community challenges, promotes a vibrant community. Additionally, the project's commitment to security and transparency, evidenced by its audited smart contract and a one-year lock on team tokens, reassures investors about its long-term prospects. With nearly 4,000 active members in its Telegram channel, Furrever Token demonstrates robust community support and engagement.\n\nAs the presale concludes, now is an opportune time for investors to get involved with the Furrever Token community and potentially secure significant returns.\n\nVisit furrevertoken.com to secure your tokens and join this exciting venture. Investors interested in this opportunity are advised to contact only the official support at support@furrevertoken.com to avoid potential scams.\n\nJoin Furrever Token Presale Now:\n\n\n\nFurrever Token Official Website\n\n\n\nJoin $20,000 Furrever Token Giveaway\n\n\n\nJoin Official Telegram Group\n\n\n\nFollow Official X Account\n\n\n\nMedia Contact:\n\nRobert Smith\n\nhttps://furrevertoken.com/\n\nsupport@furrevertoken.com\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\nCONTACT: Robert Smith support at furrevertoken.com\n\n\n\n"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxQYkozcng0UnNRelNHTTMtYi1DYWpPNFk5ZmxROWVpQkdSYmZzXzE0TDVQN3plNFZLV25GbFdYakFKOHM4dVhrSlRFbTZLRF9MYTM4Yi1ncmpPd0hzMUxEU2hBTXcyd2VwN0FjcFhzMVBJX2cxbjU5RzBrTS1EbUpYY3M5R2Y2VGJhYlI2RmVmZlN0czBDQUdoOVFtNTlsYm5sel9lZ0EzcklGQVFIT1E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 25 May 2024 07:00:00 GMT",
        "title": "Crypto: Ethereum ETFs, the deadly weapon that could annihilate decentralization! - Cointribune EN",
        "content": "Sat 25 May 2024 ▪ 4 min read ▪ by Fenelon L.\n\nCrypto experts warn that centralization concerns could lead to “serious” security risks following the approval of Ethereum spot ETFs in the United States, especially if staking is integrated.\n\nRisks Related to the Centralization of Ethereum Validators\n\nThe issuers of Ethereum ETFs had to remove the clause concerning the staking of clients’ ETH to facilitate the approval process. However, this decision could have long-term consequences on network security.\n\nSince the transition to proof-of-stake in September 2022, validators must lock up their ETH in a process called staking. They receive rewards for securing the network but incur penalties for poor performance.\n\nCentralization issues have already arisen when some validators seized a significant portion of the staked ETH, with some even comparing the liquidity provider Lido to a “cartel.”\n\nGanesh Swami, CEO of Covalent, explained to Decrypt: “The removal of the staking clause in ETH ETF authorization applications was intended to appease the SEC. But this short-term solution might cause a long-term problem. If multiple ETFs use the same custodians, it would increase concentration, exposing the network to operational risks such as malicious collusion.”\n\nLack of Regulation and Potential Risks\n\nSpot Bitcoin ETFs in the United States already illustrate the risk of centralization, with Coinbase holding 90% of the total assets. Adding staking could worsen the situation. Andrew O’Neill of S&P Global points out that if ETFs concentrate their participation with a small number of custodians, this could create risks of concentration of crypto validators.\n\nCoinbase, the second-largest Ether validator, is expected to be the custodian for six of the nine companies planning to launch an Ethereum ETF. If the enthusiasm is similar to that of Bitcoin ETFs, this concentration of power could threaten network security.\n\nMona El Isa of Avantgarde Finance explains: “One can measure the concentration risk by the number of nodes a single entity would need to control the chain. The lower this number, the higher the single point of failure.”\n\nThe SEC views staking as a securities service, which explains its removal from Ethereum ETF applications. However, authorities have not established any guidelines to mitigate the risks of centralization and concentration without staking. The SEC has already sued Kraken and Coinbase to prevent them from offering staking services to U.S. clients.\n\nCrypto experts are therefore calling for heightened vigilance regarding Ethereum ETFs to avoid major security risks. It is crucial for regulators and industry players to collaborate in developing clear guidelines aimed at reducing these potential risks and ensuring the long-term security of the Ethereum network.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxOZW00TFR3Tk92VDZRY0ZfWEU1bmpDU2F4UG9HS1R6Z0Z3QS10MDdDWHJBUThXeU14cUtDVWJUYVA3VHkwdGxsblNHUngxQWF0VndLM1BKZU12NVhkSnpmdGI2YUl4MEg1eTlsc09WSUFHajY3T2lhSWFwR1RfcVNrbVhrY191UUJBOVpiSUtxMDJZWXNkTERB0gGcAUFVX3lxTFBtUXNsbTQtdkdKZ1gtVnR3Rl9ZaG1hQnJhQ0x6R0k5VTdhcnRza19LWVprc3g0c19meVVFZWlDVVRMWW9yWE5TaU5zOG1DVk9GY0tTMzhLSkZsaGlMa3doSDhJazJxNGJwV2Nmd1I0N2JGaTBVTzJORWpiV1FwLUpNazJkSlVGUWw0NGEtVVMtS1BuM01VYnhCQm5taQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 May 2024 07:00:00 GMT",
        "title": "Ethereum Price Bullish Outlook: Could We See New All-Time High? - CoinGape",
        "content": "After a 25% hike the previous week, the Ethereum price surged to the month-high of $3937 just hours ago. The second biggest cryptocurrency, Ethereum, is bullish, with constant gains, pushing its market cap to $467.8 Billion. Moreover, the number of transactions and network activity has surged by multiple folds, bringing the trading volume to $17.8 Billion after 65% gains. However, this is just the beginning for ETH price as the various analyses and predictions talk of the price surpassing any previous record.\n\nadvertisement\n\nThe effect of Ethereum’s bullish outlook isn’t limited to itself only, as the entire crypto ecosystem is affected positively. The total value locked (TVL) in the decentralized finance (DeFi) has surged to $117 Billion, a new two-year high record. More importantly, 60% of the locked value is of Ethereum. Moreover, the Ethereum layer2 blockchains are also in its highest TVL zone, which comes to around $47 Billion.\n\nSo, what’s backing this price rally, and how high Ethereum price can go after this? Let us discuss that in this blog.\n\nFactors Backing The Ethereum Price Surge\n\nEthereum’s price began to rise right after the Bloomsberg analyst predicted Ethereum ETF approval, and then once they got approved, the price went crazy. Even without the beginning of the ETH ETF transaction, the hype has surfed to the roof. The hype is understandable by Kavita Gupta, the Delta Blockchain Fund General Partner, denoting Ethereum as Digital Oil. This statement comes after an interviewer asked Kavita what Bitcoin is called Digital Gold and what’s Ethereum for her.\n\nEthereum ETF approval is much bigger than Bitcoin ETF as Ethereum is not just cryptocurrency, it is the creator in the crypto industry, which will boost the Ethereum ETF higher than Bitcoin’s. Many analysts have claimed Ethereum might surge above $11K by the year’s end and even higher the next, solely because of the Ethereum ETF popularity.\n\nCan Ethereum Surge To An ATH?\n\nEthereum’s hype has directly hinted at its rally to the ATH target of $4,891.70. Confirming the same, Arthur Cheong, the CEO of Defiance Capital, has predicted the ETH price to hit $4500 before the trading goes live for the Ethereum ETF.\n\n4.5k before spot ETF go live for trading imo. — Arthur (@Arthur_0x) May 26, 2024\n\nAs the trading volume is the favorable factor for the price surge along with many other bullish indicators, ETH price might hit a new ATH soon. However, if Ethereum fails to break the resistance between $3900 & $4000, the price can decline. Regardless, the analytics for now talk of Ethereum price to hit $4500 before finding its way to $4891.70 and higher.\n\nNot only this, it is clear that Ethereum follows the price trajectory of Bitcoin. Based on that Ethereum may rise as high as $6000 in the next two months, just the way Bitcoin did. Moreover, the top crypto personalities are looking forward to Michael Saylor, the MicroStrategy founder, investing in Ethereum next. It will be another milestone, as Microstrategy boosts the Bitcoin price, and the same might happen for Ethereum.\n\nContinue Reading 4 Top Altcoins To Rally This Week\n\nPooja Khardia With a deep-seated passion for reading and five years of experience in content writing, Pooja is now focused on crafting trending content about cryptocurrency market. As a dedicated crypto journalist, Pooja is constantly seeking out trending topics and informative statistics to create compelling pieces for crypto enthusiasts. Staying abreast of the latest trends and advancements in the field is an integral part of her daily routine, fueling a commitment to delivering timely and insightful coverage\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMi7AFBVV95cUxNMzFaWVhvSjBiYWlZN0RRV1ZtamFjb0hhSHNNNTlnNEoxYnUwZWlZYWp6dy1qSmJybGctOHpOUlEzc18yV2p3c2Y5RDZKRUN5RmZDVkVyOHJmdmpQY1RpREt3Y3prd1dIN05XTERQRGk1dzBaUjFZWDQyb0xfbzNZX19pRkxsdTBrMlE2T0dBaGMzdkxDVUJmSnZESnhuOUZwdnoxWWFyTktjb3FIdUI3bmUwVUxIZ1BLM0dubWZtOTB4OEM5dThNTUR4NnRya0YzX0dyOThtbXdFWnJsQ1F6YkpJcVpuSDV6ZHhQUtIB8gFBVV95cUxQbU9fcm9FdzFtbkhNS2FJWE1SZTBfaDlVMWNGNy1fS2dJazA3V3FxYTRsRTZ2dk5ZWk9NcUNRa0Y3SXo5WU1oUlZ2dXllb3VPMHVUT0RjOFhRQTNUV1ZmSzlUUkdKY1FGTVpBaW9DZ0N3bVFZWC1kTERDR0M0SGpQTlFxdnVwenVrSmJ6S2ZEWGdKemk2VkhOelhPS0lMM1RuZXByc2pWdGVVeGJOS3NtX09XVkJWeEo4c3h1QzhuMjE4MktNYUFHRU91VzRBcnpjb2Zmdm03c0w0MXNLajBNS2sxc2Rzem5vM2dsMVMxcXM1QQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 25 May 2024 07:00:00 GMT",
        "title": "Vitalik Buterin proposes the first block on Taiko mainnet, appreciates Ethereum-equivalent rollup - FXStreet",
        "content": "Ethereum cofounder Vitalik Buterin proposed the first block on Taiko mainnet.\n\nButerin appreciated the Layer 2’s rollup based approach to scale Ethereum.\n\nTaiko recently announced the eligibility for its TKO token airdrop.\n\nVitalik Buterin proposed Ethereum-equivalent Layer 2 rollup Taiko’s first block on its mainnet. The Ethereum co-founder appreciated the project for launching as a based rollup and adopting a different approach than other Layer 2 chains.\n\nEthereum benefits from scaling solutions adopting different approaches to the same challenge posed by the chain, slow transaction speed and throughput.\n\nButerin proposes first block on Ethereum-equivalent Layer 2 rollup\n\nVitalik Buterin, co-founder of Ethereum supports projects that scale Ether, Layer 2 chains. Buterin supports Taiko, a blockchain that labels itself an Ethereum-equivalent rollup. The Ethereum co-founder acknowledges that Taiko has taken a different approach to tackle the scalability problem of the Ethereum blockchain.\n\nButerin proposed the first block on the project’s mainnet and wrote on the block: I'm excited to see that Taiko is launching as a based rollup. Ethereum benefits from L2s taking a plurality of different approaches, and I appreciate them being among the first to go in this direction.\n\nLayer 2 chains are focused on increasing transaction speed (for faster finality) and transaction throughput (higher number of transactions per second) without giving up on decentralization and security.\n\nButerin appreciated Taiko for their innovative rollup based approach when most Layer 2 chains run parallel chains to reduce cost and transaction processing time.\n\nIn an official tweet, Taiko recently announced the TKO token airdrop."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxPV3E1c3BRUF9xSndXMml5SENJMVFTcEJ2enUtOWdQOGV5aXVyYzBvS2hSZ2VKekh6UFdJVmY2Mnc3ak9LaHJLTERCcnFuTU1XOUd4VXIyOXVodWFKc1dTN3E1M3laVC1qOWF5SlZwVFMyT2xMT2Q2TF92dFA0cW9jYTdkUWx2UTVXX21nWTVkZmJSYVpVTVg3aW1tQ0ZhRWVVNi1YRVVMdEEzQmFvQnV5MjU1Z0zSAboBQVVfeXFMTnBWSURFX1RETVhWcjhhQmF5ckZOdGdmMEdLd1hXY0NuanNBWUdTQ0kwbkFIUk1TVWY3bXY2WFBITzA4QVBNSDUtYktkWXBxa3VQX0wwUWN3Zk5SbS1Pa3BPaUQwWndSa1JmMVE2c0xoSzRpckVyS0pRdG9kS2hxVUxRS29JYXpGWm5wSk94SFBaUlM4TEdJYUcyWGRWcEE1Y210Y0JDMzNFZlNMR2VWc2kyVzJ0QUwzMU93?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 25 May 2024 07:00:00 GMT",
        "title": "Solana (SOL) Plummets 10%, Here's Why, Ethereum ETF Effect: Will It Kick In? Cardano (ADA) Brand New Support Level - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nSolana lost around 10% of its value in an unexpected manner. The asset that looked well-positioned for the rally after the preliminary approval of the Ethereum ETF is currently looking weaker than the rest of the market, and it's not clear if it's going to recover properly.\n\nExamining the chart, Solana experienced a sharp decline, dropping from around $176 to $164. This significant drop has brought SOL down to test its support level at $160, which has previously acted as a strong support area. If this level fails to hold, the next major support lies at $150, corresponding with the 200-day moving average (orange line).\n\nOn the resistance side, Solana faces immediate resistance at $176, a level it struggled to maintain before the recent drop. Above this, the next key resistance is around $190, where the 50-day moving average (blue line) currently resides. Breaking through these levels would be necessary for any substantial recovery.\n\nSeveral factors could be contributing to Solana's decline. First, market sentiment following the Ethereum ETF approval has been mixed, with some assets benefiting while others like Solana suffer. Additionally, technical factors such as failing to maintain key resistance levels might have triggered stop-loss orders, accelerating the sell-off.\n\nAdvertisement\n\nFor traders and investors, the $160 support level is critical. If Solana can maintain this level, it may consolidate and attempt another upward move. However, if it breaks below $160, the next significant level to watch would be $150. This could indicate further downside potential, and investors might need to brace for more volatility.\n\nEthereum stays composed\n\nThe expected kick in price that many attributed to Ethereum's ETF effect turned out to be a fiasco. There are quite a number of factors that could be responsible for bringing out such poor price performance, although, for the time being, the more important question remains: could there be price growth ahead, rather than talks about the failed rally?\n\nEthereum, until this point in time, had not been able to really breach key resistance levels, even after ETF approval. Critical reasons behind this are the kind of approval — it was not the full-blown S-1 type — and, hence, the doors for further regulatory issues are still open.\n\nBesides, the Division of Trading and Markets gave this consent under delegated authority, which is subject to challenge over the next 10 days. All this amounts to some additional uncertainty that adds to the overall position of the markets.\n\nBut it is not all bad over the long term. The plain fact that any acceptance of an Ethereum ETF, even partial, sets a precedent in this space and sets off further potential and larger instances of crypto adoption.\n\nCardano's weird position\n\nCardano is not the most noted asset in the market, does not bring much volatility and, therefore, did not form very noticeable moves in previous weeks. However, we can see some potential here because ADA is approaching a major support, which can afterwards serve as a base for a reverse.\n\nAt this point, the chart is showing Cardano establishing a new level of support around $0.45. This level has been tested several times and has held up under the pressure of the downside, perhaps pointing to some real interest in that price. The volume spike on this new movement definitely strengthens the case for this to be an important level for the price. If ADA can hold onto this level, it might serve as a nice base upon which to initiate an upward move.\n\nOn a daily chart, ADA has its immediate resistance located at $0.50. This is a price level at which the ticker has seen rejections in the onward price action for the last couple of days. One critical thing to note is that once breached, the current fanatical rally could see a target at $0.55, exactly where the 200-day moving average lies."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxPbjVxcTJGaHBpLW5yUVB3NmFsQm9GRGxXMVhOX0RQRlJ6WHFRUE5KWE1ic05QWkdFNGtIR2RTOEFkNjJOdTVyLUZQcm5TaUZXdzYyTE5hQmJWak5TT1NjcFRHWV9OdDlwTEpRZzZkXzd4MTRQT2NFd0ZKVFRHRXpMY0tkVS1fOFQ4dkJjaVJnY05DU091dHdZRVZYbzJONnJkSFc2UVZFUTLSAa4BQVVfeXFMT29xYzNHUWkyUGFvYzRYYWYzdmYwMERpOUF5UnRRNTFrbk84RVZvQUpaWFNFSlhvS1Z4OXJsWldDRUZrVmpFMkVGX1JUWTQtNGVvOWk2S2tUNzlJa0VVTURqS05SUW1wRk1WbXVZZlJySk1KLUlNNGotN21sZkYxUlBNZkRoRU9iZThqcFJjRzZPQzlvT0ZIRThHeTJHaDlRWTllcWozWjJqMTZzQ2x3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 25 May 2024 07:00:00 GMT",
        "title": "Vitalik Buterin Proposes First Block On Ethereum Layer 2 Taiko With Optimistic Note - CoinGape",
        "content": "Vitalik Buterin, the co-founder of Ethereum (ETH), has proposed the first block in the preparation of Taiko’s mainnet. This marks a significant milestone for the Layer 2 scaling startup. In a notable message embedded within the block, Buterin expressed his enthusiasm for Taiko’s launch and the broader implications for the Ethereum ecosystem.\n\nVitalik Buterin On Taiko Mainnet\n\n“I’m excited to see that Taiko is launching as a based rollup,” Buterin wrote, according to the message on the Taiko mainnet block. Moreover, he highlighted the innovative approach Taiko is taking. Furthermore, he continued, “Ethereum benefits from L2s taking a plurality of different approaches, and I appreciate them being among the first to go in this direction.”\n\nadvertisement\n\nTaiko aims to address Ethereum’s scalability issues by making transactions cheaper while preserving the network’s core attributes of being censorship-resistant, permissionless, and secure. The startup is developing a “Type 1” ZK-EVM, a ZK-rollup that is fully compatible with the Ethereum Virtual Machine and supports zero-knowledge proof computation.\n\nIn addition, he this technology allows for more efficient and secure transaction processing without compromising on decentralization or security. Hence, the launch of Taiko as a ZK-rollup represents a significant step forward in the evolution of Ethereum’s Layer 2 solutions.\n\nBy leveraging zero-knowledge proofs, Taiko can offer scalable and cost-effective transactions, which are crucial for the widespread adoption of decentralized applications. Moreover, Buterin’s endorsement underscores the importance of diverse approaches in the Ethereum Layer 2 space, which are essential for the network’s long-term success and sustainability.\n\nAlso Read: Ethereum ETF To Mirror Damage Caused By Sam Bankman-Fried & CZ: Better Markets\n\nTaiko Genesis Airdrop\n\nEarlier, Taiko revealed plans for an airdrop targeting its community members prior to its mainnet debut. This initiative, called the “genesis airdrop,” will see 5% of the total 1 billion token supply distributed.\n\nCommunity members eligible for the initial airdrop include those who have engaged with the Taiko testnet. In addition, those who served as block proposers and provers, contributed to specific GitHub repositories, and participants in the Ethereum ICO are also eligible.\n\nThe token distribution for Taiko involves 48.5% allocated to significant stakeholders. Out of this, 20% is designated for Taiko Labs and its core team, 16.88% for the Taiko Foundation reserves, and 11.62% for investors. Additionally, the DAO Treasury will receive 20% of the tokens.\n\nOther allocations include 5% for Grants and RetroPGF, 5% for liquidity and market making, and 10% for the Trailblazer airdrop, which is separate from the genesis airdrop. Moreover, the TKO genesis airdrop can be claimed once the Taiko Layer 2 mainnet becomes operational.\n\nAlso Read: Vitalik Buterin Receives $1M Starknet Grant, STRK Price Soars 3%\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxQcVpEc1hzRnZPRTZWeml2bVZOQ3dfMUwzNkhobldfUTRmUFc0N0tOSzN3UTBUbkEzM1l1MHZRektxNG05SmhGbUhCVkRZSUZ6ODllZmpzNXI2R0dMT0d0MFlTUm9UZjM0Z1lIXzVGVnRxSmZPRDllYmxJSG9EUjQtd2Nn0gGHAUFVX3lxTE9xSm83U25zMFJManU4bTZSYXFlSk9tblpybDVaS2ttcHJHdHllc2lBMW1idFI0VXZqdWNuTnBFTmpJODktTVZzMDlUSW53MXRUX3BjWnNHYjVZNHZUeWI4eWNJQUVIeGthV1JvU1I0dzY4NF82bkJnd24wRS1aX1psUkVrUDMzaw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 25 May 2024 07:00:00 GMT",
        "title": "Ethereum Foundation Addresses EigenLayer Token Dilemma - CoinGape",
        "content": "In a swift response to growing concerns over potential conflicts of interest, the Ethereum Foundation announced an accelerated effort to establish a formal policy. This initiative comes after revelations that two of its researchers received “significant” incentives from EigenLayer, prompting a broader discussion on the need for clear governance frameworks within the organization.\n\nEthereum Foundation Ramps Up Conflict Policy Work\n\nThe Ethereum Foundation, under the stewardship of Executive Director Aya Miyaguchi, has recognized the inadequacy of relying solely on culture and individual judgment to mitigate conflicts of interest. Miyaguchi, in a recent statement on X, emphasized the importance of the Foundation’s neutrality in maintaining its pivotal role in the Ethereum ecosystem. She revealed that while the development of a formal policy had been underway, the current discourse has necessitated an acceleration of these efforts. An update on the policy, she assured, would be shared with the community soon.\n\nadvertisement\n\nMeanwhile, Lefteris Karapetsas, a former Ethereum software engineer and the founder of crypto portfolio tracking tool Rotki, voiced that the Foundation should provide adequate compensation to its staff. He argued that sufficient internal rewards would prevent the need for team members to seek external compensation, which could lead to conflicts of interest.\n\nEigenLayer Innovates in Ether Staking Space\n\nThe issue came to light when Justin Drake, an Ethereum Foundation researcher, disclosed his advisory role with the Eigen Foundation on May 19. Accompanying the role was a substantial incentive in EIGEN tokens, potentially worth more than all his other assets combined, primarily ETH. Drake stated that these tokens, accruing over three years, represented millions of dollars. He committed to reinvesting all proceeds into the Ethereum ecosystem, either as investments or donations, with a focus solely on researching restaking risks.\n\nThis disclosure prompted Ethereum co-founder Vitalik Buterin to engage in a public discussion with Jordan Fish, also known as Cobie, a prominent crypto trader. The dialogue centered on the potential conflicts of interest arising from Ethereum Foundation members taking advisory positions at EigenLayer. Buterin’s involvement underscored the high stakes and sensitive nature of governance and ethical practices within major cryptocurrency organizations.\n\nJust two days after Drake’s disclosure, Dankrad Feist, another researcher at the Foundation, announced a similar advisory position with EigenLayer. He clarified that he acted in a personal capacity, focusing on risks and decentralization, and was fully prepared to adopt contrarian views on EigenLayer. Unlike Drake, Feist did not pledge any financial reinvestments into the community, which highlighted the varied approaches among Foundation members towards handling external engagements.\n\nEigenLayer itself is a burgeoning platform that allows users to deposit and re-stake ether from various liquid staking tokens. The platform aims to allocate these funds to secure third-party networks or actively validated services, representing a significant innovation in the staking landscape.\n\nAlso Read: US Inflation News: Bitcoin Rises As New Data Raises Hopes For Early Fed Rate Cuts\n\nMaxwell Mutuma Maxwell is a crypto-economic analyst and Blockchain enthusiast, passionate about helping people understand the potential of decentralized technology. I write extensively on topics such as blockchain, cryptocurrency, tokens, and more for many publications. My goal is to spread knowledge about this revolutionary technology and its implications for economic freedom and social good.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxPVFYzOXlyS0MwdHRqcU9SWlhGY2RQSlBxSFNjdXRKWUF6TVZ6TmxtbkpKMUR0UjlEanh5VHhFUG5rWmpSN3VnamktdXFYOHlpRVZmQnYzSFp2UXpkTFlaT25LVHRUQXpvM3NWSVJWX3JwYVVzT3VaTnJoWnEwdUV1T09hcU5lQmVEVklXZ2JicWN4XzhLR1gxMTRjZm95SGplam1iNTZPUEFaNWRyYlozWERsanAwM1hiNE1lcVRsV0F0UdIBwgFBVV95cUxPVFYzOXlyS0MwdHRqcU9SWlhGY2RQSlBxSFNjdXRKWUF6TVZ6TmxtbkpKMUR0UjlEanh5VHhFUG5rWmpSN3VnamktdXFYOHlpRVZmQnYzSFp2UXpkTFlaT25LVHRUQXpvM3NWSVJWX3JwYVVzT3VaTnJoWnEwdUV1T09hcU5lQmVEVklXZ2JicWN4XzhLR1gxMTRjZm95SGplam1iNTZPUEFaNWRyYlozWERsanAwM1hiNE1lcVRsV0F0UQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 May 2024 07:00:00 GMT",
        "title": "Ethereum ETF Hyped Boost Altcoin Sector, Is A Solana ETF And Ripple (XRP) ETF Coming? - Blockchain News",
        "content": "Ethereum ETF has crypto investors considering potential applications for Solana ETF and Ripple Labs XRP ETF.\n\nInvestors are speculating about the Ethereum ETF’s approval and its implications. The news has renewed interest in other altcoins, as investors expect the Solana ETF and XRP ETF to be next in line for approval.\n\nHowever, while interest in a potential Solana ETF and an XRP ETF is high, investors are also watching RCO Finance (RCOF), a new crypto project offering investors various traditional and digital investment options. RCOF could change the crypto trading landscape for good.\n\nRCO Finance (RCOF) could be a better option for Solana (SOL) and Ripple (XRP) investors, who would still have to contend with market volatility in the long run.\n\nEthereum ETF Hype Market Performance\n\nThe Ethereum ETF is one of the most important events in the crypto space. It opens up the cryptocurrency ecosystem to institutional adoption and increases the chance that a potential Solana ETF and Ripple Labs XRP ETF will be launched.\n\nNews of Ethereum ETF’s approval has already affected the market. The hype behind Ethereum ETF has driven the price of ETH by 1.50% to around $3,805 in the last 24 hours.\n\nInvestors expect the upward trajectory to continue and the coin to break into $4,000 in the coming days.\n\nWith an increased market capitalization and trading volume of $452.70 billion and $32 billion, the interest in Ethereum ETF can potentially push the coin past its previous all-time high to $5,000 later in the year.\n\nAs the situation develops, crypto traders expect Ripple, an owner of XRP, to apply for an XRP ETF following the success of 13 Bitcoin (BTC) ETF applications in January.\n\nThe hope is to boost the value of XRP with the hype, legality, and liquidity that a potential ETF can bring. Other altcoins could also be in the mix for a future application similar to Ethereum ETF, with investors mooting a Solana ETF.\n\nHowever, if crypto traders are simply looking to improve the price of their assets and portfolios, RCO Finance’s (RCOF) crypto trading platform offers far easier ways to improve portfolio performance and increase profits.\n\nRCO Finance (RCOF) to Protect Portfolio Values in Uncertain Times\n\nAs news of Ethereum ETF saturates the market, holders of RCOF could see their chances of improving profits rise significantly. RCO Finance is in its presale stage, and even then, it promises investors a potential 1000% profit.\n\nThis platform helps users improve their profit margins by lowering transaction costs, offering opportunities to earn passive income, and offering interest on presale tokens. Investors never need to go through the troubles of a Solana ETF or Ripple XRP ETF.\n\nThe platform’s main selling points could make it the perfect investment vehicle for crypto traders to bridge the gap between the cryptocurrency market and the traditional investment market. The platform can also serve as a safe zone from volatility, which is common in crypto.\n\nWhy Crypto Investors Should Consider RCO Finance (RCOF) Ahead of a Potential Ripple and Solana ETF\n\nRCO Finance (RCOF) is a crypto trading platform that allows users to exchange digital assets for traditional investment options such as stocks, bonds, real estate, etc.\n\nAmid speculations around a potential XRP ETF and Solana ETF application, XRP and Solana (SOL) investors can easily diversify their portfolios using the profitable options provided by RCO Finance (RCOF).\n\nThe investment options provided in this platform could improve users’ portfolios and profit margins more than any potential XRP ETF or Solana ETF could.\n\nThis crypto trading platform also offers an AI trading tool that uses advanced machine learning to analyze market trends and identify potential investment opportunities. The tool can also assist users in making trades when offline.\n\nHowever, if you would rather not risk your funds, investors can earn passive income by providing liquidity pools through the platform’s automated market-making (AMM) option.\n\nRCO Finance’s (RCOF) crypto trading platform leverages blockchain technology to provide a secure trading platform for all users. Blockchain protocols will also verify and authorize transactions on RCO Finance (RCOF) to prevent fraud and fund loss.\n\nThe RCO Finance (RCOF) token has passed its audit and is currently in the first stage of its presale. The coin is available for $0.0127 per coin. When this token enters its second presale stage, crypto traders can make more than 1,000% ROI.\n\nFor more information about the RCO Finance Presale:\n\nVisit RCO Finance Presale\n\nJoin The RCO Finance Community"
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxOWU5NcW9lajBpZXN3QnZVNFZwRHZsSFF6alpfQTdGREVpQjltODdsZUN6MEhJMElZMnY2aC00d0JYb0lLUWNFNUJ6bGhZdzFWN1QzeFhJVzQ2VFIyM24zUFpzclc5ekQ5Z3lkbXo0bEhsQkhDd2xVMUJsVWloMi1uaEt5NlZxM3NLZmlr0gGQAUFVX3lxTE5ndUlqMElITjktVXBBSDhrcEtGWC1ZNTJMMkhGQW1oeTEwTDV5R0ZXU2U1ZHBvZGtlc1Rhc05mS2VkazNSRWpObUMxZ0ZrY3dlOUdCQmYtR3RhUG9BcG5FRXZkOTlsa2dZOFpyOGJoZUN6b09Ebm9Bc1RzbThjNGd6NHNDbmRfbG9UVDZYUi1mMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 May 2024 07:00:00 GMT",
        "title": "How Solana’s NFT market surpassed Ethereum’s – A 30-day snapshot - AMBCrypto News",
        "content": "Solana’s NFT buyers and sellers remained higher than those of Ethereum\n\nSOL’s price gained bullish momentum, but the trend might change\n\nSolana [SOL] has once again dominated its competitors like Ethereum [ETH] in the NFT space over the past month. Now, while this seems optimistic at first glance, there might just be more to the story. Let’s have a look at how both of these NFT giants fared against each other.\n\nSolana beats Ethereum\n\nCoin98 recently shared a tweet underlining the latest datasets from the NFT ecosystem. According to the same, Solana is now ranked #1 on the list of blockchains in terms of the most NFTs created in the last 30 days. Apart from Solana, Polygon and Base also made it to the top three on the same list.\n\nHere, what is also worth mentioning is that Ethereum took the 10th spot on the list. While 32 million NFTs were created on Solana, only 1 million NFTs were created on Ethereum. This gave SOL a whopping lead of 31 million.\n\nAMBCrypto’s analysis of DappRadar’s data revealed that STEPN, SMB Gen2, and Mad Lads were the top NFT collections on Solana last month. Oddly enough, y00ts and DeGods, two projects that recently migrated to Solana, couldn’t make it to the top 5.\n\nWhile the aforementioned datasets imply one thing, a look at the bigger picture might imply something different entirely. For instance, AMBCrypto’s analysis of CryptoSlam’s data revealed that while Solana’s monthly NFT sales volume was merely $99 million, Ethereum’s sales volume stood at $193 million.\n\nNonetheless, Solana’s number of NFT buyers and sellers remained significantly higher than that of Ethereum.\n\nSOL turns bullish\n\nWhile Solana’s performance in the NFT space remained positive, SOL’s price action once again turned bullish. According to CoinMarketCap, SOL’s price surged by over 2.5% in the last 24 hours. At the time of writing, the token was trading at $169.30 with a market capitalization of over $76 billion.\n\nThanks to the latest price uptick, the token’s weighted sentiment hiked too. This meant that bullish sentiment around the token was dominant in the market. Additionally, its social volume also appreciated on the charts, highlighting SOL’s popularity.\n\nHowever, this trend might not last as a key derivatives market indicator flashed bearish signals at press time. Coinglass’ data revealed that Solana’s long/short ratio fell over the last 24 hours.\n\nRead Solana’s [SOL] Price Prediction 2024-25\n\nHere, a low ratio is a sign of bearish sentiment, where there is more interest in selling or shorting assets."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxPYXpFczNVVmh0SlBhQno5V3FOQVBYNl9HcVdCNTlRRUJpT1ZseDk3VnBIUHFyODBudG9EMTdpV29qaVNLc2NXZnlTNjNnNkdNaENGbXI4RllOX0hQcFFySGhWNVBiajI0RFBISzByTmhaLUxpLUZ6cWU3cHdvMG5oM2o1S2ZrZnNPWWY0MkdOcko2U01oYmg0LTFfUHV3bFZ0REdNazBsZWlxd9IBrwFBVV95cUxNQzRZWFMwWWtVTW9wT1hNb3ctT1FEYUJpbWJOaF9Hdmp3a3k4Rm51QUtra1JPZkpCN1NRT1lJci1hZ2NUelo4MGRXalpRQUI1aDN6clNzMENBTmJtbGM0OFZ6OHFrQ0Y2R2g2SWlVX0FjNzZ4Zkh4VUw2dHV2Y051aDRlcEpQZXhUWUtXTm4yV0dnYno2VFZtUTdvS3doYmQxekhzd2xiM0w4M2xMNUhv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 May 2024 07:00:00 GMT",
        "title": "Ethereum Shifts Gears: Breaks Key Resistance, New All-Time Highs Next - NewsBTC",
        "content": "Ethereum (ETH) is currently at the forefront of an impending market surge, as indicated by a significant technical breakout. According to crypto analyst Jelle, Ethereum has recently emerged from a bearish pattern particularly breaking out from the “falling wedge” and flipping key resistance into support zones.\n\nJelle reveals that Ethereum is currently pushing for the $4,000 mark which makes the possibility of reaching new heights seems more tangible. This movement marks a significant turnaround from previous trends, setting the stage for potentially record-breaking price levels.\n\nRelated Reading\n\nEthereum Bullish Turn: Analyst Highlight Positive Bias In ETH Options Across All Expiries 4 months ago\n\nThe Bullish Shift: Ethereum Breakout from a Falling Wedge Explained\n\nJelle’s recent observations come during a period of strong performance for Ethereum, with the cryptocurrency showing a 30% increase in value over the past week alone.\n\nEthereum stands at $3,951 at the time of writing, having climbed an additional 2.5% in just 24 hours. This notable uptrend underscores the growing investor confidence and market momentum that could drive Ethereum’s value to new records.\n\nNotably, a falling wedge pattern in technical analysis is a signal that often precedes a bullish market reversal. Characterized by converging trend lines that meet at a downward slope, this pattern typically concludes with a breakout to the upside as buying pressure overcomes selling momentum.\n\n$ETH broke out from the falling wedge, then flipped key areas into support & now pushes for $4,000. New highs, and new all-time highs are next. Higher. pic.twitter.com/pjrk8X2FYA — Jelle (@CryptoJelleNL) May 27, 2024\n\nEthereum’s recent breakout from this pattern signifies a potential reversal of its prior downtrend and transforms previous resistance levels into new supports, laying a foundational bullish sentiment.\n\nThis technical progression is critical as it indicates a shift from bearish to bullish sentiment, suggesting that Ethereum might recover from its previous lows and embark on a sustained upward trajectory.\n\nAnalysts like Jelle see this as a precursor to more aggressive buying behavior, potentially propelling the asset toward unprecedented price levels.\n\nBroader Market Sentiments And Predictions\n\nThe positive outlook for Ethereum isn’t isolated. Notable crypto analyst Defi Mochi predicts that the ETH price could soar to between $9,500 and $12,000.\n\nAccording to Mochi, this projection is based on a combination of factors, including increasing political support for cryptocurrencies and the fact that Bitcoin has yet to reclaim its all-time high.\n\nWith that said my realistic target for $ETH is approximately in the $9.5k to $12k range. Given\n\n◆ increased political support for crypto\n\n◆$BTC being barely at previous ATHs\n\n◆ increased adoption of $ETH by institutions I Think none of us are bullish enough on Ultrasound Money. — Defi_Mochi (@defi_mochi) May 26, 2024\n\nInstitutional investors’ adoption of Ethereum is also a critical factor in the prediction. As more institutions integrate ETH into their portfolios, their market dynamics are expected to stabilize further, attracting more significant investment flows.\n\nRelated Reading\n\nArthur, the founder of DeFiance Capital, aligns with this bullish sentiment, forecasting that Ethereum could reach $4,500 shortly.\n\nFeatured image created with DALL·E, Chart from TradingView"
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxOblVsWnRGaXhPLUNfNlhFLVVBMFc1emY1bHRHUUZwZ3pOaWJpMDM5dkpuVEpqWmlxaFU5M1VFVjgxVG9jMy1sUUxBaTBGcXFpX1lVTUp4RVRzRm5TM2Q2MGdNOFo3MWVZN3VDNGxlU3BhRkpFOXBUMGJDYUhjQ2ZPSUlsQ3NxTk5iR2VtM2l0bGhqUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 25 May 2024 07:00:00 GMT",
        "title": "Ethereum price prediction for June 1 as whales move $118 million ETH - Finbold - Finance in Bold",
        "content": "Ethereum (ETH) is looking to reclaim the $4,000 mark after receiving a major boost from the Securities and Exchange Commission (SEC).\n\nExcitingly, Ethereum investors are anticipating a potential surge in the cryptocurrency’s value following the U.S. regulator’s approval of a series of first-spot ETH exchange-traded funds (ETFs).\n\nNotably, there is a buzz of speculation about the possibility of Ethereum mirroring the price movement of Bitcoin (BTC), which experienced a significant rally after the approval of a similar product.\n\nAmid the rollout of the ETFs, Ethereum is witnessing significant whale activity. According to data shared by Whale Alert, three major transfers were observed from unknown wallets to the crypto exchange OKEx on May 25.\n\nThe transactions involved 9,019 ETH (approximately $33,776,166), 22,429 ETH (valued at around $83,993,750), and 26,925 ETH (worth about $100,832,790), all moving to the exchange.\n\nETH whale transactions. Source: WhaleAlert\n\nThese transfers, totaling 58,373 ETH and equating to $118,602,706, have led to speculation regarding the impact on the valuation of the second-ranked cryptocurrency by market cap.\n\nETH price prediction\n\nOverall, significant movement of such large sums into exchanges could suggest an anticipation of heightened trading activity. Historically, large transfers to exchanges have sometimes preceded major price actions, either due to impending sell-offs or strategic positioning for significant market events.\n\nTo gather insights into how Ethereum is likely to trade in the coming days, Finbold turned to CoinCodex, leveraging its AI-powered machine-learning algorithms. According to CoinCodex’s projections, Ethereum is expected to trade at $3,813 on June 1, representing an increase of almost 2% from the current price.\n\nEthereum price prediction for June 1. Source: CoinCodex\n\nNotably, the price projection could set the stage for Ethereum to target new highs following the ETF approval.\n\nFor instance, crypto analyst RLinda suggested in a TradingView post on May 24 that the approval could act as a bullish catalyst. According to RLinda, if Ethereum consolidates above $3,827 and surpasses $4,095, it will likely target a new record high.\n\nHowever, RLinda also cautioned that history might repeat itself, similar to the pattern observed with Bitcoin after the approval of BTC ETFs. Market makers could create a trap by causing a quick drop in price before an upward movement.\n\nEthereum price analysis\n\nBy press time, Ethereum was trading at $3,741. On the weekly chart, ETH has rallied by over 20%.\n\nEthereum seven-day price chart. Source: Finbold\n\nMeanwhile, the ETF approval acting as a catalyst for attracting institutional investors should encourage ETH bulls to work harder to sustain the price above $3,500.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    }
]