[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxOS0ttOXV3cUNSNk1EWU81c3RiNGlFVlhObkNvUE5IdXE3WVBUVUwxNmkzakswNklQSDEyZ3Q3dnZCOXN2cVNZN0xONGwwekxDMjdVcVFDNzB6TFJaci1OZHN3VXhiODJBZWwwMERVQlhDelR0bHhNRS00aEdOX3FtNzIwcHRqTENGeHExeUFsc0tpTENfTi1uQg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Should You Buy Ethereum While It's Still Below $2,500? - The Motley Fool",
        "content": "There are three different catalysts that have the potential to send Ethereum higher in 2024.\n\nAmid the current crypto market rally led by Bitcoin, there's one crypto that seems to be getting completely overlooked: Ethereum (ETH 0.07%). That's somewhat surprising, given that Ethereum is the world's second-largest cryptocurrency, with an enormous $290 billion market cap.\n\nHowever, the hype around a spot Bitcoin exchange-traded fund (ETF) has focused investor attention squarely on Bitcoin. At the same time, a number of direct Ethereum rivals skyrocketed to triple-digit percentage gains last year, and have become the new darlings of crypto investors looking for maximum upside. But there are several reasons Ethereum might be undervalued at its current price of about $2,400.\n\nEthereum vs. the wannabe Ethereums\n\nAt the end of 2022, Ethereum was the talk of the crypto industry. It had just pulled off The Merge, which fundamentally transformed its blockchain to make it faster, cheaper, easier to use, and much more energy efficient. The hype around Ethereum grew to the point where some investors even thought that Ethereum might eventually surpass Bitcoin in terms of market cap.\n\nBut then came 2023. All of a sudden, rival blockchains like Solana started gaining traction with investors. At one point, Solana was up more than 1,000% for the year. Avalanche, another Ethereum rival, was up nearly 200% for the year. By way of comparison, Ethereum was up 90%, and seemed to be losing the attention of investors.\n\nSo the big question is whether Ethereum is still best-in-class. If you think that the so-called Ethereum killers are just a bunch of Ethereum wannabes with no long-term staying power, then Ethereum could be highly undervalued at its current price. But if you think that Ethereum's long reign as the top Layer-1 blockchain network in the world is coming to an end, then it's a completely different story.\n\nA spot Ethereum ETF incoming?\n\nRight now, the imminent arrival of the first spot Bitcoin exchange-traded fund (ETF) for the U.S. market is getting all the headlines. But, according to a growing number of crypto investors, a spot Ethereum ETF could be coming soon. And that means that Ethereum could soon get the same type of boost Bitcoin is getting right now.\n\nCertainly, the underlying logic makes sense. Wall Street is looking for more reliable ways to invest in crypto, and has apparently determined that the ETF investment product is the best way to achieve this. Once it can show that a spot Bitcoin ETF is successful, then it's time to crank up this formula for every other major cryptocurrency.\n\nGiven Ethereum's market heft -- it now accounts for about 17% of the market value of the entire crypto market, second only to Bitcoin -- it would only make sense that Ethereum would be next in line for a spot ETF. And, indeed, there is already an application in the works for just such a product. In September, Cathie Wood's Ark Invest filed for a spot Ethereum ETF. If the Securities and Exchange Commission (SEC) decides to approve this (admittedly, a big \"if\"), it could result in billions of dollars flowing into Ethereum, pushing up its price.\n\nA sexy new upgrade\n\nFinally, there's the matter of Ethereum's next big upgrade. Ethereum recently published its strategic roadmap for 2024, and one item on the roadmap that caught the attention of investors was something called EIP-4844 (\"Ethereum Improvement Proposal 4844\"). Basically, this is a proposed technical change that would enable the processing of transactions on the Ethereum blockchain to become much faster and more efficient.\n\nI know, I know. You're probably rolling your eyes right now. What a bunch of blockchain babble, right? But consider that EIP-4844 got J.P. Morgan really excited. In a research note to clients, JPMorgan specifically referred to EIP-4844 as a key reason it thinks Ethereum could outperform Bitcoin in 2024. That's because this major technical change would make it theoretically possible for the Ethereum blockchain to handle 100,000 transactions per second, up from about a dozen or so now. With that type of speed, Ethereum would basically be unstoppable.\n\nHow much higher can Ethereum go?\n\nFirst and foremost, Ethereum needs to convince investors that it is still the preeminent Layer-1 blockchain network. So keep an eye on how Ethereum deals with the growing threat from the likes of Solana. As long as investors buy into the idea that Solana is a faster and more cost-efficient version of Ethereum, it's hard to see Ethereum skyrocketing in price.\n\nWith that in mind, it's certainly possible to find a number of bullish Ethereum price predictions for 2024. Some crypto traders think that Ethereum could double, triple, or even quadruple in value. I may not be as bullish on Ethereum, but I'm certainly open to the idea that Ethereum could surprise a lot of people in 2024."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxNLTlRdmgwbUVsWml1MGctWDdPMXQ0czFRR3c2REs3b3IxVUpjM1BfdkhGSmhHcHBsRVJwREtpTVFWS2hyR2hVXy1INFpEbmE3NDNPcUhJTHFWN3gyWmpQbUZKWjBUZEU4SE9FX1lJM012czFNOTFWdGFwRHJWRWJPLUtLZWtSYS1zRTYybTNPZnRVUk5lMEhXa0JuemF4VnhXSUhjR9IBqgFBVV95cUxPX2tYNUxBNlJOTFRyTmZ4bHlRM3NMV2gwUHJKTUtOU2ZhajAxLV9OaUg4bTZhVERMZG9kU203R1M3NG5wenVJTTJFaXZoa3N4R3ViVW1TbjFVTm00U0xQMGZHWGJiUmFtTU45dWNkdjZEWW5rTjRsQUVpSTNPbUpMeHRVZW80eGw4ZXAwTHNrV3pKaWRMSVJFMXhIQk5mMkZhTWdoSWxMX3Ytdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Ether prices spike on hopes of an ETF — but the SEC signals that's less clear cut than bitcoin - CNBC",
        "content": "In this article BTC.CM=\n\nETH.BF= Follow your favorite stocks CREATE FREE ACCOUNT\n\nwatch now\n\nSt. Moritz, SWITZERLAND — U.S. Securities and Exchange Chair Gary Gensler fired warning shots to the crypto industry, casting doubt over whether digital coin ether would follow next in the footsteps of bitcoin to receive approval for an exchange-traded fund. After the bitcoin ETF approval, prices for ether — the token linked with Ethereum — spiked to their highest level since May 2022. That was because investors are betting on an ether — or ETH — ETF to be rubberstamped by the SEC next. The agency is due to give decisions on spot ETH ETF applications beginning in May. BlackRock, Invesco, Ark and VanEck are among the firms in line for approval, as well as Grayscale.\n\nThe SEC has long been an opponent of cryptocurrencies, and its bitcoin ETF approval in no way changed its stance in a big way. After the ETF decision, Gensler issued a statement in which he called bitcoin \"speculative\" and said it could be used for \"illicit\" purposes. One comment poured cold water over hopes of an ETH ETF. \"Importantly, today's Commission action is cabined to ETPs holding one non-security commodity, bitcoin. It should in no way signal the Commission's willingness to approve listing standards for crypto asset securities,\" Gensler said Wednesday after the SEC decision on the ETFs.\n\nCrypto as commodities or securities?\n\nA long-running debate in the U.S. is over whether cryptocurrencies are classified as securities or as commodities. Key to Gensler's comments was his reference that bitcoin's status as a \"non-security commodity\" was one of the reasons why the SEC was comfortable approving the ETF. Gensler made clear that \"the vast majority of crypto assets are investment contracts and thus subject to the federal securities laws,\" in the SEC's view. This complicates matters for an ETH ETF. \"One distinction which I think people have to look at which is that bitcoin clearly has been bucketed as a commodity, Ethereum, there's still some question. Is it a security? Is it a commodity? And I think until that's resolved, it cannot be look at exactly like the bitcoin product, in terms of how do you structure and ETF around it,\" Bill Tai, chairperson of Aktai, told CNBC in an interview at the Crypto Finance Conference in St. Moritz. Tai said that approving an ETH ETF is \"not as clear cut\" as was the case of bitcoin. \"I do think that it's not out of the range of possibility, but there are additional factors to consider around that one because of its classification,\" Tai said. Securities and commodities are regulated under different laws and by different agencies.\n\nWill an ETH ETF happen this year?\n\nCommentators are split on when an ETH ETF may come to the market. Some, like Antoni Trenchev, co-founder of cryptocurrency exchange Nexo, think it will happen this year. \"I'd watch what the SEC does and not what it says, because it wasn't long ago that the prospect of a spot Bitcoin ETF seemed like a distant dream. Things move very fast in crypto and investors are front-running what they believe to be the next big spot ETF approval,\" Trenchev told CNBC by email. \"You'd have to say now that bitcoin has knocked down the door it's only a matter of when not if others will follow — most likely in 2024 — and ETH is definitely the leader of the pack.\" Christopher Giancarlo, co-founder of the digital dollar project and former chair of the U.S. Commodity Futures Trading Commission, oversaw the introduction of bitcoin futures in 2017. He said that, in his experience at the regulator, the approval of one product opens the doors for others. \"Once we greenlighted bitcoin futures, there as a tremendous movement in the CFTC jurisdiction area for greenlighting ethereum futures and that did come 18 months later,\" Giancarlo told CNBC on Thursday. He added that he would be \"shocked\" if there weren't growing demand for an ether ETF. \"The SEC's going to have deal with the growing demand for that product,\" Giancarlo added. Others are a little more skeptical that the SEC could approve an ETH ETF in the short term.\n\nwatch now"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxOOGNWUWIyOTVPOWJlaVk0Y0lQc2pYaHhES3RYTHhsTER2cl9UaElwX0g1OF9hc1gzaC14Nk1NUjluWXUwQVc0NDU4QXRhLXJRYTNCT2d0QlFBTnhIRU01ZkkzbVM5V1pkZFpIRU1MWW14YUwydzVUNnI5VU5Vb2Z4c2F5LWp0OHVzb2ZHWGhvUHV3SmJTOFV0eUZJcE9fdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Two Powerful Blockchain Platforms of the Future: Ethereum and Solana - Paxos",
        "content": "Blockchain, once overlooked in the shadow of cryptocurrency, is now a powerhouse player in its own right with implications far beyond the financial sector. From improving supply chain integrity to facilitating transactions for a wide range of digital assets, its use cases are vast and varied.\n\nBut what lies at the heart of this innovative technology, and how can it be harnessed? It is helpful for enterprises across many industries to understand the fundamentals of blockchain and how key platforms like Ethereum and Solana are leading the charge in this technological revolution.\n\nWhat is blockchain?\n\nBlockchain is digital ledger technology that documents transactions across a network of computers. It can log and track everything from cryptocurrency payments to real-world assets to legal agreements.\n\nBlockchain technology is renowned for its security and immutability. The technology’s name stems from the fact that it’s comprised of a series of “blocks,” with each containing transaction data, a timestamp and a cryptographic hash of the previous block. Every transaction is linked in a “chain” and distributed across numerous nodes.\n\nBecause of the decentralized nature of the blockchain, there’s little risk of manipulation from entities like governments or financial institutions. In fact, a blockchain’s structure makes it nearly impossible to retroactively alter any single record without changing all subsequent blocks.\n\nBlockchain technology offers transparency and decentralization, making it an attractive option for transactional applications—among them, money movement, supply chain management and even digital identity verification.\n\nEthereum and Solana\n\nWithin blockchain technology, there are many different blockchain platforms. Two of the most prominent blockchain platforms are Ethereum and Solana, each with unique features and capabilities.\n\nEthereum (ETH): Ethereum, launched in 2015, is both a cryptocurrency and a platform for building decentralized applications. Ethereum introduced the concept of “ smart contracts ,” or self-executing contracts with the terms of the agreement written directly into lines of code. The latest iteration of Ethereum’s blockchain is secured using a proof-of-stake ( PoS ) consensus mechanism—essentially, th e process by which validators create new blocks. ( Learn more about consensus mechanisms and how they work here .)\n\nSolana (SOL): Solana is a newer blockchain platform that launched to the public in 2020. It’s known for speed and efficiency. It employs a unique hybrid consensus model, combining proof-of-history (PoH) with proof-of-stake (PoS). This enables it to process transactions rapidly and with lower fees compared to Ethereum. As such, Solana is an attractive platform for high-frequency trading and other applications requiring quick transaction times.\n\nEthereum and Solana have gained popularity because they offer solutions to common pain points related to scalability, speed and cost. These platforms have also sparked an entire ecosystem of subsequent innovation: Ethereum’s smart contract functionality has given rise to decentralized applications (dApps), decentralized finance (DeFi) platforms and non-fungible tokens (NFTs).\n\nThe future of finance: instant transfers and more\n\nImagine a world where international suppliers are paid the moment goods are shipped, employees receive compensation in real-time and complex financial transactions are settled instantly. This immediacy not only streamlines business operations, but also opens doors to new financial strategies like dynamic pricing. The ripple effects of such capabilities include more agile, responsive and competitive businesses and a transformation of the way global commerce operates.\n\nBlockchains like Ethereum and Solana have the potential to make such hypotheticals into realities. With their ability to power instant, 24/7 financial transactions across borders, blockchains may be particularly attractive to enterprises operating in multiple countries or those engaging in high-volume trade, not to mention the implications for sectors like e-commerce and digital supply chain management.\n\nBlockchain technology is evolving rapidly. Many enterprises need a hand when it comes to adopting it and maximizing its potential and a trusted partner can help you seamlessly integrate blockchain into existing operations.\n\nBlockchain is transforming the way we think about money, assets and transactions and is paving the way for new business models and strategies. With the right partners to help you navigate and implement blockchain systems, your business will be well-positioned to stay a step ahead in the digital finance era."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxQWm13TFg2M0pBSzYtV0NCQU80VnpGelJwa3dmUWd4Z1FjUG1vYUlGZkRBdmFpYkNLVFBvWUkyV25LYk5GelRKSnFrTExxdTdJcWZ2V1I5V2I3VkJhOEJuOFpnQzhCRHVDNFViTFlSaWhpVXFoa2pseTZHdXF6cklFMjNjclpyc0VDX1ZUQ3F0NjEtb2hRLTlMUExB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Ethereum applications take place as top gainers ahead of ETF announcement - crypto.news",
        "content": "According to CoinMarketCap, native tokens of Ethereum applications, including Lido DAO, Rocket Pool, and Aribtrum, take the lead ahead of spot Bitcoin ETF approval day.\n\nLido DAO (LDO) takes the top spot on the gainers on the Jan. 10 charts with a live price of $3.80, with a 24-hour trading volume reaching $385 million, in what is a 16.1% increase. The surge in the value of Ether (ETH) and native tokens of Ethereum-based applications is said to be driven by trader optimism surrounding the potential approval of an Ether exchange-traded fund (ETF) following the anticipated approval of a Bitcoin ETF in the United States.\n\nBlackRock’s iShares Ethereum Trust, a spot Ether ETF, may have its way paved by the approval of its Bitcoin counterpart.\n\nTop crypto gainers of the day | CoinMarketCap\n\nYou might also like: Stacks, Injective, Internet Protocol emerge as crypto top gainers\n\nFor similar reasons, Rocket Pool (RPL) has also seen an increase in value today, operating as a decentralized Ethereum staking pool that offers a competitive annual percentage rate (APR) of up to 4.3% for ETH2 staking. As of the most recent update, the live price of Rocket Pool stands at $31.76, accompanied by a 24-hour trading volume of $22 million, revealing a 14.9% increase in Rocket Pool’s value over the last 24 hours.\n\nRounding out the third spot is Arbitrum (ARB), which stands out as an Ethereum layer-two (L2) scaling solution, employing optimistic rollups to enhance speed, scalability, and cost-effectiveness within the Ethereum network. As of the latest data, the live price of Arbitrum is currently $1.94, accompanied by a 12.1% increase in value.\n\nWith the market experiencing significant volatility this week in response to ETF updates, investors are making many big moves in the crypto space."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxQOU1DeFJOa2xaOHZSUkZRbFEzdzJaR21fXzN4RlBKNU01cGp3ZkN5VF8tbTFMOFBva1RXWElLV2Rkb1BBNmNxeHlPcFhuVWN0bHBPRW5FMmdNSUVvblJ6SnlpNUJTcFNpWUY5dVdscGdTU0QxRmY4TXBjNVRmdmZiQlc3M1paRm85TDUwR2o0ekJPZ0FZYnc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Ethereum takes the lead over Bitcoin in derivatives trading volume - CryptoSlate",
        "content": "What is CryptoSlate Alpha? A web3 membership designed to empower you with cutting-edge insights and knowledge, powered by Access Protocol. Learn more ›\n\nConnected to Alpha Welcome! 👋 You are connected to CryptoSlate Alpha. To manage your wallet connection, click the button below.\n\nImportant: You must lock a minimum of 20,000 ACS If you don't have enough, buy ACS on the following exchanges: Coinbase Kucoin Orca\n\nConnect via Access Protocol Access Protocol is a web3 monetization paywall. When users stake ACS, they can access paywalled content. Sign up for Access ›\n\nDisclaimer: By choosing to lock your ACS tokens with CryptoSlate, you accept and recognize that you will be bound by the terms and conditions of your third-party digital wallet provider, as well as any applicable terms and conditions of the Access Foundation. CryptoSlate shall have no responsibility or liability with regard to the provision, access, use, locking, security, integrity, value, or legal status of your ACS Tokens or your digital wallet, including any losses associated with your ACS tokens. It is solely your responsibility to assume the risks associated with locking your ACS tokens with CryptoSlate. For more information, visit our terms page."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxQVVQzLTJJbk0tRUFwRzlYSW5oMjhDMXRpanRmWnFUYmo2RkVEXzdjbHgxUXJEaHJ4bGtNdzVkYXlpczZ1U0ROdEdoUWtmZExDdUgxQmtHb3EyVmlXTjBubmg4Q2IzeXY2NEdhSnRoaFp3Zy1EQnFHLUJuR1pOQkw3bjdDQXdOWG5NQ1ZHMFIyc09oSW1qR3QyVU93?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Fake Airdrop for Ethereum, Solana, Tron Users Carried out by Scammers - TOKENPOST",
        "content": "Fake Airdrop for Ethereum, Solana, Tron Users Carried out by Scammers\n\nHackers target the Ethereum, Solana, and Tron crypto communities by enticing them with a fake airdrop scheme.\n\nWallet drainers, previously fixated on executing crypto scams via EVM chains, have now expanded their horizons to target Ethereum (ETH), Solana (SOL), and Tron (TRX) communities.\n\nThis shift marks a concerning trend as these scammers venture into well-established crypto groups.\n\nPhishing Scams via Fake Airdrops\n\nThe modus operandi involves enticing crypto enthusiasts through fraudulent airdrops. The scammers create a webpage where users can supposedly claim Ethereum, Solana, and Tron airdrop rewards.\n\nThese scams are labeled an \"exclusive opportunity\" for the community, urging individuals to link their primary wallets for access. Scam Sniffer highlights that these fraudsters can drain various crypto wallets using this deceptive webpage.\n\nAccording to CoinGape, this development is particularly problematic given the popularity of Ethereum, the second-largest cryptocurrency, alongside Solana and Tron.\n\nThe lure of substantial crypto rewards might mislead investors, potentially resulting in significant losses amounting to millions or even billions in digital assets due to these wallet drainer scams.\n\nIdentifying and Avoiding Crypto Scams\n\nWhile scammers occasionally upgrade their strategies, identifying potential scams can still be achieved through simple checks.\n\nAccording to Blockworks, Scam Sniffer's shared snapshot reveals grammatical errors on the fraudulent airdrop webpage, serving as a red flag for cautious users. However, it's crucial to remain vigilant as scammers adapt and refine their tactics over time.\n\nTo stay secure, always verify the source of such links. If a reputable entity is not the source of the airdrop updates, it is advisable to steer clear of such offerings.\n\nFurthermore, heightened caution is necessary, considering recent incidents where hackers compromised verified X accounts of well-known companies like Certik and Mandiant to promote crypto scams.\n\nEarlier this month, Certik experienced a similar attack on its X account, followed by Mandiant on January 4, 2024, raising concerns about the security of even the most established platforms.\n\nPhoto: Nahel Abdul Hadi / Unsplash\n\nTokenPost | [email protected]"
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMi4gFBVV95cUxNWFZKQXJXX3J6RXZhRnlNNTNvMGNxalFfTGNObTNhY0RmY0pTU2U0azNIMlNqSlVqdzdXVUN3UGxUdGlDMDFYaVZNNFpnOEMtSktVXzh1LUNzZ1dKUTZ0eHotZXF0bGlqQ0pJYm16b1Jac2VTeG56UUl1WWRKT25vWEZ3TGlydjY2MUdNSVpEWTM5SkZaTXRLOGFKY05IQkdBSjJ3cm95YXB4b0V6UkNnMlIzYUE0TFZycDJra05ZeVpobG5HRzRtSWZEY2NwLWpjQVozVU8zUFA0YkhNeS13RDVB0gHnAUFVX3lxTE9oMkdlWGpwRTVGVzFlM19jTGJKX0pNeG93U1p3T1psNUkzYVZMcndVUDJRZXJmT2pfQ081SnJ0WUYtOVo4Y1dBT3lZemZmOWVWalVRVWhsa0lrdUVwLTBVY3o4YVR0U0pLWDVJdXpYWVBuR3FQcFJYbVQwYXlFMWVJdmhqcnNHQ1B6cnN5ZHlrWUxHU3Q4NlYySjUxTTFtX1lsZWlpVklVN2w1MHhzeUVGcHJINzY0SWNMTEdTcmEzZ3NiSlR2emdBV0xkc1dVSF93Z0tXVW9sRmpEYlp0b25xOGlVblpOWQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Classic Price Forecast: Chances of 21% correction wane on bullish market momentum - FXStreet",
        "content": "Ethereum Classic price formed a double-top reversal pattern that hints at a 21% decline.\n\nPrice indicators highlight the potential of the pattern failing due to bullish broader market cues.\n\nThe anticipated spot Bitcoin ETF approvals will likely have a bullish impact on altcoins, benefiting ETC.\n\nEthereum Classic price was seemingly adhering to the micro bearish reversal pattern, which failed despite the recent correction in the crypto market. The short-term outlook ahead of the spot Bitcoin ETF approval is now looking bullish as ETC is bouncing back from the crucial support of $19.33.\n\nEthereum Classic price notes a bearish reversal pattern\n\nEthereum Classic price on the 4-hour scale invalidates the double-top bearish reversal pattern that has been observed in the past four weeks. This pattern consists of two peaks or tops of nearly identical height positioned closely together, with a trough in between. It suggests a possible shift in market direction.\n\nThe potential trend reversal is indicated by the price encountering a resistance level on two separate occasions without successfully surpassing it. This is often interpreted as a sign to consider selling or initiating short positions as further declines in the market.\n\nIn the case of Ethereum Classic, this double top was formed at $23.42, with the neckline or support level of the pattern being marked at $19.33. This is also the breakout level, and an extended decline below this line would confirm the bearish reversal pattern. Furthermore, a successful pattern would only be observed when ETC falls to the target price of $15.24, which, according to the pattern, would register a 21% decline on the 4-hour chart.\n\nHowever, Ethereum Classic price took the other route and, instead of falling through the neckline, bounced off it to note minor recovery, trading at $19.90 at the time of writing. Although this does not rule out the potential for decline, the price indicators do suggest invalidation of the pattern is likely, too.\n\nETC/USD 4-hour chart\n\nThe Relative Strength Index (RSI) and the Moving Average Convergence Divergence (MACD) indicator are giving out mixed signals, with the former still sitting in the bearish zone and the latter noting a bullish crossover.\n\nEthereum Classic RSI and MACD\n\nIf Ethereum Classic price continues the current path and broader market bullish cues kick in, ETC could move sideways or upwards beyond $20 and invalidate the bearish pattern.\n\nOn the other hand, if the Ethereum namesake falls through the neckline and falls below $19, the bullish thesis would be invalidated, and the reversal pattern could be deemed mildly successful since absolute success would warrant a 21% correction."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNOWYybklzWE9YdXBNVUdGd3BaVll3UnBuWDhMeEtlTDM2VEtiN3VEbDkzdk5vOXpCdkQ3cFBRbkhxR0JYd0haM3RLQlBPWWlldzQ1VWlTWkN6bjEwQjdxUGdXbXBickJCM25wR2wzSmJpM2E1b0pLM1l2enZONGxiRjhTdzRzcGI1Nlg2dEV2eEV2d2QydEFxT9IBngFBVV95cUxNSFZwLUh1QnczYXFuVVlnWW9oV1BSTndHRmFHelVxZDV6ZEdSdXFrNTNZUTY5ZEZod3ZadjA2LUpfNlZWd0V0aVBfSVcyajJ0MlVBdHB2a182WV8yNVE2NEZrODkzdTY5ZXNKdU1lNWJidTdZc21TdktaVllscExiOGJZeDNLMTBkYVVRU2ZKcTFjLS1aalo1bUlpdTh2Zw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Price Prediction: Whale Accumulation Surges Ahead of Spot BTC ETF; Is $3K Near? - CoinGape",
        "content": "Ethereum Price Prediction: Ethereum, the second-largest cryptocurrency, currently shows a lack of bullish momentum contrary to the generally bullish sentiment around Bitcoin spot ETFs. The ETH price has been resonating between the $2400 and $2140 horizontal levels for the past five weeks, with the overhead supply preventing the buyers from a higher rally. Will potential approval from the US SEC bolster the Ether price to escape this uncertainty?\n\n$2400 Breakout Will Trigger a Direction Rally\n\nA steep support trendline leads to the current recovery trend in the ETH price.\n\nA potential recovery may face new resistances at $2680 and $3000\n\nThe intraday trading volume in Ether is $20.8 Billion, indicating a 68% gain.\n\nAn ascending trendline in the daily time frame chart shows the Ethereum price recovery is intact and the current sideways trend is likely a post-rally consolidation to recuperate the exhausted bullish momentum.\n\nadvertisement\n\nInterestingly, the Ethereum whales have accumulated nearly $1 billion worth of Ether despite its underperformance relative to Bitcoin. A recent tweet from renowned crypto analyst Ali Martinez reveals that the Ethereum smart money has significantly increased its holdings by accumulating more than 410,000 ETH tokens during the past month(December).\n\nThis accumulation amid the crypto market’s progress towards the first spot Bitcoin ETF hints the ETH may also witness a major impact of US SEC approval as the potential for spot Ethereum ETF will also accelerate.\n\nBy press time, the ETH price shows a 3.77% jump and teases a bullish breakout from the $2400 resistance level. If buyers succeed in closing a daily candle above this barrier, it could lay a solid foundation for additional upward movement.\n\nSuch a breakout could potentially result in a 10% rise in ETH, setting its next target at around $2,680. Following this, a prolonged recovery could target the $3,000 and $3280 mark.\n\nThis Support Prevents ETH From Major Correction\n\nOver the past two months, the ETH price has been receiving dynamic support from an ascending trendline. The coin price rebounded several times from this support indicating the buyers are actively accumulating at a dip which is a key sign of sustainable recovery. Thus, it also indicates losing this support could intensify selling pressure and trigger a new correction in this asset.\n\nBollinger Band: An uptick in the upper boundary of the Bollinger band indicator suggests the bullish momentum is strengthening.\n\nAverage Directional Index: A low value of ADX(15%) hints the ongoing consolidation has managed to offer buyers sufficient break to kickstart a new rally.\n\nRelated Articles:\n\nSahil Mahadik Sahil is a dedicated full-time trader with over three years of experience in the financial markets. Armed with a strong grasp of technical analysis, he keeps a vigilant eye on the daily price movements of top assets and indices. Drawn by his fascination with financial instruments, Sahil enthusiastically embraced the emerging realm of cryptocurrency, where he continues to explore opportunities driven by his passion for trading\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxPOEswMzlLSzBYTVdoaDUxdlhmc2JDVWgtVXBqREdjQS1hWGtGSWdabVhhRDV0RWthSHpGUzJHU2VRYXFlV1dLS2pjeTMzbExBd1E3SlVoS2pjRlFTTG1DSTFnYjhPYnhZNFZtNW50cWpYX1E2OEZCOEJUZGdTRTh2RFItdmpQeEFCUXfSAY8BQVVfeXFMTUhoTEJaX0VmRUpzenVVY1ZHRTYyclRXd25XeVhQMWpxb1lRLUQ0UXNoX1VRTVpjZEhoN1A0Yy1QMk4xNTlPSDZDQTBrS2tSczdBa29tRF8wbWZmYnVPdEZ0S2d3UTdLVjhhTzY3d1dQa1hWUVlIY05Ob1o3LTJlNG9DM2szRTZOaDBFX0RCWDA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "ETC Price Jumps 34% As Ethereum Classic Trading Volumes Surge - CoinGape",
        "content": "With the approval of the US Bitcoin ETF, altcoins have registered a strong rally while Bitcoin rests. Though the Ethereum price surged 10%, its off-shoot Ethereum Classic (ETC) has registered even greater gains. The ETC price is up by a staggering 32% trading at $27.74 with a market cap of $4.05 billion.\n\nThe Ethereum Classic Trading Volumes\n\nIn the wake of the Bitcoin ETF announcement, Ethereum Classic (ETC) has experienced a significant surge, surpassing the $26 mark for the first time since October 2022. The surge in trading volume suggests substantial interest from major traders.\n\nadvertisement\n\nDespite the notable price movement, the sentiment surrounding Ethereum Classic remains neutral at present, as indicated by on-chain data provided by Santiment. Investors are closely monitoring the developments in the Ethereum Classic market following the recent Bitcoin-related news.\n\nThe ETC Price Bullish Breakout\n\nIn the weekly chart analysis, Ethereum Classic (ETC) has shown a departure from the lower high formation that characterized the previous bearish trend until 2022. After a year-long consolidation range throughout 2023, ETC struggled to surpass the resistance at $23. A recent resurgence, however, has resulted in a bullish breakout from the consolidation range, signaling a notable trend reversal for Ethereum Classic. This breakout is seen as a significant entry point for traders on the sidelines. The heightened market activity has contributed to a remarkable 250% increase in the 24-hour trading volume, supporting the sharp upward movement and hinting at the potential continuation of an uptrend. Currently trading at $28.43, Ethereum Classic has formed a bullish engulfing candle in the daily chart. The breakthrough above the $25 barrier positions Ethereum Classic for a sustained bullish rally. The rising sentiment in the market is fostering increased risk appetite among investors, contributing to the broader uptrend in the altcoin market. Under favorable market conditions, Ethereum Classic’s price trajectory may lead to a breakout beyond multiple resistance levels, with a potential target of $40 on the horizon. However, should ETC struggle to maintain its momentum, a retest of the $25 level could be in the cards. Traders and investors are closely monitoring market dynamics to gauge the sustainability of Ethereum Classic’s current bullish momentum.\n\nBhushan Akolkar Bhushan is a FinTech enthusiast with a keen understanding of financial markets. His interest in economics and finance has led him to focus on emerging Blockchain technology and cryptocurrency markets. He is committed to continuous learning and stays motivated by sharing the knowledge he acquires. In his free time, Bhushan enjoys reading thriller fiction novels and occasionally explores his culinary skills.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxNUEVPdF92UjdSLUNpbVpJamxhczE5VENpdHg4QWZTX3NLMFJNQ2dVU3RQcHA5azc4UmRjNjhlUHNxRjlCY09hTE5JMlFUaVZfR2NMRjBKMGRJMGtiVkFmV3lCWDEwUUU4T04tT3dEdGQ2bjUwU3NQNGpDZ2lzN0xJaDBhS2tJUjgzSWEzZ0VMQUJHREdwcTZMZW1NMFlvS01Vcm1KQdIBqgFBVV95cUxNNE9pRkprUlUzaFpQZGFnVHNPRTNodEQ2ZHQwUGpWaGxWVUhOWUR5N3hOU09McFhyWkZWV3Bod05tTUV4Y0QxSXpYcnVGdDRfaUFVeDI2MndFQ0dZaS11V0lRU0JaMDg2ZWZNUGp4eGhXN3V3aUtVM0hsZTdzTVY0MF9aNmdveXNvZTlHMWZEZU5WeDZXR0hJVWxHRU5FOGRqUjRmdlJMUDNRdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Tests $2.4K as Bulls Look to Finally Take Control: ETH Price Analysis - CryptoPotato",
        "content": "Ethereum has been increasing in the past day in the hopes that an ETH ETF might be next in line on the SEC’s agenda.\n\nMeanwhile, the probability of a further bullish continuation seems to remain high, considering what the charts are demonstrating.\n\nTechnical Analysis\n\nBy TradingRage\n\nThe Daily Chart\n\nOn the daily timeframe, the price has been trapped between the $2,100 and $2,400 levels over the last month. A breakout from either side of this range can determine the trend’s short-term direction.\n\nA bearish breakout would likely result in a decline toward the 200-day moving average, located around the $1,900 mark. On the other hand, a break above the $2,400 level would pave the way for the price to target the $2,700 resistance zone in the upcoming weeks.\n\nThe 4-Hour Chart\n\nLooking at the 4-hour chart, the recent choppy price action becomes much more clear. The cryptocurrency has tested both the higher and the lower boundary of the range several times.\n\nCurrently, the price is testing the $2,400 resistance area. A breakout from this level would result in a rally higher toward the $2,700 area, while a rejection could lead to a drop back to the support zone at $2,100.\n\nSentiment Analysis\n\nBy TradingRage\n\nEthereum Open Interest\n\nWhile Ethereum’s price has been going through a consolidation phase, the underlying dynamics of the futures market are displaying an interesting sign.\n\nThis chart demonstrates open interest, which is one of the most essential metrics for future market sentiment evaluation. It measures the number of open futures positions. Higher values are typically associated with higher volatility and vice versa.\n\nIt is evident that while the price has been moving in a tight range recently, the open interest has dropped considerably. A significant decline in open interest without a price plunge is considered a bullish signal, as it hints at the fact that the futures market is not overheated anymore, and the price can continue its gradual uptrend in the coming weeks."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxPb3UyZWhERGotQVNKUlQzck4tR2JrSnkzcmoxQ2JGMlctZFRjNGd5Y09yYUU5TFkyaUcyTXhvY1VnTkpWdTMxOWRyanVrbU1SN3JVRWhnZFRGMGVzYlcxSTQ0dG94NVFOYWZKOTFkdS1tOV9HU0JRcWY3WHpSLXp3WUJxXy1KSXhPby1NM0JBSFV0THoteHVCOUlB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "The fake approval of the Bitcoin ETF greatly benefits Ethereum! - Cointribune EN",
        "content": "Wed 10 Jan 2024 ▪ 3 min read ▪ by Eddy S.\n\nThe crypto market has experienced intense turbulence in recent days, following a false announcement that teased the imminent approval of a Bitcoin spot ETF by the SEC. While this misleading information has disenchanted Bitcoin investors, it has paradoxically energized Ethereum and many altcoins, which have seen their trading volumes explode upwards.\n\nEthereum and Altcoins Boosted by Optimism over Bitcoin ETFs\n\nDespite the Bitcoin ETF illusion turning against the queen of crypto, Ethereum cheerfully crossed the symbolic threshold of $2,400, with a 2.8% increase. More importantly, the decentralized cryptocurrency benefited from very high trading volumes, indicating growing investor interest in this digital asset with multiple use cases.\n\nMany altcoins like Avalanche, Solana, or Cardano also jumped between 3 to 8% simultaneously. This bullish surge reflects the market participants’ optimism regarding a future approval of a Bitcoin spot ETF in the United States. Such a decision would pave the way for massive inflows of institutional capital, benefitting the entire crypto ecosystem.\n\nBTC Struggles to Bounce Back in a Volatile Market\n\nOn the contrary, Bitcoin is struggling to recover from its speculative excesses, after falling by more than $2,000 within 24 hours. Briefly surpassing the $47,000 mark, the original cryptocurrency fell back below $45,000, reflecting the market’s nervousness after the ETF hoax.\n\nSome are hoping for support around $46,200, but caution remains advisable. Bitcoin is now trading around $45,000, far from its all-time high in November 2021. According to many analysts, this could be a “bear market rally,” a faint uptick in a sustained bear market. Others are more optimistic about a lasting rebound.\n\nBitcoin’s Dominance Erodes in Favor of Ethereum\n\nThese sharp jolts demonstrate the gradual emancipation of Ethereum and altcoins from Bitcoin, despite its still overwhelming dominance, accounting for about 53% of the crypto market cap. Boosted by record volumes, Ethereum and others are now progressing according to their own dynamics, little affected by Bitcoin’s transient downturn.\n\nThis tumultuous episode reminds us of the volatile nature of the crypto Wild West, prone to extreme fluctuations based on false news or unverified rumors. It also marks Ethereum’s spectacular breakthrough, which is emerging as the most serious alternative to Bitcoin, even if there is still a long way to go to dethrone the crypto veteran. The coming months promise to be exciting, with the prospect of a “flippening,” a reversal of the established order!\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMi2wFBVV95cUxQYVBCUWl3eTVJbDJZV04xQkxudGRkSDEtV2w0bEh3VzFkR3AzOEs4a3F1NGlrM2dFVmduc0pTMVZHM0ZpN3FrLW9SX3lSdzdxYzdabE5qMHhDLXQ4bDdwdF82MHJkaktsMjNNZUg3VW54QTYyMlBOcmFfU0liSVdtUFJNZEdjUzB1d3hZY2MtdmVJa181bmVza0luUFRETV90aVNYcTE0TDZDWEt0MWNrX3h3ZGstRHEyOW5jVU41bllnU3lqY0FZR3dMdEQ3UG1aR2J2OGowcHRUSmPSAeABQVVfeXFMTWhZMFQwSWFkckZLd3NhTFdhajltdDJyZVpqNUxlMnNKeFZocGZaUXpRdEtSMEtDOWd0THJrMk8tcUNkYlVaRTlGZjYzUFN5dHRiVXcwcFBySzhYb1pCckhiN0hVcFd1a19vd1lCM0ladzdjdGJnRzR2TmJSVDdWWjI2ZTE0dmFlUy1NMHZyQ2pKUmxVU0ktWHFRWlltR3lLVUh0cG5CTjV5czRpbG1pek16MmFfd3FUYmF3b2NrWEQ0NnBHN2hGZ0pDSjZRS0ZhclpxTVVWY1JZZm1tUEJGMmo?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "XRP and Ethereum ETFs could come after approval of Bitcoin's, Valkyrie Funds CIO says - FXStreet",
        "content": "Ripple and Ethereum Spot ETFs could come to market post likely approval of Bitcoin Spot ETFs, says Valkyrie Funds CIO.\n\nXRP is the only digital asset with regulatory clarity from US courts and the altcoin’s relisting by major exchanges is a key step.\n\nEthereum price rallied with the false announcement of the Bitcoin Spot ETF by the SEC, BTC price suffered as traders “sold the news.”\n\nEleanor Terret of Fox Business shared views of crypto industry leaders on why Ripple XRP and Ethereum Spot ETFs could soon be approved by the US Securities and Exchange Commission, following the highly probable greenlight for Bitcoin Spot ETFs.\n\nXRP bulls and Valkyrie Funds’ CIO, Steven McClurg are positive that XRP and Ethereum Spot ETFs will receive the regulator’s seal of approval.\n\nAlso read: Bitcoin ETF announcement hack reveals BTC price upside is likely capped\n\nSEC could approve a single product XRP Spot ETF: Fox Business reporter\n\nFox Business’s Eleanor Terret shared her conversation with crypto market participants, bulls and bears and Valkyrie Fund CIO, Steven McClurg. They offer different sets of views on the likelihood of SEC’s approval on a single-product XRP Spot ETF.\n\nThe bullish case is based on the fact that XRP is the only cryptocurrency that has received regulatory clarity from the US District Court. This refers to Judge Analisa Torres’ XRP ruling from July 13 that states that XRP was not a security in its “secondary sales” on exchange platforms. This clarity ushered XRP’s re-listing on major crypto exchange platforms like Coinbase and Kraken.\n\nGrayscale’s Digital Large Cap Fund recently relisted XRP and this is considered a positive sign that the altcoin will be included in future funds by the crypto asset management giant.\n\nSteven McClurg says that it wouldn’t surprise him if he sees XRP and Ethereum ETFs come to market after the SEC comes close to approving the Bitcoin Spot ETF product.\n\nNEW: @ValkyrieFunds Chief Investment Officer @stevenmcclurg says it wouldn’t surprise him if he saw “Ripple” ($XRP) and Ethereum spot ETFs coming to market now that the @SECGov is about to approve one for Bitcoin. pic.twitter.com/EBcwvbgChs — Eleanor Terrett (@EleanorTerrett) January 9, 2024\n\nThe bearish case is that the SEC Commissioner Gary Gensler and his views on cryptocurrencies other than Bitcoin could negatively affect an Ethereum or XRP Spot ETF bid without Congressional intervention on crypto regulation. Terret argues that a change of administration to one that has a “crypto-positive” outlook is likely needed for the same.\n\nIt is also likely that once Bitcoin Spot ETFs are approved, BTC will stand distinctly from other cryptocurrencies and this difference could be followed by rejections of Spot ETFs for other assets like XRP and Ethereum.\n\nEthereum rallies while BTC hit by “sell the news” trade\n\nVetle Lunde, Senior Analyst at K33 Research elaborated on the capped BTC price gains following Bitcoin Spot ETF approval in his recent tweet on X. Lunde sheds light on the possibility that the news of ETF approval is likely a “sell the news” trade for Bitcoin traders.\n\nBitcoin price reaction to false SEC announcement. Source: K33 Research\n\nInterestingly, Ethereum price rallied and crypto analysts noted that capital is likely to rotate from BTC to ETH and fuel gains in the latter. Scott Melker, crypto analyst, notes that the outcome of the series of events on Tuesday could act as a roadmap when the Bitcoin Spot ETF decision is released by the SEC."
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMiSkFVX3lxTE56emxBNFNTcUlJV2cwSFljekh0Vm1sd2tzRVVsQ2JuRmhtYmRNT3JnUjlpRW9BZ2wzeV9YdUJESzlCX09JNDkxcGFR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "What is Neon EVM (NEON): the first Ethereum Virtual Machine on Solana - OKX",
        "content": "The Ethereum Virtual Machine (EVM) is known to be a foundational element in blockchain technology. It enables secure and automated smart contract execution, underpins decentralized applications (DApps), and provides interoperability across many different crypto projects.\n\nThe technology's widespread adoption, security measures, and support for token standards like ERC-20 and ERC-721 contribute to its role in the Web3 ecosystem, particularly among decentralized finance (DeFi) protocols and non-fungible tokens (NFTs).\n\nNeon EVM represents fresh evolution for EVM. The promise of Neon EVM lies in its ability to integrate EVM capabilities into the Solana (SOL) blockchain. This means developers can leverage the familiar EVM environment for deploying and executing smart contracts on Solana, combining the strengths of Ethereum's (ETH) ecosystem with the speed and scalability of Solana's blockchain. Meanwhile, the interoperability enabled through Neon EVM opens up new possibilities for DApps and supports the transfer of Ethereum's projects to the Solana network.\n\nWhat is Ethereum Virtual Machine (EVM)?\n\nTo understand the impact of Neon EVM, let's start with the basics. The EVM lies at the core of Ethereum's functionality, serving as a decentralized runtime environment that executes smart contracts. In other words, it translates code into tangible actions, powering the development of a diverse range of DApps.\n\nWhat does EVM-based mean?\n\nThe term 'EVM-based' refers to blockchain networks directly built using the EVM architecture, incorporating the EVM natively into their infrastructure. This direct integration provides one-to-one compatibility, allowing smart contracts written for Ethereum to execute on EVM-based networks. Ethereum-based projects can migrate effortlessly to these platforms, benefiting from the familiarity of the Ethereum environment.\n\nWhat does EVM-compatible mean?\n\nWhen a blockchain is labeled EVM-compatible, it means the chain follows EVM standards without being directly integrated with the core architecture. While EVM-based chains directly replicate Ethereum's Virtual Machine, EVM-compatible chains maintain compatibility with Ethereum's tooling and smart contract standards but might introduce additional features or optimizations.\n\nSimilar to EVM-based blockchains, developers benefit from a familiar environment, using Ethereum-compatible programming languages and tools, such as the widely familiar Solidity language. This compatibility also allows for interoperability, providing a smooth transition for projects between Ethereum and EVM-compatible blockchains.\n\nWhat is Neon EVM?\n\nNeon EVM is positioned as the first EVM on Solana, allowing developers to deploy EVM-compatible DApps on Solana with minimal reconfiguration. The platform enables DApps to process Ethereum-like transactions while embracing Solana's functionalities, including parallel execution of transactions and low gas fees.\n\nWith Neon EVM, developers can continue using familiar smart contract languages and Ethereum tools. This includes writing smart contracts in Solidity and Vyper, funding DApps with MetaMask, and deploying DApps on Solana through the Truffle environment, all while taking advantage of the efficiency of Solana transactions. This not only supports the transition for Ethereum developers but also potentially expands their reach by tapping into Solana's user base and accessing the platform's liquidity.\n\nNEON, the native utility and governance token, plays a broad role, from enabling transactions to decentralized governance through Neon DAO.\n\nHow does Neon EVM differ from Ethereum's EVM?\n\nOne difference between Neon EVM and Ethereum's EVM lies in the execution of transactions. While Ethereum's EVM executes smart contracts sequentially to maintain consistent and predictable outcomes, Neon EVM uses the parallel execution capability of Solana to enable smart contracts to be processed concurrently.\n\nTo allow for parallel transaction processing, Neon EVM bundles transactions and sends them to the Solana mainnet. Under ideal conditions, Neon EVM achieves a throughput of 4,500 transactions per second (TPS), surpassing Ethereum's general limit of around 1,500 TPS.\n\nHow does Neon EVM work?\n\nNeon EVM serves as a gateway for Ethereum-based applications to access the high transaction speeds and low transaction costs of Solana without changing its codebase. Here's an overview of the platform's key components and functionalities:\n\nNeon Proxy\n\nNeon Proxy allows for the migration of Ethereum DApps to the Solana blockchain. Acting as a bridge, Neon Proxy channels Ethereum-like transactions on the Solana network with minimal friction. This component packages Neon transactions, which represent Ethereum-style transactions, into Solana transactions. These packaged transactions are then processed on the Solana blockchain, leveraging its parallel execution capability and high throughput. Neon operators, responsible for running Neon Proxy servers, support this migration. They accept payments in NEON tokens and manage transactions within the Solana ecosystem using SOL.\n\nNeonScan\n\nNeonScan functions as both a block explorer and an analytics platform designed for users and developers. As a block explorer, NeonScan allows users to inspect and analyze transactions, blocks, and tokens associated with the Neon EVM on the Solana blockchain. This transparency provides users with a comprehensive view of the network's activity, allowing them to verify transactions, track token movements, and understand block information.\n\nNeonPass\n\nNeonPass is a tool that helps enable the transfer of ERC-20 tokens between the Solana and Neon EVM. This tool simplifies the cross-network cryptocurrency transfer process, allowing users to navigate the complexities with ease. Each transaction conducted through NeonPass incurs a gas fee, payable either in NEON or SOL tokens, depending on the originating network.\n\nNeon Faucet\n\nNeon Faucet is a service designed to help users obtain NEON and other ERC-20 test tokens. It's a resource for developers working within the Neon devnet, providing them with the necessary test tokens for application testing in a risk-free environment.\n\nBy using these tokens, Neon Faucet enhances the application development and testing processes on the Neon EVM platform before their deployment on the main network. Users looking to use Neon Faucet need to connect their crypto wallet to the service, which then allows them to access NEON and other ERC-20 test tokens for a thorough and secure testing experience.\n\nWho created Neon EVM?\n\nNeon EVM, developed by Neon Labs, operates under the oversight of the Neon Foundation for its development and governance. Marina Guryeva is the founder and CEO of Neon Labs and has been active in the blockchain space since 2015.\n\nGuryeva previously served as the Director of CyberFund, an investment platform for blockchain startups. In 2019, she assumed the role of Director at Commun, a blockchain-based social network. In 2021, Guryeva founded Neon Labs with the aim of integrating Solana's scalability and low transaction fees into the Ethereum ecosystem.\n\nNEON token: powering transactions and governance\n\nThe NEON token, native to the Neon EVM ecosystem, serves a dual role. It functions as a utility token, facilitating transactions on the Neon platform including transfers, DApp deployment, interactions within DApps, and more. Beyond transactions, NEON serves as a governance token, empowering holders to actively participate in decentralized decision-making processes through Neon DAO.\n\nThe final word\n\nNeon EVM's mission within the Solana ecosystem is clear: to harness Solana's capabilities while providing Ethereum developers with a platform that feels like home. This integration brings forth a new era of possibilities for developers seeking high-performance blockchain solutions. As Neon EVM looks ahead on its roadmap, the promise of continued innovation underscores its commitment to shaping a multi-chain future."
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTE5TcWxiS3drME1WWFY1M0VsLUNUbEthRG1TMUJTTmM0eE1hOVNPQzYxQTBhRDlNc25QS00zd2Q0cVBUOUxWVGhrNjFUQWZjN3ljY1lFVjhmRDhwaXhVVzFIbWNhUGw4ZUt3R3c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Top Trends in Crypto for 2024 - Bitcoin Market Journal",
        "content": "Table of Contents\n\nKey Takeaways\n\nBitcoin is expected to increase in value in 2024, driven by factors like the approval of bitcoin spot ETFs and the upcoming bitcoin halving event. These developments are expected to attract more investors and increase demand.\n\nis expected to increase in value in 2024, driven by factors like the approval of bitcoin spot ETFs and the upcoming bitcoin halving event. These developments are expected to attract more investors and increase demand. Coinbase will continue its growth momentum into 2024, potentially doubling its revenue. This growth is attributed to increased bitcoin demand and higher institutional adoption due to the approval of Bitcoin ETFs.\n\nwill continue its growth momentum into 2024, potentially doubling its revenue. This growth is attributed to increased bitcoin demand and higher institutional adoption due to the approval of Bitcoin ETFs. Ethereum could grow substantially, with an upgrade (EIP-4844) enhancing transaction throughput and reducing costs. Additionally, the integration of AI in the crypto industry is foreseen to bring significant improvements in transaction analysis, efficiency, and security.\n\nIntroduction\n\nIn 2023, we saw a resurgence in bullishness in the crypto industry, and we expect to see the same energy carry over into 2024 as increasing adoption, revenue growth, and the integration of new technologies are on the horizon.\n\nHowever, new tokens and assets, uncertain regulations, security concerns, and technological innovations speak to the industry’s dynamic nature. This can make it challenging to predict upcoming trends, let alone keep up with them.\n\nThat said, we see some emerging trends that will help fuel the excitement 2023 brought to the crypto industry. These trends include a surge in bitcoin’s value, Coinbase’s revenue growth, the increasing adoption of Ethereum, the rising influence of stablecoins, and the integration of advanced technologies like AI in crypto.\n\nRead more about the crypto trends we see shaping the industry in 2024.\n\nTrend 1: The Surge of Bitcoin\n\nIn 2023, we saw bitcoin rally 150% higher, and at the beginning of January 2024, we saw its price surge to over $47,000. Analysts predict bitcoin’s price rise will continue throughout the year, with the potential to reach an all-time high and hit $80,000 before year’s end.\n\nBitcoin’s price trajectory is strong. Chart via Coinmarketcap.com\n\nThere are a couple of factors at play that support this prediction. For one, there’s the SEC’s approval of a spot bitcoin ETF, which puts bitcoin within the reach of ordinary investors, directly within their brokerage accounts.\n\nTraded on stock exchanges, bitcoin spot ETFs hold bitcoin as their primary asset and directly track the price of bitcoin, therefore providing investors with price exposure without directly owning the asset. This should help bitcoin appeal to a broader range of investors, leading to increased demand and a price increase.\n\nAnother factor that could lead to a surge in bitcoin price is the halving event, which is set to take place in April 2024. These halving events occur roughly every four years, the last occurring in May 2020. Bitcoin halving cuts the reward for bitcoin mining in half, meaning miners receive 50% fewer bitcoins for verifying transactions. Historically, these halving events have been associated with price increases as a reduced rate of new bitcoin creation leads to scarcity, eventually increasing demand and price.\n\nTrend 2: Coinbase’s Growth Trajectory\n\nCoinbase is the largest cryptocurrency exchange in the US by trading volume, and the company has spent years building brand authority with investors, giving them pricing power. 2023 saw Coinbase’s stock soar 418%, and its revenue saw a 14% increase. The company is well-positioned to carry this growth into 2024, with the potential to double its revenue.\n\n\n\nCoinbase shares have outpaced even bitcoin.\n\nThe bitcoin ETF and bitcoin halving event are two of the main catalysts for the predicted growth at Coinbase, as both events should lead to an increased demand in bitcoin, which accounts for most of the platform’s trading volume.\n\nThe approval of bitcoin ETFs will also likely lead to an increase in institutional adoption, as insurance companies, pension funds, and other institutional investors who would otherwise be reluctant to engage with crypto will be more likely to invest, as ETFs offer a regulated and well-known investment structure. Coinbase is thus far the sole custody provider for all the proposed bitcoin ETFs. which should generate substantial revenue in the form of custody fees.\n\nTrend 3: Ethereum’s Rising Tide\n\nEthereum will also likely see rapid growth in 2024, with some analysts predicting its revenue will double.\n\nThis is partly due to a scheduled critical upgrade known as EIP-4844, which is expected to occur in the year's second half. The upgrade will boost throughput to 100,000 transactions per second and reduce transaction costs by as much as 90%, making the network more accessible to mainstream users and driving adoption.\n\nOver the years, Ethereum has made significant efforts to improve the adoption of crypto projects. Ethereum offers smart contract functionality, serves as the primary platform for the DeFi ecosystem, provides a framework for tokenizing and selling NFTs, and enables the creation and issuance of new tokens. In short, it acts as a foundation for the growth of various crypto projects, and the reduced transaction cost will only make the platform more appealing to its users.\n\nTrend 4: The Stablecoin Revolution\n\nWhile most of the attention leading into 2024 has centered around bitcoin, investors want to keep their eyes on stablecoins in the coming year.\n\nIn the latter half of 2023, JP Morgan announced an improved tokenized payment platform, PayPal launched its stablecoin, and Visa expanded its stablecoin settlement capabilities. These events complement the optimistic forecast predicted for stablecoins in 2024, as Bitwise predicts that stablecoins will surpass Visa in terms of settled volume.\n\nIn 2023, we also saw significant advancements in stablecoin regulation. According to Cointelegraph, 25 countries had stablecoin regulations in place last year. The US will likely act on stablecoin regulation in the coming year. Doing so will give the US a mechanism to oversee adoption and ensure its central role in supervising and regulating stablecoin issuers. Additionally, it’ll allow the US to serve as a home for growing businesses that will likely be strategically significant in expanding the role USD and other stablecoins play in the global economy.\n\nTrend 5: On-Chain Innovations for Traditional Finance\n\nWe will also likely see a rise in on-chain innovations in 2024. In 2023, JP Morgan collaborated with a handful of blockchain firms to demonstrate how proof of concept could allow asset managers to tokenize funds on a blockchain of their choice and purchase and rebalance their positions in tokenized assets across multiple chains.\n\nThe demonstration coincides with the traditional financial sector’s growing interest in crypto and blockchain technology. In 2024, we will see more traditional finance companies explore on-chain innovations through partnerships and services as regulatory clarity improves.\n\nTrend 6: AI, Decentralization, and Crypto\n\nIntegrating AI tools into the crypto industry holds immense potential, and we expect to see some of this potential come to fruition in 2024. More companies will use AI algorithms to enhance transaction speed, analyze transaction data, and improve efficiency and security.\n\nAI trading tools will also become more refined and user-friendly, making crypto trading more accessible to many investors. AI will also be integral to real-time sentiment analysis, regulatory compliance, and forecasting. Additionally, we will likely see the rise of AI-powered personal trading assistants capable of learning an individual trader’s risk appetites and preferences to offer customized advice and manage trades.\n\n2024 will also likely see the growth of decentralized prediction markets. While prediction markets have existed for years, crypto takes them to the next level by making them permissionless and borderless and automating functions like making payouts and determining winners and losers. We expect decentralized prediction markets to become a primary venue for sports-based and event-based wagering.\n\nLastly, you can expect financial advisors to allocate to crypto in 2024 increasingly. According to a Bitwise survey, 98% of financial advisors with crypto allocations in client accounts plan to maintain or increase that exposure in 2024.\n\nInvestor Takeaway\n\nAs you can see, many exciting crypto trends are emerging in 2024. Analysts predict that bitcoin will rise in price and prominence, Coinbase’s revenue will grow, Ethereum will establish itself as a powerhouse, and stablecoin adoption will increase.\n\nWe can also expect more financial companies to explore on-chain innovations and AI playing a more prominent role in the crypto world. If you’re currently invested in crypto, we recommend regularly looking at your portfolio to determine how these trends may affect your investments.\n\nAdditionally, subscribe to Bitcoin Market Journal for the latest news for crypto investors!"
    },
    {
        "id": 73,
        "url": "https://news.google.com/rss/articles/CBMi-wFBVV95cUxQS2plREFUV2R3ZnJQNzhFM051SjRsSi1VOTR3SlZoX29fX2YyQVFRN3Uxb3A4MUt4aXR2LXdmZXNUcmphbFhfejBCTUs3UWdHc0d3TTZXQTJ0djhZejRoa09xdWxiRWZDTkNXRERNcnhtUVNNdG1kUW1LNkNyY0lBemRVWmVhTGlBZ3BaUnlfazROR1ozZkJ0NnRraWpHZVZCUzlScW1GM19wTklsSXl0SG0wOGVhbHRUUTFHeno2c3VteHZNc0g4al9hT2QxcU1jQnFMYmRkN2QxZ1lqd1VITGJyNGVoaGI1b1B5dXJVNFVVVjY2aFYzXzF1VdIB-wFBVV95cUxQS2plREFUV2R3ZnJQNzhFM051SjRsSi1VOTR3SlZoX29fX2YyQVFRN3Uxb3A4MUt4aXR2LXdmZXNUcmphbFhfejBCTUs3UWdHc0d3TTZXQTJ0djhZejRoa09xdWxiRWZDTkNXRERNcnhtUVNNdG1kUW1LNkNyY0lBemRVWmVhTGlBZ3BaUnlfazROR1ozZkJ0NnRraWpHZVZCUzlScW1GM19wTklsSXl0SG0wOGVhbHRUUTFHeno2c3VteHZNc0g4al9hT2QxcU1jQnFMYmRkN2QxZ1lqd1VITGJyNGVoaGI1b1B5dXJVNFVVVjY2aFYzXzF1VQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Best Coins to Buy in the Bull Run: Riding the Crypto Bull Run with ApeMax, Helium, Tectum, Celestia, Chainlink, Solana, Ethereum, Bitcoin - - Disrupt Africa",
        "content": "As 2024 dawns, the cryptocurrency market is abuzz with excitement for a potential upcoming bull run, fueled by the anticipated approval of a Bitcoin ETF and the upcoming Bitcoin halving. This phase of burgeoning possibilities has attracted the gaze of both seasoned and novice crypto enthusiasts, looking to ride the wave if the bull run charges for an explosive year.\n\nIn this vibrant landscape, explore the most promising cryptocurrencies: ApeMax, Helium, Tectum, Celestia, Chainlink, Solana, Ethereum, and the iconic Bitcoin. Each of these coins offers unique value to the evolving crypto world. Leveraging the latest market trends and data, we delve into the reasons behind their popularity within the crypto community.\n\n1. ApeMax (APEMAX)\n\nApeMax, a rising meme coin in crypto, stands out for innovation and a growing community. Introducing the pioneering “Boost-to-Earn” staking feature, ApeMax has over 9,000 token holders and 3.5 billion staked tokens. This feature allows ApeMax holders to earn rewards by staking their tokens on preferred entities, offering immediate utility and engagement opportunities seldom seen in presale coins. Eligible early adopters can swiftly engage in staking after purchasing even during the presale phase.\n\n2. Helium (HNT)\n\nHelium (HNT) is a decentralized blockchain network catering to Internet of Things (IoT) devices. Introduced in July 2019, the Helium mainnet supports communication among low-powered wireless devices, facilitating data transmission across its node network.\n\n3. Tectum (TET)\n\nTectum is known for its high-speed, scalable blockchain technology, focusing on creating a seamless user experience. It aims to provide solutions for real-world applications by offering fast transaction speeds with minimal fees.\n\n4. Celestia (TIA)\n\nA modular blockchain platform, Celestia is designed for interoperability and scalability. It stands out by offloading computation to specialized rollup chains, aiming to create a more efficient “network of networks” for blockchain communication.\n\n5. Chainklink (LINK)\n\nA powerhouse oracle network, Chainlink bridges the gap between blockchain contracts and real-world data, enabling secure and reliable interactions beyond the chain. Its widespread adoption and deep integration with DeFi protocols position it as a key player in the evolving blockchain landscape.\n\n6. Solana (SOL)\n\nSolana is renowned for its incredible speed and low transaction costs, boasting the ability to process thousands of transactions per second (TPS). Solana’s rapidity stems from its distinctive hybrid consensus mechanism, merging Proof-of-Stake (PoS) for energy efficiency with a novel Proof-of-History (PoH) algorithm.\n\n7. Ethereum (ETH)\n\nEthereum, a trailblazer in blockchain technology, transformed the landscape with smart contracts – self-executing agreements that activate once preset conditions are met. This breakthrough enabled diverse applications, from digital marketplaces to decentralized finance (DeFi), securing Ethereum’s status as the second-largest cryptocurrency after Bitcoin.\n\n8. Bitcoin (BTC)\n\nBitcoin, known as “digital gold,” is the first cryptocurrency, established in 2009 to enable decentralized, peer-to-peer financial transactions. Bitcoin’s independence from central authorities, secure blockchain-based transaction recording, and limited supply of 21 million coins contribute to its value and potential inflation resistance.\n\nWhy does Bitcoin influence when the crypto bull run will happen?\n\nAlthough it is impossible to predict if and when a crypto bull run will happen, Bitcoin often influences the timing and sentiment around a crypto bull run because it is the leading and most established cryptocurrency. As the pioneer and most widely recognized digital currency, Bitcoin tends to set the tone for the broader cryptocurrency market. A Bitcoin bull run can impact other innovative altcoins like ApeMax.\n\nFinal Thoughts\n\nAs talks of an upcoming crypto surge grow louder, attention shifts towards diverse digital currencies. Beyond the big players like Bitcoin and Ethereum, other innovative altcoins like ApeMax, Celestia, Solana, and many more, emerge as noteworthy contenders, each catering to the niches of their community.\n\nYet, amidst the excitement, it’s crucial for crypto enthusiasts to approach this landscape with caution and thorough research. Understanding the risks inherent to cryptocurrencies is essential. The crypto market’s volatility and factors like regulatory shifts, technological advancements, and global economic trends significantly influence its direction. Predicting which digital currencies will shine remains uncertain.\n\nFor comprehensive details on ApeMax, refer to the official website and ensure compliance with geographical limitations before any purchase."
    },
    {
        "id": 74,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxOc0dMUmVRMGlYUHBGYnphR2h3VFV1bmNIcVNmcjlTVGZRQXNUUEh3eXVYQXlhV3hZNGhlQ0V2bDNMV3NhRGhJYWlTSmhNZ0dRSUlDVlRwSktiQ3BmNVE3dDg2U1dEN1VOX3ZNQ3RQeG9aWGx3U0kyQmNNOGRLbUtNbFRYeXpLY1lvaUJndDNsV200NER4UjBQYkpFQldqakZVVU040gGoAUFVX3lxTE1VRWZtRzZjdUdFWTRVVnhFNEk1WG5vR2ZhXzdoUnNSa1dfNFpSSEtydnpOY0VzSG1WQ0hzYmJHZFZkUFJKdzUwTmNKX2NFV3hOMDhsWDVBUFgxM3dXRlV6aVRaUllXNDAwbjBwTlBGcW5MM1BlU3ducEdGZVVBNU4xV2gwUU81UHVhNjRSZV80NkNmNEI2SVRFT1hsMTZaRUtiVVFTUXBVXw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Ethereum (ETH) Fees Increase, Holders Switch to Meme Moguls (MGLS) and Shiba Inu (SHIB) - Punch Newspapers",
        "content": "Ethereum has yet to scale its Layer-1 architecture, which is causing the network fees to skyrocket and holders to lose faith in the project. Meme Moguls (MGLS) and Shiba Inu (SHIB) are two standout projects picking up pace as holders look for alternative options. Notably, Meme Moguls is predicted to surge 30x as it navigates through a presale of discounted tokens. Let’s take a closer look!\n\nWill Shiba Inu (SHIB) Reach $0.00002000 In 2024?\n\nShiba Inu is a memecoin that rose to fame in 2021 by copying the Dogecoin playbook of using a beloved dog as its mascot. Early buyers of Shiba Inu saw a massive return on their investment, with the coin’s value surging by more than 1000x in less than a year.\n\nWith a current market cap of $5.66B, Shiba Inu isn’t far from achieving its ultimate goal of ‘killing’ Dogecoin ($11.53B market cap) to become the top dog of memecoins. However, Shiba Inu is more than 500x the valuation of Meme Moguls, so the potential gains are less significant.\n\nStill, holders of other cryptos are switching to Shiba Inu due to the consistent innovation from the team. For example,Shiba Inu has just launched an NFT clothing collection with Busta Rhymes. This adds to the decentralized exchange, layer-2 protocol, and multi-coin ecosystem.\n\nPricewise, Shiba Inu is now trading at $0.000009559 after starting the year at $0.000008000. Market analysts note that there is heavy resistance sitting at $0.00001000 to $0.00001100, but if Shiba Inu breaks through, it could potentially reach $0.00002000 by the end of 2024\n\nInvestors Flock to Meme Moguls (MGLS) for Potential 100x Growth\n\nInvestors who missed out on Shiba Inu’s early gains are looking for the next big memecoin opportunity. With its attractive combination of gaming, education, and rewards, Meme Moguls could be just that.\n\nThis play-to-earn platform enables users to step into a realm of virtual meme trading. So get ready to channel your inner Elon Musk and invest your way to the top of this revolutionary new trading virtual platform. The fun is big, but the rewards are bigger!\n\nUsers compete with friends and other players through simulated investing to build the most successful meme portfolio. Those who use the investment strategies to their advantage can turn simulated profits into real cashable returns.\n\nThe MGLS token is the native currency within the Meme Moguls ecosystem. Holding it comes with staking rewards, governance rights, and funds to purchase items from the in-game marketplace.\n\nInvestors can now purchase MGLS tokens at a reduced price of $0.0027 during stage 4 of the Meme Moguls presale. This price will keep increasing in each presale stage, so early investors stand to make the most gains.\n\nMarket experts have pointed out that Meme Moguls distinguishes itself within the saturated memecoin arena through its unique combination of gaming, educational elements, and substantial rewards.\n\nThis unique mix positions Meme Moguls favorably for substantial growth, with analysts suggesting that a 100-fold increase in its value as it enters the broader market is within the realm of possibility.\n\nVisit Meme Moguls\n\nEthereum (ETH)’s Fee Surge: A Roadblock or a Path to Innovation?\n\nAccording todata from Ycharts, Ethereum gas fees have risen 141% in the last year to a current fee of 0.9084 USD/tx at the time of writing. These Ethereum fees rise when the network is congested, making transactions more expensive and slower.\n\nEthereum’s rising fees have caused layer-2 solutions such as Arbitrum to gain popularity as they offer faster and cheaper transactions. However, Ethereum’s modular approach could take some time to come to fruition, and in the meantime, many investors are turning to alternative cryptocurrencies.\n\nThe EIP-4844 upgrade is another potential solution to the high fees on Ethereum, as it uses blobs to make it cheap to send layer-2 data to the mainnet. EIP-4844 is due to go live in the first half of 2024.\n\nPricewise, Ethereum has recently breached the $2,130 resistance level that had held the price down for more than a year. However, the momentum has stopped, and the price is now consolidating beneath the $2,400 level. The potential for aspot Ethereum ETFcould be the next big catalyst as it opens up the market to a broader investor base.\n\nFor more information about the Meme Moguls (MGLS) presale follow the link below:\n\nWebsite: https://mememoguls.com/\n\nTwitter: https://twitter.com/meme_moguls"
    },
    {
        "id": 79,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE9EMUhTRG5Qa2QxWkI1LWZQLVEyajdkQ0FEcWx1VVBiVUM4ZTVxb0lzTm8zSnE3bDJ3SFZPYUhIRlA3elpJUmFnVWlMQmhjSlRyQ1REQTVUU0o1ZlBwQlNfR28ybjBjekhPVTd1TkNEZHA0Yzd0Wm5XUXdpV2Uwd9IBgwFBVV95cUxQNXlUWFN0dWhGTXFvVU5ieFlmTmwwYkt1ZVRjMUZxTE5BZHRrS2piby1iT25KbzZEUjZGdWw1ZUNrZm1rVkp5bm9yYm43cDF6dFFMZnlOWEJpdnFOd3ZoVXpwRDVEQ1JZbV9sc3MwOWh4bUdpa2RUWWp3Nm1iUm9SRjFGZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Price Prediction: Analyst Predicts 100% Rise Against Bitcoin - NewsBTC",
        "content": "Crypto analyst Michaël Van De Poppe recently made a bullish prediction for the Ethereum price against Bitcoin in the near future, noting the path for this to happen. According to a social media post by the analyst, price action on the ETH/BTC pair for the next months will center around spot Bitcoin ETFs, with a rotation into ETH also in the prediction.\n\nAnalyst’s Prediction of 100% Ethereum Price Rise Against Bitcoin\n\nMichaël Van De Poppe recently took to X to share a chart of Ethereum’s price performance against Bitcoin (ETH/BTC pair) on the weekly timeframe. Price action on the chart forms green (bullish) candles during periods of Ethereum’s performance over Bitcoin, while red (bearish) candles are formed during periods of Ethereum’s underperformance against Bitcoin.\n\nRelated Reading\n\nXRP And XLM Price Correlation Persists, Ripple CTO Explains Why 8 months ago\n\nTaking a look at the chart shared by Van De Poppe shows that Ethereum’s performance on the ETH/BTC pair has been on a decline since the middle of 2022. This decline particularly increased during the last quarter of 2023, as the enthusiasm regarding spot Bitcoin ETFs led to a surge in the price of Bitcoin. Consequently, the analyst noted that Ethereum’s price performance against Bitcoin is now around the 2022 low of 0.04922.\n\nAccording to Van De Poppe, the approval of the long-awaited spot Bitcoin ETFs could lead to the creation of another liquidation candle on ETH/BTC to eventually take the liquidity around the 2022 low. This would eventually lead to a rotation into Ethereum, combined with a bullish weekly divergence.\n\nAs a result, the ETH/BTC pair would be propelled to a target just above 0.12 by the rotation, signifying an increase of more than 100%. Notably, the last time ETH reached this level on the ETH/BTC pair was during the crypto’s first major bull run in 2018.\n\n#Ethereum approaches the low of 2022 and is likely going to take the liquidity there. If an ETF approval for #Bitcoin happens, I think we’ll have a liquidation candle on ETH/BTC and after that a rotation into Ethereum, combined with a bullish weekly divergence. pic.twitter.com/kGq91S7kq9 — Michaël van de Poppe (@CryptoMichNL) January 9, 2024\n\nETH bulls regain control of price | Source: ETHUSD on Tradingview.com\n\nThe Rotation Game Has Started\n\nSpot Bitcoin ETFs have been approved by the SEC on Wednesday, causing the price of Bitcoin to spike to $48,600, its highest point since April 2022. However, the price of Bitcoin has stalled and is now trading at $45,839, about where it was when the news of the approval of spot Bitcoin ETFs came out.\n\nAt the same time, Ethereum rose over $2,500 to reach $2,600, its highest point since April 2022. Ethereum has maintained this gain to outperform Bitcoin and is trading at $2,618 at the time of writing.\n\nRelated Reading\n\nIs Cardano The Next Solana? Institutional Investors Clamor For ADA Exposure 8 months ago\n\nAccording to another post on social media by Michaël Van De Poppe price action since the approval of spot Bitcoin ETFs suggests that the rotation is already happening on the ETH/BTC pair.\n\n“The rotation game is happening already,” he stated, adding a $3,500 price target for ETH.\n\nThe rotation game is happening already. A massive weekly bullish divergence on the $ETH / $BTC pair suggesting that we’re going to have a strong run on Ethereum, and altcoins. We’re at January 2016, good times ahead. Ethereum to $3,500. pic.twitter.com/H72vZDFNFR — Michaël van de Poppe (@CryptoMichNL) January 11, 2024\n\nInvestors are now anticipating the approval of spot Ethereum ETFs, which could also drive up the price of ETH.\n\nFeatured image from AMBCrypto, chart from Tradingview.com"
    }
]