[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTE1OdHU3U1o3eWRPSERjRk5DTk93UHBlejJtekxPa3Y2T2V2LUdGanV0WDNiR3h5VUlXVmt2Sk52RGdUQmYtMDAteUlZZTdDX0gxMFNaanVZNWZEYjNER3U2NlBHTFJaN3E3eHNLWDZoT3VjVGM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Is Poised For Major Breakout, Analyst Predicts 180% Surge - TronWeekly",
        "content": "Ethere­um, the second-largest cryptocurre­ncy by market capitalization, is poised for a major breakout, with its price­ increasing by approximately 180% soon. Crypto analyst Javon Marks has highlighted this bullish tre­nd, suggesting that Ethere­um is on the­ cusp of an even more substantial bre­akout.\n\n“$ETH (Ethereum) may only be preparing here for the overtaking and surpassing of $4,723.5 which could then open $8,000+!” said Marks.\n\nMarks’s prediction indicate­s a potentially massive surge in Ethereum’s value, projecting it could more­ than double its current price. Marks’ twe­et emphasized the­ critical $4,723.5 level as a pivotal point for Ethere­um’s continued growth.\n\nSource: Javon Marks\n\nThe chart shows Ethere­um’s steady upward trajectory, refle­cting the 180% increase since­ its previous lows. This rally is marked by periods of consolidation and minor pullbacks, which, according to Marks, are­ essential for a healthie­r and more sustainable bull run. These­ pullbacks help to stabilize the price­ and prevent overe­xtension, setting the stage­ for a robust ascent towards higher targets.\n\nMarks’ analysis sugge­sts that surpassing the $4,723.5 mark could trigger a new wave­ of investor interest and marke­t activity. Ethereum’s potential to re­ach $8,000 or beyond is based on its strong technical foundation and the­ current bullish sentiment surrounding the­ cryptocurrency market.\n\nEthereum’s ETF Launch Hope\n\nDespite­ a recent rally, Ethereum’s price is struggling to get back to its all-time high. The­ rush past $3,395 came from spot ETH ETFs approval, still, lacked power afte­r a small dip mistaken for rollback at the beginning of the­ month. Market worries and stronger pe­ssimistic trends intensified the­ pullback.\n\nThe upcoming launch of ETFs may change the game­ and give the same be­nefits of the price of Bitcoin in case­ of its spot ETF’s launch. By indicating greater investor appe­tite through the ETFs, the price­ could return to the north and cross the $3,829 barrie­r, an important target.\n\nThis figure is also the 61.8% Fibonacci Re­tracement leve­l which would pave the way for another le­g up following previous resistance now turne­d to support. It may be that the target is far too high for ETH, but the­ demand is still in place for $4,000 in ETH. Howeve­r, a firm move above this leve­l is more likely to inspire furthe­r bullish sentiments.\n\nHoweve­r, a failure to go through the $4,000 barrier could provoke­ an adjustment below this leve­l. at least 3,700-3,800 the price could go flat. On the­ downside a break under this zone­ would make historians of the bull market.\n\nRelated Reading | Nigeria’s Cryptocurrency Market Surpasses $400 Million, SEC Director General"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTE1KSkpQWVdKQUxONkw0Uk1wajNSZldjcktGUlZjcW5rS3VhUlZoaUUyaDFjdG5VTnZKVXJWMkZEVzRrYW1xXzYtS3o5eV9Od29EWUctSVhucHB6c00wQXYwQVJJNWZhbHNhREo3akJIaEphM2fSAXhBVV95cUxPM3JFZ21PV2dVTW5SMkVCNGFIU0psVXFjYnc5NEdNVXZKS244UzV6WmN4dnR0dk9UeEZrSFRURk1IZVhBNjcwbW83MW40YlhnZkduQVRpY0RHT0xXam5KVV9taUlzbnF1dDlNTmR5d2V1Qy1pUEhlbVA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Jun 2024 07:00:00 GMT",
        "title": "Solana Just Dethroned Ethereum in This Key Metric - U.Today",
        "content": "According to data provided by DefiLlama, Solana has managed to destroy Ethereum in daily DEX trading volume ($1.148 billion and $745 million, respectively).\n\nAdvertisement\n\nSolana-based Raydium, Meteora, Orca, Phoenix and Lifinity are among the top 10 DEXes by daily trading volume. Uniswap and PancakeSwap, of course, remain in the lead.\n\nAs noted by Patrick Scott, the founder of Dynamo DeFi, Solana's DEX volume dominance is also on the rise . In fact, it is on track to surpass the 25% level for the first time this June.\n\nAdvertisement\n\nOverall, DEX volume has hit $26 billion over the past seven days, according to data provided by Dune Analytics .\n\nEarlier this year, trading on Solana-based DEXex spiked due to the growing popularity of meme coins.\n\nSOL summer?\n\nThis comes as the \"Ethereum killer\" is benefiting from increasing ETF buzz. As reported by U.Today , New York-based investment firm VanEck filed to launch an ETF for Solana on Thursday; 21Shares followed suit with its own filing for the red-hot altcoin on Friday.\n\nHowever, those who expect this ETF to see the light in the near future should cool their jets. According to leading analysts in the field, the product is now expected to be approved this year.\n\nAfter initially seeing a sharp price spike due to the ETF hype, the SOL price is currently in the red, slipping by 0.2% over the past two weeks.\n\nThe popular altcoin is currently valued at $65.2 billion, according to data provided by CoinGecko. This puts it in the fifth place by market capitalization (behind only Bitcoin, Ethereum, Tether and BNB)."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxNQURrakpnbk5QWGluMUZQRFJ5cTlKODhEUk1EMHVzLXFILTdjY1RUenVhSUlVWkZob2lNdnJ0WnFoSkExN2xKNkRSMnRPeGFQODgtQVZxMmwyTENmeVdRSDhTLW5NNGpIT1IxbUQ4UC1TeFdOUkZ3Qk5PR0lZcXpqb9IBiAFBVV95cUxNWXNoVEZjQ1Fja092NnNGR3RnVG9pZEhESDNaWDJ2ckYtNUpPT1NpcnZUNk9idUczYjZxVVRCVmVSLTlwYV9fNm9ZRnM2VVVvQkFMd2ZvN0d2c09CYkNSRnEwRENvQlpHWlJod3lpQ1c0LVVVMzhHSWpBc2draUNlOGUzQjVpRW9U?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jun 2024 07:00:00 GMT",
        "title": "What Are Blobs? Improving Ethereum’s Scalability - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nOfficially introduced to the Ethereum network on March 13, 2024 in the Dencun upgrade, blobs are a new type of data storage space designed to make rollups cheaper and more efficient.\n\nThe consensus within the Ethereum community is that the best way to scale Ethereum is through rollups, also known as Layer 2s or L2’s, and that the best way to scale rollups is via the introduction of blobs.\n\nBefore blobs, if Ethereum went through a period of congestion, that would also affect the price of transactions on all of its Layer 2s. The introduction of blobs removes the correlation between Ethereum congestion and the cost of transactions on Layer 2s.\n\nWhat are blobs?\n\nBlobs are a new data structure introduced to Ethereum in EIP-4844, more colloquially referred to as “Proto-danksharding”. EIP stands for Ethereum Improvement Proposal—the process by which Ethereum core developers suggest improvements to Ethereum.\n\nProto-danksharding is the precursor to full-danksharding, and sets the foundation for it by introducing blobs. It does so in the same format in which they’ll be used when full-danksharding is implemented, in order to simplify the transition to full-danksharding.\n\nFull-danksharding, or just Danksharding, is an upcoming Ethereum protocol update. It represents what Ethereum core devs believe will be the last step (for now) in making Ethereum a truly scalable blockchain, by making transactions faster and cheaper.\n\nProto-danksharding is a step towards implementing Danksharding—it introduces concepts from Danksharding, such as blobs, to Ethereum. Starting with proto-danksharding and the introduction of blobs, instead of diving straight into full-danksharding, reduces the risk created by introducing drastic changes to a network too quickly.\n\nHow do blobs work?\n\nBefore blobs, when a Layer 2 needed to verify its transactions, it would batch up transactions, and send them to Layer 1 (Ethereum) to verify. The problem was, after the data was verified, it was still stuck on the Ethereum blockchain, taking up blockspace, forever.\n\nAD\n\nAD\n\nThis contributes to state bloat, and makes Ethereum more congested—which, in turn, also made Layer 2s more congested.\n\nWith blobs, when the data is sent to the Layer 1 for verification, it’s sent in a blob, short for “Binary Large Object.” Each blob has 4096 field elements and can hold up to 32 bytes of data per field element, which equates to around 75 MB per blob. You can think of it as a giant table of data, or… a big blob of data.\n\nBlobs improve on the previous method of verifying data in that once data has been verified from a blob, it can be deleted. This way, all the transaction data from every rollup built on top of Ethereum doesn’t have to live permanently on the Ethereum blockchain, taking up valuable space.\n\nBlobs also operate using a separate blob fee market—introducing “blob gas”. Blob gas is independent of gas on Ethereum mainnet, meaning the only things that use blob gas are blobs themselves.\n\nWhat’s so special about blobs?\n\nDespite the funny names involved in Ethereum’s Dencun upgrade, it’s a serious improvement. Blobs help to make Ethereum less congested, and they make rollups cheaper and faster to use.\n\nThis is because the data that’s verified in blobs can be deleted after use. As such, it doesn’t cause state bloat on Ethereum mainnet. “State bloat” refers to the fact that the more data that is processed by Ethereum, the more data lives permanently on its blockchain—and the more intensive maintaining that network’s “state” becomes.\n\nSeparating the blob gas market from the existing gas market is also a marked improvement. Because blobs have a separate gas market, congestion on Ethereum doesn’t affect them. In the past, if there was a large event on Ethereum such as a highly anticipated NFT mint, the congestion caused by this event would leak onto Layer 2s and make transactions there more expensive as well. Separating blob gas markets from traditional ethereum gas markets removes the correlation between Ethereum network congestion and Layer 2 transaction costs and speed.\n\nBlobs also make Layer 2s much more profitable. Before blobs, when gas fees on them correlated with Ethereum network congestion, the cost of operation for Layer 2s, and the Dapps built on top of them, were much higher. Lowering transaction fees make it so that builders and operators are able to run complex smart contracts or products at a fraction of the cost.\n\nAD\n\nAD\n\nBlobs at work\n\nLooking at onchain data from rollup.wtf, we can see that the majority of Layer 2s with the highest transactions per second are already using blobs.\n\nIn a tweet, Jesse Pollak, founder of Layer 2 network Base, revealed that after Dencun, the cost of a simple swap transaction on Base dropped from $0.31 to $0.0005.\n\nafter 2 years of hard work, blobs are now live on @base before: $0.31\n\nafter: $0.00 (but actually $0.0005) wallets need to update to handle these cost reductions! pic.twitter.com/solIX9D4HM — Jesse Pollak (jesse.xyz) 🛡️ (@jessepollak) March 14, 2024\n\nHowever, it hasn't been all sunshine and rainblobs. Blobs have been slower than anticipated when it comes to actually posting transactions to Layer 1. Creating a new gas market for blobs succeeded in decoupling Ethereum congestion from rollup transaction costs, but the gas market itself needs some fine-tuning before it’s everything it’s been hyped up to be.\n\nIn one example in June 2024, blob transactions became more expensive than their predecessor– but that can be seen as a sign that blob adoption is still in progress, and hopefully, as L2’s become more efficient at using blobs, more block builders start accepting blocks that include blobs, and blob capacity increases— the costs will go down.\n\nVitalik Buterin addressed both of these issues in a March 2023 blog post published shortly after Dencun’s release. In it, Buterin cites two core areas of focus that are needed to continue scaling blobs: “Progressively increasing blob capacity, eventually bringing to life the full vision of data availability sample with 16MB per slot of data space,” and “Improving L2s to make better use of the data space that we have.”\n\nSo while blobs have seen some growing pains, they were for the most part anticipated, and solutions are underway."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxOd1p2RVBvaHpkSkxpdGtTX3VuZXN1Q3hxTElTV3BGdjk1UV9rcUdBOEZCejNRQlAzdmtBa09oaHhmZzN4WXRFSkVnaFMteC1xaGU0MDNHMDVvT1BRSlo2eTRsaVRHYWdabExsdERlWE5nakJqak05QUNMZzN0dmhBR2xnaGxKOW5KUTFMbEFDbGVlNlNGZmtjYUpR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jun 2024 07:00:00 GMT",
        "title": "Solana Up 700% Last Year, Beats Bitcoin and Ethereum Growth - Crypto Times",
        "content": "Solana (SOL) has risen by an amazing 700% in the last year, outperforming other cryptocurrencies like as Bitcoin (BTC) and Ethereum (ETH).\n\nAs per the data from CoinMarketCap, Solana is currently up 702% from the previous year. During the same time, Ethereum eclipsed Bitcoin, thanks to final approvals for token-focused funds. Ethereum has grown by 51% since the beginning of the year, outpacing Bitcoin’s 45% increase.\n\nAt the time of this writing, SOL is currently the fifth-largest cryptocurrency by market capitalization, having a bullish year till now. Currently, SOL is trading at $145.6, and a year ago it was trading at $20, and at its peak in 2024, it was $200.\n\nSolana Chart\n\nBitcoin’s initial run this year, aided by the launch of the first U.S. spot ETFs in January, saw it hit a new high of $73,798 by March. However, demand and price have subsequently slowed, and Bitcoin’s performance is being overshadowed by increased interest in Ethereum and Solana.\n\nETF excitement is responsible for Solana’s recent rise, especially when exchange-traded fund company VanEck applied for a cryptocurrency-based product.\n\nThe SOL token experienced its largest spike since late May after VanEck filed the necessary paperwork with the Securities and Exchange Commission (SEC) for the new Solana ETF. The boost reached as high as 11%.\n\nThe VanEck Solana Trust is the company’s newest product and the first Solana ETF to be registered in the US. This submission comes after spot Ether (ETH) ETFs were approved by the SEC for the United States on May 23, 2024."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxPN3JxZlA0RGh0enZWd2pKeExGc3NsOHNrWmh5S0hlUGZpbGQzRzFzRjc0Vm1PYkhQV2dibTA5ZHh4eTBnR1pEUXpJSUVjZHlYWXZva04zSGU0ZmVaNnA5MHVsMGp3RG1hSldUMmJPVnI0U1c0UGdXVmJwNGllYXNVT2NTbkJhT2dsc1NVOVNIMThmNUo1alRuY25DbmVFTXNlS2FGQndxOTdDaUlYZXdUSkNvLUNLTkhYRVAzY1ZFMjg1anBlSWFfNWhTMlhoTDkwX21ncGFWblTSAd4BQVVfeXFMTkJNSUhWUWpVak9ZbHlYVXVWX2NEcmpWbmFobmlSZWhMQU1ZLThtb1ZOMjFpZUpCLU5iZnZEeDJVTU5DeVdTTWRmZjF3UnBYTmZYcnBoc2ZkazNJTGFGVjB2VkNFbkx0THNLZElNNmplZnFYV0g5anFCSUF5S0hyMEJnRVF1WGRFT3k4Yi0xUlRDOG0zTWRkLXRrcFBiLWtvcU42cVFVdVlINFFFNUFmVS1KVWVpTWl2MEM5ZE9xaTNIZnNBRWIzS2VCWjRTQ3RxYnlqLS03QW5SZHU3TmVn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jun 2024 07:00:00 GMT",
        "title": "Crypto Analyst Says One Ethereum Rival Is Extremely Undervalued, Maps Path Forward for Bitcoin and Chainlink - The Daily Hodl",
        "content": "A widely followed crypto analyst and trader believes that one Ethereum (ETH) rival is well below fair market value.\n\nCrypto trader Michaël van de Poppe tells his 722,500 followers on the social media platform X that layer-2 scaling solution Polkadot (DOT) could follow ETH’s upward trend.\n\n“DOT is likely going to follow Ethereum in its expansion upwards. This means that the current valuations of Polkadot are extremely low. I expect a lot from the Polkadot ecosystem with all the new segments.”\n\nLooking at his chart, he suggests the possibility of a bullish divergence for DOT on the three-day chart, a metric where a lower low appears on the price chart but then a corresponding indicator shows a higher low.\n\nDOT is trading for $6.20 at time of writing, down nearly 2% in the last 24 hours.\n\nNext up, the analyst predicts that Bitcoin (BTC) will consolidate in the near term around the lower $60,000 range.\n\n“Bitcoin did make a retest at $61,000. I expect this to continue consolidating, where I’m assuming that altcoins will have a higher return than Bitcoin.”\n\nLooking at his chart, the trader suggests that Bitcoin will bounce around $60,000 and soon return to around $64,000.\n\nBitcoin is trading for $60,757 at time of writing, down 1.47% in the last 24 hours.\n\nLastly, the analyst says that leading blockchain oracle service Chainlink (LINK) will likely rally against Bitcoin (LINK/BTC) in the near term as it bounces off a trading range low on the weekly chart.\n\n“Pretty significant start for LINK with this weekly candle of +11% on the Bitcoin pair. It’s still the cycle low and likely the bottom during this period of consolidation.”\n\nLINK/BTC is trading for 0.0002308 BTC ($13.92) at time of writing.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxNUmk2cExjdGp4SXhOMlZ2RXItQUJfUE5MYWM5eDZqeUxfN2F1aTROaXZHbU9hdTFCWkt0ME5VaTBwSWIzbkpFbXZMTWl3RW5uUkFCbUtPYjlkV2FPeXVkRzkxaUNCOWVNMDFiWmxqV3pTTFV4UXBjSDdDVU9fckdHd2E4T2ZJeVN20gGOAUFVX3lxTE5VT2hab24yU19LUlhKS0IwaWh2enNsSE9GSE4wY3FmLUVGWVNnX0xPd1hJaXl6TEs1c0xUamx2ZjFUNHBxLUx5MmY5b25pZzRjYnVKZFNWM3FsWDEzM1NsVmloeW5rRFRrcjBQRkFnaHVqcHNuVEstNURTSFk3bGI4eDliV2NHVmFSNjJjTXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Jun 2024 07:00:00 GMT",
        "title": "Ethereum’s ‘failed’ breakout – When will ETH’s price breach $3.5K? - AMBCrypto News",
        "content": "Ethereum’s price dropped by over 3% in the last 7 days\n\nA key metric revealed that ETH was undervalued, hinting at a recovery on the charts\n\nEthereum’s [ETH] price action turned bullish on 28 June, giving investors hope for a recovery from their past losses. Unfortunately, this bullish trend didn’t last for long, as the coin recorded a price correction soon after. This led to both its weekly and daily charts flashing red.\n\nEthereum faces rejection\n\nAfter the aforementioned hike in price, ETH’s bears stepped up again and pushed the altcoin’s price down by more than 3%. At the time of writing, the king of altcoins was trading at $3,391.51 with a market capitalization of over $407 billion.\n\nThe worst news was that Ethereum got rejected from the upper limit of a bullish wedge pattern in the recent past. As per a tweet from ZAYK Charts, a popular crypto analyst, the token’s price started to consolidate inside the pattern in late May. A successful breakout could have resulted in a 30% price rise, which might have allowed Ethereum to go past $4k.\n\nInterestingly, a similar pattern had emerged earlier in March, only to break out in May. This allowed the altcoin to hit $3.89k on the charts. However, since ETH got rejected this time, the chances of history repeating itself might be slim.\n\nWon’t ETH recover?\n\nAMBCrypto then took a closer look at Ethereum’s current state to see whether it would fail to break out of the bullish pattern.\n\nWe found that market sentiment around the king of altcoins remained bearish. This was evidenced by the dip in its weighted sentiment after spiking on 28 June. Its network growth also dropped slightly, meaning that fewer addresses were created to transfer the token.\n\nNonetheless, a few of the metrics were in favor of a successful breakout.\n\nFor example, the MVRV ratio has improved over the last few days, which can be interpreted as a bullish signal.\n\nAMBCrypto’s assessment of Glassnode’s data also revealed that Ethereum’s NVT ratio had declined sharply. A drop in this metric usually means that an asset is undervalued – Implying an incoming price hike.\n\nAMBCrypto then took a look at Hyblock Capital’s data to look for immediate support and resistance levels.\n\nAs per our analysis, it would be crucial for ETH to touch and go above the $3.5k-mark in order to sustain a bull rally as liquidations would rise sharply. Generally, a hike in liquidations often results in price corrections on the charts.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nOn the other hand, if bears continue to dominate and ETH’s volatility rises in a southbound direction, then it might fall to $3,060."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMibkFVX3lxTFAzRV80ajkzbWs5UlAxNURid0FiU0hhYUE4Umcta3ZBdzVzQ1ZFNDFVN3hhbFZLR3FRY2hVSHRuMGEzemlMSm5LMXVGTlUtaTdQZVI2eTQyOVlaM0p3am1tQXZ1RnRzUHljWWRiX3pn0gFzQVVfeXFMUEpUNWEyNllxWjJOMzZrc0FtNUo3ZmlsVGF5aEdCTkQ3VEtaVjR2YlByNE1ZSld1b00zeU5fQ3hvSDlUVi01TlVOSXhGcVFWZ05QYUVvdktwYUd4WHBZM1hZa3lYTS00NmNyTmlxRklxYnFiQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Records Lowest Gas Prices Since 2016 - U.Today",
        "content": "On June 30, the Ethereum network recorded its lowest fees since 2016. According to data provided by Etherscan, the average gas fee is currently sitting at just 3 Gwei ($0.14), according to data provided by Dune Analytics.\n\nAdvertisement\n\nGas fees refer to the cost of various operations on the Ethereum blockchain. By paying gas fees, users help to ensure the security of the network. Apart from incentivizing validators, gas fees are also meant to prevent various spam attacks.\n\nDuring the 2021 bull run, Ethereum's gas fees were exorbitantly high due to high demand in the non-fungible sector (NFT). This prompted some pundits to argue that the network was unsustainable and gave rise to more affordable alternatives such as Solana.\n\nAdvertisement\n\nThis time around, Ethereum gas fees are hitting extremely low levels despite the fact that the network is also experiencing strong transaction activity. In fact, the volume of the leading altcoin is on the same level as it was during the beginning of the year.\n\nThe plunging fees can be explained by a higher level of efficiency of the Layer-1 market due to the combination of Layer-2 volume and the introduction of “blob transactions” with EIP-4844 that helped to significantly boost Ethereum's scalability.\n\n\"We will still see gas spikes above 15 gwei in times of higher activity. It’s just that overall the gas market has been more efficient post 4844. So we’ll have more affordable days than expensive ones,\" Pistachio Fi founder Brian Smocovich said in a post on the X social media network.\n\nBack to inflation\n\nThe massive drop in fees means that Ethereum is no longer a deflationary network since the amount of fees to burn is very small. This flies in the face of those who were pushing the narrative about \"ultra sound money\" prior to the Dencun upgrade.\n\nOver the past seven days, 14,393 ETH has been added to the network, according to data provided by ultrasound.money. This translates into annual supply growth of 0.62%.\n\nThe total supply of Ethereum currently stands at 120,185,061 ETH, which means that it is on track to reach a new 2024 peak."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxPSXpDZ2pneWlQM1RIM2xvM0VheFFUSHZ0MHVMYWw4ZFBDV3lSUnhlNExTWTN1Wl95MnZ2aW14Q3NydXVZS3cwdkVTUkRyaHJsNU1VMElEYk1HYm5WUTVwTWdWSlFFUnFVTHpILWc0QTdJZDZBSTNwT1N6VWpOWDE0aTlubFladUt1ekc2eA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jun 2024 07:00:00 GMT",
        "title": "Solana (SOL) Surges 800% This Year, Outpacing Bitcoin & Ethereum - Watcher Guru",
        "content": "Solana (SOL) has shown impressive growth this year, surging by almost 800% and outpacing both Bitcoin and Ethereum. Over the last 12 months, the token has increased by more than 770% according to CoinMarketCap, despite its recent dip to the $141 level.\n\nAlternatively, Bitcoin and Ethereum have grown 100% and 82% in the same time frame, respectively. The development has firmly established SOL alongside both BTC and ETH as the top three cryptocurrencies in the market. That fact has led two firms to file for Spot Solana ETFs this week alone.\n\nSource: Bitcoin.com\n\nAlso Read: Solana June End Prediction: Solana Blinks To Help SOL Cross $180?\n\nSOL Beats Both Bitcoin and Ethereum in Yearly Gains So Far\n\nThroughout 2024 thus far, the US has approved two crypto-based ETFs. That is expected to grow, and Solana has emerged as a favorite to get the investment product, especially as its 800% yearly gains have outpaced both Bitcoin and Ethereum.\n\nA recent report from GSR Markets has said SOL “cemented itself as a part of crypto’s Big Three.” Additionally, they stated that it is “just a matter of time before Solana” gets its own ETF. That would place the three assets in rarified air, but looks more and more like it will become reality.\n\nSource: Decrypt\n\nAlso Read: 21Shares Officially Files for Spot Solana ETF\n\nBoth 21Shares and VanEck have filed for the Solana investment product this week. It speaks as much to Sol’s potential as an investment offering, as it does to the shifting regulatory conversion in the country. Moreover, it could speak to an even greater overarching change taking place.\n\nBloomberg recently said that “Bitcoin’s performance is starting to be overshadowed by Ether and Solana” as ETF hype grows. Additionally, there is the expectation that the latter could get a much-needed boost from the investment product discussions. If it does get approved, the industry, and the token itself, should be massively helped."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxOVUFEaUgySlU3Y25YN1BNb1hwdXk5VWd6TElrX0JEOVpuaVhUbzhNeG8zdmxTT3VyOWc3R3AtWWRadGMxbzVYcUM5N1BDREFrWWNXcTUtTzAyaV9WbGdwZUdWWU1ndnZXLVQ1QldWVUI3ak1qNDk4NE9NMGdncVRZY1VmejRESkZZdGs1UWh1MXBGdEXSAZgBQVVfeXFMUEtaM1NsSFlsMGNNVFhtNEo2dVFXWWxRaHdYYTc5bDYwLVFZbzRyUnBTclp6NTdPNkc5SDh6QWtWdFgyLXhZSjNXYm83TVVvdndFNTZkbDV3T3lEYUFVTVdqZUx4OGtlbmVFdzBza2gyakZWT3JSR002YzVlZlVCcEdTRnVQdzN3eTFoc3QzWXBWUWJjR1FiUk4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Jun 2024 07:00:00 GMT",
        "title": "Is Ethereum’s price under pressure? A look at on-chain data suggests… - AMBCrypto News",
        "content": "The number of addresses on the network has been falling for the last seven days\n\nETH supply on exchanges fell, reducing the potential of a sell-off\n\nThough Spot Ethereum [ETH] ETFs would begin active trading in a few days, activity on the blockchain’s network has been discouraging. AMBCrypto found that out after evaluating the project’s network activity.\n\nAt press time, we observed that Ethereum’s active, new, and zero-balance addresses had dropped. By definition, new addresses refer to unique users making their first successful transaction on the network.\n\nActivity falls, but there is a catch\n\nThis metric acts as a measure of traction or adoption. On the other hand, active addresses track the number of users participating in transactions. When this metric rises, it means an increase in the level of user engagement and growth.\n\nHowever, at the time of writing, active addresses had fallen by 15.45%. in the last seven days. New addresses were not spared either with a 6.50% decline.\n\nThis development comes as a surprise considering how close the projected ETF launch is. If this decline lingers, the price of ETH could be affected. This, because a drop in Ethereum’s network activity could mean less demand for the cryptocurrency.\n\nAccording to CoinMarketCap, ETH’s price was $3,379 at the time of writing. This represented a depreciation of 3.35% within the last week.\n\nAnother indicator AMBCrypto examined was the Exchange Supply Ratio. This is the ratio of coins reserved in exchanges, relative to the total ETH supply.\n\nWhen it hikes, it means that the number of coins sitting on exchanges is moving up. A potential consequence of this is a rise in selling pressure which could later on lead a price fall.\n\nHowever, at press time, the ratio seemed to be falling, according to data from CryptoQuant. This decline lowers the risk of a sell-off as holders seem to be comfortable locking their assets for safekeeping.\n\nETH traders are not confident\n\nAs funds move away from exchanges, the potential for a bull run rises. However, for this to affect ETH in a positive manner, buying pressure needs to rise.\n\nIf this is the case, ETH’s price could climb towards $3,600 within the first few days of July. However, if the opposite happens, the value could consolidate between $3,200 and $3,400.\n\nAdditionally, Ethereum’s Open Interest dropped from the value it had on 27 June. OI, which is its short form, refers to the value of open positions in the derivatives market.\n\nAn increase in this metric implies that traders are involved in a lot of speculative activity. On the contrary, when it falls, it means that traders are closing existing positions and taking money out of the market.\n\nWith a value of $13.14 billion, ETH’s OI implied that participants are not refraining from opening positions to capitalize on movements from the price.\n\nRead Ethereum’s [ETH] Price Prediction 2024-2025\n\nShould the value continue to fall, ETH’s price could also follow in the downward direction. However, this prediction might be invalidated if open contracts increase and buying pressure in the spot market follows.\n\nIf this is the case, ETH could begin a hike towards $4,000."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxQOHNyZEFYTzVBcTcxWlZ1RTBRNklubmJ1c3IxWVZmakR4Y1NrUHE1RlNDWGlVVlVrNU5USmFTTjI5OE93Qmo1SDJlLTFkRmZlandkM2VkSDZUN1k1V2o0WmVEVTNsTkZLazBqVWV4d0lNeGdheWpsVmpTQ2FrMElJc0phdEJWN0dtWHcyeDVn0gGTAUFVX3lxTE05T0lmUGJJMEtiVXc2ZDlRZnpHaFE4N3FWUFBQc3F4RXQ3VDFNY2tIaTdTeFozLWlna0o2XzRWNURNWUxkcC0xRWxKTFkxR1VXT3JKS25XVnBYYmRhOGszQ0VidF92SXBWSWc5cjQzM3ZZSVlvdWMtMVlvY3FDd3VKcTR0NkhWdk1hVEFxSnVaYlE0aw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jun 2024 07:00:00 GMT",
        "title": "Could Solana Mimic Ethereum and Surge to $1,000? Analysts Weigh In - CoinGape",
        "content": "Zhu Su of Three Arrows Capital has made a bold projection for Solana (SOL), suggesting it might reach $1,000 per unit. This optimism mirrors Ethereum’s historical ascent, supported by the performance of Grayscale Solana Trust, which indicates high investor confidence could propel Solana’s value significantly.\n\nGrayscale Solana Trust Signals Strong Market Confidence\n\nGrayscale’s investment products have historically served as a barometer for cryptocurrency potential. The Grayscale Solana Trust, similar to its Ethereum counterpart years ago, allows investors to engage with digital currencies through a traditional investment structure, mitigating the complexities of direct cryptocurrency dealings.\n\nadvertisement\n\nYears back, the Grayscale Ethereum Trust traded at a substantial premium when Ethereum’s market price was around $200, implying an eventual value of $1,000 per ETH—a target it later achieved. Today, the Grayscale Solana Trust exhibits a similar premium, which some believe could forecast a comparable trajectory for SOL.\n\nMoreover, the Trust’s performance is not merely speculative. It reflects a growing confidence among traditional investors in Solana’s long-term viability. As Solana continues to develop its infrastructure and expand its applications, the trust’s premium could be an early indicator of its future market position. Additionally, the enhanced liquidity and reduced entry barriers, such as investment trusts, contribute to broader market adoption and price stability.\n\nSOL ETF Could Boost Crypto Adoption\n\nThe regulatory environment also plays a crucial role in adopting and valuing cryptocurrencies. Recently, 21Shares applied to the U.S. Securities and Exchange Commission (SEC) to launch a Solana-based ETF.\n\nThe proposed ETF, listed on the Cboe BEZX exchange, underscores the increasing attempts to integrate cryptocurrency into conventional financial systems. This move comes when the SEC’s stance on digital assets remains pivotal; should the SEC not classify Solana as a security, the ETF could go forward, potentially increasing Solana’s exposure and investment.\n\nThe approval of a SOL ETF likely catalyzes further institutional and retail investment, mirroring Ethereum’s early days when its ETFs broadened investor participation. This regulatory approval, combined with SOL’s growing ecosystem and technological parallels to Ethereum, positions it as a candidate for significant valuation growth.\n\nWhen Ethereum was still emerging, it quickly became a foundation for new applications and projects within the blockchain space. Solana is on a similar path, fostering innovations and developments that could underpin new blockchain utilities. If Solana can maintain its technological edge and scale effectively, the $1,000 valuation could be within reach, especially as decentralized finance and digital applications proliferate.\n\nAlso Read: Ripple Executive Highlights Ongoing Struggles in U.S. Market\n\nMaxwell Mutuma Maxwell is a crypto-economic analyst and Blockchain enthusiast, passionate about helping people understand the potential of decentralized technology. I write extensively on topics such as blockchain, cryptocurrency, tokens, and more for many publications. My goal is to spread knowledge about this revolutionary technology and its implications for economic freedom and social good.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxQY0N0SUduN3dUUHBvYi1rLU9weDBaZTJYZzlFamhmaTNWZUtnLVJEUjFKd21Sa2xtcFEyN051NUl1MVVjbXNWNmNDR0VpSjVEWTVvYmN3SGtvdkVFN2ZPSVEwSjUySEYzUGFMQ2FaQXRESWt0VmZkR0pXUk1uNVMwNjJSRHBOTkZ3M0tVS28wWnpWUdIBlwFBVV95cUxPX3hCY1JfNzc1UndfR1duR2VQTmEtMmVTdlhjaVFqSUx3M0Q5UE8yYTlMdXc3OGVCeWNWMmw3cjlEcUlHUVpDcjdqLXUxQ0hWVVpqWUc3ZVdhVjd0NloxemNodlo1ZUViamZUbWtqNkNuV0E0UGZQTEotQ21BOVVDZF9XM3VGdmtIWFJpeW1yNTlmRTV3TUtj?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jun 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum investors suffer as bearish sentiment takes hold - AMBCrypto News",
        "content": "Bearish sentiment across the crypto sector was on the rise.\n\nBitcoin and Ethereum witnessed a decline in profitable and short-term holders.\n\nAMBCrypto’s analysis of Santiment’s data revealed that the bearish sentiment across the crypto sector was on the rise.\n\nBears leap forward\n\nAccording to the data, there’s been a dramatic plunge in bullish sentiment across online forums like X, Reddit, Telegram, 4Chan, and BitcoinTalk.\n\nTraders have seemingly lost faith in the markets, with bullish calls dropping significantly. Interestingly, bearish calls have also decreased, but at a much slower pace.\n\nFearful investors who were previously bullish might now be more likely to sell their holdings, driving down prices of Bitcoin [BTC] and Ethereum [ETH] in the short term. This could trigger a domino effect as others panic-sell, further increasing the decline.\n\nHowever, the significant drop in bullish calls could also indicate a capitulation event, where investors have exhausted their hope and are forced to sell.\n\nThe selling pressure might eventually wane, leading to a period of consolidation and potentially a market bottom for BTC and ETH.\n\nA tale of two holders\n\nAt press time, BTC was trading at $61,361.69 and its price had fallen by 0.67% in the last 24 hours.\n\nDuring this period, the MVRV ratio for BTC declined significantly. A fall in the MVRV ratio implied that along with the price, the profitability of most holders had also decreased.\n\nCoupled with that, the Long/Short difference of BTC had also fallen. A declining Long/Short ratio indicated that the number of long-term holders had declined compared to the number of short-term holders who were flooding the market.\n\nThese short-term holders are unreliable and could be swayed significantly by market fluctuations. If volatility persists, there could be more downward pressure on BTC in the long run.\n\nCoupled with BTC, ETH could also face significant selling pressure. This is because of the fact that Ethereum and Bitcoin are heavily correlated. IntotheBlock’s data revealed that the co-relation between both these tokens 0.86 at the time of writing.\n\nRead Ethereum (ETH) Price Prediction 2024-25\n\nIn terms of price, ETH was trading at $3,432.61 and over the last 24 hours, it had grown by 1.37%.\n\nThe MVRV ratio and Long/Short difference for ETH had declined as well, implying deciding number of profitable addresses and short term holders."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxNenlzMDFTQjhxX3B1SzBPVGJBczVfUkRyelNzWVdfQWF4RDRYMWEtbzR4VDFVckJ0WUF4NXBBOFhNUHljcVlTYzJkXzVTMjdaeHVNYjF5c2RVQ2hDQ05qS19YWHcxeldHUUo1MF9CdUpLUmNCMkxMUnBEeGU1MjVyX2xGbFEtZFJkbkHSAY8BQVVfeXFMTWpUemM2VjdtRGIxS0hELVpsemhWcWVmamxmOU52YTVMTWhMMUlra1lJV0lqM1NlNW5keXU3T0tMd1Z5VTRKd3JZS3c3TWhtbGp4eEZYUV83MzFwTS1LMWhNMmNBMHlNMDRiZWRZVFZHRHM5eHFnQjdWUVNHUDMyZTJkN2NHSW5ZZThiUG96enM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jun 2024 07:00:00 GMT",
        "title": "Ethereum’s road to $7.5K – Analysts predict a 120% rally because… - AMBCrypto News",
        "content": "ETH could rally 120% by the end of the current market cycle\n\nETH ETF launch could catalyze the rally and its relative strength against BTC\n\nEthereum [ETH] could post triple-digit gains by the end of this current market bull run, according to founders of the blockchain data intelligence firm Glassnode.\n\nThe founders, Jan Happel and Yann Allemann, who go by the pseudonym Negentropic on X (formerly Twitter), claimed that based on historical patterns, ETH could surge to $7.5k on the charts.\n\n“We believe market moves in structures. And this structure gives us a target at ~7500 as a Final High for #ETH.”\n\n\n\nNegentropic made their conclusion based on ETH’s price reaction to the multi-year trendline resistance. The trendline resistance marked previous cycle tops.\n\nAdditionally, before ETH’s last explosive cycle run, a price consolidation ensued, similar to the structure seen on the chart in relation to its current price action (yellow).\n\nETF to catalyze ETH’s 120% potential rally?\n\nThe founders had previously underscored ETH’s increasing relative strength against Bitcoin [BTC] and the rest of the market. They tipped the upcoming launch of the ETH ETF as a key reason and possible catalyst for a new ETH cycle.\n\n“In a Bitcoin-dominated market, Ethereum is showing relative strength. Speculation over an imminent ETF launch could be the catalyst. Is this the start of a new cycle?”\n\nDespite improving ETH’s relative strength against BTC and the rest of the market, the ETHBTC ratio was stuck in a downtrend. The ETHBTC ratio tracks ETH’s relative performance against BTC on the price charts.\n\nHowever, another analyst, TechCharts, noted that ETH could confirm BTC’s outperformance if it breaks above its downtrend.\n\n“$ETHBTC outlook is improving for $ETH. Breakout from downtrend channel can favor $ETH outperformance.”\n\nThe ETH ETF’s launch could further define the trend of the ETHBTC ratio. In fact, according to the SEC Chair Gary Gensler, the approval and launch could happen in the summer itself, possibly in July.\n\nSimilar expectations were reflected by Polymarket too, a predictions platform. It revealed that the odds of approval in early July were above 70%. Here, it’s worth noting that the ETFs are estimated to attract $15 billion in flows by 2025 by Bitwise.\n\nAt the time of writing, ETH was trading at $3.4k, with bearish readings from the derivatives market. The overall volume was down 18%, and Open Interest (OI) rates, which track liquidity, had dropped by 3% in the last 24 hours."
    }
]