[
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxPX0taYTZVdjB6UHZvelBpb3Z2YjE5MlNWUXJvOG9reUY0SjVEMlYxU1pzWWJ4N25kMzYzaFl0VGZxWUcwQjZYSGh4OFU5VVpRR3VWbXZPdG8yb1BET0w1bDUzOTBuTWRReHViTkI0YVZSanJkWXlvU0N2R0t1WlZBUF9kOHdWQWc3LXBiTE1tQVdzZ043?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Analyst projects Ethereum potentially to $2k amid market consolidation - crypto.news",
        "content": "FxPro senior analyst Alex Kuptsikevicha projects Ethereum’s price could further dip towards $2,000, as the altcoin is down by over 8% weekly.\n\nThe crypto market is experiencing a period of subdued volatility, with the total market capitalization hovering around $1.6 trillion for the third consecutive day. Simultaneously, equity indices in the stock market have also significantly declined in the past 24 hours.\n\nHowever, the impact on cryptocurrency investors has been minimal. Kuptsikevich thinks that the fall in stock values is seen more as a result of individual corporate stories rather than an indication of a global shift in market sentiment.\n\nBitcoin is benefiting from this consolidation phase, with its market share exceeding 50% once again. On the other hand, Ethereum has found itself at the lower end of the consolidation range, which it has been in for most of December. Kuptsikevich predicts that Ethereum is showing signs of possibly dropping to the $2,100 area, a level that marked the upper end of its November consolidation phase.\n\nETH 7-day market performance | Source: CoinMarketCap\n\nYou might also like: OKX shuts down mining pools after five years of operation\n\nKuptsikevich suggests that a further decline towards the $2,000 mark is possible, citing the cryptocurrency market’s inherent volatility. This potential dip could mirror a similar retracement in Bitcoin to the $37,500 level.\n\nThe SEC has also delayed its decision on BlackRock’s application for a spot Ethereum ETF until March 10. While some experts remain optimistic about the ETF’s approval by May, with a probability of 50-to-70%, others are wary of regulatory resistance.\n\nThe introduction of spot Bitcoin ETFs in the U.S. has broadened the appeal of cryptocurrencies to a wider audience. According to the head of institutional at Coinbase, this marks a potential shift towards mainstream adoption of digital currencies.\n\nHowever, the influx of new capital into new cryptocurrencies is expected to be a gradual process, unfolding over months or even years."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxPQWZ2SXlKRU8wZjkwSERfYTU2Q05vaUVhWWRwMC12UU5SS0FJSUpLUFEwMDBlRkt6cnNoWmNGUHJKZGFHOHpFOXNLMVc2Vldtczh0RlJUVnYya3VoVkJzdGxRbGRxNUdscEc4M2dqNkk4N3RWbjNxQ05zNjdHRXBFYmc1b1VzYXBVcEcxZmJSVnBCNjJOVkJxQlhJRVk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Scaling Solution AltLayer Launches With $100 Million Airdrop - TOKENPOST",
        "content": "Ethereum Scaling Solution AltLayer Launches With $100 Million Airdrop\n\nAltLayer recently became the first of at least three protocols to go live with an impressive $100 million token airdrops scheduled for the upcoming week. The launch marks a milestone in the field of blockchain technology, offering promising solutions for Ethereum's scalability issues.\n\nThe much-anticipated ALT token and the claiming process were officially made available to the public as of Jan. 25, 9 am UTC, as per Cointelegraph. A staggering 300 million tokens were allocated for the initial airdrop, resulting in a total value of approximately $96 million based on the current average daily price of $0.32 per token.\n\nHowever, Celestia stakers eager to participate in the ALT airdrop will have to exercise patience as AltLayer reported technical differences delaying the distribution to Celestia. Despite this delay, AltLayer's airdrop comes at a time when several other projects are also expected to distribute their respective tokens to eligible recipients within the same timeframe.\n\nDymension and Jupiter to Follow Suit\n\nAccording to ADVFN, among these projects is Dymension, a multilayer rollup deployer poised to launch its mainnet in the near future. Dymension plans to airdrop 70 million DYM tokens, primarily benefiting Celestia stakers and Pudgy Penguin NFT holders, as well as participants in the Solana and Ethereum ecosystems.\n\nFurthermore, the Solana-based decentralized exchange Jupiter has confirmed the launch of its highly anticipated JUP token on Jan. 31. A total of 1 billion tokens will be distributed through the airdrop, making it potentially worth around $410 million based on the current pre-market trading price of approximately $0.41 per token.\n\nBitcoin Ordinals Users Could Benefit from Airdrop\n\nIn addition, Bitcoin Ordinals users may also have an opportunity to participate in an airdrop. Ordinals developer Leonidas recently announced the launch of \"Runestone,\" a decentralized \"fairdrop\" initiative designed to reward early users of the Ordinals protocol. The airdrop aims to incentivize users' early adoption and engagement.\n\nWhile airdrops offer exciting possibilities, crypto users must exercise caution. The X platform is currently plagued by scam accounts posing as crypto firms' official social media pages announcing airdrops. Users must remain vigilant to avoid falling victim to these fraudulent schemes.\n\nPhoto: Traxer/Unsplash\n\nTokenPost | [email protected]"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxOdXltZEFTMnYzRFd1czBfZXJlR3JmNC0zMVlNWUw5LWEwMkRHZm1iVHZ3ZE9PR3hYaHpJOE5HVm5ydFMxQ1g3d0tHOU1yQzFDYW1xTGtydUxzTDlNS3RINWdxcnVyUnpCRnI3ZU9PQk5HTUt1RjV1SHZFeGVkMzBhaERRZUR0RHlZVE12WVBncGY2QXA0S0hJ0gGcAUFVX3lxTE43Z0JCb2FZY1dLX2hVNV9oMkhLSkVrQkxiQXEyTGRBNmZDQl9SVjBmOFJYX0Z6Y0p1MFdmS0czTGFjVEZUNV8wRjBlTWpGaGhBVzFPVm8xb1RHdzVnV3NVYmN3TEdLRml3WlhJQV9KX0lzeG9OdFo0bjUzeHV4bWV4bVFwTm92aGJMQnNnSGlCZlJYMi01TTlJSFNyVw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Ethereum could end consolidation with a dip towards $2000 - FxPro News",
        "content": "Market picture\n\nVolatility in the cryptocurrency market remains subdued, keeping the capitalisation near $1.56 trillion for the third day. Meanwhile, Bitcoin remains around $40K, and Ethereum looks pegged to $2200.\n\nThe drop in equity indices over the past 24 hours hasn’t been too much of a concern for cryptocurrency investors so far, as it looks more like a series of individual corporate stories rather than a global shift in sentiment.\n\nBitcoin is benefiting from this consolidation as its share of all cryptocurrencies has once again surpassed 50%.\n\nMeanwhile, Ethereum, the second most-capitalised coin, has returned to the lower end of the consolidation it spent most of December in, losing since the start of the day and threatening to fall a notch lower to the $2100 area, which was the upper end of the consolidation in November. A decline here would be as logical a move as a BTCUSD pullback to $37500, which remains the main scenario. At the same time, however, be prepared for a brief dip towards $2000 due to cryptocurrency volatility.\n\nNews background\n\nThe SEC postponed the decision on BlackRock’s application to launch a spot Ethereum ETF until 10 March. Optimistic experts expect the Ethereum ETF to be approved in May with a 50-70% probability, while sceptics point to regulatory resistance.\n\nThe emergence of spot bitcoin ETFs in the US has opened the door for the cryptocurrency to reach a wider audience. Now, for the first time, cryptocurrency could become mainstream, said the head of institutional at exchange Coinbase. New cryptocurrencies will attract a lot of capital, but it won’t happen overnight. It will take “months and even years”.\n\nThe G20’s Financial Stability Board in 2024 plans to focus on global regulations for the digital asset industry and the regulation of artificial intelligence.\n\nReuters confirmed the existence of a thriving underground crypto market in China. Investor interest in digital assets is growing against the backdrop of a troubled economy and a lack of value preservation tools. With Hong Kong’s approval of digital assets in 2023, Hong Kong has become one of the opportunities for Chinese investors to access cryptocurrencies."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMizgFBVV95cUxPVjVubGtLS1F5OG1TNGhzTmZXLWJpNW5jTzNfMFo5Rl9FYUxvNlA0bnRaY21BeTFLdVliSVNhX04wYUpKZ3E2YTBtYlhzMmRFSFlCXzIxdUx4SFV6MElsZ25HYzZPQ21tTEZHYkRCRkk1MnFyX1oybV9LOG1meE5Mb3dZYUNkbXQ2XzNwYXVnOFVMeDgwYjFhRXZaRXF5M3pSOV9GR3hPS3M0WTBLQ2Y0dVd6WkZNNmpWZHM2aGdLMW1UZWtIRjdsejdNUmlHQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "On chain sleuth ties Ethereum Foundation to 2016 GateCoin Hack as US SEC delays BlackRock’s Spot Ethereum ETF - Tekedia",
        "content": "A new investigation by an on-chain sleuth has revealed that the Ethereum Foundation may have been involved in the 2016 Gate Coin Hack, which resulted in the theft of more than 185,000 ETH and 250 BTC from the Hong Kong-based exchange.\n\nThe on-chain sleuth, who goes by the pseudonym of Boringsleuth, published a detailed report on X, where he traced the origin and destination of the stolen funds using blockchain analysis tools. He claims that he found evidence that some of the hacked ETH was sent to an address controlled by the Ethereum Foundation, and that the Foundation later sold some of the tainted coins on Kraken.\n\nThe Gatecoin Hack occurred between May 9th and May 12th, 2016, prior to at the onset of The DAO’s token sale & 1 Month Prior to The Dao Hack. Per Gatecoin’s official statement on May 14th, the hack resulted in losses of 185K Ethereum, valued at more than $460M today. At the time, Gatecoin “claimed” that the hacker was able to alter their own system to bypass their multi-sig cold storage, so that all inbound Deposits into Gatecoin went straight to their exploitable Hot Wallet.\n\nThey list the 4 Hacker Eth address’ below involved in the Exploit, Among the 4 ETH address’, one address, 0x1342a0, was originally funded PRIOR to the exploit. Our focus in this thread is looking into who it was that funded this Hacker’s wallet, in hopes of gaining an idea of who it was that was behind the Hack.\n\nBoringsleuth’s report is based on the assumption that the hacker used a smart contract to split the stolen funds into smaller amounts and send them to different addresses. He says that he identified the hacker’s contract by looking for transactions that had a high gas price and a low value, which indicated that they were used to deploy a contract.\n\nHe then analyzed the contract’s code and found that it had a function called split Funds , which took an array of addresses and amounts as inputs and sent ETH to each address accordingly.\n\nBoringsleuth says that he tracked down all the addresses that received ETH from the hacker’s contract and found that one of them belonged to the Ethereum Foundation. He says that he verified this by comparing the address with the list of addresses that received ETH from the genesis block, which are known to be controlled by the Foundation.\n\nHe also says that he checked the balance history of the address and found that it received 2,000 ETH from the hacker’s contract on March 15, 2016, which was one day after the Gate Coin Hack.\n\nBoringsleuth claims that he further followed the trail of the stolen ETH and found that some of it was sold on Kraken between April and June 2016. He says that he identified the Kraken deposit address of the Foundation by looking for transactions that had a high value and a low gas price, which indicated that they were used to transfer ETH to an exchange.\n\nHe then cross-referenced the address with Kraken’s API and found that it matched with one of the Foundation’s accounts. He also says that he checked the trading history of the account and found that it sold 1,337 ETH for BTC between April 4 and June 13, 2016.\n\nBoringsleuth concludes his report by saying that he has contacted both Gate Coin and the Ethereum Foundation to inform them of his findings but has not received any response from either party. He says that he hopes that his investigation will shed some light on one of the biggest unsolved hacks in crypto history, and that he will continue to monitor the movement of the remaining stolen funds.\n\nUS SEC delays BlackRock’s Spot Ethereum ETF\n\nMeanwhile, the US Securities and Exchange Commission (SEC) has postponed its decision on the approval of BlackRock’s Spot Ethereum ETF, a fund that would track the price of the second-largest cryptocurrency by market capitalization. The SEC said it needed more time to evaluate the proposal, which was filed by BlackRock in October 2023. The new deadline for the SEC’s decision is March 29, 2024.\n\nBlackRock is one of the world’s largest asset managers, with over $9 trillion in assets under management. The company has been exploring the crypto space for a while, and already offers exposure to Bitcoin futures through some of its funds. However, the Spot Ethereum ETF would be the first of its kind to directly invest in the underlying asset, rather than derivatives.\n\nThe SEC has been cautious about approving crypto ETFs, citing concerns about market manipulation, volatility, custody, and investor protection. So far, the regulator has only approved Bitcoin futures ETFs, which trade on regulated exchanges and are subject to margin requirements and clearinghouse oversight. Spot ETFs, on the other hand, would hold the actual cryptocurrencies in custody, and would require the SEC to grant exemptions from some of its rules.\n\nThe crypto community has been eagerly awaiting the approval of spot ETFs, as they would provide a more convenient and accessible way for investors to gain exposure to the nascent asset class. Spot ETFs would also potentially boost the liquidity and price discovery of the underlying cryptocurrencies, as well as attract more institutional investors to the space.\n\nHowever, the SEC’s delay is not surprising, given its history of postponing or rejecting crypto ETF proposals. The regulator has repeatedly asked for more information and feedback from the public and the industry on various aspects of crypto ETFs, such as valuation, liquidity, arbitrage, market surveillance, and investor education. The SEC has also indicated that it prefers a comprehensive regulatory framework for crypto assets before approving spot ETFs.\n\nBlackRock is not the only company that is seeking to launch a spot Ethereum ETF in the US. Other firms, such as VanEck, WisdomTree, and Bitwise, have also filed similar proposals with the SEC, but have not received any response yet. Meanwhile, Canada has already approved several spot crypto ETFs, including Bitcoin and Ethereum ones, which have attracted significant inflows and trading volumes.\n\nIt remains to be seen whether the SEC will finally greenlight a spot Ethereum ETF in 2024, or whether it will continue to delay or deny such products. The crypto industry is hopeful that the regulator will eventually recognize the benefits and potential of spot ETFs and will align its stance with other jurisdictions that have already embraced them.\n\nShare this: Facebook\n\nTwitter\n\nWhatsApp\n\nLinkedIn\n\nEmail\n\nPrint\n\n"
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxOU2lHeHBPSy1Ec0xyUHdyc2FGRENZZk9xZjZkUlpMNnB5b01DRHJrb1B1WHNJVWJLZzBkRmpRV1psUkI2cjJ3cDVabS0xOVBIVmVEbTNOdldjelg2Ml80VklOVnV3Ynl0TVU0RnZZYlhwUThFSEVrRWFGTU1LSHZKdWxvc2VKbElBMWY4eC12TWZpOFE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Jan 2024 08:00:00 GMT",
        "title": "Four ‘breakout’ DeFi trends that will define crypto’s coming bull market - DLNews",
        "content": "What you'll learn Novel DeFi like liquid restaking will draw more attention in 2024.\n\nLiquid restaking is already a $600 million market.\n\nYield chasing and airdrop farming will spur greater multi-chain engagement this year.\n\nDeFi was crypto’s primary growth driver last year as it had twice as many users who completed over 100 transactions than any other crypto market sector.\n\nThis growth was fuelled by an increase in transaction activity on Ethereum layer 2 blockchains like Arbitrum and Optimism, and the return of Solana post-FTX collapse.\n\nThat trend is expected to continue this year amid a possible bull run with trading on decentralised exchanges and yield farming expected to be the most dominant on-chain activity in 2024.\n\nThat’s according to a new on-chain crypto user report by blockchain data platform Flipside Crypto.\n\n”Significant regulatory, institutional, and financial announcements emerged every month,” of 2023, the report said. “These developments set the stage for a breakout 2024.”\n\nDriving that growth lately: EigenLayer, an Ethereum liquid restaking protocol.\n\nStaking in DeFi means to lock a token in a blockchain network or DeFi protocol, usually in exchange for yield.\n\nLocked tokens are typically unusable but some protocols like Lido offer liquid staking where a liquid staking token or LST is given in exchange for the locked crypto, as well as the opportunity to earn yield.\n\nJoin the community to get our latest stories and updates\n\n“Novel DeFi like EigenLayer will rise in prominence and adoption among web3 native audiences,” Flipside said.\n\nLiquid staking has the advantage of giving users access to their locked coins in the form of the LSTs which they can deploy on other DeFi protocols to earn compounded gains.Flipside highlighted four other trends to watch:\n\nRestaking staked crypto\n\nLiquid restaking is an expansion of the DeFi liquid staking primitive. It allows users to restake their LSTs to earn more yield and another token called a liquid restaking token, or LRT.\n\nThere are even protocols like Pendle that will accept an already yield-bearing LRT deposit from a user and provide them with another yield-bearing token, taking the compounded yield potential further.\n\nFlipside’s prediction of a liquid restaking boom this coming year may already be showing signs of becoming a possibility. The new DeFi sector is already a $600 million market — a market growth driven not only by the compounded yield frenzy but also the possibility of airdrops.\n\nNovel DeFi niches like liquid restaking come with the expectation of airdrops for early participants. Such expectations have been boosted by majors like EigenLayer offering a points system for depositors as points have become a bellwether for possible airdrops.\n\nDespite its growth potential, Flipside does not envisage a bubble emerging because of liquid staking this year.\n\n“We’re still a ways away from the 2021 frenzy, where anyone could simply fork a project and slap on 10,000% APY inflation tokens to attract users,” Flipside data scientist Carlos Mercado told DL News.\n\nInstead, Mercado identified the lack of client diversity among Ethereum stakers and validators as a possible cause for concern. More than 80% of Ethereum validators run Geth, an execution client responsible for processing transactions and deploying smart contracts.\n\nThis dependence on Geth makes it a supermajority client in Ethereum and any problems with Geth could cause system-wide failures in Ethereum.\n\nGiven the possible scale of the problem, Mercado said he expects stakeholders to diversify to other clients.\n\n“The good thing is that these staking methods compete directly with other on-chain opportunities, so there’s natural pushback against it becoming “too big to fail” — as the yields fall with more participants,” Mercado said.\n\nMulti-chain engagement\n\nFlipside’s report only covers eight blockchains — Bitcoin, Ethereum, Arbitrum, Optimism, Polygon, Base, Solana, Avalanche — all but Bitcoin and Solana are EVM networks.\n\nEVM networks run on the Ethereum Virtual Machine and use the same smart contract logic for their applications. This compatibility also makes for easier liquidity migration via protocols called bridges that allow users to send crypto across different blockchains.\n\nLast year, however, only a small percentage of users interacted with at least two EVM chains. But Flipside expects a change this year with greater multi-chain engagement among DeFi users, especially those looking to capitalise on yield and airdrop opportunities across different blockchains.\n\nGreater multi-chain engagement will mean flexible liquidity migration and an uptick in the volume of crypto flowing across bridges. Bridge protocols have historically been targets for hackers leading to some of crypto’s biggest thefts including the $125 million that disappeared from cross-chain bridge Multichain last year.\n\nMercado noted that bridge security is a big deal while adding that market participants are gravitating towards more secure solutions for cross-chain crypto transactions.\n\n“The lock and mint mechanism prevalent throughout 2021-2022, which left a honeypot of tokens that hackers eyed, has faced significant competition from order book or routing bridges that are more efficient in volume transferred per value locked, and canonical bridges like USDC’s Cross Chain Transfer Protocol,” Mercado said.\n\nCompeting layer 2 blockchains\n\nThree of the blockchains covered in the Flipside report — Arbitrum Optimism, and Base — are Ethereum layer 2. These are networks created to scale Ethereum by processing transactions away from the mainnet but still rely on Ethereum’s security for finality.\n\nPolygon is also an Ethereum scaling blockchain but is technically not a layer 2, but rather, a side-chain.\n\nEthereum layer 2s have experienced a Cambrian explosion in the past 18 months, bloating the EVM blockchain market. With limited investor liquidity, the report predicts greater competition among incumbents especially in lowering transaction costs and offering a smoother user experience.\n\nEthereum, itself stands to gain from the rivalry among its layer 2 networks as increased network activity means more money for validators.\n\nThis struggle for market share dominance among Ethereum layer 2 networks may also affect the value of their respective native tokens, the report said.\n\nBooming infrastructure and chain specialisation\n\nApart from Ethereum layer 2 networks, crypto’s overall infrastructure stack expanded last year and Flipside is predicting an even greater boom in 2024.\n\nThe report pointed to significant gains in the likes of zero-knowledge technology and data availability solutions like Celestia as reasons for such expectation.\n\nNewer entrants like scaling blockchain Monad and Berachain are also expected to contribute to this growth, the report said.\n\nUltimately, the report expects that developers will optimise for their respective technological strengths leading to specialised blockchains rather than the general-purpose blockchain networks currently available.\n\nOsato Avan-Nomayo is our Nigeria-based DeFi correspondent. He covers DeFi and tech. To share tips or information about stories, please contact him at osato@dlnews.com."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiW0FVX3lxTE1zQ0gwQUQ1b0FUTnlpWUVsdE5vbVFsWldOU3VmZm9xdllyWWM3Y3p5WnhCbF9YUW5yS2NQdnM4WVp6T3YwX2F6YVZ1aThpM1FFRnhSQUJyRDVhbHM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Jan 2024 08:00:00 GMT",
        "title": "Top trending inscriptions in 2024 - OKX",
        "content": "In 2023, thanks to developers like Casey Rodarmor from the Bitcoin dev community, inscriptions became a buzzword in the crypto space. But what are they? Similar to NFTs, you can view them as digital artifacts. Inscriptions are, in short, metadata within the blockchain. For example, if we were to examine ordinals, the metadata is encoded on a satoshi, the smallest unit of Bitcoin. For total clarity, ordinals are a means of tracking individual satoshis, which you can attach data to via inscriptions.\n\nThe inscriptions found on the Bitcoin network can include various digital elements, such as text, images, and other forms. They exist as singular digital entries or artifacts within the network, serving as an expansion of the network itself. The inscriptions on the Bitcoin blockchain are remarkable because of their lasting and unchangeable nature.\n\nWhile it started with Bitcoin, the idea of inscriptions has spread to other cryptocurrencies, causing curiosity and concern among community members. Could these inscriptions change the way we perceive the value of our digital collectibles?\n\nTL;DR\n\nInscriptions emergence: Developers like Casey Rodarmor propelled inscriptions into the crypto space, creating digital artifacts (similar to NFTs) on the blockchain, starting with Bitcoin.\n\nBitcoin's ordinals and beyond: Writing on satoshis, also known as Bitcoin's units, has created inscriptions for other cryptocurrencies. This has changed the way digital collectibles are valued.\n\nKey developments: Some notable advancements in inscription technology include BRC-20, Ethscriptions, SRC-20, ARC-20, and DRC-20. Each of these developments adds distinctive digital asset capabilities to their respective blockchains .\n\nExpanding blockchain functionality: The advancements to inscriptions have brought about different characteristics, such as token creation, extensive transaction data, and the evolution of managing digital assets.\n\nFuture implications: The developments indicate a significant transformation in blockchain technology, potentially altering the way assets are owned and controlled in the crypto space.\n\nWhat are inscriptions?\n\nInscriptions incorporate different forms of information, such as text, images, videos, or smart contracts, onto the smallest unit of Bitcoin, called a satoshi. This process converts these satoshis into distinct digital items, commonly known as NFTs or non-fungible tokens.\n\nBitcoin inscriptions have evolved significantly, particularly following the introduction of the ordinals protocol by Casey Rodarmor, a core contributor to Bitcoin, in early 2023.\n\nEstablishing this protocol marked a crucial turning point in developing the first NFTs on the Bitcoin network. These inscriptions are made possible by the Bitcoin network's Taproot upgrade, which provided technical support for such innovations.\n\nHow do inscriptions work?\n\nAdding information to the Bitcoin blockchain involves using \"envelopes.\" These envelopes, known as Bitcoin scripts, aren't executed but are used for storing data. The data is then added to the transaction's witness data using the segregated witness (segwit) update and Taproot improvement. This method allows for more data to be included in each transaction compared to the previous use of OP_RETURN.\n\nIn 2023, inscriptions moved beyond Bitcoin's ecosystem with Ethereum, Solana, and Dogecoin all introducing inscriptions to their communities. Will other token standards catch on too?\n\nWhat are the technical challenges of inscriptions?\n\nA major obstacle in the technical aspect is the oracle issue. Due to the nature of blockchains, they need to be more capable of verifying the accuracy of real-world data. This creates a need for a certain level of trust for the system to function, which goes against the trustless principle of blockchain.\n\nUpdates and corrections\n\nAn additional concern arises when making changes or fixes to existing inscriptions. The unchangeable characteristics of blockchain imply that it can't be modified or removed once information is recorded. This presents a challenge when attempting to update agreements or rectify errors, as any adjustments would call for a new transaction, causing financial strain and restricting progress.\n\nScaling and privacy issues\n\nThe addition of inscriptions on a blockchain can also cause it to become bloated with non-financial data, resulting in problems with scalability. Each node in the network is responsible for storing and handling this extra information, potentially causing a need for more powerful hardware and increased internet usage, which could impact decentralization. But in recent developments, the Runes protocol has offered a solution to help reduce the bloat.\n\nNetwork congestion and transaction fees\n\nThe surge in inscription-related transactions has led to network congestion on multiple blockchains. This transaction increase has resulted in higher transaction fees and delayed processing times. For example, the Bitcoin network experienced significant congestion and increased fees due to the popularity of BRC-20 transactions.\n\nWhat are the top trending inscriptions?\n\nBRC-20\n\nBRC-20 is a new token standard on the Bitcoin blockchain, enabling the creation of fungible tokens using ordinal inscriptions. The inclusion of NFT capabilities for Bitcoin, similar to Ethereum's ERC-20 standard, uses a Proof of Work system and doesn't offer support for smart contracts.\n\nThis standard diversifies Bitcoin's functionality, fostering innovation in digital assets like meme coins. Even with difficulties and discussions among Bitcoin users, the introduction of BRC-20 is a notable advancement in broadening the potential uses of Bitcoin and improving its digital asset environment.\n\nEthscriptions\n\nEthscriptions enables the generation and trading of digital objects recorded on the Ethereum blockchain. Taking inspiration from Bitcoin's original recordings, it allows individuals to incorporate information — and specifically visuals — directly into Ethereum transactions, presenting a fresh method for managing digital assets.\n\nMany believe the Ethereum ecosystem has been enhanced significantly by this protocol, which challenges the conventional functions of blockchain and broadens the range of possibilities for Ethereum. It showcases Ethereum's flexibility and potential for creative use, encouraging a new era of digital assets and data storage on the blockchain.\n\nSRC-20\n\nBitcoin's blockchain has a token standard called SRC-20, which allows for the creation of digital collectables known as Bitcoin Stamps. This standard allows for the inclusion of data directly into transactions, bringing a new efficiency level to managing digital assets on Bitcoin.\n\nThe introduction of this advancement broadens the capabilities of Bitcoin beyond its primary purpose as a means of preserving wealth, transforming it into a flexible platform for distinct digital possessions. SRC-20 marks a notable change in Bitcoin's role in cryptocurrency, defying conventional beliefs and unlocking fresh opportunities.\n\nARC-20\n\nARC-20 is a set of rules dictating how tokens are made on Bitcoin's blockchain. The tokens are called fungible tokens and use satoshis, which allows them to work with Bitcoin's system and gives each token value. Meanwhile, Atomicals are a different way to manage digital assets on Bitcoin.\n\nThe latest developments show Bitcoin's adaptability in managing digital assets and tokens. ARC-20 and Atomicals offer new opportunities for asset management on Bitcoin, highlighting its potential in decentralized finance and expanding its use.\n\nDRC-20\n\nThe Dogecoin blockchain has introduced a fresh token standard called DRC-20, allowing users to generate fungible tokens and NFTs, similar to Ethereum's ERC-20. This standard boasts speedy transactions, affordable fees, and effortless token generation.\n\nBy diversifying Dogecoin's abilities, this standard expands its potential uses and strengthens its position in the crypto market.\n\nRunes Protocol\n\nRunes Protocol is a novel Bitcoin-based system for efficient fungible token management, emphasizing simplicity and transaction efficiency. This development aims to improve Bitcoin's scalability and usability, potentially transforming its utility in digital asset management. It introduces the UTXO-based fungible token protocol to provide a more streamlined approach to fungible tokens.\n\nSATS\n\nSATS is a BRC-20 token on the Bitcoin blockchain, not to be confused with 'sats' (the smallest Bitcoin unit), and represents a step towards hosting fungible tokens on Bitcoin. This token demonstrates innovation in the Bitcoin ecosystem, offering new functionalities like tokenization and peer-to-peer transfers, despite challenges and community debates on its impact\n\nSPL-20\n\nSPL-20 inscriptions on Solana's blockchain enable direct digital art and NFT storage, moving away from traditional external storage methods. They mark a significant advancement in blockchain technology for integrated digital asset creation and management, particularly in digital art and NFTs.\n\nRecursive inscriptions\n\nThe ordinals community has implemented a method of recursive inscriptions on Bitcoin's blockchain, which allows for the storage and execution of sophisticated software. This approach enhances data storage efficiency on the blockchain by connecting data from previous inscriptions to new ones. The inclusion of these inscriptions is another advancement for the abilities of Bitcoin, and opens up the possibility for more complex functions and smart contracts.\n\nThe final word\n\nInscriptions, akin to NFTs, are digital artifacts embedded within the blockchain that mark a shift in how digital collectibles are valued and perceived. Originating for Bitcoin, where metadata is inscribed onto satoshis, this feature has since spread to other cryptocurrencies.\n\nToday, inscriptions can be applied from the Ethereum blockchain through to that of the memecoin Dogecoin, introducing distinct features to individual blockchains. That includes developing interchangeable tokens and virtual collectibles and incorporating complex data and graphics into transactions.\n\nThis wave of innovation is reshaping what's possible from major assets such as Ethereum, Dogecoin, and Solana, expanding the scope and capabilities of digital asset management and ownership in the blockchain space."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxPMDNmbW40UDR0RkJzU0NrOXhfTlU1QXFRNGt4czI5bHdNQ09RWVFzb1dvSGcybFg0cUpRaWMtV2cxcVBhaUtPTHRnV2E4M19jUTkxb1ozb21fWTZaREFtMVhfanRoZ3NzTDVWcnVpemVZc2tyQzhUd0xSLWVDQUYxTzNfcVNta3JEV2lNSXd4ZGV1Y2RFa3V2RnNJOEN4M2o5VFdLV2lBa29nRlJ4NTZZ0gG0AUFVX3lxTE51RzRYV1JubHltUmdsdEN1ZjU3VGFtdFhmSHZ4VEYyejlNZWVQSXg1anBaZmNMMWJaVmhSZlBiSUhoRWhkYlNWbXFPby1SV3VjbUo4N3QtU2NwREJIRWhEa2JoWlphdVd4dzgxdTdIZDdnc3A3WUZyZ0x6N2NEeURSLXA1MExveHdUcVRPNGtFR0ozZVpZd05hRmp4dHlxdXdwQmVtcEpHWDJOUFI3WUphSjF4TA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Kelexo (KLXO) Pre-Sale Might Be Impressive Event in 2024 while Ethereum (ETH) and Binance Coin (BNB) Investors Keep Optimism - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nThe presale stage is often the best time to invest in new crypto projects before hype drives up the price. Right now, investors are researching Kelexo (KLXO) presale as supporters shift funds from major assets.\n\nEnthusiasts of Kelexo (KLXO) can take part in pre-sale and buy tokens here .\n\nPotential supporters are watching KLXO\n\nKelexo (KLXO) is revolutionizing the peer-to-peer lending space by eliminating intermediaries and bureaucratic processes. Users can instantly lend or borrow funds in crypto with just a simple setup and without extensive KYC checks or long wait times.\n\nThis straightforward, decentralized model powered by blockchain technology provides significant advantages over traditional lending methods. Borrowers and lenders can connect directly, which removes the expensive overhead costs of intermediaries. Transactions in this marketplace close in seconds instead of days like at banks. Also, there are no minimum loan amounts or durations.\n\nAdvertisement\n\nBy removing these pain points, Kelexo (KLXO) offers users a more efficient way to access lending markets. The minimal identification requirements also enable participation from a wider audience, including those with limited credit history who may not qualify through conventional channels.\n\nKelexo (KLXO) also incentivizes user participation and decentralized governance through its Kelexo (KLXO) token. Token holders can submit platform enhancement proposals and vote on key decisions. An inbuilt rewards program further drives engagement.\n\nWith cutting-edge cryptography guaranteeing security, minimal barriers to access and community ownership, Kelexo (KLXO) represents the future of decentralized finance. It efficiently uses blockchain's capabilities to create a better borrowing and lending experience for all.\n\nKelexo (KLXO) is currently in stage 1 of its presale , priced at just $0.022. The presale supply is 264,000,000 out of a total supply of 440,000,000 and the presale price increases as each stage sells out.\n\nMajor players have started taking notice\n\nIt is important to state that whales and institutional traders have taken notice of the hype surrounding Kelexo (KLXO) (KLXO). Significant volume has shifted on-chain from blue chip cryptos like Ethereum (ETH) and Binance coin (BNB) into Kelexo (KLXO) as presale snipers load up their bags.\n\nThese big players help drive momentum and they’re likely expecting Kelexo (KLXO) to follow previous altcoins that did 100x or more out of the gate after presale.\n\nWith only 57% of the total supply available during the presale, scarcity of Kelexo (KLXO) tokens could drive fear of missing out (FOMO), which could lead to price surges post-listing.\n\nConsidering its strong real-world utility and advantage over existing lending platforms, Kelexo (KLXO) checks all the boxes for a breakout success story.\n\nMany believe getting in during presale could be like investing in Ethereum (ETH) or Solana (SOL) during their early days in terms of upside potential.\n\nAnalysts advise not to miss out on this presale as it could be an opportunity to invest in the top 100 coins of the bull market, an opportunity that is quickly disappearing the longer you delay.\n\nAs most experienced market movers know, investing in solid projects early is where huge gains are often made."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxOLUxIRFRScm91bmtmWXBKVXdUM3FUVEpydXcyNHFmSElUUUJJTDdBQVhKWWFuaW5od0ZUakJ1MFMzVDNjYWUtLXFYX21LVXJNdEZwVFloWlVfM0Fkb05fbGpIQUJKdGN5NmgxZkxGRU1DWXRtaGxUSlNEaXJfTUN5eGFOYkE4aWFJajZXUHc3YnNtTjBOVGhrWUxna9IBoAFBVV95cUxOeFprU1ZuVEtOeWJtM1M4MDNXQlJVdWhxZTBXVnM3by1IYXV4OWxCZGVDS3d2dTZ4UV9jdTU2QUVlbFJhT3YzeFJVWmQ3SUlHNjc2U1pNcXlEZzQ0N3dJSXJCc0t4cll0Y2g1VGhROS1FWHg1Q2tvLW9IbTJYV05ENm1xclRneTlqM3ZGcjJjNXBfcjgwVVNmZGhBYlN0b05Z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "TRUMP2024 or BIDEN2024? How U.S. elections are propping these altcoins - AMBCrypto News",
        "content": "Tokens such as TRUMP2024 and BIDEN2024 surge in popularity ahead of the U.S. elections.\n\nEthereum and Solana could benefit from the heightened interest in the tokens.\n\nThe 2024 U.S. election is one of the most anticipated events of this year. Some token creators have tried to capitalize on the attention around U.S. elections and have created tokens around the same.\n\nShitcoin Update: $BIDEN2024 and $TRUMP2024 on Ethereum are gaining marketcap. Is this the true election? Trending #8 and #11 on @dexscreener. ?https://t.co/8AO3d7z78ehttps://t.co/WXqV4WTt0Z pic.twitter.com/2ntHQHdHBf — MartyParty (@martypartymusic) January 24, 2024\n\nNew tokens have arrived\n\nThe tokens BIDEN2024 and TRUMP2024 are two of the most popular tokens that have been created in this context. The TRUMP2024 token grew by 751% over the last month and was trading at $0.00000000451 at the time of writing.\n\nThe volume at which it was trading grew by 26.69% in the last 24 hours and was currently at 3.69 million.\n\nComing to the BIDEN2024 token, it grew by 694.25% last week and saw a gigantic surge of 1796.25% in volume. At press time it was trading at $0.00000000431 and its volume was $2.41 million.\n\nAs the presidential election inches near, the probability of these tokens seeing more growth is very high. However, after the event, the prices of the token may collapse.\n\nMemecoins are very susceptible to rug pulls and holders should be careful around these tokens. Holders and traders should hedge their bets if they decide to invest in these tokens.\n\nL1 networks gain\n\nEven though some holders may gain or lose out on money eventually, Solana [SOL] and Ethereum [ETH] might see positive returns regardless.\n\nThe hype around these tokens on both Solana and Ethereum may add to an uptick in activity on both of these networks. The networks saw a massive surge in activity over the last few months as well.\n\nAccording to Artemis’ data, the number of daily active addresses on Solana increased from 214,000 to 624,000 in the last 3 months.\n\nSolana was lagging behind Ethereum in this regard earlier, however, at press time, Solana had outperformed Ethereum by a large margin. At press time, the number of daily active addresses on the Ethereum network amounted to 357,000.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nIn terms of transaction activity, a similar trend was observed. Solana completely left Ethereum in the dust in terms of transactions.\n\nAt the time of writing, daily transactions on the Solana network were 27.8 million. Ethereum on the other hand had 1.6 million."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMisAJBVV95cUxQQzJLdkNFTHU3VlcwWU9zTXlxYThZMTBSNXRLSXh1MmRZWUROZXJQTFdwOTdSa1VDYnR5MklEQmlweEZCTjFCRnZiSUdaZHJobVVkWk1HMHktVnlYTTZEb2psSlMxLXhzak1NYmowY240M256RUwzblhsWVBrMF8tX0NCQkVQaXJsNWZGQ250M0lDZWpZbzRBallEQnZsVlVPNFFmY1dXNlZ5a29zYUNCTUpXYkFnX29nLTVmU2tYYzFBSGtrVFJ4MkZhZkI5ZG5fNkJfYmxWUFRESlQzX3hwS0ZpS2Vnb0FqY1pnN1RGTFdDREJuQmJqdFZvRTcyOFBEaldNSFdrYkxleS1CSXZnRkhHMnFDczZ5NWRjQVZwLXhYVy1QMXc1dlh3MXBOUDh30gG3AkFVX3lxTE11U3RLWjdOT1NTSFhJNWZ0ZU9EREYzTnh0N0N1am5tVVB1U0dtaVVvYWhweFBmcV8wcGhMZEZsNE9TWXZSdUJ0NURzaVZSZWVuSmpKSnBiRDNGMm5MV2xrcG84cTFMRjdlOGszNmRmaDhQalpIV01pbWQ4QlJNMDhqemJjZHI5ME5TSlF5SGZDaEhXN1JadDZSTjRTMW04ODhHMTJhaWNsOHVHX0tBMjNwZDBqRzFDV25VLTFJVy1NUHVkNHhGdGhrZTJnWk05NXRod2NyWUhsTFFjTERPdnhMNzdIQ3hKa1pzUWtYZGtXdHl0YmQ3amFqVnBBVW9ySWZMYU5XYXdCNHc4ZFR2anFfSzVYWHRhem5vbGhSSGplNy1nYl8wUW9OZzNvbnM3V2haVFNFbWJZ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Jan 2024 08:00:00 GMT",
        "title": "Retik Finance (RETIK) sells out another presale stage in record time, set to lead the DeFi boom with Solana (SOL) and Ethereum (ETH) in 2024 - The Financial Express",
        "content": "In the ever-evolving world of cryptocurrency and decentralised finance (DeFi), emerging projects are constantly striving to make their mark and attract investors. One such project that has been making waves and garnering significant attention is Retik Finance (RETIK). In just under two months, Retik Finance has accomplished what many consider an extraordinary feat, selling out seven of its ten presale stages in record time. This article explores the remarkable journey of Retik Finance, its Certik audit success, and how it is poised to lead the DeFi boom alongside giants like Solana (SOL) and Ethereum (ETH) in 2024.\n\nThe Retik Finance Phenomenon\n\nRetik Finance burst onto the cryptocurrency scene with a mission to disrupt and innovate within the DeFi sector. Unlike many projects that rely solely on hype, Retik Finance has managed to turn heads with its unique offerings and community-driven approach.From the outset, Retik Finance demonstrated its ability to break records and sell out presale stages faster than anticipated. This rapid success is a testament to the project’s appeal to investors and whales alike. With each presale stage, Retik Finance has continued to gain momentum, solidifying its position as a promising contender in the crypto space.\n\nAlso Read TCG’s sirrus.ai launches AI platform for real estate industry Singapore court grants WazirX 4-month moratorium after Rs 2,000-cr hack Tech firms lead in GenAI adoption, finds survey Interview| India must grab the early mover advantage in quantum computing, says Amith Singhee, Director, IBM Research India\n\nCertik Audit: Adding Credibility to Retik Finance One of the key factors contributing to Retik Finance’s credibility and reputation is its successful Certik audit.\n\nCertik is a well-respected blockchain security firm known for conducting thorough audits to identify vulnerabilities and ensure the security of smart contracts.The Certik audit provides investors with confidence in the safety and reliability of Retik Finance’s platform. In a space where security is paramount, the Certik certification sets Retik Finance apart and reassures users of the project’s commitment to maintaining the highest standards of security.\n\nVisibility and Recognition on Coinmarketcap and CoinGecko In addition to the Certik audit, Retik Finance received a significant boost in visibility and recognition when it was listed on popular cryptocurrency tracking platforms, Coinmarketcap and CoinGecko. These platforms serve as go-to resources for crypto enthusiasts and investors, making it easier for them to discover and research projects.The listing on Coinmarketcap and CoinGecko has opened up new avenues for Retik Finance, allowing a broader audience to learn about and engage with the project. It is a clear sign of the project’s growing prominence and acceptance within the crypto community.\n\nPresale Success and Investor Enthusiasm\n\nRetik Finance’s journey through its presale stages has been nothing short of remarkable. As it recently crossed into its seventh presale stage, investors have had the opportunity to secure Retik tokens (RETIK) at an attractive price of $0.09. Each presale stage has not only met but exceeded expectations, providing early supporters with impressive gains.Investors who got in early have already witnessed their investments appreciate significantly. Retik Finance has delivered over 200% gains, with more potential for growth on the horizon. With just three stages remaining, the excitement surrounding the project continues to build.\n\nAnticipated Launch and Price Surge\n\nOne of the most enticing aspects of Retik Finance is its anticipated launch, scheduled for Q3 – 2024 on major CEX and DEX. With a target price of $0.15, the project aims to make a significant impact upon its official release. The launch is expected to generate substantial interest and trading activity, potentially triggering a surge in the token’s price.Experts and analysts in the cryptocurrency space have been closely monitoring Retik Finance’s progress and predict a remarkable journey ahead. Some anticipate the token’s price to reach $10 in 2024, which would represent a substantial increase from its initial presale prices. Such projections have undoubtedly piqued the interest of investors seeking high-growth opportunities.\n\nConclusion\n\nRetik Finance’s journey from a relatively unknown project to a DeFi powerhouse in less than two months is a testament to its unique offerings and community-driven approach. With a successful Certik audit, recognition on Coinmarketcap and CoinGecko, and a series of sold-out presale stages, Retik Finance is well-positioned to lead the DeFi boom alongside giants like Solana and Ethereum in 2024. As the crypto market continues to evolve and mature, projects like Retik Finance showcase the potential for innovation and growth within the space. While the future is never certain, Retik Finance’s rapid ascent serves as a compelling example of what can be achieved through dedication, transparency, and a strong community of supporters. Investors and enthusiasts will undoubtedly keep a close eye on Retik Finance as it embarks on its exciting journey in the world of decentralised finance.\n\nFollow us on Twitter, Facebook, LinkedIn"
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMi-gFBVV95cUxNc3dzWHJJY2xNWVZ5NGNfVmpOTVcxaFJYd0Vma2FfOXQtbm1MVjRaZ1ZwbUI3ajRtdzlKNWtfMC1nalcxdXBndEFpREJJYjE3dk9NTEN2ZmlFV2twNnFhMkhPYVZhN3pVTW0zeENkUXBUZDh6OGh6YWtlOFQ4eGRsci1vbFJ6UC1Ic05raklWNWEybEFPb0VWNTNaYXZsbHBsYkdVVlpiaGFnTEQ4Mk9tX0MybTZ2VEJOTzNqREt5X09RbmtEVUtySlFmTmpNZ0c2YlhxYWNTdkVGNWtqLXF0MXVsRkQ2N1BKcXZ2T3c3U3c0dFhzUEVNZEZ30gH_AUFVX3lxTFBCa0hzbDYzQzN3bUJlVEZ1dmxRMWVMWENaYUEzVkNQQmRwTjE3eUhjRW1lT0tMMEhsWHltMHdVR3VNdzhIRDJ6Vm11d2dFRkhEVGVGeGJWM0trcDBDLWFrenotYkJ0dnRLT1FINWlCQVd1cEdKbDZDRUZpM2NBT0QyTE04aWFIMFdtRDNaY0dkSUpVLTI0M3NRZWlvSy03b2tJb3o1SnlfUXQyaHRSMG9rUkJHRUNMVjRxYWRuOHNWQktyODFURTZWMFBwSkU3cm5VX2hVc193YlNVMVVNeGt5TXYycDRjN3VRdGNnM3RsSTEtU2tGRVRBTTVZU0JLQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Cryptocurrency Price Today: Bitcoin Rises Above $40,000, PYTH Becomes Biggest Gainer - ABP Live",
        "content": "Bitcoin (BTC), the oldest and most valued cryptocurrency in the world, managed to rise above the $40,000 mark early Friday. Other top coins, including the likes of — Ethereum (ETH), Dogecoin (DOGE), Solana (SOL), Ripple (XRP), and Litecoin (LTC) — saw mix of minor gains and dips across the board. The MANTA token, which was the biggest gainer yesterday, turned out to be the biggest loser today, with a 24-hour dip of over 10 percent. PYTH, on the other hand, became the biggest gainer, with a 24-hour jump of over 13 percent.\n\nThe global crypto market cap stood at $1.56 trillion at the time of writing, registering a 24-hour gain of 0.32 percent.\n\nBitcoin (BTC) Price Today\n\nBitcoin price stood at $40,116.38, registering a 24-hour gain of 0.37 percent, as per CoinMarketCap. According to Indian exchange WazirX, BTC price stood at Rs 35.39 lakh.\n\nEthereum (ETH) Price Today\n\nETH price stood at $2,223.92, marking a 24-hour jump of 0.38 percent at the time of writing. As per WazirX, Ethereum price in India stood at Rs 1.99 lakh.\n\nDogecoin (DOGE) Price Today\n\nDOGE registered a 24-hour jump of 0.17 percent, as per CoinMarketCap data, currently priced at $0.07811. As per WazirX, Dogecoin price in India stood at Rs 6.92.\n\nLitecoin (LTC) Price Today\n\nLitecoin saw a 24-hour gain of 0.15 percent. At the time of writing, it was trading at $65.72. LTC price in India stood at Rs 5,889.73.\n\nRipple (XRP) Price Today\n\nXRP price stood at $0.5135, seeing a 24-hour loss of 0.27 percent. As per WazirX, Ripple price stood at Rs 45.\n\nSolana (SOL) Price Today\n\nSolana price stood at $88.04, marking a 24-hour dip of 0.25 percent. As per WazirX, SOL price in India stood at Rs 7,700.\n\nTop Crypto Gainers Today (January 26)\n\nAs per CoinMarketCap data, here are the top five crypto gainers over the past 24 hours:\n\nPyth Network (PYTH)\n\nPrice: $0.4214\n\n24-hour gain: 13.16 percent\n\nChiliz (CHZ)\n\nPrice: $0.1131\n\n24-hour gain: 9.54 percent\n\nIOTA (IOTA)\n\nPrice: $0.2515\n\n24-hour gain: 8.96 percent\n\nConflux (CFX)\n\nPrice: $0.1938\n\n24-hour gain: 7.57 percent\n\nEthereum Name Service (ENS)\n\nPrice: $19.02\n\n24-hour gain: 7.22 percent\n\nTop Crypto Losers Today (January 26)\n\nAs per CoinMarketCap data, here are the top five crypto losers over the past 24 hours:\n\nManta Network (MANTA)\n\nPrice: $2.92\n\n24-hour loss: 10.75 percent\n\nSui (SUI)\n\nPrice: $1.18\n\n24-hour loss: 5.33 percent\n\nInternet Computer (ICP)\n\nPrice: $11.28\n\n24-hour loss: 4.85 percent\n\nFTX Token (FTT)\n\nPrice: $2.62\n\n24-hour loss: 4.05 percent\n\nSATS (1000SATS)\n\nPrice: $0.0004094\n\n24-hour loss: 3.43 percent\n\nSubscribe And Follow ABP Live On Telegram: t.me/officialabplive\n\nDisclaimer: Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Cryptocurrency is not a legal tender and is subject to market risks. Readers are advised to seek expert advice and read offer document(s) along with related important literature on the subject carefully before making any kind of investment whatsoever. Cryptocurrency market predictions are speculative and any investment made shall be at the sole cost and risk of the readers."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxNSmFpRFVvaERnSEd4cEY2WVl2cGZYM2RtbXVNZ1Y1YkROOVRhVEc2ZmVBdTh5bWZBaHo5bk9Sa09lR0tOLUZqOUpSNGhNSXVVVFVCeDJXOExISExzNWs5aml3NVdWOXZVWlRfaDZleVFvRnJDWjV2NVp3SU5wM3d5TnR6SlNsNmx0X3dFTXE1SE9Kd3REanfSAZsBQVVfeXFMUEtUMlFrcGZ6dS1TUDE0M05JSVhKeUw0YnJBajJZRzBZUW5EYWstVlRUbjRFcDZHN2JUaElpSlpnX3NzRkNKYlFGcVpwejljVmR1Mk1majlMaEU3dGR2Tk0zcEFscjdxX3Y1dFJGM2N4cXk3bnItMTJBSEs5N2dxSDhLU3otNDRTWXBJbk9pUDk4a25qdHp4ZmVrcTA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 00:02:56 GMT",
        "title": "Analyst Thinks Ethereum Will Explode To $15,000, Cites Favorable Technical Formation - NewsBTC",
        "content": "A crypto analyst, Elja on X, predicts that Ethereum (ETH) will reach a staggering $15,000 by 2025 based on technical analysis. The analyst argues that the current bearish sentiment in the crypto market is “temporary.”\n\nMoreover, Elja notes that the second most valuable coin by market cap follows a similar fractal pattern that fueled its previous major price rally in 2021.\n\nIs Ethereum Ready To Rip Despite The Current Consolidation?\n\nSharing a screen grab of the current ETH price action, Elja says most people in crypto are “short-sighted” and only focus on immediate price movements. In the analyst’s assessment, traders should look at the long-term to understand the overall price pattern.\n\nRelated Reading\n\nThus far, Ethereum, like Bitcoin (BTC), remains under pressure and struggling to break above immediate resistance levels. Looking at the development in the daily chart, ETH is back at a critical support level of around $2,200. Notably, the coin is down 20% from January 2024 highs of about $2,700.\n\nETH is under pressure, at least in the short to medium term. As it is, the coin follows the technical candlestick arrangement visible in Bitcoin.\n\nThe altcoin downtrend appears to have been triggered by events following the approval of spot Bitcoin ETFs by the United States Securities and Exchange Commission (SEC). As an illustration, Bitcoin fell from around $47,000 to below $40,000 this week, weighing down altcoins, including Ethereum.\n\nOn-chain data shows that Grayscale Investments has been unloading thousands of coins behind Grayscale Bitcoin Trust (GBTC). Subsequently, there has been a sell-off in Bitcoin and across the altcoin scene. The situation has been made worse for Ethereum following the United States SEC’s decision to postpone the approval of spot Ethereum ETFs.\n\nWhile these developments have negatively impacted sentiment, Elja believes they will not derail Ethereum’s long-term growth trajectory. Specifically, the analyst notes that ETH is consolidating, a “healthy sign.”\n\nETH To $15,000: Will Fundamental And Technical Factors Help?\n\nElja added that when crypto prices consolidate, it could suggest that whales are accumulating their position. Once this ends, ETH prices could trend higher. From the analyst’s chart, the coin will break above $5,000 to $15,000 in the coming sessions.\n\nRelated Reading\n\nBitcoin Bearish Outlook: Analyst Predicts Price Nosedive To $38,130 8 months ago\n\nWhen making this prediction, the analyst compared the Ethereum price action to the fractal pattern that propelled ETH from around $200 to $4,800 in 15 months from 2019 to 2021. Extrapolating from past price action, Elja believes Ethereum is on a similar path. Based on analysis, the coin will likely break above November 2021 peaks.\n\nBeyond technical factors, ETH supporters cite the decreasing issuance rate. According to Ultrasound Money data, the network has been burning thousands of ETH, reducing supply. Additionally, Larry Fink, the CEO of BlackRock, believes Ethereum will be the choice network for tokenizing real-world assets (RWAs) in the years ahead.\n\nFeature image from Canva, chart from TradingView"
    }
]