[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiYkFVX3lxTE5ibGpuak5VQnZPSU85UFpOTUMyUmxlSjlfUE1uNzVyM0VkUEZlRHFMdER2a21rWHpTZWFiY0tEc1dMY1hiaTF0Y2poYWNyNEFsOEotVEFyTG1wQTBoM05uZnFn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jul 2024 07:00:00 GMT",
        "title": "What Is Base By Coinbase? Learn About This L2 Network And How To Get Started - Bankrate.com",
        "content": "At Bankrate we strive to help you make smarter financial decisions. While we adhere to strict editorial integrity , this post may contain references to products from our partners. Here's an explanation for how we make money .\n\nThe investment information provided in this table is for informational and general educational purposes only and should not be construed as investment or financial advice. Bankrate does not offer advisory or brokerage services, nor does it provide individualized recommendations or personalized investment advice. Investment decisions should be based on an evaluation of your own personal financial situation, needs, risk tolerance and investment objectives. Investing involves risk including the potential loss of principal.\n\nOur investing reporters and editors focus on the points consumers care about most — how to get started, the best brokers, types of investment accounts, how to choose investments and more — so you can feel confident when investing your money.\n\nBankrate follows a strict editorial policy , so you can trust that we’re putting your interests first. All of our content is authored by highly qualified professionals and edited by subject matter experts , who ensure everything we publish is objective, accurate and trustworthy.\n\nFounded in 1976, Bankrate has a long track record of helping people make smart financial choices. We’ve maintained this reputation for over four decades by demystifying the financial decision-making process and giving people confidence in which actions to take next.\n\nBankrate’s editorial team writes on behalf of YOU – the reader. Our goal is to give you the best advice to help you make smart personal finance decisions. We follow strict guidelines to ensure that our editorial content is not influenced by advertisers. Our editorial team receives no direct compensation from advertisers, and our content is thoroughly fact-checked to ensure accuracy. So, whether you’re reading an article or a review, you can trust that you’re getting credible and dependable information.\n\nWe value your trust. Our mission is to provide readers with accurate and unbiased information, and we have editorial standards in place to ensure that happens. Our editors and reporters thoroughly fact-check editorial content to ensure the information you’re reading is accurate. We maintain a firewall between our advertisers and our editorial team. Our editorial team does not receive direct compensation from our advertisers.\n\nBankrate follows a strict editorial policy , so you can trust that we’re putting your interests first. Our award-winning editors and reporters create honest and accurate content to help you make the right financial decisions.\n\nBankrate.com is an independent, advertising-supported publisher and comparison service. We are compensated in exchange for placement of sponsored products and services, or by you clicking on certain links posted on our site. Therefore, this compensation may impact how, where and in what order products appear within listing categories, except where prohibited by law for our mortgage, home equity and other home lending products. Other factors, such as our own proprietary website rules and whether a product is offered in your area or at your self-selected credit score range, can also impact how and where products appear on this site. While we strive to provide a wide range of offers, Bankrate does not include information about every financial or credit product or service.\n\nWe’re transparent about how we are able to bring quality content, competitive rates, and useful tools to you by explaining how we make money.\n\nBankrate follows a strict editorial policy , so you can trust that our content is honest and accurate. Our award-winning editors and reporters create honest and accurate content to help you make the right financial decisions. The content created by our editorial staff is objective, factual, and not influenced by our advertisers.\n\nYou have money questions. Bankrate has answers. Our experts have been helping you master your money for over four decades. We continually strive to provide consumers with the expert advice and tools needed to succeed throughout life’s financial journey.\n\nDisclaimer: Our writers and editors used an in-house natural language generation platform to assist with portions of this article, allowing them to focus on adding information that is uniquely helpful. The article was reviewed, fact-checked and edited by our editorial staff prior to publication.\n\nAs the use of blockchain technology and cryptocurrencies continues to grow, so does the need for faster, more secure and cost-effective technologies. This is where Base by Coinbase comes in. Base is a new Ethereum-based crypto platform that increases transaction speed and security and supports a variety of applications.\n\nHere’s what Base is, how it works, its benefits and potential drawbacks and its use cases.\n\nWhat is Base by Coinbase?\n\nBase by Coinbase is a crypto platform that uses the Ethereum network to increase transaction speed, security and accessibility while reducing costs. Unlike other cryptocurrency platforms, Base is specifically designed using blockchain to support decentralized applications (dApps).\n\nBase uses what’s known as Ethereum’s Layer 2 blockchain. The Layer 2 blockchain is designed to perform transaction-heavy work with speed, keeping costs lower for the main Ethereum blockchain (Layer 1). Base uses OP Stack, an open-source development platform, to create greater compatibility and ease of transition for developers familiar with Ethereum.\n\nBecause of this approach, Base can offer low transaction fees, faster transaction times and full compatibility with Ethereum processes. Base is linked with Coinbase, making it accessible for broader adoption in the blockchain ecosystem.\n\nHow does Base work and what is it used for?\n\nBuilt as an Ethereum Layer 2 (L2) blockchain network, Base is designed to increase performance, interoperability and scalability while decreasing transaction costs and settlement time.\n\nBase processes transactions off-chain through a mechanism known as “rollups,” bundling multiple transactions together and submitting them as a single batch to Ethereum’s Layer 1 for validation. This approach reduces costs and load on the main Ethereum network.\n\nThe primary use cases for Base include the following:\n\nDecentralized finance (DeFi) platforms\n\nNon-fungible token (NFT) marketplaces\n\nGaming and virtual worlds\n\nSocial media platforms\n\nSupply chain and logistics applications\n\nBase’s compatibility with Ethereum-based tools and frameworks, along with lower fees and faster transaction times, make it a useful platform for developers and individuals.\n\nThe benefits of Base by Coinbase\n\nBase by Coinbase offers some key advantages for individuals and businesses:\n\nFaster transactions: Base processes transactions quicker than the main Ethereum network, making it more efficient and user-friendly, especially during peak network activity.\n\nBase processes transactions quicker than the main Ethereum network, making it more efficient and user-friendly, especially during peak network activity. Lower fees: One of the biggest draws of Base is its significantly lower transaction fees compared to the main Ethereum network, making it a better option for frequent users.\n\nOne of the biggest draws of Base is its significantly lower transaction fees compared to the main Ethereum network, making it a better option for frequent users. Interoperability: Base supports a wide variety of blockchain applications and services, including decentralized exchanges, DeFi platforms and NFTs.\n\nBase supports a wide variety of blockchain applications and services, including decentralized exchanges, DeFi platforms and NFTs. Developer-friendly: Developers can run their existing Ethereum-based applications on Base without having to overhaul their code.\n\nDevelopers can run their existing Ethereum-based applications on Base without having to overhaul their code. Scalability: Base offers increased scalability, so it can handle a higher volume of transactions efficiently.\n\nBase offers increased scalability, so it can handle a higher volume of transactions efficiently. Accessibility: Base is linked with Coinbase, one of the most popular cryptocurrency exchanges, so it’s easily accessible to a broad audience in the blockchain ecosystem.\n\nThe potential drawbacks of Base\n\nWhile Base by Coinbase is a powerful tool, it’s equally important to consider its potential limitations and challenges:\n\nComplexity: Layer 2 solutions such as Base can introduce complexity that may be daunting for newcomers to blockchain technology. This complexity could slow user adoption and create hurdles in understanding its functionality.\n\nLayer 2 solutions such as Base can introduce complexity that may be daunting for newcomers to blockchain technology. This complexity could slow user adoption and create hurdles in understanding its functionality. Security concerns: While Base tries to maintain the security standards of the Ethereum Layer 1 blockchain, its new protocols could allow vulnerabilities and create security risks.\n\nWhile Base tries to maintain the security standards of the Ethereum Layer 1 blockchain, its new protocols could allow vulnerabilities and create security risks. Centralization: Base’s dependence on Coinbase, which holds significant control over transactions, challenges the decentralization ethos of blockchain technology. This concentration of authority within one entity may raise concerns for users, though Coinbase says it intends to decentralize the platform over time.\n\nBase’s dependence on Coinbase, which holds significant control over transactions, challenges the decentralization ethos of blockchain technology. This concentration of authority within one entity may raise concerns for users, though Coinbase says it intends to decentralize the platform over time. No native crypto coin: Unlike some competitors, Base doesn’t have a native crypto token. This lack might put Base at a disadvantage as it can’t incentivize developer activity through token grants, a common practice in the blockchain ecosystem.\n\nUnlike some competitors, Base doesn’t have a native crypto token. This lack might put Base at a disadvantage as it can’t incentivize developer activity through token grants, a common practice in the blockchain ecosystem. Scalability concerns: Despite its robust infrastructure, Base has had transaction failures and increased gas fees during periods of high use. So it may need further scalability to manage significant user growth in the future.\n\nDespite its robust infrastructure, Base has had transaction failures and increased gas fees during periods of high use. So it may need further scalability to manage significant user growth in the future. User experience: The transition from traditional Ethereum transactions to Base might not be seamless for all users, leading to potential difficulties.\n\nCan you buy Base from Coinbase?\n\nCoinbase says it does not currently plan to issue a new network token for Base. Instead, Base will use Ethereum as its native gas token. So at least for now there is no Base crypto coin to buy.\n\nCoinbase warns that users should be aware that scammers may try to send fake Base tokens and suggests that you don’t interact with anyone peddling fake Base coins.\n\nBottom line\n\nBase by Coinbase is a Layer 2 solution for the Ethereum network, offering faster transaction times, lower fees and increased compatibility with the Ethereum ecosystem. Despite some key advantages, users should pay attention to potential drawbacks such as security and complexity."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxQTDRzWDN6bGQyVEh5RW52U2NuWWxLbzJBbVBOVlFGcHFQcVdpTGZyVFNYVjBSeWtqRnVXeFMtQXAwMlV2VTJvZHA5am5RN1dBNFMtbms5NlRRdjdrdkVmUngxcFg5NG15WmtHVWtrc01nS1FoVW53ZFNzRUVXWDV4enc3QzJKNXQwOG1MRUFTWUt2WWxSQ3JISnRlV0IxRmx1RFp1RXlWQkVmdGJyQ1hIY19OeXZ2OEE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jul 2024 07:00:00 GMT",
        "title": "Lido Takes Initial Step to Decentralize Ethereum Node Operator Set Amid SEC Allegations - Unchained",
        "content": "Monday saw the debut of Lido’s Community Staking Module on the Holesky test network, which aims to allow new entities, including solo stakers, to become node operators without needing permission from its DAO.\n\nLido jumpstarted the liquid staking ecosystem in 2020 by introducing its flagship product, stETH, a rebasing token representing a person’s principal amount of staked ETH and their rewards from helping secure the Ethereum blockchain network.\n\nAs it faces allegations by the U.S. Securities and Exchange Commission, liquid staking leader Lido is preparing to become more decentralized by taking a step toward integrating a more diverse set of Ethereum node operators, such as solo stakers, the “gold standard” for staking, per the Ethereum Foundation.\n\nOn Monday, a Lido initiative called Community Staking Module, which is expected to allow permissionless entry for node operators, activated on the Holesky test network, according to a governance post in Lido’s forums by Dmitry Gusakov, the tech leader of Lido’s community staking product.\n\nThe move comes days after the SEC implied in a lawsuit against Ethereum software provider Consensys that Lido’s liquid staking token, stETH, is an unregistered security. Staked ETH, aka stETH, represents a person’s principal amount of staked ETH and their staking rewards from helping secure the Ethereum blockchain network.\n\nLido’s stETH has a market cap of $33 billion, making the liquid staking provider the leading DeFi protocol by total value locked. According to a Dune Analytics dashboard by crypto analyst Hildobby, Lido commands a 29% share of the total 33.3 million staked ETH.\n\nThe advent of Lido’s community staking module marks a change to the protocol that first introduced liquid staking in 2020, because Lido on Ethereum has had a curated and permissioned validator set since its inception, in which those interested in acting as a node operator for Lido had to be vetted by the Lido DAO.\n\nPermissioned and Restricted Since Inception\n\nUnlike its competitor Rocket Pool, before a node operator can conduct validator operations for Lido, governance has to vote on whether to include a prospective address into Lido’s active set of node operators. At presstime, Lido has 39 node operators, which includes the likes of P2P.org, Chorus One, and Consensys.\n\nThe initiative centered on permissionless entry allows “any node operator – and especially community stakers, from solo stakers, to groups of friends, to amateur operators – to operate validators by providing an ETH-based bond (security collateral),” according to its documentation.\n\nThe new community module is expected to make solo staking more accessible through its inclusion of several features such as a low bond for node operators as well as smoothed rewards from Ethereum’s execution layer and maximum extractable value.\n\nLido becomes less centralized by making its node operator set permissionless. During the lifecycle of a crypto project, a protocol will typically start with heavy elements of centralization, ranging from core developers holding control over the direction of the project, sometimes in the form of fundraising to delaying a protocol’s token generation event that aims to introduce governance mechanisms for those in the community.\n\nEventually, founders and core members of a protocol would introduce decentralization initiatives, such as implementing onchain voting processes or making node operation permissionless such as the case with Lido.\n\nSEC’s Focus on Consensys and Lido\n\nAlthough, like most DeFi projects, Lido has had a roadmap to decentralization for a while, the initiative comes several days after the SEC charged Consensys for offering and selling unregistered securities, namely Lido and Rocket Pool’s liquid staking tokens, through Metamask, a crypto wallet where people can stake and swap cryptocurrencies.\n\nConsensys, which is also a node operator for Lido, “has offered and sold tens of thousands of unregistered securities on behalf of liquid staking program providers Lido and Rocket Pool, who created and issue liquid staking tokens (called stETH and rETH) in exchange for staked assets,” the SEC’s press release states.\n\nRead More: Could the SEC Have a Case Against Liquid Staking Protocols?\n\nThe complaint calls Lido and Rocket Pool issuers of unregistered securities, alleging that their staking programs “are each offered and sold as investment contracts and, therefore, securities.”\n\nFollowing the prongs of the so-called Howey test, which, since a 1946 court case, has been the legal measure to determine whether an investment is a securities offering, the agency said these liquid staking tokens meet the criteria.\n\nIn its press release it said, the buyers of LSTs “make an investment of ETH in a common enterprise with a reasonable expectation of profits from the managerial efforts of Lido and Rocket Pool, respectively.” However, neither Lido nor Rocket Pool has filed registrations to offer these securities with the SEC.\n\nWith the fourth prong of the Howey test being “the managerial efforts of others,” crypto projects have sought to be decentralized enough that such a third party could not be easily named.\n\nWhen Unchained reached out to the founders and key members of Lido in May for commentary on whether the SEC took action against the liquid staking provider or contacted them about stETH, Unchained did not receive a response. According to a snapshot vote taken in Aug. 2022, Eric Hill, who goes by @Rotorless on X, is Lido’s head of legal and general counsel. However, when Unchained contacted Hill for commentary, he said he did not hold that position anymore and wasn’t “the right person to talk to.”\n\nAfter the SEC’s lawsuit against Consensys, when Unchained highlighted SEC’s claims that stETH is an unregistered security, Lido marketing lead Kasper Rasmussen said, “We’re on it,” but did not provide additional insights.\n\nLDO, the governance token for Lido, has decreased 6.3% in the past 24 hours and 19.7% over the last 30 days to trade at $1.92, making its market cap stand at $1.7 billion, per CoinGecko.\n\nUPDATE (July 3, 2024, 3:08 p.m. ET): Added clarification on the timeline for Lido’s plan to make the process to become a node validator permissionless, as well as the way Lido founders and key members responded to queries about regulatory issues when Unchained reached out to them in May."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE50YU9yNmg4aXJRYUpCZmxsUkFtdFJHQVlGaDRpUUxLTnRrSmtwTHRvNjRRb0FrdWdzcXlJVlRSVWpibm9wakxaQ0ZNaGNLVkZIaVRXUVpBUG9GQy1HVW5JcWY0OVgzNmFybS1CRnlHRDNVdVhKU2fSAX5BVV95cUxNVkYwaDlpS2pOQTA5XzVDY0gtVU1jdDRIX2dZQ05BTlF3R3FyVkZSNWw3Y3cxMHNYQWFtY21Ga3NwdnZfVVl5em9XNUJCR1EwbEFPZU5YTWFqaW9aLWtSaGpZLUtGZmhCRzdoQTVvQWNaM3RCUzJkQjdxY0hSY2c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jul 2024 07:00:00 GMT",
        "title": "Bitwise Updates Ethereum ETF Filing as US Listings Near - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAsset manager Bitwise submitted an updated registration statement for its proposed spot Ethereum ETF with regulators on Wednesday, disclosing its plans to waive fees. While largely procedural, this latest revision is seen by market observers as a sign that the launch of Ethereum ETFs is imminent.\n\n“Expect more from other issuers throughout the rest of the week,” Bloomberg ETF analyst James Seyffart wrote on Twitter (aka X). “We're thinking these things could potentially [be listed] later next week, or the week of the 15th at this point.”\n\nAfter shares in the Bitwise Ethereum ETF are listed on an exchange, Bitwise will waive a yet-to-be-defined management fee on the first $500 million its fund garners during that period, the amended filing with the Securities and Exchange Commission (SEC) stated.\n\nBitwise’s move follows similar ones from Franklin Templeton and VanEck. Both ETF hopefuls have included fee waivers in filings for the first $10 billion and $1.5 billion, respectively.\n\nAD\n\nAD\n\nAnticipation of the trading of spot Ethereum ETFs has grown steadily since the regulator’s last-minute approval in May. While the SEC approved several so-called form 19b-4s, it has yet to green light individual S-1 filings from asset managers, which are needed for trading to begin.\n\nBitwise submitted its amended S-1 days before it was actually due, according to Bloomberg ETF analyst Eric Balchunas. On Twitter, he floated the idea that Bitwise “wanted to get it off their plate,” and that the SEC’s latest round of comments appeared to be minimal.\n\n“From what I hear the last round of comments were ‘literally nothing’—took zero time to update,” he said.\n\nBalchunas concurred that the class of products seems on track to begin trading this month. At the same time, he wondered why the regulator appears to be dragging its feet, considering the SEC seems mostly satisfied with the filings that firms have put forward so far.\n\nAD\n\nAD\n\n“Given how light comments were, these could have easily been trading by now,” he wrote. “Could be one 'problem' issuer slowing down [the] process or just summertime.”\n\nNot long after spot Ethereum ETFs were approved on May 23, the cryptocurrency rallied to around $4,000. Yet as the approval process has played out, Ethereum’s price has shed most of those gains, drifting down $3,270, as of this writing.\n\nSEC Chair Gary Gensler said last month that the process for launching spot Ethereum ETFs is “going smoothly.” Speaking at the Bloomberg Invest Summit, he added that progress is dependent on asset managers providing full disclosures.\n\nThough Bitwise’s amended filing has few changes, it does include new disclosure language. For example, a clause was inserted stating the “chair of the SEC has stated that the SEC has authority under existing laws to regulate the digital asset sector” within a section on oversight.\n\nBitwise also added a few sentences disclosing that certain digital asset trading platforms, to the extent that they are regulated, may not be in compliance with applicable rules.\n\nFinally, a section also outlines the “Initial Creation of Ether.” Looking at Ethereum’s initial supply of 72 million, it shows how most was sold to the public through a crowd sale in 2014, alongside distributions to the Ethereum Foundation and the network's developers.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE9HSnJ5UXZkWjhsRjBhV2pLNnZjSFpGNFRHUlhjUHhiMDhSNVVPTWJKbkVyWUVJaG05bmRXUXdqeEk4MW0zSFViaUFoNWV0VTNmNXJ5R1BzVFVLalFEa3FFV3MtbWxEX3p6eDZ5NFd0TXI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Set For Explosive 30% Surge As ETF Approval Nears, Says Analysts - TronWeekly",
        "content": "Ethere­um (ETH) is generating considerable­ excitement as the­ U.S. edges closer to approving spot ETFs. Analysts pre­dict substantial capital inflows into these ETFs, potentially driving ETH price­s higher. This optimism is bolstered by re­cent technical analyses pointing to a bullish tre­nd for Ethereum.\n\nRenowne­d analyst Ali Martinez recently e­xamined Ethereum’s 3-day chart, re­vealing insightful data. Martinez highlighted the­ TD Sequential indicator, known for pinpointing market turning points, which flashe­d a buy signal for Ethereum. This signal suggests a possible­ rebound for ETH, indicating a short-term bullish outlook.\n\nEthereum Set for Explosive 30% Surge as ETF Approval Nears, Says Analysts 5\n\nThe TD Se­quential indicator is respecte­d for identifying trend exhaustion points. A marke­d 9 buy signal typically precedes price­ recovery or trend re­versal. Martinez interpre­ts this signal as a precursor to a rebound following a period of downward price­ movements. Historically, such signals have be­en followed by a consolidation or a reve­rsal.\n\nMartinez’s analysis indicates that Ethere­um might see a corrective­ upward move. The rece­nt price action shows Ethereum trading downward, with occasional upward spike­s. The ‘9’ buy signal suggests a potential pause­ in the bearish trend, possibly le­ading to a brief rally. This aligns with historical behaviors observe­d after such signals.\n\nBullish Breakout Suggests Ethereum Price Surge\n\nAnother notable­ analyst, ZAYK Charts, presents a bullish scenario for Ethe­reum. ZAYK identified a falling we­dge on the ETH/USDT 12-hour chart. This bullish pattern ofte­n reverse downtrend, sugge­sting a potential upward breakout. The chart illustrate­s ETH consolidating within converging trend lines ove­r the past months.\n\nEthereum Set for Explosive 30% Surge as ETF Approval Nears, Says Analysts 6\n\nZAYK’s analysis shows that the breakout from the­ falling wedge is complete­, indicating a shift in market sentiment. This te­chnical pattern’s confirmation suggests a bullish wave, with 20-30% price­ increase projections. Following this bre­akout, Ethereum’s target price­ range is optimistic and promising.\n\nCurrently, ETH is trading at $3,484.66, showing a 3.38% increase­ and a 53.58% rise in trading volume within a day. This positive price­ action indicates potential further upside­s. The price is encounte­ring resistance around the $3,500 mark, with significant barrie­rs at the $3,520 and $3,550 levels. A close­ above $3,550 could propel Ether towards the­ $3,650 resistance.\n\nEthereum Set for Explosive 30% Surge as ETF Approval Nears, Says Analysts 7\n\nFurther re­sistance is near $3,720, and an upside bre­ak above this level could drive­ the price higher, pote­ntially reaching $3,880. However, a downside correction might start if Ethe­reum fails to clear the $3,550 re­sistance. Initial support is ne­ar $3,480, with significant support at the $3,440 zone.\n\nA move be­low the $3,420 support might push the price towards $3,350. Furthe­r losses could decrease­ the price to $3,320 in the short te­rm. Overall, technical indicators and market se­ntiment suggest Ethere­um is poised for a potential price surge­, supported by expecte­d ETF approvals and bullish technical patterns.\n\nRelated Readings | Solana (SOL) Faces 16% Value Drop, Yet Bullish Predictions Drive Hope Amidst Decline"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxOendzUnlldlZIVGJNWWI1aGFHQUdpcnBJSnlPZ2toOFE3cHBNbXB0SHJrREw5SE94T2hsYW9iYnZ3bXZuemNzQy1CclN3cnJZS2hTbTViSEVwaWhSckhkMy1GZi1oSTYtMkdNQllQb3hDYmJiZmN1eVN1RC1mWFVISFQtQ3lWMWdLbEJYd2hndVYydm8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jul 2024 07:00:00 GMT",
        "title": "Memecoin Deployer Pump.Fun’s Daily Revenue Surpasses Ethereum - Unchained",
        "content": "Pump.Fun’s annualized revenue, calculated by taking revenue data from the last 30 days and multiplying the figure by 12, is projected to be $268.95 million, DefiLlama shows\n\nDespite a $1.6 billion decrease in total memecoin market cap since June 17, dropping from $53.3 billion to $51.7 billion per CoinGecko, Pump.Fun averages $692,000 in daily revenue, indicating ongoing memecoin activity.\n\nThe memecoin frenzy is showing few signs of slowing down. Solana-based memecoin deployer Pump.fun surpassed Ethereum in revenue generated over a 24 hour period on Monday.\n\nPump.Fun, a platform where crypto users can create memecoins at low costs, hit an all-time high, generating $1.99 million in revenue within a 24 hour period, according to blockchain analytics firm DefiLlama. This surpassed the daily revenue figures generated by popular layer 1 blockchains such as Ethereum’s $1.19 million in revenue, Tron’s $1.58 million, and Solana’s $806,957.\n\nThe revenue spike for Pump.Fun stems from the memecoin frenzy that has largely taken place on Solana, with celebrities such as Caitlyn Jenner, Iggy Azalea, Rich The Kid, and Davido using the platform to launch their own memecoins.\n\nRead More: Solana Attracts Attention From Mainstream Celebrities\n\nFew Success Stories\n\nWhile some tokens have seen some success such as Azalea’s MOTHER token reaching a roughly $150 million market cap before settling around $53 million at the time of writing, success stories are seldom with nearly 1.2 million tokens having been deployed through Pump.Fun since its inception, which are all competing for the market’s attention, a Dune Analytics dashboard by Asian-based blockchain firm Hashed shows.\n\nFor example, the majority of celebrity tokens, such as Nigerian singer-songwriter Davido’s memecoin, have seen their prices plummet since their launch in May.\n\nProjected Revenue\n\nEven though the market cap of all memecoins has decreased by $1.6 billion since June 17 from $53.3 billion to $51.7 billion at presstime per CoinGecko, Pump.Fun has been able to average $692,000 per day in revenue, a sign people are still using Pump.Fun for memecoin activities.\n\nIf the momentum around memecoins sustains, the platform is projected to have an annualized revenue of $268.95 million, which DefiLlama calculates by taking revenue data from the last 30 days and multiplying the figure by 12. Pump.Fun recorded revenue of $22.05 million in June.\n\nPump.Fun earns revenue in a few ways, namely a 1% swap fee from those trading memecoins on the venue and an additional two SOL fee when the token gets listed to decentralized exchange Raydium."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNSDJla0lJNVFtV3JlWG1TUkR1MmJqUzJfM285QnZfaWVHOVBkdGxoM1FTQ2ttdmgyMWFvZS1USk9fMkkyZjF6YUhlbXNDc0ViY3NwVlA3ODhGTlFYV0lhWGZuWDRSWlNCUTNsdEhEczNRTHQwUGxJX1R4Z3FKa0trWlNhWWJhNjlXTnFTetIBlAFBVV95cUxNb044c1NVc3VYb2tKZkxIVGc5LTdzaVJNRTVsVmJweFAzdlVZZEZjWElzMG9EOTlXdDh0NndKYTZWb244S1VIbms1cGlNNUxEc0xrTDhVcTV2NS05MWt3QzlyaGc0RnBzbmZPTFFqVE9IeUhUQURDS1NObEwxcVJUNlJjYm9ILXM0TFhiTUNldEhjck1R?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jul 2024 07:00:00 GMT",
        "title": "Crypto Liquidations Top $200 Million as Ethereum, Bitcoin Fall - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nCrypto market liquidations spiked to their highest point in a week on Wednesday as the price of Bitcoin sunk below $60,000.\n\nIn the past 24 hours, more than 74,000 traders were liquidated to the tune of $208 million, CoinGlass data shows.\n\nThe majority of those — some $184 million — struck investors holding long positions that had bet on prices going up.\n\nThe largest liquidations afflicted Ethereum investors, at $55.5 million, almost entirely in long positions, data shows.\n\nAD\n\nAD\n\nOngoing issues surrounding U.S. monetary policy, geopolitical tensions, and the upcoming U.S. presidential election in November are projected to impact the top cryptocurrency's price throughout 2024.\n\nBitcoin dropped from around $62,200 to as low as $59,425 in intraday trading. The asset has since clawed back losses above $60,200 but is still down 3% over the past 24 hours.\n\nMeanwhile, Ethereum is down by 3% over the same period, falling from a Wednesday high of $3,425 to as low as $3,254. It's now trading at $3,300.\n\nSolana, the world's fifth-largest crypto by market cap, took the largest hit among the top 10 coins, down roughly 8% to $140. Solana had been riding high on New York-based investment management firm VanEck's filing of its “Solana Trust” exchange-traded fund late last month.\n\nAD\n\nAD\n\nTop cryptocurrencies have fallen over the past month. Ethereum is down over 12% across 30 days despite simmering interest in the debut of Ethereum spot ETFs.\n\nSome analysts predict the new financial products could begin trading by mid-July, with at least one firm predicting the price of ETH will subsequently take off. Bitcoin is down 12% over the same period.\n\nTo be sure, analysts still see further price gains this year, with the current market cooling representing a precursor to another major price surge in the coming months, Decrypt reported Monday.\n\nOn Wednesday, analytics firm CryptoQuant released a report examining Bitcoin mining metrics and flagged conditions for a bottoming of prices at current levels.\n\nEdited by Sebastian Sinclair."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFBaWTdjcE1DOFhEMzRHdWF6Y21yRXBmX2djdjJTbUUzYVYyV1p6eEN1ekF4amwzYXZsdWJMaW5fcHJZaU1IVmcxcGs5cmxmWkMtYzIwekp2WGFpWjJaZjdTenplcFlXcHVTUEhqODRFRFBVRGpXQjYycmExQjPSAYIBQVVfeXFMT3pRMEppcVlVZFFkM3JWUDhicE1YakctenJ2YzFQN0ZhVkIyTkkwWVNOQzRwekt3WmctQ3F4RnZhV3ZsX3A4TGNyU05ZMnFaaTVMR3FWRGVQTDlxSFNwZEs5dWpWM2VwQVAweXpMSDgybVNLdXB5OENtQ3hoWEJLcG42Zw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jul 2024 07:00:00 GMT",
        "title": "Nearly $70 Million in Ethereum (ETH) Sent to Major Exchange - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nEthereum (ETH) whales appear to be igniting a potential sell-off today, as nearly $70 million worth of the cryptocurrency was transferred to Binance, one of the world’s largest cryptocurrency exchanges. This movement has sparked concerns among ETH traders about a possible market downturn.\n\nAdvertisement\n\nWhale Alert, a prominent blockchain tracking service, reported two big transactions early this morning. The first tweet revealed that 9,999 ETH, worth around $34.3 million, were transferred from an unknown wallet to Binance. Shortly thereafter, Whale Alert tweeted again to disclose that another 7,413 ETH, worth around $25.4 million, were transferred from an unknown wallet to Binance.\n\nThese transactions amount to a total of 17,412 ETH, equivalent to approximately $69.86 million at current market prices. Such large transfers to an exchange typically signal an impending sell-off, as whales — large holders of cryptocurrency — often move their assets to exchanges when they intend to sell.\n\nBroader market impact\n\nThe news of these substantial transfers has already had a palpable effect on the market. Ethereum’s price has shown increased volatility following the alerts, with traders closely monitoring Binance for any signs of large-scale selling activity. The potential sell-off by these whales could exert downward pressure on the ETH price, impacting the broader market as well.\n\nAdvertisement\n\nHistorically, significant movements by whale accounts have led to notable price fluctuations. When large amounts of cryptocurrency are sold off, it can trigger a domino effect, causing other traders to panic and sell their holdings, further driving down the price.\n\nAs of writing this article, the Ethereum price is $3,447.60. It has fallen 0.30% in the last 24 hours. However, the ETH price is down 8.94% over the past 30 days thanks to the ongoing bearish phase on the broader market. While the ultimate impact on Ethereum’s price remains to be seen, the movement of such large amounts of ETH to an exchange is a signal that cannot be ignored."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxNSVBpajlfM0lQSjQ4YnFkNkU2VjdXRHlCWVZPekZvMEtZZm5jTmxjOW5rdHZjem13M0wxc0NuOFVnT045MXNmVkNCZUtoMzNtYmtqVXI3WDBoalhRaExMVk0zeXB0TFRGU2pNUFZxdGxZMVAyVHJkMWtidkRHSEhuT2RYVkNKeDFiT1dv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jul 2024 07:00:00 GMT",
        "title": "Ethereum: Its History and Future Outlook - Camarillo Acorn",
        "content": "Ethereum, the world computer, has been instrumental in the blockchain and the cryptocurrency community since its entrance. Being one of the largest platforms for the implementation of smart contracts and dApps, Ethereum has become a platform for many new ideas in the digital economy niche. Appreciating its history from when it was born up to the present and its possibilities is useful in comprehending its importance and possibilities. Also, certain points in Ethereum’s timeline can be marked as important, for example, the Ethereum price all time high and the lowest price Ethereum has hit in 2024.\n\nThe Birth of Ethereum\n\nEthereum was introduced in late 2013 by a young programmer, Vitalik Buterin. Buterin planned on building a platform surpassing what Bitcoin can offer, a decentralized platform for executing smart contracts and dApps. This vision aimed at using blockchain technology not only to de-centralize money but also a number of applications and operations.\n\nThe development of Ethereum was backed by an ICO in 2014, the project creators accepted over 18 million dollars in Bitcoins. This funding effort was a testimony to the fact that the people believed in Buterin’s vision. The Ethereum network officially went live on July 30, 2015, with the first block known as the “Frontier.”\n\nEthereum’s Evolution and Milestones\n\n1. Early Growth and Adoption: The early years of Ethereum though were quite dynamic and experienced high adoption rates. Due to the ability of Ethereum’s smart contracts, developers began to actively engage in developing dApps. Many initiatives, starting from decentralized finance (DeFi) and ending with gaming, appeared during this period and were based on Ethereum.\n\n2. The DAO and Its Aftermath: A major milestone in the history of Ethereum is The DAO (Decentralized Autonomous Organization) hack in 2016. The DAO was a very ambitious project envisioned as a decentralized venture capital fund. However, a flaw in its code was taken advantage of, and 50 million dollars in Ether were stolen. This caused a rather bitter fork, where the community was split in two: Ethereum and Ethereum Classic, whose token is ETC. The reason for forking was the community’s decision to get the funds back and to make the platform trustworthy.\n\n3. Reaching All-Time Highs: The price of Ethereum has been volatile over the years, which depicts the growth of the currency and people’s interest in it and the crypto space as a whole. The highest Ethereum has ever been recorded was in November 2021 when one ETH was trading at above $4800. This milestone signified the escalating beliefs in the Ethereum project and cryptocurrencies with the DeFi, NFTs, and the Ethereum 2.0 launch.\n\n4. The Technology Behind Ethereum: Ethereum platform is based on implementing smart contracts and Ethereum Virtual Machine (EVM). Smart contracts are digital contracts that are self-executing with the terms of the contract written in code. These contracts operate on the EVM, meaning that the implementation of these contracts is done to the letter as is coded, and there are no chances of downtime, censorship, fraud, or third-party meddling.\n\n5. Ethereum 2. 0: An essential shift that characterizes Ethereum technology is the shift to Ethereum 2. 0, also called Eth2 or Serenity. Ethereum 2. As for the platform’s major concerns such as scalability, security, and energy consumption, 0 attempts to tackle some of them. The upgrade involves moving from the proof of work (PoW) to the proof of stake (PoS).\n\n6. Proof-of-Stake (PoS): In PoS, the validators are selected to produce new blocks and check transactions depending on the number of tokens they own and are willing to pledge. This is anticipated to cut energy usage by a large margin, thus improving Ethereum’s sustainability. Moreover, PoS is aimed at increasing the network capacity so that more transactions can be processed per second, eliminating the issue of high traffic and high gas fees.\n\nBenefits and Challenges\n\nBenefits\n\nDecentralization and Security: Ethereum’s decentralized nature ensures that there is no single point of failure for applications.\n\nInnovation Platform: Ethereum introduced the smart contract feature, which created a market of decentralized applications combined with various industries, from finance to gaming and even supply chains.\n\nInteroperability: Ethereum’s open-source architecture ensures the integration and cooperation between various platforms and applications in the ecosystem.\n\nChallenges\n\nScalability Issues: Nonetheless, Ethereum has a major problem of scalability whereby the network usually gets congested and this attracts high charges. Ethereum 2. 0 also aims at solving these problems but the change is gradual and continuous.\n\nRegulatory Uncertainty: Like all cryptocurrencies, Ethereum is not free from the criticism of the regulating authorities. Changes in the law on its uptake and application can influence it.\n\nSecurity Vulnerabilities: Smart contracts are very effective but sometimes contain errors and flaws that can lead to attacks such as the one witnessed in the DAO hack.\n\nFuture Outlook\n\nSeveral prospects indicate that Ethereum’s future is bright, and several important advancements are likely to strengthen its status as a dominant blockchain.\n\nEthereum 2. 0 Implementation: The complete execution of Ethereum 2. These include scalability, security, and energy efficiency, and it is expected that the 5G network 0 will offer many improvements. This upgrade may encourage developers and enterprises to deploy their applications on the Ethereum network since it is a more reliable and fast network.\n\nDeFi and NFT Growth: The DeFi and NFT markets which are closely associated with Ethereum are expected to expand in the future. DeFi applications provide financial services with no intermediaries, and NFTs are non-interchangeable digital assets that include art, virtual land, etc. For Ethereum these innovations will be vital for its to remain relevant in the future which is why the support for these innovations will be important.\n\nEnterprise Adoption: Enterprises are increasingly using blockchain solutions to enhance business aspects such as transparency, security, and efficiency. Ethereum’s well-deepened ecosystem and further growth make it a valuable candidate for enterprise use, which can result in further expansion and becoming a more widespread part of business processes.\n\nCommunity and Development: The Ethereum community has been, and continues to be, very engaged and enthusiastic about the platform. This way, it is possible to constantly improve and develop the approach that corresponds to the current tendencies and issues. Given that the Ethereum’s development is based on a principle of collaboration, it will most probably remain a leader in the field of block-chain technologies.\n\nFinal Notes\n\nEthereum has evolved from a unique concept to one of the most significant parts of the blockchain and cryptocurrency sphere. It has introduced the elegance of smart contracts and Decentralized applications to the world, which has completely changed the way assets are interacted with and managed.\n\nDespite the issues concerning the network, including the matters of scaling and the legal environment, the further evolution of Ethereum 2. Thus, it has a 0 ranking and strong community backing, which shows it has a bright future ahead of it. Thus, as Ethereum is constantly developing, it is ready to stay one of the leaders in the digital economy and contribute to the development of further implementations of decentralized technologies."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTFBEdHZlaUNNdFZpUmhldHRhVzJNUFpZTC1RcklMNk0wQy1OemJNM1Flc1V6djBhbW5wS0FZZGFCYnpNTUU1dWVJZnNIekNiUnV1N0hlYzdZc0NiRVJtWnQ4NHNKVm5sYmVadC1RT09HeHJRSUxPQlQ2dlpFQ1oycWPSAYcBQVVfeXFMTzk5RFFCcUFudzBBLXVXaVZTWmJMc3ZfOGRSWUlwVi1HcFNTQmRqZU1xQlFlRTExODNTamNRWXlXVHIzdFpDNjVXbHZYdEo3M1lGSzRIVmdWYXNoM3ZEck1uQ1RRNlliZXZBaDdneWtLTmRwYnRHWTFJS0tmSWFaLWdGZExrNHpB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Will Soar Against Bitcoin After ETF Approvals: K33 Research - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEthereum is primed to mount a comeback against Bitcoin this month after underperforming its sibling cryptocurrency since the start of the year, according to K33 Research.\n\nOn the one hand, the leading smart contract platform is poised to receive its first US-listed spot exchange-traded fund (ETF) in July, inviting a tidal wave of new institutional demand into ETH. Meanwhile, Bitcoin holders are awaiting a 141,686 BTC ($8.8 billion) distribution from defunct Bitcoin exchange Mt. Gox—a looming tsunami of potential sell pressure now ten years in the making.\n\n“The chickens of 2014 have come home to roost,” wrote K33 Research in a Tuesday market update. “We expect net selling pressure to burden Bitcoin in an otherwise dry summer market, widening the chop suey range until rosier days arise as the leaves turn orange.”\n\nAD\n\nAD\n\nThough the crypto market has lost much of its bullish momentum since April, K33 maintains that Ethereum ETFs will absorb between 0.75% and 1% of all ETH in circulation within their first five months on the market. Though the ETF launch could spark a “sell the news” event for ETH in the short term (much like Bitcoin ETFs in January), the firm says ETH’s “positive supply dynamics” will afford it “relative strength” over the next several months.\n\n“ETFs are a solid catalyst for relative ETH strength as the summer progresses and flows accumulate,” continued K33 senior analyst Vetle Lunde, “and I firmly view current ETH/BTC prices as a bargain for the patient trader.”\n\nThe ETH/BTC ratio steadily declined from 0.056 after the Bitcoin ETFs launched down to 0.046 By May 24. That’s when surprise news broke that the SEC would soon approve Ethereum ETFs, taking the ratio back up to 0.055 today.\n\nIndicators suggest that positive sentiment around both ETH and BTC is returning to form—particularly in the futures market.\n\nBitcoin futures premiums on the Chicago Mercantile Exchange (CME) are back to trading in double digits at 10.9%, according to the report. As for Ethereum, the newly launched VolatilityShares 2x leveraged ETH ETF now holds 33,700 ETH ($114 million) equivalent exposure after just 15 trading days, showing that CME traders want long-leveraged exposure to ETH right now.\n\nAD\n\nAD\n\nThe new ETF’s popularity has helped push CME ETH open interest back towards all-time highs, currently sitting at 372,000 ETH ($1.26 billion). K33 Research said such high interest signals intent to make directional trades around ETH before the ETFs go live – though the direction of those trades remains unclear.\n\n“The soft funding rates suggest that the directional expectations are balanced, with neither bullish nor bearish positioning dominating – highlighting the uncertain market outlook and lack of consensus as ETH ETF launches are nearing,” the report concluded.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxPdHpUZVQ5eUt6SW1SYy1hazg1emJOQ3F3Q1NTUHdFQjhyMHJfc1BtUXZQXzhlNHNrOXpEMzV2S3BYY2ppTHZhd0NOdWJrYzFQRW5QRUVGZTZZcHVLMFZoSmtwS0JscjBMSXo5dG5HV3o3cVhlVG1lbDgySkdWRk15M1JTZDQxX05iWEVQR0QxeVpfTEpOYzJET3M2WDlkMTlRdzlhajVfUW5QaXE1R1JiNGpJWGpGLUhS?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Faces $60M Outflow Amid Solana ETF Hype and Network Growth - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTFByQUZRY2lPdm0tLThjTndBNEJRcUVIWkdvMnpLa2VUNTMzWXlmRTR5azhaSDJkaE53UXJ4UnRObE94dzhDbmt6MlotckE2Z1NDazREQWpIVEQwZm5SMGZaUzlmU1Vtc0V1c3ZOZkdCMjVrZG8xeGtHRDFoQW1pZ9IBgwFBVV95cUxPZkw0RDdGbHdGRmlsb1RYLW5laFFJbGlaazVCUUhOd3hhc1ZHTVVEMXVsOGQxWTZGdzBPVEw1dV9tNmxPVHpHZUNHa2tLOTNaeDdyVEs0Z2VTMmFwX2Jmc2l4cXRmLUx2NmdmWUVXUXJpRU14Wm1UQjhuclR4VTJtN3FBdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Skyrockets 100% Against Bitcoin in Annual Revenue - U.Today",
        "content": "Ethereum has surpassed Bitcoin in fee income over the past year by an epic 100%, according to the newest report from Lookonchain. Thus, its network has recorded $2.73 billion in fee income, the most in the industry. Bitcoin, in second place, generated $1.3 billion. Closing the top three is Tron Network, with almost $460 million.\n\nAdvertisement\n\nOther networks also contributed to the overall fee income landscape. Solana generated $241.3 million, Binance's chain accumulated $176.6 million and Avalanche recorded $68.83 million. Additionally, the zkSync Era earned nearly $60 million, Optimism $40.4 million and Polygon $23.9 million.\n\nHere are the top 10 chains by 1-year fee revenue.#Ethereum earns a fee of $2.728B per year, #Bitcoin earns a fee of $1.302B per year, and #TronNetwork earns a fee of $459.39M per year. pic.twitter.com/ixAiP9g8JA — Lookonchain (@lookonchain) July 3, 2024\n\nAs the data highlights, Ethereum has a significant lead, doubling Bitcoin's revenue. This result is attributed to a broader range of applications and services on the network of the main altocin, with higher usage and transaction fees as a result.\n\nAdvertisement\n\nSure win?\n\nEthereum's ecosystem supports decentralized finance platforms, NFTs and various applications, all of which contribute to increased transaction volume and fee income. This is what has positioned ETH as a more versatile and widely used network compared to Bitcoin.\n\nIn return, Bitcoin's revenue, while still over a billion dollars, is primarily driven by its role as a digital store of value and medium of exchange. Its transaction fees are affected by network congestion and the price of BTC itself, which can fluctuate significantly.\n\nHowever, it still lacks the extensive range of applications found in the Ethereum ecosystem, resulting in lower overall fee income."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxNeUpMN3lJTllsTzJJVVZHZEJ6RGdXZk1GT3ZQLUJKdjE1Qkp4SXNsYVhEcUpuUWdjNUFfRlhhOENISi1CWDlHQmFNNTBGM2VKVlVVeVlIc1RIOTl4YjZ6X09ac054TmZ1NWctb3k1RlBJZkxZMGJHdlRqbENHNnVwWmJXeDhwbFlueDF2OTNTM2FRdVpVWlJz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jul 2024 07:00:00 GMT",
        "title": "Lido sees around 100k increase in staked Ethereum amid SEC scrutiny - CryptoSlate",
        "content": "Lido has reported a rise in staked Ethereum on its platform despite the US Securities and Exchange Commission (SEC) classifying its staking programs as securities in its lawsuit against Consensys.\n\nStaked Ethereum increase\n\nA July 2 report showed that Lido users staked an additional 95,616 ETH between June 24 and July 1. This increased the total value of assets staked on the platform by 1.26%, reaching $33.48 billion.\n\nDuring this period, Lido led in net Ethereum deposit inflows, surpassing centralized exchanges like Binance and Gate.io and the rapidly growing liquid restaking project Ether.fi.\n\nThe platform also revealed significant activity in its wrapped staked ETH (wstETH) on Layer 2 networks like Scroll, Base, Arbitrum, Optimism, etc. The total number of assets on these blockchains increased by 7.19% to 141,586, bringing the 7-day trading volume to $1.23 billion.\n\nHowever, the Annual Percentage Rate (APR) for staked ETH decreased slightly, dropping 0.04% to 2.96%.\n\nNode decentralization\n\nLido is enhancing decentralization efforts by launching a Community Staking Module (CSM) to promote more decentralized Ethereum node operations.\n\nAccording to official documentation, CSM will integrate a diverse range of Node Operators, including Solo stakers, into the network. The module will also allow permissionless entry for node operators. It added:\n\n“The ultimate goal for this module is to allow for permissionless entry to the Lido on Ethereum Node Operator set and enfranchise solo-staker participation in the protocol, increasing the total number of independent Node Operators in the overall Ethereum network.”\n\nThis move would mark a clear departure from its previous approach, which required its DAO to approve a new node operator before its addition to the platform. However, its current initiative would allow solo staking to become more attractive and accessible for interest validators by introducing “reasonably low bond for Node Operators” and requiring “no secondary token collateral.”\n\nThe module is in early adoption mode on the Holesky testnet and is expected to transition to a permissionless state on July 11, 2024.\n\nMentioned in this article"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE5pM0NEc1VrQ2RpX3dHd1FldHc1enJKampPTXZDYVUwX2ROQlMyTjktOHVKZm91MEVMZG9hWG4xQUthR3JhX2pzVEtwcE52eDRjQ29TLWk1QmJnQ0dOVmdGMEJUMnVXYkVoakcxR19OWW3SAXZBVV95cUxQQXJaZXU2RFRfeE4zX3YyRkVDQ192dmNlNzFyczNCbDR2N0tYRVBfOHBlUWFvTVQ4QnRST195VXl3TjA0ck8zb3RpRHhzeWpvekhxZkRBZTZSSWtpb3VNT0JRTlE3Y2NqVjFRQzdYd0xtRjVZZ1ZR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jul 2024 07:00:00 GMT",
        "title": "3 Reasons Why $3,365 Is Critical for Ethereum (ETH) - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nEthereum is hanging on the edge at $3,365, as this price level is actually far more important than you might think. The asset has clearly gained serious ground for a reversal after breaking above the 100 EMA, but right now, ETH is in some trouble and may reach $3,000 quite soon.\n\nAdvertisement\n\nEthereum has historically held up at this critical support level, which is located roughly where the $3,365 level is. If Ether were to fall below this mark, it would indicate that this support is no longer there and will probably descend to $3,000. This is the next significant psychological level. The 100 EMA frequently serves as a reliable gauge of the general trend, and a break below it may trigger a large sell-off.\n\nThe 200 EMA is the only significant support level between the 100 EMA and the 200 EMA in terms of technical support aside from the 200 EMA, which is located much further below. Ethereum may see a swift decline to the 200 EMA level, or roughly $3,000 in case of a breakdown.\n\nAdvertisement\n\nNot only has Ethereum broken above the 100 EMA, but it has also broken below the consolidation channel it has been trading in for the last few weeks. This channel has given traders some predictability by providing a range in which ETH has moved. A break below $3,365 would mean that the market is leaving this channel to the downside, suggesting that the trend may be turning from bullish to bearish and potentially causing more losses.\n\nThe 100 EMA serves as a key support level, and a break below it might cause ETH to move rapidly toward $3,000 because there would be no other support level. Furthermore, a breach below this level would indicate a break out of the current consolidation channel and could indicate a reversal of the bearish trend."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE1WeDB6MHItRUhtSGU3RzdsbFlmamFaeE5NazEzandpUkNzSWJ6aFVtRWZoUXpYaU10NFgwMG1DS1YzU3ppVVNMb1NNZldIZlRsa0JaWElZZGNYNDdySHhHU01iRmJuUTh0SmxWMm5RYWw5cnRaTFlIelpR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Name Service (ENS) Sees Remarkable Growth, Eyes $120 Target - TronWeekly",
        "content": "Much attention has been focused on Ethereum Name Service (ENS) in recent days. Ethereum Name Service increased by 41% over the past week, signalling a solid uptrend with further upside potential. In a broader sense, ENS headed up nearly 14% over the past 30 days, testifying to this token’s sheer resilience and growth potential.\n\nThis impressive surge can be attributed mainly to Bitcoin’s price rebound. The upward momentum that Bitcoin’s rise created for altcoins has given them room for losses to recover and set their eyes on new highs. With the lead set by this top cryptocurrency, Ethereum Name Service and other altcoins follow through in a continuum, further benefiting from renewed investor confidence.\n\nCurrently, Ethereum Name Service stands at $31.90, with a trading volume of $1.17 billion within the last 24 hours and a market capitalization of $1.00 billion. In the past 24 hours, Ethereum Name Service has added 10.54% to its value, additional backing for what is already an extraordinary cryptocurrency market player.\n\nEthereum Name Service (ENS) Sees Remarkable Growth, Eyes $120 Target 4\n\nAnalyst Sees Potential for $120 for Ethereum Name Service (ENS)\n\nCrypto analyst Matthew Hyland believes in an optimistic price trajectory for the Ethereum Name Service (ENS). As per Hyland, if it breaks out from its current levels, Ethereum Name Service will reach as high as $120. Hyland’s bullish prediction came from ENS’s recent performance.\n\nThe analyst mentioned that he had recommended this to his Patreon subscribers when it was $17.50, exactly on the night of the ETH ETF approval a few weeks ago. Unaffectedly, with ENS currently trading at around $30 and showing every sign of attempting a breakout, this recommendation has paid off.\n\nHyland’s insights and predictions give further weight to the growing confidence placed by the crypto community in ENS. His price target of $120 foreshadows a substantial upside potential from current levels, so it has emerged as one of the cryptocurrencies investors will watch over the next few months.\n\nAs ENS values surge, many opportunities emerge within the crypto market, gaining optimism from well-esteemed analysts like Hyland. The eyes of investors and enthusiasts are fastened on Ethereum Name Service, hoping for more significant gains as the market evolves.\n\nRelated Reading | Ethereum Set for Explosive 30% Surge as ETF Approval Nears, Says Analysts"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxNbDlVeXNoM0p1WldOSV9yc3Y0aDhnUDRaUFVNOFZaNnV5TFBUYTlkYzlmTzZyUEl5SnVKN3NLZzg4d3ZTZXdRNVYzZ081UDcxRE1HbV91TDlIUXRzcnBnSGpsdDFNdGM2RDdOdmFaTDlRZGZndDhUcFZNVmNxVjdzNUlMczFUN2E0UzdNQTNJSUtOUFhLVEpNaWJBQl9ZeUZtZjFxZQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jul 2024 07:00:00 GMT",
        "title": "Galaxy expects spot Ethereum ETF in July, is optimistic about more crypto ETFs - CryptoSlate",
        "content": "Galaxy Digital head of asset management Steve Kurz said the SEC could approve a spot Ethereum ETF before the end of July and described prospects for other crypto ETFs.\n\nOn July 2, Kurz told Bloomberg that he expects approvals in “weeks, not days” and within the month.\n\nKurz said Galaxy has worked with the SEC on applications for months and noted the firm’s upcoming spot Ethereum ETF is similar to its existing spot Bitcoin ETF (BTCO). Galaxy created both funds in partnership with the investment management firm Invesco.\n\nKurz said:\n\n“We know the plumbing, we know the process… The SEC is engaged.”\n\nPossibility of more crypto ETFs\n\nKurz also expressed optimism about approvals for other spot crypto ETFs beyond Ethereum. He said that legislation, including laws defining securities, is necessary and that he believes the process will occur even if Joe Biden remains president.\n\nKurz cited Bitcoin ETF performance as a sign of demand, stating:\n\n“People want this. Retail wants this, investors want this.”\n\nTwo firms recently proposed ETFs for Solana (SOL). Kurz said that although Galaxy has high exposure to Solana and is the blockchain’s largest validator, broad legislation permitting new crypto ETFs is more important than an ETF focused on any single crypto.\n\nHe also believes that a Solana CME futures market is a prerequisite for a Solana spot ETF. No SOL futures market currently exists.\n\nPredictions in line with Balchunas\n\nGalaxy’s expectations are in line with the latest predictions from Bloomberg ETF analyst Eric Balchunas, who expects spot Ethereum ETFs to launch shortly after July 8.\n\nBalchunas said the SEC has asked spot Ethereum ETF issuers to amend their S-1 registration forms by July 8. The agency may seek further amendments.\n\nBalchunas previously predicted the funds would launch by July 2.\n\nOn May 23, the SEC approved 19-b4 rule changes that allow exchanges to list and trade each fund. However, those approvals did not permit asset managers to issue funds.\n\nAsset managers now await approval of their S-1 and S-3 registration funds, which will finally allow them to launch their Ethereum ETFs for trading.\n\nMentioned in this article"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPUlp6Sk1wU1J2dVhSb3pzZXgyM3RaelpSRTBFdjQ5c29BZmJJQk13RzhSNkxkbU1MdjVKOVdFNlg5VEtlc0hWck16ZTJiTTZPcXp1Qk5IdTFkVm9MdXlyWUdQN1FSOHVIT1VqUkdMc2w3NFUzTURxdHg5OUluYkdaM0R4RmVnWjg0N2hlbkJ3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jul 2024 07:00:00 GMT",
        "title": "Will Ethereum Price Surge in 2024? What Traders Should Know - CoinGape",
        "content": "As 2024 progresses and the cryptocurrency market keeps evolving, Ethereum (ETH), the second-largest cryptocurrency by market capitalization, stands as a strong contender, garnering the attention of both investors and traders. With various developments in the pipeline, and a volatile market to deal with, there are speculations about ETH price will surge this year. This article delves into the key factors that could influence Ethereum price in 2024 and what traders should keep an eye on.\n\nRecent Market Performance of Ethereum Price\n\nadvertisement\n\nAccording to CoinMarketCap data, Ethereum price has experienced challenges in the market, having declined by 2.8% in the past day to trade today at $3,357.89. The past month was not friendly either, with the token recorded losses of about 12.17%. With a market cap of $403.6 billion, and a trading volume of $10.8 billion, ETH remains a strong contender among cryptocurrencies. Although the coin achieved its all-time high milestone of $4,891.70 on November 16, 2021, it has since dropped in price by 31.32%.\n\nKey Factors Influencing Ethereum’s Price in 2024\n\n1. Ethereum Upgrades and Developments\n\nIn 2024, the Ethereum network will experience several major enhancements. The ongoing “Sharding” is designed to improve the network’s scalability even more.\n\nSharding will enable Ethereum to handle numerous transactions at once, easing congestion and decreasing gas fees. Anticipated enhancements in technology are likely to draw in additional developers and users to the platform, potentially increasing the need for ETH\n\n2. Institutional Adoption\n\nInterest from institutions in Ethereum is increasing. Many big financial institutions are starting to incorporate Ethereum in their activities, whether through investing directly, using DeFi apps, or creating products based on Ethereum.\n\nIn 2024, the anticipated introduction of Ethereum ETFs could potentially unlock the doors for a surge of institutional funds. These advancements are expected to increase investor trust and encourage interest in ETH.\n\n3. Decentralized Finance (DeFi) Expansion\n\nEthereum has been behind the growth of the DeFi ecosystem. The sector has seen an increasing number of assets on Ethereum. Decentralized exchanges (DEXs), lending platforms and yield farming are innovations on DeFI continuing to gain traction.\n\nAs the ecosystem expands, the demand and utility for ETH are likely to increase, positively impacting its price.\n\n4. Non-Fungible Tokens (NFTs) and Metaverse\n\nEthereum is also making big advancements in the metaverse and NFT areas. The popularity of virtual real estate, collectibles and digital arts is driving demand for ETH, especially since most NFTs are created on the Ethereum blockchain.\n\nMost NFTs are minted on the Ethereum blockchain. As the concept of metaverse develops, the role of Ethereum in fueling these virtual worlds could result in higher adoption, leading to increase in ETH price.\n\n5. Regulatory Environment\n\nThe regulatory environment for cryptocurrencies still has both positive and negative aspects. Although clear regulations can support growth, overly strict policies may hinder innovation and discourage investment.\n\nTraders need to monitor regulatory changes worldwide, as they could affect the price of Ethereum. Favorable ETF approvals or supportive blockchain policies could trigger price surges as positive regulatory updates.\n\nTechnical Analysis and Market Sentiment\n\nThe Ethereum (ETH) technical analysis shows a complex situation with indicators like EMA, MACD, RSI, and Fibonacci levels. EMA signals ‘Sell’, hinting at a bearish trend, with potential support at $3,090.3.\n\nMACD at -47.4 suggests selling due to bearish momentum, while RSI at 41.2 is neutral but near oversold levels. Fibonacci levels indicate support at $3,266.8 and resistance at $3,767.7, offering insights on potential price movements.\n\nFalling below $3,266.8 could lead to further drops, while surpassing $3,767.7 might indicate bullish momentum.\n\nWhat Traders Should Know\n\n1. Stay Informed: Staying updated about Ethereum’s technical upgrades and their schedules is essential. Effective execution of these improvements could signify a significant uptrend.\n\n2. Monitor Institutional Movements: Pay attention to updates from large financial institutions about their participation in Ether. Higher adoption by institutions can result in noticeable price gains.\n\n3. Follow DeFi and NFT Trends: The rise of DeFi and NFTs within the Ethereum ecosystem shows the high demand and usefulness of ETH. Monitoring these industries can offer understanding of potential price fluctuations.\n\n4. Regulatory News: Keep informed about regulatory changes happening across the world. Favorable regulatory updates may result in optimistic market outlook, while unfavorable news can elicit the opposite reaction.\n\n5. Technical Analysis: Make use of technical indicators for insight into market trends and possible entry and exit points. This can assist in forming informed decisions when trading\n\nConclusion\n\nthereum faces a critical juncture in 2024, driven by tech advancements, institutional attention, and the evolving DeFi and NFT sectors. Despite current bearish trends, the long-term outlook is optimistic with the upcoming upgrades and potential ETF greenlights. Traders must stay alert to market shifts and regulations to seize Ethereum’s anticipated growth in 2024 through informed decision-making and technical analysis."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxOY1Zpa1lSWDZRX0p4VUR2SzdYVnp2ZDJTb2dWX0FkRmh4YXN3U251VlpDc1pFcUtXODdleTE1Z29vVkY5a3dpSVRuMEtqV0pYQjJVSjVKZjRtb2RxdE1vTEc5Y2owV0ZJdkpydGM5d2xQWTNWQWtoYjlLSDlDanZ2NVo2Vmg4VUVIWmc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Staking: A Guide to Earning Rewards and Securing Network - Crypto Times",
        "content": "Ethereum, a major cryptocurrency, has become more eco-friendly and secure by using a new system called Proof-of-Stake (PoS). This new system lets you earn rewards for just holding onto your Ethereum (ETH) and helping to keep the network safe.\n\nThis guide explains what staking ETH is, how it works, and different ways to do it. Even if you’re new to crypto, this guide will help you understand how staking ETH can be a great way to get involved in the exciting world of Ethereum.\n\nWhat is Ethereum Staking?\n\nEthereum staking is the process of locking ETH on the Ethereum blockchain and participating in verifying transactions. This method sees users locking in their ETH as a “stake” or “deposit” as a guarantee against them verifying and validating Ethereum transactions.\n\nBy staking ETH, users qualify to become validators with granted privileges of broadcasting transactions on the blockchain, maintaining the distributed database, and securing the network. These validators are rewarded with transaction fees and a predefined yield on their staked amount.\n\nFollowing the Merge upgrade, which went live in September 2022, Ethereum was transited into using the Proof-of-Stake (PoS) consensus mechanism from the Proof-of-Work (PoW). This upgrade marked a significant milestone for ETH which changed its fundamental infrastructure.\n\nBefore the adoption of PoS consensus, Ethereum validators tended to use heavy electricity for verifying transactions just like Bitcoin. Now its electricity consumption is drastically reduced and the network efficiency is improved from the ground level.\n\nBy implementing a staking mechanism, Ethereum has also unlocked numerous economic benefits for its ever-evolving ecosystem. For instance, data from Ultrasound.money shows that the rate of increment in ETH supply has steadily decreased post the Merge upgrade and it is also helping maintaining ETH scarcity by burning significant supply regularly.\n\nBenefits of Staking ETH\n\nEthereum provides numerous benefits to users and entities who wish to participate in staking and securing the blockchain network. Below are some key benefits of staking on Ethereum for users:\n\n1. Passive Rewards\n\nThe primary benefit of staking ETH is getting rewarded in exchange with newly minted ETH as block rewards plus transaction fees. As a validator, users who stake ETH get to verify transactions and add them into blocks. Each of these transactions have associated gas fees which are rewarded to that particular validator who verifies it and adds it to the blockchain network.\n\n2. Network Effects\n\nStaking is a crucial element for PoS blockchain networks like Ethereum as it makes it secure and decentralized. As stakers are responsible for verifying and validating transactions, it is necessary for them to function in a fair and transparent manner so that the security of the blockchain network is preserved.\n\n3. Sustainability\n\nThe amount of staked ETH is periodically locked in the system so that its economical value remains sustained until it is unstaked. This brings prolific sustainability and empowers value creation within the blockchain ecosystem. Locking of ETH also contributes to narrowing the selling pressure in live markets.\n\nHow to Stake ETH\n\nThere are different ways to stake ETH and harness its benefits. All these staking methods are separate from one another on the basis of technicality, reward bars, and ease of implementation.\n\nLet’s understand it all in detail;\n\nSolo Staking\n\nThe method of Solo Staking involves setting up a node on Ethereum with a manual process. It is also known as native staking where stakers directly interact with the Ethereum network. The solo stakers will participate in securing the network all by themselves with their hardware devices to verify and validate transactions.\n\nAlthough it requires 32 ETH as a staking deposit for a node to become a validator and secure the network. Additionally, a sophisticated computer system is also essential for an Ethereum client to run, which is the software containing information on the whole blockchain. Such requirements make solo staking a hefty process and burden to people with no such experience in software engineering.\n\nHowever, this method represents the gold standard for staking on Ethereum with higher responsibilities than other methods and higher staking rewards. To run a node and become a solo staker, it’s recommended to follow the official guide from Ethereum.\n\nStaking as a Service\n\nAs the interest in ETH staking has grown rapidly, many “Staking as a Service” platforms have arrived in the past few years. These platforms allow you to stake ETH as a third-party service provider which then manages all your technical requirements including node set-up and hardware. It means that users can benefit from staking rewards without being worried about running their own validator node on Ethereum.\n\nThis method essentially enables non-technical users to participate in stalking while leaving technical aspects to someone else. All it requires is for users to generate keys and deposit 32 ETH for service providers. In exchange for their service, these staking service providers will charge minimal fees from staking rewards and send back the remaining rewards to users.\n\nStaking Pools\n\nStaking Pools allow individuals to stake a flexible amount of ETH instead of the standard 32 ETH in order to partake into staking. It enables earning staking rewards without the need for extensive technical knowledge or running their validator node. Instead of staking alone, users can send their ETH to a liquidity pool from where combined staking is initiated. Once a pool reaches to 32 ETH by collective deposits from different users, it automatically deploys a node and starts functioning as a validator.\n\nThis innovative staking method makes it possible for users to contribute any ETH amount and secure Ethereum network as a validator. Then the pool operator entity uses all the shared deposits to join the native staking on Ethereum. When staking pools receive rewards, it is distributed to participants in accordance with their initial stake.\n\nStaking on Exchanges\n\nOne of the easiest and most convenient methods of staking ETH is accessing it via centralized crypto exchanges. It involves depositing of ETH to a centralized exchange platform which offers staking facility. This is usually regarded as the safest and most handy staking process as exchanges provide guarantees to users for security as well as rewards.\n\nAlthough the exchanges require to send ETH to their wallets and giveaway asset custody which possesses risk for users. It essentially means that exchanges retain ownership of user’s assets and the risk of loss is increased. Most of the popular exchanges offer staking services to users including Binance, ByBit, Coinbase, and others.\n\nConclusion\n\nIn the ever-evolving crypto ecosystem, staking opens up exciting opportunities for users to participate in blockchain security and earn rewards. Ethereum stays at the forefront of staking with its robust position among blockchain networks. Staking ETH not only offers economic benefits but also contributes to the decentralization, security, and stability of the Ethereum network."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxOM0UyM1dzMzVRU3h1bkRuRmcweXZNX2dhVEk4aHZEYnJIYXVMaGdVVWlRcHZLaC1pdTUzV0R6Z2xXRzdFN2JBWU96MkNZc0p0emR3Ym9uQmxfdzZJSVJKeC1pWEQtZVFsVC1uLUROekdpUk9NMjVyY0VNeXEyOXNueEk5T0N2UTczR2hwV0FwT0dGQ1habW9VNtIBngFBVV95cUxOSi1yWmRZX1pZUTFPZU94bWNBSVNxeUgwbkNBLURTaVZmODZMbUhxbktfUnNJOWdXOVZuLTlzOVBHUDBzMFBvMFJ6bFdHd0ZUY2s5dXoza1FaOHVwR2dzLWQzdl90eEh3X0pHNUYwY0hlYS02MXZMcXpWX0R5ZktCX053QlBYTGNiZ2J5cU1lV1VVcV9qUUNCWWd1VUxSUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETF Hopes High for Mid-July Launch, Despite 3% ETH Price Dip - CryptoPotato",
        "content": "Asset managers are optimistic about Security and Exchange Commission approval for the first U.S. ETFs directly investing in Ethereum, possibly by mid-July.\n\nThe SEC has given ETF applicants until July 8 to submit updated paperwork and amended S-1s, with potential additional rounds of filings.\n\nThere may be an additional round of filings after the one due on July 8, reported Bloomberg citing people familiar with the matter.\n\nWen spot eth ETF? BBG sticking w/ mid-July. Amended S-1s due July 8th. Potential final S-1s by July 12th. Would theoretically mean launch week of July 15th. via @emily_graffeo @olgakharif pic.twitter.com/NG8xhtCP21 — Nate Geraci (@NateGeraci) July 3, 2024\n\nEthereum ETF Hopefuls\n\nRecent SEC feedback to issuers involved minor questions, which are being addressed, the report added.\n\nHead of asset management at Galaxy Digital, Steve Kurz, told Bloomberg that an Ether ETF could potentially be approved within the next couple of weeks.\n\n“This is window-dressing, the SEC is engaged. We’ve been doing this for months now. We did it for the Bitcoin ETF, the products are substantially similar – we know the plumbing, we know the process.”\n\nMajor asset managers such as BlackRock, Fidelity, Ark 21Shares, and Invesco have pending filings, but many issuers have yet to disclose their fund fees, which is a necessary step before trading begins.\n\nIt is also unclear if Ethereum ETFs will generate demand similar to spot Bitcoin ETFs, which have amassed $52 billion in assets since they launched in January.\n\nAnalysts have estimated that the Ethereum ETF flows could be around 10% to 15% of Bitcoin ETF flows and that ETH prices may fall as much as 30% following their launch.\n\nHowever, crypto research firm K33 Research expects Ethereum to outperform Bitcoin in July.\n\n“ETFs are a solid catalyst for relative ETH strength as the summer progresses and flows accumulate, and I firmly view current ETH/BTC prices as a bargain for the patient trader,” wrote K33 senior analyst Vetle Lunde in a July 2 report.\n\nBitcoin is facing potential selling pressure from a forthcoming distribution of almost $9 billion worth of BTC related to the defunct Mt. Gox exchange.\n\nETH Price Declines\n\nEthereum prices are not showing any positive momentum today. The asset fell 3% to an intraday low of $3,342 during Asian trading on Wednesday.\n\nETH topped $3,500 in a ten-day high earlier this week but shadowed its big brother as crypto markets failed to break resistance and retreated once again.\n\nEthereum is currently 17% down from its 2024 peak of just over $4,000 and 31% down from its November 2021 all-time high."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMikwJBVV95cUxQN29WODA1M0lfSXNzaGVCUUZYS2tzY2NxbDROdTFmOUtoN2loUWNmYXlrSGR1d3hIUXREbkcwVlYyd2dPTWlFS3FpRHZoMkRDN1dZc2pyUUJJOE90T2xKLXVwVWtqdURXOXd1WW9VdUJwblZNbzhwZGthcXAycmQ3blhxZmxjM0NGS0ZZYTJsdFZ0Y21tenJWa05KZThCNlVRZXM4MXVPcnVDM21aWnBOY2VtUFlGMWJWZU9tc045d0pjY2NnWGhUS2hiNnVXdGlLbnZJOXdHSHhtVndWRnJNLTZjbHdBWDVkYTVxSWs4UTFiUmVjUjh5ajBLZXRJVUR0Ni1qZmFKWFZYUE5jd1pNbHcxZ9IBmAJBVV95cUxNMkEzcXgwOFJYb0ZZODFmbzRIVUhpN3hFYWhSTURIUHpWTGxOajlWNktaX0dyUllsU2htbWUzOEw2NzhmX0RlYVlWNndEMTNNRmJCTmMwVE5QNXhyNnpFMzRDYThCYTYwY3FnWnd4QjhwUFQtOWwtM0Ryc1NLZXh6RmtabmNIQzlSeU5OS0tRWUMxRTVTdVFyNFdkdkV1VFdDcDJ6VWZVMmFLbE1KWURCTWh0Qm50VVA4V3NCYzZqNG9Qd1FSYnBkNUs4bTczaVZpZlZTUmVUNE1Pa180c2UxT0dzWEVNNWNlNlY0djdwYl9TbWpMWEY4TnpSckJRMl9SVXpDMk1vTjdwNVJFTENSMnk1a2xRQV8y?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jul 2024 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin, Ethereum fall up to 3% on Fed’s hawkish tone; Solana, Cardano defy trends wit - The Economic Times",
        "content": "ETMarkets.com\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nWhile Bitcoin’s (BTC) resilience over the last one hour was palpable, this crypto asset is still trading down nearly 3% from the previous session. Around 12 pm today, it was trading at $61,035.66. The slide in BTC had an impact on other altcoins including Ethereum (ETH), Tether, Dogecoin , Avalanche, and Shiba Inu which were down by up to 2.5%.Altcoins that were trading in the green around this time included Solana, XRP , Toncoin, Cardano, and Tron which gained up to 2%.The crypto market's lackluster trade could be attributed to the remarks by US Federal Reserve Chair Jerome Powell's hawkish statement which said that the Central Bank needs more evidence on inflation to decide on the timing of the rate cuts. Moreover, the May jobs data was reported higher-than-expected.Bitcoin's decline reflects both concerns and opportunities in the crypto market, Sathvik Vishwanath, Co-Founder & CEO at Unocoin said as he highlighted strong trading volume of $20 billion over the past day, indicating significant market activity. \"The news suggests that large holders of Bitcoin, known as whales, are piling up, indicating confidence in a potential year-end rally,\" he said.Vishwanath said that BTC is currently finding support within an ascending channel of around $61,700 though it faces resistance at the 50-day EMA at $62,210, suggesting a limited immediate upside. \"With the RSI at 48, indicating neutral sentiment, the market is depending on Bitcoin's ability to hold above $61,700 to avoid a deeper decline to the $60,700 and $60,000 support levels,\" he added.Source: CoinMarketCapOn the BTC price movement, CoinDCX Research Team in a note said that the current drop filled most of the weekend BTC CME gap, though another gap remains around $59,700-$59,800 which suggests that BTC could drop further to fill it.Currently, Solana is outperforming BTC and ETH due to ETF hype, the note said, adding that the market is slightly negative due to bearishness in BTC.\"Bitcoin has been consolidating around $61,000 for the past 24 hours, following some profit-taking by traders. It's having a hard time breaking past the $63,600 resistance level. If it doesn't manage to hold its current position, Bitcoin might drop back to the $60,800 support level, with bulls trying to keep it above that mark,\" Edul Patel, CEO of Mudrex warned.He pins his hopes on approval to Ether ETFs which he said could improve the market sentiments.Also Read: Gold’s 13% uptick beats Nifty's H1CY24 gains. Who could hold the edge in second half? (Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxOMnYzTzN4QkdWODFJUDItaGNaMkFYMTFkdTBTam40SXZMRUJqZlI0WWpUam00MGEtXzZIcWRiM09rU2ZNYzBpc3EteVpUNmk5VDJMRWVOblRuOExRUkxySW5KU3NsNzJMUDFXQTRnSndlVVZLSU1Nb21EZjFJUTdrZFc2SGlMMmwyMlNRNXpPMTdneHVFdWtNT2M2X2JHNnBBLTRTVlMzbExWTGpfTlVtVDBYSHo4Z9IBuwFBVV95cUxQcWpoMEdpd2xfay1HN0hUNWtKblNSQ2ZmNTRLOXVnQ3NscE84U0d0TmRBSE5vSmxHbXBwMXcwV1F0czRpcDk1UGN1SUJyU3djLTNZWXR6dmlsRktQVzNxdU5YZDAyYzJTakhFRFJMQzh4NkNGa3JUWk1VYUtsUGZDbExtcGtoNDNyT0Rmbk5ENUpObWF6cFA4MGxmVElKd1FsOFdZeHNxMW9TY1pwYWllbFBWai1FbHlfRnVF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jul 2024 07:00:00 GMT",
        "title": "ETH/BTC Price Prediction: ETF Hype, FOMO and Ethereum Price Imminent Rally To $5,000 - CoinGape",
        "content": "The Ethereum price turnaround is proving to be a huge game changer for altcoins like Solana (SOL), Dogecoin (DOGE), and XRP. Following the SEC’s approval of Ether ETFs, investors seem optimistic that the trend will continue with these altcoins and subsequently trigger a major rally in crypto prices.\n\nMeanwhile, the ETH/BTC pair hovered at a 0.054 ratio during the US session on Monday. It seemed ready for a larger breakout but only if Ethereum gained more strength against Bitcoin, thus breaking above the resistance at 0.055.\n\nadvertisement\n\nDespite the rebound to $3,445, the technical outlook may not be convincing enough especially with resistance foreseen at $3,500, $3,600, and $3,800. Key fundamentals like the decentralized finance (DeFi) Total Value Locked (TVL), and the crypto fear and greed index reinforce the bearish grip on ETH.\n\nThe immediate support at between $3,200 and $3,300 must hold this week to prevent further losses to $3,000, considering it may be too early to rule out an extended drop to the next key level at $2,800.\n\nETH/BTC Price Prediction: Is Ethereum Price Gearing Up For 25% Breakout\n\nEthereum has in the last few weeks drastically gained against the largest cryptocurrency such that the ETH/BTC trading pair tested the inverse head and shoulder (H&S) pattern’s neckline resistance twice.\n\nEther bulls seem ready to continue with the uptrend above 0.055—in a move that could ignite a 25% rally to 0.069. An inverse H&S pattern is bullish and often signals the end of a downtrend and the beginning of a sustainable uptrend.\n\nNevertheless, the pattern remains unvalidated until the price breaches the neckline resistance. In the ETH/BTC pair’s case, this is the seller congestion at 0.055.\n\nThe Exponential Moving Averages (EMAs) add credence to the likely breakout, with the 20-day EMA holding as the immediate support at 0.05461. A golden cross on the same daily chart lingers as the 50-day EMA in red crosses above the 200-day EMA in purple.\n\nOn top of the golden cross, the Relative Strength Index (RSI) shows a lot of potential for the trading pair, holding above the midline at 50. Should the RSI close the gap to the overbought region at 70, the path of least resistance will remain upwards, further accentuating the breakout to 0.069.\n\nWhat To Watch Out For In Ether Price This Week\n\nA breakout is also looming in Ethereum price based on the technical structure backed by a soon-to-be-sent buy signal from the Moving Average Convergence Divergence (MACD) on the daily chart.\n\nDespite the encouraging bullish outlook, ETH price holds between a rock and a hard place, with support provided by the 0.5% Fibonacci ratio and a confluence resistance established at $3,467 by the 20-day EMA and the 50-day EMA.\n\nIf the hurdle caves in, traders would push the bullish case, targeting a breakout to $4,000 this week. However, such a move will not happen in a vacuum, considering the two resistance levels at $3,600 and $3,800.\n\nWith the approval of Ethereum ETFs imminent in July, market sentiment is expected to improve exponentially and this might catalyze the rally above $4,000. The CoinGape Ethereum price prediction shows a vivid map for ETH’s recovery to the previous all-time high. It is possible Ether could debut above $5,000 reaching a new record high.\n\nFrequently Asked Questions (FAQs) 1. Has Ethereum price bottomed? Ethereum price has likely bottomed with support at $3,200. However, the following weeks will determine the direction the coin takes. 2. Has the Ethereum bull run ended? The technical structure shows that Ethereum still has room for growth. With spot ETH ETF approval imminent, there’s a high chance the bull run has not started. 3. What is a spot ETF? This is an investment product that tracks the real-time price of assets like Bitcoin and Ethereum. It allows investors to seek exposure to digital assets without buying physical coins on crypto exchanges. ETFs are purchased directly on stock exchanges.\n\nRelated Articles\n\nJohn Isige John is a seasoned crypto expert, renowned for his in-depth analysis and accurate price predictions in the digital asset market. As the Price Prediction Editor for Market Content at CoinGape Media, he is dedicated to delivering valuable insights on price trends and market forecasts. With his extensive experience in the crypto sphere, John has honed his skills in understanding on-chain data analytics, Non-Fungible Tokens (NFTs), Decentralized Finance (DeFi), Centralized Finance (CeFi), and the dynamic metaverse landscape. Through his steadfast reporting, John keeps his audience informed and equipped to navigate the ever-changing crypto market.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxPekdpNHRuMllkdi1LM0hUb2pjX3F2QVY4VDBvenlMeDVYeGFtZm85TDUzdmpjYkpSREVkRHF5UUxhaV95Umt1N1VSWE9tZW1EUkV2MmdIMmtJM21OSTNGeVlsZ09ZZjZZS0YyUDVtZFZSeVQ3Ni1qU0NlWmt2NG5KV0k0VEwxd3AwTVlOQ1FDQ0RnTXFRUmplRWJwQlRpNmpyZVFYOWRTSQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jul 2024 07:00:00 GMT",
        "title": "Hops on the Blockchain: How Ethereum Is Revolutionizing the Beer Industry - Washington Beer Blog",
        "content": "Image from pexels.com.\n\nFor many years, beer has been something that helps people relax and enjoy social events. It is also a sign of celebration and an important part of different cultures. However, how beer goes from the farm to your glass can be quite mysterious.\n\nMany people who love their favorite beers do not know much about where these drinks come from, how the ingredients are sourced, or what kind of effect making them has on the environment. This lack of clear information is becoming more and more worrisome for buyers, especially because craft beer is getting very popular nowadays.\n\nNow, let’s talk about Ethereum. It is the second-biggest blockchain platform globally and it can’t be said for sure what will the Ethereum price prediction tomorrow will be. But one thing we know is that its ability to change the beer industry cannot be ignored. This new technology has great potential for changing how we keep records of beer, comprehend its history and relate with those who make it – all in a way that could greatly benefit this thriving sector.\n\nTransparency From Grain to Glass\n\nImagine picking up your favorite IPA and raising a glass, knowing exactly where every hop in that brew was grown – right down to the specific farm, their green methods and even when they were harvested. With Ethereum blockchain technology, this is possible now. Brewers can use this technology to note each step in making beer, starting from getting raw materials like hops and barley all the way to putting the finished beer into bottles.\n\nThis information is then kept safe on a digital ledger that nobody can alter, and anyone can see. People who buy the beer use simple apps to check this data, making sure where their beer came from and how good it is. This openness builds trust between brewers and customers, allowing the customers to make smart buying choices that match their values.\n\nA Toast to Ethical Sourcing and Sustainability\n\nMany consumers now want to support businesses that are ethical and have sustainable practices. Blockchain can be very useful for making sure there is transparency in these aspects. Breweries dedicated to using organic ingredients can place this data on the blockchain, giving consumers verifiable evidence.\n\nAdditionally, this technology has the ability to track the carbon footprint of beer throughout the whole supply chain. This helps breweries find places where they can do better and do less harm to the environment. Picture a world where lovers of craft beer can pick their favorite drink, knowing it was made with little harm to the environment – making both their taste buds and the planet happy.\n\nStreamlining Distribution: Smart Contracts for a Smoother Brew\n\nIn the beer distribution world, there is a complicated web of breweries, distributors and retailers. These parties often face inefficiencies such as errors in orders or invoices due to miscommunication between them.\n\nEthereum’s smart contracts can solve this issue by automating tasks like ordering from the brewery, creating an invoice for the distributor and making payment – all executed without any need for human intervention. This not only cuts down on administrative expenses but also gets rid of mistakes and hold-ups linked to conventional ways.\n\nConsider a situation in which a distributor automatically places an order for more of a well-liked IPA from a brewery whenever the inventory levels decrease, all because of a smart contract. This method greatly enhances efficiency for each participant involved – starting with the brewer up to the distributor and eventually ending at the consumer who receives their preferred beer more swiftly.\n\nCraft Beer Goes Global\n\nFor craft breweries, the main problem they encounter in exporting their beers is the complicated regulations and huge amount of paperwork. Blockchain technology could help with this by creating an easy-to-use system for international trade that guarantees safety and prevents any changes to documents or transactions.\n\nFor small breweries, this might be a game-changer. They can make use of it to enter new markets and distribute their special brews all over the world. Picture a dedicated craft brewer in Seattle smoothly exporting their IPA that won awards to a beer festival in Europe, with blockchain dealing with all required paperwork without any issues.\n\nBig Beer Embraces Blockchain\n\nThe craft beer market is perfect for blockchain, yet big players are also becoming interested. In 2018, it was said that Anheuser-Busch InBev – the biggest brewer globally – utilized Ethereum to monitor advertising details about its Budweiser brand. This shows how blockchain can be beneficial even for the largest businesses in this industry.\n\n“We’re building a company to last for the next 100 plus years and that can only be done by disrupting existing paradigms through innovation and putting consumers at the heart of everything we do,” said Lucas Herscovici, AB InBev’s Global Marketing Vice President of Consumer Connections, Insights and Innovation.\n\n“When we started digging into the potential of blockchain, we began to realize that if Kiip was started today, it would be built on blockchain technology,” said Brian Wong, founder and CEO of Kiip, a leading ad tech and data platform powering mobile advertising. “Blockchain’s magical impact comes in the form of its immutable and decentralized ledger technology. Data that is stored uniquely in thousands of servers can never be manipulated. We saw this technology’s potential to impact several major areas of the advertising world, including supply-chain transparency, campaign data reconciliation and viewability verification. Single Ledger, quite frankly, is just the beginning for us.”\n\nMore recently, Budweiser’s move to purchase the domain name “Beer.eth” for 30 ETH (around $81,000 at the time) and an NFT art piece for 8 ETH (around $21,000) further highlights the growing interest in blockchain within the beer industry.\n\nBrewing a Brighter Future\n\nWhile blockchain technology gives exciting possibilities, there are issues to think about before it can be used everywhere. One main problem is scalability – for example, the Ethereum network sometimes gets crowded and this might make transaction processing slower.\n\nGovernments must solve complex regulatory challenges as they figure out how to fit blockchain technology into current legal systems. And also, it is very important that consumers learn about this technology. Many people still do not know much about blockchain, so brewers must find good methods to explain the advantages of this technology.\n\nA Toast to Innovation\n\nEven with these difficulties, the possible advantages of blockchain for the beer industry are clear. By making things transparent, encouraging honest sourcing and improving the distribution process, blockchain can give more power to both brewers and people who buy beer.\n\nAs technology becomes better and these problems are solved, we can see even more new uses coming up. The future of beer appears very promising, with the addition of blockchain making things clearer, smoother and more fun for all people taking part in it.\n\nImagine a future where breweries can make interactive experiences on the blockchain. This way, people can go on virtual tours of hop farms or join special beer releases with safe token ownership. The chances for fun and new ideas are really without limit.\n\nDedicated to working together, creating new ideas and learning continuously, blockchain technology can change the beer industry greatly. This will make everything more connected, eco-friendly and enjoyable for everyone involved – from the enthusiastic brewers making the beer to those who truly appreciate drinking it.\n\nSo, next time you open a chilled drink, take a short moment to think about the journey it made to be there. Maybe with blockchain technology, someday you’ll even track that path yourself—from “hops on the blockchain” to delightful sips."
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE12aXpORUxJSUxFejJTRTZubjh0QzA4Q0VmYzhQcFRYa19VQUptbHU0Q0U3YVg1MThPalo5LUUzSHlxM25Xc3NiZGdsN2FiUG5fTFM4Z0E1T19vZnlWTWR6dTdhRW9TNVA1ejE0Mks3dEI2QTd6S21fUDM4V1M5M03SAYQBQVVfeXFMTlh0ZTdSMzd3Mko2cjZxU29TMzE1WFpYNkpJMUVTZjY0Qm5IYzN0a0hLRS0zb0ZBS1o2ejdwV0xjNG9Ra3UtaFJLT0t5d0VjaG41SmFlZUltVHZQa29kVHk2MmdiaFdEX2xLSXBQem9ZM0JBSEVjd2U3ZUU3T0ZERnYwMFhR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jul 2024 07:00:00 GMT",
        "title": "Spot Ethereum ETFs Set to Launch on July 15: Will This Trigger an ETH Bull Run? - CoinGape",
        "content": "Heading into July, the primary concern within the crypto community centers around the anticipated launch date of the spot Ethereum ETF for trading. According to Nate Geraci, president of The ETF Store, Ethereum ETFs are expected to become available for trading as early as July 15th.\n\nGeraci stated that with the revised S-1 submission for Ethereum ETFs to happen in July, the final S-1 approval from the SEC could arrive around July 12. Thus, July 15, Monday, would be the most probable day to begin trading Ether ETFs.\n\nadvertisement\n\nWen spot eth ETF? BBG sticking w/ mid-July. Amended S-1s due July 8th. Potential final S-1s by July 12th. Would theoretically mean launch week of July 15th. via @emily_graffeo @olgakharif pic.twitter.com/NG8xhtCP21 — Nate Geraci (@NateGeraci) July 3, 2024\n\nIssuers to Address SEC Query On Spot Ethereum ETF\n\nLast Friday, the US SEC returned the S-1 filings to issuers to address some minor questions. Sources familiar with the matter stated that the issuers have been already working on it. As we know, in May, the SEC approved the 19b-4 filings to list the Ether ETFs on exchanges. However, they can only go live for trading after the SEC approves the S-1 submissions.\n\nSteve Kurz, head of asset management at Galaxy Digital, expected the Ether ETF approval in the next couple of weeks. Speaking to Bloomberg TV on Tuesday, July 2, Kurtz said:\n\n“This is window-dressing, the SEC is engaged. We’ve been doing this for months now. We did it for the Bitcoin ETF, the products are substantially similar — we know the plumbing, we know the process.”\n\nNow the bigger question in everyone’s mind is will the Ether ETF prove to be a strong catalyst to drive the crypto market higher?\n\nAlso Read: Why Are Ethereum Institutional Products Depleting Before ETF Launch?\n\nEthereum to Outperform Bitcoin\n\nOn Tuesday, K33 Research published a report stating that Ethereum would be outperforming Bitcoin post the ETF approval. As per K33, the launch of Ether ETfs would absorb nearly 0.75% to 1% of all ETH in circulation within the initial five months. This expectation is in line with that of Gemini which predicted $5 billion inflows within the first six months of launch. K33 senior analyst Vetle Lunde said:\n\n“ETFs are a solid catalyst for relative ETH strength as the summer progresses and flows accumulate, and I firmly view current ETH/BTC prices as a bargain for the patient trader.”\n\nThe ETH/BTC ratio steadily declined from 0.056 after the Bitcoin ETFs launched, reaching 0.046 by May 24. However, unexpected news that the SEC would soon approve Ethereum ETFs boosted the ratio back up to 0.055.\n\nAlso Read: ETH/BTC Price Prediction: ETF Hype, FOMO and Ethereum Price Imminent Rally To $5,000\n\nBhushan Akolkar Bhushan is a FinTech enthusiast with a keen understanding of financial markets. His interest in economics and finance has led him to focus on emerging Blockchain technology and cryptocurrency markets. He is committed to continuous learning and stays motivated by sharing the knowledge he acquires. In his free time, Bhushan enjoys reading thriller fiction novels and occasionally explores his culinary skills.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMi5gFBVV95cUxQSlQyRnd6UVVFRFNfT2dKbEFiSmw1QVllejI0ODBDVXlmZDdmamFoc0pNTGpQdzF1RldXRjVOY0c0bHI2WDcySXFDTU80TExja2psMTNWVEE3d2t4dDV6bFVrbU82WXVmT0d4QTc4ZFRaVUNDTFUzVzlBSEF6eUt1YU5KUFVzS3J2NVFZOXRadS04dURUdDlDR1ZlbkZhOUFwaUFPY3pyXzlqb2lZTWJhX29nRnlsblNPV3RGTVBLa2F0dW1hMEpNREpQQ09UdzJ1QVZEWnkyZlg1X3VaZ1RUVjk3UjV5d9IB6wFBVV95cUxPdnYwLUt2eENNQWhmTnNlWXNIV3NxSktOc21GNjI3eUF5LUpJZmlhSjVlamNKMklrRGtTcE10UW5ldDBjWkRuNUhUQmRPY0JYTDBYUzVtUVduYmxRZUpEVTVfUFQyMTlmUG9OZGF1bnBVN1dtQmJxWVY3Y1JUTEtNZ2FUVmtsSUhOaHhOVW1aYWJJYVNnazNCanZXdEZjeXNTeFYzZ05YNzc4WFBOUVJyUzlKSk5iVGhLY2oyZmc2bk5mYnItcVhuT0NZX00tOEg1bnA5M1dLcUExRWlleEhYY2tydVpmVnVWbzh3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jul 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) to Outperform Bitcoin (BTC) After ETF Launch, Foreseeing Strong Inflows Equaling 0.75-1% of Supply Post-ETF - Crypto News Flash",
        "content": "K33 Research says that Ethereum spot ETFs will accrue up to 1% of the Ether supply, or $4 billion, pushing ETH to outperform Bitcoin, which faces selling pressure as Mt. Gox creditors get refunded.\n\nThe firm says that ETH is trading at a steep discount against BTC but noted that Ether’s futures interest was soaring, indicating that traders are accruing the altcoin on high leverage.\n\nK33 Research says Ethereum spot ETFs will change the game for the largest altcoin, making it a better investment than Bitcoin.\n\nThe Norwegian analytics company, formerly Arcane Research, says that most investors don’t realize Ether’s vast opportunity. This is reflected in its continued suppressed price, even as the green light for the launch of the ETH ETFs edges closer.\n\nThe company believes that once the ETFs launch, they will quickly rack up around 1% of all circulating Ethereum, equating to 1.2 million ETH, or $3.86 billion. It stated:\n\nWe maintain a bullish ETH outlook in anticipation of net inflows equivalent to 0.75-1% of ETH’s circulating supply in the five months following the launch.\n\n🚀 #Ethereum (ETH) set to outshine #Bitcoin (BTC) post-ETF launch! 💹 K33 Research: 'We maintain a bullish ETH outlook in anticipation of net inflows equivalent to 0.75-1% of ETH’s circulating supply in the five months following the launch.' Get ready for a bullish ride! 📈… pic.twitter.com/SB9fTggK9M — Collin Brown (@CollinBrownXRP) July 3, 2024\n\nMarket experts have yet to come to a consensus on when the SEC will nod to the ETH ETFs. As Crypto News Flash reported, some, like ETF Store President Nate Geraci and Consensys’ Jimmy Ragosa, believe the approval will be in mid-July. Others believe it’s towards the end of the month, while a few others believe the SEC’s move to return the applications with its comments will lengthen the application process beyond July.\n\nAll analysts concur that these products will forever change Ethereum regardless of the timeline. American exchange and custodian says they will rack up $5 billion in the first six months, while K33 Research has a slightly more conservative estimate at $3.86 billion.\n\nThe firm said:\n\nETFs are a solid catalyst for relative ETH strength as the summer progresses and flows accumulate, and I firmly view current ETH/BTC prices as a bargain for the patient trader.\n\nCan ETFs Push Ethereum Beyond $5,000?\n\nBitcoin ETFs launched in mid-January, and two months later, the top coin hit its all-time high just below $74,000, dragging the entire market with it. Ethereum soared to $4000 at the time.\n\nAnalysts believe that a similar effect will take place once ETH ETFs launch. However, according to K33, ETH might “stumble immediately following the launch of the ETFs” from the “sell the news” phenomenon. However, they expect it to pick up pace immediately and, by the end of the year, hit new heights.\n\nK33 says it’s surprised that more traders aren’t accumulating ETH in anticipation of the coming surge. Year-to-date, the top altcoin has only gained 45%, around the same as BTC and lower than BNB and other lower-cap altcoins.\n\nHowever, those in the derivatives market are catching on. Data shows that ETH futures open interest has been surging “relentlessly” as more traders take on higher leverage to buy ETH in anticipation of the price rise.\n\nEthereum trades at $3,313 at press time, dipping 3.5% in the past day.\n\nRecommended for you:"
    },
    {
        "id": 75,
        "url": "https://news.google.com/rss/articles/CBMi-gFBVV95cUxNb1NfMlprNHFrc3J3TTliQ2s1YUNneF9pVm4tbl9QTUIta3VWalgyVUZWa1c2a01wRklSUHRQTUVmTHBpSXpwVmZkSWptaE1ERGxReUFvN3FGWFd5dTJBSUs5WE1lM01LUzFrSl91VU80TUtkdmVNY1ZMZ1dzcko1WklXTTNRd1dwQU4wRFJCbWZONTI2RzdrdGV3cl9LcENyeDNxTmNFb1RCRWRpZGF1UXY5M1ZJdWljT1lDZUFjTW9uSlM5dlk3Z203aWEwWHVHNkxERFg5SEhJV0FVMWJ0b2lRbDRtQWtDcXlLRzM2bXNubDd0R2pYdlBR0gGCAkFVX3lxTE4tM0wzSFplNHFOMENVWmZ2SWVOcEcyMU5DQkk5dE1zSjhER2RSLUkyanFKR2hUWnZLZlEyV0xiRUlDc3VQQzMxVjlNNUJENDJKSkdLa0MzMzZJMW5EeW5QVzRPVUcxLW5jVVY5UzE1ZHU1cS04VmRia3lOamtyMUJ1Um1KMGZxOGtNWUdHZzR2N3FfTTJGbjF5bTFNbHA3MEdHQkNoTnRqR3FGSmM3YzVRcmQ5Vkw4aUZWMVhtRk1Ga2VDaGdaMWtPNHNSd1NOZnNPUldWLURabXZfM2dwd2FpM042bng1dnNwVFFVTWw0TFZkX3JteU5KZmhiZG5TMzJEUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jul 2024 07:00:00 GMT",
        "title": "Bitcoin Sentiment Hits Lowest Level In 18 Months, Ethereum Token Rollblock Continues To Gain Momentum As Price Set To Increase Again - Crypto News Flash",
        "content": "A lot has happened in the crypto community since the last bull market. After Bitcoin had its long-awaited halving event, many altcoins saw a significant rise in value. This all-time high rippled across the industry, as institutional investors began to secure their positions. With spot ETFs now inevitable, and a lot more profit to be made, it’s no surprise that more innovative assets are sweeping the market.\n\nMeanwhile, Ethereum-based Rollblock continues to gain massive traction in the iGambling and GameFi industry. The unique online casino has shown promise with its presale activity and is certain of monumentally positive price movements. Here’s why you should invest:\n\nDespite Halving and ETF Approval, Bitcoin Craze Starts To Dwindle.\n\nBitcoin had started the year with the promise of massive gains and price appreciation. The pioneer cryptocurrency has faced recent difficulty in upping its price action as sentiments around the asset hit its lowest since the start of the new year.\n\nWith a halving event in April and the approval of spot ETFs, Bitcoin investors were certain of a radical surge northwards. Many months later, this has not been the case, as the bull market has not sustained significantly.\n\nThis has not deterred crypto investors, as transaction data shows a low selloff rate, with institutional investors holding their position. With the success of the Bitcoin spot ETF trades, many financial authorities have acknowledged Bitcoin as an institutional investment, capitalizing on the security and profitability of the asset.\n\nThe current trend is consistent with retrospective analysis of Bitcoin price movements over time. Many analysts have noted a constant dip in Bitcoin price around June, with a corresponding rebound as July rolls around. Bitcoin could yet recover from the slump, and investors are hopeful that the data rings true, as Ethereum ETF trades are set to launch in July.\n\nMeanwhile, many Bitcoin investors are looking to other viable profit options, and with Rollblock’s presale currently ongoing, a unique opportunity has presented itself.\n\nRollblock Price Climbs Even Higher As Market Demand Increases In Presale Phase\n\nNew crypto assets hardly generate the level of demand required to drive up presale prices. With the steady increase in Rollblock’s presale price, it is evident that the market is itching for this new asset. With new projects, investors primarily seek out utility, community engagement, and profit potential.\n\nRollblock has caught investors’ attention with its unique and lucrative online casino platform. This platform aims to combine traditional centralized gambling with the transparency and profitability of Blockchain technology. The result is a DeFi platform that upholds security, privacy, and profitability.\n\nInvestors in Rollblock stand to gain mouthwatering rewards and bonuses provided by the ecosystem. Users can play games and trade to earn RBLK tokens. Presale investors are at a vantage point, as weekly revenue generated by the platform is shared amongst holders. Rollblock also offers staking options, allowing users the opportunity to expand the protocol’s liquidity pool. Staking rewards reach as high as 30% APY.\n\nRollblock understands the economics of cryptocurrency and has committed to a deflationary supply system. This would reduce the amount of RBLK tokens in circulation over time. The platform aims to achieve this through its buyback program. RBLK tokens would be periodically purchased in decentralized exchanges using a share of Rollblock’s weekly profits. The purchased RBLK tokens would then be split equally between token holders and the network’s burn pool.\n\nMoreover, Rollblock is currently in the third stage of its public presale, with tokens selling out fast due to robust demand. Already, the emerging project has sold more than 50% of its stage 3 presale allocation, with RBLK tokens going for a discounted price of $0.015. With these benefits, Rollblock has defined itself as the future of online gambling, promoting user privacy, asset security, and massive profitability.\n\nConclusion\n\nBitcoin sentiment has reached its lowest level in over a year as its price struggles to make significant gains. Meanwhile, the Ethereum-based token Rollblock is experiencing strong momentum during its presale phase, with increasing demand driving its price up.\n\nThe integration of Blockchain technology is expected to significantly increase the current market valuation of the gambling industry, making Rollblock an appealing choice for investors seeking to capitalize on this profit opportunity.\n\nAs the project approaches its official launch, many crypto analysts are confident that its price will increase by more than 800%.\n\nDiscover the Exciting Opportunities of the Rollblock (RBLK) Presale Today!\n\nWebsite: https://presale.rollblock.io/\n\n\n\nSocials: https://linktr.ee/rollblockcasino"
    },
    {
        "id": 79,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxOcE1kQ0dpZG9ZVlpzU3A5MEJuaHVKclRUN2FDanlQQzdiSmFfclVpTmt3dGRUTHh0cEVVMEV2SlZpaXFfQ1NBa2txb0EtM2xqRm5yMFM0c1hfSDhTWnZLZ3Z0dC1IU0I0UUhVYnc2S2lnM3RoV3lQYkU0c1RWaVlBazZEY2pvNHRtTjc5RjJqR3pZM3lfYnfSAaMBQVVfeXFMT1kzS0VvNnFuRXBSU2RfQzlWNm5vMUZRanBUWDB5cXRnbXJlLXBVSEEyOGJaZjI4LVpmSzJ0NEUyWTJTT1IwLUswemlNMzNQeVh1cldDNVZ5STZ3c1pfMWJXWmJlVjk4MWVNR3g1bnIzcDIwVDd6MTBtLTRvOXlDME16a18yRHR3bnBtRFYtdjB3M25YQzFuVUxCWjV6aVhXd0FfTQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Price Stumbles to US$3,357; Drops 1.71% - Analytics Insight",
        "content": "Short-term Analysis\n\nIn the short term, Ethereum price movement suggests a cautious outlook. The 1.71% decrease in the last 24 hours, coupled with a bearish MACD and a nearing oversold RSI, indicates that sellers currently dominate the market. However, the approach towards the first support level at US$3,347.7 could attract buyers, potentially stabilizing the price and providing a platform for recovery.\n\nMedium-term Analysis\n\nOver the medium term, the 1.05% decline over the past week reflects ongoing bearish sentiment. The support and resistance levels will be crucial in determining the next phase of price movement. If Ethereum holds above the first support level and manages to breach the first resistance level, it could signal a shift in momentum toward a more bullish outlook.\n\nMarket Sentiment\n\nThe overall market sentiment for Ethereum remains mixed. While the current technical indicators point to a bearish trend, the approaching support levels and near-oversold RSI suggest the potential for a rebound. Traders and investors should closely monitor these key levels and technical indicators to make informed decisions."
    },
    {
        "id": 82,
        "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxOdjhjVHIxT1N0NS1YbUExaHJBd3ZEVHp1cWZyWmFYQlNFc1JnbWpNbUdOTjNHdW82TTRHR3h6WXRVTk5pblpxa1E4Y1NFSWhzSWhqbEdvNlNqaGZxR2VKbF8yUE0wVm41XzdFQjZra25GZFJhMG1fMTRrbkJ0T01lM3dTakY1MEJZbEZ4TzJGU0lHRklHWWk1U0RtemtodHpDSEFRaDBtSlhDUG9mc0xFbEw5SVZjVzFSbmtlbUJn0gHDAUFVX3lxTE5OTXRaM09McnNJSWphRl9tR1hEd2J0eEZOZktyVng0ZS1GSUphYjA0SGVhQUt6bzRSZTNjVU1jR0xVZW00Zm5hV0doTnNSb1A4V3lmZnd6SXRKd3RLRlJzN3FqWWZUaVROM2NhNXZEN2QwMjdUWU1KZzA3Z1ZjcEM1dGhKa1RmY19EMU5DOTlmc0JTeVdlbkc4OVUwLTBlMlZmeElGc0paSFJYc3VqZ1NkbFdxVTdwMmtETHJzcC00OFN3dw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Set to Eclipse Bitcoin: ETFs Could Catapult ETH to New Heights — K33 Research - NewsBTC",
        "content": "As the global financial markets prepare to launch U.S.-based spot Ethereum exchange-traded funds (ETFs), Ethereum is positioned to potentially outperform Bitcoin, according to a new analysis by K33 Research.\n\nThis comes amid concerns that Bitcoin might face downward pressure due to upcoming repayments to creditors of the defunct Mt. Gox exchange.\n\nRelated Reading\n\nETF Launch to Begin a New Era for Ethereum\n\nEthereum has lagged behind Bitcoin in performance over the last year, with the former surging 67% while the latter by 95%, but that might be about to change with the anticipated launch of Ethereum spot exchange-traded funds (ETFs) in the United States, expected in the coming weeks.\n\nAnalysts Vetle Lunde and David Zimmerman from K33 Research suggest that introducing these spot ETFs could be pivotal for Ethereum’s valuation.\n\nDespite a likely initial dip post-launch, they forecast that inflows into these funds will propel Ethereum’s price over time, drawing a parallel to the earlier impact of Bitcoin’s spot ETFs, which attracted billions of dollars in inflow after launch.\n\nThis optimism is rooted in the belief that ETFs will catalyze significant capital flows into Ethereum, mirroring the influx seen with Bitcoin.\n\nThe analysts project net inflows amounting to 0.75% to 1% of Ethereum’s circulating supply within five months post-launch, potentially setting the stage for substantial price appreciation. The analysts noted:\n\nETFs are a solid catalyst for relative ETH strength as the summer progresses and flows accumulate, and I firmly view current ETH/BTC prices as a bargain for the patient trader.\n\nWhen Will ETH Spot ETF Launch In The US?\n\nDespite the analysts’ bullish outlook, the market appears skeptical, as evidenced by Ethereum futures trading at a discount relative to Bitcoin futures, as highlighted in the K33 Research.\n\nRelated Reading\n\nExperts Eye Spot Ethereum ETF Launch By Mid-July, Predict Price Rally 2 months ago\n\nEthereum is trading at around $3,312, reflecting a 3.3% drop over the past day and conceding with the ubiquitous decline in the crypto market.\n\nIn the broader context, the crypto industry is enthusiastic about Bitcoin and Ethereum ETFs. Nate Geraci, president of The ETF Store, highlighted that amended S-1 forms for Bitcoin ETFs are due before July 8, with approvals potentially finalized by July 12, paving the way for a mid-July launch.\n\nWen spot eth ETF? BBG sticking w/ mid-July. Amended S-1s due July 8th. Potential final S-1s by July 12th. Would theoretically mean launch week of July 15th. via @emily_graffeo @olgakharif pic.twitter.com/NG8xhtCP21 — Nate Geraci (@NateGeraci) July 3, 2024\n\nConcurrently, Steve Kurz from Galaxy Digital expressed confidence in a Bloomberg interview that Ethereum ETFs would receive approval within July, underscoring the structured and familiar regulatory process drawing from experiences with Bitcoin ETF applications.\n\nFeatured image created with DALL-E, Chart from TradingView"
    },
    {
        "id": 85,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxONGNZSjF1Mm92bFJ1V2xXTXlyTHViZE81X2lTNEFSYTVJNTR4MjV6clVkaHlYeHhYVFpxbjNjR3RSV3hhT0c3YTRkQmhCeDhoMXBlRW9abGlFdkw0eTlFdWp6Y3JZZXJ0Y3FudUlCY3luc1BxSUthaFZ1QWxJQm9kV1hxbDl6cXVaS3c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jul 2024 07:00:00 GMT",
        "title": "SEC Targets Ethereum Staking Increasing Withdrawal Queues - Coinfomania",
        "content": "The Ethereum Foundation has disclosed that withdrawals of ETH staked on the beacon chain to individual execution layer accounts will be available soon. It revealed this in a blog post on December 29 to its research team and customers.\n\nThe blog update also stated that the consensus layer core specs are “nearing completion,” revealing further that client teams are implementing and testing the withdrawal functionality.\n\nSince switching from proof of work (PoW) to proof of stake (PoS) in mid-September 2022, enabling the withdrawal functionality for stakeholders has been one of the most anticipated milestones on Ethereum’s roadmap.\n\nSince its inception till date, over 15,766,262 ETH (worth over $18B) has been staked on the Beacon chain across 492,000 validators. Staking on Ethereum’s Beacon chain first went live on December 1, 2020, with investors ultimately locked in until whenever the Ethereum developer community finalized the withdrawal functionality. Even when the function goes live, Ethereum’s roadmap suggests the withdrawal will be available to users over time rather than immediately.\n\nThe most recent update from the Ethereum Foundation notably does not include a definite timeline. However, it reassures investors that the functionality is a top priority and would likely go live in 2023.\n\nEthereum continues on long-path to scalability\n\nEthereum’s migration to the PoS consensus mechanism earlier this year marked a significant step towards broader efforts to scale the network and improve security.\n\nIn a recent development, Ethereum co-founder Vitalik Buterin shared an updated roadmap on how Ethereum plans to reach mainstream-level capacity. The new roadmap notably includes a new “The Scourge” phase during which Ethereum will solve a long-known bottleneck around miner extractable value (MEV) transactions.\n\nAt full scale, Ethereum developers envision the network handling over 100,000 transactions per second at significantly lower fees. However, that path could take at least a few more years to achieve, with the staking unlocking function the most imminent on the list of objectives."
    }
]