[
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxPcHU5Ry1HZWwtOXRWUE8zVnlydjQ3bnl1b2xJd21EZUZ4bC1tYXAxSEZkR1hJSWV5YndWeVBZWEpISXZnMWw2WDNTdll4bXdTbUsyRzFzaUtISnBkdXExOVNBRUZ3eEYtT05pYkI3MkxKZmxvZ0QyYVdobUhmSS1VX1NNaTlPLU5WTEE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jul 2024 07:00:00 GMT",
        "title": "Kraken exec expects Ethereum ETF launch to ‘lift all boats’ - CryptoSlate",
        "content": "Kraken Head of Strategy Thomas Perfumo said spot Ethereum (ETH) ETFs could help the crypto sector while commenting on political developments in the US.\n\nOn July 12, Perfumo told Bloomberg that spot Ethereum ETFs would attract capital flows while attracting attention to crypto, noting:\n\n“It’s a rising tide, lifts all boat story. “\n\nPerfumo further explained that Ethereum’s eventual value “hinges on the Ethereum ETF.”\n\nHe said that the crypto market is “pricing in” $750 million to $1 billion of net inflows to Ethereum products on a monthly basis, which would imply that Ethereum could reach all-time highs between $4,000 and $5,000.\n\nPerfumo also compared expectations to Bitcoin’s all-time high in March, which he called a “quiet peak” that occurred without any evidence of millions of new investors entering the industry.\n\nPolitical developments\n\nPerfumo also commented on political developments. Early in the interview, he said US election outcomes will “set the tone for policy making and the legislative agenda for the next four years.”\n\nHe also emphasized the importance of legislative action and clarity and noted that recent developments show bipartisan support in Congress.\n\nThe House recently decided to pass the Financial Innovation and Technology for the 21st Century Act (FIT21) and attempted to repeal the SEC’s controversial accounting rules along with the Senate. However, President Joe Biden chose to veto the resolution.\n\nPerfumo said:\n\n“Even though you’ve hit barriers at the executive level, [there’s] still good progress going forward.”\n\nHe added that the Republican party appears “more pro-crypto [and] more progressive” on the matter, noting Donald Trump’s plans to attend the Bitcoin Conference in Nashville.\n\nTrump has also made numerous statements in favor of pro-crypto policy, including at recent campaign events in Wisconsin and San Francisco.\n\nMentioned in this article"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxOMldIeG5tdWg4ZVNmaTVOQjYwVEpNVWJmTTA0TjhLTGM4c3VkSmVLb3V5am9jd3ZQV212djYzNDJoaEJmR01rM2tWcmdYZmZWM2hHWlpHU05RaXhub0JCLXpkNUNRdlBTR2E4TTdObUZOaFZyMnBCbjU0dldzQmpnc2g0eHdzZmdZQThsOElqTGw4UU5DeGI4VVM2UU9SNTB4a0QwZU4yb9IBrAFBVV95cUxNYUFreE91V0hMaEVSTE83WkRJeERaejZuTEhIYWtBcjN3ekswd1dINUszcnp6a0FLTDZ5QTA5WDFwT05Eb0pCQ2YzTUtHWUFzSkxOTXJWTGpzNUVicFNMWGw3LW1CNGpzdmJXdUZhRjF3c2NqeXhGZWVoeFY0a0ViUktpZm9LLXZSSDBiTjRON2RWS0pzWHJZbWNjaGpZcWFMVlJUNzFjeDBVWTl6?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis: Is ETH on the Verge of a Deeper Correction Toward $2.7K? - CryptoPotato",
        "content": "Ethereum’s price has been dropping recently, following a second rejection from the $4,000 resistance level, and it has yet to recover.\n\nTechnical Analysis\n\nBy TradingRage\n\nThe Daily Chart\n\nOn the daily chart, the price has been making lower highs and lows since failing to break the $4,000 level to the upside a while ago. The market has also broken below the 200-day moving average, around the $3,100 mark.\n\nThe price is currently retesting the 200-day moving average but is seemingly getting rejected to the downside. As things currently stand, the cryptocurrency seems likely to drop toward the $2,700 support level in the short term.\n\nThe 4-Hour Chart\n\nThe 4-hour chart demonstrates a zoomed-in view of the recent price action. As evident, the downtrend has recently been aggravated to the downside, with the market briefly breaking below the $3,000 support level.\n\nYet, following an oversold signal by the RSI, the price has recovered above the mentioned support zone. However, the price seemingly lacks the momentum to continue higher and might be on the verge of a deeper decline toward the $2,700 area.\n\nOn-Chain Analysis\n\nBy TradingRage\n\nEthereum Exchange Reserve\n\nDuring the Ethereum downtrend in the last few weeks, many analysts have been looking for signs of capitulation that point to a potential bottom. Some signals are becoming evident.\n\nThis chart displays the Ethereum Exchange Reserve metric, which measures the amount of ETH held in exchange wallets. An increase shows potential selling pressure, while a decline indicates a decrease in supply.\n\nFollowing the recent brief decline below the $3,000 level, the exchange reserve metric has experienced an increase above its 30-day moving average. This might indicate the beginning of the capitulation phase, as many investors’ stop losses were below the $3,000 level."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxPcXhGUWZudF9RWWJpVE1xWnVic0Z4NHlBS3lKUEJXc0hhZHZSUExTalBvU2FQTEp0SUl1RWplZUR1Z2lVZFA3VkxENHpQN182RWtCakpYNzFvSE1hRnFLUlNMcTNTZ3RCMnZOQ1IxSWR1QVJPdU81NVd5dVpoWnBDOF8xQVNkNkk1TUF6RWlBT2Z2eXJiNnlVMmNXRjl6dnI4d2VKVGdjWGdsWXl4RDM4Mkp2Y3RyZGZoQ09lcmJ5cTQyVmZFZEhub3NpU1lCTm5aT2hOctIB2gFBVV95cUxPdDl0MHRRNUI0SnM1QTJWSWdUbmZ2X184WHJWaWpLWDJ5YWFUY2t2bGpyQmFKMktCREtibFlXaVlUMWU1blFPQXhFMVI3MERNY3JxZl9sdzFwam9HVkR2eUR3NWpNbmZzUXVkTGl0b3JJWUZmeHVmenJQcnpsXzN1OTRmbUtFVmRhSFVQWG42cllrekRWYnV4dUhDT0RBVmNNSFItNjUtbWpoOGRwZ0Q3a2Q0cXJxMk1JZEhNazV5dnJwUW5NRjZBMjEzQ1A5TGpwV095RUhHY1VWZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jul 2024 07:00:00 GMT",
        "title": "Ethereum on-chain activity reveals mixed signals amid declining inflation - FXStreet",
        "content": "Ethereum could rally in Q3 following reduced US inflation and launch of spot ETH ETFs.\n\nEthereum's on-chain activity shows mixed sentiment among investors.\n\nBearish exhaustion candle could signify a downturn for ETH if SEC delays ETH ETF approval.\n\nEthereum (ETH) is up 0.5% on Thursday following cooling inflation reports in the US. However, mixed on-chain sentiment signals uncertainty among investors despite the potential launch of spot ETH ETFs.\n\nDaily digest market movers: CPI data, mixed on-chain signals, increasing supply\n\nEthereum's price is expected to react positively in the coming days to the recent decline in the US Consumer Price Index (CPI), a metric for measuring the cost of goods and services. The CPI for June declined by 0.1% from May, beating market expectations and reaching a three-year low. As a result, many expect the Federal Reserve (Fed) to cut rates in September.\n\nCombined with the potential launch of spot ETH ETFs in the coming days, many expect Ethereum to have a positive Q3. This also aligns with predictions from JP Morgan analysts that the crypto market will rebound in August.\n\nAlso, on-chain activity shows that Ethereum has been facing a flurry of exchange deposits and withdrawals in the past 24 hours, according to data from Lookonchain. This shows mixed sentiment and uncertainty among ETH investors. As some are de-risking, others are accumulating their selling pressure, keeping the price of ETH in a somewhat horizontal trend.\n\nThe key transactions include Golem pausing its ETH selling spree after staking 40,000 ETH, a whale depositing 10,000 ETH into Binance, another withdrawing 16,074 ETH in the past week, and HTX founder Justin Sun increasing his ETH holdings.\n\nMeanwhile, despite increasing staking deposits, ETH's supply has started trending upwards since the Ethereum Dencun upgrade in March. As the chart from Bitwise below shows, ETH's supply trended downward to -450K between The Merge and Q1 '24. It started moving upwards in Q2'24 following the Dencun upgrade. If ETH continues on this path, it will lose its deflationary status.\n\nETH Supply change since The Merge\n\nETH technical analysis: Ethereum posts bearish exhaustion candle\n\nEthereum is trading around $3,125 on Thursday, up 0.5% on the day. ETH has seen $26.27 million in liquidations in the past 24 hours, with long and short liquidations accounting for $17.05 million and $9.23 million, respectively.\n\nWhile the market remains gloomy, ETH is taking a slow ride up, offsetting its weekly losses as the market anticipates the launch of spot ETH ETFs.\n\nHowever, ETH posted a bearish exhaustion candle on the 8-hour time frame after attempting to sustain a move above the $3,200 price. An exhaustion candle has a long wick 2-3 times the length of its body and little or no wick on the other side. If a bearish exhaustion candle appears during an uptrend, it indicates bulls may be losing momentum, and vice versa if a bullish exhaustion candle appears during a downtrend.\n\nETH/USDT 8-hour chart\n\nIn the case of ETH, the reversal suggests that some of the over 2 million addresses that purchased ETH around $3,200 sold as they broke even, according to earlier predictions.\n\nWhile it seems ETH may tilt toward the downside after the bearish exhaustion candle, optimism from lower-than-expected CPI data and the Securities & Exchange Commission (SEC) approving issuers' ETH ETF S-1 drafts may see it attempt another move above the $3,200 price level. The move up may see $3.73 million worth of shorts being liquidated around the $3,222 price level.\n\nHowever, if the SEC continues delaying approval of ETH ETF, Ethereum will likely fall back to the $2,900 to $3,000 price level."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxQdVNBdTYtNXMyc1A0S3p3Zmg5NDFRTmM5cGJaNkJEWF9oRUpBR3Y2QlZ5ZnFWbnJ0cjh6OENoTVFwaDY5WlNQSVpmdzRfRE05eEI3X0Y4NDFIeWJTa0I4bXZhSklvSnBBRHNKTHgySkZPVXpmbHBBTy1uSEJkekF1cnY2a1hhY3JuUkNVd3VtQ1k?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jul 2024 07:00:00 GMT",
        "title": "Vitalik Buterin’s vision for the future of Ethereum - Yahoo Finance UK",
        "content": "Vitalik Buterin speaks at EthCC in Brussels, 2024.\n\nEach day, Coinrule will run through the state of the digital assets market for Blockbeat, your home for news, analysis, opinion and commentary on blockchain and digital assets.\n\nVitalik Buterin, co-founder of Ethereum, offered a comprehensive perspective on the current state and future of the ETH blockchain at the Ethereum Community Conference (EthCC) in Brussels. EthCC is a major event where developers and enthusiasts gather to discuss Ethereum’s advancements and challenges. In his keynote, Buterin addressed a packed room, highlighting both the strengths and vulnerabilities of Ethereum and proposing ways to fortify the network against potential threats.\n\nThe Ethereum co-founder began by outlining the strengths of Ethereum, focusing on its ability to support complex smart contracts that have fostered a robust ecosystem of decentralized applications (dApps). These applications range from decentralised finance (DeFi) to non-fungible tokens (NFTs), showcasing Ethereum’s versatility. He also praised the Ethereum community for its international and intellectual diversity, for its contributions to the network’s development and governance. It is the community that ensures the integrity and continuous improvement of the Ethereum blockchain.\n\nButerin did not shy away from discussing Ethereum’s weaknesses. He pointed out that the network struggles with handling a high volume of transactions, which leads to increased fees and delays. Security is also a concern, as Ethereum can be vulnerable to different types of attacks, including those targeting smart contracts. Additionally, using Ethereum can be complicated for new users. Newcomers may find managing wallets and interacting with decentralised applications difficult. There are also challenges in becoming a network validator. The validation process requires a significant amount of Ether (32 ETH) and technical knowledge to run a node. These issues can limit the network’s growth and its ability to attract more users.\n\nVitalik Buterin, co-founder of Ethereum, offered a comprehensive perspective on the current state and future of the ETH blockchain at the Ethereum Community Conference (EthCC) in Brussels.\n\nTo address these threats, Buterin proposed several solutions. He suggested increasing the quorum threshold from 75% to 80%. This means that a larger majority of validators would need to agree to confirm transactions. This change would make it harder for malicious actors to control the network. Buterin also advocated for automated responses to 51% attacks. During such attacks a bad actor controls more than half of the network’s mining power. This automation would allow honest validators to quickly move to a new fork of the chain. The goal behind this improvement is to reduce reliance on manual coordination. Simplifying the protocol and improving usability were also key points, aimed at making Ethereum easier and safer for everyone to use.\n\nStory continues\n\nButerin’s commitment to Ethereum’s continuous improvement was evident throughout his speech. He has been a frequent speaker at EthCC, discussing various topics over the years. In previous conferences, he tackled issues such as abstraction and the network’s evolution. His ongoing engagement with the community underscores his dedication to refining Ethereum and addressing its challenges head-on.\n\nButerin’s keynote at EthCC highlighted the dual nature of Ethereum’s journey—its strengths and its areas for improvement. By focusing on decentralisation, community engagement, and protocol simplification, Ethereum can overcome its current challenges and pave the way for a more robust future. As the blockchain continues to evolve, Buterin’s insights and leadership will remain crucial in shaping its trajectory."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxORXJrUmZweGJZODFQSG9zd3hNUjRJNWtaekViMlppR25sV25IcHVkWjNHS0hsRndUaV8zZEFONjBEMWNYS1NhRnY1aVczdGlvQmJDRFhHSGxJUGNUcDZoQk9mVU9OZ2ZaZGpqRnFneUxWemZkeWJJWDdGd2dQcTBWcnJvOGtUTHVZZjJQUdIBkgFBVV95cUxNYjVqZHBYSU1DLTJkbFNJdlFpb2lWQk5Obl9LdmFKSFpPVlppUGE1TGVGLUpNSFRXaGE5OU9HVzVTMTMzUmNiYUEzcXNLYXJTdUxZeHZLV01nRFBFNDhJNXRsVWIyd2VZVWUyVWs5bEk3bTZObFlHVnc4aHItcThIWTR2aWpTQWRqc1FqRlVjckFzdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Classic – Swing traders, watch out for these key levels! - AMBCrypto News",
        "content": "Ethereum Classic is likely to face rejection at its former support zone\n\nOBV and Open Interest showed buyer enthusiasm was low\n\nEthereum Classic [ETC] has retraced all of the gains it made during the rally from January to March. Back then, the altcoin’s price had risen from $18.33 to $39.67 at the apex. Alas, the market’s buyers have been underwhelming since then.\n\nThe fall below the $22.9-level meant that a new bearish move seemed more likely than a recovery. Here are the levels and scenarios that ETC swing traders need to watch out for.\n\nFormer support level is now the short-term bullish target\n\nIn April and again in June, the 78.6% retracement level at $22.9 was tested and defended as support. However, the Awesome Oscillator and the price action revealed that a strong downtrend was in play in June.\n\nSupport levels at the 50% and 61.8% retracement zones were lost quickly to sellers and in July, the bears marked another victory by forcing a descent below $22.9. The recent bounce from $18.3 doesn’t mean the bulls are winning though.\n\nInstead, Ethereum Classic swing traders would want to take short positions around the $23.2-$24.1 zone. More conservative bears can wait for a bearish engulfing candle to go short. With the OBV just barely above its three-month support level and the AO resolutely below neutral zero, the bearish argument is very convincing.\n\nOpen Interest at its lowest since October 2023\n\nThe weakness of the bulls was captured by the Open Interest chart. Alongside the price, the OI has slid persistently and stood at $89.7 million at press time.\n\nDespite the 10.6% price hike over the past week, the speculators did not seem too keen to bid.\n\nAdditionally, the spot CVD halted its downtrend over the past week and was slowly climbing higher at press time. The funding rate was positive, underlining the presence of bullish sentiment.\n\nRead Ethereum Classic’s [ETC] Price Prediction 2024-25\n\nThe short liquidations on 8 July after the rejection from $21 suggested a liquidity hunt. Traders should be on the lookout for a price surge that takes out short positions, as that might warn of a liquidity hunt in the opposite direction during the move towards the $23 resistance zone.\n\nDisclaimer: The information presented does not constitute financial, investment, trading, or other types of advice and is solely the writer’s opinion."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxQUHlCVnVnWDE5ZEgwSmxJMEVjZFRxaWVhUzBFOFN5STl1eWc0Q0UwUGJrSHFXZWFPVWVPLVV4T29UcGl3eTdadGEzRVpmMHM2bW54MjJkemJrMUIyS0R5SFNlVVR0Tk42NFVLRFVXazRNWnFvYUllM3YtRV9YZGxrcDFlMTjSAYoBQVVfeXFMTnRmZ0JkWlNNMzVHcmpvNHFQQjJ2TmVVaWdLWXNoZ1FhT0Njc1B0UXZkaHZhSXVqZWl6UC1ZTkhIMXJWeThGTjBSNDVMQ0JvNW9jN05BVDlhNGJzNGRNc0NwQWRyLW0wTGYzUWp0Y1h3c1ZKdlB2bjNMejRkYkN2V2M3YjdMTFJyNWdn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jul 2024 07:00:00 GMT",
        "title": "Key Reasons To Invest In Ethereum And Solana Now - CoinGape",
        "content": "Ethereum and Solana, prominent Layer-1 blockchains and decentralized application (dApp) hubs, currently face significant market dips. Ethereum leverages blockchain technology in its open-source platform, ensuring secure decentralized applications. Solana, also open-source, exploits the blockchain’s permissionless nature to innovate in decentralized finance (DeFi).\n\nSolana’s price recently dipped, disrupting a short-term upward trend. Typically, such corrections persisted for over a month before recovery. Meanwhile, Ethereum price exhibits a bearish pattern, albeit with modest rebounds.\n\nadvertisement\n\nThese platforms are known for their distinctive strengths; Ethereum prioritizes robust security, whereas Solana offers high throughput and minimal transaction costs. Despite the current volatility, this combination of features makes them pivotal players in the cryptocurrency domain.\n\nAnticipated Growth with New ETFs\n\nEther and SOL are poised for significant growth with the anticipated arrival of new investment products. Ethereum is at the forefront of excitement with its upcoming spot ETFs.\n\nThe financial community buzzes as the possibility of introducing Ethereum ETFs as early as this week remains pending approval from the U.S.\n\nSecurities and Exchange Commission. Investment experts, like Bitwise Asset Management’s Matthew Hougan, are preparing to capitalize on this development. Ethereum’s price is expected to surge, potentially exceeding its previous peak of $4,867.60 in November 2021.\n\nOn the other hand, Solana is not far behind, with a major ETF launch planned for March 2025. As the market begins to stabilize from recent fluctuations, Solana has shown impressive recovery.\n\nThe Cboe Exchange recently confirmed that asset managers VanEck and 21Shares would list their Solana-based products, pending regulatory green lights. The exchange has formally requested approval from the SEC to list these innovative ETFs.\n\nEthereum and Solana Drive Innovation in Blockchain Technology\n\nEthereum and Solana are pivotal in the blockchain landscape, fostering dynamic ecosystems for decentralized applications. Ethereum, a pioneer in smart contracts, maintains a vast array of dApps encompassing DeFi and NFTs, making it a leader in the field.\n\nOn the other hand, Solana excels in scenarios demanding high transaction speeds and minimal delays, such as gaming and high-frequency trading, thanks to its superior throughput capabilities.\n\nThese platforms rank among the top ten in market capitalization, enjoy robust developer support, and enjoy surging trading volumes. Their ongoing rivalry promises further advancements, making them attractive investment prospects in the blockchain domain.\n\nETH and SOL: Surge In DeFi TVL Dynamics\n\nEthereum holds a significant advantage as the leading platform in TVL, representing the total capital held within its smart contracts. High TVL indicates strong user activity and commitment to the platform, suggesting many users are locking up their assets in Ethereum-based DeFi projects. According to data from Defillama, ETH’s total value locked is currently at $54.273 billion.\n\nSolana has a smaller TVL than Ethereum. It’s known for its high-speed and low-cost transactions, which appeal to a different segment of DeFi users and developers. Solana’s focus on scalability and efficiency has helped it quickly become a competitive DeFi ecosystem, attracting innovations and developers, which could boost its TVL over time. Currently, the total value locked is $4.47 billion.\n\nScalability and Efficiency\n\nHistorically, Ethereum has faced challenges with scalability and high gas fees, especially during peak usage. However, ongoing upgrades, notably the shift to Ethereum 2.0, aim to address these issues by moving from proof-of-work (PoW) to proof-of-stake (PoS), which is expected to improve transaction speeds and reduce costs significantly.\n\nSolana is designed for high throughput and can process thousands of transactions per second (TPS), making it one of the fastest blockchains. This technical advantage makes it an attractive platform for high-frequency trading environments and applications requiring quick transaction settlements.\n\nFrequently Asked Questions (FAQs) 1. Is Solana Faster Than Ethereum? Yes, Solana is faster than Ethereum. Solana can handle over 65,000 transactions per second, while Ethereum manages about 15 to 45. This speed comes from Solana’s special design for handling many transactions. 2. Is Solana Cheaper Than Ethereum? Yes, using Solana costs less than Ethereum. Solana’s transaction fees are very low, only a fraction of a penny. Ethereum’s fees vary and can be high when the network is busy. 3. Is Solana More Secure Than Ethereum? Ethereum is considered more secure than Solana. Its network is more tested and has more validators, which makes it more decentralized. Solana has had more issues with network outages.\n\nRelated Articles\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxQMFFJVkxJSUdTNkM4ZUlxczNXQzFfODFGRGVyUVI1X1lsSEhKSlR2WFpza0hBQnBfWFlIZkJNZVpvakJlY1N1Y2ExSjYxS3VUM0xOOEpQdTgwc205cnYxOWNFYlRudEJQYnZIaFJ2WGxpQmRYZDY1dUtFaUY3ZmF0ZzF4TFhIVVhqMERfNGZMc2VZQVFKSkJJLWdWaFNQVEIzeEtoT251eVRka3ZMRll4c09CSUJPMlJIejhR0gHAAUFVX3lxTE50OEpHQm01c1NRaFY1azNXLU54d0NTSmhVZ0wwTEdRb0tueklna04xR1lJWUtzU2sxSTBjV04xNDk4b29VOW12TWJYOG9rSGw3Nm5oR0dZLVZmZWU4NG14UUR2b2s1d2xYUE42UElGa0IyZ0V3eUdOYkRmQ3lwa2VZWkRwNVQ1WDNlR3pfbWw5ZnJwOTgxNXU2ai03cW1QRzVCSlB3QXFSc2tZWmpEUWdKcldoQWJUWkNDdWd6X3YwdA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jul 2024 07:00:00 GMT",
        "title": "ETH/SOL Price Prediction: Ethereum Shows Bullish Signs as Solana Struggles - CoinGape",
        "content": "Ethereum price decreased by 2.7% in the last 24 hours to trade around $3,067 during American hours hours on Friday. On the other hand, the Solana price dropped by 5.4% in the last 24 hours to trade at $135.39. ETH price gained 4.52% against Solana on Thursday, going into the wee hours of Friday morning before retracing back a little bit.\n\nEthereum Price Eyes 7% More Gains Amid Fearful Markets\n\nThe Ethereum price action is trending below the 21-day, 50-day, and 200-day simple moving averages (SMA), while the relative strength index (RSI) is at 39 and rising. This indicates that bullish momentum is building on the Ethereum asset. The RSI also aligns with the chaikin money flow (CMF), which is at -0.05 and headed upwards. These two oscillating indicators signal that ETH price may be inbound for more upside.\n\nadvertisement\n\nEthereum price prediction shows the asset has bullish tendencies as the price action trailed back into the falling channel. A resistance barrier exists around the $3,300 level that, if broken, may catapult the price of ETH to $3,950.\n\nEthereum price has formed a double bottom against Solana, with 5.16% gains remaining until the market structure is completed.\n\nSOL Competes with Ethereum Price Amidst ETF Rumors\n\nOn the other hand, Solana price is trending inside an ascending triangle in the 4-hour time frame and is currently at the bottom trendline. The asset is also trending below the 21-day, 50-day, and 200-day SMAs, which is not bullish. The 200-day SMA currently offers a resistance of around $143, which coincides with the horizontal resistance line of the ascending triangle.\n\nIf the price of SOL breaks above the ascending triangle, it may surge 18% to $172. On the flip side, if bears prevail, the asset may find lower support around $121. The SOL RSI is trending at 41.61 and headed down, which shows increasing bearish momentum.\n\nNevertheless, the asset is at a crucial point against ETH price, where a bounce back could result in 15.74% gains.\n\nNate Geraci, president of ETF Store, shared Roxanna Islam’s prediction that more Solana ETF applications may be filed if the ETH ETF is confirmed. Cboe’s 19b-4 filings for VanEck & 21Shares already hint at the industry’s readiness.\n\n“I believe more issuers will submit spot Solana ETF filings after the spot ether ETFs are finalized.” –@roxannaswan Agree. My $$$ is on Bitwise first. pic.twitter.com/FoR84Fy9If — Nate Geraci (@NateGeraci) July 12, 2024\n\nBottom Line\n\nEthereum price action suggests a potential increase, targeting $3,950 if it can break through the $3,300 resistance level. Meanwhile Solana price prediction shows positive momentum in the short term against Ethereum, bucking the trend in a market where many crypto investors remain cautious. It trades within an ascending triangle pattern but shows increasing bearish momentum with its downward RSI. The price of Solana could either surge to $172 if it breaks above the pattern or find support around $121 if bearish trends continue.\n\nFrequently Asked Questions (FAQs) 1. What is the current price action for Ethereum? Ethereum's price has decreased slightly but shows potential for bullish momentum. If it can break through the $3,300 resistance, it could reach a target of $3,950. 2. What are the critical support and resistance levels for Solana? Solana is currently navigating critical support and resistance levels within an ascending triangle pattern. It could potentially surge to $172 if it breaks above the pattern or drop to $121 if bearish trends continue. 3. What are the potential impacts of ETF rumors on Solana and Ethereum? ETF rumors have a significant influence on the market. More Solana ETF applications may be filed if an ETH ETF is confirmed, potentially impacting both cryptocurrencies' market dynamics and price movements.\n\nRelated Articles\n\nEvans Karanja Evans Karanja is a crypto analyst and journalist with a deep focus on blockchain technology, cryptocurrency, and the video gaming industry. His extensive experience includes collaborating with various startups to deliver insightful and high-quality analyses that resonate with their target audiences. As an avid crypto trader and investor, Evans is passionate about the transformative potential of blockchain across diverse sectors. Outside of his professional pursuits, he enjoys playing video games and exploring scenic waterfalls.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxPN3l4dS1VOUZKaTZqRDFqdmlYS3QwSmdRVXBsR0R5Wjl5bklGblpWV05md0x5cE5NT0lENFhra2UwSTJsdkhMQWFLa28zTFBMQ1h3Q3ltZzFfekJIeGhPeHZjTDFpYWtmTnJUR1ZGTm0wSzdqOTBCam80N3hzXzhPN2NVazdBTi0tQzJfa1lJUdIBlAFBVV95cUxQZjNRQmpBUlA5RFhselhkNWhMNXdOVlM2TFprM0c1SjFlZXdKNlZ0MDZJa1BDblJVWk5qRllTUXZjcm9rZmZ5eVRfQ3U2M21jYUJXd2dScEx4TDdrZzRHTUdxSF92ZUdGM2VlckpuZmE5QkJ0aUJSYWU5Yzh1Z3hkQzhPR1lScFQwOWVXOHNZZlNLUzkx?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jul 2024 07:00:00 GMT",
        "title": "Spot Ethereum ETF Approval: How Long Will the SEC Stay Silent? - CoinGape",
        "content": "The U.S. Securities and Exchange Commission (SEC) is keeping issuers of spot Ethereum ETFs in suspense with extended delays. Additionally, Ethereum bulls are eagerly anticipating a significant price rally once the approval process concludes.\n\nNate Geraci Predicts Timeline for Ethereum ETF Approval\n\nETF Store President Nate Geraci recently shared his observations of the SEC’s approach towards the spot Ethereum ETFs review process. Geraci stated that the US SEC seems to be treating the spot Ethereum ETF S-1 filings in a manner similar to the 19b-4 forms, thereby maintaining a high level of secrecy in the matter.\n\nadvertisement\n\nDespite the silence, Geraci believes that the approval shall happen by the next week. “I still think approval is likely next week. There is absolutely no reason for delay,” he said.\n\nIt appears the SEC is playing the spot eth ETF S-1s similar to the 19b-4s… *Extremely* tight-lipped. Still think approval next week. Absolutely no reason for delay. — Nate Geraci (@NateGeraci) July 12, 2024\n\nThe SEC is repeating the same mistake this time as it did with the spot Bitcoin ETFs, said Geraci while quoting SEC Commissioner Hester Pierce. Back then Pierce said: “Had these products come to market in the way other comparable products typically have, we would have avoided the circus atmosphere in which we now find ourselves.”\n\nBloomberg’s ETF strategist Eric Balchunas also commented on the SEC’s lack of action regarding the Ethereum ETFs. He said that there’s been no communication throughout this week after the issuers submitted S-1 forms on Monday. This leaves the issuers puzzled over the delay.\n\n“Every issuer is ready. Docs are ready. It’s like a rain delay in baseball. Gotta just wait,” Balchunas remarked. He expressed hope that the situation might progress quickly next week, but uncertainty remains. As per the market sentiment, the issuers are expecting one more filing submission before the final approval by the SEC.\n\nAlso Read: ETH Gas Fee Flashes Inactivity Concerns Before Ethereum ETF Approval\n\nTop Players Accumulate ETH Before the ETF Approval\n\nOver the last few weeks, some of the top market market players and Ethereum whales have been accumulating ETH in preparation for the ETF approval.\n\nThomas Perfumo, the head of Strategy at Kraken showed that the US Ethereum ETFs can see inflows to the tune of $1 billion every month following the approval. Additionally, big market players like Tron founder Justin Sun have accumulated $1.1 billion worth of Ethereum gearing up for a big rally ahead.\n\nAs of press time, the Ethereum price is trading 1.25% up trading at $3,123 with a market cap of $375 billion. Ethereum bulls should take the price past $3,200 in order to trigger the bull run up to $4,000 and beyond.\n\nAlso Read: Bitwise Executive Says Ethereum ETF Is Close to the Finish Line\n\nBhushan Akolkar Bhushan is a FinTech enthusiast with a keen understanding of financial markets. His interest in economics and finance has led him to focus on emerging Blockchain technology and cryptocurrency markets. He is committed to continuous learning and stays motivated by sharing the knowledge he acquires. In his free time, Bhushan enjoys reading thriller fiction novels and occasionally explores his culinary skills.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxPS25hV01DaUhSUkZGamY0QVBrY0lSRHpSLTZDbnU4Wk5CUFNlSXUtWGZwUmhzS0stekE5Zkx3U3NBYmdQQVdseGs4bmpYUkxndElwSUVQWDRWT2lKMHFzMHlCUkt5YzdtMFRTRWZMdy1rWWl3WElCQkxSblU1UFljcjg4cjhlcS1maU5mS01vMXl2UDVI0gGaAUFVX3lxTE55dnE1MWlGMlU4bk1lMVNHQ25ZVUJtMThYbVc4aDllLVNIdXY0X0FwVmpzWkw1NWRDU1VGaEx1MGdSNkFuVzU0aGZsZ3ppWERoaXBmd212V0tfUjV3b0RJbDh2TG5pWEh0c1pNblRkVXRhOC1xVWhNR3IxWWVCMXYyY2thRDhvNUJCc0l4OUxHTUQ2ckV0dHhFYXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jul 2024 07:00:00 GMT",
        "title": "Ethereum News: Whale Scoops $33M ETH As Spot ETF Approval Speculation Looms - CoinGape",
        "content": "A significant Ethereum whale has made a substantial purchase, investing millions into the second-largest cryptocurrency by market capitalization. This notable transaction occurred at a crucial time, as the crypto community anxiously awaits potential approval of spot Ethereum ETFs by the U.S. Securities and Exchange Commission.\n\nThe timing of this large-scale acquisition, combined with the ongoing regulatory uncertainty, has ignited intense interest among investors and analysts. Many view this as a possible indicator of shifting market dynamics for Ethereum.\n\nadvertisement\n\nDetails Of The Whale Purchase & Market Context\n\nA significant Ethereum transaction has caught the attention of the crypto community, highlighting growing interest in the cryptocurrency as speculation about ETF approval intensifies. An Ethereum wallet, identified by the address 0x517…7aF15, has made a substantial purchase of 10,545 ETH coins.\n\nThis acquisition occurred over a brief three-hour period, indicating a rapid and decisive move by the buyer. The total value of this purchase amounts to approximately $33.29 million, with each ETH coin acquired at an average price of $3,156. Interestingly, the buyer executed this large purchase through five separate transfers. Each transfer involved an identical amount of ETH, suggesting a strategic and possibly automated buying approach.\n\nOver recent weeks, there has been a noticeable trend of accumulation among top market players and Ethereum whales. Thomas Perfumo, the head of Strategy at Kraken, has provided valuable insight into the potential impact of spot Ethereum ETF approval. According to Perfumo, U.S. Ethereum ETFs could see substantial inflows, potentially reaching $1 billion every month following approval.\n\nAdding to the intrigue, other high-profile figures in the crypto space have been making significant moves. For instance, Justin Sun, the founder of Tron, has reportedly accumulated Ethereum worth $1.1 billion.\n\nAlso Read: Hong Kong & Australia Bitcoin ETF Inflows Hit Record High\n\nCurrent Ethereum Market Status & Regulatory Outlook\n\nAs of the latest data, Ethereum price is trading at $3,153.88, with a 24-hour trading volume of $8.9 billion. This represents a 1.30% price increase over the last 24 hours and a 4.60% increase over the past week. The current circulating supply stands at 120 million ETH.\n\nThe cryptocurrency community is closely monitoring the U.S. Securities and Exchange Commission for potential approval of spot Ethereum ETFs. The SEC has been delaying its decision, creating uncertainty for ETF issuers and investors. Market analysts remain optimistic about an imminent approval, with some predicting it could happen as soon as next week.\n\nHowever, there are concerns that the SEC might be repeating its approach from the Bitcoin ETF approval process, potentially causing unnecessary delays. Bloomberg’s ETF strategist Eric Balchunas noted a lack of communication from the SEC this week, despite ETF issuers submitting their S-1 forms on Monday.\n\nInterestingly, just before the final decision on ETF approval, Ethereum gas fees dropped to a two-month low, suggesting major inactivity on the Ethereum network. This development adds another layer of complexity to the current market situation and regulatory expectations.\n\nAlso Read: Solana Co-founder Highlights US Govt’s Crypto ‘Mess’\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxNemJoNVY3bkYzcGtPMVVRSDdIRVd1MUM1Y0VMTGNpVXE3Q3hmRXlmU1d1bVZvbEI2Zy1Tbk00OWhxRHdlcmhLbnoxN2tJZ1JsODhLVXpFdlplWEt2VWxNNVd1NldfR1Z3ZWxLZFMzM29FQllScVQzYVFzT2RnaFE3VzdKSDFkQ3NQZUN6cWh2cEZ2aDJZTEstSkJUUTRON2pqbUkxTlFB0gGrAUFVX3lxTE5ya1FtVTJOelpFQkNkaWpzdnlxNmJQQm4wR25rajhWNzRBSGswTUtiYUd3aEh6Y19HZF9XcDJBc2xiZEtFdXVyNjdLSkJqRXljNUJHZDE1b1dNbkJoLUxQeVlpUTVxWXR0TTIwbDQtUG9KQW1FZDZlY3VkX1BBb1JuRy1aUW95VFJBcU9uTDR4VU5NVVZ0SzBZZG5LVUZTcWpxeXczM2ZGQzY1MA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Bulls Gear Up For Recovery – Can Spot ETFs Push Price To New Highs? - NewsBTC",
        "content": "Ethereum (ETH) is gearing up for a price uptick as we begin a new week. Ethereum is currently trading at $3,195 and is up by 1.83% in the past 24 hours. Although Ethereum’s gains are part of a wider market rally after a rebound, the altcoin is in the best position to surge the most in the coming weeks.\n\nRelated Reading\n\nFundamentals point to an extended price surge in the face of a looming launch of Spot ETFs. Additionally, technical indications are pointing to a bullish outlook for Ethereum as it approaches a crucial resistance level around $3,250.\n\nEthereum Basking In Bullish Sentiment\n\nEthereum is now looking to break above $3,200 after trading for the majority of the week below $3,100. Although Ethereum broke above $3,000 again last week, the king of altcoins largely consolidated between $3,000 and $3,100 in what looked like a slowdown of bullish sentiment.\n\nHowever, on-chain analytics and fundamentals point to Ether still basking in bullish sentiment among investors. Majority of investors are waiting for a signal before jumping on the asset.\n\nFor starters, there’s a growing sense that Ethereum Spot ETFs could be on the horizon. VanEck and other potential issuers amended their filings earlier in the week in hopes of receiving the SEC’s final permission. It could be a game changer for the crypto market in 2024 if Spot Ethereum ETFs start trading.\n\nAccording to Thomas Perfumo, Head of Strategy at Kraken, the Spot ETFs could open up an additional $1 billion inflow into Ethereum monthly. This new inflow of demand and money could see Ethereum push past its current all-time high of $4,900 into new price territories above $5,000.\n\nAccording to multiple reports, things are taking a better turn for the approval of these Spot ETFs, and the potential for approval by the SEC has jumped massively. As noted by Eric Balchunas, senior ETF analyst at Bloomberg, everything is already in place for the approval of the ETFs, and it is unclear why the SEC is taking so long. This has led to an increase in a bullish case for Ethereum for the rest of the month.\n\nYeah, rn it’s all quiet on the Western Front re eth ETFs. Nada from SEC this week. Unclear why they taking such sweet ass time. Every issuer is ready. Docs are ready. It’s like a rain delay in baseball. Gotta just wait. Maybe things will move fast next week. We’ll see… https://t.co/o1ZSdIf1nE — Eric Balchunas (@EricBalchunas) July 12, 2024\n\nRelated Reading\n\nBitcoin Whales Accumulate 71,000 BTC Amidst Price Dip – Details 2 months ago\n\nIndicators Looking Bullish\n\nOn the technical side of things, technical indicators also support a bullish outlook. According to the daily candlestick chart, Ethereum is on its way to closing its third consecutive bullish daily candle for the first time since June 16. The crypto is also attempting a break above the 100 SMA. A break above the 100 SMA in correlation with a bullish daily close could solidify the bullish momentum as we head into a new week.\n\nFeatured image from Reddit, chart from TradingView"
    }
]