[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxOdXlScVkzaFlBR1pfUHZUSmcxRmI5QUcxeFc3ODU4X2tPZTNCUzM5T3hYMm5WYWl0dzY4MVlMdEdyc084YksyVG05M3hpd2Jma1JEZ3dXSUZURmFkbE9yQVBOUjIwamU4YVlOaWYxRVFfQmRvLVA1Qi1SenUxVzNKbWFqLTc5YlpBSWVFdWFhdW1lVjM0eFE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Jan 2024 08:00:00 GMT",
        "title": "Coinbase Layer 2: Base Blockchain Explained - Ledger",
        "content": "Coinbase Layer 2: Base Blockchain Explained\n\nBy Lipsa Das\n\nBeginner\n\nSHARE\n\nKEY TAKEAWAYS: — Base is a Layer-2 scaling solution for Ethereum built by Coinbase which aims to make transactions faster while leveraging the security of the Ethereum mainnet.\n\n\n\n— The network achieves its primary goals of increased speed and reduced cost, though critics say the network is too centralized.\n\n\n\n— Coinbase’s end vision is for Base to become a foundational part of an eventual “Superchain” of fully decentralized and interoperable Ethereum Layer 2 networks.\n\nOver the last decade, the Web3 ecosystem has grown massively thanks to decentralized finance (DeFi), NFTs, and decentralized autonomous organizations (DAOs). This growth has led to increased developer activity, user transactions, and more.\n\nHowever, Ethereum, the leading smart contract blockchain network on which most decentralized applications (dApps) run, faces scalability issues. While the network is still improving, including pushing multiple upgrades such as the Merge, user activity frequently congests the Ethereum network, leading to slow transaction speeds and high transaction fees.\n\nEthereum’s scalability limitations are a direct roadblock to the growth and adoption of the network. Scalability improvements would mean faster transactions, lower fees, and a smoother user experience: all critical for mass adoption. That’s where Ethereum scaling solutions, like Coinbase’s layer-2 blockchain Base, come in.\n\nWhat is Coinbase L2 Base?\n\nDeveloped by crypto exchange Coinbase, Base is an Ethereum Layer-2 (L2) blockchain designed to make Ethereum more accessible while retaining the security of the main chain.\n\nIn short, Layer 2 blockchains are scaling solutions that help carry the traffic load for their parent blockchains. Like all L2s, Base enables faster transaction processing, and, notably, the L2 claims to have transaction fees that are ten times cheaper than Ethereum, based on a 90-day average.\n\nBase markets itself as “developer-friendly” and is fully compatible with the Ethereum Virtual Machine (EVM). This EVM compatibility means that developers don’t need to make major tweaks in their code and tools to deploy their applications on Base. What’s more, users can also easily move assets between Ethereum, Coinbase, other EVM-compatible chains, and the Base network.\n\nWho created Base?\n\nThe Base network was developed by the world’s leading cryptocurrency exchange, Coinbase. It’s important to note that Coinbase did not build Base completely from the ground up. Rather, Base is built on top of the OP Stack, an open-source template allowing anyone to build their own Ethereum L2.\n\nIts testnet launched in February 2023, followed by a developer-centric release in July. On August 9, 2023, Coinbase officially launched the Base mainnet through a month-long “Onchain Summer” event.\n\nThe Base ecosystem\n\nAlthough the Base ecosystem is still in its infancy, its fast and cheap transactions, interoperability and smart contract support make it capable of supporting countless blockchain apps and services.\n\nOn the Base network, you can access decentralized exchanges and DeFi platforms, manage Ethereum tokens and NFTs, and more. Moreover, since it was built using OP stack and operates as an Ethereum Layer 2, many of the top Ethereum platforms and services now use the Base network, including Aave, Chainlink, Etherscan, and Sushi Swap.\n\nAlthough there are too many apps and services on Base to name, let’s dive into some of the more popular platforms native to this chain:\n\nAerodrome\n\nAerodrome is Base’s central automated market maker (AMM) and liquidity pool. It is designed by the same team behind Velodrome, the leading decentralized exchange (DEX) on Optimism. Notably, the protocol aims to provide funding for projects and developers building public goods on the network.\n\nSeamless Protocol\n\nSeamless Protocol is Base’s first native, decentralized lending and borrowing protocol, which forked from the major liquidity protocol, Aave. Besides providing decentralized lending pools, Seamless also allows users an easy, 1-click method to bridge & swap tokens from any blockchain onto Base.\n\nFriend.tech\n\nFriend.tech is a decentralized social network, aiming to give users the power to monetize their online network. It does so by allowing users to buy and sell “keys”, which they can use to access private chat rooms. Though the platform has experienced some slowdown in growth since its buzzy, August 2023 launch, it’s one of the more successful attempts at a decentralized social network to date.\n\nHow does Base Network work?\n\nBase is specifically a Blockchain Rollup L2. In short, Base works by rolling up many Ethereum transactions off-chain and sending them back to the main chain in a single block. Base then submits a summary of the transactions – which includes cryptographic proof that indicates the validity of the off-chain transactions – to the Ethereum mainnet.\n\nAs mentioned, it was built with Optimism’s existing OP stack infrastructure. But what is the OP stack exactly?\n\nWhat is OP Stack?\n\nReleased in October 2022, the OP Stack is a collaborative effort from OP Labs and The Optimism Collective. Respectively, these are the development teams behind the Optimism Network – a popular Ethereum L2 – and the DAO that currently oversees it.\n\nIn essence, the OP stack provides the necessary components to build a fully functional layer-2 blockchain. One of the key features of the OP stack is that each of these components can be easily replaced and upgraded. This makes networks built on OP Stack highly adaptable.\n\nCoinbase’s belief in the OP Stack was such that it became the second core development team to commit to its development, alongside OP Labs. On a similar note, Base is the second major network to be built using the OP Stack, the first being the Optimism mainnet. Coinbase’s commitment to developing the OP Stack is actually part of a larger vision for an Optimism “Superchain”.\n\nWhat is the Optimism Superchain?\n\nThe Optimism Superchain is a vision for a network of interconnected Ethereum Layer 2 chains, each with its own ecosystem.\n\nUsing the same OP stack infrastructure makes these chains interoperable. Much like the Cosmos SDK for IBC blockchains, the Optimism Superchain would allow these networks to share governance and bridging protocols.\n\nAlthough not yet live, Coinbase is actively working towards this vision alongside the Optimism Collective. Aside from its development work on the OP Stack, a portion of all Base transaction fees goes directly to the Optimism collective.\n\nDoes Base Support NFTs?\n\nAs a fully EVM-compatible chain, Base supports NFTs and is fully integrated with the major NFT marketplace, Opensea. In fact, the “Onchain Summer” event that launched Base reportedly saw over 700,000 NFTs minted. The event included NFT collections from prominent brands like Coca-Cola and Atari, as well as web3-native names like Friends With Benefits and Coinbase itself.\n\nSimilarly to other major L2s like Polygon, Immutable X, and Arbitrum, Base can drastically reduce the fees associated with trading NFTs. All users have to do is transfer ETH to Base using The Base Bridge to be able to purchase Base NFTs. In addition, it’s possible to both mint NFTs on Base, and even develop custom NFT gallery apps using third-party platforms.\n\nSome of the most popular Base NFT collections today include the collectible NFT card game Parallel Alpha, the generative NFT collection NFToshis, and the innovative community art collection BasePaint.\n\nAdvantages of Base Blockchain\n\nThe key advantages of the Base blockchain are low fees, developer-friendly features, and scalability in the Web3 ecosystem. Let’s look at how these advantages help users.\n\nLow fees:\n\nLike most L2 networks, Base enables users to execute Ethereum transactions at a fraction of the cost. With every Base transaction, you incur two costs: a fee to execute the transaction on the L2 network and a fee to publish the transaction on Ethereum (L1) as part of a block. Naturally, the Ethereum mainnet gas fee is usually higher than the Layer 2 gas fee, though both fees are dynamic and increase during periods of heavy usage.\n\nDeveloper-friendly:\n\nSince there are minor technical differences between Base and Ethereum, developers can effortlessly deploy their existing codebase on the L2 network without drastic modifications. Plus Base makes it easy for blockchain apps to integrate fiat on-ramps while benefiting from access to Coinbase’s user base and $130 billion in assets.\n\nScalable Web3:\n\nThanks to its Optimistic rollup functionality, Base helps solve Ethereum’s scaling issues by moving the bulk of the transaction process off-chain. This allows Base to handle the kinds of everyday transactions its parent chain wasn’t built for. Using Base is a way to keep transaction costs down while benefiting from the security, transparency, and interoperability of the Ethereum network.\n\nDisadvantages of Base Blockchain\n\nWhile the Base blockchain is a promising scaling solution, it still has some challenges it needs to tackle, namely centralization and security concerns.\n\nCentralization:\n\nClaims that Base is overly centralized mainly stem from the fact that Coinbase is solely in charge of operating the Base network’s sequencer. To clarify, this sequencer is a specialized node that is vital for creating an ordered list of transactions. Similarly, the system also has certain control layers that are permissioned.\n\nThere are a few important things to note about these centralized aspects of Base. For one, many Layer 2 chains operate in this same way. Then there is Base’s roadmap, which outlines the network’s many plans for further decentralization, including splitting up control of its smart contract upgradability through a layered, Multisig structure.\n\nAnother key point is that Coinbase’s Head of Protocols, Jesse Pollak, has directly rebutted some of these centralization claims. Notably, Pollak maintains that Coinbase does not have the power to modify or reverse transactions on Base.\n\nAbove all, Coinbase has been vocal about its commitment to the decentralization of the chain, thus building Base with the open-source OP stack. Alongside OPLabs, Base is also working to make OP Stack even more decentralized, including working on the scalability, security, and decentralization of its client.\n\nSecurity:\n\nWhile there aren’t necessarily security concerns unique to Base, the blockchain does require bridging assets to another network which can inherently introduce some security concerns.\n\nBlockchain bridges rely primarily on code. The problem is, that code can contain bugs and vulnerabilities. Unfortunately, these weaknesses can result in lost funds as the bridges often contain huge amounts of coins or tokens.\n\nIndeed there have been some high-profile bridge hacks in the past resulting in losses stacking up into the millions. To address this issue, Base is working alongside the Optimism collective to develop Pessimism, a monitoring stack that will improve the security of the OP stack, including its bridges and infrastructure.\n\nDoes Base have a native token?\n\nInterestingly, Coinbase has maintained that it has no plans to issue a native token on Base. Instead, users can pay gas fees for transactions on Base with ETH. While Base is still working to achieve Stage 1 decentralization, which it describes as including “limited training wheels,” it has not yet opted to incentivize more validator nodes.\n\nOf course, native tokens can have many important functions, most notably relating to the governance of a blockchain and as a reward for network validator nodes. Thus, in the future, as the blockchain becomes more decentralized, a native governance token could be useful for validators to earn rewards.\n\nHow to Access Base Network from a Ledger\n\nTo access the Base Network from a Ledger device, your device should have an Ethereum app installed. If you already have an Ethereum app, use the following steps to create a Base account:\n\nNavigate to “Accounts” on the menu in the left sidebar and select “Add account.” From the dropdown menu, select Base “(ETH)” and click on “Continue.” Connect your Ledger device to Ledger Live and unlock it. Launch the Ethereum app on your Ledger device and click “Add account” to access the Base network.\n\nIf you want a step-by-step guide to this entire process, you can visit the Ledger support page.\n\nYou can also send ETH, Ethereum NFTs, and other ERC-20 tokens to your Base account. It’s important to note that NFTs on Base are not displayed in Ledger Live, although you can view Base NFTs in the “Discover” section of the Zerion app.\n\nHow to send crypto to a Base account on Ledger\n\nHere’s how to send Base (ETH) using Ledger Live:\n\nNavigate to the “Accounts” section in the left sidebar menu, select “Base (ETH)” and hit “Send.” Input the recipient’s address, carefully double-check it (even a small error in the address could lead to loss of funds), and click “Continue.” Specify the amount you wish to send. You could try sending a small amount first to ensure the crypto was received before doing a large transaction. Review the transaction summary, including the amount and network fees, and click “Continue.” On your Ledger device, confirm and approve the transaction by pressing both buttons simultaneously. Your Ledger hardware wallet balance will be updated once the blockchain confirms the transaction.\n\nThe Future of Base Blockchain\n\nCoinbase believes Base is the key to creating an “environment where thousands of actually useful dApps emerge that can bring 1B+ users into the global crypto economy.” As a first step, Base could bring Coinbase’s 100M+ users on-chain.\n\nWithout a doubt, Ethereum’s limited scalability is one of the major issues impacting its wider adoption. Luckily, L2 solutions like Base continue to make the network more usable, even at high traffic times. Solutions like this, along with the easeful self-custody that the Ledger ecosystem empowers, make the Ethereum network more usable than it has ever been.\n\nSo are you ready to manage your assets on Base with ease? Get yourself a Ledger device to enjoy all the benefits that come with self-custody, security, and full ownership and control over your digital assets."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiYkFVX3lxTE1wTXdtQ2k3OUZhaENZTmhTV2tGVFlGbDB5UlB5aWdUeUtnZGFENkdRVEpzQldXbnhkdllBalpteTl5MC1oWnZhQ0NPcjZNQ29MV0JKSGRSRUplc0tEZWx5VHVR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 20:30:31 GMT",
        "title": "BlackRock spot ether ETF decision delayed by SEC - Blockworks",
        "content": "\n\nThe Securities and Exchange Commission delayed a decision on BlackRock’s proposed spot ether ETF.\n\nThe delay pushes any decision on the proposed fund to March 10, according to an official release by the agency.\n\nThe delay was largely expected, with the SEC also delaying decisions on Fidelity’s proposed fund on Jan. 18.\n\nRead more: After spot bitcoin ETF approval, eyes shift to ether fund decision\n\n“Spot Ethereum ETF Delays will continue to happen sporadically over the next few months. Next date that matters is May 23rd,” Bloomberg Intelligence analyst James Seyffart said.\n\nLoading Tweet..\n\nThe decision comes just weeks after the SEC approved nearly a dozen spot bitcoin ETFs. Three commissioners — Hester Peirce, Mark Uyeda and Chair Gary Gensler — voted in favor of the ETFs.\n\nFollowing Grayscale’s legal victory in August, the SEC was compelled to reevaluate its application for a spot bitcoin ETF conversion. Despite this progress, the status of ether ETFs continues to be unclear.\n\nIn an interview on Tuesday, Peirce said that the SEC would “apply precedent” to any decisions on spot ether ETFs. She further noted that the agency doesn’t plan to repeat history and face another court case in order to approve such funds.\n\n“I’m not holding my breath,” Lara Crigger, editor-in-chief at VettaFi previously told Blockworks about ether ETF approval.\n\nHowever, Seyffart previously said that he was more bullish about the future of ether ETFs.\n\n“If [Gensler] goes after ETH, it’s not just going to be a lot of these industry players; it will also be the CFTC that he has to contend with, and it’s just not worth it,” he told On the Margin podcast.The delay was largely expected after the SEC also delayed Fidelity’s proposal\n\nIn his press release following bitcoin ETF approvals, Gensler noted that the decision “should in no way signal the Commission’s willingness to approve listing standards for crypto asset securities.”\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMi0AFBVV95cUxPbHY0eDdJYXJ4b3I0M3Y5VVVpRzNIUGE1QWxzaTUtSDlVSzlPY0RoSThFaXAtekMxNElxdEREemhlMTlWVl9QbVktU1F5c1dnS3dFeWxtbVRFTFdMREJ6czZzeDUwNEowNVB0UHp5YzZkUW1INGpCcS1tZzdpVGNHcHBGVGNMWEtyMy1vVjJuZGhOWnU3NW9jdTJHQ1hsVnhsSWZ4QllCTDRhcHNTQzVHSzRERnJMR3VLWmZsMFJxTktZZXYzbHBDWWVuT2V2MEZq0gHWAUFVX3lxTE9Wajl0cmxXWlRLdDRtcHhTRThPYjNzYm5rb1dyUG15SDV3M1lKcDM1T01KNWNhTFVsZk5FTjd4b3BnSlBCemNobEx1b1NHY3JkQ3dVUkhNNzZKTUtZS3NGd3ZwaTBoczFzWUctYVM3RUMteXdyRlNrRFE0ci1nYVNkc1NwakVJanBNSE9OSnFzdURLajhRaGUyTTF2VVFhR1JqS1NqT3VfdmxlZmYyejZxYVlnb2RDM2dSeWlxeTRFSVFJbkc2Q0NwbWNGOXQwbmFQX2N3TUE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "XRP Ledger Now Closer Than Ever To Ethereum Compatibility As Second Audit Nears Completion: Developers - The Daily Hodl",
        "content": "The XRP Ledger (XRPL) is almost ready for the launch of its much anticipated Ethereum Virtual Machine (EVM) compatible sidechain, according to developers working on the project.\n\nThe project aims to allow Ethereum (ETH) developers, who are used to Solidity, the main programming language for writing smart contracts on Ethereum, to access and build on the XRPL network.\n\nDevelopment firm Peersyst Technologies says on the social media platform X that the new sidechain is waiting for a few components to come together, such as its XChainBridge which is currently being voted on by validators.\n\nThe bridge aims to allow users to automatically bridge any token from the sidechain onto the XRPL.\n\nPeersyst also says that the sidechain, which is “more advanced than ever” and has already been audited by security firm Bishop Fox, is going through a second audit with “a recognized supplier” that will be published soon.\n\nThe firm also says that a new version of blockchain explorer Blockscout is being built for the sidechain.\n\nAccording to Ripple, some highlights of the EVM sidechain include:\n\nSupport for 1000 transactions per second, enabling large loads and throughput.\n\nLow transaction confirmation times, producing a block every 5 seconds.\n\n1 block finalization time; once a block is added to the chain and confirmed, it’s considered final.\n\nFull Ethereum Virtual Machine (EVM) compatibility, enabling you to connect your wallet and interact with or deploy smart contracts written in Solidity.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Natalya Yudina/INelson"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxNSGtyT0hmT1NBcFdZZkExNl9MSWRuelNSRDd6TGpGS1Zxa18wV1FsSFRTU3FLRDR5R0dwRnN3aTBZclctQ3NxTl9FNnE2VTZLN3QxeDhiZzhKeThULVl0c0F2SXhRdmkzNkw4RTRqbUR2ZW4zU1YtMG9uYmZ1VEw2OGYweTVIdmpIY3JpQktRZllPRHItSXZnOEw4RC1JSWlBNlFHbjQza2RWSTdXYlhR0gG0AUFVX3lxTFBKSER3LXFmMlIxMHY1RUp4TjYxTld6WUI5NE1vekZHQ1RPemhaTVNRTjJSemNUQ0R2c21ZSVF5Szdwblo4Z2lpdUFza0ZBemxwWHpvTklTMEoza2hOdHdPenBpdE53M0RTdHdGcnZON2p6emFNcXNCTFExYmxPclJydldINGstT1M4WjlidEZlN2VXZ2xOSnYtNDZfenMzeVR4c3c5dmU1YXhIOS1CTmhuZGVYbQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Jan 2024 08:00:00 GMT",
        "title": "Ethereum (ETH) Loses All of Its Gains, Bitcoin (BTC) Not Ready to Give up $40,000, Solana (SOL) Comeback Starts - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nEthereum has wiped out the gains it had accumulated over a sustained period. The ETH/USD price chart depicts a grim narrative as the digital asset has swiftly descended from its peak, retracing back to levels that question the sustainability of its prior growth.\n\nThe steep decline in Ethereum's price is a significant bearish signal. It reflects the market's hesitancy to invest at previous highs, most likely due to the underperformance Ethereum has shown in the recent past. This lack of traction and inability to initiate a recovery underscores the vulnerability of Ethereum's price in the current market climate.\n\nFocusing on the technical aspects, Ethereum has broken through what was once seen as a strong support level at approximately $2,350. This price point, which previously saw substantial buying interest, has now been breached, leading to a cascading effect as the asset searches for new support. The next critical support level is around $2,175, where buyers might emerge to stall the downfall.\n\nAdvertisement\n\nConversely, any attempts at recovery will first encounter resistance at around $2,338, a level that now marks the lower boundary of what was a consolidation range before the drop. A close above this level on significant volume could signal a temporary respite from selling pressure. However, the real test lies at higher resistance levels, previously established around $2,500, where ETH struggled to maintain upward momentum.\n\nBitcoin ready to fight\n\nRecent candlestick formations portray a scenario where Bitcoin is flirting with a critical resistance level, poised to either confirm a bearish trend or start a substantial recovery.\n\nThe chart illustrates Bitcoin’s recent descent, as it lost its foothold at the higher price echelons it previously occupied. However, amid this downward movement, Bitcoin is showing signs of resilience. The latest candles indicate a potential reversal as they hover around a significant support level, which can be identified at approximately $37,000, a region where buyers have historically stepped in.\n\nA sustained hold above this point could catalyze renewed buying interest, which may drive the price toward the immediate resistance level at around $41,000. The significance of reclaiming this threshold cannot be understated, as it may invalidate the bearish outlook and signal a trend reversal.\n\nAs for the upper resistances, the $43,000 and $46,000 price levels stand out as notable barriers that Bitcoin would need to breach to cement a robust recovery narrative. Achieving such milestones could sway market sentiment positively, potentially ushering in a wave of optimism among investors.\n\nThe moving averages offer additional insight, suggesting a possible bullish crossover should the current momentum persist. This scenario would be further supported by a rise in trading volume, which typically accompanies decisive trend shifts.\n\nSolana among leaders\n\nSolana shows signs of a nascent comeback, presenting a bullish scenario amid a broader market recovery. However, investors tread cautiously, aware of the potential of a \"dead cat bounce\" since volume profiles signal restraint.\n\nAnalyzing the SOL/USDT chart, we notice that Solana has established a local support level around the $70 price mark. This is characterized by multiple touches of this level over the past few weeks, each time resisting further downward movement.\n\nOn the flip side, the local resistance can be identified near the $96 level, which previously acted as support during Solana's consistent upward trend.\n\nThe price movement is currently sandwiched between the 50-day moving average acting as dynamic resistance and the 200-day moving average serving as potential dynamic support. The narrowing gap between these averages could squeeze the price action, possibly leading to a volatility breakout."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTFBsTUNnVlV0cDZjZlJGbU4tZjlfVGtHOUFoU1REVVRfWmZxRVZDTGJqZk1sajd0S3BpajVnV0VLUDZSemFTMnhVOWhacXdjbEFfbHAta3loVm5JbEhsNEtTQXhwTVVZRjBtalYyd0E3cHAyU0HSAXhBVV95cUxQSGVsVmdEUkNnUGstX005d2tvcng2QXQ1ampGZm0wR3ppdVVUNkc5YlVUTlUzUzUxNXVQRDl3ZG9TTzJYdC1DTjkwZldDbVgyZXR5VXhlRllwQUNjZFBrQWNKVU5aZUJZRWVLVjJJTkVoZ3lLZGYxYmE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Jan 2024 08:00:00 GMT",
        "title": "Legal Analysis: Decoding A Spot Ethereum ETF Approval - Bitcoinist",
        "content": "In a detailed legal analysis shared via X, Davis Polk lawyer Scott Johnsson dissected the complex path that Ethereum (ETH) must traverse to secure a spot Exchange-Traded Fund (ETF) approval. This deep-dive analysis, while drawing parallels to the successful Bitcoin (BTC) spot ETF approval, highlights the unique challenges and potential regulatory shifts necessary for Ethereum’s spot ETF prospects.\n\nPart I: General Roadmap To Spot ETF\n\nJohnsson begins his analysis by emphasizing the importance of understanding the general regulatory path for a digital asset to transition into a spot ETF offering. He points out that BTC pioneered this journey through a 4-step path, with each step building on the prior one. “It took seven years from step 1 to spot ETF for BTC, with disapprovals and regulatory hurdles at almost every turn,” Johnsson notes, highlighting the lengthy and complex process involved.\n\nThis is the timeline for BTC. You can see it took 7 years from step 1 to spot ETF, with disapprovals along the entire period. During this time, arguments evolved and matured… resulting in the current regime following the 19b-4 approval order for spot ETFs this past month. pic.twitter.com/KchdpnRZwn — Scott Johnsson (@SGJohnsson) January 25, 2024\n\nFor Ethereum, the timeline appears to be compressing, an observation Johnsson attributes to the maturation of arguments and the refining of regulatory stances, particularly influenced by key litigation events such as the Grayscale case.\n\nStep-by-Step Process For BTC’s Spot Approval:\n\nObtain a DCM Futures Listing: This step is pivotal, primarily establishing the regulatory classification of the asset as a non-security commodity and setting up the necessary futures market for the asset. ’40 Act Futures ETF: This step gains importance as it doesn’t necessitate explicit SEC approval and implicitly ratifies the commodity designation by the SEC. ’33 Act Futures ETF: Integral in the Grayscale ruling, this step requires a formal 19b-4 approval from the SEC, laying the groundwork for logic applicable to spot approval. Spot Approval: The ultimate goal, necessitating another formal 19b-4 approval from the SEC.\n\nPart II: The Threshold Question & Grayscale\n\nIn the labyrinth of regulatory frameworks and legal precedents, the journey to spot ETF approval hinges pivotally on navigating the nuances of Section 6(b)(5) of the Exchange Act. Johnsson delves deep into this aspect, identifying it as the linchpin in the process of securing a spot ETF approval. “The essence of the challenge lies in satisfying the stringent demands of Section 6(b)(5), particularly its stipulations concerning the potential for fraud and manipulation in the market,” Johnsson articulates, emphasizing the critical nature of this requirement.\n\nDissecting the SEC’s Approach: The Three-Pronged Path\n\nThe SEC’s approach to addressing these concerns has historically unfolded along three potential pathways, each presenting its unique set of challenges and intricacies:\n\nInherent Resistance to Fraud and Manipulation: The first path involves demonstrating that the digital asset (e.g. Ethereum) inherently possesses attributes that make it resistant to fraud and manipulation. Johnsson notes, “This route demands a robust demonstration of the asset’s inherent market mechanisms and structures that inherently guard against fraudulent activities and manipulative schemes.” It’s a path less traveled, primarily due to the high threshold of proof and the complexities involved in substantiating such inherent safeguards.\n\nThe first path involves demonstrating that the digital asset (e.g. Ethereum) inherently possesses attributes that make it resistant to fraud and manipulation. Johnsson notes, “This route demands a robust demonstration of the asset’s inherent market mechanisms and structures that inherently guard against fraudulent activities and manipulative schemes.” It’s a path less traveled, primarily due to the high threshold of proof and the complexities involved in substantiating such inherent safeguards. Other Means to Prevent Fraud and Manipulation: The second avenue, as Johnsson outlines, “involves identifying and implementing additional measures that effectively mitigate the risks of fraud and manipulation, separate from the asset’s inherent characteristics.” This path necessitates a comprehensive exploration of supplementary safeguards and regulatory mechanisms that can be fortified to protect the integrity of the market.\n\nThe second avenue, as Johnsson outlines, “involves identifying and implementing additional measures that effectively mitigate the risks of fraud and manipulation, separate from the asset’s inherent characteristics.” This path necessitates a comprehensive exploration of supplementary safeguards and regulatory mechanisms that can be fortified to protect the integrity of the market. A Surveillance Sharing Agreement (SSA): The third and often most scrutinized pathway revolves around establishing a robust Surveillance Sharing Agreement (SSA) with a significant market. “The SSA is pivotal, as it represents a concrete, collaborative effort between the market and regulatory bodies to actively monitor and combat potential fraudulent activities and manipulative practices,” Johnsson explains.\n\nThe Grayscale Ruling: A Paradigm Shift\n\nThe landscape, however, experienced a seismic shift with the advent of the Grayscale ruling, which brought the SEC’s reliance on the “significant size” test under a glaring spotlight. Johnsson dissects this development, stating, “The Grayscale ruling was a watershed moment, unraveling the SEC’s previously impervious stance and exposing the vulnerabilities and inconsistencies in the ‘significant size’ test.”\n\nThis test, which had long been a cornerstone of the SEC’s rationale in denying previous spot ETF applications, was subjected to intense scrutiny. Johnsson illuminates this, saying, “The ‘significant size’ test, once a bastion of the SEC’s defense, was dissected and found lacking in coherence and consistency, marking a critical inflection point in the narrative surrounding spot ETF approvals.”\n\nThe ruling underscored two pivotal facts that turned the tide: the close correlation between spot and futures markets, and the identical nature of SSAs with significant markets like the CME. “This correlation and the homogeneity of the SSAs were the fulcrum on which the Grayscale ruling pivoted, compelling a reevaluation of how these factors are weighed in the approval process,” Johnsson observes.\n\nHe further elaborates on the intricate dynamics post-Grayscale ruling, “The ruling didn’t just challenge the SEC’s previous denials; it necessitated a profound reconfiguration of the SEC’s approach, paving the way for BTC’s spot approval and setting new precedents for assets like ETH.”\n\nPart III: BTC 19b-4 Approval Order\n\nJohnsson examines the SEC’s tactful navigation around the “significant size” test, a move he perceives as both shrewd and indicative of the agency’s responsive recalibration. “The SEC’s decision to sidestep this contentious test illustrates a deliberate shift, steering the discourse towards uncharted yet potentially more stable grounds,” he articulates. This strategic pivot, while resolving the immediate challenge, subtly reshapes the regulatory landscape for future digital asset considerations.\n\nEmbracing The “Other Means” Test: A Paradigm Shift\n\nThe SEC’s adoption of the “other means” test under the provisions of 6(b)(5) marked a pivotal shift from its previous stance. Johnsson describes this as “a recalibration of approach, charting a new course in the SEC’s methodology to tackle the concerns of market manipulation and fraud.” This move, characterized by a comprehensive correlation analysis, signified a fresh perspective on assessing the integrity and resilience of digital assets in the market.\n\nThe Methodological Refinement: A Rigorous Correlation Analysis\n\nDelving into the SEC’s correlation analysis, Johnsson highlights the meticulousness and foresight embedded in this approach. “The SEC’s methodology is not merely thorough; it’s a testament to their commitment to data-driven and forward-looking regulatory practices,” he asserts. The emphasis on a substantial sample period, intra-day trading data, and, crucially, consistency across the period, underscores a rigorous and methodical approach that sets new precedents in digital asset evaluation.\n\nJohnsson points out the SEC’s directive to exclude references to the Coinbase SSA in the 19b-4 applications. He interprets this as a calculated, strategic maneuver, suggesting, “This deliberate omission opens a subtle yet profound window into the SEC’s broader strategy, hinting at a complex tapestry of considerations and tactical plays at work.”\n\nPart IV: Ethereum Analysis\n\nJohnsson begins with an optimistic perspective, drawing parallels between Ethereum’s journey and the recently paved path by BTC. “The SEC’s approval of a BTC spot ETF, particularly its reliance on the ‘other means’ test and the correlation analysis, lays down a potential blueprint for ETH,” he observes. This precedent, he argues, offers a glimmer of hope, positing that “ETH, much like BTC, stands on the brink of achieving a similar breakthrough, provided it can navigate the intricate web of regulatory nuances.”\n\nThe Correlation Conundrum: Ethereum’s Unique Challenges\n\nDespite the optimism, Johnsson delves into the unique challenges Ethereum faces, particularly in establishing a sufficient level of futures-spot market correlation—a cornerstone of the SEC’s recent approval rationale. “ETH’s correlation metrics, while promising, are not a mirror image of BTC’s. This distinction forms the crux of the challenge, necessitating a nuanced understanding and strategic alignment with the SEC’s evolving benchmarks,” he explains.\n\nHe further dissects the SEC’s methodological rigor, emphasizing that “Ethereum must not only demonstrate high correlation but also ensure consistency and robustness across a substantial historical sample, aligning with the SEC’s methodical and data-centric approach.”\n\nStrategic Considerations: The SEC’s Balancing Act\n\nJohnsson highlights the broader strategic considerations at play within the SEC, particularly in light of its recent actions and legal stances. “The SEC’s approach, especially its decisions regarding Coinbase and Binance, casts a long shadow over ETH’s prospects. The agency’s actions and the legal precedents they set form a complex tapestry that ETH’s application must deftly navigate,” he points out.\n\nHe underscores the significance of ETH’s non-classification as a security in recent SEC actions, suggesting that “This implicit recognition of ETH’s status, while not an outright endorsement, offers a subtle nod to its potential pathway towards spot ETF approval. […] The SEC listed a dozen+ digital assets in each action as alleged securities, […] Notably, ETH is not included in either. Nor has there ever been such an allegation.\n\nThe Countdown To The May Deadline For Ethereum\n\nAs the May deadline looms, Johnsson presents a multifaceted analysis of the converging factors that could influence the SEC’s decision. “The clock is ticking, and with each passing moment, the SEC’s decision matrix grows more intricate, woven with legal, strategic, and market considerations,” he states.\n\nAlso, Johnsson points out the influence of BlackRock with regards to a potential spot Ethereum ETF. “Near undefeated in ETF applications led by highly influential Larry Fink. And there is strong reason to suspect they may have been a stronger catalyst to BTC approval than even the Grayscale ruling.”\n\nThe lawyer acknowledges the potential headwinds, especially the SEC’s meticulous correlation methodology and the relatively shorter historical trading data for Ethereum compared to Bitcoin. “Ethereum’s journey is not a straightforward sprint but a marathon laden with strategic hurdles and regulatory checkpoints,” Johnsson remarks, emphasizing the complexity of the path ahead.\n\nIn concluding his analysis, Johnsson strikes a note of cautious optimism. “That said, there should be plenty of clues leading up to the deadline which should inform us as to how the SEC is thinking about its decision. And it would certainly not surprise me if the SEC decided to avoid the DC Cir at all costs and simply issue approval,” he reflects.\n\nAt press time, the Ethereum (ETH) price stood at $2,223.\n\nFeatured image created with DALL·E, chart from TradingView.com"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxNemJVRkhWdVBkNTdGRHdSX08ydW5JYXFKdGJQRXpHVGllYl9XTDlkd2ZYazhBQ2N1MTh2dFlPQjgtYms3WFEyWEtfYVdadHE2WHE4ZlVTQlo2em54ZmhPZDNCX2I4M2psUk5QeHBNVURTUnhFR0Q1SXNmeGRaeE53LU5ndnBxVUhmOFZoUmotUm4xaE9aSHV3bVhvbGg5V2J3QmtsdWlXVHhGNUJIU3ZSN3ZyamFHUTY2emE2ajBZRHV6UQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Jan 2024 08:00:00 GMT",
        "title": "Strike CEO calls Ethereum 'tech play,' says Bitcoin solves the 'biggest financial problem' of our time - CryptoSlate",
        "content": "Strike founder Jack Mallers recently expressed his firm belief in Bitcoin’s potential to solve what he describes as “the biggest financial problem ever” — central banking and the global debt crisis.\n\nMallers made the statement during an interview with Yahoo Finance on Jan. 24, where he highlighted Bitcoin in relation to government debt by focusing on the significant issue of global financial instability, primarily driven by excessive government debt.\n\nBitcoin is a hedge.\n\nMallers said that the staggering global debt-to-GDP ratio, which currently stands at an alarming 360%, represents a critical problem where governments have accumulated debt to such an extent that there seems to be no feasible way to pay it back. He added:\n\n“Someone’s run up a $37 trillion bill at the bar, so who’s paying for that?”\n\nMallers argued that the holders of government-issued currencies will ultimately bear this massive debt burden. He reasoned that governments might address their debt by debasing their currencies by printing more money. This currency debasement process erodes the currency’s value, leading to potential inflation and financial instability for those holding these currencies.\n\nAdditionally, Mallers pointed out the current state of the traditional financial markets, particularly the bond market, which he notes as being in its worst condition ever. Combined with the underperformance of conventional investment strategies like the 60/40 portfolio, this paints a bleak picture of the financial landscape, further underscoring Bitcoin’s relevance as an alternative investment.\n\nAccording to Mallers, Bitcoin is “the only innovation” to solve the “central banking problem” and serve as a global reserve currency.\n\nEthereum is a “tech-play”\n\nMallers further stated that other cryptocurrencies like “Ethereum, Solana, and Dogecoin” should not be grouped together because they do not address the fundamental financial issues that Bitcoin can solve.\n\nHe referred to Ethereum as a “tech play,” suggesting that its value and utility are more aligned with technological innovation and adoption rather than serving as a stable financial instrument. He said Ethereum is more akin to a speculative investment, dependent on its technological success and acceptance in broader applications, such as finance and tech industries.\n\nMallers likened Ethereum to equities, comparing investing in it to investing in stocks like Tesla. He suggested that people might invest in Ethereum, hoping it will soar in value like high-performing stocks, based on technological advancements and leadership rather than its potential as a stable currency or store of value.\n\nHe also implied that Ethereum’s success and adoption depend on the acceptance and use of major financial players, like banks and institutional investors. This dependence on external factors contrasts sharply with his view of Bitcoin, which he sees as more autonomous and independent of mainstream financial systems.\n\nHis skepticism towards Ethereum stems from its history. He recalled a significant hack and instances where the Ethereum Foundation intervened in transaction processes.\n\nIn his view, these events cast doubt on Ethereum’s reliability and integrity as a financial instrument. He criticized the Ethereum Foundation for cherry-picking transactions in response to issues, which, according to Maller, undermines the predictability and trustworthiness essential in a financial system.\n\nMentioned in this article"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxPTE56Rnp0bUdmbHplZ1pjbjFlWXI3dkh6YXRCd3hSZ3NuWmdhX2RQYnVaWGFZRmdpZ250V1NWQ01CRkhVV194SmhUYnlMLUdrQWM1S0dnT0xvZWsyVjNTcXBQVWVtZ2FCaENwVkxRZ2NrSV9FQmFOQkZsVzNYeFhxdUVYRdIBiwFBVV95cUxPdE9Sckd1bWhkLXN4SVFqXzNQVHdRVDBTRlRzQTlGTzlVaFhkcXVxVkZETTlleERuWmg4TFkxajc3cXBvMHNaYVZmakJsMFppMTQycmt3aUVmazJRcWRiUjVNM0ZIWGkxM3BsUVhROXVDbW9mNGRvWnAwa1EyZ2RMcDVRd3I1UEpHcEY4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Donald Trump’s Ethereum Wallet Holds $1.1M in MAGA Meme Coin - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nYou never know when a huge pile of meme coins can turn into serious cash. Early Dogecoin (DOGE) investors know this well, as do Solana developers who received an airdrop of BONK. And the latest beneficiary of a meme coin glow-up is… former U.S. president Donald Trump?\n\nAn Ethereum wallet that blockchain analytics firm Arkham Intelligence previously tied to Trump, which holds a share of royalties from sales of the official Trump NFT collections, also holds over 579,000 MAGA (TRUMP) tokens. And a recent surge in price for the meme coins means that Trump’s holdings are valued at about $1.1 million as of this writing, as first reported by CoinDesk.\n\nThe TRUMP token has jumped 222% this week alone, per data from CoinGecko, and 689% over the past 14 days. Meme coins are famously volatile and can be driven by social media sentiment and real-world events, and Trump has racked up a pair of 2024 presidential primary wins in recent days as he attempts to win a second term in office.\n\nTrump’s wallet isn’t associated with the creation of the TRUMP token, and in many cases, meme coins inspired by celebrities and public figures aren’t created by the person in question. Instead, they’re often created anonymously in an effort to ride the wave of hype and FOMO.\n\nAD\n\nAD\n\nIn this case, Trump’s wallet was sent the sizable allotment of TRUMP tokens across multiple transactions in August and October 2023, per public blockchain data tracked by Etherscan. At the time of the largest transfer, on August 19, the 469,901 tokens received on that date were collectively worth approximately $5,670, per data from DexScreener.\n\nNow his stash of TRUMP tokens is valued at $1.1 million, making up the largest single holding in the Trump-affiliated wallet. Overall, it holds nearly $2.6 million worth of cryptocurrency as of this writing, including about $755,000 worth of Ethereum (ETH) and $731,000 worth of Wrapped Ethereum (WETH).\n\nIn December, the wallet dumped $2.4 million worth of ETH across a period of three weeks, following the launch of his third collection of NFTs minted on Ethereum scaling network Polygon. Only about half of the latest NFT collection has been minted so far, after the two previous collections both sold out.\n\nThe wallet was tied to Trump by Arkham last year following a financial disclosure notice from the former president, as the wallet receives royalties from the sale of his officially licensed NFTs.\n\nAD\n\nAD"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMi4gFBVV95cUxQbDRlTUk0SENRWEFvMXJQTE56VXRKUzdQZmJNTGpHZ1djdm9VMnhla1JRNmpUZ1JDZER1QTZRb0pkNThqS2JENUJBTWtpY1FYLVpLRjBVWjliQ0VPSDh3b3NuNU1JTkI5VHlkNUNqaXVUV0lrYlZJTXMwZ0tPdTFDVWxvRXpUODBULUlLN2RkTUlPLWx6azdyNEJZUjM5ckdtenB0WWhqaV9IdkllR2xFTzg3eWJzeUtHTmtRVnhkbFlwMUFfN2lzUjQ5VVc0TURhRC16T2pBS1k1aG1QanNsMlZ30gHnAUFVX3lxTFBvMWJwWnRXX1d0cFRwUnRWMWdUVUVwT3RaTFhVbG8zcnUyMUgyOWFod3hRd3hnQlBKSHZKOEwwamJIOEFIRlRyT25DS0NzS0FnYXB2aDd5RS0xS2o4eFJWU1Z0MVlOXzE5UmE4UjlyMTRzdzRaNFQ2VDBRQkNZRjlpd29mRnZfdTZhWDgwQ3N4UE1vV0wwSjMtVGRRUnFIWURtM3FITGF4S2NieHlYR3FnUG9xNlVnOVJ0SnMtb1piZ19vT1N4Wkd1bVJqV2pvbnlWZWZxbVRWQ0ZqT2dVbEVXZ0IybThpQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Analyst Says Ethereum Massive Bullish Reversal Signal Flashing, Updates Forecast on Bitcoin and One Low-Cap Altcoin - The Daily Hodl",
        "content": "A widely followed crypto strategist says that Ethereum (ETH) is giving off a bullish reversal signal when paired against Bitcoin (ETH/BTC).\n\nTrader Michaël van de Poppe tells his 685,700 followers on the social media platform X that he thinks Ethereum will outperform Bitcoin in the coming weeks.\n\nAccording to the analyst, ETH/BTC is flashing a bullish divergence on the weekly chart, indicating that the pair may be gearing up for a move to the upside.\n\n“I personally believe that Ethereum is going to outperform Bitcoin in the upcoming period and it has started since the ETF (exchange-traded fund) approval.\n\nMassive weekly bullish divergence created, but facing crucial resistance at 0.06 BTC ($2,385).\n\nSome more consolidation and then we’re likely going up.”\n\nLooking at the trader’s chart, he seems to think that ETH/BTC will rally to as high as 0.13 BTC ($5,168) sometime this year.\n\nAt time of writing, ETH/BTC is worth 0.05596 BTC ($2,224).\n\nAs for Bitcoin itself, Van de Poppe thinks BTC may fall to around $38,000 before finding support.\n\n“Bitcoin is at the range low and is actually in the area to be accumulated.\n\nAdditionally, this also means that altcoins are in stages to be bought as those 20-40% dips are a great opportunity.”\n\nAt time of writing, Bitcoin is trading for $39,800.\n\nVan de Poppe is also keeping a close watch on the price action of blockchain data-aggregator Covalent (CQT). According to Van de Poppe, CQT is likely headed to its next support level at around $0.15 before igniting a strong surge.\n\n“One of the latest runners has been TIA (Celestia), but competitors are likely to pace up momentum too.\n\nCQT is one of them. Market capitalization is relatively low and correcting, just like the entire market.\n\nThis provides opportunities and I think CQT is one before it reaches $0.42.”\n\nAt time of writing, CQT is trading for $0.214.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/PeachShutterStock/Spyro the Dragon"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxNZDdHYXA0ZWRCV2dmSTh4d3Q5RW1DLW5Tc3M1Nk9xOVp4cHlSRElJLTZpcXFSQUF2UzdSYkZwMnR3b3lSMDVLQjlJdHRINFRuT3E1NHNiaU9KdE9UMWNQaXFzR0ZSUUp6U1NTQlpoUmlyWm1yQUxlREgxVlJfanQzOU1UNjg2TjJ4cWRFenl2ODhETVBYdTFNS2k4R21PSnZ1SUdaUFAzMXoybU51SFhCSG9VS2tvTlg4dUNIaGM0Zkt6QdIBxwFBVV95cUxNMGxNV1ZaMTd6Ylg0V0FwSl9kOW1XUDJNZTd0azRYWUVqRGc0ZkJHZE51NG9yWkljUUdld3JqZUM2OFY1ZXZXVUd6TDh3WFZQd0xuS04yT3B0UDc1UFdjWHRfbGlaTm9LRUE1dFJDa0V0MFZ6aG1MVmNUZFp4aGNpWXBPXzh1Y1RZbFk4eXhqTnFTeFNEX3BJNVM0N0lQY0ZYVU9iR1hCVHNSNXVvLW1Yb0dBbjRSZjlNbGVKQ1d6NTBOcGY1MXNN?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Jan 2024 08:00:00 GMT",
        "title": "Crypto Trader Updates Outlook on Bitcoin and Ethereum, Says BTC’s Correction in ‘Final Stages’ - The Daily Hodl",
        "content": "A widely followed crypto analyst says Bitcoin’s (BTC) recent consolidation may now have an end in sight.\n\nCrypto trader Michaël van de Poppe tells his 686,100 followers on the social media platform X that BTC’s volatility is decreasing.\n\n“Bitcoin is getting toward the final stages of this correction.\n\nWe’re seeing volatility decrease from here, as the markets have witnessed a 20% correction in 10 days.\n\nThe range-low is still $36-39,000, and upward momentum to the halving is likely from here.”\n\nThe BTC halving is an event that slashes BTC miners’ rewards in half, reducing the amount of new supply hitting the market. The next halving is projected for April 2024.\n\nAccording to Van de Poppe, the recent approval of spot BTC exchange-traded funds (ETFs) is likely to have a positive effect on Bitcoin’s price soon.\n\n“The markets need to be more accurate with the impact of the ETF.\n\nThere’s some selling pressure in the short term, but in the long term, a massive amount of new money flows into the markets from new participants.\n\nAs a result, Bitcoin might push higher this cycle than we think.”\n\nBTC is worth $39,676 at time of writing.\n\nLooking at Ethereum (ETH), Van de Poppe predicts the leading smart contract platform will also gain steam over the coming weeks.\n\n“The momentum towards ETH is probably going to come in the next few weeks.\n\nArguments:\n\n– Bitcoin bottoming out is a trigger for altcoins to make a new run.\n\n– Ethereum Spot ETF hype.\n\n– Ethereum launching new upgrades to reduce 90% of the costs.”\n\nETH is worth $2,186 at time of writing.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Tithi Luadthong"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxNTjFxLVpKRVFRSTdkMUpzZjZmWnl2R1Fuenc0VG94QXJfVVdfQVpSdGNXeklZTnlnZjk0Y2o1ZW5YaUItZ21yS1FrZWFzLVpESUoxSTF5cHNLVG1ybjlhOFM2T1hySENfODc0Zm9FZndCdE5rdlBzWm1CRUtZbVo0ZGVYQ2U4cm9xNmlmaU92LTDSAZgBQVVfeXFMTjJiSnhpT1RNcmc4UjRmczZTd3c3WVVKTlh3c01wZVJjbFRYZE9RcU4yRndkS01NLXFMeTdXMHRiYmJsZU9oamoyNFVGdlpPakg0S0tCSXlrMVdGOTc0MlZ5Z1Q4bUJTSUZsZ2drN2h2NzR5clYtRUJCYUdzc05CV216d1VYeEZ3VzUyNWdyd1ZfcjZtVDZhYW0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Jan 2024 08:00:00 GMT",
        "title": "AltLayer Airdrop Puts $100 Million Into the Wallets of Ethereum Users - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAirdrop season continues on, and the latest sizable token distribution comes from the Ethereum ecosystem, thanks to AltLayer. The scaling protocol launched its ALT airdrop on Thursday, and the number of tokens offered up to eligible community members tops $100 million worth.\n\nALT is available now to claim for early AltLayer users and select ecosystem participants, and the token has already jumped 18% today to a current price of about $0.327, according to CoinGecko. It began at a price above $0.27 just after 5am ET.\n\nWith 300 million ALT tokens made available through this initial drop, that means that the total AltLayer airdrop is currently valued at just under $100 million. Airdrops are a way for crypto apps and protocols to both reward early users and contributors, while also decentralizing the governance process by distributing tokens to a wide array of holders.\n\nA rising number of crypto protocols have launched airdrops in recent months amid improving cryptocurrency prices and renewed optimism around the industry. Sizable airdrops of late include Solana’s Jito Protocol and Pyth Network, as well as Arbitrum gaming network Xai. Next week’s Jupter (JUP) airdrop on Solana will benefit nearly a million wallets.\n\nAD\n\nAD\n\nAltLayer is a decentralized protocol designed to let Ethereum developers deploy rollups and other scaling options, and is compatible with existing scaling networks like Arbitrum, Optimism, and Polygon. In addition to its open protocol, AltLayer offers a “rollups-as-a-service” feature to custom-build scaling integrations.\n\nNearly 500,000 wallets are currently eligible for the airdrop, which includes owners of AltLayer NFTs and participants in the protocol’s pre-launch testing and engagement campaigns. Users of EigenLayer’s restaking features can also claim ALT.\n\n📢Update: $ALT Airdrop Claims have now opened as of 9:00 AM UTC. https://t.co/LpfHsHu4Gk Those eligible for AltLayer Airdrop Season One - please visit the official airdrop website to claim your $ALT! Rest assured you will have one month to claim your $ALT tokens. https://t.co/zSYJw8gGt4 — AltLayer (@alt_layer) January 25, 2024\n\nFurthermore, Celestia (TIA) holders who stake the token will be eligible for the airdrop, but not yet. In a blog post this week, AltLayer cited “technical differences in the claiming mechanism” for delaying the airdrop claim for Celestia users, but promised that it’s still coming.\n\nAD\n\nAD\n\nThe ALT airdrop claim will be available until February 25, at which point any unclaimed tokens will be sent to the AltLayer treasury. Note that the airdrop is unavailable in certain territories, including the United States, Canada, China, and other countries listed in the blog post."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMi9AFBVV95cUxNLTU5RERvdkZNbDNCQWdRR2kxdzRWZmZ1LTZleG94VEluVmRneGtNd2RVUXBjdmJGVXNaUnMySlFxeXhOZGhHeU9EcnZlRHJ4UEl1alJOUkY4aUdjNjFzTHczUy11alhCTjM5WS0zUlFrR2FVdmRjUGtNbXVESVU4R0c2TzRralFtS0NoQ1lpbk50REFwWlU2R3BUZ2MyUTJOWS16NUxnVDQ5czlrSXJ2bWhka1JMWFdHY3ZLMWVYR2hvU1dGRV9wclN6ZlM3Uzl2aFdFODhqMUlfOHU1el90a3BQOGVtdWlscWdLQjViQ2J3eDJl0gH6AUFVX3lxTE91bXFVVVJZNmlSUGcwRkVuOTRPQUdNY0o3Ql9yWTdtNFBCMUpaaGpFY3VwdGNuaEZNR21vTkNmZ0J3TG5hQ3lpYVhTLUdqczVKTWc2YWxnRGtReUlkbW4wbDFJc1ZoVjJhWnh5YVBubnVZLVlTaHQ3XzVfYV9LVVJQcTBSc1E2VF9TWEtrclE3TVpPRU9RNXRvbXphU0I5Xy1PUkFqb2ROa2JYU3ZudWN5RjQ2UW5TYUdHb3BKWTBYQTNDemh4SWRPNjZmLXVObGlvbXJpVzFnVUhEMlk1SXdUQTJDY2J3ZG9qUC16SllwWW5ZN20tTWd0dFE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: BTC defies respectable correction, restores above $40,000 - FXStreet",
        "content": "Bitcoin price could make a move north if it closes above the $40,726 support on the three-day timeframe.\n\nEthereum price likely to fall 5% before inflection with uncollected liquidity residing below $2,135.\n\nRipple price looks poised for recovery after a double chance on the FVG.\n\nBitcoin (BTC) price is attempting a recovery barely 24 hours after speculation of a “respectable correction” that was expected to send BTC to the $35,000 range. Ethereum (ETH) price is yet to heed BTC’s cue, while Ripple (XRP) appears to have bottomed out.\n\nAlso Read: Bitcoin price could face short squeeze, analyst says, as FTX sells nearly $1 Billion of Grayscale spot BTC ETF\n\nBitcoin price fights to find a hinge\n\nBitcoin (BTC) price is pulling back after a strong rejection from the $48,000 psychological level. Despite a slippery slope, BTC has managed to reclaim the $40,000 psychological level after a range low of $38,555. BTC holders remain in murky waters until such a time when the price breaks and closes above the $40,726 support on the three-day timeframe.\n\nThe Moving Average Convergence Divergence (MACD) and Awesome Oscillator (AO) indicators remain in positive territory above their respective mean lines, inspiring hope for a possible move north.\n\nIf the bulls have their way, a decisive move above $40,726 would set the pace for Bitcoin price to breach $43,750, or in highly bullish cases, reclaim the $48,000 level. Overly ambitious outcomes could send BTC past the $50,000 psychological level, last tested in December 2021.\n\nBTC/USDT 3-day chart\n\nConversely, with the Relative Strength Index (RSI) below 50 and still southbound, Bitcoin price could extend the fall, potentially slipping past the $37,800 support. Losing this buyer congestion level could send BTC to the $30,000 psychological level.\n\nAlso Read: Bitcoin Price Outlook: Analyst anticipates $35,000 retest for BTC as part of ‘respectable’ correction\n\nEthereum price could extend the fall 5%\n\nEthereum (ETH) price may have an additional 5% in losses coming to test the $2,135 level, amid uncollected sell-side liquidity residing below this critical level. This level is critical for Ether market value, as it continues to hold Ether afloat after a prolonged consolidation since December 3.\n\nIt therefore marks a possible inflection point or another measure of quicksand to invalidate the prevailing bullish outlook.\n\nThe odds support the bearish thesis, suggesting the drop could come as the RSI is showing falling momentum as the MACD is subdued and moving in tandem with the signal line (orange band). The AO histogram bar is flashing red but still in positive territory, reinforcing the assumption that $2,135 will be critical in determining the next directional bias.\n\n\n\nETH/USDT 3-day chart\n\nIf the $2,135 support holds, the Ethereum price could bounce, with the potential to overcome resistance due to the midline of the channel as it targets the $2,800 level, 25% above current levels.\n\nAlso Read: Ethereum ETFs likely to get better deal than their Bitcoin counterparts\n\nRipple price likely to bounce from here\n\nRipple (XRP) price looks ready for recovery after a second retest of the Fair Value Gap (FVG) between $0.4927 and $0.5111. The RSI has tagged 30, suggesting XRP is oversold and a bullish correction may be due. A reentry by the bulls could see the Ripple price reclaim the support offered above $0.5442. In a highly ambitious case, XRP could extend the gains to the $0.5784 level. Beyond this, the next logical target for the XRP price could be the $0.6000 psychological level, standing around 16% above current levels.\n\n\n\nXRP/USDT 1-day chart\n\nOn the flip side, if the XRP price extends the fall below the midline of the FVG at $0.5029, the load-shedding exercise could extend with Ripple price likely to revisit the $0.4746 support, around 8% below current levels.\n\nAlso Read: XRP price could gain nearly 12% as on-chain metrics signal recovery"
    }
]