[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxNeElxRjZSUzBfb3ZpMnpOYlBCc2RPV1hmRVZSbV9CRGxVeHVDaU5QeHk1V0xYckQ4LUg0a2hDaWw1ZGw3N0ZiRWEwek1Ja3hpRHdtV0xpWXVSVFBNUVl4aWxYZzZZbUl4S0dZLVJrNEI1UlNWZWRRbjBaY1RpeVFCWWVRQk1VY2lyOE1nYktnZlRzS1BNMDdFT01uVQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 May 2024 07:00:00 GMT",
        "title": "Why Ethereum Gas Fees Have Fallen to Their Lowest Level Since 2020 - Unchained",
        "content": "The low price of transacting is a result of the flight of activity away from Ethereum’s base layer to its layer 2 networks, particularly following the Dencun upgrade that occurred in March.\n\nThe average cost of a transaction on Ethereum is at its lowest level since Jan. 2020 (one gwei represents one-billionth of one ether and is the unit of ETH used to measure gas prices). The decline reflects the movement of activity from Ethereum’s base layer to its expansive array of Layer 2 solutions.\n\nMoreover, the release of the Dencun upgrade, which significantly reduced fees for those layer 2 networks, has only intensified this trend of lower transaction costs. Gas prices on Ethereum have decreased about 92% from about 63 gwei on March 12, the day before the upgrade, to around 5 gwei at presstime, data from blockchain explorer Etherscan and analytics investment platform Ycharts shows.\n\nAccording to layer 2 watchdog platform L2Beat, the number of active and upcoming L2 projects collectively stands at 95. Over the past several months, users have significantly increased the amount of crypto assets they’ve bridged over to various layer 2 scaling rollups. And of the L2s, the top ones by total value locked—namely, Arbitrum, Optimism, and Base – have seen a spike in active daily addresses, signs of increasing user activity.\n\nRead More: Vitalik’s New EIP-7702 Draws Early Support; Could Be Included in Ethereum’s Next Hard Fork Upgrade\n\n“We can certainly see a trend upwards on EVM compatible chains of daily active addresses, which means users are going to cheaper alternatives. Looking at bridge data also confirms this, as bridge activity across Layer 2s has increased from ~$170mn per week to ~$300mn per week,” Andrew Van Aken, a data scientist at blockchain analytics firm Artemis, said in a Telegram message to Unchained.\n\nAdditionally, Ethereum has seen over $3 billion in net outflows of ETH over the past three months, per Artemis, with the majority of the flows going to L2s such as Arbitrum, zkSync, Base, Starknet, and Optimism.\n\nThe decrease in Ethereum’s transaction costs is “a reflection of the constant evolution of blockchain. Initially Ethereum served as the universal layer for all apps, from decentralized exchanges, to games, to trading memecoins, wrote Justin, CEO of decentralized perpetual futures platform Vest Exchange, in a Telegram message to Unchained. “However, with the advent of Layer 2 solutions and app chains, builders and users (and MEV bots) are realizing that there are tailored ecosystems for specific use cases. In return, we also see Ethereum to be transitioning moreso as a foundational security layer and for supporting more ‘passive’ protocols such as lending and LSTs.”\n\nEthereum Post-Dencun Upgrade\n\nDencun, the most recent Ethereum hard fork that brought several codebase changes, went live on mainnet on March 13.\n\nWhile the number of transactions has remained stable at just over one million per day, the amount of fees paid by end users of Ethereum has plummeted since Dencun, per Artemis.\n\nWith less overall transaction fees, the amount of ETH burned has gone down as well. According to Ethereum analytics platform Ultra Sound Money, the amount of ETH issued in the past thirty days is more than the amount of ETH burned, one outcome of the Dencun upgrade.\n\n“The new supply of ETH is now growing at the fastest daily rate since the Merge as fees burned plummeted as a consequence of the Dencun upgrade,” analysts at blockchain analytics firm CryptoQuant wrote in a report published on Wednesday.\n\nThe price of ETH reached a multi-year high of $4,000 on the day of Dencun, but has since dropped roughly 25% to around $3,015 at the time of publication, data from CoinGecko shows."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiaEFVX3lxTE9EMk9SbkZnVUdhVEZaOC1scnVqVThwNFRjYXJfU0hiOGlLY0xlSTdCZkYwWEZrX0RicEJMNlF5VGVLUmpBZGUxSGtTSXQxUmR1UmhYTDRlWXdjbGNBWGtycU94MDlrUm4t?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 May 2024 07:00:00 GMT",
        "title": "MEV collected by validators is now higher on Solana than on Ethereum - Blockworks",
        "content": "Solana’s validators are a bit like baristas flipping around an iPad — they’re nicer to you when you include a tip. And as traders keep cramming into Solana’s metaphorical coffee shop, the validator tip jar looks increasingly stuffed with money.\n\nValidators are a group of 1,728 computers that run software to produce blocks on the Solana blockchain. Coinbase Cloud is a prominent Solana validator, as is Google Cloud. One revenue stream that validators earn is called maximal extractible value (MEV), which refers partly to tips paid by searchers to be included in Solana blocks.\n\nThis MEV revenue has been growing quickly since mid-March. Notably, Solana validators are earning more from MEV overall than Ethereum validators, according to Blockworks Research. Just a few months ago, Solana’s MEV revenue was a rounding error compared to Ethereum’s.\n\nRead more: MEV doesn’t have to be a zero-sum game, research suggests\n\nBroadly defined, MEV refers to the largest amount of value that validators can create by packing transactions into blockchain blocks. Blockworks Research’s dashboard suggests Solana validators raked in a hair under $7 million from MEV last week.\n\nAt the moment, Solana MEV is almost entirely the product of a protocol named Jito. Jito offers a fork of the Solana validator called Jito-Solana, and 78% of Solana’s validators use this client, according to Jito’s website. The client lets searchers, or traders, arrange transactions in bundles. Searchers can include a tip to try getting validators to send their particular bundle to the blockchain.\n\nWhether all this is good for Solana is something of a matter of perspective. Some forms of MEV can be predatory. Jito recently suspended its mempool, a kind of waiting area for transactions, due to “sandwich attacks” that let opportunists create MEV by trading right before and after a transaction to manipulate the price and take profit from the trader.\n\nRead more: Jito Labs ends mempool functionality citing impact on Solana users\n\nIn Jito’s telling, the protocol is making Solana more efficient while also minimizing negative forms of MEV like sandwich attacking. If it can pull that off, Solana could see a lot of benefit.\n\nContinued long-term growth in Solana’s MEV would likely imply that less spam is being included in blocks, and Solana would have more available blockspace, Blockworks Research analyst Hayden Tsutsui said. In a best case scenario, more blockspace could free up room for more on-chain activity, which could also bring along more liquidity, Tsutsui said.\n\nBut it bears mentioning that as things currently stand, Solana is still staggering under a mountain of spam. More than 60% of non-vote transactions fail on Solana, according to Blockworks Research, largely due to bots taking advantage of Solana’s cheap fees by inundating the network in hopes of getting transactions to land.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE9qSWxZUG51VnhmbUxYal9VNEVMZTFoS3pOU2hQWjBlM0ZpVVJ4ektUTjNZc1M4TGFXSG5vM2dBYW5kbm9mR01iSWR2elpDSFpidW5ZZmp0cWU1QjJzRFhlamZTXzFJc1lRRkptMGJWZFliMXBFRHN5ekZQMS1OLU0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 May 2024 07:00:00 GMT",
        "title": "Solana Gains 5%, While Bitcoin and Ethereum Experience Minor Dips - Yahoo Finance",
        "content": "Solana Gains 5%, While Bitcoin and Ethereum Experience Minor Dips\n\nWhile most of the top cryptocurrencies are trading sideways or slightly down, Solana (SOL) stands out with a nearly 2.28% increase over the past day. According to CoinMarketCap data, Solana is currently trading at $155.03, marking a week-long gain of over 20.36%. Despite a turbulent month that saw its value swing from a high of $184 to a low of nearly $120, Solana has been steadily climbing in the past week, outpacing the gains of Bitcoin and Ethereum.\n\nIn contrast, Bitcoin remained flat over the past 24 hours, trading at $63,618, while Ethereum has dipped slightly by 0.84% to $3,075. Over the past week, Bitcoin has seen a modest increase of 4.05%, while Ethereum is up 2.20%.\n\nAmong the top 100 coins by market capitalization, a couple of notable gainers are in the Solana ecosystem. Jupiter's token, JUP, which serves as a decentralized exchange aggregator, has risen 25% over the past week to reach a price of $1.14. Additionally, leading Solana-based memecoin Dogwifhat (WIF) has experienced an over 35% increase over the past 7 days, reaching $3.28.\n\nSolana's recent resurgence coincides with a surge in new tokens deployed on the network using the SPL standard. On Saturday alone, a record-breaking 14,648 new tokens were deployed on Solana, as reported by Solscan. This trend has continued for the past two weeks, with at least 10,000 new tokens being introduced on the network each day."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMi5AFBVV95cUxNdkJtY2NKX2pzaFlkVTh1aGlqY2plcndNbWdjbTVRNkl2WFkyN0MzT3ZxeFdVRU1DXzkxdkxVU0FtSU5LUUhyWHFiZGFsWWpBSFA2MWwtR2JHSU5PdDRvRHdBczRKMXhkOFFQYXQxa0FId3V6WVZiWktkM1p1ZXZmVDliejhmRVNpcVRSRWFOdjFVdDRQYmdyaXNuRnA1ZnR0VFhaYkZ4Ny1JV1hHeUgyZElUSHZFRk4tMXcxeTBfZFpQZW5MNDFGa1FIR0tKdmJsVmNWUklJeGdIVnBxbTJaLXFFelTSAeoBQVVfeXFMTjdxZk9IdElPTl9FaVMwSm1EYW15OTdfaU1NMUJFdGtJMGlZMm5uM0VjX1pXTERrX3NwWnBzMjRvNkcybDZQZEdpeFBEdVoxNHY1WlF0NjIxUnBRVUtvN2lKZmxFY0kwZEdFSjg0Vm1mcWdaNVVNODZmWGZaa2psaGtaX0R3SnVmMWhzN3J4RkpYdTV4d3NBYzNCVm5Eb2xVZHM5ekQ3d0V3RWhJLTRLb2dkeGk2R284YS1JUEYxejRseDVxdVk4OS1JeGRTMXhMTkZmdnU1Q25LNHE0Sjl1TGZpY19RVm0yMkVn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 May 2024 07:00:00 GMT",
        "title": "Ethereum could experience bullish run, ETH ‘ultrasound’ money narrative at risk - FXStreet",
        "content": "Ethereum’s ‘ultrasound’ money narrative is at risk after the Dencun upgrade, said CryptoQuant.\n\nEthereum's EIP-7702 would address concerns raised about the previous EIP-3074.\n\nEthereum's recent price action suggests it may be gathering momentum for a bullish run.\n\nEthereum (ETH) price action on Wednesday shows it could be gathering momentum for a rally as a recent report from CryptoQuant reveals its ultrasound money narrative is at risk. Also, the number one altcoin's co-founder, Vitalik Buterin, and co-authors have published Ethereum Improvement Proposal (EIP) 7702 as an alternative to EIP-3074.\n\nRead more: Ethereum resume sideways move as Grayscale files to withdraw Ethereum futures ETF application with the SEC\n\nDaily digest market movers: Ultrasound money, EIP-7702, Ethereum Foundation\n\nEthereum is set to see interesting updates on its blockchain following recent developments. Here are key market movers for the top altcoin:\n\nA recent report by CryptoQuant highlights that Ethereum is becoming inflationary following the Dencun upgrade in March. After the Merge that saw Ethereum transitioning from a Proof-of-Work (PoW) to a Proof-of-Stake consensus mechanism, the network began burning gas fees at a significant rate that saw a significant reduction in the growth of ETH's circulating supply.\n\nHowever, since the Dencun upgrade, when the introduction of \"blobs\" reduced Ethereum's network activity to boost its scalability and reduce user fees, the amount of gas fees burned has reduced significantly.\n\n\"Before the Dencun upgrade, the higher network activity on Ethereum meant higher fees burned and hence less ether supply. However, after the Dencun upgrade, the total amount of fees burned has decoupled from the network activity,\" noted CryptoQuant. As a result, this puts ETH's 'ultrasound' money narrative at risk since its circulating supply would begin increasing over time.\n\n\"We conclude that, at the current rate of network activity, Ethereum will not be deflationary again, and the narrative of 'ultrasound' money has probably died or would need much higher network activity to come back to life,\" said CryptoQuant.\n\nFurthermore, following several concerns raised about EIP-3074, which was considered for inclusion in the upcoming Pectra upgrade, Ethereum co-founder Vitalik Buterin and co-authors Sam Wilson, Ansgar Dietrichs and Matt Garnett proposed EIP-7702 as an alternative.\n\n3074 = upgrade for normal \"EOA\" wallets to give some smart wallet functionality\n\n4337 = standard for smart contract wallets\n\n\n\n3074 was slated for inclusion, v likely worried the long term implications of\n\n1) compatibility btwn 3074 and 4337 wallets\n\n2) 3074 breaking in a future… — hayden.eth (@haydenzadams) May 7, 2024\n\nEIP-7702 introduces a new transaction type that would allow externally owned accounts (EOAs) to temporarily act as smart contracts during a transaction. Like EIP-3074, the new proposal would enable better ways to abstract gas fees, batch transactions, and improve the user experience. However, it goes further by improving compatibility with the ERC-4337 standard for smart contract wallets — an issue with EIP-3074 — and being more future-proof.\n\nSome crypto community members have speculated that EIP-7702 would replace EIP-3074 in the upcoming Ethereum Pectra upgrade. One X user commented, \"I think it would probably make more sense to include in Pectra than 3074.\"\n\nFireblocks' VP of Technology Arik Galansky also commented on the proposal saying, \"It's a long while since Ethereum introduced changes that are user-oriented rather than scaling-oriented and this one is right on point.\"\n\nA few weeks ago, EIP-3074 sent the AA world into shambles.\n\n\n\nInitially it looked like it's synergetic with ERC-4337, since they do different things. One enables EOA migration, another enables decentralized mempools.\n\n\n\nHowever, the nitty gritty details looked suboptimal: it's hard… — Ivo e/acc (@Ivshti) May 7, 2024\n\nAlso read: Ethereum traders show uncertainty, SEC delays decision on Invesco's ETH ETF application\n\nMeanwhile, the Ethereum Foundation appeared to be dumping ETH again on Wednesday following a transfer of 1,000 ETH worth $3 million to middle multisig address 0xbc9, according to data from Spot On Chain.\n\nThis transfer is the latest action in a larger trend where the Ethereum Foundation has sold 1,766 ETH for 4.81 million DAI stablecoin at ~$2,725 since the beginning of 2024. The ETH sales, done in small batches through the same middle multisig address 0xbc9, often coincide with brief Ethereum price declines, noted Spot On Chain.\n\nETH technical analysis: Ethereum could be gathering momentum for a bullish run\n\nThe market remained quiet on Wednesday as Ethereum continued trading around the $3,000 mark. Despite the calm market, ETH derivatives volume in May has risen higher — close to 60% — than that of Bitcoin, according to QCP.\n\nRead more: Ethereum could see a brief rally despite Michael Saylor's jab at ETH ETFs\n\nThe reason for the increase may be the market pricing in volatility over the Securities & Exchange Commission's (SEC) upcoming decision on Van Ecks' spot ETH ETF application on May 23, noted QCP. This also explains why the market is slightly tilted toward a downward movement as many expect the SEC to deny spot ETH ETF applications.\n\nWhile current price action indicates ETH may continue a horizontal movement in upcoming weeks, historical data suggests the largest altcoin could be gathering momentum for a bullish run. Considering ETH has remained in the $2,852 to $3,300 range for nearly a month, it could attempt a sustained breakout above the upper level of the range if it sees a slight bullish trigger.\n\nETH/USDT 4-hour chart\n\nOnchain data also shows most whales have been accumulating ETH around this range in anticipation of a price rally. A bearish event could see it break below the lower level of the range briefly, presenting a buying opportunity.\n\nEthereum is trading at $3,013 on Wednesday, May 8, down 0.7% on the day."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiX0FVX3lxTE0zNXZBWXd1NS1DUFd3SFd5V3FJWnlqV1lEVU53TkN3Tzc4bU95WnNRLXptTW5EMEpUQXE3d0p4WFdyektHemI3QUI1UjRuN0tXLWVKUUVhVGVOZUREdktV?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 May 2024 07:00:00 GMT",
        "title": "51% Attack: Definition, Who Is At Risk, Example, and Cost - Investopedia",
        "content": "What Is a 51% Attack?\n\nA 51% attack is an attack on a cryptocurrency blockchain by an entity or group that controls more than 50% of the network. If a party were to gain this much control of a network, it would have the power to alter the blockchain.\n\nThe attackers would be able to prevent new transactions from gaining confirmations, allowing them to halt payments between some or all users. They would also be able to reverse non-confirmed transactions that were completed while they were in control. Reversing transactions could allow them to double-spend coins, one of the issues mechanisms like proof-of-work were created to prevent.\n\nKey Takeaways Blockchains are distributed ledgers that record every transaction made on a cryptocurrency's network.\n\nA 51% attack is an attack on a blockchain by an entity or group that controls more than 50% of the network.\n\nAttackers with majority network control can interrupt the recording of new blocks by preventing other miners from completing blocks.\n\nChanging historical blocks is impossible due to the chain of information stored in Bitcoin's blockchain.\n\nAlthough a successful attack on Bitcoin or Ethereum is unlikely, smaller networks are frequent targets for 51% attacks.\n\nUnderstanding a 51% Attack\n\nA blockchain is a distributed ledger—essentially a database—that records transactions and information about them. The blockchain's network reaches a majority consensus about transactions through a validation process. The blocks where the data is stored are sealed. The blocks are linked together via cryptographic techniques where previous block information is recorded in each block. This makes the blocks nearly impossible to alter once they are confirmed enough times.\n\nThe 51% attack is an attack on the blockchain, where a group controls more than 50% of the hashing power—the computing that solves the cryptographic puzzle—of the network. This group then introduces an altered blockchain to the network at a very specific point in the blockchain, which is theoretically accepted by the network because the attackers would own most of it.\n\nChanging historical blocks—transactions locked in before the start of the attack—would be extremely difficult even in the event of a 51% attack. The further back the transactions are, the more difficult it is to change them. It would be impossible to change transactions before a checkpoint, where transactions become permanent in Bitcoin's blockchain.\n\nAttacks Are Prohibitively Expensive\n\nA 51% attack is a very difficult and challenging task on a blockchain network with a large participation rate. In most cases, the group of attackers would need to be able to control the necessary 51% and have created an alternate blockchain that can be inserted at exactly the right moment. Then, they would need to out-hash the main network. The cost of doing this is one of the most significant factors that prevent a 51% attack.\n\nFor example, one of the most advanced application-specific integrated circuit (ASIC) miners is the WhatsMiner M63S. It costs more than $10,000 (new) and has a hash rate of 406 terahashes per second (TH/s). A single or smaller group of miners would not be able to alter and mine the Bitcoin blockchain with only a few of these machines. It would take thousands of these ASICs to get ahead of the Bitcoin network. Smaller networks could be out-hashed using these mining rigs, but the benefits of doing so wouldn't outweigh the costs of funding the attack and setting it up.\n\nHashing power rental services provide attackers with lower costs, as they only need to rent as much hashing power as they need for the duration of the attack.\n\nAfter Ethereum transitioned to proof-of-stake, a 51% attack on the Ethereum blockchain became even more expensive. To conduct this attack, a user or group would need to own 51% of the staked ETH on the network. It is possible for someone to own that much ETH, but it's unlikely.\n\nAccording to Beaconchain, more than 32.3 million ETH were staked on May 8, 2024. An entity would need to own and stake more than 16.5 million ETH (more than $49 billion as of May 8, 2024) to attempt an attack.\n\nOnce the attack started, the consensus mechanism would likely recognize it and immediately slash the staked ETH, costing the attacker an extraordinary amount of money. Additionally, the community can vote to restore the \"honest\" chain, so an attacker would lose all of their ETH just to see the damage repaired.\n\nAttack Timing\n\nIn addition to the costs, a group attempting to attack the network using a 51% attack must not only control 51% of the network but also introduce the altered blockchain at a very precise time. Even if they own 51% of the network hashing rate, they still might not be able to keep up with the block creation rate or get their chain inserted before valid new blocks are created by the 'honest' blockchain network.\n\nAgain, this is possible on smaller cryptocurrency networks because there is less participation and lower hash rates. Large networks make it nearly impossible to introduce an altered blockchain.\n\nDespite the name, it is not necessary to have 51% of a network's mining power to launch an attack. However, such an attack would have a much lower chance of success.\n\nOutcome of a Successful Attack\n\nIn the event of a successful attack, the attackers could block other users' transactions or reverse them and spend the same cryptocurrency again. This vulnerability, known as double-spending, is the digital equivalent of a perfect counterfeit. It is also the basic cryptographic hurdle blockchain consensus mechanisms were designed to overcome.\n\nSuccessful 51% attackers may also implement a Denial-of-Service (DoS) attack, where they block the addresses of other miners for the period they control the network. This keeps the \"honest\" miners from reacquiring control of the network before the dishonest chain becomes permanent.\n\n\n\nWho Is at Risk of 51% Attack?\n\nThe type of mining equipment is also a factor, as ASIC-secured mining networks are less vulnerable than those that can be mined with GPUs; they are much faster. Cloud services such as NiceHash—which considers itself a \"hash-power broker\"—theoretically make it possible to launch a 51% attack using only rented hash power, especially against smaller, GPU-only networks.\n\nBitcoin Gold has been a common target for attackers because it is a smaller cryptocurrency by hashrate. Since June 2019, the Michigan Institute for Technology's Digital Currency Initiative has detected, observed, or been notified of more than 40 51% attacks—also called chain reorganizations, or reorgs—on Bitcoin Gold, Litecoin, and other smaller cryptocurrencies.\n\nAre the Odds of a Bitcoin 51% Attack Growing?\n\nOn May 8, 2024, the Bitcoin network's total hashrate was 569.29 exahashes per second (EH/s). The top three mining pools by three-day hashrate were:\n\nFoundryUSA, at 175.76 EH/s; 30.9% of the total Bitcoin network hashrate\n\nAntPool, at 161.77 EH/s; 28.4% of the total Bitcoin network hashrate\n\nViaBTC, at 73.11 EH/s; 12.8% of the total network hashrate\n\nCombined, these three pools made up 72.1% of the network hashrate, a whopping 486.9 EH/s (486.9 million TH/s—the CPU in your computer might be able to hash at about 15 kilo hashes per second). If Foundry and ViaBTC were to collude, they could take over 51% of the hashrate (248 EH/s).\n\nFoundry and Antpool combined could control 69.3% of the network. Because these pools use platforms to connect pool members and manage workloads, if the managers decided to take control they could issue work orders to their pools to work on the altered chain. The pool's miners would have no idea which chain they were working on since their mining rigs automatically work on whatever task they are given.\n\nEven more concerning is that these three pools also monopolize the majority of the network hash rates for Bitcoin Cash, Litecoin, and Bitcoin SV.\n\nThese pools have been operating for several years without issue, but the fact remains that they already control most hashing power of the minable and profitable cryptocurrencies.\n\n\n\nWhat Does a 51% Attack Do? A 51% attack alters blocks that are being added to the blockchain, giving the attackers the ability to create or alter transactions for the period they are in control.\n\nHas a 51% Attack Ever Happened? Yes. Several blockchains have been attacked using this method, but they had small networks, were new, or had other vulnerabilities that made it possible.\n\nHow Much Would a 51% Attack on BTC Cost? If a large mining pool was directed by its managers to conduct an attack, it wouldn't cost the managers much at the time of the attack. However, it would likely lose its honest miners once they found out about it. For a single person or group to conduct a 51% attack, they would need more than 304 EH/s of computing power. This is an enormous cost considering the fastest miner hashes 406 TH/s and costs more than $10,000 per unit (about 84,000 units).\n\nThe Bottom Line\n\nA 51% attack is the unlikely event that a group will acquire more than 50% of the hashing power of a cryptocurrency network. These attacks happen on smaller crypto networks, but tend to fail on larger ones like Bitcoin because they are more secure.\n\nThe comments, opinions, and analyses expressed on Investopedia are for informational purposes online. Read our warranty and liability disclaimer for more info.\n\n"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxOdTV0ZzRMbVZvdnMtMnloR0ljcHFXMjdVQk10eVJrNGJVbEdFZjlIYjRlcWVubzBFWTZZYkg2a2UxRi1ra0NJUEl4RWNKLXdrNFlYNm1ndi1YT2lSam85NDNvZ0JHUFQ1LUJ2Z2FfUkNoanR2d1Z3eGgxREk3ZGZLNl9DUEpJZ3gyenhFdGhKOVQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 May 2024 07:00:00 GMT",
        "title": "Solana Surges as Ethereum Struggles: Can Furrever Token Mirror SOL's Success With the Help of $10,000 Competition? - Yahoo Finance",
        "content": "Furrever Token\n\nNew York, NY, May 08, 2024 (GLOBE NEWSWIRE) -- During turbulent times in the cryptocurrency market, where uncertainty looms large and volatility reigns supreme, certain tokens defy the odds and chart their path to success. Solana stands tall, riding a wave of surging momentum, while Ethereum grapples with its challenges, struggling to maintain its position amidst the chaos. Yet, amidst this backdrop of fluctuating fortunes, a beacon of excitement and opportunity emerges: Furrever Token (FURR). As Solana's meteoric rise captures headlines and Ethereum's struggles dominate discussions, FURR enters the fray with a sense of ambition and optimism fueled by the promise of its unique charm and a compelling $10,000 competition.\n\nEthereum ETF Decision Delay Sparks Volatility: SEC's Latest Move Sends ETH on a Rollercoaster Ride\n\nThe US Securities and Exchange Commission (SEC) has once again postponed its decision on the proposed Invesco Galaxy Ethereum exchange-traded fund (ETF), extending the deadline to July 5, 2024. This announcement has triggered a downturn in Ethereum's (ETH) price, adding to the uncertainty surrounding the approval of Ethereum ETFs. With major financial institutions like Grayscale, Franklin Templeton, VanEck, and BlackRock also awaiting regulatory clarity, the market response has been marked by slight downward pressure on ETH, particularly among short-term traders.\n\nDespite briefly breaching the critical resistance level of $3,220, Ethereum has seen a decline of approximately 4% today. The volatility has led to significant liquidations among long traders, totaling $67.42 million, indicative of a cautious sentiment among investors amid regulatory uncertainties. As attention remains focused on further updates from regulatory authorities, Ethereum's trading volume has surged by over 66% in the past 24 hours, reaching $13.78 billion, highlighting the market's keen interest in developments impacting ETH's price.\n\n\n\n\n\nSolana Surges: Breaking Trends and Charting New Heights\n\nSolana (SOL) has experienced a notable uptick in its price, currently standing at around $158.12, marking a 1.5% increase from yesterday. This surge follows a significant breakthrough that has caught the attention of investors and analysts alike. Solana has signaled a potential reversal of its previous bearish trend by successfully breaching a key trendline resistance, instilling confidence in its upward trajectory.\n\nThe next obstacle in its path is the 26-day Exponential Moving Average (EMA), historically a formidable resistance level. Should Solana surpass this barrier, it could pave the way for further gains, potentially reaching the 50-day EMA at around $163.29. This technical achievement underscores Solana's resilience and heralds the possibility of a bullish phase, reinforcing its position as a compelling investment option in the crypto market.\n\n\n\n\n\nStory continues\n\nFurrever Token (FURR)'s Path to Success: Leveraging Community Engagement and a Lucrative Competition\n\nFurrever Token (FURR) is positioned on the brink of mirroring Solana's triumphs, propelled by its inventive strategy and recent strides in community engagement. With its mission grounded in fostering a warm and inclusive ecosystem, FURR has captivated investors and enthusiasts, boasting a vibrant community and rapid organic growth. Currently priced at $0.000648, FURR offers investors the potential for up to 15X returns, further enhancing its appeal in the market.\n\nThe recent unveiling of the Furrever Token $10,000 Frenzy Bonanza Competition is pivotal in FURR's journey toward success. This competition represents more than just a mere event; it embodies FURR's commitment to community involvement and excitement. Participants are invited to partake in simple tasks on the Gleam platform, accumulating points and increasing their chances of winning substantial rewards. With a $10,000 prize pool up for grabs, the competition ignites fervor within the FURR community and attracts new participants eager to be part of the excitement. However, time is of the essence, as there are only two days left to join, adding a sense of urgency and encouraging enthusiasts to act swiftly to seize this opportunity.\n\nMoreover, the competition's strategic significance extends beyond mere rewards. By incentivizing participation and rewarding community engagement, FURR aims to solidify its position as a leader in the market. The competition fosters long-term loyalty and enthusiasm among its supporters, laying the groundwork for sustained growth and success. As FURR harnesses the momentum generated by the competition, it sets its sights on a future defined by innovation, prosperity, and unwavering community support.\n\n\n\nJoin Furrever Token Presale Now:\n\n\n\nFurrever Token Official Website\n\n\n\nVisit Furrever Token Presale\n\n\n\nJoin Furrever Token $10,000 Bonanza Competition\n\n\n\nJoin Official Telegram Group\n\n\n\nFollow Official X Account\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\nCONTACT: Media Contact: Robert Smith https://furrevertoken.com/ support(at)furrevertoken.com\n\n\n\n"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxOQnFxSTByVEpCaXNHaWh4VTVJakdlMkpiREFIejNUWjZ4UV9Ud0xsRWl2TDhSMnlwblRnemg0THZpNVJfbXh4VzJWRUlUQzBGZ2c2TGlFQ0lMSjVjSDlUSWk2QmJzQVhSMXhIclJmRmdzaGZ3dWNYUFJpUGE1VDhOTDJ4Y1FlRi1BZFBGNGpYNDE1Uy1WR2hGRDUzY1FDMlFrTzczdFdRTzhEN0hCSzI0MF9aNUtOLTdjakxCeGQ5YmM4UQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 May 2024 07:00:00 GMT",
        "title": "Vitalik’s New EIP-7702 Draws Early Support; Could Be Included in Ethereum’s Next Hard Fork Upgrade - Unchained",
        "content": "EIP-7702, which is meant to enable externally owned accounts to temporarily become smart contract accounts, was largely the result of intense discussions among Ethereum builders over previous improvement proposals.\n\nEthereum Improvement Proposal (EIP)-7702 has seen increasing support among developers, builders, and researchers less than a day after Ethereum co-founder Vitalik Buterin and three additional authors proposed it, a potential sign the EIP will be included in the next hard fork upgrade.\n\nEIP-7702 enables “flash smart wallet accounts,” which are externally owned accounts (EOAs) that become smart wallets, temporarily for one transaction. EIP-7702, wrote Jarrod Watts, developer relations engineer at Polygon, on X is “one of the most impactful changes Ethereum is going to have… EVER.”\n\nEOAs are controlled by their corresponding private key held by people, while smart contract accounts are governed by coding logic.\n\nThe introduction of EIP-7702 comes as the Ethereum community has had ongoing conversations about the most optimal path to what’s called “account abstraction,” in which all externally owned accounts become smart account wallets.\n\nEIP-3074 and EIP-4337\n\nSpecifically, the Ethereum community has been going back and forth about EIP-3074 and EIP-4337, both of which are intended to improve Ethereum’s security and user experience.\n\nEIP-4337, which was deployed on mainnet Ethereum in March 2023, aims to achieve account abstraction “without changes to the consensus layer protocol of Ethereum,” by enabling smart contracts to act as accounts, according to EIP-4337’s GitHub page.\n\nWhile deployed on mainnet for over a year, the problem with EIP-4337 is that “EOAs are still the most used type of account by far,” Watts wrote on X.\n\nThe lack of migration among current users from EOAs to smart contract accounts is occurring for two reasons, according to Watts: people don’t have a way to convert their EOA to a smart contract account, and they also suffer from “a lack of native support by Web3 apps to connect smart contract accounts.”\n\nAs a result, Ethereum developers looked to EIP-3074 to solve these problems. According to its GitHub page, EIP-3074 allows “externally owned accounts to delegate control to a contract.” It’s meant to provide short-term functionality improvements to EOAs and act “as a stepping stone toward full [account abstraction],” said Lukas Schor, co-founder of wallet infrastructure maker Safe, in a conversation with Unchained.\n\nRead More: EIP-3074 vs EIP-4337: Ethereum Developers Disagree on Endgame for Account Abstraction\n\nWhile some were ecstatic about EIP-3074’s planned inclusion in the next Ethereum hard fork upgrade, others were not. According to the authors of EIP-7702, EIP-3074 not only introduces new opcodes that would have no use in a world where all users are eventually using smart contract wallets, but also leads to fragmentation.\n\nEIP-7702, which according to Schor does what EIP-3074 is attempting to do, but better— namely, improving the current user experience for those transacting onchain, as well as being a step in the right direction towards account abstraction including converting all existing Ethereum users’ accounts into smart accounts.\n\nEIP-7702 “modifies EIP-3074 to make it leaner and more compatible with ERC-4337…so that we don’t end up with two separate [account abstraction] ecosystems,” Watts wrote on X. Per its GitHub page, EIP-7702 has forward compatibility with future account abstraction, because “the contract code that users would need to sign could literally be existing ERC-4337 wallet code.”\n\nAs such, Schor thinks EIP-7702, despite its nascent status, will be included in Ethereum’s next hard fork upgrade, dubbed “Petra.” He indicated that EIP-7702 is not only favored by EIP-3074 proponents because it solves the same issues they want such as a better user experience for existing users, but is also “quite liked” by EIP 4337 proponents because of its compatibility.\n\nEIP 7702 feels like an approach to improving EOAs that is more aligned with smart accounts and generally more future proof: https://t.co/Dmx47ZTaYU I think it would probably make more sense to include in Pectra than 3074 — konradkopp.eth (@abstractooor) May 7, 2024\n\nQuantum Resistance\n\nEIP-7702 also seeks to address the potential problem stemming from the advancement of quantum computing, superpowered computers that rely on quantum mechanics.\n\nSome Ethereum developers have become concerned about the possibility that in 5 to 10 years, quantum computing will progress to the point where it can break the cryptographic algorithms called ECDSA used to generate private keys, compromising the security of a blockchain network. ECDSA, an acronym for “elliptic curve digital signature algorithm,” is widely used in many Ethereum-based crypto protocols to verify digital signatures for transactions.\n\n“The only way to move away from that is to not have ECDSA based private keys controlling user wallets, and that is solved by moving users to smart accounts [through EIP-7702], because then you can use different cryptographic curves [and] different signing schemes that are much stronger cryptographically and are quantum resistant,” said Schor."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTE1UckVPQmlCLUpXVHN2VnBjbzI1Rlg3SS1wUUhtRmJXRWM3cV9HSWtPTV95dHFNRFNpUU13c2MtWGpWeFY5WmQxbkNrMmY5dE0xaHNoQUt1c3ZLU1M5TTFqTklkZnB6bzIwNWNFOHo3NVBaXzZh?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 May 2024 07:00:00 GMT",
        "title": "Shiba Inu Eyes $0.001 Amidst Supply Challenges, Ethereum Targets Uptrend with EIP-7702, Furrever Token Rallies Community with $20,000 Competition - Yahoo Finance",
        "content": "Furrever Token\n\nNew York City, May 09, 2024 (GLOBE NEWSWIRE) --\n\n\n\nThe cryptocurrency market continues to offer diverse investment opportunities with unique growth potentials. Shiba Inu (SHIB), Ethereum (ETH), and Furrever Token (FURR) each present distinct scenarios, from SHIB's long-term aspirations to hit a significant price milestone, Ethereum's ongoing technological enhancements amid regulatory scrutiny, to Furrever Token's engaging community-driven initiatives. These developments highlight the varying strategies and market dynamics that investors and enthusiasts can navigate.\n\nShiba Inu's Road to $0.001: A Millionaire Maker for the Patient Investor\n\nShiba Inu (SHIB), the cryptocurrency that captured the hearts of many young investors, continues to hold the community's attention despite its fluctuating market performance. Originating as a favorite among retail investors, SHIB has created significant wealth for its early backers, with some even reaching millionaire status. Although the token is currently far from its all-time high of $0.00008616 achieved in October 2021, the undying optimism among its supporters envisions a milestone price of $0.001 per SHIB.\n\nTo become a millionaire at this ambitious target price, an investor would need to hold approximately one billion SHIB tokens, currently valued at about $23,972. This significant number reflects not only the potential high reward but also the substantial risk associated with such an investment in the volatile crypto market.\n\nPredictions on when SHIB might reach the $0.001 mark vary, with forecasts suggesting a timeline between 2033 and 2040. Such a long horizon necessitates patience and enduring confidence in Shiba Inu’s market strategy and broader adoption. The primary challenge facing SHIB is its massive circulating supply of 589 trillion coins, which poses a substantial barrier to significant price increases. Achieving a price of $0.001 with such a vast number of tokens would result in an unrealistically large market capitalization, not seen in current crypto valuations.\n\nIn response to these challenges, the SHIB development team is actively working on new mechanisms to reduce the token supply dramatically. Rumors suggest that these new initiatives could potentially burn trillions of tokens annually, accelerating SHIB’s journey towards the $0.001 goal if successfully implemented. This strategy not only aims to enhance SHIB’s value but also aligns with the community's long-term vision of reducing supply to create scarcity, thereby driving up the token's price.\n\nStory continues\n\nFor those betting on SHIB, the path to becoming a millionaire is intertwined with the token’s ability to overcome its supply challenges and achieve unprecedented growth in the coming years. This journey requires both a belief in the token’s potential and the fortitude to withstand the ups and downs of the crypto market.\n\n\n\n\n\nEthereum Positioned for Uptrend Amid Regulatory Developments and Technical Enhancements\n\nEthereum, a leading cryptocurrency, is showing potential for growth amidst a flurry of technical and regulatory developments. On a recent trading day, Ethereum's price was slightly down by 0.7%, trading around $3,013. However, signals of an upcoming rally are emerging, driven by significant improvements in its blockchain technology and speculative market movements.\n\nThe new Ethereum Improvement Proposal (EIP) 7702, developed by co-founder Vitalik Buterin and his team, is at the forefront of these developments. This proposal aims to innovate how externally owned accounts (EOAs) operate by allowing them to temporarily take on smart contract functionalities. This change is set to enhance the user experience significantly by simplifying gas fee processes, enabling transaction batching, and ensuring greater compatibility with the ERC-4337 smart contract wallet standard. These updates emphasize a shift toward making user-focused enhancements rather than purely technical scaling solutions, reaffirming Ethereum's commitment to its community of users.\n\nMoreover, the market is on edge as it awaits the U.S. Securities & Exchange Commission's (SEC) upcoming decision regarding the Van Ecks' spot ETH ETF application, expected on May 23. This decision is anticipated to cause volatility, with the community and investors closely watching for any potential impact on Ethereum's market position. Although current sentiments tend towards caution, historical trends and recent significant buying activities by large investors, commonly referred to as 'whales', suggest that Ethereum could be on the cusp of a significant upward movement. Should the market receive even slight bullish signals, Ethereum might break through the upper levels of its current price range, presenting a valuable buying opportunity for long-term investors.\n\nFurrever Token Stimulates Market Activity with $20,000 Competition Following Impressive Presale\n\nFurrever Token (FURR) is gaining notable traction within the cryptocurrency sector by not only achieving over $1.1 million during its presale but also by initiating a lucrative buying competition. The newly announced \"Highest Total Buys Competition\" is set to distribute $20,000 worth of FURR among the top ten participants who invest the highest amounts over the course of the event. This competition is designed to further energize the Furrever community and stimulate market transactions for the FURR token.\n\nKicking off today, the 18-day competition promises generous rewards for the most active buyers. The participant with the highest total purchase will be awarded $5,000 in FURR tokens, with the second and third highest buyers receiving $4,000 and $3,000, respectively. Those who place fourth through tenth will each receive $1,000 in FURR tokens. This strategic move not only encourages community participation but also aims to enhance the liquidity and trading activity of the Furrever Token.\n\nPriced attractively at $0.000648 per token, Furrever Token presents an enticing investment opportunity with potential returns of up to 15X. The vibrant community backing the token is evident in its active Telegram group, which houses over 4,000 members. Here, investors and enthusiasts collaborate and exchange ideas, staying informed about the latest developments and strategic directions of the Furrever Token. This level of engagement and the exciting new competition underline the dynamic and promising future of the Furrever Token in the competitive cryptocurrency market.\n\nFor further information or any assistance regarding Furrever Token, reach out only through the official channel at support@furrevertoken.com to avoid potential scams.\n\nJoin Furrever Token Presale Now:\n\n\n\nFurrever Token Official Website\n\n\n\nVisit Furrever Token Presale\n\n\n\nJoin Official Telegram Group\n\n\n\nFollow Official X Account\n\nMedia Contact:\n\nRobert Smith\n\nhttps://furrevertoken.com/\n\nsupport@furrevertoken.com\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\n\n\n\n\nCONTACT: Robert Smith support (at) furrevertoken.com\n\n\n\n"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE9KQ1JCbFhmYm9wQ082YV81Nno0WmpJX25hNzQ2eFdEOFA3ZmdYU0gtZjlPQzRUNUU4MExaV2VIWVp4Tl9sTVZkODR3aGNiT3VXWkdSc2JQU0U1Rk9nZ1U0c0VZbXFMZFFVSkhwbk9qZ2lJNURuZWVsVtIBfkFVX3lxTE1QZ0NaYkZmTVczcDVfSnhYckhpUlFldlVxbkZ4Z1dlVk5zX0gzUS1lREtkbXR3ZU9tYk5vYkhqYS1BSUZkTU5EOFRVbkFxOHAybTA5MjhvRmZRZEEzOGRnUzRnZUZNTFpPaEVCb0t3eTJQdVpJX1Rsd1RmQzl0QQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 May 2024 07:00:00 GMT",
        "title": "This Ethereum ‘weakness’ may keep ETH’s price below $3,100 - AMBCrypto News",
        "content": "Data showed that ETH’s underwhelming performance has restricted money flow in the market.\n\nOld coins were moving, indicating that selling pressure might continue.\n\nEthereum [ETH] is challenged with replicating its performance in the last bull market, according to a recent report. Put together by 10x Research, the report stated that the project’s fundamentals have weakened.\n\nAs a result, Ethereum is preventing money from flowing into the market at a faster rate. For those unfamiliar, 10x Research is a crypto institutional research platform.\n\nAccording to them, ETH drove the 2020/2021 bull cycle. However, the fact that the altcoin has been lagging restricts the market from reaching its full potential.\n\nIs ETH dragging BTC and others back?\n\nThe firm also added that it expected Ethereum to drive adoption, but it has failed to do so. It does not end there. The report also mentioned that the correlation with Bitcoin [BTC] has also hindered BTC, noting that,\n\n“Surprisingly, BTC and ETH remain highly correlated, with an R-square of 95%. Ethereum’s weak fundamentals are becoming a roadblock for Bitcoin as they prevent broad fiat inflow into the crypto ecosystem.”\n\nETH’s price at press time was $3,128. And according to 10x Research, the $3,100 region was a crucial spot for the cryptocurrency.\n\nHowever, the chart shared by the platform suggested that the price could decrease and hit $2,600 if care is not taken. When AMBCrypto checked the validity of this conclusion, we found some solid grounds for it.\n\nThe traction stops, places the price in danger\n\nFirst off, we considered looking at Ethereum’s number of new addresses. According to data obtained from Glassnode, the number of Ethereum new addresses jumped to 196,620 on the 5th of May.\n\nThis metric tracks the number of unique addresses that participated in a transaction for the first time. However, at press time, that number had plunged to 125,008.\n\nThe inability to sustain this growth puts Ethereum in a dicey position. The same goes for the price of ETH.\n\nShould the number of these addresses continue to fall, then ETH could be in a pole position for a slide below $3,100 as predicted.\n\nMeanwhile, ETH’s one-day circulation has been decreasing since March. This implies that fewer coins have been engaged in transactions since then.\n\nTypically, this could be a sign of decreasing demand for the cryptocurrency. However, it also shows that the number of ETH set aside for selling could be low.\n\nAnother metric we looked at was the Mean Coin Age (MCA). Low values of the MCA indicate accumulation, and this could foreshadow higher prices in the future.\n\nRead Ethereum’s [ETH] Price Prediction 2024-2025\n\nHowever, the 90-day MCA on Ethereum’s network skyrocketed to 45.83. This increase implies that long-term holders of the cryptocurrency are moving their coins.\n\nMovements like this suggest a potential to sell. As such, ETH’s recovery might remain on the sidelines as the price might continue to struggle."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxNVS0zM3NCaHFYYU9ZYTN4WUxUN1laYzFYYjNPMTJZOERSRHNTU0xhU3FOdGkwTkVRa0VYcUItemo1eVZfLXh1amNhS0xnRVpBUF91QzNzVzJLdDZxUlVMQ2s5LXpQYXdGS213VTkzRFVqZXRNam5waFBvNFpBWXVtX0RVR19MZ9IBjgFBVV95cUxPbVNNdWhIOHpsUnQ0U2FuUEhDOGJ5Ukt6RGYxSWF4N2FWR0FzR19IdXN3SkNVOWhORFJKSFNGbGx1ZUtBRk5LZkg0RmdoSGRWMUY0bTltZUFCQ0F0aDZoa041dldPRXFzWWQ0QmEzSl9aS1JDWWRLbDcxMThOWTQ1UVNqbFJJSlpEZE8tWEZn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 May 2024 07:00:00 GMT",
        "title": "Ethereum Game ‘Fantasy Top‘ Now One of Crypto's Most Profitable Apps - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nFantasy Top, a fantasy football-esque Ethereum NFT game that turns Crypto Twitter influencers into trading cards, has seen a surge in attention since launching just one week ago on layer-2 network Blast. In fact, it’s making so much money in fees and revenue that it’s now included in the same conversations that surround many leading blockchain networks.\n\nOver the last week, Fantasy Top has been the fifth most profitable crypto protocol, according to on-chain data tracked by DefiLlama, with $9.31 million worth of ETH. It earned by selling NFT card packs and taking a cut of trades via its secondary marketplace.\n\nOnly Bitcoin ($22.1 million), Ethereum ($21.6 million), liquid staking protocol Lido ($18.2 million), and decentralized exchange Uniswap ($15.9 million) generated more fee revenue during that span. And over the past 24 hours, Fantasy Top lands in seventh place with about $925,000 in revenue, with the Tron and Solana networks rising above for the daily tally.\n\nFantasy Top has quickly become a crypto industry sensation, particularly on Crypto Twitter—because it’s based on and built around the social media sphere. The game’s 120 unique “heroes,” which were turned into tradable NFTs on Ethereum layer-2 network Blast, are all based on notable industry traders, investors, analysts, and content creators.\n\nAD\n\nAD\n\nAs in fantasy sports games—and particularly NFT-based versions like soccer game Sorare—Fantasy Top players must create a lineup of their owned heroes, and then they’ll earn points based on the real-life Twitter (aka X) engagement of the influencers in question.\n\nMany of the in-game heroes in question have also been playing the game themselves, driving attention and spending in the process. And there’s good reason for them to: They’re being paid a cut of all pack sales and secondary market trading fees.\n\nLate Monday, the game paid out $1.25 million in Ethereum (ETH) split between heroes, as well as potentially millions of dollars worth of Blast Gold—points for the upcoming BLAST token airdrop. And that was from less than one week of play since the mainnet launch. That amount, of course, would come from the aforementioned revenue total.\n\nPreventing Bots and shortening the Main Competition 🏁 To safeguard Fantasy participants and uphold a meritocratic environment, we've decided, together with the heroes, to end the competition slightly ahead of schedule, preemptively thwarting any surge in malicious activities.… pic.twitter.com/BKp0rYL6Io — fantasy.top (@fantasy_top_) May 8, 2024\n\nAD\n\nAD\n\nHowever, the Fantasy Top rollout hasn’t come without challenges. On Wednesday, the game’s creators said they had prematurely ended the first in-game “Main Competition” that began Monday because heroes’ social media content engagement totals were manipulated and boosted—apparently due to automated bots.\n\nFantasy Top says it will share the results of the competition soon, along with details on how it plans to address botting issues in the future.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxNRzhHMVQwY0c4RWJZcHlrdFRqbXExLWgyZkp3b1A3RmZUbEpBcWlLbG9Zck1YRnpXSHNBazZMU2RFcmpGZ19VcGVmd3FuQkZFQ1BBRG5fanZOanlpS1JFTGtJZFIxY0FJblJNbkpReURJSFN5N0pwOEVuUVlpeGNyYmJmUGlMZ2pLWXQ5RTJjckZ4Zw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 May 2024 07:00:00 GMT",
        "title": "Solana could surpass Ethereum in transaction fees - The Cryptonomist",
        "content": "In a turn that could rewrite the current dynamics of the world of cryptocurrencies, Solana seems poised to surpass Ethereum in terms of transaction fees within the next week.\n\nThis event, if it were to occur, would not only strengthen Solana’s positioning in the sector, but could also further solidify its label as an “Ethereum-killer”, despite the technical challenges and network interruptions it has recently faced.\n\nCurrent context between Ethereum and Solana for transaction fees\n\nEthereum, long considered the undisputed leader in decentralized applications and decentralized finance (DeFi), is known for its high transaction fees, especially during network usage peaks.\n\nThis has led many developers and users to seek cheaper and more efficient alternatives, a niche in which Solana has begun to stand out thanks to its promise of speed and significantly lower transaction costs.\n\nSolana has made its way in the field of blockchain with the promise of processing up to 65,000 transactions per second, compared to a capacity of Ethereum which currently revolves around 30 transactions per second.\n\nThis performance is supported by a unique consensus model, known as Proof of History (PoH), which works in tandem with the Proof of Stake (PoS) mechanism to optimize efficiency and reduce costs.\n\nDespite these advanced technical features, Solana has faced numerous network interruptions, raising doubts about its long-term reliability and scalability.\n\nThese technical issues have temporarily hindered its growth and have shaken the confidence of some investors and users. However, recent improvements and updates to the network aim to solve these problems, restoring confidence in the platform.\n\nImpact of reduced transaction fees\n\nIf Solana were to surpass Ethereum in terms of transaction fees, it could attract a significantly larger number of developers and projects.\n\nThis shift would not only increase the volume of transactions on the Solana network, but could also positively influence the value of its native token, SOL.\n\nFurthermore, a reduction in fees could further democratize access to DeFi applications, making them available to a wider audience that may currently be discouraged by high fees on Ethereum.\n\nSurpassing Ethereum will not be an easy task for Solana, given Ethereum’s vast user base and its extremely active developer community.\n\nFurthermore, the upcoming update of Ethereum, known as Ethereum 2.0, aims to solve many of its current issues related to scalability and transaction costs.\n\nHowever, temporary success in terms of lower transaction fees could give Solana the necessary advantage to solidify its position as a credible alternative to Ethereum in the long term.\n\nConclusion\n\nIn conclusion, Solana’s potential superiority over Ethereum in terms of transaction fees represents a significant turning point. If Solana manages to maintain lower transaction costs, it could not only attract a new wave of developers and users, but also consolidate its position as a valid alternative to Ethereum.\n\nThis evolution highlights the continuous innovation in the field of blockchain and the need for existing platforms to adapt in order to remain competitive. However, the success of Solana will depend on its ability to overcome past technical challenges and build a stable and secure network.\n\nIn a market that rewards both innovation and technical robustness, Solana has the opportunity to redefine the cryptocurrency landscape and demonstrate its value as a potential “Ethereum-killer” in the long term."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxNQndLcHFFZEViUHJhOUNWN2hDV2duRmhnVm1kYjFTaUJfcU5pcVJCaGN2Wk1NRlFXY2tzcXI4S0hCUnJSaF81eE9jQ1RBVXJuRGdnVHhoLTRXZnJMTkowOTNhbzRhRkNfWUQ3X3lpTkdITmZINHNBdmtPR0RmQXpwS0ljajloYVZZbEFMZzg4LXczTnZRTEVFbjU3eTdtcEY1U0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 May 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Falls Below $3,000 Support Level – Will It Recover Soon? - The Tech Report",
        "content": "Why Trust Tech Report Tech Report is one of the oldest hardware, news, and tech review sites on the internet. We write helpful technology guides, unbiased product reviews, and report on the latest tech and crypto news. We maintain editorial independence and consider content quality and factual accuracy to be non-negotiable.\n\nThe broader crypto market has been on a steady downward trend since May 6, with the price of most assets dropping significantly. Ethereum fell from a high of $3217 to $2936 on May 8, 2024, marking an 8% price decline.\n\nEthereum is hovering around $2,984, down by 1% in the last 24 hours, its trading volume is $10.9 billion.\n\nThe prevailing downtrend has cast doubts and uncertainty about Ethereum’s trajectory in the coming days. Will the bulls return to trigger a rebound? Read on to find out.\n\nEthereum Price Analysis: Bearish Momentum Strengthens, Investors Urged to Exercise Caution\n\nEthereum is currently in a bearish trend, with several technical indicators signaling further downward pressure.\n\nEther has slipped to the lower band of the Bollinger Bands indicator, suggesting oversold conditions and further price declines. This could deter investors and traders from buying in until clearer signals emerge.\n\nThe Moving Average Convergence Divergence (MACD) is below the signal line, indicating a bearish trend continuation. This reinforces Ethereum’s negative sentiment and may prompt cautious behavior among investors.\n\nFurthermore, the SuperTrend indicator displays a sell signal, indicating that sellers are in control and may remain so in the near term.\n\nThe Relative Strength Index (RSI) is 38, signaling that Ethereum is currently oversold. However, this does not necessarily indicate an immediate reversal in price, and investors should exercise caution when considering entry points.\n\nOverall, Ethereum’s technical indicators paint a highly bearish picture, with multiple signals pointing to further downside potential.\n\nInvestors looking to enter the market may wait for the price to break above the previous $3,059 support level, which has now become a resistance. A break above this level will confirm a strong bullish momentum.\n\nHowever, given the unpredictable nature of the crypto market, traders should trade with caution and implement risk management strategies to protect their investments.\n\nGrayscale’s Withdraw ETF Fillings: What It Means for Ethereum Investors?\n\nGrayscale, a major crypto asset manager, has pulled back its filing for an Ethereum futures exchange-traded fund (ETF). These moves surprised analysts like James Seyffart, who called it a “Trojan horse” tactic.\n\nUPDATE This is interesting. @Grayscale just withdrew their 19b-4 filing for an #Ethereum futures ETF. This was essentially a trojan horse filing in my view, in order to create the same circumstances that allowed Grayscale to win the $GBTC lawsuit (approve futures deny spot) pic.twitter.com/Kihj2dlQx1 — James Seyffart (@JSeyff) May 7, 2024\n\nIn the analyst’s words: “In my mind, might as well make the SEC write up an approval or denial for an ETH futures ETF and go from there?” He suggests a discussion between the SEC and Grayscale must have prompted the withdrawal.\n\nNate Geraci, another analyst, said last month that there’s a possibility that the SEC will not approve the ETH ETF. He predicted that if the SEC rejects Grayscale’s Ethereum ETF application, they might take legal action again.\n\nHowever, in a recent X thread, Bloomberg’s senior ETF analyst, Eric Balchunas, sees this withdrawal as a positive sign. He thinks Grayscale might not sue the SEC again.\n\nGrayscale’s latest move could positively affect Ethereum’s price, as it shows its commitment to working with regulators rather than engaging in legal battles.\n\nWhile the price of Ethereum is still down, investors might want to consider this low-cap project, which is trending in the market.\n\nDogeverse ($DOGEVERSE) At Over $13 Million – Ape In Early For Massive Gains\n\nThe Doge-inspired meme coin, Dogeverse, has seen remarkable success since its inception, echoing the enthusiasm once ignited by Dogecoin. Dogeverse aims to unite the crypto meme community and pioneer multichain utility development.\n\nFrom its presale phase, Dogeverse quickly captivated the attention of the meme coin industry, garnering significant interest with its reasonable pricing point. The presale has raised over $13 million and is rapidly winding down as May progresses, reflecting the project’s appeal among investors.\n\nThe presale’s concluding discount price of $0.00031 shows that the project is affordable. Interestingly, this low rate could attract even more investors in its final stages.\n\nWhy DOGEVERSE Looks Promising to Investors and Enthusiasts\n\nDogeverse stands at the forefront of the cryptocurrency market, poised to revolutionize the meme coin landscape with its multichain capabilities. Its allure lies in the adoption of multichain technology facilitated by Wormhole and Portal Bridge technologies.\n\nBy transcending the limitations of a single blockchain, Dogeverse offers unparalleled speed and convenience. The project also empowers users to navigate across chains seamlessly. This strategic move not only enhances user experience but also expands Dogeverse’s potential user base exponentially.\n\nThe decision to commence on Ethereum is a solid foundation for the project’s multichain growth strategy. Ethereum’s widespread adoption and robust security features make it the ideal platform for such an ambitious endeavor.\n\nRaising over $13 million in a matter of weeks, it has captured the attention of both seasoned investors and newcomers. This remarkable achievement attests to the widespread anticipation surrounding Dogeverse.\n\nMoreover, as the Bitcoin Halving concludes, meme coins are poised for exponential growth, making Dogeverse’s arrival timely and strategic.\n\nBy integrating features from top-performing meme coins across various chains, such as DEGEN and BRETT, Dogeverse ensures its relevance and competitiveness in a rapidly evolving market landscape.\n\nSecure a Spot – Buy Dogeverse Today\n\nVisit the website and connect your preferred wallet using the options provided. Choose the network you want to participate in the presale on – options include Ethereum, Solana, BNB Chain, Polygon, Avalanche, or Base. Type the amount of ETH, SOL, BNB, MATIC, AVAX, USDT, or USDC you want to exchange for $DOGEVERSE. After the presale ends, use the same wallet and network you used to buy to claim your $DOGEVERSE tokens\n\nDisclaimer: The opinions expressed in this article do not constitute financial advice. We encourage readers to conduct their own research and determine their own risk tolerance before making any financial decisions. Cryptocurrency is a highly volatile, high-risk asset class.\n\n🔎Looking for the next 10X crypto?\n\nCheck out the best crypto presales to invest now"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxOM21obXJTTUYxWkZ0dEtjWHk1Tlc3bXRRdnpFZXozT1JvTXRraVIyQ3hwTzB0THEwYy1YbGhJMnZNWWNfQUwwNlZCU185SEpOQVBiMjR3U1JVazhmT0Nyc01xSnhaVGVjc21xMlJEa0JmRmdDcHVycHl4M1pCcnJ6dm1FeXFsN0Q5bUpDQjAwU1BPR1kzMkVCUXlnNDNORGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 May 2024 07:00:00 GMT",
        "title": "Vitalik Buterin Proposes EIP-7702: a revolution for Ethereum - The Cryptonomist",
        "content": "Vitalik Buterin, the visionary co-founder of Ethereum, together with co-authors Sam Wilson, Ansgar Dietrichs and Matt Garnett, has recently presented a revolutionary proposal: the EIP-7702.\n\nThis proposal aims to enhance the concept of “account abstraction” on Ethereum, introducing new flexibility and potential to externally owned accounts (EOA), such as regular wallets, allowing them to temporarily take on the functions of a smart contract during a transaction.\n\nWhat is EIP-7702? The proposal by Ethereum co-founder Vitalik Buterin\n\nThe EIP-7702, or Ethereum Improvement Proposal 7702, is a technical proposal that aims to extend the capabilities of externally owned accounts on Ethereum, allowing them to behave like smart contracts.\n\nNormally, EOAs are simple wallets that can send and receive funds, but cannot execute arbitrary code like smart contracts.\n\nHowever, with the introduction of EIP-7702, these accounts will be able to temporarily activate smart contract capabilities to perform complex operations, and then return to their original state once the transaction is completed.\n\nThe need for such innovation stems from the current limitations of EOAs, which cannot directly participate in more complex transactions without the intermediation of a smart contract.\n\nThis not only complicates some operations but also limits the possibilities of automation and customization for Ethereum users. With EIP-7702, users will be able to take advantage of the flexibility of smart contracts while maintaining the simplicity and security of a normal wallet.\n\nThe mechanism proposed in EIP-7702 provides that an EOA can temporarily activate a set of functionalities typical of a smart contract, such as the execution of specific code, at the time of the transaction.\n\nThis process is possible thanks to a modification of the Ethereum Virtual Machine (EVM) that recognizes and treats these “enhanced” EOAs for the necessary duration. Once the transaction has been executed, the account returns to its original EOA state, ensuring security and stability.\n\nI benefits:\n\nGreater Flexibility: Users can customize their transactions tailored to specific needs, without the need to interact with external smart contracts. Gas Efficiency: Reducing the need for intermediary smart contracts can result in a significant reduction in gas costs, essential for large-scale operations. Usability: By maintaining the basic structure of EOAs, users will enjoy a less complicated and more direct user experience.\n\nThe future of Account Abstraction and its economic implications\n\nOne of the most promising aspects of EIP-7702 is its potential ability to transform the economy of smart contracts on Ethereum.\n\nCurrently, the creation and maintenance of smart contracts require significant resources, both in terms of development and execution costs, mainly due to gas consumption.\n\nButerin’s proposal could simplify this process, reducing the need for multiple contracts for operations that a user wants to perform repeatedly, thus lowering overall costs and making blockchain technology more accessible to a wider audience.\n\nThis increased accessibility could have direct repercussions on the adoption rate of Ethereum. With lower entry barriers, more companies and individuals could be incentivized to explore and adopt Ethereum-based solutions.\n\nFurthermore, the adoption of such proposal could stimulate a new wave of innovations in sectors such as gaming, digital art, and digital asset management, where the need for complex and personalized interactions is particularly felt.\n\nThe issue of security is central in the debate on EIP-7702. Increasing the complexity of EOAs could trigger new security risks that must be carefully addressed.\n\nThe Ethereum community will need to work together to develop new security protocols that can adequately protect enhanced accounts against malicious attacks, while at the same time preserving the fluidity and efficiency of transactions.\n\nFurthermore, the introduction of EIP-7702 could require a review of Ethereum’s governance regulations, as the current framework may not be fully equipped to handle the changing dynamics of accounts and their interactions.\n\nActive participation of the community, through improvement proposals and voting, will be essential to ensure that the changes not only enhance the technology, but also reflect the values and needs of Ethereum users.\n\nPossible Implications of Vitalik Buterin’s Choice on EIP-7702 on Ethereum\n\nIf implemented, EIP-7702 could lead to a significant evolution of decentralized applications (DApps) on Ethereum, making the platform even more attractive for developers and end users.\n\nThe ease with which accounts can be adapted for specific functions could also stimulate innovation in areas such as decentralized finance (DeFi) and digital identity.\n\nDespite the numerous advantages, the EIP-7702 presents some challenges, especially regarding security.\n\nThe increase in functionality of EOAs could potentially expose them to new attack vectors. Therefore, it will be essential to implement robust security measures to protect users and maintain the integrity of the Ethereum network.\n\nThe EIP-7702 represents a significant step forward in the attempt to make Ethereum a more accessible and powerful platform. Although there are challenges to overcome, the potential for significant improvements in transaction management and interaction with the blockchain is evident.\n\nOver the next few months, the Ethereum community will have the opportunity to evaluate, discuss, and potentially adopt this proposal, continuing to push the boundaries of what is possible with blockchain technology."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxNM1RfRWwwbDFKZEZEQU5JbHlIUHFHaU9XZ2VBaDQ5MXd1cmkyMVhYSVN4cnh5U0RqX1M5NDBYQ25JZ1lPNTVIM0M2TzBicmRVeGZmUnB2WVJGNEQ1clpoMHhmTDVFbHJmTnVSRkdNM3p1ODUyWjU5NjBrZXY5WjZhUW9Gb19XN3J2TDV30gGQAUFVX3lxTFBNMEJRNEJyUlh6dEt6SXVZV3hkVkNkLU1FdGhkcGpjOTBaRjMxdkhINzM1Z05oVmU3ZmFYNkRUSm9LZnMyc19hVmkyUEpWSnlUbXVCVHJ4RGRsUnpLOTJVcUhLdmQ3QkVBT2JyVFBENUtnS1RtTVhnSjg1bWNVeWhkRTdDbVA4TkRIUDdmYkZObA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 May 2024 07:00:00 GMT",
        "title": "Ethereum Foundation Allegedly Dumps 1,000 ETH: Will Price Drop Follow? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nThe recent series of transfers by the Ethereum Foundation to the multisign address \"0xbc9\" has caught the attention of market observers, sparking concerns about potential volatility in Ethereum's price.\n\nAdvertisement\n\nIn the latest transaction reported by Spot On Chain, the foundation moved 1,000 ETH, valued at $3 million, to the aforementioned address. This action is part of a larger trend, as the foundation has already transferred a total of 5,000 ETH to the same address since the beginning of 2024.\n\nWhat is notable about these transfers is their potential impact on the market. Analysis reveals that a considerable portion of the previously transferred ETH — 1,766 ETH — has been promptly sold for 4.81 million DAI, averaging $2,725 per ETH. Interestingly, these sales often coincide with a decline in Ethereum's price.\n\nAdvertisement\n\nIndeed, historical data indicates a correlation between the Ethereum Foundation's sell-offs and downward pressure on ETH's price. With the multisign address \"0xbc9\" currently holding 2,508 ETH, equivalent to $7.51 million, market participants are cautious about the implications for Ethereum's value.\n\nETH to USD by CoinMarketCap\n\nThe current market environment adds to the apprehension, with Ethereum trading below $3,000 per coin and struggling to breach the $3,300 resistance level. As a result, there is speculation about whether the foundation's actions could exacerbate the downward trend, potentially leading to a drop in ETH's price to $2,400.\n\nAs the crypto community braces for what lies ahead, all eyes remain glued to Ethereum's price chart, awaiting clues about the next move of the main altcoin."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxOaG96MDdmUWFmUEN3VXBQeGE0WmZzR3hTWk5wM2RkSS03TTN2ZldnOXpOT1V1dGJ5Tks1bGpDcERKcVFQenBTSGN4aDlRY2dKeWJZOVplT1BOMDl1bDYwZUIzdUg1SWZwTXFmZ3lZS3VfcTMyTDNnNk5sQXZmNTl5REtnSkpGVG5jOEh4SGNHM0FrRDEw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 May 2024 07:00:00 GMT",
        "title": "Solana to Flip Ethereum in Transaction Fees as Soon as This Week - Watcher Guru",
        "content": "Once dubbed the ‘Ethereum Killer,” the Solana network is poised to surpass the famed blockchain network in transaction fees as soon as this week. Indeed, Blockworks senior research analyst Dan Smith discussed the potential flip that is just on the horizon.\n\nSuch a development would return Solana to its once-heralded position as a network most likely to dethrone Ethereum. Ongoing outage issues had called the network crowning into question. However, its performances throughout 2024 provide hope that it will meet those expectations.\n\nSource: Blockworks\n\nAlso Read: 3 Solana Based Meme Coins To Watch This Week\n\nSolana Flip Ethereum in Fees as it Continues Strong 2024\n\nJust five months into the year, Solana has proven to be one of the biggest stories in the digital asset market. In March, it was the home network for a plethora of surging meme coins. Indeed, the industry’s meme coin mania was driven by Solana-based newcomers like Dogwifhat (WIF) and Book of Meme (BOME).\n\nThose performances had seen the network become the market leader in monthly DEX volume. Moreover, Solana could be set to flip Ethereum once again, this time in transaction fees, which will take place as soon as this week.\n\nSpecifically, Blockworks researcher Dan Smith predicted Solana would flip Ethereum in both “transaction fees [and] captured MEV this month,” while noting it could happen this week. Captured MEVs are profits that are captured through arbitrage trading.\n\nSolana will flip Ethereum in transaction fees + captured MEV this month, maybe even this week — Dan Smith (@smyyguy) May 7, 2024\n\nAlso Read: Solana: Here’s When SOL Can Reclaim Its All-time High of $250\n\nAccording to Smith, Solana’s total economic value has reached $2.8 million as of Tuesday. Alternatively, Ethereum had seen a total economic value of $3.1 million on the same day. Subsequently, the tightness of the two network races is clearly continuing to sort itself out.\n\nConversely, the daily transaction fee battle is still clearly held by Ethereum. The network generated more than $2.75 million in the last 24 hours, outpacing Solana’s $1.49 million, according to DeFiLlama.\n\nSolana has still proven its worth throughout this year. Its native token has also performed well, with the asset increasing more than 20% over the last seven days alone. Indeed, Solana (SOL) and its network are expected to continue their positive performances throughout the year."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE1BMHlYc1NJTHc0aTZuaVpoR2J3U3VNQkZMYi11VEhmTVZSQzA3VWtSZUZxaTRJLW45YThtcWdhNXZkc3BIUjJqRmF2NVY2eGVFUkRiQjZWUUo3ZDVPZ0YzMGxBdzNkOE9sTktnS3ZPeDZlUjRRZ1YxSk9yQdIBgAFBVV95cUxOd3YwWm9VaWNWbmZ1bjdOcnpNLWJMVXZsOG15WXNianMtQ3J3YzFHemJJRzEyM1JmenE2a2ZMcTdkeGVYdnltVFlKVUFfeEp4N2pXNVcxcUotRFpkc05kQWlpY21nSVpOelZIazdzbVE4eG5ieGwzSG00U2x5WG9zZA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 May 2024 07:00:00 GMT",
        "title": "‘Cheap’ Solana can flip Ethereum ‘this week’ – Analyst - AMBCrypto News",
        "content": "Solana is quickly catching up to Ethereum on the fees front.\n\nHowever, the Ethereum ecosystem still commands investors’ trust.\n\nThe Solana [SOL] vs. Ethereum [ETH] debate resurfaced again on Crypto Twitter following reports that the former could soon flip the latter on the fees front.\n\nAccording to on-chain analyst Dan Smith, Solana was quickly closing in on Ethereum on transaction fees. Smith claimed that,\n\n“Solana will flip Ethereum in transaction fees + captured MEV this month, maybe even this week”\n\nTransaction fees refer to charges linked to network activity, while MEV means validators’ highest value derived by maximizing block production or ‘confirmation.’\n\nSolana vs Ethereum: fees and other fronts\n\nSmith backed his argument with data, noting that there was about a $300K difference between Solana and Ethereum’s fees.\n\nThe chart showed Solana recorded a significant surge in 2024, closing most of the gap with Ethereum.\n\nAMBCrypto’s evaluation of Artemyz’s data confirmed the trend on the fees front. The data showed that Ethereum network fees had dropped significantly since the end of February.\n\nOn the 7th of May, Ethereum fees hit $2.8 million, while Solana had $1.6 million.\n\nHowever, other market watchers argued that Ethereum transaction volume should include all L2 to capture its “real value.” To which, Dan Smith responded,\n\n“The question is whether or not pushing activity to L2s where ETH, the asset is used as a currency, drives enough value back to the L1 to compensate for the loss of L1 activity”\n\nDespite its network challenges, Solana, on average, has cheaper transaction charges than Ethereum.\n\nReacting to Smith’s projection of SOL eclipsing ETH, crypto analyst Ansem wondered,\n\n“And it is still 100x cheaper to transact on for users, really think about this & explain to me in detail why ETH is still worth 5x more by market cap”\n\nThings are also hitting up on the DEX (Decentralized Exchange) front after Solana’s Jupiter exchange outperformed Ethereum’s Uniswap on the Unique Active Wallets (UAW) front.\n\nLike Ansem, most market watchers underscored SOL as grossly undervalued, especially after last week’s pullback.\n\nNevertheless, Ethereum had a commanding lead on TVL (Total Value Locked) and overall token value on price charts.\n\nSolana had $4 billion in TVL, while Ethereum’s reading stood at $53.3 billion at press time, underscoring that Ethereum had more investors’ trust."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMi8AFBVV95cUxOdzhzaUVsR29pMlgzV2RRRzU4d3ZjVUdHcmpEeDRFR0dqUnUwcmFsU0tUNVNEbk1RWDVQenpXR01lMUZhN1lpdHV3YUtwblltRFE3Y2RMWlRYQmNYa0VzTS1QTW1pWVRWc2M4RV8weEdFS3JrWTNpX0tScDJfNnE3ZmJoLUdsM09PWUdUNTVST0lfY2RDNkJfRTJuTmpXNkZ5QVJLUEFpT1E2Z2tPWXQxbTVGTk1sSEQ3bkhoc1VJSXFncldzQjVZM25zUzBnRWRRaWhXRHlndnRKZnZCRlY5Vjg4OHc3TlRETkpJUGJZZUfSAfYBQVVfeXFMTzFyZ2JqZWZDOTBFNnEtY2dtN1dVMU1CU2c2U1hrZUEtNXA0Vzk0Z09kX19reU5IZ205VUxmSG1Ja3JXZ3d1N01tQURzVWg2YjQ1ZzI2Sm9iOFV6Q2x0VEh3RXgxd3BCN2E5RE9jb0dzaGwtcktrYnd6cm9aZ0x6Z1VYaUQtV191ME9QWDhQc19sb1hheV9xUWNaQzZIb1EzZ0VkdEtlaXlIOG44cUpvM3Z2MmxQam5YRzhEOVVJWmk2eWZvZ2w1bjM4VVp3ZUlaSXc2Ujh1VkpfNzlqNmM1RG5BSHJSTHJQd1VUMFFOa1RlSF9pSFln?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 May 2024 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: Until BTC flips $64,300, altcoins' bleed could continue - FXStreet",
        "content": "Bitcoin price could rally 20% if bulls make a stable move above $64,300.\n\nEthereum price is close to bottoming out with a 26% upside potential under wraps for ETH holders.\n\nXRP would be good for entry, safe rather once Ripple price reclaims 0.6700 as support floor.\n\nAltcoins are going through a rough patch as Bitcoin (BTC) price continues to conceal directional bias in the higher time frames. In the lower time frames, however, a flip of the $64,300 into support would be the redeeming feature to cauterize the bleeding seen among altcoins.\n\nThe altcoin market capitalization is still holding well above the $250 billion level, positioning itself for a future move to the upside, should BTC show strength. An interesting observation, however, is that while the Asian session has been trying, the European session continues to front run a sell-off in the New York (NY) session. This means a good NY session would bode well for the broader market.\n\nAlso Read: Altcoins in disarray as BTC conceals directional bias\n\nBitcoin price could be primed for 20% rally\n\nBitcoin price action is consolidating within two converging trendlines that slope downward as they gradually narrow the price range, effectively forming a falling wedge pattern. The target objective for this technical formation is a 20% move north to $76,116.\n\nNevertheless, this breakout may not be here just yet as momentum continues to fall as shown by the lower lows and lower highs on the Relative Strength Index (RSI). The Awesome Oscillator (AO) is also still in negative territory, typically signifying a bearish trend in the market and that the downward trend may persist in the near term.\n\nA break below $60,660 support could see Bitcoin price provide another buy opportunity below $60,000, or in a dire cause, slump all the way to $56,000 before a pullback.\n\nBTC/USDT 1-day chart\n\nOn the other hand, if the bulls defend $60,660, Bitcoin price could use this level as the jumping off point for further upside, activating the bullish reversal pattern by recording a decisive candlestick close above $63,871 on the one-day time frame. A candlestick close above this level would invalidate the bearish thesis.\n\nAlso Read: Bitcoin price dips into $61K but large holders buy BTC ahead of 20% upside potential\n\nEthereum price is close to bottoming out\n\nEthereum price is withstanding the worst of the weakness seen in BTC, but this could end soon as the $2,900 support looks primed to defend. The RSI is defending against further downside, while the AO flashes green as it edges toward positive territory.\n\nA show of strength from ETH bulls could see Ethereum price recover. A stable higher high above the peak of the Monday trading session at $3,221 could instigate a 26% move north for the Proof-of-Stake (PoS) token to the profit target of $4,083.\n\nETH/USDT 1-day chart\n\nConversely, if Ethereum price slips below $2,900 and closes below it on the one-day time frame, it would invalidate the bullish thesis. This could trigger more selling, sending ETH to the $2,800 before a possible recovery.\n\nAlso Read: Ethereum may be gathering momentum for potential rally, Vitalik Buterin introduces EIP-7702\n\nRipple price must ascend beyond $0.67 for safe entry\n\nRipple price has recorded higher lows, reinforced by those on the RSI, suggesting a growing bullish trend. However, XRP will only be safe to buy once the price reclaims above $0.6700, levels last tested on March 15. Such a move would constitute a climb of nearly 30% above current levels.\n\n\n\nXRP/USDT 1-day chart\n\nHowever, if traders begin to cash in on the gains made since Ripple price bottomed out at $0.4188 on April 13, the trend could be reversed. Confirmation of this would be seen by a slip below the 50% Fibonacci placeholder of $0.4952 and ultimately a lower low below the May 1 bottom of $0.4782. This would invalidate the bullish thesis.\n\nAlso Read: SEC vs. Ripple lawsuit sees redacted filing go public, XRP dips to $0.51"
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMickFVX3lxTFBCQ2UyY2FjZ0xSRVZtQmI0Zk9MRTYzTGdrT2FJRC1EOXlFaXB4eXBGakZTQmZCRFJfbzJSZnJPVGNXSWt5elVYdExSaVNVLW51WVlHRWYwLTFkRVZmMVY2OUhjeG1UTVlNeVVfOVFBQnBhUdIBd0FVX3lxTE5QZExQSU0zNmxXdVZndTVNMklTM050emNZbE5FNmluMnpZS21lRnRycEtNRHBqVHNoRjhXYTVTUUNwYXNmTFMxcmJUR2RXOFAxVERnWTBXWmYyR3VMQWZrTi1sRDlmVkZqVmdVWUZkMkFvLUFMUk1V?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 May 2024 07:00:00 GMT",
        "title": "Vitalik Buterin Solves Ethereum's Gas Fee Problem - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nThanks to insights from Vitalik Buterin and contributions from experts like Ansgar Dietrichs, Barnabe Monnot and Davide Crapis, we are getting familiar with the concept of \"multidimensional gas.\" Traditionally, Ethereum has used a unit called \"gas\" to measure and price the computational efforts required for transactions and operations. This includes calculations like adding and multiplying, managing data storage, bandwidth and even complex processes like generating cryptographic proofs.\n\nAdvertisement\n\nThe recent proposal involves transitioning from a single-dimensional gas model to a multi-dimensional one, addressing the inefficiencies of treating different types of computational resources as equivalents. The current system, while simple, does not accurately reflect the varying demands different operations place on the network, which can lead to either over or under-utilization of resources.\n\nButerin uses a straightforward diagram to explain that while the gas limit might suggest a block can safely handle a certain amount of computation and data, the reality of what is safe can be quite different. This misalignment could potentially allow for blocks that are either too safe and under-utilized or too risky and overloaded.\n\nWith the introduction of multi-dimensional gas on Ethereum via EIP-4844, the network can now process different types of demands more efficiently. This change has already started to show benefits. Blobs, for example, will allow these rollups to operate much more cheaply, increasing transaction volume threefold without significantly raising block size, thus maintaining network safety.\n\nAdvertisement\n\nThe update also anticipates future enhancements, such as better support for \"stateless clients\" — a new type of Ethereum client that does not need to store a complete copy of the blockchain. These clients rely heavily on proof systems, and the current shift toward multidimensional gas could facilitate a smoother implementation of these systems by allowing the network to handle proofs more efficiently without compromising on security or inflating costs for users.\n\nThis multi-dimensional approach allows Ethereum to fine-tune how it manages different resources, potentially increasing throughput without risking safety. It marks a sophisticated step forward in blockchain technology, promising to make Ethereum more scalable, efficient and ready for future demands."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxORThxb1ZNeEgzSnNxTzlSRHBoc2RjTjZIMDlxVTc1T296UjVtSU01SkhaSUV2ajlSdUlqTXlJdHdOcXdERXc3VlFIQjNENFJtcDJIVFhpbzZmWkdBYUFZek44dVh3S2FlTXlvNWJwY0VHN0hnaG9PME9DV3JWZUFzbjNPUWxmRTFCdjViaWZBSFhuVWJUc2lUNmM2dGM5ZS1IQVlZcC16ZHdiaXltNnVzcU5DRVRGMlpCcTdmVHRiSjZqVWVQMmdiZXFkSk0wb3h0dEVLME91VEjSAd4BQVVfeXFMT2hTUE13eUlOcVJybXZpZWVEVjZoNGw4dE5RdzY0Zmg5SzJrT2V2OGVZME5LMFlsbElndDBKSGxTTzdsd3pfZW1lNnJtQlFwSjJDZzB4UDFxT01sU3FTTFVTNGdjRXU4VGFDYWsxaEdUNmtoWnJYUG9WV2ZWZ0lsWGNPTG4wWmoySjFZbHc3d1dvSlduSklqU3JZMFF5eldQc0NzQVZLQmxSb3dkdEQxRm5makJyUW1NdmJMSGpkN0ZkaTNDejYyQ21rTmdDZm9xZDdVLUdNZkF5LUZpbFpR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 May 2024 07:00:00 GMT",
        "title": "Cryptocurrencies Price Prediction: Ethereum, Bitcoin & Injective – American Wrap 08 May - FXStreet",
        "content": "Injective (INJ) had a market capitalization of close to $4.5 billion at its peak in March 2023. At nearly half its market cap, the DeFi protocol has proposed a solution, likely to reinstate INJ to its former glory through higher relevance and fresh capital injection.\n\nEthereum (ETH) price action on Wednesday shows it could be gathering momentum for a rally as the number one altcoin's co-founder, Vitalik Buterin, and co-authors have published Ethereum Improvement Proposal (EIP) 7702 as an alternative to EIP-3074. The Ethereum Foundation also appears to be dumping ETH tokens again with a recent transfer.\n\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all or a portion of your investment, as well as emotional distress. All risks, losses and costs associated with investing, including total loss of principal, are your responsibility. The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of FXStreet nor its advertisers. The author will not be held responsible for information that is found at the end of links posted on this page.\n\nIf not otherwise explicitly mentioned in the body of the article, at the time of writing, the author has no position in any stock mentioned in this article and no business relationship with any company mentioned. The author has not received compensation for writing this article, other than from FXStreet.\n\nFXStreet and the author do not provide personalized recommendations. The author makes no representations as to the accuracy, completeness, or suitability of this information. FXStreet and the author will not be liable for any errors, omissions or any losses, injuries or damages arising from this information and its display or use. Errors and omissions excepted.\n\nThe author and FXStreet are not registered investment advisors and nothing in this article is intended to be investment advice."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxOdVg4Y0hfV1dLNDU1RGZtNGZLanctVVBzek9Semh4OHJLQ1I3YVRkNzBwMjJ5dk1NRUdyZnIwYWx0RmkxQjFMTWxhWUhTSUJRS0FySzZCN3FfZEFXY2J2WnlFLVktMjM3bWZLR0htbjEwVDcwQ0FGRnJWWDFyNzNHbmo3d0psTWRWTk52ODFtM21WR2FZMkVnWmJRTzVxWGPSAaQBQVVfeXFMUDlFb2hiVEpobS1BQk1PbW52UzQ2aTVfQlUyMkhtenBSOXVRY2ViTkVGLU5fMkdMMjZNR1BPOFBPOVFleEV5LUdwc3JEUlhRcG9NWXR6MzRNRktSUTZQTlJjdjczLVYxWWVuUEk3WHNnNlBveG02cldWVGNvM0tzTFhyNG1oZWFWUC1rOHVOQ0VCZUwxdlNpUkk1WktkTVJIVVI2aFA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 May 2024 07:00:00 GMT",
        "title": "Ethereum Client, Near Protocol, EigenLayer Fast Finality Layer Layer Goes Live - CoinGape",
        "content": "Nethermind, an Ethereum Client, has just declared its participation in NEAR Protocol’s Fast Finality Layer (NFFL) initiative. This union comes at a crucial time for decentralized applications (dApps) and smart contracts when the blockchain industry is experiencing a rollup in Layer 2 user adoption in the Ethereum network. Nevertheless, though promising advances in scalability and efficiency have been achieved, challenges such as liquidity fragmentation and high finality times remain that impede user experience and innovation.\n\nIn response to the demand for faster transaction finality and increased interoperability, NFFL is an innovative infrastructure layer enabled by NEAR Protocol, together with Ethereum Client Nethermind and EigenLabs. NFFL aims to ensure rapid transaction finality on Ethereum Layer 2 rollups and beyond, removing the inefficiencies of today’s optimistic- and ZK-rollup solutions. By harnessing the security features of the Ethereum network and the validator guarantees provided by NEAR Protocol, NFFL makes transactions final in a matter of seconds, providing a paradigm shift for decentralized finance (DeFi) and blockchain-based applications.\n\nadvertisement\n\nNear Protocol NFFL Enhances Blockchain Interoperability\n\nFast cross-rollup communications support and defragmentation action on liquidity are core pillars of the NFFL initiative. NFL, by optimizing the transaction process and reducing waiting times, will enable developers to design apps that can smoothly integrate several Layer 2 solutions without losing speed and security. This improvement not only improves the user experience but also promotes innovation in the blockchain space, enabling developers to create new opportunities in DeFi, gaming, and other decentralized applications.\n\nAdditionally, NFFL’s focus on chain abstraction fits into the bigger picture of simplifying user interactions with blockchain networks. Through an infrastructure layer that makes transactions quick, secure, and interoperable, NFFL is fueling a world where applications and assets can roam the blockchain ecosystem. The fact that such an integration is seamless in a wide range of platforms acts as a unifying factor. It simplifies the process of cross-chain transactions, making the blockchain community a more accessible and unified community.\n\nNEAR Price Decline Amid Launch of NFFL\n\nDespite the significant strides made by NEAR Protocol through the launch of the Fast Finality Layer, the project has faced a price decline of 6.16%, with NEAR price trading at $6.96. While this decline may raise concerns within the cryptocurrency market, it is essential to acknowledge the long-term implications of initiatives like NFFL in scaling the Ethereum ecosystem and advancing the vision of chain abstraction for Web3.\n\nMaxwell Mutuma Maxwell is a crypto-economic analyst and Blockchain enthusiast, passionate about helping people understand the potential of decentralized technology. I write extensively on topics such as blockchain, cryptocurrency, tokens, and more for many publications. My goal is to spread knowledge about this revolutionary technology and its implications for economic freedom and social good.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxPNF82YW1vOEl5N2M1eEJieDBGS2wtd2Y4Vk5seEFWOGdFTGY0b19yeW4zVk9fWjlwLWh4UkdETVJmQzY1VWo3ajItSkxJU3NieVRVTEdrLWYwYnRNN1lVUDl1bk5uMi00SDdvWXVvT21iaG15NHBVYWo3eGFLTkNUVV9uQ210UTdKdE1ia0h1ZVRuc3htWUt0d041UXpQeEJkZElvYVhRX29CY2cxMm1EaVJ1RzR5Z9IBuwFBVV95cUxPN01PenhBejItSW43RkFLNVZFclp2M2k4bmtZdUNYbURaZzhCVGpueXNaR0FiS0VacWZmUkFlWFlHR2lMUTFvdmdSSTBSM1lURWhzeno5bkVpOHpGNEdJa2hOd3hYNjEwZDk2U2tLVmRWbHBkVXNvNU8xbHhlYWtIc2szb0FHeGIxbDRaamFHQkxNQnZENE5ha1ByVEg2NHVZQndRVmxPYklsM3FQUzN5Y1l4dTRMRHVfdGNB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 May 2024 07:00:00 GMT",
        "title": "Is Ethereum About to Take a Massive Drop? Here’s Why ETH Price Could Drop By 70% - Coinpedia Fintech News",
        "content": "A passionate cryptocurrency and blockchain author qualified to cover every event in the crypto space. Researching minute occurrences and bringing new insights lie within the prime focus of my task.\n\nIs Ethereum About to Take a Massive Drop? Here’s Why ETH Price Could Drop By 70%\n\nStory Highlights Ethereum slides below $3000 as the bears intensify their presence within the crypto space as Bitcoin drops below $62,500\n\nWith a stable descending trend, the ETH price is feared to drop to its initial levels, offering the traders a lifetime opportunity to jump in\n\nThe volatility has made its way into the markets with the selling pressure mounting over the crypto space. After a long fight, the bears are close to dragging the levels below the crucial support as the ETH price is trading in and out of $3000. With new bearish clouds looming over the markets, it will be more interesting to see whether the bulls can provide a solid foundation or the bears can squeeze profits!\n\nPreviously, it was believed that the ETH/BTC pair, which was gaining strength, was a clear indication of altcoins growing stronger than Bitcoin. However, a recent analysis suggests that the ETH price against USD or USDT drops heavily whenever the ETH/BTC pairs face rejection from the interim highs. Now that the ETH/BTC is falling under acute bearish pressure, will the ETH price recover from the recent losses?\n\nA popular analyst, Benjamin Cowen, referring to both pairs, believes the descending trend could soon knock in the ETH price.\n\nThe analyst refers to the weekly ETH price chart against the USD and compares the ETH/BTC’s variation. He marks the times when the ETH/BTC breaks down and indicates that the ETH price against USD encountered a 70% drop simultaneously. Now that the ETH/BTC has faced rejection, the analyst predicts a similar price action. He says,\n\n“The last 2 times that ETH/BTC broke down, ETH/USD then dropped approximately 70%. In a world where everyone has been preaching Alt Season for the last 2.5 years into a BTC dominance uptrend, I thought I would remind people that there is still downside risk,”\n\nWith this, the analyst sheds light on the possibility of the altseason being differed as there is still more room for the price to go down, probably below $2000. If this happens, the Ethereum (ETH) price may offer a lifetime opportunity to accumulate as the 5-digit price target continues to prevail for the rally in the long term.\n\nAlso Check Out : Ethena Token Jumps 18% This Week! Can ENA Price Reclaim $1?"
    }
]