[
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNZWpBTjFYbnBnTERkOGtWRFJ0cGMtb29zbk90WVJ6NXJ3ckp5eXA1dzBfVG1uWWE2ZFRVVHM1SHBfaHJJWEVCUnNhdEtrS1BtRkJFWlIweHd4Z3g5eVhYN1Fzek1idHRCbVdZUmxsY2tEdWV1ZHdMTUJMQjk0dEMzb0ZNemxCdVlMZzFmMtIBlAFBVV95cUxNdTdhajlYRWljTUFZMzc0d1lhcE01RFlfWkg1Y0J1YkoxNzFYVzVQMGdPME5vbDFGS0FuYVRUZlVRcHhsOU83N0NXejdTUzUzRU55RU1nTzZ4UFU3STN3YVp3R0pvT0Q4R1g3ZWl1UUg1MlVodUEydXVHN0VHek54Znc0dWhoLUY4LTFZQWE2WXhQemM2?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jan 2024 08:00:00 GMT",
        "title": "Laser-Eyed Franklin Templeton Sets Sights on Ethereum, Solana After Bitcoin - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIn a series of tweets on Wednesday, global investment firm Franklin Templeton opined about the merits of layer one blockchain Solana and Ethereum, leading to speculation about the investment giant’s next move.\n\nWe got the reins back. Thanks to our DA research team for the thread today. Please follow our @FTI_DA account for more updates from our Digital Assets team. https://t.co/D7Lgt0A0nU — Franklin Templeton (@FTI_US) January 17, 2024\n\nOne of the largest asset management companies in the world, Franklin Templeton, manages over $1.4 trillion in assets.\n\nAD\n\nAD\n\n“We believe as blockchains improve in fees and performance, the potential use cases that are unlocked grow exponentially,” the Franklin Templeton digital asset team said. “Improving the economics and experience for the end user cannot be overstated.”\n\nLast week, Franklin Templeton joined other major firms, including BlackRock, VanEck, Ark Invest, and Fidelity, in having their spot Bitcoin ETFs approved by the U.S. Securities and Exchange Commission.\n\nFranklin Templeton expressed admiration for the Solana blockchain, calling Solana Labs co-founder Anatoly Yakovenko's vision of it as a single atomic state machine a “powerful use case.”\n\n“On Solana, we see Anatoly’s vision of a single atomic state machine as a powerful use case of decentralized blockchains, lowering information asymmetry,” they said. “And we are impressed by all the activity seen on Solana in Q4 2023.”\n\nProjects driving the activity on the Solana Blockchain Franklin Templeton highlighted include DePIN, meme coins, NFTs, DeFi, and the high-performance validator client Firedancer.\n\nAD\n\nAD\n\nThe account also expressed excitement about Ethereum and its ecosystem, highlighting the growing pains of the largest proof-of-stake blockchain.\n\n“We are excited about ETH and its ecosystem,” the company said. “Despite the midlife crisis it's recently experienced, we see a bright future with many strong tailwinds to push the Ethereum ecosystem forward.”\n\nWe are excited about ETH and its ecosystem. Despite the midlife crisis it's recently experienced, we see a bright future with many strong tailwinds to push the Ethereum ecosystem forward\n\n-EIP 4844\n\n-Alt DA\n\n-Community Revitalization\n\n-Restaking — Franklin Templeton (@FTI_US) January 17, 2024\n\nThe firm highlighted several factors that it believes contribute positively to the Ethereum ecosystem's momentum, including EIP 4844, developments in alternative data availability (Alt DA), community revitalization, and restaking.\n\nThe Franklin Templeton account went on to say the company believes other layer-one blockchains besides Bitcoin, Ethereum, and Solana have potential.\n\n“Other L1s outside of BTC, ETH, SOL have massive potential, and we are continuing to support, monitor, and develop on these networks as they grow and mature,” they said.\n\nOther L1s outside of BTC, ETH, SOL have massive potential, and we are continuing to support, monitor, and develop on these networks as they grow and mature — Franklin Templeton (@FTI_US) January 17, 2024\n\n“The lawyers won't let us respond to comments, but we hear you,” the account concluded.\n\nAD\n\nAD\n\nThe lawyers won't let us respond to comments, but we hear you — Franklin Templeton (@FTI_US) January 17, 2024\n\nWhen asked to comment on the tweets, a Franklin Templeton spokesperson declined to comment further.\n\n“We cannot comment on any potential future fund offerings, but we can say that we are continuously monitoring developments in the digital assets and ETF ecosystems for opportunities to diversify our off,” the spokesperson told Decrypt.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTE41RkhDZFkzRHpqYWRqWWV0TDR5U0VrMFNkbHhLamtKWVgzbmN4WG56SUd3TzNxa2xZMGFmSU1oa09RS1J4TV9NV0FHaXZQdDJ1Z2lJWVV3MFNMYk15YklSSnNEVnptSGJhX3dOT2EyQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jan 2024 08:00:00 GMT",
        "title": "Top 10: Blockchain Platforms - FinTech Magazine",
        "content": "9. Ripple\n\nUsing technology honed over the course of a decade, Ripple operates as a blockchain-driven digital payment network and protocol featuring XRP, its native cryptocurrency.\n\nThe company’s mission? To build breakthrough crypto solutions for a world without economic borders.\n\nIn contrast to traditional blockchain mining, Ripple employs a consensus mechanism involving a network of servers owned by banks to validate transactions.\n\n8. Hyperledger Fabric\n\nHyperledger Fabric, from Hyperledger Foundation, is a blockchain framework implementation intended as a foundation for developing applications or solutions with a modular architecture.\n\nIt allows interchangeable components, including consensus and membership services, enabling a plug-and-play environment.\n\nDesigned to meet diverse industry needs, Hyperledger Fabric offers a unique approach to consensus that facilitates scalable performance while maintaining privacy.\n\n7. Corda\n\nDelivered by R3, a leader in the digitisation of financial services, Corda is a distributed application platform powering multi-party workflows in regulated digital finance.\n\nIt was initially engineered to meet the needs of customers who are operating at scale in regulated environments.\n\nCorda delivers on R3’s promise of enabling an open, trusted and connected “network of networks” in high-performance, regulated markets.\n\n6. EOSIO\n\nEOSIO is one of the major open-source platforms for blockchain innovation and performance, and is based on the cryptocurrency EOS.\n\nBusinesses and developers around the world are using the platform to create secure, transparent and deterministic digital infrastructures.\n\nBilled as fast, flexible and forward-driven, EOSIO is providing industry-leading transaction speeds and a block time latency rate of less than a second. It can handle a large number of transactions through parallel processing and asynchronous communication between nodes.\n\n5. TRON\n\nFounded in 2017 by Justin Sun, TRON is “dedicated to the decentralisation of the internet via blockchain technology and decentralised applications”.\n\nThe TRON network has continued to deliver impressive achievements since mainnet launch in May 2018. Just two months later came the acquisition and ecosystem integration of BitTorrent, a pioneer in decentralised services boasting almost 100 million monthly active users.\n\nIn recent years, traction has gained to the extent that TRON has more than 206 million users on the blockchain and upwards of seven billion transactions.\n\n4. Steller\n\nBy integrating a robust, decentralised blockchain network with a worldwide community of innovators, Steller is furnishing builders with the means to unleash human and economic potential.\n\nThis, in turn, generates opportunities that transcend borders and equips individuals with the tools to develop innovative digital asset products and services, ultimately improving access to the global financial system.\n\nSteller bills itself as being faster, cheaper and more energy-efficient than most other blockchain-based systems.\n\n3. Tezos\n\nBacked by a worldwide community of validators, researchers and developers, Tezos is an open-source blockchain protocol designed for assets and applications.\n\nIt was created specifically for the streamlining of formal verification, a method of boosting the security of critical or financially significant smart contracts by mathematically validating the accuracy of the code governing transactions.\n\nThe Tezos protocol is constructed to be secure, upgradeable and durable.\n\nUsers can directly and frictionlessly interface with each other over a decentralised network, interacting with various applications without the need for intermediaries."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxNQUk5Vk41RWFBSVJnYzRQUURCdzJUTUtKQ0gta1FibHlzbS1Wc3NzaVljTHNLeE5vYlNQSjJtbWZGYXhBOU4yWDgtYnlUdEZNSkg3TFByelpabGtFNElobFlUbXFBZXVMdkhPWGtRMzc1TXpuNGRBdzFBUXhUVzdMbnBNQUJSN2xO0gGOAUFVX3lxTE5HWmk1YnZPaHlYOFFQdTNyb3JQUXI1RFB0X0Z6ZVdCQ01NczJLbFVOczZnMF8yaDExeDlib2VHenVkVndwOE1kR0dfVFZSeGh1a2JQMmY1ZUVWVjR0Wm1WVlliTkRYTXl1RjNSNy1oU3h2Mm5rQWoxdnR0eVR3cWxiZjlZckNmV1RrSG4xTGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jan 2024 08:00:00 GMT",
        "title": "Vitalik Buterin Makes Important Statement About Ethereum Layer 2s - U.Today",
        "content": "A recent conversation with Vitalik Buterin on X platform sheds light on a few important topics regarding L2 networks – the main scalability tool for the Ethereum network.\n\nAdvertisement\n\nAt its core, an L2 solution is a secondary framework or protocol built atop the Ethereum blockchain, designed to increase transaction capacity and speed without compromising the security provided by the main chain, known as layer 1 (L1). This conversation is vital because it helps users understand the types of solutions available and their respective tradeoffs.\n\nYeah I agree with this. I called them \"security-favoring\" vs \"scale-favoring\" here, but we can probably come up with better terms (\"strong L2\" vs \"light L2\" perhaps?)https://t.co/oSPZkB3Xo3 — vitalik.eth (@VitalikButerin) January 16, 2024\n\nButerin participated in a discussion clarifying that \"L2s\" encompass both rollups and validiums. The distinction is important for users to grasp the different security and scalability features. Rollups are \"security-favoring\" solutions that bundle or \"roll up\" transactions into a single proof, which is posted to the main chain.\n\nThis process allows for high security, as the L1 blockchain directly secures them. In contrast, validiums are \"scale-favoring,\" designed to boost capacity by storing data off-chain but with proofs still on-chain, offering slightly less security for much greater scalability.\n\nThe distinction is nuanced but significant. While rollups are more expensive due to the data being posted on-chain, they offer higher security. Validiums, on the other hand, provide a cheaper alternative, with a slight tradeoff in security. Buterin suggests that the terminology should reflect these differences without delegitimizing either option. In the spectrum of L2 solutions, he proposes terms like \"strong L2\" for rollups and \"light L2\" for validiums to help users navigate their choices better.\n\nInterestingly, Buterin also points out that the architecture of L2 solutions is not strictly about security levels. He previously attempted to categorize these layers but recognized that there is a significant \"intermediate space\" between rollups and validiums, further complicating the classification."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMibkFVX3lxTE9Cc1NVeWxRNC1BekhCcHpTVDhwbmFmSVRPekZTSnN5SWtsTGlsa1dtSXVZVmFHSjFYUkVJNHNlN0NMM1lkUUpnRWRpSnVCT2dmbUxRdU01cC1MSzR2NlBjaDd5SWIwZ0JLVENlU3ZB0gFzQVVfeXFMT1VDWENJOWw4V3JDS0VmcDhOT0pWVXFKWHdfVUNwRjRRU0FtTlQ0bGtVNlRkT0l6M3k5THF5UkZUczlXZVc0ZTg0LUozY242QWk0OUVnX1BzS1Q3TXlKU0NZRzZXWTU4TmhJMW1lUnVmTmZYNA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jan 2024 08:00:00 GMT",
        "title": "Ethereum: Dencun Activation Goes Wrong, Mainnet Launch Uncertain - Bitcoinist",
        "content": "Ethereum’s journey towards a more scalable and efficient blockchain encountered a significant roadblock when the highly anticipated Dencun upgrade failed to achieve finalization on the Goerli testnet today. Activated at 6:32 UTC, the upgrade’s inability to reach consensus has injected uncertainty into the timeline for its deployment on the mainnet, prompting a detailed examination of the factors at play.\n\nEthereum Dencun Fails To Finalize – Here’s Why\n\nEthStaker, a prominent voice in the Ethereum staking community, shed light on the complexities underpinning the non-finalization issue. “The low participation on Goerli suggests a mix of potential client issues and a lack of updated validators. While not overly concerning in the short term, this does necessitate a deep dive into whether these issues stem from validators not upgrading their systems or more systemic client-side problems,” EthStaker explained.\n\nAnd it seems like we have a chain split! Client teams are looking into it, but it's likely to a while to pin down + fix the issues. Keep an eye out for updates! — timbeiko.eth ☀️ (@TimBeiko) January 17, 2024\n\nTerence Tsao from Offchain Labs elaborated on the multifactorial aspects contributing to the testnet’s challenges. “With a participation rate hovering around 80%, the key to losing finality often lies in approximately 10% of validators being offline,” he stated.\n\nThis may be due to several factors, including failure to update software components or the presence of bugs. “Given Goerli‘s diverse validator composition, it’s premature to conclusively determine the root cause of the issue at hand,” Tsao remarked.\n\nHe advocated for a comprehensive and time-intensive analysis before making any definitive judgments about the Dencun upgrade’s success or potential delays. Proto Lambda, an Ethereum scaling and R&D expert, pinpointed a specific technical mishap that exacerbated the situation. “The accidental removal of ‘historical roots’ from the beacon state by Prysm led to a network split. This highlights the intricate challenges in managing the beacon state, a pivotal component of Ethereum’s consensus mechanism,” Proto Lambda highlighted.\n\nEthereum Goerli upgraded to Dencun / EIP-4844 🎉 And historicalRoots accidentally dropped from the beacon state by Prysm & a resulting network split 😅 pic.twitter.com/5jHU6pq2vX — proto.eth (@protolambda) January 17, 2024\n\nThe beacon state’s evolution, especially with the implementation of SSZ tree hashing, was meant to streamline state management, including the handling of the HistoricalSummary container. This container plays a crucial role for light clients and in creating Merkle proofs against past states.\n\nEthereum Improvement Proposal 4844 (EIP-4844)\n\nThe Dencun upgrade, deeply intertwined with EIP-4844, represents a cornerstone in Ethereum’s strategy for scaling and enhancing network efficiency. EIP-4844’s introduction of blob-carrying transactions is a groundbreaking step towards reducing gas costs by facilitating temporary data storage in beacon nodes. This move is expected to significantly enhance transaction throughput and lower fees, providing immediate relief and setting a foundation for future scalability solutions.\n\nProto-danksharding, a term coined from the contributions of researchers Protolambda and Dankrad Feist, underpins this process. It represents a simplified yet potent version of danksharding, aiming to radically cut down gas fees and improve transactional efficiency. This development is a crucial part of Ethereum’s scaling roadmap, ensuring compatibility and future readiness with the network’s long-term strategic vision.\n\nImplications And Future Steps\n\nThe Ethereum community and developers are now racing against time to resolve these unforeseen challenges.\n\nTsao stated:\n\nPrysm encountered a bug right at Goerli’s hard fork. The bug has been identified, and a fix is currently being merged. A hot patch image will be released within the next few hours. Sorry for the inconvenience, and thank you for your patience!\n\nThe transition from Goerli to Sepolia, and eventually to the Holesky testnet, signifies a cautious but strategic approach in Ethereum’s upgrade rollout.\n\n“If all goes well with the testnets, my own personal estimate for Dencun on mainnet is mid-late March,” Sassal.eth, founder of The Daily Gwei, noted prior to the Dencun testnet upgrade. Following the faulty start, it is uncertain whether this schedule is still tenable.\n\nAt press time, ETH traded at $2,546.\n\nFeatured image from Shutterstock, chart from TradingView.com"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxOX0NwMGRMeUtHSGhTVGk4WnJ5ek5vSzdJTDR2UG4wVFdndmpVMm1jQzBKVHI2RERnMGwwbk9KWExqRHQ5MXlyekl5UXBIenAwSzFiSWNjODRBck0xR1VoZ3drMkJUZlNLOTZsQlo3MzM0YTRiS2xTVnJ1RHFYZm9felVya1JQZUVGczBFOTVmbnFtUzZpTjNUZA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jan 2024 08:00:00 GMT",
        "title": "Telegram trading bot Unibot hits record use on Solana after Ethereum success - DLNews",
        "content": "Telegram bots welcome a flood of new users from the memecoin trading community on Solana.\n\nTrading volumes through Unibot are now heavily dominated by Solana.\n\nThe success of Unibot’s migration has caught the attention of competitors in this sector.\n\nDaily users on Unibot, the mega-popular Telegram trading bot, hit an all-time high after its Solana integration this month.\n\nOn January 11, Unibot’s daily users soared to a record. Days later, daily users jumped another 43%, reaching a new all-time high of 3,151 on January 15.\n\nTelegram bots are designed to simplify on-chain trading by letting users buy and sell tokens on decentralised exchanges — or DEXs — through the popular messaging app.\n\nThese features were trendy among meme coin traders on Ethereum last summer, as six of the top 10 trading pairs of all time were meme coins.\n\nUnibot’s Solana launch has helped turn its fortunes around after falling use on Ethereum, where it was initially launched. Solana users now account for 90% of Unibot’s users, and over 79% of the total volume.\n\nSince its Solana launch on January 4, Unibot earned $275,000 in fees to add to the $534,000 it earned in fees on Ethereum.\n\nThis is an over 50% increase in total fees generated that Unibot would not have had without integrating Solana.\n\nTotal volume generated by Unibot daily. (Dune: @Whale_Hunter)\n\nThe episode shows that Solana, which prides itself on low transaction fees and its dApps’ slick interfaces, is winning over the DeFi degens who make up Unibot’s user base.\n\nJoin the community to get our latest stories and updates\n\nA second start with Solana\n\nUnibot’s expansion to Solana comes as trading on the blockchain has boomed throughout December.\n\nDecentralised exchanges on Solana are now the third-most active among traders behind those built on Ethereum and Arbitrum.\n\nLast summer, Ethereum also saw a similar memecoin mania to the one that just occurred on Solana, driven mainly by the advent of Telegram trading bots like Unibot and Maestro.\n\nAt its peak in August, Unibot facilitated over $8 million in daily trading volume through its Telegram trading interface, generating over 11,400 Ether worth $29.5 million in lifetime fees.\n\nBut with a significant portion of memecoin trading activity exiting Ethereum to other chains — most notably Solana — in recent months, Unibot’s revenue has also dropped.\n\nNow, in what was a bid to boost revenues, trading bots popular among traders are following them to Solana. And it appears to be working.\n\nCompetitors follow suit\n\nOne of Unibot’s main competitors, Banana Gun Bot, has also made the move to Solana.\n\nBanana Gun Bot saw similar success following its launch on Solana. The total fees generated on January 16 were the most since December 6, and the fourth highest all time.\n\nIn just three days, it has generated over 270 SOL in fees, worth approximately $27,000 at current prices.\n\nDaily active users also saw a bump, on January 16th 1,727 new users and 4,543 total users interacted with the bot. This is just below the previous all time high of 4,730 total users set on November 29.\n\nUNIBOT token\n\nThe price of Unibot’s eponymous token has gone up by 85% over the past month, trading around $94.\n\nRevenues generated by Unibot are shared with token holders who hold at least 10 UNIBOT. Holders have received over 4,496 ETH in total rewards, valued at over $11.3 million at current prices.\n\nUnibot's token price\n\nToken holders can earn even more rewards by distributing their unique referral code to other users. Referrers earn 25% of the total fees generated by anyone who uses their referral code.\n\nHolders can expect to receive a 9.43% APR for staking."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE5ldloyZW1fQU1lVkNQNEdTVFEyYmtfaHZrcnFKdkl1NF9EN2VPQzhmbzFrVmN2cXN4SzkyZmJoa0QwYmtUdFE0Mzh5YWlOMmYtSS1GSS1TRHVyZFR2OW1GdXV2RmxNeE5YN0JyTHVkX3pEdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jan 2024 08:00:00 GMT",
        "title": "Best 7 Ethereum Layer 2 Networks - Crypto News Australia",
        "content": "Ethereum is powering the future of decentralised finance (known as “DeFi”). The blockchain hosts thousands of applications and millions of active users as it drives a new era of financial authority. But as DeFi’s leading blockchain, it must be well-equipped to scale as an influx of apps and users join the network.\n\nCurrently, there are limitations with the Ethereum protocol due to its (relatively) slow speeds and high transaction fees. These issues have led to the emergence of Ethereum Layer 2 (L2) projects – designed to improve network performance and enable the continued expansion of the DeFi revolution.\n\nRelated: How to buy Ethereum in Australia\n\nWhat are Ethereum Layer 2s?\n\nAn Ethereum Layer 2 project is a network that operates on top of the main Ethereum blockchain (known as a “Layer 1”). Layer 2 projects allow decentralised applications (dApps) to funnel transactions and other processes off the main blockchain – which can reduce congestion, increase finality speeds and cheapen gas fees. Layer 2 chains make use of Ethereum’s privacy and decentralised infrastructure while reducing the burden on its main network.\n\nAdvertisement\n\nHow We Ranked Ethereum Layer 2s\n\nThere are several metrics we can use to determine which Ethereum Layer 2s maintain the healthiest ecosystem. A strong userbase, constant dApp development and high transaction volumes tend to indicate the long-term security and viability of a L2 project.\n\nTotal Value Locked (TVL). This is the dollar-amount of cryptocurrency locked up in smart contracts on a blockchain. It encompasses staking services, DeFi savings account and so on.\n\nThis is the dollar-amount of cryptocurrency locked up in smart contracts on a blockchain. It encompasses staking services, DeFi savings account and so on. Monthly transactions. Monthly transactions can suggest a certain L2 is ideal for traders due to its low gas fees and fast settlement times. This metric can also point toward the popularity of decentralised applications on the network.\n\nMonthly transactions can suggest a certain L2 is ideal for traders due to its low gas fees and fast settlement times. This metric can also point toward the popularity of decentralised applications on the network. Ecosystem and dApps. A huge reason for DeFi’s success is dApps – so the more popular platforms within an ecosystem, the more likely it will maintain a healthy userbase over time. Usually, high-profile decentralised exchanges (DEXs), NFT marketplaces, DeFi protocols and games will contribute to a thriving ecosystem.\n\nCheckout out our guide on analysing cryptocurrencies for more details.\n\nBest Layer 2 Networks\n\nArbitrum\n\nArbitrum is an L2 scaling solution for the Ethereum network with a focus on helping developers create new Ethereum Virtal Machine (EVM) dApps in just minutes. Arbitrum can do everything Ethereum does – but faster and cheaper.\n\nArbitrum dominates the Ethereum L2 world, capturing nearly 50% of the market share. It has by far the highest total value locked (TVL) and monthly transaction data of any EVM scaling solution. It boasts hundreds of the DeFi ecosystem’s most popular applications, including Uniswap, 1inch and Beefy Finance.\n\nArbitrum’s governance token, ARB, allows holders to vote on proposals and participate in economic/development decisions of the L2.\n\nView live ARB price.\n\nOptimism\n\nOptimism is a community-focused Layer 2 framework that offers DeFi projects lightning-fast transaction speeds and lower costs to transmit data to and from the base Ether blockchain. Optimism is an optimistic rollup chain, which means a large batch of transactions are “rolled” together and then processed on the Layer 1 network.\n\nOptimism is a clear number two when it comes to on-chain metrics, trailing only Arbitrum in Total Value Locked and market share. It is also home to the vast majority of popular Ethereum dApps, like Slingshot, Aave and Sushiswap. The network’s native governance token is OP.\n\nView live OP price\n\nPolygon\n\nPolygon (MATIC), originally intended as a competitor to Ethereum, is now a scaling solution that intends to connect multiple blockchains to the network in order to reduce costs and improve efficiency. The L2 uses what’s known as “sidechains”, a web of independent networks that help decongest the main Ethereum blockchain.\n\nThe network constantly jostles with Optimism as the L2 with the second-most total value locked and on any given day can boast more than USD $300m in transaction volume.\n\nThe Polygon team has also developed a separate zero-knowledge Ethereum Virtual Machine (zkEVM) network that has a greater focus on security and superior transaction speeds to its counterpart.\n\nBASE\n\nBASE is a relatively new L2 solution developed by global cryptocurrency exchange Coinbase. Like most other L2s, BASE uses rollups to bundle transactions together to optimise using EVM dApps.\n\nBASE is built atop Optimism’s open-source stack, meaning it shares the same excellent scalability, interoperability and ease of development. Additionally, BASE is designed to be the blockchain for Coinbase use cases – allowing it to leverage the hundreds of millions in assets currently held on the exchange.\n\nBASE supports all of the main EVM apps you would want – AAVE, UniSwap and Banxa, along with some more unique offerings such as Friend.tech. And despite the L2’s relative infancy, it still boasts excellent on-chain metrics, coming in the top five for TVL, market share and monthly transactions.\n\nLoopring\n\nLoopring is an Ethereum Layer 2 project that provides low fees and high speeds for trading, lending and engaging in other financial activities using ETH. The protocol uses zero-knowledge Rollups, allowing for near-instant finality.\n\nLoopring’s key mission is to combine the benefits of centralised exchanges (liquidity and efficiency) and decentralised exchanges (greater freedom, cheaper transactions, no third-party) on Ethereum. The team also plans to improve the L2s interoperability by building support for chains other than Ether, such as Qtum and Neo.\n\nGiven its unique vision, Loopring lacks the same mass of dApps that some of its competitors do, but still offers impressive financial services (lending/borrowing, earning, NFT management and a trustless wallet). It ranks in the top 15 for total value locked.\n\nThe LRC token is native to Loopring’s L2 for Ethereum. View LRC price live.\n\nImmutableX\n\nImmutableX is an Ethereum L2 scaling solution with one industry in mind – blockchain gaming. The demand for GameFi has increased over the years, and ImmutableX is the first L2 for NFTs. Like most other popular L2s, ImmutableX is built with zkRollups which has vastly improved the gaming experience for both developers and players.\n\nImmutableX is home to several highly-touted NFT marketplaces and GameFi platforms, including Gods Unchained, Illuvium and Guild of Guardians. The constant addition of new games has led to ImmutableX surging up the on-chain rankings, now sitting comfortably in the top ten for monthly transactions and TVL.\n\nView live IMX price.\n\nMetis\n\nMetisDAO is an Ethereum L2 with the goal of solving what many have called impossible – the blockchain trilemma. The Metis team wants to create a solution for Ethereum that’s scalable, decentralised and secure. The protocol uses Optimistic Rollups to bundle transactions for faster procession on Ethereum, leading to lower gas fees and higher transaction throughput. The developers are also working on an evolution of these Rollups to further improve efficiency and on-chain privacy.\n\nMetis has an excellent list of supported dApps, including heavy-hitters OKX, Stargate and Metamask. It has the third-most total value locked of any Layer 2 network, thanks to its popularity surging in 2023. It also sits around the top 20 for monthly transaction volume.\n\nMETIS is the native token of the MetisDAO L2 and can be used to participate in governance.\n\nWhy Do People Use Layer 2 Networks?\n\nThe main Ethereum 1.0 blockchain currently has a low transaction speed of around 7-15 transactions per second (TPS). Layer 2 solutions can theoretically handle much faster speeds of up to 9,000 tps by pushing most of the hard processing “off-chain” – either through the use of sidechains or Rollups. Additionally, using the main Ethereum L1 can be quite a costly experience, which may turn away many potential adopters.\n\nThere are an increasing amount of layer 2 projects and sidechains in circulation, each working to improve the user experience for swapping coins and tokens, minting NFTs, reducing transaction fees and increasing the speed of transactions. This also makes it much cheaper for developers to host and improve their applications on Ethereum.\n\nHow to buy Layer 2 network tokens\n\nMost of the layer 2 networks listed above have native tokens that you can purchase to get exposure to these projects.\n\nSome tokens like ARB, OP and IMX are ranked in the top 50 cryptocurrencies by market, which shows the relevance of layer 2 networks in the market today. You can buy several layer 2 tokens on Australian crypto exchange, Swyftx.\n\nConclusion\n\nLayer 2s are the next frontier of Ethereum-based decentralised finance. The success of these protocols will have a big say in the adoption of EVM dApps over the next decade. As these projects work together to bring the next evolution of DeFi to the sector, it will be enthralling to watch if Ethereum can truly revolutionise the world of finance as we know it."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxQdjBHZm9fYVNJbVlUVnMzanNKMG9mNVJsR0w0Zk1QMTJ0d202aU1QVmJsM2RpNVZRQVJRN2M4RG1xX3FVN3VpdTc3N3FWRFl2RWlpcW5ZSkNmbGRPREh2RC1LVWpSOThhSGRpZE0yczNGUWgyejhmYVZZS2Q1SlJMUENISm1INknSAY8BQVVfeXFMUFB6eEJmVVpYQlF5RUgyRlFraUZLQkdkSWdtQnNKM0Y0c1pTcnBWcjNuRU5YWnBtNVV5Z3ZHMER6dmNlOUhFaEZ3bGsyV3cyeGV5U0xodFBkV3hJVDY4cFd3VHQxNE9hWVFNQ3RxTEs5NWt2VlZkMGtlUG5ySl9uMjhFTzBlLXl1TXN0MlViS0k?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jan 2024 08:00:00 GMT",
        "title": "What Is Immutable? The Ethereum Network for Crypto and NFT Games - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nImmutable X is a layer-2 scaling network built on top of Ethereum, the leading blockchain for decentralized applications. Developed by the Web3 firm Immutable via tech created by StarkWare, Immutable X uses the native ERC-20 token IMX and hosts a number of different blockchain games on its network like Gods Unchained, Guild of Guardians, Illuvium, and Ember Sword, to name a few.\n\nWhile Ethereum proponents argue that its mainnet is among the most decentralized and secure of all cryptocurrencies, it’s also historically suffered from high gas fees and long waits to make transactions. This has long caused friction with NFT creators like those behind the CryptoKitties, who once clogged the mainnet with their digital cats and made it virtually unusable.\n\nBecause NFTs—unique blockchain tokens that signify ownership—are currently so essential to blockchain games, it’s unfeasible for most game developers to build on the Ethereum mainnet. That’s where layer-2 solutions like Immutable X come in, plus Immutable is expanding with another new zkEVM scaling network ahead. Here’s what you need to know about the Immutable platform.\n\nWhat is Immutable X?\n\nAD\n\nAD\n\nImmutable X is a gaming-focused protocol that’s built atop the Ethereum mainnet’s security, but with the speed and lower transaction costs of a layer-2 scaling network. In other words, it provides additional benefits on top of the Ethereum mainnet.\n\nAccording to Immutable X’s whitepaper, the network allows users to make transactions with zero gas fees. This is partly possible due to Immutable X’s use of StarkWare’s ZK rollup technology which bundles transactions and can enable over 9,000 NFT transactions per second.\n\nWho created Immutable X?\n\nImmutable is the main Web3 firm behind the Immutable X protocol. The company is part blockchain developer and part game publisher, as Immutable developed the NFT card-battling game Gods Unchained and is publishing the action role-playing game Guild of Guardians.\n\nPer Crunchbase data, Immutable has raised nearly $280 million in funding from 32 investors as of January 2024, with firms like Tencent, GameStop Digital Ventures, King River Capital, and the now-defunct Alameda Research investing.\n\nHow does Immutable X work?\n\nImmutable X supports all Ethereum wallets, such as MetaMask and Coinbase Wallet. Users can also create an Immutable Passport to transact on the network. Immutable Passport is designed to be a streamlined and more approachable crypto wallet for gamers, plus it provides a unified identity across games.\n\nAD\n\nAD\n\nThe protocol itself sits on top of the Ethereum mainnet, allowing for Immutable X to leverage the mainnet’s decentralization and security for finalizing transactions. But because Immutable X uses ZK rollups, its transactions on its layer-2 network are still able to be fast and cost-effective.\n\nImmutable has built multiple REST application programming interfaces (APIs), meaning they are APIs that adhere to a specific set of architectural standards. Immutable’s REST APIs mean that transactions can consist of an API call, which takes less time than engaging with a protocol directly via a smart contract.\n\nWho's using Immutable X?\n\nA number of different NFT marketplaces and game developers have chosen to offer their products and services on ImmutableX. In June 2022, Immutable Ventures established a massive $500 million fund to invest in Web3 gaming projects being built on Immutable X and to also provide various developers with grant-based funding.\n\nRarible, Mintable, NFTrade, TokenTrove, OKX, and Kinguin are NFT marketplaces that use Immutable X. Brick-and-mortar video game retailer GameStop also launched its NFT marketplace on Immutable X in 2022, but has since discontinued its own crypto wallet and has said that it will shut down its marketplace in February 2024.\n\nGames like IMVU, Guild of Guardians, Habbo, Cross the Ages, Undead Blocks, Ember Sword, Planet Quest, Gods Unchained, WAGMI Defense, and Tiny Colony are building their Web3 elements on Immutable X.\n\nAs the world of Web3 gaming heats up, Immutable X faces competition with other blockchains like Polygon, Avalanche, Arbitrum Nova, Sui, and Solana to offer a fast and seamless gaming experience.\n\nWhat is Immutable zkEVM?\n\nImmutable is developing more than just Immutable X as its Ethereum gaming platform expands. In March 2023, the firm announced that it is working with competitor Polygon to develop a new Immutable zkEVM scaling network that combines Polygon zkEVM technology with Immutable’s gaming platform.\n\nA number of games have already announced that they’ll be using the Immutable zkEVM, from MetalCore to Shardbound and Elemental Knights. According to an Immutable blog post, the zkEVM network provides native compatibility with Ethereum Virtual Machine smart contracts, potentially making it easier for developers to port over from EVM chains and utilize an array of third-party tools.\n\nAD\n\nAD\n\nAs the Immutable platform grows, the IMX token has become the most valuable gaming token as of this writing, with a market cap of nearly $2.7 billion. That makes it the 37th largest overall cryptocurrency by market cap according to data from CoinGecko, as of January 17, 2024.\n\nEdited by Andrew Hayward"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxNREJVVkd2Nm1pTmJwTDF2ZnhzbFpuMEd4U3dBejY4TjF4ZkZTTV9rMjVmS2dIZzlXaG85bXVsdXRhV25iam84Q1Y3REJTb1BfNHpFMVNOa1oyOVN0c2lpQ2RqSms0ZkpmVDJGbUxad1FXUEowQjEwaXU2R2ZwOUlmbFBlejdDR01qZVpPZ1ltMXJkY1dOZ1BHRlRFSmJtZ9IBowFBVV95cUxPd1R0c1oyQXZQd3BMakk4c1NyNi1wSkRQN3BRcm5jY25rWUp5bjV0VHU3RWRvQWkxcGZKdnhha0pmVHZfNGRJV1k2ZmhZdE1mMldndXp3QlJHb1JMdHdXaEN6Z25UQ0Y4WjV4dEFKcHJCZDF0QVk3YWZ0VFhaSHpxMXZfNC1fd2hEbW42M0N4SnRtLTQ4a3VyN0tyaWJ0RlpCaGRF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jan 2024 08:00:00 GMT",
        "title": "Ethereum (ETH) Price Dominance Over Bitcoin Grows, Exchange Supply At All-Time Low - CoinGape",
        "content": "While the Bitcoin price has been consolidating largely post-ETF approval, Ethereum (ETH) has been making strong upside moves, thereby closing the gap with BTC. At press time, the Ethereum price is trading 1.44% up at a price of $2,564 with a market cap of $308 billion.\n\nThe Ethereum Price Dominance\n\nAccording to insights provided by on-chain data provider Santiment, Ethereum’s price dominance has experienced a notable surge against Bitcoin, marking a +22.4% increase over the past week. This period has witnessed the creation of 89.4K new Ethereum addresses per day, further underscoring the platform’s growing traction. Notably, a staggering 96.3K wallets were created just yesterday.\n\nadvertisement\n\nIn addition to these on-chain activities, Santiment’s data reveals a significant trend in Ethereum’s supply on exchanges, nearing its All-Time Low of 8.05%. This movement toward self-custody and staking implies a reduced risk of an imminent selloff, presenting a more favorable scenario compared to concerns arising from a rising supply on exchanges. These on-chain dynamics shed light on Ethereum’s current market strength and its potential implications for future price movements.\n\nETH Price Action Going Ahead\n\nIn the recent trading session on Tuesday, Ethereum price initially experienced a slight pullback, testing the crucial $2,500 level. Notably, this level had previously served as significant resistance but now appears to be providing substantial support for the cryptocurrency. The price action suggests Ethereum’s attempt to enter a consolidation phase.\n\nThe $2,700 level emerges as a key threshold, representing the upper boundary of the short-term trading range. Analysts consider this level crucial, and a breakthrough could set the stage for a potential market surge, with Fear of Missing Out (FOMO) traders likely to join the rally. Beyond $2,700, the Ethereum price could further rally all the way to $3,400.\n\nConversely, a downside scenario could unfold if the second-largest crypto by market cap breaks below the hammer formed during the Monday session. In such a case, the cryptocurrency might see a downward movement toward the 20-Day Exponential Moving Average (EMA), situated around the $2,300 level. Traders are closely monitoring these critical levels, anticipating potential shifts in Ethereum’s short-term trajectory.\n\nBhushan Akolkar Bhushan is a FinTech enthusiast with a keen understanding of financial markets. His interest in economics and finance has led him to focus on emerging Blockchain technology and cryptocurrency markets. He is committed to continuous learning and stays motivated by sharing the knowledge he acquires. In his free time, Bhushan enjoys reading thriller fiction novels and occasionally explores his culinary skills.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxOcmlLTWxGTGxzMEZpa1VBOWFhWmRRY01idEVwLWxrczk2eWZGbXJMMktKNmxkQ3hWelcyaEVlM294THVyUnBMaEJvTy1sZ0dud0FYLTM4OW03ekc1UFpaNmY4bWdGeEpWVEJ5ZkVqb29TNGh4SEM5VWw2RUFaR0xhU08xd0VRZ2hORFRibUJlUTFsSkRkT0xaZS1XVkx6Z0h2ZDNpY1NKaGRaTVNyMGfSAbMBQVVfeXFMTkRwSUZXQkhaOTB1bHFab3l1Um4xbVRFdGViczBNVFpwNEtfMjJ6N3JYa1ozNXdkaUJpQ1JHblBaRlJjS19ubzl3SDhxcndKVGJEcnFqZXRkNkZrNlVqWWZCd0ktLTg2QXJ0RXl5cU5QUmpUOU82TklqVEJvZ2liekxoT3M0ZGRvaU5EYzdOMEU2S014bHRCdEhicW9NbF9ybVhHdW1vdmJ6aHdCdmVJdHZYUjQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jan 2024 08:00:00 GMT",
        "title": "Shiba Inu (SHIB) Becoming Bullish, Ethereum (ETH) Price Screams Rally Continuation, Bitcoin (BTC) Not Giving up Market Dominance - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nShiba Inu currently displays an ascending triangle pattern on the SHIB/USDT chart. This technical formation is widely recognized and could be a signal to a significant price surge for the meme.\n\nAdvertisement\n\nAn ascending triangle is characterized by a flat upper resistance line and a rising lower support line. This pattern suggests that buyers are gradually gaining ground against sellers, as each dip is bought up at a higher level than the previous one, indicating accumulating pressure for an upward breakout.\n\nSHIB/USDT Chart by TradingView\n\nFor Shiba Inu, which has been lingering in a period of relatively nonexistent activity, this pattern could serve as massive fuel for volatility in the near future. Recent market conditions have seen a decline in interest toward legacy meme coins, with SHIB being no exception. The lack of significant developments within the Shiba Inu network has contributed to the muted activity around this cryptocurrency.\n\nIn contrast, the majority of the action in the meme coin sector has been taking place on the Solana network. This platform has become a hotbed for the deployment of new meme coins, which are exhibiting far greater volatility than those on the Ethereum network, where Shiba Inu resides. The brisk activity on Solana contrasts sharply with the sluggishness observed in Ethereum's meme coin space, drawing in traders and investors looking for quick gains and high excitement.\n\nEthereum's correction is temporary\n\nThe Ethereum market is currently exhibiting a correction, and there are patterns that suggest a rally may not only be on the horizon but could also be in continuation. The asset has recently experienced a sharp downturn, movement that is readily apparent on intraday timeframes. However, such stark movements are often precursors to reversals, signaling that Ethereum could be gearing up for an upswing.\n\nA closer look at the charts shows Ethereum's price action respecting a series of key technical indicators which, together, build a case for potential upward momentum. The asset has been tracing back to touch base with its moving averages, a behavior that is typically followed by a rebound, as these levels can act as dynamic support zones.\n\nThis corrective phase is noteworthy, especially considering the robust rally Ethereum enjoyed in the preceding weeks. Corrections are a natural and healthy part of any asset's price trajectory, allowing for consolidation before the next leg up. For Ethereum, the current pullback could be shaking out weak hands, setting the stage for a stronger rally propelled by a more committed investor base.\n\nBitcoin's dominance not going anywhere\n\nAfter a brief breach below the 50-day EMA — a critical indicator of medium-term market sentiment — Bitcoin has clawed its way back above this pivotal level. This move indicates a bullish signal for market observers, suggesting that Bitcoin is not yet ready to relinquish its market dominance.\n\nHowever, the ascent above the 50 EMA has not been met with the kind of vigorous momentum that bulls would hope for. The growth has been moderate, hinting that Bitcoin might encounter selling pressure as it ascends. This is not unusual on the crypto markets, where significant moves often face immediate resistance as traders take profits and skeptics cast doubts.\n\nThe recent price action has been a roller coaster for Bitcoin, which saw its value tumble from highs around $47,000 to lows near $41,000. This downturn briefly shifted the spotlight to altcoins, which seized the moment to stage local rallies. The diversification of gains across the crypto spectrum during Bitcoin's periods of weakness is a trend that has become more pronounced as the overall market matures.\n\nYet Bitcoin's ability to push back above the 50 EMA serves as a reminder of its underlying strength and the confidence investors have placed in it. Despite the opportunity for altcoins to rise, Bitcoin remains the anchor of the crypto market, with its moves often dictating broader market sentiment. This recent rebound above a crucial technical level could be interpreted as Bitcoin's silent assertion that it is not ready to give up the throne just yet."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxNWDJfRnh6SHp2NXFjc1JsWXRDWDFBX2hwTUdZS2dsRHJhOHJaUElYTVc5c2xLZm5KeWFENVJlSV94TGVrV053MVRLbE1kcEZucVNIeEZGem90bEhGOU0zRXRUR2dLWG9NZnh1Ml9lbThDakRfOUhzS2J2QndRZ1FNeDB1Sk9KZXVrQ0NJWF85ZFBvTVFqbl8zdVMyZmpvTk9KZk1lU0FVRUl3NlRqXzY0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jan 2024 08:00:00 GMT",
        "title": "Il dominio di Arbitrum nello spazio crypto: l'ascesa delle reti layer 2 - The Cryptonomist",
        "content": "In the dynamic crypto landscape, Arbitrum has kept pace with Ethereum, executing 375.3 million transactions in 2023, solidifying its position in the Layer 2 network revolution.\n\nLet’s see all the details of CoinGecko’s new 2023 cryptocurrency report in the article.\n\nCrypto Arbitrum challenges Ethereum mainnet with 375.3 million transactions\n\nAs anticipated, according to the new CoinGecko report, last year the Arbitrum crypto handled 375.3 million transactions, almost on par with the 383.1 million on the Ethereum mainnet.\n\nMore generally, in 2023, Layer 2 networks have totaled over 1.31 billion transactions, of which precisely 375.3 million on Arbitrum, constituting 28.6% of L2 transactions on Ethereum.\n\nArbitrum has accounted for over a third (37.5%) of transactions on Ethereum Layer 2, excluding opBNB.\n\nThis system has also almost matched the number of transactions of the Ethereum mainnet, which recorded 383.1 million transactions in 2023.\n\nIn the fourth quarter, transactions on L2 grew by 93.8%, reaching 659.0 million compared to the previous quarter’s 340.0 million.\n\nThe significant increase is mainly attributable to opBNB, with 304.8 million transactions (47.6%) in the fourth quarter, mainly due to an increase in registrations. In fact, in December alone, the network recorded several days with over 20 million transactions.\n\nIn addition to these remarkable achievements for Arbitrum, the CoinGecko report also provides valuable information on the 2023 performance of Bitcoin, Solana, NFT, and more.\n\nThe beginning of 2024 for Arbitrum: increase in DEX volume and historical TVL\n\nThe level 2 network, Arbitrum, built on the Ethereum blockchain, has started the new year with a strong performance. The platform has indeed shown significant increases both in trading volume and in the valuation of its native token, ARB.\n\nAccording to on-chain data from DeFiLlama, the volume of decentralized exchanges (DEX) on Arbitrum has surpassed other blockchains, including names like Binance Smart Chain, Solana, and Polygon, in the last week.\n\nSurprisingly, on January 5th, the DEX volume on Arbitrum briefly surpassed that of the Ethereum mainnet, reaching a remarkable milestone.\n\nThis success can be mainly attributed to the increase in cryptocurrency investors who take advantage of the network’s affordable transaction fees.\n\nAccording to the data from L2Fees, Arbitrum is one of the cheapest networks for transactions, with an average fee of 0.26 dollars, unlike the Ethereum network with an average fee of over 5 dollars.\n\nThis could explain the significant increase in trading volume on Arbitrum DEXs.\n\nFurthermore, the on-chain data from L2Beat indicates that Arbitrum is among the top three layer 2 networks based on Ethereum, with an average of 12.85 daily transactions.\n\nThe increase in DEX volume and intensified network activities have generated a peak in the total value locked (TVL) within the blockchain.\n\nSince the beginning of the year, the blockchain has recorded a net positive flow of over 250 million dollars. This has brought Arbitrum’s TVL to an impressive all-time high of 2.64 billion dollars on January 12th.\n\nDespite its remarkable success, the ARB token of Arbitrum has suffered a significant impact due to the recent downturn in the cryptocurrency market. Specifically, it has experienced a decrease of about 10% and is currently positioned at approximately $2.13.\n\nBrief focus on the price of Arbitrum and the upcoming airdrop\n\nCurrently, the price of Arbitrum (ARB) is around $2.08, with a trading volume of $576,853,819.67 in the last 24 hours. This represents a decrease of 3.32% in prices over the course of one day.\n\nHowever, during the same period, there has been an increase of 3.94%, particularly in the last seven days. The market capitalization of Arbitrum is $2,655,026,574, with a circulating supply of 1.3 billion ARB.\n\nWe see that Arbitrum is currently conducting an airdrop of its native token, ARB, targeting users who have previously used specific Ethereum-based applications.\n\nThe goal is to encourage users to explore the Arbitrum network and promote the adoption of the protocol.\n\nUsers interested in participating in the airdrop must meet certain criteria.\n\nAmong these, creating a bridge in Arbitrum One or Arbitrum Nova, conducting transactions in different months, executing a series of transactions with various smart contracts, and making transactions with a cumulative value exceeding a certain threshold in dollars.\n\nDespite the recent decrease of 3.32% in prices, Arbitrum (ARB) has recorded a 3.90% increase in the last seven days, surpassing the global cryptocurrency market decline of -5.20%.\n\nHowever, it has shown a slight underperformance compared to similar cryptocurrencies in the Ethereum ecosystem, which have recorded an increase of 12.70%."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxQTC1vU3YzZG1CRk96YlZQWGJsdUhhUDZqNjNuWGV2bHJfQ0s3REdWN1ROTHNmQWpaWk85RlBOamNQNy1QcnBwSkN5WTF3T0c4RW04al9PM3c3Z0hIZlZ2Y2JiQ0hfVE04TDJXcmRLSlZnLWV6TWhUX2dfcWQyQjhsR0FMRTdlbGxFNEVSMVRHVUhUM1pORGZYazBQYUhWcjBKM1VsQw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jan 2024 08:00:00 GMT",
        "title": "25% of Crypto Developers Have Left the Ecosystem Over the Past Year: Report - Unchained",
        "content": "The latest developer report from Electric Capital reveals a sobering decline in the active crypto development workforce, despite Ethereum’s strong pull on new talent and the rise of multi-chain development.\n\nMost crypto developers who joined in 2022 did not stay beyond their first year, according to a new report.\n\nThe Electric Capital Developer Report for 2023 has cast new light on the sector’s challenges, revealing a 25% decline in active developers over the last year, with a total of 22,266 as of the end of 2023, down from 29,606 in the same period of 2022. This drop underscores the industry’s vulnerability to market swings and raises questions about the sustainability of its workforce.\n\nThe report also highlights a concerning trend in developer retention, particularly among newcomers. Most developers who joined in 2022 did not stay beyond their first year, resulting in a 53% drop in new entrants. Despite this, there was a silver lining: namely, a 32% increase in the number of established developers — those with over two years of experience in the field. This growth in seasoned professionals suggests a maturing market, where experience is increasingly valued and likely correlated with the complex development needs of advanced blockchain projects.\n\nElectric Capital’s annual developer report is based on tracking of different ecosystems and code and candidate repositories.\n\nEthereum Is Still Number One\n\nDespite the industry-wide downturn, Ethereum has solidified its position as the epicentre for developer activity, attracting 17,146 new developers in 2023. This influx is 2.7 times the number recorded by the next largest ecosystem, underscoring Ethereum’s strong appeal to developers. The platform has emerged as the starting point for 22% of all new developers entering the crypto domain.\n\nPolygon and Solana trail Ethereum, having onboarded a little over 6,300 and 4,600 new developers, respectively.\n\nEthereum Virtual Machine (EVM) chains\n\nremain dominant, with only 2 of the top 10 blockchains for new devs being non-EVM — Solana and Cosmos.\n\nOrdinals Give Bitcoin a Boost\n\nAmid the broader contraction, Bitcoin Ordinals have emerged as a niche yet noteworthy area of growth within the Bitcoin ecosystem. While the overall developer count in Bitcoin represents only 2% of the global share, with 1,067 active open-source contributors, the Ordinals Inscriptions sector has attracted 36 developers. This figure, although modest, signals a specific, targeted interest within a development community that is otherwise experiencing a general decline.\n\nThis surge is particularly interesting due to some in the Bitcoin community urging for Ordinals to be discontinued because they have slowed down the network. Others, meanwhile, highlight that without Ordinals, the block rewards wouldn’t suffice to keep incentivizing miners to validate transactions\n\nRead More: Bitcoin Fees Surge to Highest Level Since April 2021\n\nMulti-Chain Developers\n\nAnother noteworthy trend is the increasing number of developers who are not confined to working on a single chain. Approximately 35% of developers now engage with more than one blockchain, indicating a shift toward a more interconnected and versatile development environment.\n\nAmid the overall decline, several ecosystems have demonstrated exceptional growth. dYdX leads the pack with a 520% surge in full-time monthly active developers, while Coinbase’s Base has registered a 420% increase. In terms of total monthly active developers, Base and Scroll saw their numbers swell by 489% and 345%, respectively."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNdEpmT0RuX2thaWpIal9jMzk4SGpjVWJyaDhvSXo0STZkNEJ1YU10aUNWcFh0dU5NcDJuQmE2OE8ySW04VFdvQ25UcG01LWpLNEVRMnl2c01xWm5uOEtCTUh4VXdjQmRnajFqS3oydGU4aUt0M21Mb1JlU2ZHY1lMY2FLR1BrR1BuY3Y3UNIBlAFBVV95cUxQeDJpUms4ckNjZmFseEVtNG4yNVExN0c4UzRlS2JRbUlUQXc3Q29EVFNBVjFyS19mLTlEVV8tTmYxbWNLMGh0dXZ4TjBqT3NVRURRQV9Hb0xvUHBWdVo5R3ItMWkxQTJDaWZ0V2M0NEg5eUNhM1Z1cUZwUm1GemxZZjdWbUZDcFFsSlhfMWJmR09iY0lJ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jan 2024 08:00:00 GMT",
        "title": "'Dookey Dash' Gets Free-to-Play Reboot With Token Rewards for Ethereum NFT Owners - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEver wished you could run endlessly through a sewer? Soon you’ll be able to—again—as Bored Ape Yacht Club maker Yuga Labs is bringing back its Dookey Dash game in a new free-to-play “Unclogged” edition thanks to a collaboration with game studio Faraway.\n\n“Looks like Curtis needs to get the plunger out, there’s something in the toilet,” a post from Yuga Labs reads.\n\nThe crypto startup will bring Dookey Dash back sometime this quarter, according to the post. In the single-player original Dookey Dash, gamers had to race through a 3D sewer tunnel as an ape riding a vehicle underwater to gain as many points as possible while avoiding obstacles that, if hit, would eliminate them from the game.\n\nUnlike the first release—which required a Sewer Pass NFT on Ethereum, granted free to Bored Ape and Mutant Ape NFT owners—anyone will be able to play the sewer-themed endless runner.\n\nAD\n\nAD\n\nToken benefits for BAYC, MAYC, Kodas, BAKC, and HV-MTL. pic.twitter.com/4RHnb2tKtN — Yuga Labs Gaming (@yugalabsgaming) January 16, 2024\n\nDookey Dash saw quite a bit of competition during its previous launch. Back in February 2023, the pro Fortnite player known as “Mongraal” won the first version of Dookey Dash with the highest score—and sold his winning NFT key to billionaire Adam Weitsman for $1.63 million.\n\nThat said, those who do hold Yuga Labs Ethereum NFTs like Bored Apes, Mutant Apes, Kodas, Bored Ape Kennel Club dogs, and HV-MTL Forge NFTs will be eligible for “token benefits,” according to the company. The trailer posted to Twitter shows ApeCoin logos, suggesting the Ethereum token for Yuga’s Bored Ape ecosystem will be given out as rewards. However, a Yuga Labs representative would not confirm that detail.\n\nThe new Dookey Dash: Unclogged game will be released for iOS, Android, Mac desktop, and Windows desktop users—suggesting it won’t be a web browser-based game like before. Mobile and desktop app-based games tend to run more smoothly and securely than browser-based games, so this is a win for fans of the stinky original.\n\nAD\n\nAD\n\nA Bored Ape and gaming influencer known as The Fortnite Guy or “TFG,” who was part of the latest Dookey Dash playtest and Yuga Labs’ gaming council, added Tuesday that the game is slated for a mid-February launch and that select Yuga NFT holders may get more NFTs via the game.\n\nTFG showed a video that displays different playable character skins, new game vehicles, a leaderboard, and purchasable in-game currencies in the new upcoming game version. Yuga Labs’ official gaming account on Twitter shared TFG’s video.\n\nThe new version of Dookey Dash appears to offer “Coins,” “Boosters,” “Energy,” “Skip-It” passes, and other items available for purchase using fiat currency. TFG also stated that coins can be earned by playing the game.\n\nDOOKEY DASH IS BACK!🤯 I've been invited to the @YugaLabsGaming council to playtest, create content, and work alongside the Yuga team to improve the game ahead of launch!🙏 There is SO MUCH new information about the game and I created a full length video discussing the updates… pic.twitter.com/MLFqaEw8e0 — TFG (@TFGmykL) January 16, 2024\n\nThe video also shows a new “Sewer Rank” system to show the game’s different competitive tiers. There’s Amateur at the bottom, followed by Semi-Pro, Professional, All-Star, Champion, Hall of Famer, and GOAT listed as the game’s ranked tiers, each with a different respective “boost” percentage. Players will be able to select different boosters before the game starts, with options like a “slow booster,” a “magnet booster,” and a “power shart,” for example.\n\nPresumably, the slow booster slows down the game to make it easier to navigate the cramped tunnels, while the magnet pulls in desirable items for the player to collect, and the “power shart” is… well, mostly likely Dookey Dash’s version of a very putrid nitro boost through the cartoonish game world.\n\nThe game’s updated version and re-release appears to be an effort to draw in the broader crypto community. Hopefully, this new version won’t suffer from quite the same levels of reported cheating and boosting as its original.\n\nEdited by Andrew Hayward\n\nAD\n\nAD"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxNWVJYR1dWRDZCaE03UHE2NkRTNUZaQmFzbG42bUY2bUV0cFdaQnVRTXBZVGRGeWQxWUl2NGNtblZzRFk2NzVzQ2YweWRPQkpLWl85Y3F1MC1IWjd3UHd3RWZMd3ViSGlMdEc2aVVLV2hpc2ZxQ0RkWFRWVEdsSXdRQ0QtblQ1MzlXbXpuNko1SVVsOF9wS1hPNEVVVWtKa3IwQ1E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jan 2024 08:00:00 GMT",
        "title": "The ETF showdown: Bitcoin’s store of value vs Ethereum’s technological utility - CryptoSlate",
        "content": "Over the last few months, the crypto internet has been dominated by the Bitcoin ETF talk. And for a good reason. At a $835.7 billion market cap, the pioneering crypto makes up 49% of the total crypto market, consisting of tens of thousands of tokens.\n\nIn Bitcoin’s 15-year life cycle, an exchange-traded fund (ETF) represents a pivotal divergence, a milestone in legitimacy. Once derided as “fraud” akin to tulip mania, “rat poison,” or “index of money laundering”, Bitcoin’s entry into the ETF arena discards those perception rags and replaces it with a brand new coat.\n\nLong-Term Trickling from a Deep Pool\n\nHaving the blessing of the Securities and Exchange Commission (SEC) means that institutions can start apportioning their capital into a high-yielding asset. Bitcoin fits the bill because, even more so than gold, its supply is affixed, and even though Bitcoin is digital, it is grounded in physicality via the proof-of-work mining network.\n\nAs of October 2023, US ETFs have $5.6 trillion worth of equities. Even in low single-digit percentages, capital trickling into Bitcoin is poised to create a rising tide, a feedback loop owing to Bitcoin’s limited supply. Without the hassle of custodianship, investors get exposure to this tide, represented as ETF shares that track Bitcoin’s spot price.\n\nJust one such Bitcoin ETF applicant is BlackRock. The world’s largest asset manager had already lined up capital to the tune of $2 billion, according to sources.\n\nFollowing the approvals on January 11th, an expected sell-pressure transpired in a classic “sell the news event,” bringing the BTC price down -7.4% over the week. Yet, launching a new investment vehicle has been successful, tracking over $1.4 billion in AuM and $3.6 billion in volume in just two days.\n\nBut what of Bitcoin’s long-following shadow, Ethereum? Having transitioned from proof-of-work to proof-of-stake, the Ethereum project is perceived quite differently from Bitcoin. What are these differences and how would they reflect on their respective ETF investment vehicles?\n\nThe Store of Value: Bitcoin in the Spot ETF Market\n\nFor many years, it was not clear what Bitcoin would become. After all, Bitcoin underwent over 100 hard forks, splintering the original whitepaper vision of a “purely peer-to-peer version of electronic cash”.\n\nFollowing the resolution of Bitcoin’s contentious block size wars in 2017, the Small Blockers faction won. Instead of increasing block size outright, they opted for soft Bitcoin scaling via the SegWit upgrade. This veered Bitcoin’s fate into a store-of-value asset instead of a low-friction P2P digital cash.\n\nHard limitations make it impossible to have it both ways. If the large block size faction had won, more computing power and bandwidth would have been required to run full mining nodes, leading to network centralization and potential transaction censorship.\n\nOn the other hand, smaller blocks retain decentralization but make it difficult to scale on-chain. As fewer transactions fit inside a block, higher network activity leads to higher transfer fees because waiting lines are formed. And if BTC transfer fees go up, Bitcoin’s daily currency proposition is diminished.\n\nAt least, without using layer 2 scaling solutions like the Lightning Network, harnessed by payment apps like Strike. Such payment systems can utilize Bitcoin as a vehicle to transfer cash and interface with the existing banking system.\n\nI use send globally via strike app to bank all the time. It is near instant cash deposit settlement. Our family in the Philippines are in awe of the power of#Bitcoin — General Plebian (@GenPlebian) December 23, 2023\n\nIn the end, Bitcoin cemented its position as true sovereign money, peer-to-peer but not inherently low friction. Rather, Bitcoin is the foundation for a financial edifice to be built upon. In the age of continuous fiat currency debasement via central banking, decentralized sovereignty overrides low friction, painting Bitcoin as a monetary escape hatch.\n\nFor people accustomed to fiat money erosion, this is a novel concept. Yet, Bitcoin ETF applicants are now incentivized to bring that concept in the public spotlight.\n\nThis competitive marketing push alone is poised to deepen the capital pool for Bitcoin exposure. And the deeper it gets, the higher the Bitcoin price will likely go, creating a feedback loop of more capital inflows.\n\nEthereum’s Technological Utility: Beyond Mere Investment\n\nWhile Bitcoin pioneered the concept of blockchain-based sovereign money, Ethereum is a work-in-progress infrastructure layer. One that onboards digital assets and supplants traditional financial services.\n\nThis purpose drove Ethereum’s proof-of-stake transition, as such blockchain networks rely on economic stakes instead of energy-hungry computing power. However, having a negligent energy footprint (compared to Bitcoin) is only the scaling starting point.\n\nDaily operational financial infrastructure necessitates low friction (minimal fees) to be accessible and to truly take on TradFi. Ethereum is yet to achieve low friction, relying instead on many layer 2 scaling solutions.\n\nThis became even clearer in the latest roadmap, emphasizing Ethereum interoperability and security against cyber attacks, instead of L1 scaling for low transaction fees.\n\nBy popular demand, an updated roadmap diagram for 2023! pic.twitter.com/oxo58A2KuG — vitalik.eth (@VitalikButerin) December 30, 2023\n\nThis approach poses two major problems:\n\nBy ditching proof-of-work, the Ethereum blockchain becomes reliant on large stakeholders and cloud computing services such as Amazon Web Services (AWS). This reduces Ethereum’s perception as a decentralized network that could be a true TradFi substitute. In turn, Ethereum positioned itself among other PoS network alternatives, with similar centralization issues But those have been built from the ground up for L1 scaling, without the extra L2 scaling complexity for the end user to interface with.\n\nIn this cycle, this dynamic became more evident. Even though ETH is the second largest cryptocurrency by market cap, it lagged behind Bitcoin at +64% year-over-year performance. Ethereum lagged greatly behind its direct competitors Avalanche (AVAX) at +118% YoY, and Solana (SOL) at +321% YoY performance.\n\nEthereum’s lackluster performance transpired despite having an even lower inflation rate than Bitcoin. This could indicate that Ethereum’s perception is much more precarious than Bitcoin’s, which has a more coherent and focused “sound money” proposition.\n\nThat proposition is not duplicatable due to Bitcoin’s mining network effect. For instance, if Bitcoin code were to be tweaked to become a PoS chain, per the preference of Greenpeace, it would simply be a dead code without the network onboarders.\n\nEthereum’s network effect stems from holding dApp domination among PoS chains. Yet, it is not clear if that domination will not shift to AVAX, SOL or another PoS network. Additionally, while it is clear that Bitcoin is viewed as a commodity by regulatory bodies, Ethereum is still in the fog of regulatory obfuscation.\n\nMarket and Regulatory Dynamics\n\nAs of date, SEC Chair Gary Gensler hasn’t explicitly announced whether ETH is a security or a commodity. By the latest speculation, Bloomberg ETF analyst James Seyffart thinks that the SEC is leaning in the commodity designation by already approving Ethereum future ETFs in August.\n\nJames Seyffart at CryptoQuant webinar on January 4th:\n\n“So again, Gary Gensler will not explicitly say whether Ethereum is a security or a commodity, but in their action, by approving those Ethereum futures ETFs, they’re implicitly accepting those Ethereum futures as commodities futures.”\n\nOther PoS chains like SOL, ADA and AVAX are in the same regulatory uncertainty boat. In last year’s lawsuit against Coinbase, the SEC named them all as “crypto asset securities.” If Seyffart is correct, and ETH becomes a commodity per the preference of CFTC, this could give Ethereum an edge over its competitors.\n\nPresently, spot-traded Ethereum ETFs are delayed until May 2024, from Grayscale Ethereum Futures ETF to Hashdex Nasdaq Ethereum ETF. Likewise, the SEC pushed back Cathie Wood’s ARK Invest, 21Shares and VanEck’s Ethereum ETF.\n\nGiven the limited market liquidity, compared to the Fed money supply extravaganza in 2021, Bitcoin is poised to be the greater beneficiary of the first move advantage than Ethereum.\n\nConclusion\n\nThere is a reason why the SEC failed to approve a single spot-traded Bitcoin ETF since the first application by Cameron and Tyler Winklevoss in 2013. Not only was Bitcoin less mature, but the banking sector wouldn’t give a leg up to its P2P competition.\n\nSince those days, Bitcoin has overcome its underground, tulip, money laundering detractors. The digital asset is now secured by the world’s most powerful computing network, erecting an ecosystem of mining companies. This further bolstered investor confidence due to Bitcoin’s conservative coding practices.\n\nOn the other hand, Ethereum is perceived as a more patchworked crypto project yet to entrench itself as a DeFi vanguard to tackle TradFi. Burdened with technical and regulatory uncertainty, conservative Bitcoin is a far likelier candidate to receive sustained retail and institutional attention from the first ETF vehicle.\n\nMentioned in this article"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxOcW0xNmpiYzdBSTNsZkZaMkV4bmVNdVY2UVBTZE83enVTd0dlT284ODV5elpTaVRfSFZRX2Zsa0VHWTZnZ0dYb3YtQlRKLTlFZTJvd0VfWFNyS25qTkFnMnp4N3FRSE11bVJSaE45WkpiMkFlWk5nOFYtM3pmVUFad2FoRmt4cnBIQlQxNVItSk5NTmR5cFp3T29QS3JSNlo1MldUV1BOQjRjMVcyUkNzVHlGaWh6aVZWcHl1VXdhNWFNcm55ZXlXeERwT1BhOGE4aTVGdnlVUDjSAd4BQVVfeXFMTWFtQ1gyT0xMRExWZ2laMklkQUo5WXVfenlFNmtMX1JsOUo0ZDJFT1E1YWZjeGdjU3VlbksxcXF3aFBWQ0F2MmMza0FtMEpFR3hTV0d3ajlSaFotcVlNc3BKd0pZeVI0ZTR1Q3lpRFNaQUpUeDhjUkdMSDFzbFdxUHMzNnJIR1kxdEhXX0JwTDQ3UkVadFFLSmpXeDhMcE5NM3Rwby1JRVFIaHNTc1YzZDViaG9TZlpCbG9lZVpCc1pHRnBpRW1KSFd5WHRPdkNmWU5sQVZWck9IV3VhZ3p3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jan 2024 08:00:00 GMT",
        "title": "Ethereum-Based Altcoin That’s Surged 245% in Three Months Looks ‘Incredibly Bullish’ Versus Bitcoin, Says Trader - The Daily Hodl",
        "content": "A closely followed crypto strategist thinks that one Ethereum (ETH)-based altcoin is about to soar against Bitcoin (BTC).\n\nPseudonymous analyst The Crypto Dog tells his 750,500 followers on the social media platform X that the decentralized exchange protocol Injective (INJ) is looking bullish on the INJ/BTC trading pair chart.\n\n“Incredibly bullish structure.”\n\nLooking at his chart, the trader suggests that INJ/BTC could soon flip a key resistance level into support, after failing to do so on two prior attempts in recent days.\n\nOn October 16th INJ/BTC closed at 0.0002737 BTC ($7.80) and is now at 0.0009446 BTC ($40.75), a gain of approximately 245%.\n\nThe trader also says that Injective looks like it is on the verge of a breakout after a period of consolidation in the high $30s and low $40s range.\n\n“INJ looks like another winner to come this week. Been consolidating here longer than expected, but it’s been just a matter of time.”\n\nThe trader also predicts that the fan engagement token Chiliz (CHZ) is about to undergo a trend reversal.\n\n“I took a CHZ position. Looks ready to break this two-year-long downtrend, big gains to be made if it does. Strong project, unique fundamentals, always been a fan. One of the first to merge the real world with crypto.”\n\nChiliz is trading for $0.106 at time of writing, up nearly 17% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMi7wFBVV95cUxQM2JkcTB2RVJMMC1ZSlV0anNRMzJHM2REamhBVWxaTVlQamN2MUp1SHVBQm5YaHBMZHJiRzl5QmQ3MGloU0tNeUc4clhLWVVFa1BDbEg5NTFzVDVWX3FXY05RVjlBWWp2RHFFT3NKSi1oR09QeGpwTGc2LWUyeDJENjQyNmdJV3RQak8xWkhZT1g5dGFBbnpUZWdpbklmX0lQZENlTUxHeV9QOGlTQjZjTDg3anJYR1ByODRES2pyT0h1Q1N4Zm05LU9uM2xGY040UGNSQWM4amV3SW1RN2hYUTUtcWszZlJGUXd0WUp2ONIB_AFBVV95cUxOcTBERzdLSExiTE13MWYyRi1ZLUZ3U3VWdzVCSENuMnNLdDJhbkdaMkNuZl9oVXVEYmlPVTFQeG56LWlwNVd3VWhJQ3Bjd2pvRXM2dzJFc2lLUjBoMTF3Vk10VDhmRnhoNmp3NVpqeW8zRDl0Ml9lREdPNDZSMkpDYWdnLVF3MV9Md0ZnN2hVdE90azBTQnBScDFvTGtYbW9jcWJJOXBmMUVJWG1OVGVjRkpuZURJa0o0X3VlaVNuWmNzcjNHc192ci04RnRqaVByVnZfemszMGdhdG5Ed0E0MXdwcXFWM2V5X3l1Nkk0VHR1c3hCemRmM1hvenQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jan 2024 08:00:00 GMT",
        "title": "Analyst Eyes 786% Ethereum Growth; Render and Borroe Finance Rises as Key AI Crypto Contenders - Analytics Insight",
        "content": "Following the analyst who shared his beliefs on X, ETH could reach a minimum of $10,000 in 2024 and a maximum target of $20,000. As of the time of his post, he envisaged a potential growth of 786%. While his projections might appear wild, his perspective aligns with current happenings in the space. As of this writing, ETH had risen past the $2,400 resistance level and sold for $2,543.06."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMirwJBVV95cUxOMUVnQmNhczlSdnpfcXl2aXF0MC1qWlpJUDJkX0ZMNDNRaUh3VzR2MzEtYUdZcXNLR2Q4Q1BCeHA1TE1NWlFlcVZ1bE9GRmp4T2YzbjV6OXJCS2dyamRTa2R6VENFTVh0OERWeGk0dEV5c3dlZ0V4SGI4OU5wVlV4emkwRFdiaVBHMHlTa1dzLXlmcGEzNkVaSE1hTXItaXN4ak01WTNqcmgyV3RWNE5yUGw0UmxRRXBSVUFnenoySUNOVWpKV0xHdU1Ubldxb2taUFAzNXdBSXhGeFdocTdzQmVnOC1jQ0x0Y1VySXpWcFpIYnItMGx6X29CUzJKWDAzdWJRZExVTXByNlBQcTZrTC11TjBnR2hnWGJLTlZ4MVZhTzRYQkFraEFqVWxKYlnSAbwCQVVfeXFMT1FwSUt3bHhBRExoNW1lWTJZdS1YRW1zbUN0bE52SnZmUnF1VTZ0T3Z6RHFvODJ4TXJOQ0RqWXRpNUZUNTAtdGk5T0JFTndjRTZIeGZ2OFp4RVkwRUtnVWd5WjB6ZGRJVnVVWDV1VHhxVVlnMFFQYUpPZWdmTEZrOFV0cXBnLW1zYVFhTEpPSDJiVUdjRjJMTkltV3ZRZmpJRWFDTm96SFVSY2RZbV9YWm1TNlJhSWhXWDcyVVh2XzJaWFZPX3dBQzd4OFRuMENCUlRLdmZ3UTRzLVJfNmdMNklTamdMZ2E4M2QwMVBrbnE1NkF3LTZRbVBSelZINTByVjhnMjNHVVlIcnRPU3A2TU9WMnEzOHltRFU0TklSNjUzelVDclJ3a3loUnNpckZBSU9ha3VDQVJFRzFCRA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jan 2024 08:00:00 GMT",
        "title": "Best Altcoins to Buy in The Crypto Dip: Top Coins to Buy Now before the Next Bull Run featuring ApeMax, Solana, Arbitrum, Injective, and Ethereum - Analytics Insight",
        "content": "The brief dip in Bitcoin to $42k was influenced by a combination of factors. Fluctuations in market sentiment, often triggered by news events or regulatory developments, can play a role. According to an article by Economic Times, the price of Bitcoin dropped after the spot Bitcoin exchange-traded funds (ETFs) started trading in the US. Some analysts believe that the recent hype surrounding Bitcoin ETFs may have cooled down, and that the market is now waiting to see whether it can sustain upward momentum."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxNcy02VTgxYWt1TWZhUWxPemlidy1zdldrWDhNbEZBMnZUcTFGNVc2QTlPWUh0cmM0X254RUFwenZGck9vaTU1Yjl0ZXdJNzByd1llMDB1QlFrX2kyeXNJMU1CYldSUTF2cW5BdXBRWXdqY3hqemFWRlhJWkNpVVhsZzQ1ZmhvNVU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jan 2024 08:00:00 GMT",
        "title": "Total value locked in Ethereum surges 230% as ETH targets $3k - Finbold - Finance in Bold",
        "content": "Ethereum (ETH) has reached yet another remarkable achievement, dominating decentralized finances (DeFi) total value locked (TVL) by 80%. Meanwhile, its native token, Ether, aims at the $3,000 price zone, threatening a short squeeze soon.\n\nRemarkably, the total value locked on Ethereum’s first layer surged 231% in the last 24 hours to $100.31 billion. This sums up to recent increases, resulting in 255% and 283% changes in the last seven and 30 days, respectively.\n\nTotal value locked on the top 5 DeFi chains. Source: DefiLlama\n\nIt is worth mentioning that the above data, retrieved by Finbold from DefiLlama, does not include Ethereum’s second layers. For example, Arbitrum (ARB) has its own $2.62 billion in total value locked, ranking fourth among the DeFi chains.\n\nEthereum’s 80% dominance on DeFi by total value locked\n\nInterestingly, Tron (TRX) holds the second place with over 13 times less TVL than Ethereum, with $8.063 billion.\n\nIn this context, Ethereum layer-1 now dominates the DeFi ecosystem with an impressive 80.62% TVL dominance. Tron gets a share of 6.23%, mostly on stablecoins, while BNB Chain (BNB) and Arbitrum have over 2%. Solana (SOL) is the fifth most valuable DeFi chain with a $1.34 billion TVL and a 1.04% dominance.\n\nPie chart: Total value locked in all chains. Source: DefiLlama\n\nEthereum’s total value locked is distributed among 1004 DeFi protocols, contributing to its ecosystem.\n\nEthereum price analysis\n\nMeanwhile, ETH is trading at $2,554 per token by press time, slightly up 2% in the last 24 hours. Ether reached $2,714, its highest price of 2024, so far. On the other hand, $2,140 was the lowest for the first month of the year.\n\nETH/USD 4-hour price chart. Source: TradingView\n\nEthereum has around $307.09 billion of market capitalization at these prices. This is three times more than its DeFi ecosystem has in total value locked, evidencing how meaningful its dominance is among other chains.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxOSi16emVGTUtCNXptVFcwU0hneUEwVXBuTEhZeXR3V1Mza1A1bW02enZ2WHc2Y3pnMXg2VGRnbTdad3pkRzhxeThPdzJGTEFfWjlRU2plXzdKcV9tTndhTHhWWXh2UWNOU21MUkhYeV9RSkhhOHgxM2l0SUpiU09jYi0zU0ZxeTU1eld5UVB1WVIwOTjSAZgBQVVfeXFMTXIxWFJqR25kalJWUEVHSFNia1VVcElySk1YemUtb2RnNDBqSkdWWjlQbHdkWmxtZlg3WXY0YnJUSUZfRElubmpwVnhPVjNXUzlCcE43Z0tjVmhmNVY3LW5zTDVDeG9UeTctelo4TFZjcGM4elNVTTZPekhlenpCZ0JINURFWFBvY3FKSmEwNGZwd05icG9vZEQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jan 2024 08:00:00 GMT",
        "title": "Vitalik Buterin Interestingly Sheds Light on Ethereum Layer 2 - Coinpedia Fintech News",
        "content": "Nidhi is a Certified Digital Marketing Executive and Passionate crypto Journalist covering the world of alternative currencies. She shares the latest and trending news on Cryptocurrency and Blockchain.\n\nThe founder of the decentralised mining network and software development platform Ethereum Vitalik Buterin shared his insights about Ethereum layer 2 of the Ethereum blockchain.\n\nVitalik shared pivotal points regarding L2 networks which are considered as main scalability tool for the Ethereum Network.\n\nDebate About L2 Layer\n\nThe L2 layer on the Ethereum blockchain is a collective term for an Ethereum scaling solution that manages transactions off Ethereum layer 1 while still taking benefit of the robust decentralized security of Ethereum layer 1. Layer 2 is a different blockchain that extends Ethereum.\n\nL2 solution is designed to improve transaction capacity and pace without compromising on the security which is facilitated by the main chain layer1. This proves to be beneficial for the users as it helps users to understand the types of solutions available for their respective issues.\n\nVitalik engaged in a debate which was about “L2s” encompassing both rollups and validiums. The users need to understand the different security features where rollups are “security-favoring” solutions that bundle or “roll up” transactions into a single proof, which is posted to the main chain. This methodology enables high security, as the L1 blockchain instantly secures them.\n\nComparatively, rollups are a bit expensive due to their ability to its data on-chain which provides higher security on the other hand Validiums provide an inexpensive alternate option to rollups. The founder of Ethereum Vitalik has suggested that terminology should reflect these distinctions without delegitimizing either option. In the spectrum of L2 solutions, he suggests terms like “strong L2” for rollups and “light L2” for validiums to enable users to guide their choices better.\n\nVitalik also cleared that the whole process of L2 solution is not only about security as both rollups and Validiums have “intermediate space”."
    }
]