[
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxQYVE4bjNXWlo3T1lWSEJIT29lNlpROTZULW1IMmU2TXdCTUZkdWR3N2pONUpmbWpxYWhicFlNQ0RNYlg2c1VLVGlsYkQ4a2RlSVNPcXVPZlhxWDlsdWd5SG9nSnNGc0VTSHpUNy1QZjJDZE5nUFZVc2RaOHJXMHdPcFdIeldPRFli0gGOAUFVX3lxTE13cjIyeEFhbjZGUmlfeTlvNVVWVm5WV2pTcjBDLUJVbG9QYjRoUkplOXRaRkZwNkpVWTVLS2pYREZGRlJRQTQyNzZXdk1IaXdVMjRJLU1IR3lQRzVjcUl5M0x0b3pWZEpJX3FaT0p1SGJTQmllREJkaVdtOVVDelhYSmlaN0NJSjZpY2ttT0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 May 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Price Takes Hit as Major Holder Allegedly Cashes Out - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nThe cryptocurrency market witnessed a significant downturn this week as Ethereum (ETH) faced a substantial drop of over 9.6% since the week began, marking its lowest values since mid-February. Currently priced at $2,950 per ETH, Tuesday saw the bulk of this decline, culminating in a weekly low of $2,817.\n\nAdvertisement\n\nETH to USD by CoinMarketCap\n\nAmid this turbulence, attention has been drawn to a suspected Ethereum Foundation address, \"0xd7,\" which reportedly sold 100 ETH for 291,267 DAI via the Cow Protocol today.\n\nThis transaction was followed by a transfer of the acquired DAI to another Ethereum Foundation address, \"0x9e.\" Notably, this suspected Ethereum Foundation address has been consistently exchanging ETH for DAI through the Cow Protocol in recent times.\n\nAdvertisement\n\nHow solid is that foundation?\n\nThe Ethereum Foundation is a nonprofit organization dedicated to the advancement of Ethereum and related technologies. According to reports from Arkham, the known accounts of the Foundation currently boast 310,867 ETH, valued at $915.15 million.\n\nExcluding exchanges and select projects, the foundation stands as one of the largest altcoin holders, with assets estimated to exceed $1 billion, encompassing holdings in WETH.E worth $91.87 million, along with 329,239 DAI — some of which arrived in foundation addresses today.\n\nThe revelation of one of the foundation's key holders offloading a portion of their ETH holdings has sparked speculation regarding its potential impact on Ethereum's future trajectory. The implications of such actions on the price of main altcoin remain uncertain, leaving investors and enthusiasts with unanswered questions."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFA1UnRFNnZ2eWpudzhwTVRoekZ5eWxiNlJKRGpBSGpyOW5UalhuMDR0TjJCZktONXRqU0t0M1BVOVZKa0JsYkd0emNDcXY1NmpVRFVRZUVzT2dFRzBDZXJYOFV2anFtelF2SFhxcjl1QVNNUHhDRjhDcjRwMXk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 May 2024 07:00:00 GMT",
        "title": "Feels Good Man: $BRETT Leads the Memecoin Charge on Coinbase Ethereum Layer 2 (L2) Blockchain Base - Yahoo Finance",
        "content": "Based Brett\n\nThe top memecoin and top ten coin overall on Base increases approaches $500 million in market cap, forecast for the rest of the year is even more bullish\n\nDUBAI, May 02, 2024 (GLOBE NEWSWIRE) -- Popular memecoin $BRETT continues to gather momentum in 2024 as the most popular memecoin and top ten most popular overall on Coinbase Ethereum Layer 2 (L2) blockchain Base, and now approaches $500 million in market cap. With continued community support and positive secondary indicators like crypto ETF approvals, futures trading for flagship memecoin Dogecoin on Coinbase Derivatives, and the anticipation of Bitcoin pricing eventually reaching 100,000 USD, $BRETT’s growth picture remains bullish.\n\n\n\n“We are seeing in real time how memes are not just an easy and funny way to share information on the internet, but to create almost immediate wealth by harnessing the power of these memes,” said $BRETT trader Crash. “This is the culmination of the grassroots financial movement of the past decade, from Bitcoin to r/WallStreetBets to now $BRETT, allowing people to escape the economic drudgery of living in The Matrix.”\n\nBase is Coinbase’s L2 built on OP Stack in collaboration with Optimism. Coinbase recently released new smart wallet technology built on Base, with $BRETT quickly becoming the most popular memecoin available for purchase there. Coinbase continues to be ambitious in its promotion of Base and the memecoins sold there, with plans to onboard over 1 billion users to the chain. Community response memecoins like $BRETT are also an easy way to boost early liquidity for the developers of new platforms on Base.\n\n\n\n\n\n\n\n$BRETT is one of the original characters of the Boy’s Club written by Matt Furie, the creator of the famous cartoon that has also inspired the popular Pepe meme and popular $PEPE memecoin. $BRETT involves a fixed total supply of 1 billion tokens, with a 6% transaction tax distributed to liquidity pools and burned tokens, aiming to reduce the overall supply and potentially increase the value over time.\n\n$BRETT continues to hold strong amid recent sideways market movement for memecoins. Even while most memecoins are down 50 percent, $BRETT has seen only about a 30 percent decrease.\n\nTo learn more, check out BRETT at:\n\nTg: https://t.me/basedbrett\n\nX: https://twitter.com/basedbrett\n\nWebsite: https://www.basedbrett.com/\n\nAbout $BRETT\n\nCheck out BRETT at:\n\nTg: https://t.me/basedbrett\n\nX: https://twitter.com/basedbrett\n\nWebsite: https://www.basedbrett.com/\n\n\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency & securities.\n\nStory continues\n\nCONTACT: Xenia von Wedel president TransformGroup 415-340-2792 brett (at) transformgroup.com\n\n\n\n"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiyAFBVV95cUxNWTJFQTBxRTdzSmtQNkRIRnNTVG9aTXQtMC10Z1pBM0lQQTlETTlaM2s5VlV2SUw3MFpFMGJHNHZSUlpLLUx5eXhfOXc0SGNLTm9Lb1FVcU1uNHRnWjlzWXpHM05aSFZMZjQyYWl0RmFOX1RWQ2VURFZYMDFZXzJPTWlheFdZU1RHQl84OFN6OHVMZHFsbXhSWWYtQTc3czZxeHVrVHd1a2pveDJrZHVETGtrbFllbzhaRmV1aEZqYXVUR0lHWHlxRdIBzgFBVV95cUxPQWxONkk3ODNwZFNnTS1qRDkzZENfU1pfX3BLT1NCYXNPMzI1YlJYZFdTMG96bHVnTXppQ0gzVVJiaUd6bVV1OWFSX3RrVTdRc1VfMGpQQ19fbHNsR2VtaTJoa0RFN3ZaajVrTU1PSXJPdmFnNm1KMk52RjlFam93c24taTZ4ajRDb1lqWk1mWnZRS1ZZZHJERHBxRzQ3ejJLVkRjZHE3WXE4TlFvQTREN29oQ2R0b19yZTR0dk90bUNvcldORUx1YnZleC0wUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 May 2024 07:00:00 GMT",
        "title": "Restaking 'Gold Rush' Spreads to Solana From Ethereum, With Jito and Others Joining In - CoinDesk",
        "content": "Restaking 'Gold Rush' Spreads to Solana From Ethereum, With Jito and Others Joining In\n\nThe race is on to build a dominant restaking protocol for Solana.\n\nBy Danny Nelson May 1, 2024 at 12:01 p.m. UTC"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxPbG1Jak9aTktjMUdickIxM0lLVkkyVW1wSWpNVC1QTF80Smszb2JjLWtlYVRWdVN1cWtRQ21qdnEtTW5QUnFOWXp6UklsdUo5aEJYWGoyOHk2UXJTOWR5eXJSOFBsU0pqanY3cFZZUUtGRkZXWnJRejNUbHR1SGYySS1ZY1FfZXlSNkZ4ZlNOcUpmVFd4NUVHZVVGY9IBowFBVV95cUxNeW1WeElzalkxRWlnOXU4Y3lMZTBWaFlhTHlxZC1EdTl1SVN4eWpGb1NBNDZiNmRxbVlxWlBoNEZvd20yeGNFUjZoZFA3RzVDb1VocjZfU0VDVWNfUjBIMU04SzhTM0lUTlFyM0xHV19YRkRmeEZRMnVyRmtBbjdyMjVVTFR2Ni1LRTJPX2lEU0V5bmRlQjFBQkFpcTVxTVVfc0c0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 May 2024 07:00:00 GMT",
        "title": "Bitcoin and Ethereum Rebound as Interest Rates Remain Unchanged in US - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin and Ethereum have rebounded after starting yesterday morning nearly 10% lower than they were on Tuesday.\n\nAt the time of writing, the Bitcoin price is around $57,700 after having made a 0.5% recovery in the past 24 hours. And the Ethereum price, after climbing 2.3% in the past day, is now trading for just below $3,000, according to CoinGecko data.\n\nBut the damage has still been done. Per CoinGlass, the past 24 hours saw another $193 million worth of crypto futures contracts liquidated, adding to the $300 million worth of liquidations seen earlier this week.\n\nEconomist and trader Alex Krüger explained that this current cycle feels so different for traders because it's largely been driven by interest in spot Bitcoin ETFs, which only just started trading in January this year.\n\nAD\n\nAD\n\n\"There has been barely any new retail coming into crypto,\" he wrote on Twitter. \"It's been mostly ETF buyers and previous cycle participants redeploying and going out the risk curve.\"\n\nAnalysts mostly attributed crashing crypto prices to fear in the market over certainty among investors that the Federal Open Markets Committee—which sets monetary policy and controls U.S. federal interest rates—would not lower rates. Then the Fed did exactly what the majority of investors thought it'd do by keeping interest rates unchanged, and crypto assets traded sideways.\n\nSome thoughts on the current crypto cycle #1 The crypto cycle has been almost entirely driven by the bitcoin ETF. #2 ETH has been a major disappointment, but it has performed well overall for stakers and airdrop farmers. #3 Solana established itself as the chain of choice for… — Alex Krüger (@krugermacro) May 1, 2024\n\nDuring a press conference yesterday, Federal Reserve Chair Jerome Powell told reporters that the fight to get inflation to 2% has been difficult, but added that he thought it was “unlikely that the next policy rate move will be a hike.”\n\nAD\n\nAD\n\n“I’d say it’s unlikely,” he said, but warned that it was “likely to take longer for us to gain confidence that we are on a sustainable path to 2% inflation.”\n\nBut even President Joe Biden has been optimistic that the Fed will still lower rates this year. \"I do stand by my prediction that before the year is out, there'll be a rate cut,\" he said during a press conference in Japan last month. \"This may delay it a month or so, I'm not sure of that.\"\n\nHe was referring to the hotter-than-expected March inflation report that had just been released at the time."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPV2U1eWJiUEE3WTdWbHRvbGFiQVhYZjNhSEJNWkVVXzJhbU5Qb0VNcjh6OGZZX1IwWHRRa21kQ1ZIZmhXNTMwU3p5a2pnLWNPMWxITGxHQ19nQ0VadTFZNUFoZEtmcU5UTU54Y0RiTEpxSE9rT3dieFBkMVZlb3N1R3BkQjNWLXPSAY8BQVVfeXFMTmRuVUZSUUFNQm9SRHFRYm5FMFJhRlhWYldSNGl2bUMxOHp3dWVsNVVNODl4TE5yWnp0cmJDRHFITFlONkxROVZZbkktWlNpVW9mS2ViSmREQ0I2dEgzemk0MEFCRDZ3a0JNU2ZqVWVrMnpjVjZ0MHBIX18xOGhQeW12OV9KQWJ4MDRZQndWU0k?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 May 2024 07:00:00 GMT",
        "title": "How Ethereum Founder Vitalik Buterin Keeps His Crypto Safe - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEthereum founder Vitalik Buterin is advising people to \"decentralize your own security,\" after weighing in on a Twitter discussion about using cold wallets.\n\nTo prove his point, Buterin said that he keeps 90% of his crypto funds in a mutisig Safe wallet.\n\n\"M-of-N, some keys held by you (but not enough to block recovery), the rest held by other people you trust,\" he wrote. \"Don't reveal who those other people are, even to each other.\"\n\nThe \"m-of-n\" Buterin referred to describes one of the ways multisig, or multi-signature, wallets can be set up. The first variable refers to minimum number of signatures required to sign a contract, therefore spending or transferring funds from the wallet. The second variable refers to the total number of possible signatories that exist for the wallet.\n\nAD\n\nAD\n\nThe conversation started after a developer and research, who goes by the pseudonym 0xkofi on Twitter, urged crypto traders to think about how devastating it would be to lose all their funds and avoid it by investing in cold storage.\n\nThe above is why I use a multisig (@safe) for >90% of my personal funds 🙂 M-of-N, some keys held by you (but not enough to block recovery), the rest held by other people you trust. Don't reveal who those other people are, even to each other. Decentralize your own security. — vitalik.eth (@VitalikButerin) May 1, 2024\n\n\"Your hardware wallet will be your fortress of solitude,\" Kofi wrote. \"It will allow you to sleep peacefully at night. It will protect you so that you can survive this game long enough to win.\"\n\nBut not everyone is sold on that being the right way to protect their personal crypto stash. Peter Watts, Uneven Labs CEO and the founder of Reservoir, a developer platform for launching NFT collections, highlighted the risks involved in relying on hardware wallets.\n\nAD\n\nAD\n\n\"When using a hardware wallet, the biggest risk becomes yourself,\" he wrote, adding that someone might find a stashed private seed phrase, or a user could secure it so well that they can't retrieve it themselves.\n\nThat's when Buterin chimed in to describe how he makes sure that he isn't the single point of failure for the security of his cold storage wallet.\n\nPeople often think of @safe wallets as a team only solution. While this might have been true in early 2020, the user base has since evolved significantly. Today, individuals make up more than 99% of @safe users, including notable ones like @VitalikButerin and @punk6529 https://t.co/EyZuKpF2xa — Daniel (@danftz) May 1, 2024\n\nAlthough Safe (formerly Gnosis Safe) multisig wallets have often been treated as a product to help DAOs and other groups manage shared treasuries, there's a lot of individuals who use them in a similar way to Buterin.\n\n\"Today, individuals make up more than 99% of Safe users, including notable ones like Vitalik Buterin and Punk6529,\" wrote a SafeDAO contributor and delegate known as Daniel on Twitter.\n\nEdited by Andrew Hayward"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxQZGc1d01uaVJkWk1ySHJsRTA3LU10S1RoQmlyd3I2T2hXd09JMjNNVUZ2ckRkdEktMVBZQjIxczdlRlNKT3JRVnB5WGt3SzVMaW9NcElBOEJqYTBobGN4R0NuX1VBalh4UHY1UlNNTkx0WXk0bDlNVXY1dGtqZkU2QmlldVVkZExXV1Q0bWozOUE2aERD0gGaAUFVX3lxTE5pNGF0MHUtZlVmZ255T2haWTNLWmRSQmlESWhGODM0R18wQnprSmtiZGI4RjFqVkw2TDNzVjQydFhGM1JzOThoMWN4RUt0MkR3cnhkeEpvN3F6QlRTcEJ2d3FMU2MwSll6M3JQSHB3Yk5NaTJ5Tk5sTWszZmdmTUVRb2R4bmZYQzZYMEVSRVFyS21nanFIa2RzTHc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 May 2024 07:00:00 GMT",
        "title": "Dormant Ethereum Whale Awakens After 8.8 Years, Here's How Much ETH They Hold - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nProminent cryptocurrency tracker Whale Alert has published a post on the X platform about a recently awakened crypto whale. This wallet contains millions worth of Ethereum.\n\nThis premined whale had spent almost nine years in dormancy – this means since 2015, the year that followed the end of the Ethereum initial coin offering (ICO).\n\nThe reactivated wallet contains almost 2,000 ETH worth $5,876,786.\n\n💤 A dormant pre-mine address containing 1,969 #ETH (5,876,786 USD) has just been activated after 8.8 years!https://t.co/MzyVVkMhIc — Whale Alert (@whale_alert) May 2, 2024\n\nEthereum Foundation dumps ICO ETH\n\nPrior to this awakening, an ancient wallet that belongs to the Ethereum Foundation was reactivated after nine years. The wallet transferred a massive 2,000 ETH evaluated at approximately $6.5 million. This money put into it during the period of the Ethereum ICO was moved to a new blockchain address.\n\nAdvertisement\n\nIn the past, the market has reacted negatively when the Ethereum Foundation has released large amounts of Ethereum. This is not the only sale made by this prominent entity observed by market participants this week. Earlier today, it was reported that another wallet linked to the foundation sold 100 ETH for 291,267 DAI via the Cow Protocol.\n\nEthereum whale activity soars high\n\nThis awakening of an ancient whale took place after the overall activity of Ethereum whales demonstrated the largest growth in addresses over the past year. Approximately 139,560 new ETH wallets were created on a single day – April 29, according to cryptocurrency trader and analyst Ali Martinez.\n\nEarlier this week, the second-largest cryptocurrency saw a tremendous decline of 12.16%, falling from $3,243 to the $2,960 zone. It was followed by a small rebound of 3.87%. This discount provided a great opportunity to buy the dip, and traders immediately took advantage of this, setting up almost 140,000 new wallets, expanding the network.\n\nProminent crypto analyst Michael van de Poppe has just tweeted that he expects Ethereum may go down to the $2,500 zone “for the most optimal play.” However, he does not believe that crypto markets are likely to be in for such a heavy correction. “Most of the downside is already in,” he added."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMi-gFBVV95cUxPVjFGY3ZCeGFzT2ZSVWxnVnJoTHByUVZyd2I2SFJYSGM2Mng4Z1pUVThDTFFPWkVGaDVXQURJMjk3UWhreWZDQy14VWRpWFdOWWFwM01kQlcwZzYyc09PT1pVamdyU0dUWWl2bEZIamdqSFFlV1F4a2x6UV9oMUxCd2tVYWpSajlRT2RNMEdURHpjNl9tX180Y0xZYng4aEktSG5hMlZibUNHQW9qbW8yNWxUR1QwZ1pnZUJRSnFoeFRybWxqamxlbnFBdGJmQ1o5RDB0WEd4YlJGblFLczFqNDRvdHR4bzNlMFFLdFVMVk1lMkhsWmo2Yjh30gH_AUFVX3lxTE8tbmlhT0d3MUFOQWg2Y28wZVI1RmI3SVY5SjRPUXlTUkJrLVhKMFhQYmFQQXRJM0VET1lUUjdnd19GS1p4MEstVEFuVld1Ul9temN5Y0UwR01WdTY2Z3d2b1FGMzJfakZTemlVUG0yTkYya1RYaFBPaUFmTnY4XzNuTmpsUFM3cWNXOFVidGdPODlyQ2REUG93S3BEakxYY01XMFh5M0hTeGJheG1hZTEwTlF1cjdPcDNKM3FBaUt6czZhWEJIQ0YwUGw0MW9PM0sweGprN2hzaDYzY05WT2d2R19VanNtSU9QSlA3WTV3eENyZGVYVDZoWFZWcU82dw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 May 2024 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: Altcoins to pump once BTC bottoms out, slow grind up for now - FXStreet",
        "content": "Bitcoin price reclaiming above $59,200 would hint that BTC has already bottomed out, setting the tone for a run north.\n\nEthereum price holding above $2,900 keeps a bullish reversal pattern viable despite falling momentum.\n\nRipple price coils up for a move north as XRP bulls defend $0.5000\n\nBitcoin (BTC) price slipped below $60,000 on Wednesday as markets tried to front-run the Federal Open Market Committee (FOMC) meeting.\n\nIn the mid-April meeting, the Fed alleged new uncertainty concerning whether it could cut rates later this year because of inflation data from the previous quarter. This had markets anticipate a rate hike, causing Bitcoin price to dump, going as low as the $56K range.\n\nIn a surprising twist on Wednesday, however, the Fed decided to keep rates unchanged, with the improved sentiment sending BTC back into the $58,000 range.\n\nThe sentiment has extended to Ethereum (ETH) and Ripple (XRP) prices as they continue to hold above key support levels.\n\nAlso Read: Relief wave on altcoins likely as Bitcoin price shows a $5,000 range\n\nKey level to watch as Bitcoin price slowly grinds up\n\nBitcoin price drop on Wednesday saw it draw close to testing the Bull Market Support Band at $55,831. However, dovish news from the FOMC may have turned around fortunes as the BTC price is slowly grinding up. If the bulls can manage to haul BTC back above the $59,200 level, it could solidify the recovery, effectively meaning that BTC has bottomed out at $56,552.\n\nIn the meantime, Bitcoin price remains in the woods amid falling momentum and growing bearish sentiment, as shown by the Relative Strength Index (RSI) and the Awesome Oscillator (AO) momentum indicators.\n\nIf the Bull Market Support band fails to hold as support, Bitcoin price could extend the fall toward the $52,000 threshold, or in a dire case, test the $50,000 psychological level.\n\nBTC/USDT 1-week chart\n\nConversely, with the RSI holding well above the mean level of 50, and the AO still in positive territory, all hope is not lost for BTC bulls. And while a flip of $59,200 into support would solidify a recovery rally, the bearish thesis will only be invalidated once BTC breaks and closes above $72,000.\n\nAlso Read: Bitcoin price reclaims $59K as Fed leaves rates unchanged\n\nEthereum price still flirts with 25% upside potential\n\nEthereum price is consolidating within a falling wedge pattern. This bullish pattern will be executed after a decisive breakout above the upper trendline in the one-day timeframe.\n\nThe target objective for this pattern is a 25% move toward $4,250, determined by measuring the height of the wedge and superimposing it at the expected breakout point. The descending wedge pattern remains viable, given that the Ethereum price continues to hold above $2,900 in the 12-hour timeframe.\n\nETH/USDT 12-hour chart\n\nOn the other hand, with the lower highs of the RSI, the bears could have their way, sending Ethereum price below the $2,900 buyer congestion level. Such a move would not only negate the bullish reversal pattern but also encourage more sell orders.\n\nTraders looking to open long positions for ETH should wait for the RSI to reclaim above 50 mean level, a move that could be accompanied by a bounce of Ethereum price above the lower boundary of the pattern. A 12-hour candlestick close above $3,212 would provide a good entry.\n\nAlso Read: Ethereum attempts recovery from dip amid unchanged interest rates and accusations leveled at SEC Chair\n\nRipple price defends against further downside\n\nRipple price could pivot around $0.4952, marked by the 50% Fibonacci placeholder, as XRP bulls show commitment to defend the $0.5000 threshold. The RSI has managed to record higher lows in the one-day timeframe, which points to growing bullish momentum.\n\nIncreased buying pressure could see the XRP price bounce with the prospect of reclaiming the $0.5715 peak of the range. In a highly bullish case, the gains could be seen in the rippling price foray above $0.6000, which is almost 17% above current levels.\n\nXRP/USDT 1-day chart\n\nOn the flip side, if the 50% Fibonacci placeholder fails to hold as a support, the Ripple price could drop. A candlestick close below $0.4782 would produce a lower low, hinting at a possible trend reversal.\n\nSpooked holders would then pull the trigger, sending Ripple price below the $0.4500, or in a dire case, roll over to $0.4188. This would mean a fall of nearly 20% below current levels.\n\nAlso Read: XRP sustains above $0.50 as traders digest news of Ripple XRP Ledger entry in the Japanese market."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQTnAyV01OSFZBcTdCYVBLdlNDdThvMDFSa19YODBBdktCVWVucWFvWUlRcWhPZDVKQTIwMU5iMDhpQVlhbUt0MnpNeXRYcVREa1hsT0VIMDZ5VWw3cEJ4QUtzVi1mU3ZSOFIzOTBubG50U3loeEFRN21fQjllRXJIYnNzQkdnWWd3SEHSAY8BQVVfeXFMT1Q2QlBfSVpsTWxzYTA5cjE3OUREYnNlZ2dNSEQzMzlKLWU2NlJtT0hBaE11YzdaVFBiQWNJY2pYelVTbklEMThOaF8waVFFVHhMeU1aWmFudjEzeUs1NVpmU1pCUVVvZDhmVHhrVGR0TU5nN0ZkX1loM0lpeFFXNURZdlo3eGNuS0xDRDFmSWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 May 2024 07:00:00 GMT",
        "title": "Ethereum price’s $3360 rejection – Blame profit-taking or… - AMBCrypto News",
        "content": "Ethereum saw two sizeable waves of profit-taking in the past month that projected doubts about an upcoming rally.\n\nThe ETH whales have added to their stash, with retail being keen to sell.\n\nEthereum [ETH] saw a rejection from the $3360 resistance level over the weekend. This outlined short-term bearish sentiment.\n\nIn other news, the latest Dencun upgrade was a success, helping L2 solutions reach low gas fees.\n\nThe next target for the developers is called Prague. Even though hopeful news was breaking, on-chain metrics showed a lack of faith from market participants.\n\nThe clues from the Ethereum supply distribution\n\nAMBCrypto’s analysis of the supply distribution showed that almost every wallet holding anywhere from 1 to 100k ETH has been selling in recent months.\n\nThe micro wallets with under 0.1 Ethereum were the ones buying, hopeful of a rally after Bitcoin’s [BTC] halving.\n\nIn the past, when the 100k-1 million token holder cohort was added to their stash, it came during a market rally. Sometimes it preceded a major retracement, like it did in mid-January.\n\nThe second half of April saw this cohort quiet down, neither adding to nor selling their supply.\n\nThe 1 million- 10 million cohort saw a sharp uptick in early March. Since then, they too have been quiet. Together, it showed that the large participants expected bullish sentiment in the coming months.\n\nA sharp spike in the 100k- 1 million holders’ supply could be useful for traders to mark local tops and imminent retracements.\n\nDoes fear still rule the market?\n\nThe network realized profit/loss (NRPL) grows during periods of swift price appreciation as profits pile up. The first two weeks of March saw strong price rallies alongside NRPL spikes.\n\nThis indicated profit-taking activity.\n\nHowever, the NRPL has trended downward since then. It saw occasional spikes, such as in late March and mid-April, each smaller than the last.\n\nThis showed participants were keen on booking profits even though the price was just above the $3k support zone.\n\nIt indicated a lack of faith, which is part of the extended retracement Ethereum has witnessed in the past two months.\n\nOn the other hand, the mean dollar invested age (MDIA) has trended strongly higher in the past month. This metric shows that the asset is in an accumulation phase once again.\n\nIt fell sharply during the rally to indicate holders were realizing profits en masse.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nIn the past month, the HOLDer sentiment has been stronger than the collective urge to book profits.\n\nIn conclusion, the metrics showed both fear and hope were present in the market, but long-term investors have more reason to hold on than to sell."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxOOVNLQzhuZlg1ellQOUUtTGtJZ1M4d3VEdXpsUmxJMTJzQVp6Yi1GSE5qWFJrNEJtOXdQeUFrUjFJN3JwWUVYYk9PT09yOEVnZ190NV9nT3REX3I2R3VlaW5BUG9GSXQtZ2s2SC10S2R0WTBFVHdJbzdMRFA5N0VPc3FUR0tIVk9USGFxNNIBkgFBVV95cUxQSEZUMnhrWXVqTjNYOUdvMGdqUG1EYXdqTDBMODA5Yl83NHlMVWlQNnQ0bnB0U0M2SmV2TlhJeW9TcUJ6MFRuaE1fdW9lVFhIaGNSdWFVYXJhOWV1M0pZeHlDZmU1Ukc1TzVfSmFoNlhHajdPMzZzMHN6MDdTc1Y3eFJzd2FGaV9nd0lhUjlPUFdydw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 May 2024 07:00:00 GMT",
        "title": "Ethereum a ‘major disappointment’ – Expert delivers harsh verdict! - AMBCrypto News",
        "content": "Analysts predict peak cycle for Bitcoin and Ethereum amid regulatory uncertainty.\n\nRegulatory debates and SEC allegations intensify negative sentiment toward Ethereum.\n\nAs Bitcoin [BTC], the leading cryptocurrency, dips below the $60,000 threshold, analysts suggest that BTC may have reached its peak for this cycle.\n\nEthereum [ETH] seems to be mirroring the movements of Bitcoin, as both cryptocurrencies are currently experiencing a downward trend.\n\nCommenting on the uniqueness of this crypto cycle, crypto veteran Alex Krüger said,\n\n“The crypto cycle has been almost entirely driven by the bitcoin ETF.”\n\nHe further added,\n\n“ETH has been a major disappointment, but it has performed well overall for stakers and airdrop farmers.”\n\nWhy is Ethereum losing its limelight?\n\nUndoubtedly, Bitcoin achieved remarkable performance by reaching new record highs in this cycle. However, Ethereum’s position has declined, falling below Solana in terms of product-market fit and retail trader popularity.\n\nThis raises a question: Can Ethereum’s price plummet to $2500 within the next 7 days?\n\nWell, to answer this, AMBcrytpo analyzed the liquidation levels for ETH.\n\nAccording to the analysis, the Ethereum market has a cluster of liquidation levels between $2640 and $2750, attracting traders due to high liquidity. Additionally, this price range aligns with a bullish order block observed at the range highs, further reinforcing its significance.\n\nThis underlines that Ethereum’s price is expected to decline to this liquidity pocket before a potential reversal.\n\nThe concerns surround ETH’s classification as a security\n\nMoreover, the ongoing debate surrounding whether ETH is a security has intensified negative investor sentiment toward Ethereum.\n\nAmidst these metrics, a new development also took place wherein Rep. Patrick McHenry, the chairman of the House Financial Services Committee noted,\n\n“New court filings indicate that @SECGov Chair Gary Gensler knowingly misled Congress when pressed on the classification of #ETH at a @FinancialCmte hearing to conduct oversight of his agency.”\n\nThis highlights the increasing uncertainty surrounding Ethereum’s regulatory status and its impact on investor sentiment.\n\nEchoing similar sentiments, @TheDustyBC, a content creator, took to X (Formerly Twitter) and said,\n\n“Ethereum not being kind on the feelings today.”\n\nWay forward\n\nHowever, now with the hawkish stance at the Federal Open Market Committee (FOMC) meeting on the 1st of May. And, the Hong Kong ETFs being a major disappointment, the execs are still waiting for the tables to turn. Needless to say, Krüger claims,"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxQQlFIZWpxeVZISl94X3IxeFU1M2lpaUhyOGN3a0lLRDNRbTVGaU5NY2Qybi1JUVlRX1VWU1ZTeTdKYS1YRjNPVHFYRWVGUFJkM3FTZW1KODhuXzZmMmlmNElQYnRnVXVScUhfRllxcEhuUlFieWJfLVdLQzQxSWhEczViblpTSHZweHY4U185aWxxNDJRUnNoNUJCTmV5N1hXNnpBVlBoYl_SAa4BQVVfeXFMT0pLOXNYN0FleEx1MVV3TzU0QXRFV3RVcDRXVmI5VWpHcVM3aWNkY1VXVDJMU1Q4ellsVGxVX1MtQllHc0tjVnVvMUhHZ0IwbjhsUThxQ0xueUI3ZnF2OE5ldkZFYS1yNWNNOWpSaV9xb2JyZlZrS0xSWUVMYlByOE1hN0xoYmtEc1ViNUgxQkQ1VVd5RlFnNWQ3M3FjVTNKTTBHbnpRWE5yeTVwNVln?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 May 2024 07:00:00 GMT",
        "title": "Crypto Prices Today May 2: Bitcoin At $57K, Ethereum Continues Decline, Solana Recovers - CoinGape",
        "content": "The top crypto prices today witnessed continued declines as the Bitcoin (BTC) price plunged to the $57,000 level. In addition, the Ethereum (ETH) price geared up for a dip below the $2,900 mark, losing hold on a crucial level. However, other top altcoins, such as Solana (SOL), XRP, Cardano (ADA) rebounded significantly, defying the bearish turn.\n\nMajor Crypto Prices Today\n\n1. Bitcoin Price\n\nThe Bitcoin price plunged by 4.43% reaching $57,419.91 at the time of writing on Thursday, May 2. On the other hand, it’s trading volume soared 30.72% to $49.54 billion in the last 24 hours. Whilst, the crypto’s market capitalization slipped to $1.13 trillion.\n\nadvertisement\n\n2. Ethereum Price\n\nThe Ethereum price lost 2.86% to $2,912.84 at press time with a market valuation of $355.33 billion. Whilst, ETH saw its trading volume surge 12.01%, reaching $20.16 billion.\n\n3. Solana Price\n\nThe Solana price rebounded and inched closer to the the $130 mark today. The Solana price gained 2.75%, settling at $129.31. In addition, SOL witnessed a 19.65% surge in trade volume to $4.16 billion in the last 24 hours.\n\n4. XRP Price\n\nWhilst, the XRP price surged past the $0.51 level. The XRP price recorded a gain of 1.75%, reaching $0.5113. On the other hand, XRP’s trading volume spiked 30.32% to $1.78 billion.\n\n5. Cardano Price\n\nMeanwhile, the Cardano crypto price was up 0.66% to $0.4445 today. Whilst, ADA recorded a hike of 28.11% in its 24-hour trading volume, settling at $533.30 million.\n\n6. Dogecoin & Shiba Inu Price\n\nThe Dogecoin price slipped 5.41% to $0.125 while its rival, Shiba Inu price was down by 1.98% and traded at $0.00002168.\n\nAlso Read: Crypto Market Recovery? US Treasury Announces $125M Refunding, Buyback Plan\n\nTop Crypto Gainers Today\n\nAxelar (AXL): The Axelar crypto surged 8.11% and traded at $1.17.\n\nThe Axelar crypto surged 8.11% and traded at $1.17. Polkadot (DOT): The DOT crypto price rallied 5.22% to $6.86.\n\nThe DOT crypto price rallied 5.22% to $6.86. EOS (EOS): The EOS crypto price was up 3.33% and was valued at $0.7813.\n\nThe EOS crypto price was up 3.33% and was valued at $0.7813. Optimism (OP): The TRX crypto price rose 2.97% to $2.66.\n\nTop Crypto Losers Today\n\nHelium (HNT): The HNT price plummeted 7.84% to $4.95.\n\nThe HNT price plummeted 7.84% to $4.95. Toncoin (TON): The Toncoin price plunged 6.60% to $4.72.\n\nThe Toncoin price plunged 6.60% to $4.72. Cronos (CRO): The CRO crypto slumped 6.28% to $0.1233.\n\nThe CRO crypto slumped 6.28% to $0.1233. Sei (SEI): The Sei price witnessed a dip of $0.5098 to 6.02%.\n\nDespite the bearish turn, Solana, Dogwifhat, and Pepe made it to the top gainers list today. However, millions worth of crypto liquidations were noted in the past 24 hours, which could have expedited the latest crash for BTC and ETH. According to Coinglass, Bitcoin alone witnessed $145.55 million liquidations in the last 24 hours. Out of this, $109.13 million has been attributed to longs.\n\nAlso Read: 3 Trending Altcoins To Buy Making You Rich In 2024 Bull Run\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxNaDBwYW9tdW90cDdfcDIxVWdhbzBHRFNvUWxuWU9CMUM5NTR1d0NsenRrRXdEZ2Jfb2ZKeThkUzlxdE1nVUZ6QzJrU0ozb1F1Nk1VWXJNU0p6LTNnaXc4S0tuSzBsT0dBN2lwdnZzczZtMGlfeFBtdHlSNzhwWHByQTFWWHcxV2h1cFpNZUIwcHrSAZYBQVVfeXFMT2NlZHRiRGl3cEVKT251YnB6Q0pDU2U0djVRSVBqZ2tDRFVUUkRXOVZEQ1hlM25xU0UwZ0s1YW1DTG90bkltZkx6OU5yY2lsTmxFVGY1UE9yWHJSRWJtSWszMTk2d3RTU1RUTXNZTng5UUhRa3dFMjRKNENaVmJJT3ByNzU2ajFCc2ZRQ2JISlJwOWREQktB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 May 2024 07:00:00 GMT",
        "title": "Why Ethereum’s price can spiral towards $2500 over the next 7 days - AMBCrypto News",
        "content": "Ethereum flipped its 1-day market structure bearishly.\n\nThe former range highs were the next support region of interest.\n\nEthereum [ETH] saw a wave of selling activity as profit-taking arose amidst fear. The downtrend was persistent in April and the selling volume was growing.\n\nThe indicators were bearish on the one-day timeframe.\n\nThe disappointment from the Hong Kong ETFs’ volume on the first day outlined the sentiment toward ETH and crypto. The Open Interest also fell lower to suggest speculators were more guarded.\n\nThe bullish order block above $2500 next\n\nThe higher timeframe trend of Ethereum flipped bearishly after it dropped below the $2906 swing low. If the daily session closes below this level, the price would very likely head toward the next support zone at $2600.\n\nThis region also has confluence with the former range highs that ETH traded within a few months ago. The RSI on the 1-day timeframe has been below neutral 50 for most of April, highlighting consistent downward momentum.\n\nThe OBV also slipped below a support level recently and retested it as resistance. Ethereum is likely to register sizeable losses before reaching the next notable level on the indicator.\n\nThe hunt for liquidity could see ETH go south\n\nThe closest cluster of liquidation levels for ETH was downward. The $2640-$2750 region presented an attractive pocket of liquidity.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nIt also has confluence with the bullish order block highlighted at the range highs.\n\nIt is expected that ETH will descend to this liquidity pocket before a reversal. Chances of a reversal before that were slim, since these liquidation levels act as magnetic zones to the price.\n\nDisclaimer: The information presented does not constitute financial, investment, trading, or other types of advice and is solely the writer’s opinion."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxNMHcyaWM4cktXWWY4c3JSLVhjNFA1YTJBRXJFRXhFbklOcWR2TWp2cFVqSWpFVEdoMnJFMVVqMW1xcVdFcjNfQmx3bk5IYk5KNjVwTlNmQWEzUEFtZ0NucGZYN3BfaHJfd2doZTNWVnJnc3g4T2lld3FsU1RkTEptWFpBOEdEbHRFY0dabGVvdUVRTXR3VVM1aGQtbmZNTEVpVHlF0gGoAUFVX3lxTE1yS3g3ZVpwMmRGeWJGM1ZiVldkZ2Vld1Z5dHBRX0ZuTld1eC1sbjFvNTVMQldIZnVUakpmdkhuVFhQWnNzaDQ2eFktRVF5YVgzQXkzb0JBQnRBMnp2TlpDc1l1STMwNzFNRXQ3RnZMLTM4UnhuYmZNTDlLbnRtUVJLd2J1OWJSZUVkWjNZVmJabUxDWW1GaDRZMWRRckNFMTE2UUFLaXNaNw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 May 2024 07:00:00 GMT",
        "title": "Crypto Prices Today May 1: Bitcoin & Ethereum Crash 5%, Cosmos Gleams Amid Market Dip - CoinGape",
        "content": "The top crypto prices today crashed heavily as the Bitcoin (BTC) price plunged to the $60,000 level despite the recent Hong Kong ETF launch. In addition, the Ethereum (ETH) price plummeted below the $3,000 mark, losing hold on a crucial level. Moreover, other top altcoins, such as Solana (SOL), XRP, Cardano (ADA) plunged notably, mirroring the bearish trend.\n\nMajor Crypto Prices Today\n\n1. Bitcoin Price\n\nThe Bitcoin price crashed by 5.13% reaching $60,191.06 at the time of writing on Wednesday, May 1. On the other hand, it’s trading volume spiked 41.71% to $37.91 billion in the last 24 hours. Whilst, the crypto’s market capitalization slipped to $1.18 trillion.\n\n2. Ethereum Price\n\nThe Ethereum price tumbled 5.46% to $2,999.10 at press time with a market valuation of $365.74 billion. Whilst, ETH saw its trading volume surge 29.66%, reaching $17.99 billion.\n\n3. Solana Price\n\nThe Solana price extended below the $130 mark today. The Solana price lost 7.06%, settling at $126.06. In contrast, SOL witnessed a 42.20% surge in trade volume to $3.48 billion in the last 24 hours.\n\n4. DarkLume (DLUME)\n\nDarkLume is a gamified socioeconomic system that runs in a virtual world. It offers a distinct blend of fantasy and social interaction. DarkLume enables users to become citizens of virtual countries by participating in recreational activities. It serves as a platform for interaction in a dynamic social ecosystem. To reinvent luxury living and entertainment in the digital age, catering solely to the needs and preferences of modern societies.\n\nThe token is currently running a presale for 40000000000 DLUME tokens. It has already raised $25,033 at $0.0005. The next price is expected to be $0.00060, while the listing price might be $0.0015. These price estimates are entirely situational and subject to change as presale activity increases.\n\n5. XRP Price\n\nWhilst, the XRP price inched closer to drop below the $0.50 level amid the broader market crash. The XRP price recorded a slump of 2.66%, reaching $0.5026. On the other hand, XRP’s trading volume soared 24.41% to $1.36 billion.\n\n6. Cardano Price\n\nMeanwhile, the Cardano crypto price slipped 2.96% to $0.442 today. Whilst, ADA recorded a hike of 40.13% in its 24-hour trading volume, settling at $416.32 million.\n\n7. Dogecoin & Shiba Inu Price\n\nThe Dogecoin price crashed by 7.29% to $0.1324 while its rival, Shiba Inu price tumbled 7.57% and traded at $0.00002215.\n\nAlso Read: How Will Bitcoin Price React To FOMC Meeting?\n\nTop Crypto Gainers Today\n\nCosmos (ATM): The Cosmos crypto surged 5.43% and traded at $8.56.\n\nThe Cosmos crypto surged 5.43% and traded at $8.56. Optimism (OP): The OP crypto price rallied 2.52% to $2.58.\n\nThe OP crypto price rallied 2.52% to $2.58. Starknet (STRK): The Starknet crypto price was up 2.22% and was valued at $1.24.\n\nThe Starknet crypto price was up 2.22% and was valued at $1.24. Tron (TRX): The TRX crypto price rose 0.45% to $0.1201.\n\nTop Crypto Losers Today\n\nArweave (AR): The AR price plummeted 17.25% to $29.74.\n\nThe AR price plummeted 17.25% to $29.74. Stacks (STX): The STX price plunged 15.01% to $2.04.\n\nThe STX price plunged 15.01% to $2.04. Sei (SEI): The Sei price witnessed a dip of 11.75% to $0.542.\n\nThe Sei price witnessed a dip of 11.75% to $0.542. Lido DAO (LDO): The LDO crypto slumped 11.43% to $1.90.\n\nDue to the sudden bearish trend, none other crypto made it to the top gainers list. Moreover, millions worth of crypto liquidations were noted in the past 24 hours, which could have catalyzed the latest crash. According to Coinglass, Bitcoin alone witnessed $107.64 million liquidations in the last 24 hours. Out of this $93.26 million has been attributed to longs.\n\nAlso Read: Here’s Why Pepe Coin Price Sees a 20% Breakout Rally in May\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxNaGthQ0RaVEtKazBqUVd1VG4tNENmRExlZDFOUURmcnpMeF82VnNYSzk1ZS1yRWtJTU4yNTlFSjVTZ0pqMFdLTU5ucmdralBzbEpfM1I4QkFnUU8tZjdpbzcwM0N4bW0wWkhhcVBiVVFxb3k3VWRVemhJeC1Vc0F0dDlGQWZ0d2JUX3piMm5R0gGTAUFVX3lxTE9sMkl3Zmt1WV96OHRMOUFCbC05d2tMS3VxRlNIaU1XbWJkeVNOWkZRUmNLRGRCZTBENDhNTS1hdFJVeUViX2JSR2t5eUwzYURsWFd6QWRTRk9qV05KYkhXUmVJcEx1emR6Q2V6SWo5VWdVSWpKOFRERWRPc0V1UWF6dEw3MEZ4d3hpLVAzYkJLS0ctaw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 May 2024 07:00:00 GMT",
        "title": "Solana loses 10% in 24 hours, but ‘beats’ Bitcoin, Ethereum in THIS key area - AMBCrypto News",
        "content": "Funds attracted inflows despite SOL’s bearish price action.\n\nThe prospect of improving network health might have driven investors towards SOL.\n\nDigital asset funds tied to Solana [SOL] SAW healthy demand last week, as investors’ appetite for the fifth-largest cryptocurrency took a healthy turn.\n\nSolana sees a shift in sentiment\n\nAccording to the latest report by crypto asset management firm CoinShares, Solana-based crypto products attracted more than $4 million in inflows last week.\n\nThis was a sharp turnaround from the $300,000 in net outflows recorded in the week prior.\n\nThe recent inflow boost came even as blue-chip assets like Bitcoin [BTC] and Ethereum [ETH] witnessed heavy outflows, totaling $423 million and $38 million respectively.\n\nInterestingly, demand for SOL-linked funds surged despite a bearish price action, which saw the crypto tumble 16% over the week, AMBCrypto noted using CoinMarketCap data. At press time, in just 24 hours, SOL’s price was down by over 10% on the charts.\n\nIn fact, the price decline resulted in a slight drop in total assets under management (AUM) from last week, from $1.15 billion to $1.14 billion.\n\nWas this the reason?\n\nWhile it is difficult to pinpoint the bullish catalyst propelling investors toward Solana goods, the possibility of reduced network congestion could be a credible cause.\n\nSolana developers have been shipping release after release to alleviate transaction failures and congestion on the network, issues that have contributed significantly to the FUD around the coin.\n\nThe latest one to go out was the v1.18.12, which was currently being validated in the test environment.\n\nThe Solana community hoped that these improvements would finally resolve the ongoing troubles with the blockchain, which has been strained to its limits due to an explosion in meme coin trading.\n\nRead Solana’s [SOL] Price Prediction 2024-25\n\nThe latest blow\n\nWith Bitcoin crashing below $60,000, the downtrend has persisted on SOL’s charts, with the altcoin down 10% in 24 hours.\n\nThe latest drop appeared to be part of the broader market bloodbath, fueled by lackluster performance of newly-listed spot crypto ETFs in Hong Kong."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxPU0xaUzd0bllDX2VJVFN5QzV6ZVE1UmNoaUlqdmNDRDRRRm51NDdXWi1ic2ttWXJkbTNwdlYxbzhnWEpTbExURWd2SWhGNVRIUXlNOFNoV2hNSUFsM3NwcmtQMDRUZmhEeFdGMnMyV0FyQkwzV0twY01DNElFZHJ2VGZtbWg4c0JOYU1GYXo3WXpid9IBlwFBVV95cUxOX1ktMHI1c3AxVzhHazBiaERwbzQwdTF4VTJLcTlfOUhIX0kxbzlhS0tEWnRZcWlwS0V4VzBac2ZMbFBSaDFfRmtBSTRlOE9naVVpZ0dxWmVHajVZdzd4V3lQUUpUeDM2cy1Oam1xMnIwdVVJZWJOYlNSTGxIb2M0ZG0xU3NiSnVwRjB5US1LczNPdTZ5cGFJ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 May 2024 07:00:00 GMT",
        "title": "April 2024 Report – BTCFi dominance, Ethereum’s fall, and May forecast - AMBCrypto News",
        "content": "Runes on Bitcoin’s blockchain can save traders from massive losses in the coming months.\n\nStaking on the Ethereum blockchain is on the rise, raising concerns about its future as “money.”\n\nAhead of the FOMC meeting (Federal Open Market Committee) of May 2024, the crypto-market saw a significant decline. Bitcoin dropped to $56,494 – A level last seen on 28 February 2024. Market sentiment skewed towards the side of fear as investors rebalanced their portfolios in expectation of no rate cuts.\n\nBitcoin’s MVRV Ratio (7-D) fell to -8.099%, at press time. On average, Bitcoin holders were underwater. It suggested that the market value was significantly lower than the price at which most acquired BTC.\n\nIt could also be taken as a sign of undervaluation. According to AMBCrypto’s market report for the month of April, Bitcoin will continue its downward journey for the majority of trading sessions in May.\n\nHowever, the report discusses three factors (Related to BTCFi, Options ETF, and Solana) that could reverse the king coin’s trajectory. Investments through BTC ETFs will have a bigger impact on price, compared to the fed rate cut anticipation or geopolitical strains.\n\nSince 24 April, BTC ETF outflows have been outweighing the inflows. On 30 April, a $161 million outflow was registered – The highest in the last three days.\n\nAMBCrypto’s report throws light on a fresh perspective though – It reveals numerous institutions are seeking approval for Bitcoin ETFs. If these ETFs are green-lit in May, it could lead to a significant hike in demand, potentially driving the price north.\n\nBitcoin’s savior – Runes\n\nThe rise of DeFi on the Bitcoin blockchain could save traders from registering massive losses in the coming months (AMBCrypto’s report dives into its full details).\n\nInterestingly, the 7-day moving average of Bitcoin’s market cap to transaction fee ratio fell below that of Ethereum. It highlighted a huge surge in activity on the Bitcoin network since the launch of the Runes protocol. Basically, this ratio indicates how much money is flowing into a cryptocurrency relative to the transaction fees being paid.\n\nAltcoins’ performance in April\n\nFollowing Bitcoin’s footsteps, the price of other cryptocurrencies also fluctuated by a significant degree. April was a volatile month for most altcoins. The broader market witnessed a downturn due to geopolitical tensions and inflation fears. However, some sectors thrived, like gaming tokens.\n\nAs per AMBCrypto’s report, Ethereum’s dominance has been challenged by Solana, whose DeFi market share has been surging steadily. Meanwhile, an Ethereum ETF is still pending SEC approval, and staking on the Ethereum blockchain is on the rise, raising concerns about its future as “money.”\n\nTake a look at AMBCrypto’s Market Analysis – April 2024 Edition\n\nDive into April’s market trends, valuable data, and exclusive insights to help yourself navigate through May’s market movements.\n\nThe report delves deep into key topics like –\n\nRising popularity of DeFi on Bitcoin\n\nAmerica’s love for memecoins\n\nFall in USDT’s dominance\n\nSolana’s TVL masterstroke\n\nNFT market’s recovery\n\nMarket forecast for May\n\nYou can also download the full report here."
    }
]