[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxOTm5VME9xRVBQN3Fxd1htdHF2endtM3BtNU5rc19TbHJGV0JoelVwM3ZHb1cxM04tVGxUZmJONnFVelZJd1dOaUluZzJSNmxJbDhmT3NJZXEzVzNaM1hwMG1fVWxwdWJJTTJRT2JaSEdIZmhYbUR2cjdsT1ZGOVpXclJmVnBlUHNjekNYMnZlSm5oOEhLa254V0RtM3JsalI1TnVZZEQ5Qmc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Feb 2024 08:00:00 GMT",
        "title": "Spot Ether ETFs Could Introduce New Concentration Risk in Ethereum: S&P Global - Unchained",
        "content": "An increase in ether staking ETFs could affect Ethereum’s validator mix, and potentially increase the network’s concentration risk, say analysts from S&P Global.\n\nS&P Global said that an increase in ether staking ETFs could affect the mix of validators, and potentially increase the network's concentration risk.\n\nUS ether spot exchange-traded funds (ETFs) could be approved as early as May this year, but certain funds with staking functionality could introduce new concentration risks for the Ethereum blockchain.\n\nIn a Feb. 20 report, analysts at S&P Global said that an increase in ether staking ETFs could affect the mix of validators participating in the Ethereum network’s consensus mechanism.\n\nThe S&P analysts, Andrew O’Neill and Alexandre Birry, noted that while the participation of institutional custodians could reduce the current concentration on the decentralized staking protocol Lido, it could also introduce new concentration risk if a single entity is chosen to stake the bulk of ether included in these ETFs.\n\nLido is the largest Ethereum validator with $29.2 billion in total value locked (TVL), according to DefiLlama. Industry watchers have often pointed to the staking provider’s dominance in the liquid token staking market as a concern, arguing that Lido’s 31% market share presents a significant centralization threat to Ethereum.\n\nHowever, Marin Tvrdić, the protocol relations contributor for Lido, explained in an interview with CoinDesk last year that neither the decentralized autonomous organization (DAO,) nor the protocol itself, holds custody of users’ ether, or staked ether.\n\n“At no point is it a custodial solution,” Tvrdić said. “At every single point in time, from the moment ether enters the protocol and gets deposited on a validator, it’s self-custodial.”\n\nS&P’s O’Neill and Birry believe that spot ether staking ETF issuers are unlikely to choose decentralized protocols like Lido, but rather an institutional crypto custodian.\n\n“Coinbase acts as a custodian in eight of the 11 recently approved U.S. bitcoin ETFs and is named as a staking institution by three of the four largest ether staking ETFs outside the U.S,” they noted.\n\n“The effect of U.S. spot ether ETFs on concentration risk, be it positive or negative, could be significant, which makes constant monitoring of concentration risk even more important,” they said.\n\nCurrently, there are eight spot ether ETFs being considered by the U.S. Securities and Exchange Commission (SEC), including Cathie Wood’s Ark Invest and 21Shares, Grayscale Investments, BlackRock, VanEck, Hashdex, Invesco and most recently, Franklin Templeton."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxQRGR1NTk2X0pvQUkzQzhaRjJxenNPNGFVWW5aZTFUM1EyZG10SUhZdGRKek5QS0xwVklocnE4TEFDQlk1d2ZhNUxTNmx1Z2FmeWFaTTdHbWUtTkVhZUFGZlpuVXJUTVZKa1pObjhZX2U4dHJFQVp4a3libG9OZEQ5cG1BTEZYVE5KN0llUGl2Q3lYNXhr?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 22 Feb 2024 08:00:00 GMT",
        "title": "Is Ethereum Fulfilling Its Potential as an Incredible Disruptor? 3 Reasons I'm Bearish - The Motley Fool",
        "content": "This innovative crypto gets a lot of attention, but investors need to ask pressing questions.\n\nEthereum (ETH -0.92%) was born from the perceived limitations to adding functionality to Bitcoin. Launched in July 2015, Ethereum has skyrocketed nearly 93,000% in value since its public release, even though it remains more than 40% off its peak price.\n\nIs the world's second-most-valuable cryptocurrency, with a current market cap of about $350 billion, fulfilling its potential as an incredible disruptor? I'm not so sure. Here are three reasons I'm bearish on Ethereum.\n\nHuge promise\n\nLet's first try to understand why there's so much hype surrounding Ethereum and its long-term potential. Thanks to the blockchain network having functionality for smart contracts, many bulls believe that Ethereum can disrupt numerous industries, particularly those that depend on expensive intermediaries, by giving power and value back to the users.\n\nIn other words, smart contracts can automate a lot of functions that are slow and cumbersome, and that might not add much value. The end result, as many hope, is a better and cheaper user experience.\n\nViewed in this light, it might be encouraging to see Ethereum's complex roadmap. With scalability, security, and sustainably as the top priorities, the network's developer community has laid out different sets of upgrades to accomplish certain milestones. The latest event, known as The Merge, changed Ethereum to a proof-of-stake consensus mechanism, significantly reducing its energy usage.\n\nViewed as the world's decentralized computer, Ethereum's ultimate goal is to change the entire structure of the economy, mainly as it relates to how individuals can have greater control in an internet-enabled world.\n\nReasons to be skeptical\n\nIt's easy to get caught up in Ethereum's promise. There are more than 250 million unique wallet addresses. It has the most total value locked by far of any other crypto, which measures the amount of assets locked in a specific DeFi protocol. And sure, there are thousands of decentralized applications.\n\nBut I view things with a critical perspective. I think Ethereum is still primarily used as a tool for financial speculation, not actual utility. Even if spot Ethereum exchange-traded funds get approved, it proves that investors only want price exposure, instead of using Ethereum tokens in some dApp setting.\n\nAnd are dApps really better than services provided by well-known businesses? Marketplace and platform-like businesses, such as Meta Platforms, PayPal, Uber, and Airbnb, have billions of users combined who find value in what they have to offer. They work just fine as is.\n\nAnother reason I'm bearish is that I view Ethereum as another venture start-up, which defeats the entire purpose of crypto aiming to be decentralized and give power to the people. There are still a few head developers, most notably Vitalik Buterin, who have outsized influence on the direction of the network. And these founders stand to gain the most financially should things work out as planned.\n\nThe Securities and Exchange Commission said that Bitcoin is the only crypto that's a commodity, and that others are essentially securities. This supports the argument that Ethereum is just another profit-seeking enterprise.\n\nAnd the last bear case rests on the belief that Ethereum is a solution looking for a problem. In fact, this is probably true for nearly all cryptocurrencies right now.\n\nAll of the focus and discussion centered on the complex technicalities of the underlying network sound exciting. However, one really has to question if more and more people will engage further with Ethereum and use its dApps in the future. I'm not confident in this outcome.\n\nIt might make some bullish Ethereum supporters uncomfortable to challenge their beliefs about the cryptocurrency. But I think healthy criticality is necessary to set realistic expectations about its future."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxPbEdfbHRCZzBFUFdMRldIUXNPbUJxSXA4eHBiaXNSYndXMm9ybVYxSDdqWDczTTM5LVplUnczRWhUNXAtd2l4bUFiV1BvOTVZLWdlZkI5WDFuMGVRWm9aSVQ2WHdhcVVvWThlaVNvMm43TmVPUW1EdTJTdnVuSW45ME54N1kyUjZseHVfUzh5VDI3dTFLZnhLRGZmNWQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Feb 2024 08:00:00 GMT",
        "title": "First Bitcoin, now Ethereum. Analysts see four drivers behind an even bigger surge - DLNews",
        "content": "With the Bitcoin ETF dust settled, analysts are now turning to Ethereum.\n\nSeveral key catalysts could see Ether outperform Bitcoin this next cycle.\n\nOnchain activity is already on the rise, specifically for stablecoins built on Ethereum.\n\nThe immensely successful launch of Bitcoin spot exchange-traded funds in the US is setting the stage for a new wave of speculation.\n\nThis time, it’s all eyes on Ethereum.\n\nThe Securities and Exchange Commission has a good chance of approving Ethereum spot ETFs in May, analysts told DL News.\n\nThat’s not the second-most valuable cryptocurrency’s only tailwind, either.\n\nSEC’s next ETF hurdle\n\nWith Bitcoin ETFs now out of the gate, analysts are turning their attention to Ethereum and its slew of catalysts.\n\nAt the top of the list: The SEC might greenlight a slew of Ethereum spot ETFs in May. BlackRock, Fidelity, and other Bitcoin spot ETF issuers have already filed applications to launch such products.\n\n“While the Ethereum ETF isn’t as much of a guaranteed approval as the Bitcoin ETF, the market has now gotten a taste of what to expect when it is approved,” Quinn Thompson, head of capital markets at Maple Finance, told DL News.\n\nOver $10 billion has already flowed into Bitcoin ETFs, excluding Grayscale’s fund, which already existed prior to its conversion into an ETF. The action has helped buttress Bitcoin’s hefty 21% rally since the year’s start.\n\nJoin the community to get our latest stories and updates\n\n“Given Ethereum’s smaller market cap and liquidity, a similar or lesser amount of flows would have an even bigger impact on Ethereum’s price,” said Thompson. “The market will begin to reprice this possibility higher over the next one to two months ahead of more clarity from the SEC.”\n\nBrian Rudick, senior strategist at crypto trading firm GSR, told DL News he saw the odds of Ethereum ETFs being approved at roughly 66%.\n\n“The experts I’m seeing give May approval odds between sub-50% to 70%,” he said. “Almost everyone, however, thinks it’s only a matter of time, since Ethereum futures-based ETFs exist already — if denied in May, the SEC will get sued, and approval moves to 2025.”\n\nUsers of the crypto-powered prediction site Polymarket price approval odds at 47%.\n\nThe deadline for approval is May 23, says Bloomberg Intelligence ETF analyst James Seyffart. That’s the final deadline for VanEck’s application.\n\nThe SEC will likely want to greenlight all applications at the same time, just as it did for Bitcoin spot ETFs.\n\nSeyffart and fellow Bloomberg Intelligence ETF analyst Eric Balchunas said last year that the agency wanted to avoid being a “kingmaker” by approving a fund ahead of others — like when it allowed ProShares to launch its Bitcoin futures ETF before anyone else.\n\nDencun, EigenLayer and Ethereum’s burn\n\nEthereum has three other tailwinds, too.\n\nScheduled for March 13, the Dencun upgrade — designed to enhance scalability and reduce transaction fees on layer 2 solutions — is Ethereum’s most significant upgrade since Shapella, which allowed stakers to finally withdraw their ETH from the network.\n\n“Layer 2s are a vital component of Ethereum’s future success,” CCData research lead Joshua de Vos told DL News. “Improving their scalability and cost-effectiveness is going to enhance the attractiveness of Ethereum compared to competing layer 1s such as Solana.”\n\nThe rise of restaking protocols such as EigenLayer is another reason traders may flock to Ethereum, Rudick pointed out.\n\nAnd stablecoin growth on the network is an indication that activity was ready to pick back up, Thompson argued. Ethereum stablecoin supply is up 4.4% since January 1, from $68 billion to $71 billion, according to DefiLlama data.\n\nFinally, Ethereum’s monetary policy may also play to the bulls. Vigorous onchain activity means the network burns even more Ethereum per transaction. If this destruction outpaces issuance — or how much new Ethereum enters the market — it can create a deflationary dynamic.\n\nSince February 8, for example, there has already been more Ether destroyed than created, per data from ultrasound.money.\n\n“In a bull market where onchain activity is increasing, stablecoin supply growing and user adoption scaling at a higher pace, Ethereum is positioned to outperform Bitcoin given its more levered to economic activity in the crypto ecosystem,” Thompson said.\n\nCrypto market movers\n\nBitcoin is down 0.3% in the last 24 hours and trading for $51,217.\n\nEthereum is trading flat over the same period, now at $2,912.\n\nWhat we’re reading\n\nTom Carreras is a markets correspondent at DL News. Got a tip? Reach out at tcarreras@dlnews.com"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiXEFVX3lxTE9xU1hOeWRDbDJ2UUVQVTBuY05EeGJ0bTAtZXdZVHVfbXM5bWk4SHdPbUVRLVN6REo2QTRXUl9seGV6Q3ljdThTQnJfRmNjcG56WnBuRkcySnU3NUQw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Feb 2024 08:00:00 GMT",
        "title": "Solana Price Eyes $150 after Receiving $26M from Ethereum - crypto.news",
        "content": "On Feb. 20, Solana TVL surpassed $2 billion for the first time in 2 years, and funds flowing in from Ethereum through the Wormhole bridge suggest more SOL price gains ahead.\n\nSOL‘s price has lost steam after soaring to a new 2024 peak of $118.40 on Feb. 15. However, an on-chain data trail of funds inflows trickling down to Solana from the Ethereum (ETH) network this week could spark a SOL price rebound toward $150.\n\nSolana price dips 12%, falling below market average\n\nIn the first half of February 2024, Solana was at the forefront of the crypto market rally, with SOL price soaring 26.8% and adding nearly $11 billion to its market capitalization. But that market trend flipped on Feb. 15 as investors began to take profits once the SOL price reached the 2024 peak of $118.\n\nSolana (SOL) price performance vs. Total3 Altcoin Market Cap (Excluding BTC and ETH) | Source: TradingView\n\nAt press time on Feb. 21, Solana is trading at $103, down 12% from its Feb. 15 peaks.\n\nMeanwhile, in contrast, the total altcoin market has grown by 5% during that period. Solana’s negative price performance seems driven by insiders and existing holders’ booking profits rather than macro factors.\n\nSolana receives $25 million in inflows from Ethereum\n\nHowever, while some SOL traders are taking chips off the table, the Solana network has continued to make some giant strides this week, which could trigger an early price rebound.\n\nIn the past week, Solana has received significant inflows from Ethereum as investors increasingly look to leverage Solana’s more efficient and cost-effective defi services.\n\nBetween Feb. 14 and Feb. 21, investors transferred funds worth over $24.6 million from Ethereum to Solana, per on-chain data from Wormhole bridge Explorer.\n\nFund Outflows Ethereum (ETH) to Solana (SOL), Feb. 13 – Feb. 21 | Source: Wormhole Bridge\n\nThis indicates that Solana continues gaining traction among developers and defi users due to its high throughput and low transaction costs. Hence, this rising flow of funds bridged into Solana-hosted decentralized applications (dApps) is a bullish indicator of its growing adoption and utility.\n\nSolana defi TVL hits $2 billion milestone\n\nInvestors transferring funds worth over $24.6 million from Ethereum into the Solana ecosystem, despite the 12% decline in Solana’s price over the last seven days, shows an evident divergence between short-term price movements and long-term investor sentiment.\n\nSolana (SOL) Total Value Locked (TVL) hits $2 billion, Feb. 21, 2024 | Source: DeFiLlama\n\nThe latest wave of fund inflows has now propelled Total Value Locked (TVL) on the Solana network above the $2 billion milestone for the first time since June 2022.\n\nThis further underlines that the ongoing SOL price pullback is not driven by any discernible deterioration of Solana’s fundamental network growth metrics.\n\nIf the trends persist, the rising demand for Solana defi service could eventually evolve into market demand for native SOL tokens and ultimately trigger a bullish price reversal towards the $150 territory in the coming weeks."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxQbV9HdUNYa1JOYnRSc1dVYnVpNHloR3BjWWY4OURfZF83aUlwOHgzd2RHeDhtOF81bGZRTUMxSGM0djhkX0haWUdqWjJfMXpNNjlEc1c4cWQxbVVDb2F3RmNTbC01MUYxTHZxSVRIN3NnSmxfd1FwMzIzQWhLQk5aN2RMNDQzdml3c1NGbDdR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Feb 2024 08:00:00 GMT",
        "title": "Ether Price Hits $3,000 for First Time Since April 2022 - Unchained",
        "content": "Ether’s trip to $3,000 may have been short-lived, but on-chain data and the state of the wider ecosystem suggests that there’s reason to be optimistic about the digital asset.\n\nEthereum’s native token ether (ETH) hit a near two-year high ahead of $3,000 on Tuesday – the first time it has traded at this level since April 2022.\n\nThe second largest digital asset by market cap rallied over 12% in the last week and briefly changed hands at $3,031, according to data from CoinMarketCap. At the time of writing, ether had failed to gain momentum towards a move higher, suggesting that this resistance level won’t be so easy to breach.\n\nFrom a psychological perspective, this recent rally could also have some traders on their toes, given the last time ether rallied to this level in the weeks leading up to April 3, 2022. At the time, ether rallied from $2,520 over three weeks to a high of $3,580, but its price plummeted 46% over the next 40 days that followed.\n\nIn its most recent review of the crypto market, onchain analytics firm Glassnode noted that while Bitcoin dominance still remains significant, there are early signs of more investor capital rotating into other ecosystems like Ethereum and Solana.\n\n“We note that following the approval of the bitcoin ETF, ether has started to outperform bitcoin, which is a change from the relative underperformance throughout 2023,” said the Glassnode analysts.\n\nIt is also likely that major inflows into ether will only materialize over the coming weeks, as they tend to lag relative to bitcoin inflows on account of investors looking for confirmation that digital asset markets are growing.\n\n“In the 2021 cycle, the peak influx of new capital into bitcoin occurred 20 days before the peak influx into ether,” said Glassnode analysts.\n\nOptions market data suggests that a retest of some crucial price levels might come sooner rather than later. Coinalyze data points to more bullish bets on the price of ether, showing that 59% of traders were in long positions over a 24-hour time frame."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxQYXBfWUtGSER0TkQyN0dEZUdjUFJVakRjUVpMWTFuSEgxLTNzRVRVc3NrUEhPSjV0Nkk1RzhMeUFsZi1EUFJRRFlaSmlrQy1mU1RjYXl1bXFkejdTdXQ5cWVEZmJrUy1IaGlSNHlDNGpXRzlhYXRYRzhsYTB4Wm1rNWVZamFsRlRoRVBZNVdUMGlyRkhRVk5vRnY5b0hvdVdueUE1MVdPdU5lbXVJUmpoSmZnSDBYLV9mZEVDLUF30gHDAUFVX3lxTE5jaDBEZkZmXzFkVTRGSjVVYzZUUFpsd2VaTmROdWp2TFNRMWNHb09BZ0l2azZIQzJCaXh4NElCR3p0MlVNcGREMkh6ZkptMXY1V3Fsc0ZRWTVCUTg1U19EUzF5TDhkQWZQT2dLS3FJZXluMkdqNFNOelR1QmFzQmpuZjRORGp6UGp3Z2xzNlM0QUpIX2hIY2JxM2NDU0dCQ2wtcGVSVjNmUEFRUWVYUXN5NFVNbHNXbjdXU093eTFSZzJlYw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 22 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Layer-2s About To Take Off, Says Coin Bureau’s Guy Turner – Here Are His Top Picks - The Daily Hodl",
        "content": "The host of the Coin Bureau YouTube channel, Guy Turner, is expressing bullish sentiment on Ethereum (ETH) layer-2 projects.\n\nIn a new strategy session, Turner tells the 2.41 million channel subscribers that ETH’s Dencun update may cause layer-2 projects to go on massive rallies and he names his top four picks.\n\nThe Dencun upgrade, which is expected to roll out in March, aims to reduce costs for layer-2 transactions and data availability on the leading smart contract platform.\n\nSays Turner,\n\n“As the Dencun upgrade draws near, Ethereum’s layer-2s are about to take off.”\n\nFirst up, the trader says that Arbitrum (ARB) could maintain its upward momentum.\n\n“ARB recently hit an all-time high of $2.40 on the 12th of January, and hasn’t really shown many signs of slowing down either in large part due to the anticipated effects of Dencun. This is because Dencun’s impact on layer-2 transaction speeds and costs will likely see more and more people adopting Arbitrum as an even cheaper way of interacting with Ethereum.”\n\nArbitrum is trading for $1.83 at time of writing, down 6% in the last 24 hours.\n\nNext up, the trader says Optimism (OP) has a lot of upward potential due to its aim to build a “superchain” ecosystem that promotes collaboration across multiple layer-2 scaling solutions.\n\n“One of the first entrants to the ‘superchain’ ecosystem was none other than Coinbase’s very own layer-2 solution, Base…\n\nThis superchain could quickly become a reality after Dencun.”\n\nOptimism is trading for $3.68 at time of writing, down more than 9% in the past 24 hours.\n\nAnother scaling solution on the trader’s radar is Immutable X (IMX), which he believes could become more popular in the GameFi industry.\n\n“Immutable could see a rapid acceleration in blockchain gaming development as network efficiency is supercharged. With Immutable being positioned as a big player in the GameFi narrative, many more gaming developers will be turning their attention to the best environment to launch their products in, and Immutable will be a top contender in that regard.”\n\nImmutable is trading for $3.33 at time of writing, down more than 5% in the last 24 hours.\n\nLastly, the trader says Polygon (MATIC) could rise in value due to its own planned network upgrade called Polygon 2.0.\n\n“MATIC hit an all-time high of $2.92 on the 27th of December 2021. At the time of shooting, it’s still at 66% down from this price point. However, this could all change with 2.0.”\n\nMATIC is trading for $0.93, down nearly 9% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxNRk9tMnRLa3RocTF1MUF4X2c1VS0wbFZYcWRIWi1uNFFja3poaVdXT2lQeXFmLVlDSXFSQTh4Si00TmZ4bnBWcV8yU1V4aVBJUHhUSy1TRnBxUmRxNjNLZjJWbVBqTk5ha3RjWm5tRXhGczFmSGJOeTlyVDUwTlVXTTRuRdIBiwFBVV95cUxOS2JseFU5bE03dDFCcGFTLU51WEh0d0x4OTY4Q1o4cDZLVm1xcWtrS0FpY0NLOXlvd3l3NV9LT1pBcXhrWDBNUU9fSXh3UkR5Q3dzQ0VlaGhCYmNpRWttVDg3NnA1Z2lLT0tOdWx1b0Y0OHRzcHd1WHVsZzdQNXd6V0xMdkpIenI0Vk80?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Feb 2024 08:00:00 GMT",
        "title": "Portal Launch Set as Binance Offers 50 Million Ethereum Gaming Token Rewards - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAfter an airdrop farming campaign that prompted hopeful recipients to flood Crypto Twitter with tweets, the Portal gaming token finally has a launch date—and it comes with the announcement of a Binance Launchpool campaign that will offer up another way for crypto users to earn a potentially sizable stash of PORTAL.\n\nPORTAL will launch on February 29, according to the Binance Launchpool campaign page, and the crypto exchange will list the token at 10am UTC (or 5am EST). The Launchpool campaign will debut tomorrow, February 22, and offer token staking rewards ahead of the listing.\n\nBinance customers who stake either Binance Coin (BNB) or the FDUSD stablecoin into PORTAL liquidity pools can earn a share of the total rewards pool, which numbers 50 million tokens—that’s 5% of the total PORTAL supply of 1 billion Ethereum-based tokens.\n\nAccording to Binance, the token will debut with a circulating supply of 167,134,615 PORTAL, or about 16.7% of the total supply. However, Binance’s Launchpool campaign is not available to users in many countries, including the United States, Canada, Australia, Japan, and more. A full list can be found here.\n\nAD\n\nAD\n\nPortal has yet to announce details about the actual airdrop distribution following a farming campaign that spanned November and December last year. A Portal representative told Decrypt’s GG that details will be announced before the Binance token listing.\n\nIn pre-market trading on Whales Market, the PORTAL token is commanding bids of $1.02, which puts the total estimated value of the Binance rewards pool at just a hair over $50 million.\n\nWhat is Portal? Billed as a cross-chain crypto gaming platform and token, it’s designed to bridge the gap across various ecosystems, providing one place to play, discover, and transact across popular blockchain games.\n\n⚡ Portal x @binance ⚡ The moment you’ve all been waiting for is nearly here. On Feb 29, 10am UTC, $Portal will officially launch on @binance. This is just the beginning. We’ve got so much to show you about Portal and the products we’ve been building. Get ready! https://t.co/zge4Prs1n1 — Portal (@Portalcoin) February 21, 2024\n\nAD\n\nAD\n\nSome of Portal’s founding team members and advisors are associated with SuperDuper, the startup behind Ethereum NFT collection Creepz, including Chief Business Officer Dan Keene, who serves the same role at SuperDuper. Advisors Jamie King (ex-Rockstar Games) and Matt Dixon (ex-Electronic Arts) are among those who also advise SuperDuper.\n\nPortal is represented by prominent Hollywood agency WME. Beyond the airdrop farming campaign, the project also held a presale in December that attracted nearly $10 million worth of interest across Ethereum and Solana in just 15 minutes alone.\n\nThe Portal campaign comes right after Binance concluded a Launchpool push for PIXEL, the Ethereum token of the Ronin network game Pixels. PIXEL was listed Monday and generated more than a billion dollars worth of trading volume in less than a day, making it one of the top 10 most-traded cryptocurrencies in the world that day, per data from CoinMarketCap.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxPTXI2alZSUTJNWjFBTC0wdnNUVDFlLXFzellZWXBNX1hqbGtTSEh0MkRPNFo1bW5nUlZyYWdTZHVYVzYtMzUtV09VUktWZElqeGVWZk55ZE5HUkNOR1llRWN2RzdpeVVXS3FDUHNWMDdFeGRSWW9FS2sxbmZTdFliUEE1R1p4QmQ1UVd5UFFzbXFPYUdlQllZcTRjZEplLUZuY3fSAacBQVVfeXFMTXpPNE1DcUdJY2xLNk05M1hlNThXMEdVSGIwOWlRSGhvejVWRHpLYkdYdUhRNDhmTlAwWWpjcEJqOElIS1Z4YTczcFJCd1RHa251X1p6OW1IWE40bjlFalZPQ0wwb0pqMkxfR3h4Qk02M3ZzbmpTeFNndkRYaThadVRhZHJpbDlxT2NGc0cxOFlVV2lycTk0Uks2WW9TcFZzQVdta0JHX3M?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 22 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Price Could Reach $4,000 In March On 4 Factors Including Spot ETF - CoinGape",
        "content": "The launch of Bitcoin ETFs in January turned the spotlight on Ethereum price, the second-largest cryptocurrency. Investors believe Ethereum has a high probability of receiving a spot ETF, especially with several proposals already with the Securities and Exchange Commission (SEC).\n\nDespite the growing optimism, ETH clawed back some of the gains it accrued earlier this week, falling from slightly above $3,000 to $2,900. The pullback came upon increased volatility in the market, with Bitcoin (BTC) rejecting $53,000 for a sweep at $50,500.\n\nadvertisement\n\nBesides Ethereum, other altcoins such as Solana (SOL), XRP, and Cardano (ADA) also pulled back to gather more liquidity. This could account for the modest price gains in the market on Thursday.\n\nEthereum price is one of the most uniquely placed projects, considering its standing as the second-largest crypto, the largest smart contracts platform, and its upcoming Dencun upgrade.\n\nThis article looks at these factors and more to determine the role they are likely to play in ETH’s recovery journey in the short term.\n\n1. The Dencun Upgrade Scheduled For March\n\nThe Dencun upgrade comprised of two separate upgrades “Deneb” and “Cancun,” is a major improvement for the Ethereum network that will increase its scalability and efficiency when implemented.\n\nIt will introduce proto-danksharding, a feature that will reduce the cost of transactions on layer 2 solutions like Polygon and Arbitrum, which are faster and cheaper than the main chain. The upgrade has been tested on three testnets: Goerli, Sepolia, and Holesky.\n\nWith the final launch expected in March 2024, Ethereum price is already showing signs of an incoming rally. The token surged to highs slightly above $3,000 this week, backing positive sentiment.\n\n2. The Spot ETF\n\nThe approval of the spot Bitcoin ETFs has been referred to as a major development for the cryptocurrency industry. In addition to validating Bitcoin as a global mature asset, ETFs allow traditional investors who are not interested in the complexities of crypto to get exposure to BTC.\n\nMoreover, the move opened the door to fresh speculation regarding the approval of a spot Ethereum ETF. Two years after the approval of Bitcoin futures ETF, Ethereum got its futures ETF. Experts say that the wait could be much short-term for the spot ETF.\n\nLike Bitcoin the hype surrounding the ETF could be a major catalyst for Ethereum price in the coming months.\n\nRecommended: Ethereum Price Rally Gains Momentum for $4000, Here Why?\n\n3. Staking\n\nValidators in the Ethereum ecosystem are required to stake at least 32 ETH. This condition significantly reduces the circulating supply. Ether becoming a PoS network through the Merge in 2022 allowed investors to freely stake and withdraw liquidity.\n\nContrary to expectations, the transition to PoS made staking even more attractive to investors, who have so far locked in $46.65 billion worth of ETH in smart contracts, according to Defi Llama.\n\nUnlike 2022 and 2023 when Ethereum experienced a persistent drop in staked assets, 2024 is looking positive, implying that investors have a long-term bullish outlook.\n\nAn increase in staking translates to reduced sell-side pressure. Holders stake tokens they do not intend to sell in the near future, expecting the price will rise with time.\n\n4. Ethereum Price Dons Bullish Technical Structure\n\nDespite the correction from $3,000, Ethereum still holds above key indicators like the 20-day Exponential Moving Average (EMA). Besides, support at $2,900 stopped the decline on Wednesday, realigning ETH with the upward trajectory.\n\nThe four-hour chart shows that dips are profitable. So until support at $2,800 flips, traders may want to consider buying ETH and in the process contributing to the momentum targeting $4,000 in March or before Bitcoin halving. The Ichimoku Cloud also affirms Ethereum’s long-term bullish outlook.\n\nRelated Articles\n\nJohn Isige John is a seasoned crypto expert, renowned for his in-depth analysis and accurate price predictions in the digital asset market. As the Price Prediction Editor for Market Content at CoinGape Media, he is dedicated to delivering valuable insights on price trends and market forecasts. With his extensive experience in the crypto sphere, John has honed his skills in understanding on-chain data analytics, Non-Fungible Tokens (NFTs), Decentralized Finance (DeFi), Centralized Finance (CeFi), and the dynamic metaverse landscape. Through his steadfast reporting, John keeps his audience informed and equipped to navigate the ever-changing crypto market.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE91eFZBQS0ySmpMWEUwRzBMR0pieGVNQ0pFaGhNTmRXUDk5eFBEekFVdF81Wm42QkF1WDVWakx0SGxQbFRjQjh2MUlhNmQ4cVo0SE1XSndyODdjQ2U1Vk5QVUFpbTE5Zk9xNlJGbDZpVHZHZHNiTmRNbWNxYmc3Z9IBgwFBVV95cUxOTjRhMUU2M3I2dWFKM051Smd6c3VWZUs1eXEtSzRSVXhaR21ERTJNem5LQlVDQVdOT2wzNm04Z0tsVjRiMHA3dmlZeHdJRVk2SGRxNmhrR1Q3M3VnakhsQUpaR1hmQlIxcHJ4MEVlWUctR2NBUW9nenNiZ2RCLXVqMElZWQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Feb 2024 08:00:00 GMT",
        "title": "Bitcoin Maxi Fred Krueger Sounds Crucial Ethereum Warning - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nIn a recent post titled \"ETH is completely detached from reality. A deep dive,\" on the X platform, Fred Krueger, known for his staunch support of Bitcoin, delivered a harsh critique of Ethereum (ETH), highlighting concerning trends and indicating a bleak outlook for the second-largest cryptocurrency by market capitalization.\n\nAdvertisement\n\nConcerns over ETH's declining user activity\n\nKrueger began by pointing out that despite Ethereum's soaring price, indicative of a robust ecosystem, the actual usage of the Ethereum blockchain has witnessed a notable decline. He highlighted that while ETH has surged to $3,000, the number of Daily Active Users (DAUs) on the Ethereum network has dwindled from 120,000 in 2021 to a mere 66,000 in the past year.\n\nThe decline in active users is further exemplified by the dwindling numbers on Uniswap V3, Ethereum's leading decentralized exchange (DEX) protocol. With just 16,000 DAUs, a stark contrast to the 60,000-plus seen in 2020, Krueger noted that Ethereum's utility as a transactional platform seems to be eroding.\n\nETH is completely detached from reality. A deep dive.\n\n---------------------------------------------------------\n\n\n\nETH is at $3,000. Surely this must mean that a ton of people are using ETH, and that this number is only going up, right?\n\n\n\nNope.\n\n\n\nEth, the chain has dropped from 120K… pic.twitter.com/141GwtB0yz — Fred Krueger (@dotkrueger) February 21, 2024\n\nThis statistic is particularly alarming considering Ethereum's role in the decentralized finance (DeFi) ecosystem and its aspirations to become the backbone of various decentralized applications (dApps), especially in the face of the upcoming Dencun Upgrade.\n\nEthereum: Meme coin in disguise?\n\nKrueger likened Ethereum's current state to that of a \"meme coin,\" drawing parallels to assets like Shiba Inu (SHIB). He emphasized that despite its soaring valuation, Ethereum's utility seems to have dwindled, particularly in comparison to other blockchain networks such as Solana, Avalanche and Near, which offer cheaper and faster transactions.\n\nKrueger also expressed skepticism regarding the possibility of an Ethereum Exchange-Traded Fund (ETF) approval, citing concerns about regulatory scrutiny.\n\nWith Gary Gensler, the Chairman of the U.S. Securities and Exchange Commission (SEC), unlikely to greenlight an Ethereum ETF due to potential issues surrounding its premined nature, Krueger cautioned against banking on such an approval as a catalyst for Ethereum's growth."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxOOFNUTzREak91MnFMV0RnVWoxdVZYSE9CZkhLVzU3Rk9STFYwUmdCZDlDV2kzUnc5cHpjQmlyZGJuR2lMVWpsWGJndXhaTFMyZkR6OXZMVV9YamJjT29NTzBSNW9TTGRidGZScHhaTzdxX0FtbW81NHRDWkhMME5iM0lEMWxBQ2ZGT05BYjE3YUhRMV9Dd0lOTNIBngFBVV95cUxPWDh0QUtJTHFIeUxnc1FlbVZMakJKOTNBZGRTcUk2ajFIRkV4RXhrYkRUd3ZQYWZhZGlwblBzVENNYjItcEp1WEVMWFFYVHlxZThMeXVTdWZwMHRDSEN2VGRwY1hIeXh1SGs4UUNfQ1QxcjBUSlZhaWpzd2ZDVHNvcWlOVWt0LWNZUVVSTmpDWEozV3R0bFMzNWZtLVVwZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 22 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Dencun Upgrade: Which Layer-2 Platforms Will Benefit the Most? - CoinGape",
        "content": "As investors keep a close watch on the potential approval of spot Ethereum ETFs, attention is currently directed towards the imminent Ethereum Dencun upgrade. Scheduled for March 13, this upcoming enhancement is anticipated to wield significant influence, potentially bolstering various players within the Ethereum ecosystem.\n\nExploring the potential ripple effects, let’s delve into how the Ethereum Dencun upgrade stands to benefit other Layer-2 platforms within the Ethereum ecosystem.\n\nadvertisement\n\nThe Ethereum Dencum Upgrade\n\nGet ready for the ‘Dencun’ upgrade, set to roll out on March 13, marking a significant hard fork update aimed at boosting the Ethereum network’s scalability, security, and user-friendliness. As part of Ethereum’s roadmap initiative, dubbed ‘The Surge,’ this upgrade is a pivotal step forward in scalability enhancements.\n\nHere’s what you can expect from the Dencun upgrade:\n\nEIP-4844: Boost scalability.\n\nEIP-1153: Cutting down on-chain data storage expenses.\n\nEIP-4788: Elevating security and functionality.\n\nEIP-5656: Fine-tuning EVM performance\n\nEIP-6780: Improving network security.\n\nThe standout feature in Dencun is the implementation of Proto-Danksharding. With EIP-4844 (Proto-Danksharding), a new transaction type called ‘blob-carrying transactions’ is introduced, reducing transaction costs for both L2 users and ramping up Ethereum’s transaction throughput.\n\nPopular crypto analyst Miles Deutscher explains that the Ethereum Dencun upgrade will reduce transaction fees on Layer-2 platforms by a considerable magnitude. The analyst also emphasizes the increased commercial viability for dApp developers and users. This shift will position L2s as more appealing options compared to alternative L1s, offering a positive catalyst across various sectors such as DeFi applications, gaming platforms, and on-chain trading.\n\nLayer-2 Platforms That Benefit From Dencun Upgrade\n\nAlthough several Layer-2 platforms will benefit from the Ethereum Dencun upgrade, Miles Deutscher shares his coveted list of those platforms that he thinks will benefit the most.\n\nPolygon (MATIC): Deutscher noted that $MATIC currently finds itself in a compelling position. It’s on the verge of rebranding to POL. Despite lagging behind other L2s, there’s been notable investment in implementing zk technology. Considering these factors, Deutscher believes $MATIC could emerge as a strong performer in the weeks or months ahead. Arbitrum: Arbitrum’s metrics remain impressive, solidifying its position as a preferred chain for launching new dApps. Maintaining its status as the top L2 in terms of Total Value Locked (TVL), Arbitrum also boasts transaction volume that outpaces other L2 solutions. Optimism: Optimism ranks as the second-largest L2 by Total Value Locked (TVL), closely following Arbitrum, and it has demonstrated robustness in transaction processing. Recently, the platform unveiled its fourth airdrop, which is expected to reignite interest and activity within the ecosystem. COTI Network: COTI has unveiled V2, an Ethereum Layer 2 (L2) solution focused on privacy, featuring the introduction of ‘Garbled Circuits.’ This innovative technology offers an efficient method for maintaining privacy, marking the blockchain’s maiden implementation of such a feature. Mantle: Mantle is currently among the rapidly expanding Layer 2 solutions. With over $1.5 billion worth of ETH staked as mETH (Mantle Staked ETH), it ranks as the third-largest LSD (Layer 2 Staked Deposit) after Lido and RocketPool. Moreover, mETH stakers can anticipate some promising airdrops in the near future. Metis: Metis is experiencing a wave of favorable developments that are propelling its growth forward. Notable among these is the establishment of the 4.6 million $METIS Ecosystem Fund, signaling a significant injection of $400 million into the ecosystem. Additionally, the upcoming launch of the decentralized sequencer alpha mainnet in March promises to further enhance the platform’s capabilities and usability. Moreover, the implementation of the LSB (Liquid Staking Blitz) campaign is poised to bolster participation and engagement within the Metis community.\n\nMiles Duestscher stated that he’s keeping a close watch on other Layer-2 Networks such as Manta Network, Starknet, zkSync, and Linea.\n\nBhushan Akolkar Bhushan is a FinTech enthusiast with a keen understanding of financial markets. His interest in economics and finance has led him to focus on emerging Blockchain technology and cryptocurrency markets. He is committed to continuous learning and stays motivated by sharing the knowledge he acquires. In his free time, Bhushan enjoys reading thriller fiction novels and occasionally explores his culinary skills.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxQZlV0M1hGRUFibU1hN290cHVjRFJ0WXI1eEVXeGMtbU9ZUWowV0pFYXZMRGJYNWNqYnJua0pWWVpoSVliZXMyRFVrTFBjLXVkeTRaTnM0QkNmTVRkMGVfakl0LUlGR2VhZHBQbnlmZWk3UlEyeFJFZjlmdmV0SjZyNC1YZF8tVWJFMnBsSGpMVEdMRk1wV3oxSktnOGFtcm9Rai03TGZGbWVTcVlfLVB3NDR3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 22 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Foundation alongside zkSync allocates $900K for ZK Layer 2 development - CryptoTvplus",
        "content": "The Ethereum Foundation, alongside Aztec, Polygon, Scroll, Taiko, and zkSync has announce the launch of the first ZK Grants Round. This grants initiative aims to enhance the Zero-Knowledge (ZK) Layer 2 Ecosystem, with a total shared prize pool of $900,000.\n\nAccording to the Foundation, each contributor, including the Ethereum Foundation, raised $150,000 to support research and development for ZK proofs and standards.\n\nThe Ethereum Foundation (EF) is a non-profit organization dedicated to supporting Ethereum and related technologies. Established in 2014, the EF aims to promote Ethereum and related technologies without controlling or leading them. Instead, the EF serves as one component of a broader ecosystem.\n\nThe EF focuses on initiatives such as the Ecosystem Support Program, which provides both financial and non-financial support to projects and entities within the wider Ethereum community.\n\nA zero-knowledge proof (ZKP) is a cryptographic method used to prove knowledge about a piece of data without revealing the data itself. It allows one party (the prover) to convince another party (the verifier) that a claim is true without disclosing any information other than the fact that the claim is true.\n\nZKPs are used to provide privacy guarantees and are employed in various blockchain use cases, such as identity management, authentication, and private transactions.\n\nAccording to a report from Protocol Labs, the zero-knowledge proof market is anticipated to generate $75 million in revenue by 2024 and is expected to surpass $10 billion by 2030. The report further highlights a projection of almost 90 billion zero-knowledge proofs being needed for web3 applications alone in the year 2030.\n\nApplication dates and deadlines for the funding\n\nEthereum Foundation also noted in the announcement that interested parties are invited to submit proposals by 11:59 UTC on March 18th, 2024. These projects can be in various stages of development, including ideas, proof-of-concepts, work in progress, and fleshed-out projects.\n\nThe focus of development includes enhancing multi-prover systems for validity, ZK, and fraud proof. It added that the funding is also open to projects that improve various proof systems, enhance efficiency and user-friendliness of ZK Domain Specific Languages (DSLs), and create security benchmarks for ZK Rollups (ZKRs) and bridges.\n\nAdditionally, teams can explore the development of tools and interfaces for ZK and validity-proof based Layer 2 solutions, creating transpilers between zkDSL and Solidity, and investigating hardware acceleration for ZK protocols.\n\nAll proposals are expected to be submitted in PDF format, English language, with detailed descriptions, budgets, timelines, an applicant profile, and a link to published work. Eligible projects must be open source, align with the round’s goals, and benefit the Ethereum ZK Layer 2 ecosystem as public goods.\n\nEvaluation criteria include impact on the Ethereum ZK Layer 2 ecosystem, value to multiple Layer 2 solutions, documentation clarity, and proposing individual or team experience.\n\nEthereum Foundation revealed that ineligible projects involve illegal activities, financial products or services, art or social impact initiatives, retroactive funding requests, and those planning token launches or public funding rounds."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMihgJBVV95cUxOVXFOUDE1bnFhNzViUjFub1JnU1FLbnJxZThhSFgwd2tKczZXZ281UVAzbWNDVWVlZHJ5Ml9kci12MWdrQy1xd0FHMzFfM2J6SkxBYkVHdmZVanQyU2xjMEl6ZGwzT2RYTmpqUUxNR2d0UGVSUU9keXgzdllrQlVVU05pS3U3eWpJNTdFWHhLZ3ZhMFVzcHplWnRvOFJIZ3dUaXZxdWJmZTNjekdwN0Zqb01ETzgySXJQZHRmWnBrZjJMV1MtQmo1VkI4YXRRaHR1TEtQQUpaWnpjLVg3WUxDT0wxSVh5SVlLc2VRZHRIYVJ4RnlPcTlUQ01LcGhXVEJPVDRTaV93?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Feb 2024 08:00:00 GMT",
        "title": "Fuel Labs, Creator of the First Optimistic Rollup, Unveils \"Rollup OS\": The Operating System Purpose-built for Ethereum Rollups - Canada NewsWire",
        "content": "LISBON, Portugal, Feb. 21, 2024 /CNW/ -- Fuel Labs , creator of the first optimistic rollup Fuel V1, today announced its evolution into the \"Rollup OS\", a complete operating system specifically designed to help Ethereum rollups realize their full potential. Specifically designed to tackle critical limitations in the existing rollups architectures, the strategic shift strengthens Fuel Labs' position as a visionary in the Ethereum ecosystem while paving the way for its mainnet launch in Q3 2024.\n\nUnlike existing virtual machines (VMs) designed for layer-1 (L1) blockchains or general-purpose computation systems, Fuel offers the first purpose-built VM that will unlock new capabilities for Ethereum rollups.\n\nFuel's unique architecture addresses core challenges in blockchain scalability beyond the conventional paradigm of modularity and even data availability — enabling higher throughput via parallelization, state minimization, seamless interoperability and VM customizability.\n\n\"As rollups mature, it's clear that an operating environment optimized for their unique requirements is a non-negotiable next step. Fuel is that evolution: the 'Rollup OS' solves critical bottlenecks, future-proofing both rollup technology and the Ethereum ecosystem,\" said Nick Dodson, CEO and Co-Founder of Fuel Labs.\n\nAddressing Ethereum's Scaling Bottleneck\n\nEthereum's reign as the dominant smart contract platform is undeniable, yet its future-readiness and developer appeal hinges on EVM's ability to solve future requirements of Ethereum rollups. As rollups and modular infrastructure rise, existing technologies made for general computation, or monolithic L1 systems, fail to address the evolving demands of this rollup-centric reality. This forces developers to navigate compromises in design, limiting innovation, adoption, and ultimately, Ethereum's long-term vision for a globally decentralized network.\n\nThe Fuel Advantage: A New Operating System for the Rollup Era\n\nFuel brings unprecedented power to Ethereum rollups by combining state-of-the-art innovations and learning from its rich history in rollup development:\n\nParallelization to Fuel Scalability Beyond Modularity: Parallel transaction execution in the FuelVM enables Fuel-powered rollups to offer a highly performant user experience, while preserving Ethereum 's decentralization and security. As blockchain networks are increasingly designed to be modular – separating execution, consensus, transaction finality and data availability into separate layers – optimized performance rests on parallelization to offer next-generation scalability benefits.\n\nParallel transaction execution in the enables Fuel-powered rollups to offer a highly performant user experience, while preserving 's decentralization and security. As blockchain networks are increasingly designed to be modular – separating execution, consensus, transaction finality and data availability into separate layers – optimized performance rests on parallelization to offer next-generation scalability benefits. Tackling State Bloat for Sustainable Growth: Fuel's advanced UTXO model , coupled with unique state minimization techniques , combats state bloat – referring to the ever-increasing accumulation of data that must be entirely stored and managed by nodes in a blockchain network to ensure proper chain validation and state transitions. This allows Fuel-powered rollups to scale without compromise, inheriting Ethereum -level security all while maintaining the lowest node operation overheads. This translates to significantly decreased processing requirements for validators thereby ensuring long-term decentralization.\n\nFuel's , , combats state bloat – referring to the ever-increasing accumulation of data that must be entirely stored and managed by nodes in a blockchain network to ensure proper chain validation and state transitions. This allows Fuel-powered rollups to scale without compromise, inheriting -level security all while maintaining the lowest node operation overheads. This translates to significantly decreased processing requirements for validators thereby ensuring long-term decentralization. Introspection for Seamless Interoperability: Cross-chain fragmentation reduces overall efficiency. Features like introspection streamline interchain communication, empowering developers and users to navigate a fully connected, multi-rollup ecosystem on Ethereum with confidence.\n\nCross-chain fragmentation reduces overall efficiency. Features like streamline interchain communication, empowering developers and users to navigate a fully connected, multi-rollup ecosystem on with confidence. Security-First Design with Asset Orientation: FuelVM removes non-intuitive features like ERC20's unlimited approvals, and introduces multiple native assets for use cases like native NFT bridging and much more. Native account abstraction and support for multiple signature schemes open the doors to effortless user and wallet onboarding into web3, accelerating mainstream adoption.\n\nremoves non-intuitive features like ERC20's unlimited approvals, and introduces multiple native assets for use cases like native NFT bridging and much more. Native account abstraction and support for multiple signature schemes open the doors to effortless user and wallet onboarding into web3, accelerating mainstream adoption. Developer Empowerment: FuelVM: The heart of the Rollup OS, FuelVM provides maximum flexibility and power to developers, unlocking innovations impossible with constrained legacy architectures. Sway: A domain-specific language designed for blockchains, combining features of Rust and Solidity for secure, yet developer-friendly, blockchain programming. Forc: A suite of powerful tools simplifying and accelerating dApp development and deployment on Fuel-powered chains.\n\nHighly Customizable: The Rollup OS unlocks a new wave of creativity in innovative decentralized application ( dApp ) building, purposefully designed to support use cases that require high computational load, such as advanced decentralized finance ( DeFi ) protocols and web3 gaming.\n\nThe Rollup OS unlocks a new wave of creativity in innovative application ( ) building, purposefully designed to support use cases that require high computational load, such as advanced finance ( ) protocols and web3 gaming. Open-Sourced Security & Collaboration: Fuel prioritizes Ethereum 's security as the foundation, while advocating for collaboration over competition through its open-source ethos.\n\nFuel aims to remodel execution in order to fuel the future of Ethereum, unlocking never before seen web3 use cases at massive scale. For more information, developers may visit Fuel's tech docs at https://docs.fuel.network . Support can also be found via Fuel's Discord at https://discord.com/invite/fuelnetwork .\n\n###\n\nNick Dodson, CEO and Co-Founder of Fuel Labs is available for interview.\n\nAbout Fuel\n\nFuel is an operating system purpose-built for Ethereum rollups. Fuel aims to bring new capabilities to the Ethereum Ecosystem all while preserving decentralisation. Fuel rollups will have parallelization, state minimised execution, and interoperability along with native account abstraction and support for wallets of all networks.\n\nFuel combines the purpose-built FuelVM, a highly optimised Rust-based blockchain programming language Sway, a fully integrated tool chain Forc, and several services to create a complete Rollup OS for Ethereum. Fuel's unique architecture will allow developers to build experiences never before seen in the Ethereum ecosystem.\n\nFor more information, please visit:\n\nWebsite | X/Twitter | Discord | Blog | GitHub | Documentation | Forum\n\nSOURCE Fuel Labs\n\n[email protected]"
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxNa1JnTmZRN1ZIRWRRel9TN0VBUUJCWm4td0UxeUxGREdVU1ZPVXBPUzFwWmVwcTJNbDlWT2NtVm5paTRCN3lxZGUtTnd1MlM0eWdEdVZSOXM3UEJpVG83enhYZUltVEpsS0ZFSFlJbEdsOEVoTFhoN0dXZHdTTEZDa0lXb2FxSlZSTHU2b0VNUG1DZ9IBlwFBVV95cUxNbl9DOTNMNnBHak9OXzZDYkppdHJyV2tUZDFjaWVlRkZpTTNIUlJfODNQWGJXVWc4YkJpOXc3ZmYyRkVjOHljbEY5R3ZjSWsyNnRYdndxQzF5R3Zkd3RnaGI4bFVweG5JTE9LOGthUUE0WGJYalBWTEo3ZThvVWFhcHFNYnJJV21DZW1oMmVodHRyejVtdE9R?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 22 Feb 2024 08:00:00 GMT",
        "title": "Crypto Prices Today: Bitcoin Flux At $51K, Ethereum, SOL, XRP & PEPE Slip - CoinGape",
        "content": "The cryptocurrency universe witnessed quite the bustle today, February 22, following a slump in crypto prices, per data by CoinMarketCap. As the global market cap took a hit, plunging 1.62% to the $1.95 trillion mark, a bearish sentiment appears to be prevailing within the broader crypto market. Prominent cryptocurrencies like Bitcoin, Ethereum, XRP, and Solana collectively witnessed a price slump today. This appears to come due to the massive crypto market liquidation witnessed yesterday, per CoinGape Media’s report. However, sentiment for bolstered prices looms over the crypto horizon even though Fed’s stance on unchanged rates prevails. The crypto market appears to have witnessed the prior mentioned liquidation aligning with this.\n\nMajor Crypto Prices Today\n\nAs mentioned above, the Bitcoin price continued its downward movement post-liquidation today, falling 1.28% in the past 24 hours. The current BTC price rests at $51,411, with a market cap of $1.009 trillion. Meanwhile, the token also witnessed a substantial drop in its 24-hour trading volume, falling 9.45% and reaching $29.25 billion. Derivatives data also showcased a 1.18% drop in BTC open interest, hinting at a downtrend prevailing in the market.\n\nadvertisement\n\nOn the other hand, the Ethereum price marked a considerable 3% dip over the past 24 hours and is currently trading at $2,918. After a phenomenal run past the $3K mark, the 2nd most renowned cryptocurrency witnessed a significant plunge following yesterday’s $300 million liquidation. As of writing, ETH too witnessed a noteworthy decrease of 2.87% in the token’s market cap, reaching $350.97 billion, whereas the 24-hour trading volume dropped 3.41% to $19.08 billion.\n\nSolana’s price fell by 3.98% over the past day and is currently trading at $102.74. The token’s mark cap jotted a drop of 3.98%, reaching $45.29 billion, whereas the 24-hour trading volume also plummeted 13.63%, reaching $2.23 billion. XRP, the Ripple-backed token, witnessed a 2.80% dip over the past day and currently stands at $0.5421. Even XRP’s 24-hour trading volume fell 19.11%, while the market cap stood at $29.58 billion.\n\nAlso Read: Sam Bankman-Fried Opts to Retain New Legal Team Amid Concerns\n\nThe Top Crypto’s Prices For Today\n\nWorldcoin Price Soars\n\nWith a boasted market cap of $977.89 million, the Worldcoin price soared 4.33% in the past 24 hours and is currently trading at $7.36. The token marked a phenomenal week with the past seven days as a staggering 137.73% surge was witnessed, per market charts. This bullish movement comes primarily from numerous factors, including whale accumulations, burgeoning project adoption, etc.\n\nPepe Coin Price Falls\n\nAs of writing, the Pepe coin (PEPE) price, a meme coin, dropped 4.21% over the past 24 hours and is currently trading at $0.000001116. The meme coin’s market cap plunged 4.20%, reaching $469.54 million, whereas the token’s 24-hour trading volume also decreased by 20.89%, reaching $100.72 million.\n\nStarknet Slumps\n\nAfter showcasing a phenomenal surge, the Starknet (STRK) price tumbled 6.24% today, reaching $1.88. The token’s trading volume jotted a substantial drop of 33.56%, whilst the market cap dropped 6.08%, reaching $1.37 billion. Subsequent to the token’s recent listing on Binance, the price action seems to be fueling speculations.\n\nAlso Read: DCG Slams Genesis Settlement as ‘Subversive’ in Court Objection\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMi9wFBVV95cUxNVFVSLVNiandOcVZoeEdRWFBXYURwZDhIOXl1UVh4dFB0OWdFaEFJRU9qMmhreUVJX1ZpLXRpTVlESHFtRGI0T0JXWlJnRGtqZUt3YndRazZtZmFqVEpzQTZCYnhYWkdtWk9XLWg0Rzg1VHc1dmVCenZxemNoTWI4UUY5ZjNZYkZnUEEwS2RtRHVZV3VHc3pvR2pKYi1GeF9SSkJaZ21VYUN4eVM4OFRHOWgzVXBxaDVwaHlGdFFXYkVXNEJIYmlJMEVSR2xUeTlYNHZJY0ExMlh3a2pEM284LURZMFFBb3FwVkRaTE1VWkNyRnVvb1Iw0gH8AUFVX3lxTE1namtrSDVFT3lMU05aeUozQl95OWFGOUwxMVBwaldhMXZWaTV3WVBDY3N6a3BYVUoxS3RJb2xGZlBsUWdjbFpETExtdWFTQXltWWtMekx4YzE3UzFNN2tyY1pXUmZnb3poakVqcWlMQzhvWGVtZUJZaDVkTXRIQXZSWE5IUkp4VzAtQllVVXFlczJ4YTRQR2lDQnNXUHFMZUJGYXFmV3JfSDdVeDFWMjlHcnZpS2FDX3k0M0VTNU9tUWU0NDdsRVpab3dORkxLSHV3TlNrQ3E4ZVdyOG9fR3lXTmEzOVFpUWFYS1I3U1M2ZEhqSktORV8zOXBxYw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 22 Feb 2024 08:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: Crypto market cowers with sell signals after FOMC minutes - FXStreet",
        "content": "Bitcoin price could make a 5% trip south to the $48,000 psychological level.\n\nEthereum price likely to revisit $2,770, a 5% fall with a sell signal already in play.\n\nRipple price eyes a 7% fall amid growing overhead pressure.\n\nBitcoin (BTC) price is flashing red, alongside most altcoins, coming after the Federal Open Market Committee (FOMC) minutes revealed that some members think that interest rates could have topped out. Per the report, others expressed concerns over the progress of inflation. Nevertheless, some policy makers say the economic outlook appeared firmer than the December projections.\n\nBREAKING NEWS\n\n\n\nFed Minutes suggest rates are at their peak https://t.co/J03IIvsmT5 pic.twitter.com/rEjWSwv3a7 — FXStreet News (@FXStreetNews) February 21, 2024\n\nFind detailed report here: Fed Minutes suggest rates are at their peak\n\nBitcoin price could revisit $48,000\n\nBitcoin (BTC) price is almost showing a directional bias, breaking below the $51,335 support. Judging from the technical indicators, if BTC records a candlestick close below the aforementioned buyer congestion level, the king of cryptocurrency could roll over to the $48,000 psychological level. In a dire case, BTC could retest the order block between $45,556 and $46,691.\n\nThe Relative Strength Index (RSI) has already registered a sell signal by crossing its signal line (yellow band), while the Moving Average Convergence Divergence (MACD) is dipping and could also cross below its signal line (orange band). Meanwhile, the MACD histogram bars are paling out.\n\nBTC/USDT 1-day chart\n\nOn the other hand, if the bulls show resolve, Bitcoin price could recover, flipping $52,985 into support as it extends towards $55,000 or in a highly bullish case, $60,000 psychological level. Such a move would constitute a 17% climb above current levels.\n\nAlso Read: Bitcoin price likely to fall but MicroStrategy’s $12 billion market cap makes it a possible S&P 500 candidate\n\nEthereum price could fall 5%\n\nEthereum (ETH) price, like BTC, is responding to a sell signal executed on the RSI. Traders heeding this call could see ETH drop 5% to the $2,770 support, coinciding with the midline of the ascending parallel channel. The paling MACD histogram bars accentuate this bearish thesis, solidified by the topped out MACD which is now deviating south.\n\nETH/USDT 1-day chart\n\nConversely, a recovery among the bulls could send Ethereum price north, first clearing the range high of $3,033 before creating a local top above it.\n\nAlso Read: Ethereum price scrapes $3,000 psychological threshold after 20 months, inspiring conjecture on altseason\n\nRipple price subdued by growing overhead pressure\n\nRipple (XRP) price remains within the confines of the descending parallel channel, a status made worse by growing overhead pressure. Specifically, XRP price faces overhead pressure due to the 200 and 100-day Simple Moving Averages (SMA) at $0.5643 and $0.5835 levels respectively. These features, coupled with the sell signal that the RSI has just executed, tilt the odds in favor of the downside.\n\nAccordingly, Ripple price could make a 7% drop to $0.5001, levels last tested on February 7. If this level fails to hold as support, XRP price could slip through to the $0.4734 support floor, around 13% below current levels.\n\nXRP/USDT 1-day chart\n\nOn the other hand, if the bulls come in, enhanced buying pressure could see Ripple price recover. A northbound move could see the payments token overcome the 200 and 100-day SMAs, bring the $0.6000 psychological level within reach.\n\nIn a highly bullish case, XRP price could leap further to test the $0.6421 blockade, nearly 20% above current levels.\n\nAlso Read: Ripple CEO criticizes SEC says regulator has lost lawsuits consistently; XRP price holds firm above $0.55"
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMiygFBVV95cUxQOExXS2hsbzYwMUxLR25MdDFtWXJwOGMxNEcwSjdCa20wNUw0Y2Jfa1N5dWdaaWNBTHpWdTJTakgyNXBvTEVUa19hYmJ0RklrajlFZU9wMDhveUhPeW9SemZvay1USDdFMXRUYVYtS2F1Qlc5akZmY2J4ZGR4Y1o4TE5LYnBCalJ6UmNsakM4WW9NbWc1OXVYc1BnY21GQUhybm5qcEFaSzA0SXVQdk1NdXdoX1dqd3JBQ2xQRTdWdm1yZDNjYXoza2xn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Faces Sharp Rejection Near $3,000 As Profit-Taking Sentiment Rises! What’s Next For ETH Price? - Blockchain Reporter",
        "content": "After [ccpw id=60415] soared past the $50K milestone, traders eagerly anticipated [ccpw id=60480] to mirror this success by crossing the $3K threshold. This expectation came to a conclusion as Ethereum shattered its two-year peak by breaking the $3,000 milestone, setting off a wave of short liquidations. This breakthrough has triggered bullish outlooks, prompting a rise in Ethereum accumulation by investors who are now gearing up for potential further price surges. Nevertheless, with the increase in profit-taking behavior around that mark and the exit of both long-term and short-term holders near the peak, this led to a steep decline in the ETH price.\n\nEthereum’s Netflow Becomes Positive\n\nBitcoin’s value has climbed to $53,000, but Ethereum has outpaced BTC’s gains, reaching $3,000 for the first time in almost two years. These price increases have put highly leveraged traders on alert, leading to total liquidations of around $300 million.\n\nYet, Ethereum’s price is now undergoing a significant drop as many investors sold their stakes near the $3,000 peak. Notably, Ethereum saw total liquidations nearing $8.6 million, with a substantial $8.5 million of those being buyer liquidations. The week started off on a slower note, but Bitcoin made an aggressive move to $53,000, hitting this level for the first time since late 2021.\n\nData from IntoTheBlock shows that the Netflow metric for ETH has moved into the positive territory, indicating that the volume of inflows now exceeds that of outflows. This shift points to a rise in exchange reserves, increasing the likelihood of sales and thus exerting downward pressure near resistance levels. The Netflow metric currently registers at +20,470 ETH.\n\nMoreover, the volume of large transactions has doubled recently, jumping from a low of 1.08 million ETH to 2.26 million ETH. This increase signals a rise in activity by major investors or “whales.” In the event of such a market rejection, these whales could lose confidence, potentially triggering a wave of selling pressure that may drive the ETH price down to its immediate support levels.\n\nHowever, the bullish sentiment continues as ETH’s network is poised for a pivotal enhancement called “Dencun,” scheduled for March. This update is set to deploy “proto-danksharding” to the blockchain, which is expected to boost its performance and lower transaction fees.\n\nA Bloomberg analyst has projected a potential rise in ether’s value to $4,000, drawing parallels with bitcoin’s rally preceding the approval of spot ETFs. On the other hand, TD Cowen and JPMorgan express skepticism; TD Cowen questions the immediate approval of spot ether ETFs by the SEC, while JPMorgan assigns a probability of less than 50% for such approval by May.\n\nWhat’s Next For ETH Price?\n\nEther rebounded off the 20-day Exponential Moving Average (EMA), indicating that buyers are attempting to solidify this level as a foundation of support. Consequently, this boosted the buyers’ confidence, enabling them to surpass the immediate Fibonacci retracement levels and break past the $3,000 mark. Currently, the price of ETH stands at $2,948, marking an increase of over 1.1% from the previous day’s value.\n\nAlthough the price managed to breach the immediate barrier of $3,000, it couldn’t maintain its surge as sellers initiated a pullback. Nonetheless, buyers are keen on maintaining the upward momentum with hopes of driving the price towards the critical resistance level at $3,100. Achieving this could set the stage for a move towards $3,500.\n\nThe recent price rejection has plunged the Relative Strength Index (RSI) toward 58, hinting at the possibility of a minor correction or a consolidation phase looming. For a short-term peak to be indicated, sellers would have to send the price below the 20-day EMA."
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMiVkFVX3lxTE5ITUpEU3E4aWNjdmFRakhiVjRiQzkzYkYzRGFUU2MwT3dNSkJYQ1prY18xUkt3VHpRRlRkb3U0dWpzNkppMWJDN3FORzZuUThDUllZR2Jn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Feb 2024 08:00:00 GMT",
        "title": "What is Farcaster? The future of decentralized social networking on Ethereum - OKX",
        "content": "Farcaster is a decentralized social network that prioritizes user privacy, interoperability, and autonomy through blockchain technology. It offers a secure and censorship-free environment for digital communication and community building.\n\nRead on for an essential understanding of the technology's features, technical underpinnings, how developers can support Farcaster's development, and the project's future.\n\nTL;DR\n\nFarcaster is a decentralized social platform that uses Ethereum to provide users with profiles, messaging capabilities, and community development, emphasizing individual control and compatibility. It's therefore similar to popular centralized sites such as X and Reddit.\n\nThe project's focus is on challenges related to control of information, invasion of privacy, and concentration of power in conventional social media, applying the Optimism Layer 2 solution for improved protection and openness.\n\nFeatures like \"Frames\" and sign-up fees aim to boost engagement and reduce bots, underlining its innovation of the social media template.\n\nWarpcast improves Farcaster's mobile experience through an easy-to-use interface, NFT updates, and in-app currency available for both iOS and Android users.\n\nFarcaster uses blockchain technology and prioritizes privacy to redefine social media with user-controlled experiences.\n\nWhat is Farcaster?\n\nFarcaster is a decentralized social network that operates on Ethereum. It allows users to make profiles, share messages, connect with others, and establish communities, offering a similar user experience to popular social networks like X and Reddit. However, the main distinction is its decentralized design, which guarantees that individuals have control of their accounts and connections, allowing them to switch between applications effortlessly.\n\nFarcaster addresses some critical issues of traditional social media platforms, including censorship, privacy breaches, and centralization. The technology, specifically the underlying Optimism infrastructure, guarantees transparency, security, and decentralization. This setup minimizes data breaches and censorship risks by not relying on centralized servers.\n\nMeanwhile, Farcaster's focus on interoperability is refreshing, enabling the smooth exchange of information and assets across various platforms. This feature also allows for multiple social media decentralized apps (DApps) to be run on top of its protocol. What's more, smart contracts support social interactions within the network, adding a layer of programmability and customization to the social networking experience.\n\nFarcaster's commitment to decentralization is emphasized by its principle of \"sufficient decentralization,\" where two users can find and communicate with each other regardless of the rest of the network's preferences.\n\nPut simply, Farcaster unifies access to multiple decentralized social networks in a single space and allows users to interact across these platforms under a single decentralized ID. This approach places greater control in the hands of the user and reduces the influence of individual actors, namely those developing specific social networks.\n\nTo further incentivize adoption, Farcaster introduces innovative economic models and features like \"Frames,\" which are interactive mini-applications that enhance user engagement. Farcaster's charging of a $5 sign-up fee for new users also aims to reduce bot engagement and promote a more genuine and interactive user experience. The recent addition of Frames has dramatically increased its users, highlighting the platform's rising popularity and ability to change how people interact on social media. As of February 22, 2024, Farcaster was attracting almost 28,000 new users every week.\n\nFarcaster's unique blend of blockchain technology, emphasis on user privacy and security, and innovative use of smart contracts and economic models sets it apart from other social networks. Its decentralized nature fosters a more secure and user-autonomous environment and pioneers social media innovation, paving the way for a new era of social communication.\n\nHow does Warpcast enhance Farcaster's experience on mobile devices?\n\nWarpcast is a key feature of Farcaster and is a decentralized social network protocol that improves the mobile experience for iOS and Android users. Created by experienced pros Dan Romero and Varun Srinivasan, Warpcast combines elements of the X platform with blockchain technology's unique capabilities, merging traditional social media features with game-changing Web3 functionalities. The main goal of this fusion is to give users greater power in managing their data, all while creating a secure and inclusive space for community collaboration and progress.\n\nWarpcast empowers users with a censorship-free space where they have full authority over their data and audience, marking a significant milestone in developing social media networks.\n\nWarpcast, the mobile app, offers a user-friendly interface and stands out with its NFT feeds feature. This feature allows users to incorporate NFTs into their feeds for others to interact with or create. It also introduces Warp points, an in-app currency that unlocks various benefits and privileges, making the user experience more engaging and interactive on the platform.\n\nFarcaster's 'channels' feature provides an area for individuals to sort through posts based on various topics, similar to a combination of conventional social media feeds and forum-style conversations about specific subjects. This function enables more structured and targeted conversations, catering to the varied interests of its users.\n\nOverall, the registration process through Warpcast is straightforward, with a nominal annual fee ($5 for 5,000 posts, 2,500 reactions, and 2,500 followers) which, alongside reducing spam, supports maintenance and development of the network.\n\nWarpcast demonstrates the capabilities of Web3 technologies in our online connections and interactions, empowering users to have greater authority over their data and interactions within a secure and innovative setting.\n\nThe technology behind Farcaster\n\nFarcaster adopts the Ethereum blockchain to offer a smooth and practical user experience via a hybrid structure that incorporates both on-chain and off-chain components. This incorporation is crucial in maintaining user independence, confidentiality, and compatibility among social media platforms built on the Farcaster protocol.\n\nFarcaster uses Registry Contracts and Hubs as its technology. These are important for creating accounts, managing data, and authorizing messages. The contracts are deployed on Ethereum's Layer 2 solutions like Optimism. With these contracts, users can have unique usernames and safely handle their data.\n\nMeanwhile, Farcaster's design encourages user adaptability by incorporating decentralized identity systems such as Ethereum Name Service (ENS), which enables users to have multiple usernames. This makes user interaction easier and opens up opportunities for developers to engage with a wider range of users.\n\nFarcaster's design philosophy prioritizes a significant degree of decentralization, meaning that its social network enables unobstructed communication among users, even if there's resistance from the entire network. This level of decentralization is made possible by the option to secure personalized usernames, share messages under those usernames, and access messages from any legitimate user, creating an unrestricted and unfiltered communication platform.\n\nFarcaster uses a blend of smart contracts on the Ethereum platform, decentralized identity systems, and a network of Hubs to create a strong, effective, and user-focused platform. These technological decisions demonstrate Farcaster's dedication to protecting privacy, empowering users, and establishing an uncensored digital environment in line with the values of blockchain and decentralization.\n\nHow can developers contribute to Farcaster?\n\nIf you're a developer that wants to explore Farcaster, the first step is to consult the official documentation and visit the Farcaster protocol's GitHub repository. This documentation offers a detailed manual covering essential ideas such as accounts, messages, frames, channels, and the system's structure, including contracts, hubs, and ENS names. It also offers tutorials for creating frames, signing in with Farcaster, and writing your first app, alongside API documentation and specifications for both on-chain and off-chain systems.\n\nThe GitHub repository hosts the technical specification for implementing Farcaster, offering insights into the protocol's foundation. It's a valuable resource for developers looking to understand the protocol's inner workings or contribute to its development. With issues and pull request sections, developers can directly engage with ongoing projects, propose enhancements, or address bugs.\n\nFarcaster's decentralized network structure reduces the power centralized entities hold over user data, increasing online privacy and liberty. Developers can create applications by accessing public data to enhance software capabilities and user satisfaction. To advance Farcaster, developers can create programs and play a role in shaping the protocol's growth. They can also engage in governance, submit Farcaster Improvement Proposals (FIPs), and help to create the necessary documentation. This cooperative method guarantees the protocol's flexibility, safety, and commitment to meeting the community's needs.\n\nOverall, Farcaster offers a comprehensive platform that allows developers to dive into decentralized social networking, contribute to an open-source project, and create cutting-edge apps. Developers greatly influence the evolution of social media by using Farcaster's SDK, API documentation, and active involvement in the GitHub community.\n\nUser experience and features\n\nHere's a breakdown focused on user experience and features:\n\nUser interface : The platform prioritizes simplicity and user-friendliness, with a clean and intuitive interface. It caters to both new and experienced users.\n\nEngagement and interaction : Farcaster promotes active involvement from its users by allowing them to make posts, share comments, and send direct messages. Its decentralized structure allows for interactions across various servers, broadening the community.\n\nContent control and moderation : Users have control over content and moderation with decentralized tools, empowering communities to create their own policies in line with the platform's ethos of user empowerment.\n\nInnovative features : Farcaster uses blockchain technology for unique features, such as token-based access and content monetization for creators.\n\nCross-platform integration: Farcaster provides tools and APIs for integrating with other DApps, improving the user experience by connecting to a larger ecosystem through interoperability.\n\nKeep checking Farcaster's documentation page for their latest updates and improvements.\n\nPrivacy and security on Farcaster\n\nFarcaster uses blockchain technology to prioritize interoperability, user autonomy, and unique features like Farcaster Frames in its decentralized structure to address privacy and security concerns. The following key aspects illustrate how Farcaster guarantees user confidentiality and safety:\n\nDecentralization and blockchain basis : The Optimism blockchain is used by Farcaster to uphold transparency, security, and decentralization, reducing the chances of data breaches and censorship due to the absence of central servers.\n\nUser control and security : Farcaster grants users full ownership of their data by prioritizing user autonomy. Combining blockchain decentralization with a user-friendly interface establishes a groundbreaking benchmark for social media networks.\n\nFlexibility and global state : Farcaster provides a flexible namespace system, including decentralized identities like ENS, enabling users to have multiple usernames. It uses a network of servers called 'Hubs' for data consistency and reliability.\n\nHybrid architecture : Farcaster uses decentralized and centralized systems to allow seamless user communication and widespread access to public data. It employs registry contracts to manage accounts and hubs for efficient data sharing.\n\nPrivacy and security focus: Prioritizing privacy and security, Farcaster offers encrypted communication and makes sure users have complete control over their data.\n\nWhat's next for Farcaster?\n\nFarcaster's progress has been remarkable, experiencing a substantial rise in daily active users (DAU) since the introduction of the Frames feature. This feature improves user engagement by incorporating interactive applications directly into posts. This increase in growth shows a powerful surge of momentum in the world of cryptocurrency, indicating a promising future for the network.\n\nFarcaster's technical design combines on-chain and off-chain components to provide a seamless and effective platform for creating social apps. This hybrid approach uses registry contracts for managing accounts, storage rentals for enhanced network efficiency, and hubs for dependable data sharing and storage.\n\nThis method guarantees the accuracy of data, that user needs are accommodated, and provides a sturdy network — all of which contribute to seamless development practices and rewarding user interactions.\n\nFarcaster hasn't released an authorized token, but there are indications that a token airdrop may happen for those involved in the beta testing period. This approach could increase community involvement and recognize those who quickly adopted the platform.\n\nThe final word\n\nFarcaster is a social network built on the Ethereum platform that values privacy, compatibility, and user control. It provides standard platform functionalities while also applying Optimism to achieve decentralization. By following this approach, users can enjoy increased privacy, minimized chances of censorship, and increased control over their accounts.\n\nFarcaster introduces smart contracts for social engagements and personalized experiences through \"Frames\", and requires a sign-up fee to prevent bots.\n\nIt promotes the concept of \"sufficient decentralization,\" empowering users to communicate and manage their online identities freely. By focusing on user empowerment and innovative economic models, Farcaster sets a new standard for social networking. Could Farcaster's decentralized model influence future social media platforms?"
    },
    {
        "id": 72,
        "url": "https://news.google.com/rss/articles/CBMi3wFBVV95cUxOVHpvOGNmWHZob1hoU0E2RzVMNjJKaWlpNkE3UGh1UTd4SkdLSmtmMzFBY2d1WVVLdmlkQ1FRanA2OElMS2ppUV9mVjU1bnQ2dDJmTUhGQWFOSm9VeWJEaUY4SVprc01heVJyMDlYek1JbW13VlB6R05JRno4WEtnU1dsb0lTaXUzZGR0by1vRlRTM2c4ekRvRF80N1BJd1pSZ0ZnSzEzX1B3TlF3TllYWW5oWFJOS1RzU2g3aklNR3NUUWE4VVlzN21nN1pMUnNNd0ZTTE5OS0dBeDVyQVBB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 22 Feb 2024 08:00:00 GMT",
        "title": "This cryptocurrency has more Google searches today than Ethereum (ETH) and Solana (SOL) - NO, its not Shiba Inu (SHIB) - Techpoint Africa",
        "content": "In the fast-paced world of cryptocurrency, trends can change in an instant. Today, a new player has emerged on the scene, capturing the attention of investors and enthusiasts alike. Retik Finance (RETIK), a cryptocurrency with ambitious goals and innovative features, has surged to the forefront of the market, surpassing even the likes of Ethereum (ETH) and Solana (SOL) in Google searches. At first glance, Retik Finance may seem like just another token in the crowded crypto space. However, a deeper dive reveals a project with immense potential and a dedicated community rallying behind it. So, what sets Retik Finance apart from the competition, and why is it attracting so much attention?\n\nThe Rise of Retik Finance (RETIK)\n\nRetik Finance (RETIK) burst onto the scene with a clear vision: to revolutionise the world of decentralised finance (DeFi) and redefine global transactions. From its inception, the project has been driven by a team of passionate developers and visionaries, determined to create innovative solutions that address the shortcomings of traditional financial systems. One of Retik Finance's key selling points is its commitment to accessibility and inclusivity. While other projects may cater primarily to institutional investors or high-net-worth individuals, Retik Finance aims to empower every individual to participate in the DeFi revolution. By offering user-friendly interfaces and cutting-edge features, Retik Finance has succeeded in attracting a diverse audience from across the globe.\n\nThe Power of Google Searches\n\nIn today's digital age, Google searches serve as a barometer of public interest and sentiment. When a cryptocurrency sees a surge in Google searches, it often signals increased awareness and potential investment activity. In the case of Retik Finance, the soaring number of Google searches is a testament to its growing popularity and relevance in the crypto community. Investors and enthusiasts are turning to Google to learn more about Retik Finance, eager to understand its technology, ecosystem, and potential for growth. As interest continues to spike, Retik Finance is quickly becoming one of the most talked-about cryptocurrencies in the market, outpacing even established giants like Ethereum and Solana.\n\nThe Unique Value Proposition of Retik Finance (RETIK)\n\nWhat sets Retik Finance (RETIK) apart from its competitors? At its core, Retik Finance offers a comprehensive suite of DeFi solutions designed to streamline global transactions and empower users. From futuristic DeFi debit cards to AI-powered peer-to-peer lending, Retik Finance is paving the way for a new era of financial innovation. One of the project's standout features is its multi-chain non-custodial highly secured DeFi wallet, which provides users with unprecedented security and control over their assets. Additionally, Retik Finance's smart crypto payment gateway facilitates seamless transactions across multiple cryptocurrencies, making it easier than ever for users to navigate the complex world of digital assets.\n\nThe Road Ahead for Retik Finance (RETIK)\n\nAs Retik Finance (RETIK) continues to gain momentum, the future looks bright for this emerging cryptocurrency. With a passionate community of supporters and a clear roadmap for growth, Retik Finance is poised to make waves in the world of DeFi and beyond. Investors and enthusiasts who have been captivated by the rise of Retik Finance are eagerly anticipating what the future holds. With each passing day, the project's presence on Google searches serves as a reminder of its growing influence and potential to disrupt the status quo. In conclusion, Retik Finance's ascent to the top of Google searches is a testament to its rising prominence in the cryptocurrency market. With innovative features, a dedicated team, and a clear vision for the future, Retik Finance is proving to be a force to be reckoned with. As interest continues to soar, all eyes are on Retik Finance as it charts a course towards greater success in the months and years to come.\n\nClick Here To Take Part In Retik Finance Presale\n\nVisit the links below for more information about Retik Finance (RETIK):\n\nWebsite: https://retik.com\n\nWhitepaper: https://retik.com/retik-whitepaper.pdf\n\nLinktree: https://linktr.ee/retikfinance"
    },
    {
        "id": 78,
        "url": "https://news.google.com/rss/articles/CBMi0gFBVV95cUxPUF9mdV9jZ2VuX21xRXM4cktUZXA0YXhmYzJNTTNGcTVNeGNaNl9zYzhrMk52R1k5Y0Zrdkc2b3F4ZXJXMVVsVUZabTJOWUZxNkhTcG9OS3gyNmpEQk5hdUMzM3NKNGVoWlRpdjI5OHpZekE4MjZjWWFudUxlWmJ1OUVuMGlyYXBDSHdFd1Rma0pYLWpzdnVSLVVVTFJZTlplMkhWVG5TakM5clJSUmVJdm5DUGlRNGdaNTIxYXFWdXNJRjRfU1Zsb1IxVVBEQm5PSWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Feb 2024 08:00:00 GMT",
        "title": "Q1 2024 Crypto Price Predictions: Near Protocol, Meme Moguls, Ethereum - What’s in Store for These Tokens? - Techpoint Africa",
        "content": "The first quarter of 2024 will be a wild ride for many altcoins, such as Near Protocol (NEAR) and Ethereum (ETH). Today, we look at some price predictions for these hot tokens. Meanwhile, Meme Moguls (MGLS) - a Stage 5 presale star, has been making waves in the meme coin space. Many analysts even have it pegged as the next 100x meme coin in 2024. Let’s see why.\n\nNear Protocol (NEAR): Price Soars Around 22%\n\nRecently, Near Protocol (NEAR) has been showing bullish signs. For instance, the Near Protocol price increased from $2.90 to $3.53 in the past 30 days. Its market cap also grew from $2.91B to $3.67B in that time. Not only that, Near Protocol experienced 17/30 green trading days.\n\nFrom a technical analysis standpoint, this number will increase as Near Protocol trades above its 50 and 100-day EMAs. Furthermore, this altcoin has 24 technical indicators in the green. Because of this, experts in the crypto field have made a bullish Near Protocol price prediction. They forecast a surge to $4.95 within Q1 of 2024 for NEAR.\n\nMeme Moguls (MGLS): To Rule the Meme Coin Market\n\nThe Meme Moguls (MGLS) presale is garnering a significant amount of attention and investment. This project has already raised nearly $2.5M in its presale performance, aiming to make waves in the booming meme coin sector. With real utility and an experienced team behind it, there is no reason why MGLS cannot become a blue-chip token.\n\nWhat sets Meme Moguls apart is its commitment to blending meme coin dynamics with tangible utility. Unlike most meme coins, MGLS serves a dual purpose as a governance token and the in-game currency for the upcoming Meme Moguls play-to-earn (P2E) game.\n\nIn the P2E game, players will participate in virtual stock trading experiences, gaining insights into wealth-building and investments. They may even try to “Beat the Market” - a game mode where you can compete against indexes like the S&P 500.\n\nThe Meme Moguls ecosystem is built on the MGLS token. Currently priced at $0.0036 during Stage 5 of its presale, early adopters are already up by 90%. And since it’s set to be listed on Uniswap in Q1 2024, experts are predicting a 100x pump. At this moment, there’s also a 30% deposit bonus, which adds to the overall appeal of this game-changing meme coin.\n\nMichaël Van De Poppe Announces a Bullish Ethereum Price Prediction\n\nMeanwhile, Ethereum (ETH) has also been making headlines. For instance, crypto analyst Michaël Van De Poppe remains bullish for this altcoin. In other words, Poppe made a new tweet stating that a price increase would come after the Dencun upgrade or from a short-term peak of BTC. He claims that Ethereum will also reclaim 0.06.\n\nIn terms of the Ethereum price movement, it has jumped from $2,488 to $2,901 in the past week alone. Its market cap also grew from $299B to $348B during that time. Additionally, Ethereum is now trading above its 100 and 200-day EMAs. As a result, experts predict that this altcoin will hit $3,629 within Q1 of 2024.\n\nCan Meme Moguls Outpace Near Protocol and Ethereum?\n\nMeme Moguls hold a solid chance of outpacing giants like Near Protocol and Ethereum. With a modest market cap of $10.8M, Meme Moguls can reach heights faster by requiring fewer new funds. Thus, MGLS is one of the best meme coins to invest in if you wish to see fast returns.\n\nVisit Meme Moguls"
    },
    {
        "id": 79,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxNUE82dkZtY3FLMi1TcFNDM0RyQnNNMk9NNFp1YThQdFEzN09oOUYtV2JrbFZ3UDh1ZXlQZVN1RXpPV2x3Y201Y2x4SlpNZ1Npa2xJZFBGYVdXV29NeTRaM0M4b3hraTAyMl9BZnJJbnFWZ3FMMEtxbUc5WkVTZzV4etIBhgFBVV95cUxNSnVLNUw4bmhtUDBPSXRJOFRQSWM0dTJEUndaNjhyZXhsMFBjZ0QyS3BGcGwyTGlhOWQxWGtyRktpRkRWaGU1OF9NakRnMWR1V3VMT0kyU19Sdy1PSVNQYjFIUjdITGg1eFZ2S3VJVUNnSGl0R05ISUVEd0lmWHl3YWJOYmVZUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Feb 2024 08:00:00 GMT",
        "title": "Arthur Hayes Says Cardano Is A ‘Shitcoin’ – Here’s Why - CryptoPotato",
        "content": "Cardano (ADA) is a “shitcoin” without purpose that has no distinct advantage over competitors, according to BitMEX co-founder Arthur Hayes.\n\n“Who gives a fuck? Zero?” said Hayes when asked “What about Cardano?” in an interview with Coin Bureau published on Sunday.\n\nCardano Is A Shitcoin, Says Hayes\n\nContinuing to describe the cryptocurrency – a top ten digital asset by market cap – Hayes did not mince words: “The first wannabe Ethereum, and probably the first one to go to be irrelevant,” he said.\n\nTypically, the popular crypto essayist and trader is well known as one of the loudest long-term Bitcoin (BTC) and Ethereum (ETH) bulls, and often expresses interest in small-cap cryptos for short-term trading.\n\nDuring the same interview, Hayes even expressed interest in the memecoin “dogwifhat” calling it the “best dog money of this bull cycle.\n\n“I love Rare Pepe’s… I think we’re going to see a resurgence of NFT trading volumes,” he added.\n\nThe writer’s unique callout of Cardano ruffled some feathers online – especially with the network’s founder, Charles Hoskinson. On Tuesday, Hoskinson asked Hayes why he was “throwing shade” at Cardano.\n\n“Cause your coin is a piece of shit man,” Hayes replied. “Just buy some ETH and chill.”\n\nWhat Makes Cardano Unique?\n\nMuch like Ethereum, Cardano is a smart contract platform for developing decentralized applications. It also popularized as one of the first well-developed proof-of-stake cryptocurrencies, which use crypto rather than energy to secure its network.\n\nHowever, many popular blockchains today now use the same mechanism, with Ethereum undergoing a massive upgrade in 2022 to adopt proof of stake. In terms of both market size and DeFi TVL, Cardano is still outsized by competitors like Ethereum, Solana, and Binance Smart Chain (BSC).\n\nOn Tuesday, Hayes published a list of the world’s most popular Dapps, and asked which of them had originated or grown most popular on the Cardano blockchain.\n\n“From my very limited knowledge, it looks like none of them do,” he said. “That’s why ADA is dog shit.”\n\nOn Bitcoin, however, Hayes remains a bull, expecting strong money printing from the Federal Reserve to drive the asset’s price up soon.\n\n“When printing money happens and you debase the value of time and human labor, we rejoice and say great, fuck you, we’re gonna take Bitcoin to a million,” he told Coin Bureau.\n\nLate last year, Hayes predicted that Bitcoin would reach between $750,000 and $1 million by the end of 2026."
    },
    {
        "id": 84,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPa3cxbmdaWVZkMlh4VG9LSmxRbWlmWVl6LWg0SFBFS3BqdjI1djNNdkdDYXZxekFvOFJwQVRpczhjQktnekZfRXU4cnY4VXE4OUQ3OTJzM1pxbExidV9aMURIdDlRUm1FcDJwYVZURENxRFpRSkVHeFVGZ1VzMGlHMWJKaFhwWEHSAYwBQVVfeXFMTW9xQkUwVUtkbFQtTHNscVJiRXYtQm4yc0xBaXc3WUUwdmFYcVBHVC1oZFVEMkt0d2VGbDMyUFd0OS04X2ZydXk5cTRoMjV2Z0Q4eEVEVmluRFYtTEhTOFhYSm1sbnczVFBHTTA5d1VfT21MSUhjOFdQSWVQRTBpbFpVWnViRFVXb1F6eXk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Price Tops $3,000, But ‘Is Completely Detached From Reality’: Expert - NewsBTC",
        "content": "The Ethereum (ETH) price has crossed the $3,000 threshold for the first time since April 2022 yesterday. However, amidst the celebratory fireworks in the crypto community, Fred Krueger, a renowned Bitcoin ETF expert, has voiced a starkly contrasting opinion. Krueger, a Wall Street veteran and prop trader, took to X (formerly Twitter) to express his skepticism about the current valuation of ETH, stating, “ETH is completely detached from reality.”\n\nWhy Ethereum Is “Completely Detached From Reality”\n\nKrueger’s comments come at a time when the crypto market is witnessing a resurgence in investor interest, with Ethereum at the forefront due to its recent price rally. Despite this, Krueger points out a concerning trend in the usage of the Ethereum blockchain.\n\nETH is completely detached from reality. A deep dive.\n\n——————————————————— ETH is at $3,000. Surely this must mean that a ton of people are using ETH, and that this number is only going up, right? Nope. Eth, the chain has dropped from 120K… pic.twitter.com/141GwtB0yz — Fred Krueger (@dotkrueger) February 21, 2024\n\n“ETH is at $3,000. Surely this must mean that a ton of people are using ETH, right? Nope. Eth, the chain has dropped from 120K active daily users in 2021, to just 66K over the last year. The top app, Uniswap V3 is only getting 16K DAUs. I remember, back in 2020 this number was 60K or more,” he noted, emphasizing a decline in the platform’s direct utility and engagement.\n\nRelated Reading\n\nEthereum Receives Nod Of Approval From Berstein: ETH Price Will Reach $10,000 7 months ago\n\nThe Bitcoin ETF expert further criticized the valuation of Ethereum, drawing parallels to meme coins like Shiba Inu due to its inflated market cap, which stands at $361 billion despite the fall in active users. “It really has become a type of meme coin, similar to Shiba Inu,” Krueger remarked, pointing to the stark contrast between Ethereum’s high market cap and its diminishing direct use.\n\nKrueger argues that Ethereum is not only overvalued but also faces stiff competition from other blockchains that outperform it in terms of transaction costs and speed. “It’s not particularly cheap ($1.50 per transaction), or fast. If you are just interested in reward points for games, or casino-style DeFi apps — Solana, Avalanche, Near etc.. all crush it.”\n\nKrueger also expressed skepticism about the future regulatory landscape for Ethereum, particularly concerning the potential for an ETH exchange-traded fund (ETF). “Finally, I don’t think Gensler is going to allow an ETH ETF… I just don’t think Gary wants to make his second ETF a massive pre-mine. Sets a very bad precedent,” he stated, reflecting on the challenges Ethereum faces in gaining mainstream financial acceptance.\n\nThe Crypto Community Reacts\n\nIn response to Krueger’s critical take, the crypto community on X provided mixed reactions. One user challenged Krueger’s analysis by pointing to Ethereum’s rollup-centric roadmap and the misleading nature of using mainnet daily active users (DAU) as a metric for the platform’s health. Krueger, however, remained unconvinced, stating, “Even L2s like Arbitrum have been in decline for the last 12 months. This is not the case that all is well in ETH-land.”\n\nRelated Reading\n\nAnother user attempted to highlight the cyclical nature of DeFi and the broader crypto market, suggesting that the current downturn is a temporary phase of risk aversion. Yet, Krueger dismissed these arguments, reiterating his lack of interest in speculative DeFi activities and emphasizing his belief in Bitcoin as the true revolutionary cryptocurrency. “I am not interested in degen ape games. Have fun,” he stated.\n\nKrueger’s critique extends beyond Ethereum to the broader landscape of cryptocurrencies, questioning the long-term viability and value proposition of altcoins, including Layer 1 solutions other than Bitcoin. He argues that these platforms are unlikely to become significant value generators in the long term, likening their control mechanisms to fiat currencies but with central figures like Vitalik Buterin in place of traditional central bankers.\n\nKrueger’s overall stance on Ethereum and the broader crypto market is clear. “My position on ETH. At the end of the day, Bitcoin is the revolution… Every other cryptocurrency is fighting for some other much smaller use case,” he explained, underscoring his belief in Bitcoin’s unique value proposition as a decentralized, finite currency system.\n\nAt press time, the ETH price surpassed the 0.5 Fibonacci retracement level (at $2,922), trading at $2,935. A weekly close above this threshold could confirm another leg up for the ETH price.\n\nFeatured image created with DALL·E, chart from TradingView.com"
    },
    {
        "id": 86,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxPeFdMREg0Qk4wRzRRdHlNRURGYnNqRWlTYXByX3VXNm5GRHYxbnA1RU82V2w5Sl9NbGQzSGU3NDZYZnYwdWdCcXU5ZjJ6ME9GdTdKQjNQOTR5LXhWOFNIeE9raVBwcE1ZM2UzTzFzMmFHc0RpeW1DU2RabHJ4dENzZEs5RjlJTDZSaVJGdW5IcGl0NVZ2MWVJLUpjaGlpOGPSAaQBQVVfeXFMUFdVb0paWDBqTVRBTzVHYXNMWElVVXFjcHRMbHVkaTdrZHlsSEhEUDRsMy1QU053MkxEbTNkOW9VNEFVZDBEcHBuSmRCcjhCLWdhc1JxU0ZXdUg5MlNBdFVEbXVPU0hVcktnckgxODl2RDhVaGZWOGpWbmJWLWJRRUpwVWhhRDQ4OTQ1UW93b0tuZWNic0VBbzBUejhmbTlyVExNZWs?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Feb 2024 22:02:28 GMT",
        "title": "Is Ethereum Overvalued, Similar ‘To Meme Coins Like Shiba Inu’? - NewsBTC",
        "content": "A crypto investor, Fred Krueger, thinks Ethereum is overvalued at spot rates. Referring to X, Krueger added that Ethereum supporters are “detached from reality” after ETH, the native currency, recently broke above $3,000.\n\nThe investor pointed to the general declining on-chain activity, fierce competition from alternatives like Solana and Avalanche, for instance, and regulatory uncertainty that makes holding the coin risky.\n\nEthereum Is Slow And Usage Is Shrinking\n\nKrueger argues that Ethereum’s on-chain transactions could be faster and cheaper. In the current landscape marked with scalable and low-fee alternatives, either built on Ethereum or existing as independent chains, the chain’s challenges no longer justify ETH trading at spot rates of about $3,000.\n\nRelated Reading\n\nAVAX Slips, Adding Tension To $365 Million Avalanche Token Unlock Drama 7 months ago\n\nBeyond scaling and throughput challenges, the investor also refers to the sharp decline in daily active users (DAUs) on the mainnet. Since 2021, Ethereum and altcoin prices have peaked, and active DAUs have fallen from around 120,000 to approximately 66,000 in February 2024.\n\nThough network supporters said there had been developments like layer-2 platforms like Arbitrum pinning their security on Ethereum, Krueger notes that even the most active and largest protocols by total value locked (TVL) have seen user losses.\n\nTo illustrate, Uniswap V3, the third version of one of Ethereum’s largest decentralized exchanges, Uniswap, now records around 16,000 daily active users, significantly lower than previous years.\n\nAlternatives Like Solana Offer Better: Is ETH Expensive?\n\nThe investor argues that the decline in DAUs, pointing to active usage, sharply contrasts with Ethereum’s rising market capitalization and spot rates. In Krueger’s opinion, this emerging state of affairs is why Ethereum has become a bloated “meme coin like Shiba Inu,” looking at its high market cap.\n\nIt in the investor’s assessment that faster and cheaper alternatives like Solana, Avalanche, and Near Protocol offer better value for specific use cases like decentralized finance (DeFi) and games.\n\nRelated Reading\n\nKrueger also took issue with the lack of regulatory clarity on Ethereum. The United States Securities and Exchange Commission (SEC) recently approved the first spot Bitcoin exchange-traded funds (ETF) batch. Primarily, this is because SEC officials recognize Bitcoin as a commodity.\n\nGary Gensler and the SEC have failed to classify ETH in the same category as BTC. Accordingly, though the broader crypto community is optimistic about the eventual authorization of a spot Ethereum ETF, Krueger thinks it is unlikely.\n\nStill, time will only tell how Ethereum and its market valuation will evolve in the coming months. Supporters are optimistic, despite criticism, that rising adoption and ETH’s deflationary nature will lift prices towards 2021 highs of $5,000.\n\nFeature image from DALLE, chart from TradingView"
    },
    {
        "id": 87,
        "url": "https://news.google.com/rss/articles/CBMiX0FVX3lxTFBnc2RURWoyVjRTbi05elp5ZFBQdllTTk02X0sySWxvWFdldnBNc3RPaUJWejNDMHBSU3NSZ1R5Ujg2d05pSFB2c0ktVnFKWld2d1NkcU9KTFVMOUdIbUlv0gFjQVVfeXFMTTRHMUhPQ3lIZUNFVnozVTBQd0RVcENHM003aHloTUhidnVSWnNYUW5ZWVI4MXBwWDhzdUQwTVhiWXFEaDhtNW4xcXJtVWRsRUJqcUdFNHFJWDNlV2Jtc1JTZGV3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Feb 2024 08:00:00 GMT",
        "title": "The Merge NFT: Ethereum Collection That Raised $90,000,000+ - CoinCodex",
        "content": "The Merge NFT is a unique dynamic NFT collection that was created by a digital artist called Murat Pak and featured on the leading NFT marketplace Nifty Gateway in December 2021.\n\nThe collection that commemorates Ethereum’s transition from Proof-of-Work to Proof-of-Stake consensus mechanism netted over $91.8 million during its brief 48-hour sale. This makes The Merge not only the most expensive NFT collection ever sold, but also the most expensive art piece sold by a living artist on a public sale.\n\nThe artwork that accompanied The Merge NFT drop on Nifty Gateway. Image source: niftygateway.com\n\nWhat is The Merge NFT and how does it work?\n\nThe Merge is a unique and dynamic Ethereum-based non-fungible token (NFT) collection that made headlines and broke sales records in December 2021. After the sale was concluded, Nifty Gateway minted all 312,686 purchased tokens, also referred to as units of “mass”.\n\nWe're kicking off minting of mass tonight, anyone who purchased mass should see their NFT within the next few hours. We will also be putting a hold on moving mass out of your accounts momentarily to make the secondary market fair for everyone ⚫️ @muratpak pic.twitter.com/bkdXu4uFFU — Nifty Gateway ? (@niftygateway) December 7, 2021\n\nThe artworks of The Merge NFTs are very basic as each token is represented by a simple white or yellow circle on a black background. The visuals are generated fully on-chain based on the formulas included in the smart contracts and not hosted off-chain as is the case with many other NFT collections.\n\nWhat sets The Merge apart from all other NFT collections is the concept behind the collection, which utilizes a unique mechanism that causes the collection to change and develop over time. The collection’s smart contract prevents one address from holding multiple NFTs from the Merge collections – as soon as two NFTs from the collection are held in the same wallet, the masses of the two tokens merge. The result is one newly minted NFT with the combined mass of both pre-existing NFTs, which is depicted by a bigger circle on a black background.\n\nThe Merge NFTs in circulation diminishes as they are transferred between wallets (more precisely, bought by someone who already holds an NFT from the collection in the wallet), and their average mass increases. The total mass, however, remains constant.\n\nAn illustrative artwork depicting the merging of two mass tokens on the left and an equation explaining how the merging principle works on the right. Image source: niftygateway.com\n\nWhat is the Ethereum Merge?\n\nAs already mentioned, The Merge NFT collection commemorates the Ethereum Merge, which was a historical event in Ethereum’s history that concluded the network's transition from the proof-of-work (PoW) to a proof-of-stake (PoS) consensus mechanism.\n\nThe transition process started with the Ethereum 2.0 upgrade, also known as the Serenity upgrade, on December 1, 2021, when the proof-of-stake Beacon Chain (the chain that currently acts as the central coordination layer for the entire Ethereum 2.0 network) was activated. While ETH 2.0 staking deposits were enabled shortly after, the PoS and the PoW networks ran simultaneously up until September 15, 2022, when the transition concluded with The Merge event. Since then, the Ethereum network is secured solely by staking.\n\nThe move to proof-of-stake enabled Ethereum to address its scalability issues, which often caused extraordinary spikes in gas prices while the network still relied on PoW. In addition, the network had become more energy-efficient and environmentally sustainable as the energy consumption was reduced by more than 99% when the PoW chain was made obsolete.\n\nHow much money The Merge NFT sold for in December 2021?\n\nThe Merge NFTs were sold in an open edition style (the opposite of a limited edition sale) from December 2 to December 4, 2021. The starting price for the public sale of The Merge tokens was set at $575 per unit, with the price increasing by $25 every 6 hours, so the ones who bought the tokens in the last few hours of the sale had to cash out $750 per token. The number of tokens each participant could acquire was unlimited.\n\nThe Merge NFT sale saw participation from 29,983 unique address owners who bought a total of 312,686 tokens. The Merge NFT sale ended up netting an exceptional sum of $91.8 million. This crowns The Merge NFT as the most expensive artwork ever publicly sold by a living artist.\n\nNevertheless, this record is a bit controversial as it is only valid if we consider the whole collection as a single piece of art. While many claim that The Merge is actually a collection of artworks, it could one day, if all the NFTs are merged in one wallet, become one NFT and thereby one single unique art piece.\n\nHow much is The Merge NFT worth now?\n\nSince its initial sale, the price of The Merge NFTs has fallen significantly. At the time of writing, one unit of mass has a floor price of $125, which is about 0.0428 ETH. Using this floor price puts the total market capitalization of the NFTs in circulation at slightly below 803 ETH (worth around $2.3 million).\n\nStill, quite a few tokens get sold above the floor price, which means that the total value of the whole collection would likely be higher in the end. In addition, the price of an NFT from The Merge collection also depends on its mass. There are currently 8,210 unique addresses that are holding The Merge NFT, meaning that there are only that many distinctive NFTs in circulation and many of them have a mass larger than 1.\n\nTop 4 The Merge NFTs with the largest mass that are currently being sold on the Nifty Gateway NFT marketplace and their respectful ask prices. Image source: niftygateway.com\n\nThe Merge: Regenesis NFTs by ConsenSys\n\nPak's Merge collection is not the only NFT collection that pays tribute to the Ethereum merge. Ethereum development studio ConsenSys has released a collection called The Merge: Regenesis, which was also designed to celebrate Ethereum's transition to Proof-of-Stake.\n\nThe collection was available for minting over a period of 72 hours and features three types of artworks, each commemorating one aspect of Ethereum's move to PoS: scalability, security and sustainability.\n\nDue to the sheer amount of NFTs minted, this collection has a very low floor price of only about 0.0007 ETH ($2.05 at the time of writing).\n\nThe bottom line: The Merge is the most expensive NFT collection ever sold\n\nAlthough The Merge NFT collection is not as valuable as it used to be when it was initially dropped on the Nifty Gateway marketplace, the sale of this unique dynamic NFT collection still represents a record-breaking event in the history of digital art and art in general. The Merge NFT collection sold for $91.8 million, surpassed Jeff Koons’ sculpture titled “Rabbit,” which sold for $91.1 million by a hair's breadth and became arguably the most expensive artwork sold publicly by a living artist.\n\nIn addition, The Merge NFT reigns on top of the list of the most expensive NFT collections. Even so, The Merge tokens have not made it to the list of the most expensive single NFTs ever sold just yet. Interesting and unique NFTs from collections such as the Bored Ape Yacht Club, for example, have a tendency to soar much higher as far as the price of a single non-fungible token is concerned.\n\nWe will conclude this article with a hard snap back to reality as those of us without ETH holdings worth millions of dollars in our digital wallets would likely find an article on how to find and participate in free NFT drops much more useful."
    }
]