[
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiygFBVV95cUxNOFRNaFBlUHQtX09LRVlPaVZzVlFQMl9YU3Z0alZSYTlZeWFRdnc4YjdqY2hpRUxLUUdZTXh3a05IS1VsUS05Nk5QVTFYbEdhZUp5TkllYzlFb1BjVXZpajRrWE9LZTVrblNpbnJuVnVCZUdqUU5JbDVsWEVUblRpRzRfd0JMclQwaHpLMUpQZmhsWGkzRkFjOHJOOEhiZ2RRZ2JkUVdFUmN3amF1TEw2OXBLb0xMSWZINGstUzdjdTZ1N0VUUlNrUV9n?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "BlackRock Launches Its First Tokenized Fund, BUIDL, on the Ethereum Network - Business Wire",
        "content": "NEW YORK--(BUSINESS WIRE)--BlackRock today unveils its first tokenized fund issued on a public blockchain, the BlackRock USD Institutional Digital Liquidity Fund (“BUIDL” or the “Fund”). BUIDL will provide qualified investors with the opportunity to earn U.S. dollar yields by subscribing to the Fund through Securitize Markets, LLC.\n\n“ This is the latest progression of our digital assets strategy,” said Robert Mitchnick, BlackRock’s Head of Digital Assets. “ We are focused on developing solutions in the digital assets space that help solve real problems for our clients, and we are excited to work with Securitize.”\n\nTokenization remains a key focus of BlackRock’s digital asset strategy. Through the tokenization of the Fund, BUIDL will offer investors important benefits by enabling the issuance and trading of ownership on a blockchain, expanding investor access to on-chain offerings, providing instantaneous and transparent settlement, and allowing for transfers across platforms. BNY Mellon will enable interoperability for the Fund between digital and traditional markets.\n\n“ Tokenization of securities could fundamentally transform capital markets. Today’s news demonstrates that traditional financial products are being made more accessible through digitization. Securitize is proud to be BlackRock’s transfer agent, tokenization platform and placement agent of choice in digitizing and expanding access to its investment products,” said Securitize co-founder and CEO Carlos Domingo.\n\nBUIDL seeks to offer a stable value of $1 per token and pays daily accrued dividends directly to investors' wallets as new tokens each month. The Fund invests 100% of its total assets in cash, U.S. Treasury bills, and repurchase agreements, allowing investors to earn yield while holding the token on the blockchain. Investors can transfer their tokens 24/7/365 to other pre-approved investors. Fund participants will also have flexible custody options allowing them to choose how to hold their tokens.\n\nThe initial ecosystem participants in BUIDL include Anchorage Digital Bank NA, BitGo, Coinbase, and Fireblocks, among other market participants and infrastructure providers in the crypto industry.\n\nBlackRock Financial Management, Inc., will be the investment manager of the Fund and Bank of New York Mellon will serve as the custodian of the Fund’s assets and its administrator. Securitize will act as a transfer agent and tokenization platform, managing the tokenized shares and reporting on Fund subscriptions, redemptions, and distributions. Securitize Markets will act as placement agent, making the Fund available to eligible investors. PricewaterhouseCoopers LLP has been appointed as the Fund's auditor for the period ending December 31, 2024.\n\nThe Fund will issue shares pursuant to Rule 506(c) under the Securities Act of 1933 and Section3(c)(7) of the Investment Company Act. The Fund’s initial investment minimum is $5 million.\n\nBlackRock has also made a strategic investment in Securitize. As part of the investment, Joseph Chalom, BlackRock’s Global Head of Strategic Ecosystem Partnerships, has been appointed to Securitize’s Board of Directors.\n\nAbout BlackRock\n\nBlackRock’s purpose is to help more and more people experience financial well-being. As a fiduciary to investors and a leading financial technology provider, we help millions of people build savings that serve them throughout their lives by making investing easier and more affordable. For additional information on BlackRock, please visit www.blackrock.com/corporate\n\nAbout Securitize\n\nSecuritize, the leader in tokenizing real-world assets, is driving the compliant digitization of financial assets through next-generation blockchain technology. Securitize, or through its subsidiaries, is a registered broker-dealer (member Finra / SIPC) and operates a primary marketplace, an alternative trading system, as well as a top 10 transfer agent and has an exempt reporting adviser. Learn more at http://www.securitize.io.\n\nDisclosures\n\nInterests in BUIDL have not been registered with the Securities Exchange Commission under the Securities Act of 1933, as amended, and may not be offered or sold in the United States absent registration or an applicable exemption from registration requirements. Interests in BUIDL will not be listed on any exchange.\n\nPrivate market investments are speculative and considered risky, including potential loss of your investment, and may not be appropriate for every shareholder. Any discussion of liquidity is purely speculative. Past performance is not indicative of future results.\n\nSecurities are offered through Securitize Markets, LLC, (“Securitize Markets”) a registered broker-dealer and member FINRA/SIPC. Neither Securitize Markets, nor any of its affiliates provide any investment advice or make any investment recommendations to any persons, ever, and no communication through herein or in any other medium should be construed as such. Securities offered by Securitize Markets have not been registered under the Securities Act of 1933 and may not be offered or sold in the United States absent registration or an applicable exemption from registration requirements.\n\nBUIDL may not be able to maintain a stable value of $1.00 per token at all times. Investments in tokens using blockchain, such as an investment in BUIDL, involve a high degree of risk, including risks that are different from the risks of investing in traditional assets. These risks include, but are not limited to, risk of regulatory uncertainty, market adoption, market manipulation, market exiting, price volatility and security risk and may expose investors to loss of principal. Investments in private placements are also speculative and involve a high degree of risk. Investors must be able to afford the loss of their entire investment. Offers to sell, or the solicitations of offers to buy any security can only be made to qualified investors through official offering documents that contain important information about risks, fees and expenses associated with the applicable securities. Investors should conduct their own due diligence and are encouraged to consult with a financial advisor, attorney, accountant, tax advisors, and any other professional that can help them to understand and assess the risks associated with any investment opportunity. Past performance is not indicative of future results.\n\nBlackRock Financial Management, Inc. (the “Investment Manager”), a Delaware corporation that is an indirectly wholly-owned subsidiary of BlackRock, Inc., is the investment manager of the Fund and is responsible for its investment activities subject to the policies, control and supervision of the board of directors of the Fund. The Investment Manager is registered with the U.S. Securities and Exchange Commission as an investment adviser under the U.S. Investment Advisers Act of 1940, as amended.\n\nIn connection with its services as placement agent for BUIDL, the Investment Manager will pay to Securitize Markets cash compensation as follows: (i) an upfront flat fee and (ii) a quarterly fee with respect to each investor who is introduced to BUIDL by Securitize Markets generally equal to a percentage of the average daily net asset value of such investor’s interests in BUIDL for the applicable calendar quarter, with the amount of the upfront fee to be credited against the quarterly fee.\n\nThe compensation paid by the Investment Manager to Securitize Markets for acting as placement agent to BUIDL creates a conflict of interest for Securitize Markets. In particular, the amount of compensation received by Securitize Markets will depend on the number of investors that are introduced to BUIDL. As a result, Securitize Markets is incentivized to recommend that prospective investors invest in BUIDL. In addition, BlackRock’s investment in Securitize Markets creates a conflict of interest for the Investment Manager.\n\nSecuritize Markets or one or more of its affiliates may be a BlackRock client or investor."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxQMkdJd0YxeHlNdTg1OHMwTjhCZkxNTmM2OEtlYkxpaDE4dkdhRFpiM2VuUTNJQW9UbGxYaDZUdnVMRlZYOUVJeWkzNTM0SUZwaENKOWsxMjRtNHZXTTlYdVRBSXlxVmdGdF80OVFuSHBOQXJHWXhsWDNJaENRSVp3OWdNb0ZWSkhi?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "What Happened in Crypto Today: Are Ethereum ETFs in Trouble? Analysts Are Losing Faith - Yahoo Finance",
        "content": "What Happened in Crypto Today: Are Ethereum ETFs in Trouble? Analysts Are Losing Faith\n\nThis week in crypto felt like we all got roped into a real-life Squid Game. The high-stakes challenges just kept coming at the community from every angle.\n\nIt started off with Bitcoin hitting a fresh new all-time high of around $73,000 last Thursday. The community was euphoric, dreaming of life-changing riches as the OG coin blasted through resistance like it was nothing.\n\nSource: BTC price page\n\nBut then, brutal reality struck. BTC retraced all the way back down to $63,000 as an aggressive sell-off neutralized the epic rally in a heartbeat.\n\nAs the market was trying to process the price chaos, a major drama erupted on another front. Trezor - one of the most trusted names in the crypto security game - got its social media account compromised. Their X account was used to shill a fake \"TRZR\" token sale in what felt like a cruelly personalized variation of the Red Light/Green Light game.\n\nAnd just when we thought things couldn’t get worse, the SEC made a move (well, not really!). Those awaiting rulings on the proposed ETH ETF applications got slammed as the SEC elected to kick those all-important decisions down the road yet again with delays.\n\nIn the midst of this password-pocalypse, the crypto news cycle kept on spinning with more major players making power moves. So let’s round up the top crypto stories!\n\nHere's a TLDR of the top headlines:\n\nLet’s get into the details of each of these stories!\n\nWe Hope You Didn’t Fall for TRZR…\n\nYesterday, things went south in the world of wallets - and it all started with one of the most trusted names in the hardware wallet game.\n\nOn March 19th, none other than Trezor, the cryptocurrency hardware wallet firm that's sold over 2 million devices worldwide, fell victim to a major security breach. And trust us, it wasn't pretty.\n\nAccording to reports, Trezor's official account on the bird app was hacked in what's suspected to be a SIM-swap attack. And once the attackers had control, they wasted no time in pushing an elaborate crypto scam.\n\nThe compromised account started promoting a fake token presale for \"TRZR\" token on the Solana blockchain.\n\nHow much money did its followers lose? Did Trezor make any official announcement following the incident? Read the full story!\n\nAnother Big Move by BlackRock\n\nThe world's largest asset manager has just filed with the SEC to launch a tokenized asset fund. And we're not talking about some small-time operation here – this is a big move from one of the most influential players in the finance game.\n\nStory continues\n\nAccording to the filing, BlackRock's new fund will be called the \"BlackRock USD Institutional Digital Liquidity Fund,\" and it'll be registered in the British Virgin Islands.\n\nBut here is the problem - if you want to get in on the action, you better have some serious cash to throw around because the minimum investment is $100,000.\n\nOn the bright side, if approved, we will probably see trillions pouring into tokenization and RWAs soon! Read the full story!\n\n$100M Web3 Gaming Fund?\n\nAnother day, another blockchain gaming investment fund, right? 🥱\n\nThis time it's Immutable, Polygon Labs, and VC firm King River Capital teaming up to launch a $100 million \"Inevitable Games Fund.\" Sounds impressive on paper, but what's in it for the average crypto degen?\n\nThey've already secured backing from big names like Abu Dhabi's Alpha Wave Ventures and Mike Arrington's family office. Moreover, the fund has its hands in a few buzzy gaming projects like Pixelmon and Guild of Guardians.\n\nBut at the end of the day, it's just another VC money pit...unless there's something truly game-changing in store.\n\nMaybe this trio has cracked the code on delivering an actual fun and worthwhile Web3 gaming experience? One that doesn't feel like a cash grab or tech demo, but an innovative blend of gaming and crypto that hasn't been seen before? Read the full story!\n\nMatter Labs Makes Moves\n\nIt's time to talk about a power move in the world of layer-2 scaling solutions and institutional finance.\n\nMatter Labs has teamed up with the digital asset bigwigs over at Sygnum Bank to tokenize $50 million of their treasury reserves. That's right – Fifty. Million. Dollars.\n\nBut wait, there's more! This tokenization extravaganza isn't just some random crypto flexing. Nope, these funds are being tokenized onto the very blockchain that Matter Labs built – zkSync itself.\n\nNow, for those of you who aren't familiar with the world of traditional finance (or \"Trad-Fi,\" as we like to call it), these tokenized funds will represent Matter Labs' investment into the Fidelity Institutional Liquidity Fund. And we're not just talking about some fly-by-night operation here – this Fidelity fund is an open-ended money market behemoth.\n\nFeels like RWA and tokenization are in line to be the next big trend to follow. Read the full story!\n\nSEC and ETH ETFs\n\nThe SEC has decided to keep us all in suspense a little while longer by delaying its ruling on the proposed spot ETH ETFs from Hashdex and ARK 21Shares.\n\nAccording to the SEC's announcement on March 19th, the final decision on these ETH ETF applications has been pushed back to late May, leaving the crypto community on the edge of their seats for at least another couple of months.\n\nIt seems that the market analysts over at Bloomberg are starting to lose faith in the prospect of these ETFs getting the green light. Yep, you read that right – even the seasoned experts are starting to doubt the SEC's willingness to play ball.\n\nWeren’t Bloomberg analysts too optimistic about ETH ETF approval in May? What happened? What did they say? Read the full story!\n\nPopular Game Developer Goes Web3\n\nThe masterminds behind iconic franchises like Final Fantasy and Kingdom Hearts are diving headfirst into blockchain gaming. And they're not just dipping their toes in the water – Square Enix has formed a partnership with HyperPlay, a Web3 games platform built on blockchain.\n\nThis collaboration isn't just a handshake deal – Square Enix made an undisclosed investment in HyperPlay, with the goal of expanding and scaling the platform's game store offerings.\n\nAnd as if that wasn't enough, Square Enix is also set to launch \"SYMBIOGENESIS,\" an art experience based on the popular cryptocurrency wallet MetaMask, on the HyperPlay storefront. Read the full story!\n\nThat’s a wrap! See you tomorrow with more crypto stories."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxPNE1CcERCZS1lUTlCbUVlVjJRRUZ1YlNRSkpQRDJSeUJYRGNHQWJVM2ZtLS1TOXA5amhHRWtvMjBKcFJadkQ0b3F3YlZVRF8xY3pDQk1IdFh6bVBFRFV2Q1RReEpaZk1GVjFpSGlpZUY1SUlkcXVHRmNXdkZjMllZQ0NGWG84SFBvRWtKb0JiTm0yOUNKYTY1TGVNWHpfdE0weFhZWg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "SEC’s reported move to brand Ether a security called an ‘excuse to not approve’ ETF - DLNews",
        "content": "Fortune reported the SEC sent subpoenas to three companies as part of probe of Ethereum Foundation.\n\nCrypto lawyers say it could be pretex to deny Ether ETFs.\n\nNews roils crypto industry as long simmering categorisation of Ethereum heats up.\n\nThe US Securities and Exchange Commission is attempting to classify Ether, the world’s second-largest cryptocurrency, as a security, according to a media report published Wednesday.\n\nCiting unnamed sources who said they feared reprisal from the SEC, Fortune said at least three companies have received subpoenas seeking information related to the Ethereum Foundation, the Swiss-based nonprofit that contributes to the development and promotion of the Ethereum blockchain.\n\nBut attorneys who spoke to DL News said the SEC’s classification of Ether as a security would have little real-world impact unless it was backed up by US courts.\n\n“The only thing that would matter is if they get a final, binding judgement from a court of competent jurisdiction, and even then I believe they would have a very hard time enforcing that in any practical way, beyond just charging the Ethereum Foundation a fine,” crypto attorney Gabriel Shapiro told DL News.\n\n“But it could give them an excuse to not approve an ETH ETF, which is likely their biggest objective here.”\n\n‘Voluntary enquiry’\n\nThe news that the SEC is investigating the Ethereum Foundation was preceded by reports from CoinDesk and The Block that said the Foundation had received a “voluntary enquiry” from an unnamed “state authority.”\n\nSEC Chair Gary Gensler has repeatedly said he believes Bitcoin, the original cryptocurrency, is a commodity like gold or wheat.\n\nBut he has remained noncommittal when asked whether Ether should be classified as a commodity or as a security, which is subject to more stringent and costly oversight.\n\nJoin the community to get our latest stories and updates\n\nWednesday’s reports suggest he has made up his mind.\n\nThe SEC has requested documents and financial records that detail the companies’ dealings with the Ethereum Foundation, according to Fortune.\n\nEther was down 0.5% over the last 24 hours in late afternoon trading UK time on Wednesday, according to CoinGecko.\n\n“[The] SEC has been pretty transparent that it informally thinks ETH is a security,” said Matt McGuire, a former senior prosecutor for the attorney general of Virginia and general counsel at Violet, a crypto identity platform.\n\n“It’s not surprising to me to read that they’re issuing a lot of subpoenas gathering information, but doesn’t tell us exactly what they’ll do with that information.”\n\nLightning rod\n\nThe investigation began shortly after Ethereum’s transition to a Proof of Stake “consensus mechanism” to tend its blockchain network, according to one source cited by Fortune.\n\nCryptocurrencies issued by blockchains that rely on Proof of Stake, or PoS, technology to confirm and order transactions could be classified as securities, Gensler has previously said on several occasions.\n\nSince taking the helm of the SEC in 2021, Gensler has become a lightning rod for criticism in the industry after the commission sued players large and small for alleged violation of securities laws.\n\nMost notably, the SEC sued three of the world’s largest crypto exchanges: Binance, Coinbase, and Kraken.\n\nThe SEC accused them of selling unregistered securities such as Solana’s SOL, Polygon’s MATIC, Cardano’s ADA, and several other tokens.\n\nThe industry has treated the crackdown as something of an existential crisis, arguing that applying 90-year-old securities laws to cryptocurrencies would amount to a death sentence given their unique features and the cost of complying with government regulations.\n\nEther ETF in the balance\n\nThe news comes as traditional financial institutions seek the SEC’s approval of a spot Ether ETF in the wake of the release of Bitcoin ETFs in January.\n\nBut hopes for its approval have been dwindling: Bloomberg Intelligence analysts this month lowered their odds of a May approval to just 35%.\n\nThose odds fell from 25% to 14% Wednesday on crypto prediction market Polymarket.\n\nAleks Gilbert is DL News’ New York-based DeFi correspondent. You can contact him at aleks@dlnews.com."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxPVkJxT1lzV0FneHFmcnA4Ymp6eldYY2pCQXNLSjgtRExkSGo1d2Y4aG0ybzR1Z0J1RG4tNTZkS0pORzJCYjlXWXNqR29JbE1vVFBwOGN4QS01ZjdabHJBa3VXb2NBUnRUc2NmODUyUXBwTXdEaHlTeDd6NFEtNURkc1FvTUItSDI3ZUNhT9IBkgFBVV95cUxPcG1GbnhDd1ZlUzcwTkVXbHJPRlRyUEh2aXlydTY3Yy1YY09oMS1ZTEJpLTlMLUJ3YU9lZUtHWWNJUDRlZjZueTNPaFYwbzhueUw2dzREVHRoYzBGV21yTEVnajRGRVlmampIRUpPUmFjeXd4bFJ2YXdwLXNHZWFjVGp0TEt4TXV4eEZ6Y2hnQTlrdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "Solana Leapfrogs Ethereum on DEX Volume - CoinDesk",
        "content": "At press time, the top trending tokens for the past 24 hours on the DEX Screener were from Solana. Such has been the speculative frenzy that 2,300 meme coins came into existence in a single hour on March 13 and the supply of stablecoins on Solana hit a multiyear high of $2.80 billion."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxOOTdwdTZ4UnU0eWVIWFdHVUM5M25GOHg2c3BMUnNzYTQ5ZTBxRGpsQTVBUXJta3pFa3JmQzVvaDJMVzg5LXpLd0FDZWlPT1p6dXhjcnU2YXI5Y1hUcXdrWk13NkdQZlpocklReXhKSExqWUZQaUlLNF85VkFSTExoanA5dnduaFRrRXlKUFM4ZmtNY0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "Grayscale Looks to Add Staking in Proposed Spot Ethereum ETF - Unchained",
        "content": "Grayscale Investments plans to add staking to its proposed spot Ethereum ETF, following a similar move from Fidelity Investments earlier this week.\n\nGrayscale Investments says that having the ability to stake ether would allow the fund to mitigate inflationary pressures and preserve value for shareholders.\n\nGrayscale Investments has included a provision to stake ether in its application for a spot Ethereum exchange-traded fund (ETF).\n\nIn a preliminary proxy statement filed on Tuesday, Grayscale put forth four proposals in a consent solicitation statement for its proposed Grayscale Ethereum Trust (ETHE) — a close-ended ether fund that it intends to convert into an ETF if approved.\n\nOne of the four proposed items included the ability for the fund to stake ether through the trust in a Proof-of-Stake validation protocol.\n\n“We hope you share our view that these amendments both modernize and simplify ETHE Shares for the ultimate benefit of current and future ETHE shareholders,” wrote Grayscale CEO Michael Sonnenshein.\n\nThe provision follows a similar one filed by Fidelity Investments in its application for a spot ether ETF, which the firm amended on Monday.\n\nMeanwhile, the outlook for a spot ether ETF being approved has started to look less promising, with Bloomberg ETF analysts now predicting that the U.S. Securities and Exchange Commission (SEC) will likely reject all applications in the pipeline.\n\n“We haven’t seen signs of SEC engagement with the issuers on this topic and we would have expected to see more substantial signs of interactions between the SEC and these issuers by now if the SEC were planning to approve,” Bloomberg ETF analyst James Seyffart said in an email to Unchained.\n\nThe overwhelming demand for spot bitcoin ETFs following their approval aided bitcoin’s push towards a new all-time high, and it is fair to assume that the price of ether might follow a similar trajectory if spot ether ETFs were to be approved. However, the SEC’s stance on the status of ether as an asset is markedly different from its view on bitcoin.\n\nSEC Chairman Gary Gensler has stated on a number of occasions that bitcoin is the only digital asset that can be considered a commodity, and “everything other than bitcoin” could be classified as a security.\n\nIn April, Gensler avoided giving a direct response to a question from House Financial Services Committee Chair Patrick McHenry on whether Ethereum was a security or a commodity."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxQbmota29qYk52a1dUbzZkRmdib0RYN2xsUUN0Y0FPY1lBbVBISGhYemJzdWtJTXRYV0FvMkFVbHRIQnc2U0FPS2U3emNIUWlZbmh4UzV4MXlBdG1FMmlXeDE0bWpOdVdvU05GeWNoMEpQbTlmYTVFTmVHblBGLTc3U0lRVGh0TTJpNXc3YnozLUVqVExPUDhJeGxfZHprM25wV0drLWJ0b0sydDFGcjB5NlJWdU1uSWprd0tQT0lpZnhUcDQybHlFTS1OVXR1YmPSAdQBQVVfeXFMT2JRNUozalNuZHFZZlRGUElKbkItbXN0SjhaTjZIMXF4SmtaaDduTE1kNFc4WjFzdjlMbC0zUk1rd3p1Nnc2Z0pYUUk3QV9tYmxXTjVBVzh1dmhhQW5Dd2Q1dFZPcjFZVnN4Tjd6VThEdnQwT3ZDQm1TUjROWk5SZ3J2alB6WjUtR0FOS0ppTDNrdWE3Rk1fbG9KRldJVkRJSjgzbVJNakJCa3ZSZ3FFb21jZnJuQm5SOWo4Zm41RkN2ZWJNdm1vWGNPaDZSTGx0dXZtQzQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "Starknet, an Ethereum Layer 2, Plans 'Parallel Execution' to Mimic Solana's Speed Feature - CoinDesk",
        "content": "The feature will go live as part of an upgrade set for the second quarter, allowing Starknet to \"process a greater number of transactions simultaneously, resulting in improved throughput and faster L2 finality,\" according to a press release distributed by a representative of the developer StarkWare. It is part of the 2024 road map released Wednesday."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE55b1NxTktDREdTNzNvZzBkYzVEM3dNRmNqSTVuamNmdHdkRTluQUctdHhpTkZRdTNyVmxXMm9aUUdldjJ4SW91ekx1ejRtb1czMG5ETzRkbVBWQ1BzWF9DMGFTV3A5NGRIc0hrSTRFc0FaUi1VQi1lNnBBQ0ZMUdIBgwFBVV95cUxNUE1HVGlILTVuemF2X2R4aTZCZFQwTFUxN0hGU3RVNEc3cndEeWwxcHZyMGI4Q0ZKelVnWWI0Qi13eFltZ1REUWw4Tmp6VHFvMUljLW8yeHlfM1lZYWx2Y2cwY1hsODRuVmtGTFhKaTFrTlRoT2Y1TXJCS0tNQk1kZnBRbw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "ETH Whales Cashing out Massively Amid Ethereum Price Drop - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAmid a tumultuous week for the crypto market, ETH whales have made substantial moves, cashing out millions before Ethereum's price downturn. In the past four days of market downtime, three smart traders have offloaded a staggering 26,946 ETH, equivalent to a jaw-dropping $95.7 million. Their combined profits stand at an impressive $39 million, according to data from Spot On Chain.\n\nAdvertisement\n\nThe first trader, identified as \"0xb82,\" executed a strategic move, selling 7,300 ETH for $24.4 million in stablecoins via Binance, netting a handsome profit of 22.7%, which is equivalent to a remarkable $4.59 million. Not far behind, \"0xebf\" deposited 8,870 ETH, valued at $33.1 million, onto Binance on March 16, reaping an estimated total profit of $25.3 million, an impressive 55.8% gain.\n\nLastly, \"0xa43\" sold 10,776 ETH for $38.2 million on March 15, realizing a notable $9.14 million profit, equating to a 31.5% gain.\n\nAdvertisement\n\nETH to USD by CoinMarketCap\n\nThese moves come against the backdrop of Ethereum's price plummeting over 11% since the start of the week. After reaching a two-year high of $4,093 last week, Ethereum faced a significant sell-off, driving its price down to $3,200 per ETH.\n\nCoinGlass reports that within the past 24 hours, positions totaling $120 million were liquidated, with an estimated 85% of them being long positions, suggesting a wave of sell-offs and profit-taking among investors.\n\nThe mass cash-outs by ETH whales amid the price drop raise questions about the future trajectory of Ethereum and the broader cryptocurrency market. Whether the main altcoin finds a foothold will largely be both the cause and the consequence of how events develop further."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxOWm90Y0RGNzhmY29uMUxvTkR1Z19raUdvWWxiNllrTW53SFpMRmxUQXdUZjdNV0V1WkxKckdEQS0tUjdQM3pNY3BhYWgzUndOVlc1b2J5Mlp0bUpLY0gteWFnRTdpaXBrc1lzUmU0dzhLNHRRYkE2c0lkb1liNGJSb0hWUUlwZHp6T2NKVm9nUzBKZWgtUDJZeThxWngwNEpGaDFXQlEwUURMdHdqd3NtZnZzbEowQm03U3JrOTZR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "Enterprise Ethereum Alliance Announces New Leadership and Vision - Business Wire",
        "content": "NEW YORK--(BUSINESS WIRE)--The Enterprise Ethereum Alliance (EEA), the leading global community for enterprise blockchain, today announced the appointment of new leadership and a renewed vision for the future of the alliance at the intersection of the Ethereum ecosystem and enterprise. The announcement was made at the Momentum Event, an in-person gathering of EEA members, partners, and industry leaders, co-hosted by EEA, NYU, EY and Microsoft.\n\nThe Momentum Event kicked off with opening remarks by Yorke E Rhodes III, EEA Board Member for Microsoft, who introduced the event’s co-hosts and agenda. Rhodes expressed the goals for the convening, which showcased the latest developments and innovations in the Ethereum for enterprise blockchain space, as well as to foster collaboration and engagement among the EEA community.\n\nPaul Brody, EEA Board Member and EY Global Blockchain Leader, was announced as the new Chairperson, and Karen Scarbrough, EEA Alternate Board Member for Microsoft, as the new Executive Director. Vanessa Grellet is also joining as a new EEA Board Member.\n\nRhodes praised Paul, Karen and Vanessa for their expertise, vision, and dedication to the EEA and the enterprise blockchain industry.\n\n\"I am honored and excited to take on the role of Chairperson of the EEA, and to work with Karen and the rest of the board to lead the alliance into a new era of enterprise blockchain innovation,\" said Brody. \"The EEA has been a pioneer and a catalyst for the adoption and standardization of Ethereum-based solutions for enterprises, and I look forward to building on that legacy and expanding its reach and impact in the global market.\"\n\n\"As the new Executive Director of the EEA, I am thrilled to join forces with Paul and the EEA community to revitalize and energize the alliance and to deliver value and benefits to our members and partners,\" said Scarbrough. \"The EEA has a unique opportunity and responsibility to shape the future of enterprise blockchain, and to foster collaboration and interoperability among the diverse and dynamic ecosystem of Ethereum-based solutions. I invite everyone to join us and find a way to engage and contribute to the EEA and the enterprise blockchain movement.\"\n\n“I am excited to join the EEA Board to help bridge the gap between public blockchains and the enterprise world and drive adoption of blockchain applications in financial services and consumer use cases. The EVM ecosystem is open for business,” said Grellet. Vanessa will be sharing her perspective at the Digital Asset Summit and Pay 360 conference in London this week.\n\nBrody and Scarbrough also expressed excitement about the journey forward, given the recent surge of energy and interest in the enterprise blockchain space, driven by the second annual EEA Ethereum Business Readiness Report, the expected launch of several Ethereum-based exchange-traded funds (ETFs), and the growing demand for tokenization and decentralized finance (DeFi) solutions among enterprises.\n\nThe Momentum Event continued with a series of presentations, panels, and workshops, featuring EEA members, partners, and industry experts. They shared their insights, experiences, and best practices on various topics related to enterprise blockchain, such as scalability, privacy, security, governance, compliance, interoperability, use cases, and business models.\n\nAbout the EEA\n\nThe EEA is the industry's leading global community for enterprise blockchain working with an open, standards-based architecture and specification to accelerate the adoption of Enterprise Ethereum. The EEA's world-class team brings clarity to enterprises across an ecosystem of multiple vendors of choice and many innovative startups. For additional information about joining the EEA, please reach out to membership@entethalliance.org or visit https://entethalliance.org/become-a-member/\n\nFor more information about the EEA Momentum Event please visit: https://lu.ma/6ts0ta1l\n\nFor more information about the upcoming EEA Career Day please visit: https://lu.ma/rxnj8ye5"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPam81RGZqUWw3akd5RE5CNVBqT3dXdy1IaHBHUVA5ZW9zT2I4SDVXZ0VLSldmOGhHNGhQQXRVM1pTRmFVU2RWWkhxTDI1ci1kTzhYUklNZmF2MnpZS2FyMFBiMW5UQ3ZEM1daN0I3OTA1bGZwVWRhclJKb0lIUVdsZTRSU2xOV3RJcUZvdzl2QUZQN2hlQUtUbg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "Morph, an Ethereum layer-2 for app building, announces $19 million seed round - Fortune",
        "content": "Morph, a layer-2 Ethereum Virtual Machine, today announced a $19 million seed round led by Dragonfly Capital.\n\nMorph is a fully permissionless EVM L2 that uses a combination of optimistic and zero-knowledge rollup technology to enable a user-friendly option for developers who require a chain on which to build finance, gaming, social media, and entertainment apps.\n\nFrom a technical stance, Morph has focused on blockchain’s trilemma problem—how to balance decentralization, safety, and scalability.\n\n“If we want to really bring blockchain to the next step, into mass adoption, we have to find a vertical which can really create value that the end users realize—so that’s why we focus on the consumer side,” Morph cofounder and CEO Cecilia Hsueh told Fortune.\n\nMorph is designed to offer the most “founder-friendly pipeline” for projects in the L2 space, the company said in a statement. The technology is built within three key pillars: decentralized rollup technology, optimistic zkEVM integration, and modular design. Developers building on Morph have access to tools to help transition from the earliest stages of building up through a potential token listing.\n\nIt’s also the first layer-2 on Ethereum to launch with a decentralized sequencer, meaning multiple entities or nodes can participate in the sequencing process, meaning the opportunity for any single node to manipulate transaction order is significantly reduced.\n\n“The existing L2 market is focused solely on short-term gains to be able to win the next casino round, rather than building for sustainable success. At Morph, we proudly help developers to create dApps that can truly make a long-term difference and win over a mainstream user base,” cofounder and COO Azeem Khan said in a statement.\n\nThe company plans to use the fresh capital on hiring, marketing to bolster its visibility within the L2 ecosystem, and refining its technical infrastructure. Additional investors include Pantera, The Spartan Group, and MEXC, with a further $1 million raised in an angel round. Bitget, the world’s leading cryptocurrency exchange, is an original investor in Morph and plans to continue playing a role in the Morph ecosystem.\n\n“We believe Morph’s technology can be exactly what developers in the consumer vertical need to pave the way for wider mainstream adoption,” Paul Veradittakit, a managing partner at Pantera Capital, said in a statement."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxNY3JYMDFBcEhtRjBfOUNiV1FWMHFLTGx1T3NGanp5dUZBTnlWVG1DcDZOUWdTZEVpX2pzRGwzM0NtS0NkY05YUE5ma1dNYVJyR2NKSlE1MnNOc1FScVB0MWtDWDdRRmp4UGswLXVhendaQmhWRFlfcWdsVDFZYkNLeEJsdDFFcnRUb1ZN0gGTAUFVX3lxTE56cmJhVEJMQ3lsTEg0U09nd1ZfR3NxdVJnbm1ESWR2UFVEbXNtcnRDU1pBTFlyN2o3bkNjdnRuN2FxZkpMYnNqLVIyRlY2U25PUGdHcFc3Z2pValM5Y1l4RkJJU0JxNHB5S212Rk9CWnU2aHhka29Nc1Q3UzhNNDAzWlhISjhjOFFONERHa1V1TThfbw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "How Much Has the Ethereum Dencun Upgrade Cut Layer-2 Gas Fees? - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nHeralded by Ethereum developers as the technical milestone they’d been “dreaming of,” last week’s Dencun upgrade was supposed to forever alter the Ethereum ecosystem—by making transactions on its layer-2 networks exponentially cheaper and thus more accessible.\n\nOne week later, how do things stand?\n\nOn the whole, Dencun has delivered exactly as promised. Across layer-2 networks that have already integrated the software update, gas fees have plummeted to unprecedented lows, in most cases by over 90%.\n\nAt writing, median transaction fees on layer-2 networks Arbitrum, Starknet, Optimism, and Optimism-based chains Base and Zora have all fallen to one cent or below, according to data from Dune and Ethereum analytics platform Grow The Pie. That’s a 91% to 95% drop in cost for each of those networks.\n\nAD\n\nAD\n\n2 hours ago, @arbitrum's gas fee dropped by another 80%. Now you only need 0.000004 ETH (about $0.01) to complete a transaction on this chain. This is fucking insane man! https://t.co/GgEv4AbGbz pic.twitter.com/2DNZlcLjmN — Larvandweb3.eth 🦇🔊 (@Larvandweb3) March 19, 2024\n\nDay by day, those costs continue to fall—from one cent down to mere fractions of a penny.\n\nEnabling Dencun’s near-elimination of gas fees is a novel data storage solution called proto-danksharding, which is powered by blobs. Blobs allow layer-2 data to be stored on-chain for a temporary period of about a month, as opposed to forever—the only previously available option.\n\nGm to 4844, welcome to @Optimism & @base Swaps now costing 1/10 of a cent Modularity scales. pic.twitter.com/CcZPshm836 — AureliusBTC (@AureliusBTC) March 14, 2024\n\nAD\n\nAD\n\nDencun’s drastic reduction of on-chain fees has impacted not just ETH transfers and token swaps, but also heftier NFT-related transactions.\n\nOn Zora—a layer 2 network built by the homonymous NFT minting platform—the most common transactions are (expectedly) NFT transfers. Nonetheless, the median transaction cost on the network is currently 9/10ths of a penny.\n\nCompare those minuscule figures with the Ethereum mainnet, where an NFT sale currently costs $72 on average, per Etherscan. Just weeks ago, due to network clogs, that cost neared $400 per NFT transfer.\n\nThis is huge Reducing transaction fees and confirmation times on Layer 2 will open up so many more use cases for crypto. We're finally getting scalability. https://t.co/X7K3TzkMno — Brian Armstrong 🛡️ (@brian_armstrong) March 14, 2024\n\nNot all layer-2 networks are quite there yet, however. Some are taking a bit longer to integrate Dencun-related updates across their settlement contracts. Polygon, for instance, has yet to see its gas fees fully drop off; mean transaction costs on the network are currently hovering around $0.72. Polygon Labs VP of Product David Silverman previously told Decrypt that he expects all layer-2s, including Polygon, will be fully integrated with Dencun within a month or two.\n\nWhile the impact of Dencun is clearly already substantial, some critics outside the Ethereum ecosystem—and even developers within it—have noted that transaction costs are likely to rise with increasing network traffic.\n\nWhile blob-enabled L2 gas prices are very cheap right now, we can expect them to increase a bit over time as demand for blobs increases. This is expected behavior & is why 4844 is only the beginning - blobs are an evolving primitive & are part of the wider danksharding roadmap. — sassal.eth/acc 🦇🔊 (@sassal0x) March 14, 2024\n\nAnd yet, most layer-2s with slashed gas fees have already seen dramatic increases in network activity. Daily transaction volume has more than doubled on Optimism, Base, Arbitrum, and Zora in the week since the upgrade; on Starknet, it has almost tripled. Gas fees on all those networks are still currently one cent or less on average.\n\nAD\n\nAD\n\nMany L2 developers hope that such sustained drops will prompt a fundamental shift in how users engage with Ethereum—moving the bulk of routine transactions onto L2s, and away from the costly mainnet.\n\nBut recent gains of layer 2s don’t appear to be at L1’s detriment—at least not yet. Traffic on the Ethereum mainnet remains consistent with figures from the past year, according to Etherscan; in fact, it’s slightly up since last week.\n\nEdited by Andrew Hayward"
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPS0VuYkNJalNJZzU2YnJLTm8yRjlaTjJVa2FONHRlM1V4Y283a0RfbEM2NDlSSTE1QmIxR2RKTDVGZEVqMEwyUjNkVUFrbktoZGRUNThXNWdDNVdZYnFpU1NEal9LWUFHVzk2aGRZdzlYWW1GMkZuMVVJLTJySXBfUjJZS2FRSTRlZW0w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "Solana overtakes Ethereum on DEX volume amid memecoin ‘presale’ frenzy - Fortune",
        "content": "Solana is now the top smart-contract blockchain by trading volume, surpassing Ethereum, according to data from DeFiLlama.\n\nThe volume of tokens trading on Solana-based decentralized exchanges, aka DEXs, climbed by 67% to $21.3 billion over seven days, whereas volume on Ethereum-based equivalent exchanges rose by just 3% to $19.4 billion. Likewise, the number of daily active addresses on Solana has also spiked, rising from 400,000 to 600,000 in January to February to roughly 1.25 million on Tuesday.\n\n“A lot of the surge we’ve seen in Solana DEX trading volumes will likely come from the memecoin wave that we’ve seen over the past few weeks,” Martin Lee, a data analyst at Nansen, told Fortune.\n\nSpeculative buzz around Solana-based memecoins dogwifwhat (WIF), bonk (BONK), book of meme (BOME), MAGA (TRUMP), and slerf (SLERF) is partially behind Solana’s recent successes. On March 13, 2,300 Solana memecoins were minted in one hour, meanwhile stablecoins on Solana reached a multiyear high of $2.80 billion.\n\nIn the last 1 hour, 2,500 Solana memecoins were created. — Ram Ahluwalia CFA, Lumida (@ramahluwalia) March 13, 2024\n\nThe speculative frenzy behind Solana’s memecoins has been catalyzed by a trend called “presales” whereby tokens are sold before officially launching. A buyer sends funds to a crypto address and receives the set number of tokens at a later date. Some estimate that over $100 million worth of tokens were sent to various memecoin presales over the weekend, mainly on the Solana blockchain, CoinDesk reported.\n\n“There’s a bastion of memecoins attracting users with the lure of outsized returns: Speculation on these are likely currently driving an influx of users, but I’m hopeful that new entrants will stick around,” Philip Forte, founder and CEO of Elixir, told Fortune.\n\nThe hype of presales has grown with the success of BOME. Last week, its creator took to X to offer a presale, and the result was that early investors turned a few hundred dollars into hundreds of thousands over a few days. Meanwhile, BOME’s market capitalization soared from zero to $1.6 billion in a few days, with over $100 million in daily trading volume, CoinDesk reported.\n\nThis BOME presale meta is the worst thing to happen in this space in a while https://t.co/06cOaB48W7 — Franz (@Franz_0x) March 17, 2024\n\nBut the presale frenzy has drawn criticism from some on-chain watchers, with one X user posting: “2 years later and everyone is right back to bidding ponzis. People can do what they want with their money but sending money to a ‘memecoin presale’ that has a 99.9% chance of rugging is actually just dumb as hell.” (BOME prices did drop after its launch, about 50% at the week’s start—steeper than a wider market correction.)\n\n“The reason Solana is able to capture all the memecoin volume as opposed to ETH L2s is because Solana’s transactions fees have been historically much lower,” Pat Doyle, Blockchain Researcher at Amberdata, told Fortune. “This makes investing in the speculative memecoins much more attractive as you don’t have a larger percentage of your transfer consumed by fees.”\n\nDoyle added: “Looking at this from a broader view, the memecoin craze is showing the ability for Solana to handle high volume and throughput.”\n\nAnd, to be fair, many investors had an eye on Solana before the latest memecoin boom: The blockchain’s native token SOL—though down about 8% today, to $168—is up almost 70% in 2024.\n\nAustin Federa, head of strategy at Solana Foundation, told Fortune in a statement that although the company expects some of the new users associated with the memecoin blitz to exit, \"We see this as a catalyst for a wave of new users to discover the usability and power of the Solana network—and stay for the long term.\""
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxPMFktLWpOZm1ZQlhlODhybDR2WVVEdVUtSGJ1Qkt1QmJUcm1jSWxRd2RWdjlZNHc5bDdKTjl3b3kweFJjUEZDT0taN3B2Y0dTZGxJSFhmM2s5YnE3d1RqTW1RcmFJOHhWTDdaMTFKVTV0bWw1d1psSmEwQWI0N3JJNi1Od25DMnhiaUlycTVCOG14NUNGd0JFZWJjUXdmSjhxcjM40gGrAUFVX3lxTE9wZ0dPelViajFQMHR2cEhGYXlxQl84aXQxaG9hQ3JnTkZ3ekdIaThxdTFaODg0X1VBcWZIT0hsUE8zNWZxQ1ROYUlQaVRUZE5zaWZUSlE2T2x3ZktWU1pocGp6Y3NFRTJxc1MxUm1MRVNzbGV6cXlieFdyNS1LWDlpQkRkWTZOSHA5QmlVUWlWbk8zQkNnaURZUV9hTy1iOTBjQnVRUGI4cHlMSQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "Coinbase Transactions Are Failing Due to Congestion on Ethereum Scaler Base - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nLeading American crypto exchange Coinbase is having issues again Wednesday—but while other recent instances were blamed on a surge in crypto trading activity amid Bitcoin's rise to a new all-time high price, this wave of problems is being blamed on Base, the Ethereum scaling network that Coinbase itself incubated.\n\n\"Due to network congestion on the Base network, transactions on Coinbase Wallet and Coinbase.com may experience intermittent failures,\" Coinbase's status page reads. \"If your transaction is not confirmed by the network, please wait or submit your transaction again on Coinbase.com. We advise that Coinbase Wallet customers wait for congestion to resolve before submitting transactions on the Base network.\"\n\nFollowing the initial publication of this story, Coinbase representatives sent the following statement to Decrypt:\n\n\"Due to high network traffic on the Base network, transaction fees increased over the last 24 hours. Some user transactions that were submitted with lower fees may be stuck in a 'pending' state. If possible, users with pending transactions should cancel their transaction and resubmit with the latest estimated gas fee. If you are unable to cancel your pending transaction, the transaction will complete once traffic subsides. Rest assured, your funds are safe. Pending transactions will process once fees reduce. The Coinbase Wallet team is working on implementing a transaction cancellation feature, and will provide an update once available.\"\n\nAD\n\nAD\n\nBase transactions have spiked dramatically in recent days following last week's launch of the Ethereum Dencun upgrade, which promised to cut transaction fees on layer-2 scaling networks. Indeed, Base—which is based on Optimism's scaling tech—has seen a dramatic decrease in fees, falling by 90% or more alongside some other networks.\n\nPublic blockchain data curated by Dune shows a sizable leap on transaction volume on Base, rising from a daily average of about 400,000 daily transactions before the Dencun upgrade to a million or more each of the last several days. Base hit a new daily transaction record of 2.12 million on Saturday.\n\nEditor's note: This story was updated after publication with additional details."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxPNUtfNUZSb195b0F0UUVYcDZ3aGhOa3N5bkY4dlloSnMxajVEWlh0ZDNEWkpJMTBmdksxajVMLW95VjMzUmtJUTJDVzF3UEpIYXRFLWlINi1LLWhYXzNydGtrY215SEhaUXdVd0pNVWtlTTBDWk5paXpXZ0g4ek5tT2VqdHJLeWNwTXlBYVVnY3NfZk0tVWNVNlJrSDJXeWMxbS1iWndXc3owRngxNk9lLUcxRzVRYzNFMDVGWmhza1LSAcYBQVVfeXFMTjQxUlpjMGFVcmlRYzl6bFJJOFZZYnAwR3Rnd2FiS3U1NjR2RmxVdnFmTVNrOGkwNGozTnhPRFNaTDRZM25EQ3hwWVYxaFlqaWdGY3RZSVVkeTJsS0JJVVpIdVRMajFKVzRFSlZuZkJkN3prZHp4NUV6Vm8xc0czZGhJTlBjSlc1dXhaS0E2RGdsZVh0ZVVOMmdkck01c19Bb1lnR3ZJSTBFbWZQSlNhdkNqeTNMZVVvQ2dUdFhOc2VNZmZISHVn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "Ethereum price plummets as large investors take profits - FXStreet",
        "content": "Ethereum’s price loses nearly 7% on the daily time frame, adding to the almost 20% weekly decline.\n\nThree Ethereum whales sold $95 million in Ether, taking nearly $40 million in gains since Friday.\n\nETH price could sweep the $2,900 level for liquidity before attempting a rebound.\n\nEthereum (ETH), the second-largest crypto asset by market capitalization, is currently in a state of decline. ETH price is down 7% on the day and almost 20% on the week, wiping out recent gains. On-chain data insights reveal that large-wallet investors, popularly known as whales, are shedding their Ethereum holdings and taking profits, increasing the selling pressure on ETH.\n\nAlso read: Grayscale amends Spot Ethereum ETF filing, ETH trades sideways below $3,700\n\nEthereum price crumbles under rising selling pressure\n\nData from crypto intelligence tracker Spotonchain shows that three large-wallet investors have taken profits on their Ethereum holdings in the past four days. The three Ethereum whales sold 26,946 Ether, worth $95.7 million, and took $39 million in profits. The transactions took place on Binance between March 15 and 19.\n\nAs whales shed their Ether, the altcoin’s supply on exchanges has increased. Between March 15 and 19, ETH reserves on exchanges are up from 13.92 million to 14.43 million. An increase in supply on exchanges implies there is a higher volume of Ether available to sell.\n\nAs seen in the Santiment chart below, Ethereum price declined alongside this supply increase, supporting the thesis that profit-taking has partly driven the drop in Ether’s price.\n\nSupply on Exchanges. Sources: Santiment\n\nEthereum price could sweep $2,900\n\nEthereum price is strongly correlated to Bitcoin. Therefore, the price decline seen in BTC likely helped Ethereum’s price to drop as well alongside factors like profit taking and whale activity.\n\nETH price is on the verge of dipping into the range between $2,717 and $3,200, represented by the Fair Value Gap (FVG) on its monthly chart. Once the altcoin collects liquidity in this zone, its price could rebound towards resistance at $3,500 (represented by R1 in the chart below).\n\nThe ETH/USDT 1-day chart shows that bears are taking over as the Moving Average Convergence/Divergence indicator flashes red bars. The Relative Strength Index (RSI) is at 42.05, close to the neutral zone, meaning ETH is not currently oversold. Should the RSI for ETH drop into the oversold zone, it would give a buy signal for sidelined buyers to step in.\n\n\n\nETH/USDT 1-day chart\n\nA daily candlestick close below $3,200 (the upper boundary of FVG) would result in a steeper correction that could send ETH price towards support at $2,166."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxQUjZJeG1pNlBnWk1kUGVQaUVKSDZsSmp4Z3pXVUtYbGQyX2pqYTlxa1dYd3ZaUGZYeVplVlBPS1JoNU0zZ2dOU2NGZHlsRUkwWndOWGpfNmYySVpVUnRvdkFGTURCeVhTc0xJN29valdmckYzV1pOalRHcWwxRXlSYjd2aXFTR2RKMDNPUEU1c3I1ZmRULWR1b1hmeVpSc3hFbll0RmN2QWNvcjNXRFlmbXppWHBxeFN00gG-AUFVX3lxTFBicGYzVWRBbUJOMlhrUjZWVjgweDRqZ2drZzFEeS0xeWk3RklEZlVBbTVubzlNbzJacDJWOW0zVTNuYWZlMExRT3ZWMW9VSzQ4a3NSUGFJSW8yLWYzbFZPaXVlT1lTZVlyN2RxdHE5U05BUXZTSXpVSHBZcmFNSTFlcm5taHFjOEZyeXA5Qjc3ekVXamNuR0VaZTRNY0hEOU5KMkV4NGhKQ2Nlb2xHNm9pZUJtTUpKNG9xZzRoNHc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "Solana Meme Coin Slerf Clocks Higher Trading Volume Than All of Ethereum - CoinDesk",
        "content": "SLERF came into existence following a token presale , during which it raised $10 million from users. It quickly went viral on social platform X after its developer said they accidentally sent all the money raised to a burn address, a crypto wallet address that’s not controlled by anyone, thus losing access to the funds."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMibEFVX3lxTE5lNDdyRDVLRXNOekRRdUFTQlNpNFZqM1Y4ZFpoYmUyaXc1VE5aZjZLZUdTZGhqOTJubFBFVGJIdHJjMUpHS3REVlcwS3RpcEFhUkFkYzNuTGdRdWFxbXEtOS14RzMwTVZKNzQxatIBdEFVX3lxTE1hbVY1eHdJV01jb1QyTDR6SG9CeUJmZjBzN04yYUtUeURMSEczT3UxdGZEcmI1Z1N0NHVkVXAtNHExRHVFNFVKM3J2Wi1HNzJ4X2hyYlJGUmZpeHBPazBMa2dZSUJISmNmM1BBZTdLdE11bU04?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "Ethereum ETFs Won't Be Approved In May—Nor Should They, Some Experts Say - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe odds of spot Ethereum ETF emerging anytime soon are looking increasingly dire, but some crypto experts say that may be for the better.\n\n“Spot Ethereum ETFs will gather more assets if they launch in December versus if they launch in May,” wrote Matt Hougan, CIO of Bitwise, on Twitter on Tuesday. “TradFi needs more time to digest the Bitcoin ETFs.”\n\nBitcoin spot ETFs, which hit the U.S. market on January 11, have absorbed $12 billion in net inflows since launch. One of those ETFs belongs to Bitwise itself, which now holds nearly $2 billion in BTC on behalf of clients.\n\nHougan has repeatedly argued that there is still ample room for greater adoption of Bitcoin ETFs by the traditional financial world, and that certain target markets—like corporations and wirehouses—are still “plugging in” to the asset.\n\nAD\n\nAD\n\nA survey released by Bitwise in early January, however, found substantially less interest in Ethereum among financial advisors. At the end of last year, 71% of respondents favored Bitcoin, compared to a roughly 50/50 split in 2022.\n\n“Aside from Bitcoin (which is in a class of its own), the most excitement I've heard in terms of real-world use is around stablecoins,” added Hougan, based on his attendance at the institutionally-focused Blockworks DAS conference. “Seems clear to me that stablecoins will be a multi-trillion market by the end of 2025.”\n\nBloomberg’s ETF experts are apparently of the same mind: earlier this month, analyst Eric Balchunas said that Ethereum spot ETF would be “small potatoes” next to their Bitcoin-based counterparts.\n\nI tend to agree. (Bitwise doesn't have an active spot #Ethereum ETF Filing before the SEC) https://t.co/htJZF1JRas — James Seyffart (@JSeyff) March 19, 2024\n\nAD\n\nAD\n\nNeither Balchunas nor his associate, James Seyffart, believe such ETFs are likely to receive approval by May 23, which is the SEC’s final deadline for approving or deny he first wave of applications for the product.\n\n“[Regulators] need to start having convos with the issuers ASAP and they don’t seem to be doing that based on anything we’ve seen thus far,” wrote Seyffart on Monday.\n\nFurther impacting the odds for some issuers—including Fidelity and Ark—is the promise to stake a portion of their fund’s assets to earn a yield from the Ethereum network. Blockchain staking and proof-of-stake cryptocurrencies are already in dicey legal territory with the Securities and Exchange Commission (SEC), held solidly in the spotlight in many of the agency’s lawsuits against the crypto industry.\n\nJames Butterfill, Head of Research at CoinShares, believes an SEC decision on the ETFs may be delayed until the third quarter of 2024 or later due to unresolved issues around staking.\n\n“Currently, it appears that incorporating staking within a grantor trust is not feasible,” Butterfill told Decrypt.\n\n“Given the SEC's history of postponements, as observed with Grayscale over ten years and Blackrock last September, the likelihood of further delays is high,” he continued. “With much optimism placed on May, investors might face disappointment.”\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxNTERxbXVmemRfVnVSejRrUVA5UDJYRmZLUVlsQUZKNHBaR1VXYm9DUlRQNnhmaDV3REh6cnhPTHJHb0hmV25JNk1Ua2MwbW10N2lwc1c1dDc4NFE0TkxyNUwtM0xSTlNCdWROVWJkb0E4b2NhVDhleGxESGlOYWtUUlRjMjFxYklGR1k2VVYtS0dYNnVh?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "BlackRock Launches Digital Asset Fund Backed by $100M on Ethereum - Watcher Guru",
        "content": "Asset management company BlackRock is launching a tokenized digital asset fund, a new SEC filing on Tuesday shows. In turn, BlackRock seeded the fund by depositing $100 million in USDC stablecoin on the Ethereum Network.\n\nJUST IN: BlackRock launches digital asset fund and deposits $100 million $USDC on the Ethereum network. — Watcher.Guru (@WatcherGuru) March 19, 2024\n\nThe BlackRock USD Institutional Digital Liquidity Fund was incorporated in the British Virgin Islands and will be launched in partnership with Securitize, a tokenization firm. According to wallet data from Etherscan, BlackRock deposited Circle’s USDC stablecoin into a wallet on the Ethereum Network.\n\nBlackRock is continuing its journey into the digital asset industry following its Spot Bitcoin ETF launch earlier this year. The company’s Bitcoin ETF has been one of the best-performing Bitcoin products out of the field of new launches in 2024. Additionally, BlackRock also has a pending application for a spot Ethereum ETHER (ETH) ETF, which the SEC is putting off approval of.\n\nMANHATTAN, NEW YORK, UNITED STATES – 2021/05/25: BlackRock offices in New York City. Founded in 1988, BlackRock, Inc. is an US multinational investment management corporation. The corporation is the world’s largest asset manager, with $8.67 trillion in assets under management as of January 2021. (Photo by Erik McGregor/LightRocket via Getty Images)\n\nBlackRock Continues Its Mission For Tokenization\n\nIn a January interview with CNBC, BlackRock CEO Larry Fink said that BTC and ETH ETFs “are just stepping stones towards tokenization, and I really do believe this is where we’re going to be going.” Now, we are seeing the asset manager shift towards tokenization with a major step.\n\nAlso Read: Solana (SOL) Market Cap Predicted to Reach $1 Trillion\n\nFurthermore, BlackRock’s digital asset fund also represents a major milestone for the tokenization of real-world assets. Tokenization is a growing sector in the intersection of digital assets and traditional finance. It involves placing traditional assets on blockchain rails in pursuit of faster settlements and higher efficiency."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxOYklJNmhzdnpxUEh3MDY4YnpFOVRrbWVDUzRfZFpheVFIWENmLUlFVndSMGhGOWRuMEZrM3kxYUtsQ2RzTF9vTjI1MC04eVJSMGJEVEV4U29NUU5sR1FiSjlyVVdqbDBLSkY2aWNmZUpKU2lPSUVIby1RUkxhVVc5aDZKb9IBiwFBVV95cUxNMGNpaWozQlg1SldDVzd4djUxZkM2anBRS1ZjS0xFSDBBWVBvQlhFNmp2YjNoQ1h2cEMzaUJpM1ZlNkFsblpLUHJhSXdJbm0tdjcyZy1MME1FU2E4MlMySUhiQ2o1TWt1Tm1yX2pyRk9KNGEtdjlPQ2JaRVJQZlZ6bk9iZWpfQW1oMVhV?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "Another CryptoPunks NFT Just Sold for $16 Million in Ethereum - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEthereum is down this week despite recently setting its highest price in over two years, but the market lull didn’t stop someone from spending big on Wednesday: A CryptoPunks NFT was just purchased for more than $16 million worth of ETH.\n\nPunk #7804, one of just nine Alien Punks in the influential Ethereum NFT collection, traded hands for 4,850 ETH on Wednesday afternoon, or $16.42 million at the time of the sale. That makes it the second-largest CryptoPunks sale ever whether measured in ETH and USD.\n\nThe sale comes just weeks after another Alien Punk (#3100) sold for 4,500 ETH, which was worth $16.03 million worth at the time of the transaction on March 3. As with that purchase, the buyer of this latest Punk has yet to be publicly identified. The Ethereum wallet used for the purchase was funded for the first time Wednesday via Coinbase.\n\nHowever, the seller of Punk #7804—who purchased it in 2021 for 4,200 ETH, or $7.57 million at the time—posted a message on Twitter, lamenting that they did not “elevate” the profile of that particular Punk during their time holding it.\n\nAD\n\nAD\n\nEnd of an era. I've long since felt like an imposter. Holding punks, and potentially NFTs a whole hostage by not elevating 7804 in the way he deserves. After over a year of looking around I feel I've found the right buyer with the right vision to appropriately elevate this asset https://t.co/onngtTumrJ — Peruggia (@peruggia_v) March 20, 2024\n\n“End of an era. I've long since felt like an imposter. Holding Punks, and potentially NFTs [as] a whole hostage by not elevating 7804 in the way he deserves,” the pseudonymous Peruggia wrote. “After over a year of looking around, I feel I've found the right buyer with the right vision to appropriately elevate this asset.”\n\nThe top CryptoPunks sale of all time happened in February 2022, when a crypto startup CEO purchased another Alien Punk (#5822) for 8,000 ETH, or $23.7 million.\n\nToday’s purchase now ranks as the fifth most expensive NFT sale of all time. The record is still held by Mike “Beeple” Winkleman, whose digital artwork collage “Everydays: The First 5000 Days” grabbed international headlines when it was auctioned for $69.3 million by Christie’s in March 2021, helping to ignite the initial fever around NFTs.\n\nAD\n\nAD\n\nMinted in 2017 by Larva Labs, CryptoPunks helped set the standard for tokenized profile pictures—one that would later be expanded upon by the Bored Ape Yacht Club and countless other collections that followed. The NFTs were originally given away for free, yet have generated nearly $2.8 billion worth of secondary trading volume to date, per data from CryptoSlam.\n\nEven the cheapest available CryptoPunks NFT on a marketplace is listed at about 51 ETH, or $177,000 worth. The CryptoPunks IP was ultimately acquired by Bored Ape Yacht Club creator Yuga Labs in 2022.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxPa3NHRm5HNE42UnpMdjlQTTFucWlSRkhZRERZYXZocldfTi1MRDNHbUs0alMtbzIzOVNQRklsT3hWYkFCQ2FUOVZtdXBhMTN5UVgxRFhSTV9sQXo1YTcxaGIxLU9xbHljZVRMcnZnWjRQbnFkWmVDLWE0bzRBN0ZmSXNlQkhzcGVxdVd0Q3F5dw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "BlackRock Enters Asset Tokenization Race With New Fund on the Ethereum Network - Yahoo Finance",
        "content": "BlackRock to start a new real-world asset (RWA) tokenization fund on the Ethereum network.\n\nThe asset management giant also made strategic investments in asset tokenization company Securitize.\n\nAsset management giant BlackRock (BLK) officially unveiled its tokenized asset fund on the Ethereum network on Wednesday.\n\nThe BlackRock USD Institutional Digital Liquidity Fund is represented by the blockchain-based BUIDL token, is fully backed by cash, U.S. Treasury bills, and repurchase agreements, and will provide yield paid out via blockchain rails every day to token holders, according to a press release.\n\nSecuritize will act as a transfer agent and tokenization platform, while BNY Mellon is the custodian of the fund's assets, BlackRock said. Anchorage Digital Bank NA, BitGo, Coinbase, and Fireblocks also participate in the fund's ecosystem.\n\nBlackRock also made a \"strategic investment\" in Securitize, the press release added, but the terms of the deal weren't disclosed.\n\n\"This is the latest progression of our digital assets strategy,\" said Robert Mitchnick, BlackRock’s Head of Digital Assets. \"We are focused on developing solutions in the digital assets space that help solve real problems for our clients, and we are excited to work with Securitize.\"\n\nThe announcement came after a regulatory filing revealed that BlackRock incorporated a fund with Securitize, spurring speculations of a tokenized fund as observers pointed to blockchain transactions to seed the vehicle, CoinDesk reported Tuesday.\n\nBlackRock is the latest traditional finance giant to enter the tokenization field after Citi, Franklin Templeton and JPMorgan have already made headways with the technology. Creating blockchain-based tokens of traditional investments such as bonds and funds – known as tokenization of real-world assets (RWA) – is a fast-growing use case for blockchains as digital assets and traditional finance (TradFi) are becoming more intertwined. Tokenized U.S. Treasuries , for example, have grown to $730 million from $100 million in early 2023 as crypto firms seek to earn a steady yield by parking their on-chain funds.\n\nBlackRock CEO Larry Fink said earlier this year in a CNBC interview that the company's spot BTC ETF was \"stepping stones towards tokenization.\"\n\nRead more: The Tokenization of Real-World Assets (RWA) Explained"
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxOYzRLRTJhcy1aSkZZT2tfaVFBZ1lNNXFEUTZnTlNvNGlrUzduXzZFYlQ1ODR2ZEI0eWswd2JOYjlCNVN1Um5nbEJzem4taXVMNWhldDl5amh5X29lY2VIOVdaaGZnOHdtNUxZakcyc0R1dWE3NklPWktfMHZvdXlyVV9pNVl1QQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "Ethereum Slumps Below $3400: Can ETH Hit $4000 This Week? - Watcher Guru",
        "content": "The Ethereum network has undergone notable changes in recent times. On September 15, 2022, the network transitioned from a proof-of-work mining model to a proof-of-stake model. This transition has led to a significant reduction in energy consumption, with reports indicating a 99.95% decrease.\n\nA few days ago, the network implemented the Dencun upgrade, which was designed to improve its functionality and performance. However, following this upgrade, the price of Ethereum (ETH) has experienced a decline, falling below the $4,000 mark.\n\nETH had recently shown growth, surpassing $4,000. However, the coin has since experienced a decrease in value along with the broader cryptocurrency market. As of press time, ETH is trading at $3,391, which represents a 6.1% decrease in the last 24 hours. Despite this recent decline, ETH remains up by 89% year-to-date and is still the second-largest cryptocurrency by market capitalization.\n\nAlso read: Cryptocurrency: Top 3 Coins That Could Hit ATH In The Coming Week\n\nEthereum Price Prediction for the week\n\nAs investors and traders closely monitor Ethereum’s price action, cryptocurrency experts at Changelly have shared their predictions for the week. According to their analysis, ETH is expected to reach a minimum price of $3,637 and a maximum price of $3,726. The average price is expected to be $3,680.\n\nThe recent surge in Ethereum’s price has been largely attributed to the growing expectations of ETH exchange-traded fund (ETF) approval. However, the current market sentiment, coupled with Bitcoin’s struggle to push further highs, has dampened the likelihood of ETH surpassing the $4,000 mark this week.\n\nAlso read: Can Shiba Inu (SHIB) Hit $0.00005 This Week?\n\nDespite the recent price setback following the Dencun upgrade, Ethereum remains one of the most promising and influential blockchain projects in the cryptocurrency space. Its robust ecosystem, which hosts a wide array of decentralized applications (dApps), decentralized finance (DeFi) protocols, and non-fungible tokens (NFTs), continues to drive innovation and adoption.\n\nHowever, Ethereum also faces challenges, such as high gas fees and scalability issues, which have led to the rise of competing blockchain networks.\n\nWhile the recent drop in Ethereum’s price following the Dencun upgrade may be disappointing for some investors, it is essential to view the cryptocurrency market’s volatility in the context of its long-term potential.\n\nAlso read: Solana Breaches $200, But Analyst Warns Investors To Stay Out of SOL\n\nEthereum’s fundamental strengths, including its large developer community, robust ecosystem, and commitment to sustainability, position it well for future growth and adoption."
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE9mLWxtR0huX0V2S3dFZkdiQmZNWWU3dlV4bzVlQ2hzX0xrdnk0MjEtUXdqZFFjc1pZVVBRWUw1TkpjdGI1VU9pZjJuSkpNZVFCSzhTelRvdnN4UzFwNzI1ZHYzVEdPZll0VzREMHEyTVoweGpXSDRn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "Solana Passes Ethereum on DEX Volume - CoinDesk",
        "content": "Solana has replaced Ethereum as the No. 1 smart-contract blockchain as trading volume in Solana-based decentralized exchanges (DEX) has increased 67% to $21.3 billion in seven days, according to data tracked by DeFiLlama. Could the increase in volume be catalyzed by the hype around Solana-based meme coins? CoinDesk's Jennifer Sanasie presents the \"The Chart of the Day.\""
    },
    {
        "id": 73,
        "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE5Sc2NobFN4VDRfd05Td3RrYndINW5maUxIQ3BsR0phT2xFMm1xZ0FpNVFKMmhreC1pelNVV21QWDJubzUyUDRzWk9LZlJyOXI0ZGJVajZJdmRrUllUdFlOR21kSEFPX0M5Ukc1NkV2MVhIOER6REpFa1NsQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "Solana surpasses Ethereum on DEX - The Cryptonomist",
        "content": "It is not the first time it happens, but the fact that the volume of trades on decentralized exchanges on Solana has exceeded that of DEX on Ethereum always makes headlines.\n\nEthereum not only has existed since 2015, but has been dominating the world of DeFi uncontested for years now.\n\nSolana instead landed on the crypto markets just under four years ago, but has transaction fees that are far lower.\n\nSolana’s Overtake on Ethereum\n\nIt should be noted, however, that in terms of key metrics Solana has not yet surpassed Ethereum.\n\nBy market capitalization SOL (the native cryptocurrency of Solana) is around 75 billion dollars, just surpassed by BNB with 78. ETH, the native cryptocurrency of Ethereum, is still on another level, with 386 billion dollars.\n\nFor TVL (Total Value Locked on DeFi protocols), Ethereum surpasses everyone with its 46 billion dollars, with Solana in fourth place with only 3.7 billion, surpassed also by Tron as well as BSC. However, the majority of TVL on Tron is due to USDT, while in the Solana ecosystem it is due to DEX.\n\nIt is no coincidence that the overtaking occurred precisely on decentralized exchanges, especially in terms of daily trading volumes.\n\nMoreover, even among DEXs, Uniswap still dominates in terms of TVL, although now a portion of its trading volumes does not occur on Ethereum but on layer-2 solutions like Arbitrum.\n\nUsing as a reference the trading volumes per chain, in the last seven days Solana has exceeded 21 billion dollars, while Ethereum stopped at 19.\n\nHowever, it should be added that there have been more than 6 billion dollars in trading on Arbitrum, so overall the Ethereum ecosystem with its layer-2 still surpasses the Solana ecosystem.\n\nNote that in third place in this ranking there is BSC, with 12 billion, and in fourth place Avalanche with 4.\n\nThe reason for the overtaking\n\nThere are two reasons that have led to this overtaking.\n\nThe first, simply, is the much lower fees on transactions.\n\nIn fact, it is no coincidence that the fifth chain by trading volume on DEXs is Arbitrum, the main layer-2 solution for Ethereum that enables transactions at very low costs.\n\nSolana still has lower costs, so it’s not surprising that it’s the preferred chain at the moment.\n\nHowever, there was another reason behind this boom.\n\nThe boom of memecoins played an important role.\n\nMany memecoins are now being launched on low-cost chains, such as Solana or even Base. Moreover, anyone can list their new token on a decentralized exchange, so DEXs are the ideal place to launch new memecoins.\n\nIt was a real boom, with some truly colossal proportions.\n\nIn the last 1 hour, 2,500 Solana memecoins were created. — Ram Ahluwalia CFA, Lumida (@ramahluwalia) March 13, 2024\n\nNow that the temporary boom of memecoins seems to be fading, it is possible that Ethereum will return to dominate this ranking, even though Arbitrum has now become a strong competitor.\n\nThe historical volumes\n\nHowever, the situation changes if historical volumes are taken into consideration.\n\nOn a monthly basis, in March Ethereum still dominates with over 51 billion dollars so far, while Solana is at about 45.\n\nIn February, even BSC had surpassed Solana, with 25 billion dollars compared to 22.\n\nIn January, for example, Arbitrum had almost caught up with Solana, both at 22 billion, so it is evident that the overtaking of the last week is due to a perhaps temporary boom, largely driven by memecoins.\n\nIn November 2021, at the peak of the bubble, DEXs on Ethereum recorded a record of $107 billion in monthly trading volumes, followed by $74 billion on BSC.\n\nThey were numbers far superior to the current ones, so it seems that there is still room for growth for DEX. At that time Solana didn’t even make it into the top 10, so in just over three years it has come a long way.\n\nEven Arbitrum has grown a lot, because back then it was under 4 billion, while in the first 20 days of March 2024 it is already over 18.\n\nThe prices of SOL (Solana) and ETH (Ethereum)\n\nInterestingly, both ETH and SOL are currently priced 34% below their all-time high.\n\nHowever, in the last seven days ETH is losing 20%, while SOL is gaining 12%. Also since the beginning of the year SOL is performing better, with a +68% compared to the +42% of ETH.\n\nThe key point to understand these differences actually lies in the bear market of 2022/2023.\n\nETH in 2022 has dropped less, and in 2023 it immediately recovered together with BTC.\n\nInstead SOL lost much more in 2022, and especially in 2023 it recovered only in October, when the entire crypto market restarted.\n\nAlthough in some ways it may seem that Solana is challenging Ethereum, in reality for now it is still the latter that dominates, even on DEX (especially thanks to its second layer)."
    },
    {
        "id": 74,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxOeXpsM2NiTDFTa2JRczZ2MElrVDBKcGRYZDlZYXJYOGlUakpCQlRVYTg0ZjYyNXRlOWFTZ3pYU2ltS2JPbmt2cmFCcFkxNVlaSW9jby1SZ2dCQkhFamxpZ2xOZVlXbEdwc2x4ME5xcHQtRzVDbjlCOWFwdWIxbUNvR09DQXR5SGl0UTNJTjdPWS0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "Ethereum rejected $4,000: Crypto analysis of March 20, 2024 - Cointribune EN",
        "content": "Wed 20 Mar 2024 ▪ 5 min read ▪ by Family Trading ▪\n\nAfter reaching the $4,000 threshold, Ethereum has entered a corrective phase of 25%. Let’s examine the future outlook for ETH together.\n\nSituation of Ethereum (ETH)\n\nAfter marking a high at $4,100, the price of Ethereum has begun a downward movement, countering its last bullish phase active since $2,100. Indeed, the price of Ethereum regained, on the morning of this Wednesday, March 20, $3,050. It is worth noting that this drop occurred after the Dencun update. Has the price of the cryptocurrency already integrated this news? What is certain is that the fall of Bitcoin has contributed to that of Ethereum. The $3,700 support was not solid enough, just like those at $3,500 and $3,200. However, it can be observed that the price of Ethereum rebounded on the Fibonacci 50% level, taken into account from $2,100. Thus, a buying pressure seems to be identified at this level.\n\nEthereum is currently just above its 50-day moving average. The structure remains bullish, but a move of ETH below this threshold could cast doubt on this perspective. As for Ethereum’s bullish momentum, it’s not surprising that it has been revised down, given the direction taken by oscillators and the price of Ethereum itself.\n\nETH/USD Chart (1D)\n\nThe current technical analysis was conducted in collaboration with Elie FT, an investor and trader passionate about the cryptocurrency markets. Today a trainer at Family Trading, a community of thousands of self-funded traders active since 2017. There you will find live sessions, educational content, and mutual assistance around financial markets in a professional and friendly atmosphere.\n\nZoom on Derivatives (ETHUSDT)\n\nThe open interest on ETH/USDT contracts experienced a notable decrease. This reduction came with a liquidation mainly on the buy side and a reduction in the funding rate, hinting at some capitulation by buyers. It is crucial to mention that a reduction in the funding rate can be interpreted positively when it is considered excessively high. Indeed, it may signal a readjustment towards a healthier balance between the market and its underlying asset, thereby helping to alleviate selling pressure that could weigh on these contracts.\n\nOpen Interest / Liquidations & Funding rate ETH/USD\n\nThe heat map of ETH/USDT liquidations over a month reveals that the cryptocurrency is just above a strong liquidation area in a price range between $3,000 and $2,800. Above the current price, there is also an area around $4,100, corresponding to the last peak reached by ETH. As the price approaches these levels, a massive trigger of orders could occur, thus increasing the risk of a period of heightened volatility for Ethereum. These zones thus represent a critical point of interest for investors.\n\nETH/USDT Liquidation Heatmap (1 month)\n\nHypotheses for the Price of Ethereum (ETH)\n\nIf the price of Ethereum stays above $3,000, one could anticipate a bullish continuation up to the $3,600 level. The next resistance to consider, if the bullish move continues, would be $4,100. At that point, it would represent an increase of more than +26%.\n\nIf the price of Ethereum fails to maintain above $3,000, we could envision a return to $2,900 or even $2,800. The next support to consider, if the downward movement continues, would be around $2,700. At this stage, that would represent a drop of nearly -15%.\n\nConclusion\n\nAfter experiencing a peak at $4,100, Ethereum underwent a significant bearish correction, despite a notable rebound to $3,050, a dynamic partly attributed to the influence of Bitcoin’s fluctuations. Although support at various levels was compromised, the rebound observed at the Fibonacci 50% level shows a certain resilience and potential buying pressure. Thus, the cryptocurrency’s structure remains bullish. However, it will be crucial to closely monitor the price reaction at various key levels to confirm or refute the current hypotheses. It is also important to remain vigilant to potential “fake outs” and market “squeezes” in each scenario. Finally, let’s remember that these analyses are based solely on technical criteria, and the price of cryptocurrencies can otherwise evolve rapidly depending on other more fundamental factors.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 77,
        "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxPb0taLTBJeU9YTmpka2NuUldSSFpldjk3SWJwLVdjb1ZVRGdVUEpYWjRXeGZiMmdmUDVnLWtURlNva3BjSkdhSWNfR0R3dkVTcUdZc3VjRWZXX2VQcXhtT2F0S2xDNURZbTNrN29jaWxsTHRxRGJ0MmdIam9mU29QMWFEem9wTm1PMzFNNnhCMl9Uay0yQ2trR0tBdFBQSl9BVVHSAacBQVVfeXFMTnJTbUU4ckVITnlQY25VbndJTWxwU0lBemluSnNHanJMQ094NFBDQUpCcEk5RHhkNndqMTMtTm9PMFh3eFI1N0M5dlZFQ1EyUEJTclFFTF9KUUgwNm9iOHdpelh5X2pBTGRZd3FZOVFZX1lWUE1fdk4tT0RzTVpUWDFUVlpsLUs5RzdBcjFIRkwtZ3lmTm9scnR0czROeG9HRzBfaDE4RnM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "Ethereum Price Prediction: Is Smart Money Buying Or Selling ETH At $3,300? - CoinGape",
        "content": "Ethereum price prediction: Ether flirts with short-term support at $3,300 barely a week after climbing to a new yearly high of $4,095. For some investors this correction means panic.\n\nHowever, savvy participants, otherwise referred to as smart money, are acting by scooping up the liquidity following $122 million in liquidations, according to Coinglass data.\n\nadvertisement\n\nEthereum Price Prediction: What’s Next After Holding $3,300 Support\n\nTraders are deliberating whether to buy or short Ethereum price at $3,300 support. Unfortunately, there is no easy answer to the dilemma, especially with the Relative Strength Index (RSI) bouncing back to 42 after testing near oversold levels (30 and below).\n\nThe bullish outlook from the RSI alone may not be enough to call for immediate buy orders, but if ETH price closes the day above $3,300, stability could begin to return on the battered market.\n\nThe Money Flow Index (RSI) which tracks the flow of money in and out of Ethereum shows that buyers are regaining strength. As more people bet on the dips, the MFI climbs towards the overbought region. In turn, buying pressure will ignite a new uptrend, aiming for gains above $4,000.\n\nIndicators like the 200-day Exponential Moving Average (EMA), the 50-day EMA, and the 20-day EMA signal that the correction in Ethereum may be far from over.\n\nAttempts to recover to $4,000 must take place aggressively, otherwise, more losses will could leave a deteriorated technical structure, resulting in prices dropping to $3,000 in the short term and $2,500 in the medium term.\n\nIt is also worth keeping in mind that Ethereum price currently holds below the previous day open at $3,520. A break above this level in this session could imply that Ethereum starts the next session on Wednesday stronger, encouraging traders to keep buying instead of selling.\n\nThe most robust resistance lies between $3,739 and $3,839, as highlighted by the IOMAP model graphically prepared by IntoTheBlock. More ETH coins are experiencing unrealized losses compared to those in profit. Precisely, 4.46 million ETH roughly 34% are in the money and 8.7 million ETH approximately 8.7 million ETH are out of the money.\n\nSupport areas have shrunk significantly since the weekend as observed with the green circles on the chart. Therefore, investors must move strategically to ensure that they avoid falling into more traps.\n\nThe most solid support in the range between $2,832 and $2,932 represents 1.61 million addresses which purchased 1.32 million ETH at an average price of $2,887. This region will come in handy for the bulls if downward pressure overwhelms the demand at $3,300 and $3,300 causing a larger sell-off.\n\nOn the upside, for Ethereum to strongly flip bullish, the price has to break above the thick supply area highlighted between $3,739 and $3,839. FOMO may kick in as ETH climbs above $4,000 bringing the all-time high above $4,800 within reach.\n\nRelated Articles\n\nJohn Isige John is a seasoned crypto expert, renowned for his in-depth analysis and accurate price predictions in the digital asset market. As the Price Prediction Editor for Market Content at CoinGape Media, he is dedicated to delivering valuable insights on price trends and market forecasts. With his extensive experience in the crypto sphere, John has honed his skills in understanding on-chain data analytics, Non-Fungible Tokens (NFTs), Decentralized Finance (DeFi), Centralized Finance (CeFi), and the dynamic metaverse landscape. Through his steadfast reporting, John keeps his audience informed and equipped to navigate the ever-changing crypto market.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 79,
        "url": "https://news.google.com/rss/articles/CBMibEFVX3lxTE5wNjRhZkk4cVFLOFJQYnFGaFRHNUtxcEFFTjBmSFF2OVpaV3Z6V096WDhNbkk4Z19MS2xtUlctRjN1d0ZUcFVDajZDRjY3dG1NNVFjMGJOUUtNaDQ1Nzk1WHdEdXVZNjFlS0NSd9IBckFVX3lxTFByTmYzZS1rWEZiNFZRNHIybWx3eVNSODJPUFJpMTVEcGEwR1pzZTU0UWlRSWtnUjUtRDJ0U0NnaVllNnVjdEdYNmZjd1l1UkdHTmJRSFpHU1pMS0pmTFhkOTg0bWpFTG84VE9zaXRXUVE1Zw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "Ethereum Not A Security, SEC Unlikely To Succeed: A16z - Bitcoinist",
        "content": "The crypto industry finds itself at a pivotal juncture as the Swiss Ethereum Foundation received a “voluntary enquiry” from an undisclosed “state authority” which demanded confidentiality, as Bitcoinist reported yesterday. This revelation, made through the removal of the Warrant Canary from its website and a note in a Github repository, marks a first in the foundation’s history.\n\nA little later, a report by Forbes surfaced, claiming that the United States Securities and Exchange Commission (SEC) is the agency, trying to declare ETH as a security. This action comes in the wake of the SEC’s approval of Bitcoin ETFs in January and the looming mid-May deadline for spot ETH Exchange Traded Funds (ETFs).\n\nThe SEC’s inquiry seeks extensive documentation from US companies on their interactions with the Ethereum Foundation, particularly after Ethereum’s transition to a Proof of Stake (PoS) model. Seemingly, the SEC’s probe of the Ethereum Foundation aims to categorize Ether as a security, particularly after Ethereum’s transition to a PoS in September 2022.\n\nA16z SEC’s Security Probe Into Ethereum\n\nIn response to the SEC’s actions, Brian Quintenz, Global Head of Policy at Andreessen Horowitz (A16z), a leading venture capital firm with significant investments in the crypto space and $35 billion assets under management, has vocally opposed the SEC’s attempt. Quintenz, through a series of statements on X (formerly Twitter), laid out a cogent argument against the SEC’s probe.\n\nQuintenz stated, “Reminder: When the SEC allowed ETH Futures ETFs to trade on its regulated security exchanges, it explicitly acknowledged the status of the underlying, ETH, as being a non-security and outside of its jurisdiction.”\n\nHe further elaborated on the significance of the SEC’s decision post-Ethereum’s transition to a proof-of-stake (PoS) model, saying, “Importantly, this [futures] ETF approval decision in October 2023 occurred well after Ethereum changed to PoS in Sept of 2022; meaning that to the SEC, ETH, in its present state as of Oct 2023, was not a security.”\n\nQuintenz argues that any doubts regarding Ethereum’s regulatory treatment should have been resolved with the futures ETF approval, indicating a clear stance from the SEC that Ethereum does not fall under its jurisdiction as a security.\n\nHighlighting the potential contradictions in the SEC’s approach, Quintenz pointed out, “If the SEC had any doubt about the regulatory treatment of ETH in Oct 2023, it wouldn’t have approved the ETF. If ETH were in fact a security, then the CFTC-listed futures contracts (on which the ETFs were based) would be illegal, as any derivative on ETH would be considered security futures contracts and subject to different rules, listed on different exchanges and subject to joint SEC/CFTC jurisdiction.”\n\nCoinbase CLO Weighs In\n\nEchoing Quintenz’s sentiments, Paul Grewal, Coinbase Chief Legal Officer (CLO), reinforced Ethereum’s classification as a commodity rather than a security. Grewal took to X, articulating, “Millions of Americans hold ETH; it has been vital to crypto since its 2015 launch; and ETH is a commodity, not a security.”\n\nHe backed his argument with references to previous statements by SEC officials and the consistent position of the Commodity Futures Trading Commission (CFTC) and federal courts. Notably, Grewal argued, “Ex. C. And even very recently, the SEC’s trial lawyers continue to compare ETH to BTC,” indicating a longstanding regulatory perspective that diverges from the current SEC probe.\n\nThe crux of the argument against Ethereum’s classification as a security lies in the application of the Howey Test, a legal standard used to determine whether certain transactions qualify as investment contracts. Grewal contended, “Even if we were to apply Howey, ETH utterly fails that test, and nothing about the merge changes that conclusion.”\n\nSigh… again with the ETH misinformation as we await a decision on ETH ETPs. Ok–let’s talk about some basic facts about Ethereum. Millions of Americans hold ETH; it has been vital to crypto since its 2015 launch; and ETH is a commodity, not a security. 1/10 — paulgrewal.eth (@iampaulgrewal) March 20, 2024\n\nAt press time, ETH traded at $3,507.\n\nFeatured image created with DALL·E, chart from TradingView.com"
    },
    {
        "id": 80,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE5hc1ZxcndJRnVaaDRmamt6Y3BzVEY2RDAwaHZlRDlpTHBRSVJ6bGZfR0d4bFhyQjRRV3M2RVNDSEIxVUY3NnI2eDFvQU9obWszV2Z1dGJwSUNQdTI2c0hUYzlpcVJyWFVDckpIWmwwb3BXOTlBTlNmak5R0gGCAUFVX3lxTE8tUjVKQjBHTjJwTldzNHJ6VE1SdTVnUXlFXzNLSHRxOW5TN2gzT0ZnNWxlY3E5clZpNGJqdDUycVNvZ19BQW04eGlVYVRCZG1FcXY2TTRjdlNNcnBQcUZ1Z3pMWU8xcV9jVElGZXIxMlRzc3ZaMkM4Uk9GeHNUVHpsNkE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "Bitcoin and Ethereum See Red as Crypto Market Boom Turns to Gloom - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nMarkets are seeing red early Tuesday morning as Bitcoin drops 7% and Ethereum lags 10%.\n\nThe global crypto market cap has contracted by 8% since yesterday, having dropped below $2.5 trillion after last week getting within 5% of matching its all-time high market capitalization crypto markets last saw in early November 2021.\n\nAt the time of writing, the Bitcoin price is $63,142.39 after having briefly dropped below the $63,000 mark, according to CoinGecko data. It's been a rapid change of scenery for Bitcoin traders. BTC set a new all-time high by inching above $73,000 last week.\n\nAD\n\nAD\n\nEthereum has fared even worse than Bitcoin.\n\nEarly Tuesday morning, the Ethereum price was $3,230.05. That's a 10% drop since yesterday and 20% lower than it was this time last week, when the Ethereum community was ramping up for the Dencun upgrade to go live on mainnet.\n\nThe stark Bitcoin and Ethereum price drops mean that a lot of long positions opened by optimistic traders have been liquidated, according to CoinGlass. In the past day, more than $500 million worth of long and $100 million worth of short positions have been liquidated across digital asset contracts.\n\nWhen a trader opens a long position, it's essentially bet that an asset will increase in price by a certain date. Ideally for investors, they only sell the asset once they've realized some gains and want to take profit. But in extreme cases, an exchange or brokerage can force a trader to liquidate because the asset has seen a big drop in price.\n\nAD\n\nAD\n\nMeanwhile, many of the meme coins that were stealing the show a few weeks back have seen even larger losses. That's usually the case for meme coins. When the market's largest assets, like Bitcoin and Ethereum see price movement, memes can especially volatile and see outsized gains and losses.\n\nSolana meme coins Dogwifhat (WIF) and Bonk (BONK) have dropped 22% and 19% respectively in the past day. And Floki Inu (FLOKI), one of their Ethereum-based Shiba Inu-themed meme coin competitors, has shed 20% since yesterday.\n\nEven Jupiter, the Solana DEX that yesterday pledged to help out the Slerf presale buyers who just lost $10 million, has seen its JUP token drop 16% since this time on Monday."
    },
    {
        "id": 81,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE45Q2ZObGFXSkZWU2wzelg5akRTWTdiOVFLdG1hMjBSVUdZbWNxTzNvRVlwZmlFMC1Id0c4NTNCdjJWcjVqcUNBSTFSZDJDd0s3c0ZSbldwMGYwUWp5ajdxbXNhQnBra2s4UFZDRFQzWnNJV0I2c0RrdVhhLUTSAYIBQVVfeXFMUFRXcnpMZEMxMTMtTlYxZlllVGdGV3lHbHBoZTRXWlVBOUswYm43SEZkbTJsZWxGdmc5RDk3ems1ZlBVR3VlRE1XaDhwRWhnN2JCTWptXzQ4a0M1Q3BGbVJvaW9ucUI5Nk5KUFRZZHhhMTRlZURNMkNpbEtSWlFyTzZNZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "Crypto wallet providers urged to rethink security as criminals drain them of millions - The Register",
        "content": "Infosec researchers are noting rising cryptocurrency attacks and have encouraged wallet security providers to up their collective game.\n\nCheck Point specifically cites the growth of attacks that abuse Ethereum's CREATE2 opcode, dubbing it a \"critical issue in the blockchain community\" that's seeing millions of dollars worth of assets being drained from victims' wallets.\n\nIntroduced in 2019, CREATE2 is seen as a significant advancement for Ethereum, allowing for more efficient deployments of smart contracts – the technology that validates transactions on the blockchain.\n\nCREATE2 is also the function that's being exploited by attackers to drain tokens from victims' wallets.\n\nOne of its key capabilities is being able to deploy smart contracts to pre-determined addresses, making the entire process more predictable for the blockchain when dealing with multiple contract interactions across the ecosystem of decentralized applications.\n\nBy pre-determined, it means that an attacker can create temporary, single-use addresses to receive a victim's assets. New addresses can be used for each attack, and this is crucial because wallet security providers rely on previously held data to flag potentially malicious transactions. If the address has no dodgy history, it's likely the transaction will evade these detections.\n\nThe fact that attackers can set up a contract before deploying it (before it even exists), using a wallet address that doesn't have a history of malicious activity, means that if they can get the victim to approve a contract they can drain their funds.\n\nOf course, this requires some social engineering hijinkery to pull off, but we've all heard about the real-life scam stories that sound too wild to be true, but are. This attack works, and has facilitated huge single-transaction scams in recent times.\n\nThe researchers highlighted one fraud in January that saw attackers make off with $3.6 million worth of SuperVerse tokens in one fell swoop as an example of how serious these incidents can be for victims.\n\nRemember: with blockchains, there is no legal recourse and no customer helpline to recover funds. Once they're sent and signed, that's it – tokens are gone for good.\n\nHow they work and why they work\n\nThe attack flow is as follows. First, an attacker needs to get a victim to approve a contract that hasn't yet been deployed – the bit that requires social engineering. They then use CREATE2's ability to generate new contract addresses to receive the funds and deploy the malicious contract, complete with the victim's authorization, in turn draining the victim's wallet.\n\nThe key part here is the generation of a new wallet address, one that has no history of being reported for criminal intentions. CREATE2 generates this using a calculation that includes four parameters: the attacker's wallet address, a constant prefix, a salt, and an initialization code.\n\nThis address will be created only when the victim approves the contract, meaning it's never been used before for any illicit dealings, and won't be used again, thereby bypassing the security protections that usually monitor such transactions.\n\n\"The exploitation of the CREATE2 function underscores the continuous battle between innovation and security in the blockchain sphere,\" said Check Point researchers Oded Vanunu, Dikla Barda, and Roman Zaikin.\n\n\"As Ethereum continues to evolve, so too must the security mechanisms designed to protect users from such sophisticated attacks. Awareness and education are the first steps in safeguarding digital assets against emerging threats. Blockchain developers and users alike must remain vigilant, continuously updating their knowledge and security practices to navigate this ever-changing landscape securely.\n\n\"This vulnerability highlights the need for enhanced security measures in wallet security products to adapt to the evolving tactics of cybercriminals, ensuring the safekeeping of digital assets in the face of innovative exploits.\"\n\nThe big business of crypto attacks\n\nTowards the back end of 2023, we saw a string of high-profile wallet-draining attacks netting cybercriminals hefty sums, and the attacks weren't localized to just the Ethereum blockchain either.\n\nJustin Sun, founder of the Tron Foundation and owner of Poloniex, a crypto exchange that was drained of circa $120 million in November, offered a reward for the attackers at the time to return the funds they stole.\n\nThe Monero Project was also mysteriously drained of nearly half a million dollars just days before, and 5,000 Atomic Wallet users were drained earlier in the year – just a few of the high-profile incidents that took place in 2023.\n\nWhile not all of these have been directly attributed to CREATE2 exploits, researchers told The Register that it seems like North Korea's state-sponsored Lazarus gang may have been behind a sizable proportion of them.\n\nThe web3 anti-scam solution provider ScamSniffer analyzed a series of CREATE2 incidents between May and November 2023, concluding that almost $60 million had been stolen from around 99,000 victims. ®"
    },
    {
        "id": 85,
        "url": "https://news.google.com/rss/articles/CBMibkFVX3lxTE5LZVdaSTViNHVsSUlidXNLbGZqelJYM0MxUFQtNHdLSU9aRkxwbTJoSlZ0bHFXaWd1ZHJwR053UGt0UzkxVDUxSUloY1FHQjFzX3NrdmRFXzl2RWdBR2Y0ckp4aGdsLVFkYmJvbll30gFzQVVfeXFMTlJqa1hyemI4U2I3Vi1tTW1TbDJYRXNmRFplZjZyMnZGR05YNlg1UW1wWFVrZDBLU3M2TFJaaUV1dlVHb1RHMDBTd0VCN1oxamdpb2xtV3d4Q3VtSnRsNXY0Mzh2d21LZUJ4ZUNzaWdnd3Vidw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "Ethereum price prediction and strategy for a $4K comeback - AMBCrypto News",
        "content": "A close above $3,700 could help the price back to $4,000.\n\nThe Pi Cycle Top indicator revealed that the ETH might rally.\n\nEthereum [ETH] seemed to have become a shadow of its former self after the price collapsed from $3,633 to $3,22o in the last 24 hours.\n\nDespite the decline, AMBCrypto agrees that the value of the altcoin might retest $4,000. However, this prediction might not come cheap or easy.\n\nThis is because of the number of addresses that accumulated ETH around $3,700. This has made it a key resistance zone.\n\nAccording to IntoTheBlock, ETH’s previous rise above $4,000 placed 89% of its holders in profit.\n\nWho decided what’s next?\n\nHowever, the recent decline meant that there was a sell wall at $3,700 where 991,000 ETH addresses purchased 4.35 million coins.\n\nWith ETH trading below the region, the holders have an opportunity to break even if the price climbs.\n\nIf the participants decide to book profits, the altcoin might find it challenging to revisit the psychological $4,000 mark.\n\nOn the other hand, if buying pressure outweighs the on-chain sell volume, then ETH might cruise above $3,700.\n\nBut whether the cryptocurrency would continue to languish in the red does not depend on the on-chain outlook alone.\n\nTherefore, AMBCrypto gauged the price action from a technical perspective. According to the 4-hour ETH/USD chart, the Exponential Moving Average (EMA) depicted a short-term bearish trend for the altcoin.\n\nAt press time, the 20 EMA (blue) crossed below the 50 EMA (yellow). With this trend, the price of the cryptocurrency might drop by another 7.30%. Should this happen, the value could hit $3,112.\n\nA look at the Aroon Indicator also reinforced the bearish bias. As of this writing, the Aroon Down (blue) was 100% while the Aroon Up (orange) was 35.71%. This indicates that sellers were in control of the price action.\n\nETH is oversold\n\nFurthermore, an assessment of the Supertrend indicated that ETH has not yet flashed a buy signal. But there was an earlier sell signal at $3,780.\n\nMeanwhile, the Relative Strength Index (RSI) was in the oversold region. If the reading continues to decrease, then the chances of a harder bounce might also increase.\n\nIn a highly bullish case, ETH might climb to $4,500 when the market turbulence fizzles.\n\nWhile the short-term outlook looked gloomy for ETH, the Pi Cycle Top indicated otherwise for the mid to long-term.\n\nHistorically, the indicator tells when a cryptocurrency is close to the bottom or has hit the market top.\n\nHow much are 1,10,100 ETHs worth today?\n\nIf the 111-day moving average (MA), in green hits the same region as the 350-day MA (purple), then Ethereum would have hit the top of this cycle.\n\nBut that was not the case, as the 111-day MA was lower than its opposite number. Thus, the price of ETH might have a lot of upside potential over the forthcoming months."
    },
    {
        "id": 89,
        "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE9FeUgzbVQwcWdveHdOSjFCbFI2MDlUTGsxbG11WHZPMno4RWFIa2dzMDdKVExiMFd4R0kyaWpTalA2Y0FkcVFraUUyb2pjZldEdWZxeUcwdWZJSzFTYU9vRG9uN2FxTl9EZTk2UkotUXREWmF2WnfSAXtBVV95cUxQQ0NoUmx1RjhFSEsyN2tHR0F6dDFoSU5DcjRNcEhWVF9OLTZPZTdnQ2RSc09Wa2ZzYk5YN0RsWUd1VWExLWQ0eF9PazdQc244OVdKUzlIM0xtMnZFRGVsR1JCS2YzZnRucFJZNVo0QnpySjdfSmxPVzBOdFk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "Ethereum Welcomes BlackRock's Yield-Bearing Stablecoin - Bitcoinist",
        "content": "On Wednesday, BlackRock, the world’s largest asset manager, announced the launch of its first tokenized fund on the Ethereum blockchain, marking a significant stride in bridging the gap between traditional finance and digital assets. The BlackRock USD Institutional Digital Liquidity Fund, known as BUIDL, aims to provide qualified investors with US dollar yields through blockchain technology.\n\nBlackRock Chooses Ethereum\n\nAccording to Robert Mitchnick, BlackRock’s Head of Digital Assets, the introduction of BUIDL is a continuation of the firm’s commitment to innovation within the digital assets space. “This is the latest progression of our digital assets strategy,” Mitchnick stated, highlighting the goal of developing solutions that address real-world client needs while expressing enthusiasm for the collaboration with Securitize.\n\nSecuritize is proud to announce we have partnered with @BlackRock. Together, we’re launching BlackRock USD Institutional Digital Liquidity Fund (BUIDL). BUIDL will provide investors with the opportunity to earn U.S. dollar yields by subscribing to the fund with Securitize… pic.twitter.com/nDsNehOXJU — Securitize (@Securitize) March 20, 2024\n\nTokenization is at the heart of BlackRock’s digital asset strategy, with BUIDL enabling the issuance and trading of ownership on the Ethereum blockchain. This approach not only widens access to on-chain offerings but also ensures instantaneous and transparent settlement, along with interoperability across platforms, courtesy of BNY Mellon.\n\nCarlos Domingo, co-founder and CEO of Securitize, emphasized the transformative potential of tokenization in capital markets, noting, “Today’s news demonstrates that traditional financial products are being made more accessible through digitization.”\n\nBUIDL is designed to maintain a stable value of $1 per token, distributing daily accrued dividends directly to investors’ wallets as new tokens each month. The fund primarily invests in cash, US Treasury bills, and repurchase agreements, ensuring a secure yield for token holders on the blockchain.\n\nMoreover, the ecosystem for BUIDL includes prestigious names like Anchorage Digital Bank NA, BitGo, Coinbase, and Fireblocks, setting a solid foundation for the fund’s operations.\n\nThe strategic collaboration extends beyond product launch, with BlackRock making a strategic investment in Securitize and appointing Joseph Chalom, its Global Head of Strategic Ecosystem Partnerships, to Securitize’s Board of Directors.\n\nThis initiative represents a critical juncture in the evolution of digital assets, signaling the increasing integration of blockchain technology with traditional financial instruments. The fund’s tokenized structure offers a glimpse into the future of investment, where accessibility, transparency, and efficiency reign supreme.\n\nEthereum Community Rejoices Euphorically\n\nReactions from the Ethereum community have been overwhelmingly positive, with industry figures like Anthony Sassano and Ryan Berckmans citing the launch as a bullish signal for both Ethereum and the broader crypto market.\n\nSassano, founder of the The Daily Gwei, remarked, “BlackRock launching a yield-bearing stablecoin on Ethereum is still one of the most bullish things to ever happen in crypto and the market has definitely not digested this yet,” underscoring the significant impact of such a move.\n\nRyan Berckmans stated, “BUIDL seeks to offer a stable value of $1 per token and pays daily accrued dividends directly to investors’ wallets as new tokens each month. I hadn’t realized that BlackRock launched *a yield-bearing stablecoin* on ETH. Yield-bearing stables are apex products. Very bullish.”\n\nSeraphim Czecker, head of growth at Ethena Labs added his excitement, stating, “Freaking Blackrock launched a yield bearing stablecoin and you’re not bullish on crypto. We have come a long way.”\n\nAt press time, ETH traded at $3,549.\n\nFeatured image from DW, chart from TradingView.com"
    },
    {
        "id": 91,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxOUEUwUFlpU00tZ1gwMmVObTg3ZXQwTEtuQlRxQXJoYnQ2c2Y3Nm1QNHBRSkVYZzFHTF9vTTJWRUNPUmNiajFDVXI0aW5IUVptbW1rMUthX0Z3UFJhVmJwbE9weWxFSy1fZi0wcXN1WTNxN010RmsxblpkM0NDcHlmaGM5ZVJsQld3UHlFX2RoVFI4VVph0gGaAUFVX3lxTFA3Xzh0NzZncEIySzI4cGlNQXZCUGVXR0o2UnlGUUl5eDMyZThfWXJ0MEthWVRCY2Ffa2U1NlNLMjJJWG1ZVlc1MHRpNkFjNGp3aXhWY3A5VXVzUVZjQk5mN0xibTdnZEhNUjREQWItRHhaamxMcDZ5Q0c1RHZyZ0d4TnZYRENsT0ZpdUppMHIzTjBFcWV1MjY5MHc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "Solana a better version of Ethereum? Arthur Hayes has this to say… - AMBCrypto News",
        "content": "Solana’s recent performance has revived the old ‘Ethereum-killer’ debate again\n\nComparisons arose after SOL flipped BNB recently\n\nThe Ethereum vs Solana debate took a renewed twist in the third week of March after Solana hit crucial milestones.\n\nFor starters, Solana’s [SOL] search interest on Google Trends surpassed Ethereum [ETH]. This indicates a spike in retail attention to SOL compared to ETH.\n\nAdditionally, SOL flipped BNB based on market cap and climbed into the top 3 in the DeFi ranking.\n\nCrypto influencer Anthony Pompliano recently interviewed Arthur Hayes, a serial investor, co-founder, and former CEO of BitMEX.\n\n\n\nHe asked for his thoughts on the ETH vs. SOL debate, and Hayes offered his candid opinion.\n\n“I don’t think anything is going to be ETH.”\n\n\n\nHowever, he added that Ethereum is the home of DeFi and hosts most of the first versions of dApps (decentralized applications) before they launch on other networks.\n\n“If you think of primitives of DeFi and dApps, the first version is always on Ethereum. It’s not on Solana, AVAX, Cardano, or any other blockchains.”\n\nHowever, Hayes highlighted why DeFi applications might migrate to other networks like Solana.\n\n“Maybe there are reasons like network bloat, gas fees; then they move over to Solana or other chains.”\n\nHe added,\n\n“But you’re not seeing a new primitive emerge on a non-ETH chain first. If I start seeing that happen, I may have to change my mind on my maximalist position on ETH.”\n\nSolana is great if you “missed” discounted ETH\n\nInterestingly, Hayes confirmed that he trades most L1s but categorically highlighted Solana as a great opportunity for anyone who missed cheap ETH.\n\n“Solana is a better version of ETH; I disagree, but that’s what they believe. It could trade to $5K-$10K in this cycle. So buying it at $140 is a great asymmetric risk profile.\n\nAdditionally, he highlighted Solana’s UX/UI as the best in the ecosystem and easy to use. Hayes believes these conditions could make Solana the best performer in this cycle.\n\n"
    },
    {
        "id": 92,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxPR1VZd2xMNXh6SzdudHZDYno2bmh1UU9vOTIybjNpYUM3eU1XY3pYQW9ZWlRqTWFHUVlhczdsc2QwUEdVSmVtdkFyTUJ2d3FFclZZMU1BTFU5NmtydW9sREVLaWFONWVWVGFhWTZ3ZFIxSGUzemE0Q2ZrMDNUb0c2Wm94bDRLdU1KTHJPektoazE4bUNuSjJz0gGcAUFVX3lxTE5TVEZ4QlBOcUgtOC0tTUp2Nm5rRnIxSEFZM1A4ZjZ0X3U0aF9uWndFLWNMdXdqdU02US1TdFVRbDZUcWVmV1ZPcG93djIzMlVPZm5KeVNwWEpzLVRSSWw2Z1ZMMUY1cTlFMVdqajFrQkVOWWd1WmV5WDNkTzFWaWlnd3dYZEtiUjh2LUZlc3FKSmNrVnJiQWcycVdGZA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "Ethereum ETF: SEC hits pause again, is a May launch possible? - AMBCrypto News",
        "content": "SEC’s latest delay announcement has spurred some degree of skepticism\n\nExperts are now revising the odds of an Ethereum spot ETF being approved\n\nThe United States (US) Securities and Exchange Commission (SEC) has pushed back its verdict on the proposed Ethereum [ETH] exchange-traded funds (ETFs) by Hashdex and ARK 21Shares.\n\nThis delay, announced on the 19th of March, precedes the “third deadline” set by the agency, with final determinations anticipated in late May. The announcement underscored that ARK 21Shares’ decision is due by 24th May, with Hashdex’s deadline set for 30th May.\n\nHowever, analysts harbor growing skepticism regarding the approval likelihood of the eight Ether ETF proposals, including those from BlackRock, Grayscale, and Fidelity.\n\nEther ETF approval uncertainties\n\nBloomberg ETF analyst James Seyffart voiced apprehensions regarding the minimal interaction between the SEC and the applicants, raising uncertainties about the future of these ETFs.\n\nHe noted,\n\n“My cautiously optimistic attitude for ETH ETFs has changed from recent months. We now believe these will ultimately be denied May 23rd for this round.\n\nHe further added,\n\n“The SEC hasn’t engaged with issuers on Ethereum specifics. Exact opposite of #Bitcoin ETFs this fall.”\n\nIn recent developments, Eric Balchunas, an analyst at Bloomberg ETF, revised the chances of Ether ETF approval from 50% to 35% and noted,\n\n“I get all the reasons they SHOULD approve it (and we personally believe they should) but all the signs/sources that were making us bullish 2.5mo out for btc spot are not there this time.”\n\nThis highlights the sharp contrast between the Ether ETF and previous Bitcoin ETF approval processes, reflecting the SEC’s minimal communication. Public sentiment mirrored this, with Polymarket odds for Ether ETF approval dropping from 77% in January to 32% by May.\n\nBitcoin ETF vs Ethereum ETF\n\nFurthermore, Grayscale is considering adding staking to its Ether ETF application, outlining proposals in a “consent solicitation statement” to investors.\n\nThe statement highlighted,\n\n“This proposal will allow the Sponsor to cause the Trust […] to use, or permit to be used, any Ethereum held by the Trust in a proof-of-stake validation protocol in exchange for consideration of any kind for the ultimate benefit of ETHE shareholders.”\n\nThis highlights that Grayscale aims to ease inflationary pressures through staking, pending shareholder approval. If approved, Grayscale would align with ARK 21Shares, Franklin Templeton, and Fidelity, who recently integrated Ether staking into their ETF applications.\n\nOverall, it would be interesting to observe the contrast as the SEC greenlighted ether futures-like ETFs but hasn’t approved spot or mixed ether ETFs, unlike Bitcoin ETFs last fall."
    },
    {
        "id": 93,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxNWXBfbS1Md2ZPYl9qSmhXblZtczJ4M0ZkYV9ydW5JU0NqYklFN0U3RkNPNEpyMWE1dXhxQVplZ1hXa1hxajJWb21DN2UyejBOUkpWYjdSR2QyTjR1eDhMQkNtc19JSkZJM3pFaENkSFk5NzBfTkZFalVSV3VEc2Z2LUJjcG5VLUZmRk9WdEtFYw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "BlackRock chooses Ethereum for their tokenised investment fund - City A.M.",
        "content": "BlackRock chooses Ethereum for their tokenised investment fund\n\nTuesday was another record day for the Bitcoin ETFs. This time, it was a new record in terms of outflows, with $326 million leaving the Bitcoin invested funds. Not even BlackRock’s IBIT could save the day with inflows of only $75 million. But, even with the market cratering, it wasn’t all bad news. BlackRock’s SEC filing of their USD Institutional Digital Liquidity Fund to invest in tokenised assets was a reminder how much more money can potentially flow into crypto.\n\nEach day, Coinrule will run through the state of the digital assets market for Blockbeat, your home for news, analysis, opinion and commentary on blockchain and digital assets.\n\nTuesday was another record day for the Bitcoin ETFs. This time, it was a new record in terms of outflows, with $326 million leaving the Bitcoin invested funds. Not even BlackRock’s IBIT could save the day with inflows of only $75 million. But, even with the market cratering, it wasn’t all bad news. BlackRock’s SEC filing of their USD Institutional Digital Liquidity Fund to invest in tokenised assets was a reminder how much more money can potentially flow into crypto.\n\nLarry Fink previously stated he saw value in an Ethereum ETF, but it will just be a “stepping stone towards tokenisation.” It seems like he truly meant it. Last Thursday, BlackRock submitted a filing to the SEC for their USD Institutional Digital Liquidity Fund, called BUIDL. The fund will invest in tokenised assets on the Ethereum blockchain, using Securitize as their broker. Market participants discovered the fund’s on-chain wallet has $100 million of USDC ready to invest. Since the wallet became public knowledge, it has received an assortment of tokens. The deposits are an interesting form of marketing, with all eyes watching the BUIDL wallet.\n\nThe creation of the fund is a big deal in further legitimising crypto as an asset class to invest in. Since the ETFs, Bitcoin is increasingly accepted as a store-of-value alternative to gold by traditional investors and as a first step into the crypto world. The next step would be to introduce investing in other “Layer 1” blockchains, such as Ethereum or Solana. What BUIDL could potentially enable is step 3. This is investing in assets built on top of Layer 1s, with Ethereum being the obvious first choice.\n\nRight now, information on where exactly investments will go within the Ethereum ecosystem is not available. But, the fund has made it clear, BlackRock is betting on Ethereum, with the chain being able to cater to their tastes. According to DefiLlama, Ethereum has over 55% of the total value locked across all chains with nearly $50 billion. The vast majority of tokens with potential use cases are also launched on Ethereum with the Layer 1 having over 1,000. It is becoming more obvious that this will be the place institutions first dip their toes; either by investing in assets, or using DeFi applications.\n\nWith BlackRock’s nearly perfect ETF approval record and the recent launch of BUIDL on Ethereum, is this an indication there is still hope for the ETF approval deadline in May? T-minus 63 days until we find out."
    },
    {
        "id": 94,
        "url": "https://news.google.com/rss/articles/CBMiU0FVX3lxTE5Pd1RTMVZlQUdGRVlpVGE3bFhjZ3FNQ1dyVlU3enQ3dGYtUXg2V0tRNDJ0MWpqNjhKWGhab2toYWVBZVVYWGc3SjR2Sm9BWHVkVXVn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Mar 2024 07:00:00 GMT",
        "title": "What is EtherFi? A new approach to Ethereum staking - OKX",
        "content": "EtherFi is a decentralized, non-custodial liquid staking platform that brings positive disruption to DeFi by allowing staking on Ethereum. The protocol offers a host of unique features, including its use of NFTs for validators and integration with EigenLayer for added yields.\n\nRead on to explore EtherFi in detail, including its key features, how it enhances decentralization for Ethereum, the project's roadmap, and more.\n\nTL;DR\n\nEtherFi disrupts DeFi by implementing non-custodial Ethereum staking, granting users full control.\n\nBy incorporating EigenLayer, the protocol increases rewards and boosts the value of DeFi by supporting simpler restaking.\n\nThe introduction of eETH, the project's native token, represents significant progress, streamlining the staking process through automatic restaking and various benefits.\n\nEtherFi's impressive $23 million Series A funding spotlights its fast expansion and strong investor support.\n\nEtherFi's roadmap outlines its future development, including achievements such as implementing DAO governance and improving the accessibility and security of Ethereum.\n\nWhat is EtherFi?\n\nEtherFi stands out in the DeFi space as a liquid staking platform on Ethereum. It introduces an innovative approach by allowing users to stake ETH and earn rewards, while emphasizing a non-custodial framework where users maintain control over their keys.\n\nOne of EtherFi's distinctive features is the development of a non-fungible token (NFT) for every validator participating in the staking procedure. This strengthens the safety and independence of stakers within the system.\n\nEtherFi's operations include integration with EigenLayer, which allows for additional yield earning on top of Ethereum's staking rewards. This integration allows users to engage in restaking without locking up their assets, providing flexibility to those interested in restaking.\n\nThe platform's native token, eETH, complements EtherFi's governance token by enabling users to directly manage the staking and restaking processes. The introduction of eETH has attracted considerable interest for the advancements it brings to the staking industry through its focus on the user, and its unique offerings. These include automatic restaking and the ability to earn rewards from EtherFi and EigenLayer. EtherFi's offering simplifies the staking process and enriches the user experience by offering additional incentives.\n\nEtherFi's robust growth is underscored by its recent $23 million Series A funding round, highlighting the confidence in and support for the project from leading crypto investors. EtherFi's success in liquid restaking has significantly impacted the DeFi scene, as demonstrated by its recent financial milestone. The platform's growth in Total Value Locked (TVL) and its increasing number of users demonstrate the effectiveness of its strategy and the rising desire for decentralized financial options that give users more control.\n\nHow does EtherFi enhance Ethereum's decentralization?\n\nEtherFi enables users to securely stake Ethereum through Operation Solo Staker, promoting a non-custodial approach. The operation allows anyone to run nodes via two 'paths'. Path 1 is permissionless, requires a 2 ETH bond to be put forward, and uses distributed validator technology (DVT) to allow stakers to validate and secure the blockchain. Path 2 sees stakers make a commitment to operate a node for two years and solo stake using DVT but without the need for a bond.\n\nBy making non-custodial staking easier for everyone, whether they're new to Ethereum or have been involved for a while, and dispersing network functions among numerous individuals without depending on intermediary institutions, EtherFi contributes to deeper decentralization for Ethereum.\n\nThe technical structure of EtherFi was specifically created to support a decentralized staking environment. Node operators can enter their public keys through smart contracts, and stakers can select operators to oversee validator nodes.\n\nAn auction system determines the allocation of staking opportunities to operators for greater fairness and transparency in network participation. Additionally, EtherFi offers unique features such as eETH, a liquid staking derivative token, and T-NFT and B-NFT tokens, which offer incentives and flexibility to stakers and node operators. EtherFi also introduces innovative features like eETH, a liquid staking derivative token, and T-NFT and B-NFT tokens, providing flexibility and incentives for stakers and node operators.\n\nApart from its technical achievements, EtherFi has promoted innovation and growth in Ethereum's ecosystem through its service layer, which provides a foundation for others to build out new services from. This not only encourages the creation of new applications and services but also provides a platform for growth and expansion within the Ethereum community.\n\nWhat are the key features of eETH in EtherFi?\n\nAmong its many features, EtherFi has attracted attention for its non-custodial nature, automatic restaking feature, and partnership with EigenLayer for additional rewards.\n\nAutomatic restaking\n\nThe eETH platform has implemented an automatic restaking feature that allows Ethereum staked on the platform to generate extra rewards. By integrating with EigenLayer, EtherFi allows users to validate various software modules beyond the base layer of Ethereum, increasing their potential earnings.\n\nT-NFT and B-NFT for enhanced security\n\nEtherFi's staking method stands out due to its implementation of T-NFT (transferable non-fungible token) and B-NFT (bound non-fungible token). These tokens serve as proof of ownership for staked ETH and play an important role in the safe exchange of validator keys with node operators. The B-NFT is specifically linked to the person holding the validator key, guaranteeing a strong level of security and responsibility.\n\nLiquidity pool and eETH mechanics\n\neETH functions as a rebasing ERC-20 token in a liquidity pool mechanism. This makes sure that an individual's eETH holdings will adjust proportionally to their share of EtherFi's overall Ethereum control. The protocol heavily depends on the liquidity pool, which enables issuing and burning of eETH and T-NFTs for delegated staking.\n\nPermissionless withdrawals and rewards\n\nEtherFi enables unrestricted withdrawals, providing the ability to skim partial rewards and fully unstake without relying on external authorization. This functionality is especially noteworthy in light of Ethereum's recent updates, which give stakers greater control over accessing their rewards and initial funds. This ability promotes fluidity and adaptability in the staking community.\n\nNon-custodial staking\n\nEtherFi empowers users by allowing them to maintain control of their keys. This helps users to stake with confidence as they have complete ownership and control of their assets without relying on outside parties. This method significantly decreases the risk of counterparty involvement with node operators and protocols.\n\nHow does EtherFi's eETH work with EigenLayer for additional yields?\n\nThe introduction of EtherFi's eETH has significantly progressed the liquid staking tokens (LSTs) field by providing a non-custodial staking option that seamlessly incorporates EigenLayer, resulting in improved yield possibilities. Here's how eETH functions within this system to generate extra yields.\n\nLiquid staking and restaking\n\nWith eETH, EtherFi users can stake Ethereum and get eETH tokens. These tokens can be automatically restaked on EigenLayer, allowing users to earn Ethereum staking rewards and additional yields without running their own node. This sets eETH apart from other LSTs, as it provides access to restaking yields through EigenLayer, increasing the potential earnings for its holders.\n\nIntegration with EigenLayer\n\nEigenLayer enhances the Ethereum staking layer's capabilities by applying actively validated service (AVS) modules to verify non-EVM code. This allows individuals with staking and LST holdings, including eETH, to generate extra income by validating applications and services outside of Ethereum's main functions.\n\nSecurity and control\n\nA key aspect of eETH is its focus on security and giving users control. EtherFi uses sharding in its technical design to guarantee that stakers maintain authority over their keys — a major deviation from the usual method of node operators generating the keys. This strategy reduces the chances of risk from other parties and reinforces the non-custodial aspect of eETH staking.\n\nRisks and considerations\n\nAlthough the combination of eETH and EigenLayer offers attractive returns, it's important to recognize the potential risks involved in staking. These include the possibility of flaws in smart contracts and the potential for penalties if an AVS operator misbehaves or validation is unsuccessful. EtherFi has pledged to apply protocol governance when deciding which services to back, to minimize these risks for its users.\n\nWhat is the EtherFi roadmap and its milestones?\n\nEtherFi's was launched to meet developers' needs for a secure, decentralized staking protocol that emphasizes user control and self-custody.\n\nImportant achievements include:\n\nEffectively implementing EtherFi's decentralized platform.\n\nEnabling individuals to stake their ETH in increments of 32 validators through trusted node operators.\n\nPartnering with Obol Labs to incorporate solo node operators.\n\nA significant milestone was the launch of eETH, EtherFi's liquid staking token, which allows for fully permissionless participation in Ethereum staking. The launch helped achieve two major objectives of the project: enhancing liquidity and improving accessibility in the DeFi space.\n\nThe EtherFi roadmap demonstrates the importance of open-source values to the project. EtherFi intends to release its software services and code to the public, promoting transparency while building trust within the community.\n\nEtherFi is also preparing to integrate DVT phase 2, which will create a completely automated process for individual staking and promote Ethereum's more decentralized staking environment. The plan includes implementing DAO governance and a token generation event to establish a collective governance structure that guarantees the protocol's sustainability and flexibility.\n\nThe final word\n\nEtherFi stands out in DeFi by offering non-custodial Ethereum staking, giving users control over their keys. Its integration with EigenLayer allows for extra yields through restaking, increasing its value in the DeFi space.\n\nEtherFi's liquid staking token, eETH, simplifies staking and provides rewards from both EtherFi and EigenLayer. A successful $23 million Series A funding round highlighted the platform's growth and showed strong investor confidence in the project's future.\n\nMany expect further developments for EtherFi, particularly as its roadmap emphasizes innovation, with stand-out milestones including the eETH launch, solo node operator integration, and plans for DAO governance. These developments all aim to make Ethereum staking more accessible and secure for a broader audience."
    },
    {
        "id": 96,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxOM0FCdXo5QUJfSnNhWUJVZXNGeGV4RVp4WnVlNWtkVDVjSGFsQnV1ZXpCRjVvZXJaei10SXFBT1h1TmJOUFBtOGkySXVmaFZqNlZ6c2l1QkY5bDhqOVl2VUFiQmZYXzQ5VGtISWxsdjV6VDVLOFgwSVdRb0gwblJJSkdVNmIyaHhDOGNRRNIBkgFBVV95cUxQb0MyNzZ0MDNJWGdXOXU0czRBMGtuOFFnTE8wSmJTUE5ZVlJCVF8tU1Q2Skk0OTQwN0JNM2F6aUJjZVlEQkZRVXpLQnhGTUtxNF96T3dhZi1VRENCd2dCazctLVIyMXpIUHpBWDZnOU9EWjViZDRhaUJVWlZXZEotVW43RkJlODZPOUthOVUxa1F3dw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "Bitcoin-based collections have an edge over Ethereum NFTs – Here’s why - AMBCrypto News",
        "content": "NodeMonkes logged the second-highest sales volume in the last 24 hours.\n\nBitcoin was the top-ranked chain in NFT sales over the last week.\n\nThe non-fungible token [NFT] market has been known for its ebbs and flows through its brief history, with exciting projects popping up at different stages to pique the interest of enthusiasts.\n\nNodeMonkes makes waves\n\nThe latest sensation happened to be Bitcoin [BTC]-based NodeMonkes.\n\nAs per AMBCrypto’s analysis of CoinGecko’s data, its floor price surged by over 50% in the last 24 hours, propelling it to become the second-largest NFT collection at press time.\n\nA floor price is the lowest price that an NFT can be sold for. In recent years, it has become the gold standard for evaluating the growth of a collection. The higher the floor price, the better.\n\nAs of this writing, NodeMonkes’ floor price was 0.82 BTC, worth over $55k, placed just below the blue-chip powerhouse, CryptoPunks, whose floor price was above $177k.\n\nThe highlight of the surge was how NodeMonkes surpassed the other giant, Bored Ape Yacht Club [BAYC].\n\nThe Bitcoin-based collection also logged the second-highest sales volume in the last 24 hours, totaling over $4 million. This represented a jump of 106%.\n\nA product of the now-popular Ordinals technology, NodeMonkes are a collection of 10,000 unique monkey-inspired digital artworks.\n\nThe NFT grabbed the attention of the market earlier this month, when one of its sales topped $1 million.\n\nNote that this sale came alongside a sharp uptick in Bitcoin’s price, which likely contributed to the USD figure.\n\nOrdinals power Bitcoin’s NFT ecosystem\n\nBut NodeMonkes wasn’t the only Ordinals-based collection making waves in the market.\n\nRunestone, a project led by Ordinals developer Leonidas, saw a 40% spike in its floor price in the last 24 hours to top 0.04 BTC.\n\nThe success of these collections reflected a paradigm shift in the broader NFT landscape.\n\nEthereum [ETH] NFTs have dominated this sector ever since they burst onto the scene in 2021.\n\nRead Bitcoin’s [BTC] Price Prediction 2024-25\n\nHowever, the introduction of Ordinals has altered the dynamics significantly, causing Bitcoin to become the most-favored network for NFT transactions.\n\nAccording to AMBCrypto’s analysis of CryptoSlam’s data, Bitcoin was the numero uno chain in NFT sales in the last week, followed by Ethereum and Solana [SOL]."
    }
]