[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPVmZhbUxOX2FpVEUwcWFTMkZVbE84NnpfSGxCRDlLd0VOT1dqVHZDMnhCc25lNGdiVXdLT0tQcWc5OV8tR0xSWXZIWk5pNUVaVk55UFY1WU5RN2dDbHFqbUp0SlU2TFhIUHNPM1RYaF9NMkdjRVdvOXdTM0d3Vi1YNExKWmFPMDRGbXN4Tk9zazRndjljUmJPXw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Apr 2024 07:00:00 GMT",
        "title": "3 Reasons Why I Sold Ethereum and Never Looked Back - The Motley Fool",
        "content": "The coin's potential has been very slow to materialize.\n\nA few weeks ago I decided to offload the vast majority of my Ethereum (ETH -1.13%) tokens after holding and accumulating them over the last few years. I don't expect to buy more anytime soon, even if the price drops to attractive levels.\n\nHere's why.\n\n1. The coin's price surpassed the target level in my investing plan\n\nThe biggest reason I decided to sell nearly all of my Ethereum was that its price was above the level that I had identified as my sell point.\n\nI first started to accumulate Ethereum in mid-2020. Per my initial investing plan, I did not set a price target for a sale at the time, opting instead to reassess the issue after roughly three years had elapsed. I continued to dollar-cost average (DCA) and build up my position through roughly the middle of 2023, after which I set a firmer target and stopped buying more.\n\nI resolved to think strongly about selling after the price hit somewhere above $3,000 per token, a level the coin had surpassed in at least three of the periods I'd held it, as shown in this chart:\n\nWhen the coin broke through that price level this year, it was only a matter of time. It's entirely possible that my sale will mean that I'll be missing out on the coin's future growth. But because of the next reason we'll discuss, I won't be losing any sleep over it.\n\n2. Transaction fees were too high, and not improving by enough over time\n\nTransaction fees, known as gas fees, are perennially high on the Ethereum chain. To transact, you'll need to cough up anywhere from $5 to $80 or more, depending on the day. And despite many repeated promises from the chain's developers regarding a permanent decline of gas fees, they have remained stubbornly and painfully high for years on end.\n\nI don't day trade in and out of my cryptocurrencies, so it might seem as though it's hyperbole to complain about the infrequent transaction costs associated with building up a position. But remember, my strategy was to dollar-cost average. Making a series of purchases entailed paying gas fees on the order of $600 in total -- way too much given the relatively small size of my position and my investments.\n\nWhat's more, the thing I kept noticing again and again over the years of my holding was that the high fees were discouraging my friends from buying Ethereum as an investment or trying to use it to interact with decentralized applications (dApps) and decentralized finance (DeFi) services. Noticeable commission costs are practically extinct for most retail investors trading stocks, so the expectation that people often have is that the same will be true in cryptocurrency.\n\nAfter a while, I stopped touting the coin as an investment because I wanted to avoid the subsequent conversations about how high the gas fees were. Ultimately I recognized that behavior in myself, and it was an unambiguous sign that it was time to sell.\n\n3. It's in the uncanny valley of cryptocurrencies\n\nThe final reason that I sold Ethereum is that it is presently in a bit of an uncanny valley.\n\nIf you're not familiar, the uncanny valley is a phenomenon in which a person's reaction to a humanoid robot is warm when the robot does not appear to be very human at all, warm when the robot appears to be fully human, but ice-cold or otherwise negative when the robot appears to be nearly human-like, but is overtly not an actual human.\n\nEthereum has a number of popular meme coins, such as Shiba Inu, a blockchain intended largely for fun or outright gambling rather than investing in serious projects and fostering frontier financial technologies. At the same time, it has a handful of rather esoteric cryptocurrency utility projects and decentralized autonomous organizations (DAOs), much like you'd expect from a chain devoted to hardcore technology development, financial engineering, or methodical new experiments in corporate governance.\n\nYet its high transaction costs make meme coin investing exceptionally painful. Likewise, the same source of friction is a massive drag on for-profit projects, which tend to have a higher need to transact on demand, meaning that they can't wait for fees to decline.\n\nFor other purposes, like minting and trading non-fungible tokens (NFTs) or creating smart contracts, there are plenty of solutions on the chain to choose from. But many of the marketplaces, exchanges, and tools on Ethereum have only rudimentary feature sets or sketchy credentials.\n\nOf course, the Ethereum blockchain itself can't fully control which projects use it or how well they work.\n\nBut for a chain's native token to be a good investment relative to other options, it helps if there's a critical mass of users within at least one (large) community that's loyal to where their projects are deployed. And for this chain, the various frictions are an impediment to that critical mass continuing to build, so I don't regret selling."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTFB4bFhUUnZ4TFRmMTlvTjBHNmo0QjZnNVdfSGdJOWZOa0tCdnZKNDF1MkYzaklRYzMxaGJiQjU4OV9KUnE3Tk9ZWDRpY3FfaFByVlNzYThqNk15bkFHSnRxVjcxQ3FnZXJKcTRqbXV3ZHJNOXhwZHF0alpxdVlpZmvSAYQBQVVfeXFMTl9LNTBfMTJLTlNLR0lOWDZ1U0JJUnA1WHZlT3VOXzRUZ3FrVmdVQ3hfODZCcHp0TlBKQmQxZ2pCWTktMFZVY012aURoTEotbXRiXzA2SUxBRTY5bG1iUFZYRlBpRHVpRlBPUkFhRmxMVWxWZDJ4LWZlMHBBWW9JX29mTXIz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Apr 2024 07:00:00 GMT",
        "title": "SEC Calls for Comments on BlackRock's Ethereum ETF Proposal - U.Today",
        "content": "The U.S. Securities and Exchange Commission is now soliciting feedback from the public on BlackRock's Ethereum spot ETF proposal, according to a recent filing.\n\nAdvertisement\n\n\"Interested persons are invited to submit written data, views, and arguments concerning the foregoing, including whether the proposed rule change is consistent with the Act,\" the regulatory agency said in the filing .\n\nThose who want to weigh in on the matter can provide electronic comments via the SEC's internet comment form or via an email. The agency is also accepting paper comments.\n\nThe public will be allowed to leave comments during a 21-day period.\n\nAdvertisement\n\nEarlier this month, the SEC also called for comments on spot Ether ETF applications from Fidelity, Grayscale, and Bitwise. Back then, ETF analyst James Seyffart opined that \"nothing\" in the filing signaled that anything had changed for Ethereum ETFs. He noted that silence from the regulator \"wasn't a good thing\" for approval odds.\n\nFor now, the consensus appears to be that the SEC is not going to approve a slew of spot Ethereum ETF applications in May despite approving a slew of applications earlier this year. The regulator has refrained from engaging with ETF issuers on this matter.\n\nAs reported by U.Today , the SEC recently postponed its decision on the spot Ethereum ETF proposal submitted by prominent investment firm Franklin Templeton.\n\nAt the same time, British banking giant Standard Chartered is convinced that the Ethereum price could reach the pie-in-the-sky price target of $8,000 by the end of the year despite predicting that Ether ETF will not be launched in May."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMi2gFBVV95cUxNOUlpX2RNRnF3bUVkTUNFTWR1NGhFMW5EcDhpSTBDdmRNYURPTlF0SzkwcUczMWY0SG0tX0ZwdkFNUTc3TV9XLUxhc0M2NVAzbkpCaFNjb0ZGaWxmQldpbURXNFhrOE5UOFJ1QjdYUy0wM2s0TlVtYklwRm9FbVVLelZJX21peE5XZlRMdzhMODZEYWE5ZnFaVy1KSkpyRXEtVDZxd3l1bDBEdlh5VFgxcXhDRTdkNmNlOUt3ZTRXeHJIQTZkcllzeEtaVFQ5TVFDZUZzZEVJUU5KQdIB3wFBVV95cUxPSTVFVkh0NW1HejRtcTJyWWY1TTZ6bGIwQmFpQnJiQmY2WW5BUDJ6aWttVHl6RTlieG5ndDdqVXpWZGV6QzVWS1lpaVVBR2ZEeW5ub3VuU3gwZUZpc3Q1QmI0SEhNTHl0TDRwSmNxYmZyMFBoT1dZT3d5OEhhQ0NTM1duTkVmcHdBWkRzT1lka1pZOHBQSGppVU1qN21hNHNCdzBNQnBDbE00MjJUdFdES25ZZ0Q2NjFrbW50dnpBeGgzTllWODVEejl5LTJXbW4xa1gySjYyMlBkcFllQWZV?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Apr 2024 07:00:00 GMT",
        "title": "Ethereum continues hinting at rally following reduced long liquidations - FXStreet",
        "content": "Ethereum's price often takes a downward shift after FTX and Alameda sells ETH.\n\nTraders expect a price rise in ETH following reduced long liquidations and normalizing risk reversals.\n\nEthereum needs increased trading volume to break past key resistance levels.\n\nEthereum (ETH) has continued showing signs of a potential rally on Tuesday as most coins in the crypto market are also posting gains. This comes amid speculation of a potential decline following FTX ETH sales and normalizing ETH risk reversals.\n\nAlso read: Ethereum shows signs of a potential rally as suspected Justin Sun wallet buys heavily\n\nDaily digest market movers: FTX sale, normalized risk reversals, active wallet increase\n\nEthereum's latest price movement is hinting at a potential rally. Here are key market movers driving the second-largest cryptocurrency:\n\nSince March 1, FTX and Alameda Research have deposited 20,350 ETH at strategic points right before a price dip, according to Spot On Chain. This insight comes as FTX and Alameda deposited 4,500 ETH worth $14.4 million to Binance and Coinbase at $3,207 on Tuesday. Investors may need to observe if ETH will take a downturn as in previous times. Other investors may be using FTX's move as a sell signal, hence the consistent price drop after the firm's ETH sales.\n\n\n\nWith ETH's recent price recovery, long traders are looking to gain control as long liquidations have slowed down significantly on Tuesday compared to the past two weeks, according to data from Coinglass. Short liquidations are increasing, with over $13.45 million liquidated, while long liquidations sit at $7.4 million in the past 24 hours.\n\n\n\nETH risk reversals have also normalized above -4%, from -12% one week ago, indicating traders are beginning to expect a price improvement, according to QCP Capital. As a result, \"improving speculative sentiment could see short covering and a resumption of leveraged longs,\" said QCP.\n\nRead more: Ethereum resumes consolidation after brief dip, buyback yield exceeds that of major S&P 500 companies\n\nMeanwhile, Bankless podcast co-host Ryan Sean Adams pointed out the increasing number of active wallets in the Ethereum ecosystem, which has grown to over 10 million weekly active wallets. He speculated that the Ethereum ecosystem can now increase user growth by 10x to 100 million in this bull run.\n\n\n\nThe US Securities & Exchange Commission (SEC) has also delayed its response to Franklin Ethereum ETFs, a series of the Franklin Ethereum Trust. The latest spot Ethereum ETF decision delay follows a series of timeline delays the regulator has given to other applicants.\n\nTechnical analysis: Ethereum needs increased volume to break past key resistance\n\nEthereum's recent price movement is teasing that a potential rally is on the horizon as it's attempting to break the upper side of the $2,852 and $3,300 key range. But it must first move past the $3,279 resistance to confirm.\n\nAlso read: Ethereum shows firm support at key level as its correlation with US indices increase\n\nHowever, declining trading volume amid the price increase is a concern. While bulls appear to have taken the wheels again, the reduced trading volume indicates low commitment and uncertainty. ETH could quickly push forward to break past the $3,300 key level if increased volume accompanies the rising bullish sentiment.\n\nETH/USDT 4-hour chart\n\nSuch a move will see ETH filling the liquidity void of April 13 and aiming for the next resistance of $3,406 formed on April 7. This resistance may prove easy to break past if trading volume increases. However, if volume fails to increase, ETH may fall back to the $3,056 support of March 20.\n\nAdditionally, with the halving behind us, Bitcoin's dominance over ETH may reduce in the long term, leaving room for the largest altcoin to craft its own path.\n\nEthereum is trading around $3,232, up 1.3% on the day at the time of writing."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxQU2M5dVR1WjlGMU51RFdieVRQdzJSb0RKTnU0T05icVk4dURNMnd3S3JZXzdOU2wyQzh4Z1ZIU0lOWDE1RWR5a2FZRUNtVEd1VlNyeGtpVkY5R3psQzFDSFFOa2ZPY1BpZWw1eVlwTXM3QlpySWJyWVNmZGFfUVRFUjgxY1VWV3pMNDBxNl9fWUtqSGZoVVB3NDBZQndzei1EZ2M3SklZTzZobDBOVmZUSnNEak8wNDlNOEpfdTdmaW0xZTF5WlJr?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Apr 2024 07:00:00 GMT",
        "title": "Technical analysis of Ethereum price: ETH consolidates after testing key resistance levels - The Cryptonomist",
        "content": "While the cryptocurrency market continues to navigate a landscape of volatility and transition, Ethereum (ETH) remains a focal point for traders and investors, its price analysis remains constant.\n\nWith the recent price fluctuations, a detailed technical analysis provides valuable insights, especially when examining the 1-hour, 4-hour, and daily charts.\n\nThis comprehensive view provides insight into potential entry and exit points through oscillators and moving averages, guiding short-term and long-term trading strategies.\n\nFluctuations and opportunities in the analysis of Ethereum ETH price\n\nThe 1-hour chart of Ethereum reveals significant price fluctuations, ranging between 3,116 and 3,236 dollars. This variability signals promising opportunities for more agile traders.\n\nA key strategy could involve buying at or near the level of $3,116, which has emerged as a reliable support.\n\nIf the upward trends were to be confirmed, entering here and planning the exits near the resistance of $3,236 – where prices have previously reached the maximum – could optimize gains, minimizing exposure to sudden declines.\n\nSwitching to the 4-hour chart, Ethereum shows an ascending pattern, suggesting a gradual consolidation of recent gains after bouncing from the $2,864 support.\n\nThis broader perspective indicates a bullish momentum aiming for new highs. Traders are advised to monitor a strong recovery from the support level and to set stop-loss orders slightly below it to safeguard against potential declines. These strategies align with a cautiously optimistic outlook, balancing risk with the potential for profitable upward movements.\n\nOn the daily chart, the price movement of Ethereum is confined within a wider range between 2,801 and 3,730 dollars, which marks critical levels of support and resistance. An effective long-term trading strategy could involve entering near the support of 2,801 dollars, especially if a definitive bullish reversal occurs.\n\nOn the contrary, it might be wise to set the exits near the $3,730 resistance, as this level has historically represented a significant challenge for price progression upwards, making it a strategic point to secure gains before potential pullbacks.\n\nAnalysis of oscillators and moving averages and the bullish and bearish verdicts\n\nThe price movement panorama of Ethereum is further complicated by conflicting signals from technical indicators such as the Moving Average Convergence Divergence (MACD) and momentum oscillators. The MACD presents a bearish outlook, suggesting caution, while current momentum indicators appear more bullish.\n\nThis dichotomy requires a balanced trading approach, incorporating signals from both bearish and bullish perspectives on different timeframes to develop a nuanced and effective trading plan.\n\nBullish perspective:\n\nThe market positioning of Ethereum, particularly evident from the sustained lows on the 4-hour chart and positive momentum signals, indicates a bullish future. Traders should consider the opportunity to enter long positions near key support levels, taking advantage of the overall upward trajectory.\n\nThe resistance shown at these support points, combined with potential bullish reversals on the daily chart, supports a favorable outlook for the advancement of the Ethereum price in the short term.\n\nBearish considerations:\n\nDespite the optimistic indications on shorter timeframes, bearish signals such as those from the MACD and longer-term moving averages suggest caution. The resistance level of $3,730 remains a formidable barrier that has repeatedly hindered upward movements.\n\nTraders should beware of a potential drop from this high, which could lead to profitable short positions if Ethereum fails to overcome this critical resistance, indicating a possible price retreat.\n\nIn conclusion, while Ethereum shows potential for both gains and losses, the key to successful trading lies in a balanced and informed approach that takes into account the complex interaction of various technical indicators and market sentiments."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxPal9ZTkNqN19tMThHVWlLUTNkdVlVb0thQkhMVXdaSHh1Wk43ZjlfNVAyNndWM1JIMmZ6d0RIOXRWb3FRMDNZc0FjVHVKV1Mwb2RYZUZ0OE1vMjFnMTMwNEo4aGZua2hLS3FXejVHZENXVmN3R0F2OVQyOVRRU3Y0VWpibDFCNEVIYmc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Apr 2024 07:00:00 GMT",
        "title": "SEC postpones Ethereum ETF decisions - Yahoo Finance",
        "content": "The U.S. Securities and Exchange Commission (SEC) has postponed its decision on approving spot Ethereum exchange-traded fund (ETF) from Franklin Templeton, initially anticipated for May, to a new deadline of June 11.\n\nThe SEC also delayed the deadline for the agency’s decision on Grayscale’s spot Ethereum ETF application to June 23.\n\nMeanwhile, the SEC is soliciting public feedback on a revised ETF proposal from BlackRock, which now includes a cash redemption model, a change from the original direct Ethereum exchange mechanism.\n\nBlackRock’s proposal, initially submitted in November 2023, has been revised to better align with the SEC’s regulatory framework, mirroring the cash redemption feature of previously approved Bitcoin ETFs.\n\nThe SEC has maintained a cautious approach to cryptocurrency ETFs despite approving spot Bitcoin ETFs earlier in the year.\n\nThe Bitcoin ETFs, approved in January, have since provided investors a regulated trading vehicle for the cryptocurrency and have experienced a cumulative total net inflow of US$12.42 billion.\n\nThe potential approval of Ethereum ETFs would provide investors with access to the second-largest cryptocurrency by market capitalization, marking another step toward the integration of digital assets into conventional investment portfolios."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxOZHE5Ym9GeG5KYmtHQXBVT2pPQzk5NE1vQzhpQjdPQl9oVXNRVlVZUTBBTWlyTEU4cklaa0tCX3ZSQm1xZVVXS003NFZENjU1ZjkyTTdQdTNOR2xBaHVCMThuanpMM21CdThyYmJzaWZ2X2ZiOWNXaldxMnRWb3V3TTA2WXpJUdIBiwFBVV95cUxOd0p2eFhacktSUzNGdzNydmRqZlJoQlFqaDhmWHk1UXZhb1JFX1p3TVlnMkVMVlRPcW1yVTd5NjlieFc3TzhVc0JObHNYaUg0aWdEMUIxejBzVWpTZm10V0hieVh3MHdzSDZNNWNIUkpoQVpfTHcyZ1RkcHRtYk1GczV4OG5nRXFzanNJ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Price in Q2: 4 Reasons for FOMO and 4 for FUD - CryptoPotato",
        "content": "As the classic weather forecast goes in the Northern Hemisphere, April showers bring May flowers. Will it hold up for crypto exchange markets in Q2 of 2024 after a sharp correction this April?\n\nAnd if the market does recover in May, whose flowers will bloom brightest?\n\nBitcoin price‘s four-year bull run seems imminent, but will Binance, Solana, Cardano, or Aptos lead DeFi gains in the second quarter, or will the king smart contract coin, ETH, fly furthest up the chart?\n\nEthereum prices are up by almost 100% for the trailing 12-month period. Ether is down over 4% from 30 days ago. Meanwhile, ETH prices are up more than 7% over the five days ending Monday.\n\nHere are four reasons in Q2 of 2024 to jump on the fear of missing out (FOMO) bandwagon for Ethereum and four reasons to bail out in fear, uncertainty, and doubt (FUD).\n\nFOMO:\n\nHere’s what Ethereum has going for it after the Bitcoin halving at block height 840,000.\n\n1. Ethereum Price $4,000 Is New Goal\n\nEthereum crushed $3,000 in February, then notched $4,000 on crypto exchanges in March for the first time in 2 years. After a substantial retreat, the asset indecisively tested $3,200 on Monday. If bulls defeat resistance at this level, the next key resistance will be near $3,700 where the market previously peaked throughout the month of April.\n\nThe world’s second-largest cryptocurrency by market cap hit its historic all-time high of $4,808.74 on Friday, Nov. 12, 2021. After blowing past $3,000 last quarter, Ethereum bulls are focused on $4,000 next and potentially $4,800 sometime in 2024.\n\nAs markets closed out Q1, a post on the 2.3 million strong EthTrader subreddit predicted: “ETH has plenty of growth potential and will eventually return to $4k, likely bypassing its ATH as well.” Furthermore, a recent report by USA Today notes: “Artificial intelligence-based websites, crypto traders, and industry analysts have 2025 ethereum price targets ranging from around $6,000 to above $21,000. Industry insiders project the crypto will reach nearly $7,500 by 2025.”\n\n2. Shiba Inu Is Becoming An L2\n\nOne way cryptocurrency investors evaluate the health of a Layer-1 blockchain is by gathering and analyzing metrics of activity and success among its most popular Layer-2 decentralized applications (DApps).\n\nA robust ecosystem with an active user base, high transaction volumes, and sustained growth trends tends to be a safer investment that delivers better returns. As a leading indicator of Ethereum prices in Q2, the success of the meme coin Shiba Inu – an ERC20 token – is a promising look at ETH’s future.\n\nInitially, Shiba Inu started as a joke cryptocurrency like Dogecoin in Aug. 2020. But unlike DOGE, a proof-of-work (mineable) Layer-1 cryptocurrency, SHIB has become a full-fledged Layer-2 Ethereum-scaling ecosystem, with decentralized apps powered by final settlement on the latter’s base chain.\n\nAn important Shiba Inu metric exploded by 1,000% in April, and a major SHIB developer made an important announcement earlier in the month. As a result, many cryptocurrency investors are terrified of missing out on Ethereum gains in 2024.\n\n3. L2 – Polygon, Arbitrum, and Optimism Scaling\n\nIn addition to Shiba Inu, Ethereum’s other Layer-2 scaling chains, like Polygon (MATIC), Arbitrum (ARB), and Optimism (OPT), are showing massive signs of strength in Q2. Perusing their X.com timelines, Monday reveals a flurry of new activity and development on these L2s, a bullish sign for Ethereum prices.\n\nGames are leaving Polygon? Check again. Gaming on Polygon amassed 700k+ Unique users in the past 7 days and 1.3m+ Unique users in 30 days. Total users have grown by 1113% and txns by 1290% over the past 7 days. GameOn 2.0 will take it to the next level ($30k rewards 😮) 1/🧵 pic.twitter.com/3xH6M1YYAW — sanjay.moca (@FlyeKitesJay) April 19, 2024\n\nPolygon Labs recently retweeted a post by a gaming content creator that reported, “Games are leaving Polygon? Check again. Gaming on Polygon amassed 700k+ Unique users in the past 7 days and 1.3m+ Unique users in 30 days. Total users have grown by 1113% and txns by 1290% over the past 7 days.”\n\nMeanwhile, Arbitrum announced, “Fraud Proofs took us to a Stage 1 rollup. Today, with BOLD, we’re on our way to becoming a Stage 2 rollup! BOLD, permissionless validation on Arbitrum, is now live on testnet!”\n\nOn Monday, OP Labs posted, “Yes, interoperability between Superchain L2s. Optimistically coming soon,” in response to the news that developers behind the Celo blockchain have selected Optimism to build Celo’s Layer-2 on Ethereum. Moreover, AltLayer announced on Monday the launch of a new Layer-3 powered by Arbitrum and Eigenlayer.\n\nAltLayer has deployed the testnet for @DODO_Chain, an Omni-trading Layer 3 powered by @eigenlayer & @arbitrum. From Multichain to Omnichain, enjoy a seamless new era of trading with DODOChain’s interconnected liquidity layer! https://t.co/XaKpPJiPB1 — AltLayer (@alt_layer) April 22, 2024\n\n4. Ether TVS On Sharp Uptrend\n\nTotal value locked (TVL) or “total value staked” is the measure of the amount and market value of the tokens locked or staked at any given time for a proof-of-stake cryptocurrency.\n\nBitcoin found a way to prevent double-spending and solve the Byzantine General’s Problem for a decentralized network by using electricity-intensive proof-of-work hash problems and a blockchain of validated hashes.\n\nSmart contract cryptocurrencies solve the same problem by allowing users to stake tokens to participate as a node. The higher the TVL, the better it is for the token’s market value with all other things being equal.\n\nEthereum price may be worth FOMO’ing over based on its TVL metrics. With a week left to go in April, Ethereum TVL is above $53 billion. Meanwhile, its nearest competitor, Tron (TRON), has $8.6 billion in TVL, according to CoinGecko data. Cryptoquant data show a very steady uptrend in Ethereum TVL from April 2021 through March this year.\n\n$29B of that TVL is staked with Liquid Staking using Lido, $14B is re-staked with EigenLayer, and $9B is staked through lending platform AAVE, according to the latest data from DefiLlama.\n\nFUD:\n\nHere are some headwinds working against Ethereum prices in Q2 2024.\n\n5. Prediction: Ethereum ETF Delay At SEC\n\nMany investors are feeling FOMO over the Ethereum price in Q2, but the outlook for the asset is not all rosy. One ongoing threat to Ethereum prices is the U.S. Securities and Exchange Commission (SEC).\n\nThe danger the SEC poses to Ether prices is twofold: 1.) The commission continues to angle to get ETH tokens classified as securities. 2.) In addition, the regulator may delay approving an Ethereum ETF for Wall Street investors.\n\nThat’s a big deal because VanEck thinks Ethereum ETFs could outpace Bitcoin funds once approved. Bitcoin ETF issuers like Fidelity and VanEck have been waiting for an Ether ETF approval but say the SEC will not greenlight one by a late May deadline.\n\n6. SEC Investigating Ethereum As Security\n\nMeanwhile, the SEC is “waging an energetic legal campaign to classify Ethereum, the second-most popular cryptocurrency, as a security,” according to a Mar. 20 report in Fortune Crypto.\n\nThe commission has issued subpoenas to a number of companies to probe their dealings with the Ethereum Foundation, kicking up speculation that the SEC will sue to get ETH tokens labeled a security.\n\nDevelopments related to this possibility represent an ongoing risk to long positions in Ethereum and a headwind for the asset’s prices. Should the SEC ultimately succeed in its campaign, Ether will likely have to overcome serious FUD.\n\n7. Competition From Bitcoin and Other PoW Chains\n\nDeFi is one of the fastest-growing industry sectors in the world by far in 2024, but competition from proof-of-work blockchains like Bitcoin, Dogecoin, Bitcoin Cash (BCH), Litecoin (LTC), Ethereum Classic (ETC), and Stacks (STX) is another reason to be uncertain about investing in Ethereum.\n\nSmart contract meme coins like Bonk Inu, Shiba Inu, Pepe, Floki Inu, and dogwifhat led cryptocurrency gains for the year in 2023. They may do so again in 2024, leading to new peaks.\n\nBut with the Bitcoin halving in the rearview mirror, the focus in 2024 could shift to supply and scarcity, with the benefit going to deflationary, PoW blockchains.\n\n8. Competition From Solana, Cardano, and Avalanche\n\nOf course, there’s also competition from other DeFi blockchains like Solana, Cardano, and Avalanche for Ethereum investors to FUD over. Coin Bureau altcoin analyst Guy Turner recently told his two million YouTube subscribers that he expects a 100% rally soon to $300 for Solana.\n\nMeanwhile, there may be a mega-move ahead in the cards for Cardano (ADA) based on the technical signals on the crypto’s chart. Last month, Avalanche (AVAX) achieved $329 million in daily transaction volume, levels the market hasn’t seen since May 2022."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiogJBVV95cUxOTlR3NGVBMnJWbnFLZHc0ZjFEZ205ajBudVRPZ0dqbjlaMTlEWkFYSWwyR053SUNiRGFKQ01keWpQcXhfd1B0V2E0VmZ0b2Z5UGtNbUJ4aG51NUJrWVBkTkx2Ni1qX3AzbzlkQ243LVQ5cUR5VGE4UjJFVXJ1UzNSLVEtRDFWaGZyZkd1NlhWQW42TXJ3R18yVDJYQnZOcDY2U00wV1c1dVhNay1xZXhnR2E0WW5sU044VGt2QXVBU3pmTXIxSWZWZy1FVXVrZXhYclFzNkxQenZJVVZFRTlXWTFpbzFaSTRURGRCNGpnelhRZEdLVVU0dW1yWkFMYjBfakswTUs5OVM1Q1VaOTR5WE52T3VySjhBZXBCbGtYRFEwdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Apr 2024 07:00:00 GMT",
        "title": "Unlike Bitcoin's Case, Ethereum ETF Approval Chances Slim, Says Crypto Analyst, But 'People Are Underestimating The Strength' Of ETH Ecosystem - Markets Insider",
        "content": "Michaël van de Poppe, a notable crypto analyst, voiced doubts regarding the prospects of an Exchange-Traded Fund approval for Ethereum (CRYPTO: ETH). Additionally, he emphasized the resilience of the Ethereum ecosystem.\n\nWhat Happened: Van de Poppe took to social media platform X to share his views on the possibility of an Ethereum ETF approval. He indicated that the chances of approval are low, despite the potential for an upward trend in Ethereum’s value. He also emphasized the strength of the Ethereum ecosystem.\n\n“It’s still on edge to have one and I think people are underestimating the strength of the Ethereum ecosystem,” he wrote.\n\nThe chances for an ETF approval for #Ethereum are quite low, but that doesn't mean that we're going to have an upward run on Ethereum.\n\n\n\nIt's still on edge to have one and I think people are underestimating the strength of the Ethereum ecosystem. — Michaël van de Poppe (@CryptoMichNL) April 24, 2024\n\nSee Also: Melania Trump Launches $245 Customizable Mother’s Day Necklace, Buyers To Also Get Limited-Edition Solana-Based Digital Collectible\n\nWhy It Matters: The possibility of an Ethereum ETF has been a hot topic in the crypto world. The SEC’s continued scrutiny of Ethereum ETF proposals has cast doubt on the May approval deadline. This has led to a decrease in the market’s expectation of an ETF approval, with a prediction market assigning only a 16% chance of approval by May 31.\n\nNotably, the SEC issued a historic approval for a Bitcoin (CRYPTO: BTC) ETF on January 10, 2024, pushing Wall Street into the cryptocurrency age.\n\nDespite the uncertainty, investment bank Standard Chartered remains optimistic about the future of digital assets. The bank believes that the market is well-positioned for a rebound, even if the approval is delayed.\n\nMeanwhile, the Bitcoin and Ethereum ETFs in Hong Kong are projected to accumulate $1 billion in assets within the next two years, despite China’s ban on the underlying assets. This suggests a strong global interest in cryptocurrency ETFs.\n\nHowever, not everyone is optimistic about Ethereum’s future. A seasoned Bitcoin trader and advocate recently declared a pessimistic outlook for Ethereum, suggesting that the “ETH story is dying.”\n\nPrice Action: Based on data from Benzinga Pro, Bitcoin is presently trading at $64,535, marking a 0.44% increase over the past 24 hours and a 46.10% surge year-to-date. Meanwhile, Ethereum is trading at $3,170, with a 0.98% rise in the last 24 hours and a 34.74% increase year-to-date.\n\nImage Via Shutterstock\n\nRead Next: Dogecoin, Shiba Inu And Other Memecoins Fueling Mass Adoption Of Base’s L2 Network, Coinbase Exec Says: ‘They Are Going To Be One Of The Biggest Drivers’"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMi6wFBVV95cUxQTW5RNlQxakVLRWxKSzMxeFJNQ2tJamNJM3RkVVRSV3NERDNRSlgyZmpDMEVQUFFzcWhPbWtqbzh0N1cySlA3S0cwVUczYUwyRC1wUGVsVmVDSkYxSUtFZlhCODBTZkpSMmtQNm5ZMEkyYjRmQ1E1MHJyQ1VuMGRFbUdYelpfdmFCc2Q4NWt4NGZ4SkZEZ0JMNzZpSXN0bHVIdHRBaU9ZV1J3Rkd4M19WRDVBam0tajVlbmFxckY0Wk5jb0N2YWNfZ19ERGdDWmdueWg3djRia0ZpU0tkc2tiT1NyejVwSXRiY2h3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Apr 2024 07:00:00 GMT",
        "title": "Grayscale Investments® Files S-3 Registration Statement for Grayscale Ethereum Trust - GlobeNewswire",
        "content": "STAMFORD, Conn., April 23, 2024 (GLOBE NEWSWIRE) -- Grayscale Investments®, the world’s largest crypto asset manager, today announced it filed a registration statement on Form S-3 (the “Form S-3”) with the U.S. Securities and Exchange Commission (“SEC”) to register shares of Grayscale Ethereum Trust (OTCQX: ETHE) under the Securities Act of 1933, as amended (the \"Securities Act\").\n\n\n\nFollowing NYSE Arca's filing of Form 19b-4 for Grayscale Ethereum Trust, Grayscale filed the Form S-3, another key filing requiring regulatory approval in the firm’s effort to uplist ETHE to NYSE Arca as a spot Ethereum ETF*. Grayscale Ethereum Trust intends to list the shares on NYSE Arca under the ticker ETHE, and issue shares on an ongoing basis upon approval of NYSE Arca’s application on Form 19b-4 to list the shares and effectiveness of the Form S-3 to register the shares.\n\nThe offering will be made only by means of a prospectus. A copy of the prospectus, when available, may be obtained by email from Grayscale Investments by emailing info@grayscale.com .\n\nA registration statement relating to the shares has been filed with the SEC, but has not yet been declared effective. The shares may not be sold, nor may offers to buy be accepted, prior to the time the registration statement becomes effective. This press release shall not constitute an offer to sell or the solicitation of an offer to buy the shares, nor shall there be any sale of the shares in any state or jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction.\n\n*Grayscale uses the generic term “ETF” to refer to exchange-traded investment vehicles, including those that are required to register under the Investment Company Act of 1940, as amended (the “40 Act”), as well as other exchange-traded products which are not subject to the registration of the ‘40 Act. The Trust is not registered under the 1940 Act and is not subject to regulation under the 1940 Act, unlike most mutual funds or ETFs.\n\nGrayscale Investments, LLC (“Grayscale”) is the sponsor of Grayscale Ethereum Trust (the “Trust”) . Grayscale is not registered as an investment adviser under the Investment Advisers Act of 1940 and the Trust is not registered under the Investment Company Act of 1940. The Trust is subject to the rules and regulations of the Securities Act of 1933.\n\nInvesting involves risk, including possible loss of principal. An investment in the Trust is subject to a high degree of risk and heightened volatility. Digital assets are not suitable for an investor that cannot afford the loss of the entire investment.\n\nThe Trust holds Ethereum; however, an investment in the Trust is not a direct investment in Ethereum. As a non-diversified and single industry fund, the value of the shares may fluctuate more than shares invested in a broader range of industries.\n\nThere is no guarantee that a market for the shares will be available which will adversely impact the liquidity of the Trust. The value of the Trust relate directly to the value of the underlying digital asset, the value of which may be highly volatile and subject to fluctuations due to a number of factors\n\nSmart contracts are a new technology and ongoing development may magnify initial problems, cause volatility on the networks that use smart contracts and reduce interest in them, which could have an adverse impact on the value of Ethereum.\n\nAbout Grayscale Investments®\n\nGrayscale enables investors to access the digital economy through a family of future-forward investment products. Founded in 2013, Grayscale has a proven track record and deep expertise as the world’s largest crypto asset manager. Investors, advisors, and allocators turn to Grayscale for single asset, diversified, and thematic exposure."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxQakhkenducVc0S0d1Wl9nc1hydHEtaU9KcVBqUGx6ZjN3d1FkUjNuV2NHai14TWtKdE5NNm8xeFhmTHRyZU0zbGoxOXFreGFicWNTM1JlZUZDT2w2bFZqUEtyd1RSaS1EMWlmbjlpN3pPeGFINTRacXQ5Y2YyYjFfbg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Apr 2024 07:00:00 GMT",
        "title": "Bitcoin (BTC) Stabilizes at $66,000 Post-Halving, Ethereum (ETH) Climbs 1.3% to $3,200, Furrever Token (FURR) Nears $1.9M Goal in Presale - Yahoo Finance",
        "content": "Furrever Token\n\nNew York, NY, April 23, 2024 (GLOBE NEWSWIRE) -- In a week marked by notable movements in the cryptocurrency market, three coins have captured the attention of investors and analysts alike: Bitcoin (BTC), Ethereum (ETH), and Furrever Token ( FURR ) . Each of these cryptocurrencies has demonstrated unique behavior in response to global market conditions and internal developments, from halving events to presale successes.\n\nBitcoin (BTC) Stabilizes at $66,000 Following Halving Event\n\nAfter a period marked by significant fluctuations, Bitcoin's price has found stability early this week, maintaining a position around $66,000 following its anticipated halving event. The adjustment, which occurred over the weekend, resulted in the reward for Bitcoin mining being cut from 6.25 to 3.125 Bitcoin, an essential part of the cryptocurrency's design to control inflation and reduce the rate at which new Bitcoins are introduced into circulation.\n\nThis halving, which takes place approximately every four years, is one of many steps in the long process towards the cap of 21 million Bitcoins. As of the latest event, there are projected to be 29 more such halvings before the final Bitcoin mining rewards are reduced to mere satoshis—the smallest unit of Bitcoin.\n\nLeading up to the halving, Bitcoin experienced weeks of price volatility. However, as of Monday morning, the cryptocurrency appears to be resting on a solid support level. Blockchain analytics firm IntotheBlock reports that Bitcoin is now trading just above a significant demand zone. \"With 1.66 million addresses having purchased Bitcoin at an average price of $64,800, this level may serve as strong support in the face of potential market downturns,\" stated IntotheBlock on social platform X.\n\nIn the immediate aftermath of the halving, Bitcoin transaction fees soared, reaching a record high of $127 momentarily during the weekend, as per data from Bitinfo Charts.\n\nIn related developments, other major cryptocurrencies such as Ether and Solana have also experienced modest gains, each up nearly 1% and trading at $3,100 and $152, respectively, as of Monday morning. The overall crypto market cap has seen a slight increase of 1.13%, climbing to a total of $2.41 trillion according to CoinMarketCap.\n\nThe crypto community continues to monitor these developments closely, considering the potential long-term impacts of Bitcoin's halving on the broader cryptocurrency market.\n\nEthereum (ETH) Experiences Slight Increase Following Bitcoin Halving\n\nETH has successfully regained its footing above the $3,000 mark as of Friday and continued to stabilize over the weekend. Currently, the price of Ethereum hovers just over $3,200, marking a 1.3% increase in the last 24 hours and nearly matching its price level from the same time last week, with only about a 1% difference.\n\nStory continues\n\nIn other positive developments, there is promising news for both Ethereum and Bitcoin as Hong Kong has conditionally approved spot ETFs for these cryptocurrencies. Local firms are optimistic about receiving final approvals to start issuing shares within the month. The initiation of trading is expected to alleviate some of the uncertainties surrounding cryptocurrencies in the region, potentially injecting $25 billion in new liquidity into the market\n\n\n\n\n\nFurrever Token (FURR) Captivates Investors with Successful Presale During Market Surge\n\nIn the dynamic world of cryptocurrencies, Furrever Token (FURR) stands out as a burgeoning favorite, having captured significant investor interest with its successful presale amid an overall market uptick. Furrever Token distinguishes itself by blending the allure of adorable kittens with the technological prowess of blockchain, offering a uniquely engaging and delightful user experience in a sector often dominated by more austere projects.\n\nCentral to the ethos of Furrever Token is the creation of an enchanting crypto ecosystem that prioritizes fun and camaraderie. The platform is designed to be user-friendly and community-focused, incorporating charming cat-themed graphics like stickers, emojis, and visuals. These elements not only enhance user interaction but also build a sense of community through regular social challenges and growth-oriented initiatives, making the crypto experience enjoyable for both seasoned investors and newcomers.\n\nThe financial structure—or tokenomics—of Furrever Token is strategically devised to drive participation and support the project’s expansion. With 65% of the tokens allocated for the presale phase, the project has already raised over $1 million and is rapidly approaching the completion of stage 7 out of a planned 10 stages, with a fundraising goal of $1.9 million set before its expected launch on decentralized exchange PancakeSwap.\n\nThe investment appeal of Furrever Token is bolstered by its promising financial prospects, offering potential returns of up to 15X from its current pricing at $0.000564. This potential for high returns has piqued the interest of investors looking for both profitability and an engaging community experience. To ensure trust and transparency, Furrever Token has implemented comprehensive security measures including smart contract audits, token lock-up periods, and proactive community engagement, all of which reaffirm the project’s commitment to legitimacy and investor reassurance.\n\nAs Furrever Token continues to progress and draw in new supporters, it remains a compelling project poised for further success in the expansive crypto market. Its combination of cuteness, community involvement, and potential high returns continues to attract a broad spectrum of investors globally. For those looking to join this vibrant community, FURR is available exclusively through the official website, furrevertoken.com, where transactions are secure and reliable. The road ahead looks promising for Furrever Token and its dedicated base of crypto enthusiasts.\n\nFor further information or any assistance regarding Furrever Token, reach out only through the official channel at support(at)furrevertoken.com to avoid potential scams.\n\nDiscover the Most Exclusive Presale Opportunity of 2024 Now:\n\n\n\nFurrever Token Official Website | Visit Furrever Token Presale\n\n\n\nJoin Official Telegram Group | Follow Official X Account\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\nCONTACT: Media Contact: Robert Smith https://furrevertoken.com/ support(at)furrevertoken.com\n\n\n\n"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxNTUdxQ1hFRnE2eklyaGlBZE44eU9tXzdWREtXekRfaWwzcG5ma3VfblJQS0hGb3RSZkJiOERBSkNYcWVsZ1BCUDZvTmlhbjZ3Mk9mSWZtaDdCY2NvSjBIVzhfM1NiMnpMYUpPbm44bWRLV1FjdmMzeTktX09MM1dYdG1ZSHZTeGFzSmVwSlJ4UTZHbUtSam91Tm1hWdIBowFBVV95cUxNYjFRdkVHbVFCTUxMb3lLdlZmRUhlRV9fUjNVUkYySWswd2ZOV2huaVRIMzdjSU9aMURDc3NCNlpUcUNYMVl6YnRtWmpYVjFTdkI3ekVneGZUa3RRTExUSjBXY1B0QmF5SVhfQVZ4UWtaS21reVk4bkRSY1NCankwZmV5N0swUndlRm9NT21JRHBnSHQxamFCb19wU3FLckdtX1NZ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Apr 2024 07:00:00 GMT",
        "title": "What Is Xai? The Rising Ethereum Layer-3 Gaming Network on Arbitrum - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nA new gaming blockchain has entered the lobby in 2024: Xai.\n\n“Xai is built to enable open trade in the next generation of video games,” the official site says. In its quest to do so, the network aims to reduce fees, offer account abstraction to hide some of those pesky blockchain elements, and empower game creators in the process.\n\nThe layer-3 blockchain is developed in part by Offchain Labs, the original creator and primary developer behind the Ethereum layer-2 Arbitrum network that Xai is built on top of. And Xai is getting help from game developer Ex Populus, which will deploy the first games planned to launch on the network in collaboration with the Xai Foundation.\n\nBut what does this really mean? We’ve rounded up all you need to know.\n\nAD\n\nAD\n\nWhat is Xai?\n\nMany crypto users are familiar with the concept of layer-1 blockchains and layer-2 scaling networks built on top of them, but Xai brands itself as a layer-3 network. This is because it’s built atop Ethereum layer-2 scaling network Arbitrum.\n\nIn practicality, this means that Xai keeps Arbitrum’s core functionalities the same while tweaking certain aspects of the network for a more targeted experience intended for a specific use case. While Arbitrum is a general layer-2 scaling solution that can be tapped for all kinds of apps, Xai specifically caters to the needs of gamers and game developers alike.\n\nFor example, Xai offers account abstraction—meaning it’ll hide confusing parts from users—when it comes to the blockchain wallet and account experience. The network also provides developers with increased gas and contract limits.\n\nMost notably, the Xai site says that it “introduces parallel processing and advancements for enhanced scalability, efficiency, and cost reduction.” That’s on top of Arbitrum’s existing layer-2 approach, which handles transactions away from the Ethereum mainnet to do so at a lower cost and greater volume via its optimistic rollup tech.\n\nAD\n\nAD\n\nBy reducing fees and increasing transaction times, Xai aims to create a smoother gaming experience while embracing the unique elements that make blockchain gaming what it is—such as true ownership of unique, in-game items, as well as tokenized economies.\n\n“The cheaper and faster we can make things,” Ex Populus co-founder and CEO Tobias Batton told Decrypt, “the better experience we can provide users.”\n\nWhat is the XAI token?\n\nKicking off 2024 with a bang, 125 million XAI tokens (5% of the token supply) were airdropped to gamers, according to the Xai Foundation. The airdrop’s total value was nearly $70 million at launch, growing to $140 million less than a week later.\n\nThe XAI token’s primary purpose is to be used as the gas fee token on the layer-3 blockchain. But there are also potential benefits, as XAI tokens can be exchanged for esXAI (or escrowed XAI) tokens and staked to earn interest-like rewards.\n\nOnce you have staked your esXAI tokens, you're able to participate in staking pools. Coming in Q4 2024, you’ll also be able to participate in governance as well as gain “exclusive access” to special events and assets associated with projects on the Xai blockchain.\n\nWhich games are building on Xai?\n\nAll of this technical stuff is great, but a gaming network is ultimately defined by the games on it. After all, no one would buy a PS5 if it had no games. So which games are being built on Xai?\n\nWith Ex Populus as a key partner, the developer has committed its suite of games to the layer-3 network. Currently, we know two of the games that are in development by Ex Populus: rogue-lite auto-battler Final Form, and hover car action shooter LAMOverse. But the studio’s website also states that an open-world experience is currently in pre-production, with details still to be announced.\n\nOutside of this partnership, early this year it was announced that Crypto Unicorns and its related NFT games will migrate from Ethereum sidechain network Polygon to Xai. Crypto Unicorns NFTs have generated $35 million of trading volume. The switch was motivated primarily due to “challenges” that arose when operating a game on Polygon, the team told Decrypt, namely in the form of network gas fee spikes.\n\nAD\n\nAD\n\nAfter that, a prominent indie gaming curator called The MIX, or The Media Indie Exchange, said that it plans to launch over 100 games on Xai before the end of 2024. While what games will be launched on the network is yet to be confirmed, Xai said that “many” of the games are already on Steam and will be reworked to benefit from blockchain tech.\n\nThis means that it's likely that currently Web2 games are going to get Web3 functionality using Xai, which The MIX suggests will bear a “striking resemblance” to how Valve allows players to buy and sell Counter-Strike: Global Offensive in-game items.\n\nMost recently, Reboot, the crypto gaming protocol powering Pixel Vault’s flagship game BattlePlan, announced an alliance with the Xai Foundation to migrate the game to the network. Sometime this quarter, BattlePlan will move one layer deeper from Arbitrum Nova to Xai in an attempt to “enhance player experience.”\n\nHow staking works on Xai\n\nAs an incentive to keep users on the network and reward them for supporting its consensus model, Xai began rolling out staking across two waves.\n\nVersion one allowed owners of Sentry Nodes—which are responsible for monitoring and flagging blocks on the Xai network—to stake up to 25,000 esXAI they hold. Then, in April, version two was rolled out, which opened the gates to any holder of esXAI.\n\nNow, staking pools can be created by Sentry Key holders—the NFT is used to operate a Sentry Node to support the network—and then anyone can stake esXAI in the pools that have been created. Pool operators can determine the distribution of pooled network rewards, specifying the percentages allocated to themselves, Sentry Key-holding stakers, and standard esXAI stakers.\n\nXai also introduced a tier system where the higher the tier of a staking pool, based on the amount of esXAI staked, the greater the reward multiplier for the staked Sentry Keys.\n\nAD\n\nAD\n\nFor example, if 500,000 esXAI is staked, then the Sentry Key will see a 3x reward multiplier. This starts at \"bronze\" with no bonus reward, but climbs all the way up to \"diamond,\" which has a 6x reward multiplier.\n\nThe future\n\nXai is like an onion: It has layers. As a layer-3 blockchain, it attempts to improve on the layers that came before it to optimize the gaming experience. Peel back more layers and you find a robust token and staking system with governance in layers to come.\n\nOf course, the one layer that’s still a bit thin as of this writing concerns the actual games themselves build on top of the network. But based on the announcements thus far, it appears those games are coming.\n\nEdited by Andrew Hayward"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxNb3BGalRlSDJnVnRTbGZVT19IbjJCNUIwMnJpT3Fyei1oZENBRGdjQVEyZHdSTTdWUUpDZUpnZXNxQkVWcTU1Z1p2TTRjM3VXTktvQ3hHTzJTdTdabmNrWHlIb1l5a2xlcFF5U2M1VHlzTHV0d0JBcDMwRkFIZ3NlUHFZbi1OU0ZDQl9wMXFLZ1p5RXlDaEFGbzNUaklhbmhJ0gGmAUFVX3lxTE5tTGxzY1Q4eXd4S2NvSEdxOWRxZE1UT3o5SWFtb0hOUkV3VGt1cUxaSlU4QUpNaURiWGZEQTN0a2cwQjRJNEQ5NlZFRTNRS2dhdGhOSU9obzBhaFlqd2ppemstUTBHQzAtZEZad0lTUkw0NzEwa1V0SlFodnVWeFQ1azNORjBVUk1tTlN2TkVjSUlIai1aWjEtRjlQUkM2QldkZ0tVOVE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Price Jumps As TRON Founder Justin Sun Accumulates 15K ETH, What’s Next? - CoinGape",
        "content": "Ethereum, the second-largest cryptocurrency by global market cap, appears to have ignited a torrent of optimism among crypto market traders and investors globally today, April 24. As ETH’s price action illustrated a considerable rebound, followed by heightened whale activity orbiting the token, the eternal Solana rival garnered noteworthy investor attention today, with crypto market participants speculating about the token’s price action ahead.\n\nNotably, TRON founder Justin Sun, a prominent figure within the crypto realm, continued accumulating staggering amounts of ETH, per today’s on-chain data. Meanwhile, whale activity surrounding the token has been burgeoning over the past few days, with bullish sentiments swirling around ETH. Here’s a closer look at why Ethereum curates market optimism with whales buying the token despite its sideways trading over the past few days.\n\nadvertisement\n\nEthereum Accumulations Note A Spike, Fuels Market Optimism\n\nAccording to Lookonchain’s insights, a blockchain data analytics platform, the Justin Sun-linked wallet 0x4359 withdrew 15,389 ETH, worth $49.78 million, from Binance today, April 24, nabbing global attention. This massive accumulation by Sun underscored a heightened sense of confidence in the asset’s future, birthing immediate bullish sentiments for the ETH price trajectory ahead.\n\nIntriguingly, CoinGape Media spotlighted a plethora of ETH whale accumulations yesterday, weighing in on the token’s optimistic take on the market. Per the report, Justin Sun invested a staggering $1 billion in Ethereum yesterday, further anchoring the TRON founder’s confidence in the asset. This, coupled with the rising Ethereum whale accumulations, paints a highly bullish outlook for Ethereum’s price action ahead.\n\nAlso read: Crypto News: FTC Votes to Ban Noncompete Agreements in Employment Contracts\n\nEthereum Price Jumps\n\nAs of writing, the Ethereum token’s price has been noted to have gained 1.67% in the past 24 hours and is currently trading at $3,242. The ETH market cap sprung 1.58%, accompanied by a 24-hour trading volume upswing of 2.16%, amassing slight optimism on the token.\n\nThis price rebound showcased by ETH primarily aligns with the colossal accumulations recorded in the past few days, as mentioned above. However, derivatives data for the token signals reduced investor interest and market activity for the token, underscoring a potential downtrend for Ethereum in the market as of press time. Coinglass revealed a 0.39% dip in the token’s open interest, accompanied by a derivatives volume fall of 2.88%.\n\nThis painted an uncertain scenario surrounding ETH’s price action ahead, as bulls or bears may take over the token at any moment in the future. Nonetheless, with post-BTC halving optimism, further accompanied by significant whale accumulations, crypto market enthusiasts continue to extensively eye the token, hoping to see a rising price action ahead.\n\nAlso Read: Block Inc Successfully Wraps Up Bitcoin Mining Chip Development\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMihwJBVV95cUxPTFg3cTNZSDJra1FmdjFfVWxrM3dCTnNWcVNBVmtjVm5halNYSnJ5cmpyYUVNTF92WDNSTnV4cU5DNUVCVTg5d0NVTUZtZmFUdUFrcWtvNVE5ZTZqdHFsZUk4dXkwLXBvZ3VHRk5TdVJXZmMxOGM1T3ZaSmRpVEFBN3F0S0xNVUxoRVVMaVdjY3BaVWx1YnRtNnVMN2ZCSEFNNkZtd0VFZFNTTm1yRVg5SXRuUVlqNzUwWTJMaEl3a1pDdC1Ea3JlQUpOUEF3bmY0elVRbERvMVU4dHB0S2xOY09xSXhaTENIbmFiS28yUjJXNWV0R2RsR3Z4bHRxaTUweFd6UXhFWQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Apr 2024 07:00:00 GMT",
        "title": "Ethereum: farmers tremble on Renzo, ezETH depeg to $700 - The Cryptonomist",
        "content": "During the night we had only a small taste of the impact of a potential collapse of Ethereum’s liquid restaking tokens: Renzo protocol’s ezETH experienced a strong dump, due to the lack of liquidity on DEX, dropping to 700 dollars.\n\nThe ezETH-ETH ratio has dropped to the threshold of 0.2, causing several positions in the leverage of airdrop farmers who had used the coin as collateral in money markets such as ZeroLend and Gearbox to be liquidated: in total, liquidations amount to 340 million dollars.\n\nThe reaction of Renzo’s competitors was not long in coming, such as Etherfi, which reiterated its superiority as a restaking protocol, as well as the disapproval comments from the Ethereum community criticizing the risks of this system.\n\nAll the details below.\n\nRenzo’s LRT Depeg on Ethereum: ezETH at $700 overnight\n\nDuring the night Renzo, a famous Ethereum restaking protocol, risked collapsing after its token ezETH lost its peg with ETH reaching a price of about 700 dollars.\n\nIt all started when, immediately yesterday’s announcement by Renzo regarding the launch of their governance token REZ on April 30th (with an attached Binance launchpool), many users started selling ezETH on decentralized markets.\n\nWe remind you that this liquid restaking token allows you to accumulate Renzo Points, which will soon be converted into REZ. The announcement by the Renzo team has therefore marked the end of the farming period and several airdrop hunters have preferred to sell ezETH to move to other projects.\n\nMassive sales have targeted the main DEXs where the currency is traded, leading to its devaluation due to reduced liquidity.\n\nThink that the ezETH ratio to native ETH has reached 0.2, when technically it should be fixed at 1.\n\nNow Renzo’s token has fully recovered the peg, still being traded at a discount of about 1%.\n\nThe consequences of the takeoff immediately made themselves felt: many “leverage farmers” who have exploited money markets like ZeroLend and Gearbox woke up scorched this morning with over 340 million dollars of liquidations.\n\nOn this kind of platforms it is indeed possible to put ezETH as collateral, borrow stablecoins like USDC, buy other ezETH with the stablecoins, and potentially repeat the cycle indefinitely.\n\nThis practice allows you to accumulate many more Renzo Points, as well as other points that make you eligible for further airdrops such as those of EigenLayer, Linea, Blast, ZeroLend etc.\n\nThe problem is that if the value of the collateral (ezETH) were to fall for any reason below the borrowed value, there is a risk of liquidating the entire staked portfolio.\n\nFortunately, this time the settlements were overall contained, and part of them were covered by Gearbox’s emergency fund.\n\nAnyway, the entire Ethereum community got quite a scare, as Renzo is one of the largest protocols for restaking, with a TVL of 3.4 billion dollars.\n\nI just analyzed ezETH depeg consequences for Gearbox. All passive lenders funds are safe, no bad debt was incurred ✅\n\n\n\n115 Credit Accounts were liquidated, 10650 ezETH were sold on Balancer pool. Liquidation losses of 25.77 ETH were automatically covered by internal Gearbox… pic.twitter.com/RxxQlAtgBk — 0xmikko.eth | Token 2049 🇦🇪 (@0xmikko_eth) April 24, 2024\n\nMeanwhile, according to what was reported by “Spotonchain“, there are those who took advantage of the discounted price of Renzo’s liquid restaking token to speculate on the markets, managing to earn over 193 ETH in just 2 hours of trading.\n\n\n\nWallet 0xaa1 (linked to “czsamsunsb.eth”) made 193 $ETH (~$600K) in only 4 hours after $EZETH (#Renzo Restaked ETH) lost peg!\n\n\n\nSo far, the whale has swapped 4,499 $ETH for 4,692 $EZETH since the depeg occurred allegedly due to poor liquidity in Uniswap 4 hours ago, now making 193… pic.twitter.com/oJmKTR6io5 — Spot On Chain (@spotonchain) April 24, 2024\n\nThe risk of “leverage farming” in Ethereum restaking: Etherfi’s immediate reaction\n\nThe practice of “leverage farming” in the context of airdrop hunters has been widely criticized by several users of the Ethereum community immediately after the incident with the token depeg of Renzo ezETH.\n\nGoing all in to generate as many restaking points as possible can indeed lead to significant financial losses as soon as the market goes into a downtrend or in case of flash crashes.\n\nLiquidation of ezETH positions on the money market. Source: https://twitter.com/DU09BTC/status/1783054456071868905\n\nIn addition to the personal risk (sometimes disproportionate to the potential return) that users take on by engaging in leverage farming, it is worth noting how all of this creates an unhealthy environment for Ethereum and its ecosystem\n\nMany Ethereum stakers who did not go on leverage, but simply locked their stake on Renzo in order to reuse the consensus stakes found themselves in the middle of an unpleasant situation.\n\nFurthermore, the impact of the liquidation, if it had been of larger amounts, could have affected the price of ETH itself\n\nFor the moment, the worst seems to be over and fortunately no major damages have been reported.\n\nezETH briefly depeg overnight and now everyone's shooting at the ambulance 📉\n\n\n\n📌 There's nothing safe about ETH restaking!\n\nYou play this game to make money, but for the lure of gain, some people add a layer of risk with protocols that allow them to leverage their position…… pic.twitter.com/VIoj6n2jVB — 𝗙𝗮𝘀𝘁𝗟𝗶𝗳𝗲 (@0xFastLife) April 24, 2024\n\nIn the midst of the storm, Renzo’s main competitor, the Etherfi protocol, took the opportunity to celebrate the superiority of its liquid restaking token eETH as much more liquid than ezETH.\n\nActually, it was the lack of liquidity in the markets that influenced the drop in the token’s price, resulting in too high of a price impact for sellers.\n\nThe representatives of Etherfi have pointed out through a comment on a post criticizing the entire house of cards of Ethereum restaking, that not all LSRT protocols are the same and that there are safer alternatives."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxOS1R2YlJ5RXY1SGRIemhOTGRSYXpxbjJESDMtVHlPbDVsNENTcWJkM2RCc3VoQkp5aHpJVFJZQ3pCZGQwRFVZZWVVOGd5dElRTU05aDBQN2JBUlAxWTBpNUc3Z0k5bEFGNWZ6dXBBSmZBNWV0c0hSSTg2azhDZ3UtcmRDS3ZRR0FORlRfSWZFeGFsZ0MyOW9TbEJR0gGfAUFVX3lxTE9hYjR0V0tVVlNlclluLVBmeWsyVDVyTERHbU9TaFMxTVV6cFpVS2djc1ZKemZzSnhKSERGeUdGQ1otdmo3cldhdHBaNjZoZjBybjU0b19GdEtWandLWUwweFpFcUhENzlpUHk2c0pmNXVmU0N6V3ZlTEtfSXp1aWxPV0duMlNnSEl3cllzclNMdW9GWFVtWFpuUWJSSmE3NA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Apr 2024 07:00:00 GMT",
        "title": "Ethereum price prediction: Buy or sell this summer? - AMBCrypto News",
        "content": "The decline in Ethereum’s network activity has turned Ether inflationary.\n\nDespite recent price troubles, ETH’s long-term outlook remains significantly bullish.\n\nEthereum’s [ETH] supply has become inflationary, as the general market decline in the last month has decreased user activity on the network.\n\nAccording to data from Ultrasound.money, the leading altcoin’s supply has risen by over 4,836 ETH in the past 30 days. In the last week alone, this has grown by 9,000 ETH.\n\nETH’s supply is deemed to have become inflationary when there is an uptick in the number of coins created and added to the circulating supply, thereby increasing the downward pressure on the coin’s price.\n\nThis happens when the Ethereum network witnesses a drop in user activity. On-chain data from Artemis revealed a decline in the daily count of unique addresses interacting with the Ethereum blockchain in the past 30 days.\n\nBetween 23rd March and 22nd April, Ethereum’s daily active address count fell by 22%. This led to a corresponding fall in the network’s daily transaction count. During the period under review, this dropped by 15%.\n\nDuring the 30-day period in question, the network’s transaction fees peaked at $1.3 million on 12th April and initiated a decline. Between the 12th and 21st of April, Ethereum’s daily fees dropped by 8%.\n\nWhen the Layer 1 (L1) network witnesses a decline in fees, it experiences a low burn rate. A reduced burn rate increases the amount of ETH in circulation, making the coin inflationary.\n\nA look into the future\n\nAt press time, ETH exchanged hands at $3,173. Impacted by the general market decline in the last month, the coin’s value dropped by 5% during that period, according to CoinMarketCap’s data.\n\nHowever, despite the recent market headwinds, ETH’s 50-day moving average (MA), which initiated a golden cross when the bull market rally began in October 2023, still lies above its 200-day MA on a weekly chart.\n\nThis implies that the coin’s shorter-term moving average has remained above the longer-term moving average for some time. This is generally viewed as a bullish signal, as it indicates that ETH has experienced a sustained price increase since October 2023, despite a few drawbacks.\n\nMarket participants may interpret this as a sign of continued strength in the asset’s price.\n\nReadings from the coin’s Directional Movement Index confirmed this bullish outlook. The coin’s positive directional index (green), which also crossed above its negative directional index (red) in October 2023, has since maintained this position.\n\nThis crossover is regarded as a bullish signal as it signals a rise in the bullish momentum. If it occurs over an extended period, like in ETH’s case, traders view it as a confirmation of an uptrend in an asset’s price and a signal of a further price rally.\n\nAnother indicator worthy of note here is ETH’s Squeeze Momentum Indicator. It measures an asset’s momentum and tracks the consolidation phase of the market for traders looking to trade in a sideways market.\n\nPrice chart readings showed that ETH’s Squeeze Momentum Indicator has posted green upward-facing bars since November 2023.\n\nWhen this indicator shows upward-facing green bars, the asset in question is experiencing upward momentum.\n\nDespite the multiple declines in ETH’s price in the past several weeks, its Squeeze Momentum Indicator continues to display green upward-facing bars, indicating that the rally will continue in the long term.\n\nAlthough the coin’s outlook remains bullish in the long term, the surge in ETH profit-taking activity since mid-February has led to a decline in some of its key momentum metrics.\n\nAs of this writing, ETH’s Relative Strength Index (RSI) and Money Flow Index (MFI) were 58.77 and 52.01, respectively.\n\nWhile these values rest above 50, they suggest that recent market bearish trends have led to a slight decline in buying pressure.\n\nHowever, a combined reading of ETH’s RSI, MFI, and the indicators assessed above showed that the coin is not in extreme overbought or oversold conditions. It also signals that the current trend may continue to be stable with a slight bullish bias.\n\nETH futures market\n\nIn ETH’s derivatives market, its futures open interest reached a year-to-date peak of $15 billion on 9th April and has since declined by 33%, per Coinglass data. As of this writing, the coin’s futures open interest was $10 billion.\n\nThis decline signaled a fall in trading activity in ETH’s futures market. When an asset’s open interest declines in this manner, it means that market participants are closing out their positions without opening new ones.\n\nIs your portfolio green? Check the Ethereum Profit Calculator\n\nSince the open interest decline began, the coin has closed five days with a negative funding rate, with the latest being on 22nd April. On those days, futures traders placed bets in favor of a decline in the coin’s value.\n\nAt press time, ETH’s funding rate across exchanges was 0.0023%, showing that long traders have regained control."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxQWGpwclBKMFNMWVpiUjBGLWwzSjZBMlhpT0poRVNBcTRrNUVJb1p6V0tiT1FEajFxaW8xMG5pMjQ4dWlNSWRPRGwweGhVSnRJNmEyTTR4MXJBQUV2dVZRaXpwRm5KNjduSjhma296RENCWFo0N1RkR0ZaUG0yZ1RPa2tyNkNFc3lOdFk3YUwtUU0wWUxEWm1ZQjFyTHY3Z2NpR3c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Apr 2024 07:00:00 GMT",
        "title": "Morph and Pyth Join to Revolutionize DeFi on Ethereum Layer 2 - Crypto Times",
        "content": "Morph, an Ethereum Layer 2 solution, has teamed up with Pyth Network to enhance decentralized finance (DeFi) applications. This integration empowers developers building on Morph with access to over 500 real-time price feeds for various assets, including cryptocurrencies, equities, and commodities.\n\nThe collaboration introduces Pyth Price Feeds on Morph’s testnet, combining ZK technology and optimistic rollups for improved scalability and decentralization.\n\nTransform your apps—with Pyth data 🔮\n\n\n\nToday marks the launch of Pyth Price Feeds on @Morphl2 testnet, a secure, decentralized, cost-effective, and high-performant EVM-equivalent rollup for Web3 builders.\n\n\n\nLearn more about this deployment below:\n\n\n\nℹ️ About Morph\n\n\n\nMorph is a fully… pic.twitter.com/HFczYHMLVI — Pyth Network 🔮 (@PythNetwork) April 24, 2024\n\nThe partnership between Pyth and Morph will provide developers with the tools they need to create secure and reliable decentralized finance (DeFi) applications. Pyth’s pull oracle deployment on Morph makes it easy for DeFi protocols to get real-time price updates from the Pythnet appchain.\n\nPyth’s oracle network gathers data from leading exchanges and market makers, ensuring the accuracy and timeliness of price feeds. This integration ensures efficient access to high-frequency market data for users within the Morph ecosystem.\n\nMorph combines optimistic and zero-knowledge roll-up tech to create a DeFi-friendly space for developers, gaming, social media, and entertainment applications. Morph’s decentralized sequencer supports Web3’s key principles: decentralization, resistance to censorship, and security.\n\nMeanwhile, Pyth Network disrupts the financial data landscape by aggregating real-time price updates from exchanges and trading firms. This partnership represents a big step forward in boosting the growth potential of DeFi apps, sparking fresh ideas in decentralized finance.\n\nThe partnership between Morph and Pyth opens opportunities for developers to create DeFi applications. By harnessing scalable infrastructure and dependable data sources, this collaboration is set to revolutionize decentralized finance, enhancing growth and creativity within the Ethereum ecosystem."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxNZ0dvNUtaa1QyeW1ZQlUyV0xGVm9DUnZ5TXk2Wmt0Qzlvd0hUWjh6aHJzclhwN2pMaUZXekxwTlQ5QzFac3NFMjVOUXhObzV4OTh1NkpFVWtDSTZYUEZPUkVXWWExUkVtT01jajRJTGNLV3BGdmwwZTJHWFBCS1JNZEtkYlRPZ3gyeGJVbDBzVHhHeHRDZUZTT0Fn0gGfAUFVX3lxTFB1c2YtSTY0ZDBJVlpVVGw3NmNvV2dMLV8za01mRnRvVUREMjY5dTQ2NDlfV20ySl9CLUJSRVE3TXkwWFpKcS00clhfOEJaQXBoSzg0SXhTNE1HcTJXRnM1S04xODk1RDNjdkx3RjVNOFhLTGpzWGZWYlNKeTdjWHVpWURPUmE3WHFWMy1KTG5GRnBwbE10TjN1Vk85bE1qaw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Apr 2024 07:00:00 GMT",
        "title": "Solana, Ethereum, Bitcoin Price Analysis — American Roundup April 23 - CoinGape",
        "content": "Bitcoin price analysis: The crypto market depicts a calm environment on Tuesday heading into the American session. Bitcoin, the largest cryptocurrency, jolted upward after halving but the momentum garnered was not strong enough to uphold gains above $67,000.\n\nFor many people in the market, it might be imperative to say that BTC lacks direction, leaving altcoin majors like Ethereum (ETH) and Solana (SOL) oscillating in tight ranges.\n\nadvertisement\n\nEthereum, for instance, steadied above $3,000 but currently pivots around the $3,200 mark. A similar outlook is depicted by Solana which climbed above $150, following the correction to $120, but failed to break above the hurdle at $160.\n\nThe two competitive smart contracts tokens ETH and SOL, are trading at $3,184 and $154 during US business hours.\n\n1. Bitcoin Price Analysis: Assessing BTC’s Future Above $66,000 Support\n\nBitcoin price holds above the $66,000 level at the time of writing, but is seemingly pivotal — suggestive of the inability to find direction.\n\nThe 200-day Exponential Moving Average (EMA) (the line in purple on the chart) provides the next immediate support below the $66,000 level. Slightly under it are the other two key moving averages, the 20-day EMA and the 50-day EMA (the blue and red lines overlaying the chart).\n\nBased on the outlook of the Relative Strength Index (RSI) in the neutral region at 58 bulls may continue with the struggle for a breakout in the short-term. However, sellers do not have a lot of influence, especially with investors likely to be holding onto their coins anticipating a post-halving rally.\n\nBitcoin price has continued to exhibit strong fundamentals, pointing to a parabolic post-halving rally in 2024 and 2025. According to a chart shared by @ali_charts, its available supply shrunk to approximately 4.6 million for the first time ever before the recent halving cycle started.\n\nFor the first time ever, the available #Bitcoin supply decreased to about 4.6 million $BTC before this halving cycle began. Why does this matter? The halving further slashes miner rewards, accelerating the scarcity of new #BTC. As supply tightens, and even if demand remains the… pic.twitter.com/wGVmsW0K8t — Ali (@ali_charts) April 22, 2024\n\nWith miner rewards slashed by half to 3.125 BTC, supply is expected to keep decreasing, further driving Bitcoin’s scarcity. It is this fundamental quality that shrinks supply, as demand remains the same or increases which promises a significant impact on the price of BTC.\n\nBreaking above $68,000 and $70,000 may trigger FOMO and create a clear path to a new all-time high eyeing $80,000 in the short term and $100,000 toward the end of the year.\n\n2. Ethereum Price Hangs At The Edge Of A Cliff\n\nEthereum like Bitcoin, is unable to move past its immediate resistance at $3,250. On the downside, the oscillatory movement at $3,200 shows a lack of direction.\n\nThe confluence support created at $3,160 by the 20-day EMA and the 50-day EMA limits downward movement at the moment.\n\nHowever, with the RSI neutral and retreating toward the midline (50) and the oversold area (below 30), sellers may regain control, and trigger more losses to $3,000 this week.\n\nEthereum price tested support at $2,900 last week as geopolitical tensions thawed in West Asia between Israel and Iran. Such a move cannot be ruled out yet, especially with the expiry of Bitcoin and Ether options around the corner.\n\nOn the upside, breaking above the the yellow resistance band or the 200-day EMA could fuel the next uptick in Ethereum price targeting highs above $4,000.\n\n3. Solana Price As Correction Lingers\n\nThe Money Flow Index (MFI) has about turned on the four-hour chart, hinting at a brewing correction in Solana price. Movement on the upside has been capped under the previous day’s open of $157 and slightly above it is the 200-day EMA.\n\nIt is worth noting that, the presence of the above resistance levels does not imply immediate losses in SOL. Traders should be aware of the 20-day EMA and the 50-day EMA catching up to Solana price and aligning to support and prevent correction below the $150 level.\n\nIf the MFI stabilizes at 60, and bulls take up more long positions in SOL, a recovery may ensue within the American session and continue to Wednesday’s Asian session for a debut above $160.\n\nRelated Articles\n\nJohn Isige John is a seasoned crypto expert, renowned for his in-depth analysis and accurate price predictions in the digital asset market. As the Price Prediction Editor for Market Content at CoinGape Media, he is dedicated to delivering valuable insights on price trends and market forecasts. With his extensive experience in the crypto sphere, John has honed his skills in understanding on-chain data analytics, Non-Fungible Tokens (NFTs), Decentralized Finance (DeFi), Centralized Finance (CeFi), and the dynamic metaverse landscape. Through his steadfast reporting, John keeps his audience informed and equipped to navigate the ever-changing crypto market.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMi7wFBVV95cUxOalNpT0xZNUxqcS1FMGFnUG9XUTZaNVBTbFNSUXVPMC01TGVfSC1TcXZVcnZiQ2hZc0dSNFgxRV9qby1hejQyNDZXdlA0a2t2OXNMZ0pEWDFUNjNONktQeGRwQlZmcF9RTmFfTUtwUmdRVzFjaEZBVC1YU1RiVi1vVjFWNEIwODlUMk9VUkphVDRZM3VoSlhxQjBGemdsMHFXV21zekVna0FhckNVdEt4cjRDVkRZUlE5ajktLXBOaWw4Y29rTHYySGVsR0hEWXJ0QTRBXzBKTDhkTlV4N2JCaV9lRzV3QnhkalB1U1o3NNIB9AFBVV95cUxOcU1VU3hKWVNteGxoLTlLUTFjTXl3aWk2bloxTDlqbTUtLWN6dEo0em0xb2QzZjVmTHVoelp3SkRFSFE2N2p1ejYzclVTNk9tMW53TDIzaEtHTU10aTRlWTZYQ0hORzFrRnpRdE5hUHc0a3dNaEVBU09iTzBTc3R2VGlmSmhIRGZ0NTVGZ1JfREtXaGV4R0lxV3I4ZDJBcHZGbXJ2MFF4RTFKU1hhY2ZNcV9XOHd3OUhENmh6N1R6OVV4Z29wZm9aamg3cU1kQTJqdUpvY1JHVFFQVTNRUXA2ckhTOWttY3pvY3c2YlJ1YlN6MXdk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Apr 2024 07:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: BTC lateralizes with lots of orders above and below - FXStreet",
        "content": "Bitcoin price must stay above the 0.382 Fibonacci retracement level to continue the trend.\n\nEthereum price could drop to 200-day SMMA at $2,957 before ETH bulls flock the scene.\n\nXRP will only be attractive to buy once Ripple price enters golden zone between $0.5453 and $0.6235.\n\nBitcoin (BTC) price dropped during the New York session on Wednesday, whiplashing over $100 million in positions. Ethereum (ETH) and Ripple (XRP) price dropped in the aftermath, with global cryptocurrency market capitalization dropping by $50 billion, a 2% drop to $2.41 trillion. Over the past couple of weeks, most sell-offs have occurred during the New York session.\n\nAlso Read: Bitcoin price could be primed for correction as bearish activity grows near $66K area\n\nThe market is calm and hasn't yet chosen its direction\n\nDespite the drop in Bitcoin price, the market remains calm, seen with the single-digit drops of at most 5%. For now, anything is possible, and big news could be the catalyst to push the price up. From a technical standpoint, the setup remains promising. The market is only lateralizing because of the many orders above and below the current BTC price.\n\n#Bitcoin Both gaps in nearby proximity still open technically, but filled for the most part.\n\n\n\nOnly like a ~$100 gap left on both sides which is often considered as closed. https://t.co/EaZb7FduO1 pic.twitter.com/YOuIgKhHa9 — Daan Crypto Trades (@DaanCrypto) April 24, 2024\n\nBitcoin price must close above 38.2% for short-term upside\n\nBitcoin price is sitting atop support due to the 38.2% Fibonacci retracement level of $64,628. If this buyer congestion level is lost, BTC would fall in the hands of the bears, shown by the gray spikes on the volume profile to show a lot of bearish activity taking place below the aforementioned Fibo level.\n\nAn extended fall, where Bitcoin price breaks and closes below $62,374 on the 4-hour chart would confirm the continuation of the downtrend to the $60,000 psychological level.\n\nWith the nose-diving Relative Strength Index (RSI), buying pressure is dropping fast, worsened by the Moving Average Convergence Divergence (MACD), which has just crossed below its signal line to show the beginning of a short-term bearish cycle.\n\nBTC/USDT 4-hour chart\n\nOn the other hand, if the bulls can hold above the 38.2% Fibonacci retracement level, and close above $64,628 on the four-hour time frame, it would encourage more buy orders. The ensuing demand pressure could see Bitcoin price move to retake the 50% Fibonacci placeholder at $66,189.\n\nBeyond this level, BTC bulls would have a home run to the $70,000 price range, which would set the tone for a reclamation of the $73,777 all-time high and potentially even a new peak.\n\nAlso Read: Bitcoin price holds above $66K as Morgan Stanley files prospectus to add BTC ETF exposure in two of its funds\n\nEthereum price likely to retest the 200-day SMMA\n\nEthereum price is consolidating within a falling wedge pattern. While this bullish reversal pattern continues to hold, ETH is suffering the aftermath of weakness in the market after sentiment from the drop in BTC price spilled over to altcoins.\n\nIf the RSI closes below the 50 mean level on the eight-hour time frame, accentuated by a bearish crossover of the MACD below the signal line, it could instigate a sell-off. The initial target for Ethereum price in such a directional bias would be around the 200-day Smooth Moving Average (SMMA) at $2,957.\n\nETH/USDT 8-hour chart\n\nOn the other hand, if the bulls recover the market, the Ethereum price could overcome the roadblock due to the 50-day SMMA at $3,284. This could set the pace for an extended climb above the $3,406 barricade.\n\nA decisive candlestick close above $3,284 level, followed by consolidation above it would set the tone for a breakout to activate the falling wedge pattern. The target objective for this pattern is a 25% move above the breakout point, achieved by determining the average height of the wedge.\n\nAlso Read: Ethereum ETF issuers not giving up fight, expert says as Grayscale files S3 prospectus\n\nRipple price must foray into the Golden Zone to entice XRP bulls\n\nRipple price remains below the 61.8% Fibonacci retracement level of $0.5453, with mounting overhead pressure from the 21, 50 and 200-day SMMA at $0.5658, $0.5771 and $0.5561 levels, respectively. For XRP to become attractive for buying, the price must overcome these blockades into the Golden Zone.\n\nThe Fibonacci Golden Zone is a key area in price charts that signals potential stabilization or reversal points after significant market movements, with the 61.8% and 50% levels forming the crucial Golden Zone.\n\nA candlestick close above the 50% Fibonacci placeholder of $0.5844 would entice more bulls, sending XRP price past the 38.23% Fibonacci retracement level of $0.6235.\n\nXRP/USDT 1-day chart\n\nIf the 61.8% Fibonacci retracement level holds as resistance, however, the XRP price could drop. A candlestick close below the 78.6% Fibonacci retracement level would invalidate the bullish thesis, whereas the price recording a lower low below $0.4188 would signify a trend reversal to the downside.\n\nNotice the RSI below the 50 level. If the trajectory extends, it could soon record a lower low, worsened by the MACD that remains in negative territory.\n\nAlso Read: XRP Price Outlook: A breakout or significant price movement may be imminent for Ripple’s token"
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE1Dc3dNR25lUHBDSHZkQURVZFBNT0wwX0pwS1g1Z0lkcTR6YUZpTVRvSkU4azF2RF9CUndpV3RBQzYwUDlHbkh3QW50d004N1hNeDRpemJyMUd6Zkhhb3NyUVo3RmZId0JiVmdNSVBpNFU4cVRpeTdGc3BTTU0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Apr 2024 07:00:00 GMT",
        "title": "EigenLayer Crypto Restaking: What Is EigenLayer? - CoinCodex",
        "content": "EigenLayer is an Ethereum crypto-restaking protocol designed around the concept of “pooled security.” In simple terms, users can restake their already staked ETH with EigenLayer, and the protocol then allows external services like bridges, liquid staking protocols, and others to connect to EigenLayer and use its pooled funds.\n\nAs of April 9, 2024, EigenLayer launched the blockchain’s mainnet and EigenDA, a data availability service that allows external networks to base their own security on Ethereum via EigenLayer’s smart contracts.\n\nIn this article, we are going to explain how EigenLayer works, which crypto assets it supports, and its current state of development.\n\nKey highlights: EigenLayer enables Ethereum stakers to restake their staked funds, thereby enhancing pooled security for connected services and making the network more resilient to attacks.\n\nThe protocol incorporates a mainnet and a data availability service called EigenDA, which extends Ethereum's security to other networks through smart contracts.\n\nUsers who restake their Ethereum or liquid staking tokens through EigenLayer can potentially earn additional rewards once the planned functionalities like restaking rewards distribution are activated.\n\nDespite current functionalities being under development, EigenLayer has already attracted significant interest and funds, positioning itself as a pivotal player in Ethereum's staking landscape.\n\nWhat is staking in crypto?\n\n\n\nCrypto staking in a Proof-of-Stake (PoS) system is like putting money in a savings account. Instead of using lots of computer power to secure the network and process transactions like in Bitcoin and other Proof-of-Work (PoW) systems, participants stake some of their own crypto. By doing this, they get a chance to be chosen to validate transactions and add new blocks to the blockchain. In return for helping secure the network, they earn rewards, similar to earning interest in a savings account.\n\n\n\nLearn more: Ethereum Staking Explained: Is ETH Staking Worth It?\n\nWhat is EigenLayer crypto restaking, and how does it work?\n\nEigenLayer enables Ethereum stakers to basically reuse their staked funds and restake them for the purpose of pooled security provided by the EigenLayer protocol. This has two benefits:\n\nServices leveraging EigenLayer’s infrastructure can tap into the protocol’s pooled security and drastically reduce the viability of protocol attacks. For example, if a project has $1 billion staked for security, an attacker could gain control of the controlling share of staked assets (in the case of many PoS blockchains, that’s 67% or $670 million in our example) and validate invalid transactions and make other blockchain changes. Meanwhile, let’s say that there’s $10 billion in pooled security funds deposited via EigenLayer. If that same project used EigenLayer’s pooled security, it would become 10 times as difficult for an attacker to gain access to a controlling share of funds. Keep in mind that the figures used in this example are purely hypothetical.\n\nUsers who stake their ETH provide security to actively validated services (services connecting to EigenLayer) and earn staking rewards for their efforts. Contributing ETH for native restaking or liquid staking tokens for liquid restaking allows users to reuse their funds and earn double rewards. For example, if you participate in a liquid staking solution like Lido and receive stETH in return, you can reuse your stETH and restake it through EigenLayer.\n\nThe EigenLayer protocol allows new services and products built atop Etheum to bootstrap their security to Ethereum, which reduces the fragmentation of funds and simultaneously increases the security of each service thanks to the concept of pooled security. In other words, EigenLayer repurposes Ethereum’s blockchain security to cover other protocols built on the same network.\n\nA graphic showing how EigenLayer’s blockchain architecture is built atop the Ethereum network. Image source: EigenLayer\n\nEigenLayer’s core architecture can be split into four main parts: restaking, operators, delegation, and actively validated services (AVSs). Here’s how EigenLayer describes each one:\n\nRestaking enables stakers to restake their Native ETH or Liquid Staking Tokens (LST) to provide greater security for services in the EigenLayer ecosystem, known as Actively Validated Services.\n\nenables stakers to restake their Native ETH or Liquid Staking Tokens (LST) to provide greater security for services in the EigenLayer ecosystem, known as Actively Validated Services. Operators are entities that help run AVS software built on EigenLayer. They register in EigenLayer and allow stakers to delegate to them, then opt-in to provide various services (AVSs) built on top of EigenLayer.\n\nare entities that help run AVS software built on EigenLayer. They register in EigenLayer and allow stakers to delegate to them, then opt-in to provide various services (AVSs) built on top of EigenLayer. Delegation is the process where stakers delegate their staked ETH to operators or run validation services themselves, effectively becoming an operator. This process involves a double opt-in between both parties, ensuring mutual agreement. Restakers retain agency over their stake and choose which AVSs they opt-in to validate for.\n\nis the process where stakers delegate their staked ETH to operators or run validation services themselves, effectively becoming an operator. This process involves a double opt-in between both parties, ensuring mutual agreement. Restakers retain agency over their stake and choose which AVSs they opt-in to validate for. Actively Validated Services are services built on the EigenLayer protocol that leverage Ethereum's shared security. Operators perform validation tasks for AVSs, contributing to the security and integrity of the network. AVSs deliver services to users (AVS Consumers) and the broader Web3 ecosystem.\n\nare services built on the EigenLayer protocol that leverage Ethereum's shared security.\n\nEigenLayer restaking types\n\nThe restaking process can be split into two main categories: liquid restaking and native restaking. We’ll explore each in more detail in the following sections.\n\nUsers can connect with MetaMask or other Ethereum wallets and use native or liquid restaking via EigenLayer’s dashboard. Image source: EigenLayer\n\nLiquid restaking\n\nLiquid restaking refers to the process of depositing liquid staking tokens into smart contracts belonging to EigenLayer. As of this writing, the protocol supports 12 different liquid staking tokens, which are as follows:\n\nstETH (Lido)\n\nrETH (Rocket Pool)\n\ncbETH (Coinbase)\n\nwBETH (Binance)\n\nswETH (Swell)\n\nAnkrETH (Ankr)\n\nEthX (Stader)\n\nOETH (Origin ETH)\n\nsfrxETH (Frax Ether)\n\nlsETH (Liquid Staked ETH)\n\nmETH (Mantle Staked Ether)\n\nosETH (Stakewise)\n\nNative restaking\n\nIn addition to liquid staking tokens, EigenLayer can be used by native Ethereum stakers as well, which are users who operate an Ethereum Validator node. It’s worth noting that in order to run a node, 32 ETH must be locked up.\n\nEthereum validator’s credentials must be changed to EigenLayer’s smart contracts if you want to take advantage of the restaking process. Here’s how EigenLayer’s documentation describes the process of enabling native restaking:\n\nCreate New EigenPod, Set Withdrawal Credentials, Enable Restaking Upgrade Existing EigenPod Withdraw from EigenLayer\n\nFor additional information, we suggest you consult the official documentation.\n\nEigenLayer restaking rewards\n\nOne of EigenLayer's key selling points is the ability to earn additional rewards on tokens that have already been staked. Let’s say you are using a liquid staking service like Lido, which allows you to earn about 4% APY on staked ETH. In addition to earning that 4%, you get stETH, which can be traded freely. EigenLayer allows you to stake stETH (essentially restaking ETH). Once staked with EigenLayer, stETH can earn you additional staking rewards.\n\nAt the moment, staking rewards are not being paid out to users who have deposited their funds through EigenLayer. According to the team, the functionality is expected to roll out later in 2024, along with slashing features (the ability to punish validators who misbehave by burning their stake).\n\nUsers and services connected to EigenLayer currently do not earn any restaking rewards since the functionality has not yet been launched. However, users do earn points, which are assumed will be convertible to crypto tokens once the functionality goes live later this year. Also, there’s no information about EigenLayer restaking yield.\n\nCurrent status and latest news\n\nDespite the lack of core functionality like restaking reward distribution and slashing, EigenLayer has attracted considerable attention from both individual and institutional investors. As of this writing, more than $15 billion worth of crypto assets have been deposited into EigenLayer’s smart contracts, with the lion’s share belonging to WETH and stETH.\n\nEigenLayer Total Value Locked (TVL). Source: DeFi Llama\n\nAccording to recent comments made by EigenLayer founder Sreeram Kannan when speaking to CoinDesk, they are “allowing the EigenLayer marketplace to develop and stabilize before introducing in-protocol payments and slashing to mainnet later this year.”\n\nMeanwhile, several services have already tapped into EigenLayer’s architecture to boost their security and attract new users. For example, Ethena, a synthetic dollar protocol launched via Binance Launchpool last month, connects with EigenLayer with a focus on providing higher returns for its users.\n\nThe bottom line\n\nEigenLayer introduces a new paradigm to the blockchain space, allowing users to stake assets that they’ve already staked to earn additional staking rewards and an extra layer of security. In addition, it allows protocols to leverage pooled savings, which makes it more difficult for malicious actors to gain a controlling share of assets in a Proof-of-Stake network.\n\nEthereum is certainly among the most popular and best-developed staking ecosystems in the crypto industry. To learn more about other top networks, check out our list of the best cryptocurrencies to stake in 2024."
    }
]