[
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxNcDJlaTY1cHFMdzdvYlJEdkFMU3lZMElUbWp3WVpjTmtndGE2QVFTU29aeDR2bmZBVVlpRVhiY2piWHdMa2hlNVBodGNrWHNJZFhBNHpCOThJWWN6eU9wdDRiZldUclFTRnhBSm4ycWpxQ1p2UlA4dWFNazdta0oyX01Jcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jul 2024 07:00:00 GMT",
        "title": "What Is The Ethereum Foundation? - DisruptionBanking",
        "content": "The Ethereum Foundation is a pivotal entity in the cryptocurrency sector. Founded in 2014, this Swiss-based non-profit organization has been the backbone of the Ethereum blockchain, spearheading its development and ensuring its sustainability. Ethereum, often described as the world’s programmable blockchain, owes much of its success and innovation to the efforts of the Foundation.\n\nEthereum Foundation: Company or Charity?\n\nOne common question is whether the Ethereum Foundation operates as a company or a charity or is the same organization as Ethereum.\n\nThe Ethereum Foundation (EF), also dubbed “Stiftung Ethereum,’’ established in 2014 in Zug, Switzerland, is not quite a company and not exactly what you’ll call a charity in the conventional sense, at least. Technically, it’s a non-profit organization that functions similarly to a charity, with a central mission: to shepherd the development and widespread adoption of Ethereum — the second-largest blockchain platform after Bitcoin — and the technologies surrounding it. However, its role extends beyond traditional charitable activities.\n\nMission and Goals: A Public Good for All\n\nThe EF’s mission is to secure a prosperous, decentralized, and enduring future for the Ethereum ecosystem.\n\nIf the Ethereum Foundation can be viewed as a public good entity that focused on harbouring & nurturing an early community of missionaries…\n\n\n\n… then L2s can also be viewed as the new business development & partnership arm of Ethereum that brings in the next generation of Web2… — Patrick McCorry (💙,🧡) (@stonecoldpat0) June 19, 2024\n\nIt’s not about leading or controlling Ethereum but nurturing its growth and supporting benevolent actors within the ecosystem. The EF’s goals are to maintain Ethereum as a public good — directed by none and useful for all. This includes funding research and development, supporting infrastructure, and fostering community growth.\n\nSignificance and Key Contributions of the EF to the Ethereum Ecosystem\n\nsell 70,000 ETH, totaling, approximately, $100 million for the foundation. The Ethereum Foundation has helped ETH grow. Without the Ethereum\n\nFoundation, ETH would be less successful. It was gifted ETH and it used it in order to fund\n\nventures to help promote itself and ETH. — John E Deaton (@JohnEDeaton1) January 6, 2021\n\nThe influence of the EF on the cryptocurrency environment is substantial. It dedicates resources to essential projects, benefiting developers and researchers devoted to enhancing Ethereum’s capabilities. The EF nurtures the ecosystem and champions positive contributors through grants, research endeavors, and programs like the Ethereum Fellowship, which focuses on untapped talent and areas ripe for blockchain innovation. It’s one part of a much larger ecosystem that serves as a catalyst for innovation within the Ethereum ecosystem.\n\nThe EF’s support extends to a broad scope of projects, including solutions for scalability, community building, security, privacy, and more. Here’s a breakdown:\n\nAcademic Grants:\n\nThe Ethereum Foundation endorses scholarly grants aimed at advancing research related to Ethereum. In its 2023 initiative, the foundation supported 43 projects spanning 20 nations, covering fields including cryptography, economics, security, and consensus mechanisms. These grants have helped advance knowledge, foster collaboration, and drive innovation within the Ethereum community.\n\n📣 The first ZK Grants Round is now open!\n\n\n\nThe Ethereum Foundation, in collaboration with Aztec, Polygon, Scroll, Taiko, and zkSync, contributed $150K each to the shared prize pool, totaling $900K.\n\n\n\nApply before March 18th! 👇https://t.co/u1lGRfc4CV — Ethereum Foundation (@ethereum) February 21, 2024\n\nCommunity Engagement:\n\nThe Ethereum Foundation actively engages with the community through platforms like GitHub and Discord.\n\nTheir efforts have increased contributions, with GitHub contributors rising by 57% and Discord community members nearly doubling.\n\nDevcon Conferences:\n\nDevcon, organized by the Ethereum Foundation since 2014, has become a premier event for enthusiasts, developers, and researchers. These conferences foster collaboration, knowledge sharing, and the birth of new ideas that drive Ethereum’s evolution.\n\nwhat to expect as a Scholar: financial support, pre-Devcon community & programming, an amazing week at Devcon in Bangkok, and a post-Devcon learnings.https://t.co/FAwBYd90PM — Deva the Devcon Unicorn (@EFDevcon) July 5, 2024\n\nEcosystem Support Program (ESP):\n\nAs an extension of the Ethereum Grant Program, ESP provides financial and non-financial support to projects within the Ethereum ecosystem.\n\nBy nurturing promising initiatives, ESP has contributed to the growth of decentralized applications, tools, and services in the past and present day.\n\nFellowship Program:\n\nThe Ethereum Foundation Fellowship Program aims to address gaps in representation across cultures, nationalities, and economic classes. It identifies and supports unique and talented individuals, breaking down barriers to entry for underrepresented people and communities in the Web3 space.\n\nEthereum for the Next Billion: Today, @AyaMiyagotchi unveils the new EF Fellowship Program, and discusses the Foundation's role and a vision for #Ethereum's long-term sustainability in a decentralized world.\n\n\n\nRead more: https://t.co/BNnAdH7erH — Ethereum Foundation (@ethereum) May 7, 2021\n\nImpacts and Achievements\n\nThrough all the key contributions of the Ethereum Foundation highlighted above, the Ethereum ecosystem now boasts of many achievements and giant strides, with tens of crypto projects successfully executed and DeFi startups birthed under their belt. To list a few:\n\nDecentralized Finance (DeFi):\n\nEthereum birthed DeFi, a movement that transformed traditional financial services. Notable platforms include:\n\nUniswap, launched in November 2018, introduced automated market-making (AMM) and liquidity pools, enabling decentralized token swaps. Aave, founded in January 2020, pioneered flash loans and became a leading lending protocol. MakerDAO, established in December 2017, its DAI stablecoin provided stability in a volatile market.\n\nEthereum’s Robust DeFi. Source: The Block\n\nBy July 2024, DeFi protocols collectively held over $100 billion in Total Value Locked (TVL).\n\nNFT Renaissance:\n\nEthereum’s smart contracts remodeled NFTs for the crypto industry. The Ethereum Foundation established NFT standards (ERC-721 and ERC-1155) that shaped the NFT ecosystem.\n\nScaling Solutions:\n\nOptimistic Rollups , introduced in 2022, enhance scalability by batching transactions off-chain and submitting proofs on-chain.\n\n, introduced in 2022, enhance scalability by batching transactions off-chain and submitting proofs on-chain. Zero-knowledge Rollups (zk-Rollups), deployed in 2023, further reduce fees and improve user experience.\n\nEth2 Beacon Chain:\n\nProof-of-Stake (PoS) Transition: The Beacon Chain shipped on December 1, 2020, and formalized PoS as Ethereum’s consensus mechanism with The Merge, aka the “Shanghai Upgrade,” on September 15, 2022. During this event, Ethereum successfully switched from “Proof of Work” (PoW) to another system known as “Proof of Stake” (PoS). This change was a huge accomplishment because it significantly decreased the network’s energy, making the platform much more environmentally friendly. This marked the beginning of a new, more sustainable phase for Ethereum.\n\nThese contributions demonstrate the Ethereum Foundation’s commitment to advancing the ecosystem, which continues to grow in leaps and bounds to date.\n\nThe Names Behind the Ethereum Foundation\n\nAt the heart of the Ethereum Foundation is Vitalik Buterin, a prodigy in the crypto world. Alongside Vitalik, other key figures include Aya Miyaguchi, the Executive Director, and a team of dedicated developers and researchers who work tirelessly behind the scenes.\n\nVitalik Buterin\n\nEthereum co-founder Vitalik Buterin has significantly influenced the blockchain space, contributing to high-level roadmaps and technological advancements, including the Ethereum Improvement Proposal (EIP) 7702. His work has earned him recognition, such as a spot-on Forbes’ 30 Under 30 list in 2016.\n\nEthereum's co-founder, VitalikButerin, clarifies his recent ETH transactions. They're not personal sales, but donations to support charitable causes. His unwavering commitment to Ethereum's future shines through!\n\n\n\n#Ethereum #CryptoPhilanthropy pic.twitter.com/x4u6xXpNAH — Hamid (@HaMidOwAiSi3) October 18, 2023\n\nGavin Wood\n\nGavin Wood, co-founder of Ethereum and creator of Polkadot, invented Solidity and defined the Ethereum Virtual Machine (EVM) in 2014. He served as the Ethereum Foundation’s first CTO.\n\nDr. Gavin Wood appreciation tweet.\n\n\n\n✅ Co-founder of Ethereum with Vitalik\n\n\n\n✅ Proposed & helped develop Solidity language\n\n\n\n✅ Released the Yellow Paper defining Ethereum Virtual Machine\n\n\n\n✅ Founded Polkadot & the Web3 Foundation\n\n\n\n✅ Donated $5.8 million in crypto to Ukraine pic.twitter.com/2ci4S407i2 — Hamza ⚡ Marmooz (@marmooznet) March 18, 2022\n\nMing Chan\n\nMing Chan, as the Executive Director of the Ethereum Foundation from 2015 to 2018, significantly improved the Foundation’s efficiency and reduced costs through reorganization. She also fostered relationships with academic groups like IC3.\n\nLittle known fact, #Ethereum owes it's existence to @mingchan88, for keeping the Foundation afloat long enough to pass Swiss regulations and gain access to its genesis Ether. Without her, high chance the EF would have gone bankrupt before Ethereum's 1st birthday. https://t.co/x4G4b6N0TO — Péter Szilágyi (karalabe.eth) (@peter_szilagyi) December 2, 2020\n\nAya Miyaguchi\n\nAya Miyaguchi, the current Executive Director of the Ethereum Foundation, leads its support for the Ethereum ecosystem through research, development, and education. She aims to preserve Ethereum’s open-source, inclusive, and permissionless nature.\n\nApart from Vitalik Buterin, Aya Miyaguchi, and co, there are several other key figures in the Ethereum Foundation and the Ethereum ecosystem, by extension, including the likes of Joe Lubin and Charles Hoskinson (both co-founders of Ethereum), Jeffrey Wilcke (as part of the Technical Steering Group), Patrick Storchenegger, and Jeremy Wood.\n\nMay 16, 2019\n\nAya Miyaguchi, Executive Director, Ethereum FoundationShe is on the @EMPOWR_us list of EEA members who may have communicated with Bill Hinman.(List Below)\n\nAn entire discussion on how they are using Ethereum to fund the foundation. pic.twitter.com/gegnKLlXBh — Digital Asset Investor (@digitalassetbuy) April 26, 2022\n\nThese individuals have made significant contributions to the Ethereum Foundation and the broader Ethereum ecosystem. Their collective efforts have helped shape Ethereum into the powerful and versatile platform it is today.\n\nThe Ethereum Foundation is a unique entity that blends the characteristics of a non-profit with the dynamism of a tech company. Under the leadership of visionaries like Vitalik Buterin and Aya Miyaguchi, it has made significant strides in advancing the Ethereum ecosystem. With ongoing projects and a clear vision for the future, the Foundation’s role in the crypto world is set to grow even more influential.\n\nAuthor: Ayanfe Fakunle\n\nThe editorial team at #DisruptionBanking has taken all precautions to ensure that no persons or organisations have been adversely affected or offered any sort of financial advice in this article. This article is most definitely not financial advice."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiYkFVX3lxTE15czVoaEczNUxIM0g3Y1pwVmhGN0tnTlRkTEVpaWlZdGY3WkZoRGhyaFo1eHhtZ0FESTNrMy01aU1GY19ZdlpTaXdXaDFlSlp3OXdIMERGV3U3SUJ6azI5NU9n?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETFs to launch July 23, Bloomberg analyst says - Crypto Briefing",
        "content": "Ethereum ETFs to coincide with Bitcoin Conference, potentially boosting market attention.\n\nKey Takeaways Ethereum ETFs are scheduled to begin trading on July 23, as reported by Bloomberg analyst.\n\nBitwise CIO projects $15 billion in inflows for Ethereum ETFs by the end of 2025.\n\nShare this article\n\nThe starting date for spot Ethereum exchange-traded fund (ETF) trading in the US is July 23rd, according to Bloomberg ETF analyst Eric Balchunas. He shared on X that the SEC is answering issuers today, asking them to return their final S-1 forms on Wednesday, July 17th.\n\n“And then request effectiveness on Monday after close for a TUESDAY 7/23 LAUNCH. This is provided no unforeseeable last min issues of course,” he added.\n\nUpdate: Nate's instincts were right, hearing SEC finally gotten back to issuers today, asking them to return FINAL S-1s on Wed (incl fees) and then request effectiveness on Monday after close for a TUESDAY 7/23 LAUNCH. This is provided no unforeseeable last min issues of course! https://t.co/D21FD9Qf94 — Eric Balchunas (@EricBalchunas) July 15, 2024\n\nThe Ethereum ETF issuers filed their S-1 forms on July 8th but most of them left the fees out of their forms. According to Balchunas, this is likely a strategy from the asset managers to check how competitive the funds’ fees are, especially BlackRock’s.\n\nNotably, the S-1 form is an initial registration required by the US Securities and Exchange Commission (SEC) before a security can be publicly traded.\n\nAs highlighted by Balchunas’ fellow ETF analyst James Seyffart, this could mean that the Ethereum ETFs will start trading the same week as the Bitcoin Conference, set to happen in Nashville.\n\nThe launch of the spot Ethereum ETFs is a key step for crypto adoption by mainstream investors, as it solidifies the altcoin as a sound asset among institutional investors. An estimate by Bitwise CIO predicts that these investment instruments will capture $15 billion in inflows until the end of 2025, as reported by Crypto Briefing.\n\nMoreover, the Ethereum ETFs open the door for the approval of exchange-traded funds indexed to other crypto. VanEck and 21Shares both filed their form for the approval of the first spot Solana ETFs in the US on the last week of June."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQSFAtUElOT1Ridms2OThnZVhkLW02Y0FQR3lfMnB2QjJpaEtCdGNUc0o4M2IxaWFDUHZPN0ZpS09aaHZySHlqQ1pkam0yYk1iT1IzaDE2SUFwNnRza2lhaHNaQ2p4NUo4cGdKZDhxODV0TEw4MDNNMHgydXUtdDRZZGFPQXV5ZEFaWGVxSWpFYkdmSjA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jul 2024 07:00:00 GMT",
        "title": "Bloomberg analyst confirms Ethereum ETFs set to launch next week - CryptoSlate",
        "content": "The Securities and Exchange Commission (SEC) is anticipated to approve the spot Ethereum exchange-traded funds (ETFs) next week, with trading expected to begin on July 23, Bloomberg senior ETF analyst Eric Balchunas reported on July 15, citing industry sources.\n\nThe development follows recent communications between the SEC and ETF issuers, signaling a potential green light for the much-anticipated financial products.\n\nBalchunas revealed via social media that the SEC has instructed issuers to submit their final S-1 forms, including necessary fees, by July 17. The SEC is expected to request effectiveness after the close of business on July 22, paving the way for a Tuesday trading launch for the Ethereum ETFs.\n\nHowever, Balchunas added:\n\n“This is provided no unforeseeable last min issues of course!”\n\nThe news comes amid growing anticipation in the crypto community, with ETF Store President Nate Geraci, predicting this week as the likely approval period for spot Ethereum ETFs. He tweeted earlier in the day:\n\n“Welcome to spot eth ETF approval week… I’m calling it. Don’t know anything specific, just can’t come up w/ good reason for any further delay at this point. Issuers ready for launch.”\n\nThe timing of the SEC’s expected approval coincides with the largest Bitcoin conference of the year, adding to the excitement within the crypto sector.\n\nThe introduction of spot ETH ETFs is seen as a significant milestone for the crypto industry as it will provide investors with a new avenue to gain exposure to Ethereum through a regulated financial product.\n\nFollowing the launch, market observers anticipate substantial investment flows and the potential introduction of additional cryptocurrency-based financial products, including those based on Solana and other digital assets.\n\nBalchunas suggested that this marks the start of crypto ETFs, with other tokens set to follow in the footsteps of Bitcoin and Ethereum, starting with Solana. He said:\n\n“Keep in mind after launch there’s flows and then add’l eth products I’m sure, then Solana, and then… it’s prob never going to end. The dam has broken.”\n\nAs of press time, Ethereum was up 5.23% over the last 24 hours and trading at $3418, based on CryptoSlate data.\n\nEthereum Market Data At the time of press 12:27 am UTC on Jul. 16, 2024, Ethereum is ranked #2 by market cap and the price is up 6.94% over the past 24 hours. Ethereum has a market capitalization of $419.56 billion with a 24-hour trading volume of $18.13 billion. Learn more about Ethereum › Ethereum $3,489.98 6.94% Crypto Market Summary At the time of press 12:27 am UTC on Jul. 16, 2024, the total crypto market is valued at at $2.37 trillion with a 24-hour volume of $84.72 billion. Bitcoin dominance is currently at 53.80%. Learn more about the crypto market ›\n\nMentioned in this article"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxQOXNmUE55am56YURlZ21uWU93eldMRGNLY0NzSlZ6X2R5emV1TXBMRFY3UDlRSkJVNU1nOVIyRHZwcDJfQ0hfVnFkaDB5eXBhcDhXTTBQVDkzSEdTNXhSUW5HOTlXTThnU0liNUQwMHVxOHo0U3F6UDhfUFpLaWMyT0VPQTFBQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 07:00:00 GMT",
        "title": "'Ethereum Killer' Solana Could Soar To $174, Says Popular Crypto Analyst After Identifying This Bullish Pattern - Yahoo Finance",
        "content": "'Ethereum Killer' Solana Could Soar To $174, Says Popular Crypto Analyst After Identifying This Bullish Pattern\n\nInfluential cryptocurrency analyst Ali Martinez predicts a bullish run for Solana (CRYPTO: SOL), often touted as an ‘Ethereum (CRYPTO: ETH) killer,' amid growing market optimism around the digital asset.\n\nWhat Happened: On Monday, Martinez posted his optimistic prediction for Solana on X, formerly Twitter. He noted the formation of a “W” pattern in Solana’s chart, which prompted him to forecast a rise to $174.\n\n\n\n\n\n#Solana appears to be forming a W pattern, which suggests $SOL will surge toward $174! pic.twitter.com/OxXODWi1yA — Ali (@ali_charts) July 15, 2024\n\nAlso called a double bottom pattern in technical analysis, the “W” pattern typically occurs at the end of an extended bearish trend and signals a bullish reversal.\n\nSOL was last seen at around $174 more than six weeks ago in May. If Martinez’s prognosis comes true, it would mean a 13% bounce from its prevailing price.\n\nSee Also: Want to trade futures? Discover why 25 million chose this Chicago Bulls sponsor.\n\nWhy It Matters: Solana’s bullish market sentiment was supported by noted analysts in the cryptocurrency space. Syncracy Capital's Daniel Cheung predicted that the coin could reach 50% of Ethereum’s (CRYPTO: ETH) market valuation, while another trader, Eugene Ng Ah Sio, expressed confidence that it would become the market’s favorite.\n\nEarlier, VanEck and 21Shares filed S-1 registration forms with the SEC for a Solana ETF, marking a significant step towards opening up the world’s third-largest speculative cryptocurrency to mainstream investors.\n\nRead Next:\n\nIf you invested $100 in DOGE when Elon Musk first tweeted about it in 2019, here’s how much you’d have today.\n\n1 in 4 Americans own a share of Bitcoin according to NASDAQ, how many people got started through this free crypto faucet?\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nGet the latest stock analysis from Benzinga?\n\nThis article 'Ethereum Killer' Solana Could Soar To $174, Says Popular Crypto Analyst After Identifying This Bullish Pattern originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxQX2dpMnRpYW5sZlNFc3V6LWE4QlRBSmF0MmdDYVNjYkpTc1NJRHg4Ykl0ZWF1d3dRT1NRZ2poaWMwb3VHUndzbWZkZEFyMVFueTRDZ2toclhWVEpVMXVLd0RuSUNGOFdBa2RsOUFtSkFka2loRFctZ2xvdDRuY24ybEN3YXBjeTDSAYwBQVVfeXFMTlJLVmxwQmUzQnNlRVRUVHhCLTNKMzVUWWFwaTFoOFlBX3lkZVpjVWFPOU5yejUtQmczLTVVbEdMTlY4VktmTmlBYWJSMGZkMTJXTVBEOFJ2VkU3S3hJSUIyT05YSTZpUVl3ZjcwcEZPTENtR0dpQUh4ZTA3b0xKdzFXYU5fbWxyaTdZQnc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETF Approval Might Change Crypto Market in Unusual Ways - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nSince May, the crypto ecosystem has been anticipating the approval of S-1 registration for the spot Ethereum ETF. While top market experts have exhausted their projections regarding the timeline on which the product will launch, ETFStore President Nate Geraci said he sees no reason why the product would not go live this week.\n\nAdvertisement\n\nWelcome to spot eth ETF approval week…\n\n\n\nI’m calling it.\n\n\n\nDon’t know anything specific, just can’t come up w/ good reason for any further delay at this point.\n\n\n\nIssuers ready for launch. — Nate Geraci (@NateGeraci) July 14, 2024\n\nAs it stands, prospective Ethereum ETF issuers have come to terms to satisfy the United States Securities and Exchange Commission (SEC) by making amendments to their respective S-1 registration forms. With compromises already being recorded since spot Bitcoin ETF approval days, the market is not expecting any further delays.\n\nHowever, the concerns of many lie in what will become of the industry should the Ethereum ETF start trading. The conversation rests on its immediate impact on the market in terms of price gains.\n\nWhen the SEC approved 19b-4 filings in May, the update fueled a massive spike in the price of the coin, with a ripple effect on Bitcoin and altcoins more broadly. This rally, though short-lived, might get replayed when Ethereum ETF products start trading.\n\nThe bullish sentiment in price is already creeping in. At the time of writing, the price of Ethereum and trading volume are up 4.14% and 34.43% to $3,334.51 and $13,196,383,402, respectively.\n\nBesides price impact, the launch of the Ethereum ETF effectively lifted limitations for other altcoins gunning for similar product acceptance on Wall Street. Already, there are active applications for a Solana ETF from VanEck ⁠⁠⁠⁠⁠⁠⁠, and 21Shares has already broken the push for the product with a Bitcoin and Ethereum duopoly.\n\nThe Ethereum ETF trading and potential capital injection might confirm what crypto proponents have been projecting for a while now: fact that there is a subtle demand for mainstream, regulated crypto products."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE4waHc3ZzQxWDdYbFZUQlpfamtxYTlJSFBvM0FiTGV3a01tV0JtWDY3Y0ZTTFR0VzZSVU4wTTlVV1g4V3M1bU5ndEl0NWFPWWxOcm4tVWJfLXBudHVFVC1WZ2dkTGc2MWQzVTRDdVBTNmlJQdIBd0FVX3lxTFBVOWRpTFZTekRWT042SUpRRk4tenFTemtWVWRZYmtXcXNaRk90T0oyTmxmakp1OGZ0aERieEU0N0ZSazJMd25sRUV0cVRRSXNqeFozbU14X2hWMG14NGk5VTdXSzA2azdXRUFXc28wNmhOdUxmOTQ4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETF Launch Date Announced by Top Analyst - U.Today",
        "content": "According to Eric Balchunas, Bloomberg's senior ETF analyst, Ethereum exchange-traded funds are set to be launched on July 23.\n\nAdvertisement\n\nProspective issuers have been asked to re-submit their final S-1 forms on Wednesday by the U.S. Securities and Exchange Commission.\n\nNotably, the launch of Ether ETFs will take place right in the middle of the Bitcoin 2024 Conference.\n\nIt is worth noting that the launch of these products could still be delayed due to last-minute issuers.\n\nAdvertisement\n\nEarlier today, Nate Geraci, president of the ETF Store, said that he could not come up with a \"good reason\" for the SEC to further delay the launch of these products, adding that issues are ready.\n\nAs reported by U.Today, the SEC approved 19b-4 filings for various spot Ethereum ETFs back in May in what appeared to be a major U-turn. Just days before the approval, these products were widely expected to be rejected by the SEC.\n\nHowever, there is still a lot of uncertainty regarding the level of demand that these products will manage to attract.\n\nFor instance, banking giant JPMorgan has predicted that these products will severely underperform compared to Bitcoin ETFs. However, crypto-native firms of the likes of Gemini expect Ethereum ETFs to be moderately successful.\n\nNotably, Coinbase researchers have forecasted that the launch of Ether ETFs could be either bullish or bearish for crypto markets depending on the amount of inflows.\n\nRegardless of how successful these products are going to be, the launch of the first spot altcoin ETFs would mark a historic shift.\n\nIn the meantime, VanEck and 21Shares have already submitted Solana ETF applications. However, analysts believe that their approval is unlikely to happen this year."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTFBFMlc5M0RlNlF4ZS1neWxEUVcxNktQUGxnQkdpaEhwUWdDMG9PS2ZYTmhoWlg2R0tYLXNtYmM4cUVCTkRrTjk2em9mTXlQZXJiTlZRQU53UFNwdFJxblEyQVctaGRwcXZYdGlrWEVQeVZSdkZfTm1MeNIBfkFVX3lxTE0wei1sWTV0azZGV0JMckRNbTUtdWV1VDkxcXRzNURnZW8ycTNucHhXaXV6d2FlZXVJdGV0QjZTZlhwU295WmowcExoOWtuTnAyZjRVQThrRm91b1Q4WERvTzdQMlVIOTFqbk5qVVpBcWtfQ3Z5eVVmR2xzbm5GQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Bull Run Sustained, Bad News: Speculators Are In - Bitcoinist",
        "content": "Like Bitcoin and top altcoins, including Solana, Ethereum is holding steady. At the time of writing, it is trading above the local support at $3,300 and floating higher, targeting $3,700.\n\nSpeculators Flowing To ETH As Bulls Set Sight On $3,700\n\nThe leg up is fueled by multiple market-related factors, mainly the anticipated launch of spot Ethereum ETFs in the next few days. As seen from the daily chart, news of the United States Securities and Exchange Commission (SEC) fast-tracking the approval of 19b-4 forms sparked a wave of demand from May 20.\n\nHowever, speculators are permeating the scene even as prices remain steady and uptrend. CryptoQuant data shows that the estimated leverage ratio has risen in the past few trading days.\n\nWith this reading ticking higher, the ETH scene receives more leveraged traders keen more on profiting from price volatility rather than benefiting from what ETH as a digital asset presents.\n\nAccording to CryptoQuant, the estimated leverage ratio stood at 0.347 on July 16 before rising to 0.354 on July 17. The expansion suggests that traders are increasingly borrowing funds on perpetual trading platforms like Binance and OKX, hoping to make a killing if ETH bulls push prices above $3,700.\n\nAs prices rally, the estimated leverage ratio will likely climb even higher. The local top is at 0.358, as recorded on July 14. The all-time leverage ratio was at 0.392, registered in early July 2024.\n\nEyes On Spot Ethereum ETFs: Will It Be A Success?\n\nEthereum traders are confident that prices will rise, even breaching all-time highs, once spot ETH ETFs are launched. The latest reports show that the derivative product will launch early next week, allowing institutional investors to gain exposure.\n\nThe United States SEC has given the green light to three issuers to launch. However, it is expected that all spot Ethereum ETF applicants whose 19b-4 forms have been approved will be permitted to launch simultaneously.\n\nConfidence is high that spot Ethereum ETFs will follow the success of their spot Bitcoin ETFs. According to SosoValue, all spot Bitcoin ETF issuers manage over $53 billion of BTC as of July 18.\n\nEven so, though highly anticipated and likely to positively impact prices, the product will see a different level of demand than when spot Bitcoin ETFs launched.\n\nAnalysts pin this to Ethereum’s lower market cap and the United States SEC’s decision not to allow spot ETF issuers to stake ETH. By staking, issuers would receive rewards on behalf of their clients.\n\nFeature image from Canva, chart from TradingView"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxNOHVxT1RlV3dDZXZWRElOX2VrSWdwQTdCcFFGSmc1R3N5SDgtWnNYWlVIQ0pIQy1vcmxnakhDWkZZV196c0hoXzhsaGdxMGJjOHVLcVl6N2FqYlk4MTdmczlXOEpCTGFWLUxaZVBSUGtESlNvSlRlLTZfMFlpbnRoZlBlUWxXc213bDFVRzFIdkNuX3lpeDdiWWdTaFBBR211OWRaby1LUFZucDZ1cEhHUkc1ZWVtOWZsZnhybVZDYkhUS0JaVEFoYXRoVEtkT3Y2dElVa0cwdTbSAd4BQVVfeXFMTzB2eEdzdkRpcmd6M1JzemU0RTdhejZpd0pMenNDQmZOT2U2OEtnOUJGQ3R5d1VSRXJEWFhySk9qTWpQY2wyQ25SS2lESWdsYmhSSHh4UUpPZU5uWnpvWVJPcUxaeVdMUlhDZEtEVEFDVXNPRHZZQmJkX2lMLU9QQ0JGcTUtVWp3LUlKT0ZVWHdXX0ZaX3FpVEd0eHlFLUwwcVFNLTRoVmVseFQyWkJJLWd6VFg5SGpBdEdla0xpS1l5ZWVkaE1Xem1BMy16TVZjYWFWdG5ycVZYZk5NNUp3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETFs to launch next Tuesday. Here’s why ETH's price could be set to explode - FXStreet",
        "content": "SEC preparing Ethereum ETFs to launch next week Tuesday after asking issuers to return final S-1s, says Bloomberg analyst.\n\nEthereum investment products raked in $72 million in inflows, its highest level since March.\n\nEthereum could set a new yearly high in the coming weeks after ETH ETF approval.\n\nEthereum is up more than 7% on Monday following updates from Bloomberg analysts that the Securities & Exchange Commission (SEC) would potentially greenlight spot ETH ETFs to launch next week Tuesday. The increased inflows across global Ethereum investment products also align with the new development, as traditional investors seem to be preparing for a potential rally ahead of the launch.\n\nDaily digest market movers: Why ETH ETFs could perform well\n\nIn an X post on Monday, Bloomberg analyst Eric Balchunas said that the SEC plans to launch Ethereum ETFs on July 23 (next Tuesday) after responding to issuers today. Balchunas highlighted that the SEC asked issuers to submit their final S-1s with fees included on Wednesday before the launch can take place.\n\nThis may be highly bullish for the entire crypto market, considering the Bitcoin conference will be taking place next week, and US presidential candidate Donald Trump is listed among the speakers.\n\nUpdate: Nate's instincts were right, hearing SEC finally gotten back to issuers today, asking them to return FINAL S-1s on Wed (incl fees) and then request effectiveness on Monday after close for a TUESDAY 7/23 LAUNCH. This is provided no unforeseeable last min issues of course! https://t.co/D21FD9Qf94 — Eric Balchunas (@EricBalchunas) July 15, 2024\n\nReuters also reported that three industry sources confirmed that the SEC gave \"preliminary approval\" to at least three issuers to launch their spot ETH ETF products next Tuesday, provided they submit their updated S-1s before the week runs out.\n\nEight issuers, including Grayscale, Fidelity, BlackRock, 21Shares, VanEck, Bitwise, Franklin Templeton and Invesco, will potentially launch their spot ETH ETFs on the same day.\n\nThe SEC approved issuers' ETH ETF 19b-4 filings last week but needs to greenlight their S-1 registration statements before the products can begin trading. Issuers submitted their updated S-1s with the SEC last week after the agency made light comments on them.\n\nMeanwhile, traditional investors are turning bullish on Ethereum as the ETH ETF launch draws closer. This is evidenced in the recent weekly performance of global Ethereum ETFs, which witnessed inflows of about $72 million, its highest level since the market rally in March, according to data from CoinShares.\n\nWhile some analysts have predicted that ETH ETFs may underperform, the recent growth across international Ethereum ETFs suggests otherwise. Additionally, most bullish investors speculate that ETH's low circulating supply due to locked ETH in staking protocols would allow the ETF inflows to spark a significant surge in ETH's price.\n\nEthereum CME open interest (OI) has also been growing faster than other derivatives exchanges, indicating a growing appetite among US investors for the largest altcoin.\n\nETH technical analysis: Ethereum could see a new yearly high\n\nEthereum is trading around $3,430 on Monday, up over 7% on the day. ETH's rise follows a general recovery across the crypto market after crypto investors reacted positively to presidential candidate Donald Trump's escape from gunshots during a rally in Pennsylvania.\n\nAs a result, over $23.31 million worth of ETH short positions were liquidated whereas long liquidations significantly reduced to $3.86 million in the past 24 hours.\n\nETH's Long/Short Ratio, at 1.04, also shows the shift in market sentiment. The Long/Short Ratio estimates the total number of longs versus shorts in the market. A ratio above 1 suggests bulls are in control, and vice versa if it is below 1.\n\nETH/USDT 4-hour chart\n\nThe recent change in market sentiment, combined with the potential approval of spot ETH ETFs on Tuesday, could propel ETH above the $3,974 to $4,093 resistance to set a new yearly high. On the downside, the $3,200 price level could serve as key support.\n\nIn the long term, trader @CryptoYoddha predicted that Ethereum could reach $13,654 in 2025 as its consolidation over the past few weeks suggests potential for higher growth.\n\nETH All-time chart"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxORVp3R2cySnFfUnN3S0hKb3oxUVlmbG1SSXhFd3FheFFwS3R2ZWdvRTZ2VXRmeURaZDNNVW5YNEpsWkhEdXhRUWRoNFBEVVpXMXFlWlNHMW8tWVZfeno4MWJUSnFjN24ySE1sSW9CZUtTVm1uVDN2bnVvdjFlc3VxaEw4bkNJQVFLQjY4YzlR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETF Approval: A Turning Point for The Crypto Market - Watcher Guru",
        "content": "Ethereum ETF approval will reshape the crypto landscape from its base. This change could be an essential milestone for digital assets.\n\nThe anticipation is, of course, building by the day, as Ethereum ETF approval will have a major impact on the broader market. This makes Ethereum ETF a focal point for investors and analysts.\n\nAlso Read: Top 3 Cryptocurrencies That Could Hit ATH Post Ethereum ETF\n\nExploring the Impact of Ethereum ETF Approval\n\nAnticipation Builds for Imminent Launch\n\nThe crypto community is buzzing with excitement about the possible launch of spot Ethereum EFTs. Industry leaders, including Nate Geraci (president of ETF Store), expressed optimism about the U.S. Securities and Exchange Commission (SEC) finally giving the green light.\n\nWelcome to spot eth ETF approval week…\n\n\n\nI’m calling it.\n\n\n\nDon’t know anything specific, just can’t come up w/ good reason for any further delay at this point.\n\n\n\nIssuers ready for launch. — Nate Geraci (@NateGeraci) July 14, 2024\n\nAs you can see above, in a recent post, Geraci stated:\n\n“Welcome to spot ETH ETF approval week. I’m calling it. Don’t know anything specific, just can’t come up with a good reason for any further delay at this point. Issuers are ready for launch.”\n\nBloomberg analysts Eric Balchunas and James Seyffart also have the same opinion. They suggest that these ETFs could debut in mid-July.\n\nThe SEC is well-known for giving minimal feedback on final registration statements. This can be interpreted as a positive and can suggest that the application is nearing approval. Furthermore, the SEC has made minimal changes to the latest filings.\n\nWhat Will the Market Response Be?\n\nThe anticipation about a possible Ethereum ETF approval has already boosted its price. ETH is currently trading at $3.342, with an enormous jump from $2.909 just a week ago.\n\nThe technical analysis of the charts shows a bullish trend, with Ethereum trading above $3.280 and the 100-hourly Simple Moving Average.\n\nAlso Read: Ethereum ETF Inflows Could Hit $10B, Sending Ether to New ATH\n\nPotential Ripple Effects on the Crypto Ecosystem\n\nInstitutional Interest and Investment Inflows\n\nSpot Ethereum ETFs, as mentioned previously, have generated quite a bit of excitement for investors and financial advisors.\n\nBitwise Asset Management projects that these ETFs could attract $15 billion in net inflows until the year 2025 ends.\n\nIf this is true, this influx would explore Ethereum’s value and validate its current price revival.\n\nPaving the Way for Other Altcoin ETFs\n\nThe approval of Ethereum ETFs might put its foot in the door for other altcoins that want a similar product acceptance on Wall Street, and here are some of them:\n\nActive applications for a Solana ETF from VanExck\n\n21Shares has expanded beyond the Bitcoin-Ethereum duopoly\n\nAs a result, we could expect a more diverse range of crypto investment products in the future.\n\nAlso Read: VanEck Officially Files S-1 for Spot Ethereum ETF\n\nThe approval and the following trading of Ethereum ETFs could be an excellent marker of the growing demand for more mainstream and regulated crypto products.\n\nIt remains to be seen if the SEC’s decision will boost ETH ETFs to a new level. We’re eagerly awaiting their conclusion."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQWU5SR3hEYUlHYi1zeXdCR0FFRmlyZDZucGhvUF9Xc0N0WUhXWm42TmhkQUx2Rm5Wd25iYm5tM1FNSXhKTEFuOHpya1NCczBJbkRSRWFQU2JPTVBfWkFFRHB5aGY1TnE5UWVGeFZtUDJ4eDA3M2FTc0VOTlp4amxySVBfUUdXb21iNGFMU3Z3aHRMTGvSAZgBQVVfeXFMTU1xYXlkVXlUU3lwOFBCQWxiNGh2UEthak5hWUM4dUNSYU4wbk0zQ1dEeGdBamJMSFE0OFhqQUp5YkhybE1kSnFzWGZxck4yVmhxOUFaZUNWem5qLUk3MUtfQUExYlQ4cEFrcm1FMmp4TVFONnJsRnNIb0llWWVoWWRNcnNINmtIWUlWZE9kX0pUZnhKNnRlMUM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 07:00:00 GMT",
        "title": "Legendary Trader Peter Brandt Issues Extra-Bullish Ethereum Price Outlook - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nVeteran trader Peter Brandt, regarded by many as a legendary figure on the financial markets since the 1970s, has sparked a wave of optimism in the Ethereum (ETH) community with his latest analysis. Brandt, known for his expertise in technical analysis, identified bullish chart patterns suggesting a potential price surge for the leading altcoin.\n\nAdvertisement\n\nThus, Brandt pointed to a \"four-month rectangle\" on the Ethereum price chart. This technical indicator suggests a period of consolidation, where the price has been trading within a defined range. In his view, this consolidation could be a precursor to a breakout, potentially propelling the price of ETH up north.\n\nFurther bolstering his bullish outlook, Brandt identified a bullish \"horn bottom\" pattern. Explained simply, a horn bottom is a reversal pattern where the price dips down twice but fails to break a key support level, forming a hornlike shape. This pattern is often seen as a sign of accumulating buying pressure and a potential price increase.\n\nAdvertisement\n\nA perspective on $ETH\n\nSupport was found at lower boundary of 4+ month rectangle, which was a retest of the Feb completion of a horn bottom\n\nTarget, pending upside completion, is 5600+ pic.twitter.com/EThcM61KpW — Peter Brandt (@PeterLBrandt) July 15, 2024\n\nTo illustrate his analysis, Brandt reportedly shared a price chart highlighting the identified patterns and his target price for ETH. This target sits comfortably above $5,600, a significant jump from current levels.\n\nBrandt's bullish call coincides with exciting developments surrounding a potential Ethereum ETF. Industry experts suggest the SEC might grant preliminary approval to several proposals by next Tuesday, July 23.\n\nAn ETF would allow investors to gain exposure to Ethereum through a traditional investment vehicle, potentially attracting new capital and boosting the price."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxQeXFhVlE2aURQMTBkcDZuZVZ1aG5wRkMyRmxHeldiLWVOM09wU09fVjhMTFRuNzN4LU54NE9aQUhoZDNmeGktd3lCZnM5SkVoLXdUdDlHckxKX1pQWVYtR0VPZ3IyREh1aFRrY0VsQkllU2NfUmRIemluRWJFZVI0MkpTU2ZEMC1J0gGOAUFVX3lxTE03ZTY0U2xIOVlBOTNTQ3B6c182QkdrejJrNklkajV5QjcydjU1ZnVTaW9lTVFJakM4aTZMYmVlWFR1aHFmekVCYzNoc1RyZHFPaF96MTZZTjJjcmg1UXA4eDZ0YndYbTdBNk85TTMydlFNRy0wdWtyMmVGVlBLX29vSmxyRFFhWWJYMDlDSWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 07:00:00 GMT",
        "title": "Super Bullish Ethereum Price Prediction by Peter Brandt - CryptoPotato",
        "content": "Ethereum’s price has risen almost 10% in the past seven days. It is currently trading slightly below the important $3,400 mark.\n\nThis uptick is in line with the rest of the market, which is currently experiencing considerable bullish momentum following the correction that took place last week.\n\nThe price has dipped a bit in the past few hours after briefly touching $3.5K on Binance.\n\nThat said, one of the most popular prop traders with 50 years of experience, Peter Brandt, has recently commented on the ETH price, outlining the possibility of a considerable surge.\n\nIn a tweet from earlier today, Brandt shared his “perspective” on ETH, saying that “support was found at the lower boundary of 4+ month rectangle, which was a retest of the Feb completion of a horn bottom.”\n\nNow, a a horn bottom pattern in technical analysis is referred to price action identified by two downward spikes embracing a tiny middle candle, followed by a sharp rally.\n\nHere is Brandt’s chart:\n\nThe interesting bit is that he said that the target for this pattern’s resolution is above $5,600. If it happens, this would mean an increase of around 64% for ETH."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNeFBFVGprbHdyQVoyZzlyUmtWT2JIRFdWRGpGYUdUNV9Mc3hFazI4STVWa0Vjd2ZNb3IxcUdJdlIwUG9rNjJ5TjlteFJyQWRRRnQ4d08ydXhVOGFKNjNndTAzLTVIWXVHNThoX3VSX3JlSEY3bG44Nkd5SXFNbTNOV25yQk1aY3loLVBhLdIBkgFBVV95cUxObVdxSXdjRHM4QUkteXcwbjMyazlLTzh2YkhkeVNCS0F3TDBnaG9hVjRfYmFUWVRzVUwzc2gzOG1zZXN6V1oxV2ZZSC1DWDY5ZmdqRFdIdWkxVHBOSnVrTjE2S1lQdmhJUWNhWFZHTkhqbmxBRUZ1ZXEwWHNLQ0JJTlZ6UnpIdXE4dGc4VjlSck9pdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis: Declining Volume Sparks Doubts on $3000 Breakout - CoinGape",
        "content": "The Ethereum price analysis showcased a fresh relief rally in the second week of July. The bullish reversal uplifted the asset from monthly support of $2825 to $3196 registering a weekly gain of 13.2%. This recovery followed a market excitement towards the potential approval of spot ETH ETFs in the coming week and eased from broader market supply. Is the correction trend over?\n\nAlso Read: Bitcoin & Altcoins In Focus As Market Eyes Ether ETF, Fed Chair Comment, & Other Events\n\nadvertisement\n\nEthereum Price Analysis: Will Spot ETH ETF Approval Propel ETH to $4000?\n\nThe mid-term trend from the Ethereum price analysis shows a sideways action in the daily chart. The formation of a new lower high at $3974 and recently the same swing low at $2815 projects ETH price entering a consolidation trend to recuperate exhausted bullish momentum.\n\nA recent reversal from the $2815 support has uplifted the asset to $3191 within a week while the market cap jumped to $383.5 Billion. However, the declining volume accompanying the upswing suggests a diminishing interest among market participants to initiate long positions.\n\nThis lack of conviction from buyers suggests an unsustainable recovery and a potential for further correction in ETH. If the coin price reverts from the overhead trendline (downsloping blue line), the sellers could rechallenge the $2815 floor to extend the current correction.\n\nThe potential breakdown could accelerate the supply pressure and push the asset to $2400.\n\nHowever, the potential approval of spot ETH ETF could counter the bearish thesis to change market sentiment.\n\nAlso Read: Ethereum Price To Hit $5,000 As ETH ETF Speculation Ignites Bullish Comeback\n\nNate Geraci, President of the ETF Store, recently tweeted that the SEC’s approach to the spot Ethereum ETF S-1 filings closely mirrors their handling of the 19b-4 filings, marked by significant discretion. Geraci remains optimistic about the approval, anticipated next week, emphasizing that there is no justifiable reason for any delay.\n\nIt appears the SEC is playing the spot eth ETF S-1s similar to the 19b-4s… *Extremely* tight-lipped. Still think approval next week. Absolutely no reason for delay. — Nate Geraci (@NateGeraci) July 12, 2024\n\nThus, the potential approval could intensify the buying momentum and propel the ETH price prediction target above the $4000 mark.\n\nTechnical Indicator\n\nEMAs: The 20-day and 50-day Exponential Moving Averages (EMAs) serve as dynamic resistance levels during a bullish upswing, signaling a strong downward momentum in progress.\n\nRSI: The Relative Strength Index (RSI) reverted to 45% indicating a neutral sentiment among market participants.\n\nFrequently Asked Questions (FAQs) 1. What is the significance of the spot ETH ETF approval? The potential approval of a spot ETH ETF (Exchange-Traded Fund) is significant because it could increase institutional and retail investment in Ethereum. 2. What is a relief rally? A \"relief rally\" refers to a temporary increase in the price of an asset after a period of decline. 3. What is the Relative Strength Index (RSI)? The Relative Strength Index (RSI) is a momentum oscillator that measures the speed and change of price movements on a scale from 0 to 100.\n\nRelated Articles\n\nSahil Mahadik Sahil is a dedicated full-time trader with over three years of experience in the financial markets. Armed with a strong grasp of technical analysis, he keeps a vigilant eye on the daily price movements of top assets and indices. Drawn by his fascination with financial instruments, Sahil enthusiastically embraced the emerging realm of cryptocurrency, where he continues to explore opportunities driven by his passion for trading\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxQWUxINm5OQU5FanBFeGs4NVNfSUhpd2I0YUR4dndjbE9UYy1Qb3laVk9fRGNseW90MVpER3lkQlpPX2NlaDRTcFFKaXBiNTV5V2NaMy1LWE9qQVpJUEdlbGNGR1VHNnRZOEVMVzNsaXRYdl9nTlpMam05UE5jZmtFaTlCTEZ1Smk0cEQ3NVhjanMzRFBaY1BfQ2lJWm7SAaIBQVVfeXFMUF9FcmhyYUY0V1F5Ul9RZGlnSGtYcDhtaWRDQk5jd3RUOWJMZEFSVXpyV0JWdW0xU1Rsa1ZRYzUyOVRCWEkzS28xcFoxbmpLbWdjb3VoanNPQVZwMlFTNzFNeWZ4YlcwX2czeTZWM3ZDYTUwRmljSUpGLU5HMVg3RmNJUDZRaVl3Y0dFSnlpeVRuclAyb09zOUxqMzd3cmpycTFB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis: ETH Eyes $3.5K as ETF Launch Anticipation Grows - CryptoPotato",
        "content": "Ethereum has recently seen an uptick in demand near a crucial support level, leading to a notable rebound above the 200-day moving average at $3,134 and reaching the 100-day MA.\n\nThis price action highlights the potential for a bullish reversal if the price recovers above the 100-day MA of $3,342.\n\nTechnical Analysis\n\nBy Shayan\n\nThe Daily Chart\n\nA detailed analysis of Ethereum’s daily chart reveals that after a prolonged bearish trend, the cryptocurrency briefly broke below the 200-day moving average at $3,081, introducing significant fear and uncertainty into the market, as this MA is a vital support level for the price.\n\nHowever, Ethereum found strong support at the substantial and decisive support region of $3K, resulting in a notable bullish rebound. The price has now climbed above the 200-day MA and continued surging toward the 100-day MA, indicating a potential bear trap and false breakout.\n\nCurrently, ETH has reached the 100-day MA of $3,142 and is on the verge of reclaiming it. This MA also aligns with the tactical resistance region of $3.3K, making it a robust barrier to buyers. Yet, if it stabilizes above the 100-day MA, this could confirm a bullish revival in the mid-term, with the next target being the $4K yearly high.\n\nThe 4-Hour Chart\n\nOn the 4-hour chart, Ethereum faced rejection near the multi-month descending trendline at $3.5K, entering a sustained and impulsive bearish trend. Upon reaching the decisive and psychological support region at $2.8K, the bearish momentum faded, resulting in the formation of a notable double-bottom pattern.\n\nFollowing this consolidation, an increase in buying activity led to a bullish rebound, breaking above the neckline and subsequently forming a successful pullback to the broken level.\n\nThereafter, the price experienced an impulsive surge, which clearly hinted at a bullish revival in market sentiment. Ethereum is now at a crucial resistance region, encompassing the significant $3.4K psychological mark and the multi-month downtrend line, where selling pressure may increase.\n\nIf Ethereum reclaims this resistance area, the bullish trend could continue toward the $3.7K mark. Conversely, a rejection at this level would likely result in the continuation of the bearish trend, targeting the critical $2.8K support.\n\nSentiment Analysis\n\nBy Shayan\n\nEthereum has recently experienced a bullish rebound, surging significantly toward the critical $3.5K resistance zone. Understanding the potential targets for the bullish trend is essential for predicting future price movements.\n\nThe accompanying chart identifies potential liquidation zones within Ethereum’s price action, offering insights for mid-term strategies by informed traders. Following the recent bearish decline below the $3K threshold, the price has tapped into the liquidity pool below $3K, primarily comprising sell-side liquidity from long positions opened near this mark.\n\nLooking ahead, significant liquidity is observed around the $4K resistance region, primarily consisting of buy-stop orders triggered by aggressive short positions during the previous impulsive bearish trend. In the mid-term, a plausible scenario involves the continuation of the bullish trend to capture liquidity near and above the $4K resistance level. This approach aims to exploit these liquidity zones strategically, potentially supporting further upward momentum in Ethereum’s price."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxOVm9nUTNBUXMwMjVOYUxkaGs1R2pTalRsckhGLVZFTW5WV3d5SlotSlIweF92THlQaWxKdjA4UUR3R2ZKN2w5U29aa3VKcGNYRm1qUDRvX0poRXFMVkVKYlhzZmRXUjVhRlVNelNRVWtIWnFVSnJBMDZQWGpmQ2RxQXJfWDZtdHJueXVsNXU0RE9pZmh4LTh3c3pVdUdQX1ZtMlVfclc2QjN6bVZIajJtcWF30gG_AUFVX3lxTE03anJKaWYxdXMzNE8xVXNPeTZ5LUdKeXAyVFFfbG81N281cTFzYmRTRDVrNVdrdnpsdV9rQW1QbVdkMWlZUGZUUmN4NkpJbTZneDlJNHN0dVpJVm90N1I5VHlJdUtzcC1EdXhqaVlDY0ZZVzBzMjFicEZQT2ZaSHJWOUpLMjJTOUFPbkFsZHdvQjh6V212OUc5bFFzZnRGY2cwTXBxa0FNX2d0WXZnQzI3R1JJT1dEVWhQYTM3UmNF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 07:00:00 GMT",
        "title": "Cardano And Ethereum Price Prediction: Is A Run To $0.6 And $8,000 Possible? - Outlook India",
        "content": "As the first decentralized solution for this market, investors are capitalizing on its first-mover advantages for massive profits. Moreover, ETFSwap (ETFS) is set for beta launch following the completion of team KYC by reputable blockchain security firm SolidProof. Following the team audit, SolidProof has verified project ownership and the identity of each team member, adding more credence to the emerging platform."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxNWTdLeFZGbVdyY00xUDZKTHpTMmp5bEw2Nk1Ec1ZzYm9JV25Ha1R3elhDaTI0TjFXckRZSFpDSERNVHJlb2ZrQ09FT05ycHU5ejEyVnVnd1ZzaFowdUpTR2drZFMyb1Vxd0F2SjhUSm95Z19lQTJlc3JiZ2J3U1R3Y2djdGtUeUHSAYwBQVVfeXFMTVlsOVhwdm5MYmVUSlNEYjRoQ3dCY1FqaVNFTUZhdHpkcWI1dnlLWkhyM2JEdTVNNUdpdFd5d1BJWVZlNFdCeFlGWGdlSVd3OHBsUHgyYU1jNDFJdXdOYUZ4Ni1zMTVDVkFVM3RGMlRLOTRBdEZpRlg5ZHlqdS1fWEFwT1U4MnFfSnFtT04?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 07:00:00 GMT",
        "title": "Ethereum To Outperform Bitcoin After Spot Ether ETF Launch: Kaiko - CoinGape",
        "content": "Institutional crypto market data provider Kaiko has projected Ethereum to outperform Bitcoin (BTC) after the launch of spot ETFs in the United States. The market anticipates the launch of spot Ethereum products with bulls projecting new market highs amid institutional inflows recorded pre-launch. ETH is down from the approvals of 19b-4 for several issues by the Securities and Exchange Commission (SEC).\n\nEthereum Growth to Surpass Bitcoin\n\nA recent report from Kaiko opines that Ethereum ETFs may push the assets above Bitcoin. The firm cited the Ether-Bitcoin price ratio amid recent fluctuations due to macro and industry factors. The price ratio of the asset relative to Bitcoin stands at 0.05 from 0.045 after the approval of 19b-4 by the SEC. A ratio shows the value of Ethereum is getting bigger than the market leader.\n\nadvertisement\n\n“The ETH to BTC, which measures the relative performance of the two assets, remains elevated around 0.05. This is significantly higher than pre-approval levels of nearly 0.045. A stronger ratio suggests ETH could continue to outperform relative to BTC following ETF launches.”\n\nIn the last two months, ETH price has plummeted 20% initial frenzy with the SEC approval. While a pullback is linked to macro factors, spot Ethereum ETFs are poised to draw in institutional flows to the market. Traditional investors have become attracted to the altcoin leader because of its smart contract functionality and the number of decentralized applications (DApps) in the ecosystem. Last year. Wealth managers picked the asset with the most growth trajectory.\n\nETH Price Hits $3500 Ahead Spot ETF Debut\n\nThis year, spot crypto ETFs have dominated market spaces with billions pouring in from investors. The approval of spot Bitcoin ETFs on Jan 11 opened the gates for renewed market optimism on the heels of a new window for institutional investments. The successes of Bitcoin products drew investors to Ethereum as crypto prices jumped to new highs. The trading of ETH products expected this summer and related optimism led to issuers filing for Solana ETFs.\n\nETH price jumped over 2% in the past 24 hours, with the price currently trading at $3,415. The 24-hour low and high are $3,330 and $3,498, respectively. Furthermore, the trading volume has increased by 50% in the last 24 hours, indicating a rise in interest among traders.\n\nAlso Read: Coinbase v SEC: Coinbase Refines Subpoena For SEC Chair Gensler\n\nDavid Pokima David is a finance news contributor with 4 years of experience in Blockchain Technology and Cryptocurrencies. He is interested in learning about emerging technologies and has an eye for breaking news. Staying updated with trends, David reported in several niches including regulation, partnerships, crypto assets, stocks, NFTs, etc. Away from the financial markets, David goes cycling and horse riding.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE1leHdYWjRWQUxYcG9Yb1dVWnBOeDIxdmRRb0ViWm5PZ2w4SUlSWlI2NlUyaU1PSUNrbnJJMWpLOXpESFJyVFljQ3NFbVFUYTJZUExqd0V2Z1dRSkd5TFFYQkpkTGIxNU9nb1VnZEFHbnI5MzJBa3RCQTgydDBiTGfSAYQBQVVfeXFMT2dmZnNiMndNMWJ2dlBiQXo0QUd1MjJ5R2pqTVdSVk1wQzVGVk85bHZOYmZWN3JLRVBVS1dSN3BUNW5vN0tmWmJEemtaT1h1LU1rc3pwdGJ1bkYwUmMtVERHTlFaVzMzbDljMDFpSjBMM1Y1WVh3ODJEN3VneVdhMkZQLTdR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jul 2024 07:00:00 GMT",
        "title": "How Solana flipped Ethereum, Bitcoin in NFT Adoption - AMBCrypto News",
        "content": "Despite outshining BTC and ETH, SOL’s number of NFT sellers and buyers dropped.\n\nSOL was up by 4% in the last 24 hours, but a few metrics looked bearish.\n\nSolana [SOL], which nowadays has been in the limelight for its high network activity, has once again made an achievement in the NFT ecosystem.\n\nThe blockchain has managed to outshine top players like Bitcoin [BTC] and Ethereum [ETH] on a key front. In the meantime, its price action has also turned bullish.\n\nSolana’s promising NFT performance\n\nSolanaFloor, a popular X handle that posts updates related to the blockchain’s ecosystem, recently posted a tweet highlighting an interesting development.\n\nAs per the tweet, Solana outshined all other blockchains in terms of daily NFT blockchain user adoption. SOL’s number increased by almost 34% in the last 24 hours. Apart from SOL, Polygon [MATIC] and Ethereum made it to the top three on the same list.\n\nAMBCrypto’s look at DappRadar’s data revealed that Frogana, Retardio Cousins, and SMB Gen2 were the top three NFT collections on Solana over the last 24 hours.\n\nAs per Sanrtiment’s data, SOL’s NFT trade count spiked last week. Its NFT trade volume in USD also increased over the past few days.\n\nAMBCrypto’s analysis of CRYPTOSLAM’s data revealed that Solana also witnessed an increase in its NFT sales volume last week. To be precise, the number grew by 8%.\n\nHowever, not everything looked favorable. For instance, SOL’s number of NFT sellers dropped by 59% last week. A similar declining trend was also noted in terms of SOL’s number of NFT buyers, as the figure dropped by more than 66%.\n\nSOL turns bullish\n\nWhile all this happened, Solana bulls buckled up as its daily chart remained green.\n\nAccording to CoinMarketCap, SOL’s price increased by over 4% in the last 24 hours. At the time of writing, SOL was trading at $146.67 with a market capitalization of over $68 billion, making it the 5th largest crypto.\n\nHowever, SOL might soon lose its bullish momentum. At the time of writing, SOL’s fear and greed index had a reading of 68%, meaning that the market was in a “fear” phase.\n\nWhenever the metric hits this level, it suggests that the chances of a price correction are high.\n\nTherefore, AMBCrypto planned to have a look at SOL’s daily chart to better understand what to expect from the token. As per our analysis, the technical indicator MACD displayed a bullish advantage in the market.\n\nIs your portfolio green? Check out the SOL Profit Calculator\n\nThe Relative Strength Index (RSI) registered an uptick and was headed further up from the neutral mark, indicating a continued price increase.\n\nNonetheless, the Chaikin Money Flow (CMF) went southward, which could restrict SOL’s price from moving up in the coming days.\n\n\n\n\n\n"
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxOOXgzbjZzci01RFZyZHR4a1BzdVVacmQwZFJrMmlzekpkSlJZUEFpVTRoamloMExHTFdrTU01UUdFaUxhV0hab1cwTFJjdWhWeC10elhCaG9sSVBKZWlQZUNMc0pramp0MWhtSDVnNkx2SVdNNUhLcjhGSVFJNEFRMkhEUdIBiAFBVV95cUxPZzdCWVo3Yk1DaVdVMWhxTThFUUpRWnRPRzZReFJUOHFrZHJLTHVxdHBQQmF3a18zQnlaei1ZdGFueTN4RjVqOTFoQ2VoYUhmNndoQVJXMzE3VThlWnNoTlhCQzBFaURXUE9ibjdTZGYtbGF0NzMtQ3A2dkFqemZzSEkxdnNjdklq?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 07:00:00 GMT",
        "title": "3 Altcoins To Sell Should Ethereum Tag $5,000 Post ETF Approval - CoinGape",
        "content": "Three Ethereum ETF operators received preliminary approvals earlier in the week as Bloomberg analyst Eric Balchunas predicted trading to start next week. The news coincided with a general bullish wave in the cryptocurrency market as Bitcoin jumped above $65,000. As the market recovers following last week’s sell-off, investors may want to pay attention to altcoins to sell if Ethereum rallies to $5,000 after spot ETFs begin trading.\n\n1. Altcoins To Sell – XRP (XRP)\n\nXRP is the native coin for the XRP Ledger, a blockchain designed to help financial institutions streamline cross-border payments using a fast and cost-effective network. Ripple Labs is the company behind XRP and XRPL. It has onboarded multiple banking institutions so far and continues its crusade to onboard more.\n\nadvertisement\n\nThe price of XRP is trading around $0.5457, a 25.7% increase in the last 7 days. XRP price is displaying signs of a breakout that the entire crypto market has long awaited. Since the onset of the Ripple-SEC lawsuit in December 2020, the asset’s price has been suppressed below the $1 cent level.\n\nThe Ripple network saw a surge in adoption following news that the CME Group would launch new daily price reference rates and real-time indices for XRP and ICP beginning July 29, 2024.\n\nConsequently, whales rush to buy the crypto asset, with one big player buying 38 million XRP ($20 million).\n\nThis comes as the Ripple-SEC lawsuit shows signs of ending. Following the recent settlement between Terraform Labs (TFL) and the SEC, Ripple appealed to the court to have its penalty reduced. Subsequently, the penalty was reduced to less than $120 million. Along the same lines, the SEC dropped its investigation into Ethereum, after which 19-4b ETFs were approved. The exact process could unfold for Ripple and XRP.\n\n2. MAGA (TRUMP)\n\nMAGA is among the many Trump altcoins that mushroomed when the former American president announced his bid to vie for the November 2024 elections. The crypto project also markets itself as a charity, donating proceeds of the 1% on-chain tax on buys, sells, and transfers to veterans and Child trafficking prevention services in the United States. As of July 15, MAGA has donated $1.7 million to these causes.\n\nTRUMP is the native token of the MAGA community, and its price jumped nearly 50% from $6.34 to $$8.03 over the weekend after an assassination attempt on Donald Trump. The price of TRUMP had been rising gradually in anticipation of the upcoming Bitcoin 2024 conference in Nashville, in which the former president was slated to deliver a 30-minute speech. Following the attempt on his life, Trump has affirmed that he will still show up to the conference.\n\nAnalysis by Lookonchain and Arkham Intelligence discovered that Gigantic Rebirth’s (GCR) address, tagged “GCR Address 1,” still holds over 936,000 TRUMP tokens and has a profit of over $6.5 million.\n\nAnother address tagged \"GCR: Address 1\" still holds 936,279 $TRUMP($7.23M) and has not sold it, with a profit of more than $6.5M!https://t.co/qGFbpGAuJW pic.twitter.com/16LpqJX61e — Lookonchain (@lookonchain) July 15, 2024\n\nThis indicates that whales are still holding this altcoin. After winning the debate and escaping assassination, his odds of winning the elections may have just gone up, and with them, the price of TRUMP.\n\n3. Altcoins To Sell – Chainlink (LINK)\n\nChainlink is the glue that holds the majority of DeFi protocols together. Developed by Sergey Nazarov, Chainlink is a universal platform for blockchain builders and decentralized financial institutions. The main product of the Chainlink oracle network is the Cross-Chain Interoperability Protocol (CCIP), which allows the secure and reliable transmission of data and its value between different blockchain networks. As an oracle network, Chainlink’s services enable smart contracts to communicate securely with real-world data and services outside the blockchain network. This may impact real-world assets (RWA), DeFi, AI, and even DePIN sectors.\n\nLookonchain just spotted a whale who has secretly accumulated 12.75 million LINK ($167 million) across 93 different wallets in less than one month. Such a massive investment is a bullish signal for the crypto asset.\n\nIt seems that a mysterious whale/institution is accumulating $LINK! We noticed 93 fresh wallets withdrawing 12.75M $LINK($167M) from #Binance since June 24!https://t.co/SkqA1r0F1N pic.twitter.com/AJR4fT36VG — Lookonchain (@lookonchain) July 14, 2024\n\nChainlink price is up 2.5% in the last 24 hours to trade at $14.10. Chainlink price prediction shows strong support around $12.8, which may hold up the price if market conditions turn bearish. However, before that happens LINK is one of the altcoins to sell as you wait for the perfect entry position.\n\nLINK’s relative strength index (RSI) just crossed above the mid-point, confirming a bullish uptrend and increasing buy momentum. The moving average convergence divergence (MACD) indicator also spotted a bullish cross-over, confirming a LINK bullish reversal.\n\nConclusion\n\nWhile Ethereum’s price potentially hitting $5,000 post-ETF approval might seem like an exciting opportunity, it may also signify a good moment to reassess your altcoin holdings. As Ethereum gains momentum, some altcoins might struggle to maintain their value or relevance. XRP, LINK, and MAGA represent some altcoins to sell, allowing you to consolidate gains and potentially reinvest in more promising or stable assets.\n\nFrequently Asked Questions (FAQs) 1. Who are crypto whales? In cryptocurrency, \"whales\" refer to individuals or entities that hold a large amount of a particular cryptocurrency. These holders can significantly influence the market due to the sheer volume of their holdings. 2. What are altcoins? Altcoins, short for \"alternative coins,\" refer to any cryptocurrency other than Bitcoin including Ethereum. 3. Is Ethereum a good buy? Yes, Ethereum is a good buy. Analysts predict the Ethereum price will surpass its all time high when ETH ETFs launch.\n\nRelated Articles\n\nEvans Karanja Evans Karanja is a crypto analyst and journalist with a deep focus on blockchain technology, cryptocurrency, and the video gaming industry. His extensive experience includes collaborating with various startups to deliver insightful and high-quality analyses that resonate with their target audiences. As an avid crypto trader and investor, Evans is passionate about the transformative potential of blockchain across diverse sectors. Outside of his professional pursuits, he enjoys playing video games and exploring scenic waterfalls.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxPYnFMYUVBdm5CekFpLUZxbU5XMHFRMHg2djZJc2ZOYnpaLS0tNzFreEEzZFo5elgwT1dOc3dkUFNyOEF6NUh6TzFJbWk3ak5ISjRtSGpsYmQtbmMxT3IxY0xyRW1jTEstelhCLU92X2cxZldMenBGYlNmSlZWOWpxVE80bmFQenZQWnAyaWY1YmQ1M2VLVzVvQ0ZlMXNhNE53OEt2NENTN0hkOVlCVGt2aG5jaERLSFEzcHc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETFs to begin trading on July 23 after US SEC gives preliminary approval - Nairametrics",
        "content": "The much-awaited spot Ethereum Exchange Traded Funds (ETFs) are set to begin trading by July 23 after the United States Securities and Exchange Commission (SEC) under Gary Gensler gave preliminary approval to some of the proposed issuers of the Ethereum ETF.\n\nThe United States SEC gave preliminary approval to three out of the eight asset managers who are proposing to issue Ethereum ETFs to their clients.\n\nThe three asset managers include Blackrock, VanEck, and Franklin Templeton and the approval hinges on applicants submitting final offering documents to regulators before the end of this week.\n\nAll eight Ethereum ETF issuers are expected to launch simultaneously according to credible sources.\n\nThe other Ethereum Etf issuers Fidelity, ARK 21Shares, Grayscale, Bitwise, and Invesco Galaxy are also expected to receive their preliminary approval from the US SEC ahead of next week’s proposed date of trading.\n\nEric Balchunas, Senior Bloomberg ETF Analyst confirmed the July 23 trading date with a post on X stating that he can confirm that the SEC has asked all issuers to submit their final S-1 fillings on Wednesday ahead of a July 23 launch.\n\n“Update: Nate’s instincts were right, hearing SEC finally gotten back to issuers today, asking them to return FINAL S-1s on Wed (incl fees) and then request effectiveness on Monday after close for a TUESDAY 7/23 LAUNCH. This is provided with no unforeseeable last-minute issues of course!” Eric tweeted.\n\nNairametrics earlier reported that Bitwise’s Chief Investment Officer Matt Hougan predicted that the Ethereum ETFs could attract up to $15 billion in net inflows in the first 18 months of trading pulling a similar feat to what Bitcoin ETFs launched in January achieved.\n\nMatt Hougan also expects the S-1 fillings of the issuers to be approved next week on Monday after trading hours. This will prepare it for the launch of trading the next day which is July 23.\n\nIf the S-1 fillings by the issuers are approved the spot Ether ETFs by the issuers are expected to be listed on the Nasdaq, New York Stock Exchange, and Chicago Board Options Exchange.\n\nThe Ethereum ETF is the second crypto asset to have an exchange-traded fund in the United States after Bitcoin ETFs were launched in January.\n\nThere has been speculation about a potential Solana ETF this year after Ethereum ETFs have launched.\n\nWhat to Know\n\nAn S-1 filing is a registration statement that a company files with the Securities and Exchange Commission (SEC) when it wants to go public and issue shares on a stock exchange. The form is also known as the “registration form” because it registers the company with the SEC.\n\nThe United States SEC has completed the first phase of the Ethereum ETF approval which is the approval of the 19b-4 files by the SEC in May."
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMi0gFBVV95cUxNMlFYT3BEX2lrdW9BbFpoa256MXcyWXV2aXVOd0h5MEVhQXBUVHp5TjJGdjFjWEhVNXJqbjlXaS1udXA1OTdaWXNBd0d1QU9kMkZ1OENES00tS2JFOFI5bGc3NGJEX3hPNFZmQkM3eG95MmpfQnZiOHpVTzJSTVRtalVYMGhZRmNXenNCc0gwdjhRMzh3TmdHQ1dJb1BxRkY3aDd4c01tM0tzeDduei04LXlCV20zRG95dGhsb1V4eHdEQVVtMVFJYzVuNjJWRTRMVHc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 07:00:00 GMT",
        "title": "Solana 'No Longer In Ethereum's Shadow, SOL Could Outperform ETH,' Says Expert - Benzinga",
        "content": "Solana SOL/USD is well-positioned against Ethereum ETH/USD, according to the analysis of a prominent industry expert.\n\nWhat Happened: According to Coin Bureau CEO and co-founder Nic, Solana is already outperforming Ethereum. Comparing the two blockchains, Solana started the year with fewer tokens but has since overtaken Ethereum since its ecosystem has seen 65% more token listings in the first half of the year.\n\nWill Solana outperform Ethereum?\n\n\n\nHere are 3 charts from the recent CMC H1 report that show how it is already doing so 👇 — Nic (@nicrypto) July 15, 2024\n\nThis leads to more users and more active addresses on Solana, which has the most daily active addresses of any Layer-1 blockchain. Ethereum, in comparison, ranks fourth.\n\nSolana is “the home of NFTs” and leads in unique wallets, buyers and transactions, while Bitcoin and Ethereum lead in terms of volume.\n\nNic points to the meme coin madness driving Solana usage and awareness. \"The higher the returns, the more users they draw. It’s a degen cycle and Solana is top here,\" Nic concludes and thinks, \"Solana is no longer in Ethereum’s shadow.\"\n\nAlso Read: Solana Up 7% And Could Get To 50% Of Ethereum’s Valuation As ‘Most Liquid Election Proxy In Crypto,’ Trader Says\n\nWhy It Matters: Crypto chart analyst Ali Martinez sees bullish short-term price action coming for SOL:\n\n#Solana appears to be forming a W pattern, which suggests $SOL will surge toward $174! pic.twitter.com/OxXODWi1yA — Ali (@ali_charts) July 15, 2024\n\nA ‘W chart pattern' is formed when an asset’s price drops and then rises again before dropping once more and rising for a second time. A double bottom with a W shape signals bullish price momentum.\n\nAnother crypto trader recently confirmed a breakout for Solana, with yet another trader seeing Solana making a new all-time high later followed by a rally in ecosystem-related tokens.\n\nPrice Action: In the past 24 hours, SOL is up 3%, taking its weekly gains to 10.7%.\n\nWhat’s Next: The influence of Bitcoin as an institutional asset class is expected to be thoroughly explored at Benzinga’s upcoming Future of Digital Assets event on Nov. 19.\n\nRead Next:\n\nThis content was partially produced with the help of AI tools and was reviewed and published by Benzinga editors.\n\nImage: Shutterstock"
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE45R25KZWtMV0FhTl9BQ25CTGoteS1FRC1fOEJiTWNyVUI5RHZESDlRN0NrUkJvc2VyeDBaSU9MQVhIT3dvMmYzZ3UwZlVUdHFKdGNCWjE4Mmw5d2RxWVEtclF4Y2hlUUx2UGlhWlpiaE03bl9OcDdzcFpmWF_SAYIBQVVfeXFMTWVhS0lLa0FLM3IwVm5kTXdaTTJPeVlXYXVPZXYtNTFVbmFIZlJMOFJQZXhXYk8tVEhVYXhSV1BhUFRhSXd1NXZIRFBiWFI0OVhJUWI2c0dadjFnaHNmUXFrREtYcjhsdkc2MWhxXzY1aFhKWG1Zc29Rck56WmdQTW5WZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jul 2024 07:00:00 GMT",
        "title": "Etheruem’s next price target: ETH can cross $3700, IF… - AMBCrypto News",
        "content": "Ethereum has a bearish market structure on the daily chart but still targets the next key resistance zone.\n\nThe volume has been sub-par in recent days, hence a retracement next week is possible.\n\nEthereum [ETH] clambered back above the $3k level, and in an interesting turn of events for the bulls, the $3.1k former resistance zone was flipped to support.\n\nThe balancing act between whale deposits and exchange reserves showed that the recent deposits were minor compared to the outflows of the past two months.\n\nThe Ethereum network’s gas fee reached May’s lows, a sign of reduced network activity. This was not a positive sign and reflected reduced on-chain demand and slow growth.\n\nVolume indicators ambivalent despite the breakout\n\nOn Saturday the 13th of July, Ethereum closed a daily trading session at $3,201, breaking out of the resistance zone in the $3.1k area. Despite this achievement, the market structure and momentum were bearish in the daily timeframe.\n\nMoreover, the CMF showed a reading of -0.05 which signaled notable capital flow out of the market. The OBV was unable to start an uptrend as buying volume stuttered over the past ten days. This meant that the volume was too weak to be taken as a clear signal of bullish strength.\n\nThe daily RSI was at 45 to signal bearish momentum but has crept higher over the past week. As things stand, Ethereum might not be ready for a swift upward move unless more volume enters the market.\n\nLiquidation heatmap’s clues on the next resistance\n\nThe $2.7k-$2.8k zone to the south was an attractive pool of liquidity. It was tested in the first week of July but not wholly swept.\n\nThe subsequent price bounce above $3.1k meant the next liquidity cluster at $3.5k-$3.7k would be the target for bulls.\n\nIs your portfolio green? Check the Ethereum Profit Calculator\n\nThe Open Interest has climbed alongside the prices and the funding rate was positive. The sentiment was strongly bullish, and the spot CVD was recovering too.\n\nIf the trend remained intact, the chances of an ETH move toward $3.6k would become healthier.\n\nDisclaimer: The information presented does not constitute financial, investment, trading, or other types of advice and is solely the writer’s opinion."
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTE8yU0VRQzZRYTNJTHhnQjVlNnZKeXhEd0xvTFBtY3ROVGlLTmlLOEQ0bl82czktaHBxM0pfNkEycTN5Wk8wemR4RGhBRTlYdnN5dVhhd0FLUFVNelJ4aTR2SGp2dHoyVGZrMzVtMUhZenRlSm_SAXhBVV95cUxPc2RGV2Nuc3ozVHd5VG1JRTJtWHYtVTdISlN0b2NQZzZpeGQ5UGRac01CNy1UV3RQSHNscG5NUUpiYkRkS0ZWQTFxNElFbzQtVVVqMENhNWZrcVpmZFlZRHVxNnJiMzZDbzhXVXNjVVAyb1g0UDF1dW4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jul 2024 03:20:58 GMT",
        "title": "Ethereum Price Rockets to $3,500 Again: Can Bulls Ignite a Higher Surge? - NewsBTC",
        "content": "Ethereum price gained pace above the $3,350 resistance zone. ETH even tested $3,500 and aims for more upsides in the near term.\n\nEthereum is showing strength and tested the $3,500 level.\n\nThe price is trading above $3,350 and the 100-hourly Simple Moving Average.\n\nThere is a key bullish trend line forming with support at $3,320 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could continue to rise above the $3,500 and $3,550 resistance levels.\n\nEthereum Price Climbs 10%, Bulls In Action\n\nEthereum price started a major increase above the $3,250 resistance zone. ETH even climbed above the $3,350 resistance to move further into a positive zone. Finally, there was a move above the $3,440 resistance, like Bitcoin.\n\nIt tested the $3,500 resistance zone. A high was formed at $3,497 and the price is now consolidating gains. The bulls seem to be active well above the 23.6% Fib retracement level of the upward wave from the $3,085 swing low to the $3,497 high.\n\nEthereum is now trading above $3,400 and the 100-hourly Simple Moving Average. There is also a key bullish trend line forming with support at $3,320 on the hourly chart of ETH/USD.\n\nOn the upside, the price is facing resistance near the $3,480 level. The first major resistance is near the $3,500 level. The next major hurdle is near the $3,550 level. A close above the $3,550 level might send Ether toward the $3,650 resistance.\n\nThe next key resistance is near $3,720. An upside break above the $3,720 resistance might send the price higher toward the $3,880 resistance zone in the coming days.\n\nAre Dips Limited In ETH?\n\nIf Ethereum fails to clear the $3,500 resistance, it could start a downside correction. Initial support on the downside is near $3,400. The first major support sits near the $3,320 zone and the trend line.\n\nA clear move below the $3,320 support might push the price toward $3,270 or the 50% Fib retracement level of the upward wave from the $3,085 swing low to the $3,497 high. Any more losses might send the price toward the $3,220 support level in the near term. The next key support sits at $3,150.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone.\n\nHourly RSI – The RSI for ETH/USD is now above the 50 zone.\n\nMajor Support Level – $3,320\n\nMajor Resistance Level – $3,500"
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE5RZk1GcVZOM3BoWXZXSmUyMC1kdzhYNm8taGZfOHRaMlNWQmYzcGdQbkxCd1BzNXlvak91Qm5EemMxREtfRHBVcWR5ZUdGWTA1RUNzcjVXb3NMcHJ1TnBzdmthVU9VTVIwOUdXUmxKajFSaVo5Z1FV0gF8QVVfeXFMT0hJVXlVdi12YkNPUkd5Q3ppNDFKNDVBZWdYMWNuX1dZYWFkaHBqanpWczFlVHVOd25ScDFyaERzOHZydFNHYmZVX0JOT3N0YS1RQlhrS28wMENuMld3WTZ6YVN2aUVvdFotZUVZdkt0SDlqbHM2cUZOMXZfcg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jul 2024 21:03:48 GMT",
        "title": "Crypto Analyst Says Ethereum Price Is Headed To $4,000, Here’s Why - NewsBTC",
        "content": "Crypto analyst Linda has made a bullish case for Ethereum (ETH), predicting that the second-largest crypto token by market cap could rise to $4,000. The analyst also explained what could lead to such a price surge.\n\nWhy Ethereum Could Reach $4,000\n\nIn a post shared on TradingView, Linda highlighted the potential approval of the Spot Ethereum ETFs as one factor that could trigger a move to $4,000 for Ethereum. She noted that the sentiment around these funds is positive, with traders waiting for news from the US Securities and Exchange Commission (SEC).\n\nRelated Reading\n\nThese Spot Ethereum ETFs are expected to be approved anytime soon based on predictions made by market experts, including Bloomberg analyst James Seyffart. Similarly to Linda’s prediction, other crypto analysts like Michael van de Poppe have predicted that the Spot Ethereum ETFs will spark a massive rally for Ethereum.\n\nMeanwhile, from a technical perspective, Linda noted that Ethereum’s outlook is bullish and supports the crypto token’s potential rise to $4,000. She claimed that the trigger area for buyers was at $3,200. In line with this, she believes that further final consolidation of the price above the 200-day moving average and a breakout above $3,200 will “become the reason for strengthening,” with a potential price target between $4,000 and $4,800 in sight.\n\nOn local timeframes, Linda also stated that there are “prerequisites for a bullish mood,” especially on the daily timeframe, where the analyst noted that a rebound from strong support is forming. Based on her analysis, Linda claimed that the overall outlook for Ethereum points to a further rise to $4,000.\n\nEthereum’s Chart Identical To Bitcoin’s Before ETF Launch\n\nCrypto analyst Crypto Rover recently mentioned that Ethereum’s chart is identical to Bitcoin’s before the Spot Bitcoin ETFs launched. Based on this, the crypto analyst was suggesting that Ethereum could make a similar run to the one the flagship crypto enjoyed after the Bitcoin ETFs were approved.\n\nIn another X post, the analyst stated that the Spot Ethereum ETFs would be approved, meaning that Ethereum’s price rally could already be on the horizon. ETH’s price surge is expected to happen thanks to the inflows the Spot Ethereum ETFs will record. Crypto research firm K33 predicts these funds could attract as much as $4.8 billion in their first five months of trading.\n\nRelated Reading\n\nWhy Did The Cardano Price Surge 17% Amid The Crypto Market Crash? 2 months ago\n\nCrypto analyst Leon Waidmann also highlighted how these Spot Ethereum ETFs will spark a massive rally for Ethereum, stating that institutional investors will likely take a huge chunk of Ethereum’s dwindling supply once these funds begin trading.\n\nAt the time of writing, Ethereum is trading at around $3,300, up almost 5% in the last 24 hours, according to data from CoinMarketCap.\n\nFeatured image created with Dall.E, chart from Tradingview.com"
    }
]