[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxOVXE0WlhDMWI0Nmk4M0xVSTZFcVlleUN4c3dBRFFJNzZ3VUI1SGJUc0NpY1A2cVVlNl9MRHFxVUFhOVk0ZjJCVk50a19ZNWxxVHVXQk82aV9ZWk1qOVJsbGdkN2F4N3RYUk41ODg0VXcyUzQzTGt4MW5EZUdIcXFtSFAyUGRiUFNhWUJyTU1ZOWswT09j?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 May 2024 07:00:00 GMT",
        "title": "Why the US election will decide the fate of Ethereum ETFs - DLNews",
        "content": "Ethereum spot ETFs will likely be denied on May 23.\n\nProspective issuers probably won’t sue the SEC — even though the strategy worked to get Bitcoin ETFs out.\n\nThe US election may hold the key to an approval.\n\nThe Securities and Exchange Commission will probably deny applications for Ethereum spot exchange-traded funds on May 23.\n\nThe lack of meaningful interaction with prospective issuers, coupled with Ethereum’s ambiguous regulatory status, have made analysts pessimistic about the chances.\n\nNot to mention the SEC’s recent investigation into the Ethereum Foundation.\n\nThat means spot Ethereum ETFs probably won’t see the light until the end of 2025, Bloomberg Intelligence ETF analyst Eric Balchunas told DL News.\n\nFaced with a rejection, prospective ETF issuers — like BlackRock, Fidelity, or Ark Invest — have two options: either sue the SEC like Grayscale did for the Bitcoin spot ETFs, or file again at a later date.\n\nFactoring into the equation is the US election. Should former President Donald Trump win a second term in the White House, the SEC is likely to face a change of leadership. And a new chair could be friendlier towards crypto than Gary Gensler.\n\n“If there’s a new president, you file again,” Balchunas said. “Maybe you get approved. Or you sue. Either way, that will take a whole other year to play out.”\n\nSuing the SEC\n\nThe SEC spent years shooting down Bitcoin spot ETF applications before Grayscale filed a lawsuit against the regulator in protest in 2022.\n\nJoin the community to get our latest stories and updates\n\nIn September, a judge found that the SEC had acted in an “arbitrary and capricious” manner by denying the applications. Four months later, the Bitcoin ETFs were launched.\n\nStill, it’s unlikely that the strategy will be replicated for Ethereum ETFs. For one, Grayscale will probably not bring the fire to the SEC a second time, Balchunas told DL News.\n\nLawsuits are expensive — not just in terms of money, but in attention and bandwidth too. And after suffering massive outflows when its Bitcoin trust was converted into an ETF, it wouldn’t be surprising if Grayscale did not aggressively pursue a conversion of its Ethereum trust.\n\nOther prospective issuers, meanwhile, won’t dare pick up the baton and sue the regulator themselves, Balchunas said.\n\n“None of these other firms want to piss off the SEC,” Balchunas said. “Grayscale was unique in that it wasn’t a big ETF issuer. The rest of these firms have other things going on, and they’re more scared.” “Nobody else will step up,” he added.\n\nElection time\n\nAnd why sue the SEC when the US presidential election, slated this November, may solve the problem?\n\nWith Trump leading in some polls, the odds that a new SEC chair will be appointed are higher than previously expected.\n\n“Trump is not necessarily pro-crypto,” Balchunas said. “Remember his previous SEC chief Jay Clayton didn’t allow that ETF either. So he’s not going to be like, ‘let’s just go crazy.’ But he’ll probably still be better for crypto and spot ETFs.”\n\nAssuming a new chair is appointed in April or May, and filings submitted immediately afterwards, that could bring the deadline for approval or rejection to somewhere around December 2025.\n\nAlternatively, issuers could try to file as soon as the election is over — or even before results are in — to speed up the timeline.\n\nAnd if Joe Biden wins?\n\n“In the past cycles, when they denied spot Bitcoin ETFs, there was usually a cooling off period for like a year where nobody did anything,” Balchunas said. “And then out of the blue someone is like, ‘Oh, the hell with it’ and files again.”\n\n“My guess is that issuers will take the summer, lick their wounds, just be bummed, and then see what happens in the election,” he added.\n\nTom Carreras is a markets correspondent for DL News. Got a tip about Ethereum ETFs? Reach out at tcarreras@dlnews.com"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxNTjByQnZtTzRiaE1sNGF4c2Z2clI3cmp2bHpxV0oxc0VJVkd3Tmlub1JFVHF3Z0plNkVuOUl2bV85dWtxTGJSMnNnMTVTS0NNeU1EX3pYVFd6Rlp3ZmhMbXhkUkpBYnlvX2dteXpPUWdYN0FqVXVsT05oTXluY3gzWnpHSWxzbV9WX1dzNTVjMHFpWVpF0gGcAUFVX3lxTE96NWFWTWdRamZDaVFETjZYcW9WcDhpMnFzU2k3V0NNWHVhS2ltNXlaM2MzUS1hb1VuSTNROG44QWE1TS14ODNuS1JNREh4aTdNcndJSklLUHJXYWkyNGpwdzdPb3E5UXhvLVQxTkkycWpsdWYtcU1NaVEwTUtwZzR3ck0zUVhKbU1aZ0RKd1pLdmZwVFNSTXJVMC1kbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 May 2024 07:00:00 GMT",
        "title": "Bitcoin and Ethereum Tank as Crypto Liquidations Top $150 Million - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe prices of Bitcoin and Ethereum both plunged Friday morning, prompting a fresh wave of long position liquidations that pushed total crypto liquidations above $150 million over the past 24 hours, per CoinGlass.\n\nBitcoin dropped by more than $2,000 in an hour, falling from a price above $63,000 to a daily low of $60,890, according to CoinGecko. It has since rebounded slightly to $61,130 as of this writing, and is down more than 1% on the day.\n\nMeanwhile, Ethereum is down by 2% over the last day, falling from $3,027 to a low of $2,927 alongside Bitcoin's plunge. It's up slightly since to $2,940, but still is down lower than it's been since May 1.\n\nIt's not immediately clear what prompted the price drops for the leading cryptocurrencies. Many other top coins have similarly lost ground this morning, including Solana, which fell back below the $150 mark after reclaiming that price earlier Friday.\n\nAD\n\nAD\n\nMore than $62 million worth of long positions were liquidated over the last hour alone. Over the last day, the total of long and short liquidations was just over $150 million across all major cryptocurrencies. Long positions are bets that the price of the coin in question will increase, while short positions bet against gains.\n\nEditor's note: This story was updated after publication with additional detail.\n\nDisclaimer The views and opinions expressed by the author are for informational purposes only and do not constitute financial, investment, or other advice."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxPNU1MZkdJVlZsRzVIY1Q0MHIzUS1VQzVkcVpIeDdscnkyX3N2Z3FRRklSZU8tak83MlViZGR4OWZ3TlRNV0F5SUlHYklGeEVtLUFVeElBc3J2X0FzRERNOWZGX2tPU2Y5bWV4U1Nsck5hRFhpb2Y1S3JoalBFem4wT3lNM3RFNEJ0cE9heWRQNEdod2htdHpMdVBPaG40R2lMbEhzN3l5eTBiOU1lSWRTeno1U1BTbTYzT0VzalpLbnhqWUVGVGt6UUNHd1NjakpGTnJHcNIB2gFBVV95cUxNemN1QzVOM2FfZDE4N250WlpmVXFJME8zVkNHXzFFbDFOay1na05DVmh3VmZKTFU0VUNoQzFPQWM3MDVRbTl2MUVNYTJsSFhyaEt2Z3NQREhWSnpDeGJsY3RlZnpsc3VLVDhjV3ZfQy00aFB3VllJLWNzQTMzWkxoM3JyVEZ0ajZsNUtoMjdpbVhiVjRIcGdSbTNTRU8yS2JJZ04zRjA2RVlZQm1EbFBRR3NDT1E1UzRIeVB3SlgxNFg3cy1ia0pmVlpKUGFGdm9ZOFFfbkZYM0RsUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 May 2024 07:00:00 GMT",
        "title": "Ethereum Competitor NEAR Protocol Looks ‘Extremely Bullish,’ Says Analyst Jamie Coutts – Here Are His Targets - The Daily Hodl",
        "content": "Real Vision crypto analyst Jamie Coutts says that key indicators for one Ethereum (ETH) competitor are flashing bullish.\n\nThe former Bloomberg analyst tells his 14,100 followers on the social media platform X that NEAR Protocol (NEAR) could soar more than 47% from its current value.\n\n“Absolute price momentum: has been consolidating since March. The technical pattern looks extremely bullish if it breaks this resistance around $7.60 which is where a cluster of volume has traded these past months. This is a high conviction set up if it breaks the pattern neckline, producing a target above $10.50 (+30%).”\n\nLooking at his chart, the analyst suggests NEAR is printing an inverse head and shoulders pattern (I-HNS). An I-HNS is a bullish technical formation with the right shoulder suggesting bulls are willing to accumulate the asset without waiting for the price to drop to its previous low.\n\nThe analyst also predicts that NEAR’s bullish trend against Bitcoin (NEAR/BTC) and Solana (NEAR/SOL) will continue.\n\n“Relative price momentum: NEAR versus SOL and BTC are positive and ready to break higher.”\n\nAccording to the analyst, NEAR is also experiencing huge daily active user (DAU) growth on the network compared to other smart contract platforms, which is another bullish signal.\n\n“Absolute active user momentum: NEAR’s Daily active users have grown from 50,000 to 1.76 million in the past year. Ex-NEAR that number has grown from 5.4 million to 8.75 million.”\n\nHe says the user growth rate far exceeds the combined growth rate of the other layer-1 and layer-2 projects.\n\n“Relative active user momentum: that’s growth of 33x vs 0.6x for the rest of the L1/L2 ecosystem.”\n\nNEAR is trading for $7.14 at time of writing, down 3.6% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMibkFVX3lxTE83QjhuZGJyTUlSeEZvSjYxTVFRdm9Ybm51dnZwOHNrc0hPVGJPbkx6YzZkVy1ueE8tdDlJVXYxWEdMLU5TWmE2OXBMQU5DMGF1bFg2NjJEWnZkcWlaRDNxU0tsRlNPSmstMlZETXBn0gFzQVVfeXFMT3ZMNExFbWpXakdEVUlWck1GY3g2ZnBxWnpXQkl6LXBOZEhRYUVZdnZuUE1IQkVMclVTZEM0LW9qYWJud0Zua09ZTk9IeTVKcDlMWWwyMHRNMVVzeXhlRVhlVDlyLU9BZEh2VTg4a1BsUHFlYw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 May 2024 07:00:00 GMT",
        "title": "This Bull Run Might Skip Ethereum (ETH): Opinion - U.Today",
        "content": "Advertisement\n\nIn an acerbic X post, Ethereum (ETH) veteran, prominent investor, podcaster and crypto educator Ryan Sean Adams describes two alternative midterm forecasts for Ether (ETH) as a crypto coin.\n\nBearish: Inevitable puberty of Ethereum (ETH)\n\nIn a 2024-2025 potential rally, Ethereum (ETH) might be overlooked by investors as it is going through the \"awkward\" phase of \"puberty.\" It looks too slow and expensive compared to its own second-layer solutions of various types, Adams admits.\n\nWhile L2s are necessary for the scaling of such a blockchain and reflect the founder's vision of its progress, it has nothing to do with the interests of its most obvious investors.\n\nAdvertisement\n\nMeme coin champions and dApps users (including retroactive airdrop farmers) are too focused on alternative L2/L3 blockchains, while institutional \"big money\" is on its way to Bitcoin (BTC).\n\nThe approval of Spot Ether ETFs in the U.S. might change the status quo but, as U.Today previously reported, analysts are skeptical of the possibility of this step in the coming months.\n\nAs such, Ethereum (ETH) is getting through the challenges of its \"puberty\" while \"toddler chains\" are looking for shortcuts and, therefore, might look more attractive in the midterm.\n\nBullish: Rock solid monetary economics for \"chain of 1000 chains\"\n\nAt the same time, the arguments of Ethereum (ETH) optimists also look strong as of Q2, 2024. Ethereum (ETH) meets this cycle stronger than in 2020 with viable overhyped L2s and zkEVMs driving innovations and attracting value.\n\nWith its \"rock solid monetary economics\" cemented by ERC 4337 implementation, it remains the only profitable blockchain, and its competitors are not even close to this status.\n\nAlso, despite the growing audience of alternative blockchains, Ethereum (ETH) mainnet remains the root chain for 1,000 blockchains, Adams says.\n\nThese two theses are just \"two perspectives for ETH bulls,\" the author concludes.\n\nEther (ETH) is changing hands at $2,925, being 3% down in the last 24 hours."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPemVTWnR6Wk9Ja2RLMmlxcXplM2VrVE95d0xxYVhDdWVBbVl3aFNHMWU2QWpTY1JwWUF0RDFqTnBZLVNEc2pFYWVhYjZ6Q0ZtV3cxWWdRM0Fiel9WRGFlWUNQWFdKRlJqbmd3QmRZRHM4S0ozZ2VOQ1ZQZElYU0JELXphVUo3alnSAY8BQVVfeXFMTW5qaFFjeW5xUVRqamtJVUU5c1RrNDRjZ09IUmZUUXFQMWpvbkdMOTJNT3lyYUlCdndhWlFJenZINGVITGlxTUZpSlBxUG1aX1B3NVpTMmtZYzFmeWE0d05xd09WQS1UM1VibXFnQURndmwwbVRFMVBBX2dJVjVyU0RnRlpMTGhyUmN5LV9Dcmc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 May 2024 07:00:00 GMT",
        "title": "Ethereum Devs Shut Down Linea—Can Layer-2 Networks Be Trusted? - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nLate Saturday, an Ethereum layer-2 network called Linea found itself stuck between a rock and a hard place.\n\nUsing an exploit, attackers had drained $2.3 million worth of ETH from a decentralized exchange that operates on Linea, called Velocore. Unable to reach the Velocore team, Linea’s leadership made the decisive call to freeze all transactions across the network in an effort to prevent further malfeasance. The plan worked: Linea users were insulated from additional losses.\n\nThat’s when the trouble started.\n\nCrypto users immediately decried Linea’s actions across social media, arguing that the company had violated the industry’s core principle, decentralization. If a few people could halt Linea in their pajamas, then how could the network be considered any better than Wells Fargo?\n\nAD\n\nAD\n\nI'm done with this crap. It's 2024, and L2s are still spewing the same bullshit about their core values being \"permissionless\" and \"censorship-resistant\" after being live for over a year but are still running centralised sequencers. Give me a break. They act all high and mighty,… https://t.co/MykDJ9G3IF — sudo rm -rf --no-preserve-root / (@pcaversaccio) June 2, 2024\n\nLinea immediately pivoted, posting on Twitter that the network was still in the “training wheels” phase of decentralization, but that it planned to eventually transition to a completely trustless structure. (Disclosure: Linea is owned by Consensys, which is one of 22 investors in Decrypt).\n\nConsensys' L2 unilaterally turned off the chain yesterday Reasonable given the circumstances but also a clear sign that this is not crypto pic.twitter.com/q8VaaEFOpN — mert | helius | hSOL (@0xMert_) June 2, 2024\n\nThe incident laid bare a contradiction, some developers say, that doesn’t only pertain to just one blockchain. Rather, it exposed flaws in the entire, burgeoning layer-2 ecosystem—a collection of privately owned networks that has been frequently touted as Ethereum’s path forward.\n\nAD\n\nAD\n\n“So you're saying you intervened on behalf of users here, but in the future, hopefully, if you work really hard, you won’t be able to intervene and your users will lose all their money?” Tom Lehman, the co-founder of several Ethereum projects including layer-1 alternative Facet and Ethscriptions, told Decrypt. “It doesn’t make sense.”\n\nTo Lehman, the contradictions exposed by Linea’s public relations woes this week are not isolated—they are endemic to layer-2 networks.\n\n“Having a layer-2 that's centrally controlled is not a problem,” he said. “It’s just that every single one of them being centrally controlled is a problem.”\n\nNearly all major scaling networks—like Optimism, Arbitrum, Base, and Polygon—were created by private, for-profit companies. Most rely on sequencers, controlled by the network’s team, which batch transactions together and submit them to the Ethereum mainnet. In such cases, like Linea’s, project teams have the power to effectively shut off a network by halting said sequencers.\n\nWhy do most layer-2s exert such centralized control over their transactions? Linea, which did not respond to Decrypt’s questions by the time of publication, claimed in statements this week that the issue is a technical one that requires long-term finesse.\n\nBut financial incentives may also be at play. By controlling that single choke point through which all transactions must pass, layer-2 teams also control the profits derived from processing every network transaction. Such fees are the lifeblood of layer-2s, which often employ dozens of people, and such Ethereum networks are collectively raking in millions of dollars in monthly, on-chain profit.\n\n“L2s can be very profitable to run,” Lehman said. “But that profit is tied to how much control you have.”\n\nSome layer-2 teams say they are ahead of the pack, and have taken distinct steps towards decentralization. Arbitrum, for example, features a backup pathway that allows users to post their transactions to Ethereum directly, in case any issues emerge within the Arbitrum ecosystem. Submitting transactions via this delayed inbox is not ideal, however, and can take up to 24 hours.\n\nAD\n\nAD\n\nSteven Goldfeder, the CEO of Arbitrum core developer Offchain Labs, told Decrypt that the company is currently working to decentralize its sequencer—but made a point of arguing that it poses less of a centralization threat than other layer-2s, given that the Arbitrum Foundation could not single-handedly prevent users from posting transactions.\n\n“On Arbitrum, the problem is a lot smaller than on other networks,” said Goldfeder.\n\nGoldfeder welcomes vocal criticism of centralization risks in the layer-2 ecosystem. He believes such dissent applies crucial pressure to companies that otherwise might focus on different priorities.\n\n“Otherwise, you have the wrong incentives: growth first, and decentralization at some point,” he said. “If we just take one centralized system and replace it with another centralized system with a vague claim of eventually decentralizing—often without technical details—then I think it's very dangerous.”\n\nSome developers like Arjun Bhuptani, the founder of inter-blockchain bridge Everclear, however, feel that even Arbitrum’s solution to current centralization issues on layer-2s is insufficient.\n\n“It is better, but is still not ‘censorship resistance,’” he told Decrypt of Arbitrum.\n\nFurther, Arbitrum itself has suffered network-wide outages repeatedly in the last year.\n\nTo Bhuptani, the issue of centralization is so pervasive on layer-2s simply because the privately owned networks are currently facing other, greater concerns.\n\nAD\n\nAD\n\n“It largely just comes down to prioritization,” he said. “Projects are seeing bigger threats to their survival today on other axes than censorship, and so building decentralization is lower priority than things like security, custody risk, and market traction.”\n\nIt’s true that the matter of censorship on layer-2 networks is still largely theoretical. The Linea team, for example, has never used its power to block transactions on behalf of a sovereign government.\n\nBut such a scenario is by no means fanciful. The U.S. government has blacklisted Ethereum wallet addresses on multiple occasions. Centralized crypto exchanges have cooperated with the Israeli government to ban flagged accounts. Just last month, a Dutch court sentenced a developer of Tornado Cash, an Ethereum coin mixer designed to keep transactions private, to over five years in prison.\n\nEven those within the layer-2 ecosystem worry about what might happen if the private teams behind so many networks—which, thanks to their incredibly low transaction fees, have recently been positioned as the best way to securely onboard the masses to crypto—are legally compelled to do the bidding of governments across the world.\n\n“Something that I might think is legitimate,” Goldfeder said, “some oppressive regime somewhere might think is illegitimate behavior that should be censored.”\n\nSome Ethereum developers feel, however, that the whole debate this week about Linea and crypto’s future has been blown out of proportion.\n\n“It's easy for people who were not affected by hacks to complain,” Joseph Schiarizzi, developer of Arbitrum-based stablecoin OpenDollar, told Decrypt. “But if you've ever been a victim, you understand the Linea team made the right move.”\n\n“I do not expect every piece of infrastructure to be decentralized,” he continued. “I care much more about honesty and transparency, which Linea was great on.”\n\nAD\n\nAD\n\nLehman, who is currently developing a more decentralized alternative to networks like Arbitrum and Optimism, said he doesn’t want to demonize layer-2 networks or dismiss their usefulness. He only worries about crypto’s future if they become omnipresent.\n\n“The problem comes when you say ‘L2s are the future, that's how we scale, that's it,’” Lehman said. “And in the process, [you] hand over the keys to giant billion-dollar entities and endorse them running insecure systems.”\n\nEdited by Andrew Hayward"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTE9rbE9tZTlwZ014c2tCY3c2Sk5VanBTY2lCQWFpaUZqWWNUV0haUjhJV3VuRkpMeU9zcUlyX3ZKLWxEUGJiaU03Yml6WVItNUduc0M2TkF0RDc1eGFreGNIXzlxbjAycDhlXzVoTFlwTdIBd0FVX3lxTE5MQU9aUmJQRktSZG1yMFNGOG1sNjV6MUtBY0dHdFJ3ZXJEZkJsWkNMc1pESGhDYzgwV3lad3R6bE0wZlFYTXBGNHZrOHJ6b3hHdjVoT1dkaXdRbXdhekw0VUNQeWNsRFRZMmN2NmEycXNZUDIwOWIw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 May 2024 07:00:00 GMT",
        "title": "Will Vitalik Buterin’s Gas Fee Proposal Make Ethereum More Like Solana? - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEthereum could use a much better system for charging transaction fees from its users, the network's chief architect Vitalik Buterin argued in a widely circulated essay published Thursday.\n\nButerin's post, which laid out a path toward a more customized and equitable system, immediately garnered reactions from two principal groups: Ethereum users, who expressed their excitement at the prospect of lower fees on the network’s costly mainnet; and Solana users and developers, who noticed that Buterin's proposal sounded an awful lot like the Solana network's own fee model.\n\n“It’s certainly a Solana-esque approach,” Mert Mumtaz, a prominent Solana builder and the co-founder and CEO of infrastructure startup Helius Labs, told Decrypt.\n\nSo just how similar is Buterin’s “multidimensional gas fees” proposal to Solana's \"local fee markets\"?\n\nAD\n\nAD\n\nGas fees refer to the transaction costs that blockchain users pay to the network. This system is in many ways what gives tokens like Ethereum (ETH) and Solana (SOL) their value. You need ETH to pay gas if you want to do just about anything on the Ethereum network, just like you need SOL to do things on Solana. When there's a lot of activity on the network, gas fees go up. And when there's less activity, gas fees go down.\n\nIn some ways, Solana's current gas fee structure and Vitalik's “multidimensional gas fees” proposal stem from the same philosophy: In the name of fairness, different types of on-chain transactions should cost different amounts, depending on demand. But in practice, leaders of both networks appear to have different ideas about how to implement such a philosophy—leading to a potentially significant difference in user experience.\n\nSolana currently operates on a “local fee markets” structure, wherein gas fees are calculated on a per-account basis, project by project. In this system, spikes in gas fees due to network congestion are effectively quarantined to specific projects.\n\nAD\n\nAD\n\nFor example, a spike in gas fees induced by a hot Solana NFT mint should only impact users who are interacting with that project—users elsewhere across the entire Solana network should be unaffected. (There is currently some disagreement within the Solana community about whether local fee markets actually work as effectively as intended, in part due to the hyper-congestion that can occur in crowded mini-gas ecosystems.)\n\nBut Solana’s setup makes a clear contrast to Ethereum—where demand for wildly popular NFTs has previously clogged the entire network, sending gas fees skyrocketing for everyone.\n\nEthereum is in its Solana era https://t.co/hGfLU3zqPP — Alex Kroeger (@alex_kroeger) May 9, 2024\n\ndid he just copy this off solana — willo (@willo_0x) May 9, 2024\n\nEthereum 🤝 Solana — Sam Ragsdale (@samrags_) May 9, 2024\n\nThe “multidimensional gas fees” concept proposed by Vitalik Buterin does seek to make Ethereum transaction costs more equitable. But it doesn't appear to outline a boutique system like Solana’s, in which every individual project on Ethereum would become its own siloed gas ecosystem.\n\nInstead, multidimensional gas on Ethereum would only distinguish between different macro categories of effort required to complete network transactions, Ethereum core developer Marius Van Der Wijden told Decrypt. For example, computation, storage, and calldata might fetch different premiums at a given moment, depending on demand. Different on-chain transactions consist of different ratios of those categories of computing.\n\nPer Buterin, Ethereum’s Dencun upgrade, which went live in March, constituted the debut of such a system by sending layer-2 data, the sort that comes from layer-2 networks like Arbitrum, to “blobs.” Blobs feature different prices and different limits than the rest of an Ethereum block.\n\nAD\n\nAD\n\nAt a macro level, expanding multidimensional gas to differentiate between more computational categories might improve Ethereum’s efficiency, and in Buterin's view, significantly increase scalability of the network’s mainnet.\n\nBut it likely wouldn't insulate Ethereum users from spikes in network volatility induced by trending projects—it’s not that boutique in design.\n\nSo, all that is to say: Solana and Ethereum maximalists, fear not. There will still be plenty of differences to pick apart.\n\nEdited by Andrew Hayward"
    }
]