[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxOdDIxQnNDNzFfcHdMNEtkNUlOM0pGekFRcTBLbVhGX2Z5OEtKX3k2Qy1ZdWVhOGZwUi1ybVlpc0RzV0xHa1NCdmRIU2pqWnNJVkw3TVQ2T2o0Q2ROWjg4Y1ZNZmJyS21lNkNJM0JzTlBmcmcxaGV0d2F5MVhNMWtiUDFyanE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 04 Jun 2024 07:00:00 GMT",
        "title": "Bitcoin and Ethereum Funds See Surge in Inflows Ahead of ETH Spot ETFs Trading - Yahoo Finance",
        "content": "Bitcoin and Ethereum Funds See Surge in Inflows Ahead of ETH Spot ETFs Trading\n\nAccording to CoinShares, global Bitcoin funds registered net inflows totaling $148 million last week. In contrast, short Bitcoin products saw outflows amounting to $3.5 million. Ethereum funds also attracted $33.5 million, marking the second consecutive week of positive inflows after a prolonged period of minimal activity.\n\n“This reflects a shift in investor sentiment for Ethereum, which had endured a 10-week stretch of outflows totaling $200 million,” CoinShares noted. This renewed interest in Ethereum has also positively impacted Solana, which saw $5.8 million in inflows amid speculation about potential Solana ETFs and other altcoin products.\n\nWhile the majority of these inflows originated from the United States, significant crypto investments were also reported in Canada and Switzerland, where Ethereum maintains strong institutional support alongside Bitcoin.\n\nExperts are projecting that Ethereum ETFs could debut in July, potentially capturing about 20% of the demand seen by Bitcoin ETFs. “Securing 20% of Bitcoin ETF demand would signify an enormously successful launch by typical ETF standards,” Bloomberg ETF analyst Eric Balchunas commented last week."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE94R19pa1RUSm1Rbkt3UlllTV84c0RMbzVFVXQ3ZGJyOGQxdmhxZ0ltS3ZPV3NSTmFka3ZCem9tZmFfZXlFaWhsbzYtanl6VkFTRk1wT0pBWFlyNHpPd0dUazNtaDIwdDRFX2RIMU5zekpiTUxqbEJISjVtZmlpZk0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Jun 2024 07:00:00 GMT",
        "title": "All of Michael Saylor’s Ethereum predictions were wrong - Protos",
        "content": "Michael Saylor has made a lot of predictions during his career. And because he became a billionaire in the process, many assume that his forecasts are generally accurate. For example, Bitcoiners applauded his support for — and multi-billion dollar purchases of — bitcoin. He invested at the right times and prices and has earned billions in profit. So when Saylor decided to place a bet on the future of Ethereum, millions listened.\n\nUnfortunately, Saylor got all of his predictions about Ethereum totally wrong.\n\nFirst, he predicted that the SEC would classify Ethereum as an unregistered security. At his corporate conference in Las Vegas a few weeks ago, he said, “Sometime this summer it will become very clear to everyone that Ethereum is deemed a crypto asset security, not a commodity.”\n\nSecond, Saylor predicted that US stock markets would never list a spot Ethereum ETF. “It will never be wrapped in a spot ETF. It will not be accepted by Wall Street; it will not be accepted by mainstream institutional investors.”\n\nFurthermore, he claimed that spot bitcoin ETFs would be the first and last type of spot cryptocurrency ETF. Pointing to the Bitcoin logo, he said, “This is the one, universal, consensus-accepted, institutional-grade crypto asset in the world. There won’t be another one.”\n\nEvery one of those predictions turned out to be wrong within five weeks.\n\nRead more: Michael Saylor dumps quarter billion worth of MSTR while hyping bitcoin\n\nSaylor lost all his bets on Ethereum\n\nDespite Joe Lubin’s ConsenSys lawsuit against the Securities and Exchange Commission (SEC) claiming that commissioners secretly classified Ethereum as a security in some redacted document, there’s no public evidence that they have actually done so.\n\nRead more: ConsenSys says the SEC designated ETH a security but won’t say where\n\nFurthermore, the SEC recently approved three 19b-4 exchange rule change requests from three US stock markets — NYSE, NASDAQ, and CBOE — to list spot ether ETFs. With those landmark approvals out of the way, the SEC will soon review and is widely expected to approve associated S-1 filings from up to nine ETF sponsors.\n\nWorse for Saylor, those sponsors include the largest and most mainstream Wall Street institutions imaginable: BlackRock, Fidelity, Franklin Templeton, Ark, and others.\n\nThat sets a final score for Saylor’s three bets on Ethereum at 0-3: no SEC unregistered securities designation (yet, at least), likely SEC spot ether ETF approval, and mainstream institutional investor support.\n\nSaylor lost many bets, then won one\n\nOf course, Saylor has lost other bets during his career. For example, he lost $15 million in his bet that Washington DC wouldn’t notice his $25 million tax evasion scheme. A few days ago, he agreed to pay $40 million to resolve his tax fraud lawsuit.\n\nSaylor also lost $8.5 million in his bet that he would avoid an SEC penalty for declaring false financials during the dot-com mania. He paid $8.2 million in stock plus $350,000 to settle.\n\nSaylor also lost an uncomfortable number of bets about the best corporate strategy for MicroStrategy for two full decades. From late 2000 through 2020, MicroStrategy stock failed to rally anywhere close to an all-time high despite Saylor’s continuous leadership. Finally, in recent months, and thanks to an improved price of bitcoin, shares are approximately two-thirds of their way back to their dot-com highs.\n\nIn all, Saylor got a lot of bets wrong in his career, but only one mattered. His prediction that bitcoin was worth buying on margin has made up for all of his previous and subsequent errors. His company, MicroStrategy, owns 214,400 bitcoins today worth over $15 billion after buying at an average price of $35,180 per coin. With the crypto trading at double that price today, MicroStrategy has doubled its $7.5 billion investment.\n\nGot a tip? Send us an email or ProtonMail. For more informed news, follow us on X, Instagram, Bluesky, and Google News, or subscribe to our YouTube channel."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxPZENNS0VjYk1kSDFFWjROV0FWTkQzaEt6cWlHcGw4NVVBVC1UOWVnaV8welhIY1k0UHJ3QVE4RVJPU2UzVDZZLWpkc05VMjl0cXJIYUlpTm1fdTlibHNqWHktdHBPOHJqeVE3VzBfSWszY0lxRnpuXzhUajd6eV9XbjZJcnotNTcyeU9TWHJ3LWh4VmwxS2VVcDBoWXVld1RkY1B0cWZmbHFEUmdTcmk3bmR5UGZKS0pZQ1E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 04 Jun 2024 07:00:00 GMT",
        "title": "What The Ethereum ETF Means For Altcoins And Meme Coins - Benzinga",
        "content": "The much-anticipated launch of a spot Ethereum ETF has analysts divided about its impact on altcoins, meme coins and competing Layer-1 (L1) blockchains.\n\nA Double-Edged Sword For Altcoins:\n\nThe potential influx of new investors drawn by the funds could lead to a “rising tide lifting all boats” scenario, according to analysts.\n\nEstablished altcoins with strong utility functions, like Cardano ADA/USD and Polkadot DOT/USD, which power smart contracts and decentralized applications (dApps), could experience significant price increases.\n\nThese projects offer real-world solutions and have established developer communities, making them attractive options for investors seeking exposure to the broader blockchain ecosystem beyond just Ethereum.\n\nHowever, analysts also warn of a potential “flight to quality.”\n\nNew investors, unfamiliar with the intricacies of the crypto space, might prioritize the perceived stability of Ethereum over riskier altcoins.\n\nThis could lead to a temporary decline in the prices of smaller altcoins, especially those struggling with scalability or unclear project roadmaps.\n\nWill Meme Coins Benefit?\n\nMeme coins, the internet’s darlings like Dogecoin DOGE/USD and Shiba Inu SHIB/USD, are a unique case.\n\nPlatforms like Binance and Square anticipate a meme coin frenzy fueled by increased interest in the crypto space.\n\nThis could lead to short-term price spikes for these highly volatile assets.\n\nHowever, other analysts believe this might be a short-lived phenomenon.\n\nMeme coins often lack strong utility and rely heavily on social media hype.\n\nAs the market matures, investors might prioritize projects with long-term value propositions and proven technologies.\n\nA “meme coin top” could be on the horizon, with only the strongest meme coins with real-world applications or unique features surviving the long haul.\n\nAlso Read: Roaring Kitty Return Yields Investor $300K Unrealized Profit On Ethereum-Based GME Meme Coin\n\nWill Ethereum Outperform Solana?\n\nThe rivalry between Ethereum ETH/USD and Solana SOL/USD for dominance in the smart contracts space continues to be a focal point.\n\nThe immediate impact of the Ethereum ETF could see the price of ETH surpass all time highs due to increased investor interest.\n\nHowever, the playing field might level out in the long term if a Solana ETF receives regulatory approval.\n\nUltimately, the success of both platforms hinges on their ability to address scalability issues.\n\nEthereum’s upgrade to Ethereum 2.0 promises significant improvements in transaction speeds and fees.\n\nSolana, on the other hand, boasts impressive speed and low fees but faces challenges regarding network congestion and potential centralization.\n\nOnly the platform that can provide a balance of speed, security, and scalability will truly dominate the smart contracts space.\n\nLayer-1 Blockchains: A Potential Resurgence?\n\nThe recent struggles of Layer-1 blockchains like Avalanche AVAX/USD and Cardano have raised concerns about their future.\n\nWhile the ETH ETF might initially divert attention away from these projects, a broader market surge could benefit established L1s with unique functionalities.\n\nFor example, Avalanche offers high transaction speeds and low fees, while Cardano boasts a strong focus on security and a research-driven approach.\n\nThese projects need to attract developers and build robust decentralized ecosystems to thrive.\n\nL1s that can carve out a niche within the blockchain landscape, offering genuine alternatives to Ethereum, are more likely to experience a comeback.\n\nThe Takeaway: Navigating A Dynamic Market\n\nThe arrival of the ETH ETF marks a significant shift in the cryptocurrency market, with potential benefits and drawbacks for different sectors.\n\nFocus should be placed on the specific use cases, technological advancements, development roadmaps, and community engagement of different projects.\n\nBeyond the immediate impact of the ETF, staying informed about regulatory developments and technological innovations is crucial for navigating the Web3 space.\n\nWhile meme coins might offer a fleeting thrill, established altcoins and L1s with strong development teams and clear value propositions could be better bets for long-term gains.\n\nThese issues and a lot more will be discussed at Benzinga’s Future of Digital Assets conference on Nov. 19.\n\nRead Next: MicroStrategy And Michael Saylor Settle $40 Million Tax Fraud Lawsuit\n\nImage: Shutterstock"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPdnNXTXNReHpCYXBUTzV2R1BOMUxuYndibW5UYlFUQl9VMXRhQWkycm5RaFNfeHB3LW5kRFVkY1EtWFJZcnFXSnowV19XazBWNEMzZk1EY2ZfY01nblVHTnNfT3owQ1U0TlNtVTBPcnpKRmVfQ29XLWhaODMzTTVab2s4YjkyR0FKUHJ0LUVB0gGTAUFVX3lxTE5iTzZ0eTJZSXg0enNzOGdOMDRKWTVzb2U4NU5tUG9tOGdCZzlBY0l2ZVFaRjFlVG8xQWNXYXJkUFMxWlNWNnJVbEpOb1dwNFJ6RTR5Sl80TTRYU2FlMjA1bXlTbkJzQzBpQUNKZ2NtRDBSdWluOTkzYVR5ZEVFcklHQnllMlY4c2xFeXlxWHU3cVZKYw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 04 Jun 2024 07:00:00 GMT",
        "title": "Will Ethereum break through $4k in June? Key indicators to watch - AMBCrypto News",
        "content": "Ethereum’s price inching closer to $4k as key indicators hint at a potential breakthrough.\n\nMarket sentiments are bullish as Ethereum’s long positions outweigh short positions.\n\nAfter breaking out of the bullish flag Ethereum [ETH] tested $3.7 three times, a resistance level that has turned into a support level since 21st May.\n\nThe bulls have not yet accumulated enough momentum to push the price over Ethereum’s all time high of $4k, but now they can glimpse the target point.\n\nThe price is building a bullish momentum that has pushed ETH’s price from $3.7k to the press time price of $3.8k, in the last three days, representing a 3.94% increase. If the run continues, Ethereum price may hit its all time high at $4k.\n\nWhales spikes or social likes steering Ethereum?\n\nAMBCrypto analyzed the Santiment social volume and whale transaction chart.\n\nThe whale transaction chart indicated an increase in whales, which increased price peaks recently. The involvement of large holders indicated a bullish rally in the price.\n\nThe social volumes correlated with the price spikes indicating an increased market interest and discussion in the social media platforms, which may lead to a price surge.\n\nAMBCrypto also analyzed Ethereum’s long/short ratio, indicating a notable increase in the long positions compared to the short positions. This suggested that traders are increasingly bullish on ETH.\n\nThe stochastic relative strength indicator (45.59) indicated that Ethereum was neither overbought nor oversold.\n\nIs your portfolio green? Check the Ethereum Profit Calculator\n\nThis neutral position may leave room for a potential price surge or drop. The MACD histograms show a positive momentum, with the MACD line above the signal line indicating a bullish trend.\n\nThe MACD value of 1.67 further supports the upward momentum."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxQZ0lRM1pIelYzSlQ4WmwwRzdpS3RvTkY3YzJFV3dMSWNCdVhCdi1DUHgzbkNhX3ZucWxjamJNY2N2emhfWnNDOTlpLTU0UlhSMFI3SGdOWEpWajhCZFBaU3B6YWE4SE1vaFJSOWVnYV82OGRiNVllTW9TblhJWm5jNUFwaGZzQWt1dFo1eDZkRFZ0a3UtZ3hnMG1DRmdmMVZTOHVPTDV6UWswaFNpZzdOQnl2bkRfVHlxT09EYWNCS2p6bnPSAcgBQVVfeXFMT1EwWlJQM0h2ZzhUUURQNWRaMW1lb1Z1SEZ3R3VnZGZ4VE1ObHVtall1aG1kbFBNc0dTam5SZGpReGM0dWs0R2VnVkhUQWpiNEt0SXA4Q09vSl95OThjZXlMaEtXTmFJdi1wSzA2WE1meTVrZWRGano5UE0wazhPWW1hT1pZdEJ5YTJaNlBxVUdfVjcxMGNBNUx2SzRpRjdJYlRNWG1QbWNnWFZvWWR0MFZ6THJ3Z04tMU5aaWJXcHlVYml1SVhSajg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 04 Jun 2024 07:00:00 GMT",
        "title": "Ethereum leveraged ETFs go live as price fails to react - FXStreet",
        "content": "Volatility Shares leveraged Ethereum ETFs have officially launched for trading on the Cboe.\n\nEthereum options implied volatility surpasses Bitcoin as investors anticipate launch of spot ETH ETFs.\n\nEthereum could see a new all-time high of around $5,000 following the official launch of spot ETH ETFs.\n\nEthereum (ETH) sustained its sideways trend again on Tuesday following the launch of Volatility Shares leveraged ETH ETFs and an increase in implied volatility across ETH options.\n\nDaily digest market movers: Leveraged ETH ETFs increase Ethereum implied volatility\n\nEthereum surpassed Bitcoin in a key derivatives metric on Tuesday.\n\nThe 2x Ether ETF (ETHU) launched on Tuesday after the Security & Exchange Commission’s (SEC) approval as Fox Business’s Eleanor Terrett confirmed. The ETF, which is the first leveraged Ethereum ETF in the US, will track twice the price performance of futures ETH.\n\n\"Like our 2x Bitcoin ETF (BITX), ETHU may pave the way for 1x spot ETFs in the near future,\" said company cofounder Stuart Barton in an interview with Eleanor Terrett.\n\nAlso read: Ethereum sustains week-long consolidation, sees over $3 billion exodus from exchanges\n\nVolatility Shares is one of the largest holders of Bitcoin futures contracts at the Chicago Mercantile Exchange (CME) after launching a Bitcoin 2x fund in June 2023. With ETHU's launch, many have speculated that the SEC will likely approve spot ETH ETFs S-1 registration statements in the coming weeks.\n\nMeanwhile, according to QCP Capital, Ether options are experiencing high implied volatility compared to Bitcoin as the anticipation surrounding the launch of spot ETH ETFs is causing prevailing bullish sentiment among investors.\n\nImplied volatility indicates how much the market expects the price of an option to change within a given timeframe.\n\nRead more: Ethereum on-chain and derivatives data indicates bullishness following updated ETH ETF S-1s from issuers\n\n\"This bullishness is likely to continue as the market waits for the ETH spot ETF to usher in new demand. The options market certainly reflects this, with ETH vols still trading 15% over BTC vols,\" said QCP analysts.\n\nETH technical analysis: Ethereum to set new all-time high in next major move\n\nEthereum's horizontal trend is gaining strength daily as it continued moving sideways, trading at $3,796 on Tuesday. The consolidation has also seen a decline in ETH liquidations, with long liquidations at $6.33 million and shorts at $4.08 million.\n\nWith derivatives data indicating bullishness, ETH is unlikely to experience any major decline. The $3,618 level may prove crucial in case of a potential dip.\n\nETH/USDT 8-hour chart\n\nETH's next major move will likely follow an upward trajectory to break the $4,093 resistance. Considering ETH's current consolidation, it may see a major rally to a new all-time high of around $5,000 if or when the SEC gives the go-ahead for spot ETH ETFs' official launch.\n\nAlso read: Ethereum price lags, investors potentially reallocating capital after BlackRock's updated S-1 filing\n\nETH options data also aligns with this prediction, with several June call options hovering around the $5,000 level. The bullish thesis will be invalidated if ETH falls below the $3,301 key support."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxNSzhkVnR6bDFZNzc4eUhXX1Q5NVMzTjdsenl5WDlsN3VQWnVSVF9kRFIyS0FYOUFWMlZMZy1oWTZOTHZ6OXh5LTRMODQwQVJacjdXTFY4VXNJcjFJQktnQ1IwQUt2QmhuUVNrMi1FN3Vja1ptVkxzam5aUFY0UzlpTjlvSVlOZnI4eGk3SG4zcmVZNG9LN1lTd1ZmbTlTUE41?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 04 Jun 2024 07:00:00 GMT",
        "title": "Spot Ethereum ETFs will legitimize crypto, lead to ETH supply crunch – Integral - CryptoSlate",
        "content": "The launch of spot Ethereum ETF will potentially result in a supply crunch upon launch, crypto accounting software firm Integral on June 3.\n\nThe projection mirrors the sentiment around spot Bitcoin ETFs before their launch earlier this year. The ETFs connected to the flagship crypto have since experienced record inflows, with the BTC supply on centralized exchanges falling notably in tandem.\n\nEthereum supply crunch\n\nIntegral anticipates that ETF issuers will buy and hold large amounts of ETH, thereby removing a portion of ETH from the open markets and driving up the crypto’s price.\n\nThe trend is arguably already underway. Integral cited crypto entrepreneur Oliver Isaacs, who revealed that more than $3 billion of ETH had left exchanges since the SEC approved spot ETH approvals on May 23 — putting ETH exchange reserves at a six-year low.\n\nIntegral said that separate staking trends will intensify the supply crunch and noted that about 25% of the ETH supply is currently staked. ETF issuers will not engage in staking directly, but staking participants stand to benefit from rising prices, according to the company.\n\nAdditionally, Integral believes that approvals will increase institutional adoption of ETH and validate crypto as a legitimate asset class. Furthermore, it said that approvals could spark an “altcoin season” as demand for ETH spills over into other cryptos.\n\nSpot ETH ETFs are expected to launch in the coming weeks or months.\n\nIBIT accounts for 25% BlackRock flows\n\nMany are waiting to see whether Ethereum will follow the trend set by Bitcoin after ETFs connected to the flagship crypto began trading in January.\n\nThe Newborn Nine spot Bitcoin ETFs have cemented Bitcoin as a viable investment option in the traditional financial industry, as evidenced by their staggering and continued growth. BlackRock and Fidelity‘s IBIT and FBTC stand out in particular, following a record-setting streak of inflows in the history of ETFs.\n\nThe two funds now account for a significant portion of the overall ETF flows for both asset managers.\n\nBloomberg ETF analyst Eric Balchunas said BlackRock’s IBIT accounted for 26% of the company’s $65 billion ETF inflows since the start of the year. Notably, BlackRock is the largest ETF issuer in the US, with 429 exchange-traded funds under its belt.\n\nIBIT has recorded total inflows of $16.7 billion since its launch.\n\nMeanwhile, Fidelity’s competing FBTC fund accounts for 56% of its $15.8 billion total ETF flows this year. FBTC has seen $8.9 billion in total inflows to date.\n\nFidelity has launched and manages 70 ETFs.\n\nBalchunas’ data indicates BlackRock and Fidelity are the second and fifth leading ETF issuers based on year-to-date flows. The two companies rank first and second when solely considering firms that have launched a spot Bitcoin ETF.\n\nMentioned in this article"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFBWalhpcTFuNnpFRTdpUnRrMFNlaUFsQmJLcjAxRmp0ZEJyaEVtTmtuSVM5MFlueFhxNGNzLWtyaUs2X0hjMUNFdFBXUktueE5LcFFTMEpCa1RNTXpoTUhMZkNzeFVfSVdSVTlFdGdST2VMMnY1c2ZIV3NUa0LSAYIBQVVfeXFMT2VHU1pVNmRiSUFYbFloczhMaXJDblVhOUQ0aHpXNGlJM0d4VDZrRjBEaDhsSGRmZy1aeEpRaE0xQUpaOTlKNnZpOVFzc05uWV8zZV90OEVWbWxSRTBWdHVkeDlYRXBSR0RMMG5pR0hOaDRPZHozQnlsYkZmZktFUklwUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 04 Jun 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Whales Make $32 Million Move - What's Happening? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nIn a significant development on the cryptocurrency market, a massive Ethereum (ETH) transfer has caught the attention of investors and analysts alike. Whale Alert, a prominent blockchain tracking service, tweeted that 8,759 ETH, worth around $32.96 million, have been transferred from an unknown wallet to Coinbase.\n\nAdvertisement\n\nThis transfer signals a potential sell-off from an Ethereum whale. Whale movements often serve as significant indicators of market sentiment. Large transfers, especially those heading toward exchanges like Coinbase, typically suggest that the whale might be preparing to sell a portion of their holdings. Such actions can lead to increased volatility and potential price adjustments as the market reacts to the influx of supply.\n\nCurrent market sentiment\n\nThe cryptocurrency market is known for its volatility, and whale movements often exacerbate this characteristic. While the exact intentions behind the recent transfer remain speculative, the market's response has been cautious. As of the latest data, the price of Ethereum stands at $3,761, marking a 1.40% decline in the last 24 hours.\n\nThe recent whale movement has added a layer of intrigue to the market, as investors speculate on the potential impact of such large transfers on ETH’s price trajectory. ETH's price dip in the last 24 hours could be partially attributed to the transfer news, as traders and investors react to the potential implications.\n\nAdvertisement\n\nDespite the recent dip, Ethereum’s overall performance has been strong. The 20.86% increase over the last 30 days highlights the cryptocurrency’s upward momentum, driven by several factors, including the broader market recovery, the spot Ethereum ETF approvals, and the ongoing development within the Ethereum network.\n\nOverall, the recent transfer of ETH to Coinbase has certainly stirred the waters within the market. While the exact intentions of the whale remain unclear, such large movements are always noteworthy and can significantly impact market dynamics. As Ethereum continues to navigate through its price consolidation phase, all eyes will be on broader market reactions and subsequent whale activities."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxOVDVSY3pGZGkyeUJFUHdLTi1vNlB3RmktUHNVWVdJV3UyZ0xpUHo1ejd6ekZUYjdTZ3pBaE1vcEVLSHZaWmdJLTZNTlB2UnhfcHdlZFJDRDZhUHFSdGMtTTh6YlU5M3JiSVdiQ1ByYjk1NnF1ZWlkM2dHRGRPY0VTcjVqYw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Jun 2024 07:00:00 GMT",
        "title": "3 Top Cryptos Worth Holding Beyond Bitcoin and Ethereum - The Tokenist",
        "content": "Neither the author, Tim Fries, nor this website, The Tokenist, provide financial advice. Please consult our website policy prior to making financial decisions.\n\nAmong thousands of cryptocurrencies, it is clear that Bitcoin (BTC) and Ethereum (ETH) took the public spotlight and are likely to take more capital inflows in the future. So much so that even Ethereum is poised to become an institutional investment vehicle via exchange-traded funds (ETFs), joining Bitcoin.\n\nOut of a total $2.63 trillion market cap, including stablecoins, ETH and BTC make 70% of the crypto pie. Year-to-date, Bitcoin and Ethereum are neck and neck, having gained 60% and 62% value, respectively.\n\nHowever, the larger the market cap, the harder it is to move the price upwards, just like in the stock market. This is why many low-cap memecoins performed well during 2024, driven by speculation and memory.\n\nYet, engaging in memecoins is exceedingly risky. Most traders can’t tell if they are riding from the top to the bottom, holding the devalued bags, or riding from the bottom to the top, enjoying substantial profits. After all, memecoins’ value is inherently unclear, which makes them so speculative in the first place.\n\nTo that end, prospective crypto investors should look into these infrastructure cryptocurrencies, which are backed by developers, funding, and clear goals.\n\nImmutable X (IMX)\n\nImmutable X (IMX) is an investor’s exposure to blockchain gaming. While Ethereum is a blockchain network for issuing tokens and smart contracts to power decentralized finance (DeFi) with dApps, it relies on layer 2 networks to scale. Immutable X is one of those networks.\n\nOwing to StarkWare’s zk-rollups technology, Immutable X facilitates zero gas fees for end-users. This contrasts Ethereum’s expensive and volatile gas fees for even simple token transfers. In turn, this is a game changer for game developers who wish to deploy their products at scale.\n\nFor instance, if a game has tradable in-game assets as non-fungible tokens (NFTs), like cards or collectible creatures, traders don’t have to worry about long confirmation times and heavy transaction fees. This boosts the in-game economy and player experience, paving the way for blockchain gaming.\n\nPresently, there are over 300 games in Immutable’s funding ecosystem worth $1 billion over 20 marketplaces. Previously known as Fuel Games, Immutable is the parent company in charge of the Immutable X framework for developers to launch their projects with low friction.\n\nThe cryptocurrency itself, IMX, is the utility and governance token of the network. Akin to shareholders of companies, IMX tokenholders get a say in the development of the platform with a voting mechanism. Additionally, developers using the platform pay 2% fee in IMX tokens.\n\nFor comparison, game developers deploying their games on Steam suffer a 30% sales cut. The total IMX token supply is limited, just like Bitcoin, but to a greater extent, it has 2 billion IMX tokens, of which 74% are already in a circulating supply.\n\nYear-to-date, the IMX token has gained 12% value after price correction but 393% over the last year. Given that the Immutable X network is Ethereum-adjacent, the token is likely to revisit previous highs with the prospective launch of ETH ETFs. According to Fortune Business Insights, the blockchain gaming market is forecasted for a 21.8% CAGR between 2023 and 2030.\n\nJoin our Telegram group and never miss a breaking story.\n\nAvalanche (AVAX)\n\nEthereum’s software engineering path relies on layer 2 networks to offload the transaction burden from the main network. Avalanche (AVAX) is a competitive, versatile network that picked another approach.\n\nInstead of users having to jump through network hoops with their Web3 wallets, Avalanche itself has a modular design via subnets. Each subnet has its own rules and consensus mechanisms, but they all operate under the high-throughput Avalanche consensus protocol.\n\nIn addition, Avalanche boosts scaling with three interoperable blockchains within the network. X-Chain, C-Chain, and P-Chain tackle different aspects of the network, like staking, smart contracts, and asset creation.\n\nThis leads to a greater unified experience for the end-user, who still enjoys fast execution and low fees. Moreover, Avalanche’s C-Chain ensures compatibility with Ethereum, enabling users to transfer digital assets with Avalanche Bridge via the Core wallet.\n\nAttesting to Avalanche’s approach to blockchain design, several banks used it to test their future tokenization efforts, including Bank of America, Citi and JPMorgan.\n\nPowering the network’s economy, the AVAX token is limited to 720 million, of which 55% is in circulation. AVAX token holders get a say in the issuance of the remaining supply. Year-to-date, AVAX is down 14%, making for a solid entry point after a one-year value growth of 160%.\n\nFetch.AI (FET)\n\nJust as Nvidia (NASDAQ: NVDA) reaped the AI hype, Fetch.AI did the same in the blockchain world. The FET token gained 794% value over one year, or 194% YTD. Moving forward, this is crypto investor’s main exposure to the tokenization of AI projects.\n\nThat’s because Fetch.AI (FET), SingularityNET (AGIX), and Ocean Protocol (OCEAN) will all be under the umbrella of the SuperIntelligence Alliance, with its new universal token ASI, poised to merge the market caps of FET, AGIX, and OCEAN tokens.\n\nAfter the merger into ASI, FET tokens will be limited to a 2.63 billion supply. Mirroring the decentralization efforts of finance to counter banks and central banking, the new network’s purpose is to monetize AI development openly and transparently.\n\nThis includes raising funds for AI projects with ASI tokens, paying transaction fees, using it as a governance token for voting, and using it as a utility for open-source AI development. After the merger announcement in mid-April, the FET price has been moving sideways, having dropped by 3%.\n\nWhich types of tokens do you prefer as your main exposure: sound money, generalist DeFI, gaming, or something else? Let us know in the comments below.\n\nDisclaimer: The author does not hold or have a position in any securities discussed in the article."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiZkFVX3lxTFA4UkNLZ21hcU1TRlJpMzNmY0ozdXo3Qmh5WXdmbmt4dUljajM0M0hDUzhjd01Ud1lvZkRBdUJiUWMyNk1rTnFxZ1U1Tm1fNWJ2Nm5VT3pDT3VBRlptU2ZIeDJHY21Bd9IBa0FVX3lxTE5PdWVDS1NCbUYwLVRHZGFHVEVRS1JNUXpWZjYwbVJlWDlVTVhLMEpvMGZBU001Mzl6ZWs2alhzWG5JbjUxbktJd3o4cW83eG5RaFJhT1JGVERwWEVhNFAyOFNOWk1IUHBvNEtF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 04 Jun 2024 07:00:00 GMT",
        "title": "Is Ethereum (ETH) in Danger of Price Drop? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nEthereum might drop below a crucial price level, especially if the historical support level does not hold. For now, Ethereum is moving at the $3,760 price level, with support at $3,720. In case of a drop below the aforementioned support, the 26 EMA is the next level for a bounce.\n\nAdvertisement\n\nPotential volatility is indicated by Ethereum's current price action. Since the $3,720 support level has already been put to the test multiple times, bulls must protect it. The 26 EMA, which is currently at $3,568, is the next major support if this level is broken.\n\nIt will be carefully observed if this moving average can offer support, as it has in the past during corrections. The signals from the technical indicators are conflicting. The fact that the RSI is circling 62 indicates that ETH is not yet in overbought territory, but more downside is possible before oversold levels are reached.\n\nAdvertisement\n\nThe low volume, on the other hand, suggests that there is not much buying interest to drive prices higher. Additionally, it is generally regarded as a bearish signal that Ethereum has been moving in a consolidation for more than a week. This implies that there may be a slowing of the recent upward momentum.\n\nIn comparison to other cryptocurrencies, Ethereum has performed rather well, considering the larger market environment. External variables though, like news about an ETF or notable changes in the price of Bitcoin, might have an effect. However, the market is relatively bullish, which could be beneficial to ETH."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPVWNKc3pyNGZtc2xXYTBvcVdhVjNXLXU1Ml8zM05zemNhaTA0QkRjendyWXJuWWRSb2R4OTNlYm5BQ2JpMkZaeVRZdG9Zd0hSek9GMENTTnBOakx6UG9MalBuSjNsZkp3MExqTGZLMzZtLW1TWUFuYjNFVnNXa0F1ZVpsS2ttUG8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 04 Jun 2024 07:00:00 GMT",
        "title": "Bitcoin and Ethereum Rise: Why Furrever Token’s 25% Bonus is Your Next Best Move! - Yahoo Finance",
        "content": "Furrever Token\n\nNew York, NY, June 04, 2024 (GLOBE NEWSWIRE) --\n\n\n\nAs Bitcoin and Ethereum continue their impressive climbs, investors are looking for the next big opportunity. Enter Furrever Token, a unique and engaging cryptocurrency that’s ready to steal the spotlight with an exclusive 25% bonus offer. Here’s why you should consider adding Furrever Token to your portfolio amidst the rise of Bitcoin and Ethereum.\n\nBitcoin’s Bullish Momentum\n\nBitcoin is experiencing a significant rally, with its futures premium hitting a seven-week high. This surge is fueled by increasing institutional interest, positive market sentiment, and widespread adoption. The strong performance indicates that Bitcoin's upward trend could continue, making it an attractive option for investors seeking solid returns.\n\nEthereum’s ETF Excitement\n\nEthereum is also on an upward trajectory, bolstered by the potential approval of Ethereum ETFs. These ETFs are expected to drive substantial institutional investment, further solidifying Ethereum’s position in the market. With a robust year-on-year growth, Ethereum is poised for significant gains, making it a key player in the crypto landscape.\n\nDiscover Furrever Token\n\nAmid the buzz around Bitcoin and Ethereum, Furrever Token (FURR) offers a refreshing and delightful investment opportunity. Operating on the BNB-20 blockchain, Furrever Token is designed to bring joy and engagement to the crypto world with its charming cat-themed ecosystem. The tokenomics are strategically planned, with 65% available during the presale, 25% allocated for decentralized exchanges (DEXs), and 10% reserved for the team, locked for a year to ensure stability and long-term commitment.\n\nThe Unmissable 25% Bonus\n\nTo capitalize on the current market excitement, Furrever Token is offering a limited-time 25% bonus on new purchases. Available from May 31, 2024, to June 10, 2024, this offer allows investors to receive an additional 25% of Furrever Tokens using the bonus code FURR25. This is an exceptional chance to maximize your investment and join a vibrant community centered around fun and engaging interactions.\n\nWhy Furrever Token is Your Next Best Move\n\nInvesting in Furrever Token now provides several benefits. First, the 25% bonus significantly enhances your returns, giving you more tokens for the same price. Second, Furrever Token’s ecosystem promotes active community engagement through regular challenges and exclusive content, fostering a sense of belonging and joy. Lastly, with an audited smart contract by Securi Lab and a dedicated team ensuring the project’s longevity, Furrever Token offers a secure and reliable investment option.\n\nStory continues\n\nConclusion\n\nAs Bitcoin and Ethereum continue to dominate the headlines, Furrever Token’s 25% bonus offer presents a unique and rewarding investment opportunity. By taking advantage of this limited-time deal, you can boost your portfolio while enjoying the charm and community of Furrever Token. Don’t miss out – visit furrevertoken.com to claim your bonus and become part of this exciting new venture in the crypto world.\n\n\n\nJoin Furrever Token Presale Now:\n\n\n\nFurrever Token Official Website\n\nVisit Furrever Token Presale\n\nJoin Official Telegram Group\n\nFollow Official X Account\n\nMedia Contact:\n\nRobert Smith\n\nhttps://furrevertoken.com/\n\nsupport (at) furrevertoken.com\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\n\n\n\n\nCONTACT: Robert Smith support (at) furrevertoken.com\n\n\n\n"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMi3AFBVV95cUxPSlkxV2Eyc0tKMDVsZjF0S2Z5aUFkalp0VGJGUlduVlpkRG1XTU1xQmFDUUpiOEV5aUtEeWVHbFBmTEhaUEFzVVZBVGdhbnY4Nm1fT1ZWaWhyR2pBZ212R0hDRVlGYUNCYVkwZFRtcU9Pcjk3SHI1a3dsejVmVEp3Q3VsaFVDN0hJUkk3R3JpVEdUSFhEdW44SVItb1A1YTlGcS10VWt3eVkxQUxZWm82T1FMdXVmYzRXeG1FMjhRZWxjN09sdC0wVUxXN2ZPZXozRnNNOURoM201YXRw0gHiAUFVX3lxTE9iOXBVb0dESUd2d1FPME1lZmZrb2YzTlFjVlNEMU9GUWM0VkRheDd1ZzZTWGFDOGFoUE1wR3NJREVjRlBvdWVMTzdMS3dHY2VZLThHZGQtelNXY2FPTk5HbGdxWm5XTU9UNGNGVE0yaFZIOGtHVzFxSmtxYjB1cWlQaGs1cUhVMEhiZ1dFMTR1cXZaT1JId0pMaU0zVFd6NWVhMFlCT0hqY3dkT0FXSGZiTEc2NkZ5U0Z1STR6N21tSjl1SkpIQ2JmcDZIdVRzeUZsWm40aG5jNzZzMFRNVnVpN0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Jun 2024 07:00:00 GMT",
        "title": "Ethereum open interest surges by 50%, SEC Chair says ETH ETF launch will take more time - FXStreet",
        "content": "Ethereum ETFs ‘will take some time’ before they launch, according to SEC Chair.\n\nETH's open interest on exchanges surged 50% to a new all-time high after SEC’s U-turn towards ETH ETFs.\n\nNew accumulating addresses holding 10-10K and 10K-100K ETH have grown steadily after ETH ETF 19b-4 approvals.\n\nEthereum (ETH) price hovered around $3,860 on Wednesday following Securities & Exchange Commission (SEC) Chair Gary Gensler expressing his opinion that the launch of spot ETH ETFs may be delayed. Meanwhile, Ethereum derivatives products on exchanges have seen a surge in open interest (OI).\n\nDaily digest market movers: ETH ETFs delay, rising open interest, new accumulating addresses growth\n\nIn an interview with CNBC on Wednesday, SEC Chair Gary Gensler said spot ETH ETFs would \"take some time\" before they go live on exchanges, indicating S-1 approvals are not imminent. He noted that his agency is still working on disclosure measures with exchanges.\n\nRead more: Ethereum leveraged ETFs go live as price fails to react\n\nAfter the SEC's sudden approval of 19b-4 filings from eight issuers on May 23, several analysts expected the agency to respond to S-1 registration statements quickly. The SEC's request for issuers to submit updated S-1 filings on Friday also seemed to have confirmed the expectations of these analysts.\n\nFollowing the filings, Bloomberg analyst Eric Balchunas suggested spot ETH ETFs would launch in July. However, with Gensler's recent comments, it may take longer before the ETFs begin trading.\n\nIn other news, open interest (OI) for ETH derivatives products on exchanges reached a new all-time high, rising by 50.3% to $14 billion, according to CCData Exchange Review for May. Notably, open interest on the Chicago Mercantile Exchange (CME) surged by 59.4% to $1.25 billion.\n\nAlso read: Ethereum sustains week-long consolidation, sees over $3 billion exodus from exchanges\n\nMeanwhile, the balance of new accumulating addresses holding between 10 - 10K and 10K to 100K ETH has been growing steadily since the SEC's pivot on ETH ETF, according to data from CryptoQuant.\n\nETH New Accumulation\n\nETH technical analysis: Ethereum to maintain sideways trend until spot ETH ETFs launch\n\nEthereum saw a slight gain on Wednesday, trading near $3,860 and continuing its sideways trend.\n\nETH's 30-day MVRV also aligns with the horizontal move, hovering around 6% in the past week. This indicates that the number of Ethereum addresses that purchased the coin within the last 30 days has seen an average of 6% gains.\n\nRead more: Top 3 Price Prediction Bitcoin, Ethereum, Ripple: Bitcoin’s momentum poise to propel crypto market\n\nDespite the horizontal trend, whales are still accumulating ETH, and both long-term and short-term holders will likely hold onto their tokens.\n\nETH may continue its horizontal trend until the official launch of spot ETH ETFs. The $3,618 price level remains key support in case of short-term price swings. In the long term, ETH may overtake the $4,093 resistance and flip the $4,878 level to set a new all-time high of around $5,000.\n\nETH/USDT 4-hour chart\n\nQCP Capital analysts also share the bullish view: \"ETH has been lagging on this move, but we expect a catch-up and possibly even outperformance against BTC when the ETH spot ETF begins trading,\" they said.\n\nETH liquidation data shows a total of $23.78 million liquidations, with $13.81 million of liquidated long positions and $9.97 million of shorts, according to data from Coinglass."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxOUmxHMDVGNkk3UEJ3bkxhUHlSV0FRaURUZmNiQWtOaEs0Q1hGZ2loNkQxNUprb3pqcjZjZ0JIMU1sSXE3YU05LVBWQmMtTnVTRmxaUHBqeWgzUmIzbjVNUmVTTzZMSjVHeGdKWlBYYkdIV3Yzbzd2VTNrdENodktRRUlSZTdPZmlfd3RwaNIBkgFBVV95cUxOY2JsYVlKVlM5NFFJZm5EZEJLbUc3REpTOGkyN2daRHVETVZlbEZjT3pQSkVacE1sal90ai1oWXI3Q3JraW5oRjI3ZGJKRVpoT1ZhOXZ2SWxTc3VQMUxkNERpM3c2WnNmV0J5ajdKYkp0b2ozblJzSFg2ZVBja0dndEZGQzVNRVJPaFhEamtQMXhKUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 04 Jun 2024 07:00:00 GMT",
        "title": "Ethereum exodus: Big ETH players gearing up for post-ETF rally? - AMBCrypto News",
        "content": "800,000 ETH (worth $3 billion) were withdrawn from exchanges post-ETF approval.\n\nLarge investors and institutions may be positioning for a bullish future.\n\nEthereum’s [ETH] market performance has shown remarkable resilience in the face of recent fluctuations, maintaining a stable price level below the $4,000 mark despite slight volatility.\n\nOver the past week, Ethereum’s value oscillated between $3,800 and $3,700, closing recently at approximately $3,768.\n\nThis relatively steady state, characterized by a modest 2.1% decline over the week and a 1.1% dip in the last 24 hours, might seem uneventful at first glance.\n\nHowever, this could be indicative of a more profound dynamic at play within the crypto market.\n\nThe recent calm in Ethereum’s price coincides with significant developments in the regulatory landscape and market structure, particularly with the U.S. Securities and Exchange Commission’s (SEC) approval of the Ethereum Spot Exchange-Traded Fund (ETF).\n\nThis regulatory milestone has set off a notable reaction in the crypto exchanges, leading to a substantial shift in Ethereum holdings.\n\nWhale movements and market impact\n\nPost-ETF approval, Ethereum saw a dramatic increase in activity, with around 800,000 ETH, valued at nearly $3 billion, being withdrawn from exchanges within just eight days.\n\nThis mass exodus of Ethereum from exchanges mirrors a similar pattern observed previously with Bitcoin following its ETF approvals, suggesting a strategic positioning by investors in anticipation of heightened demand.\n\nThese withdrawals were highlighted by Cryptoquant’s analysis, which pointed to a possible orchestrated move by institutional players preparing to cater to their clients’ needs in the wake of the ETF launch.\n\nThe implications of such significant market movements are quite profound.\n\nCrypto analyst Burak Kesmeci, reporting on the CryptoQuant QuickTake platform, speculated that either large-scale investors (“whales”) or institutions might be gearing up for a bullish future for Ethereum post-ETF.\n\nThe massive outflow, according to Kesmeci, is likely to positively impact Ethereum’s price in the medium term, as these large holdings reduce available market supply, potentially leading to price increases as demand continues to rise.\n\nInvestor appetite for ETH grows, but what do fundamentals say?\n\nSupporting this analysis, data from IntoTheBlock revealed a growing concentration of Ethereum holdings among large investors.\n\nAs of 31st May, 2024, 41% of Ethereum wallets held more than 1% of total circulation, a significant increase from earlier in the year. This concentration suggests a growing confidence among significant stakeholders in Ethereum’s long-term value.\n\nHowever, it’s essential to consider the broader market dynamics. Despite the potential for a supply squeeze, the overall circulating supply of Ethereum has continued to rise, indicating that not all large holders are in accumulation mode.\n\nFurthermore, trading metrics such as open interest and trading volume on futures markets have shown substantial increases, suggesting a robust and active trading environment that could influence Ethereum’s price trajectory.\n\nIn the past 24 hours, Ethereum’s open interest has seen a significant uptick, rising by nearly 3% to a valuation of $17 billion. This surge has also boosted open interest volume, which has increased by approximately 15% to $21.40 billion.\n\nIs your portfolio green? Check the Ethereum Profit Calculator\n\nMeanwhile, an analysis of Santiment’s data by AMBCrypto reveals that holders of 0.01-10 ETH have reduced their overall ETH holdings, while addresses with more than 10 ETH have also sold off a portion of their assets.\n\nThis profit-taking behavior, observed among both retail investors and whales, has not been intense enough to negatively impact prices."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPbHNVRGZvbmh3YUhtaHE5YTdCTGR6eklsQnktOG0xdHlyMWUyOEZfLWNENEN5emZiT05sb1E5VE1PZlRzaWJEdGNhNGdUa24xNmNMMGJBeFZ2MkppSmxnNDZwS3lZWndNRHVQQ0w3eVlneThsaXhzVUxVaW95aWdiY0lici1CZWlq?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Jun 2024 07:00:00 GMT",
        "title": "Shiba Inu: How High Can SHIB Go When Ethereum Hits $20,000? - Watcher Guru",
        "content": "Cryptocurrency investors are watching the performance of major coins like Ethereum (ETH) and their potential impact on the broader market. One coin that is in the spotlight is Shiba Inu (SHIB). With Ethereum’s price on the rise, the question on everyone’s mind is: how high can Shiba Inu go when Ethereum hits $20,000?\n\nShiba Inu’s Current Market Performance\n\nIn recent days, SHIB has gained momentum, reaching a low of $0.00002369 and a high of $0.00002577 in the past 24 hours. Currently, SHIB is trading with an 8% surge in its overall performance during this period.\n\nAlso read: Can Solana (SOL) Breach $260 And Hit New ATH in June?\n\nHowever, the meme coin has been down by 10.3% in the last seven days. Despite this temporary setback, SHIB enthusiasts remain confident in the coin’s prospects in the current bull market.\n\nShiba Inu’s Potential Value with Ethereum at $20,000\n\nAt press time, Ethereum is trading at $3,813, reflecting 30-day gains exceeding 20.3%. For ETH to reach the $20,000 threshold, it would need to increase by 427%.\n\nIf Shiba Inu were to mirror Ethereum’s growth and achieve a 427% increase from its current price, its value could skyrocket to $0.0001282. This price level would be a new all-time high for Shiba Inu, breaching its previous ATH of $0.00008845.\n\nAlso read: Ripple: How Many XRP You Need To Make $5 Million If Price Hits $2?\n\nThe Correlation Between Ethereum and SHIB\n\nAccording to IntoTheBlock stats, SHIB has a 69% correlation with the price of ETH, indicating that there is a 69% chance that SHIB will follow ETH if it rises to $20,000.\n\nThis strong correlation suggests that Shiba Inu’s price is heavily influenced by the performance of Ethereum, and a significant surge in ETH’s value could have a profound impact on SHIB’s price trajectory.\n\nAlso read: Shiba Inu Poised to Hit $0.0001 in June, Says Leading Analyst"
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxOSUhZcU5iX21vLWpuWENjNHIzZUZLMTJSdUVwWTBwT1NfeThzTF9rS2VFWFpzWG5aQVNndnpKVXFyckhmM1RNblhPM1BuTmFGY21xSDhGSFlJY0x3MmVWM2lZeUJBT0x3ZEc1aGpOT1BDR04xeUFiZlB3Zk1ETlVBRHVnejJDRzRvZ3VsQXRVbXFnNmtWQ3RqRUtjYl91dHFpQ3dDVUZma3PSAa4BQVVfeXFMT0lVSFpUd2lXNDU1dVpWMjJPb3A1dVk2MkQzYjZ0blgzbmM1Sm1rZk90VG51QV9rN1BnMVlMVklnM3NVbm9VNWRDWDJuNUFjaWlWMTBFZkg4b09oc25rX2wxd1k4NzVhSDU5a1h6LVVnakxjWW0zVjJxNVE2c0tMVVdWYkhvX0xySXMxV0QwVVA1UFphVUl5WXk1MW93ck9DMFhLN2VSOW9oU3JMT2ZB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Jun 2024 07:00:00 GMT",
        "title": "ETH/BTC Price Prediction: Will Ethereum Price Hit $10,000 On BlackRock ETH ETF? - CoinGape",
        "content": "Ethereum price has been in consolidation for the past few weeks as the market prepares for an S-1 application approval. Ethereum price is currently trading at $3,787, a 0.6% increase in the past 24 hours. On the other hand, Bitcoin broke above $70,000 once more after more than a month of trending below this crucial level and continues its journey to try and break an all-time high.\n\nETH/BTC Price Analysis: Ethereum Price Succumbs to Bitcoin Rally, Can ETH Bounce Back?\n\nadvertisement\n\nETH price against Bitcoin witnessed some downward pressure as Bitcoin bulls pushed its price above $70,000 for the first time in the last 30 days. The majority of cryptocurrencies shed some value against BTC, and Ethereum was not left out.\n\nThe price of Ethereum broke downward from the consolidation zone and is headed toward the 50% Fibonacci retracement level around 0.052 BTC. Based on the Ethereum price prediction, this retracement level may act as a zone of support a bounce back higher toward the 27% Fibonacci extension level around 0.06 BTC.\n\nOn the way up, ETH price may encounter resistance around 0.057 BTC, and $0.058 BTC. Conversely, the support structure around 0.052 BTC may prevent the price of ETH from falling lower.\n\nOn the other hand, Bitcoin price just broke out of a descending triangle in a classic textbook breakout and retest pattern. BTC price may move higher, with a profit target for this kind of setup anywhere around $74,000. This would establish a new all-time high price for the king of cryptocurrencies.\n\nBitcoin price may find some overhead resistance around $72,200 and $74,000, but on the flip side, a key support level around $67,000 may help keep the price up.\n\nETH/BTC Price Future Outlook\n\nAs the Ethereum community awaits S-1 application approval, the Bitcoin community continues to spearhead mass adoption for the number one crypto. El Salvador, the ‘Bitcoin State’ now owns 5,660 BTC worth over $402 million, and is still accumulating.\n\nMoreover, the University of Austin, a private Texas institution, will now accept Bitcoin for tuition and create a long-term Bitcoin fund.\n\nMeanwhile, liquid staking and restaking on Ethereum is only gearing up, and much more liquidity is about to hit the ecosystem, a phenomenon that could pump the price of Ethereum even higher. When including liquid staking, Ethereum mainnet TVL came within 2% of its ATH recently\n\nBottom Line\n\nThe crypto community is optimistic about an S-1 Form approval because BlackRock submitted it. The firm has a clean history of only wins when it comes to ETF applications and the Ethereum community is banking on this to pump ETH price to $10,000.\n\nRelated Articles\n\nEvans Karanja Evans Karanja is a crypto analyst and journalist with a deep focus on blockchain technology, cryptocurrency, and the video gaming industry. His extensive experience includes collaborating with various startups to deliver insightful and high-quality analyses that resonate with their target audiences. As an avid crypto trader and investor, Evans is passionate about the transformative potential of blockchain across diverse sectors. Outside of his professional pursuits, he enjoys playing video games and exploring scenic waterfalls.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxOVF81QVJncVMwbnNhTXExal9RbDFnYS1tcVAwd0ZzcDVVREpvRzlRdkpHQnN1UW9mYjluNGs5cFFMMmpmTFpzbkM1a05hcmhteVliVlJQNHNLLVpiRFlnNGhadG1pTWlvaHdWVW02d2UtV18ySjQwM053RF9WVmIwaXl5Ty1SOC1EdEljbHNKMG5vdnZYaS1Yc3J3b9IBoAFBVV95cUxQR19kUGlvX1FDVURlNEoxQ2gtbXJQRXgzUzI1RHpPZHF1Rlp1V3Iya216b2tnN2RoTHlUb0R0Ny0wdGZ0cXJwV1hmUjIwQndZcFo2QjhzRVptNFhWMkppdXV4XzRZVlZ3VTdIQlZxNU1PU05jZnZ0VWVycXMxRG90U2FtZmxmMGhGR3BIRXB0cTFjSWpZaGcyeC1vdnhpMW95?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 04 Jun 2024 07:00:00 GMT",
        "title": "Crypto Prediction: Ethereum Price Risks Losing $3,500 Support, End Of The Road For Bulls? - CoinGape",
        "content": "Over the past two weeks, the crypto market has been wavering in uncertainty showcasing no clear commitment to a particular direction. The leading digital assets Bitcoin and Ethereum price represent this indecisive nature with several short-bodied candles in the daily chart.\n\nHowever, in the recent analysis shared by Ki Young Ju, CEO of CryptoQuant, the Bitcoin Thermo Cap Ratio was highlighted as an insightful metric for understanding Bitcoin’s valuation relative to its network fundamentals.\n\nadvertisement\n\n#Bitcoin is not currently overvalued based on network fundamentals. pic.twitter.com/fFLQF34VQv — Ki Young Ju (@ki_young_ju) June 3, 2024\n\nThe Thermo Cap Ratio rarely highlighted in mainstream analysis, measures miners’ cumulative security spend (or thermo cap) against the market cap. According to Ki Young Ju, Bitcoin is “not currently overvalued based on network fundamentals despite recent price increases.”\n\nTherefore, the market appears to be regaining its bullish momentum through ongoing consolidation and could continue the existing rally shortly.\n\nAlso Read: Top Reasons ETH Price Could Reach a New All-Time High Soon\n\n1) Ethereum Price Treading Dangerously\n\nEthereum stands out as a decentralized platform that not only supports cryptocurrencies like Ether but also enables the creation and execution of smart contracts and decentralized applications (dApps).\n\nEthereum price traded at $3762 on Tuesday, with the market cap holding at $452.1 billion. Amid the current market uncertainty, the leading altcoin has stabilized above $3700 support.\n\nThe daily chart projecting several lower-price rejection candles at this $3700 indicates the buyers are actively defending the support. A potential rebound from this support will push the ETH price by 8.5% to challenge the $4,090 peak and resistance. Note that a breakout from this barrier is crucial for buyers to resume the prevailing uptrend.\n\nHowever, if the current consolidation is prolonged it would indicate weakness in buyers’ conviction, suggesting a potential breakdown from $3500 support.\n\nAlso Read: Ethereum Price Analysis: Can Bulls Push Price to $5,000 on the RWA Narrative?\n\n2) Cardano (ADA)\n\nCardano (ADA) is a third-generation blockchain platform known for its research-driven approach and commitment to security and sustainability. It distinguishes itself through a layered architecture that separates the settlement and computational layers, enabling more flexible updates and maintenance.\n\nThe Cardano price has been trading sideways for nearly two months, resonating within two converging trendlines of the symmetrical triangle pattern. The altcoin rebounded twice from the upper boundary and thrice from the lower indicating the trades are following the lead of this pattern formation.\n\nCurrently, the ADA price trades at $0.455, seeking support at the lower trendline. The Cardano coin currently holds a market cap of $16.27 Billion and maintains its position as the 10th largest cryptocurrency.\n\nUnder favorable market conditions, the coin buyers are likely to breach the overhead trendline signaling the end of the consolidation trendline. The post-breakout rally could lead the ADA price to $0.62, followed by $0.68.\n\nAlso Read: Cardano (ADA) Breaks May Bearish Streak, But Major Twist Lies Ahead\n\n3) PEPE Coin (PEPE)\n\nPEPE Coin is a meme-themed cryptocurrency inspired by the popular internet meme, Pepe the Frog. This project stands out for its community-driven approach and its focus on the playful, irreverent culture that characterizes many meme-based digital assets.\n\nAn ascending trendline in the daily chart carries the current recovery trendline in PEPE price. The coin buyers witnessing suitable pullback support have managed to uplift the asset from the April low of $0.00000393 to the $0.00001725 high registering a 339% gain.\n\nHowever, the PEPE price reverted 17% to $0.00001434 with the market correction, while the market cap plunged to $6.035 Billion.\n\nThe coin price heading close to the aforementioned trendline could again bolster buyers with demand pressure. A potential rebound from the support will challenge $0.00001725 and aim for a higher target at $0.00002, followed by $0.000024.\n\nAlso Read: Pepe Coin Price Prediction As Bullish Sentiment Bursts, Rally To $0.00002 Incoming?\n\nTakeaway\n\nThe current market consolidation evidenced by Bitcoin price prediction and the Ethereum price sideways action has stalled the recovery momentum for most major altcoins. However, with on-chain indicators like the Thermo Cap Ratio, the broader trend remains bullish and currently stabilizes for future moves. Thus, the ongoing consolidation could bolster buyers to replenish recovery momentum and provide new entry opportunities for investors.\n\nRelated Articles\n\nSahil Mahadik Sahil is a dedicated full-time trader with over three years of experience in the financial markets. Armed with a strong grasp of technical analysis, he keeps a vigilant eye on the daily price movements of top assets and indices. Drawn by his fascination with financial instruments, Sahil enthusiastically embraced the emerging realm of cryptocurrency, where he continues to explore opportunities driven by his passion for trading\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxQYWVaMWV3aHgwc1NtSXJFbHpialo4RHlVcFZQOUNYUGlfQ2pkXzN1RTdmbzlGTkhnM0JUbkNwTkZnM3NwUHF3amhSNmo0RjNtRGhiaHpxZmJlenFoQ2VnMEdic2VfQTdkdUw2eGN4YXFPZHZUYlh4VWozdU9EWGJzN19saUJiTXYxQ2twVEVIN3R0SWVQQ3VYSkY3Skg4T0dCazFHY3NKSlFnUHU5bWlEVXFWTGkzMk1z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 04 Jun 2024 07:00:00 GMT",
        "title": "Voici le récap des infos les plus marquantes de la semaine écoulée autour du Bitcoin, Binance, Ethereum et Ripple - Cointribune EN",
        "content": "Tue 04 Jun 2024 ▪ 4 min read ▪ by Luc Jose A.\n\nBetween revolutionary announcements, technological advancements, and regulatory turmoil, the crypto ecosystem continues to prove that it is both a land of unlimited innovations and a field of regulatory and economic battles. Here is a summary of the most notable news of the past week around Bitcoin, Ethereum, Binance, and Solana, etc.\n\nBitcoin Hashrate Reaches All-Time High\n\nBitcoin’s hashrate has reached an all-time high, demonstrating the miners’ resilience and confidence in crypto despite post-Halving concerns. The total computing power deployed surpassed its previous records, supported by technological advancements and a recent increase in BTC price. These factors have compensated for the block reward reduction, strengthening the mining ecosystem. This performance underscores Bitcoin’s robustness and reassures investors about its long-term fundamentals.\n\nBlackRock Invests $10 Million in Ethereum for Its New ETF\n\nBlackRock, the asset management giant, is preparing to launch an Ethereum ETF, following the success of its Bitcoin ETF. The company invested $10 million to purchase Ether to create a fund with an initial net asset value of $10 million. The ETF, which will be traded under the ticker ETHA, will have the Bank of New York Mellon as the custodian and Coinbase as the holder of the underlying Ether. The ETF’s launch is expected by the end of June, according to Bloomberg analyst Eric Balchunas.\n\nXRP ETF: Imminent Approval, According to Ripple\n\nBrad Garlinghouse, CEO of Ripple, announced at the Consensus 2024 conference that the approval of an XRP ETF is inevitable, despite current regulatory challenges. This prediction follows that of Standard Chartered, which anticipates an XRP ETF launch by 2025. Although the crypto is currently down, trading below $0.549, optimism around the ETF could be a game changer. Regulatory clarity remains crucial, and a favorable decision for Ripple in its legal battle against the SEC could accelerate institutional adoption of XRP.\n\nChangpeng Zhao of Binance Incarcerated for 4 Months\n\nThe founder of the crypto exchange Binance, Changpeng Zhao, has been incarcerated for four months in a low-security federal prison in Lompoc, California, after admitting his responsibility in money laundering operations via his platform. This sentence, shorter than the three years required by prosecutors, marks a decisive turning point for the crypto sector. Zhao expressed his regrets and acknowledged the importance of regulatory compliance. The future of Binance, under new leadership, is full of uncertainties.\n\nBitcoin: Institutional Frenzied Accumulation Resumes\n\nLarge institutional investors reiterate their strategy of Bitcoin accumulation, reminiscent of the pre-bull rally period of 2020. Ki Young Ju, CEO of CryptoQuant, reported a strong activity similar to what was observed before the price surge in late 2020, with daily transactions exceeding a billion dollars. Although volatility is moderate, this accumulation could signal a new bullish cycle. Analysts are divided on the immediate consequences, but many anticipate that Bitcoin could break through the $69,000 resistance, paving the way for new highs.\n\nThat’s the main takeaway for this week. However, if you want a more detailed recap and in-depth analysis delivered directly to your inbox, feel free to subscribe to our weekly newsletter.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxQdUtsdnRHdVFldTJKYmM3MmdHYVU2elJJRGFCcmlLUjVrSjd4R191eDJ0UERlZlZFTjdwLW04TE1ITjlDcW1UcU1qVTZzdktWZ2I4a0g4SWJiaFJUTUdDY0VZRS1EaVc0X3FQdzA4eVVCZ0tyNkExT2FVcVEzX1B5NjBDaER4Rm9D0gGOAUFVX3lxTE5LNU9HSUVoa3VYNFdjWlNDYVdWSVEzWkNNYU41eEVuSDFNY1lhdU5YeGNZcmNHUWN0S0ZmVWxVeklQd2pLRE9IdFB4MzM4WGREOUZ6VEZQM2lhLUVOWEx6MGdtcmJJWUwxVWNta2lhTjBNSlRJWC1laUd6U0xPWGc3ZFBtV0hFWmhTbEJYQnc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 04 Jun 2024 07:00:00 GMT",
        "title": "Ethereum weekly inflows hit $34 million – Are ETFs the reason? - AMBCrypto News",
        "content": "Year-to-date inflows into crypto products have surpassed $15 billion.\n\nEthereum recorded its second week of inflows.\n\nDigital asset investment products recorded inflows totaling $185 million last week, marking the fourth consecutive week of inflows, digital asset investment firm CoinShares found in its new report.\n\nAlthough this marked an 82% decline from the $1.05 billion recorded in inflows the previous week, it still pushed May’s inflows to $2 billion. Also, it brought the year-to-date (YTD) inflows into cryptocurrency funds above the $15 billion mark.\n\nAccording to the digital asset investment firm, trading volumes declined during the week under review. They totaled $8 billion, a 38% drop from the $13 billion registered the previous week.\n\nAt the end of the week, as observed by CoinShares, the total assets under management (AUM) for crypto-based investment products were above $97 billion. This was a 1.3% decline from the $98.43 billion recorded the previous week.\n\nRegionally, most of last week’s flows into crypto funds came from the U.S. According to CoinShares:\n\n“The majority of inflows were from the US, seeing a net US$130m, although incumbent ETF issuer outflows rose to US$260m. Switzerland saw its second largest week on inflows this year at US$36m, while Canada saw a turnaround with inflows of US$25m despite seeing a net outflow in May totaling US$39m.”\n\nLuck smiles on Ethereum\n\nSince the U.S Securities and Exchange Commission (SEC) approved the first set of applications for spot Ethereum [ETH] exchange-traded funds (ETFs) from Grayscale, Bitwise, iShares, VanEck, Ark Invest, Invesco, Fidelity, and Franklin Templeton on 22nd May, ETH-based products have recorded significant inflows.\n\nThe week under review was the same. According to CoinShares’ report, Ethereum-backed products recorded their second week of inflows, which amounted to $34 million.\n\nThis represented 18% of all inflows recorded during that period. Also, last week’s liquidity flows into Ethereum pushed the altcoin’s YTD inflows to $11 million.\n\nIs your portfolio green? Check the Ethereum Profit Calculator\n\nCoinShares said:\n\n“This represents a turnaround in investor sentiment in an asset that had seen a 10-week run of outflows prior, totaling US$200m.”\n\nCoinShares found that last week’s inflows in Ethereum impacted Solana [SOL] due to the statistically positive correlation between them."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxQN2Rlc05aVmpkeXg5YlNIa2xPSmt3SDFybTF4dng1azlaSWhWSHhwcW9JZDBDLVlzQ1diMjZqLWpSZUFDcjk0N1Nyam91aE1XTDdZVmtaNnZjOTBTbl8zOE9sSzQ5VC1fUEF1d0FOdWtrb1BaVWRZcWJ3ZDg1UUtiNTdrZVhuZ0d3bkVHVGxoYXJsd0F3UUF0VW8tdUp6c1lESlN3YjMyM2lTQ2hYd2wzVThtcWZkVFZaUHNr?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 04 Jun 2024 07:00:00 GMT",
        "title": "Ethereum In A Bull Flag: Massive ETH Withdrawals Ahead Of Super Cycle To $4,900? - FX Leaders",
        "content": "⚡ Trade Forex With High Leverage And No Limitations! – Open an Account Here\n\neth-usd\n\nEthereum is a mixed bag when writing. Even so, the uptrend remains for now. While bulls might be loading up, buying on every correction, traders should be wary of what happens at the $3,700 level. This line is an immediate support zone that bulls must reject for uptrend continuation. Considering the formation in the daily chart, the path of least resistance is upwards, but buyers must convincingly close above $4,000. If not, ETH prices might consolidate horizontally in continuation of last week’s formation.\n\nThe general inactivity in price action means bulls seem to be slowing down. For now, Ethereum is stable in the past 24 hours but down 3% in the past week. Since prices are quite literally stuck, engagement is also low. At the time of writing, the average trading volume in the last 24 hours is around $14 billion, which is way lower than expected.\n\nNonetheless, traders are closely monitoring fundamental events. The following Ethereum developments are noteworthy:\n\nFollowing a hack, Linea, an Ethereum layer-2 platform , chose to shut down the sequencer to prevent more losses. Critics are now raining down on its developers, claiming it is not a blockchain but a centralized scaling solution.\n\nAnalysts think ETH bulls are preparing for a super-cycle in the coming weeks. As the United States SEC prepares to approve spot ETFs , over 800,000 ETH have been withdrawn from top exchanges.\n\nEthereum Price Analysis\n\nETH/USD prices are consolidating inside a wedge, printing a bull flag.\n\nStill, even with the lower lows, the uptrend remains.\n\nOptimistic bulls can look for entries to buy on dips above $3,700.\n\nHowever, as mentioned earlier, the accumulation might provide a spring for a decisive breakout above $4,000.\n\nThis development will align with the May 20 bull bar that continues to shape the current price action.\n\nA close in either direction ($3,700 or $4,100) is crucial for trend definition.\n\nIf bulls succeed, Ethereum would quickly explode to as high as $4,900."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxOMk84amE1SlpmVzljRTNwQV9mTkp0OG5nNnBtZ0h2RXl6cXZHMncwUmlNU0I0MEF0Zk42MXJPelBjR21tTEx2TzMwZ1VVT2E2eWZYMU81RUdxSV9fNVdMeDhXT0JfX1FITm1MMTFaUXgwNnRXOHNxdjhDSFh0aHJ4TWprZE5saENQc0hEMmQwUTRWWXd6dWdLUFl3QVFKRjkzU1pRMzc0aHhBNG5iNXZQTzRabjhnNVhU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 04 Jun 2024 07:00:00 GMT",
        "title": "ETH vs ADA vs RBLK: Is Ethereum, Cardano or Rollblock The Best Investment for 2024? - Techpoint Africa",
        "content": "The introduction of Ethereum ETFs sent waves throughout the cryptocurrency market. Several projects saw significant gains, with Ethereum rallying over 20% in just one week. But how does Ethereum compare to Cardano and Rollblock? Being significantly more affordable projects, Cardano and Rollblock could make better investments. Experts believe that both projects will rally throughout the upcoming bull run, and in the process, they could offer higher returns.\n\nEthereum Soars 28% Following ETF Update\n\nThe SEC recently approved eight Ethereum ETF applications. This is a huge milestone for the cryptocurrency market and sent Ethereum’s daily trading volume soaring to over $47 billion.\n\nEthereum’s price has also rallied since this update. Over the past week Ethereum’s price increased by 28.7%, and ETH is now trading at $3,816. This bullish momentum temporarily made Ethereum the second most traded cryptocurrency and has resulted in bullish predictions.\n\nAccording to Daniel Bernstein, Ethereum could hit a new all-time high of $6,000 by the end of Q2, and as a result investors are keeping a sharp eye on ETH developments.\n\nCardano Founder Critiques Bitcoin\n\nIn a recent interview Charles Hoskinson called into question Bitcoin’s future. He argued that Bitcoin is now reliant on the broader DeFi ecosystem, stating that it could be replaced by an asset with greater security and functionality.\n\nHoskinson believes that Cardano’s native currency, ADA, is a better alternative. He states that recent Cardano developments make it an ideal candidate, further stating that Cardano is energy efficient and fully decentralized.\n\nThat said, Cardano’s price has increased by just 1.16% over the last month. As a result, many investors believe that Cardano has lost its appeal and are instead choosing other altcoins to boost their portfolios.\n\nStage 2 Of The Rollblock Presale Sells Out\n\nAfter a massive surge in new investors, stage two of the Rollblock presale has quickly sold out. Rollblock’s returns have now hit 40%, and experts believe this is just the start of the project's growth.\n\nRollblock is a market disruptor. It looks to replace current systems in the casino market using blockchain technology. The use of GambleFi technology will solve issues with security and transparency, offering a greater gambling experience.\n\nRollblock’s platform is already live, licensed, and lets investors play over 150 different game modes. These include casino classics, live poker, digital games, and more, all of which are compatible with over 20 cryptocurrencies. Furthermore, Rollblock plans to add sports betting, further enhancing its appeal.\n\nOne feature that’s caught the attention of crypto analysts is Rollblock’s revenue-sharing model. Rollblock will share up to 30% of its daily revenue with investors who hold and stake $RBLK tokens. To share its revenue, Rollblock will buy $RBLK tokens from the open market. Half of the tokens it buys will be burned, and the remaining half will be used for weekly rewards.\n\nAt the start of its presale, experts predicted that Rollblock would increase by over 720%. Having already increased by 40% in less than a month, Rollblock is on track to surpass this goal, making it a great opportunity for early adopters.\n\nRollblock Presale Soars Amid Bullish Price Predictions\n\nInvestors can buy $RBLK for just $0.014 to participate in the Rollblock presale. Given its potential, Rollblock could outperform Ethereum and Cardano in 2024, and as a result, $RBLK is selling out at its fastest rate since its presale started.\n\nDiscover the Exciting Opportunities of the Rollblock (RBLK) Presale Today!\n\nWebsite: https://presale.rollblock.io/\n\n\n\nSocials: https://linktr.ee/rollblockcasino"
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxOTFN2TFpMcXVBUW96VmNXdjVtRjk5YjFDWmF1b1AzblQxVW9IRlFnUjJLNjJ4UkIwN0E5VmxhVldsS19IM0ZrYWJkbmhqZjVUeGd4b3F6RHFFbGRxZWdxWTI3RjFDTHZSMzl6TDMzamYtYWlCSnByYU5wUEs0T1NSYkgyQWJFNjZXaVBoOUJQVEHSAZ4BQVVfeXFMUFZySUx2Z0ZvM3lpblNpeDVVekxHWXZvQWhudGNySVo5Qlo1NW9TSlJoaXNpNnRDVU1MQUxaQlBKS2hBS0daaTBRX09hQ3Ffb0M3VkdaUDd1M2NwSHFaNUFRaDRoRDRNQjQ3aWtOdWdkLTN5MDNFVlk3MVRLWkpwUVZLNXdPMEo3cldLSWVMN3h5cHREWE84SlRQaFl0cXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis on June 05, 2024 - Analytics Insight",
        "content": "Decline and Recovery: Ethereum price declined below the US$3,760 support zone. However, it found strong buying interest around US$3,720, forming a low at US$3,728.\n\nAttempted Rally: Following the low, ETH attempted to rally, moving past the US$3,800 level but encountering resistance just shy of US$3,840. A high was formed at US$3,836, after which the price entered a consolidation phase.\n\nConsolidation Phase: Currently, ETH is consolidating within a range, trading below the 23.6% Fibonacci retracement level of the recent upward move from US$3,728 to US$3,836."
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTFAzUTFLT1Nmdk1SSkpZVVU0MjRXZHM1cHY0U0lKNGFiZ0NkUmR2cHFQdE9pV18wbzFqSVJ4SmFtdVdnQXlRQnU1SkFIR2E0SUs0NVY1a01aQ3lwSjZadTlyZ0NPVVN5S3FXeHlrZUhiSVRRWko2RmhGSXpB0gF_QVVfeXFMUG5UT2NfZTQ4M3dKU2g3Vnc3VXhid1lDckx6M203LVNaTm45R3Y4ZHRoYV8ydTBQQTY0VnhNc01naTdTNHhPa2sxeEJkSHA5OXJ5SUpMaWtPTEViY0Y4Q2pOYkNiUENmQlFOX09nQkFVM05Ob0ZaMEtpZGJxVFp1aw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 04 Jun 2024 07:00:00 GMT",
        "title": "Solana beats Ethereum: Time to ditch ETH for SOL? - AMBCrypto News",
        "content": "Solana and Ethereum saw varying volumes of daily active addresses.\n\nThe ETH TVL has remained ahead of SOL’s by considerable volume.\n\nAccording to a recent report, Solana [SOL] had more activity than Ethereum [ETH] in the past 24 hours. Additionally, this increase in activity led to Solana experiencing higher trading volume than Ethereum.\n\nData showed that Solana had a busy 24 hours, with impressive numbers in some key metrics. Solana had more active addresses than Ethereum and Bitcoin combined, the two largest networks.\n\nA deeper analysis of both platforms revealed a significant divergence in their active addresses over the past few days.\n\nComparing Solana and Ethereum\n\nAn analysis of Solana’s active addresses on its scanner revealed an interesting trend. The chart showed that in the past few weeks, the network’s lowest number of active addresses remained above 800,000.\n\nThe chart indicated that the number of active addresses had surpassed 1 million at the time of this writing. This suggests that the network has been experiencing increased activity recently.\n\nHowever, the analysis of Ethereum’s active addresses showed a decline over the past few weeks. The chart revealed that the number of active addresses remained below 500,000 throughout the previous month.\n\nIt gradually decreased to the 400,000 range and has not risen above this level in recent days. According to data from Santiment, the number of active addresses was approximately 141,000 at the time of this writing.\n\nSolana trumps Ethereum volume\n\nAnalysis of the volume trends of both networks on DefiLlama showed that Ethereum has had higher volumes than Solana in the past few weeks. However, at one point, Solana’s volume surged past Ethereum’s.\n\nAs of this writing, Solana’s network volume was around $1.1 billion, while Ethereum’s was around $1.5 billion. This indicates that ETH’s volume has declined while SOL’s network volume has maintained momentum.\n\nAdditionally, it’s worth noting that ETH’s Total Value Locked (TVL) remains higher than SOL’s. According to DefiLlama, ETH’s TVL was over $65 billion, while SOL’s TVL was around $4.8 billion.\n\nETH and SOL see varying bull trends\n\nAMBCrypto’s analysis of Ethereum on a daily timeframe chart showed that it has remained in a bull trend. The Relative Strength Index (RSI) was above 60 at the time of this writing, indicating a strong trend.\n\nHowever, its price has not seen significant movement in the last few days. Previously, ETH experienced a daily decline of less than 1% for the past two days. As of this writing, it was trading at around $1,877, with an increase of less than 1%.\n\nRead Solana (SOL) Price Prediction 2024-25\n\nAnalysis of Solana’s RSI showed that it rested on the neutral line at the time of this writing. This indicates that while Solana is still in a bull trend, it is currently weak.\n\nAs of this writing, Solana was trading at around $165, with an increase of less than 1%. Like Ethereum, it has not seen significant movements in the last few days."
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxPMXRUTnc4clduZ25QYWtmMDZCdHJwWVEtNjFobFZkNmh1V2NnWWphdGM2X1pnVlR0UEYzcG84ZzFsVEtFTGFKaURLTmo4cHFaVEY1TG81aUo1SFJabDJvUjlKUTQtOVZEWGgwNXdiQkhBeURWdV9HUzJlM2RwNHhfVHlMYzJibXRMZmJSdXNaeWVzaWxk0gGaAUFVX3lxTE81c0dqc3RENXlzZzEtbmk5ZGxJLXRwZWlKeHJlXzUwWUhpblphTUhQbkVLSjh0cE5DTHR4ZkViVUpRU3JZWWZ6NC1Qd0hHcUlwTnBpTGg1eWhTQlZ4b2Z0azRTMzFuTFdkQ0w5aGJqQzM0Nm9WU3JGdjhzX3lXTjdMbTBTeHFrN3IyaVIzcE5wd0N0dmdPNjlJMnc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 04 Jun 2024 20:33:33 GMT",
        "title": "Ethereum (ETH) Set For ‘Glorious Year,’ Analyst Eyes $10,000 Target - NewsBTC",
        "content": "Ethereum (ETH) saw a significant upswing at the end of May due to the rumors of a spot ETH ETF (Exchange-Traded Funds) approval in the US. This bullish momentum propelled the token’s price from the $3,000 price range to the $3,900 mark.\n\nRelated Reading\n\nAfter the approval, the second-largest cryptocurrency has shown a strong performance, consolidating between the $3,700 and $3,800 levels. Some crypto analysts believe ETH is preparing for a crucial test and eye bullish targets above the $10,000 price range soon.\n\nETH’s “Glorious Year” Depends On This Level\n\nAccording to crypto analyst Jelle, a community sector is currently driven by a negative sentiment towards Ethereum. The bearish sentiment, seemingly fueled by Ethereum’s failure to regain the $4,000 resistance level, has made “lots of people overcomplicate things here.”\n\nAs a result, Jelle urged investors not to panic, arguing there’s no reason to “flip bearish.” The crypto analyst highlighted the key movements the King of Altcoins has seen in the past two weeks.\n\nDue to the spot ETH ETF approval, Ethereum broke out of a multi-moth falling wedge pattern. At the time, ETH successfully regained the $3,600 price range and briefly tested the $3,900 price range.\n\nAfter reclaiming this key support level, ETH has been consolidating above it, hovering between the $3,700 and $3,800 price range since May 28. According to the analyst, the cryptocurrency is “reclaiming the range lows of a 3-year-long reaccumulation range.”\n\nPer Jelle’s chart, ETH is regaining the lowest range of the previous bull run, which could lead to an expansion period. If the second-largest cryptocurrency by market capitalization holds above this key level, Ethereum “will have a glorious year.”\n\nAdditionally, the analyst considers that ETH’s last hurdle to overcome this cycle is the $4,000 resistance level. Once “it breaks $4,000, it’s clear skies ahead” to potentially reach the price target of $10,000.\n\nSimilarly, known crypto analyst Il Capo of Crypto noted that his main scenario is a bullish continuation. Per Il Capo, Ethereum is “looking good” above the $3,650 range. This performance seemingly sets the cryptocurrency for a “bullish continuation” towards the previous cycle’s all-time high (ATH).\n\nEthereum ETFs, The Catalyst For New ATH?\n\nDespite the doubts, Ethereum’s recent performance resembles Bitcoin’s (BTC) in previous cycles. According to crypto trader Ash, ETH is following the path of the flagship cryptocurrency in 2018-2021. If it continues this track, “$10,000+ ETH is programmed.”\n\nAs the crypto market awaits the listing of the spot ETF, some analysts consider it the catalyst for an “explosive” alt season this year.\n\nSimilarly, Ali Martinez noted that over 777,000 ETH, worth around $3 billion, have been withdrawn from exchanges since the US Securities and Exchange Commission (SEC) approved the investment products. Due to a supply squeeze, this development could propel ETH’s price to higher levels.\n\nHowever, Lookonchain recently revealed that two participants of Ethereum’s Initial Coin Offering (ICO) deposited around 4.5% of their holdings on a crypto exchange. Per the post, the ICO participants received 200,000 ETH, worth around $767 million, at Ethereum’s Genesis.\n\nRelated Reading\n\nThe Half-Million Dollar Bitcoin: Predictions Point To Monumental Price Surge In 18 Months 3 months ago\n\nThe holders deposited 9,518 ETH, or $36.33 million, into Kraken on Monday, which has alarmed investors. Despite the fear of a possible dump, some community members think this movement could suggest that these long-term holders believe ETH’s price will reach unprecedented highs soon.\n\nFeatured Image from Unsplash.com, Chart from TradingView.com"
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxORkVaNDhmZDg1azhidHUwRHBQN201UGdOSm9YMXNzSWpuSU9RUlZFM0oyekhJSWR1RzY3anlCTEdMOGhUVWNjb0szaGpPbjlTYjNIZDRhcFhTWkFILVZNUjlSRlJ4Z0RDdUtmZFYwM0k4YzFaWG12ZHN3Sm5teEpJdWRXVno?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 04 Jun 2024 07:00:00 GMT",
        "title": "ChatGPT Predicts Ethereum (ETH) Price For June 30, 2024 - Times Tabloid",
        "content": "The Ethereum (ETH) price has been a topic of constant debate and speculation in the cryptocurrency market. Currently trading at $3,750, Ethereum has seen a significant rise compared to the beginning of the year and as June draws to a close, many investors are left wondering where Ethereum’s price is heading.\n\nChatGPT’s Bullish Outlook\n\nOne interesting take comes from ChatGPT, a large language model known for its ability to process information and generate text faster. When prompted about Ethereum’s price on June 30th, 2024, ChatGPT offered a bullish prediction.\n\nWhile it’s important to remember that ChatGPT isn’t specifically designed for financial forecasting, its analysis suggests a potential increase to $4,500, representing a roughly 20% jump from the current price.\n\nWhat’s Driving Ethereum’s Rise?\n\nEthereum’s recent rise can be attributed to a confluence of factors. The Dencun upgrade rolled out in April, improved efficiency and lowered transaction costs, making the network more attractive.\n\nThis upgrade is a stepping stone for future scalability enhancements. Additionally, the thriving DeFi and NFT markets built on Ethereum, fuel demand for ETH as their popularity surges.\n\nNews and Developments Shaping Ethereum’s Future\n\nBeyond the immediate price predictions, other developments could shape Ethereum’s long-term trajectory. Here are a few key areas to watch:\n\nThe Rise of Layer-2 Solutions: Layer-2 scaling solutions like Polygon and Arbitrum are built on top of the Ethereum blockchain to handle transactions faster and cheaper. Continued growth and adoption of these solutions could alleviate congestion on the mainnet and contribute to overall network growth.\n\nInstitutional Adoption: While significant hurdles remain, 2024 has seen increased interest from institutional investors in the cryptocurrency space. If major financial institutions embrace Ethereum, it could provide a significant boost to its price and market cap.\n\nWe are on twitter, follow us to connect with us :- @TimesTabloid1 — TimesTabloid (@TimesTabloid1) July 15, 2023\n\nA Word of Caution\n\nThe cryptocurrency market is notoriously volatile, and past performance is not necessarily indicative of future results. While ChatGPT’s prediction and the current trends paint a promising picture for Ethereum, investors must conduct their research and understand the inherent risks involved before making investment decisions.\n\nWhether Ethereum reaches the $4,500 mark by June 30th as ChatGPT suggests remains to be seen. However, one thing is clear: Ethereum’s future holds immense potential. It will be fascinating to see how it unfolds in the coming months and years.\n\nFollow us on Twitter, Facebook, Telegram, and Google News"
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMiV0FVX3lxTE1Yd2tTN24ySUlrMGktRUJWa1Y3YlNlaVBtRC0xeWlicGRJS2dIWDRtM0ZZd0cyTGVVNXlfZkpyZDhUUjBRUVV4dlAxYjVmcVRoeFhyd0pxOA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 04 Jun 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Prognose 2024 bis 2030 – Knackt ETH die 10.000 €-Marke? - Blockchainwelt",
        "content": "Kryptowährungen\n\n0x 1eco 1Inch Network 8×8 Protocol Aave ABBC Coin Abyss AC Milan Fan Token Acala Token Achain Adshares Alchemy Pay Algorand Alien Worlds Alpine F1 Team Fan Token Amp Ankr Anyswap ApeCoin APENFT API3 Aragon Arcblock Ardor Ark Arweave AS Roma Fan Token ASD Astar Atletico Madrid Fan Token Audius Augur Aurora Avalanche Aventus AVINOC Axie Infinity Baby Doge Coin Balancer Bancor Network Token Band Protocol Basic Attention Token BICONOMY Bifrost Binance Coin Binance USD BinaryX Biswap Bitcoin Bitcoin BEP2 Bitcoin Cash Bitcoin Gold Bitcoin Standard Hashrate Token Bitcoin SV BitDAO Bitgert BitShares BitTorrent BitTorrent-New BNB Bonfida BORA Braintrust Cardano Cartesi Casper cDAI CEEK VR Celer Network Celo Celsius Centrifuge cETH Chain Chainbing Chainlink Chia Chiliz Chromia Civic Coin98 Coinbase Wrapped Staked Ethereum Compound Conflux Constellation ConstitutionDAO Convex Finance Cosmos COTI Counos X Cronos Crypterium Cryptex Finance Curve DAO Token Dai DAO Maker Dash Decentraland Decred DeFiChain Dent DerivaDAO DigiByte district0X Dogecoin Dogelon Mars Dusk Network dYdX Dypius eCash Echelon Prime Ellipsis Elrond Energy Web Token Enjin Coin EOS Ergo Ethereum Ethereum Classic Ethereum Name Service Euro Coin Everscale Exchange Union Fantom FC Barcelona Fan Token FC Porto Fan Token Fei USD Fetch.ai Filecoin Firo Flow Flux Frax Frax Share Freeway Token Fruits FTX Token FUN Token Function X Gala GateToken Gemini Dollar GensoKishi Metaverse Gnosis Goldfinch Protocol Golem Green Satoshi Token Harmony Hedera HedgeTrade Helium HEX Hive Holo Horizen Humanscape Huobi BTC Huobi Token HUSD Hxro ICON iExec RLC Immutable X Injective inSure DeFi Internet Computer Inverse Finance IOST IOTA IoTeX Jupiter JUST Juventus Fan Token Kadena Kava Keep Network Klaytn Kryll KuCoin Token Kusama Kyber Network Crystal v2 Lazio Fan Token League of Kingdoms Lido DAO Lido Staked Ether Link Liquidity USD Liquity Lisk Litecoin Livepeer LooksRare Loom Network Loopring Lukso MAGIC MaidSafeCoin Maker Manchester City Fan Token Maple MATH Mdex Media Network MediBloc Metacraft Metadium Metal MetisDAO Mina MobileCoin Monero Moonbeam Moonriver Muse MVL MX TOKEN mxc MyNeighborAlice Nano NEAR NEM NEO Nervos Network NEST Protocol Neutrino USD Nexo NuCypher Numeraire NXM Oasis Network Ocean Protocol OG Fan Token OKB Olympus OMG Network Ontology Ontology Gas Optimism Orbit Chain Orbs Orca Orchid Origin Protocol OriginTrail Osmosis Pancakeswap Paris Saint Germain Fan Token Pax Dollar Pax Gold Pepe Perpetual Protocol Persistence Pirate Chain PlatonCoin PlayDapp Polkadot Polygon Polymath Powerledger Project Galaxy Prom Propy Proton Pundi X (New) Qtum Quant Quantstamp Radicle Radio Caca Rai Reflex Inidex Rakon Rally Ravencoin Raydium Reef Ren Render Token Request Reserve Rights Revain Ripple Rocket Pool Safe SafeMoon Santos FC Fan Token Secret Seedify.fund SelfKey Serum Shapeshift FOX Token Shentu Shiba Inu SHPING Siacoin SKALE Network Smooth Love Potion Solana Spell Token ssv.network Stacks Stargate Finance STASIS EURO Status Steem Stella Stellar STEPN Storj Storm X Stratis Strike SUKU SuperFarm sUSD SushiSwap Sweatcoin SwftCoin SwissBorg SXP Symbol Synapse Synthetix Syscoin TE-FOOD Telcoin Tellor Terra Terra Classic TerraClassicUSD Tether Tether Gold Tezos The Graph The Sandbox Theta Theta Fuel THORChain Threshold Toncoin Tribe Tron TrueUSD Trust Wallet Token Ultra UMA Uniswap UNUS SED LEO Uquid Coin USD Coin USDD USDX Utrust Vai VeChain Velas Venus Venus USDC Verge Veritaseum Voyager Token Vulcan Forged VVS Finance Waves WAX WazirX WEMIX WINkLink Wirex Token WOO Network Wrapped Bitcoin Wrapped BNB Wrapped Centrifuge Wrapped Everscale Wrapped TRON Wrapped Velas XDC Network XYO yearn.finance Yield App Yield Guild Games yOUcash Zcash Zeon ZeroSwap Zilliqa ZKSpace"
    }
]