[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTFBnMnU2aDUxY2tvOXItd2NrdzBkQVBnZk5ZRG1Cd1JjMVdxRTNFeUdRaF9qNkpvQnA1US1SbUI2T0NKOGxVNkJtZjdsOGo4X2dSMnJXSDJnb3hYUTVTbi1VbmR1VG9taVBPdUVNLXpkTQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jun 2024 07:00:00 GMT",
        "title": "Celestia's Blobstream goes live on Ethereum mainnet - Crypto Briefing",
        "content": "Currently available on testnet, Blobstream is expected to be deployed on L2s following audits and Celestia's upcoming launch.\n\nShare this article\n\nModular blockchain network Celestia has launched its data availability solution, Blobstream, on the Ethereum mainnet, according to the team’s announcement on Monday.\n\nBlobstream 🎇 is now live on Ethereum mainnet. Deploy a high-throughput L2 as *permissionlessly* as a smart contract. pic.twitter.com/74wyw5Xknq — Celestia (@CelestiaOrg) June 10, 2024\n\nDeveloped by Succinct Labs, Blobstream enables Celestia’s data roots to be streamed to an Ethereum light client on-chain. The solution offers high-throughput data availability (DA) for Ethereum layer 2 solutions (L2s), secured by cryptoeconomic guarantees.\n\n“This provides permissionless, high-throughput DA to Ethereum L2s, secured by cryptoeconomic guarantees rather than reputation or hidden trust assumptions,” stated Celestia.\n\nPreviously, Ethereum developers faced throughput limitations, prompting them to move to alternative layer 1 networks or rely on centralized services for DA.\n\nBlobstream allows developers to continue their work within the Ethereum ecosystem. Builders can create customizable, high-throughput blockspace without the need for permissions or committees while ensuring security through cryptographic economic guarantees.\n\nApart from the launch, the Celestia team announced that Blobstream on the Ethereum mainnet is now accessible on Celestia’s blockchain explorer Celenium.\n\nAccording to Celestia’s blog announcement, Succinct Labs has introduced Blobstream X, a zero-knowledge (ZK) implementation that streamlines the verification of Celestia validator signatures on-chain with a single ZK proof. This reduces validator overhead, simplifies the Celestia protocol, and accelerates the streaming of data root commitments for Ethereum L2s.\n\nAs noted, both Blobstream and its ZK implementation are currently available on testnet. Following code audits and Celestia’s upcoming launch, the community will be able to deploy Blobstream on Ethereum Mainnet and L2s to enhance streaming DA.\n\nPrior to this deployment, Celestia had already brought Blobstream to Arbitrum Orbit, Starknet, and Base, marking a continuous commitment to improving the Ethereum ecosystem’s infrastructure."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxNUTZCMTA3eGNCWGZCT0MxbldsLXZFVHFWeTlDcGNKcGxrRnhBajZNZTFfMXMyU05BZW83SUl6cTlFY0UybmRhbWt5Tl80TDdSX3VXZ1JHZ2l2RHBYaGpPS19YV2ZyUGVZLWNkN1ZSQUtqMmJfRngyX1lFaTlkVHIyQjB3NlNoVWhqbnZYMEIxdHZ3YTViYk1UaXF1MkpVYWw5bDh1Y2VMZ0hwMmZIWTFQQmc1bTI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Whales Activity Surges: Will ETH Break $4,000 or Drop Below $3,650? Analyst Insight - TronWeekly",
        "content": "Renowned crypto analyst Ali Martinez has brought attention to a notable trend in the Ethereum market. Over the past three weeks, the number of Ethereum addresses holding 10,000 or more ETH has surged by 3%. This increase indicates a significant spike in buying pressure among large-scale investors, often referred to as “whales.”\n\nThis uptick in large holders could signal a positive outlook for Ethereum, as increased accumulation by whales often precedes significant price movements. Investors and analysts alike are closely monitoring these developments, anticipating potential impacts on the broader crypto market.\n\nAs of the latest data, Ethereum’s price stands at $3,698.25, with a 24-hour trading volume of $12.20 billion and a market capitalization of $444.30 billion. Despite this bullish activity among major holders, the ETH price has slightly dropped 0.28% in the past 24 hours.\n\nWill Ethereum Break $4,000 or Drop Below $3,650?\n\nIn a recent analysis, prominent crypto analyst Crypto Patel outlined potential scenarios for Ethereum (ETH) price movements. Patel’s insights delve into both bullish and bearish outcomes, providing a detailed forecast based on current trading patterns.\n\nEthereum (ETH) is currently trading within a bull flag or parallel channel pattern against the USDT. This setup typically indicates a period of consolidation before a potential breakout. Traders and investors are keenly observing these patterns to determine their next moves.\n\nAccording to Patel, a bearish scenario could unfold if ETH breaks below the crucial support level of $3,650. Should this happen, Ethereum might experience a significant drop towards $3,152. This level is noteworthy as it represents the last Fair Value Gap (FVG), a region where prices previously moved quickly, leaving little traded volume behind.\n\nOn the other hand, if Ethereum manages to stay above the level of $3,152 support, then it turns into a bullish one. As Patel predicts, following this, ETH can rally up to $4,000 in the meantime. Go past that resistance, and a hugely bullish wave could knock Ether to $6,000-$7,000.\n\nCrypto Patel’s analysis reiterates the importance of vigilance on important support and resistance levels in this existing trading scenario. Traders must remain alert and change their strategies according to these potential breakout points.\n\nRelated Reading | DOGE Enters Key Wyckoff Phase: Major Spike Predicted Amid Market Volatility"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxOdXBVMUFlVjRRSmdMRFJDdkxjQmRRcEIycmlteEJHcndma2x6c3lfUzJ4Y285OUR1cEJXbUl2cHd3WmQ1ODBWMXhvRVA1MGF2Q3ZUMGRtSkZkY2ExWGF2TkRiLTFJZUVrZDRkNXJ0cUEteFdNT3RyU2FheC1DbVlZQTFuWjVCM19MTEVDejZxRl9nY01qWk4xRS1XSWkwU0xiTjd2MnF3QS01dDZiczU0eEx4NEJIaknSAbwBQVVfeXFMT3FWLW9MdmJPR0F2VkU5bmlsbGNJRkt5dlpMUmhZWjhVdHpzNC1WSUZpbXJ5RjhtQl9aU2JtSUJFUG1BS3kwS08yQ19vWF8taDhtZmk2Vmo4RU9ZUGhwYXVxN3NOaGV1T01JQmlZSVJod2F5RWRKcWpURWtNM1lUOHJ1WGRFVG5SSlBHcDZnMEFnamVObnpJMEg0WXhLQTdMbjRGSDc0QkZUNDFJS3VtbFBJTUdFaWdKQWV6V0g?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jun 2024 07:00:00 GMT",
        "title": "Biggest Bank in the World Says Ethereum Is ‘Digital Oil,’ Bitcoin ‘Digital Gold’: Report - The Daily Hodl",
        "content": "The world’s biggest bank, the Industrial and Commercial Bank of China (ICBC), is reportedly calling Bitcoin (BTC) “digital gold” and Ethereum (ETH) “digital oil.”\n\nIn a new report shared by Matthew Siegel, VanEck’s head of digital assets, the ICBC gives praise to the top two cryptocurrencies by market cap.\n\nThe report also says that market demand is strong for digital assets, pushing innovation in the sector.\n\n“Market demand drives the continuous iteration of digital currencies.”\n\nThe report draws comparisons between Bitcoin and gold while also saying the crypto king has added benefits.\n\n“Bitcoin retains the scarcity similar to gold through mathematical consensus, while solving its problem of being difficult to divide, difficult to identify authenticity and inconvenient to carry. Its monetary attributes are gradually weakening, while its asset attributes are constantly strengthening.”\n\nIn calling Ethereum “digital oil,” the report praises various characteristics of the top smart contract platform’s ecosystem. While ICBC highlights some of the network’s shortcomings, it also believes technological advances will resolve them over time.\n\n“Ethereum has been continuously upgrading its technology in terms of security, scalability, and sustainability, providing technical power for the digital future…\n\nEthereum introduces Turing completeness with its exclusive programming language (Solidity) and virtual machine (EVM), allowing developers to write and arrange for a variety of complex smart contracts and applications, providing a strong platform support for blockchain technology. Its flexibility has been widely recognized in the fields of decentralized finance (DeFi) and non-fungible tokens (NFT), and is gradually extending to the physical infrastructure network (DePin).\n\nIn essence, Ethereum’s Turing completeness enables it to execute any programming instructions under the premise of correct instructions and sufficient resources, but it also poses several practical problems…\n\nLooking ahead, Ethereum developers will continue to work on finding the Pareto optimum between sustainability, security and efficiency.”\n\nBitcoin is trading for $66,502 at time of writing, down 5% in the last 24 hours. Meanwhile, Ethereum is trading for $3,464 at time of writing, down more than 6% on the day.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPWEFGNWV2UkJIczI3UU9LWS1aTEhna0U1V0Zib29TOHJSaldPamVNT0p0eHlxdThpZ2pSaC1VN1ByVTM0VFp2UFY3eUpUblBkbGJlR3F1X29tRTFGa2l4ZU9UQWNjbjBtY3FyUjdrcWxwOHFuUTB3OUw4STh5XzEySXI5YjB5MXZk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jun 2024 07:00:00 GMT",
        "title": "Bitcoin (BTC)’s 200K Potential, Ethereum (ETH)’s Growth, and Furrever Token’s Rewarding Referrals - Yahoo Finance",
        "content": "Furrever Token\n\nNew York, NY, June 11, 2024 (GLOBE NEWSWIRE) -- The cryptocurrency market is rife with opportunities and evolving narratives. As we navigate through 2024, Bitcoin, Ethereum, and Furrever Token stand out as significant players with distinct prospects and features.\n\nBitcoin’s 200K Potential\n\nBitcoin, the pioneer of cryptocurrencies, continues to dominate discussions with bold predictions. Analysts are eyeing the $200,000 mark, driven by potential catalysts like institutional adoption, macroeconomic shifts, and technological advancements. Despite recent fluctuations, Bitcoin’s long-term outlook remains optimistic. This price target is not just speculative hype; it reflects Bitcoin’s growing acceptance as a store of value and hedge against inflation. Investors are keenly watching regulatory developments and market trends that could propel Bitcoin to new heights.\n\nEthereum’s Growth\n\nEthereum, the second-largest cryptocurrency by market capitalization, is experiencing a bullish trend. Its robust ecosystem, fueled by smart contracts, decentralized finance (DeFi) applications, and non-fungible tokens (NFTs), positions Ethereum for significant growth. The anticipation surrounding SEC approval for an Ethereum ETF further boosts its prospects. If approved, this ETF could attract substantial institutional investment, driving Ethereum’s price upwards. With Ethereum 2.0’s ongoing upgrades aimed at improving scalability and efficiency, the platform’s potential continues to expand, making it a compelling investment option.\n\n\n\n\n\nFurrever Token’s Rewarding Referrals\n\nAmidst the major players like Bitcoin and Ethereum, Furrever Token introduces a refreshing and engaging twist to the crypto market. Designed with a charming cat-themed ecosystem, Furrever Token aims to provide a delightful user experience while offering substantial financial opportunities. One of its standout features is the new referral program, which allows users to earn 10% in $FURR Tokens for every deposit made through their personal referral link. This system not only incentivizes community growth but also creates a stream of passive income for users.\n\nThe ongoing presale of Furrever Token has already raised over $1.3 million, with the project currently in stage 9, aiming for a total of $1.9 million. The token, priced at $0.000732, offers the potential for up to 15X returns, making it an attractive investment. Furrever Token’s roadmap includes exciting future developments, such as exclusive cute cat content, ensuring continuous engagement and rewards for its community. The project’s commitment to security, validated by an audit from Securi Lab, further enhances its credibility.\n\nStory continues\n\nConclusion\n\nAs the cryptocurrency landscape evolves, Bitcoin, Ethereum, and Furrever Token each present unique opportunities for investors. Bitcoin’s ambitious $200K target, Ethereum’s growth fueled by its versatile ecosystem, and Furrever Token’s innovative referral program create a diverse array of investment options. By staying informed and strategically investing in these promising cryptocurrencies, investors can navigate the dynamic crypto market and capitalize on its potential.\n\nWhether you are captivated by Bitcoin’s bold predictions, Ethereum’s technological advancements, or Furrever Token’s charming and rewarding approach, 2024 promises to be an exciting year in the world of cryptocurrency. Explore these opportunities and make smart investment choices to maximize your returns.\n\n\n\nJoin Furrever Token Presale Now:\n\n\n\nFurrever Token Official Website\n\n\n\nVisit Furrever Token Presale\n\n\n\nJoin Official Telegram Group\n\n\n\nFollow Official X Account\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\nCONTACT: Media Contact: Robert Smith https://furrevertoken.com/ support-at-furrevertoken.com\n\n\n\n"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE9zZHdCTENnS3h3NV9fMzgwZjJUV0FicFJRQUVMaFNPTjB1eURQTWtodDkyamllVnEtSGg0LWtNQlJxR0wtWVdlSFIwazZ6UEdmY1FhS0VBTGdteWw4VzY1QUd6SWl5ZWRZc095eWpkZHZDaTBJV1VZTQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jun 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum exchange balances at 4-year low - crypto.news",
        "content": "Bitcoin and Ethereum user balances have dropped to levels not seen since 2020.\n\nGlassnode data revealed that user balances of Bitcoin (BTC) and Ether (ETH) on centralized exchanges reached a four-year low as investors held out for higher prices in a bull market.\n\nBTC balances dipped to below 2.3 million coins, valued at around $160 billion, while ETH balances have dropped below 16 million, amounting to less than $59 billion.\n\nBitcoin and Ethereum exchange balance at 4-year low | Source: Glassnode\n\nWhy Bitcoin and Ethereum exchange levels dropped\n\nThe amount of BTC and ETH on exchanges has been in a downtrend since before July 2020, per Glassnode. Data confirmed that users continued to withdraw assets from these platforms following the pandemic, through the previous 2021 peak, during the 2022 Terra-FTX contagion, and even after spot BTC ETFs were approved.\n\nThe four-year pattern suggests that crypto users have adopted a bullish long-term outlook, expressing confidence in the future appreciation of these assets regardless of market cycles.\n\nAfter the COVID-19 crisis in 2020, inflation also rocked world economies and incentivized investors to station capital in technologically sound vehicles. Bitcoin’s hard-capped supply and immutable design bolstered its status as an inflation hedge and sovereign nations like El Salvador have adopted the cryptocurrency as legal tender.\n\nYou might also like: Bitcoin ETFs see significant inflows despite market fluctuations\n\nThe bullish thesis is perhaps solidified even further as Wall Street behemoths like BlackRock and Fidelity drove institutional demand through spot BTC ETFs. Companies like MicroStrategy under BTC maxi Michael Saylor have also parked billions in the top digital asset.\n\nAs the second-largest crypto and top altcoin asset, ETH commands its own bullish thesis as the leading substitute for BTC. The token powers the biggest decentralized finance (defi) ecosystem worth nearly $70 billion per DefiLlama.\n\nIn 2020, developers launched the Beacon chain, which kicked off the eventual transition from proof-of-work (PoW) to proof-of-stake (PoS). The move unlocked Ether staking, a process of locking up ETH for network security and passive yield.\n\nAt press time, over 27% of Ethereum’s supply was staked. In other words, users have deposited over $119 billion worth of ETH in staking providers like Coinbase, Lido, and EigenLayer.\n\nThe hype around spot ETH ETF approvals, defi growth, and staking surges has culminated in a positive outlook for the cryptocurrency and has further encouraged users to hold on for dear life, otherwise known in the crypto community as “hodl.”"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxPQ2FlbkdveHVOVDFseWpWeHZJZ1ZXLVRxMkliaXVnRWlYRWlocVZ5NURUbFloaVZGNUJqcDMtZDBGdzgtYjZVeHF0Wng3SzNrU2lEeTdtdWpBSDNqT25POGtYTm9vUkpuakg2OGJfdlc0OWxEcHVzTWJfbXNFcTF3WV9Dd2RRWS1MaWRRMmJuUFRLYjVtTERvZnZxQ0FESXBIT3lHTk5XU1RMTzNfWURHSDVtekR2NUo1Z3hoZ3QtZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jun 2024 07:00:00 GMT",
        "title": "World's largest bank ICBC praises the evolution of Bitcoin, Ethereum as innovative financial assets - CryptoSlate",
        "content": "The world’s largest lender, Industrial and Commercial Bank of China (ICBC), recently published an in-depth analysis highlighting the rapid evolution and growing diversity in digital currencies, where it compared Bitcoin to gold and deemed Ethereum “digital oil.”\n\nThe report emphasizes the human capacity for imaginative belief, as noted by historian Yuval Noah Harari, as a driving force behind the exponential growth in digital currency types and applications.\n\nVanEck head of digital assets research Matthew Sigel noted:\n\n“Chinese SOE banks keep writing love letters to Bitcoin and Ethereum.”\n\nThe ICBC report outlines the divergent development paths of various digital currencies, each addressing unique needs within the financial ecosystem.\n\nThe love letter\n\nAccording to ICBC’s report, market demand has fueled innovation in the digital currency sector, from the birth of Bitcoin (BTC) to advancements in Ethereum (ETH) and the exploration of central bank digital currencies (CBDCs).\n\nICBC said that Bitcoin has managed to retain a scarcity similar to gold through its mathematical consensus mechanism. The flagship crypto has resolved issues related to divisibility, authenticity verification, and portability. The report added that despite Bitcoin’s waning monetary attributes, its status as an asset is solidifying.\n\nMeanwhile, Ethereum provides “technical power for the digital future” and is establishing itself as “digital oil” capable of powering myriad applications across the web3 ecosystem.\n\nEthereum, distinct from Bitcoin, incorporates Turing completeness through its proprietary programming language, Solidity, and its virtual machine, EVM.\n\nThis feature allows developers to create and manage complex smart contracts and applications, positioning Ethereum as a critical platform for DeFi and NFTs. The report also acknowledged Ethereum’s potential to extend its influence to decentralized physical infrastructure networks (DePin).\n\nDespite the potential, Ethereum faces several practical challenges, including security vulnerabilities, scalability issues due to high computational demands, and significant energy consumption.\n\nEthereum developers are exploring various solutions to address these challenges. The introduction of the Proof of Stake (POS) consensus mechanism and sharding technology in the Ethereum 2.0 upgrade aims to enhance network throughput and sustainability. Additionally, developers are working on Layer 2 solutions such as state channels, side chains, and rollups to improve scalability.\n\nStablecoins and CBDCs\n\nThe report also highlighted the crucial role of stablecoins in bridging the gap between the digital currency market and the real world. Stablecoins, which peg their value to traditional assets like fiat currencies, offer stability in the volatile crypto market.\n\nICBC said that stablecoins facilitate seamless transactions and provide a reliable store of value, making them an essential tool for everyday financial activities and a bridge for integrating digital currencies into the global financial system.\n\nFurthermore, CBDCs represent a significant innovation in the modern monetary system. By digitizing fiat currencies, central banks can improve the efficiency of payment systems, reduce transaction costs, and enhance the effectiveness of monetary policy.\n\nAccording to the report, CBDCs can streamline cross-border transactions, reduce reliance on intermediaries, and offer greater financial inclusion by providing access to digital financial services for unbanked populations.\n\nThe report noted that the development and implementation of CBDC infrastructure requires careful consideration of privacy, security, and regulatory implications to ensure their success and widespread adoption.\n\nThe report concluded that while the development vision for each digital currency varies, all aim to enhance financial inclusion, security, and payment efficiency. As digital currencies continue to evolve, developers and policymakers need to focus on balancing sustainability, security, and efficiency.\n\nMentioned in this article"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxPMklFNW85TG5wRUZpOThaZzV5Z2w3TXVTRXVTRi1fR3g3eUtIR09QNHV3VTJNNnJNazUzZDlRSFZ2WGNzUEhET3I1dVJjSFRjcHk3VVd2MVo1NVVHMk5pOHRqVFNibFlSdGhkWDZpVDJjOGpidUxvVF9JaWhvLWR0SDJXTTBGMjZ2a3hndElxWXg1Z9IBlwFBVV95cUxQSkI0dTMxcjFrbjMtd2dDR1JIQW5nV09HUDluR05YdERoaFI1SUkwNkNhLWl1azN5MDJtcG9wVnpoeUlLNlFjNjFMeXdYVFRpVHVwODh4TFRfRVNNdEc1VFd1cHhvZ1NYVHM3NVdxZW9RNFNTU2V2OXBoT1ZQX0NxTUxMbVdudENReHJPbVY4bjdJNkdtc1VN?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jun 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Emerges as Crypto Darling After SEC’s Spot ETF Nod - CryptoPotato",
        "content": "Ethereum witnessed its strongest week in terms of capital inflow since March, with total inflows amounting to $69 million over the past week, as per the latest stats by CoinShares. The latest influx can be attributed to the surprise decision by the US Securities and Exchange (SEC) to allow spot Ether ETFs.\n\nAs a result, Ethereum’s YTD inflows surged to almost $81 million.\n\nThe improvement in investment products based on Ethereum had a significant impact on other digital asset products, attracting a staggering $2 billion. This subsequently resulted in the recent 5-week streak of inflows to $4.3 billion.\n\nBitcoin Still King with $1.97B Weekly Inflow\n\nEthereum products may have overshadowed Bitcoin for the past few weeks, but the latter remained the main attraction, with weekly inflows of $1.97 billion. On the other hand, short-Bitcoin investments experienced outflows for the third consecutive week, recording $5.3 million.\n\nAltcoins also saw a minor uptick in activity. Investment products based on Solana, Litecoin, and Chainlink witnessed $0.7 million in weekly inflows each. Meanwhile, XRP and Fantom stood out with inflows of $1.4 million and $1.2 million over the past week.\n\nTrading volumes in exchange-traded products (ETPs) soared to almost $13 billion for the week, representing a 55% increase from the previous week. According to the latest edition of CoinShares’ Digital Asset Fund Flows Weekly Report, inflows were observed across almost all providers, coupled with a continued deceleration in outflows from established players.\n\nThis turnaround in sentiment is believed to be a direct response to weaker-than-expected macroeconomic data in the United States, which has brought forward expectations for monetary policy rate cuts. Positive price movements led to a rise in total assets under management (AuM), surpassing the $100 billion mark for the first time since March of this year.\n\nUS Leads $2B Global Crypto Inflow\n\nRegionally, the US experienced the highest inflows last week, registering $1.98 billion. In fact, CoinShares found that the first day of the week marked the third-largest daily inflow ever recorded. The iShares Bitcoin ETF now comfortably exceeds the incumbent Grayscale, with $21 billion in assets under management.\n\nHong Kong, Canada, and Switzerland followed suit with inflows of $26.1 million, $12.7 million, and $10.6 million, respectively, whereas Brazil, Germany, and Australia settled with $9.5 million, $2.5 million, and $1.7 million in inflows, respectively. Sweden, on the other hand, recorded a weekly outflow of $9.2 million."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxPZ3dZc3FnaUN1d1RYdU9LSkFPeHpVZE5pODNwWVBCR2thUktpamp2LVZ6SzRzS1Z6N3JKNV9adjFQdElsd2xpcWQ5MDRVZnBabWR4Rk9yeDBpcVVYVHFsRUlHM2ltY21rUFIxb3k5MDF0U0JXdDl3enFNaDRkTWJqVkk4SGctTVVrc3c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jun 2024 07:00:00 GMT",
        "title": "Crypto Market on Fire: Bitcoin's Breakout, Ethereum's Growth, and Furrever Token's Promising Launch - Yahoo Finance",
        "content": "Furrever Token\n\nNew York City, NY , June 10, 2024 (GLOBE NEWSWIRE) --\n\nThe cryptocurrency market is experiencing a fiery surge as Bitcoin, Ethereum, and the newly introduced Furrever Token make significant strides. This trifecta of digital assets is creating a buzz among investors, each offering unique opportunities and showcasing promising growth trajectories.\n\nBitcoin's Breakout: A Bullish Run\n\nBitcoin, the leading cryptocurrency by market capitalization, is once again in the spotlight with a remarkable breakout. Recent activities have seen Bitcoin reclaim and stabilize around the $69,000 mark, driven by substantial whale activity. High-net-worth investors have opened massive long positions, indicating strong confidence in Bitcoin's potential for further gains. This bullish sentiment is underpinned by record-high open interest and funding rates, suggesting that the market is poised for continued upward movement.\n\nHistorical data shows that Bitcoin often experiences significant price appreciation following such bullish patterns, making it an attractive option for both new and seasoned investors. As Bitcoin continues to lead the market, its influence on the broader cryptocurrency ecosystem remains unparalleled, driving momentum across various digital assets.\n\nEthereum's Growth: Innovation and Expansion\n\nEthereum, the second-largest cryptocurrency by market cap, is also witnessing impressive growth. Known for its robust smart contract capabilities and a vast ecosystem of decentralized applications (dApps), Ethereum continues to innovate and expand. The recent approval of Ethereum ETFs has further fueled optimism, attracting institutional investors and enhancing market stability.\n\nEthereum's transition to Ethereum 2.0, aimed at improving scalability and reducing energy consumption, is a significant milestone. This upgrade is expected to enhance the network's performance and security, making Ethereum an even more attractive platform for developers and users. The increased adoption of Ethereum-based DeFi applications and NFTs (non-fungible tokens) further cements its position as a leader in the blockchain space.\n\n\n\n\n\nFurrever Token: A Whimsical Revolution in Crypto\n\nAmidst the excitement surrounding Bitcoin and Ethereum, Furrever Token (FURR) is carving out its own unique niche. Unlike traditional cryptocurrencies, Furrever Token infuses the crypto world with a playful and heart-warming twist. Centered around adorable cat imagery, Furrever Token aims to create an engaging and fun ecosystem that appeals to both crypto enthusiasts and cat lovers alike.\n\nStory continues\n\nA Delightful Concept\n\nFurrever Token stands out with its focus on cuteness and community. The platform features cat-themed stickers, emojis, and visuals that enhance user interaction and foster a sense of camaraderie among holders. This whimsical approach not only differentiates Furrever Token from other digital assets but also creates a loyal and enthusiastic user base.\n\nRobust Tokenomics and Community Engagement\n\nThe tokenomics of Furrever Token are meticulously crafted to support its long-term vision. With a total supply of 9 billion tokens, the distribution includes 65% available during the presale, 25% allocated for decentralized exchanges (DEXs), and 10% reserved for the team, locked for a year to ensure project stability and trust. This thoughtful allocation aims to balance initial accessibility with sustained growth potential.\n\nCommunity involvement is at the heart of Furrever Token. By empowering early adopters as moderators, the project fosters organic growth and meaningful engagement. This strategy has already attracted nearly 4,000 active members on Telegram, demonstrating the strong interest and participation in the Furrever ecosystem.\n\nPromising Presale and Future Prospects\n\nFurrever Token has raised over $1.3 million and is in the ninth stage of its presale, targeting a total of $1.9 million. The token’s upcoming launch on PancakeSwap offers up to 15X returns for early investors, creating significant buzz and FOMO (fear of missing out) within the crypto community. With a current price of $0.000732, FURR presents an attractive opportunity for those looking to invest early in a unique and promising project.\n\nEnsuring Security and Trust\n\nSecurity and transparency are paramount for Furrever Token. The project's smart contract has been audited by Securi Lab, providing an additional layer of assurance for investors. While the team remains anonymous—a common practice in the crypto world—they have implemented measures such as locking their tokens for a year to build trust and demonstrate commitment to the project's success.\n\nConclusion\n\nAs Bitcoin and Ethereum continue to lead the charge in the cryptocurrency market with their impressive breakouts and sustained growth, Furrever Token is set to be the next big thing with its unique and whimsical approach. With strong tokenomics, community involvement, and a promising presale performance, Furrever Token offers a refreshing and potentially lucrative opportunity for investors. The combined momentum of these digital assets underscores the dynamic and exciting nature of the crypto market. For more information, visit Furrever Token's official website.\n\n\n\nJoin Furrever Token Presale Now:\n\n\n\nFurrever Token Official Website\n\n\n\nVisit Furrever Token Presale\n\n\n\nJoin Official Telegram Group\n\n\n\nFollow Official X Account\n\n\n\nMedia Contact:\n\nRobert Smith\n\nhttps://furrevertoken.com/\n\nsupport@furrevertoken.com\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\n\n\n\n\nCONTACT: Robert Smith support at furrevertoken.com\n\n\n\n"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE1qVWwwUkh1ZVpzRUh5bHVMRk5kSWllU2VnTXVBREdfRmtnZENQa0dIa0RYVi1xakppdmJvdlY4QVBaaU1MUGRUcGJlY2hfU19Rd0ZNOW1LVXZ1aVltb0NxZFczTkh4YUN3RjVQbGVTTTFnaElabW9Vcnlpb29BUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jun 2024 07:00:00 GMT",
        "title": "“Bitcoin’s Next Move Could Be $100,000, But This Is Still Altcoin Season”: Analysts Predict Ethereum and BlockDAG Network Takeover - Yahoo Finance",
        "content": "BlockDAG Network\n\nLondon, UK, June 11, 2024 (GLOBE NEWSWIRE) -- Analysts are offering a variety of predictions for Bitcoin's future price movements, reflecting a range of optimism influenced by upcoming events and historical trends. However, the broader cryptocurrency market indicates a burgeoning altcoin season, where altcoins, particularly those involved in AI and decentralized finance (DeFi) like BlockDAG Network and Ethereum, might outshine Bitcoin in the short and longer term.\n\n\n\n\n\nThe Bitcoin Trend to $100,000\n\n\n\nOne of the most influential factors in Bitcoin price predictions is the recent Bitcoin halving event, occurred in April 2024. This event, which occurs roughly every four years, cuts the reward for mining Bitcoin in half, effectively reducing the supply of new Bitcoin entering the market. Historically, Bitcoin halvings have been followed by significant price increases. For example, post-halving price surges have been observed in past cycles, leading some analysts to forecast that Bitcoin could reach new all-time highs of $100,000 now two months after the 2024 event.\n\nDan Tapiero, a prominent crypto analyst, predicts that Bitcoin could hit $100,000 by late 2024 or early 2025. Tapiero cites the halving event and the increasing adoption of blockchain technologies by both countries and companies as key factors driving this potential rise. Similarly, Geoff Kendrick from Standard Chartered Bank also believes Bitcoin could test the $100,000 mark next year, driven by banking sector turmoil, the halving event, and the end of the Federal Reserve's rate hikes.\n\nBeyond these optimistic forecasts, other analysts provide a more nuanced view. For instance, projections for Bitcoin's 2024 price range from a low of around $27,341 to a high of $118,102, reflecting the cryptocurrency's inherent volatility. This wide range highlights the unpredictable nature of Bitcoin's market behavior, influenced by various macroeconomic factors, regulatory changes, and shifts in investor sentiment.\n\nLooking further ahead, some predictions are even more bullish. By 2030, Bitcoin's price is anticipated to reach between $149,316 and $265,318, suggesting a potential increase of over 850% from its current levels. These long-term projections are often based on the assumption that institutional interest and mainstream adoption will continue to grow like it has done since 2009, providing an even stronger foundation for Bitcoin's value appreciation.\n\nAltcoins: Ethereum and BlockDAG Network Lead\n\n\n\nAnalysts point out that while Bitcoin may reach new highs, it lacks the explosive potential of many altcoins in the current market environment. The altcoin market shows substantial upside potential, driven by innovations in AI and blockchain technology. For instance, AI-focused cryptos like Bittensor, Fetch.ai, and Openfabric AI are gaining traction due to their novel applications in decentralized machine learning and AI-driven tasks.\n\nMoreover, Ethereum continues to be a critical player, with expectations of significant growth due to its extensive use in DeFi and other blockchain applications. Analysts suggest that Ethereum, along with BlockDAG Network , which offer scalable and efficient blockchain solutions, could lead the next phase of blockchain adoption.\n\nEthereum is poised to lead the altcoin season in 2024, according to several analysts and market experts. This potential leadership is attributed to various factors, including technological upgrades, regulatory developments, and the overall momentum in the cryptocurrency market.\n\nOne of the critical drivers for Ethereum's potential leadership is the upgrades to its network. The most notable of these is the EIP-4844 (proto-danksharding) upgrade, which took place in March 2024 and aimed to significantly reduce transaction fees and enhance scalability. This improvement is benefiting Ethereum's layer 2 (L2) networks like Polygon, Arbitrum, and Optimism, making Ethereum more efficient and attractive for users and developers.\n\nThe approval of Ethereum exchange-traded funds (ETFs) is another catalyst for Ethereum's rise. ETFs make it easier for institutional investors to invest in Ethereum without dealing with the complexities of direct cryptocurrency transactions. The recent approval of Ethereum ETFs in Hong Kong has already generated optimism in the market. There is also speculation about potential ETF approvals in the United States, which could further drive institutional adoption.\n\nMarket Dynamics and Historical Patterns\n\nHistorically, altcoin seasons follow significant events in the cryptocurrency market, such as Bitcoin halvings. Analysts like Michaël van de Poppe and Josh Olszewicz highlight that Bitcoin's recent performance often precedes a shift in investment towards altcoins. They suggest that Ethereum's underperformance relative to Bitcoin recently indicates a potential for a significant catch-up, especially as technological and regulatory developments come to fruition.\n\nCrypto analyst Ash Crypto has pointed out that Ethereum's current price action resembles the bullish breakout observed in 2020. If Ethereum follows a similar trajectory, it could reach new all-time highs overcoming the $4,000 mark and can catalyze a broader altcoin rally, potentially leading to a substantial increase in altcoin valuations.\n\nAt the same time, BlockDAG Network represents a significant advancement in blockchain technology, aiming to address some of the inherent limitations of traditional blockchain systems. Utilizing a Directed Acyclic Graph (DAG) structure, BlockDAG combines enhanced transaction speeds and security with high decentralization, creating a robust framework for the future of decentralized finance (DeFi) and crypto mining.\n\nBlockDAG has garnered significant attention and investment since its inception. It has raised substantial funds through its presale, highlighting strong investor confidence. For instance, the project has already raised over $50 million and is seeing daily inflows of $500,000 that has left analysts claiming it could lead the altcoin market together with Ethereum.\n\n\n\n\n\n\n\n\n\n\n\nAs market dynamics evolve, it is essential to recognize the distinct opportunities presented by different projects within the cryptocurrency landscape. Bitcoin's potential rise to $100,000 reflects its status as a digital store of value, while the altcoin market, especially with projects like Ethereum and BlockDAG Network, promises higher returns driven by technological advancements and new use cases. This diversification highlights the importance of a strategic approach to cryptocurrency investment, balancing between established assets like Bitcoin and emerging technologies within the altcoin space.\n\nRead About BlockDAG Presale:\n\nWebsite: https://blockdag.network\n\n\n\nPresale: https://purchase.blockdag.network\n\n\n\nTelegram: https://t.me/blockDAGnetworkOfficial\n\n\n\nDiscord: https://discord.gg/Q7BxghMVyu\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\nCONTACT: Alan smith support(at)blockdag.network\n\n\n\n"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxNVVltSWVfbjhYMnRBaF9ZSE9nQy0zWEdILTU4TVpzUnVlT01BbFhlVVNNWThmaWZQMVhNOWE2SlhUQmRvSGNuamdXcUUzVER1OW9icXhqR2EtYjBfeVo2ci0wRmN2QnIzdDVMZFRLQmRPdkNnSnFBOWlYTWJZYU8xVU9aMk12SGhtVkk2NUhiSWFHQUtmNWEyZ0Fsc1dKT3VrTWZDX2pR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jun 2024 07:00:00 GMT",
        "title": "The price of Ethereum in Bitcoin is still falling, but not in USD - The Cryptonomist",
        "content": "In recent days in the crypto markets, an interesting dynamic is occurring regarding the price of Ethereum in Bitcoin and in USD.\n\nThe thing is curious especially because by the end of the month, or at the latest by the first week of July, the final listing of spot ETH ETFs in the USA is expected, but despite this at the moment Ethereum appears clearly subordinate to Bitcoin.\n\nThe price of Ethereum and Bitcoin in USD\n\nRegarding the price trend in USD in recent days, there is not much to say about either Ethereum or Bitcoin.\n\nAfter the sudden movement on Friday, when the price of BTC dropped almost abruptly from around $72,000 to around $69,000, over the weekend it did nothing but move sideways just above $69,000.\n\nAmong other things, the current level is perfectly in line with that of last Monday, so Friday did nothing but burn the gains accumulated during the week.\n\nIndeed, at the beginning of June it was below $68,000, so the current level should still be considered very good, being in fact only 6% lower than the historical maximum.\n\nA similar argument can also be made for Ethereum.\n\nThe current price is below $3,700, and it is in line with that of the last decade of May.\n\nCuriously, however, it is still at -25% from the absolute highs of 2021, but last week it had not risen much.\n\nAfter the boom of May 20, when the news of the possible imminent approval of the applications for the issuance of a spot ETH ETF in the USA came out, it rose only until the end of the month, then started June above $3,700 and in fact has been lateralizing until now.\n\nFriday had reached just above $3,800 before the drop that brought it back below $3,700.\n\nDuring the weekend, it did not move from this last level.\n\nThe dynamics of this morning\n\nThis morning, however, there was some small movement, although not significant.\n\nThe price of Bitcoin has moved from $69,700 to $69,200, as if it wanted to start a small bear trend, but once it reached this last level, it recorded a rebound that seems to have averted further declines, at least for now.\n\nThe price of Ethereum went from $3,715 to $3,655, but only to bounce back and return above $3,670.\n\nThese are dynamics that only serve to liven up the markets a bit, but they are not decisive in any way, not even in the short term.\n\nHowever, it cannot be ruled out that tomorrow or the day after tomorrow this period of lateralization may end, even if it is not yet clear in which direction it might go.\n\nThe Ethereum/Bitcoin ratio and the relationship with the price in USD\n\nThe only truly interesting dynamic is that of the relationship between Ethereum and Bitcoin.\n\nFirst of all, you can analyze the price trend of ETH expressed in BTC.\n\nAt the beginning of June, one ETH was worth about 56 thousandths of BTC. However, already on June 2, this price started to drop.\n\nIn particular, on June 3rd it had dropped to 54 and on June 5th to 53.\n\nAfter Friday’s drop, it ended up falling below 53 thousandths of BTC, so now it is still below.\n\nIt is worth noting that at the end of May it had also risen above 57 thousandths, so this is a decline that has been going on for more than two weeks now.\n\nConsidering instead the ratio between the market capitalization of BTC and that of ETH, today it has risen to 3.1, after being below 2.9 at the end of May.\n\nHowever, these are not very high values, given that before the news of the probable approval of spot ETH ETFs it was almost 3.6.\n\nWhat matters most at this moment is that from Friday’s drop this ratio has risen, albeit slightly, indicating that Bitcoin is holding up better than Ethereum in these days when financial markets seem a bit worried about the Fed’s restrictive monetary policy.\n\nThe dominance of Bitcoin\n\nThe picture for altcoins becomes even bleaker if we analyze the dominance of Bitcoin.\n\nAt the end of May, according to Trading View data, it had dropped to 53.7%, and since then it has started an almost constant rise.\n\nJune started above 54%, and last week it had already risen above 54.7%.\n\nThe most interesting thing, however, was the reaction to Friday’s drop, with Bitcoin’s dominance suddenly jumping from 54.6% to 55.5%, although it then fell to 54.9% over the weekend.\n\nThis morning, however, it rose again, returning to 55.5%, before slightly correcting to 55.4%.\n\nIf we take as a reference the 51.9% at the beginning of the year, it is evident how in this 2024 it is precisely Bitcoin that dominates the crypto markets, although there are occasionally some small exceptions.\n\nAmong other things, the maximum peak of the dominance of the year was 56.3%, which is not much higher than the current levels. This gives a good idea of the fact that altcoins as a whole are not going through a good moment at all. Just think that the current levels are similar to those of the second half of April 2021, that is, in the midst of a great bull run.\n\nIn summary, despite the fact that in theory the attention at this moment should be focused on Ethereum, it is still Bitcoin that dominates the crypto markets, with the altcoins that for now are limited to suffering while waiting for better times,"
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPaWRGVzNENUptOWJKSHpNbFhpbU8wOERnZGZyemllTC1tX29Ra3ZuS3pmYkFLM1ZpM2dJRkVkZFY5ZmR6TVBlWS05RlZOcE1weGYySmdObGhPaFdpbWNFMGp1aFluUmltNVBLQzFsU3IzYS11bFBTdWtuQXpKU0RYZTFfZXc4bXNhNlEtbjJCLW5vblAwbnNyVg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jun 2024 07:00:00 GMT",
        "title": "2 Cryptocurrencies to Buy Whether Bitcoin Hits Another All-Time High or Not - The Motley Fool",
        "content": "Ethereum and Solana are set to soar higher in 2024, even if Bitcoin continues to trade sideways.\n\nAfter Bitcoin hit a new all-time high of $73,750 in mid-March, crypto investors were understandably excited about where it could head next. The crypto seemed poised to skyrocket past the $100,000 level this year. But Bitcoin continues to trade right around the $70,000 mark, leaving some crypto investors searching for potential alternatives.\n\nIf you're one of those investors, there are two cryptocurrencies to put on your radar screen right now: Ethereum (ETH 0.14%) and Solana (SOL 0.76%). Both will potentially soar higher in 2024, whether or not Bitcoin goes along for the ride.\n\nEthereum\n\nThe big catalyst for Ethereum right now is the recent approval of eight new spot Ethereum exchange-traded funds (ETFs). They're set to start trading soon, and when they do, it could lead to a huge influx of new investor money into Ethereum.\n\nWhile this influx of money isn't likely to be anywhere close to the amount of money that flooded into the new spot Bitcoin ETFs, it's nonetheless expected to be significant. For example, JPMorgan Chase predicts that the influx of new money into spot Ethereum ETFs could be as high as $3 billion over the next six months. And K33 Research, an independent crypto research firm, thinks the number could be as high as $4 billion.\n\nThe thought of so much new money flowing into Ethereum, which is already up 70% for the year, has some investors giddy. For example, some think Ethereum might outperform Bitcoin over the next six months, simply due to the potential impact of the ETF boom. When you add in the fact that Ethereum continues to roll out new tech upgrades to its core blockchain, there's growing cause for optimism.\n\nSolana\n\nLike Ethereum, Solana is up 70% for the year. This comes on the back of a monster year in 2023 when it skyrocketed more than 900%. While Solana's upward trajectory has cooled somewhat of late, there's still potential for an enormous move upward in the second half of the year.\n\nOnce you take a quick look at Solana's core metrics, you'll understand why. Just about every key metric has experienced tremendous growth over the past 12 months. The number of users is way up, transaction activity is way up, and the size of the Solana blockchain ecosystem continues to grow by leaps and bounds.\n\nIn no small part, this has to do with soaring consumer adoption. Solana has become the go-to blockchain for buying, selling, and launching meme coins. Even big-time celebrities (well, OK, B-list and C-list celebrities) are getting in on the action, with rappers, reality stars, and musicians launching meme coins of their own on Solana. Since these celebrities have millions of followers on social media, it's possible to argue that Solana is getting a free marketing blitz directed at its core user demographic (young, tech-savvy, and with plenty of disposable income to spend on crypto).\n\nThe good news is that all of this is uncorrelated with what's happening on the Bitcoin blockchain, so Solana can soar higher, even if Bitcoin continues to trade sideways.\n\nThe Layer 1 investment thesis\n\nEthereum and Solana share one key trait in common: They're both Layer 1 blockchains. This means that they're the fundamental building blocks of the blockchain world. When it comes to any key blockchain niche -- such as non-fungible tokens (NFTs), decentralized finance (DeFi), blockchain gaming, or decentralized Web3 applications -- the core starting point is always the Layer 1.\n\nThat's what has me excited about Ethereum and Solana as potential Bitcoin alternatives. If you buy into the general notion that a crypto bull market rally should help to inject new life into every single niche of the blockchain and crypto world, then Ethereum and Solana should be among the biggest beneficiaries.\n\nA rising tide lifts all boats, and Ethereum and Solana are two of the biggest boats out there. Even if you're on the sidelines about Bitcoin, it might be time to take a closer look at Ethereum or Solana."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxPMmlBcngwcHJFNjRmbmFYVDZrR2ZPSkNvTWVlMFZuSXJlaHliaEpFNVItd3dZdFdac2hJR3NoeEE0YTJSNDJBSm1Genl6WS1XZHlraGJhNWI2TWpFWE5va19mSlBaSTdmT1VBb2lHQWozS1hqa2RnX21PRlM0ZFBQeHhsb09xZ0hyWjZCRDhIcEFRMHVkX1VkcUhvVUR1QlU40gGmAUFVX3lxTFBoRVVGX3BiVnh1cEJ1a2hoazhRbWJXYVBzaXNaRGJwekRpdFRNZnVxT29XeEkyQVFsQkhENWZ2WGdtQkZsYkUxREo1eXFjZ2JvNm1IVkkxT1ZuYWRMcThONGlReDlrUG5MdGJSYmlZLXA4MnlXdmQ0ektvZXg0U09ETG9QZ2xGMjYyZWF4TzlhNjZhZXpEOURIeHFva1pVWE03eVU4YWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jun 2024 07:00:00 GMT",
        "title": "ETH/BTC Price Prediction: Can Ethereum Price Pump Ahead Of FOMC? - CoinGape",
        "content": "Ethereum price broke out downward from a consolidation zone, invalidating the previous bullish flag. Meanwhile, the markets eagerly await the Federal Open Market Committee (FOMC) meeting on Wednesday to know whether interest rates will get cut or spike higher.\n\nThe price of Ethereum was $3,448 during American trading hours on Tuesday, a 6% drop in the last 24 hours and a further 9.7% decrease in 7 days, as per CoinGecko data.\n\nadvertisement\n\nETH/USD Price Prediction: Bears Take Hold of the Market, These Are the Support Levels to Watch\n\nETH price was previously trending in a consolidation zone, part of a larger bull flag market structure. Bull flags are bullish, and the markets expected the pattern to resolve upwards. However, the Ethereum price experienced great downward pressure in the early morning hours of June 11.\n\nThe price of Ethereum broke below the range, invalidating the bull flag on the 4-hour timeframe. Nevertheless, on the daily timeframe, ETH price action is still trending above the 50-day and 200-day simple moving averages (SMA), albeit very close.\n\nIf bears persist, ETH price may drop further and find support at the 50-day SMA, which also coincides with the 0.5 Fibonacci retracement level. This will put the price of ETH around $3,400. Further below, key support areas exist around $3,200 and $2,900.\n\nOn the flip side, if the bulls overpower the bears, the ETH price may rally and test the lower boundary of the range around $3,650. If ETH continues to rise, it may re-enter the range and move sideways between $3,700 and $3,950 before breaking to the upside and heading towards $4,200. Currently, $3,650 is the strongest resistance level for Ethereum price action.\n\nWhy is the Ethereum Price Crashing?\n\nThe drop in Ethereum price comes a day ahead of the FOMC meeting and also coincided with Bitcoin’s drop in price. The crypto community thinks that the recent market panic is connected to the FOMC outcome.\n\nThe panic is of FOMC and PPI outcome coming on wed and thurs. My guess is we will pump back strong after FOMC and PPI numbers🙏🙏#Bitcoin #altcoins — ₿ SatMaxx ₿ (@vinee202) June 11, 2024\n\nMarket analysts from Bankrate forecast that the FOMC will leave interest rates at a 23-year high in the upcoming meeting. However, they also estimate that there will be three or fewer rate cuts before the end of 2024.\n\nMeanwhile, Ethereum fundamentals remain strong, as the mainnet continues to dominate in fees over Layer 2s, generating 20X more fees than the top L2s combined.\n\nBottom Line\n\nInvestors remain alert for Wednesday and Thursday since FOMC and PPI data may influence the next direction of Ethereum price and the general markets. Ethereum’s positive fundamentals may help sustain the price if FOMC results and comments turn out negative for the markets\n\nRelated Articles\n\nEvans Karanja Evans Karanja is a crypto analyst and journalist with a deep focus on blockchain technology, cryptocurrency, and the video gaming industry. His extensive experience includes collaborating with various startups to deliver insightful and high-quality analyses that resonate with their target audiences. As an avid crypto trader and investor, Evans is passionate about the transformative potential of blockchain across diverse sectors. Outside of his professional pursuits, he enjoys playing video games and exploring scenic waterfalls.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxPZFhkd0VsQkRBUHBPQVZlMHBuVVhMYThSS3ZjOEc2R2xVVUY5cUJYTXBTMmhEZGJ4SUl2NUxrMkRwYS1PNTUyZkpuNmRILWE4ZjhUOEZtQjNGeFVIaGdJaURET2g4VXJjY2JJSjNlRlVoNGdqYmo2Vi05ZHprQWdzbDNDM2p5TkdKYVHSAY8BQVVfeXFMUE80T1d6c3V2NVpNUTFVY0NHS2RCQzdZeG5jdTZfX1k0LTc2WVlSN3VuT1RNcnRzb1JVVDlXRGhpQ0wwRXR0S3VORnlxVzd1c0oxaFpDRkNpaHFvY3JQdFUyeGJDUGlHbmhvUDhZQXR2Sl9STUtxVUZBdjlpNkNWaWsxVW8tS0V3aG1wRGlCdk0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jun 2024 07:00:00 GMT",
        "title": "Ethereum reserves hit 8-year low: Is a price explosion close? - AMBCrypto News",
        "content": "Ethereum reserves on exchanges are at an eight-year low, setting the stage for a price surge.\n\nCurrent bearish indicators suggest there might be room for further decline before a rebound.\n\nThe amount of Ethereum [ETH] held on exchanges has reached its lowest point in eight years. With the imminent launch of its spot ETFs, we could see a huge supply shock, and it might lead to a dramatic increase in Ethereum’s price.\n\nBut let’s check out what the data is telling us.\n\nEthereum ETFs to cause a stir?\n\nIf the spot ETFs garner the huge interest everyone expects, the initial rush to buy Ether could drive prices up rapidly, followed by possible corrections as the market adjusts to the new demand and supply dynamics.\n\nEthereum’s price is below both the 50-period and the 200-period moving averages, trending downward. This alignment generally indicates a bearish sentiment.\n\nThe RSI is around 43, which is below the neutral 50 mark but not yet in oversold territory (below 30).\n\nThis means the price could decline a little more before reaching oversold conditions, which often come right before a price rebound.\n\nA significant 89% of Ethereum holders are in profit at the current price, which is a strong indicator of a healthy market.\n\nWith 51% of Ethereum held by whales, there’s a huge concentration of Ethereum in the hands of a relatively small number of wallets.\n\nThere has been a large volume of transactions exceeding $100K, totaling $32.81 billion over the last seven days, highlighting massive institutional or large-scale investor activity. In other words, investors of all kinds are currently bullish on Ether.\n\nRecent downward trends in the MVRV ratio might suggest that Ethereum is entering a zone where it is less overvalued, aligning with a potentially more sustainable price level or even undervaluation.\n\nThis cooling-off could be a healthy market correction, providing a more stable foundation for the bull run.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nAs it stands, if Ethereum can sustain above the recent support at $3,670, it might attempt to break the $3,733 resistance.\n\nA successful breach above this could push the price towards the next psychological barrier at $3,800."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxQTGVBYktQX1ZjWjdua3pSdVBRQUptb3FsNnB4azNXWUMwa3BXbHFFazc5QUYtRmZxUldjUFNDZlFGRjVmb3BDUXJSb0ZteWFHSWoyRU1YaE0wZkkxRk9LdmIzN2xXOEhCYkx5d3VOdUd4MUhnX01uZ3A5Tm81QVJROV9FUUhYVmc5bUFVUUhsZGhyXzZRd1dGNU81WlpiQ0hHWUlyYlZnYVhYZmZNbEdVeU5KU1FiLVFWY0RScw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Jun 2024 07:00:00 GMT",
        "title": "Analyst Reveals Several Reasons Why Ethereum Could Reach a $150K Valuation per ETH - Crypto News Australia",
        "content": "Spot Ethereum ETFs in the US could drive ETH to new highs; analyst Adrian Zduńczyk disagrees it’s priced in.\n\nZduńczyk cites a US$154K ETH price target by 2030, with significant yearly growth and a solid user base supporting this forecast.\n\nHe advocates a 70% BTC and 30% ETH portfolio for optimal risk-adjusted returns.\n\nThe case of the Spot Ethereum exchange-traded funds (ETFs) possibly coming to the United States is a potential catalyst for ETH to reach new all-time highs. Or is the launch – which is expected to see Ether ETFs trade as early as July – already priced in?\n\nRelated: Fidelity International Introduces Instant Share Tokenisation on JPMorgan’s Onyx Blockchain\n\nCrypto analyst Adrian Zduńczyk, a Chartered Market Technician (CMT) with 651K followers on social platform X, doesn’t think so. Based on a VanEck analysis, @crypto_birb believes that ETH could be worth $154K (AU$233.5K) by 2030, with a base target of US$22K (AU$33.3K).\n\nVanEck’s target for ETH by 2030, source: Adrian Zduńczyk via X\n\nAccording to Zduńczyk and VanEck the optimal crypto portfolio is 70% in BTC and 30% in ETH – and they say adding 6% of crypto to the standard 60/40 portfolio will boost profits.\n\nAdvertisement\n\nVanEck Believes Huge Price Target Driven by US$66 Billion in Free Cash Flows\n\nSo how did the American investment manager come to that lofty price prediction?\n\nIt’s simply a “projection of Ethereum generating $66 billion in free cash flows by 2030 and applying a 33x valuation multiple” says Zduńczyk.\n\n2) Portfolio Boost: 6% Crypto Allocation\n\n\n\nAdding 6% crypto to a 60/40 portfolio boosts the Sharpe ratio, with a minor drawdown impact. Analysis of 169 sample portfolios showed that including 3% BTC and 3% ETH significantly improves the risk-adjusted returns. pic.twitter.com/UKyFhCs7iZ — Adrian Zduńczyk, CMT (@crypto_birb) June 8, 2024\n\nThe analyst explains that Ethereum benefits from a strong set of user metrics, with 20 million monthly active users generating US$3.4 billion (AU$5.2 billion) in yearly revenue.\n\nEthereum ecosystem daily active user growth, source: Artemis.XYZ\n\n71% of Network Revenue to Come from Finance By 2030\n\nAnnually, 0.4% of Ethereum’s total supply is burned, highlighting a deflationary trend in its economic model. The platform’s robust economic activity is further underscored by a settlement value of US$4tn (AU$6tn) and US$5.5tn (AU$8.3tn) in stablecoin transfers, reinforcing these growth figures, he added.\n\nBy 2030 it is expected that 71% of the network revenue will come from finance, based on a strong user base and transaction fees much lower than those of credit card processors and payment apps.\n\nOther bullish forces for ETH are the increasing importance of layer-2 networks and the potential of AI integration.\n\nFurther, Zduńczyk believes Ethereum will become a Sharpe Ratio leader. The Sharpe Ratio assesses an investment’s performance against a risk-free asset, adjusting for risk; a higher ratio indicates better risk-adjusted returns.\n\nThe analyst calculates that a portfolio consisting of 71.4% Bitcoin (BTC) and 28.6% Ethereum (ETH) yields a Sharpe ratio of 1.43. This indicates that this combination of BTC and ETH provides a favourable balance between expected return and volatility when compared to other potential combinations of these two cryptocurrencies.\n\nSharpe Ratio comparison BTC/ETH, source: @crypto_birb via TradingView\n\nRelated: Analyst Miles Deutscher Unveils 20X Portfolio Strategy for the Upcoming Bull Run\n\nFinal words of warning though, Zduńczyk says that 2030 is well past his “timeframe of interest” and in general long-term predictions are obviously fraught with uncertainty. He believes there will be a possibly prolonged bear market in 2026, which is why he will be looking to exit the market in 2025."
    }
]