[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE85WGUxVl9GSWdKVGRyTE9maTlYaEVTakJCUHM5Q2doM1JoT0FMUDRBbHpFYUR5ZHNmT0RLd05BS2xZVGtqbHlCQV9PMzEwWHI4alNDZG1abGZnQUtuODBRaUJJdkhaZ1J0dFhqMGJIR1JOTkdOWlpZQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Jun 2024 07:00:00 GMT",
        "title": "SEC drops investigation into Ethereum studio Consensys - Blockworks",
        "content": "Ethereum fans can breathe a sigh of relief.\n\nThe US Securities and Exchange Commission (SEC) has formally dropped its investigation into the blockchain’s ecosystem.\n\nEthereum development studio Consensys shared the news on X overnight.\n\n“Today we’re happy to announce a major win for Ethereum developers, technology providers, and industry participants: the Enforcement Division of the SEC has notified us that it is closing its investigation into Ethereum 2.0,” the company posted.\n\n“This means that the SEC will not bring charges alleging that sales of ETH are securities transactions.”\n\nLoading Tweet..\n\nIndications of an SEC probe into Ethereum and entities supporting the protocol circulated in March, when Fortune reported the agency was investigating three unnamed related companies for potential securities violations.\n\nConsensys then sued the SEC one month later, alleging regulatory overreach. The suit claimed chairman Gary Gensler sought to grab power over the crypto space, using legal maneuvers that would force ETH into a security definition following its switch to proof of stake in September 2022.\n\nPart of those filings disclosed that Consensys had received a Wells notice from the SEC, indicating the agency’s intent to sue. The Fort Worth firm, which owns popular web3 infrastructure including crypto wallet MetaMask and API provider Infura, was founded by Ethereum co-founder Joe Lubin.\n\nWhile the SEC probe was expected to be dropped following approval of a suite of spot ether ETFs last month, the formal notice puts to bed one of crypto’s primary existential threats, at least for now.\n\nFormer SEC chair Jay Clayton had initially backed SEC Director of Corporation Finance William Hinman’s notion that ether was no longer a security in 2019, as there was no central entity in control of the cryptocurrency at the time. No official statement had been given by the agency, however, and Gensler had seemingly been walking back those thoughts ever since.\n\nOn Wednesday morning, Alexander Grieve, government affairs lead at venture capital firm Paradigm, tweeted a copy of the SEC’s letter to Consensys. It reads:\n\n“We write to provide notice that we have concluded the investigation in the [matter of Ethereum 2.0]…. based on the information we have as of this date, we do not intend to recommend an enforcement action by the Commission against your client, Consensys Software Inc. with respect to this investigation.”\n\nLoading Tweet..\n\nThe letter added that the notice was given under guidelines in the Securities Act which state that it “must in no way be construed as indicating that the party has been exonerated or that no action may ultimately result from the staff’s investigation.”\n\nAll good news for Consensys but other legal threats still loom over crypto. So far, there’s no word of the SEC’s Uniswap probe being dropped, although a lawsuit has not yet been filed.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the Forward Guidance newsletter.\n\nGet alpha directly in your inbox with the 0xResearch newsletter — market highlights, charts, degen trade ideas, governance updates, and more.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxPMlBjVjlxVjRKYW01aXd0eExKSlZUeVBKNFAzZWlwc2pXb1N3QkRyaEdBZXplLU1tcFNDWWU4dFlCSnBSR3lERW1DVGU0eEdud2Rva2hQdF92LVNHc2dnZmJEaklLUWNtS1g2OXN0V1lwRzVvblEtVWNhekgxaWEwcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jun 2024 07:00:00 GMT",
        "title": "What You Need to Know about Ethereum ETFs - Brave New Coin Insights",
        "content": "What You Need to Know about Ethereum ETFs\n\nThe buzz around Ethereum ETFs is reaching a fever pitch. Let's break down when you can expect them to hit the market and who's behind the scenes making it happen.\n\nEthereum ETF Launch – When’s the Big Day?\n\nInvestors and traders are clutching their Ethereum wallets in anticipation of the launch of spot Ethereum ETFs. Bloomberg’s ETF guru, Eric Balchunas, has circled July 2nd on the calendar. This date could be a game-changer, opening up a fresh route for folks to dive into Ethereum.\n\n\n\nWho’s in the Game?\n\nThe road to getting these ETFs approved has been a wild ride. The SEC has given the green light to the 19b-4 forms for eight big players, including heavyweights like BlackRock, Fidelity, and VanEck. This stamp of approval is a big deal, letting these companies move forward with their ETF plans.\n\nThe SEC has also tossed some light comments on the S-1 filings back to the issuers. This is a good sign that things are moving in the right direction. SEC Chair Gary Gensler hinted during a budget chat on June 13th that we might see these ETFs get the nod by September. Back on May 23rd, the SEC gave a thumbs-up to the 19b-4 filings from eight companies for Ethereum ETFs. This is a solid signal that these ETFs are just around the corner. Investors and traders are watching like hawks, knowing that the launch of Ethereum ETFs could shake up the crypto market in a big way.\n\nMarket Projections\n\nGetting a grip on the market projections for the Ethereum ETF can be a game-changer for crypto traders and investors. Let’s break down VanEck’s price forecast and the expected institutional money flow.\n\nVanEck’s Price Projection\n\nVanEck, a big player in asset management, has thrown out a bold prediction for Ethereum (ETH). They reckon Ethereum could hit $22,000 by 2030. This guess is based on Ethereum pulling in around $66 billion in “free cashflows.”\n\nInstitutional Capital Inflows\n\nThe launch of spot Ethereum ETFs is set to draw in a hefty amount of institutional cash. Geoff Kendrick from Standard Chartered thinks the inflows could be anywhere from $15 billion to $45 billion in the first year alone.\n\nThese numbers show just how much Ethereum ETFs could shake up the market. If you’re into crypto trading or investing, this is something you don’t want to miss.\n\nImpact on ETH Prices\n\nPrice Rally Prediction\n\nEveryone’s buzzing about the possible approval of spot Ethereum ETFs, and it’s got the crypto world in a tizzy. QCP Capital, a trading firm out of Singapore, thinks this could send ETH prices soaring. They’re talking a 60% jump, similar to what happened when spot Bitcoin ETFs got the green light back in January.\n\nMarket Reaction and Price Fluctuations\n\nThe market’s been all over the place since the news dropped on June 13th. ETH took a nosedive from $3,558 to $3,464, hitting its lowest point for the month. But it didn’t stay down for long, bouncing back up by 0.69% to $3,517.\n\nEven with these ups and downs, the market isn’t exactly screaming “bullish.” It looks like ETH might still be stuck in a bit of a rut, influenced by some bearish vibes. Check out the recent price movements.\n\nFor traders and investors, keeping tabs on these shifts is key. Knowing how the market’s reacting can help you make smarter moves with your investments.\n\nApproval Process Updates\n\nSEC Chair’s Statements\n\nDuring a budget hearing on June 13th, SEC Chair Gary Gensler mentioned that the approval process for Ethereum ETFs is expected to wrap up by summer, with a likely nod by September. The timeline hinges on how quickly issuers respond to the SEC’s feedback. This has stirred up quite the buzz in the crypto world.\n\nPrice Impact and Market Sentiment\n\nEven with worries about the drawn-out approval process for Ethereum ETFs, Gensler’s recent comments hint at a September green light, giving issuers more prep time. After the June 13th announcement about the potential approval, ETH’s price saw some ups and downs.\n\nETH’s price dipped from $3,558 to $3,464, hitting its lowest in June. But as of the latest update, ETH has bounced back a bit, up 0.69% to $3,517. Despite these price swings, the indicators didn’t show a strong bullish vibe, suggesting ETH might still be swayed by bearish trends. This mixed market sentiment highlights the cautious optimism about the potential Ethereum ETF approval."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTFBLeU5sVmo0eGJfcnFUNXNESWwwV1kzUjBqUHcwUGIxUzhsRjFFQVBjakRiNTc4YmpVYl9UM2JGZGYxc1BMMFdWUlZQM2c3dE1HRDVXQVhVZGFwb1V4ZEpHQUo4MW5xam1lX2dTZ1lySGJ2dGpm0gF6QVVfeXFMTmpONk8xSVdJNTgtUWhwNEZDc0hhQUhvQk5RcW5BWjVmRThOS21GRUtBV1NadVdkRGdyYXpTRzlRN1hxTTI5M2FwbVVjVDdBc1VFMUthekhfM0cwYlU5UExMUnpTSHVScVVjaGx0MGgxQjVnSzlxbGxkcVE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Jun 2024 07:00:00 GMT",
        "title": "Ethereum's price soars as SEC probe concludes - Forkast News",
        "content": "Ether’s value surged past US$3,500 as the U.S. Securities and Exchange Commission (SEC) wrapped up its investigation on Ethereum.\n\nThe conclusion of the SEC’s investigation, which did not result in any charges related to Ethereum’s sales as securities, has been met with enthusiasm from investors and the Ethereum community.\n\nThis development comes after Consensys, an Ethereum developer, contested the SEC’s regulatory stance, advocating for Ethereum’s classification as a commodity.\n\nConsensys’ legal challenge, initiated in April 2024, sought to limit the SEC’s regulatory reach over Ethereum and to obtain a judicial declaration affirming its commodity status.\n\nThe culmination of this legal battle, combined with public and political support, prompted a favorable outcome from the SEC’s Enforcement Division on June 18.\n\nThe resolution of the SEC’s scrutiny lifts a major uncertainty that had been casting a shadow over Ethereum, potentially impacting its classification and market demand.\n\nThe announcement of the investigation’s end was met with an immediate response in the market, with Ethereum’s trading price climbing to $3,586, according to CoinGecko.\n\nThe SEC approved a series of spot Ether exchange-traded funds (ETFs) last month, paving the way for their trading on the stock market.\n\nAnnounced on May 23, this decision came amidst legislative efforts to define the regulatory roles of the SEC and the Commodity Futures Trading Commission in the crypto industry, with the Financial Innovation and Technology for the 21st Century Act still pending in the Senate."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxNeV9Xa1pVWWNHek1LN0J3ZjFwc1NqdkFHZHJzZTF4T25QYTZMY1VjWUJ0ZUdSR3NxWEhubFcyT01FY2xyQ0pPdkdkMUlfT2JkTHl6dVlKc1VpUjhZVUJJT3VYUlBnVzhBLVFPU1pwR2t5Ymx0NWpsaGRucFJCUk13TldOaU5zellqVWZ4UDgtYVNSbHFaVld1cW1CQ2M4R0ZCb0hXT1E0OFFKcmd4Y2stMG9B?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Jun 2024 07:00:00 GMT",
        "title": "Ethereum gets huge win as SEC closes investigation into securities sale allegations - CryptoSlate",
        "content": "The SEC has closed its investigation into Ethereum 2.0, determining that sales of ETH are not securities transactions. The decision comes after a letter from Consensys on June 7, seeking clarity following the May approvals of ETH ETFs, which were based on ETH being classified as a commodity. Consensys stated,\n\n“Today we’re happy to announce a major win for Ethereum developers, technology providers, and industry participants: the Enforcement Division of the SEC has notified us that it is closing its investigation into Ethereum 2.0. This means that the SEC will not bring charges alleging that sales of ETH are securities transactions.”\n\nEthereum rose over 4% overnight following the news, pulling the rest of the crypto market with it as many projects positive over the past 24 hours. Bitcoin is the notable exception, down 0.74% according to CryptoSlate data as of press time.\n\nConsensys announced this development as a significant victory for Ethereum developers and the broader industry. The closure of the investigation signifies a pivotal moment for the Ethereum community, providing a reprieve from potential regulatory actions that could have categorized ETH as a security. The SEC’s decision aligns with the Commodity Futures Trading Commission’s (CFTC) stance, which has consistently classified ETH as a commodity.\n\nDespite this positive outcome, Consensys continues its legal battle against the SEC to secure further regulatory clarity. The company argues that the SEC’s enforcement actions against blockchain developers and technology providers have been overly aggressive and unlawful. Consensys’s lawsuit also seeks a declaration that offering user interface software like MetaMask Swaps and Staking does not violate securities laws.\n\nAs Consensys emphasized, the legal fight is not just about Ethereum but about safeguarding the future of blockchain innovation in the United States. The SEC’s stance on Ethereum had posed a risk to adopting and developing blockchain technologies, with potential negative implications for US leadership in this sector. By challenging the SEC’s authority, Consensys aims to prevent what it describes as an unlawful power grab that could hinder technological advancements and economic opportunities.\n\nThe resolution of the Ethereum investigation marks a critical juncture, but Consensys insists that the broader regulatory environment still requires significant reform. The company’s lawsuit highlights the need for clear guidelines that support innovation while ensuring compliance with existing laws. As the blockchain industry evolves, resolving these regulatory issues will be crucial in determining the pace and direction of technological progress.\n\nAccording to Consensys, fighting for regulatory clarity is essential to ensuring blockchain technology continues growing and contributing to the economy. The company’s actions reflect a broader concern within the crypto community about the need for balanced regulation that fosters innovation without stifling growth.\n\nIndustry participants and regulators alike will closely watch the outcome of Consensys’s ongoing legal battle with the SEC. The case highlights the tensions between regulatory oversight and technological innovation, a dynamic that will shape the future of blockchain technology and its applications.\n\nMentioned in this article"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxNQ1YxNldJTURIdFhuTnNoUlZsckZuYWtQNkhyRWdZZ3N4a2NMZ1hCYS1CWU1lakJVeE9Ia3p6cEw3bFhEQU9JaExkcl9TcTRBVkJoLW9ma2J2T29ocVprRm1sZ0ZpRDF1V19jZi1tTVgydG55Vk5uM1dtdVRvTW44enlkb01vVzBNb0NB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Jun 2024 07:00:00 GMT",
        "title": "Investing Smart: Ethereum’s ETF Progress, Bitcoin’s Decline, and Furrever Token’s Rewards - Yahoo Finance",
        "content": "Furrever Token\n\nNew York City, NY , June 19, 2024 (GLOBE NEWSWIRE) --\n\nAs the cryptocurrency market evolves, investors are constantly seeking smart investment opportunities. The latest developments show Ethereum making significant strides with its ETF progress, while Bitcoin experiences a decline in dominance. Amid these changes, Furrever Token presents a unique and rewarding investment option.\n\nEthereum’s ETF Progress\n\nEthereum has been gaining traction with its exchange-traded funds (ETFs), surpassing Bitcoin in terms of performance and investor interest. The approval and launch of Ethereum ETFs have sparked optimism among investors, positioning ETH as a strong contender in the crypto market. This progress reflects the growing confidence in Ethereum’s long-term potential and its robust decentralized finance (DeFi) ecosystem.\n\nBitcoin’s Decline\n\nBitcoin, the pioneer of cryptocurrencies, has seen its dominance drop to 56%. This decline suggests that investors are diversifying their portfolios and exploring other promising assets. While Bitcoin remains a significant player, its reduced market share highlights the expanding landscape of digital assets and the potential for altcoins to gain prominence.\n\n\n\n\n\nFurrever Token: A Smart Investment Choice\n\nIn the midst of these market dynamics, Furrever Token (FURR) offers a unique and engaging investment opportunity. Designed around cute cat-themed imagery, Furrever Token aims to create a fun and community-driven ecosystem. Here’s why investing in Furrever Token during this period is a smart move:\n\nInnovative Referral System\n\nFurrever Token’s referral system allows users to earn 10% in FURR tokens for every deposit made through their personal referral links. This system incentivizes community growth and provides a source of passive income. By sharing referral links with friends, family, and social networks, users can actively contribute to the project’s expansion while reaping financial rewards.\n\nAttractive Tokenomics\n\nFurrever Token’s tokenomics are designed to ensure security and trust within the community. With a total supply of 9 billion tokens, 65% are allocated for the presale, 25% for decentralized exchanges (DEXs), and 10% for the team, locked for one year. The presale has already raised over $1.3 million, currently in its 9th stage, with the potential for up to 15X returns for early investors. The current price of Furrever Token is $0.000732, presenting an attractive entry point for those looking to invest in a project with both financial and emotional rewards.\n\nCommunity Engagement and Future Growth\n\nFurrever Token places a strong emphasis on community engagement. The project’s mission is to create a fun, user-friendly environment where investors can enjoy their experience while contributing to the growth of the ecosystem. Regular challenges, exclusive cat-themed content, and active community interaction make Furrever Token an appealing choice for both seasoned investors and newcomers.\n\nStory continues\n\nConclusion\n\nAs Ethereum’s ETF progress and Bitcoin’s decline reshape the cryptocurrency market, Furrever Token offers a refreshing and rewarding alternative. Its unique referral system, attractive tokenomics, and strong community focus make it a smart investment choice during this period of market transformation.\n\nInvesting in Furrever Token not only provides potential financial returns but also an enjoyable experience within a vibrant and supportive community. Don’t miss out on the chance to be part of this exciting project—visit furrevertoken.com to join the presale and create your referral link today.\n\n\n\nJoin Furrever Token Presale Now:\n\nFurrever Token Official Website\n\nVisit Furrever Token Presale\n\nJoin Official Telegram Group\n\nFollow Official X Account\n\n\n\nMedia Contact:\n\nRobert Smith\n\nhttps://furrevertoken.com/\n\nsupport (at) furrevertoken.com\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\n\n\n\n\nCONTACT: Robert Smith support (at) furrevertoken.com\n\n\n\n"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxQQnBEaUxOR180djVyc1ZkVWNtREY5U1JlWlVuazRMTEZzcVhmcmxpN2FZNzdSbGg4U3djSjZMWG9uVi1JczdJZ1NtVThpZ2lWeU1KcHVQa19LcUpVTzhpOUZYSjNYLV9INjJYVS1iTmZqX2ZlRzloNnJCS3NWU0xXTEtEb9IBiwFBVV95cUxQelROeXFVUlpHN2ZCX245RFhnNEVvSmsxOXk4UmMtamhpd08wc3FEYndfSkNBcGVQUDMzcF9hVXlJSnN2a3FVeTRZX1ViWkJ4ZEd3V0c1M3BuaXBRQkVCRlB4SnJ6dHFJMk0xY3RVa0RDUVVIYVZUdmhURkFseDNweWQ2Vm0wc0ZSX2Rr?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Jun 2024 07:00:00 GMT",
        "title": "Are Solana and Polygon Safe Now That SEC’s Ethereum Investigation Is Over? - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIf the SEC is no longer investigating Ethereum, does that mean other similar cryptocurrencies are off the hook?\n\nThe U.S. Securities and Exchange Commission on Tuesday informed Ethereum software company Consensys that it has dropped its investigation into “Ethereum 2.0,” referring to the blockchain network’s transition to proof of stake nearly two years ago.\n\nThis combined with the SEC’s approval of Ethereum ETFs for trading in the U.S. has been widely perceived as an admission by the Commission that Ethereum is not a security, which in turn could mean that other proof-of-stake coins like Solana and Polygon are also not securities. But legal experts who spoke with Decrypt have warned against thinking in such black and white terms.\n\n“I expect that the letter has little to no impact on the legal classification of other [proof-of-stake] coins,” Drew Hinkes, an attorney who specializes in digital assets, told Decrypt. “Those other tokens were presumably not investigated in the investigation of Ethereum 2.0 and their facts as to creation, distribution, etc. are likely different from those of Ethereum.”\n\nAD\n\nAD\n\nConsensys sued the SEC earlier this year in a preemptive move after receiving a Wells Notice, which typically indicates the regulator intends to bring an enforcement action. (Disclosure: Consensys is one of 22 investors in Decrypt.) In its lawsuit, Consensys revealed the SEC has been operating under the assumption that Ethereum is an unregistered security for at least a year, partially because of the network’s switch to proof of stake.\n\nProof of stake refers to a system in which cryptocurrency network users pledge their assets—in this case ETH—in order to participate in validating transactions and securing the network. Users who stake are then rewarded in ETH for their trouble, with yields ranging from 1% to 4% APY, depending on the staking platform.\n\nEthereum, which once operated much more like the energy-intensive Bitcoin blockchain, completed its transition to proof of stake in September 2022 after a years-long process. At the time, questions immediately arose as to whether staking could implicate federal securities laws in the United States. SEC Chair Gary Gensler said he believed staking could run afoul of the law because “the investing public is anticipating profits based on the efforts of others,” according to the Wall Street Journal.\n\nThe SEC has now apparently changed its view. But even if the Commission is no longer investigating Ethereum, it could proceed differently with other tokens, says Hinkes, according to the manner in which those specific assets were initially sold. The SEC may also consider factors like the state of the technology, the mechanics of its block validation, and more, according to the attorney.\n\nAD\n\nAD\n\nMatt Corva, a lawyer for Consensys, seemingly concurs, posting yesterday on Twitter: “We don't know [if Polygon, Solana, or other coins are securities] because the SEC has evaded showing their homework on precisely why they've now concluded that Bitcoin and Ethereum are not securities,” he tweeted. “We don't know the specifics of import for other coins.”\n\nNot all companies can spend millions of dollars and thousands of hours dealing with an unlawful investigation - and they shouldn't need to. We know Bitcoin is not a security and we know Ethereum is not a security. What about Polygon, or Solana, or any other coin? — Matt Corva (@MattCorva) June 19, 2024\n\nOther legal experts are similarly befuddled by the SEC’s opaqueness.\n\n“The SEC was very careful in the language it used in its letter,” crypto criminal defense lawyer Carlo D'Angelo told Decrypt. “Without a more specific statement from the SEC, or a definitive ruling from a court, it remains unclear how the agency views ETH and other [proof of stake networks].”\n\nWhile the end of the Ethereum investigation might not be a carte blanche for proof-of-stake coins, one expert believes it’s a good building block.\n\nSebastian Heine, head of risk and compliance at institutional staking company Northstake, claims it does “strengthen” some cases, but every coin is “too individual” to make sweeping statements. “The SEC is still very crypto negative so there shouldn’t be any high expectations from the SEC acting favorably towards other proof-of-stake coins,” he said."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxPVGF3RGFfVEl2T3FzX0g4WDdZNG84Vk84TWhtUjQtTkFkdjd1MWZIVTgzOUs1ZF8tbTIyUEZLMVE5SUdFeVN4SHhEbUU4MURqUGg1SmFYM05Fa0FpNzlzLTFXYzVPVHROZDV1MlBEUWJqT0tNcUVwNy1FZE1uemRUYUpacG5uNDZQWjIwcnNMSi1HLUxHenhLRWFn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Jun 2024 07:00:00 GMT",
        "title": "Move chains and Ton are outpacing Ethereum rollups and Solana, says Coinbase - DLNews",
        "content": "After adjusting for this year's rally in crypto prices, TON, Aptos, and Sui have grown faster than other blockchains in terms of TVL since January.\n\nArbitrum and Optimism, meanwhile, have seen outflows despite a jump in active addresses.\n\nA trio of blockchains born in the post-Terra “crypto winter” have been the fastest risers of 2024.\n\nAfter adjusting for this year’s rally in crypto prices, The Open Network associated with messaging app Telegram, or TON, along with Aptos and Sui, a pair of blockchains based on the Facebook-built Move programming language, have grown faster than rivals.\n\nThat’s according to Coinbase analyst David Han, who compared the boom to competitors including Solana, Ethereum, and major Ethereum rollups.\n\nAdjusting for price “helps to isolate how much TVL growth arises from net new value creation instead of pure price appreciation,” Han wrote in a mid-year review on the industry.\n\nTotal value locked is a metric that tracks the value of crypto deposited in blockchains’ myriad DeFi applications.\n\nTON launched in December 2022. Aptos and Sui went live in October 2022 and May 2023, respectively.\n\nBase was the lone Ethereum-based rollup to outperform aggregate TVL growth, said Han. Crypto deposited in Arbitrum and Optimism, two of the longest-running rollups, has declined since the start of the year.\n\nNevertheless, these blockchains have benefitted from Ethereum’s March upgrade, dubbed Dencun. That upgrade made it far cheaper to use rollups.\n\nJoin the community to get our latest stories and updates\n\nEven as the dollar value of crypto deposited in rollups hits all-time highs, total transaction fees they have collected has plummeted since the upgrade, according to Han.\n\nMoreover, rollup users “have grown tremendously … as fees have dropped post [Dencun],” Han notes — particularly on Arbitrum.\n\nTON’s growth\n\nTON’s massive rally this year coincides with the deployment of Tether’s USDT stablecoin on the blockchain in April.\n\nThe TON blockchain has a crypto wallet integrated into the Telegram messaging app, allowing users to send USDT to their contacts worldwide directly from the app.\n\nThat’s not the only incentive the TON team introduced to promote USDT adoption on the network.\n\nUsers who store USDT on their Telegram mobile wallets can earn up to 50% annualised yields ― much higher than the average DeFi interest rate offered by lending protocols.\n\nThe yield comes from TON token rewards for providing liquidity on major decentralised exchanges on the blockchain.\n\nBut the network hasn’t been able to attract established DeFi projects to deploy their protocols on the chain.\n\nAleks Gilbert is a DeFi Correspondent at DL News. Got a tip? Email him at aleks@dlnews.com."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMia0FVX3lxTE1zZ09EaGtEQ1h5Sm1DNDl6ZDhJQlVaNjl3MVM5VkF0UnB1Ni03NGtDdjZTcDNWMnk0aFlGcXV2VERJN0tRelVHVG9MdTVZWjNwRzlhZEYxTGlaaXdWQlBmOU5KUjZyMzZMNk800gFzQVVfeXFMUDB3Y19XYWFkQmZOVW4zNm1pSDAxaHNZd1IyQmw5ejBLYXlxX1d1TTY3LWtEbWkyZTZlcmxnbzFQTVpDTWtqaklyZ29lemVJNEtaWkRQV2hxNWY4YjdXdXVEX0U4bHpvLWc4U1ZLZ3VOLVJjOA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Preps for Primetime With TV Commercial Ahead of ETF Launch - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe second wave of the crypto ETF marketing blitz has officially begun, with crypto index fund manager Bitwise releasing a “national TV ad” on Thursday talking up the Ethereum network.\n\n“Unlike Big Finance, Ethereum doesn't clock out at 4pm,” the company wrote in a tweet on Thursday with an accompanying video.\n\nUnlike Big Finance, Ethereum doesn't clock out at 4 p.m. pic.twitter.com/0gCJi3wlXp — Bitwise (@BitwiseInvest) June 20, 2024\n\nAD\n\nAD\n\nThe 40-second commercial featured an old man role-playing as the traditional stock market that’s only “awake” from 9:30am to 4pm, contrasted with a young man representing Ethereum—a blockchain that never goes offline.\n\n“Stablecoins, NFTs, loans... people can access me 24/7,” the young man tells his elder. “You’ll get after it again on Monday.”\n\nFollowing the post, Bitwise revealed that it had minted the video as an NFT on the Ethereum blockchain. Half of the ad’s proceeds will go directly to the commercial’s two actors.\n\nThe simple, short pitch mirrors that of the array of Bitcoin ETF commercials that hit the airwaves late last year. Promoters like Galaxy Digital said Bitcoin “embodies empowerment in the digital age,” while HashDex pitched it as the next “disruptive innovation” in financial technology after the credit card.\n\nBitwise was also the first of many issuers to run a Bitcoin ETF ad at the time, recruiting help from Johnathan Goldsmith—the most interesting man in the world.\n\nAD\n\nAD\n\nThat influx of ads preceded the Bitcoin spot ETF rollout that occurred roughly a month later, attracting billions of dollars in investments. As of today, expert analysts believe Ethereum ETFs are weeks away from going live, with Bloomberg ETF analyst Eric Balchunas forecasting a simultaneous launch on July 2.\n\nGrayscale ran a TV commercial about Ethereum in March in support of its existing $10 billion Ethereum Trust (ETHE), which it intends to convert into an Ethereum ETF. However, Bitwise's ad is the first to go out for a proper Ethereum ETF after regulators officially approved them for public trading in late May.\n\nWhile no other Ethereum ads have emerged yet, future ETF providers have been talking up the asset’s investment thesis. Much like Bitwise, VanEck in early June pitched Ethereum as a new and improved set of global financial rails, forecasting that ETH would hit $22,000 by 2030.\n\nLikewise, Bitwise CIO Matt Hougan posted a thread on Thursday arguing why investors may want to diversify into Ethereum alongside Bitcoin.\n\n“Adding ETH to a portfolio over a full crypto market cycle has historically boosted both your absolute and risk-adjusted returns compared to adding BTC only,” said Hougan.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxOMUJNUmI0ZFRDMTRWVXl1UzQ4YXJvandYd28tX1o5a0s2b1BsRmIzOUQ2Qm82cVZhbG45blhrUmtkekZHQ3lFTmFkQXUzMzFVSEZaejVXQml6UmpHeVRhRHl5YXFRU2cxdGlUVHdta0ZoYkZXRXFQYzk4dnlobFVYZ2dzTk9pOHZqSnV6SXdlWkVBNU1ud2FvRWVmUTdLTnRTZzVNMC0yeVFrMVlxemtRRTFoOHdKTGszZXNvQ3JZa0xuSW1pczQ00gHMAUFVX3lxTE1NOEE5NWF1RmswS1ZtR3JFLTRVZzhteEFnczRJdHRPbkFleUxLeUQ5REt5eEpGXzI3ZGZQeXlFVGtTcEpTNTQ2X0VGR3kya2RWeHJ3ZEdYYTZDRlpjTmZzbzV5TDJJSkNOZzlzZ0JaN3hTOUVIT044SGwwaEMtMnJhR2ZFeDFWbWhaVXZGa01VRFBDcUg4SjNzMkFiYUlJU05pVkgtZzIzeUk1ZHpWYndMQXpaSFhlMW8wSllkb2RrTTBVWDRoZXRxSnNudg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Jun 2024 07:00:00 GMT",
        "title": "Ethereum ETFs may not cause upward surge in ETH price as many expect - FXStreet",
        "content": "Ethereum ETF issuers are expected to file updated S-1s before weekend following Bitwise filings.\n\nSEC didn't explicitly declare ETH a commodity despite closing Ethereum 2.0 investigation.\n\nEthereum's increased implied volatility may be misleading as institutions may employ similar cash-and-carry arbitrage strategy when spot ETH ETFs launch.\n\nEthereum's (ETH) price increased over 4% in the past 24 hours after the Securities & Exchange Commission (SEC) dropped its Ethereum 2.0 investigations amid expectations of spot ETH ETFs. However, the recent excitement surrounding ETH ETFs may not lead to the expected price increase.\n\nDaily digest market movers: Bitwise files updated ETH ETF S-1, SEC drops Ethereum 2.0 investigation\n\nBitwise filed an updated S-1 draft for its spot ETH ETF with the SEC after the agency commented on issuers' initial S-1 filings last week. The filing disclosed that asset manager Pantera Capital will purchase $100 million of the ETF shares when it launches.\n\nAlso read: Global Ethereum ETFs experience surge in net inflows as Hashdex files for combined spot ETH and Bitcoin ETF\n\nBloomberg analyst Eric Balchunas had earlier shifted his over/under date prediction for when ETH ETFs will launch to July 2 after saying he heard that the SEC's first round of comments on the S-1s were \"light\" and \"nothing major.\" He also mentioned that the agency expects issuers to return these drafts before the end of the week with a decent chance of working to declare them effective next week.\n\nMeanwhile, Ethereum infrastructure provider Consensys announced that the SEC's enforcement division is closing its investigation into Ethereum 2.0, meaning that the agency \"will not bring charges alleging that sales of ETH are securities transactions.\"\n\nConsensys disclosed that the decision comes after it sent a letter to the SEC on June 7 asking whether the approval of spot ETH ETFs on May 23 indicates the agency would end its Ethereum 2.0 investigation.\n\nRead more: Ethereum survives SEC scrutiny: Enforcement division closes investigation into Ether, Consensys says\n\nHowever, the SEC's letter to Consensys didn't confirm whether it was concluding that ETH is a commodity. SEC Chair Gary Gensler also failed to give a direct answer when questioned if ETH is a commodity in a Senate hearing last week.\n\nFortune earlier reported that the SEC began investigating the Ethereum Foundation and several Ethereum-related firms based on ETH's potential security status.\n\nETH technical analysis: Could Ethereum's price fail to rise following ETF launch?\n\nEthereum is trading around $3,557, up more than 4% in the past 24 hours. Total ETH liquidations in the past 24 hours are at $34.37 million with $22.34 million in short liquidations exceeding those of longs.\n\nETH implied volatility (IV) rose to 65% in the front end after its price rebounded following the latest developments discussed above, according to QCP Capital analysts. Implied volatility measures how much the market expects the future price of an asset or options contract to change over a certain period.\n\n\"Despite uncertainty surrounding the reception of ETH ETFs, capturing 10-20% of BTC ETF flows will propel them above $4,000, nearing its peak of $4,800,\" noted the analysts.\n\nAlso read: Ethereum resumes downtrend as Canada sees another staked ETH ETF launch\n\nHowever, Amberdata's director of derivatives, Greg Magadini, believes the current excitement surrounding spot ETH ETFs and its expected impact on the price of ETH may be unfounded.\n\n\"I continue to remain skeptical that this relative volatility premium remains persistent. A lot of cold water was splashed on the BTC ETF inflows narrative, given the speculation that funds are merely trading the BTC basis as opposed to taking outright ETF exposure,\" wrote Magadini.\n\nThe statement follows a stalemate in Bitcoin's price despite record ETF inflows after reports that hedge funds are employing a cash-and-carry arbitrage strategy on the top digital asset. Typically, hedge funds gain spot exposure to Bitcoin through spot BTC ETFs and then short its equivalent futures contract, profiting from its higher futures premium and funding rate fees.\n\nMagadini expects institutions to employ a similar strategy with ETH ETFs when they go live, potentially triggering a sideways price movement for the number one altcoin.\n\nHe also pointed to the Chicago Mercantile Exchange's (CME) Ethereum open interest (OI) compared to Bitcoin.\n\n\"The true resolution to this question [about persistent of [E]ther vol premium] comes when we see the actual ETF inflows and volume. If this looks anything like the CME OI between BTC futures and ETH futures, I think ETH still doesn't have the mainstream enthusiasm that BTC has seen,\" noted Magadini.\n\nETH/USDT 4-hour chart\n\nAs of the time of writing, Ethereum CME OI is at $1.32 billion, while Bitcoin's figure is $10.14 billion.\n\nA breakout above the $3,900 resistance could see ETH beat this cycle's current high of $4,000 and rally to a new all-time high above the $4,878 price level. However, a breach below the $3,300 support may send ETH crashing to lows around the $2,852 level."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxOZ09xc29zMmlQNFc2X0pLZUx5bFV6NXVZdWszMU9UYkFpMENMb2hrLXdqUVVYN2NIV2U3SkZvRWM3Q1J0Q0lFazc1V2FiOXVTNXdpMllUR1U2VDhfcHZJc0ZUSTgwcnpFS2dzeFMxVzhXdUswMDlVcHpVdm54ZjVMUl8yLUtRMWRZTFN5cnhGVzlqT2J0Q0NjMHd4R3VwZ2ZV0gGoAUFVX3lxTFByTTk3anlfMllBQ1lCM2dYOExnX2k3OGRCZzJleFItaVFkQ3ZLSXZDejZEUHZOUmE2dDBrUjZUSUxrYXpFb01VdTEzZENCTXpiSHpROHJiZjc5c0RmclZ2VkZNNjc1UVNGa1NOY185TnB3WXZ4QzY4SlNtMHpQakhyYVlnRHdkU2NtNHhpdTI1SF94Y3J3d2t0UDJNNW9FaERHQVBZVzRmUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jun 2024 07:00:00 GMT",
        "title": "Atari Revives Its Classic ‘Breakout’ Game on Ethereum Layer-2 Base - Decrypt",
        "content": "Create an account to save your articles.\n\nCreate an account to save your articles.\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nLegendary game publisher Atari is back with its next augmented version of a classic video game, this time bringing the 1976 classic Breakout to Coinbase’s Ethereum layer-2 network Base.\n\nAs a part of Base’s “OnChain Summer,” players can compete against others for a top spot on the Atari Breakout leaderboard. The players with the highest scores will have a chance to win weekly prizes, including a retro 2600+ game console, gift cards, and more.\n\n🔆 OᑎᑕᕼᗩIᑎ ᔑᑌᗰᗰEᖇ 🔆 The Onchain Arcade is back with @Atari Breakout® Compete for a top spot on the leaderboard and get the chance to win weekly prizes, all summer long Built with @stackdotso, @msenyil, and @mx1000m, mint proceeds are distributed to the developers… pic.twitter.com/OHTVVpAyMA — Base (@base) August 9, 2024\n\nAD\n\nAD\n\nAtari first announced the partnership with Base in July, with the release of the blockchain-based version of their iconic Asteroids video game, in which players operate a simple spaceship and destroy asteroids to progress.\n\nIn Breakout, designed by Atari co-founder Nolan Bushnell and a pre-Apple Steve Wozniak, players use a paddle and ball to blast through brick walls.\n\n“Enter Degen, Bitcoin, and Higher modes by shooting special bricks,” Atari said of the latest release. “Points double for 10 seconds!”\n\nAs with Asteroids, players will need to connect their Coinbase, MetaMask, Rainbow, or WalletConnect wallets to play and mint a Breakout NFT for 0.0015 ETH, or around $3.60.\n\nProceeds from the mint will be distributed to the developers and artists behind each game, Base said.\n\nAD\n\nAD\n\n“All scores are logged on-chain, and from there, it gets pretty fun,” Atari director Tyler Drewitz said on a Base Twitter stream in July. “There’s a weekly leaderboard, and we have an overall leaderboard with some pretty big prizes.”"
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxPeWx3UFB1UTRaZXRUZkVscnBMZnR4cFVFM0tlTk9QdV9zaEliUlVFRVBTTDUteHF0WXdiSzZZMFYya05HZDdPU2lZRElHYXpWOU1FdnliS21qZkhxclNpb2ppUXRTbTFDQXFiSU85bUZsZXBfb0hTcmtna2lKN0FjckJZN1U3TXpQbnRnRA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jun 2024 07:00:00 GMT",
        "title": "Ultimate Crypto Guide: Bitcoin, Ethereum, and Furrever Token with Cutting-Edge 10% Referral Bonuses - Yahoo Finance",
        "content": "Furrever Token\n\nNew York City, NY, June 20, 2024 (GLOBE NEWSWIRE) --\n\n\n\nAs we look to the future of cryptocurrencies, Bitcoin stands strong as a market leader, while Ethereum continues to captivate meme coin enthusiasts. Now, Furrever Token is poised to join the fray. This article examines what Furrever Token brings to the table alongside these giants.\n\nBitcoin Price Proceeds To Fall As Whale Activities Deepen\n\nBitcoin's price fell underneath $65,000 on Wednesday taking after Expanded whale exercises that will be offered orders. In the interim, hedge funds have experienced a drag in their Bitcoin introduction, which may be fueled by steady surges among Bitcoin ETFs.\n\nEthereum ETFs May Not Cause Upward Surge in ETH Price As Numerous Anticipate\n\nEthereum's (ETH) price expanded over 4% within the past 24 hours after the Securities & Exchange Commission (SEC) dropped its Ethereum 2.0 examinations in the midst of desires of spot ETH ETFs. In any case, the later energy encompassing ETH ETFs may not lead to the anticipated price increase.\n\n\n\n\n\nFurrever Token Stands Out with Innovative 10% Referral Program\n\nFurrever Token's presale has as of now raised over $1.3 million, with the venture right now in arrange 9 and pointing for an add up to of $1.9 million.\n\nFurrever Token offers a delightful client involvement centered around cat-themed symbolism and community-driven engagement. The unused referral framework permits clients to earn 10% in $FURR Tokens for each store made through their individual referral connection, making a fabulous opportunity for passive income. This framework not as it were incentivizes users but too cultivates natural community development.\n\nSupported by a comprehensive review from Securi Lab, Furrever Token guarantees a secure and reliable stage for its clients. The project's guide incorporates progressing integration of cat-themed substance and energizing future shocks, situating it as an interesting and agreeable speculation within the crypto space.\n\nDon't lose your opportunity to include Furrever Token to your venture portfolio and be prepared for the setup to rule the meme coin sector. Visit www.furrevertoken.com to secure your tokens and be a part of this crypto space.\n\n\n\nJoin Furrever Token Presale Now:\n\n\n\nFurrever Token Official Website\n\n\n\nVisit Furrever Token Presale\n\n\n\nJoin Official Telegram Group\n\n\n\nFollow Official X Account\n\n\n\nMedia Contact:\n\nRobert Smith\n\nhttps://furrevertoken.com/\n\nsupport@furrevertoken.com\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\nStory continues\n\n\n\n\n\nCONTACT: Robert Smith support at furrevertoken.com\n\n\n\n"
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxOdllhTEFZREZTcE16MWJuOUZaUDR3WEs1SGtDVEVLTmJ5MnNxb2FIczQ5d1QxcFlFSl9icVFPNWVJUEYyM0dxWmdkTm9INlJmd09kUmZDaW9GWjVvLWE2TXAydElaWEsyd1JjcGhvTkJrWERqNUd3QTllUkMydFZ4cEF3SW1NRG_SAYwBQVVfeXFMTVRNUTFkdzExc0F5ZjlVVWpOSTVNRXo0bDlIeEZjeWV1V0pYa3JSS2VkbHBxX1BCUEhlWFktcWlheFIyalV4NUh6Mjlld0dPbjM2VDR2anpOVmswMzBXR25fYldRS2o3WVZlRWY1QU1YSC1mUDJSOUhsZmxySXJjZkhTQUJZT0RXNno4UTc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Jun 2024 07:00:00 GMT",
        "title": "SEC – Ethereum 2.0 investigation closes: ‘Silly to begin with…’ - AMBCrypto News",
        "content": "The SEC has backed down on its Ethereum investigation.\n\nThe community slammed the Howey test.\n\nThe U.S. Securities and Exchange Commission is reportedly ‘closing’ the investigation into Ethereum [ETH] 2.0 and ConsenSys, the firm behind Meta Mask wallet.\n\nReacting to the update, ConsenSys stated it has ‘survived SEC’ and marked a win for ETH developers.\n\n‘Ethereum survives the SEC. Today we’re happy to announce a major win for Ethereum developers, technology providers, and industry participants: the Enforcement Division of the SEC has notified us that it is closing its investigation into Ethereum 2.0.’\n\nEthereum 2.0 refers to the post-Merge era, when the network changed from PoW (proof of work) to PoS (Proof of Stake). Clarifying the impact of the update on ETH sold post-Merge, the firm added,\n\n“This means that the SEC will not bring charges alleging that sales of ETH are securities transactions.”\n\nSEC – Ethereum tussle, and community reactions\n\nIn April, Consensys sued the SEC for an “unlawful power grab,” accusing the SEC of going after it and its developers and classifying ETH as ‘security.’\n\nHowever, much has changed since the lawsuit, with an easing of the war on crypto and partial approval of spot ETH ETFs.\n\nSo, the SEC’s decision to back down from the investigation wasn’t much of a surprise. Part of SEC’s statement on the move read,\n\n“We do not intend to recommend an enforcement action by the Commission against your client, Consensys Software Inc., with respect to this investigation.”\n\nFor his part, Alexander Grieve, Government Affairs officer at Paradigm, suggested that the SEC’s letter was “unusual“ and “pretty evasive” regarding notification.\n\nHowever, the update brought up the Howey test debate again. The SEC typically uses the test to determine whether an investment product is a security.\n\nReacting to the SEC-Ethereum update, Paul Grewal, chief legal officer at Coinbase, commented,\n\n“Good. It was a silly theory of liability, to begin with…How do you explain both this decision and the other projects maligned by the SEC’s broken Howey analysis?”\n\nAnother analyst and tech investor, Fred Krueger, called the Howey test “a joke“ and suggested the decision was political.\n\nETH price action\n\nApparently, the update seems to have turned a previous headwind into a tailwind for major ETH investors.\n\nA few hours after the update, a whale scooped up $19.7 million worth of ETH. As of press time, ETH was up +3% in the past 24 hours and traded at $3.5K.\n\nAdditionally, the Open Interest (OI) rates were up 4%, denoting a substantial inflow of liquidity into the derivatives market and could give bulls a leg up."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxQNmkzZUJMdGZSSzU2aXpBNEpWc09IMWtESEpPY096bER4bUdqWkJaNm1Gdm1EcXZfR1QtZnl5RWtkcmJhV2hHMmdaNWJkSzIwaVdFbVRMM29MMmExQnRpUTFGUHZnaVpKMmZ4OUVISUxEN044dFBtX3cyVm5MNU8zaDJxS3dYcndPTERwbkdZSEdDdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Jun 2024 07:00:00 GMT",
        "title": "First Bitcoin, soon Ethereum. Here’s what the next crypto ETF will look like - DLNews",
        "content": "Hashdex filed for a dual Bitcoin and Ethereum ETF\n\nIf approved in its current form, it could form the basis for a crypto index.\n\nHashdex has already issued multiple crypto index funds in Brazil.\n\nA new kind of crypto exchange-traded fund may see the light.\n\nCrypto asset manager Hashdex has filed a dual Bitcoin and Ethereum ETF with the Securities and Exchange Commission.\n\nRight now, spot Bitcoin ETFs allow investors to bet on the performance of Bitcoin through their brokerage accounts.\n\nAnd the spot Ethereum ETFs, expected this summer, will do the same for Ether.\n\nBut the Hashdex dual fund, if approved, would enable investors to gain exposure to the two biggest cryptocurrencies by market value as a whole, without worrying about which one will outperform.\n\nThe move “makes a lot of sense,” Bloomberg Intelligence ETF analyst James Seyffart said in a post.\n\nSeyffart also noted that the application contained language that would allow Hashdex to add other cryptocurrencies to the fund down the line, if the SEC decides to approve them.\n\nThat would turn the fund into a kind of crypto index.\n\nJoin the community to get our latest stories and updates\n\nHashdex has already issued multiple crypto index funds in Brazil.\n\nIts Nasdaq crypto index contains Bitcoin, Ethereum, and nine other coins — Solana, Ripple, Cardano, Chainlink, Litecoin, Polygon, Avalanche, Uniswap, and Polkadot.\n\nBitcoin accounts for 65% of that fund, Ethereum for 25%, and Solana 4.6%. The other tokens have weightings of less than 1% each.\n\nHashdex also sports a DeFi index fund, a web3 index fund, and a metaverse index fund — each with at least a dozen cryptocurrencies.\n\n“Bringing something like this to the US makes complete sense as a future goal,” Seyffart said.\n\nHashdex is in the running, alongside eight other issuers, to launch a spot Ethereum ETF.\n\nIt also converted its Bitcoin futures fund into a spot Bitcoin ETF in March.\n\nThe SEC has until March 2025 to respond to the dual fund application.\n\nTom Carreras is a markets correspondent at DL News. Got a tip about Bitcoin ETFs and the Fed? Reach out at tcarreras@dlnews.com."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPSDZwTkh2dWs5S2xReklET1RHNy1IUXZfLTJWLWg5c2FhSEVZM3c2VHdfUWwwVU1vVVBJVFRaclBzZ3BlU1FZRlAxNWR2YVdkUmhUMUZ0RS14RDQ4OTFTYndjX0xMTWpWclcybTgtSXZudkFIVHNWZGFTbmQweEhGQVVLclhfcldo?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jun 2024 07:00:00 GMT",
        "title": "Shiba Inu ETF Speculation, Ethereum's $4K Potential, and Furrever Token's 10% Referral Award - Yahoo Finance",
        "content": "Furrever Token\n\nNew York City, NY, June 20, 2024 (GLOBE NEWSWIRE) --\n\nThe cryptocurrency advertise is energetic and ever-evolving, with certain tokens standing out due to their special advancements and promising prospects. As we move through 2024, Shiba Inu, Ethereum, and Furrever Token rise as the must-watch cryptos, each advertising unmistakable focal points and openings for financial specialists.\n\nShiba Inu (SHIB): Pointing for 3x growth\n\nShiba Inu (SHIB) is the driving ETH memecoin, continuing to advertise dominance in spite of Pepe's (PEPE) bullish runs. As one of the foremost prevalent animal memecoins, the dog-themed cryptocurrency is set to blow up within the moment half of the year as the Ethereum biological system skyrockets.\n\nIts bullish viewpoint is obvious in analysts' promising estimates, anticipating a 3x upswing some time recently as the shade closes on the year. This will broaden the hole between Solana memecoins and possibly beat trending memecoins like celebrity and president memecoins.\n\nAdvance contributing to its appeal is its low passage point—a budget-friendly altcoin. It may be a retail favorite as a result, which is able play a key part in its other bounce.\n\nEthereum Price Forecast\n\nConcurring to the most recent crypto news, the SEC might give the much-anticipated S-1 approval for spot Ethereum ETF on 2nd July. In the event that this happens, the Ethereum price forecast might ended up exceptionally bullish once the ETF goes live on conventional trades. Be that as it may, the savvy contract advanced resource ought to break out of the neighborhood bearish drift to begin with. This would cruel a recover of the $3,500 support level, as appeared within the taking after 4H chart.\n\nFurrever Token: Entry in the Crypto Market with 10% Referral Program\n\nIn the midst of the major players like Bitcoin and Ethereum, Furrever Token presents a revival and locks in turn to the crypto showcase. Outlined with a charming cat-themed environment, Furrever Token points to supply a delightful user involvement whereas advertising considerable monetary openings. One of its standout highlights is the modern referral program, which permits users to earn 10% in $FURR Tokens for each deposit made through their individual referral interface. This framework not as it were incentivizes community development but moreover makes a stream of inactive salary for users.\n\nThe continuous presale of Furrever Token has as of now raised over $1.3 million, with the extent as of now in arrange 9, pointing for an add up to of $1.9 million. Furrever Token's guide incorporates energizing future advancements, such as elite charming cat substance, guaranteeing nonstop engagement and rewards for its community. The project's commitment to security, approved by an audit from Securi Lab, assists in enhancing its credibility.\n\nStory continues\n\nDon't lose your opportunity to include Furrever Token to your venture portfolio and be prepared for the setup to rule the meme coin sector. Visit www.furrevertoken.com to secure your tokens and be a portion of this energizing meander.\n\n\n\nJoin Furrever Token Presale Now:\n\n\n\nFurrever Token Official Website\n\n\n\nVisit Furrever Token Presale\n\n\n\nJoin Official Telegram Group\n\n\n\nFollow Official X Account\n\n\n\nMedia Contact:\n\nRobert Smith\n\nhttps://furrevertoken.com/\n\nsupport@furrevertoken.com\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\n\n\n\n\nCONTACT: Robert Smith support at furrevertoken.com\n\n\n\n"
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxPUGlmczc2bVdOX1FzRXVwZUllNmRVT0xUMDJtbkJHcGN0QnZ3QTNMbDREZVVMb0lfWGtORWw2SjhOdzZDNzRKNXp1WUhnckkwNUxOSG5xQ0gzWHBLblZZbjNjNGE0SUpVeFRrZTI2QnU3d2oyVkdqU0w4bENYQjk0eUdrTXNmalNTVmRZQWFMVUl0ZjVCT0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jun 2024 07:00:00 GMT",
        "title": "Comparing Avalanche and Ethereum: Which One Is Better? - Modern Diplomacy",
        "content": "Blockchain technology is developing quickly with several platforms springing up to meet the numerous demands and difficulties in the decentralized ecosystem. Among these, Ethereum and Avalanche stand out as two of the most prominent and innovative blockchain networks.\n\nDedicated platforms like Coindataflow.com offer a comprehensive analysis of cryptocurrencies, including Avalanche price predictions. Developers, businesses, and investors can access complete information on prices, market capitalizations, charts, and statistics for both Avalanche and Ethereum. To find out which one is better, you should read the article below where we compare Avalanche and Ethereum.\n\nThe Basics of Ethereum\n\nEthereum, launched in 2015 by Vitalik Buterin, is a distributed platform that enables developers to build and deploy smart contracts and decentralized applications (dApps). It introduced the concept of a programmable blockchain, allowing for the creation of a wide range of applications beyond just cryptocurrencies. Ethereum’s native cryptocurrency, Ether (ETH), is the second-largest cryptocurrency by market capitalization, following Bitcoin.\n\nKey Features of Ethereum:\n\nSmart Contracts : The platform’s primary innovation is its ability to execute smart agreements, self-executing contracts with the terms directly written into code.\n\n: The platform’s primary innovation is its ability to execute smart agreements, self-executing contracts with the terms directly written into code. Ethereum Virtual Machine (EVM) : The EVM allows developers to run code on the Ethereum network, ensuring compatibility and security across all dApps.\n\n: The EVM allows developers to run code on the Ethereum network, ensuring compatibility and security across all dApps. Decentralized Finance (DeFi) : The platform is the backbone of the DeFi movement, hosting numerous financial services, such as lending, borrowing, and trading without intermediaries.\n\n: The platform is the backbone of the DeFi movement, hosting numerous financial services, such as lending, borrowing, and trading without intermediaries. Wide Adoption: With a large developer community and numerous projects built on its platform, Ethereum boasts extensive adoption and a robust ecosystem.\n\nAvalanche: The Essentials\n\nAvalanche, launched in 2020 by Ava Labs, is a high-performance blockchain platform that aims to deliver unprecedented scalability, speed, and security. It utilizes a unique consensus mechanism called Avalanche consensus, which is a combination of Proof-of-Stake (PoS) and Directed Acyclic Graph (DAG) protocols. Avalanche’s native cryptocurrency, AVAX, has gained significant traction in the market.\n\nKey Features of Avalanche:\n\nHigh Throughput : Avalanche can process thousands of transactions per second (TPS), significantly higher than Ethereum’s current capacity.\n\n: Avalanche can process thousands of transactions per second (TPS), significantly higher than Ethereum’s current capacity. Low Latency : Transactions on Avalanche are confirmed in under a second, providing a seamless user experience.\n\n: Transactions on Avalanche are confirmed in under a second, providing a seamless user experience. Interoperability : Avalanche supports the creation of custom blockchains (subnets) that can interoperate with each other and other blockchain networks.\n\n: Avalanche supports the creation of custom blockchains (subnets) that can interoperate with each other and other blockchain networks. Eco-Friendly: Utilizing PoS, Avalanche is more energy-efficient compared to Ethereum’s Proof-of-Work (PoW) mechanism, which the latter plans to transition away from with Ethereum 2.0.\n\nComparison of the Crucial Aspects\n\nPerformance and Scalability\n\nWhen it comes to performance and scalability, Avalanche has a clear advantage over Ethereum. Avalanche’s consensus mechanism allows it to achieve a higher TPS and lower latency, making it more suitable for applications requiring fast and efficient transactions.\n\nEthereum’s current PoW mechanism limits its scalability, leading to network congestion and high gas fees during peak times. However, ETH’s upcoming transition to Ethereum 2.0, which will implement PoS, aims to address these issues and improve scalability.\n\nEcosystem and Adoption\n\nEthereum’s ecosystem is one of the largest in the blockchain space, with a vast number of dApps, DeFi protocols, and developer tools. The platform’s first-mover advantage has resulted in widespread adoption and a strong network effect.\n\nIn contrast, Avalanche is relatively new but has quickly gained traction due to its superior performance and flexibility. However, the adoption of Avalanche is growing rapidly, with many projects choosing to build on its platform due to its technical advantages.\n\nSecurity\n\nSecurity is a critical aspect of any blockchain network. Ethereum has a long track record of being a secure platform, although it has faced some high-profile hacks and vulnerabilities in the past. Its transition to Ethereum 2.0 is expected to enhance security further.\n\nAvalanche, with its novel consensus mechanism, also offers robust security features. Its PoS system reduces the risk of 51% attacks and ensures network stability.\n\nDevelopment and Flexibility\n\nBoth blockchain platforms offer flexible development environments. Ethereum’s EVM is widely used and well-supported, making it easier for developers to create and deploy dApps.\n\nAvalanche, on the other hand, offers more flexibility with its subnet feature, allowing developers to create custom blockchains tailored to specific use cases. This feature makes Avalanche an attractive option for enterprises and projects requiring specialized blockchain solutions.\n\nBottom Line\n\nDetermining which blockchain platform is better between two notable blockchain platforms ultimately depends on the specific needs and goals of the user. Ethereum boasts a mature ecosystem, extensive developer support, and a solid track record, making it a reliable choice for many projects. However, Avalanche’s superior performance, scalability, and flexibility make it a compelling option, especially for applications requiring high throughput and low latency.\n\nAs Ethereum transitions to Ethereum 2.0, the competition between these two platforms is expected to intensify, bringing further innovations and improvements to the blockchain space. For developers, businesses, and investors, both Avalanche and Ethereum offer unique advantages that can be leveraged to build the next generation of decentralized applications and services.\n\nCarefully consider the strengths and weaknesses of each platform. Thus you can make an informed decision on which one best suits your needs in the constantly changing domain of blockchain technology."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxOb2tHYWE1VzE1RW9KZzdFakJjU2ZjWXpscHJNZ2h2MEUxU1R1LW5FUi1oMmpLYzBsTFhyb2JmRWxDb0RaXzhJZlEtbDZBLWJLbHU5ZzZfSFFhRGFZZWgxczhsVk1MUWhwczd4UDFzY1VYY2pOa0ZhOEtJUjFSblZNdXRhdWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jun 2024 07:00:00 GMT",
        "title": "ChangeNOW Lists ZKsync's $ZK Token: Boosting Ethereum with Enhanced Scalability and Speed - Yahoo Finance",
        "content": "Kingstown, Saint Vincent and the Grenadines--(Newsfile Corp. - June 20, 2024) - ChangeNOW, a leading non-custodial cryptocurrency exchange platform, is thrilled to announce the listing of the highly anticipated $ZK token from ZKsync. Starting from June 19, users will be able to trade $ZK on the ChangeNOW exchange platform.\n\nFigure 1: ChangeNOW Lists ZKsync’s $ZK Token: Fast Transactions & Lower Fees for Ethereum Users\n\nAbout ZKsync and $ZK Token\n\nZKsync, developed by Matter Labs, is a pioneering Layer 2 scaling solution for Ethereum, leveraging zero-knowledge rollups to enhance transaction speed and reduce costs. Since its inception in 2019, ZKsync has been at the forefront of tackling Ethereum's scalability challenges, making it a popular choice for decentralized applications (dApps) and DeFi projects.\n\nThe $ZK token, which serves as the backbone of the ZKsync ecosystem, is designed to incentivize users, facilitate transactions, and secure the network. With features such as lower fees and faster transactions than the Ethereum network, $ZK aims to provide a seamless user experience on ZKsync-powered platforms.\n\nAirdrop Details\n\nThe $ZK token airdrop, set to launch on July 15, 2024, will distribute 17.5% of the total token supply, amounting to 21 billion tokens, to its users. The snapshot date to determine eligibility is June 30, 2024. Eligible participants include ETH holders, regular users of ZKsync, and those interacting with dApps built on ZKsync.\n\nListing of $ZK on ChangeNOW\n\nListing the $ZK token on ChangeNOW aligns with the commitment to offering users access to innovative and high-potential cryptocurrencies. ZKsync's technology and vision resonate with the mission to provide seamless and efficient trading experiences.\n\n\"We are excited to support ZKsync by listing the $ZK token on our platform,\" said Kate L, CMO of ChangeNOW. \"This listing reflects our dedication to bringing our users the best tokens in the market and supporting groundbreaking projects like ZKsync.\"\n\nTrading $ZK on ChangeNOW\n\nStarting June 19, users can exchange $ZK on ChangeNOW without the need for registration or limits, ensuring a fast and secure trading experience. Inviting all crypto enthusiasts to take advantage of this new listing and explore the benefits of $ZK.\n\nFor more information on the $ZK token listing, visit ChangeNOW's website.\n\nAbout ChangeNOW\n\nChangeNOW is a non-custodial cryptocurrency exchange platform offering fast, reliable, and user-friendly services for trading a wide range of cryptocurrencies. With a focus on security and customer satisfaction, ChangeNOW provides a seamless exchange experience without the need for registration or limits.\n\nStory continues\n\nStay connected for more updates and announcements.\n\nChangeNOW\n\nWebsite | Twitter | Telegram\n\nDisclaimer: Cryptocurrency trading involves substantial risk and may not be suitable for every investor. The value of cryptocurrencies can fluctuate widely, and there is a potential risk of loss. Always conduct thorough research and consult with a financial advisor before engaging in cryptocurrency trading.\n\nPR Contact:\n\nZEX PR WIRE\n\ninfo@zexprwire.com\n\nTo view the source version of this press release, please visit https://www.newsfilecorp.com/release/213703"
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTFBYWjlFeGU2YXRPMkMtczdZdWkyY0owOGRkaE9BMEtzQWRidDNia2ZMV0l2bVotVW9CZG1LTUx4NENSZjFiSHE3WndONk5NV2dNMUNLTUpDWlVpQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jun 2024 07:00:00 GMT",
        "title": "Choosing Polygon over Ethereum to Build Efficient dApps - Appinventiv",
        "content": "Polygon aims to give people numerous choices when they create dApp on Polygon. Some developers keep security over speed while others compromise on security for lowered fees and speed – the technology is building multiple Ethereum-centric scaling solutions to address all these different features.\n\nEthereum has remained a pillar in the cryptocurrency space. Right from DeFi to smart contracts and even NFTs, Ethereum has remained one of the key innovations of Web3. However, inspite of the glaring success, the technology has struggled with massive network congestion, high network fees, and lowering transaction throughput – factors that have created a scope for newer crypto projects coming in to scale it. Polygon is one such project.\n\nOriginated in 2017, India-based software company Polygon Technology scales Ethereum without sacrificing on its decentralization benefits. With the number of dApps on Polygon having reached 53,000, businesses are using the technology’s low fees and fast speed to build Ethereum-powered dApps.\n\nIn this article, we are going to look into the different facets of Polygon and what makes the technology better than using Ethereum for dApps development.\n\nHow does the Polygon dApp builder work?\n\nPolygon is a Layer 2 scaling solution that enables developers to build dApps on Ethereum without getting stuck with Ethereum’s limitations.\n\nHow it does that is by developing a layer 2 solution using off-chain on-chain concepts and different governance models like Proof of Stake, which helps the network lower its energy footprint by 99.95% – one which Etherum has also reached after The Merge. In addition to using a PoS architecture where the network participants stake MATIC for validating the transactions, Polygon enables developers to use its open source SDK to launch their Polygon dApp at the back of multiple scaling techniques:\n\nZK-Rollups: The ethereum-based technology acquired a zero-knowledge (ZK) protocol developer, Mir, for USD 400 million. What this protocol does is it enables transaction authenticators to validate the encrypted data without actually accessing the information enabling them to generate the verification proof in under 170 milliseconds.\n\nOptimistic Rollups: It consists of bundling several off-chain transactions into massive batches before submitting them in Ethereum. This way, the fixed costs get spread across multiple transactions that reduce the end-user fees. In essence, this scaling technique assumes off-chain transactions validity without pushing out validity proofs for the on-chain transaction batches by following a fraud-proving methodology to identify transactions having discrepancies.\n\nPlasma Chains: This scaling technique builds a child-parent relationship in Ethereum’s main chain. For example, the plasma chains can deploy their own dApps on Polygon which comes in handy when the other sidechains get hacked or are down. Additionally, the plasma chains tend to deliver off-chain transactions at higher efficiency levels.\n\nAt the back of these scaling methods, while the answer to how much time does it take to build dApp on Polygon is same as that on Ethereum or other blockchain technology, the transaction speed and cost difference is unmatched.\n\nFeatures of Polygon for dApp development\n\nThe technology merges the capabilities of sovereign blockchains and Ethereum into an attractive feature set that helps developers build a decentralized app on Polygon that is highly efficient, scalable, and speedy.\n\nEthereum compatibility\n\nWhen you build dApp on Polygon you work on a platform with complete Ethereum compatibility to tech stack, languages, standards, and tools.\n\nHigh scalability\n\nThe technology is built on dedicated blockchains, a scalable consensus algorithm, and a customized Wasm execution environment.\n\nCompetitive network Greater security\n\nPolygon dApp development is built on a modular “security as a service” facility offered either by Ethereum or a pool or validators.\n\nInteroperability\n\nThe technology comes with a native support for the arbitrary messaging passing bridges for external systems and can easily connect with Ethereum main chain using the bridging SDKs polygon offers.\n\nGood user experience\n\nWhen you build dApp on Polygon it is very similar to one on Web2 purely at the back of a facility like instantaneous transaction finality.\n\nModularity\n\nPolygon comes with high extensibility, customization, upgradability, community collaboration, and a short time-to-market.\n\nThese features of Polygon for dApp development are designed to bring the technology at par with the adoption of Ethereum minus all the limitations of the latter. This makes it profitable for developers and enterprises alike to build a decentralized app on Polygon.\n\nAmidst these feature sets and the obvious benefits of Polygon for dApp development, is it time to let go of Ethereum? And on a technological level, what difference does Ethereum hold from Polygon dApp development?\n\nCreating dApps on Polygon vs Ethereum\n\nWhile The Merge moved Ethereum from proof-of-work to proof-of-stake, bringing down its 112 TWh of energy consumption down to 0.01 TWh, the technology is where Polygon already is.\n\nThe Merge however, didn’t change the high variable transaction cost that Ethereum comes with – a factor that Polygon addresses on a massive extent. In addition to this, the transaction processing speed has also remained unchanged, which in case of Polygon dApps development is only 65,000 transactions per second at the back of the Layer 2 scalability solution.\n\nLet us look into the differences to understand why it makes sense to build dApps on Polygon.\n\nFactors Ethereum Polygon Foundation 2013 2017 Scalability 10 TPS 7000 Market Cap 139.56 Billion 7.698 Billion Average transaction fees 0.4876 US$0.01 Programming language Solidity Solidity, Golang, Vyper Transaction Deterministic Finality Instant 5 minutes Total dApps 2970 53,000\n\nWhile Polygon’s popularity is on a fast rise, there are some issues that are still prevalent in the technology. For understanding Polygon to its entirety, it is critical to know the limitations it comes attached with. Let us give a brief look at them:\n\nEthereum Dependency: Ethereum lies at the center of Polygon’s ecosystem as its settlement layer. This has resulted in Polygon being completely dependent on Ethereum for its operations.\n\nEthereum lies at the center of Polygon’s ecosystem as its settlement layer. This has resulted in Polygon being completely dependent on Ethereum for its operations. Under Development: Presently, Polygon comes with Matic POS Chains and Matic Plasma as scaling solutions. Other scaling solutions such as Optimistic Rollups, zk Rollups, Sidechains, Validum Chains, and Enterprise Chains, etc. are still in their developmental stages with an unsurety around when they would be live.\n\nPresently, Polygon comes with Matic POS Chains and Matic Plasma as scaling solutions. Other scaling solutions such as Optimistic Rollups, zk Rollups, Sidechains, Validum Chains, and Enterprise Chains, etc. are still in their developmental stages with an unsurety around when they would be live. Matic Plasma Chains: Polygon plasma chains can only be used for a limited set of use cases. Comparatively, POS Chains are a lot more famous since they offer greater user experiences and flexibility when compared to Matic Plasma.\n\nPolygon plasma chains can only be used for a limited set of use cases. Comparatively, POS Chains are a lot more famous since they offer greater user experiences and flexibility when compared to Matic Plasma. Competition: There are a number of scaling solutions such as Solana, Cosmos, Polkadot, etc. which are gaining steady momentum. They are making use of Ethereum and other blockchains to offer better user experience. Amidst this, we might see other solutions coming up and taking Polygon’s market share.\n\nWith everything we have covered up until this point, one thing is clear – even though the technology has some limitations which need to be addressed, the benefits of Polygon for dApp development are unignorable. However, for an entrepreneur what is necessary is to know the use cases on which they can create dApp on Polygon.\n\nThe use cases to build dApp on Polygon\n\nThe biggest reason why dApp development service providers like Appinventiv choose Polygon is the fact that the end product is the same as what results from Ethereum app development but the customer experience is much greater. So while the businesses get the same Ethereum-powered app, their users get an innovative user experience, higher lowered transaction speed, and minimal transaction fees.\n\nPayments: Polygon platform is engineered to create dApps that speed up the payment process, powering almost real-time payment settlement via specialized API and SDK integration. This enables apps, users, and merchants to instantly perform transactions through multiple cryptocurrencies, usually through the ETH or ERC-20 tokens. This system is being rolled out in three distinct phases: 1. ERC-20 token payments 2. Token transfer in cross-chain 3. Fiat-based payment models.\n\nLending Platform: The next use case to consider when you build dApp on Polygon is creating a module that would enable lenders to analyze users credit ratings and building a smart contract that would automate the loan disbursement journey.\n\nGames: The Layer 2 sidechain scaling solution of Polygon makes blockchain-based gaming platform development efficient and fast. With Ethereum and Polygon working together, the platform will be able to address the lag issues that non-Polygon blockchain games face.\n\nOther Use Cases: There are a range of other use cases to consider when you build a decentralized app on Polygon such as enabling fast settlement times required for decentralized exchanges to provide faster and cheaper trading.\n\n[Also Read: How to monetize with your dApp?]\n\nAmidst these use cases, the Polygon ecosystem is fast expanding. Here’s a look into some of the top applications that are a part of the network\n\nAdditionally, most of the dApps require a method to sign transactions without submitting in the users’ private keys details. On the back of its scalability enhancements, the technology helps in enabling an open identity framework for the dApp, thus solving the privacy issue.\n\nThese use cases are only a surface-level explanation of why businesses should develop dApp on Polygon. There are a range of other applications that can be built on Polygon.\n\nUltimately, even though Polygon dApps are built upon Ethereum, there are some very critical differences between them, specifically in transaction speed and cost. Such costly gas fees and slow transactions can lead to poor user experience that would leave a negative impact on the platform’s adoption. On this note, it makes better business sense to select Polygon, thanks to its ability to back faster transactions and lowered gas fees.\n\nAt Appinventiv, it is our constant endeavor to think about our clients’ customers first and this is the reason why we make dApp on Polygon. Using the technology we have built a range of decentralized apps right from a crypto wallet app to a DeFi exchange all promising a positive customer experience.\n\nLooking to explore the technology for your next dApp project? Get in touch with our blockchain experts."
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxQeWZDakhLZXJJTU1WUnJrSTNaTnNmZDU3aXB0bGpsVmR5QXBqWHI4cDI1Y1Bjclp4dmMtVDgtRXVFXzZxcDFRWDI4dnlqaERPRTRhQTlMMnY0T2lFakxKVDhFNlVZMlBXOV9xd3VLZ3ppVDgwMlFPVE1ub0tzdnBtbzFkbUJZSUlPLUV5cHRrczBWS0pwb1F2NHRyT1hWWHRYS20xUVJvblI4Z2pjUDhzOXMyRUTSAboBQVVfeXFMT0UzNk02Rl9pVWozZVdPRXNtb3k1b19WaDhVdEwxclhGWHFmN3NmUEVXczVlMlFKYkw1eUpaVzJGVU5jUUkycmN5STNnSDZVazAwSFJBTXJJR2lNSmNRZFRvRlBCTkVkTXV1RmFndGZ5bThtNTdMRWI2YTVHaVBzOUpCRGFod3lfVFp5WlBZT0FRZEFhNFB0Sm9idjcyWDE2ZjloaGhIR0FUeS1VdDhDSC0zcUdEVU5FZkxR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jun 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) to Start Gaining Some Strength, Is XRP Finally in Uptrend? Shiba Inu (SHIB) May Still Hit $0.00002: Here's How - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nEthereum is finally regaining some of its lost position. The second-biggest cryptocurrency on the market has already tested the $3,600 threshold. While the 26 EMA break did not happen, the fact that Ethereum tested that threshold may become a foundation for a bullish reversal in the foreseeable future.\n\nEthereum needs to rise above critical support levels in the near future. In particular, the $3,400 and $3,352 support levels are crucial. Ethereum could indicate strength and the possibility of further upward momentum if it can stay above these supports.\n\nTraders are keeping a careful eye on these levels for any indications of persistently bullish activity. The most likely reason behind the reversal is the exhaustion of bulls.\n\nInvestors should monitor the $3,600 resistance level, as a break above it may trigger a fresh upswing in price. Overall Ethereum's long-term potential — fueled by growing adoption thanks to the ETF and technological advancements — remains intact even though short-term fluctuations are to be expected.\n\nAdvertisement\n\nXRP's surprising strength\n\nXRP faces a 26 EMA resistance level after the bounce from $0.46, which is a strong signal for the asset. Despite losing the $0.5 support level, the short-term outlook is surprisingly positive for XRP. Key resistance levels to watch include $0.52 and $0.54, where a break above these could indicate further upward movement.\n\nA sustained price above $0.46 is critical for XRP in the near term. With its solid support, this level might serve as the basis for a resurgence. As long as XRP can overcome the immediate resistance at $0.52, traders are hopeful about a possible rebound.\n\nStill, there is cause for concern regarding the asset's long-term performance. The future of XRP is clouded by enduring regulatory challenges, most notably the ongoing lawsuit with the SEC. Since bad news can cause prices to drop sharply, market sentiment is also an important consideration.\n\nThe outcome of these legal challenges and public perception of the cryptocurrency market will have a significant impact on XRP's long-term prospects. Even though the short-term outlook is promising and could result in gains if resistance levels are overcome, investors should exercise caution. XRP has a number of long-term issues that could affect how well it performs in the upcoming months.\n\nShiba Inu is plummeting\n\nShiba Inu's drop below $0.00002 was dramatic and clearly should be treated as a signal of a potentially upcoming price drop. However, there is an important factor to consider: the short-term price drop is not set in stone, so bulls may still have enough reserves to buy back.\n\nSpecifically, $0.000019, $0.000022 and $0.000023 are three important price levels to keep an eye on. Each of these levels represents potential resistance or support areas that could determine Shiba Inu's next move.\n\nAt these prices a significant buyback might stop the current downward trend but if it does not hold, losses could continue. Short-term maintenance above $0.000019 is critical. A breakdown below this level could result in additional selling pressure because it has served as a significant level of support. On the other hand, a recovery of $0.000022 and $0.000023 would suggest a return of bullish momentum and might draw additional buyers into the market.\n\nThe popularity of Shiba Inu is fueled by its active social media presence and thriving community frequently causing their prices to fluctuate sharply. Sentiment can shift quickly, which can have a major impact on price, so traders need to be prepared for that.\n\nFurthermore, Shiba Inu's performance may be impacted by changes in the larger cryptocurrency market. Shiba Inu's long-term prospects hinge on its capacity to sustain interest and usage among the cryptocurrency community. Long-term growth may be possible for the project if it keeps coming up with new ideas and draws in users."
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxNazlDYlBKMkhSSmE5TGNXWFZWUzRHS3A3M0NLeUJYcElTVzcwd0ZXb0EydDdvTUxJQm5Uam5FS1VkVkxEdFYwSnNKNU1WMDg1OHRCdWZhalBQVC0tUndYQXVZM0hyMTZSbGZ2TDFNdGdFd05zSk5EUmlxY3duMWtnNmd2dW1DS3pBQ0ZLeTZvajZsUjFLLVdKcnlyOGV5ZjVScnZQWTQxblhPMjRRcVdB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jun 2024 07:00:00 GMT",
        "title": "Pro-Ripple Lawyers Say Ethereum Still Has Regulatory Uncertainty Issues - The Crypto Basic",
        "content": "Ripple CLO Stuart Alderoty and pro-XRP lawyer Bill Morgan still believe the SEC’s decision to end an investigation into Ethereum 2.0 does not absolve ETH of regulatory uncertainty.\n\nBoth legal experts expressed this view shortly after Ethereum developer Consensys Inc. revealed that the SEC does not recommend an enforcement action based on its investigations into certain sales of ETH.\n\nRipple CLO Highlights Regulatory Uncertainty Surrounding Ethereum\n\nReacting, the Ripple CLO congratulated Consensys on the win but raised concerns about the uncertainty regarding ETH’s regulatory status.\n\n- Advertisement -\n\nHe quizzed whether the conclusion of the Ethereum 2.0 investigation indicates the SEC does not think Consensys offered ETH as a security. Additionally, he suggested that the SEC might still view ETH as a security.\n\nFurthermore, Alderoty questioned SEC chair Gary Gensler’s potential response regarding ETH’s regulatory status. Lastly, the Ripple CLO noted that the regulatory status of Metamask’s staking and swap services could be in question due to the SEC’s refusal to address the matter in its recent response.\n\nHe expressed frustration with the lack of clear regulatory guidance for the U.S. crypto industry, which could hinder innovation in the country.\n\nA big win for Consensys, though questions remain. Does this mean the SEC thinks Consensys’ offers and sales of ETH are not securities transactions and/or that ETH itself is not a security? What will Gensler say if now asked? What is the status of MetaMask and staking? This is… — Stuart Alderoty (@s_alderoty) June 19, 2024\n\nPro-Ripple Lawyer Reacts\n\nPro-XRP lawyer Bill Morgan echoed a similar sentiment, suggesting that the SEC’s decision not to pursue enforcement action following its Ethereum 2.0 investigation fails to clarify the regulatory status of the second-biggest crypto by market cap.\n\n- Advertisement -\n\nHe contrasted the regulatory ambiguity surrounding ETH with the legal clarity XRP received from a federal judge last year, raising a rhetorical question about which situation is preferable.\n\nCome on people. Would you prefer a letter like this sent to one company, or a finding from a judge that a token itself is not a security. Gensler will continue not to answer when asked whether Ethereum is a security. He can’t do that with XRP. pic.twitter.com/kPbeirslFE — bill morgan (@Belisarius2020) June 19, 2024\n\nFurthermore, the lawyer speculated that Gensler would continue to refrain from answering whether ETH is a security but cannot do so with XRP. This is because U.S. District Judge Analisa Torres held that XRP in itself is not a security.\n\nFight Continues\n\nThough the SEC has ended investigations into Ethereum 2.0, Consensys is still embroiled in a lawsuit against the securities regulator. The Ethereum developer filed the suit in April, requesting a Texas court to declare the staking and swap services offered on Metamask as non-securities.\n\nSince the SEC did not comment on the status of Metamask’s staking and swap services, Consensys stated that its legal fight with the regulator would continue."
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxONm44bm1xWHEwS0VldUxlSTJ0Tl9oTlhkbWJudGhpWGl0ODlhUjk0Nkk3bXNsS2QwNldkVE95MjMydjVwVFBlek9ic3JiRldkM0ZCZGlRQ0xRdUhHMDRDbDQ4T2hzdXVjdjJlaHRoTVppQkNJWW45ZTAzLVZiSWdqd1ZUYk0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jun 2024 07:00:00 GMT",
        "title": "Ethereum & Solana Set Support - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 72,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxOdnB4UXFTcDJ4QUo1M2dTMUVaTkptQW9UczFoUHo3TmFEWHg1LTJvMy1rNjZ3clBvY1BHbGp0bjhmRnRLd1VEWnZTSUxHaHpVcC1sV290MXF0ck1IT3FVWXZhNFdKU0FHVUJ4WGJCVEJRX25CdHB3b1RmbmU2WjJ1cGQwYmU3emlIeHZ6OEE5R0UwYVXSAZgBQVVfeXFMTjBZak1RUXBzUnRKQUp1YXNwSXY0eWdMZDQ4RmFMUFItdm9UbVZmbTBBX05BcUhHT0kxUFF4c1lUcVlGcmpOelU0dmtYVHkxbGU5U3h3RGE2Qm02a0pSVHFwU29yZGgwRjlWclFQUGp6M1A4cUZ2SFFTdzRZd0pQNTF2NTllYUNUR1VmNlFQVWkxOFdEMWJRV0U?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jun 2024 07:00:00 GMT",
        "title": "Ethereum price analysis: ETH targets $3,700 resistance after recovery - AMBCrypto News",
        "content": "Ethereum’s price surged by 6% from its weekly low of $3,381.\n\nMetrics indicate a potential price reversal.\n\nIn an exceptional turnaround, the king of altcoins has witnessed a significant price recovery from its weekly low of $3,381.\n\nAccording to the data from the top platforms, Ethereum’s [ETH] upswing can be attributed to whale activities.\n\nEthereum price was up by 14% in the last 30 days. Ethereum was trading at an average price of $3,527, at press time. Its 24 hour trading volume stood at around $19.5 billion, with a market cap of $433 billion.\n\nEthereum has surged by 6% since retesting a 50-day exponential moving average resistance level. The next price target remains at around the $3700 resistance level if the bulls accumulate more momentum.\n\nThe stochastic RSI indicates an oversold zone that could signal a potential price reversal to the bullish side.\n\nWhale transactions fuel price momentum\n\nAccording to santiment’s data, the number of whale activities involving ethereum has spiked in recent days. The number of whale transactions soared to over 1400 on 18th June.\n\nThis heightened rise in the whale transaction coincides with Ethereum’s recent price surges. This suggests that investors were actively accumulating ETH during the recent dip.\n\nThe whales’ long positions may cause ETH to surge if the bullish pressure continues.\n\nLiquidation heats up but Ethereum remains strong\n\nCoinglass’s liquidation heatmap data further indicates Ethereum’s resilience.\n\nDespite the liquidations across the cryptocurrency market, ETH whales managed to hold a significant $43.57 million worth of long positions in the last 24 hours.\n\nThis whale’s commitments further indicate confidence among Ethereum’s long term prospects.\n\nThe long-short ratio data reveal that there was a stagnation in the long positions-indicated by a flattened curve. However, there has been a spike in the data, indicating that the long positions are currently in control of the market.\n\nRead Ethereum’s [ETH] Price Prediction 2024-2025\n\nWhat next for ETH?\n\nWith increased whale activity and investor resilience, Ethereum’s recent bullish momentum is likely to be maintained.\n\nThe market sentiments indicate that long investors outweigh short position traders, which could signal a price surge in the near future. However, the bearish rally could continue."
    },
    {
        "id": 75,
        "url": "https://news.google.com/rss/articles/CBMigwJBVV95cUxQWWhKel82ZmJBcTJMbjQzTVJ4a2RuRS1QcVRjZWwwLWVKWE0zUEZfZ3lQemdLUVpmV2VsVS1NLTJjMjJER1d4TFFzNkoxeHRhc1RrQnVQU0t5bTlHQUlmeS1CX29WZF9KQS0yT1FOb0U3OXFQdzZvZ3ItRkhGdUd3b2hlU0hPUmhhU1VDdHJNS1RaR1NEeWpxVEFVRDl1SHAtNVNDRFVXT3Y3TjZkSHdnVHVvUVNMV1hLY0VuQ1diNUVpeW16Sld4VjI4MXQ3dUh4ZFVENmxRM1dCV1ExWjlXRk5SbUxjQXEzYmxhajNDYTN3NzhRSUZSSGIxbXZ4eXRfenlF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jun 2024 07:00:00 GMT",
        "title": "Bitcoin (BTC) to $70,000 Imminent? Solana (SOL) to Pump Ethereum: Here's How, Cardano (ADA) Bounces Around $0.3, But for How Long? By U.Today - Investing.com",
        "content": "U.Today - is finally entering reversal mode, with the price of the first cryptocurrency sliding in above the $65,000 zone. However, it is still moving below key support levels like the 50 EMA and is currently consolidating at the 100 EMA. The most decisive factor for a recovery would be momentum that is not present at this exact moment.\n\nIt is critical that Bitcoin maintains above $65,000 for the near future. Strong support has been seen at this level, which might serve as the basis for a reversal. If Bitcoin is able to overcome the immediate resistance at the 50 EMA or roughly $67,000, traders are hopeful of a possible rebound.\n\nAdditionally, the RSI which is centered on 47, shows that Bitcoin is neither overbought nor oversold, pointing to a period of consolidation prior to any notable movement. The macroeconomic environment as a whole is one factor influencing Bitcoin's current performance. Investor sentiment in a variety of markets, including cryptocurrency, has been influenced by worries about inflation and possible interest rate increases by central banks.\n\nBitcoin's long-term prospects are still promising despite these obstacles because of its growing institutional adoption and ability to act as an inflation hedge. Given its continued institutional interest and widespread adoption, Bitcoin's long-term prospects appear bright.\n\n's questionable position\n\nWhile Solana clearly gained some respectable strength back in May, the situation for the asset has changed, and it has been going down steadily for the past 20 days. The SOLETH chart, often used for gauging market volatility, is clearly exhausted and might provide us with some growth in the future.\n\nThe Solana vs. chart, which contrasts the two most powerful altcoins available, is an important comparison. This comparison makes the relative strength and possible volatility of the altcoin market easier for traders and investors to understand.\n\nA positive outlook for altcoins overall is frequently indicated by Solana's strong performance versus Ethereum and vice versa. Because SOLETH captures the growth and performance dynamics of two significant cryptocurrencies that are not Bitcoin, it is regarded as a barometer for market volatility. In the domains of NFTs and decentralized finance (DeFi), Solana and Ethereum are renowned for their strong ecosystems and noteworthy use cases.\n\nSignificant movements in these two assets may point to more general trends on the cryptocurrency market. Ethereum frequently serves as a benchmark since it is the bigger and more well known of the two. Conversely, Solana stands for more recent quickly expanding blockchain initiatives. It is possible to infer market sentiment regarding innovation and growth in the cryptocurrency space from the interaction of these two assets on the chart.\n\n's unexpected bounce\n\nCardano somewhat bounced from a local support level at approximately $0.35, with the potential to fight with the 26 EMA for momentum in the next few days. This bounce is a small but crucial step toward breaking an aggravating downtrend that has plagued the cryptocurrency for months.\n\nHolding above $0.35 is critical for Cardano in the near term. This level has provided a lot of support and might provide the groundwork for a future upswing. Cardano may indicate the start of a recovery phase if it can muster enough momentum to test and possibly break above the 26 EMA.\n\nAn RSI of about 37 indicates that ADA is in oversold territory, which may draw in buyers searching for cheap points of entry. But Cardano has not exactly performed well over the long haul. Even with the community's strong support and the project's lofty objectives, ADA has had difficulty holding onto its value. Cardano has experienced a protracted decline and has not been able to return to its prior highs since hitting its all-time high in early 2022.\n\nNumerous reasons contribute to this subpar performance, including the general mood of competition from rival blockchain platforms and slower-than-anticipated development progress. Although anticipated by many investors, the Cardano ecosystem has not yet produced the ground-breaking applications.\n\nAlthough the deployment of smart contracts on the Cardano network was a big step forward, neither the number of dApps nor user adoption has increased significantly as a result of it. Some investors have become frustrated with ADA's slow development, which has made them doubt the company's long-term prospects.\n\nThis article was originally published on U.Today"
    },
    {
        "id": 79,
        "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxOaVNLbHl2aG9DRlM2T25Fd1dFLWNsalA4NEZfaGR4aUhKOEFVYm12WVgzNVNpMXkzUW9XZExfVlRKSzA1a2I2R1NtU2ZGVWY3TDY3N2hRYVdyREttNllZLW1TbkxoZ3pZaVZuVElWVTF6aUVvR3h5bXNCTGhVU0FXTWlDZ2Mwd3l5M1g4ajR0dmJmdGtSZVFnQ0IwSlFSZ3BUc2fSAacBQVVfeXFMUDllck9VMWFUcm1keTRkRDRJU3pWRExfSDFuSGN3UWtTRzRZN1NuWDFRaFdlYXl3eHVWVjA1TjA2RHMyZDh0ZElJRDl6M21pcEFkbDdlUGxXbnJyd2FLZ2I4ZDh6akdhQ2huVjU1ZWFmWWtSOFlsVk82QkFDSzBWTUdrQmVkSC1CSWZqSHNpVUg4RlZDLVhtSGw3cHhra3Y0ZGJKbmFDQU0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jun 2024 07:00:00 GMT",
        "title": "Bitwise CEO Hints At Major Announcement, Spot Ether ETF Launch Likely By July 4 - CoinGape",
        "content": "Bitwise CEO Hunter Horsley on Thursday said there will be a major announcement by Bitwise Invest tomorrow. Bitwise recently filed an amended spot Ethereum ETF S-1 to disclose a $2.5 million seed investment and Pantera’s interest in putting $100 million in the Ether ETF.\n\nBitwise Likely Making An S-1 Filing For Spot Ethereum ETF\n\nHunter Horsley, chief executive officer of Bitwise Invest, took to X on June 20 and revealed a big announcement coming from the company. He said “Keep an eye on Bitwise Invest tomorrow. Something cool.”\n\nadvertisement\n\nWhile Horsley’s post didn’t mention enough details or points to another S-1 amendment to spot Ethereum ETF, experts believe it will be related to Ether ETF.\n\nNate Geraci, president of ETF Store, said a flurry of spot Ethereum ETF S-1 amendments are coming on Thursday and Friday. He believes there’s nothing left for the U.S. SEC to address or comment on as per details in the Bitwise S-1 recent filing.\n\nGeraci thinks spot Ethereum ETF will launch before July 4 as SEC Chair Gary Gensler hinted at the approval of Ether ETFs before the end of summer. The SEC has also closed its Ethereum investigation, clearing the way for a potential listing and trading of spot Ether ETFs on exchanges.\n\nHe expects Bitwise to reveal fees for its spot Ether ETF on Friday. The company charges a 0.20% management fee for Bitwise Bitcoin ETF (BITB).\n\nAlso wouldn’t be surprised to see another issuer or two file for combined spot btc & eth ETF over next week or so… — Nate Geraci (@NateGeraci) June 20, 2024\n\nAlso Read: Are Solana, Cardano, Polygon Commodities As US SEC Ends Ethereum Investigation?\n\nRise in Interest in Spot Ether ETFs\n\nConsensys disclosure about the SEC ended its investigation into Ethereum resulted in a broader crypto market recovery, with ETH price rebounding above $3,500. It indicates a massive interest in the spot Ethereum ETF and expected a similar interest from institutional investors.\n\nETH price jumped 1% in the past 24 hours, with the price currently trading at $3,586. The 24-hour low and high are $3,513 and $3,589, respectively. Furthermore, the trading volume has decreased by 28% in the last 24 hours, indicating a decline in interest among traders.\n\nHowever, ETH price can rise further amid S-1 filings by spot Ethereum ETFs. It could bring a potential rebound in the broader crypto market and most likely an altcoin season.\n\nAlso Read: VanEck Bitcoin ETF Debuts on Australian Stock Exchange ASX, Will It Get US-Like Response?\n\nVarinder Singh Varinder has 10 years of experience in the Fintech sector, with over 5 years dedicated to blockchain, crypto, and Web3 developments. Being a technology enthusiast and analytical thinker, he has shared his knowledge of disruptive technologies in over 5000+ news, articles, and papers. With CoinGape Media, Varinder believes in the huge potential of these innovative future technologies. He is currently covering all the latest updates and developments in the crypto industry.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 80,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxPcl9EUGxUTC1rLUdtRloydm1KZUZLTU9RMWdfUHRNSElRbk13S1BHbldkQWhrSWg1YzdUcFFDYkFLUUZBNWF1UURYQTJuLVpONDJXUVA3U2h2VDhhazBHdXJuUHZWOTlvUkFldDZwZFpnc1pwMEpMc2tod2NUZUZnMGpWTk84RFNJLXdFa2pNSjNNaVRhaHoxMU1B0gGfAUFVX3lxTE1heVlkS0ota0ljWjdWclFqRXlQYmVxbmoyQ1g1NzVXUmRBOXo2eXZ1OTVOa21ldGhQWHNVX3l1WFAybDExWFZmOVNSYVNXa1hSZmdERHA4VzBkYjBhVXN6V3pBeU1HVkFBMURLYW5UWVRDZUJLVGxYbGFCSi0xWDI3ak10b09XN2p1ODdrLTJUbGZISms2MHJERFp5UlFiMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Price Prediction: Upcoming ETH ETF Trading Teases $5,000-Bound Rally - CoinGape",
        "content": "Ethereum Price Prediction: The Ether and crypto communities are eagerly looking forward to the start of spot ETF trading in the US. This follows insight from a renowned ETF analyst who projects the D-Day on July 2. In the meantime, ETH price holds firmly to support at $3,500. A breakout from this level could breach the $4,000 resistance which will ignite FOMO as investors back the uptrend toward $5,000.\n\nBitcoin too is starting to shape the next crypto landscape this week after reclaiming ground above $65,500. With the two largest cryptocurrencies modestly in the green, investors are beginning to appreciate the sell-off as a blessing in disguise. This means they can apply key dollar cost-averaging practices, buy the dips, and eventually increase potential gains in the second half of the year.\n\nFactors Likely To Drive The Next Altcoin Season\n\nThe crypto fear and greed index has fallen to 64—still showing greed among investors but significantly below last week’s figure of 74. This indicator by Alternative, monitors market sentiment with zero on the scale referring to extreme fear and 100 to extreme greed.\n\nadvertisement\n\nSince markets function as living entities, sentiment is driven by people. As euphoria increases, investors become greedy due to the FOMO. This propels prices higher but also introduces the risk of a drastic decline as some investors decide to take profits. It is rarely a good idea to buy when the crypto fear and greed index is near the extreme top.\n\nOn the other side of the fence, a drop in the metrics suggests greed is creeping in. Because sentiment is falling, many people choose to sell—some due to the fear of losing their capital or possibly to protect unrealized gains.\n\nIt is advisable to buy when the market is red and sell when it is green. With that in mind, investors might consider this to be a good time to buy into their favorite altcoins, ignoring the drop in the fear and greed index to 64.\n\nEthereum price has increased 1.3% in 24 hours to $3,585 on Thursday. The value growth, although minor, has reflected a 0.81% surge in the market cap to $438 billion. However, the second-largest digital asset faces a 30% slide in the trading volume to $14 billion—a factor likely to hamper potential growth in the upcoming sessions.\n\nNevertheless, investors seem to have set their sight on the approvable of the spot ETF. The Securities and Exchange Commission (SEC) approved the listing of spot Ethereum ETFs in May pending further approval for the operators of the products which will eventually give way to actual trading on stock exchanges.\n\nThe SEC also dropped investigations into Ethereum, further clearing doubts that Ether could be considered a security.\n\nETF analyst Eric Balchunas predicted earlier this week that Ethereum ETFs could start trading on July 2. This followed word that the SEC “sent issuers comments on S-1s today, and they’re pretty light, nothing major, asking for them back in a week.”\n\nUPDATE: we are moving up our over/under date for the launch of spot Ether ETF to July 2nd, hearing the Staff sent issuers comments on S-1s today, and they're pretty light, nothing major, asking for them back in a week. Decent chance they work to declare them effective the next… https://t.co/XJZ8JLwEFF — Eric Balchunas (@EricBalchunas) June 14, 2024\n\nThe start of the actual trading of Ethereum ETFs could spark fresh interest in ETH and altcoins. Traditional investors would find it easier to buy ETH via exchanges, validating the crypto market.\n\nAnalysts at CoinGape expect this to be a moment of reckoning for altcoins like Solana, XRP, and Dogecoin which are believed to be the next in line for spot ETFs.\n\nThe move could be bullish for the entire crypto market, including Bitcoin, and possibly usher in the much-anticipated altcoin season.\n\nEthereum Price Prediction: ETH Stares At A 30% Breakout\n\nEthereum price is making key strides in its recovery following the correction to $3,400. The token currently sits above two exponential moving averages (EMAs), the 20-day and the 50-day.\n\nA daily close above $3,600 resistance would mean that bulls are getting back in the game for a breakout past $4,000. The presence of an inverse head and shoulders (H&S) pattern on the daily chart could reinforce the bullish grip when validated.\n\nThis is a bullish pattern validated when the price breaches the neckline resistance around $3,800 in Ethereum price prediction case. Traders would enter above this resistance eyeing a 30% move close to $5,000.\n\nRelated Articles\n\nJohn Isige John is a seasoned crypto expert, renowned for his in-depth analysis and accurate price predictions in the digital asset market. As the Price Prediction Editor for Market Content at CoinGape Media, he is dedicated to delivering valuable insights on price trends and market forecasts. With his extensive experience in the crypto sphere, John has honed his skills in understanding on-chain data analytics, Non-Fungible Tokens (NFTs), Decentralized Finance (DeFi), Centralized Finance (CeFi), and the dynamic metaverse landscape. Through his steadfast reporting, John keeps his audience informed and equipped to navigate the ever-changing crypto market.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 83,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxPUkxfWXk5aWc4TlJuVFB5SEpvTXhpUEo3c19pcmJMRWFtSHlVRFhUNG8xQllzdVU1dkhVcy1iZDB3VFhzTkFOcFFTS3hqUEdmMU5XUEdVQUhUSjBDaUZ4WmV1LXByNDRTcHdHUlFKWVM4Mkh0WFozUHBZZGJLcURDa2MxVG9HQzJwdUIyVXAxdFR5R1IzNmfSAZsBQVVfeXFMTlE4dGxzNjlULUg0NmZvamZBRTRZVzFPaTZRbjI4OElwajZqOUdCM21jZklkbFFCcHN0dDROV0RMalpWQ0stZExkdDRkN2N0Tm5fR043QlVIZTZabUFCckljYjQxUmgyU2lNQllVbTR1Z3NFNVNEbXlxS3hVSFR3VDE1blVPY3RCSUplOEdfcTR1ZjB6R3dxMFdmUU0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Jun 2024 07:00:00 GMT",
        "title": "3 Reasons Why SEC Can Approve Spot Ethereum ETF S-1 Filings By July 2 - CoinGape",
        "content": "The U.S. Securities and Exchange Commission (SEC) is expected to approve the long-awaited Spot Ethereum ETF filings by July 2. This move comes amidst several key factors aligning towards regulatory clarity and increased market interest in crypto-based investment products. Moreover, Bloomberg analyst Eric Balchunas had previously revealed that they have pushed the potential Spot Ethereum ETF S-1 approval date to July 2.\n\n1. ConsenSys Vs. SEC Investigation Resolution\n\nOne pivotal reason behind the anticipated approval of Spot Ethereum ETF filings is the recent progress in regulatory discussions between ConsenSys and the SEC. ConsenSys, a prominent blockchain technology company, sought clarification on the SEC’s stance regarding Ethereum’s status as a security. This came in the context of their ongoing investigation into Ethereum 2.0.\n\nadvertisement\n\nThereafter, the SEC announced the conclusion of this investigation. This development signals a significant shift in their approach towards Ethereum. Moreover, the resolution of this investigation is crucial as it sets a precedent for Ethereum’s regulatory status, potentially mitigating concerns over its classification as a security. With ConsenSys paving the way for regulatory clarity, the SEC may view this as a favorable signal towards approving Spot Ethereum ETFs.\n\nAlso Read: Breaking: Bitwise Files Amended Ethereum ETF S-1 After SEC Feedback\n\n2. Spot Ethereum ETF S-1 Amendments by Applicants\n\nAnother key factor influencing the timeline for SEC approval is the proactive approach taken by ETF applicants such as Bitwise. Recently, Bitwise diligently amended their S-1 filings in response to feedback from the SEC. They addressed regulatory concerns and enhancing transparency in their proposed ETF structures.\n\nNate Geraci, the host of ETF Prime, expects other applicants like VanEck, BlackRock, Franklin Templeton and others to mirror the move within this week. In case other amendments gush in, the Spot Ethereum ETF S-1 approval could be expedited.\n\nBitwise’s recent amendment, for instance, detailed significant investment commitments. This included a $2.5 million seed investment from Bitwise Investment Manager, LLC. Moreover, expressions of interest from institutions like Pantera Capital Management LP underscore the robust market demand for Ethereum ETFs, despite being non-binding.\n\n3. SEC Chair Gary Gensler Hints At Summer Approval\n\nSEC Chair Gary Gensler‘s public statements have also influenced expectations regarding the approval timeline for Ethereum ETFs. Gensler previously indicated that approvals for such products could be expected “over the course of this summer.” This underscores the SEC’s proactive stance towards embracing innovation while ensuring investor protection.\n\nWhen revising the potential approval date, Balchunas even hinted at an earlier approval. In a post on X, he wrote, “Decent chance they work to declare them effective the next week and get it off their plate before the holiday weekend. Anything is possible but this is our best guess as of now.”\n\nHowever, as of now, the week hasn’t seen such a big leap despite the recent S-1 amendment. Nonetheless, the approval remains imminent as hinted by market analysts.\n\nAlso Read: Hashdex Files 19b-4 For Combined Spot Bitcoin and Ethereum ETF\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 89,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE81OHpEWVdKX08zd1RYNDN0akhENFVzZ0c3bUJwNXl4WE9HZDdQSUNuNnZnSGNscHRiUndvM1NIMEc4RlV6a2NXcU1DYlFhdlpKbjlMVHNzX19jZU1oOGEzN011a253c3hYZ2xzS3R0VGcyTnFZZWFMZ19IdVFjdG_SAYQBQVVfeXFMT2FIc0lldVdWaHg2UWJZUDJIYVA2Vk9ER2dITGRtOG04NmxjbmdKUk10UjRqdjJMTDF3MnNCWm5wOTFGeV9WOWlpQVB2ZHVlZmVRTlFJSU9yaDVUZVVCMVNGbHlEQVNUX053aTJTOWVFNWxJdkxoaWJqQjFGRGkydGJrQ0x3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Jun 2024 07:00:00 GMT",
        "title": "Altcoin dominance at 9%, drops 15% in 30 days: What now? - AMBCrypto News",
        "content": "Altcoin dominance has declined by 15% in the last month.\n\nThe demand for ETH remained significantly low, putting the altcoin at risk of a further price decline.\n\nAltcoin dominance has cratered by double digits in the last month. At 9.88% at press time, it has fallen by 15% in the past 30 days, according to TradingView.\n\nAltcoin dominance refers to the relative market share of all cryptocurrencies, excluding Bitcoin [BTC]. Its decline means that the total market capitalization held by altcoins was decreasing compared to BTC.\n\nThis may be because investors are moving their funds from altcoins to BTC, which they perceive as a safer and more stable investment asset.\n\nAltcoin dominance waning?\n\nIn times of market consolidation like this, altcoin dominance may decline while Bitcoin dominance increases, as altcoins lose value or fail to attract investors.\n\nHowever, BTC’s dominance has yet to record any significant growth within the one month considered. As of this writing, its value was 55.36%, declining by 1.03% in the last month and 0.69% in the last seven days.\n\nAMBCrypto reported earlier that this gradual decline in BTC dominance is due to the strong resistance the coin faces at the $70,000 price level.\n\nETH remains at risk of decline\n\nAt press time, Ethereum [ETH] traded at $3,561. According to CoinMarketCap, the altcoin’s value has surged by 14% in the past 30 days, despite the general decline in altcoin dominance in the crypto market.\n\nAn assessment of the coin’s performance on a daily chart revealed that it broke below the support level of $3693 on 10 June and has since flipped it into resistance.\n\nEven though it has managed a mere 1% price hike in the last week, ETH’s price has since oscillated within a range, with new resistance formed at the $3693 price level and support found at $3428.\n\nConfirming the general decline for ETH among market participants, its key momentum indicators were positioned below their respective center lines at the time of writing.\n\nFor example, ETH’s Relative Strength Index (RSI) was 48.60, while its Money Flow Index (MFI) was 29.59.\n\nThese indicators measure oversold and overbought market conditions by tracking an asset’s price changes.\n\nAt their values as of this writing, they suggested that selling pressure was significantly higher than buying activity.\n\nRead Ethereum’s [ETH] Price Prediction 2024-2025\n\nIf the decline continues, ETH risks falling to $3496.\n\nHowever, if invalidated, its price might rally toward $3658."
    },
    {
        "id": 92,
        "url": "https://news.google.com/rss/articles/CBMi3gFBVV95cUxPRXd3Y0pzU3NveVNxbmoxVmk0YzJnbDM0a1dvNUszU0I2YUg3LTAtNkJPTDUtY19LeUhwNm84QXVTYzQzY29xUktHTUs2ek4ybHJ1Yjd4REg0Z1IwQXNua3hpQmI2TXh6ZTdzdE9zVHpLeFNadUJVdTBEaHRpaWtIUUNtb2dETjdta2haZVdhbUFTMU1ua2ZKNVBPQWJ2dl9oN2hvYVk1eUp6dFNWR3pTSjFMVWQzcnZCenk0dE0tNGNPZ0NkRG43aHl0bFJLbHdhU3V3d1B4SzNZUEpMaWfSAeMBQVVfeXFMUDBXT2o4bFgtMWdPUHlIZktxNkdYcy1jMGJXRU5SdzV3M05mSnBVZXA4MkVubTVrZ1BRQ01EY3prcTRSRDRjSFV5b0Fzc1F4OWZEcUE5b19HNDJhVGZKd0ptYzZNeGtKakpDSUZOWW9pVzR5TEVmaGNvWVZBaEEzVVU0c2RIVkJ6c1ZzZVFJZ3V1UkJleG1sS1d3WFFuQi05Mi1EWTBIcUhya3JOQkU1ZFNTTlJoQVNSNldKYXhIZXRWYW5kU0pObi1Ydm05Ul9vQTRDajlGS2FvU0tRcGlheXdxX1U?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jun 2024 07:00:00 GMT",
        "title": "XRP holders wonder how SEC will treat Ripple as Ethereum gets free pass - FXStreet",
        "content": "The court decision is a partial summary judgment. The ruling can be appealed once a final judgment is issued or if the judge allows it before then. The case is in a pretrial phase, in which both Ripple and the SEC still have the chance to settle.\n\nThe SEC has stepped up its enforcement actions toward the blockchain and digital assets industry, filing charges against platforms such as Coinbase or Binance for allegedly violating the US Securities law. The SEC claims that the majority of crypto assets are securities and thus subject to strict regulation. While defendants can use parts of Ripple’s ruling in their favor, the SEC can also find reasons in it to keep its current strategy of regulation by enforcement.\n\nThe ruling offers a partial win for both Ripple and the SEC, depending on what one looks at. Ripple gets a big win over the fact that programmatic sales aren’t considered securities, and this could bode well for the broader crypto sector as most of the assets eyed by the SEC’s crackdown are handled by decentralized entities that sold their tokens mostly to retail investors via exchange platforms, experts say. Still, the ruling doesn’t help much to answer the key question of what makes a digital asset a security, so it isn’t clear yet if this lawsuit will set precedent for other open cases that affect dozens of digital assets. Topics such as which is the right degree of decentralization to avoid the “security” label or where to draw the line between institutional and programmatic sales are likely to persist.\n\nThe United States Securities & Exchange Commission (SEC) accused Ripple and its executives of raising more than $1.3 billion through an unregistered asset offering of the XRP token. While the judge ruled that programmatic sales aren’t considered securities, sales of XRP tokens to institutional investors are indeed investment contracts. In this last case, Ripple did breach the US securities law and will need to keep litigating over the around $729 million it received under written contracts.\n\nIt depends on the transaction, according to a court ruling released on July 14: For institutional investors or over-the-counter sales, XRP is a security. For retail investors who bought the token via programmatic sales on exchanges, on-demand liquidity services and other platforms, XRP is not a security.\n\nOn the contrary, if Ripple closes under $0.4665, the April 19 low, it could invalidate the bullish thesis. XRP could find the next support at the June 7 low of $0.4508.\n\nThe Moving Average Convergence Divergence (MACD) line crossed over the signal line, with green histogram bars flashing above the neutral line, supporting a bullish thesis for XRP. If this upside scenario unfolds, Ripple could rally towards resistance at $0.5326, coinciding with the June 5 high.\n\nXRP gained nearly 1% on Thursday, as seen on the daily chart . The altcoin is trading at $0.4963 on Binance at the time of writing, gaining nearly 1% in the past seven days but losing nearly 8% in the past 30 days.\n\nA big win for Consensys, though questions remain. Does this mean the SEC thinks Consensys’ offers and sales of ETH are not securities transactions and/or that ETH itself is not a security? What will Gensler say if now asked? What is the status of MetaMask and staking? This is…\n\nRipple (XRP) holders debate the future of the altcoin on Thursday, which could be closely related to the US Securities and Exchange Commission’s (SEC) next step following its decision to end the investigation into Ethereum (ETH).\n\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all or a portion of your investment, as well as emotional distress. All risks, losses and costs associated with investing, including total loss of principal, are your responsibility. The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of FXStreet nor its advertisers. The author will not be held responsible for information that is found at the end of links posted on this page.\n\nIf not otherwise explicitly mentioned in the body of the article, at the time of writing, the author has no position in any stock mentioned in this article and no business relationship with any company mentioned. The author has not received compensation for writing this article, other than from FXStreet.\n\nFXStreet and the author do not provide personalized recommendations. The author makes no representations as to the accuracy, completeness, or suitability of this information. FXStreet and the author will not be liable for any errors, omissions or any losses, injuries or damages arising from this information and its display or use. Errors and omissions excepted.\n\nThe author and FXStreet are not registered investment advisors and nothing in this article is intended to be investment advice."
    },
    {
        "id": 93,
        "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxOVU1hSzA0QUZ6VTQ2aEhhUXM3SmNPNzJyREtqQ2JEVUxVQmJoVEFLWlZLSjFpRFBkVGtpYkprMml4WWNWdTJsN1JUd2dkSTNKTzE5eTN5OTd5QzQ5RDQyTHE2ZjVhRElWRjVFeExGTmctZF9UZWhGR3VYaE85MlQxaDFmMW9XdGxNdXh2OVBNbV8tSzdQQUFZaG1oVWpVT0FOUlc4U0VuLU43OW1CWW9aeXNtcWZfODQ0U3d6QS1fZE5aSVZSWUR3blNobVRzVHc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jun 2024 07:00:00 GMT",
        "title": "Breaking: US SEC Ends Investigation into Ethereum 2.0, Says No Further Legal Action Will Be Taken - Crypto News Australia",
        "content": "The SEC has closed its investigation into Ethereum 2.0, dropping allegations that Ether sales are securities.\n\nConsensys argued that recent ETF approvals implied ETH is a commodity, leading to the investigation’s closure.\n\nThe decision may spark discussions on listing other altcoin ETFs, but Consensys emphasises ongoing challenges in the crypto industry.\n\nIn a major breakthrough for the crypto industry, Consensys, a private blockchain software technology company founded by Ethereum co-founder Joseph Lubin, just announced that the US Securities and Exchange Commission (SEC) is dropping its investigation into Ethereum.\n\nETHEREUM SURVIVES THE SEC.\n\n\n\nToday we’re happy to announce a major win for Ethereum developers, technology providers, and industry participants: the Enforcement Division of the SEC has notified us that it is closing its investigation into Ethereum 2.0.\n\n\n\nThis means that the SEC… — Consensys (@Consensys) June 19, 2024\n\nConsensys announced, “the Enforcement Division of the SEC has notified us that it is closing its investigation into Ethereum 2.0”.\n\nRelated: Bloomberg Reports Elon Musk Plans To Turn X Into Next Venmo, Will Crypto Play a Role?\n\nThis includes dropping allegations that sales of Ether are securities – a long-debated question among the crypto community.\n\nAdvertisement\n\nLubin’s company said this comes after they asked the SEC on 7 June to confirm ETH’s status as a commodity following the recent exchange-traded fund (ETF) decision in the US.\n\nIn late May the regulator gave the green light for the listing of Ether ETFs on several US exchanges. The 19b-4 approval signifies that trading on these exchanges now only requires S-1 approval.\n\nA step many saw as a de facto greenlighting of Ethereum as a commodity.\n\nDecision to Spark More Altcoin ETF Talks\n\nThe SEC dropping the investigation could lead to more talk about altcoin ETFs being listed. Recently, both Ripple CEO Brad Garlinghouse and Tether co-founder William Quigley voiced their expectations of several other altcoins fund listings in the near future.\n\nQuigley believes ADA (Cardano) and SOL (Solana) could be next for an ETF, while Garlinghouse also believes an XRP ETF is in the cards.\n\nHowever, Consensys also said in their statement on X that, while great news, the decision to drop the Ethereum investigation is not a miracle cure for all the issues in the crypto industry.\n\nThe closing of the Ethereum investigation is momentous, but it’s not a cure-all for the many blockchain developers, technology providers, and industry participants who have suffered under SEC’s unlawful and aggressive crypto enforcement regime. Consensys Consensys\n\nThe statement added that Consensys would continue the fight, especially regarding the status of crypto wallet MetaMask and swaps and staking within the wallet.\n\nOur fight continues. In our lawsuit, we also seek a declaration that offering the user interface software MetaMask Swaps and Staking does not violate the securities laws. It should not take a lawsuit to provide the much-needed regulatory clarity to allow an industry that serves… — Consensys (@Consensys) June 19, 2024\n\nBackground of SEC Investigation\n\nThe SEC’s Enforcement Division, led by Gurbir Grewal, initiated an investigation in March 2023 into Ethereum transactions dating back to 2018.\n\nThe probe came to light when the Ethereum Foundation’s GitHub mentioned scrutiny from a “state authority,” later identified as the SEC.\n\nRelated: Bitcoin NFTs Surpass Ronin with Record $148 Million All-Time Sales in Last 30 Days\n\nIn April, Consensys sued the SEC, seeking confirmation that ETH is not a security. The SEC decided to close the investigation after Consensys argued that the approval of spot Ethereum ETFs indicated that ETH is a commodity, not a security."
    },
    {
        "id": 94,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxPREViSjBYSFpac3E1QlpPWjllWG4tZEhKNmZFV0R3VzBYUTE3WTVoekJVTTFVWklpcmMzU2JHU1NXS1VRQ2dfcXZzYlhONEhoeFZpbVZYOEpUTmppVEFYOVZQZUZvU1hzSHE3SldiVkdsb1JLTllpa1hnUXFxZnZmSlhSbnRjSko1S21BWEpXN3BVb1NfSEFhUnBLMmprWUHSAaQBQVVfeXFMT3BrT2l4TGF2S1J5OVdwVUlYeGNkV1F0dzN0SnNxTWNaWXRZNnFfX3p4bU11RjQ0Q1hWNWs1MDIzME55cUZ4Tk9LQ3F5RzIxdDZseWJxWUlOVllVMU9BRTNnVUhTQ0g0UGdnQ3hDRzd6SnFLRUI1MlFQRE9NZmFVdW03aFBMV2JFcnhvaDg0RFR3SWJJUUpCREMzdTlWZm5YNHBWTm4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Jun 2024 07:00:00 GMT",
        "title": "Are Solana, Cardano, Polygon Commodities As US SEC Ends Ethereum Investigation? - CoinGape",
        "content": "The U.S. Securities and Exchange Commission (SEC) has permanently closed its Ethereum investigation, which sparked a rally in ETH and altcoins. While the move by the SEC has gained skepticism, especially in the XRP community, does Ether gaining status as a commodity means all proof-of-stake (PoS) cryptocurrencies such as Solana, Cardano, and Polygon are commodities?\n\nSolana, Cardano, Polygon, Other PoS Crypto Are Commodity?\n\nThe SEC’s ending Ethereum investigation sparked speculation that Solana, Cardano, Polygon, and other proof-of-stake (PoS) could also be commodities. Also, Ether has leaped over Bitcoin and XRP in terms of gaining regulatory clarity.\n\nadvertisement\n\nPopular XRP sleuth Mr. Huber asked former SEC securities lawyer Marc Fagel whether the SEC now considering Ethereum as a commodity means anything for proof of stake crypto projects. The latest move by the SEC brings major PoS crypto such as Solana, Cardano, and Polygon in the spotlight. The SEC has alleged Solana, Cardano, and Polygon as securities in Binance, Coinbase, and other lawsuits.\n\nI have no visibility into their thinking but, no, I wouldn’t make that leap. I don’t know what evidence (or lack of such) led the SEC to close the investigation, but I assume the prevalence of serious defenses (not present for other crypto) was a big factor. — Marc Fagel (@Marc_Fagel) June 19, 2024\n\nAlexander Grieve, government affairs lead at Paradigm, said that it is relatively unusual for the SEC to highlight a company in response to a closure of an investigation. The SEC is “under no obligation to do so.” Also, Ethereum Foundation was part of the investigation, but it didn’t receive any letter.\n\nMarc Fagel agreed that it’s highly unusual to send a closing letter to one party if something was ongoing as to another party in an investigation.\n\nAlso Read: XRP, Cardano, & 7 Other Communities Must Watch This Key Move By Binance\n\nWill Consensys Drop Lawsuit Against SEC?\n\nConsensys revealed that the SEC Enforcement Division has closed its investigation into Ethereum 2.0, as per a letter send by SEC Assistant Director Kristin M. Pauley on June 18. The company claimed it’s a major win for Ethereum developers, technology providers, and industry participants.\n\nThe move comes in response to a letter sent by Consensys seeking confirmation from the SEC. The May ETH ETF approvals by the SEC were largely a result of ETH’s status as a commodity.\n\nConsensys said it will continue to challenge the SEC in the lawsuit. The company seeks a declaration from the SEC that offering the user interface software MetaMask Swaps and Staking does not violate the securities laws.\n\nAlso Read: The Sandbox Expands Memecoin Chest With DOGE, PEPE, SHIB Purchase\n\nVarinder Singh Varinder has 10 years of experience in the Fintech sector, with over 5 years dedicated to blockchain, crypto, and Web3 developments. Being a technology enthusiast and analytical thinker, he has shared his knowledge of disruptive technologies in over 5000+ news, articles, and papers. With CoinGape Media, Varinder believes in the huge potential of these innovative future technologies. He is currently covering all the latest updates and developments in the crypto industry.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 97,
        "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTFBEU0c5bHE4X01xZ3IzYU1PM2tLNTVTb0JVRWJvUWpvSWZ6MXBzb0l0Sk1xYThPMVoyOEUyRHp3NmduUC1qZ2c4eGNNTXdkNDRqLUtKMFJQc3FuSGVHbk5vaXcwby1IaWR0TGRMRjE0cEhETVB00gF6QVVfeXFMUEEtbmY3OXVXbk1aejR5SzV4LWctUzhVM05zMTJGNVQzajFTS3M0WWdNN0RkOTlSaktNSHVYVVhjM3RmQ3lmYmhoTVF5WTNmQzZJd2ppZHE1eDZkREs3ZE13YWpzbUQzX0VkLWR6aWd3TF9fcjhBM1hlaWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 20 Jun 2024 03:22:42 GMT",
        "title": "Ethereum Price Struggle: Reaching Resistance, Facing Challenges - NewsBTC",
        "content": "Ethereum price climbed higher above $3,500 but struggled near $3,580. ETH must clear the $3,650 resistance to move further into a positive zone.\n\nEthereum is consolidating gains below the $3,650 resistance zone.\n\nThe price is trading above $3,500 and the 100-hourly Simple Moving Average.\n\nThere is a short-term rising channel forming with resistance near $3,585 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could gain bullish momentum if it clears the $3,600 and $3,650 resistance levels.\n\nEthereum Price Consolidates\n\nEthereum price started a decent increase from the $3,350 support zone. ETH formed a base and climbed above the $3,450 and $3,500 resistance levels. It even outperformed Bitcoin and broke the $3,550 resistance.\n\nThe bears are now active below the $3,600 level. A high was formed at $3,586 and the price is now consolidating gains. There was a minor decline below the $3,550 level. The price dipped below the 23.6% Fib retracement level of the upward move from the $3,350 swing low to the $3,586 high.\n\nEthereum is still trading above $3,500 and the 100-hourly Simple Moving Average. There is also a short-term rising channel forming with resistance near $3,585 on the hourly chart of ETH/USD.\n\nOn the upside, the price might face resistance near the $3,580 level or the channel zone. The first major resistance is near the $3,620 level. The main resistance sits at $3,650. An upside break above the $3,650 resistance might send the price higher.\n\nThe next key resistance sits at $3,720, above which the price might gain traction and rise toward the $3,750 level. A clear move above the $3,750 level might send Ether toward the $3,880 resistance. Any more gains could send Ether toward the $4,000 resistance zone in the coming days.\n\nAnother Drop In ETH?\n\nIf Ethereum fails to clear the $3,600 resistance, it could start another decline. Initial support on the downside is near $3,520 and the channel trend line. The first major support is $3,500.\n\nA clear move below the $3,500 support might push the price toward $3,465 or the 50% Fib retracement level of the upward move from the $3,350 swing low to the $3,586 high. Any more losses might send the price toward the $3,400 level in the near term.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone.\n\nHourly RSI – The RSI for ETH/USD is now above the 50 zone.\n\nMajor Support Level – $3,500\n\nMajor Resistance Level – $3,600"
    }
]