[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxQNVJGQ1NwZXd1TXl5WkxOVFdpSEFaMmNDc2loSktxeHk2d0drN0xtZi1Jc3JkZ0otMUk3bWRYOEEtN0p3OWRFZkVURlo4NnpaYklYMENPVy1BNHVFUkhnYksxeE5WWUxHYk4tRzhfSGNCV2FTbk02eFEtLXdYUHRKNVFxaEtLbzRVY29VMzdTSGwzckc4a3VZbUwxMDRYMW8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "What Will Allocations Look Like in Combined Bitcoin and Ethereum ETFs? - Unchained",
        "content": "After the first combined ETF was filed today, what will other issuers do regarding the allocation to BTC and ETH?\n\nAs the first combined BTC/ETH ETF was filed, what can we expect from future allocations?\n\nOn Tuesday, as the market eagerly anticipates the full approval of spot Ether ETFs, Nasdaq filed for a combined Bitcoin and Ethereum ETF. This new ETF, managed by Hashdex, will allocate 70.54% to bitcoin and 29.46% to ether. These allocations are based on the relative free float market capitalizations of bitcoin and ether.\n\nBut, is this the only way newly combined ETFs will allocate to bitcoin and ether? And what impact might this have on the market?\n\nRead more: There Are Now 11 Spot Bitcoin ETFs. Here’s the One That’s Best for You\n\nWhy Combined ETFs Matter\n\nThe introduction of combined BTC and ETH ETFs is significant for several reasons. Firstly, these ETFs offer investors diversified exposure to the cryptocurrency market without having to choose between Bitcoin and Ethereum. This diversified approach might attract more inflows, especially from more conservative investors, as it mitigates the risk associated with investing in a single asset. By holding both BTC and ETH, investors can benefit from the possible upside of both leading cryptocurrencies, potentially stabilizing returns compared to single-asset ETFs.\n\nThe structure of combined ETFs could also impact the prices of BTC and ETH. As these ETFs gain popularity, increased demand for the underlying assets could drive up their prices. If there are ETFs that allocate more to one asset or another, it could be positive for that specific asset.\n\nNate Geraci, president of the ETF Store, explains that the success of broad commodity ETFs suggests that combined crypto ETFs could find a larger audience “due to the novel nature of the category.”\n\n“Some investors and advisors will prefer a diversified approach to an emerging asset class like crypto versus attempting to pick winners and losers,” Geraci told Unchained. He believes that once additional crypto assets are available in an ETF wrapper, such as SOL or XRP, we can expect to see various index-based and actively managed strategies.\n\nAllocation Strategies\n\nGeraci believes that, as in the Hashdex ETF, the division should be reflective of their respective market caps. “Ether is currently valued at about one-third the market cap of Bitcoin. I think that’s a reasonable proxy for what spot Ether ETF demand will look like compared to spot Bitcoin ETF demand,” Geraci told Unchained. And despite the lack of staking options in the initial spot Ether ETFs, Geraci believes this won’t significantly deter demand.\n\nHowever, Geraci also expects the emergence of multiple flavors of combined BTC and ETH ETFs, including market cap-weighted and actively managed products. “Market cap-weighted products will hold BTC and ETH in the proportions described above. Actively managed ETF holdings will be dictated by the manager and prevailing market conditions,” he notes, indicating potential variability in allocations based on market dynamics.\n\nScott Johnson, general partner at Van Buren Capital, suggests that combined BTC and ETH ETFs might feature a 50/50 split or follow some type of index-weighted approach. “To the extent these come online in the near term, you might see a 50/50 or some type of index-weighted allocation,” Johnson told Unchained via email.\n\nLooking at other markets, such as Canada, where crypto ETFs have been available for several years, provides valuable insights. For example, the Evolve Cryptocurrencies ETF is weighted on a market capitalization basis and rebalanced monthly. As of the latest data, this ETF allocates 71.90% to Bitcoin and 28.10% to Ethereum.\n\nMeanwhile, CI Financial offers the CI Galaxy Multi-Crypto ETF, an actively managed ETF, and uses a rules-based, momentum-signaling strategy, allocating roughly 50/50 to BTC and ETH.\n\nLearn more: Bitcoin ETFs Explained: What Are They & How Do They Work?"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxOblFyU1N5RjJpaTNXYjhCNFVlbjAyQkY4UDdFMVNNUEoxRzQ2MW9abGVhbVRpQ0NGRkxZRlEwd0lsZThSUU9YdU1GTUxjaFRENFhlUFdHeFMzQzN6emZtV01jNGtRVFdyTTNURG95dGJGbUNsQW53QVN3N3dQREg5M0gwOEdwYjJlWFVDSWRUQ2NZSTA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 07:00:00 GMT",
        "title": "3 Reasons to Buy Ethereum While It's Below $4,000 - The Motley Fool",
        "content": "Is Ethereum on its way to a new all-time high? These three factors say yes.\n\nIn the first half of 2024, Bitcoin (BTC -2.22%) captured the imagination of crypto investors. But don't sleep on Ethereum (ETH -4.27%). Up 54% year to date, it has largely kept pace with Bitcoin, and it has one new catalyst in place that could send it soaring in the second half of the year.\n\nSo this could be the time to put Ethereum on your investment radar. There are three good reasons why it could soar past the $4,000 mark on its way to a new all-time high.\n\nThe new ETFs\n\nThe big catalyst, of course, is the imminent launch of the new spot Ethereum ETFs. If they enjoy anywhere near the same success as the spot Bitcoin ETFs, they could send the price of Ethereum soaring. During the first six months of the year, the spot Bitcoin ETFs pulled in $30 billion from investors, and that is what led to Bitcoin skyrocketing in price by 60%. The current thinking is that the new spot Ethereum ETFs could pull in as much as $3 billion in their first six months.\n\nThe only question, really, is when the new ETFs will start trading. The original consensus was the end of May. That was then pushed back to the end of June. And now SEC head Gary Gensler says it will be sometime before the end of the summer. Maybe by the time you're back from summer vacation, you'll be able to buy them.\n\nEthereum's market dominance\n\nOne underappreciated fact about Ethereum is just how dominant it is in many niches of the blockchain world. From decentralized finance (DeFi) to gaming, web3, and the metaverse, Ethereum is the clear market leader. Its blockchain technology powers so many of tomorrow's most powerful and interesting apps. That means more users, more developers, more active wallets, more transactions, and more cash flows than any other blockchain ecosystem.\n\nCase in point: In the world of DeFi, Ethereum currently accounts for 60% of all total value locked (TVL), one of the most important metrics for blockchain performance. By way of comparison, its chief rival Solana (SOL -4.85%) has only a 4% market share. Other up-and-coming rivals -- such as Sui and Aptos -- barely show up as blips on the radar. Thus, this group of \"Ethereum killers\" could pose less of an existential risk to Ethereum than originally feared.\n\nNew blockchain upgrades\n\nI can't think of another cryptocurrency that gets more attention for its blockchain upgrades than Ethereum. It has followed up The Merge (a massive blockchain upgrade) with a number of smaller technical upgrades meant to make its blockchain faster and cheaper to use. Last year, we had Shapella. Earlier this year, we had Dencun. And now the buzz is building for the next upgrade, known as Prague-Electra.\n\nThere are two reasons these stepwise upgrades are so important. First of all, they make it easier for Ethereum to fend off its rivals. Yes, Solana might be faster and cheaper to use right now, but Ethereum is doing everything in its power to narrow the gap. The ultimate goal is the ability to process 1 million transactions per second, and each new upgrade brings Ethereum closer to this target.\n\nAlso, each new upgrade helps to build confidence in Ethereum's roadmap for the future. Unlike other cryptocurrencies, which often seem to have a helter-skelter feel to their overall development, Ethereum lays out a roadmap at the start of every year and patiently explains how all the steps in this roadmap fit together. I've always viewed this process as similar to the way that publicly traded corporations give guidance about upcoming results.\n\nHow high can Ethereum go?\n\nGiven these three factors, I think there's a reasonable chance that we could be talking about a new all-time high of $5,000 for Ethereum sometime by early 2025. That's a 40% gain from today's price of $3,500.\n\nBut $5,000 may be entirely too low a future projection for Ethereum. It's not hard to find analysts predicting a price of $10,000 for Ethereum. And investment firm VanEck thinks Ethereum is on a rocket to $22,000 by the year 2030.\n\nIn many ways, this depends on how well those new spot Ethereum ETFs perform. If the end of summer comes and they still are not trading, or if new investor inflows disappoint, then it might be time to tamp down expectations. If you are comfortable with assuming that risk, it could be time to start thinking about investing in Ethereum while it's still trading below $4,000."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE13amR4SzFmSDZXZFA2RlVYaUpFdGhpcjVlZmZfVHRUd3B4NXRweklqWEpaU18waWJfNEpXYUJtVW4zdGp2akZGeWlKd3liOGtEcFVNVk1wdi1tSVJiemNTVEtqTU1nY2NvdGlsc1RWUFBLOFZvbHl6aFBoN0w2S1XSAYQBQVVfeXFMUHM3a2pWbHc0SDZnWVBQVHFiZFlJZm55YTFrU2pRcVVtSTE2ZENOTzNmaVUtS1FFTkJ2MzAtNGJZUi1FWG44RVMyV2JzMnQtMDkxaXVpLVdoQ0VTOWZMSTVsV3BTOXViakc5bkxHU0gxWDVidTdCdF84ZTFmQkZsVDNMTTVv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) to Hit $5,000 After Major Move, Says Top Analyst - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nIn a bold prediction that has captured the attention of the crypto community, prominent analyst Jelle has forecasted Ethereum (ETH) to reach an all-time high of $5,000 by the end of the year. This comes on the heels of ETH successfully turning the $3,500 level into solid support, a milestone Jelle highlighted in a recent tweet .\n\nAdvertisement\n\nCurrently, Ethereum is trading at $3,540, reflecting a slight decline of 0.33% over the past 24 hours. Despite this minor dip, there has been a significant increase in trading volume, which has surged by 22.88%, amounting to $12,881,843,193. This uptick in trading activity signals growing investor interest and potential momentum for Ethereum in the near term.\n\nAnalyst optimism amid market trends\n\nAlthough Ethereum has experienced a slight bearish trend recently, market analysts remain optimistic about its future performance. Jelle’s prediction is based on recent price action, where ETH turned the $3,500 level into a critical support zone. This technical development is seen as a positive indicator , suggesting that Ethereum has the potential to push higher in the coming months.\n\nA major catalyst for Ethereum’s projected rise is the anticipated launch of spot Ethereum exchange-traded funds (ETFs). Expected to start trading within the next couple of months, these ETFs are likely to attract substantial institutional investment, providing a significant boost to Ethereum's price. The introduction of spot ETFs is seen as a pivotal moment for ETH, potentially leading to increased adoption and market confidence.\n\nAdvertisement\n\nHowever, Ethereum’s journey to $5,000 is not without challenges. The crypto market is inherently volatile, and various factors, including regulatory developments and macroeconomic trends, could influence its trajectory. However, the underlying fundamentals of Ethereum, coupled with its growing ecosystem and the upcoming launch of spot ETFs , provide a strong foundation for potential growth.\n\nIn addition to the technical analysis, Ethereum’s development continues to progress. These advancements are expected to enhance the network's scalability, security and sustainability, further solidifying Ethereum’s position on the market. As the market evolves, all eyes will be on Ethereum to see if it can achieve this new milestone and redefine its place on the cryptocurrency landscape."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTFA3UF91bEMzd29sVjl3aE9weTNLR3UzcWw1RWluVHVkYU4xd242WW1vanp3NWM3YUg1NXdoNVBrb1Zyc3FHR21PZGpaYlFFeUs3QWx5TWxJN1EzUWxLb2JYZWtONUNzaUIzamc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Poised For $5,000 Surge Amid Rising Demand, Analyst Forecasts Bright Future - TronWeekly",
        "content": "Ethere­um (ETH) continues to captivate the cryptocurre­ncy market, driven by robust technical indicators and optimistic fore­casts from top analysts. Dr. Magic, a renowned crypto analyst, rece­ntly shared a bullish outlook on Ethereum, highlighting ke­y metrics such as increasing spot premium, rising ope­n interest (OI), and declining funding rate­s. These factors signal a strong potential for Ethe­reum’s price surge.\n\nThe­ spot premium for Ethereum, which me­asures the differe­nce betwee­n the spot and futures prices, is rising. This sugge­sts strong buying pressure in the spot marke­t, indicating growing demand and bullish sentiment among trade­rs. According to Dr. Magic, the Velo Premium chart confirms this tre­nd with a noticeable increase­ in green bars.\n\nEthereum Poised for $5,000 Surge Amid Rising Demand, Analyst Forecasts Bright Future 4\n\nAnother optimistic sign is the­ increasing open intere­st (OI), which denotes the total numbe­r of outstanding derivative contracts. A rise in OI indicate­s greater capital inflows into the marke­t and increased trading activity. The Ve­lo Aggregated Open Inte­rest section of Dr. Magic’s chart shows a steady incre­ase in candles, pointing to greate­r price volatility and investor intere­st.\n\nAdditionally, the funding rate, a periodic payme­nt based on the differe­nce betwee­n the perpetual contract marke­t and spot prices, is trending downward. This makes holding long positions che­aper, thereby ince­ntivizing more buying. The Velo Aggre­gated Funding section illustrates this tre­nd with diminishing green bars, further supporting the­ bullish sentiment.\n\nSpot ETFs Could Propel Ethereum Higher\n\nA major factor that analysts belie­ve will boost Ethereum’s price­ is the imminent trading of spot ETFs. Expecte­d to start within the next few we­eks, these ETFs will provide­ traditional investors with easier acce­ss to Ethereum, potentially le­ading to an influx of institutional money into the market. This could furthe­r enhance demand and drive­ up prices.\n\nProminent analyst Jelle­ has also projected a bright future for Ethe­reum, forecasting it to reach an all-time­ high of $5,000 by the end of the ye­ar. This bold prediction is underpinned by Ethe­reum’s successful transformation of the $3,500 le­vel into solid support. Such a technical milestone­ is seen as a positive indicator, sugge­sting that Ethereum has the pote­ntial to push higher in the coming months.\n\nEthereum Poised for $5,000 Surge Amid Rising Demand, Analyst Forecasts Bright Future 5\n\nAlthough Ethere­­um has recently expe­­rienced a slight bearish tre­­nd, market analysts remain optimistic about its future pe­­rformance. The $3,500 leve­­l has become a critical support zone, indicating pote­­ntial for upward movement. Analysts like Je­­lle believe­­ this technical developme­­nt strongly indicates Ethereum’s ability to rise­­ in the coming months.\n\nEthere­um faces challenges on its journe­y to $5,000 due to the volatile nature­ of the crypto market, influence­d by regulatory changes and economic tre­nds. However, its strong fundamentals and continuous de­velopment efforts form a solid base­ for future growth, potentially reshaping its role­ in the industry amid market shifts and anticipated de­velopments.\n\nRelated Readings | Altcoins Set to Explode: Analyst Predicts Major Bull Market Breakout"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxNSXo0Y0t5VGd4aU9jOW4yd1ZHQS1JMWJ6RHMzN1N4WUtzeVItb2FZWVoxalU3emNmODQ0emg4X3VYMUlFZGl6WmVXNy0zT0xOaGFzUE1YOGFINF9aMDhzRXZNSjIyZDVvSkFPSldwV3dGUzhKbnczTDA0SGtDbEVTM01FQ0EtRzN6emIyRmtpX2dpMUNsNTlWRWhqbTcwb2V3ZmtoMlo4WjlUUGlFNl9RaG5MbkJkWXVoZ1lIWE9vUzEzZGhvalHSAcsBQVVfeXFMT1FJa1hKbWREOHJNdW1hRUppNjRzQ1l4c1hBV2FWR1VYcXZkQm85MHlDY2c3ZHhMUlV0SnNzeXRZWXd2YV9qcEl4WEdmSzN1b1dUemcycU54YjNJeWVHaEN0RmxvZGRKMllQMGlpejlzaFdlbzFsa0hySlhqQ1NlMFN3US1oeHktckR3M1AwQ3E0Z0E5cnpsRUJXM0VzU2x1TXRpTlI5eU0xNFR0dHRaT3g0TGJPTE82WkFvdnI0RXc4blJYT0g0V0ZkUlE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "Spot Ethereum ETF anticipation wipes nearly $70 million worth of ETH - FXStreet",
        "content": "Ethereum positions worth $70 million faced liquidations in the last 24 hours.\n\nETH bulls seem to have paid a heavy price for their impatience.\n\nSpot Ethereum ETF approval could push Ether's performance on par with the rest of the top five cryptocurrencies.\n\nThe cryptocurrency market has been on a downtrend for nearly two weeks but Monday’s events showcased how impatient Ethereum (ETH) investors are. In a downtrending market, traders are usually looking for signs of reversal to maximize profits. But sometimes, false signals might end up trapping many eager bulls, and Monday was one of those days.\n\nWhile $19.81 million Bitcoin (BTC) longs were wiped on June 18, a whopping $39 million ETH longs faced the ax.\n\nBTC vs. ETH liquidations\n\nAdditionally, in the past 24 hours, total liquidation for Ethereum has hit nearly $69 million while that of Bitcoin hovers around $47 million. This widespread gap further adds to how impatient ETH holders are.\n\nLiquidation heatmap\n\nEther’s underperformance\n\nDespite the spot Ethereum ETF approval on May 23, Ethereum price rallied by less than 30% before the ETF-induced momentum was lost. Since setting up a local top at 3,977 on May 27, ETH has crashed 14% and currently trades at $3,418. Ether’s lackluster performance can be clearly seen when comparing the returns posted since 2023 with the top five cryptocurrencies based on market capitalization.\n\nSolana (SOL) tops the chart with a 1,274% gain since 2023. Following SOL is Bitcoin, with Ethereum grabbing the third spot with an 182% return. Despite being the second-largest cryptocurrency in terms of market capitalization and ETF approval, ETH still lags behind BTC.\n\nBTC, ETH, SOL, BNB, XRP performance\n\nThis is the second reason why Ethereum investors are eager to see ETH perform. With every potential uptick in buying pressure, traders tend to open long positions, hoping for the start of a magnificent rally. Between June 14’s low and June 16’s high, ETH rallied 8.67%, which was a relatively big jump in comparison to other altcoins. In line with this rally, the Open Interest (OI) also jumped from $14.69 billion on June 14 to $15.80 billion on June 17. However, the recent liquidation event has brought the OI back to June 14 levels.\n\nETH OI\n\nEthereum’s underperformance has played a pivotal role in attracting eager bulls, the partial approval of spot Ethereum ETF is another reason for making investors impatient.\n\nEthereum’s ongoing ETF approval could drag on\n\nUnlike the Bitcoin spot ETF approval, which took years to happen, the Ethereum spot ETF was given a go sign rather quickly by the U.S. Securities and Exchange Commission (SEC). But this approval wasn’t 100%, as the SEC only approved the 19b-4 forms for eight spot Ethereum ETFs from issuers like BlackRock, Fidelity, and Grayscale.\n\nWhile this development was a major win for ETH enthusiasts, but the issuers still need to get their S-1 registration statements approved by the SEC. Only after the S-1 forms are approved can Ethereum spot ETFs begin trading. Depending on feedback from the SEC and multiple revisions, it may take several weeks. However, estimates from Bloomberg ETF analyst Eric Balchunas, the S-1 forms are likely to be approved before July 2 and the trading could start as soon as the next day."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxOdWVLSDRJT3pwRUVnSmFGSzhhTWN6OGdpVEVDYTYzTDZSVXRyam1IRmZvNDlIVkVoUDRYY1A0YnIzN2JDcDFfVl82VFpIMG1rOWd0YUF0QnRIOVJJLURDTGx0LWtnSHBQT0F5aHdrRHFmT0RTQk1xVm01WVJ2T01hQ0duRDdqY2VqWWFkQWVLdk1nb3hyamhR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "Report Highlights Ethereum’s Potentially Dangerous Back-end - Brave New Coin Insights",
        "content": "Report Highlights Ethereum’s Potentially Dangerous Back-end\n\nThe Liquid Collective and Obol report says these correlation risks may impact the effectiveness of a major upcoming upgrade called Pecta, which is set to be implemented in 2025. The report says that for Ethereum to remain stable — cloud, operator, and client diversity needs to be improved.\n\nThe report, “Ethereum’s Correlation Risks: Poorly Understood, but Always Present”, explores risks like Ethereum’s slashed correlation penalties. Ethereum, like other Proof-of-Stake networks, disincentivizes bad validator behavior through slashing. If a validator messes with the network by, for example, double-signing a transaction, they lose their stake.\n\nWhat makes Ethereum different is its correlated slashing model, where if more validators are slashed at the same time, each validator loses more stake than if they had been slashed separately. This model becomes ineffective and dangerous if a single operator in the network controls several nodes. The report states that multiple nodes deployed by the same operator are likely to have similar staking practices.\n\nThe report says there are several non-malicious reasons for nodes to be slashed including – Geographical cloud outages, bugs in client software, or unintentionally long downtimes. If an operator was to get large enough, an accidental slashing event could implode the network.\n\nThe report says this risk is further compounded by issues such as;\n\nThe popular client Geth is used by 84% of the network. If it were to crash or have a bug, the consequences would be severe. Diverse client usage would mitigate this risk.\n\nPotential for regional AWS outages or policies affecting large chunks of the validator set. A greater geographical distribution of servers and operators using more cloud providers would mitigate this risk. As the image from the report shows, the Ethereum validator set is concentrated in Western Europe and the continental United States.\n\nThey note these concerns, alongside the limited adoption of Distributed Validator Technology (DVT). DVT is a form of validator security that spreads out key management and signing responsibilities across multiple parties, to reduce single points of failure and increase validator resilience.\n\nThe report also encourages future Ethereum Improvement Proposals (EIPs) to refine language around correlation penalties to mitigate risks further.\n\nQuestions About Solidity\n\nFurther to the validator and correlation issues raised in the Liquid Collective and Obol report, in a recent episode of The Crypto Conversation, Sui founder Evan Cheng also pointed to the Ethereum’s programming language Solidity as questionable from a security perspective. “People talk about security, but they still use, for example, Solidity. Well, let’s just be frank, from somebody with my background I can tell you Solidity will never, ever, ever be safe. It’s like, it hurts me. The first time I saw Solidity, I was like, no way, this is wrong. The software is written in a programming language that allows dynamic behavior which is not analyzable. So, you know, all these problems we’re seeing with reentrancy [editor’s note: reentrancy refers to a vulnerability that can occur when a smart contract function makes an external call to another untrusted contract], you know, it’s too fundamentally broken on that front. That this is what I mean by Solidity will never be safe. And this is why we are seeing and will continue to see these hacks happen, right? Because it’s the dominant smart contract language and it’s really, really bad.”\n\nConclusion\n\nCritics say to secure Ethereum’s future, it is essential to address these correlation risks by enhancing cloud, operator, and client diversity, while also continuously refining security protocols and adopting innovative solutions like Distributed Validator Technology. Only then can Ethereum ensure its resilience against potential threats."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE02YXg4RkJabXAxdlZTWmdLX1JGR2xtbmIyeVpMLWRsZ2paeFhkbTRxTXIxb2o0Y2U3SmNRdUJIa2FuZUZjdTktQXlHS242ZHBwOTNXeGt2TnllYk5oOU5JVjE3a3ZxXzlGQ01MclMzLWdTQVFzMGfSAXtBVV95cUxQZmRpMDNMajJESVo4dHRNd0dNOEFndnJuXzRaUEhHMVNuTW41MGV2bjF4X3NZay1FbVZBSzk5NzYxa0d4T0w1dkNQZ0JzUFlHT0RBUEsyZWVHZFhlZ05acVNrRmQzRkY3WW41YlJvYU85SE5xWlBseUtBZE0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "Hybrid Bitcoin and Ethereum ETF Proposed by Hashdex - U.Today",
        "content": "Brazilian cryptocurrency asset manager Hashdex intends to launch a hybrid spot exchange-traded fund (ETF) that tracks the value of Bitcoin and Ethereum.\n\nAdvertisement\n\n\"The Shares are designed to provide a straightforward means of obtaining\n\ninvestment exposure to bitcoin and ether through the public securities market, as opposed to direct acquisition, holding, and trading of spot crypto assets on a peer-to-peer or other basis or via a crypto asset platform,\" the filing says.\n\nAdvertisement\n\nHashdex plans to simultaneously use at least two custodians for the ETF (BitGo and Coinbase).\n\nThe Hashdex Nasdaq Crypto Index US ETF will be capitalization-weighted, with Bitcoin (BTC) accounting for 70.54% of the portfolio. The weightings will be adjusted on a quarterly basis to reflect changes in market value.\n\nHashdex also did not rule out that other digital currencies will be added to the mix. However, such changes would need to be approved by the SEC first.\n\nThe asset manager's Brazil-based crypto index ETF includes such assets as Solana (SOL), XRP, Cardano (ADA), Litecoin (LTC), and Polygon (MATIC) on top of Bitcoin and Ethereum.\n\nAs noted by Bloomberg Intelligence analyst James Seyffart, bringing such a product to the US would make \"complete sense as a future goal.\" He opined that \"people who believe digital assets have broader use than just what Bitcoin currently offers,\" adding that such a product would make \"a ton of sense\" for advisors that want diversified exposure to the cryptocurrency space.\n\nAs reported by U.Today , Hashdex withdrew its ETF proposal that was supposed to combine futures-based Ether contracts and spot-based Ether in late May.\n\nThe approval deadline for its new proposal should be around March 2025, according to Seyffart."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxNeUdWNGNycjJGSlZ1Z1Q5OUJZRjR3ZWR5bTNsX1ZTVVgzTWh3RVJRVmhEQkZRQkk1R1ptUXZiaUppam5kaENOVWlZODc5UHRFdm9ZOTFmdzc0bTRyaXJiOE1HRzZWN01vUUxYaEpjU3ltUld6Ni1TNi1BYWxJeXR3Nl9Vc0pQd9IBjgFBVV95cUxNY2gzREhnSWhWS0VldVQxSnowb04ySXg3aVBEQXQyLVYzZUxQVkJRaERGUEkwTFZCOXg4NFIwdWpaNld6Ql9XcmV5dS04VFVUWS02SmxSWjZQM0cxbnYxaXNaSU5pelZzRXdMRVU3emhST21BNmp0OXJRRlY2YkplMnNReU5xYzhjbmxHSHlR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum Prices Dive as Crypto Liquidations Near $500 Million - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAs the prices for Bitcoin, Ethereum, and other cryptocurrencies stayed in the red late Monday, investors saw nearly half a billion dollars in positions liquidated in 24 hours. Of $489 million in liquidations, the vast majority—over $432 million—slammed long positions, according to aggregated crypto market data from CoinGlass.\n\nMost of the day's liquidations came in the past 12 hours, as the price of Bitcoin fell as low as $64,548 late Monday and the price of ETH dipped to $3,384, leaving both down more than 5% over the prior seven days.\n\nThe overnight figures continued a flood of liquidations observed yesterday, vaporizing $290 million in mostly long positions.\n\nAbout 200,000 traders were liquidated over the last day, per CoinGlass. Per the site's metrics, the largest single liquidation order happened on Binance, a $6.4 million long bet on Ethereum.\n\nAD\n\nAD\n\nEthereum led the overall liquidation flood, with $92.5 million in positions rekt over the past 24 hours, as of writing, with CoinGlass showing Bitcoin with $72.8 million in liquidations and Dogecoin (DOGE) with $60.3 million. Shiba Inu (SHIB) and Solana saw $22.9 and $19.8 million in liquidations, respectively, over that same span.\n\nThe volatility of crypto—even with massive institutional investor interest in the case of Bitcoin—often leads to forced liquidations as its fluctuating price defies the expectations or hopes of holders.\n\nA price spike in Bitcoin and Ethereum drove over $300 million in short position liquidations in May, for example, followed by an equally sizable surge for long positions a few weeks later.\n\nEdited by Andrew Hayward\n\nAD\n\nAD\n\nDisclaimer The views and opinions expressed by the author are for informational purposes only and do not constitute financial, investment, or other advice."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQYmFYUWtLcUR0aXZGYll1NHE4WGl6Q3JNcW1tVFA1X2JyNGVWQmpQZE5SX05aa0UxSkZVTlJpZWZBSklyTmxTUzc4Rkx6eUs5alRzT3FzR3c4VlZ2Y3ZoMFV5QUJGZy1WSHVqLUdJVlNoWXhWd0VFVGZsYVhfV1ZzUnB1YVpVZDZaSTQxdkRBWGR3dUpJOVdJ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 07:00:00 GMT",
        "title": "New scaling milestone for the Ethereum (ETH) blockchain - The Cryptonomist",
        "content": "In recent days, an important milestone has been reached regarding the scaling of the Ethereum (ETH) blockchain and its layer-2 and layer-3.\n\nJust yesterday, in fact, the all-time high of the number of daily transactions recorded overall on Ethereum’s layer-1 and all its upper layers was registered.\n\nAccording to the data from L2BEAT, the average daily TPS on Ethereum’s layer-1, that is, its actual blockchain, has settled at a modest 13 tx/s, but the overall figure, which also includes the upper layers, has approached 246 tx/s.\n\nJust think that seven days ago the average TPS on layer-1 was practically the same, but with the upper levels it was just 123 tx/s, or about half. At the beginning of the year, it was only 73 tx/s, while the one on layer-1 has always been more or less around 13.\n\nThe second layer and the scaling of the Ethereum (ETH) blockchain\n\nWhat is making the most difference is the layer-3 Xai, a scaling solution for gaming created by Offchain Labs, the company behind Arbitrum One.\n\nJust yesterday it recorded a TPS of over 101 tx/s, followed far behind by layer-2 Base at about 33 tx/s.\n\nIt should be noted that there are two other upper layers that have recorded a higher daily average TPS than Ethereum, namely Arbitrum, with more than 20 tx/s, and Proof of Play Apex with almost 16.\n\nMoreover, both Taiko and Blast are also recording interesting numbers, because they are both above 11 transactions per second.\n\nL2BEAT monitors as many as 74 chains, including layer-1 (Ethereum), layer-2, and layer-3, although for about ten of these it is not managing to collect data.\n\nIn the last twelve months, the daily average TPS of Ethereum has remained more or less constant around 12 or 13 tx/s, while the overall TPS was just 30 tx/s, which is slightly more than double that recorded on layer-1.\n\nAs recently as February of this year, the overall TPS was still only at 40, but after the Dencun update in March that reduced fees on the upper layers, it skyrocketed first to 100 and then recently well beyond 200 tx/s.\n\nThis makes it very clear that by now the majority of transactions within the Ethereum ecosystem do not occur on layer-1 (the native Ethereum blockchain), because there they are relatively slow and expensive, but on the upper layers where they are faster and above all much more economical.\n\nThe fees\n\nThe average cost per transaction on the Ethereum blockchain yesterday was over $2. Five days ago, however, it was over $6, and a good ten days ago it had risen to almost $9. Not to mention the fact that on March 5th it skyrocketed to over $30.\n\nInstead, according to the data from L2BEAT, yesterday on Base the average cost per transaction was 0.4 thousandths of a dollar, or 0.0004$.\n\nOn Optimism it was 1 thousandth, and on Arbitrum slightly above 2 and a half thousandths.\n\nThe difference is truly remarkable, and this is due to the fact that on layer-1 it is not possible to reduce costs by increasing TPS, while the upper layers can scale much more easily.\n\nIt should be remembered that the average cost of a single transaction depends on the level of network congestion, so a network that supports higher TPS can clear the queue of pending transactions much faster, greatly reducing congestion.\n\nInstead, on layer-1 like Ethereum and Bitcoin it is not possible to increase the number of validated transactions per second, making it very difficult to reduce congestion in case of many requests.\n\nThe price of ETH\n\nThis remarkable increase in on-chain activity has not, however, had positive effects on the price of ETH, also because ETH is used to pay the cost of transactions on layer-1.\n\nAbout ten days ago it had risen above $3,800, but starting from Friday, June 7, it began to fall.\n\nFirst it went back to $3,600, and then it dropped below $3,500.\n\nIn particular, last Friday for a brief moment it had also dropped below $3,400, but at that point, it recorded a quick rebound that in fact then brought it back around $3,500.\n\nThe current price levels are in line with those of mid-April before the early sell-the-news on Bitcoin was triggered about a week before the halving.\n\nAt that time, the price of ETH dropped to $3,000, and then fell below $2,900 during the month of May.\n\nIt then recovered after the news of the possible approval of spot ETH ETFs in the USA (which later happened), but since we are still waiting for their actual debut on the stock exchange, there is still a lot of calm and uncertainty at the moment.\n\nIt is worth noting that the current price of ETH is still 28% lower compared to the all-time highs of late 2021, while for example that of BTC is -% from the all-time highs of March."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxOZmV5WHVZTDJxeGl5ekpGMHIwMmpTdTI2UXdVckdJSC1zSkdyR19SY3J4bWg5N01YQjJsMXVwYXNYRkRORWw3dWplSEx3aU1IMWNIbU5rNDVlLU1vZ1ByV2QweEt6MllIcnVQbTZPNXByMWI3Y29yUmhvN3Bnc2VGaVBPVmo2a2ozQ0l1TkwybHN5bDJNeFdyMmVWMVp3OUQxSUJmNTVkT0VPdnZERzYyZ29JNzRrb05IR0R0a0MzMld4aDMwb2NWQXAyMEZVYkRSUzVMb0NOT2NpYUFTT2k4MEhlWFJRQk04?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Secures 'Momentous' Win After SEC Closes Security Probe: Whale Accumulates Over $19M Worth Of ETH In Immediate Aftermath - Benzinga",
        "content": "ConsenSys, a blockchain software company, announced a major victory for Ethereum ETH/USD, following the closure of the SEC’s investigation into whether the world’s second-largest cryptocurrency is a security.\n\nWhat Happened: On Tuesday, ConsenSys took to X to reveal that the regulator will not move forward with the charges alleging that sales of Ether are securities transactions.\n\nThe announcement followed a letter sent by ConsenSys to the SEC on June 7, asking for confirmation that the Ether spot ETF approvals last month, based on ETH being a commodity, would lead to the closure of the investigation.\n\nETHEREUM SURVIVES THE SEC.\n\n\n\nToday we're happy to announce a major win for Ethereum developers, technology providers, and industry participants: the Enforcement Division of the SEC has notified us that it is closing its investigation into Ethereum 2.0.\n\n\n\nThis means that the SEC… — Consensys (@Consensys) June 19, 2024\n\nSee Also: Bitcoin, Ethereum, Dogecoin Go Sideways, But ‘Market Structure Back To Bullish,’ Says Trader\n\nConsenSys emphasized that the closure of the Ethereum investigation, while significant, does not resolve all issues faced by blockchain developers, technology providers, and industry participants under the SEC’s crypto enforcement regime.\n\nThe company now seeks a declaration that its software offering MetaMask Swaps and Staking does not violate securities laws.\n\nThe positive news also got whales excited, with one investor scooping 5,603 Ether, worth $19.6 million, in the aftermath, according to Lookonchain.\n\nAfter @Consensys posted that the #SEC had closed its investigation into #Ethereum 2.0, the whale bought another 5,603 $ETH($19.6M).\n\n\n\nThe whale has withdrawn 16,604 $ETH($59M) at an average price of $3,600 from #Binance since May 30.https://t.co/NYbgSJevaT pic.twitter.com/N3vsISPeyX — Lookonchain (@lookonchain) June 19, 2024\n\nWhy It Matters: In April, ConsenSys alleged that the SEC had been covertly targeting Ethereum for over a year, scrutinizing its nature and whether it should be classified as a security.\n\nIn response, ConsenSys filed a lawsuit against the SEC, arguing that the SEC is overstepping its authority by attempting to regulate Ether.\n\nFor context, the CEO of ConsenSys, Joseph Lubin, was one of the co-founders of Ethereum.\n\nPrice Action: Reacting to the development, Ether spiked 3.32% to trade at $3,549.33, according to data from Benzinga Pro.\n\nRead Next: Bitcoin, Ethereum, Dogecoin Trade In The Red As Summer Doldrums Kick In: Analyst Says ‘We Are Early In The Cycle’"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE5ManJrQzFMS1QxQXJTWE1hemZkcEFkaGk2QXRPb3Vma2NFdmRkc21wUzc2Wk9seXBDZllJbGlONDQzNnFaN09pXzB1VEhNeVVlb2VvQ1JGcmY0UU1tYmVrcEVuYnhYWjRDOWhCMlctd3RKdHg2MXZWUHFVNFI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 07:00:00 GMT",
        "title": "Ethereum To Surge 50% This Year Against Bitcoin - Watcher Guru",
        "content": "Ethereum is poised for a huge surge this year of up to 50% to rival Bitcoin, according to a new analysis of chain data. According to a technical setup called the inverse-head-and-shoulders (IH&S), Ether is expected to boom over the next few months, mimicking a similar bullish pattern to 2021 where it competed with BTC in terms of growth.\n\nThe IH&S pattern is characterized by the formation of three troughs below a common neckline resistance. These formations are the middle trough (head), which comes to be deeper than the other two troughs (shoulders), which are roughly of the same length.\n\nIf the IH&S pattern resolves when the price breaks above the neckline resistance after the formation of the right shoulder, the price rises by as much as the maximum distance between the head’s lowest point and the neckline resistance. In simpler terms, Ethereum’s growth between 2019 and 2021 followed this pattern. In that period, it competed with Bitcoin in terms of the best-growing cryptocurrency.\n\nAlso Read: Bloomberg Analysts Move Up Expected Ether ETF Launch to July 2\n\nEthereum And Bitcoin To Flip This Summer Following Ether ETF Approval?\n\nOn Monday, the ETH/BTC pair flipped as the head trough appeared. To begin this surge, it will next need to reach the common neckline resistance level at around 0.061 BTC. Upon doing this, Ethereum will be in business and will need to retest the neckline before a breakout commences. This breakout may see ETH boom to new highs in the coming months. You can see these patterns forming on Ethereum’s price chart.\n\nFollowing the latest approvals of Spot Ethereum ETFs, the Ether community is as bullish as ever. The news of the asset being on its way toward public trading fuels its battle against Bitcoin. While BTC remains the biggest cryptocurrency by market cap, Ethereum has always been close behind in terms of trading volume. Many bullish price predictions expect Ether to reach all-time highs next month, as soon as the SEC fully approves ETFs. When trading commences, the asset will possibly see a similar boom to Bitcoin in January 2024."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMi3wFBVV95cUxNLUVJZE40QWRpVkJzdEYwUGpOYms1OHU4ZTItUHZRZ1JhMmVseC1EQ05NQ1E2QWFPaGQwZ0RKbG5JYWtSYzFEakdvdlhNQnA4dEh1MVRHeGVjOGNnZ3o3dUJWMU1GLTNZWkNMdENBSjF3Qkg1dTAtd1FoalhYWmpHWXdfX2w1TjFvd0FGcVpzSl9yUmdGMjhvdldEX3Y5RTdya1BCV0doREZnVVY4X0pnZGFJNmtWXzZHUGxNdDV4VTJGWjBHTFdpQlpnQUwyLUxwcDFKSENXRmpLVGNUbEZv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 07:00:00 GMT",
        "title": "Mean reverting Trading System on cryptocurrencies: a strategy to exploit the false breakouts of Ethereum (ETH) - The Cryptonomist",
        "content": "In order to diversify the basket of systematic trading strategies, this article will attempt to evaluate whether it is possible to approach trading on Ethereum (ETH) with a “mean reverting” strategy based on false breakouts. Like most cryptocurrencies, Ethereum has historically shown a predominantly “trend following” behavior, therefore seeking trend reversals might seem like a counterproductive choice.\n\nWith the recent evolution of the crypto market, it might be useful to consider incorporating a strategy into your portfolio that takes advantage of the “mean reverting” trend, which seems to be increasingly present in this market as well, fueled by growing liquidity.\n\nTo do this, an attempt will be made to define a trading system that can take advantage of false breakouts at the previous session’s low levels, which increasingly often result in rebounds rather than downward trend extensions. Upon breaking the previous day’s low, the condition will be met to enter long if the price returns to the just-broken low level.\n\nStructure and initial results of the mean reverting trading system on Ethereum (ETH)\n\nThe strategy, which will be built only on the long side, assumes entering after bearish market movements with the idea that breaking the previous day’s low could lead to a rebound.\n\nThe session is calculated using the exchange’s time (normally Greenwich Mean Time, GMT) from midnight to 11:59 PM, considering a historical data series from 2016 to today (May 2024). A fixed amount of $10,000 per trade is set, with an initial stop loss of $3,000.\n\nPositive results are obtained right from the start, with a growing equity line. In the following figures, it can be seen how the total profit of the system exceeds $71,000 in just 75 trades, with an average trade of $1,100. These results might seem overly positive, but in reality, they indicate a still rough strategy, given the few very long-duration trades, as confirmed by the high value of the average trade.\n\nAlthough it provides interesting metrics, the low number of operations makes the statistic not very robust, in addition to being not very applicable in real trading given the long duration of many trades.\n\nIt is therefore appropriate to limit the duration of the trades, perhaps finding a compromise between average trade and number of operations through an optimization of the parameters used.\n\nFigure 1. Equity line of the mean reverting trading system on Ethereum (ETH).\n\nFigure 2. Average trade of the trading system mean reverting on Ethereum (ETH).\n\nFigure 3. Summary of the performance of the mean reverting trading system on Ethereum (ETH).\n\nOptimization to determine the ideal duration of trades\n\nAs a first step, we will try to limit the duration of the trades by imposing closure after a certain number of days. By optimizing between 5 and 120 days, the values in figure 4 are found. As noted from the graph in figure 5, around 55 days there is an area with good values of average trade and net profit on drawdown. This is still a rather long duration compared to the event that generates the market entry (false breakout of the previous lows), but the optimization shows that it is not possible to achieve noteworthy results with shorter duration trades. Therefore, as an example, we will choose to close the trades at most after 55 days.\n\nFigure 4. Optimization of trade duration (expressed in days).\n\nFigure 5. Chart of the main results of the optimization.\n\nThe total profit of the system has dropped to about $46,000 with an average trade of $130, values lower than the previous ones, but definitely more realistic considering that they are obtained in 354 operations, a number that makes the statistics more robust and the trade time horizon more sustainable. However, there might still be room to improve the metrics and get closer to a strategy that can be considered for live trading. For example, one could filter the entries with price patterns, trying to operate only when there are ideal conditions.\n\nAnalysis of price patterns to improve the results of the mean reverting trading system on Ethereum\n\nIn this regard, a proprietary list will be used that brings together many price combinations, different from each other, which will serve to understand in which situations Ethereum (ETH) seems to work best with the logic of false break out being tested.\n\nFigure 6. Optimization of price patterns to improve the effectiveness of trades.\n\nThe case “PtnNeutYes=4” (figure 6) identifies the days following a session with little conviction. These are days in which the “body” of the daily candle (open-close) was not greater than 75% of the total range of the daily candle (high-low). Therefore, one would want to avoid those situations where the “body” is greater than 75% of the total range of the session.\n\nIt is noted how in fact MyPtn number 4 manages to increase the average trade (152$) and the net profit (49,209$). The drawdown also decreases and stands at -6,697$. A good improvement, also visible from the shape of the equity which is decidedly more regular (figure 7).\n\nFigure 7. Equity line of the mean reverting trading system with the application of Pattern 4.\n\nFigure 8. Average trade of the mean reverting trading system with the application of Pattern 4.\n\nThese good results are certainly far from those that would have been achieved with the simple “buy & hold” of Ethereum (ETH) from 2016 to today (figure 9) in terms of absolute profits. But it must be considered that the fluctuations of the “buy & hold” are not comparable to those experienced by the trading system, making the former a definitely less sustainable approach. In addition to this, it should be noted that the trading system uses a fixed size, while applying the “buy & hold” is like reinvesting the profits obtained.\n\nFigure 9. Buy & hold of Ethereum (ETH) since 2016 with $10,000.\n\nFinal considerations on the mean reverting trading system on Ethereum\n\nIn conclusion, it has been shown how it is possible to operate with a mean reverting approach even on an instrument like Ethereum, typically trend following, which with the general growth of the mercato crypto presents more and more opportunities for reversal. The trading system developed in this article is certainly not ready for live trading, but the reader is left with the task of further experimenting and optimizing this idea to refine it and transform it into a real operational strategy.\n\nSee you next time and happy trading!\n\nAndrea Unger"
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxPb0owNWJLbnVTZXduV2Q5dlZKVFFjQWpJUVZEa3lHaEtlZVgwMzdONHJlcklHUmpEZkxQa0hsTnU3QUZRc3pZZmxNYXQ0bFYtUDlBNFhVbUpNMWZvcnJ6LUZZYlRUdFBFQUlpZ0hDd2dpY2tpdDl1Qks1aWpCZEhfeHpIVWYwanZZd1lvUWliZGpJVk0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 07:00:00 GMT",
        "title": "CryptoHeap Launches New Pooled Ethereum Staking Service for Global Users - Yahoo Finance",
        "content": "CryptoHeap\n\nMiami, FL, June 17, 2024 (GLOBE NEWSWIRE) --\n\n\n\n\n\n\n\nCryptoHeap, a leading platform in the cryptocurrency staking industry, proudly announces the launch of its innovative pooled Ethereum staking service. This new service aims to provide users worldwide, excluding those in the U.S. and U.K., with the opportunity to participate in Ethereum staking without needing to meet the high minimum requirements individually.\n\nSalvage Warwick, spokesperson for CryptoHeap , highlighted the significance of this development. \"The introduction of our pooled Ethereum staking service marks a significant milestone for CryptoHeap. This service is designed to democratize access to Ethereum staking, allowing more users to benefit from staking rewards without the need for substantial initial investments,\" Warwick stated.\n\nComprehensive Staking Packages\n\nCryptoHeap’s new pooled Ethereum staking service complements its existing range of staking packages, designed to cater to various investment levels. These staking packages provide daily rewards, capital return, and significant referral bonuses, making them highly attractive to investors. Here are the detailed packages available:\n\nArbitrum: $100 USD staking for 1 day; $2 USD daily and total rewards. Toncoin: $200 USD staking for 1 day; $4 USD daily and total rewards. Sui: $600 USD staking for 6 days; $6 USD daily, $36 USD total, and $6 USD referral rewards. Polygon: $1,500 USD staking for 8 days; $16.50 USD daily, $132 USD total, and $18 USD referral rewards. Cardano: $5,000 USD staking for 12 days; $60 USD daily, $720 USD total, and $70 USD referral rewards. Ethereum: $8,000 USD staking for 16 days; $104 USD daily, $1,664 USD total, and $128 USD referral rewards. Tron: $10,000 USD staking for 20 days; $130 USD daily, $2,600 USD total, and $170 USD referral rewards. Solana: $15,000 USD staking for 25 days; $210 USD daily, $5,250 USD total, and $300 USD referral rewards. Bitcoin: $30,000 USD staking for 30 days; $480 USD daily, $14,400 USD total, and $690 USD referral rewards. Chainlink: $50,000 USD staking for 40 days; $950 USD daily, $38,000 USD total, and $1,650 USD referral rewards. Cosmos: $100,000 USD staking for 50 days; $2,100 USD daily, $105,000 USD total, and $3,800 USD referral rewards. Uniswap: $150,000 USD staking for 55 days; $3,750 USD daily, $206,250 USD total, and $6,750 USD referral rewards.\n\nPooled Ethereum Staking: An Inclusive Approach\n\nThe new pooled staking service allows users to combine their Ethereum assets with others to meet the staking requirements collectively. This innovative approach lowers the barrier to entry, making it easier for more people to participate in Ethereum staking and earn rewards.\n\nStory continues\n\n\"Ethereum staking typically requires a minimum of 32 ETH, which can be a substantial amount for individual investors. Our pooled staking service removes this barrier, enabling users to stake smaller amounts and still benefit from the rewards,\" explained Warwick.\n\nExclusion of U.S. and U.K. Users\n\nWhile CryptoHeap is committed to providing accessible staking solutions globally, the new service will not be available to users in the U.S. and U.K. due to regulatory considerations. Warwick addressed this decision, stating, \"We understand the regulatory complexities in these regions and have decided to exclude U.S. and U.K. users from this particular service to ensure compliance and maintain the integrity of our platform.\"\n\nAdvantages of CryptoHeap’s Pooled Ethereum Staking\n\nCryptoHeap’s pooled Ethereum staking service offers several advantages, making it one of the best crypto staking platforms available today. Users can enjoy lower entry barriers, reduced risk, and the potential for higher returns through collective staking.\n\n\"We believe that pooling resources is a powerful way to enhance the staking experience. By joining forces, users can participate in Ethereum staking with smaller investments and still enjoy significant rewards. This service truly embodies our commitment to inclusivity and innovation,\" Warwick added.\n\nThe Future of Crypto Staking\n\nWith the rise of digital currencies and the growing interest in decentralized finance (DeFi), crypto staking has emerged as a popular investment strategy. CryptoHeap’s exclusive packages and pooled Ethereum staking service are a testament to its commitment to offering the best staking options in the market. These packages are especially attractive for investors looking to stake the best crypto to stake in 2024, including Ethereum and other prominent altcoins.\n\n\"CryptoHeap is dedicated to providing a seamless and profitable staking experience. Our platform is equipped with the latest technology and security measures, making it one of the best crypto staking websites in California and beyond,\" Warwick added.\n\nSecurity and User Education\n\nCryptoHeap prioritizes the security of its users' investments. The platform employs advanced encryption protocols, multi-factor authentication, and real-time monitoring to safeguard assets. Additionally, CryptoHeap offers extensive educational resources to help users understand the nuances of crypto staking, including the best ethereum staking platforms and whether staking ethereum is a good idea.\n\n\"Security and education are at the core of our platform. We want our users to feel confident and informed about their investments. Our comprehensive resources cover everything from basic staking principles to advanced strategies, making CryptoHeap a trusted platform for staking enthusiasts,\" Warwick explained.\n\nStrategic Enhancements and Future Plans\n\nCryptoHeap is continuously innovating to enhance its platform and provide users with the best possible experience. The introduction of advanced analytics tools, automated investment strategies, and user-friendly interfaces are part of the platform's ongoing efforts to stay ahead in the competitive crypto staking landscape.\n\n\"As one of the best staking crypto platforms, we are committed to delivering value and ensuring that our users can achieve their investment goals. Our focus is on continuous improvement and innovation, and we are excited about the future developments we have in store,\" Warwick concluded.\n\nWith the introduction of pooled Ethereum staking and a range of exclusive staking packages, CryptoHeap is well-positioned to meet the growing demand for crypto staking. The platform’s commitment to security, education, and innovation ensures that users can navigate the complex world of crypto investments with confidence and success.\n\nInvestors and crypto enthusiasts are encouraged to explore the exclusive staking packages and other features available on CryptoHeap’s platform. For more information about CryptoHeap’s services and upcoming enhancements, visit the official website at https://cryptoheap.com/ .\n\nMedia Contact Details\n\nContact Name: Salvage Warwick\n\nContact Email: salvage@cryptoheap.com\n\nAddress: 250 NE 25th St Apt 910, Miami, FL 33137, USA\n\nCity/Country: Miami, FL, USA\n\nWebsite: https://cryptoheap.com\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency & securities.\n\nCONTACT: Salvage Warwick salvage at cryptoheap.com\n\n\n\n"
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE05VlY3V2V3c3Fld25xZ2pnLTRFVXM1OWEzRWpyZnRyRDVNOTZqUzJMYnZmMGVwaTRjSUlaUTdHUXA3blVkcmJWMjNwX3FtQ2hWdktMUjlBVGNQN25lYUY3aGN1a0NXa2d6NVdTdklMNVU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "The dark side of tokenisation - Financial Times",
        "content": "Print this page\n\nThe writer is a law professor at the American University Washington College of Law\n\nTraditional financial institutions are increasingly showing interest in “tokenising” real-world assets, meaning they are curious about how these assets could be digitally represented by programmable tokens recorded on shared ledgers. There could be real efficiency gains associated with tokenisation, but the drive towards it could also take a dark turn.\n\nThe most dangerous outcomes would arise if tokenisation of real-world assets were pursued simply to feed into what has been described as “the perpetual motion machine that is crypto trading”. Regulators around the world have expressed concerns about the integration of crypto and traditional financial markets, because of the high levels of volatility, leverage, concentration and operational risk associated with the crypto markets. This integration would be sped up if ownership of tokenised real-world assets were recorded on so-called permissionless public blockchains. The type of ledger favoured by the crypto industry, these blockchains can be accessed by any computer running the necessary software to host them, no identification or vetting required\n\nThe tokenisation of real-world assets can and should proceed without using these problematic blockchains. Their inefficiencies are well documented, and experimentation to resolve problems in scaling their use tends to focus on processing transactions off the blockchain (defeating the stated goal of decentralisation).\n\nIt is perhaps less well appreciated that these kinds of blockchains are also plagued by governance problems. We cannot simply trust in the code of the blockchain. Public permissionless blockchains are “designed by people, maintained by people, and governed by people”, as one research paper put it. but we don’t necessarily know who these people are, who pays them, or if they’ll show up in an emergency. This is an untenable position for critical financial infrastructure.\n\nUnfortunately, BlackRock has chosen to host its tokenised Buidl fund on the public permissionless Ethereum blockchain. The good news is that some other financial institutions have taken a different path, and are experimenting with other kinds of ledgers to see if tokenisation yields efficiencies in their markets.\n\nEfficiencies can arise from programmability, meaning that software known as “smart contracts” can be built into the tokens to allow for the automation of functions, like interest payments. Smart contracts can also be used to build bespoke financial products out of multiple tokenised assets — this is known as composability. Ownership of tokenised assets can also be split into smaller pieces in a process known as fractionalisation. When ownership of all tokenised assets used in a single transaction is recorded on the same ledger, the transaction can be settled “atomically”, or simultaneously, 24/7.\n\nCross-border payments seem particularly ripe for improvement through tokenisation, but we shouldn’t rush to tokenise everything. Some purported benefits (particularly those relating to financial inclusion) are overhyped. And where efficiencies gains are real, they can invite corresponding fragilities. Even when divorced from crypto, there is a dark side to tokenisation.\n\nTokenisation promises to bring more real-world assets into the financial markets, and to engineer them into new categories of bespoke financial products both big (through composability) and small (through fractionalisation). This may unlock liquidity and efficiencies in good times, but we learned in 2008 that illiquidity, deleveraging and fire sales will be on the menu when things turn south. Discretion and forbearance (for example, with regard to margin calls) are often critical to containing the damage in these circumstances, but obligations automated with smart contracts will inflexibly self-execute regardless of context.\n\nIn addition, smart contract software provides another attack surface for hackers, and the more comprehensive the underlying ledger, the more attractive a target it becomes for cyber attacks. Atomic settlement also deprives markets of the benefits of netting of transactions.\n\nIf we think back to 2020, we learned the hard way that supply chains could become brittle when the unexpected occurred; now there is increasing interest in production strategies that are less efficient, but more resilient. We should explore tokenisation with the same mindset. We need to ask “when something is efficient enough, will making it more efficient introduce too many fragilities and be counterproductive in the long run?” In the best-case scenario, tokenisation experimentation will spur the financial industry to start thinking intentionally about this question.\n\n."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxOOGZBUWkxTTE3YmhuS0VtWTlKVGU3ZGVWUzRaOUtRZkhKYXEzZGpuQTdQNkI1WDB0TmVqcVFVSXAwOXhab3RUa2lVdlJxU0RMLWQ1RVU3OWxoaUt6NnN5bzNSemJxNU5jcjBVaUtWVmQzaEtlTmtPRUtLSVBGLXpBbmtuRDR6MXh0ZXY0Z28wcGRLTGRHczAybnhfRnFPUlBqeExTYzB2bG9pX0tmVkp4MEY0WHHSAboBQVVfeXFMTmtLdV9jakEzRHVZNElaSnQ1amlkVnFIMVMzUDFKVV9JYnNLTm1tWW9GQTdUQi0wWVZJVTZ2YURMUFZUSlM2VDNzOGVoMDUzVjBOQzNSVUpza2xJTUM3WWJvQnRFS0JvQkFkbER2MV9kQUk3MU5CYV9JVU81MHdYcjl2QlNOT0NPbkZteWs0QWdNa1dfRV9MS01YWHNIYnQ2N3AwWWQwRlNod2dXRlRDa2kzSk94SGY1OGFB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 07:00:00 GMT",
        "title": "Ethereum bolstered by hopes, Bitcoin waits for a signal - FXStreet",
        "content": "Market picture\n\nThe cryptocurrency market has lost almost 5% over the past seven days. It has not given up important support levels but also has no significant drivers to resume growth. Bitcoin lost 4.7% over the week, in unison with the market. Ethereum lost 3%, while the top altcoins' performance ranged between -7.7% (Solana) and +11.7% (Toncoin).\n\nBitcoin has been trading close to $66K since Friday, hovering around the 50-day moving average, testing the medium-term uptrend. The outcome of this test, as well as the market's direction in the short term, depends on risk appetite in global markets. It has waned due to fears over the French election and a series of weak data from the US and China in recent days.\n\nEthereum, on optimistic expectations about the ETF, was able to add over 6% after briefly dipping under its 50-day MA on Friday. However, a loss of nearly 1.5% since the start of the day on Monday makes one wary of the near-term performance. The increased liquidity on weekdays will likely play into the hands of bears rather than bulls by increasing selling interest.\n\nNews background\n\nBernstein raised the target price of the first cryptocurrency by the end of 2025 from $150K to $200K. The forecast revision is due to expectations of \"unprecedented demand from spot bitcoin-ETFs\" managed by BlackRock, Fidelity, Franklin Templeton and others. Bernstein's baseline estimate is for BTC to reach $500K by the end of 2029 and $1 million by 2033.\n\nPeter Brandt, Factor CEO, suggested that a massive sell-off of Bitcoins by mining companies could lead to a short-term drop in BTC to $60K and even $48K.\n\nSEC head Gary Gensler said approval of Form S-1 for the Ethereum-ETF is possible \"sometime by the end of this summer.\" According to him, \"individual issuers are still going through the registration process. Everything is going smoothly.\"\n\nAccording to CryptoQuant, Ethereum traders bought up 298,000 ETH (worth around $1.34B) after the Fed meeting, the second-highest daily number of coins in history.\n\nRipple Labs filed a letter demanding that the SEC reduce the fine it is requesting from $2B to $10M, using an agreement between the regulator and Terraform Labs as its argument.\n\nEl Salvador President Nayib Bukele proposed creating a private equity bank to \"diversify the financing options offered to potential investors in dollars and bitcoin.\""
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPSXVCbmtVbE1mVlhYcTRGVEd3dXR6WHNZUjF2eXVLSjJEQ1ZidzE0blA3cGVXNzFvdlV5cGxnVzhlOWlqVjNqWEV0NXAxRGVPTjNKV3hPU0xpSnhhc0ZfdkJZbkk1ZTJCcGdMZW1yekNRSkczdHRYTlhpNWlsdHU1WjJyc09lUmPSAYwBQVVfeXFMTjc4YTRVSnRVTWY1YW9oZE1KNDhhbmJ4dUVRanpIUklydk5GbnFHbjZEbTh1a29HQ2k0eFFxYXFsVlE4RDRBN29QT09QSUE2eDZHeFhKTy1uUjRjUHNkdmZSYnBPTnQ3Ukt6Ri1UbXdNd2dzMVd6SkRTNWRiaGVxQWE3STNMaXBwLXFsY3g?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 07:00:00 GMT",
        "title": "ETH/BTC Price Prediction: When Is Ethereum Price Poised Reach $4,200? - CoinGape",
        "content": "Ethereum price jumped 8% over the weekend as the asset experienced renewed investor interest. The price dipped to $3,362 before beginning an uptrend throughout the weekend. By Monday’s European business hours, ETH hovered around $3,586, marking a 1.2% increase in 24 hours but a 2.7% drop over the past 7 days. Meanwhile, Bitcoin’s price remained in a consolidation zone, with an anticipated directional move expected soon.\n\nEthereum Price Prediction: Bulls Take Advantage of Major Support\n\nadvertisement\n\nETH price witnessed an 8-day continuous fall last week, going from $3,878 to $3,362. In the drop, the asset broke a critical support level responsible for holding it above $3,650. Bears took advantage of the ensuing panic to drive prices even lower.\n\nThe bulls eventually utilized another stronger support structure between $3,400 and $3,250 to bounce Ethereum price action back into an uptrend. The asset may have entered another consolidation zone between $3,600 and $3,300, but it is too early to tell. The bulls’ main challenge lies in breaking above the $3,600 support-turned-resistance. If they succeed, ETH price may rise to $4,216, with some resistance around $3,800 and $3,900.\n\nMeanwhile, Bitcoin is at a crucial place on its daily chart, trending around a key support level ($65,000). On Friday, bears managed to push the price below the support level, but they were met with hostile rejection from the bulls. A clean break below this level would result in a further downside to $57,000. On the flip side, this support level is strong and has been tested three times before. A bounce from here may result in a BTC price surge to $72,500. A break above this might easily launch Bitcoin to new all-time high prices.\n\nSpot ETF S-1’s Will Likely be Approved by the End of Summer\n\nGary Gensler, Chair of the Securities and Exchanges Commission (S.E.C.), hinted at a likely Ethereum ETF S-1 approval by the end of summer. This news may have likely caused the reversal in Ethereum price over the weekend.\n\nMeanwhile, Ethereum blob usage has been trending up for about 5 weeks now as rollups continue to see more and more activity. Blobs improve the efficiency of Layer 2 (L2) transactions, reducing congestion and potentially cutting down on gas fees.\n\nBottom Line\n\nSpot ETFs for crypto assets have historically been great price boosters. As summer approaches an end, the crypto markets watch closely for Ethereum Spot ETF approval. By releasing this information, Ethereum investors are now in a buy-the-rumor phase that may last until the eventual approval of the ETF.\n\nRelated Articles\n\nEvans Karanja Evans Karanja is a crypto analyst and journalist with a deep focus on blockchain technology, cryptocurrency, and the video gaming industry. His extensive experience includes collaborating with various startups to deliver insightful and high-quality analyses that resonate with their target audiences. As an avid crypto trader and investor, Evans is passionate about the transformative potential of blockchain across diverse sectors. Outside of his professional pursuits, he enjoys playing video games and exploring scenic waterfalls.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMi_wFBVV95cUxNeVlFeHYtTTlXVGdqc28zb0ppcTRKek02dVN6bzZGOWZzbU9mb3NkTDdDN2FWN3lMRlNXRzQyU2pkN29pOXN3RFNMUE9pRmhUWE9ENlVVWF9GUjVFNl9SbGJYaW54SFdxUDBvaDRoTjdfRUd3ZFJxYldjUzdoNXBRQ0FTbFhiOEtDSmY1YndqX2JCQkRXWFpiZmROUmluLTZTZFZNMWFBVVNjRktwY3RjdkdsZEVXWXNnTWZzZkJYY25QLTNHRHNXSWgwYmkwOHJvSmY1QzF5R0s2LXRRQVF0UDhSSW5URHBWeU45ZEZvMlRLU2JqYUh0REVPVkNfYmM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 07:00:00 GMT",
        "title": "Crypto Market Heats Up: Ethereum ETF, Bitcoin's $85K Prediction, and Furrever Token's Referral Rewards - GlobeNewswire",
        "content": "New York City, NY, June 17, 2024 (GLOBE NEWSWIRE) --\n\nThe cryptocurrency market is buzzing with excitement as several key developments take center stage. Ethereum's anticipated ETF approval, Bitcoin's potential rise to $85K, and the growing interest in Furrever Token's unique referral rewards are capturing the attention of investors worldwide.\n\nEthereum ETF Anticipation\n\nEthereum is on the brink of a significant milestone with the potential approval of its Exchange Traded Fund (ETF) by the U.S. Securities and Exchange Commission (SEC). Market analysts predict that this approval could occur as soon as July 2, marking a crucial step forward for Ethereum. An approved ETF would offer a regulated investment option for both institutional and retail investors, likely leading to a substantial influx of capital into Ethereum.\n\nRecent comments from SEC Chairman Gary Gensler have fueled optimism, suggesting a favorable stance towards ETFs. Bloomberg's Eric Balchunas notes that the final approvals may follow minor adjustments between issuers and the SEC. This development could pave the way for a significant market event, boosting Ethereum's price and solidifying its status as a mainstream investment option.\n\nBitcoin Targets $85K\n\nBitcoin (BTC) is poised for a potential surge to $85K, driven by increasing mining costs and historical price patterns. The relationship between rising mining expenses and Bitcoin's price suggests that BTC could reach new heights as miners seek profitability. Historically, Bitcoin's price has often increased to match or surpass mining costs, indicating a potential rise to $85K.\n\nThis upward trajectory is supported by growing institutional interest and favorable market conditions. Analysts forecast that Bitcoin's price could exceed $85K, driven by heightened demand from both retail and institutional investors. The strong fundamentals and increasing mining costs create upward pressure on Bitcoin's price, making this prediction plausible.\n\n\n\n\n\nFurrever Token's Delightful Rise with Referral Rewards\n\nFurrever Token, a cryptocurrency themed around cats, is making a notable impact with its innovative approach and engaging referral system. Designed to create a joyful and engaging experience, Furrever Token aims to build a whimsical crypto ecosystem centered around delightful cat imagery and community involvement.\n\nThe token's referral system is a key feature, offering users a 10% bonus in $FURR tokens for every deposit made through their personal referral link. This incentive has significantly driven community growth and engagement, allowing users to earn additional tokens and actively participate in the ecosystem. Currently priced at $0.000732, Furrever Token offers presale investors the potential for up to 15X returns post-launch.\n\nHaving raised over $1.3 million in nearly three months, Furrever Token is in stage 9 of its presale, with a goal to raise $1.9 million. The anticipated launch on PancakeSwap is expected to draw considerable interest due to the token's unique appeal and innovative features. Furrever Token's mission to foster a fun and vibrant crypto community sets it apart in the crowded market, attracting both new and experienced investors.\n\nConclusion\n\nThe convergence of Ethereum's potential ETF approval, Bitcoin's expected surge to $85K, and Furrever Token's engaging referral rewards is creating an exciting landscape for crypto investors. As Ethereum moves closer to regulatory approval, Bitcoin aims for new highs driven by rising mining costs, and Furrever Token offers unique community-driven opportunities, this period marks a significant turning point in the digital finance narrative.\n\nInvestors looking to capitalize on these dynamic developments may find substantial rewards in the coming months. Whether you're interested in Ethereum's ETF-driven growth, Bitcoin's bullish outlook, or Furrever Token's charming and profitable ecosystem, now is the time to explore these opportunities and potentially realize significant gains. The crypto market is heating up, and these developments are set to make waves across the financial landscape.\n\n\n\nJoin Furrever Token Presale Now:\n\n\n\nFurrever Token Official Website\n\n\n\nVisit Furrever Token Presale\n\n\n\nJoin Official Telegram Group\n\n\n\nFollow Official X Account\n\n\n\nMedia Contact:\n\nRobert Smith\n\nhttps://furrevertoken.com/\n\nsupport@furrevertoken.com\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\n\n\n"
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE41V1Z0bTMyMXkyWUF4M2xvVjl2Q1BNUThIUG96S0FYLTVxM2lzRllVMjFMSEw5cGFOU3p2bXRrY0VZUDhySkpCSFVHZzBQM0NvUnBQbWtkZkRNaHExRmF6dVp2Tnp2YUh6dXlKVTNMd1F3RDR3Ny11andnSdIBgAFBVV95cUxNSDhpWjZYenYzd1g3dmlUMjBrdnNTU3VEM3BUUlNjOE1veWxCejlzRkNKTndZWU5KeGVBS2c5M1ZoMjJpRTN3dGZMZ0RRaXZhZ1NNN2xXWVo5MndWb3NyeG5MZnlpeHZ0bmc1VUxFbFpyVUtfOXlMbGFmS3VaQ2ZmUw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Wins As US SEC Ends Securities Investigation - Bitcoinist",
        "content": "The crypto industry received a significant jolt of clarity and optimism as the US Securities and Exchange Commission (SEC) concluded its investigation into Ethereum 2.0, announcing that it will not pursue any enforcement actions. This decision marks an important victory for Ethereum and could serve as a critical reference point for the treatment of digital assets under US securities law.\n\nEthereum Is Not A Security\n\nIn 2018, the SEC made a key distinction that Ether was not a security. However, by 2023, amidst evolving functionalities and the transition to Ethereum 2.0, the SEC revisited this stance, hinting at possible regulatory oversight. This shift led to increased scrutiny and uncertainty within the Ethereum community, culminating in a lawsuit filed by Consensys on April 25, 2024. The lawsuit aimed to confirm the classification of ETH as a commodity, arguing that the SEC lacked jurisdiction over its trade and governance.\n\nIn a pivotal response dated June 7, 2024, Consensys urged the SEC to acknowledge the approvals of Ethereum-based ETFs made earlier that May, which were predicated on the assumption that ETH is a commodity. Consensys argued this should conclusively end the SEC’s investigation into Ethereum 2.0.\n\nThe SEC’s Enforcement Division officially responded on June 18, 2024, as communicated in a letter addressed to Kevin S. Schwartz, attorney for Consensys. The letter stated, “We write to provide notice that we have concluded the investigation in the above-referenced matter […] based on the information we have as of this date, we do not intend to recommend an enforcement action by the Commission.”\n\nImportantly, the SEC underscored that this closure should not be seen as an exoneration or that no action may ultimately result from the staff’s investigation. Nonetheless, Laura Brookover, a lawyer at Consensys, underscored the significance of this development, stating, “The SEC sent us a closing letter in the Ethereum 2.0 investigation today. Things have changed remarkably fast since we filed our lawsuit against the SEC in late April, culminating in today’s development.”\n\nThis resolution can be perceived as a critical moment for the broader crypto industry, particularly in how digital assets are classified and regulated. Alexander Grieve from Paradigm noted the tone of the SEC’s notification, commenting, “They’re pretty hedge-y/evasive in their notification—BUT it is relatively unusual for the SEC to specifically highlight to a company that they’ve closed an investigation.”\n\nThe closure of this investigation without enforcement action could set a precedent for how other cryptocurrencies are treated by regulatory agencies, potentially easing the regulatory environment for digital assets.\n\nWhile the immediate threat of an enforcement action has been alleviated, Consensys and the wider crypto industry are looking towards further clarifications in regulatory policy. Consensys in their lawsuit also seeks a federal court ruling regarding their operations, asserting that they do not act as brokers nor issue securities through their software offerings like MetaMask Swaps and Staking.\n\nAs stated in their lawsuit, “Consensys is built on creating software products that allow people around the world to use and build on top of the Ethereum network, and it is entitled to run its business without the cost, burden, and uncertainty of an unlawful enforcement action.”\n\nAt press time, the price of Ether (ETH) has responded favorably to the SEC’s decision, showing a notable increase of 3.3%, bringing it to a current trading price of $3,561.\n\nFeatured image created with DALL·E, chart from TradingView.com"
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxQanBlMXI4OUMyR2pmc0tpandGczVCVGZnUmdUN3hTSkV4NF9nYkJmU3d0aEdYakRWYnVoemlZaDNESm1ZLU5kUlBhQzlmVE5VQnZzckFRbTVZZjBoZ2tHRnhFcTBzclRGWjVaWmhrYlNPWUl5elFnQ2ZvY192NFBvUjVGMGVubFhGSmlYdEZDb1Y5WVk2TEtuZHVtX3pxMlZyOTBCYg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 07:00:00 GMT",
        "title": "1 billion dollars at stake! Ethereum dominates the crypto market in May! - Cointribune EN",
        "content": "Mon 17 Jun 2024 ▪ 3 min read ▪ by Eddy S.\n\nIn May 2024, the crypto sector experienced a wave of investments totaling 1 billion dollars, with Ethereum dominating the market. According to a report published by KuCoin Research, although this figure represents a slight decrease compared to April, it marks a 10.61% increase compared to May 2023.\n\nEthereum reigns over the crypto market in May!\n\nThe recent research highlights that projects related to Ethereum, Ethereum Virtual Machine (EVM)-compatible chains, and layer-2 (L2) networks continue to captivate the interest of institutional investors. These technologies offer scalable and versatile crypto platforms for decentralized applications, essential to the evolving blockchain ecosystem.\n\nDespite the predominance of Ethereum-based investments, non-EVM chains such as Bitcoin, Solana, Fantom, and The Open Network (TON) have also maintained their popularity among crypto investors. With a total investment of 1.2 billion dollars in May, these networks are gaining traction due to their unique capabilities and growing ecosystems.\n\nMemecoins are also part of the game!\n\nDue to concerns over the trend of low float and high fully diluted valuations (FDV) in the crypto market, many retail investors have turned to memecoins and celebrity-associated tokens. These assets, often launched with lower market caps and more accessible valuations, have provided an alternative to high valuation tokens with limited circulating supply.\n\nNotcoin (NOT) is a remarkable example of this trend, as the token gained significant popularity in May. Unlike many tokens that gradually release their supply, Notcoin was launched with all tokens available from the start, which contributed to its rapid growth. On June 3, NOT became the fifth most traded crypto, surpassing the trading volume of the popular stablecoin USD Coin (USDC). Its price reached a new all-time high of $0.02896 on June 2, pushing its market cap above 2 billion dollars.\n\nCrypto investments in May 2024 reflect the continued confidence of investors in Ethereum and associated technologies. And this, despite a slight decrease of 70 million dollars compared to the previous month. The future seems mixed but anything is possible in the cryptocurrency space.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxNZ24tVlN0Ym9wVUtyclF1WUxVYU1kYm8xczBoUFFVUkU3d29mYzRWZXZJRDJGV1VSMWRVdHV2QzFqeHNQR2MzdnlnSmw1ZjItRklMTW9mMHlaS2JYMGdQSi1yMkFDREN4LXkwMzBPWTBJRkZpWHBpckJsZ0Y2TndmR0NUSVBuRVlGdVJKams5UUZySExramdZalNtZ0RwUWMyQk9rYWxLMXh5UVhU0gGyAUFVX3lxTE5PNjQ5LW5PUGVweHktZWF2WTRTTXFhRmhGb1hIOXdkS21DcUhLTWFRS2VJVVozeEFyZmJhV0Vjd0RyLUx5U2NFN0JNOFpBeGpYc3lScGlIVzBHY1dWXzNycnJUNmFPQUlObzlKUjhDaG1uRDNqdFNma2x0cXhFNXBBWXcxSUc3NndyM0hNUDZ5ZGNaUmNsdWlJZVpGakhhdWNXWGp1X0lham1CeUl1ODhWMmc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "Crypto Prices Today June 18: Bitcoin Nosedives To $65K, Ethereum Sinks 5% Amid Bearish Market - CoinGape",
        "content": "The crypto prices today rode a bearish wave as Bitcoin (BTC) slipped to the $65K mark, whereas Ethereum (ETH) showed signs of a pullback. Altcoins Solana (SOL) and others mainly followed, with Dogecoin (DOGE) and Shiba Inu (SHIB) meme coins noting a dip of 9%-13%. However, XRP traded in the green, defying broader market trends.\n\nThe global crypto market cap saw a significant 3.14% decline to $2.35 trillion, although the total crypto market volume from yesterday spiked 104.01% to $94.07 billion. This follows whopping outflows recorded across the crypto sector, triggered by the U.S. Fed’s recent hawkish stance.\n\nadvertisement\n\nHere’s a collection of some of the top cryptos and their price movements today, June 18.\n\nTop Crypto Prices Today\n\nBitcoin Price\n\nThe BTC price chart illustrated a faded movement today, nosediving to $65,374.98, down 1.39% over the past day. The token’s 24-hour bottoms and highs are $64,597.25 and $67,252.08, respectively.\n\nBitcoin’s dominance stood at 54.87%, a 0.93% jump over the past day. The token boasted a waned market cap of $1.29 trillion. This drop comes in the background of nearly $146 million outflows recorded in the U.S. spot BTC ETFs, per data by Farside Investors.\n\nEthereum Price\n\nETH price traded primarily in the red in the past 24 hours, falling 4.39% to $3,428.45. The token’s 24-hour lows and highs are $3,371.59 and $3,591.67, respectively.\n\nEthereum boasted a market cap of $419.50 billion.\n\nSolana Price\n\nSOL price corrected 9.25% over the past day to trade at $134.26 at press time. Solana’s 24-hour slumps and peaks are $130.16 and $148.95.\n\nXRP Price\n\nHowever, the Ripple Labs-backed crypto noted slight gains of 0.33% over the past day to reach $0.4893. XRP’s 24-hour lows and highs are $0.4808 and $0.5194, respectively.\n\nDOGE & SHIB Prices\n\nBesides, the meme coins sector mimicked the broader market’s tumbled movement. Dogecoin (DOGE) fell 9.74% from yesterday to $0.122, while Shiba Inu (SHIB) fell 12.12% to $0.00001802. Further, Pepe coin (PEPE) plummeted 11.84% to $0.00001055.\n\nAlso Read: GameStop (GME) Plunges 13% After Unexpected Announcement From CEO\n\nTop Crypto Gainers Today\n\nThe only top gainer for today was XRP, per CoinMarketCap’s data, with its price action facilitated above.\n\nTop Crypto Losers Today\n\nzkSync (ZK) price crashed 30.23% to $0.2002.\n\nFantom (FTM) price plummeted 20.69% to $0.5013.\n\nEthena (ENA) price plunged 18.89% to $0.6021.\n\nStarknet (STRK) price dipped 17.82% to $0.7444.\n\nMeanwhile, it’s also worth mentioning that BTC and ETH noted gains in their hourly timeframe charts, underscoring a tussle to gain upside momentum. Similarly, altcoins SOL, XRP, DOGE, and others followed.\n\nAlso Read: Ex-SEC Official Denies Joining Memecoin Platform\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxNN3prRFRuRlpFNmFPYm1tdEg1TW5RWGxQQkpyLTUtTmtZVlFBeXU0LUFiUThQOEY1cjVfV0ZTVzZyaThSUi1yU3Azem0taktlNU02SkJITmJmRERweC1Vck5laVlybTJ4ZFF5MDhUQkN3dFZIdXFWZFUxQTl2cUNULTFwaVl4Tmk2V3lFV1dxWGg3T05CNUw5M2hEUE9wQmVBSmlxMDhHWUwzSlBaNkHSAbMBQVVfeXFMTVJ0MnFVcnduN1JfTEE2MmJ2Sjd6Z052Q0J4SWhyTENoQVhRTDJsYUVEYWdkRS1sUGNMNTJqby1YeGxkajV1YVBFdVh0M1BFTjU0LVNQUjI2RzRiRlhTMGRGY3JYSmdGTFk4ZVQwMkZTc2Z2anRYUVVrY2M5VnpmbFMweEFRLXhJSUxRb0dfbGROeVBKclhyTWFTdEplWE5OSGlMUVN2Q3RpS0NBZGJJOVFYUk0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "Is ETH in Danger of Falling to $3K or Will the Bulls Wake Up? (Ethereum Price Analysis) - CryptoPotato",
        "content": "Ethereum’s price has landed on a decisive and substantial support region following a brief consolidation correction stage, with potential for a bullish reversal.\n\nHowever, if Ethereum sellers breach this pivot, a cascade in the market is likely.\n\nTechnical Analysis\n\nBy Shayan\n\nThe Daily Chart\n\nA closer look at the daily chart shows that Ethereum has reached a pivotal support region after a brief consolidation correction stage. This region encompasses the price range between the 0.5 ($3421) and 0.618 ($3289) Fibonacci levels, aligning with the substantial support of the 100-day moving average ($3412). T\n\nThe alignment of these support indicators highlights the strength of this critical level and the prevailing demand at this juncture, which could halt further downward pressure.\n\nA battle between buyers and sellers is expected at this pivotal price range, leading to heightened market volatility and potential liquidations. The outcome will likely determine Ethereum’s upcoming trend. If sellers overcome buyers and breach this crucial support region, a cascade toward the 200-day moving average at $2996 will be imminent.\n\nThe 4-Hour Chart\n\nOn the 4-hour chart, Ethereum formed a head and shoulders pattern, resulting in increased selling activity and a break below the pattern’s neckline.\n\nThis development and a bearish divergence between the price and the RSI indicator have heightened bearish momentum, leading to a significant downward movement. Following this, Ethereum has formed a descending flag pattern, a well-known bullish continuation pattern if breached from the upper boundary.\n\nCurrently, the price is hovering around a critical and decisive support region marked by the 0.5 ($3420) to 0.618 ($3289) Fibonacci retracement levels and the flag’s lower boundary. This area is experiencing intensified volatility and fluctuations.\n\nIf sellers break down this crucial support, an impulsive downtrend targeting the $2.9K support is expected. Conversely, if sufficient demand returns and shrinks the existing supply, a reversal towards the flag’s upper boundary at $3.6K will likely occur.\n\nSentiment Analysis\n\nBy Shayan\n\nEthereum’s price has experienced heightened selling pressure near the $4K mark, leading to a significant decline. This likely stems from participants’ aggressive interest in opening short positions near this pivotal level. Analyzing the potential liquidation levels is crucial for determining the mid-term price targets.\n\nAs the chart demonstrates, a significant amount of liquidity resides above the crucial $3.9K mark, potentially representing buy-stop orders from notable short positions around this critical juncture. This liquidity region is likely to be the main target for buyers if demand returns to the market and the price experiences a bullish reversal near the $3K threshold.\n\nReaching this crucial liquidity range would likely lead to increased market volatility and potentially trigger a short-squeeze event, where short positions are forced to cover, driving the price higher. Nevertheless, if the selling pressure continues and Ethereum fails to reclaim higher levels, the price may continue to consolidate or decline."
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxNblZ6R05wNFl0VUhwYzhzMmZtS3RYVzAtWXEyMkptckhGX2ZhWkktWmZ6OHU0d3hyUjZBQ3p2el9QTnlsYk56cW9qZ2JpZnBHbG9VVEtjTDNoRFlwa0hxakJSSEY3QnFnUDdidXlCMFctclBHS1hBLUFZMzVBTmN1TF83U0c1Ni1STVlRN2lR0gGTAUFVX3lxTE96WHdzSU1BS0VtNkdlYjZfVVlidmxnbkpDclJ2N2lGR0Z2eThmdmdjNjlVRlVTTnVqSjFhN0hNSW9SSlFJWHU1WFJxX2tlLUpGYkRTcFVWUTFzWGhja1hRMVZmZ1gzb0JVa3U3TGdsU003MkdvNzdOZUJNU2tycVRodkFqZWxSVmFuX0JRN3M2Sjlnaw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 07:00:00 GMT",
        "title": "Solana beats Bitcoin, Ethereum on THIS front: Will SOL also rise? - AMBCrypto News",
        "content": "SOL’s monthly NFT transactions were much higher than Bitcoin, Ethereum.\n\nETH’s weekly sales volume increased, while SOL and BTC dropped.\n\nSolana [SOL] continued to dominate the NFT ecosystem last month, followed by stalwarts like Bitcoin [BTC] and Ethereum [ETH].\n\nLet’s dive deep into these blockchains’ performances in the NFT space to better understand who is actually leading the market.\n\nSolana takes the cake\n\nCoin98 Analytics recently posted a tweet highlighting the performances of multiple blockchains in the NFT space.\n\nAs per the tweet, SOL was the market leader last month in terms of the total number of unique traders, as its number touched 308k.\n\nSolana was followed by Bitcoin and Ethereum, which had 129k and 74k unique traders, respectively. Polygon [MATIC] and Aptos [APT] completed the also made it to the top three of the same list.\n\nSolana also outshines the rest with a whopping 5.2 million monthly NFT transactions. On the other hand, BTC and ETH’s numbers stood at 550k and 437k, respectively.\n\nAMBCrypto’s look at DappRadar’s data revealed that STEPN, Mad Lads, and Famous Fox Federation were the top 3 NFT collections on Solana in the last 30 days.\n\nNodeMonkes, Bitcoin Puppets, and RuneStone were the top three BTC collections.\n\nMeanwhile, Bored Ape Yacht Club, Milady Maker, and Mutant Ape Yacht Club sat in the top three positions on the Ethereum blockchain.\n\nIt was interesting to note that despite topping the chart, Solana’s monthly NFT sales volume dropped by more than 40%. AMBCrypto reported earlier how BTC outshines ETH in terms of monthly NFT sales.\n\nHowever, a similar decline trend was also noted on BTC and ETH’s NFT sales volume, as they fell by 62% and 52%, respectively.\n\nNonetheless, SOL’s number of buyers and sellers increased by double digits, reflecting high activity.\n\nThings changed in the past seven days in terms of growth as ETH outperformed the rest. CRYPTOSLAM’s data revealed that ETH’s NFT sales volume increased by 17% last week.\n\nIn the meantime, SOL and BTC’s numbers dropped by 18% and 37%, respectively. Notably, ETH also had the highest sales volume of over $40 million, while SOL’s number was the lowest as it stood at $14 million.\n\nSOL, BTC, and ETH’s state\n\nWhile the NFT market witnessed a change in trend last week, all the cryptos’ prices turned bullish.\n\nOn one hand, BTC and ETH’s prices dropped by 4.4% and 3.4%, respectively, and on the other hand, SOL dropped by nearly 10%. At the time of writing, BTC was trading under $67k.\n\nAs per CoinMarketCap, at press time, ETH and SOL were trading at $3,558 and $144, respectively.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nThe bearish price actions also took a toll on these cryptos’ social metrics.\n\nAMBCrypto’s analysis of Santiment’s data revealed that SOL, BTC, and ETH’s Weighted Sentiments dropped, meaning that bearish sentiment around them was dominant in the market."
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxNalBualVGMkY0bnVsdmFHeDgtMkx4SkNJZllid2xHWS1pM1BOXzdRZUtIT0drZGZWaTVJZTBUTEZBNXFib3llV0FTZE5lV2xXY0J4eEdPZzU2emFmWG42Q0VMZjZpNGdCZFpMXzNyTzZOOHY0Z2ZPWXdqVmtyZmhIbk5lT05wV2vSAYwBQVVfeXFMTzJTdUlBUVlzellwb0h3REF0TWFtUGNObXRFRFBwUTdkamRvOVhXek5MX2lNTnlRM1pEeWRIckMwV1pZbGQ2QU1NQ2RZWHRfeEVmWGtvQkx4Tkt3VWZEY0llU242TTEtbko0bXA5NHoxU2IzdHpJTlV3dUt5U3VkUGVOTVdFdzU1Vk5wUTA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "NFT market revival: Ethereum takes the lead as sales surge - AMBCrypto News",
        "content": "NFT sales volumes grew by 10.95% over the last week.\n\nEthereum regained the top spot in the NFT sector.\n\nWhile crypto investors weren’t initially flocking to NFTs in 2024, the past few weeks have seen a shift in the market. NFT sales are on the rise, with some collections experiencing significant surges in activity.\n\nThe NFT market recently saw gains for the second consecutive week with sales up by 10.95% during this period.\n\nBlue-chip blues\n\nHowever, the picture wasn’t entirely rosy. Ethereum-based NFT big names like Bored Ape Yacht Club (BAYC), Mutant Ape Yacht Club (MAYC), and CryptoPunks haven’t seen uniform growth.\n\nCryptoPunks’ sales volume dropped a hefty 59%, and the average holding time for these digital avatars has also dipped. This suggests some investors might be offloading their Punks.\n\nMAYC, on the other hand, witnessed the same level of disinterest. The sales, though down 53% compared to earlier highs, show a different story.\n\nThe average holding time for MAYC NFTs skyrocketed by 74%, indicating investors are holding onto their Mutant Apes with confidence.\n\nApeCoin sees no love\n\nDespite the resurgence in MAYC popularity, ApeCoin, the cryptocurrency linked to these Ape collections, hasn’t mirrored the growth.\n\nApeCoin’s price has actually fallen by nearly 16% in the past month. Even if the resurgence in interest in Ethereum NFTs hasn’t helped ApeCoin, the future of the token looks extremely glib.\n\nThe rise of Ethereum NFTs like MAYC and CryptoPunks has propelled Ethereum back to the top spot in the NFT space. For months, Bitcoin dominated NFT transactions, but renewed interest in Ethereum NFTs has revitalized the network’s overall activity.\n\nAccording to CryptoSlam’s data, the Ethereum network saw $154.8 million worth of NFT sales being made on the network over the past month.\n\nThe surge in activity on the Ethereum network can also help improve the overall sentiment around ETH and help the altcoin in terms of price movement.\n\nBitcoin has been pushed to second place in terms of NFT volume. While collections like NodeMonks and Bitcoin Puppets remain popular, Ethereum’s resurgence has shifted the focus.\n\nIf activity on the Bitcoin network continues to decline and investors lose confidence in Bitcoin NFTs, the price of BTC can be affected negatively.\n\nSolana remained a close third in NFT volume, with Polygon trailing just behind."
    },
    {
        "id": 72,
        "url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxNMHJsck5LMjNpVEFqMHZBNUllQkFmY0FrSW1GQ2VLWm1SY0JtcVU5d3RXd0NmOVJQWjYweUFHdTdfZWFIZjdwS2xnTEFuRnVvRG1jYjRkZzlCdXNoZ1huZlAyUkltTklqQ1FfUGJxWU05ZlFPRm5MaW8tRU5QQmRxd01CYTVTWGZZWTRBenQ4bGhTQ2tSVTA5OE80YUR4elhNdFJnNFZKbXBQNUVabmJLanMxZlFUdzk5SDI2cl80SkowWHRfeFhmRnJJT1haYnpma2xRemRjSQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 07:00:00 GMT",
        "title": "RCO Finance Takes Crypto and Ethereum DeFi By Storm, 3 Key Features that Make It Unique - The Portugal News",
        "content": "The crypto and Ethereum DeFi space is currently witnessing the emergence of an exceptional player, and astute crypto investors can't keep calm! RCO Finance (RCOF) has made advanced AI technology accessible to all, raising a storm in the crypto world with this unprecedented solution.\n\nBy Advertiser, in Crypto · 17 Jun 2024, 12:00 · 0 Comments\n\nWe'll explore the three key features that have everyone raving about RCO Finance (RCOF) in this article and its presale opportunity poised to turn modest capital into substantial returns!\n\n\n\n\n\nRCO Finance Makes A Firm Stand With Three Key Features\n\n\n\n\n\nRCO Finance (RCOF) is not your typical DeFi project. It has quickly gained traction as a comprehensive platform for everything decentralized finance, especially with these three key features;\n\nAutomated Market Making (AMM): Unlike traditional investment platforms and even some DeFi protocols that require manual trade execution and constant monitoring, RCO Finance (RCOF) has developed a fully automated DeFi trading platform that uses advanced AI and machine learning technologies to eliminate human errors and emotions, leading to better investment outcomes and more consistent returns.\n\nReal-World Asset Integration and Tokenization: One of the biggest challenges in the crypto space has been the divide between digital and real-world assets. RCO Finance (RCOF) addresses this by enabling users to invest in stocks, bonds, and real estate using their cryptocurrencies and bypassing the hassle of converting to fiat currency.\n\nAI-powered Robo Advisor: Many market experts argue that this is RCO Finance's (RCOF) best feature yet and one of the best AI trading tools in the entire crypto industry. This intelligent system uses historical price data, live price movements, trends, and news events to create tailored investment strategies based on individual financial goals and risk tolerance.\n\nBy continuously analyzing market conditions, the Robo Advisor adjusts portfolios accordingly, helping investors of all levels to make sound and profitable investments.\n\nWith these three key features, RCO Finance has risen above the competition, providing ease of investing, a bridge between traditional and digital finance, and dynamic investment strategies. Yet it has more to offer; keep reading to explore them!\n\n\n\n\n\nRCO Finance: A Gift That Keeps Giving\n\n\n\n\n\nRCO Finance (RCOF) continues to outpace many top cryptocurrencies by leveraging AI to ensure that even novice investors can benefit from sophisticated investment strategies once reserved for professional traders. Its user-friendly interface ensures a seamless investment experience as investors can easily navigate all its features.\n\nFurthermore, RCO Finance (RCOF) equally prioritizes privacy and security by conducting thorough, regular smart contract audits. It does not require any KYC procedures, ensuring that investors maintain anonymity while complying with necessary regulations.\n\nGiven its high leverage options of up to 1000x, RCO Finance (RCOF) enables investors to diversify their portfolios extensively and maximize their potential returns, even with smaller initial investment capitals. Besides, they also benefit from the tokenization of real-world assets.\n\n\n\n\n\nTurn $100 To $3000 On The RCO Finance Presale\n\n\n\n\n\nIf you've been wondering how best to take advantage of RCO Finance’s (RCOF) diverse offerings, consider investing in the project's ongoing presale. With the coin expected to officially launch at $0.4, a simple investment of $100 can yield up to $3000 if you purchase RCOF tokens at its current Stage 1 price of $0.01275.\n\nMoreover, RCO Finance's choice to build on the Ethereum blockchain has attracted many investors. Many experts view it as the next promising Ethereum token with substantial and sustained growth potential. This sentiment is driven by RCO Finance's impressive tokenomics, deflationary mechanisms, and a clear roadmap.\n\nInvestors are also encouraged to stake their RCOF tokens for rewards that amount to one of the highest APYs in the crypto industry. This approach has driven demand and stability for the token.\n\nHolding RCOF tokens grants access to community rewards surpassing $100,000 and enables investors to have a say in key decisions within the RCO Finance (RCOF) ecosystem.\n\nFor more information about the RCO Finance Presale:\n\nVisit RCO Finance Presale\n\nJoin The RCO Finance Community"
    },
    {
        "id": 74,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxNX2g3QXduU3VQaHJ3X0JhQy1iUXZIYzc0SFFMSXVzR1VOcEliTkhFN0NUcUdRb2xnTFFPNWw2NlU3MzhBWV9GTVVqWVY5QXJ4bDZvQ0JINHdGc0c3b2NCUHFmMUpDLWdwTzZGVzdObERpTmVJQTdPREppMU83NjZOXzNIa0N4RW1LNUVYS2NnZ1g1OUdoTTNPSjhnMGQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Targets $3,300: Will ETH Rise 50% Versus Bitcoin? - FX Leaders",
        "content": "⚡ Trade Forex With High Leverage And No Limitations! – Open an Account Here\n\neth-usd\n\nEthereum is down when writing following yesterday’s contraction. Even though the community is optimistic, citing favorable fundamentals, sellers still control price action. For the Q1 2024 uptrend to be valid, Ethereum needs to close above $3,700 and reverse recent losses. If not, the odds of even more losses remain amplified going forward. Presently, the immediate support level is at $3,300.\n\nEthereum is down 3% in the last day and week. At the same time, the average trading volume is decent, at just over $20 billion. Traders expect prices to recover, shaking off the current weakness, in the days to come. When this prints out and there is a decisive high-volume breakout above the local resistance levels, participation will likely expand.\n\nTraders should monitor the following Ethereum news:\n\nEven though Ethereum is tracking lower versus the greenback, analysts are confident of its performance versus Bitcoin . By the end of the year, optimistic traders say ETH could post a 50% spike versus BTC . If this prints out, it would follow the same path as the 2019 to 2021 Bull Run.\n\nWhile the mainnet transaction processing speed remains low, scaling successes in layer-2 and 3 solutions have seen the combined TPS rise to all-time highs. This is primarily because of the explosion in processing speeds in Xai, a layer-3 platform.\n\nEthereum Price Analysis\n\nAt press time, ETH/USD is fragile.\n\nThe coin is trading below $3,700, slipping yesterday.\n\nThough the June 17 bar had a long lower wick, pointing to strong demand at the tail end of the day, earlier losses today validated bears.\n\nAccordingly, aggressive traders can short on every high, targeting $3,300. This preview aligns with the bear formation set in motion by the June 11 bar.\n\nThis outlook will only change when Ethereum soars above $3,700, ideally with expanding trading volume."
    },
    {
        "id": 77,
        "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE9faGphc0Q3R1pXclEwQnFVQTBOc3FZMGU1SE50enFhU1lvdzJuemtGRGFSVmdxU0ZJaklpUUVPU0FqdHJPc0x6dmo5dFEyTVpYR2t4MWNxS0dKNUtSWGFKUVA1WXUxX1kzbnppQTV1RTNfeFk0LVBFUmktMNIBgAFBVV95cUxPdEwtdmtNUFdqanFpZkZUaTN5TFlEMy02aVN3Vk9ydXdRTG9DdjRXNzFtaHJ4NDRscWZLcG9tUldfTmtjZ01RLVpFaGw3NHZQcEE5TG44MXJWaUZCVEtNc04xT29yU1RaRUxrY1cyNkdvWjJUalNYSzdIZFk5MldWSA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 15:02:44 GMT",
        "title": "Ethereum Foundation Moves $64.4 Million Worth Of ETH, Is This A Dump? - NewsBTC",
        "content": "The Ethereum Foundation is again in the news following its recent transaction involving millions of Ethereum (ETH) tokens. The non-profit organization’s Ethereum transactions are always significant, considering the impact they usually have on the second-largest crypto token.\n\nEthereum Foundation Transfers $64.4 Million Worth Of ETH\n\nCrypto journalist Colin Wu revealed in an X (formerly Twitter) post that a wallet (0x8e…D052) linked to the Ethereum Foundation transferred 18,089 ETH ($64.4 million) to a new address (0x87…D812). On-chain data shows that the new address has yet to transfer these funds and that the ETH holdings have yet to be offloaded on the market.\n\nRelated Reading\n\nTransactions involving the Ethereum Foundations are always concerning because the non-profit organization has a reputation for selling at the top. As such, the transaction of these funds is one to keep an eye on, considering that the potential sale of these tokens could mean that the Ethereum Foundation is again looking to catch ETH at the top.\n\nIt is worth mentioning that the Ethereum Foundation has already sold over 1,700 ETH since the start of 2024 with on-chain analytics platform SpotOnChain, noting that these transactions have always occurred ahead of a price drop. Therefore, a potential price drop if these 18,089 ETH are eventually sold is a huge possibility.\n\nDespite this development, Ethereum’s outlook is very bullish, especially with Bloomberg analyst Eric Balchunas stating that the Spot Ethereum ETFs could begin trading by July 2. These funds are expected to spark a significant rally for the second-largest crypto by market cap, with crypto experts like Ash Crypto predicting that Ethereum could rise to $10,000 thanks to these Spot Ethereum ETFs.\n\nETH To $10,000 Is The Most “Asymmetric Bet”\n\nCrypto analyst and trader Tyler Durden mentioned that the most asymmetric bet in crypto today is ETH reaching $10,000. He also highlighted Ethereum’s chart against Bitcoin and suggested that ETH was ready for that big move, considering it has traded sideways for eight months.\n\nThe analyst also suggested that the Spot Ethereum ETFs will play a massive role in Ethereum’s rise to this price level. He stated that Wall Street went through a lot of effort to get the Spot Ethereum ETFs approved and that they would ensure that they make money from ETH while pumping its price.\n\nRelated Reading\n\nMeanwhile, Durden boldly asserted that money would exit the Solana ecosystem and rotate to Ethereum. He claimed that Solana has lost its “main character and driver of liquidity”, which is why the money will flow into ETH. Interestingly, he mentioned that celebrities have “cannibalised,” which is why he believes that the capital rotation cannot happen the other way around with money moving from Ethereum to Solana.\n\nAt the time of writing, ETH is trading at around $3,500, down in the last 24 hours, according to data from CoinMarketCap."
    },
    {
        "id": 78,
        "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxQR0lNXzVaLU9xUDdOY1A0eTN6VjFVaHU5Q09Ld21Yak0xYW1MODZLdnVrUFd4VFJiU2tsMFY2bjc1dXhlV3lSNmU0VEhIMW84ZmhKWVRVelY2cF8yQTdSMmE1OW16eWZleVJzVDhGaWtKdWMwRmpscDJISURFSm0tVUpCUmNiamdRM2taUmRMN3RQdTRueWZuNXZQeEw2aUJMYWxhbTBHazlCNVZvZ3J6VHZWVmlJcmvSAbwBQVVfeXFMT0pFeC1GMkhPOGJvd1ZrSms5WUpRQ3owUmJ1ZWlYeVNlZjdZS04xbnR4OHh1RjBLREJ3TDgyeVkwZVd5cXJiWVUwZnRaanhndGxQQmZxbEkxUlV6U2lBanFnX01OZzNxR2hfNlJZcHcwSlZvYXl1ek4xRGZfWlVPWjNCMXB5YkpUMlpoVmpialAzODRTLVVWMWFSTjdWZlFQVG5JWWhCT1NTcnFZaGJ0dWNJRHVWS280WTgzcGU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Price Prediction: ETH Price To Plunge To $3.2K This Crypto Market Crash? - Coinpedia Fintech News",
        "content": "Elena is an expert in technical analysis and risk management in cryptocurrency market. She has 10+year experience in writing - accordingly she is avid journalists with a passion towards researching new insights coming into crypto erena.\n\nWith a surge of 74.63% in its trading volume and a price correction of 3.56% within the past 24 hours, the Ethereum price has plunged below its important level of $3,500. Furthermore, with the rising bearish sentiment, the market sentiments hint at a further fall in its value.\n\nNotably, the altcoin leader, ETH Price, has started this week on a bearish note by losing over 5% in valuation over the past 2 days. Moreover, the price continues its struggle to reclaim the $3,500 mark, indicating a negative influence in the crypto space.\n\nWith the ongoing cross-border market correction, will the Ethereum token make a comeback this week? Or will its price plunge toward its crucial support level of $3,200? Dive in as, in this article, we have covered the market sentiments and short-term price analysis of Ethereum crypto.\n\nETH Coin Price On The Verge Of A Major Break Down:\n\nAfter hovering close to its important support level of $3,700 for a brief period post Ethereum ETF approval by the SEC, the bulls failed to hold the value above its support level. This resulted in the Ethereum price experiencing a breakdown in its price chart.\n\nTradingView: ETH/USDT\n\nSince the breakdown, the ETH token has been constantly trading in a closed range between $3,400 and $3,700, highlighting a weak price action for the altcoin in the crypto market.\n\nMoreover, the altcoin leader has formed a symmetric triangle pattern in the 1D time frame and is on the verge of testing its support trendline, the outcome of which is uncertain.\n\nEthereum Market Sentiments:\n\nThe Simple Moving Average (SMA) displays a bearish crossover in the 1D time frame, suggesting a weak bullish sentiment in the crypto space.\n\nThe technical indicator, RSI, fails to gain momentum, resulting in it recording a bearish reversal above the mid-point. Furthermore, it is now headed toward its oversold range, highlighting an increase in the selling-over-buying pressure for the Ethereum token in the market.\n\nWill The ETH Price Go Up?\n\nIf the bulls hold the Ethereum crypto above the support trendline of the symmetric triangle pattern, it will test its resistance level of $3,730. Maintaining the value at that level will set the stage for the ETH coin price to attempt to test its upper resistance level of $4,094.75 this month.\n\nHow Low Will ETH Go?\n\nOn the contrary, if the bears overpowered the bulls, the Ethereum price will continue trading under a negative influence, break down its support trendline, and test its support level of $3,400 this week.\n\nFurthermore, if the bearish sentiment intensifies and the bears continue to dominate the market, the ETH token will plunge further and prepare to test its crucial support level of $3,000 during the coming time.\n\nAlso Read : Bitcoin, Ethereum, And XRP Price Prediction: Is The Bull Rally Over?"
    },
    {
        "id": 79,
        "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE95cUF3VXh2MzNUb1pKTDA2MXNSR3hieXZ0NlpxNjNpVFY0TVpCZlBZbGdnaGtmc21pcnY3OUhyR0t5anNtZW9lVlpPRXBKMzdwOTRXV0ZiRkc3Zw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Price Down: Why is ETH Price Crashing? - CryptoTicker.io - Bitcoin Price, Ethereum Price & Crypto News",
        "content": "With Bitcoin (BTC) experiencing a week-long downward trend, Ethereum's price has also felt the impact of this market pressure, mirroring the current volatility in the cryptocurrency market. Ethereum (ETH) has seen a notable decline in its price lately. This fluctuation highlights the ongoing instability and interconnectedness of cryptocurrency prices. Yet, Why is Ethereum price crashing? Let's take a look at this in more detail.\n\nHow has the Ethereum Price Moved Recently?\n\nETH/USD Daily Chart- TradingView\n\nAs of today, Ethereum is priced at $3,561.84, with a 24-hour trading volume of $12.75 billion, a market cap of $427.91 billion, and a market dominance of 17.63%. Over the last 24 hours, ETH has seen a slight decline of 0.30%.\n\nEthereum hit its peak price of $4,867.17 on November 10, 2021. Its lowest price was $0.420897, recorded on October 21, 2015. Since reaching its all-time high, the lowest price ETH has dropped to is $897.01. The highest price it has reached since this cycle low is $4,094.18. Currently, the sentiment for Ethereum price predictions remains neutral, with the Fear & Greed Index showing a reading of 71, indicating a state of greed.\n\nThe circulating supply of Ethereum stands at 120.14 million ETH. Over the past year, the supply has decreased by 0.24%, equating to a reduction of 292,161 ETH.\n\nWhy is Ethereum (ETH) price down?\n\nThe decline in Ethereum's price can be attributed to several key factors. First, the anticipation of an important Federal Reserve interest rate decision and the release of U.S. inflation data are creating uncertainty in the market. Investors often react to such economic indicators with caution, leading to a decrease in buying activity.\n\nFurthermore, there is a noticeable shift in the behavior of Ethereum's largest holder groups. These major stakeholders are showing a reduced tendency to accumulate more ETH, which is contributing to increased selling pressure in the market. This combination of macroeconomic concerns and changes in accumulation sentiment among significant holders is driving the current downward trend in Ethereum's price.\n\nWill Ethereum Reach $4000?\n\nThe potential for Ethereum to reach the $4000 mark is supported by several key indicators and market dynamics. Over the past year, Ethereum's price has increased by an impressive 106%. This significant growth showcases robust demand and strong investor confidence in ETH. Such a substantial annual performance suggests a positive trajectory that could potentially drive the price towards $4000.\n\nIn addition to its overall growth, Ethereum has outperformed 50% of the top 100 crypto assets over the last year. This relative strength indicates that Ethereum is not only growing but also maintaining a competitive edge in the broader cryptocurrency market. This competitive position often attracts further investment and interest, contributing to price appreciation.\n\nFrom a technical perspective, Ethereum is currently trading above its 200-day simple moving average (SMA), a widely followed indicator used to assess the long-term trend of an asset. Trading above the 200-day SMA suggests that Ethereum is in a sustained uptrend, providing a favorable condition for reaching higher price targets like $4000. Moreover, in the past 30 days, Ethereum has experienced 16 green days, accounting for 53% of the time. This positive momentum reflects consistent buying interest and bullish sentiment among investors, which, if sustained, could support further price increases.\n\nHigh liquidity, backed by Ethereum's substantial market cap, ensures that large trades can be executed without significantly impacting the price. High liquidity is crucial for sustaining price increases, indicating a healthy market where buying and selling activities can occur smoothly. This liquidity, combined with the other positive indicators, provides a solid foundation for Ethereum's potential rise to $4000.\n\nWhile the path to $4000 is not guaranteed and depends on multiple factors, the current indicators and market conditions suggest that it is possible. Investors should stay informed about market trends and macroeconomic factors while considering both the opportunities and risks involved. Continued positive market sentiment, stable or improving macroeconomic conditions, and ongoing technological and ecosystem developments within Ethereum can significantly bolster its chances of reaching this price level."
    }
]