[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxPTFRPbGlUa3BETjlkYWttWDB2MU1RN25PR1I1b0VyOUs3NHpER19BWDJ3VV9PU2ZfWEdJeVBrd2ItMnJ3MENxc1dFZktRX0hCVUNvNmsxRno1al9WSUc3Ujc0ekU4QVQyRkpsUUtnWTZPQng2ZG9nbVlSbldnYXhic3hRdTVlVnhtWlRpU0swRlFqTmpHb1dUXzVrdEdHOGVpLUZYNGdRQ181Zw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Jun 2024 07:00:00 GMT",
        "title": "Investing in Ethereum ETFs: What to Know - The Motley Fool",
        "content": "Ethereum (ETH -6.21%) exchange-traded funds (ETFs) offer a convenient way to invest in the second-largest cryptocurrency by market capitalization in a manner similar to buying stocks. Much like the early days of Bitcoin ETFs, the landscape for Ethereum ETFs currently features futures-based options, while spot ETFs are still pending regulatory approval.\n\nDefinition Icon Cryptocurrency Cryptocurrency is decentralized and secure digital money, based on blockchain technology, that offers new investment opportunities.\n\nIn this article, we'll explore the available Ethereum ETFs, examining both the futures-based products currently accessible and the potential future of spot Ethereum ETFs. We'll also provide guidance on how to invest in these ETFs, offering insights into their structure, the benefits they offer, and considerations for investors looking to add Ethereum exposure to their investment portfolios.\n\nImage source: Getty Images.\n\nWhat is it? What is an Ethereum ETF? The easiest way to understand Ethereum ETFs is to break them down into two main components. Ethereum itself is a blockchain platform with its own cryptocurrency, Ether (ETH). It's widely used for its smart contract functionality, which enables automatic, decentralized agreements that execute when their conditions are met.\n\nDefinition Icon Ethereum (ETH) Ethereum is a blockchain created in 2015 that is supported by a decentralized network of computers all over the world.\n\nAn ETF is an open-ended investment fund that holds assets like stocks, commodities, bonds, or even cryptocurrencies. ETFs are unique because they trade on stock exchanges much like individual stocks, offering the liquidity and accessibility that typical mutual funds do not. Combining these, an Ethereum ETF is a type of investment fund that either holds Ethereum directly or invests in related derivatives like Ethereum futures contracts. This setup allows investors to gain exposure to Ethereum's market movements without buying and holding the actual cryptocurrency through a crypto exchange or dealing with the complexities of digital wallet security. Essentially, when you buy shares of an Ethereum-based ETF, you're indirectly investing in Ethereum's performance with all the trading ease of traditional stocks. Holdings What do Ethereum ETFs hold? Due to regulatory constraints, U.S. Ethereum ETFs are currently unable to hold Ethereum directly. Instead, these ETFs gain exposure to Ethereum through Ethereum futures contracts traded on the Chicago Mercantile Exchange (CME). These futures allow investors to speculate on the future price of Ethereum without the challenges -- such as security and custody -- of managing actual cryptocurrencies.\n\nSince these futures are based on Ethereum's anticipated future price, they provide a method for investors to gain indirect exposure to Ethereum's price dynamics. Due to the nature of futures trading, which requires a margin, it is common for Ethereum ETFs to maintain significant holdings in cash or cash equivalents. Low-risk assets, like money market funds, commercial paper, or Treasury bills, are often used as collateral for these trades. This setup ensures that the ETF can meet potential margin calls during periods of high volatility, thereby securing the leveraged positions taken on futures contracts. What is Ethereum? What is Ethereum? Ethereum, launched in 2013 by Vitalik Buterin, is a comprehensive decentralized finance (DeFi) platform for decentralized applications (dApps) and smart contracts that run autonomously without a central authority. Ether is Ethereum's native cryptocurrency and is essential for operating dApps and executing smart contracts. It serves as \"gas,\" paying for the computational resources needed to execute operations and giving Ethereum its value. Ether trades on various cryptocurrency exchanges and is used both as an investment and a utility token. In September 2022, Ethereum underwent a major update, transitioning from a proof-of-work (PoW) to a proof-of-stake (PoS) system. This shift significantly reduced the platform's energy consumption by changing how transactions are verified and blocks are added to the blockchain. Instead of miners solving puzzles, validators now stake Ether to earn the right to validate transactions and yield, enhancing Ethereum's sustainability and scalability. Spot ETFs Spot Ethereum ETF approval While Canadian securities regulators have allowed spot Ethereum and other cryptocurrency ETFs to trade since April 2021, the U.S. Securities and Exchange Commission (SEC) has been slower to adopt similar measures. This landscape shifted significantly on May 23, 2024, when the SEC finally greenlit spot Ethereum ETFs. However, these ETFs have not yet started trading in the market since the SEC still needs to approve the individual prospectuses submitted by ETF issuers aiming to launch these products. SEC Chair Gary Gensler has suggested that the process should be completed by the end of summer, although no specific timeline has been confirmed. Once these approvals are in place, though, spot Ethereum ETFs will be allowed to begin trading on exchanges.\n\nHow to buy How to invest in Ethereum ETFs Investing in Ethereum ETFs is straightforward and follows the same procedure as trading any other ETF or stock. Here's a step-by-step guide to help you get started: Figure out your position size: Decide how much of your portfolio you want to allocate to Ethereum ETFs in terms of dollar value. Consider whether this investment fits with your overall risk tolerance and investment strategy versus regular stocks. Pick the right ETF: In the next section, we've provided a table of the major Ethereum ETFs currently available. Choose the one that best meets your needs based on factors like fees, liquidity, and past performance. Search the ETF on your brokerage: Locate the ETF by typing its full name or ticker symbol into your brokerage's search function. Make sure you select the option for \"shares\" or \"equity\" to ensure you are purchasing the ETF itself and not options based on it. Enter an order: Specify the number of shares you wish to buy. You can place a market order, which executes the trade at the next available price, or a limit order, which sets a maximum price you are willing to pay and executes only if the share price meets or falls below this threshold. Finishing up: If your order is successful, your brokerage account will reflect the purchase, with the ETF shares added and the corresponding amount of cash deducted. Top three Top three Ethereum ETFs Here's an overview of the largest Ethereum ETFs on the market in terms of assets under management (AUM):\n\nLargest Ethereum ETFs by assets under management, June 2024. Fund Name Ticker Symbol Net Expense Ratio ProShares Ether Strategy ETF (NYSEMKT:EETH) 0.95% VanEck Ethereum Strategy ETF (NYSEMKT:EFUT) 0.66% Bitwise Bitcoin and Ether Equal Weight Strategy ETF (NYSEMKT:BTOP) 0.85%\n\nRelated investing topics\n\nOutlook An outlook for Ethereum ETFs Currently, investors can trade Ethereum futures ETFs, and with the recent SEC approval, spot Ethereum ETFs are expected to hit the market soon. The ETFs offer the convenience of trading through a regular brokerage account, eliminating the need for a crypto exchange or self-custody of digital assets. However, it's important to note that these ETFs incur expense ratios and do not offer the 24/7 trading capability that direct investments in the cryptocurrency sector provide. Looking ahead, much like Bitcoin ETFs, which have attracted significant investor interest and led to new price highs for Bitcoin, Ethereum ETFs may similarly benefit from substantial inflows and expanded interest from retail investors.\n\nFAQ\n\nInvesting in Ethereum ETFs FAQ Which Ethereum ETF is best? angle-down angle-up There's no universal answer, but the VanEck Ethereum Strategy ETF (NYSEMKT:EFUT) is a great candidate with a lower 0.66% expense ratio. Is there an Ethereum ETF in the U.S.? angle-down angle-up U.S. investors can currently buy Ethereum futures ETFs. Spot Ethereum ETFs, which were recently approved, are still awaiting launch. How to get Ethereum ETFs? angle-down angle-up You can buy shares of Ethereum futures ETFs via most brokerages. Spot Ethereum ETFs are still unavailable. Is there an Ethereum spot ETF? angle-down angle-up Spot Ethereum ETFs are available on Canadian exchanges, denominated in both Canadian and U.S. dollars. U.S.-listed spot Ethereum ETFs are still unavailable, although they have received regulatory approval."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxPUml2Q3ZzOWhLLWcxRzRyNDRLNkhQdnQxUmhxcmVSbW9rMVlGVTFBS1l5YjNqdFE5dkJOSkpzZWJ5bnZfZUpmMXQwMUFwSE5ON1ZjcTh3T3JjZDZzWUpoYllDbE9KV19hTFFXWVFWU0tzLU1DY0huY1ROS0RWZnY1Mw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jun 2024 15:24:51 GMT",
        "title": "Ethereum hits longest inflationary period since Merge - Blockworks",
        "content": "Ethereum is in the midst of its longest inflationary period so far. And “blobs” could be to blame.\n\nThe circulating supply of ether has now risen steadily for almost 72 days in a row, having added nearly 50,000 ETH ($168.7 million) since the middle of April.\n\nETH holders benefit from any net supply burns due to increased scarcity. However, the opposite is currently happening — ETH is becoming less scarce — now that Ethereum’s base fee is sitting at some of its lowest points in the past two years.\n\nAll while the number of Ethereum mainnet transactions has gone up and layer-2 activity has exploded.\n\nRead more: Blob base fee surges, Ethereum misses slots as ‘BlobScriptions’ go viral\n\nETH has only turned inflationary for an extended period on a handful of occasions since the Merge in September 2022, the longest being a 40-day stretch shortly after the hard fork and a 30-day period late last year.\n\n(There’s no universal standard for when ether is in an inflationary period. For the purposes of this piece, inflationary periods begin when the total ETH supply increases at least three days in a row, and vice versa.)\n\nThe purple line shows the total ETH supply since the Merge. Weekly fee spend is in blue, and inflationary periods are marked by the purple bands.\n\nEther is inflationary because there are far fewer base fees to burn. The Dencun update in March made special room in every block for layer-2 networks to settle “blobs” of transactions without bidding against regular mainnet users.\n\nThis, combined with more efficient data availability through proto-danksharding, led to massively reduced competition for block space.\n\nWith enough block space for everyone — including layer-2 users via blobs — Ethereum base fees have nosedived 90% since Dencun, making it more likely that every block issues more ETH than can be burned.\n\nOn top of ditching proof of work for proof of stake, the Merge allowed ether to turn deflationary on a per-block basis. Ethereum’s base fee, which users pay to transact on the network, had previously gone to miners as part of their reward for spending electricity to discover blocks.\n\nEthereum’s base fee is way down, layer-2 activity is way up, and mainnet activity is growing slowly\n\nBut without any electricity costs post-Merge, the total block reward would have far exceeded overheads. This could’ve skewed the currency’s supply distribution over the long run, with validators eventually accumulating a disproportionate ETH that would be almost pure profit.\n\nTo make many things fairer for regular users, developers opted for base fees to be burned. Validators instead receive a mixture of priority fees, reduced block rewards, and if they activate it, additional MEV yield.\n\nThe reward per Ethereum block right now is just over 2 ETH ($6,800) with fees contributing less than 2.5%. Proof-of-work Bitcoin is paying almost 3.3 BTC ($200,000) per block, although with significantly higher costs.\n\nTo be clear, Ethereum has burned a ton of supply since the Merge, although most of it was pre-blobs. Overall, 1.71 million ETH ($5.8 billion) has been burned and 1.36 million ETH ($4.46 billion) has been issued, resulting in a supply reduction of 346,000 ETH ($1.17 billion).\n\nRead more: Ethereum’s Justin Drake is unconcerned despite ether’s middling year pricewise: Q&A\n\nThat puts ETH deflationary by 0.161% per year.\n\nIf Ethereum were still running on proof-of-work, the supply would have gone up by 6.76 million ETH ($22.87 billion) — yearly inflation of over 3%.\n\nSo, even with its recent inflationary bent, holders are still way better off, albeit slowly and slightly diluted.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the Forward Guidance newsletter.\n\nGet alpha directly in your inbox with the 0xResearch newsletter — market highlights, charts, degen trade ideas, governance updates, and more.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxQS2dGeUZlMGxPRDBNbWlEaDE5ajdJNFZ5dDZPY09WSENUSmJwUnVvSDdKWTRoeHk3aW1HS1luRU5uTXA1V19YdzduenUyVkdpNGhNWG1YWTFyeENSV1h3eTZjRjBJUGw3ZVBxcHJjVGNjUHNqb1prZGN3dWJnNjhGN3Z4bTNXZl80LUlzb0FNaFFXc3g5WWRlS1ZSV3BCblJtTXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Faces Challenges Amid Price Struggles and High Fees - The Dales Report",
        "content": "The TDR Three Key Takeaways regarding Ethereum and Its Challenges:\n\nEthereum price movement, dipping to $3,250 before a slight recovery to $3,400, has raised concerns among investors. Economic factors such as inflation and rising interest rates still pose significant challenges for Ethereum. The futures market’s sentiment indicates that a rally to $3,700 is highly unlikely in the near term for Ethereum.\n\nEthereum faced significant price struggles, dropping to its lowest level in over a month. This price movement, dipping to $3,250 before a slight recovery to $3,400, has raised concerns among investors and analysts alike.\n\nThe primary focus remains on the upcoming launch of a spot Ethereum ETF. Despite initial excitement, analysts have tempered their expectations. Stephen Richardson, managing director of financial markets at Fireblocks, expressed skepticism and reported on Cointelegraph, stating he expects significantly lower inflows at the Ethereum ETF launch. This cautious outlook stems from broader economic challenges, including inflation and high-interest rates, which continue to affect the cryptocurrency market.\n\nRegulatory scrutiny around Ethereum has eased, creating a more favorable environment for investors. However, economic factors such as inflation and rising interest rates still pose significant challenges. These macroeconomic trends impact consumer confidence and investment behavior, affecting the overall attractiveness of Ethereum.\n\nOne of the critical issues Ethereum faces is its high network fees. The blockchain’s gas fees can deter users, pushing them towards other networks like BNB Chain and Solana, which offer lower fees. This competition is evident as these alternative blockchains capture more volume and generate significant daily revenue, despite having fewer deposits. ETH’s weekly revenue is relatively low compared to its market capitalization, raising questions about its valuation and growth potential. Markus Thielen, head of research at 10x Research, reported on Cointelegraph pointed out that the revenue it generates is minuscule compared to its market capitalization, indicating that the asset does not currently represent a viable, sufficiently cash-flow-producing investment.\n\nSentiment in the Ethereum futures market has shifted to a neutral range. This change reflects a lack of strong bullish sentiment, as evidenced by the futures premium falling below 10%. The cautious stance of professional traders highlights the uncertain outlook for ETH. The futures market’s sentiment indicates that a rally to $3,700 is highly unlikely in the near term.\n\nAdditionally, Ethereum faces stiff competition from other blockchains like Tron and Solana. These platforms, despite having fewer deposits, manage to generate significant daily revenue, underlining the competitive challenges ETH must overcome.\n\nEconomic conditions, consumer confidence, and interest rates impact Ethereum’s market dynamics. High network fees, competition, and economic factors present challenges, and analysts are skeptical about significant gains from the upcoming spot Ethereum ETF launch. A rally to $3,700 seems unlikely in the near term.\n\nWant to be updated on Cannabis, AI, Small Cap, and Crypto? Subscribe to our Daily Baked in Newsletter!"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxNbFNWeUV6U2ZERkVwWktTaGQ0QUVTa0xSVUQ2bGNCUUpHTGFxRjJJbVExYmpfUEdtM09RX1FrOVRzMlFGRW1mZmhoV2VERTRpcXNWSTAydWxnSGQ0U2RTSHdSNTZRT2gxbTNBQWpEV1VCQW1CLVhSTmFMa3ZaYXFaMUEzc3lINjhEckx5aVVBQkNNUXczNnJXQXNNQ1NPXzRrU2xPTURka0Y5OU1LN1lLNWR0MHliVnlpRFN0NA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jun 2024 07:00:00 GMT",
        "title": "SEC Chair Gensler Says Ethereum ETF Review 'Going Smoothly' - Benzinga",
        "content": "U.S. SEC chair Gary Gensler highlighted on Tuesday the smooth progress of Ethereum ETF filings, indicating that the final decision lies with asset managers to make full disclosures for the registration statements to go effective.\n\nSpeaking at the Bloomberg Invest Summit, he said, “I don’t know the timing, but it’s going smoothly,” when asked about the possibility of seeing an Ethereum ETH/USD ETF in the coming weeks.\n\nHe elaborated, “It’s really about the asset managers making full disclosure so that those registration statements can go effective.”\n\nThe SEC chair noted Ethereum futures ETFs are already available, having gone live last year.\n\nHowever, the potential introduction of a spot Ethereum ETF has generated significant excitement in the crypto community and financial markets.\n\nGensler was also asked about the increasing political discourse surrounding cryptocurrency, particularly comments from former President Donald Trump.\n\nAlso Read: Congressman Matt Gaetz Introduces Bill To Allow Federal Tax Payments In Bitcoin\n\nIn response to whether this political momentum surprises him, Gensler reiterated his role as a securities regulator, focused solely on protecting investors and ensuring market integrity.\n\n“I don’t speak about elections,” when questioned about the intersection of cryptocurrency and the upcoming presidential election, when asked about former President Trump's increasing support for cryptocurrencies and criticisms from figures such as Mark Cuban.\n\n“I just really look, my role as a securities regulator, as chair of this great 5,000-person agency that oversees $120 trillion capital markets. We are here to look out for investors, look out for issuers, and, where appropriate, to be a cop on the beat,” he stated.\n\nRepublican presidential candidate Trump has been vocal in his support for cryptocurrency, promising to advocate for Bitcoin mining and to accept political donations in crypto.\n\nAt a recent event at Mar-a-Lago, Trump criticized President Joe Biden’s stance on digital assets, vowing to end what he termed Biden’s “crusade to crush crypto.”\n\nRead Next: FTX Faces Customer Backlash Over Proposed Liquidation Plan\n\nPhoto: Shutterstock"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxNeFVfUmszbVBzZExEVUROY0x3RjMtVEtoQVRDckNVc3dfODBzWVRJbzRkeG0wNWJTWkZKMjB6OEgydzRoRDNSMkpvd0I3WjhJa3RGaXpMTHZEVnpuN1hnR3lqV1kwaC1vNEl6bDhqblQwcXBjYl9aOGZ2QlFNa0tMZUtFVElSSFNDYlZ5OExFZEZrb1RsbEx1MVZYanY5Z3BsVVVhOHRxWjDSAa4BQVVfeXFMUDZlUHU2U0l5RjlVbkZzUDFMMTJuZEh0dTVWd0RRYlJnc2xyNkJRT3hYU2pRd2RXdVI2RGR5RUVTWDNMaVF1d3pTbzNra2Ewdm1iVm5aLTVyRjExamduLTlLS3hRWVdCQkJPd3RuMk1RTnhMY0ktdlFXQ2c0cjkzeGxIcmMxZWFaemlQYmV3YmF4WGVydjNxYVJ0MkZlby1XN184Y3JaZkt5VzRlMUZn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Jun 2024 07:00:00 GMT",
        "title": "Still Ultrasound Money? Here’s How Much Ethereum Supply Has Inflated Since Dencun - CryptoPotato",
        "content": "Ethereum’s status as an ultrasound money system becomes increasingly questionable as the days go by, especially as its supply keeps increasing at a high rate.\n\nSince mid-April 2024, about a month after the Ethereum network underwent the Dencun upgrade, more than 112,000 ether (ETH) has been added to the market at the fastest daily rate after the Merge.\n\nThe Effects of Dencun\n\nOver the years, Ethereum has witnessed several developments that have led to the network are we know it today The Merge in September 2022 marked its transition from a proof-of-work consensus mechanism network to that of proof-of-stake.\n\nIn mid-March, Ethereum underwent another upgrade that reduced the transaction fees of its layer-2 networks by roughly 4x and enhanced the blockchain’s scalability by expanding its capacity. Dencun introduced nine Ethereum improvement proposals (EIPs), including EIP-4844, which implemented proto-danksharding, a mechanism that allowed for data blobs.\n\nWith blobs, layer-2 solutions like Arbitrum, Optimism, and Polygon became able to submit transaction data to Ethereum for collective settlement within a dedicated blobspace without additional expenses.\n\nIt is worth noting that Ethereum implemented some upgrades to ensure it remained deflationary before Dencun came. One such was the London upgrade that took place in August 2021. London introduced a mechanism that removed ETH from circulation with every transaction by burning a portion of the network’s gas fees. The Merge further cemented this approach to deflation and lowered ETH’s inflation rate by 90%.\n\nETH Now Inflationary\n\nSince Dencun, Ethereum’s transaction fees have been low, meaning less ETH has been burned. On-chain analysts believe Ethereum is no longer deflationary, as the new ETH supply has turned positive. The amount of fees burned on Ethereum is no longer positively correlated with higher network activity; fewer fees are burned regardless of how many users are transacting on the network.\n\nNevertheless, the total supply of ETH since the Merge has plunged significantly, with an overall reduction of 345,000 ETH. Around 1.36 billion ETH has been issued, but more than that has been burned.\n\nWith Ethereum’s inflationary rate increasing post-Dencun, the purchasing power of ETH is reducing, which may have a negative impact on investors.\n\nMeanwhile, ETH was worth $3,374 at the time of writing, down 4.8% in the past week in correlation with the drawdown in the crypto market."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxQQ1N2U0VCREp2YzhIemRwS01Pc0tFc3U1ZHF6a3E5MEhKdWg2amd4c2hBTmNZWGUyS3hSNnlES1B6SVZQYVJoSndEYmZjMXlRSE9jLVdEaWIzQ091MDVVYjlaYmVKb1l4SWw4OWVRSEpKZnZCTENqTWpfTHlsWXMyX01NWG95WUNSVkI2dUZpSWJINVRsVWNpWmY3NElDRUFCbFQtRg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jun 2024 07:00:00 GMT",
        "title": "The SEC Ends Its Ethereum 2.0 Investigation, but Staking Isn’t in the Clear - Unchained",
        "content": "Episode 665\n\nThe SEC won’t pursue enforcement against Ethereum 2.0, but why? How much of a role did politics play? And where does that leave staking and court cases involving companies such as Consensys and Coinbase?\n\nListen to the episode on Apple Podcasts, Spotify, Pods, Fountain, Overcast, Podcast Addict, Pocket Casts, Amazon Music, or on your favorite podcast platform.\n\nLast week, Consensys revealed that the SEC had concluded an investigation into Ethereum 2.0, referring to when Ethereum transitioned from a proof-of-work consensus mechanism to a proof-of-stake one.\n\nIn this episode, Laura Brookover, senior counsel & head of litigation and investigations at Consensys, and Sam Enzer, partner at Cahill Gordon & Reindel, explore the implications of this decision on Ether’s status as a commodity versus a security, and why the SEC dropped the pursuit, including whether the shifting political winds played a role. For instance, how much of the decision was influenced by the ETH ETF approvals, Democrats crossing party lines to vote for FIT21 and the repeal of SAB 121, and/or SEC crypto enforcement chief David Hirsch’s resignation?\n\nIn this discussion, they also explained why the closure doesn’t necessarily mean that staking, or restaking, is safe from the SEC. Plus, what’s the impact of this closure on the other big crypto cases, such as Coinbase, Kraken, Uniswap, and Ripple?\n\nShow highlights:\n\nHow Consensys managed to get the SEC to reveal that it had concluded its investigation into Ethereum 2.0, and the significance of that move\n\nThe SEC’s possible reasoning behind investigating Ethereum after it had switched to proof of stake\n\nHow uncommon is it for the SEC to send a letter concluding an investigation like the one into Ethereum\n\nWhether recent events around crypto as an election issue, the ETH ETF approvals, votes for FIT21 and the repeal of SAB121, and David Hirsch’s resignation, might be connected to the decision to close this investigation\n\nWhether the Biden administration has shifted its stance on crypto and whether Gensler should remain as chair\n\nHow the SEC might still go after staking\n\nWhether restaking, such as pioneered by EigenLayer, is safe from regulatory actions\n\nWhy the SEC might be pursuing different judgments in various jurisdictions for MetaMask and Coinbase Wallet\n\nWhat crucial evidence from the closed Ethereum 2.0 investigation could strengthen Coinbase’s defense in its ongoing lawsuit\n\nWhy the SEC’s aggressive stance on various crypto enforcement actions seems to remain unchanged despite closing the Ethereum 2.0 investigation\n\nWhy Sam and Laura believe Solana should not be considered a security, despite the SEC naming it as such in various crypto cases\n\nHow the SEC’s argument about an “ecosystem” is nonsensical, according to Laura Brookover\n\nWhat the implications of the closed investigation are for the cases of Kraken and Ripple\n\nWhat Sam and Laura B. are watching out for in terms of regulation and ongoing legal cases\n\n\n\n\n\nThank you to our sponsors!\n\nGuests:\n\nLinks\n\nEthereum ‘Survives the SEC’\n\nConsensys lawsuit against the SEC\n\nEther ETFs\n\nLatest on other SEC enforcement actions"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE1ERk9PaTdkMHo0OVlTTU50TnhpaUZyT3lsOVB1cVBoOEd1aktLT25jZVd5SWxkRWtJam0wTTlmcXFmckIwWHlhZk0wYnZuaER4Z083ZFp1cWdQelRyV2h0LWhUZzRSWk5BZWxXMTdOX2Y?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jun 2024 07:00:00 GMT",
        "title": "Solana's Battle Against Bitcoin And Ethereum: Expert Analysis - TronWeekly",
        "content": "After a major run last year, Solana has struggled to sustain its previous momentum. According to market analyst, Matthew Hyland, SOL will probably underperform compared to Bitcoin [BTC] and Ethereum [ETH]. Based on indicators and market dynamics, Hyland predicts a challenging path for SOL to break new all-time highs against BTC, mirroring ETH’s performance in the previous cycle.\n\nIMO SOL probably underperforms BTC and ETH going forward I could be wrong about this, but I think the idea of SOL breaking to new ATHs against BTC is similar to ETH last cycle, which it did not happen SOL had a major run; I was VERY VOCAL buying between $16-$25 last year so I don’t hate it by any means and still think it has upside in USD but I don’t think it is likely it will run away and outperform BTC and ETH going forward\n\nSolana's Battle Against Bitcoin and Ethereum: Expert Analysis 3\n\nDespite the challenges of outperforming the two leading crypto assets, Solana is known for its high speed and low transaction costs, attracting developers and projects. It has positioned itself as a potential “Ethereum killer,” aiming to resolve scalability issues that plague the ETH chain. Having said that, Ethereum’s transition to ETH 2.0, which promises scalability and energy efficiency, could overshadow SOL’s advantages.\n\nAdditionally, Bitcoin’s growing acceptance as a legitimate asset class in several nations and its potential to serve as a hedge against inflation bolster its long-term prospects.\n\nSolana’s Downward Trend and Future Potential\n\nWhile Solana has undoubtedly emerged as a competing rival and has upside potential in USD, its capacity to outshine BTC and ETH remains uncertain. Investors should keep a close eye on market developments and be cautious about betting SOL to lead the altcoins in the cryptocurrency realm.\n\nOn the price front, SOL’s price has been on a downward trend in the last week. On June 15th, the price was trading close to $168. At press time, the price is around $127.50, reflecting a decrease of roughly 23.36%.\n\nNevertheless, Solana is a popular platform for decentralized applications [dApps] due to its fast transaction times and low fees. If dApps become more widely used, it could drive up the demand for Solana and increase its price."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxNSWNnUTFNZ3dRTWJtVXpyOFhobXExLWM3V2NaeW5PMTJCc1dFUnhEZUdLZUFUc1RqN2tHXzdWVmtPWmpjRnpHZ0xtTWpNMzdNbkc0OG5SY1BQMHJ2WDNBOURCTVFDUE1YNTFNSnRoaGV1Y2oxMXgxZl9lQWJvSFhVZXRVOVRPSFYtVnlhU3otTWxzSkRRSlkxb0NMRmxfdUFzNEE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Jun 2024 07:00:00 GMT",
        "title": "Ethereum ETFs are coming. Can they revive tepid crypto markets? - Fortune",
        "content": "Not one to show his hand, SEC Chair Gary Gensler still gave as optimistic a prognosis on Ethereum ETFs as could be expected yesterday, speaking at the Bloomberg Invest conference. In between his usual frosty statements on the crypto sector, including accusing his interviewer of going after “clicks,” Gensler said the process of working with issuers was “going smoothly.”\n\nThe rare acquiescence from Gensler seems to confirm predictions from the Bloomberg soothsayers that the ETFs could launch as soon as July 2. With crypto assets from Coinbase to Bitcoin cratering in recent days, could the arrival of an Ethereum ETF reinvigorate the bull market? After all, the approval and launch of Bitcoin ETFs back in January served as a catalyst for the current rally.\n\nThe short answer is: probably not. Ethereum has always been the less-loved younger sibling to Bitcoin, even with its newfangled capacity for smart contracts, improved transactions, staking, and a slew of other advantages. It’s been years since anyone predicted the “flippening”—that fabled day when Ethereum overtakes Bitcoin—with a straight face.\n\nI caught up with Christopher Perkins, the president of the VC firm CoinFund, who told me that one of the main challenges for Ethereum will be branding. Bitcoin is easy. The proto-cryptocurrency laid claim to the moniker “digital gold,” which any investor can understand. A baby boomer looking where to allocate the millions of dollars scored from selling a house they bought in 1970 for $10,000, however, might have a harder time understanding the value proposition of Ethereum. What exactly is a smart contract, and why should we care? “Those boomers, with the money—they don’t ape into things,” Perkins told me.\n\nEven with the hype around the Bitcoin ETF, we’re seeing slow adoption as investors grow more comfortable with the new asset class. As Perkins said, ETFs offer two main advantages: regulatory certainty coupled with operational scalability, or improved user experience. Bitcoin, thanks to its early commodity designation, was never really in a regulatory gray zone, though ETFs made it easier for people to buy them directly into their brokerage accounts, rather than setting up a Coinbase or Robinhood account. With Ethereum, however, the approval and launch of ETFs does genuinely create a safety moat that didn’t exist before, especially after months of speculation that the SEC would reject the applications.\n\nFurthermore, an Ethereum ETF that offers yield could be a game-changer, if the SEC ever approves them. Last year, Perkins spearheaded a project to provide a benchmark rate for the staking yield on Ethereum, which he pointed out is often higher than Treasury rates, when adjusted for inflation. “The ETF is going to be very important, but it’s also imperfect because it’s going to deprive investors of that yield out of the gate,” he said.\n\nSo if Ethereum ETFs do finally come next week, or soon after, don’t expect a spike in adoption. But Perkins said to take a long-term view: “This is just another step in mainstreaming and regulatory de-risking.”\n\nLeo Schwartz\n\nleo.schwartz@fortune.com\n\n@leomschwartz\n\nDECENTRALIZED NEWS\n\nCoinbase shares are down as crypto markets face a downturn amid macro uncertainty. (Fortune)\n\nThe official X account for Metallica appears to have been hacked after exploiters posted about a Solana token called METAL. (Cointelegraph)\n\nThe Jack Mallers-run Bitcoin app Strike entered the U.K. amid a Europe expansion. (CoinDesk)\n\nCreditors are gearing up to vote on a reorganization plan for the bankrupt FTX after revealing the proposal in May. (The Block)\n\nA Telegram-based crypto app called Hamster Kombat has enjoyed massive success in Iran ahead of presidential elections. (Associated Press)\n\nMEME O’ THE MOMENT\n\nSam Trabucco and Kanav Kariya riding into the crypto sunset:"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTE1vYklBNVZZRlkxWm1YNk16SS01Z05wRWJBZmhKMGw0dVN6bmEydkRlakpJbXZaVllyOXNKY3pLNXktYWxTajlBcnBPRkNtZjdWcnl0MkhyaV9kc2VQeW9LYU85NXcxSXpKalE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jun 2024 07:00:00 GMT",
        "title": "Cega Shark Bull vaults on Ethereum and Arbitrum combine stability with high returns - Blockworks",
        "content": "The promise of guaranteed high yields with downside protection is often a red flag when navigating a sea of DeFi app marketing speak.\n\nYields are often exaggerated while risks get buried. It’s easy to promote sky-high APRs when you print your own token to fund temporary incentives.\n\nIn the offchain financial world, however, there is such a wild beast emerging from the depths: Shark Fin notes.\n\nDeFi app Cega Finance, a leader in exotic options and structured financial products, launched an onchain version on Ethereum and Arbitrum today.\n\nA Shark Fin is a type of structured financial product that offers a unique risk-reward profile. These notes provide investors with enhanced returns if the price of the underlying asset stays within a predetermined range. The name derives from the shape of the payoff diagram, which resembles a shark’s fin.\n\nSource: Cega.fi\n\nThe potential returns sharply increase to a peak if the asset’s price remains within the range, and then level off or decline if the price moves beyond the specified threshold. This structure allows investors to benefit from stable market conditions while protecting against significant downside risk.\n\nCega’s launch provides conservative investors an onchain version with crypto as the underlying assets.\n\nExpansion from Solana to Ethereum\n\nCega debuted its first four vaults on Solana almost exactly two years ago, but branched out to Ethereum in the second quarter of 2023.\n\nRead more: Solana options protocol Cega comes to Ethereum\n\nThe decision to launch on the Ethereum Virtual Machine (EVM) was always part of Cega’s roadmap, but the collapse of FTX in November 2022 prompted Cega to expedite its plans, according to co-founder Winston Zhang.\n\n“We knew that we couldn’t wait, and we wanted to continue growing,” Zhang told Blockworks.\n\nInitially, the team considered expanding crosschain via LayerZero or Wormhole, but ultimately decided to hire a new team of Solidity developers to rebuild on Ethereum.\n\n“While that was a little bit slower, it provides the best affordance for safety and security because we’re able to control the smart contracts design ourselves and not rely on a third party,” Zhang explained.\n\nThis transition, which took three to six months, was particularly a response to demand from large-scale investors like DAOs, funds and high-net-worth individuals who prefer the stability of Ethereum.\n\nThe decision to add Arbitrum was driven by its strong DeFi community and significant TVL, making it an ideal target audience for Cega’s products. Arbitrum’s growth, fueled by platforms like GMX, aligns well with Cega’s offerings, which appeals to trading aficionados and derivatives enthusiasts.\n\nIt’s not a migration — Cega maintains a presence on Solana with thousands of users, and the product will continue to be developed there.\n\n“We are having conversations about what it means to reprioritize the Solana ecosystem and how to think about product parity for some of the new products that we’ve launched on Arbitrum and [Ethereum] mainnet,” Zhang said.\n\nMaking complex products accessible\n\nOne of the biggest challenges Cega faces is how to simplify complex financial products for their non-professional users. They made a conscious effort to create intuitive visualizations and straightforward documentation to avoid overwhelming users with technical jargon.\n\nTypically reserved for accredited investors in traditional finance, the goal is to make this class of investment tools accessible to everyone, regardless of investment size.\n\n“The products that we’re building are ultimately derivatives products, but they add a number of benefits for the end user that they can’t get from existing [perpetual futures] platforms or vanilla options platforms,” Zhang said.\n\nThe new “Shark Bull” vaults target users who might typically have capital on lending platforms like Aave, and want to increase their stablecoin yield without taking directional risk to crypto markets.\n\nThese vaults offer 100% principal protection with a guaranteed yield of 12.7%, and the potential for up to 30% returns under certain circumstances by combining lending and options strategies.\n\nStablecoins’ lending yield forms the baseline return, while a portion of the yield is used to purchase out-of-the-money (OTM) call options on crypto assets — the “bull” component, driving the high bonus payouts if prices rise.\n\nThe lending counterparties in this case are not smart contracts but major crypto market makers, so this introduces some credit risk. Cega facilitates these loans but is not a custodian, and manages the risk through stringent legal agreements and ongoing credit monitoring provided by Credora.\n\nRead more: Bitcoin lenders have a new regulation-friendly option for yield\n\nCega, based in Singapore, emphasizes compliance with global regulations. These days, that requires geofencing the US-based customers.\n\nDecentralization plans\n\nThe company raised a total of $9.3 million from notable investors including Dragonfly and Pantera, and does not yet have a token.\n\nZhang said his team deliberately avoided participating in the points incentivization game popular over the past year, preferring to focus on providing real sustainable yield.\n\n“We’re actually really proud of that,” Zhang said.\n\nEven without incentives, the platform has about $16.6 million in TVL currently, and about $404 million in cumulative trading volume.\n\nLooking ahead, Cega does plan to launch a token while maintaining its core values of responsibility and prudence, Zhang said.\n\n“There’s way too many protocols in crypto and in DeFi that just aren’t built on real foundations,” he said, citing the project’s published values.\n\n“There just have been way too many examples in the ecosystem of carelessness, and lack of responsibility, and that is not us.”\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the Forward Guidance newsletter.\n\nGet alpha directly in your inbox with the 0xResearch newsletter — market highlights, charts, degen trade ideas, governance updates, and more.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiaEFVX3lxTE1sOHp0LTVaZGhISDM2NGY1VlVGRktuLW5wMmRvWWZEU0UyUFdxc3RYTjBqdEFfeTFYZ3FZa1h0ZjVLejBQWEZ3QjQwSG8tRWlWQ0YzUnpCams0RjRvTzF3YVB0eXEtaTFY?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Jun 2024 07:00:00 GMT",
        "title": "Spot Ethereum ETF to attract $15 billion by 2025's end: Bitwise CIO - Crypto Briefing",
        "content": "Ethereum ETPs to potentially reach $35 billion, aiming for market parity.\n\nShare this article\n\nEthereum (ETH) exchange-traded products (ETPs) are set to draw $15 billion in net inflows within the first 18 months of their launch, according to Matt Hougan, Chief Investment Officer (CIO) at Bitwise. In a recent report, Hougan underscored that Bitcoin and Ethereum ETPs should capture net inflows comparable to their market cap, where ETH gets 26% of the combined market.\n\nCurrently, US investors hold approximately $56 billion in Bitcoin ETPs, and the Bitwise CIO expects this to rise above $100 billion by 2025. Ethereum’s market cap, which stands at $432 billion, suggests a substantial potential for asset inflow, aiming for parity with Bitcoin ETPs at around $35 billion.\n\n“For starters, the Grayscale Ethereum Trust (NYSE: ETHE) is expected to convert to an ETP on launch day, bringing $10 billion in assets with it. Net that out and we’re left with $25 billion in inflows to reach parity,” he highlighted in the report.\n\nHowever, Hougan points out the fact that Ethereum ETPs are slightly underperforming their absolute market cap weight, as they are currently gathering 22-23% of total assets under management versus a 26% market cap weighting.\n\n“I can imagine various reasons, including that Bitcoin ETPs arrived first in many of these markets (as they did in the U.S.). Some investors may have bought a Bitcoin ETP and stopped there, thinking their crypto exposure was covered. I suspect this dynamic will be true in the U.S. as well,” he added.\n\nTherefore, Hougan lowered his expectations from $25 billion to $18 billion, excluding the assets from Grayscale’s trust.\n\nAdditionally, there’s another factor taken into consideration by Bitwise’s CIO, which is the “carry trade.” Carry trade involves buying spot Bitcoin ETPs and selling Bitcoin futures contracts against that position, and traders profit from the premium between futures and spot prices.\n\n“I don’t expect Ethereum will have the same dynamic—the Ethereum ETP carry trade isn’t profitable right now for institutions (in part because U.S. Ethereum ETPs won’t engage in staking their assets). For that reason—and to keep my estimate of Ethereum ETP flows on the conservative side—we need to remove the $10 billion in carry-trade-related AUM when sizing the Bitcoin market.”\n\nAs a result, Bitcoin’s initial denominator of $100 billion falls to $90 billion, and the adjusted estimate for Ethereum ETPs’ net inflows becomes $15 billion."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMi5AFBVV95cUxOMWxGb1JlcjJDeEFjd19fVms5cWk5YmVpbEdmWkxLbjZ4SHhVcnVkRHJoTGt4MWh4TEdSNEJZNllySzQ0VnNHU09fMk5NNmJLSHJlcTU1YWw2eFVZT1BNcFRQWXNtT1VmTWNZejRZWXVheG1CWl92SXNEZHBkZUluWGRIalhUaVZZelBKWk4yYzNWWVRaaFotbjVfT2R3Mnh4V21CR2JqYl9lMXRLaFRrcFhlbXB2TXhyaWt0YnpWbTFaSkRCbk1iMHNmclNsazBDMERsYkl4WmJtN2w5SE1yc2RvMFk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Spot ETFs On The Horizon: Regulatory Approval Expected By Fourth Of July: Report - Benzinga",
        "content": "The Securities and Exchange Commission is reportedly on the verge of greenlighting exchange-traded funds linked to the spot price of Ethereum ETH/USD.\n\nWhat Happened: Discussions between asset managers and regulators are nearing their end and the hotly anticipated investment avenues could go up for listing as soon as July 4, a Reuters report indicated Wednesday.\n\nExecutives from two of the firms anonymously revealed that the process of amending the offering documents is down to resolving minor issues. A lawyer associated with one of the issuers stated that approval is likely just a week or two away.\n\nEight asset managers, including BlackRock, VanEck, and Grayscale Investments which had previously launched spot Bitcoin BTC/USD ETFs such as iShares Bitcoin Trust IBIT, VanEck Bitcoin Trust HODL, and Grayscale Bitcoin Trust GBTC, are seeking SEC approval for the funds.\n\nSee Also: Here’s How Much Profit Donald Trump Would Make If He Sold His TRUMP Memecoin Today\n\nWhy It Matters: The launch of funds tracking the spot price of Bitcoin BTC/USD in January was a massive success, attracting about $8 billion in assets. As of late June, these nine new products have nearly $38 billion in assets. However, some ETF and cryptocurrency analysts believe the launch of the new spot ether ETFs will be less impressive due to ether’s smaller market cap and trading volumes.\n\nThe latest speculation comes a week after Bloomberg ETF analyst Eric Balchunas moved up the launch date for the ETFs to July 2. Balchunas had said that there was a “decent chance” the SEC would declare them effective and get it off their plate before the holiday weekend.\n\nIn a recent interview, SEC Chair Gary Gensler highlighted the smooth progress of ETF filings He indicated that the final decision lies with asset managers to make full disclosures for the registration statements to go into effect.\n\nWhile the enthusiasm was palpable, a few analysts predicted that the launch could potentially lead to a 30% drop in Ether's price.\n\nPrice Action: At the time of writing, Ether was exchanging hands at $3,377.13, following a 1.06% drop in the last 24 hours, according to data from Benzinga Pro.\n\nPhoto Courtesy: Shutterstock.com\n\nRead Next: Congressman Matt Gaetz Introduces Bill To Allow Federal Tax Payments In Bitcoin\n\nDisclaimer: This content was partially produced with the help of Benzinga Neuro and was reviewed and published by Benzinga editors."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxOQUtfR2RVN1dpc1d3LURwc0M1S19oN19CN1RSbEJGbWdEc3RkNVpHOGtGS3Z6LTNyX0FvbDdOekpfRmIwM1drNGVMSnhpTmRTczBCbjNfanpSUE9IaGJNS3kweFNtSXBEWXBMUHpLVE5kZXU0VWMwbEtXbTRJcUFSTkxHZjlNUlVMSk5LdTNpMFp5TWtpTURGQ1d3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jun 2024 07:00:00 GMT",
        "title": "VanEck’s Ethereum ETF will be free as battle for dominance heats up - DLNews",
        "content": "VanEck initially won’t charge a fee for its Ethereum ETF.\n\nMost prospective ETF issuers haven’t publicised their fees yet.\n\nEthereum ETF fees are likely to be just as low or even lower than those for Bitcoin ETFs.\n\nSpot Ethereum exchange-traded funds could launch any day now. And one of the last things prospective issuers need to get right are fees.\n\nA recent filing shows that investment-management firm VanEck will be waiving the fee for its Ethereum ETF until some unspecified time in 2025, or until the fund reaches $1.5 billion in assets, whichever comes first.\n\nOnce either of those conditions is fulfilled, the fund will process a 0.20% fee.\n\nVanEck “aims to be a leader on crypto ETF fees even if it means we lose money at the outset,” Matthew Sigel, the firm’s head of digital-assets research, posted on X.\n\n“The plan is to make it up on volume; in this case, decentralised finance volume,” he added.\n\nSigel laid out the gambit in another post: If the Ethereum ETFs create a renewed interest in Ethereum, then the ensuing network activity will likely push the price of Ether up — which would benefit VanEck’s holdings, he said.\n\nHe also hinted that the firm could potentially take an interest in Ethereum DeFi projects such as Curve or Aave.\n\nVanEck has employed a similar approach toward its spot Bitcoin ETF. The firm is waiving fees entirely until the fund reaches $1.5 billion or March 31, 2025, whichever comes first.\n\nJoin the community to get our latest stories and updates\n\nSo far, the ETF has accrued $614 million in assets — making it the sixth-largest spot Bitcoin ETF.\n\nFee war\n\nOut of nine prospective issuers, VanEck and Franklin Templeton are the only two that have disclosed their Ethereum ETF fees.\n\nFranklin Templeton will be offering 0.19% fees on its ETF — the same as for its Bitcoin ETF.\n\nFirms don’t need to disclose their fees until very late in the ETF launch process, according to Bloomberg Intelligence ETF analyst Eric Balchunas. And issuers are likely waiting for BlackRock to make a move.\n\n“What BlackRock is going to charge is probably the single most important missing variable outside of the exact launch date,” Balchunas posted on X.\n\n“Their fee is the sun that the rest will need to orbit around,” he added.\n\nEven so, VanEck and Franklin Templeton’s opening moves will put pressure on BlackRock to issue an ETF with fees lower than 0.30%, Balchunas said.\n\n“So far, it looks like Ethereum ETFs are going to have as low or even lower fees than Bitcoin ETFs,” he said.\n\nStaking\n\nOne factor in the fee calculus is that Ether investors can stake their holdings through exchanges and decentralised platforms to earn a 3% yield.\n\nBut they won’t be able to do this through Ethereum ETFs.\n\nAnd this raises a question: Why would institutions want to pay fees for an asset instead of earning a solid yield for it?\n\n“Even paying 0.20% without the staking element seems like a nonstarter to me,” Adam Morgan McCarthy, an analyst at crypto data firm Kaiko Research, told DL News.\n\nTom Carreras is a markets correspondent for DL News. Got a tip about Ethereum ETFs? Reach out at tcarreras@dlnews.com"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxNdHJhVXN2TTNHQVNLMXVXN016NGV3YXBjUll4amJTd19hM3VsZ0ljYml2X0tKek50LW1vd1AyaVV5RlBNWFJneDhDNnpYUHdCQ3hUYW5YM0RUaDlqcW9SZnQyVHNFS28zQkhqUWZ5Ykg2ZnhraW1yU21xbTBHbE1HcUJwa3N1akVqaXFuWU5tTXN1Rlg4aHg4WHBCeTFhSG5kWkV6TVJwaFlfMlU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Jun 2024 07:00:00 GMT",
        "title": "VanEck launches ETF on Ethereum (ETH) with zero commissions until 2025 - The Cryptonomist",
        "content": "VanEck has recently announced the launch of a new ETF on Ethereum (ETH) with zero fees until 2025. With this move, VanEck demonstrates its intention to keep up with the times and offer its clients an investment opportunity without additional costs.\n\nLet’s see below all the details about it and other news.\n\nVanEck files Form 8A for the new spot ETF on Ethereum (ETH): no fees\n\nAs anticipated, recently VanEck submitted the 8A form for its spot ETF on Ethereum. Market analysts still hypothesize July 2 as a possible launch date for these new funds.\n\nVanEck just filed 8-A form for spot Eth, which is just part of process, but.. should be noted that they filed their 8-A for spot bitcoin exactly 7 days before launch. Good sign for our July 2nd over/under (7 days from now). But again, anything poss. Sure we'll hear more soon.. https://t.co/2BlkDnWhrz — Eric Balchunas (@EricBalchunas) June 25, 2024\n\nFurthermore, VanEck has decided to adopt an innovative approach by completely waiving the fees for its ETF.\n\nMatthew Sigel, head of digital assets at VanEck, communicated via email that the company will not apply any fees for its ETF on Ethereum.\n\nAlthough the duration of this promotional offer has not been specified, it is likely that it will last until 2025.\n\nHowever, if the fund’s assets were to reach 1.5 billion dollars before that date, the zero-cost structure will be revoked and a 0.20% fee will be applied.\n\nEric Balchunas, an ETF analyst at Bloomberg, noted that it is rare for issuers to reveal their fee structure so early, even before the official launch. VanEck is not the only company taking this direction.\n\nFranklin Templeton, for example, has already declared that it will charge a fee of 0.19% for its spot ETF on Ethereum. Commenting on the situation, Balchunas stated the following:\n\n“What BlackRock intends to charge is probably the most uncertain variable outside of the exact launch date. Their fee will be the benchmark for all the others. It must be competitive.”\n\nVanEck is aware of the initial losses resulting from the adoption of a zero-commission policy. In an email sent to ETF.com, Sigel stated:\n\n“VanEck aims to be a leader in cryptocurrency ETF fees, even at the cost of losing money initially. The goal is to recover through volume; in this case, the volume of decentralized finance.”\n\nSpot ETF on Ethereum: expected demand lower compared to Bitcoin, according to Bernstein\n\nThe Spot ETF on Ethereum, recently approved, is expected to attract significantly less interest from investors compared to the ETF on Bitcoin, according to a report published on Monday by Bernstein.\n\nThe management company has predicted that this second ETF based on cryptocurrencies will attract demand on a very small scale.\n\nAlthough the ETF on Ethereum has not yet been launched, the market is eagerly awaiting its arrival. However, experts point out that the lack of staking functionality in the ETF on Ethereum could reduce spot conversions.\n\nFurthermore, the current market conditions could further dampen interest in this product once it becomes available. Despite the approval of the product, a timeline for the start of trading has not yet been established.\n\nThe Securities and Exchange Commission (SEC) of the United States approved a crucial regulatory filing last month, fueling speculation that the ETF could be launched in July.\n\nBernstein has stated the following:\n\n“Ethereum as the main platform for tokenization is building a solid use case, both for stablecoin payments and for the tokenization of traditional assets and funds.”\n\nFurthermore, they stated that an “improved regulatory regime” would be beneficial for Ethereum. However, it is unlikely that such a change will occur before the next presidential elections in the United States in November.\n\nThe supply of Ether increases: inflation after the Dencun update\n\nThe supply of Ether (ETH) has reached its longest inflationary period since the Merge that occurred in 2022. It seems that the Dencun update of the blockchain, implemented in March, is the main cause of this increase.\n\nAccording to the data from the Ethereum ultrasound.money dashboard, the supply of Ether has gradually increased, with over 112,000 ETH added to the total supply since April 14.\n\nMuch of this inflationary growth is attributable to the Dencun update, introduced on March 13.\n\nThis update has implemented nine Ethereum Improvement Proposals (EIP), including the EIP-4844, which seems to be the main cause of the increase in supply.\n\nThe EIP-4844 has introduced “blob”, a mechanism that allows for temporarily and separately storing transaction data, thus reducing the fees paid for block data on Ethereum’s layer-2 networks.\n\nThe Dencun update also introduced proto-danksharding, which improved efficiency in data availability for block space on the Ethereum mainnet.\n\nThis development has led to a significant reduction in transaction execution costs on Ethereum layer-2 networks, such as Arbitrum and Optimism. However, it has also resulted in a notable decrease in the total amount of ETH burned on the mainnet.\n\nDespite the supply of ETH increasing in an inflationary manner in recent months, the overall supply of ETH has still decreased significantly after the Merge.\n\nSince September 2022, more than 1.5 billion ETH have been burned, while 1.36 billion ETH have been added to the supply, leading to a net reduction in the supply of 345,000 ETH.\n\nThis decrease corresponds to just over 1.1 billion dollars at current market prices, since Ethereum switched to a proof-of-stake consensus mechanism."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTE5KdDN6cGZQYVhlSzhsbTVVeGtPRkZzNkVWdExMR0hSMDFUVEdMc3hVX2hNRENtei1yMWdsR2hXMzFpX05FdTdSMEU0ZFluOVZZQlVZczdpZVJ5OFh3MDhrWk9HSXctZEwzdU9URzcxUFg4dnZO?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Jun 2024 07:00:00 GMT",
        "title": "Why Ethereum is Not a Commodity – Opinion - Securities.io",
        "content": "Ethereum, the second-largest cryptocurrency by market capitalization, has been at the heart of regulatory debates for several years. The key question remains: Is Ethereum a commodity, a security, or something else entirely? In this opinion piece, I will argue why Ethereum does not meet the criteria to be considered a commodity. Instead, I believe Ethereum is best understood as a utility token.\n\nTo classify Ethereum as a commodity, it would need to meet specific criteria, which it does not. Firstly, Ethereum was launched with pre-mined tokens. During its initial coin offering (ICO) in 2014, 60 million Ether (ETH) were sold to the public, while 12 million were allocated to the development fund. This pre-mining activity is more characteristic of securities, as it involves an initial distribution controlled by the developers.\n\nAdditionally, Ethereum’s development roadmap is highly structured and transparent. The Ethereum Foundation and core development teams, such as those within ConsenSys, outline detailed plans for future upgrades, including the significant transition from Proof-of-Work (PoW) to Proof-of-Stake (PoS) with Ethereum 2.0. Commodities typically do not have such centralized and planned development trajectories.\n\nCore developers in the Ethereum ecosystem play a crucial role in leading protocol changes. Vitalik Buterin, Ethereum's co-founder, and other prominent developers consistently propose and implement updates. This centralization of decision-making contrasts with the decentralized nature of commodities, which do not rely on a core team for their evolution.\n\nFurthermore, the Ethereum ecosystem has substantial backing from venture capitalists (VCs) and institutional investors. These stakeholders often influence the direction and development of the network, similar to how shareholders might influence a corporation. Such dynamics are more aligned with securities, where investor interests are paramount, rather than commodities, which are typically free of such concentrated influence.\n\nEthereum’s tokens were also sold both publicly and privately, with the ICO being a primary example. This method of distribution is characteristic of securities offerings, where tokens are sold to raise capital for development and operations. Commodities do not usually undergo such sale processes before their availability on the market.\n\nThe transition to Proof-of-Stake (PoS) with Ethereum 2.0 raises questions about whether this mechanism affects its classification. PoS operates on a system where validators are chosen to create new blocks based on the number of tokens they hold and are willing to “stake” as collateral. While PoS changes the consensus mechanism, it does not fundamentally alter the nature of Ethereum's distribution or governance.\n\nTo determine whether Ethereum is a security, we can apply the Howey Test, a legal standard that assesses whether a transaction qualifies as an “investment contract.” The Howey Test consists of four criteria:\n\nAn investment of money, In a common enterprise, With an expectation of profits, Derived from the efforts of others.\n\nEther was purchased with the expectation that it would increase in value. The funds raised from the ICO were pooled to develop the Ethereum network, indicating a common enterprise. Many investors bought Ether with the expectation of profiting from its appreciation. The success and value of Ethereum are heavily dependent on the efforts of the core developers and the broader Ethereum community. Based on these criteria, one could argue that Ethereum resembles a security more than a commodity. However, the decentralized nature and utility of the Ethereum network differentiate it from traditional securities.\n\nThe classification of Ethereum as a security or commodity has significant implications, particularly in the United States, where the Securities and Exchange Commission (SEC) has been scrutinizing cryptocurrencies. In 2018, former SEC Director of Corporate Finance William Hinman suggested that Ethereum might not be a security due to its decentralized structure. However, more recent statements from SEC officials imply that this view could change as the regulatory landscape evolves. Outside the United States, regulatory approaches vary. For instance, in Switzerland, the Swiss Financial Market Supervisory Authority (FINMA) categorizes tokens based on their function and transferability, often distinguishing between payment tokens, utility tokens, and asset tokens. Ethereum's broad utility within decentralized applications (dApps) and smart contracts aligns it more closely with a utility token under FINMA's framework.\n\nA utility token is designed to provide access to a product or service within a blockchain ecosystem. Ethereum's primary function is to facilitate operations within its decentralized platform. It powers dApps, executes smart contracts, and serves as “gas” to pay for transactions on the network. These functionalities underscore its utility rather than its investment potential. Utility tokens are not typically classified as securities because they are not primarily bought for investment purposes but rather for their inherent utility within a blockchain ecosystem. This distinction is crucial in understanding Ethereum's role and value.\n\nThe classification of Ethereum as a security, commodity, or utility token has profound implications for its regulatory treatment and adoption. In the United States, securities are subject to stringent regulations, including registration requirements and investor protections. If Ethereum were classified as a security, it could face significant legal and operational hurdles, potentially stifling innovation and growth. Conversely, if Ethereum is recognized as a utility token, it may benefit from a more favorable regulatory environment, fostering broader adoption and development. This distinction also matters globally, as different jurisdictions have varying regulatory frameworks for cryptocurrencies.\n\nIn conclusion, Ethereum does not meet the criteria to be classified as a commodity. Its pre-mined tokens, structured development roadmap, centralized leadership, venture capital backing, and method of token distribution align it more closely with characteristics of securities. However, its extensive utility within the blockchain ecosystem and the decentralized nature of its operations suggest it should be classified as a utility token. The debate over Ethereum's classification is not merely academic; it has real-world implications for developers, investors, and regulators. As the regulatory landscape continues to evolve, it is crucial to recognize Ethereum's unique position in the cryptocurrency space and advocate for a regulatory framework that acknowledges its utility and fosters innovation. Ultimately, the classification of Ethereum as a utility token offers the best understanding of its role and value, balancing regulatory oversight with the need to support the growth and development of decentralized technologies. I am still looking forward to Ethereum Spot ETFs in the US soon."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxPMjNqLUx3VTNSMkVtYnA4dHBhRFBqN2Q4OW1kVUxDQ0tfTjNiQmJmbEIxVGd0NDhWdDN1ejk0ekROaU42aDZxZGRhSnhrdmZqUkdzeGNYb1pHSWVyMmJRR1VlUGlURXVULW9YR090WFFha3VSRHp0MGVKeUVCVWpVcnZER3dDYV9jMWRqRG9qRThuZ9IBlwFBVV95cUxNelJoQVFERnBLRVpwMThHS2dCS0c0SlpYbnRseDYwTUVyZnpkOEw3STFKWWp4a05DbG5pNEJCRjB5Vm5LcmQxMzY0b0d4eWN4VWlkWmRZUmJBOWlFNVBDY0xKN2NfaUFjcHJGQlhLMWNiV0NOZ2NnU0RqVVNjOUR2bHNoOEhrOXJuTEtJRWlFMGdycm50UGU4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Jun 2024 07:00:00 GMT",
        "title": "Ethereum’s price rally: What makes THIS level a make-or-break point - AMBCrypto News",
        "content": "Ethereum chalked out a classic descending channel pattern on the daily chart, confirming a bearish edge.\n\nThe immediate support range at the $3,200 level can determine ETH’s near-term trajectory.\n\nEthereum’s [ETH] reversal from the $3,900 resistance level over the past month has set the stage for the bears.\n\nThe altcoin’s increasing Open Interest trend during this time has further raised questions about its ability to hold the immediate support level.\n\nShould the sellers continue to increase pressure from its press time level, ETH could invalidate a bullish rally and see a downward breakout. A rebound from the $3,260 level can help the buyers regain some momentum.\n\nAt the time of writing, ETH was trading at $3,362, up by nearly 3% in the past 24 hours.\n\nCan ETH bulls reverse the bearish trend?\n\nETH sellers have consistently held the resistance level near the $4,000 mark as the altcoins for over three months. The $3,900 ceiling blocked ETH’s 35% rally last month and pulled the price below the 20-day and 50-day EMAs.\n\nThe resulting price action chalked out a classic descending channel pattern on ETH’s daily chart.\n\nShould the upper trendline of this descending channel continue to resist bull runs, ETH could continue its downtrend in the short term. In this case, the $2,800 region could help provoke a bullish rebound.\n\nOn the other hand, a potential close above the current pattern can set the stage for bulls to trigger a rally. In such a case, The first significant resistance level for the buyers would be in the $3,900 region.\n\nThe Stochastic RSI showed extremely oversold readings at the time of writing. Buyers should wait for a potential bullish crossover to gauge ETH’s near-term bullish potential.\n\nPrice action rising above the 20/50 EMA and a bullish crossover on stochastic RSI together could create a strong buy signal for traders.\n\nEthereum: Bearish edge emerges\n\nAccording to data from Hyperblockcapital, ETH’s Open Interest indicator marked an uptrend (higher highs) over the past month.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nHowever, the price action saw lower highs during this time. This reading typically suggests a bearish divergence– where more traders are entering short positions rather than long positions.\n\nAlso, the total net exchange flows over the past day increased by nearly 140% to reaffirm the overall bearish sentiment. ETH’s rebound from the $3.2K–$3.3K support range would be crucial to break the bearish narrative."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTE1OaHRqcVM0Tnk4NF9KcF9xUWM1TVBuUWg5T21nTUpSU0x6UnRUbWp2ZHJMd3FfTmRpRkJWSUF6Y091VEZYcHJMdWNqME9IOWRpa3BadUIwajM3N2dreS1FclFFRkdkR2pub0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jun 2024 07:00:00 GMT",
        "title": "Ethereum ETF launch: Here’s what you need to know - Gulf Business",
        "content": "Image credit: Supplied\n\nFollowing in the footsteps of Bitcoin, the Ethereum cryptocurrency is about to get its own Exchange Traded Fund (ETF).\n\nIn May this year, the US Securities and Exchange Commission (SEC) approved the launch of 8 exchange-traded funds (ETFs) backed by spot Ether. These include the Grayscale Ethereum Trust, Bitwise Ethereum ETF, BlackRock’s iShares Ethereum Trust, VanEck Ethereum Trust, ARK 21Shares Ethereum ETF, Invesco Galaxy Ethereum ETF, the Fidelity Ethereum Fund and Franklin Templeton’s Franklin Ethereum ETF.\n\n\n\nThe move comes after the SEC in January approved bitcoin ETFs. A spot ethereum ETF will allow investors to gain exposure to the price of ethereum without the complications and risks of owning ethereum directly.\n\nOver the last three months, the price of Ethereum has risen by more than 5 per cent to trade at levels or around $3,590 on several cryptocurrency exchanges.\n\nAnd in a note published by Bybit, the world’s third largest cryptocurrency exchange says that “the game-changing ETF will bring the second-largest cryptocurrency to everyday brokerage accounts and institutional investors”.\n\nBybit further notes that trading in an ethereum ETF is expected to kick off in the first week of July.\n\n“Ethereum is the crypto product favored by traditional capital such as BlackRock and Franklin Templeton, both of whom have tokenised funds on the platform,” said Hao Yang, head of financial products at Bybit.\n\n“Given this, the chain seems poised to become the institutional pick. With its native yield, the ETH token allows for composability, and we are seeing protocols building interesting derivatives based on ETH’s stable yield, leveraging this to create crypto primitives that mimic those built on top of the US Treasury market. Finally, because a portion of ETH is burned (sent to a wallet from which no withdrawals are possible), the asset can become deflationary, which means the more network effects kick in, the scarcer the asset becomes.”\n\nPublished below is the full note from Bybit, which provides an explainer of what to expect in the coming weeks and months.\n\nWhat is the Ethereum (ETH) ETF?\n\nAn exchange-traded Fund (ETF) is an investment fund traded on stock exchanges, holding assets such as stocks, commodities, or bonds. The ETH Spot ETF is unique because it is directly backed by Ethereum, meaning it holds actual ETH in its reserves. This allows investors to gain exposure to ETH’s price movements without purchasing or managing the cryptocurrency directly.\n\nWhat’s the Impact?\n\nThe potential inflows resulting from the ETH Spot ETF are substantial. Expectations are that it will capture 15-20 per cent of the assets of Bitcoin ETFs in the US, translating to around $8 – 12bn and more from global markets. These anticipated inflows are driven by market interest, accessibility, and regulatory approval, enhancing overall market stability and growth.\n\nMoreover, based on Metcalfe’s Law, the network effects of increased adoption and usage of Ethereum are expected to strengthen its ecosystem, further driving up its value. The introduction of the ETH Spot ETF is likely to bolster development on Ethereum, solidifying its position as a cornerstone of the digital economy.\n\nGiven these developments, many crypto analysts and experts expect ETH to reach new all-time highs by the end of the year.\n\nAccording to recent data, Bybit’s institutional investors’ exposure to ETH has almost tripled since the ETF announcement on May 24, 2024—moving from 6.54% to a current weighting of 14.29%. This surge underscores the growing confidence in Ethereum’s future performance and the expected positive impact of the ETF launch.\n\nInstitutional Investor Allocations Before ETH ETF Announced (Snapshot 10/5/2024)\n\nInstitutional Investor Allocations After ETH ETF Announced (Snapshot 14/6/2024)\n\nRetail investors on Bybit have also increased their ETH allocations, although not as dramatically as institutional investors. The allocation to ETH has risen from 7.40% to 9.52%, reflecting a cautious but positive response to the ETF announcement.\n\nRetail Investor Allocations Before ETH ETF Announced (Snapshot 10/5/2024)\n\nRetail Investor Allocations Before ETH ETF Announced (Snapshot 14/6/2024)\n\nConclusion\n\nThe announcement of the ETH Spot ETF has had a big impact on investment portfolios. Institutional investors have shown a significant shift in their strategies, tripling their ETH allocations, while retail investors have steadily increased their exposure to Ethereum. These changes highlight the growing confidence in Ethereum’s future and the potential of the ETH Spot ETF to drive further market dynamics."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxOeG0zcHd3dHZScVY0MHFlWV9TTHRIMFBIRVhCTkFER2VrenpkTWE3dFpheUE3MmQ2RWJzXzcyUzRoYlRQbnlBNDdlcVRqQ0dmZ1ZCUlVXM1BKSVg2N2NPZ1RCNDlubzVTTTdKWEdPX3o5RkhkME94MTZKWmJRYjMtc0xXbm4wOUHSAYwBQVVfeXFMTmd3LVFBRzFHMksyel9BdndhMXdROUo5M0NmT3o4Qk52ZGVkdXIzd3ZieVh1dUZKa00tRTRoRW9RMWE1QVJUTklWcVk2SU9MeVRQX0dzVnZvOGk3VDZRNXNkU3RCR0JDQTVtc0hGYUxEZnF0UGFfRjNvdjRWd3BWeHg4Tll2V2NOeGtyNWM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jun 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) to Get More Attention Than Bitcoin Now, Here's Reason - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nMarket sentiment is shifting at a very fast pace, with Bitcoin (BTC) and Ethereum (ETH) dominating social trends. According to top market analyst Michael van de Poppe, with the ongoing drop in the dominance of Bitcoin, Ethereum might take over these social conversations moving forward.\n\nAdvertisement\n\nShifting investor focus\n\nAs spotted by van de Poppe, the dominance of Bitcoin has plateaued at 58%, setting the tone for Ethereum to enter the limelight. Van de Poppe noted that the spot Ethereum ETF product will shape the narrative eventually, as investors look for the next things that can drive optimism.\n\n#Bitcoin dominance continues to peak at 58%.\n\n\n\nIn that regard, it seems likely that we'll be having more eyes on Ethereum rather than Bitcoin in the upcoming period due to the Ethereum ETF. pic.twitter.com/bVRk9uwUSy — Michaël van de Poppe (@CryptoMichNL) June 25, 2024\n\nBitcoin has not helped the market much lately as its price has continued to nosedive, driving bearish sentiment for other altcoins. At the time of writing, the price of Bitcoin has inked a minor 0.24% surge to $61,324.10 after falling as low as $60,660 in the early morning trading session.\n\nThe majority of altcoins notably decoupled from Bitcoin, with the likes of Solana (SOL) outshining on the market, with prices soaring 9.11% to $138.59. With Bitcoin failing to step up as needed, the decoupling has spread to Chainlink (LINK) and Toncoin (TON), among others, all of whom are now up 5.69% and 5.4% to $14 and $7.612, respectively.\n\nEthereum spotlight\n\nThis month thus far, the trends on the spot Bitcoin ETF market marked by the sustained outflow have marred any chances of recovery in the near term. The majority of the uptick the market has printed thus far has come from Ethereum as the U.S. SEC ended its securities investigation into the asset.\n\nAs it stands, the ecosystem is now anticipating word on the potential approval of S-1 registrations that will ultimately usher in the trading of ETFs. Though experts have predicted there might be a lower volume of the product, it is still considered the biggest catalyst that might break the current market bull-bear uncertainty."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxOYnFNeU5oTnh2MG1jRFpNOXZNTlNQeEcwRmV4akRaNEVGQVFpTFlYa0dlbDhaLUZ0OVlZQVRMcEtmQWJVYWxlbmhsR1Z3MUhoY0IyaU1rTWl5bFBfT1dlVlNpVWZFbUZOVzFYcUxFbnFBOUt4NW5hWGZkeENfMlI5cmQ0RENFNHhsb3c1a3VRVG9mdnZHSF96OUNnaDhmMjZZYU00ZmhORXpET2dSeDdsOVVkMERNNDZidXk2QtIBxAFBVV95cUxQaE9uUjYxcTZkMzAzSm5FSk1fXzAzUEROcE1iWjZMQVlfSGJMTEN3Mjlrdi0wSGowQ2xSamdnaktNX3JKdVphR1RELXJzV0R0QmYtZ1hxQjUtNTY5dncwVGdIR08xc3Q2SV94TXZVVTkwZW5LZnZFdlFTV2g5MW1jemZkbWYwQzdQYWF3SjBNaTNia2h2Yk1ZQzJScC1mYUlhRDd0UUFEQVBrVnBxTWo1dHc0eENpNnh3czBkWUtpVkdFOXNP?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jun 2024 07:00:00 GMT",
        "title": "After Sweeping Bitcoin and Ethereum Liquidations, Analysts Are Watching for Accumulation Whales - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe cryptocurrency market continues its downward spiral this week, having seen about $191 million worth of crypto derivatives contracts liquidated in the last 24 hours.\n\nBitcoin (BTC) is the most impacted, accounting for half of the total liquidations, of roughly $103 million. Ethereum (ETH) follows with $33 million in liquidations. This follows the 24-hour tally rising to $330 million yesterday afternoon after Bitcoin fell below $60,000 for the first time since early May.\n\nThis sharp rise in liquidations is reflective of the heightened market volatility and bearish sentiment.\n\nThe Bitcoin price dipped by 2.2% in the last 24 hours to sell for $61,516.48, while the Ethereum price shaved off 0.7% to trade at $3,382.27 on Tuesday.\n\nAD\n\nAD\n\nBTC and ETH have lost about 6.5% and 1.4% in the last seven days, respectively. But relative to the plunges they saw yesterday, both coins are on the up. Bitcoin is 0.2% higher than it was this time yesterday and Ethereum has rebounded 1.8%.\n\nTime for the accumulation whales to respond “This is time when accumulation whales are likely to respond to market fear, indicating a potential V-shaped rebound.” – By @mignoletkr Full post 👇https://t.co/CJLU7nPN9w pic.twitter.com/HOXng629Ym — CryptoQuant.com (@cryptoquant_com) June 25, 2024\n\n“What’s happening right now with Bitcoin prices is mostly related to a lack of demand growth or momentum from traders, whales, ETFs,” Julio Moreno, head of research at CryptoQuant, said on Twitter.\n\nAnother analyst at CrypoQuant, who goes by the pseudonymn Mignolet, suggested on Twitter that accumulation whales may swoop in to halt the bearish for a “potential V-shaped rebound.”\n\nAD\n\nAD\n\nThe current wave of liquidations primarily affected long positions, according to CoinGlass. This trend has been observed across various exchanges, suggesting a widespread market reaction to recent negative news and economic data.\n\nIn the past 24 hours, 64,829 traders were liquidated, the total liquidations comes in at $294.14 million, according to CoinGlass. The largest liquidation order was on a BTCUSDT contract valued at just over $15 million.\n\nBitcoin and Ethereum lead liquidations\n\nThat Bitcoin is hardest hit in these liquidations highlights the continued volatility in the market’s largest cryptocurrency.\n\nBitcoin’s price has been under pressure due to macroeconomic factors, regulatory concerns, and market sentiment shifts. Last week, German authorities sold off seized Bitcoin worth about $325 million within 48 hours.\n\n“Having seen a slippage in the price of BTC, the German government is releasing significant tranches of BTC and has taken a view that the price of BTC is to soften for a while to come,” Robert Quartly-Janeiro, chief strategy officer at crypto exchange Bitrue, told Decrypt last week.\n\nAs traders’ positions are forcibly closed, the ripple effect has further pressured BTC's price, contributing to a sustained bearish market outlook.\n\nEthereum also faced significant liquidations, albeit to a lesser extent than Bitcoin.\n\nAD\n\nAD\n\nThe $33 million in ETH liquidations since this time yesterday underscores the challenges faced by the second-largest cryptocurrency, which has also been dealing with similar market pressures and investor sentiment.\n\nEdited by Stacy Elliott."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxQZm1tRFBlelBHcE1tOWFOSE1PRFhhZDF3NFpxbUgxLUFqU1RsTVlkVzFXbFFFMm85UUpRcy04a0VGTm1IRDh1Nno4YjI0TlN5d3BjbkQyYjNMeUtyM1RVSDh5VW43ZVpocGpfaEl0a0tMSW4yRVVHZF9ialJRRXFheGJQWTJ1SE9WaGxTel9B?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Jun 2024 07:00:00 GMT",
        "title": "Ethereum ETF Demand to be Lower Than Bitcoin, Says Bernstein - Watcher Guru",
        "content": "The recently approved Spot Ethereum ETF is expected to see far lower demand from investors than its Bitcoin counterpart, Bernstein says. Indeed, the management firm released a research report Monday forecasting the second crypto-based exchange-traded product to see demand on a much lower scale.\n\nThe Ethereum ETF has yet to go live, with the market anxiously awaiting its arrival. Yet, the lack of staking features in the ETH option means less spot conversion, experts have stated. Additionally, the state of the market could further lessen interest in the product when it goes live.\n\nSource: Wealth Management\n\nAlso Read: Ethereum ETF Applicants File Updated S-1 Documents With SEC\n\nEther ETF Demand to be Notable Lesser Than BTC\n\nIn January, Bitcoin’s Spot ETF approval changed the game for cryptocurrencies. It was a massive catalyst for the leading cryptocurrency’s surge to an all-time high of $73,000 just three months later. Yet, analysts are not expecting the same to take place for the second digital asset to get the investment product.\n\nAccording to Bernstein analysts, the incoming Ethereum ETF will not garner the same demand as Bitcoin when it launches. “ETH should not see as much spot ETH conversion due to the lack of an ETH staking feature in the ETF,” the firm’s Gautam Chhugani and Mahika Sapra wrote.\n\nSource: Bitcoinist\n\nAlso Read: After Ethereum ETF, Dogecoin; Solana; And XRP Next In Line?\n\nAlthough the product has been approved, there is no timetable for it to begin trading. The US Securities and Exchange Commission (SEC) approved a critical regulatory filing from issues last month, leading to rumors it could launch in July.\n\n“ETH as a primary tokenization platform is building up a strong use-case, both for stablecoin payments, as well as tokenization of traditional assets and funds,” Bernstein added.” They also said that an “improved regulatory regime,” would be a benefit to ETH. Such a shift isn’t likely to come to fruition until the impending US presidential election in November."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxQREFkaEE4VHRpbmZsVTh4S0M1YWd0WTNTTkFvbFlIaENUQlVINk1RWWw4MVBqbXVGZVR2bEo2aHVsdG1hU2FTSGZHWTdxMm1rd0haT2F0anByMHF3UDdrckZOZVB5NVNSV05uaW5YczBYbDM0WFk4cWNUel94d2pXVHdsVnY0TVHSAYwBQVVfeXFMTTk3T2pjR2Q3aHlXSTBpVTFPTl9CR3JibmlmUXAtaEZvM3lhTzhiaWtQN3NBcE11Z28xMWxFV2JULTJCZHNTWEFSbnAyUUY1cUg2SjE1VktGTTN2eDlqRkJZLWV3SmtlM19QTTFNQ3ZUQW5IRzMwNjFuZWNHSno3SUJna3ZEQlE3bFNkYTc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jun 2024 07:00:00 GMT",
        "title": "Ethereum: Will ETFs push ETH to $4K or drag it down to $2.4K? - AMBCrypto News",
        "content": "Analyst warns that ETH could dump to $2.4K after ETF launch\n\nAnother market observer blamed macro conditions, BTC and SOL, for ETH’s negative sentiment.\n\nExpectations of the Ethereum [ETH] ETF have been low, and analysts have had mixed views on the topic.\n\nAs of press time, ETH retreated to a low of $3.2K, an 18% drop from its recent high of $3.9K after the partial approval of ETFs in late May.\n\nWith only days to possible ETF launch, Andrew Kang, founder of crypto fund Mechanism Capital, expected ETH to drop further to $2.4K. Part of his recent analysis read,\n\n‘Before the ETF launch, I expect ETH to trade from $3,000 to $3,800. After the ETF launch my expectation is $2,400 to $3,000.’\n\nKang suggested that ETH ETF flows could be dismal in the first few weeks for two reasons.\n\nFirst, the SEC’s 180-degree pivot and approval in late May was a surprise move that limited the time to convince large ETH holders to move to ETF.\n\nSecondly, Kang cited that moving to ETF doesn’t come with staking yield perks. As a result, he estimated ETH ETF could attract only 30% of BTC ETF flows in the first six months, approximately about $1.5 – $4.5 billion.\n\nOther reasons for Ethereum’s negative sentiment\n\nOn his part, Quinn Thompson, founder of crypto hedge fund Lekker Capital, suggested that the negative ETH sentiment stemmed from being under the shadow of BTC and Solana [SOL].\n\nThompson added that SOL’s repricing relative to ETH reinforced the ‘ETH killer’ narrative.\n\n‘SOL has repriced 6x higher relative to ETH, so this is not as easy of a layup as it was’\n\nThompson also noted that the BTC ETFs and massive interest in underpriced SOL further isolated ETH into ‘middle child syndrome.’ Moreover, the liquidity crunch made things worse,\n\n‘On top of that, overall prices have been stagnant to down for 3 months and market sentiment is in the gutter due to a macro/liquidity blip.’\n\nDespite the negative sentiment, other analysts, like QCP Capital, maintained a bullish outlook ahead of the ETF launch in early July and noted,\n\n‘ETH bullishness persists with ETH vols trading at an 18% premium to BTC in expectation of an imminent ETH spot ETF launch.’\n\nQCP analysts had previously projected a retest of $4K was possible after the ETF launch. As of press time, ETH traded at $3.2K, and it remains to be seen how ETF will determine volatility and price direction."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE5qQU43TjkzWVFmQkJiMndRYXc0NVAtbmtnTUNPdThhM0Y5bW9zeUhqOExPVXFINGpNS1ZVVkxMUW9yeU55cDFMOTJRY2UtX0ctVS1iekdBc1JaZFFBbGNFY1pULXdSYVdfdnFOcWxlMnhmMkZBMWpnRTNTX2FZZ28?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Jun 2024 07:00:00 GMT",
        "title": "7 Cryptos to Watch This Week: Bitcoin, Ethereum and More - Yahoo Finance",
        "content": "If you can’t handle the extreme ebb and flow of high-risk asset classes, the cryptocurrency market probably isn’t right for you. We’re getting a taste of the wildness of the blockchain ecosystem, with the total market capitalization of all cryptos slipping conspicuously on Monday. At the moment, the value of global virtual currencies comes in at $2.26 trillion.\n\nOf course, that’s disappointing for those who recently got into the space. Previously, the sector had done a good job of holding onto the $2.5 trillion market cap support line. Unfortunately, with the benchmark digital assets slipping badly in recent sessions, investors need to prepare for possibly extended rough waters.\n\nWhat’s causing the choppiness in the high seas? Some experts point to the German government standing poised to liquidate a significant amount of cryptos “earned” through illicit means. Further, some evidence exists that the whales — or the big dogs in the market — have slowed their trading activity. With the fading momentum, people aren’t as eager to participate in cryptos.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nFrankly, the erosion of major tech players like Nvidia (NASDAQ:NVDA) probably doesn’t help either in terms of ginning up sentiment. Still, that could also spell discounts for the opportunist. Below are several cryptos to watch this week.\n\nBitcoin (BTC)\n\nCrypto prices collapse downturn. Bitcoin (BTC-USD) cryptocurrency value drop bear market concept. Doomed Cryptos to Dump. cryptos to sell\n\nSource: Quality Stock Arts / Shutterstock.com\n\nIt’s not time to hit the panic button. However, crypto investors need to pay close attention to Bitcoin (BTC-USD) this week. In the past 24 hours since the clock officially turned to Tuesday morning, the benchmark virtual currency lost more than 2% of market value. Over the past seven days, it sank more than 6%.\n\nTo be sure, it’s not so much the red ink in the basis points that hurt. Rather, it’s that Bitcoin is threatening to slip below — and perhaps well below — the critical $60,000 level. Yeah, you can say it’s just a number. But let’s keep in mind that not too long ago, BTC received praise for jumping back up above the 70K milestone. Going backwards is not what the bulls had in mind.\n\nIs it time to buy the volatility, though? I think it might be the right idea but I wouldn’t be surprised if more downside materializes. So far, the candlestick of the June 25 session is very small compared to the red blotch represented by the Monday session.\n\nMaybe take a nibble but keep the powder keg dry. That would be my idea.\n\nEthereum (ETH)\n\nCrypto currency etherium. ethereum coin on exchange charts. e-currency Ethereum. Ethereum price predictions\n\nSource: viktoryabov / Shutterstock.com\n\nAs with the benchmark digital asset, it’s not time to panic on Ethereum (ETH-USD). It is time to put your crosshairs on this bad boy because circumstances are getting volatile. In the past 24 hours, ETH slipped about a half percent. During the trailing one-week period, the number two crypto by market cap dipped around 2%. These stats aren’t what’s important.\n\nStory continues\n\nRather, as with other cryptos, the technical profile for Ethereum appears to be weak. Conspicuously, the popular virtual currency is trading hands at $3,374. That’s below its 50-day moving average, a key barometer for near-term market health. Also, it goes without saying that ETH is off its 20-day exponential moving average.\n\nIf more volatility materializes, which wouldn’t be out of the question, the $3,100 support line must hold. Otherwise, it could be a quick drop to $2,900. That’s the type of activity that the bulls will not want to see.\n\nAs for playing this market, I’m not liking how the response to the June 24 fallout has been so pensive. Again, nibble at Ethereum if you must but keep the powder keg dry.\n\nTether (USDT)\n\nA concept token for the Tether cryptocurrency.\n\nSource: DIAMOND VISUALS / Shutterstock.com\n\nAs the mainline stablecoin or cryptocurrency pegged to a fiat currency (typically the dollar), Tether (USDT-USD) provides a critical look into broader blockchain sentiment. Basically, USDT represents the oil that keeps the digital asset ecosystem’s chains moving smoothly. That’s because crypto investors will convert their wealth into Tether. When opportunities arise, they can respond immediately.\n\nSo, here’s how the theory plays out. If more market participants are comfortable storing their wealth in crypto terms, Tether should rise in value relative to dollars. In other words, USDT should be traded at a higher peg relative to USD. On the other hand, if people are not comfortable with cryptos overall, they’re less likely to hold Tether units. In this case, dollars will be worth more than USDTs.\n\nRight now, one dollar is worth about 0.9996 Tethers. Under a perfect peg, one dollar should be worth one USDT unit. So, the fact that the stablecoin is worth less than a single greenback suggests broader pessimism. That’s not surprising given the evidence that we’ve seen.\n\nAgain, this isn’t meant to panic investors. However, it’s worth mentioning so that you don’t go too aggressive on cryptos this week. Like I said earlier, you may want to keep the powder keg dry.\n\nSolana (SOL)\n\nConcept art of the Solana (SOL-USD) blockchain.\n\nSource: Shutterstock\n\nLet’s move to some potential opportunities in cryptos, beginning with Solana (SOL-USD). What’s interesting about SOL is that unlike many other major digital assets, SOL gained 8% of market value in the past 24 hours. That said, it didn’t move anywhere in the past week, losing about half-a-percent. So, what’s going on with this popular altcoin or alternative crypto?\n\nTechnically, Solana finds itself at an interesting crossroads. Generally, circumstances don’t look particularly pleasant. First, SOL failed to secure its top-level support line around the $178 mark. It then failed to hold the $156 line, represented by its 50-day moving average (DMA). At one point, Solana briefly slipped below its 200 DMA, which sits at $133.\n\nMoving forward, the next few sessions will be critical in establishing the near-term trajectory. Presently, Solana trades hands at approximately $135.50. It really has to move higher from here, perhaps jumping to its 20-day exponential moving average (EMA), roughly $145.\n\nIf SOL is unable to make progress, it risks falling to the $100 level. As with the other cryptos, a small position now may be warranted. However, keep the powder keg dry for a bigger discount.\n\nCardano (ADA)\n\nCardano (ADA) token with blue and orange digital background.\n\nSource: Stanslavs / Shutterstock\n\nA fan favorite within the altcoin community, Cardano (ADA-USD) enjoys no shortage of supporters. However, it might be put-up-or-shut-up time for the blockchain asset, at least from an immediate perspective. In the past 24 hours, ADA gained about 2.5% of market value. That’s good. In the trailing week, it gained over 2%. That’s even better.\n\nHowever, the problem is that Cardano’s technical profile is very suspect. Presently, the coin trades at just under 39 cents. That’s noticeably below the 20-day EMA, which comes in at 40.6 cents. Also, it’s significantly under its 50 DMA, which stands at 43.9 cents. The 200 DMA? Forget about it — that’s up at 54.2 cents. Honestly, the bulls need to think about small steps first.\n\nA horizontal support line is evident around the 45.5-cent level. For Cardano to regain credibility immediately, it must move to this mark, full stop. I’m hoping that the legion of supporters will see the discount and bid ADA higher.\n\nBut it’s also possible that with the whales being pensive, ADA could struggle. For speculators, nibble at the currently cheapened price. Just know that there’s a possibility that Cardano could fall quickly below the 35-cent line.\n\nChainlink (LINK)\n\na digital representation of the chainlink (LINK) cryptocurrency\n\nSource: Stanslavs / Shutterstock.com\n\nThose seeking a speculative upside wager in cryptos may want to turn their attention to Chainlink (LINK-USD). Let’s look at some interesting stats. During the past 24 hours, LINK gained nearly 7% of market value. Over the course of the last seven days, the cryptocurrency gained more than 2%. Amid the blockchain fallout, those are pretty encouraging numbers.\n\nIt just might get better. LINK has a tendency of see-sawing violently. Throughout much of April and May, the price of the digital asset baselined at approximately $13. However, during the recovery rally late last month, LINK briefly shot up beyond $19 on an intraday basis. That provided temporary hope that sentiment can carry Chainlink back to the $20 level.\n\nUnfortunately, earlier this month, the crypto encountered a series of volatile sessions. The bad news is that the blockchain asset finds itself trading below its 50 and 200 DMAs. However, the good news is that the bears attempted to drive LINK below $13 but failed. Just to repeat, that price represented a prior support line.\n\nMoving forward, it’s possible that LINK could start marching higher. I’ll start getting excited should the price breach its 50 DMA, which stands at $15.71.\n\nUniswap (UNI)\n\nA concept image for the Uniswap (UNI) token.\n\nSource: Shutterstock\n\nOne of the most popular altcoins for its underlying utility, Uniswap (UNI-USD) dipped about 1% in the trailing 24 hours. During the past one-week period, the digital asset dropped almost 4%. At the moment, the crypto features a market cap of $5.67 billion. That’s good enough for number 18 in terms of the most valuable virtual currencies.\n\nLooking at the technical profile, Uniswap finds itself in an interesting position. Presently, at a price per unit of $9.47, it sits below its 20-day EMA ($9.98). Further, it’s trading right at its 50 DMA. During the June 24 session, the bears managed to drive the price below this key barometer briefly before rebounding. To establish credibility, Uniswap needs to build from here.\n\nOne positive news item is that the price action has held strong above the 200 DMA ($8.79). If a correction materializes, a drop below this point could send the digital asset down to $7.\n\nWhat may work in favor of Uniswap is strong support for the underlying ecosystem. If enough investors jump in, UNI could start moving higher. Still, I would probably keep the powder keg dry just in case for unexpected headwinds.\n\nOn the date of publication, Josh Enomoto held a LONG position in BTC, ETH and USDT. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nA former senior business analyst for Sony Electronics, Josh Enomoto has helped broker major contracts with Fortune Global 500 companies. Over the past several years, he has delivered unique, critical insights for the investment markets, as well as various other industries including legal, construction management, and healthcare. Tweet him at @EnomotoMedia.\n\nMore From InvestorPlace\n\nThe post 7 Cryptos to Watch This Week: Bitcoin, Ethereum and More appeared first on InvestorPlace."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxPNFp0Vjc2b1lBZFQ5V1I5cVNEOTZKbWFwM0xjdGI1ZzN2TTBtdzVjTndBR0M5ZnkxeXo5QjdmRUpCMDdadXdiNUFyM0dUdEMzWVJfdjNFcWtCYjRTZ0hYNHpRX1AwcVdhZ2QwRHFCeVNwZlhLTV9xS3NEd3JDOEloYUY3M1FOWVZQczRmdVUzQXRyUzl2TXfSAZsBQVVfeXFMTndub3NFMG1lQWtMWnJTSFgxTUNxcHBIMmNqVnU2ZWcxZVctWnV0V0tCZnBTT3hyOHhTRUFIaHBhWjBIbVdXeGNZSElFeFdhZlVMM2k5NW45aG1iUzZUalFLdTFWbXl5QlQzTk9ya05CWkd4REJadXhxYXBaWDIxNXVfWGZDQUZBb2VldmRZX1ExNzdRTWdVVFpaTnc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Foundation Deviates From Historical ETH Selling Patterns - CryptoPotato",
        "content": "During previous bull markets, the Ethereum Foundation has demonstrated a keen ability to time the market with its ETH holdings.\n\nHowever, the foundation appears to have departed from this established pattern.\n\nEthereum Foundation’s Unexpected Selling Restraint\n\nThe Ethereum Foundation was found to have executed large sales of ETH near peak valuations in the past. This strategy has allowed the organization to capitalize on high prices and potentially secure funding for ongoing development and operations.\n\nAccording to IntoTheBlock’s latest data, the foundation has yet to engage in any significant selling activity in this current market cycle.\n\nSuch a deviation raises important questions about the organization’s current strategy as per the on-chain intelligence platform as well as the future direction of the market. Ethereum Foundation refraining from offloading ETH tokens could mean that it believes the cryptocurrency has more potential for growth.\n\nETH has been under significant pressure along with the broader cryptocurrency market. The asset has dropped to $3,370 this week. Hence, such a case presents bullish sentiment despite almost a 10% drawdown in its price over the past month.\n\nAlternatively, the Foundation may have adopted a new approach to managing their assets.\n\n“Historically, during each bull market, the Foundation has strategically sold substantial amounts, often aligning these sales almost perfectly with market peaks. In the current cycle, the Ethereum Foundation has yet to execute any significant sales. Does this mean the peak is yet to come, or has the Foundation changed its approach?”\n\nPrevious ETH Sales\n\nIn January this year, Arkham Intelligence flagged a blockchain address associated with the Ethereum Foundation that sold $1.6 million worth of ETH.\n\nLater in April, Peckshield Alert revealed that the Foundation had converted a portion of its ETH holdings into stablecoins in April. According to the data, the foundation converted 100 ETH to 354,000 DAI. During this time, ETH was trading above $3,600."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxNOGZWY1Y5MFU1Yk1MWU9WcFYzQ01SN096WVZRUklpaERFbWlhT2RXcnZLSXJvUWhjdnYxUWZ5bFpNOE9IdlMzcVlBcjNob2RRYkNvSG9xZjhzSVdaRFNEOXRKbnF5NUlrYVU0ZGt1NXR4OHlFYjdUMkJlaDJoeVN6OG5MUFNaQTVrbm03QmhSQzF1YkR3aWlhR0xJVU5TNTZHWVFzNTNzY2Y2WlQxYzBDUW9SWEN5dlgzSkdGTkJn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jun 2024 07:00:00 GMT",
        "title": "This Historical Ethereum Top Signal Is Yet To Appear This Cycle - TradingView",
        "content": "On-chain data suggests this signal that has historically occurred around Ethereum peaks has yet to appear in the current cycle.\n\nEthereum Foundation Wallets Haven’t Made Large Outflows This Cycle So Far\n\nIn a new post on X, the market intelligence platform IntoTheBlock has discussed a pattern that Ethereum has witnessed alongside its previous market peaks.\n\nThe pattern in question is related to the netflows for the wallets associated with the Ethereum Foundation. The ETH Foundation is a non-profit entity supporting the cryptocurrency and its ecosystem.\n\nBelow is the chart shared by the analytics firm that shows the trend in the net amount of ETH (in USD) moving in or out of the wallets connected to this organization.\n\nNewsBTC\n\nAs is visible in the above graph, the netflows for the Ethereum Foundation have generally taken negative values during the past bull markets. Negative netflows naturally correlate to a net amount of ETH movement away from the wallets connected to the company.\n\nInterestingly, the indicator has seen especially large red spikes around the tops of the cryptocurrency. As IntoTheBlock explains,\n\nHistorically, during each bull market, the Foundation has strategically sold substantial amounts, often aligning these sales almost perfectly with market peaks.\n\nThe chart shows that the indicator’s value has been more or less neutral during the past few months, even though the asset’s price has increased significantly.\n\nThis suggests that the Ethereum Foundation hasn’t been making any major sales during this bull market. Given the historical pattern, this may be a sign that a top isn’t yet here for the cryptocurrency, or at least the organization doesn’t judge it to be so.\n\nAnother explanation, however, could be that the non-profit entity has changed its strategy for this new cycle, meaning that the past trend would no longer hold the same weight.\n\nIn some other news, the official email of the Ethereum Foundation was recently compromised, as Tim Beiko, one of the ETH developers, had revealed in an X post.\n\nThe developer had noted that the organization was trying to reach out to SendPulse, an email automation service used by the firm, to resolve the problem.\n\nIn a follow-up post, Beiko confirmed that the team sent out an update to subscribers of the Ethereum Foundation blog, warning them that the previous email, announcing a “staking platform” by the organization, resulted from the compromise.\n\n“We should have locked down all external access, but we are still confirming,” said the developer in the post.\n\nETH Price\n\nEthereum plunged under the $3,300 level yesterday, but the asset has since recovered above $3,400."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxPT2gxNFMtR1FlQ1NBLUhXeDJKT3N2MkE2amxrbUFueDVtSVpYX21xZW9NVk5EUFFpczFzWlNxTGZxeHM3UEh6OUlSUE5QVUItTHNtbm96YjAwQno4ckdwQjBPcG5zQWdhWFJYSjlkdW9aWVc2T3p2el9sd0FSc0E1VXRGUjIwRzhTbUHSAY8BQVVfeXFMTi13RFVrZEhjX3c4Qm5BYVktTE9jbVRWcEdTRjIwNFA0TnZZLThtek1lNHpKY0ZTcDIxVVpKd2N2N0lkbC1GT054LXY3WmFhaWltRXZyQ2M2cUJCVlRsa0RUUzcwSmFPMG11R3BxUzlLTjlxcHJrX0lMbksycm5pX2FfeGRNcVZIX1JiRnRWOGs?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jun 2024 07:00:00 GMT",
        "title": "Ethereum ETF launch hype: ‘ETH pumping, altcoins following’ – But… - AMBCrypto News",
        "content": "Despite anticipation around the Ethereum ETF, ETH-based memecoins showed marginal gains.\n\nWhile some see bullish potential in Ethereum’s future, Andrew Kang predicted a possible price drop.\n\nDue to the anticipated approval of the Ethereum [ETH] ETF, altcoins are enjoying a bullish surge, while Bitcoin [BTC] is hovering near the $60k mark.\n\nThis has also resulted in many foreseeing this as a bullish trend for July.\n\nImpact on Ethereum’s price\n\nHowever, at the time of writing, Ethereum declined by 1.15%, showing red candles on the daily chart. But AMBCrypto’s analysis of IntoTheBlock data presented a contrasting view.\n\nThe data indicated that despite the price decline, bulls outnumbered bears with a 7-day average of 107 bulls compared to 95 bears, suggesting that buying pressure outweighed selling pressure at press time.\n\nImpact on Ethereum-based memecoins\n\nContrary to expectations, the upcoming approval of the ETH ETF also did not lead to substantial gains in the memecoin sector.\n\nWhile the top Solana memecoins surged by up to 14% in the last 24 hours, and the leading Base memecoins saw a 7.6% increase, ETH memecoins showed only marginal gains.\n\nFor an in-depth analysis, AMBCrypto examined the price action of Dogwifhat [WIF], a Solana [SOL]-based memecoin, Brett [BRETT], a Base blockchain memecoin, and Shiba Inu [SHIB], an Ethereum-based memecoin.\n\nAccording to CoinGecko, WIF, and BRETT saw increases of 17.1% and 12.4% respectively, while SHIB was up by only 0.5%.\n\nThis disparity indicated that the positive market sentiment surrounding Solana and Base memecoins did not extend uniformly to Ethereum-based memecoins following the news of the ETH ETF approval.\n\nHowever, this did not diminish investor interest in the largest altcoin as underlined by Anomander, Founder at Legion Ventures, who said,\n\n“Obviously, the crypto market has topped on the Ethereum ETF approval. Keep blaming low-tier celebrities for launching their memecoins.”\n\nSharing a similar line of thought, and drawing a comparison between BTC and ETH’s price action, crypto analyst, Michaël van de Poppe took to X and noted,\n\n“Bitcoin dominance continues to peak at 58%. In that regard, it seems likely that we’ll be having more eyes on Ethereum rather than Bitcoin in the upcoming period due to the Ethereum ETF.”\n\nEthereum ETF launch, not a good sign?\n\nHowever, not everyone was optimistic about the ETH ETF’s impact on Ethereum.\n\nAndrew Kang of Mechanism Capital, in his recent post, speculated that the introduction of spot Ethereum ETFs may kick ETH’s price down to $2,400.\n\nHe said,\n\nFurther in his analysis, he pointed out that while there is potential for growth in ETH futures, the current lack of interest from savvy traders could signal concerns about the performance of ETH ETFs in the near future.\n\n“The BTC ETFs opened the door for many new buyers to make bitcoin allocations within their portfolio. The impact of ETH ETFs is a lot less clear-cut.”\n\nAll in all, these analyses suggest that the market is not as bullish on ETH ETFs as it was on BTC ETFs, potentially leading to less dramatic price movements for Ethereum."
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMiywFBVV95cUxPNEJsS0oxbXV2d01SV29IazB3OHdrNXFyU2Y2ME9EZVJ3Rm9idmlFemhUMHpmek9QQkN1eExUaXMzTTV5c2NfYThnRmJCaWlqa0hCNHo5RDd4SjUzalZOUWxueThEa003eUNManRZc0tNZ1c4X0VYS2c5V3pSSXBtVmRoSUtXblh5RjVVa1E1SDFKcTZZR1B3YTA0MlJzMktVRXFZQXprNFUwR0dXRHcwVEp5aHl6UTZUR3pXOHJYZHdoZVJiX1QxYk50UQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Jun 2024 07:00:00 GMT",
        "title": "Crypto Expert Predicts ETH at $6K by September - Top Presales to Pump with it - Techpoint Africa",
        "content": "Crypto market charts largely don't look good at the moment.\n\nAll major projects are trading in red, with Bitcoin leading the charge. The main currency plummeted from $73K level to the $61K where it currently stands in just two weeks.\n\nThis is a 7% drop in the last week alone.\n\nRest of the big names aren’t doing much better… XRP is down by 5%, BNB 3%, Avalanche by 4%.\n\nEthereum on the other hand is sustaining the dip with a small green candle, but green nonetheless.\n\nIn fact, one analyst, degenttrading (@degentradingLSD) gave a very bullish prediction for ETH.\n\nLet’s take a look at what he had to say, and check out some smaller crypto presales that crypto influencers believe can ride the ETH’s bullish wave.\n\nCan We See ETH at $6,000 By September? Degen Trading Seems to Think So\n\nEthereum (ETH) has been at the centre of many bullish predictions, with some analysts projecting its price could hit $6,000 by September.\n\nOne prominent voice, Degen Trading, outlines several compelling reasons for this optimistic outlook.\n\nDegen Trading highlights the significant increase in CME open interest (OI) from pre-ETF days to now, noting a rise of around $5 billion. This surge suggests that the introduction of Ethereum ETFs could ease trading constraints and unlock a substantial influx of capital into the market.\n\nHowever, Degen Trading also points out the challenges posed by the lack of prime brokers like Genesis, which complicates spot borrowing as a hedge against CME futures longs.\n\nContrasting Ethereum with Bitcoin, Degen Trading argues that Ethereum’s ceiling is higher due to its position as a decentralized global settlement layer or \"world computer,\" compared to Bitcoin's branding as digital gold.\n\nThis sentiment is echoed by traditional finance professionals who show more enthusiasm for Ethereum and Solana over Bitcoin.\n\nThe expected conversion of Grayscale’s Ethereum Trust (ETHE) into an ETF is also seen as a positive development, likely facing less selling pressure than its Bitcoin counterpart due to a smaller lender overhang.\n\nA critical aspect of Degen Trading's analysis is Ethereum's relative illiquidity compared to Bitcoin.\n\nWith Ethereum's liquidity being only about 10% of Bitcoin’s, an influx of $3-4 billion could significantly impact ETH’s price, potentially pushing it towards the $6,000 mark.\n\nAdditionally, the current bearish sentiment on Crypto Twitter is viewed as an ideal technical setup for a bullish reversal as the Ethereum ETF launch approaches.\n\nThese factors combined present a strong case for Ethereum’s potential to reach $6,000 by September.\n\nHowever, this growth would only amount to a bit less than 2X from ETH’s current price point, so we wanted to highlight some project that can provide much bigger profits, in the 10X to 100X range.\n\nCrypto Presales That Can Provide Bigger Gains than ETH – Quick Overview\n\nBefore we make a detailed analysis, let’s check out the basics of these presales that can provide bigger profits than Ethereum in 2024:\n\nCrypto Presales That Can Provide Bigger Gains than ETH – Detailed Analysis\n\nNow we can take a look at these presales in more detail:\n\nPepe Unchained ($PEPU) – A Next-Level Meme Coin with Layer 2 Tech\n\nPepe Unchained ($PEPU), a recent entrant in the presale market, has quickly garnered over $600,000 in funding since its launch late last week.\n\nUnlike many copycat tokens that follow the success of popular coins like Pepe Coin (PEPE), Pepe Unchained aims to elevate the concept to new heights.\n\nOne of the standout features of Pepe Unchained is its upcoming launch of a proprietary layer-2 network.\n\nThis development promises enhanced speed, security, and lower transaction fees, making it a robust platform for both transactions and meme culture.\n\nThe introduction of double staking rewards further enhances its appeal, offering investors an opportunity for substantial returns once the token lists on exchanges.\n\nPepe Unchained is positioned not just as another meme coin but as an improved version of its predecessor, integrating advanced technology and rewarding mechanisms that could drive significant growth and investor interest.\n\nDOUBLE YOUR REWARDS WITH PEPE UNCHAINED STAKING!\n\nPlayDoge ($PLAY) – Combining Nostalgia and Blockchain in a Unique Play-to-Earn Experience\n\nPlayDoge ($PLAY) brings a fresh twist to mobile play-to-earn (P2E) gaming by merging the charm of Tamagotchi with cutting-edge blockchain technology. In this game, players take on the role of caregivers for their virtual Doge pets, engaging in activities like feeding, training, and playing. These interactions reward players with $PLAY tokens, creating a fun and profitable experience.\n\nThe game leverages nostalgic 8-bit graphics, reminiscent of classic video games, to attract and engage users. The combination of meme culture and interactive gameplay provides a unique and captivating experience in the crypto gaming sector.\n\nThe $PLAY token, based on the BNB Smart Chain, is integral to the PlayDoge ecosystem. It facilitates various in-game transactions and unlocks special features, enhancing the overall user experience. The tokenomics of PlayDoge are well-structured, with a total supply of 9.4 billion tokens. Distribution includes 50% for the presale, 11.5% for liquidity, and 7.5% for community rewards, among other allocations.\n\nThe presale phase has shown remarkable success, amassing over $4.6 million shortly after launch. This strong start underscores the high interest and trust within its vibrant community.\n\nPlayDoge ($PLAY) stands out as a dynamic and innovative project that combines nostalgic elements, advanced blockchain tech, and strong community involvement.\n\nFor those interested in crypto investments within the gaming sector, PlayDoge offers a compelling opportunity with its unique approach and promising early performance.\n\nJOIN THE PLAYDOGE REVOLUTION! ADOPT YOUR VIRTUAL DOGE PET AND EARN REWARDS TODAY!\n\nWiener AI ($WAI) – Innovating Meme Coins with Advanced AI Trading\n\nWienerAI brings a fresh perspective to the world of meme coins, drawing inspiration from dog-themed projects like Myro, Bonk, Dogecoin, and Shiba Inu.\n\nWhile it shares the playful essence of meme coins, WienerAI sets itself apart with its advanced AI trading bot, designed to enhance trading efficiency and provide MEV-resistant trade execution, offering users a competitive edge in the crypto market.\n\nThe token's presale is strategically divided into multiple stages, each with increasing token prices. This structure incentivizes early investment, allowing initial backers to acquire tokens at a lower cost.\n\nAdditionally, early investors benefit from generous staking rewards and community airdrops, making WienerAI an attractive addition to any crypto portfolio.\n\nWith 30% of the total token supply available during the presale, there's ample opportunity for investors to get in early and maximise their potential returns.\n\nThe $WAI presale has generated significant interest since its launch, raising $6,2 million within a few weeks. This rapid success reflects the strong market confidence in WienerAI's unique blend of meme culture and cutting-edge AI trading technology.\n\nIf you’re looking to diversify their crypto portfolio with a project that offers both entertainment and advanced technology, WienerAI could be your safest choice.\n\nBy joining early, you can take advantage of cheap token price and substantial staking rewards, becoming part of a forward-thinking community poised to make a significant impact in the crypto world.\n\nBUY $WAI TOKENS TODAY AND ENJOY ADVANCED AI TRADING BENEFITS!\n\nBase Dawgz ($DAWGZ) – A Meme Coin for the Bold Investors\n\nIn our quest for promising projects, Base Dawgz ($DAWGZ) stands out with its daring approach.\n\nThis adventurous meme coin has chosen to launch on the innovative Base network, while also embracing a multi-chain strategy.\n\nBesides Base, $DAWGZ will be available on Ethereum (ETH), Solana (SOL), Binance Smart Chain (BSC), and Avalanche (AVAX), positioning itself perfectly to capitalise on Ethereum’s bullish projections\n\nThe presale for Base Dawgz has seen great success, raising over $2 million in just three weeks\n\nThis strong start reflects the growing interest from investors who are eager to benefit from the project's innovative share-to-earn system.\n\nBy sharing memes and other content on social media, investors can earn points redeemable for rewards. Additionally, those who use referral links from the presale site will earn a 5% bonus once the coin launches.\n\nBase Dawgz combines an engaging concept with practical utility, appealing to a broad audience of crypto enthusiasts.\n\nIts multi-chain functionality and robust presale performance highlight its potential in the dynamic world of meme coins.\n\nJOIN BASE DAWGZ AND CAPITALISE ON THE BASE MEME COIN MANIA!\n\n99 Bitcoins ($99BTC) – A Revolutionary Learn-to-Earn Token\n\nNavigating the intricate world of cryptocurrencies can be challenging, but 99Bitcoins aims to make it both educational and profitable with its new initiative, $99BTC.\n\nThis learn-to-earn token redefines traditional learning by incentivizing users to engage actively with crypto education.\n\nHere's how it works: instead of merely consuming information, users participate in educational content, quizzes, and community activities related to cryptocurrency.\n\nBy doing so, they earn $99BTC tokens, making the acquisition of crypto knowledge rewarding both intellectually and financially.\n\nInitially launched as an ERC-20 token on the Ethereum blockchain, $99BTC plans to transition to the BRC-20 standard, native to Bitcoin's blockchain. With a total supply of 99 billion tokens, the project has already raised $2,2 million in its presale, pricing each token at $0.00111.\n\nThe tokenomics are designed to encourage long-term engagement, with 14% of the supply allocated for staking rewards and 17% set aside for community rewards, ensuring active contributors are well-compensated.\n\n99Bitcoins' ambitious roadmap includes listing $99BTC on decentralised exchanges (DEXs) and launching the beta version of its learn-to-earn platform by the end of the year.\n\nThe project's strength lies in 99Bitcoins' established reputation and the dual benefits of learning and earning offered by $99BTC. This token has the potential to bridge the gap between education and financial empowerment in the digital asset space.\n\nBy combining educational engagement with financial incentives, $99BTC could transform how people learn about and interact with cryptocurrencies, making it an exciting addition to the crypto ecosystem.\n\nINVEST IN 99 BITCOINS AND TRANSFORM YOUR CRYPTO KNOWLEDGE INTO PROFITS!\n\nConclusion\n\nAs Ethereum aims for a potential surge to $6,000 by September, it's crucial to keep an eye on emerging projects that could offer even more substantial gains.\n\nProjects like Pepe Unchained, PlayDoge, Wiener AI, Base Dawgz, and 99 Bitcoins are creating significant buzz with their unique value propositions and innovative approaches in the crypto space.\n\nThese presales present an exciting opportunity for investors to diversify their portfolios and capitalise on the growth potential of these next-generation meme coins and utility tokens."
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxNV0pvMlFzdmNLYVZXTXlmQllRTTVqbnR5QUtEbGRNQWlLZmwzaVgwcm9kMDU1cDNnSjNqaDBfelREMV9nSlhWTFRIWllzS0VIZjF0d1dZMk9manoxZmJfUTNhV3JxaW1QZUd6Tl80NjctMXFraUtlVS02aXlldkVPQ3ctb1VleHg2YXl0cVNHNmItTEXSAZgBQVVfeXFMUGVTSXdmTmFiS2xOczUyLXRWYzAyR1gybzBLSEcyS0RrUENEbk8wdDV2bE9LN0dUQ0oxTGRHVHRJYkcwc3RBdXFjMG9PVWRWSjFsMlVpd0RRWWN4N25ndDE1TDBOa2JjRGtVakhuMTB5ZzlYeHlpSUdzY04wWW1PZHFnbHZMWEhNVnV0ZkFvd3R4a0d6OHRnMjM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Layer 2 Blast Secures Major Exchange Listings Amid Airdrop - CoinGape",
        "content": "Blast, an Ethereum Layer 2 solution developed by Tieshun Roquerre, is making significant strides. The platform has garnered attention with its rapid ascent since its early access launch in November 2023. Moreover, it boasts a total value locked (TVL) exceeding $2 billion.\n\nBlast Gears Up For Launch\n\nFurthermore, Blast’s popularity in Blast-based games is noteworthy. Recently, Blast has also ranked among the top 10 platforms by daily fee generation. This underscores its growing influence in the blockchain space.\n\nadvertisement\n\nOn Wednesday, June 26, 2024, the foundation will unveil the Blast Vision. This will offer a clearer roadmap for its future operations. Moreover, details of the Blast tokens are yet to be fully disclosed. However, it is known that there will be multiple categories for their distribution.\n\nLatest speculations point towards rewards for Blur farmers, who may benefit from the forthcoming airdrop for the Ethereum Layer 2 token. The airdrop is part of Blast’s broader strategy to cultivate a robust ecosystem.\n\nIn addition, the network plans to allocate half of the airdrop to developers through ‘Blast Gold.’ Additionally, ‘Blast Points’ will reward early users based on their wallet activities and dapp interactions. These mechanisms are designed to incentivize both developers and users.\n\nUltimately, the goal is to foster growth and engagement within the Ethereum Layer 2 platform. In addition, the Blast token has registered significant crypto exchange listings for June 26 on Bitfinex and Bybit. This hints at significant adoption upon launch.\n\nAlso Read: Ethereum Layer 2 Blast to Launch Foundation This Week, Here’s Why\n\nBybit & Bitfinex Exchange Listing Details\n\nOn June 24, 2024, at 2:00 PM UTC, BLAST deposits became available on Bitfinex, pending network conditions. If liquidity requirements are satisfied, trading is set to begin on June 26, 2024, at around 3:00 PM UTC. Moreover, BLAST will be available for trading against US Dollars (BLAST/USD) and Tether tokens (BLAST/USDt).\n\nBybit, another major crypto exchange, announced on X, “BLAST is Coming Soon to the #BybitSpot Trading Platform With Blast L2. Listing: Jun 26, 3PM UTC. Deposits and withdrawals will be available via the Blast Network.” Bybit recently flipped Coinbase as the second-largest crypto exchange in the world. It now holds a 16% market share. This significant adoption suggests that Blast could witness considerable traction upon its launch as Bybit boasts a gigantic user base.\n\nAlso Read: ETH/BTC Price Prediction: Ethereum Price To Crash Another 7%?\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPS01EekRIZnVKV25pWmNZMmJzaVdmejBENUpReUFXYkZhOU5hUlNBdkJmWTN1MGlGSnBhQkxuX0tIQ2NCM1d4MWx3SlhtTUt2M2I2RXpJdE5YYVlsamw3N3Z0OXJiLVNmTG90TG5TNnE0MF94VEZjVjQ1R1hPcVgxZDk5N2NwU1JnYndHcjB30gGTAUFVX3lxTE91cTNjaGJhRmhSd3hDeC1kdmM3VlM5T2l3djVDZER4MXo5eFNxQkNHaHFBSno5aFBGeHBWUFlmSkg2TjlsRFhvSzlWTXdKeTdYNnFEWkE3X19lUlgwajJsOUQwbEZFcGRxcW5qaXdsdzVmZFd2WFNfUVcxQm8wZkRBS25KaXZVT0FEZkFQamw1bTBfNA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Layer 2 Blast to Launch Foundation This Week, Here’s Why - CoinGape",
        "content": "In a statement on Tuesday, ahead of the token airdrop planned for this week, Blast, an Ethereum Layer 2 network, said that it was establishing a foundation to manage the protocol. As reported by the X account of Blast, the decision was made to shift towards a more decentralized model of governance.\n\nBlast’s Governance Transition to Foundation\n\nBlast, created by the founder of the NFT marketplace Blur, announced that the governance of the protocol will be handed over to the newly created foundation soon.\n\nadvertisement\n\nThis transfer will also entail control over the social network pages and the webpage of Blast, that was formerly maintained by Arcade Research – a Blast’s development company.\n\nUntil now this account and website was managed by @ArcadeResearch, a Blast development company. As part of the transition towards a decentralized governance structure, this Twitter, the website, and governance of the Blast protocol are being transitioned to Foundation control. — Blast (@Blast_L2) June 24, 2024\n\nThe foundation is being created to help the community toward the attainment of the ‘Blast Vision,’ which will be outlined further on June 26. The foundation wants to increase decentralized decision making and community participation in the future of the protocol.\n\nUpcoming Token Airdrop\n\nBased on the preparation made and anticipation of the crypto community, the token airdrop is scheduled this week. Speaking of tokens, Blast reveals that they will be categorized although the details of the categorization are still unknown. An analysis of Blast tokens in the recent past revealed that there could be up to four to five categories, with theories suggesting that Blur farmers may be on the list of beneficiaries.\n\nThe firm has revealed that 50% of the airdrop will be given to developers via Blast Gold, while the other 50% will be given to early users with Blast Points.\n\nUsers will be able to receive points in their wallets depending on their balances, which will encourage users to engage more in the platform. To foster the growth of the ecosystem, Dapps are encouraged to reward their users with Blast Gold.\n\nBlast’s Eligibility and Distribution Details\n\nTo be eligible for the airdrop, users must hold Points or Gold in Externally Owned Accounts (EOAs) and sign in to the Blast dashboard at least once using those accounts. Points and Gold held in smart contracts will not qualify for the airdrop. Additionally, embedded wallets such as Privy need to complete the linking process to ensure eligibility.\n\nThe firm has emphasized the importance of a secure ecosystem, noting that any suspicious or insider distributions by Dapps will be reviewed, and offenders will be blacklisted from future airdrops. This rigorous vetting process aims to maintain a fair and trustworthy distribution system.\n\nBlast has been adopted widely in the DeFi space. It has also ranked at the sixth position in the DeFi network rankings, with a TVL of $2.085 billion, according to DeFiLlama. This is a strong indicator of the network’s potential to become one of the leading solutions in the Ethereum Layer 2 ecosystem.\n\nLast month, the firm underwent an upgrade that enabled support for Binary Large Objects (blobs), enhancing the platform’s data storage and transaction processing capabilities. This upgrade is expected further to boost user appeal and adoption of the Blast network.\n\nRead Also: Blast Blockchain Secures Sixth Spot In DeFi Network Rankings\n\nKelvin Munene Murithi Kelvin is a distinguished writer with expertise in crypto and finance, holding a Bachelor's degree in Actuarial Science. Known for his incisive analysis and insightful content, he possesses a strong command of English and excels in conducting thorough research and delivering timely cryptocurrency market updates.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMi5gFBVV95cUxPNHpmRVM3WHVUaW5pZkRVcDBMZktTang4bURkSm9EV0w1cXZtbDRDLWI4bkQ3eU9RcG5Xb3hHM3ltZldoUG9sbnhBdi11RUd6QklyRFIxUC1sSlJvQ3B4UFdSN05wd3g4N0VMcThpRm1BbHdkZVNOYVd0REJDcmZPVDl1Nzk1UlhSUVMxNGctVkE2a0dBNTlfQmpVS3JjRXA4VUhhb1dka3hFcUJ6Tk9aM1dmUlpHd0JTTmxIX3l3VTVPaTgwOGhYTWR5UjM3VWw1MXFEVDNGZ1hrR0hobWd2NkdhMjRLdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Jun 2024 07:00:00 GMT",
        "title": "Crypto ETF Trading Platform ETFSwap (ETFS) Announces Support For Bitcoin, Ethereum, And Dogecoin - Markets Insider",
        "content": "ETFSwap (ETFS), a crypto ETF trading platform, has officially announced its support for Bitcoin (BTC), Ethereum (ETH) and Dogecoin (DOGE).\n\n—\n\nIn a major development in the market, ETFSwap (ETFS), a crypto ETF trading platform, has officially announced its support for Bitcoin (BTC), Ethereum (ETH) and Dogecoin (DOGE). This platform has expanded its support for these leading digital currencies to ensure users can swap their cryptocurrencies for tokenized institutional ETFs.\n\nCrypto ETF Platform ETFSwap (ETFS) Declares Support For Bitcoin, Ethereum And Dogecoin\n\nETFSwap (ETFS) has extended its support for some of the world’s most popular cryptocurrencies. This innovative crypto ETF trading platform has added Bitcoin (BTC) and Ethereum (ETH), the two largest cryptocurrencies and Dogecoin (DOGE), the largest meme coin by market capitalization, to its extensive portfolio of cryptocurrencies.\n\nAs a decentralized exchange, ETFSwap (ETFS) allows users to swap cryptocurrencies in place of tokenized institutional ETFs. By supporting Bitcoin (BTC), Ethereum (ETH), and Dogecoin (DOGE), investors can now swap their cryptocurrencies in fully DeFi mode, exchanging digital assets for valuable ETFs that provide access to a range of commodities.\n\nETFSwap (ETFS) crypto ETF trading operations are anchored to blockchain technology, ensuring that users can execute trades efficiently and initiate transactions safely. This platform integrates state-of-the-art Artificial Intelligence (AI) powered ETF trackers and screeners to help users streamline their trading processes, providing the most accurate ETF recommendations based on historical data and sophisticated analytical algorithms.\n\nTo ensure user security and privacy, ETFSwap (ETFS) has integrated robust security measures to protect users' assets and secure their trading accounts. This platform is designed to safeguard users against potential cyber-attacks, having undergone an audit by leading cybersecurity and blockchain audit firm CyberScope.\n\nETFSwap (ETFS) is evolving past traditional ETF trading, acting as a bridge to both the Decentralized Finance (DeFi) sector and the Traditional Finance (TradFi) landscape. This platform empowers traders with a wide range of intuitive traditional and crypto ETF trading solutions and cutting-edge features. This includes borderless and permissionless trading, access to advanced customizable trading strategies and freedom to close and open positions during trades.\n\nTaking Crypto ETF Global Expansion To New Levels\n\nThe ETFSwap (ETFS) ecosystem is expanding at a rapid pace, continuously increasing its offerings to include digital assets which cater to the needs of its growing user base. By expanding its offerings to include Bitcoin (BTC), Ethereum (ETH), Dogecoin (DOGE), it effectively attracts investors within these communities to its platform.\n\nWith the imminent launch of its native token, ETFS, users will be able to join ETFSwap’s robust community of investors and users. This platform has already attracted more than 10,000 new users, granting them access to tokenized assets backed by valuable real-world securities.\n\nAs the demand for ETFs grows in the market, the platform is poised to witness more growth and adoption from institutional investors. Numerous investors are already flooding into ETFSwap's ongoing presale to purchase ETFS tokens and secure their positions in preparation for the platform’s revolutionary growth.\n\nMoreover, ETFSwap (ETFS) has revealed intentions to launch its own ETF in 2025, offering investors more opportunities to diversify their holdings to generate substantial gains. This platform is set to capitalize on the multi-billion dollar ETF market, taking advantage of the growing demand and inflows into Spot Bitcoin ETFs and Ethereum Spot ETFs to propel its native token to new levels.\n\nInvestors are currently buying ETFS tokens at a highly discounted price of $0.01831. The tokens are selling out fast in its ongoing presale stage, as investors are accumulating hard in preparation for a surge to $0.03846 in the next presale phase.\n\nMore than 250 million ETFS tokens have already been sold, underscoring investor’s interest and heightened demand for the cryptocurrency. With the launch of a Solana and XRP ETF, the ETFS token is poised to soar even higher, as analysts predict a 108X price increase in this bullish cycle.\n\nConclusion On ETFSwap’s Support For Bitcoin, Ethereum, And Dogecoin\n\nETFSwap’s new support for Bitcoin (BTC), Ethereum (ETH) and Dogecoin (DOGE) is a significant milestone that will pave the way for crypto ETF adoption and future development. By allowing users to swap cryptocurrencies for tokenized ETFs, ETFSwap (ETFS) democratizes access to institutional ETFs through its innovative platform. Its token presale is set to end soon. Hence, investors are urged to buy ETFS fast to generate maximum returns.\n\nFor more information about the ETFS Presale:\n\nVisit ETFSwap Presale\n\nJoin The ETFSwap Community\n\nContact Info:\n\nName: Alan hawks\n\nEmail: Send Email\n\nOrganization: ETFSwap\n\nWebsite: https://etfswap.io\n\n\n\nDisclaimer:\n\n\n\nThis press release is for informational purposes only. Information verification has been done to the best of our ability. Still, due to the speculative nature of the blockchain (cryptocurrency, NFT, mining, etc.) sector as a whole, complete accuracy cannot always be guaranteed.\n\n\n\nYou are advised to conduct your own research and exercise caution. Investments in these fields are inherently risky and should be approached with due diligence.\n\nRelease ID: 89133831\n\nShould there be any problems, inaccuracies, or doubts arising from the content provided in this press release that require attention or if a press release needs to be taken down, we urge you to notify us immediately by contacting error@releasecontact.com (it is important to note that this email is the authorized channel for such matters, sending multiple emails to multiple addresses does not necessarily help expedite your request). Our efficient team will promptly address your concerns within 8 hours, taking necessary steps to rectify identified issues or assist with the removal process. Providing accurate and dependable information is central to our commitment."
    },
    {
        "id": 72,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNZ2JhdXBzd0Q4N21pS3pzOC16QVR4ZHZRUW5kT2tjbWNQSEY2Zld0TzlrRlJadXFSZ0RKR2tnMGkwYjN2M3ZTcmFEV2FvWDI4UU9vVG1mbzc3dTlZMkNyUzJHc1p4SG9LM0RaMTluVzFjVmhGNjdaN3hWbnZhUDd4NUtBWW01X2tnV1NYctIBkgFBVV95cUxNUjUydDhtQ3RyTGZla1hRVlI0OHE2WVEyc2ZRMUIzeTZ5eHg0eE9SQmY2enJKSGIxQkdtZ3M0VDBjTDRxWHI1Z0lvZ1JIZXl6Sk1jZXhVV3Awb29OeF95MElQZVZ3eXJIYjJMTXdmcE0tb1I1T3B5MkpZSnJuV3NZWXduYktsUl9MZkVEYjdYQVI4dw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jun 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum lead the way as crypto outflows surpass $500M - AMBCrypto News",
        "content": "Negative sentiment in the market caused the increase in outflows from BTC and ETH.\n\nProjected distribution by a defunct exchanges puts the cryptos at risk of another decline\n\nCrypto investment products saw massive inflows for the second consecutive week, CoinShares’ latest report revealed. According to the digital assets management, outflows last week were worth $584 million.\n\nThis brought the total outflows in two weeks to $1.2 billion. As expected, Bitcoin [BTC] had the highest outflows with$630 million. The report explained that the gloomy perception among investors and projected interest rate cut contributed to the capital flow.\n\nIt explained that,\n\n“We believe this is in reaction to the pessimism amongst investors for the prospect interest rate cuts by the FED this year.”\n\nBTC, ETH play second fiddle to other altcoins\n\nApart from the outflows, trading volume of Exchange Traded Products (ETPs) fell to $6.9 billion. This was the lowest volume Bitcoin has had since the 10th of January ETF approval.\n\nEthereum [ETH] was second on the list with an outflow of $58.30 million. This was surprising considering that the broader market expect the Ethereum spot ETFs to begin trading in July.\n\nTypically, this was supposed to bring about optimism. However, that did not happen as the report stated that,\n\n“Ethereum did not escape the negative sentiment, seeing US$58m in outflows. While a range of altcoins saw inflows after recent price weakness, most notable were Solana, Litecoin and Polygon at US$2.7m, US$1.3m and US$1m respectively.”\n\nAt press time, Bitcoin’s price was $60,028 after it briefly fell below $59,000. ETH, on the other hand, changed hands at $3,349.\n\nIt’s the season to apply caution\n\nThe initial decline in prices could be linked to the disclosure that Mt.Gox. intended to pay back creditors $9 billion worth of BTC from July.\n\nMt.Gox is the defunct Bitcoin exchange that was hacked in 2011. It then went bankrupt in 2014, leading to a broader market collapse. If the distribution begins in July, there is a high chance that the recipients would sell off some of the coins.\n\nShould this be the case, BTC could plunge to $54,000 as predicted in some corners. For ETH, the anticipated live trading of the ETFs could save it from another round of correction.\n\nIf this happens, ETH’s price might resist another downside, and this could be the ticket to the altcoin season that has failed to appear.\n\nMeanwhile, Bitcoin’s volume neared its monthly high. At press time, the volume was $42.86 billion. Volume measures buying and selling, indicating interest in a cryptocurrency.\n\nBut considering BTC’s decline, it means that there was more selling than buying. While ETH’s volume also increased, it was not the same as Bitcoin.\n\nRealistic or not, here’s ETH’s market cap in BTC terms\n\nAs of this writing, ETH’s volume on-chain was $22.76 billion. As it stands, BTC seemed to be resisting a further decline. If bulls can defend the coin, the price might rebound to $63,000.\n\nIn ETH’s case, the value could revisit $3,500. However, if selling pressure increases, the prices could hit new quarterly-lows."
    }
]