[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMi7AFBVV95cUxOSDA0djYtVW9jRnJqRnJZd09ScHV3Yl9QT05GeHpjWUxFeVFWeGtCWkpvbzJJdVhjaU04bVQxZHhyNVBfdzJabWk2bE5RaVBxczRob3Y2b0FoYXhHTUloVGhYYnBvRXg3WjE2NXpZVFdqUXdoX0R3WTFtcC10YjZNbXM1cmsxRzlmczBWWmgxMjhLaUhNWU1XellPOWIxTnlGSHJ0NDVIUmt1MDExWm1oV3Q0b29uYTZGTHI5SEhfQ3B2ZG9YNVQ3VXU5NHo0eWgwMDRXaVExOHF3czQtMnNPLVRBRFFzclZJUFpsYQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Mar 2024 08:00:00 GMT",
        "title": "Nodle Introduces Click, The World's First Digital Trust Network, On Ethereum Through Rollup Integration - PR Newswire",
        "content": "Click Unlocks Truth in a World of Fake News with NFTs for Social Good\n\nDENVER, March 1, 2024 /PRNewswire/ -- Nodle (NODL), a long standing force in blockchain innovation, with 100,000 daily active users, proudly announces their Click camera app on Ethereum Layer 2. Click is the world's first Digital Trust Network to be deployed on Ethereum via a rollup, and marks a significant advancement in using blockchain technology for media authentication to fight fake news. Click is an innovative photo and video app which leverages the scalability and efficiency of Ethereum as an L2 solution. The NODL token is not yet available on Ethereum.\n\nClick runs on the Digital Trust Network which was developed by Nodle (NODL) and redefines the concept of trust via digital Proof of Authenticity. Through Click, users can securely capture, sign and share media content with real-time authenticated location, timestamp and device data, all on the blockchain. Click enables such data to be verified and transparently tracked in a wide range of applications, including journalism, elections, public safety, finance, proving identity, confirming deliveries, content creation, and many more emerging use cases for social good.\n\nBy integrating Click with Ethereum via a rollup, Nodle brings a very needed real-world consumer use case to blockchain and NFTs. This rollup enables Click to process transactions off-chain while maintaining the security and decentralization of the Ethereum network, significantly increasing throughput and reducing transaction costs.\n\n\"We are thrilled to be part of the Ethereum ecosystem and look forward to contributing to the community by bringing Click, the world's first Digital Trust Network, through a rollup integration and EVM compatibility,\" said Garrett Kinsman, Co-Founder of Nodle. \"With Click on Ethereum, content creators and influencers finally have a tool that enables them to publish their content on any existing web platform and trace ownership permanently.\"\n\nNodle's rollup enables:\n\nScalability: By processing transactions off-chain and bundling them into a single transaction, Click achieves significant scalability improvements, enabling high throughput and lower transaction fees.\n\nSecurity: Leveraging Ethereum's robust security model, Click ensures the integrity and immutability of transactions while maintaining user privacy through advanced cryptographic techniques.\n\nInteroperability: Click's EVM compatibility enhances interoperability across decentralized applications (dApps) and blockchain networks, enabling seamless asset transfer and data exchange between different platforms.\n\nAccessibility: The rollup makes Click's Digital Trust Network accessible to a broader audience of developers and users within the Ethereum ecosystem, fostering innovation and collaboration in decentralized finance and beyond.\n\nThe NODL token is not yet available on Ethereum but will become available in the coming months. In addition to bringing the NODL token to Ethereum, Nodle is actively expanding the Nodle network , which recently hit a new milestone of 100,000 daily active users. Nodle's SDK is currently being integrated into Click directly, which will quickly expand Nodle's reach and footprint on Ethereum.\n\nAbout Nodle and Click:\n\nThe Nodle network connects the world by using smartphones as nodes to create a digital trust network for social good. Nodle enables unique applications that can leverage the network for things like public safety, sourcing trusted user generated content, locating assets or accessing remote sensors. The Nodle network is decentralized, secure, private, and scalable making it perfect for digital witnesses, smart missions and micro-transactions. Anyone with a smartphone can join the Nodle network today. Download Nodle on iOS or Android and visit us at nodle.com .\n\nClick empowers creators and consumers everywhere to easily create authentic media content. Click is on a mission to combat misinformation and bring truthful photos and videos to everyone via an immutable digital proof of authenticity. Click makes it easy to confirm it's real and actually happened at a specific location, time and via a specific mobile device and camera. This is all made possible by ContentSign, Click's proprietary technology which proves the integrity of data from its moment of capture via blockchain. Click is the first app to leverage the Nodle network as an app for social good. Click supports the Coalition for Content Provenance and Authenticity (C2PA) and is a member of the Adobe-led Content Authenticity Initiative (CAI). Download Click on iOS or Android and visit us at clickapp.com .\n\nSOURCE Nodle"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNUk9rdmRrUTdlQXpTNG95ejBIbHJ1bnVSazZRbDdtTVV6b0RhRE80RDRHcTR3Umx2a3U2WVlZYzFvWUxPdnRDQXFUZjM1V1Z1THdVcVRpRFdyenAwYUU1SUZjbFdtUk5aS2xLajUtRTNYQ2xIN292enU5Zi0tT0xXMkVlNHhZMWVpNG9BMWhEcEZ4aGZyQU5oMw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Mar 2024 08:00:00 GMT",
        "title": "Ethereum’s Dencun Upgrade Can’t Come Soon Enough as Gas Fees Surge - Unchained",
        "content": "Ethereum users say they are spending upwards of $100 on gas fees for swaps and NFTs during peak times. The upcoming Dencun upgrade will lower fees, but there is a caveat.\n\nEthereum users are struggling with high gas fees as usage increases on the network.\n\nBitcoin’s renaissance\n\nand a\n\nspectacular rally\n\nin cryptocurrency prices is making life difficult for users of the Ethereum network.\n\nAs user demand and interest in both bitcoin (BTC) and ether (ETH) surges—on the back of the approval of spot bitcoin ETFs in the US and the potential approval of spot ether ETFs — gas prices on Ethereum are spiraling out of control.\n\nAt peak times, users are reporting paying over $100 in transaction fees for swaps, which is the exchange of one crypto token for another on the network. The average gas fee for a swap transaction is currently around $79, according to data from Etherscan.\n\nGas prices for swaps back above $100 lmao — Pentoshi 🐧 euroPeng 🇪🇺 (@Pentosh1) February 28, 2024\n\nThe “top gas guzzlers” are decentralized exchange Uniswap and Blast, an Ethereum layer 2 network that launched on mainnet yesterday. Respectively, they’ve earned $2.5 million and $1.4 million in fees within the last 24 hours, per Etherscan data.\n\n400 fucking dollars to migrate .1 ETH to Blast mainnet. It's so over. Pack it up. Ethereum is unusable today. pic.twitter.com/hZRrwRAMlz — Pop Punk (@PopPunkOnChain) February 29, 2024\n\nThe high transaction fees once again draw attention to Ethereum’s scaling challenges and how difficult it can be to onboard new users to the network during times of increased interest.\n\nEthereum is not blind to these issues, which continue to reoccur in bull market cycles. Ethereum has an ambitious multi-year roadmap to reduce transaction fees, increase security, and future proof the network.\n\nRead more: An Overview of Ethereum Scaling\n\n“Ethereum is trying to learn from this mistake of pricing away marginal users to other, cheaper chains,” said Luke Nolan, Ethereum research associate at digital asset investment manager CoinShares. “The proposed and implemented solution is to scale through layer 2 solutions, mostly rollups.”\n\nTwo key upgrades from the roadmap have already been implemented including “The Merge,” which was Ethereum’s transition to the proof-of-stake consensus mechanism, and the “Shapella” upgrade, which enabled the release of staked ether withdrawals. The next major upgrade is Dencun, which is scheduled for March 13.\n\nRead more: What Is the Cancun-Deneb (Dencun) Update on Ethereum?\n\nOne of the key introductions in the Dencun upgrade is a new transaction type called “blobs.” Ethereum layer 2 rollups currently post data to Ethereum using calldata. This is costly and makes up around 90% of the gas fees that rollups pay to post bundled transactions to the network. After Dencun, layer 2s will post the data to blobs, which are highly optimized and are much cheaper than calldata.\n\n“Overall, yes fees will reduce on Ethereum, but only for layer 2s,” Nolan said. “The general hope here is that layer 2s will become sophisticated enough over time, with seamless UX, high speed and low transaction costs … In this end state, Ethereum can compete with any new fast chain that comes out of the box because layer 1 continues to be the secure settlement layer, and layer 2 becomes the data availability layer that allows it all to scale to new heights.”\n\nUnder the upgrade, transaction fees on layer 2s will decrease between 10 to 100 times depending on the chain, said Nolan, adding that it could get very close to “Solana-esque transaction fees.”\n\nSolana’s Surge\n\nThis fee reduction couldn’t come soon enough for many users. Many Ethereum users, particularly those who trade NFTs, are talking about moving to Solana, which is a layer 1 blockchain that offers much cheaper transaction fees.\n\nIt costs 52 dollars to purchase a standard ERC-721 off Blur right now. It costs another 20-30 dollars per marketplace you want to list that NFT on. and that's with gwei relatively low (70) by bull market standards ETH does not make sense for the majority of NFT collections. — root (@rootslashbin) February 27, 2024\n\nThe average transaction costs for NFTs on Ethereum is around $140, per Etherscan, which is sometimes more than the cost of the actual NFT being traded. While on Solana, the average cost of a transaction is 0.000036 SOL, which is $0.0047, according to data from Solscan.\n\n“As of the last few months, a lot of attention has shifted to Solana NFTs, which has certainly taken some of Ethereum’s market share,” said Nolan, adding that Ethereum NFT trading is not back to the same transaction volume levels as last year.\n\nMost activity on Ethereum is centering around collections with high floor prices such as Bored Ape Yacht Club and Moonbirds, Nolan said. They have floor prices of $75,000 and $4,000 respectively. In these scenarios, a trader is unlikely to be phased by a $100 transaction fee.\n\nDaily NFT trade volume on Ethereum in millions (CoinShares)\n\n“Whilst on Solana I would venture to say that the activity for smaller collections (as well as big ones) has been picking up because transaction fees are 100x smaller on average and so the smaller value accounts have logically flocked over there,” Nolan said. “It has made for a much more enjoyable speculative playground for participants.”\n\nWeekly NFT volume on Solana in millions (CoinShares)\n\nThis is echoed by Anastasia Melachrinos, a DeFi product manager at crypto data firm Kaiko, who notes that new users are generally entering the blockchain ecosystem through centralized exchanges or directly via Solana.\n\n“It is without a doubt that high throughput upgradeable chains like Aptos or Solana will receive most of the non crypto native traffic, which is most of the world in the case mass adoption does take place,” said Sharvin Baindur, chief of staff at investment firm Saison Capital, who focuses on investing and supporting high performance and low cost blockchains.\n\nEven if gas fees on layer 2s are reduced to Solana levels, Nolan notes that Ethereum layer 2s still face challenges around fragmentation and poor user experiences, which can act as a barrier to capturing those smaller value transactions. On the flip side, Ethereum and layer 2s have a strong reputation and a very complete ecosystem, so once the execution cost is fixed the barriers to entry to those chains will be lowered, Melachrinos said."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiaEFVX3lxTE5keWZzeUM1c0NMb0RhSlBWV2R0cmRrUmpOQW82ZnJiRUp4TU9EUUxqS0NxSnhRYm5wRDlCX1RIR1VQWlM3VVEyOENKOS0tUjBrODI3TU9uX0FXbl9pUklCaER6cWRIZDFW?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 02 Mar 2024 08:00:00 GMT",
        "title": "Solana 500% Surge Sparks Ethereum Déjà Vu - TronWeekly",
        "content": "Buoyed by the bullish market momentum, Solana has recaptured investors’ sentiment, steering attention away from Bitcoin and Ethereum. SOL is on the cusp of breaking new records as the token approaches a 2-year high. From less than $10 a year ago, the leading altcoin exceeded $130, a whopping 500% surge.\n\nSimilarly, the trading volume of the 5th largest crypto asset has spiked 120% to $3.2 million. Market experts have drawn parallels between SOL’s price trajectory and that of Ethereum in 2020. If the rest of the cycle plays out similarly, a takeoff is imminent.\n\nSOL still really reminds me of ETH in 2020. Pretty sure the rest of the cycle plays out similarly too, expecting takeoff soon. Bring it on.\n\nWhile price is one way to look at it, the other perspective is revenue, as gauged by the gas fees of the respective blockchains. And Solana’s gas fees have been soaring, both in absolute terms and as a percentage of Ethereum’s gas fees. In February 2023, Solana’s daily gas fees were less than 0.2% of Ethtereum’s. In January 2024, the table flipped as Solana’s daily gas fees exceeded 8% of Ethereum’s, making a nearly 40-fold increase.\n\nImage Credit: PYOR\n\nSolana’s DeFi TVL has also scored a new milestone, surpassing $2 billion, a level not seen in the last 20 months. The new feat is a testament to its robust DeFi ecosystem, which has bounced back strongly since the 2022 FTX collapse. Since December, the total value locked has doubled, indicating increased user activity and trust in the platform’s DeFi applications [DApps]. The blockchain’s scalability and affordability make it a cheaper and faster alternative to Ethereum.\n\nSolana: Dynamics of DEX Volume and Notable Sector Gains\n\nWhat’s more interesting is that while constituting less than 3% of total DeFi TVL, Solana generates over 20% of the overall on-chain DEX volume. Along with SOL, Ethereum, Manta, and Arbitrum also recorded notable gains. This uptrend marks the fourth consecutive month of growth for DeFi since it finally broke its downtrend in October 2023.\n\nMarket observers have noted that the liquid staking and lending/borrowing sectors led the surge across key protocols, culminating in a robust DeFi week for Solana."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxQbGprRnB3bE1FdGp4YkZXRjZsM3c0YjFvN1NtVTQ5c3p3RkVYdGtScnJnTEtLS0RyMElvYWZsNXJ2Sm10eGlPcHF0Rko0VzlCVkt5S2xfeFZnVVkzd2FKMVlwaXZvZXdhRTRST2FwNmt2a29KalhRcUs0cXp3bmF3b2FLbC1vYVFjeGx1bENsdmhQaDltZ3gwM3liTkxvcXVlMGcwbWtnSVB0TnNRdHpvQTNn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Mar 2024 08:00:00 GMT",
        "title": "DeFi Made Easy: Robinhood Wallet Joins Forces with Arbitrum - CryptoGlobe",
        "content": "Robinhood is well-known as a financial services company that offers a trading platform accessible via a mobile app and website. Robinhood has gained popularity for democratizing investing by offering commission-free trades of stocks, exchange-traded funds (ETFs), and cryptocurrencies. This approach has made financial markets more accessible to a broader audience, including younger and more tech-savvy investors who might be interested in cryptocurrencies alongside traditional investments.\n\nRobinhood’s platform supports trading of several cryptocurrencies, including Bitcoin, Ethereum, and Dogecoin, among others. It allows users to buy and sell cryptocurrencies without paying a commission, similar to its policy for stock trades. This feature has contributed to the platform’s popularity among cryptocurrency enthusiasts and investors looking for an easy and cost-effective way to enter the crypto market.\n\nIn a groundbreaking announcement made at ETHDenver on February 29, Robinhood unveiled a strategic collaboration with Arbitrum, a leading Layer 2 scaling solution for Ethereum. This partnership aims to simplify access to decentralized finance (DeFi) and Layer 2 networks, promising to enhance the way Robinhood Wallet users interact with the crypto ecosystem.\n\nArbitrum is a Layer 2 scaling solution for Ethereum, designed to improve the scalability, speed, and cost-effectiveness of Ethereum transactions. As a Layer 2 solution, Arbitrum operates on top of the Ethereum blockchain (Layer 1) and aims to address some of the main challenges faced by the Ethereum network, including high gas fees and slow transaction times, without compromising on security.\n\nArbitrum uses a technology called Optimistic Rollups to achieve its goals. Optimistic Rollups essentially bundle (or “roll up”) multiple transactions into a single transaction on the Ethereum mainnet. This process significantly reduces the amount of data that needs to be processed and stored on the Ethereum blockchain, leading to faster transaction speeds and lower costs.\n\nThe collaboration between Robinhood and Arbitrum is set to open doors for Robinhood Wallet users, granting them seamless access to Arbitrum swaps through decentralized exchanges. According to Robinhood’s press release, this integration addresses some of the most pressing challenges in the crypto space: high transaction costs and slow transaction speeds that have hindered the broader adoption of blockchain technologies. By leveraging Arbitrum’s advanced scaling solutions, users can now enjoy the benefits of low transaction fees and enhanced speed on one of the crypto ecosystem’s most popular networks.\n\nLooking ahead, Robinhood and Arbitrum have committed to expanding their partnership to include support for cross-chain swaps and launching campaigns aimed at reducing the barriers to utilizing web3 functionalities within the Robinhood Wallet.\n\nJohann Kerbrat, General Manager of Robinhood Crypto, emphasized the critical role of Ethereum gas fees in securing the network, while also acknowledging the deterrent effect these fees can have on new adopters. He highlighted how Layer 2 solutions like Arbitrum, renowned for its total-locked value, address these concerns by making L2 access and transactions more user-friendly for those new to the web3 space. The Robinhood Wallet now serves as a gateway, removing the complexities traditionally associated with navigating the DeFi landscape.\n\nA.J. Warner, Chief Strategy Officer at Offchain Labs, the team behind Arbitrum, expressed enthusiasm about integrating Robinhood Wallet into the Arbitrum ecosystem. This move is anticipated to significantly impact the DeFi community on Arbitrum, bringing Robinhood’s vast user base into the fold with low-cost in-app swaps. Warner views this collaboration as a pivotal moment for web3 democratization, empowering users to delve deeper into the possibilities of decentralized finance.\n\nThe Robinhood Wallet, a self-custody solution, empowers users to take full control of their digital assets across multiple networks, including Ethereum, Bitcoin, Dogecoin, Arbitrum, Polygon, Optimism, and Base. By allowing users to hold their private keys, Robinhood ensures that users maintain complete ownership of their crypto assets. The wallet is designed to cater to a broad spectrum of users, from beginners seeking intuitive interfaces to experienced traders looking for advanced tools.\n\nThe Robinhood Wallet is available for download on iOS, with an Android version slated for release soon.\n\nFeatured Image via iOS App Store"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxOTmplWGlIeWRFdzk2dUhlUXdWRzQ2R1M3TGIzV1FpNkdhaTB1S0xsMGZKUEZwaFZmLXluQUp3MmZMV2VDUnlTTUcyeUl1WlNFSjQ5OGZuSFhwS0s0ckZkSE52eGkzQ0t5WjU0MTZJMGZxOGxfRWJ2QXJhOTNYaGZOWEhFLTExcEo0Q0lrS2lfVVdWVVhy0gGaAUFVX3lxTE1VSEQ0cHBzQ2lQWERHdWtXWjZpdXBZa2NFaWZUR2xUakhIWVp0SEdfRzdGRmliZ1FUcHJlZGcwSl9UbWdKQ1dSeTBtMjdRYjRBdFVtMTg1THJsY2xTSWpocFhNbkpyNFBfTXhSRi1rTWtlalZQbVA1WVQ2cE1PWC13TFVJNXdUQTVEMVhLOEgtUVFRZmtmZWxhSmc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Mar 2024 08:00:00 GMT",
        "title": "Ethereum Price Prediction: Is ETH Headed for $5,000 in the Mid Term? - CryptoPotato",
        "content": "Renowned trader and technical analyst Michael van de Poppe believes altcoins are rising, and Ethereum is set to benefit from the upcoming upswing.\n\nVan de Poppe, who shares insights with his 697,000 followers on X, predicts a surge in the altcoin market, which could lead Ethereum (ETH) to potentially reach $5,000 as investors turn their attention away from Bitcoin towards altcoins.\n\n#Altcoin market capitalization is slowly moving upwards. The upside could be captured on Bitcoin, meaning a rotation towards altcoins. Therefore, Ethereum to $4,500-5,000 is likely, while altcoins will accelerate with 2-4x returns. pic.twitter.com/FKEaPpjrZv — Michaël van de Poppe (@CryptoMichNL) February 29, 2024\n\nIt’s worth recalling that layer-2s on Ethereum are experiencing a boom in Total Value Locked, pushing ETH to new peaks. Moreover, it seems the attention is shifting to the possibility of an Ethereum spot ETF by May 2024.\n\nThis week, multiple altcoins have exploded in price, especially meme coins like WIF and PEPE. Solana reached an intraday high of $134, gaining over 10% in 24 hours.\n\nPossible Bitcoin Correction?\n\nRegarding Bitcoin, Van de Poppe hinted at a possible correction following the substantial net inflows driven by institutional demand. He pinpoints possible support levels at $46,000 or $53,000.\n\nPoppe is not the only analyst warning about retraces. Daniel Yan, co-founder at Matrixport, warned against a possible correction of 15% by the end of April, which would be around $52,000-$53,000.\n\nSimilarly, well-known crypto trader Ali (Ali_Charts on X) reports a notable increase in profit-taking by Bitcoin whales, highlighting that over the past three days, they’ve sold off more than 80,000 BTC, equivalent to around $4.8 billion.\n\nAli also pointed out that the TD Sequential indicator has signaled a sell on the 4-hour chart for Bitcoin. He notes that since February 15, “every sell signal from this indicator has been spot-on, leading to $BTC price corrections between 1.50% and 4.20%.”\n\nHowever, only time will tell whether Bitcoin will find and sustain support above $50K or correct below that figure. One thing remains true —Bitcoin and the overall crypto market have had their best month in years, with BTC adding thousands of dollars to its price daily and most altcoins going vertical this week."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxNYVRWQ1QzZmYtNHFhOEVUT1UwcVRLaWNacGdPNlFkc1lPVk53Vms0MVBJa2Y4OUl6TGlqc2JXcXlQQ0twRHdsRHdORVNWZmdXeFhWVVQ4c3lBOXRJdWhlWEE4Q0RBanZkRWY0U0RYQ0pVR09rdjNJYlk5REZWQ0cwTmdlSS1aQWV3Y3pLSXRQbEN0VkVwN1BVai1rS2k?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Mar 2024 08:00:00 GMT",
        "title": "Ethereum memecoins go viral with $6.4bn traded in February - DLNews",
        "content": "Ethereum memecoin trading volumes surged by 61% in February, reaching over $6.4 billion.\n\nMemecoin market dynamics are influenced by their meme appeal rather than by utility, showcasing a unique aspect of crypto speculation.\n\nSmaller market cap memecoins on Ethereum, MOG and GROK, saw extraordinary gains of 920% and 172%, respectively.\n\nTrading volumes for memecoins on Ethereum soared by 61% in February from January, reaching over $6.4 billion.\n\nMemecoins are cryptocurrencies that draw their inspiration from internet memes, pop culture phenomena, and trends that have gone viral.\n\nThe coins hold no inherent value. Instead, their price appreciation is driven by the attention they garner from traders and speculators.\n\nThe prices of memecoins on the Ethereum blockchain with market capitalisations of over $1 billion exploded in February. Pepe, Shib, and Doge all soared, rising 292%, 57%, and 59%, respectively.\n\nSmaller market caps on Ethereum, MOG and GROK, rose 920% and 172% in February from January.\n\nPrice history of memecoin MOG\n\nMOG describes itself as “effortless cosmic domination and unadulterated success distilled into computer photons, wrapped into ERC-20 tokens, and placed directly on the Ethereum blockchain.”\n\nThe GROK memecoin was inspired by the release of GROK AI from Tesla CEO Elon Musk, but it has no official relationship with GROK AI. Rather, GROK, the memecoin, describes itself as “establishing a community of GROK AI enthusiasts who want to save the world and love making memes while doing it!”\n\nThis is all to say that memecoins are quite random and their price performance doesn’t come from utility, but rather from how well the meme behind the coin resonates with crypto traders.\n\nJoin the community to get our latest stories and updates\n\nIn December, memecoin trading was largely dominated by Solana, but now volumes have shifted back to the Ethereum mainnet.\n\nVolumes on Telegram trading bots, which are apps designed to simplify onchain trading by letting users trade on decentralised exchanges through the popular messaging app Telegram, have also shifted to Ethereum mainnet over the last month.\n\nThe top trading pairs on Telegram bots are generally memecoins, and so it provides insight where memecoin trading volumes might be.\n\nPrevious 30 days of Telegram trading bot volumes. (Whale Hunter)\n\nAlthough trading volumes are dominated by Ethereum, memecoins have still been successful on other chains.\n\nPopular Solana memecoin dogwifhat, WIF — named after an internet meme of a dog wearing a pink knit hat — hit an all-time high today of $1.10, giving it a total market cap of $1.1 billion. This is a 70,000% gain since the coin launched on December 13 at a price of $0.0015.\n\nBase, an Ethereum layer 2 blockchain, witnessed its native memecoin, Toshi—named after the cat of Coinbase CEO Brian Armstrong—reach an all-time high of $0.00018. The surge pushed its market cap to over $75 million.\n\nGot a tip about DeFi? Reach out at ryan@dlnews.com."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxNeHpTdEdjTEM3OVNPOTExaVZGOE5ZM3Z6MHp2eW5tTXhZNG5xZ3JGMnhIRGJLUGZFdmNraGxIQ2VwQzBKNVpMNzN6UmdvMnhSbGhySXotQkpiQnVobVFGRkR0c0MtR1RjU2hncjRGQ3g0UVVMUTlqVjZncmlWQm4yUmk0UzhzNkhZTEVz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 02 Mar 2024 08:00:00 GMT",
        "title": "Filecoin is riding the boom in liquid staking - DLNews",
        "content": "Liquid staking is booming on Filecoin.\n\nMost of the increase has come from the GLIF protocol.\n\nGLIF said it intends to launch a points system, a trend among Ethereum and Solana DeFi applications.\n\nAlmost one year after the introduction of Ethereum-style smart contracts, so-called liquid staking protocols are booming on Filecoin, a blockchain built to store data.\n\nSince January 1, the value of crypto locked in Filecoin’s dozen liquid staking protocols has grown to more than $450 million from $272 million.\n\nIt’s a sign users are becoming more familiar with Filecoin and its nascent DeFi ecosystem.\n\nIt’s also another sign that users love the points systems that have taken over Ethereum and Solana, too.\n\nA “likely catalyst” for Filecoin’s recent growth “is the anticipation of rewards programs that incentivise user activity,” Messari analyst Mihai Grigore told DL News.\n\nLike airdrops — projects’ distributions of free tokens to reward early or loyal users — points programs, which function much like traditional businesses’ rewards programs, can juice user activity.\n\nUnlike airdrops, however, they allow US-based projects to avoid the regulatory headache that can come with promising or issuing tokens.\n\nAs such, they have spread like wildfire among decentralised finance applications on Ethereum and Solana. They appear to be a powerful incentive on Filecoin, too.\n\nJoin the community to get our latest stories and updates\n\nOf the dozen liquid staking protocols tracked by DefiLlama, all have grown at least 48% in the past month. But GLIF, the largest, has separated itself from the pack.\n\nGLIF is a long-running project on Filecoin. It built one of the blockchain’s first wallets, according to founder Jon Schwartz. When Filecoin developers added smart contract functionality in March 2023, GLIF built a liquid staking service.\n\nDeposits to GLIF have skyrocketed since early February, when it announced a $4.5 million raise and the launch of a points system sometime in the first quarter of the year.\n\nSince then, the total value of crypto locked in GLIF has more than doubled. On February 22, user activity briefly overloaded GLIF’s website.\n\n“Year-to-date, GLIF’s increase in net deposits of [about] 6.9 million FIL accounted for nearly 76% of the total DeFi net deposits on Filecoin,” Grigore said. That figure doesn’t account for collateral posted by borrowers on GLIF.\n\nSchwartz attributes the jump to points and to growing comfort with Filecoin.\n\nWhen Filecoin developers launched the blockchain in October 2020, there were only 11 built-in smart contracts.\n\n“That would be analogous to Ethereum having, say, 11 smart contracts, and those were the only ones you could really use on the network,” Schwartz told DL News. “No developers like myself could deploy custom smart contract logic to the chain.”\n\nThat changed last March, when developers introduced smart contract functionality.\n\nThat change brought Ethereum-style smart contracts on Filecoin, enabling DeFi use cases, “notably liquid staking,” Grigore said.\n\nSchwartz believes the blockchain is now reaping the benefits of that paradigm change.\n\n“You know how these things go, especially with new and immature networks,” he said. “It takes time for DeFi to develop and for people to get comfortable.”\n\nLiquid leasing\n\nLiquid staking is the biggest business on Ethereum. As of Wednesday, users had deposited more than $46 billion in cryptocurrencies in Ethereum’s three dozen liquid staking protocols.\n\nThat’s because it addresses a key issue with Ethereum’s so-called proof-of-stake security system, which was adopted in September 2022.\n\nIn a proof-of-stake system, security, as well as the privilege of confirming and ordering transactions, comes from users willing to lock up, or stake, their Ether in exchange for a modest annual yield.\n\nLiquid staking protocols address the opportunity cost that comes with locking away one’s Ether by issuing derivative tokens, which typically trade at par with Ether and are accepted in its stead by decentralised exchanges and lending protocols.\n\nFilecoin isn’t a proof-of-stake blockchain, and Schwartz prefers to call GLIF a “liquid leasing” protocol.\n\n“That said, the problem space the GLIF is filling for Filecoin is pretty much the same problem space that, say, Lido is building for Ethereum, or Jito for Solana,” he said, referring to other blockchains’ liquid staking protocols. “But the mechanisms are different.”\n\nFilecoin’s big year\n\nIt’s just the beginning of what could be a busy year for Filecoin.\n\nEarlier this month, Filecoin and Solana project Triton One announced a partnership, in which Triton would store Solana data on Filecoin.\n\nDevelopers behind billion-dollar decentralised exchange Uniswap deployed the protocol to Filecoin this week. SushiSwap developers launched their decentralised exchange on the blockchain in November.\n\n“A lot of these new projects that have components that were built on the [smart contract functionality] … they’ll come out this year,” Schwartz said.\n\n“It’s going to look like a different Filecoin, simply because what’s possible this year was not possible in the three, four years prior,” he added.\n\nAleks Gilbert is a DeFi correspondent for DL News. Have a tip? Contact Aleks at aleks@dlnews.com."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxNMUh0Wkxwc0FfbFE3cWVXWmxGWC1yYUZuMzd5UWZUN3VaY2dBNjVPWDlBNWdwOWNOcGlhZ1dxVmxSTlJFQkFKc0QwclNrNzd3cm1TMGIwenlYTkxJVVphY3ItRzU2WmdCMnpnYklHdmMtVVJUUk1JcG9GenU5dFlWUUx0dkE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Mar 2024 08:00:00 GMT",
        "title": "Blast Mainnet Launch Boosts Ethereum L2 - Crypto Times",
        "content": "The Blast optimistic rollup, an Ethereum layer 2 solution, officially launched its mainnet on 29th February at 9 PM GMT. Since November, over $2.3 billion in ether and stablecoins have been deposited onto Blast, allowing users to earn staking yields and interest.\n\nThe Blast Mainnet is NOW LIVE\n\n\n\nEarly Access users can bridge to Mainnet and use Blast-native Dapps that don’t exist anywhere else👇 pic.twitter.com/mt5dJOADMp — Blast (@Blast_L2) February 29, 2024\n\nThe launch enables the first withdrawals from the network after deposits have been locked since Blast’s beta launch. The news comes after criticism from Paradigm’s Dan Robinson over the inability to withdraw funds.\n\nBlast aims to attract developers by allocating 50% of its community airdrop to mainnet protocols.\n\nA bonus goes to winners of its Big Bang competition that drew over 3,000 participating protocols.\n\nSome users found a way to deposit funds into Blast before the official launch by sending them to a smart contract address. Over $50 million has already been traded, mostly in memecoins like BlastCat. But depositing early carries risks as tokens can rug pull by removing all liquidity.\n\nNow live, Blast is the 7th largest blockchain and 2nd largest Ethereum layer 2 by total value locked at over $2.3 billion. Users can still earn Blast points until the token airdrop in May. Blast futures trading on Aevo implies a fully diluted valuation of $6.7 billion."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxNM2phdXo1N0lTOWRCbVRxeVM3aW53V2NQV3ExM3J5QkFISnhUaklzcDNuWUFGa2VMb0g3WU5vZmtpLTFtVXkxczVBam1wUEFrSnZBZDBsY0RrUmVxaWNnM2kyaWFHX0wtcmFkcVZyWnk2bTJQOHNtRTFHaUJlTjFjS3A4VDdFVnZsUWoybGZYSGRyanpFa2tiejlKbVVoQ215c1haOHZpNWtLMHJjNzdZQ0J30gG3AUFVX3lxTE5ra3VLc3VMRVBUUEI5V28tNWx4TTFmZml5eldOOVVWWHZVS2FubVEtQkIyTnlXMGFFZ0pDLXhvREpUZE84dEUwTnliRlI2NEpqdnZ2S2txcnVQTUxmcnB2NVBGbFhnalJlYzJaZE5BQk5EanNzUUFjSEJYVnpVOWZvMUFLRjhCZ3R4ZUdsOWNhZTE1TERlZ3QxcW82SFJkdURicFFWUHhXNVVFMUc0TTFpb3o1Nkp1aw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Mar 2024 08:00:00 GMT",
        "title": "Solana (SOL) Performs Enormous Breakthrough, Ethereum (ETH) Euphoria Continues, Will Bitcoin (BTC) Reach ATH in Next Few Days? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nSolana has broken through a critical resistance level, marking a potential trend shift for the cryptocurrency. The chart indicates a significant break of the upper trendline resistance, establishing a new movement scenario for the asset.\n\nSolana has showcased remarkable price performance, as evidenced by its latest rally past the upper trendline of its ascending channel. This breakthrough is a classical technical confirmation of bullish sentiment, and it suggests the possibility of a sustained upward trajectory. With SOL's price pushing through the $130 mark, the cryptocurrency has not only defied immediate resistance but has set the stage for testing further highs.\n\nLooking at the support levels, Solana's price is comfortably positioned above the 50-day (orange line) and 100-day (blue line) moving averages, which have historically acted as dynamic support in uptrends.\n\nThe immediate support level now stands around the $107 mark, which coincides with the previous resistance-turned-support trendline. The robust volume accompanying the breakout adds credence to the bullish outlook, indicating strong buyer interest.\n\nAdvertisement\n\nConversely, the next resistance level to watch is near the $140 zone, where profit-taking and psychological round numbers may temporarily stall the rally.\n\nEthereum looks unstoppable\n\nEthereum continues its meteoric rise, currently showcasing a price surge that has left investors and enthusiasts in a state of euphoria. However, amid the celebration, if a vigilant eye is cast toward the chart, signs of a potential bearish reversal loom, warranting a closer analysis of the second-largest cryptocurrency's extraordinary rally.\n\nEthereum's rally has been nothing short of spectacular, with prices breaking past resistance levels with apparent ease. As of the latest trading sessions, ETH stands tall above $3,500, yet this unstoppable rally may have investors questioning the sustainability of such growth.\n\nShould a reversal occur, the focus would shift to potential support levels that could cushion Ethereum's descent. The $2,695 mark emerges as a critical juncture, aligning with the 50-day moving average, a dynamic level that historically serves as a battleground between bulls and bears. A breach below this level could see Ethereum testing the $2,065 support, near the 100-day moving average, which may provide a stronger foundation for the digital asset.\n\nThe current trend indicates that while the market is riding a wave of optimism, caution is advised. Ethereum has defied traditional market expectations, but no asset is immune to corrections. The foreseeable future suggests that if traders begin to lock in profits, a bearish scenario could unfold, triggering a sell-off toward the identified support zones.\n\nBitcoin's strength is rising\n\nThe cryptocurrency flagship, Bitcoin (BTC), is showcasing a formidable display of strength on the market, with its price trajectory pointing sharply upward. As the market rides a wave of euphoria, the question on many investors' minds is whether Bitcoin is poised to reach new all-time highs in the near future.\n\nBitcoin's price has been on a relentless climb, and the latest candles on the chart reflect significant buyer confidence. Currently, the price has surged past the $60,000 resistance level, an important psychological barrier that could now be serving as a platform for further gains. The steep ascent is accompanied by a substantial increase in trading volume, indicating a strong conviction behind the move.\n\nThe moving averages - 50-day, 100-day and 200-day - are aligned in ascending order, which is a classic bullish signal. These lines are likely to act as dynamic support levels in the event of a price retracement. The 50-day moving average, in particular, has been a reliable support throughout the recent rally, suggesting that any dips might be viewed as buying opportunities by bullish investors.\n\nAs of now, the RSI is trending toward overbought territory, suggesting that Bitcoin is extending into an area where a reversal could occur. However, during strong trends, assets can remain overbought for extended periods, defying the traditional expectations of an immediate pullback."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxQWGF5N1JRTjBncFdocDZjd0sxcVFIbE5ONnZyM3hTVDAzWFpLZ1IxeUdUdGJQUUhCVUNIRmxuS1k3dGNGNklPVjRaSWxfeEZXTXJINGVLSmR2R0tVZmNQRUR0QUM5eU0xRUhJS2FhSE5lRHVqLW5jZmNCbDFiX1Z5R1ZMMDkySjB3NVAyZnNNcUHSAZYBQVVfeXFMTkRJNjZ0a01HYl9KS2ZXcnh5NTFDcUxveWstQzVHcS1jbGdKYkJRb3hEZV84R1VQXzNsdC13RC1qVF8yR3pGR24wNjB3QkRQYjRHbVFkWllxblB2NldOaF9tVEdXR0dYNHZQYnZHT1JCV1RSSmQ0RmlqLVM5MTZFYjNheGdaV0t6UnFKS0p0bktXRjQ5UWdR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 02 Mar 2024 08:00:00 GMT",
        "title": "Ethereum L2s take the center stage as countdown to Dencun begins - AMBCrypto News",
        "content": "ETH L2s handled nearly 10x more transactions than the base layer in the last seven days.\n\nTVL on ETH L2s jumped 65% YTD.\n\nEthereum [ETH] layer-2 (L2) solutions carried on the strong momentum generated in the last year to 2024 as well.\n\nEthereum scales and how\n\nAccording to a recent post by on-chain analytics firm IntoTheBlock, transaction volumes across leading optimistic rollups including Arbitrum [ARB], Optimism [OP] and Base have nearly doubled since the start of this year.\n\nOn expected lines, Arbitrum accounted for more than 50% of the total volume.\n\nTo get more insights, AMBCrypto examined the broader ETH L2 market, which included zero-knowledge rollups (zk-rollups) as well.\n\nData sourced from L2Beat showed scaling solutions processing nearly ten times as many transactions on the mainnet over the last seven days.\n\nThe average transactions per second (TPS) on the L2s consistently remained above 100 since the 25th of February, while the mainnet’s count hovered in the usual range between 12-14.\n\nL2 solutions witness jump in TVL\n\nThe so-called L2 solutions, built atop the base layer of Ethereum, were projected to be the answer to the scalability question.\n\nWhile these chains handle the bulk of the low-value transactions, the mainnet would take care of security and decentralization, thus addressing the blockchain trilemma to a great extent.\n\nThe fundamental advantages like high throughput and low fees attracted a plethora of decentralized applications (dApps) towards L2s.\n\nAs of this writing, more than $33 billion was locked into L2 projects, implying a 12.9% increase over the week, and a 65% leap year-to-date (YTD).\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nA watershed event awaits\n\nSuch numbers come at a time when the L2 proponents and the broader Ethereum ecosystem were eagerly awaiting for the Dencun Upgrade. The biggest upgrade since last year’s Shapella, Dencun was expected to bring about a whopping 10x reduction in L2 transaction fees.\n\nIf these estimates come true, the ETH L2 ecosystem might hold the vast majority of all DeFi users and apps in the near future."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxOcXRPTF85U0VVVmR0TlhfMXlobTIyWXZPbkgyY0xfWDQ3WXVTV1E4X3RGU25EZVlEQUs2TERHWEdWV0o4cllBSUhoTmd4UnQ1RzRHNjg3X0hVeGRoNFNwZFJGMEM4YWxMQlNPY0dhaE1VWDI4WWVlZmU3ZWhyQ3BzMGdra9IBiAFBVV95cUxQMHIxa2NqRVZRNWU3MjBKX2V4M1JDV2kwU2pCeTVMNHU5YjVwZktBUEplR1BnRGVPcWhMNmplQm1adDdkM0xwX1pIVlp3Tm1mWXlnQ3ljbFlLenJuUEoyS0FENTZiNDBnd2t6T3d1VUxBWXVZQWxKbFA3WmNqZ0JENnlWMGZacFVX?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Mar 2024 08:00:00 GMT",
        "title": "Crypto Price Analysis Mar-1: ETH, XRP, ADA, SOL, and BNB - CryptoPotato",
        "content": "This week, we take a closer look at Ethereum, Ripple, Cardano, Solana, and Binance Coin.\n\nEthereum (ETH)\n\nEthereum impressed with its rally this week after booking a 16.3% price increase. In the process, buyers managed to break the resistance at $3,340 and re-test it as a key support.\n\nWhile the trend remains firmly bullish, the momentum indicators appear a bit over-extended, which could make buyers exhausted if they continue at this rate. Only in February ETH increased by over 50% with little pullbacks.\n\nLooking ahead, the most important target for ETH is found at $4,000, which will also act as a resistance.\n\nRipple (XRP)\n\nDespite the volatility this week, XRP still managed to close in profit with an 11% price increase, and buyers successfully defended the support at 54 cents.\n\nBulls have a good shot at taking XRP higher in March after the correction that started back in November ended last month. The next target and resistance is found at 69 cents.\n\nLooking ahead, XRP has turned bullish, and the buying volume has returned to levels not seen since 2023. These are clear signals that the buyers are in charge.\n\nCardano (ADA)\n\nCardano impressed with a 17.6% price increase this week after briefly reaching 70 cents. This performance allowed bulls to make a new local high.\n\nThe support is found at 60 cents, and the current target for this rally is 82 cents. If buyers continue at this rate in March, then the next target is only a week away.\n\nLooking ahead, ADA bulls have returned in full force after the most recent correction ended in late February. The trend is bullish, and March looks primed for higher levels.\n\nSolana (SOL)\n\nSolana made a new high this year and nearly reached $138, making it the best-performing cryptocurrency on our list this week, with an impressive 31% price increase.\n\nSOL also broke above the $126 resistance, which has since turned into a key support. Considering the buy volume, this rally seems more likely to continue.\n\nLooking ahead, after the latest breakout, Solana’s target has moved to $163, which will also act as a key resistance.\n\nBinance Coin (BNB)\n\nBinance Coin reached $400 and managed to close the week with an 8% price increase. The current support is at $377, and resistance is at $437.\n\nEven if this rally enters a pullback later, the larger trend remains bullish. If it continues, it could see BNB continue to make higher highs.\n\nLooking ahead, this cryptocurrency is well-positioned to challenge the all-time high at $692 this year and maybe even exceed it."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxPMHU0T21qaU0tMkl0R2VRRXo3MVNRZnhQUWlPbW9FMnUtZS1oRTAxY3hjYy1veHF5eF90OFIwS0VzQW5RT2NwQVB4MXpVNnVCZ05nRzliRllieVZUc0pmaVpsZDVGbnFLQzJLZ0Z2TGI2U3J5S0I1SVJESHdLam8xRV9RYjM2aFNMcnlWczZ3SmJvM3ZCNUxOVDR3eHhLdzZGalIwcERrZmtDTnd2UTNDSjFNWGRYcUY2MzJscDY4Z1pOM1Nh?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Mar 2024 08:00:00 GMT",
        "title": "Dormant Ethereum Whale moves ETH; Rising curiosity in Near Protocol and emerging AI Altcoin - Cyprus Mail",
        "content": "Never say never. That’s what seemed to be the case after a dormant Ethereum (ETH) whale woke up to send tokens worth $5.15 million. There had been no activity in the wallet address for around a decade. The tokens were sent to the crypto exchange Kraken. The development comes days after Ethereum crossed $3,000.\n\nThe sudden whale activity also highlights the potential of Ethereum as the next token to power a crypto exchange-traded fund (ETF). As concerns about the legal aspects of BTC ETF continue, many analysts have suggested Ethereum ETFs might be a solution to the problem because of their versatility.\n\nThe altcoins that have been seeing rising user interest were NEAR Protocol and InQubeta (QUBE). While NEAR Protocol is a developer-friendly protocol for deploying Web 3.0 solutions, InQubeta is a fundraising service for AI projects. Its presale funding recently crossed $10.4 million.\n\nInQubeta: Helping AI startups discover new milestones\n\nInQubeta is an Ethereum-based cryptocurrency that doubles up as a business development ecosystem for AI startups. Its collection of services helps startups shed inhibitions and grow their business models using blockchain-based solutions.\n\nFor crypto users, InQubeta is among the best cryptocurrencies to buy now. It facilitates seamless investments in AI projects. The startups selected by InQubeta have to go through intensive screening to ensure that only the best make the cut. Startups can then raise funds by minting equity based NFTs that can be bought by investors on the InQubeta platform.\n\nIts native cryptocurrency, the QUBE token, is a deflationary asset and can be staked. By adding InQubeta to their portfolio, people wouldn’t have to think about what cryptos to buy now for a long time.\n\nA total token supply of 1.5 billion is split between different uses like presale, paying legal fees, compensating developers, funding marketing campaigns, and giving out staking rewards – that’s what InQubeta’s tokenomics looks like. The largest share of the token is for the presale. Only 35% of the stock of coins goes towards the expenses.\n\nGiven its presale success, the QUBE token today is a part of top analysts’ best cryptocurrency ICO lists.\n\nEthereum L2 Zircuit draws $128 million in deposits within 24 hours\n\nEthereum is a popular blockchain technology that can be customized to roll out a range of solutions like decentralized identities, blockchains, and crypto assets.\n\nTransactions made using its native token ETH are validated with the proof-of-stake consensus protocol. Its popularity has also drawn attention to its potential to power the next crypto ETF.\n\nMarket experts suggest that the ETH token can do a better job of countering regulatory challenges for ETFs.\n\nThe cryptocurrency has been in the news after Zircuit, a Layer 2 blockchain built on Ethereum, drew over $128 million within 24 hours after it started accepting deposits. Zircuit allows crypto users to stake restaked and staked assets.\n\nNEAR Protocol’s new wallet gains 300,000 users in 48 hours\n\nNEAR Protocol is an emerging crypto that offers new-age tools for building powerful dApps. Developers can find multiple resources to upskill and share their ideas with professionals from the Web 3.0 industry.\n\nThe platform’s native token NEAR is used for all on-chain transactions. The Near protocol has registered a strong interest from developers due to its easy to use interface and ability to deploy dApps at the click of a button.\n\nThe platform recently released a self-custodial wallet called HERE. The wallet created a record of sorts after it clocked around 300,000 registrations within 48 hours of launch.\n\nIts USP is that Telegram users can seamlessly set up a blockchain-powered wallet.\n\nConclusion\n\nInQuebea, Ethereum, and NEAR Protocol are altcoins to watch out for this year as they haven’t let market volatility get to them till now. These tokens have posted consistent returns that have even trumped analysts’ expectations.\n\nThese crypto projects have been in the news for different reasons which has enabled them to garner more token holders. As Ethereum drew more users because of its upcoming Dencun upgrade, NEAR Protocol hit the headlines with an airdrop. InQubeta, meanwhile, grabbed the spotlight with its presale success. The collective impact of these tokens also helped with market recovery.\n\nMarket experts suggest that these tokens have a long way to go as they have high growth potential. Chances are people might see InQubeta, NEAR Protocol, and Ethereum leading the next crypto bull rally.\n\nDISCLAIMER – “Views Expressed Disclaimer: Views and opinions expressed are those of the authors and do not reflect the official position of any other author, agency, organization, employer or company, including NEO CYMED PUBLISHING LIMITED, which is the publishing company performing under the name Cyprus-Mail…more"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPT0lHX0R3dGdLb2F6QXFrT0x4eXM0U3h4RXZJT0hzc0RkZm9oN1dmNXlkTUVmTElIT19YMHZGbzdsaXN3dmw1LWZPMWNLWE1mUFV4ZjhoY3VFQnozaTBER3JCUHNxSE8xdWg1TE9jLVdNa29iZFhVc3NzckJVWjBBalV2WV83MWfSAYwBQVVfeXFMTm12X2R1MXVma0J2N2pETWd1U0l1bk5wVXhkWnF2Z0tKeVdHQ0ZjSmNIYTlmcFk0MXd3Q1VnYUJKQlM5TkkwWGJzOTlzaWhGaXYwVElWNDBacUFRYzhtWHdkNlVWZlB5OHZObVFJSEx1bTZHbnNFYzFNVWJnUzB5RXppWTEwVVM5anFFR2Q?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Mar 2024 13:15:35 GMT",
        "title": "Cardano (ADA) Skyrockets 16% in Week Full of Technological Advances - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nIn a week marked by significant technological strides, Cardano's native cryptocurrency, ADA, surged by an impressive 16.5%, reaching a peak of 20% in value. The price surge propelled ADA to $0.7, consolidating its position as the eighth-largest digital asset by market capitalization, which now stands at a formidable $24.45 billion.\n\nAdvertisement\n\nThe surge in ADA's price was not an isolated event but rather a reflection of the substantial progress witnessed across the Cardano ecosystem. Major developments in core technology, smart contracts, scaling solutions and governance initiatives have set the stage for ADA's remarkable ascent.\n\nADA to USD by CoinMarketCap\n\nCardano development week\n\nIn terms of core technology, the ledger team made significant strides by introducing reference script support for Plutus V1 in Conway. This development, coupled with bug fixes addressing stake distribution inaccuracies, lays a robust foundation for the blockchain's functionality.\n\nAdvertisement\n\nMeanwhile, the Plutus team advanced smart contract implementation by initiating the Plutus contract blueprint for Plutus Tx and updating the quick start guide to streamline developer onboarding.\n\nScaling solutions received a boost as the Hydra team resolved critical bugs, optimized fee estimation mechanisms and implemented transaction metadata enhancements. Similarly, the Mithril team introduced a new distribution with critical updates, including improved stake distribution support and bug fixes.\n\nOn the governance front, the SanchoNet team launched a patch release to address compatibility issues and facilitate wallet upgrades. Additionally, Project Catalyst continued its momentum by onboarding 300 approved projects, emphasizing community-led accountability and transparency.\n\nAs ADA continues to attract attention and investment, the Cardano ecosystem appears poised for further growth and advancement on the burgeoning cryptocurrency landscape."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxPZS0xbUJwN0JPWWp0ZDN0cm9LU2xEbk9tTEIxRTBNQlVnelpFWkVnUVdmM3Qtem5iOGZ0TVlKd0JtaFZHLVc5WUVBZE81SmdsY3FQQlBfUVRqZ253c21oVHRiRjNZcUFmT2dmdHV1UUVTZXNJbXNHeGZnUU9Mb1ZDQV9mQ0dkcDVjS3V2U09pN1ZhUk91RG5XZUtKRjJLX3dYMEdiZm1vcGU4Z9IBrwFBVV95cUxPM2EzZGZpSkFfY2pRNG1SbHVySlAwSTN6NXAxbTBzU0VFTm4zWnFGZTNzZ0hzV0htREhCa083YzRIbmhYUVNUSUhsM3lGdjFUUS1mNGpWYnlNVVd5dEFhTmhlZ2NKbzF4d1Fac3FmNldsVGhKYURNUFBZaTB5dmJzUFdxVjNEc2NTZjVWdnFzclpJUXJNcGdtRTA3bFhaTWxmTFo1bWVNbnhRcWVqNlow?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Mar 2024 08:00:00 GMT",
        "title": "Crypto Market Prediction for $10 Trillion: Bitcoin, Ethereum, Solana Poised to Explode? - Coinpedia Fintech News",
        "content": "Mustafa has been writing about Blockchain and crypto since many years. He has previous trading experience and has been working in the Fintech industry since 2017.\n\nStory Highlights Lark Davis predicts a massive market cap of $10 trillion for the cryptocurrency space.\n\nThis projection, if realized, would mark a historic moment for the industry, attracting substantial capital.\n\nWhile the prediction is optimistic, achieving a $10 trillion market cap would bring its own set of challenges.\n\nProminent crypto investor Lark Davis has stirred conversations with his audacious projection: a monumental $10 trillion market cap for the cryptocurrency space.\n\n10 Trillion dollar market, highly possible this cycle, equates to…\n\n\n\nBitcoin $250,000\n\nEthereum $15,000\n\nSolana $700 — Lark Davis (@TheCryptoLark) February 29, 2024\n\nLet’s delve into the figures and unravel the potential implications.\n\nCurrent Market Momentum\n\nPresently, the overall market cap of the cryptocurrency space has reached $2.4 trillion, showcasing a substantial rise from the $800 billion recorded at the start of the year.\n\nThis surge follows a period of recovery from a bear market, where Bitcoin, the flagship cryptocurrency, experienced a significant decline from its all-time high of $69,000 to a low of around $16,000.\n\nShould Davis’s foresight materialize, Bitcoin (BTC) is poised for an extraordinary surge from its current trading price of $61,500. This represents a potential increase of nearly 400%, reaching the projected price of $250,000. Achieving this valuation would necessitate a significant influx of capital into the Bitcoin market, currently valued at around $1.19 trillion.\n\nEthereum’s $15,000 Vision\n\nIn Davis’s forecast, Ethereum (ETH) is predicted to trade at around $15,000, signaling a substantial increase from its current value. Ethereum, with a current market cap of approximately $280 billion, would need considerable capital inflow to reach the projected price.\n\nThis surge would position Ethereum as a formidable player in the market, underlining its pivotal role in decentralized finance (DeFi) and smart contract technology.\n\nSolana Isn’t Far Behind Either!\n\nDavis’s projections extend to Solana (SOL), earmarked for a surge to $700. With Solana’s current market cap standing at approximately $23 billion, achieving the predicted price would involve heightened investor interest and significant capital injection. This potential surge positions Solana as a significant player in the blockchain ecosystem, contributing to the ongoing narrative of scalable and high-performance blockchain platforms.\n\nImplications of a $10 Trillion Market Cap\n\nBeyond the exciting projections lies the potential realization of a historic milestone—a $10 trillion market cap for the cryptocurrency space. This achievement would not only mark a significant moment in the industry’s history but also introduce new opportunities and challenges for market participants."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQQ2J4TmpQYWxUSkxUY2RfT0tYMFh1MjZnSWUyZTB3NzFuY2Vubng1MVpkUWdPYXFxQmlqcDgyRHhIc0dXTXBGOUU5U080cHhtSkowOUdSUFB3ZWRlanF0eVBUVmdxVTMxRGphOS1OUXVTUkZRMzNrN0hKRkVwaTFnQmw5aUgxR0xPcXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Mar 2024 08:00:00 GMT",
        "title": "Ethereum Deflationary Meme Coin, $PEPE, Surges Over 145% In 7 Days - NullTX",
        "content": "The Ethereum deflationary memecoin, $PEPE, has experienced a remarkable surge of over 145% in its price over the past seven days, capturing the attention of investors and enthusiasts alike.\n\nIn a recent development, a smart whale identified as 0x37d has made significant moves in the $PEPE market. The whale recently deposited a staggering 1.97 trillion $PEPE tokens, valued at $6.06 million, to Binance just a few hours ago.\n\nThis strategic move potentially positions the whale to capitalize on substantial gains, with an estimated profit of $3.47 million, representing a remarkable 135% increase if the tokens are indeed sold at current prices.\n\nAfter $PEPE reached new ATH, smart whale 0x37d deposited all 1.97T $PEPE ($6.06M) to #Binance ~7hrs ago, making $3.47M (+135%) if truly selling. Moreover, the whale withdrew 75.91B $SHIB ($893K) from #Binance for the first time ~1hr ago. Bullish for a $SHIB pump soon? 🤔 Follow… pic.twitter.com/dEX9SgQXrR — Spot On Chain (@spotonchain) February 29, 2024\n\nThe smart trader behind these transactions has been actively involved in the $PEPE market dynamics. Notably, the trader deposited 470 billion $PEPE tokens to Binance at a price of $0.000003007.\n\nThe cumulative deposits amounted to 1.97 trillion $PEPE tokens over the past few hours, with an average acquisition price of $0.000003073, translating to a substantial investment of $6.06 million.\n\nPepe Whale Address Reveals Further Movements And Holdings\n\nAnalysis of the whale’s portfolio reveals insights into past and current profit and loss scenarios.\n\nWhile the whale once realized an estimated profit of $614,000, representing a 21.9% increase from ETH holdings, current holdings in SAND and MANA indicate losses of $116,000 and $20,100, respectively, totaling $136,100.\n\nDespite the recent surge in $PEPE price, reaching a new all-time high of $0.000003524 nine hours ago, the market experienced a slight downturn of 3.38% in the past hour.\n\nThis decline may be attributed to the impact of the whale’s selling activity, reflecting the significant influence of large investors on market dynamics.\n\nAs $PEPE continues to capture attention within the crypto community, the actions of whales and traders play a pivotal role in shaping its market trajectory, driving speculation and interest among investors.\n\nDisclosure: This is not trading or investment advice. Always do your research before buying any cryptocurrency or investing in any services.\n\nFollow us on Twitter @nulltxnews to stay updated with the latest Crypto, NFT, AI, Cybersecurity, Distributed Computing, and Metaverse news!"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE9wamQxWndsUW54dXZ4VWxMc01US2paVm52VFlaUW5NOVRITnRyNkVOUGJhWHN0RzByNzZRTzRuMnRpZ3VINGdVWmM1N3Ewek5lOTFILUlRYW9RMUNsZFVwbWdEaklrdFdkaWxoa3FUVVhWYTRIOE9KUHFB0gF-QVVfeXFMUDItU1Vpd3RWclNVUVFmeGV2UnFpdTJVamFQQ3VCOFBzV3lLSmxrX1hwRHk4M2wzUmxxMndVZTJ6YnVnV1dXVFVYbjlRVFhSbFJyaTAta3hFTjVaM1ZnTlFScTljLXJrdHFEaHlna3NfTDhxTVAzdXVlMW51SFZR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Mar 2024 08:00:00 GMT",
        "title": "6 Best Crypto Wallets For Beginners in 2024 - CoinCodex",
        "content": "Choosing the right cryptocurrency wallet can be one of the most intimidating aspects of getting started with crypto. We’ll get you started off on the right foot by providing a list of the best crypto wallets for beginners.\n\nThe best crypto wallets for beginners\n\nWe’ve made sure to include a variety of wallets to provide options for every type of crypto investor, regardless of whether you’re a long-term holder or frequent user of crypto.\n\nLedger Nano S Plus - Best hardware crypto wallet for beginners\n\n- Best hardware crypto wallet for beginners Trust Wallet - Best software crypto wallet for beginners\n\n- Best software crypto wallet for beginners Coinbase Wallet - Best crypto wallet for Coinbase users\n\n- Best crypto wallet for Coinbase users MetaMask - Best Ethereum wallet overall\n\n- Best Ethereum wallet overall Electrum - Best Bitcoin wallet for desktop\n\n- Best Bitcoin wallet for desktop Phantom - Best Solana wallet for beginners\n\n1. Ledger Nano S Plus - Best hardware crypto wallet for beginners\n\nIf you’re approaching cryptocurrency with a long-term buy and hold strategy, you should strongly consider getting a hardware cryptocurrency wallet. A hardware cryptocurrency wallet is a secure device that stores the private keys necessary to access your cryptocurrency without exposing them to devices that could potentially be compromised (computers and phones that are connected to the internet).\n\nThe Ledger Nano S Plus is a hardware wallet that offers very strong security at a reasonable price of $79. This wallet is an upgraded version of the Ledger Nano S, which had established itself as the go-to hardware wallet for crypto investors worldwide.\n\nThis hardware wallet can be used to store more than 5,500 different cryptocurrencies. It implements advanced, independently audited security systems and works seamlessly with the Ledger Live software for easy portfolio and transaction management.\n\nGet a Ledger Nano S Plus\n\n2. Trust Wallet - Best software crypto wallet for beginners\n\nOne of the main reasons why we believe Trust Wallet is the best software crypto wallet for beginners is that it supports a diverse range of cryptocurrencies. This allows users to manage their cryptocurrency with one app instead of having to hop to a different app for each coin they hold.\n\nThe wallet is compatible with Bitcoin, Ethereum (including blockchains compatible with Ethereum's Virtual Machine), XRP, and various other well-known cryptocurrencies.\n\nTrust Wallet is user-friendly, featuring an interface that accommodates both novice and experienced crypto investors. It enables users to track the value of their crypto portfolio in their preferred currency, review their on-chain transaction history, and efficiently manage a variety of cryptocurrencies.\n\nIn addition, Trust Wallet includes a decentralized application (DApp) browser, which allows interaction with DApps through the wallet. Trust Wallet also has features for buying and selling cryptocurrencies, swapping tokens, and staking capabilities.\n\nGet Trust Wallet\n\n3. Coinbase Wallet - Best crypto wallet for Coinbase users\n\nCoinbase Wallet is a cryptocurrency wallet developed by the Coinbase cryptocurrency exchange. Coinbase Wallet is non-custodial, which means that the responsibility of managing private keys is completely up to the user.\n\nThis wallet supports multiple blockchains, including Bitcoin, Ethereum, Solana, XRP, Stellar, Litecoin and Dogecoin. In addition, Coinbase Wallet supports various Ethereum-based layer 2 networks and can also be used to store ERC-20 tokens.\n\nBeyond the basic features of holding and transacting cryptocurrency, Coinbase Wallet also offers some advanced features, such as the ability to make token swaps through decentralized exchanges directly from the wallet’s interface.\n\nIn addition to cryptocurrencies, Coinbase Wallet can also be used to manage and transact with NFTs.\n\nCoinbase Wallet is a great choice if your centralized exchange of choice is Coinbase. This is because the wallet can be linked with a Coinbase account for streamlined crypto transfers.\n\nGet Coinbase Wallet\n\n4. MetaMask - Best Ethereum wallet overall\n\nMetaMask is a wallet designed to work with Ethereum and other blockchains that are with the Ethereum Virtual Machine (EVM). It's available both as a web browser extension and a mobile application. MetaMask enjoys widespread adoption within the Ethereum ecosystem, with nearly all Ethereum-based decentralized applications (DApps) supporting it.\n\nMetaMask can of course be used to hold and transact with ETH and Ethereum-based tokens, but the wallet also offers features for buying, selling, and swapping crypto tokens directly on the blockchain. MetaMask also has a portfolio tracker which you can use to easily monitor the performance of your crypto holdings.\n\nMetaMask is a great choice for beginners, as well as advanced users who often interact with DeFi protocols or NFT marketplaces. It can function as a hot wallet for everyday use, but if you want to use it to manage larger amounts of crypto, we recommend you pair it with a hardware wallet like the Ledger Nano Plus for enhanced security. You can learn more about this topic in our article comparing hot wallets vs. cold wallets.\n\nGet MetaMask\n\n5. Electrum - Best Bitcoin wallet for desktop\n\nIf you are a Bitcoin holder and want a wallet for your desktop or Android device, Electrum is a great choice. This non-custodial wallet is easy to use for basic transactions, but also offers advanced features that will come in handy as you level up your knowledge of Bitcoin. For example, Electrum can be used as a multisig wallet, and it also supports third-party plugins.\n\nYou can use Electrum as a hot wallet for everyday Bitcoin transactions, but the wallet has also integrated support for hardware wallets from manufacturers such as Ledger and Trezor if you want to use it to manage more substantial transactions.\n\nA great thing about the Electrum wallet is that it connects to a decentralized server network, which means you’re not very likely to experience any issues with downtime. While it is a very solid wallet, Electrum is limited to Bitcoin, so you should look for alternatives if you also want to store other cryptocurrencies.\n\nGet Electrum Wallet\n\n6. Phantom - Best Solana wallet for beginners\n\nPhantom is a wallet that has become the go-to option for many Solana users. Since its launch, however, the Phantom team has expanded the scope of their wallet to also include support for the Bitcoin, Ethereum and Polygon blockchains.\n\nPhantom provides a slick user interface, strong support for NFTs, as well as built-in token swapping and staking features. The Phantom wallet is non-custodial and can be used in tandem with hardware wallets, which also makes it suitable for long-term crypto storage.\n\nThe Phantom wallet has a feature that detects when the user is about to approve a transaction that’s identified as potentially malicious. For example, the user might be connecting to a phishing website that’s designed to trick users into approving a transaction that drains their wallet.\n\nPhantom is available either as a mobile app on iOS and Android, or as a browser extension in Chrome, Firefox and other popular browsers.\n\nGet Phantom Wallet\n\nThe bottom line\n\nEven though the wallets we have featured in this article are suitable for beginners, they are all high-quality pieces of software that will serve you well even as you become a more advanced cryptocurrency user. When picking among these wallets, consider which cryptocurrencies you want to store and whether you want to use your wallet as a mobile app, desktop program or browser extension.\n\nAll of the wallets we have featured in this article are non-custodial, which means that the user has the sole responsibility of securing their private keys. This is great since you don’t have to trust any third parties to keep your crypto safe, but it also means you have to ensure to back up your recovery phrases and never share your private keys with anyone.\n\nIf you’re trying to learn more about everything you need to keep in mind when starting your crypto journey, make sure to take a look at our ultimate guide to investing in crypto."
    }
]