[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiYkFVX3lxTE5sdFp6UmR3TE1JRWRfR1p3TzgyYUtISVlvN2RvQWVzTlBlQjE2QlNJVjQybGZkcC16cVhIZldkamluN1FURU9rQzlGTXUzdi1aZ0VzTWF4YjYwZFJERl9kUnd3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 May 2024 07:00:00 GMT",
        "title": "What Is Ethereum And How Does It Work? - Bankrate.com",
        "content": "Advertiser Disclosure\n\nWe are an independent, advertising-supported comparison service. Our goal is to help you make smarter financial decisions by providing you with interactive tools and financial calculators, publishing original and objective content, by enabling you to conduct research and compare information for free - so that you can make financial decisions with confidence.\n\nOur articles, interactive tools, and hypothetical examples contain information to help you conduct research but are not intended to serve as investment advice, and we cannot guarantee that this information is applicable or accurate to your personal circumstances. Any estimates based on past performance do not a guarantee future performance, and prior to making any investment you should discuss your specific investment needs or seek advice from a qualified professional.\n\nHow We Make Money\n\nThe offers that appear on this site are from companies that compensate us. This compensation may impact how and where products appear on this site, including, for example, the order in which they may appear within the listing categories, except where prohibited by law for our mortgage, home equity and other home lending products. But this compensation does not influence the information we publish, or the reviews that you see on this site. We do not include the universe of companies or financial offers that may be available to you.\n\nEditorial disclosure\n\nAll reviews are prepared by our staff. Opinions expressed are solely those of the reviewer and have not been reviewed or approved by any advertiser. The information, including any rates, terms and fees associated with financial products, presented in the review is accurate as of the date of publication."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxOY3V1UU9IanBvLUdHNjFLRHROaVJ0MGVVeEs2LUZJaWVTNXhMN19kaGl4R3Z3RGlYMU5fWnhQTVZGaVdUWFJtVFZyZXRrZjhfdHNFa2xuRGpDNnV4ZlFTOW0talNmZkNxT2JiMXlydExQTDJ2c25yTkR2Vm5QNHVrcjBsem5fekloa2M3TkZrV1RDTndNOVNJ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 May 2024 07:00:00 GMT",
        "title": "SEC approval of Ether ETFs acknowledges Ether is a commodity - Ledger Insights",
        "content": "Yesterday the U.S. Securities and Exchange Commission (SEC) approved the listing of eight spot Ether ETFs in a bulk order. However, there is another formality before they can be sold to the public, which may take a few months. A key aspect of the order is that each ETF is considered a ‘Commodity-Based Trust Share’. Several years ago the SEC classified Ether as a commodity, but that changed over a year ago without any announcement. It concluded that Ether had become a security following the migration to Ethereum 2.0, which adopted Proof of Stake. This came to light due to Ethereum development house Consensys suing the SEC over claims that Ether is a security.\n\nTherefore, the ETF’s recognition of Ether as a commodity marks a significant reversal. There’s considerable debate about the reason for the abrupt shift. With Congress passing the FIT 21 crypto Bill this week with the backing of many Democrats, the politics around crypto is shifting. That’s particularly in the run up to an election where the Biden administration’s crypto stance might be viewed as a potential vote loser.\n\nInterestingly, the SEC Commissioners did not directly vote on the ETFs, unlike the Bitcoin ETFs. Instead, they delegated the authority to the Division of Trading and Markets. While delegation is a common practice, it’s notable that this decision would not have been made without the majority of the Commissioners’ approval, as highlighted by Bloomberg’s James Seyffart.\n\nThe eight ETFs are from Grayscale, Bitwise, BlackRock’s iShares, VanEck, ARK 21shares, Invesco Galaxy, Fidelity and Franklin Templeton.\n\nConsensys to continue its fight\n\nMeanwhile, Consensys has vowed to continue with its litigation against the SEC. “Today’s approval signals that the SEC views that ETH is a commodity and not a security – contrary to the position it continued to take prior to the events of this week, as described in our recent lawsuit against the SEC,” the company wrote on X. “We will continue to fight for definitive regulatory clarity in our case.”\n\nIt added, “this seemingly last minute approval is yet another example of the SEC’s troublesome ad hoc approach to digital assets.”\n\nIt’s not just the crypto community that’s been unhappy with the SEC. Both Congress and the Senate voted in favor of a resolution to overturn an SEC accounting bulletin (SAB 121) that effectively blocks banks from providing digital asset custody. It is the first digital assets-related law passed by both legislative branches, yet another sign of the changing political tide. However, the White House has vowed to veto it."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiZkFVX3lxTE9TRE1sUXl2TFRrZ3pST0NhNTFnSGJWekxkQ2ZVN2xnQVJ2MlcxeVJ4bEQwRGl3RTdVV19ZVXA3cTBNaHU5aG5MQWxpMXowVlVEZVdQM1FOZzVoNUFWWGgyYUhfeFhUUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 May 2024 07:00:00 GMT",
        "title": "Ethereum heats up over key ETF decision. Here's what you need to know. - Mashable",
        "content": "Ethereum, the nerdy cryptocurrency that was lately overshadowed by Bitcoin, is in the news again, and the price is pumping. What gives?\n\nWell, only one of the most important developments in Ethereum's history, anon. An Ethereum spot ETF (Exchange Traded-Fund) might get approved in the U.S. today — that's Thursday, May 23.\n\nUPDATE: May. 24, 2024, 11:51 a.m. CEST The first Ethereum ETFs indeed got the nod from regulators on Thursday, though there's more steps and hoops to jump through (see part on the S-1 form below) before they can actually start trading.\n\nBefore we get into all that, here's a very short primer on Ethereum or ETH. Launched in 2015 by programmer Vitalik Buterin and others, Ethereum is the second largest cryptocurrency by market cap, behind Bitcoin, and it has been so for the better part of the past five years or so.\n\nWhat is this Ethereum thing you speak of?\n\nEthereum is a very different beast from Bitcoin. The latter is a digital currency and a public ledger of transactions that uses a network of computers (miners) to securely verify every transaction in the system, as well as create new coins through a computing-intensive process called proof-of-work.\n\nEthereum is a blockchain platform for decentralized apps. Unlike Bitcoin, it uses proof-of-stake to power and secure the network, meaning there is no environmentally unfriendly mining, with validators using a stake of their ether or ETH (the underlying currency of the platform) to validate transactions. Also, unlike Bitcoin, which is all about the secure sending and receiving of bitcoins and fairly little else, Ethereum is a platform for other decentralized apps (also called smart contracts) to run on.\n\nAs you can imagine, this makes Ethereum more powerful than Bitcoin in a sense, but it also makes it more complicated, both in terms of usage and implications. These days, basically everyone — the likes of large banks and pensions funds included — understands Bitcoin to be a largely decentralized digital asset, which can be bought, securely stored and sold, akin to a digital version of gold. Ethereum is a lot more complicated, with the U.S. SEC (Securities and Exchange Commission) not being entirely clear on whether ETH is a security or not.\n\nAn ETH ETF is now a very real possibility\n\nThis leads us to the part about ETFs. In January 2024, after receiving the SEC's blessing, Bitcoin spot ETF funds started trading in the United States. This had immense implications as to who can buy Bitcoin; suddenly, a U.S. state pension fund or an investment fund was able to easily get exposure to Bitcoin without worrying about breaking some rule. And the \"spot\" part, in contrast to a futures ETF, means that the Bitcoin spot ETFs must buy actual Bitcoins when someone buys their product.\n\nMashable Light Speed Want more out-of-this world tech, space and science stories? Sign up for Mashable's weekly Light Speed newsletter. Loading... Sign Me Up By signing up you agree to our Terms of Use and Privacy Policy Thanks for signing up!\n\nThe interest was record-breaking, with more than $13 billion flowing into BTC via spot ETFs since their inception. And unsurprisingly, the price of Bitcoin soared from around $42,000 in early January to roughly $69,500 at writing time.\n\nMany of the same entities — large investment companies such as BlackRock, VanEck, and Ark — also filed for a spot Ethereum ETF, with deadlines for SEC's approval or denial starting on May 23. And up until a few days ago, analysts largely believed that the ETFs would be denied, given SEC's previous reluctance to provide clear guidance over whether ETH is a security or not.\n\nThis has changed. According to Bloomberg senior analyst Eric Balchunas, there was \"chatter\" that the SEC has completely reversed its stance on Ethereum, followed by a slew of potential ETF issuers submitting amended 19b-4 forms to the SEC, signaling that there's a very good chance that the ETFs are on their way for approval.\n\nWe know, the sheer mention of something like a 19b-4 form made you fall asleep instantly. But we mention it because there's another set of forms that need to be approved, the S-1 forms, and those are key for actual ETF approval.\n\nIn practice, this means we could get a very good indication that one or more (probably more) Ethereum ETFs are coming, but it might take weeks or months before they actually start trading.\n\nAs a result of these filings, the price of Ethereum rose from around $3,100 to $3,800, where it's trading at writing time.\n\nOf course, nothing is official or set in stone. The Ethereum ETF applications could still get denied, though the consensus among experts is that it's now a question of when, not if, it will happen. A denial would surely be a cold shower for Ethereum's price, at least in the short term.\n\nThis is one of the most important developments for crypto, period\n\nThis is not just about Ethereum's price. This sudden change of sentiment by the SEC could mean that the U.S. government is suddenly far more open to everything crypto related. Indeed, an important crypto bill was just passed by the U.S. House of Representatives, despite the SEC head Gary Gensler having some very stern words about it.\n\nPerhaps the simplest of implications of this approval is other crypto spot ETFs getting the nod in the future. But with BlackRock launching a tokenized version of its money-market fund on Ethereum, it's getting easy to envision a future in which a big chunk of global finance exists on the blockchain. In other words, your nerdy, crypto-mining neighbor who told you that one day all of finance will roll into crypto, may have actually been right.\n\nWhat now?\n\nWell, unless you're a trader looking to capitalize on price moves, you don't really have to do anything. Regardless of whether the Ethereum spot ETF is denied, approved, or delayed today, Ethereum and its ecosystem of apps will keep trudging along.\n\nBut it is important to consider that a potential approval fully legitimizes an entire new class of crypto assets. Institutions, funds, banks, perhaps even pension funds, will be looking to get in on the action, and it could spark a thriving period for Ethereum, as well as the apps and assets that reside on it. After a bit of a lull in the past couple of years, the crypto space could once again become very exciting over the next couple of years."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTE1XNlBzd2F6N3FxbHhjeDBjcUZkelY1eU8tN0NsTmk1YkJFcVB4OHk0S1d0c0RCOXlVNVdPNEJKd2dMZTExU0tuRXVKUUViOVZIRUxVUE9xd2pwTHR5aW5JWEtXbFFlTTBZRVVTTlp5ZEg1M0k?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 May 2024 07:00:00 GMT",
        "title": "SEC Sets the Stage For the Launch of Spot Ether ETFs - Investopedia",
        "content": "Update, May 23, 2024: This story has been updated with additional information about the approvals.\n\nKey Takeaways The Securities and Exchange Commission approved a rule change allowing for the listing and trading of eight spot Ether exchange-traded funds.\n\nThe approval doesn’t allow the ETFs to immediately begin trading, as the SEC will still need to review individual applications from asset managers for each of the eight ETFs that were given initial approval Thursday. That process could take several weeks.\n\nThis is a win for the crypto industry, which has been hoping for the approval of ether ETFs since a similar product for bitcoin was approved at the beginning of the year.\n\nThe Securities and Exchange Commission on Thursday approved applications for the listing of eight spot Ether (ETH) exchange-traded funds, though further approvals are necessary before you can start trading them.\n\n\n\nWhen Will Ether ETFs Begin Trading?\n\nAccording to a memo from the regulator, NYSE Arca has been authorized to list the Grayscale Ethereum Trust and the Bitwise Ethereum ETF; Nasdaq will list the iShares Ethereum Trust; and CBOE BZX will list the VanEck Ethereum Trust, the ARK 21Shares Ethereum ETF, the Invesco Galaxy Ethereum ETF, the Fidelity Ethereum Fund and the Franklin Ethereum ETF.\n\nVanEck immediately followed the SEC's announcement with an S-1 filing, indicating that their product was ready to launch. The S-1 approval process, in which regulators will look at the specific ETFs themselves, could take weeks but some analysts say that process may be fast-tracked.\n\nSEC Comes Around Despite Concerns\n\nConcerns around whether ether is a security and staking were two major reasons why the SEC was reluctant to give a green light to ether ETFs. While many market participants say today's decision indirectly implies ether is not a security, the issues around staking were resolved when ETF issuers removed it from their applications.\n\nSome analysts said the White House's softened stance on crypto helped move the SEC toward approval. Additionally, a bipartisan group of lawmakers urged the SEC to approve the ETFs in a letter to the regulators.\n\nSince the January approval of spot bitcoin (BTC), markets have closely watched the approval process for similar funds for the native cryptocurrency of the Ethereum network. That has created a runup in the second-largest cryptocurrency, which is up 60% year-to-date. Ether was up almost 2% on the day as the SEC made its announcement.\n\nCORRECTION: This article has been updated with the correct number of spot Ether ETFs that have been approved for listing."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTFBHcFo3c0NCRlJ5aDdfZmt4MjVmSkFFNjIwQWEzdG5uUXBZTkx2VHRDbktnNUNnZ2YwSUpRblM0Yi02MWFoVmF6a0wzaldFQW1xajNXMmdXRXNIT2tlZWRoaFpneHMwdlZVZ0xrbU1PWkF4MmlZS0NyeGx3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 May 2024 07:00:00 GMT",
        "title": "SEC engages with Ethereum ETF issuers on S-1 forms - Crypto Briefing",
        "content": "SEC may approve 19b-4 filings today and work on S-1 forms over the next few weeks.\n\nShare this article\n\nFox Business journalist Eleanor Terrett said on Thursday that the US Securities and Exchange Commission (SEC) started talks with Ethereum exchange-traded fund (ETF) issuers regarding their S-1 registration forms. She cited sources who said there is still “work to do” on those forms.\n\nThis could be seen as a positive development, but it suggests there might have been a previous delay in communication.\n\n🚨NEW: Hearing that conversations concerning the S-1’s have now started happening between @SECGov staff and issuers with the conclusion being that there’s “work to do” on those. — Eleanor Terrett (@EleanorTerrett) May 22, 2024\n\nIn a separate post, Terrett indicated the SEC might approve the 19b-4 filings today, followed by collaboration with issuers on S-1 forms in the coming weeks or months.\n\nCommenting on Terrett’s post, Bloomberg ETF analyst James Seyffart said with significant effort, S-1 applications for spot Ethereum ETFs could be resolved within a few weeks. However, he noted that the SEC may need additional time to complete the S-1 review process.\n\n“I think that if they work extremely hard it can be done within a couple weeks but there are plenty of examples of this process taking 3+ months historically,” Seyffart suggested.\n\nMost ETF issuers, including major players like Fidelity, Bitwise, Grayscale, VanEck, Ark 21Shares, Franklin Templeton, and Invesco, submitted their amended 19b-4 filings earlier this week. Nasdaq also refiled BlackRock’s proposed Ethereum ETF yesterday.\n\nThe clock ticks down as the market braces for the SEC’s verdict on spot Ethereum funds.\n\nBloomberg analyst Eric Balchunas suggests a timeframe of around 4:00 PM ET for the SEC’s announcement on the fate of these ETFs. The decision on spot Bitcoin ETFs previously arrived slightly earlier on the designated date.\n\nMy best guess is we hear from the SEC around 4pm tomorrow. For spot btc they dropped it at 3:45pm, some others in past were slightly after 4pm. Anything poss tho https://t.co/MzTOcsmTnJ — Eric Balchunas (@EricBalchunas) May 22, 2024\n\nMeanwhile, Ethereum’s price has surged 25% over the past seven days, trading at nearly $3,800 at press time, according to CoinGecko’s data.\n\nExperts expect that a potential spot Ethereum ETF approval could trigger a sharp price increase. However, whether Ethereum can replicate Bitcoin’s price action after the spot fund approval remains uncertain."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMingJBVV95cUxQVHFYLW9IU1NVOTdJM2pOOG5JVTBTSldyWXY4WVIybmZZeVBxMkRCajhlaFk1RDZabzdIS0FZRU5ET09uNDgxSHVma1p3YURHWTU2TXdEU0JnbWl0YkZPS0EtcmszU2RiN0xHTC1ZR2dWNkh5c01NZm9mRVc0d0dxS01wVGhnSG9PVFZON1puWUQwS1ZrS0p5TlBOR05OS0pqd2NuWEVHTjcyVmg4T3lJUVYtcnBMZXdpUHgzc1dHdzlwNndveGY0LTc3U1Q0XzVlOFpwY0JzZFhZS2xGSVNkTE1WWlZSZXNEUkxFYTRsU3RJcGZJeDhtYVJseVZXdjR4Rkk0T0ExRDgwbjhSVTdCWFhIdEJ1ODdfenRERGh3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 May 2024 07:00:00 GMT",
        "title": "“This is the Time to Get In ” – Bitcoin and Ethereum on the - GlobeNewswire",
        "content": "London, UK, May 24, 2024 (GLOBE NEWSWIRE) -- Bitcoin, Ethereum, and BlockDAG Network are all making significant moves in the market. This is what’s happening;\n\n\n\n\n\n\n\n\n\nBitcoin surged over $70,000 per BTC on Wednesday, nearing its all-time high of $73,500 reached last March. Meanwhile Ethereum has seen a 20% rise to nearly $4,000 per Ether, as the crypto market anticipates a pivotal vote in Washington.\n\nThe rally follows the U.S. Securities and Exchange Commission (SEC) requesting updates from entities applying to issue spot Ethereum exchange-traded funds (ETFs). Analysts foresee approval triggering a $4.2 trillion price surge, especially after the SEC's communication with potential fund managers, suggesting accelerated approval may be imminent.\n\nETF analysts have increased approval odds, citing the political climate and potential impact on Ethereum's value. The decision is expected this week on VanEck's and Ark/21 Shares' ETF applications, with analysts anticipating a significant market response akin to Bitcoin's ETF approval in January.\n\nThe potential approval of spot Ethereum ETFs is predicted to propel the Ethereum price to $8,000 by 2024 and $14,000 by 2025, impacting Bitcoin positively as well. With spot Bitcoin ETFs reporting record inflows and continued growth since their launch, analysts anticipate further market highs, aligning with projections of a $150,000 Bitcoin price by 2024 and $200,000 by 2025, amounting to a combined near-$4.2 trillion valuation for Bitcoin and Ethereum.\n\nIn the meantime, BlockDAG Network is revolutionizing the cryptocurrency landscape, emerging as the fastest-growing community in the crypto world and hosting the largest Initial Coin Offering (ICO) of 2024. With over 120,000 holders already on board, up $31 million in record time and a goal of $600 million within reach, BlockDAG is not just a network but a whole movement.\n\n\n\n\n\n\n\n\n\n\n\nBlockDAG Network stands out with its cutting-edge Directed Acyclic Graph (DAG) architecture, which allows it to achieve unmatched transaction speeds of 10 blocks per second. This high throughput positions BlockDAG as an ideal solution for both everyday transactions and institution-level decentralized finance (DeFi) protocols. The platform’s commitment to technological excellence ensures a seamless and efficient user experience.\n\nBlockDAG introduces a unique mining system designed to provide passive income opportunities. The newly launched X1 mobile miner allows users to mine cryptocurrencies on their smartphones without significant data or battery usage. This innovation means anyone can earn money virtually anywhere and everywhere, making mining more accessible and convenient than ever before.\n\nJoining the BlockDAG Network means becoming part of a vibrant, global community of enthusiasts dedicated to making this project the best in crypto-history. With tens of thousands of members, the community is the backbone of the project’s extreme success, driving innovation and growth through continuous engagement and collaboration.\n\nBlockDAG Network is on an ambitious journey to “the moon,” with every milestone bringing it closer to the ultimate goal of revolutionizing the digital space.\n\nThe BlockDAG presale is the fastest growing in crypto history, offering an unmatched opportunity to join a burgeoning journey. Expert analysts predict incredible potential for BlockDAG, with $BDAG tokens projected to reach $10 in 2025.\n\n\n\n\n\n\n\n\n\nIn the midst of Bitcoin and Ethereum's market surge, BlockDAG Network emerges as the fastest-growing community and the largest ICO of 2024.\n\nAnalysts project BlockDAG's $BDAG token to reach $10 by 2025 from its current $0.0085 price, marking an unprecedented rise. As the BlockDAG presale gains momentum and rises upwards from the $31 million already raised, it's clear: in this time BlockDAG Network will redefine the future of cryptocurrency.\n\nRead About BlockDAG Presale:\n\nWebsite: https://blockdag.network\n\nPresale: https://purchase.blockdag.network\n\nTelegram:https://t.me/blockDAGnetworkOfficial\n\nDiscord: https://discord.gg/Q7BxghMVyu\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\n\n\n\n\n\n\n"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxOa1dyX1ExTThFWmV5Nm1GMUhxU3dKd3dndEFFUFp1dDhzaTVOc2FtMGF2dFpOUUstUnBZN3F4RFREdVNSQlp1eWlvYkk2dFlwVnJVbUZJeEJtV2tvM0JhblRSLTc2SmpXWmhhWFpiMGdhX3htWklFSjc2UEhnVlhZbU9nRDI0LVhSS0R4bXdGWWF6Y1d5aFI3LUt5T1B1Nlgwb0M1NjluR0YzUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 May 2024 07:00:00 GMT",
        "title": "Is Ethereum a security or commodity? Why does it matter and will an ETF change this? - CryptoSlate",
        "content": "The ongoing debate over Ethereum’s classification in the United States is garnering significant attention at the moment due to actions by the SEC and a possible ETF approval. The distinction between commodities and securities holds substantial implications for the regulation and future of crypto. If Ethereum were officially recognized as a commodity, the crypto landscape could witness transformative shifts in regulatory oversight, market participation, and investment vehicles.\n\nCommodity vs security definitions\n\nIn the US, a commodity is generally defined as a basic good used in commerce that is interchangeable with other goods of the same type. This category includes items like gold, oil, and agricultural products. The Commodity Futures Trading Commission (CFTC) regulates commodities, focusing on market stability and fraud prevention. Conversely, a security represents an ownership position in a publicly traded corporation via stock, a creditor relationship with a governmental body or a corporation via bond, or rights to ownership as represented by an option. The Securities and Exchange Commission (SEC) oversees securities, emphasizing investor protection and disclosure requirements.\n\nEthereum’s classification has been a contentious issue. In 2018, the CFTC asserted jurisdiction over Bitcoin and other virtual currencies, classifying them as commodities. The SEC, however, has historically been more cautious. In 2018, SEC Director William Hinman suggested that Ethereum, which had initially been funded through an Initial Coin Offering (ICO), might not be a security due to its decentralized nature. Despite this, the lack of a definitive classification has left Ethereum in a regulatory gray area.\n\nHow would classifying Ethereum a commodity change things?\n\nThe potential recognition of Ethereum as a commodity would have several implications. Firstly, it would place Ethereum under the purview of the CFTC, which could lead to more consistent regulatory guidelines. This shift could reduce the regulatory uncertainty that currently hampers some institutional investors, thereby encouraging broader participation in the Ethereum market. Moreover, it could pave the way for new financial products, such as Ethereum futures and options, thereby enhancing market liquidity and stability.\n\nA significant development that could influence Ethereum’s classification is the approval of an Ethereum Exchange-Traded Fund (ETF). ETFs are investment funds traded on stock exchanges, much like stocks. They hold assets such as stocks, commodities, or bonds and typically operate with an arbitrage mechanism designed to keep trading close to its net asset value, though deviations can occasionally occur. In the context of Ethereum, an ETF would provide a regulated and familiar investment vehicle for institutional and retail investors alike. The approval of Bitcoin ETFs in the US has already set a precedent as it is designated a commodity ETF.\n\nThe approval of an Ethereum ETF could bolster arguments for its classification as a commodity. The successful launch of a Bitcoin ETF has demonstrated to regulators that digital assets can be integrated into traditional financial systems in a regulated and secure manner. An Ethereum ETF would likely undergo rigorous scrutiny, ensuring that all compliance and security measures are in place. This process could further validate Ethereum’s status as a commodity by showcasing its stability and maturity as an asset class.\n\nRecognizing Ethereum as a commodity would not only clarify its regulatory status but also enhance its appeal to a broader range of investors. Institutional interest in crypto is growing, driven by the desire for portfolio diversification and hedging against inflation. Clear regulatory guidelines would mitigate the risks associated with regulatory uncertainty, making Ethereum a more attractive investment.\n\nAdditionally, this recognition could spur innovation within the Ethereum ecosystem. With regulatory clarity, developers and businesses could engage in more ambitious projects without the fear of unexpected legal repercussions. This could accelerate the development of decentralized applications (dApps) and smart contracts, further solidifying Ethereum’s role in the broader digital economy.\n\nUltimately, the official recognition of Ethereum as a commodity would mark a pivotal moment for the crypto industry. It would streamline regulatory oversight, enhance market participation, and foster innovation. The potential approval of an Ethereum ETF could play a crucial role in this process, demonstrating Ethereum’s viability as a stable and mature asset. However, it would not be an official settle the debate regarding Ethereum being a commodity unless additional specific classifications were issued by the SEC."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE9aRmFuSUJUb3h4dnQ5QXExMm5EUXFIZ2ZFRFlfeUZrZHpRMlR2R1JhSko2dVdUejJKTXpZUzJyOVNDZjdXRE1mcnpnT0tmZlBrcWphSFNKeWxXQ01jcHJ4SVRyRXdWOW5sT1RGbmtfNDhLVm56NUE2LQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 May 2024 07:00:00 GMT",
        "title": "Ethereum ETFs are the wrong solution to the right problem - Blockworks",
        "content": "Numbers don’t lie — spot bitcoin exchange-traded funds (ETFs) have been a boon for the market. The first day of trading in the US saw over $4.6 billion in volume. Within a month, bitcoin rose above $50,000 for the first time since the bear market and hit $70,000 in March for the first time ever.\n\nBut this bitcoin ETF liquidity boost does not address any of the underlying issues in today’s crypto user experience, nor does it offer investors empowerment through self-custody.\n\nIn the case of ethereum ETFs, the outcome will likely be the same. Rather than rely on regulatory approval of such financial products to welcome traditional investors onboard, our industry needs to reimagine how we approach digital asset management so that users don’t need to choose between convenience and financial freedom.\n\nWhat interest in ETFs really tell us\n\nThe appeal of ETFs is exposure to the crypto market without the hassle of digital asset custody. With over 900,000 ETH forever lost due to user error, it’s understandable that investors would look for easier ways to tap into the value created in this space.\n\nBut using old-world instruments to address crypto’s user experience challenges goes against what this industry set out to do — transform existing financial infrastructure to empower the little guy.\n\nAfter years of being looked down on by Wall Street, ETFs are tacit acknowledgments by traditional investors that the crypto sector is something worth opening the floodgates of retail and non-crypto money into. Supposing that ethereum ETF approval generates further interest in the crypto space — be that bullish interest from Larry Fink at BlackRock, opposition from ECB director generals, or just curiosity from the trainer at my local gym — the opportunity lies in shepherding these new investors toward full ownership of their assets.\n\nThe ETF wrapper is one means of entry into crypto as an asset, but removing the wrapper brings us to the real treat — true ownership.\n\nNewfound industry attention, now to trust ourselves\n\nWhy should individuals care about self-custody and financial freedom? While the answer may be obvious to those deeply embedded in the crypto community, trusting traditional banks is the norm, and the convenience brought by these institutions outweighs the risks of crypto for many individuals.\n\nWhen the Bitcoin white paper was published 15 years ago, the manifesto envisioned a peer-to-peer network without financial intermediaries. Ethereum then brought new functionality to the digital asset space and created the foundation for DeFi innovation. For the first time, individuals could harness digital ownership and exchange assets globally online while preserving personal privacy and autonomy.\n\nRead more from our opinion section: BlackRock and other bitcoin ETFs rob bitcoin of its room to grow\n\nThe challenge now is to get people of all investment experience and levels involved directly through self-custody of their assets. Products like ETFs, which mirror instruments in the traditional finance space, may have a positive market impact. However, they do not push individuals to reconsider traditional financial hierarchies and take ownership into their own hands. Only by directly engaging in self-custody platforms will we see crypto values influence mainstream audiences.\n\nWe’re only as good as our infrastructure\n\nSelf-custody is important, but how are we going to convince the next billion users to value freedom over convenience? It’s obvious that seed phrases and hardware wallets are not going to unlock digital ownership for mainstream users. In a time where payments can be made with a tap of a phone or a watch, the crypto industry needs usable features to appeal to traditional investors and everyday users.\n\nThat’s why Vitalik and other leaders in the Ethereum space are calling for a transition to smart accounts. By abstracting away the complexities of digital asset management, smart accounts enable features like crypto recovery, self-custodial debit cards and email login. In addition to smart accounts, improvements in scaling tools like zero-knowledge (zk) rollups have increased the capacity and throughput of DeFi applications, overcoming bottlenecks and preparing the industry for mainstream adoption.\n\nBetter features and scalability have paved the way for new use cases in crypto. Self-custody is no longer limited to individual asset management. With multi-signature accounts, for example, organizations and businesses can co-manage assets with ease. Further, developments in zk have reduced transaction fees, making it feasible for projects to facilitate large batches of transactions cost-effectively.\n\nThe crypto industry needs to continue building momentum\n\nBitcoin and ethereum ETFs have captured the zeitgeist, and now the crypto industry needs to capitalize on the mindshare introduced by this regulatory milestone. In the same way that football’s popularity grew in my German hometown in the aftermath of Germany’s 2014 FIFA World Cup victory, this newfound interest among conventional investors allows us to push self-custody to the forefront and showcase the opportunities unlocked by digital ownership.\n\nETFs encourage adoption; true crypto ownership encourages autonomy. Simplifying crypto user experience should be championed above simple ETF wrappers and commodity baskets. Bolstered with new liquidity, the industry needs to use this pivotal moment as a catalyst to revamp user experience across the board. Improving crypto-native platforms progresses the movement for digital ownership, which will outlast any market trends in the coming years.\n\nJulian Grigo is the Head of Institutions at Safe. Before joining Safe, Julian led the Digital Assets Business Unit at Solaris. As Head of Digital Banking at Bitkom, Julian contributed to the publication of a whitepaper on Decentralized Finance and provided industry insight in the German Parliament on crypto regulation.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE1yaUF5bjh3VXJJbDcwYWFDQzZlX0Y1TDlzYnhDaFplVmtYbjBQc3JFaG5FTzVWWUtqYnBiQnFNaXRDbW1PRmgwdHhTYWtWdG14UDdpbGV0N0phZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 May 2024 07:00:00 GMT",
        "title": "Ethereum price crash attributed to MEV manipulation: Report - Crypto Briefing",
        "content": "Ethereum drops nearly 5% in an hour, suspected MEV manipulation by Symbolic Capital Partners.\n\nShare this article\n\nEthereum (ETH) faced a nearly 5% crash in one hour this Thursday, despite the anticipation around the approval of spot Ethereum exchange-traded funds (ETFs) in the US. The X user identified as ai_9684xtpa pointed out that this was likely a market manipulation movement by the trading firm Symbolic Capital Partners.\n\n“The agency sold 6,968 ETH in one minute at 20:56, worth $27.38 million, with an average selling price of $3,930; one transaction sold 3,497 ETH on the chain at one time, and the bribe cost was as high as 90 ETH,” explained ai_9684xtpa.\n\nSuch transactions are known as MEV, short for “maximal extractable value,” which consists of using on-chain resources to profit. The payment of 90 ETH suggests a hurry to sell the position at a higher price to make it crash, possibly to buy it again at a lower price.\n\nETH price fluctuation after Symbolic’s transaction. Image: CoinGecko\n\nSince the crash, Ethereum has ranged in and out of the $3,800 price level and is priced at $3,803.37 at the time of writing, nearly 22% away from its previous all-time high.\n\n“It’s happening”\n\nAs shared by Bloomberg ETF analyst James Seyffart, an approval of spot Ethereum ETFs is happening this Thursday. Despite the low odds given to this scenario until last Monday, Seyffart and his fellow Bloomberg analyst Eric Balchunas boosted the chances to 75% after the SEC started contacting the issuers.\n\nSince then, various asset management firms presented amends to their 19b-4 filings, and VanEck’s Ethereum spot ETF even got listed on DTCC under the ticker $ETHV. The first final deadline is today, as the US regulator must decide on VanEck’s application.\n\nMoreover, according to Balchunas, the SEC’s decision on spot Ethereum ETFs might come at 4 pm (EST). Although a positive outcome is expected, it doesn’t mean immediate permission for trading."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNTDliYkhySmlnWWwtVzY2bkVQZVFmVHBOdzJfYVppb3VQX29qVXBXOFNXTjQ2NktwNTBFYzYxRFRnYktGZ2hjaUxVSUFLeTloNjJmYmJuLTl1MUtJSWVEWjgwYUZ5YjEwRFVxRU5aUVlZRGROV2hpUlQyRFU1RXVqNHZYQnhnTlBYalNVUzZFRTAyOXFLbXZBVtIBngFBVV95cUxQbDlHdG5HdXUtZUtvbVJUWFI2R0Q0MW5oX3BSMzdMaFRPNFVMUWpVWVQ4b0N5d0FORGpoWDhqcktKODZEdGRydnZWcWExYUQ3MFNOSXhwb0lETm1lUVpiM000RlJQVWJ2LW1HWXdFS0ZFMF9qd0tFcW55N0FRaVVyLUhIYmxjOHFZM3ZkazlDM0xTOFk0Vy1NN2F3YlhCdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 May 2024 07:00:00 GMT",
        "title": "SEC approves rule change to allow creation of ether ETFs - CNBC",
        "content": "A representation of cryptocurrency Ethereum is placed on a PC motherboard in this illustration taken on June 16, 2023.\n\nThe SEC has approved a rule change Thursday that would pave the way for ETFs that buy and hold ether , one of the world's largest cryptocurrencies.\n\nThe decision comes less than six months after the Securities and Exchange Commission approved bitcoin ETFs. Those funds have proven to be a big success for the industry, with net inflows already surpassing $12 billion, according to FactSet.\n\nLate May had long been pegged as a potential decision date for the ether funds since it coincided with a deadline for the SEC to decide whether the VanEck Ethereum ETF could proceed.\n\nMany of the companies that sponsor bitcoin ETFs — including BlackRock, Bitwise and Galaxy Digital — have also started the process of the launching an ether fund.\n\nThe price of ether rose just 2%, although it follows a 20% surge from earlier in the week in anticipation of Thursday's decision. Some investors may also be on pause, as the SEC's rule change approval does not guarantee that all the funds will launch.\n\nSpecifically, the SEC's order approves applications from various exchanges to list eight different ether funds. The order technically does not approve the funds themselves or set a date for the ETFs to begin trading.\n\nEther ETFs are expected to be smaller, at least initially, than their bitcoin counterparts. The Grayscale Ethereum Trust currently has about $11 billion in assets, much smaller than what the firm's bitcoin fund was before its conversion.\n\nThe approval of the ether ETFs is a sign that the SEC's stance toward crypto may be softening after a series of legal fights. The agency lost a lawsuit against Grayscale in 2023 that spurred the approval for the bitcoin products.\n\nThe SEC's push to regulate crypto has also come under scrutiny by politicians. The Senate last week passed a resolution to withdraw an SEC staff bulletin about accounting rules for digital assets.\n\nEther is the second largest crypto asset and has become something of a blue chip coin along with bitcoin, although its value proposition is distinctly different. While bitcoin is seen primarily as a long-term store of value, an investment in ether is considered more akin to an investment in early stage technology. The ether token fuels the Ethereum network, which powers different applications, like decentralized finance (DeFi) projects, nonfungible tokens (NFTs) or the tokenization of real world assets like commodities, securities, art, real estate and more.\n\nThe applications approved Thursday do not apply to other crypto projects on the Ethereum network, said Richard Kerr, a partner in the law firm K&L Gates.\n\n\"If and when an ether product is approved, it won't mean that a similar product for other digital assets on the Ethereum platform would be approved,\" Kerr said.\n\nEthereum also provides opportunities for staking, which is a way for investors to earn interest on their ether holdings by locking up tokens on the network for a period of time — although ether ETFs in the U.S. may not participate. The SEC has alleged in lawsuits against Coinbase and Kraken that staking-as-a-service offerings are unregistered securities. Ark, Fidelity and Grayscale updated their filings this month to remove staking from their proposals.\n\nThe lack of staking in the ETF products is another reason why ether ETFs may see less demand than their bitcoin counterparts, said Steven Lubka, managing director at Swan Bitcoin and head of Swan Private.\n\n\"These numbers are not going to match the bitcoin ETF inflows, and there are some structural differences in the product that just make it less attractive overall,\" Lubka said."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxQV19Fek5TbDBsMmctTHNSWk5FSWhJVU5wQ2F6RFFYRHJ5V1p3T2NteXJTcXB6V0dCbkFiM1hTSGFBUGNMNzNlUXc2MjdkSzR2TVgtcHJmNjIxYVRTdjh2S1pYdGIxTThjNVBmeXJwTjNSR2JuZEpTeDVrZXFYQloxMjJ4Rm5CM0U?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 May 2024 07:00:00 GMT",
        "title": "Ethereum ETF Decision Recalls Spot Bitcoin Launch - Yahoo Finance",
        "content": "Cryptocurrency\n\nRemember the spot bitcoin ETF launch?\n\nAs the spot Ethereum ETF approval drama unfolds, investors and exchange-traded fund industry observers can recall parallels between this case and events leading to the eventual approval and unveiling of spot bitcoin ETFs.\n\nIn both cases, the Securities and Exchange Commission (SEC) initially exhibited caution toward approving spot ETFs for these cryptocurrencies. However, pressure from various stakeholders, including issuers, investors and the maturing crypto market, spurred a potential shift toward approval.\n\nBoth decisions reflect growing recognition of the maturing cryptocurrency market and rapidly increasing institutional interest in these assets.\n\nThe presence of spot bitcoin ETFs and the potential approval of an ether-based ETF suggest the SEC is considering the growing demand from investors for regulated ways to gain exposure to these cryptocurrencies.\n\nA key difference between the two cases is that the Ethereum ETF approval process may be faster than bitcoin's due to the legal precedent set by the August 2023 Grayscale court case, which effectively reversed the SEC’s initial rejection of the asset manager's spot bitcoin ETF application.\n\nBoth cases highlight the complex path to approval and greater receptivity toward well-structured spot cryptocurrency ETFs.\n\nIs a Dogecoin ETF Next?\n\nIn the first two days of trading this week, the popular cryptocurrency Dogecoin (DOGE) jumped 9% as investors began to speculate that the largest meme coin by market cap could be the next for a spot ETF approval.\n\nCrypto trader Andrew Kang tweeted to his 244,000 followers on X Tuesday, “the odds for a DOGE ETF look brighter than ever.”\n\nWhile speculation over more spot ETFs is not surprising, it would be surprising if a spot DOGE ETF was next in line.\n\nCryptocurrencies with clear and demonstrably valuable use cases beyond speculation might be viewed more favorably. Additionally, a well-developed ecosystem with robust infrastructure for secure storage and transactions could be a plus. Widespread acceptance, measured by larger market capitalization (total value of all outstanding coins) and higher trading volume (liquidity) may also be considerations.\n\nFor example, there are five cryptocurrencies other than Bitcoin and ether that have larger market caps than Dogecoin, according to data from CoiMnarketCap.com.\n\nBehind Bitcoin and Ethereum, these are the largest cryptocurrencies on the market:\n\nTether USDt (USDT): This stablecoin, with a market cap of roughly $111 billion, is pegged to the U.S. dollar and is a popular choice for investors seeking stability within the crypto market.\n\nBNB (BNB): The native coin of the Binance ecosystem, BNB, has a market cap of around $91 billion and is used for various purposes within the Binance exchange and its blockchain applications.\n\nSolana (SOL): Solana, known for its fast transaction processing speeds, currently has a market cap of approximately $80 billion.\n\nStory continues\n\nOverall, the spot Bitcoin ETF launches and increasingly likely spot Ethereum approvals are positive developments, but they don't guarantee a flood of spot ETFs for more cryptocurrencies. The SEC will likely continue cautiously, prioritizing established cryptocurrencies with well-structured ETF proposals.\n\n\n\n\n\nPermalink | © Copyright 2024 etf.com. All rights reserved"
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxOOHpJQ2xXYndEMnBXR0lGSVAzQUhQb1VIbzFsR0p2TE44NzZza2FOMmpMVzdGWm1lT2R6ZkkwUzgzbWxxejZEcWh4VGUxZU9wX2RCRkpnN1RMRFY5ZGtONHFvRGRsRmlEdmRhMnpkc0N3LVppamNBUGJSOU1mbzR4RTZqaGstUXVuMXBSX29EMk9HSm4yZDhOWkJfcV9qZlFkLVBz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 May 2024 07:00:00 GMT",
        "title": "With Ethereum ETFs poised to rock the US market, Europe asks ‘what took you so long?’ - DLNews",
        "content": "Europe has many crypto exchange-traded products on the market.\n\nThe UK launched an Ethereum ETP this week.\n\nEuropean investors aren’t that interested in crypto ETPs.\n\nIn the US, the crypto industry is buzzing in anticipation ahead of an expected approval of spot Ethereum exchange-traded funds.\n\nBut nations across the Atlantic are already miles ahead with similar crypto investment products.\n\nThe London Stock Exchange, for one, will begin handling Bitcoin and Ethereum exchange-traded products for the first time by the end of May.\n\nNumerous ETPs\n\nAnd in Europe, there are already multiple Ethereum financial products, or ETPs, on the market. They include exchange-traded notes and exchange-traded commodities, which operate in similar ways to ETFs.\n\nBut the products, which have been on the market for years, haven’t caught much steam. That’s because Europeans are less keen on risky investments and prefer stability, experts say.\n\n“If we’re talking about where’s the alpha going to come from, it’ll be the place with the deeper capital markets and more eager investor base driving the inflows to push these things upward,” Erwin Voloder, head of policy at the European Blockchain Association, told DL News.\n\nDigital asset investment firm 21Shares launched its Ethereum Staking ETP in 2019, and Ethereum ETPs from VanEck and CoinShares made their debutsin 2021.\n\nBut inflows are relatively small.\n\nJoin the community to get our latest stories and updates\n\nThe 21Shares’ Ethereum ETP has over $307 million assets under management, and VanEck’s has a total net assets of $175 million.\n\nMeanwhile, in the US, institutional investors are already prepared to pour $500 million into Ethereum ETFs over the next week if they are approved, according to an analysis by the OKX exchange.\n\nEnthusiasm in the US\n\nThe products follow the price of Ether and allow investors a way into crypto through a bank or investment firm without having to open a crypto wallet or an account with a crypto platform.\n\nFor proponents, crypto ETFs and ETPs provide digital assets with validation and a bridge to broader financial markets.\n\nThe US Securities and Exchange Commission approved 11 Bitcoin spot ETFs in January. The two biggest funds, launched by BlackRock and Fidelity Investments, have vacuumed up more than $30 billion between the two of them as of Thursday.\n\nBut there are stark differences between Europe and the US.\n\nEurope has “more of an ecosystemic approach” to innovative finance, according to Voloder.\n\nWith legal frameworks for crypto assets starting to come into effect this year and other investment guidelines from regulators, lawmaking sets the foundations.\n\n‘Even if Europe has the regulations, our investor base has always lagged behind America.’ — Erwin Voloder\n\n“EU regulators are more proactive and US regulators are more reactive which is why you see broker dealers launching digital asset structured products in Europe,” Voloder said.\n\n“Regulations enable innovation and experimentation,” he added. This is what allows financial institutions to test tokenised financial instruments.\n\nBut still the size of the capital markets is reflected by that underlying divergence.\n\n“Even if Europe has the regulations to enable innovation, our investor base has always lagged behind America,” Voloder said.\n\nCrypto ETPs beyond Ethereum\n\nCardano Staking ETP by Liqwid began trading on Deutsche Börse exchange group on Wednesday. The product is domiciled in Switzerland.\n\n“Switzerland is at the forefront, as staking is regulated here, allowing us to build products incorporating staking—something not yet possible in the US,” Florian Volery, co-founder of Liqwid Finance, told DL News in an email. He is hopeful that the US will eventually catch up.\n\nThe DeFi entrepreneur expects to see actively managed ETFs that include other crypto assets like Bitcoin or Solana in an investment strategy.\n\n“This development is a game changer for the crypto industry, making it mainstream and a dedicated investment category within the asset and wealth management industry,” Volery said.\n\nInbar Preiss is a Regulation Correspondent at DL News. Contact her at inbar@dlnews.com."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTFB6LXkyTkoyd3M0SVdfVGVqVTdKc1lLclplVzJzZS15QXhNVnlvQ1A4bzd6MFdzNU5NRzJMQ1NPekJKbGJtTFdVNzR4QlNCeEJOdzJxYkZRaVBtZkRnaFFaMUt5QU44ckFtU3ZCaUg2Ym9nQnM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 May 2024 07:00:00 GMT",
        "title": "Buterin's Ethereum Transfer Sparks Crypto Frenzy: $300K Surge For Privacy Shield - TronWeekly",
        "content": "Vitalik Buterin, cofounder of Ethereum, made a notable move in the cryptocurrency space today by transferring 80 ETH, valued at approximately $300,000, to the privacy-focused coin mixer Railgun. This transaction marks the latest in a series of monthly transfers Buterin has made to Railgun over the past six months.\n\nRailgun, renowned within the crypto community for its robust privacy protocols, offers coin mixing services designed to protect user anonymity and prevent malicious activities. Buterin has been an outspoken advocate for Railgun’s privacy pools protocol, which he argues significantly bolsters user privacy by complicating efforts to trace transactions back to their origin. “Privacy is normal,” Buterin has previously stated, underscoring the critical role of privacy in cryptocurrency transactions.\n\nThe privacy pools protocol employed by Railgun uses advanced cryptographic techniques to ensure transactional anonymity, addressing mounting concerns about privacy breaches in the crypto ecosystem. This innovative approach has made Railgun a favored platform for users seeking heightened security and confidentiality in their crypto dealings.\n\nEthereum Navigates Privacy Imperatives\n\nButerin’s consistent use of Railgun reflects a broader industry trend towards prioritizing privacy in cryptocurrency transactions. As regulatory scrutiny of cryptocurrencies intensifies globally, platforms like Railgun, which emphasize privacy, are increasingly viewed as essential for maintaining transactional confidentiality while complying with regulatory requirements. This trend is particularly significant for Ethereum, which continues to see growing adoption and an evolving regulatory landscape.\n\nThe timing of Buterin’s latest transfer coincides with a bullish phase for Ethereum’s market performance. Recent data shows ETH trading at $3,740, a 2.06% increase over the past 24 hours and a significant 29% rise over the past week. This surge in Ethereum’s price is fueled by community anticipation around potential approvals of spot Ethereum ETFs by the U.S. Securities and Exchange Commission (SEC).\n\nButerin’s strategic move underscores the importance of privacy-focused solutions like Railgun in the rapidly evolving cryptocurrency market. As Ethereum continues to gain traction and regulatory landscapes shift, the role of platforms like Railgun in safeguarding user privacy is set to become increasingly vital."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxNaF82d0pYUlA3X0Z3c0dfTGloUm5YTVFtUDN4bjBuM2NTbWVZSmRHV0hqMTRyOU9lU2U0NWFQMkpoTnc4THNJX2FkaG52YTJndFRyNWxmVGxyRVZvaUpqNmxHWFhhaWtvRno2b21naWtTRlFueWJFYTdLZEpmNGtmMFhPXzNiUktLbWVUbWpYTElMUVJpWktuUG9nY3JHWHhyTDk3cThxN1lVcW82V3ZZTlREbw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 May 2024 07:00:00 GMT",
        "title": "Ethereum’s powerful new ‘EigenLayer’ promises a wave of innovation. But is it a threat to the blockchain? - Fortune",
        "content": "Ethereum has spent the current bull market living in the shadow of Bitcoin, but two recent developments could thrust the world’s second-biggest blockchain back into the spotlight. The first is the Securities and Exchange Commission’s surprise move to greenlight Ethereum ETFs. The second is a popular but divisive new investing feature called EigenLayer, which has received $100 million in backing from Andreessen Horowitz (a16z) Crypto.\n\nEigenLayer is a new protocol, or set of instructions, that sits atop the main Ethereum blockchain. It offers a way for those who have already invested tokens by means of staking—a blockchain feature that rewards those who lock up their tokens to secure the network—the ability to “restake” those tokens. The term is what it sounds like. By restaking, users take Ethereum tokens they have already invested and then invest them again. But instead of receiving a reward from the Ethereum network, as happens with staking, those who restake get paid by other projects piggybacking off the blockchain’s existing security pool.\n\nRestaking has existed for some time but EigenLayer is seeking to turbocharge the process by adding a lot more participants. The protocol aspires to be something akin to an Amazon Web Services for cryptoeconomic security.\n\nThe implications of this are “profound,” a16z wrote in a blog post about the company, noting that EigenLayer has the potential to accelerate innovation on Ethereum “100x faster.” While this appears to be a promising development for the blockchain, EigenLayer has yet to be tested at scale. And while it could result in a burst of innovation for Ethereum, some point to a major potential drawback: a new concentration of risk that, in a worst-case scenario, could harm both users and the broader blockchain ecosystem. Should Ethereum users view EigenLayer with excitement, fear, or both?\n\n‘Opens up a wormhole’\n\nThe arrival of EigenLayer is a boon both to investors, who can now more easily earn an additional slice of yield, and for developers who can more quickly add a trust layer in the form of collateral. The issue, however, is that using the same pool of collateral to secure multiple aspects of the blockchain creates new vulnerabilities.\n\n“It opens up a wormhole,” Rushi Manche, cofounder of Ethereum layer 2 Movement Labs, told Fortune. Manche raised a troubling hypothetical posed by EigenLayer critics: What happens if there’s a hack or a bug in the restaking smart contract? How does that affect the wider ecosystem which is also relying on this single deposit?\n\nAt the same time, Manche noted that proponents say “an entire new design space has opened up” for developers thanks to EigenLayer, allowing the same asset to be stretched much further and achieve much more. From this view, the rewards far outweigh the risk. It’s also worth considering the drawbacks if tools like EigenLayer are not available.\n\nSpecifically, in the absence of restaking, decentralized applications built on top of Ethereum must create their own proof-of-stake token—a high bar of entry for any startup. With restaking, protocols can dip into the main blockchain’s almost $95 billion of staked Ether for security. To revisit the cloud computing analogy: If hackers want to attack small businesses, they have to get past the likes of Google Cloud or AWS on which those businesses rely. EigenLayer proponents make the same case: Hackers need to get past a security system created by Ethereum, which has worth more than triple the market cap of Nike.\n\nBut, what happens when the same collateral gets reused again and again?\n\n“EigenLayer reminds me of the 2008 recession: undercollateralize, overleverage. That’ll go well,” one X user posted—just one of the industry onlookers who have drawn parallels with the financial crash, where banks rehypothecated subprime mortgage loans.\n\nAustin Campbell, the former head of portfolio management at Paxos, told Fortune that the comparison isn’t trivial. “At the core of every levered system is the simple truth that the more leverage you use, the less stable your system is,” he said.\n\nThere is a risk of “cascading failures” if one project fails, agrees Omid Malekan, an adjunct professor at Columbia Business School. But he and many experts were also quick to offer nuance to the 2008 parallels: Restaking doesn’t involve rinse-and-repeat borrowing and lending. Instead, it’s taking a locked-up asset, and locking it up again. Think of it more like reusing the security deposit on an apartment to secure further apartments, suggests Jack O’Holleran, CEO of Skale, an Ethereum layer 2.\n\nBut then what if you trash both apartments?\n\nOne scenario of so-called apartment trashing would be if those operating the restaking services—known as AVS for “actively validated services”—choose to devalue the restaked tokens. “There could be this ‘house of cards’ effect, but backwards,” says O’Holleran.\n\nThe debate is analogous to the criticism of liquid staking provider Lido, which currently accounts for 28% of all Ethereum being staked. In theory, Lido introduces a “centralized point of failure” which is “obviously concerning,” Tekin Salimi, founder of dao5 Capital and seed investor in EigenLater, told Fortune. But in his view, rather than barring this innovation, diversifying the liquid staking providers is the solution.\n\nNoting these concerns, EigenLayer says on its website that it includes a “veto committee” to contain slashing—the term used in the Ethereum world for destroying the collateral of validators who fail to fulfill their duties—and to prevent contagion to the mainnet or other protocols. It will serve as a “doubly-trusted intermediary between AVS and staker.” So, slashing conditions fall to each AVS, instead of the overall protocol’s discretion. But what this will really look like in practice, is unclear. To that effect, slashing risks remain “the most real and yet the most undefined” of all those raised, thinks Vance Spencer, cofounder of crypto venture capital firm Framework Ventures.\n\n‘Don’t overload the system’ Ethereum founder warns\n\nEigenLayer has given rise to specific security concerns, but also to a more broader existential one: What fraction of staked tokens can be concentrated on a separate protocol on Ethereum, which holds up decentralization as its paramount value? According to O’Holleran, empowering EigenLayer amounts to the Ethereum community giving considerable leverage and power to another system. Furthermore, copycat restaking services are also popping up, such as Karak, which announced a $48 million Series A raise last month. In addition, an unnamed but similar version is soon coming to market, sources close to the matter told Fortune.\n\nVitalik Buterin, Ethereum’s founder, raised concerns about EigenLayer in a blog post last May. “Be wary of application-layer projects taking actions that risk increasing the “scope” of blockchain consensus to anything other than verifying the core Ethereum protocol rules,” he wrote. Buterin warns of the “slippery slope” of the underlying network’s “fragile” social consensus losing credibility. His message was clear: Don’t overload the network’s consensus.\n\nOne of the concentration risks of top concern to Buterin is overloading the system’s security.\n\nThe strength of Ethereum’s security system is directly correlated to the economic value of the network—it would be prohibitively expensive for hackers to muster the resources to defeat the consensus system that protects the network. “We agree that Ether is being used to secure the main net network, and that is the only purpose thereof,” says Campbell. But if you are using your staked tokens to secure Ethereum and other networks, then the surface of things that Ether is being used to secure grows. So, the value resting on any single point gets larger, explains Campbell, which may provide more attractive incentives for hackers.\n\nThe second concentration risk concerns decision-making. Let’s say 40% of Ethereum’s tokens eventually becomes restaked and EigenLayer’s smart contract experiences a hack or bug. It’s unclear when there would be consensus to rollback Ethereum to release it, explains Tom Schmidt, partner at crypto venture capital firm Dragonfly. “I don’t know where that threshold is,” he admits."
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxOb1o0SUR2VFFpYlJMR1RBRm1BUWJoMXM5U2hQdzkwTXBWVGpjRElGRzRBRDBDZnozdHBMc0huMDhKSzZFN2FBNFVJVm5lckMxOWdjM29PTkNPdnRQRndHRG82ZjVQcXI1cTFtYWNpSENOUEJkWDZJVkRBMXVfRXBrYThra0h3Y2dr?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 May 2024 07:00:00 GMT",
        "title": "Crypto Roundup: Bitcoin Stays Steady, Ethereum Jumps 23%, and Furrever Token's 15X Returns Capture Attention - Yahoo Finance",
        "content": "Furrever Token\n\nNew York, NY, May 23, 2024 (GLOBE NEWSWIRE) --\n\n\n\nThe cryptocurrency market is buzzing with activity today, marked by notable developments in Bitcoin, Ethereum, and Furrever Token. As Bitcoin holds steady on Bitcoin Day, maintaining its value from yesterday, Ethereum has captured significant attention by surging 23% in just one week. Adding to the excitement, Furrever Token has caught the eye of many investors with its potential for up to 15X returns, making waves in the crypto community. These dynamic shifts highlight the ever-evolving landscape of digital currencies and the diverse opportunities they present for traders and investors alike.\n\nEthereum Surges 23% in a Week Amid Record ETF Trading Volumes\n\nEthereum (ETH) is currently trading around $3,750, nearly unchanged from yesterday but up 23% over the past week. This surge is driven by growing anticipation of spot Ethereum ETF approvals from the U.S. Securities and Exchange Commission (SEC).\n\nOn Tuesday, Ethereum futures ETFs hit a record daily trading volume of $47.75 million, a 40% increase from the previous peak in March. ProShares' Ether Strategy ETF (EETH) led the way, accounting for $43.14 million of the volume, followed by VanEck's Ethereum Strategy ETF (EFUT) with $2.6 million and Bitwise's Ethereum Strategy ETF (AETH) with $2.01 million.\n\nDespite this new record, Ethereum futures ETF trading volumes remain far below those of spot Bitcoin ETFs, which saw $2.16 billion in trading on Tuesday, dominated by BlackRock’s IBIT with $1.12 billion. Grayscale's Ethereum Trust (ETHE) also saw a significant increase, reaching $684.44 million in daily trading volume, the highest since May 2021.\n\nBloomberg ETF analysts Eric Balchunas and James Seyffart have increased the likelihood of spot Ethereum ETF approvals from 25% to 75%, citing a possible shift in the SEC’s stance on crypto regulation. This optimism has further fueled Ethereum's recent gains.\n\nAs the market awaits potential SEC approval for spot Ethereum ETFs, the increased trading activity and positive sentiment continue to bolster ETH's price, positioning it for further growth.\n\nBitcoin Holds Steady at $69,400 Amid Market Uncertainty\n\nBitcoin (BTC) is currently trading around $69,400, maintaining a stable position from yesterday but up by 5% over the past week. The slight drop in Bitcoin’s price on Wednesday came as traders cashed in on recent gains fueled by optimism over a potential spot Ether ETF approval.\n\nEther, the world's second-largest cryptocurrency, also experienced a pullback after reaching a two-month high earlier in the week. This movement was driven by reports of progress towards the approval of spot ETFs by the U.S. Securities and Exchange Commission (SEC), which is expected to make a key decision later this week.\n\nStory continues\n\nDespite the optimism surrounding the spot Ether ETF, broader market sentiment remains cautious due to ongoing concerns about U.S. interest rates. Persistent inflation and warnings from several Federal Reserve officials about the need for more evidence of decreasing inflation before rate cuts can begin have kept traders wary.\n\nAttention is now focused on the minutes from the Fed's late-April meeting, which could provide further insights into the central bank’s plans regarding interest rates. High interest rates generally have a negative impact on crypto markets, as they reduce the attractiveness of high-risk and speculative assets like cryptocurrencies.\n\nThe cautious sentiment in the market underscores the delicate balance between optimism over potential regulatory approvals and concerns over macroeconomic factors affecting the crypto landscape. As traders await further cues from the Fed, Bitcoin's price stability reflects the broader uncertainty in the market.\n\nFurrever Token's 15X Return Promise Attracts a Wave of Investors\n\nFurrever Token (FURR) has captured the crypto community's attention with its promise of up to 15X returns for presale investors after its official launch. This enticing potential has sparked a significant influx of investors eager to capitalize on the opportunity before the presale concludes.\n\nThe Furrever Token presale has been a roaring success, with over $1.1 million raised in just three months. Currently in stage 8 of its 10-stage presale, Furrever Token aims to raise a total of $1.9 million. The current token price is $0.000648, and investors can purchase FURR exclusively from the official website, furrevertoken.com.\n\nFurrever Token's mission is to create a fun and heart-warming crypto ecosystem centered around adorable cat imagery. The project integrates cute cat-themed stickers, emojis, and visuals, fostering a warm and friendly community. This unique approach has resonated with many investors, contributing to its organic growth and engaged community of nearly 4,000 members on Telegram.\n\nThe legitimacy of Furrever Token is bolstered by a smart contract audited by Securi Lab, no buy/sell tax, and a team committed to locking their tokens for a year. These measures reassure investors of the project's long-term viability and security.\n\nWith the presale nearing its end, now is the perfect time to invest in Furrever Token. The potential for significant returns, combined with the project's innovative and community-focused approach, makes FURR an attractive investment opportunity. Don’t miss out on the chance to be part of this exciting journey. Visit furrevertoken.com to invest in Furrever Token before the presale ends and join a community that celebrates the lighter side of crypto.\n\n\n\nJoin Furrever Token Presale Now:\n\nFurrever Token Official Website\n\nJoin $20,000 Furrever Token Giveaway\n\nJoin Official Telegram Group\n\nFollow Official X Account\n\nMedia Contact:\n\nRobert Smith\n\nhttps://furrevertoken.com/\n\nsupport (at) furrevertoken.com\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\n\n\n\n\nCONTACT: Robert Smith support (at) furrevertoken.com\n\n\n\n"
    },
    {
        "id": 78,
        "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTE9GNVU5NF9zMXEydy1SVHRVTG1PYXpOLV9nQU9yM2xQTHhlQ1pBYUgxdGZTQWs1SnlpVkdDREFnQmF5ZjFqSXd1ZUptR1NzNmg5WWotS01aMHRzUG9xNURxa2FDb0VMeUs0UDA0TnFxNNIBd0FVX3lxTE1HTEZIU1lpTDNEclZEZFFQN0U0YUthc2xvc3E4MzhsV1I2WE5YbmsxeWlsQkpUM0tjNW1weHMxNFNib2E4RlFja0pfQ1R4WHQ5WHd6M19jblQ3R2FQd29ZT2Y0VmNTMjhPa2tsdWw0ckpTNENfaUhz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 May 2024 07:00:00 GMT",
        "title": "Ethereum ETFs Could Lead to 'Serious' Security Risks, Say Experts - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nExperts are warning of the looming threat that the newly approved U.S. spot Ethereum ETFs could pose if staking is ever introduced.\n\nIn a crucial bid to push the approval process over the line, Ethereum ETF issuers dropped language regarding the staking of customer ETH.\n\nWhen the network transitioned to a proof of stake consensus in September 2022, it required ETH to be locked up in a process called staking. The staked ETH belongs to validators who help to secure the network. They’re rewarded for staking their ETH, but can be penalized if they don’t verify transactions on time.\n\nCentralization concerns have arisen in the past when single validators gained control of large portions of staked ETH. At time, people have even compared liquid staking provider Lido to a \"cartel\" when it swelled in size.\n\nAD\n\nAD\n\n“Removing staking language from ETH ETF applications was a move to appease the SEC. But this short-term solution could cause a long-term problem.” Ganesh Swami, CEO and co-founder of blockchain data analytics company Covalent, told Decrypt, “If multiple ETFs use the same custodians, this type of centralization would cause concentration to increase, exposing the network to operational risks such as malicious collusion.”\n\nTaking a look at the U.S. spot Bitcoin ETFs, we can see that Coinbase is the custodian for 90% of the total assets. While this poses an obvious centralization risk already, adding staking to the equation, well, ups the stakes.\n\n“Staking ETH ETFs are not a new concept, they exist in other countries, but clearly the U.S market brings a much larger scale,” Andrew O’Neill, analytical lead on digital assets at S&P Global, told Decrypt. “The risk in that case is that if ETFs are concentrating their stake with a small number of custodians, this could create validator concentration risks in the consensus mechanism.”\n\nCoinbase, which is already the second largest Ethereum validator, is currently set to be the custodian of at least six out of the nine firms planning to launch an Ethereum ETF. If we see similar interest as we did with the U.S. spot Bitcoin ETFs, which as a group currently have a market capitalization of $54 billion, this concentration of power could pose a security risk.\n\nAD\n\nAD\n\n“You can measure concentration risk by the number of nodes a single entity would need to control the chain. The lower that number, the higher the central point of failure.” Mona El Isa, CEO and co-founder of institutional DeFi company Avantgarde Finance, told Decrypt, “If any party amassed that much control, they could potentially alter the state of the blockchain itself. That poses serious risks to security.”\n\nIt appears that staking was removed from Ethereum ETF applications due to the SEC’s view that staking is equivalent to a securities service. It’s not without precedence. The SEC has sued companies, like Kraken and Coinbase, to stop them offering staking services to U.S. customers.\n\nAs staking is currently not allowed for ETF providers or custodians, there are no guidelines put in place to reduce the potential centralization and concentration risks that could be looming.\n\nEdited by Stacy Elliott."
    },
    {
        "id": 82,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxNdDN0dTAtWHpLRzRyekE5ajh5QmNGSDZsWTZ3Q1lES212M3ZEbzE3bFJ2OFM5T29tYk5PR1FiVDduNlRNUTgtWFROZFpabXVVUUYxN3VhYnZyQjdCUlFZU21kX3FpUF9QMXBtRG55YUxFU0JyTWY0OXRQQ0Q2N0trStIBiAFBVV95cUxOZnppQzE4NFJOZ1ZLUXpwZUh0WHhITTRqWVY2dk9yRTBIbHBJaEtaWmd0N1A4dGU0MXU5ZVBod0tMSmZyMEJzcFpzUkVjU3RUZXRxX1VxWldMajdEM05TX1h2OHVxaEF5elFGNzZFU1k2MzMtbWxYY3hINTc1bDRaR3ZFNGtvQUNU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 May 2024 07:00:00 GMT",
        "title": "What Ethereum ETF Approvals Would Mean for US Crypto Policy - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nWhen the U.S. Securities and Exchange Commission (SEC) indicated earlier this week that it was suddenly open to the prospect of approving spot Ethereum ETFs, after months of stubborn signals to the contrary, the about-face didn’t just catch Crypto Twitter by surprise.\n\nIt also shocked the nation’s top crypto lobbyists, who spend their days tracing minuscule shifts in Washington’s mood on the industry.\n\n“It is a remarkable pivot,” Kristin Smith, CEO of the Blockchain Association, a prominent crypto lobbying group, told Decrypt. “It is one that I did not foresee.”\n\nHow did the pivot come to pass? And after years of relentless hostility against the crypto industry, might the development indicate that the SEC, and the U.S. government more broadly, are changing their tune on crypto?\n\nAD\n\nAD\n\n“I think we've absolutely turned a corner,” Smith said. “It marks a complete shift in understanding about the political importance of crypto.”\n\nCrypto industry lobbyists who spoke with Decrypt attribute the SEC’s sudden tack to a recent change of political winds in the nation’s capital. Most agree the series of events that prompted the change kicked off last week, when President Joe Biden issued a forceful threat to veto a pro-crypto bill.\n\nThe bill, which sought to repeal an SEC rule dubbed SAB 121—which discourages American banks from holding crypto—later passed in the Senate with a surprising amount of support from Biden’s own party. Twelve Democrats supported the bill, including Chuck Schumer, the Senate Majority Leader.\n\nThat degree of Democratic support was not anticipated on Capitol Hill. And it undoubtedly sent a message to the White House, the Blockchain Association’s Smith believes.\n\nAD\n\nAD\n\n“To have that many [Democrats] break away from the Biden Administration after it already put out a veto threat on it,” she said, “that is significant.”\n\nExacerbating matters is the fact that, in recent weeks, Republicans including former president Donald Trump have begun embracing crypto more explicitly than ever before—creating the impression among crypto industry leaders that only one political party is on their side.\n\nCody Carbone, Chief Policy Officer at the Chamber of Digital Commerce, another crypto lobbying group, believes the pressure recently applied by Republicans on crypto, in tandem with the open dissent Biden is now facing on the subject from leaders within his own party, led the president to make a calculated decision to back off crypto—at least for now.\n\n“The Administration is seeing, in a very tight election that can be swung by a few million votes, that this is not the hill to die on,” Carbone told Decrypt.\n\nThat evolution in Biden’s thinking could already be seen Wednesday, when the president issued a statement regarding another crypto-related bill up for a vote this week—FIT21—which seeks to create a federal framework for regulating crypto. While Biden objected to the bill’s passage, he crucially did not threaten to veto it, as he did last week with the repeal of SAB 121.\n\nOn Wednesday afternoon, FIT21 easily passed a vote in the House, 279-136, with support from 71 Democrats including former Speaker of the House Nancy Pelosi.\n\nJi Kim, chief legal and policy officer at lobbying group Crypto Council for Innovation, sees the events of the last week as proof that crypto has now—albeit suddenly— graduated into a topic of consensus within U.S. politics.\n\n“What this all means is that crypto is absolutely a bipartisan issue,\" he said, \"and that members of Congress are further realizing crypto is absolutely here to stay.\"\n\nAD\n\nAD\n\nFor the same reasons the White House is now tacking on crypto to save face, the SEC is too, crypto lobbyists say—especially given that the unexpectedly popular, bipartisan repeal of SAB 121 singled out the policies of SEC Chair Gary Gensler.\n\nRubber-stamping spot Ethereum ETFs—which would allow Wall Street firms to buy and store ETH on behalf of their clients—might prove the most visible way for Gensler to take some heat off his back, the Blockchain Association’s Kristin Smith estimates.\n\n“I think this is his sort of peace offering, to show that he is open to this space, and he realizes now that the political winds are against him,” she said.\n\nBut crypto lobbyists disagree on what the move would mean for the SEC’s long-term crypto policy moving forward.\n\nSmith is optimistic the change of heart would mark a major shift in how Gensler and the SEC might police crypto from now on.\n\n“I think he's going to have no choice but to back down,” she said of the SEC Chair. “That doesn't mean he goes back and undoes all the actions that he's initiated—but he's going to have to think twice before doing something aggressive against the crypto industry.”\n\nThe Chamber of Digital Commerce’s Cody Carbone, however, has a less cheery outlook. He figures spot Ethereum ETF approvals would represent nothing more than a cold and calculated political maneuver on Gensler’s part. A meaningful change in the SEC’s outlook on crypto? Far from it.\n\n“I don't think you're going to see him dropping any of these cases or stop fighting,” Carbone said of Gensler. “I just don't think you'll see any more headlines. Most of his decisions are driven by PR.”\n\nAD\n\nAD\n\nEdited by Andrew Hayward"
    },
    {
        "id": 84,
        "url": "https://news.google.com/rss/articles/CBMizgFBVV95cUxNNkFoSGxWWXFacmh0Q2FrOUVJd2JvcHQ5OTJtNGl6eUtzN0V2U19EMV8tLVM3cEdEY0JsQlJSUTB2TEdvTXNtalJSVktiY2xBR1BqWGhXQlE2OHdRRlh5S2k5TklVMjNkdC1odkw0Z2t3OHFDejExTHIyR0xjRFhIa29BWmVOZ3Mzb285TTF0SEprUTc5cnRIdjh5TEh0dF9Dc3JhYWdici14eHBvVzUtbGJELXBwMi02by1vTUtTQXZtc3I5WG5IeUZkQWFpZ9IB0wFBVV95cUxQVVhKcWRFc0Vvd0ZrZml0ckwwMi1GaFEzZjFiMEdPSVFOb2w0Z256NUlBdEFucG1MMk9qR25ieVJ6U2UwTDk4NUQyQXBDUC1UVnZRWlp0WGZTM190Sm1iWGw1dVRYMnZLZzI1V1hTQ2k1WEs1cUk4TTRMMHlGeGNiWUplWWtmdTR0WWo3MWxiYVBfZ0ZRVEVyTmR4ZGF4R0xVako0VTNsV2k4aTdNZGt3ODN6T1ZEek1SVThlQ0p4d3ZkbS1STWlCQW1za0JOYWFqZk1v?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 May 2024 07:00:00 GMT",
        "title": "Top Ethereum Challenger Could Skyrocket by Over 2x, According to Crypto Analyst Michaël van de Poppe - The Daily Hodl",
        "content": "A widely followed crypto analyst believes one Ethereum (ETH) competitor could more than double in price.\n\nCrypto trader Michaël van de Poppe tells his 718,900 followers on the social media platform X that interoperability blockchain Polkadot (DOT) is poised to rally due to major network advances.\n\nHe also says DOT is likely to see a boost from ETH’s upward momentum as well.\n\n“Polkadot did a retest at the crucial levels and wakes up slowly. Given their Polkadot 2.0 release and the JAM ( Join-Accumulate Machine) white paper and the correlation with ETH, I’m expecting a lot from them. Next target is likely $18.”\n\nPolkadot is trading for $7.14 at time of writing, up more than 4% in the last 24 hours.\n\nThe analyst also believes the broader altcoin market is entering a bullish phase after correcting.\n\n“The altcoin market capitalization has finished its correction. The next step: reaching all-time high, which is ~60%-70% from here. I think Ethereum is likely reaching that in the next two-four months.”\n\nHe says alts could outperform Bitcoin (BTC) in the months ahead.\n\n“The altcoins are still heavily undervalued. Most of them are down 70% against Bitcoin. That doesn’t mean we shouldn’t be having any correction, but feeling fear of missing out (FOMO) here is the wrong emotion to have. In the coming months, I expect altcoins to do way better.”\n\nLastly, the analyst says he is bullish on Bitcoin but expects the crypto king to retest the $68,000 level on the 12-hour chart before continuing upward.\n\n“Bitcoin slowly consolidating. Expecting a retest at the $68,000 mark, before a continuation upwards. The trend is clearly upwards.”\n\nBitcoin is trading for $67,553 at time of writing, down more than 2% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 88,
        "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxPSEdZa0gxUWRiclFjSXYwY3BMTzFocDlPTUlrWWdmekI1MDE3c2hwNTNWN0FTdEJoSC1QVGVYaS1heWxmVFFqSWpMdEktdTRwcGZSVHBRYlQ0WHMxMnl1MWdwWGVxeG9ESUhyTzdjYU5XM21GXzNQS0hXdWlvQ0JTbnF2NkJRQmh3RHMxWmNGOHhpSzVhNWlzWU1MQXdPS0paTGdNRmxSNWZRWGF5VHdRMnJQM283Nk96eW5xaWhqeU85UQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 May 2024 07:00:00 GMT",
        "title": "First Bitcoin, now Ether: SEC opens door to Ethereum ETFs - Business Today",
        "content": "In a landmark decision, the US Securities and Exchange Commission (SEC) has signalled its approval for the potential launch of eight exchange-traded funds (ETFs) linked to ether, the world's second-largest cryptocurrency. This move follows the SEC's approval of the first bitcoin ETFs earlier this year, marking a significant shift in the regulatory landscape for digital assets.\n\nRelated Articles\n\nThe SEC's approval on Thursday involved crucial rule changes that pave the way for ETFs that directly invest in ether, the native cryptocurrency of the Ethereum blockchain. Applications from prominent financial groups such as BlackRock, Fidelity, Invesco, and Ark Invest received the green light. While this represents a major step forward, a second round of approvals will be necessary before these products can officially launch.\n\nThe anticipation surrounding these approvals has fueled a surge in ether's price, which has climbed more than 20% since Monday and over 60% since the beginning of the year. This reflects the growing confidence among investors regarding the mainstream acceptance of cryptocurrencies.\n\nThe SEC's decision comes after months of silence on the matter. On Monday, the regulator unexpectedly provided feedback on pending applications to issuers and exchanges, triggering a flurry of paperwork revisions and submissions. This swift action was likely prompted by approaching deadlines for responses to ether ETF applications from VanEck and Ark Invest.\n\nWhile the SEC's Thursday approval marks a significant milestone, the timing of the second round of approvals and the subsequent launch of ether ETFs remains unclear.\n\nCommenting on the development, Sergey Nazarov, co-founder of Chainlink stated: \"The Ethereum ETF approval is a second large step forward for the crypto industry... The attention and adoption around the Ethereum ETF also proves the long-term thesis we have been building around, that the capital markets will be the next large source of adoption for the cryptocurrency industry, essentially being the key force that is driving it to new heights.\"\n\nNazarov highlighted the potential of the approval to shine a spotlight on Ethereum's smart contract and decentralised application capabilities, which are attracting growing interest from major financial institutions.\n\nSumit Gupta, Co-founder of CoinDCX commented, \"The US Securities and Exchange Commission (SEC)'s green light for spot Ether ETFs is a watershed moment for the crypto industry. It builds on the success of Bitcoin ETFs, offering a secure and regulated way for investors to access Ether. This broader acceptance will fuel mainstream adoption and reflect a maturing regulatory environment, paving the way for further legitimising the entire digital asset space.\"\n\n\"Ethereum plays a pivotal role in the decentralised ecosystem, and this regulatory progress will be instrumental in shaping the future of Web3 and the ongoing digital revolution. The SEC decision is particularly important, as earlier media reports suggested the SEC was investigating the Ethereum Foundation, coupled with the ongoing debate about Ethereum’s native token, ether (ETH), and its potential classification as a security,\" Gupta added.\n\nMeanwhile, Himanshu Maradiya, Founder & Chairman of CIFDAQ Blockchain Ecosystem India Ltd said, \"The SEC's approval of Ethereum ETFs marks a watershed moment in digital finance, poised to catalyse a sustained bull run while tempering volatility to align with traditional asset classes. This monumental achievement not only validates the mainstream acceptance of cryptocurrencies but also sets the stage for widespread institutional and retail involvement. Regulated investment vehicles for Ethereum will bolster investor confidence and ignite further innovation within the blockchain sphere.\"\n\nMaradiya added, \"In the Indian market, this development heralds a new era of global digital asset integration, offering invaluable insights for our regulators. Indian investors stand to benefit from expanded portfolio diversification and enhanced access to global crypto markets. This pivotal juncture has the potential to accelerate cryptocurrency adoption in India, fostering a more inclusive and dynamic financial ecosystem. Moreover, it presents retail investors with a unique opportunity to harness the power of this asset class for wealth creation.\"\n\nThis landmark decision by the SEC could potentially usher in a new era for cryptocurrencies, further solidifying their integration into traditional financial markets."
    }
]