[
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxPck9wSmdWNlNyeU9XSS0yRjZKT1gyWGdxbTlIT0tHeWdxODdyVElJTHozSUh5SU91ZXVFRVZMTXVHV1Q2NERyTzJSZTBrSzdNLUs1VC11RU5DUUt2MjBJdG8wLXUyUXdyVm5BbFRrUmlXMTZmQ0xaTU1ZUWxLUzJSV3g0TDRVMnUwb2tsVGUtWGF1Q3RONEVwbUVSbUdiVWY3dVRycGl0Qmp0QQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Jul 2024 07:00:00 GMT",
        "title": "Tether 24 hour trading volume surpasses Bitcoin, Solana, USDC and Ethereum combined - CryptoSlate",
        "content": "Tether USDT’s 24-hour trading volume exceeds the combined total of the following five digital assets, including Bitcoin and Ethereum.\n\nReflecting on Tether’s dominance in trading volume provides insight into market liquidity. As CryptoSlate data indicates, Tether (USDT) maintains a higher volume than Bitcoin (BTC), Ethereum (ETH), USD Coin (USDC), Solana (SOL), and First Digital USD (FDUSD), pointing to its significant presence in the market. Specifically, Tether recorded a 24-hour volume of over $55 billion, far surpassing Bitcoin’s $28 billion and Ethereum’s $15 billion.\n\nWith a market cap of over $112 billion, the trading patterns also show that Tether’s volume has consistently been robust throughout 2024, peaking at $130 billion on March 16. Tether’s stability and frequent use in trading pairs make it a preferred choice for traders seeking to hedge against volatility.\n\nThese volume statistics reflect broader market trends as Tether provides liquidity and stability. Tether regularly achieves daily trading volumes exceeding $25 billion, reinforcing its status as a key liquidity provider in the crypto ecosystem.\n\nPer Glassnode data, throughout 2024, Bitcoin and Ethereum have seen around $4 – $8 billion per day, far below Tether’s volumes.\n\nThe high trading volume of Tether compared to other major digital assets illustrates its integral role in daily trading activities and the broader market strategy that traders and institutions employ. This continuous high-volume trading signifies trust and reliance on Tether’s stability and accessibility, making it indispensable for efficient market functioning.\n\nWhile Tether has historically faced recounted challenges regarding its reserves and use in illicit activities, these volumes showcase its resilience in combating these claims. Tether’s CEO Paolo Ardoino recently told CryptoSlate that Tether is currently over-collateralized, with the firm’s profits being put back into reserves to strengthen its stability.\n\nFurther, Ardoino commented how Senator Warren’s discouragement of accounting firms from engaging with Tether had hindered its ability to use one of the US’s top four accountants for audits. The CEO claimed that Tether is continuously seeking to hire one of the leading companies but has almost given up on it happening any time soon, regardless of their efforts to do so.\n\nMentioned in this article"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTE1Bc1pKSU5LTXZqWmJLSHNtU2xibC0zRVpPWUk0U1RvNTRIOVlCSTV0VkdxeW4yOEp3NWtLQXU2UjhhSWE2b3BnT3lnby1BcXRsSVZaZ1pfS285aTdGQVZjLUlkeGdQYllrblZISWxCUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Jul 2024 07:00:00 GMT",
        "title": "7 Famous Ethereum Investors that You Should Know - UseTheBitcoin",
        "content": "Currently, the world’s second most valuable cryptocurrency, Ethereum, has started to attract more attention from investors. After December 2017 when, along with most other cryptos, ETH price hit an all-time high even more Ethereum investors have joined the market. Today we will list the 7 most famous ones.\n\nOne reason why Ethereum has become a favorite among investors is the fact that it’s actually so much more than just a cryptocurrency project. In fact, one could argue that Ethereum is the world’s most important blockchain project, since it actively contributes to the mainstream adoption of cryptos thanks to its platform that offers support for dApps, smart contracts, and new blockchain projects.\n\nAs with all cryptocurrencies, there are various risks involved when it comes to investing in Ethereum as a platform. However, this hasn’t stopped a great number of people from doing just that, including various celebrities and big names within the cryptosphere.\n\nHere is a list of famous Ethereum investors:\n\nJoseph Lubin\n\nBoasting immense experience in fields such as software engineering, robotics, machine vision, and neural nets, Joseph Lubin is also one of the biggest names to be associated with the Ethereum project. The co-founder of Ethereum and founder of ConsenSys (a Brooklyn-based software company focused on building dApps based on the Ethereum platform) may very well be one of the biggest Ethereum investors.\n\nAccording to various rumors, Joseph Lubin was one of the top buyers in the Ethereum crowd sale event that took place a couple of years ago. Joseph Lubin is regarded, by various industry insiders, as being one of the most important holders of Ethereum, with a valuation that is supposed to be as high as $10 billion.\n\nAt the same time, Mr. Lubin is also the founder of the Swiss-based company EthSuisse that has been heavily investing in Ethereum. With ConsenSys and EthSuisse, they do not only invest in the future of the network but also in solutions that would be able to offer better services to users.\n\nIn addition to it, Lubin has also been involved in different cross-industry groups that aimed at advancing solutions related to governance issues in the blockchain space. Thus, when you buy Ethereum, that doesn’t necessarily mean funds directly to developers, but it can also be by developing new services, gathering efforts to create new solutions, and expand the whole ecosystem.\n\nSource: rte.ie\n\nRichard Sherman\n\nRichard Sherman, an American football cornerback for the San Francisco 49ers of the NFL (National Football League), is yet another famous person passionate about cryptocurrencies. Sherman started as a Bitcoin and Ethereum investor extremely early, after fans started asking if they could purchase products and merchandise from his official website using various digital coins.\n\nRichard declared on multiple occasions that he owns a few BTC, ETH, and LTC but is not really interested in the multitude of other smaller coins. He purchased Bitcoin when it was valued somewhere around $1,000 and managed to cash out when the prices skyrocketed upwards of 19,000. Regardless, he declared that he regrets not keeping the Bitcoins as they were.\n\nRichard Sherman has been selected to the Pro Bowl four times and has also been voted All-Pro four times. He has been playing in the Seattle Seahawks between 2011 and 2017 and in the San Francisco 49ers since 2018.\n\nMr. Sherman is not only interested in cryptocurrencies but he is also an ambassador for the trivia application FleetWit. Moreover, he has also invested in other tech stocks, showing that he has a diversified portfolio.\n\nThere are different individuals that decided to enter the cryptocurrency market.\n\nCameron and Tyler, the Winklevoss Brothers – Ethereum Investors\n\nCameron and Tyler Winklevoss have made headlines on numerous occasions due to their connection with the crypto world. Even though the brothers have made a name for themselves after suing Mark Zuckerberg, the founder and CEO of Facebook, claiming that he stole their idea of a social network, nowadays, the Winklevoss brothers are known as some of the biggest Ethereum investors.\n\nThe lawsuit allowed the brothers to settle for a whopping $65 million of Facebook stock and cash. After seeing an opportunity in blockchain and crypto technology, they decided to invest in Bitcoin. The brothers ended up buying 120,000 Bitcoin in 2012 when the price was less than $10. After their financial success, they re-invested and racked up around $350 million from other cryptocurrencies, Ethereum included. The siblings are also renowned for creating the New York-based crypto exchange called Gemini.\n\nAlthough the Winklevoss brothers have been investing in Bitcoin (BTC) and focus on this digital asset, they were also holding Ethereum. Tyler Winklevoss explained that Initial Coin Offerings (ICOs) were not compliant with securities law and that they are tokens on top of tokens. Regarding the value of the Ethereum network and its tokens, Mr. Winkleovss said that its value lies in the network itself rather than on other digital tokens.\n\nAt the moment there is no clear information regarding the amount of ETH that they hold or whether they have decided to sell a part of their stake. Nonetheless, they will continue playing an important role in the whole cryptocurrency market independently from the virtual currency they hold.\n\nSource: CNBC\n\nVitalik Buterin – Ethereum Founder\n\nVitalik Buterin is a name that hardly requires any introduction, especially for those well accustomed with the crypto space. Our list wouldn’t be complete without Vitalik, the mastermind behind the whole Ethereum project, and, arguably, the most important person in the crypto sphere after Satoshi Nakamoto.\n\nIt’s a well-known fact that Vitalik Buterin is a very wealthy man with one of the biggest net worths in crypto. Even though the inventor has never publicly acknowledged how much ETH he owns, there have been reports of him transferring 30,000 ETH to Bitstamp, one of the biggest crypto exchanges, somewhere in December 2017. Other forums and public posts depict Vitalik as the holder of somewhere around 500,000 ETH.\n\nAt the end of the day, nobody can answer this question apart from Vitalik Buterin himself. What’s more amazing is that when most people think about Buterin, they don’t see that wealthy man, but the inventor of one of the best blockchains platforms, a person for whom money is not a priority, and always looking to solve real problems within the crypto sphere.\n\nMr. Buterin has been involved in the cryptocurrency market and their investment on the Ethereum network is not merely financial. He is dedicated to Ethereum as a developer and leader of different teams that are investing their time and funds in improving the Ethereum ecosystem.\n\nThus, spending time and effort in the network is also a way of investing in it. Furthermore, there are many companies that rely on his recommendations and advice in order to invest their money in developers working on top of Ethereum. More adoption means stronger fundamentals for Ethereum, which would eventually be translated into a higher price of the ETH digital asset.\n\nButerin is in a similar situation as Joseph Lubin. Both of them co-founded Ethereum and they have been working in order to expand Ethereum’s solutions and projects. They may not invest large amounts of money directly in ETH but they have been working in order for ETH to have more value over time.\n\nSource: Ethereum World News\n\nAshton Kutcher\n\nAshton Kutcher, the Hollywood actor, is known for being passionate about technology in general. He was also one of the early investors in technologies and apps such as Airbnb and Uber, as well as for cryptocurrencies. He was one of the first celebrities to jump onto the crypto craze bandwagon and has even tweeted about Ethereum in 2014, almost a year before its initial release. Kutcher is said to be one of the big Bitcoin and Ethereum investors, even though an official number is yet to be released.\n\nSource: MarketWatch\n\nCharles Hoskinson\n\nCharles Hoskinson is also one of the co-founders of Ethereum. He is now the lead developer of Cardano (ADA) and Ethereum Classic (ETC). He has been working in order to offer alternative solutions to Ethereum.\n\nDespite that, he is an early adopter of virtual currencies. He entered the space when Bitcoin was traded close to $1. When the digital currency moved to $250 he decided to lead other major projects and start moving forward with the expansion in the crypto space.\n\nIt is worth mentioning that he is among the early Ethereum investors as the co-founder of the network. However, he didn’t disclose part of his investments in the crypto project or whether he sold all his coins after some time.\n\nHe has been involved in a large number of crypto projects and now is focused on Cardano, one of the largest cryptocurrencies in the market. The work he has been doing is very positive for the crypto market, something that helped increase the level of technical improvements in the crypto space. Ethereum is also now trying to compete with other networks, including Cardano, which is allowing developers to offer even better solutions and products.\n\nSimilarly to what Lubin and Buterin did, Hoskinson invested his time rather than just money on Ethereum. Thus, because of him and his passion for crypto projects, we could now have a much more advanced network and cryptocurrency industry. 11\n\nCole is a freelance writer focusing on cryptocurrency and emerging technologies. Previous articles on Masternodes have been featured on leading crypto websites and quoted in Whitepapers.\n\nWant to buy Ethereum today? We recommend buying ETH through Coinbase if you want to buy with a credit card, or you can use the highly recommended Binance to purchase ETH.\n\n<! — /wp:paragraph –>"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQOTk1ZTJ2LUE4SmhWRE5aUmxyNW1VREhfdXJORTZZdGhXOGxSSlhBaE41R0JVdHJKSTVNS05scnRwRmd1ZEhZcThUMnRVNEU1S0QtZjktMXcyNklJZWVlNnV4d0RlVTZ1SHZHZjkwdWt0WDdnekliaWdyRC1BeFU2NHU1UV9tN2l0S0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 07 Jul 2024 07:00:00 GMT",
        "title": "Solana vs Ethereum: the clash between titans - The Cryptonomist",
        "content": "In this article, we compare two leading blockchains in the cryptographic sector: Solana vs Ethereum.\n\nBoth have very developed DeFi ecosystems and a wide range of successful applications built within them.\n\nThe two networks work together to create the most thriving web3 environment possible, with the goal of becoming the premier layer of the on-chain future.\n\nThe challenge is also played out on the token level, with ETH and SOL trying to offer the best return on the market.\n\nLet’s see everything in detail below.\n\nSolana vs Ethereum: the main differences on the technological level\n\nWe are talking about one of the most heated and intense clashes on the technological front of the last decade, as well as the most discussed in the crypto landscape: the Solana vs Ethereum war.\n\nEveryone knows by now that these two blockchains have been in conflict for years to win the title of dominant web3 infrastructure.\n\nIn fact, however, they are quite different in many aspects: Ethereum is an EVM network built with the programming language Solidity while Solana is SVM built with C, C++ and Rust.\n\nThis alone is enough to distinguish two poles in which the development of decentralized applications takes place according to different coding rules.\n\nFurthermore, the concept of “account” also changes significantly depending on the context, whether it is used in an Ethereum or Solana environment.\n\nIn fact, on Ethereum the term account is used to describe an entity that owns ether (ETH) and can initiate transactions. It is classified as follows:\n\nEOA (Externally Owned Account): account in possession of a private key, conceptually similar to a wallet;\n\nCA (Contract Account): account for smart contracts not in possession of a private key.\n\nSimplifying, we can say that EOA does not have storage space and therefore cannot be used as a contract for carrying out operations (except for exceptions with ERC-4337).\n\nThe CA, on the other hand, is simply a software program executable by EVM with a code (contract) that distinguishes it. An EOA can therefore execute a call through CA but not vice versa!\n\nOn the opposite front of Solana, however, the concept of “account” is broader and refers to an entity that can always store and save data.\n\nThe state of transactions is therefore saved using accounts in a manner similar to what happens in operating systems like Linux. It is worth noting that Solana natively supports the account-abstraction function, allowing self-calling between programs.\n\nThe accounts in Solana are of two types:\n\nExecutable account (program account): smart contracts called “programs” that store the code;\n\nNon-executable account (data account): entities that can receive tokens or data but cannot execute code.\n\nBelow is a map of the main technical differences.\n\nTwo different approaches for the development of DeFi environments\n\nDescending to a less technical level, we notice that Ethereum and Solana use different marketing approaches for their respective DeFi environments.\n\nAlthough both chains are intent on attracting the widest possible base of capital and users, they focus on different segments.\n\nIn fact, Ethereum presents a more “institutional” character with its main values oriented towards the security of the network and decentralization.\n\nSolana, on the other hand, has a more “smart” personality, oriented towards the scalability of operations and cryptographic efficiency.\n\nThey follow the limits of both blockchains on their own: for Ethereum scalability, for Solana decentralization.\n\nLIVE NOW — Ethereum vs. Solana\n\n\n\nThat’s the debate we’re having today. On Ethereum’s side, we have @Ethereum Researcher @drakefjustin, and on the @Solana side, we have Solana’s Co-Founder @aeyakovenko\n\n\n\nThey give us the good, the bad, and the ugly of each other’s blockchain,… pic.twitter.com/MlCWd4NtOT — Bankless (@BanklessHQ) June 3, 2024\n\nEthereum presents a TVL of 59 billion dollars, much greater than Solana’s 3.5 billion dollars. For this reason, the Foundation uses a softer communication with the public and with less intention to create engagement.\n\nSolana, on the other hand, focuses entirely on innovation, user experience, and transaction throughput. The latest innovations launched, such as the Saga smartphone and the Blinks, speak volumes about the approach the network uses with retail.\n\nWe can say that Ethereum is a less performant blockchain, at times less “convenient”, but more secure and reliable.\n\nSolana is much more “fun” and efficient to use, but less decentralized based on a few clients and less secure.\n\nIf you are high-net-worth individuals with a moderate risk exposure, you will surely appreciate Ethereum more.\n\nIf you are young, fearless, and have a limited budget, you will probably find the features of Solana more appealing.\n\nThe main web3 dapps of the two ecosystems\n\nThe war between the two titans Ethereum and Solana continues uniquely in the creation of the best decentralized web3 applications.\n\nOn Ethereum the largest dapp in terms of TVL is the liquid staking platform Lido: it alone attracts almost 10 times the entire capital absorbed by Solana.\n\nNext, we find successful dapps such as EigenLayer, Aave, Maker, Ether.fi, Uniswap, RocketPool, Ethena, and Pendle.\n\nIn the suite of protocols of Solana, we find Jito as the top-ranked, with a TVL of 1.74 billion dollars. Then the most used applications are Marinade, Kamino, Sanctum, Jupiter, Marginfi, Drift, BlazeStake, Meteora, and Solend.\n\nThe majority of Ethereum dapps are integrated with various layer-2, ensuring greater scalability. At the same time, the differentiation of blockspace requests leads to a fragmentation of liquidity, which is often inconvenient.\n\nFor this reason, Ethereum is often criticized by its detractors because as a Settlement Layer it has to rely on external solutions to grow.\n\nOn the other hand, the competitor is criticized for the absence of a flourishing and secure DeFi ecosystem: almost all the dapps on Ethereum surpass the total TVL of Solana!\n\nIn any case, it is worth noting how Solana is producing very interesting products, such as the recent platform pump.fun.\n\nProposed as a launchpad for memecoin, in a short time it managed to become the most profitable dapp in the entire cryptographic ecosystem.\n\nOn July 1st, it recorded record fees of 2 million dollars, even surpassing the entire revenue of the whole Ethereum blockchain.\n\nChapeau.\n\n🚨Breaking Big: @pumpdotfun Becomes No. 1 Crypto App Across All Chainshttps://t.co/VS31GZ2FXq has surged to the top spot as the leading crypto app, surpassing Ethereum with a staggering $1.99M in revenue generated over the last 24 hours. pic.twitter.com/59euyqCRWp — SolanaFloor (@SolanaFloor) July 2, 2024\n\nA speculative war: Solana with SOL vs Ethereum with ETH\n\nThe Solana vs Ethereum challenge can only conclude with a focus on their respective gas tokens SOL and ETH.\n\nIt is clear that the better these cryptocurrencies perform on a speculative level, the more users are interested in purchasing them and becoming part of the community.\n\nThe metric of active addresses and the volume of transactions, in fact, largely depends on the evolution of the price of SOL and ETH.\n\nBoth networks are interested in pushing the price of their respective coins upwards, both for a boost in on-chain metrics and for obvious economic reasons.\n\nIn 2024 the two coins recorded similar trends, with a growth of about 50% from the January quotations. SOL, however, grew at a faster pace in the last quarter of 2023, attracting more new buyers compared to what Ethereum did.\n\n>>Solana Vs Ethereum in 2024\n\n\n\nSolana is Winning by Huge Data Growth Margin\n\n\n\nGrowth Metrics(%):\n\n\n\n– Price\n\n– Stablecoin Volume/Marketcap\n\n– TVL/Fees\n\n– NFT Trading Volume\n\n– Daily Transactions/ Daily Active Addresses\n\n\n\nEthereum Growth Metrics(%):\n\n\n\n– DEX Trading Volume\n\n– Daily Volume pic.twitter.com/Q8GV7mQ9Jy — hitesh.eth (@hmalviya9) May 30, 2024\n\nAt the moment both SOL and ETH are close to their respective all-time highs, with the latter seeming slightly advantaged.\n\nThe evolution of the prices of the two coins from now until the end of the bull market will be essential to bring more adoption to blockchain technology.\n\nPlaying a decisive role in the coming months will also be the upcoming inauguration of the spot ETFs for the two cryptocurrencies. First that of Ethereum, then (perhaps) that of Solana, will contribute to attracting more capital inflows.\n\nAt stake is the dominance as a settlement layer for the major financial operations of the cryptographic world.\n\nIt is not certain, however, that in the future only one network between Solana and Ethereum will survive, and indeed a coexistence scenario is much more likely.\n\nObviously, there will be a network that will have a larger market share but without precluding the existence of the other\n\nETH vs SOL\n\n\n\nDONT BE A MAXI.\n\n\n\nThe world is gonna be multi-chains!\n\n\n\nStop wasting time arguing about which one is better, and start learning about all the benefits and use cases each bring.\n\n\n\nMore ETFs will grow the pie!\n\nETF products will bring attention and money into the space.… pic.twitter.com/MdtTDdCf7X — Gun (Kingbund.eth) (@KingBund) July 2, 2024\n\nAlthough in a perspective of coexistence, the dispute between the maximalists will continue for many years to come.\n\nAs we can learn from the historical Pepsi vs Coca Cola discount that has been ongoing for over 100 years, the fight for supremacy is always around the corner."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMinwJBVV95cUxNTlhFR0xHVjBIZklxamdPc0FKamJMSGVHU1RsdXBiS19MS1JEMmhqenlieFR4NWFaS1I5bE9wejhrQWpnQkRxb25kTFBhQzF5THQtQkJKckZvZUhoQmJpWlhpazZCTW1sRV8zNVJiY3FDbXF0NV9MN1ZrWWR2c0JZTC1RWTE3YThhV0NkOEM3bUhtUFhEd2xDX3kyVkh3Q3JtYXdNcFgwRzhvSGI0ZWdaRkw1bjFjb2JRbnNndGRfbGIwU2dCMnA5Q0RHRVFYLVJyMXcxZm8yNXNUdldwRTJSWi10dDBuT0wtNXlzTnpGSWhNNGxtWEptYzBDNjBxNmdRWkQzMkJ4bHBIdGVLcy16UEZYcHNtRVVLVVhRWXlfNA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Jul 2024 07:00:00 GMT",
        "title": "Grayscale Investments® Announces Record Date and - GlobeNewswire",
        "content": "STAMFORD, Conn., July 08, 2024 (GLOBE NEWSWIRE) -- Grayscale Investments®, the world’s largest crypto asset manager*, offering more than 20 crypto investment products, today announced that it has set a record date of July 18, 2024 (the “Record Date”) for the initial creation and distribution of shares of Grayscale Ethereum Mini Trust (the “ETH Trust”) to shareholders of Grayscale Ethereum Trust (Ticker: ETHE) (“ETHE”) (referred to as the “Initial Distribution”). Grayscale intends to list the ETH Trust on NYSE Arca, subject to required regulatory approvals, under the ticker symbol “ETH.”\n\n\n\nAs part of the contemplated Initial Distribution, each holder of shares (the “ETHE Shares”) of ETHE as of 4:00 PM ET on the Record Date will be entitled to receive shares (the “ETH Shares”) of the ETH Trust, a Delaware statutory trust sponsored by Grayscale, as described in a preliminary information statement on Schedule 14C, initially filed with the Securities and Exchange Commission on April 23, 2024 and most recently amended on July 8, 2024 (the “Preliminary Information Statement”). ETHE will also file a definitive information statement on Schedule 14C with the Securities and Exchange Commission on or after the Record Date.\n\nIn the Initial Distribution, ETHE will contribute 10% of the Ether that it holds as of 4:00 PM ET on the Record Date to the ETH Trust, and each holder of ETHE Shares as of 4:00 PM ET on the Record Date will be entitled to receive ETH Shares pro rata based on a 1:1 ratio, such that for each one (1) ETHE Share held by an ETHE shareholder as of 4:00 PM ET on the Record Date, such ETHE shareholder will be entitled to receive one (1) ETH Share on the Distribution Date, as described below and in the Preliminary Information Statement. ETHE shareholders will not need to pay any consideration, exchange or surrender existing ETHE Shares, or take any other action to receive ETH Shares.\n\nRecord Date July 18, 2024 Ratio of ETHE Shares: ETH\n\nShares 1:1 % of ETHE contributed to the\n\nETH Trust 10% Distribution Date Subject to conditions stated\n\nbelow\n\nImportantly, both the launch of the ETH Trust and the Initial Distribution of ETH Shares to ETHE shareholders are subject to regulatory review and customary conditions. The “Distribution Date” will be the first date following the Record Date on which the conditions to the Initial Distribution have been satisfied, including (i) the filing and effectiveness of the ETH Trust’s registration statement on Form 8-A to register the ETH Shares under the Exchange Act, (ii) the effectiveness of the ETH Trust’s registration statement on Form S-1 (Registration No. 333-278878) under the Securities Act, and (iii) the ETH Shares having been approved for listing on NYSE Arca. The Distribution Date will be no sooner than July 19, 2024, and, as a result of such conditions not having been satisfied as of the date hereof, no assurance can be given that the Initial Distribution will occur on Grayscale’s anticipated timeline, or at all.\n\nSubject to the limitations and qualifications set forth in the Preliminary Information Statement filed by ETHE (including with respect to the qualification of both ETHE and the ETH Trust as grantor trusts for U.S. federal income tax purposes and the proper allocation of existing tax basis between ETHE Shares and ETH Shares), it is expected that neither ETHE nor any beneficial owner of ETHE Shares will recognize any gain or loss for U.S. federal income tax purposes as a result of the Initial Distribution. Accordingly, it is expected that neither ETHE’s contribution of Ether to the ETH Trust nor ETHE’s distribution of shares in the ETH Trust to ETHE shareholders as of 4:00 PM ET on the Record Date will be reported to any beneficial owner of ETHE Shares (or to any intermediary holding ETHE Shares) as giving rise to income, gain, loss, deduction, credit or proceeds.\n\nFrom and after July 18, 2024 (the “Ex-Distribution Date”), ETHE Shares will trade without the right to receive ETH Shares in the Initial Distribution. There is not expected to be a “when-issued” market for the ETH Shares prior to the Distribution Date. Following the Initial Distribution, ETHE shareholders as of 4:00 PM ET on July 18, 2024 will automatically see both ETHE Shares and ETH Shares in their portfolios or investment accounts on the Distribution Date.\n\nThe Grayscale team will communicate additional updates, as applicable, including the anticipated Distribution Date, any material updates regarding pending regulatory approval and customary conditions, and the announcement of Grayscale Ethereum Trust’s and Grayscale Ethereum Mini Trust’s first day of trading on NYSE Arca.\n\n*By AUM as of 6/28/2024\n\nNO OFFER OR SOLICITATION\n\nThis communication is for informational purposes, solely in your capacity as a shareholder of ETHE, and does not constitute an offer to sell or the solicitation of an offer to buy any securities or a solicitation of any vote or approval, nor shall there be any sale of securities in any jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of such jurisdiction. No shareholder approval of the Initial Distribution is required by applicable law, and we are not seeking ETHE shareholder approval.\n\nFORWARD-LOOKING STATEMENTS\n\nCertain of the statements contained herein may be statements of future expectations and other forward-looking statements that are based on Grayscale’s views and assumptions and involve known and unknown risks and uncertainties that could cause actual events to differ materially from those expressed or implied in such statements. Grayscale assumes no obligation to update any forward-looking statements contained herein and you should not place undue reliance on such statements, which speak only as of the date hereof. Although Grayscale has taken reasonable care to ensure that the information contained herein is accurate, no representation or warranty (including liability towards third parties), expressed or implied, is made by Grayscale as to its accuracy, reliability, or completeness. You should not make any investment decisions based on these forward-looking statements. No assurance can be given that the Initial Distribution will occur on Grayscale’s anticipated timeline, or at all.\n\nIMPORTANCE OF OBTAINING PROFESSIONAL TAX ADVICE\n\nThis communication is not intended as, and does not constitute, tax advice. As further discussed in the section of the Preliminary Information Statement filed by ETHE entitled “Material U.S. Federal Income Tax Consequences of the Initial Distribution,” the U.S. federal income tax consequences of the Initial Distribution are complex, subject to uncertainty in certain respects and may be affected by circumstances specific to a beneficial owner of ETHE Shares. Any beneficial owner of ETHE Shares who receives ETH Shares in the Initial Distribution, and any intermediary holding ETHE Shares or ETH Shares, should consult their own tax advisor regarding the U.S. federal income tax consequences of the Initial Distribution, including the proper allocation of existing tax basis between ETHE Shares and ETH Shares. Please refer to the Preliminary Information Statement filed by ETHE for more information, including other U.S. federal income tax considerations relating to the Initial Distribution and ownership of the ETH Shares.\n\nADDITIONAL INFORMATION AND WHERE TO FIND IT\n\nA definitive information statement on Schedule 14C will be furnished to ETHE shareholders on or after the Record Date for the purpose of informing ETHE shareholders of the Initial Distribution, in substantial compliance with Regulation 14C of the Exchange Act. The information statement will describe the Grayscale Ethereum Mini Trust, risks of owning shares of the Grayscale Ethereum Mini Trust and other details regarding the Initial Distribution, and will be made available on our website at www.grayscale.com/documents#regulatoryfilings. ETHE shareholders will not need to pay any consideration, exchange or surrender existing ETHE Shares, or take any other action to receive shares of the Grayscale Ethereum Mini Trust in connection with the Initial Distribution.\n\nETHE is not a fund registered under the Investment Company Act of 1940 and is not subject to regulation under the Investment Company Act of 1940, unlike most mutual funds or ETFs.\n\nGrayscale Ethereum Trust and Grayscale Ethereum Mini Trust Risk Disclosures:\n\nAn investment in the Grayscale Ethereum Trust or Grayscale Ethereum Mini Trust may be deemed speculative and is not intended as a complete investment program. An investment in ETHE or the Grayscale Ethereum Mini Trust should be considered by persons financially able to maintain their investment and who can bear the risk of total loss associated with an investment in ETHE or the Grayscale Ethereum Mini Trust. Extreme volatility of trading prices that many digital assets, including Ether, have experienced in recent periods and may continue to experience, could have a material adverse effect on the value of ETHE and the Grayscale Ethereum Mini Trust and the shares of each trust could lose all or substantially all of their value. Digital assets represent a new and rapidly evolving industry. The value of ETHE and the Grayscale Ethereum Mini Trust depends on the acceptance of the digital assets, the capabilities and development of blockchain technologies and the fundamental investment characteristics of the digital asset. Digital asset networks are developed by a diverse set of contributors and the perception that certain high-profile contributors will no longer contribute to the network could have an adverse effect on the market price of the related digital asset. Digital assets may have concentrated ownership and large sales or distributions by holders of such digital assets could have an adverse effect on the market price of such digital assets. The value of ETHE and the Grayscale Ethereum Mini Trust relate directly to the value of the underlying digital asset, the value of which may be highly volatile and subject to fluctuations due to a number of factors.\n\nA registration statement related to Grayscale Ethereum Mini Trust has been filed with the SEC but has not yet become effective. An investment in the Grayscale Ethereum Mini Trust cannot be made, nor money accepted, until the registration statement is effective. An investor should consider the investment objectives, risks, and charges and expenses of the Grayscale Ethereum Mini Trust carefully before investing. A preliminary prospectus which contains information about Grayscale Ethereum Mini Trust may be obtained by emailing info@grayscale.com. The information in the preliminary prospectus is not complete and may be changed. The final prospectus should be read carefully before investing, and when available may be obtained from the same source. This communication is not an offer to sell shares and is not soliciting an offer to buy shares in any state where the offer or sale is not permitted.\n\nGrayscale Investments, LLC is the Sponsor of Grayscale Ethereum Trust and Grayscale Ethereum Mini Trust.\n\nAbout Grayscale Investments®\n\nGrayscale enables investors to access the digital economy through a family of regulated and future-forward investment products. Founded in 2013, Grayscale has a proven track record and deep expertise as the world’s largest crypto asset manager. Investors, advisors, and allocators turn to Grayscale for single-asset, diversified, and thematic exposure. Certain Grayscale products are distributed by Grayscale Securities, LLC (Member FINRA/SIPC) and certain products are managed by Grayscale Advisors, LLC.\n\nMedia Contact\n\nJennifer Rosenthal\n\npress@grayscale.com"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxPY2psQXpmcFN5QVdPMVhkTnoyQXlNMjZkOXVYYndPdlhBR0pqVmpPUWh6TVk5akxPM2lDQldGb0VUMnhZM3ZEQ0Z6dFYzeUhxaTA2YS16U0tBZk10Y0lYLWlKYWE3WVJSUTBrcVJMWm1JeDVCRGttaWdfZXZ0M0hFQlkyWWNTcEtYX1dDa0JkLUtwVW84VHZJVWQwWFNjQ2Z4djUtbVNfWGR2MmRZMTJqU0xOOXpKRHdyT3BUTW93bEd5TlJfVTlDbnBONUzSAdIBQVVfeXFMTlp0dFZCTlZMSms2SjZGTXp0cWF4ODhyZ0tORmRPSThfaXJFbGNFclZ2NWVYcDd4c2NlNFZ4NWtEdXZYbXhOTHZlcWFCblAzeU9LaGR0VUp1bVVsdS1XWUFtWDBBdEVqMTJ2VFItUXhZTUhGM3Vha092eVNINnNmeFZiRmpqRHQ4OW1ueW9aV0FPNFA5SjlxZ0s4Y1NBSm1XN3RaWVptSkEzMndodmhsUWlEMlNuekluOWJ5YjJreHc1SndIWV9adzBPM3Fqeld4Z293?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Jul 2024 07:00:00 GMT",
        "title": "Analyst Predicts Parabolic Rally for Ethereum After Correction, Updates Outlook on Solana and FLOKI - The Daily Hodl",
        "content": "A closely followed crypto strategist believes that the current market correction is setting up Ethereum (ETH) for a parabolic surge at the end of the year.\n\nPseudonymous analyst Inmortal tells his 214,800 followers on the social media platform X that Ethereum will likely consolidate between $4,000 and $2,800 in the coming months.\n\nThe trader shares a chart suggesting that Ethereum will witness a year-long parabolic rally starting in October that will eventually send ETH to a new all-time high at around $8,000.\n\n“Capture this.\n\nETH.”\n\nAt time of writing, Ethereum is worth $2,903, down over 4% on the day.\n\nLooking at Ethereum rival Solana (SOL), Inmortal believes that the large-cap altcoin is at risk of seeing much lower prices unless it can rally past $160 to develop a bullish higher high structure.\n\n“Bulls defending $120 level, taking no prisoners. I don’t want to see the bouncing ball structure develop. A higher high would be key.”\n\nAt time of writing, SOL is trading at $130, down over 8% on the day.\n\nAs for the meme token Floki (FLOKI), the trader thinks that the altcoin is flashing a bullish setup similar to its April 2024 price action when it briefly traded below support at $0.00016 before rallying.\n\n“FLOKI about to print the famous deviation + retest structure.”\n\nAt time of writing, FLOKI is worth $0.000135, down over 10% in the past day.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiygFBVV95cUxONDYwWFN0QzViRF9WZXo5VDhiYkNPYXFmelJ4RHhlM0xHRE15TENDTHY3OVdvNjAwRXgzd1FtZHUyeUxKU2dZVjdXM2tDS2F0QUxJdWpJTDk5UVRBaWZ0MnJmWktCbkF4U3RrNGtTVE9EUzJ5X0NtS3IwWWU1dkxLVWMybVlSWWlob0xWc1R6U2tfaXdTLXhVYXpBZVN0X3Q0VU9tSnFUV1pOY0NlYzNsSmswS0lmTlFKWndQZU1OS1Q1Y1BCZmN3R25B0gHPAUFVX3lxTE9Xa3NMZUZOTm01Zk9zam1oRDQtbXZ3WlIwc2JCTVktZDdXeHpQLUFSdHAzMWtLRXFhVjA0T1IyTXM5NjhoVGJCV1Q4bWVKMm1aeUhWX1pnRzZxQ0o0N0NQTFh3OVRTOU1Melo2YWRyd3hiRGE0eHd4bGFWc1ZEWDl6U1V5TDd4VUtfcWRZaktha0ZYa0Nnb3FoTUQwa2VTeVJ2Q1lTQTVUUER6ZkJFYmxQOVlIQzJ3dS1OZlRMLUhXenVFZ015ZHNnQXdtQ1lpUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Jul 2024 07:00:00 GMT",
        "title": "Is EIP-7732 the Key to Unlocking Ethereum’s Full Potential? Developers Propose Validation Upgrade - Crypto News Flash",
        "content": "Ethereum developers are set to address the inefficiencies within the network through a new EIP-7732 proposal.\n\nThe Ethereum blockchain has been outshined by Pump.fun in revenue height as the Solana-based platform edges the blockchain giant by transaction cost.\n\nEthereum (ETH) developers introduce a new Ethereum Improvement Proposal, EIP-7732, to offset the challenges of inefficiencies while revolutionizing the block validation process and enhancing the speed of the blockchain.\n\nAccording to our review of this comprehensive proposal, EIP-7732 would bifurcate the block validation process into distinct consensus (consensus proposer) and execution phases (execution proposer) using an approach known as Enshrined Proposer-Builder Separation (EPBS).\n\nPer our research, the consensus proposer would control the selection of the execution proposer which would then produce a valid block consisting of payment or block hash for the consensus proposer. In so doing, the functionality of the blockchain would be greatly optimized to meet the needs of the growing user base.\n\nThe Need For This Proposal\n\nOver the years, delays and inefficiencies have been a gross challenge within the Ethereum network triggered by the need for validators to perform both consensus and execution tasks. To address this, the proposed validation upgrade would enable validators to concentrate on immediate consensus validation and defer execution validation without compromising network performance or security. On top of this, an effective exchange would be encouraged between builders and proposers.\n\nAdditionally, the proposal advocates for a trust-free exchange between builders and proposers, ensuring payment and the inclusion of valid blocks without the need for middleware. This aspect is crucial in simplifying the block validation process and enhancing the overall user experience on the Ethereum network.\n\nPrior to this exciting development, Ethereum co-founder Vitalik Buterin reinstated the importance of fast transaction confirmation times to the average blockchain user. Commenting on this, he pointed out the considerable reduction of transaction confirmation times to between 5-20 seconds following the successful implementation of the EIP-1559.\n\nEthereum Blockchain Falls Behind Pump.Fun, Whale Faces $30M Liquidation\n\nAmid the backdrop of the validation upgrade, the supremacy of the Ethereum blockchain in terms of revenue height has drastically been reduced as token launchpad Pump.fun amasses $2 million in daily revenue against Ethereum’s $1.91 million. According to experts, Pump.fun’s historic milestone hinges on the Solana blockchain which has relatively low transaction costs compared to Ethereum.\n\nEthereum’s native token ETH, has also been severely affected by the ongoing market pullback, causing the asset to lose 10.42% of its value in just a week to fall from $3.5k to $2.8k. At press time, ETH had recorded a little gain of 0.08% in the last 24 hours, trading at $3000.\n\nAccording to LookOnChain, the ongoing volatility puts an Ethereum whale at risk of liquidation after creating a substantial long position on the asset. Data suggests that the whale deposited 12,374 ETH ($40 million) into the Compound Protocol, and leveraged the deposit to borrow $31.4 million in stablecoins with a health rate of 1.06. With this, a price decline to $2,984 would force the long position to be liquidated.\n\nData also discloses that another whale purchased 9,425 ETH ($30 million) via a new wallet. In addition to that, he purchased some of the popular meme coins and cryptos including BNB, MATIC, LINK, AVAX, etc. In total, he withdrew $120 million from Binance, making Ethereum the largest single purchase in the portfolio.\n\nRecommended for you:"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiyAFBVV95cUxPaEtaLVc3NkNoY3FhTDk2WW9zMGRFandOcmxqWkZld21YN0hvbUNfcmczSXRJMjBaSDlqMnNRSUlTZDlOSHRUMmRqWXg5QjhpMWlNSDdZXzV4WDB1TzB1SDlGTUFmakduZlNkeW5OQ1dKQ3JEX2xjYUxJRzgzNXR6MmRma2lHZ2xFWHJiNXhFb2s0UWhPdHI4cVRlVFpxeFlWY21BX0Etb2VRWldPUG53aDJLbE9NSTFCVGt4cFg5bUpQcmlfczh3RNIBzgFBVV95cUxQX1BlNnlIb0cyOF9PaWIwV29pclgwWEVfZ0JBSUtFNVk4T1plUVFqOW5tcE9jY1J3WElBVlZnb3lWd2tLSmQ2ajllOTQyVWdrTlVXQ2NsZlBlLVlYV2prZWpQanE4VWZTdVB5ZXdocXlPOWZBRTBQRThIazFmd2M2OFVRcEg2eFdWUDYtVTVuc2RHRDJMc1JpbTZrcklvQjFQaUYxSFB0N0U0M3JRbjNtT2hXSjBlQVp0R3lHMHExRDlpb2s3NEtvWm5fVWUwQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Jul 2024 07:00:00 GMT",
        "title": "Issuers file amended Ethereum ETF S-1s as ETH shows recovery signs - FXStreet",
        "content": "Ethereum ETF issuers have begun filing amended S-1 drafts following the SEC's July 8 deadline.\n\nEthereum long-term holders are depositing to exchanges despite potential rally from ETH ETF launch.\n\nEthereum shows signs of recovery after failing to push below key support level.\n\nEthereum (ETH) is down 0.3% on Monday as prospective spot ETH ETF issuers returned their amended S-1 registration statements to the Securities & Exchange Commission (SEC). Meanwhile, ETH long-term holders are gradually returning to the market after years on the sidelines.\n\nDaily digest market movers: Ethereum ETF Issuers files updated S-1s\n\nAsset managers VanEck, Grayscale, Fidelity, BlackRock, 21Shares, Franklin Templeton and Bitwise have all filed their amended spot ETH ETF S-1 registration statements with the SEC on Monday following the regulator's July 8 deadline for issuers to return their amended drafts.\n\nSeveral top analysts expect the SEC to approve the drafts within the next two weeks as issuers have already completed most of the heavy lifting.\n\nThe SEC approved issuers' spot ETH ETF 19b-4 applications on May 23 but also need to greenlight their S-1s before they can begin trading.\n\nDespite the positives from a potential ETH ETF launch, on-chain data shows that a few ETH long-term holders (LTHs) are slowly returning to the market. According to Lookonchain, Golem, which raised 820,000 ETH for $10.12 per coin during its ICO — has moved 26K ETH worth $78 million to an address. In turn, the address sends the ETH to exchanges, including Binance, Bitfinex and Coinbase.\n\nSpot On Chain also reported that a whale who had held onto its tokens for about 1.5 years moved 7,240 ETH worth $21.4 million to Kraken exchange at an estimated profit of $12.8 million.\n\nMeanwhile, Immuenfi and the Ethereum Foundation announced the launch of Attackathon, a time-boxed audit competition aimed at improving Ethereum's security. Attackathon would also feature an educational program to boost security researchers' understanding of the Ethereum ecosystem.\n\nThe Ethereum Foundation has seeded the event's reward pool with an initial $500,000 while calling on sponsors in its ecosystem to contribute.\n\nETH technical analysis: Is this the beginning of a recovery?\n\nEthereum traded around $2,975 on Monday, down about 0.3% on the day. ETH's slight increase earlier in the day saw shorts suffer over $49 million in liquidations, with long liquidations slowing down to around $44 million, according to Coinglass data.\n\nETH retested the support around $2,800 to $2,852 again on Sunday but failed to sustain an extended move below it for the second consecutive time as prices quickly bounced above the $3,000 psychological level.\n\nETH/USDT 8-hour chart\n\nAs mentioned in a previous analysis, this level has proven to be a crucial support during downtrends experienced in April and May. Hence, ETH will likely continue to face strong buying demand around the $2,852 support level.\n\nThe chart also shows ETH posted a double bottom, a pattern that signifies potential seller exhaustion due to failure to break below a key support level — $2,800 to $2,852 in this case.\n\nETH could repeat the pattern it followed between April 12 and May 21, where it crashed from $3,550 before sustaining a horizontal movement for a while and then spiked following the SEC's U-turn to approve 19b-4 filings of spot ETH ETF issuers. If ETH repeats such a move, it may consolidate for a few days and then see a potential spike when spot ETH ETFs begin trading on exchanges.\n\nETH Liquidation Heatmap\n\nIn the short term, ETH could briefly move to the $3,104 price level, where there is a liquidation wall of $2.94 million."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxPcGFVd1dmR3BQb1BENjZCazNVY3dzSlpqZjN3dWx3V2paYS1NOUxJSWItRG9VZ3N3ZHZ3Z3VPQjZzU2FxZnNORGpQMEFyekZlWXhRdHJtdi1GR2JTMDctVVFoV1Rsc0hkanB0bi1PME1kOGhBdkp6WXBQSnBQS1VHY1M2d2dFN2h1WXV1QnlwQ0hjVXA5ODdhNk1LQlpXbjFINzY5NFlNZ2lfdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Jul 2024 07:00:00 GMT",
        "title": "Crypto Market Shows Record Levels of Fear: Here’s What Happened Last Time to Ethereum Tokens - Crypto Times",
        "content": "Currently, the state of the crypto market can be expressed as extremely bearish, with a notably negative impact on the Ethereum token ecosystem. This sentiment is captured by the Fear and Greed Index, which hit a low of 20, an extreme level of fear prevailing in the market.\n\nThe volatility surrounding virtual assets has instilled fear among investors, resulting in a rush to exit and, consequently, a fall in price.\n\nThis is not the first time Ethereum tokens have dipped from the ‘fear factor,’ but RCO Finance (RCOF) offers safety for the Ethereum ecosystem. Let’s examine past episodes of extreme market fear and how Ethereum tokens persevered through them.\n\nExtreme Fear Grips the Crypto Market\n\nThe Crypto Fear and Greed Index, a preferable sentiment tracker, has fallen to levels last observed in the second half of 2022. It currently stands at 26, pointing more towards a side of extreme fear in the market rather than extreme greed.\n\nThis shift in sentiment stems from several factors: The future decline of Mt. Gox, Germany’s decision to sell some of the Bitcoins, and macroeconomic factors. This has caused major crypto prices to drop, and Bitcoin and Ethereum have recently been worst affected.\n\nIt is important to note that panic has been witnessed in the crypto market before, indicating that previous events can help understand the current situation.\n\nPrevious Instances of Extreme Fear in the Crypto Market\n\nExtreme fear has occurred in the crypto market at some point in the past, and such events reveal possible tendencies regarding how the market will respond this time.\n\nThe 2022 Crypto Winter\n\nThe most recent extreme fear of cryptocurrencies was experienced during the 2022 crypto winter. “Influenced by factors such as regulatory risk, macroeconomic issues, and the failure of projects such as Terra/LUNA, the Crypto Fear and Greed Index fell to levels not observed since the bear market 2018.\n\nDuring this period, the ether price dropped, and almost all the newly developed Ethereum altcoins faced a decline in value. However, the market emerged, so the Ethereum community became active and started using Ethereum and its altcoins.\n\nThe 2018 Bitcoin Crash\n\nOne other major example of the extreme rear in the crypto market is the 2018 Bitcoin crash. Bitcoin and other forms of crypto surged in late 2017, and Bitcoin rose almost to $20000.\n\nBut it was succeeded by sharp declines, with Bitcoin’s value falling to less than 20% of its preceding value. During this period, the Crypto Fear and Greed Index reached lower lows as demands for digital currency plummeted due to a bearish trend.\n\nHowever, good sense prevailed, and the market finally calmed down as the crypto ecosystem grew and developed further.\n\nNavigating the Uncertain Landscape\n\nAs the broader cryptocurrency landscape grapples with uncertainty, a glimmer of hope emerges from the past – the last time such fear gripped the market, the Ethereum altcoin sector staged a remarkable rebound. As the crypto world shifts, one project, RCO Finance (RCOF), is ready to capitalize on this shift in sentiment.\n\nRCO Finance (RCOF): “A Beacon of Hope”\n\nBuilt on the Ethereum blockchain, the RCOF token benefits from the network’s growing adoption and strong infrastructure. As the market stabilizes, RCOF offers a promising opportunity for investors seeking stability in Ethereum tokens. It serves as the native currency of the RCO Finance platform.\n\nRCO Finance is a crypto AI trading platform with features like AI robo-advisor tools, Debit cards for fiat conversions, and DeFi lending.\n\nRCO Finance’s goal is to provide a comprehensive platform with a wide range of assets and an interactive system. This ambitious aim and the project’s innovative features have generated significant excitement among crypto enthusiasts, who see it as a potential beacon in the current market.\n\nSeize the Opportunity for a Promised $3000 ROI\n\nThe RCO Finance presale is now live at $0.0127 per token, offering early investors the prospect of significant returns. The Ethereum token is expected to list between $0.4 and $0.6, potentially delivering a 3000% ROI. An initial $50 investment could grow to $1500 at launch.\n\nThe Ethereum token is safeguarded against pump-and-dump schemes and liquidity issues through advanced tokenomics to ensure stability. Additionally, SolidProof, a renowned security firm, has audited the token’s smart contract for security and integrity.\n\nDon’t be a victim of FOMO—invest in RCO Finance (RCOF) today!\n\nFor more information about the RCO Finance (RCOF) Presale:\n\nDisclaimer: This is a sponsored post. The Crypto Times does not take any editorial responsibility for the accuracy, quality and fairness of the published content. We advise our readers to always do their own research before engaging with any products mentioned on our website."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxNYVJrY1gzTk9UcFBSV1V6MjNrNWhYaVVVMFN1TVRPeVpvNWJVVUZTMGhaR01aMXFwUGxnUTRRZzhfclVLVHpwdVZhMXhNSTdHa1BPb0Z2OEo0R1BQNi0zcC1HdWpxdVg1cFFHUnVOeTRyVFduN3FBQVBBNGZJOVNCRURqWEVyZG9DVnFfVllIN0RETTBJ0gGaAUFVX3lxTFBXZkNsZmlRRWxyWFhoTHFpeDZtclRuQzdVOGlwajZpbzZFdU1NaTkxZlFDQTRlQ2hmcmZLek5UME9vMVc4Wm0tRllKZkp5RzhLcnlObXpBMGgwZTB2YlpPZl9zcFpLOG93LUF2cnhMRENGaEZiYVRYWkZkZUg2c2pUZWFZdkl0THNJYlBhWnlxZTZYRC1KMkluZVE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ICO participants sell their holdings: Will ETH fall to $2.5K? - AMBCrypto News",
        "content": "Ethereum ICO participants moved a significant amount of their holdings.\n\nWhale interest and retail interest in ETH declined.\n\nDue to the rising bearish sentiment in the market, the price of Ethereum [ETH] declined significantly, dipping below the $3,000 mark.\n\nInitial coin offering\n\nIn November 2016, the Golem project conducted a successful Initial Coin Offering (ICO), raising a significant sum of 820,000 ETH.\n\nOver a 37-day period, Golem transferred 36,000 ETH to major cryptocurrency exchanges like Binance [BNB], Coinbase, and Bitfinex. This transfer amounted to roughly $115 million.\n\nDespite these transfers, Golem still held a substantial amount of ETH, with a press time balance of 231,400 ETH, valued at approximately $656 million.\n\nThis indicates that Golem maintained a strong financial position and may be strategically planning for future developments.\n\nWhen a large amount of cryptocurrency hits exchanges, it creates sell pressure. This means that more ETH is available for purchase, potentially exceeding current demand and driving the price down.\n\nMoreover, a large holder like Golem moving their ETH to exchanges can trigger speculation in the market.\n\nInvestors might interpret this as a sign that Golem believes the price of ETH is about to fall, leading them to sell their own holdings to avoid losses. This can create a snowball effect, pushing the price further down.\n\nThe sell-off of these tokens wasn’t an isolated event. AMBCrypto’s analysis of Santiment’s data indicated that large addresses were losing interest in ETH and their holdings had declined.\n\nCoupled with that, retail interest had also decreased over the last few days. This indicated a potential lack of overall demand across different investor segments, further increasing sell pressure.\n\nNew developments on the Ethereum network\n\nDespite these factors, development on the Ethereum network continued to soar.\n\nEthereum developers recently held an online meeting to discuss the Pectra upgrade, a major update for the Ethereum blockchain. The upcoming Pectra Devnet 1 launch is on hold waiting for other software updates.\n\nResearchers presented ways to improve data collection on the software diversity used to run Ethereum. Additionally, they debated a new feature to prevent software bugs from disrupting the network.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nThe meeting also included discussions about potentially including further changes in the future, but no final decisions were made.\n\nAt press time, ETH was trading at $2,914.63 and its price had fallen by 3.19% in the last 24 hours."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxNa1VxUzE0bWxDbHpBQ0w5dmRSaXhTMHZpRVd0emRMa3dvcjVXRm9CcnhqOTJOcDBPVEFjTXpTRFc4eUlXemUwZjExUUVERVNtT0lkREdPMmo2UWRCZ3JvTTBLT1ZxSW1XckpKd09SSlZ1Q1RRZnhDNnFwODBUdWVzWg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Jul 2024 07:00:00 GMT",
        "title": "VanEck Officially Files S-1 for Spot Ethereum ETF - Watcher Guru",
        "content": "The $89.5 billion asset management firm VanEck has officially filed an S-1 for its Spot Ethereum ETF. The firm made the filing with the US Securities and Exchange Commission (SEC) on Monday in what is a critical part of the ongoing approval process for the ETH ETF.\n\nBloomberg analyst Erich Balchunas noted that the action should be followed by several similar filings from issuers today. The only exception is Bitwise, who had filed their S-1 last week. The development has led many experts to predict the Ethereum investment product to go live in the next two weeks.\n\nJUST IN: VanEck officially files S-1 for its Spot Ethereum ETF. July 8, 2024\n\nAlso Read: Solana: VanEck Says SOL ETF is More Likely if SEC Fires Gensler\n\nVanEck Files S-1 for Ether ETF\n\nThe crypto market is headed toward a monumental moment, as Ethereum ETFs are near arrival. Approved earlier this year, the ETH investment offering will be the second crypto-based ETF in the United States. Now, a critical development could have the product greenlit sooner rather than later.\n\nAsset manager VanEck has filed an S-1 with the SEC for its Spot Ethereum ETF. According to Bloomberg’s Balchunas notes the filing puts the “ball back in the SEC’s court.” The product had previously been predicted to launch on July 4th, with that now extending to this week.\n\nAlso Read: Ethereum ETF Approval: A Milestone in the Crypto’s Journey\n\nETF Institute co-founder Nate Garaci took to X (formerly Twitter) predicted an impending arrival. Specifically, he forecasted “issuers gearing up for launch in the next week or two.” Moreover, the development could open the door for even more crypto ETFs in the coming year.\n\nVanEck has already waived its initial fee for the Ethereum ETF. The firm also announced it will charge 0.2% if it is able to surpass $1.5 billion in total assets. Conversely, earlier this month, the firm predicted that ETH could reach $22,000 by the year 2030."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxOYXJ1NDYwcVNvdERDWkhtYTFuck1VLVcxXzR0cHNmUzBqc2V0OHE1SmhmUU5vQUZzbFlmdkhaSWdMU3djbl80TlZLTVdSOEdNLXFwVUoyME53MnA4UzJDVWZ6ZUlJUFh5MHd3NzB4ZlRxMWk1RTluNUZTYUw0NW8wd3JtdVltLUVEOHpxadIBkgFBVV95cUxQdXVxQ1JXZlQwcGEwbFEzV0JraV9nT2NDOHpaenNxLW51NUxTRXV0cUl5bU1PY1BOT0hSRXZYaHlzTmQwU2dFMlVUS19nYXpjQ2hHNlltVnpieUpaYUc5YWdESzVkNkd1NThsNF8ydDlxZ2g0N3dlVHMxQnNWeGlPU1NZbGVFcFFORmJhcy1MbFpmQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Jul 2024 07:00:00 GMT",
        "title": "Must Buy Ethereum Meme Coins Before the ETH ETF Approval - CoinGape",
        "content": "The recent hype around the potential ETH ETF is causing investors to scout for Ethereum meme coins to invest in for maximum profits. Ethereum price prediction shows the ETF news is not yet priced in. Furthermore, ETH seems to be following Bitcoin’s trajectory following its ETF approval. BTC’s price retraced after its ETF news before surging to $73,000.\n\nEthereum is a huge network and meme coins are famous for being the best runners during impactful market news. However, not all meme coins are winners. Here are three meme coins to buy before the Ethereum ETF gets approval in July.\n\nadvertisement\n\n1. Ethereum Meme Coins – Turbo (TURBO)\n\nTurbo is the first AI-scripted meme coin in the history of cryptocurrencies. The token, which was launched on the Ethereum blockchain, was created using only a budget of $69 and following guidance from OpenAI’s ChatGPT. The community came in later and crowd-funded the initial liquidity required to launch the project, as the previous $69 was not enough. Turbo is therefore a community token, riding both the meme coin and artificial intelligence (AI) narratives in this bull run.\n\nThe price of TURBO today is $0.003809, a 6.7% drop in the last 24 hours following Bitcoin’s sell-off. Turbo did well following its launch, hitting an all-time high of $0.009632 two months ago before retracing. TURBO’s market cap is currently at $294 million—enough to surge 10–20X and transform investors’ portfolios. TURBO’s 24-hour trading volume is down 16.2% as market participants refrain from trading during these market conditions.\n\nThe AI revolution in the crypto industry is picking up fast, and more so within the Ethereum meme coin ecosystem. Turbo and a few other AI based meme coins may be the first runners if Ethereum gets a win with ETF approval. The current price retrace sets TURBO in an optimal buy-in position.\n\n2. Pepe (PEPE)\n\nPepe is among the top list of the giant Ethereum meme coins that started as a joke, before quickly garnering popularity. The meme coin was inspired by Pepe the Frog, an internet meme by Matt Furie. Furie is also the creator of several other memes on the Ethereum chain, namely, Landwolf, Andy (ETH), Bird-Dog, and Fofar. By extension, these meme coins have the potential to soar along with PEPE.\n\nThe price of PEPE today is $0.000009162, which represents a drop of 2.1% in the last 24 hours. Sitting at a market cap of $3.8 billion, Pepe has fallen by over 50% from its all-time high market cap. This is just an indicator of how volatile meme coins can be.\n\nDespite this fall in price and valuation, the number of Pepe holders is up over 5% in the last month and $0.01% in the last 24 hours per Santiment.\n\nAdditionally, the 24-hour trading volume for Pepe is down by 32% which shows there has been a decrease in market activity.\n\nPEPE price showcased incredible price performance following the announcement of the approval of Ethereum ETF 19-4b forms. Even though this approval was not the real thing since it could be contested, Pepe’s price still soared and hit an all-time high price of $0.00001665 on May 28 before beginning to retrace.\n\n3. Floki (FLOKI)\n\nFloki is one of the older meme coins that came out right after Shiba Inu’s rise to popularity. Having been around for three years, Floki’s creation drew inspiration from Elon Musk but has since transformed from just a meme coin to a recognizable brand all over the world. Floki has over 480,000 holders and boasts multiple partnerships with sports clubs, DeFi protocols, and popular blockchain companies.\n\nFloki price is trading at $0.000149, a 2.4% price surge in the last 24 hours. The meme coin has had three major peaks in its lifetime, one in November 2021 and the other two within the March-June period. The price action of Floki formed a potential double top, which may result in a further drop in price to $0.00003500. If the current support holds, Floki may enter into a consolidation zone between $0.00033 and $0.00015.\n\nBeing an ERC20 meme coin with a large holder base, Floki may be one of the top Ethereum meme coins to run hard in the case of an ETF approval.\n\n4. Apu Apustaja\n\nApu Apustaja is a recent meme coin on the Ethereum blockchain. It gained popularity on the anonymous chatting platform 4Chan and quickly rose to prominence, hitting a $28 million market cap. However, the developer began dumping their holdings and eventually abandoned the project near its all-time lows. In response, the community took over the project, driving it to a new all-time high market cap of $311 million on May 21.\n\nAt the time of writing, the price of Apu hovered around $0.000494, marking a 16.6% increase in the last 24 hours. Apu is one of the few tokens to rebound with double-digit gains following Bitcoin’s recovery. The meme coin found support around the $100 million mark and has tested this level twice in the past three weeks.\n\nCommunity takeovers (CTOs) are becoming a prominent narrative in this bull cycle, and Apu exemplifies this trend through its price history. With the potential for further market recovery, Apu shows promise for future price surges, especially if the Ethereum ETF receives approval.\n\nBottom Line\n\nThe potential Ethereum ETF approval anticipation fuels interest in ERC20 meme tokens like Pepe, Floki, and Turbo. These Ethereum meme coins command attention for their ability to potentially return high rewards in a short period of time. As we approach the expected decision day, price volatility in the crypto market may increase.\n\nFrequently Asked Questions (FAQs) 1. Whe will ETH ETF be approved? According to speculations, an ETH ETF approval is expected around mid-June. 2. Can Ethereum reach 6,000? Some analysts say that Ethereum can pump to 6,600 after ETH ETF approval. 3. When was a Bitcoin ETF approved? The first Bitcoin ETF was approved on January 10, 2024.\n\nRelated Articles\n\nEvans Karanja Evans Karanja is a crypto analyst and journalist with a deep focus on blockchain technology, cryptocurrency, and the video gaming industry. His extensive experience includes collaborating with various startups to deliver insightful and high-quality analyses that resonate with their target audiences. As an avid crypto trader and investor, Evans is passionate about the transformative potential of blockchain across diverse sectors. Outside of his professional pursuits, he enjoys playing video games and exploring scenic waterfalls.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxQdEpRSlUxYjdJMGdiRG5TeHNsUGV2ZFFVTjAyY1lWQTJHOEl0OHZtT1ZsSldreWYydjZ3ZjVkd2FPQTBSODd4SFJhN0gzOWJVOWhENUFFY1FSZXBTTUd4THN4c015YWlVNzR2YmlQYlJ5endSZWNPQ1U0a216ak9CS3hWSmRnYnlCZ29mbjctUGZLZ05JNFHSAZsBQVVfeXFMUEs5WXZRN19HblZWWEJmWlNUNHpIbklZb0pkNmhNLTdEeUk3YmJFcC1OUDZnLXNoVFJkbXMxbzJCcDJmQ05FbGlCR0pxSFRIREhrSldCV3pvNGxkbjRCOXlOQ0hTSVE3OU1sb291WFRuSzQyNTRQM1VhUVpSSXVTZFk5NU4zcml6eWVuYXZQY3FCaUtaSG9zNWpGYXM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Jul 2024 07:00:00 GMT",
        "title": "Vitalik Buterin’s transfer of 100 Ethereum raised eyebrows: What’s next? - AMBCrypto News",
        "content": "Buterin’s transfer amid market downturn sparked speculation on ETH’s sentiment impact.\n\nETH held steady with moderate losses, contrasting sharply with other cryptocurrencies’ declines.\n\nEthereum [ETH] co-founder Vitalik Buterin sparked intense speculation within the crypto community with a significant transfer.\n\nMany investors assumed that Buterin was making a strategic move or possibly selling some of his holdings.\n\nClearing the air around Buterin’s move\n\nHowever, things got clear when Wu Blockchain shared more details.\n\nInterestingly, Buterin’s move coincided with a broader market downturn, as the global crypto market cap hit $2.05 trillion at press time, down 2.67% in the past day.\n\nNow, whether Buterin’s move will shift ETH’s market sentiment from bearish to bullish remains to be seen.\n\nAs of the latest update, the largest altcoin was trading at $2,946.55, reflecting a 1.98% decline over the past 24 hours.\n\nThis decline is relatively moderate compared to Bitcoin [BTC], which dropped by 2.40%. Solana [SOL] and Ripple [XRP] experienced declines exceeding 4% and 3%, respectively.\n\nBut despite the recent market decline, AMBCrypto’s analysis using IntoTheBlock data indicated that buying pressure continued to exceed selling pressure among bulls and bears.\n\nIs crypto adoption on the rise?\n\nNeedless to say, the launch of Bitcoin ETFs has pushed Bitcoin into the spotlight. Of late, the king coin has attracted attention from Wall Street, major institutions, and the political sphere.\n\nWhile this surge is often seen as a step forward for cryptocurrency adoption, it primarily revolves around Bitcoin rather than the broader crypto market.\n\nAgainst this backdrop, Buterin’s recent actions could boost ETH adoption, especially considering investors’ losing interest in ETH fueled by the delay in ETH ETF approval by the SEC.\n\nVitalik Buterin’s financial influence\n\nAccording to a recent report published by on-chain analytics firm Arkham Intelligence, Vitalik Buterin remains the largest individual holder of ETH.\n\nHis net worth has climbed from $552.86 million at the start of 2024 to $834.66 million.\n\nHis holdings of approximately 245,279 ETH fluctuate with Ethereum’s market prices.\n\nDuring the 2021 bull market peak, ETH’s value propelled his net worth above $2 billion, though subsequent downturns in 2022 reduced it by about 75%.\n\nDespite market volatility, Buterin’s strategic investments and pivotal role in Ethereum continue to solidify his financial influence."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxNYkF3dWt0ZUtJU0Fib09TdzRmbzM1VUZ0QjlTM2tFM204cnZMem1yQnFSR2oteldvWXByenJ0SG5TS0lDXzA4N3k2SUZNR1lBUXd5ZzYzNkUxeHZaTzllTmdjTWNSeFZGTHFMa0dqU0M1cml6ZG9Id0pEcWhHOTBoQXJpWFgtSkhhZGlLaDVVaHZlcHdYcllWOEIwb9IBoAFBVV95cUxNbUZCQkdqeTltcTEyTTJ6NjNLLWI2Q2dDN3ZYSEswS0VQdkF5Vk94U3ctRjA0aGdDajE4NmNjTUY0MlZBWGRmV0lya2ZiaGNDRERwRjJ1RWN4TjdTYWVYeW1YN1dtcG94aGdXMkdZMHBGSnEzdmM0eXpoNDI4REszYW1zQXF0NjYtbDFDQ2txMkxuWHJ2T2lNMkpuaWZHNVRL?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 07 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis: ETH Holds at $3K but is Another Crash Imminent? - CryptoPotato",
        "content": "Ethereum has recently experienced increased selling activity, breaching the 100-day moving average and leading to a substantial decline toward the 200-day MA.\n\nNevertheless, the price faces a significant support region, possibly leading to a temporary period of consolidation correction in the mid-term.\n\nTechnical Analysis\n\nBy Shayan\n\nThe Daily Chart\n\nA close examination of the daily chart reveals that after an extended period of corrective retracements near the crucial 100-day moving average at $3386, sellers ultimately gained control, leading to a break below this key MA.\n\nGiven that this area was filled with buying interest and demand, the breach caused a notable long liquidation cascade, accelerating the bearish momentum. As a result, the price plummeted toward the substantial 200-day moving average of $3096 and breached it.\n\nThis price action clearly indicates a bearish sentiment in the market, with sellers dominating. However, Ethereum is currently hovering around the crucial and decisive support region of $3K and is expected to undergo a period of consolidation before initiating its next major move. If a pullback to the broken 200-day MA occurs, the continuation of the bearish trend will become more likely.\n\nThe 4-Hour Chart\n\nThe 4-hour chart shows that following a period of sideways consolidation above the $3.3K support, the price ultimately faced aggressive selling activity and breached this crucial support region. This breakout led to a notable impulsive downtrend, indicating a long-squeeze event in the perpetual markets.\n\nHowever, Ethereum has landed on the substantial support region of $3K, which has previously supported the price multiple times. This area is likely filled with demand, potentially halting the downward pressures in the short term.\n\nAdditionally, the RSI indicator has dropped below 30, indicating potential short-term market correction before the next significant move. Hence, consolidation is likely in the short term, allowing the market to rest and regain momentum. In this scenario, the price range between 0.5 and 0.618 Fibonacci levels will be the main target for the corrective movements in the short term.\n\nSentiment Analysis\n\nBy Shayan\n\nEthereum has recently seen a rise in selling activity, leading to a significant decline toward the critical $3K support zone.\n\nUnderstanding the key factors behind this rejection is crucial for predicting upcoming price movements. The accompanying chart highlights potential liquidation zones within Ethereum’s price action, providing valuable insights for mid-term strategies by smart money.\n\nThe chart indicates a notable liquidity pool below the crucial $3K. This pool is filled with sell-stop orders from aggressive long positions that contributed to a significant price surge in mid-May. If sellers push the price below the $3K support zone, a massive long-squeeze is expected. This would trigger the sell-stop orders, accelerating the bearish momentum. Traders should closely monitor the price action around the $3K support zone in the upcoming days to determine the cryptocurrency’s trend direction."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxOT0QyRWtZaXQxYTg1TEY1Z3ZlZFE5MVJnVVJKVmtyZEFsR2FnZTBIc1lzWXBNMHFRS1F1Z1g5bUJJREh5T19iUmxkNGtSQ0dKTXdCOEtZVzRlQVVQWGZJTkV6dmdOeVlVRVd3QmxlaXVuZHN1TnhqRW5DREcyc0xXSzRtRXdDRk8tWFF1RENIT2hJMTRKSk1EM3ZFY0pJNUF1NDZHMDZwVHNDb0lUbnhaN3FFQzNVd3ZT?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Jul 2024 07:00:00 GMT",
        "title": "Bitcoin, Binance, Ethereum, Solana and Ripple: The biggest crypto news of the past week - Cointribune EN",
        "content": "Mon 08 Jul 2024 ▪ 6 min read ▪ by Luc Jose A.\n\nBetween groundbreaking announcements, technological advancements, and regulatory turbulence, the crypto ecosystem continues to prove that it is both a limitless territory of innovation and a battlefield of regulatory and economic conflicts. Here is a summary of the most notable news of the past week surrounding Bitcoin, Ethereum, Binance, Solana, and Ripple.\n\nMt. Gox: The creditors’ reimbursement after ten years of waiting\n\nAfter a decade of legal battles and complex procedures, the former bitcoin exchange platform Mt. Gox is finally starting to reimburse its creditors. Founded in 2010 and handling up to 70% of global bitcoin transactions at its peak, Mt. Gox went bankrupt in 2014 following the loss of 850,000 BTC due to a security breach. Reimbursements are made in bitcoin (BTC) and bitcoin cash (BCH) via designated exchanges, with 47,288 BTC already transferred for reimbursements. Creditors must confirm the validity of their accounts to receive their compensation. However, this news has had disastrous repercussions on the crypto market, leading to massive liquidations reaching $675 million in 24 hours, primarily due to the sale of the newly reimbursed BTC, which could intensify sales and put pressure on the price of bitcoin.\n\nEthereum introduces EIP-7732 and shifts into high gear\n\nEthereum developers have introduced EIP-7732, a proposal aimed at revolutionizing block validation on the blockchain by separating the process into two parts: consensus and execution. This initiative, supported by Vitalik Buterin, proposes the Enshrined Proposer-Builder Separation (EPBS), which divides block creation between a consensus proposer and an execution proposer, with the Payload Timeliness Committee (PTC) overseeing the timings. The goal is to reduce the computational load of validators, thus increasing the efficiency and speed of transactions, now confirmed between five and twenty seconds. This advancement could strengthen Ethereum’s competitive position, requiring a complete network upgrade and community approval.\n\nPanic in the crypto market: Bitcoin and Ethereum collapse\n\nA shockwave hit the crypto world last week, with a sudden drop of 8% for Bitcoin and over 10% for Ethereum in a few hours. This dramatic plunge led to massive liquidations of $580 million, notably on heavily leveraged bullish positions that couldn’t withstand the price drop. The massive fund movement from Mt. Gox, transferring over $2.7 billion in bitcoins to a new address in anticipation of reimbursements, intensified the selling pressure. Meanwhile, the liquidation of part of Germany’s bitcoin holdings added to the uncertainty. Traders, already nervous about macroeconomic uncertainties and upcoming US presidential elections, reacted by selling off their positions massively, leading to significant losses. This increased volatility plunged the fear and greed index to alarming levels, leaving the market’s short-term outlook uncertain.\n\nSolana sets new records with its memecoins\n\nThe memecoin universe on Solana is experiencing unprecedented excitement and has recorded performances exceeding all expectations. After a rocky start, Solana has managed to establish itself as a key player in the meme crypto sector, surpassing Ethereum by 800% since the beginning of the year. This success is attributed to Solana’s ability to attract talented developers and create an environment conducive to the growth of memecoins. Meme cryptos like Dogwifhat (WIF), Bonk (BONK), and Billy (BILLY) have contributed to this rise, with Dogwifhat soaring by 12.34% in 24 hours and Billy seeing its market cap explode by 97% to reach $117 million. The Solana community, technological innovations, as well as the support of celebrities and investors have been key factors in this dynamic. Solana now dominates the memecoin sector with a market share of 9.64%.\n\nRipple teams up with crypto exchange Binance to counter the SEC\n\nRipple is taking advantage of a recent court decision in favor of Binance to strengthen its defense in its litigation against the SEC. On June 28, the United States District Court for the District of Columbia partially dismissed the SEC’s accusations that certain cryptocurrency sales by Binance were equivalent to securities sales. Ripple quickly seized this opportunity, noting that the court adopted logic similar to that of Judge Analisa Torres in its case against the SEC in July 2023. Judge Amy Berman Jackson distinguished secondary market sales from institutional sales, criticizing the SEC’s approach of regulating the bitcoin and alternative crypto industry through litigation without providing regulatory clarity. Ripple sees these observations as supporting its argument on the necessity of clarifying the legal status of cryptos, questioning the severity of the penalties demanded by the SEC.\n\nDiscover our newsletter This link uses an affiliate program.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxNOGxobE8wY1J6Z2ViNFZhLTFRT0hnYjRHeTYwM1BaRWdhaHdCSVVzZDB5QXcyYmRJOG1Ld2VNdlVxMFpQUTM1WHBEMjJ0ZDNwUFZ6WXhodVktR1RiTXNJQWZSZGp3VV9tbFFXb3Z2ME41bVN4UmszaFBvdkY5Zl9COQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Jul 2024 07:00:00 GMT",
        "title": "Justin Sun Announces Gas-Free Stablecoin Solution for Tron and Ethereum - Yahoo Finance",
        "content": "Justin Sun Announces Gas-Free Stablecoin Solution for Tron and Ethereum\n\nTron founder Justin Sun has announced his team's development of a gas-free stablecoin solution. In a post on July 6, Sun explained that this new stablecoin would allow transfers without requiring any gas tokens, as the fees would be covered by the stablecoins themselves. However, he did not provide specific details on how this mechanism would function.\n\nSun plans to integrate this innovative solution on the Tron blockchain by the fourth quarter of this year, and will “later support Ethereum and all EVM-compatible public chains.” Sun believes that this gas-free stablecoin could revolutionize the way companies offer stablecoin services, significantly boosting blockchain adoption. \"I believe that similar services will greatly facilitate large companies in deploying stablecoin services on the blockchain, elevating blockchain mass adoption to a new level,\" Sun posted.\n\nCurrently, Tron leads the market in peer-to-peer stablecoin transfers, consistently processing two to three times the volume of Ethereum, according to blockchain analytics firm Artemis. Tron hosts over $50 billion of Tether's $112 billion in value issued across multiple blockchains, based on data from DefiLlama.\n\nThis new solution could position Tron as a competitor to PayPal's PYUSD, which offers certain U.S.-based users the ability to make free cross-border payments. Additionally, Circle's USD Coin (USDC) on Ethereum layer-2 Base via Coinbase Wallet also allows for free transfers, highlighting a growing trend towards cost-free stablecoin transactions."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxNZnhsSVNEUnNqTWpJY2NlSGFCc3ZnYnVybVU3UmRLNmI1eHNwN0hrU0VOMzE1WTJuNDVMWDg2aV9zRUgwY2FpUG14NUdPUU9YSkZnTlB2XzFNdWw0V0tIblNSOTU2eGFZRGtUNlRwTTBOWWs4aWx4YVNMZC12QlhQSWpLM2hjSl9mRjhBZmplMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 07 Jul 2024 07:00:00 GMT",
        "title": "Here's How Ethereum ETFs Will Disrupt the Crypto Market - Cointribune EN",
        "content": "Sun 07 Jul 2024 ▪ 5 min read ▪ by Mikaia A.\n\nEthereum ETFs are about to get SEC approval, marking a major turning point in the crypto world. Even Gary Gensler, the SEC Chairman, seems to be in favor of this development. Discover how this approval could shake up the crypto markets and what it means for investors, according to John Glover, Chief Investment Officer at Ledn.\n\nInevitable Approval of Ethereum ETFs and Investor Rush\n\nEven Gary Gensler, the SEC Chairman, is not against Ethereum ETFs. This says a lot about the evolution of cryptocurrency regulation. Gensler, known for his caution, recognizes the growing importance of crypto assets in the global financial system.\n\nIt seems that the era of Ethereum ETFs is imminent.\n\nJohn Glover, Chief Investment Officer of Ledn, views this positively. According to him, the approval of ETH ETFs could not only legitimize Ethereum as an investment asset but also catalyze a new wave of institutional investments.\n\nGlover highlights that the approval of ETH ETFs could attract new investors who were previously hesitant to enter the crypto market.\n\nHe also anticipates an increase in liquidity and price stability thanks to a better market structure.\n\nFurthermore, he sees this development as a way to reduce the often-criticized volatility of cryptos.\n\nThis optimistic outlook comes with many expectations and fears.\n\nIf the approval of Ethereum ETFs materializes, it could very well mark the beginning of a new era where crypto assets are more seamlessly and securely integrated into traditional investment portfolios.\n\nJohn Glover’s Opinion, Chief Investment Officer at Ledn, on Ethereum ETFs\n\nThe Potential Impact on the Crypto Market\n\nThe arrival of Ethereum ETFs could significantly shake up the crypto ecosystem. John Glover explains that the impact of these ETFs on the market could be twofold.\n\nFirstly, they could bring a new wave of legitimacy to Ethereum, encouraging financial institutions to invest. Glover compares this situation to the introduction of Bitcoin ETFs, which significantly increased institutional interest and Bitcoin’s price stability.\n\nHe believes that Ethereum ETFs could follow a similar trajectory, stimulating interest and confidence in Ethereum.\n\nSecondly, Ethereum ETFs could improve market liquidity in the crypto space. Glover asserts that this could result in reduced price volatility, a point often cited by cryptocurrency critics.\n\nWith more liquidity, sudden and erratic price movements would become less frequent, making Ethereum a more stable and attractive investment for conservative investors.\n\nAdditionally, the increase in liquidity could facilitate large-scale transactions, making the crypto market more efficient.\n\nFinally, Glover mentions that the approval of Ethereum ETFs could serve as a catalyst for other financial innovations in the crypto sector. For example, we could see the emergence of new financial products based on Ethereum, such as investment funds and more sophisticated derivatives.\n\nThis would help diversify and enrich the crypto ecosystem, attracting even more investors.\n\nGlover’s Optimistic Projections\n\nJohn Glover is adamant: the approval of Ethereum ETFs is good news for the future of Ethereum and the crypto market in general. According to him, this approval could trigger a series of positive market reactions. For instance, K33 Research predicts 4 billion dollars in inflows in just 5 months.\n\nFirstly, it could reinforce Ethereum’s position as a safe haven in the crypto universe. Institutional investors, who have already begun to show interest in cryptocurrencies, might see Ethereum as a viable option to diversify their portfolios.\n\nGlover also emphasizes that this dynamic could attract long-term investments, thereby increasing market stability. He predicts a rise in Ethereum prices in the medium and long term, once the ETFs are launched and adopted by the market. And this despite the recent declines of the crypto prince.\n\nFor Glover, the diversification of financial products based on Ethereum could also pave the way for greater innovation in the sector, with increasingly tailored solutions to the needs of institutional investors.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxQbEJVNnYzTUJyb3hDQWZpVnVXU016cGlwVW54S1g3UTdKWTRndHFGa21EYV82bldGVVhCWXpJR0lNS3JBQWxEVkZLcHdLVHIzM1dNeEJNUG9manlkYXR3ZndkUjZqQzlzZVkzUER5dmUtRWJOMl82bktKdHMtTkR1SG1KdXZyMnJka2M3c0hGdDlhQdIBlwFBVV95cUxNQmdiRTVjYlZwUnhUdjVoQ3FKdDNkc1pjbnhaTHpod051cTVta3o0VHNicTVlLWVlZE10ZG5VdDd4RTJ0M1VaTDVLLTdYX0htOGx3T3R5SEtQdmFuTnduS21PVnVIVlBaZ0RhU25CSEVjMHJEY2M1S29jNGxyWlZfLXZXdkRSYU9jRGM2bXpKY18zaGRNOFNz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 07 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis: Will ETH Bounce Back as ETF Launch Nears in July? - CoinGape",
        "content": "Weekends are characterized by a drop in market activity until the following Monday. The lower trading volume and reduced liquidity over the weekend caused crypto assets to stabilize after a recent sell-off. The Bitcoin price found temporary support around $55,000, easing the sell pressure on altcoins. Ethereum price also showed renewed demand around $2900. However, with several analysts anticipating the Ethereum ETF launch around mid-July, there is potential for a major reversal in ETH’s price.\n\nAlso Read: Justin Sun Faces $66M Loss As Ethereum Records 10% Fall, Here’s Why\n\nadvertisement\n\nEthereum Price Analysis Hints $3800 Rally Amid Healthy Pullback and Potential ETF Approval\n\nThe current correction in Ethereum price was initiated in late May as the price reverted from $3974. This fresh lower-high formation of the daily chart indicates the buyers lack sufficient momentum to chase new highs, thus shifting the price trajectory sideways.\n\nThe bearish turnaround tumbled the Ether value by nearly 30% to seek support at the confluence of $1815 and 23.6% Fibonacci retracement level. Along with broader market correction, the U.S. SEC’s delay in approving ETH ETF issuers’ S-1 drafts has contributed to bearish sentiment.\n\nOn Thursday, Bitwise filed an amended S-1 for its spot Ethereum ETF ahead of the July 8th deadline. Bloomberg’s ETF analyst Eric Balchunas highlighted that the SEC’s recent comments required minimal updates, indicating a quick turnaround for Bitwise.\n\nHowever, the filing has no fee details yet, which are expected to be revealed next week. Bitwise’s proactive filing suggests they are expediting the approval process for their Ethereum ETF.\n\nAlso Read: Altcoins To Stake Without Hesitation As Bitcoin Goes Burst\n\nMoreover, the President of the ETF Store Nate Geraci, has expressed confidence that spot Ethereum ETFs will start trading within the next two weeks, mostly around the week of July 15th. Geraci also notes that the ETH price has dropped by over 20% since the unexpected 19b-4 approvals in late May.\n\nWill be *shocked* if spot eth ETFs not trading w/in next 2 weeks… Later next week a possibility, but think week of July 15th more likely. Interestingly, price of eth ↓ 20%+ since “surprise” 19b-4 approvals in late May. — Nate Geraci (@NateGeraci) July 6, 2024\n\nIf approved, the ETH price could defy a sluggish market trend/mild selling pressure and rebound 36% to challenge the downsloping trendline around $3800. A bullish breakout from the resistance is crucial to signal renewed recovery in the Ethereum coin.\n\nTechnical Indicator\n\nEMAs: The 200D EMA at $3080 and 100D Exponential Moving Average at $3330 highlight the immediate resistance against buyers.\n\nRSI: The Relative Strength Index (RSI) dived to the oversold region below 30%, which could attract dip investors in the market.\n\nFrequently Asked Questions (FAQs) 1. What does \"Spot Ethereum ETF\" mean? A Spot Ethereum ETF is an exchange-traded fund that directly holds Ethereum (ETH) as its underlying asset 2. What is the Relative Strength Index (RSI)? The Relative Strength Index (RSI) is a momentum oscillator that measures the speed and change of price movements 3. What is an S-1 filing? An S-1 filing is a registration statement that companies must file with the SEC before going public.\n\nRelated Articles\n\nSahil Mahadik Sahil is a dedicated full-time trader with over three years of experience in the financial markets. Armed with a strong grasp of technical analysis, he keeps a vigilant eye on the daily price movements of top assets and indices. Drawn by his fascination with financial instruments, Sahil enthusiastically embraced the emerging realm of cryptocurrency, where he continues to explore opportunities driven by his passion for trading\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNT3lKWUlJOEVaSWN4cmxNNHl0WVktSl9vRTlZNVZEMkRDdGMzbVBwWmdvZ3hETzJpdkc3enZhNDN5a2JORkl5MXctZVBOVHZCTUFUcHh1aUtmS1Z1RFNDWGJlUWZtTTZKRTZjYll0d3Z3TnFaQUZEd19fSjZMalNlSEZYYnlNdFBuT0c1cNIBkgFBVV95cUxOMXc0cGhUVFNVaVhqaHRyRW04U0ZqallaZVd2YkVaQ0xoNzdlZ2F1VkR5OUlza2xkM1A4UVJjelc0TXdpamRUMXpQelNpbGtLY2pUaDBCVlJ0eWh0YmxEVk51VFNZTDBZSWFYZTN0RHh0Vk9TWl9CYzN1RXB6NTFwZHFTaENUaDZ3Y2RSSThyN2Nkdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Jul 2024 07:00:00 GMT",
        "title": "Solana Outperforms Ethereum Amid $441M Money Inflow Into Crypto - CoinGape",
        "content": "In a remarkable shift, Solana has overtaken Ethereum, attracting significant investment amid a $441 million inflow into the crypto market. With Solana pulling in over $16 million compared to Ethereum’s $10 million, the dynamics of digital asset investments are seeing notable changes.\n\nNotably, this development signals a growing interest in alternative cryptocurrencies as investors seek new opportunities.\n\nadvertisement\n\nSolana Outshines With Robust Weekly Inflow\n\nSolana’s recent performance has caught the attention of investors, as highlighted in a report by CoinShares. Digital asset investment products saw substantial inflows totaling $441 million, with recent price dips viewed as buying opportunities.\n\nMeanwhile, the inflows were primarily driven by the U.S., contributing $384 million, while other significant contributions came from Hong Kong, Switzerland, and Canada. According to the report, Bitcoin led the inflows with $398 million, but for the first time, it accounted for just 90% of the total, indicating a broader interest in top altcoins.\n\nOn the other hand, Solana emerged as the standout altcoin, attracting $16 million last week and bringing its year-to-date inflows to $57 million. This makes Solana the top-performing altcoin in terms of investment flows, surpassing Ethereum, which saw $10 million in inflows but has experienced net outflows year-to-date.\n\nHowever, blockchain equities did not share this positive sentiment, facing an additional $8 million in outflows, bringing the year-to-date total to $556 million. The report suggests that recent selling pressures from the German government’s Bitcoin dump have impacted the market, but savvy investors are leveraging these events as opportunities to invest in digital assets.\n\nBesides, looming concerns over Mt. Gox repayments have also weighed on the broader crypto market sentiment lately.\n\nAlso Read: Matrixport Reveals Ethereum ETF Launch Timeline, Bernstein Targets ETH To $6,600\n\nPotential Reasons Behind The Robust Performance\n\nThe question remains: why is Solana outperforming Ethereum? Several factors contribute to this trend. One significant reason appears to be the ongoing discussions about a potential Solana ETF in the US.\n\nVanEck was the first U.S. firm to file for a Solana ETF with the SEC, which may have fueled optimism among investors, driving robust inflows into the asset.\n\nAdditionally, Solana’s performance in the broader altcoin market has been notable. As investors diversify their portfolios beyond Bitcoin and Ethereum, Solana’s technological advancements and growing ecosystem have made it an attractive option.\n\nThe network’s scalability, lower transaction costs, and rapid transaction speeds position it as a strong competitor in the decentralized finance (DeFi) space. Moreover, regional investment patterns highlight a global interest in Solana.\n\nWhile the U.S. remains a dominant player, substantial investments from Hong Kong, Switzerland, and Canada underscore Solana’s appeal across different markets. This diverse investment base further strengthens its position as a leading altcoin.\n\nOn the other hand, the SEC delaying the U.S. Spot Ethereum ETF approval might have forced some investors to shift their focus toward other low-priced altcoins.\n\nAlso Read: Binance To Delist All Spot Pairs Of These Major Crypto\n\nRupam Roy Rupam is a seasoned professional with three years of experience in the financial market, where he has developed a reputation as a meticulous research analyst and insightful journalist. He thrives on exploring the dynamic nuances of the financial landscape. Currently serving as a sub-editor at Coingape, Rupam's expertise extends beyond conventional boundaries. His role involves breaking stories, analyzing AI-related developments, providing real-time updates on the crypto market, and presenting insightful economic news. Rupam's career is characterized by a deep passion for unraveling the complexities of finance and delivering impactful stories that resonate with a diverse audience.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxPODRCN0RxbTV3NXI1anc2QVdvdkE5SWNyb0ItOHF0blJ1am1DZFZOOXBlQTZDQ0ltRXhHVktySlZzTHU5aWdhSnBjMHVjQ0hFVWV5Y1RXUWRMMW9XYWc0R1gzQUZMdWhwbk50SXVfc3VOV2tZSlJxYWZ1d3hkQlc1WGpWTEhxZ9IBiwFBVV95cUxPc1dLVVdWZWt6RmQzTkVIMVZ6cmlnVlIzTVRUeHIxMU8zdnZsa01Za08xYjhVN29zbXJBWlhqbURZRDZfdzFyQmJUTUEzQTZ0Q3hhOEEyVG1ZUGs3YmZmMjZhcjgtSExSNWhmdlpuVVl1MHpQNmVSUE9kTHVOVU5Eb2plYTR0RDRDaHc0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 07 Jul 2024 07:00:00 GMT",
        "title": "ETF Expert Predicts 2 Weeks Listing For Spot Ethereum ETF - CoinGape",
        "content": "President of ETFStore Nate Geraci does not see any reason why spot Ethereum ETF will not start trading in the next two weeks.\n\nJuly 15 For Spot Ethereum ETF Trading?\n\nGeraci believes that the United States Securities and Exchange Commission (SEC) will conduct all due processes for its approval of spot Ethereum ETF trading this week.\n\nadvertisement\n\nWill be *shocked* if spot eth ETFs not trading w/in next 2 weeks… Later next week a possibility, but think week of July 15th more likely. Interestingly, price of eth ↓ 20%+ since “surprise” 19b-4 approvals in late May. — Nate Geraci (@NateGeraci) July 6, 2024\n\nThis is with the optimistic view that the offering will go live in the next week. In his X post, Geraci stated that he expects the trading to begin by July 15 or around that time. It is worth noting that the ETF expert had earlier shared this same timeline for the spot Ethereum ETF trading approval.\n\nTwo weeks ago, the U.S. SEC returned the S-1 filings that it received from the potential spot Ethereum ETF issuers including BlackRock, Fidelity, 21Shares, Grayscale, Franklin Templeton, VanEck, iShares, and Invesco.\n\nThe document returned by the regulator contained light comments in the feedback to filers. According to people familiar with the matter, the spot Ethereum ETF issuers are expected to submit the S-1 forms with the amendments by July 8. Geraci noted that the last round of S-1 revisions was quite “light” and the regulator will likely clear issuers for trading within the next 14-21 days.\n\nPrecisely, he stated that with the revised S-1 submission for Ethereum ETFs to happen in July, the final S-1 approval from the SEC could arrive around July 12. Therefore, July 15 would be the most probable day to begin trading Ether ETFs, Geraci added.\n\nSEC Receives More Crypto ETFs Applications\n\nGenerally, it is clear that the securities regulator is having some constructive dialogue and communication with the spot Ethereum ETF filers and this may be a good sign. The optimism has even attracted other firms to also submit their filing.\n\nYieldMax, a popular ETF issuer, recently submitted a filing with the US SEC to introduce an Ether Option Income Strategy ETF. The plan is to list the ETF on the New York Stock Exchange (NYSE) Arca, as detailed in a June 21, 2024 filing. This kind of offering is designed to leverage the volatility of underlying Spot Ethereum ETFs for generating profits for investors.\n\nSimilarly, investment asset management firm Hashdex also filed to list a combined Bitcoin and Ethereum ETF. The SEC acknowledged the offering and published a notice to solicit comments from the public on the proposed rule change. The firm may have to wait until the regulator makes a decision on spot Ethereum ETF before its filing is considered.\n\nRead More: Celsius Network Resurfaces With Creditor Lawsuit, Here’s What To Know\n\nGodfrey Benjamin Linkedin Benjamin Godfrey is a blockchain enthusiast and journalists who relish writing about the real life applications of blockchain technology and innovations to drive general acceptance and worldwide integration of the emerging technology. His desires to educate people about cryptocurrencies inspires his contributions to renowned blockchain based media and sites. Benjamin Godfrey is a lover of sports and agriculture. Follow him on Twitter\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE4xalh6OUVIeElEdE1PUlFITi1XbEFsU0p6RXRsd0pZcVpqTWd0Mm81cTdYTDlndkZJeGtCSzg4alJGUTdNX1hpZ1ctZEtIamxoWEh1d1pGWmw4cm1jMUpscmYzbXh0RjA2OEg1RDFXeVFYUy1HbXfSAXtBVV95cUxOdzdnbTV5OXcwY0NTMjByNHJydEl4eEhldGtRYjlnQldXX3FoVUpkel9OYjJqZUFtMHdEM1FDNkJ1NTlZOEYxUVdSVVdPSzl0amJsUHB5XzlhemlRYkNVYnZOaU5RUEJXMUdzMkIzUXp3ckVtSHZ5NUpMY1U?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Jul 2024 07:00:00 GMT",
        "title": "Solana’s memecoin mania: Leads Ethereum by 800% - AMBCrypto News",
        "content": "Solana beat Ethereum in the memecoin sector.\n\nOverall activity on the Solana network surged over the last quarter.\n\nSolana [SOL] was one of the few cryptocurrency networks that witnessed tremendous growth over the last year. One of the reasons for the surge in Solana’s growth was the emergence of memecoins.\n\nSolana beats Ethereum\n\nA recent report by CoinMarketCap highlights a significant trend in the cryptocurrency market for the first half of 2024.\n\nSolana-based memecoins have experienced exceptional growth, outperforming their Ethereum counterparts by an average of nearly 800% year-to-date (YTD).\n\nThis surge extends beyond memecoins, as the Solana ecosystem itself has garnered increased investor attention compared to Ethereum during this period.\n\nWhile this heightened interest may not directly translate to a corresponding increase in network activity, it signifies a noteworthy shift in investor sentiment.\n\nSince October 2023, both the native token SOL and the broader ecosystem, including its memecoin projects, have witnessed a remarkable uptick in both price performance and public interest.\n\nThis momentum has propelled Solana into the forefront of the cryptocurrency landscape, solidifying its position as a competitor of increasing prominence.\n\nAlthough Ethereum currently maintains its dominant position, Solana’s impressive growth cannot be overlooked and suggests a potential future challenge to the established leader.\n\nActivity on Solana soared in Q4\n\nSolana’s network activity experienced a significant surge in the second quarter of 2024. Transaction fees and revenue grew exponentially, exceeding $26 million, a remarkable 42x increase year-over-year.\n\nThis growth reflects a booming ecosystem, further evidenced by the total SOL trading volume reaching a staggering $292 billion, nearly seven times higher than the same period in 2023.\n\nDelving deeper into the network metrics, Q2 2024 saw over 15.3 billion transactions completed, encompassing both voting and non-voting activities. This represents a substantial increase in overall network utilization.\n\nAdditionally, the total value locked (TVL) within SOL’s DeFi protocols skyrocketed to $3.4 billion, reflecting a tenfold year-over-year growth. This surge indicates the growing popularity of Solana for decentralized finance applications.\n\nThe NFT sector on Solana also witnessed explosive expansion. Over 98 million new NFTs were minted in Q2 2024, a staggering 54x increase compared to the previous year.\n\nRead Solana’s [SOL] Price Prediction 2024-25\n\nThis suggests a thriving and dynamic NFT ecosystem within the network.\n\nNotably, USDC, reached a market cap of $2.15 billion on Solana, constituting approximately 70% of the total stablecoin market cap on the platform."
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxOMEJuN2VuV0JUb1NEakVmLU42YnNDT0tGaGZWODhNTGRleFM1QjlFMlZhbzMxUUR1elExcGR4dkthOXN6bEZGWlJzQ1dHTERMTUV2aW5JZGNjS2o3Y3hzdFZJMzFJQkd2N1dUazRyS0hESE9jSjhoc282ZThGclp5S1lxNXBGdEVobjVLN0ZFMkhfZDV4TWfSAZsBQVVfeXFMUFlNTFVfTGtYWldWcy1pdV9sTkI5cnlpdmEwNjFuMm1fc3lTVGJFOHQ3WnZVakNYUEg5N2dWOHRBdTlMVlUzMVdxVDllbDM5WkY0Z0dkd0dTLVl3RUFkZHlIa2ZuZmc0R3YxYzZEMEJ2T205ZXRJdlBTTTMxejRnZW9KUWFJaGJUaXVUOVN1QTRBeHNxX2FibkFTd00?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETH holds $3k as support as ETH Whales flock into new crypto - AMBCrypto News",
        "content": "The cryptocurrency market has been buzzing with activity, especially as Ethereum (ETH) maintains a solid support level at $3000. While ETH continues to hold strong, investors and crypto whales are now shifting their focus to a new player in the market: Mpeppe (MPEPE), a promising cryptocurrency priced at a mere $0.00077. This shift in attention could signal the beginning of a significant rally for Mpeppe (MPEPE), capturing the interest of both seasoned and new investors.\n\nThe Appeal of Mpeppe (MPEPE)\n\nMpeppe (MPEPE) has quickly become a favorite among cryptocurrency enthusiasts, thanks to its unique approach and strategic positioning. Unlike many other tokens, Mpeppe (MPEPE) leverages the popularity of sports fandom and blockchain technology, creating a vibrant community around sports-related activities and meme culture. This innovative blend has resonated well with investors who are always on the lookout for the next big thing.\n\nInspired by the legendary Pepecoin and the talents of professional soccer player Kylian Mbappé, Mpeppe (MPEPE) offers a distinctive value proposition. Its maximum supply of 7.6 billion tokens and an initial price of $0.00077 make it accessible to a broad range of investors, promising significant returns as the token gains traction in the market.\n\nEthereum (ETH) Stability and Whale Movement\n\nEthereum (ETH) has long been a cornerstone of the cryptocurrency market, known for its robust blockchain technology and widespread adoption. Holding the $3000 support level is a testament to ETH’s resilience and investor confidence. However, the stability of Ethereum (ETH) has also led investors to explore new opportunities for higher returns, particularly in emerging cryptocurrencies like Mpeppe (MPEPE).\n\nWhales, or large-scale investors, play a crucial role in the cryptocurrency market. Their investment decisions can significantly impact the price and perception of a token. When ETH whales begin to diversify their portfolios by investing in new cryptocurrencies, it often signals strong potential for growth in those assets. The influx of whale investments into Mpeppe (MPEPE) suggests that these savvy investors see substantial upside potential in this new token.\n\nThe Impact of Whales on Mpeppe (MPEPE)\n\nThe involvement of whales in Mpeppe (MPEPE) is a promising sign for its future. These investors typically conduct extensive research and have a deep understanding of market dynamics. Their decision to invest in Mpeppe (MPEPE) indicates a high level of confidence in the token’s potential for growth.\n\nWhale investments can lead to increased liquidity and stability for Mpeppe (MPEPE). As more whales enter the market, the token’s price could experience less volatility, making it an attractive option for other investors. Additionally, whale support can boost the credibility of Mpeppe (MPEPE), attracting more attention and fostering a strong community of supporters.\n\nStrategic Tokenomics of Mpeppe (MPEPE)\n\nThe tokenomics of Mpeppe (MPEPE) are meticulously designed to ensure growth and stability. With 50% of the tokens allocated for presale, 20% for liquidity, 15% for games and sports betting, and smaller percentages for the Mbappé treasury and Mpeppe agents, the distribution is strategically planned to balance market stability and community engagement. This careful planning creates a strong foundation for the token, ensuring it can sustain long-term growth.\n\nThe Future of Mpeppe (MPEPE)\n\nAs the cryptocurrency market evolves, Mpeppe (MPEPE) stands out as a promising new player poised for substantial growth. The predicted rally of 1500% is already attracting attention from Ethereum (ETH) investors looking to diversify their portfolios and capitalize on the next big thing. With its unique combination of sports fandom and blockchain technology, strategic tokenomics, and the backing of influential whales, Mpeppe (MPEPE) is well-positioned to make a significant impact in the crypto world.\n\nConclusion\n\nIn conclusion, while Ethereum (ETH) continues to hold strong at the $3000 support level, the emergence of Mpeppe (MPEPE) offers a fresh opportunity for investors seeking substantial returns. The influx of whale investments into Mpeppe (MPEPE) underscores its potential for growth, making it an attractive option for those looking to diversify their crypto holdings. With its innovative approach and strong community support, Mpeppe (MPEPE) is set to become a key player in the cryptocurrency market. For those interested in joining the Mpeppe (MPEPE) movement, the smart contract address is 0xd328a1C97e9b6b3Afd42eAf535bcB55A85cDcA7B. Don’t miss out on this exciting opportunity to be part of the next big cryptocurrency success story.\n\nFor more information on the Mpeppe (MPEPE) Presale:\n\nVisit Mpeppe (MPEPE)\n\nJoin and become a community member:\n\nhttps://t.me/mpeppecoin\n\nhttps://x.com/mpeppecommunity?s=11&t=hQv3guBuxfglZI-0YOTGuQ\n\nDisclaimer: This is a paid post and should not be treated as news/advice."
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxNRjlaOFBRV3VobnNILXBvQWV5X0dfRUZTWEhhMkV2V0QwUlpqVEVpSDBqcVFmYkNYMG9uZ1YzcHVNRFg3MXo4SUxWaExuNWdrSG5vcmQ4UWFIa1B3LTY0c1pGWVNpdU5HdUIwZlAtTjB0ZHRSbUFVUWNwRXpBcWt3OG5TUjBvYUhuOFFUMjVzTC12cFRJRVdMUDBXT1HSAaIBQVVfeXFMTkdGSURPajNGd3VNMzk2eEVVMWZmRzg3bkwzYnVuZE9yRjNDbV80OUU5OVVxaWxnX3JEOEVvYW1WMlpMb0Rhc2JnSXRFbllveFMtN3dya21BdjF2UmRYTlA5cGdQYU16M09sWGcwLTUwUkVfWnZRX20tdmV6WTBSaE9YYmpwbzlOcC1ZTE9NTVNKQXkzN2FoZV94dUpmenJfajZ3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Jul 2024 07:00:00 GMT",
        "title": "Binance’s Ethereum, Bitcoin reserves up in July – Here’s why this is important - AMBCrypto News",
        "content": "Binance published its proof of reserves which showed signs of positive growth.\n\nThe social volume and sentiment around the BNB token declined significantly over the last few days.\n\nBinance [BNB] has been through a series of litigious battles and regulatory scrutiny over the last year. Despite the struggles faced by Binance, the overall state of the exchange remained positive.\n\nThe proof is in the pudding\n\nBinance released its latest, 20th proof of reserves report recently. The report details the cryptocurrency holdings of its users, providing transparency into the exchange’s financial health.\n\nLooking at the user asset breakdown, we see a positive trend in Bitcoin holdings. User BTC assets reached 605,637, reflecting a 4.01% increase compared to 1st June.\n\nEthereum holdings also showed a slight increase of 1.01%, with user ETH assets reaching 4.711 million.\n\nHowever, there was a decrease in holdings for Tether (USDT). User USDT assets fell to 21.51 billion, representing a decline of 2.54% from the previous month.\n\nRegularly releasing proof of reserves reports builds trust with users by demonstrating solvency and the secure storage of their assets. This transparency can attract new users and encourage existing users to hold larger amounts of crypto on the platform.\n\nProblems overseas\n\nHowever, there were some problems that Binance was facing that could cause trouble for the exchange.\n\nOlubukola Akinwumi, the deputy director of the Central Bank of Nigeria (CBN), raised serious accusations against Binance.\n\nLocal media reports allege that Akinwumi accused the cryptocurrency exchange of conducting financial transactions that are typically reserved for authorized banks and institutions.\n\nAkinwumi’s testimony went beyond just the money laundering allegations. He specifically pointed out that Binance allows users in Nigeria to conduct transactions while hiding behind pseudonyms.\n\nThis, according to Akinwumi, directly violates CBN regulations. The central bank mandates that all parties involved in financial transactions must disclose their true identities.\n\nFurther concerns were raised regarding Binance’s peer-to-peer (P2P) platform. This platform facilitates direct transactions between users. Akinwumi highlighted that these transactions involve the transfer of Nigeria’s fiat currency, the Naira.\n\nRead Binance Coin’s [BNB] Price Prediction 2024-25\n\nThese factors can tarnish the image and reputation of the Binance exchange which can even have adverse impacts on the BNB token. At press time, BNB was trading at $509.71 and its price had declined by 0.73% in the last 24 hours.\n\nThe social volume around the token had spiked, however weighted sentiment declined, indicating a growing number of negative comments around the BNB token."
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE5zRHVLcEdIRVFjVW1lRWZFRXo3cl9UTkJMMlpUc25icTcwS2puUktsMXg4QU9DUE1MREozYzBOLUM3VEl0azVkRkFfUnlCRXBrZ0xHV2xXYVpGM0JHenoxVHJLNFowN2Y1cVROUm9EcUPSAXZBVV95cUxNZVdKdGoyRC1rMXZLR3RJR1UxVHRDNkNBbEJuZFRmTWtuZlpMZ2ZzaTNaWjFYdUtqV1l2eUQ3NjMxUVZYbG9JQVlETUVDdUc5MVlXX2NOZURwcS1zN0ZrZEs3MHpxUnB1LVZ2eVp3R3M1XzdZZEtR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Jul 2024 03:51:55 GMT",
        "title": "Ethereum Settles Below $3K: Bearish Sentiment Points to Deeper Decline - NewsBTC",
        "content": "Ethereum price remained in a bearish zone below $3,150 zone. ETH is again moving lower and the bears could aim for a drop below $2,800.\n\nEthereum started a fresh decline below the $3,000 and $2,950 levels.\n\nThe price is trading below $3,000 and the 100-hourly Simple Moving Average.\n\nThere is a key bearish trend line forming with resistance near $2,950 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could correct losses, but upsides might be limited above the $3,000 zone.\n\nEthereum Price Remains At Risk of More Downsides\n\nEthereum price failed to start a recovery wave above the $3,080 and $3,120 resistance levels. ETH started another decline below the $3,000 support zone like Bitcoin. There was a move below the $2,950 and $2,920 support levels.\n\nThe price declined 6% and even tested the $2,820 support. A low was formed at $2,825 and the price is now consolidating losses. The price is showing a lot of bearish signs and testing the 23.6% Fib retracement level of the downward move from the $3,077 swing high to the $2,825 low.\n\nEthereum is trading below $3,000 and the 100-hourly Simple Moving Average. If there is a recovery wave, the price might face resistance near the $2,920 level. The first major resistance is near the $2,950 level.\n\nThere is also a key bearish trend line forming with resistance near $2,950 on the hourly chart of ETH/USD. The trend line is close to the 50% Fib retracement level of the downward move from the $3,077 swing high to the $2,825 low.\n\nThe next major hurdle is near the $3,000 level. A close above the $3,000 level might send Ether toward the $3,080 resistance. The next key resistance is near $3,120. An upside break above the $3,120 resistance might send the price higher toward the $3,250 resistance zone.\n\nMore Losses In ETH?\n\nIf Ethereum fails to clear the $2,950 resistance, it could continue to move down. Initial support on the downside is near $2,820. The first major support sits near the $2,800 zone.\n\nA clear move below the $2,800 support might push the price toward $2,720. Any more losses might send the price toward the $2,650 level in the near term.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is gaining momentum in the bearish zone.\n\nHourly RSI – The RSI for ETH/USD is now below the 50 zone.\n\nMajor Support Level – $2,820\n\nMajor Resistance Level – $2,950"
    },
    {
        "id": 72,
        "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxPU1hzSXNHRTF2eEFIN0ZNcm5ETzVoT1JxLU1vU1I1RXhjUzdlaTNoaEFvcTlBTEZFb0c1SHYtWXFzN0d6VTM4bEVOMkE1UnNQVkdhME0ybkx3QzIyWV9pU1huUnRORWlCNlpfN1Q3SWdDNWhiOEVPRFEzQWpsTXVHSEc3MW5ydTNQbnVuM3E2YV9nTlVPWV9vSEFBeElSYjA4bkRGNWUxcUdvUHZOTWE4WGthSHFBcXRGTmFYNVRiOHF3LVZi?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Jul 2024 07:00:00 GMT",
        "title": "Are Ethereum ICO-Era Stalwart Golem’s $100M Ether Transfers in the Past Month a Big Move or Market Exit? - Coinfomania",
        "content": "Since 2014, the Ethereum ecosystem has been at the forefront of sponsoring and pioneering countless projects and innovations through its nonprofit arm, the Ethereum Foundation. Among these, Golem stands out as an early ICO-era stalwart. Recently, Golem made headlines by transferring over $100 million worth of ether (ETH) to exchanges in just one month. This has triggered speculation — as expected — within the crypto hub about Golem’s ultimate plans and the potential impact on the price of its native token, Golem Network Token (GRN).\n\nIndependent journalist Colin Wu first reported on Golem’s wallet movements, sparking curiosity among crypto enthusiasts.\n\nGolem, a project that raised 820,000 ETH in ICO in 2016, has transferred 36,000 ETH to Binance, Coinbase, Bitfinex, etc. in the past 37 days, worth about $115 million. Currently, Golem still has 231,400 ETH, worth about $656 million. https://t.co/EjLTyeEAmz — Wu Blockchain (@WuBlockchain) July 8, 2024\n\nGolem’s ICO Days\n\nGolem emerged during the ICO bout of 2016, raising an impressive $8.7 million worth of ETH in a mere 29 minutes. Its vision was ambitious: to create a decentralized marketplace for computing power. Users could rent out their unused computational resources in exchange for Golem’s native token, GLM. However, despite its promising start, Golem’s journey has been marked by both highs and lows.\n\nGolem’s main wallet has been on the move, transferring millions of ETH to other wallets, which were subsequently sent to major exchanges like Binance, Bitfinex, and Coinbase, Arkham Intel data reveals.\n\nThese transactions, mostly below $10 million in value, occur daily.\n\nImage via: Golem ether transfers (Arkham)\n\nMarket Speculations and Selling Pressure\n\nThe $100 million ether transfer raises questions about Golem’s intentions. When tokens move to exchanges, it often signals an intention to sell holdings. Large amounts of tokens are rarely held on exchanges for extended periods due to security concerns resulting from past bridges on established CEXs. Speculatively, as Golem’s ETH floods the market, it potentially adds selling pressure, affecting prices and investor sentiment.\n\nDespite its initial success, Golem’s token value has dwindled significantly. Currently trading at around 30 cents with a market cap of $300 million, it’s a far cry from its all-time high of $1.32 in the good old days of January 2018. However, Golem remains committed to development efforts, particularly in artificial intelligence (AI) tools. Their roadmap spotlight released in May highlights their focus on AI-based solutions.\n\n24h Trading Data of GLM. Source: CoinMarketCap\n\nLearning from the ICO Era\n\nGolem’s story reflects broader trends in the crypto space. ICOs, once a popular fundraising method, lost their charm due to regulatory challenges and waning investor interest. Statista report shows that billions were raised between 2016 and 2019, but subsequent years saw a decline. Golem’s journey serves as a cautionary tale for projects seeking sustained success beyond the initial hype."
    }
]