[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPLWhJeGNPbFZnR0ZaWC1iWkFkZ3VFNFJZR0l2UkJkc2F5N0JuM2o1OU5qbTh3bUNSS3p5bnUzUlM3WG1yMnFRMWZqUFR3R0V0d3ZWWkhPOXhVbnNSSkd2V21ldUtnT29BejFNTEFGQ1ZRdXlJWXFtWkZ2UVNuYjZoWEc0NU1CT29IYjg40gGQAUFVX3lxTE9JZXJ5TW5VQW9VcHl2SFFyX3hnTVF6MnFtanhFVmRwU1A1UVl1eVB4aWxGdG5seENxYzlfemp5SUFvbmdzM1d2Y1hfeFFhaXRQLVBZd2FCckZUQWxYLWhrb01TMnk2bVEtNlBZLUdsMW9nTmVFV1pobWFfWmgtTENaMnFyY1NaaVdaVFlvSEZGdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 23 Jun 2024 07:00:00 GMT",
        "title": "Ethereum ETF Approval This Week? Nate Geraci Believes It Is Possible - U.Today",
        "content": "In what could be a pivotal development, anticipation is mounting as experts speculate on the imminent approval of spot Ethereum ETFs. For example, Nate Geraci, the president of ETF Store, has sparked discussion on X by suggesting that approval could come next week.\n\nAdvertisement\n\nGeraci's prediction aligns with the sentiments of industry insiders such as Bloomberg's Eric Balchunas, who foresees an ETF debut as early as July 2, strategically timed to coincide with the U.S. Independence Day holiday.\n\nI’m deciphering this as spot eth ETFs will be approved this week…\n\n\n\nJust me tho. https://t.co/rFrMThytgC Advertisement June 23, 2024\n\nMoreover, former SEC official Jay Clayton echoed the prevailing industry sentiment, reinforcing expectations for imminent approvals.\n\nWhen, not if\n\nThe Ethereum ETF saga unfolds against a backdrop of growing institutional interest in the crypto market, particularly BTC and ETH as two major assets.\n\nCurrently, the SEC is reviewing revised proposals from major asset managers, including VanEck, BlackRock, Grayscale and Invesco Galaxy Digital. These filings, which follow recent updates to their S-1 reports, had also disclosed a management fee in particular.\n\nInterestingly, amid the buzz, Hashdex, a notable player in the ETF arena, has withdrawn its application for a spot Ethereum ETF without disclosing reasons or future plans, but presented a mixed Ethereum and Bitcoin solution.\n\nFor now, all eyes remain on the SEC's upcoming decisions, which could mark a significant milestone in the integration of crypto into the TradFi markets. With speculation high and anticipation building, next week promises to be a potential turning point for Ethereum ETFs."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxNSVRCYUxLSTV6SkZqc1RQNGNSU3Q2SHlyOHhwNnZOVWNIdV9IZEpsTk1lYm11cWZfWjI4OGdqQmhoZXBhTW9mUFI5eWd6M2NNTWxnOEpWdFczZ3k0ZllUcS0xel9Za3I5Y0V3V09GUUVJa25rb3FkUjQ1dTZicmtuUnFFS3IzOHc0Uk9hRXRKaS1GWEV1SW1fcVU1eTUtZW9jbHpETWpMd0VEQUF3R0JBc3JXbUNVdkdSR3ZmWVpXZ29zUzZUMEphMHV0eHA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 23 Jun 2024 07:00:00 GMT",
        "title": "Solana Price Analysis: SOL Traders Could Earn 80% Profits from Ethereum ETFs Launch - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxNUndSbVNhbXJGam5fWDlRajdpMzdHUEZuZVRHQUtLME03MEppcDczbzI2MHRoZzk4Yl9CUjhRQXhaWjVtRWVHbFhxU2FwN253QTVLUmhHTVJrOXFQX1dJejlISVA2aDdTdV9aWDFrd3ZFZEtKcXZfZjY4VXR3ZnE3dEt30gGKAUFVX3lxTE81T1hPRmpIX2RPZFhMREVHSW9TQmJudTZ3Tk15YXhFeXdxZFVWbW1TUWJ6T3FSN0lKSjlGZnZESm5KTnR2RTEwMXN4bFNhOWNBT2NhLTBKc3pxbUVON09uRDhMTExVbTFKUEtzT21NUVBZWWF2YXZlOWtDX3RBRVZHdUFIQVF2a2tnQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Jun 2024 07:00:00 GMT",
        "title": "This Week in Coins: Ethereum Stays Afloat as Crypto Market Sinks - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIllustration by Mitchell Preffer for Decrypt.\n\nIt’s been another uninspiring week for Bitcoin, with the top crypto asset chopping sideways to enter the weekend below $64,500, notching another 2.6% loss in the last seven days.\n\nIt's extra disappointing given how MicroStrategy bought another $786 million in BTC this week, which the company’s founder says it never plans to sell. Still, MicroStrategy’s demand was overpowered by an onslaught of sell pressure from other long-term Bitcoin whales, including the German government.\n\nCryptoQuant noted that the broader crypto market is starting to lose momentum due to a lack of new investor demand. It follows, thenn, that most momentum-based meme coins like PEPE, DOGE, SHIB, and WIF are all down 5%, 9%, 13%, and 25%, respectively, on the week.\n\nAD\n\nAD\n\nToncoin also lost some of its momentum from last week, dropping 10% after previously rising to all-time highs on hype from projects within its gaming ecosystem. It remains a top ten crypto by market cap, and is only $300 million away from overtaking Dogecoin.\n\nDefying the market’s momentum to some degree is Ethereum. Its trading at $3,492 as of writing, hovering within a percent of its price seven days ago as Ethereum spot ETFs inch closer to reality. Multiple asset managers have now unveiled the fee on their ETFs, and Bitwise even published a commercial advertising ETH to old-school TV audiences.\n\nSolana—Ethereum’s top smart contract competitor—was less fortunate, sliding another 6% this week to $134.92.\n\nOne of the network’s high-flying Trump-based memecoins, DJT, amassed a $110 million market cap this week, and made headlines on rumors that it may have been launched by Trump’s team itself. One of the ex-president’s legal consultants later confirmed that the coin wasn’t launched by Trump nor his offspring.\n\nEven crypto stocks couldn’t retain momentum this week. Coinbase (COIN) fell 8%, MicroStrategy (MSTR) fell 1.96%, and DeFi Technologies (DEFTF)—which soared after buying Bitcoin earlier this month—has cratered 29.9% this week after crypto reports spread doubt about the company online.\n\nAD\n\nAD\n\nAll the negative momentum from altcoins this month has many analysts saying the crypto bull market may already be over. Still, BitMEX co-founder Arthur Hayes doubled down on his bullish thesis this Thursday that now is the time to ape into shitcoins and “buy the fucking dip” – before global money printers go brr.\n\nPrices as of 3am ET. Edited by Ryan Ozawa."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxPa085cXVBV0Vjb3JfNllmMzRWYUNUUE5FZXdheUZIaW9uMGhrdjFVNnNMenZrbFJEbkNwU0tiSkdVQmJicEl6cUxfRzR2UG1nUmkxSDAtM0hDSkVhb0hJdllZa1hIZXpQNVdXcWVKZnVnZDVDZTJOai0xSHlvOWZfSTF30gGHAUFVX3lxTE5VZVoyMkl1S01qVkhncXp6aW80MlZGSXZrNklQY2ppRm03RTJYb0JvUFNKa2NkaHlNREs1TUMxczhwWjJFcW9qUTV3Y3A0WnFJZXVObE50dWtEUUJhOVZsbzRKeGFJN2I5MDRhTFlVS0NyZFlKaHlDUkFucy00SXpzTWo0OEZEOA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Jun 2024 07:00:00 GMT",
        "title": "Bitcoin (BTC) vs. Ethereum (ETH): Which Will Win Q3 2024? - CryptoPotato",
        "content": "The world’s number one and two leading cryptocurrencies by market capitalization, daily transaction volume, and crypto exchange volume have almost perfectly tied for ROI from Jan. 1 through the middle of June.\n\nFor comparison, the S&P 500 Index notched up nearly 15% over that same period. But that’s more than the broad stock market benchmark usually makes in an entire year.\n\nSo even during an unusually good two quarters for U.S. stocks, Bitcoin and Ethereum delivered investors four times more ROI. In other words, Bitcoin broke the government’s investment planning tool. Again.\n\nThe average annualized ROI for Bitcoin and Ethereum price performance since Jan. 1 is aces. The top two cryptocurrencies are pacing for a +116% year.\n\nThat’s a return so high that the compound interest calculator tool on Investor.gov does not even allow users to enter interest rates above 100%.\n\nBy the way— if you enter $100 a month into the calculator for 15 years at an estimated interest rate of 15% (above average for the S&P 500), with a daily compounding frequency, you end up with $68,815 in 15 years for capitalizing your country’s economy with a total of $18,100 in contributions.\n\nIf you do the same exercise with Bitcoin or Ethereum profits, and just enter 99% for the interest rate – the result is a little different (more like a bajillion dollars).\n\nQuestion is which cryptocurrency will outdo the other in Q3, or will Bitcoin and Ethereum come remarkably close again to earning the same amount of profit for crypto investors in the next half of the year?\n\nHere are six salient factors that may be worth considering. Some are more bullish for BTC, some for ETH, and some are a wash between the two blockchain network giants.\n\n1. Fed Dollar Inflation (Advantage Bitcoin)\n\nThe center of gravity for the entire global financial system is the U.S. federal funds rate. It represents the cost for Federal Reserve banks to borrow cash from the ultimate lender in the economy.\n\nThe Fed interest rate calibrates the dollar interest rates for loan products all the way down the food chain to store credit cards and pay day lenders. When it goes up or down, so does the rest of the financial economy with it.\n\nBut when it goes up that’s a big headwind that puts downward pressure on prices for stocks and cryptocurrencies. However, when it goes down, there’s a big tailwind for investment products that tends to put upward pressure on their market prices.\n\nIt looks like there will be one interest rate cut for the U.S. dollar later this year. “If all of it happens to be as forecasted, I think one rate cut would be appropriate by year’s end,” said Philadelphia Fed President Patrick Harker on Monday. After the Fed left rates unchanged last Wednesday for the seventh FOMC meeting in a row, Investopedia reported:\n\n“A bevy of tamer-than-expected inflation numbers over the past week has supercharged expectations that a Federal Reserve rate cut is ahead, but Fed officials themselves are proceeding with caution.” “What we’ve been getting is good progress on inflation, with growth at a good level and with a strong labor market,” said Fed Chair Jerome Powell. “Ultimately, we think rates will have to come down to continue to support that. But so far, they haven’t had to.”\n\nMeanwhile, other central bank economies, like those in the United Kingdom and South Korea, are getting antsy to cut rates.\n\nNot if, but when the Fed eventually begins to trim rates back down again, it will be a tailwind for crypto, but especially for Bitcoin – because of its deflationary tokenomics, with a hard supply cap of only 21 million BTC tokens to ever be issued by the blockchain network.\n\n2. DeFi and DApps (Advantage Ethereum)\n\nBitcoin is like digital gold, but Ethereum is like the automotive economy that burgeoned in the 20th Century as a result of the Industrial Revolution. Bitcoin is scarcity in the digital world of cyber abundance.\n\nIt turns out that a world without scarcity is missing something useful. Meanwhile, Ethereum is a vehicle to bring different parts of the economy closer together so they can engage in smart financial markets.\n\nMetaMask, Oasis App, MakerDAO, and Uniswap usage statistics continue to wow in 2024. In February, MetaMask announced a 55% surge in users from 19 million to 30 million in a matter of four months.\n\nThe numbers are almost as high as the 2022 peak for MetaMask installations now. The company behind the Ethereum wallet says those 30 million users manage 100 million accounts with MetaMask.\n\nOasis App is a decentralized app (dApp) built on Ethereum. According to data hosted by BitDegree the app’s balance was worth some $1,769,996,160 in market value Thursday and the dApp had executed 308,620 transactions in the last 30 days (a 100% increase over the prior month).\n\nEthereum MakerDAO is one of those beefy, serious DeFi dApps making the Ethereum vision happen. The decentralized app’s native cryptocurrency, the stablecoin DAI, is a small economy unto itself, with a market capitalization this week exceeding $5.4 billion.\n\nMeanwhile, Uniswap continues to impress. The leading decentralized exchange (DEX) for cryptocurrencies absolutely dominates other DEXs, ranking in fees almost as high as $100 million in total over the previous 30-day period.\n\nThe only Web3 apps to generate more fee revenue in the past month were: Bitcoin, Ethereum, Tron, and Lido.\n\n3. Institutional Adoption (Advantage Bitcoin)\n\nBlackRock CEO Larry Fink noted in March how the Bitcoin exchange traded fund was the fastest growing ETF in history.\n\nBlackRock CEO Larry Fink says the $IBIT Spot #Bitcoin #ETF is the fastest growing ETF in history\n\npic.twitter.com/NOsDlFgROi — Simon Dixon (@SimonDixonTwitt) March 27, 2024\n\nAgainst every other cryptocurrency, Bitcoin and Ethereum both have an advantage in regard to regulatory approval. But against each other, Bitcoin still has a clear advantage going into Q3 2024. Hundreds of millions of dollars flow into and out of the Washington-regulated Bitcoin ETFs daily.\n\nFormer U.S. President Donald Trump now has the confidence to promote cryptocurrency to voters on the campaign trail. Before the last presidential election in 2020, Trump said he was anti-Bitcoin and crypto.\n\nThat is a strong signal of institutional and mainstream crypto adoption for Bitcoin and Ethereum. Trump recently said he wants all Bitcoin to be mined in the United States and he thinks it can help win the AI arms race.\n\nMeanwhile, VanEck announced Thursday that it will be launching the first Bitcoin exchange-traded fund in Australia.\n\n4. Prague Electra (Pectra) Update: (Advantage Ethereum)\n\nThe Dencun Update – the most recent major upgrade to Ethereum – was a massive boon to Ether’s market value on crypto exchanges. Ether price went parabolic buying the news from Jan. 24 until the upgrade happened on Mar. 13.\n\nEthereum devs plan to ship the Pectra upgrade by early 2025, maybe in Q4 2024, so this will be a bullish tailwind supporting ETH price in the background for the medium term.\n\nPectra is short for the Prague-Electra update.\n\nThe Wall Street stock analysts over at TipRanks recently praised the Pectra upgrade in an article featured on Nasdaq for the update’s enhanced rollups and new staking limit for ETH validators: 2,048 ETH.\n\n5. Meme Coins (Advantage Ethereum)\n\nEthereum is still dominating meme coins, but the emergence of fungible token issuance on Bitcoin through the UTXO function using a technique branded Runes and some big hits in Q2 – like Dog Go To The Moon (Runes) – shows Bitcoin is a relevant player in this niche as well.\n\nThrough the Bitcoin Ordinals technique, BTC-minted NFTs remain popular and transacted in volumes of five and ten million dollars daily in June, according to Dune Analytics data.\n\nThe Ethereum meme coin economy, however, is a multi-billion dollar concern that continues to drive capital inflows to Web3 like the world’s gone mad.\n\n6. Competitive Analysis (Advantage Bitcoin)\n\nThe competitive landscape is an important factor in the horse race between BTC and ETH. These are far from the only two cryptocurrencies in the world in 2024.\n\nEthereum grows faster because of motivation from its competition, but it has far more competitors than Bitcoin. Market share in a competitive landscape is a real issue for this currency. It’s not just a technology, toy, or platform; it’s a business.\n\nWhile BNB, Solana, Cardano, Avalanche, Aptos, and a hundred others compete with Ethereum for DeFi market share, there is only one Bitcoin with only 21 million BTC. The Web 2.0 dons, Messrs Jack Dorsey and Mark Zuckerberg, both know the Web3 competition for those oranges is about to get fierce."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxNUGd4aVpFUXNyc0NQTzN1NFloWGZRRVBnVlFfNmtkQWVfWmVWR1l4NmpGak1xYVkySkhud3FSUGljT3lUYjRzOF92SlNnT0treUc3ZzE1cmNjbU9qWkR2S0lLSnRwMk9mSGM0OFdJb1J6dWxKN2F2Zkk1WnUwNldYZ0RPT091RDNBTng0elRKRUZZd0VuZUo5czFtTdIBoAFBVV95cUxOYzBaMkppV1czdTlyNzM4VkdYY0dib0ZRaDNQTVB0eTdkQ0RtMklod3pkR1Y0aGNTdHd6X1JSNW5hM3Jtb0tFeEhrcFp5Y0U2SlF4VW8yeVNORXNkZ0VCV1BfQS1ja0E4NzRVMHotT2hXdDVkQWJTNGtVUVhGdjhBT2ttYU5MdnRTQ2hrcXhvMy0tMElqS21DT082dEx3eGxW?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Jun 2024 07:00:00 GMT",
        "title": "PEPE’s correlation with Ethereum might play out THIS way for the memecoin - AMBCrypto News",
        "content": "Data revealed that the memecoin’s strong ties to ETH could stall further growth\n\nHigh exchange outflows might help PEPE\n\nFrog-themed memecoin Pepe [PEPE] was one of the few top-50 cryptocurrencies to register gains in the last 24 hours. At press time, PEPE was trading at a value of $0.000011, following a 3.35% hike its its value on 21 June.\n\nHowever, AMBCrypto found that the uptrend might not last. One reason for the same may be the memecoin’s correlation with Ethereum [ETH]. According to IntoTheBlock, PEPE’s correlation with ETH was. 0.91 at press time.\n\nETH has strong links with PEPE\n\nThe aforementioned figure was far above the correlation it shares with Bitcoin [BTC], which stood at 0.60. Values of the correlation ranges from -1. to +1. When the reading is close to -1, it means that prices hardly move in the same direction.\n\nHowever, if the reading is close to +1, it means that prices head in the same direction most times. And that was the case with ETH and PEPE.\n\nBut unlike PEPE, ETH did not appreciate on the charts. Instead, it moved sideways, trading at $3,502 at press time.\n\nShould the price of the altcoin continue to consolidate or encounter a decline, PEPE’s price could retrace too. Beyond that, only a few memecoins also jumped, meaning a lot of capital was not flowing into the category to kickstart a rally.\n\nOn the contrary, exchange flows seemed to suggest that ETH might not be able to halt the uptrend. At press time, PEPE’s exchange inflows were 845,000.\n\nMemecoin is in a tight spot\n\nInflows measure the number of tokens being sent into exchanges. When this number is high, it means that selling pressure could be intense, and could probably lead to a price decline.\n\nOn the other hand, Santiment data revealed that the exchange outflows were much higher at 131.07 million. The rise in the outflows means that those accumulating the token are refraining from keeping them on exchanges.\n\nInstead, participants are keeping them in non-custodial wallets. Should this activity continue, PEPE might overlook its strong ties with ETH, and the price could appreciate on the charts.\n\nIf this is the case, the value of the token could hit $0.000013 in the short term. However, traders might not need to be cautious.\n\nThis, because of the holdings distribution data. Consider this – Addresses by holdings revealed the 30-day change of the number of participants buying more of a token at a certain threshold.\n\nIn most cases, the retail cohort rarely impact prices like large investors. At press time, the number of addresses holding $1,000 to $10 million worth of the token had fallen.\n\nConsidering the most recent sell-offs across the market, PEPE might now struggle to keep up with its former bullish momentum.\n\nRealistic or not, here’s PEPE’s market cap in ETH terms\n\nIf this happens, the prediction to $0.000013 mentioned above could be invalidated. Therefore, PEPE’s price could move at the same pace as ETH, and its price might remain around the $0.000011 zone."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxNaXBQLXlNbVE2anRaejVlS3VPMEZha2ZTQ0pIY0V0RFhSWlpBM0tsdkVfbGp0V25EQ2VJQ1VmZndxN0xYN09vNzUycmtiVEZDWmhKcUlCZVFrcjV6RmF0RERDQ2tNenpNdWt3QW5lS1NLUHZobXZqWG5Jc0dCZFFYaVlMYXlQSFh4THowYWZKMk8wRnfSAZgBQVVfeXFMTmRCZUd4V3A2NUZ6ZzQ1QkhxN2NQT3o2RFRWMktWOUlOWUtBVGk0RndRdTZOc1NzZFRKN3ZjUnYtTFg3eXRCbGd2akk0RndseG5SRXRScW11eHdWcm5uZmZaUnVsN3F5eDU1ektqYnBfU0ZKNDVxM2piVGZNVFRYVThLZ2lYNnhEOUIwVzVCUWsxeV8xZ2E4emo?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Classic’s 2024 – Here’s what you should expect from its price - AMBCrypto News",
        "content": "Ethereum Classic (ETC) flashed a general downtrend with decreasing price highs and lows, coupled with diminishing trading volumes\n\nA bearish ‘death cross’ suggested a potential long-term downtrend\n\nEthereum Classic (ETC) has been a staple in the cryptocurrency market, but never expected to go 100x. Still, 2024 is widely anticipated to be a very bullish year for the market, even more so than it has already been. However, things have slowed down recently, and markets have tumbled.\n\nSo, what about ETC? What’s its fate for the rest of the year?\n\nSince late May and into June, the trend has appeared generally bearish as ETC’s price made lower highs and lower lows – A classic indication of a downtrend. This recent decline in price can be coupled with diminishing trading volume – A sign of a reduction in investor interest and market fatigue.\n\nTypically, low volume during a downtrend might suggest a lack of conviction in the sell-offs, but it could also mean that fewer buyers are present to push the price back up.\n\nA hike of +5.56% means heightened trading activity in ETC derivatives, which can be speculative buying or selling. In fact, the notable spike seemed to align with a peak in ETC’s price line, possibly pointing to a speculative rush that was not sustained and led to price retraction.\n\nDeath Cross signals prolonged downtrend\n\nThe 50-day moving average recently crossed below the 200-day moving average, indicating a bearish ‘death cross.’ This pattern typically is a sign of a long-term downtrend.\n\nThe price peaked at around $35 in March, followed by a sharp decline. After that, it consolidated around the $30-mark before breaking below the 200-day moving average.\n\nPrevious support levels can be observed around the $25-level, which have now been breached and may act as resistances if a price recovery attempt occurs. The next key support is likely around the $20-level, which could be tested if the prevailing bearish trend continues.\n\nIn conclusion, the hike in selling volume plus the breach of prior support levels tells us that the bears are here to stay."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxNd2RoMVhsa01uQ05YSEdqWE1jWWxTRE9DYTVBUG0xTXNEZEIycW9mMWRhQ1NZMXlPVXFObmtSb3U3NmliSzlRUDlyUVJuSXNudnJTbW9rZlE0TFhwLTlsZXlaMmNaWnpMdmIxdEtHeWNLWlpLd0pHSmNVdWhfSlZJci1meTdTX1BrOUh0SHhtQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 23 Jun 2024 07:00:00 GMT",
        "title": "Vous devriez surveiller Ethereum maintenant - Cointribune EN",
        "content": "Sun 23 Jun 2024 ▪ 3 min read ▪ by Luc Jose A.\n\nMichaël van de Poppe, renowned crypto analyst, anticipates a significant rise in altcoins, driven by Ethereum’s remarkable resilience. While Bitcoin shows signs of weakness with substantial capital outflows from US-based ETFs, Ethereum demonstrates impressive stability. This dynamic could well herald a major turning point for the altcoin market.\n\nEthereum stands out for its resilience\n\nAs the crypto market undergoes a bearish phase, Ethereum stands out with notable resilience. Recent data shows sustained activity from Ethereum “whales,” which contrasts with the movements around Bitcoin.\n\nA wallet linked to Justin Sun acquired 9,338 Ether, worth over 30 million dollars. A purchase that demonstrates increased confidence in Ethereum’s future performance. In contrast, Bitcoin whales, notably influenced by the German government, continue to liquidate their positions, increasing downward pressure on the market. Similarly, Bitcoin ETFs face massive outflows. Conversely, Ethereum appears to be gaining renewed confidence, potentially setting the stage for a rise in altcoins.\n\nAn imminent rise in altcoins\n\nAccording to Michaël van de Poppe, Ethereum’s resilience could herald a new era for altcoins. The renowned analyst highlights that the ETH/BTC pair, which has recently shown signs of strength, could trigger a significant rise in altcoins after more than two and a half years of a downtrend. Van de Poppe believes that as long as the ETH/BTC pair holds above the key level of 0.05, a trend reversal is possible. This analysis is based on on-chain data revealing increased accumulation of Ethereum by whales, contrasting with Bitcoin liquidations. This technical signal indicates that Ethereum’s crypto price could climb exponentially against the US dollar, driving positive dynamics for the entire altcoin market.\n\nInstitutional interest in cryptos other than Bitcoin continues to grow, as evidenced by the imminent launch of Solana’s exchange-traded product (ETP) in Canada. This trend reflects a diversification of institutional investment portfolios, once largely dominated by Bitcoin, towards alternative cryptos with attractive growth prospects.\n\nBitcoin’s dominance, measured in terms of relative market share, is also poised for a major reversal. This outlook could favor a rotation of investor liquidity towards altcoins and thus amplify their performance. towards altcoins and amplify their performance.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxQM0xqcFVEXzZsUkJhTmlIcHZ6ajVWYVFQRDdtb1hpVHZjNzNXV2Z4Wm5aX2xuQnhYRmRfRmlBUTE1VWhwSGZxUmFUclJCelpBZUwyVzB3cU9HUDBoeTd0Y3NEajNjS0F2MFA1ZWFWSjVibHBOSEl0X2owc3hTQ21lSC1OUHE4UUptdHFIbnMtVHFUUFUxWURsdWZER3hkcVpGM0pKc09KYw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 23 Jun 2024 07:00:00 GMT",
        "title": "Crypto: Pantera Capital Sees Solana As A Serious Future Rival To Ethereum - Cointribune EN",
        "content": "Sun 23 Jun 2024 ▪ 3 min read ▪ by Mikaia A.\n\nAnalysts from Pantera Capital, Franklin Bi, Cosmo Jiang, and Eric Wallach, have recently presented Solana as a real threat to Ethereum. Thanks to its monolithic architecture, Solana is on the verge of establishing itself as a leading blockchain, capable of capturing a significant share of the market dominated by Ethereum.\n\nSolana: The “Ethereum Killer” Activated\n\nSolana positions itself as a serious “Ethereum Killer”, thanks to a monolithic architecture that recalls the integrated approach of Apple with macOS.\n\nAccording to Pantera Capital, this design gives Solana notable advantages: a seamless user experience, accelerated innovation, and enhanced security.\n\nThese characteristics make Solana particularly attractive to developers, the cornerstone of any blockchain’s success.\n\nThe NFT deposit platform DRiP, for example, benefits from Solana’s capabilities to send millions of NFTs at reduced fees, demonstrating the network’s technological superiority.\n\nPantera also highlights the versatility of Solana, issuer of the SOL crypto, capable of supporting various use cases challenging to implement on modular blockchains like Ethereum.\n\nProjects such as Hivemapper and Phoenix show how Solana’s monolithic architecture allows for the development of innovative applications.\n\nAdditionally, Franklin Templeton had already highlighted Solana’s advanced technology, describing it as ideal for the next waves of crypto adoption.\n\nAs a result, Solana is emerging as a major player ready to reshape the landscape of blockchain and crypto.\n\nGrowth of Solana: The Numbers Speak for Themselves\n\nThe rise of Solana is not limited to technological promises. Solana’s fundamentals show impressive growth, consolidating the bullish argument.\n\nThe number of unique active addresses on the network has increased from 14,000 in October 2020 to nearly 1.34 million recently. At the same time, Solana’s priority fees have exploded, reaching a historic high of over $60 million in March 2024, signaling growing demand.\n\nThe trading volume on Solana’s decentralized platforms and the record number of crypto launches bolster this momentum. Solana has even established itself as the preferred platform for retail crypto investors and meme traders, surpassing Ethereum in NFT volume.\n\nThese indicators show that Solana is not just a theoretical competitor but an expanding player ready to capture a significant share of the crypto market.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxPYUdJMG9mREZ4SjRpODk0UXNYUVJaaDBvREZpVGFPaGdiMjdINzRTR1dMZTRsMHU1Y2ZJb243eXFJS0JFV2dYTnVzMnF0LXh4RVB2aFVNVFUzX0V1UmtoRE1rbnNwTXFWeGhzRnVqX3pJRmFlam92S09vNU5iUmg5aDlSeEVPYlhCSnY3U2lzWnpyam56b2dpSGU1bXdZaUYybENFR2JR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Jun 2024 07:00:00 GMT",
        "title": "Ethereum or Silver? We asked ChatGPT-4o which asset is a better investment for 2024 - Finbold - Finance in Bold",
        "content": "As the broader cryptocurrency market faces a downturn, Ethereum (ETH) has demonstrated notable resilience, maintaining its value above $3,400. At the same time, silver (XAG/USD) is holding firm at a key support level of $29.00, rebounding as US bond yields come under pressure.\n\nThe evolving economic environment has led investors to reevaluate their strategies, comparing the benefits of Ethereum as a leading digital asset with the crucial role of silver in emerging technologies and its responsiveness to industrial demand fluctuations.\n\nEthereum: The innovator’s choice vs. Silver: The steady performer\n\nEthereum’s potential for aggressive growth and high volatility makes it an appealing speculative investment. Its foundational role in the decentralized finance (DeFi) ecosystem and smart contract functionality offers significant upside potential.\n\nAdditionally, Ethereum’s continuous technological advancements, such as the transition to Ethereum 2.0 and growing institutional interest, add to its attractiveness as a high-reward investment. Standard Chartered, an international banking giant, recently announced plans to open a trading desk for spot Bitcoin (BTC) and Ethereum, enhancing Ethereum’s market presence.\n\nEthereum’s flexibility and innovation within blockchain technology provide a hedge against traditional financial market instability and inflation, positioning it as a forward-looking investment choice.\n\nSilver, on the other hand, provides stability and growth potential tied to emerging technologies and global sustainability trends. Unlike Ethereum, silver is less volatile and benefits from its dual role as both an investment and an industrial commodity.\n\nIts sensitivity to industrial demand cycles and use in high-tech solutions position it for steady appreciation. Silver’s traditional role as a hedge against inflation and economic downturns makes it a reliable choice for more conservative investors.\n\nChatGPT’s analysis: Ethereum vs. Silver investment prospects\n\nAccording to ChatGPT-4o, the decision largely depends on individual investment strategies and risk tolerance.\n\nInvestors looking at Ethereum should be comfortable with higher risks and the potential for high rewards. This includes tech enthusiasts captivated by blockchain innovations, long-term believers in the future of decentralized finance (DeFi) and NFTs, and institutional investors seeking advanced digital assets.\n\nEthereum’s recent resilience, growing user engagement, and potential ETF approvals make it a compelling choice for those aiming for significant growth.\n\nChatGPT Ethereum investment prospects. Source: Finbold and ChatGPT\n\nOn the other hand, silver suits conservative investors who prioritize stability and steady growth. Silver’s extensive use in electronics, solar panels, and medical devices ensures ongoing demand, making it a reliable industrial commodity.\n\nAdditionally, silver serves as a traditional hedge against inflation and economic downturns, appealing to those who prefer tangible, physical assets. Its role as both an investment and an industrial commodity makes silver a sound choice for those seeking a balanced and secure addition to their portfolios.\n\nChatGPT Silver investment prospects. Source: Finbold and ChatGPT\n\nUltimately, diversification with both Ethereum and silver can be a way to manage risk and potentially benefit from the growth of both major assets. The choice between Ethereum and silver should align with individual investment goals, risk tolerance, and interest in the technological aspects of cryptocurrencies.\n\nEthereum and Silver recent price performance\n\nEthereum and Silver 6 months performance. Source: TradingView\n\n\n\nAs of 2024, six months performance for Ethereum and silver presents a clear contrast in investment returns. Ethereum has seen a significant rise, with an increase of 39% in six months, showcasing its volatile yet high-growth nature with its current price at $3,505.\n\nIn comparison, silver has gained 30% in six months, with its current price at about $29.5 per ounce.\n\nIn conclusion, both Ethereum and silver offer unique investment opportunities suited to different risk profiles and market perspectives.\n\nEthereum’s innovative edge and high-growth potential make it an attractive option for those willing to embrace volatility and technological advancements. In contrast, silver’s stability and industrial applications provide a safer, more conservative investment route.\n\nDiversifying with both assets could offer a balanced approach, allowing investors to capitalize on the strengths of each while mitigating overall risk.\n\n\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    }
]