[
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTFBuNlVIYnVYd1VXcXR1X2x0Y3BJM0k2aVpmNllLckQ2T3p1NmhBVzRaQlhCWHNMQ3owT21BNkVUOGxzOXFKUGhfZHM5MG5HQV9DZmZBRXRxbk81M0RGdXhsdEh2ZFRzQ0xvbW1IelkwQkNLdldHelBheGVGYw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 07 Apr 2024 07:00:00 GMT",
        "title": "Funding Wrap: Solana-based Ellipsis draws an Ethereum-heavy cap table - Blockworks",
        "content": "The developers behind Solana-based decentralized exchange Phoenix have just secured $20 million in a Series A funding round for their startup Ellipsis.\n\nFunding was led by Paradigm, with support from Electric Capital and other industry leaders. Notably, public Ethereum figures also supported the development of Ellipsis. These include Ethereum researchers Justin Drake and Mike Neuder, Tim Beiko, who runs protocol support at Ethereum Foundation, and EigenLayer founder Sreeram Kannan.\n\nLoading Tweet..\n\nThe diverse group of investors caught the attention of X, where users immediately commented on the collaboration between individuals from competing ecosystems.\n\nRead more: Low cost of Solana DeFi frees developers from constraints: Ellipsis co-founder\n\nLoading Tweet..\n\nThe younger van Eck raises $12 million\n\nNick van Eck, the heir to investment management firm VanEck, landed $12 million for his stablecoin startup Agora in a seed round led by Dragonfly Capital.\n\n“After spending my whole career building investment cases based on other founders’ visions, there was no better time or opportunity to build towards a future and vision I believed in,” van Eck posted on X. “AgoraDollar is that company. We’re building a more financially inclusive future, where accessibility to financial wealth preservers and creators is borderless.”\n\nRead more: Ripple to issue stablecoin backed 100% by cash equivalents\n\nThe company notes that its first product will be a fully collateralized stablecoin that is pegged to the US dollar. The stablecoin, named Agora’s digital dollar or AUSD, has yet to launch, but the team remarks that it will differ from existing product offerings and will only be available to select markets outside of the United States.\n\nOther notable fundraises\n\nParadigm is in talks with investors to raise a $850 million fund.\n\nSei reveals that it will be injecting $10 million into its NFT ecosystem.\n\nMerkle Trade secured $2.1 million for a social perp DEX.\n\nXion raised $25 million for an abstraction-focused blockchain.\n\nJack Kubinec contributed to reporting.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxPaEtaNmJLaDZBN2hNOWNNTTRVRm1XTHJTdmE4bFJFTXRBYWRIZHBuRmZVWHZKOVlQTDQ5N0V5Wm9ldzc2VkRRR1gxVUVMV3Y5V0E4RGFJWlNQZ2tSZjVkeHAzcFJnX0FDbnRwWmhHQkFSUnZzOXpNQUEzVGpZa21xMUdkOFBNcE5tZy14VXYtZGgyRWVB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Apr 2024 07:00:00 GMT",
        "title": "Why Ethereum, Bitcoin, and Dogecoin Rallied Today - The Motley Fool",
        "content": "Major cryptocurrencies rallied to new highs thanks to multiple tailwinds.\n\nSeveral major cryptocurrencies started the week on a high note today amid a confluence of positive catalysts, including potential short squeezes, technical trading tailwinds, and -- perhaps most surprising -- geopolitical tailwinds from leading Chinese money management firms.\n\nWhen all was said and done, as of the close of Monday's regular session, the price of Ethereum (ETH -1.29%) was up 9.1%, Bitcoin (BTC -1.73%) had rallied 3.8%, and Dogecoin (DOGE -3.75%) gained a little over 2%.\n\nOn a possible crypto short squeeze, technical tailwinds\n\nAccording to Coinglass data this morning, the digital asset market has seen more than $176 million in liquidations over the past 24 hours, the vast majority of which (around $124 million, or 72%) came from liquidations of open short positions.\n\nAs the price of major cryptocurrencies has rallied in recent weeks -- spurred by a combination of factors, including strong inflows into Bitcoin ETFs, an upcoming Bitcoin halving event, and expectations for the possible approval for the first spot Ethereum exchange-traded funds (ETFs) -- it appears that short-sellers are effectively being forced to close their bearish positions. The resulting surge in buying demand can cause a so-called short squeeze, sending digital asset prices even higher in the process.\n\nMeanwhile, technical trading patterns may also be playing a role. According to the widely followed Bitcoin analyst TechDev on social media platform X, the price of Bitcoin appears to be consolidating above key technical levels and trading averages that have historically preceded significant rallies for the world's most prominent cryptocurrency.\n\nIs China entering the Bitcoin ETF market?\n\nIf that wasn't enough, Chinese financial news site Securities Times reported on Monday that multiple China-based financial giants, including Harvest Fund and Southern Fund, have submitted applications through Hong Kong subsidiaries for their own spot Bitcoin ETFs. Those applications are currently awaiting regulatory approval.\n\nThis news is particularly significant, given China's previous public hostility against Bitcoin. In 2021, China's top regulators even banned crypto trading and mining, sending the price of Bitcoin plunging at the time. It became evident in recent years, however, that China's ban on crypto wasn't absolute, and crypto trading and mining has reportedly continued to thrive in the country. If China is indeed softening its stance, it would serve as only the latest significant validation for the global adoption of Bitcoin and other cryptocurrencies.\n\nThe U.S. Securities and Exchange Commission (SEC) only approved the world's first 13 Bitcoin ETFs in January 2024. The historic approvals served as arguably the most prominent validation yet of cryptocurrencies as a legitimate investment asset class. Because ETFs can be bought and sold throughout the normal trading day via nearly any online brokerage -- in contrast to requiring investors to set up separate crypto trading accounts with a crypto-specific firm -- they're a much more accessible investment medium for anyone considering making cryptocurrencies a meaningful part of their portfolio.\n\nBitcoin ETFs have experienced enormous inflows since then; late last month, for instance, the ARK 21 Shares Bitcoin ETF (NYSEMKT: ARKB) registered net inflows of more than $200 million, becoming the third Bitcoin ETF in the U.S. to cross the $200 million mark this year.\n\nFor perspective, China's Harvest Fund and Southern Fund manage over $230 billion and $280 billion in total assets, respectively. So, if their Bitcoin ETF applications pass regulatory muster through their Hong Kong subsidiaries, and the mainland Chinese government continues to opt for a more cautious approach with indirect approval, it could signal a massive positive shift toward more pervasive crypto adoption over the long term from the world's second-largest economy.\n\nThat certainly doesn't guarantee that Bitcoin, Ethereum, and Dogecoin will continue this incredible rally indefinitely. But as cryptocurrencies, in general, continue to enjoy greater adoption on a global scale, it's hardly surprising to see the prices of the most prominent digital assets continuing to reach new highs."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxOQmJyeS1FaTQ2TzVsQzZWcjZGVHJCZ0pJUk1sS1VLRFFXT05aWDhWZ3VMZzZUWXdoMkpWVmd2cXdOS21IQ0VSU1Z5Z1VUaHpubnFsNWJqalpVUzA3bWtxWEdzazF4UlFTallFOW1HbXA4ZnpVSFQ4QmxrVG9zMUw1NHM2OXh0WG5hTzZOYnRZTnlQOEIzQThLejEyenk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Apr 2024 07:00:00 GMT",
        "title": "ZkLink looks to solve Ethereum’s fragmented liquidity with a layer 3 — but there are risks - DLNews",
        "content": "Layer 2 blockchains have helped scale Ethereum, bringing transaction costs down to cents compared to those on the main Ethereum network.\n\nBut despite their successes, layer 2s have created a new problem called liquidity fragmentation — the splitting up of once-concentrated capital across multiple separate blockchains.\n\nLiquidity fragmentation poses several problems. Smaller, unconnected pools of capital spurs volatility and means users get worse prices on their trades.\n\nZkLink is one project working to solve liquidity fragmentation on Ethereum.\n\nIt has created a so-called layer 3 network — zkLink Nova — which is connected to eight Ethereum layer 2s. zkLink has launched MergeToken on Nova, which is a smart contract that consolidates assets — bridged from layer 2s to Nova and of equivalent value — into a single token.\n\n“We’re setting the precedent for a practice that we hope more projects will adopt to make the web3 trading environment friendlier,” said Vince Yang, CEO and co-founder of zkLink.\n\nBefore layer 2s, as well as other blockchains like Solana, Ethereum hosted the lion’s share of onchain activity, pushing the network to $102 billion worth of DeFi deposits in 2021.\n\nEthereum liquidity is spread across multiple layer 2 blockchains.\n\nBut in recent years, onchain activity is increasingly moving to layer 2s — separate networks built on top of Ethereum that offer faster and cheaper transactions. Much of Ethereum’s vast capital has jumped ship, flowing to layer 2s like Arbitrum, Optimism and Base, among others.\n\nJoin the community to get our latest stories and updates\n\nMergeToken will initially merge versions of stablecoins USDC, USDT and DAI, followed by Wrapped Bitcoin and Ethereum liquid staking tokens in the future.\n\nThe hope is that by reunifying Ethereum’s scattered liquidity on its layer 3, zkLink can increase capital efficiency within the Ethereum ecosystem and provide a better user experience and trade prices.\n\nBut there are also risks.\n\nIn order to make zkLink’s plan work, users must bridge their assets from other layer 2 blockchains to Nova, then lock them up in an upgradable smart contract controlled by a multi-signature wallet — a crypto wallet that requires multiple password-like private keys to send transactions.\n\nThis system creates a big pool of assets that can become a lucrative target for hackers. In 2022, the Ronin crypto bridge, which also kept assets in a multi-signature wallet, was hacked for $624 million after the private keys that controlled it were compromised.\n\nAddressing security concerns\n\nYang told DL News there are 3 external vulnerabilities zkLink attempts to protect its users from: bridge contract risk, MergeToken smart contract risk and governance risk.\n\nBoth the bridge contract and the MergeToken contract lock up assets in single places — like bank vaults filled with gold bars.\n\nAnd like such bank vaults, which before the advent of digital money were all too often a target of thieves, these smart contracts that hold millions of dollars worth of crypto have also become lucrative targets.\n\nHackers have previously used social engineering techniques to steal the private keys that control smart contracts, while others have used code exploits to trick contracts into giving them their contents.\n\nYang said zkLink’s contracts have been audited by its security partners, ABDK and Secure3.\n\nHe also said that the multi-signature wallet that controls the MergeToken smart contract is tied to a governance committee made up of multiple projects separate from zkLink.\n\nA governance committee made up of 12 projects and institutions, including market maker Wintermute and venture capital firm Ascensive Assets, will oversee all current and future merger proposals.\n\nZkLink said upgrades to the MergeToken smart contract require a two-thirds vote from committee members. Upgrades will also be only executed after a seven-day timelock period, giving the committee and users time to review the changes to the contracts.\n\nFixing liquidity fragmentation\n\nCertain tokens, such as Circle’s USDC stablecoin, are not always equal across different layer 2s. When a user sends USDC to Nova, it is represented as a different asset depending on which layer 2 blockchain it came from.\n\nZkLink Nova offers the same faster and cheaper transactions by using zero-knowledge proofs, the same technology that underpins layer 2s like zkSync and Starknet. But it also reunites liquidity split among several different versions of the same assets issued across the ever-growing list of layer 2s.\n\nBut the boons of reunifying liquidity are only accessible to those on Nova, Yang told DL News.\n\n“The MergeToken is a function unique to Nova and dApps built on Nova can access the aggregated liquidity pool,” he said.\n\nDeFi users will have to look to other projects, such as cross-chain bridge and messaging projects like Wormhole, Axelar and LayerZero to break down the barriers between separate blockchains once and for all.\n\nBut for now, zkLink’s offers one of the first available solutions to liquidity fragmentation that users and developers can start playing around with.\n\nUpdate, April 8: Added that upgrades to the MergeToken smart contract will only be executed after a seven-day timelock period, and clarified that zkLink’s bridge contract and MergeToken contract lock up assets in different places.\n\nTim Craig is DL News’ Edinburgh-based DeFi Correspondent. Reach out to him with tips at tim@dlnews.com."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxOX1owZFhNMkNnbVdhLTR4bkpDZDRWMWo2cjVZYTExQVhDV19kZkdUQVc0M3JWQ2FGY05jSVZtLVpIa2NwSTFPVC1iMURlV05SMjFaMzdrRkJLZ3ZSNkNnRGtXVVFZWFZLSmhPTzNUYlIwTnZ5c0x3dlR1NUV3ZV9tZEgxaVRRcVBONFRXaElYQVU0TVBGR1VScm4taF8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Apr 2024 07:00:00 GMT",
        "title": "Base TVL Hits $4 Billion as Transactions Per Second Surpass Ethereum - Unchained",
        "content": "Base is now the third-largest layer 2 network, after Arbitrum One and OP Mainnet, with $4.17 billion in Total Value Locked.\n\nBase's TVL surged over the last few weeks, driven by a high volume of transactions across decentralized exchanges.\n\nCoinbase’s layer 2 network Base has seen its Total Value Locked (TVL) blow past a new high of $4 billion, rising the ranks to become the third-largest Ethereum scaling solution after Arbitrum One and OP Mainnet.\n\nAccording to data from L2Beat, $2.7 billion of the $4.17 billion Base’s TVL has been minted natively on the blockchain, while $1.46 billion was canonically bridged and $3.64 million was natively bridged. Canonically bridged refers to assets that are locked into Base through cross-chain bridge infrastructure on Ethereum.\n\nTransactions per second (TPS) on Base also surpassed Ethereum, with Base recording an all-time high of 36 TPS compared to the 14 TPS on Ethereum, according to data from L2Beat.\n\n>3m transactions (34 TPS) on @base for the first time yesterday pic.twitter.com/dcVX5X8fTe — Jesse Pollak (jesse.xyz) 🛡️ (@jessepollak) April 5, 2024\n\nBase also surpassed other major layer 2 networks in 30-day transaction count, recording 50.5 million transactions, beating out Arbitrum One’s 40.17 million and Ethereum’s 37.87 million transactions for the period.\n\nOf course, memecoin trading has played a hand in some of this record-breaking network activity in March, with coins like Toshie, Normie, and Base God all seeing double digit rallies over the weekend.\n\nThe more significant factor for long-term network effects has been the resulting surge in trading activity across decentralized exchanges (DEXs) on Base, which surpassed $1 billion in daily trading volume last week.\n\nThe Base-native DEX Aerodrome has been one of the largest beneficiaries of this, growing its TVL by more than 380% to $580 million over the course of nine weeks.\n\nHowever, the biggest expected catalyst for Base that analysts will be watching closely is the upcoming rollout of Coinbase’s smart wallet, with the Wallet as a Service feature compatible with all EVM networks including Base.\n\nCoinbase wants to help bring the next 100 million users into Web3 with its new Wallet as a Service feature, offering a solution where users don’t have to deal directly with the complications of decentralized finance protocol infrastructure.\n\nLast week, Coinbase’s head of consumer products Max Branzburg said the firm plans to move more customer and corporate USDC balances onto Base."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxObE81eU1KSzItbGxRaV9hREQzbXJEWGdIVDA5MjA2OGgzTDNoTGQ5aWJlVThpNFE1MlpiMHdwdDluTDd4NXdwbVc2LS15Q3dVRnFhYmZTbDNDOWpoU1EzMk54Y3ZBNElFSlA4SFRYQUpYbTZmUk01eVdrc3JVTHdySDBDYTlKcnV2c3lDY0dn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 07 Apr 2024 07:00:00 GMT",
        "title": "Insights into Crypto Investments: Bitcoin (BTC), Ethereum (ETH), and Furrever Token (FURR) Guide - Yahoo Finance",
        "content": "Furrever Token\n\nNew York City, NY, April 07, 2024 (GLOBE NEWSWIRE) -- Bitcoin (BTC) and Ethereum (ETH) find themselves locked in a struggle to regain their footing amidst market uncertainties, while an emerging player, Furrever Token (FURR) , steals the spotlight with its remarkable presale success. Despite Bitcoin and Ethereum's challenges, characterized by fluctuating prices and ongoing recovery efforts, Furrever Token's rapid ascent, amassing over $660,000 within a month, underscores the shifting dynamics in the crypto landscape. As investors navigate through these contrasting trajectories, the rise of Furrever Token signals a potential paradigm shift, offering a compelling narrative of innovation and opportunity in the ever-evolving digital asset space.\n\nBitcoin Struggles for Recovery Amidst Market Challenges\n\nBitcoin (BTC), the pioneering cryptocurrency, continues to grapple with recovery efforts amidst a challenging market landscape. With the current price hovering around $66,670, representing a modest 1% increase from yesterday's levels, BTC finds itself trapped in a struggle to regain momentum. Following its meteoric rise to record highs exceeding $73,000 in March, Bitcoin has encountered a period of consolidation within a narrow trading range.\n\nThis downtrend aligns with broader market weaknesses observed in the U.S. stock market and other risk-driven assets at the onset of the second quarter. The waning capital inflows into recently approved Bitcoin exchange-traded funds (ETFs) further underscore a subdued sentiment prevailing in the crypto space. While ETF approvals served as a catalyst for Bitcoin's earlier bullish trajectory, diminishing enthusiasm suggests a loss of momentum in this trend. Market attention now pivots towards the impending release of nonfarm payroll data, slated for later in the week, which is poised to influence U.S. interest rate expectations. A scenario of sustained or elevated interest rates could potentially dampen Bitcoin's prospects, given its historical preference for low-rate, high-liquidity environments. As Bitcoin navigates these headwinds, its ability to reclaim upward momentum remains contingent on prevailing market dynamics and macroeconomic factors.\n\nEthereum Struggles to Break $3,440 Resistance\n\nIn the cryptocurrency markets, Ethereum (ETH) faces turbulent conditions as it struggles to surpass the $3,440 resistance level. Currently trading around $3,272, ETH encounters challenges in breaching this crucial threshold. However, recent trends indicate a potential for further downside if Ethereum continues to trade at lower levels, particularly if it breaks below the $3,250 support level. Ethereum finds itself locked in a battle to ascend above the $3,370 and $3,440 levels, yet it trades below the $3,380 level and the 100-hour Simple Moving Average.\n\nStory continues\n\nA closer examination of the ETH/USD pair's hourly chart reveals a significant break below the crucial uptrend line below the $3,300 support. Consequently, the possibility of increased losses should not be overlooked if there's a closure below the $3,250 support region. While Ethereum recently witnessed a recovery wave above the $3,300 and $3,320 levels akin to Bitcoin, attempts to breach the $3,400 level have been met with resistance from bears near the $3,440 region.\n\nAlthough a new high formed around $3,443, a significant break below the major uptrend line below the $3,300 support was observed on the hourly chart. This development tempered gains, prompting a retest of the $3,250 support, with prices dipping to $3,253 before consolidating current losses. As Ethereum navigates these price fluctuations, its ability to sustain upward momentum hinges on overcoming key resistance levels and maintaining crucial support zones.\n\n\n\nUnveiling Furrever Token (FURR): How It Attracts Investors with Over $660,000 Raised and Up to 15X Returns!\n\nFurrever Token (FURR) continues to captivate investors' attention and has emerged as a compelling investment opportunity in the volatile cryptocurrency market. Despite the market's fluctuations, FURR has demonstrated remarkable resilience, attracting significant interest and amassing over $660,000 in funds within just a month. The project's allure lies in its innovative approach to combining cryptocurrency with elements of cuteness and community engagement, setting it apart from traditional blockchain ventures.\n\nAt the heart of Furrever Token's appeal is its unique vision to revolutionize the crypto space by infusing it with an irresistible dose of charm and whimsy. Unlike many serious blockchain projects, FURR embraces a lighthearted approach, leveraging the universal appeal of adorable cat imagery to create a delightful user experience. By integrating cute cat-themed stickers, emojis, and visuals into its ecosystem, FURR fosters a sense of camaraderie and shared joy among its community members.\n\nMoreover, Furrever Token offers more than just a novel aesthetic experience; it presents tangible opportunities for investors to reap significant returns on their investments. With up to 15X returns on offer and over $660,000 raised in a month, FURR's presale success underscores the growing confidence and interest among investors. The tokenomics of FURR, including its allocation structure and potential for exponential growth, further contribute to its attractiveness as an investment asset.\n\nAdditionally, Furrever Token boasts a vibrant and active community characterized by enthusiastic participation and robust engagement. The project's commitment to fostering a warm and friendly atmosphere has cultivated a loyal following, driving interest and excitement surrounding FURR's development and future prospects. As for its current price, FURR is trading at $0.00048, reflecting its growing popularity and investor confidence in its long-term viability. With its vibrant community, promising returns, and unique approach to cryptocurrency, Furrever Token stands out as a promising player in the ever-evolving crypto landscape.\n\n\n\nDon’t Wait! Discover the Most Exclusive Presale Opportunity of 2024!\n\n\n\nFurrever Token Official Website | Visit Furrever Token Presale\n\n\n\nJoin Official Telegram Group | Follow Official X Account\n\n\n\nMedia Contact:\n\nRobert Smith\n\nhttps://furrevertoken.com/\n\nsupport@furrevertoken.com\n\n\n\nCONTACT: Robert Smith Furrever Token support at furrevertoken.com\n\n\n\n"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxOUXowTG5vSFJFMkl2NndrWVg1V2xVXy1RY0I2NlRic2ZqMUVkZUJrY0htSklZd3dEVkFPVGdCNEFuQzhueVlHSmE0bWxhc29Ka19UNmVtV0ZIcERleVFnRHA3TjREckFaa2ZLRW5iVVNuTEFtWkMyMTJqZ3FvaG13LXRvSXR2S2tycERqVDU2MUlFUW9PY0Z2OUJWUEtOdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Apr 2024 07:00:00 GMT",
        "title": "Coinbase Ethereum Layer-2 Base Hits $4B TVL Surpasses Blast - Crypto Times",
        "content": "The Coinbase-backed Ethereum layer-2 network Base has surged past $4 billion in total value locked (TVL), marking a 13.2% increase in the past week.\n\nBase TVL Chart | Source : L2Beat\n\nL2BEAT data reveals Base’s TVL at $4.15 billion, with $1.45 billion bridged from Ethereum and $2.7 billion in native assets. Base is now the third-largest Ethereum layer 2, surpassing Blast by $1.4 billion.\n\nIn the past week, Base gained while others like Starknet and Optimism saw losses in TVL. Base’s 30-day transaction count also outpaced Ethereum and Arbitrum, hitting 50.50 million transactions.\n\nBase’s average daily transactions per second (TPS) increased by 29.7%, reaching 35.19 TPS, higher than Arbitrum and Ethereum combined. The platform’s meme token market capitalization exceeded $1.6 billion, benefiting from recent memecoin activity.\n\nHowever, Base faced challenges with an 18-fold increase in successful phishing scams, resulting in $3.35 million stolen last month.\n\nEthereum’s focus on improving layer-2 transaction data processing, like the March 13 Dencun update reducing fees, could benefit platforms like Base. Analysts predict Ethereum’s scaling ecosystem could reach a $1 trillion market capitalization by 2030, benefiting layer-2 solutions like Base."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxOSzdHVjI3MmhfY0hxZTdMUFo2czBYQXV3Qlh6TTloYU9RbmljQjN4MjlPTVNvd08taTR2TjB2a2xqTVRvMUxPbEJDMlI5NF9IQkN3N0ZubWV4ZkNVMkhlaWdLX3BLbUF4RmVZcDFGV2NfOW0weDIzenF6M0VWd1VoZkJtelhmZGpoSmZ5RlhweHY1Q2R5WUtV0gGcAUFVX3lxTE1ValJFLVBhVmt3MTNDUTVvRWFFRE02cXd1cVNkRktRWjJwNi16S1JXTDJhaWdkbUlXUXh5Q2FtMXQ1NlpDWFlaWklHMXkxRmxyMFFEemtUNW16VDlkc2ZNLTVXdWhLQi1DQmhyb3ZROUtMcWJHb0hVU0lOTVFITXYta3podzFxeThiYm9VSkY0dXdVc1hSQUZvMmljUA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Apr 2024 07:00:00 GMT",
        "title": "Bitcoin on Verge of $70,000, XRP Comeback Begins, Ethereum (ETH) Support Plays Out - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nBitcoin is now close to reaching $70,000. Digital gold could be on the verge of a breakthrough. Right now, it is trading around $69,311, and many are watching to see what will happen next.\n\nThe chart shows that Bitcoin has been going up and down, without a distinctive pattern, but it is still close to the $70,000 mark. This is a very important level that could tell us if Bitcoin is going to start moving toward another ATH or keep consolidating. If Bitcoin can get past this level, it could go even higher, which would be big news for the cryptocurrency market.\n\nBut the market is giving mixed signals. This makes it hard to say for sure if Bitcoin will pass $70,000 soon. There is a chance it could go up to test this level, but it is not clear if it will be able to stay above it.\n\nFor Bitcoin to keep growing, the asset should stay at least above 50 EMA, but it is not an easy task considering questionable market inflows right now.\n\nAdvertisement\n\nIf Bitcoin can stay above these support levels and move past $70,000, it could be the start of another big increase in price.\n\nGood news for XRP\n\nAfter a tough period of time for XRP, there is some good news: XRP has moved above its 100-day exponential moving average (EMA) again.\n\nRight now, the price of XRP is at $0.5967. Breaking the 100 EMA line is important because it can be a sign that the price might start moving upward once again. If XRP can keep up this momentum and stay above the 100 EMA, the next big test will be at the 50-day EMA, which is at about $0.62. If XRP can break through this too, it might just prove that it is ready to climb toward an yearly high once again.\n\nHowever, even with this positive move, there is a chance that XRP might not keep rising. It is possible that the price will not go up much more and that this is not the start of a real comeback. To be sure that XRP is really making a comeback, we need to see if it can hold above the 100-day EMA and then break past other important prices like the 50-day EMA.\n\nInvestors and people who watch the crypto markets are going to be paying close attention to XRP. If it can stay strong and move past more resistance levels, then it could mean that XRP is making a real comeback. But if it cannot, and the price falls below the 100-day EMA again, it might suggest that XRP still has a way to go before a true recovery starts.\n\nEthereum is safe\n\nEthereum is at a key threshold. Its price is being squeezed between an upward trendline and the 50-day exponential moving average (EMA), which may lead to a big move in price soon.\n\nCurrently, Ethereum is trading around $3,391. The chart shows that the price is just above the upward trendline, which has been acting like a support, helping to stop the price from falling further. This line is moving up slowly, which could mean that the price of Ethereum might go up with it.\n\nThe 50-day EMA, right now at about $3,400, is right above the current price. This EMA often acts as resistance, which can push the price down. Ethereum is stuck between this resistance above and the support trendline below. If the price can break above the 50-day EMA, it could rise to the next resistance level around $3,545.\n\nBut if Ethereum cannot stay above the trendline, it might fall to the next support level, which is the 100-day EMA at around $3,090. If it drops below this, the price could go down to the 200-day EMA at $2,665.\n\nFor now, the market is sending mixed signals. This means that Ethereum's price could go both ways, and it is not clear which way it will go. Investors are watching closely to see if Ethereum can stay above the trendline and break past the 50-day EMA."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQdDVwcDlQMXVHandBanJpNlEwZmJhUUpSMVl4MmsybWpwSm14TTAtZHVJN2Q0YmFTcjBpc1h1WWhNQ20yVW13NXAwdGh2amdkVVVzMTBlc2h4OWMtOFVFUUFoWEdNZGI4RE5XOFUycTIwTFZTb3RNdlhqQU5QMFczWDNKdFVsMjhpQVHSAY8BQVVfeXFMTlRWSFEzSVZlckZVdEdkcTBmR2RMS2UwS2ZyOVY3SDRlSzFYRVBYcjBOVjZXQ0lseFhaTXZjcHF3dGJ6cmFWLXItSjMtYWN6SkJjMW9sNVdyaFFIbkJBMTZsYnMzSFpCZ3U5VU1UZEdTcUhiNGpsQks1bzQ5U18tVXFhSnd3OUU5TUtXcnFnZE0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis: ETH Explodes 7% Dailys, is $4K Next? - CryptoPotato",
        "content": "ETH has recently demonstrated resilience, maintaining support around the critical threshold of $3.2K, leading to a period of consolidation with minimal price movements.\n\nHowever, there are indications pointing towards a potential surge in buying interest in the medium term, possibly setting Ethereum on a trajectory to surpass its yearly peak of $4.1K.\n\nTechnical Analysis\n\nBy Shayan\n\nThe Daily Chart\n\nA thorough analysis of the daily chart showcases ETH’s ability to withstand increased selling pressure, finding strong support around the $3.2K mark. This zone coincides with key Fibonacci retracement levels between 0.5 ($3190) and 0.618 ($2972), further fortified by the critical 100-day moving average at $2972.\n\nThis confluence of support levels suggests significant hurdles for sellers attempting to drive prices lower, indicating prevalent buying activity and demand in Ethereum’s downward path.\n\nHowever, ETH is currently in a phase of sideways consolidation, with many market participants anticipating a bullish resurgence aimed at reclaiming the yearly high of $4.1K in the medium term.\n\nThe 4-Hour Chart\n\nDelving deeper into the 4-hour chart, the formation of a multi-week sideways wedge pattern can be observed, with ETH’s price nearing the apex of this narrowing range. Despite this consolidation, the recent price signals robust buyer presence around the crucial support zone of $3K, resulting in a modest rebound towards the upper boundary of the wedge.\n\nAs the cryptocurrency approaches the narrowing range of the pattern, a breakout in either direction seems imminent in the short term. A potential rejection and breach below the wedge’s lower boundary could pave the way for a bearish extension toward the substantial support at $2.9K.\n\nNevertheless, considering the prevailing market conditions and the dominance of buyers in the perpetual market, a more probable scenario involves a breakout above the pattern, with Ethereum targeting its next resistance at $3.7K.\n\nIn general, heightened volatility and significant liquidations in the futures market are expected, necessitating caution among market participants.\n\nOn-chain Analysis\n\nBy Shayan\n\nThe recent consolidation in Ethereum’s price, following its rapid surge towards the $4K mark, prompts a closer look at sentiment indicators in the futures market to gauge potential future movements. Analyzing the funding rates and Open Interest metric offers valuable insights into the prevailing sentiment among market participants.\n\nThe funding rates metric, alongside Open Interest, serves as a barometer for the aggressiveness of buyers and sellers in executing their orders. Overall, positive values in these metrics suggest a bullish sentiment and heightened activity in the perpetual market, while negative values indicate a more cautious or pessimistic stance.\n\nUpon inspection of the chart, it’s notable that as Ethereum’s price experienced a notable uptrend, there was a corresponding spike in the funding rates metric. This indicates an aggressive execution of long positions by participants. Similarly, the uptrend in the Open Interest metric also reflects heightened activity, signalling an overall heated state in the futures market.\n\nConsidering these metrics, the market appears poised for another significant move in the mid-term, with the potential for long positions to be reinstated in the perpetual market. This suggests a favourable outlook for Ethereum’s price trajectory, potentially pushing it towards its all-time high."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxOakhtZmg5dG95TzBac0hPMFNLeDU1TGdBVzFJaFpYUXlleWc3YktLeEs1bEhadU1hc2czc3NDbzhCUGd4YjBGSjJHajFrQ1dKTjUxakpkOGNJLXFJZEIyTEVJcWFPLURzSEJTc0JpLVJOWnVvOFVObjVybmhFcGRlblhsb0U4MmJUQ0VKbXZOc0xVRjhwWTNVZjJkMHVGano5T0RpaGl3UTNpNjViNFHSAbMBQVVfeXFMUFBiUHZmYkNnWDR2bW1rYXRlSklNaG9MeTdOdnhkaFREZ3p6S2otdXJ6VnBDQ2twOGo3MC1xX1VmSzBhU1lrMXh2Ukh5NnJaemdKMjdUMWw0NWZpT1NHQmdTT3VFOXFMbG5nOHFNQUYtS19vemMweFNkam1kY3IxUkVNc0ZfTmtkMHNLTDZfbk1FdjlJQ1lpcENwdTZfS3Y3V2ltcjNSMHlfRHh0TGRDZmJLbk0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 07 Apr 2024 07:00:00 GMT",
        "title": "Ethereum’s Layer 2 Networks Projected to Reach $1T Market Cap by 2030: VanEck Analysts - CryptoPotato",
        "content": "In a report released earlier this week, analysts from investment manager VanEck forecasted that Ethereum’s Layer 2 scaling networks will reach an astonishing $1 trillion market capitalization by the year 2030.\n\nThe $1 trillion prediction was reached by estimating that Ethereum would hold 60% of the market share across all public blockchains and assessing the volume of assets within its ecosystem.\n\nEthereum’s $1T Potential Through Layer 2 Innovations\n\nVanEck’s senior digital assets investment analyst, Patrick Bush, and digital assets research head, Matthew Sigel, shed light on the transformative potential of Layer 2 blockchains in revolutionizing Ethereum’s scalability and performance.\n\nEthereum’s dominance in smart contracts faces scalability issues as transaction fees and processing times escalate during periods of high usage.\n\nAccording to the analysts, Layer 2 networks are set to capitalize on Ethereum’s limited capacity to process, store, and compute data, thus unlocking new opportunities for innovation and growth within the blockchain ecosystem.\n\nThe report also highlights the role played by Layer 2 solutions, particularly Optimistic Roll-Ups and Zero-Knowledge Roll-Ups, in enhancing Ethereum’s transaction processing capabilities while upholding its core principles of security and decentralization.\n\nOne development emphasized is Ethereum’s recent Dencun upgrade, which introduces the innovative “Blob” feature to reduce data posting costs, improving Layer 2 operations financially.\n\nLayer 2 Networks Could Dominate Ethereum\n\nVanEck’s analysis projects a future where Layer 2 networks will capture a significant portion of transaction value and Total Value Locked (TVL) within the Ethereum ecosystem. This growth is expected to be partly driven by the potential of Maximal Extractable Value (MEV) to enhance Layer 2 revenues. They also see a future where Layer-2 platforms could offer distinct competitive advantages over Ethereum in specific market sectors.\n\nDespite their optimistic outlook, the analysts are cautious regarding the long-term value of most layer 2-related tokens due to “cutthroat competition,” which could impact the long-term value of many projects. They note that the top seven Ethereum layer 2 tokens already command a fully diluted valuation of $40 billion, with more projects to launch in the coming months.\n\nThe report forecasts a future landscape characterized by thousands of use-case-specific Layer 2 networks catering to various sectors, including gaming, social media, and infrastructure.\n\nThese specialized chains are expected to complement Ethereum’s general-purpose chains, with a select few emerging as major players due to network effects and widespread adoption."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxNWEEtZVdMSjlaWC1yZ3UwS2hEMmJNdjZuWnBXbV9rWVFFY3BqVGlCSVNtZF95a2RHanQzYTN1RXlqWkJBcmJoNy1KV0hBbXVwNXVDZUVISWtzbmtxd2RyRGhQYVZFWFpyUXo3eUxwX1NWc2FPX0NOUWNPOEpGU1Q1LW01eGtnQ2YxMHJPM2R4cXhzUFVLT2ItTkZhbUVIa1d2MVp0VzI3VFREZDdMa3AtQVVENHNCby1Wa05zQlZIRUttdWRxc0s3ZXZhZGZKejJRbFRBSkdB0gHbAUFVX3lxTE1vYkhYX1FPeE5QSXlDRmZfQjN4MkVuUzVFMmxQM1J6RWJwRzhCcU5zWXE0UmxzQTBGSjlRWW5ZcHl2UTQzQXJkODJld21aMTg3dS01cENQUDNZUjZrUzhtTWYyQ2FpbVpBdWhxTkVtRjk5b0I1MGU3eXZGUnYxSzR2S1lxNW83dVpEcFUtN21nYUIyVXVRR0d6ZzdOQ0w1c3oxbk9qemtBUndrVUpxVUkxLTlGcGVKaVdTeFNSZE1KMUhyeHVCUUhEUGRvSy1ZMlFRcEE2WUtVZHR1Yw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Apr 2024 07:00:00 GMT",
        "title": "Ethereum's price recovery looks imminent as ETF approval sees a glimmer hope - FXStreet",
        "content": "Ethereum transitioned from a Proof-of-Work (PoW) to a Proof-of-Stake (PoS) mechanism in an event christened “The Merge.” The transformation came as the network wanted to achieve more security, cut down on energy consumption by 99.95%, and execute new scaling solutions with a possible threshold of 100,000 transactions per second. With PoS, there are less entry barriers for miners considering the reduced energy demands.\n\nStaking is a process where investors grow their portfolios by locking their assets for a specified duration instead of selling them. It is used by most blockchains, especially the ones that employ Proof-of-Stake (PoS) mechanism, with users earning rewards as an incentive for committing their tokens. For most long-term cryptocurrency holders, staking is a strategy to make passive income from your assets, putting them to work in exchange for reward generation.\n\nEthereum uses decentralized blockchain technology, where developers can build and deploy applications that are independent of the central authority. To make this easier, the network has a programming language in place, which helps users create self-executing smart contracts. A smart contract is basically a code that can be verified and allows inter-user transactions.\n\nEthereum is a decentralized open-source blockchain with smart contracts functionality. Serving as the basal network for the Ether (ETH) cryptocurrency, it is the second largest crypto and largest altcoin by market capitalization. The Ethereum network is tailored for scalability, programmability, security, and decentralization, attributes that make it popular among developers.\n\nAs a result, ETH may continue the consolidating move briefly to gather momentum for its next move to test the $3,943 barrier. If ETH successfully breaks past it, it could enter a bullish momentum to break past previous highs of $3,517, $3,570, and $3,655.\n\nEthereum reached its highest price in around the past seven days when it traded at around $3,480 on Sunday before experiencing a correction. However, it has yet to break past its one-week resistance of $3,493, which formed a liquidity void on April 1.\n\nEthereum (ETH) began showing signs of recovery on Monday, briefly trading at $3,460, after consolidating for the past week. This recovery may likely be due to recent whale activity surrounding the largest altcoin and JP Morgan's positive outlook for an ETH ETF approval.\n\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all or a portion of your investment, as well as emotional distress. All risks, losses and costs associated with investing, including total loss of principal, are your responsibility. The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of FXStreet nor its advertisers. The author will not be held responsible for information that is found at the end of links posted on this page.\n\nIf not otherwise explicitly mentioned in the body of the article, at the time of writing, the author has no position in any stock mentioned in this article and no business relationship with any company mentioned. The author has not received compensation for writing this article, other than from FXStreet.\n\nFXStreet and the author do not provide personalized recommendations. The author makes no representations as to the accuracy, completeness, or suitability of this information. FXStreet and the author will not be liable for any errors, omissions or any losses, injuries or damages arising from this information and its display or use. Errors and omissions excepted.\n\nThe author and FXStreet are not registered investment advisors and nothing in this article is intended to be investment advice."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiXkFVX3lxTE1fa0NrVlllaTViRGtrcFEtTHhxcE9CYldLdmhXQnFaTVlXa0NGSVRWRnBUZGhLb2dWZ1QwUlAtWmNBcDdFNTJZcTUxb3owS04yWThwU2FyT0pQcFl6UFE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Apr 2024 07:00:00 GMT",
        "title": "What are blobs? Ethereum's solution for scalability and efficiency - OKX",
        "content": "The introduction of blobs during Ethereum's Dencun hard fork is a major development in blockchain technology. Blobs are data structures that allow for settlement via Layer 2 (L2), rather than using calldata. Blobs were created to improve Ethereum's scalability and efficiency, particularly for rollups, resulting in increased accessibility and cost-effectiveness.\n\nAs Ethereum shifts its attention from addressing the initial \"zero-to-one\" challenge to tackling \"one-to-N\" obstacles, the role of blobs becomes important in enabling this transition. The tool aims to improve the blockchain's capabilities and simplify its operations, paving the way for future scalability improvements and progress in application development.\n\nIn this article, we'll explore what blobs are, how the technology could influence decentralized applications (DApps), and how you can buy the blobs token.\n\nTL;DR\n\nBlobs improve the scalability and efficiency of Ethereum, particularly for rollups, offering easier and more affordable transactions.\n\nAs Ethereum progresses from its initial stages to handling multiple challenges, blobs play a crucial role in supporting this important transformation.\n\nThe role of blobs is crucial in streamlining blockchain processes and laying the foundation for future progress and growth.\n\nEIP-4844 aims to enhance scalability and lower transaction fees on Ethereum by introducing \"blobs,\" which can hold large amounts of data.\n\nThe Dencun upgrade, which includes EIP-4844, seeks to enhance the scalability and cost-efficiency of Ethereum, particularly for L2 solutions.\n\nUnderstanding blobs and their role\n\nImplementing proto-danksharding through EIP-4844 introduces a new concept called \"blobs,\" which are substantial blocks of data stored on the Ethereum blockchain. These blobs aim to improve Ethereum's scalability by enabling the processing of larger amounts of data cost-effectively and efficiently.\n\nUnlike traditional data handled by the Ethereum Virtual Machine (EVM), blobs are stored through KZG cryptographic commitments to enhance the efficiency of L2 rollup methods.\n\nImpact on gas fees and scalability\n\nThe introduction of blobs is expected to reduce gas fees significantly. By providing a specialized data layer that rollups can use, EIP-4844 increases the data space per block, thereby lowering costs. The development is significant because it doesn't fully incorporate data sharding but establishes a new transaction format and storage system on the beacon chain.\n\nThis supports scalability and paves the way for potential sharding implementations in the future. Blobs were created to meet the urgent demand for scalable solutions by providing a temporary solution until complete data sharding is accessible.\n\nTheir introduction is driven by the need to support rollups as a scalable, trustless solution for Ethereum despite the cost advantages rollups offer over the base layer. EIP-4844 seeks to mitigate the prohibitive fees of rollups by introducing this specialized data layer.\n\nThe Dencun Upgrade and its broader implications\n\nScheduled for activation with the Dencun upgrade, EIP-4844 is set to revolutionize Ethereum's infrastructure, making it more scalable, economical, and efficient for users and developers.\n\nThe Dencun upgrade adds cheaper data storage for L2 proofs by only requiring node operators to store this data for approximately 18 days. This period is considered long enough for all network participants to download and store the data, while also keeping hardware requirements manageable.\n\nThis approach benefits L2 rollups by reducing transaction costs and network load and enhancing Ethereum's infrastructure for future advancements. By leveraging KZG commitments for blob storage, EIP-4844 improves the overall efficiency of the Ethereum network.\n\nWhat is the blobs token?\n\nThe blobs token is a new and inventive aspect of the Ethereum blockchain, intricately linked to the Dencun upgrade and EIP-4844.\n\nThe blobs token system is a crucial advancement in the Ethereum community that aims to solve problems with the blockchain's ability to handle a large volume of transactions and expensive gas charges, focusing on improving L2 solutions.\n\nThe division of assets into blobs tokens is fundamental as it supports Ethereum's larger objective of transitioning from tackling initial blockchain obstacles (the \"zero-to-one\" phase) to dealing with scalability and efficiency in a more dispersed setting (the \"one-to-N\" phase).\n\nApplying the characteristics of blobs for tokenization allows Ethereum to process a greater number of transactions with greater efficiency, ultimately decreasing transaction costs and improving the user experience for DApps.\n\nTechnical mechanics of blobs\n\nAt the heart of the blobs token mechanism is \"blob transactions.\" These transactions are integral to EIP-4844 and introduce large data packets (the blobs) that can be included in Ethereum blocks. Unlike typical Ethereum transactions, which are processed and stored permanently by the Ethereum Virtual Machine (EVM), blobs provide a more scalable and cost-effective way to handle large amounts of data.\n\nThe EVM doesn't directly process blobs, but thanks to KZG cryptographic commitments, they can still be included in the blockchain. In other words, they can temporarily store data, which is especially advantageous for L2 rollup solutions requiring proofs to be submitted to the Ethereum mainnet for verification.\n\nUsing blobs allows these solutions to significantly decrease the amount of data they must permanently store, resulting in lower gas fees.\n\nIntegration with Ethereum for gas fee reduction\n\nThe addition of new transaction types and block header fields introduced by EIP-4844 enables the integration of blobs into Ethereum's infrastructure. Every block in Ethereum could contain a set number of blobs, each capable of holding a maximum of 128kb of information. Including blobs enables L2 solutions to transfer a considerable amount of data away from the mainnet, resulting in a notable decrease in gas fees.\n\nThe blobs mechanism's significance lies in its influence on gas fees. EIP-4844 establishes a distinct area for blobs in Ethereum blocks, resulting in a new gas market dedicated to blob storage. This market functions similarly to the current gas market but concentrates on the expenses related to storing blobs.\n\nWhat makes blobs unique?\n\nBlobs stands out from other tokens in the blockchain and crypto space due to its close relationship with Ethereum's structure, plus other key features.\n\nIntegration with Ethereum's blockchain : Blobs are intricately linked to Ethereum's Dencun upgrade, a significant development aimed at reducing gas fees and enhancing scalability by introducing data \"blobs.\" The introduction of blobs is a significant milestone in Ethereum's continuous growth.\n\nMeme integration into blockchain technology : Blobs stands out for its incorporation of memes, which gives it cultural significance and sets it apart as a creative method for connecting with and growing the crypto community. Combining humor and technology, blobs uses the power of meme culture to establish a distinctive presence in the world of digital assets.\n\nEnhancing Ethereum's scalability and efficiency :\n\nEthereum's proto-danksharding, a precursor to full sharding, introduces blobs to address scalability challenges. Blobs act as short-term, effective containers for transaction information, simplifying verification procedures and minimizing storage expenses.\n\nThe implementation of blobs is predicted to decrease charges on L2 platforms by lessening Ethereum's data storage responsibility. This in turn allows for quicker transaction handling at a reduced cost. This technological advancement directly benefits users by making Ethereum-based transactions more cost-effective.\n\nCommunity and developer engagement : Ethereum's incorporation of blobs demonstrates the project's adaptive response to community input and technical obstacles. By tackling issues such as costly gas fees and network congestion, the project showcases a dedication to enhancing user satisfaction and broadening the reach of DeFi applications.\n\nPotential for widespread impact: Blobs have the potential to contribute significantly to the wider usage of Ethereum and its related technologies by making transactions more convenient and cost-effective. This incorporation hints at a future where blockchain is easier to use, has a greater reach, and is more ingrained in mainstream society.\n\nBlobs' unique position at the intersection of technological innovation and meme culture enhances its appeal to diverse users, from crypto-curious to crypto natives.\n\nHow to buy blobs\n\nWhen purchasing blobs tokens, you typically follow a process similar to buying other cryptocurrencies via DeFi platforms.\n\nSelect a crypto wallet: To store your purchased tokens securely, it's essential to select a crypto wallet compatible with the blockchain network on which blobs tokens operate. Purchase a base crypto: You may need to hold ETH before exchanging it for blobs tokens on networks such as Ethereum. This process involves purchasing the primary currency on a crypto platform using currencies such as USD or EUR. Transfer to your wallet: Transfer the main digital currency to your preferred wallet and make sure you hold a small additional amount for gas fees. Choose a DeFi platform: Find DeFi platforms or DEXs that offer blobs tokens for trade. Popular options include platforms such as Uniswap that specialize in Ethereum-based tokens. Swap for blobs tokens: Connect your wallet to the chosen DEX, select the base cryptocurrency and blobs tokens for the swap, and execute the trade. Remember, transaction fees will apply, and they vary by network. Storing and managing your tokens: After making a purchase, you can control your blobs tokens through your wallet. You're able to keep, stake, or use them in DeFi applications according to your strategy.\n\nWhat are the potential uses and applications of blobs?\n\nBlobs could have a significant impact on the Ethereum ecosystem, with many potential use cases possible.\n\nL2 optimization\n\nBlobs are commonly used in L2 solutions, specifically for handling settlement data. This allows L2 networks to efficiently settle transactions on the Ethereum base layer (L1), significantly decreasing operational expenses.\n\nRollups and data availability\n\nRollups have the potential to profit significantly from blobs as they group transactions and handle them outside the main Ethereum chain. By storing transaction information in blobs, rollups can increase their transaction capacity while reducing costs compared to using the Ethereum main chain. This ultimately improves their efficiency and scalability.\n\nCreation of new data markets\n\nBeyond rollups, blobs could enable the creation of new types of decentralized data markets on Ethereum. These markets could facilitate secure and efficient data buying and selling, leveraging the decentralized and secure nature of the blockchain.\n\nDApps\n\nBlobs open new possibilities for DApps, especially those requiring the decentralized storage and sharing of large data sets. They can be used to manage data in a variety of applications, including decentralized file storage systems and data-heavy scientific research platforms.\n\nNetwork efficiency and lower fees for users\n\nThe arrival of blobs offers the typical Ethereum user the potential for quicker transactions and reduced fees, tackling two major concerns of users regarding the current state of the Ethereum network.\n\nWhile the potential for blobs and the EIP-4844 upgrade is high, it's important to note that it's one step towards a bigger goal of full danksharding, which aims to further scale the Ethereum network by splitting it into multiple parallel chains. However, the immediate benefits, such as improved scalability, lower fees, and new applications for Ethereum, mark significant progress.\n\nThe development of blobs in tandem with EIP-4844 and future enhancements could play a significant role in defining the direction of DApps and the overall functionality of the Ethereum blockchain as it progresses.\n\nWhat's next for blobs?\n\nThe roadmap ahead includes further enhancements to increase blob capacity and optimize rollups, alongside implementing data availability sampling (DAS) to allow for up to 16 MB of data space per slot.\n\nVitalik Buterin, Ethereum's co-founder, detailed the future development directions for Ethereum. These directions outline two main strands: increasing blob capacity and improving L2 solutions to make better use of the available data space.\n\nInnovations like PeerDAS aim to scale blobs while preserving network efficiency. And, advancements such as EIP-7623 will impose stricter bounds on execution block sizes, enhancing scalability. Buterin also highlighted the importance of efficient and optimistic data compression techniques to secure L2 solutions.\n\nLooking at the bigger picture, Buterin has compared Ethereum's growth to an S-shaped curve, moving from quick advancement to a slower period of improving the user experience and introducing new applications.\n\nThis change highlights Ethereum's dedication to creating a decentralized platform that efficiently expands and provides a suitable setting for applications that use the blockchain's distinctive features.\n\nExpanding our perspective beyond Ethereum and considering the larger cryptocurrency environment for potential advancements in 2024 would be wise.\n\nFor example, Algorand, along with other blockchain projects, is making notable advancements. Algorand's focus for 2024 is on improving its open blockchain platform, with a focus on enhancing performance and increasing decentralization. Adding dynamic round times and implementing Python for smart contract creation are intended to enhance network efficiency and grow the developer community.\n\nAlgorand plans to increase its network's decentralization by incentivizing consensus and transitioning to a peer-to-peer gossip network. The advancements in popular blockchain networks demonstrate a persistent emphasis on expanding efficiency and decentralization, suggesting a bright outlook for crypto's potential and the creative possibilities it'll bring.\n\nThe final word\n\nSince launching, Blobs have had a major impact on improving Ethereum's scalability and efficiency, which is vital for the success of rollups. In short, this technology makes transactions more convenient and affordable. As Ethereum continues to develop and address difficult obstacles, blobs are instrumental in supporting progress.\n\nMost significantly, introducing blobs through EIP-4844 and the Dencun upgrade aims to lower transaction fees and improve scalability for L2 solutions. As more users feel the benefits of blobs, many are looking ahead at what other possibilities the technology could bring to the blockchain space."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxQRmJTUF9xZlFCLXN5TjVWQnE4REY5RkljR0pZeHczR2tLLWpoMlFpNnRmNjNXc3M5VjNab0pFek9SQzhpWUs4WENIdV9NaFpFMS1SeU5vS0laT2N5TUF3S3UxY3lWa1RheEhPc0tGTmUzM3F6cmdNMDRnR2tVREwxTVo1bjFtM2txQzlnNDNiNTLSAZYBQVVfeXFMTjhMMGgzTHJ4UnNfNGIyQXJEUk5zTmxQNVZZamNyTXJqMjY2TzN4X3RGUFk1NVJYMFpFNGlaVXNHZWM0clBIZVBtV082bW9VVlZIRXpJRjljSGFraVpjLUVCRXpyX0xzWGFBdW9Va2kya2FBVzR0bDRLVkFvZVU3STEycXFtekxxRmRnVmVxWjdPc3I3Qlpn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Apr 2024 07:00:00 GMT",
        "title": "Robinhood's 14% Unexpected Shift From Ethereum to Bitcoin Rattles Markets - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAccording to Conor Grogan, director of Coinbase, who goes by the handle \"Conor\" on X, Robinhood, the popular trading platform, has made significant adjustments to its cryptocurrency holdings over the past six months.\n\nAdvertisement\n\nThe platform has seen a remarkable surge in its Bitcoin holdings, increasing by 14% while decreasing its Ethereum holdings by 9%. Robinhood also doubled its Chainlink (LINK) holdings, per the screenshot provided by Conor.\n\nRobinhood's BTC holdings have increased by ~14% in the last 6 months; meanwhile user ETH holdings have actually decreased ~9%\n\n\n\nRetail users are beginning to come back to crypto, just not to ETH so far pic.twitter.com/PQLCswHHNF — Conor (@jconorgrogan) April 7, 2024\n\nThis unexpected shift in strategy has raised eyebrows within the cryptocurrency community and prompted speculation about the platform's motivations and implications for the broader market.\n\nRobinhood's decision to bolster its Bitcoin holdings comes amid a period of heightened interest in and adoption of the world's largest cryptocurrency. While the exact reason for the shift is unknown, what remains clear is that Robinhood's move has sparked a buzz on the market.\n\nBitcoin, often hailed as digital gold and a store of value, has witnessed a surge in institutional interest and mainstream acceptance, driving its price to new heights.\n\nConor highlights that Robinhood's cold storage address is the third largest single BTC wallet, holding 69% of all BTC ever created. Against this backdrop, Robinhood's move to increase its Bitcoin exposure might suggest growing confidence in the cryptocurrency's long-term potential and investment appeal.\n\nHowever, the platform's simultaneous decrease in Ethereum holdings by 9% has sparked intrigue and speculation. According to Conor, this could indicate that retail users are returning to crypto but not to ETH thus far.\n\nIn a surprising revelation, Robinhood does not hold Solana since they force-sold it on behalf of all of their users for $14, the absolute bottom, missing out on the 1,300% returns since then. Robinhood delisted Solana from its platform in June 2023.\n\nAt the time of writing, BTC was up 4.12% in the last 24 hours to $72,130, while Ethereum was higher at 6.75% to $3,608."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxNYjdBbHVzQ25aZnozU255LVBjVkJrUlhiRWQ4bDg1Rmw4X0tJXzBvOHRKbkYyLXAxcF9PSzQxdV9OenJoRGt1ZG91VjZlUFZlOUpPa3JMVmxFVzdVVzUwcC1sb25xODFQRHlKc0dSek50Mm5WSVk2Nkx1dmJNc1RpWC1FLXVfRUNCeFdZVmlkUk9hYmFQMkZpVXJzQ2c2UmlLVC1F0gGoAUFVX3lxTE4wenV6bFRWWVlaajJ2UEY2R2tlYWpoYmthYmJLNVh3TDZCbUJZeUFOb09zREFreUFHSC1oandfUmlUMzRENWx4OWRMVXpTOVNKSTdocWFPcS1QV192WlF4VW95QjJXRXpsVE5aS3NWOERjXzVDTU1xRG9ZcF9YLUpNSlNDeUJFbTNWQ2UyLTE2TUVhc3loaUpOcE5yU3E1QklOWHhpN0k0Mw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Price: Veteran Trader Peter Brandt Warns Of ETHBTC “Bear Trap”, Rally Ahead - CoinGape",
        "content": "Ethereum price continues to trade under $3,500, failing to gain despite high anticipation surrounding the Dencun upgrade. Also, ETHBTC just had its lowest weekly close since April 2021. However, legendary trader Peter Brandt known for accurate predictions says the Ethereum price could be in a “bear trap“.\n\nIs Ethereum Price In A Bear Trap?\n\nPeter Brandt, last week, said Ethereum is a “junk coin” and Bitcoin pretender, but agreed that it will always attract investors. In the latest post on X, veteran trader Peter Brandt indicated Ethereum price could be in a “bear trap”.\n\nadvertisement\n\nA bear trap is a false technical indication of a reversal and the possibility of Ethereum price in a bear trap is higher than a reversal due to bull market and positive sentiment. ETH price has dipped new 35-month low, with dominance falling below 16%. The reason is Solana’s unstoppable rally and upcoming Bitcoin halving.\n\n“There are enough HUGE whales invested in ETH that it will be difficult for the price to depreciate very much,” said Peter Brandt.\n\nSpot On Chain signaled heavy buying of ETH by whales. For instance, two whales spent a total of $35.11 million in stablecoins to buy 10,322 ETH, causing a recovery in price. The trading activity is also high after ETHBTC is at record low level.\n\nIntoTheBlock revealed on-chain activity to pick up radically and reaching highs of 32 million transactions per week as L2 gas costs dropped significantly after the Dencun upgrade.\n\nAlso Read: Ripple Vs SEC — Good News from Court on Crypto and XRP Secondary Market Sales\n\nETH Price to Rally Towards $4,000\n\nPopular analyst Michael van de Poppe stated Ethereum price looks attractive at the current level as it is at a crucial support zone and is still trending down. “However, this is the region where I’m looking to get myself even more into the Ethereum ecosystem, he added. Also, there is an investment opportunity amid negativity surrounding Ethereum.\n\nETH price jumped over 1% in the past 24 hours, with the price currently trading at $3,426. The 24-hour low and high are $3,370 and $3,458, respectively. Furthermore, the trading volume has increased by 7% in the last 24 hours, indicating a rise in interest among traders.\n\nEthereum futures open interests across exchanges has also increased more than 1% in the last 24 hours. The rise in prices and OI indicates a likely recovery in ETH price.\n\nAlso Read: Bitcoin (BTC) Price Stabilizes Before March CPI Data and FOMC Meet, What’s Next?\n\nVarinder Singh Varinder has 10 years of experience in the Fintech sector, with over 5 years dedicated to blockchain, crypto, and Web3 developments. Being a technology enthusiast and analytical thinker, he has shared his knowledge of disruptive technologies in over 5000+ news, articles, and papers. With CoinGape Media, Varinder believes in the huge potential of these innovative future technologies. He is currently covering all the latest updates and developments in the crypto industry.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxQMUNoNHFuMWRZVkdyWkVWZEdOb3hYX2Nub0pXWHQzeTM1WGpyRnk2Yi1acVhmMDRtOVdjeUtTMzhyQlVkTk9ScWg4VzI0RzdhLU40cTZsNEI5eFhxRkgtTWlUTVBad3g4aWpDUklWTU9pamtJTWJjeWpjV1NnWUtSMmlZN2tKWE5hZUZyYVV6WFFqOElhYjZwV2ZXZXFXdWZzOXk1Z2hYNm1pQWlrbnNqaTFlVVRQV3QwUXRFbzh0VWNXUk4tSnfSAcsBQVVfeXFMTWRUQ0pLelVDMWp6RThBX0VJZ3lzeVhMWXFucW1YZ25ESjR0VWFuZDJ0aUpzTHFtUnhSWTI4Yjk1TXlreW50MS1kdzlmZ3lrY0k4dWxXWVhmcXR1bUwtNmNybkFRYkc4NlJIaW1vMFROZmZhV0VIUWUzNjNGMFotNkNnUk1LbENSbDdWM1ZHNWxQTUFRRWkyYUQ2WmZOTnRWdFdEV3RBVTE5MEJnYzd6WFdadWQ5a0JwdndHandCLXA4cmhVRFFRTFkzSmM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 07 Apr 2024 07:00:00 GMT",
        "title": "Top Analyst Says Altcoins Will Continue Massively Outshining Ethereum (ETH) – Unless This Happens - The Daily Hodl",
        "content": "A trader who rode last year’s crypto breakout thinks that Ethereum (ETH) will continue to underperform unless something monumental takes place.\n\nPseudonymous analyst DonAlt tells his 535,700 followers on the social media platform X that he expects other altcoins to massively outperform Ethereum as soon as market conditions improve.\n\nDonAlt believes Ethereum will continue to be a laggard until ETH witnesses a catastrophic collapse.\n\n“Everything down. ETH down but ETH down less.\n\nRejoice ETH holders your time has come (Down in USD, up relative to the rest of the sh*tters).\n\nI legit think this is the only way for ETH to go up for a while.\n\nOnly if everything dumps can ETH outperform. The moment things go up, others will just outshine it massively until we get a massive capitulation on ETH, then it’ll start leading again probably.”\n\nDonAlt has been bearish on ETH since September of last year, tracking the performance of the leading altcoin against Bitcoin (ETH/BTC) when it was trading at 0.06 BTC. Since then, the pair has lost nearly 20% of its value, now trading at 0.0487 BTC ($3,382).\n\nLooking at Bitcoin itself, DonAlt believes that BTC’s current consolidation is setting the stage for the crypto king to print new all-time highs.\n\n“Low timeframes look much better above $68,300. They look terrible below $65,000. Kind of a toss-up in between in my opinion.\n\nThe longer the range, the better for bulls, digesting the move from $30,000 to $60,000 by going sideways would pave the way toward $80,000+”\n\nAt time of writing, Bitcoin is worth $69,461.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxPMkZ1SlhCYUREMkxYRFJQcmlTcGlTYTZsY3FjeGIwX1VNU1dqeERCVWRlWEMxZzdFRmlBU0FQVFh4Qnd2YmVSalNFc2cweDlWTWtxNkNtaWFGWEgzUUNma1JVYjhpYWZHSXJ3V3VFVDNyU1BmSzRubHlzZW5FamZrcHlqT2hNMnBFcWxkU3VfNVRGZ9IBlwFBVV95cUxNZk5vUDk5UzVKRmFVMFVnTDRpalRzeFgtOW9RbXB2OUxQVWRkLXhaN3ZlMzFseEV6RWVBbUNudGxOdFE4Z3BVd0o2Um85a2hQT1B4MmRFMFRIcUl3bG9MaWFNOFdIS1dfMHlxeGRxdTdmZEV3dS0ycXVEd3o4ODNxSUtyOTRMU3V0NzFyallDQmprNklpM1g4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 07 Apr 2024 07:00:00 GMT",
        "title": "Why Solana will ‘double in value’ against ‘junk coin’ Ethereum: Trader - AMBCrypto News",
        "content": "Brandt predicted that Solana could double versus Ethereum.\n\nSolana showed significant growth despite recent network issues.\n\nSolana [SOL], a cryptocurrency that previously aimed for $200, has encountered setbacks amidst a bearish sentiment in the weekly charts.\n\nHowever, its 24-hour price cycle depicted a 3.56% surge, mirroring optimism in the border market. Inasmuch, renowned crypto trader Peter Brandt, in his recent X (formerly Twitter) post, noted,\n\n“The $SOLETH chart is at huge resistance. Resistance = supply. If this supply line is absorbed, then there is a prospect of $SOL doubling in value vs. $ETH.”\n\nEthereum vs Solana\n\nThis isn’t the first time Brandt has criticized Ethereum, underscoring ongoing debates within the crypto sphere about its position and potential. On the 5th of April, Brandt tweeted,\n\n“I get tired of saying it, but $ETH is a junk coin despite mindless devotion of Etheridiots. As a store of value it is junk – a $BTC pretender.”\n\nDespite his criticisms, Brandt indicated his willingness to take advantage of Ethereum’s [ETH] market fluctuations.\n\nAmidst these setbacks, Solana’s recent network congestion and transaction failures have also stirred discussions within the crypto community.\n\nAddressing the concerns, Matt Sorg, Solana’s Tech and Product Lead, said,\n\n“Solana is a highly efficient protocol that hasn’t nearly hit its scaling ceiling. This particular issue doesn’t hit the transaction processing part of the protocol and isn’t an issue of failed transactions.”\n\nWhat’s on the price front?\n\nSurrounded by various downturns, Solana experienced a 2.2% drop last week, however, it has shown substantial growth, climbing by 34.15% in the past 30 days and an impressive 752.41% over the last year.\n\nAnalysts interpret this recent short-term decline as a temporary setback within Solana’s overall upward trend.\n\nErgo, with the Bitcoin [BTC] halving anticipated later this month, experts see the current market downturn as a potential opportunity for investors to enter the market before an expected recovery."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxOMzZseEV2S0RkdUNhZmpUbVpFNXZ4R0NPU2IyUXhScW05WFBxY3h3NEFsTE5kVnBKb0o3UnFGMWgyV2FSQUR4XzNudGRRQkh4V2ZsN3Z1VmVCeEkzbDdkOXAwLWgyWDkwX0h4S3FZNjFBaEJhcFpxZ0Etc1VjNUF4T1ZzMXJrTE0yZzNNaNIBkgFBVV95cUxPZXIzbFp2WGNra0dpMVk1WFVOVHNiMjNwUDRfM3F1YmVmOUpIY1dYYWxFcGt6ZUdUWktUeWV6YzZ6VjZCdmI3OHRkSlhxSVBLUG9OSnFvYlZ2Vl9JUlJvand0QXJwY29IS192UW9kTDgxQW5DdERITVZPek1Ha2ZEUlhYbjB2Qy1hUHR6VW15SXM4dw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Apr 2024 07:00:00 GMT",
        "title": "Base tops Arbitrum, Ethereum as it leads with 48M transactions - AMBCrypto News",
        "content": "Base outperformed Ethereum and Arbitrum in terms of activity over the past few days.\n\nInterest in ETH and ARB remained high however prices remained stable.\n\nCoinbase’s Layer-2 scaling solution, Base, surpassed Arbitrum [ARB] and Ethereum [ETH] in terms of daily transactions and activity.\n\nThe L2 sector gets competitive\n\nAccording to L2Beat data, a close race emerged for dominance among the L2s. Base led the pack with a significant 47.78 million transactions processed in the last 30 days, followed closely by Arbitrum One at 39.26 million.\n\nEven Ethereum itself processed a substantial 37.90 million transactions, highlighting the overall network activity.\n\nWhen it comes to processing speed, Base emerged as a clear leader. It achieved a daily Transactions Per Second (TPS) of 35.19, reflecting a remarkable 36.12% increase. This placed it well ahead of Arbitrum with 17.80 TPS and Ethereum with 14.38 TPS.\n\nIn terms of Total Value Locked (TVL), Coinbase’s Base made significant strides. Despite facing network congestion concerns earlier, it managed to secure a TVL of $1.3 billion.\n\nThis was coupled with an impressive 29.71 increase in transaction volume over the past week. The surge placed Base ahead of Arbitrum One, which currently sat at $3.2 billion TVL after experiencing a 1.61% transaction decline.\n\nEthereum remained the TVL leader at $51.6 billion, but it dipped slightly (3.07%) in the last week.\n\nThese trends suggested a potential shift in the L2 landscape. New entrants like Base have outperformed networks such as Arbitrum.\n\nEthereum stands to benefit\n\nEven though Ethereum itself might be losing some ground in terms of raw transaction volume, it remains the foundation upon which these L2s operate.\n\nAs L2 adoption flourishes, the overall Ethereum ecosystem strengthens, leading to a more robust and valuable network in the long run.\n\nDespite these factors, both ARB and ETH witnessed a correction in price over the last few days. Even though the price of the tokens fell, the number of addresses holding both the tokens had grown.\n\nThis suggested that the bullish sentiment around these tokens persisted, however, it wasn’t significant enough to impact price movement.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nAt press time, ETH was trading at $3,386.65. In the past 24 hours, ETH grew by 1.48% in the last 24 hours.\n\nARB, on the other hand, was trading at $1.49 and its price had grown by 0.99% in the last 24 hours."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxPQmY2dGVrMkVOLWlZVkVkVk9kMHlwNTBLM0kwd1dUdldxV1pjb2FXRnRLMGdnTnpYdjNhMmJhMWkyazFDZDVxWjZYZTF5dlJVRldGVTJpU3dRLWtrbVgxckNrVUxMOTZIdHV2bjhlWVJpeHhlTTVEdHRPX3BiZnhnTWdFX2dkencwSWVNNzJILWNxWVZUQkZv0gGcAUFVX3lxTE82Sk5TX0VrMUZmOGwwaUFNdW55bmt5aW9ja0tqRTdsVERMdUN3SUJ6M0Iwa0RZWjRSclc1d2NxeE1LUkFTTmVlU0dkN21kTklLYWgtM3VTQWUtQjNKM2FPeEFvaGhrb3BNRkxleVh2X2FoS0N3SE9IWU9KMDYyU190NnMzU21Lc2NUQTNmM2FYVjY5SVpmQzIybnZwVg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 07 Apr 2024 07:00:00 GMT",
        "title": "Ethereum and Polygon Attract Majority of New Users: Flipside Report - CryptoPotato",
        "content": "Ethereum and its Layer 2 scaling solution, Polygon, attracted the most new users by far in the first quarter of 2024.\n\nThe latest report by Flipside revealed that these two blockchain platforms have garnered the most cumulative new users among observed EVM chains since the beginning of the year.\n\nPolygon boasted 12.3 million new users, and Ethereum had 13.4 million – roughly 70% of new users this year across all observed chains as of March 27. Next up was Arbitrum, recording the most new users (4.7 million) during the same period.\n\nTaking into account Ethereum and Polygon’s extensive history compared to most EVM chains, it’s not surprising that they hold significant dominance. In relative terms, the growth in new user volume for Ethereum and Polygon was only 298.3% and 359.7%, respectively, between January and March 2024, which places them in the middle of the pack among all observed chains, Flipside said in its report.\n\nDeFi – Main Driver of New User Growth\n\nDeFi has emerged as the primary catalyst for new user expansion across various chains this year. Among all monitored EVM chains, DeFi trade volume has surged since the beginning of the year.\n\nEthereum leads with a cumulative $1 billion in trade volume, with its busiest trading day recorded on March 5, when figures exceeded $428 million. In fact, March proved to be the most active trading period across all observed chains.\n\nWhile DeFi trading activity on Optimism and Arbitrum experienced slight declines in the past week, overall, DeFi activity has displayed a consistent upward trajectory. This stands in stark contrast to the erratic market fluctuations experienced throughout much of 2023.\n\nAlthough Arbitrum lagged significantly behind Ethereum and Polygon in acquiring new users, it managed to secure a strong second position in terms of new user trading volume, amassing $9.5 billion since the start of 2024. This difference in performance was attributed to Polygon’s high NFT trading volume this year, which hit a daily peak of $6.3 million in early January, compared to Arbitrum’s lower daily high of $229,000 in mid-February.\n\nNew User Growth Shows Mixed Results in NFT\n\nNew users’ engagement in NFT activity has shown “mixed” patterns, with the two largest chains experiencing contrasting trends. In comparison to DeFi, the growth of new users based on NFT activity has displayed greater volatility depending on the network.\n\nWhile Polygon’s new user NFT trading activity has consistently decreased since the start of the year, activity on Ethereum and Base, on the other hand, has steadily risen. Across all other chains, NFT trading has fluctuated from week to week without any clear pattern.\n\nEthereum and Polygon have maintained the highest USD volume of NFT transactions since the beginning of the year. Ethereum’s daily volume has remained consistently above $1 million since January 1st, whereas Polygon’s peaked in early January at over $6 million before declining to less than $500,000."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxQRTdadlJZMHE0RFI2OGJMdDN3ZkgtV1lRaEZfbm1UT0JZbk5BcG9VdUVFS2lMNW0teTN6b0NZV2U2NHU1MU04aC1FR0NPYmVPQjF3cjI1azRVSGVBci1jOGx6VUV4enNFTWFkYkxnUzMyVG13S2tvWEZHYUhyeE9HMk43bHRLRnd0UzBnbXNEOWZyRXhLM3ZiSEdLUjZhQdIBowFBVV95cUxQalJpeHFzb3hRRW1MWFM5dklQVS1CS1lkanAtdVliR0ZvcDk5RFdUUUo4NmpydG1kZ1V1QlNHa21pWU9tTXE2Y2VkallwN2ptSm1ra3c0R0pUY1ZQblkxZHQyd3c5eENSQnhod0JxVDdJSjJqemQxUERzZHRvOU5uWldyR2Z6R0x6dVBmTUcyaXVmUmZndnpNaFZMRGlkUEtyR3E0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Apr 2024 07:00:00 GMT",
        "title": "Crypto Prices Today April 8: Bitcoin At $69K, Ethereum Above $3400, XRP & SOL Dip - CoinGape",
        "content": "The top crypto prices today witnessed a bearish turn while the Bitcoin (BTC) price sustained above the $69,000 level. In addition, the Ethereum price gained slightly and traded above the $3,400 mark. Meanwhile, other top altcoins, such as XRP and Cardano (ADA), Solana (SOL) dropped in value.\n\nMajor Crypto Prices Today\n\nThe Bitcoin price was up by 0.29% reaching $69,558.21 at the time of writing on Monday, April 8. On the other hand, it’s trading volume gained by 0.01% to $20.56 billion in the last 24 hours. Whilst, the crypto boasted a market capitalization of $1.36 trillion.\n\nadvertisement\n\nLooking at altcoins, the Ethereum price gained 0.91% to $3,427.74 at press time with a market valuation of $411.57 billion. Whilst, ETH saw its trading volume rise by 3.80%, reaching $9.74 billion. Meanwhile, the Binance Coin (BNB) price dipped 0.76%, reaching $584.27. In contrast, its 24-hour trade increased plunged by 3.42% to $1.38 billion.\n\nThe Solana price continued trading below the $180 mark today. The Solana price declined 2.28%, settling at $177.03. In addition, SOL witnessed a whopping 41.93% decline in trade volume to $1.77 billion in the last 24 hours. Whilst, the XRP price sustained the $0.59 level. The XRP price recorded a drop of 0.43%, reaching $0.5932. On the other hand, XRP’s trading volume surged 9.66% to $958.58 million.\n\nMeanwhile, the Cardano price dropped 1.15% to $0.5836 today. Whilst, ADA recorded a 23.20% hike in its 24-hour trading volume, settling at $309.47 million. As the top crypto prices experienced a mixed action today, the meme coin arena witnessed volatility. The Dogecoin price surged by 1.84% to $0.2006 while its rival, Shiba Inu price slipped by 0.85% and traded at $0.00002811.\n\nAlso Read: Bitcoin ETF Regain Momentum With $484M Inflows, What’s Next For BTC Price?\n\nTop Crypto Prices Today Are\n\nPepe Coin (PEPE)\n\nThe Pepe Coin (PEPE) crypto, a popular Solana meme coin, rebounded significantly despite the bearish sentiment. At press time, the Pepe Coin price was up by 3.34% to $0.000007329 with a market valuation of $3.07 billion. In addition, the 24-hour trade volume for PEPE soared by 60.31% to $519.88 million.\n\nNervos Network Rallies 6%\n\nNervos Network (CKB) recorded a surge of over 6% and ranked as the top crypto gainer today. The CKB price was up by 6.54% to $0.02762 at the time of reporting. However, its trade volume slumped by 2.86% and stood at $297.55 million. Furthermore, the CKB crypto recorded a high of $0.03214 amid the rally today.\n\nAlso Read: Will Dogecoin Price Surpass $0.25 Barrier in April?\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxPVDBhd2dlanNMdmFhQkdKdEpIbjA1Mm1ZQTJubHQyU3hWaUN6S0xaYW80NGhXV0paUW0xeXpUQnFMMzdaMHV6M3BaZU5iRG4xaUNOWG1XSlVzbmtSdkg5dnpnZWpNWmRsS1dMSE9oSTNJNktURDJQaHh5NzRpZnBmYk8wbzjSAYoBQVVfeXFMTkszVTBtVzl2RWVWLTZCUlVJU3V5UGVjNXJoWVFWalpIcmt6QTFUYjhhRVdBcXN6QTBPZ2hLTk9Nck5CMGl1bFprZzljcnZvLWNMT1hTWl9MZEFZTTR4VEI0TUpUcEp2d29mazlyQ2dzalVBMmtUTU9ReHQ1T1BDNWZMZFNLczM0c1Nn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 07 Apr 2024 07:00:00 GMT",
        "title": "Ethereum: Here’s how the market bought and sold ETH in Q1 - AMBCrypto News",
        "content": "ETH’s exchange outflows totaled $4 billion in Q1 of 2024\n\nMVRV ratio suggested the coin was trading slightly below its realized value\n\nAccording to data released by IntoTheBlock, Ethereum [ETH] outflows from cryptocurrency exchanges totaled $4 billion in the first quarter of the year. This signals a surge in coin accumulation by market participants over the 90-day period, despite the 10% decline in ETH’s value after it peaked at $4065 on 11 March.\n\nThe altcoin’s rally above $3500 towards $4000 between 4 and 19 March triggered a wave of sell-offs. This contributed to a hike in its exchange reserves, with a year-to-date (YTD) assessment of the coin’s reserves revealing a 5% decline.\n\nThis decline showed that ETH accumulation significantly outpaced distribution during the quarter.\n\nETH on-chain in Q1\n\nBetween January and March, the number of ETH wallet addresses holding between 100 and 100,000 coins fell by 2%, according to Santiment. This underlined a decline in ETH holding by its investor cohort, known to be market movers.\n\nAt press time, 45,623 wallet addresses held between 100 and 100,000 ETH. These addresses currently hold 36% of ETH’s circulating supply.\n\nConversely, during the period under review, the number of shrimp addresses holding between zero and 100 ETH coins climbed. As of 31 March, their number was 118.25 million, up 6% during the year’s first quarter. At the time of writing, this category of ETH holders controlled 10% of the coin’s supply.\n\nAlso, the surge in ETH’s price above $3500 in Q1 led to a spike in its Market Value to Realised Value (MVRV) ratio.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nThis metric measures when an asset is overvalued or undervalued. When its ratio is high and on an uptrend, it suggests that an asset’s market value has exceeded its realized value. When this happens, most asset holders will be in profit.\n\nConversely, when an asset’s MVRV ratio declines, it is deemed to be undervalued relative to its realized value. Investors who choose to sell their holdings at this point during the market cycle often do so at a loss.\n\nETH’s price rally to $4000 on 11 March pushed its MVRV ratio to a YTD high of 138.38%.\n\nAlthough ETH’s MVRV ratio also declined after its price fell from its peak, it closed the quarter with a value of 107%. Below 100% at press time, ETH’s MVRV ratio showed its price was slightly below the average price at which all coins were last moved on-chain"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxQTkkwWkJfemU3RHQwNl9jMXZaTjhOcDh4TnlUZDBCVmgzMTJvdU9QLWhGSGhNMEw4R2wzRFNSZmVvSFh1QmY4ZV9jcXA5SHZTZ1czbWR0eDEzbzluaEltWWw3MlNCWnJERmJnTkxydjF3SE94VWxNVjB1ZXdOS0NBZ0FXd2U3V0lEbk9sYVBCdzJwcmV1Z2l2dEFB0gGfAUFVX3lxTFBUSEppQ20yd1ZBYVpYbGF1aDhkOFhEVGhqNzJvVVc4Q0FQX3QtQm5yN3h6U2RRanNCRWdiUDRTVVlxT1IzZG52WWZ2ZU1JNUx1blNIenRaaEphNUJDSjg1amNYeW1BQ1JjS29JNmxudFprclg3WmUzZDFKdFhsTFVYYzdjMERRVWEtQVphV09peDlNdFFLSnc2LUN2Vnp3VQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Apr 2024 07:00:00 GMT",
        "title": "March 2024 Report: Bitcoin vs. inflation, Ethereum NFTs, and April forecast - AMBCrypto News",
        "content": "Context of the article\n\nThe global economy is recovering from the period of saturation, and major indices across the globe are booming. Though inflation has eased in most nations, policymakers warn that achieving the Central Banks’ target of around 2% will be quite hard. Indermit S. Gill, Senior Vice President and Chief Economist of The World Bank Group predicts advanced and developing economies—are set to grow more slowly in 2024 and 2025 than they did in the decade before COVID-19.\n\nSo, the pertinent question – 2024’s crypto boom: Is it a sign of recovery or a bubble in the making?\n\nLet’s find out\n\nFor more than three weeks now, the Crypto Fear & Greed Index has been above the 70 mark. The index ranges from 0 (extreme fear) to 100 (extreme greed), a high value is a warning of a potential market correction. Over the past two months, there has been an unprecedented level of demand – something that the crypto market has never seen in its entire existence.\n\nAMBCrypto’s research report for March 2024 reveals U.S. billionaires have been selling their stocks. Out of all the sales, the much-talked-about has been that of JPMorgan Chase & Co. CEO Jamie Dimon who sold $150 million worth of shares in the banking company for the first time in 18 years. Each billionaire has their own reasons, but it might have something to do with growing interest in cryptocurrencies from big money players.\n\nWhat coins were the March Market Movers?\n\nBitcoin\n\nThe king coin hit a new All-Time-High (ATH) at $73,797.35 on 14 March with its market cap surpassing that of Silver. While analysts have been predicting $100k as the next ATH, the AMBCrypto report argues Bitcoin hasn’t reached its ATH figure yet and investors are trading it with a false sense of achievement in mind.\n\nand investors are trading it with a false sense of achievement in mind. Interestingly, as soon as the coin crossed the $72k level, the Long-Term Holder cohort increased their overall distribution pressure. Consequently, the market saw over $2.6B/day in realized profit .\n\n. Now, if BTC manages to turn the $70k level into strong support, New Yorkers will benefit most from the price surge . It’s important to note the $70k psychological level is a good liquidity area. It has already been tested as resistance multiple times. Thus, strengthening the case for the bulls.\n\n. It’s important to note the $70k psychological level is a good liquidity area. It has already been tested as resistance multiple times. Thus, strengthening the case for the bulls. Meanwhile, the arrival of a Bitcoin spot ETF has been a major boost for the cryptocurrency, with inflows of roughly $12.1 billion by the close of the first quarter .\n\n. The good news is most of the investors holding BTC in their portfolios are profitable, at the moment. As per the Supply in Profit metric, on 1 April, 18M addresses were in profit, this was an increase of 3M from its cycle-low of 15M.\n\nEthereum\n\nWith the Dencun upgrade going live in March , Ethereum unlocked a new level for developers’ growth as the scalability-related challenges and gas fees issue were addressed.\n\n, Ethereum unlocked a new level for developers’ growth as the scalability-related challenges and gas fees issue were addressed. Ethereum’s price has successfully maintained its $3500 support. It reached $4000 recently, the highest point in nearly two years. This could be attributed to various factors, including increased DeFi activity and anticipation of the Dencun upgrade .\n\n. AMBCrypto’s research report reveals that the outlook ahead for Ethereum is positive and the anticipation of a spot ETH ETF could shape its future rally .\n\n. Notably, after a big sell-off on 14 March, the top 10,000 richest wallets bought 42.56 million ETH. This buying spree is expected to help Ethereum have a good start in April 2024 for two main reasons. First, these big investors have a lot of power over the price of Ethereum and can affect how regular people invest too. Second, these wallets usually plan to keep their holdings for a long time, which could mean April might not see a lot of sell pressure.\n\nMemecoins and DePIN sector\n\nIn the past month, meme coins like WIF, PEPE, and FLOKI saw a big surge in their prices, doing even better than popular ones like DOGE and SHIB. Many traders saw their investments surge by triple digits. The trading activity, consequently, reached a peak last seen in November 2021. According to AMBCrypto’s report, many of these traders were hoping to make enough money from meme coins to buy Bitcoin later on.\n\nin their prices, doing even better than popular ones like DOGE and SHIB. Many traders saw their investments surge by triple digits. The trading activity, consequently, reached a peak last seen in November 2021. According to AMBCrypto’s report, many of these traders were hoping to make enough money from meme coins to buy Bitcoin later on. During every big surge in the crypto market, there are popular stories that catch everyone’s attention. For example, in 2017, people were excited about ICO coins and privacy coins. Then, in 2021, DeFi, NFTs, and layer 1s became the big things. Now, analysts predict that during 2024-25, DePIN will be the most important trend in the crypto world .\n\n. Since the start of 1 January 2024, DePIN Market Cap has grown by $35,370.826 million. Solana saw the most significant rise in trading volume among major DePIN projects, with a notable increase of 52% over the past 30 days.\n\nThe biggest loser\n\nAccording to Alex Casassovici, founder of Web3 streaming project Azarus, we are witnessing the first real bear market for NFTs. Indeed, the NFT Sales Volume in the last 30 days has fallen by 8.50% while the NFT transactions have declined by 45.79%. NFT sellers, on the other hand, have increased by 45.25%. Thus, painting a very bleak picture for the overall market.\n\nInterestingly, AMBCrypto’s report reveals a surprising outperformance by Bitcoin NFTs compared to their Ethereum counterparts.\n\nRead Bitcoin’s [BTC] Price Prediction 2024-25\n\nAbout Crypto Market Report – March 2024\n\nAMBCrypto’s latest report is a comprehensive analysis of March’s market trends and it offers valuable insights for predicting market movements in April.\n\nThe report dives into key topics like –\n\nBitcoin vs. inflation\n\nBTC’s next ATH projection\n\nEthereumization of Bitcoin\n\nETH’s price potential\n\nNFT market dynamics\n\nMarket forecast for April\n\nYou can download the full report here."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxPVGZMY0dUeVptT0hhZloxOThUWEVoYTZEamN3T2VoVTlmUGI3Z3c0b1lOZHc2ODlFX3lzQ0hISjJJSmNfLTY1bFRkbW94ckl3V0tYWkVxc2lNcHN0S245VUZQTlEtOTdyNEZqQnBNM0VMVkp0a2QyVXF4Wm5MZFNaUWwtZG9FMThYQVloQk1sYlR2VmVIYnVNTkxrRm1jNUwxd0VhTmJBQ0ZlRWFy0gGyAUFVX3lxTE9BRERtUXVneEFRdUF4M3UtUGp2dDFkeEduT2lUX19yVUE3R1B5QXJ0QXF5cE9TOGYyekZFWUpDZkoyb1U3RXM4d2xieE0tN1phV3NXTWZlTGk5d21KS1k5ZUt4OGdIT2s3UkdJYjZqaEEyR2tMNUlDNndQbTNyRzVVOWRCekhIMHhyN0FwQ3l2SGtjNkMwVXRzeU0zMEM2dDNJUzg4OTFRc0RhdXBjZlJ2RHc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Apr 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum, and XRP Price Prediction For This Week: What’s in Store? - Coinpedia Fintech News",
        "content": "Sohrab is a passionate cryptocurrency news writer with over five years of experience covering the industry. He keeps a keen interest in blockchain technology and its potential to revolutionize finance. Whether he's trading or writing, Sohrab always keeps his finger on the pulse of the crypto world, using his expertise to deliver informative and engaging articles that educate and inspire. When he's not analyzing the markets, Sohrab indulges in his hobbies of graphic design, minimal design or listening to his favorite hip-hop tunes.\n\nAs the Bitcoin Halving event comes closer, the volatility in the crypto markets grows intense. With the Bitcoin price witnessing sharp fluctuations this week, the altcoins chart a chaotic sea.\n\nAmidst this rising volatility, the top coins like Bitcoin, Ethereum and XRP showcase an opportunity for strong-hearted investors. Bitcoin and Ethereum are projecting a longer bull run based on the prevailing uptrend. In the case of XRP, the prolonged consolidation and the ongoing pullback are approaching a spot of bullish reversal.\n\nSo, will the Bitcoin, Ethereum and XRP price trends enter a bullish frenzy and prove the market predictions right? Let’s look at the detailed price analysis of these tokens for a more educated viewpoint.\n\nGrowing Chances of Bitcoin Hitting $100,000\n\nDespite the recent bullish reversal, the bulls are under pressure, which has led to a side trend in Bitcoin prices. In the 4H chart, the bullish reversal from the 200 EMA fails to sustain above the 50 EMA.\n\nTradingview\n\nFurther, the trend analysis over the past weeks reflects a triangle formation, projecting a contraction in the Bitcoin price range. However, the breakout of either boundary trendline could lead to a massive rally, defining the future trend.\n\nOptimistically, the breakout rally on the upside could drive the BTC price higher to the $100,000 mark. Supporting the bull run, the Bitcoin halving craze and the increased institutional interest might prove as crucial catalysts.\n\nWill Ethereum Take A Bullish Reversal?\n\nTaking a similar route as Bitcoin, the Ethereum price trend shows an intense bear run in the 4H chart. With a downfall to the $3,200 support zone from the peak of $4,000, the sellers are gaining trend control.\n\nTradingview\n\nThe downfall leads to a death cross in the 4H chart and a strong resistance trendline, keeping the bullish reversals under check. Currently, the ETH price trades at $3,338 with a growing sideways trend.\n\nFurther, the lateral trend leads to a consolidation range with an overhead ceiling at the $3,373 mark, aligning with the 23.60% Fib level. Despite the multiple bearish elements, the daily RSI line shows a bullish divergence in the past few dips at the support zone.\n\nHence, with the chances of a bullish breakout, the ETH price could reach the $3,506 level or the 38.20% Fibonacci level. In such a case, the biggest altcoin will reach a pivotal stage and challenge the overhead trendline. Optimistically, the trendline breakout could slingshot the Ethereum token market value to $4,000.\n\nAlso Check Out : Bitcoin Price Facing Crucial Resistance, As Analysts Seek Out Bigger Gains\n\nWill Ripple Mark A Comeback in April?\n\nAfter Bitcoin and Ethereum, the XRP token shows a high potential for a bullish trend this week. Despite the market value being down to the 200D EMA, Ripple’s native token is projecting a potential reversal to the upside.\n\nTradingview\n\nWith a downtick in the 50D EMA, the XRP price is under the $0.60 mark and warns of a death cross. Nevertheless, with the 3% uptick followed by a long-tail candle last night, the daily chart projects a potential reversal in the XRP price.\n\nConsidering the buyers’ ability to sustain momentum, the XRP price is poised for a bull run to the 61.80% Fibonacci level at $0.68.\n\nWhat’s Next For Bitcoin, Ethereum, and XRP Price Trend?\n\nDespite the growing volatility and fluctuations, the market predictions for the top coins remain bullish. Hence, with the ongoing pullback, the sideliners are getting an opportunity to buy the dip before the highly anticipated bull run this April."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxOZmRHbmc0RDJmVzgtV2pZZjVuQWJKNXYwN0lMMFpULUZCbEJZclpCZFNYOVRDQjdHVkl2YTZUNlFGR055R0FYVmZqRW9jdjZ1Y3V2WWFwT2VuaFpxYjI5U0hxRTQzMF9XTUt2ZVR5c3pnM0kteWxFX1BUanpwVEVkSTZ1V3gtQ0FLSHhFYg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 07 Apr 2024 07:00:00 GMT",
        "title": "Ethereum ETF Approval Chances Hold Firm at 14% on Polymarket - Coinfomania",
        "content": "Grayscale’s recent survey highlighted the approval of a spot Ethereum ETF could increase US investor interest in Ethereum by 25%.\n\nThis increase in interest is driven by economic concerns like inflation and worries about financial stability, particularly among younger individuals and minority communities. 40% of voters from the previous year desired to invest in cryptocurrency. Due to economic instability, that percentage has increased to 47% this year, indicating that more individuals are interested in digital assets.\n\nSource: Grayscale\n\nAccording to Grayscale’s survey, many Americans are drawn to cryptocurrencies because they see them as a way to achieve financial stability and manage their expenses.\n\nEconomic worries have historically influenced crypto interest. Bitcoin’s limited supply allows it to function like gold, acting as a store of value. Grayscale found that familiarity with cryptocurrencies increases the likelihood of seeing Bitcoin as a hedge against inflation and other macroeconomic events.\n\nDemographic Ownership Patterns\n\nNearly 70% of people surveyed said they own some form of investment and around 19% own cryptocurrencies. Men, Black and Hispanic voters, and younger people have higher ownership rates. Gen Z respondents, in particular, reported a 31% ownership rate, with many saying they are more interested in cryptocurrencies because of inflation.\n\nDespite the FTX crash, enthusiasm for crypto remains strong in the US. Approximately 40% of investors believe their future portfolios will include Bitcoin.\n\nGrayscale’s data shows that cryptocurrency interest transcends political boundaries. Ownership rates are similar among Republicans (18%) and Democrats (19%). Voters are split on which party is more favorable to the crypto industry, with 30% believing both parties have a favorable stance on crypto policies.\n\nThis balanced interest aligns with recent bipartisan support in Congress for the resolution of SAB 121, enabling banks to serve as custodians for crypto, making it more accessible.\n\nPolitical Views on Crypto\n\nHowever, differences exist in how each party views the importance of crypto-related issues. Republican voters are more likely to prioritize inflation and the economy, with 54% compared to 33% of Democrats. Conversely, Democrats focus more on issues like gun violence, climate change, and income inequality.\n\nMeanwhile, Bitcoin and Ether prices continue to be affected by government sell-offs and Mt. Gox’s repayment. Bitcoin has stabilized around $57,000, while Ether stands at $3,027 as of press time."
    }
]