[
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMi3AFBVV95cUxNa3hiLUd3Y0RTbGVUY0NwLVYzZEVPUm1YMVBPajVKRTkzWjBQalBIalp3RW56TXhiVkduOHlDeFhqUkw4c3M5WFJyeVdXazR1UHhfdHUzZXFnaU5qblJncHMtRTh4MHR1elVxeGRidGdONXRYZk52WnVISmtWTlFYSUp0cnpLLU5HbnhEdnVCbjk5WGJ2OUNrbEY2X2U3SDU0WHQwUzVVMVBJcXk3OGJ4WC1QRjJMT1F2X09yTGJtZ2twOU9WVnJHOFRjSy1ZVklmaFR2RWJySXQ2QnpJ0gHiAUFVX3lxTFBWRzhkT1ExLXZWa0wyMHFIeUk0YXhPbjZQOXQ3eE9wR25JaHZ0bXVxeFVoU2xiV0xxTnhjVjZ1Rm5NeGtTM0pXclZjcnB5dUlNU3VTYUhadlQzVlFWMHBGajVFN2hjYzlEWmsxR3hvbENVX0NHWUlVWEdLaGRxaFk3T3UtVjJqblJEamJZRE1BSEI3Z0RnYXIwckFvYjJWVE1ZWUV5cTZORXMzeXZfdW9pOXZJOW5WT3lQczBSQjc3LUhVUnBGX3l5N2dMTHAyaEVlQ3FEUEU3cXFsQWlmN3pYSEE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Nov 2023 08:00:00 GMT",
        "title": "ETH Soars Above $2K as BlackRock iShares Ethereum Trust Registered as Corporate Entity in Delaware - CoinDesk",
        "content": "Helene is a New York-based reporter covering Wall Street, the rise of the spot bitcoin ETFs and crypto exchanges. She is also the co-host of CoinDesk's Markets Daily show. Helene is a graduate of New York University's business and economic reporting program and has appeared on CBS News, YahooFinance and Nasdaq TradeTalks. She holds BTC and ETH."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxQZEpnRlJlcmhyRUV5cmNfMUx2bERRNnV5ZzVjcUpUODlpLVZhdU5XdmNyRDduMFRWTFdnc3ZSM2lncDFLcGxoYkJibHNHazcwd2ZnQzM5ZGczdGhIM2wtbmFueUtIdFlOVTl1WTFuM2FfTFFkR3NxbjR0cmpfREdzQ09mNllHa3BjdlhvdVZ6RXlMY2ZD?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Nov 2023 08:00:00 GMT",
        "title": "Price Analysis: Ethereum Hits 6-Month High on BlackRock ETF Speculation - Crypto Briefing",
        "content": "Share this article\n\nEthereum prices topped $2,050 Thursday, reaching the highest level since May. The rally comes amid rumors that BlackRock may soon file for an Ether ETF.\n\nThe chart shows Ethereum remains in a clear uptrend, with the 50-day SMA and 20-day EMA providing dynamic support.\n\nHowever, the RSI is overbought at 80, signaling the rally may be overextended short-term. This could lead to a pullback or consolidation as the indicator cools off.\n\nUpside resistance may emerge around the current highs and psychological levels above $2,000. Support could be present around the key moving averages.\n\nIf the uptrend continues, Ethereum could target new highs above $2,100. But overbought conditions raise the chance of a correction, which could retest previous lows if the trend shifts bearish.\n\nBlackRock registered the iShares Ethereum Trust this week, sparking speculation it will submit an ETF application to the SEC soon. The asset manager took a similar step before filing for a Bitcoin ETF."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxPZnIxQmxUMVVWS2llbVRtQ0hpTWNjalNDVmQ2ZXFZajRCYTVQTXdfUFR5WGVxVlRyWnhSOWxyZDZNMXl2Ul9TT2UtQlczalFkeXRiUlRTaWpSZEFTTkNnR3Vybmp4MjZWbkVVRG1QQVFSckc2Y242ZHpQY3Y0eFdNSGpyUFNzRXB5aXY0MzBmQXljeVIzeFhDUk930gGfAUFVX3lxTFBSQTZkZFF1MFIzcy1HWHpwbnRwcVgzNDRDZjladTNmN3dBSWYxMmx3eVZ6WVJVT2N5bzRzR3c5OTBRZExESngzZHdaU2ZjRkJyMmV6eUI3Z3ZvNkxUZW45RTd1cUhUeDZZb0tfTUNBWTVIanMyYTVwV3RWQ2N4NjRRcWRUZ3VzWlFMSlhqbm9Tamxjc2xnRnJPZnFobzFwcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Nov 2023 08:00:00 GMT",
        "title": "BlackRock appears to take first steps toward an ether ETF - CNBC",
        "content": "The BlackRock logo is displayed at its headquarters in New York City, Nov. 14, 2022.\n\nAsset management giant BlackRock appeared to take the first steps toward an ether ETF on Thursday, sparking a rally in the cryptocurrency.\n\nThe website for Delaware's Division of Corporations showed that an iShares Ethereum Trust was registered Thursday. A similar notice for the iShares Bitcoin Trust came one week before BlackRock's filing for a bitcoin ETF in June.\n\nBlackRock declined comment on the matter. The firm's iShares product is the leader in exchange-traded funds with more than $2.3 trillion in assets under management.\n\nThe price of ether jumped 7% on Thursday, topping $2,000 for the first time since April. Bitcoin's price saw a similar rise when asset managers began filing to launch ETFs this summer.\n\nThe Securities and Exchange Commission has still not approved a bitcoin ETF. The regulator has long opposed such a fund and blocked Grayscale's attempt to convert its bitcoin trust product into an ETF, though a court overruled that decision in August.\n\nThe SEC did not appeal that court decision but still could choose to block Grayscale's conversion and the other bitcoin funds in the pipeline, including BlackRock's, for other reasons.\n\nIf the SEC does allow bitcoin ETFs, then ether funds would likely be next in line. Ether is the second most popular cryptocurrency behind bitcoin.\n\nDon't miss these stories from CNBC PRO:"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxOZ3gxTUY3M0tRanlUY2lpQmFwcHIxWHdpeWlRNEJhZkgxTVE1WnJrQXpNb0VPQ0F2al9mblNjSXY4S3lmUUtrNE9uM3lkSGZDRV9xb3cxbDdQU0oyM1p4czhuNklTWFJGVVY0eG9uXzFsNVVUdmo2eTI1NEk4X1JBTGFubjJ4OGJOb0paXw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Nov 2023 08:00:00 GMT",
        "title": "ETH crosses $2k as BlackRock’s Ethereum Trust ETF filing surfaces - CryptoSlate",
        "content": "BlackRock has taken the initial step toward filing for a spot Ether ETF, with the iShares Ethereum Trust recently registered in Delaware.\n\nThis move is reminiscent of BlackRock’s iShares Bitcoin Trust, which was registered in a similar fashion seven days before the ETF application was filed with the U.S. Securities and Exchange Commission (SEC).\n\nIn the context of an industry bristling with anticipation for the approval of a spot Bitcoin ETF, BlackRock’s move potentially signals a pivotal moment for Ethereum, shedding light on its status as a prospective asset class in institutional investment portfolios.\n\nDespite the positive indications, it’s important to recall the precedent set by the SEC’s handling of Bitcoin ETFs. As reported by CryptoSlate in October 2023 Source, despite rumors indicating otherwise, the SEC had not approved the iShares Bitcoin ETF. The regulator had delayed its verdict on several proposed rule changes, which included applications from leading firms such as Fidelity (Wise Origin), VanEck, WisdomTree, and Invesco.\n\nIn light of this, BlackRock’s iShares Ethereum Trust registration, while a significant development, leads us into a territory of considerable uncertainty. The SEC’s previous hesitance to approve Bitcoin ETFs might cast a long shadow over BlackRock’s budding Ethereum trust, potentially heralding a new cycle of applications, approvals, delays, and rejections.\n\nAs the crypto community watches these developments with bated breath, two things have been game-changers for the industry: Grayscale’s court victory and BlackRock’s entry into the market. Ethereum ETFs, in this context, may just be the next frontier. However, for now, all eyes are trained on the SEC as the crypto industry awaits its verdict on the pending rule changes and the potential approval of BlackRock’s iShares Ethereum Trust.\n\nBlackRock’s Ethereum Trust filing surfaces as another key narrative to monitor closely. As the crypto industry continues to evolve and mature, such developments underscore the increasing intersectionality of traditional finance and digital asset markets, hinting at a prospective future where digital currencies like Ethereum may become more commonplace in institutional investment portfolios.\n\nMentioned in this article"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxQQWJfdVF2U2xQZnRoQVZVMk1XV2JFUE1EN3FxSll4b0IwbTkzYzdlZU5OMzUwV09PZWZxQ2hXV0JZRzVRVVlEeGtYMWlVX2VyNENOQmFVcU1velItbWdiWU5WSXFxeWZnQ1pRdnFncFVXWmdMRC1odHp4NHBaWlVBWnZ3TERpSkg1VjA3UzNQMmV2dzhrUEVBNGZhMGNlOHhCVHpkeDEtMkpFaUFjWXB1Mmc1TkRfeEVuSENCR1ZHV09RNHFCaGtv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Price Targets $3,000 as Investors Move $500M ETH into Long-Term Storage - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    }
]