[
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxPYXVFYy1wQ05oMjNkT1I4VXcybmFkV3cyMVBnQUJoQm1lR3pPa01nT0Y2QUZUNzJpRjRoNHRsMUs2OF9KbjA3QWZVZ2pNNWNFNXhWT2dMXzN0MFdfVlNkeEFnYjY1dkhXYU5tdG8xb0lkbnZhbWp2emIzRW9YOW1SSnp3U1V0TFE3WWk0RS1DUUx6RGZBSVFKXy15UkNBS0lteFdTcXVTLXZfZFRzeXF0R0lkRUpFbG12S2k0QXdB0gHDAUFVX3lxTE9mZENjZUc4WHp4Qm8xWE90dXlpcGhjaHpEX1A5LU9KaDhaNlNtVnBpLVZ6NUNRQk9jQjhncWJoaXkyelYzV2RLX1dJUU5GRzhncW1WSWg3TzRyVGJjSDJJLTlCb0NiSHZLcm40eTlkcWRCaWZBQ1ZnQ015WWNUZkZoVy00SEVFUERUVE9kRjVjZ08yMzFZa3lBVUlDbmI0Sl9fUW0yd21lZzVCNFlOaG45Y0l1LTBpaVcxdXpZX3Z5dEI4VQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Nov 2023 08:00:00 GMT",
        "title": "'We Are Prepared to Go to the Mat:' ENS Founder on Patent Dispute With Unstoppable - CoinDesk",
        "content": "'We Are Prepared to Go to the Mat:' ENS Founder on Patent Dispute With Unstoppable\n\nENS Founder Nick Johnson told CoinDesk he’s unhappy with Unstoppable Domains's patenting of work that he claims he produced and published earlier.\n\nBy Margaux Nijkerk Nov 21, 2023 at 3:35 p.m. UTC"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxOeTBkazRzMmZ2Ylh5UUlpZVpKNlFwR0dCRndkN2cxOTJabTlMRGdqNGtrSXJ3ZlVWblFsUVNOd2RJV3BaeXZwWnhUbHZNcWhjWUo0YTZ1U3RtazE3aDFpTFZmbGF1MjZCVFZtbTc5NnVuOTFlQUtySnRoYWJyRzhybkExWFg4QkxxV2VtdnppYU1zcWVNcEJNaGpJZU1FdVBRdWUxUHN3aktvSkxTaDA00gG0AUFVX3lxTE95ZkdaUVhJZnA5U245SXdIS0JvUWZGcVpNUEd6SjZ0N3lEYzV5emVGallEd3FMRVh1aTFISk03WFBjejRzU0Z4Sm1oNEpvbUxxMUdBZG5lU1lfRnJyZ1doYUNZOVFtTVFxX2t4UC1LbDZQSjhyamZtSnNvMmQ1bnNEX1gwdDlhU0RuNjF0c0tObV9PN2N4NkhJdDFEQUVRWkdNb1NEaW92ck5ackMtdDE1WVBaeQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Nov 2023 08:00:00 GMT",
        "title": "New Ethereum Layer 2 Blast Attracts $30M Hours After Bridge Goes Live - CoinDesk",
        "content": "Users have to wait until the launch of the mainnet in February before they can withdraw any funds from the network or participate in on-chain activities. As such, Blast is invite-only as of Tuesday, requiring a code from invited users to gain access. Besides, the BLAST points can be redeemed starting in May."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMi2gFBVV95cUxPUml6cDM1UmJLckFEUXA5eHZHSnRGaGpDaVFpMk5Wb2dBbTg1YTN1WmozMFR1T2ViX2Uzcm54LXktbDJtRzNyVjctcFVNc0NyNm93R1hmczVkSVk0bjhkNDhZT1hTSVFRb195ZU1DTkgydS1IdEdKS3djVlVkUTA5NkY3Vmx6MnBrSkJjTkozVldPWThOeEtpcms5aTJxNWsyZW9mbnpFR0dveDlWR1lZTlhnc3k5TG53WHN4TWJWVmRxV2tkaE11UzduZFZrcEVuakNrc1NBVElpQdIB3wFBVV95cUxNdVEtZTZ2VXNwelBKa0owaUFYTlhoeGRadUVFdEVDQjlaMWN0SG40S0NXQzJMZHhyVGpNYVhUcW9SeFJUWkg3NUxpVTkwTmpFS0UwZ21YYmg5N3VLMlpTU3F2VWl6SkNCc2RvQ1lXdjl4MW5lMmZXYTRjNm45YzVibkExaXZiOHJDZkh2Wmd1NHhNVjRIUlRBTkVLT2ZUX0c0VmVrX0ZCdUQ0VE1tRFZRY29NTmJDV3duYU5rbXBJQlpaT0dvN2ZTOXFyQ095YnJ0TGJXWTNzMU92aWN3X1Vv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Nov 2023 08:00:00 GMT",
        "title": "Crypto Analyst Calls for Ethereum To Massively Underperform Against Bitcoin, Says Now Is Not the Time for ETH - The Daily Hodl",
        "content": "A closely followed crypto strategist warns that Ethereum (ETH) will continue to lag behind the flagship digital asset Bitcoin (BTC).\n\nTrader Credible Crypto tells his 353,200 followers on the social media platform X that the Ethereum versus Bitcoin pair (ETH/BTC) is still in a macro downtrend.\n\nAccording to the analyst, the ETH/BTC rally spurred by news that investment giant BlackRock filed for a spot market Ethereum exchange-traded fund (ETF) quickly faded, indicating the pair’s weakness.\n\n“ETH/BTC has almost fully retraced the ‘ETF pump’ from last week. Even that narrative was a bit flawed in my opinion because yeah an ETH ETF may be coming but a BTC one is coming first.\n\nSo why would ETH outperform now?\n\nBeen calling for this move down for literally months, and we are over 50% lower since then with more downside coming.\n\nI will be the biggest ETH bull when the time is right but that time isn’t now. Embrace the BTC run that is coming and when the time is right, we can embrace the ETH run that will follow.”\n\nLooking at the trader’s chart, he seems to predict that ETH/BTC will fall down to the green box which covers the range between 0.03 BTC and 0.036 BTC ($1,121 and $1,345).\n\nAt time of writing, ETH/BTC is trading for 0.054 BTC ($2,018).\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxQT202WklabExRS0FCcUtYS2RoNTFQNWNhb3NVNVBMUzlfYlZPQlpkeHlleDhGaDZWWm14LUYyQ3NUM0QxXzRTeW1teFhsbGU4YkkyYlY5b3h6Z1htWG9MeEtiWEhoR2FfejQ3M0FiN1o0TUNycWhqMGEtbWhmRVFkVWtDbGNsQjR4aVlFejJaNG1uNE5x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Nov 2023 08:00:00 GMT",
        "title": "Blur Founder Unveils Ethereum Layer 2 Network Blast - Crypto Times",
        "content": "The newly launched Ethereum Layer 2 network, Blast has attracted significant attention on the announcement day with it recording nearly a $30 million inflow of bridged funds within hours.\n\nDespite not being able to withdraw bridged funds until the mainnet launch in February 2024, users are bridging funds to Blast with its TVL now reaching approximately $40 million, as per data from Etherscan.\n\nBlast is an optimistic rollup and it claims to be the first layer 2 network offering native yield on ETH and stablecoins including USDC, USDT, and DAI. It participates in ETH staking and gives back yields to users with additional rewards. It also introduces auto-rebasing stablecoin USDB to reward users with stablecoin yields.\n\nIntroducing Blast: The only Ethereum L2 with native yield for ETH and stablecoins.\n\n\n\nWe’ve raised $20m from @Paradigm and @StandardCrypto to build the L2 that helps you earn more.\n\n\n\nDetails on how to get early access at the end of the thread👇 pic.twitter.com/AYYmK8YFx4 — Blast (@Blast_L2) November 20, 2023\n\nThe novel L2 is currently live in the early access phase which can only be accessed via an invite code. Users who join through early access will be rewarded with Blast Points which they could redeem in May 2024.\n\nIt has notably raised $20 million in funding from prominent DeFi players including VC firms Paradigm and Standard Crypto alongside a number of individuals such as Hasu, Hsaka, Foobar, The Block CEO Larry Cermak, and many others.\n\nBlast is built by Pacman, the pseudonymous developer and co-founder of NFT marketplace Blur, who said in a post that he will oversee the development of both projects. He shared plans to launch new NFT applications for Blur using Blast’s tech and infrastructure.\n\nI will oversee the development of both @BLUR_io and @BLAST_L2. This is not a task I take on lightly. Doing so requires having incredibly effective staff at each. I’m grateful for the builders at Blur and Blast for making everything possible. — Pacman | Blur + Blast (@PacmanBlur) November 21, 2023"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxQT2xueUFwSFJBLW03RkpPa2hFOGI4bW4tX19uazNjOWNjNEVLN09hSHFadjNYXzBoMUdxN0RJSnZnMGp3T0dXZlBzMVJVTDFUUEtaMVpDVThwdERQMy00aHNPNERqelBrTGVGR18yazVvWWxlUFA0RlI5NC0wZlNnZVdTc2dyc3ZWZU96SnFmQXQ1SHpfa0NBN2R3TU5Oc0J1T3RqamxJc1NkTjAwa3Fr0gG0AUFVX3lxTE1KeXZ1c0hudWNxcnV2TFllRXowMVQ3YWI1VTdJNU5fN056bVlCY3VHbk5OVkdpR2FSVW55MU1CbXlLT3JndHZRUGNKeTdJRmRVSGZOV1JLZW5SUV9YZk9rWHBhZFJlSlVRWWZnT1loS0RLUHdJOTZvUGxxa1RGVGhKSENKV0VwYU9mX2t4VEllckVhcUNDc2ZnbXRfTHN2ZVJOcVVHTGVsd0F1U2ZBcmlGY3ZmQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Nov 2023 08:00:00 GMT",
        "title": "Change of Heart: Santander Launches BTC, ETH Services to High-Net-Worth Clients (Report) - CryptoPotato",
        "content": "The global division of Spanish financial institution Banco Santander – Santander Private Banking International – has reportedly introduced a new feature that enables customers with Swiss accounts to engage in the investment and trading of Bitcoin (BTC) and Ethereum (ETH).\n\nGiven Banco Santander’s extensive history of more than 160 years and its broad customer base of 166 million individuals, the private banking division, which attends to 210,000 affluent clients and oversees assets and deposits amounting to around $315 billion, holds significant influence.\n\nHence, the decision to permit high-net-worth clients associated with Santander Private Banking International to engage in BTC and ETH trading is noteworthy and has notable implications for the industry.\n\nSantander’s Historic Move\n\nAlthough Santander’s initial launch of cryptocurrency trading services is said to be limited to BTC and ETH, the banking giant plans to expand its offerings to include other cryptocurrencies once they meet the specified screening criteria, as per information obtained from an internal communication leak reported by Coindesk.\n\nThe report states that Santander initiated the provision of BTC and ETH trading services in response to client requests via relationship managers.\n\nThe bank intends to safeguard the private cryptographic keys of the tradable assets within a regulated custody framework.\n\nJohn Whelan, head of crypto and digital assets at Santander, reportedly said in an email,\n\n“The Swiss regulation related to digital assets is one of the first and most advanced in the world since it provides clarity and a comprehensive regulatory environment for our clients. As holding of crypto as an alternative asset class continues to expand, we expect that our clients prefer to rely on their existing financial institutions to be responsible for their assets.”\n\nSantander is yet to officially confirm the development.\n\nTryst With Crypto\n\nThe latest development comes almost a year after Santander announced its intention to restrict UK customers from making real-time payments to cryptocurrency exchanges, citing a commitment to shielding its customers from potential scams.\n\nIt had then cited witnessing “a large increase in UK customers becoming victims of cryptocurrency fraud” behind the decision. The financial giant also expressed intention to further “protect customers” by blocking all faster payments they identify to cryptocurrency exchanges from Santander accounts, a move that was expected to be implemented during 2023\n\nHowever, by June 2023, the bank had shifted its stance and initiated an educational series for its customers focused on digital assets.\n\nWhat makes this change noteworthy is its alignment with a growing interest from institutional entities in crypto assets. Many traditional institutions have joined the trend of embracing Bitcoin ETFs to offer their clients an indirect exposure to cryptocurrency."
    }
]