[
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE1rSUFYY1VXX1dfQVM0ZWNuT3JiRTFfOUFFTGFfdXE1X29teGR1aGI1MjdHeThIWXAybXdhQjdycldoLXR2XzVxTWdhamo1akdIU1NNaXpFd3VPRS1xMk51d3BDQXE1dUdEeF9Nc1haU2p2RzJjblHSAXtBVV95cUxPdzBUVFZLaVV1ZnpObl82TVU5cG1udTFrTG9tMnZEejhWSFN2SlFzTGF5ZG5kUVdBMW9tMGllYXpOeHFDRzJYcG9BeV94U3Y5ZkZoNTRzOFJta0ROV3NkU2xGbjJuSVY5QmRhcklJUDlUell5MEVhNWRGR0k?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Dec 2023 08:00:00 GMT",
        "title": "Ethereum (ETH) Price to Hit $10,000, Lark Davis Believes - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nCrypto YouTuber Lark Davis has taken to the Twitter/X social media network to share his view on the enormous all-time high he expects the second largest cryptocurrency, Ethereum, to reach. He has not named any definitive time frames for this surge, though, and just stated that this is a questions of “when, not if”.\n\nDavis bets on Ethereum ultimately reaching a mind-blowing $10,000 price tag. To achieve that price milestone, Ethereum would have to showcase a whopping 321.52% from its current price level - $2,370.\n\nEthereum reaches new milestones\n\nAs reported by the popular on-chain data aggregator Santiment, Ethereum has been moving towards a new record recently, along with the flagship digital currency Bitcoin. Per recent tweet, Ethereum is now within 1.6% of the highest value since May 11 last year. As for Bitcoin, BTC is within 2.9% of the highest value since April 6 last year. Both highs were reached by these two largest cryptocurrencies at the start of December.\n\nAdvertisement\n\nBesides, top 10 exchange wallets continue to move Ethereum, according to an earlier tweet published by Santiment as they are withdrawing their ETH into smaller blockchain addresses from centralized crypto exchanges or are moving Ethereum away from CEXs entirely. About two weeks ago, a massive 240,000 ETH was transferred from exchanges. This massive amount of ETH is evaluated at an impressive $569,347,200 at the time of this writing.\n\nGalaxy Digital dumps tonnes of Ethereum\n\nAs reported by U.Today, approximately a week ago, a major cryptocurrency market player, Galaxy Digital investment fund created and spearheaded by former Goldman Sachs partner Mike Novogratz transferred 11,200 Ethereum to the Binance exchange with an apparent goal to sell it. At that time, this ETH lump was worth roughly $24.3 million.\n\nHowever, it was not the only Ethereum transfer made by Novogratz’s company recently. Blockchain sleuth @OnchainDataNerd stated that until that day, Galaxy Digital had deposited 31,437 ETH in total to various cryptocurrency exchanges.\n\nMike Novogratz himself is an early Ethereum investor. In one of his interviews, Novogratz stated that he had bought 500,000 ETH from Vitalik Buterin right after the ICO, before Ether began trading on exchanges and was worth less than $1. He was the first even Wall Street buyer of Ethereum back then."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxONXItbU9zZGRUMjg5WkpTS3U2a201R085S0pCZEVVcnFMSG9GNkRhWXR4a3BuM1hLLXRBaUd0VWE4SVhLajhYVWRmeG1vSDRMLVk2QWR6UnNRM2pJa19FdXJmU3l4TG8xOUIyUFJ0dEY1aDQ3UlluS1Y2YnoxamhnbUk1OVZDTm1FSXlYNGc5djlnSXBiNERJbw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Dec 2023 08:00:00 GMT",
        "title": "ZkSync beats Ethereum in monthly transaction count despite Christmas outage - DLNews",
        "content": "Ethereum has been upstaged by one of its layer 2s in 30-day transaction count.\n\nZkSync’s transaction spike has resulted in lower fees.\n\nDevelopment is positive step for Ethereum's scalability.\n\nEthereum has been knocked off its perch, at least when it comes to the monthly number of transactions.\n\nZkSync, an Ethereum layer 2 blockchain, has managed to process more transactions than Ethereum in the last 30 days, according to data from L2Beat, a portal that tracks data for such buzzy blockchains.\n\nIt’s quite a feat because it is the first time Ethereum has been surpassed by any of its layer 2s in 30-day transaction numbers.\n\nEthereum layer 2 blockchains like zkSync help scale the blockchain with increased speed while relying on the mainnet’s security.\n\n30-day transaction count for Ethereum and its layer-2s. Source: L2Beat\n\nIt’s also significant that the transaction spike has not resulted in higher fees on zkSync. Instead, fees have dipped 44% within the same period, data from blockchain analytics portal growthepie shows.\n\nIt currently costs about $0.13 to use the network to send tokens while it is $2 on the Ethereum mainnet. More complicated transactions like token swaps cost even higher, as much as $35 as of the time of reporting.\n\nThis fee decline supports the expectation that zkSync should become cheaper to use as it scales.\n\nZkSync’s run to the top of the ladder has come amid a boom in inscriptions on Ethereum-based blockchains.\n\nJoin the community to get our latest stories and updates\n\nInscriptions are data files for applications like NFTs and meme coins embedded on blockchains in a way that is supposed to be cheaper than using smart contracts.\n\nThey first emerged on Bitcoin but have now become a trend on Ethereum-based blockchains.\n\nTotal investor deposits in zkSync, as measured by \"total value locked\"\n\nTransaction-spamming associated with the inscriptions trend has become a stress test for blockchains like zkSync and Arbitrum with the latter going offline on December 15.\n\nThe milestone also comes after zkSync had a minor hiccup on Christmas. Block production was paused amid a temporary network outage for the blockchain.\n\nThe developers behind zkSync said the problem was due to a bug in the chain’s server and promised a full post-mortem of the incident. Some security researchers say the issue may have involved the blockchain’s Sequencer.\n\nZkSync uses a Sequencer to verify, organise, and bundle transactions to Ethereum for finality. Layer 2 Sequencers have been prone to faults in the past with Arbitrum, a zkSync suffering a similar fate in June.\n\nApart from Inscriptions, zkSync’s transaction count also has a prominent airdrop footprint. Matter Labs has been mum about the possibility of an airdrop, but that has not stopped DeFi users from piling into the chain in hopes of a potential airdrop win.\n\nOsato Avan-Nomayo is our Nigeria-based DeFi correspondent. He covers DeFi and tech. To share tips or information about stories, please contact him at osato@dlnews.com."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxNajQ1ODMweW9lcVBiNGxWNTNWbnY3TGNkdGFVS1Fwb2IzOUlybE9COF9HdElrOFJUbGwzbExGZFlLdXVMTlJfSUpiNEJzdFNWdVp0UGRCMmhxdUxvOHp6S0xGQ2J0Nk1aR25HNTJsenZUSE5zNWJHV2xyMkY1cVAzSzVOTlN6QQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Dec 2023 08:00:00 GMT",
        "title": "Vitalik Buterin’s new proposal would cut Ethereum’s security - crypto.news",
        "content": "In a new controversial proposal, Vitalik Buterin suggests decreasing the number of PoS validators from nearly 1 million to just 8,192 to reduce complexity.\n\nIn a new proposal released on Dec. 27, Ethereum (ETH) co-founder Vitalik Buterin has outlined a plan to dramatically simplify Ethereum’s proof-of-stake (PoS) system to reduce complexity and expand the design possibilities.\n\nThe current PoS system attempts to support decentralization by allowing many validators — currently almost 900,000. However, Buterin argues that this creates significant complexity, sacrifices, and constraints while still not fully achieving the goal of accessibility for small-scale stakes due to the 32 ETH minimum requirement.\n\nInstead, Buterin proposes reducing the number of signatures per slot to just 8,192 from the current plan of over 1.7 million. This would enable major simplifications across Ethereum, make it much easier to transition to quantum resistance, and retain a cost for attacks between 1-2 million ETH — which Buterin suggested is high enough:\n\nEven a cost of attack of 1-2 million ETH should be totally sufficient. Vitalik Buterin\n\nYou might also like: Vitalik Buterin pitches 3 pathways to simplify Ethereum’s PoS model\n\nDeveloper Micah Zoltu commented on the proposal, noting that this attack cost may be insufficient. According to him, numerous actors dispone this kind of resources and may turn against the protocol sooner or later:\n\nThere are many governments around the world who spend that much on one missile, or one plane. We should be designing systems resilient to state attackers who are willing to spend money to ruin your day. While 1-2 [million] ETH may be enough to deter them from attacking, we have evidence that they will spend far more than this to achieve their goals, and many governments do appear to be heading in the direction of “destroy crypto” as one of their goals. Of course, I cannot say that 9 [million] ETH is enough either, or maybe both are in fact more than enough! However, I don’t think it is as obvious as you imply that we can safely reduce the security budget. Lindy doesn’t apply to these things, because everything will be fine right up until it isn’t, then it is all very, very bad all of a sudden. Micah Zoltu\n\nThe last part of the statement refers to the Lindy Effect, the theory that the future life expectancy of some non-perishable things like a technology or an idea is proportional to their current age, so things that have been around for a long time are more likely to stick around longer.\n\nIn this context, when Zoltu states, “Lindy doesn’t apply to these things,” he argues that just because Ethereum’s high level of security has been sufficient so far, it doesn’t mean it will necessarily continue to be sufficient.\n\nButerin outlines three potential approaches to make this reduced signature scheme work: relying entirely on decentralized staking pools, using a two-tiered system with lighter and heavier staking requirements, or rotating participation across slots to retain accountability.\n\nThe proposal has garnered commentary from developers like Zoltu, who questioned whether the reduced 1-2 million ETH attack cost would be sufficient to deter state-level attackers. Buterin acknowledged this was a fair critique, and the optimal cost remains unclear.\n\nThe coming debate around this and other PoS proposals will likely be as vibrant as ever in the Ethereum community."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxNZUF4VTh2UkFETlo2bUJDSTdIbGJHMEkySHlSSDVMa3VPR0g4cnM3SWVuX0VmZlRrYUh5eE53MkhGc2V5eHNjZng0WEE4WnNNSzdXZXNHeFZ6Nkx2ZTVXRzhPcERTcFQzWVBUazlqWWoyaHNzQnhNdEFlSF95WlJObDJ4SHB0U3ZtalZKYVRYc0ljMmfSAZsBQVVfeXFMUEJkbUpJaUtpeGkwd2VSR21jMFJmbTNJR3BEajM4LU5wOXI3Y2dGamZTRVloSWN2eHRVQmNpaTIta2pFbktfWnl2TXNURnU3MzlMeUlqdzdndU5sOFlmeE9tWWkzLVBveXdfN0xSXzNYc1luVVk5b3FRTEtCU0ZZRVktcHo0R1hwTFgxaE5lcGhucDZUdTVVSGJSSHc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Dec 2023 08:00:00 GMT",
        "title": "Blast Deposits Top $1.1 Billion Ahead of Ethereum L2 Launch and Airdrop - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBlast, an upcoming Ethereum layer-2 scaling network from the creator of leading NFT marketplace Blur, has now pulled in more than a billion dollars’ worth of deposits from users vying to earn yield and points towards an upcoming token airdrop.\n\nSome $1.13 billion worth of cryptocurrency has been deposited into the Blast bridge as of this writing, according to both the official website and DeFiLlama, making it the 23rd largest protocol by total value locked according to the latter resource. Over 86,000 users have contributed funds thus far.\n\nAccording to Blast, users are earning about a 4% annual return on deposited Ethereum (ETH) and 5% on stablecoins. Furthermore, they’re earning “Blast Points,” which will play into their respective share of the upcoming BLAST token airdrop.\n\nAccording to the Blast website, the airdrop is set for May 2024.\n\nAD\n\nAD\n\nBlast aims to make an impact in the crowded Ethereum scaling market—which includes networks like Polygon, Arbitrum, Optimism, and Base—by incentivizing users with both native yield on staked cryptocurrency along with a share of tokens via airdrops. Crypto protocols use airdrops to give out tokens to early users and contributors, typically aiding in decentralized governance as well.\n\nPulling in users with the allure of token rewards is the same strategy that worked wonders for Blur, which dethroned one-time leader OpenSea to become the leading NFT marketplace in February. Blur has airdropped more than $800 million worth of BLUR tokens to NFT traders in 2023 across two waves, based on the peak value of the token, per data from CoinGecko.\n\nBoth Blast and Blur were founded by Tieshun “Pacman” Roquerre, and both were backed by prominent crypto venture capital firm Paradigm. However, Blast’s rollout has been controversial—even for its backers.\n\nUsers are depositing cryptocurrency into a bridge that does not currently connect to the actual Blast network that’s in development, and funds cannot be withdrawn until February 2024. The overt emphasis on earning yield and rewards before the network is even live has apparently rubbed some crypto users the wrong way.\n\nAD\n\nAD\n\nIn late November, just days after Blast was revealed to the world, Paradigm Head of Research and General Partner Dan Robinson wrote that the firm believed that the “announcement crossed lines in both messaging and execution.”\n\n“For example, we don’t agree with the decision to launch the bridge before the L2, or not to allow withdrawals for three months, since we think it sets a bad precedent for other projects,” he continued. “We also think much of the marketing cheapens the work of a serious team.”\n\nThere are a lot of components of Blast that I’m excited about and would be interested in engaging with people on. That said, we at Paradigm think the announcement this week crossed lines in both messaging and execution. For example, we don’t agree with the decision to launch the… — Dan Robinson (@danrobinson) November 26, 2023\n\nBlast and Pacman did not respond to the comments. However, in advance of Robinson’s tweet, Pacman wrote that Paradigm had not been involved in Blast’s go-to-market rollout, and that the VC firm—which co-led Blast’s $20 million raise—had already asked the Blast team to make some changes.\n\nHe added that Paradigm’s suggestions were “under active consideration,” but that it would ultimately be Blast’s call.\n\nIn December, Robinson tweeted that Paradigm had worked with Blast to develop a “new time-locked upgrade system,” which he said would “set a better precedent for future projects who may try to emulate them.”\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxQSm9WNkxRbVJfMkpDTTU0bVJXTTVOakxydHc0aU00SjRFMTlMRTB2VEpYYk9NUGgwUTNldHNSbi1hcDV6dzNGN2cyZGF5SE9rVmZCanVJbTNRQ3p5YkdXOE1MVHRnVlZFemZMSHROS3dQN080dE55d1dZb2hKbm1ySlQ1ZGxLSjc1VE1ZZTRvMzIyZVhjN2lqU3VUdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Dec 2023 08:00:00 GMT",
        "title": "Buterin proposes 'security through simplicity' to lighten Ethereum staking - Crypto Briefing",
        "content": "The proposal aims to balance the network's decentralization and scalability.\n\nShare this article\n\nEthereum co-founder Vitalik Buterin has published a new proposal that seeks to reduce the required number of signatures from validators to streamline the Ethereum network’s proof-of-stake consensus mechanism.\n\nA PoS simplification proposal: make a design that only requires 8192 signatures per slot (even with SSF), making the consensus implementation considerably simpler and lighter.https://t.co/Z8mK7vZx7g — vitalik.eth (@VitalikButerin) December 27, 2023\n\nAccording to Buterin, the proposal aims to make Ethereum’s consensus implementation “considerably simpler and lighter” by reducing the signature requirement per slot from roughly 28,000 to just 8,192 signatures.\n\nTo date, Ethereum has roughly 895,000 validators, with each validator being required to stake 32 ether (ETH) and become activated within the network. Ethereum does this to maintain decentralization and open access for more participants to help with staking, but this also results in more load on the network because of processing requirements.\n\n“The signature aggregation system feels reasonable at first glance, but in reality it creates systemic complexity that bleeds out all over the place,” Buterin said.\n\nWith Buterin’s proposal, the signature load for future upgrades would be predictable and limited, simplifying protocol and infrastructure development efforts. However, this also means that Ethereum’s network load could still be increased through hard forks.\n\nButerin points out that such a system opens up compromises, limiting quantum security, complicated upgrades, and an apparent reliance on zero-knowledge proofs to manage scale.\n\nButerin believes that his proposal will simplify the proof-of-stake design and allow for a “large amount of technical simplification.”\n\n“[…] instead of relying on cryptographers to create magic bullets (or magic bulletproofs) to make an ever-increasing number of signatures per slot possible, I propose that we make a philosophical pivot: move away from having such an expectation in the first place,” the Ethereum co-founder stated.\n\nThe proposal provides three approaches to enable the reduction of required signatures: a shift to prioritizing reliance on decentralized staking pools, a two-tier system that provides options for “heavy” and “light” staking, and rotating validator subsets through committees.\n\nThe first approach suggests that Ethereum could discard direct access to the consensus layer in favor of using decentralized staking pools exclusively, raising deposit minimums but capping pool-related penalties to avoid over-reliance on operators.\n\nIn the second method, a two-tiered approach creates heavy-stake validators specifically assigned to finalize blocks. This is then supplemented by a lighter security layer that has no minimum thresholds to participate.\n\nThe third approach proposes a set construction that is proportional to a validator’s stake weight and rotates participants dynamically.\n\nButerin notes that the third approach effectively decouples weight for incentive purposes (validator rewards) from stake weight for consensus purposes. This means that each validator’s reward within the committee (based on an agreed-upon rotation) should be the same, keeping average rewards proportional to the balance.\n\n“The future load of the Ethereum protocol becomes no longer an unknown: it can be raised in the future through hard forks, but only when developers are confident that technology has improved enough to be able to handle a larger number of signatures-per-slot with the same level of ease,” Buterin said.\n\nThe main tradeoff is between a significant reduction in validator participation per slot and increased technical feasibility and flexibility. The proposal aims to balance the network’s decentralization and scalability, but its critics argue that the changes it carries may diverge from Ethereum’s core philosophy.\n\nWhile the purpose of improving Ethereum’s scalability with a leaner signature scheme may appear to be well-meaning, commentators on Vitalik’s proposal have raised concerns about possible security flaws due to the reduced complexity, which may open new attack vectors if any of the three approaches are implemented. To this end, Buterin responded that streamlining the protocol design offers “security through simplicity” while enhancing the network’s resilience against state-level attacks."
    }
]