[
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxQOWRyRVp3MER3dlhVbFJRbFRPampDWVdqZFlTclc3d1J0cEt6TWowWnpsc3M5LVpLcl9WVXZucnhiSmZLTEw3UDk2X2VrX0xQZFBFRnVNY0JGZGlkQ1h2dEdEdWRVVTB6YVpfa1VZa0xZTnRaMTkxZHJkb1lRZE0yc2J1dWN1Z3p5cTF6dERNWkJqNDR0OC1OMXFfWU5lR1RzLUNpcGhOMnROX2UwOVY2cGtsZ29PSDlyb0ZCYzEzbDhWN19QMnY0RVFWQUfSAdIBQVVfeXFMT0FCdW5yMWJCejdkVU9OT2pSMkJwVXBNNHFfeVI2TmdILVE0WEFfRmhZX3FiOXdiSUN3dlVsY0xaWjdPeFdGaTBlb0dDWVFMOVFoT3FlaFdDNUZqcmszd1NXLU0yUXNGMWd0amRyR2J5T05OMzBfY3M3T0dHTUlLanNyRTZFUC1oQkJtckVaTHpGVmVibW1VZ045VTZ0RXRwR3I5Q192NG9UWUJ2a2dRZFdzVkU1allKek5VYjFKbHlNQ043b3ZobWREanpSRGFvRl9B?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "Blockchain Startup Kinto Plans 'First KYC'd' Ethereum Layer-2 Network After Raising $5M - CoinDesk",
        "content": "The project is built using the OP Stack, which is a set of software tools created by the developer OP Labs that companies can use to easily spin up their own customized layer-2 networks. The technology derives from Optimism, the second-biggest layer-2 network atop Ethereum. Coinbase, the big U.S. crypto exchange, famously relied on OP Stack to build its own layer-2 blockchain, Base."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxOQkx4bE4wd2dQQmRjYUI1UVNKU0stYUZRdGtCZS1jamJiTXhOTElUN3lrd3lNNTVkbnY1MlZLSmdodl9JOV9aUFp6T1NRSGU4dzNYNjM3MkhsWldxb3hSWFIteVY1VWkwMnNmQVdxa1BuMDlZVnRwZ2g3MUQtYlB0WmgtbHdZalMwSkQxMDZLdUJ5S09nNVpuS08xcnAtdU5meTU3ZlVHZS1yNS1YVUxZaVQ1OXVjQmZXbW9iUTl0a03SAcYBQVVfeXFMT2Z3Xy01dE40OF83M29nV0VhNzFWSzAxVVJzTmhtNzBoVFkwRFh4WGdXc0tmUHlLOEZabUJ3dkktVktDbDBYM0dxWkw0Z3picEd2ZjFSMHNNRWxHUy1zY2Z3RTNSNzgtZnVfd19KZXJzeC1HYTBxd0NoZ1RzTmR0UmZLcC1VQnZOSGtJRTR5RXVKT1hlaHZYNzRyd3R2a1VHTHBUT2pnbk5EV0tQSlhsdDJQc0I2RGtDcUltLU1rdERyVzhlb2ZR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Platform Infura's Step Toward Decentralization Includes Microsoft, Tencent - CoinDesk",
        "content": "The broad strokes of how Infura works are not changing under its new program, at least not yet, and it may seem a bit of a stretch for Infura to call its hand-picked network of infrastructure partners \"decentralized.\" However, the first new Infura feature to come from DIN could go a long way towards helping the platform address one of the biggest challenges it currently faces around reliability."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxPallKU2RvTXBJcUJrR3pTT3VjZTRsaEhmbC1jUHN6WGM1QllJbEdhdHU4WmpvMGZnal9aTWIwbDlFbWg3cXIyQlctVzEzclVSbWlkQmJsQVZjX2pJMks3YnRiaHBKS29kMy10YWRNRjJOTzBINThiREdHT1dlbHZBcDhsREN4dkF1WE9PNUk0cmN1V0FlS19Keno4RFc5bVhhVERFZnFVM1c1emlnMnJJU3NwRjjSAboBQVVfeXFMTWtpOVZGa01yTXVBQlV5YmJPVUVHYWVPNnVVTWtHOFRveTRNQV91TjVsMEI1Q1hObTFjeGNWVjVta1VsYjV6UGdMbHVHQUE4dmVrbU1oOEExN2huNmZja2N4QmpzUmFIRXFYRUQyMGk2bklIRU45RGlxMm1RR0Z4bnZtZVVqamZQRnhPRkU3QXNfSG53NC1SNW1CMjd4czg1N2JrV21ORVlkYUhiUXhUaF9hWVR1Q0M4eHJB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "Solana surges amid altcoin rally, nearly triples its price over the past month - CNBC",
        "content": "The price of the Solana token jumped Wednesday amid an ongoing rally in altcoins and bullish remarks on the token from famed tech investor Cathie Wood.\n\nSolana was last higher by nearly 18% at $65.65. It has nearly tripled in price in the past month.\n\nThe spike comes a day after Ark Invest CEO Cathie Wood applauded its performance this year on CNBC.\n\n\"Solana is doing a really good job,\" she told CNBC's \"Squawk Box\" on Tuesday. \"Ether was faster and cheaper than bitcoin [back] in the day – that's how we got ether. Solana is even faster and [more] cost-effective than ether.\"\n\nWood went on to say on CNBC Pro Talks that she \"really does like Solana\" while also noting that its downtime – the time the network is down, under maintenance, or suffering an outage – \"is much higher than it is for Ethereum.\"\n\n\"People are willing to put up with that because maybe the transaction sizes are not as large or for some reason are not as important, they just want speed and cost as their top priority,\" Wood told CNBC PRO. \"Each one of [the networks] is going to have a place.\"\n\nSolana, the sixth largest crypto token by market cap, according to CoinGecko, became the darling of the crypto world in the 2021 bull market as it sold investors a vision of something like Ethereum, but without the slow and expensive transactions.\n\nActivity on Solana has been growing all year, particularly in liquid staking protocols like Jito, according to data provider Kaiko. The token has topped the list of the most traded altcoins on US-available exchanges this year, outpacing dogecoin , litecoin , Polygon's MATIC and Ripple's XRP .\n\nMore recently, the token is following a broader crypto market rally led by bitcoin, that began Oct. 24, when the coin doubled for the year and topped $35,000 for first time since May 2022. Shortly, after ether followed, rising to the key psychological level of $2,000. Historically, the altcoin rally tends to follow ether.\n\n\"After Oct. 24 bitcoin started losing its momentum, which during bitcoin bull markets causes traders to go down the risk curve and switch to alts as a way of chasing huge profits,\" said Mikołaj Zakrzowski, an analyst at data provider CryptoQuant.\n\nThis time a year ago, the coin was facing a crucible moment after the FTX blowup sent it down 70% over two days and briefly traded under $10. FTX and its now-fallen leader Sam Bankman-Fried were widely credited with providing substantial money and resources behind the Solana project to get it off the ground.\n\nSolana is up about 550% this year and has been one of the best performing cryptocurrencies of 2023. By comparison, bitcoin and ether have gained about 127% and 70%, respectively."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxPallKU2RvTXBJcUJrR3pTT3VjZTRsaEhmbC1jUHN6WGM1QllJbEdhdHU4WmpvMGZnal9aTWIwbDlFbWg3cXIyQlctVzEzclVSbWlkQmJsQVZjX2pJMks3YnRiaHBKS29kMy10YWRNRjJOTzBINThiREdHT1dlbHZBcDhsREN4dkF1WE9PNUk0cmN1V0FlS19Keno4RFc5bVhhVERFZnFVM1c1emlnMnJJU3NwRjjSAboBQVVfeXFMTWtpOVZGa01yTXVBQlV5YmJPVUVHYWVPNnVVTWtHOFRveTRNQV91TjVsMEI1Q1hObTFjeGNWVjVta1VsYjV6UGdMbHVHQUE4dmVrbU1oOEExN2huNmZja2N4QmpzUmFIRXFYRUQyMGk2bklIRU45RGlxMm1RR0Z4bnZtZVVqamZQRnhPRkU3QXNfSG53NC1SNW1CMjd4czg1N2JrV21ORVlkYUhiUXhUaF9hWVR1Q0M4eHJB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "Solana surges amid altcoin rally, nearly triples its price over the past month - CNBC",
        "content": "The price of the Solana token jumped Wednesday amid an ongoing rally in altcoins and bullish remarks on the token from famed tech investor Cathie Wood.\n\nSolana was last higher by nearly 18% at $65.65. It has nearly tripled in price in the past month.\n\nThe spike comes a day after Ark Invest CEO Cathie Wood applauded its performance this year on CNBC.\n\n\"Solana is doing a really good job,\" she told CNBC's \"Squawk Box\" on Tuesday. \"Ether was faster and cheaper than bitcoin [back] in the day – that's how we got ether. Solana is even faster and [more] cost-effective than ether.\"\n\nWood went on to say on CNBC Pro Talks that she \"really does like Solana\" while also noting that its downtime – the time the network is down, under maintenance, or suffering an outage – \"is much higher than it is for Ethereum.\"\n\n\"People are willing to put up with that because maybe the transaction sizes are not as large or for some reason are not as important, they just want speed and cost as their top priority,\" Wood told CNBC PRO. \"Each one of [the networks] is going to have a place.\"\n\nSolana, the sixth largest crypto token by market cap, according to CoinGecko, became the darling of the crypto world in the 2021 bull market as it sold investors a vision of something like Ethereum, but without the slow and expensive transactions.\n\nActivity on Solana has been growing all year, particularly in liquid staking protocols like Jito, according to data provider Kaiko. The token has topped the list of the most traded altcoins on US-available exchanges this year, outpacing dogecoin , litecoin , Polygon's MATIC and Ripple's XRP .\n\nMore recently, the token is following a broader crypto market rally led by bitcoin, that began Oct. 24, when the coin doubled for the year and topped $35,000 for first time since May 2022. Shortly, after ether followed, rising to the key psychological level of $2,000. Historically, the altcoin rally tends to follow ether.\n\n\"After Oct. 24 bitcoin started losing its momentum, which during bitcoin bull markets causes traders to go down the risk curve and switch to alts as a way of chasing huge profits,\" said Mikołaj Zakrzowski, an analyst at data provider CryptoQuant.\n\nThis time a year ago, the coin was facing a crucible moment after the FTX blowup sent it down 70% over two days and briefly traded under $10. FTX and its now-fallen leader Sam Bankman-Fried were widely credited with providing substantial money and resources behind the Solana project to get it off the ground.\n\nSolana is up about 550% this year and has been one of the best performing cryptocurrencies of 2023. By comparison, bitcoin and ether have gained about 127% and 70%, respectively."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxQRXkzTmpHV2s3eFM2RjVPMzRPakl3cG5nVkZodmJaQ05QYmJVX1BBVFRmZ0FEQjJjR3ZWcnBINFltek9VaUktUFJCRzlNWFhsX3lwZUF6WTZJb3dvTnFlLUxQUFMtUWIzYTRnTU1wYWdlNUFxc0h5dVB1Nk91OTFZYkZNejQ2N0dURHN0WEU0WXdZV2Y4MDl4UlVBMC1TSUZoMkFBSW93LWsxUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Nov 2023 08:00:00 GMT",
        "title": "Nocturne Launches on Mainnet to Bring Private Accounts to Ethereum - CryptoSlate",
        "content": "Chainwire Nocturne Launches on Mainnet to Bring Private Accounts to Ethereum Chainwire · · 3 min read\n\nDisclaimer: This is a sponsored press release. Readers should conduct their own research prior to taking any actions related to the content mentioned in this article. Learn more ›\n\nNEW YORK, United States, November 15th, 2023, Chainwire – Nocturne, a protocol enabling on-chain private accounts, today announced the successful deployment of Nocturne v1 to Ethereum mainnet. This marks a significant milestone in the journey towards a more private and accessible Ethereum. For the first time, users will have a compatible and easy-to-use product resembling a private onchain account.\n\nNocturne v1 is a step towards compatible onchain privacy that functions simply as another account rather than a distinct tool or ecosystem. Users will find transacting with Nocturne similar to using a smart contract wallet, with the added benefit of privacy. Nocturne v1 is currently out-of-the-box compatible with any DeFi protocol that represents state via output tokens (e.g. Uniswap swap tokens, Aave aTokens, Compound cTokens, etc). There are plans to later extend this compatibility to arbitrary protocols.\n\n“With Nocturne v1’s launch, we’re moving away from the notion of a ‘privacy tool.’ Privacy should be embedded at the account layer and the v1 launch is the first step in making this possible,” said Luke Tchang, CEO and co-founder of Nocturne. “Our goal is to ensure that everyone, from individual users to large institutions, can transact securely without exposing their financial history to the world. This is more than a product; it’s a commitment to making Etherereum more accessible and enabling secure and private money over the internet.”\n\nNocturne is built on the belief that privacy on public blockchains will only become mainstream if it’s seamlessly integrated with the existing user experience. Nocturne’s objective is straightforward: to create private user accounts on L1/L2 that are fully compatible with existing Ethereum accounts. To read more about private accounts, please see Nocturne’s recent blog post.\n\nPrivacy: The Keystone for Ethereum’s Growth\n\nThough DeFi and other onchain activities have surged in popularity, privacy concerns have prevented broader acceptance and use of crypto as money. Recognizing that the typical user may be uneasy with the idea of their financial dealings being public, and that institutions demand confidentiality for their transactions, Nocturne addresses these critical barriers head-on. Privacy isn’t just a feature—it’s foundational to the broader adoption of crypto.\n\nNocturne’s Future Vision\n\nAs they continue building new versions, Nocturne’s long-term vision is to make the experience so seamless that by default, every Ethereum user automatically has a private account which mirrors their public account. In short, a seamless parallel account layer for privacy.\n\nNocturne’s plans for achieving its longer-term vision include:\n\nTransition to a more permissionless protocol by migrating to proof of innocence, as described by Vitalik and Ameen Solemani in the Practical Privacy & Compliance paper.\n\nBring Nocturne accounts closer to usable as general wallets by extending Nocturne’s protocol compatibility to arbitrary smart contracts.\n\nImprove the compatibility of Nocturne accounts with EOAs and smart accounts through a scheme that allows for public wallet authorization to be leveraged within Nocturne for security.\n\nHow To Access\n\nNocturne v1 is live and can be accessed through a dedicated private vault UI, allowing users to discreetly manage their assets. The current UI capabilities include deposits, transfers to new burner addresses, and private swaps and staking. To get started, visit app.nocturne.xyz.\n\nAbout Nocturne Labs\n\nNocturne Labs is a forward-thinking blockchain technology company committed to addressing the most critical privacy and user experience challenges within the Ethereum ecosystem. With a pioneering protocol for private accounts, Nocturne enables users to transact safely with built-in privacy. This marks a substantial stride in advancing the usability of public blockchains. Backed by notable investors such as Bain Capital Crypto, Polychain Capital, Bankless, and Vitalik, Nocturne is led by a team of experienced developers dedicated to enabling a more secure and accessible Ethereum. For more information, visit https://nocturnelabs.xyz/.\n\nContact\n\nPR Manager\n\nKayla Gill\n\nSerotonin\n\n[email protected]\n\nShare"
    }
]