[
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMi7gFBVV95cUxNTnBKUXE0RnVSekNoTUs4VWVac0F4MDd1UTNDN0s1elRyR1dYaFJVMUZlNEZEUkxtVGwxaXNmbG5uSC1HdDJJLXEzMm9JaG0zSjI5Mkl6ZHYxRDhmVkRQVER6SUJIM2NFMXRlREE3YkwyVUpjOFZ6dlRTZTUwQkpSZ3hwTV9GWGt6Z0hFRnROMzZOZ0dEYl92dTlZLTdVWmZjVlEyRlM5TXpGblB3NW11Qm1DcGpqYXQ5cnlsV3g1c1FkN2FLT0ZFRkdPSEhaQlE5eUE1TXFKeHZhdDRHMFV0b3VGWXBMQVh2YUFTai1n0gHzAUFVX3lxTFBpeTRKQncteGxBSlZSc2dmYVdDM1V6WkY0MFowRTFtM0lYSExkX2c0YUgxNG83UnplM1BodDBOVTJkUVdpdm5wODFvdDdLS01CN2FFd2lGYlNFMldqaEZvTFRtYWd2ZFk2ZjVPMUE0dnZMTmp4bjNBRFlDcTJjeHRsckc2SERpU0JoR0ExZ2xIVVpRa1RzMjRTUk56ZGlEbGw1Rm93c29TNmF3VEVlMlVkbzktanRVVFQ5bUltTExwWkFObWZjLUpOYV90ZnFEQVpQVWhKOE1Oc01yVk45OHhwYWthbUR2UWxubElGUGwxejVVRQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Charles Hoskinson and XRP community in loggerheads again, debate on Ethereum’s free pass resurfaces - FXStreet",
        "content": "Charles Hoskinson has addressed the rumors of Joseph Lubin of ConsenSys bribing the SEC to go after XRP.\n\nHoskinson finds himself in a similar situation as Brad Garlinghouse, as the SEC considers ADA an “investment contract” in its lawsuit.\n\nThe Cardano founder has asked the XRP community to present evidence of the bribery allegations and dispels the rumors.\n\nCharles Hoskinson, the founder of Cardano, engaged in a debate with the XRP community over the rumors of ConsenSys founder, Joseph Lubin, bribing the US financial regulator. The rumors seem unfounded and the XRP community has failed to present evidence supporting the claims.\n\nAlso read: LUNC ranks among trending tokens alongside Dollar pegged stablecoin USTC, eyes recovery\n\nCharles Hoskinson addresses rumors surrounding Ripple lawsuit\n\nCharles Hoskinson, the founder of Cardano is one of the co-founders of Ethereum. Hoskinson has been embroiled in a debate with the XRP community over alleged rumors of ConsenSys founder Joseph Lubin bribing the US Securities and Exchange Commission (SEC) to give Ethereum a “free pass” and go after Ripple. Here free pass meant Ethereum was allowed to conduct business as usual while Ripple was hit by a lawsuit.\n\nIt is important to note that Hoskinson currently finds himself in a similar situation to Brad Garlinghouse, the CEO of Ripple, in 2020. The US SEC slammed Ripple with a lawsuit, alleging the unregistered sale of securities, here securities meaning XRP. The SEC has listed Cardano as an investment contract in its lawsuit against Kraken, a cryptocurrency exchange. It is therefore clear that the regulator considered Cardano an investment contract.\n\nHoskinson commented on the rumors stating that the XRP community needs to present evidence to back its claims, or else he finds it a “grand conspiracy.”\n\nFor the argument that Joe bribed the SEC to go after XRP that is the conclusion. That is the entire point of calling it a grand conspiracy. The free pass has nothing to do with the case against Ripple. They are unrelated events. Two years now and you haven't provided any evidence… — Charles Hoskinson (@IOHK_Charles) November 30, 2023\n\nJoseph Lubin is involved here as ConsenSys is software production studio that offers clients enterprise Ethereum solutions. The tight relationship between ConsenSys and Ethereum gave rise to the rumors, however, no evidence of bribery has been presented so far."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxNUXItaGFwcGdXd2pCYXppV1ZDRkRYWWVGSVJwNGlEQmZzcW15YU9rZEJCRWstNFlOaXJ0NEQ2N0ZudWN2Sl9mN1BrU1Y2eTVtVzlKQ2U2UHotUHEtMDRrZFhlcFoyenhwWU1KaThUOFNQaC11a2lDcmVLQjNJaEdGUTV30gGHAUFVX3lxTE1HNUlySS15UkpadFNzSjNFQndWS1N3T1pCUThaTjBDcnhCd2I1d3AwdGlodUJvTndObjk5OVJ0ZUkwNXNPUjFURElnOExtNW5GVjF2Y2RnRTNkamdwNzVpTm1pOG1DS0gyOEZNQ2o4Ri0yVEtZc2pmRGJqbnpxdk8xZGxwTVNhcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Ethereum L2 Starknet Unveils Epic Airdrop, But There's a Catch - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nEthereum-based Layer-2 scaling protocol Starknet has sparked a frenzy in the community after confirming the long-speculated prospects of an airdrop. Taking to its official X account, the Starknet Foundation said it is making plans to distribute its native token, \"STRK\" to some of its community members on the condition that they must have contributed at one point or the other to its overall development.\n\nAdvertisement\n\nWhile the Starknet Foundation announcement resounded through the community, it had to sound a note of warning to enable community members to manage their expectations the right way. The outfit said tech teams typically develop a lot of products, many of which may not see the light of day - its way of insinuating that there is a small margin of probability that the STRK token may not be launched.\n\nWe have seen that a preview of an iteration of a possible provisions portal has been shared on social media. As noted a year ago in the original announcement of the STRK token, the Starknet Foundation is developing plans to distribute the token to certain users/contributors for… Advertisement December 1, 2023\n\nWith the excitement brooding since the protocol’s mainnet upgrade and since the rumor started making the rounds, Starknet said there are no actions that its community members will make now that will change the criteria as the screenshots to determine eligible recipients had already been taken.\n\nAs a matter of emphasis, it said further criteria or information that might be necessary for the STRK airdrop will be shared when ready.\n\nCrypto airdrops: A major trend\n\nAirdrops in the crypto ecosystem are not uncommon in the digital currency ecosystem and, in particular, among Layer-2 networks. Airdrops from Blur, Arbitrum and Optimism are among the biggest the industry has seen in recent times.\n\nWhile the Starknet airdrops frenzy is relatively new to the broader community, the most anticipated for now is that of XRP Ledger (XRPL)-based L2, Evernode (EVERS). Per recent statistics shared by the protocol earlier today, there are lots of community members vying to get their own share of EVERS as the protocol sets a legacy as one of the pioneering L2 protocols on XRPL."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxOWjdrdS1CTXRjZnNWUTc5Wk10blczZGY0dVFaNE5pdVVmdkFGZk9mdkMxOGV6NGN4VGdPNXVBMDhYbWxVTlBjT08tMlJxdzV2dHFXZG5Fc09hOVVvRWs3QUxReDZtMkdDMmN3RXZOOU55NXh1RFBtaHYyME1TT1ZKSTZuT1JkbXdFT3haU0dDZ0w0bzdlU09QSkU0ODdvdmhPTENlRjZVMktwZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "A complete guide to fast and secure bridge from BNB to Ethereum (ETH) - The Cryptonomist",
        "content": "The bridging of BNB BEP-20 tokens to the Ethereum network (ETH) opens up new avenues for users seeking increased liquidity, accessibility to DeFi applications, enhanced security, and improved interoperability.\n\nThis guide illustrates a simplified process for bridging tokens from Binance Smart Chain (BSC) to Ethereum (ETH) in four simple steps.\n\nThe advantages of BNB to ETH bridge\n\nIncreased liquidity:\n\nThe migration of ERC-20 tokens to the Ethereum blockchain significantly amplifies liquidity, mitigating price volatility associated with smaller markets. A larger liquidity pool ensures smoother token transactions, offering users greater trading flexibility.\n\nGreater accessibility:\n\nWith the transition of BEP-20 tokens to the Ethereum blockchain, users have access to a wider range of applications and services in the DeFi. These include lending protocols, staking, and trading, creating opportunities that may not be available on the BNB Chain, thus diversifying user engagement in the decentralized finance ecosystem.\n\nSafety:\n\nThe use of the robust network security of Ethereum ensures greater decentralization and security of user funds. The Ethereum blockchain, renowned for its resilience, becomes a reliable foundation for safeguarding assets during the bridging process.\n\nInteroperability:\n\nThe bridging of BEP-20 tokens to the Ethereum blockchain promotes greater interoperability between the two networks. Users can transfer tokens seamlessly, facilitating a smoother experience across the different functionalities offered by Binance Smart Chain and Ethereum.\n\nHow to transfer BNB to ETH in 4 easy steps\n\nPhase 1 – Connect the wallet\n\nVisit the Binance bridge (with attached login) and connect your wallet, which supports a range of options. Choose the wallet containing the tokens to be connected.\n\nPhase 2 – Select chains and tokens\n\nChoose the source chain (BNB) and the destination blockchain (Ethereum). Select the specific token from the dropdown menu or paste the contract address if it is not listed.\n\nPhase 3 – Setting gas rates\n\nSelect the desired amount of gas for bridge tokens, which affects transaction speed and costs. The recommended settings are standard or high to achieve optimal bridging results.\n\nStep 4 – Confirm the transaction and obtain the tokens\n\nExamine the details of the transaction, including wallets, gas fees, and tokens. Confirm the transaction and wait for processing. Once completed, the tokens have been successfully transferred to Ethereum.\n\nHow to calculate gas fees?\n\nTo calculate gas fees for a transaction from BNB to Ethereum, determine the gas price and gas limit.\n\nMultiply the gas price by the gas limit to obtain the total gas fee. Gas prices can fluctuate, so it is good to adjust accordingly for timely processing.\n\nMinimize costs by adopting a low-price gas strategy, comparing rates from various bridge services and considering factors such as reputation and security. Balance cost effectiveness with reliability to achieve an optimal bridge.\n\nConclusions\n\nA blockchain bridge facilitates the seamless movement of assets between blockchains, allowing users to leverage different ecosystems. Decentralized and centralized bridges offer different features, ensuring flexibility in asset transfers.\n\nThe transfer of BEP-20 tokens from Binance Smart Chain to Ethereum unlocks a series of advantages, including increased liquidity, accessibility to DeFi, enhanced security, and interoperability. Users can seamlessly navigate both ecosystems, maximizing the potential benefits offered by each blockchain."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxOcTFQVDQ4OFdKNU0ydmZvTmJ3WTJGLXBCNS1RejV6dmRyOUJUMmhNLVNsS3VHYUs5NENGeGtGVE1kYUZBbDh0YWRMNlZEWVZFZURpMkwwNlhnWF9ieHRNQXRoOHJpXzQ1dEU4NG1ZVlJPVHdIMU5KT1lqMlVkSnBuclQ1RDQ5dkJ6Y01ab3FVUmFQUdIBlwFBVV95cUxPR0tJdW9vX0dzbkpnN1g4a2JKZTJfWm1iUTFPdGJzTldfcDF5Q0w3NmJNQ0FyUVlvb2oxZjhjZ2h4ZUxwMUc5YXptMG4yMzE0LTRBMk0tNkZFRld2NEtzM01lTzVoR1p4ZzhMUGw1c2ozQ1VKV21ET2lmd19nZ3E1Z2h5Szg0bmtWLTFVOWtXWG43ZWYzdkpZ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Price Prediction: Is ETH Ready For New ATH In 2024? - CoinGape",
        "content": "Ethereum Price Prediction: Ethereum (ETH) price stayed relatively unchanged on Thursday despite the trading volume dropping by 20% to $8.5 billion. Intriguingly, the altcoin’s market cap is holding up above $245 billion, according to market data by CoinMarketCap.\n\nThis has been a week of consolidation with Ethereum price sitting above the $2,000 level. Recovery has become an uphill battle leaving Ether to wobble between support at $2,020 and a short-term resistance at $2,070.\n\nadvertisement\n\nEthereum Price Prediction: How Far Is Ethereum From Breakout?\n\nThe Moving Average Convergence Divergence (MACD) indicator upholds the mundane sideways trading Ethereum has displayed since Monday. Its downside is protected by the 100 Exponential Moving Average (EMA) (blue) at $2,020 and the ascending trendline.\n\nEthereum price tends to react bullishly every time it has retraced to touch the trendline. Therefore, in case of dips towards the $2,000 mark, bulls could seize the opportunity to buy into ETH while speculating on the next breakout first to $2,200, and later to the subsequent levels at $2,500 and $3,000.\n\nTraders should exercise caution and restraint as long as Ethereum is trading below the short-term resistance at $2,040, as highlighted by the 50 EMA (red). The action above this level and the next resistance between $2,058 and $2,070 would serve as a breakout signal, paving the way for a bigger move to $2,200.\n\nThe momentum indicator will confirm the uptrend’s continuation with the blue MACD line flipping above the red signal line.\n\nA triangle pattern forming on the four-hour chart could nurture a bigger breakout towards $3,000 if validated. Bulls must focus on breaking above resistance at $2,120 to activate the triangle breakout. Most traders would consider going long on Ethereum slightly above the triangle.\n\nRecommended for you: Dogecoin Price Could Blast Through $0.12 Resistance If This Technical Pattern Plays Out\n\nA glimpse of the daily chart assures traders of support at $2,015 but based on the current technical, as depicted by the sell signal from the MACD, ETH might drop again before making another significant recovery attempt.\n\nHowever, backing the bullish outlook in ETH is the position of all three moving averages; the 50-day EMA, the 100-day EMA, and the 200-day EMA. If the MAs uphold the ongoing uptrend, the path with the least resistance is likely to stick to the upside.\n\nEthereum DeFi TVL Shoots To $26 Billion\n\nThe dollar value of all ETH locked in staking protocols and other decentralized finance (DeFi) networks is increasing rapidly. According to data by Defi Llama, the total value locked (TVL) currently stands at $26 billion from approximately $19.4 billion in mid-October.\n\nThe growth in TVL underscores the long-term bullish outlook investors have for Ethereum price. They are willing to lock up their Ether for longer periods, expecting that the uptrend will continue into 2023. A high TVL value significantly reduces the selling pressure.\n\nRelated Articles\n\nJohn Isige John is a seasoned crypto expert, renowned for his in-depth analysis and accurate price predictions in the digital asset market. As the Price Prediction Editor for Market Content at CoinGape Media, he is dedicated to delivering valuable insights on price trends and market forecasts. With his extensive experience in the crypto sphere, John has honed his skills in understanding on-chain data analytics, Non-Fungible Tokens (NFTs), Decentralized Finance (DeFi), Centralized Finance (CeFi), and the dynamic metaverse landscape. Through his steadfast reporting, John keeps his audience informed and equipped to navigate the ever-changing crypto market.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiY0FVX3lxTE1NVnVnVW1uN3czaE1FWFp2cFZoNmVpSW1KTDZ4R2JENHNaWng5eXJaLXFKdUhlM040ckJNc3o4MjFfNndTYXBNZF9xa1RyVlZFUEx3STlPZC1tUEtfc2ViQ2lwTQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Blast from the past: 3 years on from the launch of ETH staking - Blockworks",
        "content": "Yeeting ETH into the void is nothing new for Ethereans.\n\nBy the time the Beacon Chain officially launched on Dec. 1, 2020, the staking contract — referred to as “ETH 2.0” back then — had already seen around 880,000 ETH in deposits.\n\nSo perhaps it’s no surprise that multisig-with-a-plan project Blast now sports $650 million in staked ether and stablecoins under its control.\n\nBlast’s explicit promise is that deposited tokens will earn an on-chain yield, plus rewards of unknown value. Ether staking yield comes via Lido’s stETH tokens, while stablecoins are converted to dai deposited in Maker, or savings dai (sDAI).\n\nOn Thursday it emerged that the Blast deposit interface set its slippage tolerance to an inordinately high 10%, resulting in one user losing about $100,000 in value. The Blast team says they’ve fixed it.\n\nBut, sandwich attack surprises aside, most depositors at least know that all assets will be locked until the proposed optimistic rollup launches in February.\n\nDepositors to the Beacon Chain, too, knew that their ether would be locked up for at least a couple of years — though it wasn’t clear when exactly The Merge and subsequent enabling of staking withdrawals would happen when many aped in.\n\nUltimately it took until April 2023, by which time about 18 million ETH (about $33 billion at the time) were deposited.\n\nIn the interim, there was a rapid growth in liquid staking, with Lido becoming the dominant player in early 2022, and already nearing a third of all staked ether by May 2022. It has remained between 29% and 33% ever since, keeping the project at the center of a debate about centralizing market forces on Ethereum.\n\nThe total percentage staked through Lido currently stands at 32.28%, and Blast — which uses Lido exclusively — isn’t helping.\n\nHow much of a problem that is, depends on who you ask.\n\nSome will analogize the concentration of ether stake to the preponderance of the Go Ethereum (Geth) execution client for Ethereum node operators. A great deal of social coordination was needed to bring down the market share of Prysm on the consensus layer, which reduces risks to the network as a whole. Geth is currently at 84%.\n\nClient diversity is widely seen as one of Ethereum’s strengths, a hallmark of its resilience through decentralization, which is unmatched in crypto. Indeed, decentralization and resilience are often seen as synonymous.\n\nLoading Tweet..\n\nThat’s why some are concerned about the Blast-fueled tick up in Lido’s stake share.\n\nBut for others, it’s a feature, not a bug. Blur and Blast investor Izebel.eth stated the “3 line pitch” for Blast is that “[Ethereum] would be better if everyone used stETH…so we use the bridge as a forcing function.”\n\nLoading Tweet..\n\nOf course, the “bridge” is not really a bridge, while it can only be crossed one way. And forcing people into a harmful position isn’t doing them any favors.\n\nLoading Tweet..\n\nIt’s generally good advice to be wary of promises from backers that something can “reshape the fabric of society.” That’s not just “ambitious” — it’s hubris.\n\nNone of the more academic discussions ultimately matter, though, when you have gamification as your selling point. And, maybe there are bigger fish to fry.\n\nIn any case, Lido has more TVL — approaching $20 billion — than any other DeFi protocol by a country mile. And Blast is bigger than Base — in third place behind Arbitrum and Optimism according to L2Beat — while now hiring software engineers, much to the amusement of crypto Twitter.\n\nPlenty of folks in this industry idolize the free market; so if that’s your modus operandi, then the market has spoken, for now.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    }
]