[
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMi4AFBVV95cUxOSnBtRTQxRFJmUV9DSzdHQWRaamV1N0h2N3dCM283cGdQRUpwY2t0YVA4Z2xEa21sa243TWNBQzZQYndwdkZnTE81WW9rbkNoT05KN0w5UXh1YjlnWTlCZnJXT2RBTUVURmxzT2JPQkw2d3JPN1hKZWttQmh5dU8tV2ZaMm10dDE1UHh6SDhiWTZ4cXVpaFpYM1pFTE5RUVo2Y3Q1MDhVaVlEVTA0RzVQSjZoWmV5bFBQMjRsZFZadzhiV09ONVBBYWEtU2VBb21oM1RfdmpBR01nLUM3cENyS9IB5gFBVV95cUxOZWdackdiU09vX1pxd21yaVZwZ2pHWXRDRzlmZnlFaFZOdEpxR2V0T2ZEc0l5LTZHclBOMFhpRjdxc1d2QmZUVGV3VjVlSy1zR0JESkpXRE0tMS1ycUFFYmxJUmxJdWg4bHNKanJyMVUzLWc3TWN6TDBMOUROamNqTTdQSHdJYkd0WkpKWVZuN2c4cnktVnBGV3FvaXMzbHc3dmdLcE4yVDBYUHVsUjJGaGtKWGJqTGhzMmtvOVRjYWswVTZLTTFKSlRESDcyMVIxSkpoam1yUnM5OEZpVVBQTkoxWHZOQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Nov 2023 08:00:00 GMT",
        "title": "‘One of Most Bullish Charts I’ve Seen’ – Ex-Goldman Sachs Executive Details Ethereum Outlook As ETH Prints New Pattern - The Daily Hodl",
        "content": "Real Vision CEO Raoul Pal says that key indicators are flashing bullish for the smart contract platform Ethereum (ETH) as the altcoin remains above the $2,000 level.\n\nIn a new analysis, the former Goldman Sachs executive says that Ethereum’s price action continues to print bullish patterns.\n\n“The zoomed-out chart of Ethereum continues to be one of the most bullish I have seen.”\n\nAccording to the macro guru, Ethereum’s market structure is closely mirroring increasing market liquidity.\n\n“Fed net liquidity versus Ethereum: Ethereum, for example, is basically a pure play on liquidity.”\n\nIn the short term, Pal says that Ethereum is now potentially forming a bullish cup-and-handle pattern after having completed a bullish flag pattern. The investor says Ethereum will likely gain bullish steam if it closes above $2,150.\n\n“Speaking of Ethereum, we’re currently in the process of testing very important levels. We have been highlighting the bull flag chart pattern in Ethereum – which we recently cleared – for several weeks now and it looks like we could be forming a larger cup-and-handle pattern.\n\nA close above $2,150 would be very positive. Something to keep an eye on.”\n\nHe also says that he is long-term bullish on Ethereum after ETH broke out of a wedge pattern at the $2,087 level on the weekly chart.\n\n“If we zoom out using weekly data, Ethereum has already broken out from its near-perfect wedge pattern; it’s a very bullish chart.”\n\nEthereum is trading for $2,023 at time of writing, down 2.1% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxNd0k1V092LW11cmRBRDZ5Mmk0SEpzME9wUGZEcldsMWVOQlJkNU9fUkZDT0ZTOU9za3hUbk9zSlZWTElnbmhhNFBQSzR2UU9ZYXZBLTV2Vy1rdl9BeXdMY3hTYWFFTlZ4QUtCY1o2TTNlc2lBeDlUeFFZTE05WmNNXzFOWHFVRXRXWHBGRU9rTXJXX0tibUQwVmszSHRPT3pO0gGmAUFVX3lxTE1EX0NnbmJaeWpISXN6dGtOMjF6QnljWVVyal9FXzhFNUVaM2N3b252U3lsdXlDaENGdUdmSW83UVItSXkwWjNWcm02U2V6aHE4aVNDUUpYMVRONl9GeTR5WTRfVGk2WU9xdWk4bmVyYTk0UnAwSjlRTFNsZWhKQ3NTSXN1M0JUVmhPVHZCREJOMUVqYkpNVlJLazM4U2syNFczd3hZNXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Nov 2023 08:00:00 GMT",
        "title": "Here is When Ethereum (ETH) Might Reach Its ATH Again: This Analyst Chips in - CryptoPotato",
        "content": "TL;DR\n\nEthereum (ETH) is showing strong performance, currently trading around $2,000, with predictions of reaching its all-time high of over $4,800.\n\nAnalyst FieryTrading forecasts ETH to reach nearly $5,000 by early 2025, citing a long-term bullish pattern.\n\nThe same analyst predicts a significant rise for Cardano’s ADA, expecting it to exceed $35 by 2025 based on bullish market patterns.\n\n‘Big Gains for ETH’ on the Horizon?\n\nEthereum’s native cryptocurrency – Ether (ETH) – is another asset that has shown strong resilience following the devastating market crash in the second part of 2022. It currently trades at around $2,000 (per CoinGecko’s data), a 70% price increase compared to the first day of the ongoing year.\n\nSome analysts believe the current condition is just the beginning of an uptrend that could eventually take ETH to its all-time high of over $4,800. Such an individual is the one using the TradingView handle FieryTrading.\n\nAccording to them, the coin has been in a bullish mode for the past year and a half, suggesting a further surge in the following months.\n\n“As seen on the chart, ETH has been trading inside a bullish triangle pattern for over 1.5 years. In my eyes, a break out from this pattern might result in big gains for ETH since it will burst through an area full of short-trade stop-losses, which will be forced to buy back their positions,” the analyst argued.\n\nAccording to their analysis, Ether’s jump toward almost $5,000 is expected at the beginning of 2025. “With a stop below the recent swing low and a target around the current ATH, we can construct a very decent long-term trade for this big token,” FieryTrading concluded.\n\nThe Analyst’s Take on ADA\n\nApart from predicting ETH’s possible price trajectory, FieryTrading has also given their two cents on Cardano’s native token – ADA.\n\nThey believe the asset is poised for an astonishing increase toward $35 in two years based on certain parallel channels that hint about the beginning of a bull run:\n\n“Since the pattern has now been confirmed, we can take a look at the next bull-market top. Assuming that the bull-market top will be somewhere in 2025 and that ADA will continue to follow this pattern, we can make the assumption that ADA will top somewhere above $35.”"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTFBtQmVlcHllbEJtNDZURmZzS1VXeGRabEgtSlRKc1VNcXdGeXBVb1czM1RxRGxGajkzZFBOYkZiQWZuZmVwSkpEa0xNeEt2QV9uSUc3YUJKNWU1a0Z6aUF6UnE1OWJfNVhiVE5kS0ZfaUZfQ3hJSUE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Nov 2023 08:00:00 GMT",
        "title": "Ethereum ‘smart account’ adoption is low — the first rollup proposal wants to change that - Blockworks",
        "content": "The introduction of Ethereum Foundation’s ERC-4337 account abstraction standard earlier this year drew much attention, but adoption and retention are off to a slow start.\n\nExisting hardware wallets rely on a pair of keys. If those keys are compromised, so are tokens in the wallet. The ERC-4337 standard was instead intended as a new baseline for how users interact with crypto wallets services, including social recovery mechanisms and other multisig options.\n\nThe standard turns Ethereum accounts into “smart accounts,” which are much more flexible to suit the needs of wallet holders.\n\nAccording to data on BundleBear:\n\nWeekly retention for ERC-4337 smart wallets drops as low as 1% for accounts older than five weeks.\n\nAn average smart account only sends five user operations.\n\nRevenue for transaction “bundlers” is also low, currently less than $8,000 per week.\n\nRead more: What Are Smart Contract Wallets? A Beginner’s Guide\n\nAt the time of writing, daily active users are at around 3%, sixdegree data shows. Most smart account users today are on the Polygon network, making up over 66% of all smart account holders and almost all monthly new users by chain.\n\nDespite the low adoption rates on Ethereum, industry participants remain optimistic about the future of smart accounts and have been actively working on proposals to spur usage.\n\nJohn Rising, the co-founder of Stackup, an account abstraction infrastructure company, notes that many existing issues with ERC-4337 can be resolved with the first-ever Rollup Improvement Proposal, RIP-7560.\n\nThe existing ERC-4337 standard is considered a “semi-native+” smart account, where a user does not need a private key because the trustless relay network is designed to forward transactions to the blockchain.\n\nRising believes that the goal is to move towards a “native” smart account, where accounts would be able to specify their own validation logic, completely removing the need for a private key — something that RIP-7560 hopes to do.\n\n“ERC-4337 has always been intended as a stepping stone to native account abstraction. The account abstraction proposal, RIP-7560, is designed to be backwards compatible with ERC-4337,” Rising told Blockworks.\n\nFurther discussions around the proposal and its applicability must still be considered. Native account abstraction has drawn concerns over the complexity it adds, as it introduces consensus layer changes rather than just high-level infrastructure layer modifications.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMi5gFBVV95cUxOX3AzMVBQY3E1cVN6WElIeEJwMS1Nc2dOMmJKMWVZS0lndmVBNmwzVmQ1WDRMa01Mb0c1Nk1oMG5lM1BQX2FrTVJPelRkbTd4TEdGbGIyVkk1dVprVTZTZ3hUanJ1Q1QyYWJDUEx5cHcwaVAySEJuRGYyWHh5SHk0Q3lvTGhpMWV1b3RqWXVyRWgwYXBpd2daUEppczBLRmd3LWRobnltcUluNEN0VjNfRlhfdXZGMzhNVHJsbS10eWxqQ0pJWm1taE5iUHJfaUZiRXlkUkNlQWxINE5rbk1UWGt6bkI2Z9IB6wFBVV95cUxNSUljLTBoTjlfZ1MwQlZCU05uUXRkT0QzYnhnUmhmZzZaYzRZVDJ3NkdLdlNLZ2txRmdsR2tONUY0bFpSSDFsZ0N4My1UZjZ3SXk1cG5aZy00amwwSGFxb2dYTkhaMnhFcXBJelRoZXRfTXFYQklkNjdoVEhpc0lwa0hMZVBOTkw3ekVmZVI5czRFcWRwTEJjaDhXaGZMNnlzTUltenFFdUNSOFdEU2xreXlYb0FtOURvbkk3SGNGekJHTEo2WWtiR0E1N0J5djdIZ2lLcmVKS0VwcjNkd3lMemZvSjh0WkNFSHZj?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Nov 2023 08:00:00 GMT",
        "title": "Ethereum price may lose $2,000 level as ETH becomes deflationary again due to validator exit - FXStreet",
        "content": "Ethereum price, trading at $2,038 on Tuesday, will likely fall below the crucial support level amid waning bullishness.\n\nETH validators, for the first time since Shapella's hard fork, have begun exiting to the tune of 1,018 per day.\n\nETH issuance has also taken a hit and, for the first time since December 2022, has recently had its growth rate decreased by 0.5% per day.\n\nEthereum price has been affected by the Shanghai hardfork since even before it was activated. But since the upgrade, this week marks the first instance when the market is witnessing the fear of unstaking come to life.\n\nEthereum price could take a bearish turn\n\nEthereum price has been hovering around the $2,000 mark since the beginning of the month. Trading at $2,038 at the time of writing, the second-generation cryptocurrency has failed to breach the resistance of $2,124 for the second time this month. While it did manage to break out of the downtrend over the past week, it is still vulnerable to a decline below the $2,000 support level.\n\nThe Relative Strength Index (RSI) is a measure of the speed and change of price movement. According to the indicator, there is still room for ETH to bounce back and reinitiate bullish momentum, given it is sitting above the neutral line at 50.0. The Moving Average Convergence Divergence (MACD) indicator is also exhibiting the dominance of bearish momentum in the market presently, owing to the red bars on the histogram and the lack of a potential bullish crossover.\n\nThus, all the fingers point at a likely downtrend, which might see Ethereum price touching the lows of $1,900 or testing the support at $1,795.\n\nETH/USD 1-day chart\n\nBut if the broader market cues turn bullish and ETH bounces back from $2,000, it could make another attempt at breaching the resistance marked at $2,124. A rise through that level would invalidate the bearish thesis, opening ETH up to tagging $2,200.\n\nEthereum turns deflationary again\n\nThe chance of a bullish turn of events is both likely and unlikely. It's likely because ETH is deflationary once again. An asset being deflationary simply means that it no longer has an infinite supply but that it will reduce over time. This generally is a bullish event since low supply plus high demand equals a rise in price.\n\nBut the reason it could be unlikely in the case of Ethereum is that the conditions under which ETH is turning deflationary are unfavorable. According to blockchain analytics platform Glassnode, daily ETH issuance has experienced a slowdown. Over the last week, the growth rate of ETH issuance has slowed by up to 0.5% per day.\n\nEthereum daily issuance\n\nThis marks the first issuance decrease in nearly 12 months, and the reason behind it is the exit of validators. Unlike Bitcoin, Ethereum runs on the Proof of Stake consensus method, which requires node/block validators to stake ETH in order to qualify. Earlier, this staked ETH could not be withdrawn, but that feature was activated after the Shapella upgrade.\n\nSince then, on average, 380 validators have exited on a daily basis. But this figure shot up by 168% in just a month, rising to 1,018 validators.\n\nEthereum validators\n\nConsequently, the staked ETH has also noted a decline. The possibility of the validator exit could be due to one or more of these three possible reasons:\n\nInvestors are opting to change their staking setup, for example, by transferring stakes from CEXs (centralized exchanges) to Liquid Staking Providers (perhaps due to ongoing regulatory concerns).\n\nInvestors with access to US capital markets may be rotating capital toward safer assets, such as US treasuries, as interest rates remain elevated relative to ETH staking returns.\n\nInvestors may also be seeking greater liquidity for held ETH in anticipation of an imminent market uptrend rather than less liquid-staked ETH.\n\nNevertheless, this is not a good sign for Ethereum as the validators are the backbone of the network, and their exit could prove to be rather negative."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPbUZhVW13bGpsS2RZSEVWNTByUXFtVWR5eVFVUnpzZGtOV0xkOHhtV1o4MUtGSFkzLTQweEdKSkhHMHFsTVkxQi10Z3NPQ3VwdEYyd2lSRTBnMEg5N1Y4cW0xcDlHaUl5VllfVUV4OGFBZl9yRDdZQUJfLWRVcWVZVnpXU2dQT3Mw0gGQAUFVX3lxTE5WLXdnejZSUXkwWVA4a3BaaE1RVE9nZWFsT0VtZ1hrWFgxdWRfYXQ2R21UbTEyWllKamxRQ25hM1JSTTNFR054WnNPeThfSlJPX3h3MGxiX2x1WExiazBpU3hrSWVodU45OWJMN04tQ1Bpb0gtNmxnS0Z4VDNkeHBhcGVESTVGM0pMbHNJMXA5QQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Nov 2023 08:00:00 GMT",
        "title": "Ethereum’s Vitalik Buterin: If AI Turns on Us 'Even Mars May Not Be Safe' - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nOn Monday, Ethereum creator Vitalik Buterin reflected on his own take on “techno-optimism,” inspired by Marc Andreessen, who opined about AI in his Techno-Optimist Manifesto in October. While Buterin agreed with Andreessen’s positive outlook, Buterin also noted the importance of how AI is developed and the technology's future direction.\n\nButerin acknowledged the existential risk of artificial intelligence, including causing the extinction of the human race.\n\n“This is an extreme claim: as much harm as the worst-case scenario of climate change, or an artificial pandemic or a nuclear war, might cause, there are many islands of civilization that would remain intact to pick up the pieces,” he said.\n\n“But a superintelligent AI, if it decides to turn against us, may well leave no survivors and end humanity for good,” Buterin said. “Even Mars may not be safe.”\n\nAD\n\nAD\n\nButerin pointed to a 2022 survey by AI Impacts, which said between 5% and 10% of participants believe humans face extinction from AI or from humans' failure to control AI, respectively. He said that a security-focused open-source movement is ideal for leading AI development rather than closed and proprietary corporations and venture capital funds.\n\n“If we want a future that is both superintelligent and \"human—one where human beings are not just pets, but actually retain meaningful agency over the world—then it feels like something like this is the most natural option,\" he said.\n\nWhat’s needed, Buterin continued, is the active human intention to choose its direction and outcome. “The formula of 'maximize profit' will not arrive at them automatically,” he said.\n\nButerin said he loves technology because it expands human potential, pointing to the history of innovations from hand tools to smartphones.\n\nAD\n\nAD\n\n“I believe that these things are deeply good, and that expanding humanity's reach even further to the planets and stars is deeply good, because I believe humanity is deeply good,” Buterin said.\n\nButerin said that while he believes transformative technology will lead to a brighter future for humanity, he rejects the notion that the world should stay how it is today, only with less greed and more public healthcare.\n\n“There are certain types of technology that much more reliably make the world better than other types of technology,” Buterin said. “There are certain types of technology that could, if developed, mitigate the negative impacts of other types of technology.”\n\nButerin cautioned about a rise in digital authoritarianism and surveillance technology used against those who defy or dissent against the government, controlled by a small cabal of technocrats. He said the majority of people would rather see highly advanced AI delayed by a decade rather than be monopolized by a single group.\n\n“My basic fear is that the same kinds of managerial technologies that allow OpenAI to serve over a hundred million customers with 500 employees will also allow a 500-person political elite, or even a 5-person board, to maintain an iron fist over an entire country,” he said.\n\nWhile Buterin said he is sympathetic to the effective acceleration (also known as \"e/acc\") movement, he has mixed feelings about its enthusiasm for military technology.\n\n“Enthusiasm about modern military technology as a force for good seems to require believing that the dominant technological power will reliably be one of the good guys in most conflicts, now and in the future,” he said, citing the idea that military technology is good because it's being built and controlled by America and America is good.\n\n“Does being an e/acc require being an America maximalist, betting everything on both the government's present and future morals and the country's future success?” he said.\n\nAD\n\nAD\n\nButerin cautioned against giving “extreme and opaque power” to a small group of people with the hope they will use it wisely, preferring instead a philosophy of \"d/acc\"—or defense, decentralization, democracy, and differential. This mindset, he said, could adapt to effective altruists, libertarians, pluralists, blockchain advocates, and solar and lunar punks.\n\n“A defense-favoring world is a better world, for many reasons,” Buterin said. “First of course is the direct benefit of safety: fewer people die, less economic value gets destroyed, less time is wasted on conflict.\n\n\"What is less appreciated though is that a defense-favoring world makes it easier for healthier, more open and more freedom-respecting forms of governance to thrive,\" he concluded.\n\nWhile he emphasized the need to build and accelerate, Buterin said society should regularly ask what we are accelerating towards. Buterin suggested that the 21st century may be \"the pivotal century\" for humanity that could decide the fate of humanity for millennia.\n\n“These are challenging problems,” Buterin said. “But I look forward to watching and participating in our species' grand collective effort to find the answers.”\n\nEdited by Ryan Ozawa."
    }
]