[
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxQU3hDeEZiNTFST1VKMkpyUVBaTXNyNjRscmMyMkZVOG5oSGVJZ0RqUnFKWk9LbzhHSG12LWtfQmV3dVItNkxTWFI2MkoxNl9Qc3NCQzFnWDNJeVNLR0J0X3diY0NIaHUxSXNPRzN4Q2hESnlNVkdMbUl6TWJMV01jdmYwUlItQ0lVRG9jTzhEakgtT2R6QWdmZ1MtZHZsdzDSAaQBQVVfeXFMUEZKbXJfWHY5d2M2cTYxVzNaNFdwU0YydDZJZWxjX0M2NjRtQVVPelJBVWk1SFlGVWk4dzhFN2lnVFJZNzI0OG5mNlZxeTA1d0Nob2ZIRW9JaG82WFVLeEVxQTQ2eElEbVBrUjc0dmtpRXh5MnYwNEMwVEIzWV9JY1dKYmFLcWIxSWVxZUlTa2ZhUXJsUHdpa0hENkstRXdfcXdMTDM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Dec 2023 08:00:00 GMT",
        "title": "Starknet Foundation to Allocate 1.8B STRK Tokens 'Soon' - CoinDesk",
        "content": "Regarding the user rebates, Starknet said: “Planning for this initiative is currently underway and a new committee is being formed to oversee the distribution of STRK to reward users for their vital transactions on the network.”"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxQd0ZuY3BsR0pfSTQ1TTZsZDhlNm52SWFnd2ppUFRQdHF0OF8zbVFMNmpfbUFvaGJWaERPS0VzWFJYMFV3cXdNODRSWGpPX2RDckFCWFRVVEJ3bDlJZkgxcHZqRFZncDN5R1dlSG1VYmlnc3lvUnZWLTFxMEIzSGx2Yk1fRWlZOWZBZW5UbkxBVFV0SlZzM0F5RW9JTnphMy1HLUprSDdoVm5NTVJyVUMwcVRZaURXaFZJa3BnWlVWbGdJRHdpM0RGV0lkaERYTnNvZFZhctIB2gFBVV95cUxNOERNUzNMekNwdnlRdDEyVnNzQU5ZZjdmWWlrN2lhT09HR1dPVE1IUFV0ZG8xb1NTbXFuMW1FSVRUS25JY1g0NFRWV21zZHAyNkpTM2t1YlRXM1k4UWxJUGk3QUxHZERvZGlkX0hXUUhPcC1MdnBaUE1saE00OWtuSUJieUE0NHBFWTViQzZwUlhOYWRwekNzYmRGYTdoZWpyX1ZXc2hPYUhyVUhSVnY4SXFoLWlhNHh2el9tQlFPWFpCODlkVkF1QWExdnpqYVVvNXJoVzFJVnpaUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Dec 2023 08:00:00 GMT",
        "title": "Top Analyst Says Ethereum on Cusp of ‘Inevitable Rage Pump,’ Updates Outlook on Bitcoin and One New Altcoin - The Daily Hodl",
        "content": "A widely followed analyst and trader believes that Ethereum (ETH) is gearing up for a big burst to the upside.\n\nThe analyst pseudonymously known as Bluntz tells his 230,700 followers on the X social media platform that Ethereum has officially entered bull territory after leaving its multi-month accumulation range.\n\nAccording to the analyst, Ethereum will leave behind traders who are fixated on ETH’s performance against Bitcoin (ETH/BTC).\n\n“ETH has well and truly broken out of a year and a half range now.\n\nJust waiting for the inevitable rage pump that catches everyone out while they’re too busy shi**ing on ETH/BTC.”\n\nWhen paired against the US dollar, Ethereum is trading at $2,373 at time of writing, up by around 93% so far this year. When paired against Bitcoin, Ethereum is trading at 0.05462 BTC at time of writing, down by around 23% year to date.\n\nLooking at Bitcoin, Bluntz says that the flagship crypto asset will likely extend the rally that kicked off at around the $36,000 level. According to the analyst, Bitcoin looks poised for another move up while other traders are waiting for a deep corrective move.\n\n“All I see is people taking profit and warning of impending 10-15% pullbacks.\n\nYou all are not ready for how far this leg from $36,000 extends.”\n\nBluntz is a popular practitioner of the Elliott Wave theory, a technical analysis method that attempts to predict future price action by following crowd psychology that tends to manifest in waves. According to the theory, a bullish asset witnesses a five-wave rally with each wave having its own five sub-waves.\n\nLooking at the trader’s chart, he seems to predict that Bitcoin will rise to as high as $53,000 before ending the five-wave surge.\n\nBitcoin is trading at $43,435 at time of writing.\n\nNext up is the layer-1 smart contract blockchain Sui (SUI). According to Bluntz, Sui is gearing up to break out of its accumulation phase.\n\n“SUI is another new coin that looks ready for the markup phase.\n\nHad an 80% decline after initial listing pump and now some very nice accumulation.”\n\nSui is trading at $0.681 at time of writing, slightly above Bluntz’s accumulation range.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOd2xXSWgxdjd2aUZmaEtVTjM3QklwUU1paUV2VTE2eHpkQUs3ZmY5TnZrVF93MFRzSENjQ2FvTHJxMml3VTdOek56ZHRLNVpRUmViRHRCX2pFX2RuZDhqV1VBSkxMRUtUU2k0UE5ISnAtak9tMnRlb19UcWhncnJucTVsdnBqZV9HRGViUm9ydw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Dec 2023 08:00:00 GMT",
        "title": "Crypto: Ethereum Catches up with Bitcoin, Altcoin season? - Cointribune EN",
        "content": "Fri 08 Dec 2023 ▪ 4 min read ▪ by Evans S.\n\nBitcoin has long played the role of the undisputed leader, paving the way for its crypto brethren. But, as in any good epic tale, a challenger arises: Ethereum. As we approach the end of 2023, we might be witnessing the dawn of a new era, where the altcoin is no longer content to follow but aims to compete. Is it the season of altcoins? In this financial ballet, Ethereum sketches a daring dance to catch up with the Bitcoin giant. Let’s analyze this captivating plot together.\n\nCrypto ETH: The Phoenix of Altcoins?\n\nYesterday, a remarkable event occurred: Ethereum’s cryptocurrency reached a new annual high of $2,312, demonstrating resilience worthy of a phoenix.\n\nWith a 10.28% progression in one week, Ether is no longer the timid younger sibling following in its elder’s footsteps. Against a still-dominating Bitcoin, this crypto seems to whisper a promise: “Nothing is played out yet.” This meteoric rise, although impressive, asks a burning question: how high can Ether go in this frenzied race?\n\nETH, like a maestro, has masterfully directed its dance around a graphical triangle, signaling a bullish target of $2,780. This geometric figure is not just a crypto trader’s whim; it is a strategy, a meticulously planned plot.\n\nThe Ichimoku indicators, with their colorful curves, seem to play a harmonious melody, supporting this ascent. But beware, every story has its twists. If ETH falls below its protective cloud, this dream of $2,780 may vanish, reminding us that falls are always possible.\n\nETH: The New Hero?\n\nSo, are we witnessing the emergence of a new hero in this crypto saga? Ethereum, with its current configuration, seems to have all the trumps to hit its target. But in this world where caution is queen, keep in mind that the cryptocurrency market is as unpredictable as a stormy ocean.\n\nThe question remains: Can Ethereum, strengthened by its ascent, truly reach $2,780 before the end of the year, and in this odyssey, can it redefine the rules of the game established by Bitcoin?\n\nIn conclusion, Ethereum’s rise is more than just a market fluctuation; it is a true digital odyssey, redefining the dynamics of power in the world of cryptocurrency. While Bitcoin continues to dominate, Ether, with its recent performance, prompts deep reflection on the future of altcoins. Is it a mere resurgence, or are we witnessing the dawn of an era where altcoins, led by Ethereum, play a leading role? The future, albeit encrypted, looks thrilling. In a world where surprise is the only constant, one thing is certain: the crypto realm will continue to mesmerize, astonish, and perhaps, overturn established titans.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxQSTdCdllnWUE0d290OVM5R0RDUmhHLWhvMVNqSWtRM3NYSHVEVjdQbU5sbEY4Nm51dUNrQWxBRnNPUkxqNWZsSFMtaVlGeTB2anp1UTU3NUJRRGdxbXJMU01tZEF5Vk1lMFBCcmV6YXZqbDZIR3FuM0ZpZFl2dGhWbktWQUXSAYwBQVVfeXFMTm9MM0plUjVTQjNLbWp4b0JtQWx0bmtQMWxqZTRjMC1lZDRTa2NKZU4tZ3ViSFFSWk9uVDdYa0dBV1E5VUloMk5MYjVKcjRzRUxUcnB0SWQ1VzVmS3B0QldEUXctRTYwTkprV0RCbnIteV9ZaUtXRDlGY2l4TTlUWnM1MEdiM1FyODZoM28?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Layer-2 Starknet Reveals STRK Token Airdrop - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe airdrops keep coming.\n\nThe team behind Starknet, a layer-2 Ethereum scaling network, plans to allocate over 1.8 billion STRK tokens to community members and stakeholders, according to an announcement made Friday by the Starknet Foundation.\n\nThe Starknet Foundation did not give a timeline for the airdrops, stating only that the first phase of the giveaway will begin “soon.”\n\nSome 900 million STRK tokens have been allocated to “reward past and future contributions by users and community members.” What exact criteria will dictate which Starknet users will receive those tokens, and how many, has not yet been announced.\n\nAD\n\nAD\n\nNow that the news is out, we might as well tell you more! Starknet is about each of you. Every user, builder and member of our community – existing and future – is a critical piece to building our network into the future of decentralisation for generations to come. The success… — Starknet Foundation (@StarknetFndn) December 8, 2023\n\nA further 900 million STRK will go towards user rebates, the Starknet Foundation said. Planning for that initiative is still underway, but it appears it will recoup the cost of some amount of network transaction fees for Starknet users.\n\nBeyond those 1.8 billion tokens, the blockchain’s overseers also intend to distribute an additional 50 million STRK tokens to incentivize decentralized finance (DeFi) activity on Starknet. These tokens will be directly, indirectly, and retroactively distributed to Starknet DeFi users, according to the Starknet Foundation.\n\nStarknet community members were quick to celebrate the announcement, hailing it as a major boon for the blockchain.\n\nAD\n\nAD\n\n$Stark is about the community, 1.8B tokens for the community, 50M token for Defi chads.. multipliers incoming..! — BMS (@bloomstarbms) December 8, 2023\n\nAnd they have good reason to be in high spirits: similar airdrops made by other blockchain projects have flooded crypto users with hundreds of millions of dollars worth of free tokens in recent weeks.\n\nOn Thursday, a similar airdrop by Solana-based DeFi platform Jito put $225 million worth of freshly minted JTO tokens in the hands of users and community members. Late last month, an airdrop for DeFi oracles network Pyth gave away $77 million worth of PYTH tokens.\n\nAirdrops have become an increasingly popular way for crypto projects—and recently, DeFi projects in particular—to attract a larger user base and encourage loyalty among existing community members.\n\nStarknet, which uses zero-knowledge rollups to make on-chain Ethereum transactions faster and cheaper, has already seen tremendous growth this year. This spring, the network’s total value locked (TVL) increased ten-fold, from $1.45 million to over $10 million. Since then Starknet’s TVL has tripled again, to $33.84 million at writing, according to DeFi Llama.\n\nEdited by Andrew Hayward"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxNaEtxcEV1MzVpcmMxcm5IOGtSaFk2YXhmTU45RVBoZ3dmTGFmZ29HNHNEUDlOUUVWQ2M3dlFTVDZpWmROaWdhU0dYNEZnV2JvVWgtSWdGSHhhdURtNElHSkNpUllBZVJadU9RMkJGX3pTcHN0ZWVReGpjdG5xZFpLVUJlQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Dec 2023 08:00:00 GMT",
        "title": "Ethereum developers set roadmap for an eventful 2024 - CryptoSlate",
        "content": "Ethereum (ETH) developers have outlined a comprehensive plan for the network’s development in 2024, including significant upgrades and new proposals after their latest execution layer meeting on Dec. 8.\n\nA key focus is on the deprecation of the Goerli testnet, with a fork scheduled for early 2024. This move is part of the strategy to activate ‘Dencun’ on the Ethereum network in January, marking a significant advancement in its technological capabilities.\n\nDencun Activation\n\nThe Dencun upgrade will introduce a novel concept in transaction processing termed ‘blob-carrying transactions.’ In this context, ‘blobs’ is an acronym for ‘Binary Large Objects’. The primary purpose of these blobs is to refine the way Ethereum stores and retrieves data by reducing the amount of data that must be stored indefinitely on the Ethereum blockchain.\n\nConsequently, the transaction costs associated with data storage are expected to decrease, making overall transactions more economical. It is a critical step toward the long-term goal of danksharding, a planned scaling solution that breaks the network into smaller, parallel segments (shards) to increase capacity and efficiency.\n\nAnother notable development is the introduction of a new proposal aimed at enhancing the power of Execution Layer (EL) clients. The proposal, designed to counteract potential censorship in the mempool, would enable EL clients to override local builders using various heuristics.\n\nFor instance, clients could override when detecting transactions with excessively high fees pending for extended periods. However, adopting such heuristics has not yet been implemented broadly, with only Geth currently having an open pull request on the issue.\n\nIn terms of process updates, the development of a Meta Ethereum Improvement Proposal (EIP) for Dencun has been a significant milestone. This is complemented by a draft for a “Meta EIP backfill,” which aims to provide specifications for upgrades previously lacking Meta EIPs.\n\nThe discussion around Meta EIPs has been vital in simplifying access to fork specifications, although there is an ongoing conversation about their role and naming conventions, according to ETH developer Tim Beiko.\n\nPrague/Electra upgrade\n\nLooking forward, the Ethereum community is preparing for the Prague/Electra network upgrade. Among the proposals for this upgrade is EIP-6110, which proposes a new method for supplying validator deposits on-chain, replacing the older Eth1 bridge system.\n\nFuture upgrades may also include Verkle Tries on the Execution Layer and Data Availability Sampling (DAS) on the Consensus Layer, necessitating in-depth technical reviews and discussions.\n\nThe Ethereum community is encouraged to take an active role in shaping the future of the network by participating in these technical discussions and expressing their preferences for potential features in the upcoming upgrades through forums and GitHub threads.\n\nClient teams are set to review these proposals, with more detailed discussions planned for January. This planning forms part of the broader strategic development of the Ethereum network, reflecting the continuous efforts by the developer community to evolve and refine the platform.\n\nThe Ethereum developer community remains actively engaged in enhancing the network’s capabilities, with a clear roadmap set for 2024. The upcoming developments and proposals highlight the network’s ongoing commitment to innovation and responsiveness to community feedback."
    }
]