[
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxNSEY0RTNJMFJFV0I1bkxLcVFKVnBLWm01RnptSDljV3pQTExjbkVIUlVGZUlpMjBEc3oxWWJlN1h1aXI0Rm9jUGNoc05CTzlwVHg5aGUzQVRLWm9RV3NJNHZoWk9ZUXl1bnh1bWtITUVKUmEzLTFqRGMySXgxNEVURlN0Qjd0N1VoQm1Ya1BzWVU2SndBU0c1NlRaTVE2TWJ6amFjbUgwYW5SS2dzdGlhMjlyZGhpQ1ZfaF80ZFBpUlpQLTFsSzgw0gHMAUFVX3lxTE5jVmRQQncyOTZJc3NtZXdRR1Zrcm80a21oZjVmV2pjc04yYVZWYVVkZmNqTHhWQm9PbE5BWHpYX0lfU2R1c2dGdi1uV2tncUpNejFYU3YzcnNlVWJJZk51VUxtNDJLSEJtUVphUWF6N0VGTmNpT2Zpc2NSaFFEUVRLRG91WmJqeHVaQXk5RFdWdGpIb25VeDNETEozejg4TE0yRG9GR3lIQU44S29CSkdTaFNwYmRBaE5Ldjg4WTZNWHBEdGlXUHhuWmF3Ug?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "Fidelity Wants to Create an Ether ETF, Joining BlackRock in Doubling Down on Crypto - CoinDesk",
        "content": "Fidelity Wants to Create an Ether ETF, Joining BlackRock in Doubling Down on Crypto\n\nFidelity, BlackRock and other financial firms want to list BTC and ETH ETFs, which could make it easier for investors to invest in crypto.\n\nBy Nick Baker Nov 17, 2023 at 10:46 p.m. UTC\n\nElection 2024 coverage presented by Stand with crypto"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTFBsa29EWG1CUHJiZmtvWW9naVJHNExBWXlXV25XR1ZWc1lvVHgxTlR3VXF4U1NsM2hZN1hRRnB4bWhBaEpMdjJONHJlcEFjbUZHcW1XVXhteHU4NXBuM1ljS0JKU0JQSDBRd1g0ZDhhdFhsT0RpdHNJ0gF_QVVfeXFMTnBtaUdvTjJvcktUcnVwSE00bEx5RGdNVGxIVUxSMTlUMzB5ZEdUX1ZWTTk1SEFZZ2ZEcTR3MlJBYVpZeGJLaVdQNDF3cUUzeHJ5TGd4T0wzU0x1ZXRRVDQySFYyU2RaOFVLWHRhdmxUYlJSWEIzZHJrSjBzTFZZYw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "DOGE Go Up: Ethereum and Solana Hit Hard By Sell-Off—But Dogecoin Makes Gains - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe crypto market took a hit Friday morning Eastern Time, with all major digital assets except for Dogecoin (DOGE) down significantly. Ethereum (ETF), XRP, and Solana (SOL) have all seen significant losses in the past day.\n\nAt the time of writing, the original meme coin was trading for $0.08, a 4% increase over the past 24-hour period. And over the week, the asset, which was once Elon Musk's favorite cryptocurrency, has gained more than 10% in value, according to CoinGecko.\n\nIn the past day, $2.7 billion worth of DOGE has changed hands. The only times the meme coin's volume has been higher in 2023 were around the time that Musk changed the Twitter logo to a Shiba Inu in April and a Dogecoin developer teased at a new development in February.\n\nAs of 9.30am ET, it the best-performing top digital currency, CoinGecko data shows.\n\nAD\n\nAD\n\nElsewhere, though, major assets were hit by a sell-off. ETH lost its $2,000 per coin level it hit last week. As of this writing, it has shed more than 4% of its value and was trading for $1,941.\n\nBitcoin, the biggest digital asset by market cap, was still trading above $36,000—only slightly—but had taken a 2% 24-hour hit.\n\nIn the past day, Bitcoin's dominance slid slightly to 51%, impacting overall market sentiment​​. Stablecoins dominated the trading volume in the past 24 hours, accounting for 89% of the total crypto market's trading volume​​.\n\nAnd SOL, which had been on a big run, was down over 9%, trading hands for $56.82 per coin.\n\nAD\n\nAD\n\nXRP was also a big loser—having lost over 5% in the past day, the asset was trading for $0.59 Friday morning.\n\nAnd Avalanche (AVAX), which yesterday surged on news that banking giant J.P. Morgan used the blockchain to tokenize portfolios, lost more than 10% of its value. It was trading for $20.97 by the time this story was published.\n\nEdited by Stacy Elliott."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE9ZUHV0OUdjQmJSR2FGU3hJeVVGZE5qVmhGd0UxalZUWjh3V3lzTFIwdU4yX0pSSElXakVuZnZYSUdOUXRjczc1T0VpVzhxRVNsakZLaW9tMWRkV1NVcHFwcGZ1aG90bFlLRURDTi1UTHA3MXB6VDVNa3N30gF_QVVfeXFMTi0xNFZ0RDNxdzlRV0lnbVQxdmgzejE0ZmhCdFpubUJKOWRoR0xQaU4ycEdjSGxfTFdBQ0VZSzVxVU9ybGpDbi1TVFFJMmZTSHBSelF3WmxlRlo1bVBqNzU2MzN4b0dZbEhxUzdQYi1kYURMT3lLNUdVSjh5UWExbw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Surpasses Ethereum in Fees First Time in Years - U.Today",
        "content": "Advertisement\n\nBitcoin has reclaimed its position as the leader in daily cryptocurrency transaction fees, surpassing Ethereum for the first time in three years. According to the most recent data, Bitcoin's daily fees reached $11.63 million. For comparison, Ethereum recorded only $8.44 million over the same period of time.\n\nTaking Ethereum's crown\n\nThree years ago, Ethereum surpassed Bitcoin in terms of transaction fees, a development attributed to its versatile blockchain platform, which enabled a diverse range of decentralized applications (dApps).\n\nThis versatility attracted significant user activity, particularly in the burgeoning field of decentralized finance (DeFi) and non-fungible tokens (NFTs), leading to higher transaction fees on the Ethereum network.\n\nAdvertisement\n\nThis period of dominance positioned Ethereum as a multifaceted platform compared to Bitcoin, which primarily functions as a digital currency.\n\nGame-changer?\n\nRecently, Bitcoin has experienced a sharp increase in average transaction fees. Starting from the beginning of November, fees have escalated significantly, with the fee on Nov. 16 reaching $18.69 per transaction. This surge represents a nearly 1,000% increase from the fee recorded on Nov. 1.\n\nSome experts view this rise in transaction fees as a positive development. They argue that higher fees contribute to the sustainability of the Bitcoin network, especially in the context of diminishing block rewards for miners.\n\nThe recent increase in Bitcoin's transaction fees comes at a critical time for Bitcoin miners, who have faced one of their least profitable years.\n\nThe upcoming Bitcoin halving, scheduled for next spring, will further reduce the block subsidy from 6.25 BTC to 3.125 BTC. In this scenario, higher transaction fees could become a more significant portion of miners' revenue, potentially accounting for 20%-30% of the block reward.\n\nThis shift toward fee revenue is seen as crucial for the long-term sustainability of Bitcoin's mining and transaction verification process.\n\nIt should be noted that Bitcoin's Ordinals inscriptions are now outperforming Ethereum in NFT sales."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE8wZ0ZHYzM4VGdtZlVoOUVQY0lvaW1MaGNiR2E3RG5jbkozU2FVOWxQYWVtMHZ0dmt5cG9BVDQ0cW9CN3p1SnRKUk4zY3J3UndUMThmcmZoWDkxUXZCX010c0drcFQyNFY5M2F1UkpINXNhdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 17:14:10 GMT",
        "title": "Nocturne brings private accounts to Ethereum - Blockworks",
        "content": "Nocturne, a protocol that enables private accounts on Ethereum, has launched its first version on mainnet.\n\nThe protocol is designed so that users are able to deposit or receive funds privately on what Vitalik Buterin calls stealth addresses.\n\nThis means that users can generate a secret spending and viewing key, which can then be used to create multiple meta-addresses that can be used to interact with other accounts.\n\nThese addresses are held within Nocturne smart contracts and are intended to be used to trade what the company refers to as ‘hot assets,’ or crypto assets that are not designed to be held.\n\nAccording to Nocturne, its smart accounts will be compatible with DeFi protocols that “represent state via output tokens.” This means that it will only be compatible with tokens that are made valuable from a previous input — or tokens where a user must deposit collateral in order to mint the token.\n\nSuch tokens could include Uniswap liquidity tokens, Aave’s aTokens, and Compound’s cTokens.\n\nThere are plans to later extend smart account compatibility to arbitrary protocols with the help of zero-knowledge technology, which can prove ownership of assets without revealing the details of the assets owned themselves, Nocturne notes.\n\nLuke Tchang, CEO and co-founder of Nocturne, noted in a press release reviewed by Blockworks that the company is moving away from simply being a ‘privacy tool.’\n\n“Privacy should be embedded at the account layer and the v1 launch is the first step in making this possible,” Tchang said. “Our goal is to ensure that everyone, from individual users to large institutions, can transact securely without exposing their financial history to the world.”\n\nUsers who wish to access Nocturne v1 can do so through a private vault user interface. The current capabilities of the interface are limited to deposits, transfer of tokens to burner addresses, and private swapping and staking, the company said.\n\nFuture versions of the protocol include the migration of a ‘proof-of-innocence’ protocol that can prove transactions are verified without revealing any information about the user’s identity and further usability and functionality of Nocturne wallets by enabling compatibility with arbitrary smart contracts.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMi9gFBVV95cUxOSTBfX1ZwWTdYdjVyYU5XNEdOVGEweGl6c0Z3bm5pdWFlVVFybENqVEgzeGVnSVhhLVd5SzhZT0VRSWRDengtWXAyX3lQZjc4WEp2V1FsZ0R6Q0NZVDFlZjdvb0h4dXg2amgxa2tqZjM5TUFJUWpCUU1IbC1LVXhZWE5fVEg1ZmRsR3RMYkFxT3pUbl9rdnNmYUVLMG40N3VLTThseDhHbmVtajhDaldBRUsxandZc2NmOWJYdVBtUHRYV3JxYXBxWFVubi05RzJLdmtCcmZPblhRR19RWjY3dG1ubnJIZ2ZnVEgwdlZ2S2ZSLWV4SEHSAfsBQVVfeXFMUGdCTXdYRC0temNCei1iY3hHM1B6MVJldjNzZWc5ZHlVc0stLWxBcENGZ0tncFJtMFdsNnNBNHlkQWhMTTY1ZENuaHc0RnBmNXpiUFNMU0dOblVWak9YQW5vWTZPZEg5QkVMdVUwVHZNMlZPXzBwMzR4amhxSHhyT25neTRJX0g4dlZDOFhxcGU3VHh1TXU0azhfc0hHeEpDVUc4bFZOUktnYkNwNjdqWm90YXpkMG1HNnVwSm5DVGlzTWRlR19oV21iSTJ3c21LbDZkcldDN0xjUFVDRjFWWmhJcWVGMGs4VEs2OXg4UE85T1UxWUl3M2hHQnM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: BTC stagnates sub-$36,500 as SEC’s eight-day window closes - FXStreet",
        "content": "Bitcoin price remains under the $36,500 level as the absence of momentum leaves BTC susceptible to a slump.\n\nEthereum price risks at least 5% slump to the $1,864 level if it loses critical support at $1,935.\n\nRipple price risks a 10% drop to the late October lows if the support at $0.5981 gives way.\n\nBitcoin (BTC) price remains steadfast below the $36,500 level as the US Securities and Exchange Commission (SEC) misses its target. Nevertheless, a new development concerning the sane has equally not done anything for BTC, with ETF specialist Erica Balchunas saying the financial regulator wants ETFs to do cash creats.\n\nMeanwhile, both Ethereum (ETH) and Ripple (XRP) are losing ground as profit taking escalates.\n\nAlso Read: SEC allegedly wants spot Bitcoin ETFs to do cash creates, not crypto, after possible meet-up with exchanges\n\nBitcoin price likely to drop\n\nBitcoin (BTC) price remains trapped under the $36,500 level as hope for a spot BTC ETF approval in 2023 wears thin. All indicators show that momentum is waning due to multiple sell-signals in play. This leaves the king of cryptocurrency susceptible to a fall.\n\nUnless sidelined investors enter the fold, Bitcoin price could lose the support offered by the ascending trendline at $35,410. The ensuing selling pressure would then likely plunge BTC to $34,000.\n\nFurther, south, the slump could see Bitcoin price extend below the $32,000 mark before a test of the bullish breaker extending from $30,126 to $31,524. A break and close below the midline of this order block at $30,824 is likely to send BTC to the forecasted $30,000 psychological level.\n\nBTC/USDT 1-day chart\n\nOn the other hand, increased buying pressure could see Bitcoin price confirm its move north above the supply zone extending from $36,276 to $37,301 by decisively closing above the $36,788 level. Past this level, the likely move would be to clear the $37,972 barrier before an extension to the $40,000 psychological level.\n\nAlso Read: Bitcoin price hit $38,000 despite US financial regulator’s decision to delay two BTC ETF decisions\n\nEthereum price losing $1,935 support will be detrimental to ETH holders\n\nEthereum (ETH) price is testing the critical support at $1,935, and losing this level could send the largest altcoin by trading volume to the depths of $1,864, 5% below current levels.\n\nIn a more dire case, the fall could extend toward the $1,800 psychological level with the next support level likely to present itself around the $1,753 mark.\n\nETH/USDT 1-day chart\n\nConversely, if the $1,935 mean threshold and ultimately the order block spanning from $1,864 to $2,004 holds as a support level, Ethereum price could pull north, restoring above the ascending trendline at $2,029.\n\nIn a highly bullish case, the gains could extend to the $2,136 range high, with such a move constituting a 10% climb above current levels.\n\nAlso Read: Ethereum is a commodity, but SEC will not admit it, expert says amid ongoing ETF race\n\nRipple price extends fall with 10% pullback possibly in the cards\n\nRipple (XRP) price could fall 10% below the $0.5981 support level to test the $0.5392 support, as the remittance token continues to extend its losses after breaking out of the symmetrical triangle.\n\nThe Relative Strength Index (RSI) shows momentum is falling as it nosedives south, mirrored by the Awesome Oscillator (AO), whose histogram bars are soaked in red and edging south. This adds credence to the bearish thesis.\n\nXRP/USDT 1-day chart\n\nOn the flip side, a re-entry by sidelined investors and late bloomers could see Ripple price correct, pulling north and potentially restoring above the lower boundary of the triangle at $0.6603. In a highly bullish case, the gains could extrapolate past the $0.0700 psychological level, balancing out the inefficiency represented by the Fair Value Gap (FVG) at $0.7512 with the potential to hit the $0.8000 psychological level.\n\nAlso Read: XRP price fails to show parity with Ripple’s important victory over SEC, 5% pullback seems likely"
    }
]