[
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMizgFBVV95cUxOdm9VVkZmRlFFLW5EUFItenlyNFk0ZFJHXzhJN3UxOHZaRFpFV25Dd2NDeG5BNjd6X253eWRsT3BqY09EbnNCS3I5U0J3QVdzVjc3SFd5Ql9KM2o0Nk1CZkRaTm1xVWNpaURtZ0RPYVphMkUxNGt0UFRHNzlOVjlXTjhBWXRmb2dib3hGbTV6SlVtbGp0QlpZQlh0RGJWeE9BdVRFZldKRTNHcEhaSE53T240U1E0WktlS2Q4aS10SHp2NFFoa1FrQUhSMWpDd9IB2wFBVV95cUxPQTY5amxFSGVxRzRtT2JVZVVSUk82YjItUGdpbEFJNDNlX3FiWmN2R2tGR3FVSnVaZ25PU3ljaDJqM2hlWFcxTm5OMFl6V0ROak5lME9PbU51dEpfaS1hbjdYZGJvMFBmall4eTc4bW1RcExDRkdEUkxTVk5lVUF1M2E5MXdSdTBtQk9yZl9RN2RIWFc5cldvUVFWS3NWODdfUXF0bENQaGVISW53d3E4MnhiNlRHM3lfSFF4TDlQallaQUoyRVcxZDlQcno1andkVmJ5ZTZoMmtVRnM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Dec 2023 08:00:00 GMT",
        "title": "Solana’s Ambitious $2,000 Price Target Could Flip Ethereum and Bitcoin - Analytics Insight",
        "content": "Solana is showing no signs of slowing down as it makes an ambitious move to reach $2,000 in the coming bull run. This will likely excite SOL holders and potentially challenge the crypto giants, Bitcoin and Ethereum. Today's post will discuss more on Solana's ambitious price target and how certain new coins, such as Bitcoin ETF token, Bitcoin Minetrix, and others, are poised to revolutionize the crypto market in the coming year. Without further ado, let's dive in!"
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPbml4cGhXcTRyWHd1SFdNd29mM090LUEwSUNGckZyTkMtLXJQV2QtYWlFanBZelV3Y0xnSGdXRzZCeENNeVBicENZd1JPYW5jODVBWkxqWFZhTGVvNFd0Y3NtelMzODZTT0ZoQW9KQ0ZBa0RodElrbWtYbVREaEppMnpjN3NMdUZVSXF3LUd3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Dec 2023 08:00:00 GMT",
        "title": "Protocol Village: COTI Layer-1 Blockchain to Become Ethereum Layer-2 Network - CoinDesk",
        "content": "Dec. 6: Beam, an open-source blockchain specialized for gaming and run by Merit Circle DAO, will now launch on Immutable zkEVM, a groundbreaking scaling solution powered by Polygon, according to the team: \"Beam is an ecosystem and a blockchain. We want to remain chain-agnostic. Where we started as a subnet on Avalanche, we don’t want to limit ourselves to the Avalanche ecosystem. Right now, we’re working with Immutable to launch some of our products on the zkEVM, and integrate that network into our products as well.\""
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxONGljMlRTWGpveHFaOVZMQnFBRkc3VlBuRG1EaUF5ZWt1eWVPYVhpd3lGOThmSEdTbXlreWUzVXM2VzhwV1dhZzZXbFRhSTFYdEtwWGNWRWlGNGg4aXZfNXB6Y3BVNFJxX1JHUjZYLVZ6VHBUUUZlMnoxUEd3QWJEZWVR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Dec 2023 08:00:00 GMT",
        "title": "Ethereum: $2.5B Worth of ETH Burned Since 2022 Merge - Watcher Guru",
        "content": "An analysis of Ethereum’s financial information has shown that an astronomical $2.5 billion worth of ETH has been burned since the Merge Event in September of 2022. Indeed, Ultrasound Money shows that the supply of Ethereum is at an 18-month low, currently standing at 309,663 ETH.\n\nThe development shows a clear contrast to the inflation that Ethereum had previously observed. Indeed, the asset has now shown a deflationary shift due to the 1,195,238 ETH that has been burned. Moreover, that permanent reduction in supply will have a long-term positive impact on the asset’s value.\n\nSource: Investopedia\n\nAlso Read: Will Ethereum Flip Bitcoin in 2024? VanEck Weighs In\n\nEthereum Supply Drops by 1 Million ETH Since Merge\n\nThroughout the entire history of the digital asset sector, Bitcoin has reigned supreme. However, the rising prominence of Ethereum has caused it to be the only true competitor within the space. Moreover, the landmark merge event had been a massive moment in the increased prominence of the asset. Now, the fruits of that development are starting to take shape.\n\nSpecifically, recent observation has shown that Ethereum is $2.5 billion worth of ETH burned since that merge event in 2022. Altogether, the event has caused a net decrease in overall supply. That decrease has still been present despite the issuance of $1.86 billion worth of the digital asset.\n\nSource: Bitcoinist\n\nAlso Read: Ethereum Whale Makes $78 Million Profit After Investing $11 Million\n\nCurrently, Ethereum’s total supply is at its lowest point since that Merge event, with 120,211,380 ETH. Moreover, that supply equates to a market cap for the asset that is still north of $266 billion. Subsequently, it further reiterates the place Ethereum holds in the greater digital asset market.\n\nThe effects of that very Merge event are already being felt, but still have longstanding positives to be uncovered down the line. The decrease in supply will have a massive impact on the token’s scarcity. Therefore, it will only grow in value overtime, and potentially ascend to previuoly unkown heights."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPaEZmUk5NMnJrU1BlQ243X2FLbWU1Z1FtZGxkSGNWMThRMEZfaklldmRnZHZpenpEeWcwM3Y2czFVQ3duc0p2SHpidVF6dVQtN3F5Y0NLTGhYaG5pLWMwTVZHUUVFSk9iSDlBVV9qWUk1NjV2U1prRlRmVFNwQm5vWkVlcUtRSEVp0gGOAUFVX3lxTE5WSnRHVlFMRmEzOFB2cGdRNnd5WlM0Sm5qb3N2Vk11YnItc2cwc3Z0UlF5bjk4UUphYnBOX0s0V0RvX2Z4bWt0NXB1dDhFQ0JFclJNN05Fc2FZZmg4UVNyUXk5MHVRLW93Y2V4bnU5Qzl6RXU2M0RsbVNreVdVa2lnZHdEakR5ek1yamliaGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Dec 2023 08:00:00 GMT",
        "title": "COTI to Launch Privacy-Centric Ethereum Layer-2 Network - CryptoPotato",
        "content": "Web3 digital infrastructure provider COTI announced plans to launch a layer-2 chain on the Ethereum network that will be focused on adding a privacy layer to its products and services.\n\nAccording to a statement seen by CryptoPotato, the new protocol, COTI V2, will use a cryptographic technology called Garbled Circuits to enhance privacy while ensuring high speed and scalability.\n\nCOTI Unveils Privacy L2 Network\n\nCOTI claims Garbled Circuits is ten times more efficient than the Zero-Knowledge protocol, a method used by several layer-2 blockchains on the Ethereum network. COTI’s new protocol will utilize Ethereum’s pre-existing liquidity and security while implementing robust privacy protection for the ecosystem.\n\nThe launch of COTI’s new protocol is driven by the lack of privacy and confidentiality on all layers of the public blockchain. The digital infrastructure provider believes the current state of the blockchain ecosystem gives malicious actors enough room to operate and that only strong privacy-centric architecture can protect the Web3 community.\n\nBesides ensuring privacy protection, COTI intends to focus on building areas that are “woefully lacking” in Web3. The protocol’s first challenge would be resolving users’ ability to use the blockchain in complete privacy. COTI V2 will implement cryptography, enabling users to execute transactions without exposing their payment histories, wallet values/addresses, or other sensitive information.\n\nDeveloping a Complaint Ecosystem\n\nCOTI believes that focusing on anonymity to create privacy causes regulatory issues, which is ineffective in developing a complaint ecosystem. The new protocol will ensure transparency while protecting information that could harm users and the growth of web3.\n\nShahaf Bar-Geffen, CEO of COTI, said: “Sensitive data transmitted as public information on a blockchain is a bug, not a feature. This isn’t tolerated in legacy business systems, so why should it be tolerated on-chain? COTI V2 will solve for this, preventing sensitive data from being broadcast to competitors, partners, and clients.”\n\nThe digital infrastructure firm has scheduled the COTI V2 devnet release for the second quarter of 2024, after which the testnet and mainnet launch will follow. The company expects the launch to unlock countless new use cases in the industry and, in turn, trigger an immediate surge in web3 development."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxNSWdCWTVSd2lDQnhmX0tSRktPcWp1c3U4QXlseGYyUDdRLWFmZDJIdHVEOEl6WkFiNEhKbVFsWF9iTE1rLTVoUk42dldoZ19iUmJKdzBMWHRKU3RHd2ZWV0tnSkdyd2tRVU53STZQLUpCM0xqVExuTU16LTBLVC16ckM0bF8taU1YWG9QVXQyME5LNmdWdTUtdHR6SHFlWlctcXktNlBXMGdITE5aeUZnb0ZNZS1TWTFPNm9UdWRsTUNQOE1wdDVCWF9yb1dwLUx6Q05JX9IB2gFBVV95cUxOOVE0QzFsOXhIaGRZc0FpNm1FcV9zMDBOX2VhbHBnUDBCSHdiMFBod0loaWtycl9tZktuaXI1cVNvVDR0QUJPbmlROFppOE5ORFlFY3hUbEh1RzVRaUJxX2FlUHRvbWE2RlhQQWNGZUhka1JCWmNKTVhnejVialltbW1yMC1OX3VhWUExSVhIYmlDQTdYY0szcHNneDJGcXVHMzZHdTViRGN2RExJc0piUVBZSTN3UEJtbl82enlPYmxTTVVyTVI2OGkxOTA2eURaQ0lXYk9XYW1LQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Dec 2023 08:00:00 GMT",
        "title": "Ethereum dips to crucial demand zone, analysts predict ETH price rally to $3,000 - FXStreet",
        "content": "Ethereum price dropped close to the $2,100 level early on Wednesday, entering a crucial demand zone.\n\nOver 5.58 million wallet addresses hold nearly 40 million Ethereum tokens in the demand zone.\n\nAnalysts have predicted an ETH price rally to $3,000 since Ethereum’s breakout past the $2,000 level.\n\nEthereum (ETH), the second-largest cryptocurrency by market capitalization, declined to $2,148 early on Wednesday. The fall in prices follows a broader sell-off in the crypto market since Monday, likely driven by investors’ de-risking strategy ahead of a macro-packed week, with US Consumer Price Index (CPI) data for November and the US Federal Reserve (Fed) last meeting of the year.\n\nEthereum price has entered a critical demand zone, according to on-chain metrics, in which market catalysts could help determine where ETH is headed next.\n\nAlso read: XRP price drop to $0.55 likely amidst Senator Elizabeth Warren’s final push in US crypto legislation\n\nEthereum price reaches demand zone\n\nBased on data from crypto intelligence tracker IntoTheBlock, Ethereum price has dipped into a demand zone considered crucial for the altcoin. The price range between $1,934 and $2,160 is key for Ethereum price as this is a range where 5.58 million wallet addresses accumulated nearly 40 million ETH tokens.\n\nThis makes the demand zone a critical support for ETH. According to Ali Martinez, a crypto analyst on X (formerly Twitter), this makes it an ideal reloading point for traders looking to add more Ethereum to their portfolio before the altcoin’s price rallies.\n\nGlobal In/Out of the Money ETH. Source: IntoTheBlock\n\nEthereum price eyes $3,000 target\n\nSeveral crypto analysts on X said Ethereum is primed for a rally. Since ETH price tested and broke out of the psychological barrier at $2,000, these analysts say the altcoin is ready to target the $3,000 level.\n\nCrypto analyst behind the X handle @CryptoJelleNL argues ETH is ready to rally to $3,000 in the ongoing cycle.\n\nETH/USDT 1-week chart. Source: @CryptoJelleNL.\n\nAnother crypto analyst, Altcoin Sherpa (@AltcoinSherpa), agrees with @CryptoJelleNL’s thesis and notes that Ethereum is likely “one of the easiest trades.” Sherpa notes that after ETH consolidated under the $2,000 level for nearly two years, the altcoin is finally out of the range and ready to catch up to the $3,000 mark in the coming months.\n\n$ETH: I still think that #Ethereum is 1 of the easiest trades you can take. It consolidated under the 2kish mark for almost 2 years and finally out of that range.\n\n\n\nThis is going to catch up for sure and I think that ETHUSD goes to $3k in the coming months. pic.twitter.com/ddX8l2s5Ux — Altcoin Sherpa (@AltcoinSherpa) December 12, 2023\n\nIn its predicted run up to the $3,000 mark, Ethereum price is likely to face resistance in the range between $2,160 and $2,247, where 1.04 million wallet addresses bought 5.49 million ETH tokens, according to IntoTheBlock data. A break past $2,247 is key to validating the bullish thesis for ETH.\n\nAt the time of writing, Ethereum price is $2,171.38 on Binance. The altcoin is trading sideways close to the $2,100 level, after yielding nearly 5% weekly losses for holders."
    }
]