[
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE9ib1VFamxQNEZGdjF2V3BTOHdMYno5N0prYzJTbmRSZ01XZV9BazZSdnRzUjRJbjExd2lWQU11UlpCZWg0SFptY2xhclFaX3JWZ1c5TEp4U0ZZendDSDlST1Bna25HQlNwVFdka28tN0kzYXl6cy1tR2VFTnNPZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "SEC Acknowledges Ethereum ETF Filing by Fidelity - Crypto Briefing",
        "content": "SEC is evaluating a proposed Ethereum ETF from the $4.5 trillion money manager.\n\nShare this article\n\nThe US Securities and Exchange Commission (SEC) has acknowledged receipt of an application by asset management giant Fidelity to list a spot Ethereum exchange-traded fund (ETF), according to today’s SEC filing.\n\nThe filing from Cboe BZX Exchange proposes listing and trading shares of the Fidelity Ethereum Fund, structured as a commodity-based trust that would hold ether. The trust aims to track the performance of the Fidelity Ethereum Index, less expenses and liabilities.\n\nHas been long known that Fidelity entered the spot ETF race but this filing *essentially* starts the ~240+ day clock for their spot #Ethereum ETF. Just another step in the process. Will have definitive deadline dates in the coming weeks https://t.co/0C6NKcxNNz pic.twitter.com/gdW9ZQDgs9 — James Seyffart (@JSeyff) November 30, 2023\n\nThe SEC has several Ethereum ETF applications under review that it must approve or deny, including filings by major financial firms BlackRock, ARK Invest, VanEck, Hashdex, Invesco, and Galaxy Digital Holdings.\n\nFidelity Digital Assets Services would serve as the regulated custodian for the trust’s ETH holdings. The filing argues that the CME Ether futures market is of significant size for surveillance-sharing purposes to meet SEC listing standards that aim to prevent fraud and manipulation.\n\nThe SEC has yet to approve a spot Bitcoin or ETH ETF in the US. However, the agency is reportedly preparing to allow simultaneous listings of spot-based Bitcoin ETFs in January. The Fidelity filing aims to make the case that an ether spot ETF should also receive approval.\n\nThe proposal starts a 45-day clock for the SEC to approve, deny, or extend the deadline. The SEC is now seeking public comments on the proposed rule change to list the Fidelity Ethereum Fund ETF.\n\nETH is trading flat -0.1% over the last 24 hours, according to Coingecko."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxQZl9FdnFRYXBENjJibTE0cnZtUW15NXU3aUo5eml2TmJCX0V2UFFZeUloM0hHMWtycGtvRTFTUXBvMlUyeTVnX01qVDE0UDcxa0xoVmg5Y3JVNDUwVVduN2h3VTlrbVZkVFRtRU9YYUtjR0NOeGhEcEFuSU43Tl95YmNhc1BQUl9BMjBTX0pB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "SEC opens comment period for Fidelity’s proposed Ethereum ETF - CryptoSlate",
        "content": "The U.S. Securities and Exchange Commission (SEC) began to accept comments on Fidelity’s proposed spot Ethereum ETF through a Nov. 30 filing.\n\nThat filing indicates that the securities agency is now soliciting comments on a proposed rule change from Cboe BZX. If approved, that rule change will allow the exchange to list and trade Fidelity’s Ethereum Fund shares.\n\nThe SEC’s request for comments resembles similar filings regarding other spot crypto ETF proposals. It asks for comments about surveillance, custodianship, and market manipulation, among other matters. Notably, the filing highlights a surveillance sharing agreement that Coinbase and Cboe BZX established in June, a critical component also found in many other pending spot crypto ETF proposals.\n\nThe filing also acknowledges a lack of existing U.S.-regulated and U.S. exchange-traded investments that provide exposure to ETH, whereas European markets already offer regulated investments that provide exposure to spot crypto assets.\n\nDecision likely by March 2024\n\nThe filing sets a timeline for the SEC to approve, disapprove, or start proceedings to determine whether to disapprove the proposed rule change. These comments are considered in the final decision-making process. The SEC is required to reach a decision within 45 days of the current notice’s publication in the federal register; however, the SEC can extend the decision period by up to 90 days and then further by 60 days if necessary.\n\nThough exact deadlines may differ, Bloomberg ETF analyst James Seyffart estimated that the SEC’s next decision deadline for Fidelity will be Jan. 21, 2024, and its final decision will be March 8, 2024. He added that he will have knowledge of “definitive deadlines in the coming weeks.”\n\nFidelity initially filed for its spot Ethereum ETF on Nov. 17, days after its competitor BlackRock filed for an equivalent fund on Nov. 15. Both firms also filed for spot Bitcoin ETFs this summer starting in mid-June.\n\nSeveral other asset managers, including Ark Invest, VanEck, and Grayscale, also have pending spot crypto ETF proposals.\n\nMentioned in this article"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxOeWxYT1BEb0ZnTGV5Q2J4MzdLNXUwZHpFWWc4NDNyZ3ZReVNST2dvS3lqSHZlMVh5UzVsSngxSHZrUlZ5OGtMaUhHa3BQZkQtUjRudHh0N29oR3JKUVA0X1c4U0lldFk2UkhOMkNrX3Roa0NZMTRjNU1BUF9tSHI0cTczVTREaGM4UzNTSGJGQ2hITXNE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Ethereum (ETH) Price Outperformed Bitcoin in November –Will it Happen Again? - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxQUmp0U1l5UmNrLUM1U2hZMWt1SjJGc1pmZm9wSWhMYVhmV29HeU1jQklTSGh0N3NCWThmMUM3NzJ4aTJabjd3dVJqck9NcDZOMFZUU1lQMm9GelBvTEk3cDhOaUNrc2RyQmhrMWVXWUYtSURUYzhvUlVnUjVnQW04OFU0Y29sSXlWcEFF0gGQAUFVX3lxTE1mZ211SkkyTlVXM0g2TFFYU1dHOTcyVmRHMW5xblgtRWpYQUJpS0ZfNHhEZnU4LTlCNmhzZHJTRmZ5R3N0bWZVZ3U1X19pSllZVld1elRTWm9yaVZ3VFhkcGJiVHc3bXIyOEMwdzBrVjdCS3BjYkhjZlJYN2xiNExjcWU3SF9fSTAyZWdxX2lBUA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Legendary Trader Raoul Pal Makes Rare Ethereum vs. Solana Comparison - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nLegendary crypto trader and investor Raoul Pal has waded into the supremacy debate between the two prominent proof-of-stake (PoS) Layer-1 networks Ethereum (ETH) and Solana (SOL). According to Pal, the use of Solana comes with a whole different feel that makes it a top contender as a relatively more user-friendly option.\n\nAdvertisement\n\nHe said once someone starts using Solana, it \"feels super fast, slick, inviting and easy for the user.\" The accolade on Solana underscores the general perception most industry leaders have of the top coin, especially as it has been able to pull off a major comeback in its price action post-FTX implosion.\n\nOnce you play around in the $SOL ecosystem, it feels super fast, slick, inviting and easy for the user.\n\n\n\nThe best comparison is SOL is Apple and ETH is Android.\n\n\n\nBoth win. Huge. — Raoul Pal (@RaoulGMI) November 29, 2023\n\nRaoul Pal is known for his commentary in the industry with a basis rooted deep in on-chain analytics; however, choosing to comment on the combat between Ethereum and Solana on pure fundamentals is considered a rare move.\n\nAdvertisement\n\nIn his analysis, Pal compares Ethereum to the Apple of the blockchain world while he considers Ethereum to be the Android. The connotations are clear as Solana wins the fight for performance based on its speed, while Ethereum's massive hoard of hosted decentralized applications (dApps) makes its Android comparison a well-suited description.\n\nSolana and Ethereum have thriving ecosystems\n\nAlmost everything Ethereum can do, Solana can do as well. It appears that Raoul Pal has broad use of some of Solana's applications, as he attested to the ingenious designs of Phantom Wallet, the most popular unhosted Solana wallet. This he confirmed when an X user asked to know what his feedback is for Phantom Wallet and in his response, he said:\n\nAbsolutely love it. Super easy.\n\nSolana has impressed its holders in a remarkable way, with Raoul Pal confirming he has been bullish all year. The coin soared to its 2023 high earlier this month as it wiggles away from the impacts of the continuous sell-off from FTX, the bankrupt exchange that sought ways to free up funds to pay its investors and creditors."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQNGhSZzNhVVBiWHI3UC1xUW15UnpBSDVpQnFBR21EMHIxOUpjNEdrMlp5UEVWMGI2bnFBU2VDNjJxUEZaVDNDOXpfQ3FEN2xtWGtJc2pVQkVFaEVna0FQYmVfY2hhTHFWV2d3aWJaVjRxOGtNeUJIcmpzV1V0dkczRHZEeFNHLWRQQXZzT2g0S09KUmJYVVVocw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Supply is Deflationary, Here Are the Two Main Reasons - Cointribune EN",
        "content": "Thu 30 Nov 2023 ▪ 4 min read ▪ by Fitah\n\nA major transformation is shaking up Ethereum: validators are leaving the ship, slowing the issuance of new tokens. Coupled with a rise in network activity, this is making the global supply of the cryptocurrency ETH deflationary. Let’s decrypt it!\n\n“Exodus” of Validators on Ethereum\n\nWhile the price of Ethereum cryptocurrency is stalled around $2000, a significant change is taking place on the network. Indeed, the supply of ETH is undergoing a major shift, becoming deflationary once again.\n\nGlassnode\n\nThis deflation results from two key factors. First, there is the slowdown in the number of validators in the staking pools. Then, there is the increase in daily Ethereum cryptocurrency fees burned via EIP1559, fueled by an intensification of network activity\n\nThe growing number of validators leaving the pool since October indeed slows down the growth of the network. This leads to a decrease in the issuance of new ETH crypto tokens. According to Glassnode’s analysis, the number of participant exits has seen a notable increase. This has gone from an average of 309 per day in October to an impressive average of 1018 validators per day since early November. This trend aligns with the recent rise in crypto prices.\n\nGlassnode\n\nThe massive exits of participants, mostly voluntary, are particularly concentrated among the CEXs such as Kraken and Coinbase. A modest increase in exits at the liquid staking provider, Lido, is also highlighted.\n\nIncreased Activity and Pressure on ETH\n\nAccording to Glassnode’s analysis, the network is also experiencing a significant increase in transaction demand, particularly for token transfers and stablecoins. This increased pressure on the network leads to a rise in gas fees, generating a notable growth in Ethereum fees burned via EIP 1559.\n\nGlassnode\n\nIn October, the daily amount of Ethereum burned reached 899 ETH, a figure that has climbed to 5,368 ETH in less than a month. These figures reflect a spike in activity, pushing Ethereum to new heights of demand and transactions.\n\nThis double pressure translates into a critical situation: ETH is once again becoming a deflationary resource. The reduction in the number of validators leads to a slowdown in the issuance of ETH. While the explosion in network activity exerts upward pressure on gas fees.\n\nThe combined effect of these two factors shows that Ethereum is responding to market changes. This creates a situation where the supply of ETH is once again shrinking, moving towards deflation.\n\nHow will this new dynamic influence the choices of investors in the weeks to come?\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    }
]