[
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxQbWo3aEJoVktYbElqREJZcWVBQ3IteE95RDctb0dOek5QdEYtUTZHaUFCMEtXSnpoN3k5SkhJVm5VUzVsdkNBQTVYVUctQ0l4R25wU0NTTVExLVZhbWZDTTRiVVBxb2FxOGdLUW41V2tWeU5kNVZqV1BMNEJmdGlhbVRHdkpxRnZLaTdIY2NCR0tTNnFoUndjUmhaLVlITWNKemE2aGpvbUwtZTjSAbABQVVfeXFMT1U5WVhETTN5cmJyR0VqNnRXREhFSmlSQ1I0U0NnUS1pVTdLdnNvYVA2UVFVWVVsU3FwWmxLdkhYVFdjTnRiYmpOS212R0REUTdpVk1Bb0ZMeHI0YmJaSlpNLU1fWUNmRHhldms5VDUySm9odnlZLVRRRFdvNnpBOU55Wk9xb3UtVlkydm1HcHdPRWY1Znl5dEwxZXdtQVRYVXp6Y182NVhkWEtvcUpSTF8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Dec 2023 08:00:00 GMT",
        "title": "Lido DAO Democratized ETH Staking, Then Dominated It - CoinDesk",
        "content": "But Lido has gradually become a victim of its own success, with the DAO attracting criticism as it has grown to dominate Ethereum's staking landscape. Lido currently commands 32% of all ether staked. This puts it just below a critical 33% threshold; if a single entity controls this much staked ETH, it could, theoretically, influence certain elements of how the chain operates."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxOeFAzckNNT3d5ZG9nNGdRUU5Cc0txakVrUU5yUm5ySHlIcV9JOHhzLXFzT3JXYmpCQ3RsRGVUVDdIbDdZeUUyWk5LNnRISFBwSXpIX1RaMUdNZGxwNFdUcTBMenIzZ3dtMmtqSy1GWmJEcmd4SW82azlWdm1kXzVkQUNVT3E1cjdZSTR5WF9MVUlaMGEweG4xNzVfWGx2dEJ4TVd4dUxXdHFYZC1XdEEwc3BSMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin primed to outpace Ethereum during bull market for first time next cycle - CryptoSlate",
        "content": "Quick Take\n\nThe year 2023 has marked a shift in the Ethereum to Bitcoin ratio. Despite Ethereum’s substantial dollar value growth of 88%, it has significantly underperformed compared to Bitcoin, being down by 25% against the lead digital asset. The ratio currently sits at a precarious 0.053, teetering near year-to-date lows.\n\nThis trend invites speculation as to whether the crypto landscape may soon witness a further dip in Ethereum’s performance. The BTC-ETH Dominance metric, an oscillator that tracks the macro outperformance trends between Bitcoin and Ethereum, provides some relevant insights. It gauges the Bitcoin Market Cap’s dominance over the combined market cap of Bitcoin and Ethereum, normalized around a long-term mean using a 0.765 factor.\n\nHigher values and uptrends point towards Bitcoin outperforming Ethereum, while lower values and downtrends signal Ethereum’s superior performance. Currently, we are technically in an era of Ethereum dominance, with the metric at -0.016, which is the lowest level since Ethereum dominance began in May 2021. Traditionally, Ethereum tends to outperform Bitcoin during bull markets, raising the question: Could this be the first bull market where Bitcoin outpaces Ethereum?"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxOa3JtZzlleWpIbVkyTG5nZnFvYi1tT1FzU1lpSjhLZEtQOUdLR3Jjc1F6UG1xWV9VY0l6M2kxb0VHUVgzUmpSTWhYR1ZvWklmNEhUMkYta3k5Q0pRcFprZmhET1ROTWhuOFFXMElTSkRObTA4MWRueVJtclh2TjVYVnVjMlN1eDR2V3VYZ2VMbTVVUFZuZG03bmw4VXAwaDU5QTc2TURLb2lPUFRzNEp4Y0hVaWdSMk5vZG44azNEUVNZZ9IBxwFBVV95cUxNMU1Vc0JVZFo0bjVfdU9uMHVrSGNuNGN5ZElOd1lZMHR0TVVmUWNEbUt0VmhNdlNSbWRTN3NwN1E0dEhIcGMtSEhyS01sazZDemZVMGUxbVJFS2dMNVdSMC1HS3lEdHBZajNnR3BSYlNsZ1p3c2hDdFB3SXRxSEk5eFQtbzhVU0lQWU1GMDFCMlQ3OFVETFdUV0VhS2lWU1pmQ21kQlBFYnNpU1ltQW5XZkZsR1piYkJHRC0xQW1fODBZYkFSNzBv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Dec 2023 08:00:00 GMT",
        "title": "Crypto Strategist Unveils Bitcoin (BTC) Path to $83,000, Gives Short-Term Ethereum Price Target - The Daily Hodl",
        "content": "A closely followed crypto strategist is laying out a roadmap for Bitcoin (BTC) to hit his long-term target of $83,000.\n\nPseudonymous analyst Rager tells his 199,900 followers on the social media platform X that Bitcoin could rally close to $50,000 by next month.\n\nRager predicts the big move up will be followed by a steep correction down to the $30,000 level as BTC approaches its 2024 halving.\n\nThe halving, which slashes BTC miners’ rewards in half, is slated for April 2024.\n\nAccording to Rager, Bitcoin will continue its uptrend after the halving en route to a new all-time high of $83,000 by 2025.\n\n“$48,000 by mid-January, followed by a pullback to mid/low $30,000. Rally post-halving, new high in late 2024.\n\nPeak-high price in early/mid 2025. Q3 2025 ends bull market.”\n\nAt time of writing, BTC is trading for $41,433, up over 11% in the past week.\n\nLooking at the top smart contract platform Ethereum (ETH), Rager thinks that the leading altcoin is poised to move higher toward his upside target of $2,500.\n\n“ETH slowly gaining strength over time\n\nEventually, price likely heads up toward $2,500 as a nice target.\n\nNice move this weekend but not always a fan of weekend pumps.”\n\nAt time of writing, Ethereum is worth $2,252, up over 4% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxNRExwcjlPX2hldXQ1ZngtcHhycWpxdTRiTkxod0QxTE5NWGJSMnZjRHVfZ3hrdWUza21lam1kVG8zRmhKcVZtWFNKQ0tYZGlqNWI3N1hPZlNkNmtKai1YdkhKdTBLZjBfaXRaWmFybHBqLUtHQ0RsZ0YycEpmZGFyTHllWFZsU05PWUdKbU5fR183ZTJMSFZhUTNBZzFwOUJQVjNBX0hsVzV3cUxtLXRFNDkwR2YtZHI1d0VUNHY1UHJQdHfSAcgBQVVfeXFMTmkycVlDbWJHZmtVNzhSMEFhVWI4Q09QVW1KR3lHYWZKWldNLXZYbHZVbzVTTDFYaGR2eExMTjNLVTRXRFdfNUtUaldhVFBEbVA1RnJZYjZKdjN6a1pwcUxZOW4xLVpJQXdhbExhdlFRcV85QzJDQ2dPeWVEcXVNSFd2WkZGQjNlMHpYUzFJYTBVdVF4eTloaE1SeFI5cUt6Q3VNT3FuVVNsVU5oeXlwLWpYSE5BeVFnRWdtcGpjNG1nUFh0LTBkdkQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Price Prediction: ETH attempts to flip $2,300 into support - FXStreet",
        "content": "Ethereum price is on a tear, consolidating within a bullish technical formation that promises more gains if sustained.\n\nETH could rise 5% to convert the $2,300 resistance level into a support floor before continuing its upward trajectory.\n\nThe bullish thesis will be invalidated upon a daily candlestick close below the $2,143 support level.\n\nEthereum (ETH) price has been consolidating within an ascending parallel channel since the broader market turned bullish around October 18, pushing north with key drivers including speculation of spot Ether exchange-traded funds (ETFs) launching in the market.\n\nAlso Read: Ethereum price breaks past $2,000 as BlackRock hints at filing for spot Ether ETF\n\nEthereum price eyes 5% rise above the $2,300 support\n\nEthereum (ETH) price is trading with a bullish bias, sustained by an ascending parallel channel. This technical formation promises and delivers more gains for the asset as long as it remains within its confines. However, based on the current outlook, the largest cryptocurrency by trading volume looks ready for a breakout after one attempt already.\n\nTechnical indicators show that Ethereum price still has some upside potential, with the Relative Strength Index (RSI) inclined north at 69 to show momentum is still rising. Its position below 70 is good, suggesting ETH is still not overbought nor ripe for a correction.\n\nSimilarly, the Awesome Oscillator (AO) remains in positive territory with green histogram bars. This points to a strong presence of bulls in the Ether market and could bode well for Ethereum price, depending on how the bulls play their hands.\n\nIncreased buying pressure above current levels could see Ethereum price breakout above the upper boundary of the chart pattern, confirmed by a flip of the $2,300 resistance level into a support level. This would set the tone for Ether to continue its upward trajectory.\n\nETH/USDT 1-day chart\n\nOn-chain metrics support Ethereum price bullish outlook\n\nMultiple on-chain metrics support the bullish thesis for Ethereum price, including the dwindling deposit transactions and the volume of exchange inflows. As a spike in deposit transactions would indicate a rise in short-term selling pressure, the absence thereof shows investors do not have the intention to sell.\n\nThis outlook is corroborated by dwindling exchange inflows, suggesting investors are not moving their ETH holdings to exchanges. There is no effective intention to sell in the near future.\n\nETH Santiment: Deposit transactions, exchange inflows\n\nFurther, the Tether (USDT) stablecoin market capitalization is rising, suggesting fresh capital inflow into the Ether market, interpreted as the intention to buy. The ensuing buying pressure could inspire a prolonged uptrend for Ethereum price.\n\nETH Santiment: USDT market capitalization\n\nConversely, if selling pressure increases, possibly as investors start booking early profits after such a striking climb, Ethereum price could pull south. In such a directional bias, ETH could lose the confluence support between the midline of the channel and the horizontal line at $2,143. A break and close below this level would invalidate the bullish thesis.\n\nFurther south, Ethereum price could extend the fall, potentially going as low as the $2,029 support before a foray into the supply zone turned bullish breaker. A decisive candlestick close below the midline of this zone at $1,935 would confirm the continuation of the downtrend."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxNcHR4dFl0cTZFaUlLQTdaVWpPY1lPT2o3OGNmWEI4VUNWUHUxS3pqTWhqQTktcXg1Z3dyaXpDckRWWWlzYnY4djhqM3dlZVhOOGQ3M2ZnQndPdWJIUm9BYUdrc2FpalZHMWsxdmVyRkQtQ2FRQ0J1ZlJ3azhSSFZ1SFBn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Dec 2023 08:00:00 GMT",
        "title": "Why Has Bitcoin Rallied More Than Ether in 2023? - Unchained",
        "content": "BTC crossed $42,000 for the first time since April 2022 amid rising market optimism that a spot bitcoin ETF would receive approval.\n\nBitcoin and ether once rose and fell in near lockstep, but no more.\n\nThough the prices of the two largest cryptocurrencies by market value have both climbed in 2023, they have taken somewhat different paths, with BTC skyrocketing 145% year-to-date and ether jumping a still strong but lesser 85%.\n\nOn Monday, bitcoin cracked the $42,000 threshold for the first time since early April 2022 when the Terra ecosystem started to collapse, while ether rose above $2,200 for the first time since May 2022, according to Coinmarketcap data. BTC was recently trading at about $41,950, roughly flat over the past 24 hours.\n\nRead more: 12 Charts That Tell the Story of Crypto in 2023\n\nIn its newsletter on Monday, Kaiko Research, which tracks crypto market data, attributed the gap in no small part to rising optimism that the Securities and Exchange Commission (SEC) would approve applications for long elusive spot bitcoin ETFs.\n\nKaiko noted that BTC volatility has declined significantly since the summer not long after BlackRock, the world’s largest asset manager, and other financial powerhouses submitted their spot bitcoin ETF applications. The firm used the Sharpe Ratio, a measure of compensation that investors receive for taking on more risk where a higher ratio equals a better risk-adjusted return. BTC outperformed most traditional assets, including gold, and Ethereum.\n\nRead more: Spot Bitcoin ETFs Record $4.6 Billion First Day Trading Volume\n\n“The difference in risk-adjusted returns can largely be chalked up to BTC’s superior price performance this year. The ratio was about 0.072 at the start of the year and is now 0.053,” Kaiko research analyst Riyad Carey told Unchained in an email. “ETH has likely had a softer rally because the main catalyst/narrative – a potential spot BTC ETF – directly relates to BTC.”\n\nBitcoin, which has a market capitalization of $812 billion compared to the $267 billion for Ethereum, is often hailed as “digital gold” and viewed as a hedge against inflation and economic uncertainty. As a result, bitcoin’s price has tended to be more sensitive to global economic factors and policy changes such as Federal Reserve Chair Jerome Powell’s comments last week that another interest rate hike wasn’t currently in discussion – a favorable sign for the asset.\n\nSpot ETF Applications Favor BTC\n\nThirteen companies have filed spot bitcoin ETF applications, including Grayscale, which hopes to turn its bitcoin trust into an ETF. The SEC’s thinking on the Grayscale situation remains unclear and could delay that potential product’s approval, although in an interview with Unchained, Bloomberg analyst James Seyffart reiterated his belief that he expects the SEC to approve the applications en masse between Jan. 8 and 10.\n\nThe SEC is currently considering seven applications for spot Ethereum ETFs. While a BlackRock application last month caused ETH to have a stronger rally than BTC, there’s general sentiment that bitcoin has an easier road to approval. This is partly because bitcoin is older, has a larger market capitalization and has a more straightforward use case. Ethereum, in contrast, is a more complex platform for decentralized applications (dapps).\n\nOn Monday, BlackRock and Bitwise filed amendments to their applications, a further indication of progress, Seyffart wrote.\n\nMeanwhile, another measure of crypto market optimism continued to point upward as inflows to digital asset investment products rose for a 10th consecutive week, according to research group CoinShares. The rise underscores institutional investors’ interest in the asset.\n\nCoinShares data showed that bitcoin had $133 million in inflows last week, bringing its year-to-date total to $1.68 billion. But the group also found that Ethereum had just $31 million of inflows over the same period, bringing its net flows into the positive for the first time this year.\n\nIn an email to Unchained, Markus Levin, co-founder of XYO Network, echoed Carey’s comments. “Bitcoin has outperformed Ethereum in large part because many are anticipating that these spot BTC ETFs will likely get approved fairly soon,” Levin wrote. “An ETH ETF might also be on the horizon, though it’s less definitive than the Bitcoin ETFs. As a result, I think we’re seeing a lot of capital getting allocated to Bitcoin and this, in turn, is having an outsize impact on momentum.”"
    }
]