[
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxPQk9obE4xMTYzbUl5akFfSlB2R1lxZ0VuZDF2UmxYVEg1aFZCZFFNaFdNbmlxM0RQdmNzeEZIRm1iUzIxcnJSRkhhQVR1SW1SU05ROVMxeDdOYWR2RVJBdG83RllWSUtPQmNCaXNGMTVmMnZGRTdEWUs3cmJqektWVF9oUXh4UTRCTE4zVHpBSTlCc1JPbkJR0gGcAUFVX3lxTE5tWEdkNThaTVNEUFk4NUI3Sl9aZWhiNzZnaS1tQkt4N3o0Vl9YdDU2Q2thZGRUZUJLUUt5czdwS0dOcGd3a1llWmFfMjVhdGMwYUVCUmpCUlg1WGJLb2dwbFktcm9CdXNyWno5V0tnM0RUdHZ2Q19zQl8wbktjM0ZVeXZYNGZvV253N281eHNBcmttNHlvZi1VTW1DNg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Liquid Staking Tokens Are a Hot Ticket for 2024 - CoinDesk",
        "content": "1. Rebase tokens – tokens that automatically adjust their balance in response to deposits and rewards. This process, known as rebasing, typically happens daily. During rebasing, there is no visible transactional activity for the token holders. Examples of such tokens include Lido's stETH and Binance's BETH, both of which are classified as rebase tokens. This type of LST is designed to be user-friendly, as the balance of your LST increases in line with your staking activities."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxNc2Z6bW8wVUJyTnhRUTFBMHVqRkY4MUVxMmZKYXNlVDlxTWZLMDYtZlFzT29HLXFzclQ4N0NLay1IZE8tcjBQRzJJZXNHc0dNQnRQckhmTXhIV1RsdzNIdkhqMGstQnFRdDRZdmVGR3lWNmlvZVpKcHI5ak4wRm5FUGV0SDl3Sld1QVhrS1AySFRTNmdyMlFVcC11TkdmQk9MZHdIakk2N09sVWPSAbABQVVfeXFMT25tLXp2OGttWmVPQkJ1V0UxM2txaWRwX1I2UGhCZy1ac29HQ2NJRi0tTUxFWG9lRVVVNHdfX3lHcjVNc0FyQURIbk5sRW4xQkNPbEpfVnpHd1J1dGxnTXdWVWRLc2RCT2tGbU1rR0RkN2RVd3lfNzRlYXI0bm5EZVRKbFlxOXR0U1RWa3l6ZVBlSXAwdU15U05HeFhKVzcxRW16WjZadUhCWmtRVlJDa00?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Blast's One-Week, $600M Haul Shows Promise of Yield, Pitfalls of Hype - CoinDesk",
        "content": "Aside from the garishness of it all, there's been criticism of what some commentators describe as a potentially risky setup, where depositors are essentially relying on faith in an undisclosed group of \"engineers\" – as opposed to more robust security measures – to safeguard their cryptocurrency ahead of Blast's real launch. For now, user deposits into Blast's crypto wallet can't be withdrawn. And at least initially, the juicy yields won't come from any internal workings of Blast, but from routing deposits to other yield-paying projects, primarily the liquid-staking protocol Lido, adding yet another layer of risk."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxPdjJDNVZmek1nQ1hHRzB2THk0bXRMdDZEQVpZbUJtOVM0SVdMR01ZaF8xWmZ6ejI1Tk1aSUJxZ2Y0Tl9sSDNyWGVUbWYzSDNvQzdCMlBWc05wa1YyeFdNWlVROS1zaTFEQ19remdlYV9heWJoemp6UURDcjkyazNRRkIxY9IBiwFBVV95cUxNWHBpa3dpbzRVVC0zM2pQMU95OUNjaWszQk14dkNLaXY5UUg2Y1VtYXFtZGVsdU5wR2R5amlpOFJkME1la2FvUjBQem1EQnBIRS1COFM0TWZyVmt5MnZua2Vld1FpWk9RdVhmT3lIOGlXYnZ2SWlZN1kxYUZjZGdXQW10dnJta1gyZzlV?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Solana Gets Some Shine: Ethereum Rival Rallies Again - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAfter cooling its November rally Solana has shot up again: it's right now the best-performing cryptocurrency out of the top 20 coins and tokens.\n\nAt the time of writing Solana (SOL) is trading for $60.16 per coin—a 24-hour jump of over 7%, according to CoinGecko. Over the past seven days, SOL has gained 10% in value.\n\nSOL experienced a phenomenal rally throughout November. The Ethereum-competitor price soared past $50 for the first time since May 2022, beating most coins and tokens in performance.\n\nAccording to experts, the boom was likely down to a short squeeze caused by short sellers exiting their positions and renewed interest from institutions. But that was nearly a month ago and Solana is still pumping.\n\nAD\n\nAD\n\nSOL was the most oversold asset in the space after rumors swirled that collapsed crypto exchange FTX's new management was thinking about selling large amounts of SOL. But it shot up unexpectedly after short sellers (those who’ve bet on the asset going down) rapidly exited their positions.\n\nOver the past 30 days, SOL is up over 70%.\n\nElsewhere, the crypto market is relatively sleepy. Bitcoin has barely budged over a 24-hour period; the same goes for Ethereum. Other major players like Dogecoin, Tron, and XRP have also not moved by a percentage point.\n\nBitcoin yesterday did experience impressive price movements, breaking past $38,000 per coin for the second time in a week.\n\nAD\n\nAD\n\nThe same goes for most of the top digital assets—except for Avalanche (AVAX), which is up in the past day, coming in at $20.87.\n\nAVAX—like SOL—is also a winner over the past 30 days: it has gained 80% in value. The cryptocurrency experienced a price bump earlier this month after banking giant J.P. Morgan said it had used the blockchain to tokenize portfolios.\n\nEdited by Stacy Elliott."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxPdjJDNVZmek1nQ1hHRzB2THk0bXRMdDZEQVpZbUJtOVM0SVdMR01ZaF8xWmZ6ejI1Tk1aSUJxZ2Y0Tl9sSDNyWGVUbWYzSDNvQzdCMlBWc05wa1YyeFdNWlVROS1zaTFEQ19remdlYV9heWJoemp6UURDcjkyazNRRkIxY9IBiwFBVV95cUxNWHBpa3dpbzRVVC0zM2pQMU95OUNjaWszQk14dkNLaXY5UUg2Y1VtYXFtZGVsdU5wR2R5amlpOFJkME1la2FvUjBQem1EQnBIRS1COFM0TWZyVmt5MnZua2Vld1FpWk9RdVhmT3lIOGlXYnZ2SWlZN1kxYUZjZGdXQW10dnJta1gyZzlV?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Solana Gets Some Shine: Ethereum Rival Rallies Again - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAfter cooling its November rally Solana has shot up again: it's right now the best-performing cryptocurrency out of the top 20 coins and tokens.\n\nAt the time of writing Solana (SOL) is trading for $60.16 per coin—a 24-hour jump of over 7%, according to CoinGecko. Over the past seven days, SOL has gained 10% in value.\n\nSOL experienced a phenomenal rally throughout November. The Ethereum-competitor price soared past $50 for the first time since May 2022, beating most coins and tokens in performance.\n\nAccording to experts, the boom was likely down to a short squeeze caused by short sellers exiting their positions and renewed interest from institutions. But that was nearly a month ago and Solana is still pumping.\n\nAD\n\nAD\n\nSOL was the most oversold asset in the space after rumors swirled that collapsed crypto exchange FTX's new management was thinking about selling large amounts of SOL. But it shot up unexpectedly after short sellers (those who’ve bet on the asset going down) rapidly exited their positions.\n\nOver the past 30 days, SOL is up over 70%.\n\nElsewhere, the crypto market is relatively sleepy. Bitcoin has barely budged over a 24-hour period; the same goes for Ethereum. Other major players like Dogecoin, Tron, and XRP have also not moved by a percentage point.\n\nBitcoin yesterday did experience impressive price movements, breaking past $38,000 per coin for the second time in a week.\n\nAD\n\nAD\n\nThe same goes for most of the top digital assets—except for Avalanche (AVAX), which is up in the past day, coming in at $20.87.\n\nAVAX—like SOL—is also a winner over the past 30 days: it has gained 80% in value. The cryptocurrency experienced a price bump earlier this month after banking giant J.P. Morgan said it had used the blockchain to tokenize portfolios.\n\nEdited by Stacy Elliott."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxPN2dPdEI3dExzbjBvdTR3Mmt6REp5Y2hvYUhqc1MyWjRpZGs0MERIQ1VnWXlEZUVJa2pEelBDSlNYejBvVkRJWl9RYkNMVzFzR2hkdGxSX2ZxUFN1anp4TGljWTNGZmw1dXM2dEM3Y05VQ0lNRXBTV1hXLWh6Q2o5aWZpWdIBiAFBVV95cUxNT25nZ3JqRVgxX2stcFhWV2J4TzlCVmZxSzZKNVgxbGZJN0hzT1FqMjFQRVVQY0JLdWhoUFQ5bVdEbUIyR21hSkljcWdwLU1NY3V6Rk1hWF9fMzlDSUZqaUc1VlQwWFRUdWtnVjJyM1BLRlJLOFRzYXV4OVF5VGc0NjVIYmVkUGUt?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Price Prediction: Will $ETH Surpass $3000 in December? - CoinGape",
        "content": "Ethereum Price Prediction: Throughout the major part of November, the Ethereum price remained within a sideways range, fluctuating between $2133 and $1917. Both of these horizontal levels were tested twice, signaling uncertainty among market participants. However, this consolidation has formed a bearish reversal pattern, suggesting a potential further downside for ETH.\n\nAlso Read: Here’s Why CBDCs Could Outshine BTC, Ethereum, and Other Private Cryptos\n\nadvertisement\n\nWill $ETH Consolidation Lead to Massive Leap?\n\nThe overhead supply at $2133 assists sellers in developing a bearish reversal pattern called double bottom\n\nThe $1917 level aligned with the 32.8% Fibonacci retracement level creates a strong support zone.\n\nThe intraday trading volume in Ether is $10.5 Billion, indicating a 16% gain.\n\nAmid the past two weeks’ consolidation, the Ethereum price retreated twice from the $2133 resistance, indicating substantial overhead supply. These reversals have emphasized the emergence of a bullish reversal pattern known as a Double Bottom on the daily timeframe chart.\n\nTypically observed near market tops, this pattern signifies a decline in bullish momentum. At present, ETH trades at $2,025 and, with an intraday loss of 1.6%, is gradually approaching the neckline support at $1,970.\n\nA bearish breakdown below this neckline could intensify supply pressure, potentially causing ETH to drop to around the $1700 mark, marking a potential loss of 12%.\n\nHowever, the recent price rejections around the psychological support of $2,000 suggest buyers are attempting to counter the bearish setup. If this buying pressure persists, the ETH price might rebound to challenge the last swing high at $2133 and the upper trendline of a longstanding wedge pattern.\n\nETH Price Recovery to $3400\n\nOver the past 20 months, the ETH price has experienced a shallow recovery within a rising wedge pattern. Historically, the upper boundary of this trendline has resulted in increased supply pressure, leading to significant corrections. Therefore, the current upward movement towards this upper trendline necessitates a definitive breakout to confirm a bullish trend. A post-breakout rally could potentially drive prices up to $3400\n\nRelative Strength Index (RSI): A sharp drop in the daily RSI slope suggests a bearish divergence with the Ethereum price, hinting at potential upcoming downturns.\n\nBollinger Bands: The converging boundaries of the Bollinger Bands indicate an uncertain market sentiment prevailing for Ethereum.\n\nSahil Mahadik Sahil is a dedicated full-time trader with over three years of experience in the financial markets. Armed with a strong grasp of technical analysis, he keeps a vigilant eye on the daily price movements of top assets and indices. Drawn by his fascination with financial instruments, Sahil enthusiastically embraced the emerging realm of cryptocurrency, where he continues to explore opportunities driven by his passion for trading\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    }
]