[
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxPWVNJNjR4SklvWDJCSUY4Q2hrOXJxV0JjM3ZIeWRIQ1YyTHpwNl9FbWxDdWZfQV9XdThWV2NCb0QtMl9iUVpJY29PUVRKUHhySXpmQkFuWmE5RTRja2x3QjUzU2FtaGZXb3E0UHV0UzVIUmdkTmtRenZfUWs2OTV3SmctS1MtR3NKbnFZRHg3T21lay1GQUdjWFhjck5JVXRvR2p1TFZHdzBrcTFPOEdqUVE2ZUxQYk1pS1HSAb8BQVVfeXFMTlpBa25WRjM0MGZuMDVvbHNCa3dYdGYyUG5OcHRtaVJHZ25CdlFucmMtR29FX0ZUZ0NUcndiNy1Lc2dhWDJpaTZsS2QzZlVZSFNJUHhCVFpXdDJtWXRyV1pfQ1NzSWd5aGhtRTFpa0J4QXVncV9hLWV1OVNhMVYySnV2a0ZGLVlrdjR0RGVCbnR4anQ0YmxzNkhqdlRDQ3dpcVBVajh6YllDYUgwMkpzd3d0WC1mUW9iN183b1NWOEU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "Ethereum's 'Dencun' Upgrade Goes Live on Second Testnet, With Just One Remaining - CoinDesk",
        "content": "Ethereum's 'Dencun' Upgrade Goes Live on Second Testnet, With Just One Remaining\n\nNext week, on Feb. 7, Dencun will go live on its final Ethereum testnet, Holesky. After that, developers will ink in a date to activate Dencun on the main blockchain.\n\nBy Margaux Nijkerk Jan 31, 2024 at 1:11 p.m. UTC\n\nElection 2024 coverage presented by Stand with crypto"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxNby1uN3dfdnMtRmhQVUpST3hZSS01WGE5dktCcEgxYXN1azdPYUZicWp2UFhqWlItV2tMQnl6RWlWVGJRRnBUWk5STHZ1RUY5LVRoTTZZWUZEM1RRdlNlTjE0Um8taC1JOTdYYzJnOXR1OWJQMlkxSlAyQkpRVTBjbUJNYmw2SFp6LWJWVGpmNlZFc0JkVXhTYW8yQ1YxNDBkRzEzV3o0cnlwWndiclBZN0ZJQi00NHhOUkVrTmlR0gHDAUFVX3lxTE9fMTNoUzM0NEFHaVluR01DM1Vzc2Y1am1lT1JCN0c2NTNLNThzSzg4eXY1MENJUjZGSjhyeGNubHR0Um5RRW1mUmstNmd2VXM4c294QXpJblNwQkMxdzdxQU1xY1VjMGVzMlhtTndmN0tSWUJNNy1TbUxMelNRR3BIcDAxMGFzcllZM2tyRkplT3Y5MXBFc2trRWJEbzRHbm55cVF4SUNXcnY5eGRIR2pFRkREbklxU08zYjVoLXdYUEU2dw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "Inside the 'Private Mempools' Where Ethereum Traders Hide From Front-Running Bots - CoinDesk",
        "content": "The thousands of validators that run Ethereum behind the scenes scoop those mempool transactions into blocks – usually with help from third-party \"block builders\" who organize them according to certain criteria, including how much they pay to validators in fees. Once they're added to a block, the transactions are officially written to the blockchain, where they are cemented permanently."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxOVU44cE94X2RzTG9yMXJEWHpMTDNSRmRIUnp4d09LVk5wYkNNc0tuWG9HRXpjeDh6WlBQSlFsQkhTTVYzQXA5YnZuZ0tHMXpQVXNoLXdUdUdqUXNVMVZ5bWJpWUV6SmVPdDIxNTNIR2NRT2cxU1BMMHRFTUJzZGw2d3ZpUE16QTZzdlUzRllkWVFNT0ItRi1uZ9IBngFBVV95cUxNWWJqTWthSVVWTTN4X00wV2pyRE5XRkZTMWlXY1ZVWDZaTW9relY5X3lFZ1VGRkZxZGJpWjFnUVdqWE8ycHFqcEUtUjJhTWY1NERIamdFazBHZzc0RXFjZnM2dE1JZ0NuZ0JhQmVrbVpJR2ZlYkl1RWZ0cHJZWDJNa3pSVDRMTl9LdEVEMUc3OHpYOVIzSHQxSFhaTkNPUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 15:27:41 GMT",
        "title": "Vitalik Buterin Answers Major Bitcoin and Ethereum Question in Birthday Essay - U.Today",
        "content": "Renowned Ethereum cofounder Vitalik Buterin celebrated his 30 birthday today by releasing a thoughtful essay titled \"The End of My Childhood.\" The essay delves into the genesis of cryptocurrencies, and Bitcoin in particular, underscoring its initial purpose as a response to the vulnerabilities of traditional banking systems.\n\nAdvertisement\n\nIn his reflective piece, Buterin questions the evolution of public discourse within the crypto space over the past 15 years, pondering whether the original narrative emphasizing financial disruption has waned. To address this, he proposes two pragmatic approaches for the crypto ecosystem.\n\nFirst, Buterin advocates for a renewed emphasis on the significance of money and finance, urging the crypto space to actively contribute to serving underserved populations and fostering financial inclusion. Second, he envisions a broader role for crypto that extends beyond finance.\n\nAdvertisement\n\nHighlighting the unique decentralized nature of the crypto industry, Buterin notes that developers are dispersed globally, and many major crypto projects are not bound by geographical constraints. He emphasizes the potential of non-Western developers to understand and address the concrete needs of users in low-income countries.\n\nIdeal reality by Vitalik Buterin\n\nButerin's vision for Ethereum goes beyond financial applications. He envisions ETH as the foundation for a decentralized tech stack, emphasizing trustworthiness, democracy and privacy. Zero-knowledge proofs are identified as a key innovation in achieving these goals, offering a nuanced approach to issues of authenticity, manipulation and privacy.\n\nIn addition to Ethereum's role as a financial platform, Buterin encourages the community to broaden its focus, positioning his brainchild as a competitive force against centralized tech companies.\n\nThe essay articulates a nuanced perspective on the roles of token holders, intellectuals, builders and pragmatic users within the crypto ecosystem, highlighting the need for collaboration and understanding between these groups."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxQaG91TXFqUXA4UEludVFwYkoxS0JUeWx4WHRFTzBDUlM0UnotWmt4TWRkWk5PZEtoaEF5UHhvQWZwYlQ1SS1sTHpLQTBpU042TEszMl8tWEgtRVplSURKZXRsMWVsd3ZuRnFzVkcyV0N2NkVhLUd3RWRKYlBFaWhDT0llMk1HUEpOTEFVcnkzaXJiZ3k1Zzh5UGthZ2QyXzBQU3k0ejA1MNIBrwFBVV95cUxQMzE1M2g3Znl1MDl1QzU4UTdnVUNVUU5kUnJWYmZnTjI1TTFJb2xodUFPUlVZSG1iQjdQbWVESWhLbmdvUEZveS1PNW1hcWRUNWtHa21odHhqcjBHOFFfR2k5ZlBNdHM4ZkxDVUFqV1M3R3NvYmtWWVhWNWZjdkhOanNBZE1WRUlrandXRHFKMGdxdnJCUUtQUzJsU3M2VHUyMWxQbGZQaThvaFdjRFdz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "Solana's Jupiter Hits $1.2 Billion in Daily Volume, Outpacing Uniswap on Ethereum - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nJupiter’s massive JUP token airdrop claim began Wednesday, and volume on the Solana decentralized exchange (DEX) aggregator soared to new heights in the process.\n\nAccording to data from both CoinGecko and Jupiter itself, the platform has racked up more than $1.2 billion worth of daily trading volume over the past 24 hours. That makes it top among all crypto DEXes, beating typical leader Uniswap V3 on Ethereum with $854 million (per CoinGecko). Note that the tally does not include Uniswap volume on other chains.\n\nJupiter’s 24-hour rolling tally also appears to be an all-time record for the protocol, which has recently seen surging demand. Another data source, DeFi Llama, shows that Jupiter’s single calendar-day volume record is just above $1 billion on December 14, 2023.\n\nToday’s traders won’t get anything from the initial JUP airdrop, which serves up 1 billion tokens for earlier Jupiter users to claim. Jupiter took a snapshot of eligible wallets in November and said that about 955,000 wallets could claim tokens during the drop.\n\nAD\n\nAD\n\nBut there’s reason to be optimistic: Jupiter has allocated another 3 billion tokens, 30% of the total token supply, for future airdrops to reward newer users. The timing for the next airdrop has not yet been announced, however, and amid the buzz of claim day and the sizable drops landing in Solana wallets, traders are eager to start racking up activity on the platform.\n\nJupiter opened up the claim at 10 a.m. ET and the coin started with a market price of about $0.42, according to data from Birdeye. JUP quickly popped over 70% to a price above $0.72, as Decrypt reported earlier, but it has since calmed to a current price below $0.67.\n\nEven with the sinking price late Wednesday, JUP commands a market cap of about $914 million based on the current circulating supply, and the token has generated over $500 million in trading volume in less than nine hours.\n\nAccording to a Dune dashboard that tracks public blockchain data, eligible wallets have already claimed about 566 million JUP tokens out of the initial 1 billion JUP airdrop allocation. Nearly 392,000 unique wallet addresses have claimed tokens so far, as of this writing.\n\nAD\n\nAD\n\nSOL itself has fallen about 6% on the day to the current price of around $97, according to CoinGecko, after bouncing up and down since the JUP drop.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxQNEVwaHpxenpxWjJTX0VqQUpJdXRXTWR6cEdDOU9JMXZOWnc3OXBiRm1TX3NaNFhwTkItSG9FTzVsRzRsSjV5NDhtemFFUUJPZWhTUDNEaHVfb280YlV2eDMxQ0xEd0Z4bGo4TUx4UTJtYjY4TmJlNk9BX1YteW95SC1vUdIBiwFBVV95cUxOTkdwRThqSUY5MVdibDNIYXlESHFBQll2NnhIZkJrMU1EV0lFcTl2WGlxUFp0cjFSYjRDTFQ5Vk1NYWRUaTlzU0RwelRZTTVlZ1dKc2l0czU5RmpOeG9PT1VDeU5oR2RWMDM3WlphNGR1RnBveFZJUDJFSlYxc1lnTjJzdVBFRkZlWDlF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Founder Vitalik Buterin Doesn’t Want to Be the Face of Crypto - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIf Ethereum co-founder Vitalik Buterin ever aspired to be the face of the cryptocurrency space, he doesn't want be that anymore.\n\nButerin published a blog post Wednesday in which he meditated on the \"end of his childhood\" as a young pioneer in crypto, marking a transition in the industry. Buterin also mapped out his vision for the future growth of Ethereum and decentralization.\n\nButerin founded Ethereum in 2013 at the age of 19, quickly becoming a leading voice in the booming crypto industry. Now approaching 30, he writes, \"if that was ever my role, it is no longer.\" Buterin sees new, even younger innovators taking leading roles across crypto and related technologies like synthetic biology.\n\n\"I am now in some different kind of role, and it is time for the next generation to take up the mantle that used to be mine,\" Buterin reflected.\n\nAD\n\nAD\n\n\"One of my most striking memories from my last two years was speaking at hackathons, visiting hacker houses, and doing Zuzalu in Montenegro, and seeing people a full decade younger than myself taking on leading roles, as organizers or as developers, in all kinds of projects,\" he wrote.\n\nZuzalu is a gathering of about 200 high-ranking names in crypto, pharmaceuticals, politics, and academia who spent two months abandoning their respective lives and identities to become the first citizens of a new civilization—one founded among the resort hotels and Airbnbs of Lustica Bay, Montenegro, and tasked with envisioning what they consider to be a new future for humanity. It's a \"pop-up city community” conceived by Buterin.\n\nHe also shared that the majority of his decisions concerning Ethereum were made as a response to other people's pressures and requests.\n\n\"When I met Vladimir Putin in 2017, I did not try to arrange the meeting; rather, someone else suggested it, and I pretty much said 'ok sure',\" he writes. \"Now, five years later, I finally realized that (i) I had been complicit in legitimizing a genocidal dictator, and (ii) within the crypto space too, I no longer had the luxury of sitting back and letting mystical 'other people' run the show.\"\n\nAD\n\nAD\n\nThe Ethereum founder argued the crypto community should \"create an entire decentralized tech stack\" to \"compete with centralized tech companies at every level,\" spanning finance, identity, communications and more. He provided a chart outlining this vision for a parallel structure, from stablecoins to replace banks to encrypted messaging replacing big tech messaging platforms.\n\nButerin also focused heavily on the human element enabling decentralization, analyzing the differing motivations between token speculators, builders, intellectuals and end users. \"There is an opportunity to improve understanding between the four groups,\" Buterin wrote, noting financial incentives are not everything.\n\nBy visiting crypto communities worldwide from Argentina to Taiwan, Buterin highlighted the diversity of needs and ideals driving adoption—from inflation troubles to academic curiosity. \"If places like Silicon Valley are frontiers, filled with abstract far-mode thinking about a better future, places like Argentina are frontlines, filled with an active drive to meet challenges that need to be handled today,\" he wrote.\n\nAs the \"characters\" of crypto's early years exit, Buterin concluded decentralization itself persists by creating new communities: \"Continuing to stay active and doing what we can to create the new is a task for each one of us.”\n\nEditor’s note: This article was written with the assistance of AI. Edited and fact-checked by Stacy Elliott."
    }
]