[
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxNUGxpd3J0WGpKZjd0emZnMmJ0WWpRdFFjaEJzbHFnd3FrLVZQTS1qNFhxdlRLLUQ1T2JCX21mVWRiVEsxd2ZNbjJnUk9aaEwyaEZNRy1uSXBFR3k3QWVIRGZweEE3Yi1KV1NBWkFLV0Iyd0pFV2RmWVBNV2ZySDRSWEk4aERFZzlSeEVEeFUxbktlUG9QdThiSUxCZ0M?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 May 2024 07:00:00 GMT",
        "title": "Ethereum Whales Invest another $18M as ETH Price Dips Below $3k - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFA1UnRFNnZ2eWpudzhwTVRoekZ5eWxiNlJKRGpBSGpyOW5UalhuMDR0TjJCZktONXRqU0t0M1BVOVZKa0JsYkd0emNDcXY1NmpVRFVRZUVzT2dFRzBDZXJYOFV2anFtelF2SFhxcjl1QVNNUHhDRjhDcjRwMXk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 May 2024 07:00:00 GMT",
        "title": "Feels Good Man: $BRETT Leads the Memecoin Charge on Coinbase Ethereum Layer 2 (L2) Blockchain Base - Yahoo Finance",
        "content": "Based Brett\n\nThe top memecoin and top ten coin overall on Base increases approaches $500 million in market cap, forecast for the rest of the year is even more bullish\n\nDUBAI, May 02, 2024 (GLOBE NEWSWIRE) -- Popular memecoin $BRETT continues to gather momentum in 2024 as the most popular memecoin and top ten most popular overall on Coinbase Ethereum Layer 2 (L2) blockchain Base, and now approaches $500 million in market cap. With continued community support and positive secondary indicators like crypto ETF approvals, futures trading for flagship memecoin Dogecoin on Coinbase Derivatives, and the anticipation of Bitcoin pricing eventually reaching 100,000 USD, $BRETT’s growth picture remains bullish.\n\n\n\n“We are seeing in real time how memes are not just an easy and funny way to share information on the internet, but to create almost immediate wealth by harnessing the power of these memes,” said $BRETT trader Crash. “This is the culmination of the grassroots financial movement of the past decade, from Bitcoin to r/WallStreetBets to now $BRETT, allowing people to escape the economic drudgery of living in The Matrix.”\n\nBase is Coinbase’s L2 built on OP Stack in collaboration with Optimism. Coinbase recently released new smart wallet technology built on Base, with $BRETT quickly becoming the most popular memecoin available for purchase there. Coinbase continues to be ambitious in its promotion of Base and the memecoins sold there, with plans to onboard over 1 billion users to the chain. Community response memecoins like $BRETT are also an easy way to boost early liquidity for the developers of new platforms on Base.\n\n\n\n\n\n\n\n$BRETT is one of the original characters of the Boy’s Club written by Matt Furie, the creator of the famous cartoon that has also inspired the popular Pepe meme and popular $PEPE memecoin. $BRETT involves a fixed total supply of 1 billion tokens, with a 6% transaction tax distributed to liquidity pools and burned tokens, aiming to reduce the overall supply and potentially increase the value over time.\n\n$BRETT continues to hold strong amid recent sideways market movement for memecoins. Even while most memecoins are down 50 percent, $BRETT has seen only about a 30 percent decrease.\n\nTo learn more, check out BRETT at:\n\nTg: https://t.me/basedbrett\n\nX: https://twitter.com/basedbrett\n\nWebsite: https://www.basedbrett.com/\n\nAbout $BRETT\n\nCheck out BRETT at:\n\nTg: https://t.me/basedbrett\n\nX: https://twitter.com/basedbrett\n\nWebsite: https://www.basedbrett.com/\n\n\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency & securities.\n\nStory continues\n\nCONTACT: Xenia von Wedel president TransformGroup 415-340-2792 brett (at) transformgroup.com\n\n\n\n"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFA1UnRFNnZ2eWpudzhwTVRoekZ5eWxiNlJKRGpBSGpyOW5UalhuMDR0TjJCZktONXRqU0t0M1BVOVZKa0JsYkd0emNDcXY1NmpVRFVRZUVzT2dFRzBDZXJYOFV2anFtelF2SFhxcjl1QVNNUHhDRjhDcjRwMXk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 May 2024 07:00:00 GMT",
        "title": "Feels Good Man: $BRETT Leads the Memecoin Charge on Coinbase Ethereum Layer 2 (L2) Blockchain Base - Yahoo Finance",
        "content": "Based Brett\n\nThe top memecoin and top ten coin overall on Base increases approaches $500 million in market cap, forecast for the rest of the year is even more bullish\n\nDUBAI, May 02, 2024 (GLOBE NEWSWIRE) -- Popular memecoin $BRETT continues to gather momentum in 2024 as the most popular memecoin and top ten most popular overall on Coinbase Ethereum Layer 2 (L2) blockchain Base, and now approaches $500 million in market cap. With continued community support and positive secondary indicators like crypto ETF approvals, futures trading for flagship memecoin Dogecoin on Coinbase Derivatives, and the anticipation of Bitcoin pricing eventually reaching 100,000 USD, $BRETT’s growth picture remains bullish.\n\n\n\n“We are seeing in real time how memes are not just an easy and funny way to share information on the internet, but to create almost immediate wealth by harnessing the power of these memes,” said $BRETT trader Crash. “This is the culmination of the grassroots financial movement of the past decade, from Bitcoin to r/WallStreetBets to now $BRETT, allowing people to escape the economic drudgery of living in The Matrix.”\n\nBase is Coinbase’s L2 built on OP Stack in collaboration with Optimism. Coinbase recently released new smart wallet technology built on Base, with $BRETT quickly becoming the most popular memecoin available for purchase there. Coinbase continues to be ambitious in its promotion of Base and the memecoins sold there, with plans to onboard over 1 billion users to the chain. Community response memecoins like $BRETT are also an easy way to boost early liquidity for the developers of new platforms on Base.\n\n\n\n\n\n\n\n$BRETT is one of the original characters of the Boy’s Club written by Matt Furie, the creator of the famous cartoon that has also inspired the popular Pepe meme and popular $PEPE memecoin. $BRETT involves a fixed total supply of 1 billion tokens, with a 6% transaction tax distributed to liquidity pools and burned tokens, aiming to reduce the overall supply and potentially increase the value over time.\n\n$BRETT continues to hold strong amid recent sideways market movement for memecoins. Even while most memecoins are down 50 percent, $BRETT has seen only about a 30 percent decrease.\n\nTo learn more, check out BRETT at:\n\nTg: https://t.me/basedbrett\n\nX: https://twitter.com/basedbrett\n\nWebsite: https://www.basedbrett.com/\n\nAbout $BRETT\n\nCheck out BRETT at:\n\nTg: https://t.me/basedbrett\n\nX: https://twitter.com/basedbrett\n\nWebsite: https://www.basedbrett.com/\n\n\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency & securities.\n\nStory continues\n\nCONTACT: Xenia von Wedel president TransformGroup 415-340-2792 brett (at) transformgroup.com\n\n\n\n"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxOcE5EUFdaVGVoSU9xbUhucDhHQXhUeFdGbXF2VEtEb2xIX09tSlZnSTBkLVN5Q2pFMjdYX2ZNVUxKdlVoQ2lJdEd3YmN3ZXhvbUVrcUVRTHduZVVXZWthOVlJT0hNOFRrN2YyWXRSYlR6Y1B1ZmNDTjlaWkZFbnlTMnBMbDhxTnBzaTFWQVlqR2FKcFczTXdUc3dSYWo?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 May 2024 07:00:00 GMT",
        "title": "Ethereum has burnt $12.7bn since the London hard fork. But that may be slowing down - DLNews",
        "content": "It's been 1,000 days since Ethereum first started burning transaction fees.\n\nBut the mechanism, which offsets new tokens issued on the network, is slowing down.\n\nMore efficient transactions, an explosion of activity on layer 2 networks, and the recent Dencun upgrade have all helped reduce the amount of Ether the network burns.\n\nWith the implementation of an upgrade known as EIP-1559 as part of the London hard fork in August 2021, Ethereum became the first blockchain to start burning a portion of the fees users spend on transactions.\n\nThat was 1,000 days ago.\n\nThe move, the blockchain’s faithful hoped, would help counterbalance the issuance of new Ether tokens on the network, creating a more sustainable monetary policy.\n\nAnd it worked. Over the following 1,000 days, Ethereum users have burnt some 4.3 million Ether, worth over $12.7 billion just by using the network.\n\nWhen Etherum slashed Ether emissions by switching to a proof-of-stake consensus mechanism in September 2022, the network became deflationary — meaning more Ether was, on average, burned by the network than new Ether was issued.\n\nBut in recent months the rate at which Ethereum is burning tokens is slowing.\n\nA combination of more efficient transactions, an explosion of activity on layer 2 networks, and the recent Dencun upgrade have all helped reduce transaction fees — and thus the amount of Ether the network burns.\n\nThe lower fees are great for users. But if Ethereum can’t attract enough activity to offset the drop, it could easily lose its deflationary status, potentially throwing its economic model into question.\n\nJoin the community to get our latest stories and updates\n\nWhy is the burn slowing?\n\nWhen Ethereum users transact on the network they must pay a fee denominated in Ether.\n\nThis fee is made up of two parts: a so-called base fee charged by the network, and a priority fee, paid to block builders as an incentive to get the transaction processed faster. Ethereum burns base fees, and gives priority fees to those processing transactions.\n\nWhen activity on Ethereum increases, the network automatically raises the base fee users must pay.\n\nThe average base fee on Ethereum must stay above 23 gwei these days to ensure the network burns enough Ether from transaction fees to keep it deflationary. Gwei is a measurement for small amounts of Ether.\n\nOver the past 1,000 days, gas fees have averaged 41 gwei. If this trend continues, Ethereum’s supply is set to shrink by 0.76% over the coming year.\n\nBut there’s reason to believe it might not.\n\nEthereum’s March 13 Dencun upgrade introduced a new feature that cut the fees Ethereum layer 2s needed to pay to submit transactions to the main Ethereum network by as much as 98%.\n\nSince Dencun, Ethereum’s transaction fees have fallen from an average of 58 gwei on March 13, to just 7 gwei on May 2.\n\nAdditionally, more users are making the jump from Ethereum to layer 2 networks — separate blockchains built on top of Ethereum that rely on it for security.\n\nAfter hitting an all-time high of over 11 million weekly transactions in 2021, transactions on Ethereum have slowly declined to around 8 million per week at the end of March.\n\nAt the same time, weekly transactions on Arbitrum and Optimism, the two biggest layer 2s, have soared to a combined 18.5 million.\n\nWith fewer users transacting on Ethereum, the demand for transactions — and thus fees paid on the network — is falling.\n\nIncreasing gas efficiency\n\nCode improvements that reduce the amount of data smart contracts on Ethereum need to handle, should also reduce fees in the coming months.\n\nFor example, decentralised exchange Uniswap, the most frequently used Ethereum DeFi protocol which users have spent over $1.4 billion in fees transacting on, has included several optimisations for its upcoming Uniswap v4 version.\n\nV4 is expected to improve gas efficiency between swaps and liquidity operations, as well as reduce the cost of creating new liquidity pools by 99%.\n\nFuture versions of other top Ethereum protocols will likely also optimise for transaction fees.\n\nTim Craig is a DeFi Correspondent at DL News. Got a tip? Email him at tim@dlnews.com."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxOTTVHcnZPVTUzLXM2S2I1QlR6eTB1X25TUlAtSDMwX1BnTV93cG1Uc3MwU3NORHlCWlZ4SERSTGxtaUNjX0hpZTU1YXZJdThabldLdm13LVJVQ1RpbU5BVWRtZ1pHVGltOU9KQ2MtSUswN2Y5TkxJOVdYREwxVEtmZDhIV2ZOWGtSaWRYOFlxRkRJdjZ5c01z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 May 2024 07:00:00 GMT",
        "title": "Why Bitcoin, Ethereum, and Dogecoin Surged Today - The Motley Fool",
        "content": "Risk assets across the board got a boost from the Fed, with these three tokens seeing market-beating upside.\n\nThe cryptocurrency sector is getting a nice boost today from yesterday's commentary from Federal Reserve Chairman Jerome Powell. The market received a jolt from Powell's commentary in a press release; he suggested the direction of the next Fed move will most likely be lower. The market had previously priced in some chance of an interest rate hike, which appears to be off the table, at least for now.\n\nWith a more accommodative monetary policy environment likely ahead, risk assets across the curve saw a big boost over the past 24 hours. Of course, the further out on the risk curve investors go, the more protracted this move can be. For top cryptos Bitcoin (BTC -3.28%), Ethereum (ETH -2.30%), and Dogecoin (DOGE -7.20%), it's meant a 24-hour move of 3.8%, 2.2%, and 4%, respectively, as of 4 p.m. ET Thursday.\n\nAdditionally, there are some token-specific factors at play with these three tokens that investors appear to be pricing in today. Let's dive into what's moving these closely watched digital assets.\n\nThe rally continues\n\nSince hitting a new all-time high right around the time of its most recent halving, Bitcoin's rally has faltered. Expectations for a potential continuation of this fall had taken hold because of economic factors that could affect the world's largest cryptocurrency.\n\nBut with interest rate hikes seemingly off the table, analysts have grown increasingly bullish on Bitcoin over the near and medium term. Lower interest rates should bring the U.S. dollar down, inflating the price of various commodities and goods that act as stores of value. For those who buy into this thesis for Bitcoin, that's a great thing. Indeed, yesterday's press conference likely had the greatest impact on Bitcoin for this very reason.\n\nEthereum's status as a commodity or store of value of sorts is also debatable. In second position in terms of market capitalization in this sector, Ethereum should benefit from a similar trend of capital flowing into cryptocurrencies that Bitcoin investors have benefited from. That's because the market is still expecting the Securities and Exchange Commission to approve spot Ethereum ETFs at some point (though some suggest it's possible the SEC could still deem this asset a security), which should improve the supply and demand dynamics around this token. As Ethereum has shifted to a proof-of-stake protocol and taken on some deflationary measures for its token, there's a strong bull case building in the market that the same drivers that took Bitcoin on its run to record highs could be in play for Ethereum this year.\n\nDogecoin remains among the most speculative crypto assets out there, meaning it's a top choice for traders and investors looking to play short-term price swings in the market. It's no surprise that Dogecoin has seen a more pronounced move than its larger peers, for this reason alone. However, large liquidation data tied to a previous decline in these three tokens in recent days could also play a part in today's rally. Investors appear to have been looking for any reason to load up on risk and put capital to work on this dip. This recent macro catalyst appears to have provided the needed push.\n\nIs this rally poised to continue?\n\nToday's move needs to be put into context. Bitcoin declined to a low of around $58,000 per token yesterday, and while it's moving toward the $60,000 mark at the time of writing, that's still well off its all-time high of around $73,000 hit earlier this year. So, there's certainly both upside and downside potential in the near term, as this token did gap up quite quickly in short order.\n\nOther cryptocurrencies like Ethereum and Dogecoin tend to follow Bitcoin's lead, so I'd say this is the token most investors should be focused on right now. I'm of the view that if a number of bullish catalysts materialize in the coming days, it's entirely possible Bitcoin could make another run at a new high, and Ethereum and Dogecoin could follow. It's just a question of whether this specific macro catalyst can be amplified by some additional news. Right now, there's not much on my radar, so I'm going to sit out this recent pop."
    }
]