[
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxPeXhwem5oQVJ4bHdRTHVIbU1oNnpCbUdGRndkbVZEQXFKZE8tQi1JYTlhYlBranVFTV91MktTZG45dWNmV2V5TjdCRW15VUFYNE5ETllMTk9nX0tvU3VTS19VQThqVWhTWG52Zjk0T1dNUzJtdmY0RldNMTZRNEQxUXdsbkJzQjZCa2VOdFEwMkd6VHFDbTFoUXFjQjM0dVJmaWF6UVZybVDSAa4BQVVfeXFMUFZhS2ZtckM5Z3FDOUxDTGI0OGRkckJ2NFVicU5rU2dqc3Bad3RVVzROOHdfRkpZckJfTnVVSmtmbThvejhkY1F2ckRra3ZzSmtzZmI2TlVDUkx6ZlJFT19xYU14TkpkRVBYY1o0X3ItREFnRnozOFBaT3VZVVRwTDV1YUZlY2RyUUQ2U0pqNUNIcXhpaW9ZOUFvTDQ4dlo0R3hhb010anpObkFDMmtR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 May 2024 07:00:00 GMT",
        "title": "Ethereum Developers Target Ease of Crypto Wallets With 'EIP-3074' - CoinDesk",
        "content": "The key difference between EIP-3074 and ERC-4337 is that “the former focuses on getting all the benefits of execution abstraction, and the latter focuses on getting all the benefits of account abstraction on all EVM chains but in a non-native way that is less efficient,” Ethereum Foundation developer Yoav Weiss writes . “Both are steps to get some of the benefits of full native account abstraction.”"
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxPYVdkc200RG85ZloybkJPTU4xa0Y0ZnNTckVTQ2J4eThTTGhZTUVaMzFpR3l1NHVSWE5tV1d2OXpYaG5oN2Vkb2J2VUJ0QW91clBwSFFkT2pTLU5DOUs2bldzZVF0eFo1NmdYTFlmWDBmMkZJanYzdVp1ZlYyT0ZRWWQ2MDdaTFQ1YnpSSjNEeHZNTE8wRDlIX3dlbVlIV1Brb0NncWxHU19rZENKQ3JVVFJ4b1I4dzJreXNMenhicDl2SURzRDlOU0F1bXBPa3JuenkwOER2bGhBdWw3NXUzVmJUc2lvRUFX?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 May 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum, Dogecoin Lose Ground, Cannot Back Up Friday's ETF Flows Inflows: 'Bitcoin Is The Escape Hatch' - Benzinga",
        "content": "Cryptocurrency markets could not continue their uptrend initiated by surprisingly strong ETF data on Friday.\n\nWhat Happened: Major cryptocurrencies are trading lower at the time of writing:\n\nPrices as of 4 p.m. Eastern Time:\n\nCryptocurrency Gains +/- Price Bitcoin BTC/USD -1.18% $63,119.77 Ethereum ETH/USD -2.5% $3,065.67 Solana SOL/USD +4.8% $153.09 Dogecoin DOGE/USD -3.1% $0.1571 Shiba Inu SHIB/USD -3% $0.00002399\n\nNotable Statistics:\n\nIn the past 24 hours, 66,592 traders were liquidated. Total liquidations tallied $189.94 million, with $158.2 million coming in the past 12 hours.\n\nBloomberg analyst Eric Balchunas points out that more than 95% of ETF investors “HOLD-ed” during the “nasty and persistent downturn.”\n\npoints out that more than 95% of ETF investors “HOLD-ed” during the “nasty and persistent downturn.” Total exchanges outflows witnessed a significant drop from $883.03 million to $453.2 million in single day.\n\nMichael Saylor's MicroStrategy holds 214,400 Bitcoin, worth $13.6 billion, which is more than any country.\n\nNotable Developments:\n\nTop Losers:\n\nCryptocurrency Gains +/- Price Bonk BONK/USD -6.4% $0.00002507 Conflux CFX/USD -5.3% $0.2195 Nervos Network CKB/USD -5% $0.01819\n\nAlso Read: Sell Bitcoin In May And Go Away? Here’s How How You Could Have Pocketed A 1,449% Cumulative Return\n\nAnalyst Notes: Heavily followed Bitcoin expert Max Keiser, in his latest tweet, commented how the U.S. is “killing the dollar” through a Bitcoin speculative attack. He wrote that the U.S. economy is no longer competitive and Bitcoin is “the escape hatch.\"\n\nHow the US is killing the $USD via a #Bitcoin speculative attack.\n\n\n\n1. The US economy is no longer competitive, thanks in part to the presence of #Bitcoin — and the gov is filling that hole with money printing.\n\n\n\n2. Money printing is driving up inflation & interest rates;… — Max Keiser (@maxkeiser) May 6, 2024\n\nWhat’s Next: The influence of Bitcoin as an institutional asset class is expected to be thoroughly explored at Benzinga’s upcoming Future of Digital Assets event on Nov. 19.\n\nRead Next: Bitcoin ‘Could Still Have A Correction Down,’ Cautions Lark Davis: ‘Let’s Not Get Ahead Of Ourselves’\n\nThis content was partially produced with the help of AI tools and was reviewed and published by Benzinga editors.\n\nImage created using artificial intelligence with Midjourney."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxPYVdkc200RG85ZloybkJPTU4xa0Y0ZnNTckVTQ2J4eThTTGhZTUVaMzFpR3l1NHVSWE5tV1d2OXpYaG5oN2Vkb2J2VUJ0QW91clBwSFFkT2pTLU5DOUs2bldzZVF0eFo1NmdYTFlmWDBmMkZJanYzdVp1ZlYyT0ZRWWQ2MDdaTFQ1YnpSSjNEeHZNTE8wRDlIX3dlbVlIV1Brb0NncWxHU19rZENKQ3JVVFJ4b1I4dzJreXNMenhicDl2SURzRDlOU0F1bXBPa3JuenkwOER2bGhBdWw3NXUzVmJUc2lvRUFX?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 May 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum, Dogecoin Lose Ground, Cannot Back Up Friday's ETF Flows Inflows: 'Bitcoin Is The Escape Hatch' - Benzinga",
        "content": "Cryptocurrency markets could not continue their uptrend initiated by surprisingly strong ETF data on Friday.\n\nWhat Happened: Major cryptocurrencies are trading lower at the time of writing:\n\nPrices as of 4 p.m. Eastern Time:\n\nCryptocurrency Gains +/- Price Bitcoin BTC/USD -1.18% $63,119.77 Ethereum ETH/USD -2.5% $3,065.67 Solana SOL/USD +4.8% $153.09 Dogecoin DOGE/USD -3.1% $0.1571 Shiba Inu SHIB/USD -3% $0.00002399\n\nNotable Statistics:\n\nIn the past 24 hours, 66,592 traders were liquidated. Total liquidations tallied $189.94 million, with $158.2 million coming in the past 12 hours.\n\nBloomberg analyst Eric Balchunas points out that more than 95% of ETF investors “HOLD-ed” during the “nasty and persistent downturn.”\n\npoints out that more than 95% of ETF investors “HOLD-ed” during the “nasty and persistent downturn.” Total exchanges outflows witnessed a significant drop from $883.03 million to $453.2 million in single day.\n\nMichael Saylor's MicroStrategy holds 214,400 Bitcoin, worth $13.6 billion, which is more than any country.\n\nNotable Developments:\n\nTop Losers:\n\nCryptocurrency Gains +/- Price Bonk BONK/USD -6.4% $0.00002507 Conflux CFX/USD -5.3% $0.2195 Nervos Network CKB/USD -5% $0.01819\n\nAlso Read: Sell Bitcoin In May And Go Away? Here’s How How You Could Have Pocketed A 1,449% Cumulative Return\n\nAnalyst Notes: Heavily followed Bitcoin expert Max Keiser, in his latest tweet, commented how the U.S. is “killing the dollar” through a Bitcoin speculative attack. He wrote that the U.S. economy is no longer competitive and Bitcoin is “the escape hatch.\"\n\nHow the US is killing the $USD via a #Bitcoin speculative attack.\n\n\n\n1. The US economy is no longer competitive, thanks in part to the presence of #Bitcoin — and the gov is filling that hole with money printing.\n\n\n\n2. Money printing is driving up inflation & interest rates;… — Max Keiser (@maxkeiser) May 6, 2024\n\nWhat’s Next: The influence of Bitcoin as an institutional asset class is expected to be thoroughly explored at Benzinga’s upcoming Future of Digital Assets event on Nov. 19.\n\nRead Next: Bitcoin ‘Could Still Have A Correction Down,’ Cautions Lark Davis: ‘Let’s Not Get Ahead Of Ourselves’\n\nThis content was partially produced with the help of AI tools and was reviewed and published by Benzinga editors.\n\nImage created using artificial intelligence with Midjourney."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxPc2VETWdQb2V3alhHdnhGazB3cS1pQk16VS1ILTBTR1B3TXZfalc4MWRrakdCU3ZnZUVSVmtXazZjT0MwOHBodjVobktzSnhIblpjdnZpbl92Y09oVE5NcjM2ckt1TVFlcjJqcmxPblVJOXl0WXg4ZGxKb25iaEZUMW11N2thT0ctWGdxTjhVa2g2YUhndWpBTVNLSWttakZJZXh5ag?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 May 2024 07:00:00 GMT",
        "title": "Bitcoin and Ethereum bounce back after week of brutal losses — here’s why - DLNews",
        "content": "Crypto markets flipped bullish after last week’s carnage.\n\nFed Chair Powell said rate hike is “unlikely.”\n\nHigh inflation and unemployment worries have passed, says analyst.\n\nCrypto markets have recouped losses after last week’s crash, which saw Bitcoin fall as low as $56,000.\n\nThe renewed bullishness comes amid slowing job growth — a possible sign of easing inflation — and hopes of rate cuts later this year.\n\nToday, the largest cryptocurrency is back trading at just above $65,000. The second-largest Ethereum is up 11% since its low last Wednesday.\n\nOverall, the wider cryptocurrency market added some $200 billion, according to CoinGecko, since Federal Reserve Chair Jerome Powell spoke on May 1.\n\nHe signalled that a rate hike — when the central bank raises interest rates and increases borrowing costs for banks and businesses — would be “unlikely.”\n\nStill, “the coast is far from clear” for the Federal Reserve to begin lowering interest rates soon, according to Noelle Acheson, author of the “Crypto is Macro Now” newsletter.\n\nInterest rates in the United States have risen to record highs as the Federal Reserve combats rampant inflation stoked by the COVID-19 pandemic. High interest rates also increase the amount people earn on their bank holdings, another incentive to keep cash rather than spend it.\n\nRate hikes are thus less beneficial for stocks and riskier investments like cryptocurrencies, as seen in last week’s dramatic drop in Bitcoin and Ethereum.\n\nJoin the community to get our latest stories and updates\n\nIn the first quarter, economic growth in the US slowed to its lowest level in nearly two years. The deceleration was partly attributed to a moderation in consumer spending and a widening trade deficit, or when a country imports more goods than it exports.\n\nWhen rates are higher, business loans become more expensive, which discourages owners from expanding or hiring. The ripple effects can slow the wider economy as well.\n\nRecent employment data released Friday, for instance, revealed the slowest job growth in six months and lower than the average monthly gain over the last year.\n\nStagflation concerns ‘behind us’\n\nHigh unemployment combined with inflation and slowed economic activity would spell even more trouble for Powell.\n\nPowell’s key objective these days is to avoid stagflation, an economic climate in which the economy continues to face high inflation while in a recession.\n\nAccording to crypto venture capital firm Ryze Labs, that situation looks less likely to occur.\n\n“With rate hikes off the table and markets already pricing in little to no cuts for 2024, we think this bodes constructively for risk assets,” Ryze Labs analysts told DL News.\n\n“The worst of stagflationary headwinds might be behind us,” they said.\n\nCrypto market movers\n\nBitcoin rose by 2.6% in the past 24 hours and is trading at $65,200.\n\nEthereum jumped 1.9% to $3,200.\n\nWhat we’re reading\n\nSebastian Sinclair is a markets correspondent for DL News. Have a tip? Contact Seb at sebastian@dlnews.com."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxOQl9IVzFBZy1wd0VUWXNsZFBOTml6UTczeHprU1hMWVV6aldPOEkyN0R0SDFNbF9nM2U5T21GMC04bnl3c3hET0gwVEdXYVVkYnhaOU1nOFN0XzVfTE5KUk5ubWdMekMxSnMyREY3UTZrdEVjeFV5aWNIcEl4MVYzWW9TbTg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 May 2024 07:00:00 GMT",
        "title": "Battle for Ethereum ETFs turns messy in the US — what’s next? - crypto.news",
        "content": "Michael Saylor thinks they won’t launch at all, and even some fund issuers think it’s unlikely this year. Meanwhile, other countries are gaining a first-mover advantage.\n\nThe battle to launch exchange-traded funds based on Ethereum’s spot price in the U.S. is heating up — and so far, the journey looks similar to Bitcoin’s long and messy road to approval.\n\nOnce again, the U.S. Securities and Exchange Commission is dragging its heels on offering a definitive answer to the applications already made. A green light matters because it would allow investors to gain exposure to ETH without owning the underlying asset.\n\nGrayscale and Franklin Templeton were both due to receive a response from the SEC in April, but the regulator’s now pushed their deadlines back to June.\n\nFidelity and BlackRock have had similar applications kicked into the long grass as well. VanEck and ARK Invest are due to receive a response later this month, but hopes of approval have been dwindling fast.\n\nWhy? Because there are signs that the regulator believes that Ether is a security, and not a commodity like Bitcoin.\n\nYou might also like: What’s next for global finance?\n\nA growing dispute\n\nBack in June 2023, speaking in front of the House Financial Services Committee, SEC chair Gary Gensler had refused to say whether he believes ETH is a security.\n\nThe lack of a clear answer had spooked the crypto industry — especially considering this contradicted earlier guidance made by his predecessor Jay Clayton.\n\nAnd even earlier than that, around the time of The Merge in September 2022, Gensler had hinted that the staking process may fall under securities rules.\n\nEther’s status matters because it determines which organization holds regulatory oversight in the U.S. — and if it is a security, this could cause big problems for other altcoins.\n\nConsensus recently sued the SEC and leapt to Ethereum’s defense — arguing the commission’s “unlawful power grab threatens to undermine America’s position as a leader of the next generation of the internet.”\n\nThe Case for #Bitcoin on the Corporate Balance Sheet pic.twitter.com/LcZ4V2nqV0 — Michael Saylor⚡️ (@saylor) May 3, 2024\n\nSaylor’s prediction\n\nMicroStrategy’s executive chairman Michael Saylor, a vocal Bitcoin supporter who spearheaded efforts to add hundreds of thousands of BTC to the company’s balance sheet, doesn’t believe that ETFs based on ETH’s spot price will ever see the light of day. Speaking at the annual Bitcoin for Corporations event, he warned:\n\n“Some time this summer, it’ll be very clear to everyone that Ethereum is deemed a cryptoasset security, not a commodity. After that, you’re gonna see that Ethereum, BNB, Solana, Ripple, Cardano — everything down the stack — is just a cryptoasset security unregistered. None of them will ever be wrapped by a spot ETF, none of them will be accepted by Wall Street, none of them will be accepted by mainstream institutional investors as cryptoassets. [Bitcoin] is the one universal, consensus accepted, institutional-grade cryptoasset in the world. There won’t be another one.” Michael Saylor\n\nOf course, you could argue that Saylor was bound to say this — especially considering that he believes BTC is the only cryptocurrency that is technically and ethically sound. Speaking at the Blockchain Economy Istanbul Summit back in July 2022, he had warned that Ether’s continual upgrades “introduce new attack surfaces” that undermine security and reliability.\n\nWhat happens next?\n\nThe bigger challenge now appears to be that there’s a lack of dialog between the SEC and firms hoping to bring an Ether ETF to market. As Barron’s reported last month, applicants aren’t being given “the critical feedback needed to finalize their products.” By contrast, BTC ETF issuers had engaged in a “robust back-and-forth” before their funds started trading.\n\nJan van Eck, whose eponymous investment firm is awaiting a verdict from the SEC, candidly told CNBC in April that he believes the application will “probably be rejected” — while Jean-Marie Mognetti from CoinShares predicted that no approvals will happen in 2024.\n\nWhile the U.S. continues to be paralyzed by regulatory uncertainty, where a lack of clarity on Ether’s status is leaving crypto firms exasperated, other jurisdictions are gaining a first-mover advantage.\n\nAlthough trading volumes were rather tepid on the first day, it remains significant that Hong Kong has now launched an ETH ETF, amid speculation this could one day open the door to investors from mainland China.\n\nAs S&P Global recently noted, funds based on Ether’s spot price have already been approved in Canada, Switzerland, Sweden and Germany — with some offering additional yield by offering staking returns as well.\n\nWith ETFs in other territories now boasting billions of dollars in assets under management, the U.S. risks falling further and further behind."
    }
]