[
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxOQnU1VTV2MUItZnpIUjdhS3RGbHI0S2NGV3JyZGRrVmRyeDUtT1VpU3RHTE5saDc4TU9UNXk4Y0hrSzEzRjZBMkhoRWd1Tkx3QlhJVWViWFcxMEZCajFrVTNDSl9sYl9mamx2ZS1SZkFmN1Vrd1RXYWNoRUphNkZWMVBZU2FrcDZtRjBSbllqOW9tNXNadkxrUTBwdUJOR1h2bWlOdVBIMjNseWpqaXEwUFJ3TDNpdWhGUG9jc2pn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Price Forecast: ETH Investors make $620M move after BTC Halving - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxPSWRhWV9mUTZQaVB5NjFNSWlZcFpZUUtNdVFjWjBYUldpVFM4UEdzNVd0VkpRdUptWHVKeVJQV1pzeFprQnBBUTdOZFJtc2ZSZXAwamZnUVhJTjNjRkw4UmZEd0tkUkNmVG5OT016dnFPYThodkhYSDRQWHJxaTJYS19HVWFzbWpXTU9PbHg4cHNtVjhybDlJ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Apr 2024 07:00:00 GMT",
        "title": "Movement Labs Secures $38M for Ethereum L2 Development - Crypto Times",
        "content": "Movement Labs successfully raises $38 million in Series A funding, driven by the leadership of Polychain Capital. The investment will fuel the development of Movement L2, a cutting-edge layer-2 blockchain that promises enhanced security and efficiency for Ethereum transactions.\n\nThis initiative leverages the Move programming paradigm, initially developed by Facebook, to offer a robust alternative to traditional blockchain environments.\n\nFounders Rushi Manche and Cooper Scanlon, young visionaries and former Vanderbilt students, are at the forefront of this innovative venture. They aim to integrate the Move Virtual Machine into Ethereum’s expansive ecosystem. This move is anticipated to reduce transaction costs while boosting transaction processing speeds.\n\ngmove.\n\n\n\nemotional day for us at movement labs across all verticals as we announce our $38M series A,\n\n\n\nbefore we get into it, i want to talk a bit about where we came from 1/ — rushi (@rushimanche) April 25, 2024\n\nAddressing Industry Challenges\n\nThe drive for adopting Move stemmed from the persistent security challenges within the blockchain sector. Historical data reveals that between 2022 and 2023, hackers exploited vulnerabilities in smart contracts to siphon off approximately $5.4 billion across various protocols.\n\nMovement Labs’ new Ethereum Virtual Machine (EVM) is designed to mitigate such risks by allowing developers to deploy verified code, preventing prevalent attack vectors like reentrancy attacks.\n\nAdditionally, the Move programming language incorporates techniques such as parallelization to manage multiple transaction streams effectively. This feature fortifies the network against potential security threats.\n\nThe funding round drew support from multiple venture capital firms, indicating strong confidence in Movement Labs’ approach to blockchain security. Participants included notable names like Hack VC, Placeholder, and Aptos Labs. These partnerships underscore a collective commitment to advancing secure and efficient blockchain technology.\n\nMovement Labs is poised to launch the testnet phase of Movement L2 this summer, marking a milestone in their journey towards a decentralized and secure blockchain infrastructure. The introduction of the Move Stack and a shared sequencer further illustrates the company’s dedication to innovation and scalability in blockchain technology.\n\nBy prioritizing decentralization from the outset, Movement Labs sets a new standard for layer-2 networks. This strategic direction enhances Ethereum’s security and functionality and supports the broader adoption of blockchain technology across various sectors."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxPR25YanJmVFJkZVNWcmlYNTk2eElLMVZBMDBWTWhBTGdTM3R5NFgyMWNia1l1aE96WlRLTVNwTlZ4bWlWZl82X295RnZBeWsxcUhhSlM1cnNtdGpadHZiMmtxeHB1QmYzRE1kY0QwQ1AxUkVJMDBIQmRTeTRJRzNxYWFYTG5vY0k5WVltMDd1Qmx6cjRpWWZoTHhXN1NuM2w2YkJFdldaVkF6Z0E0b3lacy1GZngxRFJtUmJiVUVlcHBEaE1qLU40Y3RFcV9FTVhyRVZpbjQ4ZE5VSUNOVjl0WTdsNXlxZXBj?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Apr 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum, Dogecoin On Shaky Ground, Crypto Veteran Sees 'Bitcoin Still Stuck In Range' - Benzinga",
        "content": "Cryptocurrency markets are trading down on Friday, alongside a drop in total short crypto liquidations to the lowest levels since February 2024. One week after the Bitcoin Halving, exchange net flows for Bitcoin witnessed a major drop of 227% to $114 million.\n\nWhat Happened: Crypto markets experienced a shaky Friday late evening, with Bitcoin BTC/USD, Ethereum ETH/USD, and Dogecoin DOGE/USD trading in the red. Global concerns, such as the Japanese yen’s tumble to a fresh 34-year low against the U.S. dollar, weighed on the stock and crypto markets.\n\nPrices as of 4 p.m. Eastern Time:\n\nCryptocurrency Gains +/- Price Bitcoin BTC/USD -1.4% $63,876.32 Ethereum ETH/USD -1.1% $3,139.89 Dogecoin DOGE/USD -2.2% $0.1497\n\nA development on the Asian market will see Chinese investors with a Hong Kong residence permit allowed to buy shares in the Hong Kong ETFs. The global cryptocurrency market cap now stands at 2.36 trillion, down 1.07% in the past 24 hours. In the same period, 48,733 traders were liquidated, with total liquidations reaching 119.34 million.\n\nNotably, crypto short liquidations as of April 26 at 3:30 pm ET stood at the lowest since February 2024, at $24.96 million. IntoTheBlock data highlights that Bitcoin exchange’s net flows dropped significantly by 226.6% to 114.4 million, while large transaction volumes narrowed by 23.6% to $37.98 billion.\n\nTop Losers\n\nCryptocurrency Gains +/- Price Wormhole (CRYPTO: W) -10.0% $0.5994 Pendle PENDLE/USD -9.9% $5.44 Arweave AR/USD -8.0% $8.22\n\nAlso Read: Bitcoin’s Consolidation Is The ‘Calm Before The Storm,’ Veteran Trader Lark Davis Writes\n\nAnalyst Notes: Crypto veteran trader Michaël van de Poppe states that Bitcoin is still stuck in a range. However, he expects altcoins to perform better.\n\n#Bitcoin is still stuck in a range.\n\n\n\nI don't think we'll see much happening from here for the coming 3-6 months.\n\n\n\nSlow sideways, perhaps a grind.\n\n\n\nExpecting way more from #Altcoins. pic.twitter.com/akiD1uhTCU — Michaël van de Poppe (@CryptoMichNL) April 26, 2024\n\nHeavily-followed meme coin analyst and trader Murad shared potential price targets to determine whether the current range is accumulation or distribution.\n\nMy current base thinking on $BTC\n\n\n\nExpecting continued chop suey in the purple box into the Summer\n\n\n\nIn that box, you have to look for clues whether this is re-accumulation or re-distribution\n\n\n\nRe-accumulation –> 100K\n\n\n\nRe-distribution –> 52K or 42K or 32K\n\n\n\nBrush up on Macro pic.twitter.com/6YHvPoaG47 — Murad (@MustStopMurad) April 26, 2024\n\nCrypto trader Tim estimates that the “crypto market will be much higher” and is holding his entire portfolio. He states, “If the ship goes down, I’ll join you, but I think we’ll go higher after May, and this is a consolidation phase before the next leg up.” He strongly reaffirms that in all scenarios, crypto is here to stay and will grow.\n\nWhat’s Next: These topics are expected to be thoroughly explored at Benzinga’s upcoming Future of Digital Assets event on Nov. 19.\n\nRead Next: Arthur Hayes: Bitcoin Bull Market Not Over, Urges Investors To ‘Left Curve It’\n\nImage created using artificial intelligence with Midjourney."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxPR25YanJmVFJkZVNWcmlYNTk2eElLMVZBMDBWTWhBTGdTM3R5NFgyMWNia1l1aE96WlRLTVNwTlZ4bWlWZl82X295RnZBeWsxcUhhSlM1cnNtdGpadHZiMmtxeHB1QmYzRE1kY0QwQ1AxUkVJMDBIQmRTeTRJRzNxYWFYTG5vY0k5WVltMDd1Qmx6cjRpWWZoTHhXN1NuM2w2YkJFdldaVkF6Z0E0b3lacy1GZngxRFJtUmJiVUVlcHBEaE1qLU40Y3RFcV9FTVhyRVZpbjQ4ZE5VSUNOVjl0WTdsNXlxZXBj?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Apr 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum, Dogecoin On Shaky Ground, Crypto Veteran Sees 'Bitcoin Still Stuck In Range' - Benzinga",
        "content": "Cryptocurrency markets are trading down on Friday, alongside a drop in total short crypto liquidations to the lowest levels since February 2024. One week after the Bitcoin Halving, exchange net flows for Bitcoin witnessed a major drop of 227% to $114 million.\n\nWhat Happened: Crypto markets experienced a shaky Friday late evening, with Bitcoin BTC/USD, Ethereum ETH/USD, and Dogecoin DOGE/USD trading in the red. Global concerns, such as the Japanese yen’s tumble to a fresh 34-year low against the U.S. dollar, weighed on the stock and crypto markets.\n\nPrices as of 4 p.m. Eastern Time:\n\nCryptocurrency Gains +/- Price Bitcoin BTC/USD -1.4% $63,876.32 Ethereum ETH/USD -1.1% $3,139.89 Dogecoin DOGE/USD -2.2% $0.1497\n\nA development on the Asian market will see Chinese investors with a Hong Kong residence permit allowed to buy shares in the Hong Kong ETFs. The global cryptocurrency market cap now stands at 2.36 trillion, down 1.07% in the past 24 hours. In the same period, 48,733 traders were liquidated, with total liquidations reaching 119.34 million.\n\nNotably, crypto short liquidations as of April 26 at 3:30 pm ET stood at the lowest since February 2024, at $24.96 million. IntoTheBlock data highlights that Bitcoin exchange’s net flows dropped significantly by 226.6% to 114.4 million, while large transaction volumes narrowed by 23.6% to $37.98 billion.\n\nTop Losers\n\nCryptocurrency Gains +/- Price Wormhole (CRYPTO: W) -10.0% $0.5994 Pendle PENDLE/USD -9.9% $5.44 Arweave AR/USD -8.0% $8.22\n\nAlso Read: Bitcoin’s Consolidation Is The ‘Calm Before The Storm,’ Veteran Trader Lark Davis Writes\n\nAnalyst Notes: Crypto veteran trader Michaël van de Poppe states that Bitcoin is still stuck in a range. However, he expects altcoins to perform better.\n\n#Bitcoin is still stuck in a range.\n\n\n\nI don't think we'll see much happening from here for the coming 3-6 months.\n\n\n\nSlow sideways, perhaps a grind.\n\n\n\nExpecting way more from #Altcoins. pic.twitter.com/akiD1uhTCU — Michaël van de Poppe (@CryptoMichNL) April 26, 2024\n\nHeavily-followed meme coin analyst and trader Murad shared potential price targets to determine whether the current range is accumulation or distribution.\n\nMy current base thinking on $BTC\n\n\n\nExpecting continued chop suey in the purple box into the Summer\n\n\n\nIn that box, you have to look for clues whether this is re-accumulation or re-distribution\n\n\n\nRe-accumulation –> 100K\n\n\n\nRe-distribution –> 52K or 42K or 32K\n\n\n\nBrush up on Macro pic.twitter.com/6YHvPoaG47 — Murad (@MustStopMurad) April 26, 2024\n\nCrypto trader Tim estimates that the “crypto market will be much higher” and is holding his entire portfolio. He states, “If the ship goes down, I’ll join you, but I think we’ll go higher after May, and this is a consolidation phase before the next leg up.” He strongly reaffirms that in all scenarios, crypto is here to stay and will grow.\n\nWhat’s Next: These topics are expected to be thoroughly explored at Benzinga’s upcoming Future of Digital Assets event on Nov. 19.\n\nRead Next: Arthur Hayes: Bitcoin Bull Market Not Over, Urges Investors To ‘Left Curve It’\n\nImage created using artificial intelligence with Midjourney."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxOSjdnMWRBQm55d1YtcTFFc0NkSWc5bE9LWlBqS2V6blMyMjJ5SzNQRVVRcGJHOGdFYWVDTUxfQk1GQnRFRTVZTng4Q1NqeW1qVmlrYldCdThwdXRKb0NzWGV1WDdRVW9XSTJjS1lFeEd3RmJXU3EyaG9tYWZoazJvX09kWXA4cGtUc3RkRGl5R3dPN0x5Q1ZKR2pjcG81UUYzeUw4dUdn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Apr 2024 07:00:00 GMT",
        "title": "Consensys sues to stop SEC from ‘seizing control of Ethereum’ and damaging MetaMask - DLNews",
        "content": "Crypto stalwart joins industry offensive regulator moves to legally define Ethereum.\n\nSEC signalled it is poised to make a move on MetaMask.\n\nStaking is new front in legal war between DeFi and Washington.\n\nConsensys has joined the anti-SEC brigade.\n\nOn Thursday, Consensys, the company behind the popular crypto wallet MetaMask, sued the US Securities and Exchange Commission for allegedly waging a “campaign to seize control over the future of cryptocurrency.”\n\nThe firm, which is led by Ethereum co-founder Joe Lubin, has locked arms with Coinbase, Greyscale, and the Blockchain Association in the vanguard of crypto industry stalwarts that have challenged the agency’s three-year campaign to clamp down on digital assets.\n\nIn the process, Consensys hopes to protect its own position and one of its crown jewels — MetaMask, a wallet provider with 30 million users.\n\nAd hoc enforcement\n\nConsensys alleged the SEC is unlawfully deploying “ad hoc enforcement actions against Consensys and others.”\n\nIn its lawsuit, which was filed in federal court in Texas, Consensys said the SEC is trying to legally define Ethereum as a security.\n\nThe move alarms industry players because it would force projects to register Ethereum-linked tokens the same way traditional firms do with stocks and bonds.\n\nFor the crypto community, this is anathema because they consider blockchain-based assets as a separate class that deserves its own statutory regime, and rules and regulations. This idea is at the heart of Coinbase’s defence against a lawsuit brought last year by the SEC.\n\nJoin the community to get our latest stories and updates\n\n“The SEC’s unlawful seizure of authority over ETH would spell disaster for the Ethereum network, and for Consensys,” read the complaint.\n\nNew front\n\nStaking has opened a new front in the battle between the SEC and the industry since Ethereum switched to a Proof of Stake consensus method for maintaining its blockchain in 2022.\n\nThe SEC has been on a warpath to define Ethereum as a security ever since the network introduced staking that year.\n\nStaking refers to earning rewards from a blockchain network by locking up a cryptocurrency to support the network’s validating nodes.\n\nA person familiar with the case explained that the crypto company had considered several options before moving to file.\n\nCertain elements of the SEC’s investigation into the Ethereum protocol compelled Consensys to defend itself and the ecosystem before the Commission did any real damage, the person said.\n\nConsensys’ complaint came after the SEC notified it was preparing to sue the firm over MetaMask, one of the industry’s most widely used crypto wallets.\n\nThe SEC alleged in its notification that given MetaMask’s “swap” and “stake” features, which let users trade cryptocurrencies and earn rewards on their holdings, Consensys is operating as an unlicensed broker-dealer, according to the filing.\n\n‘Ethereum is not a security’\n\nConsensys says the non-custodial wallet is akin to a web browser rather than a trading platform like an exchange.\n\n“Any investigation or enforcement action premised on Consensys operating as a ‘broker’ under the Exchange Act through its MetaMask wallet software would exceed the SEC’s authority,” said the complaint.\n\nThe crypto firm is asking the court to find that Ethereum is not a security, a move that would ripple across the industry.\n\nThat’s because the SEC has made a series of legal attacks against some of the biggest firms in the industry.\n\nCoinbase, the publicly traded crypto exchange, and the SEC are locking horns after the commission alleged that Coinbase is also operating as an unlicensed broker and exchange.\n\nEarlier this month, the SEC notified Uniswap, crypto’s largest decentralised exchange platform, that it was operating as an unlicensed broker.\n\nNow, the SEC appears to be turning to peer-to-peer protocols and applications.\n\nLiam Kelly is a Berlin-based DL News’ correspondent. Contact him at liam@dlnews.com."
    }
]