[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxOS2VLTmNsNV8yRzVScmhCYWlmc3Z0bUZ1TG91aE9SZGdIRmpvc3JNVDdMdFdwWm44M2dhUUh2VUJ5X2tvZlZTTnBnS01JVGdwUm11WGpZUUlUWkpJSC1DdjNEcFcwQm1yRUd3MUk4N2lFT012T1dyYmZjMlg1Y0ZvLTB2VElkR2xDRmFLU1pYR3BodWRZcHhxQ0NMcjNhLW9NS3l0ZGhJSF9LVDVxNVlHOFpSNVdab0ty0gG-AUFVX3lxTE1uSkJNRDZfYkRlUGJ5V0xNSl84NFlHYTRGUmNlOU9FZUJBUW91bHdQOVdPdWpMbVlNV2gxVjk4cm43TE5vc1o0UU1ReC1KMjVlemwycHdkWjBzSnpWUGlUXzU0MW9RRVJaX3VUV3AzeTVNMXJmQXhDT3g5bGJkbzVJUEg5bUFUUDJPLWVMTDNuZDRGT01LdnRrYnZ5eXd3VTRTTWhsM1IwNldEN20tYVNPUkJWS3Qwd3haa1NZUUE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 08 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Developers Target March 13 for Milestone 'Dencun' Upgrade on Mainnet - CoinDesk",
        "content": "The inked-in date for Dencun means that the upgrade will go live later than the developers had initially planned for. They originally targeted it for the end of 2023, but due to technical delays, the upgrade was pushed to early 2024."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTE4xb0s1blJOMV9qempyYlZXNWk5Y0NFbWpnNEpBbG5OQmpreHM1YzluVFFLbXhseVB6ZjBMeHhxYlBEby1oVGFHRC1uZVg4cElKOUFnXzAwYWV4SEI5b3ZIQ2daQjg2TDllU0Nocy1idjNyY0ZN0gF8QVVfeXFMTnd3QlVtZ1dvTDVMY1prLXZqWmtoT3lXYTV5U0ktVHVCVDJqamRmTmQ1eHV1Tno0V0pQOEJ3V1RtdXl6cUc5cGJCV3lGMkJrRDlYMkItQ19hbk5aNjh0Sm1WVkphcldhRjdIdXFIUHhSVkdjV1YtZ3JoaHkxRA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 08 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Staking Booms, With 25% of All ETH Locked Up - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nA quarter of all Ethereum (ETH) in supply is now being staked, data shows. According to figures from blockchain data firm Nansen, over 30 million ETH—or about $74 billion worth of the cryptocurrency—has been locked up.\n\nStaking is the process of “locking up” digital coins or tokens to help keep a blockchain network running. Proof-of-stake assets like ETH require users to pledge their coins to the network by sending it to a specific blockchain address. Those who stake earn token rewards in the process.\n\nLast year, the Ethereum network was upgraded, allowing users to easily withdraw staked ETH. Since then, liquid staking protocols have boomed—allowing users to seamlessly lock up and withdraw their crypto.\n\nAs ETH enthusiasts eagerly await the approval of an exchange-traded fund (ETF) that brings the second-largest digital asset to Wall Street, applicants are talking about staking in their proposals. Yesterday, investment firm Ark 21Shares amended their spot ETH ETF S-1 to mention the practice.\n\nAD\n\nAD\n\n“The sponsor may, from time to time, stake a portion of the trust’s assets through one or more trusted staking providers,” the filing read.\n\nStaking is controversial with regulators, though: The U.S. Securities and Exchange Commission has fined major crypto companies—such as digital asset exchanges Kraken and Coinbase—for allegedly selling unregistered securities via staking services.\n\nThe Ethereum network is in the process of an upgrade, too. Developers this week finalized the Dencun upgrade on a testnet. It is now expected to go live on the mainnet by March 13.\n\nDevelopers claim that Dencun will solve the scalability problem of the network behind the world’s second-biggest cryptocurrency—which is slow and expensive—so that it will potentially be able to process over 100,000 transactions per second in the future.\n\nAD\n\nAD\n\nEdited by Andrew Hayward"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxPZXkwSHd2T3d3TmVmTF8tc3NqSEQtd1VmUzhOZUxNMEl4eHRzb1JLX0ZWTnJIbkk1RGJBM1lMdEJmcHB2dWR2WGZYWFMyUmVOUU5FVWF6S0s0d1ZWbTdtU0U5NWtsUjRlQ1cxQmlwZ3N3UDdyUElubjA3Skp2WE92aGM5UkZqQXVKelA4SDRtOV84eGE5ZWF5d2F1U1lQa2k3WndwQTVSbw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 08 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Developers Set March 13 for Ethereum’s Major ‘Dencun’ Network Upgrade - Unchained",
        "content": "Dencun, which will introduce “proto-danksharding,” is the most substantial update to Ethereum since last April’s “Shapella” upgrade.\n\nDencun will introduce a new feature that is expected to reduce the cost of transacting for layer 2 rollups.\n\nEthereum developers have set the activation of the next network upgrade called “Dencun” for March 13. Dencun will introduce a technical feature called “proto-danksharding” and stands as the most substantial update to Ethereum since the “Shapella” upgrade last April that allowed people to withdraw their previously locked staked ether for the first time.\n\nRead More: Battle of the Blocks: PoW vs. PoS\n\nA hard fork for the second-largest blockchain by market capitalization, Dencun, if adopted by the majority of node operators, will irreversibly change the underlying code of Ethereum. The name Dencun combines “Deneb,” the name of a star in the Cygnus constellation, with “Cancun,” where Devcon 3 took place.\n\nOne of the most widely-discussed changes is the upgrade’s “proto-danksharding” feature which introduces a new type of transaction involving “blobs,” a memory space for storing transaction data. The advent of blob-carrying transactions is expected to reduce the cost of transacting for layer 2 rollups like Arbitrum and Optimism.\n\nRead More: What Is Proto-Danksharding?\n\nSoftware developers decided on the date on Thursday morning at their biweekly Zoom meeting focused on coordinating changes to the blockchain’s consensus layer, the component of Ethereum dedicated to establishing agreement among network participants over the state of the network.\n\nThe announcement comes one day after Ethereum developers successfully triggered the upgrade on a test network named “Holešky.” Test networks are instances of blockchains where developers and users can experiment with changes to the functionalities of the network without affecting the real, live network.\n\nThe price of ETH, the native cryptocurrency of the Ethereum blockchain, has increased 2% in the past 24 hours to $2,435 at the time of publication, data from CoinGecko shows."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxNbUcxMFpBQmtDc2NmV0E3UEYyVjJnT1lwaVBDVU1NZkZBcHRsUE9kQUR0bGFjMnRBMUlXTUpsZGpyOHVwSWkxLUZIc0NDLUFHOFVqck1OWklEMHlDMjY3QXVUdDU5X1FPSGxZWXBmN1hQTEswWi1mS2NrYjdVNktIam1XQVB3RUE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 08 Feb 2024 08:00:00 GMT",
        "title": "Ethereum ETF Approval Expected In May: How Will ETH Price React? - Yahoo Finance",
        "content": "In early 2024, the Securities and Exchange (SEC) approved the launch of over 10 spot Bitcoin exchange-traded funds (ETFs) in a landmark decision. In the months leading up to the announcement, the price of Bitcoin rose dramatically, going from less than $30,000 in late October to above $48,000 in early January. Additionally, the ETFs attracted tens of billions in investment.\n\nThough this decision was limited to Bitcoin, the ruling opened the door for the possibility of other spot ETFs. Perhaps the most anticipated is Ethereum, the second-largest cryptocurrency by market capitalization.\n\nIn 2023, Ethereum had a strong year, appreciating nearly 100%. However, these gains are much smaller than Bitcoin, which appreciated over 150%. Some believe that the hype surrounding the Bitcoin ETFs, as well as other factors, propelled both Bitcoin and Ethereum higher and higher throughout 2023.\n\nDon't Miss:\n\nHowever, the price of Bitcoin dropped off sharply after the approval of the ETFs. While it has begun to slowly recover, it is still far from the highs it saw on the first day the spot ETFs traded. While this fall in price could be for several reasons, most believe it to be a sell-the-news event, as the approvals were largely known and there was some profit taking on certain ETFs, such as Grayscale Bitcoin Trust (GBTC).\n\nEthereum ETFs could also be a possibility soon. According to Standard Chartered, the ETFs could be approved on May 23. This is the final deadline for the first wave of applications. This is notable as the Bitcoin ETFs were approved on the final deadline.\n\nTo support its case, Standard Chartered looked at the SEC's stance on ETH. The SEC has not classified ETH as a security in other filings. Additionally, the Chicago Mercantile Exchange (CME) has a listed and regulated ETH futures contract.\n\nTrending: This brokerage offers custom rewards for users to switch – the biggest reward so far for 1 user is $19,977.48. Will yours beat it?\n\nWhile this seems to be positive for both the potential approval of an ETF and ETH in general, there is no guarantee that it will be approved.\n\nAnother interesting piece to consider is the planned Ethereum upgrades, expected to go live in the first quarter of 2024. The upgrades are set to focus on scalability, speed, security and a whole host of other features. The last upgrade was in April 2023 and provided a slight boost to the price.\n\nStory continues\n\nCombining the different variables of the potential for ETF approval and price a runup ahead before May, as well as the planned Ethereum upgrades, it is hard to say exactly where the price of ETH will go. Drawing from the outcome of the Bitcoin ETFs, it might not be unreasonable to see a sharp price increase over the next several months before a sell-off in May. Standard Chartered predicts that the price of ETH could increase to $4,000 by May 23.\n\nOn the other hand, the market may look back at the Bitcoin ETF saga and change the second time around. In this case, a starkly different situation than with the Bitcoin ETFs could occur.\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nGet the latest stock analysis from Benzinga?\n\nThis article Ethereum ETF Approval Expected In May: How Will ETH Price React? originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxNbUcxMFpBQmtDc2NmV0E3UEYyVjJnT1lwaVBDVU1NZkZBcHRsUE9kQUR0bGFjMnRBMUlXTUpsZGpyOHVwSWkxLUZIc0NDLUFHOFVqck1OWklEMHlDMjY3QXVUdDU5X1FPSGxZWXBmN1hQTEswWi1mS2NrYjdVNktIam1XQVB3RUE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 08 Feb 2024 08:00:00 GMT",
        "title": "Ethereum ETF Approval Expected In May: How Will ETH Price React? - Yahoo Finance",
        "content": "In early 2024, the Securities and Exchange (SEC) approved the launch of over 10 spot Bitcoin exchange-traded funds (ETFs) in a landmark decision. In the months leading up to the announcement, the price of Bitcoin rose dramatically, going from less than $30,000 in late October to above $48,000 in early January. Additionally, the ETFs attracted tens of billions in investment.\n\nThough this decision was limited to Bitcoin, the ruling opened the door for the possibility of other spot ETFs. Perhaps the most anticipated is Ethereum, the second-largest cryptocurrency by market capitalization.\n\nIn 2023, Ethereum had a strong year, appreciating nearly 100%. However, these gains are much smaller than Bitcoin, which appreciated over 150%. Some believe that the hype surrounding the Bitcoin ETFs, as well as other factors, propelled both Bitcoin and Ethereum higher and higher throughout 2023.\n\nDon't Miss:\n\nHowever, the price of Bitcoin dropped off sharply after the approval of the ETFs. While it has begun to slowly recover, it is still far from the highs it saw on the first day the spot ETFs traded. While this fall in price could be for several reasons, most believe it to be a sell-the-news event, as the approvals were largely known and there was some profit taking on certain ETFs, such as Grayscale Bitcoin Trust (GBTC).\n\nEthereum ETFs could also be a possibility soon. According to Standard Chartered, the ETFs could be approved on May 23. This is the final deadline for the first wave of applications. This is notable as the Bitcoin ETFs were approved on the final deadline.\n\nTo support its case, Standard Chartered looked at the SEC's stance on ETH. The SEC has not classified ETH as a security in other filings. Additionally, the Chicago Mercantile Exchange (CME) has a listed and regulated ETH futures contract.\n\nTrending: This brokerage offers custom rewards for users to switch – the biggest reward so far for 1 user is $19,977.48. Will yours beat it?\n\nWhile this seems to be positive for both the potential approval of an ETF and ETH in general, there is no guarantee that it will be approved.\n\nAnother interesting piece to consider is the planned Ethereum upgrades, expected to go live in the first quarter of 2024. The upgrades are set to focus on scalability, speed, security and a whole host of other features. The last upgrade was in April 2023 and provided a slight boost to the price.\n\nStory continues\n\nCombining the different variables of the potential for ETF approval and price a runup ahead before May, as well as the planned Ethereum upgrades, it is hard to say exactly where the price of ETH will go. Drawing from the outcome of the Bitcoin ETFs, it might not be unreasonable to see a sharp price increase over the next several months before a sell-off in May. Standard Chartered predicts that the price of ETH could increase to $4,000 by May 23.\n\nOn the other hand, the market may look back at the Bitcoin ETF saga and change the second time around. In this case, a starkly different situation than with the Bitcoin ETFs could occur.\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nGet the latest stock analysis from Benzinga?\n\nThis article Ethereum ETF Approval Expected In May: How Will ETH Price React? originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    }
]