[
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxNTjByQnZtTzRiaE1sNGF4c2Z2clI3cmp2bHpxV0oxc0VJVkd3Tmlub1JFVHF3Z0plNkVuOUl2bV85dWtxTGJSMnNnMTVTS0NNeU1EX3pYVFd6Rlp3ZmhMbXhkUkpBYnlvX2dteXpPUWdYN0FqVXVsT05oTXluY3gzWnpHSWxzbV9WX1dzNTVjMHFpWVpF0gGcAUFVX3lxTE96NWFWTWdRamZDaVFETjZYcW9WcDhpMnFzU2k3V0NNWHVhS2ltNXlaM2MzUS1hb1VuSTNROG44QWE1TS14ODNuS1JNREh4aTdNcndJSklLUHJXYWkyNGpwdzdPb3E5UXhvLVQxTkkycWpsdWYtcU1NaVEwTUtwZzR3ck0zUVhKbU1aZ0RKd1pLdmZwVFNSTXJVMC1kbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 May 2024 07:00:00 GMT",
        "title": "Bitcoin and Ethereum Tank as Crypto Liquidations Top $150 Million - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe prices of Bitcoin and Ethereum both plunged Friday morning, prompting a fresh wave of long position liquidations that pushed total crypto liquidations above $150 million over the past 24 hours, per CoinGlass.\n\nBitcoin dropped by more than $2,000 in an hour, falling from a price above $63,000 to a daily low of $60,890, according to CoinGecko. It has since rebounded slightly to $61,130 as of this writing, and is down more than 1% on the day.\n\nMeanwhile, Ethereum is down by 2% over the last day, falling from $3,027 to a low of $2,927 alongside Bitcoin's plunge. It's up slightly since to $2,940, but still is down lower than it's been since May 1.\n\nIt's not immediately clear what prompted the price drops for the leading cryptocurrencies. Many other top coins have similarly lost ground this morning, including Solana, which fell back below the $150 mark after reclaiming that price earlier Friday.\n\nAD\n\nAD\n\nMore than $62 million worth of long positions were liquidated over the last hour alone. Over the last day, the total of long and short liquidations was just over $150 million across all major cryptocurrencies. Long positions are bets that the price of the coin in question will increase, while short positions bet against gains.\n\nEditor's note: This story was updated after publication with additional detail.\n\nDisclaimer The views and opinions expressed by the author are for informational purposes only and do not constitute financial, investment, or other advice."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxPdnhGWFFBNnRqTXJNYkFEbWdfbUdLd1NmS3VWaGwwX1YzaGNKNVBNM1E4b0NOREh4N3laNDZGQ3RBeGw4a0ZaRDBXeXphSlJ1WWhmckxuSC1KZUYtY1hjakMyUGgyWU1CTEw1ZUxIak1CWDY4OV9mWFBkMU8wOTlFdW1rMjVwWTczYkpzLVRkVXU2eUVGSUNnU25fbWJDNFFXdFF2LU5NaG1CQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 May 2024 07:00:00 GMT",
        "title": "Ethereum transaction fees hit record low as Layer-2 networks siphon activity - CryptoSlate",
        "content": "The average transaction fee on Ethereum has reached record lows as more activity moves to the Layer-2 (L2) networks on the chain.\n\nAccording to Ultrasound.money data, the average gas has dropped to 4.81 Gwei — the lowest level since the network completed the Merge event in 2022.\n\nMarket observers attributed this decline to increasing activity on L2 networks following the completion of the Dencun upgrade. The Dencun upgrade significantly reduced fees for L2 networks, making transacting on the base layer less attractive.\n\nNotably, the blockchain analytical platform IntoTheBlock reported:\n\n“An increasing number of transactions are now being settled on Ethereum Layer 2s. Last month, the three largest L2s hit a record 82% transaction share of all Ethereum transactions.”\n\nFurthermore, the number of transactions on Arbitrum has seen strong growth, reaching over 2 million daily transactions on May 8 — a significant rise from the early March average of 1 million.\n\nL2beats data further indicates that Base and Arbitrum averaged 30 and 20 transactions per second, respectively, while Ethereum managed 13 transactions per second during the same period.\n\nETH turns inflationary\n\nMeanwhile, CryptoQuant analysis revealed that ETH has transitioned to an inflationary state post the Dencun upgrade, resulting in diminished gas fees and reducing its burn rate.\n\nIn light of this development, the firm noted:\n\n“Since The Merge, Ethereum appeared to be on track with its ‘ultra-sound’ money narrative, showing a slight reduction in the total ETH supply. However, the post-Dencun upgrade challenges this by reducing transaction fees and the ETH burn rate, leading to an increase in supply.”\n\nCryptoQuant further elaborated that the Dencun upgrade environment has presented a scenario where maintaining deflation would require a substantial increase in network activity, contrasting the current trend of low gas fees and reduced burn rates.\n\nNotably, UltraSound.Money data shows that the daily amount of ETH burned during the past day was 519 ETH, a record low for the network."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxPOTQ0MWdZUEM5a0I3NGZ5SDFnWV90MlM4TlpyVm5hX2YwVGNfRndXS0wwUHpPV1BzRGxrSWxrbS13R1c5aFZqNm1rRU03OTBobkdsektiNmlVd1c3aS10MkNYSVA5RTdvUGRBU2RqdS1pTUhYYkhlRTV4SVFWSktUWDZ0Z3pETzZrVFp2T3R0ZktsYkpSWHNDMzBB0gGfAUFVX3lxTE1jekRXY0VkRENPZnZLbEY1enVqZGU2dGhYRGg1dTI2UHFCdF9ibjNtSXJGRUZjUi1MU0ZkcWxpeDhpbVdaMW5wRDN6RVRFVENVNjBaQmc1NTltV25aZHMtUEJ5WWJYaXNFbTMxZ3V2Z09YWXZHYUh6c0o1aTVOdmcyMnN4NjA4cFF1dVp3RndIZmYwdmFLV2pWUFlNUDEzNA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 May 2024 07:00:00 GMT",
        "title": "This is Why Ethereum is No Longer a Deflationary Network: CryptoQuant - CryptoPotato",
        "content": "Over the years, analysts and developers have touted Ethereum as a deflationary network, presenting the blockchain as ultrasound, aligning with Bitcoin’s sound money principle. However, that seems to have changed with the network’s latest upgrade.\n\nCryptoQuant analysts revealed in the firm’s latest weekly report that Ethereum ceased to be a deflationary network after the Dencun upgrade, implemented in March, which reduced the blockchain’s transaction fees by a substantial amount.\n\nThe Ultrasound Money Narrative\n\nEthereum’s ultrasound money narrative refers to the network as a system that maintains its purchasing power over time and stays resistant to inflation. Compared to Bitcoin, the term suggests that Ethereum has the potential to remain more sound by not just preserving purchasing power but reducing the supply of the network’s token, ether (ETH), over time.\n\nIn the nine years of its existence, Ethereum has implemented several upgrades to sustain the decrease in its inflationary rate or the issuance of new ETH.\n\nThe London upgrade, implemented in August 2021, introduced a mechanism that burned a portion of Ethereum’s gas fees, removing ETH from circulation with every transaction. The upgrade exerted deflationary pressure on ETH supply, making it more valuable and scarce over time.\n\nIn September 2022, developers implemented the Merge, transitioning Ethereum from a proof-of-work to a proof-of-stake network. The blockchain stopped issuing new ETH as block rewards to miners, drastically reducing the issuance and inflation rate of the crypto asset.\n\nThese two upgrades had deflationary effects on Ethereum until Dencun came along.\n\nEthereum is No Longer Deflationary\n\nDencun reduced transaction fees on Ethereum layer-2 chains and introduced danksharding, which allows the storage of additional data in blobs, making the network more efficient and less expensive.\n\nBefore the Dencun upgrade, the amount of fees burned on Ethereum was positively correlated with higher network activity; ETH supply was reduced faster, and more fees were burned due to higher network activity. However, the reduction of network fees has slashed the amount of ETH burned despite high activity.\n\nThe new supply of ETH has become positive again, increasing to its highest daily rate since the Merge, while the amount of fees burned has plummeted significantly. Hence, Ethereum is no longer deflationary.\n\n“We conclude that, at the current rate of network activity, Ethereum will not be deflationary again, the narrative of ‘Ultra sound’ money has probably died or would need much more higher network activity to come back to life,” CryptoQuant stated."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxOVXE0WlhDMWI0Nmk4M0xVSTZFcVlleUN4c3dBRFFJNzZ3VUI1SGJUc0NpY1A2cVVlNl9MRHFxVUFhOVk0ZjJCVk50a19ZNWxxVHVXQk82aV9ZWk1qOVJsbGdkN2F4N3RYUk41ODg0VXcyUzQzTGt4MW5EZUdIcXFtSFAyUGRiUFNhWUJyTU1ZOWswT09j?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 May 2024 07:00:00 GMT",
        "title": "Why the US election will decide the fate of Ethereum ETFs - DLNews",
        "content": "Ethereum spot ETFs will likely be denied on May 23.\n\nProspective issuers probably won’t sue the SEC — even though the strategy worked to get Bitcoin ETFs out.\n\nThe US election may hold the key to an approval.\n\nThe Securities and Exchange Commission will probably deny applications for Ethereum spot exchange-traded funds on May 23.\n\nThe lack of meaningful interaction with prospective issuers, coupled with Ethereum’s ambiguous regulatory status, have made analysts pessimistic about the chances.\n\nNot to mention the SEC’s recent investigation into the Ethereum Foundation.\n\nThat means spot Ethereum ETFs probably won’t see the light until the end of 2025, Bloomberg Intelligence ETF analyst Eric Balchunas told DL News.\n\nFaced with a rejection, prospective ETF issuers — like BlackRock, Fidelity, or Ark Invest — have two options: either sue the SEC like Grayscale did for the Bitcoin spot ETFs, or file again at a later date.\n\nFactoring into the equation is the US election. Should former President Donald Trump win a second term in the White House, the SEC is likely to face a change of leadership. And a new chair could be friendlier towards crypto than Gary Gensler.\n\n“If there’s a new president, you file again,” Balchunas said. “Maybe you get approved. Or you sue. Either way, that will take a whole other year to play out.”\n\nSuing the SEC\n\nThe SEC spent years shooting down Bitcoin spot ETF applications before Grayscale filed a lawsuit against the regulator in protest in 2022.\n\nJoin the community to get our latest stories and updates\n\nIn September, a judge found that the SEC had acted in an “arbitrary and capricious” manner by denying the applications. Four months later, the Bitcoin ETFs were launched.\n\nStill, it’s unlikely that the strategy will be replicated for Ethereum ETFs. For one, Grayscale will probably not bring the fire to the SEC a second time, Balchunas told DL News.\n\nLawsuits are expensive — not just in terms of money, but in attention and bandwidth too. And after suffering massive outflows when its Bitcoin trust was converted into an ETF, it wouldn’t be surprising if Grayscale did not aggressively pursue a conversion of its Ethereum trust.\n\nOther prospective issuers, meanwhile, won’t dare pick up the baton and sue the regulator themselves, Balchunas said.\n\n“None of these other firms want to piss off the SEC,” Balchunas said. “Grayscale was unique in that it wasn’t a big ETF issuer. The rest of these firms have other things going on, and they’re more scared.” “Nobody else will step up,” he added.\n\nElection time\n\nAnd why sue the SEC when the US presidential election, slated this November, may solve the problem?\n\nWith Trump leading in some polls, the odds that a new SEC chair will be appointed are higher than previously expected.\n\n“Trump is not necessarily pro-crypto,” Balchunas said. “Remember his previous SEC chief Jay Clayton didn’t allow that ETF either. So he’s not going to be like, ‘let’s just go crazy.’ But he’ll probably still be better for crypto and spot ETFs.”\n\nAssuming a new chair is appointed in April or May, and filings submitted immediately afterwards, that could bring the deadline for approval or rejection to somewhere around December 2025.\n\nAlternatively, issuers could try to file as soon as the election is over — or even before results are in — to speed up the timeline.\n\nAnd if Joe Biden wins?\n\n“In the past cycles, when they denied spot Bitcoin ETFs, there was usually a cooling off period for like a year where nobody did anything,” Balchunas said. “And then out of the blue someone is like, ‘Oh, the hell with it’ and files again.”\n\n“My guess is that issuers will take the summer, lick their wounds, just be bummed, and then see what happens in the election,” he added.\n\nTom Carreras is a markets correspondent for DL News. Got a tip about Ethereum ETFs? Reach out at tcarreras@dlnews.com"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxPNUVFSDhNZDB5bVloMXB6eldtSGVyWG9NaXpXaTlGZUxaNDRQU2NOb3h0QmhxYzZaU25zaTlIcVB6Z2Y5dTBGVHlCazdQTHZfNE5XeEQ3Z3VSMnNkbDJmQUlMenBUNWRNQVc1amtaSnVNbEJENUxDVURQclpJS09jSzBvd1otZUxHTlpOaGJfNmVvSGpnc2NualZjUEZ2eXM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 May 2024 07:00:00 GMT",
        "title": "Vitalik Buterin has a new proposal to make Ethereum wallets easier to use — but obstacles remain - DLNews",
        "content": "New new proposal from Vitalik Buterin could help speed up Account Abstraction adoption.\n\nAccount Abstraction promises to make Ethereum more intuitive and safer to use.\n\nThe update could come as soon as the fourth quarter of 2024.\n\nDeFi on Ethereum is often clunky and unintuitive, with few safeguards for new entrants.\n\nOne highly anticipated improvement is Account Abstraction — a new way for Ethereum wallets to handle transactions.\n\nStill, there’s a hitch.\n\nAccount Abstraction is incompatible with existing wallets, which is slowing its adoption.\n\nA recent proposal from Ethereum co-founder Vitalik Buterin may change that. Called EIP-7702, the proposal creates a route for existing wallets to use Account Abstraction — which was previously difficult to achieve.\n\n“It’s still a very early proposal, so we need to evaluate all the rough edges,” Ethereum core developer Marius van der Wijden told DL News.\n\nEIP-7702 adds a new transaction type that allows existing wallets to emulate the functions of Account Abstraction wallets, Van der Wijden said.\n\nIf successful, the proposal will unlock new transaction types, prevent users from losing access to their funds through email recovery, and even facilitate new use cases for the top smart contract network.\n\nJoin the community to get our latest stories and updates\n\nVan der Wijden said EIP-7702 will probably be included in Ethereum’s next major upgrade — dubbed Pectra — scheduled for the fourth quarter of 2024.\n\nA step closer to adoption\n\nAccount Abstraction has been around for a while.\n\nIn March 2023, a previous update introduced an Ethereum feature called ERC-4337, which allowed developers to start building Account Abstraction wallets.\n\nA lack of support for Account Abstraction, coupled with no easy way for users to switch over to the new wallet type, has slowed adoption.\n\nAt the same time, another proposal, called EIP-3074, introduced a change that would allow those with non-Account Abstraction wallets to delegate their control to smart contracts, allowing users to access Account Abstraction features.\n\nWhile EIP-3074 could aid Account Abstraction adoption, many developers criticised it because it puts users’ funds at increased risk.\n\nThe answer may be Buterin’s EIP-7702 proposal.\n\nEIP-7702 aligns the two previous routes to Account Abstraction — EIP-3074 and ERC-4337 — into “one unified Account Abstraction roadmap,” Alex Jupiter, a senior product manager at MetaMask, told DL News.\n\nThe result is a streamlined way for existing wallets to use all the features of Account Abstraction without the risks of EIP-3074.\n\nNew transaction types\n\nOn the surface, Account Abstraction wallets function the same as existing wallets. But under the hood, they have the ability to use smart contracts to manage funds, allowing for a host of new features that could help increase DeFi adoption.\n\nThe most obvious improvement is the ability to program transactions, allowing blockchains to replicate services banks and other money-transmitting services offer, such as scheduling payments.\n\nPayments provider Visa has previously highlighted the potential of Account Abstraction for automatic payments.\n\nThe ability to sponsor transactions is another appealing feature that Account Abstraction unlocks. Sponsoring transactions means allowing another party — such as a wallet provider, DeFi protocol, or blockchain — to pay for a user’s transaction fees.\n\nProgramming transactions can also help make using DeFi on Ethereum more intuitive.\n\nCurrently, when users want to swap tokens on a decentralised exchange, or send tokens to a different blockchain via a crypto bridge, they must sign multiple transactions at different stages of the process.\n\nWith Account Abstraction, everything can be bundled into a single transaction, allowing for a smoother experience.\n\nLost your private key? Don’t worry\n\nAccount Abstraction should also make using DeFi safer.\n\nWhen a user creates an Ethereum wallet they receive a private key, usually abstracted to a sequence of words called a recovery phrase.\n\nThis key is the only way a user can access their funds. If the key is lost, stolen, or if a user’s wallet is accidentally uninstalled or the wallet account is deleted, the funds it controls could be lost forever.\n\nWith Account Abstraction, it is possible to implement a recovery process in which a user can designate multiple trusted individuals as recovery agents. This can consist of an email address or other forms of identification, such as Google Authenticator for two-factor authentication.\n\nThe process is similar to creating and securing an account in the web2 world, but it is executed through a decentralised network.\n\nTim Craig is a DeFi Correspondent at DL News. Got a tip? Email him at tim@dlnews.com."
    }
]