[
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMi0AFBVV95cUxPbHY0eDdJYXJ4b3I0M3Y5VVVpRzNIUGE1QWxzaTUtSDlVSzlPY0RoSThFaXAtekMxNElxdEREemhlMTlWVl9QbVktU1F5c1dnS3dFeWxtbVRFTFdMREJ6czZzeDUwNEowNVB0UHp5YzZkUW1INGpCcS1tZzdpVGNHcHBGVGNMWEtyMy1vVjJuZGhOWnU3NW9jdTJHQ1hsVnhsSWZ4QllCTDRhcHNTQzVHSzRERnJMR3VLWmZsMFJxTktZZXYzbHBDWWVuT2V2MEZq0gHWAUFVX3lxTE9Wajl0cmxXWlRLdDRtcHhTRThPYjNzYm5rb1dyUG15SDV3M1lKcDM1T01KNWNhTFVsZk5FTjd4b3BnSlBCemNobEx1b1NHY3JkQ3dVUkhNNzZKTUtZS3NGd3ZwaTBoczFzWUctYVM3RUMteXdyRlNrRFE0ci1nYVNkc1NwakVJanBNSE9OSnFzdURLajhRaGUyTTF2VVFhR1JqS1NqT3VfdmxlZmYyejZxYVlnb2RDM2dSeWlxeTRFSVFJbkc2Q0NwbWNGOXQwbmFQX2N3TUE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "XRP Ledger Now Closer Than Ever To Ethereum Compatibility As Second Audit Nears Completion: Developers - The Daily Hodl",
        "content": "The XRP Ledger (XRPL) is almost ready for the launch of its much anticipated Ethereum Virtual Machine (EVM) compatible sidechain, according to developers working on the project.\n\nThe project aims to allow Ethereum (ETH) developers, who are used to Solidity, the main programming language for writing smart contracts on Ethereum, to access and build on the XRPL network.\n\nDevelopment firm Peersyst Technologies says on the social media platform X that the new sidechain is waiting for a few components to come together, such as its XChainBridge which is currently being voted on by validators.\n\nThe bridge aims to allow users to automatically bridge any token from the sidechain onto the XRPL.\n\nPeersyst also says that the sidechain, which is “more advanced than ever” and has already been audited by security firm Bishop Fox, is going through a second audit with “a recognized supplier” that will be published soon.\n\nThe firm also says that a new version of blockchain explorer Blockscout is being built for the sidechain.\n\nAccording to Ripple, some highlights of the EVM sidechain include:\n\nSupport for 1000 transactions per second, enabling large loads and throughput.\n\nLow transaction confirmation times, producing a block every 5 seconds.\n\n1 block finalization time; once a block is added to the chain and confirmed, it’s considered final.\n\nFull Ethereum Virtual Machine (EVM) compatibility, enabling you to connect your wallet and interact with or deploy smart contracts written in Solidity.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Natalya Yudina/INelson"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiYkFVX3lxTE1wTXdtQ2k3OUZhaENZTmhTV2tGVFlGbDB5UlB5aWdUeUtnZGFENkdRVEpzQldXbnhkdllBalpteTl5MC1oWnZhQ0NPcjZNQ29MV0JKSGRSRUplc0tEZWx5VHVR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 20:30:31 GMT",
        "title": "BlackRock spot ether ETF decision delayed by SEC - Blockworks",
        "content": "\n\nThe Securities and Exchange Commission delayed a decision on BlackRock’s proposed spot ether ETF.\n\nThe delay pushes any decision on the proposed fund to March 10, according to an official release by the agency.\n\nThe delay was largely expected, with the SEC also delaying decisions on Fidelity’s proposed fund on Jan. 18.\n\nRead more: After spot bitcoin ETF approval, eyes shift to ether fund decision\n\n“Spot Ethereum ETF Delays will continue to happen sporadically over the next few months. Next date that matters is May 23rd,” Bloomberg Intelligence analyst James Seyffart said.\n\nLoading Tweet..\n\nThe decision comes just weeks after the SEC approved nearly a dozen spot bitcoin ETFs. Three commissioners — Hester Peirce, Mark Uyeda and Chair Gary Gensler — voted in favor of the ETFs.\n\nFollowing Grayscale’s legal victory in August, the SEC was compelled to reevaluate its application for a spot bitcoin ETF conversion. Despite this progress, the status of ether ETFs continues to be unclear.\n\nIn an interview on Tuesday, Peirce said that the SEC would “apply precedent” to any decisions on spot ether ETFs. She further noted that the agency doesn’t plan to repeat history and face another court case in order to approve such funds.\n\n“I’m not holding my breath,” Lara Crigger, editor-in-chief at VettaFi previously told Blockworks about ether ETF approval.\n\nHowever, Seyffart previously said that he was more bullish about the future of ether ETFs.\n\n“If [Gensler] goes after ETH, it’s not just going to be a lot of these industry players; it will also be the CFTC that he has to contend with, and it’s just not worth it,” he told On the Margin podcast.The delay was largely expected after the SEC also delayed Fidelity’s proposal\n\nIn his press release following bitcoin ETF approvals, Gensler noted that the decision “should in no way signal the Commission’s willingness to approve listing standards for crypto asset securities.”\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxPTE56Rnp0bUdmbHplZ1pjbjFlWXI3dkh6YXRCd3hSZ3NuWmdhX2RQYnVaWGFZRmdpZ250V1NWQ01CRkhVV194SmhUYnlMLUdrQWM1S0dnT0xvZWsyVjNTcXBQVWVtZ2FCaENwVkxRZ2NrSV9FQmFOQkZsVzNYeFhxdUVYRdIBiwFBVV95cUxPdE9Sckd1bWhkLXN4SVFqXzNQVHdRVDBTRlRzQTlGTzlVaFhkcXVxVkZETTlleERuWmg4TFkxajc3cXBvMHNaYVZmakJsMFppMTQycmt3aUVmazJRcWRiUjVNM0ZIWGkxM3BsUVhROXVDbW9mNGRvWnAwa1EyZ2RMcDVRd3I1UEpHcEY4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Donald Trump’s Ethereum Wallet Holds $1.1M in MAGA Meme Coin - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nYou never know when a huge pile of meme coins can turn into serious cash. Early Dogecoin (DOGE) investors know this well, as do Solana developers who received an airdrop of BONK. And the latest beneficiary of a meme coin glow-up is… former U.S. president Donald Trump?\n\nAn Ethereum wallet that blockchain analytics firm Arkham Intelligence previously tied to Trump, which holds a share of royalties from sales of the official Trump NFT collections, also holds over 579,000 MAGA (TRUMP) tokens. And a recent surge in price for the meme coins means that Trump’s holdings are valued at about $1.1 million as of this writing, as first reported by CoinDesk.\n\nThe TRUMP token has jumped 222% this week alone, per data from CoinGecko, and 689% over the past 14 days. Meme coins are famously volatile and can be driven by social media sentiment and real-world events, and Trump has racked up a pair of 2024 presidential primary wins in recent days as he attempts to win a second term in office.\n\nTrump’s wallet isn’t associated with the creation of the TRUMP token, and in many cases, meme coins inspired by celebrities and public figures aren’t created by the person in question. Instead, they’re often created anonymously in an effort to ride the wave of hype and FOMO.\n\nAD\n\nAD\n\nIn this case, Trump’s wallet was sent the sizable allotment of TRUMP tokens across multiple transactions in August and October 2023, per public blockchain data tracked by Etherscan. At the time of the largest transfer, on August 19, the 469,901 tokens received on that date were collectively worth approximately $5,670, per data from DexScreener.\n\nNow his stash of TRUMP tokens is valued at $1.1 million, making up the largest single holding in the Trump-affiliated wallet. Overall, it holds nearly $2.6 million worth of cryptocurrency as of this writing, including about $755,000 worth of Ethereum (ETH) and $731,000 worth of Wrapped Ethereum (WETH).\n\nIn December, the wallet dumped $2.4 million worth of ETH across a period of three weeks, following the launch of his third collection of NFTs minted on Ethereum scaling network Polygon. Only about half of the latest NFT collection has been minted so far, after the two previous collections both sold out.\n\nThe wallet was tied to Trump by Arkham last year following a financial disclosure notice from the former president, as the wallet receives royalties from the sale of his officially licensed NFTs.\n\nAD\n\nAD"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxQOXp2TC1maHNaMDZQd0h6TzlWeXpnZnJVSkR5ekxiRURwMmZWbktIZkpDdG5iRUtvbm9pekhqVWFyQWR2cEh2UlUyeFJ0TWUyc2lGWVNHWWh6TS1pVTJzQ1VpY3d4eFc2YU4wbS1VR0ItejZfUDlIcEx5LURnMU9NQWd6bXpKSmhwcWJpTWswS3o1aDd1QVhIS1pZZFkwT0R6czFKbVd3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Price Forecast – Ethereum Attempts to Recover - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxOdVZFQ1NRaGFnSGxUenZWOGZfVWJ0UE5BQTZwdGx1STBNTGw4d24xS2xkOVZ2clBORWNOeWl5eVFGbkU1eUFhRVR5VG43Wklac05WeEUtNmNWNGFlOVNybjkzOEF2d01TUmJEeFFfQ0gtZEJtbWQ3azNNWVREcjViWER6ckdRT0RIanBoTnQtRGRHUFRjWXRvWTJHT3NuMnlIdmpuY0VBOXo1UGxOSXhvOQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "SEC has a ‘hard no’ stance on spot Ethereum ETFs, but issuers are optimistic: FOX reporter - CryptoSlate",
        "content": "FOX Business reporter Eleanor Terrett reported a wide range of expectations regarding spot Ethereum ETF approvals on Jan. 23.\n\nNotably, Terrett suggested that the U.S. Securities and Exchange Commission (SEC) is opposed to approving a spot Ethereum ETF. She said:\n\n“Another source tells me the line at the SEC at this very moment is a ‘hard no’ and there’s currently ‘some internal resistance’ to the idea.”\n\nTerrett did not state whether that source is a member of the SEC itself or a member of an asset manager seeking approval from the SEC.\n\nTerrett also noted that SEC commissioner Hester Peirce, known for her pro-cryptocurrency stances, has advocated for a more straightforward decision process. The SEC in part approved spot Bitcoin ETFs because one applicant, Grayscale, obtained a legal victory, as SEC chair Gary Gensler explained in a statement. Peirce criticized that approach in an interview with crypto news platform Coinage today, as she said that ETF approvals should involve “regular way consideration” rather than court cases compelling action.\n\nTerrett concluded that further indications of the SEC’s stance will emerge in the coming months as it becomes clear whether it engages with S-1 registration statements. The SEC typically posts notices of meetings with asset managers and exchanges on each ETF’s page as they occur.\n\nAsset managers appear to be optimistic\n\nDespite resistance within the SEC, Terrett suggested that the asset managers responsible for issuing each fund are optimistic about approval.\n\nAccording to Terrett:\n\n“[One] issuer with an ETH Spot ETF application says they’re confident the approval and smooth launch of the Bitcoin spots will compel the [SEC] to approve ETH spot ETFs.”\n\nAnother unnamed issuer said that they expect a spot Ethereum ETF to launch by the end of the summer because of the SEC’s earlier approval of Ethereum futures ETFs, and because of BlackRock’s strong ETF approval record.\n\nThat source also cited the CFTC comments suggesting Ethereum is a commodity, as well as Ripple’s partial legal victory against the SEC, as factors that could more broadly prevent the SEC from labeling crypto assets as securities. However, it is not clear that those developments will directly impact spot Ethereum ETF approvals in the coming months.\n\nPublic expectations around approval vary. Bloomberg ETF analyst Eric Balchunas posits a 70% chance that an spot Ethereum ETF will be approved in May, while JP Morgan executive Nikolaos Panigirtzoglou has predicted a 50% chance of approval. Polymarket odds suggest a 53% chance of approval.\n\nMentioned in this article"
    }
]