[
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMibEFVX3lxTE52YUFXZHVXS1BHTlpRbVNja2dkSW1fNGlpbWdCYjAzSFVoNWx5TGdRZ2pZcERza2NjZ2d4M3pDeG9HMFJ1RlhEbENDajN6VmpuRFY5UkxUam9HZ0xjREdxNE9jRVY2ZWQ1YWF6Z9IBckFVX3lxTE1lZGNVV09BZlg0QmtiTHAwZDlLdnBRZ0Jqc2hvWjcwRnZENDdRMGZMZ2JUYmc3QjUyS25aMzY3NFdqNVNJOEZEUzVVc2dyQnJuTDRydjJlcHNEa1M0OXVOU29TbGszOGpFYmZuUGxkMHEzUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 May 2024 07:00:00 GMT",
        "title": "Another Ethereum ETF Decision Delayed by SEC - U.Today",
        "content": "The U.S. Securities and Exchange Commission has moved to delay its decision on the Invesco Galaxy spot Ethereum ETF proposal, according to a recent filing.\n\nAdvertisement\n\nThe regulator has extended the period for approving or disapproving the ETF proposal in question for an additional 60 days.\n\nLast month, the SEC also punted its decision on spot Ethereum ETF proposals by Franklin Templeton and Grayscale.\n\nAccording to a recent report by Reuters, which cites industry insiders, the SEC is predicted to deny Ethereum ETFs proposed by VanEck and ARK later this month.\n\nAdvertisement\n\nIndustry experts have predicted that the SEC was going to deny these ETFs due to the lack of engagement, which was not the case on the cusp of Bitcoin ETF approval.\n\nSpot Ethereum ETFs are likely to be rejected for a mechanical reason, according to industry analysts. Bitwise's Matt Hougan predicted that the SEC would say that it wanted to see more data.\n\nIt is worth noting that the SEC is currently in the middle of a legal battle with key Ethereum backer Consensys. In April, Consensys took the regulator to court over its decision to \"wrongly\" label the leading altcoin as a security.\n\nHowever, BlackRock CEO Larry Fink said that it was still possible to launch a spot Ethereum ETF even if the underlying cryptocurrency were to be classified as an unregistered security.\n\nIt took the SEC more than a decade to finally approve spot Bitcoin ETFs earlier this year. The ETFs ended up being a big success, but it seems like the regulator is not ready to approve Ethereum ETFs."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxPOXJsUjhvYU1iMHhCWmRoOXQxZy1DU3FsdkdDVWJubE1CVmgtZVgyZzJUVVlabTJGWnphRElCOF9sWkU1bG5lVkhCUkUwLTBTRzQtRmxNQW9lX1pNUWphanowUUotSmwtdm9QTm13VmYzVUdObEtfRHFfbk9GTl9pRHhrWHc2R0NXNmk1dG4zTng?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 May 2024 07:00:00 GMT",
        "title": "Ethereum Witnesses a Significant Drop in Daily ETH Burning - Yahoo Finance",
        "content": "Ethereum Witnesses a Significant Drop in Daily ETH Burning\n\nThe Ethereum network has experienced a notable decline in the daily amount of ETH burned, reaching its lowest level this year. This has resulted in fewer ETH being burned. On Sunday, only 610 ETH was burned, setting a record low for this year as Ethereum's gas fees remained minimal. In contrast, during the first four months of the year, the daily amount of ETH burned stood consistently above 2,500-3,000 ETH.\n\nThe ongoing decline in gas fees can be attributed to several factors. Firstly, there has been a shift in activity towards Layer 2 scaling solutions, which offer improved scalability and lower transaction costs. Additionally, the adoption of blob transactions, introduced with the Dencun upgrade in March, has contributed to reducing transaction costs on Layer 2 solutions.\n\nThe London hard fork, also known as EIP-1559, implemented in August 2021, brought about a fundamental change to Ethereum's fee structure. This upgrade introduced a base fee that is burned and a priority fee that serves as a tip to validators. The relationship between gas fees and ETH burning is closely monitored as an essential aspect of Ethereum's economic model. While lower fees are advantageous for network users, the decrease in ETH burn has implications for the deflationary nature of Ethereum.\n\nIn recent weeks, Ethereum's supply has shifted towards being inflationary, with a growth rate of 0.49%, according to ultrasound.money. However, if activity picks up and more ETH is burned than issued, Ethereum could return to a deflationary state, where the supply decreases over time."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxOOFJ0OWIxUFhqN3h6VjBFajc0bG1DUWdIMld6WXA0UmFsREk3Qmh1RHdJUGVYOXhfQkpTaFZpdGFWYlhwOHhvTEJ2ejZMWFJOY2FKbHdMQlplT3Zkb0tkVzZTNlczVDdZckF6SHRTREFTSG9GenFSOUVBWmptcnJEdnZUX3E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 May 2024 07:00:00 GMT",
        "title": "Ethereum devs propose new transaction type with EIP-7702 - Crypto Briefing",
        "content": "The proposal outlines a new transaction type that temporarily upgrades externally owned accounts.\n\nShare this article\n\nA group of prominent Ethereum developers, including Vitalik Buterin, has proposed a new transaction type (EIP-7702) to enhance the functionality and security of Externally Owned Accounts (EOAs). The proposal aims to address common issues such as transaction batching, sponsorship, and privilege de-escalation.\n\nAccording to the EIP-7702 draft, the new transaction type “adds a contract_code field and a signature, and converts the signing account (not necessarily the same as the tx.origin) into a smart contract wallet for the duration of that transaction.” The proposal is intended to offer similar functionality to EIP-3074.\n\nThe motivation behind EIP-7702 is to provide short-term functionality improvements to EOAs, increasing the usability of applications and, in some cases, allowing for improved security. The proposal outlines three particular applications: batching, sponsorship, and privilege de-escalation.\n\nWhile EIP-3074 solves these use cases, the authors of EIP-7702 believe it has forward-compatibility concerns. They state that EIP-3074 “introduces two opcodes, AUTH and AUTHCALL, that would have no use in an ‘endgame account abstraction’ world where eventually all users are using smart contract wallets.”\n\nAdditionally, they argue that EIP-3074 “leads to the development of an ‘invoker contract’ ecosystem that would be separate from the ‘smart contract wallet’ ecosystem, leading to possible fragmentation of effort.”\n\nThe specification of EIP-7702 details the transaction payload format and the process of executing the transaction, which involves setting the contract code of the signing account temporarily and reverting it back to empty at the end of the transaction.\n\nThe authors provide a rationale for how EIP-7702 can convert EIP-3074 use cases, stating that “it requires fairly little work to convert an existing EIP-3074 workflow.”\n\nThey also argue that EIP-7702 is designed to be forward-compatible with future account abstraction, avoiding the creation of separate code ecosystems and the need for new opcodes that may become obsolete.\n\nDespite the potential benefits, the authors acknowledge that EIP-7702 breaks the invariant that an account balance can only decrease as a result of transactions originating from that account, which may have consequences for mempool design and other EIPs.\n\nAs with any proposal requiring users to sign contract code, the authors emphasize the importance of user wallets being cautious about which contract_code they sign, highlighting the shared security considerations with EIP-3074."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxNcDl3VXRpanE4ZW1hVUwyMnRGMU5KVlI1OXJlcGJOWXV3d295TkFHUXR6UlNsZDh1M2hsYVhFRWZLcEtjRi1PYTBGNzVKclhOWWRVUHZIN2JMYmFQY3RXb3VFejF1WTVxSHVBWk9mbk9HQXkwNDVuenowUGJYZ1Z1SVNwRVNiVDhpVUtWaUJOUFdZRmZTQWdNVGdsdXktNTl0UGhKY1U1dDFqcmxzRFA4cjQ1dkw5Sk1zU2VXSy02ZDYxVnVB0gHKAUFVX3lxTE9jMjVfdER1aTZBZHQyRUFPNnZqbW9zNHQ4Yl9JakU3S3d6TnlmTXQ5OVJKa3dLVlpxelB0MkhOeHZaMHZCSXg3OFYxSzhFSGd4THRVRUVXc3F0NFVyMllwQW9tdEJFWW5kMTNIZ3p6MmVTY3pHUFd4c0JxTGQ4eFBTQ0JhZ1FnT3MxS0w3Z3Z0d0g5aU1wTXpjUXlnR2I5UW9pQVFWVmZKc045dWdEWVZrd0tRVmMzMklkTDB0TzhXbUloVER2ZUh2Tnc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 May 2024 07:00:00 GMT",
        "title": "Ethereum breaches key support as SEC delays ETF decision - FXStreet",
        "content": "SEC delays decision on Ethereum ETF S-1 drafts as analysts shifted their potential launch date again.\n\nEthereum whale risks liquidation if ETH declines to $2,984.\n\nEthereum breaches key support amid key insight from CME open interest.\n\nEthereum is down more than 5% on Thursday following the Securities & Exchange Commission's (SEC) failure to approve ETH ETF issuers' S-1 drafts. Meanwhile, the recent decline has strengthened the bearish outlook after ETH moved below a key support level, sparking $90 million in long liquidations.\n\nDaily digest market movers: SEC yet to approve ETH ETF\n\nDespite its light comments on issuers’ S-1 drafts, the SEC has yet to approve spot ETH ETFs following the US Independence Day holiday. As a result, Bloomberg analyst James Seyffart shifted his over/under date for a potential approval to next weekend.\n\nThe SEC approved spot ETH ETF issuers' 19b-4 filings in May, but also need to sign off on their S-1s before the products go live.\n\nNate Geraci, President of ETF Store, noted that the SEC expects issuers to amend their S-1s by July 8, with another round of filings potentially due around July 12. This \"would theoretically mean launch week of July 15\" for spot ETH ETFs, wrote Geraci in an X post.\n\nMeanwhile, following the recent market decline, a whale who longed ETH via the Compound protocol is about to be liquidated, according to data from Lookonchain. The whale deposited 12,734 ETH worth $40 million to Compound and borrowed $31.4 million worth of dollar-denominated stablecoins with a health rate of 1.06. The whale risks liquidation if the price of ETH drops to $2,984.\n\nETH technical analysis: Ethereum bears lead market amid slight bullish sentiment from US investors\n\nEthereum is trading around $3,132 on Thursday, down more than 5% on the day. The decline wiped out more than $90.81 million worth of long positions from the market, bringing the total ETH liquidations to $102.48 million in the past 24 hours.\n\nETH has now breached the $3,203 key support level, strengthening its bearish outlook. With the move, ETH has fully balanced the market inefficiency from itsprice spike following news of the SEC's U-turn on spot ETH ETFs.\n\nETH/USDT 4-hour chart\n\nETH may test the $3,029 support level in the next few hours. A bounce from this level will cool the bearish momentum. However, a move below it may see ETH seeking support around the $2,852 price level.\n\nIn the past 24 hours, Ethereum's futures open interest (OI) across top exchanges declined by almost 5%. Open interest is the number of outstanding contracts in a derivatives market that are yet to be settled.\n\nWhile the move signified wider risk aversion from traders, Ethereum's CME OI was an outlier, rising almost 1% in the last 24 hours. This indicates that US investors may be slightly bullish despite declining prices due to expectations of spot ETH ETFs' launch.\n\nAnother key insight is that spot ETH ETFs may experience impressive flows using the rising ETH CME OI as a proxy to measure investors' sentiment. As a result, ETH may take bears by surprise and rally past its yearly high, invalidating the bearish thesis."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTE9sdUsyVHJKck81X2l3UjBHeTJ6TnZmTmlUcUZYZGhJc29oakp2VFZISEV5TzlOcFJjZnFBWWN5M3lOdk5ENG5KdWpDQWtXOE5GOXdpVDNmc1dKempJVnJLYndacm9wcVdIQVE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 May 2024 07:00:00 GMT",
        "title": "What Is the EIP-3074 Proposal on Ethereum? - Unchained",
        "content": "EIP-3074 is an Ethereum Improvement Proposal (EIP) that aims to improve account management for Ethereum users.\n\nEIP-3074 has been approved for inclusion in the Prague/Electra Ethereum hard fork, scheduled for Q4 2024. The proposal aims to streamline transaction processes and decrease expenses by introducing third-party transaction sponsorship. EIP-3074 represents an advancement in Ethereum’s account model, paving the way for future developments.\n\nSo, what exactly is EIP-3074, what implications does it hold for Ethereum, and how is it different from EIP-4337?\n\nWhat Is EIP-3074?\n\nEIP-3074 is an Ethereum Improvement Proposal (EIP) that revolutionizes account management within the Ethereum network. It allows externally owned accounts (EOAs) to delegate control to smart contracts, enabling more advanced transaction strategies.\n\nEIP-3074 was introduced in 2020 by Ethereum core developers and researchers Sam Wilson, Ansgar Dietrichs, light clients, and Micah Zoltu.\n\nIt introduces two new operations, “AUTH” and “AUTHCALL,” to empower EOAs to transition seamlessly into smart contracts without requiring the deployment of new contracts.\n\nThe primary goal of implementing EIP-3074 is to enhance the wallet user experience by enabling gas sponsorship, facilitating batch transactions, and enabling wallet asset recovery processes.\n\nSee the illustration below to understand the flow of transactions.\n\nHow Does EIP-3074 Aim to Improve Ethereum?\n\nEIP-3074 proposes delegating control of EOAs to smart contracts which offers developers a flexible framework for innovative EOA transaction strategies. This transformation is facilitated by two instructions: “AUTH” and “AUTHCALL.”\n\nThe AUTH establishes the “authorized” context variable based on ECDSA signatures. On the other hand, AUTHCALL initiates authorized account transfers, allowing for additional logic to be implemented around “AUTHCALL” without compromising security or user experience.\n\nThe AUTHCALL opcode functions similarly to the existing CALL opcode within Ethereum. It establishes the authorized address as the message sender in the subsequent call, effectively permitting the invoker contract to act on behalf of an EOA when interacting with other contracts.\n\nIn practice, the process involves the EOA address user signing the transaction off-chain, then either the EOA user or a gas sponsor sending the transaction to the invoker contract, which verifies and calls each target contract using “AUTH” and “AUTHCALL.”\n\nThat way, EIP-3074 enables any EOA to function as a smart contract wallet without contract deployment, facilitating more complex transaction schemes. This introduces various exciting use cases to Ethereum, such as gas sponsorship, batch transactions, and wallet asset recovery.\n\nGas sponsorship allows dapps, projects, and third parties to cover gas costs for users, removing the need for users to hold ETH themselves, which is particularly user-friendly for new Web3 users.\n\nIn addition, EIP-3074 supports executing multiple operations in a single transaction, streamlining non-ETH token trading by eliminating the token approval process. Hence, this enhances transaction efficiency and reduces costs.\n\nFor wallet asset recovery, EIP-3074 allows users to recover assets via a special invoker contract when they lose their private keys through a social recovery mechanism.\n\nEIP-3074 vs. EIP-4337: What’s the Difference?\n\nEIP-3074 and EIP-4337 tackle unique aspects of account abstraction on Ethereum. They are similar in that they both address execution abstraction, enabling functionalities such as batching multiple calls to multiple destinations, ensuring atomicity, and enhancing dapp-specific user experiences.\n\nHowever, they are quite different in how they work.\n\nEIP-3074, primarily focused on enhancing the capabilities of EOAs, introduces a novel approach by supercharging EOAs with arbitrary execution logic through invokers. It extends the functionalities of EOAs without necessitating asset migration to new accounts.\n\nHowever, EIP-3074 only addresses execution abstraction and doesn’t deal with decentralized access. It prioritizes simplicity and aims to streamline transaction processes for existing EOAs.\n\nEIP-4337 takes a broader approach, aiming to abstract the entire account, involving all five functionalities. It looks to preserve Ethereum’s core properties of decentralization and censorship resistance while mitigating potential vulnerabilities, such as DoS and griefing attack vectors.\n\nUnlike EIP-3074, EIP-4337 necessitates migration to a smart account as it cannot extend the capabilities of EOAs. It aspires to achieve full account abstraction without compromising the fundamental tenets of the Ethereum network.\n\nReasons For and Against EIP-3074\n\nLet’s take a look at the benefits that will come with the new EIP-3074 token standard proposals.\n\nReasons For EIP-3074\n\nNew Opcodes: EIP-3074 introduces new Ethereum opcodes, enabling EOA users to authorize smart contracts to execute actions on their behalf within a single transaction. This improves security and control, as users don’t need to permanently transfer their private keys.\n\nUser-Friendly Utilities: The new opcodes enable various user-friendly utilities, including transaction batching, sponsored transactions, conditional transactions, meta-transactions, and delegated security. These utilities streamline transaction processes, improve efficiency, and expand possibilities for decentralized applications (dapps) and users.\n\nEasier Migration: EIP-3074 allows easier migration to smart accounts by empowering EOAs. Previously, the effort and gas cost of migrating existing assets posed a challenge for users switching to smart accounts. With EIP-3074, migration is smoother and in a single batched and gas-sponsored transaction.\n\nUnified User Experience (UX) and Developer Experience (DevEx): dApps can enhance user experiences without excluding EOAs, thereby increasing incentives to leverage sponsored transactions and transaction batching. This introduces standardization around these features and allows for the integration of smart account functionalities into development frameworks.\n\nHybrid Accounts: EOAs can designate smart accounts as invokers, enabling hybrid custody use cases and facilitating testing of smart accounts before asset migration. This flexibility gives users more control over their assets and opens up new possibilities for custody solutions.\n\nReasons Against EIP-3074\n\nWhile EIP-3074 provides many advantages, it also has some potential downsides.\n\nSecurity Concerns: The security of invokers is a significant concern associated with EIP-3074. Poorly implemented invokers could pose a threat to user funds. To address this risk, rigorous audits of invokers and safeguards in EOA wallets need to be implemented.\n\nRequirement for Hard Fork: The adoption of EIP-3074 necessitates a hard fork due to new opcodes. This requires agreement and integration, which can be a lengthy process and has brought some resistance to the EIP-3074 proposal.\n\nThe Bottom Line\n\nThe decision to implement EIP-3074 came from the community’s recognition that the journey of achieving full account abstraction (AA) through proposals like EIP-4337 and RIP-7560 may require more time than initially anticipated.\n\nAt this time, focusing on enhancing EOAs offers immediate benefits. By fixing EOAs, EIP-3074 enables greater on-chain flexibility and execution abstraction within the existing Ethereum ecosystem.\n\nThe seamless integration of EIP-3074 into the Ethereum ecosystem and its reception by wallets and decentralized applications (dApps) will be crucial to its success. Moreover, ongoing efforts to address security concerns and ensure safe, user-friendly operations will be important for the widespread adoption and sustained effectiveness of EIP-3074."
    }
]