[
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTE1KSkpQWVdKQUxONkw0Uk1wajNSZldjcktGUlZjcW5rS3VhUlZoaUUyaDFjdG5VTnZKVXJWMkZEVzRrYW1xXzYtS3o5eV9Od29EWUctSVhucHB6c00wQXYwQVJJNWZhbHNhREo3akJIaEphM2fSAXhBVV95cUxPM3JFZ21PV2dVTW5SMkVCNGFIU0psVXFjYnc5NEdNVXZKS244UzV6WmN4dnR0dk9UeEZrSFRURk1IZVhBNjcwbW83MW40YlhnZkduQVRpY0RHT0xXam5KVV9taUlzbnF1dDlNTmR5d2V1Qy1pUEhlbVA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Jun 2024 07:00:00 GMT",
        "title": "Solana Just Dethroned Ethereum in This Key Metric - U.Today",
        "content": "According to data provided by DefiLlama, Solana has managed to destroy Ethereum in daily DEX trading volume ($1.148 billion and $745 million, respectively).\n\nAdvertisement\n\nSolana-based Raydium, Meteora, Orca, Phoenix and Lifinity are among the top 10 DEXes by daily trading volume. Uniswap and PancakeSwap, of course, remain in the lead.\n\nAs noted by Patrick Scott, the founder of Dynamo DeFi, Solana's DEX volume dominance is also on the rise . In fact, it is on track to surpass the 25% level for the first time this June.\n\nAdvertisement\n\nOverall, DEX volume has hit $26 billion over the past seven days, according to data provided by Dune Analytics .\n\nEarlier this year, trading on Solana-based DEXex spiked due to the growing popularity of meme coins.\n\nSOL summer?\n\nThis comes as the \"Ethereum killer\" is benefiting from increasing ETF buzz. As reported by U.Today , New York-based investment firm VanEck filed to launch an ETF for Solana on Thursday; 21Shares followed suit with its own filing for the red-hot altcoin on Friday.\n\nHowever, those who expect this ETF to see the light in the near future should cool their jets. According to leading analysts in the field, the product is now expected to be approved this year.\n\nAfter initially seeing a sharp price spike due to the ETF hype, the SOL price is currently in the red, slipping by 0.2% over the past two weeks.\n\nThe popular altcoin is currently valued at $65.2 billion, according to data provided by CoinGecko. This puts it in the fifth place by market capitalization (behind only Bitcoin, Ethereum, Tether and BNB)."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMibkFVX3lxTFAzRV80ajkzbWs5UlAxNURid0FiU0hhYUE4Umcta3ZBdzVzQ1ZFNDFVN3hhbFZLR3FRY2hVSHRuMGEzemlMSm5LMXVGTlUtaTdQZVI2eTQyOVlaM0p3am1tQXZ1RnRzUHljWWRiX3pn0gFzQVVfeXFMUEpUNWEyNllxWjJOMzZrc0FtNUo3ZmlsVGF5aEdCTkQ3VEtaVjR2YlByNE1ZSld1b00zeU5fQ3hvSDlUVi01TlVOSXhGcVFWZ05QYUVvdktwYUd4WHBZM1hZa3lYTS00NmNyTmlxRklxYnFiQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Records Lowest Gas Prices Since 2016 - U.Today",
        "content": "On June 30, the Ethereum network recorded its lowest fees since 2016. According to data provided by Etherscan, the average gas fee is currently sitting at just 3 Gwei ($0.14), according to data provided by Dune Analytics.\n\nAdvertisement\n\nGas fees refer to the cost of various operations on the Ethereum blockchain. By paying gas fees, users help to ensure the security of the network. Apart from incentivizing validators, gas fees are also meant to prevent various spam attacks.\n\nDuring the 2021 bull run, Ethereum's gas fees were exorbitantly high due to high demand in the non-fungible sector (NFT). This prompted some pundits to argue that the network was unsustainable and gave rise to more affordable alternatives such as Solana.\n\nAdvertisement\n\nThis time around, Ethereum gas fees are hitting extremely low levels despite the fact that the network is also experiencing strong transaction activity. In fact, the volume of the leading altcoin is on the same level as it was during the beginning of the year.\n\nThe plunging fees can be explained by a higher level of efficiency of the Layer-1 market due to the combination of Layer-2 volume and the introduction of “blob transactions” with EIP-4844 that helped to significantly boost Ethereum's scalability.\n\n\"We will still see gas spikes above 15 gwei in times of higher activity. It’s just that overall the gas market has been more efficient post 4844. So we’ll have more affordable days than expensive ones,\" Pistachio Fi founder Brian Smocovich said in a post on the X social media network.\n\nBack to inflation\n\nThe massive drop in fees means that Ethereum is no longer a deflationary network since the amount of fees to burn is very small. This flies in the face of those who were pushing the narrative about \"ultra sound money\" prior to the Dencun upgrade.\n\nOver the past seven days, 14,393 ETH has been added to the network, according to data provided by ultrasound.money. This translates into annual supply growth of 0.62%.\n\nThe total supply of Ethereum currently stands at 120,185,061 ETH, which means that it is on track to reach a new 2024 peak."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxNc0xZWktGb1pLOW1KWlFkSy00TVcwcm01TWNRbkV4NDZvX0pJTktxeXFiYnNjV0dWTEx5UXBoSmw1SHJvbG01OHRxV28xMjFXTmZaY3RwNjcwV3VEODVMWVd1Y0hvUjI5N3VTY2tBbmJPTXV4MkJUVjNMRFc0TTBfQWlkOU1fcm5RbTBzZUU0WDlldUJFc3c2VWh3LUZUME1zWGtnQUcyUlFjQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Pulls 60,000 New Depositors as ETF Launch Nears - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxNUmk2cExjdGp4SXhOMlZ2RXItQUJfUE5MYWM5eDZqeUxfN2F1aTROaXZHbU9hdTFCWkt0ME5VaTBwSWIzbkpFbXZMTWl3RW5uUkFCbUtPYjlkV2FPeXVkRzkxaUNCOWVNMDFiWmxqV3pTTFV4UXBjSDdDVU9fckdHd2E4T2ZJeVN20gGOAUFVX3lxTE5VT2hab24yU19LUlhKS0IwaWh2enNsSE9GSE4wY3FmLUVGWVNnX0xPd1hJaXl6TEs1c0xUamx2ZjFUNHBxLUx5MmY5b25pZzRjYnVKZFNWM3FsWDEzM1NsVmloeW5rRFRrcjBQRkFnaHVqcHNuVEstNURTSFk3bGI4eDliV2NHVmFSNjJjTXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Jun 2024 07:00:00 GMT",
        "title": "Ethereum’s ‘failed’ breakout – When will ETH’s price breach $3.5K? - AMBCrypto News",
        "content": "Ethereum’s price dropped by over 3% in the last 7 days\n\nA key metric revealed that ETH was undervalued, hinting at a recovery on the charts\n\nEthereum’s [ETH] price action turned bullish on 28 June, giving investors hope for a recovery from their past losses. Unfortunately, this bullish trend didn’t last for long, as the coin recorded a price correction soon after. This led to both its weekly and daily charts flashing red.\n\nEthereum faces rejection\n\nAfter the aforementioned hike in price, ETH’s bears stepped up again and pushed the altcoin’s price down by more than 3%. At the time of writing, the king of altcoins was trading at $3,391.51 with a market capitalization of over $407 billion.\n\nThe worst news was that Ethereum got rejected from the upper limit of a bullish wedge pattern in the recent past. As per a tweet from ZAYK Charts, a popular crypto analyst, the token’s price started to consolidate inside the pattern in late May. A successful breakout could have resulted in a 30% price rise, which might have allowed Ethereum to go past $4k.\n\nInterestingly, a similar pattern had emerged earlier in March, only to break out in May. This allowed the altcoin to hit $3.89k on the charts. However, since ETH got rejected this time, the chances of history repeating itself might be slim.\n\nWon’t ETH recover?\n\nAMBCrypto then took a closer look at Ethereum’s current state to see whether it would fail to break out of the bullish pattern.\n\nWe found that market sentiment around the king of altcoins remained bearish. This was evidenced by the dip in its weighted sentiment after spiking on 28 June. Its network growth also dropped slightly, meaning that fewer addresses were created to transfer the token.\n\nNonetheless, a few of the metrics were in favor of a successful breakout.\n\nFor example, the MVRV ratio has improved over the last few days, which can be interpreted as a bullish signal.\n\nAMBCrypto’s assessment of Glassnode’s data also revealed that Ethereum’s NVT ratio had declined sharply. A drop in this metric usually means that an asset is undervalued – Implying an incoming price hike.\n\nAMBCrypto then took a look at Hyblock Capital’s data to look for immediate support and resistance levels.\n\nAs per our analysis, it would be crucial for ETH to touch and go above the $3.5k-mark in order to sustain a bull rally as liquidations would rise sharply. Generally, a hike in liquidations often results in price corrections on the charts.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nOn the other hand, if bears continue to dominate and ETH’s volatility rises in a southbound direction, then it might fall to $3,060."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxQVjEwc1FyV2tQZkhyaTZaa2kyVDZJcTI1SGtxdzFaNkpsSFpmMFpuVTdtUm1Ga2VJRXpNcTF3OXNWel80MDMyRE5VMHIxdlBVU3YxS0pKYkUyQzh6WHk0R2Z6UElxcnpWZ3IwdDVNSkVqTkxGYkk0QXU2a2dCMUZJeXVjaW82aVhfVXVtX2ctM05FRFhk0gGaAUFVX3lxTE1ZYVI4RTJjSFZZblFyWFdxWXNsQnlHbGJUSmZoejdZamY4d3EtTlFWX1lrTTMzcEFHLUpWN1JlUTdVQXhXYmNvOEQ2RDRTOWNONFZGbFdMYnN5aW5pbUlJUDZBaXFCeE1zaHJlbldJS3ZMaUZIbU5Md3ZtQUM3LVkwc1VBb1ZvTzFKdklLejE5ZmgzTTRZWTlqX3c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Jun 2024 07:00:00 GMT",
        "title": "What to Expect for Ethereum Price in July Based on Historical Trends - CoinGape",
        "content": "June Month was notably bearish for the cryptocurrency market with many assets revisiting their monthly support. Amid the market sell-off, the Ethereum price plunged from a high of $3887 to a low of $3232 registering a loss of 16.9%. However, the downfall lies within the healthy retracement of Fibonacci tools indicating a strong could allow ETH bulls to counterattack.\n\nAlso Read: Crypto Market This Week: Ethereum ETF, FOMC Minutes, US Job Data & Trade Deficit\n\nadvertisement\n\nEthereum Price Eyes Stability as 78% of ETH is Held by Long-Term Holders\n\nThe near-term trend in Ethereum price is sideways evidenced by a new lower high formation at $3975 in late May. This reversal indicates the overhead supply is high from market sellers and ETH buyers would need time to recuperate its momentum.\n\nConnecting the overhead peaks with a trendline reveals a potential triangle formation as the altcoin has also received dynamic support from an ascending trendline since October 2023.\n\nThe Ethereum price currently trades at $3389 and holds a market cap of $407.3 Billion. If the supply pressure persists, the coin price could plunge another 5% to seek support at the long-coming trendline.\n\nThe renewed buying pressure from the trendline could uplift the asset by 14-15% and challenge the triangle’s upper boundary at $3860. A bullish breakout from the triangle pattern will signal a better confirmation of uptrend continuation.\n\nAlso Read: ETH/BTC Pair Poised for Breakout as Ethereum ETF Launch Approaches: What’s Next?\n\nIn a recent tweet, the prominent crypto analytics firm IntoTheBlock revealed a striking statistic: 78% of Ether is currently held by long-term holders. Despite the volatility in Ethereum’s price, the proportion of ETH held by long-term investors has steadily increased, indicating a strong belief in the asset’s future value.\n\n78% of ETH is owned by long-term hodlers pic.twitter.com/9vb5kaUIar — IntoTheBlock (@intotheblock) June 28, 2024\n\nEthereum’s price performance in July has exhibited a mix of gains and declines over the past several years, reflecting the broader market’s volatility and investor sentiment. The biggest gain was +56.62% in 2022, while the largest drop was -27.29% in 2017.\n\nOn average, July has a positive return of +6.95%, though the median return is -4.41%, indicating mixed performance.\n\nHowever, with the ongoing development around U.S-listed Ethereum ETFs, anticipated to launch around mid-July, the odds strongly lean on buyers’ favor.\n\nTechnical Indicator\n\nBB Indicator: An upswing in the lower boundary of the Bollinger Band indicator losing bearish momentum and additional support for buyers to rebound.\n\nMoving Average Convergence Divergence : A negative crossover between the MACD and signal line highlights the near-term trend is intact and bearish.\n\nFrequently Asked Questions (FAQs) 1. What role do long-term holders play in Ethereum's market stability? A3: Long-term holders, who currently own 78% of Ethereum, play a crucial role in its market stability. Their sustained investment indicates a strong belief in Ether's long-term value. 2. What impact could the launch of U.S-listed Ethereum ETFs have on its price? The anticipated launch of U.S-listed Ethereum ETFs could significantly influence ETH price by potentially increasing buyer interest and investment. This development is expected to provide easier access for a broader range of investors. 3. How does the \"Fear and Greed Index\" affect Ethereum trading decisions? The Fear and Greed Index measures investor sentiment in the market, which can be a useful indicator for traders to gauge the general mood among market participants.\n\nRelated Articles\n\nSahil Mahadik Sahil is a dedicated full-time trader with over three years of experience in the financial markets. Armed with a strong grasp of technical analysis, he keeps a vigilant eye on the daily price movements of top assets and indices. Drawn by his fascination with financial instruments, Sahil enthusiastically embraced the emerging realm of cryptocurrency, where he continues to explore opportunities driven by his passion for trading\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    }
]