[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxOb29STFdXNjNqQkhPdjFKd01lZzd4X1h3WVdKbTdKc3JZZlJMdlZNLURVSkVUQ0Q5UXBvTmh5UktOY29ZVjREQWxBT19CVmFsOFNHV1VTQzRHU2x4b0dEeHA1eFplcFM1djFJZXpzaVhpaUViQTN6ZDFaZjBFTlFBcnEtdkFuR1ZCbjlicTRKdlZzdmdyRmJpV2RDaTlQOU1UTzkxbXZDZkN6cWM2UDZSbVY0cEktSUptYjlyWlRxenZ3dWlpNnVjMENNZk1wMWhrcjl6aVpCY9IB3AFBVV95cUxNQ2RUNDkteFUzSTVCS0NTV3N0eEdjWjdMZXNuNmw3ZWdCZFZCUE02Z3V2V1hBXzNtS2lON2EycG9ER3FNU1I3VGp2bWhWelFaSkpQOHEwNy1Md2JaQUhySE1Eem5NUXl5Si1OdjJQOVRnZ0x3M0ZqZ09QQlN1ZEt0d3ktNjdMX1BLM0x6T2NnU3hzSVBWcWdZTDExWDlpU29PWV95VjR5QUQ3OEdRTFpNaXJ5ajdyYTk4M1IyN1RUZ3ozemZQNzh0SWFuam5SMVc1bV9SUk9kdkduRnRL?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jan 2024 08:00:00 GMT",
        "title": "BlackRock Wants to Follow Bitcoin ETF With an Ethereum ETF. Marketing It Might Not Be So Simple - CoinDesk",
        "content": "BlackRock Wants to Follow Bitcoin ETF With an Ethereum ETF. Marketing It Might Not Be So Simple\n\nLarry Fink has been talking up a spot ether ETF, but index provider CF Benchmarks sees a conundrum when it comes to selling that product.\n\nBy Ian Allison Jan 16, 2024 at 4:48 p.m. UTC\n\nElection 2024 coverage presented by Stand with crypto"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxOQmdPUWpkTW9LbklidzNVd2lIMnZURjVwWE5fNS1pUXN6ZkRXbzBVMW9hbW5zVjBoY055eDR6SURLLUUwaUhQay10NDJtQ3UzaHpNVU9GVmJ0VXh1WmxTR2UyNndYWk9qeFV2U3VqY21WbzFtQW00TmtPb3RLSzllbzhuckZkRm9melhLQk5pNWF1TktlWlN1MG5mVVlnRFN6OGdFNTk5UF8tUms4d0HSAbMBQVVfeXFMUHV3eVJHM25TZHdhUGkya3I4Z3c4TGk0ajkxSnZUb0FweDJfdWx0Qm4wZVVnblk3Sm1CTHFncG10MTF3OEd3RU10bHFFRkhVRW5rN2FPMnhlOWNNOEt4NDBLTlZGNmdfMm5lN0NwWUNxeDQ1Uk5mMk5VT2ljOTFwVmVXM3RYSWJrQzVSMjZwUTFydElLU3p3NFFnOFVvQkJNUkRlR2tINjlrY2ZsM2lQVXQ1RTQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jan 2024 08:00:00 GMT",
        "title": "Ethereum’s Dencun Upgrade Goes Live, But Fails to Finalize on Testnet - CoinDesk",
        "content": "That method, “proto-danksharding,” is a mechanism that will add capacity for data availability as well as help reduce the cost of transactions for layer-2 blockchains. These auxiliary networks have proliferated in the past year as an alternative to processing transactions on the main Ethereum blockchain, but analysts say their growth is hampered by the steep data costs under the current setup."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxQRlcxZXNUUE10WllhMXdzd2tuMUhJLUdGNkNTV1h5bnRxY1FLRkw5WmdwX3hlc09McmZlTGx4dkZKSkptWHBJSW5Hbko3S1YyRzdyVThrSEo4OFBzTktnaFJ2UVFjWXZXR3gzSHJoRWxENmk2RGgtVUNPczFrRVVQZlZOekRNSXBRdmdCNDNfNWc1Y1Q4WGhycFl4eXd5OWFSbkdPaDBzQnBvYUhZS0hr0gG0AUFVX3lxTFBVQ1Nxc0Z1TXpOSFp5bkFadkNVakFXOTRjdmNZakRFQ01LRnBCakh0dVlmUTdzUlFqeVMyT3V0dmtyVVA2TjlYcFY2N25BQkZ0N19oU0Jwa1pFTGVobktEdDVlYk5uaWVVT1dnMTVBTU1CUXQyR3B6RXlyelplYm56MmxwUllnUlVtTEZFM3Z5T0x0RkdUTnJZUEVINWwxbFd4aE9rTTR2QVp6dTlWcWJFa1VrMQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jan 2024 08:00:00 GMT",
        "title": "ETH Still Bullish Despite Drop to $2.5K, What’s the Next Target? (Ethereum Price Analysis) - CryptoPotato",
        "content": "Ethereum’s price has encountered a substantial obstacle following a significant surge last week.\n\nThe market is currently correcting, and traders are wondering whether a reversal is on the horizon.\n\nTechnical Analysis\n\nBy TradingRage\n\nEthereum Price Analysis: The Daily Chart\n\nOn the daily chart, the price has been very bullish over the last quarter of 2023, increasing by more than $1,000. Recently, ETH has experienced an aggressive rally toward the $2,700 resistance zone. However, this level has decisively rejected the price, and a correction toward the $2,400 area has begun.\n\nMeanwhile, the Relative Strength Index still demonstrates values above 50%, indicating that the momentum is still bullish and the price is likely to continue its uptrend after the correction is done.\n\nThe 4-Hour Chart\n\nLooking at the 4-hour chart, it is clear that ETH’s price has formed a double-top pattern at the $2,700 resistance level. The relative strength index also signaled that the asset is overbought in this timeframe.\n\nCurrently, the price is forming lower highs and lows, potentially targeting the $2,400 level in the short term. Yet, this level seems likely to hold the price and initiate a rebound back toward the $2,700 level afterward, as the overall market structure is still bullish.\n\nSentiment Analysis\n\nBy TradingRage\n\nEthereum Open Interest\n\nWhile Ethereum’s price is still continuing its bullish trend, some worrying signs are arising from the derivatives market. It is beneficial to have a closer look to determine whether a bearish reversal can be expected or not.\n\nThis chart depicts the Taker Buy Sell Ratio, one of the most valuable metrics for futures market sentiment evaluation. Values over 1 indicate that the bulls are executing their orders more aggressively, while values below 1 point to the bearish selling pressure.\n\nWhile the Taker Buy Sell Ratio has never recovered above one during the recent uptrend, the price has been rallying higher. However, it is currently dropping rapidly, making a new low. This cannot be interpreted well, and the subsequent aggressive selling pressure by the futures trader can soon cause a considerable decline in price."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxOcmlLTWxGTGxzMEZpa1VBOWFhWmRRY01idEVwLWxrczk2eWZGbXJMMktKNmxkQ3hWelcyaEVlM294THVyUnBMaEJvTy1sZ0dud0FYLTM4OW03ekc1UFpaNmY4bWdGeEpWVEJ5ZkVqb29TNGh4SEM5VWw2RUFaR0xhU08xd0VRZ2hORFRibUJlUTFsSkRkT0xaZS1XVkx6Z0h2ZDNpY1NKaGRaTVNyMGfSAbMBQVVfeXFMTkRwSUZXQkhaOTB1bHFab3l1Um4xbVRFdGViczBNVFpwNEtfMjJ6N3JYa1ozNXdkaUJpQ1JHblBaRlJjS19ubzl3SDhxcndKVGJEcnFqZXRkNkZrNlVqWWZCd0ktLTg2QXJ0RXl5cU5QUmpUOU82TklqVEJvZ2liekxoT3M0ZGRvaU5EYzdOMEU2S014bHRCdEhicW9NbF9ybVhHdW1vdmJ6aHdCdmVJdHZYUjQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jan 2024 08:00:00 GMT",
        "title": "Shiba Inu (SHIB) Becoming Bullish, Ethereum (ETH) Price Screams Rally Continuation, Bitcoin (BTC) Not Giving up Market Dominance - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nShiba Inu currently displays an ascending triangle pattern on the SHIB/USDT chart. This technical formation is widely recognized and could be a signal to a significant price surge for the meme.\n\nAdvertisement\n\nAn ascending triangle is characterized by a flat upper resistance line and a rising lower support line. This pattern suggests that buyers are gradually gaining ground against sellers, as each dip is bought up at a higher level than the previous one, indicating accumulating pressure for an upward breakout.\n\nSHIB/USDT Chart by TradingView\n\nFor Shiba Inu, which has been lingering in a period of relatively nonexistent activity, this pattern could serve as massive fuel for volatility in the near future. Recent market conditions have seen a decline in interest toward legacy meme coins, with SHIB being no exception. The lack of significant developments within the Shiba Inu network has contributed to the muted activity around this cryptocurrency.\n\nIn contrast, the majority of the action in the meme coin sector has been taking place on the Solana network. This platform has become a hotbed for the deployment of new meme coins, which are exhibiting far greater volatility than those on the Ethereum network, where Shiba Inu resides. The brisk activity on Solana contrasts sharply with the sluggishness observed in Ethereum's meme coin space, drawing in traders and investors looking for quick gains and high excitement.\n\nEthereum's correction is temporary\n\nThe Ethereum market is currently exhibiting a correction, and there are patterns that suggest a rally may not only be on the horizon but could also be in continuation. The asset has recently experienced a sharp downturn, movement that is readily apparent on intraday timeframes. However, such stark movements are often precursors to reversals, signaling that Ethereum could be gearing up for an upswing.\n\nA closer look at the charts shows Ethereum's price action respecting a series of key technical indicators which, together, build a case for potential upward momentum. The asset has been tracing back to touch base with its moving averages, a behavior that is typically followed by a rebound, as these levels can act as dynamic support zones.\n\nThis corrective phase is noteworthy, especially considering the robust rally Ethereum enjoyed in the preceding weeks. Corrections are a natural and healthy part of any asset's price trajectory, allowing for consolidation before the next leg up. For Ethereum, the current pullback could be shaking out weak hands, setting the stage for a stronger rally propelled by a more committed investor base.\n\nBitcoin's dominance not going anywhere\n\nAfter a brief breach below the 50-day EMA — a critical indicator of medium-term market sentiment — Bitcoin has clawed its way back above this pivotal level. This move indicates a bullish signal for market observers, suggesting that Bitcoin is not yet ready to relinquish its market dominance.\n\nHowever, the ascent above the 50 EMA has not been met with the kind of vigorous momentum that bulls would hope for. The growth has been moderate, hinting that Bitcoin might encounter selling pressure as it ascends. This is not unusual on the crypto markets, where significant moves often face immediate resistance as traders take profits and skeptics cast doubts.\n\nThe recent price action has been a roller coaster for Bitcoin, which saw its value tumble from highs around $47,000 to lows near $41,000. This downturn briefly shifted the spotlight to altcoins, which seized the moment to stage local rallies. The diversification of gains across the crypto spectrum during Bitcoin's periods of weakness is a trend that has become more pronounced as the overall market matures.\n\nYet Bitcoin's ability to push back above the 50 EMA serves as a reminder of its underlying strength and the confidence investors have placed in it. Despite the opportunity for altcoins to rise, Bitcoin remains the anchor of the crypto market, with its moves often dictating broader market sentiment. This recent rebound above a crucial technical level could be interpreted as Bitcoin's silent assertion that it is not ready to give up the throne just yet."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTFBEQlNLWkx2ZE1KdjZwT1V5OUZOa2VsTGE1VG15OWlObnZrSWZWY3ktN0N6RjVuMnAySlJ1MFJ1UGtrSGtLVVFGVS1qajZ5N0d6RHNwNmt1UHZCaGVraUV5SnFpcmwzN1gzQWRseTRoYVdDNkw4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jan 2024 08:00:00 GMT",
        "title": "An Introduction to ERC-4337 (Account Abstraction) Standard - Unchained",
        "content": "The new ERC-4337 token standard enables account abstraction for Ethereum users, allowing for the creation of easier-to-use “smart wallets.”\n\nA significant impediment to crypto adoption is the complexity of account management. But that could soon be a thing of the past, thanks to Ethereum’s newest token standard, ERC-4337.\n\nThis guide will explain what ERC-4337 is, how it works, and its significance to the Ethereum ecosystem.\n\nWhat Is the ERC-4337 Token Standard?\n\nERC-4337 is an account abstraction standard for the Ethereum blockchain, seeking to improve user experience and security by introducing smart contract functionality in wallets.\n\nThe standard is Vitalik Buterin’s and other developers’ brainchild, conceptualized in 2021.\n\nWhat Is Account Abstraction?\n\nIn most blockchain systems, users manage their transactions through Externally Owned Accounts (EOAs). These accounts require them to own private keys and use them to process each transaction, creating challenges such as security risks, limited functionality, and usage complexity.\n\nTo address these challenges, Ethereum is adopting account abstraction.\n\nThis blockchain concept shifts user transactions away from exclusive dependence on EOAs. Instead, it embeds smart contracts in users’ wallets, allowing them to interact with other contracts and thus complete exchanges automatically.\n\nBesides automating transactions, these “smart wallets” can determine the appropriate gas fees a user should incur in each exchange. They also support advanced security features, as we shall see later.\n\nKey Features of the ERC-4337 Standard\n\nA deep dive into the ERC-4337 standard reveals the following key features:\n\nUser Operations (UserOps) : Imagine it as a list of all the actions you provide your Ethereum account to execute.\n\nBundlers : The nodes that submit UserOps to the network for verification.\n\nEntryPoin t: The smart contract that performs UserOps.\n\nPaymaster : This entity manages the gas payment system.\n\nHow Does ERC-4337 Work?\n\nERC-4337 token standard transactions undergo a four-stage process.\n\nThe first is the initiation of UserOps, which are instructions for the desired actions, for example, sending tokens. The unconfirmed transactions go to an alternative mempool specifically built for ERC-4337 exchanges.\n\nThe bundlers then select several UserOps from the mempool and pack them into a single transaction called the bundle. Gas fees are the primary determinant of which UserOp the bundlers prioritize. From here, they send the bundle to EntryPoint, a global smart contract on the Ethereum Ecosystem.\n\nFor validation, bundlers trigger the “handleOps” call function on the EntryPoint. That allows the smart contract to receive the bundle transactions. Consequently, it requests a “validate UserOp” function for every account, enabling authentication of the operation’s signature.\n\nOnce everything checks out, the EntryPoint processes the appropriate gas fees. Every ERC-4337 wallet must then perform another function to complete the transaction sent to them by the EntryPoint contract. Bundlers receive payments for each successful UserOp to incentivize their facilitation of the process.\n\nBenefits and Limitations of ERC-4337\n\nAccording to its proponents, ERC-4337 will fundamentally transform Ethereum for the better. But as with any technology, it also has its downsides. Let’s look at its potential positives and negatives.\n\nPros\n\nEnhanced Security: The token standard removes the complexity of managing private keys and seed phrases, enhancing security with two-factor authentication and biometrics.\n\nCross-chain compatibility: The standard works across multiple blockchains compatible with the Ethereum Virtual Machine (EVM).\n\nPotential Scalability: ERC-4337 batches transactions akin to rollups, which could increase the Ethereum network’s throughput for the benefit of its users.\n\nSupports multi-party transactions: ERC-4337 supports creating shared dealings with other parties through multi-signature operations and sponsored transactions, enabling a third party, such as a dApp or another wallet, to pay your gas fees.\n\nSocial wallet recovery: With ERC-4337, you can whitelist certain addresses to assist in account recovery if you lose your logins.\n\nCons\n\nIt lacks true account abstraction: Currently, ERC-4337 only provides an off-chain medium for managing your transactions before sending them to the mainnet. Proper account abstraction is more comprehensive, requiring a significant update of Ethereum’s consensus protocol.\n\nIncreased DoS risk: The standard’s complex verification process could heighten exposure to denial-of-service (DoS) exploits.\n\nLimited Transaction Volumes: ERC-4337 accounts can only send one transaction to the mempool at a time.\n\nPotentially Higher Gas Costs: Adopters of ERC-4337 transactions could pay more gas than they would do in regular transactions.\n\nWhat Is the Role of the ERC-4337 Standard to Ethereum Users?\n\nThe ERC-4337 token standard is still developing in the Ethereum network and will likely grow in adoption and function. Adopters can put its features to many uses, including:\n\nCustomizing spending: Users can tailor-make their transactions by setting wallet usage instructions and spending limits. Again, they can activate notifications for certain margins. This way, their smart wallets will act similarly to the regular credit card.\n\nSubscribing to Web3 services: As the standard supports account programming, users can factor in periodic spending in their wallet’s code. Similarly, they can set up other crypto-specific pay-to-use plans.\n\nAutomating DeFi functions: Your smart wallet readily interacts with different decentralized applications critical to the DeFi sector . So you can instruct it to automate certain DeFi functions, like seeking the best liquidity pools for your funds.\n\nMulti-token gas payments: ERC-4337 expands your gas-paying options because its account abstraction feature facilitates fee payment with any ERC-20 token. That eliminates the need to hold or convert your holdings to a particular token for gas payments.\n\nFinal Word\n\nThe deployment of the ERC-4337 token standard on the Ethereum mainnet has stirred the crypto community for good reasons. Chief among them is its ability to streamline the crypto adoption process. That said, it comes with its fair share of challenges necessitating care in its adoption.\n\nOne thing that’s for sure is that it is a groundbreaking technology that has the potential to alter the Web3 user experience."
    }
]