[
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxOYTV5a09lVmh6MFVndDZtQWNpc3Zmbk5lZ0w2TVNRSHFYRTZuTHE1SnFoNEwzX3ViQVhjNHpTRUxPanp2SUhRdzFYaUx6MWNxU01rQURQTzlDY1lhRl85cFRkclhwR3MtQkxZeDdsbnFBQmFaU1VFaVRMUTRSdDRnZXNiRTdSaDZKNWx0dVlzZWhPQTc0NG9ERGlrTl9FbW11cldBV3BSUDdoeEhzOVd6TmpKN21hSE9HcmdrNUg5SGIyRUo2QTA00gHMAUFVX3lxTE93NzdJT1lxeHA4WmpxaE01aGhJWVZRaEJkTFlOOHNjX05TTVUyT2IyVnVvS2dmOUUzY0VPNTBoZjlFbkVxREJQXzJGRVdxdFdCWWl5RTQzSE50Z2ppT09KMHNvcXNSM2tUa21WRTlKRDBHNXFEODFvWWJWckRPNW84V242d1dyckhhSlZRVGUzT0JFUkY2bnhqb3JvSmt0Y2JVemZkajAyMTE1bnRIb015N2JiNVo5WWphbDlDbWtPeVpoRmRHMkEyc3g0Rg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 May 2024 07:00:00 GMT",
        "title": "Bitcoin's Ethereum-Style Programmability Could Come in 12 Months, Rootstock Founder Says - CoinDesk",
        "content": "Linus's release of BitVM last year has been widely cited by Bitcoin developers as a breakthrough for the 15-year-old blockchain since it theoretically would facilitate the development of programmable layer-2 networks similar to those that are being used in the Ethereum blockchain ecosystem to make transactions cheaper and faster. Key to the project's promise is that BitVM would require no changes to the underlying Bitcoin code – seen as crucial due to the blockchain's decentralized governance, often lacking consensus among developers over major upgrades."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxOVnNwSmdXbjg0Y1hGN3VXYTV0NHFpQnU4eDRlcDN5UFBtb0laUW1XNlMxZ3U3RGZ3c3pocjlSODRCWTVnVnBzLURqQ0tkVng2bVJ0N0o2aWc3YVd1eEk3SFk3NDhxV1IwNF9qZnFnZk5iaktib0JzMWF6N2F5QjNWeElFeFh2bGhuQnZwQ1lFVk5sZzF1TEVXUTlLNTJnSktjc2xsLThHVTDSAbABQVVfeXFMUHk0Tzl0dV9WVnNEUVV4V2pHd2trTURoczFXcUpaMjdvYnh5X25ydk1MSFNHMTFsVXpPM0VqWkk2dUs2Tk1yYUtRSmgtTlJ6NndNcktyRVFrbGpwWTZvVFp0YUNTNHBDbnNqelNjUWZvY0NMdlM0TGlWZ3p5eHhQemN3SUVFcDhUbkJ0OGx2Mk1SOG9LUkF3RVhRNEVsMC14OTNvSjA5Nmk3ZTQtM0VrZV8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 May 2024 07:00:00 GMT",
        "title": "Bitcoin Crashes to $57,000 and Ethereum Slips Below $3,000 Hours Before Fed Meeting - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIn the hours leading up to the next Federal Reserve meeting, investor pessimism has hit Bitcoin and Ethereum hard.\n\nAt the time of writing, BTC has dropped 7.6% and ETH is down 6% over the past 24 hours. The Bitcoin price is hovering around $57,000, while the Ethereum price is stuck at just under $2,900, according to data from CoinGecko.\n\nThe volatility has been hellish for derivatives traders. In the past 24 hours, $457 million worth of crypto futures positions have been liquidated, according to CoinGlass. And no big surprise, $392 million of those were long contracts.\n\nTraders opening futures contracts are essentially placing bets on future price action. To be long on an asset is to bet the price will go up. And to be short on it is to bet it'll go down.\n\nAD\n\nAD\n\nAnd it's not just blue chips like Bitcoin and Ethereum that have been impacted. Sagging prices have been widespread throughout the market. In fact, out of the whole top 100 cryptocurrencies by market capitalization on CoinGecko, just a few assets have escaped the sea of red, barring stablecoins that have managed to maintain their pegs, such as Tether (USDT) and Circle's USDC.\n\nThe U.S. Federal Open Markets Committee will publish its interest rate decision at 2 p.m. Eastern Time today, with Fed Chair Jerome Powell scheduled to speak at a press conference at 2:30 p.m.. Back in February, investors seemed certain that May would be the month that the FOMC finally cut interest rates—which is usually a bullish sign for risk assets like Bitcoin.\n\nThat's because lowered interest rates usually coax traders out of U.S. Treasuries to chase gains in riskier assets, like equities and crypto assets.\n\nThe Fed's key interest rate currently stands at a high of 5.25% to 5.5% and has been unchanged since July 2023 as the central bank aims to curb inflation. Policymakers have been keeping a close eye on inflation, which is currently 3.5%, in hopes to get it closer to 2% before considering rate reductions. But that's becoming a distant hope, as last month inflation increased to the highest it's been since September.\n\nAD\n\nAD\n\nTraders had a small jolt of hope in March, when the Swiss Central Bank announced it was cutting interest rates. “For some months now, inflation has been back below 2% and thus in the range the SNB equates with price stability,” the central bank wrote in its decision at the time. But it seems the sentiment in Switzerland hasn't spread to other major central banks.\n\nJust a month ago, traders seemed certain that the Fed might lower interest rates in June, according to the CME Fed Watch tool. But sentiment has soured. Traders don't expect to see the Fed ease interest rates until December—and even then it's just a 75% majority that seem to feel that way."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE8zakJvNmZXVmR5Nks5QlU0dndqeFVaSmdRTEt1dGk5MTVWMDFzejczUUlTeDBuVktkRGxVeWtyd2hpc3ZKYkRfRkVBeUlJU2FDdTI1OTBBZzFWNjB4VVZhU095TXpQM2dxYXdEdVdfYVrSAXhBVV95cUxObllKSmhRVkQzbnhpTTl5bG9kMFdWZVduMTlMYURkWUZpdzZ3dm5NSUgzYmswRkhFcThQWXhVT3QtRzVreFZ1eEhjVlFqRnF0QVNfWU9URGdCZEJpOFpVYkRzUU5sMUJ2SU9nQ09UTFZiSWo4YnVUdm0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 May 2024 07:00:00 GMT",
        "title": "If the SEC Thinks Ethereum Is a Security, Are ETH ETFs Doomed? - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nWill the SEC approve an Ethereum ETF this year?\n\nOptimism among market participants is fading—and now that the SEC’s stance on Ethereum as a security has been made public, those hopes may have been shot down for good.\n\n“If this SEC approves a spot Ethereum ETF before the election, I will eat my HODL hat,” Matthew Sigel, head of digital assets research at Van Eck, an Ethereum ETF applicant, told Decrypt.\n\nThat’s because of a lawsuit filed last week by Ethereum software company Consensys against the SEC, which revealed that the Commission believes Ethereum (ETH) to be an unregistered security—and that the SEC has, for the last year, pursued investigations on that basis. Consensys wants a court to declare Ethereum as a non-security, preempting any forthcoming charges from the SEC. (Disclosure: Consensys is one of 22 investors in Decrypt.)\n\nAD\n\nAD\n\nTo be clear, the SEC has yet to bring charges against Consensys, or anyone else, that formally allege Ethereum is a security. But the revelations in the Ethereum giant’s lawsuit have already had far-reaching implications, with top Washington lawmakers accusing SEC Chair Gary Gensler of lying to Congress last year about the agency’s position on ETH.\n\nWhile the long-term impact of SEC’s investigations into Ethereum plays out, in the more immediate term this means spot Ethereum ETFs likely aren’t happening—at least, not without another legal fight.\n\nSpot market Ethereum ETFs would allow Wall Street firms and investors to gain indirect exposure to ETH without having to deal with crypto exchanges or wallets. After a decade of denials from the SEC, spot Bitcoin ETFs finally gained approval for trading in the U.S. market in January—but only after Grayscale, one of the biggest digital asset managers in crypto, successfully sued the SEC to make it happen.\n\nStill, after Bitcoin ETFs got the green light, analysts assumed spot ETH ETFs were right behind, with approval likely by summer. Now analysts and ETF issuers on Wall Street aren’t so sure.\n\nAD\n\nAD\n\nEthereum ETF applicants are expected to hear back from the SEC regarding approval by May 23. By last month, analysts were already cooling on the prospect that these initial filings would gain approval; this week’s news has only further convinced experts that ETH ETF applications have a ways to go.\n\nEric Balchunas, Bloomberg’s senior ETF analyst, opined on Twitter this week that the SEC’s now-evident position on ETH’s security status likely means spot ETH ETFs aren’t coming to Wall Street any time soon. And that’s because ETFs based on commodities and securities operate on different rules, he said.\n\nYes dif rules, 33 act for commodities — Eric Balchunas (@EricBalchunas) April 29, 2024\n\nIt doesn’t appear, though, that the SEC’s apparent hostility towards Ethereum has spooked would-be ETH ETF issuers—at least not yet. A spokesperson for crypto fund manager 21Shares, the first-ever Ethereum ETF applicant in the U.S., told Decrypt that the firm remains committed to seeing its petition approved.\n\nVan Eck, a more traditional Wall Street investment firm, remains all-in as well.\n\nThe company’s digital assets research chief Matthew Sigel believes the product will be approved “in time.”\n\nBut he emphasized that Van Eck’s experience bringing crypto to Wall Street has never been without conflict. This week’s news constituted just one additional bump in a road the firm always expected to be long and winding.\n\n“This has been war since January of 2022, it's been a war for the entire Biden tenure,” he said. “Part of our investment thesis for this asset class is that it will continue to win the bigger battles in the courts over time.”\n\nAD\n\nAD"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxOSW9oYURZbXlhalhsbDQ3dkt3UjBRMDY5am13cjlaRl9LcVNPbi11R0V0V0VJYTAzX2dVNFUxYjZudE41WHVnMFlGS2c1RmNobEZvbnB1RFY5am1ZTFlpUGFsYU5IdFJfdUtQcjBPT3l6c09HaXhodGloeGdfQzVXRmV6ZGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 May 2024 07:00:00 GMT",
        "title": "Who Holds The Most Ethereum (ETH)? How Coinbase, Grayscale, Robinhood And Binance Stack Up - Yahoo Finance",
        "content": "Who Holds The Most Ethereum (ETH)? How Coinbase, Grayscale, Robinhood And Binance Stack Up\n\nOne of the most interesting aspects of blockchain is that everything is public. All transactions, wallets and portfolios are entirely accessible to anyone, allowing for an unprecedented amount of insight into a financial asset class.\n\nThe uses of the data can range from monitoring overall trading activity and flows to seeing what the largest wallets and firms are doing with their positions. Arkham Intelligence is a blockchain analytics platform particularly interested in the second application. It cross-references financial disclosures by firms and individuals with on-chain activity to match up entities with specific wallet addresses.\n\nDon't Miss:\n\nDogecoin millionaires are increasing — investors with $1M+ in DOGE revealed!\n\nAccording to Cathie Wood, holding 6 Ethereum (ETH) could make you a millionaire, here’s why it can be true.\n\nWith Arkham's insights, anyone can see how the largest entities in crypto are trading. One interesting application is looking at the largest firms in the space.\n\nCoinbase, one of the largest crypto companies in the world, operates a centralized exchange, wallet service and a layer-2 called Base. Coinbase's portfolio is worth nearly $80 billion. The wallet is composed almost entirely of Ethereum (ETH) and Bitcoin (BTC). The firm holds over 900,000 BTC, currently worth over $55 billion. It also holds over 6.6 million ETH worth roughly $20 billion.\n\nWhile Coinbase operates as a crypto custodian, Grayscale is a crypto asset manager. It creates a handful of funds and ETFs that allow investors to access crypto products. In January, it was one of the first companies to offer a spot Bitcoin exchange-traded fund (ETF) converted from a previously released futures ETF. Grayscale's portfolio has more than 99% of its value in ETH and BTC. It owns 303,050 BTC worth $18.6 billion and 2.98 million ETH worth $9 billion. Grayscale holds $27.6 billion in crypto assets.\n\nTrending: 1 in 4 Americans own a share of Bitcoin according to NASDAQ, how much would $10 get you today?\n\nWhile it is mostly known for its equity platform, Robinhood began offering crypto several years ago. The crypto platform offers a handful of the most popular tokens, but the portfolio is mostly invested in ETH, BTC and Shiba Inu (SHIB). The wallet has 140,000 BTC worth $8.6 billion, 1.5 million ETH worth $4.7 billion and 42.5 trillion SHIB worth $1 billion.\n\nAs the largest crypto exchange in the world, it is no surprise that Binance (BNB) has the largest portfolio, worth over $200 billion. It holds 165 million BNB worth $94 billion, 640,000 BTC worth $40 billion, $27.2 billion worth of Tether (USDT) and 4.4 million ETH worth $13.2 billion.\n\nStory continues\n\nCoinbase has the largest ETH holding on the list. Its $20 billion of ETH is more than 5% of the total supply. The four firms hold a combined 15.5 million ETH, which is roughly 12.7% of the supply.\n\nWhile this may make it seem like the supply of ETH is heavily concentrated among a few entities, Coinbase, Robinhood and Binance hold assets for their customers. The portion of the supply held by these firms is under the discretion of the millions of people who hold ETH on these brokerages.\n\nRead Next:\n\nBitcoin has jumped another 45% already this year – how much would you need to get started today?\n\nIf you invested $100 in DOGE when Elon Musk first tweeted about it in 2019, here’s how much you’d have today.\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nGet the latest stock analysis from Benzinga?\n\nThis article Who Holds The Most Ethereum (ETH)? How Coinbase, Grayscale, Robinhood And Binance Stack Up originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxOSW9oYURZbXlhalhsbDQ3dkt3UjBRMDY5am13cjlaRl9LcVNPbi11R0V0V0VJYTAzX2dVNFUxYjZudE41WHVnMFlGS2c1RmNobEZvbnB1RFY5am1ZTFlpUGFsYU5IdFJfdUtQcjBPT3l6c09HaXhodGloeGdfQzVXRmV6ZGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 May 2024 07:00:00 GMT",
        "title": "Who Holds The Most Ethereum (ETH)? How Coinbase, Grayscale, Robinhood And Binance Stack Up - Yahoo Finance",
        "content": "Who Holds The Most Ethereum (ETH)? How Coinbase, Grayscale, Robinhood And Binance Stack Up\n\nOne of the most interesting aspects of blockchain is that everything is public. All transactions, wallets and portfolios are entirely accessible to anyone, allowing for an unprecedented amount of insight into a financial asset class.\n\nThe uses of the data can range from monitoring overall trading activity and flows to seeing what the largest wallets and firms are doing with their positions. Arkham Intelligence is a blockchain analytics platform particularly interested in the second application. It cross-references financial disclosures by firms and individuals with on-chain activity to match up entities with specific wallet addresses.\n\nDon't Miss:\n\nDogecoin millionaires are increasing — investors with $1M+ in DOGE revealed!\n\nAccording to Cathie Wood, holding 6 Ethereum (ETH) could make you a millionaire, here’s why it can be true.\n\nWith Arkham's insights, anyone can see how the largest entities in crypto are trading. One interesting application is looking at the largest firms in the space.\n\nCoinbase, one of the largest crypto companies in the world, operates a centralized exchange, wallet service and a layer-2 called Base. Coinbase's portfolio is worth nearly $80 billion. The wallet is composed almost entirely of Ethereum (ETH) and Bitcoin (BTC). The firm holds over 900,000 BTC, currently worth over $55 billion. It also holds over 6.6 million ETH worth roughly $20 billion.\n\nWhile Coinbase operates as a crypto custodian, Grayscale is a crypto asset manager. It creates a handful of funds and ETFs that allow investors to access crypto products. In January, it was one of the first companies to offer a spot Bitcoin exchange-traded fund (ETF) converted from a previously released futures ETF. Grayscale's portfolio has more than 99% of its value in ETH and BTC. It owns 303,050 BTC worth $18.6 billion and 2.98 million ETH worth $9 billion. Grayscale holds $27.6 billion in crypto assets.\n\nTrending: 1 in 4 Americans own a share of Bitcoin according to NASDAQ, how much would $10 get you today?\n\nWhile it is mostly known for its equity platform, Robinhood began offering crypto several years ago. The crypto platform offers a handful of the most popular tokens, but the portfolio is mostly invested in ETH, BTC and Shiba Inu (SHIB). The wallet has 140,000 BTC worth $8.6 billion, 1.5 million ETH worth $4.7 billion and 42.5 trillion SHIB worth $1 billion.\n\nAs the largest crypto exchange in the world, it is no surprise that Binance (BNB) has the largest portfolio, worth over $200 billion. It holds 165 million BNB worth $94 billion, 640,000 BTC worth $40 billion, $27.2 billion worth of Tether (USDT) and 4.4 million ETH worth $13.2 billion.\n\nStory continues\n\nCoinbase has the largest ETH holding on the list. Its $20 billion of ETH is more than 5% of the total supply. The four firms hold a combined 15.5 million ETH, which is roughly 12.7% of the supply.\n\nWhile this may make it seem like the supply of ETH is heavily concentrated among a few entities, Coinbase, Robinhood and Binance hold assets for their customers. The portion of the supply held by these firms is under the discretion of the millions of people who hold ETH on these brokerages.\n\nRead Next:\n\nBitcoin has jumped another 45% already this year – how much would you need to get started today?\n\nIf you invested $100 in DOGE when Elon Musk first tweeted about it in 2019, here’s how much you’d have today.\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nGet the latest stock analysis from Benzinga?\n\nThis article Who Holds The Most Ethereum (ETH)? How Coinbase, Grayscale, Robinhood And Binance Stack Up originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    }
]