[
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxQUEVSYzZzdzdaOU15eUgyZ3JSbTc4QlN0eTF4RER2dlBPaV9DRkhsdEV3NUhiLTJmWVZCOExteXRLTUpEaGV1Q2dWMl9icTE2N0tZYW1yZWtDT09EWFVGbFFYajN4Ti1Qbm9LcjBXOV92VTVRc0RjVS14V2ZJdUlndEEzcTVmSjM1em1sM25udVFSLUxOU2xHaXRyLTlvbENtUkZhcmc0bFpZa1R2WjdpSzFQN0JQNWxoUjZONC14NkzSAcYBQVVfeXFMTlE1Rmpab3lRYlZtVldSclpLVTRoRlQzYVdaZGhVWk9MMGw1b1FzdEhfdlV3SXl1cDhaRktYTTAwcHVMZDNMX3RaSmVzNU5IdENpMjBHYkZtdTY3dm1pWkR2QWtrVFNwZFpSdmlWUUNWMHd4NUhPdjBiT0s3ZWE2aFlGeEtVSmp0MXNKTWJDeWFDWUlBZm1aTDIzUzNyZXdfSV9rUG5sWmVPTVJZZ2NSNnlLSHVSR2lUaEtXaEtWczlMWlVQUUhB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 May 2024 07:00:00 GMT",
        "title": "How MIT Brothers Allegedly Cheated a Noxious-But-Accepted Ethereum Practice for $25M - CoinDesk",
        "content": "\"In this process, a relay acts in a manner similar to an escrow account, which temporarily maintains the otherwise private transaction data of the proposed block until the validator commits to publishing the block to the blockchain exactly as ordered,\" the prosecutors wrote. \"The relay will not release the transactions within the proposed block to the validator until the validator has confirmed through a digital signature that it will publish the proposed block, as structured by the builder, to the blockchain.\""
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxPQ1ZqTzFtdFhXRGU2UGZkLUVLejlfNTlZN2VQVW1zWWJUeW5IeXlvM05rOEQ2UHM4Y3JMSTRja1kwVzZHLVE0azZXbmVZMnlfSXBLZ3BzdDZzaTk2QlhkbjFYTEc0WTdtM1I0cDB6ci1lb1BTOENXeHhRcGVoVVVHRUtIMmhQQk43bHlFaXlRLUtKaERDWEJYUE9aeVbSAaIBQVVfeXFMTnhoRy1OT2t2c0xqaHJxazQtSWlYa2E2dXY2RlljR1FHblVIMzV5UUJLdWJfdHRfbGJxaWpyeC1vR29PZGdaZWswZU5oVUZwNXVJNXQySTRlNHBmejFOOGlDb20tbFQ5YkZHOEx0enlFUGxnODQ5ZzFRaTRTZmNQdjdRM3pET215ZGMzTk5tanRsUXhNMzFMRVc3RUlMWmZyUl9B?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 May 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Price to Reach $10,000 by the End of 2024? Analyst Weighs In - CryptoPotato",
        "content": "TL;DR\n\nEthereum’s price recently surpassed $3,000, with analysts predicting further significant gains.\n\nDeclining MVRV ratio, negative exchange netflow, and potential approval of a spot Ethereum ETF in the US could drive ETH’s value higher.\n\nIs ETH Gearing up for an ATH?\n\nThe cryptocurrency market has experienced a significant uptrend in the past few days, with numerous digital assets rising to multi-week highs. Although not witnessing such a substantial increase, Ethereum (ETH) is also among the notable gainers.\n\nIts price surpassed the $3,000 mark, representing a 4% increase on a daily scale. Numerous analysts believe this could be the starting point of a bull run that can take place in the near future.\n\nThe X user Michael van de Poppe is among the optimists. He claimed recently that ETH is on its way to reaching a higher timeframe support level. “The good times are there in a few weeks’ time,” he assumed.\n\nCryptoYoddha was even more bullish, envisioning a price explosion toward the $10,000 milestone by the end of the year.\n\nLast but not least, World of Charts argued that ETH has started breaking the “falling wedge consolidation” on a 12-hour timeframe. “Trend is already up and expecting continuation towards $4500 in coming weeks,” the analyst forecasted.\n\nObserving Some Important Factors\n\nOne element signaling that ETH’s value could be on the verge of a rally is the Market Value to Realized Value (MVRV). It helps to identify if the asset is overvalued or undervalued. A high ratio suggests a market top, while a low one may indicate a good buying opportunity. The MVRV has been on a significant downfall since mid-March.\n\nAnother factor is ETH’s exchange netflow, which has been predominantly negative in the past month (according to CryptoQuant’s data). Shifting from centralized platforms towards self-custody methods is considered bullish since it reduces the immediate selling pressure.\n\nLast but not least, ETH’s price may head north in case of the approval of a spot Ethereum ETF in the United States. However, such a green light may also lead to the same immediate “sell-the-news” event witnessed after the BTC ETF approvals in January."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxNRjNsLUUzcDZ4dFFxWVdkTDIyNUdFQU9UX3NDVUw5TTNCeUlQYlltR2IyamI4WDZwbzFocTRCRDRxd3pQMWc5UE5xTk03Z0UtNGlBM2NkMlA5X0RMUjN0UXExS05ZbWdOR254TlluSEtTVVh3RW10eGdDRHdfbTd6aS1DVjdwTzlmVE13?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 May 2024 07:00:00 GMT",
        "title": "Deadline Approaches for SEC’s Spot Ethereum Decision - Nasdaq",
        "content": "By May 23 — exactly a week from now — the SEC will need to reach a decision on VanEck’s spot ethereum application.\n\nVanEck isn’t the only one aiming to get approval. The deadline for ARK Investment Management’s filing with 21Shares is May 24, just a single day after VanEck's. Recently, ARK and 21Shares updated their application to remove a staking clause.\n\nMinimal Hope\n\nAs for what to expect from the SEC, analysts aren’t exactly enthusiastic. Ric Edelman, head of the Digital Asset Council of Financial Professionals, recently told CNBC he “would be astonished if the SEC said yes at this point,” citing the lack of correspondence between the SEC and VanEck.\n\nVanEck CEO Jan van Eck is not optimistic that the SEC will approve the firm’s ethereum ETF application just yet. In April, van Eck told CNBC he expected his firm’s ethereum filing to “probably be rejected.”\n\n“The way the legal process goes is the regulators will give you comments on your application, and that happened for weeks and weeks before the bitcoin ETFs — and right now, pins are dropping as far as ethereum is concerned,” the VanEck CEO added.\n\nA March filing regarding BlackRock’s petitioned spot ether ETF indicated the SEC may be considering labeling ethereum as a security, not a commodity. The filing delayed BlackRock’s decision until June and asked for public comment on whether ETH is a security or a commodity.\n\nMeanwhile, Grayscale Investments has withdrawn its filing for an ethereum futures ETF. This comes while Grayscale awaits approval on its proposal to convert the Grayscale Ethereum Trust into a spot ether ETF.\n\nDespite the pessimism over the SEC’s next moves, the price of ethereum is doing quite well. The cryptocurrency is currently hovering around the $3,000 range. This marks a stark gain in more than a year: Ethereum sat closer to $1,800 in May 2023.\n\nLooking ahead, the SEC’s debate over whether ethereum is a commodity or a security could keep spot ethereum ETFs off the market for now. Ether’s regulatory status will ultimately determine whether or not spot ether is here to stay.\n\n﻿\n\nFor more news, information, and strategy, visit the Crypto Channel.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxNRjNsLUUzcDZ4dFFxWVdkTDIyNUdFQU9UX3NDVUw5TTNCeUlQYlltR2IyamI4WDZwbzFocTRCRDRxd3pQMWc5UE5xTk03Z0UtNGlBM2NkMlA5X0RMUjN0UXExS05ZbWdOR254TlluSEtTVVh3RW10eGdDRHdfbTd6aS1DVjdwTzlmVE13?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 May 2024 07:00:00 GMT",
        "title": "Deadline Approaches for SEC’s Spot Ethereum Decision - Nasdaq",
        "content": "By May 23 — exactly a week from now — the SEC will need to reach a decision on VanEck’s spot ethereum application.\n\nVanEck isn’t the only one aiming to get approval. The deadline for ARK Investment Management’s filing with 21Shares is May 24, just a single day after VanEck's. Recently, ARK and 21Shares updated their application to remove a staking clause.\n\nMinimal Hope\n\nAs for what to expect from the SEC, analysts aren’t exactly enthusiastic. Ric Edelman, head of the Digital Asset Council of Financial Professionals, recently told CNBC he “would be astonished if the SEC said yes at this point,” citing the lack of correspondence between the SEC and VanEck.\n\nVanEck CEO Jan van Eck is not optimistic that the SEC will approve the firm’s ethereum ETF application just yet. In April, van Eck told CNBC he expected his firm’s ethereum filing to “probably be rejected.”\n\n“The way the legal process goes is the regulators will give you comments on your application, and that happened for weeks and weeks before the bitcoin ETFs — and right now, pins are dropping as far as ethereum is concerned,” the VanEck CEO added.\n\nA March filing regarding BlackRock’s petitioned spot ether ETF indicated the SEC may be considering labeling ethereum as a security, not a commodity. The filing delayed BlackRock’s decision until June and asked for public comment on whether ETH is a security or a commodity.\n\nMeanwhile, Grayscale Investments has withdrawn its filing for an ethereum futures ETF. This comes while Grayscale awaits approval on its proposal to convert the Grayscale Ethereum Trust into a spot ether ETF.\n\nDespite the pessimism over the SEC’s next moves, the price of ethereum is doing quite well. The cryptocurrency is currently hovering around the $3,000 range. This marks a stark gain in more than a year: Ethereum sat closer to $1,800 in May 2023.\n\nLooking ahead, the SEC’s debate over whether ethereum is a commodity or a security could keep spot ethereum ETFs off the market for now. Ether’s regulatory status will ultimately determine whether or not spot ether is here to stay.\n\n﻿\n\nFor more news, information, and strategy, visit the Crypto Channel.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiY0FVX3lxTE8yZjc1eUJ1THQ3VFp6SmxsSU4xN3N6TXNxSkJHRGJDejBjejJnc0RRejA5RkIydkhHNFpUdXpfRU5HcXBOclhLa3M2MmNIZTVOWU9nQ21ZcUw5alFwWlYxQjNRWdIBaEFVX3lxTE5FVGFKbnk2NTl5ek5fNE04LXZ3UDByZ0JtU21jUHJ2OGVsYWhxZFFoQU1sWGN3aUd3Sm0taFdDaUh0V25qeUQ1eEpxT2F1cXBUdE01QVFtVUllQ29qTWFLRTkycEZhV0tG?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 May 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Breaks $3,000: Are We Saved? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nEthereum has secured a breakthrough above $3,000, but the current state of things suggests that the second-biggest cryptocurrency on the market might still face some troubles. The price has started an immediate reversal, and Ether could face additional selling pressure if it falls below $3,000 again.\n\nAdvertisement\n\nCurrently, Ethereum is trading around $3,005, with resistance levels at $3,200 and $3,400. If ETH can break through these levels, it could signal a stronger bullish trend than now. However, if Ethereum falls below $3,000, the support levels to watch are $2,900 and $2,800. A drop below these levels could indicate an aggravation of the bearish trend.\n\nRecent price action shows that Ethereum is struggling to maintain its upward momentum. The 50-day EMA around $3,067 and the 200-day EMA near $2,800 are critical levels to monitor. Breaking through the 50 EMA would be a positive sign, while falling below the 200 EMA could trigger more selling pressure.\n\nAdvertisement\n\nOn-chain data provides additional insights. The number of active addresses on the Ethereum network has been fluctuating, indicating varying levels of user activity. Currently, the number of active addresses is around 450,000, down from recent highs. Transactions on the network have also shown some variability, with daily transactions hovering around one million.\n\nThe net ETH emission after EIP-1559 has been slightly negative, suggesting that more ETH is being burned than minted. For now, the situation has changed as activity on the L1 of Ethereum dropped substantially.\n\nEthereum's recent breakthrough above $3,000 is a promising development, but the asset is still facing some issues. Key levels to watch are $3,200 and $3,400 on the upside, and $2,900 and $2,800 on the downside."
    }
]