[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxQRjRFUVNId0hHb21HZnBodFVkZ0pBc2FKU19JN2hfYlJfelhoTnhUOHkydUNZeEo3NGtDbVM5MXd1SmJhY2U5LVo0VDh6ZEJYMGJndDlpNUxzZlJ3Qks4LV82OFpWY3QxYjRHaGdCaEdoSUQ5VHh5QXZLYk5faTNNaWowX21vTGF4MDgtUThKV1pNTGp3VEpMZ0ZZUURrWm1VSmFwbHhYanpHM0sySkgzTdIBtgFBVV95cUxOeG1yYXFINDNPcExjcjVaN0hUVTlWMTIyU3BzTGhtMkRIUEJzM1VLa1dGajBERTVrTUw0c2ZwSmMyOTJUV0F6eDdOWk9fejhNUkJSMERWdl9pV1Q0R3hhMUFuNlhTdllZY1hCMFQ4N1R4dEFTWm1lOTA1UUZDTmcyaTJubHUxRFhySzFrQ0xTcmx5eFk2TW04bVp5YjVaNXFWWjVvcTdqdkdEbUZvRUd5akxWYVVmZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 22 Feb 2024 08:00:00 GMT",
        "title": "S&P Global Just Made Ethereum's Centralization Risk a TradFi Concern - CoinDesk",
        "content": "S&P is right: concentration or centralization risk exists in all crypto. The fact that this is being discussed by traditional finance (TradFi) analysts once again ( Morgan Stanley has flagged this before) shows just how much institutional interest there is in crypto post-ETF."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxNeGk4aEpJZ1IwT3QwSmxWZzc2Yk9wemt5bXNBVHlZM2QxLUxBMkxSSDk1QTExOWNoaUw2RWFyN0pYaEhCSjZSUUNjLWR5Nlk2cFVEM3ZaTVNnMHd0Zjdndk15SXNTSTBVdkhTNV9kU3M5WGJuTnJ6UEhRLWlkMXE5RW1FczNUX3AxTVBvVUJERzJwbl9SRzhMbExxX2JOVTFYWjBCdjJ2T3Mzazg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 22 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Price Prediction: $3,500 Breakout or $2,500 Reversal? - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxOTzNsSC1vakRCdGwtTnJ3YVFhRzBKLUlKdnFiXzFzdzBsMjV2LXF3MjJhTWthNHpzZ2V0S0FlMXZXdU9BLVlGNEVtTXE0VnllUk1Icmg4X2VnNGhrUUlNQUpNeGdCNUJSRThrS3ZtZEpKSVVDQmtBUFM1TjIyNnlDTUFDOXp2VzU5YnZ3M2F5NGR2UQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 22 Feb 2024 08:00:00 GMT",
        "title": "Reddit IPO filing reveals treasury exposure to Bitcoin, Ethereum - CryptoSlate",
        "content": "Social media giant Reddit has been quietly buying Bitcoin and Ethereum with some of its excess cash and holds an undisclosed amount of the two tokens in its treasury for investment purposes.\n\nThe social media giant’s crypto exposure details were revealed in its initial public offering (IPO) prospectus, which was filed with the SEC on Feb. 22. The filing comes after months of speculation about the company’s plans to go public.\n\nThe company did not disclose how many shares it plans to sell or the price range for the offering. However, it is expected to be one of the largest tech IPOs of the year.\n\nCrypto exposure\n\nThe filing clarifies that Reddit’s crypto holdings are confined to Bitcoin and Ethereum, both established players in the crypto space. The revelation was somewhat of a surprise, considering the company’s cautious approach toward crypto in recent years.\n\nAccording to the document, Reddit’s board of directors has approved the investment policy, which focuses on “risk mitigation” by only investing in cryptocurrencies deemed “not likely to be a security” by regulatory bodies.\n\nThe filing did not disclose the amount of Bitcoin and Ethereum held in the treasury or how long the company has been buying them.\n\nWhile the disclosed crypto holdings are limited to treasury purposes, the filing also mentioned that Reddit had acquired Ether and Matic for virtual goods sales. It added that the amounts were “immaterial” in recent years.\n\nThe filing acknowledges the inherent risks associated with cryptocurrencies, including volatility, cybersecurity threats, and potential regulatory changes. It also highlights the accounting challenges posed by treating cryptocurrencies as indefinite-lived intangible assets and the upcoming changes in accounting standards.\n\nDigital infrastructure\n\nReddit’s IPO filing hinted at broader ambitions to integrate blockchain technology into its expansive network of forums and discussions. It described the platform’s ongoing efforts to diversify its revenue streams and enhance its digital infrastructure, with cryptocurrencies playing a crucial role in this strategy.\n\nThe filing also mentioned exploring decentralized applications (dApps) and the potential for blockchain to offer new forms of content creation, sharing, and ownership. It also emphasized the potential of blockchain to enhance user experience and create new avenues for community engagement and monetization.\n\nReddit’s IPO filing offers a glimpse into a social media giant cautiously embracing the world of cryptocurrencies. While the company’s current exposure is limited, its openness to experimentation and focus on regulatory compliance suggests a potential for future growth and innovation in this space.\n\nMentioned in this article"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPWHlrRUdfUEJUSGFUVVRFZ1FIa21LU1J0LTZzZ0ZkbDh5MS04UXNpME54TUF6UlhnMjdKZ2prRk96emZWQXpONmE1dUcwbHdEalRpU0R4OWdpZVZjUlBReDdRWXF1elk0SkdjbjZINVFYQW5OeUlaZkRBdUxYemtDY0ZJUk9iRUlKVGRaak1R?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 22 Feb 2024 08:00:00 GMT",
        "title": "Ethereum spot ETFs may intensify validator concentration risk, says S&P Global - Crypto Briefing",
        "content": "The research focuses more on Coinbase as a potential risk factor due to its existing custodial role and potential to gain significant control through ETFs.\n\nShare this article\n\nSpot Ethereum exchange-traded funds (ETFs), if approved, could intensify validator concentration risks within the Ethereum network, according to recent research from S&P Global.\n\nThe research, titled “U.S. Ether ETFs Could Exacerbate Concentration Risk,” sheds light on the potential impact of spot Ethereum funds on validator concentration on the Ethereum network, particularly those that incorporate staking.\n\n“An increase in ether staking ETFs could affect the mix of validators participating in the Ethereum network’s consensus mechanism. The participation of institutional custodians could reduce the current concentration on the Lido decentralized staking protocol. However, it may also introduce new concentration risk, particularly if a single entity is chosen to stake the bulk of ether included in these ETFs,” stated the analysis.\n\nTraditional spot traded products like spot Bitcoin ETFs secure their holdings in digital vaults, with their primary function being to mirror the asset’s market price. However, Ethereum’s unique proposition lies in staking – where crypto is locked up to support network operations and secure transactions, rewarding participants in the process. Despite potential rewards, staking introduces the risk of ‘slashing’ if validators underperform or act maliciously.\n\nAccording to the research, spot Ethereum ETFs won’t affect the validator mix, but the proposed staking-enabled Ethereum ETFs, such as those of Ark Invest and Franklin Templeton, could become large enough to significantly influence validator power.\n\n“Spot ether ETFs that simply hold ether will not affect the validator mix in Ethereum’s consensus mechanism. Spot ether ETFs that include staking, however, will do exactly that–at least if inflows are high enough,” added the analysis. “U.S. spot ether ETFs that incorporate staking could become large enough to change validator concentrations in the Ethereum network, for better or worse.”\n\nS&P Global’s analysis also highlights specific concerns around Lido and Coinbase. Both entities are potential threats to validator concentration but for slightly different reasons.\n\nThe research notes that while Lido holds nearly 33% of staked ETH, it’s unlikely that US institutions launching Ethereum staking ETFs will directly engage with Lido due to regulatory and risk considerations. Instead, these ETFs might opt for regulated digital asset custodians for staking, potentially mitigating Lido’s dominance. However, this shift raises concerns about the role of Coinbase.\n\nThe research warns that Coinbase, a major exchange with significant validator control, could increase its Ethereum stake through ETFs, leading to greater concentration. Furthermore, Coinbase’s dual role as custodian for multiple Bitcoin ETFs and potential involvement in Ethereum ETFs could exacerbate concentration.\n\nHowever, the overall impact of ETFs on concentration depends on their staking practices. The research suggests that the introduction of new digital asset custodians could allow ETF issuers to diversify their stakes across different entities, potentially mitigating concentration risk."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxQRGR1NTk2X0pvQUkzQzhaRjJxenNPNGFVWW5aZTFUM1EyZG10SUhZdGRKek5QS0xwVklocnE4TEFDQlk1d2ZhNUxTNmx1Z2FmeWFaTTdHbWUtTkVhZUFGZlpuVXJUTVZKa1pObjhZX2U4dHJFQVp4a3libG9OZEQ5cG1BTEZYVE5KN0llUGl2Q3lYNXhr?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 22 Feb 2024 08:00:00 GMT",
        "title": "Is Ethereum Fulfilling Its Potential as an Incredible Disruptor? 3 Reasons I'm Bearish - The Motley Fool",
        "content": "This innovative crypto gets a lot of attention, but investors need to ask pressing questions.\n\nEthereum (ETH -0.92%) was born from the perceived limitations to adding functionality to Bitcoin. Launched in July 2015, Ethereum has skyrocketed nearly 93,000% in value since its public release, even though it remains more than 40% off its peak price.\n\nIs the world's second-most-valuable cryptocurrency, with a current market cap of about $350 billion, fulfilling its potential as an incredible disruptor? I'm not so sure. Here are three reasons I'm bearish on Ethereum.\n\nHuge promise\n\nLet's first try to understand why there's so much hype surrounding Ethereum and its long-term potential. Thanks to the blockchain network having functionality for smart contracts, many bulls believe that Ethereum can disrupt numerous industries, particularly those that depend on expensive intermediaries, by giving power and value back to the users.\n\nIn other words, smart contracts can automate a lot of functions that are slow and cumbersome, and that might not add much value. The end result, as many hope, is a better and cheaper user experience.\n\nViewed in this light, it might be encouraging to see Ethereum's complex roadmap. With scalability, security, and sustainably as the top priorities, the network's developer community has laid out different sets of upgrades to accomplish certain milestones. The latest event, known as The Merge, changed Ethereum to a proof-of-stake consensus mechanism, significantly reducing its energy usage.\n\nViewed as the world's decentralized computer, Ethereum's ultimate goal is to change the entire structure of the economy, mainly as it relates to how individuals can have greater control in an internet-enabled world.\n\nReasons to be skeptical\n\nIt's easy to get caught up in Ethereum's promise. There are more than 250 million unique wallet addresses. It has the most total value locked by far of any other crypto, which measures the amount of assets locked in a specific DeFi protocol. And sure, there are thousands of decentralized applications.\n\nBut I view things with a critical perspective. I think Ethereum is still primarily used as a tool for financial speculation, not actual utility. Even if spot Ethereum exchange-traded funds get approved, it proves that investors only want price exposure, instead of using Ethereum tokens in some dApp setting.\n\nAnd are dApps really better than services provided by well-known businesses? Marketplace and platform-like businesses, such as Meta Platforms, PayPal, Uber, and Airbnb, have billions of users combined who find value in what they have to offer. They work just fine as is.\n\nAnother reason I'm bearish is that I view Ethereum as another venture start-up, which defeats the entire purpose of crypto aiming to be decentralized and give power to the people. There are still a few head developers, most notably Vitalik Buterin, who have outsized influence on the direction of the network. And these founders stand to gain the most financially should things work out as planned.\n\nThe Securities and Exchange Commission said that Bitcoin is the only crypto that's a commodity, and that others are essentially securities. This supports the argument that Ethereum is just another profit-seeking enterprise.\n\nAnd the last bear case rests on the belief that Ethereum is a solution looking for a problem. In fact, this is probably true for nearly all cryptocurrencies right now.\n\nAll of the focus and discussion centered on the complex technicalities of the underlying network sound exciting. However, one really has to question if more and more people will engage further with Ethereum and use its dApps in the future. I'm not confident in this outcome.\n\nIt might make some bullish Ethereum supporters uncomfortable to challenge their beliefs about the cryptocurrency. But I think healthy criticality is necessary to set realistic expectations about its future."
    }
]