[
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxQblE5YjFRUEdqZVFhLVktVGRPc255VVl1Ul9oaEhuM3B5Zjg0NVlLaF9qOWZMOEs3d3JFRmJBaEZuSFo2dnM5eU9QanJkTHY3Q3RrdjZxQ1UtZkZsUHhIN1M4Vm5uOVBwS0JUOGtOM092aUlxaWtOdTBfc0xpTDBnZ2h0Z2dydDllNkJRZzA3bk9fWk5naGE4VXBBMzNqYV91Rk9Rc3ZmMDVDZEFhWWlmWVc3djNfR2ktUHpn0gHAAUFVX3lxTE03U19CUjBaVWpmNzRLNTZvUkMtNmo3aU05b2haY3FrdmotbkRFajVlSVJkN1VnTF9LdlR0ZFZXeG5FeGhfMlhjeTZHdXhtUThTQUpSZ1cwdndKZzREWnZ1VWJSQ3pVYW5ueWpydGNmbjdVWnQxcVJtbDZrNU5qdkFjQU43a1FLd2x0V09qU1Buc2tpQ0VWdm9FQUJDbGJRenk3dm1GbFc0anJmV3RiMldQanV6dHNMQ2djT2hMdXYyQg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jul 2024 07:00:00 GMT",
        "title": "Pump.Fun Overtakes Ethereum With $2M in Daily Revenue to Take No. 1 Position - CoinDesk",
        "content": "Data from Dune Analytics shows that 11,528 tokens were deployed on Monday bringing the cumulative total up to 1,199,685. Cumulative revenue on the platform has now reached $50.9 million. In March, Pump.fun was on track to hit $66 million in annual revenue, a figure that is likely to be surpassed before the year is out if current activity continues."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxOclBhRTNqdHhCQ0VIbzV4SDk1LU5aS0Jka2xlSXpkLWJBWmZWOHVkRlZ4SkVkY09kZUJqaVdBZ2RfZGFqSnFEQjdUMU1VUGlma3Exc3U2ei1qMUo1emlEeGszZ3FnWkp2V3QtTVRfSFduZEhxMG9obldUUVd0ZXktN2dwZnh2ZFZNTXkyT29IbmI4dnJKeEMzVVRVMzYySS1a?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jul 2024 07:00:00 GMT",
        "title": "Why traders are betting against Bitcoin ahead of Ethereum ETF launch - DLNews",
        "content": "Options traders are positioning for upside on Ether and downside for Bitcoin.\n\nIn the long term, traders still expect Bitcoin to reach $100,000 by the end of the year.\n\nJuly 4 could be a volatile trading day.\n\nTraders are “aggressively” buying up Ether call options ahead of the launch of spot Ethereum exchange-traded funds — and they’re using Bitcoin as a hedge.\n\nThat’s according to a Monday report by crypto market maker Wintermute.\n\nThe reason? The new ETFs are expected to push the price of the world’s second largest cryptocurrency while several factors risk driving Bitcoin’s price lower.\n\nEthereum strength\n\nAnticipation of the imminent launch of spot Ethereum ETFs is showing up in options data.\n\nSimply put, options give traders the right to buy or sell a given asset — say, Ether — at a specified price at some point in the future.\n\nEven though Bitcoin volatility has reached a six-month low — creating an environment that is “notoriously difficult to trade” — options traders are expecting Ether to experience a large upside move soon, according to Wintermute.\n\nBitcoin, meanwhile, keeps suffering from negative headlines and supply risks.\n\nCrypto exchange Mt. Gox could soon begin repaying its creditors — meaning $9.2 billion worth of Bitcoin could soon hit the market.\n\nJoin the community to get our latest stories and updates\n\nThe German and US governments, meanwhile, are expected to start selling seized Bitcoin on the open market.\n\nThe situation has made “long Ethereum, short Bitcoin the new consensus trade leading up to spot ETF approvals,” Wintermute said.\n\nBut that’s only for the short term.\n\nTraders still expect Bitcoin to hit $100,000 before the end of the year — possibly as early as September, Wintermute said.\n\nWhen will volatility come back? Well, it could be as soon as July 4. The US holiday, sandwiched in between “key data releases” — namely a speech from Federal Reserve chair Jerome Powell on Wednesday and a jobs data report on Friday — could see heightened volatility and lower trading volumes, the firm said.\n\nNot to mention that spot Ethereum ETFs could launch any day now, according to Bloomberg ETF analyst Eric Balchunas, though he said it would probably happen after Independence Day.\n\nCrypto market movers\n\nBitcoin is down 0.8% in the last 24 hours, trading for $62,400.\n\nEthereum has slumped 0.9% in the same period, now at $3,410.\n\nWhat we are reading\n\nTom Carreras is a markets correspondent for DL News. Got a tip about options trading? Reach out at tcarreras@dlnews.com."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxOendzUnlldlZIVGJNWWI1aGFHQUdpcnBJSnlPZ2toOFE3cHBNbXB0SHJrREw5SE94T2hsYW9iYnZ3bXZuemNzQy1CclN3cnJZS2hTbTViSEVwaWhSckhkMy1GZi1oSTYtMkdNQllQb3hDYmJiZmN1eVN1RC1mWFVISFQtQ3lWMWdLbEJYd2hndVYydm8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jul 2024 07:00:00 GMT",
        "title": "Memecoin Deployer Pump.Fun’s Daily Revenue Surpasses Ethereum - Unchained",
        "content": "Pump.Fun’s annualized revenue, calculated by taking revenue data from the last 30 days and multiplying the figure by 12, is projected to be $268.95 million, DefiLlama shows\n\nDespite a $1.6 billion decrease in total memecoin market cap since June 17, dropping from $53.3 billion to $51.7 billion per CoinGecko, Pump.Fun averages $692,000 in daily revenue, indicating ongoing memecoin activity.\n\nThe memecoin frenzy is showing few signs of slowing down. Solana-based memecoin deployer Pump.fun surpassed Ethereum in revenue generated over a 24 hour period on Monday.\n\nPump.Fun, a platform where crypto users can create memecoins at low costs, hit an all-time high, generating $1.99 million in revenue within a 24 hour period, according to blockchain analytics firm DefiLlama. This surpassed the daily revenue figures generated by popular layer 1 blockchains such as Ethereum’s $1.19 million in revenue, Tron’s $1.58 million, and Solana’s $806,957.\n\nThe revenue spike for Pump.Fun stems from the memecoin frenzy that has largely taken place on Solana, with celebrities such as Caitlyn Jenner, Iggy Azalea, Rich The Kid, and Davido using the platform to launch their own memecoins.\n\nRead More: Solana Attracts Attention From Mainstream Celebrities\n\nFew Success Stories\n\nWhile some tokens have seen some success such as Azalea’s MOTHER token reaching a roughly $150 million market cap before settling around $53 million at the time of writing, success stories are seldom with nearly 1.2 million tokens having been deployed through Pump.Fun since its inception, which are all competing for the market’s attention, a Dune Analytics dashboard by Asian-based blockchain firm Hashed shows.\n\nFor example, the majority of celebrity tokens, such as Nigerian singer-songwriter Davido’s memecoin, have seen their prices plummet since their launch in May.\n\nProjected Revenue\n\nEven though the market cap of all memecoins has decreased by $1.6 billion since June 17 from $53.3 billion to $51.7 billion at presstime per CoinGecko, Pump.Fun has been able to average $692,000 per day in revenue, a sign people are still using Pump.Fun for memecoin activities.\n\nIf the momentum around memecoins sustains, the platform is projected to have an annualized revenue of $268.95 million, which DefiLlama calculates by taking revenue data from the last 30 days and multiplying the figure by 12. Pump.Fun recorded revenue of $22.05 million in June.\n\nPump.Fun earns revenue in a few ways, namely a 1% swap fee from those trading memecoins on the venue and an additional two SOL fee when the token gets listed to decentralized exchange Raydium."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTFBoSkRHYm91ZmxKckxaajBfVHd2SU15VjhQa3BmUUQzWUhvTml1bk0yMjBSWG5qV29GVHZ0Y0E5VGxJejJZV0o2X1FLazc2Tmx2TjRyUHpzNWY3ZXVvekZkdy16bmpIREs4ekdlQVpYXzdkNE9iOWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jul 2024 07:00:00 GMT",
        "title": "Expert: Spot Ethereum ETF to drive Ether demand - crypto.news",
        "content": "SCRYPT CEO Norman Wooding told crypto.news several factors point to higher Ethereum prices if the SEC approves spot Ether ETFs.\n\nWooding predicted that spot Ethereum (ETH) ETFs will follow the pattern of spot Bitcoin (BTC) funds and push ETH prices above $4,000. According to the expert, approval for spot ETH ETFs will eliminate “lingering anxieties” surrounding the second-largest cryptocurrency and boost market demand.\n\nWooding opined that Ether could retest its $4,800 peak if spot ETH ETFs capture 10-20% of Bitcoin ETF flows.\n\nETH data | Source: TradingView\n\n“This opens doors to a previously untapped audience, thus increasing demand, generating an upward price trajectory in the days, weeks, and months following approval.” the SCRYPT’s CEO told crypto.news.\n\nExclusive Grayscale spot Bitcoin ETFs garnered over $35 billion in assets under management (AUM) within six months of trading. Wooding’s estimations echo a report from the Gemini crypto exchange, which said spot ETH funds could see $5 billion in net inflows over the same six months.\n\nSpot BTC ETF info | Source: SoSoValue\n\nYou might also like: Experts: Spot Ether ETFs not the boon industry thinks\n\nNo staking, higher yield\n\nJust as observers have regarded spot ETH ETFs a matter of when and not if, skeptics have also debated why Ethereum should have an instutitonal wrapper that tracks spot Ether prices.\n\nBitcoin is primarily treated as digital gold and a store of value, while Ethereum operates as a smart contract-powered ecosystem for decentralized applications. This market relies heavily on Ether as a liquid asset and an economic vehicle.\n\nHowever, ETFs hold assets and wait for higher prices, which could lead to large amounts of dormant Ether. The issue is further exacerbated by the absence of staking activity in proposed spot ETH funds. Flipside Crypto data scientist Carlos Mercado said it’s not the best use case for Ether, but Wooding insists the outcome may be a net positive for ETH proponents.\n\nPer Wooding, reduced liquidity and dormant ETH could incentivize more directly Ether staking, resulting in higher on-chain yield as spot ETFs capture significant supply.\n\n“While dormant ETH from ETFs might reduce DeFi liquidity, the broader market exposure and increased participation could eventually drive more direct engagement in staking and DeFi, balancing out the initial impact​,” Wooding discussed with crypto.news via email.\n\nWhen will we see spot Ethereum ETF?\n\nAfter the U.S. Securities and Exchange Commission (SEC) issued initial approval for spot ETH ETFs last month, issuers and experts expect final greenlights to arrive before the end of Q3 2024. Bloomberg analyst James Seyffart suggested the regulatory nod could occur this month, and SEC chair Gary Gensler told Congress to expect an outcome by the end of summer.\n\nAlthough speculation exists that the SEC could spurn issuers, especially after the agency sued Consenys over its MetaMask wallet and staking offerings, Wooding is confident the regulator will approve spot ETH ETFs this month.\n\nPer Wooding, rejecting Ethereum funds could dampen the SEC’s credibility and competency. SCRYPT’s CEO added that a denial might also prompt further regulatory discussions and result in better, refined future proposals.\n\nFurthermore, Ether prices may slide downward if the SEC denies spot Ether ETFs. However, Woodings surmised that such an outcome is unlikely and a market downswing would be short-lived in any case. “The fundamental value and utility of Ethereum remain strong, and the market would likely stabilize as investors refocus on its technological developments and applications.” per Wooding."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxQTDRzWDN6bGQyVEh5RW52U2NuWWxLbzJBbVBOVlFGcHFQcVdpTGZyVFNYVjBSeWtqRnVXeFMtQXAwMlV2VTJvZHA5am5RN1dBNFMtbms5NlRRdjdrdkVmUngxcFg5NG15WmtHVWtrc01nS1FoVW53ZFNzRUVXWDV4enc3QzJKNXQwOG1MRUFTWUt2WWxSQ3JISnRlV0IxRmx1RFp1RXlWQkVmdGJyQ1hIY19OeXZ2OEE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jul 2024 07:00:00 GMT",
        "title": "Lido Takes Initial Step to Decentralize Ethereum Node Operator Set Amid SEC Allegations - Unchained",
        "content": "Monday saw the debut of Lido’s Community Staking Module on the Holesky test network, which aims to allow new entities, including solo stakers, to become node operators without needing permission from its DAO.\n\nLido jumpstarted the liquid staking ecosystem in 2020 by introducing its flagship product, stETH, a rebasing token representing a person’s principal amount of staked ETH and their rewards from helping secure the Ethereum blockchain network.\n\nAs it faces allegations by the U.S. Securities and Exchange Commission, liquid staking leader Lido is preparing to become more decentralized by taking a step toward integrating a more diverse set of Ethereum node operators, such as solo stakers, the “gold standard” for staking, per the Ethereum Foundation.\n\nOn Monday, a Lido initiative called Community Staking Module, which is expected to allow permissionless entry for node operators, activated on the Holesky test network, according to a governance post in Lido’s forums by Dmitry Gusakov, the tech leader of Lido’s community staking product.\n\nThe move comes days after the SEC implied in a lawsuit against Ethereum software provider Consensys that Lido’s liquid staking token, stETH, is an unregistered security. Staked ETH, aka stETH, represents a person’s principal amount of staked ETH and their staking rewards from helping secure the Ethereum blockchain network.\n\nLido’s stETH has a market cap of $33 billion, making the liquid staking provider the leading DeFi protocol by total value locked. According to a Dune Analytics dashboard by crypto analyst Hildobby, Lido commands a 29% share of the total 33.3 million staked ETH.\n\nThe advent of Lido’s community staking module marks a change to the protocol that first introduced liquid staking in 2020, because Lido on Ethereum has had a curated and permissioned validator set since its inception, in which those interested in acting as a node operator for Lido had to be vetted by the Lido DAO.\n\nPermissioned and Restricted Since Inception\n\nUnlike its competitor Rocket Pool, before a node operator can conduct validator operations for Lido, governance has to vote on whether to include a prospective address into Lido’s active set of node operators. At presstime, Lido has 39 node operators, which includes the likes of P2P.org, Chorus One, and Consensys.\n\nThe initiative centered on permissionless entry allows “any node operator – and especially community stakers, from solo stakers, to groups of friends, to amateur operators – to operate validators by providing an ETH-based bond (security collateral),” according to its documentation.\n\nThe new community module is expected to make solo staking more accessible through its inclusion of several features such as a low bond for node operators as well as smoothed rewards from Ethereum’s execution layer and maximum extractable value.\n\nLido becomes less centralized by making its node operator set permissionless. During the lifecycle of a crypto project, a protocol will typically start with heavy elements of centralization, ranging from core developers holding control over the direction of the project, sometimes in the form of fundraising to delaying a protocol’s token generation event that aims to introduce governance mechanisms for those in the community.\n\nEventually, founders and core members of a protocol would introduce decentralization initiatives, such as implementing onchain voting processes or making node operation permissionless such as the case with Lido.\n\nSEC’s Focus on Consensys and Lido\n\nAlthough, like most DeFi projects, Lido has had a roadmap to decentralization for a while, the initiative comes several days after the SEC charged Consensys for offering and selling unregistered securities, namely Lido and Rocket Pool’s liquid staking tokens, through Metamask, a crypto wallet where people can stake and swap cryptocurrencies.\n\nConsensys, which is also a node operator for Lido, “has offered and sold tens of thousands of unregistered securities on behalf of liquid staking program providers Lido and Rocket Pool, who created and issue liquid staking tokens (called stETH and rETH) in exchange for staked assets,” the SEC’s press release states.\n\nRead More: Could the SEC Have a Case Against Liquid Staking Protocols?\n\nThe complaint calls Lido and Rocket Pool issuers of unregistered securities, alleging that their staking programs “are each offered and sold as investment contracts and, therefore, securities.”\n\nFollowing the prongs of the so-called Howey test, which, since a 1946 court case, has been the legal measure to determine whether an investment is a securities offering, the agency said these liquid staking tokens meet the criteria.\n\nIn its press release it said, the buyers of LSTs “make an investment of ETH in a common enterprise with a reasonable expectation of profits from the managerial efforts of Lido and Rocket Pool, respectively.” However, neither Lido nor Rocket Pool has filed registrations to offer these securities with the SEC.\n\nWith the fourth prong of the Howey test being “the managerial efforts of others,” crypto projects have sought to be decentralized enough that such a third party could not be easily named.\n\nWhen Unchained reached out to the founders and key members of Lido in May for commentary on whether the SEC took action against the liquid staking provider or contacted them about stETH, Unchained did not receive a response. According to a snapshot vote taken in Aug. 2022, Eric Hill, who goes by @Rotorless on X, is Lido’s head of legal and general counsel. However, when Unchained contacted Hill for commentary, he said he did not hold that position anymore and wasn’t “the right person to talk to.”\n\nAfter the SEC’s lawsuit against Consensys, when Unchained highlighted SEC’s claims that stETH is an unregistered security, Lido marketing lead Kasper Rasmussen said, “We’re on it,” but did not provide additional insights.\n\nLDO, the governance token for Lido, has decreased 6.3% in the past 24 hours and 19.7% over the last 30 days to trade at $1.92, making its market cap stand at $1.7 billion, per CoinGecko.\n\nUPDATE (July 3, 2024, 3:08 p.m. ET): Added clarification on the timeline for Lido’s plan to make the process to become a node validator permissionless, as well as the way Lido founders and key members responded to queries about regulatory issues when Unchained reached out to them in May."
    }
]