[
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMihAJBVV95cUxNNWoxVk9FalpyX0ctR0hYbm1TV0V4S3BkeHhmWGE0U0k1bEFSZXpGOXNpWkdTVGlRSWhkX09sLXh4b2JFZnBXYmlJLTJkMjkxNUt0cWxzUDAtWUVaTjItUEsweHE0Ums2NXRqZ1NvQm9ELTlKVUU1ODAtN1ZHMVR2U1p6TTZ6blFaU0NBbzBYWkxTSlFiUGxaYjdDUUdIRm1YR0sxVDl4dHNwSTE4NHlja0lrUzVqQ2VyM010dE1NUXljSDJyODlGbUk3bkI1a0xRLTJhLU5qejdiNlVwZFR1aXpzaEdJZ0VDQkpyRTNDY1Y1dEVkRmRLUlFHczB0Vm9CcE0wUtIBkgJBVV95cUxQWm9OTVQyX3ZRWmVDemZfbG5TT2w4emFUTVNJS3FrSGl0M2JtUUZodEdhOFZDbExUMmlUaVBmZkpwU19BLTBaYTlBM2hxUG9QVFprOFpEaHM1MDhUZGp0aDZDN0hZaVQ1RTkyZFJtMG11cUhXN0VqY0ZJbFp1a0kzcUpiZGc4Ykh0ajVtOGdtU3dFMllTUTR4U1c2c3VJMTVmcV9vUkZBcHREUHZ0d3JjUWxRWFFxdmZ5SWJxd1AyS0dMWnNORlhrYmh3Ui1oTTdNek9oblJlUVl6bFJHNVZGN28xaWlDTzNqS3FXeGthYWlSRmJrMGYtYTlfQ3Qtd1BXNXhLVkx2eWE1NXNuV0M4QzVB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 07 Jan 2024 08:00:00 GMT",
        "title": "Bull Market Price Predictions: Here’s Why Ethereum, Doge Uprising, and Polygon (MATIC) Will See The Biggest Growth - Analytics Insight",
        "content": "Join our WhatsApp Channel to get the latest news, exclusives and videos on WhatsApp\n\n_____________\n\nDisclaimer: Analytics Insight does not provide financial advice or guidance. Also note that the cryptocurrencies mentioned/listed on the website could potentially be scams, i.e. designed to induce you to invest financial resources that may be lost forever and not be recoverable once investments are made. You are responsible for conducting your own research (DYOR) before making any investments. Read more here."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxPQ2E0TElnOXdoLWVpRE94eDY0Z21lcjI1VGQ1TWhXRGNMbkdka2J5WkpLY0JybnMzaS1HYTNzak50SzZ1cThKclZneEVZSkdLdGRfVDhqSGNkU2I4b0RWeUFQZ3VZbEstSkZxQnVFZk9GWjNEVzZuckszZjM2LUpjY2taUGVJUDU5bEFvNWdzN3lSTVFWQmZWUnA5NktlT0p0ZVVFdW9EVlRQQnhRTkZJNDNsR0tRWnNRS21Dbng3SdIBxAFBVV95cUxPMjQwZFBKVGQ5ZF9HUE5tOVJNejI5NUxhenNUbWNVR2lxR3ktMXp1SFdhVFliQTBqWXFnMGVJM2hGYlNMM2NqVXg1SHpfT1FHX09KZDVKRzBvbEs3TXB2a0lNZGtxdlYtYzBIY2QzNEoweHZWLVoyZm82WVhOemRxTXgyTWUySkgySGVSVlBSZHZjdHlIaXNvdFlGbFVacndyR2I3SGdfV2F1MkhmUkVCek1PZ1FBeE5vMEZ2SkU3aU1XOWZz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 07 Jan 2024 08:00:00 GMT",
        "title": "Bankrupt Lender Celsius Waiting to Unstake Nearly $470,000,000 Worth of Ethereum (ETH): Nansen - The Daily Hodl",
        "content": "Defunct crypto lending platform Celsius is in line to unstake and presumably sell nearly half a billion dollars worth of Ethereum (ETH), according to on-chain data.\n\nCelsius, now going through a lengthy bankruptcy process, was a service that used to offer customers yield on their crypto deposits.\n\nHowever, the firm collapsed after it allegedly mishandled customer assets, and its founder Alex Mashinsky was ultimately arrested and charged with fraud.\n\nNow, Celsius is liquidating what’s left of its assets in an effort to compensate its customers.\n\nMaking a statement via the social media platform X, Celsius says it has begun the unstaking process for its Ethereum holdings, which it has been using to generate income for its estate over the last year and a half.\n\n“In preparation of any asset distributions, Celsius has started the process of recalling and rebalancing assets to ensure ample liquidity\n\nCelsius will unstake existing ETH holdings, which have provided valuable staking rewards income to the estate, to offset certain costs incurred throughout the restructuring process.\n\nThe significant unstaking activity in the next few days will unlock ETH to ensure timely distributions to creditors.\n\nAs a reminder, eligible creditors will receive in-kind distributions of BTC and ETH as outlined in the approved Plan.”\n\nAccording to blockchain analytics platform Nansen, Celsius is currently waiting to unstake a total of 206,319 ETH worth nearly $470 million.\n\nLate last year, a judge approved a new plan from Celsius that aims to generate funds for a new mining and staking corporate spinoff designed to repay creditors.\n\nThe company, dubbed “NewCo,” will have a $1.25 billion balance sheet, $450 million of which will be liquid crypto.\n\nAs stated in the court documents signed by Bankruptcy Judge Martin Glenn,\n\n“NewCo intends to stake some or all of this liquid cryptocurrency to earn staking yields on the Ethereum network, which would generate anywhere from $10 to $20 million per year.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/eliahinsomnia"
    }
]