[
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPV1hLVzRHZVpJY3FENE5CcU1GbzA3WFA4QkszMlhRUnphbF9DcFlUY2x5OE8zTlpMNzRqWGdkeVJ0SFdtVTBZNjlkRktmQzFOZ1ZuY1hDWGZ2cFZVV0pVYm9vZHRQMEFPbXBZNVF1cFpzMkVjbG02Y3ZLZzE2RUdiX1VOVEFnVmdIbmVZUjl30gGTAUFVX3lxTFA0ZlNYUGs3TFlyNFFoemFEdkNreUU4TGtvcmNGNXRlNWNPXzhONFhPWkg0dzNEN1Z6ZlNndFFnOTlRQ0FBOWt4QWY4X3VlYnZCZFJtVzRGSnVOM0N3eWQ1NlpIWjdrNUhqN19KTVgxUld2MDRXY25pZ2c0R0diTm1PTnJKSEpXWW9LeUluM1lwc2FhUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 Apr 2024 07:00:00 GMT",
        "title": "Ancient Ethereum Whale With 12,566 ETH Makes Surprising Return: Details - U.Today",
        "content": "In a move that has captured the attention of the cryptocurrency community, an ancient Ethereum whale has returned to the scene after a period of dormancy.\n\nAdvertisement\n\nAccording to Spot On Chain, an Ethereum large holder has made a significant transaction after a hiatus of 1.12 years.\n\nAn #Ethereum #ICO participant returned after 1.12 years to deposit 1,069 $ETH ($3.56M) to #Kraken at $3,329 3 hours ago.\n\n\n\nThe whale received 12,566 $ETH at #Ethereum Genesis in Jul 2015, at an ICO price of ~$0.31,\n\n\n\nAnd then distributed the $ETH across 12 wallets in 2017, of which… pic.twitter.com/Lid1hItGik — Spot On Chain (@spotonchain) April 6, 2024\n\nThe investor, who participated in Ethereum's ICO, deposited 1,069 ETH valued at a staggering $3.56 million into the Kraken exchange, in recent hours, with the ETH priced at $3,329. Depositing tokens to exchanges indicates a desire to sell, while withdrawals might signal buying.\n\nAdvertisement\n\nThe Ethereum Initial Coin Offering (ICO), held in 2014, is regarded as one of the most significant events in the history of the cryptocurrency. During the ICO, participants had the opportunity to acquire ETH tokens at a relatively low price, with the hope of seeing the value of their investment grow over time.\n\nThe said whale received 12,566 ETH at Ethereum Genesis in July 2015, at an ICO price of $0.31.\n\nIn the years that followed, the whale distributed the purchased ETH to numerous wallets while also selling a portion of the massive ETH stash.\n\nAccording to Spot On Chain, the whale distributed 12,566 ETH across 12 wallets in 2017; 4,847 ETH were deposited to Kraken and Gemini at an average price of $1,637 afterward. The whale now holds 7,719 ETH worth $25.7 million across eight wallets.\n\nAt the time of writing, ETH was up 2.35% to $3,342.\n\n$4 billion worth of ETH taken off crypto exchanges\n\nAccording to on-chain analytics firm IntoTheBlock, $4 billion worth of ETH was withdrawn from exchanges in the last quarter, indicating significant accumulation by holders.\n\nLast quarter, $4 billion worth of $ETH was withdrawn from exchanges, indicating significant accumulation by holders. pic.twitter.com/u6RpLPH5fn — IntoTheBlock (@intotheblock) April 5, 2024\n\nOn March 13, Ethereum received its long-awaited Dencun upgrade. Following Ethereum's Dencun upgrade, activity on the main optimistic rollups swiftly increased, reaching weekly highs of 32 million transactions.\n\nGas prices were initially as much as 100x lower in many L2s, but have recently risen significantly as blob transfers became more prevalent and transaction demand increased."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxOUzF1TlJ0V1Z5RmVtMGh1Zk4tdklFcG5WdTZiWldxRFdYZ0s3QVpVcVVqUlRSUHVDVFp1TWxMZEFiNnFMRTJ2d3lSOGk5SHNLcFpPLXJlTFZrNE8xcE9QX1o4MGxuZERpZ0lMZ1pGeDBuYUluMHdLMUdjN1E2aVZlRHNLTU1fZGVxUG01VXYwNmozQl8xSE16Nm1sMDdLZGhDcWIzWkx3dExKNDdNSWczdW9ZR0RJU1ZSQVJvNUx6dw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Price Forecast: Can this $1.2B Signal Drive ETH to $4k April 2024 ? - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxOQUszdFN3LXhxelhQNGpTY2Vydi02d0ZuT1ZFbkQ4NXJLeGFhel9MZktYbFRhZW1KZ0xHU3V3bVdfeHowSnA5UnpVdm1JNUZUTTJWTEVPVm9DcktiTmljQUcxNjBqR0REWUd0NUlHTk9HRGpURnlYVi1pMTF6cml3d1F1X0tNQndRcE9uT1ZLZ3d5TDRF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 Apr 2024 07:00:00 GMT",
        "title": "Explosion of L2 networks: Ethereum ready to tame its rivals - Cointribune EN",
        "content": "Sat 06 Apr 2024 ▪ 3 min read ▪ by Mikaia A.\n\n▪ Blockchain\n\nThe battle of Layer 2 solutions is raging among Ethereum, Binance, and Coinbase. But is it mere vanity or a lifeline for Layer 1 blockchains suffering from congestion problems? According to VanEck analysts, containing the rise of L2 networks will be challenging. By 2030, the market capitalization of similar mechanisms deployed on Ethereum could explode to reach 1 trillion dollars.\n\nEthereum L2: Prediction of Colossal Capitalization\n\nThere is currently a rush toward Layer 2 solutions such as Base (Coinbase), Arbitrium One, OP Mainnet, and many others. The reason? Their remarkable scalability, which constitutes a major asset as a blockchain infrastructure.\n\nVanEck analysts forecast a spectacular rise of Ethereum Layer 2 (L2) networks, reaching a market capitalization of 1 trillion dollars by 2030, reports CoinSpeaker.\n\nThe report, authored by Patrick Bush and Matthew Sigel, highlights the challenges of Ethereum in terms of data processing. Despite its dominance in smart contracts, its scalability limitations remain a hindrance.\n\nHowever, Ethereum is striving to improve its Layer 2 transaction processing capabilities, as demonstrated by the recent Denizen upgrade.\n\nThe bold prediction of VanEck is based on the belief that L2 networks are ready to capitalize on Ethereum’s weaknesses and meet the growing needs of an expanding ecosystem.\n\nWith rising transaction fees and prolonged processing times on Ethereum (ETH), the adoption of L2 networks seems like an inevitable solution for the future of blockchain.\n\nThe New Titans of Blockchain\n\nIn a striking report, VanEck analysts predict a future where Ethereum’s Layer 2 networks will surpass the base network in terms of revenue. According to Bush and Sigel, this rise is inevitable in the face of Ethereum’s inability to compete in terms of transactions and user experience.\n\nThis futuristic blockchain landscape, depicted by VanEck, reveals a dynamic ecosystem comprised of thousands of specialized L2 networks, promising to redefine industries and open new horizons. From decentralized social media platforms to specialized financial applications, the possibilities for innovation seem limitless.\n\nDiscover our newsletter This link uses an affiliate program.\n\nHowever, enthusiasm must be tempered, warn analysts. Despite the opportunities offered by L2 tokens, the competition is fierce. The top seven Ethereum Layer 2 tokens already display a valuation of 40 billion dollars, which raises the possibility of market saturation.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxPaDI0VjFLUGJ5YmM0SDE5Z2hkcnBEQmExNl9JRVpZbF9VaG1nVWRZb1dWbmNzSHBIWDJyRW5XVjRGTFZHTVNNZlNLX2ViYWc3am1LRUp2MlF0QU0tMHladkEtZU9ydVhOLWRKaDdfLVJvNGFPOUw2LXRYSE1sYURpTzZhcGthR0hpc2JqT29vT2hfTVVIazMw0gGcAUFVX3lxTE1oMHc2cGhLY004a1Z4bzAyYWNkNE91X0laSGZETzRqZVAzVVA4S0VnMVZHdUtEcVFqcG9udlUzNUxhdXpKaTRGX1VTWW1Wc0g5UFFkcUZmNmVxNThxY2RXeFJ1MTRSS1A2dDZLREEzQWcyX3N4ektIaTluZ2JGMTM1ZDcyN3JMeEFVeS0zX1RZWk9IcnJscUNKQ0NHQw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 Apr 2024 07:00:00 GMT",
        "title": "‘Ethereum ETFs will pull in more assets if they launch in December’ – Why? - AMBCrypto News",
        "content": "Odds of Ethereum ETF approval fall on the back of SEC’s latest updates\n\nMatt Hougan believes Ethereum ETFs should be launched in December for optimal asset attraction\n\nThe probability of Ethereum [ETH] Spot ETFs being approved has fallen, primarily because of the absence of updates in the public filings and limited engagement with the SEC. While there’s still a chance before May, the likelihood is falling as there’s been no evident progress in the approval process.\n\nHowever, many in the industry remain optimistic about an eventual approval, citing parallels with the Bitcoin ETF. Echoing similar sentiments, Matt Hougan, CIO of Bitwise Asset Management, in conversation with Bankless, noted,\n\n“My view is that ultimately we will get an ethereum ETF. I think it’s probably the best shot on goal that the ETH world has had for a Bitcoin ETF was the new Fidelity update so I think we’ll eventually get it.”\n\nETFs timing dynamics\n\nHougan further highlighted that cryptocurrency ETF approval follows a 240-day review cycle, typically concluding in May – A crucial juncture for SEC decisions. He added,\n\n“I think Ethereum ETFs will pull in more assets if they launch in December than if they launch in May.”\n\nThis idea stems from institutions still adjusting to the Bitcoin ETF launch. Therefore, launching towards the end of the year is seen as more practical, potentially leading to more assets being gathered.\n\nNow, some execs have been comparing a potential Ethereum Spot ETF to just an opening act. In fact, they believe that an underwhelming Ethereum Futures performance is a negative indicator.\n\nContrary to the sentiment, however, Hougan said,\n\n“Ethereum ETFs will be way more successful than the Ethereum Futures”.\n\nLooming concerns surrounding Ethereum ETF\n\nDespite not generating the same level of initial excitement as Bitcoin, the exec remains optimistic about the potential success of Ethereum ETFs. He foresees these ETFs attracting billions of dollars in their inaugural year, although their growth trajectory is expected to be slower compared to that of Bitcoin.\n\n“I think they’ll be very successful and you’ll have BlackRock and you’ll have Bitwise and you have others talking about Ethereum and real-world use cases.”\n\nHe added,\n\n“I think it’ll be broadly additive for the space, but I don’t think it’ll be $50 billion in year one, it’ll be billions. It’ll be a success.”\n\nAccording to Ryan Rasmussen, CEO of Bitwise, as Ethereum gains mainstream recognition and understanding, demand for Ethereum ETFs will grow, driven by the desire to capitalize on its transformative potential.\n\nThe SEC’s ongoing inquiry into Ethereum’s security classification and its decision on 23 May could significantly impact Ether ETF applications and Ethereum’s future trajectory."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMi4gFBVV95cUxPdHljbDkwR3l3US13NFNWWWJTMWFvTG1oM0Zld25Ld3h0Y0l3N2pZY0czU3ROWGxHaEZiVm11MlpHZ3I2ZnNsNEVUeE0xTWRzb1QyUmJRTEtQbVV4Y2dIUHQ5eGdPbzJvMTVWT1RyVFIxZUJlX241OHEwZ0dkeUoxaGVEenI1MlFtek9hNVhZaGdyenJ4em5JMWd2MHBpaHExUHBERmhqamkwcllUclhqQ3lFQ0hLQ09wZm5vY1FCRzRjcGZCei1XOFZmVTNqTVVkTmc2ZnJDemlMa2ZCc2JnMk130gHnAUFVX3lxTE4wdXpTSndVMzNBa2Y1bmRzbmtEOEZtVTZVd19hRHhzUEg4TkVhSE5PN3dOV0Q4ckNpaEY2VENFdF9xNTM1VTVQcDVDNTlyN2ZzUEFUdWFZcW04TDRvM2dzTGcyaWJyZ2QzRTZLUVBFTWVmb0tlazFBNmVtY2JmMzlieW14bDJ3eEc0VGgyV1g3TGY4SWZZZE9kVVZQUWE0RXdEdmZBWDhBNDNDRUkxNmFlNDI2S1VESU03X3Nsc3QteE81RlY1dEJBSmRESkZkMGtISFctdm5teWRVWWNHQTlJNmNzVnJsNA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Layer 2 chains see nearly 32 million transactions per week after Dencun upgrade - FXStreet",
        "content": "On the weekly timeframe, Layer 2 tokens have printed nearly double-digit losses for holders. It remains to be seen whether the demand from users can aid recovery in L2 tokens in the coming week.\n\nThe radical increase in number of transactions despite rising competition from Solana and alternative chains marks a significant development in the Layer 2 ecosystem. As on April 6, Layer 2 tokens Polygon (MATIC), Stacks (STX), Mantle (MNT), ARB, ImmutableX (IMX), Starknet (STRK) piled on between 1% and 8% gains on Saturday.\n\nData from IntoTheBlock shows an increase in activity on the Layer 2 chains, as users respond to the declining transaction costs. This was anticipated as a result of the Dencun upgrade.\n\nWhile Solana is making headlines for failed transactions and rising DEX activity and meme coin narrative, Ethereum Layer 2 chains are seeing a consistent growth in activity. The Dencun upgrade resulted in a significant decrease in transaction cost on Layer 2 chains like Arbitrum (ARB), Optimism (OP) and Base (BASE).\n\nEthereum Layer 2 gas costs plummeted in response to the Dencun upgrade. Data from intelligence tracker IntoTheBlock show that the Dencun upgrade has reduced the transaction cost of Layer 2 chains and promoted an increase in on-chain activity on these protocols.\n\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all or a portion of your investment, as well as emotional distress. All risks, losses and costs associated with investing, including total loss of principal, are your responsibility. The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of FXStreet nor its advertisers. The author will not be held responsible for information that is found at the end of links posted on this page.\n\nIf not otherwise explicitly mentioned in the body of the article, at the time of writing, the author has no position in any stock mentioned in this article and no business relationship with any company mentioned. The author has not received compensation for writing this article, other than from FXStreet.\n\nFXStreet and the author do not provide personalized recommendations. The author makes no representations as to the accuracy, completeness, or suitability of this information. FXStreet and the author will not be liable for any errors, omissions or any losses, injuries or damages arising from this information and its display or use. Errors and omissions excepted.\n\nThe author and FXStreet are not registered investment advisors and nothing in this article is intended to be investment advice."
    }
]