[
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxNQkRjXzBTamRWbWEzYVFyRDdQaU5kSVEycXpDOHdKSUxpYVRZa01SejhCZklJOVU0OExFZF9iUHRGbGRRUjVvdzRnUU16ZUFtUGpqcUtYYWNJN2w0VGU5NFNndHRPSVh0bXhOTWFiZTRHbmVZUWdSMTVnUkc3YmFsSE92QTRONXhIemMyamIwbUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Gas Fees At ‘Rock Bottom’ as Network Activity Soars - Unchained",
        "content": "The average gas fees on the Ethereum mainnet dropped under three gwei as transactions across the layer 1 and layer 2 protocols are at an all-time high.\n\nMedian gas prices on Ethereum have dropped to their lowest level in years despite soaring network activity. Data from Dune compiled by @hildobby shows that mainnet gas prices dropped below three gwei on Friday for the first time since early 2020.\n\nGas prices are the cost to conduct a transaction on Ethereum. In dollar terms, the drop in gas prices equates to performing a swap on Uniswap for $1.06, trading an NFT on Seaport for $1.49 and transferring ETH on chain for $0.23, according to data from GasFees.io. When transacting on a layer 2 network like Base, which incorporates “blob” transactions, fee levels are reduced even further. A Uniswap swap on Base costs $0.0016 in fees, a Seaport trade costs $0.0021 and an ether transfer costs $0.00026.\n\nAccording to Pistachio.fi founder Brian Smocovich, the lower levels of fees on the network are not the result of a slowdown in transaction activity, but rather, the effect of a more efficient fee market.\n\n“Ethereum volume per day is the same if not higher than 6 months ago. L1 [layer 1] fee market is now more efficient because of L2 [layer 2] volume and EIP-4844,” said Smocovich on X.\n\n“The L1 gas market is now more efficient because most volume is on L2s, L2 -> L1 settlement is 100x cheaper than pre-4844, and we have the gas market efficiencies of EIP-1559,” he added.\n\nHe noted that gas is at “rock bottom” while network activity is at an all-time high, citing data from L2Beat which shows that layer 1 and layer 2 protocols recorded an average of 299 transactions per second on June 21.\n\nThe flip side to gas fees sinking is how it impacts the supply dynamics of the network, specifically, Ethereum’s burn rate which is now at a 12-month low.\n\nEIP-1559, introduced via the London hard fork, introduced a base fee tied to usage that would be burned or removed from supply. With a lower amount of fees to burn, ether’s supply has turned slightly inflationary and sits at a growth rate of around 0.56% a year, according to ultrasound.money."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxNNVIxbWpSN0wyLXA5eDhtWTQxWjBsM2YzRFAxdlBJLW5vQTVpUzUyS1dlMTdBZTRncjRfRFFBSG5VSWJqbnc0cUU3TXMyLVp0QUZELXd3Q2ZlMXdoSHR0c0J2OC11R1ZtY2JvTXpRMHhiMU9sMEJOOGYwUUpkZkpMV3IzZGI0cEVIbGN0QmFaTEQ0TVAzd0RPZ19XU08tR1hITl9KcDExdnJLdkx3MGJoNXdFSmxxNDF4UXhsRC1RakUxUXhq?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "Will Ethereum Price Rebound After Crashing to 1-Month Low? Top Experts Weigh - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTE9fcWJQUVhPcFNXY0h1VDhCdi04V3BGMDJ4aTJpa1I0OXZlZG56b2RIWUNvSjZ6UU9JTDIzV21ONDlCaXdDTTdHZjJaYVYwQWpSdEdKVXhOYl9XUVJ3OEJIY3FJYUlVMkdHalE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "Who Holds The Most Ethereum (ETH) in 2024? - Benzinga",
        "content": "SHORT ANSWER: The Beacon Deposit Contract has emerged as the dominant force, holding a staggering 38% of all ETH.\n\nEthereum, the world's second-largest cryptocurrency by market cap, continues to power decentralized applications and fuel innovation. But who are the whales holding the vast majority of Ethereum? In 2024, the landscape of major ethereum holders might have shifted. This guide dives into the latest data, revealing the key players — from individual investors to institutional giants — who control the most ETH. Join us as we unveil the hidden forces shaping the ethereum ecosystem and explore the potential implications for the future of this dynamic cryptocurrency.\n\nWho Owns the Most Ethereum?\n\nWith the recent ethereum merge transitioning the network from Proof-of-Work (PoW) to Proof-of-Stake (PoS), a new player has emerged as the biggest ethereum (ETH) holder: the Beacon Chain Deposit Contract. This contract allows users to stake their ETH on the Beacon Chain, the foundation of Ethereum 2.0. This shift to PoS likely explains the Beacon Deposit Contract's significant holding, currently sitting at over 46 million ETH, representing a whopping 38% of all ether. This translates to a staggering value of approximately $165 billion at the time of writing. Essentially, users have locked their ETH in the contract to contribute to the security and validation of transactions on the Ethereum network.\n\nTop 10 Ethereum Holders\n\nLet’s explore the top 10 Ethereum holder of current times:\n\n1. Beacon Deposit Contract\n\nThe Ethereum Merge to Proof-of-Stake (PoS) created a powerful new dynamic with the Beacon Deposit Contract. This contract lets users stake their ETH on the Beacon Chain, the core of Ethereum 2.0. This explains the Beacon Deposit Contract's massive holding — over 46 million ETH, a huge 30% of all Ethereum! Worth roughly $165 billion, users essentially locked their ETH to secure and validate ethereum transactions.\n\n2. Wrapped Ether Contract\n\nWrapped ether (WETH) plays a key role in Decentralized Finance (DeFi) applications. Since regular ETH isn't compatible with these platforms, WETH acts as a “wrapped” version that functions as an ERC-20 token. This allows users to seamlessly use their ETH on DeFi apps like Uniswap. Notably, the value of WETH remains identical to regular ETH, offering increased functionality without impacting price. Interestingly, the WETH contract holds a significant amount of ether, currently sitting at over 2.84 million ETH, making it the second-largest holder in the network.\n\n3. Binance 7\n\nBinance, the world's leading cryptocurrency exchange by trading volume, is also a major Ethereum (ETH) holder. Surprisingly, just three of its main ETH addresses (Binance 7, 8, and 28) collectively hold over 3.2 million ETH, making them the network's third-largest holder. These addresses manage exchange functions and bridge ETH between Binance Smart Chain (BSC) and Ethereum. The bridged ETH resides in the “Peg Tokens” address until it's withdrawn back to the Ethereum network.\n\n4. Arbitrum: Bridge\n\nArbitrum, a popular ethereum scaling solution, is emerging as a significant ETH holder. This technology allows users to interact with decentralized applications (dApps) and deploy smart contracts on a faster and cheaper network compared to Ethereum's mainnet. At the heart of Arbitrum lies its bridge contract, currently holding over 1.8 million ETH. This positions the bridge as the network's fourth-largest ETH holder. As Arbitrum gains traction due to its cost efficiency, this holding will likely increase further.\n\n5. Robinhood\n\nRobinhood, the popular trading app known for its commission-free stock trading, also holds a surprising amount of Ethereum. Despite some past controversies, Robinhood is the 5th largest individual holder of Ethereum, with nearly 1.4 million ETH under a single wallet address. This means Robinhood is a major player in the ethereum world, holding a large amount of this cryptocurrency.\n\n6. Kraken\n\nDespite facing SEC charges related to staking options, cryptocurrency exchange Kraken ranks as a major Ethereum holder. Their “Kraken 13\" wallet alone holds over 850,000 ETH, making it the 6th largest individual holder. Given Kraken's high trading volume, they likely hold even more ETH in smaller amounts across other wallets, though these wouldn't be on the top 100 individual address lists.\n\n7. Base: Base Portal\n\nNewcomer Base Portal is making waves in the Ethereum world. This project acts as a bridge, allowing users to move their ethereum (ETH) between different blockchains easily. Interestingly, Base Portal holds a significant amount of ETH, currently ranking as the 7th largest individual holder with over 504,000 ETH. This substantial holding suggests Base Portal might play a vital role in the Ethereum ecosystem, but it's still too early to say for certain.\n\n8. Bitfinex 19\n\nAnother major exchange by volume, Bitfinex, stands at 8th position and holds a significant amount of ETH scattered across five top 100 addresses: Bitfinex 19, MultiSig 3, 20, 15, and 5. These collectively hold around 2 million ETH. Two addresses likely serve trading and exchange functions, while the “MultiSig 3\" address might be their secure cold storage wallet due to its multi-signature nature.\n\n9. Gemini\n\nThe Gemini exchange, founded by the Winklevoss twins, is a major ethereum player. Their single wallet address ranks 9th largest holder, containing over 369,000 ETH. This positions Gemini as one of the top exchanges for holding ether, showcasing their confidence in this cryptocurrency.\n\n10. EthDev\n\nThe nonprofit ethereum Foundation oversees Ethereum's development. ETHDEV, a separate group of developers in cities like London and Berlin, acts as the project's development arm. As Ethereum matured, other organizations like ConsenSys joined the ecosystem to tackle specific areas. This division of labor allows focused development and benefits the entire ethereum network. Interestingly, ETHDEV holds over 309,000 ETH, ranking 10th among the largest ether holders.\n\nThe Largest Holders are Contracts, Not People\n\nThe landscape of major ETH holders has shifted significantly in 2024. The Beacon Deposit Contract, a product of the ethereum merge, has emerged as the dominant force, holding a staggering 38% of all ETH. This reflects users' commitment to securing the network by staking their ETH. Wrapped ethereum (WETH), crucial for DeFi applications, sits at number two with over 2.8 million ETH. Major cryptocurrency exchanges like Binance and Kraken are also major players, holding significant amounts across multiple wallets. Interestingly, newcomer Base Portal and the Winklevoss twins' Gemini exchange showcase the growing involvement of diverse players in the ethereum ecosystem. While the distribution of ETH ownership highlights its decentralized nature, the Beacon Deposit Contract's dominance underscores the critical role users play in securing the ethereum network.\n\nFrequently Asked Questions"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTE9fcWJQUVhPcFNXY0h1VDhCdi04V3BGMDJ4aTJpa1I0OXZlZG56b2RIWUNvSjZ6UU9JTDIzV21ONDlCaXdDTTdHZjJaYVYwQWpSdEdKVXhOYl9XUVJ3OEJIY3FJYUlVMkdHalE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "Who Holds The Most Ethereum (ETH) in 2024? - Benzinga",
        "content": "SHORT ANSWER: The Beacon Deposit Contract has emerged as the dominant force, holding a staggering 38% of all ETH.\n\nEthereum, the world's second-largest cryptocurrency by market cap, continues to power decentralized applications and fuel innovation. But who are the whales holding the vast majority of Ethereum? In 2024, the landscape of major ethereum holders might have shifted. This guide dives into the latest data, revealing the key players — from individual investors to institutional giants — who control the most ETH. Join us as we unveil the hidden forces shaping the ethereum ecosystem and explore the potential implications for the future of this dynamic cryptocurrency.\n\nWho Owns the Most Ethereum?\n\nWith the recent ethereum merge transitioning the network from Proof-of-Work (PoW) to Proof-of-Stake (PoS), a new player has emerged as the biggest ethereum (ETH) holder: the Beacon Chain Deposit Contract. This contract allows users to stake their ETH on the Beacon Chain, the foundation of Ethereum 2.0. This shift to PoS likely explains the Beacon Deposit Contract's significant holding, currently sitting at over 46 million ETH, representing a whopping 38% of all ether. This translates to a staggering value of approximately $165 billion at the time of writing. Essentially, users have locked their ETH in the contract to contribute to the security and validation of transactions on the Ethereum network.\n\nTop 10 Ethereum Holders\n\nLet’s explore the top 10 Ethereum holder of current times:\n\n1. Beacon Deposit Contract\n\nThe Ethereum Merge to Proof-of-Stake (PoS) created a powerful new dynamic with the Beacon Deposit Contract. This contract lets users stake their ETH on the Beacon Chain, the core of Ethereum 2.0. This explains the Beacon Deposit Contract's massive holding — over 46 million ETH, a huge 30% of all Ethereum! Worth roughly $165 billion, users essentially locked their ETH to secure and validate ethereum transactions.\n\n2. Wrapped Ether Contract\n\nWrapped ether (WETH) plays a key role in Decentralized Finance (DeFi) applications. Since regular ETH isn't compatible with these platforms, WETH acts as a “wrapped” version that functions as an ERC-20 token. This allows users to seamlessly use their ETH on DeFi apps like Uniswap. Notably, the value of WETH remains identical to regular ETH, offering increased functionality without impacting price. Interestingly, the WETH contract holds a significant amount of ether, currently sitting at over 2.84 million ETH, making it the second-largest holder in the network.\n\n3. Binance 7\n\nBinance, the world's leading cryptocurrency exchange by trading volume, is also a major Ethereum (ETH) holder. Surprisingly, just three of its main ETH addresses (Binance 7, 8, and 28) collectively hold over 3.2 million ETH, making them the network's third-largest holder. These addresses manage exchange functions and bridge ETH between Binance Smart Chain (BSC) and Ethereum. The bridged ETH resides in the “Peg Tokens” address until it's withdrawn back to the Ethereum network.\n\n4. Arbitrum: Bridge\n\nArbitrum, a popular ethereum scaling solution, is emerging as a significant ETH holder. This technology allows users to interact with decentralized applications (dApps) and deploy smart contracts on a faster and cheaper network compared to Ethereum's mainnet. At the heart of Arbitrum lies its bridge contract, currently holding over 1.8 million ETH. This positions the bridge as the network's fourth-largest ETH holder. As Arbitrum gains traction due to its cost efficiency, this holding will likely increase further.\n\n5. Robinhood\n\nRobinhood, the popular trading app known for its commission-free stock trading, also holds a surprising amount of Ethereum. Despite some past controversies, Robinhood is the 5th largest individual holder of Ethereum, with nearly 1.4 million ETH under a single wallet address. This means Robinhood is a major player in the ethereum world, holding a large amount of this cryptocurrency.\n\n6. Kraken\n\nDespite facing SEC charges related to staking options, cryptocurrency exchange Kraken ranks as a major Ethereum holder. Their “Kraken 13\" wallet alone holds over 850,000 ETH, making it the 6th largest individual holder. Given Kraken's high trading volume, they likely hold even more ETH in smaller amounts across other wallets, though these wouldn't be on the top 100 individual address lists.\n\n7. Base: Base Portal\n\nNewcomer Base Portal is making waves in the Ethereum world. This project acts as a bridge, allowing users to move their ethereum (ETH) between different blockchains easily. Interestingly, Base Portal holds a significant amount of ETH, currently ranking as the 7th largest individual holder with over 504,000 ETH. This substantial holding suggests Base Portal might play a vital role in the Ethereum ecosystem, but it's still too early to say for certain.\n\n8. Bitfinex 19\n\nAnother major exchange by volume, Bitfinex, stands at 8th position and holds a significant amount of ETH scattered across five top 100 addresses: Bitfinex 19, MultiSig 3, 20, 15, and 5. These collectively hold around 2 million ETH. Two addresses likely serve trading and exchange functions, while the “MultiSig 3\" address might be their secure cold storage wallet due to its multi-signature nature.\n\n9. Gemini\n\nThe Gemini exchange, founded by the Winklevoss twins, is a major ethereum player. Their single wallet address ranks 9th largest holder, containing over 369,000 ETH. This positions Gemini as one of the top exchanges for holding ether, showcasing their confidence in this cryptocurrency.\n\n10. EthDev\n\nThe nonprofit ethereum Foundation oversees Ethereum's development. ETHDEV, a separate group of developers in cities like London and Berlin, acts as the project's development arm. As Ethereum matured, other organizations like ConsenSys joined the ecosystem to tackle specific areas. This division of labor allows focused development and benefits the entire ethereum network. Interestingly, ETHDEV holds over 309,000 ETH, ranking 10th among the largest ether holders.\n\nThe Largest Holders are Contracts, Not People\n\nThe landscape of major ETH holders has shifted significantly in 2024. The Beacon Deposit Contract, a product of the ethereum merge, has emerged as the dominant force, holding a staggering 38% of all ETH. This reflects users' commitment to securing the network by staking their ETH. Wrapped ethereum (WETH), crucial for DeFi applications, sits at number two with over 2.8 million ETH. Major cryptocurrency exchanges like Binance and Kraken are also major players, holding significant amounts across multiple wallets. Interestingly, newcomer Base Portal and the Winklevoss twins' Gemini exchange showcase the growing involvement of diverse players in the ethereum ecosystem. While the distribution of ETH ownership highlights its decentralized nature, the Beacon Deposit Contract's dominance underscores the critical role users play in securing the ethereum network.\n\nFrequently Asked Questions"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTE9fcWJQUVhPcFNXY0h1VDhCdi04V3BGMDJ4aTJpa1I0OXZlZG56b2RIWUNvSjZ6UU9JTDIzV21ONDlCaXdDTTdHZjJaYVYwQWpSdEdKVXhOYl9XUVJ3OEJIY3FJYUlVMkdHalE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "Who Holds The Most Ethereum (ETH) in 2024? - Benzinga",
        "content": "SHORT ANSWER: The Beacon Deposit Contract has emerged as the dominant force, holding a staggering 38% of all ETH.\n\nEthereum, the world's second-largest cryptocurrency by market cap, continues to power decentralized applications and fuel innovation. But who are the whales holding the vast majority of Ethereum? In 2024, the landscape of major ethereum holders might have shifted. This guide dives into the latest data, revealing the key players — from individual investors to institutional giants — who control the most ETH. Join us as we unveil the hidden forces shaping the ethereum ecosystem and explore the potential implications for the future of this dynamic cryptocurrency.\n\nWho Owns the Most Ethereum?\n\nWith the recent ethereum merge transitioning the network from Proof-of-Work (PoW) to Proof-of-Stake (PoS), a new player has emerged as the biggest ethereum (ETH) holder: the Beacon Chain Deposit Contract. This contract allows users to stake their ETH on the Beacon Chain, the foundation of Ethereum 2.0. This shift to PoS likely explains the Beacon Deposit Contract's significant holding, currently sitting at over 46 million ETH, representing a whopping 38% of all ether. This translates to a staggering value of approximately $165 billion at the time of writing. Essentially, users have locked their ETH in the contract to contribute to the security and validation of transactions on the Ethereum network.\n\nTop 10 Ethereum Holders\n\nLet’s explore the top 10 Ethereum holder of current times:\n\n1. Beacon Deposit Contract\n\nThe Ethereum Merge to Proof-of-Stake (PoS) created a powerful new dynamic with the Beacon Deposit Contract. This contract lets users stake their ETH on the Beacon Chain, the core of Ethereum 2.0. This explains the Beacon Deposit Contract's massive holding — over 46 million ETH, a huge 30% of all Ethereum! Worth roughly $165 billion, users essentially locked their ETH to secure and validate ethereum transactions.\n\n2. Wrapped Ether Contract\n\nWrapped ether (WETH) plays a key role in Decentralized Finance (DeFi) applications. Since regular ETH isn't compatible with these platforms, WETH acts as a “wrapped” version that functions as an ERC-20 token. This allows users to seamlessly use their ETH on DeFi apps like Uniswap. Notably, the value of WETH remains identical to regular ETH, offering increased functionality without impacting price. Interestingly, the WETH contract holds a significant amount of ether, currently sitting at over 2.84 million ETH, making it the second-largest holder in the network.\n\n3. Binance 7\n\nBinance, the world's leading cryptocurrency exchange by trading volume, is also a major Ethereum (ETH) holder. Surprisingly, just three of its main ETH addresses (Binance 7, 8, and 28) collectively hold over 3.2 million ETH, making them the network's third-largest holder. These addresses manage exchange functions and bridge ETH between Binance Smart Chain (BSC) and Ethereum. The bridged ETH resides in the “Peg Tokens” address until it's withdrawn back to the Ethereum network.\n\n4. Arbitrum: Bridge\n\nArbitrum, a popular ethereum scaling solution, is emerging as a significant ETH holder. This technology allows users to interact with decentralized applications (dApps) and deploy smart contracts on a faster and cheaper network compared to Ethereum's mainnet. At the heart of Arbitrum lies its bridge contract, currently holding over 1.8 million ETH. This positions the bridge as the network's fourth-largest ETH holder. As Arbitrum gains traction due to its cost efficiency, this holding will likely increase further.\n\n5. Robinhood\n\nRobinhood, the popular trading app known for its commission-free stock trading, also holds a surprising amount of Ethereum. Despite some past controversies, Robinhood is the 5th largest individual holder of Ethereum, with nearly 1.4 million ETH under a single wallet address. This means Robinhood is a major player in the ethereum world, holding a large amount of this cryptocurrency.\n\n6. Kraken\n\nDespite facing SEC charges related to staking options, cryptocurrency exchange Kraken ranks as a major Ethereum holder. Their “Kraken 13\" wallet alone holds over 850,000 ETH, making it the 6th largest individual holder. Given Kraken's high trading volume, they likely hold even more ETH in smaller amounts across other wallets, though these wouldn't be on the top 100 individual address lists.\n\n7. Base: Base Portal\n\nNewcomer Base Portal is making waves in the Ethereum world. This project acts as a bridge, allowing users to move their ethereum (ETH) between different blockchains easily. Interestingly, Base Portal holds a significant amount of ETH, currently ranking as the 7th largest individual holder with over 504,000 ETH. This substantial holding suggests Base Portal might play a vital role in the Ethereum ecosystem, but it's still too early to say for certain.\n\n8. Bitfinex 19\n\nAnother major exchange by volume, Bitfinex, stands at 8th position and holds a significant amount of ETH scattered across five top 100 addresses: Bitfinex 19, MultiSig 3, 20, 15, and 5. These collectively hold around 2 million ETH. Two addresses likely serve trading and exchange functions, while the “MultiSig 3\" address might be their secure cold storage wallet due to its multi-signature nature.\n\n9. Gemini\n\nThe Gemini exchange, founded by the Winklevoss twins, is a major ethereum player. Their single wallet address ranks 9th largest holder, containing over 369,000 ETH. This positions Gemini as one of the top exchanges for holding ether, showcasing their confidence in this cryptocurrency.\n\n10. EthDev\n\nThe nonprofit ethereum Foundation oversees Ethereum's development. ETHDEV, a separate group of developers in cities like London and Berlin, acts as the project's development arm. As Ethereum matured, other organizations like ConsenSys joined the ecosystem to tackle specific areas. This division of labor allows focused development and benefits the entire ethereum network. Interestingly, ETHDEV holds over 309,000 ETH, ranking 10th among the largest ether holders.\n\nThe Largest Holders are Contracts, Not People\n\nThe landscape of major ETH holders has shifted significantly in 2024. The Beacon Deposit Contract, a product of the ethereum merge, has emerged as the dominant force, holding a staggering 38% of all ETH. This reflects users' commitment to securing the network by staking their ETH. Wrapped ethereum (WETH), crucial for DeFi applications, sits at number two with over 2.8 million ETH. Major cryptocurrency exchanges like Binance and Kraken are also major players, holding significant amounts across multiple wallets. Interestingly, newcomer Base Portal and the Winklevoss twins' Gemini exchange showcase the growing involvement of diverse players in the ethereum ecosystem. While the distribution of ETH ownership highlights its decentralized nature, the Beacon Deposit Contract's dominance underscores the critical role users play in securing the ethereum network.\n\nFrequently Asked Questions"
    }
]