[
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxQVXdiUG12X2Vadm9nenlRWHFWWXd2S1hpZ3p4QTNJNElxRF9ETHRuYVA2a2ZWYTV5YWVoWExnYVFrZkhKUmt3RGxtRDVSMEw1WEhRSG1oRVZpUE11SjBnTUpOUmRqOTlpdHhpYUVtcUpaeVJuRENTelhjbGVnYUdBRUQ1YTFiM2wzeEtwQ3VVRUxxdlJ0YzBPc094dFJCa2VQVjROVEZnZ3JqZWhxTXM5NF8xc0NYbUJI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "Crypto Token Ether Rallies on Claim About SEC’s Ethereum Probe - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxQVXdiUG12X2Vadm9nenlRWHFWWXd2S1hpZ3p4QTNJNElxRF9ETHRuYVA2a2ZWYTV5YWVoWExnYVFrZkhKUmt3RGxtRDVSMEw1WEhRSG1oRVZpUE11SjBnTUpOUmRqOTlpdHhpYUVtcUpaeVJuRENTelhjbGVnYUdBRUQ1YTFiM2wzeEtwQ3VVRUxxdlJ0YzBPc094dFJCa2VQVjROVEZnZ3JqZWhxTXM5NF8xc0NYbUJI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "Crypto Token Ether Rallies on Claim About SEC’s Ethereum Probe - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxONFlsbG9EQU9mNm5GSDlzNll1aldNTGFocTQtUl9yVkJ6TnNWTjVHNVN2NnFWaldNZUJMRldTSTlHRU9zV0FjdFlyVWFDVnZZS0QxdC1pSzJuRHhxZWctVkhPQ3NnU0FraTFya1d2RDl0dWJ2a2M4Q2x6dUVlQjEwb1lTbGZmNE9SWUNyZFFzeUl1enJZNGxjSjNxbmJpZGFKVnQ3OWc0NlFsZTlVdmRoQnA5bWExUHlSbEJ4TW10TklxYlQwbVJ4WVoxQm1SOG5jeW02aXBVdmtGek4ydTMyTXExWkF0U0hn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "Popular French Magazine Paris Match Converts Iconic Photos Into Ethereum NFTs, Puts Them For Sale In Auction - Benzinga",
        "content": "Paris Match, considered one of the best outlets for photojournalism, plans to auction some of the most iconic photos from its archives as non-fungible tokens.\n\nWhat Happened: The French weekly news magazine said that the auction, beginning Monday, will have 75 NFTs for sale, all of which were created on Ethereum ETH/USD, the blockchain known for housing some of the biggest collections like CryptoPunks and Bored Ape Yacht Club, reported Decrypt.\n\nSome photos selected for Monday's auction included The Rolling Stones, Jack Nicholson, Orson Welles, and John Travolta. News reports on watershed events like the Berlin Wall were also included.\n\nThe opening bid for photos began at 0.3 Ether, worth $1,148 at the time of writing. Along with the NFTs, the owners will also get physical prints of the photos.\n\nAs with other assets in this category, Paris Match NFT owners will have full digital license rights to the photos.\n\nWhy It Matters: The development coincides with an increased desire to convert entities with important historical and artistic significance to NFTs.\n\nEarlier this month, digital asset investment firm Galaxy Digital announced the tokenization of a nearly 300-year-old vintage violin once owned by Russian royalty. The tokenized version was used as collateral for a loan.\n\nThe global NFT sales volume surged 45% to $19.25 million in the last 24 hours, according to CryptoSlam. The total number of sales rose 11% to 193,714.\n\nEthereum clocked the highest sales at $7.19 million, followed by Polygon MATIC/USD and Bitcoin BTC/USD.\n\nRead Next: Deutsche Telekom, T-Mobile’s Parent Company, Will Mine Bitcoin"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxOZmV5WHVZTDJxeGl5ekpGMHIwMmpTdTI2UXdVckdJSC1zSkdyR19SY3J4bWg5N01YQjJsMXVwYXNYRkRORWw3dWplSEx3aU1IMWNIbU5rNDVlLU1vZ1ByV2QweEt6MllIcnVQbTZPNXByMWI3Y29yUmhvN3Bnc2VGaVBPVmo2a2ozQ0l1TkwybHN5bDJNeFdyMmVWMVp3OUQxSUJmNTVkT0VPdnZERzYyZ29JNzRrb05IR0R0a0MzMld4aDMwb2NWQXAyMEZVYkRSUzVMb0NOT2NpYUFTT2k4MEhlWFJRQk04?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Secures 'Momentous' Win After SEC Closes Security Probe: Whale Accumulates Over $19M Worth Of ETH In Immediate Aftermath - Benzinga",
        "content": "ConsenSys, a blockchain software company, announced a major victory for Ethereum ETH/USD, following the closure of the SEC’s investigation into whether the world’s second-largest cryptocurrency is a security.\n\nWhat Happened: On Tuesday, ConsenSys took to X to reveal that the regulator will not move forward with the charges alleging that sales of Ether are securities transactions.\n\nThe announcement followed a letter sent by ConsenSys to the SEC on June 7, asking for confirmation that the Ether spot ETF approvals last month, based on ETH being a commodity, would lead to the closure of the investigation.\n\nETHEREUM SURVIVES THE SEC.\n\n\n\nToday we're happy to announce a major win for Ethereum developers, technology providers, and industry participants: the Enforcement Division of the SEC has notified us that it is closing its investigation into Ethereum 2.0.\n\n\n\nThis means that the SEC… — Consensys (@Consensys) June 19, 2024\n\nSee Also: Bitcoin, Ethereum, Dogecoin Go Sideways, But ‘Market Structure Back To Bullish,’ Says Trader\n\nConsenSys emphasized that the closure of the Ethereum investigation, while significant, does not resolve all issues faced by blockchain developers, technology providers, and industry participants under the SEC’s crypto enforcement regime.\n\nThe company now seeks a declaration that its software offering MetaMask Swaps and Staking does not violate securities laws.\n\nThe positive news also got whales excited, with one investor scooping 5,603 Ether, worth $19.6 million, in the aftermath, according to Lookonchain.\n\nAfter @Consensys posted that the #SEC had closed its investigation into #Ethereum 2.0, the whale bought another 5,603 $ETH($19.6M).\n\n\n\nThe whale has withdrawn 16,604 $ETH($59M) at an average price of $3,600 from #Binance since May 30.https://t.co/NYbgSJevaT pic.twitter.com/N3vsISPeyX — Lookonchain (@lookonchain) June 19, 2024\n\nWhy It Matters: In April, ConsenSys alleged that the SEC had been covertly targeting Ethereum for over a year, scrutinizing its nature and whether it should be classified as a security.\n\nIn response, ConsenSys filed a lawsuit against the SEC, arguing that the SEC is overstepping its authority by attempting to regulate Ether.\n\nFor context, the CEO of ConsenSys, Joseph Lubin, was one of the co-founders of Ethereum.\n\nPrice Action: Reacting to the development, Ether spiked 3.32% to trade at $3,549.33, according to data from Benzinga Pro.\n\nRead Next: Bitcoin, Ethereum, Dogecoin Trade In The Red As Summer Doldrums Kick In: Analyst Says ‘We Are Early In The Cycle’"
    },
    {
        "id": 73,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE05VlY3V2V3c3Fld25xZ2pnLTRFVXM1OWEzRWpyZnRyRDVNOTZqUzJMYnZmMGVwaTRjSUlaUTdHUXA3blVkcmJWMjNwX3FtQ2hWdktMUjlBVGNQN25lYUY3aGN1a0NXa2d6NVdTdklMNVU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 18 Jun 2024 07:00:00 GMT",
        "title": "The dark side of tokenisation - Financial Times",
        "content": "Print this page\n\nThe writer is a law professor at the American University Washington College of Law\n\nTraditional financial institutions are increasingly showing interest in “tokenising” real-world assets, meaning they are curious about how these assets could be digitally represented by programmable tokens recorded on shared ledgers. There could be real efficiency gains associated with tokenisation, but the drive towards it could also take a dark turn.\n\nThe most dangerous outcomes would arise if tokenisation of real-world assets were pursued simply to feed into what has been described as “the perpetual motion machine that is crypto trading”. Regulators around the world have expressed concerns about the integration of crypto and traditional financial markets, because of the high levels of volatility, leverage, concentration and operational risk associated with the crypto markets. This integration would be sped up if ownership of tokenised real-world assets were recorded on so-called permissionless public blockchains. The type of ledger favoured by the crypto industry, these blockchains can be accessed by any computer running the necessary software to host them, no identification or vetting required\n\nThe tokenisation of real-world assets can and should proceed without using these problematic blockchains. Their inefficiencies are well documented, and experimentation to resolve problems in scaling their use tends to focus on processing transactions off the blockchain (defeating the stated goal of decentralisation).\n\nIt is perhaps less well appreciated that these kinds of blockchains are also plagued by governance problems. We cannot simply trust in the code of the blockchain. Public permissionless blockchains are “designed by people, maintained by people, and governed by people”, as one research paper put it. but we don’t necessarily know who these people are, who pays them, or if they’ll show up in an emergency. This is an untenable position for critical financial infrastructure.\n\nUnfortunately, BlackRock has chosen to host its tokenised Buidl fund on the public permissionless Ethereum blockchain. The good news is that some other financial institutions have taken a different path, and are experimenting with other kinds of ledgers to see if tokenisation yields efficiencies in their markets.\n\nEfficiencies can arise from programmability, meaning that software known as “smart contracts” can be built into the tokens to allow for the automation of functions, like interest payments. Smart contracts can also be used to build bespoke financial products out of multiple tokenised assets — this is known as composability. Ownership of tokenised assets can also be split into smaller pieces in a process known as fractionalisation. When ownership of all tokenised assets used in a single transaction is recorded on the same ledger, the transaction can be settled “atomically”, or simultaneously, 24/7.\n\nCross-border payments seem particularly ripe for improvement through tokenisation, but we shouldn’t rush to tokenise everything. Some purported benefits (particularly those relating to financial inclusion) are overhyped. And where efficiencies gains are real, they can invite corresponding fragilities. Even when divorced from crypto, there is a dark side to tokenisation.\n\nTokenisation promises to bring more real-world assets into the financial markets, and to engineer them into new categories of bespoke financial products both big (through composability) and small (through fractionalisation). This may unlock liquidity and efficiencies in good times, but we learned in 2008 that illiquidity, deleveraging and fire sales will be on the menu when things turn south. Discretion and forbearance (for example, with regard to margin calls) are often critical to containing the damage in these circumstances, but obligations automated with smart contracts will inflexibly self-execute regardless of context.\n\nIn addition, smart contract software provides another attack surface for hackers, and the more comprehensive the underlying ledger, the more attractive a target it becomes for cyber attacks. Atomic settlement also deprives markets of the benefits of netting of transactions.\n\nIf we think back to 2020, we learned the hard way that supply chains could become brittle when the unexpected occurred; now there is increasing interest in production strategies that are less efficient, but more resilient. We should explore tokenisation with the same mindset. We need to ask “when something is efficient enough, will making it more efficient introduce too many fragilities and be counterproductive in the long run?” In the best-case scenario, tokenisation experimentation will spur the financial industry to start thinking intentionally about this question.\n\n."
    }
]