[
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxNRGRfeVc2bzZ0ZC1NTmFSdFVESE1kcE1oZEpjdDlmSGRJU1FGVkFKaXNUQVZVTEtQYmlHWEV1NnozaWMzcl82eG5PdWoxWjVJUnRYYU1PVDU5Wm5ZX3IwSDhUeUpsaVhPcTNTcFJwS3d5VDQ3a2FhT3dGU3BjX01BRldTck1hbV93R2d0Q3BRZmPSAZYBQVVfeXFMT2txaFRPNmpvVE5wNWI1aGl0QUFtVmFyZmhJMERuTkhjNXJqa0R1d0V3dlJ5RS16YTNHclFzZlBIUTZoYWxfYzBURnUteUN0NHFzZTJqRFdJSTNRamd4TzBySWthTEh4VG9PekJaSVY0R2ZVVDNFeWVBT2xQaXg2S3Aza21uYjRNZTNZSmV3VFRNZ3drYkJB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jan 2024 08:00:00 GMT",
        "title": "Here’s Ethereum’s Roadmap for 2024, According to Vitalik Buterin - CryptoPotato",
        "content": "Vitalik Buterin, the co-founder of Ethereum, has released a roadmap detailing the network’s upgrades and activities for 2024.\n\nIn a series of tweets, Buterin stated that the 2024 roadmap contained few changes from the 2023 plan and that the network is set to focus on the Merge, the Surge, the Scourge, the Verge, the Purge, and the Splurge.\n\nEthereum’s Roadmap For 2024\n\nSince the Merge took place in September 2022, the Ethereum network will now prioritize implementing the role of a single slot finality (SSF). While the Merge saw Ethereum transition from a Proof-of-Work (PoW) consensus mechanism to that of Proof-of-Stake (PoS), SSF will resolve the network’s current weaknesses.\n\nThe concept of SSF can make Ethereum’s consensus mechanism validate blocks more efficiently; the blocks could be proposed and finalized in the same slot, significantly reducing time-to-finality by 15 minutes. Buterin believes this is the easiest path to fixing Ethereum’s PoS issues.\n\nThen comes the Surge with a goal of 100,000 transactions per second on rollups. The Ethereum co-founder revealed that cross-rollup standards and interop have been highlighted as areas for long-term improvements, and 2024 will see significant progress on rollup scaling both on EIP-4844 and from rollups themselves.\n\nEthereum is also looking to fix its centralization issues through the Scourge. Per the roadmap, the focus will be on mitigating such concerns in the network’s PoS design, especially around Maximal extractable value (MEV) and liquid staking or pooling. Buterin earlier recommended reducing the cost of running nodes to fix the challenge.\n\nEasing Block Verifications\n\nFurthermore, the roadmap mentioned the Verge, which could make block verification easier. Verkle trees are almost ready for inclusion, and soon, verifying blocks would only involve downloading some bytes of data, performing a few basic computations, and verifying a Succinct, Non-Interactive Argument of Knowledge (SNARK).\n\nThe network would explore Ethereum Virtual Machine (EVM) verification precompile to arrive at a fully SNARKed Ethereum.\n\nIn addition, the Purge will simplify the protocol, eliminate technical debts, and limit network participation costs, while the Splurge will fix everything else.\n\n“‘Increase L1 gas limit’ was removed to emphasize that the limit can be raised *at any time*; no need to wait for full SNARKs esp for small increases. ‘State expiry’ has been shrunk, to reflect a general consensus that it’s a fairly low-priority and low-urgency item esp given stateless clients and PBS / execution tickets,” Buterin explained."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxNNC00NDQ3eElySG1QNll6ZVNCY2JuOG5Wa2UzVXo0WDZ3b21POFM1Q3U0OEt1WlY0RFFQTDBadTNSWC1pZWtGNEQ0SUtzVWJnTnJHSjhxNmlJMUZkUDlNUjJKZVZMbEw3NFcwaGVadWZLRWZNd016blp0Vk5SXzc0bDZCV3BvcjlEcjRXWTVrR3JWZDVqX2k4ZDBfWDBhZi1rRUtDUTRpamNxb3h3czh4ZHVwNk9aMjkzYXNIN2NLSHcxNzdLcWFvT1QtX0xFYlHSAdQBQVVfeXFMTWl0MFdmNHZXTldhWVR4ZVZlM1ZtS1RmaE1uWDNmWmgwbnIzbzZsam9ETkZ4Z2E3R1ZTcEFaTXFGYldPRGJhV01Gdzhuc2lyMGltMjlDS1NyOFNORjVHQnc2Mzg5Vi1FMjF0T0I3VjVGX3VJMnF2MTlMQ1EtdFFjeDBEeWhoakU4aldUZXU3WVprR1FUWlJxQWdKZFZhLXRnVmI2aXJhTVRxR2FhV29kVjV3QWkzejlaTy0tNVpxaWpuQkQ0RlFVSzNGLWhNaF9GaGlGY0o?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jan 2024 08:00:00 GMT",
        "title": "Ethereum monthly transaction count climbs to highest level since July 2022 - FXStreet",
        "content": "Ethereum’s monthly transaction count amounted to 36.02 million in January.\n\nThis is its highest monthly count since July 2022.\n\nDespite the surge in demand for the network, its NFT sales volume and DeFi TVL saw declines.\n\nEthereum (ETH) recorded a monthly transaction count of 36.02 million, marking its highest in 20 months.\n\nAlso read: Ethereum Price Prediction: $2,500 in sight as bullish metrics steer ETH back into the channel\n\nSurge in user activity\n\nProof-of-Stake network Ethereum (ETH) experienced a significant increase in activity in January, recording its highest monthly transaction count since July 2022, according to The Block Data dashboard. Information from the data provider showed that during the 31-day period, transactions on the network totaled 36.02 million.\n\nEthereum monthly transaction count\n\nA rise in a Network’s Transaction Count is often due to a corresponding uptick in user activity. Data from The Block showed that in January, the daily number of unique addresses that were active on Ethereum, either as a sender or receiver, rose by 4%. The Daily Active Addresses on Ethereum was 14.1 million, the highest recorded since October 2022.\n\nEthereum’s NFT and DeFi verticals lose steam\n\nWhile the network saw an increase in user activity, the growth markers of Ethereum’s non-fungible tokens (NFTs) and Decentralized Finance (DeFi) ecosystems showed a decline in both verticals in January.\n\nTo assess the performance of a network’s NFT ecosystem, its sales volume is considered. Data from CryptoSlam showed that in January, NFT sales volume on Ethereum plummeted by 2%. According to the data provider, 138,465 NFT transactions were completed on the chain with a sales volume of $356 million.\n\nInterestingly, the fall in Ethereum’s sales volume did not mirror the general market’s performance. According to data from NFTGo, the total volume of NFT sales across all collections in January climbed by 41%.\n\nRegarding Ethereum’s DeFi sector, it witnessed a 7% dip in its Total Value Locked (TVL) in the last month, per data from DefiLlama. At press time, Ethereum’s DeFi TVL was $31.85B\n\nDouble-digit decline in network fees and revenue\n\nDespite the surge in user activity and demand for Ethereum in January, it took a significant hit to its transaction fees and revenue.\n\nEthereum Monthly Fee and Revenue\n\nData from Token Terminal showed that during the period under review, users paid a total of $213 million in fees to use Ethereum. This marked a 34% decline from the $325 million the network received as user fees in December.\n\nLikewise, the revenue it derived from last month’s fees plunged by 37%. In January, Ethereum’s monthly revenue totaled $179 million. In December, it was almost $290 million.\n\nWith the consistent sideways movement in ETH’s price, the network may witness a decline in demand in February unless market sentiment improves. Should this happen, network fees and revenue may plunge further."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxOcHkzOGhLZkxLdnhWc0NFUVVWNUZWUVg3SlZjR0NJSEJ3OWs4TXhMdEx2MEJlblN5Ym1FU3dvQkR0ejZnV3dNUHZmTlRvN29TUVRtazhHMlRmc1czV04zWFotWEtvdFoyV05yeENzUU5Cd3lNaEFGNjY2MW04QTl2bmhVSW1Cd9IBjgFBVV95cUxPUWUxWFRObjRlZTNYSzc1Qloya1NIaGxYQk1KbUJTWWN0ZUFKUWY3RDkyRVZzb0E4STE5NzhUU2d4VXBSb1lzNG9NbEp1emxIRFJJb005WnNfM0xUNkRTR3R2Tk15NTVXTWtON09KMk9SV0pPMUloRmFBWkQwV3luYXFTTkVVNUhXamdIZUhB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jan 2024 08:00:00 GMT",
        "title": "Dymension Is the Latest Airdrop for Solana, Ethereum, and Cosmos Users - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIt’s a new year, but airdrop season is continuing at full force into 2024. The latest: Dymension, a network for deploying app chains called “RollApps,” has revealed a token drop for more than a million crypto users across various chains and projects.\n\nDymension is a layer-1 blockchain built on Cosmos and the inter-blockchain communication protocol (IBC) to enable connections across various rollup scaling networks. “Dymension standardizes rollups with IBC, similar to how tokens were standardized with ERC,” Dymension wrote on Twitter (aka X), referring to Ethereum’s token standards.\n\nThe network lets RollApp creators choose which virtual machine and token to use, and can publish data to external chains like Celestia or Avail. Dymension CEO and co-founder Yishay Harel told Decrypt that the L1 network uses Ethereum Virtual Machine (EVM) addresses.\n\nOn Tuesday, Dymension revealed its “genesis rolldrop,” which offers up DYM tokens to eligible users until January 21. United States residents cannot participate in the airdrop. However, a wide array of other crypto users are eligible for the airdrop, with some 70 million DYM tokens (7% of the supply) being offered up.\n\nAD\n\nAD\n\nStarting today, over one million addresses have the opportunity to participate in Dymension’s Genesis Rolldrop! Eligible participants can claim up to 70M DYM (7% of total supply), the native asset of Dymension, until 21 January 2024, 12:00 UTC — Dymension (@dymension) January 2, 2024\n\nFull details are available in this blog post, but eligible users include those who staked the TIA token in Celestia as of December 19, 2023, along with users of Ethereum layer-2 networks Arbitrum, Optimism, Base, and the upcoming Blast based on certain criteria.\n\nCosmos Hub and Stride users who meet certain eligibility can also claim DYM tokens, along with users of the Osmosis decentralized exchange (DEX).\n\nMore than 500,000 Solana users are also eligible, according to the post, including addresses that have used protocols like cross-chain bridge Wormhole, leading NFT marketplace Tensor, and NFT distribution platform Drip.Haus.\n\nAD\n\nAD\n\nAdditionally, owners of Pudgy Penguins, Mad Lads, Tensorians, and Bad Kids NFTs can also claim an allotment of DYM tokens. Pudgy Penguins is minted on Ethereum, Mad Lads and Tensorians are on Solana, and Bad Kids is on the Cosmos-based Stargaze chain.\n\nLastly, following the genesis airdrop, Dymension has proposed allocating a further 2.5 million DYM to users who bridge funds to the chain from other networks. Eligible tokens include USDC, TIA, USDT, ATOM, ETH, and SOL, with that program expected to begin about a week following the upcoming Dymension airdrop launch.\n\nDymension joins a growing list of networks and projects that are dropping their tokens lately, including recent high-profile airdrops from Jito and Pyth Network and upcoming drops from the likes of Jupiter, Starknet, Portal, Frame, and Blast.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxQUWg2bUtRd0RnY21IMFN4QjZ4UXZpdXF4aklNWkRaX1pBb0ZmdW94RjJXZi1ETUF4ZW40NVMtMXNON2p6RHZHNzduaDB2V3hvWFd2U1gxYzFPZHhOd1plZWhjeHZNRlNrZ2lXLUFqNzl1dmsxeHBVSFF2b0F5MDA4MEhGMWVwbFl5ZU90NzlaMlpveThLOWFYNDZwa9IBoAFBVV95cUxQSzRHRUJqcm5CVVNwOFotdTlNX2ZOUGpjTVJaa3hnV1g0eHVhaFl1bVZZUGMwSnZ0a180WHFOMDBkcVRnUGp2YTBha0FBR1R5bm4yZy1YVTZXQjJKUXdITklkNTRXUmk2dTlJeG1lZ1JFYTBDZTQzVVlsLUNMVS10M0lKUmllRUJJdlhzUTZRS1VPU2kyLWRkTGR5YnljemRY?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jan 2024 08:00:00 GMT",
        "title": "Ethereum (ETH) Price Poised for 2-3x Gains As Per These On-Chain Indicators - CoinGape",
        "content": "As the bitcoin (BTC) price jumped 7% shooting past $45,000 in the wake of Bitcoin ETF approval, altcoins too joined the party. The Ethereum (ETH) price is up once again by 2% in the last 24 hours, moving closer to $2,400.\n\nOn-chain indicators for Ethereum continue to show strength, suggesting a much larger rally ahead from here onwards. Predictions are already strong that the ETH price can rally all the way to $10,000 by this year’s end.\n\nadvertisement\n\nEthereum (ETH) On-Chain Indicators\n\nIn a recent market analysis, renowned crypto analyst Ali Martinez expressed a bullish outlook for Ethereum (ETH). Martinez highlighted a promising path ahead for Ethereum, emphasizing the absence of significant supply barriers, which could pave the way for potential gains to $2,700 or beyond.\n\nAdditionally, the analysis pointed out a robust demand wall at $2,000, indicating substantial support that may act as a cushion in the event of corrections. The positive forecast aligns with the current market dynamics, reflecting optimism regarding Ethereum’s price trajectory in the near term.\n\nIn insights shared by crypto analyst Ali Martinez, the Ethereum MVRV Pricing Bands indicate pivotal price targets for the cryptocurrency. Martinez pointed out that, according to the data, the next significant price targets for Ethereum ($ETH) are identified at $3,830 and $5,100. This analysis provides valuable guidance for investors and market participants, shedding light on potential future price movements in the Ethereum market.\n\nETH Exchange Supply Falling Sharply\n\nAnother positive indicator for Ethereum is the sharp drop in the exchange supply. Data from Santiment reveals that the supply of ETH tokens on exchanges has reached an unprecedented all-time low since the inception of Ether.\n\nAs of the latest data, Ethereum’s supply on exchanges represents only 8.04% of the total ETH supply. This marks the lowest level recorded since the cryptocurrency’s genesis. The on-exchange supply of an altcoin like ETH often plays a crucial role in influencing its market price. A decrease in the supply is generally perceived as a bullish indicator, suggesting a potential reduction in selling pressure on ETH.\n\nEthereum co-founder Vitalik Buterin recently shared a roadmap that seeks to improve the efficiency of the PoS system.\n\nBhushan Akolkar Bhushan is a FinTech enthusiast with a keen understanding of financial markets. His interest in economics and finance has led him to focus on emerging Blockchain technology and cryptocurrency markets. He is committed to continuous learning and stays motivated by sharing the knowledge he acquires. In his free time, Bhushan enjoys reading thriller fiction novels and occasionally explores his culinary skills.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxQV1h3M0k5QlIyeE5PQ1NrYlVjOWgybUVQeEFwZDJCS2hVSW56b0hiSE9rem93N3RYLWtkekZIWno5d1RRa1V6NURlWWZqeXlsdWNvUzJycy1tVUdVd2FobG42WGs0NUFmclBQNjltcnpDNmZrT2JlUnh0a1FBaWVYdlRB0gGKAUFVX3lxTE9zY253aDN6Y2tvVTVMc0tFWC13X3d3WllGaHFsc1E5ZTdKOExCX2hyWTdWVW9SZk5DV3BuS3BvRVZzUnlKNW5vMTVrM1ZkdGVkdV9JSkMtZlFRY05fU1hvTy1PTHEtZ1lWUXppUWszMkZfYnowSmJwQk1TeW1sdFl2RnhfM1BYdFE0Zw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jan 2024 08:00:00 GMT",
        "title": "Solana NFT Sales Skyrocket, Topping Ethereum in Monthly Volume for First Time - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nSolana’s surging fortunes of late have produced a surprising result in the NFT market: monthly sales volume of NFTs on the network beat that of NFTs on Ethereum in December 2023, for the first time ever.\n\nAccording to data from analytics platform CryptoSlam, Solana NFT sales tallied about $366.5 million worth in December compared to $353.2 million on Ethereum. CryptoSlam’s “organic” sales figures exclude suspicious trades marked as “wash trading,” with about $381 million worth of Ethereum sales excluded and just $10.1 million worth of Solana sales pulled out.\n\nSolana’s total of $366.5 million in trades nearly matched the network’s all-time high, according to CryptoSlam, which was about $373.5 million worth in October 2021 as the space was just heating up. We’ve seen daily Solana NFT sales volume pop above Ethereum at times, but never in terms of a full month’s worth of trades.\n\nSolana saw about double the amount of unique buyers and sellers in December too, and far more total NFT transactions. CryptoSlam reports about 218,000 sellers and 279,000 buyers on Solana across nearly 6.6 million NFT transactions. Compare that to about 114,000 sellers and over 143,000 buyers on Ethereum, across 698,000 transactions.\n\nAD\n\nAD\n\nEthereum’s NFT sales volume in December was pretty much flat compared to November’s total of almost $350 million worth, while Solana saw a surge from about $83 million worth then.\n\nOf course, Solana has seen its price rise dramatically of late. SOL is up over 71% in the past month, and has more than quadrupled in price over the past three months. Ethereum, by contrast, is up 9% in the last 30 days and about 44% since three months ago.\n\nSolana’s price jump may be part of the reason why the value of its NFT sales spiked in December, but it doesn’t account for the roughly tripled number of unique traders and sixfold increase on monthly NFT transactions. Also, the average NFT sale on Solana actually fell from about $74 in November to under $56 in December.\n\nThe surge in users and transactions may be due to broader momentum around Solana and hype around particular projects tied to potential access to airdrops and other perks. Tensorians, for example, the NFT project tied to leading Solana marketplace Tensor, saw $28 million worth of trades in December, while Mad Lads generated $24.5 million in trades.\n\nAD\n\nAD\n\nAccording to CryptoSlam, the top Ethereum NFT project in December was the Bored Ape Yacht Club with $19.5 million worth of NFT trades, with Pudgy Penguins following behind with about $18.3 million worth of trades.\n\nAt a glance, CryptoSlam’s data suggests that Bitcoin Ordinals trades—that is, the protocol that enables NFT-like media to be put on the Bitcoin blockchain—generated more trading volume than Ethereum and Solana combined in December, with $881.2 million worth across over 493,000 transactions.\n\nHowever, CryptoSlam tracks Bitcoin Ordinals differently than it does NFTs on other networks. The data includes trading of BRC-20 tokens, which are minted via the Ordinals protocol but function like fungible, interchangeable tokens on other chains. CryptoSlam does not track the trading of Ethereum ERC-20 tokens or Solana SPL tokens, which are effectively similar to BRC-20 tokens.\n\nUncategorized Ordinals—that is, various media assets that aren’t part of a defined project—made up about $88.5 million worth of trades in December, with the top individual Ordinals project being Bitcoin Frogs at $27.7 million.\n\nThe next-highest ranking individual Ordinals project that isn’t a BRC-20 token? Bitcoin Punks, a CryptoPunks knockoff, with less than $3.3 million worth of trades in December. Fungible token trades make up an enormous portion of Ordinals trading tracked on the platform, making it difficult to take the Bitcoin figures at face value."
    }
]