[
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxQOTAtV0RENDRuX1QzeU5PTGlCLW15V1NXcFI3SjZsOU9IYVhQYTJ2Y29xTHpVVDIxNGRGeUtYbmxndW1FaW9BTUl6ZUFfeGpVM2VvazBzRkliOFhwckUzOXZNd0RhT2swTXhlM0kwV2dqVEtOemxuc2JNWmpLaTEtenlXMkVwU3BNUjRuTl91dGlQcDBWWFJKU3lZOTBsV21kTVpURnRSb2pFTkFhNkxkalMtbDdRemw3RUVaakxB0gHDAUFVX3lxTE9tVVp4MXlGdlhxX3FJUGYtUWJQUHpIWXZWTGE4VTVBVGlpeXdJTDhWY0thVnAxN2VQcVNUMGlhNld3ejRoYkR0SWtVQ3NZWEtOZ0dQTTQ3Zl9rRjZ4ZHZERVRHOHhZVFBCdGc3NUZQR2JiZ3BaZmU3ZFhabVRqZjVkemlhQTBVTzNsMjdxVDQ2SHdxazV6dHRWdm9TdTRPdmszZWlxeGVlelNmY01mYUVoTkdzT3FCdTNSb0VpVlVmdGlkbw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Feb 2024 08:00:00 GMT",
        "title": "Apparent 'Insiders’ Make Millions After Grabbing Ethereum Version of Dogwifhat - CoinDesk",
        "content": "“I originally created the meme you all know as “dogwifhat,” @issa said on X. “With so many of you reaching out to me and the $WIF team never acknowledging me as the original creator, I wanted to clarify that I have no affiliation with them and never owned or received any allocation.”"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE1kUXdvbjlRbThLd2dubFpLcFBTWE84czdvdkRWcjl2SF9ISS0taVNTZ0pnZ3k4WjdiYmtLU3hSUzF2NE9wWkhVekluN3c4STVRWWxCYlQ1bHUwanNRV3F1VFRHZjFIRm4yN0llN0Q5cFZmMWNzOFBhaG9sNNIBgwFBVV95cUxOYVU2TlFsUmlHSndYaXJ3dF9ldTlWSDdvbUQ4V2FUVmwwdlVKY3JNT3RTQUwtaDliSnpMUUJEUFJucl84X0pnQVhWc1Z2UVNHb21CeDMwbE1vcGQteFU0U2paZzNlTlhabUg0cFBrTDBpM0ZxUGFWRVJkTG1RVGJJcDYxaw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Feb 2024 08:00:00 GMT",
        "title": "You Can Now Use Your .Com Domain as Your Ethereum Address With GoDaddy and ENS - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEthereum Name Service (ENS) domains are different from traditional Domain Name System (DNS) website domains. ENS domains can be assigned to an Ethereum wallet to ease the hassle of sending funds and assets, as they're much easlier to remember than a typical alphanumeric wallet address. But typical web browsers can’t do much with them.\n\nThe two are getting closer together, though, thanks to a new alliance between ENS and GoDaddy. The web domain registrar just linked up with ENS to make it possible to tie a DNS address (like .com or .net) to an ENS name (.eth), so that the DNS domain can be used with crypto apps, wallets, and more.\n\n“With this milestone, we are furthering our mission to build a more secure, decentralized, and user-friendly internet,” ENS founder Nick Johnson said in a release.\n\n“ENS, much like DNS, is a public good and a core part of the internet infrastructure,” he continued. “By pairing up ENS names and GoDaddy domains, we will streamline the way users interact with web domains, blending the familiarity of the DNS with the potential of blockchain technology.”\n\nAD\n\nAD\n\nThanks to Gasless DNSSEC, users can now easily associate an Ethereum address with their DNS domain name (.com, .xyz, etc.), allowing seamless integration with all applications that properly support ENS! 😱 Just follow these simple steps! pic.twitter.com/rdE7KGicup — ens.eth (@ensdomains) February 5, 2024\n\nAccording to a blog post, GoDaddy has added a new section to its domain management dashboard, letting users pair an owned ENS name with the owned DNS name. There are no additional fees to use the feature, and ENS says that your DNS domain name can then be used in place of the ENS address on supported exchanges and marketplaces, for example.\n\nENS says it was previously possible to import DNS names over to its Ethereum-based decentralized architecture, but that it was a costly process that could cost as much as 0.5 ETH—about $1,150 worth at present. But last week’s passage of the Gasless DNSSEC functionality enables the move without such exorbitant network fees.\n\nEdited by Ryan Ozawa.\n\nAD\n\nAD"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE5SX3FhUkpocG1ubWthQ2NjckpkT3Y3bzlVeFl3dXNrYUN2MXlaYTlvMm5UcnlrMzAzRmlRVUFWRjNWTW5SZjhneEN4UDhoeXRYbjRtY09ybS1KcEdYUmRSUUs4QzdfTlVNdHFvNnd4WlMxMTR3cUlZ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Feb 2024 08:00:00 GMT",
        "title": "ENS partners with GoDaddy to enable users to link wallets to domains - Blockworks",
        "content": "Ethereum Name Service (ENS), a domain naming system on the Ethereum blockchain, has partnered with GoDaddy, a domain registrar, to enable users to easily link their wallets to web pages.\n\nENS can be considered the blockchain-based counterpart to the Domain Name System (DNS) that is widely utilized in Web2.\n\nDNS services assign unique IP addresses to devices, facilitating the translation of these addresses into user-friendly domain names for accessing internet web pages. Similarly, ENS services convert intricate wallet addresses into easily readable names.\n\nThis latest integration with GoDaddy, one of the world’s largest web hosting providers, will allow users to connect their simplified ENS wallet addresses with their DNS.\n\nBridging the gap between Web2 and Web3 comes with its own set of problems, however, like concerns around censorship.\n\nRead more: Ethereum devs consider ‘existential’ upgrade to the EVM\n\nMost recently, Kubi Mensah, the co-founder of Gattaca, noted in a post on X that its domain was suspended indefinitely without any prior notice.\n\nAlthough the issue was resolved after escalating concerns to the senior management of the domain provider, the reason for the suspension was never made apparent.\n\n“We see this incident as a reminder that the fight against censorship is hard but worth every bit of our effort,” Mensah wrote.\n\nGenerally speaking, due to the decentralized nature of Web3 domains, entities themselves can not suspend, take or control an ENS .eth domain, Nick Johnson, the founder and lead developer of ENS, told Blockworks.\n\n“ENS .eth domains are censorship-resistant and tamper-proof by design; even the ENS DAO has no power to revoke or restrict a .eth domain,” Johnson said.\n\nHowever, this latest collaboration is a gateway for Web2 domain users to access blockchain technologies via their domains, and ownership of a DNS domain ultimately remains with the registrar.\n\n“Names that are imported from DNS — using our new integration with GoDaddy or our legacy integration — remain subject to the registrar they are held with, and the rules imposed by the registrar and ICANN,” Johnson said.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxNaUFqM3Z3QndaVGpnWFpIMHNSZnR2c3VJQTlvQ2owa0hQbXg5YnlKZEJrbExNdFR5T0pEeWp1anFQOWtWeDB2aEtNMHB0REpzUXRURG5GM3FQUTdsNEpUM045V09QLWY2TlZUX0xpdDA5dk03Y0lFRE1nSUlSX3l4N3hoZTlXYTVtMGZkckc1MmVyQ2JKOGg1RWZn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Feb 2024 08:00:00 GMT",
        "title": "How 20 million GoDaddy users can finally add Ethereum to their websites - DLNews",
        "content": "A GoDaddy representative told DL News that DNS is a great piece of technology, but falls a bit short at “holding data.”\n\nThe domain registry giant selected Ethereum Name Service among a host of competitors in the industry.\n\nA key component of integrating ENS includes offering gasless transactions.\n\nAfter several years examining blockchain technology, GoDaddy is finally taking the plunge.\n\n“It’s been a few years. I’ve been talking at various conferences and formally to all different companies in the space,” Paul Nicks, the firm’s domains president, told DL News.\n\n“ENS is the first company that shared a vision, bridging the gap between the known, good, scalable, secure DNS infrastructure, with some of the cool emerging things happening in the blockchain space.”\n\nThe tie-up now means that from today, more than 20 million GoDaddy users will see a new button in their accounts, letting them link their web2 domains to the Ethereum Name Service.\n\nAfter that, it’s a matter of adding their crypto addresses.\n\nThe two firms are in the same business.\n\nWhile domain registrars like GoDaddy help turn clunky IP addresses into human-readable names, Ethereum Name Service does the same for the string of letters and numbers used for crypto addresses.\n\n“DNS is great as the phonebook, showing that this points here. Where I think it falls a bit short in creating some of the interesting technologies, is holding data,” said Nicks, explaining the firm’s move into blockchain technology.\n\nJoin the community to get our latest stories and updates\n\nEthereum Name Service goes gasless\n\nExecuting the new integration will be without gas fees, too, a key sticking point for Nicks’ move into the space.\n\n“That was what allowed us to really take this and say, ‘it’s good for our customers,’” he told DL News. “We pushed as hard as we could to make this super simple, and remove all the friction possible.”\n\nThe integration goes live today, but for ENS founder Nick Johnson, it’s just the beginning of the firm’s deeper integration with the Internet’s original phonebook — Domain Name Service.\n\n“We’re immediately working on improving the fields that are accessible to include all the ones that DNS supports, which means you’ll be able to basically use the domain as your crypto profile,” he told DL News.\n\n“If you then sign up with something like Farcaster, for instance, you would potentially be able to import all of your profile details simply by signing up and authenticating with your ENS name, which could also be your domain name.”\n\nAs for any other firms Johnson is looking to do business with, he told DL News that there was “nothing we can announce right now.”\n\nLiam Kelly is DL News’ Berlin correspondent. Contact him at liam@dlnews.com."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiX0FVX3lxTE9ER09QN1JrbnpYazBRWmdmS1pGalFxR1hUZFZEbGFTaTh2alZZLXd1VVREQS15anZ1Y2ROLWlhTmZXa1lSYlVkSGJUUHktdUlUTFl6d1NfczIzM1djLWpZ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Feb 2024 08:00:00 GMT",
        "title": "Gitcoin is restructuring to focus on grants for the Ethereum ecosystem - Blockworks",
        "content": "Gitcoin, an open-source software funding platform, has announced it will shift focus away from public goods funding and towards enhancing grants infrastructure designed for the Ethereum ecosystem.\n\nSince its launch in May 2021, Gitcoin’s organizational hierarchy has been relatively flat, with no CEO calling the shots. Workstreams, or focused groups dedicated to specific tasks or projects within the organization, have always required budgets to be approved through community voting — an often time consuming process.\n\nAs the DAO has evolved, however, it morphed from an impact-focused organization to something more technology-centric. Gitcoin executive director Kyle Weiss told Blockworks in an interview that this did not align well with the existing DAO structure.\n\n“It was too disjointed,” said Weiss. “In a DAO environment where everyone is fully remote, we have folks contributing from nearly every continent — stability, operations, and software development is really important, you need a core group of individuals who have context.”\n\nRead more: Gitcoin’s co-founder wants to return from the sidelines\n\nAs part of the new restructuring plan, two business units have formed within Gitcoin. One unit will focus on coordinating product-specific work, while a subDAO will manage matters of community and governance.\n\nWeiss noted that over the years, the company has experimented with various products. He said that some of these have been distractions, while others have been valuable to its growth.\n\n“A lot of 2024 is focusing on grants. We want Gitcoin to be much more associated with grants, whereas right now, our narrative has been around public goods funding, and that shift is because we’ve moved from being an impact organization to a technology organization,” Weiss said.\n\nFor this reason, Weiss explained the DAO will transition from independent workstreams towards a structure more akin to a “Labs” structure. This is something that is common among existing protocol development teams, similar to how Uniswap has Uniswap Labs or how Optimism operates with OP Labs.\n\n“We want to make sure there is stability in the software development side and then give the DAO material scopes of work to own,” he said.\n\nWeiss says that by granting software development teams greater leadership and more defined decision-making powers, the community can remain concentrated on achieving results through the grants programs via token voting.\n\n“I don’t know if the token holders are the right people to decide on multi-year roadmap decisions on the technology side,” Weiss said.\n\nGitcoin co-founder Kevin Owocki shared this sentiment.\n\n“It’s not proven that DAOs can develop software, so the Labs team is designed to recognize that in our organizational structure, and make sure that we’re building world-class software.”\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    }
]