[
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE03NERqTmVuaThtelZZVUw5bGxRb0RYVU5rZ1FsLTl4R0xmZ25KNXFKWnl3bE5McEMwalpOM0RObVlXNmpyVnFzaEdKVjhoTjk3S2JMUXZ3VXFnZzViUGtoQ2Y5QjVoMW5kSGJ0T193Vk01dlRqZ05Tam5Sb9IBgAFBVV95cUxOa2puU3JLNzlfdjhKTC0xN1VMNW9MQmk1NTI3ZzJISDRYM1BINHVpZ1hTZjEtNmdaczV3NUNtSUVaSWwtdUJaMDRMZnA3UXlXNVRlOEVRNkhEZURKZ3hvTDNDLXVjd3dwV3Jmc3FOMGRJZ0Vtc0JpN0Vua0lpUzNpSQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Feb 2024 08:00:00 GMT",
        "title": "Key Reason Why Ethereum Might Be Classified as Security - U.Today",
        "content": "Advertisement\n\nPrometheum plans to offer custodial services for Ether, aiming to comply with existing laws and potentially influence regulators to classify Ether as a security. This contrasts with the SEC's current stance on Ethereum.\n\nPrometheum's strategy could lead to the Securities and Exchange Commission (SEC) refining its stance on Ethereum, potentially giving Prometheum a competitive advantage in the marketplace, as reported by Fortune.\n\nA different approach\n\nPrometheum, a new player in the crypto industry, has taken a unique approach to regulation by obtaining approval to operate an alternative trading platform and as a special-purpose broker-dealer for digital asset securities.\n\nThis approach marks a departure from the perspectives of major cryptocurrency exchanges such as Coinbase and Kraken, which are advocating for amendments to the prevailing regulatory frameworks.\n\nAdvertisement\n\nPrometheum's plan to offer Ether custody services may force the SEC to decide on Ethereum's legal status. While controversial, the move showcases regulatory compliance. Hence, Prometheum's success could redefine industry regulations, providing much-needed clarity.\n\nGensler's ambiguous stance\n\nThe stance of SEC Chair Gary Gensler on this matter has been somewhat enigmatic. In a recent interview, Gensler hinted that Ethereum (ETH) might fall under the category of a security, which marks a shift from his earlier tentative positions on the subject.\n\nGensler stressed that most cryptocurrencies, excluding Bitcoin, are often developed by entrepreneurs who employ various mechanisms to market their tokens and attract investment, with the expectation of profits derived from the efforts of others.\n\nAccording to Gensler, this aligns with the characteristics of securities, thus placing them within the regulatory scope of the SEC. This perspective stands in contrast to the views of Commodity Futures Trading Commission (CFTC)."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxORE1xX2llQ1dKTUJXbUcxNjBtRjB2U3dlU242cFI4N2hLYV96OVc1d3RHVkNkTWhuNmxtMkZDcUxrVFIxNnpZRDExSFJCaVQtN25KQlB2WTk2aG9ITXFWSXZoQzY4dzV5RlhoeUM1Y2FsWm5STVN1Tklic3p4VHRqTmdBaGszRFgt?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Restaking App Approaches $4 Billion In Deposits: Biggest Airdrop In History Incoming? - Yahoo Finance",
        "content": "EigenLayer is a new liquid restaking platform for Ethereum. The protocol allows users to stake the same amount of Ether (ETH) across multiple projects simultaneously to earn additional rewards. Proponents of the technology say that it will increase capital efficiency and spur innovation. Those against the technology believe that it could cause overleveraging and is susceptible to slashing.\n\nThough the new technology is causing a debate among ETH enthusiasts, it is impossible to deny the project’s popularity. Initially, EigenLayer put a 200,000 ETH cap on each protocol so that it could test the concept without extreme amounts of volume. The limit was removed on Feb. 5. Within 24 hours, over 700,000 ETH, or over $1.6 billion was deposited into EigenLayer. According to data from DefiLlama, this brought EigenLayer's total volume locked (TVL) to nearly $4 billion, which is over 1% of all Ethereum in circulation. For comparison, EigenLayer had less than $300 million in TVL for most of December 2023.\n\nDon't Miss:\n\nWhile the limit on deposits has been temporarily removed, a new limit will be put in place on February 9th. While the exact limit is unknown, it will likely be close to the TVL on February 9th. However, the project has also stated that it hopes to eventually remove any deposit limits, though this will likely happen some time in the future, if it happens at all.\n\nOn February 5th, ETH appreciated more than 3.5%, causing its market cap to approach $300 billion. Despite the strong day, ETH was still down more than 1% over the previous 7 days.\n\nTo make the project even more enticing, EigenLayer has begun showing EigenLayer Points, which are a calculation consisting of the time spent restaking, volume restaked, etc. to formulate a numerical value. While there is no guarantee that this could lead to an airdrop, other staking platforms have used a similar system in the past to mete out tokens in the event of an airdrop. One example from recent memory was the Jito (JITO) airdrop on the Solana chain. This project also used a point system, which allowed users to be placed into tiers that gave different amounts of JITO on the day of the airdrop. Again, there is no guarantee that EigenLayer will use the points system for an airdrop, but it has been used in the past.\n\nTrending: This brokerage offers custom rewards for users to switch – the biggest reward so far for 1 user is $19,977.48. Will yours beat it?\n\nEigenLayer and restaking is certainly an interesting system, especially considering the potential for spot Ethereum ETFs and Ethereum chain upgrades potentially coming soon. As the protocol continues to grow and we start to see its use cases, we will gain a better understanding of where liquid restaking could potentially play a role in the future of blockchain.\n\nStory continues\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nGet the latest stock analysis from Benzinga?\n\nThis article Ethereum Restaking App Approaches $4 Billion In Deposits: Biggest Airdrop In History Incoming? originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxORE1xX2llQ1dKTUJXbUcxNjBtRjB2U3dlU242cFI4N2hLYV96OVc1d3RHVkNkTWhuNmxtMkZDcUxrVFIxNnpZRDExSFJCaVQtN25KQlB2WTk2aG9ITXFWSXZoQzY4dzV5RlhoeUM1Y2FsWm5STVN1Tklic3p4VHRqTmdBaGszRFgt?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Restaking App Approaches $4 Billion In Deposits: Biggest Airdrop In History Incoming? - Yahoo Finance",
        "content": "EigenLayer is a new liquid restaking platform for Ethereum. The protocol allows users to stake the same amount of Ether (ETH) across multiple projects simultaneously to earn additional rewards. Proponents of the technology say that it will increase capital efficiency and spur innovation. Those against the technology believe that it could cause overleveraging and is susceptible to slashing.\n\nThough the new technology is causing a debate among ETH enthusiasts, it is impossible to deny the project’s popularity. Initially, EigenLayer put a 200,000 ETH cap on each protocol so that it could test the concept without extreme amounts of volume. The limit was removed on Feb. 5. Within 24 hours, over 700,000 ETH, or over $1.6 billion was deposited into EigenLayer. According to data from DefiLlama, this brought EigenLayer's total volume locked (TVL) to nearly $4 billion, which is over 1% of all Ethereum in circulation. For comparison, EigenLayer had less than $300 million in TVL for most of December 2023.\n\nDon't Miss:\n\nWhile the limit on deposits has been temporarily removed, a new limit will be put in place on February 9th. While the exact limit is unknown, it will likely be close to the TVL on February 9th. However, the project has also stated that it hopes to eventually remove any deposit limits, though this will likely happen some time in the future, if it happens at all.\n\nOn February 5th, ETH appreciated more than 3.5%, causing its market cap to approach $300 billion. Despite the strong day, ETH was still down more than 1% over the previous 7 days.\n\nTo make the project even more enticing, EigenLayer has begun showing EigenLayer Points, which are a calculation consisting of the time spent restaking, volume restaked, etc. to formulate a numerical value. While there is no guarantee that this could lead to an airdrop, other staking platforms have used a similar system in the past to mete out tokens in the event of an airdrop. One example from recent memory was the Jito (JITO) airdrop on the Solana chain. This project also used a point system, which allowed users to be placed into tiers that gave different amounts of JITO on the day of the airdrop. Again, there is no guarantee that EigenLayer will use the points system for an airdrop, but it has been used in the past.\n\nTrending: This brokerage offers custom rewards for users to switch – the biggest reward so far for 1 user is $19,977.48. Will yours beat it?\n\nEigenLayer and restaking is certainly an interesting system, especially considering the potential for spot Ethereum ETFs and Ethereum chain upgrades potentially coming soon. As the protocol continues to grow and we start to see its use cases, we will gain a better understanding of where liquid restaking could potentially play a role in the future of blockchain.\n\nStory continues\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nGet the latest stock analysis from Benzinga?\n\nThis article Ethereum Restaking App Approaches $4 Billion In Deposits: Biggest Airdrop In History Incoming? originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiZkFVX3lxTFA4TVI1bXdxQUhaMlJ3cTlzVm1LNUtDQXdzeElvTUloRjlrLU1XLVBPeWpaNlpLa2RLNUg3V1F3VEhQUDV2c28zN0NyaVlaWmVXRVVVTlhYakRtNmloM01lSVp6NVlOUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Feb 2024 08:00:00 GMT",
        "title": "What is Ethereum fragmentation? - Crypto Briefing",
        "content": "Share this article\n\nEthereum’s evolution is marked by the adoption of Layer 2 scaling solutions (L2s), designed to alleviate the network’s congestion and high transaction fees.\n\nL2s operate on top of Ethereum (Layer 1 or L1), processing transactions more efficiently before finalizing them on the main chain. However, this has led to a new challenge: each L2 functions in its isolated environment, creating silos that hinder interoperability—a state we refer to as fragmentation.\n\nWhat is Universal Synchronous Composability (USC)?\n\nThe core issue with fragmentation is the loss of “universal synchronous composability” (USC), a feature allowing different applications to interact with each other seamlessly in real time. Imagine Ethereum as a bustling city where roads (L2s) connect buildings (applications).\n\nFragmentation is akin to having roads that don’t interconnect, forcing you to take a long detour to move from one building to another.\n\nThe proposed solution, “shared sequencing,” is like establishing a city-wide transit system that links all roads, enabling direct travel routes between any two points without detours.\n\nTo further simplify, consider shared sequencing as the internet of Ethereum. Just as the internet allows different computers to communicate directly regardless of their physical location, shared sequencing enables different L2s to interact seamlessly. This system removes barriers, allowing for immediate transactions across the network, akin to sending an email from one side of the world to the other in seconds.\n\nTechnical Explanation of Shared Sequencing\n\nShared sequencing coordinates the order of transactions across all L2 solutions on Ethereum. It uses a centralized mechanism to sequence transactions identically across different L2s without requiring major infrastructure changes.\n\nShared sequencing leverages Ethereum’s existing data availability capabilities. It proposes adding functionality for L2 solutions to sequence transactions in a unified manner. By sequencing transactions in the same order everywhere, shared sequencing enables instant interactions between L2s across Ethereum.\n\nPotential Use Cases for Shared Sequencing\n\nAdopting shared sequencing could revolutionize Ethereum. It would enhance liquidity and reduce transaction costs by enabling seamless communication between L2 solutions. This would eliminate the need for complex bridging between L2s.\n\nShared sequencing could enable more robust decentralized applications (dApps) and services that integrate across L2s. This would improve user experience and accessibility. By restoring composability across L2 solutions, shared sequencing would strengthen Ethereum’s network effects and dominance as a platform for blockchain applications.\n\nThe Road Ahead for Ethereum’s Ecosystem\n\nWhile Ethereum’s journey through fragmentation may resemble a challenging phase of growth, the horizon holds promise for a unified and efficient ecosystem. Shared sequencing represents a leap towards realizing this vision, offering a roadmap to re-establish Ethereum’s composability and network effects.\n\nAs we look to the future, continued innovation and collaboration within the Ethereum community will be pivotal in overcoming current limitations and unlocking the platform’s full potential. Through these efforts, Ethereum can evolve into a more interconnected and powerful platform, paving the way for the next generation of blockchain applications."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiZkFVX3lxTE9EVGtDbjZVN1JIY1dTQ1ZfZFBnYVkxSXdHMXlyc0FNWElwZmgySFBiR0gtbVZuVWhjelRXdHVDRTJTSHRtRHBSRlF2MzVzS2pud2NEcC15SGFNS2QyTUZrWW14VDhXUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Feb 2024 19:18:33 GMT",
        "title": "Ethereum’s Dencun is now live on the Holesky testnet - Blockworks",
        "content": "Ethereum’s Dencun upgrade, featuring “proto-danksharding,” has successfully run on the Holešky testnet.\n\nHolešky replaced Ethereum’s Goerli testnet, widely used to test validating and staking, in September last year, though it did not officially enter its “end of life” status until January this year.\n\nTestnets refer to a copy of the blockchain network which are used by developers to test smart contracts and protocols before they deploy on mainnet.\n\nRead more: Ethereum’s Holešky testnet launch hits a speed bump\n\nPrior to running on Holešky, the Dencun upgrade also ran on Ethereum’s Goerli testnet and Sepolia testnet.\n\nFollowing the successful fork of each of these different testing environments, Ethereum’s development team is now figuring out a time to run the Dencun upgrade on Ethereum mainnet.\n\nLoading Tweet..\n\nWhat’s so special about the Dencun upgrade?\n\nThe Dencun upgrade will enable proto-danksharding — introduced in Ethereum Improvement Proposal (EIP) 4844 — to the Ethereum blockchain.\n\nRead more: Ethereum Improvement Proposals to watch in 2024\n\nNikolay Angelov, head of blockchain at Nexo, told Blockworks that EIPs carry enormous, potentially institutional weight in the digital asset space.\n\n“Over the years, Ethereum has accommodated thousands of projects that utilize the network and its specific layers to create a diverse ecosystem of some of the most founding projects in the industry, [like] Tether,” Angelov said.\n\nHe notes that changes and enhancements to this foundational layer would require technological precision and synchronization across deployment.\n\n“In that sense, the testnets’ role is to mirror the mainnet’s functionalities by encouraging and committing to public testing of the deployment is a testament to the magnitude of Ethereum Upgrades,” he said.\n\nIn the case of EIP 4844, Ethereum will be introducing a new transaction type, which involves “blobs,” or sharded data, that can live on the beacon node for a short period of time.\n\nEthereum rollups today must put raw transaction data onto Ethereum using something called “calldata.”\n\nWith the introduction of EIP 4844, rollup block submitters will instead be able to put this data into blobs. This will guarantee data availability and will also be much more affordable than calldata.\n\nRead more: Ethereum devs consider ‘existential’ upgrade to the EVM\n\nData availability in blockchain refers to the process of storing data for a set period of time to ensure that all network participants will be able to access and retrieve it so that they can challenge whether or not the data is accurate.\n\nRollups only need this data to be available once and for a set period to give honest participants enough time to construct the rollup state and verify its accuracy.\n\n“While Ethereum has rightfully suffered from criticism over fees and processing times, the\n\nDencun concepts of proto-danksharding and “data blobs” have the mission to address and overcome those,” Angelov said.\n\nHe notes that should the upgrade on mainnet be successful, Ethereum will be able to manage data throughput and network costs much more efficiently, giving it a competitive advantage over other layer-1 solutions.\n\n“Ultimately, it is the ability to onboard new protocols into a much freer-flowing environment and move capital at lower costs that will ultimately enhance cryptocurrency adoption by delivering a more economically feasible, highly-scalable on-chain solution,” he said.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    }
]