[
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxPVnJ6dF9RWkNIQ1BrOWh4VDJFRkhOVl9HYU9vWTN4bDk2WFVzTXVoblVQOU5zQmIweWQ1RVhZbjRQdVVhMlpwTGwwZjAwTHpWb3k3YnFlUWVSVEFfYnY2NTlteGRvVHRaa1pIWXRuZkNxNXZmcEpCU19UQmFuM2NzeHNJajVnanExbzY4SlcwZEdpVDd5YmJ3ZVFiVm5sdG9Fc19jdk5R?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Apr 2024 07:00:00 GMT",
        "title": "Digital Graffiti Gums Up Ethereum’s Latest Update - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxPVnJ6dF9RWkNIQ1BrOWh4VDJFRkhOVl9HYU9vWTN4bDk2WFVzTXVoblVQOU5zQmIweWQ1RVhZbjRQdVVhMlpwTGwwZjAwTHpWb3k3YnFlUWVSVEFfYnY2NTlteGRvVHRaa1pIWXRuZkNxNXZmcEpCU19UQmFuM2NzeHNJajVnanExbzY4SlcwZEdpVDd5YmJ3ZVFiVm5sdG9Fc19jdk5R?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Apr 2024 07:00:00 GMT",
        "title": "Digital Graffiti Gums Up Ethereum’s Latest Update - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxQT2hEWGRFRGo4YTJ5RW45M3lnNzlaRTZ3LThtTHEyYTFWblctYS1Va3BKd3JFTjZJZ1NGYzNXZzFsUXlhdGlSZzZTVVJpRWZxY0J5WUJqT0YwaXNmVjJyOExmWWp6Q3E2SjVJUU5HRDdxd0dRWnhweWtzM0EwWHVfdmtiNzZoakt3RFA0OEM1RGFINmNQRXEzRjVUYkJVcDZKWEFnWU92dkRvdUlYVHJTVThadDdTb2I0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Apr 2024 07:00:00 GMT",
        "title": "Ripple Announces Stablecoin On XRP Ledger And Ethereum - Benzinga",
        "content": "Payment protocol Ripple XRP/USD on Thursday announced its entry into the stablecoin market with a U.S. dollar-pegged token.\n\nWhat Happened: Ripple’s stablecoin aims to set a new standard in the stablecoin ecosystem by ensuring a 1:1 peg to the U.S. dollar, underpinned by substantial U.S. dollar deposits, short-term U.S. government treasuries and other cash equivalents, according to a press release.\n\nThis move positions Ripple directly against industry leaders Tether USDT/USD and Circle USDC/USD, vying for a share of the rapidly growing $150 billion stablecoin market, projected to reach $2.8 trillion by 2028.\n\nThese reserves will undergo third-party audits, with Ripple committing to monthly attestations to uphold transparency and trust.\n\nBrad Garlinghouse, CEO of Ripple, described the launch as “a natural step for Ripple to continue bridging the gap between traditional finance and crypto.”\n\nThe introduction of the stablecoin is not only seen as a strategic move for Ripple but also as a potential boon for the XRP Ledger community, promising to enhance use cases, liquidity, and opportunities for both developers and users.\n\nAlso Read: Bitcoin Spot ETFs Notch $113M Net Inflows On Wednesday, Grayscale Outflows Continue\n\nAt its inception, the stablecoin will be accessible on the XRP Ledger and Ethereum ETH/USD blockchains, with Ripple outlining plans for future expansion across other blockchains and decentralized finance protocols.\n\nMonica Long, Ripple President, emphasized the pivotal role the stablecoin will play in unlocking new institutional and DeFi use cases, further driving adoption and fostering a dynamic ecosystem around the XRP Ledger.\n\nThis strategic move by Ripple comes at a time when the stablecoin market is projected to experience exponential growth, with forecasts suggesting it could exceed $2.8 trillion by 2028.\n\nRipple’s entry into this competitive landscape is anticipated to be a significant discussion point at Benzinga’s upcoming Future of Digital Assets conference on Nov. 19.\n\nRead Next: Is Shiba Inu About To Get Dethroned? The Rise Of PEPE Coin\n\nImage: Shutterstock"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxQT2hEWGRFRGo4YTJ5RW45M3lnNzlaRTZ3LThtTHEyYTFWblctYS1Va3BKd3JFTjZJZ1NGYzNXZzFsUXlhdGlSZzZTVVJpRWZxY0J5WUJqT0YwaXNmVjJyOExmWWp6Q3E2SjVJUU5HRDdxd0dRWnhweWtzM0EwWHVfdmtiNzZoakt3RFA0OEM1RGFINmNQRXEzRjVUYkJVcDZKWEFnWU92dkRvdUlYVHJTVThadDdTb2I0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Apr 2024 07:00:00 GMT",
        "title": "Ripple Announces Stablecoin On XRP Ledger And Ethereum - Benzinga",
        "content": "Payment protocol Ripple XRP/USD on Thursday announced its entry into the stablecoin market with a U.S. dollar-pegged token.\n\nWhat Happened: Ripple’s stablecoin aims to set a new standard in the stablecoin ecosystem by ensuring a 1:1 peg to the U.S. dollar, underpinned by substantial U.S. dollar deposits, short-term U.S. government treasuries and other cash equivalents, according to a press release.\n\nThis move positions Ripple directly against industry leaders Tether USDT/USD and Circle USDC/USD, vying for a share of the rapidly growing $150 billion stablecoin market, projected to reach $2.8 trillion by 2028.\n\nThese reserves will undergo third-party audits, with Ripple committing to monthly attestations to uphold transparency and trust.\n\nBrad Garlinghouse, CEO of Ripple, described the launch as “a natural step for Ripple to continue bridging the gap between traditional finance and crypto.”\n\nThe introduction of the stablecoin is not only seen as a strategic move for Ripple but also as a potential boon for the XRP Ledger community, promising to enhance use cases, liquidity, and opportunities for both developers and users.\n\nAlso Read: Bitcoin Spot ETFs Notch $113M Net Inflows On Wednesday, Grayscale Outflows Continue\n\nAt its inception, the stablecoin will be accessible on the XRP Ledger and Ethereum ETH/USD blockchains, with Ripple outlining plans for future expansion across other blockchains and decentralized finance protocols.\n\nMonica Long, Ripple President, emphasized the pivotal role the stablecoin will play in unlocking new institutional and DeFi use cases, further driving adoption and fostering a dynamic ecosystem around the XRP Ledger.\n\nThis strategic move by Ripple comes at a time when the stablecoin market is projected to experience exponential growth, with forecasts suggesting it could exceed $2.8 trillion by 2028.\n\nRipple’s entry into this competitive landscape is anticipated to be a significant discussion point at Benzinga’s upcoming Future of Digital Assets conference on Nov. 19.\n\nRead Next: Is Shiba Inu About To Get Dethroned? The Rise Of PEPE Coin\n\nImage: Shutterstock"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTFBPQjlnRWt5bnM3NHV3Y0FZSXkzX040b3JpZG4yMVZ2c1JaVkp6RnZRd09TVlZ5eThTdHNzaEJqZmNrVmgyLU1TcDRtbjRJTnFFUmcxN2hXLTRfdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Apr 2024 07:00:00 GMT",
        "title": "What Is Blast on Ethereum? A Beginner’s Guide - Unchained",
        "content": "Blast is a new Ethereum layer 2 that introduces the concept of native yield for ETH and stablecoins.\n\nBlast is a new Ethereum layer 2 network that has made waves after introducing the concept of native yield. Unlike other layer 2 solutions, Blast users can earn yield paid in crypto simply by having certain tokens in their wallets.\n\nRead on to learn about Blast, how it works, and what it is bringing to Ethereum.\n\nWhat Is Blast on Ethereum?\n\nBlast is an EVM-compatible Ethereum layer 2 platform that offers native yield for ether and stablecoins. It operates as an optimistic rollup solution to tackle scalability issues on Ethereum by increasing the network’s capacity for more transactions at lower costs.\n\nBlast’s testnet went live in January 2024, and its mainnet launched in February. The platform, founded by Tieshun Pacman Roquerre (the creator of NFT marketplace Blur), has surpassed $1 billion in total value locked at the time of writing.\n\nThe project is different from other Ethereum layer 2 solutions as it offers native yields for both ETH and stablecoins.\n\nHow Does Blast Work?\n\nBlast yield income for decentralized finance (DeFi) users comes from the concept of Ethereum staking. Ethereum staking is a process on the Ethereum network whereby users can temporarily lock tokens to validate transactions.\n\nTraditionally, managing staking requires individual attention from users. However, Blast simplifies this process by handling staking on behalf of its users within its ecosystem, making it an L2 platform with native yield.\n\nWhen assets are bridged to the Ethereum mainchain within Blast’s network, they are automatically staked, initiating the interest-earning process. Blast’s smart contracts facilitate the collection of this interest, which is automatically redistributed to users in the form of ether (ETH) and stablecoins.\n\nHow Does Blast Offer Yield?\n\nBlast offers a 4% interest rate for ETH and a 5% interest rate for stablecoins like USDT, USDC, and DAI deposited on the network. These interest rates are compounded, meaning they apply to the balance over time rather than the initial deposit.\n\nThe native yield feature is powered by rebasing tokens and is based on the Risk-free Interest Rate (RFR) yield structure.\n\nThe 4% yield on Ethereum is sourced through liquid staking on the Ethereum network. After the merge, the proof-of-stake (PoS) on the Ethereum network offers a 4% APR on staked ETH. Blast utilizes this feature through partnerships with platforms like Lido, leveraging staked user assets for yield generation.\n\nSimilarly, stablecoins bridged to Blast are routed to T-bill protocols, such as MakerDAO, where they generate yields. Blast channels them to MakerDAO’s T-bill protocol, and users receive USDB on Blast. USDB accumulates stablecoin profits over time at a 5% APR, and users can redeem the asset for USDC when they bridge back from Blast.\n\nWhat Does Blast Bring to the Ethereum Ecosystem?\n\nBlast’s main aim is to enhance transaction efficiency on the Ethereum network. The layer 2 solution operates on Ethereum but doesn’t rely on the full processing power of the main chain. The move ensures that transactions remain reliable and decentralized while enhancing scalability.\n\nThe L2 also tackles asset depreciation by providing users with a “risk-free” interest rate, regardless of the coin’s value. By providing both ETH and T-Bill yields, Blast ensures users receive benefits similar to those on the mainchain but adds optimistic rollup services and other layer 2 network scaling solutions.\n\nCompared to Ethereum’s core network, which can only process roughly 15 transactions per second, Blast can process thousands of transactions per second by grouping them together. Thus, transactions can be confirmed more quickly, resulting in a more responsive and seamless user experience.\n\nThe Blast Airdrop\n\nTo participate in the airdrop, users need to obtain an invitation link from their peers through a referral. Users can then register on the airdrop page to claim their sign-up reward. Registered participants can unlock additional rewards by bridging assets to the platform or inviting other users.\n\nNotably, airdrop points are granted based on the value of assets bridged and the number of users successfully referred.\n\nWhile the bridge to Blast is operational, participants in the airdrop campaign can only redeem their accumulated airdrop points beginning May 2024. Part of the airdrop is designated for Season 3 of Blur participants.\n\nFurthermore, part of the airdrop is set aside for developers, particularly winners of the Big Bang contest and mainnet dApps. Developers can reallocate their airdrop points to users, thus enhancing liquidity and expanding the user base.\n\nChallenges and Controversies Associated With Blast\n\nThe crypto community has raised some questions regarding the project’s operations and the validity of its promises.\n\nBlast’s holding contract for deposited assets is safeguarded by a multi-signature mechanism involving five participants. At least three of these participants must consent to approve any withdrawal request. However, the identities of these five participants remain undisclosed, as the project founder operates under a Twitter pseudonym. Furthermore, the criterion for signature approval remains unclear.\n\nFurthermore, questions have been raised regarding the rebase structure and the native yield arrangement. While Blast developers and project partners have strongly supported the project, comments on the rebase token design suggest differing opinions on its feasibility and efficiency.\n\nThe network’s security has also recently become an issue. Munchables, a GameFi platform operating on Blast, disclosed recently that it experienced a security breach resulting in a loss of $62 million. Additionally, an associated vault on Juice Finance avoided a $25 million loss due to a typographical error.\n\nHowever, unlike other hacks, the hacker lacked leverage due to Blast’s multiple centralized components, which eliminated any chance for the attacker to attempt to launder the stolen funds. Eventually, the attacker relinquished control of the private keys.\n\nConclusion\n\nBlast has gained traction, achieving a total value lock (TVL) exceeding $1 billion. The network aims to transform the crypto and gaming industries by providing a layer 2 solution with native yield.\n\nHowever, the project is still in its early stages and has much to prove, including liquidity efficiency and native yield arrangement over time."
    }
]