[
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxOYmVJSlVSYnhFcTJJS2hILU5qWUdqaFUtVU5KU1BQUUViS2IybDhITUtKMlZQcjhoaVA2RlBGbW11Z19lTDg5bXVGZGpQNkl6WXBhVlV3Q2RvU3M0NEp6a2Q4TWVyQ3UxOXE4X0tYWnBJa0RCUmtMZlR0Mk9CNHdXdHpTZTNXUUtZYWROTzdKSUlxa212SWNUX0hxUkxyeUlNXzVzcnh1ZmVyQ1Bzbkow?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Jun 2024 07:00:00 GMT",
        "title": "Consensys CEO Joseph Lubin Says SEC Closes Ethereum Inquiry - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxOYmVJSlVSYnhFcTJJS2hILU5qWUdqaFUtVU5KU1BQUUViS2IybDhITUtKMlZQcjhoaVA2RlBGbW11Z19lTDg5bXVGZGpQNkl6WXBhVlV3Q2RvU3M0NEp6a2Q4TWVyQ3UxOXE4X0tYWnBJa0RCUmtMZlR0Mk9CNHdXdHpTZTNXUUtZYWROTzdKSUlxa212SWNUX0hxUkxyeUlNXzVzcnh1ZmVyQ1Bzbkow?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Jun 2024 07:00:00 GMT",
        "title": "Consensys CEO Joseph Lubin Says SEC Closes Ethereum Inquiry - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxNcndpVm5nVVZ4Wm9ESENadUVtZHlfZmhLN1JteHE5YjRfM01SdnVVR0ttNVNVUEtLMlpXSWhzTDB3NlpMaXdOcU50aWhBdXRXSzczdEFvUnVQbFdGclFFR1V3SzRPWTN0eW81V1JCUnJ6Q21LTnR2enpsMGZVOE4wazNlMUdYcEdJdU9xZzJlY3k4MkE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Jun 2024 07:00:00 GMT",
        "title": "Consensys: SEC Closes Investigation Into Ethereum - Yahoo Finance",
        "content": "Consensys: SEC Closes Investigation Into Ethereum\n\nLeading Ethereum developer Consensys revealed late Tuesday that the U.S. Securities and Exchange Commission (SEC) has decided to close its investigation into Ethereum 2.0. This announcement marks a pivotal moment for Ethereum developers and the broader crypto industry.\n\nThe decision follows the SEC's approval of Ethereum spot ETFs last month. Consensys had responded to this approval by sending a letter to the SEC, pointing out that the funds were based on ETH being classified as a commodity. The letter sought clarification on how this classification would impact the ongoing investigation.\n\nLaura Brookover, an attorney for Consensys, took to Twitter to share the SEC's notification letter along with the company's full statement. \"Things have changed remarkably fast since we filed our lawsuit against the SEC in late April, culminating in today’s development,\" Brookover wrote. \"After more than a year, the Ethereum investigation is finally over with no charges against anyone.\"\n\nDespite the positive news, the SEC's correspondence included a standard disclaimer, noting that the conclusion of the investigation should not be interpreted as an exoneration or a guarantee that no future action would be taken.\n\nWhile the closing of the Ethereum investigation is a significant victory, Consensys remains critical of the SEC's overall approach to crypto regulation. \"The closing of the Ethereum investigation is momentous, but it’s not a cure-all for the many blockchain developers, technology providers, and industry participants who have suffered under the SEC’s unlawful and aggressive crypto enforcement regime.\""
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxNcndpVm5nVVZ4Wm9ESENadUVtZHlfZmhLN1JteHE5YjRfM01SdnVVR0ttNVNVUEtLMlpXSWhzTDB3NlpMaXdOcU50aWhBdXRXSzczdEFvUnVQbFdGclFFR1V3SzRPWTN0eW81V1JCUnJ6Q21LTnR2enpsMGZVOE4wazNlMUdYcEdJdU9xZzJlY3k4MkE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Jun 2024 07:00:00 GMT",
        "title": "Consensys: SEC Closes Investigation Into Ethereum - Yahoo Finance",
        "content": "Consensys: SEC Closes Investigation Into Ethereum\n\nLeading Ethereum developer Consensys revealed late Tuesday that the U.S. Securities and Exchange Commission (SEC) has decided to close its investigation into Ethereum 2.0. This announcement marks a pivotal moment for Ethereum developers and the broader crypto industry.\n\nThe decision follows the SEC's approval of Ethereum spot ETFs last month. Consensys had responded to this approval by sending a letter to the SEC, pointing out that the funds were based on ETH being classified as a commodity. The letter sought clarification on how this classification would impact the ongoing investigation.\n\nLaura Brookover, an attorney for Consensys, took to Twitter to share the SEC's notification letter along with the company's full statement. \"Things have changed remarkably fast since we filed our lawsuit against the SEC in late April, culminating in today’s development,\" Brookover wrote. \"After more than a year, the Ethereum investigation is finally over with no charges against anyone.\"\n\nDespite the positive news, the SEC's correspondence included a standard disclaimer, noting that the conclusion of the investigation should not be interpreted as an exoneration or a guarantee that no future action would be taken.\n\nWhile the closing of the Ethereum investigation is a significant victory, Consensys remains critical of the SEC's overall approach to crypto regulation. \"The closing of the Ethereum investigation is momentous, but it’s not a cure-all for the many blockchain developers, technology providers, and industry participants who have suffered under the SEC’s unlawful and aggressive crypto enforcement regime.\""
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxNQ1YxNldJTURIdFhuTnNoUlZsckZuYWtQNkhyRWdZZ3N4a2NMZ1hCYS1CWU1lakJVeE9Ia3p6cEw3bFhEQU9JaExkcl9TcTRBVkJoLW9ma2J2T29ocVprRm1sZ0ZpRDF1V19jZi1tTVgydG55Vk5uM1dtdVRvTW44enlkb01vVzBNb0NB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Jun 2024 07:00:00 GMT",
        "title": "Investing Smart: Ethereum’s ETF Progress, Bitcoin’s Decline, and Furrever Token’s Rewards - Yahoo Finance",
        "content": "Furrever Token\n\nNew York City, NY , June 19, 2024 (GLOBE NEWSWIRE) --\n\nAs the cryptocurrency market evolves, investors are constantly seeking smart investment opportunities. The latest developments show Ethereum making significant strides with its ETF progress, while Bitcoin experiences a decline in dominance. Amid these changes, Furrever Token presents a unique and rewarding investment option.\n\nEthereum’s ETF Progress\n\nEthereum has been gaining traction with its exchange-traded funds (ETFs), surpassing Bitcoin in terms of performance and investor interest. The approval and launch of Ethereum ETFs have sparked optimism among investors, positioning ETH as a strong contender in the crypto market. This progress reflects the growing confidence in Ethereum’s long-term potential and its robust decentralized finance (DeFi) ecosystem.\n\nBitcoin’s Decline\n\nBitcoin, the pioneer of cryptocurrencies, has seen its dominance drop to 56%. This decline suggests that investors are diversifying their portfolios and exploring other promising assets. While Bitcoin remains a significant player, its reduced market share highlights the expanding landscape of digital assets and the potential for altcoins to gain prominence.\n\n\n\n\n\nFurrever Token: A Smart Investment Choice\n\nIn the midst of these market dynamics, Furrever Token (FURR) offers a unique and engaging investment opportunity. Designed around cute cat-themed imagery, Furrever Token aims to create a fun and community-driven ecosystem. Here’s why investing in Furrever Token during this period is a smart move:\n\nInnovative Referral System\n\nFurrever Token’s referral system allows users to earn 10% in FURR tokens for every deposit made through their personal referral links. This system incentivizes community growth and provides a source of passive income. By sharing referral links with friends, family, and social networks, users can actively contribute to the project’s expansion while reaping financial rewards.\n\nAttractive Tokenomics\n\nFurrever Token’s tokenomics are designed to ensure security and trust within the community. With a total supply of 9 billion tokens, 65% are allocated for the presale, 25% for decentralized exchanges (DEXs), and 10% for the team, locked for one year. The presale has already raised over $1.3 million, currently in its 9th stage, with the potential for up to 15X returns for early investors. The current price of Furrever Token is $0.000732, presenting an attractive entry point for those looking to invest in a project with both financial and emotional rewards.\n\nCommunity Engagement and Future Growth\n\nFurrever Token places a strong emphasis on community engagement. The project’s mission is to create a fun, user-friendly environment where investors can enjoy their experience while contributing to the growth of the ecosystem. Regular challenges, exclusive cat-themed content, and active community interaction make Furrever Token an appealing choice for both seasoned investors and newcomers.\n\nStory continues\n\nConclusion\n\nAs Ethereum’s ETF progress and Bitcoin’s decline reshape the cryptocurrency market, Furrever Token offers a refreshing and rewarding alternative. Its unique referral system, attractive tokenomics, and strong community focus make it a smart investment choice during this period of market transformation.\n\nInvesting in Furrever Token not only provides potential financial returns but also an enjoyable experience within a vibrant and supportive community. Don’t miss out on the chance to be part of this exciting project—visit furrevertoken.com to join the presale and create your referral link today.\n\n\n\nJoin Furrever Token Presale Now:\n\nFurrever Token Official Website\n\nVisit Furrever Token Presale\n\nJoin Official Telegram Group\n\nFollow Official X Account\n\n\n\nMedia Contact:\n\nRobert Smith\n\nhttps://furrevertoken.com/\n\nsupport (at) furrevertoken.com\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\n\n\n\n\nCONTACT: Robert Smith support (at) furrevertoken.com\n\n\n\n"
    }
]