[
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxQUlFZc2NvellZZm1odG4wb1Fkbi1OaXR5dHpYa1M3cVdrTWpxLXJaZzh1NzF0OUZFQnhnZWhqT2NGcjVDOFYtdUlpN2kySHdkTFBNcjVmUE5WN19WX1F2UkZmVkNLcXJNS0ZHb2hEUXlEcjg5Q0t3Snp5Y3MzNW9KckpTb2dZRWtvRkRfNUIzYUJiaDBSU0HSAZsBQVVfeXFMTUp0TkNEMzdQVGc5VUdhMDBkeDhzMENPT2NxX3dnTjFCZVVFQ1NXTDRYaVZaTUp1YzlEY1NPTG5RMnllbjVvQm1WVFFIbWplaWlJX0lPTGM5cm90c0lEa1o1ZkI5NXp1UHFsWV9GblBLUFpBMVRrVDhqajhXdDUwNFF2OEZNWjF6U25YYmRDTnZTQnltOFQ0TC1rZzQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jul 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Withdrawals on Exchanges Skyrocket on Spot ETF Mania, Data Says - U.Today",
        "content": "Advertisement\n\nBased on Glassnode's data, cryptocurrency analyst Leon Waidmann of BTC-ECHO platform indicates massive accumulation interest of Ethereum (ETH) investors. Owners of ETH bags are moving them out of exchanges, which typically is a strong bullish indicator.\n\n$126,000,000 in week: Ethereum (ETH) investors drained exchange reserves\n\nEthereum (ETH) investors are withdrawing their riches from exchanges at an increased pace. As the multi-month trend gained traction, centralized crypto platforms lost $126 million in equivalent in just seven days. The report was shared by Leon Waidmann, a seasoned cryptocurrency analyst, with his X followers.\n\nThis trend started in March 2024, but it gained steam only in Q3, 2024. The local \"top\" of exchanges reserves amount was registered after Ethereum (ETH) set its three-year high above $4,000.\n\nAccelerated withdrawals from exchanges typically are being interpreted as an indicator of investors confidence. As such, amid the new phase of spot ETF hype, Waidmann is enthusiastic about what is next for the ETH price:\n\nAdvertisement\n\nNext big $ETH rally incoming!\n\nEthereum (ETH), the second largest cryptocurrency, is changing hands at $3,500 as of press time. In the last 24 hours, its price gained 1%.\n\nEthereum's (ETH) trading volume lost 15% and declined to $13.3 billion.\n\nSpot Ether ETF launch date finally confirmed\n\nAs covered by U.Today previously, on July 20, the U.S. Chicago Board Options Exchange (CBOE) confirmed the launch of spot ETH ETF in the United States at July 23, 2024.\n\nEthereum ETFs from Fidelity, Invesco Galaxy, Franklin Templeton, VanEck and 21Shares will be available in the first cohort of exchange-traded products based on spot Ether.\n\nWhile this event is typically expected to be a major bullish catalyst for the Ethereum (ETH) price, some experts are cautious about its role.\n\nTop U.S. bank JP Morgan foresees lower interest in ETFs on Ether compared to this of Bitcoin ETFs in January 2024."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxNZ3V3cEtBUHlyRmM2MjJPUi1NR3hCTHBrcl85TXhJZG1EZVNkNGtWOWlyM0d3aV96Tk9aSjd4c0ZHWDBHZTJvUktyc1JZeG94dDQxcmVYWDNYNWFUQU1rTVNqblVsem5RT0FwcHZ4N2ZEUzNtbFlaUmdTd3JhdU13Y2tkNGctT2x6TXJKT1pqT3M0S2UzYVJTZW9qa2lYcG90MzdEQ3UwRkdXeGdreGfSAbYBQVVfeXFMUEJjdkE1TFFGNV9mNmVidDNQX0x6ZDJvTEhzWUtsNHBHNl93eHdrdHhIM3FOUmMyMUZVcFNJa0lrQ1EwREhiQ0lqLW9vSWxyQm5tb1hrYl94ZjhPcDdPRmlaSm80RWIzdmRpU01OOGoyRl8yMGFLN3NhSGVzX2w2bThoZDktVE5yTzBwRWwycGVTZ1VEVV80VWdGclZBNkpDZzM4cURjdmZZSFFIeVBFYUM5M2VYX3c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Mixer Tornado Cash Has Received Almost $2 Billion in 2024 Despite Sanctions - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIn the first six months of 2024, more than $1.9 billion has been deposited onto Ethereum mixer Tornado Cash (TORN). Although things have slowed down in July—the protocol has seemingly attracted only $65.1 million worth of deposits, according to data provided by crypto analytics service Flipside.\n\nGiven Tornado Cash’s nature as a mixer, the total value locked (TVL) metric used for judging an ecosystem’s activity level is not as reliable. Total value locked refers the the value of assets that have been deposited into a decentralized application. That's why TVL isn't typically used to measure activity on Tornado Cash. The expected use case is to deposit funds and then withdraw anonymized funds—rather than keep them in the protocol for a long time like with most decentralized finance services.\n\nStill, DeFiLlama data for Tornado Cash’s TVL shows sizeable growth, with the protocol starting the year at under 160,000 ETH and currently standing at nearly 168,600 ETH. In U.S. dollars, this is a growth from $374.4 million to the current value of $572.82 million — when taking asset value growth into account.\n\nAD\n\nAD\n\nWhat is Tornado Cash?\n\nTornado Cash is a coin mixer that was created to preserve the privacy of crypto users. Using zero-knowledge proof cryptography, the protocol anonymizes user deposits and allows their withdrawal to a new address that cannot be traced to the old one.\n\nThe Ethereum mixer has seen inflows from wallets associated with major hacks, including the hacker behind the Poloniex hack sending $3.3 million worth of Ethereum (ETH) to the mixer back in early May. Due to transactions linked to hacks—including some allegedly linked to North Korea—the U.S. Treasury Department sanctioned Tornado Cash in early August 2022.\n\nThis was then followed by the lengthy legal prosecution against Tornado Cash developers which was seen as a major overreach by much of the crypto community. This prosecution is still ongoing, with a last week ruling delaying the money laundering trial of Tornado Cash co-founder Roman Storm, over the objections of the prosecution.\n\nCoinbase's chief legal officer Paul Grewal said in April that the U.S. Treasury is \"bending old laws past their breaking point\" by placing blame for Tornado Cash’s misuse on developers and TORN holders.\n\nImmutable, open-source software code isn’t property, which creates a real issue for Treasury, as it’s authorized to regulate only 'property' in which a foreign national has an interest, he said at the time.\n\nAD\n\nAD\n\nEthereum co-founder Vitalik Buterin said in late May that Tornado Cash developer Alexey Pertsev being sentenced to 64-months in prison was “really unfortunate,” and continued to back privacy-centric crypto tools, encouraging people to develop “next-gen” solutions.\n\n\"I think a lot of people have been going under the assumption [...] that just building software is something that’s okay,\" he said during a fireside chat at DappCon in Berlin, \"and is a totally legal and legit way to fight for privacy.\"\n\nEdited by Stacy Elliott."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxPLTVTd3VKN3UyMXoxYXpMNUdrWkJXRUQyNHNPX1g0N09IeEJNQmQwNGRNZDNybmIydFA5VXhTOE01bWEyQ3hxTF9zeGdNT3NXdUVReGtkU2JWZVc2V1pPaHlORndSOG5JT1N1dEpBN0FmZXJjMU5OcUdJenNxaS1ZMmhYaUVYblBHRXdpbG5lUlJGMDJ1LV80M21FWjlmVmF6cXRZRV8za2FjZWpObWZoOE9yM1dVWFNNTEZHSHVOU1ViSnh2akZJWDlNT0ZkZnBSQk9HeVZR0gHbAUFVX3lxTE9tM0FJX21tV1hpeGNCenA4dVF6X0NkQTMzYzZzQU5rZ2E2LWttOEZvVGl2MXphSlFHdlJvSll0SmJDazN3QzAzR3lLWHlVV1EwX2V1bnVGMDdHLXJTbl9lemdJRlBwa3hPaDFmcTVoUHBPMDNvck56OFN3NENUSnRETWRjZnRzcDF5RmdIb0dOT05UZUhJbXhVcF9BTDAtNXk4NEdSZ3VGNjlVYnNXZXFIakgwX0tMYVdlTVVHcnJYTkZKeVc4VmU3QkZoOTY2ZkR2VWc4YnpIdUtQMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jul 2024 07:00:00 GMT",
        "title": "First Bitcoin and now ETH ETFs: Where is the market headed next? - The Economic Times",
        "content": "\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nETH ETF products are expected to start trading this summer, fueling ongoing market optimism. Institutional market data provider Kaiko has released a report, projecting that Ethereum will outpace Bitcoin following the launch of spot Ether ETFs. The current conversation centers on whether Ethereum can reach $5,000 by the end of 2024.This year, spot crypto ETFs have dominated market spaces, attracting billions from investors. The approval of spot Bitcoin ETFs on January 11 sparked renewed market optimism, paving the way for Ethereum. The success of Bitcoin products has increased investor interest in Ethereum, driving crypto prices to new highs.Just as the current web is the result of countless contributions from a diverse range of programmers, Ethereum is the product of the innovative efforts of thousands of individuals, each bringing unique ideas to the table. These pioneers are working tirelessly on various facets of blockchain technology, decentralized applications, smart contracts , and more. Their collective ingenuity and dedication are what drive Ethereum's continuous evolution, making it a powerful, decentralized platform that is reshaping industries and paving the way for the future of digital finance and beyond.Traditional investors are increasingly drawn to Ethereum because of the smart contract functionality and the numerous decentralized applications (dApps) in its ecosystem. The Ethereum ecosystem hosts over 4,000 dApps and millions of smart contracts. With the growing adoption and utility of Layer 2 solutions within the Ethereum ecosystem, these figures are expected to increase significantly over the next few years.According to the latest data, the total value locked (TVL) in Ethereum Layer 2 networks has surged to an all-time high of $47 billion, marking a tenfold increase since March this year. This milestone underscores the growing importance of Layer 2 solutions within the Ethereum ecosystem. Arbitrum One leads with a TVL of nearly $19 billion, followed by OP Mainnet and Base, each exceeding $6 billion. Other networks, including Blast, Mantle, Linea, and Starknet, also boast TVLs surpassing $1 billion.The introduction of ETFs is pivotal as they attract institutional investors who bring substantial capital and a long-term investment outlook, thereby contributing to market stability. This influx is expected to significantly accelerate the growth of the asset class.The Bitcoin ETFs have already set a positive narrative in the market, with over $50 billion invested in 10 newly launched Bitcoin ETFs within five months of their introduction.Institutions already invested in Bitcoin ETFs are likely to diversify into these newly approved Ethereum ETFs. If Ethereum ETFs experience similar success, substantial institutional investments combined with bullish speculative trading could drive ETH prices to new all-time highs.According to media sources, VanEck, a global fund manager, expressed optimism regarding the future potential of Ethereum Layer 2 networks. The firm forecasts that these networks could achieve a valuation exceeding $1 trillion by the year 2030.Moreover, Ethereum’s upcoming Pectra upgrade, scheduled for Q1 2025, is anticipated to be a significant milestone for the network. This upgrade will further help Ethereum maintain its leadership in dApps and smart contracts, advancing the broader blockchain industry.Building on the success of the Dencun upgrade, Pectra aims to enhance Ethereum's efficiency and functionality through various Ethereum Improvement Proposals (EIPs), notably EIP-3074. This proposal introduces features such as grouped transactions, allowing users to sign into a transaction only once regardless of its complexity, thereby improving transaction management and wallet usability. Furthermore, Pectra aims to streamline network operations, reduce transaction costs, and simplify complexities. A notable aspect of EIP-3074 is its \"social recovery\" feature, enabling users to recover access to their crypto wallets without relying on seed phrases.Ethereum has been on a strong bullish trajectory, currently trading around $4,000. Its current momentum suggests it is well-positioned to sustain and potentially continue its upward rally.With the introduction of Bitcoin and ETH ETFs, the floodgates have opened for more crypto exchange-traded products, including the potential for a Solana-based ETF. This surge in Crypto ETFs marks a shift in perception, transitioning crypto from being perceived solely as a speculative asset to becoming a foundational element of investment portfolios.The increased involvement of financial institutions adds further credibility to crypto assets.This broader acceptance is expected to drive mainstream adoption and reflects a maturing regulatory environment, which in turn contributes to legitimizing the entire digital asset space.(The author Sumit Gupta is Co-founder, CoinDCX. Views are own): Recommendations, suggestions, views, and opinions given by experts are their own. These do not represent the views of the Economic Times)"
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPcUxlcWNveTI2OFJmbDdObEJVbUY2MFRKeEZXSE9pNVBxb1hoU1I4WXR0X2ltc3RYeU9kTldKaFNZbm9UMFlSOTdMSjRoLWxGN3hzWmtfS0FpNUJ1eFNNd1gxMFF0anVKM19wNGV5Z3RxWmtTbFBZaWo3MnU4bTZkS0ZCY241VE5R?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jul 2024 07:00:00 GMT",
        "title": "What is cryptocurrency? What to know about this increasingly popular digital currency before investing - Business Insider",
        "content": "Paid non-client promotion: Affiliate links for the products on this page are from partners that compensate us (see our advertiser disclosure with our list of partners for more details). However, our opinions are our own. See how we rate investing products to write unbiased product reviews.\n\nCryptocurrencies are digital assets that are created and run on a blockchain.\n\nBitcoin and ether are two popular cryptocurrencies, but there are many others.\n\nInvesting in cryptocurrency can be extremely risky, and the underlying technology is very new.\n\nInvestors need to understand how cryptocurrencies work, who creates and controls them, and why you might want to buy cryptocurrencies.\n\nWhile there may be opportunities to build wealth, there are a lot of risks involved with crypto investing, and you need to be mindful of scams.\n\nWhat is cryptocurrency?\n\nCryptocurrency is a decentralized digital currency that investors can buy and sell along the blockchain. Unlike banknotes or minted coins with a tangible physical form, cryptocurrencies can only be accessed using computers and other electronic devices.\n\nA decentralized currency is not issued by a government or financial institution. In fact, no single person, company, or government controls a cryptocurrency's blockchain. Instead, it's run by a decentralized network of computers worldwide. Anyone with advanced technology skills and coding experience can create a cryptocurrency.\n\nThe lack of a central authority can also make cryptocurrencies more secure. \"It's hack-proof because there's no one central point of failure,\" explains David Donovan, executive vice president at Publicis Sapient.\n\nHow do cryptocurrencies work?\n\nWhile there are thousands of cryptocurrencies, many with unique traits, they all work similarly. It's hard to avoid jargon when discussing cryptos, but the concepts can be relatively easy to understand.\n\nBlockchain technology\n\nA cryptocurrency's blockchain is a digital record of all crypto transactions. Copies of the blockchain are stored and maintained by computers around the world. They're often compared to general ledgers, part of traditional double-entry bookkeeping systems where each transaction leads to debit and credit in different sections of the books.\n\n\"It works like a general ledger — it's that simple,\" says Donovan. Perhaps you start with two coins and send one to someone. \"On the blockchain, it would say I'm sending you one coin, and I now have one coin, and you have one coin.\"\n\nEach grouping of transactions is turned into a block and chained to the existing ledger. Once a block is added, it can't be reversed or altered — which is why people describe blockchains as \"immutable.\"\n\nSome cryptos have their own blockchain. For example, there are Bitcoin and Ethereum blockchains. However, some cryptos are built on top of an existing blockchain rather than starting from zero.\n\nEther is the cryptocurrency native to the Ethereum blockchain, but is also available for trading on other exchanges like Coinbase, Binance.US, Ninjatrader and Robinhood.\n\nPublic transactions under pseudonymous\n\nCryptocurrencies have another defining feature. The blockchains are public ledgers, which means anyone can see and review the transactions that occurred. However, they can also provide a degree of anonymity.\n\n\"You have a private key, which is how you initiate transactions, and a public key, which is how someone identifies you in the market,\" says Donovan.\n\nA blockchain's transactions are tied to a crypto wallet's public key, but nobody necessarily knows who controls that wallet. This is why cryptos are often described as pseudonymous — the public key is a person's pseudonym.\n\nComing to consensus\n\nCryptocurrencies commonly use one of two mechanisms to create a system of trust and determine which transactions are valid and added to their blockchain:\n\n\n\n\n\nProof of work . This relies on people around the world, known as miners, competing to be the first to solve complex cryptographic puzzles and add the next block to the blockchain. The winners are paid after the other network members confirm that the required amount of computing power was used to find the solution. \"The way you ensure all the participants are validating the transactions is the hard work, effort, and money they're spending solving the problem,\" says Donna Parisi, global head of financial services and FinTech at Shearman & Sterling. However, proof-of-work systems require a lot of energy to power.\n\n. This relies on people around the world, known as miners, competing to be the first to solve complex cryptographic puzzles and add the next block to the blockchain. The winners are paid after the other network members confirm that the required amount of computing power was used to find the solution. \"The way you ensure all the participants are validating the transactions is the hard work, effort, and money they're spending solving the problem,\" says Donna Parisi, global head of financial services and FinTech at Shearman & Sterling. However, proof-of-work systems require a lot of energy to power. Proof of stake. This is a newer and less energy-intensive mechanism. \"Proof of stake is they validate transactions on the blockchain by people putting value on the line,\" explains Parisi. \"They stake some of the currency they own to make sure they only validate true transactions.\"\n\nTypes of cryptocurrencies\n\nAccording to CoinMarketCap, there were more than 25,149 different cryptocurrencies with a global market value of about $1.16 trillion as of May 30, 2023. Some of the most popular cryptocurrencies include:\n\nBitcoin\n\nDogecoin\n\nEther\n\nLitecoin\n\nTether\n\nBinance coin\n\nDai\n\nTRON\n\nCronos\n\nUSD coin\n\nBitcoin cash\n\nBitcoin, the first cryptocurrency, was launched in 2009 as an alternative type of decentralized and digital money. Since then, people have also created cryptocurrencies that serve other functions or are designed for specific types of transactions. All non-Bitcoin cryptocurrencies are often referred to as altcoins.\n\n\"Cryptocurrencies can have many different uses,\" says Parisi. \"Some are used in gaming environments to earn rewards in a game, while others facilitate payments. Some are designed for cross-border remittances … some are designed for micro payments.\"\n\nFor example, stablecoins are a type of cryptocurrency that try to maintain a steady and fixed exchange rate with another asset, such as the US dollar. Governance tokens are another example of a specialized cryptocurrency. They give token holders voting power in a corresponding crypto project.\n\nInsider's Featured Crypto Apps Public Investing\n\nWealthfront Investing Chevron icon It indicates an expandable section or menu, or sometimes previous / next navigation options. Chevron icon It indicates an expandable section or menu, or sometimes previous / next navigation options. Editor's Rating 4.35/5 A five pointed star A five pointed star A five pointed star A five pointed star A five pointed star Editor's Rating 4.34/5 A five pointed star A five pointed star A five pointed star A five pointed star A five pointed star Start investing On Public's website Start investing On Wealthfront's website\n\nWhat is digital currency?\n\nDigital currency is a type of currency that can only be accessed in an electronic form, such as through a computer or mobile phone. This money has no physical equivalent, unlike tangible forms of currency like banknotes or minted coins. But just like physical money, digital currencies can be used to purchase goods and services.\n\nHowever, you'll be limited to online platforms and communities, such as investing platforms, gaming sites, and gambling portals. Some of the most popular forms of digital currency include cryptocurrencies, central bank digital currencies (CBDC), and stablecoins.\n\n\"There's a strive toward decentralization,\" says Nisa Amoils, a managing partner at A100xx Ventures. \"Digital currencies like cryptocurrencies continue to be a worthwhile investment for many investors.\"\n\nDigital currencies come in two forms:\n\nCentralized currency: Currencies issued by governments or financial institutions as part of the commercial banking system that are available to the general public.\n\nCurrencies issued by governments or financial institutions as part of the commercial banking system that are available to the general public. Decentralized currency: Currencies not issued by governments or financial institutions. Instead, decentralized currencies operate through peer-to-peer financial networks to eliminate the middleman (aka banks) and allow lending, trading, and borrowing directly with merchants.\n\nDigital currencies like crypto are often appealing to investors who are wary of government-issued funds and are that are seeking alternatives.\n\n\"Some people who had been excluded from the traditional financial system, or have had their currencies devalued, are seeking an opportunity to participate in the markets, and this is a retail-driven phenomenon first,\" says Amoils. \"There's this crisis of trust, and people want wealth creation for themselves. And so that spurred this whole kind of trading speculative movement.\"\n\nHow to invest in cryptocurrency\n\nYou can start investing in cryptocurrencies through existing crypto exchanges and investing platforms. Some of the best cryptocurrency exchanges (such as Kraken and Coinbase) offer assets like staking rewards, goal-planning features, low fees, and more.\n\nSome of the best investment apps that offer cryptocurrencies (such as Robinhood Investing) include a range of investment types, low fees, market access, and more.\n\nIf you want to get more advanced and start trading, note that you can strategies such as shorting crypto that are popular with day traders who don't buy and hold for the long term.\n\nYou can create your own crypto\n\nAnyone with coding skills and/or advanced technical knowledge can create their own cryptocurrencies — although this is not always an easy feat and isn't recommended for beginners. The three ways to create crypto are:\n\nBuilding a new blockchain: The most advanced way to create crypto, but offers the most flexibility of nodes, architecture, tokenomics, and more.\n\nThe most advanced way to create crypto, but offers the most flexibility of nodes, architecture, tokenomics, and more. Modifying a blockchain: If you can't create your own blockchain, you can modify an existing blockchain's open-source code to your liking. Still, this method requires expansive technical knowledge.\n\nIf you can't create your own blockchain, you can modify an existing blockchain's open-source code to your liking. Still, this method requires expansive technical knowledge. Building upon a blockchain: The simplest way to make your own coins or tokens is by expanding upon an already existing blockchain. But keep in mind that the success of your cryptocurrency will be reliant on the success of the original blockchain. Some blockchains that allow this are Binance and Ethereum.\n\nAre cryptocurrencies secure?\n\nThe blockchain technology behind cryptocurrencies can help ensure that the coins and systems remain secure. \"What's never been refuted is the value of blockchain,\" says Donovan. \"The way the ledger system is set up and every transaction is recorded. And the fact that it's immutable.\"\n\nHowever, that doesn't mean you don't need to worry about security. The crypto world is rife with scams. Of course, that's also true of traditional financial systems and currencies. Someone asking you to pay with a gift card or wire transfer is a red flag that you're dealing with a scammer. But several factors could make crypto scams especially worrisome.\n\nFor example, cryptocurrency transactions can't be reversed. There's also less regulation of cryptocurrencies and platforms than of traditional financial services in the US. Plus, some people may feel pressure to act quickly and send or invest their money because they're worried about missing out on an opportunity.\n\n\"One way to avoid a scam is to invest in more well-established cryptocurrencies,\" says Parisi. \"You still may be subject to scams or fraud in terms of how you hold it, send it, or receive it.\" But you can have some certainty that the cryptocurrency itself isn't a scam.\n\nAre cryptocurrencies a good investment?\n\nCryptocurrencies may present a good investment opportunity, and there are many ways to invest in the crypto world.\n\nYou could buy a coin (or coins) and hold onto them, hoping they'll increase in value. Or you could use your coins in a decentralized finance (DeFi) platform to earn interest through staking or lending. You also might take a more traditional route, such as an exchange-traded fund (ETF) that is tied to cryptocurrencies. There could even be opportunities to invest in projects or supporting industries rather than in the cryptocurrencies themselves.\n\n\"From an investment perspective, crypto is rapidly evolving,\" says Parisi. \"You shouldn't put an amount of assets you're not willing to lose. It should be, relatively speaking, a small portion of your portfolio.\"\n\nBefore making any investment, consider the potential pros and cons:\n\nPros Cons Easy to invest\n\nDiversify your portfolio\n\nThere is a lot of opportunity\n\nFaster and cost-effective transactions\n\nDecentralized currency\n\nSecurity and transparency through the blockchain Cryptocurrencies can be very volatile\n\nSome crypto projects may fail\n\nThe investment may be a scam\n\nEnvironmental impact due to excessive power consumption through ASIC computers\n\nLacking refund and cancellation policies\n\nShould you invest in crypto?\n\nWhile cryptocurrency investing is a hotly debated topic, it's worth understanding what's going on so you can make an informed decision. If you decide to get started, you could fully jump in or just dip your toe.\n\n\"Learn about crypto by opening up wallets, accounts, trading currencies, and learning more about the use cases,\" says Parisi. \"But do it in a reasonable way. We're still in the early days, and regulation of crypto is still evolving.\"\n\nDonovan suggests opening an account with a regulated and publicly traded company like Coinbase. But, he says, \"It's really about being smart and using the system to take baby steps.\"\n\nCrypto FAQs\n\nWhat is Bitcoin? Chevron icon It indicates an expandable section or menu, or sometimes previous / next navigation options. Bitcoin is a cryptocurrency, an electronic version of money that verifies transactions using cryptography (the science of encoding and decoding information). As Bitcoin educator, developer, and entrepreneur Jimmy Song says, Bitcoin is \"decentralized, digital, and scarce money.\" Bitcoin is decentralized because this code is run by thousands of computers (i.e., 'nodes') spread across the globe, digital because it exists as a set of code that determines how it operates, and scarce because its code caps its overall volume to 21 million bitcoins.\n\nWhat is Ethereum? Chevron icon It indicates an expandable section or menu, or sometimes previous / next navigation options. Ethereum is an open-source, decentralized computing platform network. The Ethereum network works like the Bitcoin network in that it's built on blockchain technology, essentially a digital public ledger where financial agreements can be verified and stored entirely by software — without the intervention of a third party.\n\nWhat are privacy coins? Chevron icon It indicates an expandable section or menu, or sometimes previous / next navigation options. Privacy coins are cryptocurrencies that obscure transactions on their blockchain to maintain the anonymity of users and their activity. Participants in a transaction will know the amount transacted and the parties involved. However, the same information will be unobtainable to any outside observer.\n\nWhat is a crypto wallet? Chevron icon It indicates an expandable section or menu, or sometimes previous / next navigation options. A crypto wallet is a software program or physical device that allows you to store your crypto and allow for the sending and receiving of crypto transactions. A crypto wallet consists of two key pairs: private keys and public keys. A public key is derived from the private key and serves as the address used to send crypto to the wallet.\n\nWhat is hash rate? Chevron icon It indicates an expandable section or menu, or sometimes previous / next navigation options. Hash rate is a measure of the total computational power being used by a proof-of-work cryptocurrency network to process transactions in a blockchain. It can also be a measure of how fast a cryptocurrency miner's machines complete these computations.\n\nWhat is yield farming? Chevron icon It indicates an expandable section or menu, or sometimes previous / next navigation options. Yield farming is a means of earning interest on your cryptocurrency, similar to how you'd earn interest on any money in your savings account. And similarly to depositing money in a bank, yield farming involves locking up your cryptocurrency, called \"staking,\" for a period of time in exchange for interest or other rewards, such as more cryptocurrency.\n\nWhat is crypto staking? Chevron icon It indicates an expandable section or menu, or sometimes previous / next navigation options. Crypto staking is similar to depositing money in a bank, in that an investor locks up their assets, and in exchange, earns rewards, or \"interest.\" \"Staking is a term used to refer to the delegating of a certain number of tokens to the governance model of the blockchain and thus locking them out of circulation for a specified length of time,\" says Nicole DeCicco, the owner and founder of CryptoConsultz, a cryptocurrency consultancy in the Portland, Oregon area.\n\nLouis DeNicola Louis DeNicola is the president of LD Money Media LLC and an experienced writer who specializes in consumer credit, personal finance, and small-business finance. He is a Nav-certified credit and lending specialist, a multi-year attendee of an 18-hour advanced credit education seminar, and a volunteer tax preparer through the IRS's VITA program. Louis works with various publishers, credit bureaus, Fortune 500 financial services firms, and FinTech startups. In addition to Insider, you can find his work on Experian, FICO, Credit Karma, FICO, and Lending Tree. You can connect with Louis on LinkedIn or reach out to him directly at ladenicola@gmail.com Read more Read less Tessa Campbell Investing and Retirement Reporter Tessa Campbell is an investing and retirement reporter on Business Insider’s personal finance desk. Over two years of personal finance reporting, Tessa has built expertise on a range of financial topics, from the best credit cards to the best retirement savings accounts. Experience Tessa currently reports on all things investing — deep-diving into complex financial topics, shedding light on lesser-known investment avenues, and uncovering ways readers can work the system to their advantage. As a personal finance expert in her 20s, Tessa is acutely aware of the impacts time and uncertainty have on your investment decisions. While she curates Business Insider’s guide on the best investment apps, she believes that your financial portfolio does not have to be perfect, it just has to exist. A small investment is better than nothing, and the mistakes you make along the way are a necessary part of the learning process. Expertise: Tessa’s expertise includes: Credit cards\n\nInvesting apps\n\nRetirement savings\n\nCryptocurrency\n\nThe stock market\n\nRetail investing Education: Tessa graduated from Susquehanna University with a creative writing degree and a psychology minor. When she’s not digging into a financial topic, you’ll find Tessa waist-deep in her second cup of coffee. She currently drinks Kitty Town coffee, which blends her love of coffee with her love for her two cats: Keekee and Dumpling. It was a targeted advertisement, and it worked. ExperienceExpertise:Education: Read more Read less"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPcUxlcWNveTI2OFJmbDdObEJVbUY2MFRKeEZXSE9pNVBxb1hoU1I4WXR0X2ltc3RYeU9kTldKaFNZbm9UMFlSOTdMSjRoLWxGN3hzWmtfS0FpNUJ1eFNNd1gxMFF0anVKM19wNGV5Z3RxWmtTbFBZaWo3MnU4bTZkS0ZCY241VE5R?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jul 2024 07:00:00 GMT",
        "title": "What is cryptocurrency? What to know about this increasingly popular digital currency before investing - Business Insider",
        "content": "Paid non-client promotion: Affiliate links for the products on this page are from partners that compensate us (see our advertiser disclosure with our list of partners for more details). However, our opinions are our own. See how we rate investing products to write unbiased product reviews.\n\nCryptocurrencies are digital assets that are created and run on a blockchain.\n\nBitcoin and ether are two popular cryptocurrencies, but there are many others.\n\nInvesting in cryptocurrency can be extremely risky, and the underlying technology is very new.\n\nInvestors need to understand how cryptocurrencies work, who creates and controls them, and why you might want to buy cryptocurrencies.\n\nWhile there may be opportunities to build wealth, there are a lot of risks involved with crypto investing, and you need to be mindful of scams.\n\nWhat is cryptocurrency?\n\nCryptocurrency is a decentralized digital currency that investors can buy and sell along the blockchain. Unlike banknotes or minted coins with a tangible physical form, cryptocurrencies can only be accessed using computers and other electronic devices.\n\nA decentralized currency is not issued by a government or financial institution. In fact, no single person, company, or government controls a cryptocurrency's blockchain. Instead, it's run by a decentralized network of computers worldwide. Anyone with advanced technology skills and coding experience can create a cryptocurrency.\n\nThe lack of a central authority can also make cryptocurrencies more secure. \"It's hack-proof because there's no one central point of failure,\" explains David Donovan, executive vice president at Publicis Sapient.\n\nHow do cryptocurrencies work?\n\nWhile there are thousands of cryptocurrencies, many with unique traits, they all work similarly. It's hard to avoid jargon when discussing cryptos, but the concepts can be relatively easy to understand.\n\nBlockchain technology\n\nA cryptocurrency's blockchain is a digital record of all crypto transactions. Copies of the blockchain are stored and maintained by computers around the world. They're often compared to general ledgers, part of traditional double-entry bookkeeping systems where each transaction leads to debit and credit in different sections of the books.\n\n\"It works like a general ledger — it's that simple,\" says Donovan. Perhaps you start with two coins and send one to someone. \"On the blockchain, it would say I'm sending you one coin, and I now have one coin, and you have one coin.\"\n\nEach grouping of transactions is turned into a block and chained to the existing ledger. Once a block is added, it can't be reversed or altered — which is why people describe blockchains as \"immutable.\"\n\nSome cryptos have their own blockchain. For example, there are Bitcoin and Ethereum blockchains. However, some cryptos are built on top of an existing blockchain rather than starting from zero.\n\nEther is the cryptocurrency native to the Ethereum blockchain, but is also available for trading on other exchanges like Coinbase, Binance.US, Ninjatrader and Robinhood.\n\nPublic transactions under pseudonymous\n\nCryptocurrencies have another defining feature. The blockchains are public ledgers, which means anyone can see and review the transactions that occurred. However, they can also provide a degree of anonymity.\n\n\"You have a private key, which is how you initiate transactions, and a public key, which is how someone identifies you in the market,\" says Donovan.\n\nA blockchain's transactions are tied to a crypto wallet's public key, but nobody necessarily knows who controls that wallet. This is why cryptos are often described as pseudonymous — the public key is a person's pseudonym.\n\nComing to consensus\n\nCryptocurrencies commonly use one of two mechanisms to create a system of trust and determine which transactions are valid and added to their blockchain:\n\n\n\n\n\nProof of work . This relies on people around the world, known as miners, competing to be the first to solve complex cryptographic puzzles and add the next block to the blockchain. The winners are paid after the other network members confirm that the required amount of computing power was used to find the solution. \"The way you ensure all the participants are validating the transactions is the hard work, effort, and money they're spending solving the problem,\" says Donna Parisi, global head of financial services and FinTech at Shearman & Sterling. However, proof-of-work systems require a lot of energy to power.\n\n. This relies on people around the world, known as miners, competing to be the first to solve complex cryptographic puzzles and add the next block to the blockchain. The winners are paid after the other network members confirm that the required amount of computing power was used to find the solution. \"The way you ensure all the participants are validating the transactions is the hard work, effort, and money they're spending solving the problem,\" says Donna Parisi, global head of financial services and FinTech at Shearman & Sterling. However, proof-of-work systems require a lot of energy to power. Proof of stake. This is a newer and less energy-intensive mechanism. \"Proof of stake is they validate transactions on the blockchain by people putting value on the line,\" explains Parisi. \"They stake some of the currency they own to make sure they only validate true transactions.\"\n\nTypes of cryptocurrencies\n\nAccording to CoinMarketCap, there were more than 25,149 different cryptocurrencies with a global market value of about $1.16 trillion as of May 30, 2023. Some of the most popular cryptocurrencies include:\n\nBitcoin\n\nDogecoin\n\nEther\n\nLitecoin\n\nTether\n\nBinance coin\n\nDai\n\nTRON\n\nCronos\n\nUSD coin\n\nBitcoin cash\n\nBitcoin, the first cryptocurrency, was launched in 2009 as an alternative type of decentralized and digital money. Since then, people have also created cryptocurrencies that serve other functions or are designed for specific types of transactions. All non-Bitcoin cryptocurrencies are often referred to as altcoins.\n\n\"Cryptocurrencies can have many different uses,\" says Parisi. \"Some are used in gaming environments to earn rewards in a game, while others facilitate payments. Some are designed for cross-border remittances … some are designed for micro payments.\"\n\nFor example, stablecoins are a type of cryptocurrency that try to maintain a steady and fixed exchange rate with another asset, such as the US dollar. Governance tokens are another example of a specialized cryptocurrency. They give token holders voting power in a corresponding crypto project.\n\nInsider's Featured Crypto Apps Public Investing\n\nWealthfront Investing Chevron icon It indicates an expandable section or menu, or sometimes previous / next navigation options. Chevron icon It indicates an expandable section or menu, or sometimes previous / next navigation options. Editor's Rating 4.35/5 A five pointed star A five pointed star A five pointed star A five pointed star A five pointed star Editor's Rating 4.34/5 A five pointed star A five pointed star A five pointed star A five pointed star A five pointed star Start investing On Public's website Start investing On Wealthfront's website\n\nWhat is digital currency?\n\nDigital currency is a type of currency that can only be accessed in an electronic form, such as through a computer or mobile phone. This money has no physical equivalent, unlike tangible forms of currency like banknotes or minted coins. But just like physical money, digital currencies can be used to purchase goods and services.\n\nHowever, you'll be limited to online platforms and communities, such as investing platforms, gaming sites, and gambling portals. Some of the most popular forms of digital currency include cryptocurrencies, central bank digital currencies (CBDC), and stablecoins.\n\n\"There's a strive toward decentralization,\" says Nisa Amoils, a managing partner at A100xx Ventures. \"Digital currencies like cryptocurrencies continue to be a worthwhile investment for many investors.\"\n\nDigital currencies come in two forms:\n\nCentralized currency: Currencies issued by governments or financial institutions as part of the commercial banking system that are available to the general public.\n\nCurrencies issued by governments or financial institutions as part of the commercial banking system that are available to the general public. Decentralized currency: Currencies not issued by governments or financial institutions. Instead, decentralized currencies operate through peer-to-peer financial networks to eliminate the middleman (aka banks) and allow lending, trading, and borrowing directly with merchants.\n\nDigital currencies like crypto are often appealing to investors who are wary of government-issued funds and are that are seeking alternatives.\n\n\"Some people who had been excluded from the traditional financial system, or have had their currencies devalued, are seeking an opportunity to participate in the markets, and this is a retail-driven phenomenon first,\" says Amoils. \"There's this crisis of trust, and people want wealth creation for themselves. And so that spurred this whole kind of trading speculative movement.\"\n\nHow to invest in cryptocurrency\n\nYou can start investing in cryptocurrencies through existing crypto exchanges and investing platforms. Some of the best cryptocurrency exchanges (such as Kraken and Coinbase) offer assets like staking rewards, goal-planning features, low fees, and more.\n\nSome of the best investment apps that offer cryptocurrencies (such as Robinhood Investing) include a range of investment types, low fees, market access, and more.\n\nIf you want to get more advanced and start trading, note that you can strategies such as shorting crypto that are popular with day traders who don't buy and hold for the long term.\n\nYou can create your own crypto\n\nAnyone with coding skills and/or advanced technical knowledge can create their own cryptocurrencies — although this is not always an easy feat and isn't recommended for beginners. The three ways to create crypto are:\n\nBuilding a new blockchain: The most advanced way to create crypto, but offers the most flexibility of nodes, architecture, tokenomics, and more.\n\nThe most advanced way to create crypto, but offers the most flexibility of nodes, architecture, tokenomics, and more. Modifying a blockchain: If you can't create your own blockchain, you can modify an existing blockchain's open-source code to your liking. Still, this method requires expansive technical knowledge.\n\nIf you can't create your own blockchain, you can modify an existing blockchain's open-source code to your liking. Still, this method requires expansive technical knowledge. Building upon a blockchain: The simplest way to make your own coins or tokens is by expanding upon an already existing blockchain. But keep in mind that the success of your cryptocurrency will be reliant on the success of the original blockchain. Some blockchains that allow this are Binance and Ethereum.\n\nAre cryptocurrencies secure?\n\nThe blockchain technology behind cryptocurrencies can help ensure that the coins and systems remain secure. \"What's never been refuted is the value of blockchain,\" says Donovan. \"The way the ledger system is set up and every transaction is recorded. And the fact that it's immutable.\"\n\nHowever, that doesn't mean you don't need to worry about security. The crypto world is rife with scams. Of course, that's also true of traditional financial systems and currencies. Someone asking you to pay with a gift card or wire transfer is a red flag that you're dealing with a scammer. But several factors could make crypto scams especially worrisome.\n\nFor example, cryptocurrency transactions can't be reversed. There's also less regulation of cryptocurrencies and platforms than of traditional financial services in the US. Plus, some people may feel pressure to act quickly and send or invest their money because they're worried about missing out on an opportunity.\n\n\"One way to avoid a scam is to invest in more well-established cryptocurrencies,\" says Parisi. \"You still may be subject to scams or fraud in terms of how you hold it, send it, or receive it.\" But you can have some certainty that the cryptocurrency itself isn't a scam.\n\nAre cryptocurrencies a good investment?\n\nCryptocurrencies may present a good investment opportunity, and there are many ways to invest in the crypto world.\n\nYou could buy a coin (or coins) and hold onto them, hoping they'll increase in value. Or you could use your coins in a decentralized finance (DeFi) platform to earn interest through staking or lending. You also might take a more traditional route, such as an exchange-traded fund (ETF) that is tied to cryptocurrencies. There could even be opportunities to invest in projects or supporting industries rather than in the cryptocurrencies themselves.\n\n\"From an investment perspective, crypto is rapidly evolving,\" says Parisi. \"You shouldn't put an amount of assets you're not willing to lose. It should be, relatively speaking, a small portion of your portfolio.\"\n\nBefore making any investment, consider the potential pros and cons:\n\nPros Cons Easy to invest\n\nDiversify your portfolio\n\nThere is a lot of opportunity\n\nFaster and cost-effective transactions\n\nDecentralized currency\n\nSecurity and transparency through the blockchain Cryptocurrencies can be very volatile\n\nSome crypto projects may fail\n\nThe investment may be a scam\n\nEnvironmental impact due to excessive power consumption through ASIC computers\n\nLacking refund and cancellation policies\n\nShould you invest in crypto?\n\nWhile cryptocurrency investing is a hotly debated topic, it's worth understanding what's going on so you can make an informed decision. If you decide to get started, you could fully jump in or just dip your toe.\n\n\"Learn about crypto by opening up wallets, accounts, trading currencies, and learning more about the use cases,\" says Parisi. \"But do it in a reasonable way. We're still in the early days, and regulation of crypto is still evolving.\"\n\nDonovan suggests opening an account with a regulated and publicly traded company like Coinbase. But, he says, \"It's really about being smart and using the system to take baby steps.\"\n\nCrypto FAQs\n\nWhat is Bitcoin? Chevron icon It indicates an expandable section or menu, or sometimes previous / next navigation options. Bitcoin is a cryptocurrency, an electronic version of money that verifies transactions using cryptography (the science of encoding and decoding information). As Bitcoin educator, developer, and entrepreneur Jimmy Song says, Bitcoin is \"decentralized, digital, and scarce money.\" Bitcoin is decentralized because this code is run by thousands of computers (i.e., 'nodes') spread across the globe, digital because it exists as a set of code that determines how it operates, and scarce because its code caps its overall volume to 21 million bitcoins.\n\nWhat is Ethereum? Chevron icon It indicates an expandable section or menu, or sometimes previous / next navigation options. Ethereum is an open-source, decentralized computing platform network. The Ethereum network works like the Bitcoin network in that it's built on blockchain technology, essentially a digital public ledger where financial agreements can be verified and stored entirely by software — without the intervention of a third party.\n\nWhat are privacy coins? Chevron icon It indicates an expandable section or menu, or sometimes previous / next navigation options. Privacy coins are cryptocurrencies that obscure transactions on their blockchain to maintain the anonymity of users and their activity. Participants in a transaction will know the amount transacted and the parties involved. However, the same information will be unobtainable to any outside observer.\n\nWhat is a crypto wallet? Chevron icon It indicates an expandable section or menu, or sometimes previous / next navigation options. A crypto wallet is a software program or physical device that allows you to store your crypto and allow for the sending and receiving of crypto transactions. A crypto wallet consists of two key pairs: private keys and public keys. A public key is derived from the private key and serves as the address used to send crypto to the wallet.\n\nWhat is hash rate? Chevron icon It indicates an expandable section or menu, or sometimes previous / next navigation options. Hash rate is a measure of the total computational power being used by a proof-of-work cryptocurrency network to process transactions in a blockchain. It can also be a measure of how fast a cryptocurrency miner's machines complete these computations.\n\nWhat is yield farming? Chevron icon It indicates an expandable section or menu, or sometimes previous / next navigation options. Yield farming is a means of earning interest on your cryptocurrency, similar to how you'd earn interest on any money in your savings account. And similarly to depositing money in a bank, yield farming involves locking up your cryptocurrency, called \"staking,\" for a period of time in exchange for interest or other rewards, such as more cryptocurrency.\n\nWhat is crypto staking? Chevron icon It indicates an expandable section or menu, or sometimes previous / next navigation options. Crypto staking is similar to depositing money in a bank, in that an investor locks up their assets, and in exchange, earns rewards, or \"interest.\" \"Staking is a term used to refer to the delegating of a certain number of tokens to the governance model of the blockchain and thus locking them out of circulation for a specified length of time,\" says Nicole DeCicco, the owner and founder of CryptoConsultz, a cryptocurrency consultancy in the Portland, Oregon area.\n\nLouis DeNicola Louis DeNicola is the president of LD Money Media LLC and an experienced writer who specializes in consumer credit, personal finance, and small-business finance. He is a Nav-certified credit and lending specialist, a multi-year attendee of an 18-hour advanced credit education seminar, and a volunteer tax preparer through the IRS's VITA program. Louis works with various publishers, credit bureaus, Fortune 500 financial services firms, and FinTech startups. In addition to Insider, you can find his work on Experian, FICO, Credit Karma, FICO, and Lending Tree. You can connect with Louis on LinkedIn or reach out to him directly at ladenicola@gmail.com Read more Read less Tessa Campbell Investing and Retirement Reporter Tessa Campbell is an investing and retirement reporter on Business Insider’s personal finance desk. Over two years of personal finance reporting, Tessa has built expertise on a range of financial topics, from the best credit cards to the best retirement savings accounts. Experience Tessa currently reports on all things investing — deep-diving into complex financial topics, shedding light on lesser-known investment avenues, and uncovering ways readers can work the system to their advantage. As a personal finance expert in her 20s, Tessa is acutely aware of the impacts time and uncertainty have on your investment decisions. While she curates Business Insider’s guide on the best investment apps, she believes that your financial portfolio does not have to be perfect, it just has to exist. A small investment is better than nothing, and the mistakes you make along the way are a necessary part of the learning process. Expertise: Tessa’s expertise includes: Credit cards\n\nInvesting apps\n\nRetirement savings\n\nCryptocurrency\n\nThe stock market\n\nRetail investing Education: Tessa graduated from Susquehanna University with a creative writing degree and a psychology minor. When she’s not digging into a financial topic, you’ll find Tessa waist-deep in her second cup of coffee. She currently drinks Kitty Town coffee, which blends her love of coffee with her love for her two cats: Keekee and Dumpling. It was a targeted advertisement, and it worked. ExperienceExpertise:Education: Read more Read less"
    }
]