[
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxOaTUwVjBhcEdZR0x6UEo0dlppWjhfNEpiMXdzWkhvZWdPRFVKd3lTcjV2N2xOOFM0ZzVLbHZmcGdpdmdpYm1Gb0NNQmszMkRWeXM2YjU1U1FyZnZnVGlrWlBHRmdoVmdPMkczZk1sOHlydlVzLV9rZ1loVVJYamxCalRqUTh5UTVPTnZyVEE2a050UdIBlwFBVV95cUxQeUhOUm9VQ0daeUNBUTRfSUE4ZzNRUG5hLUtjTHpHaVNpV0JEb2d5ZGg3UkFoaENUeFpRaFk5ZzIyX0lHMi03WU8wcjlvOFNjTjRFUlBqQ05NRTllclNveXZ2YTloVXhkNUNwcUtNel9UdEFOaUZTYUp6VkdlR1poYmNFN3RRVEMzYTVlZ2NGNkFDc3I1aXV3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Apr 2024 07:00:00 GMT",
        "title": "Vitalik Buterin Reveals Technology That Will Help Ethereum's Main Network - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nVitalik Buterin recently discussed a technology that could significantly enhance Ethereum's main network. This technology involves switching Ethereum's current system to \"Verkle trees,\" making the network more \"zk-friendly\" — in other words, more compatible with zero-knowledge proofs, which are methods of proving knowledge of some information without revealing that information itself.\n\nAdvertisement\n\nButerin points out the current limitations with \"keccak Merkle Patricia trees,\" part of Ethereum's underlying structure. The main issue is the enormous \"witness sizes\" — the amount of data needed to prove a transaction — which can be up to 300 MB. Such sizes are impractical for processes that need to be lean and efficient, like zero-knowledge proofs.\n\n\"Verkle trees,\" on the other hand, are designed with zero-knowledge proofs in mind. They use a different type of cryptographic technique and are based on a specific kind of mathematical curve that is better suited for this purpose. The switch to Verkle trees would assist the application of zero-knowledge proofs to Ethereum's Layer 1.\n\nAdvertisement\n\nAdvancements in the aforementioned technology by Polygon's zkEVM Type 1 were acknowledged. The network processes proofs quickly with the requisite computational power. The Ethereum community leans toward adopting Verkle trees rather than adjusting the existing system as suggested in proposals like EIP-3102.\n\nEnhancements that improve efficiency and scalability typically have a positive impact on the value of digital assets. However, implementing Verkle trees could lead to faster transactions and lower costs, which may attract more users and developers to the Ethereum network. This increased activity and demand could, in turn, push the price of Ethereum upward."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiZ0FVX3lxTFA5QXVJTkFibEJFTldWZ3E1bHpBc0VyUTdHOEtyMW5naTZuejZkQWZrRDFCdG5CUDNzUnZid2ZYcVREQTU2WjdvejBWZW0wY1ZVNnJsa1EyUi1fZE9sOTU3Y3F5ejh3MzQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Apr 2024 07:00:00 GMT",
        "title": "Bitcoin and Ethereum spot ETFs may hit Hong Kong markets as early as Monday: Bloomberg - Crypto Briefing",
        "content": "Mainland China's investors may soon channel billions into Hong Kong's crypto ETFs.\n\nShare this article\n\nMajor Chinese asset managers are on the brink of launching spot Bitcoin and Ethereum exchange-traded funds (ETFs) in Hong Kong, possibly as early as Monday, Bloomberg reported on Friday, citing anonymous sources familiar with the matter. The timeline, however, remains tentative, sources noted.\n\nHarvest Fund Management Co.’s international division and a joint venture between Bosera Asset Management (International) Co. and HashKey Capital are the two potential ETF issuers, Bloomberg’s sources said.\n\nAs noted, the two entities plan to roll out their ETFs by the end of the month, pending approval from the Securities and Futures Commission (SFC) and finalizing listing arrangements with Hong Kong Exchanges & Clearing Ltd.\n\nThe report follows news earlier this week that prominent Chinese asset managers have applied for spot Bitcoin ETFs through their Hong Kong subsidiaries. According to Bloomberg, on April 9, SFC granted Harvest and China Asset Management clearance to provide virtual-asset-related fund management services.\n\nHong Kong Bitcoin ETFs poised to attract $25 billion\n\nThe potential approval of Hong Kong-listed spot Bitcoin ETFs could unlock up to $25 billion in demand from mainland China as qualified Chinese investors may be allowed to access the funds through the Southbound Stock Connect program, said Matrixport in a Friday report.\n\n“A likely approval of Hong Kong-listed Bitcoin Spot ETFs could attract several billion dollars of capital as mainland investors take advantage of the Southbound Stock Connect program, which facilitates up to 500 billion RMB (HK$540 billion and $70 billion) per year in transactions,” said Matrixport. “Based on the (potential) available capacity, this might result in up to 200 billion Hong Kong dollars of available capacity for those HK Bitcoin ETFs—or US$25 billion.”\n\nThe Southbound Stock Connect program sets a yearly limit of HK$540 billion for Chinese investment in Hong Kong-listed stocks. However, 360MarketIQ’s data shows the quota hasn’t been fully used in the past three years, leaving around HK$100-200 billion annually unused capacity.\n\nMatrixport suggested that this unused quota could be directed towards the Bitcoin ETF if approved.\n\nAfter the debut of US spot Bitcoin ETFs, global investors have seen Hong Kong as the next hub for crypto ETFs due to the country’s regulatory environment.\n\nIn late December last year, the SFC and the Hong Kong Monetary Authority (HKMA) issued new rules addressing the possibility of investment funds, brokerages, and asset managers offering crypto ETFs. The move was seen as preparation for upcoming crypto ETF products."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiZ0FVX3lxTFA5QXVJTkFibEJFTldWZ3E1bHpBc0VyUTdHOEtyMW5naTZuejZkQWZrRDFCdG5CUDNzUnZid2ZYcVREQTU2WjdvejBWZW0wY1ZVNnJsa1EyUi1fZE9sOTU3Y3F5ejh3MzQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Apr 2024 07:00:00 GMT",
        "title": "Bitcoin and Ethereum spot ETFs may hit Hong Kong markets as early as Monday: Bloomberg - Crypto Briefing",
        "content": "Mainland China's investors may soon channel billions into Hong Kong's crypto ETFs.\n\nShare this article\n\nMajor Chinese asset managers are on the brink of launching spot Bitcoin and Ethereum exchange-traded funds (ETFs) in Hong Kong, possibly as early as Monday, Bloomberg reported on Friday, citing anonymous sources familiar with the matter. The timeline, however, remains tentative, sources noted.\n\nHarvest Fund Management Co.’s international division and a joint venture between Bosera Asset Management (International) Co. and HashKey Capital are the two potential ETF issuers, Bloomberg’s sources said.\n\nAs noted, the two entities plan to roll out their ETFs by the end of the month, pending approval from the Securities and Futures Commission (SFC) and finalizing listing arrangements with Hong Kong Exchanges & Clearing Ltd.\n\nThe report follows news earlier this week that prominent Chinese asset managers have applied for spot Bitcoin ETFs through their Hong Kong subsidiaries. According to Bloomberg, on April 9, SFC granted Harvest and China Asset Management clearance to provide virtual-asset-related fund management services.\n\nHong Kong Bitcoin ETFs poised to attract $25 billion\n\nThe potential approval of Hong Kong-listed spot Bitcoin ETFs could unlock up to $25 billion in demand from mainland China as qualified Chinese investors may be allowed to access the funds through the Southbound Stock Connect program, said Matrixport in a Friday report.\n\n“A likely approval of Hong Kong-listed Bitcoin Spot ETFs could attract several billion dollars of capital as mainland investors take advantage of the Southbound Stock Connect program, which facilitates up to 500 billion RMB (HK$540 billion and $70 billion) per year in transactions,” said Matrixport. “Based on the (potential) available capacity, this might result in up to 200 billion Hong Kong dollars of available capacity for those HK Bitcoin ETFs—or US$25 billion.”\n\nThe Southbound Stock Connect program sets a yearly limit of HK$540 billion for Chinese investment in Hong Kong-listed stocks. However, 360MarketIQ’s data shows the quota hasn’t been fully used in the past three years, leaving around HK$100-200 billion annually unused capacity.\n\nMatrixport suggested that this unused quota could be directed towards the Bitcoin ETF if approved.\n\nAfter the debut of US spot Bitcoin ETFs, global investors have seen Hong Kong as the next hub for crypto ETFs due to the country’s regulatory environment.\n\nIn late December last year, the SFC and the Hong Kong Monetary Authority (HKMA) issued new rules addressing the possibility of investment funds, brokerages, and asset managers offering crypto ETFs. The move was seen as preparation for upcoming crypto ETF products."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxQQWZ5aDVUYU5XZ2ZvQ3RqcG8wS01XTE83dzdFcHY5aGJFWWtlcWFTREV2QTZqUTJtdlBhN2U4bWp4NklybEM4ZXNUazI2aW9LSmpzVnJmSjFpbHF3Z250V1BwUm1jQ0NRUlY5UHd0YjU3XzJtYWVJRHROYmlINXh6NW8yTGRIUdIBiwFBVV95cUxQZVdwRGlUeW5XeEFQVEpzTnJzb0ZuUzdTdkc1aGt1R2NvSGhsY0ZVeGI0RFY3b0VVTTYtbEhBQnBfY1J1VDZJcUpxNW5jYndlLVNiY25nWVV6MFJNdVJ5WWhnTHh5eVlmRWE5Uk1ZVDNJSDNPVXVENk9NQURXdERQQ3BmZGhFX3J4d3RV?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Apr 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Price Crash: Whales Dive In as $3,000 Support Falters - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAs Ethereum, the second largest cryptocurrency by market capitalization, experienced a rapid price decrease, a fascinating development emerged: Ethereum whales began to accumulate massive amounts of ETH, showcasing a strategic play in the face of uncertainty.\n\nAdvertisement\n\nThe term \"whale\" is used to describe individuals or entities that hold a significant amount of a cryptocurrency, and their recent action in the wake of a broader market downturn has prompted attention and speculation across the crypto community.\n\nAs the Ethereum price sharply fell to lows of $2,850 on April 13, on-chain data captured a strategic accumulation made by an ETH whale or large holder.\n\nAccording to Spot On Chain, the Ethereum Whale \"0x435\" spent 70 million USDC to buy 23,790 ETH as Ethereum fell to nearly $2,942.\n\nDespite the recent 8% correction in the $ETH price (24H), whales are still buying $ETH!\n\n\n\n1. Whale 0x435 spent 70M$ USDC to buy 23,790 $ETH at ~$2,942 4 hours ago:\n\n\n\n• In total, the whale has accumulated 60,808 $ETH ($191M) from #Binance and DEX in the past 15 hours, after each… pic.twitter.com/ujZRULGAkX — Spot On Chain (@spotonchain) April 14, 2024\n\nBased on data from on-chain sources, the whale's buying frenzy began days ago, when the ETH price began to plummet, and included withdrawals from Binance and decentralized exchanges.\n\nOn-chain analytics firm Lookonchain reports one of the said whale transactions, which involved a withdrawal of 37,018 ETH worth $120.7 million from Binance.\n\nThe said whale has accumulated 60,808 ETH worth $191 million from Binance and DEX following each sharp drop in the last 24 hours and has withdrawn 62,141 ETH worth $202.6 million from Binance in the past five days.\n\nCurrently, the whale has 85,931 ETH worth $278 million, as well as $136 million in USDT and USDC stablecoins in Aave.\n\nThe whale's actions coincided with a broader trend of Ethereum accumulation by large holders. Another mysterious whale, a fresh wallet tagged as \"0xE347,\" was said to have withdrawn 7,300 ETH worth $23.8 million from Binance and transferred it to Pendle Finance. A cVault.finance deployer paid 6 million DAI to buy 2,018 ETH for almost $2,973, according to Spot On Chain.\n\nAt the time of writing, ETH was down 6.05% in the last 24 hours to $3,060, up from intraday lows of $2,911, mirroring the broader crypto market crash. Ethereum declined for three days in a row from highs of $3,617 to lows of $2,850 on April 13 before slightly recovering."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxNSTI1ODN5WWpGUVdZWDg4eC0yQ3ExcC1JU3BmSUJDQmZIcldTVlgxX1lwcUJWSW5TUzRYbGUxc2RLY0tmczNMckRYMG9GWGZlN0V5X3FmZmxXWDVxOTVzSjRlRHVVWE5OaTU4aE9PTVNDMkltZm5pT3lBcHlRNkN5aVB6emdIUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Apr 2024 07:00:00 GMT",
        "title": "Ethereum startup Aligned Layer nabs $2.6m in venture capital - crypto.news",
        "content": "Aligned Layer, a startup touted as a “universal verification layer for Ethereum,” confirmed Sunday, April 14, that it raised $2.6 million in seed funding.\n\nLemniscap, a seven-year-old firm that has backed multiple companies in the crypto blockchain space, led the effort. The firm previously led the $2.4-million funding round for web3 startup Safary in January.\n\nBankless Ventures and Paper Ventures are also backing Aligned Layer, along with StarkWare, O(1)Labs and Ingonyama CEO Omer Shlomovits.\n\nAligned Layer announced the capital raise via social media. See below.\n\n1. We're excited to announce that we've raised $2.6M in our Seed Round, led by @Lemniscap , to enable developers to access affordable and fast proof verification for all proof systems.\n\n\n\nAligned Layer helps Ethereum become a better, faster and cheaper settlement layer for validity… pic.twitter.com/pFCOFRAh8R — Aligned Layer (@alignedlayer) April 14, 2024\n\nAligned Layer is touted as the first decentralized ZK Proof verification layer for Ethereum. It’s also powered by Eigen Layer — a restaking mechanism that allows ETH stakers to reallocate their staked ETH and Liquid Staking Tokens (LSTs) to improve security for other protocols.\n\nYou might also like: Blockchain fraud group strikes again, launches fresh scheme on Blast network\n\nAligned Layer goals\n\nThe company will put the proceeds of the capital raise toward expanding its operations and accelerating Aligned Layer’s mainnet launch, scheduled for the second quarter of 2024.\n\nAs an infrastructure provider, Aligned Layer aims to lower costs and improve speeds for developers that are building applications like L2s, or layer-2 networks.\n\n“Today’s announcement is a testament to our team’s shared dedication to making Ethereum the most cost-effective and efficient platform for ZK verification by using Eigen Layer,” Aligned Layer co-founder Roberto José Catalán said in a prepared statement.\n\nThe seed round also included participation from several angel investors, including Sreeram Kannan, Brandon Kase, Daniel Lubarov, DCbuilder, Chainyoda, Weikeng Chen, Sam Benyakoub, Lucas Kozinski and Peter Fittin (SizeChad). See below.\n\nhttps://twitter.com/SizeChad/status/1779570022664245589\n\n“At Aligned Layer, we firmly believe that developers should be able to use the proof system that best suits their needs, without being constrained by the settlement layer,” Catalán added.\n\nThe funds are expected to give the company enough runway to execute near-term goals.\n\nThe Aligned Layer funding comes on the heels of a busy week for crypto venture capitalists. New York-based Monad Labs, for example, scored $225 million in funding as part of a round led by Paradigm. Monad is a layer-1 blockchain compatible with the Ethereum Virtual Machine but can process transactions using the same set of rules faster.\n\nThere was also Bitcoin layer-2 network Mezo. The startup raised $21 million in a Pantera-led funding round.\n\nDuring the first three months of 2024, global investors put $2.5 billion into crypto-related startups, according to PitchBook.\n\nHowever, investors don’t appear to be warming up to blockchain-related gaming companies. According to data from DappRadar, the sector secured $288 million in funding for the first quarter of 2024. That’s a 57% decrease compared to the previous three-month period."
    }
]