[
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxNdWpGYjg2NGlfWmV6aGRKZTlFelpaU3hYa0hwaWFmV2d0UFNWZ2RYUzFGdzkzekRCQXU2b1MxQ215NUprd0VRc0FXUzFJdjdQQTJCN1FXMllhalA2TFRvUlRwOEYzVld5SE5XVVYyQlpSaC11cXl6TmdOZFNZNTZ3QXp5Z9IBiAFBVV95cUxPaWVHQncyazQtV2pLTUExQlBwSjVjeWF0N1FGa1ZvSlVTSnBSdXN6X3JQbW5odDBKZVBLT3BCYVo5RmF2SGhxa3d1djJFUlN2VExCSjcycml0eVhVV3VNRkxiQ3RSenc4ejd0TVVEYmJlR1lOR2RLZ3lfSEVRYnd1M1FTeEQwWTk1?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Generated More Revenue Than Robinhood and Etsy in Q1 - U.Today",
        "content": "Ryan Rasmussen, a senior researcher at Bitwise Asset Management, has noted that Ethereum, the second-largest blockchain network, managed to generate more revenue than major public companies of the likes of Etsy, Yelp, and Reddit in the first quarter of 2021 .\n\nAdvertisement\n\nEthereum generated more revenue than Robinhood, Etsy, Yelp and Reddit in Q1 2024.\n\n\n\nProbably nothing. https://t.co/OYYWrYvdZx — Ryan Rasmussen (@RasterlyRock) June 10, 2024\n\nAccording to data provided by Coin98 Analytics, Ethereum achieved record transaction fee revenue of roughly $1.2 billion. This marked a 79% increase compared to the previous quarter.\n\nEthereum's transaction fees recorded a significant uptick in March due to the major market rally that took place during that month. Bitcoin hit its current all-time high of $73,737 while the flagship altcoin also approached its all-time peak of $4,878 which was logged more than two years ago.\n\nAdvertisement\n\nEther is likely to end the second quarter on a high note as well due to the approval of spot exchange-traded funds in the U.S.\n\n$22K by the end of the decade?\n\nAmerican investment management firm VanEck recently predicted that the price of the leading altcoin could potentially reach a whopping $22,000 by the end of this decade.\n\nFor Ether to achieve this pie-in-the-sky target, the network has to become cheaper and more efficient.\n\nLast year, VanEck predicted that Ethereum's revenue could potentially grow to $51 billion on an annual rate in 2030, which is its base case. Its bull case is $136 billion.\n\nThe company counts transaction fees, including the tip fee, as a revenue line.\n\nVanEck has also predicted that Ethereum could end up becoming a store-of-value asset, evolving beyond merely a transactional currency. This could potentially add “Security as a Service” (SaaS) as a new revenue item."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxNUE5ybmg5QTQ0X2FpNWZYSlFReGk2ZWVvc1ZvYmNXNFNWbDdVTXFoUnE4SjBCeGY4Tl8wNWNtTzhMSmsyNnVfcmlOTVRMR3ZqdDU4OHpITzRmMUxHWWdkeU9Qb25BdGl5dU85ZzhjVWZXYnk3a0F5VVNyaEhWQWwxYkJBWkx4ZklXVDhr?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jun 2024 07:00:00 GMT",
        "title": "Ethereum ETFs Expected to Capture 20% of Bitcoin ETF Flows - Watcher Guru",
        "content": "Following the recent approval of the Spot Ethereum ETFs last month, one analyst has predicted that the investment vehicle will capture as much as 20% of Spot Bitcoin ETF flows. Indeed, cryptocurrency exchange Bitfinex’s head of derivatives, Jag Kooner, predicted the performance of the ETH offering.\n\nBoth Ethereum and Bitcoin represent the only two crypto-based ETFs in the United States. Moreover, since its approval in January, BTC has had one of the most successful exchange-traded products in the country’s history. Now, there is the expectation that Ethereum could capture a fifth of the flows going into the Bitcoin offering.\n\nSource: Watcher.Guru\n\nAlso Read: Can Ethereum ETFs Garner High Demand Like Bitcoin ETFs?\n\nEthereum ETF to Capture 10%–20% of Bitcoin ETF Flows\n\nWith the midpoint of 2024 fast approaching, the year has seen the digital asset sector climb to the forefront. Dominating discussions within finance, crypto-based ETFs have been a massive part of the ongoing discourse. As the second such opinion prepares to go live, the market is observing what its debut could look like.\n\nMoreover, they are beginning to question what effect its debut could have on the cryptocurrency industry as a whole. With Bitcoin proving to be immensely successful just five months after its launch, the presence of a secondary offering has undoubtedly become a point of interest.\n\nAccording to one expert, the recently approved Spot Ethereum ETFs could capture a significant portion of Bitcoin ETF flows. Specifically, Bitfinex Jag Kooner noted that the offering could acquire as much as a fifth of the overall flows into the digital asset investment offering.\n\nSource: Blockchain Reporter\n\nAlso Read: $438B Asset Manager Susquehanna Buys $1.3B In Bitcoin ETFs\n\n“Forecasts show that spot Ethereum ETFs could capture between 10 and 20% of the flows that have been going into spot Bitcoin ETFs,” Kooner told The Block. “The launch of gold ETFs offers a historical parallel, as when new gold ETFs were introduced, they attracted significant investment,” Kooner added.\n\nThe debut of those new gold ETFs, historically, affected the inflows in investment products that already existed. Kooner remarked, “Similarly, the introduction of Ethereum ETFs could see fund managers reallocating resources to balance their exposure to both Bitcoin and Ethereum.”"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxQWFVyS1hFVFAwWWZwNW41bUVEYWw0Y1lQWk5iU0VNbWt3M2ZLS1RWVW11YXV3cXB3RVRTc05jcGFybmMtVmNjd1VCMzFodGJ3cU5YWnJsRmpNNjNSUVhpYnFVZm4yS1A0aEVtR09QQ2RCUVNvcS02NnptQ1lyMG12ci1nR29IejQtUnF6NlZuZC1BZzd5U2w2alRmNjV2N0VRWmZaTtIBqgFBVV95cUxON2dOb3ZNNkhCdUhlY1l6cklMZVVEYmJXdmNacEZrSTEwQ3RoaUlKZHdNSHNNdmxkUXNXbXBNRDZVb3oyS29QYjBVZTVKWFFMWnY2bWh4dUk1ZXljbzVRS2czMTJnNU1Ob0QyQThFdnMzTTJDQzR1R1djYmlDMjctZzUzZjFPa0RzY21ZdnVFTDJkdXUzamlBc0pPcW1XRzMwS1hnUFhXTks4dw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jun 2024 07:00:00 GMT",
        "title": "Institutional Money Pours Into Ethereum, Addresses Holding Over 10K ETH Surge - CryptoPotato",
        "content": "All eyes are on spot Ethereum ETFs. SEC’s surprising turn of events last month has prompted a surge in addresses holding large amounts of ETH during the period.\n\nSuch a trend could potentially hint at a much-needed revival for the world’s largest altcoin, which has been struggling to surpass the $4,000 resistance level.\n\nWealthy Investors Accumulate ETH\n\nThere has been a 3% rise in the number of Ethereum addresses holding 10,000 or more ETH over the last three weeks. This metric is seen as an indicator of rising institutional investment and accumulation by Ethereum whales and high-net-worth individuals.\n\nPopular crypto analyst Ali Martinez tweeted,\n\n“The number of #Ethereum addresses holding 10,000+ $ETH has increased by 3% in the last three weeks, signaling an important spike in buying pressure!”\n\nAs such, a spike in addresses with large ETH holdings suggests increasing buying pressure and demand from deep-pocketed investors. This could potentially be an upcoming bull run for Ethereum as whale accumulating supply is often a precursor to an uptick in asset prices.\n\nThis comes a month after the US Securities and Exchange Commission (SEC) reached a landmark decision to approve spot Ethereum ETF. The financial watchdog granted permission for a total of eight separate ETF products tracking Ethereum proposed by Grayscale, VanEck, ARK Invest, Franklin Templeton, Fidelity, BlackRock, 21Shares, and Invesco Galaxy.\n\nThese listings will enable traditional investors to gain exposure to the cryptocurrency through regulated investment vehicles and are also expected to unlock new capital inflow while simultaneously boosting its mainstream accessibility and liquidity. Hence, whales are bullish on the development as evidenced by the resulting accumulating activity.\n\nEthereum Scarcer Than Bitcoin on Exchanges\n\nFurther validating this trend is Glassnode data, which shows that centralized exchanges are experiencing a supply crunch for both Bitcoin and Ethereum. Only 11.73% of Bitcoin’s total supply and an even lower 10.56% of Ethereum’s supply remain on major exchanges.\n\nThis indicates that investors are withdrawing and holding their cryptocurrencies off exchanges, further signaling an accumulation trend.\n\nWhen supply on exchanges dries up, it can create upward price pressure as the remaining liquidity gets absorbed by buyers. Interestingly, Ethereum appears to be even scarcer than Bitcoin on exchanges currently."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxPZ3dZc3FnaUN1d1RYdU9LSkFPeHpVZE5pODNwWVBCR2thUktpamp2LVZ6SzRzS1Z6N3JKNV9adjFQdElsd2xpcWQ5MDRVZnBabWR4Rk9yeDBpcVVYVHFsRUlHM2ltY21rUFIxb3k5MDF0U0JXdDl3enFNaDRkTWJqVkk4SGctTVVrc3c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jun 2024 07:00:00 GMT",
        "title": "Crypto Market on Fire: Bitcoin's Breakout, Ethereum's Growth, and Furrever Token's Promising Launch - Yahoo Finance",
        "content": "Furrever Token\n\nNew York City, NY , June 10, 2024 (GLOBE NEWSWIRE) --\n\nThe cryptocurrency market is experiencing a fiery surge as Bitcoin, Ethereum, and the newly introduced Furrever Token make significant strides. This trifecta of digital assets is creating a buzz among investors, each offering unique opportunities and showcasing promising growth trajectories.\n\nBitcoin's Breakout: A Bullish Run\n\nBitcoin, the leading cryptocurrency by market capitalization, is once again in the spotlight with a remarkable breakout. Recent activities have seen Bitcoin reclaim and stabilize around the $69,000 mark, driven by substantial whale activity. High-net-worth investors have opened massive long positions, indicating strong confidence in Bitcoin's potential for further gains. This bullish sentiment is underpinned by record-high open interest and funding rates, suggesting that the market is poised for continued upward movement.\n\nHistorical data shows that Bitcoin often experiences significant price appreciation following such bullish patterns, making it an attractive option for both new and seasoned investors. As Bitcoin continues to lead the market, its influence on the broader cryptocurrency ecosystem remains unparalleled, driving momentum across various digital assets.\n\nEthereum's Growth: Innovation and Expansion\n\nEthereum, the second-largest cryptocurrency by market cap, is also witnessing impressive growth. Known for its robust smart contract capabilities and a vast ecosystem of decentralized applications (dApps), Ethereum continues to innovate and expand. The recent approval of Ethereum ETFs has further fueled optimism, attracting institutional investors and enhancing market stability.\n\nEthereum's transition to Ethereum 2.0, aimed at improving scalability and reducing energy consumption, is a significant milestone. This upgrade is expected to enhance the network's performance and security, making Ethereum an even more attractive platform for developers and users. The increased adoption of Ethereum-based DeFi applications and NFTs (non-fungible tokens) further cements its position as a leader in the blockchain space.\n\n\n\n\n\nFurrever Token: A Whimsical Revolution in Crypto\n\nAmidst the excitement surrounding Bitcoin and Ethereum, Furrever Token (FURR) is carving out its own unique niche. Unlike traditional cryptocurrencies, Furrever Token infuses the crypto world with a playful and heart-warming twist. Centered around adorable cat imagery, Furrever Token aims to create an engaging and fun ecosystem that appeals to both crypto enthusiasts and cat lovers alike.\n\nStory continues\n\nA Delightful Concept\n\nFurrever Token stands out with its focus on cuteness and community. The platform features cat-themed stickers, emojis, and visuals that enhance user interaction and foster a sense of camaraderie among holders. This whimsical approach not only differentiates Furrever Token from other digital assets but also creates a loyal and enthusiastic user base.\n\nRobust Tokenomics and Community Engagement\n\nThe tokenomics of Furrever Token are meticulously crafted to support its long-term vision. With a total supply of 9 billion tokens, the distribution includes 65% available during the presale, 25% allocated for decentralized exchanges (DEXs), and 10% reserved for the team, locked for a year to ensure project stability and trust. This thoughtful allocation aims to balance initial accessibility with sustained growth potential.\n\nCommunity involvement is at the heart of Furrever Token. By empowering early adopters as moderators, the project fosters organic growth and meaningful engagement. This strategy has already attracted nearly 4,000 active members on Telegram, demonstrating the strong interest and participation in the Furrever ecosystem.\n\nPromising Presale and Future Prospects\n\nFurrever Token has raised over $1.3 million and is in the ninth stage of its presale, targeting a total of $1.9 million. The token’s upcoming launch on PancakeSwap offers up to 15X returns for early investors, creating significant buzz and FOMO (fear of missing out) within the crypto community. With a current price of $0.000732, FURR presents an attractive opportunity for those looking to invest early in a unique and promising project.\n\nEnsuring Security and Trust\n\nSecurity and transparency are paramount for Furrever Token. The project's smart contract has been audited by Securi Lab, providing an additional layer of assurance for investors. While the team remains anonymous—a common practice in the crypto world—they have implemented measures such as locking their tokens for a year to build trust and demonstrate commitment to the project's success.\n\nConclusion\n\nAs Bitcoin and Ethereum continue to lead the charge in the cryptocurrency market with their impressive breakouts and sustained growth, Furrever Token is set to be the next big thing with its unique and whimsical approach. With strong tokenomics, community involvement, and a promising presale performance, Furrever Token offers a refreshing and potentially lucrative opportunity for investors. The combined momentum of these digital assets underscores the dynamic and exciting nature of the crypto market. For more information, visit Furrever Token's official website.\n\n\n\nJoin Furrever Token Presale Now:\n\n\n\nFurrever Token Official Website\n\n\n\nVisit Furrever Token Presale\n\n\n\nJoin Official Telegram Group\n\n\n\nFollow Official X Account\n\n\n\nMedia Contact:\n\nRobert Smith\n\nhttps://furrevertoken.com/\n\nsupport@furrevertoken.com\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\n\n\n\n\nCONTACT: Robert Smith support at furrevertoken.com\n\n\n\n"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxPZ3dZc3FnaUN1d1RYdU9LSkFPeHpVZE5pODNwWVBCR2thUktpamp2LVZ6SzRzS1Z6N3JKNV9adjFQdElsd2xpcWQ5MDRVZnBabWR4Rk9yeDBpcVVYVHFsRUlHM2ltY21rUFIxb3k5MDF0U0JXdDl3enFNaDRkTWJqVkk4SGctTVVrc3c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jun 2024 07:00:00 GMT",
        "title": "Crypto Market on Fire: Bitcoin's Breakout, Ethereum's Growth, and Furrever Token's Promising Launch - Yahoo Finance",
        "content": "Furrever Token\n\nNew York City, NY , June 10, 2024 (GLOBE NEWSWIRE) --\n\nThe cryptocurrency market is experiencing a fiery surge as Bitcoin, Ethereum, and the newly introduced Furrever Token make significant strides. This trifecta of digital assets is creating a buzz among investors, each offering unique opportunities and showcasing promising growth trajectories.\n\nBitcoin's Breakout: A Bullish Run\n\nBitcoin, the leading cryptocurrency by market capitalization, is once again in the spotlight with a remarkable breakout. Recent activities have seen Bitcoin reclaim and stabilize around the $69,000 mark, driven by substantial whale activity. High-net-worth investors have opened massive long positions, indicating strong confidence in Bitcoin's potential for further gains. This bullish sentiment is underpinned by record-high open interest and funding rates, suggesting that the market is poised for continued upward movement.\n\nHistorical data shows that Bitcoin often experiences significant price appreciation following such bullish patterns, making it an attractive option for both new and seasoned investors. As Bitcoin continues to lead the market, its influence on the broader cryptocurrency ecosystem remains unparalleled, driving momentum across various digital assets.\n\nEthereum's Growth: Innovation and Expansion\n\nEthereum, the second-largest cryptocurrency by market cap, is also witnessing impressive growth. Known for its robust smart contract capabilities and a vast ecosystem of decentralized applications (dApps), Ethereum continues to innovate and expand. The recent approval of Ethereum ETFs has further fueled optimism, attracting institutional investors and enhancing market stability.\n\nEthereum's transition to Ethereum 2.0, aimed at improving scalability and reducing energy consumption, is a significant milestone. This upgrade is expected to enhance the network's performance and security, making Ethereum an even more attractive platform for developers and users. The increased adoption of Ethereum-based DeFi applications and NFTs (non-fungible tokens) further cements its position as a leader in the blockchain space.\n\n\n\n\n\nFurrever Token: A Whimsical Revolution in Crypto\n\nAmidst the excitement surrounding Bitcoin and Ethereum, Furrever Token (FURR) is carving out its own unique niche. Unlike traditional cryptocurrencies, Furrever Token infuses the crypto world with a playful and heart-warming twist. Centered around adorable cat imagery, Furrever Token aims to create an engaging and fun ecosystem that appeals to both crypto enthusiasts and cat lovers alike.\n\nStory continues\n\nA Delightful Concept\n\nFurrever Token stands out with its focus on cuteness and community. The platform features cat-themed stickers, emojis, and visuals that enhance user interaction and foster a sense of camaraderie among holders. This whimsical approach not only differentiates Furrever Token from other digital assets but also creates a loyal and enthusiastic user base.\n\nRobust Tokenomics and Community Engagement\n\nThe tokenomics of Furrever Token are meticulously crafted to support its long-term vision. With a total supply of 9 billion tokens, the distribution includes 65% available during the presale, 25% allocated for decentralized exchanges (DEXs), and 10% reserved for the team, locked for a year to ensure project stability and trust. This thoughtful allocation aims to balance initial accessibility with sustained growth potential.\n\nCommunity involvement is at the heart of Furrever Token. By empowering early adopters as moderators, the project fosters organic growth and meaningful engagement. This strategy has already attracted nearly 4,000 active members on Telegram, demonstrating the strong interest and participation in the Furrever ecosystem.\n\nPromising Presale and Future Prospects\n\nFurrever Token has raised over $1.3 million and is in the ninth stage of its presale, targeting a total of $1.9 million. The token’s upcoming launch on PancakeSwap offers up to 15X returns for early investors, creating significant buzz and FOMO (fear of missing out) within the crypto community. With a current price of $0.000732, FURR presents an attractive opportunity for those looking to invest early in a unique and promising project.\n\nEnsuring Security and Trust\n\nSecurity and transparency are paramount for Furrever Token. The project's smart contract has been audited by Securi Lab, providing an additional layer of assurance for investors. While the team remains anonymous—a common practice in the crypto world—they have implemented measures such as locking their tokens for a year to build trust and demonstrate commitment to the project's success.\n\nConclusion\n\nAs Bitcoin and Ethereum continue to lead the charge in the cryptocurrency market with their impressive breakouts and sustained growth, Furrever Token is set to be the next big thing with its unique and whimsical approach. With strong tokenomics, community involvement, and a promising presale performance, Furrever Token offers a refreshing and potentially lucrative opportunity for investors. The combined momentum of these digital assets underscores the dynamic and exciting nature of the crypto market. For more information, visit Furrever Token's official website.\n\n\n\nJoin Furrever Token Presale Now:\n\n\n\nFurrever Token Official Website\n\n\n\nVisit Furrever Token Presale\n\n\n\nJoin Official Telegram Group\n\n\n\nFollow Official X Account\n\n\n\nMedia Contact:\n\nRobert Smith\n\nhttps://furrevertoken.com/\n\nsupport@furrevertoken.com\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\n\n\n\n\nCONTACT: Robert Smith support at furrevertoken.com\n\n\n\n"
    }
]