[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxNenBhVS1CRTFxMUd4X0pMSDlyU1IxYjU3YTJvVE1SSFpvSDhpXzVwUnE1cEt4SGhGWVVoTGFqMElyWEl2SXhiRmo2bm15Y3pJUnZoZXoteWFqbjBrdmN3VkEtb2Iwa19LVUIxdG1ITUxEQXNtSDYxeVMxcVZQdU56cFk0NmlnWHAzUGt0bkR2OHBVaUpMOEFn0gGcAUFVX3lxTE9SNzRCelhaTGxLVnBkdS1MWG5SdVktVnk5TzZPLTBRZ0J4N2VzR2k1LWFqbDBCXzRBMS14Y0cwOUN6dDdaQXFGMC1YU3FpY3ItTGNQUnlYb1FwTmwtWmJKaXBRQU1rMEsxVVd0dE9fdEQ2Qno5MjNVOHpiRTB0WlFKVURacWhQaHpwX2tBa2N0cTJKQko1NnY0OXdHQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 09 Jun 2024 07:00:00 GMT",
        "title": "Top Ethereum Contributor Makes Epic U-Turn With Unexpected Gas Fee Statement - U.Today",
        "content": "Hayden Adams, the founder and CEO of Uniswap Labs, recently made a surprising statement about transaction fees on the ETH network. Adams, who leads the largest decentralized exchange on Ethereum, declared that users should never have to worry about \"gas fees.\" This unexpected opinion has added a new dimension to the ongoing debate about Ethereum's high transaction costs.\n\nAdvertisement\n\nAdams' statement comes amid a heated discussion about the expenses associated with Ethereum transactions. Recently, artist Iggy Azalea commented on the issue, questioning how gas fees are used and expressing skepticism about their impact. Although Azalea incorrectly assumed that all fees directly benefit Ethereum's founders, her comments have once again highlighted the issue of high transaction costs.\n\nNo user should ever have to hear the term “gas fee” Advertisement June 8, 2024\n\nThe debate over Ethereum's gas fees has become more intense with the rise of Solana, a blockchain known for its lower transaction costs. Solana's recent performance has led some to speculate about the blockchain's future and its ability to compete with more affordable alternatives.\n\nKey Ethereum developers, including co-founder Vitalik Buterin, have been addressing the gas fee problem for some time. Last month, Buterin introduced EIP-7706, a proposal aimed at optimizing transaction calldata and reducing gas usage. This proposal includes a new type of gas specifically for calldata transactions, with the goal of creating a separate fee market and making calldata more affordable.\n\nAmid Adams' words, Uniswap has continued to succeed, earning over $3.64 billion in total commissions to date. In the past 24 hours alone, Uniswap collected $1.62 million in fees, and over the last month, it amassed $65.95 million."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPb0pZd0wtdVU2UVdOVHVXRzJVSkRFMmpDMUMtdk40Sll3LXN3T2V2QWhDUVZ3V3ppWC1ZOTlQc1hNc2JoTTZGUmM4elhiMGUzMjgxQ2ozZUVMRE9xRUFpZ2N1enVvR1JzMTExSEZRZUcwcTJjTzl1Q2NTa1VZMFd2YU5nN2ZndlHSAYwBQVVfeXFMUGlOaEF2QnRneUpiSEdOMUNEWUJ2MnRJMWZpeEtuTi1iSmVTVGNDWlQxaWpGVC1USlEtN3c0QlBNS3NZOEdyaEZvbXFNRVRtSVhZSDNtVjZ6amt1aUpVZmRadFd4bHRYM2dhalZDYjBWdlRQSGZfM0FGY18wRHBwZE1qRmZKUTU5aGZjVkI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 09 Jun 2024 07:00:00 GMT",
        "title": "Ethereum’s rally halts: Examining ETH’s potential next moves - AMBCrypto News",
        "content": "Ethereum’s current decline signaled a cooling-off from its recent highs\n\nDerivative data pointed to continued market interest.\n\nEthereum [ETH] seems to have come off its ETF hype-induced rally as bulls have started to take a hike.\n\nAt press time, the largest altcoin in the world has seen a decrease of 3.7% over the past day and 2.5% over the past week as the market awaits the approval of the S-1 forms for the ETFs. So, is the rally over already?\n\nAMBCrypto’s analysis of TradingView saw that Ethereum has been unable to maintain its highs and is now consolidating at lower levels.\n\nThe Moving Averages (MA50 in blue and MA200 in red) indicated a cooling-off period.\n\nInitially, the price surged above both moving averages in a strong bullish move but has since declined and is now trading below these key indicators, as we see a shift to bearish momentum in the short term.\n\nThe RSI, sitting around 45, also indicated a lack of strong buying momentum, with values leaning more toward the oversold territory, but not conclusively so.\n\nEthereum’s social volume has also declined significantly, suggesting that public interest in and sentiment toward the altcoin are low.\n\nThis reduction in social engagement could be contributing to the decrease in Ethereum’s price, as less discussion might correlate with reduced trading activity and demand.\n\nInterestingly, the trading volume of Ethereum’s derivatives market has sharply increased by over 70%, meaning there is heightened market engagement.\n\nNotably, the long/short ratio across different platforms also shows more bullish sentiment on platforms like Binance [BNB] and OKX.\n\nWhat Ethereum’s future holds\n\nThe on-chain data for Ethereum presented a predominantly bullish scenario. 89% of holders are currently making money at the present price, indicating a strong upward trend that has benefited the majority.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nThe significant concentration of the token by large holders (51%) suggested that while there was potential for high volatility due to possible large-scale sell-offs, the market was stable, with these major holders likely maintaining their positions.\n\nOverall, Ethereum bulls seem to be cooling off temporarily, likely due to the latest US jobs data. But the rally is not over yet."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxNNjhzUXpaRkhvTHF5ZFBXS1JOdHQ5NVQwTmpPV3FOUDB5N2VwbDc2ZWhndEx1cXdpQ3RPZWxpeEU5aVVEbnJ4SkFNVXEzb1JZTUFaWUNqMWphamprUEhTTVQ0WXJsdTJxejFmWkw5dVNOck5TVjU1RXkwWHlTZlZfMmhYTmhVMVR5V1ZWZ1hUN1ZzbFdBUm02eldsdmUyZV94bzd6b3F6dy01c3JKaVBXS1VB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 09 Jun 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) $16 Billion Open Interest hints at $4K Price Rebound - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE1XMmJySVNrVDRZMG14dm1ZQlA4TEZraUlFX1NNN0ZPVFJrMWZEcTVlS2V2QUR0MDh5Xzc3U0kzUFF1RGMwTTVobkJDWW52bTgtQ0VSZ3lCOFJwU0Y1SWpFX3paVzhaVFB3cGZmb2lweGU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 09 Jun 2024 07:00:00 GMT",
        "title": "Wintermute CEO questions Ethereum's leadership paradox amid celebrity memecoin controversy - Crypto Briefing",
        "content": "Ethereum leaders faces criticism for trying to merge capitalist and social goals.\n\nShare this article\n\nEvgeny Gaevoy, CEO of Wintermute, said if Ethereum fails in the future, it will not be because of technical shortcomings compared to competitors like Solana. Instead, the core issue is the contradiction in Ethereum’s leadership.\n\n“If ETH fails in the future it [won’t] be because ‘Solana is faster’, it will be because the [ETH] ‘elite’ is still stuck in a massive contradiction,” Gaevoy stated in a recent post on X.\n\nHis remarks come as a response to the controversy that erupted following Vitalik Buterin’s critique of celebrity memecoins. According to Buterin, projects should aim to deliver societal value and leave participants content, rather than focus on enriching celebrities and early investors.\n\nButerin’s stance drew a sharp rebuke from hip-hop artist Iggy Azalea, who recently launched her own memecoin, MOTHER. She posted a meme showing her holding a baby that resembled Buterin.\n\nAzalea’s photo prompted Uniswap Labs co-founder Hayden Adams to defend Buterin’s role.\n\nHe criticized Azalea for downplaying Buterin’s contributions to the crypto community, expressing disappointment that instead of reacting positively and using profits to support social causes, the singer chose to mock Buterin.\n\nNo issues with memecoins or celebcoins – I think there’s value to memetic attention and it’s cool to create markets for it That said, the underlying purpose and value of the tech goes way beyond financial games. And the best builders in the space are motivated by positive social… https://t.co/FQhawNl7GP — Hayden Adams 🦄 (@haydenzadams) June 6, 2024\n\nThat was when the Wintermute CEO jumped into the debate and criticized Ethereum’s leadership. He argued that Ethereum leaders are attempting to create a capitalist blockchain system while simultaneously addressing social issues—a stance he sees as inherently contradictory.\n\n“You are either building capitalism or planned socialism. I’m sorry, you really [can’t] have both,” Gaevoy added.\n\nGaevoy’s comments sparked controversy among crypto members. Many disagreed with his view, saying that being against celeb memecoins does not equate to building a socialist system.\n\nNot sure how Hayden and Vitalik saying how they don't like certain trends means they are against capitalism (or aren't involved in building capitalist systems anymore) They both have a certain vision of crypto, in terms of the types of things people will build and what people… — Mike van Rossum (@mikevanrossum) June 6, 2024\n\nExcuse me, but in what way Vitalik or Hayden are building socialism? Being against obvious rug pulls != building socialism — DeFi Made Here (@DeFi_Made_Here) June 6, 2024\n\nIn response to these disagreements, Gaevoy said it all came down to the underlying principle.\n\nAccording to him, if capitalism is the foundation, integrating features to mitigate its negative impacts is beneficial. However, if the primary goal is “social justice” or creating “only good things,” capitalism should not be an afterthought.\n\nTo me its about the primary guiding principle. If you key guiding principle is capitalism and then you make extra steps to make it less damaging – I'm all for it. If your guiding principle is, idk, \"social justice\" or \"only good things should be built\" and then you attach… — wishful cynic (@EvgenyGaevoy) June 6, 2024"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQTDhEaGg1T2NwSWZLYzlmbEdCNUwwb3ROWjJRUUxOVC1fQm5IdzQyMHg5OHowLUhiaGtmMGo0STBRVGJkUEhqekRSaDlua25UbUExaXlYQTJHQXhVTG92eElfZ0ZkMk9veGNoUTN1S3hCQmgzSFRPRWxNdzhqeXZTazFONHZKR0YzYmF3cXdKV0lSS2UtLWI3RQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 09 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Is Making Big Moves. 3 Reasons I'm Buying It Hand Over Fist in June. - The Motley Fool",
        "content": "Ethereum is poised for substantial growth not only in June, but for months and years to come.\n\nThe crypto world is buzzing with excitement as the market rides a wave of bullish momentum. While this surge is promising, it also makes choosing the right cryptocurrency to invest in quite challenging, as nearly everything seems to be on the rise.\n\nAmidst this flurry, one cryptocurrency stands out due to its recent developments and long-term potential: Ethereum (ETH 0.18%). Here are three compelling reasons why I'm investing heavily in Ethereum this June.\n\n1. SEC approval of a spot Ethereum ETF\n\nOne of the most compelling reasons to invest in Ethereum right now is the anticipated approval of a spot Ethereum ETF by the Securities and Exchange Commission (SEC). In January, Bitcoin (BTC 0.04%) was the first cryptocurrency to get this approval, and now there is a growing appetite among investors for exposure to the world's second most valuable cryptocurrency.\n\nThe integration of Ethereum with traditional finance through an exchange-traded fund is incredibly encouraging for many reasons. First, since ETFs can be purchased from brokerage accounts, a spot Ethereum ETF will democratize access for many traditional investors who are uncomfortable buying cryptocurrencies on crypto exchanges. This ease of access can attract a broader range of buyers and potentially drive significant price appreciation.\n\nYet, the most important cohort that the ETFs will cater to is institutional investors. Without the ETFs, institutional investors have been hesitant to purchase cryptocurrencies directly, due to regulatory and security risks. A spot Ethereum ETF approval will allow previously sidelined institutions known for their deep pockets to join in on the game.\n\n2. The tokenization of real-world assets\n\nAnother reason to be bullish on Ethereum is its potential for the tokenization of real-world assets (RWA). Tokenization involves converting physical and intangible assets into digital tokens on a blockchain, making them easier to transfer, trade, and manage. This can include anything from real estate and art to stocks and bonds.\n\nThe market for tokenized RWAs is expected to grow to $10 trillion by 2030, and for many reasons, Ethereum is positioned to capture the bulk of this value. The network's robust decentralization, strong security, and established ecosystem make it an ideal platform for institutions looking to tokenize assets.\n\nIn fact, we are already seeing the beginnings of this movement. For instance, in May, BlackRock (the world's largest asset manager) launched a tokenized fund on Ethereum, marking a significant step toward the convergence of blockchain technology and traditional financial instruments.\n\nHighlighting the transformative potential of blockchain technology, BlackRock CEO Larry Fink recently stated that tokenization will be \"the next generation for markets.\" And rest assured, Ethereum will be the blockchain of choice for this revolution.\n\n3. Ethereum's leadership in smart contracts and DeFi\n\nThe beginning stages of tokenization on Ethereum are an example of why it is one of the best cryptocurrencies to invest in. Launched in 2015, Ethereum was one of the first blockchains to introduce smart contracts, making it the first programmable cryptocurrency. This pioneering status has given Ethereum a competitive advantage in terms of experimentation and documentation, two crucial factors developers consider when choosing a blockchain to build on.\n\nOver the years, this experimentation has led to the development of several novel applications of blockchain technology, such as decentralized finance (DeFi). By using Ethereum's smart contracts, DeFi developers can build decentralized applications that allow financial services like lending, borrowing, and trading to occur without traditional intermediaries, enhancing efficiency and accessibility.\n\nTo put it simply, Ethereum is the undisputed leader in the DeFi space, with over 60% of the DeFi economy built on its blockchain. And with DeFi as one of the most prominent and innovative use cases of crypto, as DeFi grows, so should Ethereum.\n\nDeFi is just one (great) example of how Ethereum fosters innovation and experimentation. The recent advancements in tokenizing real-world assets demonstrate Ethereum's capacity to stay at the forefront of blockchain technology. Investing in Ethereum is essentially investing in the future potential of blockchain experimentation and development. As more projects and applications are built on Ethereum, its value proposition will continue to strengthen for decades to come."
    }
]