[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxOT3BuRUVabE1kWnZaaUtZZ2JZVUdNQTBJNWpPMEVhOVYyemhFNHhBVUdwbEZrcU5lTlREclhCQlhiQS0yZlZWU29NMzAxQkFrV2FjYmRqNjQ0cExjOXdSOXZjN0RVZDNFZnAtSGNSNHdDa3VCbWJ1VnlsTS1BSzc4aTJoSmxyUlptaHN2WjNRakVvNzc1blBYRTlTZVlqRVZnMWE0dkp6blo5bUx3QjhLZkhGZVJZdWd1?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 01 Feb 2024 08:00:00 GMT",
        "title": "Coinbase, Kraken Grapple With Ethereum’s Diversification Problem - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxOT3BuRUVabE1kWnZaaUtZZ2JZVUdNQTBJNWpPMEVhOVYyemhFNHhBVUdwbEZrcU5lTlREclhCQlhiQS0yZlZWU29NMzAxQkFrV2FjYmRqNjQ0cExjOXdSOXZjN0RVZDNFZnAtSGNSNHdDa3VCbWJ1VnlsTS1BSzc4aTJoSmxyUlptaHN2WjNRakVvNzc1blBYRTlTZVlqRVZnMWE0dkp6blo5bUx3QjhLZkhGZVJZdWd1?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 01 Feb 2024 08:00:00 GMT",
        "title": "Coinbase, Kraken Grapple With Ethereum’s Diversification Problem - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxOcDQ0alh0V1JWU242cFZydkVwdTFsZlZpbWxHNTV4VWlFcXU5MlZmWm8yclJLU1dJR09hRWxjOGVFOGpfMUFwSnoxRHZ0dDhjdTFYZkRjcjl3MEE3YjhuZFdhdmN2UmhfbzJUQVQ4OGVSVUdCcDgzcFNoSmhvODNabllRU3doeWI0bWdxWS1ObEdhamdRamlqQmZOYU0zN0hZVHfSAaoBQVVfeXFMTVVfX0toOXFiMkVnNmF4RkxNUDdaWEZpODFTR3oxWTVoTmROVlVJSUNHd1NjdDhxbGNTUXNFR1B3Yzd4MG5DZjBMZmpxX3F2dmRFQmtZT1dTZkNjWll3MldCblkwVlJ4d0J4eWpDWV93MmlKTFNrak1mTmtsQTZrcWMzaXFtOUlUa00tX2dzUDdmdmZ4cEVWR2kwUWdxcHpHOXRqa05EWGtJYmc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 01 Feb 2024 08:00:00 GMT",
        "title": "Ethereum’s Dencun Upgrade: Technical Overview and Potential Market Impact - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nLooking to improve your understanding of Ethereum? Take Decrypt’s Getting Started With Ethereum Course and earn your free on-chain certificate!\n\nEthereum, the leading proof-of-stake blockchain, is undergoing a significant upgrade known as Dencun, adding a new feature called “proto-danksharding.”\n\nThis article provides an explanation of the Dencun upgrade, exploring its technical components, development stages, and its potential impact on the Ethereum network's transaction capacity and cost efficiency.\n\nIntroduction to Dencun\n\nAD\n\nAD\n\nThe Dencun upgrade passed through three testnet stages in January and February ahead of the scheduled mainnet launch in March. It forms part of Ethereum's broader strategy to enhance scalability and reduce transaction costs for its users.\n\nProto-Danksharding: Core Feature of Dencun\n\nDencun introduces a concept called \"proto-danksharding\" to Ethereum. Proto-danksharding is engineered to decrease transaction costs for layer-2 blockchains and reduce data availability costs, addressing key scalability challenges. It lays the groundwork for the eventual implementation of \"danksharding,\" which aims to further extend these benefits.\n\nImpact on Transaction Capacity\n\nPost-full implementation, Dencun is expected to significantly increase Ethereum's transaction processing capacity, potentially enabling the network to handle more than 100,000 transactions per second. This enhancement is crucial for Ethereum's ability to support a growing ecosystem of decentralized applications (dapps) and users.\n\nLaunch Timeline\n\nThe Dencun upgrade's deployment process included activations on various testnets, but now the developers are confident and ready to move forward. Dencun is now set to launch on the Ethereum mainnet on March 13, according to the Ethereum Foundation, at approximately 13:55 UTC.\n\nBlobs are coming .oO Dencun is scheduled for mainnet activation at epoch 29696, occurring March 13 at 13:55 UTC. See the announcement below for client release versions and other useful info about the upgrade 🤖https://t.co/9Wa3Y5M5k4 — timbeiko.eth ☀️ (@TimBeiko) February 27, 2024\n\nAD\n\nAD\n\nDencun’s Technical Innovations\n\nOne of the notable technical innovations introduced by Dencun is 'blobs'. These are designed to lower the cost associated with rollups on the Ethereum mainnet by compressing transaction data off-chain, thereby reducing storage and processing requirements.\n\nBlobs store data temporarily, which is necessary only for short-term transaction verification, allowing for its eventual deletion to prevent network overload. Secure and efficient data handling is ensured through cryptographic commitments that detect any data alterations.\n\nMarket Impact\n\nThe introduction of the Dencun upgrade could impact on Ethereum's market value, influenced by several factors:\n\nEnhanced Network Capabilities\n\nBy significantly boosting Ethereum's transaction processing capacity and reducing costs, Dencun may attract more developers and users to the Ethereum ecosystem. This increased utility and adoption could drive demand for ETH, with a corresponding impact on its price.\n\nInvestor Perception\n\nThe successful deployment of Dencun could enhance investor confidence in Ethereum's long-term viability and its development team's ability to execute complex upgrades. This perceived reliability and forward momentum could influence Ethereum's attractiveness as an investment, potentially leading to price appreciation.\n\nSpeculation and Market Sentiment\n\nCryptocurrency markets are highly sensitive to speculation and investor sentiment. Anticipation of the Dencun upgrade's benefits, or reactions to its successful implementation, could result in short-term price volatility as traders and investors adjust their positions based on expected impacts on Ethereum's functionality and market position.\n\nThe future\n\nThe Dencun upgrade is a milestone in Ethereum's ongoing efforts to enhance its scalability and reduce transaction costs. By implementing proto-danksharding and introducing blobs, Ethereum aims to address some of the most pressing challenges faced by blockchain networks today.\n\nAs the upgrade progresses through its testnet deployments towards full implementation on the Ethereum mainnet, it could potentially result in significant increases to Ethereum's transaction processing capabilities and efficiency.\n\nAD\n\nAD\n\nEditor's note This article was written with the assistance of AI. Edited and fact-checked by Stephen Graves. The views and opinions expressed by the author are for informational purposes only and do not constitute financial, investment, or other advice.\n\nThis story was originally published on February 1, 2024 and last updated with new information on February 27."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxOZDgwSGpaRHd0MGNnV2ZRS2tFdVhaa0RRdGZBVUVMcWFWYTFGVzlVWndsSmNZNnBfbjBURWZpRlExOGRuUDFZUWZxbW00SzZtZTFSYzFYQ3UyYVB0eExlbUtEU0wxQXhYV1NRSmtKZzVOMk5DWkNPSDg4TVU3OHg2UUgwX2dQT3E5VWhYdkg0N21nejd3U2NDem5yTzJkVDZVSkE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 01 Feb 2024 08:00:00 GMT",
        "title": "Pro-Ethereum Crowd Slams Solana-based Jupiter Airdrop as ‘Absolute Trash’ - Unchained",
        "content": "Ethereum enthusiasts and Solana devotees have been trading insults over one of the key mechanisms used in the airdrop for Solana-based decentralized exchange aggregator Jupiter.\n\nJupiter’s LFG Launchpad is a portal where traders can claim their airdrop distribution and use services to facilitate the trading of newly issued tokens. In the instance of the JUP airdrop, Jupiter traders can claim their airdrop allocation of JUP in addition to acquiring more tokens at launch by presetting limit orders or dollar cost-averaging functions.\n\nWhen traders acquire more tokens through Jupiter’s LFG Launchpad, they are engaging with a single-sided liquidity pool that initially only had JUP. When the airdrop went live, traders were able to withdraw JUP from the pool and deposit USDC.\n\nRead More: Jupiter Traders Claim Whopping 545 Million JUP Tokens in First 8 Hours of Airdrop\n\nOf JUP’s 10 billion total token supply, the Jupiter team allocated 250 million JUP for the single-sided liquidity launch pool and 100 million JUP for the launchpad fees, according to a forum post written by Meow two days ago that detailed JUP’s token genesis event.\n\nThis means traders, who purchase tokens through Jupiter’s launchpad infrastructure, are acquiring JUP directly from the 250 million pot that the Jupiter team earmarked for the liquidity pool on its airdrop launch page. On Thursday, Meow said on X that Jupiter’s core members will in a week take the USDC and JUP inside the liquidity pool and place the funds into the team treasury.\n\nMoreover, 75% of the 100 million JUP allocated as LFG launchpad fees is dedicated to the coming JUP DAO and the remaining 25% is for the Jupiter core team.\n\nWhile people from the Solana ecosystem have praised Jupiter and its founder Meow for how Jupiter’s core members designed and conducted its airdrop, members of the Solana-rival pro-Ethereum camp had harsh words for the decentralized exchange aggregator.\n\nEthereum Crowd’s Takeaway\n\nCritics cite Jupiter and its founder Meow on two elements of Jupiter’s airdrop infrastructure: the team having 250 million JUP tokens to sell and the Jupiter ecosystem keeping 100 million JUP tokens fee for launching on their own launchpad.\n\nEthereum enthusiasts have raised concerns about the Jupiter team selling tokens to the public through the token launch pool, immediately following its airdrop going live. A strategic advisor for liquid staking provider Lido and Ethereum research firm Flashbots, who goes by “Hasu,” said on X that Jupiter selling the 250 million JUP tokens for stablecoin USDC is a “Truly remarkable grift” and “One for the textbooks.”\n\nIn reference to the launchpad fee of 100 million JUP tokens that will end up in the pockets of the JUP DAO and the core team, Paul Dylan-Ennis, a lecturer in the College of Business, University College Dublin who writes about Ethereum culture, said on X, “This is Solana’s ICO era of absolute trash.”\n\nSolana Crowd’s Pushback\n\nThose defending Jupiter argue that the information about the 250 million JUP tokens for the launchpad liquidity pool and the 100 million JUP tokens for the launchpad fee has been publicly accessible for months.\n\nMike Dudas, general partner at 6th Man Ventures, expressed sarcastic outrage about Jupiter’s transparency. “I, for one, am extremely outraged that @weremeow and @JupiterExchange launched their token in the exact manner they said they would after sharing the methodology in excruciating detail across numerous communication methods for multiple months,” he shared on X.\n\nRead More: Jupiter’s Airdropped Token JUP Debuts at a $878 Million Market Cap\n\nSolana enthusiasts also took the opportunity to use ad hominems to call out Ethereum loyalists. One X user in a tweet about Jupiter’s controversy said, “0xdumbass.eths are crying – thats just what they do — ignore them.” Another said, “ETH Maxis can cry all they want and make unfounded statements… having haters comes with the territory.”\n\nMeow defended Jupiter’s decision to allocate 250 million JUP tokens inside the launchpad liquidity pool. “By doing it this way, airdrop recipients get a massive pool to constantly sell into, while prospective buyers have assurance that there is a big pool to absorb big selling pressure from airdrops that will cause them immediate massive rekt,” wrote Meow on X.\n\nRivalry Going Back Years\n\nThe back-and-forth between supporters of Solana and Ethereum is the latest development in the rivalry between the two blockchain networks. For years, people have referred to Solana as the “Ethereum killer,” but Ethereum has been the incumbent leader for blockchain networks with smart contract functionality. While Solana has historically trailed Ethereum — falling further behind during the collapse of the crypto exchange FTX — in the past few months, Solana has made a comeback. It’s been successfully challenging Ethereum’s dominance in terms of several metrics such as a thriving memecoin ecosystem and trading volume on decentralized exchanges."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE5FdjloR3FlR1B4cnFsYjVqdm5rM2U0TTZ4SGZJa0YwYlBuRkJBOHIzeTBPQzBpWWpmVUM4X3A1cWxRaDBPX3FBY0VZeks3Y3c1eVNUbDNwWjUtTnZBdkR4MTdobEd4UXI0SmZ4MjNjcVRYRThnaWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 01 Feb 2024 08:00:00 GMT",
        "title": "Ethereum devs consider ‘existential’ upgrade to the EVM - Blockworks",
        "content": "If there is one Ethereum upgrade that has been ever a bridesmaid, it’s the EVM Object Format (EOF).\n\nEngaged once, with plans to be married in Shanghai, it was cast aside soon after by developers swooning for a blobular future in Proto-Danksharding.\n\nIf you have no idea what that sentence means, don’t fret. It’s a metaphor for hours of discussion over years of Ethereum all-core developer calls.\n\nFollowing Thursday’s ACD call, we still don’t know whether EOF will finally get a chance to be a bride. But at least there’s a clear proposal on the table.\n\nRead more: Dencun and Pralectra: Ethereum core devs chart an ambitious 2024\n\nDevelopers had been strongly considering EOF for the Shapella hard fork. A year ago however, after a fair bit of introspection, it was pulled in favor of keeping the focus solely on staking withdrawals.\n\nOnce Shapella had safely shipped, the candidates for inclusion in Dencun had yet again EOF among them. And again it was shelved, much to the chagrin of the feature’s two main champions, Danno Ferrin and Greg Colvin.\n\nThe consensus in April 2023 was that EOF was too big to share the stage with EIP-4844 — Proto-Danksharding — and therefore one had to go. The latter, with its potential to dramatically improve the user experience of layer-2 rollups, won out.\n\nAs a consolation, Ansgar Dietrichs at the Ethereum Foundation suggested having EOF as a focus of the next upgrade, Prague. “It’s too big to be the second place in a fork,” he said. So, it should have its own.\n\nRead more: Ethereum’s next upgrade to focus on blobs\n\nDencun, with 4844 as its “driver,” remains on track for mainnet in March as developers reported an “uneventful” hard fork of the Sepolia testnet on Tuesday.\n\n“We saw finality as well as blobs showing up exactly when we wanted them to,” said the Ethereum Foundation’s Parithosh Jayanthi.\n\nJust one testnet, Holesky, is left before mainnet, and Dencun should be given its final test on Feb. 7.\n\nPushing EOF over the finish line\n\nMost of Thursday’s call was aimed at understanding the current status of the next big feature fork. Named “Prague,” this consensus layer upgrade is titled after the location of Devcon 4. Meanwhile, “Electra” — a designation inspired by a blue-white giant star within the Taurus constellation — is the term used by execution clients to refer to the same upgrade.\n\nThe priorities for “Pectra” are slowly taking shape. Very slowly.\n\nFerrin once again made the pitch for EOF, calling it “existential to the EVM in the next couple of years.”\n\nAs a leader of the EOF implementers working group, Ferrin said developers “have been moving into ‘ship it’ mode.”\n\nEOF aims to make Ethereum smart contracts more secure, efficient and developer-friendly. It’s of particular significance to Ethereum dapp developers, who don’t typically join the biweekly all-core dev calls.\n\nThat’s left some client teams with the impression that EOF isn’t important in the past, a stigma that has been hard to shake.\n\nOn the Jan. 4 call, Dragan Rakita from the Reth client team expressed strong support for EOF, and Nethermind developer Lukasz Rozmej noted EOF is a lot easier to test than Verkle trees — the main competing focus for the next fork.\n\nRead more: Big Geth users are diversifying their clients following Nethermind bug\n\nEven Marius van der Wijden from Go Ethereum (Geth), previously an EOF-skeptic, sounded relatively on-board with the idea.\n\n“I’ve been warming up to EOF, [it’s] just not a [priority] for me,” van der Wijden said.\n\nSupport built further on the Jan. 18 call. Paradigm’s Chief Technology Officer Georgios Konstantonopolous said it was “doable by one person in a couple months.”\n\nFerrin reiterated that sentiment on the most recent call, arguing that work on EOF and Verkle is done by different engineers within client teams, and therefore committing to it wouldn’t prevent work on Verkle from progressing.\n\nBut Guillaume Ballet, a Geth developer at the Ethereum Foundation, was not yet convinced, worrying EOF could adversely affect Verkle.\n\n“If it does go first, I need to make sure we don’t ship something and paint ourselves in the corner realizing we broke something,” Ballet said.\n\nAndrew Ashikhmin, software engineer on the Erigon client team, proposed to commit to EOF with the caveat that it be tried on a Verkle testnet and that there be time carved out for collaboration between Verkle and EOF implementers in the coming weeks.\n\nIt’s a bit of a chicken-and-egg problem, as Ferrin observed.\n\n“Before we can put it in testnet in Verkle, we need it working in clients,” he said, adding that his Besu client team could have EOF up and running soon for testing purposes.\n\nBut he’s convinced it should be compatible with Verkle.\n\n“I don’t want ‘shoulds,’ I want to see it working,” Ballet retorted.\n\nEOF is left still trying to catch the bouquet, awaiting a suitor to walk it down the aisle.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    }
]