[
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxPMXgxVE02MDQ0NXFXRnZMOUdpNjRmTlFuSjVqUVl2ZkxQWmhsWXBwZTZaVW5OM0lNSFRCcVpESVNPSzZOMk5EQnpiZ0pKSDlvajhoTGc4Q085Y2ZlSDVWaDByWThEa1lHZ1VNWTkzZ3c4VlI0VzRNSlcwdmFPVHNEVldqZ0FtSkpzQXNvcExBVFk0Y2hLYkYzZEhzUENHaW9BOVJtLW9GdG5TVmJfcXpjbF9HWFBuVmhpN3lpV3VpUnJfZXNDMFIybVhLdGtFOEZGd2tDQzRPN05CNHAyaTl3VC0wbl8zcmRR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 07 Jul 2024 07:00:00 GMT",
        "title": "Spot Ethereum ETFs Could Launch In A Week Or Two, Says ETF Analyst Nate Geraci: 'How Quickly Will SEC Turn These Around?' - Benzinga",
        "content": "Nate Geraci, president of The ETF Institute, predicted that Ethereum ETH/USD-based spot exchange-traded funds could launch within the next two weeks.\n\nWhat Happened: Geraci, who actively tracks developments on cryptocurrency ETFs and shares updates on the same via his official X handle, hoped that modified S-1 filings would arrive on the SEC’s desk by Monday.\n\nHe wrote that from then on, the potential launch dates would be contingent on how soon the regulator does its verification and gives a go-ahead.\n\nSpot eth ETF S-1 amendments supposedly due tomorrow…\n\n\n\nHow quickly will SEC turn these around?\n\n\n\nAgain, main item I'm watching for is fees (which won't be required w/ these amendments).\n\n\n\nOtherwise, assume issuers gearing up for launch in next week or two. — Nate Geraci (@NateGeraci) July 7, 2024\n\nIn a dramatic turn of events, the SEC approved 19b-4 forms for applications of Ether ETFs in May, after weeks of negative sentiment. The SEC asked the ETF applicants to submit the revised S-1 registration statements, the final hurdle before the funds can start trading on U.S. exchanges, by July 8.\n\nSee Also: Crypto Billionaire Justin Sun Offers To Buy Bitcoin Off-Market From German Government To Minimize Price Impact, Lawmaker Slams Authorities For Selling\n\nWhy It Matters: Geraci's forecast was in line with his previous estimate of a mid-July launch last week.\n\nThe eventual launch of spot Ether ETFs could have significant implications for the cryptocurrency market since it would be the second such digital asset fund in the U.S. after the much-talked-about Bitcoin BTC/USD spot ETFs that debuted in January.\n\nCryptocurrency exchange Gemini estimates net inflows of up to $5 billion within the first six months of trading into Ether ETFs.\n\nPhoto Courtesy: Shutterstock\n\nPrice Action: At the time of writing, Ethereum is trading at $2,873.96, down 5.77% in the last 24 hours, according to data from Benzinga Pro.\n\nRead Next:"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxPMXgxVE02MDQ0NXFXRnZMOUdpNjRmTlFuSjVqUVl2ZkxQWmhsWXBwZTZaVW5OM0lNSFRCcVpESVNPSzZOMk5EQnpiZ0pKSDlvajhoTGc4Q085Y2ZlSDVWaDByWThEa1lHZ1VNWTkzZ3c4VlI0VzRNSlcwdmFPVHNEVldqZ0FtSkpzQXNvcExBVFk0Y2hLYkYzZEhzUENHaW9BOVJtLW9GdG5TVmJfcXpjbF9HWFBuVmhpN3lpV3VpUnJfZXNDMFIybVhLdGtFOEZGd2tDQzRPN05CNHAyaTl3VC0wbl8zcmRR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 07 Jul 2024 07:00:00 GMT",
        "title": "Spot Ethereum ETFs Could Launch In A Week Or Two, Says ETF Analyst Nate Geraci: 'How Quickly Will SEC Turn These Around?' - Benzinga",
        "content": "Nate Geraci, president of The ETF Institute, predicted that Ethereum ETH/USD-based spot exchange-traded funds could launch within the next two weeks.\n\nWhat Happened: Geraci, who actively tracks developments on cryptocurrency ETFs and shares updates on the same via his official X handle, hoped that modified S-1 filings would arrive on the SEC’s desk by Monday.\n\nHe wrote that from then on, the potential launch dates would be contingent on how soon the regulator does its verification and gives a go-ahead.\n\nSpot eth ETF S-1 amendments supposedly due tomorrow…\n\n\n\nHow quickly will SEC turn these around?\n\n\n\nAgain, main item I'm watching for is fees (which won't be required w/ these amendments).\n\n\n\nOtherwise, assume issuers gearing up for launch in next week or two. — Nate Geraci (@NateGeraci) July 7, 2024\n\nIn a dramatic turn of events, the SEC approved 19b-4 forms for applications of Ether ETFs in May, after weeks of negative sentiment. The SEC asked the ETF applicants to submit the revised S-1 registration statements, the final hurdle before the funds can start trading on U.S. exchanges, by July 8.\n\nSee Also: Crypto Billionaire Justin Sun Offers To Buy Bitcoin Off-Market From German Government To Minimize Price Impact, Lawmaker Slams Authorities For Selling\n\nWhy It Matters: Geraci's forecast was in line with his previous estimate of a mid-July launch last week.\n\nThe eventual launch of spot Ether ETFs could have significant implications for the cryptocurrency market since it would be the second such digital asset fund in the U.S. after the much-talked-about Bitcoin BTC/USD spot ETFs that debuted in January.\n\nCryptocurrency exchange Gemini estimates net inflows of up to $5 billion within the first six months of trading into Ether ETFs.\n\nPhoto Courtesy: Shutterstock\n\nPrice Action: At the time of writing, Ethereum is trading at $2,873.96, down 5.77% in the last 24 hours, according to data from Benzinga Pro.\n\nRead Next:"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxPMXgxVE02MDQ0NXFXRnZMOUdpNjRmTlFuSjVqUVl2ZkxQWmhsWXBwZTZaVW5OM0lNSFRCcVpESVNPSzZOMk5EQnpiZ0pKSDlvajhoTGc4Q085Y2ZlSDVWaDByWThEa1lHZ1VNWTkzZ3c4VlI0VzRNSlcwdmFPVHNEVldqZ0FtSkpzQXNvcExBVFk0Y2hLYkYzZEhzUENHaW9BOVJtLW9GdG5TVmJfcXpjbF9HWFBuVmhpN3lpV3VpUnJfZXNDMFIybVhLdGtFOEZGd2tDQzRPN05CNHAyaTl3VC0wbl8zcmRR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 07 Jul 2024 07:00:00 GMT",
        "title": "Spot Ethereum ETFs Could Launch In A Week Or Two, Says ETF Analyst Nate Geraci: 'How Quickly Will SEC Turn These Around?' - Benzinga",
        "content": "Nate Geraci, president of The ETF Institute, predicted that Ethereum ETH/USD-based spot exchange-traded funds could launch within the next two weeks.\n\nWhat Happened: Geraci, who actively tracks developments on cryptocurrency ETFs and shares updates on the same via his official X handle, hoped that modified S-1 filings would arrive on the SEC’s desk by Monday.\n\nHe wrote that from then on, the potential launch dates would be contingent on how soon the regulator does its verification and gives a go-ahead.\n\nSpot eth ETF S-1 amendments supposedly due tomorrow…\n\n\n\nHow quickly will SEC turn these around?\n\n\n\nAgain, main item I'm watching for is fees (which won't be required w/ these amendments).\n\n\n\nOtherwise, assume issuers gearing up for launch in next week or two. — Nate Geraci (@NateGeraci) July 7, 2024\n\nIn a dramatic turn of events, the SEC approved 19b-4 forms for applications of Ether ETFs in May, after weeks of negative sentiment. The SEC asked the ETF applicants to submit the revised S-1 registration statements, the final hurdle before the funds can start trading on U.S. exchanges, by July 8.\n\nSee Also: Crypto Billionaire Justin Sun Offers To Buy Bitcoin Off-Market From German Government To Minimize Price Impact, Lawmaker Slams Authorities For Selling\n\nWhy It Matters: Geraci's forecast was in line with his previous estimate of a mid-July launch last week.\n\nThe eventual launch of spot Ether ETFs could have significant implications for the cryptocurrency market since it would be the second such digital asset fund in the U.S. after the much-talked-about Bitcoin BTC/USD spot ETFs that debuted in January.\n\nCryptocurrency exchange Gemini estimates net inflows of up to $5 billion within the first six months of trading into Ether ETFs.\n\nPhoto Courtesy: Shutterstock\n\nPrice Action: At the time of writing, Ethereum is trading at $2,873.96, down 5.77% in the last 24 hours, according to data from Benzinga Pro.\n\nRead Next:"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxNaXoyYUV2SnFONm5haUVWWDdwT2hwWVdiQ05haC1tb0NYX2F3UVctSE1maUxMc1dYWDVIREctOVhnaVh0MU1YTFhPdjJuSk1EdHVmNzktUXJ5V2wzdlNPdjVreGRibWNlbnFMVUV3dmN4a2JldEtDNjFIc2lUbVJNdXdOV19kb21wSUt1MDBUbnhEU2t4VmppZkhSaDVEUXNrYXVtWTlNVWtFS1U?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 07 Jul 2024 07:00:00 GMT",
        "title": "Crypto: Ethereum Drops Despite Growing Interest in ETFs in the United States! - Cointribune EN",
        "content": "Sun 07 Jul 2024 ▪ 3 min read ▪ by Eddy S.\n\nA recent survey highlights a fascinating trend: Americans’ interest in Ethereum-based exchange-traded funds (ETFs) is on the rise! If the SEC approved the launch of an Ethereum ETF, nearly a quarter of voters would consider investing in this crypto.\n\nEthereum ETF captures the attention of Americans!\n\nThe launch of an Ethereum ETF in the United States could boost investments in digital assets. Although the future of these ETFs is uncertain, their introduction could accelerate the maturity of the crypto market and its widespread adoption.\n\nThe arrival of an Ethereum ETF could broaden the interest in cryptocurrencies beyond Bitcoin. In the crypto market, anticipation is rising around the launch of the Ethereum ETF, likely scheduled for July 15. This crucial step could trigger a wave of investments and mark a historic milestone in the adoption of cryptocurrencies. Experts predict a massive influx of capital, with estimates reaching up to $15 billion in the first few months. If the SEC gives its green light, this event could not only validate Ethereum as a major investment asset but also open the door to a new era of blockchain-based financial products.\n\nETH crypto in free fall!\n\nCrypto is gaining importance among American voters. Since the beginning of the year, a third of likely voters are more receptive to crypto, and 47% believe it will eventually be part of their investment portfolio.\n\nDespite the excitement generated by the imminent launch of Ethereum ETFs, ETH crypto is currently experiencing a significant drop of 1.72% in the last 24 hours and is trading around $3,014. After losing a key support, Ethereum risks falling even further, with short-term forecasts seeing a drop to $2,900.\n\nThe Ethereum ETF represents a major opportunity for the crypto market, attracting the attention of traditional investors and voters. With growing interest in emerging technologies and the anticipation of clear regulation, the future of Ethereum ETFs is promising. It could mark a major turning point in digital investment in the United States.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQOTk1ZTJ2LUE4SmhWRE5aUmxyNW1VREhfdXJORTZZdGhXOGxSSlhBaE41R0JVdHJKSTVNS05scnRwRmd1ZEhZcThUMnRVNEU1S0QtZjktMXcyNklJZWVlNnV4d0RlVTZ1SHZHZjkwdWt0WDdnekliaWdyRC1BeFU2NHU1UV9tN2l0S0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 07 Jul 2024 07:00:00 GMT",
        "title": "Solana vs Ethereum: the clash between titans - The Cryptonomist",
        "content": "In this article, we compare two leading blockchains in the cryptographic sector: Solana vs Ethereum.\n\nBoth have very developed DeFi ecosystems and a wide range of successful applications built within them.\n\nThe two networks work together to create the most thriving web3 environment possible, with the goal of becoming the premier layer of the on-chain future.\n\nThe challenge is also played out on the token level, with ETH and SOL trying to offer the best return on the market.\n\nLet’s see everything in detail below.\n\nSolana vs Ethereum: the main differences on the technological level\n\nWe are talking about one of the most heated and intense clashes on the technological front of the last decade, as well as the most discussed in the crypto landscape: the Solana vs Ethereum war.\n\nEveryone knows by now that these two blockchains have been in conflict for years to win the title of dominant web3 infrastructure.\n\nIn fact, however, they are quite different in many aspects: Ethereum is an EVM network built with the programming language Solidity while Solana is SVM built with C, C++ and Rust.\n\nThis alone is enough to distinguish two poles in which the development of decentralized applications takes place according to different coding rules.\n\nFurthermore, the concept of “account” also changes significantly depending on the context, whether it is used in an Ethereum or Solana environment.\n\nIn fact, on Ethereum the term account is used to describe an entity that owns ether (ETH) and can initiate transactions. It is classified as follows:\n\nEOA (Externally Owned Account): account in possession of a private key, conceptually similar to a wallet;\n\nCA (Contract Account): account for smart contracts not in possession of a private key.\n\nSimplifying, we can say that EOA does not have storage space and therefore cannot be used as a contract for carrying out operations (except for exceptions with ERC-4337).\n\nThe CA, on the other hand, is simply a software program executable by EVM with a code (contract) that distinguishes it. An EOA can therefore execute a call through CA but not vice versa!\n\nOn the opposite front of Solana, however, the concept of “account” is broader and refers to an entity that can always store and save data.\n\nThe state of transactions is therefore saved using accounts in a manner similar to what happens in operating systems like Linux. It is worth noting that Solana natively supports the account-abstraction function, allowing self-calling between programs.\n\nThe accounts in Solana are of two types:\n\nExecutable account (program account): smart contracts called “programs” that store the code;\n\nNon-executable account (data account): entities that can receive tokens or data but cannot execute code.\n\nBelow is a map of the main technical differences.\n\nTwo different approaches for the development of DeFi environments\n\nDescending to a less technical level, we notice that Ethereum and Solana use different marketing approaches for their respective DeFi environments.\n\nAlthough both chains are intent on attracting the widest possible base of capital and users, they focus on different segments.\n\nIn fact, Ethereum presents a more “institutional” character with its main values oriented towards the security of the network and decentralization.\n\nSolana, on the other hand, has a more “smart” personality, oriented towards the scalability of operations and cryptographic efficiency.\n\nThey follow the limits of both blockchains on their own: for Ethereum scalability, for Solana decentralization.\n\nLIVE NOW — Ethereum vs. Solana\n\n\n\nThat’s the debate we’re having today. On Ethereum’s side, we have @Ethereum Researcher @drakefjustin, and on the @Solana side, we have Solana’s Co-Founder @aeyakovenko\n\n\n\nThey give us the good, the bad, and the ugly of each other’s blockchain,… pic.twitter.com/MlCWd4NtOT — Bankless (@BanklessHQ) June 3, 2024\n\nEthereum presents a TVL of 59 billion dollars, much greater than Solana’s 3.5 billion dollars. For this reason, the Foundation uses a softer communication with the public and with less intention to create engagement.\n\nSolana, on the other hand, focuses entirely on innovation, user experience, and transaction throughput. The latest innovations launched, such as the Saga smartphone and the Blinks, speak volumes about the approach the network uses with retail.\n\nWe can say that Ethereum is a less performant blockchain, at times less “convenient”, but more secure and reliable.\n\nSolana is much more “fun” and efficient to use, but less decentralized based on a few clients and less secure.\n\nIf you are high-net-worth individuals with a moderate risk exposure, you will surely appreciate Ethereum more.\n\nIf you are young, fearless, and have a limited budget, you will probably find the features of Solana more appealing.\n\nThe main web3 dapps of the two ecosystems\n\nThe war between the two titans Ethereum and Solana continues uniquely in the creation of the best decentralized web3 applications.\n\nOn Ethereum the largest dapp in terms of TVL is the liquid staking platform Lido: it alone attracts almost 10 times the entire capital absorbed by Solana.\n\nNext, we find successful dapps such as EigenLayer, Aave, Maker, Ether.fi, Uniswap, RocketPool, Ethena, and Pendle.\n\nIn the suite of protocols of Solana, we find Jito as the top-ranked, with a TVL of 1.74 billion dollars. Then the most used applications are Marinade, Kamino, Sanctum, Jupiter, Marginfi, Drift, BlazeStake, Meteora, and Solend.\n\nThe majority of Ethereum dapps are integrated with various layer-2, ensuring greater scalability. At the same time, the differentiation of blockspace requests leads to a fragmentation of liquidity, which is often inconvenient.\n\nFor this reason, Ethereum is often criticized by its detractors because as a Settlement Layer it has to rely on external solutions to grow.\n\nOn the other hand, the competitor is criticized for the absence of a flourishing and secure DeFi ecosystem: almost all the dapps on Ethereum surpass the total TVL of Solana!\n\nIn any case, it is worth noting how Solana is producing very interesting products, such as the recent platform pump.fun.\n\nProposed as a launchpad for memecoin, in a short time it managed to become the most profitable dapp in the entire cryptographic ecosystem.\n\nOn July 1st, it recorded record fees of 2 million dollars, even surpassing the entire revenue of the whole Ethereum blockchain.\n\nChapeau.\n\n🚨Breaking Big: @pumpdotfun Becomes No. 1 Crypto App Across All Chainshttps://t.co/VS31GZ2FXq has surged to the top spot as the leading crypto app, surpassing Ethereum with a staggering $1.99M in revenue generated over the last 24 hours. pic.twitter.com/59euyqCRWp — SolanaFloor (@SolanaFloor) July 2, 2024\n\nA speculative war: Solana with SOL vs Ethereum with ETH\n\nThe Solana vs Ethereum challenge can only conclude with a focus on their respective gas tokens SOL and ETH.\n\nIt is clear that the better these cryptocurrencies perform on a speculative level, the more users are interested in purchasing them and becoming part of the community.\n\nThe metric of active addresses and the volume of transactions, in fact, largely depends on the evolution of the price of SOL and ETH.\n\nBoth networks are interested in pushing the price of their respective coins upwards, both for a boost in on-chain metrics and for obvious economic reasons.\n\nIn 2024 the two coins recorded similar trends, with a growth of about 50% from the January quotations. SOL, however, grew at a faster pace in the last quarter of 2023, attracting more new buyers compared to what Ethereum did.\n\n>>Solana Vs Ethereum in 2024\n\n\n\nSolana is Winning by Huge Data Growth Margin\n\n\n\nGrowth Metrics(%):\n\n\n\n– Price\n\n– Stablecoin Volume/Marketcap\n\n– TVL/Fees\n\n– NFT Trading Volume\n\n– Daily Transactions/ Daily Active Addresses\n\n\n\nEthereum Growth Metrics(%):\n\n\n\n– DEX Trading Volume\n\n– Daily Volume pic.twitter.com/Q8GV7mQ9Jy — hitesh.eth (@hmalviya9) May 30, 2024\n\nAt the moment both SOL and ETH are close to their respective all-time highs, with the latter seeming slightly advantaged.\n\nThe evolution of the prices of the two coins from now until the end of the bull market will be essential to bring more adoption to blockchain technology.\n\nPlaying a decisive role in the coming months will also be the upcoming inauguration of the spot ETFs for the two cryptocurrencies. First that of Ethereum, then (perhaps) that of Solana, will contribute to attracting more capital inflows.\n\nAt stake is the dominance as a settlement layer for the major financial operations of the cryptographic world.\n\nIt is not certain, however, that in the future only one network between Solana and Ethereum will survive, and indeed a coexistence scenario is much more likely.\n\nObviously, there will be a network that will have a larger market share but without precluding the existence of the other\n\nETH vs SOL\n\n\n\nDONT BE A MAXI.\n\n\n\nThe world is gonna be multi-chains!\n\n\n\nStop wasting time arguing about which one is better, and start learning about all the benefits and use cases each bring.\n\n\n\nMore ETFs will grow the pie!\n\nETF products will bring attention and money into the space.… pic.twitter.com/MdtTDdCf7X — Gun (Kingbund.eth) (@KingBund) July 2, 2024\n\nAlthough in a perspective of coexistence, the dispute between the maximalists will continue for many years to come.\n\nAs we can learn from the historical Pepsi vs Coca Cola discount that has been ongoing for over 100 years, the fight for supremacy is always around the corner."
    }
]