[
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxQbkplaE5oYWhnUi0wUGViV2VxdGlzcGdlT2c0UWl2T2llYkg4aF9fVWI2MThkUUJjTXhPcF9adXVIY3ZGNDQya2hQcXZnZnNTTkJucGJQZXVLZ1FoMXdJNmNMZVcxRlE2dlp5T2llLVA0Tl9UUzhzaEZFbWFYbVpqSDNaTnU4Q0h0a2lhMl96QTFJbmYzUkF0YVFUNGtKZzZnaWtnMGZMa1JGYW1aX2oyMHd1Z2ptVHRCaGNIcXhDMDNmd0dj?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Nov 2023 08:00:00 GMT",
        "title": "Layer-2 network Blast becomes third-largest holder of staked Ethereum amid pyramid scheme allegations - CryptoSlate",
        "content": "Blast, a newly introduced Ethereum (ETH) layer-2 network promising “native yield” on ETH and stablecoin holdings, swiftly secured the position of the third-largest holder of staked ether in just three days post-launch, according to on-chain data.\n\nEtherscan data indicates that the platform has amassed over 140,000 staked Ethereum, valued at approximately $286 million, utilizing the liquid staking protocol Lido since its inception on Nov. 20. This accumulation represents roughly 1.5% of the total staked Ether volume.\n\nDebank’s data further shows that the protocol’s multi-sig wallet currently holds assets worth more than $335 million, comprising Lido’s staked Ether and MakerDAO’s stablecoin DAI.\n\nControversy Surrounds Blast’s Pyramid-Like System\n\nHowever, the rapid growth of Blast over the past three days has triggered strong criticism within the crypto community due to its pyramid-like Blast points system, which rewards early users based on the number of users they refer.\n\nDetails on the project’s website outline that users receive an additional 16% of points when their referrals bring in more participants and an extra 8% if the subsequent level brings in additional users.\n\nAn intriguing aspect is that the inflows into the protocol remain one-directional, with no option for withdrawal until its slated launch in February next year.\n\nSimon Dedic, the CEO and managing partner of crypto investment firm MoonRock Capital, stated that Blast’s unique selling point is its “Ponzi airdrop farming.” He added:\n\n“[To be honest] Blast_L2 is the perfect illustration of why non-crypto people hate Web3. [It is not]a technical advancement to any of the other L2s, nor does it offer any exciting applications to use on top of it. While disabling withdrawals.”\n\nBesides its Ponzi-like structure, attention has been drawn to Blast’s multi-sig wallet.\n\nPolygon engineer Jarrod Watts believes the protocol needs 3 out of 5 signatories to authorize suspicious actions. Watts highlighted that the addresses associated are new and have unknown identities.\n\nHowever, despite the inherent risks, Watts doubts the possibility of fund theft.\n\nSimilarly, Cos, the founder of SlowMist, noted that Blast operates as an upgradeable contract with a 3/5 multi-signature setup and lacks a time lock.\n\nMentioned in this article"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxQbkplaE5oYWhnUi0wUGViV2VxdGlzcGdlT2c0UWl2T2llYkg4aF9fVWI2MThkUUJjTXhPcF9adXVIY3ZGNDQya2hQcXZnZnNTTkJucGJQZXVLZ1FoMXdJNmNMZVcxRlE2dlp5T2llLVA0Tl9UUzhzaEZFbWFYbVpqSDNaTnU4Q0h0a2lhMl96QTFJbmYzUkF0YVFUNGtKZzZnaWtnMGZMa1JGYW1aX2oyMHd1Z2ptVHRCaGNIcXhDMDNmd0dj?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Nov 2023 08:00:00 GMT",
        "title": "Layer-2 network Blast becomes third-largest holder of staked Ethereum amid pyramid scheme allegations - CryptoSlate",
        "content": "Blast, a newly introduced Ethereum (ETH) layer-2 network promising “native yield” on ETH and stablecoin holdings, swiftly secured the position of the third-largest holder of staked ether in just three days post-launch, according to on-chain data.\n\nEtherscan data indicates that the platform has amassed over 140,000 staked Ethereum, valued at approximately $286 million, utilizing the liquid staking protocol Lido since its inception on Nov. 20. This accumulation represents roughly 1.5% of the total staked Ether volume.\n\nDebank’s data further shows that the protocol’s multi-sig wallet currently holds assets worth more than $335 million, comprising Lido’s staked Ether and MakerDAO’s stablecoin DAI.\n\nControversy Surrounds Blast’s Pyramid-Like System\n\nHowever, the rapid growth of Blast over the past three days has triggered strong criticism within the crypto community due to its pyramid-like Blast points system, which rewards early users based on the number of users they refer.\n\nDetails on the project’s website outline that users receive an additional 16% of points when their referrals bring in more participants and an extra 8% if the subsequent level brings in additional users.\n\nAn intriguing aspect is that the inflows into the protocol remain one-directional, with no option for withdrawal until its slated launch in February next year.\n\nSimon Dedic, the CEO and managing partner of crypto investment firm MoonRock Capital, stated that Blast’s unique selling point is its “Ponzi airdrop farming.” He added:\n\n“[To be honest] Blast_L2 is the perfect illustration of why non-crypto people hate Web3. [It is not]a technical advancement to any of the other L2s, nor does it offer any exciting applications to use on top of it. While disabling withdrawals.”\n\nBesides its Ponzi-like structure, attention has been drawn to Blast’s multi-sig wallet.\n\nPolygon engineer Jarrod Watts believes the protocol needs 3 out of 5 signatories to authorize suspicious actions. Watts highlighted that the addresses associated are new and have unknown identities.\n\nHowever, despite the inherent risks, Watts doubts the possibility of fund theft.\n\nSimilarly, Cos, the founder of SlowMist, noted that Blast operates as an upgradeable contract with a 3/5 multi-signature setup and lacks a time lock.\n\nMentioned in this article"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiWEFVX3lxTFBHSDRxQmRPZ0hiVklYWUpWRUVHZWFPR0VKYzF3Zl83OFRVTlBlNXF2ZHVXb2VGOXNUeGxoZ3pTNUFCaEh1ZHpCSmJmZ1pCVkxlRzJDUEJNaUo?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Nov 2023 08:00:00 GMT",
        "title": "Blast TVL hits $390 million, with no product - Blockworks",
        "content": "In just a few days, the amount of value sent into the Blast deposit contract on Ethereum has increased by an order of magnitude to $390 million.\n\nA smart contract, advertised as a “bridge” for a yet-to-be-developed optimistic rollup, has received about $340 million in ether and $50 million in stablecoins since launching Monday.\n\nThe contract is controlled by a Safe 5-key multisig where 3 keys are required to execute transactions. However, one of the 5 keys has no transaction history, and the other 4 show initial ether deposits from the same Ethereum account.\n\nThere is no way for an outside observer to know whether the five keys were generated by five independent entities or people.\n\nA thread on X from Blast claims they are using best practices, and that the signers “are deeply technical engineers who have experience with high stakes applications ranging from financial applications to smart contracts.”\n\nLoading Tweet..\n\nDevelopment of the project, backed by VC firms Paradigm and Standard Crypto, along with a slew of influential crypto personalities and traders, is being spearheaded by Blur co-founder, Tieshun Roquerre who goes by the pseudonym “Pacman.”\n\nThe former Thiel Fellow and MIT dropout previously told Blockworks that the project uses “the same security model” as other L2s specifying Optimism, Polygon, and Arbitrum.\n\nHowever, each of these networks, while not fully trustless, has additional security components besides a multisig. For instance, Arbitrum has a publicly elected “security council” with 12 members, only two of which are on the Offchain Labs development team.\n\nBlockworks contacted Paradigm and Standard Crypto and Pacman for clarification.\n\nDeposited ether cannot be withdrawn until February 2024, when the development team must modify the deposit contract, presumably alongside the launch of an actual rollup.\n\nEthereum layer-2 tracker L2BEAT lists the project in it’s “Upcoming” section, but were it active today it would rank between zkSync Era, which launched mainnet in October 2022, and dYdX V3 the StarkEx rollup that has been active since April 2021.\n\nActive Ethereum L2s; Source; L2BEAT\n\nOne depositor tossed 10,000 ETH, worth $21 million at the time, into the contract in a single transaction.\n\n“Collective brain of Crypto Twitter” weighs in\n\nMany crypto observers have expressed surprise at Blast’s rapid growth in the face of uncertain risks.\n\nBlast has touted on its X account that ether staking represents “risk-free return,” a view which Lido DAO members, including Blast investors, have expressed lacks nuance.\n\nLoading Tweet..\n\nOrlando Cosme, founding attorney of OC Advisory, criticized the project, calling it an “onchain hedge fund” that is “proving regulators’ point.”\n\nLoading Tweet..\n\nA straw poll conducted by Tangent Ventures founder Jason Choi, seeking to tap “the collective brain of CT,” has garnered over 2,500 respondents. The unscientific opinion poll puts the odds of an exploit of the deposited crypto assets between now and February at 64%.\n\nLoading Tweet..\n\nOffchain Labs’ Chief Strategy Officer, A.J. Warner, noted Thursday in an X post that the Arbitrum development firm had considered a similar design but opted not to pursue it.\n\nLoading Tweet..\n\nVery few of the listed investors have publicly addressed criticisms of the project to date, though some claim to have privately communicated concerns.\n\nDovey Wan, a Blast investor and Founder of Primitive.Ventures, promoted the project’s success attracting capital as having “pre-bull energy,” and “strong pumpanomics,” while hand waving away concerns over the security of funds, by acknowledging “it’s just a multisig managed by 5 [profile pics] online.”\n\nWan urged crypto users to “bridge for culture bridge for fun bridge for what you can afford to lose it all,” alongside the vacuous caveat that the promotion was “no FA DYOR” — not financial advice, do your own research.\n\nUpdated Nov. 24, 2023 at 12:37 pm ET with update from Blast on multisig."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiWEFVX3lxTFBHSDRxQmRPZ0hiVklYWUpWRUVHZWFPR0VKYzF3Zl83OFRVTlBlNXF2ZHVXb2VGOXNUeGxoZ3pTNUFCaEh1ZHpCSmJmZ1pCVkxlRzJDUEJNaUo?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Nov 2023 08:00:00 GMT",
        "title": "Blast TVL hits $390 million, with no product - Blockworks",
        "content": "In just a few days, the amount of value sent into the Blast deposit contract on Ethereum has increased by an order of magnitude to $390 million.\n\nA smart contract, advertised as a “bridge” for a yet-to-be-developed optimistic rollup, has received about $340 million in ether and $50 million in stablecoins since launching Monday.\n\nThe contract is controlled by a Safe 5-key multisig where 3 keys are required to execute transactions. However, one of the 5 keys has no transaction history, and the other 4 show initial ether deposits from the same Ethereum account.\n\nThere is no way for an outside observer to know whether the five keys were generated by five independent entities or people.\n\nA thread on X from Blast claims they are using best practices, and that the signers “are deeply technical engineers who have experience with high stakes applications ranging from financial applications to smart contracts.”\n\nLoading Tweet..\n\nDevelopment of the project, backed by VC firms Paradigm and Standard Crypto, along with a slew of influential crypto personalities and traders, is being spearheaded by Blur co-founder, Tieshun Roquerre who goes by the pseudonym “Pacman.”\n\nThe former Thiel Fellow and MIT dropout previously told Blockworks that the project uses “the same security model” as other L2s specifying Optimism, Polygon, and Arbitrum.\n\nHowever, each of these networks, while not fully trustless, has additional security components besides a multisig. For instance, Arbitrum has a publicly elected “security council” with 12 members, only two of which are on the Offchain Labs development team.\n\nBlockworks contacted Paradigm and Standard Crypto and Pacman for clarification.\n\nDeposited ether cannot be withdrawn until February 2024, when the development team must modify the deposit contract, presumably alongside the launch of an actual rollup.\n\nEthereum layer-2 tracker L2BEAT lists the project in it’s “Upcoming” section, but were it active today it would rank between zkSync Era, which launched mainnet in October 2022, and dYdX V3 the StarkEx rollup that has been active since April 2021.\n\nActive Ethereum L2s; Source; L2BEAT\n\nOne depositor tossed 10,000 ETH, worth $21 million at the time, into the contract in a single transaction.\n\n“Collective brain of Crypto Twitter” weighs in\n\nMany crypto observers have expressed surprise at Blast’s rapid growth in the face of uncertain risks.\n\nBlast has touted on its X account that ether staking represents “risk-free return,” a view which Lido DAO members, including Blast investors, have expressed lacks nuance.\n\nLoading Tweet..\n\nOrlando Cosme, founding attorney of OC Advisory, criticized the project, calling it an “onchain hedge fund” that is “proving regulators’ point.”\n\nLoading Tweet..\n\nA straw poll conducted by Tangent Ventures founder Jason Choi, seeking to tap “the collective brain of CT,” has garnered over 2,500 respondents. The unscientific opinion poll puts the odds of an exploit of the deposited crypto assets between now and February at 64%.\n\nLoading Tweet..\n\nOffchain Labs’ Chief Strategy Officer, A.J. Warner, noted Thursday in an X post that the Arbitrum development firm had considered a similar design but opted not to pursue it.\n\nLoading Tweet..\n\nVery few of the listed investors have publicly addressed criticisms of the project to date, though some claim to have privately communicated concerns.\n\nDovey Wan, a Blast investor and Founder of Primitive.Ventures, promoted the project’s success attracting capital as having “pre-bull energy,” and “strong pumpanomics,” while hand waving away concerns over the security of funds, by acknowledging “it’s just a multisig managed by 5 [profile pics] online.”\n\nWan urged crypto users to “bridge for culture bridge for fun bridge for what you can afford to lose it all,” alongside the vacuous caveat that the promotion was “no FA DYOR” — not financial advice, do your own research.\n\nUpdated Nov. 24, 2023 at 12:37 pm ET with update from Blast on multisig."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxNSF95Y3l6TWtmdHBCNUd3cF9qeEYtUE0wMGhIVlltVUE4ZHB4TTRRcERkR2FvY0FFMzBjUWRCSy1VdHJEUC1NLWM1RGRJUHNpNVFKQlBuSy1Cdk16aGpmbkpoN2JUaWRSOWRqckx5dFFmYU1WYmIxcFlXNTRWNGtQNnVpQkk4aERIRXZxeWtqcUhIa0VLVDVjVXlGQzV2bW56Y3NxQ3FhREpyNWV0VGxHelhDdTdSQUhaaVBORFV5bFlLMDNUTWVHalFtUll2NndHeWdxTVVsTmE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Nov 2023 15:02:31 GMT",
        "title": "Bitcoin's (BTC) Potential Surge to $220K by Next Halving; New AI Crypto Could Mirror Ethereum's (ETH) Success - NewsBTC",
        "content": "The Bitcoin (BTC) block subsidy halving is an event investors eagerly anticipate, occurring roughly every four years (210,000 blocks). Many analysts predict that following the halving, the price of BTC could surge to $220,000 because Bitcoin’s supply would have been reduced by half. Meanwhile, InQubeta (QUBE), a cryptocurrency focused on artificial intelligence, appears to follow Ethereum’s (ETH) successful model.\n\nFor a few months now, InQubeta has been growing traction and value among investors, cementing its standing as the best crypto investment for profitable returns. Since the QUBE presale has been remarkably successful in its early stages, analysts now predict that QUBE could mirror Ethereum’s success. Let’s explore InQubeta’s potential to match Ethereum’s success and the expectations of Bitcoin’s price to surge on its next halving.\n\nInQubeta’s (QUBE) Outstanding Performance Points at AI Crypto Dominance\n\nThe QUBE token has increased steadily since InQubeta launched its presale. The tokens’ value has increased throughout its first five stages, from $0.007 to $0.0161, demonstrating why InQubeta is the best crypto investment for substantial gains. The project’s early success in securing investor confidence indicates that it could perform as well as Ethereum in the crypto market. Growing presale investors have made it possible for the project to sell more than 527 million tokens so far, amassing over $5.2 million, putting it on track to become the best DeFi crypto.\n\nInQubeta aims to make investments in artificial intelligence (AI) more accessible and democratic. The idea is to enable fractional investment through QUBE in AI startups using smart contracts and the blockchain. Investors can help AI startups develop and succeed by using this tactic, regardless of their financial status.\n\nPopular NFTs (non-fungible tokens) can also be minted by AI startups and sold on the NFT marketplace to QUBE holders. The NFT marketplace opens doors for investors and enables entrepreneurs to list their popular NFTs in front of a large audience. Given that these NFTs are fractionalized, they are inexpensive, and investors will make money off of them as these startups grow.\n\nQUBE is a deflationary token that can hold its value over time. Token holders, at the same time, have a voice in the decisions and development of the platform. There is also a 12-week vesting period for QUBE. Through vesting, InQubeta releases tokens progressively, potentially fostering confidence as the best DeFi crypto and boosting QUBE prices.\n\nBitcoin (BTC) Speculated to Reach $220,000 by the Next Halving Secures Investors’ Optimism\n\nBitcoin halving is a quadrennial event whereby the amount of Bitcoin given to miners is cut in half to fuel the coin’s scarcity. This halving causes the value of BTC to rise over time, making it one of the most sought-after cryptocurrencies.\n\nThe Bitcoin Archive predicts that in 18 months, Bitcoin will likely trade at $220,000. Its prediction is based on the fact that, twelve months after the last halving, BTC’s price surged six times its trading value.\n\nEthereum (ETH) Empowers Innovation Through its Proof-of-Stake Mechanism\n\nAbout a year has passed since Ethereum completed the “Merge,” which changed the blockchain’s consensus process from one based on proof-of-work (PoW) to proof-of-stake (PoS). Users could earn a passive revenue stream, and the Ethereum network’s efficiency was significantly increased by staking their ETH to secure the network. This has been viewed as a positive development for the ETH network overall. Many users have already staked twenty percent of all circulating Ether.\n\nConclusion\n\nAs the crypto market anticipates Bitcoin’s potential surge to $220,000 by the next halving, InQubeta has emerged as a contender that could mirror the success of Ethereum. InQubeta is a high-growth investment opportunity that has the potential to perform as promised, if not better, considering the remarkable performance of the presale. It is still cheap and it could yield massive returns when it launches. Following QUBE’s exchange listing and the start of InQubeta’s widespread adoption, a buying frenzy might push the cryptocurrency’s value to all-time highs.\n\nVisit InQubeta Presale\n\nJoin The InQubeta Communities\n\nDisclaimer: This is a paid release. The statements, views and opinions expressed in this column are solely those of the content provider and do not necessarily represent those of NewsBTC. NewsBTC does not guarantee the accuracy or timeliness of information available in such content. Do your research and invest at your own risk."
    }
]