[
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiygFBVV95cUxPZlA3SXVIRjdDWldxckVTMmcwQlZ2XzY3ODhLeWl1OEtsU1lOZlJEYmNpeFBXNTIwWENObHByTVA4UDlRVjBFa3dmYnNZa3lsOVpRYnJYMEVtUXVhdW9YeUdYVENhaXJFODMyT3A3SzZhR2dXZEZNdjhZUm9GRGZoZG9Da1EtcTl3NF85aHhKYm56N2VOOWo0VGdfRGJiYmNUSWJjSHNsUXo4Y2pGXzAySFZ1WThRVThtTTEweV94Q3VtNjViamVLdHVn0gHPAUFVX3lxTE9tajdJaFMwdWxkZ1BvS3liSGFLNXNKdE5MX2FWYkhOWWlBOEh0VThiSEV4WFJHU09XSkJRUUEzTUFRdGpHUzliTlp3TmhVNUZvS21zT0d4cHBhSWtVb3hYNnlMaEQzSE55VVUyb3FYdTNUeE9fcjd3M0NQSHFFMG5SVy01SVZJcUYta21FSXZqR0pZNmttOFNtcXgzVWpMY1RKUHFPeEIzYkxvaDVjdFpDRllweUlWc19YWmlzX3NhRkx3eVZUaXd3OUdCak9kVQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Nov 2023 08:00:00 GMT",
        "title": "Near Foundation Joins Celestia in Race to Provide 'Data Availability' for Ethereum Rollups - CoinDesk",
        "content": "Similar to Celestia, a new network that launched last week along with a buzzy airdrop of new TIA tokens, NEAR DA aims to provide an alternate venue that could handle data produced by a fast-growing network or auxiliary blockchains or \"layer-2 networks\" working atop Ethereum. Another competitor, Avail, plans to launch in early 2024 and is currently running various test networks."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxQLU5qUzVTaDFfWEtsdVFESjJQb3dQekpta2xhZlA1Ym9qTDFCS3ZURjNhWm1sREN1QmQzVnZ6RTZTT1dqR1lYQmpwSXhMaWtwc2FtMVFJVmotZWx4QmV0VklYSDZsZUZCWm9rQV9hODdXUkFhcXRlV2RZTk5sbmdGX0xmVnAySERz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Nov 2023 08:00:00 GMT",
        "title": "ETH Supply Trends Down After Two Months Of Inflation - Yahoo Finance",
        "content": "The supply of Ether is again flipping deflationary after users a sharp uptick in demand for Ethereum blockspace.\n\nData from Ultra Sound Money shows that Ethereum’s burn-rate offset the issuance of new coins by 1,960 ETH ($3.7M) over the past seven days. Uniswap traders led the charge by driving 13.3% of burned ETH, followed by simple token transfers with 6%, and the Tether stablecoin protocol with 5%.\n\nBanana Gun, a Telegram trading bot, also made up a significant share of on-chain activity, pushing 3.5% of burned ETH.\n\nThe recent increase in burn-rate comes after Ethereum’s supply turned inflationary for the first time in 2023 during September and October. Ether’s supply grew by 54,000 coins between the start of September and November as on-chain activity receded.\n\nFor comparison, the network last quoted users 40 gwei in gas fees for transaction execution, up more than 300% since dropping below 10 gwei in September.\n\nEthereum’s burn mechanism has removed more than 260,000 ETH from circulation this year so far.\n\nETH Supply Trends Down After Two Months Of Inflation\n\nTo continue reading this as well as other DeFi and Web3 news, visit us at thedefiant.io"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxOTWFfQXJVNVV2UkoyZ1pqUDJjSXE1WHVyQ3Y3M2pwcjhMbWR5elo1aUFjU0RxbXloUzluU2xtd0xRZWZPZlRMeFJNU2dXTEdubFVobmRtb2RaSUtHeDJhVEdhUE5oQzFyX0UxcnVTWk44RjRyUVhIajFDTW5JeVY2S1dLT1NLeE1ZUV8wOTYtSHLSAZgBQVVfeXFMUHJsUnJ1M1QwRXJDODJLSzhISmpBaHM0RkRES2lFLVdRRFVPT2dTbV96cnNreHdQZVVnUGlUYzNUbElYRGJQejNzOFB1SktocVVDNU1qUGdFM05XakdrWGloRmJoV2laZnpGOHJzX3hld05EOXVHcjlralJXSm5OQ0VvQlVFQ01RTWpoMVhUek9JbkRzc3FhdEc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Nov 2023 08:00:00 GMT",
        "title": "Illuvium Ethereum Token Surges After Epic Games Store Listing - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nUpcoming NFT game Illuvium is coming to the Epic Games Store, and its impending launch apparently yielded a jump in the price for the Illuvium token, which surged in value following the early Wednesday announcement.\n\nIlluvium is now listed on the Epic Games Store ahead of a November 28 debut for the title’s Beta 3: Arena test, which will focus on player-vs-player (PVP) action. The beta will launch through the popular PC gaming storefront.\n\nNews of Illuvium joining the prominent PC gaming marketplace, which claimed 230 million users as of the end of 2022, appears to have had an immediate impact on the price of the Illuvium (ILV) token on Ethereum, which quickly jumped according to data from CoinGecko.\n\nILV’s price surged from about $65 per token before the news to a peak of $80.49, a nearly 24% rise in a matter of hours. The price has since settled to $75.50 as of this writing, which still marks a 17% increase over the last 24 hours—not to mention a 94% rise over the past 30 days.\n\nAD\n\nAD\n\n🌟 Major Announcement, Rangers! 🌟 Mark your calendars for November 28th! The moment you've all been waiting for is here! Illuvium Beta 3: PVP is coming, and that's not all—we’re live on the @EpicGames Store! While you can’t download it just yet, add it to your wishlist and… pic.twitter.com/NNdpBLa1h8 — Illuvium (@illuviumio) November 8, 2023\n\nBuilt on Ethereum scaling network Immutable X, Illuvium is a fantasy action game that spans multiple game styles, including an open-world adventure and an auto-battler competitive mode. The game uses various NFTs, including virtual land plots, with one such digital land NFT sale yielding $72 million worth of purchases in June 2022.\n\nDecrypt’s GG went hands-on with the Illuvium Overworld open-world beta in May and came away impressed by its visual quality and dynamic movement, pointing towards a blockchain game with real “AAA” potential. We’ll see how the game has progressed over the past several months when the latest beta drops on November 28.\n\nThe Epic Games Store has proven to be friendly to games with NFTs and crypto tokens, with titles like Gods Unchained, Raini: The Lords of Light, and Blankos Block Party rolling out on the marketplace. Rival storefront Steam has regulations against blockchain games, although some game developers have found ways to skirt or dodge the rules.\n\nAD\n\nAD\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxOS2FRVG5qcjRmd3IyUFVEeC1TUkNpRXgwYmJsM3FlSUlNdUhoMHRKVnlZNUZKdF9sR1VFR3UxTmRuNDBCYVl1LTVpNDQtUjlYRFZLa1pYbldhYm5OX2tQc0lEb3U5d1Y1dVJ1d25VS25ralc2bUM1bGJGNTdneHE4R9IBiAFBVV95cUxQRVVOZXprSXA4RV9wdXhFM0MycWVMd2dYeUp1ejN5UmFSOHN3ZEZROHVVT2RqQ2tFbzZBdHFXaEZmWkhZUDhqWHBZVmRzNWkzTm1mT1pSS3Mwa0NmSEhHc0ROWFVTaW5VLUhzVmlTcGtjcE9NV0xCTXU1d3F5U1BoeEpGdm9CUGVI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Gaming Sidechain Ronin Is On Fire—Here's Why - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nRonin may be best known as the Ethereum sidechain network behind Axie Infinity, the play-to-earn monster-battling game that flung NFT gaming into the spotlight back in 2021. But now Ronin is drawing attention for other games—and network activity is surging following last week’s launch of a game called Pixels.\n\nThe number of active wallet addresses on Ronin has effectively tripled in recent days, according to data shared on Twitter by Alex Svanevik, founder and CEO of crypto analytics firm Nansen. As of early Wednesday, it shows a leap from just over 20,000 active daily wallet users to about 70,000.\n\nAll the while, Ronin’s native token RON is pumping, marking a 13% increase over the last 24 hours to a current price of about $0.68, per data from CoinGecko. RON is further up 37% over the past week and 59% in the last 30 days, although other gaming tokens have similarly seen substantial jumps in recent weeks.\n\nPixels, which previously was on Ethereum scaling network Polygon before migrating to Ronin, officially launched on the Axie network on October 31. The game recreates the vibe of a classic 16-bit role-playing adventure, letting players navigate through a pixel-art world as they interact with each other, farm the land, play mini-games, and earn token rewards.\n\nAD\n\nAD\n\nPixels is officially live on @Ronin_network! This release is massive...\n\n👉 Ronin Migration\n\n👉 Pixels Carnival\n\n👉 Pixels Genesis Pets Mint\n\n👉 @Moku_HQ Partnership Make sure you read through everything below 🧵 pic.twitter.com/Hj1WEEUzjD — Pixels (@pixels_online) October 31, 2023\n\nIt also lets holders of select NFT profile picture (PFP) collections use their owned avatars in the game, with projects like the Bored Ape Yacht Club and CrypToadz supported.\n\nRonin, developed by Axie Infinity creator Sky Mavis, has onboarded additional games onto the Ethereum scaling network, including The Machines Arena, Zoids Wild Arena, and the CyberKongz Play and Kollect game.\n\nThe Ronin network experienced a $622 million hack to its Ethereum bridge in March 2022, which the U.S. Treasury later blamed the notorious North Korean state-sponsored hacking group, Lazarus. Sky Mavis ultimately reimbursed stolen user funds and recovered about 10% of the stolen funds routed through centralized exchanges.\n\nAD\n\nAD\n\nAxie Infinity’s own tokens have seen price boosts in recent weeks, as well, with the AXS governance token up 42% in the last 30 days to a current price above $6.00, while the SLP reward token has jumped 71% in that span to a price above $0.002 per token.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiXkFVX3lxTE5LR2lOeVh0eU16WGNXelp5LVRFc19JMWVsZmZ6cjM5Z3hndGE2MG1Cay1pU3ExUE5TSlBrTGNYajcxNFhVMERiYVlibzk3VDk4WTRqSDQ1ZGI2NDhlV1E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Nov 2023 08:00:00 GMT",
        "title": "Ethereum’s Justin Drake is unconcerned despite ether’s middling year pricewise: Q&A - Blockworks",
        "content": "When Ethereum’s “Merge” to proof-of-stake went off without a hitch last September, some felt the layer-1 was primed for a breakout. Speculation arose around a “flippening” and institutional investors waited in the wings.\n\nBut ether’s price did not end up meeting these expectations. NFTs tested new lows, and the bear market muted DeFi engagement. Bitcoin continued to outpace ether in 2023 — recently reaching dominance levels not seen since 2021. Meanwhile, institutional inflows are largely yet to materialize.\n\nBlockworks spoke with Justin Drake, a researcher at the Ethereum Foundation, about the network’s current standing and future prospects. Keep reading for more excerpts from Blockworks’ interview with Drake.\n\nBlockworks: You can see variations of this stat in different places, but the rewards paid out by Ethereum were larger than the transaction fees that were burned in both September and October. It looks like that’s turned around a little bit, but how should people think about issuance versus burn and when that flips negative?\n\nDrake: The fee market is exceptionally volatile. What you really want to be doing is zooming out, because when you zoom out, you’re smoothing your data over a longer period of time.\n\nIf you look at ultrasound.money, you’ll notice that when it’s profitable, it’s like printing money. It’s really, really profitable. Ethereum has about a profit margin of 50% which is outstanding for a business. Now okay, on some days, especially weekends, it won’t be profitable. In some months, if you’re in the absolute depth of the bear market, then it won’t be profitable. But over a long period of time, it’s extremely profitable.\n\nBlockworks: How important is this deflationary aspect of Ethereum and Ethereum’s ability to generate fees? Because obviously Ethereum is not a company in the traditional sense where your revenues need to outweigh costs. So how should people think about revenue versus issuance? And how important is that metric as a way to gauge the success of the network?\n\nDrake: Broader than just as a company, some people think of ether, the asset, as money for the internet. And in that context, scarcity as a meme is extremely important. There’s this almost obsession with the 21 million Bitcoin meme precisely because it’s all about scarcity. And for the first time in history pretty much, we have money which not only has a fixed supply but actually has a decreasing supply.\n\nSo now there’s what I call memetic potential. Memes are ideas that spread. The 21 million meme is one that spreads far and wide because it’s kind of an attractive thing intellectually. There’s an opportunity potentially for this meme to spread that ether is the scarcest money on Earth. Its supply is going down over time.\n\nBlockworks: And who benefits from this meme?\n\nDrake: Ether the asset is the basis of two very fundamental public goods in any programmable blockchain.\n\nPublic good number one is economic security. We’re trying to build systems here which have a lot of longevity. We want to be in a position where it’s extremely difficult even for the most powerful nation-states out there to attack Ethereum.\n\nAnd then there’s this second really important public good for blockchains which is called economic bandwidth, and that’s the ability to be used as collateral within DeFi. Ether is especially valuable as collateral money because it’s the only so-called pristine collateral. Pristine means that there’s no contract risk. There’s no governance risk. There’s no oracle risk. It’s the one risk free asset.\n\nBlockworks: It sounds like you’re saying the idea of ultrasound money is a means to these larger ends that you described.\n\nDrake: Exactly. It’s a Trojan Horse, but ultimately the value is utilitarian through economic security and economic bandwidth.\n\nBlockworks: Ethereum’s validator queue has been in the hundreds of people waiting to stake ether (ETH), and that’s down from tens of thousands over the summer and even into September. What do you make of this?\n\nDrake: The churn, which is basically the amount of validators that can be processed by the queue, is proportional to the amount of staked ETH. As the amount of staked ETH grows, the churn grows and it becomes easier and easier to clear the queue. And so in that sense, looking at the queue is kind of a totally irrelevant game. The fact that the queue is very low just means that ether is very efficient at processing deposits.\n\nThe better metric is what’s called deposits. Every single day on average, there’s 40,000 ETH coming in, which is a huge amount of money.\n\nBlockworks: How concerned are you about staking yields being down?\n\nDrake: I mean in a way, the lower the better, right? Because it means that we’re not spending as much to secure Ethereum. Ethereum is already extremely secure.\n\nThe security ratio is the value secured by Ethereum, which is all the ETH, all the NFTs, all the ERC-20s divided by the value securing Ethereum, and it’s 7.5, which is extremely healthy. If we were to have more staked ETH, this ratio would keep on going down. But there’s no real need for that. And so having more staked ETH in the way is wastefully paying for security.\n\nBlockworks: Post-Merge, there was a lot of excitement about Ethereum. In 2023, ether’s price has gone up, but especially compared to bitcoin, not as much as some had predicted. Why is that?\n\nRead more: The flippening: Will ether flip bitcoin in the next year?\n\nDrake: What tends to happen, generally speaking, is that during bear markets, dominance of bitcoin goes up, and then during bull markets, it drops down precipitously and then it reaches a new low, so this is all standard behavior.\n\nWhat I’ll say is that bitcoin dominance hasn’t grown as much as what would have been expected in the bear market. So I think expectations were unreasonable thinking that during a bear market, ether will outperform [bitcoin].\n\nThis is all speculation, but my guess is that there will be a flippening in the next bull run.\n\nInterview responses were edited for brevity and clarity.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    }
]