[
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxOd0tYMF83dHdUR1hWa2Jfd0RQV1B1aHhhb3BEYVRycmdjZW5oVmlPNk5peFRxYm1fTldZcFZpM3ZpdnNld1BQcXZ6ZFFCcl8zLTY0clVHSDFXeWpwSF81MmFseXZ1bWptZkE5bTRQNzc2c0FOdFlVTE1BZjJWMHJLSDFfZkdhdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 May 2024 07:00:00 GMT",
        "title": "21Shares Lists 4 Bitcoin and Ethereum ETNs on LSE - Yahoo Finance",
        "content": "Bitcoin - Crypto - UK Flag\n\n21Shares has listed its first cryptocurrency exchange-traded notes (ETN) with bitcoin and ether exposures on the London Stock Exchange (LSE) after the Financial Conduct Authority (FCA) greenlit professional investor access to ETNs in March.\n\nEther is the native cryptocurrency of the Ethereum smart contracts blockchain.\n\nThe 21Shares Bitcoin ETN (ABTC) and the 21Shares Ethereum Staking ETN (AETH) have total expense ratios (TERs) of 1.49% while the 21Shares Bitcoin Core ETN (CBTC) and 21Shares Ethereum Core ETN (ETHC) have TERs of 0.21%.\n\nAll products are available in U.S. dollar and sterling exposures.\n\nRead More: SEC Changes Ethereum Rule, Sets Stage for ETF Approval\n\nOphelia Snyder, co-founder of 21Shares, said: “The U.K. is one of the deepest, most-liquid capital markets in the world.\n\n“As institutional interest in cryptocurrencies grows, it is only natural that London Stock Exchange hosts responsible, properly constructed funds offering access to these markets.”\n\nWisdomTree Also Lists ETPs\n\nWisdomTree, which received approval from the FCA to list its bitcoin and Ethereum-based exchange-traded products on the LSE earlier in May, also listed them on Tuesday.\n\nElsewhere, Cboe U.K. became the second exchange following the LSE to accept bitcoin and Ethereum ETNs in March.\n\nTo list in the U.K., ETNs must be physically backed, non-leveraged and limited to bitcoin or ether exposures.\n\nRetail investors remain banned from accessing crypto ETNs as the U.K. watchdog still deems them \"ill-suited.\"\n\nThis article first appeared in etf.com's sister publication, ETFStream.com.\n\n\n\n\n\nPermalink | © Copyright 2024 etf.com. All rights reserved"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxOd0tYMF83dHdUR1hWa2Jfd0RQV1B1aHhhb3BEYVRycmdjZW5oVmlPNk5peFRxYm1fTldZcFZpM3ZpdnNld1BQcXZ6ZFFCcl8zLTY0clVHSDFXeWpwSF81MmFseXZ1bWptZkE5bTRQNzc2c0FOdFlVTE1BZjJWMHJLSDFfZkdhdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 May 2024 07:00:00 GMT",
        "title": "21Shares Lists 4 Bitcoin and Ethereum ETNs on LSE - Yahoo Finance",
        "content": "Bitcoin - Crypto - UK Flag\n\n21Shares has listed its first cryptocurrency exchange-traded notes (ETN) with bitcoin and ether exposures on the London Stock Exchange (LSE) after the Financial Conduct Authority (FCA) greenlit professional investor access to ETNs in March.\n\nEther is the native cryptocurrency of the Ethereum smart contracts blockchain.\n\nThe 21Shares Bitcoin ETN (ABTC) and the 21Shares Ethereum Staking ETN (AETH) have total expense ratios (TERs) of 1.49% while the 21Shares Bitcoin Core ETN (CBTC) and 21Shares Ethereum Core ETN (ETHC) have TERs of 0.21%.\n\nAll products are available in U.S. dollar and sterling exposures.\n\nRead More: SEC Changes Ethereum Rule, Sets Stage for ETF Approval\n\nOphelia Snyder, co-founder of 21Shares, said: “The U.K. is one of the deepest, most-liquid capital markets in the world.\n\n“As institutional interest in cryptocurrencies grows, it is only natural that London Stock Exchange hosts responsible, properly constructed funds offering access to these markets.”\n\nWisdomTree Also Lists ETPs\n\nWisdomTree, which received approval from the FCA to list its bitcoin and Ethereum-based exchange-traded products on the LSE earlier in May, also listed them on Tuesday.\n\nElsewhere, Cboe U.K. became the second exchange following the LSE to accept bitcoin and Ethereum ETNs in March.\n\nTo list in the U.K., ETNs must be physically backed, non-leveraged and limited to bitcoin or ether exposures.\n\nRetail investors remain banned from accessing crypto ETNs as the U.K. watchdog still deems them \"ill-suited.\"\n\nThis article first appeared in etf.com's sister publication, ETFStream.com.\n\n\n\n\n\nPermalink | © Copyright 2024 etf.com. All rights reserved"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxOd0tYMF83dHdUR1hWa2Jfd0RQV1B1aHhhb3BEYVRycmdjZW5oVmlPNk5peFRxYm1fTldZcFZpM3ZpdnNld1BQcXZ6ZFFCcl8zLTY0clVHSDFXeWpwSF81MmFseXZ1bWptZkE5bTRQNzc2c0FOdFlVTE1BZjJWMHJLSDFfZkdhdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 May 2024 07:00:00 GMT",
        "title": "21Shares Lists 4 Bitcoin and Ethereum ETNs on LSE - Yahoo Finance",
        "content": "Bitcoin - Crypto - UK Flag\n\n21Shares has listed its first cryptocurrency exchange-traded notes (ETN) with bitcoin and ether exposures on the London Stock Exchange (LSE) after the Financial Conduct Authority (FCA) greenlit professional investor access to ETNs in March.\n\nEther is the native cryptocurrency of the Ethereum smart contracts blockchain.\n\nThe 21Shares Bitcoin ETN (ABTC) and the 21Shares Ethereum Staking ETN (AETH) have total expense ratios (TERs) of 1.49% while the 21Shares Bitcoin Core ETN (CBTC) and 21Shares Ethereum Core ETN (ETHC) have TERs of 0.21%.\n\nAll products are available in U.S. dollar and sterling exposures.\n\nRead More: SEC Changes Ethereum Rule, Sets Stage for ETF Approval\n\nOphelia Snyder, co-founder of 21Shares, said: “The U.K. is one of the deepest, most-liquid capital markets in the world.\n\n“As institutional interest in cryptocurrencies grows, it is only natural that London Stock Exchange hosts responsible, properly constructed funds offering access to these markets.”\n\nWisdomTree Also Lists ETPs\n\nWisdomTree, which received approval from the FCA to list its bitcoin and Ethereum-based exchange-traded products on the LSE earlier in May, also listed them on Tuesday.\n\nElsewhere, Cboe U.K. became the second exchange following the LSE to accept bitcoin and Ethereum ETNs in March.\n\nTo list in the U.K., ETNs must be physically backed, non-leveraged and limited to bitcoin or ether exposures.\n\nRetail investors remain banned from accessing crypto ETNs as the U.K. watchdog still deems them \"ill-suited.\"\n\nThis article first appeared in etf.com's sister publication, ETFStream.com.\n\n\n\n\n\nPermalink | © Copyright 2024 etf.com. All rights reserved"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxPelg2Vk1ESVlqb2ZaYm1nNFgtOVh0T1A3T19YanNTUTN3N2toeFd5VWRjUE53TmY3cktmTFJRaGRZVmc2QTBTXzlQWGhYbGF3cmxxczRoS3lrV0JNNkVLOE9leWxLTlY1d3c0T0M0M3g0TXVnTjh1VU55NDdoSVZhVVFCbV9scXl1d3p5Y3JiVTZqUWJtdFE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 May 2024 07:00:00 GMT",
        "title": "5 Things to Know About Ethereum's First Spot Price ETFs - The Motley Fool",
        "content": "The SEC has finally cleared the way for the first Ether spot price ETFs.\n\nOn May 22, the U.S. Securities and Exchange Commission (SEC) approved the first eight applications for Ether (ETH 0.33%) spot price exchange-traded funds (ETFs) from Grayscale, Bitwise, iShares, VanEck, Ark Invest, Invesco, Fidelity, and Franklin Templeton. Ether is the world's second largest cryptocurrency and the main coin of the Ethereum Network.\n\nThat announcement came just four months after the SEC cleared the first spot price Bitcoin (BTC -0.94%) ETFs for trading. But should investors assume these planned ETFs will set a firm floor under Ether's price and become compelling long-term investments? Let's review the five key facts to decide.\n\n1. The first Ether ETFs won't start trading anytime soon\n\nThe SEC approved the initial regulatory filings for the eight Ether ETFs, but they won't start trading until the agency approves their S-1 filings. That process could take several months. For reference, the SEC approved the S-1 filings for the first Bitcoin spot price ETFs approximately three months after clearing their initial regulatory filings.\n\n2. The decision turns Ether into a commodity\n\nIn the past, the Ethereum and Bitcoin blockchains both used an energy-intensive proof of work (PoW) mining method to produce coins. But in 2022, the Ethereum Network switched to the more energy-efficient proof of stake (PoS) method. That transition, known as \"The Merge,\" reduced the network's energy consumption by 99.95% and made it deflationary -- which meant more Ether was being burned than produced.\n\nHowever, the SEC initially claimed The Merge made the Ether coin and Ethereum-based tokens more similar to securities than commodities. The move made a radical change to how Ether coins are created and managed. Regulators then repeatedly declared that Bitcoin was the only cryptocurrency that could be classified and pinned to spot price as a commodity, since it was digitally mined like a precious metal through the PoW method.\n\nTherefore, the SEC's decision to approve the first Ether ETF filings implies the coin can now be classified as a commodity instead of a security. That shift might clear the way for smaller Ethereum-based tokens such as Shiba Inu -- as well as independent PoS-driven cryptocurrencies like Solana -- to get their own spot price ETFs.\n\n3. Ether ETF investors can't stake their holdings\n\nAnother key difference between Ether and Bitcoin is the process of \"staking,\" which allows investors to earn interest by locking up their Ether coins on the network for a period of time. The SEC, which argues that staking-as-a-service solutions should be classified as unregistered securities, previously sued cryptocurrency exchanges including Coinbase (COIN -6.83%) and Kraken for allowing users to stake their own coins.\n\nGrayscale, Ark, and the other firms originally wanted to add staking features in their ETFs, but they removed those proposals in their updated filings last month. That change could make their ETFs less appealing than the actual digital coins.\n\n4. The SEC approved the filings probably to avoid more litigation\n\nLast year, the SEC lost a lawsuit against Grayscale, which had sued the agency for trying to block the conversion of its popular Bitcoin trust into an ETF. That loss softened the SEC's position and cleared the way for the first Bitcoin ETFs.\n\nEarlier this year, blockchain company Consensys sued the SEC for its refusal to recognize Ether as a commodity, while Grayscale and its peers were widely expected to sue the SEC again if it didn't approve their regulatory filings for spot price ETFs. So for now, it seems the SEC has backed off on tightly regulating Ether to avoid more legal battles.\n\n5. The Ether ETFs should attract less attention than the Bitcoin ETFs\n\nGrayscale currently holds nearly $11 billion in assets in its GrayScale Ethereum Trust (ETHE -3.95%), which it's attempting to convert into a spot price ETF. However, that's a lot smaller than the Grayscale Bitcoin Trust before its conversion into its spot price ETF, which now hosts more than $20 billion in assets.\n\nThese new Ether ETFs might attract some attention from mainstream and institutional investors, but they probably won't gain as much momentum as the Bitcoin spot price ETFs earlier this year. Ether also doesn't have any major near-term catalysts that are comparable to Bitcoin's halving, which halved the rewards for mining, earlier this year.\n\nShould you buy the Ether ETFs?\n\nThe Ether ETFs might not attract as many investors as the Bitcoin ETFs, but they might represent an easy way for investors to gain exposure to Ether without directly buying the coins. But investors should still be mindful of the fees, see if they actually match Ether's spot price, and realize they won't be able to stake their holdings.\n\nTherefore, investors shouldn't rush to buy the Ether ETFs once they hit the market. Instead, they should wait and see if the convenience of owning these ETFs in a brokerage account outweighs the advantages of owning Ether in a crypto wallet."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxOUVpqQ0E2aVBhQUlwU1ZkOHIzeTJaeG1xbmN5RW9yLWVHRHpTbklHbUtkQnVOZ1VaTnZhajhWU0JnVUtNemphTGw1UE5GZnRTREFyOTJvSUluODBzcHdENmJ2NFAzYWhDSUdkekQzQmFHVVdrbFJDU08xSHVwRUxpMVVfQ1EyZEVzNTM4SklPLS1WRnBGWnJMQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 May 2024 07:00:00 GMT",
        "title": "3 Little-Known Facts About Why Ethereum ETFs Could Be Mega-Bullish for Coinbase - The Motley Fool",
        "content": "An Ethereum ETF would significantly boost Coinbase's business and could catapult its stock.\n\nIt has been quite the year for Coinbase Global (COIN -6.83%). Crypto is back in a bull market, the Securities and Exchange Commission (SEC) approved spot Bitcoin (BTC -0.98%) exchange-traded funds (ETFs), and Coinbase posted its first profitable quarter in more than two years. As a result, its stock has risen more than 275% in the last year.\n\nAnd as is common in bull markets, the good news keeps on coming. Rumors are swirling that the SEC will green-light a spot Ethereum (ETH 0.33%) ETF soon. Not only is Coinbase going to be the custodian for some of these ETFs, but a pending approval will also create a domino effect of benefits for the company as interest in Ethereum grows.\n\nHere are three little-known facts about why the Ethereum ETF approval will give the company a major boost.\n\n1. It will increase volume on the platform\n\nWhen the spot Bitcoin ETFs were approved in January, many believed they would deal a blow to Coinbase. Since investors could now gain exposure to the cryptocurrency through an ETF trading on the stock market, why would they use Coinbase?\n\nWhile the concerns were valid at the time, we can now see that the approval of the ETFs generated massive trading volumes on Coinbase. The exchange saw volume on its platform increase by 300%.\n\nYou can probably see where this is going. Ethereum is the second-most-traded cryptocurrency on Coinbase. And since the exchange generates revenue from trading fees, if a similar outcome arises after the approval of an Ethereum ETF, then Coinbase will be raking in some serious profits. The more trading that happens, the more money it will make.\n\n2. Staking should get a boost\n\nOne of Coinbase's most popular products is its staking service. When buying Ethereum on its platform, the company allows users to easily stake it and earn passive income with just a few button clicks. For providing this service, it takes a 25% cut of the staking rewards it pays to users.\n\nShould Ethereum's price follow a similar trajectory to that of Bitcoin after it got its spot ETF approval, then that 25% cut will grow significantly. Imagine the difference this will have when considering that Coinbase manages billions of dollars of staked Ethereum.\n\nWe can see the impact that rising Ethereum prices could have on Coinbase's bottom line just by looking at last quarter's earnings report. From the fourth quarter of 2023 to the first quarter of 2024, Coinbase saw a 59% increase in its Blockchain Rewards (staking) revenue as Ethereum's price jumped 60%.\n\nWhile this is only one quarter, the increase in staking revenue corresponds nearly directly to the increase in Ethereum's value. If the crypto's value jumps 50% as Bitcoin's did in the three months after it received spot ETF approval, Coinbase's Blockchain Reward segment should see a similar increase or a jump of roughly $75 million.\n\n3. The first company built on Ethereum\n\nThe last benefit that an approval of spot Ethereum ETFs will have for Coinbase is slightly abstract, but it might be the most lucrative. The company has two main products that are uniquely Ethereum-based: Base and USDC (USDC 0.01%).\n\nLaunched In August 2023, Base is Coinbase's very own blockchain. The technical matters of this are a conversation for another day, but what is important is that Base is compatible with Ethereum, and for every transaction that occurs on Base, the company gets a cut.\n\nSince the beginning of March, Base produced nearly $35 million in profits as users flocked to the blockchain in the wake of Ethereum's Dencun upgrade, which lowered fees on Layer 2 blockchains like Base.\n\nIf activity stays on its current trajectory, Base could produce somewhere around $200 million on an annual basis. That's not bad when considering that Coinbase posted net income of $95 million in all 2023.\n\nThen there is USDC. Coinbase leverages this stablecoin in several ways to generate revenue, including interest income from reserves; transaction and conversion fees; custody services; and through its partnership with Circle, the creator of the stablecoin. In the first quarter of 2024, Coinbase raked in roughly $197 million in revenue from USDC.\n\nSince USDC and Base are both based on Ethereum, an ETF approval could produce serious benefits. There is no easy way to quantify it, but if the Bitcoin ETF approval sparked increased activity on Bitcoin, then it is plausible to assume an ETF approval for Ethereum will lead to a surge of interest and activity for that crypto, inevitably trickling over into Coinbase's Ethereum-based services.\n\nThe bottom line\n\nThe most obvious benefit for Coinbase and the approval of spot Ethereum ETFs is that it will be the custodian for five of the eight ETF applicants. This will produce additional revenue, but a deeper understanding of Coinbase's Ethereum-centric business model shows that just being a custodian for the ETFs will pale in comparison to the ripple effect across its revenue streams.\n\nTo put it simply, what is good for Ethereum is good for Coinbase. Best of all, we are only in the beginning stages of greater acceptance and interest in Ethereum and its unique role in the digital economy.\n\nHow much of a catalyst this will be for Coinbase's stock remains unknown, but rest assured, it will make the company much more valuable than it is today."
    }
]