[
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQM1BpMm43dTJucC1zM282U2VqeEpoTzg3NTU0WUZ6MFJ5VXFTbExBdGdNS3UtV2RGdldfc1ZBb3pQbzN0SV9wZG94VmFuWlRNX21SVXhhOVRHaDQ2RWRjM080VnRQTUpCSlVFRTFXcEVuUV93bG5wTGhrWHRZelhDQnRzVldUX3hXZS13SWxlRXRWZms?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Solana Meme Coins Outshine Ethereum by 800% in 2024 - Crypto Times",
        "content": "Solana-based meme coins have significantly outperformed their Ethereum-based counterparts in 2024, yielding an average return of 8,469% as compared to Ethereum’s 962%, per the “CMC 2024 H1” report.\n\nSolana-based meme coins Vs. Ethereum-based meme coins, Source: CoinMarketCap\n\nAs per the report, the explosive rallies of WIF and BONK on Solana have drawn significant attention and capital from other blockchains, creating a cycle of increased meme coin performance and investment. While meme coins exist across various blockchains, Solana and Ethereum lead in activity and trading volume.\n\nEthereum meme coins are more well-known because they were primarily introduced in 2023 or earlier. In contrast, most Solana meme currencies came onto the scene in late 2023 or early 2024, capitalizing on the surge in attention at the time.\n\nPolitical meme tokens have become a prominent subgenre inside the $57.7 billion meme currency market with a market valuation of $784 million. The MAGA (TRUMP) meme coin has increased in value by more than 5,100% this year due in large part to Trump’s open endorsement of cryptocurrencies and his acceptance of cryptocurrency contributions for his campaign.\n\nThe exceptional performance of Solana-based meme coins underscores a growing shift in speculative investments within the crypto space. This trend is not only reshaping the dynamics between different blockchain ecosystems but also highlights the increasing integration of political narratives within the meme coin market.\n\nAs crypto becomes a significant topic for the upcoming November US elections, political meme coins are expected to continue attracting speculative interest, further driving their market activity and value."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE9wckRnbkI3MmJXWGxVNDVxamNrV21ydkJvQmNnZmZqMGhKT0NTLVNpWVo2S2YtcGk3ZWZZd01UZ3FRYk5BbTBSaGc3ai1wNGRnRG9BQV9LWjMyQUczMHdkUnNLZ0QtTGxCSFUxUDE5czFxWVY1VFZZ0gF8QVVfeXFMUFhUb01aQ2c1VGpjN3pDeWhqT3NSQ3lPM2l6TEphalN3SkZVdDVVaHVwa1pUU21ua0c3V1lyc0gxRG9nTUFFOFBOY2VuOU5WS3BuMElYWDhPbWtjNUl5TTQxR1NfcXZjV3VRdFpwc3pJRC1tTUFLelBCT2dvWQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) to Touch $3,000, Here Are 3 Things to Know - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nEthereum is slowly moving toward the $3,000 price level, and it seems inevitable if the market does not face an unexpected influx of fresh funds, which is unlikely. Investors should be ready to see Ethereum at $3,000 and potentially even lower.\n\nAdvertisement\n\nThe price of Ethereum is getting close to $3,000. This means that there will probably be more volatility on the market. In the past, traders have been drawn to important psychological levels like $3,000 in order to take advantage of possible deals and sellers to limit losses.\n\nIt is wise for investors to prepare for potential fluctuations and contemplate tactics to efficiently handle their risks: options, futures hedging, funds redistribution and other strategies may come in handy. The $3,000 drop could have a big impact on investor sentiment.\n\nEthereum, which frequently trades above crucial levels like $3,500, has benefited greatly from the investment community's strong support. A decline below these levels could cause confidence to waver, especially among individual investors, who may see the drop as an indication of an extended bearish phase.\n\nAdvertisement\n\nAn increase in caution when investing in Ethereum may result from this change in trading volumes. The ecosystem of Ethereum may be impacted by the drop in price. We are already seeing a notable outflow from the network, which does not really benefit the digital silver.\n\nFurthermore, the financial strain that Ethereum-based projects may experience could impede ecosystem innovation and development. The NFT (non-fungible token) and DeFi (decentralized finance) markets are no longer around levels we had seen back in 2021, and current tendencies show that things are unlikely to change in the foreseeable future."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxPTWxlVl9mREV4ZGVRMjM2alVHQVVLYkZFMHI3ckhwckhDS0c3eWdyeDM1MElrQVVNQTRDblVBUlY5TzVoamtCX1BVTmZRcVFkVGR6X29yV2JDNktTX2lLZWZBOEttVzlOazBhbGJZRmtCNlRtUWdvWTFzY25aRExWV1lxYUxpZThJQVo4ZTF2VzU2X0FxaVE5VERVaFhRWnJTeXVNbg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Set To Outperform Bitcoin In Coming Months - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxNcDl3VXRpanE4ZW1hVUwyMnRGMU5KVlI1OXJlcGJOWXV3d295TkFHUXR6UlNsZDh1M2hsYVhFRWZLcEtjRi1PYTBGNzVKclhOWWRVUHZIN2JMYmFQY3RXb3VFejF1WTVxSHVBWk9mbk9HQXkwNDVuenowUGJYZ1Z1SVNwRVNiVDhpVUtWaUJOUFdZRmZTQWdNVGdsdXktNTl0UGhKY1U1dDFqcmxzRFA4cjQ1dkw5Sk1zU2VXSy02ZDYxVnVB0gHKAUFVX3lxTE9jMjVfdER1aTZBZHQyRUFPNnZqbW9zNHQ4Yl9JakU3S3d6TnlmTXQ5OVJKa3dLVlpxelB0MkhOeHZaMHZCSXg3OFYxSzhFSGd4THRVRUVXc3F0NFVyMllwQW9tdEJFWW5kMTNIZ3p6MmVTY3pHUFd4c0JxTGQ4eFBTQ0JhZ1FnT3MxS0w3Z3Z0d0g5aU1wTXpjUXlnR2I5UW9pQVFWVmZKc045dWdEWVZrd0tRVmMzMklkTDB0TzhXbUloVER2ZUh2Tnc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Ethereum breaches key support as SEC delays ETF decision - FXStreet",
        "content": "SEC delays decision on Ethereum ETF S-1 drafts as analysts shifted their potential launch date again.\n\nEthereum whale risks liquidation if ETH declines to $2,984.\n\nEthereum breaches key support amid key insight from CME open interest.\n\nEthereum is down more than 5% on Thursday following the Securities & Exchange Commission's (SEC) failure to approve ETH ETF issuers' S-1 drafts. Meanwhile, the recent decline has strengthened the bearish outlook after ETH moved below a key support level, sparking $90 million in long liquidations.\n\nDaily digest market movers: SEC yet to approve ETH ETF\n\nDespite its light comments on issuers’ S-1 drafts, the SEC has yet to approve spot ETH ETFs following the US Independence Day holiday. As a result, Bloomberg analyst James Seyffart shifted his over/under date for a potential approval to next weekend.\n\nThe SEC approved spot ETH ETF issuers' 19b-4 filings in May, but also need to sign off on their S-1s before the products go live.\n\nNate Geraci, President of ETF Store, noted that the SEC expects issuers to amend their S-1s by July 8, with another round of filings potentially due around July 12. This \"would theoretically mean launch week of July 15\" for spot ETH ETFs, wrote Geraci in an X post.\n\nMeanwhile, following the recent market decline, a whale who longed ETH via the Compound protocol is about to be liquidated, according to data from Lookonchain. The whale deposited 12,734 ETH worth $40 million to Compound and borrowed $31.4 million worth of dollar-denominated stablecoins with a health rate of 1.06. The whale risks liquidation if the price of ETH drops to $2,984.\n\nETH technical analysis: Ethereum bears lead market amid slight bullish sentiment from US investors\n\nEthereum is trading around $3,132 on Thursday, down more than 5% on the day. The decline wiped out more than $90.81 million worth of long positions from the market, bringing the total ETH liquidations to $102.48 million in the past 24 hours.\n\nETH has now breached the $3,203 key support level, strengthening its bearish outlook. With the move, ETH has fully balanced the market inefficiency from itsprice spike following news of the SEC's U-turn on spot ETH ETFs.\n\nETH/USDT 4-hour chart\n\nETH may test the $3,029 support level in the next few hours. A bounce from this level will cool the bearish momentum. However, a move below it may see ETH seeking support around the $2,852 price level.\n\nIn the past 24 hours, Ethereum's futures open interest (OI) across top exchanges declined by almost 5%. Open interest is the number of outstanding contracts in a derivatives market that are yet to be settled.\n\nWhile the move signified wider risk aversion from traders, Ethereum's CME OI was an outlier, rising almost 1% in the last 24 hours. This indicates that US investors may be slightly bullish despite declining prices due to expectations of spot ETH ETFs' launch.\n\nAnother key insight is that spot ETH ETFs may experience impressive flows using the rising ETH CME OI as a proxy to measure investors' sentiment. As a result, ETH may take bears by surprise and rally past its yearly high, invalidating the bearish thesis."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxQVmI1TEhWVkR4NDNacnZSRUJKbE16UDVJVDBaNlFBS3UydjlIWVN0dTJhZnZpZzJDQ3l6dTZpd1pZWGhGdFBBZGxWY0p4S2NWQTl3OEdfcmNFY2NYa01CZmMtaGw4SWJkWXhNZWtqRUo0MlFtNXNKUmg5clR6QmxjbVFLWWFkMW1LX0ZJdEF6ZzREaW1iVDBvb0Zad0E3eFVMZm16YjMtZkF3T05pMmthM0ItTzVGMzYtUGdvVGV2TnZiYknSAcgBQVVfeXFMUF9fb0pUWDRsNG40SUtIclJoS3RsRFVOX2s1Vzg0eEJwSW9MM21rcUxXTDV0THBTbUtNUEIyQjl6OFltb1dwRkNTSWFRRjROQkhqLXFmWm9aeEZrV3lvQ3hiYlA5Z3RVbFBZVXJSQk1EVnpLZmloSnQyUC1BZTZBTG5uOW1iaFlKQkcwdWZHUnpfM0hWWGtMSG5UTFoxb1BETXhCbnlBNnR1RTBkckZ2Ql95U1ZHOUM1T205R0pTVl8xS0RoN3JzQzU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jul 2024 07:00:00 GMT",
        "title": "Ethereum poised to follow Nvidia's steps as Bitwise files updated S-1 draft - FXStreet",
        "content": "Ethereum ETFs expected to begin trading in July after Bitwise files amended S-1 ahead of due date.\n\nEthereum ETFs could flip analysts' expectations if investors buy into ETH's Nvidia-like high-growth tech play narrative.\n\nEthereum derivatives data reveals investors are becoming more risk averse following Mt. Gox headwind on horizon.\n\nEthereum (ETH) is down 3% on Wednesday following Bitwise filing an updated S-1 draft and a wider market downturn with potential Mt. Gox BTC supply flooding the market. Despite the general market lull, investors may gain consolation from Bitwise prediction that Ethereum ETFs could outperform analysts' expectations if positioned as a high-growth tech play similar to Nvidia.\n\nDaily digest market movers: Could Ethereum be the next Nvidia?\n\nAsset manager Bitwise filed its amended S-1 registration statement with the Securities and Exchange Commission (SEC) today ahead of its July 8 due date. The new filing added a fee waiver for up to $500 million in assets under management, similar to Van Eck's waiver last week.\n\nConsidering the comments on these drafts were light, Bloomberg analyst Eric Balchunas said spot ETH ETFs should have begun trading and expects them to launch before the end of July.\n\nThe SEC approved spot ETH ETF issuers' 19b-4 filings in May but also needs to greenlight their S-1 registration statements before the products can begin trading.\n\nAccording to Bitwise CIO Matt Hougan, Ethereum ETFs could be more successful than earlier predicted if investors buy into the narrative that Ethereum is a high-growth tech play similar to Meta and Nvidia. Hougan had earlier predicted that spot ETH ETFs could attract up to $15 billion in net flows before the end of 2025.\n\n\"It's pretty easy for me to imagine investors selling a small amount of their tech exposure and adding ETH. I'd argue it's easier than imagining investors carving out an entirely separate portfolio sleeve for a new monetary asset,\" Hougan noted.\n\nHowever, people need to buy into the idea that \"Ethereum is a technology investment\" for this to happen. Hougan noted that a clear understanding of how Ethereum differs from Bitcoin and the growth of applications on its network would help strengthen the “high-growth tech play” narrative.\n\n\"What might that look like? Imagine stablecoins going from $160 billion to $1.6 trillion in assets as more people embrace the speed and transparency of blockchain-enabled payments. Or consider decentralized finance applications opening up new avenues for lending and borrowing with the onset of regulatory clarity. Or imagine more firms following BlackRock's lead and building tokenized funds on the Ethereum platform,\" said Hougan.\n\nMeanwhile, Lookonchain revealed in a recent analysis that Ethereum ranks number one among blockchain networks in terms of yearly revenue. Ethereum's revenue is at $2.728 billion per year, with Bitcoin coming behind at $1.302 billion. Increased revenue often indicates high user activity in a blockchain network, which helps estimate bullish sentiment.\n\nETH technical analysis: Ethereum traders are skeptical with Mt. Gox headwind in sight\n\nEthereum is trading around $3,307, down about 3% in the past 24 hours. ETH breached the $3,367 support level, pouring cold water on hopes of a potential rebound. ETH liquidations reached $44.33 million, equalling that of BTC in the past 24 hours despite having a lower market cap. Long liquidations accounted for 87% of ETH's total liquidations, with shorts at 13%.\n\nEthereum options open interest has declined by 57% since its spike following the SEC's approval of 19b-4 filings of spot ETH ETF issuers. As of May 24, ETH options OI was at $13.44 billion. However, following the expiry of May and June options, most investors have failed to open new positions as indicated in the chart below.\n\nETH options OI\n\nETH options OI is now at $5.69 billion, its lowest level since September. The decreasing options OI accompanied by ETH's price decline suggests option traders are more risk-averse. Two possible reasons for the uncertainty among traders include:\n\nSEC's delay in greenlighting prospective spot ETH ETF issuers’ S-1 drafts.\n\nPrevailing wider market bearish sentiment from Mt. Gox BTC supply.\n\nThe ETH Long/Short ratio also provides insights into traders' sentiment in the past week. The ratio's 7-day average is at 0.946, indicating the futures market is tilted toward the downside.\n\nAs a result, ETH may sustain a horizontal movement in the coming weeks until the SEC approves issuers' S-1 drafts for spot ETH ETFs to begin trading.\n\nETH/USDT 4-hour chart\n\nA breach of the $3,203 support could strengthen bearish sentiment and send ETH back to the $2,850 to $3,029 range."
    }
]