[
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxQTVAwbzEtbURLWGVXbkdxN2pPRVFqWE1tRDB5M1U5el9DVXpTNjdoTVdwOVk4SVFwZ2RxYzhScGxmVXRJMUJhWW02N1lfNHV0Z0I3Q0xTUnQ1MjN2b1hqM0IyTmh0c3lOOXM2TzRGMV9LcFl0WEtWYjRBVm1lcVhLT9IBhgFBVV95cUxNRkRzSTN4RzRIeGttWHo0LVRNU2YyZ2cxeG5HSVJZbm83T21GdThXaUVwWGtnU2dEWjQzUlNma2w2T0wxZXc3MGhsY3ZhaUxHNmFHaWdLMm1pU0p3YmpsQmVKd0JuUHQ1UUs4bVB0QXBHRVFTWEswQk1DTnVrbnExYUg4YU8wZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "Ethereum L2s Surpassed All Other Blockchains by TVL: Details - U.Today",
        "content": "Advertisement\n\nEthereum Foundation contributor Josh Stark noticed a major achievement for Ethereum-based ecosystem of second-layer networks. In 2021, 20% of his followers were sure that this \"flippening\" would never happen.\n\nEthereum (ETH) L2s accomplished historic milestone\n\nIn the first days of 2024, the aggregated sum of value locked in Ethereum-based L2 protocols exceeded that of all non-Ethereum blockchains. While Ethereum L2s are responsible for $20.7 billion in equivalent, the rest of blockchains amassed $19.6 billion, as noticed by Stark today, Jan. 4, 2024.\n\nit happened 🎉\n\n\n\n- Ethereum L2s = $20.7 billion\n\n- Other L1s = $19.67 billionhttps://t.co/o38jqwnHJC pic.twitter.com/uqWAqWkJUC — Josh Stark (@0xstark) January 4, 2024\n\nMeanwhile, he stressed that the metrics cannot be treated as exactly similar: For second-layer networks, the indicator refers to the sum of assets on L2, including native tokens. For L1s, the metrics reflect the sum of assets locked in dApps on this or that blockchain.\n\nAdvertisement\n\nThe analyst used L2Beat's data for tracking second-layer blockchains and DefiLlama to analyze what is happening on non-Ethereum L1s.\n\nIt is interesting that back in September 2021, he asked his audience about the date of this \"L2-over-L1\" flippening. While the majority of his followers were sure that this fact could take place in 2022, 20% answered that it would never happen.\n\nThe L2s ecosystem was 20 times smaller than the L1s one, as of the date of the first voting. During the crypto winter, this gap became even more dramatic; its peak was reached amid the Terra/Luna collapse in Q1, 2022.\n\nArbitrum (ARB) dominance inches closer to 50% again\n\nAs demonstrated by L2Beat, the ecosystem of Ethereum's L2s registered an all-time high in TVL on Jan. 2, 2024. The metric jumped above $20.78 billion in equivalent, adding over 330% in just one year.\n\nThe L2s scene remains heavily \"concentrated\": Only five networks — Arbitrum (ARB), OP Mainnet (Optimism, OP), Base, Metis Andromeda and Manta Pacific — are responsible for over 90% of its TVL.\n\nArbitrum (ARB), the largest Ethereum-based L1, is rebuilding its dominance after a small decline. As of printing time, it is one step away from the 50% barrier.\n\nFor the closest competitor, OP Mainnet, this indicator equals 28.65%, L2Beat data says."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPSGhGeGYxUHowRFZ0b1ZQaXN3bHB0SXFZM21UWC1Ma2lfb1YyUjNWTzZQN01OWW9SMEthUWp4eE1BZ0E2R29hanhneE12TzZKdmo3TTZJZmhMQU9VY2N4Uy1OaVZsdXVOLVVlZFQ2MHRqNEM4MmwtYVhBTXcyZ0NJQ1BydXBRUkNHYU5NX3h30gGTAUFVX3lxTE1kVmJMbUNiZlZqVXFZdjBWbk9iaVFHZ05RV3k0MG5zX2t3TWdNQmRWRW1Hdms3X1RQV2RTZF9vb19yVzZlbW9UVE1oZlVUWXY4bUx0bDV1ZV84ckoxTFhINXRDQkpLSUc2QXd3Z25yMkxLM1Q1T3haMHhweWgwYkNXUFhlcGJOdmNMamhtblVRckh6NA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Price Prediction Signals 20% Downside Risk As 60-Day Support Falls - CoinGape",
        "content": "Ethereum Price Prediction: Ethereum (ETH), the world’s second-largest cryptocurrency, has been experiencing a lateral trading pattern for over a month, fluctuating between two key levels at $2400 and $2137. The appearance of daily candles with rejection wicks at both ends signifies a prevailing uncertainty among investors. Recently, a sharp market downturn, partly attributed to speculated rejections of spot Bitcoin ETFs by the US SEC as reported by Matrixport, a digital asset financial services firm, resulted in a notable 6.5% drop in the ETH price. This decline led to the breach of a crucial support trendline, hinting at the risk of further corrections.\n\nIs Ethereum Headed for a Steeper Slide?\n\nA bearish breakdown below the support trendline hints at an early upcoming correction.\n\nA healthy retracement in ETH price should bolter buyers to revive exhausted bullish momentum,\n\nThe intraday trading volume in Ether is $19.3 Billion, indicating a 53% gain.\n\nOver the past eight weeks, the Ethereum price has shown signs of recovery, evident from an ascending trendline on the daily chart. This trendline has historically served as a strategic buying point for investors during market dips, indicative of a robust recovery.\n\nadvertisement\n\nHowever, during the current period of consolidation, Ether has been facing substantial resistance at the $2400 mark. The recent downturn, coinciding with the broader market sell-off, pushed the price below both the 23.6% Fibonacci retracement level and the established support trendline.\n\nIf the daily candlestick closes beneath this critical threshold, it could pave the way for sellers to exert additional downward pressure, potentially triggering a further 20% price decline, bringing the ETH price down to approximately $1750.\n\nEthereum Long-Term Holder Ratio Surpasses Bitcoin\n\nWhile current short-term trends suggest a cautious or downward trajectory for the Ethereum price, an analysis of the “Holder Ratio” chart presents a promising outlook for the cryptocurrency. In a retrospective of 2023, on-chain data from Intotheblock showcased on the X-platform, revealed that the proportion of long-term Ethereum holders exceeded that of Bitcoin for the second time. This vital statistic underscores a growing trend of Ethereum investors committing to hold their assets for extended periods, outpacing similar commitments among Bitcoin investors. This increase in long-term holding is significant as it reflects deepening confidence in Ethereum’s prospects and stability\n\nRelative Strength Index (RSI): The daily RSI slope drops below the midline reflecting the sellers are strengthening their group over\n\nExponential Moving Average (EMA): The ETH price above daily EMAs(50, 100, and 200) hints the broader market is strongly bullish.\n\nRelated Articles:\n\nSahil Mahadik Sahil is a dedicated full-time trader with over three years of experience in the financial markets. Armed with a strong grasp of technical analysis, he keeps a vigilant eye on the daily price movements of top assets and indices. Drawn by his fascination with financial instruments, Sahil enthusiastically embraced the emerging realm of cryptocurrency, where he continues to explore opportunities driven by his passion for trading\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPSGhGeGYxUHowRFZ0b1ZQaXN3bHB0SXFZM21UWC1Ma2lfb1YyUjNWTzZQN01OWW9SMEthUWp4eE1BZ0E2R29hanhneE12TzZKdmo3TTZJZmhMQU9VY2N4Uy1OaVZsdXVOLVVlZFQ2MHRqNEM4MmwtYVhBTXcyZ0NJQ1BydXBRUkNHYU5NX3h30gGTAUFVX3lxTE1kVmJMbUNiZlZqVXFZdjBWbk9iaVFHZ05RV3k0MG5zX2t3TWdNQmRWRW1Hdms3X1RQV2RTZF9vb19yVzZlbW9UVE1oZlVUWXY4bUx0bDV1ZV84ckoxTFhINXRDQkpLSUc2QXd3Z25yMkxLM1Q1T3haMHhweWgwYkNXUFhlcGJOdmNMamhtblVRckh6NA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Price Prediction Signals 20% Downside Risk As 60-Day Support Falls - CoinGape",
        "content": "Ethereum Price Prediction: Ethereum (ETH), the world’s second-largest cryptocurrency, has been experiencing a lateral trading pattern for over a month, fluctuating between two key levels at $2400 and $2137. The appearance of daily candles with rejection wicks at both ends signifies a prevailing uncertainty among investors. Recently, a sharp market downturn, partly attributed to speculated rejections of spot Bitcoin ETFs by the US SEC as reported by Matrixport, a digital asset financial services firm, resulted in a notable 6.5% drop in the ETH price. This decline led to the breach of a crucial support trendline, hinting at the risk of further corrections.\n\nIs Ethereum Headed for a Steeper Slide?\n\nA bearish breakdown below the support trendline hints at an early upcoming correction.\n\nA healthy retracement in ETH price should bolter buyers to revive exhausted bullish momentum,\n\nThe intraday trading volume in Ether is $19.3 Billion, indicating a 53% gain.\n\nOver the past eight weeks, the Ethereum price has shown signs of recovery, evident from an ascending trendline on the daily chart. This trendline has historically served as a strategic buying point for investors during market dips, indicative of a robust recovery.\n\nadvertisement\n\nHowever, during the current period of consolidation, Ether has been facing substantial resistance at the $2400 mark. The recent downturn, coinciding with the broader market sell-off, pushed the price below both the 23.6% Fibonacci retracement level and the established support trendline.\n\nIf the daily candlestick closes beneath this critical threshold, it could pave the way for sellers to exert additional downward pressure, potentially triggering a further 20% price decline, bringing the ETH price down to approximately $1750.\n\nEthereum Long-Term Holder Ratio Surpasses Bitcoin\n\nWhile current short-term trends suggest a cautious or downward trajectory for the Ethereum price, an analysis of the “Holder Ratio” chart presents a promising outlook for the cryptocurrency. In a retrospective of 2023, on-chain data from Intotheblock showcased on the X-platform, revealed that the proportion of long-term Ethereum holders exceeded that of Bitcoin for the second time. This vital statistic underscores a growing trend of Ethereum investors committing to hold their assets for extended periods, outpacing similar commitments among Bitcoin investors. This increase in long-term holding is significant as it reflects deepening confidence in Ethereum’s prospects and stability\n\nRelative Strength Index (RSI): The daily RSI slope drops below the midline reflecting the sellers are strengthening their group over\n\nExponential Moving Average (EMA): The ETH price above daily EMAs(50, 100, and 200) hints the broader market is strongly bullish.\n\nRelated Articles:\n\nSahil Mahadik Sahil is a dedicated full-time trader with over three years of experience in the financial markets. Armed with a strong grasp of technical analysis, he keeps a vigilant eye on the daily price movements of top assets and indices. Drawn by his fascination with financial instruments, Sahil enthusiastically embraced the emerging realm of cryptocurrency, where he continues to explore opportunities driven by his passion for trading\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiaEFVX3lxTE03cjhWaUFSZUpKX2hLZHNFOTNxMlUwM2M2cHhRaTJFc29YZDM0RGRXZEtkVmVHU2J0QUFiRmhSTjJfZkNpQ0NtTVRtNTljUHB2QWlXc3NKUU1wRHVSNXNOWWx4ZEY5YkJD?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "What Is Optimism in Ethereum? - Unchained",
        "content": "Optimism is one of the most popular Ethereum Layer 2 protocols.\n\nDespite Ethereum’s position as the leading smart contract blockchain, it still suffers from scalability issues. This is a challenge for Ethereum as its network supports a growing ecosystem of decentralized applications (dApps) and decentralized finance (DeFi) protocols that require high throughput and low transaction fees to scale. To address Ethereum’s scaling issues, Layer 2 protocols have emerged. Optimism is one of the most popular ones.\n\nIn this guide, we’ll discuss what Optimism is, how it works, and its benefits and drawbacks.\n\nWhat Is Optimism?\n\nOptimism is a layer 2 solution for the Ethereum network that utilizes ‘optimistic rollups,’ a kind of rollup that ‘optimistically’ accepts all transactions in the rollup as valid.\n\nThis process saves time as individual transactions get submitted without proof of their validity. However, validators involved in the rollup have up to a week to question the whole rollup if they have any doubts.\n\nOptimism rolls up multiple transactions into one transaction and settles them on another layer, but with the receipts being relayed back to the Ethereum blockchain. By bundling up transactions, Optimism offers users cheaper transactions and an improved user experience.\n\nOptimism has since grown to become the second-largest Ethereum Layer 2 scaling solution after Arbitrum, with a total value locked of $772 million, according to data on DefiLlama. The Layer 2 solution is also supported by various DeFi platforms such as AAVE, Synthetic, and Uniswap.\n\nHow Does the Ethereum Layer-2 Optimism Work?\n\nThe Optimism Layer 2 solution addresses Ethereum’s scalability issue using optimistic rollup technology. These rollups bundle or consolidate several transactions into one on the Ethereum network, significantly reducing the gas fees required by sharing the cost between the users whose transactions are in the bundle.\n\nTransactions on the Optimism scaling solution are assumed valid by default, mimicking the ‘innocent until proven guilty’ principle. Thus, transactions are processed much faster, improving the user experience.\n\nOptimism has a security system in place for transactions deemed doubtful. This security mechanism provides a one-week window where validators can submit and run a fault proof. This means asset transfers from the Optimism network to the Ethereum blockchain may take up to seven days to complete.\n\nOnce a fault proof is submitted, the transaction in question will go through a verification process against the state on the Ethereum layer. If the fault proof is challenged successfully, it’s removed and reprocessed.\n\nOptimism, designed as a scaling solution for Ethereum, borrows significantly from Ethereum’s architecture. Optimism utilizes the same virtual machine as the Ethereum network and charges gas fees similarly but at a lower rate. Additionally, users can send just about any ERC-20 asset between the two blockchains.\n\nHow to Use Optimism\n\nFor anyone who has used Ethereum before, using Optimism feels the same as using Ethereum.\n\nTo use Optimism, you must deposit either ETH or ERC-20 tokens to the Optimism token bridge. This way, you can process transactions on the Ethereum mainnet through Optimism. You can then change your tokens back to the Ethereum network when done.\n\nYou’ll need to use the Optimism Gateway to deposit your tokens. You can connect to the Optimism Gateway via a Web3 wallet, such as MetaMask or Trust Wallet. The transaction cost quoted will depend on the amount of tokens you want to transfer and deposits happen in minutes.\n\nOptimism will also notify you that you won’t be able to withdraw the funds until after a week. This delay is part of Optimism’s security mechanism. However, once you have successfully deposited your funds on Optimism, you can use them on supported dApps like Uniswap and save on fees. To do this, ensure that your network is set to Optimism.\n\nBenefits and Drawbacks of Optimism As an Ethereum Layer\n\nJust like any technology, Optimism offers both benefits and drawbacks.\n\nPros\n\nScalability: Optimism provides a solution to Ethereum’s scalability problem by using optimistic rollups. This involves moving the computational and status storage off-chain.\n\nCheaper transactions : By bundling the transactions into one, Optimism significantly reduces the gas fees linked with Ethereum transactions while maintaining the trustless nature and security of the blockchain.\n\nEthereum compatibility : Optimism borrows heavily from Ethereum’s architecture, which results in enhanced user experience.\n\nCons\n\nSlow transactions: Optimism has longer withdrawal times due to its security mechanism, which allows validators to raise any concerns they have if they doubt a transaction.\n\nLimited smart contract functionality: Users would still need to rely on Ethereum or other blockchain alternatives if their dApps heavily rely on smart contracts.\n\nSecurity risks: There are some potential security risks as Optimism relies on its fault-proof mechanism to validate transactions.\n\nFinal Words\n\nOptimism offers several benefits for Ethereum transactions, including seamless compatibility with the Ethereum main chain, improved scalability, and reduced fees. But just like with other technologies, Optimism has its drawbacks, including longer withdrawal wait times and limited smart contract capability.\n\nAs Ethereum’s adoption grows, it will be fascinating to witness how Optimism will evolve and transform to meet user needs."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiaEFVX3lxTE03cjhWaUFSZUpKX2hLZHNFOTNxMlUwM2M2cHhRaTJFc29YZDM0RGRXZEtkVmVHU2J0QUFiRmhSTjJfZkNpQ0NtTVRtNTljUHB2QWlXc3NKUU1wRHVSNXNOWWx4ZEY5YkJD?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "What Is Optimism in Ethereum? - Unchained",
        "content": "Optimism is one of the most popular Ethereum Layer 2 protocols.\n\nDespite Ethereum’s position as the leading smart contract blockchain, it still suffers from scalability issues. This is a challenge for Ethereum as its network supports a growing ecosystem of decentralized applications (dApps) and decentralized finance (DeFi) protocols that require high throughput and low transaction fees to scale. To address Ethereum’s scaling issues, Layer 2 protocols have emerged. Optimism is one of the most popular ones.\n\nIn this guide, we’ll discuss what Optimism is, how it works, and its benefits and drawbacks.\n\nWhat Is Optimism?\n\nOptimism is a layer 2 solution for the Ethereum network that utilizes ‘optimistic rollups,’ a kind of rollup that ‘optimistically’ accepts all transactions in the rollup as valid.\n\nThis process saves time as individual transactions get submitted without proof of their validity. However, validators involved in the rollup have up to a week to question the whole rollup if they have any doubts.\n\nOptimism rolls up multiple transactions into one transaction and settles them on another layer, but with the receipts being relayed back to the Ethereum blockchain. By bundling up transactions, Optimism offers users cheaper transactions and an improved user experience.\n\nOptimism has since grown to become the second-largest Ethereum Layer 2 scaling solution after Arbitrum, with a total value locked of $772 million, according to data on DefiLlama. The Layer 2 solution is also supported by various DeFi platforms such as AAVE, Synthetic, and Uniswap.\n\nHow Does the Ethereum Layer-2 Optimism Work?\n\nThe Optimism Layer 2 solution addresses Ethereum’s scalability issue using optimistic rollup technology. These rollups bundle or consolidate several transactions into one on the Ethereum network, significantly reducing the gas fees required by sharing the cost between the users whose transactions are in the bundle.\n\nTransactions on the Optimism scaling solution are assumed valid by default, mimicking the ‘innocent until proven guilty’ principle. Thus, transactions are processed much faster, improving the user experience.\n\nOptimism has a security system in place for transactions deemed doubtful. This security mechanism provides a one-week window where validators can submit and run a fault proof. This means asset transfers from the Optimism network to the Ethereum blockchain may take up to seven days to complete.\n\nOnce a fault proof is submitted, the transaction in question will go through a verification process against the state on the Ethereum layer. If the fault proof is challenged successfully, it’s removed and reprocessed.\n\nOptimism, designed as a scaling solution for Ethereum, borrows significantly from Ethereum’s architecture. Optimism utilizes the same virtual machine as the Ethereum network and charges gas fees similarly but at a lower rate. Additionally, users can send just about any ERC-20 asset between the two blockchains.\n\nHow to Use Optimism\n\nFor anyone who has used Ethereum before, using Optimism feels the same as using Ethereum.\n\nTo use Optimism, you must deposit either ETH or ERC-20 tokens to the Optimism token bridge. This way, you can process transactions on the Ethereum mainnet through Optimism. You can then change your tokens back to the Ethereum network when done.\n\nYou’ll need to use the Optimism Gateway to deposit your tokens. You can connect to the Optimism Gateway via a Web3 wallet, such as MetaMask or Trust Wallet. The transaction cost quoted will depend on the amount of tokens you want to transfer and deposits happen in minutes.\n\nOptimism will also notify you that you won’t be able to withdraw the funds until after a week. This delay is part of Optimism’s security mechanism. However, once you have successfully deposited your funds on Optimism, you can use them on supported dApps like Uniswap and save on fees. To do this, ensure that your network is set to Optimism.\n\nBenefits and Drawbacks of Optimism As an Ethereum Layer\n\nJust like any technology, Optimism offers both benefits and drawbacks.\n\nPros\n\nScalability: Optimism provides a solution to Ethereum’s scalability problem by using optimistic rollups. This involves moving the computational and status storage off-chain.\n\nCheaper transactions : By bundling the transactions into one, Optimism significantly reduces the gas fees linked with Ethereum transactions while maintaining the trustless nature and security of the blockchain.\n\nEthereum compatibility : Optimism borrows heavily from Ethereum’s architecture, which results in enhanced user experience.\n\nCons\n\nSlow transactions: Optimism has longer withdrawal times due to its security mechanism, which allows validators to raise any concerns they have if they doubt a transaction.\n\nLimited smart contract functionality: Users would still need to rely on Ethereum or other blockchain alternatives if their dApps heavily rely on smart contracts.\n\nSecurity risks: There are some potential security risks as Optimism relies on its fault-proof mechanism to validate transactions.\n\nFinal Words\n\nOptimism offers several benefits for Ethereum transactions, including seamless compatibility with the Ethereum main chain, improved scalability, and reduced fees. But just like with other technologies, Optimism has its drawbacks, including longer withdrawal wait times and limited smart contract capability.\n\nAs Ethereum’s adoption grows, it will be fascinating to witness how Optimism will evolve and transform to meet user needs."
    }
]