[
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxOcUlHa3R5NTY5SW91WV9rczFiSVNFS1JHTHZjYnNjLVpmeU9rbFcwZXlnMlFjWFVhQjlTSU9iaHItUDQ1ejhuSkh5bDk1U2EtSUJkMzY1OUdCdldJVFdRN1NaR2x2aGRJTHo4YV9CV25uRWkzWE12VHRLNHRJZ3EwZ3dfNXNGQ01sLXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Dencun - The planned upgrade for March 2024! - Cointribune EN",
        "content": "Fri 09 Feb 2024 ▪ 3 min read ▪ by Eddy S.\n\nThe Ethereum Foundation recently announced the deployment date of the Dencun upgrade on the mainnet. Scheduled for March 13, 2024, this long-awaited hard fork will bring significant structural changes to the Ethereum network.\n\nEthereum, Technical Improvements Brought by Dencun\n\nTechnically, Dencun introduces several notable new features to the Ethereum blockchain:\n\nTransition to a proof of stake consensus to validate blocks, replacing energy-intensive mining with validators. This is a fundamental change in the protocol, ending the use of intensive computing power to secure the network in favor of a system based on holding ETH.\n\nTransaction fees significantly reduced, divided by 100 thanks to Dencun. The Ethereum network becomes much more affordable for end users and improves its competitiveness against competing blockchains.\n\nImproved scalability achieved through larger blocks and solutions like sharding. The goal is to support 100,000 transactions per second compared to only 15 currently. This increased capacity is crucial for Ethereum to meet growing demand.\n\nEnhanced security thanks to new EVMs and “proto-danksharding.” These technical changes will make smart contracts and transactions on Ethereum more robust against exploits.\n\nThese technical improvements prepare Ethereum to welcome many more users and decentralized applications. They significantly modernize the infrastructure to make it more efficient, secure, and scalable.\n\nThe Economic Impact of the Hard Fork\n\nBeyond its technical implications, Dencun will also have significant economic repercussions on Ethereum:\n\nEnd of new ETH issuance through mining, replaced by only 900 ETH created each day. This drastic reduction in the network’s native inflation strengthens the scarcity of Ethereum (ETH) and favors an increase in its price by eliminating mining sales.\n\nDestruction of transaction fees, made possible by the EIP-1559 mechanism. This mechanically reduces the total number of ETH in circulation when network activity is high. A positive deflationary impact.\n\nAnnounced end of the triple halving of issuance with each major fork. Dencun will be the last fork to divide the issuance by three. In the long term, ETH becomes increasingly scarce.\n\nStaking rewards encouraging Ethereum holders to participate in securing the network, with an estimated yield between 5 and 15%. A much less inflationary model than mining.\n\nWith its Dencun upgrade, Ethereum enters a new decisive technical and economic era on March 13, 2024. These fundamental changes position the blockchain as an ideal infrastructure for Web3 and decentralized finance, and the anticipated positive impact on the value of ETH also generates considerable interest from investors.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxPeWJ2Ry1GQWRYczVuWW11ZUNsZmdJZl9Md2EtWUVoeUZ2czBCdkQyNnVtcndSRlBHeHBZdnd5ZFlGUUNqRDhvV19FakEzNkRMR3hENS12Z2RMZEk3Vm5JNmFueU82czRqMXpVSVluRnJkNWh1ekdkeHk5ZU90XzdTa3dOZGMzdHd0SFdPUkNRaF8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Feb 2024 08:00:00 GMT",
        "title": "COTI leaps 55% following latest Ethereum MPC privacy innovation - CryptoSlate",
        "content": "COTI’s privacy-focused Ethereum L2 development reached a critical milestone by successfully integrating its Multi-Party Computation (MPC) protocol. Its token price surged approximately 55% following this technical achievement.\n\nMPC is a powerful cryptographic tool that allows several parties to work together on a computation using their private data without revealing that data to each other. COTI confirms that the successful implementation of the MPC protocol represents the first in a series of technical goals they will meet before COTI V2 is fully deployed.\n\nCOTI V2 architecture and MPC integration.\n\nCOTI V2 architecture hinges on MPC technology, ensuring the privacy of its Layer 2 computations on Ethereum over private inputs executed without compromising data confidentiality. Participants supply encrypted data to an MPC’ black box’, which executes specific computational processes. MPC results are delivered in a way that safeguards data integrity throughout, even amidst potential external scrutiny. Each MPC entity, dubbed an “MPC endpoint,” will later integrate into the project’s custom Extended-EVM execution module.\n\nMPC endpoints facilitate collaborative computation without sacrificing data privacy. This advancement significantly improves EVM functionality, unlocking support for more diverse dApps within a framework offering transparency alongside essential privacy capabilities. This integrated MPC architecture provides greater privacy and security for complex computations on-chain, potentially fueling wider adoption of Ethereum technology as use cases expand.\n\nTo facilitate MPC use, users first establish cryptographic key material. Next, data is submitted in encrypted form for safe storage. Users then submit workloads in secure MPC bytecode, with operations like addition and multiplication taking place on confidential data without exposing those original values. Workloads can generate public outputs or outputs specifically encrypted to remain accessible only to chosen users.\n\nTesting and future plan.\n\nPer COTI, a simulated state was tested within MPC modules as they collaboratively generated a ‘garbled circuit.’ This cryptographic concept represents a specific computational function and has inherent security, being inherently single-use. This provides forward and backward secrecy through design.\n\nThis first development milestone includes completing the protocol, including design and algorithms. Importantly, COTI developers demonstrated the capability to securely input and output data using distributed keys, enabling advanced encryption and decryption functions without compromise.\n\nThe achievement of this privacy-focused landmark emphasizes the progress towards COTI’s ambitious Layer 2 solution. A COTI blog post states,\n\n“The creation and implementation of a secure MPC protocol is the first of many development milestones we’ll reach throughout the year. Stay tuned for further COTI V2 updates as development continues.”\n\nMentioned in this article"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMi4gFBVV95cUxNTDNnZmZWdERIeUpDUU5VdTlHbjd5cVF6Ul9CeXJmUWViM2xlOHp0NXFtZFAyUWJ5c1o1YTgxZzdjeUI2T1BZRTVRVkNhVlU2UnhEWWxzMmtka1RVaVhNdV92cjkwcnowdjN0MGl3Nm5MTUxYWEZVVHJrN3VRTzAxdzJwWXItNWxId0xxNUhfbE5RTWYzMVVBMnhwOGdhdEp5ZkZ0WExhTjhDUVpKVDVaZk5HaXZ4MjFqZDhsNkVVLUlGX19SWUZJelIxRW5KN1Z1dWx5dXZwYTIyVTlEMkdybVBR0gHnAUFVX3lxTE16MkpKVGJPMkdRdXZvNDktMEx6RUprNHF0LTFnczBsWW4zWVFvaWR2aFhqaFEwZmdkUHJjZURvT0lNajBXZUF0TnNVeUNtcWJITGV5a2hHUTgzbm4wM2dTZUJRTjQ2MDJvaENob3NBNDNBRFVPVjQ1dWZJRFZVaHlTNHRCQzhfZEEyRnlzdGdRczFBM1VNTGpmZ0RFbXN4UHEwaW5nU1VpcHJLeVNKT2xlUHpOaGVNeGc4aXZlYnNpVVFjZTV6Y1BXb3BubnNhQVVwbTA3STJySXV0WVJkNkZGNjFNN29ZVQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Feb 2024 08:00:00 GMT",
        "title": "Ethereum (ETH) rockets ahead this month – So why does a market analyst fear further collapse? - FXStreet",
        "content": "Among the top 10 most capitalized cryptocurrencies, Ethereum (ETH) has outshone its peers, marking the strongest performance with a 7% increase over the week. As market analyst for FXStreet Mike Ermolaev noted, the ETH price recently peaked at $2,706 and, even despite a pullback, many are eagerly eyeing the potential for Ethereum (ETH) to breach the $3,500 mark in the near future.\n\nNevertheless, according to Ermolaev, the possible declaration of ETH as a security could cast doubt on the possibility of reaching this coveted milestone. He also points out a crucial detail that could temper expectations: some technical indicators suggest a potential slowdown in Ethereum’s (ETH) growth.\n\nEthereum (ETH): Updates, sentiments, and transactions\n\nEthereum (ETH) has exhibited significant growth while trading within the range marked with its support at $2,016 and resistance at $2,633. The ongoing price increase may be associated with the upcoming Dencun update aimed at increasing network scalability and stability.\n\nAdditionally, one of the main pieces of news was that Whale Alert flagged a series of sizable Ethereum (ETH) transactions totaling close to 240,000 ETH. These movements have piqued the interest of traders and investors alike, especially considering that the majority of these transfers were directed towards leading crypto exchanges. Such big movements often raise questions about potential market shifts and the intentions behind such transfers.\n\nAdding fuel to the fire, Prometheum is poised to make waves with its upcoming announcement of custody services for Ethereum (ETH). With ETH's market capitalization trailing closely behind Bitcoin at $280 billion, this move may serve as part of a larger effort by Prometheum to challenge regulatory perceptions and push for Ethereum (ETH) to be recognized as a security – a stance met with skepticism by industry peers.\n\nEthereum (ETH) technical analysis\n\nDespite a small pullback observed earlier in the week, the ETH price has shown good growth, but key technical indicators depict a mixed picture: the Accumulation/Distribution Indicator (ADI) sits at 30.06, indicating moderate buying pressure.\n\nDespite the bullish crossover, the MACD signal line at 8,83 remains slightly above the MACD line at 7.3. This suggests a potential bearish divergence if the signal line continues to diverge away from the MACD line, indicating weakening bullish momentum.\n\nEthereum (ETH) price prediction\n\nIn a bullish scenario, if Ethereum (ETH) manages to break above the resistance level at $2,633, it could signal further upside potential toward $2,983 and $3,600.\n\nConversely, in a bearish scenario, if ETH fails to hold above the support level at $2,016, it might trigger selling pressure, potentially pushing the price lower towards $1,750 and $1,134.\n\nWhat awaits Ethereum (ETH)?\n\nEthereum’s (ETH) recent surge past the $2,400 barrier has sparked both excitement and concern among investors. Ethereum’s (ETH) upward trajectory is supported by optimistic sentiments and bullish predictions from industry experts. However, according to Mike Ermolaev, the path forward is uncertain, with key technical indicators suggesting potential challenges ahead. As Ethereum (ETH) navigates these dynamics, attention will remain focused on its ability to maintain momentum and potentially breach the $3,500 mark. But it remains unclear what will happen if Ethereum (ETH) is indeed declared a security. There is reason to fear that this event could crash the indicators to historic lows."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxNNDhxVUJZbVBIdWVpRm9WdUdWLUhpQ01mN0NINlVtWnExR0Qwd0ZIaFZmSTdXSzU3VDZvSXJncU5oZHJ0NHRvRmpaVm1UYkNMOGw1TGotZURUSXhGRjdndHM5cS02YllNUThYVXBfbXlhdjJrT1RtNEdTcG1meVczN0x6bUxIRGFRQXdhaXE1ai1hWndKR1doS0FYblBuVTlV0gGoAUFVX3lxTE9QTmR0Wmh6ajNaQkZ6a3hWbHpmeUdaNHRUdDh0T3JQQnp2YWhGbk9kTTk3ZTd4TlhCeG5GQjBOU2dDMFUtQXZUbHRQb3drSWo0WE9XVlo1aG1nT2ZwTG11NDJPMzNNaGRQajVFYjJTTmtwMnloVFJrZ2p1alNsMlNKRVdERExpd3k4WGE2X0diSUcwM3g4bE5HaE5MYU00Rll6X1NKclpJZg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Feb 2024 08:00:00 GMT",
        "title": "What Is ERC-404? The Experimental ‘Semi-Fungible’ Ethereum Token Standard - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEstablished token standards for Ethereum include fungible ERC-20 tokens and non-fungible ERC-721 tokens (NFTs). Now an experimental and unofficial new token standard, ERC-404, aims to combine elements of both into a single \"semi-fungible\" digital asset.\n\nWhat is ERC-404?\n\nERC-404 is a new token standard for digital assets on the Ethereum blockchain developed by pseudonymous creators \"ctrl\" and \"Acme.\"\n\nToken standards are formal sets of rules and protocols that determine the behavior of tokens on blockchain networks such as Ethereum.\n\nAD\n\nAD\n\nThe ERC-404 token standard combines features of ERC-20 and ERC-721, enabling the creation of \"semi-fungible\" tokens that employ features from fungible and non-fungible tokens.\n\nHow does ERC-404 work?\n\nNFTs are non-fungible, meaning that they are unique and indivisible; you can't own fractions of an NFT.\n\nERC-404 circumvents this limitation by using token mint and burn mechanics to enable fractional transfers of an NFT.\n\nIssued tokens are linked to an NFT. If you buy a full token, the linked NFT is minted to your wallet. If you sell a fraction of the token, the linked NFT is burned. If a wallet holding fractions of a token purchases enough fractions to hold a complete token, a new NFT is minted automatically.\n\nWhat's so special about it?\n\nThe ERC-404 token standard enables native fractionalization of NFTs, creating new primitives and new mechanics built atop them. This, in turn, allows for experimentation with NFTs and the trading of them.\n\nAD\n\nAD\n\nThe token standard's creators suggest that the goal is to create an NFT with \"native fractionalization, liquidity and encourages some aspects of trading/engagement to farm unique trait sets.\"\n\nThe team behind Pandora, a project using ERC-404, claims that it effectively enables NFTs built using the standard to \"effectively have a token price that reflects a floor price in real-time\" because it allows for \"actual native liquidity.\" Rather than needing a single counterparty to buy their NFT, holders of ERC-404 tokens can sell at a time of their choosing if there's a liquidity pool.\n\nFurthermore, instead of having to lock up or wrap NFTs and issue shares against them, fractionalization of NFTs can be achieved natively without relying on third-party protocols and solutions.\n\nAnother possible use case suggested by the Pandora team is gaming NFTs that incorporate randomization into the destroying and reminting of NFTs.\n\nERC-404 projects\n\nPandora: Pandora is one of the first projects to employ the ERC-404 token standard. It comprises 10,000 PANDORA ERC-20 tokens and 10,000 linked \"Replicant\" NFTs. A Replicant NFT is minted to your wallet if you purchase a PANDORA token on an exchange.\n\nPandora is one of the first projects to employ the ERC-404 token standard. It comprises 10,000 PANDORA ERC-20 tokens and 10,000 linked \"Replicant\" NFTs. A Replicant NFT is minted to your wallet if you purchase a PANDORA token on an exchange. DeFrogs: DeFrogs is a collection of 10,000 Pepe the Frog-themed NFTs using a variant of the ERC-404 token standard, billed as the first ERC-404 PFP collection, which its creators claim is deflationary.\n\nDeFrogs is a collection of 10,000 Pepe the Frog-themed NFTs using a variant of the ERC-404 token standard, billed as the first ERC-404 PFP collection, which its creators claim is deflationary. Monkees: Another PFP collection using the ERC-404 token standard, Monkees consists of 100 NFTs with ten attributes and six traits.\n\nThe future of ERC-404\n\nUnlike the popular ERC-20 and ERC-721 token standards, ERC-404 is \"experimental\" and unofficial. That means it hasn't been submitted for review as an Ethereum Improvement Proposal (EIP) or undergone a full external audit. This means it could have undiscovered flaws, introducing a significant risk to token holders.\n\nThe team states that, \"While these two standards are not designed to be mixed, this implementation strives to do so in as robust a manner as possible while minimizing tradeoffs,\" though they concede it is a \"non-standard\" implementation of ERC-721.\n\nBecause ERC-404 is an unofficial token standard, many NFT platforms and marketplaces do not support it by default\n\nThe team behind the token standard plan to submit it as an official Ethereum Improvement Proposal, a potentially lengthy process. However, their decision to circumvent the standard approval process for token standards could encourage other projects to do the same—which could lead to more unaudited token standards going to market, with the attendant risks to users that entails.\n\nAD\n\nAD"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxNWDc5LW54cFRMQjkxZ2M1T3RpcWJaS0RKQms5WFlZRFJkMk9aN0tLVU9zNHkwVXpyX2dDUkJtMm9MMFplVmlYWWZjQUYzc3A0T25VMkVxQUhlT2lQN3g4aTFLWDhBd1FGbjBQbGxIQ21lc0tQWXJYVEpzQzdBYmdEeVBtWTZuZ0dNT2xmUlNkS2dHWmJoMTFydkp4Z2JwLUtaMDQwYkNxR2F6Um96ZklXNQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Feb 2024 08:00:00 GMT",
        "title": "Wrapped TAO on Ethereum soars to $82m — but it’s all controlled by one person - DLNews",
        "content": "The Wrapped TAO token on Ethereum is gaining popularity.\n\nBut the bridge that issues the token is controlled by a single person.\n\nThe bridge's creator stands to make $16 million in staking rewards over the coming year.\n\nCryptocurrencies tied with artificial intelligence projects have been some of the buzziest lately, and Bittensor and its native TAO token is the biggest of all by market value.\n\nA crypto bridge letting users send Bittensor’s TAO token to Ethereum has soared in popularity in recent months, as Ethereum users clamour for exposure to the buzzy AI token.\n\nThe bridge, which is community-run and independent of the project, now holds $82 million worth of TAO — all at the mercy of one person.\n\nOnchain records analysed by DL News show that the bridge creator must sign off every time someone holding wTAO on Ethereum wishes to redeem it for TAO tokens on the Bittensor network.\n\nIn DeFi, permissioned bridges are unusual. It means one individual or entity has total control over funds deposited into the bridge.\n\nThe pattern of these onchain movements is further explained through chat records in the project’s official Discord server, a messaging app.\n\n“Verification happens at least once a day morning/night or whenever I see a [transaction] come through,” CreativeBuilds, the pseudonymous developer who built the bridge said in the Bittensor Discord on July 9.\n\n“Withdrawals are verified manually but automatically processed once verified,” CreativeBuilds said.\n\nJoin the community to get our latest stories and updates\n\nDL News attempted to contact CreativeBuilds for comments on Discord and via email but has not heard back.\n\nUsually, developers use smart contracts to shift control of crypto bridges from humans to immutable computer code.\n\nBut the Bittensor network cannot handle smart contracts, making it difficult to create a bridge that functions in this way. This bridge was set up by CreativeBuilds, independently from those developing the Bittensor network.\n\nBittensor says it is transforming machine learning by decentralising it, creating a global marketplace for AI knowledge. It enables AI models to share intelligence, forming a digital collective brain.\n\nThe Tao Bridge\n\nThe Tao Bridge works by letting users deposit TAO tokens on the Bittensor side, and issuing Wrapped TAO — or wTAO for short — on Ethereum, which represent the TAO held in the bridge.\n\nIn the context of crypto bridges, wrapped tokens are placeholder tokens which represent tokens held by a bridge.\n\nBittensor’s TAO token has a maximum supply of 21 million tokens and thus the same tokenomics as Bitcoin. As with Bitcoin, there is a halving of the token rewards every four years. The current circulating supply amounts to 6.2 million TAO.\n\nThe project uses a proof-of-stake validation mechanism, meaning the network is secured by TAO holders staking their tokens. Currently, 89% of the supply is staked and the staking yield, paid in TAO, sits at 15.99% annually. For those who run their own staking validator, yields increase to 19.49%.\n\n$16 million a year\n\nOnchain data from TaoStats shows that 150,000 TAO tokens held in CreativeBuilds’ bridge are staked through a connected validator, earning a nearly 20% yield.\n\nIn Discord posts from January 2023, CreativeBuilds said he had been “very clear” about the fact that the funds were staked, and said the staking yield would be used to “to offset the cost of bridge [transactions].”\n\nWith some 150,000 TAO deposited into the bridge, its owner is set to earn around 29,250 TAO over the coming year. If TAO continues to trade at its current value of $550 per token, this haul will be worth over $16 million.\n\nIn the same Discord posts from January, CreativeBuilds said he would “create a system which passes through the rewards to an onchain contract in which users can stake wTAO and receive rewards.”\n\nThe Tao Bridge website does not appear to link to such an onchain staking contract.\n\n‘Just want to make sure it’s safe’\n\nSince October, TAO has rallied 990% amid a broader ETF-fueled rally in crypto assets.\n\nBittensor's TAO token has surged in recent months.\n\nAs the only option to buy the TAO token without using a centralised crypto exchange, the Tao Bridge has surged in use. Since October, the amount of wTAO issued on Ethereum through the bridge has almost tripled.\n\nMany users appear to trust the bridge due to CreativeBuilds’ active role in the Bittensor community.\n\nSome are still wary.\n\nThe Tao Bridge’s code is closed-source meaning that other users and developers cannot check it for bugs, or make sure it does what it is advertised to do.\n\n“Can’t find anything on the team behind it. Are they doxxed? It’s way easier to purchase and store wTao for me. Just want to make sure it’s safe,” said one user in the Bittensor Discord posting under the name The_1Legend.\n\n“The team is me and no I’m not doxxed,” CreativeBuilds replied.\n\nTim Craig is DL News’ Edinburgh-based DeFi Correspondent. Ryan Celaj is DL News’ New York-based Data Correspondent. Reach out with tips at tim@dlnews.com and ryan@dlnews.com."
    }
]