[
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMia0FVX3lxTFBEM0pVc1J5UXpFcWhPa25tRE1jV3RsRXlEaFpCTlRmTWxjMktYRDVZTjNhWndKdk1vVHJvRkxNa1FiU2lZdWp4Zllpb1dTbXV3VzJaMUVFcmpPQWlOQVpCRHRGZlhudmVqZUlB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jun 2024 07:00:00 GMT",
        "title": "Ethereum options traders still bullish despite recent crash: Kaiko - Crypto Briefing",
        "content": "Ethereum sees bullish trading despite recent put-call ratio drop.\n\nShare this article\n\nEthereum (ETH) options traders maintain a bullish stance despite the recent market turbulence, according to analysts at Kaiko. This analysis is backed by the put-call ratio dynamics, which raised in May and suggested a bearish sentiment as more puts than calls were bought.\n\nImage: Kaiko\n\nHowever, this trend reversed in June as the ratio declined, indicating a shift towards bullish bets. This optimism is further supported by the trading volumes at higher strike prices for December expiries, where a significant number of calls exceed the current price levels.\n\nThe positive shift in trader sentiment can be linked to recent regulatory developments, Kaiko analysts highlighted. Last week, the SEC concluded its investigation into ConsenSys regarding Ethereum’s status as a security, which has likely contributed to the bullish outlook among traders.\n\nMoreover, as reported by Crypto Briefing, the spot Ethereum exchange-traded funds (ETF) are likely to start trading in the US on July 2nd. This information was later reiterated by Bloomberg ETF analyst Eric Balchunas.\n\nTherefore, this could potentially trigger a price leap for Ethereum, as experts shared with Crypto Briefing near the ETF approval in May. Although some of the upward movement might be already priced, there’s a significant chance that ETH might sharply increase its price following the start of the ETF trading in the US."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxQT2ZoMDBxSU0wWi1Qc2xHMnp1YkhhZmFXeGhwWm5Dd2I0WEQzSFp5Z2JYaHlTUWlCUFFmWXhEd1Zib3lCc2JaSDBtdzVXaGlOTGg5d3lkUmR6QUlJZ2RyOVJpbk8yc0dxUXFxUG9qb1MzdWtoeDFlTlp6ZVhOMFQ0VdIBhgFBVV95cUxQZGR5ZlZtX1F0TllKZXZOdm1GeTI2S2huVVJ6dGpVZmdUemRjdGg3d1lEYWEyZFdjWEUtSXd6d0stLXk1bmhpYkdKbGduYURmbE9HWGdZRWlqUmhHbTlKZ1owMG45ek85M1gzNnlZVGdjOWRaLTZTTDJnek5CTjFyOWMtS3hpQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Foundation Hacked, Tim Beiko Confirms: What Happened? - U.Today",
        "content": "Ethereum Foundation's Tim Beiko has confirmed that the company's official email was hacked and multiple messages were sent to mailing list subscribers. According to WuBlockchain, hackers got access via SendPulse. For now, users should avoid clicking any kind of links they consider suspicious in the future.\n\nAdvertisement\n\nSeveral suspicious emails sent from the official updates@ethereum.org address led to the discovery of the hack. These emails were found to be fraudulent and to have malicious links that could harm recipients if they clicked on them.\n\nTim Beiko alerted the public on X, warning them to exercise caution and not to click on any links or open any attachments from the compromised email. The Ethereum Foundation uses SendPulse as their email service provider, which is how the hackers gained access.\n\nThe attackers apparently took advantage of SendPulse's security flaws to obtain unauthorized access to the Ethereum Foundation mailing list and distribute phishing emails. Working with SendPulse to fix the problem and secure email correspondence is the Ethereum Foundation's current focus.\n\nAdvertisement\n\nTo stop it from happening again, they are also looking into the nature of the breach. Beiko posted a sample email to assist users in spotting phishing scams. Although these emails may appear authentic, they contain links that take users to malicious websites that are meant to infect computers with malware or steal personal and financial data.\n\nAlways verify the message's content and the sender's email address twice. Before taking any action, get in touch with the organization directly through official channels if something seems off. To receive the most recent information on the breach and security warnings, follow the Ethereum Foundation on social media and on their official website. Email service providers and the Ethereum Foundation should be notified if you receive any suspicious emails. This can aid in stopping the phishing attempts from spreading further."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxNbFNWeUV6U2ZERkVwWktTaGQ0QUVTa0xSVUQ2bGNCUUpHTGFxRjJJbVExYmpfUEdtM09RX1FrOVRzMlFGRW1mZmhoV2VERTRpcXNWSTAydWxnSGQ0U2RTSHdSNTZRT2gxbTNBQWpEV1VCQW1CLVhSTmFMa3ZaYXFaMUEzc3lINjhEckx5aVVBQkNNUXczNnJXQXNNQ1NPXzRrU2xPTURka0Y5OU1LN1lLNWR0MHliVnlpRFN0NA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jun 2024 07:00:00 GMT",
        "title": "SEC Chair Gensler Says Ethereum ETF Review 'Going Smoothly' - Benzinga",
        "content": "U.S. SEC chair Gary Gensler highlighted on Tuesday the smooth progress of Ethereum ETF filings, indicating that the final decision lies with asset managers to make full disclosures for the registration statements to go effective.\n\nSpeaking at the Bloomberg Invest Summit, he said, “I don’t know the timing, but it’s going smoothly,” when asked about the possibility of seeing an Ethereum ETH/USD ETF in the coming weeks.\n\nHe elaborated, “It’s really about the asset managers making full disclosure so that those registration statements can go effective.”\n\nThe SEC chair noted Ethereum futures ETFs are already available, having gone live last year.\n\nHowever, the potential introduction of a spot Ethereum ETF has generated significant excitement in the crypto community and financial markets.\n\nGensler was also asked about the increasing political discourse surrounding cryptocurrency, particularly comments from former President Donald Trump.\n\nAlso Read: Congressman Matt Gaetz Introduces Bill To Allow Federal Tax Payments In Bitcoin\n\nIn response to whether this political momentum surprises him, Gensler reiterated his role as a securities regulator, focused solely on protecting investors and ensuring market integrity.\n\n“I don’t speak about elections,” when questioned about the intersection of cryptocurrency and the upcoming presidential election, when asked about former President Trump's increasing support for cryptocurrencies and criticisms from figures such as Mark Cuban.\n\n“I just really look, my role as a securities regulator, as chair of this great 5,000-person agency that oversees $120 trillion capital markets. We are here to look out for investors, look out for issuers, and, where appropriate, to be a cop on the beat,” he stated.\n\nRepublican presidential candidate Trump has been vocal in his support for cryptocurrency, promising to advocate for Bitcoin mining and to accept political donations in crypto.\n\nAt a recent event at Mar-a-Lago, Trump criticized President Joe Biden’s stance on digital assets, vowing to end what he termed Biden’s “crusade to crush crypto.”\n\nRead Next: FTX Faces Customer Backlash Over Proposed Liquidation Plan\n\nPhoto: Shutterstock"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxNbFNWeUV6U2ZERkVwWktTaGQ0QUVTa0xSVUQ2bGNCUUpHTGFxRjJJbVExYmpfUEdtM09RX1FrOVRzMlFGRW1mZmhoV2VERTRpcXNWSTAydWxnSGQ0U2RTSHdSNTZRT2gxbTNBQWpEV1VCQW1CLVhSTmFMa3ZaYXFaMUEzc3lINjhEckx5aVVBQkNNUXczNnJXQXNNQ1NPXzRrU2xPTURka0Y5OU1LN1lLNWR0MHliVnlpRFN0NA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jun 2024 07:00:00 GMT",
        "title": "SEC Chair Gensler Says Ethereum ETF Review 'Going Smoothly' - Benzinga",
        "content": "U.S. SEC chair Gary Gensler highlighted on Tuesday the smooth progress of Ethereum ETF filings, indicating that the final decision lies with asset managers to make full disclosures for the registration statements to go effective.\n\nSpeaking at the Bloomberg Invest Summit, he said, “I don’t know the timing, but it’s going smoothly,” when asked about the possibility of seeing an Ethereum ETH/USD ETF in the coming weeks.\n\nHe elaborated, “It’s really about the asset managers making full disclosure so that those registration statements can go effective.”\n\nThe SEC chair noted Ethereum futures ETFs are already available, having gone live last year.\n\nHowever, the potential introduction of a spot Ethereum ETF has generated significant excitement in the crypto community and financial markets.\n\nGensler was also asked about the increasing political discourse surrounding cryptocurrency, particularly comments from former President Donald Trump.\n\nAlso Read: Congressman Matt Gaetz Introduces Bill To Allow Federal Tax Payments In Bitcoin\n\nIn response to whether this political momentum surprises him, Gensler reiterated his role as a securities regulator, focused solely on protecting investors and ensuring market integrity.\n\n“I don’t speak about elections,” when questioned about the intersection of cryptocurrency and the upcoming presidential election, when asked about former President Trump's increasing support for cryptocurrencies and criticisms from figures such as Mark Cuban.\n\n“I just really look, my role as a securities regulator, as chair of this great 5,000-person agency that oversees $120 trillion capital markets. We are here to look out for investors, look out for issuers, and, where appropriate, to be a cop on the beat,” he stated.\n\nRepublican presidential candidate Trump has been vocal in his support for cryptocurrency, promising to advocate for Bitcoin mining and to accept political donations in crypto.\n\nAt a recent event at Mar-a-Lago, Trump criticized President Joe Biden’s stance on digital assets, vowing to end what he termed Biden’s “crusade to crush crypto.”\n\nRead Next: FTX Faces Customer Backlash Over Proposed Liquidation Plan\n\nPhoto: Shutterstock"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTE1vYklBNVZZRlkxWm1YNk16SS01Z05wRWJBZmhKMGw0dVN6bmEydkRlakpJbXZaVllyOXNKY3pLNXktYWxTajlBcnBPRkNtZjdWcnl0MkhyaV9kc2VQeW9LYU85NXcxSXpKalE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Jun 2024 07:00:00 GMT",
        "title": "Cega Shark Bull vaults on Ethereum and Arbitrum combine stability with high returns - Blockworks",
        "content": "The promise of guaranteed high yields with downside protection is often a red flag when navigating a sea of DeFi app marketing speak.\n\nYields are often exaggerated while risks get buried. It’s easy to promote sky-high APRs when you print your own token to fund temporary incentives.\n\nIn the offchain financial world, however, there is such a wild beast emerging from the depths: Shark Fin notes.\n\nDeFi app Cega Finance, a leader in exotic options and structured financial products, launched an onchain version on Ethereum and Arbitrum today.\n\nA Shark Fin is a type of structured financial product that offers a unique risk-reward profile. These notes provide investors with enhanced returns if the price of the underlying asset stays within a predetermined range. The name derives from the shape of the payoff diagram, which resembles a shark’s fin.\n\nSource: Cega.fi\n\nThe potential returns sharply increase to a peak if the asset’s price remains within the range, and then level off or decline if the price moves beyond the specified threshold. This structure allows investors to benefit from stable market conditions while protecting against significant downside risk.\n\nCega’s launch provides conservative investors an onchain version with crypto as the underlying assets.\n\nExpansion from Solana to Ethereum\n\nCega debuted its first four vaults on Solana almost exactly two years ago, but branched out to Ethereum in the second quarter of 2023.\n\nRead more: Solana options protocol Cega comes to Ethereum\n\nThe decision to launch on the Ethereum Virtual Machine (EVM) was always part of Cega’s roadmap, but the collapse of FTX in November 2022 prompted Cega to expedite its plans, according to co-founder Winston Zhang.\n\n“We knew that we couldn’t wait, and we wanted to continue growing,” Zhang told Blockworks.\n\nInitially, the team considered expanding crosschain via LayerZero or Wormhole, but ultimately decided to hire a new team of Solidity developers to rebuild on Ethereum.\n\n“While that was a little bit slower, it provides the best affordance for safety and security because we’re able to control the smart contracts design ourselves and not rely on a third party,” Zhang explained.\n\nThis transition, which took three to six months, was particularly a response to demand from large-scale investors like DAOs, funds and high-net-worth individuals who prefer the stability of Ethereum.\n\nThe decision to add Arbitrum was driven by its strong DeFi community and significant TVL, making it an ideal target audience for Cega’s products. Arbitrum’s growth, fueled by platforms like GMX, aligns well with Cega’s offerings, which appeals to trading aficionados and derivatives enthusiasts.\n\nIt’s not a migration — Cega maintains a presence on Solana with thousands of users, and the product will continue to be developed there.\n\n“We are having conversations about what it means to reprioritize the Solana ecosystem and how to think about product parity for some of the new products that we’ve launched on Arbitrum and [Ethereum] mainnet,” Zhang said.\n\nMaking complex products accessible\n\nOne of the biggest challenges Cega faces is how to simplify complex financial products for their non-professional users. They made a conscious effort to create intuitive visualizations and straightforward documentation to avoid overwhelming users with technical jargon.\n\nTypically reserved for accredited investors in traditional finance, the goal is to make this class of investment tools accessible to everyone, regardless of investment size.\n\n“The products that we’re building are ultimately derivatives products, but they add a number of benefits for the end user that they can’t get from existing [perpetual futures] platforms or vanilla options platforms,” Zhang said.\n\nThe new “Shark Bull” vaults target users who might typically have capital on lending platforms like Aave, and want to increase their stablecoin yield without taking directional risk to crypto markets.\n\nThese vaults offer 100% principal protection with a guaranteed yield of 12.7%, and the potential for up to 30% returns under certain circumstances by combining lending and options strategies.\n\nStablecoins’ lending yield forms the baseline return, while a portion of the yield is used to purchase out-of-the-money (OTM) call options on crypto assets — the “bull” component, driving the high bonus payouts if prices rise.\n\nThe lending counterparties in this case are not smart contracts but major crypto market makers, so this introduces some credit risk. Cega facilitates these loans but is not a custodian, and manages the risk through stringent legal agreements and ongoing credit monitoring provided by Credora.\n\nRead more: Bitcoin lenders have a new regulation-friendly option for yield\n\nCega, based in Singapore, emphasizes compliance with global regulations. These days, that requires geofencing the US-based customers.\n\nDecentralization plans\n\nThe company raised a total of $9.3 million from notable investors including Dragonfly and Pantera, and does not yet have a token.\n\nZhang said his team deliberately avoided participating in the points incentivization game popular over the past year, preferring to focus on providing real sustainable yield.\n\n“We’re actually really proud of that,” Zhang said.\n\nEven without incentives, the platform has about $16.6 million in TVL currently, and about $404 million in cumulative trading volume.\n\nLooking ahead, Cega does plan to launch a token while maintaining its core values of responsibility and prudence, Zhang said.\n\n“There’s way too many protocols in crypto and in DeFi that just aren’t built on real foundations,” he said, citing the project’s published values.\n\n“There just have been way too many examples in the ecosystem of carelessness, and lack of responsibility, and that is not us.”\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the Forward Guidance newsletter.\n\nGet alpha directly in your inbox with the 0xResearch newsletter — market highlights, charts, degen trade ideas, governance updates, and more.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    }
]