[
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxNNGZEa2dob0VxUU0tTzE0OWNRY2s0OTdsQ1hBZGN1T0FNRzZ5QkpCenB3WTlfMVBOemkxUlhGcW55U3FJZW9abzNJbWlJQ29uRm5Yd2JqMlNlem5fM2VPd185X2F3cElDZ2QwQjhVRmxFWGh0blZGSC03bG5GMERyTUItc0lWTnJxRkVJc3ZNOE4yNndhNHlKT1RjOXlNZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Jun 2024 07:00:00 GMT",
        "title": "Bloomberg analyst calls for FOIA request into SEC’s Ethereum ETF decision - CryptoSlate",
        "content": "Bloomberg ETF analyst James Seyffart called for freedom of information access (FOIA) requests regarding the SEC’s approval of spot Ethereum ETFs.\n\nIn a June 5 KITCO interview, Seyffart said that public requests should search for “emails, calls, [and] anyone that had conversations with [SEC chair] Gary Gensler” to determine what happened during the SEC’s decision-making process.\n\nHe said unused denial orders could exist due to the agency’s rapid change in stance.\n\nVoting is unclear\n\nSeyffart said the SEC approved the spot Ethereum ETFs through delegated authority, a common approach but a rare choice for the issue at hand.\n\nDelegated authority also means voting records are unclear.\n\nSeyffart said that the choice points to a politically motivated decision, stating:\n\n“Until I have somebody come out and show me smoking gun evidence … this was political.”\n\nSeyffart said the “leading theory” is that a Biden administration member called SEC chair Gary Gensler and influenced the agency’s decision.\n\nA secondary theory posits that someone swung the vote of a Democratic SEC commissioner who previously voted against spot Bitcoin ETFs. The reversed vote could have led the SEC to vote at least 3-2 in favor of spot Ethereum ETFs even if Gensler voted against the funds.\n\nIt is still possible for a commissioner to challenge the decision and force a vote. However, Seyffart said Democratic commissioners are unlikely to gain anything from making the voting record transparent.\n\nHe previously said a challenge is unlikely to influence the actual voting results.\n\nSEC should be less political\n\nSeyffart also discussed the broader impact of politics on the SEC. He argued the SEC should not be wholly apolitical but less political than it currently is.\n\nSeyffart believes that, until recently, the SEC has decided to deny spot crypto ETFs and proceeded to find legal justification for its stance after the fact.\n\nInstead, the chair should choose the issues the agency focuses on and seek legal input from individual commissioners, leading to a decision “based on logic and reason,” Seyffart said.\n\nMentioned in this article"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMi2wFBVV95cUxONzlDaGFndjdJRDNZRFVGemRfZk9Rel9vZjJEN0Z5c19CNXc1cGdKeTlwSjVSRWdXeFk3dDh0VG9ZczBOT2poOUl1ZnM0d2NZMVItdHpBd3lYQ2ticVJEbnl3RWJWTzBSS05KQ19lVW5XYXBXLXpQRWdydGgxS0x2ZjMxbVVSZUo5dTBTSzF3d3NzVlFXQWtSYlFMZktqTkxYZW1rNWcwQ2hjZzdtdEoxWjVCeF9PQ0dMOUtZMFJhUzlzRmh0Z0ZXOFUyNUdwSUFiSDh4ZVd5TERNX2_SAeABQVVfeXFMTnFmNzZQSzlNY3BaU2otWTlMSWY3WUNBUGxERUhFbFpIc1J2RV9oRV9FVXZucC0tRGh0d1B0TDBhalZUaHFUUmdRc1dIc0dlOURSeDRBYy1UVGcwMERkRm8wN0NqR1Z1MDhrS01aSmprYU1obkUwZVd0cXI2X2l0OHJLTHZ4U3NyVTlNUXlHZFlnS2ZGLUd0TlhUcDFrZlRMS3c5Ylh2QmgtVGh4OVZDeE9rcE96cE0tVWFfQUJkbHROSFdReER6WWJ2SGxiQTlMTFlLQVV1Z2FYTUNCN1NzdTQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Jun 2024 07:00:00 GMT",
        "title": "Analyst Says Blue-Chip Altcoin Mimicking Price Action That Preceded Massive Rally, Updates Outlook on Ethereum - The Daily Hodl",
        "content": "A closely followed crypto analyst believes that a top-10 altcoin by market cap is about to soar to new all-time highs (ATH).\n\nPseudonymous trader Kaleo tells his 642,000 followers on the social media platform X that BNB (BNB), the utility token for the BNB Chain ecosystem, is mimicking a 2021 price pattern on the four-hour chart that led to new ATHs.\n\n“When BNB entered price discovery in the Spring of 2021 it initially had a very similar breakout and retest to the one we’re seeing now. Would look to add heavily on this dip, especially sub-$650 if you get the chance.”\n\nCrypto traders and analysts refer to price discovery as a situation where a coin trades at levels never seen before in its history.\n\nBNB is trading for $679 at time of writing, down more than 4% in the last 24 hours.\n\nNext up, the analyst predicts Ethereum (ETH) will break out of a descending trendline against Bitcoin (ETH/BTC), and that could send layer-1 (L1) Ethereum Virtual Machine (EVM) projects soaring.\n\n“Really believe it’s only a matter of time before we see something like this for the Ethereum/Bitcoin ratio. When it happens, be on the lookout for high ETH beta plays including alt L1 EVMs.”\n\nLooking at his chart, the analyst suggests ETH/BTC will soar above 0.10 BTC ($6,926). ETH/BTC is trading for 0.053 BTC ($3,689) at time of writing.\n\nThe trader also says that based on historic precedence, Ethereum is in the earlier stages of the parabolic phase of the market cycle.\n\n“How can you not be bullish here?”\n\nEthereum is trading for $3,686 at time of writing, down 3% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxOOU9nN3JCTy1CV05rX2FSUWhjLXhkMXo3c0dVTUFhWWhUR2FINC0xOUVlTnNsUmYxcG1nY2JoeFRHZHVHSGc3VTJLUmpDSldhRlllQlpwQ19sLTYzQWJJOUlfTEh5WXA3cEpvVFI4ZS03OHZaZTBzUVp5c2N4RndaTWVhbW9RdHgxT1ZoaTRiZ2dJcURVR3hsZXhLeWU4NnNKZ1Y4RVl2LWZRZUEwbHRLRGVLWlR2WnhKWnNZ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Jun 2024 07:00:00 GMT",
        "title": "Here’s Shiba Inu Price if Ethereum Reaches $22,000 As Predicted by VanEck - The Crypto Basic",
        "content": "Shiba Inu could breach the $0.00014 price level if it trails Ethereum price in the event that ETH clinches the $22,000 target predicted by VanEck.\n\nVanEck Sees Ethereum at $22,000 by 2030\n\nFor context, leading asset manager VanEck recently adjusted its outlook for Ethereum, proposing a possible six times increase in price per unit and a $66 billion cash flow. As reported by The Crypto Basic, VanEck’s latest projection was fueled by the recent approval of spot Ethereum ETFs by the U.S. SEC.\n\nWith these investment products poised to introduce greater capital to the Ethereum market, industry experts believe this development could bolster Ethereum’s price, triggering a spike to greater heights. This phenomenon was recently observed with the recently-introduced spot Bitcoin ETFs, which have seen a cumulative net inflow of $15.69 billion since January.\n\n- Advertisement -\n\nThe inflows to these instruments contributed to Bitcoin’s spike to a new all-time high above $73,000 three months back. Considering these events, analysts at VanEck believe Ethereum could record similar gains. As a result, they project a $22,000 price target by 2030, the next six years.\n\nShiba Inu Price if It Trails ETH Surge\n\nMeanwhile, we recently assessed how much Shiba Inu could rise if it trails Ethereum on the back of this price surge. Notably, data from IntoTheBlock indicates that SHIB boasts some level of price correlation with Ethereum, with a 30-day correlation of 69%, as reported by The Crypto Basic earlier this week.\n\nThis suggests that Shiba Inu could follow Ethereum’s price movements to an extent as ETH journeys to the $22,000 price goal. Remarkably, for Ethereum to reach this $22,000 value, it would have to spike by 494% from its current price of $3,700. Also, this $22,000 price would lead to an ETH market cap of $2.64 trillion.\n\nIf Shiba Inu records similar gains, its price could rally to unprecedented highs. SHIB currently changes hands at $0.00002394, having slumped by 5% over the last 24 hours to break below the $0.000025 support. A similar 494% increase from this point would take Shiba Inu to $0.0001423, leading to a new all-time high for the token.\n\nInterestingly, market analyst Rafaela Rigo already predicted a Shiba Inu rally to this price territory. Last month, Rafaela called attention to a possible repetition of the 2021 pattern, suggesting that SHIB has the potential to reach $0.0001406. At a $0.000014 price, Shiba Inu’s market cap would sit at $83.5 billion, a feasible target."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPdHQ3UWY4VTUtMnR1eUhhcjVKLWdWU2YtMWo4WmJOd1VXQzlXRE1vcXVHZTBMZmlSWUlIQXoweV9xaTh4Z09EbEVkV2ZMUFNlak9CTnI5RUZBeFRJb3A4WlBMWFo3U0NDQTV3QVVSUXVEUzdGZHFfU0otNXpsTTJmZkpjUGNobHdrZjNtaGRGZGt4bTA5dURvNdIBngFBVV95cUxNTlk2NVZfVTlNb0RmOExWUjRwMFpjQXl1dHQ0andwUWsyZExlcWtRLWtzaTBoZEtpZklFajZ3UWVZMmxaR0VEZDR0NDh2T21Zb1BSVFNBWWMwbGgxOWpFTDRLWWU0a3pmRmdEdHFjVzNVOC1tdENVSUxmRHVMa0NJR2R4UXlSZzJ5dVAtdWR4UFp0M2o5TDdUUlBPcGZPUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Jun 2024 07:00:00 GMT",
        "title": "What Historical Trends Hint for Ethereum Price Behavior in June? - CoinGape",
        "content": "Ethereum Price: Over the past two weeks, the second-largest cryptocurrency Ethereum witnessed shrunk volatility carrying a consolidation trend above $3600. The daily chart projecting short body candles and rejection on both sides indicates a lack of direction among market participants. Will the BTC price drop below $70000 push a prolonged correction in the altcoin market?\n\nAlso Read: Crypto Prices Today June 8: Bitcoin & ETH Take Bearish Turn, Wormhole & INJ Pump\n\nadvertisement\n\nEthereum Price Defend Key Support Amid Broader Uncertainty\n\nDuring mid-May, the Ethereum price rebounded sharply from the $2860 support indicating the investor continued to accumulate this asset at market dips. The renewed buying force uplifted the ETH value by 39% to reach a 10-week high of $3975.\n\nHowever, with broader market uncertainty the recovery momentum in Ether stalled resulting in a sideways action above $3630. This support coinciding closely with the 20-day EMA slope and 23.6% Fibonacci retracement level creates a high area of interest for buyers.\n\nThe notable rejection of candle tails at this support indicates the buyers are defending this support. For risk-averse traders, a breakout above the overhead resistance of $4090 will give a better confirmation of a prolonged rally.\n\nWith sustained buying, the Ethereum price prediction hints at a rally to challenge the ATH (All-time-high) resistance of $4880.\n\nOn a contrary note, a breakdown below $3630 will accelerate the selling pressure and may extend the current correction for a week or month.\n\nAlso Read: Crypto Market Selloff: Here’s Why Bitcoin, ETH, SOL, XRP, DOGE Prices Slips Today\n\nHistorical Trends Show June’s Mixed Fortunes for Ethereum\n\nEthereum’s price performance in June has shown significant volatility over the past years, with both notable gains and sharp declines. The largest drop occurred in 2022 with a steep decline of -44.79%, while the highest gain was in 2017 at +26.19%.\n\nOn average, June tends to yield negative returns, with an average of -6.76% and a median of -2.53%. This negative bias suggests that June is often a challenging month for Ethereum. However, the data also hints at the potential for sharp reversals, as seen in the positive return of +8.86% in 2019 following a significant drop of -21.34% in 2018.\n\nThese variations are likely influenced by broader market conditions, including macroeconomic factors and regulatory news. Given this historical performance, investors might approach June with caution.\n\nHowever, with steady development for the launch of Spot Ethereum ETFs, the market is better leaning in buyers’ favor.\n\nTechnical Indicator\n\nExponential Moving Average: The Ethereum price trading above the daily EMAs (20, 50, 100, and 200) indicates the path to least resistance is upward.\n\nAverage Directional Index: The downtick in ADX slope at 33% indicates the current consolidation could assist buyers in recuperating exhausted bullish momentum.\n\nRelated Articles\n\nSahil Mahadik Sahil is a dedicated full-time trader with over three years of experience in the financial markets. Armed with a strong grasp of technical analysis, he keeps a vigilant eye on the daily price movements of top assets and indices. Drawn by his fascination with financial instruments, Sahil enthusiastically embraced the emerging realm of cryptocurrency, where he continues to explore opportunities driven by his passion for trading\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE5rM2lpQUl6dWtITFAzTjM3aDlPZWZIem1UMnNhbFFMMy1Ub2FwMkx4ZEZZaUhuV0M3dUtfdjkyWVhOV2oxai1hejBidTNaSWdvbHY1RmlTdXBHMDc4SUp3LVpzYzhEdkFOYU9UeWFsMWE5MTF3T3JfTFhGUVk2d9IBhgFBVV95cUxQa19lbzBIMkNCcVB5YlRtVHMycXpycnBQVW5VYzExa0NKcG5yZDluTUkwU08xSHE1d3VSeC1Mdko1T1NWOVc5QzVvbDA3cEMxbFphazcxZnJORnpCNHZPbGRmWEYxZlNlV1FQRW5jTnhNazdCWk8yMVJKWkdPRlNkRHQ4Ui1qUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Jun 2024 07:00:00 GMT",
        "title": "Why Ethereum Layer-2 Network Taiko Is Spending $100K Daily on Blobs - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAn Ethereum layer-2 network named Taiko is dominating the market for so-called blobs, or dedicated data storage for Ethereum scalers—but those endeavors are resulting in tens of thousands of dollars worth of costs for the little-known scaling solution each and every day, even topping the $100,000 mark multiple times this week.\n\nThe Taiko protocol, which went live in late May, seeks to offer users cheaper and faster transactions than on Ethereum's mainnet, while borrowing elements of the network's security. Since going live, Taiko has spent a whopping $900,000 on blobs in less than two weeks to funnel users’ transactions over to Ethereum’s network.\n\nMeanwhile, Taiko’s competitors, such as the Optimism network, rarely spend more than $1,000 per day on Blob-related fees. Introduced in March as part of an Ethereum upgrade, blobs were billed as a new resource for layer-2 scaling networks to post Ethereum transactions more cheaply.\n\nThe protocol’s maker Taiko Labs announced in March that it had raised $15 million in a Series A funding round. Leveraging “zero-knowledge” cryptography in its design, Taiko is striving to differentiate its scaling design in an increasingly competitive field that includes dozens of different scaling networks.\n\nAD\n\nAD\n\n“Taiko just launched its mainnet, and there’s a lot to be figured out before it becomes stable,” Taiko Labs CEO Daniel Wang told Decrypt in a written statement. “We knew that we will use more blobs than other layer-2s. This is a design decision, not a bug.”\n\nLayer-2 networks often work by bundling batches of transactions together and processing them on a separate chain before posting receipts back to Ethereum. However, Taiko’s design differs from that formula, where lots of transactions are rolled up into batches elsewhere.\n\nInstead, the process of ordering transactions, known as sequencing, takes place on Ethereum itself. In a blog post, Taiko Labs said this process, dubbed “base sequencing,” is more decentralized than that of other layer-2s that rely on centralized sequencers—which are controlled by a network’s development team and collect a small portion of users’ fees.\n\n“That sounds expensive,” Alexei Zamyatin, the co-founder of Bitcoin layer-2 network BOB, told Decrypt in an interview. “It makes it more secure, but not as secure as [Ethereum], and you’re also much more expensive than most layer-2s.”\n\nAD\n\nAD\n\nA game of tradeoffs\n\nStill, Wang stated that the costs associated with Taiko’s functionality could easily reach the point of break-even if “Taiko is fully utilized by users,” providing a sustainable amount of gas fees.\n\nWang added that Taiko is fully aware of the pros and cons associated with its sequencing method, and he hopes that Ethereum researchers will study Taiko’s on-chain data to explore improvements that could allow Ethereum to better support similar scaling networks.\n\nSome Ethereum researchers, including Justin Drake, believe that Taiko’s team is trailblazing a new form of decentralized sequencing that could solve key hurdles in Ethereum’s ecosystem.\n\n“It is making a leap forward in the decentralization, credible neutrality, and composability of rollups,” he told Decrypt in a written statement.\n\nIf more layer-2 networks shifted the sequencing of their transactions to Ethereum itself, then fragmentation issues holding the entire space back could be solved, he stated. As of now, liquidity and assets are largely spread out across different layer-2s, effectively siloing users and applications within a given scaling solution while all being tied to Ethereum.\n\nWhen it comes to layer-2 networks on Ethereum, the introduction of blobs represented a significant shift in how those protocols interact with the underlying blockchain. Before blobs were available as a separate fee market, layer-2s could only post bundled transactions in the form of Ethereum “calldata,” a space for data to be contained within transactions.\n\nInstead of trafficking users’ transactions in bulk alongside regular Ethereum activity, blobs serve almost as a dedicated lane on a highway, where less congestion can reduce costs. However, the best way to package those transactions before they’re shipped is still up for debate.\n\nBlobs blobs blobs\n\nIn some cases, centralized sequencers can be leveraged to grind a network to a halt, puncturing the veil of permissionless activity that is synonymous with crypto. Sometimes, centralized sequencers can be abused to delay transactions too. However, Taiko’s commitment to decentralization may not be the most efficient, according to one of its community advocates.\n\nAD\n\nAD\n\n“Sadly, it’s kind of expensive,” the pseudonymous crypto researcher arixon.eth said on Twitter (aka X). “Because of based sequencing, we need to post a blob every 12 [seconds], and if there aren't enough [transactions], then we just won't fill the blobs.”\n\nBecause of based sequencing, we need to post a blob every 12s and if there aren't enough txs then we just won't fill the blobs Sadly it's kinda expensive, so we really need based preconfs — arixon.eth (@arixoneth) June 1, 2024\n\nWang of Taiko Labs said changing this pace could be a potential solution enacted soon, stating that Taiko’s community is “considering lowering the block proposing frequency a bit.”\n\nThe constant stream of blobs, regardless of how full they are, has made Taiko a top user of them. On Sunday, for example, Taiko posted 25% of all blobs on Ethereum, according to a popular Dune dashboard. That day, Taiko spent nearly $63,000 on blob-related fees.\n\nOn Thursday, Taiko paid $123,000 in fees for blobs—representing 73% of all costs paid for them across layer-2s—which was its second straight day with a six-figure fee tally. And while most layer-2s pass cost savings onto their users through lower fees, the premium Taiko is paying for decentralization, as of now, isn’t a bill that users need to foot.\n\n“For now, it's partially subsidized by the team,” arixon.eth said, adding that the process could be modified in the future so that “blocks are missed until there are enough [transactions] in the mempool for a proposer to push a block to [Ethereum] profitably.”\n\nAmid the network’s first airdrop on Wednesday of TAIKO tokens, the network’s native cryptocurrency, the layer-2 averaged around 6.42 transactions per second, according to L2BEAT. Meanwhile, Ethereum registered around 13.6 transactions per second itself.\n\nSo far, the performance of Taiko’s token has been turbulent. After crashing 40% an hour after it launched, to $2.27 from $3.80, the token’s price had recovered to $2.45, as of this writing, showing a nearly 3% decrease over the past day, according to CoinGecko.\n\nAD\n\nAD\n\nEdited by Andrew Hayward"
    }
]