[
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxPMXN2T1dEMllSUlU1ZTJWWTcwQnlyOVBDbzI5YmF3ZnlBVV9ndGg2WGNwZWx5YWFVVlh4eVo3VHRrTFptb3BWWHN4b3BuclBOT0dpazFvM2ZJaHUxRzQ0b2hvWlozejBFalBadUtNeTN3aEpmcllHTmtfUnYtT05aTGxsc2p1bjlKU0otMU9KMnU5cy12NmtMZURqa1pKdXNSOHdqbzBBWGQ5X3BwbHItUlVQUFB2MFZmTnQ2UzRsMDTSAcYBQVVfeXFMTTAyQjUtY3ZncF93ZWJTQVpPemhvX3dRRkIwVzJkM3l5c0piS2swOEtaQUt5bVctNkUzcnc5RHZSdFl0aVh6SzZwTTFUUzVSVEhDM3g4MDU3RW5WWVJHbFF1NU5kbFI4NDhJV0JaTUdQZzFMTVNuS2djUk1hU1ZEVk00a2dqNkV0M2Y0clhGLWhsbkFhZGNfWVNPdzRkeDVzcnJ3Zmg4TzFvbHlOdTNtcWhxeVpHNDZUdk5lLUlYMnF6dlR2QjR3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Mar 2024 07:00:00 GMT",
        "title": "Ethereum Staking Protocol Swell Unveils Layer-2 Rollup With $1B Total Value Locked - CoinDesk",
        "content": "Restaking refers to a process on the Ethereum blockchain where ether (ETH) tokens that are deposited as security for the network, a process known as staking, can be repurposed to secure additional blockchains and protocols."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxQNm5saVZ6dUVLS2R2TkpLd09XakRlOWs4N0ptR1pmdFUwa0ttQmNnQmY4M2lyWkVBbWNIcEs2Y0FIRTNkdklUS3djYWw4dXVCMzJmSHowTzFuV3NBeEllZTM4NEFteGNVbGY5ZGkxRXY1LUppd1ZSM1BJZG5UWU1YZGJ1a2c2VjF3T0s4VVZRY0tSdjZ5bENrbmIwaVYtQUhPOTg1T0pPcjVBWjlEaVl1QWpn0gG3AUFVX3lxTFBGbGRfQndpR01RakdDdHhCS21fLVlSX1dlRmdJbGZ0dXlCOUE1R2pYbHlEQVlOZ2dYamFPTEVwdEZoZXdMM0VsbXRqU0h1Z0cxaVUwX2pPMjNwNGFfRW9ja0NmMDFqWGhOVUROZnZqc3dYbWc2ekJlUi04ZmlyelBqd2MxUzg5X0h2LVVFR3ljMFhzb2NYRXVpMkw2OGRTZ1oxWDJkSTJvME5FNkI4cnlXeVhTQ1Bfcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Mar 2024 07:00:00 GMT",
        "title": "Ethereum Finalizes 'Dencun' Upgrade, in Landmark Move to Reduce Data Fees - CoinDesk",
        "content": "The price of ether (ETH), the native cryptocurrency of the Ethereum blockchain, was little changed in the wake of the upgrade. Over the past 24 hours, the ETH price was down 0.5% to $3,968. The cryptocurrency had rallied about 50% over the past month, in sync with the 49% rise over the same time period in the benchmark CoinDesk 20 Index of the largest digital assets."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTFBHcTk5ZUYzZ3NnYjdqc3YxMGhnTm8wOHVGMjN5YXBOcGktd0dnRkZvM25BY1JaMDN5RzJnT0NWQmg3cHEwVUFid1VZdF9INTY2M0VZZWhheFpfZTl2VjdHZzh1bHA1cTBtSmc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Mar 2024 07:00:00 GMT",
        "title": "The biggest Ethereum upgrade ever goes live - Blockworks",
        "content": "The long-awaited Dencun upgrade activated on Ethereum mainnet Wednesday at approximately 9:55 am ET — or the start of epoch 269568 if you’re following on-chain.\n\nA scalability-focused upgrade, Dencun features EIP-4844 or Proto-Danksharding which carves out a dedicated data channel on Ethereum for layer-2 data, dramatically reducing the transaction fees on rollups.\n\nBut that’s not all. Dencun ships a total of 9 Ethereum Improvement Proposals (EIPs) in all, making it tied for the largest single hard fork in terms of improvements shipped, according to Tim Beiko, who coordinates the Ethereum core developer calls, on the Ethereum Foundation livestream commemorating the event.\n\nRead more: Ethereum Improvement Proposals to watch in 2024\n\nPost-Dencun, most rollups and their users will see benefits within hours to days, as the availability of data blobs on Ethereum — introduced by EIP-4844 — should slash transaction fees by 5-10x.\n\nThis real-world benefit to users is primarily driving anticipation for the upgrade, according to Hannes Graah, a builder of crypto wallet Zeal.\n\n“The Dencun upgrade brings us closer to a future where fees are an afterthought, not a dealbreaker,” Graah told Blockworks. “Just as we generally don’t worry about the cost of traditional domestic bank transfers, Web3 users should be able to transact without worrying about fees.”\n\nAki Balogh, co-founder and CEO of DLC.Link, likens EIP-4844 to the “NoSQL movement of the 2010s,” which removed constraints of structured SQL data, through developments like MongoDB.\n\n“Giving developers large blobs of temporary data (deleted after 30 days) provides them the opportunity to innovate while not increasing load on the network,” Balogh told Blockworks, removing a major Ethereum bottleneck. “Similar to Mongo’s effect, this proposal will help innovation as dApps and chains find new ways to use the temp storage space,” he said.\n\nIn contrast to scaling in Web2, this new data storage channel for Ethereum doesn’t sacrifice decentralization, notes Philippe Schommers, head of infrastructure at Gnosis, which implemented Dencun already on Monday.\n\nRead more: Gnosis Chain premieres Ethereum’s Dencun hard fork\n\n“When working towards scalability solutions on the blockchain, there are choices that developers have to make to prioritize decentralization,” Schommers told Blockworks. “When you look at Web2 infrastructure, it’s easy to see how centralized scalability can be done, but that’s not the path we’re trying to follow.”\n\nWhile “less glamorous” Schommers said, it was part of Ethereum’s “big ambition,” calling Dencun “one piece of the puzzle that gets us a little bit closer to building a larger scale, fully decentralized network.”\n\nOthers are more effusive.\n\nLucas Henning, chief technology officer of Suku, says it’s still early days and the upgrade “will guide the Ethereum ecosystem towards a more sustainable future.”\n\n“It’s an exciting time for Ethereum, and I am keen to see the effects of these changes on the decentralized world landscape,” Henning said.\n\n“It’s the moment we’ve been waiting for,” said Eli Ben-Sasson, president of StarkWare. “Today will go down as the date of birth for a dapp-for-everything culture.”\n\nUpdated March 13, 2024 at 11:30 am ET, clarifying Dencun is equal to one earlier fork for the most number of EIPs included.\n\nCorrection March 13, 2024 at 1:40 pm ET: Misattribution of one quote.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxOSHh6Y1NqeGd2cmZVMi00VGVzQzRJYk1TUWpEQ29oU1pLeVNfNWc2YU14LTVEVFRQWG1LTVZtbWE5VktNOHZPdmFWTXAtUFo4U2hOWkdQM1BRcTV6NDdVTi1IZjQwQXJtejZCeWJaWDhmODgwWjhCOThJU3lxb0NieURzZUEybldfRmtR0gGTAUFVX3lxTE9JSlJWbHRraUljRDJsUWJXZ1JoVXZkSk05dFluMGJKLVBkVV9wWkNUVGVoSWJJWGtwd1M1OFQ5ZFhTUkRva3NvSDY4UHg5SWwzRF90VlZ0RkxUT01Kd1lDdTNXenNWMkNBdGEtdE1zY0RJZTdqQjJLZktodTBxOTJZYW9UcDZDTmRRTDVmMGFaT2VCbw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Mar 2024 07:00:00 GMT",
        "title": "Dencun Upgrade Goes Live, Ushering in New Era for Ethereum - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEthereum’s much-anticipated Dencun upgrade went live Wednesday morning without a hitch, ushering in a new chapter for the blockchain that is poised to substantially lower transaction costs across Ethereum layer-2 networks and massively expand the blockchain ecosystem’s capabilities.\n\nJust before 10 a.m. EST, the Dencun upgrade was successfully implemented. It will now take a period of about a month or two for settlement contracts across all layer-2 networks to incorporate the update. Once they do, gas fees on layer-2 networks should immediately fall by 75%, Terence Tsao, a developer of Ethereum layer-2 network Arbitrum, previously told Decrypt.\n\nScreenshot of Ethereum Foundation YouTube livestream\n\nLeading up to the hard fork, Ethereum developers held a livestream on YouTube to discuss the different Ethereum Improvement Proposals that would be rolling out as Dencun went live and explain some of the new terminology, like blobs—which are a new way to organize and send data on the network.\n\nAD\n\nAD\n\nAs the upgrade went live, ASCII art of a blob appeared on the screen.\n\nEthereum has undergone multiple flashy upgrades in recent years, including the 2022 merge, which transitioned the network to an energy-efficient proof-of-stake model, and 2023’s Shanghai upgrade, which unlocked tens of billions of dollars worth of ETH staked with the network for withdrawal. But several developers who help build Ethereum believe that Dencun is poised to change the network to a degree never before seen.\n\n“I think that this upgrade will have the biggest effect for users of all the Ethereum upgrades yet,” Marius Van Der Wijden, an Ethereum core developer, told Decrypt. “Dencun is a much bigger update than Shanghai.”\n\nNot only will Dencun drastically cut transaction costs on layer-2 networks; it will also, by doing so, redefine the Ethereum ecosystem’s capacity to process massive swathes of transactions, and thus lower barriers significantly for moving projects, transactions, and data on-chain.\n\nDavid Silverman, VP of Product at Polygon Labs, previously analogized to Decrypt that Dencun will single-handedly expand Ethereum from a country backroad into a four-lane highway, in terms of the efficiency and ease with which the ecosystem will soon be able to process unprecedented amounts of on-chain traffic.\n\nAD\n\nAD\n\nGas costs might drop so low following Dencun that they will be covered by crypto companies and projects going forward—essentially making such fees a thing of the past, Silverman added.\n\nSuch an unprecedented shift in the economics of Ethereum would come at a time when gas fees on the network's mainnet have recently spiked to near-unusable highs. That fact isn't lost on Dencun's developers.\n\n\"We are focused on scaling and reducing fees in L2 at a time when Ethereum's usage is reaching high volumes again and gas fees are a noticeable cost to most users,\" Ethereum core developer Preston Van Loon told Decrypt.\n\nKey to Dencun's near-elimination of gas fees is proto-danksharding, a novel method for data storage on Ethereum introduced by Dencun. Proto-danksharding, which utilizes features called “blobs,” will allow layer-2 data to be stored on-chain temporarily for a period of about a month. Until now, data could only be stored on Ethereum forever, an immensely expensive option that greatly limited what data was uploaded on-chain.\n\nDevelopers hope that Dencun will usher in a new chapter for Ethereum, one in which there are essentially no limits—related to cost, storage, or anything else—on the amount of data that can exist on-chain. Such a landscape could revolutionize the types of projects and tools built across the Ethereum ecosystem.\n\n“I hope Dencun will unlock new use cases that were not possible before,” Ethereum’s Van Der Wijden said. “We’re not building this for short-term unsustainable gains, but for long-term sustainable growth.”"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxQMVdvQl9XMERSUFBPWUY1OWFpNTROUVJ0dnNSU01jTy1OYjN4MVBSS0dpdVR1ZC1ySGJ5VHROTHpBcnMzVHBDbGlLd0t2OXV3LUI3bkpGaTFjR1pScVp5aUZESXM5SDRWMGNFR2NMUmxVUml0RjhnWF9XM3g1cnZyNFVHS0plTG9COUIyOGpPTjUyMGtCazh0UzVRclE1SXc2SXBkenA3UlNHc2dJdTNwSA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Mar 2024 07:00:00 GMT",
        "title": "Ethereum Completes Milestone Dencun Upgrade, Which Should Substantially Reduce Fees - Unchained",
        "content": "Layer 2 blockchain networks can now use a different way to store data, which is intended to help these rollups scale the Ethereum blockchain network that was plagued by huge spikes in gas fees in years prior.\n\nEthereum has completed a significant upgrade of its blockchain network, which is expected to pave the way for the next generation of crypto users to transact onchain without suffering significant spikes in gas fees.\n\nThe upgrade, named “Dencun,” was completed early morning Wednesday ET after it was activated on Ethereum’s mainnet at epoch height of 269568, according to Ethereum developers in a live stream on YouTube. At one point, more than 3,600 people were watching the official rollout of Dencun on the livestream.\n\n“We basically enter this new era of Ethereum scalability,” said Anthony Sassano, the creator of Ethereum-focused media site The Daily Gwei, referring to how Dencun implements EIP-4844 and “proto-danksharding,” which creates a highly optimized and much cheaper storage space where rollups can post data to called “blobspace.”\n\n“It’s the first step on a long journey that has been going on for a few years now towards what we [Ethereum contributors] call full danksharding, which will greatly increase Ethereum’s scalability properties specifically for layer 2s,” Sassano added.\n\nRead more: How Much Will the Dencun Upgrade Really Reduce Ethereum Layer 2 Fees By?\n\nDencun is Ethereum’s most substantial software change since Shapella, which occurred about 10 months ago. Before the hard fork upgrade, rollups had to store information such as transaction history in calldata, which is “really expensive, because Ethereum calldata has to be stored forever,” said Polygon’s vice president of product, David Silverman, in an interview with Unchained.\n\nAfter the upgrade, when rollups post data to this new blobspace in the form of “blobs,” the information isn’t stored forever and so it’s much cheaper, while still providing similar security guarantees. Consequently, “rollups can generally pass those cost [savings] on along to their users,” lowering transaction fees on Ethereum’s layer 2 networks, Silverman added.\n\nThis impact could occur immediately or more gradually over time. The various L2s will go through their respective governance processes to change the target of where they’re posting data from either calldata to blobspace or possibly a mix of the two. This means some networks may see changes immediately on day one, while others may take as long as a month-and-a-half, depending on when their governance votes are held and how easy it is for a rollup to integrate the upgrade, noted Silverman.\n\nFor example, the team for the layer 2 blockchain network Base, which was incubated by crypto exchange Coinbase, said in a blog post that Base will have support for the Dencun upgrade on the first day.\n\nAnother Ethereum rollup, zkSync, is already ready to submit blob transactions, per Daniel Lumi, senior product manager at Matter Labs, the software firm building zkSync, adding that zkSync has a solution for where the protocol decides to post data.\n\nGetting Lucky\n\nThe Dencun upgrade comes as the price of Ethereum’s native cryptocurrency, ETH, is trading around $4,000, a level not seen since the end of 2021 before Ethereum changed its consensus mechanism to proof-of-stake.\n\nWhile Ethereum developers don’t implement upgrades based on market pressure, the Dencun upgrade implementation coinciding with the start of an early bull market and ETH trading around the $4,000 level is “lucky,” Silverman noted.\n\nThe DeFi Summer in 2020 ended in part because Ethereum’s infrastructure was not ready to accommodate the mass of new users coming onchain, which became evident when gas prices to execute a token swap on a decentralized exchange soared to hundreds of dollars.\n\nAs a result of Dencun and specifically EIP-4844, which will bring transaction costs down, “we now have a ton more capacity from all these rollups to handle this next generation of users without gas prices spiking up to $200 [or] $300 per swap, killing our momentum,” Silverman said. “We got lucky in the sense that we got this [the Dencun upgrade] out of the way before retail is coming back.”"
    }
]