[
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxOd1p2RVBvaHpkSkxpdGtTX3VuZXN1Q3hxTElTV3BGdjk1UV9rcUdBOEZCejNRQlAzdmtBa09oaHhmZzN4WXRFSkVnaFMteC1xaGU0MDNHMDVvT1BRSlo2eTRsaVRHYWdabExsdERlWE5nakJqak05QUNMZzN0dmhBR2xnaGxKOW5KUTFMbEFDbGVlNlNGZmtjYUpR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jun 2024 07:00:00 GMT",
        "title": "Solana Up 700% Last Year, Beats Bitcoin and Ethereum Growth - Crypto Times",
        "content": "Solana (SOL) has risen by an amazing 700% in the last year, outperforming other cryptocurrencies like as Bitcoin (BTC) and Ethereum (ETH).\n\nAs per the data from CoinMarketCap, Solana is currently up 702% from the previous year. During the same time, Ethereum eclipsed Bitcoin, thanks to final approvals for token-focused funds. Ethereum has grown by 51% since the beginning of the year, outpacing Bitcoin’s 45% increase.\n\nAt the time of this writing, SOL is currently the fifth-largest cryptocurrency by market capitalization, having a bullish year till now. Currently, SOL is trading at $145.6, and a year ago it was trading at $20, and at its peak in 2024, it was $200.\n\nSolana Chart\n\nBitcoin’s initial run this year, aided by the launch of the first U.S. spot ETFs in January, saw it hit a new high of $73,798 by March. However, demand and price have subsequently slowed, and Bitcoin’s performance is being overshadowed by increased interest in Ethereum and Solana.\n\nETF excitement is responsible for Solana’s recent rise, especially when exchange-traded fund company VanEck applied for a cryptocurrency-based product.\n\nThe SOL token experienced its largest spike since late May after VanEck filed the necessary paperwork with the Securities and Exchange Commission (SEC) for the new Solana ETF. The boost reached as high as 11%.\n\nThe VanEck Solana Trust is the company’s newest product and the first Solana ETF to be registered in the US. This submission comes after spot Ether (ETH) ETFs were approved by the SEC for the United States on May 23, 2024."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE1ROFRrdUFiYmZ1OTFZaHE2MWVVWFRlMWI4WUt5QVdKQl9aVkVNYklpTWp2TnRaMlJLcHA2bWpYd01tQzZGb0JBeXVSVktJT1ZvVXBMNjJQOVNLMzFrRDZISXRZWkY0b3FoNmIyb2Q2SnUyWmFaYkk0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jun 2024 07:00:00 GMT",
        "title": "Will Ethereum NFTs Make a Comeback? - CryptoSlate",
        "content": "Onchain Highlights\n\nDEFINITION: The relative amount (share) of gas consumed by the Ethereum network by transactions interacting with non-fungible tokens. This category includes token contract standards (ERC721, ERC1155) and NFT marketplaces (OpenSea, Blur, LooksRare, Rarible, SuperRare) for trading those.\n\nEthereum’s gas usage by NFTs has exhibited significant shifts over the past few years, mainly as different platforms have gained and lost prominence. Recent data indicates that Blur and OpenSea have consistently dominated gas consumption since early 2024.\n\nThis reflects the increasing activity on these platforms as traders and collectors continue to engage in the NFT market. In contrast, platforms like Rarible and SuperRare show relatively lower gas usage, highlighting their smaller user bases or less frequent transactions.\n\nHistorically, significant spikes in gas usage by NFT transactions correlate with broader trends in Ethereum’s price movements. For instance, the surge in early 2021 coincided with a considerable bull run in the crypto market, driving more transactions and higher gas fees. As Ethereum’s price stabilized in mid-2023, NFT-related gas usage also normalized, illustrating the interconnectedness of these metrics.\n\nThe current landscape suggests that while new NFT marketplaces emerge, established platforms like Blur and OpenSea maintain relative dominance, continually influencing Ethereum’s overall gas consumption patterns. This dynamic plays a crucial role in understanding the operational costs and transaction efficiency of the Ethereum network.\n\nWhile relative usage may be compatible with past cycles, overall NFT gas usage has plummeted since January 2023 as a percentage of overall network activity. At its peak, gas usage broke 40%, with a consistent level above 30%. Current levels are below 4%, partly due to the increasing popularity of layer-2s like Base and side chains like Polygon and an overall downtrend in the NFT market."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxPN3JxZlA0RGh0enZWd2pKeExGc3NsOHNrWmh5S0hlUGZpbGQzRzFzRjc0Vm1PYkhQV2dibTA5ZHh4eTBnR1pEUXpJSUVjZHlYWXZva04zSGU0ZmVaNnA5MHVsMGp3RG1hSldUMmJPVnI0U1c0UGdXVmJwNGllYXNVT2NTbkJhT2dsc1NVOVNIMThmNUo1alRuY25DbmVFTXNlS2FGQndxOTdDaUlYZXdUSkNvLUNLTkhYRVAzY1ZFMjg1anBlSWFfNWhTMlhoTDkwX21ncGFWblTSAd4BQVVfeXFMTkJNSUhWUWpVak9ZbHlYVXVWX2NEcmpWbmFobmlSZWhMQU1ZLThtb1ZOMjFpZUpCLU5iZnZEeDJVTU5DeVdTTWRmZjF3UnBYTmZYcnBoc2ZkazNJTGFGVjB2VkNFbkx0THNLZElNNmplZnFYV0g5anFCSUF5S0hyMEJnRVF1WGRFT3k4Yi0xUlRDOG0zTWRkLXRrcFBiLWtvcU42cVFVdVlINFFFNUFmVS1KVWVpTWl2MEM5ZE9xaTNIZnNBRWIzS2VCWjRTQ3RxYnlqLS03QW5SZHU3TmVn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jun 2024 07:00:00 GMT",
        "title": "Crypto Analyst Says One Ethereum Rival Is Extremely Undervalued, Maps Path Forward for Bitcoin and Chainlink - The Daily Hodl",
        "content": "A widely followed crypto analyst and trader believes that one Ethereum (ETH) rival is well below fair market value.\n\nCrypto trader Michaël van de Poppe tells his 722,500 followers on the social media platform X that layer-2 scaling solution Polkadot (DOT) could follow ETH’s upward trend.\n\n“DOT is likely going to follow Ethereum in its expansion upwards. This means that the current valuations of Polkadot are extremely low. I expect a lot from the Polkadot ecosystem with all the new segments.”\n\nLooking at his chart, he suggests the possibility of a bullish divergence for DOT on the three-day chart, a metric where a lower low appears on the price chart but then a corresponding indicator shows a higher low.\n\nDOT is trading for $6.20 at time of writing, down nearly 2% in the last 24 hours.\n\nNext up, the analyst predicts that Bitcoin (BTC) will consolidate in the near term around the lower $60,000 range.\n\n“Bitcoin did make a retest at $61,000. I expect this to continue consolidating, where I’m assuming that altcoins will have a higher return than Bitcoin.”\n\nLooking at his chart, the trader suggests that Bitcoin will bounce around $60,000 and soon return to around $64,000.\n\nBitcoin is trading for $60,757 at time of writing, down 1.47% in the last 24 hours.\n\nLastly, the analyst says that leading blockchain oracle service Chainlink (LINK) will likely rally against Bitcoin (LINK/BTC) in the near term as it bounces off a trading range low on the weekly chart.\n\n“Pretty significant start for LINK with this weekly candle of +11% on the Bitcoin pair. It’s still the cycle low and likely the bottom during this period of consolidation.”\n\nLINK/BTC is trading for 0.0002308 BTC ($13.92) at time of writing.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxQU3RYeUR3cWVxRjUwOUljZGJiTXBRbG82R3I4TUFZYUJRV3NWQTBZVXBmVkIzdVc4R0xHSWVFYi13UGNvR3pkTi1ITll1SkFDbzNiN1lTSGNVZ01jYVQzLUw5SUJvRXoxc1FuN0Q5LXNzTGhrOEZhODQ4M0RQeTdJS2VTelJyNnBSUE9JV2xDRHc5cGg2OEVycmxmZkstd00yTENfNXpGOA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jun 2024 07:00:00 GMT",
        "title": "Ethereum ETFs Set to Launch on July 2nd – Bloomberg Analysts - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxNQURrakpnbk5QWGluMUZQRFJ5cTlKODhEUk1EMHVzLXFILTdjY1RUenVhSUlVWkZob2lNdnJ0WnFoSkExN2xKNkRSMnRPeGFQODgtQVZxMmwyTENmeVdRSDhTLW5NNGpIT1IxbUQ4UC1TeFdOUkZ3Qk5PR0lZcXpqb9IBiAFBVV95cUxNWXNoVEZjQ1Fja092NnNGR3RnVG9pZEhESDNaWDJ2ckYtNUpPT1NpcnZUNk9idUczYjZxVVRCVmVSLTlwYV9fNm9ZRnM2VVVvQkFMd2ZvN0d2c09CYkNSRnEwRENvQlpHWlJod3lpQ1c0LVVVMzhHSWpBc2draUNlOGUzQjVpRW9U?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Jun 2024 07:00:00 GMT",
        "title": "What Are Blobs? Improving Ethereum’s Scalability - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nOfficially introduced to the Ethereum network on March 13, 2024 in the Dencun upgrade, blobs are a new type of data storage space designed to make rollups cheaper and more efficient.\n\nThe consensus within the Ethereum community is that the best way to scale Ethereum is through rollups, also known as Layer 2s or L2’s, and that the best way to scale rollups is via the introduction of blobs.\n\nBefore blobs, if Ethereum went through a period of congestion, that would also affect the price of transactions on all of its Layer 2s. The introduction of blobs removes the correlation between Ethereum congestion and the cost of transactions on Layer 2s.\n\nWhat are blobs?\n\nBlobs are a new data structure introduced to Ethereum in EIP-4844, more colloquially referred to as “Proto-danksharding”. EIP stands for Ethereum Improvement Proposal—the process by which Ethereum core developers suggest improvements to Ethereum.\n\nProto-danksharding is the precursor to full-danksharding, and sets the foundation for it by introducing blobs. It does so in the same format in which they’ll be used when full-danksharding is implemented, in order to simplify the transition to full-danksharding.\n\nFull-danksharding, or just Danksharding, is an upcoming Ethereum protocol update. It represents what Ethereum core devs believe will be the last step (for now) in making Ethereum a truly scalable blockchain, by making transactions faster and cheaper.\n\nProto-danksharding is a step towards implementing Danksharding—it introduces concepts from Danksharding, such as blobs, to Ethereum. Starting with proto-danksharding and the introduction of blobs, instead of diving straight into full-danksharding, reduces the risk created by introducing drastic changes to a network too quickly.\n\nHow do blobs work?\n\nBefore blobs, when a Layer 2 needed to verify its transactions, it would batch up transactions, and send them to Layer 1 (Ethereum) to verify. The problem was, after the data was verified, it was still stuck on the Ethereum blockchain, taking up blockspace, forever.\n\nAD\n\nAD\n\nThis contributes to state bloat, and makes Ethereum more congested—which, in turn, also made Layer 2s more congested.\n\nWith blobs, when the data is sent to the Layer 1 for verification, it’s sent in a blob, short for “Binary Large Object.” Each blob has 4096 field elements and can hold up to 32 bytes of data per field element, which equates to around 75 MB per blob. You can think of it as a giant table of data, or… a big blob of data.\n\nBlobs improve on the previous method of verifying data in that once data has been verified from a blob, it can be deleted. This way, all the transaction data from every rollup built on top of Ethereum doesn’t have to live permanently on the Ethereum blockchain, taking up valuable space.\n\nBlobs also operate using a separate blob fee market—introducing “blob gas”. Blob gas is independent of gas on Ethereum mainnet, meaning the only things that use blob gas are blobs themselves.\n\nWhat’s so special about blobs?\n\nDespite the funny names involved in Ethereum’s Dencun upgrade, it’s a serious improvement. Blobs help to make Ethereum less congested, and they make rollups cheaper and faster to use.\n\nThis is because the data that’s verified in blobs can be deleted after use. As such, it doesn’t cause state bloat on Ethereum mainnet. “State bloat” refers to the fact that the more data that is processed by Ethereum, the more data lives permanently on its blockchain—and the more intensive maintaining that network’s “state” becomes.\n\nSeparating the blob gas market from the existing gas market is also a marked improvement. Because blobs have a separate gas market, congestion on Ethereum doesn’t affect them. In the past, if there was a large event on Ethereum such as a highly anticipated NFT mint, the congestion caused by this event would leak onto Layer 2s and make transactions there more expensive as well. Separating blob gas markets from traditional ethereum gas markets removes the correlation between Ethereum network congestion and Layer 2 transaction costs and speed.\n\nBlobs also make Layer 2s much more profitable. Before blobs, when gas fees on them correlated with Ethereum network congestion, the cost of operation for Layer 2s, and the Dapps built on top of them, were much higher. Lowering transaction fees make it so that builders and operators are able to run complex smart contracts or products at a fraction of the cost.\n\nAD\n\nAD\n\nBlobs at work\n\nLooking at onchain data from rollup.wtf, we can see that the majority of Layer 2s with the highest transactions per second are already using blobs.\n\nIn a tweet, Jesse Pollak, founder of Layer 2 network Base, revealed that after Dencun, the cost of a simple swap transaction on Base dropped from $0.31 to $0.0005.\n\nafter 2 years of hard work, blobs are now live on @base before: $0.31\n\nafter: $0.00 (but actually $0.0005) wallets need to update to handle these cost reductions! pic.twitter.com/solIX9D4HM — Jesse Pollak (jesse.xyz) 🛡️ (@jessepollak) March 14, 2024\n\nHowever, it hasn't been all sunshine and rainblobs. Blobs have been slower than anticipated when it comes to actually posting transactions to Layer 1. Creating a new gas market for blobs succeeded in decoupling Ethereum congestion from rollup transaction costs, but the gas market itself needs some fine-tuning before it’s everything it’s been hyped up to be.\n\nIn one example in June 2024, blob transactions became more expensive than their predecessor– but that can be seen as a sign that blob adoption is still in progress, and hopefully, as L2’s become more efficient at using blobs, more block builders start accepting blocks that include blobs, and blob capacity increases— the costs will go down.\n\nVitalik Buterin addressed both of these issues in a March 2023 blog post published shortly after Dencun’s release. In it, Buterin cites two core areas of focus that are needed to continue scaling blobs: “Progressively increasing blob capacity, eventually bringing to life the full vision of data availability sample with 16MB per slot of data space,” and “Improving L2s to make better use of the data space that we have.”\n\nSo while blobs have seen some growing pains, they were for the most part anticipated, and solutions are underway."
    }
]