[
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiYEFVX3lxTFBwaUtuZkpGX21qWGd6WXdkV0o0Z3RBaHRMTGNMTGdNbnBBMVl6Zm9EcVJpTHJiSnpFenZoZ1ZIeE9yQjRYNmhuRXotSl9nZTNzMlduVnZ0elZicUxEN1pvdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jun 2024 07:00:00 GMT",
        "title": "Ethereum resurgence and layer-2 boom define crypto Q2: IntoTheBlock - Crypto Briefing",
        "content": "Spot ETH ETFs boost Ethereum as Bitcoin miners increase sell-off.\n\nKey Takeaways Bitcoin's price declined following its fourth halving, despite reduced issuance.\n\nEthereum's price rose following SEC's approval of spot ETH ETFs.\n\nShare this article\n\nThe second quarter in crypto was marked by Bitcoin (BTC) and Ethereum (ETH) trending down, BTC miners selling their reserves at a rapid pace, and layer-2 blockchains activity leaping four times, according to IntoTheBlock’s “On-chain Insights” newsletter.\n\nBitcoin’s price fell by 12.8% following its fourth halving on April 20, and an anticipated price surge caused by a supply shock did not materialize. IntoTheBlock analysts shared that this is likely due to long-term holders taking profits in 2024.\n\nImage: IntoTheBlock\n\nMoreover, miners have offloaded over 30,000 BTC in June alone, which amounts to near $2 billion. Again, the halving could be tied to this movement, as profit margins for miners decreased since then.\n\nIn contrast, Ethereum saw a modest decline of 3.1%, a feat made possible by the approval of spot ETH exchange-traded funds in the US, the analysts highlighted. This event boosted Ethereum’s price by over 10%, as those investment products are expected to attract substantial investment, mirroring the inflows seen with Bitcoin’s ETFs.\n\nAdditionally, Ethereum’s landscape was notably different, with an increase in transactions on layer-2 blockchains like Arbitrum, Base, and Optimism, following the integration of EIP-4844.\n\nCaption\n\nThis development introduced the “blobs”, which significantly reduced transaction fees for layer-2 blockchains and encouraged greater on-chain activity. Therefore, this potentially prepared the stage for long-term network benefits despite a short-term decrease in fee revenue."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxPU25WZUVyVXE0YVNSdUFSaHhXR01QRUhENnI3VU02Ykk3aF9VRk9ocWF0Rk95R3hveEYzMVZ6MmlhSXBSX0pfYjFzV0tpNWY5U3hxMlplNE5JdjMyM0t3Y25QMGM3WGhQS3o1Mjg0amNfWHQzQUZLT29NZnJWUGdtRzJOdkhNQ3F1cVpUZWVjSVVrcFU4WEN1eVBYVzcyUnRSNFotYjJXdk3SAa4BQVVfeXFMUENpTmp3VzVCN1YyTDM2SlI3OWExTG5BdEl0ODVkd3NaVmlucnlyM2JoS0p3b3NBeXNYSk5fVjZNa2NISk1JMjhrSjlCdXFVSjZMbzhGbFhyQkZoa1ZicWhkUkpjOTR3TzF5VndkWS1FZy0tUnpZS2pET05YTUZ4Zmd4bWZTS3doZEZrY2dLelNSemthZ3FJYjBwOGk3ZU00WTlhanJ1bEdEZ3MxdUV3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jun 2024 07:00:00 GMT",
        "title": "Crypto company Consensys sued by SEC as regulator continues industrywide crackdown - CNBC",
        "content": "Crypto firm Consensys has been added to the SEC's list of targets, as the regulator continues its industrywide crackdown.\n\nThe Securities and Exchange Commission on Friday sued Consensys in federal court in Brooklyn, New York, over allegations that the company \"engaged in the offer and sale of securities\" and \"acted as an unregistered broker\" through its digital asset wallet called MetaMask.\n\n\"Consensys violated the federal securities laws by failing to register as a broker and failing to register the offer and sale of certain securities,\" the court filing alleges.\n\nIn April, Consensys, which provides blockchain software, tried to preempt the SEC's action with its own lawsuit in Texas, alleging overreach on the part of the regulator. The 10-year-old company said its suit followed three subpoenas issued last year, plus a Wells notice from the SEC that claimed Consensys was violating federal securities laws.\n\nSo far this year, the SEC has sent Wells notices, filed lawsuits, or reached settlements with a host of crypto firms focused on ethereum and decentralized finance, including ShapeShift, TradeStation and Uniswap. The agency is also reportedly investigating the Ethereum Foundation.\n\nLess than two weeks ago, Consensys declared victory in its fight with the SEC.\n\n\"The Enforcement Division of the SEC responded by notifying us that it is closing its investigation into Ethereum 2.0 and will not pursue an enforcement action against Consensys,\" the company wrote in a statement June 18.\n\nA Consensys spokesperson said in an emailed statement Friday that the action is part of an \"anti-crypto agenda\" at the SEC.\n\n\"This is just the latest example of its regulatory overreach — a transparent attempt to redefine well-established legal standards and expand the SEC's jurisdiction via lawsuit,\" the company said. \"We are confident in our position that the SEC has not been granted authority to regulate software interfaces like MetaMask.\"\n\nThe spokesperson added, \"We will continue to press our case in Texas as well as defend this new case in New York.\""
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxPU25WZUVyVXE0YVNSdUFSaHhXR01QRUhENnI3VU02Ykk3aF9VRk9ocWF0Rk95R3hveEYzMVZ6MmlhSXBSX0pfYjFzV0tpNWY5U3hxMlplNE5JdjMyM0t3Y25QMGM3WGhQS3o1Mjg0amNfWHQzQUZLT29NZnJWUGdtRzJOdkhNQ3F1cVpUZWVjSVVrcFU4WEN1eVBYVzcyUnRSNFotYjJXdk3SAa4BQVVfeXFMUENpTmp3VzVCN1YyTDM2SlI3OWExTG5BdEl0ODVkd3NaVmlucnlyM2JoS0p3b3NBeXNYSk5fVjZNa2NISk1JMjhrSjlCdXFVSjZMbzhGbFhyQkZoa1ZicWhkUkpjOTR3TzF5VndkWS1FZy0tUnpZS2pET05YTUZ4Zmd4bWZTS3doZEZrY2dLelNSemthZ3FJYjBwOGk3ZU00WTlhanJ1bEdEZ3MxdUV3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jun 2024 07:00:00 GMT",
        "title": "Crypto company Consensys sued by SEC as regulator continues industrywide crackdown - CNBC",
        "content": "Crypto firm Consensys has been added to the SEC's list of targets, as the regulator continues its industrywide crackdown.\n\nThe Securities and Exchange Commission on Friday sued Consensys in federal court in Brooklyn, New York, over allegations that the company \"engaged in the offer and sale of securities\" and \"acted as an unregistered broker\" through its digital asset wallet called MetaMask.\n\n\"Consensys violated the federal securities laws by failing to register as a broker and failing to register the offer and sale of certain securities,\" the court filing alleges.\n\nIn April, Consensys, which provides blockchain software, tried to preempt the SEC's action with its own lawsuit in Texas, alleging overreach on the part of the regulator. The 10-year-old company said its suit followed three subpoenas issued last year, plus a Wells notice from the SEC that claimed Consensys was violating federal securities laws.\n\nSo far this year, the SEC has sent Wells notices, filed lawsuits, or reached settlements with a host of crypto firms focused on ethereum and decentralized finance, including ShapeShift, TradeStation and Uniswap. The agency is also reportedly investigating the Ethereum Foundation.\n\nLess than two weeks ago, Consensys declared victory in its fight with the SEC.\n\n\"The Enforcement Division of the SEC responded by notifying us that it is closing its investigation into Ethereum 2.0 and will not pursue an enforcement action against Consensys,\" the company wrote in a statement June 18.\n\nA Consensys spokesperson said in an emailed statement Friday that the action is part of an \"anti-crypto agenda\" at the SEC.\n\n\"This is just the latest example of its regulatory overreach — a transparent attempt to redefine well-established legal standards and expand the SEC's jurisdiction via lawsuit,\" the company said. \"We are confident in our position that the SEC has not been granted authority to regulate software interfaces like MetaMask.\"\n\nThe spokesperson added, \"We will continue to press our case in Texas as well as defend this new case in New York.\""
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTE82bzlPb3REbzhWQWhPUkU2ak1vN0UtaC01NjBTUkpYU2dQenczMVViOEVXLVZzRUdqNERueU9RaXY5YTkxNTRzamdkTXQ5eUF0a3c1QTRzYk85aDVBdjVaM1F5ZEdfcVFFOVlQVGlvbUlrWGE40gF6QVVfeXFMT1U3RTVrb3VVbUlzS3d6bGgtQjdPTlpqS2c5YUZpNlVQWHo2WVV4a2hYeUhJb0h5Q1JXSGFRdDk5elFmcXlSZkExcXJsQ2ItV3hlNGtTYjh0QmhNdC1HQ2ZJOTg1MFFyWmFtbUE2SVpIbk9GaHRtWUlRZXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jun 2024 07:00:00 GMT",
        "title": "Solana to $1,000? Ethereum's History Makes It Possible - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nZhu Su , a founder of the infamous Three Arrows Capital hedge fund, recently highlighted the performance of the Grayscale Solana Trust, suggesting it could imply the future value of Solana to $1,000 per SOL.\n\nAdvertisement\n\nThis projection is based on a comparison with the historical performance of Ethereum and the Grayscale Ethereum Trust (ETHE), used as a benchmark.\n\nWhy is no one talking about how Grayscale Solana trust is implying $1k per sol already\n\n\n\nThe numbers are very similar to when eth was $200 but ethe implied $1k, in 2020 Advertisement June 28, 2024\n\nGrayscale's trusts work by allowing investors to gain exposure to digital currencies through a traditional investment vehicle without the challenges of buying, storing and safekeeping digital assets directly.\n\nEach share of the trust represents a fraction of the cryptocurrency held by the trust, and the value of the shares can trade at a premium or discount to the underlying asset's market value.\n\n\"Every four years...\"\n\nThus, four years ago, when Ethereum was trading at around $200, the Grayscale Ethereum Trust implied a value of $1,000 per ETH. This significant premium indicated strong investor confidence and future price expectations.\n\nEthereum's price eventually caught up with these projections, experiencing substantial growth in subsequent years. This pattern suggests a potential roadmap for Solana.\n\nThe comparison of Solana to Ethereum's early days, when it was also emerging as a significant platform, is noteworthy. If SOL follows a similar trajectory, the implied value suggested by the Grayscale Solana Trust could be realized.\n\nWhile past performance is not a guarantee of future results, the historical context offers a compelling narrative of Solana's growth prospects, making the $1,000 target a topic of interest in the community."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxNbFJmWkV2T0hFNG92cFR5Z0tiQ0Nxd1VMNjJBM3pnMV9oX2FDUXBYOHZjWG8tTC1jaTVEMHp5NWFGMjNLYnczXy1rYWZ4UElFWjZlVmlYMmZhTmxrek53V3ZrRkdjNjJOMmotYmJEc1R6NjFuaHZaNGlDeV9sNWZ4VG9KQ0JMM1N5dW9iWjh6Y0VidE0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 28 Jun 2024 07:00:00 GMT",
        "title": "4 Reasons to Buy Ethereum While It's Under $4,000 - The Motley Fool",
        "content": "Ethereum could outperform Bitcoin in the second half of 2024. Here's why.\n\nThrough the first six months of the year, Ethereum (ETH -5.70%) has largely kept pace with Bitcoin (BTC -3.10%). Both are now up about 45% year to date, and the big question on the minds of many investors is which is going to outperform during the rest of 2024.\n\nIn early May, the easy no-brainer answer would have been Bitcoin. But Bitcoin has stumbled of late, and that has opened the door for Ethereum. There are now four compelling reasons Ethereum could soar higher, even if Bitcoin continues to trade sideways.\n\nThe new ETFs\n\nBitcoin, of course, has had spot exchange-traded funds (ETFs) since January. And the introduction of this new investment product has arguably been one of the most important crypto narratives of 2024. But there's a new twist to that narrative. At the end of May, the Securities and Exchange Commission (SEC) finally approved new spot ETFs for Ethereum.\n\nIt is still uncertain how much of a boost these new ETFs are going to provide. The current thinking is that they will start trading sometime this summer and that they could lead to $3 billion flooding into the new ETFs. That's a bull case scenario, though. According to JPMorgan Chase (JPM -1.81%), the bear case scenario is closer to $1 billion. That's barely a blip on the radar compared to the $30 billion that has flowed into the new Bitcoin ETFs. Nevertheless, they are still likely to move the needle for Ethereum.\n\nEthereum as the market leader\n\nEthereum continues to be the clear market leader in every important blockchain sector. Take decentralized finance (DeFi), for example, where Ethereum still accounts for more than 60% of all total value locked (TVL) in the blockchain world. No other blockchain even comes close. So we can start to downplay any notion that a challenger such as Solana (SOL -5.36%), Cardano (ADA -6.00%), or Avalanche (AVAX -7.38%) has any clear-cut path to toppling Ethereum anytime soon.\n\nThe market seems to agree. Ethereum is significantly outperforming all of its peers. For example, Solana is up 35%, and Sui (SUI -2.02%) is up 9%. Other top competitors are reeling. Aptos (APT -2.47%) is down 28%, Cardano is down 32%, and Avalanche is down 33%.\n\nRegulatory clarity\n\nThere's another big reason to cheer on Ethereum, and that is regulatory clarity. Just about anyone who has ever heard of Ethereum considers it to be a cryptocurrency. However, through the first six months of the year, there were rumbles and murmurs about a pending SEC investigation into Ethereum, due to uncertainty over whether it might actually be a security.\n\nBut those rumors now appear to be quashed, with the SEC saying that it is closing down any investigation into Ethereum. That's important because it could turn on the money spigots for risk-averse institutional investors. Crypto is risky enough without the added risk of an SEC probe.\n\nLong-term disruptive potential\n\nAnd, finally, there's the long-term disruptive potential of Ethereum. For the past decade, Ethereum has been a true innovator, pioneering niches of the blockchain world that had never existed before. And, judging by all the tech upgrades that have been made to the Ethereum blockchain over the past two years, this trajectory should continue.\n\nIn fact, investment firm VanEck expects Ethereum to grow dramatically in several key areas, led by DeFi. It's here that the Ethereum blockchain can offer the greatest disruptive potential. It's simply faster, cheaper, and more transparent to manage financial assets on a blockchain. And that could lead to Ethereum gaining market share at the expense of traditional financial rivals.\n\nIn fact, VanEck has run the numbers and determined that Ethereum could soar to a value of $22,000 per token by 2030. That would give Ethereum an implied market cap north of $2 trillion. Given that the top companies in Silicon Valley are now worth anywhere from $1 trillion to $3 trillion, a market cap of $2 trillion for Ethereum is not as unreasonable as it might sound at first.\n\nWhat to look for over the next six months\n\nFrom my perspective, the biggest threat to Ethereum remains the rise of blockchain challengers such as Solana. The economic moat that once surrounded Ethereum seems to be getting smaller and smaller with each passing year.\n\nThat said, Ethereum is shaping up to be one of the best crypto investments you can make in the second half of 2024. If the new ETFs perform as expected, then it could be off to the races for the world's second-most-valuable cryptocurrency."
    }
]