[
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxNanBTc3kyNUNUT0wwRnhWY3ZxQUxHUEJRckpyV3dnSlhsNExrS3ViSUNfc3JFYllBSUlKU3k1Rl9TZUJHQnNzYzFBeXRTMkRjdDlNdWxLNDhneWpCeGQ0TEMxWmsxUTlVVVBMd3ZOX1c3X1RIRUNwRXNxc1QybUg1TVdYMEJpZFdiX0JLR1dn0gGTAUFVX3lxTFB2bHZ5ck1zNG9pZWNHWjZIdEZHbUdGYUZSci1mWnBJRWpLbG9Gd1RncHVjT0N0NXA0ZEU1QjRwUHVTNE91TWVXSzk2cWYwQTFDS0tqbEVLQm5XdVJILTBLaW1TY3VqT2h3X3RDR3hxb0FNSFZ4clZXRGNiVE1BekVpOFBPY2p5NDFBQ09UVEZndGtvTQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 May 2024 07:00:00 GMT",
        "title": "Ethereum network dips to 6-month low – Here’s how it affected ETH - AMBCrypto News",
        "content": "Ethereum’s fees hit a six-month low in the past seven days.\n\nETH was down by 6%, and metrics looked bearish.\n\nAs L2s gain popularity, Ethereum’s [ETH] network usage plummets, reaching a six-month low.\n\nThis aligned with Vitalik Butarin’s 2020 roadmap, which aimed to enhance scalability by offloading transactions from the mainnet.\n\nIn the meantime, ETH bears entered the market and pushed the token’s price down.\n\nEthereum’s network activity dwindles\n\nIntoTheBlock recently posted a tweet highlighting the fact that ETH’s fees plummeted to a 6-month low this week as it dropped by over 29%.\n\nThe drop in ETH’s fees reflected a shift in activity to over 50 live Layer 2 networks. To see what’s going on with Ethereum, AMBCrypto analyzed Artemis’ data.\n\nNotably, overall activity on the network had dropped, alongside the blockchain’s Daily Active Addresses declined last week.\n\nETH’s Daily Transactions also followed a similar trend. The decline in fees also caused the blockchain’s revenue to drop last week.\n\nNotably, it was surprising to see the blockchain’s usage drop when its gas price declined. As per Ycharts, ETH’s gas price dipped from 47.5 Gwei to 8.5 Gwei over the last month.\n\nEthereum turns bearish\n\nWhile the blockchain’s network activity dwindled, its price action also turned bearish. According to CoinMarketCap, ETH’s price has dropped by more than 6% in the last seven days.\n\nAt the time of writing, it was trading at $2,920.99 with a market capitalization of over $350 billion.\n\nAMBCrypto’s look at Glassnode’s data revealed a possible reason behind this price decline. We found that ETH’s number of addresses with balances greater than $100k sank over the last seven days.\n\nThis clearly indicated that whales were selling their holdings.\n\nNot only whales, but selling sentiment was overall dominant in the market. Our analysis of Sentiment’s data pointed out that ETH’s Exchange Inflow spiked twice last week.\n\nAdditionally, its Supply on Exchanges increased. This hinted at a sell-off, which might have triggered the price correction.\n\nThe negative price action also had a negative impact on market sentiment. Ethereum’s Weighted sentiment dropped in the last few days, suggesting that bearish sentiment around the token was dominant.\n\nAMBCrypto then analyzed ETH’s daily chart to see whether a further price drop is likely to happen.\n\nWe found that its Relative Strength Index (RSI) was resting under the neutral mark. Its Money Flow Index (MFI) also registered a downtick.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nThe king of altcoins was resting under its 20-day Simple Moving Average (SMA) at press time, indicating a further price decline.\n\nETH’s price had touched the lower limit of the Bollinger Bands, which can trigger a trend reversal."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE8xblpGdndDcGdPb1RDdzhDMVBQMk5vcXdFb0FwVE9vZ2J3WW5qRjhob3NhNHEtcWpYbnVsbVR0ZUVuUmRkeHZ1SmptcktLV21GOS1WRHBBZzhCbjlPYllzaFVTTndLTHZZcG1ZNEdxNi1hSmE1ZnQybV9n0gF_QVVfeXFMUGV2WDJNem9sRVAyQzBPd1ltZmlXaW53TUptYkRGUERIRnhrWmhGei1OczljWnI4UlVTODVIa0pBRjNyRTl0MTY0RDVBRVBudWttZXlYajd1SUMyNWgyb05NZHZ2QW8yVFVjY002Z21CeGxmc2ZPQ1VSTFpfa0JEMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 May 2024 07:00:00 GMT",
        "title": "Can Ethereum bulls take bears out of the market? - AMBCrypto News",
        "content": "The positive reading of the bulls and bears indicator suggests that the price might increase.\n\nEthereum’s network was overvalued and could hinder the potential upswing.\n\nThe price of Ethereum [ETH] might have decreased by 7.30% in the last 24 hours, but an assessment of a key indicator suggested that the decline might soon end.\n\nThe indicator talked about here is the Bulls And Bears metric provided by IntoTheBlock. This indicator can be measured in addresses or volume.\n\nHowever, the focus is usually on large buyers or sellers, as they have a big influence on price movements.\n\nThe 1% want to keep the faith\n\nA net negative of the Bulls and Bears indicator suggests more large sell orders than buys. In this instance, the price of the asset involved might decrease.\n\nBut for Ethereum, data showed that the reading was positive, indicating bullish confidence in the price trend. Should this metric maintain its position over the coming days, then ETH might be able to rise toward $3,100.\n\nHowever, failure to sustain the status quo or improve on it could send the price of the altcoin below $2,800. When AMBCrypto looked at Ethereum’s STH-NUPL, we observed that market participants were not exactly confident in the cryptocurrency.\n\nSTH-NUPL stands for Short Term Holder — Net Unrealized Profit/Loss. With this metric, one can have an idea of the behavior of short-term investors.\n\nInvestors panic, but ETH may come to their aid\n\nFrom our analysis, ETH’s underwhelming price action has changed the sentiment investors have toward the coin. In March, the metric was in the optimism (yellow) region.\n\nAt that point, holders were confident in ETH’s price action. But as of this writing, that reading has reached the capitulation (red) region, indicating that market participants are in fear.\n\nHowever, fear can act as fuel for a bounce. If the STH-NUPL continues to fall, ETH’s price might also decrease.\n\nMoving, on, a turnaround might occur as intense fear could trigger a harder upswing if buying pressure increases.\n\nIn this instance, Ethereum might target a rise toward $3,500. Besides this metric, AMBCrypto found another indicator suggesting that ETH might soon recover.\n\nThis time, we looked to the dormant circulation. According to on-chain data from Santiment, the 90-day dormant circulation had dropped to 9246.\n\nIf the metric increases, it means that coins that have not moved for a long while are starting to change wallets. Sometimes, this means old hands are selling.\n\nThus, the recent decline implied that long-term Ethereum investors were not selling as much as they did around the 7th and 8th of May.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nHowever, the Network Value to Transaction (NVT) ratio suggested that ETH might still be overvalued. Low values of the NVT suggest undervalued.\n\nBut for Ethereum, the metric spiked, indicating that the network is overvalued relative to transactions."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMizgFBVV95cUxNUlIyRTlQNHJ2NlNJeDNHQW5JSmZRdDk4R0VPc0NfQS1mZlBQMjdkSkF4bEx0OXdYNl9FUTVXUHZDWVdDOHNPUlJLelNpRUxzNlF5M2ZPc0ZoeEplS2Rjd244cUdPaXdiNDU3d3YydXAtZllESzFRVkp3X1FZY1RzeGFvc1lhV3F3RjdOMmlkVTBrc050TDlxWFBOQWRiSHBvZVpJTlczVUhCYVg1dlpzeEhPcXVseVBMTS0zTlBUUlo5OUVTakhGeFRhT0J1UdIB0wFBVV95cUxNUV9oQmJscVE1SURfME1rWVpxOVFBTUx1b1p0SmFZdHBidnVLUmZaakVlYW9oc01jcE9sM01aS1VqbXdnakVORi02bE5KekVKUFZRcGFOV2hleGZUSWNGVUo2a3lqMTNDNDFqNlRLWWxRVU5rWHR0QWNSVl9fZFN0RGM4dnVrRERHU0tJc3pVMjlLcUdZUm53QW95R1p1WFVYSGoydHliVzJwdDJnRk1lZHlJXzBscmYzTW1URmVHS2t4ZUN0ZnVlY0lleHBENTVwdzVz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 May 2024 07:00:00 GMT",
        "title": "Analyst Michaël van de Poppe Says Big Moment Coming for Ethereum, Predicts Rally for Layer-1 Altcoin - The Daily Hodl",
        "content": "Crypto strategist Michaël van de Poppe believes that Ethereum (ETH) is close to witnessing a big trend shift.\n\nVan de Poppe tells his 717,600 followers on the social media platform X that he doesn’t expect the U.S. Securities and Exchange Commission (SEC) to approve pending applications for spot Ethereum exchange-traded funds (ETFs) in the coming weeks.\n\nThe SEC is slated to approve, delay or deny the ETH ETF applications by financial giants Hashdex and Ark 21Shares on May 30th after postponing it in March.\n\nVan de Poppe predicts that the SEC’s decision will end up being a pivotal point for the top altcoin by market cap.\n\n“This is a very likely scenario with Ethereum, through which the delay/denial in two weeks is the big moment of reversal for ETH and the markets.”\n\nLooking at the trader’s chart, he seems to predict that ETH will plunge below $2,700 before reversing and rallying to $3,800.\n\nAt time of writing, ETH is worth $2,920.\n\nNext up is the layer-1 crypto project AIOZ (AIOZ). According to the analyst, he expects AIOZ to sustain its bullish momentum as long as it continues to trade above $0.65.\n\n“This one looks very promising and is one of the strongest trending assets.\n\nIn-trend level to hold: $0.65-0.68.\n\nIf that’s lost, then the long-term investment region comes into play.\n\nIf we hold, I expect $1.35-1.45 might seem next.\n\nVery strong one.”\n\nAt time of writing, AIOZ is trading for $0.795.\n\nAnother altcoin on the trader’s list is the Ethereum scaling solution Arbitrum (ARB). Van de Poppe thinks that ARB is very close to carving a bottom.\n\n“This one has a full correction and is at the end stage of the correction. Massive cascade in the past weeks, through which the markets often fill that wick in the weeks after. In that regard, markets are close to the end of the correction.”\n\nBased on the trader’s chart, he seems to predict that ARB will bottom out at around $0.90.\n\nThe last altcoin on Van de Poppe’s radar is the native asset of the video-sharing blockchain Verasity (VRA). According to the analyst, VRA is in a full-blown downtrend and may find support at $0.004\n\n“A full retracement is happening, which is relatively common for altcoins in this stage of the cycle.\n\nAn important area of support, and I think most of the pain is already in.\n\nThis support has held in the past, and I expect to do the same here.”\n\nAt time of writing, VRA is worth $0.0051.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxPUUdTTHNXRHFkNnhhcllkUjRTNWtrejJkbW1ZampzZVM2U0JkT3VjVERxMDIwZ0FOSm0tV2J4Tkk1bTQ1VVR2UE5hWTRHU29SV1piNjNCN3RwUGYwTHV4NVdDLURhUVZVQnl6Uk5ILVVYemlackNOQ25ZQW45TUlKOVNwN01GWnJveVlpZ0pLNEFXU0ZxdHFHNTBR0gGfAUFVX3lxTE5CaFFTdnNYdmE4LVFra0V6LVVzS291V28tY2tOcVNQNjdVTkU3SWhHZ1hBLUtORTdWZzcwRXNNT3o5Ym5lYnJtOHQxVFQxSFpxVFRVVXkyeFV3YmxWdUI5VnhtZjZHaVlRWDNhUThDRU1uSWt6dUhQdGh0Vk9DWm5IME1jNFJmY185UHFpZHR3MXZFMEVmcmN1U3pzazZ2TQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 May 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis: Will ETF Uncertainty Push $ETH Below $2700? - CoinGape",
        "content": "Ethereum Price Analysis: Ethereum, the second-largest cryptocurrency by market cap is up $0.82 to trade at $2935 currently. This uptick signals another reversal from the support region around $2875-$2850, projecting a fourth reversal within a month. This active demand zone has prevented a prolonged correction in Ethereum and shifted the price trend sideways. How far will this consolidation continue?\n\nAlso Read: Ethereum Whale Liquidates ETH Portfolio At $6.5M Loss, Price Dip Ahead?\n\nadvertisement\n\nEthereum Price Analysis: Is ETH Price Ready to Hit $4100?\n\nThe Ethereum price has traded sideways for nearly a month, resonating within two horizontal levels of $3300 and $2850. The coin price rebounded several times from both these levels indicating indecision among market participants.\n\nHowever, if the consolidation continues, the ETH price hits the downsloping trendline of a falling wedge pattern which has carried the current correction trend for over two months.\n\nIf the overhead supply at this resistance is intact, the potential retest will accelerate supply liquidity in the market, bolstering Ether for prolonged downfall. The bearish thesis will get better traction if sellers break $2850 support.\n\nThe potential breakdown will plunge the Ethereum price to $2700, followed by $2600.\n\nFurthermore, in a recent Twitter conversation, Eric Balchunas, a senior ETF analyst for Bloomberg, responded to developments regarding the ARK Invest/21Shares application to remove staking from its Ethereum (ETH) spot ETF. Balchunas noted that while this adjustment might appear to be aligning the ETF proposal more closely with SEC guidelines—a potentially positive sign—there has not been any specific feedback from the SEC yet.\n\nHmmmm. Interesting. While it may seem like this is them getting their docs in shape based on SEC comments (which would be good news) there hasn’t been any comments. So its prob either a Hail Mary or maybe trying to give SEC one less thing to use in their rejection. Not sure (yet) https://t.co/CeQwj5ktPn — Eric Balchunas (@EricBalchunas) May 10, 2024\n\nHe expressed uncertainty about whether this change was a strategic move to avoid potential grounds for rejection by the SEC or simply a last-ditch effort to gain approval, describing the situation as either “a Hail Mary or maybe trying to give SEC one less thing to use in their rejection.”\n\nAs the market is uncertain about the approval of U.S Sec for ETH ETFs, the technical analysis hints a breakout above the wedge pattern could spark recovery sentiment.\n\nA potential breakout from the overhead trendline will accelerate the bullish momentum and lead a recovery rally to $4100.\n\nTechnical Indicator\n\nBB Indicator: The ETH price pressuring the lower boundary of Bollinger Band on the downside indicates the selling pressure is active.\n\nMoving Average Convergence Divergence: Multiple crossovers between the MACD (blue) and signal (orange) lines accentuate the uncertain market sentiment.\n\nRelated Articles\n\nSahil Mahadik Sahil is a dedicated full-time trader with over three years of experience in the financial markets. Armed with a strong grasp of technical analysis, he keeps a vigilant eye on the daily price movements of top assets and indices. Drawn by his fascination with financial instruments, Sahil enthusiastically embraced the emerging realm of cryptocurrency, where he continues to explore opportunities driven by his passion for trading\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxOVDU2dWozeEFCcjR3bGV4cjh1NnFFVy1IaXlKNnQ3UUFQOU1oVVQybGx0SURxVFhuck5yam5yUmtSako3SlZZTl90R3hFWGJ0aTdBbHhsTkEyS3MwOE5BU2pRMTQ0WE53cTVIWUkxN2M3SzI5MXphTjhya2FCVU9lSmJ1TmcxelFUN3o0NkhfcTJfLUJ5OXBF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 May 2024 07:00:00 GMT",
        "title": "4 Reasons to Buy Ethereum Like There's No Tomorrow - The Motley Fool",
        "content": "The world's second-largest cryptocurrency still has a lot of upside potential.\n\nEther (ETH 0.02%), the largest cryptocurrency of the open-source Ethereum network, has rallied nearly 70% over the past 12 months. However, it's still trading about 35% below its all-time high of $4,815, which it reached during the apex of the buying frenzy in cryptocurrencies in November 2021.\n\nSome bullish investors believe Ether's price could soar even higher. VanEck's Matthew Sigel and Patrick Bush expect its price to reach $11,800 by 2030, while Ark Invest's Cathie Wood believes it could be worth $166,000 by 2032. Investors should take those estimates with a grain of salt, but I believe Ether could still head much higher for four simple reasons.\n\n1. Interest rates are stabilizing\n\nEther, Bitcoin (BTC -1.65%), and many other cryptocurrencies were crushed in 2022 as rising interest rates drove investors toward more conservative investments. However, the Federal Reserve recently left its rates unchanged and won't likely raise them again this year. That stability -- and expectations for lower rates after inflation cools off -- should drive more investors back toward cryptocurrencies and riskier plays.\n\n2. Its supply is declining\n\nIn August 2021, the Ethereum Network implemented two major changes with its \"London\" upgrade. First, it changed the calculations of transaction fees -- also known as \"gas fees\" -- from a manual bidding system instead of an automated one. That change simplified and streamlined the process by setting prices based on the congestion in the network.\n\nSecond, it started to \"burn\" -- or remove from circulation -- the base fee of every transaction on its network. That burning process ensured that only Ether could be used to pay for transactions across the Ethereum Network (which solidifies its economic value) while gradually reducing its supply to stabilize its market price.\n\nIn September 2022, the Ethereum Network switched from the energy-intensive proof of work (PoW) mining method (used by Bitcoin) to the more energy-efficient proof of stake (PoS) method. That transition, known as \"The Merge,\" reduced its total mining energy consumption by about 99.95%.\n\nIt also made the Ethereum Network deflationary -- so more Ether was being burned than being issued. As a result, about $12.7 billion in Ether has been burned since the London upgrade. That's equivalent to 3% of its current market cap of $378 billion. While that burn rate might gradually cool off, the ongoing process should limit the crypto's downside potential.\n\n3. Possible ETF approvals in the future\n\nThe U.S. Securities and Exchange Commission (SEC) approved the first spot price Bitcoin exchange-traded funds (ETFs) earlier this year. However, the SEC has been reluctant to approve the first spot price ETFs for Ether because it believes Bitcoin is the only cryptocurrency that can be considered an asset instead of a security.\n\nThe SEC believes that Bitcoin's PoW process is more similar to the physical process of mining precious metals, so it can be assigned a market-driven spot price like gold and silver. But it says the PoS process that Ethereum uses makes it more similar to a security, which is subject to tighter regulations than commodities.\n\nThe SEC doesn't seem eager to approve the first \"spot price\" Ether ETFs anytime soon, but ETF issuers -- including VanEck, Ark Invest, and seven other companies -- could file litigation against the agency to accelerate the process. The recent approvals of Bitcoin and Ether ETFs in Hong Kong could also force the SEC to stop dragging its feet.\n\n4. The growth of decentralized apps\n\nThe main thing that sets Ether apart from Bitcoin is its open-source network. Bitcoin's blockchain can only be used to mine the cryptocurrency, but developers can build decentralized apps, tokens, and other crypto assets on the Ethereum Network.\n\nAccording to Fortune Business Insights, the decentralized apps market could grow at a compound annual growth rate (CAGR) of 28% from 2023 to 2030 as more companies roll out decentralized investing, lending, and crypto services that aren't tethered to centralized financial institutions. That expansion could drive more companies and consumers to adopt Ether as a mainstream digital currency.\n\nInvestors should brace for lots of volatility\n\nEther, like Bitcoin, is a volatile asset that could easily lose half its value before it doubles again. Therefore, investors shouldn't use any cash they need over the next five to 10 years to buy Ether. That said, Ether could still generate massive long-term gains for investors who can stomach all the near-term volatility."
    }
]