[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxQTVh0WkJxRFptaWI3ZXdzM3FtZXdoSTltYkoyYmdseHl3UENYcmRrMEhZb0hnQjEwWThOMUVPeVZfNmpDNEFsVzNWa3o2cnpudEN3Q1VHSDA1ZXVFVUlHYXRjT0RCa2RFd3FHblFqUzd3ZTZCV3g0R0lQUkxfQnNSUGpoSXBmYzhVM25lUld1MnVsSWRkX1BCbnFXLWVYYkt3c0dpWEFHTm1fUDgzWHhXZ2pJYlNhUdIBuwFBVV95cUxQb044Z3VHd18xZzI3OUVCYUI0WFdMZWMzS1ZveGt6cmJxMXByRWx4a1ZCcVUzLVlqeXE5YkJVTTktcmtIT2dNbVFDV21JVlhEX1NVbV9KRWRYOGRIMEtGZ3NrS2RXSXhJc2xNLW5hVkFqVVZncEF0d1pCbFlRRkxVaVBlcmZHblpvNzVsSzktYUJ4aEJ6aFhSekI5QmF6ZDRsQTFPNW9aLUlXRXRNNktaM2ZCTUVZMnM5TGE4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Validators Forced to Wait Days to Unstake Amid Celsius Withdraws - CoinDesk",
        "content": "The exit queue for Ethereum validators spiked to over 16,000 on Friday, while it was just at 26 the previous day, according to blockchain data from validatorqueue.com. The queue represents more than $1 billion worth of staked ETH at current prices, but the large backlog means it could take up to 5.6 days for that ETH to get back into the hands of its depositors."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxPZHhNQmFUbXFCMTItcDMzQUtUSnVJMHhZVjlROERBeDBaRDZhZzlNdUMwNTZjdklQX3VNQ0tzNWktZVNfRV9sMnhkdEZsZnhkMG53bVJGRU8xTzZ3VTZLVjNYZGg5SzZXckt6QkVmUW1VZFhrWFZmRVBBVm5JQlpVSUxsSGxMbTh6QzhJRGlQV0RXTkpq?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jan 2024 08:00:00 GMT",
        "title": "Ethereum staking exit queue hits record high amid Celsius unlocks - CryptoSlate",
        "content": "The Ethereum network is witnessing a surge in validator exits, which hit a record high of over 16,000 validators in the exit queue on Jan. 5, on-chain data showed.\n\nThe rise in exits has caused the wait time for unstaking to spike to an average of 5.6 days. Around 15,140 validators are still in the queue as of press time.\n\nThe surge was primarily driven by withdrawal requests from defunct CeFi lender Celsius Network and staking provider Figment, which collectively make up roughly 75% of total withdrawals in the queue.\n\n550k ETH\n\nCelsius, which is currently undergoing a restructuring process after declaring bankruptcy last year, has initiated a large-scale withdrawal from Ethereum staking.\n\nThe move, aimed at reallocating assets to satisfy creditors’ demands, involves the withdrawal of more than 200,000 ETH, valued at approximately $450 million.\n\nThe situation is exacerbated by the involvement of Figment, another major staking provider, which is linked to 54% (350,000 ETH) of the total withdrawals in the queue.\n\nTogether, the two entities want to withdraw approximately 550,000 staked Ethereum — roughly 1.7% of the 29 million ETH staked across all platforms.\n\nEntries drying up\n\nAmid these substantial exits, the entry queue for new Ethereum validators remains notably low, hovering near zero. This is a stark contrast to the swelling numbers in the exit queue.\n\nThe Ethereum network operates with a churn limit, which restricts the number of validators that can enter or exit the network per day to 2,925, based on 13 validators per epoch.\n\nThe surge in exit requests has also impacted the staking yield for Ethereum validators. As of press time, the staking rewards reference rate is about 3.4%, down more than 50% from the nearly 8% yield recorded in May 2023.\n\nThis significant shift in validator dynamics poses potential challenges to the Ethereum network’s stability, given the crucial role of validators in securing and processing transactions.\n\nMeanwhile, the extended wait time for unstaking, now at an average of 5.6 days, has raised concerns about the network’s ability to handle large-scale exits.\n\nMentioned in this article"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPeFJEY2lYVG1XWTV4cWdhZ3k2RDNNZ0VnSVVtSU1CLWtkamFCYzdYdUpOTU01X3VLV1dRMUx0Q0lVOWJDa1IxUWM5OGFFc2N5ZUpyMFlnbU1MNXRseTB4VFAxNFV5VGlST0Q5dHlqUHp1a0RvV1dTbm5ac1B6VC1xek44UndqdkQ2?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jan 2024 08:00:00 GMT",
        "title": "Arbitrum surpasses Ethereum in daily decentralised exchange volume for first time - DLNews",
        "content": "What you'll learn Arbitrum is flexing its muscles not only with other layer 2s but with the Ethereum mainnet.\n\nEthereum layer 2s have more locked deposits than other layer 1 networks.\n\nGrowth milestones for layer 2s are bullish signals for Ethereum.\n\nIn yet another indication of ballooning adoption of Ethereum layer 2 blockchains, Arbitrum — the biggest of the lot in terms of market capitalisation — has achieved a major milestone, surpassing the Ethereum mainnet.\n\nOn Thursday, decentralised exchange, or DEX for short, trading volume on Arbitrum exceeded that of the Ethereum mainnet — a first for Arbitrum or any layer 2 blockchain for that matter. Arbitrum’s DEX volume totalled $1.8 billion, surpassing Ethereum’s by almost $400 million, DefiLlama data shows.\n\nEthereum layer 2 networks like Arbitrum help to scale Ethereum while relying on its mainnet’s security architecture.\n\nDex trading volume by blockchains (DefiLlama/DefiLlama)\n\nFor a layer 2 to surpass its mainnet in any metric is quite the feat, it comes amid a growth peak for the blockchain. Arbitrum has hit a trifecta of all-time highs in the last week — TVL, DEX volume and the spot price of its native token ARB have reached all-time highs.\n\nTVL, or total value locked, is a measure of the investments locked in a blockchain or DeFi protocol.\n\nArbitrum’s TVL spike means the network leads the way in the net inflow of investor funds among all layer 2 blockchains with $365 million in the last seven days. Ethereum still leads the way in this metric with $705 million, according to DefiLlama.\n\nArbitrum's TVL has soared to a new peak\n\nWhile these milestones point to significant user-adoption gains, Arbitrum is not without its issues. The blockchain has suffered a few outages, the most recent of which occurred in December.\n\nThese outages have been caused by problems with the blockchain’s Sequencer — a part of the network used to verify, organise, and transfer transaction bundles to the Ethereum mainnet for finality.\n\nJoin the community to get our latest stories and updates\n\nArbitrum’s Sequencer is not the only one of its kind that suffered a temporary failure. ZkSync, another Ethereum layer 2, faced a similar problem last Christmas.\n\nApart from Arbitrum’s recent gains, Ethereum’s layer 2s have been experiencing a period of significant growth. At $20.7 billion, their combined TVL is greater than that of all other layer 1 networks, excluding Ethereum, which stands at $19.7 billion.\n\nApples and oranges\n\nThere is, however, one important caveat with the TVL valuation as it compares figures from two sources — L2Beat for layer 2 networks and DefiLlama for so-called layer 1 blockchains.\n\nL2Beat’s combined $20.7 billion figure includes not only investor deposits but the market value of the native tokens of these layer 2 networks. In comparison, the reported TVL for layer 1 networks — $19.7 billion — only encompasses the value of investments tied up in their respective decentralised finance markets.\n\nZkSync and Arbitrum have even managed to handle more transactions than Ethereum in the last 30 days, data from L2Beat, a layer two tracking portal, shows.\n\nBlessing in disguise\n\nWhile these achievements suggest some layer 2s are knocking Ethereum off its perch, this does not necessarily imply a negative impact on the mainnet. In fact, the opposite may be true, as these developments are contributing to positive economic outcomes for Ethereum.\n\nFor one, these milestones mean more money for Ethereum validators.\n\nLayer 2 networks pay fees when rolling up their bundled transactions to the Ethereum mainnet for finality — the process of making transactions irreversible, which ensures the blockchain maintains immutability.\n\nApart from increased validator earnings, the layer 2 transaction uptick is also contributing to mechanisms designed to induce deflation for Ether token supply.\n\nEthereum also has a deflationary mechanism brought on by a network upgrade in August 2021. This upgrade, EIP-1559, made changes to Ethereum’s fee structure with a portion of the transaction fee burned, thus reducing net Ether token inflation.\n\nThree of the top-10 fee burners are currently layer 2 networks, according to data from Ethereum explorer Etherscan.\n\nOsato Avan-Nomayo is our Nigeria-based DeFi correspondent. He covers DeFi and tech. To share tips or information about stories, please contact him at osato@dlnews.com."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxPUmhHY2s4Z0gzS3BMLTM4NERKODcwdG1rTFFLNzJVMkN2VTQtSGwxbU1DWDhZNDVWejJ1RmV3Tm1IUzJvY1YxMl9uUGQ5ZHB6X0FNLUpoeUZNX2VlS3Z1NFA0aXBuRE11RmVoTnVWTzdBZE4zN01obU9MOGdKRFEwMmM5ZjZVX1ZlNjRqSnBfRUdtc1M2UmtJ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Once Looked Unstoppable. But It's 1 Crypto I'm Avoiding in 2024 - The Motley Fool",
        "content": "Is it time to rethink the future growth prospects of Ethereum?\n\nHeading into 2023, Ethereum (ETH 0.12%) looked unstoppable. Ethereum had just pulled off The Merge, which was often cited as one of the greatest technical accomplishments of 2022. As a result of The Merge, which made the entire network much less energy intensive, Ethereum appeared to be well positioned to continue its dominance in just about every meaningful niche of the blockchain world.\n\nHowever, since August 2022 -- one month before The Merge -- Ethereum is only up 10%, at a time when other cryptos posted stellar triple-digit returns in 2023. From my perspective, Ethereum suddenly looks very vulnerable, which is why it's one crypto I'm avoiding in 2024. Let's take a closer look.\n\nNew strategic roadmap\n\nEthereum just released its new strategic roadmap for 2024, and I'm not impressed. Even Ethereum co-founder Vitalik Buterin acknowledges that there are only minor changes planned for the year ahead. The primary focus is on resolving some of the blockchain design problems that resulted from The Merge. Fair enough -- it's probably expecting too much from Ethereum to come up with a wildly new strategic roadmap after a breakthrough achievement like The Merge.\n\nHowever, what concerns me is that some of the initial grand strategic goals of The Merge keep getting scaled back. For example, at one time Ethereum promised a total throughput speed of 1 million transactions per second. That has now been scaled back to 100,000. And according to Ethereum's own strategic roadmap, that goal probably won't be achievable in its current stage of development. Meanwhile, rival blockchain Solana (SOL -1.77%) says it already has the ability to handle 65,000 transactions per second.\n\nOn top of all that, Buterin seems to be backing away from what he refers to as the \"financialization\" of Ethereum's blockchain. Simply put, this term means the mainstreaming of Ethereum's blockchain for Wall Street institutions, ensuring that the blockchain's architecture makes sense for the modern financial world. If you're a long-term investor, that's exactly what you want to see, because it would be huge for Ethereum's future growth prospects.\n\nHowever, Buterin now seems to be leaning into what he calls a \"cypherpunk\" (a mashup of \"cyberpunk\" and \"cipher\") approach to blockchain development to recapture some of the early mystique of crypto. Kudos to Buterin for staying true to his original vision for the blockchain. But as a cold-hearted investor, I find that somewhat worrisome. Are top Wall Street firms really going to partner with a bunch of cyberpunks?\n\nRise of new competitors\n\nBy itself, a less-than-compelling strategic roadmap would not be enough to get me off Ethereum. I mean, really, this is Ethereum we're talking about. This is a blockchain that has a strong track record dating back to 2015. Ethereum's Buterin has been featured on the cover of TIME magazine as \"the prince of crypto,\" and it's hard not to think of him as one of the brightest minds of our generation.\n\nHowever, take a step back and consider the overall competitive landscape. One of the primary reasons for investing in Ethereum has always been the fact that it is a best-in-class blockchain, with an obvious dominant market share in key blockchain niches. But now there are several very credible competitors all nipping at the heels of Ethereum. Right now, three of the top 10 cryptocurrencies by market cap -- Solana, Avalanche (AVAX -1.74%), and Cardano (ADA -2.47%) -- are direct competitors to Ethereum.\n\nMoreover, all three of these competitors now appear to be growing faster than Ethereum, especially Solana. At the end of 2022, for example, Solana started to eclipse Ethereum in terms of NFT trading volume and decentralized exchange (DEX) trading volume. And institutional investors really appear to be buying into the argument that Solana is a faster, more cost-efficient version of Ethereum. For example, Cathie Wood of Ark Invest recently appeared on CNBC, talking up the merits of Solana.\n\nHow can Ethereum get its mojo back?\n\nRight now, I'm not adding to my Ethereum position until it moves out of The Merge stage of development and into what the crypto's leaders have dubbed \"The Surge\" stage of development. To me, the remainder of The Merge stage is filled with a bunch of wonky technical improvements that aren't truly disruptive in nature. In contrast, The Surge is when Ethereum is supposed to hit that 100,000 transactions per second threshold. That's exciting, because even a world-class payment network like Visa, Inc. (V 1.28%) can't deliver that type of throughput.\n\nAt the same time, I'll be watching to see how well Ethereum preserves its market-leading position in key blockchain niches. If Ethereum can show that it is fending off rival blockchains such as Solana, then I will be much more inclined to restore my bullish outlook for Ethereum."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiX0FVX3lxTE1VVXR3U1BKY0ZuTG1CR3N5RVBQNTJkOXRCbGpqdEhuT3NvckxaWHhLSzNiclVhc1NXLVdCQjR3bjRidlJaUDItd3lBeG03MWRja3VYa2JDWXpPVnlja2tz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jan 2024 08:00:00 GMT",
        "title": "Dencun and Pralectra: Ethereum core devs chart an ambitious 2024 - Blockworks",
        "content": "Ethereum’s core developers are debating the priorities for the next hard fork after “Dencun,” which could come in late 2024 or 2025.\n\nFollowing Thursday’s All Core Devs call, the tentative schedule for the Dencun fork remains unchanged, with the Goerli testnet first up on Jan. 17.\n\nLoading Tweet..\n\nWith the rollout of the upgrade looking likely in March, developers are turning attention to what comes next in Prague-Electra — Pralectra for short — the upgrade to follow.\n\nStill very much in flux, a debate is in progress on the overall vision: Either a feature-focused set of smaller Ethereum Improvement Proposals (EIPs) or a major protocol upgrade to introduce Verkle Trees to the execution layer.\n\nVerkle Trees are a new data structure that evolve the current Merkle Tree in use today, using more sophisticated mathematical techniques — vector commitments based on elliptic curve pairings, which are a significant departure from the simpler hash functions used in Merkle Trees, according to verkle.info.\n\nThis structure uses less space and can be verified faster, both of which allow the network to handle more transactions.\n\nIn short, it’s a way to deal with the long-term problem of “state bloat,” which will be increasingly important as Ethereum scales.\n\nThe upgrade is a key milestone on Ethereum’s long-term roadmap, a phase referred to as The Verge.\n\nThere was no clear consensus on the call — some advocate for keeping the focus squarely on Verkle Trees, with Guillaume Ballet at the Ethereum Foundation warning “there’s no such thing as a small fork,” but others calling for a firm commitment to upgrade the network again in 2024.\n\nThe fear is that Verkle Trees could take 18 months or more to deliver — an eternity in crypto.\n\nDencun itself was originally slated for November, but was finally pushed into 2024 last october.\n\nRead more: Core devs rule out Dencun fork this year\n\n“Verkle is on the scale of the Merge if not worse in terms of complexity,” Ballet said. “You cannot really ship anything at the same time on the [execution layer] side.”\n\nLukasz Rozmej of the Nethermind execution client team agreed, recommending the developers prioritize a feature-rich fork first before turning fully to Verkle Trees.\n\n“My experience tells me that state redesigns are extremely hard and they take an extremely long time,” he told colleagues on the call. “Verkle toughness is not the specification, it is the implementation, optimization and testing.”\n\nFeatures, yes, but which ones?\n\nAmong those advocating for a second 2024 fork focusing on features were client teams for Nethermind, Besu and Reth. But the question is what takes precedence?\n\nAndrew Ashikhmin, software engineer on the Erigon client team, suggested that the EVM Object Format (EOF) would be one candidate to drive the next upgrade without distracting from longer-term work on Verkle Trees, because it could be implemented by a smaller team, and was a more isolated change to the code base.\n\n“But Verkle should be the main focus,” he said.\n\nEOF was originally considered for the Shapella hard fork, but was considered too big to be paired as a “passenger” alongside the main “driver,” Proto-Dank sharding or EIP-4844.\n\nRead more: Ethereum’s Next Upgrade To Focus on Blobs\n\nEOF is “definitely not a passenger” according to Justin Florentine, protocol engineer on the Besu client team, but he said that Besu had already made “a lot of progress” on the feature, and therefore was in favor of its adoption in Pralectra\n\nGeorgios Konstantopoulos, chief technology officer and researcher at investment firm Paradigm, which is building the Rust Ethereum (Reth) client, said his team was “OK [with] EOF as it’s [a] one man job and [needs] isolated testing.”\n\nBut Ethereum Foundation developer Marius van der Wijden shared the opinion that “EOF is not going to be in the small fork.”\n\nAnsgar Dietrichs at the Ethereum Foundation supported EOF for inclusion in Pralectra last April, and noted on Thursday’s call that the Solidity team — maintaining the EVM’s main smart contract programing language — was strongly in favor.\n\nNo one on the call was there to explicitly advocate for EOF, however, prompting Nethermind founder Tomasz Stanczak to remark, ”if nobody champions EOF on this call this would summarize why it has not been shipped yet.”\n\nStanczak called EIP-7002 or “Execution layer triggerable exits” the most upvoted EIP in the Ethereum Magicians forum and “super important,” because it fixes a “major design bug with staking [and] cannot come early enough.”\n\nFellow core developer Parithosh Jayanthi, known by the nickname “Potuz” said if he had to choose one feature to ship it would be EIP-7002. However, in his view, EIP-7549 “should definitely be in.”\n\nThis feature, which only affects the consensus layer, fixes a bug in Ethereum’s design and aims to reduce the average number of pairings needed to verify consensus rules. A pairing is an operation used in certain cryptographic algorithms involving elliptic curves.\n\nCurrently, to reach consensus it’s necessary to verify a minimum of 1366 attestations — indicating agreement between validators — but after EIP-7549 it would be reduced to just 22.\n\n“It’s trivial to implement and it’ll save a lot of aggregation time,” Potus said. “It can help on trustless bridges — and zk-provers, zk-bridges — it’s something that should definitely be in whatever fork we do next.”\n\nThe goal of the call was to kickstart discussion, and the specific approach and improvement proposals will be decided at a later date. Ethereum upgrades are consensus-driven; there is no explicit hierarchy of authority, or voting mechanism to determine priorities.\n\nIt can at times appear challenging or chaotic to make progress, not unlike herding cats, but that’s the nature of the decentralized beast.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    }
]