[
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMi2wFBVV95cUxQNl8teW1PeFBqaG53aGtRclkwNG5adHQ2cUNDaXk1Z1VSbUk3X0ZlS3Z4RU9kVmpETEU0OVBLdmRYbjFqYmVRaWxLcFRWVy1Bdkl2TjJtVnpWeVcta0NhZzdycWRhcnJwYXRNQk1tcDV0QlZFNWNmMUFfUWEzd1pTQWtmN1hnazZGNXVMNkZ6UnNWZUstWUpKY0RVZUlpTkVoOW1qS3o3Ry1ZRTIxaHJ0QS1iRDZXN2hCODhoMmhudXo2RncwS2lPYkpER3lyaVFZOUduc19FWGlYSWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jul 2024 07:00:00 GMT",
        "title": "Top Crypto Trader Reveals Why He's 'More Interested' In These Ethereum-Linked Coins - Benzinga",
        "content": "Widely-followed cryptocurrency analyst Michaël van de Poppe detailed his altcoin trading strategy, highlighting a substantial allocation to coins in the Ethereum ETH/USD ecosystem.\n\nWhat Happened: In a video shared on his official YouTube channel, Van de Poppe underlined the significance of investing in the right coins amid a hype-based market sentiment. He informed that he's \"heavily\" into the Ether ecosystem.\n\nThe analyst specifically pointed out the high expectations he has from the two Layer-2 network tokens, Arbitrum ARB/USD and Optimism OP/USD.\n\n\"I’m even more interested in them because there is more activity going into the Ethereum ecosystem and due to the spot ETFs, it’s going to be even better,\" he remarked.\n\nSee Also: Bitcoin Critic Elizabeth Warren Backs Kamala Harris For Presidency After Biden Withdraws From The Race: ‘She’s Ready To Step Up’\n\nVan de Poppe revealed that he will continue to HODL these coins at this time as they are vastly undervalued. \"There's no point in selling them quite early.\"\n\nWhy It Matters: This commentary comes a week after Van de Poppe emphasized Ethereum’s low valuation and long-term upside prospects.\n\nHe had predicted that Ethereum would reach a new all-time high faster than the rest of the market and described the upcoming launch of spot ETFs as a major catalyst.\n\nAs things stand, the funds tracking the spot price of Ethereum are set to debut this week, marking a new milestone for the world's second-largest cryptocurrency.\n\nPrice Action: At the time of writing, Ether was exchanging hands at $3,508.72 trading mostly flat in the last 24 hours, according to data from Benzinga Pro. Arbitrum rose 1.01% to trade at $0.7872, while Optimism gained 1.85% to be valued at $1.94.\n\nRead Next:"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMi5AFBVV95cUxNblJXbXk3RTl6NzlRY3hJY1hOY1luRHMycVBDbWdRQ2d0WXhUX0ZSTy1sZU5md0pGLVFIa00yalR3bHV3bmxSNXVRaEVKcnlBREtFVWl2bzItNUFTWXNrUlF5cE03VWMxZWxlemktWmVhNXowbkpkUjZaRDJ5aXY4TmJjZlAyNEd0a2pZYlpwc0pRWmtQMGdEZV9DaUxGMWx2dk1pM0VXY0t6SFdIWFMyNXhLYlhqaDc0bjVyMlp2U0RhM0VCOWJPajNzVjF4Y0dpaXR3OU5hbV9MOEY4dEdmV1VNaDM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jul 2024 07:00:00 GMT",
        "title": "Why Are Ethereum Classic And Ethereum Name Service Shooting Up On Spot ETH Approval Day? - Benzinga",
        "content": "The first-ever Ethereum ETH/USD spot ETFs have been greenlighted by the SEC and are set to begin trading tomorrow morning. Interestingly, two relatively lesser-known Ethereum-branded coins seem to have outperformed the marquee asset in 24-hour gains.\n\nWhat Happened: Ethereum Name Service popped more than 5%, emerging as the best-performing cryptocurrency in the last 24 hours. The coin's trading volume jumped 66% to $191 million, signaling significant buying activity.\n\nSimilarly, Ethereum Classic popped 3% to hit a monthly high. ETC's trading volume nearly exploded 184% to $452 million in the last 24 hours.\n\nCryptocurrency Gains +/- Price (Recorded at 10:44 p.m. EDT) Ethereum Name Service ENS/USD +5.63% $28.08 Ethereum Classic ETC/USD +3.06% $24.78\n\nThese increases come despite a drop in Ethereum, which has lost 1.47% in the last 24 hours.\n\nEthereum Classic was created as a hard fork of the original Ethereum chain back in 2016 over disagreements within the community following a hack. The new chain inherited the name Ethereum as we know it, while the original one functions as Ethereum Classic.\n\nAdditionally, ENS is a token associated with Ethereum Name Service, a decentralized naming system that converts complex, machine-readable names to ones easily understandable by humans.\n\nSee Also: Dogecoin Up 15% In 7 Days And One Indicator Shows It May Be ‘Primed For An Aggressive Up Move’\n\nWhy It Matters: ENS and ETC are fundamentally different from Ethereum, but many retail investors see them as cheaper alternatives.\n\nIt is worth noting that both ENS and ETC have much lower unit prices than ETH. So, while ETH gains popularity among institutions, individual investors may be tempted to shift their focus to lower-cap ‘Ethereum’ coins\n\nPrice Action: At the time of writing, Bitcoin was exchanging hands at $67,503 trading mostly flat in the last 24 hours, according to data from Benzinga Pro.\n\nRead Next:"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxQOGtRV0NFVTVYMXcwOWQ2bW1YZ01tb3JlSEc1TlJTWlQ1bEV3UXc0OFlRNk9VM3pFMjNLUWNRX0VGdm1CRGw0bUtORVZKU1FDX1FhZGtrZ2dldHdFUnJ4TFd3TUJHN0RTWHFLZHlZYnA1OWFYY1RYdG5zckVNdTNFRDJ2aDc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jul 2024 07:00:00 GMT",
        "title": "Cboe Confirms Spot Ethereum ETFs Will Start Trading on July 23 - Yahoo Finance",
        "content": "Cboe Confirms Spot Ethereum ETFs Will Start Trading on July 23\n\nThe Chicago Board Options Exchange (Cboe) has confirmed that several spot Ethereum exchange-traded funds (ETFs) will commence trading on Tuesday, July 23. Notices posted on Cboe’s website on Friday announced the listing of multiple spot Ethereum ETFs. The ETFs set to begin trading include the 21Shares Core Ethereum ETF (CETH), Fidelity Ethereum Fund (FETH), Franklin Ethereum ETF (EZET), Invesco Galaxy Ethereum ETF (QETH), and VanEck Ethereum ETF (ETHV).\n\nThis move follows the unexpected approval of spot Ethereum ETFs by the U.S. Securities and Exchange Commission (SEC) in May, a surprising shift from the regulator's previous scrutiny of Ethereum-focused firms. The approval came just four months after the first spot Bitcoin ETFs began trading in the United States. Each listing states, \"We are pleased to announce that One (1) Exchange Traded Product ('ETP') will be listed on Cboe and will begin trading as a new issue on July 23, 2024, pending regulatory effectiveness.\"\n\nEthereum, the world's second-largest cryptocurrency by market cap, has seen significant interest from investors. The approval and upcoming trading of these ETFs are expected to further boost Ethereum's accessibility among traditional investors. According to CoinMarketCap data, ETH is currently trading at $3,529, rebounding from a dip following the sudden news of President Joe Biden exiting the Presidential race. ETH is up 6.21% over the past week.\n\nThe SEC’s initial approvals in May marked a turning point, as the regulator had previously been cautious about Ethereum, seemingly treating it differently from Bitcoin. However, the success of spot Bitcoin ETFs likely influenced the SEC’s decision to extend similar approvals to Ethereum ETFs. The SEC recently dropped its investigation into Ethereum 2.0, paving the way for greater regulatory clarity on the second-largest cryptocurrency."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE15aVFRWllQUDVYVHEtZUZRRU5PMlExSjFNM3FJN1p0ZDl5X3RiVmhnX3o2MVBYTWRDcDNQQndMOEhmUjBjNXc4cjM0MHNrakJfNFpGbzl1UWhMVnNGYlBRNnYwb1ZEZll0M3plS1cxVXU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jul 2024 07:00:00 GMT",
        "title": "SEC approves ether ETFs as crypto moves closer to mainstream - Financial Times",
        "content": "Print this page\n\nThe US Securities and Exchange Commission has approved the first spot ethereum exchange traded funds, another landmark for cryptocurrency advocates and investors following the debut of bitcoin ETFs earlier this year.\n\nThe nine ether ETFs, including the conversion of a $9.3bn Grayscale Investments trust and new launches from bitcoin ETF giants BlackRock and Fidelity, gained approval from the SEC on Monday afternoon, and trading began on Tuesday morning. The SEC did not immediately respond to a request for comment.\n\nEther is the native cryptocurrency of the ethereum blockchain and is the second-largest crypto token in the world behind bitcoin with a market capitalisation of about $415bn. The price of ether ticked up about 1 per cent after trading began on Tuesday and is up more than 47 per cent since January 1.\n\nThe approvals, which follow those of ether futures ETFs last year, give crypto a firmer toehold in traditional US finance after January’s launch of the first US spot bitcoin ETFs. The price of bitcoin was up more than 51 per cent year to date on Tuesday morning.\n\n“Traditional asset management can no longer ignore crypto as an asset class,” said Matt Hougan, chief investment officer of crypto fund sponsor Bitwise. “I think you’re going to see effectively everyone embrace this space.”\n\nCboe Global Markets, which lists five of the ether ETFs, said initial trading showed “good market quality”.\n\n“All products opened for trading smoothly, with strong participation from our dedicated market makers who have been actively quoting and providing liquidity from the outset,” Cboe said in a statement.\n\nAs was the case with bitcoin, ethereum ETF issuers are jostling for investor interest with a relatively tight range of fees. Final expenses for all but one of the products would be below 0.25 per cent, with at least five issuers planning to entirely waive fees at first, according to data compiled by Bloomberg Intelligence.\n\nThere is a glaring exception in the pricing war: Grayscale will keep in place the 2.5 per cent management fee for its large converted ethereum ETF while seeding a “mini” version with 10 per cent of the larger ETF’s assets. The smaller sibling is expected to have the lowest post-waiver fee of the initial ether ETFs at 0.15 per cent.\n\nGrayscale in January also kept the fee for its bitcoin ETF management fee at 1.5 per cent — down from 2 per cent initially, but still way above its competitors. That decision has generated $160mn in fee revenue for Grayscale’s bitcoin ETF so far in 2024, the third-highest of any US ETF and good for 2 per cent of all US ETF revenue, according to Bryan Armour, Morningstar’s director of passive strategies research.\n\nThese ether products are not initially expected to bring in as many assets as the bitcoin ETFs into which investors have put more than $17bn in new money over the past six months since their launch.\n\nWhile the ethereum blockchain has a wide range of uses beyond storing value, investors might not be able to wrap their heads around it as opposed to bitcoin’s common reference point as “digital gold”, said Tim Ogilvie, global head of institutional with Kraken, a US cryptocurrency exchange.\n\n“I would be surprised if you saw a similar explosive start for ETH,” Ogilvie said.\n\nHougan has predicted that ether ETFs would attract about $15bn over their first 18 months on the market. He added that flows into the new funds “could be a little squirrelly” in the summer."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE15aVFRWllQUDVYVHEtZUZRRU5PMlExSjFNM3FJN1p0ZDl5X3RiVmhnX3o2MVBYTWRDcDNQQndMOEhmUjBjNXc4cjM0MHNrakJfNFpGbzl1UWhMVnNGYlBRNnYwb1ZEZll0M3plS1cxVXU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jul 2024 07:00:00 GMT",
        "title": "SEC approves ether ETFs as crypto moves closer to mainstream - Financial Times",
        "content": "Print this page\n\nThe US Securities and Exchange Commission has approved the first spot ethereum exchange traded funds, another landmark for cryptocurrency advocates and investors following the debut of bitcoin ETFs earlier this year.\n\nThe nine ether ETFs, including the conversion of a $9.3bn Grayscale Investments trust and new launches from bitcoin ETF giants BlackRock and Fidelity, gained approval from the SEC on Monday afternoon, and trading began on Tuesday morning. The SEC did not immediately respond to a request for comment.\n\nEther is the native cryptocurrency of the ethereum blockchain and is the second-largest crypto token in the world behind bitcoin with a market capitalisation of about $415bn. The price of ether ticked up about 1 per cent after trading began on Tuesday and is up more than 47 per cent since January 1.\n\nThe approvals, which follow those of ether futures ETFs last year, give crypto a firmer toehold in traditional US finance after January’s launch of the first US spot bitcoin ETFs. The price of bitcoin was up more than 51 per cent year to date on Tuesday morning.\n\n“Traditional asset management can no longer ignore crypto as an asset class,” said Matt Hougan, chief investment officer of crypto fund sponsor Bitwise. “I think you’re going to see effectively everyone embrace this space.”\n\nCboe Global Markets, which lists five of the ether ETFs, said initial trading showed “good market quality”.\n\n“All products opened for trading smoothly, with strong participation from our dedicated market makers who have been actively quoting and providing liquidity from the outset,” Cboe said in a statement.\n\nAs was the case with bitcoin, ethereum ETF issuers are jostling for investor interest with a relatively tight range of fees. Final expenses for all but one of the products would be below 0.25 per cent, with at least five issuers planning to entirely waive fees at first, according to data compiled by Bloomberg Intelligence.\n\nThere is a glaring exception in the pricing war: Grayscale will keep in place the 2.5 per cent management fee for its large converted ethereum ETF while seeding a “mini” version with 10 per cent of the larger ETF’s assets. The smaller sibling is expected to have the lowest post-waiver fee of the initial ether ETFs at 0.15 per cent.\n\nGrayscale in January also kept the fee for its bitcoin ETF management fee at 1.5 per cent — down from 2 per cent initially, but still way above its competitors. That decision has generated $160mn in fee revenue for Grayscale’s bitcoin ETF so far in 2024, the third-highest of any US ETF and good for 2 per cent of all US ETF revenue, according to Bryan Armour, Morningstar’s director of passive strategies research.\n\nThese ether products are not initially expected to bring in as many assets as the bitcoin ETFs into which investors have put more than $17bn in new money over the past six months since their launch.\n\nWhile the ethereum blockchain has a wide range of uses beyond storing value, investors might not be able to wrap their heads around it as opposed to bitcoin’s common reference point as “digital gold”, said Tim Ogilvie, global head of institutional with Kraken, a US cryptocurrency exchange.\n\n“I would be surprised if you saw a similar explosive start for ETH,” Ogilvie said.\n\nHougan has predicted that ether ETFs would attract about $15bn over their first 18 months on the market. He added that flows into the new funds “could be a little squirrelly” in the summer."
    }
]