[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxOTmFFWWowNjYxTDREaElRbWUyQ1dPOXh5T19KamhrbEVCN1plUDIyWGpXX1ZBVWpqSWJXRVdFM3hoRExBbUpfZk1pb08tRTdPTXhGYTRiSHZZRUlUUGUtTnRXQ0dGelA0QTBjemtvT3JSckVzeTdrMmtZYUo0STh5eHZKZ3BaZEUzWWdWclI2MC1JUTR6cVFObVVxTEJhNlJxLVVaU0lLcGJIMnNaR3ZkNtIBtgFBVV95cUxNSXNYU0U3NHN4MEpmcnVIcjR6dnlTMmtqaXpBcmJBdk1iS1c1dUJUbVpYT2ZfcDJGaDJ3MjlZUVAzSnF5U1ZJV1dVN0hwaUs2QnZVRFEzVGFXeTdPY2ZDdHNuYzF6dzhtTjBSWnhxMmpsS284T2FISVM4clNJVjZaaHVkaUZRWl9aYThFcU5xdUtXOUY5ZkpMNkI1OEw0dVdXZXdFX1FYSWZJUTNCalpVNGppNTVnUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 11 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Validator Entry Queue Signals Renewed Interest in Staking - CoinDesk",
        "content": "While the number of stakers looking to join the network has spiked, the tally remains well below the figures over 75,000 seen following Ethereum’s Shapella upgrade in April last year. The Shapella upgrade opened withdrawals of staked ether for the first time, de-risking the process of locking coins in return for rewards."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxON1FTcDdDelltMHhOSW1tUlpoWFdYSnVvYTljaVhfcm9QUTc1S3pTaUo0OFB5N2dQWHpnOVc3T0VtVkpfRS11QzVoZUkzVmxPNXJSZXlENjh1S0hjVEoxTjBaZHVTUmthdExRSjhiN0trTXNteXpNUWpxNjE2UHpESGJ6OWNEM1FTQjdQZVR30gGTAUFVX3lxTFBUbk5uYXhfOHpxZXJfM1hkektqTHB2N0lLT0U3NWR2bU9aaUN0UXVraEpsME9rWVY3SkVyOHp0Ti0tWXEwRUowQmtfRzgyR05DNmNGaXFLRXI4c0xNUjlPcjEwbG9NQW1Hem5qa2p6NmxzZjRhQWlQNVl1OF9aVzVUaGxRcVF5M3k1a3hBZDMwMXVYWQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 11 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Price Prediction: Can ETH Break Above $10,000 in 2024? - CryptoPotato",
        "content": "Altcoin analyst Altcoin Gordon told over 400,000 X followers Friday that his year-end target for Ethereum is $11,250. That would be a 3.4X increase compared to current prices.\n\nBitcoin has received plenty of attention from the media since October between the SEC approval of Bitcoin ETFs in January and the upcoming fourth Bitcoin halving in April.\n\nEthereum supply dropping. Ethereum demand increasing. Do you understand? pic.twitter.com/txH5g9Eq4w — Gordon (@AltcoinGordon) January 18, 2024\n\nBut an Ethereum ETF is also in the works this year, and the network has been deflationary in supply ever since a very significant upgrade in 2022.\n\nMeanwhile, JP Morgan analysts are anticipating the Proto-Danksharding upgrade this year.\n\nEthereum Price Prediction: $11,250 By 2024\n\nAltcoin Gordon is targeting an Ethereum price of $11,250 by the end of 2024. He also predicts $27 Cardano (ADA), $111 Chainlink (LINK), and $0.47 Ripple (XRP).\n\nPrice targets for end of 2024 BTC $98,750\n\nETH $11,250\n\nADA $27\n\nLINK $111\n\nCOTI $3.27\n\nETHEREUM $9,800\n\nXRP $0.47\n\nUSDT $1.40 Too bullish or not bullish enough? 👀🤔 — Gordon (@AltcoinGordon) February 9, 2024\n\nThink that’s crazy? Web3 super-user, educator, and angel investor, Defi Dad says he could see Ethereum “ripping to $20K- $25K” this market cycle.\n\nHis remark was in response to hiFramework founder Vance Spencer pointing out the “Ethereum onboarding funnel” in 2024 will feature a diverse set of applications, from Gaming L2s, to Corporate L2s, to Social L2s, to “All of the other (hundreds?) of L2s spitting out tokens to acquire users.”\n\nEigenlayer Staking, Dencun, and Spot ETH ETFs\n\nEthereum expert Anthony Sassano recently told Forbes why he’s bullish for Ethereum prices in 2024:\n\n“I think 2024 is going to be a great year for the price of ETH as there are plenty of tailwinds headed ETH’s way, such as the birth of staking via EigenLayer, 2 major network upgrades—Dencun in March and Petra sometime in Q4—as well as spot ETH ETFs going live as early as May.”\n\nIn December, JP Morgan predicted that Ethereum would outperform Bitcoin in 2024 because of the EIP-4844 upgrade.\n\n“We believe that next year Ethereum will reassert itself and recapture market share within the crypto ecosystem,” JPMorgan analysts wrote in a Dec. 13 report."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE5seUJWLUxfR3FYMjVSYWRzd2h5YzlZUDdYUklESzNHS3lCV0hlODZIV1d6Y3FZXzNSa1hDVkxSRnotQUtEeDdaZG1QaVMyaURzdC1uYXhDRzVlN1AySmNxMmtqdnlDNWZnSktpNTFoZW9CLVFPRS1B0gF8QVVfeXFMT1N4RnpfNnlqZm83cXFTZlBrUTZabmFLclc3NTd1Nm9mYzlyRXZtVDhzMWFhM2hNTnA5a3R6eHJzbFpUTzN4LWFjcEtCNHdSTkRBdkI5NmE5aXRDT3ByNGZxVHdvM3F0TjgwOGlZdTFPaDgyTEo0cTRBbWcwZA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 11 Feb 2024 08:00:00 GMT",
        "title": "Ethereum's (ETH) Last Hope Gone? ERC404 Volumes Plummets - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nThe Ethereum ecosystem is facing a reality check as the innovative ERC-404 sector on Ethereum experiences a substantial drop. In the past 24 hours, the market capitalization of ERC-404 tokens has plummeted by 29%, with tokens like PANDORA sliding over 15%, DEFROGS tumbling over 22% and RUG collapsing by a staggering 38%.\n\nAdvertisement\n\nThe ERC-404 standard was hailed as Ethereum's beacon of innovation, potentially the new fuel for a bull run akin to the impact of NFTs in 2021 and ICOs in 2017. However, the sharp and swift capitulation in market capitalization raises a lot of unpleasant questions over its viability as Ethereum's \"last hope\" for a resurgence.\n\nThis standard was envisioned to create tokens that are both fungible, like ERC-20, and unique, like ERC-721, adding a layer of value through associated NFTs that could be rare or hold special significance.\n\nTaking PANDORA as an example, purchasing this ERC-404 token on exchanges like Uniswap not only grants the token itself but also an unique NFT, introducing an element of chance and gamification to trading and ownership. Acquiring a rare NFT could potentially amplify an investor's portfolio value, and selling it on platforms like Blur or OpenSea would simultaneously execute the sale of the linked token.\n\nAdvertisement\n\nThe current decline of ERC-404 tokens, however, signals potential trouble for Ethereum. The rapid devaluation challenges the premise that ERC-404 could lead to a new era of growth for Ethereum.\n\nIf ERC-404 tokens continue to lose ground, it could reflect negatively on Ethereum's capacity to innovate and sustain new developmental trends. Ethereum's future now depends on its ability to adapt and overcome the market's skepticism, finding new pathways to innovation that can revive confidence and investment in its ecosystem."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiYkFVX3lxTE0wVWw3bkZITFE1YjRYV2ZnbTJHLVBKdTl0Tkk1T2Z1SDdfc0RlSVkzX2RQTVJUbW95dlV1QU95YjA5ZlhVbF9Jd1FGSUpXQmZaSV93bFhNSzB2a3dxZWZkdGxn0gFnQVVfeXFMTUVXM09ONTdOREEtcXVERUhSM3NhbURaNGFEZUZzMlJhemNmVnpUSmZORXkwRmJxTDlsSWktWkhGVXU4bThyQnhKWUc0bFFueVJkM0pHYVdEekpWWGFENFBFX2d5V1Jxbw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 11 Feb 2024 08:00:00 GMT",
        "title": "New Crucial Ethereum Update Released - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nGo Ethereum has announced the launch of Geth v1.13.12, preparing the ecosystem for a major upgrade scheduled for March 13, 2024.\n\nAdvertisement\n\nGeth v1.13.12 incorporates the mainnet fork number for Cancun, marking a decisive step toward implementing a suite of evolutionary Ethereum Improvement Proposals (EIPs). The specifications, which are publicly accessible for review, introduce pivotal changes that promise to refine the operational mechanisms of the Ethereum Virtual Machine.\n\nAmong the notable EIPs included in this update are:\n\nEIP-1153: Introducing transient storage opcodes for optimized data handling. Advertisement\n\nEIP-4788: Incorporating the Beacon block root within the EVM, enhancing interoperability between Ethereum and its Beacon chain.\n\nEIP-4844: Facilitating Shard Blob Transactions to enable sharding and improve scalability.\n\nEIP-5656: Adding a new memory copying instruction, MCOPY, for more efficient data processing.\n\nEIP-6780: Restricting the use of SELFDESTRUCT to the same transaction, improving system resilience.\n\nEIP-7516: Introducing the BLOBBASEFEE opcode to calculate base fees for blob transactions.\n\nThe release also resolves a critical bug related to Geth miner tip enforcement, ensuring the network operates more reliably.\n\nAccompanying the Cancun upgrade, Go Ethereum is providing updated Grafana dashboards for InfluxDB and Prometheus, allowing users to monitor network performance with greater precision. The release packs an array of various improvements, which can be found on the official announcement page on GitHub.\n\nThis Ethereum client update is a testament to the continuous evolution of the Ethereum ecosystem, reflecting the dedication of developers to enhance the blockchain’s capabilities. With these changes, Ethereum takes a step closer to its vision of a more efficient, scalable and interoperable network."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxOTTIxOEs0aTlBYmlmeHZPOWFPZGdIekZ3MWxxN3lSZ3ctdnd3NF9sSFIzX0k2cUNmNnpzb1BYV0c0aGxJaWJkczcyVEY0aDNXVnhYV3dGMjdDYXBDYmJ0bVR0T2dMNHotUmV0VzhMcUkycmpDWUF5cjhiQTU0dVFmemNEN1RoMGVsSWktajB0OUw3bU5VdFl1NUJoY202aUZENVZnMFBHc1NLdnFuOUhCMG9sb9IBuAFBVV95cUxPTEU2X09KNWdCT2ZkLXhQdzE1SFNtU1NaWFQ3VHN3aHdPbFBSRjNKTGNZTEYtUkpSaVI5RFpsUFZYa0pJeWFYNGZ3QTFMUWNYRnpocGdSbE44SDRmRXFvclVid09FMXlkaGZCR2pVdWpzRlJ2Nzhua0pUcTNXRGVLa0pkMzZhRGlEUWF5RGJTTmk1bGNfekU2MjJ0OWI3b0hXQjAxLXlZZERWOGRwd2x2V25MaUF1WS1m?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 11 Feb 2024 08:00:00 GMT",
        "title": "$3,000 Is Next for Ethereum (ETH), Cardano (ADA) Shows Massive Breakthrough, Solana's (SOL) Suspicious Rally - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nAs the Ethereum network continues to evolve with its recent ERC-404 token standard being massively implemented, its native asset is finally gaining some traction on the market. It is showcasing promising growth, and its price trajectory suggests that the coveted $3,000 mark may be on the horizon.\n\nAn analysis of Ethereum's price chart reveals a steady upward trend, with the asset recently crossing the $2,500 threshold. The next significant resistance level appears to be at $2,600, a point that has previously seen sellers stepping in. A break and hold above this level could pave the way for Ethereum's ascent toward the $3,000 psychological and technical barrier.\n\nSupporting this potential growth scenario is the continued development of the Ethereum network, including the anticipated benefits of the ERC-404 update. This new standard is expected to enhance the utility and interoperability of tokens on the Ethereum blockchain, potentially increasing demand for ETH as the required \"fuel\" for deploying tokens.\n\nAdvertisement\n\nHowever, there remains a cautionary scenario to consider. Ethereum's rival, Solana, has recently experienced a slowdown due to network outages, which could potentially cause a ripple effect across the broader crypto market. If such events lead to a loss of confidence in blockchain networks or a shift in investor sentiment, Ethereum could face a setback.\n\nA potential price drop scenario could be triggered by technical rejections at the $2,600 resistance level, coupled with negative market sentiment stemming from issues in competing blockchains like Solana. Should Ethereum fail to sustain its momentum, a pullback toward the local support level at $2,300 may occur, where buyers have previously shown interest.\n\nCardano remains strong\n\nCardano (ADA) has recently demonstrated a significant breakthrough in price action, suggesting a bullish trend could be forming. Cardano's price has been tracing an upward trajectory, recently punctuating this ascent by breaching a key resistance level.\n\nA technical analysis of ADA's chart indicates that the cryptocurrency has managed to surpass the resistance near $0.515, which had previously capped several attempts at an upward move. Closing above this level could signal newfound confidence among investors and pave the way for further gains.\n\nOn the growth front, if ADA sustains its momentum above this resistance turned support level, the next target for the asset could be the $0.580 mark. Such a move would represent a significant uptick in market valuation and could attract more attention to Cardano as a viable investment in the blockchain space.\n\nHowever, every market scenario has its counterpart. Should ADA face rejection at higher levels, there is potential for a pullback toward the local support at $0.485. A drop below this point might compel traders to reassess the short-term outlook for Cardano, potentially leading to a consolidation phase or even a deeper correction if broader market sentiment turns negative.\n\nSolana slows down\n\nThe recent price movements of Solana have caught the eye of many in the cryptocurrency community, with its ascent on the charts prompting discussions around the sustainability of its rally. Despite the uptick, there is a pervading sentiment of caution as the momentum behind the rise appears to lack conviction.\n\nAn analysis of Solana's trading patterns reveals that while SOL has made strides to overcome resistance, achieving a local high of approximately $112, the rally's foundation seems tenuous. The support level to watch is around $98.89, where SOL has previously found a degree of stability. Should the asset maintain above this level, it might dispel some of the skepticism surrounding its recent performance.\n\nHowever, the growth scenario for Solana is shadowed by concerns of a potential breakdown. The momentum indicator on the charts suggests that the energy behind the rally is not as robust as investors might desire. If Solana fails to sustain the buying pressure needed to push higher, it could see a retreat back to the support level or even lower, which might trigger a more pronounced sell-off."
    }
]