[
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE9GNHFBV19JYmFkMWRnNmtXbXpoWEN5T2twYnpOV2ZhNXBLY0tEZ21uMUsyRXR1X2QzMU9rcVZLX0pJcGxOaHV3Vm9MRkROUnJQcjllTTB4SVgtX19fMlpxd0Z1aUFaNlV2Zm9zY0RGYk15MzVnb1RnZmFzQjBLZ2PSAYQBQVVfeXFMTUp3eDRuMHJRT3ozeDg5em5ZQ2pwNGdUdTNOQUdWa295emNRQzliTGJFXzU0SXo3LVJXM3ByWVJUbGJScXVtcjlpQzFlTXUwcGUyT1hnN2JQUGhMWmZDQ0RnNFp2Z2tjV2EyZWliY1c1Q1lpX20xbGpMNG5Ccm1fdVFHbFYz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 16 Jun 2024 07:00:00 GMT",
        "title": "Ethereum ETFs May Be Approved by July 2, Top Expert Reveals - U.Today",
        "content": "The approval of Ethereum ETFs could be just around the corner, with top experts suggesting a possible date of July 2. As reported by U.Today recently, SEC boss Gary Gensler hinted that the agency could approve S-1 forms for spot exchange-traded funds on major altcoins \"sometime this summer.\"\n\nAdvertisement\n\nThe SEC has already taken steps to allow the listing and trading of eight Ethereum ETFs by approving rule changes. However, S-1 registration forms, which contain detailed information about the products, are still needed before they can go live. The SEC asked issuers for updated S-1 forms in late May, indicating that the process is still moving forward.\n\nEric Balchunas, senior ETF analyst for Bloomberg, has predicted that the regulator could approve these forms by July 2. He noted that SEC staff recently sent issuers minor comments on the forms and asked for responses within a week. The expert believes there is a good chance the commission will finalize its decision before Independence Day weekend, making July 2 a likely date for approval.\n\nAdvertisement\n\nUPDATE: we are moving up our over/under date for the launch of spot Ether ETF to July 2nd, hearing the Staff sent issuers comments on S-1s today, and they're pretty light, nothing major, asking for them back in a week. Decent chance they work to declare them effective the next… https://t.co/XJZ8JLwEFF — Eric Balchunas (@EricBalchunas) June 14, 2024\n\nNate Geraci, another ETF analyst, also sees this as a positive sign, suggesting that there is not much left to do before final approval.\n\nThe potential approval of Ethereum ETFs may become a pivotal event for the crypto market as it could open up new investment opportunities and drive further adoption of digital assets. While the SEC nears its final decision, the community is watching closely, anticipating the impact on both institutional and retail investors."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTFBiSDIxbEJmMXFQcjl1aG8tUk1nS1AzSXVYVmhCUFJxVXNZbldNYjVfUGpqc2dmSU1hcW5ELU1vR0lRUjVJOEF5d0tqdFFtY3h3WnlmRGpReXg3SG1ycTZlVjZFWm84azlMWDZ5Q3ZnTVcweVFqQlZpajQ2NjNlM0HSAYQBQVVfeXFMUFN0dHZhU1JBMm1kWTRXcGxXQWxPVEhETTNfOEdyUllPY1lJUHpHMlYxMFVEQzFTbFpqMlpSeGhlQmQ2SnNmcXM0UDNaMDhiOUFPamJ4Q1M5ZG04bG1GM1AybXkxdm1Yd3pTeDV4Y0dfcHBfT2J5R2tmVUI2bk5nanoyYzdB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 16 Jun 2024 13:17:19 GMT",
        "title": "Ethereum Whales Scoop up $2.45 Billion Worth of ETH in Weeks - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAccording to data provided by cryptocurrency analytics platform Santiment, Ethereum whales have scooped up more than 700,000 ETH tokens (roughly $2.45 billion) over the past three weeks.\n\nAdvertisement\n\nDespite this buying spree, Ethereum is struggling to regain its bullish momentum. The flagship altcoin is currently trading at $3,562 on the Bitstamp exchange after reaching an intraday low of $3,360 on June 14.\n\nEarlier this week, CryptoQuant analyst ShayanBTC noted that Ethereum's bearishness might persist in the near future due to aggressive selling by futures traders.\n\nIt surged in tandem with Bitcoin on Wednesday due to better-than-anticipated U.S. inflation data.\n\nAdvertisement\n\nHowever, cryptocurrencies retraced together with other risk assets after some hawkish comments made by Federal Reserve Chair Jerome Powell called into question the possibility of several rate cuts this year.\n\nWill Ethereum ETFs be bullish catalyst?\n\nLast month, the U.S. Securities and Exchange Commission unexpectedly approved several 19b-4 forms for Ethereum exchange-traded funds (ETF), triggering a major rally. On May 27, Ethereum came close to reclaiming the $4,000 level due to investor exuberance. However, this excitement quickly dissipated as soon as market participants realized that the SEC was yet to approve S-1 registration forms that would make it possible for these products to start trading.\n\nAs reported by U.Today , SEC Chair Gary Gensler said that the final approval of Ethereum ETFs would take place over the course of this summer during a recent congressional hearing."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMi5wFBVV95cUxQeDlwajFYX2RxTEQ4TVhKV1FnYnVKbFRqM2E1WnJBNWZTaHpCWUdZcTNNR3g2OUNBcEpaUHhTaW1vR3dUc0dLblQyRmo5QXBiVUEtMjlSRVhOYXhRd1hDZV9EWXNfSk5SS0ZpdTlLQjE0LXhaY2VJb2d6S1R6SHQtRzJUY0hNc2ItTnc5WDdjNWN1WXN1aFo2d1pQVHI2UVRaYzhGRTJaWTBzckZWLXBfZExwZlNJUVV0bEF2aWViS3doeE1pLXFGVVhaMW5oT2pUOEdXX1FtTF9lVk41TUFxTzAtRlN3ZnM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 16 Jun 2024 07:00:00 GMT",
        "title": "Biggest News in Crypto This Week: Michael Saylor Buys more BTC | Ethereum ETFs Launch | Paradigm to Invest $850M - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxPRVZOTllNM0lvcTltM0pmMlZSZjl2SndlS1I3aTZ2b3VrMmRoNUxtamNYY3RhLVdKb0lpV3M2TjNsT2pHcGExNHp1dVBEUjJtNmtWam5wZVFhazVfVElwdWNuNGxfTE5rbE82YmNOUHZ2LUZJbzN5dUp1VFJVenhDT2pHM0tsZmJmTDBnajAyY3gtUFB2SEZ0RzNTMEhiSVZRT3fSAaoBQVVfeXFMTzFIWmtXd3BBb3NGU0M2WmNRMDFlYlVpQ3pBR0JCY0JFSmMwcTlsSXVRM0k4bzlLSEtBNDMyMVZfREVLX0xfRkxYeTQ2Rzg3dFVTXzJoZW5XbmlmQmVCTjBoY2RYM3ZpZU9zSUpkd3JIS0c0QjVzYVF2ZDFyQzF0M0NzY0dWRUE1dU5zUEhEZnBuUzJwaEF1VFl2ODVnZHl6MU1ON0dIdnJkRFE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 16 Jun 2024 07:00:00 GMT",
        "title": "‘Wall Street Is Greedy’: Tether Co-Founder Predicts Next ETFs After Bitcoin, Ethereum - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nDon’t expect crypto ETF momentum to slow after the approvals of spot Bitcoin and Ethereum funds in the United States: Wall Street's “greed” will bring more and more such products, Tether and WAX co-founder William Quigley told Decrypt this week.\n\nQuigley predicted a proliferation of ETFs for other leading cryptocurrencies like Solana and Cardano, driven by Wall Street's relentless pursuit of profit.\n\n“Wall Street is greedy,” he said. “Every time Wall Street packages a new product to sell to consumers, if that product is successful, you can guarantee there will be copycats. There would be no ETFs if the Bitcoin ETF had failed.”\n\nHe added that Wall Street loves the “next hot new thing” because it’s something it can talk to its consumers about and sell their products. But should the momentum eventually cool, Quigley expects that ETF providers will shift focus to the next big trend.\n\nAD\n\nAD\n\n“We will continue to see new ETFs launching until there's a big pullback,” he added. “Then, you’ll see some of those ETFs shut down by the firms who launched them due to lack of demand.”\n\nThe SEC’s long-awaited approval of spot Bitcoin ETFs in the U.S. in January marked a significant milestone in integrating cryptocurrencies into mainstream financial markets. They allow investors to gain exposure to Bitcoin without directly holding the cryptocurrency, thus providing a more accessible and regulated investment vehicle.\n\nThis approval sparked significant interest and investment inflows, highlighting the growing acceptance and institutional interest in digital assets.\n\nThe success of the Bitcoin ETF has paved the way for further crypto-related financial products, and the market has been keenly awaiting similar developments for other such products.\n\nAD\n\nAD\n\nThe anticipation for Ethereum ETFs has been particularly high, especially following the positive signals from regulatory authorities. The funds received initial approval in late May, but will not start trading until funds’ S-1 registration forms are approved.\n\nSEC Chairman Gary Gensler on Thursday indicated that the approval process for Ethereum ETFs might be completed by the end of the summer.\n\n“Individual issuers are still working through the registration process that's working smoothly, and I envision sometime over the course of the summer,” Gensler said during a Senate hearing Thursday.\n\nTradFi butts in\n\nDespite the added mainstream attention coming with ETFs, Quigley expressed dissatisfaction with the increasing involvement of traditional finance in the crypto space.\n\n\"I was happy with crypto without Wall Street,” he said. “Would it be smaller? Of course. But I didn't feel the need to keep growing the size of crypto now.”\n\nHe warned that Wall Street's aggressive marketing of crypto products could lead to significant risks, especially if institutional investors pull out during market downturns.\n\nDespite his reservations about Wall Street's involvement, Quigley acknowledged that a significant capital influx is essential for substantial market growth.\n\n\"If you want a massive amount of capital, then yes, you have to do things like ETFs,\" he conceded.\n\nAD\n\nAD\n\nWhile ETF hype was partially credited with Bitcoin hitting a new all-time high price above $73,700 in March, alongside anticipation for April’s quadrennial halving event, BTC has yet to seriously challenge that mark again in the months since—and is down this week at a current price of just under $67,000.\n\nBut Bitcoin’s price typically climbs six months or more after the halving, which constrains the expanding supply, as the impacts of that event start to be felt. Quigley believes that historical patterns will continue along that path as well.\n\n\"It can't go higher because it's not the right time,\" he said, predicting a significant price increase ahead.\n\nEdited by Andrew Hayward"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE9ReGFPQno5Wnp5bFJOUzYzeV9GYWdiOUpoZ1JBUXE1VUhLUHlCQVVsMWhhazZURGJ1dkRRRExfWHpRZ0R5a2M2cXkxOFU4VmNzTlhHZlEyRVA1cHg4SkdOTGZ1YXZFUmx0MktaZFdMdGJFX3M0UTkyTnZnTFVOdEE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 16 Jun 2024 07:00:00 GMT",
        "title": "Is Ethereum a Millionaire Maker? - The Motley Fool",
        "content": "Ethereum still has upside potential. But does it have enough to make you a millionaire?\n\nThere's no denying that Ethereum (ETH -4.16%) has been one of the best crypto investments of the past decade. At its current price of $3,500, Ethereum is up more than 10,000-fold from its initial price of just $0.31. As a result, an investment of just $100 in 2015 would have likely been enough to make you a crypto millionaire today.\n\nBut we're moving into Ethereum's second decade now, and it's no longer a slam-dunk certainty that you can become a crypto millionaire by investing at today's prices. If you are thinking about investing in it for that purpose, here are three important questions to ask yourself.\n\n1. Does Ethereum still have 1,000x upside?\n\nLet's assume for a moment that you have $1,000 to invest in Ethereum right now. For that initial investment to grow to $1 million, it would need to increase in value 1,000-fold. A decade ago, that was certainly possible. But what about today?\n\nRemember: In 2015, Ethereum had the all-important first-mover advantage. It was literally the first smart-contract blockchain platform, and that opened up all kinds of new opportunities that even Bitcoin (BTC -2.10%) couldn't match.\n\nSo Ethereum went on to create, define, and control entire sectors of the blockchain world. From decentralized finance (DeFi) to blockchain gaming and non-fungible tokens (NFTs), it was not just the first to market. It was also best to market.\n\nUnfortunately, Ethereum no longer has the first-mover advantage. There are plenty of new challengers, and plenty of blockchains that can offer exactly what it can offer, if not more. So it only makes sense that the explosive growth that characterized the early years of Ethereum might no longer be possible. That's bad news if you're expecting 1,000x upside.\n\n2. How long can Ethereum remain the market leader?\n\nThere are now three direct Ethereum challengers -- Solana (SOL -4.76%), Avalanche (AVAX -6.54%), and Cardano (ADA -4.85%) -- that rank among the top 15 cryptocurrencies in market cap.\n\nThe appearance of these new challengers means that Ethereum's dominant market share in the various niches is slowly being eroded. So even if it is able to create entirely new blockchain niches (as it has for the past decade), the share of the market it will capture will likely continue to shrink over time.\n\nOf even more concern, some of these blockchain rivals are being viewed by investors as potential \"Ethereum killers.\" This poses a clear existential threat.\n\nWhen it comes to choosing blockchains, users and developers have a choice. And if the new Ethereum rivals continue to claim much higher speeds, enhanced throughput capacity, and lower fees, which blockchains do you think users are going to choose?\n\n3. What will be the effect of the new ETFs?\n\nLastly, there's the question of just how much of a lift the new spot Ethereum exchange-traded funds (ETFs) are going to provide. Just about everyone agrees that there was much more demand and hype for the new spot Bitcoin ETFs.\n\nThe spot Bitcoin ETFs have pulled in more than $30 billion in customer funds. However, JPMorgan Chase thinks that the new spot Ethereum ETFs will pull in only $3 billion.\n\nAs a result, the spot Ethereum ETFs are likely to be much less impactful than many people think. If you're expecting the price of the crypto to soar as soon as these new ETFs start trading, you might be disappointed.\n\nSetting realistic expectations\n\nThis might be tough to acknowledge, but Ethereum might only have 10x upside over the foreseeable future. And even that could be too optimistic. Given its current market cap of just over $400 billion, a 10-fold increase in value would imply a new market cap of $4 trillion. That's significantly more than Nvidia, which now has a lofty $3 trillion market value.\n\nA $4 trillion valuation might have been possible back when Ethereum had a clear economic moat to keep away potential challengers. But the barbarians are now at the gate, and some of them are crossing the drawbridge.\n\nFor that reason, I'm unconvinced that Ethereum is still a millionaire maker. Unfortunately, if you are really serious about becoming a millionaire, you might need to find \"the next Ethereum\" -- an undiscovered crypto with 1,000x upside that you can buy for mere pennies. And that, as we all know, is a lot harder to do than it sounds."
    }
]