[
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiY0FVX3lxTE9SOE5mcjEyQmstRDBCbUhDdnRPU1RnZ0ppbS1YMTJpUWhPeW5TQUoyazRZUjRyNi1NYTRFNzg3TmJYUll4anFscTBaNXpCVk12eFN6dkIwR1EyZVRIc3c0ZzBiMNIBaEFVX3lxTE1kSmxHdlFoNkdmbFJDRUgwMFc0WXdBTXg2amhvczBqR2tqYk5RTjd0N1RvdHdaaDUtSlFjbG9pTXVyNGY5U2lLR2ViVks3ME5sdi1rY0hCRFlaWExId3p0SEJEVzZUNF8z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 15 Feb 2024 08:00:00 GMT",
        "title": "Tim Beiko Shares Key Ethereum Updates - U.Today",
        "content": "Advertisement\n\nTim Beiko, a prominent figure within the Ethereum ecosystem, took to X to relay significant updates from the latest All Core Devs Execution (ACDE) call, focusing on the progress of various Ethereum Improvement Proposals (EIPs).\n\nAmong the discussed topics, EIP-2935 stood out, gaining renewed interest thanks to the potential integration of Verkle trees.\n\nThese social media updates offered a glimpse into the Ethereum community's ongoing efforts to enhance the network's efficiency and security, particularly highlighting the strides being made toward improving stateless client support and refining the execution layer (EL) state transition function.\n\nStateless client support\n\nBeiko's posts detailed the discussions around EIP-2935, aimed at improving the verification process of historical block hashes to bolster stateless clients' operational trustworthiness.\n\nAdvertisement\n\nThis proposal, along with its adjustments to accommodate the latest fork activation schemes and the Verkle roadmap, represents a crucial step towards reducing the network's trust assumptions.\n\nMoreover, the community's exploration of adopting an architecture similar to EIP-4788, which employs a ring buffer for historical data storage, demonstrates a proactive approach to resolving technical challenges and enhancing Ethereum's foundational infrastructure.\n\nFuture outlook and security concerns\n\nThrough his X thread, Beiko also brought to light concerns regarding potential exploits that could arise from the use of contracts designed to overload the network with computational demands.\n\nThis issue, particularly relevant with the shift to more compute-intensive Verkle hashing, reflects a broader challenge that the Ethereum team is committed to investigating further.\n\nIn addition, the discussion extended to other pivotal EIPs, such as the PAY opcode (EIP-5920) and the reduction in the cost of transient storage (EIP-7609), which collectively aim to streamline transaction processes and fine-tune resource pricing for enhanced network performance."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxOZi13d2dBdUZCNHBSRmlBWi0xWEFtV1R4MDRQLW15bzdmSGNtVHZ6cFg2TkJPaFBYQTBmd1hiUmNLZzU4XzZOTkI1cXRKZHRwV21ZNHNQek9PNUtGdE44RFRNd3NzVlAwZ2VIQ3JZZzhvSmJCbmhpTkRjd2g0b3dhTtIBiAFBVV95cUxQZ1hDc21ROXlBTDBRWlE0ckpKZ1FHdVNuOEZFYjQ1Q0dQNkdBZzYzZi1rdmVBMlAyZjd1M0dCanhUV3FDSTRqVFM3TWdDZWwzWXZvRVpDemhVNGdaWHUzTEQ1b2ZlZmk5MHFHVTFwUWFMbkNaNWRwS2tWRHFXYXpNYWlQb2t4T280?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 15 Feb 2024 08:00:00 GMT",
        "title": "Ronin Price Pops After Ethereum Gaming Network Reveals RON Rewards Halving - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nRonin, a Ethereum sidechain designed for blockchain games, announced Thursday that it will reduce RON token rewards paid to liquidity providers on its Katana decentralized exchange (DEX) starting in March.\n\nSky Mavis, the company behind the network and its flagship game Axie Infinity, said that it plans to cut liquidity pool token emissions in multiple waves, slashing the daily token rewards by approximately 50% each time. Doing so will reduce the number of tokens being added to the circulating supply on a daily basis.\n\nThe network said that the average annual percentage rate (APR) for providing liquidity has jumped from around 20% to 70% in recent months. However, the amount of tokens pooled has not grown proportionally to match the increase in rewards.\n\n\"This means the increase in reward value did not drive meaningful outcomes in DEX liquidity provision, and may have gone past the optimal level of incentives,\" the announcement said.\n\nAD\n\nAD\n\nAs a result, rewards will be reduced in phases. The first phase, planned for March 1, will cut emissions by over 60,000 RON per day, or around 5.4 million RON per quarter. At the current price, that’s a cut of more than $174,000 worth per day or $15.6 million worth each quarter.\n\nAdditional phases will continue reducing rewards over the course of 2024. The reduction aims to curb \"over-incentivization\" of liquidity providers and lead to better equilibrium for token prices, according to the network. It will also free up more of the RON token supply for other initiatives that could drive user growth.\n\nThe market reacted positively to the news, as the price of RON jumped shortly after the announcement, according to data from CoinGecko. Ronin is up 7% on the day to a current price of $2.90, pushing the token’s 30-day gains to 56%. RON was just listed on major crypto exchange Binance earlier this month, which was cited as one of the reasons behind this rewards cut.\n\nThe network has seen a dramatic rise in active users over the last few months after the blockchain-based farming game Pixels migrated over from Polygon in October. Pixels will launch its own PIXEL token on February 19 after running a play-to-airdrop campaign.\n\nAD\n\nAD\n\nEditor’s note: This article was written with the assistance of AI. Edited and fact-checked by Andrew Hayward."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxOeXJ5dFJVdXJjbzNqelhRNmlUN3pWeUhKYmh4Q1BLLUVxRFB3Z3VNMTI0eTFIU1lHZ2diaTZVT1VheTRTTEk2amFxbTNZaDVJbEdyZkkyUkhhUWktZ1ZKS0hlMy1QV1h0V2txMUh1TDAyVVczM0RNUGVxM2tYZGIySTd5ZzlQOU1JRDQ1T1M2dUc0dDhWU19QQ2FzQzFCQnFpQzN6VHZuWnJLTTZLYi12eW53?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 15 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Price Heads to $3k as Staking Deposits Hit $85 Billion - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxQc0ZtQjFCR2R6M1QzcmtUbFppNWdQa2pfcnkxZW1USEdpTW0tTFZib0lIRGdjOHNOU1pPOUZJXzdtVHVpa3JtTnkzNHItVkRENFF6MTBQVjAzaV83UXcxWlZZbnFkeFNCOFM4bFJNUFluUGhPYXd3YzhyaExMR3FUNjVmTTZxSDhlTFZrM1FIWEJxNUlLUFVWTXRRQW9lQWxrc1Vwcg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 15 Feb 2024 08:00:00 GMT",
        "title": "Ethereum’s Queue for New Validators Is 51 Times Longer Than Its Exit Queue - Unchained",
        "content": "Almost 8,300 validators each with 32 ETH are currently waiting in line to begin staking, while 161 validators are trying to exit, a sign of continued interest in restaking.\n\nThe number of Ethereum validators waiting to enter the network is at its highest mark since the start of October.\n\nThe queue for validators to start securing the Ethereum network is significantly longer than the line for validators to relinquish their responsibilities of confirming blocks, a sign of interest in restaking, the practice of re-using ether (ETH) already securing the base layer of Ethereum in additional ways. The more validators that are securing the Ethereum blockchain, the more ETH is available to be restaked.\n\nThe enter queue is 51 times bigger than the exit queue at press time, according to data provided by blockchain explorer beaconcha.in. Nearly 8,300 validators each with 32 ETH are currently waiting in line to begin staking, while 161 validators are trying to exit.\n\nThe validator queue is a mechanism aimed at stabilizing Ethereum’s proof-of-stake consensus. If validators didn’t have to wait, a huge and sudden influx of ETH could either enter or exit, causing an abrupt change in the security system for the second-largest blockchain by market capitalization.\n\nThe number of validators waiting to enter the network is at its highest mark since the start of October. At press time, the number of active validators – those currently securing the Ethereum blockchain and not waiting in the queue – exceeds 943,000.\n\n“The validator queue started to increase in the beginning of Feb, while the ETH staking yield is still below 4%. This [increase] coincides with EigenLayer’s staking cap raise on 2/5,” wrote Kelly Ye, portfolio manager at Decentral Park Capital, in a Telegram message to Unchained.\n\nARVE Error: src mismatch\n\nprovider: youtube\n\nurl: https://www.youtube.com/watch?v=PxsVKw7SdAs&t=7s\n\n\n\nsrc: https://www.youtube-nocookie.com/embed/PxsVKw7SdAs?start=7&feature=oembed\n\nsrc mod: https://www.youtube-nocookie.com/embed/PxsVKw7SdAs?start=7\n\nsrc gen: https://www.youtube-nocookie.com/embed/PxsVKw7SdAs\n\n\n\nError: src mismatch\n\nMore ETH Available to Be Restaked\n\nWith 32 ETH each, the roughly 8,300 validators will bring in about $746.3 million in total to secure Ethereum. Consequently, this also means that more ETH is available to be restaked.\n\nEigen Layer, the protocol widely known for its restaking technique that extends Ethereum’s security to additional applications and networks, has been a popular destination for crypto denizens’ liquid staking tokens (LST).\n\nPeople have been able to deposit their LSTs into EigenLayer, but the team placed caps on each LST pool. The team has temporarily lifted caps on the number of LSTs people can deposit into the protocol several times. The latest cap raise occurred on Feb. 5, which saw the value locked in EigenLayer’s smart contracts more than triple from $2.156 billion to nearly $7.034 billion in 10 days, data from DefiLlama shows.\n\nAs the number of validators entering the population outpaces those leaving, the rewards per validator will continue to shrink. Ethereum staking APR started at above 5% in June 2023 and has since decreased 129 basis points to nearly 3.8% at press time, according to data provided by beaconcha.in.\n\nHowever, Decentral’s Ye noted that “we expect ETH staking interest to continue to grow as the staking theme continues to grow. ETH currently has about 32.5% staked, which is still lower than other big [proof-of-stake] chains.”\n\nThe price of ETH, the native cryptocurrency for Ethereum, has increased 3.2% in the past 24 hours and 17.5% over the past seven days to trade at $2,851, data from CoinGecko shows."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxPc0k5NjZZOHhJZXF6QnVyRUs5RkhyWlRUaXVmMHFLWGdXd2YwSUNDczBmbUFERW1kZlRxMlV2QzlNNDFURjhSNEhqOE1kTWNZOXF0clJLbk9UejZ6WFhkOWNTQ01kV3E4TEJ1dUFFMDJxRW9fY21lOFV5VUtfTlNkUkZOSjROMVdiUlBFN2pLTi1qcGvSAZgBQVVfeXFMTXg2Y1F2UmROWTBrODc5NDJ6MDhYd0x0bkR4aUdJVnVEMC1KREdzNWFFN01vNXQ4bVNHdGJsbzR6VVpiTkFnOVhnREpaUGF3NzJGM3ViN0d2azBLRlpSeXl3NVBncHJJQTNUM2x0NTd5WS1oV0R5QmlBWDc2aFF5Q2NRQ3FCMmtUcVVsUF9FOThFdDFfbmNLOUM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 15 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Price Prediction As ETH Tops $2,800, A Rally To $4,000 In The Making? - CoinGape",
        "content": "Ethereum price is rallying at an impressive rate alongside its peer Bitcoin, which almost touched $53,000 on Thursday. Investors seem to be spoilt for choice, especially with altcoins making incredible strides. As discussed earlier today, investors are likely to start redistributing capital from Bitcoin profits into altcoins, propping tokens like ETH for a larger breakout targeting $4,000 in Q1.\n\nEthereum Price Prediction: A Rally In The Making\n\nEthereum price bullish outlook comes amid impressive performance of Bitcoin ETFs which achieved a humongous cumulative net inflow of $4 billion on February 1.\n\nadvertisement\n\nInvestors perceive this surge as validation of Bitcoin and crypto from traditional investors. ETFs allow institutions to seek exposure to BTC without dealing with the complexities associated with navigating exchanges, owning physical digital and assets which require special custody services.\n\nAway from the BTC ETF, Ethereum is poised for a larger breakout due to the upcoming Dencun upgrade. All three testnet launches have been completed implying that developers will be announcing the final dates for the mainnet debut before the end of Q1.\n\nOptimism for a spot Ethereum ETF has also started to build. Following the approval of BTC ETFs, speculators turned to Ethereum as the next-in-line digital asset.\n\nThe approval of an Ether ETF, although a long shot at the moment, considering the hawkish stance of regulators in the US on whether Ethereum is a security or not, is expected to drive prices higher as witnessed with Bitcoin.\n\nAmid these expectations and potential market mover factors, Ethereum seeks a breakout above $2,800 to extend the leg to $3,000 and subsequently to $3,600 before the end of February.\n\nFor starters, the Moving Average Convergence Divergence (MACD) indicator backs the uptrend, displaying a buy signal and green histograms above the neutral area.\n\nIf interest in ETH continues this week, holding above $2,800 would signal confidence in the uptrend and possibly ignite FOMO among investors as they speculate on further price increases this week.\n\nSupport is expected at $2,700 on the downside. However, if profit-taking destabilises Ethereum price, traders may want to consider $2,500 and $2,200 as key support areas.\n\nBlockchain data by IntoTheBlock reveals that over 7.8 million Ethereum addresses are currently in profit, while 5.45 million addresses deal with unrealized losses.\n\nThe largest support area stands out at $2,365 — the average price at which 1.72 million wallets purchased slightly over 5 million ETH. Based on the chart below, Ethereum price has a higher chance of rallying to higher levels above $3,000 as opposed to dropping to January’s support at $2,200.\n\nThat said, Ethereum could still be a steal if bought at the current market value. In case of dips to lower support areas, consider a dollar-cost average strategy to make the most out of the sublime bullish outlook.\n\nRelated Articles\n\nJohn Isige John is a seasoned crypto expert, renowned for his in-depth analysis and accurate price predictions in the digital asset market. As the Price Prediction Editor for Market Content at CoinGape Media, he is dedicated to delivering valuable insights on price trends and market forecasts. With his extensive experience in the crypto sphere, John has honed his skills in understanding on-chain data analytics, Non-Fungible Tokens (NFTs), Decentralized Finance (DeFi), Centralized Finance (CeFi), and the dynamic metaverse landscape. Through his steadfast reporting, John keeps his audience informed and equipped to navigate the ever-changing crypto market.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    }
]