[
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTE5TbUNwdFZkbWxNOEgwUEN2RUtTOFJ2RWxvYVI5OF8zWGhXNG9Ea1hQYjN1eXZnV1lkV2w0T1BhWjZKTkVFY2lGVS0wTW5ZSVlIZ1A5RzVSOVRsRTdzT1d6Z1ppaU1KckZ3UG9qRFh3SFQ5X1U30gF6QVVfeXFMTzlaVUp5SEc0UE5yQm9OTzBpbDlpX3hqVjBOaTJjMXQtVVNTTnl4UVdlTVppakc1RUFjeVg1OWRXMkJPNUxnNGtYRm9objZLZTdreEFtRkFnODlWS1Bzb3pkUUtQSnZVems3akFYTkU4NmcxQnc3QlFZUWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Mar 2024 08:00:00 GMT",
        "title": "Ethereum ETF in 2024? Top Crypto Lawyer Pessimistic - U.Today",
        "content": "The U.S. watchdog SEC received too many \"political blowbacks\" after having Bitcoin spot ETFs approved in the United States, seasoned legal expert says. As such, the most anticipated event for Ethereum (ETH) investors might be months away.\n\nAdvertisement\n\n\"Political priorities\" can prevent ETH ETF from being green-lit in 2024\n\nThe U.S. SEC is unlikely to approve exchange-traded funds based on spot Ether (ETH) in 2024, Variant's Jake Chervinsky says. This sad outcome is caused by political reasons that put the SEC leadership under pressure.\n\nI am a lot less confident about ETH ETF approval this year than many of you are.\n\n\n\nThe SEC got a ton of political blowback for approving BTC ETFs, even though the court basically forced it to.\n\n\n\nNow animal spirits are in control of the market, and an ETH ETF would only add to that. — Jake Chervinsky (@jchervinsky) March 1, 2024\n\nEven though the U.S. court basically forced the SEC to authorize the Bitcoin spot ETFs launch in January 2023, the regulator received strong \"political blowback,\" Chervinsky added.\n\nIn this situation, the BTC ETFs approval is the fruit of collaboration between the SEC and ETFs applications, especially BlackRock.\n\nAs such, they will do their utmost to avoid conflict with the SEC and, most likely, will withdraw all ETH ETF applications should the SEC ask them to do so.\n\nThe context becomes even more hostile for Ether ETF given the fact that \"animal spirits\" took full control over the markets now.\n\n\"When, not if\" approach still valid\n\nSince the approval of Bitcoin ETFs, Ethereum (ETH), the second largest cryptocurrency, added over 30% in price. Last week, it peaked over $3,500.\n\nHowever, Chervinsky is sure that ETH ETFs will be approved sooner or later:\n\n“When, not if” seems like a very reasonable take to me\n\nAs covered by U.Today previously, Bloomberg's James Seyffart announced that he did not expect Ether ETF to go live in March 2024."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxQaGcyaV8wS3JVc3VyLUswNnE0U3RCU1RORXpZakpBSVc5N0hXX3NZeklWa2tSX0J2WFYteDVwMG5OYkxZOVRsSlItRnY3dkFKSkN3YXFhUmdHQnkyaDVtVjFfTk1PTURVUG5yNHFqaEdaZWlIUWl6cEpRNU1kb1RDODdaSmdnRGFMdF82blJqUWFTd9IBlwFBVV95cUxQeGM4MW1EbFNxWFZsUlB6Q3BlVTNobEhHQ2VVOEV6QU1tcjFFbEdrSnBFelpzTUtDYW9GWHFSRWhUcXdJMENhZDRERW8yaXJGRjNIdEsxWU1xYk5waldISU81cFQ2cmFvWVZicDM4TGhJUy1Mc19PaFlsR0xGS3hBRHNtMEl4N3VUTXRsUEVXekgzN0dBMmVB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Mar 2024 08:00:00 GMT",
        "title": "Ethereum (ETH) Deposits to Be Suspended on Major Crypto Exchange, Here’s Why - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nBinance, the world's largest cryptocurrency exchange, has announced that it will temporarily suspend deposits and withdrawals of Ethereum and ERC20 tokens on the ETH network.\n\nAdvertisement\n\nThe reason for this suspension is to perform wallet maintenance for the Ethereum network, which is expected to last for about two hours.\n\nBinance will perform wallet maintenance for the Ethereum network (ETH) on March 6, 2024, at 7:00 a.m. (UTC). In this light, deposits and withdrawals on the Ethereum network (ETH) will be suspended starting on March 6, 2024, at 6:55 a.m. (UTC).\n\n#Binance will perform wallet maintenance for the Ethereum network $ETH starting from March 6, 07:00am UTC.\n\n\n\nThe maintenance will take approximately 2 hours.\n\n\n\nDeposits and withdrawals will reopen once maintenance is completed.https://t.co/by67qwpvy3 — Binance (@binance) March 1, 2024\n\nThe exchange stated that the trading of digital assets and currencies on the Ethereum network (ETH) will not be impacted during wallet maintenance.\n\nBinance says it will reopen deposits and withdrawals after the maintenance is complete but may not notify users in a further announcement.\n\nETH network Dencun upgrade approaches\n\nBinance's wallet maintenance for the Ethereum network comes a week ahead of the much-anticipated Dencun mainnet upgrade scheduled for March 13.\n\nThe Dencun network update has been successfully activated across all testnets. It is currently ready for deployment on the Ethereum mainnet and will go live on the network at epoch 269568, which occurs on March 13, 2024, at 1:55 p.m. UTC.\n\nThe upgrade, which follows last year's Shapella upgrade, features several changes, the most notable of which is the implementation of ephemeral data blobs with EIP-4844, better known as \"protodanksharding,\" which will help cut L2 transaction fees.\n\nThis marks a historic moment for the ETH network as proto-danksharding will finally go live on the mainnet after two years since its ETH Denver inception, dozens of testing calls and devnets.\n\nAt the time of writing, ETH was down 1.7% in the last 24 hours to $3,413. Ethereum has risen 16% over the last seven days, mirroring Bitcoin’s 21% growth over the same period."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMi0AFBVV95cUxNY1JkeFp6MVJvSzVLcWFVM0pnQXk1REVpeV82czYtUFQwVktlWUItOFlYaUpwVmJ2VERMM0FySENLWjBUVHl1ZnlUUWZCeGNnMWJ3eUJnZUNSbEpsdmVXLXJ3WGh1S0NKZWNoXzlPMzNGWHN2MkhHTzdsd29OY0k3Rk9rbVk1NDljX1BDMFd5ZkhhS0tyNXE2S1hGbmc4dlBYWWFVS2NhYk9sdUt0bzQ5RG1vTWdleTNRVHFJb092eklBVFVHelFyRW51VDRiVjlh?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Mar 2024 08:00:00 GMT",
        "title": "Blast Layer 2 on the Ethereum blockchain: the official launch of the mainnet unleashes excitement - The Cryptonomist",
        "content": "Blockchain news: the official mainnet of the Ethereum Layer 2 Blast chain has recently been released, allowing users to withdraw their funds.\n\nSo far, more than 180,000 early access users have already deposited a total value of over 2.3 billion dollars on the protocol platform. Let’s see all the details below.\n\nThe future of Ethereum’s blockchain: Blast Layer 2 mainnet promises significant benefits\n\nAs anticipated, the mainnet of the Ethereum Layer 2 Blast blockchain network was launched on Thursday, offering users the possibility to withdraw their funds.\n\nAccording to the dashboard of Dune Analytics, the platform hosts significant assets, including approximately 469,000 ETH, 77.3 million USDC, 67.1 million USDT, 148,000 stETH, and 24.7 million DAI.\n\nWith the live mainnet, users can now easily make withdrawals. The mind behind Blast is Tieshun Roquerre, the founder of the NFT marketplace Blur.\n\nThe platform’s goal is to provide a native yield model for both Ether and stablecoins, offering a 4% interest for the former and 5% for the latter.\n\nEarly access to the platform has attracted over 180,000 members of the community, helping to reach a total value locked (TVL) of over 2.3 billion dollars, according to the official website.\n\nBefore the mainnet launch, users noticed the emergence of an unofficial bridge to the platform, drawing parallels with the event prior to the launch of Coinbase’s Base Layer 2 in early August 2023.\n\nArnold Toh, blockchain research analyst at The Block, highlighted that Blast has already accumulated over $2 billion in TVL before the official launch. In particular, positioning itself as a significant presence alongside Layer 2 giants like Arbitrum One and OP Mainnet.\n\nThe analyst predicts significant interest and speculation with the official launch, as well as the possibility of a future airdrop.\n\nBlast: potential success, the mainnet and promising returns\n\nThe early access to Blast started towards the end of November 2023, offering users the opportunity to earn returns through bridging and Blast Points.\n\nOr a form of reward for linking assets to other networks and for referring users to the platform.\n\nThe philosophy of Blast is based on market efficiency, emphasizing that liquidity flows towards higher returns.\n\nAs stated by the social media platform, on Blast, the balance is automatically composed, offering users the opportunity to earn Blast rewards.\n\nHowever, some voices have raised doubts about the platform model, suggesting similarities with a Ponzi scheme, especially since rewards were not withdrawable until the mainnet launch.\n\nHowever, Tieshun Roquerre, also known as Pacman, has rejected such claims, arguing that the performance is sustainable and derived from the liquid staking protocols of Lido and MakerDAO’s DeFi.\n\nThe success of Blast was evident with a fundraising of 20 million dollars in November 2023, led by venture companies Paradigm and Standard Crypto. The possibility to redeem Blast points is initially scheduled for May 24th.\n\nEthereum lays the groundwork for “The Surge” with the anticipated Dencun update\n\nAs we know, Ethereum’s roadmap envisions a revolutionary era with the introduction of the Dencun update, paving the way for layer two rollups to achieve large-scale scalability.\n\nThis fundamental step promises to improve transaction speed, reduce gas fees, and enhance overall network performance.\n\nPositioning Ethereum as the main blockchain platform for decentralized apps and smart contracts.\n\nThe recent bullish trend of Ethereum, with the price reaching $3,230 on February 26, is a reflection of the market’s optimism towards the Dencun upgrade.\n\nInvestors and traders are showing increasing confidence in the long-term prospects of Ethereum, intensifying buying activity and pushing the price to new highs.\n\nThis rally underlines the importance of the Dencun update and the expected positive transformation of the Ethereum ecosystem.\n\nThe Ethereum community is eagerly awaiting the Dencun update, anticipating a significant improvement in the functionality and efficiency of the network.\n\nSpecifically, the community is hoping for faster transactions, greater scalability, and lower gas fees, considering this upgrade as a crucial initial step in addressing persistent challenges and realizing the full potential of Ethereum.\n\nThe enthusiasm in the community expresses confidence in Ethereum’s ability to grow and adapt to the evolving needs of its vast user base, with the hope of a better user experience and smoother operation of decentralized applications."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNUk9rdmRrUTdlQXpTNG95ejBIbHJ1bnVSazZRbDdtTVV6b0RhRE80RDRHcTR3Umx2a3U2WVlZYzFvWUxPdnRDQXFUZjM1V1Z1THdVcVRpRFdyenAwYUU1SUZjbFdtUk5aS2xLajUtRTNYQ2xIN292enU5Zi0tT0xXMkVlNHhZMWVpNG9BMWhEcEZ4aGZyQU5oMw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Mar 2024 08:00:00 GMT",
        "title": "Ethereum’s Dencun Upgrade Can’t Come Soon Enough as Gas Fees Surge - Unchained",
        "content": "Ethereum users say they are spending upwards of $100 on gas fees for swaps and NFTs during peak times. The upcoming Dencun upgrade will lower fees, but there is a caveat.\n\nEthereum users are struggling with high gas fees as usage increases on the network.\n\nBitcoin’s renaissance\n\nand a\n\nspectacular rally\n\nin cryptocurrency prices is making life difficult for users of the Ethereum network.\n\nAs user demand and interest in both bitcoin (BTC) and ether (ETH) surges—on the back of the approval of spot bitcoin ETFs in the US and the potential approval of spot ether ETFs — gas prices on Ethereum are spiraling out of control.\n\nAt peak times, users are reporting paying over $100 in transaction fees for swaps, which is the exchange of one crypto token for another on the network. The average gas fee for a swap transaction is currently around $79, according to data from Etherscan.\n\nGas prices for swaps back above $100 lmao — Pentoshi 🐧 euroPeng 🇪🇺 (@Pentosh1) February 28, 2024\n\nThe “top gas guzzlers” are decentralized exchange Uniswap and Blast, an Ethereum layer 2 network that launched on mainnet yesterday. Respectively, they’ve earned $2.5 million and $1.4 million in fees within the last 24 hours, per Etherscan data.\n\n400 fucking dollars to migrate .1 ETH to Blast mainnet. It's so over. Pack it up. Ethereum is unusable today. pic.twitter.com/hZRrwRAMlz — Pop Punk (@PopPunkOnChain) February 29, 2024\n\nThe high transaction fees once again draw attention to Ethereum’s scaling challenges and how difficult it can be to onboard new users to the network during times of increased interest.\n\nEthereum is not blind to these issues, which continue to reoccur in bull market cycles. Ethereum has an ambitious multi-year roadmap to reduce transaction fees, increase security, and future proof the network.\n\nRead more: An Overview of Ethereum Scaling\n\n“Ethereum is trying to learn from this mistake of pricing away marginal users to other, cheaper chains,” said Luke Nolan, Ethereum research associate at digital asset investment manager CoinShares. “The proposed and implemented solution is to scale through layer 2 solutions, mostly rollups.”\n\nTwo key upgrades from the roadmap have already been implemented including “The Merge,” which was Ethereum’s transition to the proof-of-stake consensus mechanism, and the “Shapella” upgrade, which enabled the release of staked ether withdrawals. The next major upgrade is Dencun, which is scheduled for March 13.\n\nRead more: What Is the Cancun-Deneb (Dencun) Update on Ethereum?\n\nOne of the key introductions in the Dencun upgrade is a new transaction type called “blobs.” Ethereum layer 2 rollups currently post data to Ethereum using calldata. This is costly and makes up around 90% of the gas fees that rollups pay to post bundled transactions to the network. After Dencun, layer 2s will post the data to blobs, which are highly optimized and are much cheaper than calldata.\n\n“Overall, yes fees will reduce on Ethereum, but only for layer 2s,” Nolan said. “The general hope here is that layer 2s will become sophisticated enough over time, with seamless UX, high speed and low transaction costs … In this end state, Ethereum can compete with any new fast chain that comes out of the box because layer 1 continues to be the secure settlement layer, and layer 2 becomes the data availability layer that allows it all to scale to new heights.”\n\nUnder the upgrade, transaction fees on layer 2s will decrease between 10 to 100 times depending on the chain, said Nolan, adding that it could get very close to “Solana-esque transaction fees.”\n\nSolana’s Surge\n\nThis fee reduction couldn’t come soon enough for many users. Many Ethereum users, particularly those who trade NFTs, are talking about moving to Solana, which is a layer 1 blockchain that offers much cheaper transaction fees.\n\nIt costs 52 dollars to purchase a standard ERC-721 off Blur right now. It costs another 20-30 dollars per marketplace you want to list that NFT on. and that's with gwei relatively low (70) by bull market standards ETH does not make sense for the majority of NFT collections. — root (@rootslashbin) February 27, 2024\n\nThe average transaction costs for NFTs on Ethereum is around $140, per Etherscan, which is sometimes more than the cost of the actual NFT being traded. While on Solana, the average cost of a transaction is 0.000036 SOL, which is $0.0047, according to data from Solscan.\n\n“As of the last few months, a lot of attention has shifted to Solana NFTs, which has certainly taken some of Ethereum’s market share,” said Nolan, adding that Ethereum NFT trading is not back to the same transaction volume levels as last year.\n\nMost activity on Ethereum is centering around collections with high floor prices such as Bored Ape Yacht Club and Moonbirds, Nolan said. They have floor prices of $75,000 and $4,000 respectively. In these scenarios, a trader is unlikely to be phased by a $100 transaction fee.\n\nDaily NFT trade volume on Ethereum in millions (CoinShares)\n\n“Whilst on Solana I would venture to say that the activity for smaller collections (as well as big ones) has been picking up because transaction fees are 100x smaller on average and so the smaller value accounts have logically flocked over there,” Nolan said. “It has made for a much more enjoyable speculative playground for participants.”\n\nWeekly NFT volume on Solana in millions (CoinShares)\n\nThis is echoed by Anastasia Melachrinos, a DeFi product manager at crypto data firm Kaiko, who notes that new users are generally entering the blockchain ecosystem through centralized exchanges or directly via Solana.\n\n“It is without a doubt that high throughput upgradeable chains like Aptos or Solana will receive most of the non crypto native traffic, which is most of the world in the case mass adoption does take place,” said Sharvin Baindur, chief of staff at investment firm Saison Capital, who focuses on investing and supporting high performance and low cost blockchains.\n\nEven if gas fees on layer 2s are reduced to Solana levels, Nolan notes that Ethereum layer 2s still face challenges around fragmentation and poor user experiences, which can act as a barrier to capturing those smaller value transactions. On the flip side, Ethereum and layer 2s have a strong reputation and a very complete ecosystem, so once the execution cost is fixed the barriers to entry to those chains will be lowered, Melachrinos said."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMibEFVX3lxTFBWN3BiRHp1YkV2UFIwNndvSFZBdXlscnNnc29kQUNXNkdqelR3OXRzcGtOdWNYWW92VnJHSkdJb2F0LWhRMjNBdG5fc2hlRkp1b21YZnQxVk1SMDgxQ2hXVkVVYU4zdEVNNW1RSg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Mar 2024 08:00:00 GMT",
        "title": "The Evolution of Ethereum: Pioneering the Next Wave of Crypto Progress - Crypto Times",
        "content": "Ethereum has been at the forefront of the crypto world ever since its inception in 2013. Its native cryptocurrency, Ether, is the second-largest cryptocurrency in the world, trailing only behind Bitcoin. Ethereum has also been instrumental in mainstreaming several key trends, including decentralized finance (DeFi), non-fungible tokens (NFTs), and the Metaverse. However, Ethereum community says the network is still far away from unleashing its potential and evolving until they reach the top.\n\nThe decentralized blockchain has even found its way into other walks of life, including gaming, art, and fashion thanks to the timely evolution of Ethereum ecosystem through upgradation. Businesses like online casinos are starting to use the platform to facilitate online transactions and payments. This Ethereum casino partnership has boosted the presence, with a popular resource for using Ethereum and we are seeing an overall increase in the market value of the blockchain and its cryptocurrency.\n\nHowever, Ethereum came from a long journey and went through a lot of experiments before reaching the point where it is today. Here is a glimpse of the evolutions of Ethereum that fuel its growth.\n\nUpgrading the System\n\nIn 2022, Ethereum underwent a series of upgrades known collectively as “The Merge,” which successfully transitioned the platform’s consensus mechanism from proof-of-work to proof-of-stake. This transition vastly improved Ethereum’s energy efficiency and security, reducing its energy consumption by 99%. Consequently, Ethereum is expected to gain global traction due to its enhanced focus on environmental and sustainability concerns.\n\nThe platform continuously evolves, adapting to market trends and global values. In the coming years, Ethereum plans to implement an update known as Danksharding. This update focuses on horizontal database scaling, aiming to enhance the management and storage of distributed data and increase the software’s scalability.\n\nAs global attitudes and standards around cryptocurrency evolve, so too will Ethereum. Its versatility and unique adaptability enable it to navigate new trends with ease, maintaining its position at the forefront of the crypto world and cementing its status as a leading cryptocurrency.\n\nInnovations and Expansions\n\nEthereum’s commitment to innovation is clear in its roadmap, which includes several significant upgrades beyond Danksharding. These upgrades are designed to improve the network’s scalability, security, and sustainability, ensuring that Ethereum remains at the forefront of blockchain technology. Many experts believes that such upgrade will play pivotal role in the evolution of Ethereum.\n\nThe introduction of sharding is expected to further decentralize the network, increasing transactions per second and reducing gas fees. This will make the platform more accessible and efficient for users worldwide.\n\nThe Rise of Decentralized Applications (dApps)\n\nEthereum’s ecosystem of decentralized applications (dApps) is one of its most compelling features. These applications utilize Ethereum’s smart contract functionality to offer a wide range of services, from finance to gaming, without the need for traditional intermediaries.\n\nThe expanding dApp market indicates a shift towards a more decentralized internet, with Ethereum leading the way. As the platform becomes more user-friendly and scalable, the adoption of dApps is expected to increase, potentially revolutionizing industries by promoting transparency, efficiency, and trust.\n\nEthereum’s Role in the Financial Ecosystem\n\nThe DeFi sector, primarily built on Ethereum, demonstrates the platform’s ability to reimagine financial services. From lending and borrowing platforms to stablecoins and tokenized assets, Ethereum’s DeFi ecosystem offers permissionless, transparent, and efficient alternatives, challenging the traditional financial sector.\n\nAs the DeFi space matures, it could significantly diminish the market share of conventional financial institutions, positioning Ethereum as the backbone of a new financial paradigm.\n\nAlso Read: How Ethereum Blockchain Is Shaping The Education Sector\n\nSurge In ETH’s Value\n\nOver the coming years, Ether and Ethereum are both set up for positive growth. According to binance, at the time of writing, Ethereum’s price is $3,481.61. Experts predict this to propel upwards to around $40,000 by the end of 2030. While some remain skeptical of this figure, others point to Ethereum’s scalability, uniqueness, and market range as factors that could make it a reality.\n\nBut will Ethereum eventually overtake Bitcoin as the world’s number-one cryptocurrency? The crypto market is highly volatile and fickle, so it is certainly a possibility.\n\nETH has experienced considerably higher levels of growth in recent years, increasing in value by nearly 400% in 2021 compared to Bitcoin’s 66%. And thanks to Ethereum’s unique decentralized blockchain model, many experts believe it has the potential to outperform Bitcoin within the next ten years.\n\nChallenges and Considerations\n\nDespite its promising future, Ethereum faces several challenges. Scalability issues, high transaction fees, and network congestion have been significant obstacles. However, the ongoing upgrades and the shift towards a more sustainable and efficient framework are expected to mitigate these concerns.\n\nFurthermore, regulatory uncertainties and the competitive landscape of blockchain technologies are factors that could influence Ethereum’s future trajectory.\n\nConclusion:\n\nEthereum’s journey is far from over. Its pioneering role in popularizing smart contracts, NFTs, and DeFi has set the stage for a future where blockchain technology is integral to various sectors. With continuous upgrades and increasing adoption of its platform, Ethereum is well-positioned to remain a key player in the cryptocurrency space, potentially challenging Bitcoin’s dominance.\n\nThe amalgamation of technological advancements, community support, and a robust ecosystem renders Ethereum’s future not just promising but stellar, envisioning a landscape where innovation, inclusivity, and efficiency are paramount.\n\nDisclaimer: This is a sponsored post. The Crypto Times does not take any editorial responsibility for the accuracy, quality and fairness of the published content. We advise our readers to always do their own research before engaging with any products mentioned on our website."
    }
]