[
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxNNEEzTjdkeWZOS0ZIeENWdWxhUDZFTTZyQzV2Vnl3dE1UYTVNNkp6cnVXdlBCaEZpeDl4dzJfcXFvbDk5YmQzMEpJSXh4OGFnLTBmMXhnUmtVWGRUTVEtaHgyNWtpZjgxUDhCNWNnU1BxcjgyVGtTVnduQnhBNzM2enZlam5fZXBEQzU0bFFYQnVaRGRETjNybHJB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Jun 2024 07:00:00 GMT",
        "title": "Bloomberg Analyst Updates Spot Ethereum ETF Launch Date - Crypto Times",
        "content": "The anticipated launch of a spot Ethereum ETF is getting closer. According to analyst Eric Balchunas from Bloomberg, the estimated launch date has now been set to July 2, 2024.\n\nThis updated timeline comes after the Securities and Exchange Commission (SEC) staff provided feedback on the applications (called S-1 filings) submitted by companies seeking to launch Ether ETFs. Balchunas reports that the SEC’s comments were relatively minor, requiring only a few changes to be made within a week.\n\nUPDATE: we are moving up our over/under date for the launch of spot Ether ETF to July 2nd, hearing the Staff sent issuers comments on S-1s today, and they're pretty light, nothing major, asking for them back in a week. Decent chance they work to declare them effective the next… https://t.co/XJZ8JLwEFF — Eric Balchunas (@EricBalchunas) June 14, 2024\n\n“Decent chance they work to declare them effective the next week and get it off their plate before the holiday weekend,” Balchunas said, suggesting the SEC wants to finalize the approval process quickly.\n\nThe launch date aligns with SEC Chair Gary Gensler’s recent statement that Ether ETF approvals could happen “by the end of this summer.”\n\nEther ETFs are expected to provide institutional investors with a regulated means of investing in Ethereum, thereby potentially increasing its market activity and affecting its prices.\n\nThis development comes after Bitcoin-based ETFs successfully launched earlier this year and have already begun influencing market trends."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxNYkxITms2eUpadVVVZWdMc1o4TlMtQ25HYktibm1GcXBYNHBSQTFKcGs0UTh3SGZfNUFkWTNPcWhkU0ZncEYzMllBSFkwZ3JGTC1uaVB5S29UTk5jZnZ0Zk1FblBLMUpVX2NCUnR2ZzMwbGxhTGtRSmVuU0xiemwxOEt6UGFnYmZVcUMtdlFNSmgzYjBUZ2hoUjBVa3FSY3hWalJYc2pFTjnSAa4BQVVfeXFMTWl0cWVPU3k1dVJ6aTQ1QjVOaFcwaml0ajhNX25Cd3RMd2JRcGlqZExVQ1EzY2sxMGFSTnFZdk9QZ2M1cDJaLTdDZ3RQU1pZSzlOSWY2ZXJGc1hRRm5IcG1OWV82ck50Y1hnUGxDeEdPLVd0QWpyYm1fOUIwbjFfLWFKOUx0em1xYXV0RGpDbXVKYmx5V0NDQXVob2Q5ZGE5dm16STB3T2JRcVN3N3FB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Jun 2024 07:00:00 GMT",
        "title": "Good News for Ethereum (ETH) ETFs in the US, But With a Catch: Bloomberg’s Balchunas - CryptoPotato",
        "content": "After the US Securities and Exchange Commission made history earlier this year by approving almost a dozen spot Bitcoin ETFs, all eyes in the community turned to the next digital asset in line – Ethereum.\n\nWhile the landscape didn’t look promising at first, it changed several weeks ago when, somewhat surprisingly, the agency greenlighted eight spot Ethereum ETFs. However, the launch date is still unknown.\n\nWhen the spot BTC ETFs were approved by the securities regulator, they went live for trading on the very next day, which caused tons of volatility but has been among the most bullish developments in the industries ever since.\n\nThe situation with the Ether ETFs is quite different. Although they have been technically approved, there are some irregularities with most S-1 filings and the question of whether they will allow staking, which is a major part of the Ethereum ecosystem. This is why the launch date remains a mystery.\n\nAccording to Eric Balchunas, Bloomberg’s ETF expert, there’s some good news on that front, as the Commission’s staff has recently made only minor comments to the S-1 applications.\n\nHe believes there’s a good chance the documentation will be handled within the next ten days or so, so they could “get it off their plate” before the July 4 US holiday. In other words, Balchunas suggested that the Ethereum ETFs could see the light of day by July 2.\n\nNote: our previous over/under was July 4th so this isn’t major shift but 1) we startted to feel like it would take longer so this is kinda good news and b) we basically decide the over/under on where are most torn 50-50 on where to bet and July 2nd is that date right now. — Eric Balchunas (@EricBalchunas) June 14, 2024\n\nRecall that BTC’s price went on a massive rollercoaster in the first few days after the launch of the ETFs. Since then, though, these financial vehicles have attracted billions of dollars and propelled a price surge toward a new all-time high for the underlying asset.\n\nETH also saw impressive gains ahead of the ETF approvals, but there will likely be lots of fluctuations once they go live for trading."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxNV2Q3UExtaWY2X0V3LWhNTmlpRE9LUF82NWszSXRmdS1xS1JicnIwQVlvb3RkUnV3TUhsTk5vMHJiRWY0SnQzUFJaZ3lzNXV0MUZsSk1HRTZOZEJuQkduVDdCVV9EcDlHN0lHSU5Nd2MxME5kMXJrSjJ1ckFXekRKZ2Nn0gGHAUFVX3lxTFAtcHc3MGNTZFFmMEZjMGdPV0l5bFdKVWdXU05GNm1NNENqWXYtd2RPUW9qM1M3QnBwWXZ4dDhOeTFkWXdTOG05MVlraVM1SjBIS1lpcDU1NHExOTV2X1Z2NU12QXg1Rkt4OG9GclQwejRFVXBTV0o5QUVDdjcxLXpzd2FYbWd6cw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Jun 2024 07:00:00 GMT",
        "title": "114 Billion PEPE Trader's Surprising Ethereum Shift; Here's Why - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nIn a dramatic turn of events, a PEPE trader has capitulated, selling all of his 114.7 billion PEPE tokens for 366.5 ETH, worth approximately $1.27 million.\n\nAdvertisement\n\nAccording to Lookonchain, the trader initially purchased the 114.7 billion PEPE tokens on May 14 and May 15 for $0.000011 per token, totaling $1.27 million.\n\nThis entry point seemed promising as the PEPE was gaining traction and attracting considerable interest within the crypto market. PEPE would later surge to all-time highs of $0.00001718 about 14 days later.\n\nThis $PEPE trader capitulated and sold all 114.7B $PEPE for 366.5 $ETH($1.27M) at a breakeven price.\n\n\n\nHe bought 114.7B $PEPE($1.27M) at $0.000011 on May 14 and May 15.\n\n\n\nThe price of $PEPE broke through $0.000017 on May 27, at which time his profit was $670K(+50%), but he did not… pic.twitter.com/aPxuftE1yI — Lookonchain (@lookonchain) June 15, 2024\n\nOn May 27, the price of PEPE surged, breaking through the $0.000017 mark. At this peak, the trader's holdings were valued at $1.94 million, presenting a potential profit of $670,000, or 50% gains. Despite the substantial gain, the trader chose not to sell, possibly holding onto the tokens in anticipation of further price increases, which proved costly.\n\nHowever, the market took an unfavorable turn as PEPE's price began to decline. The downward trend continued, and the value of PEPE fell below the trader's breakeven point of $0.000011.\n\nFacing the sustained drop in PEPE's price, the trader ultimately decided to sell all 114.7 billion tokens. The sale was made at a breakeven price, yielding 366.5 ETH, nearly equivalent to his initial investment of $1.27 million.\n\nAlthough the trader did not incur a financial loss, the missed opportunity for a substantial profit underscores the significance of timing the market perfectly. More often than not, market timing has been found to significantly impact trading outcomes.\n\nAt the time of writing, PEPE had dropped 0.79% in the previous 24 hours to $0.00001204. The frog-themed cryptocurrency has slowly decreased since reaching an all-time high of $0.0000171 on May 27. PEPE struck a low of $0.00001057 in yesterday's trading session as profit-taking continued and the market saw a slump before rebounding rapidly."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMi2wFBVV95cUxOX2tod0liTmk4WFR6OTRiSXRmMDlldjNGanVmajdBU2cwM3p0RXlYeVRUUDRaWEZFSEFNQXA2b2pPdHRVRHduRTVWQWNXbnBEcGwyd3B4ejc2MG41TTZrMWFEbTJ6SjN4VGJGLWN3WmZwWHFkdDQxS1lhdUVvUkw4N2w4bVdNd3lZWmQ5YXg1TEpKYmUxSEo2R1ZRWHJrcFJ0aVFBV245VFZyUUtVLWYyYUx2MlNLYWpLSTNLQmo4NDlIY2g3MGVLRC1TRzdVQnpjejh3ZG1HQXZvcjTSAeABQVVfeXFMTnRWZzRFRnhkcXhnWTJ5VmNqNHZwZjhtT0VHSkhSczhieEZMWVdWekRvUXNycHpibXRSRkY0NVB0V2l2UXM1emp4clZGeWJjU1FycGd1T1NtYWNyQTd3bC1MN05FZFd5WXJsNXRudWNPN2lITGlZZ0xRc0EzZjV4VkJaWDJ5N3JiZHNQZlBfMjg3S29Id1JKVXgzNkl5eGNpcDljZTc0VERwY203YjhlR2hCMFg4VTU4Q1d3Ym54UzE3dmdTUnhxM3VvYVlEV2wxU2stYmV6ektQNF9RbHdYd1A?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Jun 2024 07:00:00 GMT",
        "title": "Ethereum's Tailwind: How the SEC ETF approval boosted Memecoin mania - The Economic Times",
        "content": "Why the Ethereum ETF Effect?\n\nA Look at Key Ethereum Memecoins\n\nLong-Term Impact: A Speculative Future\n\n\n\nInstitutional Interest: A Long Road?\n\n\n\nMemecoins: Flavour of the season\n\nConclusion\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nThe Bitcoin ETF, particularly BlackRock 's IBIT, has been the fastest-growing ETF to date, reaching $20 billion in just 137 days. In comparison, the next closest, JEPI, took nearly 1,000 days to achieve the same milestone. Now that the money men have tasted blood, and Ethereum spot ETFs to be listed, there are some interesting developments in the crypto market.While the primary impact is directly on Ethereum, there's been a fascinating secondary effect – a surge in the valuations of memecoins built on the Ethereum blockchain. Let's understand how this development is impacting the memecoin landscape and what it means for the future.Memecoins, often known for their viral appeal and sometimes questionable utility, have seen significant price boosts following the Ethereum ETF announcement. Notable memecoins like Dogecoin (DOGE) and Shiba Inu (SHIB) experienced double-digit percentage gains, while lesser-known tokens like Floki Inu (FLOKI) and Dogelon Mars (ELON) skyrocketed by even higher margins.Several factors contribute to this phenomenon. The approval of an Ethereum ETF signifies growing mainstream acceptance of cryptocurrencies. This is also a major development in the industry after the Bitcoin ETF approval which witnessed large volumes of institutional money inflows. This can attract new investors, particularly those with a risk appetite who might explore memecoins as a volatile yet potentially high-reward entry point into the Ethereum ecosystem.The ETF reinforces confidence in Ethereum as a blockchain among users which partially translates to interest and enthusiasm in memecoins built on Ethereum. Compared to memecoins on alternative blockchains like Solana, Ethereum's established developer community, network security, and scalability efforts (like Ethereum 2.0) provide a perceived edge.: One of the OG memecoins, thanks to Elon Musk’s endorsement, DOGE has seen renewed interest. While its utility remains debatable, its brand recognition and loyal community stand to benefit from the Ethereum ETF tailwind.: Known as the \"Dogecoin Killer,\" SHIB has also enjoyed a price increase. Its efforts to build a decentralised ecosystem with its SHIB token, Shibarium Layer 2 blockchain and LEASH governance token might attract investors seeking a more feature-rich memecoin experience within the Ethereum network.: Inspired by Elon Musk's dog of the same name, FLOKI positions itself as a memecoin supporting various charitable causes. The Ethereum ETF effect, coupled with FLOKI's community based initiatives, could attract impact-driven investors seeking memecoin exposure.: This space-themed memecoin, referencing Elon Musk's Mars ambitions, has seen significant gains. While its long-term viability remains to be seen, current market sentiment favours this token as a part of the overall market gains.The long-term impact of the Ethereum ETF on memecoins remains a grey area. While the current surge suggests renewed interest, memecoins are inherently volatile and prone to market corrections. Their long-term success hinges on developing real utility beyond mere hype, something that could be achieved by clear community guidelines and consensus, and of course a concrete regulatory framework.The Ethereum ETF approval gives Ethereum-based memecoins a temporary advantage over those on Solana. While Solana offers faster transaction speeds and lower fees, Ethereum's established reputation and developer base currently hold more sway in market sentiment. However, as market dynamics evolve and Solana continues to develop, this advantage could shift.Apart from reputation risk and uncertainty, institutional interest in memecoins isn't completely unfathomable. Despite their volatility, some memecoins boast massive market capitalizations and active communities. Institutions might see a potential for controlled exposure to capture some of this growth. A small allocation of memecoins could serve as a diversification tool in their broader portfolio. Some memecoins are exploring ways to develop utility, such as integrating with decentralised finance (DeFi) protocols or play-to-earn gaming platforms. This could attract institutions seeking exposure to these emerging trends. If memecoins gain wider mainstream acceptance like in the gaming community or other metaverse projects, and demonstrate long-term stability, institutional attitudes could shift.In May alone, 455,000 tokens were launched on Solana. During the same month, 177,000 tokens were introduced on Base, while Optimism and Arbitrum each saw the launch of 20,000 new tokens. Most of them were memecoins. Virtually everyone understands that investing in meme coins is gambling. In a casino, one is gambling against the house, everyone knows the house always wins. Many people view the stock market in a similar light, which is why GameStop and 'Roaring Kitty' gained traction—because it felt like someone was sticking it to the house. However, people recognize that the house always wins. Meme coins, on the other hand, offer a different dynamic. They provide a sense of peer-to-peer competition rather than betting against the house. It's more about competing with fellow enthusiasts, which is a more exciting and less disheartening game. The PVP (player versus player) nature of it gives people a sense of having a chance. These activities are not controlled by Wall Street suits, which adds to their appeal. It's a way of rebelling against a system perceived as rigged against the average investor.The SEC 's approval of the Ethereum ETF has had an unexpected but fascinating consequence – a resurgence in Ethereum-based memecoins. While the long-term viability of these tokens is uncertain, the current market sentiment favours established blockchains like Ethereum. This, along with the potential influx of new investors, has created a short-term boost for these memecoins. However, for the enthusiasm to continue, these tokens will need to evolve beyond mere internet hype and demonstrate tangible utility."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMi2wFBVV95cUxOX2tod0liTmk4WFR6OTRiSXRmMDlldjNGanVmajdBU2cwM3p0RXlYeVRUUDRaWEZFSEFNQXA2b2pPdHRVRHduRTVWQWNXbnBEcGwyd3B4ejc2MG41TTZrMWFEbTJ6SjN4VGJGLWN3WmZwWHFkdDQxS1lhdUVvUkw4N2w4bVdNd3lZWmQ5YXg1TEpKYmUxSEo2R1ZRWHJrcFJ0aVFBV245VFZyUUtVLWYyYUx2MlNLYWpLSTNLQmo4NDlIY2g3MGVLRC1TRzdVQnpjejh3ZG1HQXZvcjTSAeABQVVfeXFMTnRWZzRFRnhkcXhnWTJ5VmNqNHZwZjhtT0VHSkhSczhieEZMWVdWekRvUXNycHpibXRSRkY0NVB0V2l2UXM1emp4clZGeWJjU1FycGd1T1NtYWNyQTd3bC1MN05FZFd5WXJsNXRudWNPN2lITGlZZ0xRc0EzZjV4VkJaWDJ5N3JiZHNQZlBfMjg3S29Id1JKVXgzNkl5eGNpcDljZTc0VERwY203YjhlR2hCMFg4VTU4Q1d3Ym54UzE3dmdTUnhxM3VvYVlEV2wxU2stYmV6ektQNF9RbHdYd1A?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Jun 2024 07:00:00 GMT",
        "title": "Ethereum's Tailwind: How the SEC ETF approval boosted Memecoin mania - The Economic Times",
        "content": "Why the Ethereum ETF Effect?\n\nA Look at Key Ethereum Memecoins\n\nLong-Term Impact: A Speculative Future\n\n\n\nInstitutional Interest: A Long Road?\n\n\n\nMemecoins: Flavour of the season\n\nConclusion\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nThe Bitcoin ETF, particularly BlackRock 's IBIT, has been the fastest-growing ETF to date, reaching $20 billion in just 137 days. In comparison, the next closest, JEPI, took nearly 1,000 days to achieve the same milestone. Now that the money men have tasted blood, and Ethereum spot ETFs to be listed, there are some interesting developments in the crypto market.While the primary impact is directly on Ethereum, there's been a fascinating secondary effect – a surge in the valuations of memecoins built on the Ethereum blockchain. Let's understand how this development is impacting the memecoin landscape and what it means for the future.Memecoins, often known for their viral appeal and sometimes questionable utility, have seen significant price boosts following the Ethereum ETF announcement. Notable memecoins like Dogecoin (DOGE) and Shiba Inu (SHIB) experienced double-digit percentage gains, while lesser-known tokens like Floki Inu (FLOKI) and Dogelon Mars (ELON) skyrocketed by even higher margins.Several factors contribute to this phenomenon. The approval of an Ethereum ETF signifies growing mainstream acceptance of cryptocurrencies. This is also a major development in the industry after the Bitcoin ETF approval which witnessed large volumes of institutional money inflows. This can attract new investors, particularly those with a risk appetite who might explore memecoins as a volatile yet potentially high-reward entry point into the Ethereum ecosystem.The ETF reinforces confidence in Ethereum as a blockchain among users which partially translates to interest and enthusiasm in memecoins built on Ethereum. Compared to memecoins on alternative blockchains like Solana, Ethereum's established developer community, network security, and scalability efforts (like Ethereum 2.0) provide a perceived edge.: One of the OG memecoins, thanks to Elon Musk’s endorsement, DOGE has seen renewed interest. While its utility remains debatable, its brand recognition and loyal community stand to benefit from the Ethereum ETF tailwind.: Known as the \"Dogecoin Killer,\" SHIB has also enjoyed a price increase. Its efforts to build a decentralised ecosystem with its SHIB token, Shibarium Layer 2 blockchain and LEASH governance token might attract investors seeking a more feature-rich memecoin experience within the Ethereum network.: Inspired by Elon Musk's dog of the same name, FLOKI positions itself as a memecoin supporting various charitable causes. The Ethereum ETF effect, coupled with FLOKI's community based initiatives, could attract impact-driven investors seeking memecoin exposure.: This space-themed memecoin, referencing Elon Musk's Mars ambitions, has seen significant gains. While its long-term viability remains to be seen, current market sentiment favours this token as a part of the overall market gains.The long-term impact of the Ethereum ETF on memecoins remains a grey area. While the current surge suggests renewed interest, memecoins are inherently volatile and prone to market corrections. Their long-term success hinges on developing real utility beyond mere hype, something that could be achieved by clear community guidelines and consensus, and of course a concrete regulatory framework.The Ethereum ETF approval gives Ethereum-based memecoins a temporary advantage over those on Solana. While Solana offers faster transaction speeds and lower fees, Ethereum's established reputation and developer base currently hold more sway in market sentiment. However, as market dynamics evolve and Solana continues to develop, this advantage could shift.Apart from reputation risk and uncertainty, institutional interest in memecoins isn't completely unfathomable. Despite their volatility, some memecoins boast massive market capitalizations and active communities. Institutions might see a potential for controlled exposure to capture some of this growth. A small allocation of memecoins could serve as a diversification tool in their broader portfolio. Some memecoins are exploring ways to develop utility, such as integrating with decentralised finance (DeFi) protocols or play-to-earn gaming platforms. This could attract institutions seeking exposure to these emerging trends. If memecoins gain wider mainstream acceptance like in the gaming community or other metaverse projects, and demonstrate long-term stability, institutional attitudes could shift.In May alone, 455,000 tokens were launched on Solana. During the same month, 177,000 tokens were introduced on Base, while Optimism and Arbitrum each saw the launch of 20,000 new tokens. Most of them were memecoins. Virtually everyone understands that investing in meme coins is gambling. In a casino, one is gambling against the house, everyone knows the house always wins. Many people view the stock market in a similar light, which is why GameStop and 'Roaring Kitty' gained traction—because it felt like someone was sticking it to the house. However, people recognize that the house always wins. Meme coins, on the other hand, offer a different dynamic. They provide a sense of peer-to-peer competition rather than betting against the house. It's more about competing with fellow enthusiasts, which is a more exciting and less disheartening game. The PVP (player versus player) nature of it gives people a sense of having a chance. These activities are not controlled by Wall Street suits, which adds to their appeal. It's a way of rebelling against a system perceived as rigged against the average investor.The SEC 's approval of the Ethereum ETF has had an unexpected but fascinating consequence – a resurgence in Ethereum-based memecoins. While the long-term viability of these tokens is uncertain, the current market sentiment favours established blockchains like Ethereum. This, along with the potential influx of new investors, has created a short-term boost for these memecoins. However, for the enthusiasm to continue, these tokens will need to evolve beyond mere internet hype and demonstrate tangible utility."
    }
]