[
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxNaEhyOWlDYUs4ODlybzNLMW85bm92RUkyc19COU4ydzJHMklxRGNkNUdhaGZROFNBeVNQOHlYUEV4N2RsX2F4bnZMeUJSbUs2NHROSklhSzhUd3l2cy1KdWFKUWpaemwxWXNfMFRJcFJHcFhUM3dBdlBRZUE4bW1Vc0FHeXhDWktFNUYxaVViandhWWplaW04Tld5QWNsSkZuWVpRUDd4b1hhVkw2WWR1WmRodGdncS1ZeU5xMEdneWdqREE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 19 Feb 2024 08:00:00 GMT",
        "title": "AI tokens jump 10% as Vitalik Buterin explains how AI can enhance security and efficiency on Ethereum - CryptoSlate",
        "content": "Digital assets in the artificial intelligence sector continued their recent surge, increasing by 10%, as Ethereum co-founder Vitalik Buterin stated that the technology could help the blockchain network mitigate its “biggest technical risk.”\n\nCryptoSlate’s data show that several tokens in the sector, including SingularityNET’s AGIX, 0x0.ai, Ocean Protocol’s OCEAN, The Graph’s GRT, Fetch.AI’s FET, and others, rose more than 10%, respectively, during the past day, pushing the sector’s market capitalization to $18.06 billion and its trading volume to approximately $2.5 billion.\n\nHow AI can aid Ethereum\n\nAccording to Buterin, AI technology could help blockchain network developers identify bugs and assist with the verification of codes.\n\n“Right now ethereum’s biggest technical risk probably is bugs in code, and anything that could significantly change the game on that would be amazing,” he added.\n\nHis remarks come in the wake of his recent exploration of the synergy between AI and crypto, detailed in a blog post on Jan. 30. Buterin outlined various potential applications of AI within the crypto sphere.\n\nHe pointed out that integrating AI could revolutionize crypto-systems, particularly in scenarios where individual participants are replaced by AI entities, enabling more efficient operation on a micro-scale.\n\nWhile recognizing AI integration’s functionality and safety enhancements, Buterin also urged caution, especially in high-value and high-risk settings.\n\nBeyond Ethereum, other protocols and exchanges like Solana, Polkadot, Binance, and stake.link also explore AI-driven solutions.\n\nHowever, despite the enthusiasm for AI, concerns linger regarding its efficacy in bug detection. Daniel “Haxx” Stenberg of cURL highlighted potential challenges, including the risk of AI-generated false positives complicating bug identification efforts.\n\n“An (AI-generated) security report can take away a developer from fixing a really annoying bug. because a security issue is always more important than other bugs. If the report turned out to be crap, we did not improve security and we missed out time on fixing bugs or developing a new feature,” Stenberg argued.\n\nMentioned in this article"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxNRU5LVVRaUGxXSzJabThKeHRsOVlERWliOUFDd2dja01HeXdWYzNMdzNBdWVWN1lOb3JHTTZHUFZrOV9vVHpxQzRhd1NsMWx1MWpvbXNGRlp3N1I1TkZvYklOZ1ByVzRmSFpXdG8yU2wwQnRPUFVzeWxaTDJFeVBZS2NiMzFxdVR5UnhTd0VPUlBYYVluU1F1MWFoNjdJLVhGTU9yRktmcDBFZGtjZ25TRXk3dEJ5QdIBuwFBVV95cUxOM0ZWT21RTnUyTmpPUWtpQTdjLUFNSWF3UzR3emV6NFRXZmh5M1ZzdXZZNWhsY0djdzRQNTRiejdLQzZnUFRNcU9ocHJJVmNabmtZbmhZeXZMb3lSODJ4ZC0zcUcyNF9QTDVzaE1hSUo4cHZRU0J2c2FBb0JVZnljRXRhbEdRMVhseUg2R244Y0pNNlVGMTc4bWZHc09IZlp2YTFubnY0c2xTVEZxeER3UmliZ3N2Y05FSk8w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 19 Feb 2024 08:00:00 GMT",
        "title": "Ethereum 2019 Correction Repeating? Analyst Warns Ethereum May See Larger Pullback - The Daily Hodl",
        "content": "Closely followed analyst Benjamin Cowen says Ethereum may be in the midst of repeating a historical pattern that could bring ETH down to much lower levels.\n\nIn a new strategy session, Cowen tells his 790,000 YouTube subscribers that in the last crypto bear market, Ethereum didn’t bottom out until canceling out a previous breakout from a rising wedge and then retesting a macro low.\n\nHe also notes that ETH crashed immediately after the Ethereum/Bitcoin (ETH/BTC) pair broke down.\n\nWith ETH/BTC teetering on support, Cowen says that the next breakdown could be what leads to a leg down for ETH/USD, which he says may see Ethereum trading at the $1,200 level.\n\n“It was not only the process of the unvinversion of the yield curve, but it was also the breakdown of the ETH/BTC valuation.\n\nIf you look at the ETH/BTC valuation, you will notice it was precisely here in July of 2019 when ETH/BTC broke down. And in July of 2019, that is where ETH/USD started to go down [from $362.39], and that is where ETH/USD went back through this wedge and came all the way back down here ($118).\n\nYou will notice in fact, that this low that ETH put in in December 2019, was actually slightly above this higher low [at $95]. This higher low here [November 2022] happened to be around $1,000, so if it’s going to play out in a similar fashion – which it very well might not – it would imply going back and testing that low.\n\nBut again, you will notice that this drop did not occur until after the ETH/BTC valuation broke down. It was after ETH/BTC broke down that ETH/USD finally got this drop. And where are we today? We are close to seeing a very similar process play out.”\n\nAt time of writing, ETH/BTC is trading at 0.05581 BTC ($2,927), still above Cowen’s support at 0.049 BTC ($2,570).\n\n?\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxNZFZSdjh3ajRUcTVqSkk5UGdmVzUtTVRwNlphY0ZNX2hYYVdaaTZiYkMtSy1abXNFSk5IOVY2dUsybG9LWHJ0cDBJZklzaEJiVXpDUzVDa3V5eHk1RnFIRDgyLUN1X0w1cnlxSks2ZUMwY3I4VXhpZ0pMRkM1WWtJNjJLbm0yd3pFRDdxTEs5dTVIQ1FUMjlaQl9QWFQ1QQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 19 Feb 2024 08:00:00 GMT",
        "title": "Ethereum price approaches $3k amidst spot ETF anticipation, Dencun upgrade - CryptoSlate",
        "content": "The price of Ethereum (ETH) approached $3,000 on Feb. 19 amidst anticipation concerning developments that are expected to occur in the coming months.\n\nAs of 8:35 pm UTC, ETH was priced at $2,937 with a market capitalization of $352.96 billion. That change represents 4.12% growth over 24 hours — significantly greater than Bitcoin’s 0.4% gains over the same period and also greater than the crypto market’s overall 1.2% gains.\n\nLido Staked Ether (STETH) saw comparable gains of 3.88% over 24 hours. Ethereum 2.0 staking tokens as a category saw gains of 5.4%, according to data from CoinGecko.\n\nEthereum was responsible for a relatively small portion of 24-hour liquidations. The asset accounted for $35.48 million of liquidations, including $8.43 million in long liquidations and $27.05 in short liquidations.\n\nGrowth may be due to ETF anticipation, Dencun upgrade\n\nEthereum’s latest gains may be connected to the possibility that the US Securities and Exchange Commission (SEC) will approve a spot Ethereum exchange-traded fund (ETF).\n\nThough no significant regulatory developments around spot Ethereum ETFs occurred today, a relevant report from the brokerage firm Bernstein received widespread coverage. Analysts at the company predicted a 50% chance that a spot Ethereum ETF will be approved by May and a near-certain chance that such a fund will be approved within one year. Combined with other similar predictions in past months, this report may have affected investor sentiment and market activity.\n\nSome backlash has also emerged around Ethereum’s ETF prospects. Apollo co-founder Thomas Fahrer suggested that Coinbase’s leading role as an ETF custodian could compromise Ethereum’s proof-of-stake model by allowing the firm to “control the entire network.”\n\nData from Dune Analytics suggests that Coinbase is currently responsible for about 15% of all ETH staking, while another staking platform, Lido, is responsible for more than 31%. Because it is unknown how much crypto might be held in spot ETH ETFs, it is unclear whether Coinbase could gain dominance by holding funds on behalf of those ETFs. Furthermore, it is unclear whether the SEC will permit staking of ETH held in spot Ethereum ETFs, though some applicants aim to do so.\n\nApart from those ETF prospects, there is also significant anticipation around Ethereum’s Dencun upgrade, which is set to take place on March 13. That upgrade will notably include proto-danksharding, a feature expected to improve ETH transaction costs and scalability.\n\nEthereum Market Data At the time of press 10:39 pm UTC on Feb. 19, 2024, Ethereum is ranked #2 by market cap and the price is up 2.69% over the past 24 hours. Ethereum has a market capitalization of $356.82 billion with a 24-hour trading volume of $15.44 billion. Learn more about Ethereum › Ethereum $2,969.40 2.69% Crypto Market Summary At the time of press 10:39 pm UTC on Feb. 19, 2024, the total crypto market is valued at at $1.99 trillion with a 24-hour volume of $68.83 billion. Bitcoin dominance is currently at 51.35%. Learn more about the crypto market ›\n\nMentioned in this article"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFBlQXBuLW9rb0VuVWQwU2NqXzFLQmkyc0l3YlNqVjJjdHZmeU9PcmhXaXhXVUlXR3pEMWdIMlJTeTRvU0hSUnJnMHdBckc3S3BpVHdQZ3dQazU2VjdTUmhhdUtkRVNPREN4Yi1OS245SGwwSTNlaDcwZ2tRZkfSAYQBQVVfeXFMUFFySWppdTZIRkFxVmloQlBZbjR4dE9sVDRaR3d3WTFyTFExN0Vqa0lSYkYxdG1udHE3MjF4UnVsMFlmM1RXQ2V2WTluYjU5R3JzYUJxdkVTRzVvNk92dTJseVZBamdqNWRQMHVKYm9JekhXS05oMVQ0MzFZeUFha3htY2pP?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 19 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Up 28% This Month as Dencun Upgrade Nears, Scaling Networks Surge - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEthereum has climbed almost 4% since yesterday at a current price of $2,910 and a staggering 28% since the start of the month—and analysts say there's reason to believe ETH could go even higher.\n\nAt the time of writing, there's less than a month left before Ethereum developers bring the much-anticipated Dencun upgrade to Ethereum mainnet. The upgrade will bring \"proto-danksharding\" to the leading proof-of-stake blockchain. It's a technical improvement that promises to reduce data availability costs and address some key scalability challenges. In short, it'll make Ethereum faster and cheaper.\n\nThere's also growing optimism that the U.S. Securities and Exchange Commission could this year approve a spot Etheruem ETF to begin trading. That optimism got a lot more potent after the SEC last month approved 10 different Bitcoin ETFs, which have since seen $3 billion worth of net flows.\n\nOne of the main indicators that traders like where ETH is headed: Options and futures contracts. On-chain analytics platform CryptoQuant shared a post from pseudonymous crypto trader Greatest_Trader that suggests that climbing open interest hints at increased confidence among traders.\n\nAD\n\nAD\n\nWill Ethereum Reach an ATH in 2024? “Notably, the chart reveals a significant surge in open interest, coinciding with #Ethereum's upward price trend, reaching its peak levels since July 2022.” – By @Greatest_Trader Link 👇https://t.co/GWHqi4Q4bA — CryptoQuant.com (@cryptoquant_com) February 19, 2024\n\n\"However, given the impulsive nature of the recent ascent, traders should exercise caution and consider the potential for sudden liquidation events, which could trigger notable short to mid-term price declines,\" they wrote.\n\nSure enough, there's currently $10.6 billion worth of open interest in Ethereum futures contracts, according to CoinGlass.\n\nOpen interest represents the value of open options and futures contracts for a particular asset. That value has climbed by 6% in the past day alone—and it's not that far off the $11 billion worth of open interest traders saw during the last big bull run in November 2021. At the time, ETH was trading above $4,800 per coin.\n\nAD\n\nAD\n\nTrading volume is another market indicator that analysts have been watching.\n\nSo far this year, Ethereum volumes have tended to pick up when there's been big news about Bitcoin—notably the approval and subsequent trading of spot Bitcoin ETFs in January.\n\nOver the three-day period after Bitcoin ETFs began trading in the U.S., Ethereum saw $130 billion worth of trading volume, according to CoinGecko data, clearing $40 billion each of those days. The main driver at the time appeared to be optimism that if the U.S. Securities and Exchange Commission had approved Bitcoin ETFs to trade, then it would be no time before it did the same for pending Ethereum ETFs applications.\n\nMore recently, though, volume has slowed down to around $15-25 billion per day, according to CoinGecko.\n\nThe TOTAL VALUE LOCKED in #ETHEREUM L2s just hit another ALL-TIME HIGH! $26.95 BILLION and counting!📈 2024 is the year of #ETH. We are just getting started.🚀 pic.twitter.com/mN10Fawbms — Leon Waidmann | On-Chain Insights🔍 (@LeonWaidmann) February 19, 2024\n\nBut things are picking up in other ways. Transaction totals processed by layer-2 scaling networks like Arbitrum, Base, and Optimism have seldom been higher than they are right now. L2Beat, an Ethereum scaling network analytics platform, shows tht they collectively reached 92 transactions per second as of yesterday—which is 6.8 times more than what's being transacted on Ethereum mainnet.\n\nAnd all that activity has brought the total value of assets locked on layer-2s to an all-time high of nearly $27 billion, according to L2Beat.\n\nEdited by Andrew Hayward\n\nAD\n\nAD"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMibEFVX3lxTE5QbGs1SmhCeGNYVXM5WVNZV3VieUYyUXNPdjA5dUZFSUtRRDVqTFZIQjR2VzJLVk0xdGJ6TnVuODZtc2lveFIzcDJOVzlPdHZMRnhIVnlNZVdITHNfM0d5UnJmSWdVTmZGSzlTcg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 19 Feb 2024 08:00:00 GMT",
        "title": "Selling Ethereum in 2024: is now the right time? - Crypto Briefing",
        "content": "Share this article\n\nEthereum is a decentralized blockchain that supports smart contracts and far-reaching dApps. If you wish to trade in ETH, you need to analyze the project’s performance, trends, upgrades and updates, and basically any other aspect that could impact its price. This will help you determine the right time to sell or buy ETH. Depending on these factors, you may then decide to hold onto your ETH or convert ETH to USD.\n\nHere, we examine Ethereum in more detail to help you determine whether now is the perfect time to sell your ETH.\n\nWhat Is Unique about Ethereum’s Technology?\n\nThe Ethereum network is an open-source protocol that runs on the Ethereum Virtual Machine. It supports an immense ecosystem of decentralized apps as a pioneer of blockchain smart contracts. Since its inception, Ethereum has been a pacesetter in digital trends such as NFTs, GameFi, Web3, Metaverse, and decentralized finance (DeFi).\n\nThanks to the network’s vast applications, serious concerns have emerged regarding its massive energy consumption, high transaction costs, and scalability. Some investors are already considering selling ETH in preference to its competitors — Solana, Polkadot, Binance Smart Chain, and Cardano. You can read more about some of these crypto projects on the Paybis blog.\n\nEthereum 2.0 Updates and Upgrades\n\nEthereum 2.0 reduces gas fees and increases transaction speed from 30 TPS to 100,000 TPS. The goal is to ensure ETH is more usable with increased adoption to grow and stabilize its price.\n\nThe upgrade also saw Ethereum move from the proof-of-work to the proof-of-stake consensus mechanism. This migration helped the network to reduce its carbon footprint by over 90%.\n\nThe evolution of Ethereum has been long in the pipeline. It started with the launch of the Beacon Chain in 2020, and ever since, we’ve witnessed the Berlin and London upgrades.\n\nOther notable upgrades that followed included Arrow Glacier, Gray Glacier, Bellatrix, and Paris. The last three were collectively referred to as ‘The Merge.’\n\nIn 2023, the Uniswap V4, a new smart contract protocol, was launched. However, Ethereum’s developers also recently rolled out the Shanghai upgrade that would allow ETH validators to unlock staked ETH, making rewards accessible.\n\nHow Has Ethereum Performed in Previous Years?\n\nLooking back at Ethereum’s ICO, we see how affordable the coin was at just $0.31. Up until 2016, the price averaged less than $1. ETH skyrocketed to an all-time high of $1,270 in 2018 but the real bull run came in 2021 when it hit an unprecedented $4,891.\n\nSince then, the crypto market has experienced a bearish market, which saw most crypto projects shed a lot of their value. The crypto asset plunged to $890 on June 18, 2022, but has recovered well to register a 130% price gain from its current price. However, it’s important to note that it still grapples with a 58% decrease from its ATH.\n\nNavigating through the highs and lows, Ethereum faced heightened volatility throughout 2023. Towards the end of October, the entire crypto market received a significant boost fueled by the anticipation of a Bitcoin Exchange-Traded Fund (ETF) approval in the coming months. This optimism propelled the price of ETH upward, breaching the $2,000 mark on November 9th for the first time since July.\n\nWhat Is the Future of Ethereum?\n\nLooking at expertly derived technical charts for Ethereum, there’s a strong indication that the price will pull through the $2,300 resistance point.\n\nOnce Ethereum 2.0 updates and upgrades start fully rolling out, experts have forecast ETH to hit $2,700 in 2024 and $3,000 by 2025.\n\nSeasoned analysts and market veterans exhibit a bullish sentiment toward Ethereum, maintaining an optimistic outlook on its future price trajectory. Some even project that Ethereum could reach an impressive $40,000 by 2030. These forward-looking expectations underscore the confidence in Ethereum’s potential for substantial growth and sustained value over the coming decade.\n\nConclusion\n\nTransformative Ethereum 2.0 updates are poised to enhance the network’s scalability and sustainability. With the current ETH price at $2,500 and a market cap of more than $300 billion, the crypto market continues to showcase Ethereum’s resilience.\n\nAs the crypto landscape evolves, staying informed and adaptable is crucial when considering selling ETH. Consider diversifying your portfolio away from Ethereum, you can exchange ETH for up-and-coming competitors such as Solana, Polkadot, Binance, or the more established Bitcoin."
    }
]