[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxNbXhPZGdUZnlFNEhQNjUxSEdZZTI1MVc3eGhEa3pyeVJSXzVLVHVYOG1aR2xDcHE5TmlBSWU4bElQMHhQRWxfS1ZBbENHSXE4NlczYkZySUdtVFplSXdmZ0RCd0pvYVI3OGFjMHZSTUZ0WTROdzdRT2tha1FocGx0dno0dUpoQVpULWlyTnA4QTBBTE9WOEt5Z2F1cEs3cmNQenlwREdYdDRRYUdwY2pyRHVUc9IBuAFBVV95cUxQNnc5LXJpT0JYWXpCYU5WMFFEdjVzNTVLYlRzb3hKVnR4cUdSS2xLakUtLW1BOGNqTEFiU2tyYzI3ajdpbk5fRDloZzhqcVB2Wkg0MXZPWi1CZHNFOHF1eEl1T2E3eC1sbjVScUxydm40MkNOTHNWcWM5UXZiS29XcjN5US0wSjRDS2RkQWVuaTl2U2dQUmluSVRxdFRSZTNxYnUtUU5MN3RySnVsRmlGVEk1MHg1S2tT?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Feb 2024 08:00:00 GMT",
        "title": "Liquid Restaking Tokens or 'LRTs' Revived Ethereum DeFi. Can the Hype Last? - CoinDesk",
        "content": "The risk of such an outcome is amplified by the fact that points are not typically issued on blockchains and are tracked instead directly by their issuers. This means it is difficult to know how many points of a given type are in circulation , making it even more difficult to discern their value."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxQTEVwa0FDSEt1ZzlsTlVqMlZXSkFQTEVFbTR6UmUzTFQxcms3ZG9hVXA0SGItNURmdnNOZDlJeGxjUG80WWNGY0RNSDZVSzlQUTdsdmVVdUQ1VExtWG9Bdl8wdzBmUzk1emxfcE1KalFHYnNlZmhjVnFlTWtWVHJpb3otNzBwTzRyZU5jZ0JlNHg4eEtkZGltX2t4X3h4M3UtZzhTZUxDVGxtajk4d2Jkc3JFeDNzdTJXekJ6UnpJd9IBxAFBVV95cUxQckFtbXJrSmF4eDNERHN0SUpRMDZFSTRfS2pVZmVpczVfUmNPek9ucGlCemxvUzU5NEtGOHZfbDFFbE5WdDllNFVoRzFDdWtjNmdtcnd5YU5ManJWLUpvMG9DUWw5LWVtajhCZlN2QndOTF92QlhiOXA4c0s1d18tTnQ0cXhiT211MFNrQk4wVzZZTUdPMmp5SHhtOHlqaElscGhBN2s2V3V3Z2EyNlBnc1VFYkFHa1dkM2c3OHdkT1c2S0dr?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Feb 2024 08:00:00 GMT",
        "title": "Ether Hits $3K for First Time in Nearly 2 Years Amid Rising ETH ETF Excitement - CoinDesk",
        "content": "\"We are very close in this move to levels around $3,150-$3,300,\" said Kenny Hearn, SwissOne Capital’s chief investment officer, in an interview with CoinDesk. \"The next level after that would be $3,600 and we think this is quite easily attainable in the next month or so as the alts continue to play catch up.\""
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE5lek1ydGF4VElBUThYTnNsZDdGMkRlSE5WVlJ2U3hnV1M4cURfZTl1NEdBMjBHTDZiM1YxT3VtV3R3VTJHVFZCTEtnQjdySXR5REZJRkZzWnBvd1NUblFvS1VkRXpiT19GVGR1M19BRkpyejZ0c2xmVl9ZMnrSAYQBQVVfeXFMT3BNaEQweFBQeW5KVWl2ZEFueldGWXh3Y0pMVVpreVNFQTIwdks1b1dBeWdzZDZDOHB1N2IxWktQYktMMW5MbkcxaHJlR2RYRGFKNlE1T2FhLWtZVFZfcVFBTGhqUFlJRkJ1cWl4UnRIeG0xMVNKNGV1SDZNbFY4VTVrdVdZ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Hits $3,000 For First Time Since April 2022 - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEthereum (ETH) touched $3,000 for the first time since April 2022, just before the entire crypto market entered a brutal bear market.\n\nThe price of ETH stands at $3,000, according to CoinMarketCap data, representing a more than 3.4% 24-hour rise. Over the past week, it has risen by 13%.\n\nThe last time the second-largest cryptocurrency stood at the $3,000 mark was nearly 22 months ago. One month later, the crypto project Terra collapsed, bringing the price of every digital coin and token with it. ETH has struggled to recover since then.\n\nAD\n\nAD\n\nA lot is now happening in the Ethereum world today, however, and there is more interest in the asset than before. A number of high-profile Wall Street fund managers have proposed spot ETH exchange-traded funds (ETFs) to the Securities and Exchange Commission.\n\nIf approved, traditional investors would have access to ETH in a safe and regulated way. The likes of BlackRock, Grayscale, and VanEck are hoping to get the green light from the regulator.\n\nLast month, British multinational bank Standard Chartered projected that a spot ETH ETF will likely get approved by May—and then it'll only go up in price.\n\nETH's network is also about to undergo a vital upgrade, dubbed \"Dencun.\" The improvement will bring \"proto-danksharding\" to the blockchain, promising to make it faster and cheaper to use.\n\nETH is still well below its November 2021 all-time high of $4,878.\n\nAD\n\nAD\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxQZjFUVmh2T1UyV285WVQyWmhKNGtHUmE2eE5yam9KU2ZORnNSR3hZNHFNNXFNWVo1WXNTdlBLcG5FN2lmMlM0Q2RKc3dDQlRoRy1LVEpuSml6M3lKV042T19ZdkJVb1VqemRqWVFSNjdMVHlQWTFKc2VObTBFd055OVNURnFraUY4RWs0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Feb 2024 08:00:00 GMT",
        "title": "Ethereum approaches $3,000 milestone ahead of Dencun upgrade - Crypto Briefing",
        "content": "Ethereum’s price surged over 9% in the past week, while Bitcoin was up around 3%.\n\nShare this article\n\nEthereum (ETH) is setting its sights on the $3,000 mark as the Dencun upgrade inches closer. According to data from TradingView, Ethereum’s price has exceeded $2,980 in the last 24 hours, up over 27% year-to-date. This milestone marks Ethereum’s most triumphant return to the $2,900 range since May 2022.\n\nThis surge in Ethereum’s valuation is largely attributed to a confluence of positive market developments and speculative anticipation surrounding the potential approval of a spot Ethereum exchange-traded fund (ETF).\n\nAccording to data from SpotOnChain, a whale has recently amassed a staggering 54,721 ETH, valued at over $150 million, through transactions on Binance and the decentralized exchange 1inch, averaging a purchase price of over $2,845 per ETH.\n\nFurther examination of this whale’s portfolio via the SpotOnChain reveals a current holding of 74,383 ETH, equating to around $216 million. This accumulation signifies a near tripling of their Ethereum holdings in just 24 hours.\n\nIn addition to the ETH holdings, this investor also acquired about 5,485 stETH, liquid staking assets from Lido Finance, valued at nearly $16 million.\n\nLiquid staking on Ethereum has attracted a huge amount of users. The total value locked in the liquid staking protocols has skyrocketed almost 600% since January last year, as reported by DeFiLlama . With the Dencun upgrade underway, liquid staking on Ethereum might see even greater growth in the future.\n\nScheduled for March 13, the Dencun upgrade will introduce several improvements, including the highly-anticipated Ethereum Improvement Proposal 4844 (EIP-4844), or “Proto-Danksharding.” This feature is expected to significantly reduce transaction fees, particularly benefiting layer 2 rollup chains.\n\nApart from the Dencun upgrade, there’s also a lot of hype surrounding the potential approval of a spot Ethereum ETF, with prominent asset managers such as BlackRock, ARK Invest, and Franklin Templeton among the eight filing for the investment fund.\n\nMay 23 is a critical date for a potential spot Ethereum ETF as the US Securities and Exchange Commission (SEC) prepares to rule on VanEck’s application. Interestingly, some developments experienced during the approval process for spot Bitcoin ETFs are resurfacing, as seen in ARK Invest and VanEck’s recent update to their spot Ethereum ETF filings.\n\nGiven Bitcoin’s price rally from around $27,500 to over $46,900 (according to data from CoinGecko) leading up to the decision on its spot ETF, March is shaping up to be a defining month for Ethereum."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQcHY1RV90ZjBCNU1hMmhncTIyZEs5UnJqUVJiYkRoeVY5b3BmSGlhcW44a1dzVURiQlo4QXdlcjdJQUp3VzBCbkprbWJuR2FQQzNUZEU5VHhQbURRWHRKZEp5czExUlBxYm5HdGU5R1NVRGJLcW1uZlhpWExROVlOaTk5bmZOV2pwYlI5Uzc2bmNyYlB5Q0l2NQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Feb 2024 08:00:00 GMT",
        "title": "Why Ethereum, Filecoin, and Hedera Are on Fire Right Now - The Motley Fool",
        "content": "Speculation about cryptocurrency ETFs continues, but a lot is going on under the crypto hood.\n\nThe crypto market's hot streak is continuing, and since the market closed on Friday, there have been some big movers. And in some of these cases, the moves have been driven by real developments, not just hype.\n\nEthereum (ETH -0.88%) has risen as much as 8.1% since the stock market closed on Friday, Filecoin (FIL -0.78%) jumped by 40.7%, and Hedera (HBAR -2.34%) was up 38.7%. As of noon ET Tuesday, the tokens were up 5.4%, 30%, and 22.1% since Friday.\n\nBig crypto moves all around\n\nEthereum is rising in part because traders are still speculating that regulators will approve more crypto ETFs beyond the Bitcoin (BTC -0.45%) ETFs launched in the last few months. The next coin that is likely to get approval for one is Ethereum because of its size and recognition in the market.\n\nIf an ETF were approved, the purchasing activity around the coin could push Ethereum higher, in a similar fashion to the way Bitcoin has responded. Just last week, $2.4 billion flowed into Bitcoin ETFs.\n\nFilecoin's rise was prompted by more fundamental news: It announced it will store Solana's (SOL -0.46%) block history, allowing Solana to move to more decentralized storage. This should be a win for both cryptocurrencies; Solana can now focus more attention on expanding the high-throughput network while Filecoin gets a significant partner.\n\nLesser-known token Hedera is benefiting from the growth in its SaucerSwap decentralized exchange, which now has over $127 million in total locked value, a gauge of how much investors are putting into the exchanges on the ecosystem.\n\nBuilding the foundation of crypto's future\n\nIndividually, these moves may seem small. But together, they tell a story about where crypto is headed in the near future.\n\nBitcoin ETFs have been approved, which suggests that eventually, ETFs for Ethereum and other tokens could arrive too, bringing more money into the ecosystem and driving values higher. If an Ethereum ETF gets approved, there may soon be dozens of crypto ETFs.\n\nThe Filecoin and Hedera news is more useful for the industry long term. As more tokens and exchanges are launched, it's necessary for market makers to put value into the ecosystem, and that's part of what we're seeing with the SaucerSwap exchange. Filecoin helping Solana store its blockchain history moves that token toward the decentralized vision that so many advocates would like to see.\n\nIf Solana and Filecoin can work together to create an extremely fast, high-throughput blockchain with accessible storage, it would be a win for all blockchain users. This is where I think we will see more utility and financial products built in the near future.\n\nCrypto is maturing before our eyes\n\nTwo years ago, crypto was still in the speculative trading days, and speculation in that market still exists, but major tokens like this are now focused on building real utility on blockchains. If that utility is combined with more investors putting money into the crypto ecosystem, it could create a reinforcing loop of value creation."
    }
]