[
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxOYXFqcWxDZTVXdXdiNU1fQ293UmxHWlo4eXh1cUpseUdsbUlFb01tcGxKa1piWVJnNWNuZTBjZFhCckZlZGVXX2VRMjlqYzc5NTFOWFhKc0ZHZ3RpTFVDLS1WVzMwbnpJOW80YURDWmFTUGVDQlJlQUhmNm9JWDc0ZXRR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Ethereum Price Surges Above $3K Mark Amidst Unforeseen Court Ruling - Yahoo Finance",
        "content": "Ethereum Price Surges Above $3K Mark Amidst Unforeseen Court Ruling\n\nEthereum (ETH), the second-largest cryptocurrency by market capitalization, experienced a notable price rally over the past 7 days, with a 5.36% increase that brought its price close to the $3,100 level. Analysts attributed this surge to stalling retail sales data in the United States for April, raising expectations of a potential interest rate cut by the U.S. Federal Reserve to stimulate economic growth.\n\nETH's surge was also influenced by a court ruling and a U.S. Department of Justice indictment. The indictment, unsealed on May 15, accused two individuals of wire fraud and money laundering through the manipulation of the Ethereum blockchain. The court document emphasized that Ethereum operates as a decentralized blockchain without the need for a trusted intermediary, boosting confidence among ETH investors.\n\nThis came after the U.S. Securities and Exchange Commission issued a Wells notice to Robinhood, a trading platform, over alleged securities violations related to crypto listings and custodian operations. The verdict contradicted regulators' classification of ETH as a security, as it highlighted the absence of management or entrepreneurial efforts by others within the Ethereum network.\n\nThe U.S. SEC is expected to announce its final ruling on VanEck and ARK Invest’s spot Ethereum ETF request on May 23 and May 24 respectively. While analysts predict approval odds below 35%, the case for classifying Ether as a security instrument has weakened, contributing to the rally above $3,050 on May 17."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxQY3IxU3lwNEJEc2xIM2dUY3RMdnNyU2RRd2prWVFZTXJmbDBwWUNxci1QMDdUaG1CMVNzcUFCeGdyQ0xxa2VQSlV5a1JMay1BcmR6eVlncWVXSGFXM0p5NmEtanNDcWlxUGR6MzNNRVpielQ5T0xxZUFLd0d5WkwxY1VoVE5uVTdDZS1LWGNTYW8tNk10a2NKVXMzTzNZdEw5QjQ2QmFJakFWM0g1YXI4RUh5aUVBUzdvME9fc25TbXJSdkdpM1hFeC14MldRY3EtdEt4cXVLUFBjaTJtLW1wX2NTMWM1T0dj?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Bonk, Pepe Outstrip Gains Of Bitcoin, Ethereum Amid Searing Hot Rally — Beat Biggies Dogecoin And Shiba Inu In Trading Volumes - Benzinga",
        "content": "Memecoins took center stage on one of the best days for the cryptocurrency market, with the likes of Pepe PEPE/USD and Bonk BONK/USD turning out to be the highest gainers.\n\nWhat Happened: The market rallied on higher expectations of an Ethereum ETH/USD spot ETF approval by the SEC, resulting in the highest market cap growth in three months, according to Santiment.\n\nPrice Action: While the rally was spurred by developments around Ether, memecoins stole the highlight yet again, as popular coins like PEPE and BONK grew by 27% and 23% respectively, according to data from Benzinga Pro.\n\nEthereum ETH/USD-based PEPE rose to an all-time high of $0.000011, while the Solana SOL/USD-based meme coin BONK bumped to a two-month high of $0.000031. The rest of the meme coin market also reported significant gains.\n\nCryptocurrency Gains +/- Price (Recorded at 10 p.m. EST) Bonk BONK/USD +27% $0.000031 Pepe PEPE/USD +23% $0.000011 Floki FLOKI/USD +10.48% $0.000211\n\nPepe's trading volume surged to $2.16 billion in the last 24 hours, exceeding bigger coins with larger market caps like Dogecoin DOGE/USD and XRP XRP/USD, Bonk clocked a volume of $850 million, trumping Shiba Inu SHIB/USD\n\nWhy It Matters: The latest rally reflected a strong appetite for meme coins, the class of cryptocurrencies that has witnessed significant gains in the year.\n\nSocial analytics platform LunarCrush highlighted bullish social media discourse around the two coins, with 82% of all BONK posts, and 80% of PEPE posts being positively weighted.\n\nSuch degrees of optimism could potentially help sustain the rally for the two meme coins.\n\nImage via Shutterstock\n\nRead Next: Bitcoin, Ethereum, Dogecoin Shoot Up On One Of The Best Days For Crypto In 2024 Amid Ether ETF Approval Buzz: Analyst Flags ‘Robust’ US Investor Demand for King Crypto"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiZ0FVX3lxTE5BLU5aMlctaC0tSWU1M3diQXZObHlBRWYtV2JjeDJ3V2E0YXhBdFpIbjg2dnZvZXJ5RV9VSGRONzJ5em1lWVE2cUhRQjdUenJrOWxYWnNIZ1F4S0VTVFdNbW9jOXprazDSAWxBVV95cUxOQnZpMHlFSVRFblQzMTVkVUlZcVp6V1NOT1dxbXdjT1l3bnBxNUo1QWUzOFg3RnJrQlhXOHVWLVBmWTV2bE95ekpZUWRYejV2YnBJWVUtZDZKbHI4bHQxYjlfT2xhcS1WckVxOU0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Ether jumps more than 20% in two days on renewed optimism for an ETF - CNBC",
        "content": "In this article HOOD\n\nCOIN\n\nBTC.CM=\n\nETH.CM= Follow your favorite stocks CREATE FREE ACCOUNT\n\nOmar Marques | Lightrocket | Getty Images\n\nCryptocurrencies rose Tuesday amid a late surge in optimism around the U.S. Securities and Exchange Commission's decisions on spot ether exchange-traded funds applications, the first of which is due this week. Ether led the rally, rising more than 20% over two days to $3,710.31, according to Coin Metrics. Earlier, it rose as high as $3,835.43. \"This sudden flip in expectations is an unexpected boon for [crypto] investors who have been crying out for a driver after the [Bitcoin] halving passed and bitcoin ETFs were launched in the U.S. and Hong Kong,\" said Antoni Trenchev, co-founder of crypto exchange Nexo. \"If the spot ETH ETFs are approved, altcoins should take off as ether is often a leading indicator for the rest of the crypto market.\"\n\nStock Chart Icon Stock chart icon Ether rallies on ETF optimism\n\nThe rally began suddenly on Monday, amid reports that the SEC has requested key document updates from potential ETF issuers and exchanges. A spokesperson for the SEC said the agency does not comment on individual filings. Now, investors are considering the odds that the SEC might greenlight spot ether ETF applications. The previous consensus was that the agency was unlikely to approve the funds, based on the lack of engagement by the agency on the filings. By contrast, in the weeks leading up to approvals for bitcoin ETFs, the SEC was reported to be engaging actively with fund issuers. Final decisions on applications by VanEck and Ark Invest are due this Thursday and Friday, respectively. BlackRock, Fidelity, Invesco, Grayscale and Bitwise Asset Management also have applications awaiting decisions this year. Ether futures ETFs hit the U.S. market for the first time in October, just a few weeks after courts ruled against the SEC in a landmark case brought by Grayscale that paved the way for spot bitcoin ETFs and may have set a precedent for spot ether ETFs. The court said the SEC's denial of Grayscale's proposal to convert its popular bitcoin trust into an ETF was \"arbitrary and capricious,\" and that the agency failed to adequately explain why it approved the listing of two bitcoin futures exchange-traded products, or ETPs, but not Grayscale's proposed bitcoin ETP. Bitcoin hits the brakes As ether rallied for a second day, bitcoin and crypto stocks lagged. The flagship cryptocurrency was little changed Tuesday, holding on to a 7% gain from the previous day that pushed it above $70,000 for the first time in more than a month. Bitcoin has been rising since last week's April CPI reading showed inflation eased from the previous month, which could open the door again to lower interest rates in the U.S. Crypto-related equities initially rode the wave higher, but also pulled back on Tuesday. Coinbase and Robinhood , both plays on the trading of cryptocurrencies, were little changed, building on gains of 8% and 9%, respectively, from the previous session. MicroStrategy , which is more of a proxy for the price of bitcoin, fell 4%.\n\nStock Chart Icon Stock chart icon Bitcoin initially jumped with ether on Monday but has since pulled back"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiZ0FVX3lxTE5BLU5aMlctaC0tSWU1M3diQXZObHlBRWYtV2JjeDJ3V2E0YXhBdFpIbjg2dnZvZXJ5RV9VSGRONzJ5em1lWVE2cUhRQjdUenJrOWxYWnNIZ1F4S0VTVFdNbW9jOXprazDSAWxBVV95cUxOQnZpMHlFSVRFblQzMTVkVUlZcVp6V1NOT1dxbXdjT1l3bnBxNUo1QWUzOFg3RnJrQlhXOHVWLVBmWTV2bE95ekpZUWRYejV2YnBJWVUtZDZKbHI4bHQxYjlfT2xhcS1WckVxOU0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Ether jumps more than 20% in two days on renewed optimism for an ETF - CNBC",
        "content": "In this article HOOD\n\nCOIN\n\nBTC.CM=\n\nETH.CM= Follow your favorite stocks CREATE FREE ACCOUNT\n\nOmar Marques | Lightrocket | Getty Images\n\nCryptocurrencies rose Tuesday amid a late surge in optimism around the U.S. Securities and Exchange Commission's decisions on spot ether exchange-traded funds applications, the first of which is due this week. Ether led the rally, rising more than 20% over two days to $3,710.31, according to Coin Metrics. Earlier, it rose as high as $3,835.43. \"This sudden flip in expectations is an unexpected boon for [crypto] investors who have been crying out for a driver after the [Bitcoin] halving passed and bitcoin ETFs were launched in the U.S. and Hong Kong,\" said Antoni Trenchev, co-founder of crypto exchange Nexo. \"If the spot ETH ETFs are approved, altcoins should take off as ether is often a leading indicator for the rest of the crypto market.\"\n\nStock Chart Icon Stock chart icon Ether rallies on ETF optimism\n\nThe rally began suddenly on Monday, amid reports that the SEC has requested key document updates from potential ETF issuers and exchanges. A spokesperson for the SEC said the agency does not comment on individual filings. Now, investors are considering the odds that the SEC might greenlight spot ether ETF applications. The previous consensus was that the agency was unlikely to approve the funds, based on the lack of engagement by the agency on the filings. By contrast, in the weeks leading up to approvals for bitcoin ETFs, the SEC was reported to be engaging actively with fund issuers. Final decisions on applications by VanEck and Ark Invest are due this Thursday and Friday, respectively. BlackRock, Fidelity, Invesco, Grayscale and Bitwise Asset Management also have applications awaiting decisions this year. Ether futures ETFs hit the U.S. market for the first time in October, just a few weeks after courts ruled against the SEC in a landmark case brought by Grayscale that paved the way for spot bitcoin ETFs and may have set a precedent for spot ether ETFs. The court said the SEC's denial of Grayscale's proposal to convert its popular bitcoin trust into an ETF was \"arbitrary and capricious,\" and that the agency failed to adequately explain why it approved the listing of two bitcoin futures exchange-traded products, or ETPs, but not Grayscale's proposed bitcoin ETP. Bitcoin hits the brakes As ether rallied for a second day, bitcoin and crypto stocks lagged. The flagship cryptocurrency was little changed Tuesday, holding on to a 7% gain from the previous day that pushed it above $70,000 for the first time in more than a month. Bitcoin has been rising since last week's April CPI reading showed inflation eased from the previous month, which could open the door again to lower interest rates in the U.S. Crypto-related equities initially rode the wave higher, but also pulled back on Tuesday. Coinbase and Robinhood , both plays on the trading of cryptocurrencies, were little changed, building on gains of 8% and 9%, respectively, from the previous session. MicroStrategy , which is more of a proxy for the price of bitcoin, fell 4%.\n\nStock Chart Icon Stock chart icon Bitcoin initially jumped with ether on Monday but has since pulled back"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxOOU1QSENDM0FFR2YycG5XX2NObzdvMnBnMnlYUjVTLV9rSURkMW5zQ3haR1gxLWRoc3VYV2M0eHpMMHd3b0ROZlg1RXdiZnpWTml1MGVpVHdvdjRxOFBjWG5PU19KeFFjZHdvdG1pY0VwNWloclNONEZYUmo5R0FIUkVYa1pBR1luUW50dQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Bloomberg Analyst Raises Spot Ethereum ETF Approval Odds to 75%: Will Approvals Happen This Week? - Yahoo Finance",
        "content": "Bloomberg Analyst Raises Spot Ethereum ETF Approval Odds to 75%: Will Approvals Happen This Week?\n\nOn Monday, May 20th, Bloomberg ETF analyst Eric Balchunas posted on X, raising his chances of a spot ETF approval from 25% to 75%. Within an hour, the post received over one million views. Balchunas is regarded as one of the most trusted sources in the crypto ETF space after playing a role in news coverage of the spot Bitcoin ETFs, which were released in January 2024. The update from Balchunas made waves in the crypto markets, causing the price of ETH to skyrocket over 10% within minutes.\n\nDon't Miss:\n\n1 in 4 Americans own a share of Bitcoin according to NASDAQ, how much would $10 get you today ?\n\nIf you invested $1000 in DOGE when Elon Musk first tweeted about it in 2019, here’s how much you’d have today.\n\nBalchunas said that he is \"hearing chatter this afternoon that SEC could be doing a 180 on\" spot Ethereum ETF applications. The SEC has been largely quiet about Ethereum ETFs over the past several months, mainly looking to make a decision on whether ETH should be classified as security or a commodity. Because the SEC has been so quiet, many have taken it as negative for the chances of a spot ETH ETF approval. However, with a final deadline for multiple ETFs on May 23rd and 24th, there is seemingly pressure on the SEC to make decisions before the deadline.\n\nTo add more context to Balchunas' post, he alluded to another tweet from Nate Geraci, a crypto ETF expert. Geraci's tweet noted that the \"SEC must approve both the 19b-4s (exchange rule changes) & S-1s (registration statements) for ETFs to launch. Technically possible for SEC to approve 19b-4s & then slow play S-1s (esp given reported lack of engagement here).\"\n\nEssentially, the SEC could give a partial greenlight to the ETFs, giving them time to take a much closer look at S-1s, which would allow them to better vet the applications to see how compliant they would be. This seems to make the most sense, as the SEC has been in the midst of a large debate surrounding the ETFs that could take more time than previously thought to conclude.\n\nTrending: According to Cathie Wood, holding 6 Ethereum (ETH) could make you a millionaire, here’s why it can be true.\n\nAnother point of context is that ARK and 21Shares recently amended their application to remove staking. The move was likely made in an attempt to make their application more appealing to the SEC. While removing staking is obviously a negative for the ETF, it could play a role in increasing the odds of approval.\n\nThe buzz that Balchnas is hearing must be significant. Less than a week ago, he posted saying that he believes the odds of a spot ETH ETF are \"slim to none\", but has since raised his prediction to 75%.\n\nStory continues\n\nThe path of the Ethereum ETFs does share some similarities with the approval of the spot Bitcoin ETFs, as the SEC was largely quiet in the weeks and days leading up to the approval. While the situations are largely different, it does show that it is entirely possible that the SEC could approve spot ETH ETFs later this week despite relative silence from the SEC.\n\nA spot Ethereum ETF would be a huge milestone for crypto adoption, allowing a whole cast of new investors to access the token and could potentially send ETH to new ATHs above the $4,900 level.\n\nRead Next:\n\nHow much Bitcoin did Michael Saylor says you need to become a millionaire? The number may shock you.\n\nBitcoin has jumped another 45% already this year – how much would you need to get started today?\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nGet the latest stock analysis from Benzinga?\n\nThis article Bloomberg Analyst Raises Spot Ethereum ETF Approval Odds to 75%: Will Approvals Happen This Week? originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    }
]