[
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxQZEpnRlJlcmhyRUV5cmNfMUx2bERRNnV5ZzVjcUpUODlpLVZhdU5XdmNyRDduMFRWTFdnc3ZSM2lncDFLcGxoYkJibHNHazcwd2ZnQzM5ZGczdGhIM2wtbmFueUtIdFlOVTl1WTFuM2FfTFFkR3NxbjR0cmpfREdzQ09mNllHa3BjdlhvdVZ6RXlMY2ZD?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Nov 2023 08:00:00 GMT",
        "title": "Price Analysis: Ethereum Hits 6-Month High on BlackRock ETF Speculation - Crypto Briefing",
        "content": "Share this article\n\nEthereum prices topped $2,050 Thursday, reaching the highest level since May. The rally comes amid rumors that BlackRock may soon file for an Ether ETF.\n\nThe chart shows Ethereum remains in a clear uptrend, with the 50-day SMA and 20-day EMA providing dynamic support.\n\nHowever, the RSI is overbought at 80, signaling the rally may be overextended short-term. This could lead to a pullback or consolidation as the indicator cools off.\n\nUpside resistance may emerge around the current highs and psychological levels above $2,000. Support could be present around the key moving averages.\n\nIf the uptrend continues, Ethereum could target new highs above $2,100. But overbought conditions raise the chance of a correction, which could retest previous lows if the trend shifts bearish.\n\nBlackRock registered the iShares Ethereum Trust this week, sparking speculation it will submit an ETF application to the SEC soon. The asset manager took a similar step before filing for a Bitcoin ETF."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE51c1BkZ3RtY0QxYjVRNDdKeWdHaHdxUlpNaDRuWXVSLUNHQjBEbENUWnB4LWJKb1drdDRKMTJWXzJaNzkzX0JxNTFNSi1yN2lkZWwxOHRJaV8xZXVibHVScXVfcW5pdTluenY0TnpMamxtQktCT1FMUHF2SQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Nov 2023 08:00:00 GMT",
        "title": "BlackRock Ethereum ETF sparks surge in ETH/BTC ratio - CryptoSlate",
        "content": "What is CryptoSlate Alpha? A web3 membership designed to empower you with cutting-edge insights and knowledge, powered by Access Protocol. Learn more ›\n\nConnected to Alpha Welcome! 👋 You are connected to CryptoSlate Alpha. To manage your wallet connection, click the button below.\n\nImportant: You must lock a minimum of 20,000 ACS If you don't have enough, buy ACS on the following exchanges: Coinbase Kucoin Orca\n\nConnect via Access Protocol Access Protocol is a web3 monetization paywall. When users stake ACS, they can access paywalled content. Sign up for Access ›\n\nDisclaimer: By choosing to lock your ACS tokens with CryptoSlate, you accept and recognize that you will be bound by the terms and conditions of your third-party digital wallet provider, as well as any applicable terms and conditions of the Access Foundation. CryptoSlate shall have no responsibility or liability with regard to the provision, access, use, locking, security, integrity, value, or legal status of your ACS Tokens or your digital wallet, including any losses associated with your ACS tokens. It is solely your responsibility to assume the risks associated with locking your ACS tokens with CryptoSlate. For more information, visit our terms page."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiX0FVX3lxTE0zcENXYWNVTFZIYUNRME81aHhxRDd2SDlGR08zZk9UUVJlMjdOd2FRYjZjQlNDcTctSUxmUlNvZGtiMG9uTGhkdEdDbkhucEVPUEQxV2lrQmhvV1JoeU9j0gFnQVVfeXFMUHhkbzcyTUpMSzc5WldURFdGc1I1c0pHSF9GRFNUZFVFTXNfa19oVzVfdGZNT3JxV0w4aUQzZGNxZGJ3Qno0T255d3EySVNfaFhaWXdtRktDTGVDRngzQnlsc3lLQkpLSQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Tops $2,000 for First Time Since July - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEthereum (ETH) has roared past $2,000 for the first time in four months.\n\nAccording to CoinGecko data the second-largest digital asset by market cap was trading for $2,030 at the time of writing—an 8% jump in the past 24 hours.\n\nETH hasn't been this high since July 13. The asset has boomed with Bitcoin (BTC), the biggest coin in the space, which today hit an 18-month high.\n\nWhile ETH hasn't seen the same gains as BTC this year, it is still up significantly—by more 60% since January.\n\nAD\n\nAD\n\nBut like most coins and tokens, Ethereum still has a long way to go before it passes its November 2021 all-time high of $4,878.\n\nBig investors are eying up ETH, though. A report by fund manager CoinShares on Monday said that crypto products related to ETH recently received their biggest inflows—$17.5 million in a week—since August of last year.\n\nEthereum and other major coins and tokens have seen a significant bump in value today as BTC jumps in price. The rally is likely linked to the chance that traditional investors may soon have access to the digital asset market via a spot Bitcoin exchange-traded fund (ETF).\n\nSuch a fund would give investors exposure to crypto via shares that track its price. Major investment firms have been applying to the U.S. Securities and Exchange Commission for a spot Bitcoin ETF for years only to face rejection.\n\nAD\n\nAD\n\nBut analysts at Bloomberg Intelligence said Wednesday that the SEC now has an eight-day window to approve all 12 Bitcoin ETFs filed by major Wall Street firms—including BlackRock—starting from today. This led to a rally in crypto prices.\n\nOther than Bitcoin and Ethereum, other major altcoins are up significantly. Meme coin Pepe (PEPE), which launched earlier this year, is one of the best-performers, having notched up 23% in value in the past day. It's currently trading for $0.00000141.\n\nWhile out of the top 20 coins and tokens, Solana (SOL)—which is one of the top gainers over the past month—continued to rally: it's up over 9% in the past day and is trading hands for $46.58.\n\nEdited by Stacy Elliott."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxNWDZZcUtCRDBjNDFwaDQzNEg2aEs4UFUzdVJOLTl0dUZuQXJrNnlSWm1YTXU4XzY2YmE2YTZudl96R1ZQbkdPbURmRnJnV2xIQVM0VUhrU00tb056NWlKY2Njc3BPTTlhUEJaVnFUQ3Jad2JpWUw1eDFEa0VKQ1E3aGhDLUpmRkpkX25BZk1OUXpsR2RqMTE3dDVGNDdtNmlqam5z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin approaches $38,000 and Ethereum crosses $2,000 as ETF fever continues to buoy the crypto market - Fortune",
        "content": "The world’s largest cryptocurrency by market capitalization continued to push past year-long highs, as Bitcoin approached $38,000 late Thursday morning, an approximately 7% increase in the past 24 hours, according to data from CoinGecko. Its peak of $37,935 was the highest the coin has reached in more than 18 months.\n\nEther, the token for the Ethereum blockchain and second-largest cryptocurrency by market capitalization, was also up, crossing the $2,000 mark for the first time since July on the back of an 8% day-over-day price upswing.\n\nThe market capitalization for all cryptocurrencies increased approximately 5.4% day-over-day to $1.45 trillion, as some of the other largest coins on the market saw large gains as of Thursday morning, including Cardano (8.2%), Solana (9.9%), and Chainlink (12.7%). The movements in the crypto markets far outpaced the stock indices, with the NASDAQ and S&P 500 basically flat over the past 24 hours.\n\nBitcoin’s recent upswing is mainly due to “optimism around a near-term spot Bitcoin ETF approval and a resulting short-squeeze,” Brian Rudick, a senior strategist at crypto trading firm GSR, told Fortune, referring to a Bitcoin-based financial product that traditional investors can trade. And on Thursday morning, BlackRock registered the name “iShares Ethereum Trust” in Delaware, an indication “that it is likely to file a spot ether ETF application soon,” he added.\n\nDavid Lawant, head of research at crypto brokerage and trading platform FalconX, echoed Rudick’s assessment. Bitcoin “continues to perform well as the market focuses on the U.S. spot ETF approval process,” he told Fortune, adding that the “big star of the day” has been Ethereum, following news of BlackRock’s registration of the “iShares Ethereum Trust” name.\n\nhttps://datawrapper.dwcdn.net/ToPGM/2/\n\nThe rapid rise in the prices of major cryptocurrencies continues a month-long rally in the digital assets market. The total market capitalization for all cryptocurrencies has rocketed about 30% since Oct. 9, rising alongside optimism over the likely approval of a spot Bitcoin ETF, or exchange-traded fund.\n\nTraditional investors, who manage trillions of dollars in capital, are largely constrained by the investment products available on portfolio management platforms like Vanguard or TD Ameritrade. If the Securities and Exchange Commission were to approve a spot Bitcoin ETF, which lets traditional investors trade on current Bitcoin prices, crypto industry boosters are betting that tremendous amounts of capital would flow into the Bitcoin—and crypto—markets.\n\nWhile the industry has repeatedly tried and failed to convince the SEC to approve a spot Bitcoin ETF, BlackRock, the largest asset manager in the world, filed an application for its own spot Bitcoin ETF in June. Since then, the crypto markets have rallied, and other financial institutions have filed their own ETF applications, hoping to cash in if the SEC were to approve the application from BlackRock, which has a sterling record of past ETF approvals.\n\nAnd starting Thursday, a brief period for the SEC to approve a spot Bitcoin ETF opened, according to Bloomberg Intelligence analysts, who believe that, even if approvals don’t come in November, there is a 90% chance of approval by January.\n\n“There is significant hype surrounding the recent comments from Bloomberg regarding the ETF ‘window,'” James Butterfill, head of research at CoinShares, told Fortune. “Admittedly, it is always a little worrying when prices rise so sharply. That said, as we enter into this new bull market, it is worth reflecting on the point that we remain well below the all-time-highs seen in 2021.”"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTFAwUVFFM3dJUDlWWjBiYkNsRUNXbXJxMDNHakVIMTM2UUdUTktpZi1zdnBscTdSUlJyZlVCdHhYRVpmRWY0bUtJY254cVpCbTNYMndSX2M1YWFObkFUM3dUX3ZsaHB4WFZOVmhBa1BZckNvaERo0gF8QVVfeXFMTk0zYUJLajQxS3dtc1duT0tPX19GXzFuOU9vdmp6WndmMHprUmEwZUREa0JrX21PWjcyckFsVFZxcm56aGZJaGxuaTVLNnJ6Zm15aWdSbG14aUdDaDB3RGt3M001UW52Qy1SQkVlOGRuNDFBZG0yVDFPSjlidA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Has Gone Deflationary Again—Here's Why and What It Means - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe global Ethereum supply has contracted by just over 4,700 ETH, or about $9.5 million, since Monday, according to data aggregator ultrasound.money.\n\nWhile that figure pales in comparison to the cryptocurrency’s massive $243.4 billion market capitalization, it is nonetheless eyebrow-raising: ETH has not experienced such a prolonged deflationary period in months, and the rally appears to have halted the token’s recent inflationary spiral.\n\nAnd perhaps not coincidentally, the market currently likes what it sees when it comes to Ethereum: Earlier today, ETH touched $2,000 for the first time since July. At writing, the token sits at $2,020, up 6.7% in the last 24 hours.\n\nSo, what’s behind ETH’s deflationary sea change this week? And how long can the momentum be expected to last?\n\nAD\n\nAD\n\nThanks to the fee-burning mechanism that’s governed Ethereum since 2021, the more traffic on the network, the higher gas fees rise. And the higher gas fees rise, the more ETH is “burned” by the network, or permanently removed from circulation. That means increased traffic on the Ethereum network could lead to more ETH being removed from circulation than created on a yearly basis.\n\nIndeed, average gas fees on Ethereum have more than doubled since Sunday, according to Etherscan; at writing, for example, the average Uniswap transaction requires $16.35 worth of gas. Transferring an NFT on Rarible currently costs around $21.77.\n\nBut what accounts for the increase in activity on the network?\n\nAD\n\nAD\n\nNFT trading volume hit a three month high this week. Are degens flipping jpegs again? And are they to thank for Ethereum’s short-term comeback? Probably not, says Alice Kohn, Glassnode’s head ETH analyst—those bumps may be a red herring.\n\n“There has been a surge in NFT-related activities, hinting at a possible resurgence in the NFT market,” Kohn told Decrypt. “However, these activities remain relatively modest compared to the NFT boom witnessed earlier in the year.”\n\nKohn does not believe that this week’s ETH deflation can be attributed to minor fluctuations in NFT trading. Instead, she’s found that the deflation mostly stemmed from another source: altcoins.\n\nEthereum, being the permissionless network that it is, allows for anyone to create a blockchain-based token for just about anything. These tokens, typically of the ERC-20 variety, trade on both centralized and decentralized exchanges, such as Uniswap, and make up a significant portion of the altcoin market.\n\nUniswap currently ranks as the leading gas guzzler on the Ethereum network, per Etherscan, with transactions on the protocol accounting for about 13% of all Ethereum traffic; once-dominant NFT platforms like OpenSea and Blur, which similarly led in gas fees during the NFT bull run, are hardly making a dent these days.\n\n“The latest uptick in network activities, which led to the deflationary turn for the ETH supply, clearly comes from altcoins,” Kohn said. “The latest surge in interest, particularly evident in GameFi tokens, underscores the evolving landscape of the crypto market.”\n\nNumerous ETH-based tokens have enjoyed substantial rallies this week—LINK is up 27.2%, and PEPE is up 12%, for example. Those gains appear to be riding a macro tide that, in the last seven days, also lifted altcoins XRP, Cardano, and Solana by between 11% and 20%—potentially indicating renewed investor interest in Bitcoin alternatives.\n\nSome analysts have predicted that Ethereum’s altcoin-fueled deflationary run this week could signal that the bottom is in for the token, and that ETH is now set to climb towards $3,000. But Kohn isn’t so certain that renewed altcoin interest is strictly a good thing for Ethereum’s short-term health.\n\nAD\n\nAD\n\n“There's a possibility that funds may flow into BTC first and then navigate down the risk curve directly into altcoins, bypassing ETH,” she said. “This could position ETH in a challenging scenario, sandwiched between BTC as the premier crypto asset and more enticing risk-on altcoins.”\n\nDisclaimer The views and opinions expressed by the author are for informational purposes only and do not constitute financial, investment, or other advice."
    }
]