[
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxPdGFsVmNUMjVZQzZHX1Z5eldIYnNIMWNTMl9YUkxSaGxSSmFoYjNpVVl2eHZUQWhvaGhpUGFLOGk2aHJLWnZ5OVg5S2FqMy15bGNOcnZ6OV9JWjZvYzFuTFNMRUhJYnlPVlhIZXRWUlJOSTB2am5kNUlFNmJhdTNDZ1l3U2tVTEhRc3ZjUEFBMnU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Decline in ETH/BTC ratio shows Bitcoin’s rising market dominance - CryptoSlate",
        "content": "What is CryptoSlate Alpha? A web3 membership designed to empower you with cutting-edge insights and knowledge, powered by Access Protocol. Learn more ›\n\nConnected to Alpha Welcome! 👋 You are connected to CryptoSlate Alpha. To manage your wallet connection, click the button below.\n\nImportant: You must lock a minimum of 20,000 ACS If you don't have enough, buy ACS on the following exchanges: Coinbase Kucoin Orca\n\nConnect via Access Protocol Access Protocol is a web3 monetization paywall. When users stake ACS, they can access paywalled content. Sign up for Access ›\n\nDisclaimer: By choosing to lock your ACS tokens with CryptoSlate, you accept and recognize that you will be bound by the terms and conditions of your third-party digital wallet provider, as well as any applicable terms and conditions of the Access Foundation. CryptoSlate shall have no responsibility or liability with regard to the provision, access, use, locking, security, integrity, value, or legal status of your ACS Tokens or your digital wallet, including any losses associated with your ACS tokens. It is solely your responsibility to assume the risks associated with locking your ACS tokens with CryptoSlate. For more information, visit our terms page."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxQZl9FdnFRYXBENjJibTE0cnZtUW15NXU3aUo5eml2TmJCX0V2UFFZeUloM0hHMWtycGtvRTFTUXBvMlUyeTVnX01qVDE0UDcxa0xoVmg5Y3JVNDUwVVduN2h3VTlrbVZkVFRtRU9YYUtjR0NOeGhEcEFuSU43Tl95YmNhc1BQUl9BMjBTX0pB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "SEC opens comment period for Fidelity’s proposed Ethereum ETF - CryptoSlate",
        "content": "The U.S. Securities and Exchange Commission (SEC) began to accept comments on Fidelity’s proposed spot Ethereum ETF through a Nov. 30 filing.\n\nThat filing indicates that the securities agency is now soliciting comments on a proposed rule change from Cboe BZX. If approved, that rule change will allow the exchange to list and trade Fidelity’s Ethereum Fund shares.\n\nThe SEC’s request for comments resembles similar filings regarding other spot crypto ETF proposals. It asks for comments about surveillance, custodianship, and market manipulation, among other matters. Notably, the filing highlights a surveillance sharing agreement that Coinbase and Cboe BZX established in June, a critical component also found in many other pending spot crypto ETF proposals.\n\nThe filing also acknowledges a lack of existing U.S.-regulated and U.S. exchange-traded investments that provide exposure to ETH, whereas European markets already offer regulated investments that provide exposure to spot crypto assets.\n\nDecision likely by March 2024\n\nThe filing sets a timeline for the SEC to approve, disapprove, or start proceedings to determine whether to disapprove the proposed rule change. These comments are considered in the final decision-making process. The SEC is required to reach a decision within 45 days of the current notice’s publication in the federal register; however, the SEC can extend the decision period by up to 90 days and then further by 60 days if necessary.\n\nThough exact deadlines may differ, Bloomberg ETF analyst James Seyffart estimated that the SEC’s next decision deadline for Fidelity will be Jan. 21, 2024, and its final decision will be March 8, 2024. He added that he will have knowledge of “definitive deadlines in the coming weeks.”\n\nFidelity initially filed for its spot Ethereum ETF on Nov. 17, days after its competitor BlackRock filed for an equivalent fund on Nov. 15. Both firms also filed for spot Bitcoin ETFs this summer starting in mid-June.\n\nSeveral other asset managers, including Ark Invest, VanEck, and Grayscale, also have pending spot crypto ETF proposals.\n\nMentioned in this article"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxQUmp0U1l5UmNrLUM1U2hZMWt1SjJGc1pmZm9wSWhMYVhmV29HeU1jQklTSGh0N3NCWThmMUM3NzJ4aTJabjd3dVJqck9NcDZOMFZUU1lQMm9GelBvTEk3cDhOaUNrc2RyQmhrMWVXWUYtSURUYzhvUlVnUjVnQW04OFU0Y29sSXlWcEFF0gGQAUFVX3lxTE1mZ211SkkyTlVXM0g2TFFYU1dHOTcyVmRHMW5xblgtRWpYQUJpS0ZfNHhEZnU4LTlCNmhzZHJTRmZ5R3N0bWZVZ3U1X19pSllZVld1elRTWm9yaVZ3VFhkcGJiVHc3bXIyOEMwdzBrVjdCS3BjYkhjZlJYN2xiNExjcWU3SF9fSTAyZWdxX2lBUA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Legendary Trader Raoul Pal Makes Rare Ethereum vs. Solana Comparison - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nLegendary crypto trader and investor Raoul Pal has waded into the supremacy debate between the two prominent proof-of-stake (PoS) Layer-1 networks Ethereum (ETH) and Solana (SOL). According to Pal, the use of Solana comes with a whole different feel that makes it a top contender as a relatively more user-friendly option.\n\nAdvertisement\n\nHe said once someone starts using Solana, it \"feels super fast, slick, inviting and easy for the user.\" The accolade on Solana underscores the general perception most industry leaders have of the top coin, especially as it has been able to pull off a major comeback in its price action post-FTX implosion.\n\nOnce you play around in the $SOL ecosystem, it feels super fast, slick, inviting and easy for the user.\n\n\n\nThe best comparison is SOL is Apple and ETH is Android.\n\n\n\nBoth win. Huge. — Raoul Pal (@RaoulGMI) November 29, 2023\n\nRaoul Pal is known for his commentary in the industry with a basis rooted deep in on-chain analytics; however, choosing to comment on the combat between Ethereum and Solana on pure fundamentals is considered a rare move.\n\nAdvertisement\n\nIn his analysis, Pal compares Ethereum to the Apple of the blockchain world while he considers Ethereum to be the Android. The connotations are clear as Solana wins the fight for performance based on its speed, while Ethereum's massive hoard of hosted decentralized applications (dApps) makes its Android comparison a well-suited description.\n\nSolana and Ethereum have thriving ecosystems\n\nAlmost everything Ethereum can do, Solana can do as well. It appears that Raoul Pal has broad use of some of Solana's applications, as he attested to the ingenious designs of Phantom Wallet, the most popular unhosted Solana wallet. This he confirmed when an X user asked to know what his feedback is for Phantom Wallet and in his response, he said:\n\nAbsolutely love it. Super easy.\n\nSolana has impressed its holders in a remarkable way, with Raoul Pal confirming he has been bullish all year. The coin soared to its 2023 high earlier this month as it wiggles away from the impacts of the continuous sell-off from FTX, the bankrupt exchange that sought ways to free up funds to pay its investors and creditors."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxPRHBES1c1M0pldUVFcjN6dWFlOHEtLXEwUGMyM2Z5U3paNm9XWkl1bk9fN09tSjdQbVlrRGtJcDVFb1BwQjVHQi0tQ09sdHF3YzlGTUVHYjltSDR2b2pESXZxbmR2Q041Tk5RM2pxY1VfRzNGb1pHcE9hQmxqWXdlOHV1bHBBcHNwWlFvU2ZXZTVQOXFZZnJuR3JzaFdqNUxHY3R6cjBPTmx5MWJ5RHRQTVFKenNyVTdNNjBtaVd6RGtLOXdvZ1FIN2pKNjZYVUp0NUo1Z21n0gHbAUFVX3lxTE11amJQMzBFYWk3S1UzNS1fRjRKWkZHZUJpd2JWMzROemJmdlRVMjhVS1NrRzdnSFJFdk94TTFWRXdoc0d0Um9BNS03UzdzWG1zdXBvYW5GRUdIUlFnQVM1UVVQaDlLek1zY204cndFdl9IQ01ZZTdUUWhzRzJfb2FoZ2ItOVVFQUlFMVFFOHAyTlhFTlVSM0lRSDREX2puc05ldlFMUGh1T0ZjTmdZTlJXZnk4WS1TZ2RPekZUQTB3azBBTzZWYmxyYVZ2UzJzVmtVbW9qWmtfWE52VQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Price Prediction: ETH top-down analysis hints upside is capped at $2,500 - FXStreet",
        "content": "Ethereum price trades in a clear consolidative trend on the weekly time frame between $1,933 and $2,141 barriers.\n\nThe daily chart for ETH shows a sweep of Monday’s high is likely to be followed by a sweep of Monday’s low at $1,985.\n\nIf Bitcoin price undergoes a steep double-digit correction, Ether could also slide to $1,933 and $1,829 support levels.\n\nEthereum (ETH) price shows an ongoing consolidation with no directional bias. But a closer look at the daily chart shows that a potential correction might ensue, especially if Ether is influenced by Bitcoin (BTC).\n\nEthereum price prediction thesis and short-term bias\n\nAccording to Exchange-Traded Fund (ETF) analysts, Bitcoin spot ETF is likely to be approved in January 2024. This development has caused FOMO among market participants, making the overall market outlook resoundingly bullish. Interestingly, this is one of the main drivers of the 2023 bull rally.\n\nRead more: Week Ahead: Bitcoin’s bull trend in question as spot ETF momentum fades\n\nBut as the holiday season begins to kick in, liquidity in the market will diminish. Hence, cryptocurrency prices are likely to face manipulation. Additionally, Bitcoin price has already started to slow down its rally and has flashed multiple sell signals.\n\nIf Bitcoin price faces a minor correction, altcoins will shed double digits easily due to the nature of the connection between the two. Likewise, the Ethereum price will also see a correction to key support levels.\n\nRead more: Bitcoin Weekly Forecast: ETF delay and weekly swing failure could crash BTC to $30,000\n\nThis top-down Ethereum price analysis takes a look at ETH from weekly and daily time frames and forecasts buy-the-dip levels.\n\nEthereum price at critical levels on the weekly chart\n\nEthereum price has been in a multi-month consolidative trend that has produced an ascending triangle setup. While the technical formation is inherently bullish, it is only after a successful breakout. So far, ETH has not produced any discernible breakouts, just failed attempts.\n\nThe ascending triangle setup contains equal highs and higher lows, connected via trend lines. This setup shows that investors are becoming increasingly bullish and buying dips at an increasing rate.\n\nA breakout above the $2,000 psychological level was the first sign of a bullish move, but there has been a lot of back-and-forth around this level. To be precise, ETH is hovering between the second quarter high at $2,141 and weekly support at $1,933. This has been happening for the fourth consecutive week.\n\nWith Bitcoin’s trend weakening and signaling a potential double-digit correction, Ethereum price might also catalyze a downside move to flush early longs. In such a case, ETH might eye a retest of the monthly open at $1,814 and a sweep of the monthly low at $1,782. This move would constitute a 9% to 12% move.\n\nETH/USDT 1-week chart\n\nETH bulls likely to take a backseat soon\n\nThe daily chart for Ethereum price shows more nuanced key levels, some of which coincide with the ones seen on the weekly.\n\nFor starters, this week’s Monday range extends from $2,071 to $1,985. While the Monday high was swept on November 28, investors can expect a sweep of the Monday low in the coming days.\n\nA quick move to the downside with the intention of sweeping Monday’s range could lead to a steep correction, especially if it is backed by BTC bears. In that case, investors need to take a look at the 40% Ethereum price rally witnessed between October 12 and November 10. This upswing created a local top at $2,138, and the midpoint of this move rests at $1,829, which coincides closely with the monthly open at $1,814 and monthly close of $1,782.\n\nAll in all, the $1,750 to $1,850 range seems like a good place to buy the dip if it ever comes to that.\n\nETH/USDT 1-day chart\n\nWhile the short-term bearish or correction outlook is logical, it is completely contingent on Bitcoin’s sell signals. If BTC lures shorts via a minor correction and proceeds to blast through $40,000, it would obliterate short sellers and cause a massive liquidation event that could sustain a move beyond $40,000.\n\nIn such a case, Ethereum price could overcome the $2,232 hurdle and eye a retest of the weekly resistance level at $2,521."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxQV1gyTzZLZUw1RTFwLW5fbXhuenNnS2lpaHl6aklhejJxelhIZkNqS0NvOGdfX2NzbTZCTE1HOHpHbHZJaWNqcVBvRHlpZ05KQVhsT25QT1I1bTJGblJIOEw1d3pObVllRjBzS2FmcnotQ0s4czFFYy1YMjlzVUVqWVRYX1dINkpDMHFZdkFVVEtEeEpPVkZSRElpSFVaRkpxOS16T2xlRG5aV0I1V3BBcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Safeguarding Your Bitcoin & Ethereum: Exploring Multi-Sig Wallets for Enhanced Security - hackernoon.com",
        "content": "Storing crypto on an exchange or a hardware wallet is risky. Instead, you should use a multi-sig setup.\n\n\n\nI used to store mycrypto in hardware wallets like Ledger, but for large amounts, it is still risky. If somebody steals your ledger or its seed phrase, you are doomed. If a fire or earthquake destroys them, you are doomed. I used to keep two copies of seed phrases in different locations for this latter risk. But that poses another risk - what if somebody steals from my second location when I am not present, and I do not know until it’s too late?\n\n\n\n\n\nThe solution is to use a multi-signature wallet, which is a setup in which a threshold of devices must be confirmed to execute a transaction. I put this off for way too long but finally got around to it.\n\n\n\n\n\nBitcoin Multisig\n\nFor Bitcoin, there are two main providers I’d suggest - Casa or Unchained Capital . Both are self-custody, meaning you are the holders of the keys. No FTX-like risk here. Both have also raised much in venture capital and have great customer experiences. I actually spoke to Unchained Capital four years ago when they were just getting started and raising their first round of seed capital. Now, they have raised $100M+.\n\nCasa vs Unchained\n\nCasa costs $250 a year (they also offer more expensive services, which I won’t go into here), while Unchained Capital offers a free tier of service. However, the latter requires KYC while the former does not.\n\nHow It Works\n\nFor Casa, there is an app. You control two of the keys; Casa controls the third. You need 2 of 3 keys to send funds out. Your mobile serves as one key, and a hardware device like a ledger as the other. For the key that Casa controls, you answer security questions that you’d re-enter if you want Casa to sign for you in the future. You would use this if one of your two keys was compromised. Casa would sign after a seven-day buffer. It is highly recommended you write down your answer to the security questions and put it somewhere safe.\n\n\n\n\n\nYou also have the option to use two hardware devices instead of the mobile.\n\n\n\n\n\nUnchained Capital is mostly similar, but they only offer the two hardware wallet solutions, no mobile. Also, while they are free, they charge a $20 co-signature fee if you need to rely on their third key. Since they KYC, they don’t require security questions; hence you don’t need to worry about writing it down and storing it safely somewhere; instead, they can verify via a method like video call when you need them to sign. They have a 72-hour buffer period before signing.\n\nWhile KYC has this convenience, a downside is that if Unchained’s data gets compromised, your identity and crypto holdings will be revealed. To be clear, your crypto would still be safe in such a scenario because you control two of the keys. Alternatively, the downside of Casa with no KYC is that you are responsible for storing the answers to your security questions safely.\n\nFinally, for a higher fee, you can do more complex options like 5 keys and white glove service with either Casa or Unchained.\n\nOne mobile & one hardware wallet or two hardware wallets?\n\nOne Mobile & One Hardware Wallet:\n\nWith mobile, it’s almost always on you, so if somebody steals your hardware wallet, you’ll still have your phone with you, which some may argue adds a degree of safety.\n\nIf you choose to keep one of the hardware wallets in your residence, you can conveniently transact anytime using it and your mobile device. Alternatively, if you choose to keep your hardware wallet separate from your primary residence, you’d need to go there to transact, which is less convenient but arguably even safer.\n\nFinally, if a natural disaster destroys your hardware wallet and phone, you can get back your mobile key from a cloud backup (more later), and use this with Casa’s key to recover your balance.\n\n\n\nTwo Hardware Wallets:\n\nWhile mobile can be convenient, the two-hardware wallet solution is a great option, too, and even more secure for those who don’t expect to transact much if kept in different locations.\n\nIf kept in different locations, you’ll need to bring your first hardware wallet to your second location whenever you need to transact.\n\nSee here by Unchained for different setup ideas for two hardware wallets. The maximum security setup would involve four locations that each have one of your two hardware wallets and two seed phrases. Very secure, but at the cost of inconvenience. A middle ground solution is keeping each pair of hardware wallet + seed phrase in two locations.\n\nIs mobile safe?\n\nYes. The mobile private key is literally on your device in a secure enclave that can’t be accessed by anyone, not even your mobile device manufacturer. This means that even if somebody stole your Casa login credentials and logged in on their phone, they still can’t sign because they need your exact mobile device.\n\nWhat if I change or lose phones?\n\nIt is backed up to iCloud for iPhone and Google Drive for Android and can be re-established on a new phone.\n\nRisk Scenarios:\n\nSomebody steals your two keys: If a thief somehow manages to steal two of your keys (whether it’s two hardware or one mobile and one hardware) and get through the security needed to use those devices, they’d still need to know your login to your multisig provider (Casa or Unchained). This is because signing a transaction requires two private keys, but also the three public keys (note: public key is different from your address; your address is derived from your public key through hashing). The three public keys are accessed automatically through your multisig provider when you log in to transact. Multisig provider goes down: You can send funds out using open-source software like Electrum or Spectrum. This process is called Sovereign Recovery. For Casa, you’d basically export your mobile private key and seed phrase and re-establish your wallet on Electrum or Spectrum using your hardware device, mobile, and the Casa public key. For Unchained, you’d do the same using your two hardware wallets. Both Casa and Unchained provide detailed instructions on their website if this is ever needed.\n\nEthereum Multisig\n\nFor Ethereum, Casa offers an ETH vault that basically uses Safe (rebranded from Gnosis Safe) under the hood and comes for free if you use their BTC vault. However, it does not allow altcoins beyond USDC and Tether yet. Unchained is Bitcoin only by philosophy (something that Bitcoin maxis appreciate) so it does not offer ETH multisig.\n\n\n\n\n\nAlternatively, you can use Safe directly, as it’s free to use, and you can hold any altcoin. It is the dominant DIY open-source multisig solution on Ethereum used by all decentralized orgs. They recently raised $100M on a $1B valuation. I got to be familiar with using it, as my most recent startup nestwallet.xyz was built on the Safe protocol.\n\n\n\n\n\nThe main difference to note between using Casa and Safe directly is that with Safe, you are responsible for safeguarding all your signer devices and their seed phrases, whereas with Casa, you can rely on them to hold one key (Casa key), while the mobile key will be held on your phone and accessed through their app without requiring you to write down a seed phrase (this mobile private key and seed phrase can be exported out, but you’d only do so for Sovereign Recovery).\n\n\n\n\n\nFor Safe, you can set it up however you want, like 2/3 signers, 3/5, 2/2, etc. Safe also has a mobile app that can serve as a key, but as I mentioned above, you’ll have to write down the seed phrase for it in a secure location if you choose to use it. The other signers can be hardware wallets, hot wallets (like Metamask), or a combination. The most important thing is to keep the seed phrases in separate geographic locations.\n\nLet me know what you think\n\nHopefully, this was helpful as you think about safeguarding your own crypto. It’s a question I’ve thought a lot about, and it is important to have a solution that is immune to all the major risks - theft of a single device, natural disaster, or an exchange going down (a la FTX or the multitude of others).\n\n\n\n\n\nUse this as a starting point, but I recommend doing your own research and choosing the setup that best fits your needs. Feel free to reach out to me directly if you have questions, and I’ll do my best to answer them.\n\nAlso published here."
    }
]