[
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMi4wFBVV95cUxNM3c1RktxSVRpcjhMajNCS0kzNUNNOS1KdWdhNW93b1did2RmVmo5U1ZQTEhxSmwwemxjTlgxVThxS1djMmVnaEt4OHdGbm9GRVhMS1hINVd6eThlRG1tQ2UtMnBzVlR2NnV5cU1hY0hnbmlneXNZOHFUdVJOMl9iMTBld2x6N1dLTmphNjJ1VWdzeUNGOG16Vjl0Q3lQbml6NURmVW5HWVVtVkdoQVhabE9KbnZoVE9CMmZPUDF2UkJleld1V3V5QlBWM191MGU4eWdsWTJRMlJTOUZ5UGpTMHZXRQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 08:00:00 GMT",
        "title": "'Family Guy's Latest Episode Shows Meg's Therapist Only Accepts Bitcoin, Ethereum, Dogecoin - Benzinga",
        "content": "The latest episode of ‘Family Guy', the animated sitcom, features a mention of Bitcoin BTC/USD, Ethereum ETH/USD, and Dogecoin DOGE/USD.\n\nWhat Happened: Season 22, episode 8 shows Meg Griffin receiving therapy, only to be told by her therapist that payment must be in either Bitcoin, Dogecoin, or Ethereum.\n\nThe episode portrays the therapist in a state of panic, both accepting and refusing Ethereum and urging immediate payment due to the volatile market with the line. “Not Ethereum—Wait, wait, no, I don’t… I don’t anymore. Wait… yes I do. But you have to send it right now. No, send it again. No. Why did you do that?”\n\nThe therapist also mocks cryptocurrency investing by saying, “Forget real estate. Invest in money you can’t even see.”\n\nWatch the full video here.\n\nSee More: Dogecoin HODLERs Are Beating Shiba Inu With 57% Landing In Profits, IntoTheBlock Data Reveals\n\nWhy It Matters: This isn’t the first time ‘Family Guy’ has brought up Bitcoin. A past episode showed Peter Griffin suggesting Bitcoin as a solution to their financial problems. Lois says, “Peter, every day our savings get smaller and smaller. We’ve really got to figure out a better way to budget for this family,” to which Peter responds with the word \"Bitcoins.\"\n\nThis comes as BTC, ETH, and DOGE surged on Tuesday evening, marking the first significant rally since early April 2022. This surge comes as falling interest rates and increasing expectations for introducing a spot Bitcoin ETF in the U.S. market.\n\nRead Next: Here’s How Much You Should Invest In Shiba Inu Today For A $1M Payday If SHIB Hits 1 Cent?"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMi4wFBVV95cUxNM3c1RktxSVRpcjhMajNCS0kzNUNNOS1KdWdhNW93b1did2RmVmo5U1ZQTEhxSmwwemxjTlgxVThxS1djMmVnaEt4OHdGbm9GRVhMS1hINVd6eThlRG1tQ2UtMnBzVlR2NnV5cU1hY0hnbmlneXNZOHFUdVJOMl9iMTBld2x6N1dLTmphNjJ1VWdzeUNGOG16Vjl0Q3lQbml6NURmVW5HWVVtVkdoQVhabE9KbnZoVE9CMmZPUDF2UkJleld1V3V5QlBWM191MGU4eWdsWTJRMlJTOUZ5UGpTMHZXRQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 08:00:00 GMT",
        "title": "'Family Guy's Latest Episode Shows Meg's Therapist Only Accepts Bitcoin, Ethereum, Dogecoin - Benzinga",
        "content": "The latest episode of ‘Family Guy', the animated sitcom, features a mention of Bitcoin BTC/USD, Ethereum ETH/USD, and Dogecoin DOGE/USD.\n\nWhat Happened: Season 22, episode 8 shows Meg Griffin receiving therapy, only to be told by her therapist that payment must be in either Bitcoin, Dogecoin, or Ethereum.\n\nThe episode portrays the therapist in a state of panic, both accepting and refusing Ethereum and urging immediate payment due to the volatile market with the line. “Not Ethereum—Wait, wait, no, I don’t… I don’t anymore. Wait… yes I do. But you have to send it right now. No, send it again. No. Why did you do that?”\n\nThe therapist also mocks cryptocurrency investing by saying, “Forget real estate. Invest in money you can’t even see.”\n\nWatch the full video here.\n\nSee More: Dogecoin HODLERs Are Beating Shiba Inu With 57% Landing In Profits, IntoTheBlock Data Reveals\n\nWhy It Matters: This isn’t the first time ‘Family Guy’ has brought up Bitcoin. A past episode showed Peter Griffin suggesting Bitcoin as a solution to their financial problems. Lois says, “Peter, every day our savings get smaller and smaller. We’ve really got to figure out a better way to budget for this family,” to which Peter responds with the word \"Bitcoins.\"\n\nThis comes as BTC, ETH, and DOGE surged on Tuesday evening, marking the first significant rally since early April 2022. This surge comes as falling interest rates and increasing expectations for introducing a spot Bitcoin ETF in the U.S. market.\n\nRead Next: Here’s How Much You Should Invest In Shiba Inu Today For A $1M Payday If SHIB Hits 1 Cent?"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMi4wFBVV95cUxNM3c1RktxSVRpcjhMajNCS0kzNUNNOS1KdWdhNW93b1did2RmVmo5U1ZQTEhxSmwwemxjTlgxVThxS1djMmVnaEt4OHdGbm9GRVhMS1hINVd6eThlRG1tQ2UtMnBzVlR2NnV5cU1hY0hnbmlneXNZOHFUdVJOMl9iMTBld2x6N1dLTmphNjJ1VWdzeUNGOG16Vjl0Q3lQbml6NURmVW5HWVVtVkdoQVhabE9KbnZoVE9CMmZPUDF2UkJleld1V3V5QlBWM191MGU4eWdsWTJRMlJTOUZ5UGpTMHZXRQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 08:00:00 GMT",
        "title": "'Family Guy's Latest Episode Shows Meg's Therapist Only Accepts Bitcoin, Ethereum, Dogecoin - Benzinga",
        "content": "The latest episode of ‘Family Guy', the animated sitcom, features a mention of Bitcoin BTC/USD, Ethereum ETH/USD, and Dogecoin DOGE/USD.\n\nWhat Happened: Season 22, episode 8 shows Meg Griffin receiving therapy, only to be told by her therapist that payment must be in either Bitcoin, Dogecoin, or Ethereum.\n\nThe episode portrays the therapist in a state of panic, both accepting and refusing Ethereum and urging immediate payment due to the volatile market with the line. “Not Ethereum—Wait, wait, no, I don’t… I don’t anymore. Wait… yes I do. But you have to send it right now. No, send it again. No. Why did you do that?”\n\nThe therapist also mocks cryptocurrency investing by saying, “Forget real estate. Invest in money you can’t even see.”\n\nWatch the full video here.\n\nSee More: Dogecoin HODLERs Are Beating Shiba Inu With 57% Landing In Profits, IntoTheBlock Data Reveals\n\nWhy It Matters: This isn’t the first time ‘Family Guy’ has brought up Bitcoin. A past episode showed Peter Griffin suggesting Bitcoin as a solution to their financial problems. Lois says, “Peter, every day our savings get smaller and smaller. We’ve really got to figure out a better way to budget for this family,” to which Peter responds with the word \"Bitcoins.\"\n\nThis comes as BTC, ETH, and DOGE surged on Tuesday evening, marking the first significant rally since early April 2022. This surge comes as falling interest rates and increasing expectations for introducing a spot Bitcoin ETF in the U.S. market.\n\nRead Next: Here’s How Much You Should Invest In Shiba Inu Today For A $1M Payday If SHIB Hits 1 Cent?"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxOM3NXTWZHNmVNbGtOYXE3aXpuYkdxQlRIN2ZpeWVBdlhxRVBHWjlITWdWOFI3emJkVnpjclA3c1RPVXB2WTlSeU1hSEVNVWFpWlpVMzZ0N0trS1AzSm04cXRBd1VINE9SOVo3UEdTNDZtNkFLWjlUTHd6T3BGMTBuSmktTG5QY3U2TVEwb3puNlp0UjZhbkxpRVhXR0dOZ3k5a0RXZ3RGSTE0eWpXNFFQVmpmc0UyUXNkRlN2U0xR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 08:00:00 GMT",
        "title": "OKX Ventures Joins Ethereum Climate Platform As a Launch Partner to Advance Sustainability in Web3 - OKX",
        "content": "SINGAPORE, December 6, 2023 -- OKX Ventures, the investment arm of leading crypto exchange and Web3 technology company OKX , today announced that it has joined the Ethereum Climate Platform (ECP) as a launch partner, underscoring its commitment to sustainability and decarbonization in the Web3 ecosystem.\n\nThe ECP is an innovative platform created after the transformative Ethereum Merge, leveraging the best of Web3 and traditional climate finance, technology, structures, and services. The platform is designed to galvanize climate solutions with Web3 innovation and address Ethereum's carbon emissions since its launch in 2015.\n\nOKX Ventures, with the support of the OKX Web3 team, joined a coalition of companies dedicated to expediting decarbonization and amplifying climate action through the deployment of cutting-edge technology and the cultivation of digital environmental assets. These are instrumental in reducing greenhouse gas emissions and fostering enduring environmental and societal benefits. OKX’s rigorous approach to “proof of reserves” demonstrates a commitment to the unique properties of blockchains as a tool to track and validate critical metrics, a principle that is also essential for effective climate investment.\n\nFacilitated by Consensys and climate tech firm Allinfra, other launch partners of the ECP include industry leaders like Microsoft, Polygon and NEAR Foundation.\n\nOKX Ventures Partner Jeff Ren said: \"As an active member of The Nature Conservancy, I'm thrilled that the OKX Ventures and OKX Web3 teams are collaborating with the Ethereum Climate Platform. This partnership underscores our shared commitment to integrating social responsibility and environmental stewardship into Web3 systems globally. We embrace this opportunity and responsibility to pioneer sustainable blockchain innovation to create lasting value for both people and the planet.\"\n\nECP Executive Director Anna Lerner said: \"Through this partnership, the OKX Ventures and Web3 teams are demonstrating their leadership in sustainable innovation across Web3. Its partnership with the Ethereum Climate Platform and support of Gitcoin demonstrate a dedication to ESG principles, open-source collaboration and community support. This partnership also signals a new era of eco-conscious blockchain advancement.\"\n\nOKX Ventures' participation in the ECP sets a new standard for environmentally conscious blockchain advancement in the Web3 space. It is also an important step toward its vision of an open, equitable and sustainable future of Web3."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxQQ3NoazFEMFp5N1JDNjY5Rm1OOWdkYkh0ZUVEek5CVjZpeDB4UDJVRHgwWE0xNVh1ZVVZV1c2SlBIT2tfUXA1MEpsYzVWbGdGN3JGNjBQSmxwb3UxQXBfWWRQcG92TjF6aVMyd1JWZHVVRDBFcmJ1ZTRLd0NVSDg0V2xDT1JwMkVYbmtkVy1hcWFENUVl0gGcAUFVX3lxTFBOWENVeTZSMmR6RGplTzBFOFRsdXJKQ08wSnMzQjZqREtWODdPbmJ0N1BudTM0TXREZUdZZjNWVkpqc0NNTlI3eV8zOF82bGdHUndHQ0N4M1pDdDY4ZVBfM1dNWXpKWE00UDd3RU9WSlVjVXJvTGRtbVZPWjdmc3N3MExOcFF0NHh0cmwwMVhCX2xXZ2I0czZmaEhJaA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Dec 2023 08:00:00 GMT",
        "title": "FaZe Clan Founder Banks Says Ethereum Is 'Large Percentage' of His Net Worth - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIt’s no secret that prominent gaming influencer FaZe Banks loves crypto. Now, he’s buying more.\n\nRichard \"FaZe Banks\" Bengtson is the CEO and co-founder of esports organization and lifestyle brand FaZe Clan. The gamer took to Instagram this week to report his latest crypto purchases and double down on his pro-crypto stance amidst a broader gaming industry where crypto remains a controversial topic.\n\n“Don’t be my typical normie homie and call me asking for plays a year from now when the mainstream media and your mom [are] talking about crypto again,” Banks urged his 2.8 million Instagram followers Tuesday along with a note of Ethereum’s price reaching $2,300, a yearly high.\n\n“Expose yourself now,” Banks continued in a post evangelizing crypto and arguing that potential buyers should look at Bitcoin, Ethereum, and Solana.\n\nAD\n\nAD\n\n“BTC is the safest, ETH is about as safe with slightly more upside in my opinion. My personal favorite. A large percentage of my net worth is in Ethereum,” Banks wrote, adding that in his view, Solana is the “riskiest” of the three cryptocurrencies.\n\n“My money is definitely where my mouth is on this one. Buy it and leave it alone. Chill,” he added.\n\nLike many financial assets and purchases, though, it’s important to note that buying or trading cryptocurrencies comes with risk—and fans should be careful not to take financial advice from influencers or celebrities they follow online. It's often not clear what an influencers motivations may be in promoting a cryptocurrency, NFT project, or any financial asset.\n\nBanks also claimed that he recently spent $200,000 on four altcoins: Prime, Pepe, Mog, and Clouds, the last of which has not yet been officially released.\n\nAD\n\nAD\n\nPrime is the sci-fi NFT card game Parallel’s official token, Pepe is a frog-inspired meme coin which recently rose to a $666 million market cap, and Mog is a meme coin that’s been swirling on Twitter among fans who have paired it with memes of people and animals wearing a specific pair of colorfully-tinted glasses. Clouds is an upcoming token from the Endless Clouds crypto startup that is developing the Treeverse gaming platform.\n\n“These are the first real plays I’ve made since the big market crash,” Banks said, who over the summer also hopped onto the “SocialFi” trend and made over $70,000 by signing up for Friend.tech.\n\nBanks did not immediately respond to Decrypt’s request for comment on his latest crypto purchases.\n\nIt’s worth noting that FaZe Clan’s newly-appointed CEO has been in crypto for years now. Back in 2021, Banks was accused of allegedly pumping and dumping an altcoin he promoted, BankSocial.\n\nAnd a quick glimpse at a wallet connected to Banks called “Banksfucks” currently holds some NFTs from Azuki’s collections, two Bored Apes, four Mutant Ape NFTs, a staggering 72 Otherdeed NFTs for Yuga Labs’ Otherside metaverse game, two Clone X NFTs, and one Doodles NFT, among others. He has also recently boasted of CryptoPunks holdings.\n\nWhile Banks is a crypto and NFT enthusiast, not everyone in FaZe Clan shares this view. The org’s only current female member, Kalei Renay, previously told Decrypt in an interview at TwitchCon that she isn’t a fan of NFTs.\n\n“As a community, everybody hates NFTs,” FaZe Kalei said of gamers. “It’s your money, do whatever, but I don’t care for NFTs. I don’t do crypto, I don’t do any of that. I stay so far away from it.”\n\nAD\n\nAD\n\nEdited by Andrew Hayward"
    }
]