[
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxON0duaWJic05YYVdjVnJSejdKNUZKa0wteE44bHZiNXR2TG13SF9vTWJ1N095Y19rMERDLXY0RG1EVE9OdE9UQjVZS2xsM2dMazVTTE5ILXhEbDV5U2tIRXRob3QxRVdiRGZkMHlkbE5veklkOVRhRThTNjJBZEZKTDE5OElqeXNjd3YxVWJjTDJJa1lFcHdUQzR5aE9PNVhmTF9FNzY5N0ZHZDU4d2N2am5Va0tMZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Dec 2023 08:00:00 GMT",
        "title": "Mantle introduces mETH liquid staking protocol, expanding its Ethereum-based DeFi ecosystem - CryptoSlate",
        "content": "Mantle, the DAO-led web3 ecosystem, today unveiled its Mantle Liquid Staking Protocol (LSP) as a key addition to the Mantle Ecosystem, offering users a novel way to engage with Ethereum’s proof-of-stake (PoS) validator network, according to a statement shared with CryptoSlate.\n\nThe Mantle LSP is a permissionless and non-custodial Ethereum (ETH) liquid staking protocol, functioning on Ethereum L1 and governed by Mantle. It stands as the second core product of the Mantle Ecosystem, following the Mantle Network L2. Mantle posits that the introduction of Mantle Staked Ether (mETH), a value-accumulating receipt token, is a pivotal step in their protocol.\n\nMantle detailed that the genesis of Mantle LSP began with a proposal in a Mantle forum on July 14, 2023. Following the acceptance of the Mantle Governance Proposal MIP-25, the staking of Mantle Treasury ETH was sanctioned, leading to the phased deployment of Mantle LSP. This process culminated in the protocol’s full operational launch on Dec. 4, transitioning it into a Permissionless Mode.\n\nMantle LSP distinguishes itself by offering instant and sustainable rewards. Users staking ETH receive mETH, a token embodying their staked value and accumulated rewards, while also unlocking additional yield opportunities within the Mantle Ecosystem. Mantle states that the ETH to mETH exchange rate is deterministically calculated, thus mitigating the impact of stake size on slippage. Furthermore, mETH is available for trade on various exchanges, with its pricing governed by market dynamics.\n\nMantle emphasizes that their protocol underscores a commitment to user experience, security, and yield optimization. Mantle states its LSP features a streamlined architecture, focusing on the ETH to mETH conversion process on L1, and avoids complexities associated with other PoS tokens and chains. The protocol’s design incorporates robust risk management strategies, including non-custodial core smart contracts and off-chain services that impose strict risk limits. Additionally, Mantle LSP’s security framework involves dividing responsibilities among various roles, ensuring the safeguarding of staked ETH within smart contract addresses.\n\nWith the launch of Mantle LSP, Mantle intends to enhance its DeFi offerings by exploring the adoption of mETH across various applications within its ecosystem and beyond. This expansion aims to bolster the utility and efficiency of mETH, contributing significantly to Mantle’s growth in the DeFi space.\n\nThe broader Mantle ecosystem, anchored in Ethereum technology, now includes the Mantle Network, an Ethereum layer 2 (L2) solution, Mantle Governance, a decentralized autonomous organization (DAO), and Mantle Treasury, one of the largest on-chain treasuries. The ecosystem is facilitated by the Mantle token (MNT), which serves as a product and governance token.\n\nMentioned in this article"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxNRExwcjlPX2hldXQ1ZngtcHhycWpxdTRiTkxod0QxTE5NWGJSMnZjRHVfZ3hrdWUza21lam1kVG8zRmhKcVZtWFNKQ0tYZGlqNWI3N1hPZlNkNmtKai1YdkhKdTBLZjBfaXRaWmFybHBqLUtHQ0RsZ0YycEpmZGFyTHllWFZsU05PWUdKbU5fR183ZTJMSFZhUTNBZzFwOUJQVjNBX0hsVzV3cUxtLXRFNDkwR2YtZHI1d0VUNHY1UHJQdHfSAcgBQVVfeXFMTmkycVlDbWJHZmtVNzhSMEFhVWI4Q09QVW1KR3lHYWZKWldNLXZYbHZVbzVTTDFYaGR2eExMTjNLVTRXRFdfNUtUaldhVFBEbVA1RnJZYjZKdjN6a1pwcUxZOW4xLVpJQXdhbExhdlFRcV85QzJDQ2dPeWVEcXVNSFd2WkZGQjNlMHpYUzFJYTBVdVF4eTloaE1SeFI5cUt6Q3VNT3FuVVNsVU5oeXlwLWpYSE5BeVFnRWdtcGpjNG1nUFh0LTBkdkQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Price Prediction: ETH attempts to flip $2,300 into support - FXStreet",
        "content": "Ethereum price is on a tear, consolidating within a bullish technical formation that promises more gains if sustained.\n\nETH could rise 5% to convert the $2,300 resistance level into a support floor before continuing its upward trajectory.\n\nThe bullish thesis will be invalidated upon a daily candlestick close below the $2,143 support level.\n\nEthereum (ETH) price has been consolidating within an ascending parallel channel since the broader market turned bullish around October 18, pushing north with key drivers including speculation of spot Ether exchange-traded funds (ETFs) launching in the market.\n\nAlso Read: Ethereum price breaks past $2,000 as BlackRock hints at filing for spot Ether ETF\n\nEthereum price eyes 5% rise above the $2,300 support\n\nEthereum (ETH) price is trading with a bullish bias, sustained by an ascending parallel channel. This technical formation promises and delivers more gains for the asset as long as it remains within its confines. However, based on the current outlook, the largest cryptocurrency by trading volume looks ready for a breakout after one attempt already.\n\nTechnical indicators show that Ethereum price still has some upside potential, with the Relative Strength Index (RSI) inclined north at 69 to show momentum is still rising. Its position below 70 is good, suggesting ETH is still not overbought nor ripe for a correction.\n\nSimilarly, the Awesome Oscillator (AO) remains in positive territory with green histogram bars. This points to a strong presence of bulls in the Ether market and could bode well for Ethereum price, depending on how the bulls play their hands.\n\nIncreased buying pressure above current levels could see Ethereum price breakout above the upper boundary of the chart pattern, confirmed by a flip of the $2,300 resistance level into a support level. This would set the tone for Ether to continue its upward trajectory.\n\nETH/USDT 1-day chart\n\nOn-chain metrics support Ethereum price bullish outlook\n\nMultiple on-chain metrics support the bullish thesis for Ethereum price, including the dwindling deposit transactions and the volume of exchange inflows. As a spike in deposit transactions would indicate a rise in short-term selling pressure, the absence thereof shows investors do not have the intention to sell.\n\nThis outlook is corroborated by dwindling exchange inflows, suggesting investors are not moving their ETH holdings to exchanges. There is no effective intention to sell in the near future.\n\nETH Santiment: Deposit transactions, exchange inflows\n\nFurther, the Tether (USDT) stablecoin market capitalization is rising, suggesting fresh capital inflow into the Ether market, interpreted as the intention to buy. The ensuing buying pressure could inspire a prolonged uptrend for Ethereum price.\n\nETH Santiment: USDT market capitalization\n\nConversely, if selling pressure increases, possibly as investors start booking early profits after such a striking climb, Ethereum price could pull south. In such a directional bias, ETH could lose the confluence support between the midline of the channel and the horizontal line at $2,143. A break and close below this level would invalidate the bullish thesis.\n\nFurther south, Ethereum price could extend the fall, potentially going as low as the $2,029 support before a foray into the supply zone turned bullish breaker. A decisive candlestick close below the midline of this zone at $1,935 would confirm the continuation of the downtrend."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxPS3FFaFFJRnJIVEFQOHJveGF5YXlzQzY0LThnTThSdDZUZUtLd1RmTVlYdjBUbVZBM2cwa0k2UzNtUEN2cUkzVkJ2WTd1Vk5oaDZOU2ZnbVp1LUltbDMtOXNKdnFLOElUOUM4b09HVXhXRDUyUWtMWXlxbGdYUFJKajN1c0NvZUtHRWFkVEdpNHFqMmhYN0RhZkZmOA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Dec 2023 08:00:00 GMT",
        "title": "Spain detains aristocrat who allegedly recruited Ethereum developer Virgil Griffith to help North Korea - DLNews",
        "content": "Spanish officials detained Alejandro Cao de Benos, a Spanish aristocrat.\n\nHe allegedly enlisted Ethereum researcher Virgil Griffith to help North Korea evade sanctions.\n\nSpanish officials detained on Thursday a pro-North Korea political activist aristocrat accused of aiding North Korea in circumventing international sanctions through crypto, according to a statement by the Spanish police.\n\nAlejandro Cao de Benos, the founder of advocacy group Korea Friendship Association, was indicted last year by US authorities for allegedly recruiting Ethereum researcher Virgil Griffith to unlawfully provide crypto services to North Korea.\n\n“Such accusations are totally false. There is not a single piece of evidence that proves that I hired or solicited the services of Virgil Griffith,” Cao de Benos said in a public statement posted Sunday on X.\n\nThe police said investigation for his location began in mid-October, when the agents received a tipoff from Interpol indicating that Cao de Benos could be in Spain.\n\nCao de Benos was released after a one-day detention.\n\n“It is a disgrace that the US empire abuses Interpol and Spain to carry out what is purely political persecution,” he said.\n\nEthereum researcher Virgil Griffith\n\nGriffith, a former Ethereum Foundation researcher, was arrested in 2019 after a trip to North Korea to allegedly consult the regime on how to use crypto to evade international sanctions.\n\nHis keynote speech at the Pyongyang conference allegedly contained information on how to bypass sanctions, according to the US Department of Justice.\n\nJoin the community to get our latest stories and updates\n\nBut Griffith’s advocates and his legal team have argued that the presentation did no more than recapitulate widely available information, which could be readily accessed online.\n\nGriffith’s lawyer said that the trip was “the culmination of Virgil’s unique and unfortunate curiosity and obsession with North Korea.”\n\nHe received a 63-month prison sentence last year after pleading guilty to a charge of conspiring to violate the International Emergency Economic Powers Act. The act forbids US citizens from exporting goods, services, or technology to North Korea without a licence from the Treasury’s Office of Foreign Assets Control.\n\nHis lawyer told the Wall Street Journal that Griffith was “sincerely remorseful.”\n\nChristopher Emms dodges the bullet\n\nBritish national Christopher Emms was also charged last year, alongside Cao de Benos, with the conspiracy to help North Korea access crypto. He had attended the same conference as Griffith.\n\nIn June, Emms said he received political asylum in Russia.\n\nAppearing on Russian state media RT yesterday, Emms called Cao de Benos’ detention “politically motivated” and said the “US government doesn’t like when someone stands up to them.”\n\nEmms told Blockworks last year that Cao de Benos contacted him through LinkedIn and invited him to the conference in Pyongyang.\n\n“I did the typical crypto bro thing: I googled it. I checked the Foreign Office website as a UK citizen. I checked the UN website and I didn’t see that speaking at a conference in North Korea was breaking any laws,” Emms said.\n\nThe North Korea trip was “incredibly naive,” Emms said, but “the way we [the crypto industry] approached things was so different than we would right now. There was a lack of clarity on so many things.”\n\nCrypto: North Korea’s ‘treasure sword’\n\nNorth Korea calls crypto its “treasure sword,” according to David Maxwell, senior fellow at the think tank Foundation for the Defense of Democracies, who spoke with DL News in April.\n\nNorth Korea’s crypto arm known as Lazarus Group has stolen at least $3.4 billion in crypto since emerging in 2007, according to calculations by DL News.\n\n“All the money [the North Korean hackers] cash out goes to fund their missile programme,” Erin Plante, vice-president of investigations at Chainalysis, told DL News in April. A report by Recorded Future last week said that North Korea loots enough crypto to fund almost half of its military budget.\n\nLast year, Lazarus hacked a record a $625 million in crypto, raiding the web3 game Axie Infinity.\n\nThat attack, said Plante, was “a turning-point event where suddenly the US National Security Council cared and wanted to hear about it.”"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxPdXotOHNNLUpQUVJFSjcxTVZvbmJfS3B6Yi16eEZ3Q0g0T2stdXNlMHRJSnE0WXhpSi1vT2Z3STlmVGxwMmF1aWRlYnZZS1VmbXFaWXRZMUhGaDZPM2o2YXJwS0N3ZzJ2UlBTWXVVV0FQX1NIRlJUYl9mZG5vZVlpNldyMUw0dkljNEZfZTBaT01uQTJhTVAyV21BVllCd0QxV1FUUnVlT05EbFFxbWpKM29lTVFjQTJTb2ZkQUZ6SkxoWVFZMEVRbUhwOWROdjQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Dec 2023 08:00:00 GMT",
        "title": "Analyst Says Ethereum Price Will Hit $28K Following BlackRock ETF Approval as BTC ETF Token Presale Passes $2M - CryptoPotato",
        "content": "Ethereum will skyrocket in price should BlackRock’s Ethereum spot ETF gain the SEC’s approval, according to analysts. This will result in more than 10x growth based on its current price.\n\nMeanwhile, the Bitcoin ETF Token presale recently hit $2m as analysts provide 10-100x price predictions.\n\nUnprecedented Institutional Captial Anticipated as Key Price Driver\n\nEthereum’s price experienced a notable spike in November when the world’s largest asset manager, BlackRock, doubled down on its crypto efforts, filing for an Ethereum exchange-traded fund.\n\nIf approved, the ETF would be listed on Nasdaq, opening the door to a broad new audience previously deterred from buying ETH for technical, security, or liquidity reasons.\n\nThis would propel cryptocurrency to a legitimate investment opportunity, even for traditional investors. As such, it is no surprise that Ethereum’s price is rising in anticipation, currently at $2.09K, up 15% in the last month.\n\nYet, some analysts are significantly bullish on where Ethereum could be headed in the upcoming market cycle.\n\nIn a breakdown on TheStreet, prominent analyst Austin Arnold said, “The largest asset manager in the world, BlackRock, is now backing both Bitcoin and Ethereum,” suggesting this is of monumental importance for the assets’ future.\n\nHe then considered BlackRock’s assets under management (AUM), how much it may allocate to the ETH ETF, and how this could impact the asset’s market cap.\n\nArnold then discussed a bull case following the ETF approval, contemplating Ethereum could climb to highs of $41,000. However, he stated, “I do not see Ethereum getting that far.”\n\nInstead, the analyst sees a more realistic prediction being $28,000, or $10,000.\n\n“Whether it’s $28,000, $45,000, $10,000, I’d be happy with anything, but I’m a long-term holder,” Arnold concluded.\n\nOne of the factors that he highlighted was the difference in Bitcoin’s and Ethereum’s structure, tokenomics, and utility. He explained, “One’s digital gold, it’s aiming to be a store of value. While Ethereum is like digital oil, used to power a global, decentralized supercomputer, build apps. Just like a car needs gasoline to be able to run, Ethereum is the gas that makes the system work.”\n\nThe analyst also referenced Ethereum’s burn mechanism, which makes the token deflationary by destroying a small part of each transaction fee. Coupled with the incoming ETF liquidity inflows, Arnold believes this could significantly bolster its price.\n\nHowever, he understands there is a ceiling to how far it can go in the next market cycle. “$10,000 ETH is the most realistic scenario,” he said.\n\nThis represents less than a 5x gain from its current price. While this is a significant return for those with large portfolios, it is unlikely to render sufficient returns for those with limited financial resources.\n\nOne alternative with a lot of upside potential is Bitcoin ETF Token, a new trending presale that has raised over $2.1 million in three weeks amid the BlackRock hype.\n\nStake-to-Earn Bitcoin ETF Token ICO Hits $2M Milestone\n\nBitcoin ETF Token is a compelling new project that rewards holders in line with key Bitcoin ETF milestones.\n\nThe project has allocated 25% of its total supply to be burned as Bitcoin ETFs reach five main targets, creating a sense of scarcity and fear of missing out (FOMO) when the hype is highest.\n\nIt also features a 5% burn tax on transactions, reducing by 1% at each milestone. This incentivizes people to hold longer and ensures explosive price action following the project’s IEO.\n\nThese factors make Bitcoin ETF Token deflationary, introducing the scarcity principle into the project, which has been a key driver for Bitcoin’s parabolic price action since its launch in 2009.\n\nAnother exciting factor is its staking mechanism, rewarding its community and incentivizing users to lock up their tokens, further limiting the available supply.\n\nHolders can garner a 118% staking APY, but they must be quick because this decreases as more users stake their tokens.\n\nThe project has experienced significant success lately, with top analysts providing massively bullish predictions. Jacob Bury speculates it will 10x after its launch, while Crypto Boy believes it could 100x.\n\nVisit Bitcoin ETF Token Presale\n\nDisclaimer: The above article is sponsored content; it’s written by a third party. CryptoPotato doesn’t endorse or assume responsibility for the content, advertising, products, quality, accuracy, or other materials on this page. Nothing in it should be construed as financial advice. Readers are strongly advised to verify the information independently and carefully before engaging with any company or project mentioned and do their own research. Investing in cryptocurrencies carries a risk of capital loss, and readers are also advised to consult a professional before making any decisions that may or may not be based on the above-sponsored content.\n\nThe project in the above article is not related to Bitcoin or to a Bitcoin ETF. It’s a completely different token.\n\nReaders are also advised to read CryptoPotato’s full disclaimer."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMibkFVX3lxTE5tMEhzUlVXZk9ibEsyd0RZZC1MNlZCeUlVZnZvUXFlbXFIakVkcUU4WGJWanE5YkRsUlNKVVN2YkdCZmRqOWhZTTdhQjFZd3ZrRXN5YWlfbVhiaVl1SWVZU1h6Umt3RmVlcHMzbU5B?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Dec 2023 08:00:00 GMT",
        "title": "Mantle offers ‘mETH’ to the masses, as a ‘lighter weight Lido’ - Blockworks",
        "content": "After nine months in development, Ethereum layer-2 network Mantle has launched its second core product, Mantle Liquid Staking Protocol (LSP).\n\nThis new protocol, deployed on Mantle and Ethereum mainnet, introduces a non-custodial and permissionless ether liquid staking solution, Mantle Staked Ether (mETH).\n\nMETH acts as a value-accumulating receipt token within the Mantle LSP, very similar to Lido’s staked ether (stETH). Mantle aims to achieve the highest sustainable core yield by exploring maximal extractable value. It also shares yield from the Mantle treasury, according to a statement released Monday.\n\nThe idea for mETH came from Mantle “alchemist” Jordi Alexander, chief information officer at Selini Capital.\n\n“We’ve just created a lighter weight, more modern Lido,” Alexander told Blockworks. He champions the idea of offering a native staking yield on an Ethereum layer-2. The premise is “we should do all of DeFi, but first start by having the 5% yield,” he explained.\n\nThis is the same promise of the planned Blast layer-2, which has attracted deposits of ether (ETH) and stablecoins now topping $750 million over the past two weeks.\n\nBlast, despite its rapid growth and ambitious plans, faces scrutiny over its security model and the centralization concerns related to its reliance on Lido.\n\nRead more: Did Lido fly too close to the sun? Inside the centralization debate\n\n“Kudos to the Blast team because it’s the same idea that I had but just a very different implementation,” said Alexander, who has been advising Mantle since March and serves on investment and treasury committees.\n\n“I was pretty excited [when Blast launched] because they’re educating the market on this idea” of having native staking yield available for DeFi on a layer-2, he said.\n\nThe Mantle LSP development process represents a more traditional, structured approach with a focus on security and integration within its ecosystem.\n\nThe team decided to build a solution from scratch, but also talked to Lido about the idea of white labeling their infrastructure.\n\n“We talked to everybody — we literally went through every single [liquid staking team] out there — including Lido of course — we had multiple chats with them to decide [if] there [is] a way that we can take the easy way out,” Alexander said, adding “we decided to go the hard route, and it’s taken many months to do it properly and get all the audits and everything.”\n\nThe various components of the Mantle LSP have been audited by Hexens, MixBytes, Secure3 and Verilog, and the contract upgradeability is the responsibility of the Mantle Security Council, a 6 of 12 multisig, which is also used for maintenance of the Mantle Network itself.\n\n“If you trust Mantle, it’s the same security,” Alexander said.\n\nUnlike Blast, Mantle LSP doesn’t force anyone to stake or bridge. METH will work just fine on Ethereum mainnet and Alexander stressed that it is an independent product from the Mantle Network.\n\n“There’s some people that just want to stay on [Ethereum] mainnet and we do want to cater to them as well,” but, he adds, “I expect that most of it eventually will get incentivized to move because we’ll make it really juicy to ship it over.”\n\nThese incentives can be seen as a vampire attack on Lido, which Alexander says should appeal to members of the Ethereum community concerned over excessive Lido centralization.\n\nWhat’s cooking in “the mETH lab”?\n\nThe Mantle team has a number of ideas in the works to expand upon the LSP’s use within its network, which will be proposed to holders of the MNT governance token in the coming weeks.\n\nMNT is also used to pay transaction fees on the Mantle Network.\n\nAlexander originally considered mETH as a good candidate for the Mantle gas token — “like a self-replenishing gas,” he said — but ultimately Mantle’s mainnet launch schedule led to the introduction of MNT.\n\nThe team might consider a dual gas token model, make use of account abstraction to reduce user friction, or outline other new utilities for MNT.\n\n“I think we’re going to have it be sort of like ATOM where you get airdrops and it’s kind of like a launch pool token,” Alexander said, referring to the native asset of the Cosmos Hub.\n\nHe agrees with the critique that Ethereum has too many layer-2 networks proliferating, suggesting that most lack a creative new idea.\n\n“Is there something unique or some imagination that’s gone into it instead of just deploying a tenth version of Aave and just doing the same USDT pair or whatever?” he asked rhetorically.\n\nAnd as for the name and its natural association with illicit drugs?\n\n“We’re going to try to just lean into it. I’m going to launch an unofficial meme contest on my Twitter.”\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    }
]