[
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxNMlQ2MVA0aUJXa01sQ2I0bUlrUE5qZlFuenI1eS04OExhbUFuVUdfenphQnpHdTJLZjFNY2duNkVBVkRnSFlJT2JnR2dPS0VDM09CS1RJTHdWa1k2a0VhOTNQUkEzV3k2Uy1sMl9FZjNCX1d6Q251Z1h6TldHTk5Cc1o3MzFFMk1YWXRyTlA5WEtVR1NOSXBGdlp5VGFyXzVhekhXNlgxWmNjY1RJZTNSbXR1aXVjUDVKRDIzVUplY2RBT0g4Y0NyX2JtSlPSAdIBQVVfeXFMTkYweUNZMF9NamdTUWlod2MzRkJjWWV6alloZ1RnSWVJSHoxS21rbllHdXFRblVYYWxOMzcza0UwWl9kcFRrUENLdlBLWHVGUTZkT3NtdFctanRLcnU4cE5qV0FKYWdYZlJPVlZIaW85TTV6eGw3NVBpRWxUMGZVT1FFRWlRR2dubklYTWY4anFscmJvSWdwQ1Z0MDFjY25RbnZSZFlsMWFOampyS3M1ZVdHaHFGMURwUllNUzltdUJRajN5bzM4bFVVakZtekUxYjB3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 09 Dec 2023 08:00:00 GMT",
        "title": "Investment Giant VanEck Predicts Solana (SOL) Will Become Top Three Blockchain by Market Cap in 2024 - The Daily Hodl",
        "content": "Crypto analysts at the investment management giant VanEck are predicting big things for the Ethereum (ETH) competitor Solana (SOL) in 2024.\n\nMatthew Sigel, VanEck’s head of digital assets research, and Patrick Bush, a digital assets senior investment analyst, predict that Ethereum will lose market share to Solana next year due to the latter project having “less uncertainty surrounding their scalability roadmap.”\n\nThe analysts also predict that Solana will rise to become a top-three blockchain by market cap, total value locked (TVL) and active users.\n\nThe TVL of a blockchain represents the total capital held within its smart contracts. TVL is calculated by multiplying the amount of collateral locked into the network by the current value of the assets. Solana currently ranks sixth among chains in terms of TVL, according to the decentralized finance aggregator DeFi Llama.\n\nSigel and Bush also predict that Solana will join the race for exchange-traded funds (ETFs) in the United States. So far, financial firms have filed with the Securities and Exchange Commission (SEC) for spot Bitcoin (BTC) and Ethereum ETFs.\n\nSOL is trading at $74.05 at time of writing. The sixth-ranked crypto asset by market cap is up more than 6.65% in the past 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxNZURJNm4xWHFzNnRzX29hUE45ZUQzcVdqQ0Z6dDBITG1wMEI5djA0ZWZ2djhPUUpCQ2xkdGJ2OFhEdFpkWDRaazd1ejRBUEM2N0pHQUZwYWlRMVBFZ0hiWlF3VDBEakJBMHlaTWtUcy1FRC1LZjY5NTVRNHVVTmtNb0lESHd1UFRza2VyRzFtV2lGLUl1T3dGRnRsWWtsT2hHdXNpT2VyOWtIcEQxSmhXYTRhaGxXMDJxSkhtVi1xbzJJMHBqNGU1WlpHV2taRXlMSkxFcWRCRdIB3AFBVV95cUxOUV9GX2hzLTFTcHZlNUl1NG5IYTYtVWRuTm43NWpvTzBHbEQyOE9DdTZyM1lJZHRTMktTVERMNHkxTjFLTzBraWFLT3VZQnd3VU1pd1VUdEhkMkowME4wWk03eUtnb3UxTklyeXBDMlk4bE1FVW5IeHlmcTVhTHBQU2JoUTVaRUdoWk04OVhVSnZaT2JDbmtTcGpvNm82S20weVBNQzZibXBMYkpmOGZPRG0wWW55dm4yNjE3Q18wNFNnbktvdllXX1hVM1JNanlISEFZbEg3R09nUVBz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 09 Dec 2023 08:00:00 GMT",
        "title": "Cardano, Solana and Algorand see one of the highest social dominance days in 2023 - FXStreet",
        "content": "Altcoins Cardano, Solana and Algorand noted a spike in their social dominance in the past 24 hours.\n\nADA, SOL and OP social dominance marked one of the highest levels seen in 2023.\n\nAnalysts at crypto intelligence tracker Santiment recommend proceeding with caution when trading in these assets.\n\nBased on data from crypto intelligence tracker Santiment, altcoins like Cardano, Solana and Algorand noted an increase in their social dominance. Amidst a market wide crypto rally, these assets were most mentioned among traders on social media platforms like X.\n\nAlso read: Bitcoin analyst calls early bull market as BTC price targets $50,000 in December\n\nSocial dominance in ADA, SOL, OP marks an increase\n\nBitcoin price rallied closer to the $45,000 mark, fueling market participants with optimism and driving altcoin prices higher. Cardano (ADA), Solana (SOL) and Algorand (ALGO) ranked in popularity among traders, indicated by a spike in their social dominance.\n\nThe social dominance of these assets marked one of the highest levels in 2023, and this implies traders should be cautious when opening a position in ADA, SOL or ALGO, according to Santiment analysts.\n\nSocial discussions are a key metric that help determine the relevance and adoption of an asset among traders. Cardano’s social discussion is at a six month high, Solana and Algorand’s social discussion rates are at a two month and three month high respectively.\n\nADA, SOL, ALGO social dominance climbs\n\nThe development implies there is a Fear Of Missing Out (FOMO) altcoin price rallies, among traders, making it important for investors to proceed with caution when trading these assets.\n\nOne of the likely catalysts driving this increase in social discussions is Robinhood’s introduction of commission free trading for the European Union region. The cryptocurrency trade platform introduced EU traders to Solana, Polygon and Cardano, among other cryptocurrencies as part of its strategic move.\n\nRising demand from traders has likely fueled gains in altcoins like ADA, SOL and ALGO."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxQM0hhQ1RUVUdtVV83VGtjZXVPOTBDVm9oSHdwZWZianU4WnZQelJHMDRicUJ4S25nTzZYZUJTMVpLZTVNbURKVkowZlByS2xMRVpyVEVuNEFjbGI0NDYxRmViWlVtMDg0SnQ1QmJmYmdzMm9YOEFzM09tZEpBMjJOa1g5QlNHT0l2WDB2cnQxajcxYk9wWll5Y1Zqa2NwWGdVUERGX3FZMEw5NG9BUUthODlhOEduckFaOVRzTzJ5N1luckZZYkNJWXRJUTZtZUxOa1RPM9IB2gFBVV95cUxQRDVXNVZ1UHNJbnhQNGdSdlFac3Z2SDZMVzJGdVREV1BoMGxvMHpSOTdxb3NHRS04LThybThfNWlkTEU0Sk9SWUZfYm9FU3Byd3pNNHNYejE1aldnUTJkeXdKTXNwWC1SS0hhakdjaEtRVnVtcFNQRjlnckFCMWt6ekVVbDg4OXBjdm80V3c2STN4ekZZdDMxWlJqUlhaWS1RN2lFNHg5TXZ4VzdZQzE1aGl1b0JKakVEVE1QZi1jQ3FFRmlGRnl3ZXM5Q0tJcmE1MzhiZFhpbC11dw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 09 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Rival That’s Exploded Over 600% Year-to-Date on the Cusp of Another Bullish Breakout, Says Analyst - The Daily Hodl",
        "content": "Crypto analyst Ali Martinez is expressing bullish sentiment on Solana (SOL) amid triple-digit-percentage gains by the Ethereum (ETH) competitor this year.\n\nMartinez tells his 34,500 followers on the X social media platform that Solana could surge by around 25% from the current level if the bullish momentum is maintained.\n\n“A sustained close above $68.20 will trigger a bullish breakout toward $90. But watch out for the $60 support! Any sign of weakness around this level can trigger a spike in profit-taking that sends SOL to $47.”\n\nSolana is trading at $71.68 at time of writing – up by around 619% from the 2023 opening price of $9.97.\n\nTurning to Bitcoin (BTC), Martinez outlines key support and resistance areas that Bitcoin could test over the short term.\n\n“Bitcoin sits on stable support at $42,700. This level is significant, as 642,000 wallets have bought 347,000 BTC here.\n\nShould the bullish trend continue, we might see a push toward the next major supply zone at $47,300, where 614,000 wallets hold 427,000 BTC.\n\nHowever, if the $42,700 support breaks, all eyes will turn to the $38,000 mark as the next critical area to watch.”\n\nBitcoin is trading at $43,423 at time of writing.\n\nTurning to Chainlink (LINK), Martinez urges investors and traders to be cautious about the leading blockchain oracle.\n\n“Chainlink trades above a key support zone! Over 17,000 addresses bought 47 million LINK between $14.40 and $14.80.\n\nWhile this level may hold and trigger a rebound, you must watch out! Any signs of weakness could encourage investors to sell some of their LINK holdings to avoid incurring losses.”\n\nChainlink is trading at $16.42 at time of writing.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMia0FVX3lxTFBTTHQ1OWFVenRTNlpsM2I2MnoxcVFDU1dHZnBfWjhId1pDNlJDd2d1ZklVMEV4anZZS2ZMaDhCT3dwVWlNd2lBYURKWlNrU0VsRm1RYmdPSEpwbGVJRUVsTjRzQ0ZTaVB4aFN3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 09 Dec 2023 08:00:00 GMT",
        "title": "Funding Wrap: Bitcoin, Ethereum-based projects see fresh capital - Blockworks",
        "content": "Developers working with the two largest cryptocurrencies capitalized on early bull market intrigue.\n\nRecently, there has been a notable increase in funding interest towards bitcoin mining companies. However, this week’s most substantial investment influx was directed at projects developing practical applications for the cryptocurrency.\n\nIn a parallel trend, various projects focused on scaling Ethereum have also secured considerable support recently. This surge in investment comes as the network gears up for its anticipated Dencun upgrade, scheduled for next year.\n\nBabylon raised $18 million in a Series A led by Polychain and Hack VC. The company focuses on a unique protocol that allows Bitcoin to be used for staking in proof-of-stake networks. It offers a secure way for bitcoin holders to earn yields without needing third-party trust or bridging to other chains.\n\nRead more: Core devs rule out Dencun fork this year\n\nElsewhere, MAP Protocol, a layer-2 chain built on Bitcoin, announced a strategic investment from Waterdrip Capital. MAP is a Bitcoin layer-2 solution that seeks to enhance cross-chain interoperability. It enables seamless interaction between Bitcoin and other public blockchain networks, ensuring secure and efficient transactions across different platforms.\n\nBitcoin investment firm Swan Bitcoin said Thursday that it raised and spent $205 million in 2023 via its equity, credit and hedge funds. The company also said it plans to raise an additional $150 million as it builds out an institutional offering.\n\nRead more: Institutional custody of bitcoin could kill it, cautions Hayes\n\nOn the Ethereum side, Paradigm led a $9 million seed round in on-chain data platform Shadow. The engineering company streamlines on-chain data access by enabling efficient retrieval from contracts and transactions, and optimizing indexing. Its approach of moving event logs to shadow forks reduces gas costs and contract sizes, offering a cost-effective solution for blockchain data management.\n\nTen announced a $7.5 million raise for its encryption-focused layer-2, while another startup named Versatus said it closed a $2.3 million seed round for its “stateless” Ethereum rollup.\n\nDeFi platform shunts VC backing in favor of ‘aligned’ investors\n\nLending and borrowing app Curvance closed a $3.6 million seed round this week that was noticeably thin on venture capital investment. The protocol mostly raised funds from a group of DeFi and DAO actors, including Offchain Labs and Wormhole.\n\nThe platform’s co-founder Chris Carapola said Curvance capped investment in the token sale at $250,000 per party and hopes to soon turn governance over to a DAO. By capping token sale investments, Carapola suggested Curvance was trying to prevent major voting inequality within the DAO.\n\nCurvance drew interest from venture capital, Carapola said, but decided to primarily raise funds from actors in its ecosystem instead, taking over a year to do so.\n\n“I would say the consistent thing that we saw was, ‘This sounds amazing. How much can we get, and can you increase the round, can we play with the [valuation], do you want to do a Series A,’ like the more conventional route. And as soon as that really became the topic, it was like, ‘you know you’re not aligned, right?’” Carapola said.\n\nCurvance raised its seed round at a $56 million valuation and its private round at a $75 million valuation, Carapola said.\n\nOther notable fundraises\n\nAnimoca Brands raised an $11.8 million funding tranche to develop its Mocaverse “Frequent Player Program” with participation from Block1, OKX Ventures, Foresight Ventures, Polygon Ventures, Dapper Labs and others.\n\nWeb3 music streaming platform Sona raised $6.9 million from Polychain Capital, Haun Ventures and Rogue Capital.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMia0FVX3lxTFBTTHQ1OWFVenRTNlpsM2I2MnoxcVFDU1dHZnBfWjhId1pDNlJDd2d1ZklVMEV4anZZS2ZMaDhCT3dwVWlNd2lBYURKWlNrU0VsRm1RYmdPSEpwbGVJRUVsTjRzQ0ZTaVB4aFN3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 09 Dec 2023 08:00:00 GMT",
        "title": "Funding Wrap: Bitcoin, Ethereum-based projects see fresh capital - Blockworks",
        "content": "Developers working with the two largest cryptocurrencies capitalized on early bull market intrigue.\n\nRecently, there has been a notable increase in funding interest towards bitcoin mining companies. However, this week’s most substantial investment influx was directed at projects developing practical applications for the cryptocurrency.\n\nIn a parallel trend, various projects focused on scaling Ethereum have also secured considerable support recently. This surge in investment comes as the network gears up for its anticipated Dencun upgrade, scheduled for next year.\n\nBabylon raised $18 million in a Series A led by Polychain and Hack VC. The company focuses on a unique protocol that allows Bitcoin to be used for staking in proof-of-stake networks. It offers a secure way for bitcoin holders to earn yields without needing third-party trust or bridging to other chains.\n\nRead more: Core devs rule out Dencun fork this year\n\nElsewhere, MAP Protocol, a layer-2 chain built on Bitcoin, announced a strategic investment from Waterdrip Capital. MAP is a Bitcoin layer-2 solution that seeks to enhance cross-chain interoperability. It enables seamless interaction between Bitcoin and other public blockchain networks, ensuring secure and efficient transactions across different platforms.\n\nBitcoin investment firm Swan Bitcoin said Thursday that it raised and spent $205 million in 2023 via its equity, credit and hedge funds. The company also said it plans to raise an additional $150 million as it builds out an institutional offering.\n\nRead more: Institutional custody of bitcoin could kill it, cautions Hayes\n\nOn the Ethereum side, Paradigm led a $9 million seed round in on-chain data platform Shadow. The engineering company streamlines on-chain data access by enabling efficient retrieval from contracts and transactions, and optimizing indexing. Its approach of moving event logs to shadow forks reduces gas costs and contract sizes, offering a cost-effective solution for blockchain data management.\n\nTen announced a $7.5 million raise for its encryption-focused layer-2, while another startup named Versatus said it closed a $2.3 million seed round for its “stateless” Ethereum rollup.\n\nDeFi platform shunts VC backing in favor of ‘aligned’ investors\n\nLending and borrowing app Curvance closed a $3.6 million seed round this week that was noticeably thin on venture capital investment. The protocol mostly raised funds from a group of DeFi and DAO actors, including Offchain Labs and Wormhole.\n\nThe platform’s co-founder Chris Carapola said Curvance capped investment in the token sale at $250,000 per party and hopes to soon turn governance over to a DAO. By capping token sale investments, Carapola suggested Curvance was trying to prevent major voting inequality within the DAO.\n\nCurvance drew interest from venture capital, Carapola said, but decided to primarily raise funds from actors in its ecosystem instead, taking over a year to do so.\n\n“I would say the consistent thing that we saw was, ‘This sounds amazing. How much can we get, and can you increase the round, can we play with the [valuation], do you want to do a Series A,’ like the more conventional route. And as soon as that really became the topic, it was like, ‘you know you’re not aligned, right?’” Carapola said.\n\nCurvance raised its seed round at a $56 million valuation and its private round at a $75 million valuation, Carapola said.\n\nOther notable fundraises\n\nAnimoca Brands raised an $11.8 million funding tranche to develop its Mocaverse “Frequent Player Program” with participation from Block1, OKX Ventures, Foresight Ventures, Polygon Ventures, Dapper Labs and others.\n\nWeb3 music streaming platform Sona raised $6.9 million from Polychain Capital, Haun Ventures and Rogue Capital.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    }
]