[
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxPb1JsSGc4TENONXBFMUtPUXQ2ZXp2ZHNETUFiNmk5RHotOUFhZk9mZnlHemxXaGxiclJDc19iWWNucU1vczJEdnp1T2xLTzlaejUwU0tPSDhEazJBYW12bk1BbGZpS2R5Ym9UVjFBdVFmTVR5VTBKNDlHbmNLQ1F3Y0lQYUw3Qk5CS0QzLUN0RWsySUsyTHfSAZsBQVVfeXFMTkVTalZ0LS1xWXNJSHNrZTcxZVg1VUtFT21GNi1IVVRzY3lXSVA3QnloRlFKQXM1SkFSZ1huYUQtWTVDMEFhWTU4ekFtNFFOTV9zaG5rTlB6OUpqa29FUVQxR29FSnN5MlA4V1ZZeWstTkE4ZnFNRXRqUHR6a1VKZEZocUktb1Vpam1iOGV5R3JSTnpTVmRBX2hvZGM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 25 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin (BTC), Ethereum (ETH), Solana (SOL) and Cardano (ADA) Funds See Fresh Inflows - U.Today",
        "content": "Advertisement\n\nAccording to the latest financial report by CoinShares, the cryptocurrency market has experienced a significant influx of funds across various digital assets.\n\nBitcoin (BTC) remains the top gainer, with a reported weekly flow of $87.6 million, contributing to a year-to-date (YTD) increase of $1.8 billion, per data available up to Dec. 23.\n\nEthereum (ETH), Solana (SOL) and Cardano (ADA) also reported positive inflows. This indicates a continued interest in a diversified range of cryptocurrencies beyond the leading digital currency.\n\nTop cryptocurrencies by inflow\n\nBitcoin, the pioneering cryptocurrency, leads the charge with impressive inflows that overshadow its counterparts.\n\nAdvertisement\n\nThe digital asset's performance is a significant contributor to the total weekly inflow of $102.7 million into cryptocurrency funds.\n\nEthereum trails with a weekly inflow of $7.9 million, while Solana and Cardano follow suit, registering inflows of $6.0 million and $1.0 million, respectively.\n\nAmong the providers, Grayscale Investments LLC maintained a steady position with no new inflows or outflows, while CoinShares XBT saw a decrease in weekly flows by $9.8 million.\n\nHowever, 21Shares AG and Purpose Investments Inc ETF showed robust growth, with 21Shares leading the monthly inflow with $34.4 million.\n\nLeading countries by inflows\n\nIn terms of geographical distribution, Canada emerged as the frontrunner with a weekly inflow of $25.8 million into crypto funds, contributing to a significant YTD growth of $494 million.\n\nGermany and the United States also showed strong performance with weekly inflows of $41.6 million and $20.4 million, respectively.\n\nNotably, Sweden experienced a downturn with a weekly outflow of $8.7 million. The flow of funds across these countries underscores the global nature of the cryptocurrency market and reflects varying investor sentiment in different regions."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxQQVFfYnZhX1V1Mi0yX2pXYkNlcFJDVVdZVmJjelRraXAxZEJwOTAyb0pOSjBPQVNWWHlWaDFLRU5KTU1iTHh4VDFJRzBYUWd3cjNNekV0alVCWm1RY1Jsbk5mSWowSG94RVBxZER3MDZIbnExZDkyZWk1aFROMnBhNEhCanZVYXNlajJUOW1VcDI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 25 Dec 2023 08:00:00 GMT",
        "title": "Solana surpasses Bitcoin and Ethereum in weekend trading volume - CryptoSlate",
        "content": "Crypto traders’ interest in Solana remains very high as the trading volume for the digital asset surpassed that of Bitcoin and Ethereum on major centralized exchanges during the weekend.\n\nConor Grogan, a director at Coinbase, first pointed out this milestone on Dec. 24, saying SOL saw more trading than the combination of the top two largest cryptocurrencies by market capitalization.\n\nRiyad Carey, an analyst with Paris-based crypto intelligence platform Kaiko, further corroborated this finding, saying the same trend was observed on Kraken and Gemini, two of the largest U.S.-based crypto trading platforms.\n\nSOL’s trading volume also beat BTC and ETH on UPbit and MEXC for the past 2 and 3 days, respectively.\n\nCarey further shared a chart showing that SOL’s trading activities, compared to ETH and BTC, were experiencing an uptrend. According to the chart, SOL trading is approaching 40% of trading activities on centralized crypto platforms, while ETH and BTC were declining.\n\nAccording to Carey, these metrics are “unprecedented” and show the sustained interest SOL is currently generating in the market.\n\nWhy SOL volume is rising\n\nOver the past year, Solana has experienced remarkable growth, defying earlier associations with Sam Bankman-Fried, the disgraced founder of the bankrupt FTX cryptocurrency exchange. Despite this, the network has flourished, attracting an expanding user base.\n\nDuring this period, Solana forged strategic alliances with renowned global financial players like Visa and Shopify. These partnerships harness blockchain technology to streamline payment procedures, showcasing SOL’s network’s potential to a broader global audience.\n\nMoreover, the recent surge in interest surrounding the Solana-based BONK memecoin and the resurgence of decentralized finance (DeFi) activities on the smart contract-enabled blockchain have contributed significantly to its recent upward trajectory.\n\nThese developments have helped push the price of SOL to new highs, up more than 800% on the year-to-date metric to nearly $120 as of press time, according to CryptoSlate’s data.\n\nMentioned in this article"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxOV2dpT1pERkVXRUhIb1ZxTXhEaThxTlBpMTA0dzdOXy1ZQVJvSTZBNkR6R2w3SVF6TlZLUEl6NlN3SmlZbmxTVVYxZW9JdnNYdzdnME1sR1QtNUZENVg3WExSV21lYUNyOE5PTTZVNzJvOUVaQ0wzbFpzbmNKLU1RSjVBTURoNy1INlpDcF82OE02cW5vbXc0V2dtVmtaWmRST0U5UV9jbld6eUY5ZHRPTWIyeEFuOGZfZzdfd0hnaHRpSTB5dXZNOGI3d21GZGNMamZ1aNIB2gFBVV95cUxQT3RQaHBEZVRhSjVYVEEwcFJTNTJQMkFZSEt6Y2gzeTdRU21qUGtfczcyQks2OUtCY09LUm9nRHFkY0RkU183MWFrMHE5ZTNkU0Z3eE9mYVdTQUlMS1BoQWNRVFR2czdPTjdkaTVBanZTY0d5Ul9JNGdZM29rR1JYTzJvNjlhTkltRVVreVl6ZmNuRHNPLVMtWVg0UnMwNE9OT09MdndqamhTclNGeDRKVXU3UnJ4WEE2ZHQ4cmVvQjVDY2NOZnhoTkVqMVJZaG9oUndaQ0I1SVJ5UQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 25 Dec 2023 08:00:00 GMT",
        "title": "Solana Surges Nearly 83% in a Week As SOL’s Decentralized Exchange Volumes Now Rank Second After Ethereum’s - The Daily Hodl",
        "content": "New data from decentralized finance (DeFi) tracker DeFi Llama reveals that surging altcoin Solana (SOL) is now the top traded digital asset on decentralized exchanges (DEXs) behind Ethereum (ETH).\n\nSolana’s trading DEX volume has soared by more than 25% in the past week for a total of $5.6 billion, catapulting it into the second highest traded digital asset on DEXs, according to DeFi Llama. On December 13th, Solana ranked just fourth by DEX trading volume.\n\nEthereum is the top traded DEX asset with $8.89 billion in trading volume in the past week.\n\nIn the past 24 hours, Solana’s DEX trading volume totaled $895.9 million compared to ETH’s 1.07 billion.\n\nSolana is trading for $122.32 at time of writing, a 7.73% gain during the last 24 hours and a massive increase of over 1,000% since the start of the year.\n\nAs the ETH competitor’s value surges, the network is gaining participants. Last week, stablecoin issuer Paxos announced its expansion to the Solana network after exclusively working with the top smart contract platform.\n\nThe New York-based crypto firm will release its dollar-pegged crypto asset, Pax Dollar (USDP), over the Solana blockchain starting January 17th, 2024.\n\nAs stated by Raj Gokal, co-founder of Solana, in a press release,\n\n“Paxos’s decision to bring stablecoin issuance to the Solana blockchain will showcase how Solana’s high-performance network and low transaction fees can support regulated financial products and provide leaders like Paxos new ways to scale and innovate”\n\nSolana has also seen high interest in its Web3 smartphone, Saga, which recently sold out after sales began in April. Buying Saga came with a reward of free Bonk (BONK), a surging meme coin built over Solana.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Rattanamanee Patpong/WhiteBarbie"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxON09wZDFRaGhkaWg1RFY1TUFLOXdNVC01bGRGRXpIWGFiTEo3VTd0elhBWGpydXMyZDJRYXFfaGt6d0hyVUdXd1NSZmhSRkQ5cC1UNko0SkRseWlKYlRvU1hsUnVoNmVDbnFfR05kakN6Q01sSkRaSEh1akd4TE1Zdm9pemxGZ2ZBQU5FaWwyRjVwSERVVkJMVTVRZ1lMMHFOV2FhOA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 25 Dec 2023 08:00:00 GMT",
        "title": "Crypto: Solana Crushes Bitcoin and Ethereum in Volumes and Soars to $115 - Cointribune EN",
        "content": "Mon 25 Dec 2023 ▪ 3 min read ▪ by Fenelon L.\n\nThe Solana blockchain has been in full euphoria for the past few days, with SOL surpassing $100 this weekend for the first time since April 2022. Driven by a record trading volume, Solana vastly outperforms Bitcoin and Ethereum.\n\nSolana and the crypto comeback of the year\n\nThe Solana network continues to attract new users and investors. Over the last 24 hours, the spot trading volume of SOL/USDT reached an impressive $1.037 billion on Binance, surpassing that of Bitcoin and Ethereum.\n\nSimultaneously, the volume of SOL futures contracts exploded to $4.7 billion on the platform, well beyond BTC and ETH. Solana thus confirms its position as the most traded crypto of the moment on Binance.\n\nThis frenzied enthusiasm for the decentralized network mechanically boosts the price of SOL, which has increased by over 25% in 24 hours to reach $115. The market capitalization is now flirting with $45 billion, which propels Solana to the 4th rank of cryptos, ahead of BNB.\n\nRegained Trust\n\nThis spectacular rise attests to the renewed investor confidence in this ambitious project after a disastrous year in 2022. Let’s remember that SOL’s price had plummeted by more than 96% between its historical high of $260 in November 2021 and its June 2022 low.\n\nThe FTX debacle and the legal troubles of its former head Sam Bankman-Fried, an avid supporter of Solana, had then cast doubt on its viability. But since then, the resilience and vitality of Solana’s decentralized applications have burnished its reputation.\n\nThe resilience shown by Solana in recent months has proven the solidity of its fundamentals. Moreover, the enthusiasm for decentralized applications built on Solana continues to grow, as seen in the success of Play-to-Earn games like Star Atlas.\n\nSolana also owes its success to the dynamism of its native token ecosystem. Viral coins like BONK and Dogewifhat (WIF) have been lighting up the network for the past few weeks. Last week, the weekly volume of DEX on Solana even eclipsed that of Ethereum for the first time!\n\nThus, despite still being highly volatile, the future seems brighter than ever for the “Ethereum killer” and its SOL token, now firmly anchored in the top 5 cryptos. It remains to be seen whether this spectacular rebound marks a true resurgence or is just another flash in the pan as the crypto-sphere has too often seen in the past.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiaEFVX3lxTE1HQnlDM1pwbzQ1c2Z2RlZ4NkIzLThrcDRzN0hiazRxcFo5YUF1bDNPQU10TUNwdTVRbngwTnNhUFhMNDhXeUN2R3k0YmpORFd3Uml1bHJRVmZobHZUZWRQRTQ5eC02Qkhi0gFuQVVfeXFMTVN0NWs2ZUt4aERrUW9qUmxzaHR5OUpuVmd6ZVNjd2JwVFVXZWh1UlFfemg5Vkx2MlRxc3ozYnk2d3hUbF82Mno0c0p4a3ZvZHVsZEVWYmNXbUVubzdvaVEtZ0RWNHRTMkpaQ2tmM0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 25 Dec 2023 19:03:04 GMT",
        "title": "Top Meme Coins Across Ethereum, Solana, Arbitrum, Avalanche, And Optimism | Bitcoinist.com - Bitcoinist",
        "content": "Meme coins are still making the rounds across various blockchains and have managed to become an integral part of crypto investing. With each chain and its supporters, there have been different meme coins that have made the rounds, giving outstanding performances, and making investors a lot of money. So here are the top meme coins across various blockchains on Christmas Day.\n\nMeme Coins On Ethereum\n\nEthereum has been known as the king of meme coins with the most prominent meme coins having come out of here. Naturally, the chain has continued to see a lot of support from investors who continue to support the likes of Shiba Inu which remains the largest meme coin on the blockchain.\n\nShiba Inu is still holding up at a market cap of $6.3 billion, making it the second-largest meme coin in the market, and the largest meme coin on Solana. So even with thousands of meme coins making their way to Ethereum, SHIB remains a prominent player.\n\nSHIB price maintains a hold on $0.00001 | Source: SHIBUSD on Tradingview.com\n\nSolana Welcomes New Found Volume\n\nThe Solana ecosystem has only recently become a hub for meme coins but investors have already taken to it like fish to water. In the last few months, there have been insane outperformance from some of these tokens but the most prominent remains the Dog With Hat (WIF) meme coin.\n\nThe meme coin went from trading under a $100,000 market cap to running to more than $300 million in the space of a month. It has also been listed on centralized exchanges such as MEXC and Crypto.com, showing the support that the altcoin is getting.\n\nArbitrum Welcomes New Meme Coins\n\nOn the Arbitrum blockchain, NOLA has emerged as one of the most prominent meme coins. Receiving support from the Arbitrum team, the coin quickly rallied, reaching almost a $20 million cap before eventually falling back downward.\n\nNOLA’s price has since fallen more than 50% since reaching its all-time high. It is now sitting at a $5.8 million market cap and averaging around $500 in daily volume, at the time of writing.\n\nAVAX Rally Breathes New Life Into Avalanche\n\nThe Avalanche network has had one of the worst go of it this year, with the AXAX price dropping to as low as $9. However, the network has been able to shake off this underperformance and is back on the radar of investors. In the same vein, meme coins have also become a prominent feature on Avalanche.\n\nCOQ Inu is currently the leading meme coin on the blockchain which went as high as a $200 million market cap. Despite a retrace, its market cap is still high at around $180 million and averaging $4 million in volume daily.\n\nOptimism Meme Coins Are In\n\nAs investors seek other chains to try their luck out on, Optimism has naturally been in the picture. The top-performing meme coin on the blockchain currently is the TUX meme coin which has struggled to put on a rally like those on other chains.\n\nNevertheless, the TUX meme coin was able to go from under $1 million to around a $4 million market cap before retracing. At the time of writing, TUX is sitting at a $1.7 million market cap, with almost $300,000 in daily volume.\n\nFeatured image from BSC News, chart from Tradingview.com"
    }
]