[
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiX0FVX3lxTE94Z1ZDS3JlclpGLTRFU2hwbElKUFhQN29BTWhfS1VqbTFzV2t6dDVPMlltbXFvTUxnZEVteS1DdWZoU2FreXk0Qm9kN1FoRVZYWFdwWWdjek9yX25MYzdJ0gFkQVVfeXFMT0FGQXlLTUVMY0ZUeVRtMlpBQXllcGhIT3RnTzU1bzU2Y01COGVPVWdMVjdtZHo1TE9BMWcxR3JJRXFxRFFJVGJNd3E5eFI2U0RFZHFhZ3V1OFJxRXdZc0o2UkxFNw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Dec 2023 08:00:00 GMT",
        "title": "Solana Is Ethereum, Co-Founder Says - U.Today",
        "content": "Advertisement\n\nSolana's co-founder Anatoly Yakovenko recently made a bold assertion about the future of blockchain interoperability and the role of Solana in the wider Ethereum ecosystem.\n\nIn a series of posts on the X social media platform, Yakovenko described Solana as an Ethereum Layer 2 (L2) solution through the Wormhole EigenLayer.\n\nThis would be possible because of advancements in \"danksharding,\" a scaling solution for Ethereum, suggesting a future where Solana blocks could be submitted into a data-validating bridge contract on Ethereum.\n\nExploring interoperability\n\nYakovenko's comments sparked a discussion about the technicalities and implications of such an integration.\n\nAdvertisement\n\nHe clarified that Solana would only mint the wrapped version in its state after Ethereum achieves full finality, addressing concerns about potential reorganizations (reorgs) of the blockchain.\n\nThe concept of \"social consensus\" was emphasized, which suggests flexibility in how Solana and Ethereum might interact.\n\nThis flexibility could allow users to fork off into their own layer-1 1 (L1) blockchain, using a snapshot root. Yakovenko's stance indicates a broader view of what defines a layer-2 solution, challenging traditional boundaries and proposing a more fluid and interconnected blockchain ecosystem.\n\nSolana's market resurgence\n\nAs reported by U.Today, Solana has recently marked a significant achievement by surpassing Ethereum in a key trading metric: perpetual futures trading volume.\n\nSolana's lead in both perpetual futures and spot trading volumes, coupled with a soaring market capitalization, positions it as a formidable competitor in the crypto space, even challenging Ethereum's dominance in the Decentralized Exchange (DEX) and decentralized finance (DeFi) sectors.\n\nThe interest in the Solana ecosystem mostly stems from the meme coin frenzy that was fueled by the rise of the Bonk (BONK) token."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiygFBVV95cUxPT2h6clhBT2tBaVVfUjM1LURRQllSbmpSSWd4YktfZDRudHJoLW1oNTZTampmaElKbWJhckxEVC1IalB2YmJHV1NmcDYxdUdiRjdCVExNaHpqLUluZEVINVM3NDJ5MG1RdFhFbmlBZm1CSVRVT0hQc01xZnp6WmFxa1IyTjBqUUptU0k3aGhybGlCYWVZY2tlUFNaaTVma1VDT1FEN3RBV1dUVkZyVzhFZTcxWENlZjVzdFoyR1lOVGxQV2E2RHU2cENR0gHPAUFVX3lxTE9KVnFBTnNXaUFDbUxnWElkTXdsY2lGUGRLR1k3SnExYktLTmkwc2w4cUE2b3FHS1pmT0lNdm01cFd5T1dJMy1tSGQ5dmNXYlVncVhaQ0RiS0prc09UZGVFZWEwa2NvUDBHSTh2eVcxUkh6d2Q2aDAtd1EyZG92M1h4dmlXQ2R5VTRCaEVCLWNUZExaSHdLbDZ3Wkl5Tl8wdWhQNzNSN0RjTV9Gcy1NS0pPNnJVN2xWTWJLNUdaeVdjRlhMSHlmNGgxaUM0T0pOQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Dec 2023 08:00:00 GMT",
        "title": "Coinbase’s Ethereum Layer-2 Solution’s Total Value Locked Hits New All-Time High, Reaches $742,000,000 - The Daily Hodl",
        "content": "The total value locked (TVL) in Base, Coinbase’s Ethereum (ETH) layer-2 scaling solution, has hit a new all-time high, reaching nearly $750 million.\n\nNew data from layer-2 blockchain tracker L2Beat reveals that the TVL of Base is hovering at $742 million at time of writing, a new record high and an exponential rise since July 30th when it was sitting at just $2.19 million.\n\nTVL refers to the amount of capital deposited within a protocol’s smart contracts and is often used to gauge the health of a crypto ecosystem.\n\nAccording to the data, the top five digital assets with the most total value locked over Base include ETH itself, stablecoins USDC and DAI, liquid staking token Rocket Pool ETH (rETH), and Wrapped Lido Staked Ethereum (wstETH).\n\nOther notable virtual currencies on the list include the decentralized exchange (DEX) platform SushiSwap (SUSHI), decentralized finance (DeFi) protocol and stablecoin DEX Curve Finance (CRV) and crypto lending protocol Yearn Finance (YFI).\n\nBase, which went live for developers in July and the wider public in August, was built in collaboration with layer-2 scaling solution Optimism (OP) and currently has no plans to issue its own native asset.\n\nFurthermore, data from Dune Analytics show that the number of Base users has been on a slow climb up since the protocol’s public launch on August 9th. Back then, the total number of Base users sat at 452,386. Today, there are 3.16 million users on Base.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxPS3ZaTE9IcVRqME9IendNWFkzVDA4Rnd6ZWctSmZEWVd3NURmWGhHMjNmenl2VERuM2pSTGdLVFNON2VFaEhRZHA1YmdUQ1hIMEdiUHNRMElGamdTMlV5RVpIdy1INGpfaWhzSlY5bEJBVGVrYl9lYUp2Z0FnVTZEczlmSWdkQ2N2OVAxTVRERkVsdzR2MU95YWVUNWVpQUtPRWRxZWw5X3nSAa4BQVVfeXFMT282a0ZnYXA4R0w3YXFHOGkyWE9JdmxBdUM0ZXVEZmduNVVaR3pidWl1bGRhZ0VyZ2NOdGY3RlJXVEV3NG1kWjZ2S2d6eUN3N2RsajZHVURXemtwc05mMmlxYkNxa2pmUXJYYlZiS21aRHlOWmtCZXloclJvendmZ3BwYVl6MGFicUd2RlRROGVsTWVjR2RXQ3RxbzdQcFdGTmw4WkxDbEk2Wm0xMFZ3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Dec 2023 08:00:00 GMT",
        "title": "$170 Million of Solana (SOL), Bitcoin (BTC) and Ethereum (ETH) Liquidated Amid Crypto Flash-Crash - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nIn a sudden market shake-up, over $170 million worth of Solan, Bitcoin and Ethereum were liquidated, as depicted by the latest crypto liquidation data. This flash-crash event has rattled the crypto sphere, occurring just a week before the New Year — a time when such volatility is not typically unexpected.\n\nAdvertisement\n\nThe end-of-year period often sees a shift in market behavior. Retail investors are known to cash out for the holidays, and larger investors close their positions to avoid unpredictable swings during times of reduced liquidity. The liquidation data reflects this trend, showing a substantial number of positions being wiped out in the face of rapid price movements.\n\nOrder books tend to thin out during the holiday season, with reduced trading volumes and some market makers stepping back, increasing the potential for volatility spikes. This environment can lead to quick and severe market movements, as currently evidenced on the crypto market.\n\nAdvertisement\n\nDespite this, the overall market still exhibits signs of an uptrend. The $170 million in liquidations, while significant, is not indicative of a market downturn but rather a typical response to the year-end climate. It is a pattern familiar to seasoned crypto enthusiasts, where the combination of profit-taking and risk aversion can momentarily disrupt the market.\n\nHistorically, as the New Year begins and normal trading volumes resume, the market stabilizes. The situation usually improves by mid-January, once institutional and individual investors return to their desks to reengage with the market.\n\nLooking at the broader picture, the uptrend trajectory remains intact. The recent liquidations, although impactful, are unlikely to derail the general market direction. The crypto ecosystem is known for its resilience, and the current liquidation wave is just another test of this attribute."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMi0gFBVV95cUxPTEF1VXlpNHhqQS12d0t1WlMzSnRUUG1WRkJveERBRU1ydDlGQ3B4Z3ZDNk5TN1o1QmZpcXBYWTEtamt4cElOd0ZYM2RZekxNd3QtT2d6eFZhOU5OMnpHQkpTN01kanhZMjltTWQ5MEg4dHdPU2hpUm5EMjNHNnBqTDNCcWZ1RGp5eG5scjA5WG9ubjNyZFVLeUo2WHJVTWl2TG4zOVBTZlN5OUEtaU1Xd3c4ZHBZYTNpanEyemhuS2lfNHNQRkNCQkhERzNFN0dzSHfSAdcBQVVfeXFMUGRQT092S0NOR2syZGlweFFUN1NpZ2pBQlI4Y0hyZ1dNYkM0amxGdlFCM0dwUDNrMG8yZVZKMXpiMFg2b0g0T1g3SFctYTdlNjlfTW1BcTB5S0RZeGw0c3I2MFEzNU93YUdUUExGNFdHQVNDaVBFS3IyTU8xNEMtMlpsb19FTnM3SWtKbnVZckJLMVN5SGxucWNENVNBWnFjbG1zSktEWE92NWZQSmZydzBzRHgyYUtNZVNCTGliVTl5RGUzQ21OQks4bFpnTlhTaEZQVk95dFk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Dec 2023 08:00:00 GMT",
        "title": "Macro Guru Raoul Pal Predicts Ethereum Will Massively Outperform Bitcoin, Says ETH’s ‘Big Surprise’ Coming - The Daily Hodl",
        "content": "Former Goldman Sachs executive Raoul Pal believes that Ethereum (ETH) is poised to outperform Bitcoin (BTC) over the coming weeks and months as investors move their capital within the crypto markets to generate more gains.\n\nPal tells the 21,300 subscribers of his YouTube channel that Ethereum will “massively outperform” Bitcoin just like how lower-rated junk bonds tend to surpass the higher-rated treasuries when investors rotate their capital.\n\nAccording to Pal, the potential approval of a spot Bitcoin exchange-traded fund (ETF) will positively impact Ethereum as he expects market participants to reinvest their BTC gains in ETH.\n\n“So ETH is just doing what it’s supposed to be doing. But it’s not giving us the big surprise. I think that surprise comes the moment the ETF is out in Bitcoin and people will focus on the ETH ETF. And it’ll bring the ETH ecosystem alive.\n\nThis year, it’s been a story of Solana which I’ve been long all year, and Bitcoin. That barbell has been the best trade in the world. Or, in fact, just saying SOL has been the best trade in the world bar none. But ETH, it will play catch-up, it will do well.”\n\nTurning to Bitcoin, Pal says that the flagship crypto asset’s price action going forward is likely to mirror its 2015 bull market price action when Bitcoin witnessed a massive burst to the upside without a major correction.\n\n“I think this cycle we’re in now looks more like that 2015, 2016, 2017 than it did 2019-2021. [In] 2019, [Bitcoin] came out of the gates really, really fast then corrected, then we had Covid-19, which we’re not going to repeat.\n\nI know many people are expecting ‘Oh, we’re going to get a 50% collapse and you buy that one.’ It’s not going to happen.\n\nOf course, you’ll get corrections. I think they’re most likely more sideways, give or take a 20% to 30% range, because that’s the world we live in in crypto.\n\nBut we should keep going into the end of 2025 if we’re just repeating the same old cycle, which I think we are.”\n\nI\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Bruce Rolff"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxPMV9mZTVHRkNyTTI4ZFhkRmZSME9vX2sybkQ3SE9FV2FRUFdLQV91bWNQZGhmeWF2YndIZWVSM2NrdHdXVU9rTWtFc3p5X1FneGpkekpYN2kza3lWRDRqVml4TE5JZVFzM1RoS0xhZ0wteW9mUnM4eDFnNEROSTVsdHM5U2VNd09uTjdWNUtWSWtwNE52cFBocnpua2o?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Dec 2023 08:00:00 GMT",
        "title": "Anatoly Yakovenko jokes ‘Solana is Ethereum’ in ironic social media exchange - CryptoSlate",
        "content": "In a recent exchange on social media, Solana creator Anatoly Yakovenko, made a remark that was misinterpreted in our previous coverage.\n\nIn a Dec. 25 tweet, Yakovenko playfully suggested that Solana could be considered an Ethereum layer-2 (L2) solution through its Wormhole eigenlayer. This statement was part of a tongue-in-cheek response to a tweet listing various L2 solutions like Arbitrum, Aztec, and Polygon. He quipped:\n\n“Solana is ethereum! Solana is an ethereum L2 through the wormhole eigenlayer. Once danksharding is scaled up no one is going to stop you from submitting all the Solana blocks into some data validating bridge contract on ethereum.”\n\nThis playful assertion was meant to ironically juxtapose Solana, a distinct and independent blockchain, with Ethereum’s layer-2 solutions. The mention of a Wormhole eigenlayer and the speculative reference to submitting Solana blocks to Ethereum were part of this jest.\n\nOur initial report, however, presented it seriously and failed to recognize its ironic nature, and thus our coverage suggested that he meant it in earnest. We sincerely apologize for the error and for any confusion caused by our failure to recognize the ironic intent behind it.\n\nOn the rise\n\nYakovenko’s jesting aside, Solana is poised to close the year on a high note. December was a particularly active month for the blockchain, showcasing one of the quickest price recoveries in the final quarter. The total value locked (TVL) on Solana more than doubled, escalating from $671.62 million at the beginning of the month to $1.529 billion by December 26th.\n\nHowever, when denominated in SOL, the increase was more modest, from 11.35 million SOL to 12.56 million SOL in the same period. This discrepancy reflects the significant rise in SOL price, which climbed from $59.2 to $121.4, affecting the USD valuation of the TVL.\n\nNotably, Solana overtook XRP in market cap, becoming the fifth-largest cryptocurrency with a market cap of $34.8 billion as of December 20, 2023, following an 11% increase in Solana’s value, which outpaced the broader market’s 3% gain. The SOL/ETH ratio, comparing Solana’s value to Ethereum’s, also shows recovery, highlighting Solana’s competitive stance.\n\nThe SOL/ETH ratio, a metric comparing the value of Solana (SOL) to Ethereum (ETH), is a critical measure of Solana’s competitive position. This ratio has experienced significant fluctuations, with the most recent data showing a recovery in Solana’s standing against Ethereum.\n\nSolana’s blockchain technology, known for its high performance and scalability, is designed to support decentralized applications (dApps) and decentralized finance (DeFi) use cases. The platform’s success is attributed to its unique consensus algorithm, “Proof of History,” which enables high transaction speeds and low fees, making it a popular choice among developers for dApps and DeFi projects.\n\nMentioned in this article"
    }
]