[
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxPdkMtejFBX3lxZ3BUWnU5a1QtYmVjaUQ3alpFejdTUFVWVG1BRHFWYThLOWNkR0FqQW1TUUw1NHVCVmJIcWMyeE9zMi1PMUJHakxRVjlFbmt3c0lYaDVvLXNoMDlXZVMycHJyTGhiaVVYaThqcmE4UjhadFluVmxZLXl3ZjR5R2M5LXFhZ3F4WU1iRUd6RG04aFR6dTFlbGhvU0NhRjZvNk5ZMGg1empqdXJ4SXRqSFNLaDNDNlVFakpuZ9IBxwFBVV95cUxOUFRSMjdNWWFnbENjR3FjTmxmdzZ4NWF4ZEtZMFlockU1allMM010QUcxQWdmX3ZDN1c2aF9mZWxTMXQwbXd1M1B6NTZ4MHlpOFZKMlRYSktiSXZibUJ0YTQ1aUl4ei1ic09Ec25kTzVIM2VpVENXTlhMRjhVempVd0VaQVBTZ2g5VHhfUkxyOEM2cHBoNUs0ME5Qc1VSU0ZsNjExdG1EVlQ2RTBZTVBFU0JZa3RocW96Y2htYlhOTnhKb1Vwanh3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 Nov 2023 08:00:00 GMT",
        "title": "Crypto Whale Profits Over $24,000,000 in Masterful Wrapped Bitcoin (WBTC) Trading: On-Chain Data - The Daily Hodl",
        "content": "An unknown crypto trader has been spotted on-chain clocking massive profits trading Wrapped Bitcoin (WBTC).\n\nAccording to blockchain tracking service Lookonchain, three wallets belonging to one “smart whale” deposited 1,957 WBTC worth $74.6 million into Binance on Friday.\n\nWBTC is an ERC-20 token pegged to the price of BTC, allowing traders to speculate on Bitcoin while staying within the Ethereum ecosystem.\n\nLookonchain says that the deep-pocketed entity consistently bought WBTC at low prices and sold higher, making over $24 million in WBTC profits, with one wallet making $11.6 million and two others making $6.3 million each.\n\n“Wallet 0xC9c6 withdrew 1,744 WBTC ($48.15 million) from Binance between April 27 and June 14 at an average price of $27,613.\n\nThen deposited 1,744 WBTC ($59.76 million) to Binance from Jun 22 to Nov 24 at an average price of $34,270, making ~$11.6 million…\n\nWallets 0xc1C7 and 0x5c98 bought and sold WBTC at the same time and always bought when the price was low and sold when it was high.\n\nBoth two wallets made ~$6.3 million.”\n\nLookonchain also recently spotted a wallet that participated in the Ethereum initial coin offering (ICO) nearly 10 years ago. According to the firm, the entity “woke up” after three years of dormancy to deposit 20,000 ETH to another wallet with 10 ETH eventually going to the crypto exchange Kraken.\n\n“An Ethereum ICO participant woke up after three years of dormancy and transferred 20,000 ETH ($42.4 million)… of which 10 ETH was deposited to Kraken.\n\nThis whale received 100,000 ETH(the cost is ~$31,000) at the GENESIS of Ethereum, the ICO price is ~$0.31.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxNRTRJOUZRYW5TYnQySE55LWh2VFNWVlpnMnlHOHhLYkNST3h6MzV0VjFKMml5anlJdTlLeVBMYlpqVDRycFBKd2R3dDJidDNjb1czWmtyTWluQU1DM04yczRaM3V0Ykl6M2ctT29HRm1oeEc2U3QzTG5IbHMteTNRSVdkX1FNYlJwaU1LZnMyTF9yOHhCd3BFak52ejBnZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 Nov 2023 08:00:00 GMT",
        "title": "Cardano Founder Takes Aim at Rival, Says Ethereum 3 Will Solve Everything - Coinfomania",
        "content": "Charles Hoskinson, the founder of the Cardano network and former Ethereum developer, has taken to X (formerly Twitter) to share his view on Ethereum’s approach to blockchain innovations that the Cardano team is already developing.\n\nWhat Happened?\n\nOn November 24, Ethereum founder Vitalik Buterin was interviewed by DeFi and NFT platform Defiant in Turkey, where he discussed the Ethereum roadmap and proposed redesigning Ethereum’s (ETH) staking system to promote healthier mining and staking pools, thereby enhancing decentralization.\n\nDuring the interview, Buterin talked about adopting the UTXO approach, which relies on unspent transactions to address the network’s challenges. Notably, this model is different from Ethereum’s current account-based system and is used by some blockchains, such as Cardano and Bitcoin.\n\nWhat is UTXO?\n\nThe Unspent Transaction Output (UTXO) is the amount of digital currency remaining after a cryptocurrency transaction is executed. This model provides users with enhanced control over their financial transactions, especially crucial for issues like preventing money laundering and terrorism financing.\n\nBy allowing users to specify and understand exactly who they are receiving funds from, the UTXO model aims to bring a higher degree of traceability and security to financial transactions, a level of control and transparency that is increasingly important in our digital age.\n\nHoskinson’s and Community Response\n\nIn response to Buterin’s interview, the crypto community pointed out that this solution is similar to the approach Cardano has already taken with its staking system. Hoskinson also responded to the interview by tweeting a notably sarcastic remark. He wrote:\n\n“No worries, Ethereum 3 will have it all sorted.”\n\nUpon seeing Hoskinson’s tweet, a user in the community criticized him saying he was “fueling hostilities”. The Cardano founder replied that his tweet bore no negative feelings but rather an expression of his confusion. He added:\n\n“I am truly at a loss that Cardano can never be mentioned as an innovative ecosystem over team E. V is rediscovering what we’ve been working on for almost a decade, and it’s like a new revelation.”\n\nHoskinson’s recent criticism of Ethereum’s staking system is not the first. Earlier this year, he stated that he was at a “loss for words’ regarding a statement by Buterin on ETH staking."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxOamZfaUhMM2s3dFkzQ3ktS3FLYXBuVTF5T2g0OUNVTktWSlFjUGp1dWJlOWJMTlZZQjhaMzFYVm5xYi05Mkl4OFRiaXBWQmwwWUJuUFhHN3FBbVRtWXlLbTJvc0xlYkpxQmVtLTlXMHRiWnI5d0FhYm1hMlF1aTZRbE5ZQUhmeF9oaEpEVVd2bzlld2hpVl8wX2tjVDFVVDJodDRuazRURXowSkZmSWg5VzZWaDFQZDdyazBfbXV2WdIBxwFBVV95cUxNaHo1QVpUQXBTMktkd1lEYk55ckxSUEpDTkRFX013U0Qyd3Vld1pYVDJLUzlFZ1hJWTFkQTljTWNMVGlMVWM0ZHVqUklZUkhNSWRBX0FRRFByY0tKZkZpQ29pRXRSMnppZ09haUhJaTg4dFhyNDRYaE1XRVNjTUF3SDR6Mm9tN0dJUmZ3cTZWWG5iQmhnbS1XVF96X3JPUmwyUDdQYTZrNFpEZlZNV2RVV0p5cGl1a1dMSkxlZkpRZEhfMjNibUpF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 Nov 2023 08:00:00 GMT",
        "title": "Meme Moguls (MGLS) Surpasses Ethereum (ETH) and Ripple (XRP) in Impressive Market Performance - Crypto News Flash",
        "content": "A new player has entered the crypto scene with enticing features and good potential. That player is Meme Moguls (MGLS). The token which is just in the presale stage has surpassed the performance of great giants like Ethereum and Ripple.\n\nEthereum (ETH) Shows Sell Signal, Says Ali Martinez\n\nEthereum (ETH) started this week on a bullish note rising above the $2,000 mark as high as $2,128. Unfortunately, Ethereum’s price has dipped to $2,000. Currently, various indicators suggest the likelihood of further declines in the coming days.\n\nEven crypto traders like Ali Martinez share this opinion. According to Ali, Ethereum’s “TD Sequential” indicator is signaling a sell on the three-day Ethereum price chart. This comes as the asset tests a significant resistance range ranging from $2,000 to $2,150.\n\nThe analyst pointed at a possible price dump to $1,700. Currently, the price of Ethereum is showing mixed sentiment. It had dropped 2% on the daily chart while holding on to gains of 6.5% and 27.3% on the weekly and monthly Ethereum chart.\n\nRipple (XRP) Loses Gains After Recent XRP ETF Rumour\n\nRipple holders’ positive outlook has grown immensely since Ripple’s partial win against the US SEC in July. Ripple’s price increased by over 80% and reached the $0.8 level. Unfortunately, the bearish market led to high selling pressure as Ripple cryptocurrency lost its gains.\n\nThe Ripple crypto dropped as low as $0.5 before picking pace during the Uptober market rally. So far, Ripple coin’s November performance has been poor compared to other cryptocurrencies. Per CoinMarketCap, Ripple XRP price has dipped 3.4% to $0.6387.\n\nBoth its market cap and trading volume have dropped significantly, due to the recent fake BlackRock XRP ETF Trust filing. Still, Ripple’s technical indicators point towards a price recovery in the coming months to the $0.7 region.\n\nMeme Moguls (MGLS), Bringing New Utility To the Meme Coin Sector\n\nWhile Ethereum and XRP are losing gains, meme coins continue to take over the crypto space. The meme-based asset industry has gained significant recognition in recent years. According to Statistics, the meme coin sector has a market capitalization of over $17.5 billion.\n\nThe interesting part is that these meme coins have little to no utility. In response to this, Meme Moguls has emerged as a solution, as it seeks to launch a meme-backed stock market. The project’s objective is to unite the meme industry to foster a community for meme coin enthusiasts.\n\nUsers will gain access to memes-backed assets. The ecosystem will also encompass a wide range of services, all drawing inspiration from memes. A metaverse platform named Mogul Land will be introduced. This will enable meme traders to interact and mine tokens to enhance their returns.\n\nAnalysts have predicted significant growth for the MGLS token. Currently, Meme lovers have the opportunity to buy MGLS tokens at just $0.0019. Market experts are optimistic about the project and foresee a 1,000% increase in the coming months. Plus, joining the presale gives you a chance to earn up to $10,000 in giveaways at the end of the presale stage.\n\nVisit Meme Moguls"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxOamZfaUhMM2s3dFkzQ3ktS3FLYXBuVTF5T2g0OUNVTktWSlFjUGp1dWJlOWJMTlZZQjhaMzFYVm5xYi05Mkl4OFRiaXBWQmwwWUJuUFhHN3FBbVRtWXlLbTJvc0xlYkpxQmVtLTlXMHRiWnI5d0FhYm1hMlF1aTZRbE5ZQUhmeF9oaEpEVVd2bzlld2hpVl8wX2tjVDFVVDJodDRuazRURXowSkZmSWg5VzZWaDFQZDdyazBfbXV2WdIBxwFBVV95cUxNaHo1QVpUQXBTMktkd1lEYk55ckxSUEpDTkRFX013U0Qyd3Vld1pYVDJLUzlFZ1hJWTFkQTljTWNMVGlMVWM0ZHVqUklZUkhNSWRBX0FRRFByY0tKZkZpQ29pRXRSMnppZ09haUhJaTg4dFhyNDRYaE1XRVNjTUF3SDR6Mm9tN0dJUmZ3cTZWWG5iQmhnbS1XVF96X3JPUmwyUDdQYTZrNFpEZlZNV2RVV0p5cGl1a1dMSkxlZkpRZEhfMjNibUpF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 Nov 2023 08:00:00 GMT",
        "title": "Meme Moguls (MGLS) Surpasses Ethereum (ETH) and Ripple (XRP) in Impressive Market Performance - Crypto News Flash",
        "content": "A new player has entered the crypto scene with enticing features and good potential. That player is Meme Moguls (MGLS). The token which is just in the presale stage has surpassed the performance of great giants like Ethereum and Ripple.\n\nEthereum (ETH) Shows Sell Signal, Says Ali Martinez\n\nEthereum (ETH) started this week on a bullish note rising above the $2,000 mark as high as $2,128. Unfortunately, Ethereum’s price has dipped to $2,000. Currently, various indicators suggest the likelihood of further declines in the coming days.\n\nEven crypto traders like Ali Martinez share this opinion. According to Ali, Ethereum’s “TD Sequential” indicator is signaling a sell on the three-day Ethereum price chart. This comes as the asset tests a significant resistance range ranging from $2,000 to $2,150.\n\nThe analyst pointed at a possible price dump to $1,700. Currently, the price of Ethereum is showing mixed sentiment. It had dropped 2% on the daily chart while holding on to gains of 6.5% and 27.3% on the weekly and monthly Ethereum chart.\n\nRipple (XRP) Loses Gains After Recent XRP ETF Rumour\n\nRipple holders’ positive outlook has grown immensely since Ripple’s partial win against the US SEC in July. Ripple’s price increased by over 80% and reached the $0.8 level. Unfortunately, the bearish market led to high selling pressure as Ripple cryptocurrency lost its gains.\n\nThe Ripple crypto dropped as low as $0.5 before picking pace during the Uptober market rally. So far, Ripple coin’s November performance has been poor compared to other cryptocurrencies. Per CoinMarketCap, Ripple XRP price has dipped 3.4% to $0.6387.\n\nBoth its market cap and trading volume have dropped significantly, due to the recent fake BlackRock XRP ETF Trust filing. Still, Ripple’s technical indicators point towards a price recovery in the coming months to the $0.7 region.\n\nMeme Moguls (MGLS), Bringing New Utility To the Meme Coin Sector\n\nWhile Ethereum and XRP are losing gains, meme coins continue to take over the crypto space. The meme-based asset industry has gained significant recognition in recent years. According to Statistics, the meme coin sector has a market capitalization of over $17.5 billion.\n\nThe interesting part is that these meme coins have little to no utility. In response to this, Meme Moguls has emerged as a solution, as it seeks to launch a meme-backed stock market. The project’s objective is to unite the meme industry to foster a community for meme coin enthusiasts.\n\nUsers will gain access to memes-backed assets. The ecosystem will also encompass a wide range of services, all drawing inspiration from memes. A metaverse platform named Mogul Land will be introduced. This will enable meme traders to interact and mine tokens to enhance their returns.\n\nAnalysts have predicted significant growth for the MGLS token. Currently, Meme lovers have the opportunity to buy MGLS tokens at just $0.0019. Market experts are optimistic about the project and foresee a 1,000% increase in the coming months. Plus, joining the presale gives you a chance to earn up to $10,000 in giveaways at the end of the presale stage.\n\nVisit Meme Moguls"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxNb0dDNlMyZjdBNUc1a2N5LXlGV2VJNzc5enQyMWRjcTZYVUg0bG1YaTk3ZnV0WGcxcm1rLWxOczBOYzR3am5NVnVpVHhMRTM3eEdZZGpUb184Mk5kX0VieWVYOHFtS2wzWXJDZUo1c2ZQd2ZycTVOaldVTURHNk1qdjNJdDhRV2FV?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 Nov 2023 08:00:00 GMT",
        "title": "How to transfer cryptocurrencies from Polygon ZkEVM to other blockchains: native bridge and external protocols - The Cryptonomist",
        "content": "In this article we look at how to transfer crypto assets from the Polygon ZkEVM network, Ethereum’s layer-2 solution, to other blockchains using the native bridge platform and other third-party applications.\n\nNative bridging involves depositing ETH or other cryptocurrencies compulsorily from the Ethereum network to the Polygon rollup network.\n\nWith external protocols, on the other hand, we can freely go through other chains performing transactions almost always faster and cheaper, but at the cost of less data security.\n\nThe latter, in fact, add increased counterparty risk because we are going to entrust an entity not controlled by Polygon with the task of transferring assets from one network to another.\n\nHence, which is the best option to choose? Let’s look at it below.\n\nWhat is Polygon zkEVM?\n\nPolygon zkEVM is an Ethereum layer-2 of the ZK-rollup type that offers fast, cheap and secure transactions.\n\nZero-knowledge technology is combined with the robustness of Ethereum to achieve a highly efficient network with a focus on stability and EVM compatibility.\n\nTransactions executed on the zk network pass through Ethereum, but are confirmed off-chain to allow high throughput at low cost.\n\nDevelopers of protocols built on the Polygon-branded layer-2 have an advantage over the rest of the blockchain landscape because they can boast of the Ethereum virtual machine compatibility factor that allows for maximum interoperability between parties.\n\nOn the bridge front, this factor allows users to easily transfer assets from one chain to another without special arrangements. The same goes for those who want to migrate their dapp without having to entirely rewrite the code with different languages.\n\nThe cryptographic asset used as a gas token in the network is currently ETH, but not in the future this privilege is expected to pass to POL (ex-MATIC) upon completion of its integration process.\n\nThe Polygon ZkEVM infrastructure was launched in March 2023 and can already count on a locked-in value within it of about $100 million.\n\nThe next-generation chain was created with the intention of meeting the growing demand for decentralized applications and users in the Web3 world, and it has already achieved its small success by ranking within the top10 rollups for TVL according to L2Beat.\n\nIf you would like to discuss this further, all of Polygon ZKEVM’s core principles and the ecosystem roadmap version 2.0 roadmap were published in a recent Polygon Labs blog post\n\n1/ Our vision for Polygon is simple: to build the Value Layer of the Internet.\n\n\n\nThe Internet allows anyone to create and exchange information. The Value Layer allows anyone to create, exchange, and program value.\n\n\n\nEnter Polygon 2.0: a blueprint to build the ultimate Value Layer. pic.twitter.com/9eYSr3H1L5 — Polygon (Labs) (@0xPolygonLabs) June 12, 2023\n\nPolygon Bridge: native cross-chain transfer between Polygon ZkEVM to other blockchains\n\nThe first way to transfer crypto from Polygon ZkEVM to other blockchains is to use the decentralized infrastructure’s native bridge.\n\nIn fact, the Polygon team has provided its own platform to allow users to deposit ETH and other assets within the new network, without going through external applications.\n\nAs anticipated, the native bridge only supports the Ethereum blockchain and hence only allows cross-chain operations of ERC-20 tokens, such as ETH, USDT, USDC, DAI, MATIC, AAVE, LINK, WBTC, etc.\n\nAll this results in significantly above-average fees and waiting time costs compared to other more scalable L2s and L1s.\n\nIn any case, this is the safest and most efficient solution to land on the Polygon ZkEVM and the one definitely to be preferred in case large volumes move.\n\nThe Polygon Bridge is available from this site: to use it simply connect your non-custodial wallet (Metamask, TrustWallet, Zerion, Rainbow), select the token you want to transfer, select the quantity and click on “start bridging.”\n\nThe transaction requires confirmation of the smart contract and payment of a fee of about $10-12 according to current gas prices on Ethereum.\n\nTo withdraw funds from the ZK network, the process is essentially the same, with the only catch being that the networks must be reversed for transfer using the appropriate symbol in the center of the bridge.\n\nOther third-party bridges\n\nAs mentioned, there are also several third-party bridges that serve as alternative platforms for moving our crypto to and from the Polygon ZkEVM network.\n\nThese bridges offer the ability to go through different infrastructures choosing the one most convenient for our operation, often paying lower fees and with minimal waiting times.\n\nHence, unlike the Polygon Bridge, here we can enjoy the wide choice offered by the blockchain landscape such as Arbitrum, Optimism, BNB Chain, Starknet, ZkSync, Linea, Immutable, Polygon chain, Avalanche, Base, and many others.\n\nOf course, this advantage is offset with a downside: all these third-party services in fact, although they are a faster and more immediate option in cross-chain exchanges, present far higher structural risks than native bridges.\n\nBy using them you are automatically going to entrust your assets to services that have nothing to do with Polygon and Ethereum, and that may have flaws on the security front. You are essentially going to increase counterparty risk.\n\nPeople usually choose these more flexible solutions when they want to bridging small amounts .\n\nAmong the most well-known and reliable third-party protocols in this field are Orbiter Finance, Layerswap, XY Finance, and Celer Bridge.\n\nEach has small peculiarities such as supporting a specific chain, allowing transfers with a particular token, or integrating support for transfers from CEX.\n\nEither way, they all work similarly to the native bridge: to use you then need to connect your wallet, select a coin to transfer, type in the amount, and click the button to start the transaction\n\nYou can find references to these platforms, and other niche services, directly on the Polygon Bridge page under “Third.Party Bridges.”"
    }
]