[
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE9UTlJJSTJPQ3lRSkpCNVFMVXZzUHVyajFyZzJqU1RmZy02NmVyc3FqWk56ZnVMelhOak13RFhGelhyNWFEeVdYLXFWWjRadHA4LThKRzQ0T1BJUGkyanp3Ym1UNlJzU0dtcUFFay0yOHBQVHUtZFNKQ2Vn0gF_QVVfeXFMT3R3dE4zVlY5LXdPTUl3NnhENHJ3ZEFvSzZZWldfaDBGdnEwMkk4RTlJUmpBT1NRSUNycU1tQXQ5VWRoWEdNVWxJOVZxTWhwZ0dwTWNYbVJXZTUydnV2dVZUZksyRTE4R3hLcU9wZXlORmV4bC1OdXVYaHB3YlpSWQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Price About To Bloom As ETHE Discount Rapidly Close: ETH To $3,500? - Bitcoinist",
        "content": "Ethereum (ETH) prices have been languishing below the $2,500 mark despite the strong performance of other cryptocurrencies like Solana (SOL) and Cardano (ADA).\n\nTaking to X on December 22, the CEO of Lumida Wealth, Ram Ahluwalia, has offered a theory on why ETH prices are likely to recover and reverse losses, possibly outperforming the world’s most liquid coin, Bitcoin (BTC).\n\nETHE Discount Rapidly Closing\n\nTo illustrate, the CEO pointed to the ETHE chart, whose discount has been steadily closing over the past few trading months. Ahluwalia observed a 4% gain on December 22, further reducing the discount.\n\nBased on the CEO’s analysis, this development suggests that institutional investors, most of whom chose to buy the regulated ETHE product by Grayscale to gain exposure in a regulated manner to ETH, are now opting to buy ETH on the spot market, not through a derivatives product.\n\nThis shift from ETHE to ETH spot, Ahluwalia added, could be explained by the “cheapest-to-deliver” contract theory. In the derivatives market, this theory states that a derivatives product like ETHE is the cheapest way for institutional investors to gain exposure to the underlying asset, in this case, ETH.\n\nThis is because the derivative in question, ETHE, is a futures contract that tracks the price of ETH via a regulated exchange, in this case CME.\n\nWill Capital Flow To Spot Ethereum And Lift ETH To $3,500?\n\nTherefore, based on this theory, the CEO continued that it is likely that as the ETHE discount closes, marginal flows will go to the ETH spot to capture the staking yield. For this reason, institutions are not likely to pour more funds into ETHE since “big gains” are done.\n\nAs a proof-of-stake (POS) project, users can stake ETH, helping secure the network, and as compensation, Ethereum distributes a yield of around 4.3% to validators. These operators must lock at least 32 ETH to validate a block of transactions and earn block fees. Since they have to stake, they also earn a yield.\n\nAs of December 22, there were over 28.6 million ETH staked, with the reward rate or yield at 4.32%, according to Staking Rewards. Considering how staked amount and yield are correlated, the more users choose to stake physical ETH, the lower the reward rate, or yield, is.\n\nThis dynamic will now come into play as ETHE discounts close and institutions or big players rotate funds into ETH via the spot market, possibly lifting prices.\n\nLooking at the ETH price action in the daily chart, buyers have the upper hand. However, a comprehensive close above $2,400 could lift ETH to $2,500 and later to $2,500 in a buy trend continuation pattern.\n\nFeature image from Canva, chart from TradingView"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxOVmFNSThMd2ZpamUzS2dNNy1Sd3ZXekFOZG1mWm8tY1Rnb1dNM1c0S0xPMmlTNnVUUXM2dm00aHBGcElVbVhDcDFrX1BzZUJZNzdNbGdvT1BVNlR4dUg5U005WURjQ1NEV1FkVGdROEszRXJMRjR0MXlMT3IzQ19wZkxsTjVJbXJuREZMLWhUQnpDRzNLT3hLV2ZSYV9SSHpSRjZOZ1A2ZTlUWHFZNF9FbHcwMy1aUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Dec 2023 08:00:00 GMT",
        "title": "Exclusive: NY financial regulator approves Paxos expansion to Solana, allowing for its first stablecoin issuance beyond Ethereum - Fortune",
        "content": "The leading stablecoin issuer Paxos has received regulatory approval to expand its products to the Solana blockchain, which it plans to launch on Jan. 17, 2024.\n\nWith peers including Circle and Tether vying for critical market share, the expansion is a major step for Paxos, which touts its relationship with the New York Department of Financial Services (DFS).\n\n“Paxos is the most regulated stablecoin issuer in the world,” Walter Hessert, head of strategy at the firm, told Fortune in an interview. “We are the only company that has been issuing regulated stablecoins at scale—period.”\n\nStablecoin wars\n\nCofounded by financial veteran Charles Cascarilla, Paxos became the first crypto firm to receive a trust charter under the new digital asset regulatory regime implemented by DFS in 2015. To this day, DFS remains the sole U.S. financial regulator to implement a comprehensive framework for crypto, which has attracted a number of leading companies, including Coinbase and Gemini.\n\nPaxos received DFS approval to issue its first stablecoin in 2018, which it called Paxos Standard, rebranding the token to USDP in 2021. Stablecoins are a type of crypto token pegged to an underlying asset—in this case, the U.S. dollar. Unlike the other leading USD-pegged stablecoins Tether and Circle’s USD Coin, Paxos only issues USDP on Ethereum owing to restrictions from DFS.\n\nPaxos has argued that its commitment to working directly with DFS on issuance, rather than operating outside the framework of a financial regulator, sets it apart from competitors. While Tether is often critiqued for its offshore, opaque operations, Circle also presents itself as following U.S. regulatory standards, although it does not issue USDC under DFS supervision. As a result, Circle offers USDC across more than a dozen blockchains, including Tron, which has come under fire in recent months for facilitating illicit finance.\n\n“From a growth perspective, you’d like to issue across every single chain,” Hessert said. “Circle and other players can issue on to other protocols, but no one knows who’s overseeing it—or what their process is.”\n\nHe argued that Paxos’s approach helps gain trust with its partners, including major financial players like MercadoLibre, PayPal, and Mastercard, that customer protections are in place.\n\nEven so, Paxos has had its missteps. One of its first stablecoins, BUSD, was issued in partnership with leading crypto exchange Binance. After reports surfaced that Binance was creating a synthetic version of the stablecoin with questionable reserves, DFS ordered Paxos to stop issuing the token. As Fortune later reported, over 95% of Paxos’s revenue came from that partnership.\n\nHello, Solana\n\nPaxos received a “non-objection” from DFS to expand USDP from Ethereum to Solana, after what a spokesperson described as an “extensive and exhaustive review,” although the firm declined to specify how long the process took.\n\nWhile Hessert declined to say what type of information DFS required for the Solana expansion, citing the confidential supervisory process, he said it involved an internal risk framework built by Paxos to assess the blockchain and its processes, including its compliance protocols.\n\nFirst launched in early 2020 with the promise of increasing transaction speeds and reducing costs compared with Ethereum, Solana became one of the most popular blockchains before taking a major hit last year owing to its association with Sam Bankman-Fried. While its native token, SOL, is still far off from its all-time high of about $260, it has gained substantial traction over the past month.\n\nHessert said Solana’s speed and cost relative to Ethereum will make it an attractive option for Paxos’s partners, who aim to implement stablecoin in use cases from cross-border remittances to payments for goods and services.\n\n“We’re actually going to start to see this new wave of adoption be enabled in ways that we haven’t seen in stablecoins yet,” he told Fortune.\n\nFor now, Paxos’s highest-profile project is its new stablecoin PYUSD, issued in partnership with PayPal. Hessert said he imagines that firms like PayPal will want to expand to Solana. Paxos’s first Solana-based offering will be USDP, which has a market cap of just $370 million, compared with nearly $25 billion for USDC and nearly $94 billion for Tether.\n\nA spokesperson for PayPal declined to comment.\n\nHessert said Paxos hopes to gain approval to issue stablecoins across other layer-1 and layer-2 blockchains, although he declined to provide specific examples."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxQeG9oUlpidWFtNkJHQ3VybXZxZHQtR00yQWpEZXViZExLaTJ0MlFScWFpYlM5SXdDQ2U2aHZXZWFYYTlBTmFhUzZMZUZuQ1Z2cmR3Qzh6V2FVTnpRX2s5OHNoTUllem9nSHRoZG0wSVVCZzVfYlNkX0tnZkE0S0NMVXlLNDBWOVN4QnlkSWZmQ3lwaVVQcnNnQzhoSG1SLWRwakp3RHZpYjFrNllxT1lEZWVKYVdZeWFTc2RsLXdKUVhCQWo0NEZEbnBpZmg5T3JZQUVxWjFB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Dec 2023 08:00:00 GMT",
        "title": "Hashnote e Lido danno il via ad una soluzione di crypto staking liquido su Ethereum per gli utenti istituzionali - The Cryptonomist",
        "content": "Hashnote, a Miami-based technology company focused on institutional investments, has just launched the stETH Fund: a regulated fund that allows for compliant and transparent participation in Ethereum’s liquid staking by leveraging the renowned Lido platform.\n\nHasnote acts as a gateway between clients who are looking for security in the investment world and a fund manager regulated by the CFTC.\n\nThe birth of this particular product reflects the increasingly growing demand from users who want to enter the crypto world, particularly in the liquid staking of Ethereum, without having the necessary skills to face the challenges of decentralized finance.\n\nIn the meantime, other investment solutions in Lido and other more complex LSD platforms are also emerging, mainly dedicated to more experienced individuals.\n\nLet’s see all the details below.\n\nHashnote launches stETH Fund and opens up to investments in liquid staking of Ethereum based on Lido\n\nYesterday, the on-chain financial technology company Hashnote officially launched the stETH Fund investment product which allows investing in liquid Ethereum staking through a regulated fund that relies on the LSD Lido Finance platform.\n\nThe goal of Hashnote is to merge the transparency of the blockchain world with its ability to comply with the requirements of US market supervisory bodies such as CFTC, offering a crypto investment solution primarily to institutional clients.\n\nThe Miami technology company has noticed how liquid staking on Ethereum has been growing steadily for several months, able to incorporate about 24% of the total ETH supply on the market, and has decided to strongly focus in this direction with a regulated fund.\n\nstETH Fund is built on the decentralized liquid staking middleware open-source Lido, which represents the undisputed leader in this niche sector.\n\nFor investors who rely on this product, there are multiple advantages:\n\nReliability: the product has been designed to meet the highest standards required by institutional investors;\n\nthe product has been designed to meet the highest standards required by institutional investors; Compliance: Hasnote is regulated by the Commodity Futures Trading Commission (CFTC) as a CPO and its funds are registered with the Cayman Islands Monetary Authority (CIMA) as mutual funds. Furthermore, the offered structure is compliant in terms of KYC/AML, providing a compliance front also for the verification of the participants’ identity;\n\nHasnote is regulated by the Commodity Futures Trading Commission (CFTC) as a CPO and its funds are registered with the Cayman Islands Monetary Authority (CIMA) as mutual funds. Furthermore, the offered structure is compliant in terms of KYC/AML, providing a compliance front also for the verification of the participants’ identity; Safety: Hashnote Smart Contract Vault is managed by MPC (multi-party computation) wallets and is impervious to cyber attacks. The whitelist of client/wallet addresses is maintained and enforced by the proprietary smart contract of Hashnote. The smart contract code is audited by third parties;\n\nHashnote Smart Contract Vault is managed by MPC (multi-party computation) wallets and is impervious to cyber attacks. The whitelist of client/wallet addresses is maintained and enforced by the proprietary smart contract of Hashnote. The smart contract code is audited by third parties; Maximized earnings: the investment in stETH Fund is characterized by maximizing the yield obtained on Lido. This allows for liquidity while staking Ethereum;\n\nthe investment in stETH Fund is characterized by maximizing the yield obtained on Lido. This allows for liquidity while staking Ethereum; Easy to use: the reference interface is easy to use, intuitive, and allows effortless monitoring.\n\nAmong the other features of the regulated fund of Hashnote that invests in liquid Ethereum staking supported by Lido, we see the possibility of a T+0 refund, made possible by the breadth of the portfolio managed by the provider and a redemption with zero slippage in the unstaking process.\n\nIn addition, stETH Fund does not have any financial leverage, making it a less risky product compared to other similar derivatives.\n\nFinally, we must mention the minimal risk of the DeFi protocol Lido, the automation of compounding rewards, the diversification of node operators staking on Ethereum, and a smooth and efficient operation.\n\nThe state of the crypto LSD market on Ethereum: increasingly innovative investment options\n\nSince the “Shapella” update went live on Ethereum, opening up the possibility for chain users to unstake previously locked ETH, liquid staking platforms like Lido have started to see increasingly growing numbers.\n\nCurrently, all LSD applications hold a total of over 12.03 million ETH locked on the beacon chain, corresponding to approximately 26.827 billion dollars.\n\nThis data corresponds to almost 42% of all Ether staked in Ethereum 2.0 contracts.\n\nLido in particular is the undisputed leader in liquid staking and accounts for about 76% of this market niche, in addition to holding the record for the DeFi protocol with the highest TVL of 20.37 billion dollars.\n\nFollowing are names that boast a significant percentage of ETH in this context, such as, for example, RocketPool (8.77%), Binance Staked ETH (6.46%), Frax Ether (2.56%), Coinbase Wrapped Staked ETH (1.62%), Mantle Staked ETH (1.26%), and StakeWise (0.79%).\n\nThe success of this type of platforms is due to several reasons.\n\nFirst of all, liquid staking offers a convenient solution for those who intend to hold ETH but also want to simultaneously earn a yield and use parallel liquidity for crypto exchanges.\n\nSecondly, the ways in which the liquid tokens of these protocols, such as stETH, wstETH, frxETH, and many others, are integrating with other DeFi dapps offer significant advantages to stakers who can sometimes benefit from double yield.\n\nFinally, there is also a “convenience” speech since many LSD projects have announced or hinted that they will reward their users who have used Ethereum’s liquid staking with an airdrop.\n\nIn this regard, a few weeks ago the layer-2 Blast, which integrates the “native yield” formula and relies on Lido and MakerDAO, reached a TVL of over 920 million dollars, demonstrating all the interest in this sector.\n\nThere are also many other smaller platforms that have still managed to cover a good percentage of all the ether locked in LSDs: among these we find EigenLayer, Swell, Kelp, Morpho, Diva Staking, EtherFi, Mev Staking and many others.\n\nThe Twitter user “Olimpio Crypto” has created a collection of all these dapps that still do not have a native token and will probably launch it through an airdrop."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE9IcldoY2otUkNwQ3BnRkRpeEo0TWhJbnNDNG1wSVcxRXozWFIyXzNQSzcwLUR2YzJ4RnRKSk1nQ25oX2hqUlhSZUxENUlDQlk5YlJfM015TkxucURMOWc3N003aHR6alczT2stRFBZZU8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin leaves the rest of the crypto market behind - Financial Times",
        "content": "Print this page\n\nSimply sign up to the Fintech myFT Digest -- delivered directly to your inbox.\n\nHello and welcome to the final edition this year of the FT Cryptofinance newsletter. This week, we’re looking at the digital coin that bitcoin is threatening to leave behind. We’ll be back on January 13th.\n\nOne common — and not always unfair — criticism made by crypto enthusiasts is that the wider world conflates bitcoin and cryptocurrencies.\n\nIf the subject comes up over Christmas, chances are family and friends will use the two interchangeably. In their minds bitcoin IS the crypto market. Yet people working around it, or even have more than a passing interest, know there is much more going on.\n\nRight now, bitcoin is in a happier place than it has been for 18 months, supported by speculation that the SEC will approve a bitcoin exchange traded fund after Christmas. But the rest of the market doesn’t quite have that same warm fuzzy feeling.\n\nA large chunk of “the rest” is ether, the second largest cryptocurrency on the market, because of the blockchain it represents, ethereum.\n\nEthereum has always been a more ambitious project than the bitcoin blockchain, which is a database for transactions. It can hold assets and lets programmers code functions for buying and selling into smart contracts. That means it is the foundation for so much of the industry’s non-bitcoin activity ranging from decentralised finance (DeFi) projects and NFTs to gaming.\n\nHistorically, these markets have given ethereum a unique position of strength over competing blockchains: if one sector of the industry explodes, so should ether.\n\nBut while ether has climbed a respectable 93 per cent this year, it has underperformed bitcoin (up 162 per cent), Solana (up over 550 per cent), and Cardano (up 154 per cent).\n\n“This year ether has been totally outshined by the excitement related to bitcoin,” said CK Zheng, co-founder and chief investment officer at crypto hedge fund ZK Squared Capital.\n\nFor ether, the problem is that these cutting-edge crypto projects, like decentralised finance, NFTs and gaming — the ethereum network’s bread and butter — still haven’t shaken off their past.\n\nProjects like DeFi crypto exchange Uniswap have yet to generate any mainstream buzz, crypto-inspired games like Axie Infinity are today synonymous with North Korean hacking exploits, and NFTs have only recently made headlines for blinding party goers in Hong Kong.\n\nAs far as the non-bitcoin crypto market is concerned, the coins that have performed best this year are the ones exploring the links between crypto and artificial intelligence.\n\n“The demand for AI investments has found its way into crypto,” said Ram Ahluwalia, chief executive at investment adviser at Lumida Wealth Management. “Crypto tokens linked to AI have emerged as one of the strongest crypto investing themes,” he added.\n\nWhether there are overlaps between crypto and AI is a theme for another day. For now, they are the kingfishers catching the sunlight. “It’s not surprising to see the far superior returns of AI-related tokens compared to other tokens,” added Zheng, adding that these tokens will be “the most exciting theme going into 2024.”\n\nBut ethereum’s lacklustre year behind bitcoin is not all down to being superseded by the latest tech hype cycle. US regulators are still pursuing cases that could end up defining ether and other crypto tokens as securities.\n\nAnd ethereum also has to face up to its own disappointments. In September last year the network underwent a supposedly revolutionary surgery with the “Merge”. It was a technical operation, blending one ethereum blockchain with another, but came with big promises.\n\nBefore the Merge, if the ethereum network were a country, it would have ranked in the world’s top 35 by energy consumption, surpassing nations like Belgium and Finland.\n\nThe Merge virtually eliminated the network’s carbon footprint, and when I dedicated 2,500 words to ethereum’s supposed revolution, everyone I spoke to told me it was the removal of the biggest obstacle to mainstream adoption. Ether would even come on to the radars of ESG-conscious investors.\n\nIn fact, the anticipation for a record-setting future was so intense that YouTube’s former head of gaming Ryan Wyatt told me that crypto could soon focus on “onboarding the next billion users.”\n\nBut the price of ether fell in the months after the Merge, and while it has recovered, those billion users haven’t materialised.\n\n“If the expectation was that the Merge would boost investments from ESG-minded investors I think that expectation would be premature,” said Alex de Vries, co-founder of Digiconomist, a website that tracks the environmental impact of the crypto industry.\n\nInstead, ether is at risk of being eclipsed by bitcoin. At the time of the Merge, bitcoin’s market capitalisation represented roughly 40 per cent of the entire crypto market and ethereum’s share was 18 per cent, according to industry data aggregator CoinMarketCap.\n\nToday ethereum accounts for 17 per cent while bitcoin’s share has expanded to 52 per cent.\n\nIf conversations with family and friends this Christmas do veer down the cryptocurrency road, good luck in explaining it. And even better luck in explaining how it’s not all about bitcoin.\n\nWhat’s your take on ether’s future? As always, email me your thoughts at scott.chipolina@ft.com.\n\nWeekly highlights\n\nEarlier this week failed crypto exchange FTX settled with its debtors after its collapse in November last year. The agreement, subject to the approvals of the US bankruptcy court and Supreme Court of The Bahamas, will pool the assets of the FTX debtors and exchange’s Bahamian unit to ensure customers receive “substantially identical relative distributions.”\n\nETF speculation heated up yet again this week when BlackRock — the largest asset manager in the world — disclosed in a fresh filing with the Securities and Exchange Commission that its proposed fund would only allow new shares to be created with cash, instead of bitcoin. The move, while hardly groundbreaking, was taken as yet another sign that the Wall Street giant is making headway with the regulator.\n\nSoundbite of the week: A big freeze from the BVI\n\nRemember Kyle Davies and Su Zhu, founders of collapsed crypto hedge fund Three Arrows Capital? Sadly the courts won’t leave them alone to continue painting and surfing.\n\nA court in the British Virgin Islands this week issued a worldwide freezing order hitting over $1bn of their assets. The order also goes after Kelly Chen, Davies’s wife, representing the latest effort by the liquidators to return assets to creditors of the collapsed business.\n\nThe order turns up the heat on the disgraced founders by closing as many possible avenues available to access funds. Zhu was imprisoned in Singapore in September for four months for failing to co-operate with investigations into Three Arrows’ failure; the whereabouts of Davies remains unknown.\n\n“The order is specifically designed to prevent the founders and Ms Kelly Chen from disposing of or otherwise dealing with assets in any way that might frustrate eventual enforcement by the liquidators.”\n\nData Mining: Tether’s Christmas naughty list\n\nLast month Tether, the company behind the largest stablecoin, signed up the US Department of Justice, Federal Bureau of Investigation and the US Secret Service to help prevent illicit use of its USDT token.\n\nUnsurprisingly the number of blacklisted Tether wallets has shot higher. Total numbers of banned wallets are up 20 per cent to 1,236 so far this month, according to CCData.\n\nFT Cryptofinance is edited by Philip Stafford. Please send any thoughts and feedback to cryptofinance@ft.com."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE9IcldoY2otUkNwQ3BnRkRpeEo0TWhJbnNDNG1wSVcxRXozWFIyXzNQSzcwLUR2YzJ4RnRKSk1nQ25oX2hqUlhSZUxENUlDQlk5YlJfM015TkxucURMOWc3N003aHR6alczT2stRFBZZU8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 22 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin leaves the rest of the crypto market behind - Financial Times",
        "content": "Print this page\n\nSimply sign up to the Fintech myFT Digest -- delivered directly to your inbox.\n\nHello and welcome to the final edition this year of the FT Cryptofinance newsletter. This week, we’re looking at the digital coin that bitcoin is threatening to leave behind. We’ll be back on January 13th.\n\nOne common — and not always unfair — criticism made by crypto enthusiasts is that the wider world conflates bitcoin and cryptocurrencies.\n\nIf the subject comes up over Christmas, chances are family and friends will use the two interchangeably. In their minds bitcoin IS the crypto market. Yet people working around it, or even have more than a passing interest, know there is much more going on.\n\nRight now, bitcoin is in a happier place than it has been for 18 months, supported by speculation that the SEC will approve a bitcoin exchange traded fund after Christmas. But the rest of the market doesn’t quite have that same warm fuzzy feeling.\n\nA large chunk of “the rest” is ether, the second largest cryptocurrency on the market, because of the blockchain it represents, ethereum.\n\nEthereum has always been a more ambitious project than the bitcoin blockchain, which is a database for transactions. It can hold assets and lets programmers code functions for buying and selling into smart contracts. That means it is the foundation for so much of the industry’s non-bitcoin activity ranging from decentralised finance (DeFi) projects and NFTs to gaming.\n\nHistorically, these markets have given ethereum a unique position of strength over competing blockchains: if one sector of the industry explodes, so should ether.\n\nBut while ether has climbed a respectable 93 per cent this year, it has underperformed bitcoin (up 162 per cent), Solana (up over 550 per cent), and Cardano (up 154 per cent).\n\n“This year ether has been totally outshined by the excitement related to bitcoin,” said CK Zheng, co-founder and chief investment officer at crypto hedge fund ZK Squared Capital.\n\nFor ether, the problem is that these cutting-edge crypto projects, like decentralised finance, NFTs and gaming — the ethereum network’s bread and butter — still haven’t shaken off their past.\n\nProjects like DeFi crypto exchange Uniswap have yet to generate any mainstream buzz, crypto-inspired games like Axie Infinity are today synonymous with North Korean hacking exploits, and NFTs have only recently made headlines for blinding party goers in Hong Kong.\n\nAs far as the non-bitcoin crypto market is concerned, the coins that have performed best this year are the ones exploring the links between crypto and artificial intelligence.\n\n“The demand for AI investments has found its way into crypto,” said Ram Ahluwalia, chief executive at investment adviser at Lumida Wealth Management. “Crypto tokens linked to AI have emerged as one of the strongest crypto investing themes,” he added.\n\nWhether there are overlaps between crypto and AI is a theme for another day. For now, they are the kingfishers catching the sunlight. “It’s not surprising to see the far superior returns of AI-related tokens compared to other tokens,” added Zheng, adding that these tokens will be “the most exciting theme going into 2024.”\n\nBut ethereum’s lacklustre year behind bitcoin is not all down to being superseded by the latest tech hype cycle. US regulators are still pursuing cases that could end up defining ether and other crypto tokens as securities.\n\nAnd ethereum also has to face up to its own disappointments. In September last year the network underwent a supposedly revolutionary surgery with the “Merge”. It was a technical operation, blending one ethereum blockchain with another, but came with big promises.\n\nBefore the Merge, if the ethereum network were a country, it would have ranked in the world’s top 35 by energy consumption, surpassing nations like Belgium and Finland.\n\nThe Merge virtually eliminated the network’s carbon footprint, and when I dedicated 2,500 words to ethereum’s supposed revolution, everyone I spoke to told me it was the removal of the biggest obstacle to mainstream adoption. Ether would even come on to the radars of ESG-conscious investors.\n\nIn fact, the anticipation for a record-setting future was so intense that YouTube’s former head of gaming Ryan Wyatt told me that crypto could soon focus on “onboarding the next billion users.”\n\nBut the price of ether fell in the months after the Merge, and while it has recovered, those billion users haven’t materialised.\n\n“If the expectation was that the Merge would boost investments from ESG-minded investors I think that expectation would be premature,” said Alex de Vries, co-founder of Digiconomist, a website that tracks the environmental impact of the crypto industry.\n\nInstead, ether is at risk of being eclipsed by bitcoin. At the time of the Merge, bitcoin’s market capitalisation represented roughly 40 per cent of the entire crypto market and ethereum’s share was 18 per cent, according to industry data aggregator CoinMarketCap.\n\nToday ethereum accounts for 17 per cent while bitcoin’s share has expanded to 52 per cent.\n\nIf conversations with family and friends this Christmas do veer down the cryptocurrency road, good luck in explaining it. And even better luck in explaining how it’s not all about bitcoin.\n\nWhat’s your take on ether’s future? As always, email me your thoughts at scott.chipolina@ft.com.\n\nWeekly highlights\n\nEarlier this week failed crypto exchange FTX settled with its debtors after its collapse in November last year. The agreement, subject to the approvals of the US bankruptcy court and Supreme Court of The Bahamas, will pool the assets of the FTX debtors and exchange’s Bahamian unit to ensure customers receive “substantially identical relative distributions.”\n\nETF speculation heated up yet again this week when BlackRock — the largest asset manager in the world — disclosed in a fresh filing with the Securities and Exchange Commission that its proposed fund would only allow new shares to be created with cash, instead of bitcoin. The move, while hardly groundbreaking, was taken as yet another sign that the Wall Street giant is making headway with the regulator.\n\nSoundbite of the week: A big freeze from the BVI\n\nRemember Kyle Davies and Su Zhu, founders of collapsed crypto hedge fund Three Arrows Capital? Sadly the courts won’t leave them alone to continue painting and surfing.\n\nA court in the British Virgin Islands this week issued a worldwide freezing order hitting over $1bn of their assets. The order also goes after Kelly Chen, Davies’s wife, representing the latest effort by the liquidators to return assets to creditors of the collapsed business.\n\nThe order turns up the heat on the disgraced founders by closing as many possible avenues available to access funds. Zhu was imprisoned in Singapore in September for four months for failing to co-operate with investigations into Three Arrows’ failure; the whereabouts of Davies remains unknown.\n\n“The order is specifically designed to prevent the founders and Ms Kelly Chen from disposing of or otherwise dealing with assets in any way that might frustrate eventual enforcement by the liquidators.”\n\nData Mining: Tether’s Christmas naughty list\n\nLast month Tether, the company behind the largest stablecoin, signed up the US Department of Justice, Federal Bureau of Investigation and the US Secret Service to help prevent illicit use of its USDT token.\n\nUnsurprisingly the number of blacklisted Tether wallets has shot higher. Total numbers of banned wallets are up 20 per cent to 1,236 so far this month, according to CCData.\n\nFT Cryptofinance is edited by Philip Stafford. Please send any thoughts and feedback to cryptofinance@ft.com."
    }
]