[
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxNT25IUm5YU1JzcnI3WmtKMkdCY2lfejRVNTRJbGl2VVcwMjJFMTByaVpFbXlJQzBadG0yUDlsNWowOWg3TTBldVVRQklnTkd2Z19LYURoWEgyUjZFUUhjUW5MVmdIV0xEVjdneExxZ0drUkJ4UWhGdUhJSXZ4Zk4tczlxOEZuZU3SAY8BQVVfeXFMUG5oQjZjYzdWV19EeDg3X24tM25wSFpJWVRQN2kwRC1qTklqdjZfaGhuTTlrWkcyVElKX3RNVURabVNtdnZnR3NaZXFuSlpGaXZDdGdDZEJxQ3gydWtGUXJ3SlVZUm4xT0l5RHd0NXQtUmNVY05hbkc2Yl9ZV0NvUExydWVxQW5UOHZBTG9ORlU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Dec 2023 08:00:00 GMT",
        "title": "SOL Surges 13% as Solana NFTs Overtake Ethereum, BONK Up 26% - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nSolana’s upward momentum continued unabated into Friday, with SOL posting double-digit gains and Solana’s leading meme coin BONK extending its skyrocketing surge to another all-time high. Amid the price action, Solana NFTs are also seeing substantially more trading volume—even higher than on Ethereum.\n\nSOL popped as high as $73.85 early Friday, marking a new 19-month peak for Solana’s native cryptocurrency. While still far from its all-time high of nearly $260 in November 2021, SOL has seen a dramatic rebound from falling to almost $8 in late 2022. As of this writing, Solana sits at just above $73, marking a 13% jump in the last 24 hours per CoinGecko.\n\nMeanwhile, BONK—the top meme coin on Solana—has continued its rocket ship ride up the charts in recent weeks, setting a new all-time high price of $0.00001314 early Friday.\n\nEven down to $0.00001230 as of this writing, BONK has posted a 24% gain in the past 24 hours, and has tripled in price over the past seven days. During the last month, BONK is up a whopping 982%, flinging the token into the top 100 cryptocurrencies by market cap for the first time. BONK now has a market cap of $747 million.\n\nAD\n\nAD\n\nMeanwhile, the recipients of Thursday’s Jito airdrop are sitting even prettier. The Solana DeFi platform’s new JTO token was handed out to thousands of early users, with the airdrop valued at $225 million in total as of late Thursday. But now the price has jumped 72% over the past day to $3.35 per token.\n\nBuzz around Solana extends to its NFT collections, too.\n\nProjects like Mad Lads and Tensorians have seen dramatic price increases in recent weeks, multiplying several times in price. And now, collective Solana NFT trading volume has topped that of Ethereum, typically the leading chain for volume and having the most valuable projects.\n\nSolana NFTs racked up $14.8 million worth of trades over the past 24 hours, per data from CryptoSlam, compared to about $13.9 million worth on Ethereum. It’s due to a sizable boost in Solana trades, which have seen their volume grow about 92% in the past day.\n\nAD\n\nAD\n\nTensorians, which is tied to the Tensor NFT marketplace, is the top traded project during that span with over $4 million worth of sales.\n\nTensor, which rose to prominence earlier this year, is currently dominating on Solana with nearly 76% market share over the past 24 hours per data from Tiexo. Magic Eden, the multi-chain marketplace that previously owned the Solana space, has about 16% share during that span.\n\nEdited by Stacy Elliott."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxQSTdCdllnWUE0d290OVM5R0RDUmhHLWhvMVNqSWtRM3NYSHVEVjdQbU5sbEY4Nm51dUNrQWxBRnNPUkxqNWZsSFMtaVlGeTB2anp1UTU3NUJRRGdxbXJMU01tZEF5Vk1lMFBCcmV6YXZqbDZIR3FuM0ZpZFl2dGhWbktWQUXSAYwBQVVfeXFMTm9MM0plUjVTQjNLbWp4b0JtQWx0bmtQMWxqZTRjMC1lZDRTa2NKZU4tZ3ViSFFSWk9uVDdYa0dBV1E5VUloMk5MYjVKcjRzRUxUcnB0SWQ1VzVmS3B0QldEUXctRTYwTkprV0RCbnIteV9ZaUtXRDlGY2l4TTlUWnM1MEdiM1FyODZoM28?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Layer-2 Starknet Reveals STRK Token Airdrop - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe airdrops keep coming.\n\nThe team behind Starknet, a layer-2 Ethereum scaling network, plans to allocate over 1.8 billion STRK tokens to community members and stakeholders, according to an announcement made Friday by the Starknet Foundation.\n\nThe Starknet Foundation did not give a timeline for the airdrops, stating only that the first phase of the giveaway will begin “soon.”\n\nSome 900 million STRK tokens have been allocated to “reward past and future contributions by users and community members.” What exact criteria will dictate which Starknet users will receive those tokens, and how many, has not yet been announced.\n\nAD\n\nAD\n\nNow that the news is out, we might as well tell you more! Starknet is about each of you. Every user, builder and member of our community – existing and future – is a critical piece to building our network into the future of decentralisation for generations to come. The success… — Starknet Foundation (@StarknetFndn) December 8, 2023\n\nA further 900 million STRK will go towards user rebates, the Starknet Foundation said. Planning for that initiative is still underway, but it appears it will recoup the cost of some amount of network transaction fees for Starknet users.\n\nBeyond those 1.8 billion tokens, the blockchain’s overseers also intend to distribute an additional 50 million STRK tokens to incentivize decentralized finance (DeFi) activity on Starknet. These tokens will be directly, indirectly, and retroactively distributed to Starknet DeFi users, according to the Starknet Foundation.\n\nStarknet community members were quick to celebrate the announcement, hailing it as a major boon for the blockchain.\n\nAD\n\nAD\n\n$Stark is about the community, 1.8B tokens for the community, 50M token for Defi chads.. multipliers incoming..! — BMS (@bloomstarbms) December 8, 2023\n\nAnd they have good reason to be in high spirits: similar airdrops made by other blockchain projects have flooded crypto users with hundreds of millions of dollars worth of free tokens in recent weeks.\n\nOn Thursday, a similar airdrop by Solana-based DeFi platform Jito put $225 million worth of freshly minted JTO tokens in the hands of users and community members. Late last month, an airdrop for DeFi oracles network Pyth gave away $77 million worth of PYTH tokens.\n\nAirdrops have become an increasingly popular way for crypto projects—and recently, DeFi projects in particular—to attract a larger user base and encourage loyalty among existing community members.\n\nStarknet, which uses zero-knowledge rollups to make on-chain Ethereum transactions faster and cheaper, has already seen tremendous growth this year. This spring, the network’s total value locked (TVL) increased ten-fold, from $1.45 million to over $10 million. Since then Starknet’s TVL has tripled again, to $33.84 million at writing, according to DeFi Llama.\n\nEdited by Andrew Hayward"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxNaEtxcEV1MzVpcmMxcm5IOGtSaFk2YXhmTU45RVBoZ3dmTGFmZ29HNHNEUDlOUUVWQ2M3dlFTVDZpWmROaWdhU0dYNEZnV2JvVWgtSWdGSHhhdURtNElHSkNpUllBZVJadU9RMkJGX3pTcHN0ZWVReGpjdG5xZFpLVUJlQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Dec 2023 08:00:00 GMT",
        "title": "Ethereum developers set roadmap for an eventful 2024 - CryptoSlate",
        "content": "Ethereum (ETH) developers have outlined a comprehensive plan for the network’s development in 2024, including significant upgrades and new proposals after their latest execution layer meeting on Dec. 8.\n\nA key focus is on the deprecation of the Goerli testnet, with a fork scheduled for early 2024. This move is part of the strategy to activate ‘Dencun’ on the Ethereum network in January, marking a significant advancement in its technological capabilities.\n\nDencun Activation\n\nThe Dencun upgrade will introduce a novel concept in transaction processing termed ‘blob-carrying transactions.’ In this context, ‘blobs’ is an acronym for ‘Binary Large Objects’. The primary purpose of these blobs is to refine the way Ethereum stores and retrieves data by reducing the amount of data that must be stored indefinitely on the Ethereum blockchain.\n\nConsequently, the transaction costs associated with data storage are expected to decrease, making overall transactions more economical. It is a critical step toward the long-term goal of danksharding, a planned scaling solution that breaks the network into smaller, parallel segments (shards) to increase capacity and efficiency.\n\nAnother notable development is the introduction of a new proposal aimed at enhancing the power of Execution Layer (EL) clients. The proposal, designed to counteract potential censorship in the mempool, would enable EL clients to override local builders using various heuristics.\n\nFor instance, clients could override when detecting transactions with excessively high fees pending for extended periods. However, adopting such heuristics has not yet been implemented broadly, with only Geth currently having an open pull request on the issue.\n\nIn terms of process updates, the development of a Meta Ethereum Improvement Proposal (EIP) for Dencun has been a significant milestone. This is complemented by a draft for a “Meta EIP backfill,” which aims to provide specifications for upgrades previously lacking Meta EIPs.\n\nThe discussion around Meta EIPs has been vital in simplifying access to fork specifications, although there is an ongoing conversation about their role and naming conventions, according to ETH developer Tim Beiko.\n\nPrague/Electra upgrade\n\nLooking forward, the Ethereum community is preparing for the Prague/Electra network upgrade. Among the proposals for this upgrade is EIP-6110, which proposes a new method for supplying validator deposits on-chain, replacing the older Eth1 bridge system.\n\nFuture upgrades may also include Verkle Tries on the Execution Layer and Data Availability Sampling (DAS) on the Consensus Layer, necessitating in-depth technical reviews and discussions.\n\nThe Ethereum community is encouraged to take an active role in shaping the future of the network by participating in these technical discussions and expressing their preferences for potential features in the upcoming upgrades through forums and GitHub threads.\n\nClient teams are set to review these proposals, with more detailed discussions planned for January. This planning forms part of the broader strategic development of the Ethereum network, reflecting the continuous efforts by the developer community to evolve and refine the platform.\n\nThe Ethereum developer community remains actively engaged in enhancing the network’s capabilities, with a clear roadmap set for 2024. The upcoming developments and proposals highlight the network’s ongoing commitment to innovation and responsiveness to community feedback."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMia0FVX3lxTFBMTGRqVXlQNEdBWDJQSUFwSzhCRmRKRFNuMkJUbnFNZHR4ZlBmclBpWmgtZmQ3WmhGTTVGMXk4bkUtSlpocGVscEhxeXUyUjI1YjZjM0N5ZDRBUTNGWlo1bTVsc0ZKeWJuZW5v?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Dec 2023 08:00:00 GMT",
        "title": "Starknet Foundation teases STRK token airdrop - Blockworks",
        "content": "Starknet, a zk-proof-based Ethereum layer-2, is taking a significant step towards decentralizing its network and fostering community engagement.\n\nThe Starknet Foundation outlined its plan to distribute over 1.8 billion STRK tokens through various initiatives aimed at driving adoption and growth on its blockchain platform.\n\nThe token, which is not currently transferable or tradable, was first deployed on Ethereum in November 2022, and ever since speculation has been rife that the network would eventually conduct an aggressive program of community incentives and a retroactive airdrop targeting active Starknet users.\n\nAn X thread on Friday from the Starknet Foundation brought the contours of this eventual distribution into clearer relief.\n\nAt the heart of the initiative is a “provisions committee,” entrusted with the responsibility of allocating 900 million STRK tokens. This committee’s goal is to ensure a “fair, decentralized and transparent distribution of STRK over multiple programs and phases,” according to the Foundation.\n\nIts objective is to distribute ownership of the network’s native token and to reward past and future contributions.\n\nHow exactly this will be done remains to be seen, and a Starkware spokesperson declined to comment further.\n\nThe Starknet Foundation, incorporated in the Cayman Islands, is independent of Starkware Industries, which is headquartered in Netanya, Israel, but its seven person board includes both Starkware co-founders Eli Ben-Sasson and Uri Kolodny.\n\nThe company was valued at $8 billion following its 2022 Series D fundraise.\n\nIn addition to rewarding contributions, the Starknet Foundation aims to reward users for their transactions on the Starknet network, such as offering rebates for transaction fees.\n\nStarknet fees are denominated in ether, and the network posts zero-knowledge proofs of execution of transaction batches to Ethereum mainnet — a security and scaling mechanism.\n\nRead more: So your layer-2 is ‘secured by Ethereum’ — what does that mean?\n\nThe Starknet Foundation is also exploring ways to incentivize activity in the decentralized finance (DeFi) sector, working with an initial allocation of 50 million STRK tokens. A six-member “DeFi Committee,” currently concluding its research phase, will soon start implementing strategies to enhance liquidity, trading volume and overall growth of DeFi protocols on Starknet.\n\nRead more: Starkware’s new appchain attracts DeFi derivatives dex with CeFi liquidity\n\nStarknet teased that further details on its incentive mechanism aimed at developers and decentralized applications (dapps) on the Starknet network would be forthcoming next week.\n\nSince the token currently has no secondary market, it’s challenging to ascribe a value to the planned distribution, but layer-2 peers Polygon, Optimism and Arbitrum currently boast fully-diluted markets caps of between $8 billion and $11 billion.\n\nThe total supply of STRK tokens is 10 billion, of which 5 billion were allocated to the Starknet Foundation.\n\nThe airdrop is one of many anticipated in 2024 related to Ethereum layer-2 networks, such as LayerZero and zkSync.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxPcDZKa3Q5SC1XUTVuMzZOWHd1Z1pidGZHNF9KQk5aMFdXTm9iMWpsWU9DSmlnc1loaU9tcjVoY3NEcVdQRHNDWVg1ZmpPcS1qSVROUVBRd3Nab3FFVGtqSlBlUUk3MHF3SHVHRlJoOGRiaDRXRk1nNnVicWlLZnItMUJLM041ODE2WGZscEZGNVYzdi11?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Dec 2023 08:00:00 GMT",
        "title": "VanEck predicts $40B inflow into Bitcoin ETFs and $100k BTC in 2024 - CryptoSlate",
        "content": "Global investment management firm VanEck‘s 2024 predictions for crypto suggest a transformative year ahead for the sector, highlighting pivotal events and trends set to redefine the digital asset landscape from economic fluctuations to groundbreaking technological advancements.\n\nThe forecasts are based on analysis beyond just the crypto sector, looking at economic trends, technological developments, and regulatory dynamics. From the anticipated U.S. recession’s intertwining with the launch of spot Bitcoin ETFs, aiming to bolster Bitcoin’s resilience above $30,000, to the fourth Bitcoin halving poised to elevate its market value, these predictions spotlight pivotal moments in crypto’s journey.\n\nFurther, VanEck’s outlook predicts Ethereum to retain its position beneath Bitcoin’s market dominance while simultaneously outshining major tech stocks and facing competition from other smart contract platforms. The NFT market, which will be fueled by both Ethereum and Bitcoin in 2024, is expected to scale new heights, reshaping the landscape of digital collectibles. Meanwhile, the stablecoin realm, particularly with USDC, anticipates unprecedented growth.\n\nThe predictions also highlight the potential shift in exchange supremacy, with Binance’s leading spot trading position challenged by emergent rivals. Additionally, DEXs are projected to claim a significant slice of the spot trading market. A breakthrough is anticipated for blockchain-based gaming, with a game surpassing one million daily active users, marking a milestone in mainstream acceptance.\n\nRobbie Ferguson, Co-Founder and President of Immutable, told CryptoSlate,\n\n“Recognition from VanEck, one of the world’s top 10 ETF issuers, is exceptional validation of the work we’ve been doing for web3 games since we built the first decentralized game on any blockchain in 2017[…] This endorsement further validates our platform strategy, and relentless focus on an exceptional end player experience.”\n\nFurthermore, Solana’s ascent to a top-three blockchain position, along with the rise of DePi networks like Hivemapper and Helium, anticipates broad diversification within the blockchain ecosystem.\n\nFinally, a pivotal area highlighted by VanEck is the integration of Know Your Customer (KYC) protocols in decentralized finance (DeFi), expected to usher in a new era of institutional participation. This, along with new corporate accounting treatments for crypto holdings, signals a shift towards mainstream and institutional adoption of cryptocurrencies.\n\nVanEck predicts spot Bitcoin ETF will be approved in Q1.\n\nIn 2024, VanEck predicts the U.S. economy to enter a recession amidst slowing economic momentum and cooling inflation. This downturn, marked by 19 months of consecutive decline in leading indicators, weak commodity markets, and increasing corporate bankruptcies, sets a challenging backdrop. Yet, in this economic landscape, the debut of the first U.S. spot Bitcoin ETFs will be approved in Q1.\n\nVanEck forecasts that these ETFs will attract substantial investment, drawing a parallel with the early success of the SPDR Gold Shares (GLD) ETF launched in 2004. The GLD ETF experienced rapid inflows, capturing a notable fraction of the gold market within its first quarter. Applying these metrics to Bitcoin, adjusted for the current era’s higher money supply, the prediction is a striking initial influx of around $1B, potentially reaching $2.4B within a quarter for Bitcoin ETFs.\n\nThis significant capital flow into Bitcoin ETFs reflects a deeper shift in the financial landscape. With the U.S. Federal Reserve’s M2 money supply considerably higher than during the GLD launch, the potential for Bitcoin ETF inflows is magnified, leading to an estimated $40.4B over the first two years. This surge is partly driven by a predicted preference for Bitcoin as a form of ‘hard money’ amidst concerns over sovereign debt levels and inflation, positioning it as an alternative to gold among investors.\n\nFurthermore, the expected lower transaction costs of these ETFs, compared to current retail trading fees, suggest a potential for broader market adoption. Such cost efficiencies historically have catalyzed the widespread acceptance of new technologies and could similarly propel Bitcoin ETFs into the financial mainstream. Despite the looming recession and potential market volatility, these developments indicate a robust demand for Bitcoin, potentially sustaining its price above $30k in the early phase of 2024.\n\nImpact of the Bitcoin halving and new Bitcoin ATH.\n\nVanEck predicts that the fourth Bitcoin halving event, scheduled for April, will unfold smoothly without major disruptions. This halving is likely to lead to the disconnection of unprofitable miners, shifting the landscape towards those with more efficient, low-cost power solutions. Despite the initial adjustment period, where the market might experience some consolidation, Bitcoin’s value is projected to rise. VanEck predicts that following the halving, Bitcoin’s price could surpass the $48k mark, aligning with the technical pattern observed in April 2022. This uptrend is expected despite some miners potentially underperforming compared to Bitcoin’s price, with low-cost miners like CLSK and RIOT predicted to outshine others. The post-halving period might also see significant growth for at least one publicly traded miner.\n\nThe second half of 2024 could bring even more dramatic developments for Bitcoin. Amid a backdrop of global political shifts and an increase in global voting participation, Bitcoin is anticipated to scale new heights. This period of heightened political activity and potential changes in regulatory landscapes, particularly following a significant U.S. presidential election, sets the stage for Bitcoin to potentially achieve an all-time high. VanEck speculates that by Nov. 2024, Bitcoin could hit a new peak in value, potentially reaching $100k by the year’s end. This scenario, marked by a departure from certain regulatory stances, could lead to a landmark moment for Bitcoin and its perception in the global financial system.\n\nThe Flippening won’t happen, but DeFi will rise.\n\nEthereum is set to make significant strides but will not surpass Bitcoin in market dominance. Ethereum’s performance is expected to outshine even the largest tech stocks, but it will not achieve the long-speculated “flippening” to overtake Bitcoin. Bitcoin’s clearer regulatory status and its appeal due to its energy-intensive mining process are anticipated to draw increased interest from state-backed entities in regions such as Latin America, the Middle East, and Asia. Notably, Argentina might join the ranks of countries like El Salvador and the UAE in state-level Bitcoin mining support, focusing on utilizing stranded methane and gas resources.\n\nSimultaneously, Ethereum’s Layer 2 solutions are poised for substantial growth following the implementation of EIP-4844, which promises to enhance scalability and reduce transaction fees. This upgrade is expected to catalyze a consolidation within the Ethereum network, with two to three Layer 2 chains emerging as dominant players. These leading chains could potentially surpass Ethereum in monthly decentralized exchange (DEX) volume and total value locked (TVL). This shift is likely due to the reduced transaction costs enabling more efficient trading and arbitrage opportunities. By the fourth quarter of 2024, these Ethereum Layer 2 chains collectively might double Ethereum’s current DEX volume and exponentially increase transaction numbers, signaling a significant evolution in Ethereum’s ecosystem.\n\nIn total, VanEck made 15 predictions for crypto in 2024, listed below:\n\nU.S. Recession Arrival and Debut of Spot Bitcoin ETFs Uneventful Fourth Bitcoin Halving Bitcoin’s All-Time High in Q4 of 2024 Ethereum’s Market Position Behind Bitcoin in 2024 Dominance of ETH Layer 2s Post-EIP-4844 NFT Activity Peaks to New Heights Binance Relinquishes Top Position in Spot Trading Stablecoin Market Cap Hits Record High with USDC Market Share Recovery Decentralized Exchanges Attain Record Spot Trading Market Share Bitcoin Yield Opportunities Driven by Remittances and Smart Contract Platforms Emergence of a Leading Blockchain Game Solana Outperforms Ethereum with Resurging DeFi TVL Meaningful Adoption of DePin Networks Corporate Crypto Holdings Boosted by New Accounting Standards DeFi’s Reconciliation with KYC Regulations\n\nThe full report from VanEck is available on the firm’s website.\n\n13.15 GMT: Updated to include comment from Immutable.\n\nMentioned in this article"
    }
]