[
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTFBtQmVlcHllbEJtNDZURmZzS1VXeGRabEgtSlRKc1VNcXdGeXBVb1czM1RxRGxGajkzZFBOYkZiQWZuZmVwSkpEa0xNeEt2QV9uSUc3YUJKNWU1a0Z6aUF6UnE1OWJfNVhiVE5kS0ZfaUZfQ3hJSUE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Nov 2023 08:00:00 GMT",
        "title": "Ethereum ‘smart account’ adoption is low — the first rollup proposal wants to change that - Blockworks",
        "content": "The introduction of Ethereum Foundation’s ERC-4337 account abstraction standard earlier this year drew much attention, but adoption and retention are off to a slow start.\n\nExisting hardware wallets rely on a pair of keys. If those keys are compromised, so are tokens in the wallet. The ERC-4337 standard was instead intended as a new baseline for how users interact with crypto wallets services, including social recovery mechanisms and other multisig options.\n\nThe standard turns Ethereum accounts into “smart accounts,” which are much more flexible to suit the needs of wallet holders.\n\nAccording to data on BundleBear:\n\nWeekly retention for ERC-4337 smart wallets drops as low as 1% for accounts older than five weeks.\n\nAn average smart account only sends five user operations.\n\nRevenue for transaction “bundlers” is also low, currently less than $8,000 per week.\n\nRead more: What Are Smart Contract Wallets? A Beginner’s Guide\n\nAt the time of writing, daily active users are at around 3%, sixdegree data shows. Most smart account users today are on the Polygon network, making up over 66% of all smart account holders and almost all monthly new users by chain.\n\nDespite the low adoption rates on Ethereum, industry participants remain optimistic about the future of smart accounts and have been actively working on proposals to spur usage.\n\nJohn Rising, the co-founder of Stackup, an account abstraction infrastructure company, notes that many existing issues with ERC-4337 can be resolved with the first-ever Rollup Improvement Proposal, RIP-7560.\n\nThe existing ERC-4337 standard is considered a “semi-native+” smart account, where a user does not need a private key because the trustless relay network is designed to forward transactions to the blockchain.\n\nRising believes that the goal is to move towards a “native” smart account, where accounts would be able to specify their own validation logic, completely removing the need for a private key — something that RIP-7560 hopes to do.\n\n“ERC-4337 has always been intended as a stepping stone to native account abstraction. The account abstraction proposal, RIP-7560, is designed to be backwards compatible with ERC-4337,” Rising told Blockworks.\n\nFurther discussions around the proposal and its applicability must still be considered. Native account abstraction has drawn concerns over the complexity it adds, as it introduces consensus layer changes rather than just high-level infrastructure layer modifications.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPbUZhVW13bGpsS2RZSEVWNTByUXFtVWR5eVFVUnpzZGtOV0xkOHhtV1o4MUtGSFkzLTQweEdKSkhHMHFsTVkxQi10Z3NPQ3VwdEYyd2lSRTBnMEg5N1Y4cW0xcDlHaUl5VllfVUV4OGFBZl9yRDdZQUJfLWRVcWVZVnpXU2dQT3Mw0gGQAUFVX3lxTE5WLXdnejZSUXkwWVA4a3BaaE1RVE9nZWFsT0VtZ1hrWFgxdWRfYXQ2R21UbTEyWllKamxRQ25hM1JSTTNFR054WnNPeThfSlJPX3h3MGxiX2x1WExiazBpU3hrSWVodU45OWJMN04tQ1Bpb0gtNmxnS0Z4VDNkeHBhcGVESTVGM0pMbHNJMXA5QQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Nov 2023 08:00:00 GMT",
        "title": "Ethereum’s Vitalik Buterin: If AI Turns on Us 'Even Mars May Not Be Safe' - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nOn Monday, Ethereum creator Vitalik Buterin reflected on his own take on “techno-optimism,” inspired by Marc Andreessen, who opined about AI in his Techno-Optimist Manifesto in October. While Buterin agreed with Andreessen’s positive outlook, Buterin also noted the importance of how AI is developed and the technology's future direction.\n\nButerin acknowledged the existential risk of artificial intelligence, including causing the extinction of the human race.\n\n“This is an extreme claim: as much harm as the worst-case scenario of climate change, or an artificial pandemic or a nuclear war, might cause, there are many islands of civilization that would remain intact to pick up the pieces,” he said.\n\n“But a superintelligent AI, if it decides to turn against us, may well leave no survivors and end humanity for good,” Buterin said. “Even Mars may not be safe.”\n\nAD\n\nAD\n\nButerin pointed to a 2022 survey by AI Impacts, which said between 5% and 10% of participants believe humans face extinction from AI or from humans' failure to control AI, respectively. He said that a security-focused open-source movement is ideal for leading AI development rather than closed and proprietary corporations and venture capital funds.\n\n“If we want a future that is both superintelligent and \"human—one where human beings are not just pets, but actually retain meaningful agency over the world—then it feels like something like this is the most natural option,\" he said.\n\nWhat’s needed, Buterin continued, is the active human intention to choose its direction and outcome. “The formula of 'maximize profit' will not arrive at them automatically,” he said.\n\nButerin said he loves technology because it expands human potential, pointing to the history of innovations from hand tools to smartphones.\n\nAD\n\nAD\n\n“I believe that these things are deeply good, and that expanding humanity's reach even further to the planets and stars is deeply good, because I believe humanity is deeply good,” Buterin said.\n\nButerin said that while he believes transformative technology will lead to a brighter future for humanity, he rejects the notion that the world should stay how it is today, only with less greed and more public healthcare.\n\n“There are certain types of technology that much more reliably make the world better than other types of technology,” Buterin said. “There are certain types of technology that could, if developed, mitigate the negative impacts of other types of technology.”\n\nButerin cautioned about a rise in digital authoritarianism and surveillance technology used against those who defy or dissent against the government, controlled by a small cabal of technocrats. He said the majority of people would rather see highly advanced AI delayed by a decade rather than be monopolized by a single group.\n\n“My basic fear is that the same kinds of managerial technologies that allow OpenAI to serve over a hundred million customers with 500 employees will also allow a 500-person political elite, or even a 5-person board, to maintain an iron fist over an entire country,” he said.\n\nWhile Buterin said he is sympathetic to the effective acceleration (also known as \"e/acc\") movement, he has mixed feelings about its enthusiasm for military technology.\n\n“Enthusiasm about modern military technology as a force for good seems to require believing that the dominant technological power will reliably be one of the good guys in most conflicts, now and in the future,” he said, citing the idea that military technology is good because it's being built and controlled by America and America is good.\n\n“Does being an e/acc require being an America maximalist, betting everything on both the government's present and future morals and the country's future success?” he said.\n\nAD\n\nAD\n\nButerin cautioned against giving “extreme and opaque power” to a small group of people with the hope they will use it wisely, preferring instead a philosophy of \"d/acc\"—or defense, decentralization, democracy, and differential. This mindset, he said, could adapt to effective altruists, libertarians, pluralists, blockchain advocates, and solar and lunar punks.\n\n“A defense-favoring world is a better world, for many reasons,” Buterin said. “First of course is the direct benefit of safety: fewer people die, less economic value gets destroyed, less time is wasted on conflict.\n\n\"What is less appreciated though is that a defense-favoring world makes it easier for healthier, more open and more freedom-respecting forms of governance to thrive,\" he concluded.\n\nWhile he emphasized the need to build and accelerate, Buterin said society should regularly ask what we are accelerating towards. Buterin suggested that the 21st century may be \"the pivotal century\" for humanity that could decide the fate of humanity for millennia.\n\n“These are challenging problems,” Buterin said. “But I look forward to watching and participating in our species' grand collective effort to find the answers.”\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiaEFVX3lxTE92ckdhNHdodDFYUjRJUjhyRjVQdjhJanhBb2tOck1kV1FWQXJnRHZmYkN2SFVLXzE5TXZ1eFVVME1iSmJKeUV0MVRGUlM1bWpTMGcxbEh5S1lCZFBld2hYMi1PSWlHYmRo?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Nov 2023 08:00:00 GMT",
        "title": "How To Earn Free Ethereum? A Step-by-Step Guide - CoinGape",
        "content": "Key Takeaways Explore ways you can earn free Ethereum via simple methods like referrals and maximize your profits.\n\nThere are several risk-free options to get free ETH like crypto sign-up bonuses, referral rewards, crypto staking rewards, and airdrops.\n\nEthereum or ETH is one of the most popular cryptocurrencies to invest in the world. The coin is next to Bitcoin in terms of market capitalization, which depicts that the coin is wildly popular among crypto enthusiasts. Usually, one needs to shell out some cash to purchase Ethereum. However, there are several ways to score free Ethereum. In this guide, we will help you earn free Ethereum via simple methods and maximize your profits.\n\nEarning Free Ethereum Crypto enthusiasts can earn free Ethereum in their crypto wallets by leveraging multiple methods. Here, we have curated trusted methods, like referrals, that are really simple and can be done numerous times to make a fortune.\n\n5 Ways to Earn Free Ethereum There’s nothing better than getting free Ethereum. But as you know, nothing in the world comes for absolutely free. Even in the crypto world, you will need to complete small tasks to get free ETH in your crypto wallets. Here, we have shared step-by-step guides on popular ways of earning free ETH.\n\n1. Step-by-Step Guide To Earn Free Ethereum Via Sign-up Bonuses Several crypto wallets and exchange platforms, like BuyUCoin or AQRU.io offer free Ethereum, on joining as crypto signup bonuses program. You can use these offers to get free Ethereum. Here’s how you can earn free Ethereum via sign-up bonuses: Step 1: Sign up on a crypto platform like BuyUCoin or AQRU.io. Step 2: Verify your email to activate your account. Step 3: Login and go to the promotions section. Step 4: Follow the instructions on the platform to get free Ethereum by only signing-up.\n\n2. Step-by-Step Guide To Earn Free Ethereum Via Ethereum Staking Ethereum staking is one of the most popular methods of earning free Ethereum. However, in this method, one needs to already own at least 32 ETH to make more Ethereum by joining the staking pool. Here’s how you can earn free ETH by Ethereum Staking: Step 1: Firstly, you need to choose a secure crypto staking platform. Step 2: Log in or create an account on the selected staking platform. Step 3: Deposit your 32 ETH into the staking pool’s smart contract. Step 4: Follow platform instructions and start earning free ETH through Ethereum staking.\n\n3. Step-by-Step Guide To Earn Free Ethereum Via Ethereum Trading Another popular method to earn free Ethereum is through trading Ethereum. Similar to Ethereum Staking, you need to have some Ethereum to start with Ethereum trading. You can choose any reliable crypto exchange platform for trading Ethereum and earn free ETH by going through the following steps: Step 1: Make sure that you have some ETH in your wallet that you will be using for trading ETH. Step 2: Choose a popular crypto exchange platform like Binance or Coinbase. Step 3: Log in or create and verify your account on the chosen exchange. Step 4: Deposit Ethereum into your exchange account. Step 5: Start ETH trading and try to make free ETH out of it. However, do note that trading of Ethereum could be risky and you can end up incurring losses if you don’t place your bets right. The method is usually opted for by seasoned crypto enthusiasts who can predict crypto movements.\n\n4. Step-by-Step Guide To Earn Free Ethereum Via Referrals One of the simplest and easiest ways to make free Ethereum is through referrals. Several crypto platforms like crypto wallets or crypto exchanges offer free Ethereum or other crypto coins on successful referrals. Here’s how you can get free ETH through referrals: Step 1: Sign up on a crypto platform with a referral program. Step 2: Get your unique referral link from the platform’s referral program section. Step 3: Share the link with friends or on social media to get more users on the platform. Step 4: Earn free Ethereum when others sign up using your referral link. Step 5: Keep sharing and accumulating rewards through successful referrals.\n\n5. Step by Step Guide To Earn Free Ethereum Via Claiming Airdrops Last but not least, you can get free Ethereum tokens by claiming airdrops. Several companies keep organizing Ethereum airdrops and you can participate in any of them to stand a chance of winning free Ethereum. Here’s how you can get free Ethereum via claiming airdrops:\n\n\n\nStep 1: Stay informed about upcoming Ethereum airdrops by joining social media channels, forums, or new platforms where airdrop announcements are made. Step 2: Follow the instructions provided for each airdrop, which may include tasks like social media engagement or joining a crypto telegram group. Step 3: Submit the necessary information, such as your Ethereum wallet address, to receive the airdropped tokens. Step 4: Keep an eye on your wallet for the airdropped Ethereum tokens.\n\nConclusion Long story short, you can follow any of the methods mentioned above to get free Ethereum. These easy and simple methods will help you boost your overall Ethereum ownership as well as crypto wealth."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiyAFBVV95cUxOMVVWVEx5a2xhVUxGekoxZmcxTzhBcVRmaWswMEsxaExKbmxNMVdkUzlNVWw0akhKLUtoMnRqWXhva3V2cnBhaWNNWGZUeFhLRnc4NWVfcm9WUW54cURVUFRWNEJGc0tCaWZWVzJOcGcxQ05NSnVITVphYnhtV2pmS0NGbXBKZG9DLUtqd0FCZVFEY2lrNGY0LUpTUVRZczluelhZemtuWmV4R2tWcEFPZTFRdy05WmhiRHJFSldndWtMZVYyZG1RYg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Nov 2023 08:00:00 GMT",
        "title": "It’s been a year since Ethereum completed its switch to proof of stake. Vitalik Buterin on what’s new, what’s next, and how he’s using AI - Fortune",
        "content": "In an exclusive interview with Fortune, Vitalik Buterin, the brains behind Ethereum, shares his thoughts on everything from blockchain technology to AI to the people who most inspire him.\n\nHe also discusses what’s happened since Ethereum’s transition from proof of work to proof of stake and how spending time in Antarctica could help prepare humans—maybe even him?—for interplanetary travel.\n\n(This interview has been edited for length and clarity.)\n\nWhat use cases for blockchain excite you the most?\n\nThere are a few different categories of blockchain applications that I think can be valuable, and I wrote about some of these in a blog post last year, but a summary would be: One, currency applications are valuable, especially in the developing world. And two, identity, reputation, and decentralized social applications are exciting due to their potential network effects and enhanced security.\n\nGoing into the specifics of one application, I’ve been using Farcaster a lot recently. There’s a lot of interest in creating alternative stuff to Twitter now—lots of people are either unhappy with various things that Elon does or people just realize that this is a monopoly and we need alternatives.\n\nSome of these have been on-chain. For example, my Farcaster account is connected to an Ethereum address, and if I lose my Farcaster key, I can use my Ethereum address to recover it. This is actually more secure than what centralized social media do, where they rely on phone numbers that can be hacked.\n\nOne of the big challenges in social media is how you tell who is a human and who is a bot. There’s just lots of incentives for malicious actors to just create 50,000 bots. The nice thing about Ethereum is that it already has this lively on-chain ecosystem where there are different ways of doing that.\n\nOne is you can verify just the existence of activity on an Ethereum account. To have activity, you need to pay transaction fees, so there’s a cost. You can make a few hundred fake accounts if you can pay a cost, but you can’t make a million of them.\n\nSecond, you can look at POAPs [proof-of-attendance protocols] that verify that you participated in various in-person or online events.\n\nThird, there are proof-of-personhood protocols, and there is proof of humanity like Worldcoin. There’s a Gitcoin passport that aggregates a lot of those. The ideal goal here is to do this in a way that lets people prove that they are people and not bots, but is also compatible with the goal of preserving people’s privacy.\n\nLast year, you experienced the milestone of transitioning Ethereum from proof of work to proof of stake. What are you focused on now, and then what’s next?\n\nAccount abstraction is definitely a big and important one. Another thing is obviously scalability. We have EIP-4844, also known as Proto-Danksharding, which is coming out very soon, which basically adds more data space on the blockchain—not transactions, but just blobs of data. The purpose of this is to enable greater scalability, specifically for layer-2 projects, our rollups.\n\nThen after EIP-4844 there is a longer-term road map of increasing that amount of space over time and then ongoing improvements to proof of stake in identifying ways that we can improve decentralization even further.\n\nWe talked a year ago about AI, the intersection of AI and blockchain, before the release of ChatGPT and all the hype around that. What are your current views on the AI industry?\n\nAI is obviously super important. It’s the sort of thing that’s hard to think about because it’s so hard to predict where it might go in the future. It’s massive gains in productivity, but also massive philosophical consequences just in terms of what the role of humans in this new world is going to be. The world that is controlled by AI has completely different goals from us in a way that’s difficult to detect at first—that could also lead to very bad things happening.\n\nIn terms of the intersection between AI and crypto, this is one of those things where people have tried really hard to find an answer. Unfortunately, part of the answer is just that the intersection is less than it seems. There are a few things like ZK ML [zero-knowledge machine learning], but it’s realistically a pretty small area.\n\nThere is the fact that AI’s rapid growth makes it much more important to solve certain problems, like proof of personhood, for example. Then there’s obviously the possibility of just crypto tokens being used by AIs. There is the possibility of crypto-based DAOs governing AIs and the process of training AIs.\n\nHave you read any books in the last year that have inspired you?\n\nIn the last year, I have definitely done less books and more reading blogs and things on the internet, things like podcasts and even science fiction. Maybe 10 years ago I read a lot of Austrian economics literature and things like Human Action: A Treatise on Economics, but also things like The Moon Is a Harsh Mistress, a novel by Robert A. Heinlein about a society that creates a civilization on the moon and tries to gain independence.\n\nMuch more recently, I watched some of The Three-Body Problem—I read part of the novel and I also watched part of the TV series, and I was fascinated by that because it presents its world view in a way that is totally different from things that we’re used to. There are aspects to the world view that I disagree with. There’s always this mentality that the world is super dangerous and basically the five big countries have to get together and figure things out, and no one else gets a seat at the table.\n\nThat’s not the kind of world that I want, and not the kind of mentality that I want to see get bigger. But there is this aspect of appreciating the vastness of the universe and how lucky humanity is to have been born—and how significant and how small we are at the same time.\n\nAre there people you admire, who inspire you?\n\nA lot of people. Akira Fuyuno has a blog called Samurai Novelist. It’s not a book, but his posts are so long, they’re basically like the equivalent of reading 10 books. He just does a very good job of making really important philosophical concepts understandable and talking about just all kinds of things in science and politics in deep ways. Other people have told me that my writing style is inspired by his.\n\nI kind of have to say Volodymyr Zelensky. I appreciate his soft-power leadership and his ability to be a figure who rallies and inspires people in that way—like, not just giving out the orders, but just being the face and rallying people behind the cause.\n\nThen there are Eliezer Yudkowsky and Scott Alexander—the two of them are kind of similar characters in a lot of ways. Also, within the Ethereum community, Justin Drake, Dankrad Feist, and Aya Miyaguchi, the foundation’s executive director, who’s really pushed the philosophy of subtraction—different people who have stepped up and made a piece of Ethereum their own and put their souls into making that piece as great as possible.\n\nYou’ve also mentioned Steve Wozniak. Can you tell us more about meeting him? And maybe a few other people who’ve impressed you?\n\nSteve Wozniak, he was just a genuinely fascinating guy who had really interesting hobbies and a lot of cool things that he was able to tell me about.\n\nFrom the government, Audrey Tang, Taiwan’s digital minister, she had all kinds of interesting ideas of her own. She has her own history of being involved in Taiwan’s democracy movement and then g0v [gov zero], which is trying to create a more democratic e-government infrastructure in Taiwan.\n\nThe likely new prime minister of Montenegro, Milojko Spajić, a.k.a. Mickey, I’ve met him and I’m also impressed by him. From what I can tell, it’s his dedication to making the country better and also just being a curious person who was willing to talk to me and willing to learn things about crypto.\n\nDo you use ChatGPT or any other AI tools?\n\nI’ve used ChatGPT. I’ve also used the Stability AI chat. I use that for a few things. One is asking specific questions that I want answers for; another one is for writing code. I find that the thing that ChatGPT is best at is writing code that uses APIs or libraries or tools that you did not really know about. It even sometimes can take natural language tasks and convert them.\n\nAlso, for a translation, ChatGPT often does better than even Google Translate for helping to learn languages. If I want to understand the grammar behind a particular sentence, it does a really good job of doing that. The things that it’s less good at are basically things where there aren’t many millions of examples to learn from.\n\nI use either Stable Diffusion or the various other AI drawing things to draw images. I use those images and things in, like, my posts and my slides quite a bit. That has been it so far, but I’m sure as AI gets better, I’ll use it in other places as well.\n\nIt definitely does increase my productivity by quite a bit.\n\nWhat’s your biggest dream?\n\nThat’s a good question. I feel like I’m not the sort of person to have one dream. I’m the sort of person to have a lot of dreams. I dream of a world where I can be more free and more open, and where the tools that we’re building in the crypto space can be a big part of actually making that happen. I have a dream of humanity as a whole really succeeding and ending disease and becoming a multiple-energy-area civilization.\n\nSpeaking of civilization, do you think in the future we can travel between planets? And would you take that ride to space?\n\nI think we’ll absolutely get there. I will not be the first one to go—I might be the hundredth person to go. Before we’re really ready to do space, we need to get better at doing Antarctica first. I think of Antarctica as being the tutorial ground of going into space, because it’s an environment that’s definitely somewhat harsh and you have zero infrastructure, but you still can breathe the air without wearing a helmet. Start with the simpler things. But I would definitely love to actually be a part of that myself at some point over the next few decades."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiyAFBVV95cUxOMVVWVEx5a2xhVUxGekoxZmcxTzhBcVRmaWswMEsxaExKbmxNMVdkUzlNVWw0akhKLUtoMnRqWXhva3V2cnBhaWNNWGZUeFhLRnc4NWVfcm9WUW54cURVUFRWNEJGc0tCaWZWVzJOcGcxQ05NSnVITVphYnhtV2pmS0NGbXBKZG9DLUtqd0FCZVFEY2lrNGY0LUpTUVRZczluelhZemtuWmV4R2tWcEFPZTFRdy05WmhiRHJFSldndWtMZVYyZG1RYg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Nov 2023 08:00:00 GMT",
        "title": "It’s been a year since Ethereum completed its switch to proof of stake. Vitalik Buterin on what’s new, what’s next, and how he’s using AI - Fortune",
        "content": "In an exclusive interview with Fortune, Vitalik Buterin, the brains behind Ethereum, shares his thoughts on everything from blockchain technology to AI to the people who most inspire him.\n\nHe also discusses what’s happened since Ethereum’s transition from proof of work to proof of stake and how spending time in Antarctica could help prepare humans—maybe even him?—for interplanetary travel.\n\n(This interview has been edited for length and clarity.)\n\nWhat use cases for blockchain excite you the most?\n\nThere are a few different categories of blockchain applications that I think can be valuable, and I wrote about some of these in a blog post last year, but a summary would be: One, currency applications are valuable, especially in the developing world. And two, identity, reputation, and decentralized social applications are exciting due to their potential network effects and enhanced security.\n\nGoing into the specifics of one application, I’ve been using Farcaster a lot recently. There’s a lot of interest in creating alternative stuff to Twitter now—lots of people are either unhappy with various things that Elon does or people just realize that this is a monopoly and we need alternatives.\n\nSome of these have been on-chain. For example, my Farcaster account is connected to an Ethereum address, and if I lose my Farcaster key, I can use my Ethereum address to recover it. This is actually more secure than what centralized social media do, where they rely on phone numbers that can be hacked.\n\nOne of the big challenges in social media is how you tell who is a human and who is a bot. There’s just lots of incentives for malicious actors to just create 50,000 bots. The nice thing about Ethereum is that it already has this lively on-chain ecosystem where there are different ways of doing that.\n\nOne is you can verify just the existence of activity on an Ethereum account. To have activity, you need to pay transaction fees, so there’s a cost. You can make a few hundred fake accounts if you can pay a cost, but you can’t make a million of them.\n\nSecond, you can look at POAPs [proof-of-attendance protocols] that verify that you participated in various in-person or online events.\n\nThird, there are proof-of-personhood protocols, and there is proof of humanity like Worldcoin. There’s a Gitcoin passport that aggregates a lot of those. The ideal goal here is to do this in a way that lets people prove that they are people and not bots, but is also compatible with the goal of preserving people’s privacy.\n\nLast year, you experienced the milestone of transitioning Ethereum from proof of work to proof of stake. What are you focused on now, and then what’s next?\n\nAccount abstraction is definitely a big and important one. Another thing is obviously scalability. We have EIP-4844, also known as Proto-Danksharding, which is coming out very soon, which basically adds more data space on the blockchain—not transactions, but just blobs of data. The purpose of this is to enable greater scalability, specifically for layer-2 projects, our rollups.\n\nThen after EIP-4844 there is a longer-term road map of increasing that amount of space over time and then ongoing improvements to proof of stake in identifying ways that we can improve decentralization even further.\n\nWe talked a year ago about AI, the intersection of AI and blockchain, before the release of ChatGPT and all the hype around that. What are your current views on the AI industry?\n\nAI is obviously super important. It’s the sort of thing that’s hard to think about because it’s so hard to predict where it might go in the future. It’s massive gains in productivity, but also massive philosophical consequences just in terms of what the role of humans in this new world is going to be. The world that is controlled by AI has completely different goals from us in a way that’s difficult to detect at first—that could also lead to very bad things happening.\n\nIn terms of the intersection between AI and crypto, this is one of those things where people have tried really hard to find an answer. Unfortunately, part of the answer is just that the intersection is less than it seems. There are a few things like ZK ML [zero-knowledge machine learning], but it’s realistically a pretty small area.\n\nThere is the fact that AI’s rapid growth makes it much more important to solve certain problems, like proof of personhood, for example. Then there’s obviously the possibility of just crypto tokens being used by AIs. There is the possibility of crypto-based DAOs governing AIs and the process of training AIs.\n\nHave you read any books in the last year that have inspired you?\n\nIn the last year, I have definitely done less books and more reading blogs and things on the internet, things like podcasts and even science fiction. Maybe 10 years ago I read a lot of Austrian economics literature and things like Human Action: A Treatise on Economics, but also things like The Moon Is a Harsh Mistress, a novel by Robert A. Heinlein about a society that creates a civilization on the moon and tries to gain independence.\n\nMuch more recently, I watched some of The Three-Body Problem—I read part of the novel and I also watched part of the TV series, and I was fascinated by that because it presents its world view in a way that is totally different from things that we’re used to. There are aspects to the world view that I disagree with. There’s always this mentality that the world is super dangerous and basically the five big countries have to get together and figure things out, and no one else gets a seat at the table.\n\nThat’s not the kind of world that I want, and not the kind of mentality that I want to see get bigger. But there is this aspect of appreciating the vastness of the universe and how lucky humanity is to have been born—and how significant and how small we are at the same time.\n\nAre there people you admire, who inspire you?\n\nA lot of people. Akira Fuyuno has a blog called Samurai Novelist. It’s not a book, but his posts are so long, they’re basically like the equivalent of reading 10 books. He just does a very good job of making really important philosophical concepts understandable and talking about just all kinds of things in science and politics in deep ways. Other people have told me that my writing style is inspired by his.\n\nI kind of have to say Volodymyr Zelensky. I appreciate his soft-power leadership and his ability to be a figure who rallies and inspires people in that way—like, not just giving out the orders, but just being the face and rallying people behind the cause.\n\nThen there are Eliezer Yudkowsky and Scott Alexander—the two of them are kind of similar characters in a lot of ways. Also, within the Ethereum community, Justin Drake, Dankrad Feist, and Aya Miyaguchi, the foundation’s executive director, who’s really pushed the philosophy of subtraction—different people who have stepped up and made a piece of Ethereum their own and put their souls into making that piece as great as possible.\n\nYou’ve also mentioned Steve Wozniak. Can you tell us more about meeting him? And maybe a few other people who’ve impressed you?\n\nSteve Wozniak, he was just a genuinely fascinating guy who had really interesting hobbies and a lot of cool things that he was able to tell me about.\n\nFrom the government, Audrey Tang, Taiwan’s digital minister, she had all kinds of interesting ideas of her own. She has her own history of being involved in Taiwan’s democracy movement and then g0v [gov zero], which is trying to create a more democratic e-government infrastructure in Taiwan.\n\nThe likely new prime minister of Montenegro, Milojko Spajić, a.k.a. Mickey, I’ve met him and I’m also impressed by him. From what I can tell, it’s his dedication to making the country better and also just being a curious person who was willing to talk to me and willing to learn things about crypto.\n\nDo you use ChatGPT or any other AI tools?\n\nI’ve used ChatGPT. I’ve also used the Stability AI chat. I use that for a few things. One is asking specific questions that I want answers for; another one is for writing code. I find that the thing that ChatGPT is best at is writing code that uses APIs or libraries or tools that you did not really know about. It even sometimes can take natural language tasks and convert them.\n\nAlso, for a translation, ChatGPT often does better than even Google Translate for helping to learn languages. If I want to understand the grammar behind a particular sentence, it does a really good job of doing that. The things that it’s less good at are basically things where there aren’t many millions of examples to learn from.\n\nI use either Stable Diffusion or the various other AI drawing things to draw images. I use those images and things in, like, my posts and my slides quite a bit. That has been it so far, but I’m sure as AI gets better, I’ll use it in other places as well.\n\nIt definitely does increase my productivity by quite a bit.\n\nWhat’s your biggest dream?\n\nThat’s a good question. I feel like I’m not the sort of person to have one dream. I’m the sort of person to have a lot of dreams. I dream of a world where I can be more free and more open, and where the tools that we’re building in the crypto space can be a big part of actually making that happen. I have a dream of humanity as a whole really succeeding and ending disease and becoming a multiple-energy-area civilization.\n\nSpeaking of civilization, do you think in the future we can travel between planets? And would you take that ride to space?\n\nI think we’ll absolutely get there. I will not be the first one to go—I might be the hundredth person to go. Before we’re really ready to do space, we need to get better at doing Antarctica first. I think of Antarctica as being the tutorial ground of going into space, because it’s an environment that’s definitely somewhat harsh and you have zero infrastructure, but you still can breathe the air without wearing a helmet. Start with the simpler things. But I would definitely love to actually be a part of that myself at some point over the next few decades."
    }
]