[
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxORm5kSk8yMk9MLWpzUzExQ1p3NFRwTy1HLWYxQnY4T0NLa0RWNkxfVGhZLXRsbEFITG5HUU1IaXNoa1Y3WjR4a0kwdjVqY0ZIX2xVWHJfRGF6cXFHY3dUa0hGaTlDWjREaFVPU1RDS1cxNjhzbmpoZUl2OUJKWnVpdU5jcXF3TTN5SEJudmVUY2dRQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jul 2024 07:00:00 GMT",
        "title": "SEC Officially Approves Spot Ethereum ETF Trading for Tomorrow - Watcher Guru",
        "content": "The SEC has officially approved the trading of Spot Ethereum ETFs for tomorrow, July 23. U.S. regulators have given final approval for the S1 forms for ETFs that hold Ethereum’s ether. The Ether ETFs will be available for trade upon the opening bell.\n\nBREAKING: 🇺🇸 SEC officially approves spot Ethereum ETF trading for tomorrow. — Watcher.Guru (@WatcherGuru) July 22, 2024\n\nThe asset is set to be only the second crypto-based ETF in the United States. Moreover, the market is hopeful it can mirror Bitcoin’s success. The leading cryptocurrency debuted its ETF in January. Just three months later, the BTC reached an all-time high price of $73,000.\n\nThe decision caps a years-long process to get ether ETFs approved by the SEC, giving investors a new crypto asset to invest in. Ether ETF applicants first received 19b-4 form approvals back in May. However, many delays on the SEC’s end in looking over the final documents occurred. Now, we are less than 24 hours away from the first trades of a Spot Ethereum ETF.\n\nAlso Read: Ethereum: Is ETH a Lock for $4,000 After ETF Launch?\n\nHow Will Ethereum Perform Against Bitcoin After Spot ETF Launch?\n\nFurthermore, an interesting note is the timing of the approval. The SEC is greenlighting the launch date of the Ethereum ETF during the biggest Bitcoin conference of the year. This week isn’t just about Bitcoin anymore, as Ethereum is joining the spotlight with its ETF launch tomorrow. BTC and ETH represent the only two cryptocurrencies with an ETF in the US, but more are expected to be launched in the coming year. The first Solana SOL-based ETFs have already gotten applications sent out, and other cryptocurrencies like XRP expect to join the ETF conversation as well.\n\nCboe will house most of the first trading of Ether ETFs, with more exchanges likely jumping in shortly after trading commences. Upon the Ethereum ETFs’ debuts, the entire cryptocurrency market expects to jump as it did following the approval of Bitcoin ETFs in January."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxORlRBZi0tSHI5YTlBYXd5bUpGZ0FzN21iRFFxSUJxWVc4NnBFMVI1MnVCSFFTbGpFVXNDRTZxc3hfQU9iWk14c3BFMDNJMlU5a0NHMWJVOFZCbE1QTzdieFJrblBGdVpmX1hHVVdmdG5zMFlsbVRpdHB4U2dzNzJ6N0Z3bnpxdVNKLUhLQXdnQjhtZEY1SkNkam1lWnphSnB2T0ZMc0VLTDhHWTNTTE9vdko2eXJWNWNBR0djcFdxR21nN1RlUExsVkI0UkhuaEM0aElCM1ZDemTSAd4BQVVfeXFMTXVsRWVVa0EyTjBtcEd1R0M4YWlzSjg2b1hJQk8zd3BuTlFCVGFzSVdYcUlRejNfdzNIQ2E2MGFTSmxkVmlCQmxBQmVyZFRyVG1EdGpxNHgxNjJhZXRUdFE0TUp5V2Z0NWYtVGoydnBOWXJlZzhLbGs2V1JWTUkzV2wzMzdKR1BjTkFTQ3dXUnA1aUMtTmkxc09oY29uenBQYm5uT285ellkbWpHWjVMNlVaU0o5TzNIaDFObTBQOHdPMF9ISEJqc3dXU0R4WGRka1BaNjc0SVFQMWIyTkN3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Overtakes Solana With Most Altcoin Inflows Year-to-Date As Positive Sentiment Continues: CoinShares - The Daily Hodl",
        "content": "Digital assets manager CoinShares says that institutional crypto investors are going in heavy on the leading altcoin Ethereum (ETH).\n\nIn its latest Digital Asset Fund Flows report, CoinShares says crypto investment products enjoyed $1.35 billion in inflows last week.\n\n“Digital asset investment products saw further buying with inflows of US$1.35bn last week, bringing the last 3 week run of inflows to US$3.2bn. ETP (exchange-traded product) trading volumes also increased substantially, up 45% week-on-week to US$12.9bn, but representing a lower than usual 22% of the broader crypto market volumes.”\n\nRegionally, the United States and Switzerland saw inflows of $1.3 million and $66 million, respectively.\n\nMinor outflows were experienced in Brazil and Hong Kong to the tune of less than $7.5 million in total.\n\nBitcoin (BTC), per usual, enjoyed the lion’s share of inflows at $1.27 billion.\n\nHowever, the biggest story of last week’s inflows was Ethereum, according to CoinShares.\n\n“The outlook for Ethereum seems to have turned a corner, seeing a further US$45m of inflows last week, overtaking Solana for the altcoin with the most inflows year-to-date (YTD) at US$103m.”\n\nSolana (SOL) enjoyed $9.6 million in inflows. Multi-asset crypto investment vehicles enjoyed $16.7 million in inflows. Litecoin (LTC), Chainlink (LINK), XRP and Cardano (ADA) also brought in inflows of $2.2 million, $0.7 million, $0.5 million and $0.4 million, respectively.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxPY1VyQUhUVGZ5LXpJQ1R3cUdONnZmRDhaVnVYOTlnc3BrZC1Sd1V4NTJrOGU2WVBUb1MtQzNuZEF1TF90TjZfUzdSRXEzOTZEbEJHRENaZUEzM01CRHI2REcxVF9DUUlITGZkdzlhMUI3X0ZJUzFwV3AxTjhWZTdIUXBobjdKaFh2UEVPcVN5ekMxbTdpN3BDMFI4R2ZqUDJzcnAwa1JYQ1o3UdIBsgFBVV95cUxOSE9uQTBweHRFZU9zMXRSQTN3cDFHUXVYQUpDcnA2Q2RTZXdCTzhsTmFzRkdtZmNzQ3lCbjFLNVFUYTlPWkV2RHRhbkxrX2pTRnFFMXB0aWRrR2tMZ3hKNFhHMW5wRGNoOE5uZTg4RWpMeVBWQ19heFZpcnFhUWdQNTRhczN0T1NfMnU2UHNjX0FDd01NNmpTNTFYUlI4Zm1yYV9XQy1kV0NiVXF3OUpMMlJB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jul 2024 07:00:00 GMT",
        "title": "Grayscale Shifts $1 Billion in Ethereum to Coinbase Ahead of US ETF Trading Debut - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nCrypto asset manager Grayscale has transferred a hefty sum of Ethereum to Coinbase Prime as exchange-traded funds (ETFs) associated with the asset gear up for a trading debut in the U.S. this week.\n\nGrayscale's transaction of $1.01 billion to Coinbase Prime on Wednesday prompted market participants to suggest Grayscale might be preparing for a sell-off to reinvest in another crypto, such as Solana.\n\nJon Campagna, managing partner at crypto hedge fund Nexyst Digital and formerly associated with Coinfund and Blackrock, dismissed these claims in a Tuesday post on X, saying Grayscale is unlikely to reallocate its Ethereum holdings.\n\nIt comes as Grayscale tipped 10% of its Grayscale Ethereum Trust (ETHE) holdings into its separate Ethereum ETF (ETH) on July 18, Campagna explained.\n\nAD\n\nAD\n\nThe new fund is expected to become active on Wednesday, with ETHE holders receiving their proportional ETF positions.\n\nTo facilitate the move, the asset manager transferred $1 billion, or 10% of their $10 billion AUM in ETHE, to Coinbase Prime, as announced a week earlier by Grayscale, Campagna wrote.\n\n\"What will be interesting is to see the outflows from ETHE as they refuse to lower their ... fee,\" Campagna said. \"My guess is those outflows get recycled into inflows into the lower-cost ETFs, like Grayscale's own 15 basis point fee ETH ticker. Brilliant move by them as they quasi-guarantee more assets stay in-house this way.\"\n\n\"Grayscale is not lowering at all,\" Eric Balchunas, an ETF analyst at Bloomberg, wrote in a post to X on July 18. \"This means they are ten times higher than competition.\" Grayscale is expected to maintain a 2.5% fee on ETHE.\n\nAD\n\nAD\n\nWhile algorithmic trading firm Wintermute has indicated that the demand for Ethereum ETFs might be lower than expected, analysts remain optimistic about their debut on Wednesday.\n\nMatt Hougan, chief investment officer at Bitwise Asset Management, has said Ethereum could reach as high as $5,000, Decrypt previously reported.\n\nEthereum has already begun to move higher, surpassing $3,500 on July 17 after a significant drop earlier in the month.\n\nGrayscale is among several major investment firms, including BlackRock, Fidelity, and Franklin Templeton, preparing to launch Ether ETFs.\n\nDemand for the funds is projected to be between $3.2 billion and $4 billion.\n\nEdited by Sebastian Sinclair"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxPVFdXQXpvSm40QUFlSTdjRGFka1VnS2NLQUJEcVJ5aUVDRldsUXN4R3hEVi1HSDNkMkcxVm1yVzBjdEI3ZHpNaWs3VC1ud3ZiWVFDU01IRGZET2MyQVRvR29vNV9UWDMtNG53RDBVRXhXazh4UUx2d19kWjRWZTU0SUNQONIBiAFBVV95cUxNU3VwVGF6dE80Sl9oYVBaU2lLU2pqM1lxSUQwbkVSbDZ6bENJV3ZrZldDXzZuYkdKSWExUjRIVmRXbzdyd3Vrb2lvcHRPR1ZpdXRaY1JhWGQyYnItTmhGcGE5N3JSamNxejNneVljdkUzUlZlVkRUd3djUk9JQW1XSmR1RU5HVEhF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Turns 10: A Decade of Blockchain Revolution - CryptoPotato",
        "content": "Over the past ten years, Ethereum has transformed the blockchain landscape.\n\nFrom its initial coin offering to becoming the second-largest crypto by market cap, Ethereum has continuously evolved, implementing major upgrades like the shift to Proof-of-Stake (PoS) and Layer 2 scaling solutions and cementing its position as a cornerstone of the Web3 ecosystem despite the emergence of several alternatives over the years.\n\nEthereum’s 10-Year Journey\n\nReflecting on its origins, Ethereum Foundation researcher Justin Drake pointed out that Ethereum’s initial coin offering (ICO) began on July 22, 2014, with the price being 2,000 ETH per sale unit per BTC in a fully permissionless environment devoid of venture capital influence or vesting periods.\n\nThis rate only applied for the first 14 days. After that, the price began to decrease gradually, with each subsequent day offering fewer ETH per unit. By the end of the sale period on September 2, 2014, the rate had dropped to 1337.077 ETH per unit.\n\nFast forward to today, and the value dynamic has shifted dramatically. Now, 1 BTC buys less than 20 ETH. Drake pointed out that few assets have matched Bitcoin’s performance over the past decade, and even fewer have surpassed it by a factor of 100.\n\nEthereum has evolved into a crucial component of the blockchain ecosystem. So far, 4.3 million ETH has been burned for gas fees since the introduction of EIP-1559, and many more are expected to be burned with the introduction of blob transactions.\n\nAdditionally, Ethereum’s staking mechanism now provides $100 billion in economic security, ten times more than Bitcoin, and supports DeFi and restaking, vastly improving the Internet of Value’s economic bandwidth.\n\nEthereum’s Institutional Journey Begins\n\nAll eyes are on the spot Ether ETF, which, according to Drake, further signified Ethereum’s growing recognition as a digital commodity, marking the beginning of the crypto asset’s institutional journey.\n\nThe Chicago Board Options Exchange (CBOE) will debut five spot Ethereum exchange-traded funds (ETFs) on July 23, pending final regulatory approval, as announced by the agency last week. This follows the US Securities and Exchange Commission’s (SEC) approval on May 23, which greenlighted the listing of several spot Ether ETFs.\n\nThe five Ethereum ETFs scheduled for launch are the 21Shares Core Ethereum ETF, Fidelity Ethereum Fund, Invesco Galaxy Ethereum ETF, VanEck Ethereum ETF, and Franklin Ethereum ETF.\n\nTo attract investors and secure a market position, most of the ETH ETF issuers are planning to offer temporary fee reductions or waivers as the funds start trading."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxNbTYzdVJMWmJiaU8wNmJQYUtBZ0RwNjU0T2g0TFBUTzZ6MnVoeWVzbm5TTGlkUkxrdHB4cjlfN3lDcy1FYU1uZWI1Zjd0TmZlV09sMUdfLXoybnhTYW1iQ04xZ0xKRlUwRU9TelNkaEhmQlNwTElzQ1pCZmMtZG8zdWdKT0xpS0huS3B0MFRhSWFJdEM5eWc0MVMyOXZTWWxnTk1RU3NpTTB5RmI2WFZpcGNaM3Z0SDBPbnc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jul 2024 07:00:00 GMT",
        "title": "Bitcoin, Binance, Ethereum, Solana, and Ripple: The Biggest Crypto News of the Past Week - Cointribune EN",
        "content": "Mon 22 Jul 2024 ▪ 4 min read ▪ by Luc Jose A.\n\nBetween revolutionary announcements, technological developments, and regulatory turmoil, the crypto ecosystem continues to prove that it is both a limitless territory of innovation and a battlefield of regulatory and economic battles. Here is a summary of the most notable news from the past week around Bitcoin, Ethereum, Binance, Solana, and Ripple.\n\nBitcoin surpasses Visa and Mastercard in transaction volume\n\nBitcoin has reached a historic milestone by surpassing Visa and Mastercard in terms of daily transaction volume. According to data from Glassnode, the leading crypto asset recorded a volume of $46.4 billion, compared to $6.5 billion for filtered economic transactions. This surge is due to increasing adoption and innovations such as the Runes protocol. With a market capitalization of about $1.3 trillion, Bitcoin is redefining traditional payment systems.\n\nBinance can invest in US Treasury bonds\n\nThe world’s leading crypto exchange, Binance has received approval to invest customer funds in US Treasury bonds. This strategic decision allows the company to diversify investment options for its users. It offers greater security and stability compared to more volatile crypto assets. The announcement also led to a notable increase in the price of Binance Coin (BNB). This reflects investor confidence in Binance’s fund management and paves the way for similar initiatives.\n\nJD Vance: Trump’s Pro-Bitcoin Running Mate for 2024\n\nDonald Trump has chosen Ohio Senator JD Vance as his running mate for the 2024 presidential election. Vance, known for his support of cryptocurrencies, owns between $100,000 and $250,000 in Bitcoin and advocates for a crypto-friendly legislative framework. This nomination aims to attract the crypto-enthusiast electorate and marks a pro-crypto shift for Trump, who now accepts cryptocurrency donations for his campaign.\n\nThe Ethereum ETF hits the market on July 23\n\nThe long-awaited launch of the first spot Ethereum ETFs is scheduled for July 23, 2024, according to a recent confirmation from the Chicago Board Options Exchange (Cboe). Listed funds include the 21Shares Core Ethereum ETF (CETH) and the Fidelity Ethereum Fund (FETH). These ETFs offer a regulated and secure option to invest in Ethereum. They could attract more institutional investors and strengthen the legitimacy of the crypto market.\n\nWhale transactions destabilize XRP price\n\nRecent massive XRP transactions made by whales have caused significant volatility in the token’s price. After accumulating more than 130 million, these investors managed to push the price of XRP to 63 cents. However, the crypto asset’s price then fell by 8% to around 55.8 cents. These large holders’ significant movements demonstrate their direct impact on the market and the difficulty in maintaining price stability in the short term.\n\nThat’s the essentials to remember for this week. But if you want a more detailed recap and in-depth analysis delivered directly to your inbox, don’t hesitate to subscribe to our weekly newsletter.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    }
]