[
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxPX0taYTZVdjB6UHZvelBpb3Z2YjE5MlNWUXJvOG9reUY0SjVEMlYxU1pzWWJ4N25kMzYzaFl0VGZxWUcwQjZYSGh4OFU5VVpRR3VWbXZPdG8yb1BET0w1bDUzOTBuTWRReHViTkI0YVZSanJkWXlvU0N2R0t1WlZBUF9kOHdWQWc3LXBiTE1tQVdzZ043?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Analyst projects Ethereum potentially to $2k amid market consolidation - crypto.news",
        "content": "FxPro senior analyst Alex Kuptsikevicha projects Ethereum’s price could further dip towards $2,000, as the altcoin is down by over 8% weekly.\n\nThe crypto market is experiencing a period of subdued volatility, with the total market capitalization hovering around $1.6 trillion for the third consecutive day. Simultaneously, equity indices in the stock market have also significantly declined in the past 24 hours.\n\nHowever, the impact on cryptocurrency investors has been minimal. Kuptsikevich thinks that the fall in stock values is seen more as a result of individual corporate stories rather than an indication of a global shift in market sentiment.\n\nBitcoin is benefiting from this consolidation phase, with its market share exceeding 50% once again. On the other hand, Ethereum has found itself at the lower end of the consolidation range, which it has been in for most of December. Kuptsikevich predicts that Ethereum is showing signs of possibly dropping to the $2,100 area, a level that marked the upper end of its November consolidation phase.\n\nETH 7-day market performance | Source: CoinMarketCap\n\nYou might also like: OKX shuts down mining pools after five years of operation\n\nKuptsikevich suggests that a further decline towards the $2,000 mark is possible, citing the cryptocurrency market’s inherent volatility. This potential dip could mirror a similar retracement in Bitcoin to the $37,500 level.\n\nThe SEC has also delayed its decision on BlackRock’s application for a spot Ethereum ETF until March 10. While some experts remain optimistic about the ETF’s approval by May, with a probability of 50-to-70%, others are wary of regulatory resistance.\n\nThe introduction of spot Bitcoin ETFs in the U.S. has broadened the appeal of cryptocurrencies to a wider audience. According to the head of institutional at Coinbase, this marks a potential shift towards mainstream adoption of digital currencies.\n\nHowever, the influx of new capital into new cryptocurrencies is expected to be a gradual process, unfolding over months or even years."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxOLUxIRFRScm91bmtmWXBKVXdUM3FUVEpydXcyNHFmSElUUUJJTDdBQVhKWWFuaW5od0ZUakJ1MFMzVDNjYWUtLXFYX21LVXJNdEZwVFloWlVfM0Fkb05fbGpIQUJKdGN5NmgxZkxGRU1DWXRtaGxUSlNEaXJfTUN5eGFOYkE4aWFJajZXUHc3YnNtTjBOVGhrWUxna9IBoAFBVV95cUxOeFprU1ZuVEtOeWJtM1M4MDNXQlJVdWhxZTBXVnM3by1IYXV4OWxCZGVDS3d2dTZ4UV9jdTU2QUVlbFJhT3YzeFJVWmQ3SUlHNjc2U1pNcXlEZzQ0N3dJSXJCc0t4cll0Y2g1VGhROS1FWHg1Q2tvLW9IbTJYV05ENm1xclRneTlqM3ZGcjJjNXBfcjgwVVNmZGhBYlN0b05Z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "TRUMP2024 or BIDEN2024? How U.S. elections are propping these altcoins - AMBCrypto News",
        "content": "Tokens such as TRUMP2024 and BIDEN2024 surge in popularity ahead of the U.S. elections.\n\nEthereum and Solana could benefit from the heightened interest in the tokens.\n\nThe 2024 U.S. election is one of the most anticipated events of this year. Some token creators have tried to capitalize on the attention around U.S. elections and have created tokens around the same.\n\nShitcoin Update: $BIDEN2024 and $TRUMP2024 on Ethereum are gaining marketcap. Is this the true election? Trending #8 and #11 on @dexscreener. ?https://t.co/8AO3d7z78ehttps://t.co/WXqV4WTt0Z pic.twitter.com/2ntHQHdHBf — MartyParty (@martypartymusic) January 24, 2024\n\nNew tokens have arrived\n\nThe tokens BIDEN2024 and TRUMP2024 are two of the most popular tokens that have been created in this context. The TRUMP2024 token grew by 751% over the last month and was trading at $0.00000000451 at the time of writing.\n\nThe volume at which it was trading grew by 26.69% in the last 24 hours and was currently at 3.69 million.\n\nComing to the BIDEN2024 token, it grew by 694.25% last week and saw a gigantic surge of 1796.25% in volume. At press time it was trading at $0.00000000431 and its volume was $2.41 million.\n\nAs the presidential election inches near, the probability of these tokens seeing more growth is very high. However, after the event, the prices of the token may collapse.\n\nMemecoins are very susceptible to rug pulls and holders should be careful around these tokens. Holders and traders should hedge their bets if they decide to invest in these tokens.\n\nL1 networks gain\n\nEven though some holders may gain or lose out on money eventually, Solana [SOL] and Ethereum [ETH] might see positive returns regardless.\n\nThe hype around these tokens on both Solana and Ethereum may add to an uptick in activity on both of these networks. The networks saw a massive surge in activity over the last few months as well.\n\nAccording to Artemis’ data, the number of daily active addresses on Solana increased from 214,000 to 624,000 in the last 3 months.\n\nSolana was lagging behind Ethereum in this regard earlier, however, at press time, Solana had outperformed Ethereum by a large margin. At press time, the number of daily active addresses on the Ethereum network amounted to 357,000.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nIn terms of transaction activity, a similar trend was observed. Solana completely left Ethereum in the dust in terms of transactions.\n\nAt the time of writing, daily transactions on the Solana network were 27.8 million. Ethereum on the other hand had 1.6 million."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxNSmFpRFVvaERnSEd4cEY2WVl2cGZYM2RtbXVNZ1Y1YkROOVRhVEc2ZmVBdTh5bWZBaHo5bk9Sa09lR0tOLUZqOUpSNGhNSXVVVFVCeDJXOExISExzNWs5aml3NVdWOXZVWlRfaDZleVFvRnJDWjV2NVp3SU5wM3d5TnR6SlNsNmx0X3dFTXE1SE9Kd3REanfSAZsBQVVfeXFMUEtUMlFrcGZ6dS1TUDE0M05JSVhKeUw0YnJBajJZRzBZUW5EYWstVlRUbjRFcDZHN2JUaElpSlpnX3NzRkNKYlFGcVpwejljVmR1Mk1majlMaEU3dGR2Tk0zcEFscjdxX3Y1dFJGM2N4cXk3bnItMTJBSEs5N2dxSDhLU3otNDRTWXBJbk9pUDk4a25qdHp4ZmVrcTA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 00:02:56 GMT",
        "title": "Analyst Thinks Ethereum Will Explode To $15,000, Cites Favorable Technical Formation - NewsBTC",
        "content": "A crypto analyst, Elja on X, predicts that Ethereum (ETH) will reach a staggering $15,000 by 2025 based on technical analysis. The analyst argues that the current bearish sentiment in the crypto market is “temporary.”\n\nMoreover, Elja notes that the second most valuable coin by market cap follows a similar fractal pattern that fueled its previous major price rally in 2021.\n\nIs Ethereum Ready To Rip Despite The Current Consolidation?\n\nSharing a screen grab of the current ETH price action, Elja says most people in crypto are “short-sighted” and only focus on immediate price movements. In the analyst’s assessment, traders should look at the long-term to understand the overall price pattern.\n\nRelated Reading\n\nThus far, Ethereum, like Bitcoin (BTC), remains under pressure and struggling to break above immediate resistance levels. Looking at the development in the daily chart, ETH is back at a critical support level of around $2,200. Notably, the coin is down 20% from January 2024 highs of about $2,700.\n\nETH is under pressure, at least in the short to medium term. As it is, the coin follows the technical candlestick arrangement visible in Bitcoin.\n\nThe altcoin downtrend appears to have been triggered by events following the approval of spot Bitcoin ETFs by the United States Securities and Exchange Commission (SEC). As an illustration, Bitcoin fell from around $47,000 to below $40,000 this week, weighing down altcoins, including Ethereum.\n\nOn-chain data shows that Grayscale Investments has been unloading thousands of coins behind Grayscale Bitcoin Trust (GBTC). Subsequently, there has been a sell-off in Bitcoin and across the altcoin scene. The situation has been made worse for Ethereum following the United States SEC’s decision to postpone the approval of spot Ethereum ETFs.\n\nWhile these developments have negatively impacted sentiment, Elja believes they will not derail Ethereum’s long-term growth trajectory. Specifically, the analyst notes that ETH is consolidating, a “healthy sign.”\n\nETH To $15,000: Will Fundamental And Technical Factors Help?\n\nElja added that when crypto prices consolidate, it could suggest that whales are accumulating their position. Once this ends, ETH prices could trend higher. From the analyst’s chart, the coin will break above $5,000 to $15,000 in the coming sessions.\n\nRelated Reading\n\nBitcoin Bearish Outlook: Analyst Predicts Price Nosedive To $38,130 8 months ago\n\nWhen making this prediction, the analyst compared the Ethereum price action to the fractal pattern that propelled ETH from around $200 to $4,800 in 15 months from 2019 to 2021. Extrapolating from past price action, Elja believes Ethereum is on a similar path. Based on analysis, the coin will likely break above November 2021 peaks.\n\nBeyond technical factors, ETH supporters cite the decreasing issuance rate. According to Ultrasound Money data, the network has been burning thousands of ETH, reducing supply. Additionally, Larry Fink, the CEO of BlackRock, believes Ethereum will be the choice network for tokenizing real-world assets (RWAs) in the years ahead.\n\nFeature image from Canva, chart from TradingView"
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMi-gFBVV95cUxNc3dzWHJJY2xNWVZ5NGNfVmpOTVcxaFJYd0Vma2FfOXQtbm1MVjRaZ1ZwbUI3ajRtdzlKNWtfMC1nalcxdXBndEFpREJJYjE3dk9NTEN2ZmlFV2twNnFhMkhPYVZhN3pVTW0zeENkUXBUZDh6OGh6YWtlOFQ4eGRsci1vbFJ6UC1Ic05raklWNWEybEFPb0VWNTNaYXZsbHBsYkdVVlpiaGFnTEQ4Mk9tX0MybTZ2VEJOTzNqREt5X09RbmtEVUtySlFmTmpNZ0c2YlhxYWNTdkVGNWtqLXF0MXVsRkQ2N1BKcXZ2T3c3U3c0dFhzUEVNZEZ30gH_AUFVX3lxTFBCa0hzbDYzQzN3bUJlVEZ1dmxRMWVMWENaYUEzVkNQQmRwTjE3eUhjRW1lT0tMMEhsWHltMHdVR3VNdzhIRDJ6Vm11d2dFRkhEVGVGeGJWM0trcDBDLWFrenotYkJ0dnRLT1FINWlCQVd1cEdKbDZDRUZpM2NBT0QyTE04aWFIMFdtRDNaY0dkSUpVLTI0M3NRZWlvSy03b2tJb3o1SnlfUXQyaHRSMG9rUkJHRUNMVjRxYWRuOHNWQktyODFURTZWMFBwSkU3cm5VX2hVc193YlNVMVVNeGt5TXYycDRjN3VRdGNnM3RsSTEtU2tGRVRBTTVZU0JLQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Cryptocurrency Price Today: Bitcoin Rises Above $40,000, PYTH Becomes Biggest Gainer - ABP Live",
        "content": "Bitcoin (BTC), the oldest and most valued cryptocurrency in the world, managed to rise above the $40,000 mark early Friday. Other top coins, including the likes of — Ethereum (ETH), Dogecoin (DOGE), Solana (SOL), Ripple (XRP), and Litecoin (LTC) — saw mix of minor gains and dips across the board. The MANTA token, which was the biggest gainer yesterday, turned out to be the biggest loser today, with a 24-hour dip of over 10 percent. PYTH, on the other hand, became the biggest gainer, with a 24-hour jump of over 13 percent.\n\nThe global crypto market cap stood at $1.56 trillion at the time of writing, registering a 24-hour gain of 0.32 percent.\n\nBitcoin (BTC) Price Today\n\nBitcoin price stood at $40,116.38, registering a 24-hour gain of 0.37 percent, as per CoinMarketCap. According to Indian exchange WazirX, BTC price stood at Rs 35.39 lakh.\n\nEthereum (ETH) Price Today\n\nETH price stood at $2,223.92, marking a 24-hour jump of 0.38 percent at the time of writing. As per WazirX, Ethereum price in India stood at Rs 1.99 lakh.\n\nDogecoin (DOGE) Price Today\n\nDOGE registered a 24-hour jump of 0.17 percent, as per CoinMarketCap data, currently priced at $0.07811. As per WazirX, Dogecoin price in India stood at Rs 6.92.\n\nLitecoin (LTC) Price Today\n\nLitecoin saw a 24-hour gain of 0.15 percent. At the time of writing, it was trading at $65.72. LTC price in India stood at Rs 5,889.73.\n\nRipple (XRP) Price Today\n\nXRP price stood at $0.5135, seeing a 24-hour loss of 0.27 percent. As per WazirX, Ripple price stood at Rs 45.\n\nSolana (SOL) Price Today\n\nSolana price stood at $88.04, marking a 24-hour dip of 0.25 percent. As per WazirX, SOL price in India stood at Rs 7,700.\n\nTop Crypto Gainers Today (January 26)\n\nAs per CoinMarketCap data, here are the top five crypto gainers over the past 24 hours:\n\nPyth Network (PYTH)\n\nPrice: $0.4214\n\n24-hour gain: 13.16 percent\n\nChiliz (CHZ)\n\nPrice: $0.1131\n\n24-hour gain: 9.54 percent\n\nIOTA (IOTA)\n\nPrice: $0.2515\n\n24-hour gain: 8.96 percent\n\nConflux (CFX)\n\nPrice: $0.1938\n\n24-hour gain: 7.57 percent\n\nEthereum Name Service (ENS)\n\nPrice: $19.02\n\n24-hour gain: 7.22 percent\n\nTop Crypto Losers Today (January 26)\n\nAs per CoinMarketCap data, here are the top five crypto losers over the past 24 hours:\n\nManta Network (MANTA)\n\nPrice: $2.92\n\n24-hour loss: 10.75 percent\n\nSui (SUI)\n\nPrice: $1.18\n\n24-hour loss: 5.33 percent\n\nInternet Computer (ICP)\n\nPrice: $11.28\n\n24-hour loss: 4.85 percent\n\nFTX Token (FTT)\n\nPrice: $2.62\n\n24-hour loss: 4.05 percent\n\nSATS (1000SATS)\n\nPrice: $0.0004094\n\n24-hour loss: 3.43 percent\n\nSubscribe And Follow ABP Live On Telegram: t.me/officialabplive\n\nDisclaimer: Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Cryptocurrency is not a legal tender and is subject to market risks. Readers are advised to seek expert advice and read offer document(s) along with related important literature on the subject carefully before making any kind of investment whatsoever. Cryptocurrency market predictions are speculative and any investment made shall be at the sole cost and risk of the readers."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxPMDNmbW40UDR0RkJzU0NrOXhfTlU1QXFRNGt4czI5bHdNQ09RWVFzb1dvSGcybFg0cUpRaWMtV2cxcVBhaUtPTHRnV2E4M19jUTkxb1ozb21fWTZaREFtMVhfanRoZ3NzTDVWcnVpemVZc2tyQzhUd0xSLWVDQUYxTzNfcVNta3JEV2lNSXd4ZGV1Y2RFa3V2RnNJOEN4M2o5VFdLV2lBa29nRlJ4NTZZ0gG0AUFVX3lxTE51RzRYV1JubHltUmdsdEN1ZjU3VGFtdFhmSHZ4VEYyejlNZWVQSXg1anBaZmNMMWJaVmhSZlBiSUhoRWhkYlNWbXFPby1SV3VjbUo4N3QtU2NwREJIRWhEa2JoWlphdVd4dzgxdTdIZDdnc3A3WUZyZ0x6N2NEeURSLXA1MExveHdUcVRPNGtFR0ozZVpZd05hRmp4dHlxdXdwQmVtcEpHWDJOUFI3WUphSjF4TA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Kelexo (KLXO) Pre-Sale Might Be Impressive Event in 2024 while Ethereum (ETH) and Binance Coin (BNB) Investors Keep Optimism - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nThe presale stage is often the best time to invest in new crypto projects before hype drives up the price. Right now, investors are researching Kelexo (KLXO) presale as supporters shift funds from major assets.\n\nEnthusiasts of Kelexo (KLXO) can take part in pre-sale and buy tokens here .\n\nPotential supporters are watching KLXO\n\nKelexo (KLXO) is revolutionizing the peer-to-peer lending space by eliminating intermediaries and bureaucratic processes. Users can instantly lend or borrow funds in crypto with just a simple setup and without extensive KYC checks or long wait times.\n\nThis straightforward, decentralized model powered by blockchain technology provides significant advantages over traditional lending methods. Borrowers and lenders can connect directly, which removes the expensive overhead costs of intermediaries. Transactions in this marketplace close in seconds instead of days like at banks. Also, there are no minimum loan amounts or durations.\n\nAdvertisement\n\nBy removing these pain points, Kelexo (KLXO) offers users a more efficient way to access lending markets. The minimal identification requirements also enable participation from a wider audience, including those with limited credit history who may not qualify through conventional channels.\n\nKelexo (KLXO) also incentivizes user participation and decentralized governance through its Kelexo (KLXO) token. Token holders can submit platform enhancement proposals and vote on key decisions. An inbuilt rewards program further drives engagement.\n\nWith cutting-edge cryptography guaranteeing security, minimal barriers to access and community ownership, Kelexo (KLXO) represents the future of decentralized finance. It efficiently uses blockchain's capabilities to create a better borrowing and lending experience for all.\n\nKelexo (KLXO) is currently in stage 1 of its presale , priced at just $0.022. The presale supply is 264,000,000 out of a total supply of 440,000,000 and the presale price increases as each stage sells out.\n\nMajor players have started taking notice\n\nIt is important to state that whales and institutional traders have taken notice of the hype surrounding Kelexo (KLXO) (KLXO). Significant volume has shifted on-chain from blue chip cryptos like Ethereum (ETH) and Binance coin (BNB) into Kelexo (KLXO) as presale snipers load up their bags.\n\nThese big players help drive momentum and they’re likely expecting Kelexo (KLXO) to follow previous altcoins that did 100x or more out of the gate after presale.\n\nWith only 57% of the total supply available during the presale, scarcity of Kelexo (KLXO) tokens could drive fear of missing out (FOMO), which could lead to price surges post-listing.\n\nConsidering its strong real-world utility and advantage over existing lending platforms, Kelexo (KLXO) checks all the boxes for a breakout success story.\n\nMany believe getting in during presale could be like investing in Ethereum (ETH) or Solana (SOL) during their early days in terms of upside potential.\n\nAnalysts advise not to miss out on this presale as it could be an opportunity to invest in the top 100 coins of the bull market, an opportunity that is quickly disappearing the longer you delay.\n\nAs most experienced market movers know, investing in solid projects early is where huge gains are often made."
    }
]