[
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxObGN6LVY2RDAtRWFSSWdqbm5teG8wWFM1YVc0YmE4TTdOTzNveDBCUUxYVE9fNlhMUExURmpIOEE5R1I0c2FibDB2TGw2MkIxOVVGTU01VmVZUVR5VnRKa1dNekhoOGdvcjhwMFFxbFBuSkpZLTdsN01VY25aTWpFMm8xVnRwb2NPREVXcGxKc2xHSGpSYlM0bnNNbUlMcWJsWXIyM2VqREIzVGwwakdIc05PSFXSAbwBQVVfeXFMT19wbmNYRTNVYVVPVEg0OUtYMmpaVy1WNzBPbDRUUjQxYUhoT1pXeU4tSU1paEI2WmNxQlE5S2VTbHVGcEhYeDhfMTZIVmZhV1NfUVhpUlBJbm5TdWpibmpqQkU0cTdqZm83djdPbzQyenlVU1p3UlY1QXM0NDVDazFYWlowcjIyVjJvTlRhV1lXc19HOWs4c0VpTVR6UmdKcFo3TDhjWThsUWdFT01GT1ozMWpNa04wSzNFRlE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Gaming Token Ronin Price Spikes to Two-Year High After $246K ‘Axie Infinity’ NFT Sale - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nRON, the native token of the Ethereum-based Ronin Network, continued its recent ascent Wednesday as it popped to a nearly two-year high price of $2.89, according to data from CoinGecko. It’s up 5% on the day and 57% over the past 30 days.\n\nRonin, an Ethereum sidechain designed for crypto games, has seen a recent rise in users and increased momentum tied in part to the success of Pixels, a social farming game that migrated from fellow Ethereum scaler Polygon last fall. The game’s play-to-airdrop campaign, which will reward top players with PIXEL tokens, helped fuel a surge in Ronin users.\n\nHowever, the latest RON pump came after a couple of notable events in the world of Axie Infinity, the NFT-based monster-battling game developer Sky Mavis originally built Ronin to support back in 2021.\n\nOn Tuesday, Sky Mavis launched its seventh in-game competitive season in Axie Infinity Origins. Dubbed “Epic Era,” Season 7 will serve up 18,900 AXS and over 13.7 million SLP in reward tokens, collectively valued at about $175,000 as of this writing.\n\nAD\n\nAD\n\nThis axie just sold for 105 ETH ($245,843.85) 🤯 King Durendal has a new owner. Congrats @irfreak! Durendal is one of 3 Agamogenesis axies. Agamogenesis axies are genetically engineered axies researched and developed by MEO Corporation. They feature never-before-seen body… pic.twitter.com/5wbpRn1ltd — Jihoz.ron 🦌 (@Jihoz_Axie) January 31, 2024\n\nThen, early Wednesday, a rare NFT monster from Axie Infinity sold for 105 Ethereum, or nearly $246,000 worth at the time of sale. Axie Infinity co-founder Jeff Zirlin tweeted that the particular Agamogenesis Axie NFTs originally sold for 6 ETH in 2018, back when that sum would’ve been worth approximately $3,300.\n\nAxie Infinity saw skyrocketing success in 2021, generating billions of dollars’ worth of NFT trading volume as the game attracted millions of active players.\n\nHowever, the game’s play-to-earn economy began struggling in early 2022 and the Ronin network’s bridge to Ethereum was hacked for $622 million. Sky Mavis eventually repaid affected Ronin users and has since continued to evolve the Axie ecosystem, gradually onboarding more third-party game studios to the network.\n\nAD\n\nAD\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxQT0tWRk9NeF9QaDJCZXJQcktpa2JXRHFCQlBsWjd2WFczXy1kTjl2ZF9WcEpuWnd3NWZ3TE9ZWmZHQU9PNXRaOGNOUGRGZS1mLVExTzd0MHl0R2pIM0x2eU1POThna09KVHBBd3VkOXZWczRWQUlETEFYTnl0SFlEbm5KQ2plWUNLNnFJR2ZZMWY5bVNNUHk0UHVjNkJBMmFtcG0wTw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "MIM Loses Peg After $6.5 Million Exploit on Abracadabra Ethereum Cauldrons - Unchained",
        "content": "The Magic Internet Money (MIM) stablecoin lost its U.S. dollar-peg after an exploit on cross-chain protocol Abracadabra.money’s cauldrons on Ethereum.\n\nThe Magic Internet Money (MIM) stablecoin lost its U.S. dollar-peg after an exploit on cross-chain protocol Abracadabra.money’s cauldrons on Ethereum.\n\nDecentralized crypto lending platform Abracadabra.money was hit by an exploit on Tuesday, resulting in a $6.5 million loss to the protocol.\n\nThe exploit was flagged by blockchain security firm PeckShield, which noted that the attacker funded the exploit with 1 ETH from Tornado Cash.\n\nMagic Internet Money (MIM), the stablecoin tied to the protocol flash crashed to $0.76 after the exploit. At the time of writing, the stablecoin was still trading below its U.S. dollar-peg at around $0.98.\n\nThe attacker managed to trick certain Abracadabra’s isolated lending pools on Ethereum, called “cauldrons,” and used a nested series of smart contracts to loop the Abracadabra Degenbox’s “borrow” and “repay” functions, according to analysis from Arkham.\n\nThe hacker swapped $7M of MIM for a total of $6.3M in ETH, incurring around 10% slippage when they dumped it on Curve. They’re now holding the ETH in two addresses: 0x40d5FFA20fC0dF6bE4D9991938dAa54E6919c714 ($4.15M ETH)\n\n0xbD12D6054827ae3fc6D23B1aCf47736691b52Fd3 ($2.16M ETH) pic.twitter.com/s3ovPoWZBX — Arkham (@ArkhamIntel) January 30, 2024\n\nMeanwhile blockchain security firm CertiK noted on X that early indications pointed to a “rounding error” being the root cause of the exploit.\n\nThe MIM team acknowledged the exploit and said the protocol’s decentralized autonomous organization (DAO) was attempting to stabilize the price of the stablecoin of MIM through a buyback and burn program, likely explaining why MIM is now trading closer to its peg.\n\nAround 10 hours later, however, the team issued an update urging users to revoke all approvals to the smart contract to prevent a loss of funds.\n\nhttps://twitter.com/MIM__Spcll/status/1752444391061430403\n\nMIM has lost its peg before, fluctuating to a low of $0.95 after the collapse of FTX in November 2022, given that FTX’s native token FTT was the largest collateral token backing the stablecoin. MIM also destabilized after the collapse of the Terra ecosystem earlier that year."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxQaG91TXFqUXA4UEludVFwYkoxS0JUeWx4WHRFTzBDUlM0UnotWmt4TWRkWk5PZEtoaEF5UHhvQWZwYlQ1SS1sTHpLQTBpU042TEszMl8tWEgtRVplSURKZXRsMWVsd3ZuRnFzVkcyV0N2NkVhLUd3RWRKYlBFaWhDT0llMk1HUEpOTEFVcnkzaXJiZ3k1Zzh5UGthZ2QyXzBQU3k0ejA1MNIBrwFBVV95cUxQMzE1M2g3Znl1MDl1QzU4UTdnVUNVUU5kUnJWYmZnTjI1TTFJb2xodUFPUlVZSG1iQjdQbWVESWhLbmdvUEZveS1PNW1hcWRUNWtHa21odHhqcjBHOFFfR2k5ZlBNdHM4ZkxDVUFqV1M3R3NvYmtWWVhWNWZjdkhOanNBZE1WRUlrandXRHFKMGdxdnJCUUtQUzJsU3M2VHUyMWxQbGZQaThvaFdjRFdz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "Solana's Jupiter Hits $1.2 Billion in Daily Volume, Outpacing Uniswap on Ethereum - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nJupiter’s massive JUP token airdrop claim began Wednesday, and volume on the Solana decentralized exchange (DEX) aggregator soared to new heights in the process.\n\nAccording to data from both CoinGecko and Jupiter itself, the platform has racked up more than $1.2 billion worth of daily trading volume over the past 24 hours. That makes it top among all crypto DEXes, beating typical leader Uniswap V3 on Ethereum with $854 million (per CoinGecko). Note that the tally does not include Uniswap volume on other chains.\n\nJupiter’s 24-hour rolling tally also appears to be an all-time record for the protocol, which has recently seen surging demand. Another data source, DeFi Llama, shows that Jupiter’s single calendar-day volume record is just above $1 billion on December 14, 2023.\n\nToday’s traders won’t get anything from the initial JUP airdrop, which serves up 1 billion tokens for earlier Jupiter users to claim. Jupiter took a snapshot of eligible wallets in November and said that about 955,000 wallets could claim tokens during the drop.\n\nAD\n\nAD\n\nBut there’s reason to be optimistic: Jupiter has allocated another 3 billion tokens, 30% of the total token supply, for future airdrops to reward newer users. The timing for the next airdrop has not yet been announced, however, and amid the buzz of claim day and the sizable drops landing in Solana wallets, traders are eager to start racking up activity on the platform.\n\nJupiter opened up the claim at 10 a.m. ET and the coin started with a market price of about $0.42, according to data from Birdeye. JUP quickly popped over 70% to a price above $0.72, as Decrypt reported earlier, but it has since calmed to a current price below $0.67.\n\nEven with the sinking price late Wednesday, JUP commands a market cap of about $914 million based on the current circulating supply, and the token has generated over $500 million in trading volume in less than nine hours.\n\nAccording to a Dune dashboard that tracks public blockchain data, eligible wallets have already claimed about 566 million JUP tokens out of the initial 1 billion JUP airdrop allocation. Nearly 392,000 unique wallet addresses have claimed tokens so far, as of this writing.\n\nAD\n\nAD\n\nSOL itself has fallen about 6% on the day to the current price of around $97, according to CoinGecko, after bouncing up and down since the JUP drop.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiZkFVX3lxTE93WXgxeEZEV3pqMFFTcXZrc3FaaWxHRzFqeDMxY3A0THRDT2Q2ajg1c1hUUFlHSjdKTGx3a1hLM05LVVVuYmFuSE9yT0FOQzBTR295WDFSX0RFRV90dVUzaVJFcUNzd9IBa0FVX3lxTE1VR1ZsbC1BNUtfbDg3NWdsbkJvMXpPTzNwaE1nME52RHAxOFNNYllVVzJvOWlFb0pkTVE3Smt4ODlGX3R0cGQ3V2VDc0VzYWZYSHpLRzFOSy05WVdLSUNHSkZsaHhMVU9iaDlr?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "Jupiter Volume Surpasses Uniswap: Is Solana Taking Over Ethereum As King Of DeFi? | Bitcoinist.com - Bitcoinist",
        "content": "Data from CoinGeko shows that Solana-based decentralized exchange (DEX) Jupiter recently surpassed Ethereum’s foremost DEX Uniswap in an important metric. This has created a narrative that the SOL network might indeed be ready to take over Ethereum’s position as the King of Decentralized Finance (DeFi).\n\nJupiter Surpasses Uniswap In Trading Volume\n\nAccording to CoinGeko, Jupiter has recorded over $510 million in trading volume in the last 24 hours, surpassing Ethereum’s Uniswap V3 and V2, which recorded $455 and $76 million respectively. Jupiter’s recent dominance is believed to be partly due to the recent WEN airdrop that occurred on its launchpad.\n\nThis airdrop caused a splurge of new money into the Solana ecosystem and Jupiter in particular. While that may be the case, it also highlights a new trend that looks to be developing in the crypto ecosystem. This is in reference to the fact that the Solana network has been going toe-to-toe with Ethereum as of late.\n\nData from DeFiLlama shows that beyond Jupiter’s dominance, SOL is actually matching Ethereum’s numbers. In the last 24 hours, Solana recorded a trading volume of $704 million to Ethereum’s $741 million.\n\nIn December 2023, Solana surpassed Ethereum in 7-day DEX volume for the first time in history. Data from the Block shows that Solana also outperformed Ethereum in terms of non-fungible token (NFT) trading volume during that same period.\n\nSOL price at $97 | Source: SOL price at $97 | Source: SOLUSD on Tradingview.com\n\nSolana To Overtake Ethereum?\n\nEthereum has long been known as the network housing the foremost decentralized applications (dApps) and has continued to dominate the DeFi landscape. However, that could change soon enough if Solana’s runs become constant. This is more interesting, considering that Solana has always been referred to as the “Ethereum killer.”\n\nThe SOL network is already known to have an edge over Ethereum, considering that the former is faster and more cost-effective than the latter. Ethereum’s gas fees have also continued to pose major concerns for users, and this cannot be sustained if mainstream adoption of DEXs is to be achieved.\n\nMoreover, it has become evident that more liquidity is flowing into Solana, something that could entice more DeFi users into the ecosystem. It is worth mentioning that the WEN airdrop was just the tip of the iceberg, as the JUP, Jupiter’s native token, airdrop is set to take place on January 31.\n\nThe highly-anticipated airdrop is expected to drive considerable attention and trading activity towards Jupiter and Solana. For one, those eligible for the airdrop are likely to diversify their funds across the SOL ecosystem. Meanwhile, those who missed out on this airdrop are likely to look farm other DeFi projects on Solana in hopes that they will be eligible once these projects in question roll out their native tokens.\n\nFeatured image from Quora, chart from Tradingview.com"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMi6gFBVV95cUxQN1YtOHV6VzNUTExaYzdtMV9rVmtkOHpDNWs0YWp0TlhGREh6N1B4YU5RYWF0WE9kOVpGbm5va0ZBTEZVZnZrRE00a2lqal9JdTRWYkZDcXdfemVKRjF3VENBSTE5SDBuWkttNmduSnd0X2ZXcXFrN3FJRUlnNHRpa01lN0Z2UkVGcFZKdU43WXFfRkgxeFZtSGtadTJWcjZRd0NwVGNyLWJCU0Q5SVpac29kRUtjRXdLSmNHVXZELXNZS3cwT3FjTWNVUjBrb2ZWeHFKdGhHQVM5bmY5NlQwOVFwUTBVVjdnOGfSAe8BQVVfeXFMUDF2dW9GWE8wblNOa25TOElwcE9reDA3eFREVzM1M0VZWnFwTW8wRzZZOWZLTWJsdUdfNVVJSml3amhrMDE1X1Z2UGtGSGZKRG1VdnE3OWRZVlA4Z0FELVFZbGNEWHJLN21hRG82ZThpbC11eENMZUc1dllFbksxb19XNUV5Ylo2MVZLNUR3NlJyYTF4aGFmd1Z1R0pRMjdxNGszNUs4VE1URmR0ZVZCemhDNVhhc2tPa3lkQ3l4M2pMZWdYREk2NmJ0X1VxZDFsZXY0dmpNNmwxODE2VmVoajl4VFVLNWRTUE41cDB3VGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: BTC pumps as FOMC meeting keeps rates unchanged - FXStreet",
        "content": "Bitcoin price could rally 10% if it overcomes $43,750 barrier.\n\nEthereum price likely to revisit $2,200 as the recovery rally hits the wall.\n\nRipple price eyes a 7% fall to bottom out near $0.4746 as community digests executive’s hack.\n\nBitcoin (BTC) price fell after the Federal Open Market Committee (FOMC) meeting, and Ethereum (ETH) and Ripple (XRP) prices failed to inspire confidence as the broader altcoin community bled on Wednesday.\n\nAlso Read: As monthly close draws near, significance of $43,750 grows\n\nBitcoin price confronts $43,750\n\nBitcoin (BTC) price has failed to break past the immediate barricade at $43,750 despite the Fed keeping rates unchanged, in line with expectations. Based on the minutes, there may be no rate cuts until such a time when the Fed has greater confidence that inflation is moving toward its 2% target.\n\nComing into the event, however, Bitcoin price ticked up nearly 3% with technical indicators favoring the upside. The Relative Strength Index (RSI) is above the 50 mean level, while the histogram bars of the Awesome Oscillator (AO) and Moving Average Convergence Divergence (MACD) are flashing green. These show growing momentum in favor of bulls.\n\nIncreased buying pressure could see Bitcoin price flip the $43,750 hurdle into support and then extend above it to $48,000. In a highly bullish case, BTC could make its way to the $50,000 psychological level, 15% above current levels.\n\nBTC/USDT 1-day chart\n\nConversely, a rejection from $43,750 could see Bitcoin price retract to the $40,726 support. An extended fall could send BTC to $37,800, below which there would be a cliff all the way to the $30,000 psychological level.\n\nAlso Read: Bitcoin price likely to support these altcoin narratives this week\n\nEthereum price could fall to $2,200\n\nEthereum (ETH) price is stuck below the ascending parallel channel, with the potential to fall as momentum is fading. The RSI, is below the 50 midline, while both the AO and MACD remain in negative territory, bolstering the case for the bears.\n\nA rejection from the lower boundary of the channel could see Ethereum price fall past the $2,200 level and the 100-day SMA at $2,177 to test the supply zone that now acts as a bullish breaker between $2,059 and $2,118. Breaking below its midline at $2,091 would confirm the continuation of the pullback’s potential for going as low as the $2,000 psychological level. To invalidate the bullish thesis, the price must record a candlestick close below $1,935.\n\nETH/USDT 1-day chart\n\nHowever, if more bulls show resolve, Ethereum price could venture into the supply zone, flipping $2,388 into support. In a highly bullish case, the gains could send ETH past $2,717 range high to record a higher high above $2,800.\n\nAlso Read: Ethereum Price Prediction: $2,500 in sight as bullish metrics steer ETH back into the channel\n\nRipple price dips after hacking incident\n\nRipple (XRP) price has dipped into the daily Fair Value Gap (FVG) between $0.4927 and $0.5111. Breaking and closing below its midline at $0.5040 could see XRP price extend the fall to the support floor at $0.4746.\n\nXRP/USDT 1-day chart\n\nNevertheless, enhanced buyer activity among bulls could send Ripple price north past multiple obstacles to overcome resistance due to the falling trendline. This would bring the $0.7000 psychological level in sight.\n\nAlso Read: Ripple executive’s XRP accounts get compromised in $112.5 million hack"
    }
]