[
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTFByQUZRY2lPdm0tLThjTndBNEJRcUVIWkdvMnpLa2VUNTMzWXlmRTR5azhaSDJkaE53UXJ4UnRObE94dzhDbmt6MlotckE2Z1NDazREQWpIVEQwZm5SMGZaUzlmU1Vtc0V1c3ZOZkdCMjVrZG8xeGtHRDFoQW1pZ9IBgwFBVV95cUxPZkw0RDdGbHdGRmlsb1RYLW5laFFJbGlaazVCUUhOd3hhc1ZHTVVEMXVsOGQxWTZGdzBPVEw1dV9tNmxPVHpHZUNHa2tLOTNaeDdyVEs0Z2VTMmFwX2Jmc2l4cXRmLUx2NmdmWUVXUXJpRU14Wm1UQjhuclR4VTJtN3FBdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Skyrockets 100% Against Bitcoin in Annual Revenue - U.Today",
        "content": "Ethereum has surpassed Bitcoin in fee income over the past year by an epic 100%, according to the newest report from Lookonchain. Thus, its network has recorded $2.73 billion in fee income, the most in the industry. Bitcoin, in second place, generated $1.3 billion. Closing the top three is Tron Network, with almost $460 million.\n\nAdvertisement\n\nOther networks also contributed to the overall fee income landscape. Solana generated $241.3 million, Binance's chain accumulated $176.6 million and Avalanche recorded $68.83 million. Additionally, the zkSync Era earned nearly $60 million, Optimism $40.4 million and Polygon $23.9 million.\n\nHere are the top 10 chains by 1-year fee revenue.#Ethereum earns a fee of $2.728B per year, #Bitcoin earns a fee of $1.302B per year, and #TronNetwork earns a fee of $459.39M per year. pic.twitter.com/ixAiP9g8JA — Lookonchain (@lookonchain) July 3, 2024\n\nAs the data highlights, Ethereum has a significant lead, doubling Bitcoin's revenue. This result is attributed to a broader range of applications and services on the network of the main altocin, with higher usage and transaction fees as a result.\n\nAdvertisement\n\nSure win?\n\nEthereum's ecosystem supports decentralized finance platforms, NFTs and various applications, all of which contribute to increased transaction volume and fee income. This is what has positioned ETH as a more versatile and widely used network compared to Bitcoin.\n\nIn return, Bitcoin's revenue, while still over a billion dollars, is primarily driven by its role as a digital store of value and medium of exchange. Its transaction fees are affected by network congestion and the price of BTC itself, which can fluctuate significantly.\n\nHowever, it still lacks the extensive range of applications found in the Ethereum ecosystem, resulting in lower overall fee income."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNSDJla0lJNVFtV3JlWG1TUkR1MmJqUzJfM285QnZfaWVHOVBkdGxoM1FTQ2ttdmgyMWFvZS1USk9fMkkyZjF6YUhlbXNDc0ViY3NwVlA3ODhGTlFYV0lhWGZuWDRSWlNCUTNsdEhEczNRTHQwUGxJX1R4Z3FKa0trWlNhWWJhNjlXTnFTetIBlAFBVV95cUxNb044c1NVc3VYb2tKZkxIVGc5LTdzaVJNRTVsVmJweFAzdlVZZEZjWElzMG9EOTlXdDh0NndKYTZWb244S1VIbms1cGlNNUxEc0xrTDhVcTV2NS05MWt3QzlyaGc0RnBzbmZPTFFqVE9IeUhUQURDS1NObEwxcVJUNlJjYm9ILXM0TFhiTUNldEhjck1R?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jul 2024 07:00:00 GMT",
        "title": "Crypto Liquidations Top $200 Million as Ethereum, Bitcoin Fall - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nCrypto market liquidations spiked to their highest point in a week on Wednesday as the price of Bitcoin sunk below $60,000.\n\nIn the past 24 hours, more than 74,000 traders were liquidated to the tune of $208 million, CoinGlass data shows.\n\nThe majority of those — some $184 million — struck investors holding long positions that had bet on prices going up.\n\nThe largest liquidations afflicted Ethereum investors, at $55.5 million, almost entirely in long positions, data shows.\n\nAD\n\nAD\n\nOngoing issues surrounding U.S. monetary policy, geopolitical tensions, and the upcoming U.S. presidential election in November are projected to impact the top cryptocurrency's price throughout 2024.\n\nBitcoin dropped from around $62,200 to as low as $59,425 in intraday trading. The asset has since clawed back losses above $60,200 but is still down 3% over the past 24 hours.\n\nMeanwhile, Ethereum is down by 3% over the same period, falling from a Wednesday high of $3,425 to as low as $3,254. It's now trading at $3,300.\n\nSolana, the world's fifth-largest crypto by market cap, took the largest hit among the top 10 coins, down roughly 8% to $140. Solana had been riding high on New York-based investment management firm VanEck's filing of its “Solana Trust” exchange-traded fund late last month.\n\nAD\n\nAD\n\nTop cryptocurrencies have fallen over the past month. Ethereum is down over 12% across 30 days despite simmering interest in the debut of Ethereum spot ETFs.\n\nSome analysts predict the new financial products could begin trading by mid-July, with at least one firm predicting the price of ETH will subsequently take off. Bitcoin is down 12% over the same period.\n\nTo be sure, analysts still see further price gains this year, with the current market cooling representing a precursor to another major price surge in the coming months, Decrypt reported Monday.\n\nOn Wednesday, analytics firm CryptoQuant released a report examining Bitcoin mining metrics and flagged conditions for a bottoming of prices at current levels.\n\nEdited by Sebastian Sinclair."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMikwJBVV95cUxQN29WODA1M0lfSXNzaGVCUUZYS2tzY2NxbDROdTFmOUtoN2loUWNmYXlrSGR1d3hIUXREbkcwVlYyd2dPTWlFS3FpRHZoMkRDN1dZc2pyUUJJOE90T2xKLXVwVWtqdURXOXd1WW9VdUJwblZNbzhwZGthcXAycmQ3blhxZmxjM0NGS0ZZYTJsdFZ0Y21tenJWa05KZThCNlVRZXM4MXVPcnVDM21aWnBOY2VtUFlGMWJWZU9tc045d0pjY2NnWGhUS2hiNnVXdGlLbnZJOXdHSHhtVndWRnJNLTZjbHdBWDVkYTVxSWs4UTFiUmVjUjh5ajBLZXRJVUR0Ni1qZmFKWFZYUE5jd1pNbHcxZ9IBmAJBVV95cUxNMkEzcXgwOFJYb0ZZODFmbzRIVUhpN3hFYWhSTURIUHpWTGxOajlWNktaX0dyUllsU2htbWUzOEw2NzhmX0RlYVlWNndEMTNNRmJCTmMwVE5QNXhyNnpFMzRDYThCYTYwY3FnWnd4QjhwUFQtOWwtM0Ryc1NLZXh6RmtabmNIQzlSeU5OS0tRWUMxRTVTdVFyNFdkdkV1VFdDcDJ6VWZVMmFLbE1KWURCTWh0Qm50VVA4V3NCYzZqNG9Qd1FSYnBkNUs4bTczaVZpZlZTUmVUNE1Pa180c2UxT0dzWEVNNWNlNlY0djdwYl9TbWpMWEY4TnpSckJRMl9SVXpDMk1vTjdwNVJFTENSMnk1a2xRQV8y?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jul 2024 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin, Ethereum fall up to 3% on Fed’s hawkish tone; Solana, Cardano defy trends wit - The Economic Times",
        "content": "ETMarkets.com\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nWhile Bitcoin’s (BTC) resilience over the last one hour was palpable, this crypto asset is still trading down nearly 3% from the previous session. Around 12 pm today, it was trading at $61,035.66. The slide in BTC had an impact on other altcoins including Ethereum (ETH), Tether, Dogecoin , Avalanche, and Shiba Inu which were down by up to 2.5%.Altcoins that were trading in the green around this time included Solana, XRP , Toncoin, Cardano, and Tron which gained up to 2%.The crypto market's lackluster trade could be attributed to the remarks by US Federal Reserve Chair Jerome Powell's hawkish statement which said that the Central Bank needs more evidence on inflation to decide on the timing of the rate cuts. Moreover, the May jobs data was reported higher-than-expected.Bitcoin's decline reflects both concerns and opportunities in the crypto market, Sathvik Vishwanath, Co-Founder & CEO at Unocoin said as he highlighted strong trading volume of $20 billion over the past day, indicating significant market activity. \"The news suggests that large holders of Bitcoin, known as whales, are piling up, indicating confidence in a potential year-end rally,\" he said.Vishwanath said that BTC is currently finding support within an ascending channel of around $61,700 though it faces resistance at the 50-day EMA at $62,210, suggesting a limited immediate upside. \"With the RSI at 48, indicating neutral sentiment, the market is depending on Bitcoin's ability to hold above $61,700 to avoid a deeper decline to the $60,700 and $60,000 support levels,\" he added.Source: CoinMarketCapOn the BTC price movement, CoinDCX Research Team in a note said that the current drop filled most of the weekend BTC CME gap, though another gap remains around $59,700-$59,800 which suggests that BTC could drop further to fill it.Currently, Solana is outperforming BTC and ETH due to ETF hype, the note said, adding that the market is slightly negative due to bearishness in BTC.\"Bitcoin has been consolidating around $61,000 for the past 24 hours, following some profit-taking by traders. It's having a hard time breaking past the $63,600 resistance level. If it doesn't manage to hold its current position, Bitcoin might drop back to the $60,800 support level, with bulls trying to keep it above that mark,\" Edul Patel, CEO of Mudrex warned.He pins his hopes on approval to Ether ETFs which he said could improve the market sentiments.Also Read: Gold’s 13% uptick beats Nifty's H1CY24 gains. Who could hold the edge in second half? (Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMikwJBVV95cUxQN29WODA1M0lfSXNzaGVCUUZYS2tzY2NxbDROdTFmOUtoN2loUWNmYXlrSGR1d3hIUXREbkcwVlYyd2dPTWlFS3FpRHZoMkRDN1dZc2pyUUJJOE90T2xKLXVwVWtqdURXOXd1WW9VdUJwblZNbzhwZGthcXAycmQ3blhxZmxjM0NGS0ZZYTJsdFZ0Y21tenJWa05KZThCNlVRZXM4MXVPcnVDM21aWnBOY2VtUFlGMWJWZU9tc045d0pjY2NnWGhUS2hiNnVXdGlLbnZJOXdHSHhtVndWRnJNLTZjbHdBWDVkYTVxSWs4UTFiUmVjUjh5ajBLZXRJVUR0Ni1qZmFKWFZYUE5jd1pNbHcxZ9IBmAJBVV95cUxNMkEzcXgwOFJYb0ZZODFmbzRIVUhpN3hFYWhSTURIUHpWTGxOajlWNktaX0dyUllsU2htbWUzOEw2NzhmX0RlYVlWNndEMTNNRmJCTmMwVE5QNXhyNnpFMzRDYThCYTYwY3FnWnd4QjhwUFQtOWwtM0Ryc1NLZXh6RmtabmNIQzlSeU5OS0tRWUMxRTVTdVFyNFdkdkV1VFdDcDJ6VWZVMmFLbE1KWURCTWh0Qm50VVA4V3NCYzZqNG9Qd1FSYnBkNUs4bTczaVZpZlZTUmVUNE1Pa180c2UxT0dzWEVNNWNlNlY0djdwYl9TbWpMWEY4TnpSckJRMl9SVXpDMk1vTjdwNVJFTENSMnk1a2xRQV8y?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jul 2024 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin, Ethereum fall up to 3% on Fed’s hawkish tone; Solana, Cardano defy trends wit - The Economic Times",
        "content": "ETMarkets.com\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nWhile Bitcoin’s (BTC) resilience over the last one hour was palpable, this crypto asset is still trading down nearly 3% from the previous session. Around 12 pm today, it was trading at $61,035.66. The slide in BTC had an impact on other altcoins including Ethereum (ETH), Tether, Dogecoin , Avalanche, and Shiba Inu which were down by up to 2.5%.Altcoins that were trading in the green around this time included Solana, XRP , Toncoin, Cardano, and Tron which gained up to 2%.The crypto market's lackluster trade could be attributed to the remarks by US Federal Reserve Chair Jerome Powell's hawkish statement which said that the Central Bank needs more evidence on inflation to decide on the timing of the rate cuts. Moreover, the May jobs data was reported higher-than-expected.Bitcoin's decline reflects both concerns and opportunities in the crypto market, Sathvik Vishwanath, Co-Founder & CEO at Unocoin said as he highlighted strong trading volume of $20 billion over the past day, indicating significant market activity. \"The news suggests that large holders of Bitcoin, known as whales, are piling up, indicating confidence in a potential year-end rally,\" he said.Vishwanath said that BTC is currently finding support within an ascending channel of around $61,700 though it faces resistance at the 50-day EMA at $62,210, suggesting a limited immediate upside. \"With the RSI at 48, indicating neutral sentiment, the market is depending on Bitcoin's ability to hold above $61,700 to avoid a deeper decline to the $60,700 and $60,000 support levels,\" he added.Source: CoinMarketCapOn the BTC price movement, CoinDCX Research Team in a note said that the current drop filled most of the weekend BTC CME gap, though another gap remains around $59,700-$59,800 which suggests that BTC could drop further to fill it.Currently, Solana is outperforming BTC and ETH due to ETF hype, the note said, adding that the market is slightly negative due to bearishness in BTC.\"Bitcoin has been consolidating around $61,000 for the past 24 hours, following some profit-taking by traders. It's having a hard time breaking past the $63,600 resistance level. If it doesn't manage to hold its current position, Bitcoin might drop back to the $60,800 support level, with bulls trying to keep it above that mark,\" Edul Patel, CEO of Mudrex warned.He pins his hopes on approval to Ether ETFs which he said could improve the market sentiments.Also Read: Gold’s 13% uptick beats Nifty's H1CY24 gains. Who could hold the edge in second half? (Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE50YU9yNmg4aXJRYUpCZmxsUkFtdFJHQVlGaDRpUUxLTnRrSmtwTHRvNjRRb0FrdWdzcXlJVlRSVWpibm9wakxaQ0ZNaGNLVkZIaVRXUVpBUG9GQy1HVW5JcWY0OVgzNmFybS1CRnlHRDNVdVhKU2fSAX5BVV95cUxNVkYwaDlpS2pOQTA5XzVDY0gtVU1jdDRIX2dZQ05BTlF3R3FyVkZSNWw3Y3cxMHNYQWFtY21Ga3NwdnZfVVl5em9XNUJCR1EwbEFPZU5YTWFqaW9aLWtSaGpZLUtGZmhCRzdoQTVvQWNaM3RCUzJkQjdxY0hSY2c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 03 Jul 2024 07:00:00 GMT",
        "title": "Bitwise Updates Ethereum ETF Filing as US Listings Near - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAsset manager Bitwise submitted an updated registration statement for its proposed spot Ethereum ETF with regulators on Wednesday, disclosing its plans to waive fees. While largely procedural, this latest revision is seen by market observers as a sign that the launch of Ethereum ETFs is imminent.\n\n“Expect more from other issuers throughout the rest of the week,” Bloomberg ETF analyst James Seyffart wrote on Twitter (aka X). “We're thinking these things could potentially [be listed] later next week, or the week of the 15th at this point.”\n\nAfter shares in the Bitwise Ethereum ETF are listed on an exchange, Bitwise will waive a yet-to-be-defined management fee on the first $500 million its fund garners during that period, the amended filing with the Securities and Exchange Commission (SEC) stated.\n\nBitwise’s move follows similar ones from Franklin Templeton and VanEck. Both ETF hopefuls have included fee waivers in filings for the first $10 billion and $1.5 billion, respectively.\n\nAD\n\nAD\n\nAnticipation of the trading of spot Ethereum ETFs has grown steadily since the regulator’s last-minute approval in May. While the SEC approved several so-called form 19b-4s, it has yet to green light individual S-1 filings from asset managers, which are needed for trading to begin.\n\nBitwise submitted its amended S-1 days before it was actually due, according to Bloomberg ETF analyst Eric Balchunas. On Twitter, he floated the idea that Bitwise “wanted to get it off their plate,” and that the SEC’s latest round of comments appeared to be minimal.\n\n“From what I hear the last round of comments were ‘literally nothing’—took zero time to update,” he said.\n\nBalchunas concurred that the class of products seems on track to begin trading this month. At the same time, he wondered why the regulator appears to be dragging its feet, considering the SEC seems mostly satisfied with the filings that firms have put forward so far.\n\nAD\n\nAD\n\n“Given how light comments were, these could have easily been trading by now,” he wrote. “Could be one 'problem' issuer slowing down [the] process or just summertime.”\n\nNot long after spot Ethereum ETFs were approved on May 23, the cryptocurrency rallied to around $4,000. Yet as the approval process has played out, Ethereum’s price has shed most of those gains, drifting down $3,270, as of this writing.\n\nSEC Chair Gary Gensler said last month that the process for launching spot Ethereum ETFs is “going smoothly.” Speaking at the Bloomberg Invest Summit, he added that progress is dependent on asset managers providing full disclosures.\n\nThough Bitwise’s amended filing has few changes, it does include new disclosure language. For example, a clause was inserted stating the “chair of the SEC has stated that the SEC has authority under existing laws to regulate the digital asset sector” within a section on oversight.\n\nBitwise also added a few sentences disclosing that certain digital asset trading platforms, to the extent that they are regulated, may not be in compliance with applicable rules.\n\nFinally, a section also outlines the “Initial Creation of Ether.” Looking at Ethereum’s initial supply of 72 million, it shows how most was sold to the public through a crowd sale in 2014, alongside distributions to the Ethereum Foundation and the network's developers.\n\nEdited by Ryan Ozawa."
    }
]