[
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMijgJBVV95cUxPcjVobXVmRGtybm9DWUxwT0FsNWg0T2wxQ09VZmlwUW9Ka2FYbktEX0dMa2xYSmI3cGZoZ3pxV05jN09EYy01YWh3NHc0WTNaaGJnYlpaUGxKTnNmTGpxNW1FbXpzbFY1S1c0SXlzRFZRWGFIOXIxSzZBeENDbFlUaVJ4UUwxclp2YndZdmtqbThieS0xalR0RV85ZWlKOEVPLTR4S2NRdzRvTVVTRWpzc2Zzc0FtUHhqZHpaYmFkdUk0YWJ6dURrRjh2UUIzRlNpbEp3WjJ0RlAtN3BXZlFVYlY0bEZ4djVoalNDbFhkbWVFWldiRE1yN0o5YmU4MU1XaWtGbkVNVzRBS095b1HSAZMCQVVfeXFMTzU2Vi1RbzFuTVZvWFRmci1wcXkxcGhjaVhBVkQ1ZlBsUF9XV0VHVVMtWjB4MmlEcmJQTlZteFZlTnRaYU9NNHNORzgxRHEyamEwTHRsN1hZLVFGUmZUWDcxcWRXVzdCd1pRMkVrV2pzTnNhSThoTnZLeXd3Z0l2cTZ3N3R2cDJPTlRzMWNOc21XLXBiTlEyMXRsYmxyUG5DakZKcWJ5NV9hVVJoQU95cWhVNmxsTllUWThaUHJVb3ZGY29aTC1tcFpMdDlzc1ppQWtOelVfN1NnaXoxRE5Mc25DOGE2QUNsbFBYeWtqVGpIb3VDRGFibDlYY0FVMTY2YUIzTWJLRWx4YkYwNGVDbTBtVnM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jun 2024 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin holds above $60k but down 1.5%. Ethereum, BNB, Solana, Dogecoin, others fall u - The Economic Times",
        "content": "Did you Know?\n\nThe world of cryptocurrencies is very dynamic. Prices can go up or down in a matter of seconds. Thus, having reliable answers to such questions is crucial for investors."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMijgJBVV95cUxPcjVobXVmRGtybm9DWUxwT0FsNWg0T2wxQ09VZmlwUW9Ka2FYbktEX0dMa2xYSmI3cGZoZ3pxV05jN09EYy01YWh3NHc0WTNaaGJnYlpaUGxKTnNmTGpxNW1FbXpzbFY1S1c0SXlzRFZRWGFIOXIxSzZBeENDbFlUaVJ4UUwxclp2YndZdmtqbThieS0xalR0RV85ZWlKOEVPLTR4S2NRdzRvTVVTRWpzc2Zzc0FtUHhqZHpaYmFkdUk0YWJ6dURrRjh2UUIzRlNpbEp3WjJ0RlAtN3BXZlFVYlY0bEZ4djVoalNDbFhkbWVFWldiRE1yN0o5YmU4MU1XaWtGbkVNVzRBS095b1HSAZMCQVVfeXFMTzU2Vi1RbzFuTVZvWFRmci1wcXkxcGhjaVhBVkQ1ZlBsUF9XV0VHVVMtWjB4MmlEcmJQTlZteFZlTnRaYU9NNHNORzgxRHEyamEwTHRsN1hZLVFGUmZUWDcxcWRXVzdCd1pRMkVrV2pzTnNhSThoTnZLeXd3Z0l2cTZ3N3R2cDJPTlRzMWNOc21XLXBiTlEyMXRsYmxyUG5DakZKcWJ5NV9hVVJoQU95cWhVNmxsTllUWThaUHJVb3ZGY29aTC1tcFpMdDlzc1ppQWtOelVfN1NnaXoxRE5Mc25DOGE2QUNsbFBYeWtqVGpIb3VDRGFibDlYY0FVMTY2YUIzTWJLRWx4YkYwNGVDbTBtVnM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jun 2024 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin holds above $60k but down 1.5%. Ethereum, BNB, Solana, Dogecoin, others fall u - The Economic Times",
        "content": "Did you Know?\n\nThe world of cryptocurrencies is very dynamic. Prices can go up or down in a matter of seconds. Thus, having reliable answers to such questions is crucial for investors."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiaEFVX3lxTE9YZFdDaHRCOG4wVWFNbTF4aHliOXBlWVo0a0hHdVctQ1ptR2pFaThTX0kyZ2pUbzhsYkpMekV4UldaQ0xQTGY1SDFEeEw5dzdHbG56dy1ZVTRRU0R5dWlydEhraVQzeDFI0gFuQVVfeXFMT1R0VmxYbGtHSVRMSzhneGgyMG1kd2tXR2o2YVIwRnFJT3VNbjQ1QkpuVGZleGVFczQxbGJHQUdWRHZNVGNJNE5qY0lSUmZzSGdEQngxczMwcHdCbVVmZnJ4ZVhmMUJDemhvR3Y5cGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jun 2024 07:00:00 GMT",
        "title": "Cardano Boosts Connectivity with Ethereum - U.Today",
        "content": "The Cardano Foundation, the non-profit organization behind the popular proof-of-stake blockchain, has boosted the level of interoperability by integrating the Inter-Blockchain Communication protocol.\n\nAdvertisement\n\nThe integration now makes it easier for developers to Ethereum Virtual Machine (EVM)-based applications on Cardano sidechain.\n\nThe standardized protocol, which was originally introduced back in 2019 by Cosmos Network, makes it possible to bridge several heterogeneous blockchains by sending information via special channels. Data can be easily transferred by blockchain with different consensus mechanisms. No direct communication between them is required in order to ensure the validity of certain information.\n\nAdvertisement\n\nWith Cardano, for instance, enterprises that rely on the ICB protocol can still take advantage of the network's deterministic fees and other advantages while working with other chains. \"With the implementation of IBC on Cardano, businesses benefit from a framework for developing and deploying scalable, secure, and interoperable blockchain solutions,\" the foundation said.\n\nA governance controversy\n\nIn other news, the foundation recently stirred some controversy with its voting decision earlier this week.\n\nDuring a bootstrapping phase, which will take place between the two stages of the hard fork's implementation, the foundation will become a member of an Interim Constitutional Committee (ICC).\n\nIt has already taken part in the ICC election, placing The Cardano Atlantic Council at the top of its ratings. When voting for candidates, it takes into account such factors as the level of engagement, technical expertise, transparency, and so on.\n\nHowever, the foundation faced some pushback from some members of the community who believe that it had to rule itself out from the entire ICC voting process. \"I think it is wrong that Cardano Foundation should put their thumb on the scales,\" one user commented."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTFB5QkdTcGI3a0NOd2RTU3NzQTBWZ1gwbExJamIxX05SNjVhNWtYdEQ0dmdvVlkzbFhscFREOFU1WkVRUjgtM1NuVFdIczk2VUFsVHJZQjJaQ2ttajE1aHRLVXR2UnFZT3FBLVpsN054blZ0UDlNWUHSAXtBVV95cUxPSkktUkU2YjNtYVotdUl3bGVPYXdzUC1NMFNqWjhCT0FYeVJxQTQ4RFZWRzA1M2NLNW4tbWJuTmRNcFR2NzRad2J5OHIxN29KM2lnODl4aFpjRGVpWG9BTTV2RGN0dXl2Y2tmTUF6VlZwUlhhVlFGSEhEZEE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Records Major Bullish Sign Against Bitcoin - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nEthereum (ETH) might finally be ready (BTC) to gain some ground against Bitcoin.\n\nAdvertisement\n\nAs noted by prominent trader Josh Olszewicz, the ETH/BTC pair has managed to close above the two-day Ichimoku cloud for the first time in 525 days.\n\nfor the first time in 525 days, ETH/BTC has closed above the 2-day Cloud pic.twitter.com/ihwRBF6uY1 — #333kByJuly2025 (@CarpeNoctom) June 27, 2024\n\nHis analysis suggests that the pair has likely bottomed after nearly two years of underperformance.\n\nAdvertisement\n\nThe flagship altcoin is currently changing hands at 0.055 BTC on the Binance exchange.\n\nAfter peaking at 0.061 BTC back in January, the ETH/BTC pair experienced a substantial downtrend, plunging all the way back to 0.044 BTC in May. However, Ethereum managed to gain as much as 28% against the largest cryptocurrency during the same month following the unexpected approval of several 19b-4 forms for Ethereum exchange-traded funds (ETFs) by the U.S. Securities and Exchange Commission.\n\nThe approval process is now going \"smoothly,\" according to SEC Chair Gary Gensler , and it seems like these products will be able to start trading in the near future.\n\nEarlier today, Reuters reported that Ethereum ETFs would likely go live by July 4. According to the anonymous sources cited by the outlet, the talks between prospective ETF issuers and the regulator have advanced to the \"final stages.\" Now, only \"minor\" issues have to be resolved.\n\nEven though the expected launch of Ethereum ETFs could be a major bullish catalyst for the leading altcoin, it remains to be seen whether inflows will be impressive enough for the market. Morningstar's Bryan Armour has noted that Ethereum ETFs would be unable to generate the same level of excitement as Bitcoin ETFs."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPbVFlUmdrTUhYdkVmWXhkdlRUX0RQOWRuZWY4SGFEQ2JvMmZ6dkNMaWJKemNxcFczQlpOOWlzSmJheW9fTW5vWlJ3MlBiNnBCUTlQRVVKMFBKVmpQbHZ3NjQwa0ZPQ1E3N2ticDVZRHQ3WnA5eXBLaVA5aHAteDVhYXk0VGFjUWtU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Jun 2024 07:00:00 GMT",
        "title": "Prediction: Ethereum Could Skyrocket to $22,000 by 2030 - The Motley Fool",
        "content": "Ethereum continues to be a tech disruptor. But will it really be worth over $2 trillion by 2030?\n\nThrough the first six months of the year, Ethereum (ETH -5.65%) is up 50%. That's right in line with the performance of Bitcoin (BTC -3.04%), which is also up 50%. At its current price of $3,500, Ethereum is within striking distance of its all-time high of $4,891.\n\nBut the best may be yet to come. Investment firm VanEck recently predicted that Ethereum could hit a price of $22,000 by 2030. That might sound overly aggressive, but VanEck has some solid data to back up its prediction. So will it be right or not?\n\nEthereum's disruptive ability\n\nFor the better part of the past decade, we've seen Ethereum disrupt the tech sector. Ethereum was the first smart contract blockchain platform. It pioneered entire sectors of the crypto world -- such as non-fungible tokens (NFTs) and decentralized finance (DeFi) -- that had never existed before. VanEck is counting on Ethereum's ability to remain a tech disruptor over the next five years to warrant such a hefty valuation.\n\nMost importantly, VanEck sees Ethereum making further inroads into the finance, banking, and payments sectors. And VanEck also sees Ethereum building value in sectors ranging from blockchain gaming to artificial intelligence (AI). The key to disruption will be Ethereum's ability to provide solutions that are cheaper, faster, and better than those currently available from market leaders.\n\nThe $15 trillion opportunity\n\nThat's where things get interesting, because VanEck digs into the numbers to estimate the total potential market opportunity (which it refers to as total addressable market, or TAM). That number could be as high as $15 trillion. The lion's share of this value ($10.9 trillion) will come from finance, banking, and payments. And there is a growing market opportunity ($1.4 trillion) that could result from artificial intelligence.\n\nThe logic here is simple but powerful: Ethereum will continue to roll out disruptive solutions that make it possible to win market share from entrenched incumbents. And the big push will be in DeFi, where a rich, vibrant ecosystem already exists. Just think of how upstart decentralized cryptocurrency exchanges are winning market share from centralized cryptocurrency exchanges such as Coinbase Global (COIN -7.39%).\n\nWhen you consider key future trends such as asset tokenization (which involves moving real-world financial assets onto the blockchain), it's possible to understand just how big the DeFi opportunity might be. Cathie Wood of Ark Invest, for example, has suggested that smart contract networks such as Ethereum could be generating fees of $450 billion by 2030.\n\nThe new ETFs\n\nAnd, finally, there's the matter of the new spot Ethereum ETFs. These recently won approval from regulators and are expected to start trading soon. Once they do, they could lead to a huge influx of new money into Ethereum. VanEck now predicts that the impact of these new ETFs could be greater than that of the spot Bitcoin ETFs.\n\nThat's highly debatable, though. As one of the firms that will be launching a spot Ethereum ETF, VanEck may be overestimating the potential impact of these ETFs. In comparison, JPMorgan Chase (JPM -1.81%) predicts these new ETFs might only attract $3 billion in new investor money. That's about one-tenth of what the new spot Bitcoin ETFs have attracted.\n\nA $2 trillion asset?\n\nVanEck provides three different scenarios for the future value of Ethereum. In the base case scenario, VanEck predicts a price of $22,000. In the bull case scenario, VanEck predicts a price of $154,000. And, in a bear case scenario, VanEck predicts that the price of Ethereum could collapse to just $360. Yikes!\n\nThat's a wide range of outcomes to work with, and that's what makes investing in Ethereum potentially so risky. Yes, Ethereum could soar to a price of $22,000, giving it a massive $2 trillion market cap. But it could also lose nearly 90% of its value and be banished to the dustbin of history.\n\nKeep in mind that Ethereum is not the only blockchain going after that $15 trillion market opportunity. There are plenty of other blockchain competitors, each one promising solutions that are cheaper, faster, and better. So if you're thinking about investing in Ethereum, make sure you do your due diligence and have a good grasp of the assumptions being used to predict a price of $22,000."
    }
]