[
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMimAJBVV95cUxOMFlJbExicGd4RWtka0FLS3o5WVZPdmNBVldvbTVZSGFqZ1d1Y3R4YjFpY0d4dUJ6N09ESHVLNFhBeHRZcXNOM1lYQVFGT2hjVGZhbkp6LUtUaWE2X3FCRldqbmhPeXFRcTdJaHUyVlRrX0xOVTNfaVlVYkJsWVJwVENwYkZNQU9ObVZZT3ozUkxZZ3RHREV5MTFXZktFYm1FeWppakFLemNiMVJVSVo4Z29vdG1UMVlIQk5CZzNaNW82cmczSDk1YzNURExwUGd0UjNidFdHQVI5LTJWZlRpYTBOc3ZNZjRDanA5ZVhkRGFJMC1qMzV6UnhqclBLNHd4QzlXLUE5OUJpX09xOFJ4R2VlRjR6aDcz0gGeAkFVX3lxTE92bXhkRDFJanh4Z3E1cWZ5RGkzZGpfSkQ2S005dDdBWm9Jd08wRU1VMkFMY0Y0VFdNT25OV2FxMmtvUHppaF9EWnlWVEI2TUtwTFdVczZqNF9HblZuYnJMNWdrWXlzUkJnWFZOYklBNmlGbmFvNUh3X0FISFl2MTZFalNKcjVoVHFzcmZfWUxRa1p3eTFTeWN2eHBKcmh2TWRkYV9vZ1k4YlBoX0huT1hyT05PcXlmY3AxeFRIZ3FsRV91UTJ1R2tKQmhxTXJxZUpfakU1LUNuMnE2czlneERtMEIxa01Ya2lQUGZfMnp6dndZQlN4VzlTMzA4Tm53eGM0RUxhTXk5cnFNaTF5Ri1UdmpRXzhKQVFFZGZONkE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jan 2024 08:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin falls below $41,000; Solana, Dogecoin decline over 4% - The Economic Times",
        "content": "Did you Know?\n\nThe world of cryptocurrencies is very dynamic. Prices can go up or down in a matter of seconds. Thus, having reliable answers to such questions is crucial for investors."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMimAJBVV95cUxOMFlJbExicGd4RWtka0FLS3o5WVZPdmNBVldvbTVZSGFqZ1d1Y3R4YjFpY0d4dUJ6N09ESHVLNFhBeHRZcXNOM1lYQVFGT2hjVGZhbkp6LUtUaWE2X3FCRldqbmhPeXFRcTdJaHUyVlRrX0xOVTNfaVlVYkJsWVJwVENwYkZNQU9ObVZZT3ozUkxZZ3RHREV5MTFXZktFYm1FeWppakFLemNiMVJVSVo4Z29vdG1UMVlIQk5CZzNaNW82cmczSDk1YzNURExwUGd0UjNidFdHQVI5LTJWZlRpYTBOc3ZNZjRDanA5ZVhkRGFJMC1qMzV6UnhqclBLNHd4QzlXLUE5OUJpX09xOFJ4R2VlRjR6aDcz0gGeAkFVX3lxTE92bXhkRDFJanh4Z3E1cWZ5RGkzZGpfSkQ2S005dDdBWm9Jd08wRU1VMkFMY0Y0VFdNT25OV2FxMmtvUHppaF9EWnlWVEI2TUtwTFdVczZqNF9HblZuYnJMNWdrWXlzUkJnWFZOYklBNmlGbmFvNUh3X0FISFl2MTZFalNKcjVoVHFzcmZfWUxRa1p3eTFTeWN2eHBKcmh2TWRkYV9vZ1k4YlBoX0huT1hyT05PcXlmY3AxeFRIZ3FsRV91UTJ1R2tKQmhxTXJxZUpfakU1LUNuMnE2czlneERtMEIxa01Ya2lQUGZfMnp6dndZQlN4VzlTMzA4Tm53eGM0RUxhTXk5cnFNaTF5Ri1UdmpRXzhKQVFFZGZONkE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jan 2024 08:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin falls below $41,000; Solana, Dogecoin decline over 4% - The Economic Times",
        "content": "Did you Know?\n\nThe world of cryptocurrencies is very dynamic. Prices can go up or down in a matter of seconds. Thus, having reliable answers to such questions is crucial for investors."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxOdm41ZjdvTUlWZ3JFNU5ld1RTV2ZDNTNFbFRSMjRmVkFtZ0xWVnpiMXpleGd0eWZvSVAwSUUxdlZvRGJaYWZySFNPcG5pNTNUUkVudHNrZ3QtZnR0RXU1MHU5M3lrejI5TE9XSEtzZlpPQlFyQmxiWDltME1hUEtpT0NiY0QzbFhQdlZXQTl3STZOVF91aVNkZy1RczY5WjVwcDhZ0gGoAUFVX3lxTFBCSHhVTzQyOHhQSFQtT3BaZDJHdEZvSjVxZUx6TDhFeDhKZ0J3NUxlOUdvQktBMk9HVko1Wm1lRkM1cTliSmlDWnJZUXVWMFJwQTRQWlJUcGpscXFsOTVXOFRPb3NnZ3VjMlJxOGZmSUZPWlNocmdaRThTcjVzRXBkWngzS1hNQVpzeUFTUk9KbWQyS3hpUXJPVV90TGVRZS1UaERLNDZ0WA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jan 2024 08:00:00 GMT",
        "title": "Here’s How Low Can ETH Go Following Recent 4% Decline: Ethereum Price Analysis - CryptoPotato",
        "content": "In the recent market developments, Ethereum showcased a remarkable upswing, surging to a yearly high of $2717.\n\nHowever, this ascent was met with considerable selling pressure, prompting a slight retracement and setting the stage for a potential short-term consolidation correction.\n\nTechnical Analysis\n\nBy Shayan\n\nEthereum Price Analysis: The Daily Chart\n\nA thorough examination of Ethereum’s daily chart uncovers a significant recent surge, with the price reaching a yearly peak of $2.7K. Simultaneously, ETH has emerged within an ascending expanding wedge pattern, identifiable by the orange lines. This pattern holds the potential for a bearish reversal, contingent upon the price breaking below the lower boundary.\n\nDespite this, after Ethereum’s notable upward movement, the price encountered a pivotal resistance zone, notably – the static $2.7K level aligning with the upper boundary of the ascending wedge pattern.\n\nThis led to a slight retracement. Considering recent market sentiment and price action, there is an anticipation of a continuation in the correction leg, possibly resulting in a pullback to the multi-month ascending wedge pattern (green lines), coinciding with the lower boundary of the recent short-term expanding wedge.\n\nThe 4-Hour Chart\n\nAnalyzing the 4-hour chart, the price faced considerable selling pressure following the impulsive surge, initiating a correction phase. Accordingly, Ethereum seems confined within a crucial range, bounded by substantial support at $2.4K and notable resistance at $2.7K, resulting in a mild downward consolidation.\n\nCurrently, the price has approached the lower boundary of this significant range. Notably, the lower boundary aligns with a significant support region, defined by the price range between the 0.5 ($2408) and the 0.618 ($2335) levels of the Fibonacci retracement. Hence, this offers robust support to the price.\n\nGiven the potential presence of buyers within this critical support zone, an expected scenario is for the price to find support, facilitating a renewed upward movement. However, in the event of a bearish breakout, sellers may target the multi-week ascending trendline as their next objective.\n\nOn-chain Analysis\n\nBy Shayan\n\nThe funding rates are critical in the analysis of Ethereum’s futures market sentiment, as illustrated in the accompanying chart. This metric serves as a pivotal gauge to discern whether buyers or sellers are executing their orders with heightened aggression.\n\nThe chart prominently reveals an upward trajectory in the funding rates metric, mirroring the robust surge in price. This alignment signals a pronounced bullish sentiment prevailing in the market. However, it’s crucial to note that elevated values in funding rates raise concerns about a potential overheated state in the perpetual markets, signaling the possibility of an impending long-squeeze event.\n\nIn the wake of a recent short-term correction, a noteworthy development is the substantial decline in funding rates. This decline signifies that the overall sentiment remains bullish, concurrently indicating a cooling-off in the perpetual markets from their previously overheated state. Consequently, there exists the potential for the price to resume its upward trajectory following the completion of the ongoing correction stage."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxOYlhhR1R6eFlydE9na2pTblJGUzVkWC1qOWlVQVQ1ekltSUlfZUU1Z0Y2ZGZxazJlVWFPOGdtelBCU3JrZkUtaGVjLXg4bTlQUldlUV9oQ0EwVEtDRW5xVGFib21PSWwtY3RHYXlJRWFIRWpkY193RG45WGFFODJHR2ZDVnltcUdR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jan 2024 08:00:00 GMT",
        "title": "Why Ethereum Slumped More Than 6% Today - The Motley Fool",
        "content": "Ethereum is seeing significant declines today as sentiment sours around the world's No. 2 cryptocurrency.\n\nMegacap cryptocurrency Ethereum (ETH -0.51%) has continued to sell off in today's session, now having given up most of its gains since the sector-driven mania following the approval of spot Bitcoin ETFs earlier this month.\n\nAs of 3 p.m. ET, Ethereum declined 6.1% over the past 24 hours, dropping below the $2,350 level. This move appears to be tied to a number of market-driven forces, but also some token-specific headwinds that investors are pricing in today.\n\nHere's what's behind today's big downside move in Ethereum.\n\nSignificant Ethereum selling pressure impacting this token\n\nWhen certain investors sell a given cryptocurrency or stock, investors pay attention. Accordingly, news that the Ethereum Foundation (the nonprofit doing much of the behind-the-scenes work to keep Ethereum up and running) sold more than $1.6 million worth of the world's second-largest cryptocurrency has sent shockwaves reverberating through the market.\n\nRecent reports show that this large sale, in which 700 Ether were sold, continues a trend of capital-raising from the Ethereum Foundation. A previous sale of 100 Ether tokens on Jan. 16 from the same wallet suggests that the ongoing development work may be more costly than initially thought, providing some downside selling pressure on this token.\n\nEthereum does have another upgrade on the go, with its so-called Dencun upgrade already underway as of last week. Thus, it's possible that these token sales could dry up as development activity slows, but it's a key factor in the supply/demand equation investors are digesting right now.\n\nAdditionally, concerns around capital flight from the crypto sector, evidenced by more than $2 billion of Bitcoin ETF outflows, has some concerned about the secondary impacts on Ethereum. So far, the excitement around these exchange-traded products hasn't stoked the kind of investment many initially thought would come. For future Ethereum ETFs, that's not great, and this sector-wide selling pressure will likely continue to flow through to the Ethereum ecosystem as well.\n\nWhat to make of today's move\n\nOccasionally, it's important to reflect on the cost impacts various development initiatives have on various blockchain networks and their associated tokens. Given Ethereum's aggressive upgrade schedule and top-tier talent in terms of the developers working diligently on ensuring this protocol's stability, these token sales may not be surprising. But it does appear some in the market have been caught off guard by the corresponding selling pressure and sentiment shift caused by these sales.\n\nThat said, it could also be true that these ongoing upgrades provide outsized value relative to their initial up-front costs. Crypto investors and users want to see an Ethereum network that's as low cost and efficient as possible. That's what this Dencun upgrade aims to achieve.\n\nAdditionally, some recent news around MetaMask launching an Ethereum validator staking feature could result in more locked-up Ethereum tokens, potentially offsetting some of the recent selling pressure we've seen from the Ethereum Foundation and others.\n\nThese effects likely won't offset the institutional capital flight we're seeing from the crypto sector. However, it's the longer-term supply-and-demand dynamics investors will need to consider when it comes to this top-tier crypto.\n\nThus, I think the jury remains out with respect to how Ethereum will perform as it continues its ongoing upgrades in the coming months. For now, sentiment has soured, but long-term investors may want to consider this dip as a potential buying opportunity, as traders look elsewhere to take on bullish positions."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMi0gFBVV95cUxPUzY2YlpPMU1uQTZpcHdRVHFDX3dWaUwzOEE4WFJrWEZaOUtjMy1LalJaYjFfdDYyTU9QdkhKaElRY1c2U3ZZRnRYUjlidGtkeDlrUGVfclZHVnhYUXY5TmN4bFAxQkhIRUJrX1Itbk9zdW1EbjN4SFN3bnRkb0JlQTFWM0xUY1lveXpYcFlLOUxRcU5rUnRkdkIwdGlLWkV0Rkwtc0lRU1QtRkoyNmkzYjk4czE1RGdCaGdXTG9vcFBqNXVtLWR5WXlFTTdGZm9SR3c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jan 2024 08:00:00 GMT",
        "title": "Most Ethereum Staking Pools Are Using Just One Execution Client, Potentially Increasing Risks to the Network - Unchained",
        "content": "The Ethereum community’s concerns about execution client diversity has intensified, as roughly 84% of all validators are running Go Ethereum.\n\nMost Ethereum staking pools use just one execution client: Go Ethereum (Geth). As a result, some Ethereum enthusiasts have publicly encouraged people to avoid using Geth for their validator duties because of the potential risks of over-relying on one client.\n\nMore than four-fifths of all validators, which are in charge of proposing and validating new blocks of transactions to the Ethereum blockchain, use execution client Geth, according to data provided by the crypto analytics website clientdiversity.org, which covers about 60% of the entire Ethereum network.\n\nEthereum clients are software implementations people can download to run the Ethereum network. In order to perform its duties, a single validator typically runs two clients simultaneously to address different components of Ethereum — the consensus side and the execution side.\n\nNethermind, the second-largest execution client for Ethereum running on about 8% of validators encountered a bug yesterday, Ethereum core developer Łukasz Rozmej said on X. The bug, which has since been resolved, has sparked a conversation about a hypothetical bug impacting Geth.\n\nWhile the consensus side has seen its client diversity improve, execution client diversity on Ethereum is weak. Specifically, the following Ethereum staking pools and service platforms — per execution-diversity.info — likely use Geth as their only execution client for their validator duties: Allnodes, Ankr, Blox Staking, Binance, Bitcoin Suisse, Bitfinex, Coinbase, Kraken, and Stakefish.\n\nIn addition, Lido, the largest liquid staking platform with more than nine million ETH staked, has connected over three-quarters of its validators to Geth as well.\n\nA ‘Supermajority Client’\n\nVitalik Buterin, Ethereum’s co-founder, designed Ethereum to work on different software clients, not just one, so that a bug affecting a single client would not adversely impact the whole blockchain.\n\nHowever, Geth is considered a “supermajority client.” As such, validators that run Geth have the capability to finalize the Ethereum blockchain without agreement from validators running other software clients, such as Nethermind, Besu, and Erigon. This has the potential for disastrous results such as a network split, loss of funds, and reputational damage to Ethereum.\n\n“Should Go-Ethereum, likely to be the majority execution client after the Merge, produce an invalid block, it could get finalized and thus cause the catastrophic failure described in scenario 3,” wrote Ethereum researcher Dankrad Feist in a 2022 blog post. Scenario three entails a hypothetical situation where a client with more than two-thirds of the stake has a bug in its software and includes an invalid block to the Ethereum blockchain.\n\nValidators running a minority client would only lose a small amount of rewards for having a bug, while the cost of having a bug for validators running a supermajority client would be massive.\n\n“Counterintuitively: staking with a minority client bears significantly less risk – those affected by the recent Nethermind bug hardly lost the rewards of one to two days. Being on the wrong side as part of a majority, however, can lead to significant loss of stake,” wrote co-founder of Gnosis Chain Martin Köppelmann on X on Monday.\n\nMeanwhile, Lefteris Karapetsas, the founder of portfolio tracker Rotkiapp, noted on X that “In case of a supermajority Ethereum client bug that leads to complete loss of the stake of those stakers at the moment this would burn > ~20% of the entire ETH supply.”\n\nLido did not immediately reply to Unchained’s request for comment.\n\n\n\nOn Monday night, Coinbase announced on X its goal of including an additional execution client in its validator infrastructure, after the Ethereum community expressed concerns about Coinbase’s single client staking steup revolving around Geth.\n\nThe largest publicly traded crypto exchange in the U.S. said it relied solely on Geth for validation because it was the only execution client that met the company’s technical requirements. But Coinbase said it is open to change.\n\n“Although we’ve evaluated execution clients since 2020, none have met Coinbase Cloud’s requirements to date,” wrote Coinbase on X. “Many other operators on the network have reached the same conclusion, which is part of the reason why 84% of Ethereum validators run Geth. However, the tide is turning.”\n\nCoinbase is currently assessing alternative execution clients, and said it would share their next steps by the end of February.\n\nUPDATE (January 23, 2:00 pm. ET): Updated with details of Coinbase’s announcement."
    }
]