[
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxOV0hKUTU3ZWdyN09mWkxYZXRKb05RdnY5NnJjX09mRjRSRzVZS2VSQ29vbXk5VkFsYVhnMjR4NGx1MTl1dk1lbl9KM3J5VGZiU1NQVjllV20zNUE3bXFzZ1NkYmtVY2VjT3FudnptSS1BdURybHNzVjdOQUZJSFVqb3JBOTdNNm5RaWo4NTRrQ0NjOVBWMFMyTi1zQ0g5VmJwSEJ0V2VQUDNUUWItX1plS0tCTXNhaXgxdTU4MmZzX1V2cjVYbVYweXRSUGZrbWZRMUhabDBybXk5dHVtSnBNWUJoenNGdFF4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Telegram-Associated Notcoin, Sam Altman-Founded Worldcoin Outshine Bitcoin, Ethereum On A Weak Day - Benzinga",
        "content": "Telegram-linked cryptocurrency Notcoin NOT/USD and Sam Altman-founded Wordlcoin WLD/USD raked in major gains on a day when market heavyweights slipped lower.\n\nWhat Happened: NOT accumulated double-digit gains to emerge as the best-performing cryptocurrency in the last 24 hours. The coin, which is backed by top executives from Telegram, has more than doubled in value over the week, according to CoinMarketCap.\n\nNOT logged a trading volume of $928 million in the last 24 hours, with its market cap surpassing $1 billion.\n\nThe rally outstripped the broader market's performance as Bitcoin BTC/USD, Ethereum ETH/USD, and Dogecoin DOGE/USD traded lower as of this writing.\n\nCryptocurrency Gains +/- Price (Recorded at 10:00 p.m. EDT) Notcoin NOT/USD +17.06% $0.01071 Worldcoin WLD/USD +4.75% $4.89\n\nAlongside, biometric-based cryptocurrency, Worldcoin, rose significantly in the last 24 hours, with trading volume more than doubling to $525 million.\n\nWhy It Matters: NOT's exponential growth comes as users hop on to mine the cryptocurrency through the play-to-earn Web3 game hosted on Telegram. The game's cryptocurrency offerings have grabbed the attention of Telegram's massive user base.\n\nMeanwhile, WLD's gains snapped a losing streak, as the project launched by OpenAI Chief Sam Altman, faces opposition over privacy concerns. Worldcoin was asked to shut down operations in Hong Kong recently.\n\nCapital flows to altcoins indicated a healthy market trend in a year where Bitcoin’s market dominance has increased.\n\nIn an X post Wednesday, popular cryptocurrency analyst Michaël van de Poppe noted that Bitcoin was in a consolidation phase, while altcoins are bracing for their breakout.\n\nWhere are we in the cycle?\n\n\n\nWe're at the stage where #Bitcoin consolidates and #Altcoins are waiting for their breakout to come.\n\n\n\nTo me, the trigger is going to be the listing of the Ethereum ETF.\n\n\n\nFrom there, it could be going quite fast in a positive sense. — Michaël van de Poppe (@CryptoMichNL) May 29, 2024\n\nPhoto by stockphoto-graf on Shutterstock\n\nRead Next: BlackRock’s Bitcoin ETF Dominates Market with Nearly $20B in Assets: Report"
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxNbEh6V0F1WUhjend5NzUwaTl4UGJiOTZSa2luSEZYZzBRdXQtTFNWbkVBY2EtRVY0ZUpyMi1JWVNwR1RnclFJN0RhY05LV1Y2dnR2WnlJNDh1NmU5ZC03OVZSV3FuZ19oaUtZeUxPM2hRSjJQLVFEQXhrNG5ESGZoNXhmbnZKZEZZR3FCMkc4eDlpbzZQREt1eHZfcnYtbzhKQzB6cmNSa3JQQnppMVA0cUsxRm1rT1g4dEVFZnZKYnJVUEtIWmpsT3lzcTlYaU1vdU02TXdGLTV1RWx6RVl0TkNwZHpWaW5Z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Cathie Wood Of Ark Invest Believes Ethereum ETF Approval Linked To US Politics, Sees Likelihood Of A Solana ETF As Well - Benzinga",
        "content": "ARK Invest CEO Cathie Wood has stated that cryptocurrency has become a significant political issue in U.S. elections, leading to the unexpected approval of key Ethereum ETH/USD ETF filings.\n\nWhat Happened: Wood made this remark at Consensus 2024, as reported by CoinDesk, attributing the sudden approval of Ether ETF filings to the growing importance of cryptocurrency in U.S. election debates.\n\nWood expressed surprise at the approval, stating, “The read was it was not going to be approved. It was absolutely not going to be approved.” She further explained that the sentiment around the Financial Innovation and Technology for the 21st Century Act (FIT21) evolved in the House, leading to its recent bipartisan approval.\n\nWood also pointed out former President Donald Trump’s increasing comfort with Bitcoin and other cryptocurrencies, including his recent decision to accept campaign donations in crypto, as a factor that has drawn attention to the sector.\n\nSee Also: Shiba Inu, Dogwifhat Post Double-Digit Gains As Memecoins Shrug Off Dips In Bitcoin, Ethereum: What’s Goi\n\nWhile Wood suggested that a Solana SOL/USD ETF could be approved, she deemed meme coin-focused funds unlikely, stating that large brokerage firms and investment advisory companies would not accept more than “the majors.”\n\nWhy It Matters: Wood’s comments come in the wake of her earlier predictions about the potential of cryptocurrencies, especially Bitcoin ETF/USD. In April 2024, she raised her Bitcoin prediction by $2.3 million, suggesting that a $1,000 investment could be worth a significant amount by 2030.\n\nDespite Ether’s recent spotlight due to the ETF approvals, Wood maintained her bullish sentiment on Bitcoin, stating, “Bitcoin, hands down. No question about it. It is a global monetary system. It is a technology, and it is a new asset class.”\n\nEarlier this week, she also highlighted how El Salvador’s push for Bitcoin and AI could potentially increase its GDP 10X in five years.\n\nARK 21Shares Bitcoin ETF ARKB attracted inflows of $4 million on May 29, and around $ 3 billion since the ETFs started trading in January, according to SoSo Value.\n\nRead Next: Bitcoin, Ethereum, Dogecoin Edge Lower As Inflation Fears Grip Investors: Less And Less Of King Crypto Available For Masses, An ‘Enormous’ Bull Market Inevitable, Says Analyst\n\nDisclaimer: This content was partially produced with the help of Benzinga Neuro and was reviewed and published by Benzinga editors."
    },
    {
        "id": 74,
        "url": "https://news.google.com/rss/articles/CBMi3AFBVV95cUxPWTNLTDVLbmF1eG1xb3dVSTZST3VIdUN5a2xZV29LM2c4THRfT3BLU3lzZ0lNb3RBc2luNmMwRllIVWUzVFdNcnVWZ2ZLejZmRW4yRlRLNVlWb3VlZjVoS0pVNUl3TmF6djZqUlpRWm5ab2N6U2kxOE9QN3Z5alJWM2d6RjNtZTllSnVnZk45ZU40aVZNeVF4aVlwX3d5S1J0QklrU0xSQy1rUm5CMDBoMklKU2NSY1pDSHk1LVo5bjB1NVJqSElUWHNuRUI2aWs5b0hHUnI5MUpyYXA20gHiAUFVX3lxTE5VNWtUUFB6UWZMQlFjLTN2czFDa2RZMm9vLTJvT2hMSjJuc0dOQnVFbVREcUZ1QUJyaFBwNDlaQk9kd2pWeHlJYkM5dGtsaUNrYXJBZmxqTXZVeUFwYng2WjRhZkIyU2lQcmp6NFVmNzl1RGhQclVyeFlpUTlVMnZkZVIyejRtM3JybkxSeERrRmdCVjd5Z29Odk9jWHVxTVdWVW45ejBqb0VySnZhRF9ZWDljWVBuVVRrV0dkOW1acmo5b0o2RlUyZ1RWX2RVSHcwWloxUzBYMUZObE1yVllGd0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Ethereum ETF approval boosts Bitcoin, says Michael Saylor; Raboo Presale soars - The Economic Times",
        "content": "The legitimisation of Bitcoin Exchange Traded Funds (ETFs) has had a positive effect on cryptocurrencies. So, it’s not surprising that an Ethereum ETF approval is towing the same line. It ushered in an influx of new investors, which boosted crypto token prices.Raboo ($RABT), a new kid on the block, is one of the biggest beneficiaries of this boost. Now, in presale, Raboo has raised an astonishing $1.5 million, which has been up 40% since its launch. Industry watchers expect $RABT to make a 100x gain before the end of the presale. That’s why investors are rushing it.Crypto enthusiasts always believed that ETFs would boost crypto adoption. They allow traditional investors to get exposure to the tokens without directly owning them.The SEC took almost a decade to okay the first Bitcoin ETF application. But once approved, it boosted crypto prices. Ethereum ETF applications didn’t take as long, and as expected, they’ve had a positive impact on the market.Crypto prices have soared significantly in response to this development. ETH itself appreciated by 12% and drew near $4,000, which is remarkable. The Ethereum ETF approval is expected to spur the market on, with ETH set to appreciate further.To Michael Saylor, Ethereum ETFs are good news for Bitcoin. According to him, they ‘serve as another line of defense for Bitcoin,’ and would make the blue-chip asset more stable price-wise.Michael Saylor also thinks the development would accelerate institutional adoption of Bitcoin. Going by history, this would further boost crypto prices. Bitcoin has been trading around $70,000 in the last seven days. . It’s a considerable increase when compared with its price action last year. The general feeling is that BTC will appreciate further and hit new all-time highs before the year runs out.Raboo is an enterprising new project primed to make substantial price gains, thanks to the Ethereum ETF approval. It infuses artificial intelligence with meme culture, birthing a dynamic space filled with engaged users. In essence, it provides a platform where crypto meme lovers connect, earn, and prosper.The ecosystem boasts NFTs, AI-generated memes, exclusive merchandise, and other mouth-watering rewards. Even more, the smart contract has been examined by leading crypto audit firm Solidproof. This guarantees security, eradicates worries, and puts investors' minds at ease.These unique offerings put Raboo ahead of the pack. Since it’s still in presale, there’s a decent chance it will appreciate significantly when it launches on exchanges. That’s why experts say it's poised to hit a 100x profit once the presale ends.As Michael Saylor fancies a BTC boom following recent Ethereum ETF approval, Raboo is primed for huge price gains. That’s because it offers several benefits for investors and has significant moon potential. It’s still in presale, and for $0.0042, you can partake in this movement and benefit from the impending 100x price gain.The above content is non-editorial, and TIL (Times Internet Limited) hereby disclaims any and all warranties, express or implied, relating to the same. TIL does not provide investment advisory services in any manner and the publication of this content does not mean TIL's or Economic Times endorsement. TIL strongly recommends the users to take all steps necessary to ascertain that any information and content provided is correct, updated and verified and/or speak with a qualified investment professional before making any investment decisions."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxPMG9YelFLRDM5S2djTXVBbGcyN1N4cDBXbmtEMG42MzU5eHVvanB6QlNqYU5rZmhoMzk5V1V6b2NmQjJIdnZuUEF0WTBETUl0b1h5aWFuY09nTlRmMzJPNG1xd3NYaUZzLTIyTm1fVkxpVWFuMFp2QkxWdnB2VVEwTmdaN0ZVODdTMTloVTY1TTMtQ241dW9RUlpZV1JzQUM1dGQyMnRWTmllYU5OMjQ1Vlp3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "Babylon Raises $70M To Bridge Bitcoin And Ethereum - Benzinga",
        "content": "Babylon, a crypto startup co-founded by Stanford University engineering Professor David Tse, has raised $70 million in its latest funding round.\n\nWhat Happened: The round was led by crypto venture capital firm Paradigm and included investments from Polychain and Bullish Capital, the company announced on Thursday, according to a Bloomberg report.\n\nThis follows an $18 million raise in December from investors such as Hack VC and Framework Ventures.\n\nAlthough Babylon did not disclose its current valuation or investment details, a representative confirmed that the funds will be used to expand staff and further research and development.\n\nThis latest investment highlights a renewed interest in Bitcoin-focused projects among venture capitalists.\n\nTraditionally, Ethereum ETH/USD and other blockchains have been favored for software development, particularly in decentralized finance (DeFi) applications.\n\nHowever, the success of Ordinals, a type of nonfungible token (NFT) on the Bitcoin blockchain, has sparked renewed interest in building within the Bitcoin ecosystem.\n\n\"So Bitcoin is kind of really undergoing a renaissance in the sense that now there's a new wave of projects building on Bitcoin,\" Tse said.\n\n\"Historically, Bitcoin was the first blockchain, but over the years the developer community has shifted away from Bitcoin BTC/USD to new chains…Recently, for multiple reasons, there has been a shift of attention back to Bitcoin.\"\n\nThe increased interest also follows the approval and launch of Bitcoin exchange-traded funds (ETFs) in the U.S. earlier this year, as well as the Bitcoin \"halving\" event in April, which reduced the mining rewards by half.\n\nThese developments have contributed to a growing focus on Bitcoin projects.\n\nAlso Read: Robinhood Unveils Crypto Trading API For Advanced US Users\n\nWhy It Matters: Babylon’s primary aim is to enable Bitcoin to be used as a staking asset to secure other blockchains.\n\nStaking, a mechanism used by proof-of-stake blockchains like Ethereum, involves locking up cryptocurrency deposits to validate transactions and secure the network, earning rewards in return.\n\nBitcoin, traditionally a proof-of-work blockchain, uses miners to solve complex puzzles for transaction validation.\n\nBabylon seeks to allow Bitcoin holders to participate in transaction validation on proof-of-stake networks, thereby earning yields on their idle Bitcoin.\n\n\"You can think of our project as analogous to Ethereum's staking, but for Bitcoin,\" Tse explained.\n\nFor Babylon and its investors, making Bitcoin a staking asset presents a significant opportunity, as many Bitcoin holders have long sought ways to generate yield from their assets.\n\nEthereum’s recent transition to a proof-of-stake model, known as the Merge, has increased the appeal of staking as a revenue-generating activity in the digital asset sector.\n\n\"In our mind, in the crypto Web3, a very important value is security,\" said Tse.\n\n\"So it is this security that drives this underlying decentralized world that we're building. And so what we're trying to advocate is that Bitcoin being such a large asset can sort of underwrite the security layer for essentially the entire Web3 ecosystem.\"\n\nStaking remains one of the most lucrative areas in decentralized finance.\n\nAccording to data tracker DefiLlama, Lido Finance and EigenLayer, two of the top three DeFi projects by total value, fall under the staking category.\n\nUsers have collectively sent over $50 billion in cryptocurrencies to these platforms to generate returns.\n\nWhat’s Next: These developments and their implications for the digital asset market will be key topics at Benzinga’s Future of Digital Assets event on Nov. 19.\n\nRead Next: BlackRock Moves Closer To Launching First Spot Ethereum ETF"
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMiggJBVV95cUxQMmM1UVpBMlZaNFR2aFFBTjBfQ1dNV2pfRUU3THhMcC1VREJrYUw4ek1naFQ5MzhLUFpJSTYxWUNBRmcyYTNZUFBiTHJOYXdoa3FEYTJFS29TOU5yVkpVN2xjZjR5SVdHT21WUng0cUVNWEJWTTFlcFpZZ2ltOWkwS2M4UnpDQUlEckZabXVndFhwb3pjSVVRdVBEak1YUUh2dUlJYWpMWXhUNjJmcHVEOTBaWDJjUGpkVjVZNmUzZVVDbTFxSDlHZ2l5OFUweUdOWDFadWtkZFdpLTI3WUQyWU83dDAzRHIxTVJWU3RzWDBRdGttaTgyeUlKYXhVQ3d6N0HSAYcCQVVfeXFMT0FZNkFWLVFUdVRMTzZsV0ZvczY0SUM5Q0lZcmxMbEJmejVsSENRTmxlRVdpUV9XT0g1Ykl2VUxNTUtnNGVlaDZJb2tremJTX0NtREYzd2E1Wmp5SkpSNUJmSEpRdjREVTB6OGtJaGllNHI2Y0o3RmVPbVJXdjZDM1FIRjlXclJwWU1lMHg1bVVzN3JzOWJvdHJ4U2VVYnJWQ2Nvb1RlTVF5ZHZhWHhoUmxXemlqT1JlZ0VseFlJRVlFNHFRZm0wb1VvZjMwQ3hvblFLeHlfSFN5NHVPNHF5VEZuby1zcGtnR2pRTEEya2p0VEs2VXZac0psNy1ZdzAtUXNlVTIyaGs?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 May 2024 07:00:00 GMT",
        "title": "BlackRock’s Ethereum spot ETFs listed on DTCC: Five cryptos to diversify with and capitalise on this trend - The Economic Times",
        "content": "KangaMoon (KANG) raises over $7.2 Million and reaches 32,000 Users\n\nNear Protocol crypto on the rise as network surpasses $200M in issued USDC\n\nEthereum Classic Price at an uptrend following latest updates\n\n\n\nEthena (ETA) rises 27% – How far can it climb in 2024?\n\n\n\nBlackRock’s spot Ethereum ETF has been listed on top of the Depository Trust and Clearing Corporation (DTCC) with the ticker symbol ETHA.This listing follows the SEC’s approval of a total of eight spot Ethereum Exchange Traded Funds (ETFs). Following this major move for ETFs in the Web3 space, traders have begun to diversify their holdings in order to get the most out of the market. Out of the thousands of available altcoins, five have stood out the most as cryptos that can surge in value immensely, and these include KangaMoon (KANG), NEAR Protocol (NEAR), Ethereum Classic (ETC), Chainlink (LINK) and Ethena (ETA). Let’s take a look at these cryptocurrencies:KangaMoon ( KANG ) will revolutionise the meme coin landscape through the construction of a sustainable ecosystem that fosters significant token utility, one that transcends hype-driven trends. This is achieved through a strategic fusion of Social-Fi elements and Play-to-Earn (P2E) mechanics, which cultivates long-term value beyond just hype.In addition, the token’s blockchain ICO has garnered significant traction, as the project now boasts a user base surpassing 32,000, while the token has experienced a growth of 400%. The presale itself also secured over $7.2 million in funding, which further solidifies investor confidence, as it is projected to break past $8 million by the end of the month. Moreover, KANG’s initial price point was at $0.005 but now trades at $0.025 during the bonus presale stage.Not only does this reflect significant growth but the round also represents a limited-time opportunity to get KANG at a discount before it explodes in value. In addition, KangaMoon has already established its presence on prominent platforms such as CoinMarketCap and CoinGecko, facilitating investor analysis, and will soon get listed on BitMart, a major CEX. As a result, analysts are now projecting a 100x price increase following its launch.NEAR Protocol (NEAR) surpassed $200 million in natively issued USDC , which is a major milestone that can send the ecosystem demand and utility further. This will also have the effect of increasing demand for the NEAR Protocol crypto, which can result in a price uptrend.The on-chart metrics for the crypto are now bullish, as the NEAR Protocol price has found support at $7.70 after briefly passing the $8 price barrier. Now, the RSI and MACD data showcase a positive price momentum, and according to the NEAR Protocol price prediction, it can end Q4 of 2024 at $11.46.Ethereum Classic (ETC) is also experiencing an upswing in trader interest following its most recent integrations. For example, now anyone can mint the Ethereum Classic crypto through the usage of the F2Pool The on-chart metrics for the Ethereum Classic price are bullish, as the weekly price increase was by 20%, further solidifying it as a major contender. Based on the Ethereum Classic price prediction, by Q4 of 2024, the crypto can end the year at $45.71. Chainlink (LINK) expands services in nine different blockchainsChainlink (LINK) is consistently expanding the offering of its ecosystem, as within the past week, it saw 12 integrations of six chainlink services, all across nine different blockchains, including Arbitrum, Base, Ethereum, Linea, Metis, Optimism, Polygon, Scroll and zkSync.The Chainlink crypto has also increased in value as its weekly chart suggests a 10% uptrend, and could soon result in further gains. Based on the Chainlink price chart, it recently surpassed the $17 price barrier, indicating that $20 marks a major resistance point that it now needs to pass in order to reach new heights. According to the Chainlink price prediction however, the crypto can end Q4 of 2024 at $25.08.Ethena (ETA) is also at an uptrend as it experienced a 27% price increase during the past week fueled by ecosystem expansion. The team recently announced that USDe is the first integration, with the new UX layer of DeFi , Infinex. As a result, anyone can now deposit USDe and earn from Ethena while also earning Infinex governance Points (GP). The Ethena crypto could see a major uptrend as a result, further appealing to traders.According to the Ethena price chart, it broke above the $0.90 price barrier, and is closer than before to passing even above $1. According to the Ethena price prediction, it can end Q4 of 2024 at $1.33.With Ethereum ETFs being approved, the race is now on for more cryptocurrencies to get the same treatment. Out of the many cryptocurrencies available, the key ones that stood out the most include NEAR Protocol, Ethereum Classic, Chainlink and Ethena.However, the biggest growth was seen with KangaMoon as it's up 400% on the charts, and it has raised over $7.1 million so far. With a unique blend of Play-to-Earn (P2E) features, Social-Fi elements, and a community-driven approach, it is poised to dominate the charts in 2024 . Discover the Exciting Opportunities of the KangaMoon (KANG) Presale Today! Join the Telegram Community:The above content is non-editorial, and TIL (Times Internet Limited) hereby disclaims any and all warranties, express or implied, relating to the same. TIL does not provide investment advisory services in any manner and the publication of this content does not mean TIL's or Economic Times endorsement. TIL strongly recommends the users to take all steps necessary to ascertain that any information and content provided is correct, updated and verified and/or speak with a qualified investment professional before making any investment decisions."
    }
]