[
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxOZDgwSGpaRHd0MGNnV2ZRS2tFdVhaa0RRdGZBVUVMcWFWYTFGVzlVWndsSmNZNnBfbjBURWZpRlExOGRuUDFZUWZxbW00SzZtZTFSYzFYQ3UyYVB0eExlbUtEU0wxQXhYV1NRSmtKZzVOMk5DWkNPSDg4TVU3OHg2UUgwX2dQT3E5VWhYdkg0N21nejd3U2NDem5yTzJkVDZVSkE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 01 Feb 2024 08:00:00 GMT",
        "title": "Pro-Ethereum Crowd Slams Solana-based Jupiter Airdrop as ‘Absolute Trash’ - Unchained",
        "content": "Ethereum enthusiasts and Solana devotees have been trading insults over one of the key mechanisms used in the airdrop for Solana-based decentralized exchange aggregator Jupiter.\n\nJupiter’s LFG Launchpad is a portal where traders can claim their airdrop distribution and use services to facilitate the trading of newly issued tokens. In the instance of the JUP airdrop, Jupiter traders can claim their airdrop allocation of JUP in addition to acquiring more tokens at launch by presetting limit orders or dollar cost-averaging functions.\n\nWhen traders acquire more tokens through Jupiter’s LFG Launchpad, they are engaging with a single-sided liquidity pool that initially only had JUP. When the airdrop went live, traders were able to withdraw JUP from the pool and deposit USDC.\n\nRead More: Jupiter Traders Claim Whopping 545 Million JUP Tokens in First 8 Hours of Airdrop\n\nOf JUP’s 10 billion total token supply, the Jupiter team allocated 250 million JUP for the single-sided liquidity launch pool and 100 million JUP for the launchpad fees, according to a forum post written by Meow two days ago that detailed JUP’s token genesis event.\n\nThis means traders, who purchase tokens through Jupiter’s launchpad infrastructure, are acquiring JUP directly from the 250 million pot that the Jupiter team earmarked for the liquidity pool on its airdrop launch page. On Thursday, Meow said on X that Jupiter’s core members will in a week take the USDC and JUP inside the liquidity pool and place the funds into the team treasury.\n\nMoreover, 75% of the 100 million JUP allocated as LFG launchpad fees is dedicated to the coming JUP DAO and the remaining 25% is for the Jupiter core team.\n\nWhile people from the Solana ecosystem have praised Jupiter and its founder Meow for how Jupiter’s core members designed and conducted its airdrop, members of the Solana-rival pro-Ethereum camp had harsh words for the decentralized exchange aggregator.\n\nEthereum Crowd’s Takeaway\n\nCritics cite Jupiter and its founder Meow on two elements of Jupiter’s airdrop infrastructure: the team having 250 million JUP tokens to sell and the Jupiter ecosystem keeping 100 million JUP tokens fee for launching on their own launchpad.\n\nEthereum enthusiasts have raised concerns about the Jupiter team selling tokens to the public through the token launch pool, immediately following its airdrop going live. A strategic advisor for liquid staking provider Lido and Ethereum research firm Flashbots, who goes by “Hasu,” said on X that Jupiter selling the 250 million JUP tokens for stablecoin USDC is a “Truly remarkable grift” and “One for the textbooks.”\n\nIn reference to the launchpad fee of 100 million JUP tokens that will end up in the pockets of the JUP DAO and the core team, Paul Dylan-Ennis, a lecturer in the College of Business, University College Dublin who writes about Ethereum culture, said on X, “This is Solana’s ICO era of absolute trash.”\n\nSolana Crowd’s Pushback\n\nThose defending Jupiter argue that the information about the 250 million JUP tokens for the launchpad liquidity pool and the 100 million JUP tokens for the launchpad fee has been publicly accessible for months.\n\nMike Dudas, general partner at 6th Man Ventures, expressed sarcastic outrage about Jupiter’s transparency. “I, for one, am extremely outraged that @weremeow and @JupiterExchange launched their token in the exact manner they said they would after sharing the methodology in excruciating detail across numerous communication methods for multiple months,” he shared on X.\n\nRead More: Jupiter’s Airdropped Token JUP Debuts at a $878 Million Market Cap\n\nSolana enthusiasts also took the opportunity to use ad hominems to call out Ethereum loyalists. One X user in a tweet about Jupiter’s controversy said, “0xdumbass.eths are crying – thats just what they do — ignore them.” Another said, “ETH Maxis can cry all they want and make unfounded statements… having haters comes with the territory.”\n\nMeow defended Jupiter’s decision to allocate 250 million JUP tokens inside the launchpad liquidity pool. “By doing it this way, airdrop recipients get a massive pool to constantly sell into, while prospective buyers have assurance that there is a big pool to absorb big selling pressure from airdrops that will cause them immediate massive rekt,” wrote Meow on X.\n\nRivalry Going Back Years\n\nThe back-and-forth between supporters of Solana and Ethereum is the latest development in the rivalry between the two blockchain networks. For years, people have referred to Solana as the “Ethereum killer,” but Ethereum has been the incumbent leader for blockchain networks with smart contract functionality. While Solana has historically trailed Ethereum — falling further behind during the collapse of the crypto exchange FTX — in the past few months, Solana has made a comeback. It’s been successfully challenging Ethereum’s dominance in terms of several metrics such as a thriving memecoin ecosystem and trading volume on decentralized exchanges."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE5FdjloR3FlR1B4cnFsYjVqdm5rM2U0TTZ4SGZJa0YwYlBuRkJBOHIzeTBPQzBpWWpmVUM4X3A1cWxRaDBPX3FBY0VZeks3Y3c1eVNUbDNwWjUtTnZBdkR4MTdobEd4UXI0SmZ4MjNjcVRYRThnaWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 01 Feb 2024 08:00:00 GMT",
        "title": "Ethereum devs consider ‘existential’ upgrade to the EVM - Blockworks",
        "content": "If there is one Ethereum upgrade that has been ever a bridesmaid, it’s the EVM Object Format (EOF).\n\nEngaged once, with plans to be married in Shanghai, it was cast aside soon after by developers swooning for a blobular future in Proto-Danksharding.\n\nIf you have no idea what that sentence means, don’t fret. It’s a metaphor for hours of discussion over years of Ethereum all-core developer calls.\n\nFollowing Thursday’s ACD call, we still don’t know whether EOF will finally get a chance to be a bride. But at least there’s a clear proposal on the table.\n\nRead more: Dencun and Pralectra: Ethereum core devs chart an ambitious 2024\n\nDevelopers had been strongly considering EOF for the Shapella hard fork. A year ago however, after a fair bit of introspection, it was pulled in favor of keeping the focus solely on staking withdrawals.\n\nOnce Shapella had safely shipped, the candidates for inclusion in Dencun had yet again EOF among them. And again it was shelved, much to the chagrin of the feature’s two main champions, Danno Ferrin and Greg Colvin.\n\nThe consensus in April 2023 was that EOF was too big to share the stage with EIP-4844 — Proto-Danksharding — and therefore one had to go. The latter, with its potential to dramatically improve the user experience of layer-2 rollups, won out.\n\nAs a consolation, Ansgar Dietrichs at the Ethereum Foundation suggested having EOF as a focus of the next upgrade, Prague. “It’s too big to be the second place in a fork,” he said. So, it should have its own.\n\nRead more: Ethereum’s next upgrade to focus on blobs\n\nDencun, with 4844 as its “driver,” remains on track for mainnet in March as developers reported an “uneventful” hard fork of the Sepolia testnet on Tuesday.\n\n“We saw finality as well as blobs showing up exactly when we wanted them to,” said the Ethereum Foundation’s Parithosh Jayanthi.\n\nJust one testnet, Holesky, is left before mainnet, and Dencun should be given its final test on Feb. 7.\n\nPushing EOF over the finish line\n\nMost of Thursday’s call was aimed at understanding the current status of the next big feature fork. Named “Prague,” this consensus layer upgrade is titled after the location of Devcon 4. Meanwhile, “Electra” — a designation inspired by a blue-white giant star within the Taurus constellation — is the term used by execution clients to refer to the same upgrade.\n\nThe priorities for “Pectra” are slowly taking shape. Very slowly.\n\nFerrin once again made the pitch for EOF, calling it “existential to the EVM in the next couple of years.”\n\nAs a leader of the EOF implementers working group, Ferrin said developers “have been moving into ‘ship it’ mode.”\n\nEOF aims to make Ethereum smart contracts more secure, efficient and developer-friendly. It’s of particular significance to Ethereum dapp developers, who don’t typically join the biweekly all-core dev calls.\n\nThat’s left some client teams with the impression that EOF isn’t important in the past, a stigma that has been hard to shake.\n\nOn the Jan. 4 call, Dragan Rakita from the Reth client team expressed strong support for EOF, and Nethermind developer Lukasz Rozmej noted EOF is a lot easier to test than Verkle trees — the main competing focus for the next fork.\n\nRead more: Big Geth users are diversifying their clients following Nethermind bug\n\nEven Marius van der Wijden from Go Ethereum (Geth), previously an EOF-skeptic, sounded relatively on-board with the idea.\n\n“I’ve been warming up to EOF, [it’s] just not a [priority] for me,” van der Wijden said.\n\nSupport built further on the Jan. 18 call. Paradigm’s Chief Technology Officer Georgios Konstantonopolous said it was “doable by one person in a couple months.”\n\nFerrin reiterated that sentiment on the most recent call, arguing that work on EOF and Verkle is done by different engineers within client teams, and therefore committing to it wouldn’t prevent work on Verkle from progressing.\n\nBut Guillaume Ballet, a Geth developer at the Ethereum Foundation, was not yet convinced, worrying EOF could adversely affect Verkle.\n\n“If it does go first, I need to make sure we don’t ship something and paint ourselves in the corner realizing we broke something,” Ballet said.\n\nAndrew Ashikhmin, software engineer on the Erigon client team, proposed to commit to EOF with the caveat that it be tried on a Verkle testnet and that there be time carved out for collaboration between Verkle and EOF implementers in the coming weeks.\n\nIt’s a bit of a chicken-and-egg problem, as Ferrin observed.\n\n“Before we can put it in testnet in Verkle, we need it working in clients,” he said, adding that his Besu client team could have EOF up and running soon for testing purposes.\n\nBut he’s convinced it should be compatible with Verkle.\n\n“I don’t want ‘shoulds,’ I want to see it working,” Ballet retorted.\n\nEOF is left still trying to catch the bouquet, awaiting a suitor to walk it down the aisle.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTE5FdjloR3FlR1B4cnFsYjVqdm5rM2U0TTZ4SGZJa0YwYlBuRkJBOHIzeTBPQzBpWWpmVUM4X3A1cWxRaDBPX3FBY0VZeks3Y3c1eVNUbDNwWjUtTnZBdkR4MTdobEd4UXI0SmZ4MjNjcVRYRThnaWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 01 Feb 2024 08:00:00 GMT",
        "title": "Ethereum devs consider ‘existential’ upgrade to the EVM - Blockworks",
        "content": "If there is one Ethereum upgrade that has been ever a bridesmaid, it’s the EVM Object Format (EOF).\n\nEngaged once, with plans to be married in Shanghai, it was cast aside soon after by developers swooning for a blobular future in Proto-Danksharding.\n\nIf you have no idea what that sentence means, don’t fret. It’s a metaphor for hours of discussion over years of Ethereum all-core developer calls.\n\nFollowing Thursday’s ACD call, we still don’t know whether EOF will finally get a chance to be a bride. But at least there’s a clear proposal on the table.\n\nRead more: Dencun and Pralectra: Ethereum core devs chart an ambitious 2024\n\nDevelopers had been strongly considering EOF for the Shapella hard fork. A year ago however, after a fair bit of introspection, it was pulled in favor of keeping the focus solely on staking withdrawals.\n\nOnce Shapella had safely shipped, the candidates for inclusion in Dencun had yet again EOF among them. And again it was shelved, much to the chagrin of the feature’s two main champions, Danno Ferrin and Greg Colvin.\n\nThe consensus in April 2023 was that EOF was too big to share the stage with EIP-4844 — Proto-Danksharding — and therefore one had to go. The latter, with its potential to dramatically improve the user experience of layer-2 rollups, won out.\n\nAs a consolation, Ansgar Dietrichs at the Ethereum Foundation suggested having EOF as a focus of the next upgrade, Prague. “It’s too big to be the second place in a fork,” he said. So, it should have its own.\n\nRead more: Ethereum’s next upgrade to focus on blobs\n\nDencun, with 4844 as its “driver,” remains on track for mainnet in March as developers reported an “uneventful” hard fork of the Sepolia testnet on Tuesday.\n\n“We saw finality as well as blobs showing up exactly when we wanted them to,” said the Ethereum Foundation’s Parithosh Jayanthi.\n\nJust one testnet, Holesky, is left before mainnet, and Dencun should be given its final test on Feb. 7.\n\nPushing EOF over the finish line\n\nMost of Thursday’s call was aimed at understanding the current status of the next big feature fork. Named “Prague,” this consensus layer upgrade is titled after the location of Devcon 4. Meanwhile, “Electra” — a designation inspired by a blue-white giant star within the Taurus constellation — is the term used by execution clients to refer to the same upgrade.\n\nThe priorities for “Pectra” are slowly taking shape. Very slowly.\n\nFerrin once again made the pitch for EOF, calling it “existential to the EVM in the next couple of years.”\n\nAs a leader of the EOF implementers working group, Ferrin said developers “have been moving into ‘ship it’ mode.”\n\nEOF aims to make Ethereum smart contracts more secure, efficient and developer-friendly. It’s of particular significance to Ethereum dapp developers, who don’t typically join the biweekly all-core dev calls.\n\nThat’s left some client teams with the impression that EOF isn’t important in the past, a stigma that has been hard to shake.\n\nOn the Jan. 4 call, Dragan Rakita from the Reth client team expressed strong support for EOF, and Nethermind developer Lukasz Rozmej noted EOF is a lot easier to test than Verkle trees — the main competing focus for the next fork.\n\nRead more: Big Geth users are diversifying their clients following Nethermind bug\n\nEven Marius van der Wijden from Go Ethereum (Geth), previously an EOF-skeptic, sounded relatively on-board with the idea.\n\n“I’ve been warming up to EOF, [it’s] just not a [priority] for me,” van der Wijden said.\n\nSupport built further on the Jan. 18 call. Paradigm’s Chief Technology Officer Georgios Konstantonopolous said it was “doable by one person in a couple months.”\n\nFerrin reiterated that sentiment on the most recent call, arguing that work on EOF and Verkle is done by different engineers within client teams, and therefore committing to it wouldn’t prevent work on Verkle from progressing.\n\nBut Guillaume Ballet, a Geth developer at the Ethereum Foundation, was not yet convinced, worrying EOF could adversely affect Verkle.\n\n“If it does go first, I need to make sure we don’t ship something and paint ourselves in the corner realizing we broke something,” Ballet said.\n\nAndrew Ashikhmin, software engineer on the Erigon client team, proposed to commit to EOF with the caveat that it be tried on a Verkle testnet and that there be time carved out for collaboration between Verkle and EOF implementers in the coming weeks.\n\nIt’s a bit of a chicken-and-egg problem, as Ferrin observed.\n\n“Before we can put it in testnet in Verkle, we need it working in clients,” he said, adding that his Besu client team could have EOF up and running soon for testing purposes.\n\nBut he’s convinced it should be compatible with Verkle.\n\n“I don’t want ‘shoulds,’ I want to see it working,” Ballet retorted.\n\nEOF is left still trying to catch the bouquet, awaiting a suitor to walk it down the aisle.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMi_gFBVV95cUxPT2VtWUV4b3JuVHRNRmtqX0NFR1JFNWZ1SGVOeFpFbk1Vc3dZU2xFdU9LWHhIdjdQLU80LUVOTWNfQm90bER6OUxCdWZvaVFObkdoeFVPS2xJMHdTSG4xdDVJX1VkaWtzb2I1SXZPVXAxTU5WMERvNDBCMlVyRmJpNy1lUVZrUmRteUNFSGIzMFpOOHhLZVctcXJPbFNWN2xwQUlaU05pMnBHdFNQRzY2eVJCWV9MVWFKemRFREFhd1p5b2lTVm1FeG9Tbm9tcnhlUXdNTGhkVTdWZ0Q3OUdHdUlpc25rRklINE14RzJBWHBYbmMzMHNFeUdsOGl5Z9IBgwJBVV95cUxPMlo0dV90d2g2ODRBVGZ0aXIteXVQaThMcExmLW44MGwzdGdSdUJXdFdnTlFwUVNReG0zREtLa2taZ0ZUaWxLSlcyRUxrZm43MmtYbmRTX3pCTXpTUnJ0UTBMMFluRWh6OXgzY2pGNHdUYXJjQWNWeHA5MHU3NEFOSFFmcnZWbzlBVGwtOU5DbzNKcGQ1aDJOMTJ3Umc3d202WmRlMWo2WjgtRlAyMk5qeEZPejQ3by1IdGJLOGFDX3NrQ2lJaHJVSnBaZDVKMHByaFQ0aWZmN2YxOGJDaFhrOFZwMldCa2xNcWxscHNMb2QzejZzdnJ5X2ZyVXZZOVRqanVJ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 01 Feb 2024 08:00:00 GMT",
        "title": "Cryptocurrency Price Today: Bitcoin Briefly Rises Above $43,000, Jupiter Dips Over 60% - ABP Live",
        "content": "Bitcoin (BTC), the oldest and most valued cryptocurrency in the world, briefly managed to rise above the $43,000 mark before dipping below once again early Thursday. The US Fed’s call to maintain interest rates appears to have lent a sense of stability in prices. Other top coins, including the likes of — Ethereum (ETH), Dogecoin (DOGE), Solana (SOL), Ripple (XRP), and Litecoin (LTC) — saw minor losses across the board. The SATS (1000SATS) token emerged to be the biggest gainer of the lot, with a 24-hour jump of over 5 percent. Jupiter (JUP), on the other hand, became the biggest loser, with a 24-hour dip of over 60 percent.\n\nThe global crypto market cap stood at $1.51 trillion at the time of writing, registering a 24-hour dip of 8.43 percent.\n\nBitcoin (BTC) Price Today\n\nBitcoin price stood at $42,051.28, registering a 24-hour dip of 2.05 percent, as per CoinMarketCap. According to Indian exchange WazirX, BTC price stood at Rs 37.14 lakh.\n\nEthereum (ETH) Price Today\n\nETH price stood at $2,255.67, marking a 24-hour dip of 3.65 percent at the time of writing. As per WazirX, Ethereum price in India stood at Rs 2.01 lakh.\n\nDogecoin (DOGE) Price Today\n\nDOGE registered a 24-hour dip of 1.82 percent, as per CoinMarketCap data, currently priced at $0.07864. As per WazirX, Dogecoin price in India stood at Rs 6.94.\n\nLitecoin (LTC) Price Today\n\nLitecoin saw a 24-hour dip of 2.01 percent. At the time of writing, it was trading at $66.47. LTC price in India stood at Rs 5,828.\n\nRipple (XRP) Price Today\n\nXRP price stood at $0.4974, seeing a 24-hour loss of 2.59 percent. As per WazirX, Ripple price stood at Rs 44.10.\n\nSolana (SOL) Price Today\n\nSolana price stood at $93.90, marking a 24-hour dip of 7.24 percent. As per WazirX, SOL price in India stood at Rs 8,800.09.\n\nTop Crypto Gainers Today (February 1)\n\nAs per CoinMarketCap data, here are the top five crypto gainers over the past 24 hours:\n\nSATS (1000SATS)\n\nPrice: $0.0005251\n\n24-hour gain: 5.56 percent\n\nMonero (XMR)\n\nPrice: $167.14\n\n24-hour gain: 4.44 percent\n\nORDI (ORDI)\n\nPrice: $61.65\n\n24-hour gain: 1.89 percent\n\nChiliz (CHZ)\n\nPrice: $0.1017\n\n24-hour gain: 1.52 percent\n\nRonin (RON)\n\nPrice: $2.76\n\n24-hour gain: 1.45 percent\n\nTop Crypto Losers Today (February 1)\n\nAs per CoinMarketCap data, here are the top five crypto losers over the past 24 hours:\n\nJupiter (JUP)\n\nPrice: $0.6343\n\n24-hour loss: 60.33 percent\n\nSei (SEI)\n\nPrice: $0.6222\n\n24-hour loss: 12.87 percent\n\nManta Network (MANTA)\n\nPrice: $2.95\n\n24-hour loss: 12.26 percent\n\nCelestia (TIA)\n\nPrice: $15.88\n\n24-hour loss: 8.83 percent\n\nOKB (OKB)\n\nPrice: $47.48\n\n24-hour loss: 8.77 percent\n\nWhat Crypto Exchanges Are Saying About Current Market Scenario\n\nMudrex co-founder and CEO Edul Patel told ABP Live, “Bitcoin experienced a decline below the $43,000 threshold following the US Federal Reserve's decision to maintain interest rates, fueled by investor expectations of a possible rate cut in March. Despite a brief surge, Bitcoin couldn't sustain the momentum. Despite attempts by bears to push the price down, bulls defended the territory above $42,000. Ethereum is trading in line with Bitcoin, and there's a likelihood it will oscillate between $2,100 and $2,400 in the near future.”\n\nCoinSwitch Markets Desk noted, “Bitcoin is headed for a third consecutive red day, trading near the $42k mark even as the Federal Reserve of the US kept the interest rates unchanged — exactly as per the expectation of the market. However, after Fed Chair Jerome Powell’s comments yesterday, several big analysts like Goldman Sachs are now predicting that the Fed will start cutting rates from May this year instead of March, which could be a big reason why bears have taken some control in shorter time frames. In larger time frames, however, the BTC structure remains bullish and the current trend line supports remain at $39.3k.”\n\nRajagopal Menon, Vice President, WazirX, said, “The Federal Reserve's decision to maintain interest rates thwarted expectations of cuts, impacting Bitcoin's valuation, now potentially encountering resistance at $40,000. The next hurdle for Bitcoin lies at $40,000 before a potential easing of selling pressure. A surge in demand, driven by reduced supply through BTC ETF access, could be the forthcoming catalyst. Currently, Bitcoin has registered a 2.25% decline in the last 24 hours, settling at $41,998.72, with a 4.79% gain over the past week. Ethereum trades at $2,257.09, reflecting a 3.59% drop in 24 hours but a 1.06% increase over the week. Bitcoin's technical indicators present a mixed outlook. Moving averages signal a \"Buy,\" while the Ichimoku Base Line remains neutral. RSI at 49 suggests a neutral stance, with Stochastic %K at 75 and ADX at 16 reflecting neutrality. MACD at -173 indicates a \"Buy,\" while Stochastic RSI and William's Percentage suggest a neutral outlook.”\n\nSathvik Vishwanath, CEO and co-founder of Unocoin, said, “Bitcoin's recent drop below $43,000 followed a hawkish stance by Federal Reserve Chairman Jerome Powell, suggesting a March rate cut is unlikely. This stance prompted a market reevaluation, reducing the likelihood of an imminent rate cut. However, the broader economic environment favours Bitcoin in 2024 with expectations of a possible Fed rate cut, which traditionally boosts cryptocurrencies. Amid short-term fluctuations, investor confidence persists, supported by several optimistic factors. The emergence of spot bitcoin ETFs, along with massive demand for new offerings from BlackRock and Fidelity, is easing selling pressures. Additionally, expectations surrounding the April halving of Bitcoin and potential supportive US political and fiscal dynamics add to the bullish outlook. Despite the near-term uncertainty, Bitcoin's price trajectory is set for a potential rally to the low $50,000s, outweighing the prospect of a dip to the low $30,000s in the foreseeable future.”\n\nShivam Thakral, CEO, BuyUcoin, noted, \"The Crypto market witnessed a fresh decline due to the unchanged interest rates by the Fed. The bullish momentum marked by decrease in grayscale sales and increase in BTC ETF offerings eventually led to a downward trend caused by the unchanged interest levels which represent the 2023 high levels. The Altcoin market also took a downturn which could change unlesss Ethereum breaches $2500 amid other positive macroeconomic factors.\"\n\nCoinDCX Research Team told ABP Live, “Over the past 24 hours, the crypto market experienced a shift from positive to slightly bearish conditions, triggered by the Federal Reserve's decision to maintain unchanged interest rates. BTC, positioned within its range, is currently situated in the middle, with the rising dominance of BTC causing declines in most of the altcoins. ETH reflects a parallel situation, trading within its established range. Additionally, the market sentiment is influenced by the regular movement of funds through ETFs, contributing to the overall market dynamics.”\n\nSubscribe And Follow ABP Live On Telegram: t.me/officialabplive\n\nDisclaimer: Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Cryptocurrency is not a legal tender and is subject to market risks. Readers are advised to seek expert advice and read offer document(s) along with related important literature on the subject carefully before making any kind of investment whatsoever. Cryptocurrency market predictions are speculative and any investment made shall be at the sole cost and risk of the readers."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiUkFVX3lxTE9pazBPS0Uyem9rVzBLS2g2c2V6SkVtNlluV0xnWFMzU0pCcVR1TV83RDVmMG5yVEM4RlpKeHFWNFJ4MG12YnZhaUdvQTlaOUwyeWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 01 Feb 2024 08:00:00 GMT",
        "title": "How to bridge to Tron - OKX",
        "content": "Blockchains are usually self-contained systems and lack the ability to communicate with other chains, creating difficulties for users when transferring money. The purpose of building what the crypto space call ‘bridges’ is to address this issue. Through blockchain bridging , individuals can efficiently transfer their funds between different chains. Cryptocurrency bridges promote blockchain interoperability and enhance the ease of digital asset transfer.\n\nIn this article, we’ll walk you through how to bridge to the Tron ecosystem’s own blockchain. But first, what is Tron?\n\nLaunched in 2017 by Justin Sun, Tron quickly grew in popularity due to its speed and efficiency. Initially, it was built on Ethereum to focus on entertainment and content sharing. It shifted to its own blockchain system in 2018 and achieved complete decentralization in 2021. Over the years, Tron has developed a vibrant community and decentralized application (DApp) ecosystem featuring popular NFTs and games.\n\nPreparing for bridging: wallet and asset selection\n\nChoosing the right wallet\n\nTo begin using a bridge to Tron, the first step is selecting the appropriate wallet.\n\nOKX provides a highly secure and multi-chain OKX Web3 Wallet with all OKX accounts. Tron isn't an Ethereum-compatible chain and Ethereum wallets such as Metamask don't support it. However, the OKX Web3 Wallet has ‌support for major blockchains, including Tron. Also, the OKX Web3 Wallet features bank-grade security and inbuilt access to hundreds of DApps and the OKX NFT Marketplace .\n\nSelecting assets for bridging\n\nThe first step before you bridge a cryptocurrency from one chain to another is to make sure the asset is supported. For this guide, we’ll be transferring USDT from Ethereum to Tron. USDT is a supported currency on both chains.\n\nTo do the bridging, you need USDT as the asset you’re sending and ETH to cover gas on Ethereum. However, make sure you have some TRON in your Tron wallet for gas fees to use your USDT after bridging.\n\nExploring bridge services\n\nDecentralized bridge services\n\nWe recommend OKX Swap as a safe option to bridge ETH to Tron. OKX Swap combines prices from numerous decentralized exchanges to provide the most efficient path, reducing slippage and network fees. Additionally, OKX Swap allows for effortless cryptocurrency conversions and safe transactions. Other Tron bridges you can check out are Meson and Allbridge .\n\nCentralized bridge services\n\nOne simple method of connecting to Tron is through the use of centralized exchanges. By using this method, you can transfer your cryptocurrency to OKX using one network and then transfer it out using a different one. Here’s a simple guide on bridging USDT from Ethereum to Tron using OKX Exchange.\n\nStep 1: Create an account on OKX .\n\nStep 2: Once logged in, head to “Assets” on the top-right and select “Deposit.” If you don't have USDT, you can purchase some on OKX and bypass the deposit process.\n\nStep 3: Select “USDT” as the crypto and “ETH-ERC20” as the deposit network.\n\nStep 4: Transfer USDT to the provided address from your Ethereum Wallet. It may take a few minutes for the USDT to be deposited and become available in your account.\n\nStep 5: Once your funds are ready to be used, go back to “Assets” and select “Withdraw.”\n\nStep 6: Select “USDT” as Crypto and the withdrawal method as “On-chain.”\n\nStep 7: Type in your Tron address and select the network as “USDT-TRC20.” Enter the amount of USDT you want to bridge to Tron and hit next. Upon account verification, the USDT will be deposited into your Tron wallet in a matter of minutes.\n\nOne of the simplest ways to bridge your assets is by using an exchange, since you won't have to worry about slippage or network fees.\n\nChoosing a bridge service\n\nCentralized and decentralized cryptocurrency bridges have their own benefits. Deciding which one to use is a personal choice. Decentralized bridges allow for faster movement between chains, but may have high fees and security concerns. It's important to choose a reputable bridge with a strong security history.\n\nBridging process: a step-by-step guide\n\nTo transfer USDT to Tron, you'll need to link your wallet and move the assets. Our recommended method involves using the OKX Web3 Wallet and OKX Swap. However, the steps should be similar if you prefer to use a different wallet or bridge platform.\n\nConnecting to a bridge service\n\nStep 1: Head over to OKX Swap .\n\nStep 2: Select “Connect wallet” in the top right corner, and select “OKX wallet extension.” If you use another wallet provider like Metamask or Phantom, select “Other” and choose your wallet.\n\nStep 3: Enter your OKX wallet password and select \"Confirm\" to allow your OKX wallet to connect with OKX Swap.\n\nTransferring assets to Tron\n\nNow that you’re connected to OKX Swap, you can bridge USDT to Tron.\n\nStep 1: Adjust the bridge settings and specify the quantity of USDT you wish to transfer in the \"Swap and Bridge\" section.\n\nChoose \"Ethereum\" as the first network and enter the desired quantity of USDT to transfer. Choose \"Tron\" from the \"To\" network. If you can't find the network right away, select \"View all networks\" under \"Select Network\" and look for \"Tron.\" Next, choose \"USDT\" as the token. OKX Swap will then display the USDT you'll receive on Tron.\n\nStep 2 (optional): This step isn't mandatory. It should only be completed if you have a strong understanding of slippage and bridges.\n\nNetwork fee: This calculates the cost of the network to enable the bridging. Slippage: Slippage refers to the level of flexibility you're comfortable with when faced with price fluctuations. By setting the slippage to 0%, OKX swap guarantees you'll receive exactly 98.2 USDT, as shown. However, the transaction will be voided if the price changes, and you'll incur a network fee. Allowing for some slippage is important in situations where liquidity is limited. Trading route: The OKX Swap acts as a DeFi aggregator, selecting the most optimal bridge to connect to Tron at any given moment, rather than functioning as a bridge itself. You have the option to manually change the service if needed.\n\nStep 3: Select “Swap across chains.” When your wallet pops up, confirm the transaction.\n\nOKX Swap is a user-friendly DeFi solution for transferring and exchanging cryptocurrencies with‌ bridges.\n\nAlongside supporting swaps between different networks, OKX Swap and other bridges can also be used in the opposite direction, acting as bridges between Tron and Ethereum. To launch a Tron to Ethereum bridge, Tron must be selected as the primary network and Ethereum as the secondary network.\n\nOKX Swap also offers the capability to convert USDT to TRX during the bridging process. By selecting \"TRX\" as the second currency instead of \"USDT,\" OKX Swap will seamlessly convert the USDT from Ethereum to TRX and complete the bridge to Tron.\n\nUnderstanding fees and timelines\n\nFee structures explained\n\nThere are multiple fees involved in a decentralized bridging process:\n\nEthereum gas fees : To use OKX Swap and transfer your USDT, you're required to pay a transaction fee to the Ethereum network. Bridge fees: The role of OKX Swap is to serve as both a bridge and a swap aggregator. To start the bridging process, a small fee is charged by the bridge. Tron transaction fees: Just like the gas fee on Ethereum, the Tron transaction fee is deducted to enable the transfer of USDT from the bridge to your wallet. Conversion fees: If you’re converting from one cryptocurrency to another during the bridge process, such as USDT to TRX, there’s a conversion fee for that.\n\nBefore making a transfer, you can view a breakdown of the conversion and bridge fees on OKX Swap. However, the Ethereum gas fee will only be displayed on the OKX Web3 Wallet pop-up when you confirm the transaction.\n\nExpected transaction times\n\nJust like the fees, the transaction time also depends on multiple factors:\n\nEthereum confirmation time: The amount of time it takes for USDT to transfer from your wallet to the bridge. Bridge processing time: The duration for transferring your asset from one chain to The information for each bridge may differ. To access this information for OKX Swap, go to the advanced options and choose the trading route. Tron blockchain confirmation time: The USDT will be transferred to your wallet after the The bridging procedure is quick thanks to Tron's fast processing speed, so you can expect to receive it in your wallet within a few seconds.\n\nSecurity measures and best practices\n\nMaking secure transactions\n\nWhen using a cryptocurrency bridge, it's important to remember that you are interacting with a smart contract that has access to your wallet. Be aware that malicious smart contracts can be used to steal funds from your wallet. To ensure a secure transfer of digital assets on bridges, we suggest following these steps:\n\nBe sure to choose a reliable bridge for Tron, like OKX Swap, which has a good history. Refraining from using your main wallet for transactions with bridges and other DApps is recommended. Maintaining a separate cold wallet for securely storing your assets is advisable. Use tools like Revoke to remove access to your wallet once you’re done bridging.\n\nAnother possibility for minimizing potential hazards is using a centralized exchange as a bridge. OKX implements cutting-edge security measures to ensure the secure and seamless exchange of USDT for global users. Visit our security of funds and Proof of Reserves page for more details.\n\nAvoiding common pitfalls\n\nHere are some of the common pitfalls you can avoid while you’re bridging your assets to Tron blockchain:\n\nMake sure to thoroughly check all the information you enter before finalizing it. Once the transaction is confirmed, it can't be undone. Pay close attention to gas fees . During high network congestion and demand periods, gas fees on Ethereum may increase, making transactions more costly. You may want to wait for gas fees to decrease or choose to use a centralized exchange for transferring funds. High slippage and liquidity issues are another aspect to look out for. Opting for a less commonly used bridge or connecting to a coin with low trading activity could lead to significant slippage. To avoid this, it's advisable to only bridge to assets with a high level of liquidity.\n\nTroubleshooting and support\n\nCommon bridging issues and solutions\n\nIt's common for users to come across stuck transactions, but this can be resolved by making sure that the gas fee on Ethereum is appropriate. If enough gas has been allocated, the transaction will be completed successfully. However, inadequate gas will result in a failed transaction and a refund of funds to your wallet. During times of high traffic, transactions may get trapped on the bridge. Nevertheless, cryptocurrency bridges are equipped to handle these situations and will eventually be resolved. Cross-chain compatibility: Prior to initiating the bridge, ensure that the asset being transferred has adequate liquidity and is compatible with the designated chain.\n\nWhere to seek help\n\nThe crypto community is renowned for its helpfulness. In case of any difficulties, there should be accessible resources to help you."
    }
]