[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxQSkN1cTQ3WVppdWNUZXpRUERrenU1MzAxUXVzbFdwZ3drNlZyS2JtbUhZeUliMHZrM1V2Ump0ME0zLTJCdjE2aG5PNGRLWXB4a05aMDZEOXZNXzFlVG1abWE0ajZXVVh4clNoZ1lRZTJid3piaXZfRzFxNEo0eGFZUXdzNUxETmlwUHphZl84TzhjeXhuQ1J0VWZ0aDBEWGw4SWFCcy1CckpjaHpGaDFvOEJZbXBmZ9IBuwFBVV95cUxNWW8telo2dnpIVU9FQjUxaTZid19OYTcweUpmQWFLR2Q4bnFORTFBQXN0UUlVeDMtRUVwUmNKN05wZTNCby1Oby1KWlpUY09rLWItMXpHeXdwSjEtZVhjLXdPbzFXMnhNc1J1V201OHB4UjBvbExjVXRQak1BZFFfNjh2Vl82RTE4YXplZWNmTXNkREpua2lQSFBQcDI1MF9vcVpjNjBobmZCOHB3UkNtM0VwZ0ltMXVOMlJV?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jan 2024 08:00:00 GMT",
        "title": "No More Than 50% Chance of Spot Ether ETF Approval By May, JPMorgan Says - CoinDesk",
        "content": "No More Than 50% Chance of Spot Ether ETF Approval By May, JPMorgan Says\n\nLawsuits against crypto exchanges offering staking services for proof-of-stake blockchains, including Ethereum, make approval of a spot ether ETF more challenging until these cases are resolved, the investment bank said.\n\nBy Will Canny Jan 19, 2024 at 10:37 a.m. UTC\n\nElection 2024 coverage presented by Stand with crypto"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxQNzhCa0M0c3haT3VCeXB0eHUyUHlhbjAzWjRtS21sbTFPbTB3bHRNbXU4VmJDazNMZkJuR3FhVDctWXlxU2xrbk1ob1NIN0NDdmF0cDlRdVZKVF90QVZYaUtXOEI5elJ3QTFDVTQwdHc5XzNjUDZ3aXBjblhwMHNDZE9KZHVsSGVwa1N1MTFGcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jan 2024 08:00:00 GMT",
        "title": "Ethereum outpaces Bitcoin post-ETF launch as ETH/BTC ratio skyrockets - CryptoSlate",
        "content": "What is CryptoSlate Alpha? A web3 membership designed to empower you with cutting-edge insights and knowledge, powered by Access Protocol. Learn more ›\n\nConnected to Alpha Welcome! 👋 You are connected to CryptoSlate Alpha. To manage your wallet connection, click the button below.\n\nImportant: You must lock a minimum of 20,000 ACS If you don't have enough, buy ACS on the following exchanges: Coinbase Kucoin Orca\n\nConnect via Access Protocol Access Protocol is a web3 monetization paywall. When users stake ACS, they can access paywalled content. Sign up for Access ›\n\nDisclaimer: By choosing to lock your ACS tokens with CryptoSlate, you accept and recognize that you will be bound by the terms and conditions of your third-party digital wallet provider, as well as any applicable terms and conditions of the Access Foundation. CryptoSlate shall have no responsibility or liability with regard to the provision, access, use, locking, security, integrity, value, or legal status of your ACS Tokens or your digital wallet, including any losses associated with your ACS tokens. It is solely your responsibility to assume the risks associated with locking your ACS tokens with CryptoSlate. For more information, visit our terms page."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxNTkZFTk1IUjI2X01WRmZBWnF2YkxaZnA0UW5OcVZOYlJwd0hrck9Ca1JvRDBVQmQwV2kzeGZPa1VWbFNmT3otNXJaS0JVTHFnbDV2SktSSUF3elgtdW5zR3ltLWZtQkZFeUxqd05MQkFnU0MzN1Z1eGRRcTllcmRGa2J3ZXBMXy1fZkJsZElDemN4X1dmamFEQy1ZUnTSAaIBQVVfeXFMTTloM21hcXVoT2dsaUo4YmV1LTA2YngtbmducDRnZk1Uc0Yxd2tTSGxOQVh4MjNpQUl4YnlmOERJSUhkeHFHVlp4NXZnSzZqOWhMc21sMXR3dmNoRjlHb0Rha2dySVhueEhiVkRNOWlaMGloUjhzR3pZSnBibWJXYm1kMl90a21KVFRMNE9pV2ZzMjhPak5veU5WNVl1ejFIRk1n?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jan 2024 08:00:00 GMT",
        "title": "Bull Market Over for ETH Following Drop to $2.4K? (Ethereum Price Analysis) - CryptoPotato",
        "content": "Ethereum’s price has been on the rise over the last few months, breaking through resistance levels one by one. Yet, the cryptocurrency might have reached a potential turning point.\n\nTechnical Analysis\n\nBy TradingRage\n\nEthereum Price Analysis: The Daily Chart\n\nOn the daily chart, the market has been acting very bullish since breaking the 200-day moving average to the upside. It has been making consistently higher highs and lows, with the Relative Strength Index showing values above 50% the whole time.\n\nYet, the $2,700 resistance level decisively rejected the price to the downside last week. The market is currently consolidating below the mentioned level. Meanwhile, considering the availability of several support levels, investors can still be optimistic about the short-term trend.\n\nThe 4-Hour Chart\n\nThe 4-hour chat paints a more clear picture of the recent price action. The cryptocurrency has been forming a falling wedge pattern since failing to break above the $2,700 resistance area.\n\nA bullish breakout from the wedge can result in a retest of the $2,700 level, while a breakdown would be catastrophic, as the price could drop toward the $2,100 level in no time.\n\nSentiment Analysis\n\nBy TradingRage\n\nEthereum Funding Rates\n\nWhile Ethereum’s price has been gaining momentum on the upside, market participants have become more optimistic that ETH will eventually make a new all-time high this year. Yet, too much optimism might be a worrying factor.\n\nThis chart presents the funding rates, one of the key metrics for futures market sentiment evaluation. Positive values indicate that buyers are more aggressive on aggregate, while negative values demonstrate that short sellers are executing their orders more aggressively.\n\nAnalyzing the chart, it is evident that the funding rates have been very positive for a while, showing values comparable to what was previously seen during the $69K all-time high range. As a result, the probability of a long liquidation cascade is very high at the moment. These potential liquidations could lead to a significant drop in the coming weeks."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiywFBVV95cUxQakd5a1F3Rnd6Sngxc1lmeGgyMHhydm1JTzlOMjA0TWVJUnVvUmE0dWpvdnBrSzh6V0VoajVNRXdkaXJMVVJER0ZjWkxkdko1ejhENTVrTUpyTWdMZ3hhSldjTHlZdU5CbHdpVVQ5T3A1T3llMUVJZ1cycGdHeWQ4OXFOTzJqdnplcjBBd1RXNUNOczdma0J4dzYxVWVtOGlIdGZRTEV0UTA4T081U2x2ZWFIemZ0YUt4andZdW1GVUxfOE53QW4zOEo5ONIB0AFBVV95cUxQbUhkTlBqNFVuZG9HOFV6VXNweGMzbU1sbk5SNVhiXzhwZVprUmRmeDY2c0tlaDVmSmNsNWt4RVZrU0Z0YTlvVnJxM0NobjQwUjllQ0JxX2hUSFNMakNEazlfTGRYRGFxanZUWnNrOTJnUmhnMWJoUE82ak1lQmszdmJUcHR2WUZYRWFvWUo1QkxiMFJhaUNJTHpxM0hFdWkzY25MMnhjWEJVVklBVjI4TEFIWFU0cGpaMUllWEhBbGJELTFXaW53Mml2WVk5bjJJ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin, Ethereum and XRP Sitting at ‘High-Risk’ Profit Levels, Warns Crypto Analytics Firm Santiment - The Daily Hodl",
        "content": "Crypto analytics firm Santiment says that three of the largest crypto networks by market cap now have more than 80% of their existing supplies in profit.\n\nThe Total Supply in Profit metric measures what percentage of coins are currently in profit compared to the last time they moved, and sometimes correlates with price trends.\n\nAccording to Santiment, Bitcoin (BTC), Ethereum (ETH) and XRP have 83%, 84% and 81% of their supplies in profit, surpassing their average that range between 55% and 75% and placing these coins in high-risk profit territory.\n\nSantiment says the assets last hit this level in March 2022.\n\n“Bitcoin (83%), Ethereum (84%), and XRP Ledger (81%) have their respective supplies in historically high risk profit levels compared to their averages that hover in the 55%-75% range dating back to 2018.”\n\nSantiment says cryptocurrency prices can still go up because of positive developments in the industry, including the approval of a spot Bitcoin exchange-traded fund (ETF) in the US, but the firm says a lower percentage of the supplies in profit would be a bullish indicator for the crypto assets.\n\n“Crypto can absolutely still climb due to more exposure from ETFs and other positive news. But ideally, a great signal to watch that would imply continued long-term growth would be a breach below 75% of their supplies in profit once again.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxPd2M0MlY2Y3hBUjJLNnJuS1BIMjloVktUdW1mdjB4UVlmbEFLaS1xcERjRG1vTGtmU3ZxSjVPT2tzYk1lczZYc0R6QnNDNjAxOEg1ajlzSjdENmhkckJ1Z0xmLWExT2VjZHhKOUg2UnpnN1NLblZXYUFESWlDbm5QRU1WaExkbUpSc2Z5QW1aWkV2RGpfR0tCM3dRTURaR1U?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jan 2024 08:00:00 GMT",
        "title": "DeFi investors sent $370m from Ethereum to other chains. Here’s where most of it went - DLNews",
        "content": "What you'll learn Most of the $370 million liquidity outflow from Ethereum via Wormhole in the last month has gone to Sui and Solana.\n\nOutflows are possibly driven by memecoin and airdrop speculation.\n\nSui’s TVL has spiked 10-fold since October.\n\nSui and Solana have sucked a lot of liquidity from Ethereum over the past month.\n\nThat’s according to data from crypto bridge protocol Wormhole that shows $370 million in liquidity has moved from Ethereum to other blockchains, with almost 90% going to Sui and Solana.\n\nWormhole’s operations head Dan Reecer told DL News that part of the appeal can be explained by Sui’s incentive programme within its ecosystem that is “driving a lot of DeFi activity.”\n\nAs for Solana’s popularity, he said it may be “related to people looking to earn points on different apps after seeing the recent community rewards from apps like Jito.”\n\nSui and Solana dominate Ethereum bridge withdrawals via Wormhole (Wormholescan)\n\nLiquidity rotation\n\nCrypto liquidity rotators are known for keeping in touch with the latest “meta,” or trend, to position themselves for possible rewards. They do so by quickly shifting liquidity to avenues likely to offer rewards for user deposits.\n\nOne of the recent metas is “points” — a system for acknowledging user participation in DeFi protocols that may qualify them for future airdrops.\n\nNFT marketplace giant Blur popularised the points airdrop system and used it to great effect in capturing significant market share from OpenSea, the previous dominant player.\n\nNow, the trend has spread across platforms, protocols, and blockchains, becoming even more commonplace on Solana.\n\nJoin the community to get our latest stories and updates\n\nSeveral Solana DeFi protocols including Kamino, MarginFi, Parcl, and Solend, have announced points systems of their own.\n\nSui TVL has surged 10-fold in the last three months\n\nSui announced a $50 million incentive programme in October. Such programmes are used to attract interest from developers and investors by funding grants for the former and user rewards for the latter.\n\nSince the programme’s announcement, Sui’s total value locked, a measure of investor deposits, has risen 10-fold to $320 million, DefiLlama data shows.\n\nSolend, Solana’s biggest DeFi lending app with $160 million in deposits, may further boost Sui’s total value following its expansion to Sui.\n\nDespite the significant transfer of liquidity from Ethereum to both Solana and Sui, their combined TVL of $1.65 billion still falls far short of Ethereum’s $32.6 billion.\n\nOsato Avan-Nomayo is our Nigeria-based DeFi correspondent. He covers DeFi and tech. To share tips or information about stories, please contact him at osato@dlnews.com."
    }
]