[
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMi0wFBVV95cUxOajFFeWNmNEo4XzhjbTJSeUtIRXBPNmFTZTZXeFQxZkkzRVBxTE1aM0dpZGg0b2FfWmV0ZHV4S0ZhamxrZlIyaG9qYUVUcHRwaUFXUkFXSkxjTDgtUm1HUFNWdGxJSVY3STQtMFBPenRrLTdzTlUzNGc0M20yWXI4VG5LenN4c3R3ZncwZklFTVd1NFZ0Rll6UE9kZlExdlJwTkhBNlFlSjM4MHdPVnd2ZjhpZzRRUGZJeHRQUUVZRXpaSGQxNzNCMjBKV1dxZXVDeHI40gHYAUFVX3lxTE9WZDZBRDdVdjFkTUpZTGJhbl9KdDJaQWdxZXZjUnJMdGJGMUZYdGEtLVZFd0VzTnhrX3lFb2YxM1hJY0c5NWpmbGxHa1FzQnNOWmUtSzF3dnNSdDNsbmM1dTdMcFU5b0dqYmJJdnY0WWhndU9nTnByZUN6bU5PeXlENDZ6aDBLZ1BGdzY4a1ZjSV83NUsyRHd4VzVjTFhHU0ZpV0pNdjktczJrejQyeEJ5d2FzZ01scU9NMjF5UDdkdnVraXYzaG9MMDVha0UtX3BpX243TDRXSA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 May 2024 07:00:00 GMT",
        "title": "Analyst Says Markets ‘100% Underestimating’ Odds of Ethereum ETF Approval, Warns Top for Memecoins in Sight - The Daily Hodl",
        "content": "A closely followed crypto analyst thinks that market participants are too pessimistic about the odds that regulators will green-light a spot Ethereum (ETH) exchange-traded fund (ETF).\n\nPseudonymous analyst Altcoin Psycho tells his 501,800 followers on the social media platform X that people are not bullish enough on ETH right now.\n\n“Markets 100% underestimating odds of an ETH ETF.\n\nIt’s also underestimating the price impact it’ll have.\n\nBuying ETH under $3,000 pre-ETF will eventually be an obvious hindsight trade. Just like how it’s now obvious you should have bought Bitcoin pre-ETF.”\n\nData from the Ethereum-based prediction market platform Polymarket shows that only 13% of traders believe that an ETH ETF will be approved by the end of the month.\n\nLooking at the broader digital asset market, Altcoin Psycho thinks that market participants will eventually rotate their capital to blue-chip crypto projects at the expense of memecoins.\n\n“At some point all this scattered attention will narrow via a flight to quality, which also means a memecoin sell-off. I don’t think the cycle top is in but I think the memecoin top is not far away. Memecoins are a gateway drug not the end game, study past cycles if you disagree.”\n\nAs for the emerging artificial intelligence (AI) sector, the analyst says that while many are calling for the AI bubble to burst, he thinks it’s still in its earlier stages and set to become one of the biggest speculative manias ever seen.\n\n“Most say the AI bubble will soon burst, I’ll be the contrarian and say the bubble’s just starting.\n\nIt’s my highest conviction take since saying SOL at $15 was a must-buy…\n\n99% of AI startups will fail. When this happens, naysayers will prematurely claim victory. But once the dust settles, the surviving 1% will be so valuable that they’ll alone carry the bubble beyond any other bubble we’ve seen.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxOSVZkNmVCUFpIbXJmbHZGVnBZeTRMNnZNbnNwWmZsUm8wUE9HcDRxUklwdDlUR2NrOXN4YTQ4eUVlamc1S3BVOXdtS1d5anFIUWZrN3h3ZmtYM2hqX2dWdlBXMkdTZHV6UkhuQVBCS2phV0NhUlpNa2xJUHlndTZsd2tVU01DSUVGMl8wRkdR0gGTAUFVX3lxTE8zSHlBX2o3Vk1DNHFXMVJtMG85dWkzdmp5MWg3ZkhHNlhlVXlHa1prc1dBUnNCOXc0TzZCM2xBX1NfOG0yRVZCNVJfQmxYSXdoUmh5WnBrNDQwTnNXOVZiazBOZzYzeFZqVC1Mc3F3VFVIcWlfb0E2MmtXcXYzWnlkTlk3ZVpuU1NreHBDNWU4bEVxYw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 May 2024 07:00:00 GMT",
        "title": "Ethereum sets sights on $4K: Will THIS spark a new rally for ETH? - AMBCrypto News",
        "content": "ETH was up by more than 6% over the last seven days.\n\nA few of the metrics suggested that the bullish momentum might not last.\n\nEthereum [ETH] caught investors off guard as its price gained bullish momentum on the 17th of May.\n\nWhile the token’s price moved up, it broke above a bullish pattern that could allow the king of altcoins to touch $4k in the coming days or weeks.\n\nEthereum eyes $4k again\n\nCoinMarketCap’s data revealed that ETH investors enjoyed profits last week, as the token’s price had surged by more than 6%.\n\nThings heated up in the last few hours as ETH’s value increased by over 2.6% over the last day. At the time of writing, ETH was trading at $3,108.31 with a market capitalization of over $373 billion.\n\nThe bullish price action had a positive impact on the token’s social metrics, as its Social Volume remained high last week.\n\nIts Weighted Sentiment also entered the positive zone, meaning the bullish sentiment around ETH became dominant in the market.\n\nThanks to the price uptick, ETH broke above a bullish pattern that hinted at a price rise towards $4k.\n\nWorld Of Charts, a popular crypto analyst, recently posted a tweet highlighting that ETH broke out of a falling wedge pattern.\n\nThe pattern appeared on ETH’s chart during the beginning of March, and since then, ETH has consolidated inside it.\n\nThe tweet mentioned that the breakout could result in a 50% price rise, in turn allowing Ethereum to reclaim $4k once again.\n\nWhat to expect in the short term?\n\nAMBCrypto then analyzed ETH’s metrics to see whether they support the possibility of it touching $4k anytime soon.\n\nOur analysis of CryptoQuant’s data revealed that ETH’s net deposit on exchanges was low compared to the last seven days’ average, signifying less selling pressure.\n\nAnother positive metric was the Coinbase premium, as it indicated that buying sentiment was dominant among U.S. investors. However, not everything looked bullish for the king of altcoins.\n\nAMBCrypto’s look at Glassnode’s data revealed that ETH’s Network To Value (NVT) ratio registered a sharp uptick. A rise in the metric suggests that an asset is overvalued, hinting at a price decline.\n\nEthereum’s Money Flow Index (MFI) also indicated a possible price correction as the indicator registered a decline. Nonetheless, the MACD displayed a bullish crossover.\n\nThe Chaikin Money Flow (CMF) also supported the bulls as it went northward.\n\nRead Ethereum (ETH) Price Prediction 2024-25\n\nTo see what targets it might reach if its bull rally sustains, AMBCrypto analyzed Hyblock Capital’s data. We found that ETH’s liquidation would rise near the $3.2k zone.\n\nA successful breakout above that would allow it to reach $3.5k in the coming days before it targets $4k. However, if ETH’s price turns bearish, then its value might plummet to $2.85k."
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMi2wFBVV95cUxNVVpJLTdXb1pQUl9iSk1KUXR1cENNZmpRLThmUXAtMTFtZ1R3M25rMTJubkt3NVQyRXNCXzFrblFRMXNGYjFrNEs3bnd6eHMxcFlSQ1lKT0VHNUJFZS1vZ2J1S1cxc2JWY2ZmbnlrRW5nX0t2bGc1dEVyVGMyX0Z5UmhOUDhsTndvSUJvdUhoSmhHRmZKdU56NC1WSFVkRE91akw3ZHVLR19BYWtTNTBwQ2toM1h3T2JWVTNyMVh4VlVtVTF1YWU5dU5XOHl0RnJtSHRVZmlMNHNGbzg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 May 2024 07:00:00 GMT",
        "title": "BlockDAG's Enhanced Dashboard and Strategic Roadmap Drive $28.3M in Presale, Outshining Ethereum and Polkadot - Techpoint Africa",
        "content": "As Ethereum and Polkadot face market struggles, BlockDAG is currently a standout in cryptocurrency, thanks to its cutting-edge dashboard features and articulated roadmap. This approach has successfully captivated investors, culminating in a substantial $28.3 million in presale.\n\nThe platform’s innovative dashboard, which includes features like current rankings and a leaderboard, provides critical insights and encourages competitive interaction among users. In contrast, Ethereum faces uncertain price predictions, and Polkadot continues to develop its smart contract capabilities. These elements position BlockDAG as a premier Layer 1 cryptocurrency with significant return potential.\n\nEthereum Faces Price Instability Amid Market Trends\n\nEthereum (ETH) is trading at $2,904, marking a slight decline over the past day. Ethereum remains trapped within a bearish pattern despite some bullish attempts, potentially indicating further drops. From a recent high of $4,000 in March, Ethereum has fallen by 31%, with the price stabilizing around $2,870—a critical support level now contested by bulls and bears.\n\nThe outlook for Ethereum remains uncertain as both the 50-day exponential moving average and the Relative Strength Index (RSI) appear to lean toward a bearish sentiment. A break below $2,870 could depress prices to $2,800 or even $2,200, making it crucial for investors to watch these levels closely.\n\nPolkadot Advances with New Smart Contracts\n\nPolkadot is enhancing its blockchain framework by integrating smart contracts through the ink! language, which facilitates the creation of robust, DOT-compatible applications. This move is set to tackle one of Polkadot’s significant limitations and drive its platform forward. With the Pop Network’s solution already operational on the Paseo testnet, Polkadot is preparing for its next development phase, including features to improve network efficiency and scalability.\n\nBlockDAG’s Dashboard and Roadmap Accelerate Market Impact\n\nBlockDAG's updated dashboard provides many features that enhance user interaction and offer valuable insights. Users can view their current ranking and the necessary purchases to advance, fostering a competitive spirit through a leaderboard that showcases top investors. Additional tools like transaction previews, referral tracking, and detailed personal profiles simplify investment tracking and enhance user engagement.\n\nMoreover, BlockDAG's ambitious roadmap is meticulously laid out in four distinct phases: initial development, expansion through strategic partnerships, the launch sequence, and finally, the closing of the presale leading to the mainnet launch. A key highlight of this roadmap is the X1 Miner app, designed to be user-friendly with functionalities such as a wallet, send/receive options, and a performance leaderboard. The app is geared towards easing the mining process and enhancing community involvement with dedicated sections for user interaction and streamlined onboarding.\n\nThese enhancements to the dashboard and roadmap have greatly appealed to investors, propelling the presale quickly through its phases. In Batch 13, priced at $0.008, the presale has successfully raised $28.3 million, demonstrating strong investor trust and the potential for significant returns.\n\nBlockDAG Sets a High Standard in the Crypto Market\n\nWhile Ethereum struggles with price volatility and Polkadot develops its smart contract infrastructure, BlockDAG is making significant strides with its innovative dashboard and comprehensive roadmap. These developments not only boost user engagement but also enhance BlockDAG's investment appeal, positioning it above established players like Ethereum and Polkadot. With a robust $28.3 million presale and over 9.2 billion BDAG coins sold, BlockDAG offers a promising investment opportunity in the blockchain space, poised for substantial future growth.\n\nJoin BlockDAG Now!\n\nWebsite: https://blockdag.network\n\nPresale: https://purchase.blockdag.network\n\nTelegram: https://t.me/blockDAGnetworkOfficial\n\nDiscord: https://discord.gg/Q7BxghMVyu"
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNOXh6TXFHRDU1TlFrZWw5eDNRSkxCQlFkYy1HU3Y5LU9RX29XRUxQUFY0MmdsYXA0Qzl2UWloRWdxRmhHR1dXTkJMZ01aZmkxdW1pbUVjZWk5cDlDZFdBUVE1Vmk1WGMyYVoxOU5UaFJlNFYxNmNFNUVKRklUM043VUZZVHNqOThobDhNNW8xOUdIZHlOLWFaeg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 May 2024 07:00:00 GMT",
        "title": "Could Investing $10,000 in Solana Make You a Millionaire? - The Motley Fool",
        "content": "Could Ethereum's rival generate major multibagger gains?\n\nSolana (SOL -1.70%) has minted a lot of millionaires since its launch in 2020. The cryptocurrency started trading at $0.95 and hit its all-time high of $260.06 on Nov. 6, 2021 -- which would have turned a $10,000 investment into $2.74 million.\n\nSolana was widely seen as an alternative to Ethereum (ETH -0.02%) for the development of decentralized apps. Solana's blockchain was faster, more scalable, and had lower transaction costs than Ethereum. It accomplished that by using its unique proof-of-history (PoH) mechanism to accelerate the proof-of-stake (PoS) mining method used by Ethereum.\n\nHowever, a series of network congestion and security failures caused Solana to lose its luster, and rising rates subsequently crushed the cryptocurrency market. To make matters worse, failed crypto exchange FTX hastily liquidated its Solana tokens in several huge auctions to raise more cash to pay off its creditors. As a result, Solana's price dipped below $10 by the end of 2022.\n\nYet Solana bounced back, reaching $163; your original $10,000 investment would still be worth $1.72 million. It was tough for investors to stick with Solana through those wild swings, but it's now the world's fifth largest cryptocurrency with a market cap of $71 billion. Could it keep growing and turn a fresh $10,000 investment to $1 million again?\n\nWhat's next for Solana?\n\nSolana's powerful recovery suggests it will remain a formidable rival for Ethereum as a platform for the development of decentralized apps and tokens. Its network has already been used to produce a wide range of meme coins, including notable ones like BONK (BONK 5.68%) and WIF (WIF 2.21%), as well as decentralized exchanges like Jupiter and Orca. The expansion of that ecosystem could make it a fertile environment for more crypto projects.\n\nNew decentralized wallets and financial apps could also help Solana (and Ethereum) disrupt traditional financial institutions. The introduction of Solana Pay, which was integrated into Shopify last year, marked a major step in that direction. Visa also started to run its stablecoin settlement program on Solana, while Circle recently added native Solana support for its EURC stablecoin.\n\nSolana Labs' subsidiary, Solana Mobile, even launched its own Saga smartphone last December. The Android device is still a niche gadget, but it targets Web3 enthusiasts with its integrated digital asset management and Solana blockchain tools.\n\nSolana's rapid expansion is impressive, but Ethereum is scrambling to match Solana's speed and scalability with its own network upgrades. In a recent essay, Ethereum's co-founder and chief architect, Vitalik Buterin, proposed the introduction of \"multidimensional gas fees\" which sound similar to Solana's variable project-by-project user fees across its \"local fee markets.\" If Ethereum closes that gap, it could throttle the long-term growth of Solana's blockchain ecosystem.\n\nHow much higher can Solana soar?\n\nSolana seems to have overcome its initial growing pains. It resolved the congestion issues caused by the market's feverish interest in non-fungible tokens (NFTs) in 2021, survived FTX's large liquidations, and still processes transactions faster than Ethereum. Developers are still launching new apps on Solana and promoting their new tokens with airdrops.\n\nHowever, it's tough to tell how much larger Solana's blockchain can grow as long as it's overshadowed by Ethereum's larger network. For now, CoinPedia estimates that Solana's price could hit $500 by the end of the year and $1,672 by 2030.\n\nYou should take those estimates with a grain of salt, but they imply that Solana will remain one of the world's top cryptocurrencies as it attracts more developers and becomes more widely adopted for mainstream payments. But even if Solana's price hits $1,672 by 2030, it would only turn a new $10,000 investment into about $100,000.\n\nTherefore, Solana might still have a lot of upside potential -- but it probably won't make you a millionaire by the end of the decade. It could also easily be cut in half before it generates bigger gains, so investors should brace for a lot of volatility."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxObmN6enI2SXpqc3lXOW9BS1pEOVdIWWFiRjZsa2VJT3c5aWhpcjhjeUtxTTFNTnlZTllEV1JhYUNrenZSUkM5WkNtaUJneXRjc0RiVHh1RmMzR2V4cWlyLXRyRXItVlEzUnFFbktldVRSenIySGlaSVpWV1N3WjJYNmYyd1ZEa213OFV1Qm5WNHpMNVRZd3JN?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 May 2024 07:00:00 GMT",
        "title": "IBC to Ethereum: Building the interconnected Internet of Blockchains - CryptoSlate",
        "content": "Since the advent of Bitcoin in 2009 and the explosion of innovation that followed, the web3 industry has faced many challenges. Beyond dealing with regulators, improving UX, and weeding out bad actors, blockchain engineers continue to tackle two major hurdles: scalability and interoperability.\n\nWhile many Layer 2s are working to scale Layer 1s like Bitcoin and Ethereum by improving throughput and reducing transaction fees, protocols like Union enable both—interoperability at scale.\n\nThe need for blockchain interoperability\n\nWhatever your opinion on the WEF, its 2020 whitepaper on blockchain interoperability hit the nail when it stated, “Organisations do not want to find themselves on a blockchain platform that may limit their options for external collaboration in the future.”\n\nTo elaborate further on that point, imagine having a Gmail account, sending a message to a Yahoo account, and being unable to exchange communications. The internet was able to develop as quickly as it did because it factored in interoperability from the early days, and blockchains must do the same.\n\nA notable player in the interoperability space is Cosmos, whose flagship Inter-Blockchain Communication (IBC) protocol has enabled a host of sovereign chains to connect, transact, exchange, swap tokens, and perform other actions without compromising sovereignty. Map of Zones shows 91 zones now connected via IBC transacting more than $2.1 billion over the last 30 days in more than 8.7 million transactions.\n\nIBC isn’t limited to Cosmos chains, either. The trustless interoperability protocol has broadened its scope to include EVM-compatible chains such as Ethereum, Polygon, and Avalanche. However, most bridging solutions so far have been offered by centralized providers, meaning users must trust the bridging protocol.\n\nUnion provides a permissionless bridging protocol that connects modular blockchains and rollups trustlessly, without depending on trusted third parties, oracles, multi-signatures, or MPC, using advanced zero-knowledge (ZK) cryptography.\n\nAlready connecting several ecosystems, Union recently announced a partnership with L2 developer Polygon Labs that will tap into Polygon’s AggLayer “to facilitate message passing and asset transfers between the Polygon ecosystem and IBC-enabled chains,” bridging two of the largest blockchain ecosystems: Polygon and Cosmos.\n\nPermissionlessly bridging Polygon, Cosmos, and beyond\n\nUnion founder and prior CTO at Composable Finance Karel Kubat told CryptoSlate, “It’s not just a Cosmos to Polygon bridge but anything that’s IBC-enabled, which includes Scroll, and soon Arbitrum, Berrachain, Movement Labs, M2… They can build and connect into the Agglayer using Union,” permissionlessly tapping into the liquidity of one of the largest blockchain Layer 1s, Ethereum.\n\n“Right now it’s very interesting because we have big L1 ecosystems that really only have permissioned centralized bridges or something in between. You need to go to the bridge provider to get support for a small ecosystem. What Union does, is if you’re building a new Cosmos chain or a new rollup that’s IBC enabled, you don’t need to go to a centralized provider to get support. You just open the connection to Ethereum and you’re done… So we’re going quite quickly from a world with only 200 to 300 ecosystems to a world with thousands and thousands.”\n\nThis type of seamless interoperability isn’t possible with centralized solutions because the “wait queue” is too long. Every chain wanting to connect needs to request the bridging protocol’s permission.\n\nWith Union, chains can permissionlessly open a channel with Ethereum, enabling a seamlessly interconnected future… of potentially millions of chains. Karel gives the example of dYdX, one of the largest decentralized exchanges that began as a smart contract on Ethereum and moved ecosystems to become a sovereign Cosmos app chain.\n\n“We all went into crypto for sovereignty,” he says. “Any successful smart contract is contemplating going to their own L2 or app chain.” This means the total addressable market for Union is potentially vast. “It isn’t anyone that wants to build a blockchain. It’s any existing app on Ethereum and Solana that could benefit from making this move.”\n\nUnion’s IBC to Polygon bridge should be completed by the end of this year and you can keep up with the latest developments by following Union on X.\n\nMentioned in this article"
    }
]