[
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE4waHc3ZzQxWDdYbFZUQlpfamtxYTlJSFBvM0FiTGV3a01tV0JtWDY3Y0ZTTFR0VzZSVU4wTTlVV1g4V3M1bU5ndEl0NWFPWWxOcm4tVWJfLXBudHVFVC1WZ2dkTGc2MWQzVTRDdVBTNmlJQdIBd0FVX3lxTFBVOWRpTFZTekRWT042SUpRRk4tenFTemtWVWRZYmtXcXNaRk90T0oyTmxmakp1OGZ0aERieEU0N0ZSazJMd25sRUV0cVRRSXNqeFozbU14X2hWMG14NGk5VTdXSzA2azdXRUFXc28wNmhOdUxmOTQ4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETF Launch Date Announced by Top Analyst - U.Today",
        "content": "According to Eric Balchunas, Bloomberg's senior ETF analyst, Ethereum exchange-traded funds are set to be launched on July 23.\n\nAdvertisement\n\nProspective issuers have been asked to re-submit their final S-1 forms on Wednesday by the U.S. Securities and Exchange Commission.\n\nNotably, the launch of Ether ETFs will take place right in the middle of the Bitcoin 2024 Conference.\n\nIt is worth noting that the launch of these products could still be delayed due to last-minute issuers.\n\nAdvertisement\n\nEarlier today, Nate Geraci, president of the ETF Store, said that he could not come up with a \"good reason\" for the SEC to further delay the launch of these products, adding that issues are ready.\n\nAs reported by U.Today, the SEC approved 19b-4 filings for various spot Ethereum ETFs back in May in what appeared to be a major U-turn. Just days before the approval, these products were widely expected to be rejected by the SEC.\n\nHowever, there is still a lot of uncertainty regarding the level of demand that these products will manage to attract.\n\nFor instance, banking giant JPMorgan has predicted that these products will severely underperform compared to Bitcoin ETFs. However, crypto-native firms of the likes of Gemini expect Ethereum ETFs to be moderately successful.\n\nNotably, Coinbase researchers have forecasted that the launch of Ether ETFs could be either bullish or bearish for crypto markets depending on the amount of inflows.\n\nRegardless of how successful these products are going to be, the launch of the first spot altcoin ETFs would mark a historic shift.\n\nIn the meantime, VanEck and 21Shares have already submitted Solana ETF applications. However, analysts believe that their approval is unlikely to happen this year."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiYkFVX3lxTE15czVoaEczNUxIM0g3Y1pwVmhGN0tnTlRkTEVpaWlZdGY3WkZoRGhyaFo1eHhtZ0FESTNrMy01aU1GY19ZdlpTaXdXaDFlSlp3OXdIMERGV3U3SUJ6azI5NU9n?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETFs to launch July 23, Bloomberg analyst says - Crypto Briefing",
        "content": "Ethereum ETFs to coincide with Bitcoin Conference, potentially boosting market attention.\n\nKey Takeaways Ethereum ETFs are scheduled to begin trading on July 23, as reported by Bloomberg analyst.\n\nBitwise CIO projects $15 billion in inflows for Ethereum ETFs by the end of 2025.\n\nShare this article\n\nThe starting date for spot Ethereum exchange-traded fund (ETF) trading in the US is July 23rd, according to Bloomberg ETF analyst Eric Balchunas. He shared on X that the SEC is answering issuers today, asking them to return their final S-1 forms on Wednesday, July 17th.\n\n“And then request effectiveness on Monday after close for a TUESDAY 7/23 LAUNCH. This is provided no unforeseeable last min issues of course,” he added.\n\nUpdate: Nate's instincts were right, hearing SEC finally gotten back to issuers today, asking them to return FINAL S-1s on Wed (incl fees) and then request effectiveness on Monday after close for a TUESDAY 7/23 LAUNCH. This is provided no unforeseeable last min issues of course! https://t.co/D21FD9Qf94 — Eric Balchunas (@EricBalchunas) July 15, 2024\n\nThe Ethereum ETF issuers filed their S-1 forms on July 8th but most of them left the fees out of their forms. According to Balchunas, this is likely a strategy from the asset managers to check how competitive the funds’ fees are, especially BlackRock’s.\n\nNotably, the S-1 form is an initial registration required by the US Securities and Exchange Commission (SEC) before a security can be publicly traded.\n\nAs highlighted by Balchunas’ fellow ETF analyst James Seyffart, this could mean that the Ethereum ETFs will start trading the same week as the Bitcoin Conference, set to happen in Nashville.\n\nThe launch of the spot Ethereum ETFs is a key step for crypto adoption by mainstream investors, as it solidifies the altcoin as a sound asset among institutional investors. An estimate by Bitwise CIO predicts that these investment instruments will capture $15 billion in inflows until the end of 2025, as reported by Crypto Briefing.\n\nMoreover, the Ethereum ETFs open the door for the approval of exchange-traded funds indexed to other crypto. VanEck and 21Shares both filed their form for the approval of the first spot Solana ETFs in the US on the last week of June."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxQX2dpMnRpYW5sZlNFc3V6LWE4QlRBSmF0MmdDYVNjYkpTc1NJRHg4Ykl0ZWF1d3dRT1NRZ2poaWMwb3VHUndzbWZkZEFyMVFueTRDZ2toclhWVEpVMXVLd0RuSUNGOFdBa2RsOUFtSkFka2loRFctZ2xvdDRuY24ybEN3YXBjeTDSAYwBQVVfeXFMTlJLVmxwQmUzQnNlRVRUVHhCLTNKMzVUWWFwaTFoOFlBX3lkZVpjVWFPOU5yejUtQmczLTVVbEdMTlY4VktmTmlBYWJSMGZkMTJXTVBEOFJ2VkU3S3hJSUIyT05YSTZpUVl3ZjcwcEZPTENtR0dpQUh4ZTA3b0xKdzFXYU5fbWxyaTdZQnc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETF Approval Might Change Crypto Market in Unusual Ways - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nSince May, the crypto ecosystem has been anticipating the approval of S-1 registration for the spot Ethereum ETF. While top market experts have exhausted their projections regarding the timeline on which the product will launch, ETFStore President Nate Geraci said he sees no reason why the product would not go live this week.\n\nAdvertisement\n\nWelcome to spot eth ETF approval week…\n\n\n\nI’m calling it.\n\n\n\nDon’t know anything specific, just can’t come up w/ good reason for any further delay at this point.\n\n\n\nIssuers ready for launch. — Nate Geraci (@NateGeraci) July 14, 2024\n\nAs it stands, prospective Ethereum ETF issuers have come to terms to satisfy the United States Securities and Exchange Commission (SEC) by making amendments to their respective S-1 registration forms. With compromises already being recorded since spot Bitcoin ETF approval days, the market is not expecting any further delays.\n\nHowever, the concerns of many lie in what will become of the industry should the Ethereum ETF start trading. The conversation rests on its immediate impact on the market in terms of price gains.\n\nWhen the SEC approved 19b-4 filings in May, the update fueled a massive spike in the price of the coin, with a ripple effect on Bitcoin and altcoins more broadly. This rally, though short-lived, might get replayed when Ethereum ETF products start trading.\n\nThe bullish sentiment in price is already creeping in. At the time of writing, the price of Ethereum and trading volume are up 4.14% and 34.43% to $3,334.51 and $13,196,383,402, respectively.\n\nBesides price impact, the launch of the Ethereum ETF effectively lifted limitations for other altcoins gunning for similar product acceptance on Wall Street. Already, there are active applications for a Solana ETF from VanEck ⁠⁠⁠⁠⁠⁠⁠, and 21Shares has already broken the push for the product with a Bitcoin and Ethereum duopoly.\n\nThe Ethereum ETF trading and potential capital injection might confirm what crypto proponents have been projecting for a while now: fact that there is a subtle demand for mainstream, regulated crypto products."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQSFAtUElOT1Ridms2OThnZVhkLW02Y0FQR3lfMnB2QjJpaEtCdGNUc0o4M2IxaWFDUHZPN0ZpS09aaHZySHlqQ1pkam0yYk1iT1IzaDE2SUFwNnRza2lhaHNaQ2p4NUo4cGdKZDhxODV0TEw4MDNNMHgydXUtdDRZZGFPQXV5ZEFaWGVxSWpFYkdmSjA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jul 2024 07:00:00 GMT",
        "title": "Bloomberg analyst confirms Ethereum ETFs set to launch next week - CryptoSlate",
        "content": "The Securities and Exchange Commission (SEC) is anticipated to approve the spot Ethereum exchange-traded funds (ETFs) next week, with trading expected to begin on July 23, Bloomberg senior ETF analyst Eric Balchunas reported on July 15, citing industry sources.\n\nThe development follows recent communications between the SEC and ETF issuers, signaling a potential green light for the much-anticipated financial products.\n\nBalchunas revealed via social media that the SEC has instructed issuers to submit their final S-1 forms, including necessary fees, by July 17. The SEC is expected to request effectiveness after the close of business on July 22, paving the way for a Tuesday trading launch for the Ethereum ETFs.\n\nHowever, Balchunas added:\n\n“This is provided no unforeseeable last min issues of course!”\n\nThe news comes amid growing anticipation in the crypto community, with ETF Store President Nate Geraci, predicting this week as the likely approval period for spot Ethereum ETFs. He tweeted earlier in the day:\n\n“Welcome to spot eth ETF approval week… I’m calling it. Don’t know anything specific, just can’t come up w/ good reason for any further delay at this point. Issuers ready for launch.”\n\nThe timing of the SEC’s expected approval coincides with the largest Bitcoin conference of the year, adding to the excitement within the crypto sector.\n\nThe introduction of spot ETH ETFs is seen as a significant milestone for the crypto industry as it will provide investors with a new avenue to gain exposure to Ethereum through a regulated financial product.\n\nFollowing the launch, market observers anticipate substantial investment flows and the potential introduction of additional cryptocurrency-based financial products, including those based on Solana and other digital assets.\n\nBalchunas suggested that this marks the start of crypto ETFs, with other tokens set to follow in the footsteps of Bitcoin and Ethereum, starting with Solana. He said:\n\n“Keep in mind after launch there’s flows and then add’l eth products I’m sure, then Solana, and then… it’s prob never going to end. The dam has broken.”\n\nAs of press time, Ethereum was up 5.23% over the last 24 hours and trading at $3418, based on CryptoSlate data.\n\nEthereum Market Data At the time of press 12:27 am UTC on Jul. 16, 2024, Ethereum is ranked #2 by market cap and the price is up 6.94% over the past 24 hours. Ethereum has a market capitalization of $419.56 billion with a 24-hour trading volume of $18.13 billion. Learn more about Ethereum › Ethereum $3,489.98 6.94% Crypto Market Summary At the time of press 12:27 am UTC on Jul. 16, 2024, the total crypto market is valued at at $2.37 trillion with a 24-hour volume of $84.72 billion. Bitcoin dominance is currently at 53.80%. Learn more about the crypto market ›\n\nMentioned in this article"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxORVp3R2cySnFfUnN3S0hKb3oxUVlmbG1SSXhFd3FheFFwS3R2ZWdvRTZ2VXRmeURaZDNNVW5YNEpsWkhEdXhRUWRoNFBEVVpXMXFlWlNHMW8tWVZfeno4MWJUSnFjN24ySE1sSW9CZUtTVm1uVDN2bnVvdjFlc3VxaEw4bkNJQVFLQjY4YzlR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETF Approval: A Turning Point for The Crypto Market - Watcher Guru",
        "content": "Ethereum ETF approval will reshape the crypto landscape from its base. This change could be an essential milestone for digital assets.\n\nThe anticipation is, of course, building by the day, as Ethereum ETF approval will have a major impact on the broader market. This makes Ethereum ETF a focal point for investors and analysts.\n\nAlso Read: Top 3 Cryptocurrencies That Could Hit ATH Post Ethereum ETF\n\nExploring the Impact of Ethereum ETF Approval\n\nAnticipation Builds for Imminent Launch\n\nThe crypto community is buzzing with excitement about the possible launch of spot Ethereum EFTs. Industry leaders, including Nate Geraci (president of ETF Store), expressed optimism about the U.S. Securities and Exchange Commission (SEC) finally giving the green light.\n\nWelcome to spot eth ETF approval week…\n\n\n\nI’m calling it.\n\n\n\nDon’t know anything specific, just can’t come up w/ good reason for any further delay at this point.\n\n\n\nIssuers ready for launch. — Nate Geraci (@NateGeraci) July 14, 2024\n\nAs you can see above, in a recent post, Geraci stated:\n\n“Welcome to spot ETH ETF approval week. I’m calling it. Don’t know anything specific, just can’t come up with a good reason for any further delay at this point. Issuers are ready for launch.”\n\nBloomberg analysts Eric Balchunas and James Seyffart also have the same opinion. They suggest that these ETFs could debut in mid-July.\n\nThe SEC is well-known for giving minimal feedback on final registration statements. This can be interpreted as a positive and can suggest that the application is nearing approval. Furthermore, the SEC has made minimal changes to the latest filings.\n\nWhat Will the Market Response Be?\n\nThe anticipation about a possible Ethereum ETF approval has already boosted its price. ETH is currently trading at $3.342, with an enormous jump from $2.909 just a week ago.\n\nThe technical analysis of the charts shows a bullish trend, with Ethereum trading above $3.280 and the 100-hourly Simple Moving Average.\n\nAlso Read: Ethereum ETF Inflows Could Hit $10B, Sending Ether to New ATH\n\nPotential Ripple Effects on the Crypto Ecosystem\n\nInstitutional Interest and Investment Inflows\n\nSpot Ethereum ETFs, as mentioned previously, have generated quite a bit of excitement for investors and financial advisors.\n\nBitwise Asset Management projects that these ETFs could attract $15 billion in net inflows until the year 2025 ends.\n\nIf this is true, this influx would explore Ethereum’s value and validate its current price revival.\n\nPaving the Way for Other Altcoin ETFs\n\nThe approval of Ethereum ETFs might put its foot in the door for other altcoins that want a similar product acceptance on Wall Street, and here are some of them:\n\nActive applications for a Solana ETF from VanExck\n\n21Shares has expanded beyond the Bitcoin-Ethereum duopoly\n\nAs a result, we could expect a more diverse range of crypto investment products in the future.\n\nAlso Read: VanEck Officially Files S-1 for Spot Ethereum ETF\n\nThe approval and the following trading of Ethereum ETFs could be an excellent marker of the growing demand for more mainstream and regulated crypto products.\n\nIt remains to be seen if the SEC’s decision will boost ETH ETFs to a new level. We’re eagerly awaiting their conclusion."
    }
]