[
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxQeXh0V3R6MzVVZjlqbFptMjk2T05xdG9yLWJnTzVPOVRSRnF2MEZSVTdLQXRYUncxOEJrb1l4VVJia3QxSzJBOEZfQVFPT241TXNBRTQ4NDVOeFEzdVpYc0kzOVRfSjVmYlFxcG9UNTZPVmxTYnlyM2x1VUVDbThObUJuZk5tLVlPalRmSURlTVBYNklDRHRhd3ZuYkdPR2fSAaQBQVVfeXFMTkJHbkh0RWRiSUw1QWs3RDVZZmFZcFBFOUZhUi1zcjBHc3VnOENDOXlxRktKN0xJMUxjek50SFpkMVl4THlrMmZyQnhoSzFBOHJJSUxEWGlYNW8wN2ZnN0dmemFvMElaR1FGSFVyenZIUVpHRVZMV2FCb3pQcEdERmR2MW1kNkRSTnpVRldUNm9raUJCVExjdW1TNHZKRnRzLW5vTm0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 May 2024 07:00:00 GMT",
        "title": "Meme Coins MOG, PEPE Rocket as Traders Search for Ether Beta Bets - CoinDesk",
        "content": "The focus on meme coins as a way of betting on growth isn't unique to Ethereum. Several Solana-based meme coin tokens surged from December to March as the network’s SOL tokens took off – contributing to ecosystem growth and attention. Also in December, the Avalanche Foundation, a non-profit that maintains the Avalanche blockchain, said it would invest in meme tokens built on the network in recognition of the online culture and memetic value that such tokens can drive among investors."
    },
    {
        "id": 72,
        "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTFBLNkp1bU41M01aNExQcURCVTZWMWFnS1ZrR0xCWlAzVm5XQ3U2bDd6b3QzTlVabnJjbnRqYjJfTHZXSzBoZHdyeUF2LVZramxPd3YzTHhFQWJZbkFtNDltWXpjUjJZX2VwSE03Qlg1eGNyY0NTc1dzQtIBgAFBVV95cUxQRUNHQUJhTERKWlJBYjdINkFja3BtNEhsZzhTNmR4NU9VYVNMTUhKYVZNZDhsOXd4OVc3ZVk3bTcyUFVCTXdCYXlaM1p5eHUzR2V0b2d4eUJoM2I1RE9yM2lGdF9ZZEJRNU52S25JblBYc3czOHRJZHVnWHl2N0NxZg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 May 2024 07:00:00 GMT",
        "title": "Ethereum Futures Market Breaks Record as ETF Euphoria Ensnares Traders - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nOpen interest for Ethereum futures contracts hit $15.5 billion on Tuesday following rumors that the Securities and Exchange Commission was closer to approving ETH exchange-traded funds this week.\n\nThe sudden blast of optimism has fueled a rush of upward movement across markets, and CoinGlass data shows that open interest on all crypto exchanges was at a record of 4.13 million ETH—surging by 32% in 24 hours.\n\nDeribit CEO Luuk Strijers told Decrypt that the trading volume was “unprecedented.”\n\nAD\n\nAD\n\n“This surge [in futures trading] reflects the heightened market activity and interest as traders and investors position themselves to capitalize on the potential approval,” Strijers said.\n\nIn the derivatives market, futures contracts are an agreement to buy or sell an asset at a specific price at a later date. They allow traders to speculate on movements in an asset’s price.\n\nIt’s a marked turnaround for the second largest cryptocurrency after months of hand wringing. Until this week, it was expected by industry observers and analysts that the SEC would not approve a spot ETH exchange traded fund (ETF) by the May 23 deadline.\n\nBut yesterday, ETF analysts at Bloomberg said that they had heard Wall Street’s biggest regulator would go ahead and give the green light to the funds after fund managers started updating paperwork for the potential products.\n\nThe price of ETH has rocketed as a result: ETH is currently trading at $3,752, according to CoinGecko, having shot up 19% in 24 hours.\n\nAD\n\nAD\n\nAnd it isn’t only ETH that is doing well: almost every other coin and token is up. Bitcoin, the biggest and oldest cryptocurrency, yesterday rocketed to over $70,000 per coin. It’s since dropped and is priced at $69,753.\n\nMeme coins and tokens have also surged, as have altcoins like Solana and Avalanche.\n\nLots of top asset managers have filed paperwork with the SEC to release a spot ETH ETF in the United States.\n\nIf approved, ordinary investors could get exposure to ETH by buying shares that track the price of the cryptocurrency, which is the second biggest by market cap.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE9vaGV6eDhoU0d3cHVlcG5oMklpMDRiRlVYUnVhYzJzYVB3Yk5vOXl1UlBZTDFncXpDbjNZTDg1N0paMExkOTBILUlYZGRSMEd4bWpqWG1PemFfVVBEVU9pMkF0dmtpQmtVZHViQUN5QkE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 May 2024 07:00:00 GMT",
        "title": "Will Ethereum Reach $5000? - Crypto Times",
        "content": "As the overall crypto market begins to show signs of strength, Ethereum, the largest altcoin, sees an overnight increase in price. The bullish resurgence takes back the psychological $3,500 mark as the underlying demand increases in tandem with the improving sentiment surrounding the approval of the Ethereum ETF.\n\nAdditionally, Ethereum’s bull run is further fueled by the market’s recovery rally, which is being supported by Bitcoin’s surge above $70,000. What’s the deal, then? Will the price of Ethereum surpass $5,000?\n\nHere is an overview of Ethereum:\n\nETH Price Prediction For May 2024\n\nThe Ethereum price is $3,813.68, a change of 23.79% over the past 24 hours as of 8:20 p.m. The recent price action in Ethereum left the token’s market capitalization at $453.80B. So far this year, Ethereum has a change of 66.09%. The recent price jump comes along with high volume as it has surged 335% in the last 24 hours.\n\nTechnical Analysis of Ethereum\n\nFrom a technical standpoint, Ether’s current gains are part of a falling wedge breakout.\n\nA falling wedge forms when the price moves within a descending channel with two converging trendlines. Meanwhile, as a rule of technical analysis, the pattern resolves when the price breaks above its upper trendline and rises to its peak height.\n\nEthereum Technical Analysis | Source: Tradingview\n\nToday, the price surged passed the 50-day EMA (Exponential Moving Average), as it moves toward $4000, expected as the initial target of the falling wedge breakout.\n\nEther open interest, funding rate rise sharply\n\nEther’s price increase coincides with a sharp increase in its open interest (OI) and funding rates.\n\nOn May 21, Ether Futures OI increased by more than $3 billion, and jumped to $14.68 billion, while the funding rate reached a one-month high of 0.567% per week.\n\nA high OI typically indicates increased investor interest and confidence in the asset, implying that traders are preparing for possible price movements.\n\nMeanwhile, a high funding rate indicates that more traders are betting on Ether’s price rising (long positions) than on it falling (short positions). This suggests that traders are bullish and willing to pay a premium to maintain their long positions.\n\nCan Ethereum Reach $5,000?\n\nWhile the current market conditions favor Ethereum, reaching $5,000 depends on several factors, including:\n\nOverall market trends: Continued strength in the broader cryptocurrency market would benefit Ethereum.\n\nContinued strength in the broader cryptocurrency market would benefit Ethereum. Regulatory developments: Approval of an Ethereum ETF could trigger a significant price increase.\n\nApproval of an Ethereum ETF could trigger a significant price increase. Ethereum-specific developments: Progress on Ethereum’s upgrade to Ethereum 2.0 could further boost investor confidence.\n\nOverall, the technical indicators and rising investor sentiment paint a bullish picture for Ethereum. However, external factors will ultimately determine whether the token can reach the $5,000 milestone."
    },
    {
        "id": 83,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQYkJFNnhGeXVjYXEzN0wxVFQ5LUliMXpWUHh4VkduZUpEdEtDclRLblhYNW5GSUlpckdIdUNsNFZxS3YtcWtkamxXX3E3MUpqa2hkWUVYZEt1d19aMUtTZmVWRFAwdVdDMnBQOFA2UGdRZ1ZNZVVKWC0tdXRqNGt0TGF2MnRJaHBpMnd3WHhXek9nTTRZQXJjZg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 May 2024 07:00:00 GMT",
        "title": "Why Ethereum, Solana, Avalanche, and Chainlink Are Soaring - The Motley Fool",
        "content": "A potentially historic decision is benefiting Ethereum and several other cryptocurrencies.\n\nOver the past 24 hours, Ethereum (ETH -0.02%) surged more than 25%, rising from just $3,000 to more than $3,700 at one point. This bullish momentum is primarily driven by growing anticipation surrounding the potential approval of a spot Ethereum exchange-traded fund (ETF), a development that could have profound implications for the broader cryptocurrency market.\n\nThe SEC's shift and expedited revisions\n\nFor a long time, the approval of an Ethereum ETF seemed like a distant possibility. Many analysts and market participants believed that the Securities and Exchange Commission (SEC) wouldn't greenlight such an ETF, as they believed it to be a security and not a commodity like Bitcoin (BTC -1.35%), which received its own spot ETF approval in January this year.\n\nHowever, sentiment has shifted dramatically. Rumors are swirling that the SEC has requested several applicants to expedite their revisions to their 19b-4s. These applications, which are essential for listing new ETFs, must be corrected, allowing for the final approval with an S-1 application and thereby pave the way for the ETFs to start trading.\n\nImpact on Ethereum\n\nThe prospect of an Ethereum ETF is significant for several reasons. First, it would provide investors unfamiliar or uncomfortable navigating crypto exchanges and digital wallets an easy way to invest. If approved, then investors can buy the Ethereum ETF off their preferred brokerage, just as with any other stock.\n\nYet the most important aspect of a potential approval comes in the form of institutional investors. Currently, institutional investors face several hurdles when attempting to invest in cryptocurrencies directly, including custody concerns, regulatory uncertainties, and market volatility. An ETF would alleviate many of these issues, making it easier for institutional capital to flow into the Ethereum market.\n\nWith easier access, it is expected that the deep pockets of institutional investors could cause Ethereum's price to soar. The Bitcoin ETFs were already some of the most successful ETFs ever launched, and if Ethereum follows a similar path, it could result in a significant price surge.\n\nRipple effect on other cryptocurrencies\n\nWhile the focus is primarily on Ethereum, the positive sentiment has spilled over into other cryptocurrencies. Solana (SOL -0.70%), Avalanche (AVAX -0.86%), and Chainlink (LINK -1.39%) have all seen their prices rise by more than 25% in the past 24 hours.\n\nThese cryptocurrencies, often referred to as \"altcoins,\" have been subject to heightened scrutiny lately because of their similarities with Ethereum, namely their proof-of-stake consensus mechanisms. Many agency officials believe proof-of-stake cryptocurrencies are closer to a security than to a commodity. But with a potential Ethereum ETF approval this opinion might be changing and could give a boost to other proof of stake cryptocurrencies.\n\nAnalysts' predictions and timelines\n\nWhile the approval of an Ethereum ETF is not yet guaranteed, analysts currently estimate a 75% chance of approval. This optimistic outlook is based on the SEC's recent actions and the growing recognition of Ethereum's importance in the cryptocurrency ecosystem.\n\nIf all goes according to plan, the earliest the ETFs could start trading is around the end of June. Applicants will need to revise and correct their applications, a process that typically takes several weeks.\n\nThe potential approval of an Ethereum ETF represents a monumental shift in the regulatory landscape, offering a more accessible and secure investment vehicle for both retail and institutional investors. While the final decision is still pending, the current sentiment is overwhelmingly positive, and the approval could mark a new era of growth and adoption for the cryptocurrency market."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFBJSkg5aXZvWnkzNUVFWTRuNldFT3dWaGpaLTBoTXA3Yi1LLXpfdmVNNFhYeEhrZzBiQjlGYll6YXZsYl9UVWVjVjlSa2Z0bFJLaWM3RVZLZTJGYV8yUnVDaXlhUWNFQWx2a0xwSGhXT2NhYXNwc2JHdXhSN3k?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 May 2024 07:00:00 GMT",
        "title": "Obol Network to fund ‘sustainable’ Ethereum development - Blockworks",
        "content": "As the price of ether increases, the cost of running a full solo staking node — with 32 ETH now worth $115,000 — moves further out of reach for all but the most hard core hobbyists.\n\nOne of the social goals that Oisin Kyne and Collin Myers, founders of Obol Network, care about most is enabling people that don’t have that kind of capital to participate in Ethereum consensus.\n\nThe pair looks forward to the day when the number of entities and locations validating the network will rise tenfold from its current crop of single-digit thousands of operators.\n\nThat includes a fellow in a Kenyan village who, according to Kyne, participates in a distributed validator cluster via EtherFi, running his hardware off a Starlink and a generator.\n\n“It certainly feels good to have people that are staking — that have the technical ability and are really into it, but either weren’t in early or don’t have, you know, bags — that can actually decentralize Ethereum and quite happily do it from the middle of nowhere,” Kyne told Blockworks.\n\nObol has spent the past few years proving out the technology to decentralize projects like Lido, its launch partner, and to enable more solo stakers as well as new paradigms like squad staking.\n\n“We worked with [Lido] to integrate the technology into their stack, and now we’re progressively opening the code base, decentralizing the community, and in the future plan to incentivize the community and bring everyone together around this contribution based mindset,” Myers told Blockworks.\n\nAs a first step, Obol has announced the “1% For Decentralisation” funding model for the DVT middleware provider.\n\nUnder the plan, Obol’s distributed validator (DV) clusters will contribute 1% of their staking rewards “toward projects that add value and impact at the Ethereum consensus layer, including technology partners, researchers, community educators, node operators, and more,” according to a blog post published Tuesday.\n\nThe initiative piggybacks off the EasyRetroPGF — or Retroactive Public Goods Funding — system pioneered by GitCoin.\n\nWhereas public good funding from the Optimism Foundation focuses on the execution layer and user adoption, “there needs to be a more concerted focus around the validator, infrastructure area, the consensus integrity, that whole side of the network,” the Obol founders say.\n\nMiddleware provides an interface between Ethereum’s consensus layer and software further up the modular stack.\n\n“The creation of middleware enables add-on use cases to your existing experience,” Myers explained. “Without middleware, it’s just a boring old validator — you can’t do anything.”\n\nMEV Boost is one example in wide use alongside Obol today, that enables the little guy to earn similar staking yields as large professional operators. And soon validators will be able to participate in EigenLayer Actively Validated Services (AVS) or similar offerings on top.\n\n“All of this is an extension of the validator as a world-class citizen of Web3,” Myers said.\n\nEthereum is sometimes criticized for the complexity of its design, or for tolerating centralizing influences in certain areas, such as block building and the scaling of the execution layer.\n\nBut Myers feels those attacks are misplaced.\n\n“From where I sit, two years ago we went from bad rent extraction, client centralization, a completely monolithic software stack, and now we’ve moved to modular, a bit more decentralized, open source, multiple options, lots of funding, good debate — and for me that’s progress,” he said.\n\nWhile there is some movement in the direction of ossifying the base consensus layer, he pushes back against the notion that the roadmap is decreasing innovation at layer one. Rather, “they are just enabling it to exist elsewhere through decentralization…and DVT is a living example of that,” he said.\n\nThe “stage” framework used by L2beat is a useful gauge of decentralization progress, and Osin agreed with Vitalik’s commitment to push “layer-2s” as such to reach the Stage 1 level by the end of the year.\n\n“It’s an interesting social showing, of people being like, ‘no, we’re not going to tolerate a sidechain masquerading as an L2, unless you can permissionlessly exit back to L1,” Osin said.\n\nLido is backing the new Obol funding approach, with contributor Will Shannon, calling it “a fantastic approach to strengthening the resilience and decentralization of the Ethereum protocol.”\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    }
]