[
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiyAFBVV95cUxNWTJFQTBxRTdzSmtQNkRIRnNTVG9aTXQtMC10Z1pBM0lQQTlETTlaM2s5VlV2SUw3MFpFMGJHNHZSUlpLLUx5eXhfOXc0SGNLTm9Lb1FVcU1uNHRnWjlzWXpHM05aSFZMZjQyYWl0RmFOX1RWQ2VURFZYMDFZXzJPTWlheFdZU1RHQl84OFN6OHVMZHFsbXhSWWYtQTc3czZxeHVrVHd1a2pveDJrZHVETGtrbFllbzhaRmV1aEZqYXVUR0lHWHlxRdIBzgFBVV95cUxPQWxONkk3ODNwZFNnTS1qRDkzZENfU1pfX3BLT1NCYXNPMzI1YlJYZFdTMG96bHVnTXppQ0gzVVJiaUd6bVV1OWFSX3RrVTdRc1VfMGpQQ19fbHNsR2VtaTJoa0RFN3ZaajVrTU1PSXJPdmFnNm1KMk52RjlFam93c24taTZ4ajRDb1lqWk1mWnZRS1ZZZHJERHBxRzQ3ejJLVkRjZHE3WXE4TlFvQTREN29oQ2R0b19yZTR0dk90bUNvcldORUx1YnZleC0wUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 May 2024 07:00:00 GMT",
        "title": "Restaking 'Gold Rush' Spreads to Solana From Ethereum, With Jito and Others Joining In - CoinDesk",
        "content": "Restaking 'Gold Rush' Spreads to Solana From Ethereum, With Jito and Others Joining In\n\nThe race is on to build a dominant restaking protocol for Solana.\n\nBy Danny Nelson May 1, 2024 at 12:01 p.m. UTC"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxNaDBwYW9tdW90cDdfcDIxVWdhbzBHRFNvUWxuWU9CMUM5NTR1d0NsenRrRXdEZ2Jfb2ZKeThkUzlxdE1nVUZ6QzJrU0ozb1F1Nk1VWXJNU0p6LTNnaXc4S0tuSzBsT0dBN2lwdnZzczZtMGlfeFBtdHlSNzhwWHByQTFWWHcxV2h1cFpNZUIwcHrSAZYBQVVfeXFMT2NlZHRiRGl3cEVKT251YnB6Q0pDU2U0djVRSVBqZ2tDRFVUUkRXOVZEQ1hlM25xU0UwZ0s1YW1DTG90bkltZkx6OU5yY2lsTmxFVGY1UE9yWHJSRWJtSWszMTk2d3RTU1RUTXNZTng5UUhRa3dFMjRKNENaVmJJT3ByNzU2ajFCc2ZRQ2JISlJwOWREQktB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 May 2024 07:00:00 GMT",
        "title": "Why Ethereum’s price can spiral towards $2500 over the next 7 days - AMBCrypto News",
        "content": "Ethereum flipped its 1-day market structure bearishly.\n\nThe former range highs were the next support region of interest.\n\nEthereum [ETH] saw a wave of selling activity as profit-taking arose amidst fear. The downtrend was persistent in April and the selling volume was growing.\n\nThe indicators were bearish on the one-day timeframe.\n\nThe disappointment from the Hong Kong ETFs’ volume on the first day outlined the sentiment toward ETH and crypto. The Open Interest also fell lower to suggest speculators were more guarded.\n\nThe bullish order block above $2500 next\n\nThe higher timeframe trend of Ethereum flipped bearishly after it dropped below the $2906 swing low. If the daily session closes below this level, the price would very likely head toward the next support zone at $2600.\n\nThis region also has confluence with the former range highs that ETH traded within a few months ago. The RSI on the 1-day timeframe has been below neutral 50 for most of April, highlighting consistent downward momentum.\n\nThe OBV also slipped below a support level recently and retested it as resistance. Ethereum is likely to register sizeable losses before reaching the next notable level on the indicator.\n\nThe hunt for liquidity could see ETH go south\n\nThe closest cluster of liquidation levels for ETH was downward. The $2640-$2750 region presented an attractive pocket of liquidity.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nIt also has confluence with the bullish order block highlighted at the range highs.\n\nIt is expected that ETH will descend to this liquidity pocket before a reversal. Chances of a reversal before that were slim, since these liquidation levels act as magnetic zones to the price.\n\nDisclaimer: The information presented does not constitute financial, investment, trading, or other types of advice and is solely the writer’s opinion."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQTnAyV01OSFZBcTdCYVBLdlNDdThvMDFSa19YODBBdktCVWVucWFvWUlRcWhPZDVKQTIwMU5iMDhpQVlhbUt0MnpNeXRYcVREa1hsT0VIMDZ5VWw3cEJ4QUtzVi1mU3ZSOFIzOTBubG50U3loeEFRN21fQjllRXJIYnNzQkdnWWd3SEHSAY8BQVVfeXFMT1Q2QlBfSVpsTWxzYTA5cjE3OUREYnNlZ2dNSEQzMzlKLWU2NlJtT0hBaE11YzdaVFBiQWNJY2pYelVTbklEMThOaF8waVFFVHhMeU1aWmFudjEzeUs1NVpmU1pCUVVvZDhmVHhrVGR0TU5nN0ZkX1loM0lpeFFXNURZdlo3eGNuS0xDRDFmSWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 May 2024 07:00:00 GMT",
        "title": "Ethereum price’s $3360 rejection – Blame profit-taking or… - AMBCrypto News",
        "content": "Ethereum saw two sizeable waves of profit-taking in the past month that projected doubts about an upcoming rally.\n\nThe ETH whales have added to their stash, with retail being keen to sell.\n\nEthereum [ETH] saw a rejection from the $3360 resistance level over the weekend. This outlined short-term bearish sentiment.\n\nIn other news, the latest Dencun upgrade was a success, helping L2 solutions reach low gas fees.\n\nThe next target for the developers is called Prague. Even though hopeful news was breaking, on-chain metrics showed a lack of faith from market participants.\n\nThe clues from the Ethereum supply distribution\n\nAMBCrypto’s analysis of the supply distribution showed that almost every wallet holding anywhere from 1 to 100k ETH has been selling in recent months.\n\nThe micro wallets with under 0.1 Ethereum were the ones buying, hopeful of a rally after Bitcoin’s [BTC] halving.\n\nIn the past, when the 100k-1 million token holder cohort was added to their stash, it came during a market rally. Sometimes it preceded a major retracement, like it did in mid-January.\n\nThe second half of April saw this cohort quiet down, neither adding to nor selling their supply.\n\nThe 1 million- 10 million cohort saw a sharp uptick in early March. Since then, they too have been quiet. Together, it showed that the large participants expected bullish sentiment in the coming months.\n\nA sharp spike in the 100k- 1 million holders’ supply could be useful for traders to mark local tops and imminent retracements.\n\nDoes fear still rule the market?\n\nThe network realized profit/loss (NRPL) grows during periods of swift price appreciation as profits pile up. The first two weeks of March saw strong price rallies alongside NRPL spikes.\n\nThis indicated profit-taking activity.\n\nHowever, the NRPL has trended downward since then. It saw occasional spikes, such as in late March and mid-April, each smaller than the last.\n\nThis showed participants were keen on booking profits even though the price was just above the $3k support zone.\n\nIt indicated a lack of faith, which is part of the extended retracement Ethereum has witnessed in the past two months.\n\nOn the other hand, the mean dollar invested age (MDIA) has trended strongly higher in the past month. This metric shows that the asset is in an accumulation phase once again.\n\nIt fell sharply during the rally to indicate holders were realizing profits en masse.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nIn the past month, the HOLDer sentiment has been stronger than the collective urge to book profits.\n\nIn conclusion, the metrics showed both fear and hope were present in the market, but long-term investors have more reason to hold on than to sell."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPV2U1eWJiUEE3WTdWbHRvbGFiQVhYZjNhSEJNWkVVXzJhbU5Qb0VNcjh6OGZZX1IwWHRRa21kQ1ZIZmhXNTMwU3p5a2pnLWNPMWxITGxHQ19nQ0VadTFZNUFoZEtmcU5UTU54Y0RiTEpxSE9rT3dieFBkMVZlb3N1R3BkQjNWLXPSAY8BQVVfeXFMTmRuVUZSUUFNQm9SRHFRYm5FMFJhRlhWYldSNGl2bUMxOHp3dWVsNVVNODl4TE5yWnp0cmJDRHFITFlONkxROVZZbkktWlNpVW9mS2ViSmREQ0I2dEgzemk0MEFCRDZ3a0JNU2ZqVWVrMnpjVjZ0MHBIX18xOGhQeW12OV9KQWJ4MDRZQndWU0k?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 May 2024 07:00:00 GMT",
        "title": "How Ethereum Founder Vitalik Buterin Keeps His Crypto Safe - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEthereum founder Vitalik Buterin is advising people to \"decentralize your own security,\" after weighing in on a Twitter discussion about using cold wallets.\n\nTo prove his point, Buterin said that he keeps 90% of his crypto funds in a mutisig Safe wallet.\n\n\"M-of-N, some keys held by you (but not enough to block recovery), the rest held by other people you trust,\" he wrote. \"Don't reveal who those other people are, even to each other.\"\n\nThe \"m-of-n\" Buterin referred to describes one of the ways multisig, or multi-signature, wallets can be set up. The first variable refers to minimum number of signatures required to sign a contract, therefore spending or transferring funds from the wallet. The second variable refers to the total number of possible signatories that exist for the wallet.\n\nAD\n\nAD\n\nThe conversation started after a developer and research, who goes by the pseudonym 0xkofi on Twitter, urged crypto traders to think about how devastating it would be to lose all their funds and avoid it by investing in cold storage.\n\nThe above is why I use a multisig (@safe) for >90% of my personal funds 🙂 M-of-N, some keys held by you (but not enough to block recovery), the rest held by other people you trust. Don't reveal who those other people are, even to each other. Decentralize your own security. — vitalik.eth (@VitalikButerin) May 1, 2024\n\n\"Your hardware wallet will be your fortress of solitude,\" Kofi wrote. \"It will allow you to sleep peacefully at night. It will protect you so that you can survive this game long enough to win.\"\n\nBut not everyone is sold on that being the right way to protect their personal crypto stash. Peter Watts, Uneven Labs CEO and the founder of Reservoir, a developer platform for launching NFT collections, highlighted the risks involved in relying on hardware wallets.\n\nAD\n\nAD\n\n\"When using a hardware wallet, the biggest risk becomes yourself,\" he wrote, adding that someone might find a stashed private seed phrase, or a user could secure it so well that they can't retrieve it themselves.\n\nThat's when Buterin chimed in to describe how he makes sure that he isn't the single point of failure for the security of his cold storage wallet.\n\nPeople often think of @safe wallets as a team only solution. While this might have been true in early 2020, the user base has since evolved significantly. Today, individuals make up more than 99% of @safe users, including notable ones like @VitalikButerin and @punk6529 https://t.co/EyZuKpF2xa — Daniel (@danftz) May 1, 2024\n\nAlthough Safe (formerly Gnosis Safe) multisig wallets have often been treated as a product to help DAOs and other groups manage shared treasuries, there's a lot of individuals who use them in a similar way to Buterin.\n\n\"Today, individuals make up more than 99% of Safe users, including notable ones like Vitalik Buterin and Punk6529,\" wrote a SafeDAO contributor and delegate known as Daniel on Twitter.\n\nEdited by Andrew Hayward"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxNMHcyaWM4cktXWWY4c3JSLVhjNFA1YTJBRXJFRXhFbklOcWR2TWp2cFVqSWpFVEdoMnJFMVVqMW1xcVdFcjNfQmx3bk5IYk5KNjVwTlNmQWEzUEFtZ0NucGZYN3BfaHJfd2doZTNWVnJnc3g4T2lld3FsU1RkTEptWFpBOEdEbHRFY0dabGVvdUVRTXR3VVM1aGQtbmZNTEVpVHlF0gGoAUFVX3lxTE1yS3g3ZVpwMmRGeWJGM1ZiVldkZ2Vld1Z5dHBRX0ZuTld1eC1sbjFvNTVMQldIZnVUakpmdkhuVFhQWnNzaDQ2eFktRVF5YVgzQXkzb0JBQnRBMnp2TlpDc1l1STMwNzFNRXQ3RnZMLTM4UnhuYmZNTDlLbnRtUVJLd2J1OWJSZUVkWjNZVmJabUxDWW1GaDRZMWRRckNFMTE2UUFLaXNaNw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 May 2024 07:00:00 GMT",
        "title": "Crypto Prices Today May 1: Bitcoin & Ethereum Crash 5%, Cosmos Gleams Amid Market Dip - CoinGape",
        "content": "The top crypto prices today crashed heavily as the Bitcoin (BTC) price plunged to the $60,000 level despite the recent Hong Kong ETF launch. In addition, the Ethereum (ETH) price plummeted below the $3,000 mark, losing hold on a crucial level. Moreover, other top altcoins, such as Solana (SOL), XRP, Cardano (ADA) plunged notably, mirroring the bearish trend.\n\nMajor Crypto Prices Today\n\n1. Bitcoin Price\n\nThe Bitcoin price crashed by 5.13% reaching $60,191.06 at the time of writing on Wednesday, May 1. On the other hand, it’s trading volume spiked 41.71% to $37.91 billion in the last 24 hours. Whilst, the crypto’s market capitalization slipped to $1.18 trillion.\n\n2. Ethereum Price\n\nThe Ethereum price tumbled 5.46% to $2,999.10 at press time with a market valuation of $365.74 billion. Whilst, ETH saw its trading volume surge 29.66%, reaching $17.99 billion.\n\n3. Solana Price\n\nThe Solana price extended below the $130 mark today. The Solana price lost 7.06%, settling at $126.06. In contrast, SOL witnessed a 42.20% surge in trade volume to $3.48 billion in the last 24 hours.\n\n4. DarkLume (DLUME)\n\nDarkLume is a gamified socioeconomic system that runs in a virtual world. It offers a distinct blend of fantasy and social interaction. DarkLume enables users to become citizens of virtual countries by participating in recreational activities. It serves as a platform for interaction in a dynamic social ecosystem. To reinvent luxury living and entertainment in the digital age, catering solely to the needs and preferences of modern societies.\n\nThe token is currently running a presale for 40000000000 DLUME tokens. It has already raised $25,033 at $0.0005. The next price is expected to be $0.00060, while the listing price might be $0.0015. These price estimates are entirely situational and subject to change as presale activity increases.\n\n5. XRP Price\n\nWhilst, the XRP price inched closer to drop below the $0.50 level amid the broader market crash. The XRP price recorded a slump of 2.66%, reaching $0.5026. On the other hand, XRP’s trading volume soared 24.41% to $1.36 billion.\n\n6. Cardano Price\n\nMeanwhile, the Cardano crypto price slipped 2.96% to $0.442 today. Whilst, ADA recorded a hike of 40.13% in its 24-hour trading volume, settling at $416.32 million.\n\n7. Dogecoin & Shiba Inu Price\n\nThe Dogecoin price crashed by 7.29% to $0.1324 while its rival, Shiba Inu price tumbled 7.57% and traded at $0.00002215.\n\nAlso Read: How Will Bitcoin Price React To FOMC Meeting?\n\nTop Crypto Gainers Today\n\nCosmos (ATM): The Cosmos crypto surged 5.43% and traded at $8.56.\n\nThe Cosmos crypto surged 5.43% and traded at $8.56. Optimism (OP): The OP crypto price rallied 2.52% to $2.58.\n\nThe OP crypto price rallied 2.52% to $2.58. Starknet (STRK): The Starknet crypto price was up 2.22% and was valued at $1.24.\n\nThe Starknet crypto price was up 2.22% and was valued at $1.24. Tron (TRX): The TRX crypto price rose 0.45% to $0.1201.\n\nTop Crypto Losers Today\n\nArweave (AR): The AR price plummeted 17.25% to $29.74.\n\nThe AR price plummeted 17.25% to $29.74. Stacks (STX): The STX price plunged 15.01% to $2.04.\n\nThe STX price plunged 15.01% to $2.04. Sei (SEI): The Sei price witnessed a dip of 11.75% to $0.542.\n\nThe Sei price witnessed a dip of 11.75% to $0.542. Lido DAO (LDO): The LDO crypto slumped 11.43% to $1.90.\n\nDue to the sudden bearish trend, none other crypto made it to the top gainers list. Moreover, millions worth of crypto liquidations were noted in the past 24 hours, which could have catalyzed the latest crash. According to Coinglass, Bitcoin alone witnessed $107.64 million liquidations in the last 24 hours. Out of this $93.26 million has been attributed to longs.\n\nAlso Read: Here’s Why Pepe Coin Price Sees a 20% Breakout Rally in May\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    }
]