[
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxOTTZRVEtSVS00R0dFSEtHb3VaUGExRURRajl2SVd5V0RtTzVHeEwtdzRob0UyOWRtYldDaGE5X3ZnYkdXNmdsU2N0YmdHMGd0MnVXZTdReEFQWkRZVWtnTHJXUV8zZElOWm16RXI2NEN4WjZxTjRHSnhmNDg1WXU2NDExVUpXVGpXc0tEZVV6Ti1fYmR2WThwZmd3QUVwaFd4M1hoTE5LSS1DbUZ5Y1FlQVBpV2dSOEw1SjhPOEU1MTNTZ9IBxwFBVV95cUxNRVpSQWxmeXpXV002QkloMWY2M3hvLXJWSjFzRmRGdHVRNkZKWHF1SXItZGRGSVYwanlXdzRQSFBYcDBoOUNSQzFaSUhzN1ZNOHFhbkh6Sm1RNjk3RFZnMUlza1NpSnRRSDd4eERzLVo5WVFuNkRoN0hRNnNxc1ZZSmo5T1BnMjlwQTRNRV9ybUtZVFFjTEhfNFVfNHpFTm9TczJHWlV1cEg4Nlk3VmZMMkhfaUplemo2RWMwM3dHZS1zVzg4b3NF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jan 2024 08:00:00 GMT",
        "title": "Ethereum price could target $3,000 with ETH whales buying the dip - FXStreet",
        "content": "Ethereum price has shown interest in a recovery rally, trading around $2,244.\n\nA spike in whale transaction count suggests investors could be buying the dip.\n\nOn-chain metrics hint at little to no resistance up to $2,800.\n\nA flip of the $2,145 level into the resistance level will invalidate the bullish thesis.\n\nEthereum (ETH) price is attempting a recovery bounce that could kickstart a run-up to new yearly highs. Supporting on-chain and technical indicators add credence to this bullish ETH outlook.\n\nAlso read: Institutions’ interest in crypto grew by 176% in 2023 but seems to be waning ahead of Bitcoin ETF\n\nEthereum price ready to move higher\n\nEthereum price slipped low as $2,100 on January 3 after Matrixport’s ETF-rejection post. But ETH, like many other cryptocurrencies, recovered quickly. Ether currently trades at $2,244, forecasting a potentially explosive move to the upside.\n\nThe Relative Strength Index (RSI) hovers around 42 after its recovery from the oversold region a few days ago. A higher low formation could indicate a slow but steadily gaining upward momentum.\n\nThe Awesome Oscillator (AO) is much more optimistic than the RSI, which shows a decline in bearish momentum as the indicator approaches the zero line. A flip of the mean level would indicate that the bullish momentum is in play and could push Ethereum price higher.\n\nIn such a case, if Ethereum price flips the $2,300 hurdle into a support floor, it could move higher and retest the $2,400 barrier. In a highly bullish case, ETH could tag the 161.8% Fibonacci level at $2,562 and also the monthly resistance level at $2,652.\n\nRead more: Ethereum price could make a recovery as ETH supply on exchanges hits an all-time low\n\nETH/USDT 1-day chart\n\nThe bullish Ethereum price outlook is supported by the spike in Whale Transaction Count and Volume on January 3. According to Santiment’s data, this uptick occurred on the day of a massive sell-off, which is a sign of investors buying the dip.\n\nSince whale-transaction count tracks transfers worth $100,000 or more, this uptick has a high chance of being a buy-the-dip move from institutional investors. Considering that the volume coincides with this uptick adds even more credence to the bullish outlook.\n\nETH whale transaction count, volume\n\nFurthermore, IntoTheBlock’s Global In/Out of the Money (GIOM) indicator shows that the immediate key hurdle at $2,347 is relatively weak. Hence, overcoming this blockade could send ETH to the next critical level of $2,859. Here, roughly 10.77 million addresses that accumulated 5.2 million Ether are sitting at a loss.\n\nTherefore, a potential move into this hurdle could see a considerable spike in selling pressure from these holders trying to break even.\n\nETH GIOM\n\nOn the other hand, if Ethereum price flips the range low of $2,144, it will create a lower low and invalidate the bullish thesis. In such a case, ETH could slide 6.50% and revisit the $2,000 psychological level.\n\nAlso read: Following spot Bitcoin ETF applicants, SEC holds meetings with NYSE, NASDAQ and other exchanges"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxOMnpPV21uNTlDWks4ajh3ZXN0TnlwdkNmaUpUTWx6Wm1zYnZPa1Rkamx2cWxoTGREOXF2UmJCTXppZXJDbkpBTkFhYWZvUWRScEFnOVRwdFNyQktaUDJqdHAtTUNPNEJkTzRGM2cyV0Rmd0xwTUJtOGpLTTEteDRhVUQydzNlX0FPNUY3WVVXQW5lVU11TF9BYndkZmpzUV9KZ2o5aGhodndVclVZWUFDYWRUZ0I?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jan 2024 08:00:00 GMT",
        "title": "Arbitrum Takes Lead in Daily DEX Volume for First Time, Surpassing Ethereum and Solana - Unchained",
        "content": "The surge in Arbitrum’s daily volume likely stems from the upcoming Ethereum upgrade dubbed Dencun, not the memecoin frenzy experienced by other blockchain networks.\n\nArbitrum, a layer 2 scaling solution for Ethereum, has taken the lead in daily volume on decentralized exchanges (DEX) for the first time in Arbitrum’s history, according to the most recent data from crypto analytics firm DefiLlama.\n\nOver the past 24 hours, the total value of transactions made on Arbitrum by crypto users stands at $1.83 billion, taking the lead from base layer blockchain Ethereum, which has a 24-hour volume of $1.44 billion. In fact, the combined 24-hour volume of Solana, Binance Smart Chain, Polygon, Avalanche, Optimism and zkSync Era is less than that of Arbitrum.\n\n\n\nThe historical leader in 24-hour volume has been Ethereum, though its seat on the throne has been challenged recently. Solana, a layer 1 blockchain that implements proof-of-history, surpassed Ethereum’s daily DEX volume for several days in December 2023. Now, less than a month later, Arbitrum has taken the lead.\n\n“It’s not an easy feat, there’s a lot of chains and not many have been able to do that, even if it’s just temporarily,” said Martin Lee, content lead at on-chain metrics firm Nansen, to Unchained via Telegram. “While it’s an impressive achievement, ideally, I’d want to see this trend continue over a longer time horizon before putting any weight behind it. We’ve seen moments where chains get massive spikes in activity but few manage to maintain it.”\n\nDencun’s Impact\n\nThe spike in Arbitrum’s volume likely stems from the upcoming Ethereum upgrade known as Dencun, Lee noted. Set to be activated on several testnets this month, Dencun is the first major upgrade to Ethereum since Shapella in April of last year, which enabled stakers to withdraw their ETH. The newest upgrade includes EIP-4844, also known as proto-danksharding, which is designed to scale Ethereum in a decentralized way.\n\n“Proto-danksharding reduces the cost of posting large amounts of data to Ethereum and thereby lowers the operational cost of rollups,” wrote Galaxy’s vice president of research Christine Kim in a research report last June. “EIP 4844 is considered a boost to Ethereum scalability because it makes Layer-2 networks built atop Ethereum more cost-effective,” the report said.\n\nIn addition, Carlos Mercado, data scientist at blockchain data firm Flipside Crypto told Unchained over Telegram that “Arbitrum over the last few weeks has been preparing for Arbitrum Orbit, their competitor to the Optimism ‘Superchain’ thesis,” a network of chains that all share Optimism’s open-source development stack.\n\nNotably, the surge in Arbitrum’s daily DEX volume is not from the recent memecoin frenzy that has gone viral on other Layer-1 networks such as Bitcoin, Solana, and Avalanche. Memecoins “never took off” on Arbitrum, according to Nansen’s Lee.\n\nARB, the native governance token for the Arbitrum ecosystem, has slid roughly 11% in the past 24 hours, but has gained nearly 27% in the past seven days to change hands at $1.86, according to CoinGecko.\n\nDisclosure: Arbitrum is a sponsor of Unchained."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxNN0JZM0piOG0xWUktaXNCOGtqSnlJQk9iUDJsZWVuWE5CTzZBZEpOQllPMEhhR0tadU5ybEhCWTNaNkMyT0U1dG5rQUJxX2xpNE5nNHV2RktHM0dOQ05UTlF5ZUUycVN3eUhOM3RsQ0ZQdjV5emdyT1p0enNaMC1FN25TRTgyNmJmR3BCVExzSkVSaXli?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jan 2024 08:00:00 GMT",
        "title": "Will Ethereum hit $10k in 2024 or is this altcoin a better alternative? - crypto.news",
        "content": "Disclosure: This article does not represent investment advice. The content and materials featured on this page are for educational purposes only.\n\nWith market conditions trending higher, many speculators are contemplating whether Ethereum (ETH) could hit $10,000 in 2024. Currently, it is trading at $2,254, up 2.9% this month and 81% year-to-date. However, some analysts are backing Bitcoin Minetrix after its presale hits $7.5 million.\n\nAnalysts bullish on Ethereum\n\nGiven Ethereum’s trajectory in the last bull run, market participants are eagerly anticipating for the coin to hit $10k, hoping it comes in the early stages of the upcoming bull market rally.\n\nYou might also like: Ethereum suffered highest losses due to rug pulls and hacks, data shows\n\nFollowing the last Bitcoin halving, Ethereum rose from $200 to over $1,200.\n\nIf the same growth applies, ETH may soar above $13K by the end of 2024.\n\nEven so, several variables are at play, mainly Ethereum’s significantly higher market cap of $272 billion.\n\nAs such, it is not as simple as using past data to determine future results. However, several analysts have weighed in on this possibility in 2024.\n\nGeoff Kendrick, head of FX Research, West, and Digital Assets Research at Standard Chartered Bank, believes the coin could be headed to $4,000 by the end of 2024.\n\nThe analyst referenced the Bitcoin halving, speculating it “should lift all boats.”\n\nMeanwhile, X commentator icircle_nft recently said ETH will rally to $5K by the end of 2024.\n\nhttps://twitter.com/icircle_nft/status/1741776096969077001?s=20\n\nHowever, the analyst has higher hopes for ETH in 2025, forecasting it will reach $18K.\n\nMeanwhile, FieryTrading said the coin is trading inside a rising wedge pattern and may reach $16K by the end of 2025.\n\nThat said, analyst CrediBULL Crypto is even more optimistic, speculating Ethereum could reach highs of $20K or a minimum of $10K by the end of 2024.\n\nUltimately, whether Ethereum will underperform, equal, or outperform its last market cycle remains to be seen. While most analysts are bullish, there are many opinions on where it could be headed.\n\nThough many analysts expect Ethereum to outperform in 2024, some are more bullish on Bitcoin Minetrix after raising $7.5 million in the ongoing presale.\n\nBitcoin Minetrix raises $7.5 million in presale: what’s next?\n\nBitcoin Minetrix allows users to earn passive BTC rewards by staking on Ethereum.\n\nThe project is a cloud mining solution where users can stake BTCMTX for Bitcoin mining credits.\n\nThey can then burn these credits on the Bitcoin Minetrix platform for cloud mining power, receiving Bitcoin.\n\nThis use case requires no hardware or technical know-how from users, making it ideal for beginners.\n\nAnother benefit is that the decentralized and transparent BTCMTX eradicates the risk of cloud mining scams.\n\nOther advantages include no space or noise constraints on the user and it offers a more eco-friendly way to mine Bitcoin.\n\nThese benefits seem to be supporting the project in the ongoing presale which has raised $7.5 million so far.\n\nFor what it offers, an analyst, Jacob Bury, says BTCMTX is set for more gains after launching."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxPUmhHY2s4Z0gzS3BMLTM4NERKODcwdG1rTFFLNzJVMkN2VTQtSGwxbU1DWDhZNDVWejJ1RmV3Tm1IUzJvY1YxMl9uUGQ5ZHB6X0FNLUpoeUZNX2VlS3Z1NFA0aXBuRE11RmVoTnVWTzdBZE4zN01obU9MOGdKRFEwMmM5ZjZVX1ZlNjRqSnBfRUdtc1M2UmtJ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Once Looked Unstoppable. But It's 1 Crypto I'm Avoiding in 2024 - The Motley Fool",
        "content": "Is it time to rethink the future growth prospects of Ethereum?\n\nHeading into 2023, Ethereum (ETH 0.12%) looked unstoppable. Ethereum had just pulled off The Merge, which was often cited as one of the greatest technical accomplishments of 2022. As a result of The Merge, which made the entire network much less energy intensive, Ethereum appeared to be well positioned to continue its dominance in just about every meaningful niche of the blockchain world.\n\nHowever, since August 2022 -- one month before The Merge -- Ethereum is only up 10%, at a time when other cryptos posted stellar triple-digit returns in 2023. From my perspective, Ethereum suddenly looks very vulnerable, which is why it's one crypto I'm avoiding in 2024. Let's take a closer look.\n\nNew strategic roadmap\n\nEthereum just released its new strategic roadmap for 2024, and I'm not impressed. Even Ethereum co-founder Vitalik Buterin acknowledges that there are only minor changes planned for the year ahead. The primary focus is on resolving some of the blockchain design problems that resulted from The Merge. Fair enough -- it's probably expecting too much from Ethereum to come up with a wildly new strategic roadmap after a breakthrough achievement like The Merge.\n\nHowever, what concerns me is that some of the initial grand strategic goals of The Merge keep getting scaled back. For example, at one time Ethereum promised a total throughput speed of 1 million transactions per second. That has now been scaled back to 100,000. And according to Ethereum's own strategic roadmap, that goal probably won't be achievable in its current stage of development. Meanwhile, rival blockchain Solana (SOL -1.77%) says it already has the ability to handle 65,000 transactions per second.\n\nOn top of all that, Buterin seems to be backing away from what he refers to as the \"financialization\" of Ethereum's blockchain. Simply put, this term means the mainstreaming of Ethereum's blockchain for Wall Street institutions, ensuring that the blockchain's architecture makes sense for the modern financial world. If you're a long-term investor, that's exactly what you want to see, because it would be huge for Ethereum's future growth prospects.\n\nHowever, Buterin now seems to be leaning into what he calls a \"cypherpunk\" (a mashup of \"cyberpunk\" and \"cipher\") approach to blockchain development to recapture some of the early mystique of crypto. Kudos to Buterin for staying true to his original vision for the blockchain. But as a cold-hearted investor, I find that somewhat worrisome. Are top Wall Street firms really going to partner with a bunch of cyberpunks?\n\nRise of new competitors\n\nBy itself, a less-than-compelling strategic roadmap would not be enough to get me off Ethereum. I mean, really, this is Ethereum we're talking about. This is a blockchain that has a strong track record dating back to 2015. Ethereum's Buterin has been featured on the cover of TIME magazine as \"the prince of crypto,\" and it's hard not to think of him as one of the brightest minds of our generation.\n\nHowever, take a step back and consider the overall competitive landscape. One of the primary reasons for investing in Ethereum has always been the fact that it is a best-in-class blockchain, with an obvious dominant market share in key blockchain niches. But now there are several very credible competitors all nipping at the heels of Ethereum. Right now, three of the top 10 cryptocurrencies by market cap -- Solana, Avalanche (AVAX -1.74%), and Cardano (ADA -2.47%) -- are direct competitors to Ethereum.\n\nMoreover, all three of these competitors now appear to be growing faster than Ethereum, especially Solana. At the end of 2022, for example, Solana started to eclipse Ethereum in terms of NFT trading volume and decentralized exchange (DEX) trading volume. And institutional investors really appear to be buying into the argument that Solana is a faster, more cost-efficient version of Ethereum. For example, Cathie Wood of Ark Invest recently appeared on CNBC, talking up the merits of Solana.\n\nHow can Ethereum get its mojo back?\n\nRight now, I'm not adding to my Ethereum position until it moves out of The Merge stage of development and into what the crypto's leaders have dubbed \"The Surge\" stage of development. To me, the remainder of The Merge stage is filled with a bunch of wonky technical improvements that aren't truly disruptive in nature. In contrast, The Surge is when Ethereum is supposed to hit that 100,000 transactions per second threshold. That's exciting, because even a world-class payment network like Visa, Inc. (V 1.28%) can't deliver that type of throughput.\n\nAt the same time, I'll be watching to see how well Ethereum preserves its market-leading position in key blockchain niches. If Ethereum can show that it is fending off rival blockchains such as Solana, then I will be much more inclined to restore my bullish outlook for Ethereum."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiX0FVX3lxTE1VVXR3U1BKY0ZuTG1CR3N5RVBQNTJkOXRCbGpqdEhuT3NvckxaWHhLSzNiclVhc1NXLVdCQjR3bjRidlJaUDItd3lBeG03MWRja3VYa2JDWXpPVnlja2tz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jan 2024 08:00:00 GMT",
        "title": "Dencun and Pralectra: Ethereum core devs chart an ambitious 2024 - Blockworks",
        "content": "Ethereum’s core developers are debating the priorities for the next hard fork after “Dencun,” which could come in late 2024 or 2025.\n\nFollowing Thursday’s All Core Devs call, the tentative schedule for the Dencun fork remains unchanged, with the Goerli testnet first up on Jan. 17.\n\nLoading Tweet..\n\nWith the rollout of the upgrade looking likely in March, developers are turning attention to what comes next in Prague-Electra — Pralectra for short — the upgrade to follow.\n\nStill very much in flux, a debate is in progress on the overall vision: Either a feature-focused set of smaller Ethereum Improvement Proposals (EIPs) or a major protocol upgrade to introduce Verkle Trees to the execution layer.\n\nVerkle Trees are a new data structure that evolve the current Merkle Tree in use today, using more sophisticated mathematical techniques — vector commitments based on elliptic curve pairings, which are a significant departure from the simpler hash functions used in Merkle Trees, according to verkle.info.\n\nThis structure uses less space and can be verified faster, both of which allow the network to handle more transactions.\n\nIn short, it’s a way to deal with the long-term problem of “state bloat,” which will be increasingly important as Ethereum scales.\n\nThe upgrade is a key milestone on Ethereum’s long-term roadmap, a phase referred to as The Verge.\n\nThere was no clear consensus on the call — some advocate for keeping the focus squarely on Verkle Trees, with Guillaume Ballet at the Ethereum Foundation warning “there’s no such thing as a small fork,” but others calling for a firm commitment to upgrade the network again in 2024.\n\nThe fear is that Verkle Trees could take 18 months or more to deliver — an eternity in crypto.\n\nDencun itself was originally slated for November, but was finally pushed into 2024 last october.\n\nRead more: Core devs rule out Dencun fork this year\n\n“Verkle is on the scale of the Merge if not worse in terms of complexity,” Ballet said. “You cannot really ship anything at the same time on the [execution layer] side.”\n\nLukasz Rozmej of the Nethermind execution client team agreed, recommending the developers prioritize a feature-rich fork first before turning fully to Verkle Trees.\n\n“My experience tells me that state redesigns are extremely hard and they take an extremely long time,” he told colleagues on the call. “Verkle toughness is not the specification, it is the implementation, optimization and testing.”\n\nFeatures, yes, but which ones?\n\nAmong those advocating for a second 2024 fork focusing on features were client teams for Nethermind, Besu and Reth. But the question is what takes precedence?\n\nAndrew Ashikhmin, software engineer on the Erigon client team, suggested that the EVM Object Format (EOF) would be one candidate to drive the next upgrade without distracting from longer-term work on Verkle Trees, because it could be implemented by a smaller team, and was a more isolated change to the code base.\n\n“But Verkle should be the main focus,” he said.\n\nEOF was originally considered for the Shapella hard fork, but was considered too big to be paired as a “passenger” alongside the main “driver,” Proto-Dank sharding or EIP-4844.\n\nRead more: Ethereum’s Next Upgrade To Focus on Blobs\n\nEOF is “definitely not a passenger” according to Justin Florentine, protocol engineer on the Besu client team, but he said that Besu had already made “a lot of progress” on the feature, and therefore was in favor of its adoption in Pralectra\n\nGeorgios Konstantopoulos, chief technology officer and researcher at investment firm Paradigm, which is building the Rust Ethereum (Reth) client, said his team was “OK [with] EOF as it’s [a] one man job and [needs] isolated testing.”\n\nBut Ethereum Foundation developer Marius van der Wijden shared the opinion that “EOF is not going to be in the small fork.”\n\nAnsgar Dietrichs at the Ethereum Foundation supported EOF for inclusion in Pralectra last April, and noted on Thursday’s call that the Solidity team — maintaining the EVM’s main smart contract programing language — was strongly in favor.\n\nNo one on the call was there to explicitly advocate for EOF, however, prompting Nethermind founder Tomasz Stanczak to remark, ”if nobody champions EOF on this call this would summarize why it has not been shipped yet.”\n\nStanczak called EIP-7002 or “Execution layer triggerable exits” the most upvoted EIP in the Ethereum Magicians forum and “super important,” because it fixes a “major design bug with staking [and] cannot come early enough.”\n\nFellow core developer Parithosh Jayanthi, known by the nickname “Potuz” said if he had to choose one feature to ship it would be EIP-7002. However, in his view, EIP-7549 “should definitely be in.”\n\nThis feature, which only affects the consensus layer, fixes a bug in Ethereum’s design and aims to reduce the average number of pairings needed to verify consensus rules. A pairing is an operation used in certain cryptographic algorithms involving elliptic curves.\n\nCurrently, to reach consensus it’s necessary to verify a minimum of 1366 attestations — indicating agreement between validators — but after EIP-7549 it would be reduced to just 22.\n\n“It’s trivial to implement and it’ll save a lot of aggregation time,” Potus said. “It can help on trustless bridges — and zk-provers, zk-bridges — it’s something that should definitely be in whatever fork we do next.”\n\nThe goal of the call was to kickstart discussion, and the specific approach and improvement proposals will be decided at a later date. Ethereum upgrades are consensus-driven; there is no explicit hierarchy of authority, or voting mechanism to determine priorities.\n\nIt can at times appear challenging or chaotic to make progress, not unlike herding cats, but that’s the nature of the decentralized beast.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    }
]