[
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOaTJjWUJ5aXFQX2lrWGlKRFRlRWwtbXVoQ0lPaHRXWUl1R0NLcXNkYk1IZ2pzd25DTE80UUZEZjUtb21NaDhmM2ppZF9jdURYNnM2TWFfVXV6dFdJZFIySXFOQ3A4cGJ6Q1lJWFVZQ3BzVGYwUVBMS2taem5GQnd5eUJJc2E3THNjcVF0T3g1ONIBlwFBVV95cUxOYnBaTkdYNDZJTEN4Y1hNWTZJTlBLZmtrWTg0TlNkRS1BZEo2SlZ5Z19JZEhpZk5BYlFra0RoamNoVHJ5cTlBcEJhNmN0RWoyM0ZhTVNfd3B6UXY0TjBoMlJxN3dubjFpUktXRFU1WXZnN3JaV3pOTnRqWXVhak1FNFdqOVVqTVc2Z2FOQi1zdG53R3AxZWJn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 27 Jan 2024 08:00:00 GMT",
        "title": "This Week in Coins: Bitcoin and Ethereum Dip, Bitcoin Recovers - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIllustration by Mitchell Preffer for Decrypt.\n\nBitcoin (BTC) had depressing week after the historic approval and trading of several crypto exchange-traded funds (ETFs).\n\nThe largest cryptocurrency by market cap plunged hard on Monday following a sell-off from digital asset fund manager Grayscale. The virtual coin dropped below $40,000 (to $38,678) on Tuesday, but slowly recovered as the week went on.\n\nIt is now trading for $41,830, CoinGecko data shows, a less than 1% movement over seven days.\n\nAD\n\nAD\n\nBefore Grayscale’s Bitcoin ETF started trading, it had operated like a closed-end fund where investors could not redeem their shares for BTC. However, following its conversion and subsequent trading, investors started to cash out quickly.\n\nThis led Grayscale to send huge amounts of the cryptocurrency to its custodian, Coinbase, leading to pressure on BTC’s price.\n\nGrayscale’s sell-off slowed towards the end of the week—likely leading to the rebound in BTC’s price.\n\nIt’s not all bad news, though: Analysts told Decrypt that Bitcoin “could see increased appeal” in 2024—if the Federal Reserve slashes interest rates.\n\nBut BTC’s plunge in the week hit the wider crypto market. Ethereum (ETH) was a big loser, dropping to $2,186 on Tuesday and never really recovering, logging an 8% loss over the week. It’s now trading for $2,264.\n\nAD\n\nAD\n\nIts drop came following the U.S. Securities and Exchange Commission’s decision to delay ETH ETF proposals from both BlackRock and Grayscale.\n\nElsewhere, Solana (SOL) took a beating. It was, at the start of the week, one of the worst-performing cryptocurrencies. It has since picked up and is trading for $92.60, a more than 1% seven-day rise.\n\nWhile Dogecoin (DOGE)—the original meme coin and 11th biggest cryptocurrency—pumped at the start of the week over speculation that it might be used for payments on Twitter, it slowly drifted back to where it started. It kicked off the week at $0.08, and is back at the same spot as of writing.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOaTJjWUJ5aXFQX2lrWGlKRFRlRWwtbXVoQ0lPaHRXWUl1R0NLcXNkYk1IZ2pzd25DTE80UUZEZjUtb21NaDhmM2ppZF9jdURYNnM2TWFfVXV6dFdJZFIySXFOQ3A4cGJ6Q1lJWFVZQ3BzVGYwUVBMS2taem5GQnd5eUJJc2E3THNjcVF0T3g1ONIBlwFBVV95cUxOYnBaTkdYNDZJTEN4Y1hNWTZJTlBLZmtrWTg0TlNkRS1BZEo2SlZ5Z19JZEhpZk5BYlFra0RoamNoVHJ5cTlBcEJhNmN0RWoyM0ZhTVNfd3B6UXY0TjBoMlJxN3dubjFpUktXRFU1WXZnN3JaV3pOTnRqWXVhak1FNFdqOVVqTVc2Z2FOQi1zdG53R3AxZWJn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 27 Jan 2024 08:00:00 GMT",
        "title": "This Week in Coins: Bitcoin and Ethereum Dip, Bitcoin Recovers - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIllustration by Mitchell Preffer for Decrypt.\n\nBitcoin (BTC) had depressing week after the historic approval and trading of several crypto exchange-traded funds (ETFs).\n\nThe largest cryptocurrency by market cap plunged hard on Monday following a sell-off from digital asset fund manager Grayscale. The virtual coin dropped below $40,000 (to $38,678) on Tuesday, but slowly recovered as the week went on.\n\nIt is now trading for $41,830, CoinGecko data shows, a less than 1% movement over seven days.\n\nAD\n\nAD\n\nBefore Grayscale’s Bitcoin ETF started trading, it had operated like a closed-end fund where investors could not redeem their shares for BTC. However, following its conversion and subsequent trading, investors started to cash out quickly.\n\nThis led Grayscale to send huge amounts of the cryptocurrency to its custodian, Coinbase, leading to pressure on BTC’s price.\n\nGrayscale’s sell-off slowed towards the end of the week—likely leading to the rebound in BTC’s price.\n\nIt’s not all bad news, though: Analysts told Decrypt that Bitcoin “could see increased appeal” in 2024—if the Federal Reserve slashes interest rates.\n\nBut BTC’s plunge in the week hit the wider crypto market. Ethereum (ETH) was a big loser, dropping to $2,186 on Tuesday and never really recovering, logging an 8% loss over the week. It’s now trading for $2,264.\n\nAD\n\nAD\n\nIts drop came following the U.S. Securities and Exchange Commission’s decision to delay ETH ETF proposals from both BlackRock and Grayscale.\n\nElsewhere, Solana (SOL) took a beating. It was, at the start of the week, one of the worst-performing cryptocurrencies. It has since picked up and is trading for $92.60, a more than 1% seven-day rise.\n\nWhile Dogecoin (DOGE)—the original meme coin and 11th biggest cryptocurrency—pumped at the start of the week over speculation that it might be used for payments on Twitter, it slowly drifted back to where it started. It kicked off the week at $0.08, and is back at the same spot as of writing.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxNYjMzOHBZS0lKTzZQWkRpOVlQYU56R2hDcEEzQXpCbDVUT0dRQ0kydTZPYnFZUzQzSXlQLWxNNng5RXI0NURIN1N1VEpHa1V1eGF3ejE4Q0tNRmNKc1A5V01Idl9pQ3JKV3NkU1h3WGxHWlM1NlphM1ZNV3UxdjhlZWsxRDNHZ25m?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 27 Jan 2024 08:00:00 GMT",
        "title": "Ethereum sell-off alert: Here’s what to watch for ETH/BTC pair - Finbold - Finance in Bold",
        "content": "Ethereum (ETH) performance against Bitcoin (BTC) is a leading indicator of market cycles and an altseason. Thus, cryptocurrency traders and investors constantly monitor the ETH/BTC pair for valuable insights.\n\nIn particular, the well-known CrediBULL Crypto has his eyes turned to this pair and warns of a possible Ethereum sell-off. According to him, Ethereum has found a local top against Bitcoin in an expected deviation above previous highs.\n\nCrediBULL Crypto posted this analysis on X (formerly Twitter) on January 25, quoting a previous post where he forecasted the deviation, as happened.\n\nBoom. Beautiful rejection on ETH/BTC as expected. May revisit those local highs but imo a full retrace of ETH/BTC is on the horizon as $BTC recovers from this recent correction and begins it's next impulsive move to the upside, outperforming ETH once again.\n\n\n\nAs I have said before… https://t.co/HllnRI4Pee pic.twitter.com/uiOqcVvRBO — CrediBULL Crypto (@CredibleCrypto) January 25, 2024\n\nETH/BTC analysis\n\nNotably, the trader points to a breakout from the current support line at 0.04905 BTC per Ethereum. Furthermore, ETH/BTC should continue its downfall through 0.04624 BTC straight to a range below 0.03800 BTC.\n\nETH/BTC daily price chart. Source: CrediBULL Crypto\n\nCrediBULL Crypto explained ETH/BTC will only find a bottom once Bitcoin makes a new all-time high. Therefore, investors must be aware of “any bounces before that,” as they will most likely fade away, in his words.\n\nSince posting, Bitcoin has already outperformed Ethereum by around 2%, validating the above analysis. However, the economic context is a key factor to consider. Moreover, the cryptocurrency market is unpredictable, and everything could change swiftly.\n\nOn the other hand, institutional investors are turning to Ethereum and showing support for altcoins and tokenization. Recently, Franklin Templeton backed ETH, SOL, and other cryptocurrencies focused on utility. In the meantime, BlackRock’s CEO shared his vision of tokenization while talking about an expected Ethereum spot ETF approval.\n\nAll things considered, it is possible that the ETH/BTC pair surprise technical analysts in the near future, depending on further developments involving institutions and the regulatory landscape. Investors must trade cautiously, keeping themselves updated on the adoption and demand for Ethereum or Bitcoin.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxPYUt1VldXSGJmQ0FmREd3aU9xWUNsWEtZZkJ3OGYtcE9rRkZXNElQbXVvYXdCazhwajVqZ0h1TnQwY2t6c3dtWUg5VE1fQkFXUm82TGJqemZOU1BYcGNHYVhUV0tqZTh3Wjl0MjZfNEswSDRyVU9CdExGN0FZYmVXQkhEbjRfV0NmRTF0MUx6OUpXVlBDeWtZd1VFaXFab3JyaE9DS3pOYzZESkFVRnZJSdIBtgFBVV95cUxNc0dicHVWbmVmaF9IdUJlWmlfX2p2NXdKQ011eFFsdVo2T0tRR0tMQW1MVnB6ZWsxU2lfdFQwY2I2VVJwUmhVbHZKaEhZUkUtYmtfYXZyXzh3WHJkRk4tNkY4elJqaWpKeHBKRDU0WjZGbERXTEF1TXd6TTZCakZEV1pIWXoyRVhCdHBOa0ZLSFEtZ01SS3R1QUhRRzRTUHpVWERubTlQMW9UZEVEZFhjVVhGR1EyUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 27 Jan 2024 08:00:00 GMT",
        "title": "XRP Starts Moving Earlier, Solana (SOL) Already Stronger Than Everyone Else; Does Ethereum (ETH) Need More Fuel? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nXRP appears to have begun its market movements earlier than anticipated. The chart shows a notable shift from the recent sideways trading pattern, as XRP starts to carve out a new direction.\n\nAs of the latest trends, XRP has been testing the support level around $0.50, a crucial psychological threshold for the asset. A sustained move below this level could signal further bearish momentum, potentially leading the price to test the next significant support zone around $0.47.\n\nOn the flip side, if XRP manages to stabilize and bounce back from the current support, the initial resistance is likely to be encountered near the $0.54 mark, where the 50-day moving average currently lies. This moving average has historically acted as a dynamic resistance level, and a breakout above could propel XRP toward the $0.56 level, which aligns with the 100-day moving average.\n\nFurther complicating the chart is the downward trendline that has been in play since the local high established in November. This trendline has repeatedly acted as resistance, pushing the price downward each time it has been tested. For a true reversal to be confirmed, XRP would need to break above this trendline with significant volume to validate the move.\n\nAdvertisement\n\nSolana is leading pack\n\nSolana is manifesting its strength as the top performer among the top 10 cryptocurrencies by market capitalization. Despite overall market volatility, SOL's price action has been signaling a stronger recovery compared to other assets.\n\nAt the time of analysis, Solana is trading around the $90 mark, having rebounded with considerable momentum from the support level near $78.35. This pivotal point, bolstered by the 100-day Exponential Moving Average (EMA), has served as a springboard for the recent bullish trend. The price of SOL has been consistently creating higher lows, indicative of strong buying interest at these levels.\n\nResistance for SOL is currently looming at the $100 psychological level, a breakthrough of which could propel the price toward the next significant resistance at $110.\n\nThe relative strength of Solana is further substantiated by the resurgence of a risk appetite on the market, particularly evidenced by the blossoming of meme coins. This renewed interest in higher-risk assets typically bodes well for ecosystems like Solana that support a variety of decentralized applications and niche crypto projects.\n\nEthereum needs push\n\nThe Ethereum market is currently facing a confluence of challenges as it searches for the momentum to sustain its position. A recent chart analysis reveals an indecisive atmosphere among investors, with Ethereum struggling to find a strong directional move.\n\nAt present, Ethereum is hovering around the $2,200 mark, a level that has seen significant activity and is currently acting as a temporary support. However, the lack of bullish conviction suggests that this support level may not hold if a new wave of selling pressure emerges.\n\nResistance levels are observed near the $2,400 range, where previous attempts to break higher have been met with a firm rejection, indicating a substantial barrier to upward movement.\n\nThe selling pressure is partly attributed to the recent news of Celsius Network liquidating approximately $1 billion worth of Ethereum holdings. This substantial amount has the potential to saturate the market, overwhelming current liquidity and triggering a downturn. As a result, the $2,000 psychological level is eyed as the next critical support zone, a breach of which could see a sharp decline toward the $1,950 region, where the 200-day moving average lies, providing stronger historical support.\n\nOn the flip side, if Ethereum can absorb the selling pressure and gain the necessary \"fuel,\" a push above the $2,400 resistance could open the path toward the $2,500 area before challenging the more formidable resistance at $2,600, which aligns with the 50-day moving average."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiU0FVX3lxTFBoM1pLZ1lHMFN2WnF5bk1Fa0lfTUZpR3hVWG44c3RYeTRraHVtQ1hRa19vWERkU1BvYUpzV0ZVUXJNNVBlRFpub3FxSDkwYmJ2dlZV?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 27 Jan 2024 08:00:00 GMT",
        "title": "Top 6 Ethereum Facts : All You Need To Know - CoinGape",
        "content": "Ethereum stands as a decentralized blockchain platform driven by the Ether token, offering users a versatile range of capabilities. From facilitating transactions to playing games, engaging in cryptocurrency trading, storing nonfungible tokens (NFTs) earning interest through staking, and even participating in social media activities, the platform presents a comprehensive ecosystem.\n\nMany envision Ethereum as the natural progression of the internet. While centralized platforms like Apple’s App Store embody the era of Web 2.0, Ethereum represents the dawn of Web 3.0—a decentralized, community-driven network. This new phase in internet evolution supports decentralized applications (DApps), decentralized finance (DeFi), and decentralized exchanges (DEXs). It’s crucial to note that Ether, not Ethereum, is the designated crypto unit.\n\nadvertisement\n\nNow, let’s unravel some lesser-known facts that add intriguing dimensions to the Ethereum narrative.\n\nEthereum’s Supply Dynamics\n\nUnlike Bitcoin, Ethereum takes a different stance on token supply. With over 120 million its tokens circulating, a stark contrast emerges—over ten times more tokens than Bitcoin. While Bitcoin’s value is influenced by its approaching finite supply of 21 million coins, Ethereum follows a different trajectory, emphasizing abundance over scarcity.\n\nBitcoin’s imminent scarcity pushes its value higher and poses challclassicenges to mining. The philosophy is straightforward: fewer coins available often translate to higher cryptocurrency value. Once a cryptocurrency reaches its maximum supply, mining stops, and market dynamics revolve around supply and demand.\n\nIn contrast, Ethereum doesn’t impose a fixed supply cap. Instead, it employs a mechanism called “minimum viable issuance” to manage Ether’s inflation rate, ensuring network security and motivating validators.\n\nThe platform’s issuance rate undergoes adjustments through Ethereum Improvement Proposals (EIPs) and community consensus. Diverging from Bitcoin’s fixed cap, it introduces a flexible approach, allowing for ongoing adjustments to maintain balance within the network. Notably, EIP-1559 introduces a deflationary element by burning a portion of ETH as a base fee, contributing to the evolving economic dynamics of the cryptocurrency.\n\nEthereum’s Dual Narrative\n\nThe Ethereum community faced a seismic event in 2015—the DAO hack, resulting in a substantial loss of $150 million worth of tokens. To salvage Ethereum from the brink of collapse, a consequential decision was made: a hard fork. However, a faction within the community, guided by the principle of “Code is law,” opted to adhere to the original code. This pivotal moment birthed two chains—the forked chain retaining the name Ethereum, and the original chain christened Ethereum Classic, which continues to follow the Proof-of-Work (PoW) consensus mechanism, preserving the ethos of the original code.\n\nThe Genesis: Birth and Philosophy\n\nEthereum’s beginnings trace back to 2013, involving a collective effort by eight individuals, including the visionary Vitalik Buterin, who crafted the coin (ETH) in Switzerland. With its official launch in 2015, Ethereum’s origin story bears the imprint of Buterin’s dissatisfaction with centralized services—a sentiment molded by his experiences in the world of World of Warcraft. This critical perspective formed the philosophical foundation of Ethereum, steering its path toward decentralization.\n\nIt’s crucial to avoid confusion between Ethereum and Ether. Ether, the native token, serves as a virtual coin within the Ethereum network, much like other digital currencies. Beyond being a tradable asset, Ether plays various roles—it is used for transactions, runs applications within the Ethereum network, and serves as a means to monetize activities conducted on the platform.\n\nEthereum’s move towards Proof-of-Stake\n\nIn the early days, both Bitcoin and Ethereum relied on a process called “Proof-of-Work” (PoW), where individuals could mine new tokens by validating blockchain transactions on their personal computers. However, in September 2022, Ethereum (ETH) underwent a significant transformation, moving away from PoW to embrace Proof-of-Stake.\n\nUnder PoS, new coins are created when crypto owners “stake” their own coins, essentially locking them up to participate in transaction verification and, consequently, earn rewards. While this method was already employed by Solana (SOL) and Cardano (ADA), Ether swiftly ascended to become the leading cryptocurrency in terms of staked value.\n\nThe primary motivation behind this shift lies in energy efficiency. The energy consumption associated with Ethereum transactions was staggering, equating to over 100,000 VISA transactions in December 2021. However, post the Ethereum Merge, the energy footprint notably decreased. Observers believe that this change not only influences public perceptions of cryptocurrencies but also holds implications for the future development of popular decentralized finance (DeFi) categories within Ethereum, such as crypto lending.\n\nExploring Alternatives to “Proof-of-Work”\n\nEthereum encountered a pivotal moment known as the “Split,” sparking a quest for alternatives to the traditional “Proof-of-Work” (PoW) model. As some enthusiasts applaud the reduction in energy costs, not all its formerminers welcomed the Merge, a transition away from the PoW model.\n\nIn September 2022, a revealing graphic displayed a substantial dump of Ethereum (ETH) by miners holding blockchain addresses linked to their mining activities. Expecting a price surge post-Merge, these miners were disappointed, leading to the selling of their ETH holdings.\n\nThe blockchain witnessed a surge in transaction counts, reaching approximately 1.1 million per day in September 2022. This uptick in activity coincided with the aftermath of the Merge and the subsequent dissatisfaction among miners. The dissatisfaction prompted a significant number of miners to part ways, seeking alternative cryptocurrencies for their mining endeavors.\n\nEthereum’s Crowdfunding\n\nEthereum’s inception traces back to a community-driven initiative, spearheaded by its creator, Vitalik Buterin. In 2013, Buterin conceived the idea of decentralized blockchain platform, inspired by a sense of dissatisfaction with the limitations he observed in Bitcoin. His vision extended beyond the constraints of existing blockchain technology, aiming to create a platform capable of supporting intricate and diverse applications.\n\nIn 2014, he initiated a community-backed fundraising effort, selling the initial batch of Ethereum tokens known as Ether (ETH) to the public. This crowdfunding campaign marked a significant milestone, surpassing expectations and raising over $18 million in just 42 days. Notably, this successful endeavour propelled the blockchain into the ranks of the first and largest crowdfunded projects in history.\n\nEthereum’s journey began not only as a technological innovation but as a testament to the power of community support, illustrating how collaborative efforts can pave the way for ground breaking projects in the ever-evolving landscape of blockchain technology.\n\nBonus: Ethereum’s Growing Influence in Tech Boardrooms\n\nBeyond the realm of developers and investors, Ethereum has captured the attention of major corporations. Giants like Microsoft, J.P. Morgan, Intel, and Amazon are exploring itspotential solutions. Enterprise software companies, including IBM and Deloitte, are testing the platform’s networks, signaling a broader acceptance of blockchain technology in corporate landscapes.\n\nConclusion\n\nIn the dynamic landscape of blockchain, Ethereum stands as a pioneer, symbolizing innovation, adaptability, and community-driven progress. Beyond its decentralized framework, the popular platform embodies the essence of Web 3.0, ushering in a new era of user empowerment. From token dynamics to the Proof-of-Stake transition and corporate intrigue, Ethereum’s journey reflects a dynamic intersection of technological evolution and philosophical principles. As it charts the course for decentralized possibilities, it serves as a testament to collective spirit in advancing blockchain technology."
    }
]