[
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMi2wFBVV95cUxOM1dhODZKeTM2bVAyYjg5NWlHQlU3bDkwRXJMaGpRbTlDSVdxT1h1dnRHQnpMN3ExLUREZkxKZDAwWFlXQ3ZKVE9jRVBwMUJfajZKdXZDdEN4cWo3RUV2b0ltR2VLdEY4dzU2TDZDZGdWVFN0Z2lyZjhVWHRjU0p4TGxVVGNjRkZlZ1FSQkRKMXVZV0tvSFVLb0hPUW5yTGdtYk1FeFJfR0JuY2V5d1JULVltelVtd0k1M29qeEtKOHFEYklweFhrQVA4bWlMUXJSeWtmRUFwaDM4TTjSAeABQVVfeXFMUEJSSkQ3MUdWZ0xsQUl1LXk2U28yX1pfMG90QllSRmFhb3FEcWRmbExWVlJzMWlJTmpUOXVOeHpYcWVmY0VGQ2lOeS0wM2lDN3JvRmJNTmY5TUdQYlNYcF9ENmNseVo1cnpoai1rX2RKcG53NWQxWUFWS0Q0MWxQcTlEUzUzdV9oUXhHR18wWkgxVFpodHpsT0NzdVdlVjZ1cWRBTHAtRU1UeE9EWC0wd0ZCdWU0VXBYQVc4cTR2bDZLTmt1VlhQSTlHemdNbC1aSVhiVzhZcTlGd2RsTDdfTmc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Mar 2024 07:00:00 GMT",
        "title": "Trader Says Large-Cap Ethereum Rival To Explode by Over 180% This Cycle, Updates Outlook on Floki and Chainlink - The Daily Hodl",
        "content": "A widely followed analyst and trader is offering his forecast on three crypto assets.\n\nStarting with the fifth-largest crypto asset by market cap, the analyst pseudonymously known as Inmortal tells his 209,800 followers on the social media platform X that Solana (SOL) could replicate its rival Ethereum’s (ETH) explosive rally from early 2020 to late 2021 and skyrocket by similar multiples.\n\nEthereum went up from the low of a price of just under $90 reached in March of 2020 to an all-time high price of just below $5,000 which was recorded in November of 2021.\n\nFrom the current price, Solana could go up by approximately 182% from the current level, according to Inmortal. If the fifth-largest crypto asset were to reach Inmortal’s peak-of-the-cycle target, Solana would have recorded a 60x gain from the December of 2022 low.\n\n“Previous cycle ETH went from $80 to $4,800.\n\nThis cycle SOL will go from $8 to $480.”\n\nTurning to Floki (FLOKI), Inmortal says that the memecoin is undergoing vertical accumulation, a situation where the price of an asset range-trades while gradually inching upwards.\n\nBased on the pseudonymous analyst’s chart, it appears that Inmortal is suggesting that FLOKI could fall significantly after breaking above the all-time high of slightly under $0.00034 before going on to rally in a parabolic move.\n\nFLOKI is trading at $0.000247 at time of writing.\n\nNext up is the blockchain oracle Chainlink (LINK). According to the pseudonymous analyst, LINK could be preparing for the second wave of a rally.\n\nBased on Inmortal’s chart, it appears that the analyst sees LINK rallying by around 68% from the current level to a price of $32.\n\nChainlink is trading at $19 at time of writing.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxPaWh4ZU5tcUt2d2YyNGc4SDF1Q2o0a3NyYjNmb2p6ZVhWUmpsQnBTRFZxcy1NNlBPOG5IUEROZ0tOaGRpTDZwN29FTDZmNjU4aHVQU29YMkhTM2VmY1ZhUkxqS2Vsd2VvN1M4QWI5N0hfWkFyQ0hZSm9BVzdUc1FUODZIQkJvdFF4aGNIZGpvMUgtOGdlenRmVEhGaUt1dnhxYlJlaEJjLUdwcGcwOWhQRGoyWXFKMW94N3VPQzhSSjNCZFptLWdn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Mar 2024 07:00:00 GMT",
        "title": "Grayscale Submits Revised Application For Ethereum Spot ETF – What’s New? - TradingView",
        "content": "Asset management firm Grayscale Investments has updated its application for an Ethereum spot ETF (exchange-traded fund) with the United States Securities and Exchange Commission (SEC).\n\nEthereum Spot ETF Case Just As Solid As Bitcoin’s, Grayscale Argues\n\nAccording to a recent post on X by Craig Salm, Grayscale’s chief legal officer, the asset management firm has revised its 19b-4 form for an Ether spot ETF. Salm claimed that this move was “important” in an effort for Grayscale to list and trade shares of its Ether Trust on the New York Stock Exchange (NYSE) Arca.\n\nThe chief legal officer stated in his post that investors “want and deserve access” to Ethereum via a spot exchange-traded product, likening the situation to the Bitcoin ETF story. “We believe the case is just as strong as it was for spot Bitcoin ETFs,” Salm said.\n\nThe asset manager is amongst the numerous firms looking to issue the first Ethereum spot ETF in the United States, having filed an application with the SEC on October 10, 2023. However, these ETF applications have faced delays multiple times, with the most recent coming against BlackRock’s filing on March 4, 2024.\n\nAs a result, the likelihood of the SEC approving an Ethereum spot ETF has taken a nosedive in recent weeks. Once-optimistic Bloomberg ETF expert Balchunas even revealed in his latest analysis that the ETH funds now have only a 35% chance of approval.\n\nSEC Chairman Faces Pressure Over Crypto Approval\n\nTwo US senators of the Democrat party, Sens. Laphonza Butler of California and Jack Reed of Rhode Island, have urged the SEC chairman to avoid approving crypto investment products. In a letter dated March 11, the lawmakers, who are also members of the Senate Banking Committee, asked the Commission to limit future crypto ETF applications.\n\nAlexander Grieve @AlexanderGrieve The success of the BTC spot products clearly ruffling some feathers on the Hill. @SenatorJackReed and @Senlaphonza write to the @SECGov urging:-no further ETPs for other tokens-make life difficult (i.e. examinations/reviews) for brokers and advisers that recommend BTC ETPs pic.twitter.com/enxdumC02N\n\nFollowing the approval of 11 Bitcoin spot ETFs in January, the attention of the crypto public has somewhat turned to whether the SEC will do the same for the Ethereum versions. However, this latest letter from the senate seems to further hurt the chances of an ETH ETF approval.\n\nA part of the letter read:\n\nRetail investors would face enormous risks from ETPs referencing thinly traded cryptocurrencies or cryptocurrencies whose prices are especially susceptible to pump-and-dump or other fraudulent schemes,” they said. “The Commission is under no obligation to approve such products, and given the risk, it should not do so.\n\nAs of this writing, the price of the Ethereum token stands at $3,731, reflecting a 1.2% increase in the past day."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxPejhZdk11STE4QVpyT2trSVo4aGhMRmtfX3B3aUtmSnktdlJrci1SMUp4QW1nWVdfM1l2WDduanVyUnZnR2RWU0NjOUhfS0x2T0ZsVHBocm5IRGl3dUFRakZwQjhQTTNvdzdyOU5wdl9oTXo3WEdkbkI4ZzQzV1E0VkY2NEZMb3ZTUEM2S2ZwNGUxZ0F4OHlmcVRGT0VoX1E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Mar 2024 07:00:00 GMT",
        "title": "The crypto future of Ethereum: the launch of the Metis Alpha - The Cryptonomist",
        "content": "Crypto news: the launch of Alpha marks the activation of the decentralized sequencer of Metis, representing a significant step forward for the scalability of Ethereum through the implementation of this milestone.\n\nLet’s see below all the details.\n\nMetis Crypto Sequencer: Steps Forward for Ethereum\n\nAs anticipated, Metis, the Layer-2 scalability platform of Ethereum comparable to the EVM, has launched the Alpha version of its innovative Decentralized Sequencer. This marks a significant step towards the decentralization of rollups.\n\nThe decentralized Sequencer represents a significant advancement compared to the single sequencer model currently adopted by other Layer-2 rollup solutions.\n\nThis launch positions Metis as the first rollup of Ethereum to adopt a decentralized approach to its sequencer. Rollups represent one of the most promising scalability solutions, but currently they have some drawbacks.\n\nTo fully ensure the security of Ethereum, a decentralized fraud/validity proof system and a decentralized sequencer are needed.\n\nSo far, no other rollup has focused on the decentralization of the sequencer, making them vulnerable to single points of failure and potentially subject to censorship.\n\nWith this new feature, instead, by keeping control over a single sequencer, the foundations maintain almost total control over the network and its revenues.\n\nSecurity, fairness, and community involvement in the crypto network\n\nThe adoption of a decentralized sequencer by Metis allows multiple entities to manage the sequencers. This improves the security and decentralization of the network and enables a more equitable revenue sharing with users.\n\nA distributed sequencer also paves the way for crucial functions such as seamless and secure sequencer rotation, the ejection of malfunctioning or harmful entities, and increased network stability.\n\nUsers can contribute to maintaining the decentralization, transparency, and stability of the network by becoming sequencers and participating in the consensus process.\n\nThe participation of multiple entities makes it more difficult for malicious actors to control or compromise the order of transactions.\n\nThe Sequencer nodes can earn rewards in METIS tokens for their role in block production and transaction processing within the network.\n\nActive participation from the community can lead to greater recognition within the group, paving the way for future collaborations or potential partnerships.\n\nFurthermore, during the first year, all sequencer nodes will benefit from a Mining Rewards Rate (MRR) of 20%.\n\nMetis gets a price rally with listing on Binance\n\nMetis has experienced a significant increase of about 27-30% after the announcement of its inclusion on the Binance trading platform.\n\nThe inclusion on Binance of the crypto has effectively introduced the project to a wide range of traders and investors, increasing its liquidity and accessibility.\n\nThe surge in the token price can be attributed to various factors, including the increase in visibility and credibility resulting from being listed on Binance, as well as the growing market interest in Layer 2 scalability solutions like Metis.\n\nParticularly significant is the fact that Binance has waived the listing fee for Metis, demonstrating confidence in the potential of the project and commitment to promoting innovation in the cryptocurrency sector.\n\nThe designation of “Seed Tag” conferred to Metis by Binance highlights its status as an innovative project, which could involve greater volatility and risks compared to other listed tokens.\n\nThe increase in Metis prices and its listing on Binance have coincided with a broader recovery in the cryptocurrency market.\n\nBitcoin has recently surpassed its previous all-time high, exceeding $71,000.\n\nOn the other hand, Ethereum has temporarily exceeded $4,000, further contributing to the bullish sentiment around Metis and other promising blockchain projects."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxPejhZdk11STE4QVpyT2trSVo4aGhMRmtfX3B3aUtmSnktdlJrci1SMUp4QW1nWVdfM1l2WDduanVyUnZnR2RWU0NjOUhfS0x2T0ZsVHBocm5IRGl3dUFRakZwQjhQTTNvdzdyOU5wdl9oTXo3WEdkbkI4ZzQzV1E0VkY2NEZMb3ZTUEM2S2ZwNGUxZ0F4OHlmcVRGT0VoX1E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Mar 2024 07:00:00 GMT",
        "title": "The crypto future of Ethereum: the launch of the Metis Alpha - The Cryptonomist",
        "content": "Crypto news: the launch of Alpha marks the activation of the decentralized sequencer of Metis, representing a significant step forward for the scalability of Ethereum through the implementation of this milestone.\n\nLet’s see below all the details.\n\nMetis Crypto Sequencer: Steps Forward for Ethereum\n\nAs anticipated, Metis, the Layer-2 scalability platform of Ethereum comparable to the EVM, has launched the Alpha version of its innovative Decentralized Sequencer. This marks a significant step towards the decentralization of rollups.\n\nThe decentralized Sequencer represents a significant advancement compared to the single sequencer model currently adopted by other Layer-2 rollup solutions.\n\nThis launch positions Metis as the first rollup of Ethereum to adopt a decentralized approach to its sequencer. Rollups represent one of the most promising scalability solutions, but currently they have some drawbacks.\n\nTo fully ensure the security of Ethereum, a decentralized fraud/validity proof system and a decentralized sequencer are needed.\n\nSo far, no other rollup has focused on the decentralization of the sequencer, making them vulnerable to single points of failure and potentially subject to censorship.\n\nWith this new feature, instead, by keeping control over a single sequencer, the foundations maintain almost total control over the network and its revenues.\n\nSecurity, fairness, and community involvement in the crypto network\n\nThe adoption of a decentralized sequencer by Metis allows multiple entities to manage the sequencers. This improves the security and decentralization of the network and enables a more equitable revenue sharing with users.\n\nA distributed sequencer also paves the way for crucial functions such as seamless and secure sequencer rotation, the ejection of malfunctioning or harmful entities, and increased network stability.\n\nUsers can contribute to maintaining the decentralization, transparency, and stability of the network by becoming sequencers and participating in the consensus process.\n\nThe participation of multiple entities makes it more difficult for malicious actors to control or compromise the order of transactions.\n\nThe Sequencer nodes can earn rewards in METIS tokens for their role in block production and transaction processing within the network.\n\nActive participation from the community can lead to greater recognition within the group, paving the way for future collaborations or potential partnerships.\n\nFurthermore, during the first year, all sequencer nodes will benefit from a Mining Rewards Rate (MRR) of 20%.\n\nMetis gets a price rally with listing on Binance\n\nMetis has experienced a significant increase of about 27-30% after the announcement of its inclusion on the Binance trading platform.\n\nThe inclusion on Binance of the crypto has effectively introduced the project to a wide range of traders and investors, increasing its liquidity and accessibility.\n\nThe surge in the token price can be attributed to various factors, including the increase in visibility and credibility resulting from being listed on Binance, as well as the growing market interest in Layer 2 scalability solutions like Metis.\n\nParticularly significant is the fact that Binance has waived the listing fee for Metis, demonstrating confidence in the potential of the project and commitment to promoting innovation in the cryptocurrency sector.\n\nThe designation of “Seed Tag” conferred to Metis by Binance highlights its status as an innovative project, which could involve greater volatility and risks compared to other listed tokens.\n\nThe increase in Metis prices and its listing on Binance have coincided with a broader recovery in the cryptocurrency market.\n\nBitcoin has recently surpassed its previous all-time high, exceeding $71,000.\n\nOn the other hand, Ethereum has temporarily exceeded $4,000, further contributing to the bullish sentiment around Metis and other promising blockchain projects."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxPZlBHQUs2amtNdkcwdGNyS1ZWYmtuckJZc294Y3pHOU8xTlQxeUFfZjZUTkdfZzVVekZyUERqekx3UUJGWlN3WkwzdGdUbEhQZlMzX0wyUkZ0X1Ytb2hqQUdGbnpEV1Z2QWFSZHhHc0M2aU9jNkxSY0pjRDJpa0k2UTlYdWRFWHNUSkVuVmltV3pwdG5uVENCeXZDMTE1NWNj0gGmAUFVX3lxTFBsODJ0QWV6bm1SbV9lWUZaVDQ4NFdIUWxtNFp0UWxKNFhwbkhBTnNaNVNoY1VlWEVCU1RXejFDUDlneXpFdHh4Ym1MeldRRGtyZEV1SENqRzkwVTNVRHQ0dXpBYUtEdWI0UFhjWmptTjdMdENIWFhqY3R0c1pMYnlPZHdlZVVqMDFiVk1aWUNKY1UzZzRwa0dRYTZlSlpnYTBnN3dwTnc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Mar 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum, and XRP Price Prediction For The Coming Week! - Coinpedia Fintech News",
        "content": "Elena is an expert in technical analysis and risk management in cryptocurrency market. She has 10+year experience in writing - accordingly she is avid journalists with a passion towards researching new insights coming into crypto erena.\n\nThe cryptocurrency industry continues to display a significant fluctuation in the chart, suggesting an increased price action in the market. Further, the market leader, Bitcoin price, has successfully claimed a new all-time high of over $73,000, highlighting a positive outlook for the market in the coming time.\n\nOn the other hand, the altcoin leader, the Ethereum token, had successfully crossed the $4,000 market during the previous week, following which it experienced a significant correction in valuation. Further, the XRP token has displayed a similar trend, indicating increased volatility in the crypto space.\n\nBitcoin (BTC):\n\nThe Bitcoin price traded in a closed range between $50,540 and $52,853 for a brief period. As the volatility in the market increased, the bulls jumped 24.53% within three days, following which the price faced rejection at $64,287. After trading sideways for a while, the bulls regained momentum and jumped 11.03% before facing rejection at $68,296.\n\nThe bulls then lost momentum and tested their low of $61,025, but the bulls quickly regained momentum and leveled all their losses. Following this, the bulls constantly traded under a bullish influence and recorded a new ATH of above $73,000. Since then, the price has been trading under a bearish influence.\n\nTradingView: BTC/USDT\n\nThe technical indicator, MACD, displays a decline in the red histogram, indicating a decrease in the bearish influence in the crypto space. Further, the averages show a high possibility of a bullish convergence, suggesting a bullish price action for the BTC price in the coming time.\n\nIf the market holds the price above the support level of $68,296, the bulls will regain momentum and prepare to test its upper resistance level of $73,844 during the coming week. Conversely, if the bulls fail to regain momentum, the price will lose momentum and fall to test its lower support level of $64,287.\n\nEthereum (ETH):\n\nThe ETH price traded in a closed range between $2,609 and $2,883 for over a week, after which the bulls gained enough momentum to break out of the resistance level, where the price displayed a neutral trend for the next few days. As the volatility increased, the Ethereum price jumped 16.25% within the next three days, following which the price displayed a neutral trend.\n\nAfter testing its low of $3,369, the bulls reimagined momentum and recorded a jump of 17.42% before facing rejection at $3,956. Recently, the bulls recorded another jump and successfully reclaimed the $4,000 mark, where the price traded sideways for a while. Since then, the price has been trading under a bearish influence.\n\nTradingView: ETH/USDT\n\nThe Moving Average Convergence Divergence (MACD) displays a constant red histogram, indicating an increased bearish influence in the crypto space. Moreover, the averages show a flatline, suggesting uncertainty in the future price action of the coin in the market.\n\nIf the market pushes the price above the resistance level of $3,733, the bulls will regain momentum and prepare to test its upper resistance level of $4,200. Negatively, a trend reversal may pull the price toward its lower support level of $3,369 in the coming time.\n\nRipple (XRP):\n\nThe Ripple (XRP) token traded in a consolidated range between $0.530 and $0.578 for about two weeks, following which the bulls gained momentum, and the XRP price jumped 13.5% before facing rejection at $0.6015. After this, the price displayed a neutral trend by trading between $0.578 and $0.601 for a while.\n\nAs the market volatility grew, the bulls successfully broke out of the resistance level, where they traded between $0.6015 and $0.6625 for a brief period. Recently, the bulls jumped 21.52%, after which it faced rejection at $0.7310. Since then, the price has been displaying a negative trend in the chart.\n\nTradingView: XRP/USDT\n\nThe MACD displays a constant decline in the red histogram, highlighting a decrease in the selling pressure within the crypto industry. Further, the averages show a potential bullish curve, suggesting the price may undergo a bullish price action during the coming week.\n\nIf the market holds the price above the support level of $0.6290, the bulls will regain momentum and prepare to test its upper resistance level of $0.6930. Conversely, if the bears overpowered the bulls, the price would lose momentum and fall to test its lower support level of $0.5780 in the upcoming week."
    }
]