[
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE5tQ0IwUW5yY0M0aWlpVXF3ZEk5VUJOT3VSSmpHZFh0YzJwSjF4cTBjR0xmcDJCNEZnYzJGSld0djRpVEZEN2taT2Q5OEhDZXplUFpTb2pGZEI5LVlIenlQWXN1cXN4RmhTNHBYS3V3TVZKQmxHVnpnVEVpNkI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Mar 2024 08:00:00 GMT",
        "title": "Here's How Much Trump Could Have Had if He Didn't Sell His Ethereum - Yahoo Finance",
        "content": "Though former President Donald Trump is famous for many things, Ethereum trading is not usually something that comes to mind for most. However, Trump dealt in Ethereum in recent months, according to data from Arkham Intelligence. The blockchain analytics company cross-references on-chain transactions with financial filings made by a Donald Trump account to find the former President's wallet address.\n\nIn December 2023, Trump sent more than 1,000 Ethereum (ETH) tokens to Coinbase, presumably to sell. At the time, the Ethereum was worth $2.4 million. However, ETH has since performed very well, and the former president may be wishing that he held on for longer.\n\nDon't Miss:\n\nIf you invested $100 in DOGE when Elon Musk first tweeted about it in 2019, here’s how much you’d have today .\n\nBitcoin has jumped nearly 50% already this year – how much would you need to get started today?\n\nIf Trump were still holding all 1,075 ETH that he sent to Coinbase, they would be worth more than $4 million, nearly 60% higher than what he sold them for, as ETH reached higher than $3,700 today. By selling in December, Trump could have had $1.6 million more in his portfolio.\n\nAdditionally, some expect the price of ETH to continue going up in the near term. The chain is expected to unveil new upgrades soon, which will increase speeds and security while lowering costs. The potential for spot Ethereum ETFs as early as May 2024 could provide another boost for the token.\n\nWhile Trump may be regretting his sale, the ETH was essentially free for him. He obtained the tokens through an NFT project that used his name, image and likeness and gave Trump royalties.\n\nThe project, called Trump Digital Trading Cards, was minted in December 2022 for $99 each. The 45,000 unique NFTs feature photos of Trump in different settings and poses. As of right now, the cheapest NFT is on sale for a little less than $500 (0.14 ETH), and the most expensive sale goes for 37 ETH (worth nearly $150,000 at the time).\n\n—\n\nTrending: Large boom in cryptocurrency and metaverse interest as BTC skyrockets — has Apple Vision Pro increased the demand for virtual real estate?\n\n—\n\nAdditionally, the project has generated more than 15,000 ETH in trading volume, which is what has allowed Trump to amass his ETH holding. In total, Trump has received nearly 1,500 ETH from the project.\n\nHowever, the Trump NFT projects do not stop there. Trump announced the release of another project in late 2023. The project is largely similar to the original project but carries some much more personalized rewards. For example, those who buy more than 47 NFTs, priced at $99 each, will receive a physical piece of the suit Trump was wearing in his infamous Georgia mugshot. Other rewards include autographed cards and even a dinner with Trump himself.\n\nStory continues\n\nAs Trump continues to earn royalties and does well on the campaign trail, it will be interesting to see how he handles his ETH position going into the presidential election in November.\n\nRead Next:\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nGet the latest stock analysis from Benzinga?\n\nThis article Here's How Much Trump Could Have Had if He Didn't Sell His Ethereum originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxPVTNoX21wNGNERjBNQldsOUQ5cWpDTF9OOVd6cTdzakpQNlhmR1dLTkpEdGkxaTZTekVqNlZLcW1jQkp6UU5rcTJTLTNPSm5zQm93bTVhby1kRW9WYXBqdkpaRWJ6Z0s0WlZ0MmxVYUZmTFRxMFpFbVNDRGE4R3ZCTjVzWkE2d3VMUHYyWlNTRUVJSHhHbmVWeHNWYWEtcmxoRG8w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Mar 2024 08:00:00 GMT",
        "title": "Experts see two factors driving Ethereum to $10,000 in catch-up rally with Bitcoin - DLNews",
        "content": "Bitcoin's all-time high cranks up pressure on Ether to follow suit.\n\nInvestors are counting on Ether ETFs to spur gains.\n\nAn Ethereum upgrade is on the way.\n\nBitcoin just hit a new high, and the wider crypto market is now worth more than $2.6 trillion.\n\nEthereum’s not been lost in the bullish run-up, rallying more than 65% since the beginning of the year.\n\nIt’s impressive, but sitting at $3,809 in late afternoon trading UK time Wednesday, Ether is still 21% below its all-time high of $4,800.\n\nWhat gives?\n\nIn a word, time.\n\nSzymon Sypniewicz, CEO of crypto onboarding solution Ramp, said it may simply take longer for the market to understand Ethereum’s complexity, especially “compared to the much simpler idea of Bitcoin as digital gold.”\n\nNew financial system\n\nEthereum lovers have long argued the second most valuable blockchain network will be the infrastructure of an entirely new financial system.\n\nThrough smart contracts, supporters point to a future with more transparent markets, tokenised versions of popular funds, and faster settlement times.\n\nJoin the community to get our latest stories and updates\n\nOthers say it’s only a matter of time before institutional investors take bigger positions in Ether. And the advent of Bitcoin ETFs may be increasing their appetite.\n\n“ETH hasn’t hit its institutionalised hype cycle yet,” like Bitcoin has, Robby Greenfield, co-founder and CEO of payments protocol Umoja Labs, told DL News. “Thus, the vast majority of new inflows from the BTC ETF will naturally lead toward greater buy pressure, along with the upcoming BTC halving,”\n\nGreenfield predicted that Ethereum will close the gap with Bitcoin in terms of its gains.\n\nHe told DL News the cryptocurrency should “clear $10,000 this year.”\n\nGreenfield added that an Ethereum ETF approval would undoubtedly help drive up its value. He joins a host of industry players counting on the US Securities and Exchange Commission to follow up its January approval of Bitcoin ETFs with a green light for Ether.\n\n‘It’ll be good for investors to have access to ETH in a way that’s easy and familiar.’ — Eugene Cheung, Bybit\n\n“An ETH ETF should naturally be approved,” Eugene Cheung, Bybit’s head of institutions, told DL News. “It’ll be good for investors to have access to ETH — one of the world’s premier risk assets — in a way that’s easy and familiar.”\n\nMaybe so, but the SEC, and especially its hard-charging chair, Gary Gensler, may take a different approach to an Ether ETF.\n\nGensler acknowledged reluctantly clearing the way for Bitcoin after the commission lost a court ruling in its effort to stop Grayscale from converting its BTC trust into an ETF.\n\nThere is no such court case driving decision-making on an ETH ETF.\n\nThe SEC is expected to weigh in on a slew of different Ethereum ETF applicants, including those from BlackRock and Fidelity, in May.\n\nCrypto prediction market Polymarket puts the odds of approval at 43%. JPMorgan’s latest analysis gives it a 50% chance.\n\nBloomberg ETF analyst Eric Balchunas called an Ethereum ETF “small potatoes,” characterising it as “the opening act coming on after the headliner.”\n\nEthereum upgrade\n\nJPMorgan does, however, point to another catalyst for Ethereum: the Dencun upgrade, which is designed to help the network scale up by cutting costs for various rollup solutions on the market.\n\nRollups batch crypto transactions, be they simple swaps or borrowing activity, into much smaller chunks of data.\n\nThese small chunks are then settled on Ethereum, reducing the overall data footprint on the network.\n\nBybit’s Cheung says this is good news for Ethereum supporters.\n\n“With layer 2 solutions built on top of Ethereum, the blockchain is becoming the settlement layer for a whole new digital infrastructure encompassing gaming, trading, and investing,” he told DL News.\n\n“The value of all of this will tend to accrue to the ETH asset.”\n\nUnlike Bitcoin’s automated halving event, Ethereum’s Dencun upgrade does not regulate the cryptocurrency’s scarcity. In contrast to Bitcoin’s pre-programmed 21 million token cap, Ethereum’s supply is infinite.\n\nNot a sure thing\n\nStill, the upgrade’s success isn’t a sure thing for the asset’s price performance.\n\nThe layer 1 competition is heating up, and one exec says Ethereum may even be overtaken this cycle.\n\n“Given the network’s poor performance during periods of high activity and the proliferation of alternative layer 1 protocols that have optimised for Ethereum’s shortcomings, Ethereum’s position as the second-ranked cryptocurrency is not necessarily guaranteed this cycle,” CMO of crypto exchange VALR, Ben Caselin, told DL News.\n\nLiam Kelly is DL News’ Berlin correspondent. Contact him at liam@dlnews.com."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxPVTNoX21wNGNERjBNQldsOUQ5cWpDTF9OOVd6cTdzakpQNlhmR1dLTkpEdGkxaTZTekVqNlZLcW1jQkp6UU5rcTJTLTNPSm5zQm93bTVhby1kRW9WYXBqdkpaRWJ6Z0s0WlZ0MmxVYUZmTFRxMFpFbVNDRGE4R3ZCTjVzWkE2d3VMUHYyWlNTRUVJSHhHbmVWeHNWYWEtcmxoRG8w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Mar 2024 08:00:00 GMT",
        "title": "Experts see two factors driving Ethereum to $10,000 in catch-up rally with Bitcoin - DLNews",
        "content": "Bitcoin's all-time high cranks up pressure on Ether to follow suit.\n\nInvestors are counting on Ether ETFs to spur gains.\n\nAn Ethereum upgrade is on the way.\n\nBitcoin just hit a new high, and the wider crypto market is now worth more than $2.6 trillion.\n\nEthereum’s not been lost in the bullish run-up, rallying more than 65% since the beginning of the year.\n\nIt’s impressive, but sitting at $3,809 in late afternoon trading UK time Wednesday, Ether is still 21% below its all-time high of $4,800.\n\nWhat gives?\n\nIn a word, time.\n\nSzymon Sypniewicz, CEO of crypto onboarding solution Ramp, said it may simply take longer for the market to understand Ethereum’s complexity, especially “compared to the much simpler idea of Bitcoin as digital gold.”\n\nNew financial system\n\nEthereum lovers have long argued the second most valuable blockchain network will be the infrastructure of an entirely new financial system.\n\nThrough smart contracts, supporters point to a future with more transparent markets, tokenised versions of popular funds, and faster settlement times.\n\nJoin the community to get our latest stories and updates\n\nOthers say it’s only a matter of time before institutional investors take bigger positions in Ether. And the advent of Bitcoin ETFs may be increasing their appetite.\n\n“ETH hasn’t hit its institutionalised hype cycle yet,” like Bitcoin has, Robby Greenfield, co-founder and CEO of payments protocol Umoja Labs, told DL News. “Thus, the vast majority of new inflows from the BTC ETF will naturally lead toward greater buy pressure, along with the upcoming BTC halving,”\n\nGreenfield predicted that Ethereum will close the gap with Bitcoin in terms of its gains.\n\nHe told DL News the cryptocurrency should “clear $10,000 this year.”\n\nGreenfield added that an Ethereum ETF approval would undoubtedly help drive up its value. He joins a host of industry players counting on the US Securities and Exchange Commission to follow up its January approval of Bitcoin ETFs with a green light for Ether.\n\n‘It’ll be good for investors to have access to ETH in a way that’s easy and familiar.’ — Eugene Cheung, Bybit\n\n“An ETH ETF should naturally be approved,” Eugene Cheung, Bybit’s head of institutions, told DL News. “It’ll be good for investors to have access to ETH — one of the world’s premier risk assets — in a way that’s easy and familiar.”\n\nMaybe so, but the SEC, and especially its hard-charging chair, Gary Gensler, may take a different approach to an Ether ETF.\n\nGensler acknowledged reluctantly clearing the way for Bitcoin after the commission lost a court ruling in its effort to stop Grayscale from converting its BTC trust into an ETF.\n\nThere is no such court case driving decision-making on an ETH ETF.\n\nThe SEC is expected to weigh in on a slew of different Ethereum ETF applicants, including those from BlackRock and Fidelity, in May.\n\nCrypto prediction market Polymarket puts the odds of approval at 43%. JPMorgan’s latest analysis gives it a 50% chance.\n\nBloomberg ETF analyst Eric Balchunas called an Ethereum ETF “small potatoes,” characterising it as “the opening act coming on after the headliner.”\n\nEthereum upgrade\n\nJPMorgan does, however, point to another catalyst for Ethereum: the Dencun upgrade, which is designed to help the network scale up by cutting costs for various rollup solutions on the market.\n\nRollups batch crypto transactions, be they simple swaps or borrowing activity, into much smaller chunks of data.\n\nThese small chunks are then settled on Ethereum, reducing the overall data footprint on the network.\n\nBybit’s Cheung says this is good news for Ethereum supporters.\n\n“With layer 2 solutions built on top of Ethereum, the blockchain is becoming the settlement layer for a whole new digital infrastructure encompassing gaming, trading, and investing,” he told DL News.\n\n“The value of all of this will tend to accrue to the ETH asset.”\n\nUnlike Bitcoin’s automated halving event, Ethereum’s Dencun upgrade does not regulate the cryptocurrency’s scarcity. In contrast to Bitcoin’s pre-programmed 21 million token cap, Ethereum’s supply is infinite.\n\nNot a sure thing\n\nStill, the upgrade’s success isn’t a sure thing for the asset’s price performance.\n\nThe layer 1 competition is heating up, and one exec says Ethereum may even be overtaken this cycle.\n\n“Given the network’s poor performance during periods of high activity and the proliferation of alternative layer 1 protocols that have optimised for Ethereum’s shortcomings, Ethereum’s position as the second-ranked cryptocurrency is not necessarily guaranteed this cycle,” CMO of crypto exchange VALR, Ben Caselin, told DL News.\n\nLiam Kelly is DL News’ Berlin correspondent. Contact him at liam@dlnews.com."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiXEFVX3lxTE5HSi1najN4QTlzVDVtR3MzYi1DSFhtczd1RlhJMmROTFF4NHFNZTJrX0ZWRkIxd0xFcWdtVTJOXzNfNTZ5UHN5ekN1MGNQWXNRdTFPUVZUa1BOSEZQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Mar 2024 08:00:00 GMT",
        "title": "Ethereum Price Prediction: Can ETH Target $4,500 Next? - crypto.news",
        "content": "Ethereum’s price continues to advance towards $4,000 despite market-wide liquidations and the U.S. SEC postponing a decision on Blackrock and Fidelity ETH ETF filings.\n\nEthereum traders have doubled bullish positions despite a major setback to institutional participation on the pioneer smart contract network and intense market volatility recorded on Mar. 6.\n\nMarket analysis explores how this show of conviction among speculative traders could impact the ongoing ETH price rally in the near-term.\n\nEthereum price reclaims $3,900 despite bearish headwinds\n\nEthereum’s price rose 9%, soaring from $3,500 to a peak of $3,900 within the daily timeframe on Mar. 6. The latest wave of ETH price rally is remarkable, as ETH defied downward pressure from two major bearish events.\n\nThe crypto markets suffered intense volatility as investors who booked profits when BTC claimed a new all-time high on Mar. 5 inadvertently triggered over $1 billion in liquidations.\n\nPreviously, crypto.news also reported that the U.S. SEC had postponed its decision on Blackrock and Fidelity’s filings to launch an Ethereum ETF product.\n\nDespite two crucial events, ETH added another $48 billion to its market cap within the daily timeframe on Mar. 6, breaking past $3,900 for the first time in three years.\n\nEthereum (ETH) price gained 9% on Mar. 6 2024 | Source: TradingView\n\nIt was previously anticipated that the SEC would provide a verdict as early as April 2024. Still, the latest development means that the May 7 deadline on Vanguard’s application is now the most significant date for a possible ETH ETF approval verdict.\n\nThe launch of the Ethereum ETF is expected to open the floodgates of institutional demand, as observed in the Bitcoin markets over the past month.\n\nTypically, news of such a verdict delay from the SEC, could put instant downward pressure on the price of the underlying asset. Remarkably, ETH defied the bears’ soaring 9% within 24 hours of the postponement hitting the newsreels.\n\nBullish traders keep ETH funding rates elevated\n\nThe dominant bullish expectations and positive buzz surrounding the Ethereum ecosystem ahead of the upcoming Dencun upgrade were vital catalysts for ETH’s resilient price performance on Mar. 6.\n\nMarket data shows that ETH speculative traders have maintained their bullish conviction, even as BTC and other mega-cap altcoins experienced major liquidations.\n\nSantiment’s Funding Rates metric presents a daily aggregate of fees paid between holders of perpetual futures contracts for a specific crypto asset. Fluctuations in funding rate trends offer insights into speculative traders’ inclinations regarding short-term price movements.\n\nThe chart below shows that the ETH funding rate remained at elevated positive values above 0.05% since Feb. 27, when ETH prices first broke above the $3,500 milestone price.\n\nDespite the bearish headwinds on Mar. 6, ETH bulls did not exit their positions. Instead, they doubled down on bullish positions, driving the funding rate to a 2024 peak of 0.09%.\n\nEthereum (ETH) Funding rate vs. Price | March 2024 | Source: Santiment\n\nElevated levels in funding rates suggest that traders are overwhelmingly confident of further short-term price upswings and, as a result, offer higher fees to keep contracts open.\n\nUnsurprisingly, ETH’s price quickly soared above $3,900 within the subsequent 24 hours following the spike in funding rate. If this rare market trend persists, according to historical trends, it’s only a matter of time before ETH’s price breaks above the $4,000 mark.\n\nEthereum price prediction: $4,500 retest only a matter of time?\n\nEthereum’s journey to having a listed ETF in the U.S. may have suffered a setback. However, its path toward reclaiming the $4,000 price level still appears unhindered, considering the growing bullish conviction observed in the ETH derivatives markets.\n\nIntoTheBlock’s global in/out of money chart further affirms this stance: The latest price upswing on Mar. 6 effectively sent the percentage of profitable ETH holders above 97%.\n\nProfitable holders are often reluctant to sell during a bullish market phase, hence, ETH is likely to maintain a relatively high support level above $3,500 as it consolidates before its next leg-up.\n\nHowever, in the event of another bullish upswing, the bulls now have only the $3,992 resistance level to beat on its way to new peaks above $4,000.\n\nEthereum (ETH) Price Prediction | March 2024 | Source: IntoTheBlock\n\nAs seen above, 1.3 million addresses had acquired 493,080 ETH at the minimum price of $3,992. Hence, if Ethereum’s price can establish a steady support level above that range, a move towards new peaks above $4,500 could be on the horizon as predicted."
    },
    {
        "id": 80,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxPNG14eVA0Z2g2OVE3M3ZZc3lHZ3BOOXF5NWt3MHgtdS1HOHdpcDBfTjd2RjZMYUJQMzl3Nk9JOTYxSlNCTi1CamNmR3ZweGI5RV9vQmNCYVZvSWFuallrM3dUZ0YzNlpSUVlLODRKcjg2dENQem9JSGdPeXlaSWNqWVRUbXcxbU5MLTlqOVF0S3NOUFHSAZcBQVVfeXFMTTZGUHQyMnF6SDlnMHRNd3BjTE9QeG54OEIxYjllQmp3ZktidmRjVXJFcEM0ZUY3LWVSQ01lUFd4U01RcXlBX0FyTFNoWVNvbWhIdXAyRnUxZ2xYX0NUT29lb203VzBOMi1UQ2syb21wT0JPS2hIMjBydmdMa1VTT19FdWhvRmVRdGZRVlBiYkhPcXhhTFR1WQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Mar 2024 08:00:00 GMT",
        "title": "Ethereum Price Prediction After Bitcoin Halving 2024 - CoinCodex",
        "content": "Ethereum is comfortably positioned as the world’s second most valuable cryptocurrency, and it looks like ETH will only solidify its spot over time. Of course, the most important crypto event in the next year will be Bitcoin halving, and it’s expected to have a significant impact on the markets for all cryptocurrencies, including Ethereum.\n\nIn this article, we’ll share our Ethereum price prediction after the halving, and explore whether Ethereum is likely to be a good long-term investment or not. First, let’s take a look at how Ethereum has performed during previous Bitcoin halvings.\n\nKey takeaways: Historical trends show Ethereum's varied performance around Bitcoin halvings, with notable differences between the second and third halvings.\n\nSpeculating on Ethereum's price after the fourth Bitcoin halving in 2024 remains uncertain. While Bitcoin halvings generally create a bullish sentiment, their specific impact on Ethereum's price is unpredictable.\n\nOur projections suggest a potential price dip for Ethereum to around $3,900 by April 2024, 25% below its all-time high but a significant 75% rise from its current value.\n\nLonger-term forecasts indicate a surge to over $6,300 by late July 2024, followed by a dip to $3,700 before rallying to peak above $7,300 in March 2025.\n\nEthereum's long-term potential as an investment looks promising due to the Ethereum triple halving concept. Factors such as reduced ETH issuance, EIP-1559's ETH burning, and staking contribute to deflationary pressure on its supply.\n\nHow has Ethereum performed before and after Bitcoin halvings?\n\nFirst off, we need to keep in mind that Ethereum didn’t even exist yet when the first Bitcoin halving happened back in 2012. ETH has only been around for two Bitcoin halvings, so the sample size of Ethereum’s price action before and after Bitcoin halvings is extremely small.\n\nDate ETH Price 1M before Halv. ETH Price at Halv. ETH Price 1M after Halv. ETH Price 3M after Halv. 2nd BTC Halving Jul 9, 2016 $14.7 $11 $11.7 (+6.3%) $11.2 (+1.8%) 3rd BTC Halving May 11, 2020 $160 $211 $249 (+18%) $398 (+88.6%)\n\nBrackets show ETH performance relative to the BTC price at the time of each respective halving.\n\nAs we can see, the ETH price action around Bitcoin halvings has been quite different if we compare ETH’s performance amidst the second Bitcoin halving and its performance amidst the third Bitcoin halving.\n\nThe Ether market was relatively quiet during the second Bitcoin halving, which happened in July 2016. In fact, ETH saw a 25% price decline in the month leading up to the second Bitcoin halving. Following the halving, it showed a modest recovery, although ETH’s price three months after the halving was only about 1.8% higher than it was at the time of the halving.\n\nThe situation amidst the third BTC halving in May 2020 was much more favorable for Ethereum. ETH increased by 31.8% in the month leading up to the third halving. Three months after the halving, Ether was up a whopping 88.6% compared to its price at the time of the halving.\n\nBased on this, it’s difficult to tell what will happen to the Ethereum price as the fourth Bitcoin halving approaches. Generally, Bitcoin halvings are seen as bullish events and improve the overall sentiment in the cryptocurrency market. So, it might be worth considering increasing your ETH stack a bit before the halving.\n\nWhat is the Ethereum price prediction after the Bitcoin halving in 2024-2025?\n\nCurrently, most estimates are suggesting that we should expect the next Bitcoin halving to happen in mid-April 2024. At the moment, the Ethereum price prediction on CoinCodex is forecasting Ethereum to trade at roughly $3,660 on April 15, 2024. This would be about -24.7% below Ethereum’s current all-time high but a 24.9% increase compared to the Ethereum price at the time of writing.\n\nAs far as the Ethereum price prediction for 2024 and 2025 is concerned, the forecast is expecting the ETH price to accelerate sharply soon after the Bitcoin halving, hitting new all-time highs just above $6,600 in September of 2024.\n\nThe prediction is expecting that ETH will then drop and find support at roughly $4,070, before gathering momentum for a new rally that’s forecasted to reach its peak above $7,000 in April 2025.\n\nIs Ethereum a good long-term buy?\n\nEthereum appears to be quite promising as a long-term buy thanks to a concept known as the Ethereum triple halving. Even though the Ethereum protocol does not have a halving mechanism, it does have features that provide deflationary pressure to its supply:\n\nReduced ETH issuance under Proof-of-Stake consensus\n\nETH burning via the EIP-1559 upgrade\n\nEthereum staking lowers the amount of ETH that is effectively in circulation\n\nThese three factors have already contributed to reducing the ETH supply, and will continue to make ETH deflationary so long as demand for transacting on the Ethereum market remains high. Based on Ethereum’s current trajectory and status as the undisputed king of the smart contracts space, the future is looking bright for ETH holders.\n\nEver since Ethereum moved from Proof-of-Work to Proof-of-Stake, ETH has turned deflationary. Since the transition to Proof-of-Stake, the ETH supply has been dropping by 0.23% per year on average. In that time period, 1.08 million ETH has been issued, while 1.49 million coins have been burned.\n\nETH issuance and burns since the Ethereum network transitioned to Proof-of-Stake. Image source: ultrasound.money\n\nHowever, it's important to understand that it's not guaranteed that ETH will remain deflationary forever. This is because the EIP-1559 mechanism burns the base ETH transaction fees paid by users. This means that the amount of ETH that's being burned depends on the demand for transactions on the Ethereum network. If demand for transactions saw a significant drop, it's possible that ETH could become inflationary again at some point in the future.\n\nAnother way to get a unique perspective on the Ethereum price from a long-term perspective is the Ethereum rainbow chart. This chart uses a concept known as logarithmic regression and features 9 different colored bands. Depending on which band the Ethereum price currently resides in, it can be interpreted as signaling overbought, underbought, or neutral conditions.\n\nIn the video below, you can learn more about the Ethereum rainbow chart and how you can use it to gauge the current conditions in the Ethereum market, as well as its long-term prospects.\n\nThe possibility of an Ethereum ETF\n\nIn January of 2024, the first spot Bitcoin ETFs were approved by securities regulator Securities and Exchange Commission (SEC) to enter the U.S. market. Before that, the only Bitcoin ETFs which were allowed were Bitcoin futures ETFs, which held Bitcoin futures contract and not actual Bitcoin.\n\nThe logical next step for crypto investing products in the U.S. seem to be ETFs that would allow investor to easily gain access to Ethereum, which is the second largest crypto asset by market capitalization. Several asset management companies including the likes of Franklin Templeton and VanEck have already applied to list spot Ethereum ETFs, and BlackRock CEO Larry Fink has said that he sees value in an Ethereum ETF.\n\nTo be sure, it might take a long time for the SEC to approve spot Ethereum ETFs – after all, getting the first spot Bitcoin ETFs was a multi-year effort even though several large asset management firms were pushing to get these products on the market. Still, the narrative that an Ethereum ETF is likely to come in the future will likely serve as a tailwind for ETH.\n\nThe Dencun upgrade\n\nAnother bullish factor for Ethereum is the Dencun upgrade, which will introduce several EIPs (Ethereum Improvement Proposals). The most notable EIP that will be included in the Dencun upgrade is EIP-4844, also dubbed \"Proto-Danksharding\".\n\nEIP-4844 aims to significantly improve performance for applications that depend on the use of extensive datasets, such as decentralized applications (dApps) and layer-2 scaling solutions developed on Ethereum. By dividing tasks between the consensus and \"database\" layers, the upgrade is an important step towards the ultimate goal of completely fragmenting the Ethereum blockchain into shards to achieve massive scalability.\n\nThe Ethereum Dencun upgrade will also introduce other EIPs such as EIP-6780, EIP-5656 and EIP-1153.\n\nThe bottom line\n\nSo far, there hasn’t been a clear trend of how Ethereum tends to perform in anticipation and immediate aftermath of Bitcoin halvings. Of course, Ethereum has only been around for two Bitcoin halvings, so the historical data is very limited. Overall, it might be a good idea to purchase some ETH as the halving approaches since the crypto markets tend to be optimistic in the lead-up to Bitcoin halvings.\n\nETH appears to be positioned well over the long term, thanks to its tokenomics. After transitioning to Proof-of-Stake, the protocol needs to issue much fewer new ETH coins, and EIP-1559 is constantly burning the ETH that’s being spent to pay for transaction fees. If you’re looking to learn more on this subject, check out our article exploring the Ethereum triple halving."
    }
]