[
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMi0wFBVV95cUxNSE11VG5SUG05Wk1IMWNlWmdDZUlSRGhOc1VZa3hrOGMyc0VDblBjVS1HQVhBeC1Dd0EzellNTm0zdlhWd3BGcVJZdnJrazhCRUhOQngxNE5vaHJDa1JjUHBXRHJZZlVWRktjLTdITVhYNDZoVHluTDBmZ005V2xMcUJWX1U0elEzUGpzQ0JHQWdmSGJDVW1ySnBIcVlkTDFVZUcyc0JMVVFDVWtLcnNGSzJfR0hCek12NWRNRGJCRWsxUTNJVWtkdWJoemhHU3g5VHg0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Feb 2024 08:00:00 GMT",
        "title": "Raoul Pal Predicts Massive Rally for Ethereum And Solana In Current Bull Cycle - TradingView",
        "content": "ZyCrypto\n\nRenowned macro-investor and Real Vision founder Raoul Pal has predicted a massive rally for Ethereum (ETH) and Solana (SOL) in the ongoing bull cycle.\n\nSpeaking during a recent podcast with Anthony Scaramucci, founder of global alternative investment firm SkyBridge Capital, Pal discussed the factors driving the growth of cryptocurrencies and their potential to save economies from a monetary meltdown.\n\nPal explained that the current debt cycle and the debasement of currency by central banks are driving the adoption of cryptocurrencies. He believes that people are looking for alternative investments due to the fear of a potential global economic meltdown caused by excessive debt and the devaluation of fiat currencies. He also mentioned that the rapid growth of decentralized finance (DeFi) and non-fungible tokens (NFTs) is creating new use cases and driving up the adoption of cryptocurrencies.\n\nWhen asked about his confidence in the growth of Ethereum and Solana, Pal stated that he believes ETH will reach a price of between $15,000 and $20,000 in this bull cycle. The pundit further underscored that SOL will reach a price of $750 and $1,000 in the same period.\n\nHe emphasized that he is very aggressively positioned in crypto as he believes that the issues of printing of money and excess debt will be the feature of the next two years and crypto will be the best-performing asset class.\n\n“I’m actually 100% of my liquid net worth in [crypto] and I have been actually for since 2020. And I use the bear markets to add into because I think we are in a once in a lifetime wealth accumulation opportunity for everybody be rich or poor,” said Pal.\n\nNotably, the pundit did not provide a specific timeline for when he expects the crypto market to reach its peak. However, many experts are closely monitoring the upcoming Bitcoin halving event. It is worth noting that the Bitcoin bull market has historically started around 12 to 18 months after a halving event. If this pattern were to repeat itself, the next bull market peak would likely be in the third or fourth quarter of 2025.\n\nPal also discussed the role of gold and silver in the current economic climate, stating that while they have always played a role as a global store of wealth, they do not work as well in a digital age. He emphasized he prefers crypto over the two assets, as it offers the same benefits and has the added advantage of a technology super-cycle behind it.\n\nAt press time, Ethereum was trading at $2,790 after a 7.73% surge in the past 24 hours. On the other hand, SOL was exchanging hands at $110, reflecting a 3.51% gain over the same period."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxPVTJrbUZ1U1FKTUdmb1FCNWxqSVRsekt2dkJKTmItM0s0b09qeFFCSDNBVlFWam5LRVp2QUxNUExTdlI4LTIyRGhEbHBfRk1ueUNnckJ2eW5mWHJ0TXFmRVY0REwzWWxUVENabm5pSzN3cWNxSFJzZUt3Nm1sSnF3RUdoQ3RkRDlxNEdpZEJKM2pENkladU5JcGkzbUJxWS1JVUVMQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Feb 2024 08:00:00 GMT",
        "title": "XRP Can Rise To $5.53 if it Captures Ethereum Market Cap of $299B - The Crypto Basic",
        "content": "The XRP price is currently struggling to retain $0.52, with commentators dubbing the token undervalued, but what could this price be if XRP captured the $299 billion market cap of Ethereum?\n\nXRP retained the spot as the second-largest crypto asset at some point, only below Bitcoin (BTC), the firstborn cryptocurrency, in market capitalization. The crypto asset overtook Litecoin (LTC) in market cap in 2015 and held the second spot until 2016, when Ethereum (ETH) stole the show.\n\nXRP Battled Ethereum for Second Spot\n\nXRP battled Ethereum for the second spot from 2016 to 2018, eventually reclaiming it in December 2017 when its market cap soared to $95.8 billion while Ethereum remained at the $70 billion mark. ETH retook the spot after a brief period, but the supremacy battle lingered until late 2019.\n\n- Advertisement -\n\nEthereum has continued to hold the second spot since then, with the SEC lawsuit, which came up in December 2020, exerting more bearish pressure on XRP. While Ethereum’s market cap soared to a high of $575 billion in November 2021 during the bull run, XRP only had a valuation of $60 billion.\n\nOver the years, XRP has also relinquished the third and fourth spots to Binance Coin (BNB) and Tether (USDT). Most recently, it gave up the fifth spot to a rallying Solana (SOL), whose market cap has now skyrocketed past $47 billion amid the reclamation of a $100 price.\n\nXRP now sits sixth among the largest crypto assets by market cap, with a valuation of $28.5 billion at the time of reporting. Meanwhile, USDC, Circle’s stablecoin, boasts a market cap of $27.9 billion despite its woes last year.\n\nXRP Price at $299B Market Cap\n\nSeveral XRP proponents have bemoaned the asset’s underperformance over the years, as it goes from a competitive stance against Ethereum to relegating itself to the sixth position among the largest cryptocurrencies by market capitalization.\n\nWhile some market analysts predict an imminent comeback from XRP, these projections remain speculative at this time. However, if XRP had followed a similar growth trajectory to Ethereum’s, what would its price be right now, considering its current circulating supply?\n\n- Advertisement -\n\nEthereum currently has a market cap of $299 billion at the time of reporting. Meanwhile, XRP’s circulating supply comes in at 54.5 billion coins, per CoinMarketCap (CMC) data. If XRP had imitated Ethereum’s growth to reach the $299 billion valuation, its price right now would be $5.53.\n\nNotably, this price would represent a new all-time high for XRP, which currently trades for $0.5227. XRP would need to skyrocket by a massive 957% from its current value to clinch the $5.53 price.\n\nIf XRP achieves a market capitalization of $1 trillion like Bitcoin, XRP price would be approximately $18."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxPQXFnZVRaUWx6ek5seEhWZVptRUNYYTFHUU8xcmJyWkZpa1hyRzBiOGxyWDd4eEcyNXhHa2NsMExrZFVxaGpRWm1oM2dVU1hVejllNjBhQzNqZDdJZ0hhSDZqME16V19fTkdoVGFGMzVLc09VRnZTSVFXVEFPM0kxeUMyN0lINDNjX1RPMDNOOEVwREszaWlv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Feb 2024 08:00:00 GMT",
        "title": "Why Bitcoin, Ethereum, and Solana All Jumped Double-Digits This Week - The Motley Fool",
        "content": "Bitcoin jumped again this week as investors flooded into the crypto industry.\n\nThe crypto market came to life this week as Bitcoin (BTC -0.33%) passed $52,000 and the $1 trillion market cap level. As of noon ET on Friday, Bitcoin is up 10.2% over the past seven days and is holding strong.\n\nBitcoin isn't the only winner in crypto. Ethereum (ETH -0.67%) is up 12.2% to $2,784 per token and high-throughput blockchain Solana (SOL -0.19%) is up 4.7%, although it was up over 10% for the week just a few hours ago.\n\nWhat's driving the crypto market\n\nThe simple driver of crypto right now is the flow of funds into the industry. BlackRock's iShares Bitcoin Trust has seen hundreds of millions of dollars of inflows this week alone and now holds over 100,000 Bitcoins. That's enough to inflate the entire market.\n\nBitcoin's rise is particularly interesting given competing forces in the market. A strong U.S. dollar and rising interest rates have typically correlated to Bitcoin declining, but that trend is being offset by tech and growth stocks rising, which Bitcoin is directly correlated with.\n\nTraders have speculated that Bitcoin has become a safe haven for international investors or there's an increased pool of buyers because of new Bitcoin exchange-traded funds (ETFs), but the reality is money is coming into Bitcoin at a much faster pace than it's going out and that's driving the price.\n\nEthereum and Solana keep up\n\nEthereum is up in part because traders are expecting it to be the next crypto ETF. That would be the natural next step, although the Securities and Exchange Commission (SEC) hasn't said it will allow any ETFs beyond Bitcoin's.\n\nSolana could be another ETF candidate, but it's up in part because of airdrops in the ecosystem that has brought more liquidity and value, some of which is flowing back to the Solana token.\n\nIt's not unusual for tokens like Ethereum and Solana to climb alongside Bitcoin and that's at least one of the drivers of the tokens this week.\n\nWhat's ahead for crypto?\n\nOutside of just token values rising, Coinbase Global's earnings release this week showed optimism about crypto exchanges and also crypto use cases. Coinbase is seeing more adoption among institutions and developers and is also pushing for regulatory clarity about what's a security and what isn't in crypto.\n\nAs the industry leader in the U.S., Coinbase's position and activism are very important to the crypto industry and when it's reporting healthy financial results that bodes well for the industry.\n\nI think all of these factors working together are very bullish for cryptocurrencies in general and even exchanges and development companies like Coinbase. But it'll be a bumpy ride and the gains earned this week could evaporate next week. So, prepare for the volatility ahead -- any dips could be a buying opportunity for investors."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxQTWdhaTdmaVNaN2hsbGxQRFBfdFlDQ1VyallfNVBqTW1yNmduN0ZZWGZ6a3d3THRKZGg3UTkwc2pOeHowWnN4ZlpMSlNlcjNnM2llcU1SNWV5UjlZWGZGN2ZwclBWa1VscS1NMF9VNTBFMGY0RS0xQXRzR0lTSldTQmRUZEdmSXZRZGFSdUdxRWpoQURvV1pqR2lqZEs?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Feb 2024 08:00:00 GMT",
        "title": "This Ethereum DeFi trader turned $30k into $1.1m in just five days — or did they? - DLNews",
        "content": "A DeFi trader's apparent $30,000 to $1.1 million gain from trading Pandora was largely due to receiving tokens via Sablier, not just market buys.\n\nSablier is a DeFi platform used by projects to distribute tokens on a payroll or as part of a token vesting schedule.\n\nThe apparent success of a DeFi trader turning nearly $30,000 into $1.1 million in five days has sparked widespread fascination.\n\nThe anonymous trader, who owns the Ethereum wallet 0x88, invested in Pandora, a buzzy Ethereum token and NFT hybrid. And DeFi users keen on monitoring onchain data — DeFi trading is transparent thanks to public blockchains — noted their purported $1 million earnings.\n\nThe tale of instant riches inspires hope in many punters of DeFi.\n\nBut a closer examination by DL News suggests the situation is more complex than initially thought.\n\nAnalysis of the trader’s wallet history shows that they didn’t market-buy all the Pandora tokens they eventually sold; rather, they received more than half of the tokens from Sablier.\n\nSablier is a DeFi platform used by projects to distribute tokens on a payroll or as part of a token vesting schedule. Generally, tokens are only vested if there was a token pre-sale or a similar arrangement.\n\nBut according to messages seen by DL News on a Telegram channel run by the Pandora team, a pre-sale was not conducted. Pandora did not immediately respond to DL News’ request for comment.\n\nPandora emerged last week as the first implementation of the new — untested and experimental — ERC404 token standard that exists as both a token and an NFT.\n\nJoin the community to get our latest stories and updates\n\nIn order to hold the NFT a user must buy at least one whole fungible token. If they then sell that token, or a fraction of the token, the NFT is burned, or removed from the supply.\n\nOpening Pandora’s box\n\nThe mysterious trader held a total of 78 Pandora tokens worth $2.5 million at the token’s peak. Although the trader did purchase tokens in the project early, their gains did not all come from market purchases. Most of the gains came from the tokens received via Sablier.\n\nThe story began on February 4 when the Pandora project gave them what’s called a Sablier Lockup NFT, which represents ownership of 45 Pandora tokens.\n\nAfter receiving 45 Pandora tokens via Sablier, the mysterious trader also made a series of token purchases. They bought 33.59 Pandora tokens at an average price of $889, before spreading their sales over 35 transactions as the token rallied some 3,500%.\n\nThe 0x88 wallet sold 77 Pandora tokens across 35 transactions. (Dexscreener)\n\nThe trader’s wallet had direct interactions with a few other wallets, which indicates they may be connected in some way, either the same individual controls them all, or the wallets are part of a larger group of individuals.\n\nThe first, wallet 0x22, seems to be a transit wallet without any special features. Another wallet, 0x0d has a balance of $172,000 and is actively airdrop-farming on protocols like Manta, Blur, and Blast. Lastly, wallet 0x2c, which is only two days old, already holds almost $1 million — coming directly from the trader’s Pandora wallet.\n\nPandora's price\n\nSince launching on February 2, the project has done over $550 million in trading volume on decentralised exchanges and over $3 million in volume on NFT marketplaces on Ethereum.\n\nThe success of Pandora has also led to dozens of other projects launching ERC404 collections, resulting in gas spikes on Ethereum mainnet and numerous suspected rug pulls.\n\nThe total market value for ERC404 projects sits at $151 million, with nearly $21 million in total trading volume in the last 24 hours.\n\nRyan Celaj is DL News’ New York-based Data Correspondent. Reach out with tips at ryan@dlnews.com."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxQZ2YwU1k5by1NcC1NR0h0cHNicXkyRE1xMW9GbEs2eXpoQUJMdmNJMWk5Tmppbk1mZ0hqWVBnWXRrRlR6MWxxQVRrMU9DUnlEb3p0RzdJX3V3VVZxODlBdUpDQ3Q0cGV5dGs3bUFSN2xvRjdpUTRSZng1allhTzNPejFXeG1hT19vMEc1UmZGcG5XYnRtck02SHlrRlpFbWd3U2x1TVFGcnZTM1NOcV9lZHBHdEtwaDBZTFh5Ynl5NA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 16 Feb 2024 08:00:00 GMT",
        "title": "Everything is ready for Uniswap v4: launch expected after the Ethereum Dencun update - The Cryptonomist",
        "content": "According to the Uniswap Foundation, the long-awaited version 4 of the decentralized exchange Uniswap will arrive in the third quarter of 2024, following the implementation of the Dencun upgrade of the Ethereum blockchain, scheduled for March 13th.\n\nUniswap v4 introduces the concept of “hooks” that allows for efficient liquidity management within the protocol and enables a wider range of use cases for smart contracts.\n\nAll the details below.\n\nThe v2 version of the decentralized exchange Uniswap coming after the Ethereum Dencun update\n\nUniswap Foundation, the decentralized autonomous organization that supports the Uniswap cryptographic exchange protocol, has announced that it will release version v4 of the platform in the third quarter of the current year.\n\nFirst of all, the founder of the project Hayden Adams and all the developers working on the DEX want to wait for the Dencun update of the Ethereum blockchain to run its course and be successfully executed.\n\nIn particular, Dencun, whose implementation is expected on March 13th, will help make the network more scalable by compressing block data and storing part of it separately.\n\nAll of this will open the doors for Uniswap to explore new functionalities within its own platform, expanding connections with the Ethereum network and offering more efficient products.\n\nThe Uniswap team has revealed the roadmap for its upgrade to version 4, explaining that at this moment the work is in the “Code Freeze” phase, where they are completing the main code, conducting tests, optimizing gas, improving security, and finalizing the periphery.\n\nThe next phase will involve testing their own infrastructure with preliminary checks at specific auditing companies, along with a community audit contest.\n\nIn this moment, the v4 of Uniswap will be distributed in testnet, and eventually small modifications will be made to the code.\n\nFinally, the last phase concerns the actual launch, accompanied by the related promotion and marketing initiatives.\n\nNow that the launch of Dencun on Mainnet has been scheduled for March 2024, we're excited to provide an update to the community! 🎉\n\n\n\nUniswap v4's launch is tentatively set for Q3 2024.\n\n\n\nFrom community-built Hooks (https://t.co/WyaGr1Ti1t), to events, to Twitter Spaces, the… — Uniswap Foundation (@UniswapFND) February 15, 2024\n\nThe new version of the industry-leading DEX will leverage the recent Ethereum improvement proposals (EIP, specifically EIP-4788, EIP-1153, and EIP-4844) for a more efficient utilization of liquidity in the platform’s pools.\n\nWith v4, the concept of “hook” will be introduced for the first time in DeFi, which allows the injection of custom logic at specifically designated points for pools, swaps, fees, and other LP positions.\n\nThis amplifies the use cases of Uniswap and explores new solutions for smart contract engagement, with significant reductions in gas fees and always immediate interactions, combined with better resource management for end users.\n\nThe positive effects of Dencun on the Ethereum blockchain\n\nWhile Uniswap awaits the implementation of Dencun on the Ethereum blockchain, the community of the world’s leading smart contract platform is buzzing with excitement for one of the most significant updates ever witnessed so far.\n\nDencun was previously launched on January 17th on the Goerli testnet (with some difficulties and a 4-hour delay) specifically to test some new features.\n\nOn January 31st, it was then the turn of the Sepolia testnet, and finally on February 11th, the Holesky testnet, completing the final preparations before the arrival in mainnet.\n\nNow the official launch to the general public, as highlighted by the blockchain research company “Nethermind”, is scheduled for March 13th at 13:55:35 UTC, at block height “8626176”.\n\nThe Ethereum developers have decided on the official launch date unanimously during the so-called consensus level call 127 after the success of Holesky.\n\nEthereum's Dencun upgrade is set for March 13.\n\n\n\nIt introduces several key changes, including EIP-4844, EIP-1153, and EIP-4788.\n\n\n\nHow will Dencun affect L2 valuations, and what does this have to do with Uniswap?\n\n\n\nSubscribe and read to find out.https://t.co/0fHx7Y3Zd7 — Blockworks Research (@blockworksres) February 15, 2024\n\nFrom a technical point of view, Dencun will enable a new type of transaction called “proto-danksharding” that will help reduce transaction costs on Ethereum’s rollups, with obvious benefits also for DEXs like Uniswap.\n\nMore precisely, the “proto-danksharding” is a preliminary measure of the technical functionality of “danksharding”, which opens the doors to future implementations on the L1 backbone infrastructure.\n\nFor now, Dencun will be responsible for compressing the transaction data contained in the rollups and storing part of it in an external storage, helping to reduce the weight of the blocks and thus reducing fees for the end user.”\n\nIn addition, the same update will help reduce the cost of data available on Ethereum, creating advantageous conditions for projects such as Celestia, Avail, and EigenDA.\n\nWith the L2 market on Ethereum experiencing strong growth, as reported by the increase in the overall TVL of this sector, we expect Dencun to revolutionize the aspect of network scaling by bringing greater efficiency and a larger influx of new users."
    }
]