[
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxPbnU1OXBFeFR4V2lyelR3eWkzNnA5UG1xRzJ0X1BCWlNBOVZHamEtMXVGYWRNbl82UWdmc0FDU0k2QVBIRXlXcjg0UGFoUUpqaHZOdkJaRmEyaHFzNTRjQWVRc0swZEYxOVlKTmhLcV9ERVZwSUp4TGNWdTRUWWxDSTQ2MGZKS0tzSVZPc3RlSVFkUG1lbWJOT3RJY3NOd203TFJQRjVqb3BNb3dISl9r0gG0AUFVX3lxTFBHU1c4TE9Ody04Z2UyUVhFV3FUQmZabExIWHcxd3Rfcl96ZnI1UlJrYVhBc1NPMHRDTk92UnpTcDdocG92RFVZMWh3NDhHM0VoSm9nVFpiVF93NXNGSmxBd3FuU0NOT2VZOVJUeHNYQTNmQTJfMmU4SnVGQXdRN3FlRHNFcTF6VEFKOU9xa3dVZkU1Z1JnS0dDNHM2OXVvVzFDWVM2b3pLTFNicGk5VDJscGk5ZQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Mar 2024 07:00:00 GMT",
        "title": "Layer 2 Blockchains Become Cheaper After Ethereum's Dencun Upgrade - CoinDesk",
        "content": "According to blockchain analyst Marcov’s Dune-based tracker, the average cost of transactions on scaling solution Optimism has dropped to nearly 4 cents, down significantly from the recent average of around $1.4. The average fee on Coinbase’s layer 2 solution Base fell to 3 cents from roughly $1.50, while Arbitrum’s declined to 40 cents. The average fee on zkSync and Zora also fell."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxPenVrNlJVc3FiNHM5M1pZZlZYSWJoQkpkcC03NUFTR2Q5SWNIMEdvVTZzUURhcndOeTlRVjBWOHpsdTRqc1p0VldLTnFoU2dJRExhSGxIaFVuZjY0THpyVTJVLThqeFJFWDdmcjhzdkNsa3cxMVRSX21xaWJ0NVJuVXNNRHh1cFRkLTZSSnh4YjNNLURTV2xFUWttVWJHRzRxRjYxYXFUOXpYQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Mar 2024 07:00:00 GMT",
        "title": "Dencun Day One: Ethereum Layer 2 Networks See Drastic Drop in Transaction Fees - Unchained",
        "content": "Some Ethereum layer 2 networks have seen their median transaction fees decline by as much as 99% after the Dencun upgrade went live. These are some of the biggest winners.\n\nEthereum Layer 2 networks were the biggest beneficiaries of the upgrade\n\nThe much anticipated Dencun upgrade has led to a significant reduction in transaction fees on Ethereum layer 2 networks, with the effects of the immediate scalability already taking shape across the ecosystem.\n\nThe Dencun upgrade went live early on Wednesday after it activated on the Ethereum mainnet at epoch height 269568. The upgrade introduced the highly anticipated proto-danksharding functionality via EIP-4844, which integrates off-chain “data-blobs” that decrease the costs associated with storing transaction data.\n\nEthereum Layer 2 networks, which are designed to provide a faster, cheaper route to executing transactions on the underlying blockchain, were the biggest beneficiaries of the upgrade. Data from a Dune dashboard created by “@Marcov” shows that popular layer 2 networks such as Optimism, Base, Arbitrum, Zora and zksync have seen massive declines in their average transaction fees.\n\nAt the time of writing, median transaction fees had dropped to $0.05 on Optimism, $0.064 on Base, $0.5 on Arbitrum and $0.16 on zkSync Era. So far, Optimism and chains based on Optimism’s tech stack such as Base, have seen the biggest reductions in fees.\n\nWe love to see it. OP Chains have the most affordable decentralized L2 transaction fees after 4844, bringing us that much closer to the reality of seamless end-user experiences. ✨In Blobs We Trust✨ pic.twitter.com/WOovhcZelk — Optimism (@Optimism) March 14, 2024\n\nafter 2 years of hard work, blobs are now live on @base before: $0.31\n\nafter: $0.00 (but actually $0.0005) wallets need to update to handle these cost reductions! pic.twitter.com/solIX9D4HM — Jesse Pollak (jesse.xyz) 🛡️ (@jessepollak) March 14, 2024\n\nStarknet, another Ethereum Layer 2 solution, posted a screenshot of the change in its transaction fees on X showing that a single gas transaction had declined 99% since the Dencun upgrade synchronized.\n\n“Dencun is both the most complex fork we’ve shipped since the Merge, and tied for ‘most total EIPs in a fork’ with Byzantium. There were more teams than ever involved in the process, and it somehow all worked out smoothly,” said the Ethereum Foundation’s Tim Beiko on X."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMi0wFBVV95cUxNNTFvc2hxMExVTG5nSU03MHlTRUVTY3Q4ZnhkNnAwX1RYZXlvdlN4U0xLbVBZWEdUZERLV1M2ekljTHZzakkwM3BFVGxLVGRCQjFxZDhjLUhwejZ1a21RZENwY2FMODUtUjhlOENsaEg1OG80WE5Ya0dmWk81aHAxdjNlTzFoVHE4dWZ0TEh5dUxaUEJmeGpuNURtY000RmtSNi12N0hvaWg3VXIwTV9MNHZNXzlLZEpBNkx5MjBkWjFPNk0weDBlVXZmYkQ1R3FvcF9j0gHYAUFVX3lxTE5DMTJaSDdhcHk0Y1VGakJyTU9zejNRMTdPZDBWc0p2MjFYSWh0QmNsUjZsTVREX3hMZDZLY2xfcGdVQnhXQ2JITGxyZXZ2TzY3bGZaUGpzLVdPTE5CSlh4VVJ6bzczbzZwcGRKM0k4OE5IR1hlM29ScXhKdjBFaTVYR1dxYjVwZmVQWEFSLTZlVEpPd0hnLVNETEJVd3FWT1BVRE9Mb2RhYWJ0ZFJTVE5sVnZWSnotMDRTaEQtcUhLRjVoVE5Bc1M5UHBkeVVzUk9IZGFnQ293bA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Mar 2024 07:00:00 GMT",
        "title": "Ethereum could drop to $3,600 – Here’s why - FXStreet",
        "content": "Over $1 billion worth of Ethereum hit exchanges in March 2024, ahead of the Dencun upgrade.\n\nWhales have consistently taken profits on their Ether holdings, to the tune of $7.36 billion in March.\n\nETH price could correct to $3,622 as technical indicators turn bearish and signal decline in Ethereum is likely.\n\nEthereum (ETH) price is at a risk of decline, according to technical indicators and on-chain metrics. A large volume of Ether hit exchanges in March, and ETH holders realized over $7 billion in profits. The altcoin is trading sideways, with Ethereum price at $3,922 at the time of writing.\n\nAlso read: Base and Optimism become cheaper than Solana as Ethereum Dencun upgrade empowers L2 chains\n\nEthereum price at risk of decline: On-chain perspective\n\nCrypto exchanges have noted Ether token inflows worth $1.02 billion in March 2024. The mass inflow of Ethereum is accompanied by profit-taking activities of large wallet investors. The chart below shows the inflow spikes throughout March.\n\nSupply on exchanges and Ethereum exchange flow. Source: Santiment\n\nData from crypto intelligence tracker Santiment reveals that there have been spikes in whale transactions valued at $100,000 and more. Whales have likely realized gains consistently in Ethereum’s uptrend, as shown in the Santiment chart below.\n\nWhale transactions valued at $100,000 and higher, Network Realized Profit/Loss. Source: Santiment\n\nOn-chain metrics signal there is likely an increase in selling pressure on ETH and Ethereum price could crumble if holders continue realizing gains in the coming weeks and months.\n\nEthereum price could nosedive to $3,600: Technical analysis\n\nEthereum price hit its 2024 peak of $4,093.92, on March 13, following the successful rollout of the Dencun upgrade. As Ethereum rallied towards its new year-to-date high, ETH holders kept up their profit-taking. Technical indicators reveal there is a potential for a correction in Ethereum price if demand from traders fails to push ETH price higher.\n\nA nearly 8% correction is likely in Ethereum, ETH price could nosedive to $3,600, the midpoint of the Fair Value Gap (FVG) identified on the ETH/USDT weekly price chart. Once Ethereum sweeps support at $3,600, the altcoin could make its way back to the range high at $4,093.92.\n\nThere is a bearish divergence in the Relative Strength Index (RSI) on the 1-day chart, and there are red bars on the Awesome Oscillator (AO). The technical indicators signal Ethereum is likely at the risk of decline, facing a potential correction.\n\n\n\nETH/USDT 1-day chart\n\nIf Ethereum price fails to bounce off the $3,600 level, the altcoin could drop to support at the lower boundary of the Fair Value Gap at $3,522. Such a move would imply over 10% correction in Ethereum.\n\n(This story was corrected on March 14 at 14:37 GMT to say, in the first bullet point, that over $1 billion worth of Ethereum hit the exchanges in March, not over $1 million.)"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMi5AFBVV95cUxPWW5xUlVsckd2LXZBZVBydU9sNFJfWGs4YUVra0FVQVJsbzNaNzBBTTdkYnVCampRUElVYVMwY1BhRDRWdEZtMTdmSnBtd1VnOGtrQzdrQVlNYXFRSkFxdWJVR1VlT0psTnJOV0RGeWhwaXpka0tYV2ZiOTN6VHZZbjgybzNwU1dTN1liRm1VWWNlbW5zOG9QVkdMLXNLdkVEY2NIWlJfelhCek81cjRLeG1hbWJzMUFyb0d0MW9qVU9fZno4amJYZjFSZk50bHBBUWpCSXlMRWlYWU14UWhIUXF0cHPSAeoBQVVfeXFMTjZ1NGFtUkNhcDFLM2NwVVdtbXQ3YWFKTVZ4V080bjZIcHJhNTljNW9WdXFYc0JlVXlsYkRZSFp6YS1jdWFyZ2VNTDZWcm1VelpWY2lfelpKZWR5VU1OZllmSGduYmdDU3p3M2RZNjRIaEk4b1oybHREOVd1UkRLSzhBaHZNUExhQWstanZGMVRLZl95UEljOExtVzZ6MVVPc2YwTG8ySTFQelRpa1EwNTZvZ1A5aU04d3RjaUtNNERNbnprekZQOUtXak5EOHdRQ21hT1J2ZlYxVURLdzlBaFJmQWtGTHVQajd3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Mar 2024 07:00:00 GMT",
        "title": "Has Ethereum defeated Solana in the scaling war? - FXStreet",
        "content": "Ethereum Dencun upgrade introduced proto danksharding, reducing transaction costs for Layer 2 chains like Base and Optimism.\n\nCritics argue that Layer 2 fees could increase in upcoming weeks and months as chains compete for blob space.\n\nEthereum Layer 2 tokens see price nosedive on Thursday, while ETH price trades sideways below $4,000.\n\nEthereum Layer 2 chains are competing with Solana for scalability after transaction costs were significantly lowered by Ether’s Dencun upgrade. While the successful rollout of the hard fork on the Ethereum mainnet has reduced fees for chains like Optimism and Base relative to Solana, critics argue that this may change with competition among Layer 2 chains.\n\nLayer 2 tokens noted a correction in their prices on Thursday.\n\nAlso read: Ethereum Layer 2 locks nearly $40 billion in assets as Dencun upgrade looms\n\nEthereum Layer 2 versus Solana, the scaling war rages on\n\nEthereum’s Layer 2 scaling solutions like Polygon, Base, Optimism, Arbitrum, among others, are competing with Solana for “scalability.” There is no clear winner since the altcoin’s Dencun upgrade has slashed transaction costs for Layer 2 chain users.\n\nData from Dune analytics shows the average transaction cost in USD for the top Layer 2 chains. The cost is down to $0.057 for Optimism, $0.054 for Base and $0.005 for Zora, among others.\n\nLayer 2- Average Transaction Fee in USD. Source: Dune Analytics\n\nThe implementation of proto danksharding, or EIP 4844, has introduced blobs to reduce the cost for Layer 2 chains, at least by one order of magnitude. At the time of writing, Optimism (OP) and Base are cheaper than Solana. However, critics argue that Layer 2 fees could climb in the coming weeks and months.\n\nThe crypto analyst behind the X handle @QwQiao of AllianceDAO, argues that Layer 2 fees could go up as the chains compete with each other for blob space. Data from Chainspect reveals that Solana ranks high in Transaction Per Second (TPS) compared to Ethereum and its Layer 2 chains. This is an important metric since TPS represents the ability of a blockchain network to handle transactional load. The higher the TPS, the more transactions the network can process in a given time frame, boosting its real-world utility.\n\nTPS for Solana and top Ethereum Layer 2 chains. Source: Chainspect\n\nSolana may still be far ahead of Ethereum and its Layer 2 chains in terms of scaling, since TPS is an important metric to determine the scaling prowess of a chain.\n\nEthereum trades sideways, L2 token prices nosedive\n\nEthereum is trading sideways below the $4,000 level and Layer 2 tokens Immutable (IMX), Optimism (OP), Mantle (MNT), Arbitrum (ARB), Starknet (STRK), and Manta Network (MANTA) noted up to 7% decline in their prices on the daily timeframe.\n\nEthereum Layer 2 prices. Source: CoinGecko\n\nLayer 2 token prices have dropped since the successful completion of the Dencun upgrade. This is likely a “sell the news” dip, where anticipation of fee reduction and higher utility of Layer 2 chains drove prices higher prior to the event, traders likely engaged in rapid profit-taking and “sell the news” behavior following the upgrade."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiYkFVX3lxTFBnT1plLVMyRFBsQUtFb0Ntdmd4SnFHanp2RWpUeHpreWVDbmMtenN6cGZDVngwUlprSG4wd2RTU3haeUhCQ2xwa1M0ZlEzLTdCcWFXUno1UC05WTZJcG00UzJn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Mar 2024 07:00:00 GMT",
        "title": "Blobs, MSTR and more: This is Ethereum’s broadband moment - Blockworks",
        "content": "The internet turned 35 earlier this week, and it seems only fitting that Ethereum would undergo arguably its largest upgrade ever just one day later.\n\nEthereum’s Dencun hard fork went off mostly without a hitch on Wednesday. Its arrival delivered a bevy of nine improvement proposals, with the blob-centric EIP-4844 being by far the most memeable.\n\nFor more than a decade after Tim Bernes-Lee (himself a dabbler in NFTs) first conceived the World Wide Web, internet users languished inside a slow, cumbersome internet plagued by bandwidth bottlenecks.\n\nDial-up modems could only handle up to about 50 kilobytes per second. The platforms we now take for granted — YouTube, Spotify, Twitch and TikTok — were as unfeasible back then as high-frequency trading on many layer-1 DEXs are today.\n\nThe arrival of broadband in the early 2000s immediately 10x’d consumer-grade internet to 512 kb/sec. Impossible ideas could now be realized into billion-dollar dot-com powerhouses, radically overhauling the dynamics of our culture and turning us all terminally online.\n\nNow, two decades later, TV is all but dead, replaced by a gamut of streaming services. AR headsets backed by hyper-fast wireless blend our physical worlds with the same digital space that Bernes-Lee laid out in his 1989 paper outlining the web.\n\nWhat broadband did for the internet, blobs are now doing for Ethereum.\n\nBlobs give the raft of layer-2s their own space through which to post transactions to the Ethereum mainnet without clogging up the blockspace intended for other users.\n\nThey have their own fee market, which means regular folk and their protocols of choice won’t have to compete with rollups and sidechains for blockspace — leading to lower fees for all involved.\n\nDencun and its blobs have already massively reduced fees for the layer-2s that have adopted the new rules. For example, Optimism and Base fees are down to a fraction of an American penny per transaction compared to nearly $1 before the fork.\n\nYouTube debuted in 2005, a half-decade after the rollout of the first consumer-grade broadband services. Justin.tv, the precursor to Twitch, came two years later.\n\nIt could be that layer-2 fees rise over time as more layer-2s compete for blobspace. The true impact of Ethereum’s successful push toward a cohesive and holistic multi-chain ecosystem, powered by “blobband,” probably won’t be felt for years to come.\n\nBut the groundwork has now been laid. Welcome to Ethereum’s blobband era.\n\n— David Canellis\n\nData Digest\n\n🙃 Solana has flipped Ethereum layer-2 Arbitrum for total value locked (TVL) to become the fourth largest DeFi ecosystem — a first since November 2021.\n\n🌊 A quarter of a billion dollars was liquidated on centralized exchanges over the past 24 hours, 60% longs.\n\n🤪 Memecoin mania puts Solana number-one for DEX volume over the past day — $1.45 billion to BSC’s $1.14 billion\n\n😴 All quiet on the crypto front as BTC hovers around $73,000 as ETH sits just below $4,000.\n\n✋No budge in the benchmarks: S&P and the Dow were flat during the pre-market trade. That’s no surprise, considering the VIX’s drop to 14 from its long-term average of 20.\n\n✅ Good news: A bull market with a high VIX tends to spell “bubble trouble” — so lower volatility with higher prices may be a boon for traders.\n\nIs the SEC in the crypto market’s rear-view mirror?\n\nThe crypto pump is upon us.\n\nSOL is up 18% this week and almost 50% over the month. Binance’s BNB and Filecoin are each up more than 80% over the past 30 days. Wormhole’s Portal Bridge has facilitated more than $113 million in transfers from Ethereum to alt chains like Solana, Sui, and Arbitrum over the past week.\n\nHas the market forgotten that in the eyes of the SEC, they are all securities? Probably. Or maybe traders are just confident that Coinbase and Binance will emerge victorious in their legal battles with the regulator.\n\nIn June 2023, the SEC filed back-to-back lawsuits against Coinbase and Binance for allegedly selling unregistered securities, among other things. The regulator named 13 cryptocurrencies available on Coinbase and ten that trade on Binance securities — despite none of these issuers being named co-defendants in the cases.\n\nThe SEC has also not filed any individual lawsuits against these alleged security token issuers, opting to take a different approach than it did in 2020 when it sued Ripple over its XRP token — a suit that ultimately did not play out in the regulator’s favor.\n\nBoth cases are still playing out in the legal system, and you might remember the SEC was notably absent from the Department of Justice’s historic $4.3 billion settlement with Binance back in November.\n\nBut if you look at token prices, you’d think the SEC had dropped the cases.\n\nCoinbase and Binance are both waiting for rulings in their motions to dismiss their respective cases. If the suits are not fully dismissed, the exchanges will move on to the discovery process.\n\n— Casey Wagner\n\nCan’t stop, won’t stop?\n\nAfter offering an oversubscribed round where MicroStrategy (MSTR) raised nearly $800 million in senior convertible notes — mind you, they initially sought to raise $600 million before upsizing to $700 million last week — the company has proposed another $500 million in convertible notes.\n\nMSTR could, all-in-all, raise around $1.3 billion from its convertible notes offerings to fund its bitcoin purchases.\n\nWhile this represents a new approach to the same tactic we’ve seen from MSTR in the past, Michael Saylor’s firm might have found a way to ensure that the stock remains more attractive than the bevy of bitcoin ETFs on the market today.\n\nBy the numbers: MSTR has about $48 million in cash on hand as of December, but it has roughly $15 billion worth of bitcoin at current prices.\n\nIt’s fair to note that while the company may spend that cash on hand, MicroStrategy appears to largely plan to add to its BTC hoard. The stock was around before the bitcoin ETFs, and so far, it looks like it won’t only stick around, but may even outperform.\n\nCompare IBIT and MSTR, for example. MSTR is outperforming BlackRock’s ETF even as the two go head-to-head over who holds the most bitcoin.\n\nMSTR’s bitcoin buying spree has proven to be a win-win for them: Wall Street’s happy and, more importantly, the crypto crowd goes bonkers when the company announces a new buy. And, trust me, the company is always announcing new buys. This year alone, MSTR has bought nearly 16,000 bitcoin.\n\nAdding to that, when bitcoin’s price rockets, so does the company’s stock. The company, at the end of 2023, was trading around $680. Now, the stock is getting close to $2,000 — up 200% in the last three months alone.\n\nSuffice to say, Saylor and MSTR keep hodling. The company isn’t afraid to hit the buy button — even if it means raising some debt to do so — and the most recent debt offerings show that the company’s appetite remains ravenous.\n\n— Katherine Ross\n\nThe Works\n\nWelcome to The Works 👋 Your daily slice of crypto (and not-so-crypto) from around the Web. 🕸️\n\n💸 Bakkt against the wall? The publicly-traded crypto company once owned by finance giant Intercontinental Exchange is facing an existential dilemma after receiving a notice from NYSE about its sub-$1 share price.\n\nBakkt’s been below a buck since the end of February, but it’s pledging to “cure” the problem. Stay tuned.\n\n🧠 The crypto team at Franklin Templeton thinks “meme coins have a strong relationship with their native networks.” The top response on X? “[w]e need a memecoin ETF” — something we’re sure Gary Gensler would love.\n\n🐕Speaking of memecoins: X owner Elon Musk, visiting Tesla’s Berlin manufacturing plant, was asked when people can buy a car with dogecoin.\n\nMusk’s response, according to a video from X user @dogeofficialceo: “At some point, I think we should enable that.” He then talked up how people can buy merch with the dog-themed memecoin.\n\n🌱 A bitcoin ETF proposed last December would load up on 20% carbon credits, per a new regulatory filing.\n\n🤬 The CEO of Palantir, Alex Karp, is a bit, uh, steaming mad about short sellers.\n\n😕 Today’s why-is-this-a-crypto headline: “What the Kate Middleton story tells us about bitcoin”\n\nThe short answer, per the FT’s Bryce Elder: “[a]bsolutely nothing.” Okie doke.\n\n🚚 BitKey, Jack Dorsey’s bitcoin hardware wallet play, is (finally?) enroute to people’s mailboxes. Get excited.\n\n⚖️ Finders keepers: Australia’s finance regulator lost a legal fight against the Finder Wallet Pty Ltd, with a court saying the firm did not offer an unlicensed financial service.\n\n🔬 Researchers over at the Bank of International Settlements dug into DeFi borrower behavior in a new study.\n\n🤔Summing it up: Investor and AngelList co-founder Naval Ravikant believes that crypto is “adversarial venture capital.” Makes you think.\n\n— Michael McSweeney\n\nThe Morning Riff\n\nTranslation: We’re so back (source)\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    }
]