[
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTFBLeU5sVmo0eGJfcnFUNXNESWwwV1kzUjBqUHcwUGIxUzhsRjFFQVBjakRiNTc4YmpVYl9UM2JGZGYxc1BMMFdWUlZQM2c3dE1HRDVXQVhVZGFwb1V4ZEpHQUo4MW5xam1lX2dTZ1lySGJ2dGpm0gF6QVVfeXFMTmpONk8xSVdJNTgtUWhwNEZDc0hhQUhvQk5RcW5BWjVmRThOS21GRUtBV1NadVdkRGdyYXpTRzlRN1hxTTI5M2FwbVVjVDdBc1VFMUthekhfM0cwYlU5UExMUnpTSHVScVVjaGx0MGgxQjVnSzlxbGxkcVE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Jun 2024 07:00:00 GMT",
        "title": "Ethereum's price soars as SEC probe concludes - Forkast News",
        "content": "Ether’s value surged past US$3,500 as the U.S. Securities and Exchange Commission (SEC) wrapped up its investigation on Ethereum.\n\nThe conclusion of the SEC’s investigation, which did not result in any charges related to Ethereum’s sales as securities, has been met with enthusiasm from investors and the Ethereum community.\n\nThis development comes after Consensys, an Ethereum developer, contested the SEC’s regulatory stance, advocating for Ethereum’s classification as a commodity.\n\nConsensys’ legal challenge, initiated in April 2024, sought to limit the SEC’s regulatory reach over Ethereum and to obtain a judicial declaration affirming its commodity status.\n\nThe culmination of this legal battle, combined with public and political support, prompted a favorable outcome from the SEC’s Enforcement Division on June 18.\n\nThe resolution of the SEC’s scrutiny lifts a major uncertainty that had been casting a shadow over Ethereum, potentially impacting its classification and market demand.\n\nThe announcement of the investigation’s end was met with an immediate response in the market, with Ethereum’s trading price climbing to $3,586, according to CoinGecko.\n\nThe SEC approved a series of spot Ether exchange-traded funds (ETFs) last month, paving the way for their trading on the stock market.\n\nAnnounced on May 23, this decision came amidst legislative efforts to define the regulatory roles of the SEC and the Commodity Futures Trading Commission in the crypto industry, with the Financial Innovation and Technology for the 21st Century Act still pending in the Senate."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxNeV9Xa1pVWWNHek1LN0J3ZjFwc1NqdkFHZHJzZTF4T25QYTZMY1VjWUJ0ZUdSR3NxWEhubFcyT01FY2xyQ0pPdkdkMUlfT2JkTHl6dVlKc1VpUjhZVUJJT3VYUlBnVzhBLVFPU1pwR2t5Ymx0NWpsaGRucFJCUk13TldOaU5zellqVWZ4UDgtYVNSbHFaVld1cW1CQ2M4R0ZCb0hXT1E0OFFKcmd4Y2stMG9B?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Jun 2024 07:00:00 GMT",
        "title": "Ethereum gets huge win as SEC closes investigation into securities sale allegations - CryptoSlate",
        "content": "The SEC has closed its investigation into Ethereum 2.0, determining that sales of ETH are not securities transactions. The decision comes after a letter from Consensys on June 7, seeking clarity following the May approvals of ETH ETFs, which were based on ETH being classified as a commodity. Consensys stated,\n\n“Today we’re happy to announce a major win for Ethereum developers, technology providers, and industry participants: the Enforcement Division of the SEC has notified us that it is closing its investigation into Ethereum 2.0. This means that the SEC will not bring charges alleging that sales of ETH are securities transactions.”\n\nEthereum rose over 4% overnight following the news, pulling the rest of the crypto market with it as many projects positive over the past 24 hours. Bitcoin is the notable exception, down 0.74% according to CryptoSlate data as of press time.\n\nConsensys announced this development as a significant victory for Ethereum developers and the broader industry. The closure of the investigation signifies a pivotal moment for the Ethereum community, providing a reprieve from potential regulatory actions that could have categorized ETH as a security. The SEC’s decision aligns with the Commodity Futures Trading Commission’s (CFTC) stance, which has consistently classified ETH as a commodity.\n\nDespite this positive outcome, Consensys continues its legal battle against the SEC to secure further regulatory clarity. The company argues that the SEC’s enforcement actions against blockchain developers and technology providers have been overly aggressive and unlawful. Consensys’s lawsuit also seeks a declaration that offering user interface software like MetaMask Swaps and Staking does not violate securities laws.\n\nAs Consensys emphasized, the legal fight is not just about Ethereum but about safeguarding the future of blockchain innovation in the United States. The SEC’s stance on Ethereum had posed a risk to adopting and developing blockchain technologies, with potential negative implications for US leadership in this sector. By challenging the SEC’s authority, Consensys aims to prevent what it describes as an unlawful power grab that could hinder technological advancements and economic opportunities.\n\nThe resolution of the Ethereum investigation marks a critical juncture, but Consensys insists that the broader regulatory environment still requires significant reform. The company’s lawsuit highlights the need for clear guidelines that support innovation while ensuring compliance with existing laws. As the blockchain industry evolves, resolving these regulatory issues will be crucial in determining the pace and direction of technological progress.\n\nAccording to Consensys, fighting for regulatory clarity is essential to ensuring blockchain technology continues growing and contributing to the economy. The company’s actions reflect a broader concern within the crypto community about the need for balanced regulation that fosters innovation without stifling growth.\n\nIndustry participants and regulators alike will closely watch the outcome of Consensys’s ongoing legal battle with the SEC. The case highlights the tensions between regulatory oversight and technological innovation, a dynamic that will shape the future of blockchain technology and its applications.\n\nMentioned in this article"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE85WGUxVl9GSWdKVGRyTE9maTlYaEVTakJCUHM5Q2doM1JoT0FMUDRBbHpFYUR5ZHNmT0RLd05BS2xZVGtqbHlCQV9PMzEwWHI4alNDZG1abGZnQUtuODBRaUJJdkhaZ1J0dFhqMGJIR1JOTkdOWlpZQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Jun 2024 07:00:00 GMT",
        "title": "SEC drops investigation into Ethereum studio Consensys - Blockworks",
        "content": "Ethereum fans can breathe a sigh of relief.\n\nThe US Securities and Exchange Commission (SEC) has formally dropped its investigation into the blockchain’s ecosystem.\n\nEthereum development studio Consensys shared the news on X overnight.\n\n“Today we’re happy to announce a major win for Ethereum developers, technology providers, and industry participants: the Enforcement Division of the SEC has notified us that it is closing its investigation into Ethereum 2.0,” the company posted.\n\n“This means that the SEC will not bring charges alleging that sales of ETH are securities transactions.”\n\nLoading Tweet..\n\nIndications of an SEC probe into Ethereum and entities supporting the protocol circulated in March, when Fortune reported the agency was investigating three unnamed related companies for potential securities violations.\n\nConsensys then sued the SEC one month later, alleging regulatory overreach. The suit claimed chairman Gary Gensler sought to grab power over the crypto space, using legal maneuvers that would force ETH into a security definition following its switch to proof of stake in September 2022.\n\nPart of those filings disclosed that Consensys had received a Wells notice from the SEC, indicating the agency’s intent to sue. The Fort Worth firm, which owns popular web3 infrastructure including crypto wallet MetaMask and API provider Infura, was founded by Ethereum co-founder Joe Lubin.\n\nWhile the SEC probe was expected to be dropped following approval of a suite of spot ether ETFs last month, the formal notice puts to bed one of crypto’s primary existential threats, at least for now.\n\nFormer SEC chair Jay Clayton had initially backed SEC Director of Corporation Finance William Hinman’s notion that ether was no longer a security in 2019, as there was no central entity in control of the cryptocurrency at the time. No official statement had been given by the agency, however, and Gensler had seemingly been walking back those thoughts ever since.\n\nOn Wednesday morning, Alexander Grieve, government affairs lead at venture capital firm Paradigm, tweeted a copy of the SEC’s letter to Consensys. It reads:\n\n“We write to provide notice that we have concluded the investigation in the [matter of Ethereum 2.0]…. based on the information we have as of this date, we do not intend to recommend an enforcement action by the Commission against your client, Consensys Software Inc. with respect to this investigation.”\n\nLoading Tweet..\n\nThe letter added that the notice was given under guidelines in the Securities Act which state that it “must in no way be construed as indicating that the party has been exonerated or that no action may ultimately result from the staff’s investigation.”\n\nAll good news for Consensys but other legal threats still loom over crypto. So far, there’s no word of the SEC’s Uniswap probe being dropped, although a lawsuit has not yet been filed.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the Forward Guidance newsletter.\n\nGet alpha directly in your inbox with the 0xResearch newsletter — market highlights, charts, degen trade ideas, governance updates, and more.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxNQ1YxNldJTURIdFhuTnNoUlZsckZuYWtQNkhyRWdZZ3N4a2NMZ1hCYS1CWU1lakJVeE9Ia3p6cEw3bFhEQU9JaExkcl9TcTRBVkJoLW9ma2J2T29ocVprRm1sZ0ZpRDF1V19jZi1tTVgydG55Vk5uM1dtdVRvTW44enlkb01vVzBNb0NB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Jun 2024 07:00:00 GMT",
        "title": "Investing Smart: Ethereum’s ETF Progress, Bitcoin’s Decline, and Furrever Token’s Rewards - Yahoo Finance",
        "content": "Furrever Token\n\nNew York City, NY , June 19, 2024 (GLOBE NEWSWIRE) --\n\nAs the cryptocurrency market evolves, investors are constantly seeking smart investment opportunities. The latest developments show Ethereum making significant strides with its ETF progress, while Bitcoin experiences a decline in dominance. Amid these changes, Furrever Token presents a unique and rewarding investment option.\n\nEthereum’s ETF Progress\n\nEthereum has been gaining traction with its exchange-traded funds (ETFs), surpassing Bitcoin in terms of performance and investor interest. The approval and launch of Ethereum ETFs have sparked optimism among investors, positioning ETH as a strong contender in the crypto market. This progress reflects the growing confidence in Ethereum’s long-term potential and its robust decentralized finance (DeFi) ecosystem.\n\nBitcoin’s Decline\n\nBitcoin, the pioneer of cryptocurrencies, has seen its dominance drop to 56%. This decline suggests that investors are diversifying their portfolios and exploring other promising assets. While Bitcoin remains a significant player, its reduced market share highlights the expanding landscape of digital assets and the potential for altcoins to gain prominence.\n\n\n\n\n\nFurrever Token: A Smart Investment Choice\n\nIn the midst of these market dynamics, Furrever Token (FURR) offers a unique and engaging investment opportunity. Designed around cute cat-themed imagery, Furrever Token aims to create a fun and community-driven ecosystem. Here’s why investing in Furrever Token during this period is a smart move:\n\nInnovative Referral System\n\nFurrever Token’s referral system allows users to earn 10% in FURR tokens for every deposit made through their personal referral links. This system incentivizes community growth and provides a source of passive income. By sharing referral links with friends, family, and social networks, users can actively contribute to the project’s expansion while reaping financial rewards.\n\nAttractive Tokenomics\n\nFurrever Token’s tokenomics are designed to ensure security and trust within the community. With a total supply of 9 billion tokens, 65% are allocated for the presale, 25% for decentralized exchanges (DEXs), and 10% for the team, locked for one year. The presale has already raised over $1.3 million, currently in its 9th stage, with the potential for up to 15X returns for early investors. The current price of Furrever Token is $0.000732, presenting an attractive entry point for those looking to invest in a project with both financial and emotional rewards.\n\nCommunity Engagement and Future Growth\n\nFurrever Token places a strong emphasis on community engagement. The project’s mission is to create a fun, user-friendly environment where investors can enjoy their experience while contributing to the growth of the ecosystem. Regular challenges, exclusive cat-themed content, and active community interaction make Furrever Token an appealing choice for both seasoned investors and newcomers.\n\nStory continues\n\nConclusion\n\nAs Ethereum’s ETF progress and Bitcoin’s decline reshape the cryptocurrency market, Furrever Token offers a refreshing and rewarding alternative. Its unique referral system, attractive tokenomics, and strong community focus make it a smart investment choice during this period of market transformation.\n\nInvesting in Furrever Token not only provides potential financial returns but also an enjoyable experience within a vibrant and supportive community. Don’t miss out on the chance to be part of this exciting project—visit furrevertoken.com to join the presale and create your referral link today.\n\n\n\nJoin Furrever Token Presale Now:\n\nFurrever Token Official Website\n\nVisit Furrever Token Presale\n\nJoin Official Telegram Group\n\nFollow Official X Account\n\n\n\nMedia Contact:\n\nRobert Smith\n\nhttps://furrevertoken.com/\n\nsupport (at) furrevertoken.com\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\n\n\n\n\nCONTACT: Robert Smith support (at) furrevertoken.com\n\n\n\n"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxNQ1YxNldJTURIdFhuTnNoUlZsckZuYWtQNkhyRWdZZ3N4a2NMZ1hCYS1CWU1lakJVeE9Ia3p6cEw3bFhEQU9JaExkcl9TcTRBVkJoLW9ma2J2T29ocVprRm1sZ0ZpRDF1V19jZi1tTVgydG55Vk5uM1dtdVRvTW44enlkb01vVzBNb0NB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Jun 2024 07:00:00 GMT",
        "title": "Investing Smart: Ethereum’s ETF Progress, Bitcoin’s Decline, and Furrever Token’s Rewards - Yahoo Finance",
        "content": "Furrever Token\n\nNew York City, NY , June 19, 2024 (GLOBE NEWSWIRE) --\n\nAs the cryptocurrency market evolves, investors are constantly seeking smart investment opportunities. The latest developments show Ethereum making significant strides with its ETF progress, while Bitcoin experiences a decline in dominance. Amid these changes, Furrever Token presents a unique and rewarding investment option.\n\nEthereum’s ETF Progress\n\nEthereum has been gaining traction with its exchange-traded funds (ETFs), surpassing Bitcoin in terms of performance and investor interest. The approval and launch of Ethereum ETFs have sparked optimism among investors, positioning ETH as a strong contender in the crypto market. This progress reflects the growing confidence in Ethereum’s long-term potential and its robust decentralized finance (DeFi) ecosystem.\n\nBitcoin’s Decline\n\nBitcoin, the pioneer of cryptocurrencies, has seen its dominance drop to 56%. This decline suggests that investors are diversifying their portfolios and exploring other promising assets. While Bitcoin remains a significant player, its reduced market share highlights the expanding landscape of digital assets and the potential for altcoins to gain prominence.\n\n\n\n\n\nFurrever Token: A Smart Investment Choice\n\nIn the midst of these market dynamics, Furrever Token (FURR) offers a unique and engaging investment opportunity. Designed around cute cat-themed imagery, Furrever Token aims to create a fun and community-driven ecosystem. Here’s why investing in Furrever Token during this period is a smart move:\n\nInnovative Referral System\n\nFurrever Token’s referral system allows users to earn 10% in FURR tokens for every deposit made through their personal referral links. This system incentivizes community growth and provides a source of passive income. By sharing referral links with friends, family, and social networks, users can actively contribute to the project’s expansion while reaping financial rewards.\n\nAttractive Tokenomics\n\nFurrever Token’s tokenomics are designed to ensure security and trust within the community. With a total supply of 9 billion tokens, 65% are allocated for the presale, 25% for decentralized exchanges (DEXs), and 10% for the team, locked for one year. The presale has already raised over $1.3 million, currently in its 9th stage, with the potential for up to 15X returns for early investors. The current price of Furrever Token is $0.000732, presenting an attractive entry point for those looking to invest in a project with both financial and emotional rewards.\n\nCommunity Engagement and Future Growth\n\nFurrever Token places a strong emphasis on community engagement. The project’s mission is to create a fun, user-friendly environment where investors can enjoy their experience while contributing to the growth of the ecosystem. Regular challenges, exclusive cat-themed content, and active community interaction make Furrever Token an appealing choice for both seasoned investors and newcomers.\n\nStory continues\n\nConclusion\n\nAs Ethereum’s ETF progress and Bitcoin’s decline reshape the cryptocurrency market, Furrever Token offers a refreshing and rewarding alternative. Its unique referral system, attractive tokenomics, and strong community focus make it a smart investment choice during this period of market transformation.\n\nInvesting in Furrever Token not only provides potential financial returns but also an enjoyable experience within a vibrant and supportive community. Don’t miss out on the chance to be part of this exciting project—visit furrevertoken.com to join the presale and create your referral link today.\n\n\n\nJoin Furrever Token Presale Now:\n\nFurrever Token Official Website\n\nVisit Furrever Token Presale\n\nJoin Official Telegram Group\n\nFollow Official X Account\n\n\n\nMedia Contact:\n\nRobert Smith\n\nhttps://furrevertoken.com/\n\nsupport (at) furrevertoken.com\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\n\n\n\n\nCONTACT: Robert Smith support (at) furrevertoken.com\n\n\n\n"
    }
]