[
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxPSk5VNm1pWkpfYzE1Q25mY2g1YzI5bkFUM0dtUUpST29NQ0FXUWZJMGRDMDRVMUcwMTlBM0JkVnZRcGZZRjdZLTY4NUQ4azdHbFdPa2JHSXBkYVAzWGJHX3JzSEU2OU44a1ZwR29QSXUwRHh3c0otSXVtMGtiM2wxaUlCWXbSAYoBQVVfeXFMTzRQakRqLVpRRE1YRkI5eVQ4c25yLUxtSThTZGItVUs4WDR6TWk3LTZHeUExeHNBdWhlcTBLMGk1NFRfcnhZMURza3lGVGpRRFJIRlF0enQyN0lDay1lVm5Cam1ZNjV0YXdqVncweElRNDJ1eEtLV0tsMDdqUW9oYWN3Sk1YRUpxTUZn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Apr 2024 07:00:00 GMT",
        "title": "Ethereum: These 4 ‘culprits’ fueled sell-offs, 7% price fall - AMBCrypto News",
        "content": "Institutions sold ETH worth $105 million during the latest correction\n\nOn-chain data suggested the decline could be an opportunity to buy before another rally starts\n\nFour whales including notable institutional investors took part in selling off some of their Ethereum [ETH] holdings as the altcoin’s price collapsed on the charts. In fact, ETH depreciated by over 7% in just 24 hours.\n\nAccording to Lookonchain, Cumberland, a trading firm, sent a total of 17,206 ETH to exchanges. At the time of the transactions, the coins were worth $57.3 million. FTX also deposited $8.33 million worth of ETH to Binance. Finally, the other two institutions sold a combined $39.92 million in ETH.\n\nOnly the short-sighted may be affected\n\nWhales sell their assets for different reasons. For some, it could be a normal profit-taking event. For others, it could be an avenue to let go after a cryptocurrency has underperformed. However, this altcoin does not seem to fall into this category.\n\nAt the time of writing, AMBCrypto could not confirm why the parties sold. But one thing was certain— The sell-offs played a big role as Ethereum’s price fell to $3,169. At press time, ETH was valued at $3,262, indicating that the cryptocurrency recovered slightly. However, it is important to check if the cryptocurrency can sustain this mild uptrend.\n\nTo do this, AMBCrypto looked at some metrics which could affect the value. First on the list was the Mean Dollar Invested Age (MDIA).\n\nThe MDIA is the average age of coins held in the same wallet. If the metric increases, then it means many coins are less active, and have remained in the same place for a long while. On the other hand, a falling MDIA implies that old coins are moving. For Ethereum, on-chain data from Santiment revealed that the 90-day MDIA spiked.\n\nHistorically, a massive decline in the metric was accompanied by a local top. Therefore, the recent increase suggested that ETH could be undervalued, and the latest correction could be a chance to buy at lower prices before its potential rally begins.\n\nIs the next path great?\n\nNetwork growth was another metric AMBCrypto analyzed. This metric gauges user adoption over time. If it increases, then it means a project is gaining traction. If it decreases, it implies that the project is losing traction.\n\nOn 12 April, Ethereum’s network growth was 128,000, indicating that a lot of new addresses interacted with the project.\n\nHowever, it seemed that the price decline caused the number to fall to 36,100. If network growth improves, demand for ETH might help the price action jump.\n\nConversely, a decline in the metric could result in stagnancy for the value. In addition, the one-day circulation dropped to 230,000, reinforcing the notion of decreased usage.\n\nIs your portfolio green? Check the ETH Profit Calculator\n\nThat being said, the drop in circulation could be good for ETH as it could be a sign of less selling pressure. Should the number of coins used continue to fall, then ETH’s price might exit the awful state it has been in over the last 24 hours."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxObHh5UW1UY3VVVTZ2T1dxendLbWNUbE01a3ZMRU9CNklWNHl5cGFVaVVGOWtnV2dPZk5mVkZ4emE4QV80aEVpV2tqNmw4MV9sYTlHR0IyVHJBMk1LdHNqalVwY1Z3Ry1pYVBvRDdFT1lsQlNwMzNKMGtvLU1CeVMxX3JsOEVaRWQ0QlZRekQwZkczaWRpRzV4VnItdnh5V3d5ekx2Tk1iMy1jY2wtbjN4Y0dtMGsyTTYzQ2ljRTAyYTdldw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Apr 2024 07:00:00 GMT",
        "title": "Aptos and Ethereum Classic Anticipate Incoming Rally, As Presale Star KangaMoon Nears $5M - Techpoint Africa",
        "content": "Despite Aptos (APT) and Ethereum Classic (ETC) trading within narrow ranges, both coins maintain solid support from investors. While Aptos hovers between $12.1 and $14.7 throughout the week and Ethereum Classic aims for new highs, attention turns to KangaMoon (KANG). Having raised over $4.7 million in its fifth stage of its ongoing token presale, KangaMoon is attracting an influx of investors, many of which expect the value of the native KANG token to increase over time as the project develops and gains mainstream adoption.\n\nKangaMoon (KANG) Finally Hits the $4.7 Million Price Milestone\n\nIn the meme coin market, KangaMoon (KANG) exhibits its promising potential and unique features. By combining SocialFi with GameFi’s Play-to-Earn concept, KangaMoon lets users earn rewards by participating and engaging in battle contests, periodic challenges as well as through speculative betting. Speaking of which, users can win different rewards, including the native KANG tokens or even high-value in-game items, which can be traded for real cash on the platform’s dedicated marketplace.\n\nRight now, KangaMoon is in its fifth stage of the token presale and has already raised over $4.7 million, with projections of hitting $6 million by the end of the month. Having started at an initial offering price of $0.005, the KANG token witnessed a price increase to $0.0196, delivering to early buyers a 290% ROI.\n\nMeanwhile, KangaMoon has a growing community of over 6,000 token holders and 20,000 users. As the presale continues, these numbers are projected to increase further. As such, analysts believe the token could increase by 1000% from its current value shortly after it enlists on top-tier exchanges, offering huge potential for early investors.\n\nConclusively, KangaMoon is strategically positioning itself as a top meme coin project in the broader crypto market, especially as it leverages its innovative tactics and community-focused vision. Furthermore, key activities such as social media promotion, account verification, and active community engagement, with a growing referral program, add to its appeal, further solidifying KangaMoon's position among the top meme coins.\n\nAptos (APT) Token Recently Forms Partnership to Boost Network Activity\n\nAptos (APT) is showing signs of a potential market breakthrough, with increased trading volume and positive technical indicators. However, on the monthly chart, the native APT tooken saw about a 7% decline, and a nearly 17% drop on the weekly price chart, trading between $12.1 and $14.7. Despite recent sluggish momentum, Aptos reached $18.1 this year, giving hope to investors.\n\nMeanwhile, in a recent post on X, Aptos highlighted efforts to make AI technology more accessible within its ecosystem and beyond. Partnering with Ionet, Aptos network aims to offer distributed and scalable GPU resources, alongside various AI models and products. This collaboration seeks to utilize Aptos' safety, speed, and performance to support innovative AI solutions by ionet, potentially boosting both Aptos' price and investor confidence in acquiring more Aptos tokens.\n\nEthereum classic (ETC) Network Anticipates a Rally in Coming Weeks\n\nEthereum Classic (ETC) is hoping for a price surge soon, as it has only seen modest gains in April. Traders are waiting for a possible rally, which could lead the Ethereum Classic price to new highs. Currently, the ETC token is trading around $32.57, but if the rally doesn't happen soon, it might drop.\n\nAmidst this anticipation, Ethereum Classic aims for a breakout as it has been stuck between $34 and $38 since the beginning of the year. Although Ethereum Classic price dropped by 11.53% last month, it went up by 7.49% this week, from $30.1 to $35.8. Given these developments, investors are now turning their attention to KangaMoon, finding it the best crypto option with promising features and growth potential.\n\nDiscover the Exciting Opportunities of the KangaMoon (KANG) Presale Today!\n\nWebsite: https://KangaMoon.com/\n\nJoin Our Telegram Community: https://t.me/KangaMoonofficial"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTE5uR2c5d05FNGpaTUFVRmx5b2t6cTZDSmo2VEkteVJDZlhkZVI0dTFvZ0l4WkNwUFRBUWVJVVhXSDZDRE0wS0UtLTN2bWxKUXR6ZGNWZjIySzhzdkhCNWxMYWZmdGc4eFNVWU85YVgwRHp6Tkpn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Apr 2024 07:00:00 GMT",
        "title": "Cronos (CRO): Overview and Examples in Cryptocurrency - Investopedia",
        "content": "What Is Cronos (CRO)?\n\nCronos (CRO) is the cryptocurrency token for a blockchain developed and run by the cryptocurrency exchange Crypto.com. The Cronos network is designed to be a high-performance, interoperable blockchain that can support decentralized applications (dApps) and apps without central intermediaries, which tend to run on a variety of Ethereum-based blockchain spinoffs.\n\nKey Takeaways Cronos is a blockchain with a native token CRO, designed as a nexus for decentralized finance (DeFi), non-fungible token (NFT), and metaverse projects in the decentralized application (dApp) ecosystem.\n\nCronos's interoperability can connect it to the Ethereum and Cosmos blockchains behind many dApps.\n\nCrypto.com offers a variety of benefits for holding and using CRO, including lower trading fees, staking rewards, exclusive access to products and features, and more.\n\nHistory of Cronos and CRO\n\nCronos is an open-source blockchain and token that was launched in November 2021 by Crypto.com, one of the world's largest cryptocurrency exchanges, to support a growing demand for dApps in the decentralized finance (DeFi), non-fungible token (NFTs), and metaverse space. Because most of these dApps overwhelmingly run on disparate derivatives of Ethereum, a blockchain was needed to bridge them together and process the high volume of transactions that would result from such cross-integration.\n\n\n\nCronos stepped in to address Ethereum's dApp and scalability limitations with interoperability frameworks and consensus engines that allow multiple blockchains to connect and exchange assets and data at significant loads without the need for intermediaries. Cronos is claimed to have the ability to process over 10,000 transactions per second (TPS), which is significantly higher than Ethereum's TPS, which averages about 13.\n\nIn addition to being able to connect multiple dApps at the same time, Cronos allows developers to create and host dApps from different blockchains. Cronos's interoperability standards allow the network to run smart contracts from various Ethereum-like blockchains with little to no modifications. Smart contracts are self-executing programs that can be used to automate various actions on a blockchain and do things other than simply transfer a cryptocurrency.\n\nCronos vs. Other Popular Blockchains\n\nOne of the most significant differences between Cronos and popular blockchains like Ethereum and Bitcoin is that it uses proof-of-authority (PoA) consensus and validation rather than proof-of-work or proof-of-stake.\n\nValidators are chosen by invitation only, with developers occasionally opening periods for accepting applications. Cronos' PoA uses 24 hand-picked validators to verify transactions and open new blocks, giving the consensus mechanism \"authority\" because the chosen validators have been vetted and are trusted.\n\nThis is a stark contrast to other chains that use systems of anonymous validators. Cronos is thus a hybrid of public and private blockchains, a decentralized private blockchain that is open to the public for use.\n\nTypes of Apps That Use Cronos\n\nFive billion CRO, a significant portion amounting to around 17% of the total CRO supply, was allocated to Crypto.com and its affiliates, including the Crypto.com team, advisors, and reserves for future development. Pre-allocated tokens can concentrate power and decision-making in the hands of a few and give insiders an advantage over public participants. For example, pre-mined tokens dumped on the market can negatively crash the token price and discourage later investors.\n\n\n\nCRO Token's Role in Cronos\n\nMuch like the ether (ETH) token for the Ethereum blockchain, the CRO token plays a crucial role in the Cronos blockchain ecosystem as a native utility token driving various aspects of its functionality. CRO is used for transactions, staking, and governance, incentivizing users to hold and participate in the network. Demand for CRO as a utility token fuels its liquidity and contributes to the stability of the Cronos ecosystem, creating a positive feedback loop.\n\nCRO is the primary currency used for paying transaction fees on the Cronos network and facilitating seamless asset transfers between Cronos dApps without having to swap into multiple tokens. Every interaction with the Cronos blockchain requires users to spend a small amount of CRO to promote responsible network usage and prevent spam.\n\nCRO holders can participate in staking, where they lock their tokens to a whitelisted validator for a specified period to support the network's security, stability, and decentralization, deterring the blockchain from threats. In return, they earn rewards in the form of additional CRO tokens and voting rights for governance decisions about the blockchain's future direction, including proposing upgrades, fee structures, and new integrations with other blockchains.\n\nCronos doesn't use a consensus mechanism like Bitcoin's Proof-of-Work (PoW) model, which involves competitive cryptographic problem-solving and network-wide consensus to agree to the validity of transactions. Cronos's Proof-of-Authority (PoA) consensus mechanism relies on staked validators that have already been trusted to process and reach consensus on transactions and the state of its blockchain. It is also different from Ethereum's Proof-of-Stake (PoS) model, which randomly chooses its staking validators.\n\nConcerns About Cronos\n\nCrypto.com, a cryptocurrency exchange, is the parent company for Cronos (CRO), using it in its blockchain operations. The company shut down U.S. institutional trading in June 2023, claiming there was not enough interest from this group to justify keeping the platform open to it.\n\nRetail U.S. investors can still trade on Crypto.com, but the liquidity generally provided by institutional traders in the United States is not present on the platform. This can cause issues for investors who use it. For instance, there was $35.2 million in 24-hour trading volume on April 14, 2024, much less than many other cryptocurrencies.\n\nAdditionally, there were only 8,554 active Cronos addresses on April 12, 2024, suggesting that there are only a limited amount of people using the blockchain. Investors looking for trading opportunities or the ability to move in and out of positions quickly might consider other cryptocurrencies to ensure they are not caught in liquidity traps.\n\nIs Cronos on Ethereum? Cronos is built on the Cosmos SDK, so it is not on Ethereum. However, it is a highly interoperable blockchain that can communicate with Ethereum.\n\nDoes CRO Have a Blockchain? Yes, CRO is the native token for the Cronos blockchain.\n\nIs Cronos a Layer 1 Blockchain? In blockchain terms, \"layer\" refers to other chains that operate in tandem with a primary blockchain, completing tasks for that blockchain. Layer 1 is the term used to refer to primary blockchains, so Cronos is a layer 1 blockchain.\n\nThe Bottom Line\n\nCronos is a fast, interoperable blockchain, with its own native token CRO, that aims to be a user-friendly hub for DeFi, NFTs, the metaverse within the broader dApp environment.\n\n\n\nThe comments, opinions, and analyses expressed on Investopedia are for informational purposes only. Read our warranty and liability disclaimer for more info. As of the date this article was written, the author owns/does not own cryptocurrency.\n\n"
    }
]