[
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTE4xb0s1blJOMV9qempyYlZXNWk5Y0NFbWpnNEpBbG5OQmpreHM1YzluVFFLbXhseVB6ZjBMeHhxYlBEby1oVGFHRC1uZVg4cElKOUFnXzAwYWV4SEI5b3ZIQ2daQjg2TDllU0Nocy1idjNyY0ZN0gF8QVVfeXFMTnd3QlVtZ1dvTDVMY1prLXZqWmtoT3lXYTV5U0ktVHVCVDJqamRmTmQ1eHV1Tno0V0pQOEJ3V1RtdXl6cUc5cGJCV3lGMkJrRDlYMkItQ19hbk5aNjh0Sm1WVkphcldhRjdIdXFIUHhSVkdjV1YtZ3JoaHkxRA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 08 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Staking Booms, With 25% of All ETH Locked Up - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nA quarter of all Ethereum (ETH) in supply is now being staked, data shows. According to figures from blockchain data firm Nansen, over 30 million ETH—or about $74 billion worth of the cryptocurrency—has been locked up.\n\nStaking is the process of “locking up” digital coins or tokens to help keep a blockchain network running. Proof-of-stake assets like ETH require users to pledge their coins to the network by sending it to a specific blockchain address. Those who stake earn token rewards in the process.\n\nLast year, the Ethereum network was upgraded, allowing users to easily withdraw staked ETH. Since then, liquid staking protocols have boomed—allowing users to seamlessly lock up and withdraw their crypto.\n\nAs ETH enthusiasts eagerly await the approval of an exchange-traded fund (ETF) that brings the second-largest digital asset to Wall Street, applicants are talking about staking in their proposals. Yesterday, investment firm Ark 21Shares amended their spot ETH ETF S-1 to mention the practice.\n\nAD\n\nAD\n\n“The sponsor may, from time to time, stake a portion of the trust’s assets through one or more trusted staking providers,” the filing read.\n\nStaking is controversial with regulators, though: The U.S. Securities and Exchange Commission has fined major crypto companies—such as digital asset exchanges Kraken and Coinbase—for allegedly selling unregistered securities via staking services.\n\nThe Ethereum network is in the process of an upgrade, too. Developers this week finalized the Dencun upgrade on a testnet. It is now expected to go live on the mainnet by March 13.\n\nDevelopers claim that Dencun will solve the scalability problem of the network behind the world’s second-biggest cryptocurrency—which is slow and expensive—so that it will potentially be able to process over 100,000 transactions per second in the future.\n\nAD\n\nAD\n\nEdited by Andrew Hayward"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiygFBVV95cUxOcFg3d1VfMW90cXNUMjJmVzZFTUswVGRKYjBsSnVsYXQ3ZjBabzhEa0JQN29QdU45RFAzQ2NZTDlXMVBQVXZfcFZhVC10LWJkNmdTU0dWSjhwN1c0Y1AtUXQtRzZjclZld1RzWk1PYTdzUDVmLUliMTlvRnYySXUtRWdNQUtadHlUcVhuNkZTSkxOT0dtSl9TcUlRNUJSTXZVUEFSai1uRmJtLWpGWXZpSUNpV3VzTWo5S0hCN0pzS0hvLVJrb1BTMG9n0gHPAUFVX3lxTFBNUU9YZTZjUV9UTmVpVkllSEhaaXVHaDNLM2dhX1VJWlk3dTc0WENqbHJGLXVCX3RSd0Nrb0hkZ0lLUTBCMVRfLTNPTHhfNHRuS2g4c1lCbFdKMDllS1JQeXEzZDB2YjZCVkgzbFlyVC1FQnNiMGFERXM0bkY1MzN5X2lqYVI5b2lKaHlKR2RFLTZucFNrbnJJUTVMeUhEVEtPYVI3Y2Q3OVJWVllEd2VUblpGZzlEOURuV05zZFdXNWVycDd6bVpOZUJ1Q0dBVQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 08 Feb 2024 08:00:00 GMT",
        "title": "ERC-404 – Ethereum’s new experimental token standard and ETH implications - FXStreet",
        "content": "Ethereum’s ERC-404 is a new token standard that has taken the market by storm.\n\nThe new experimental standard combines the best of fungible and non-fungible tokens standards, ERC-20 and ERC-721, respectively.\n\nPandora, the first token that uses ERC-404, has skyrocketed 5.400% since its launch on February 2.\n\nEthereum (ETH) price has remained lull despite the Ether ETF applications. But the launch of ERC-404 could be a key catalyst that kickstarts a rally for ETH.\n\nAlso read: Ethereum price poised for gains as Dencun upgrade goes live on the testnet\n\nWhat is ERC-404?\n\nERC-404 is an experimental token standard built on the Ethereum blockchain that aims to combine the functionalities of ERC-20 tokens (fungible tokens) and ERC-721 tokens (non-fungible tokens, or NFTs) into a single standard. This means that ERC-404 tokens can be both fungible and non-fungible, depending on the specific implementation.\n\nIn a nutshell, ERC-404 is a new way of defining digital assets like tokens or collectibles on the internet.\n\nERC-404 key features breakdown:\n\nHybrid functionality: ERC-404 tokens can represent both fungible and non-fungible assets, offering flexibility for various use cases.\n\nNative liquidity: Unlike traditional NFTs, ERC-404 tokens have built-in liquidity mechanisms, allowing for easier trading and fractional ownership.\n\nProgrammable scarcity: The supply of ERC-404 tokens can be dynamically adjusted through code, enabling innovative tokenomics models.\n\nHow does ERC-404 work?\n\nOne NFT of the underlying project is awarded to the wallet that has a full ERC-404 token. When the token is sold, the NFT is automatically burned. Both the tokens and NFTs can be traded independently.\n\nIs ERC-404 safe?\n\nERC-404 is not vetted, hence an experimental standard. Its development has not followed the traditional route – Ethereum Improvement Proposal (EIPs). Additionally, it has not undergone a full external audit, but it has been tested extensively.\n\nThe only similarity ERC-404 and other ERC standards like ERC-20 or ERC-721 share is the name “ERC,” which stands for Ethereum Request for Comments.\n\nProjects using ERC-404 token standard\n\nPandora and DeFrogs are the only two projects that have implemented the ERC-404 token standard. The latter project’s token, DEFROGS price, is up 21% in the last hour, according to data from CoinGecko.\n\nCtrl, the team behind the launch of the experimental token standard, has also launched Pandora. PANDORA token started trading on February 2 at $212 and is currently trading at $21,000.\n\nPANDORA/WETH 4-hour chart\n\nAlso read: Week Ahead: Crypto markets to turn volatile as AI steals the spotlight\n\nWill ERC-404 push Ethereum price higher?\n\nIt is unlikely that the launch of projects based on ERC-404 standards will push Ethereum price higher. Since Ethereum is the second-largest cryptocurrency by market capitalization, it is highly correlated with Bitcoin price and is unlikely to be influenced by the new narrative.\n\nBut with the tides turning bullish for Bitcoin price, the outlook could get optimistic for not just Ethereum but ETH-related altcoins as well.\n\nRead more: Top 3 Price Prediction Bitcoin, Ethereum, Ripple: Crypto markets primed, await directional bias from BTC"
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxQQ2lqTURGQTBOaG9BSFA2NUQxM0dVVldFek9pUUZjV3RubFVQaS1WbldXUWQyZGVGNXVpSGZCYU5ZdzdxQVNFRTdzSWJPY0pMU2NFaVRacExqSE9wT0haOTB6QUFWNDZpR2E1cFgxZjJKbWV2Q2dMUFF1LVBpTGFGVXNWRDB2VHYzaVk4ZHNMVTJzdkUyc1dLUFBB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 08 Feb 2024 08:00:00 GMT",
        "title": "Ethereum ERC404 tokens bring innovation — and some unwanted consequences - DLNews",
        "content": "ERC404 tokens have exploded on Ethereum, led by Pandora's $230 million volume.\n\nThe top three ERC404 projects contributed 12% to Uniswap’s 24 hour volume on Ethereum.\n\nThe frenzy has raised concerns about rug pulls and high gas fees.\n\nLess than a week since the creation of ERC404, trading volumes on Ethereum are now dominated by these hybrid tokens.\n\nThe top ERC404 collection, Pandora, has experienced over $230 million in total volume since launching on February 2.\n\nThe PANDORA/WETH liquidity pool on decentralised exchange Uniswap is now the number three pool by volume, only behind stalwarts USDC/ETH and USDC/USDT.\n\nThe top three ERC404 projects — Pandora, MNRCH and DeFrogs — have registered a combined $113 million worth of trades over the past 24 hours, accounting for 12% of Uniswap’s Ethereum trading volume.\n\nERC404 is a token standard on Ethereum that combines characteristics of both cryptocurrencies and NFTs. It greatly improves the liquidity — availability of funds — for NFTs, which are typically highly-illiquid assets.\n\nWhen a user holds at least one token of an ERC404 project an NFT is automatically minted. The user can then either sell the token, thereby burning the NFT, or they can list the NFT on a marketplace like Opensea.\n\nBut the frenzied trading around ERC404 tokens comes with consequences.\n\nThere have already been a number of rug pulls — situations where the address that created a token pulls liquidity leaving investors with nothing — and rising gas costs on Ethereum mainnet.\n\nJoin the community to get our latest stories and updates\n\nThe ERC404 frenzy\n\nAs traders flock to the ERC404 token standard, some have started to take advantage of the frenzy. On Wednesday, a token trading under the name Punks, rose from $350 to over $20,000 in just two hours. Now, it’s almost worthless.\n\nThat’s because the wallet that created the token used a malicious contract that allowed the creation of an infinite number of Punks tokens. Shortly after Punks hit $20,000, the wallet’s controller executed the contract, minting thousands of tokens which were then sold into the PUNKS/WETH Uniswap pool.\n\nUsers who invested in this token lost everything while the creator’s wallet walked away with a gain of 42 Ether — or about $100,000.\n\nSimilar incidents occurred with four other ERC404 collections using variations of the Punks name in the last two days.\n\nERC404′s are also contributing to rising gas costs on Ethereum. Given the standard is so new, it has not yet been optimised for gas costs.\n\nEthereum gas fees spent trading the Pandora ERC404 token. (Chocolate Chungus)\n\nGas fees on Ethereum are payments made by users in order to send transactions. Ethereum is designed to increase the cost of transactions during busy periods to protect the network from spam attacks.\n\nThe founder of the Pandora collection recently stated in the project’s Telegram chat that the next ERC404 improvement should reduce gas costs by 300 to 400%.\n\nThis will likely be welcomed by Ethereum mainnet users. Gas fees on the network have averaged 53 gwei over the past 24 hours, while the average for the previous seven days was 29 gwei.\n\nRyan Celaj is DL News’ New York-based Data Correspondent. Reach out with tips at ryan@dlnews.com."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxOOEozTzJlZXVyeU9IWl9XOV85SUdhOWhpZTE2ZVlzV0huSlpITVFPYmhPemlwNWx2R1pjeFFUQldkX1NKRkU1U2RTU0RxeDRkdG1uQmFJVTdMR09PbF9vTFVJZ1pJMmJwWkNfdmRUSi1LU0VXd3dZRjFNdll0WnJ3dmtwejc4VExTalJOZkdSdGFPQ0JWbGIyMtIBoAFBVV95cUxPdEpwd2dKTzROSjNkOVNESWJFbThpNnBhektKLUNJYTZZOXQ3VzR0N0VrQ3JIX1U2OFFkRVM4cU1WRFhLVXhLa1lTeFY4VUc3ZUE0VmN3aG1GVTlQMmZmS2RtSUJXYVdua2NlVjNQcnc1TDVZOHh5MmplOTkwZEo3cTFtWUhtQzFvTV94UmxmYjFYUzBDNHp1ZnFFc2lxX3Zx?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 08 Feb 2024 08:00:00 GMT",
        "title": "Blast Layer-2 Solution: Enhancing Ethereum's Scalability and Yield - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBlast, an Ethereum layer-2 scaling solution, aims to address the Ethereum network's scalability challenges. It has attracted significant interest by securing a total value locked (TVL) of over $1.4 billion and fostering a growing ecosystem of applications and users.\n\nBlast differentiates itself with features including native yields for ETH and stablecoins, facilitated by auto-rebasing mechanisms and collaborations with real-world asset protocols.\n\nBlast’s testnet went live in January 2024 ahead of a planned mainnet launch in February.\n\nAD\n\nAD\n\nKey features and innovations\n\nNative Yields: Blast is distinctive for offering native yields on ETH and stablecoins, a feature uncommon among layer-2 solutions. This is achieved through an auto-rebasing mechanism and integration with protocols involving real-world assets, which aims to enhance the value and efficiency of assets within its ecosystem.\n\nBlast is distinctive for offering native yields on ETH and stablecoins, a feature uncommon among layer-2 solutions. This is achieved through an auto-rebasing mechanism and integration with protocols involving real-world assets, which aims to enhance the value and efficiency of assets within its ecosystem. Auto Rebasing for ETH : By leveraging the Ethereum network's post-Shanghai upgrade capabilities, Blast allows for the automatic increase of ETH balances by directly transferring yields from L1 staking to users on L2. This feature aims to ensure that ETH holdings in Blast continuously grow, reflecting L1 staking yields.\n\n: By leveraging the Ethereum network's post-Shanghai upgrade capabilities, Blast allows for the automatic increase of ETH balances by directly transferring yields from L1 staking to users on L2. This feature aims to ensure that ETH holdings in Blast continuously grow, reflecting L1 staking yields. T-Bill Yield for Stablecoins: Offering an auto-rebasing stablecoin, USDB, Blast provides stablecoin holders with a unique yield sourced from real-world assets through MakerDAO’s T-Bill protocol.\n\nBlast airdrop and tokenomics\n\nBlast’s planned airdrop in May 2024 aims to incentivize community interaction and development within the Blast ecosystem. Significant portions of the airdrop are reserved for developers participating in the Big Bang Competition and for community engagement, promoting liquidity and user base expansion.\n\nDeveloper incentives and ecosystem growth\n\nBig Bang Competition : Encourages developers to create applications on Blast, offering exposure to its large user base and TVL. Winners receive token rewards and the promotion of their apps to the Blast mainnet.\n\n: Encourages developers to create applications on Blast, offering exposure to its large user base and TVL. Winners receive token rewards and the promotion of their apps to the Blast mainnet. Guidance and Mentorship: Participants receive personalized guidance from investors and mentorship, enhancing project success and integration into the Blast ecosystem.\n\nStrategic backing and user engagement\n\nWith $20 million in financing from major backers including Paradigm and Standard Crypto, Blast is looking to establish itself as a leading layer-2 solution. The platform also introduces referral bonuses and potential for airdrop rewards to engage users and build a community.\n\nConclusion\n\nBlast’s entry into the Ethereum layer-2 space introduces unique yield mechanisms and a community-driven approach. Its features, including auto-rebasing for ETH and T-Bill yields for stablecoins, provide a novel option for developers and users. Its focus on fostering community engagement through initiatives like the Blast Airdrop and the Big Bang Competition underscores its potential to contribute to Ethereum's scalability and DeFi innovation.\n\nHowever, Blast has faced some pushback from crypto users and developers following its initial launch in November 2023. Early investor Paradigm criticized Blast’s decision to launch its bridge before the L2, and blocking withdrawals for three months, as setting “a bad precedent.” Blast co-founder Tieshun “Pacman” Roquerre has rebutted these complaints, calling them “misunderstandings.”\n\nRoquerre previously founded Blur, which quickly catapulted ahead of OpenSea to become the top NFT marketplace in early 2023 thanks to its trading incentives; Blur has given out more than $800 million worth of tokens to traders. Blast aims to build on that momentum with a similar airdrop model, in the hopes of rapidly becoming a prominent Ethereum L2.\n\nAD\n\nAD\n\nEditor's note This article was written with the assistance of AI. Edited and fact-checked by Stephen Graves. The views and opinions expressed by the author are for informational purposes only and do not constitute financial, investment, or other advice.\n\nEditor's note: Originally published on February 8, 2024. Last updated with new information on February 14."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxQN2NZNWowaXhwVE1Eay1OcWo3Z1g5YXVMcXdxTzkwX2tPRVBMdlRoVkE2SDVkUUp4WmRiRzA4eExyak5oUUJnVWF2LUdCYjFGZU5KN1RoV0cyaUdXZG45WnVTUkpYY3dTcl8xdzBNX3pQaEVNUUZKVUZpOWhyVDBUN0lEN2lCUk1tdF80b2xJSWRkTzFCOEpyR2g5Ylc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 08 Feb 2024 08:00:00 GMT",
        "title": "Latest Ethereum price predictions: $5,000 by the end of 2024. - The Cryptonomist",
        "content": "In this article we see the latest forecasts on the future price of Ethereum offered by the fintech company Finder, which conducted a survey with 40 experts in the cryptocurrency industry in January 2024.\n\nThe emerged results speak clearly: the majority of experts are super bullish on the price of ETH, with predictions for the next 6 years talking about figures higher than four zeros.\n\nFrom a technical analysis perspective, Ethereum could experience a real rally as soon as it breaks the long-term downtrend, which has been ongoing since August 2022, in the chart against Bitcoin.\n\nLet’s see all the details below.\n\nFinder’s predictions on the future price of Ethereum\n\nAccording to a panel conducted in January 2024 by the analysis company Finder, in which 40 fintech market specialists were interviewed, the price of Ethereum could soon skyrocket if it were to meet the announced forecasts.\n\nAccording to the average of the responses obtained from the participants, by the end of the year ETH could reach $5,000 per token, approaching $4,887, thus increasing its current value by over 100%.\n\nThere are even those who have gone so far as to imagine a fiery scenario for Ethereum, hypothesizing a price of $17,000 by the end of 2024. At the same time, there are also those who, going against the tide, support the crypto market bears and predict a price of $1,333.\n\nApproximately 23% of the interviewed speakers believe that the price of ETH will rise in the range of $4,000 to $4,999 at its maximum before the end of 2024, while another approximately 23% believe that we will see the price of ETH within the range of $3,000 to $3,999 in the same time frame.\n\nExpanding our horizons, we see that forecasts indicate a potential growth of the cryptocurrency that could reach $7,492 in 2025, while by 2030 we could reach $19,190.\n\nThese numbers, obtained as a simple average of the responses provided by industry experts, are significantly higher compared to those recorded in a similar survey conducted by Finder in October 2023.\n\nThe analysts interviewed by Finder also contributed to explaining the reasons for their bullish or bearish biases, providing technical support to the market forecasts provided.\n\nIn particular, we see how Damian Chmiel, senior analyst and editor of Finance Magnates, believes that the fate of Ethereum largely depends on the performance that Bitcoin will record:\n\n“The price of Ethereum will reflect what happens with Bitcoin. If I believe in a historical high by the end of 2024 around $70,000 for BTC, I also believe that ETH will reach its historical high, testing the $5,000 level.”\n\nEven Jonathan Hababou Solomon, co-founder and co-CEO of ARIA Algorithmic Ratings & Investment Analysis, agrees with Chmiel’s thesis. He notes a very strong correlation factor between the two assets, but emphasizes that the second largest cryptocurrency by market capitalization could have the upper hand this year:\n\n“Given the strong correlation between bitcoin and ether, it is likely that ether will benefit from bitcoin catalysts such as spot ETFs [bitcoin] and [the halving]. However, I believe that ether has greater potential due to its current market price. There is a general perception that ether offers a better opportunity for higher multiple profits compared to bitcoin.”\n\nAccording to a slightly less optimistic forecast by Ruslan Lienkha, head of markets at YouHodler SA, the price of ETH is expected to increase in 2024 without breaking any previous highs.\n\nAccording to his vision, Ethereum’s infrastructure will capture a lot of value in the coming years due to its advantageous technology, but at the same time, competitors will grow alongside it:\n\n“In the long term, the price of assets will increase because Ethereum is the main ecosystem for blockchain projects. However, competition with other blockchain ecosystems will intensify.”\n\nTechnical analysis of ETH-USDT and ETH-BTC charts\n\nAt this point, to complete the overall picture of the future price predictions of Ethereum, let’s take a look at the ETH-USDT and ETH-BTC charts to identify potential starting points for the next predicted increases in the asset’s value.\n\nCurrently, the cryptocurrency is priced at $2417, well above the 50-period moving average on a weekly time frame, with the macro trend reversing after the declines of 2022 and becoming clearly bullish since January 2023.\n\nIn recent weeks, Ethereum has had some difficulty in surpassing the $2500 mark, never managing to close candles above the fateful level.\n\nOn multiple occasions, Ether has attempted to break out against the dollar, but without managing to surpass the $2800 high.\n\nTo give more space to the optimism of the bulls, it will be necessary to break the $2500 mark as soon as possible, trying to break into the area around $3000 as well. The volumes have not yet returned to 2020 levels but are gradually growing.\n\nThe RSI indicator is at a medium-high level in the channel but leaves fertile ground for other potential bullish climbs.\n\nWeekly chart of Ethereum price (ETH/USDT)\n\nAs for the ETH-BTC chart, we notice that the situation is quite different.\n\nPrices are currently below the 50-period moving average on a weekly time frame, indicating a more bearish outlook.\n\nSince August 2022, the currency of the world’s most famous smart contract platform has recorded a downward trend against the market king Bitcoin, losing about 40% from the highs to the lows of the last 2 years of trading.\n\nBy the end of 2023, Ethereum has consolidated within the range of 0.05-0.055, increasing the chances of a trend reversal and fueling positive predictions on the price of the crypto.\n\nIf the bottom has really been reached in recent months, then we can expect a year of strong rebounds both for ether and for many altcoins, which will benefit from the loss of power of BTC.\n\nCurrently, the most optimistic scenario involves a recovery of 0.07 by mid-2024, with the remaining 6 months of the year in which we could witness an attempt to remove one zero from the chart and bring ETH back to one-tenth of the value of BTC.\n\nThe most important resistance is located at 0.085 zone, which has acted as a peak in the chart for the past 5 years, preventing any return to the crazy levels reached during the bull run of 2017.\n\nWe are waiting to find out ETH’s next move towards BTC, in order to update price forecasts and identify the most likely targets."
    }
]