[
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiaEFVX3lxTFBvdnpySjRrRlJIWGowQ1dUTDNlVll6LUNIaGJHYmRsUnNMaVh4U1ozeG9DUzVPWW9vaFhwV3FfNzBHalRfam44QXhVZTF6N00xZDc0MzZZYnp2V0pJSlQwanVOR2xOdTVV?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Mar 2024 07:00:00 GMT",
        "title": "Ethereum core devs campaign for gas limit raise to 40 million - Crypto Briefing",
        "content": "While the campaign aims to reduce transaction fees, critics have noted that such a change may negatively affect network performance.\n\nShare this article\n\nA group of Ethereum core developers has launched a new initiative called “pump the gas” to increase the blockchain network’s gas limit from 30 million to 40 million, with the goal of reducing transaction fees on layer 1 by 15% to 33%.\n\nCore Ethereum developer Eric Connor and former head of smart contracts at MakerDAO Mariano Conti unveiled the “pump the gas” website on March 20, calling on solo stakers, client teams, pools, and community members to support the initiative.\n\n“Raising the gas block limit 33% gives Layer 1 Ethereum the ability to process 33% more transaction load in a day,” the developer group claimed.\n\nThe Ethereum gas limit, which refers to the maximum amount of gas spent on executing transactions or smart contracts in each block, has remained at 30 million since August 2021. Gas is the technical term in Ethereum smart contracts which refers to the fee required (in gwei, a unit of Ether) to complete a transaction or execute a smart contract call.\n\nGas limits are standardized and set to ensure that block sizes are maintained at a level that will not overload or congest the Ethereum network, affecting its performance and synchronization. Based on specific parameters, validators can also dynamically adjust the gas limit as blocks are produced.\n\nThe direct effect of increasing gas limits is more space for transactions on each block. Theoretically, increasing the gas limit creates a correlational increase on a network’s throughput and capacity. The downside, though, is that the load on hardware is also increased, opening the risk of network spam and external attacks.\n\nHistorically, the gas limit has steadily increased as the Ethereum network grew. Ethereum co-founder Vitalik Buterin noted earlier in January that the three-year period since August 2021 was the longest that the limit has not been raised. Buterin thus suggested a raise to 40 million back in January, dovetailing with similar calls that have been gaining momentum in recent months.\n\nThe Pump the Gas website also notes that data blobs, introduced in the Dencun upgrade with EIP-4844, significantly reduced L2 transaction fees, but this was not replicated in L1 transaction fees. Ethereum developers behind the campaign believe that a combination of blobs and a 33% increase in the gas limit to 40 million would help scale both L1 and L2 networks.\n\nVarious opposing figures have raised concerns about the potential impact of the proposed raise on the size of the blockchain state, such as Ethereum developer Marius van der Wijden, who said that access to (and modification of) the blockchain state would gradually slow down over time. This argument over the concept of “state growth” is also echoed by former Ethereum chief decentralization officer Evan Van Ness, who believes that raising the gas limit should be done carefully, citing the lateral effects of EIP-4844 on block size."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMi0gFBVV95cUxOOXFoV2RQaXlKS2pGdG5IS0lXRUlSZjZ6RC04OU11aEJ4cC11MENMU2xfY3VjemlPVnR2VzlMTVNlSzZ3YlhTRHZ1N2lBemhFdXR6OG15TkFzMmJyRXBIY1NTTlZMUWxxVnVhMGNOOU5iUEJxR0xGSUJMVGJvUUpUTEtqWEFUMVdSNkJjb1ViZThBalJIajFFcXpjT3FhOW82SkV4amFSU1NLZW9ycktERlpmanlCeXkwU2FaUTg0M1Q4X2NncjBacnhhMW1VN0NKaGfSAdcBQVVfeXFMUGhvOHc0bGwzZGhKZnl0aDdCbVZ5M2k5Q3dZY1liWmdVMlowX0MzOFpEdXBjYzdrN3RBNkJHQjcyb0c5Tlg5eVljOVBBTmFGZEFGa2dfSFNUVnVxMnVEb0VyQ2t6SDduRnl5Nmc2UklfT3JxLUlveENuU3QtUl80YUZROFdYQ3J6emZYdkdYOU9KbjZlOUpkSHhDLU9VcVcxTXAzRE11cXB1aVRuUXdFZ2dLUDNTLWFYQ0ZKQk5YVXFIWkliSUtVU2F4N25sYXdHYVo5VEdCZFE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Mar 2024 07:00:00 GMT",
        "title": "BlackRock to launch tokenized fund on Ethereum as battle for ETF intensifies - FXStreet",
        "content": "Investment giant BlackRock says it wants to bridge TradFi and the crypto market.\n\nEthereum is up 11% amid speculations of a real world assets bull run.\n\nETH is a commodity and not a security, says Coinbase's chief legal officer.\n\nEthereum (ETH) could be set for further growth after $10 trillion asset manager BlackRock announced on Tuesday it's launching a tokenized asset fund on the largest smart contracts blockchain. However, the Security and Exchange Commission's (SEC) battle to classify Ethereum as a security may spoil the fun.\n\nBUIDL to debut on Ethereum\n\nEthereum has been rising in the past 24 hours after BlackRock announced its decision to launch its first blockchain-based tokenized fund, BlackRock USD Institutional Digital Liquidity Fund (BUIDL), on the Layer One chain.\n\n\"BUIDL will offer investors important benefits by enabling the issuance and trading of ownership on blockchain,\" as stated on Business Wire. The announcement said this would “expand investors' on-chain offerings, provide instantaneous and transparent settlement, and allow for transfers across platforms.”\n\nBUIDL aims to maintain a $1 peg per token as the fund would invest 100% of its underlying assets in cash, US Treasury bills, and repurchasable agreements. Investors who subscribe to the fund will earn yields paid as new tokens to their wallets at the end of every month.\n\nBank of New York Mellon will serve as custodian and administrator for BUDL's underlying assets, while Securitize will serve as the tokenization platform and transfer agent. BlackRock's partnership with Securitize also includes an investment into the latter to solidify bonds. Other key infrastructure providers for the fund include Coinbase, Fireblocks, Anchorage Digital Bank NA, and BitGo.\n\nThis comes a few months after the SEC's Bitcoin spot ETF approval saw BlackRock debuting their iShares Bitcoin Trust (IBIT). Additionally, BlackRock's CEO, Larry Fink, said in a recent interview, \"I believe the next step will be tokenization of financial assets...tokenization of securities.\"\n\nRead more: Ethereum faces steep correction as whales opt for profit-taking\n\nETH price growth faces fierce battle from the SEC\n\nAfter the announcement, some analysts in the crypto community speculated that this was a potential igniter to spark real-world assets (RWA) narrative growth. The real world assets category has recorded huge gains in the last 24 hours according to data from Coingecko.\n\nTop real world assets\n\nBut more importantly, Ethereum reaped gains of about 11% in the last 24 hours following BlackRock's update and currently trades at $3,566.\n\nETH/USDT 1-hour chart\n\nThis follows the latest update on the spot ETH ETF, which saw the SEC issue subpoenas to three US companies dealing with ETH transactions, according to Fortune. Speculations are that the subpoenas are related to an investigation aimed at classifying Ethereum as a security. The investigation is said to be based on the 2022 timeline when Ethereum transitioned to proof of stake.\n\nThis would hurt any chances of the commission approving a spot Ether ETF, potentially causing a drop in Ethereum's price. Furthermore, the Ethereum Foundation acknowledged it has been receiving inquiries from \"state authority,\" which many believe to be the SEC.\n\nRead more: Ethereum Foundation subpoenae threatens ETH ETF approval odds\n\nHowever, Paul Grewal, chief legal officer at Coinbase, has defended Ethereum in a recent post on X (formerly Twitter), stating that \"ETH is a commodity, not a security,\" as confirmed by several federal courts and the Commodity and Futures Trading Commission (CFTC). He cited instances where senior SEC officials, including Gary Gensler, had said ETH isn't a security before he became SEC Chair.\n\n\"The SEC has no good reason to deny the ETH ETP applications. And we hope they won't try to invent one by questioning the long established regulatory status of ETH, which the SEC has repeatedly endorsed\", he further expressed."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxNYnI1Wll0Z2g0WEtSUE94TkVBeGJ0V01NOTc3QllTbU5nWmNMNnJPWmdSLU5pTDllcV8wekthRFl2Y0J6SUVYZVpsajA2bjEzcGpvQVJZSUNfQ1lDS3dXZnAzSmROT3ZCTE1IMDdZUUdmQ0REa2hfVjJ1X3VvNXV1LWpiY21UOGIyaUxUb3hpQVlnbHZvMHVidy1mUG9DT1hTRzRr?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Mar 2024 07:00:00 GMT",
        "title": "Ethereum Killers, Layer2 Solutions, and Ethereum Dencun Upgrade: Who Will Benefit? - hackernoon.com",
        "content": "Using the Ethereum blockchain has become really expensive recently, with fees for sending Ethereum from one wallet to another reaching up to $2 and fees for swapping tokens within the network surging to over $50 when the network is congested. The problems of surging gas fees and scalability were solved in two ways:\n\n\n\n\n\nBy developing Layer-2 solutions for the Ethereum network\n\nBy launching projects that would offer the same functionality but without the most hurting problems.\n\n\n\nNow, there are over 45 L solutions for the Ethereum blockchain , and over 35 such solutions are in development. The Dencun upgrade allowed for a reduction in the Ethereum fees and resolved the issue of network congestion by allowing L2 solutions to keep some transactions off-chain and bundle transactions before sending them to the Ethereum mainnet. And only the most important transactions would be processed on the Ethereum blockchain. Ephemeral data blobs are also introduced, which are the storage units where intermediate results during transaction processing are stored.\n\n\n\n\n\nWith these solutions, the problems of scalability and high fees will be resolved.\n\nLet’s see whether it really worked.\n\n\n\n\n\nSoon after the upgrade, the fees on the layer-2 solutions dropped drastically. Here, you can have a look at the changes in fees for the main L2 networks.\n\n\n\n\n\n\n\n\n\nThe first part, the one with fees, has worked out. It is still not completely clear whether the second part has developed as expected, but we will learn about it soon.\n\n\n\n\n\nSo, with it, it is expected that these developments will allow Layer2 solutions and the main network to benefit in the long term.\n\n\n\n\n\nHowever, some experts warn that the introduction of blobs may have impacted the fees positively for a short time. In the long term, when Layer2 networks start competing for blobs, fees may rise again. Only the time will show how correct these forecasts are.\n\nBut what about the so-called Ethereum killers? How will this upgrade impact them?\n\nEthereum Killers: How Do They Work and How the Dencun Upgrade Will Impact Them\n\n\n\n\n\nEthereum killers - this is the name for projects that compete with Ethereum. While offering the same or similar functionality as Ethereum, all those projects use different technologies that allow them to overcome Ethereum’s shortcomings.\n\n\n\n\n\nLet’s start with some history.\n\n\n\n\n\nEarlier, Ethereum killers bragged about using a more environmentally friendly proof-of-stake consensus mechanism and its variations. But after the Merge upgrade on September 15, 2022, the Ethereum network moved to the proof-of-stake consensus mechanism, which reduced energy consumption by more than 99%.\n\n\n\n\n\nMany people expected that this would end with at least some of the “Ethereum killers” - at least with those who couldn’t offer anything but their environmentally-friendly approach. However, reducing energy consumption didn’t solve the issues of scalability and high gas fees. On the contrary, gas fees surged. Thus, eventually, none of the so-called Ethereum killers was impacted seriously.\n\n\n\n\n\nNow, let’s return to the recent upgrade.\n\nThe Dencun upgrade solved two main problems that the Ethereum network used to face: high gas fees and scalability issues.\n\n\n\n\n\nThis means that those Ethereum killers who relied only on faster transaction processing speed and low gas fees could indeed be impacted heavily. I doubt that projects running on such Ethereum killer blockchains will switch to the Ethereum network, but in the future, developers will prefer an established network, which Ethereum is, rather than networks that used to be competitors but lost their competitive advantage.\n\n\n\n\n\nHowever, some networks offer something completely different along with Ethereum’s set. Here they are, and this is why they will survive.\n\nPolkadot\n\nPolkadot is focused on something that is very important for Web3 - interoperability. It allows for the connecting of several blockchains and interchanging data between them without compromising security. Interoperability is essential for the future of Web3, and thus, the demand for Polkadot will be growing.\n\nSolana\n\nIt is cheap, fast, and backed by some major financial players such as JPMorgan and a venture capital firm, Andreessen Horowitz. The first two benefits of the Dencun upgrade have been added, and the last ones are raising concerns about the network’s centralization. Even though thanks to the financial support and already high adoption level, Solana may stay around for a while, I believe its importance will decline over time.\n\nCardano\n\nIt is a nice project with a lot of developer activity. However, its competitive benefits, such as eco-friendliness, low fees, and fast transactions, are not there anymore. Although many people love it, and thus it may survive just because many developers pick it based on personal preferences.\n\nBottom Line\n\nThe Dencun upgrade is an important milestone not only for the Ethereum network but also for the entire world of crypto and blockchain. Its impact is still to be assessed, but for sure, many changes are coming.\n\n\n\n"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxOMzZBeUQ3NFcyRjVaNm1UYVQ2RVEwaVAzWXgzXzQzT0Zoc1AxdjREMWhxNmxzZjFiNXpCNUpNcDRSS3FnaExwOVN6a1dpOTBxT0Q3Qnk1LTdueWVubVgtbDJUM2R0YmxXX3F3bC1PZEdCQk1rMVBXeTljaDJXVnlmWmc3REVRVW9BSE5OdFMtWW1UVU9SVTZHcnh3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Mar 2024 07:00:00 GMT",
        "title": "Solana’s Memecoin Boom Has Many Recalling Ethereum’s 2017 ICO Mania - Unchained",
        "content": "The popularity of memecoins on Solana such as BONK is stress-testing the layer 1 blockchain's throughput capacity.\n\nPressures on the Solana blockchain caused by a dramatic rise in the number of memecoin presales have drawn comparisons with the 2017 ICO craze that took Ethereum by storm.\n\nAs crypto markets have boomed in early 2024, tokens inspired by memes — frequently meme-friendly animals such as dogs, cats, frogs and sloths — have gained a large chunk of crypto investors’ mindshare. However, some traders have begun launching memecoins on Solana to such an extent that the network is facing challenges in performance.\n\nAs a result, some have noted how the current atmosphere and Solana’s struggles amid heightened activity closely resemble Ethereum in 2017 when initial coin offerings were all the rage and Ethereum became clogged up with congestion issues.\n\nWhat Solana ecosystem is experiencing now is extremely similar to what Ethereum went through during the 2017 ICO bubble. There is massive demand for SOL to speculate on new asset issuance on Solana Study Ethereum ICO bubble during 2017/2018 — Arthur (@Arthur_0x) March 16, 2024\n\nChris Eberle, who worked in sales and marketing at Facebook until 2017 and is now an angel investor and DAO contributor, said the comparison between Solana in 2024 and Ethereum in 2017 is “totally valid.”\n\nSimilarities to ICO Boom\n\nThe Ethereum ICO craze in 2017 tested the network’s capacity to handle congestion. During the year, Ethereum’s daily transactions surged from 38,730 on Jan. 1 to 946,981 by the end of the year, a 24x increase, according to Etherscan.\n\nIn 2017, startup SophiaTX delayed its planned ICO by 48 hours to ensure a smoother token launch. At the time, CryptoKitties, a decentralized application where users could breed and trade digital kittens, had clogged the Ethereum network because of the number of transactions on the dapp.\n\nMany now see a similar situation unfolding. The number of daily active addresses on Solana has more than doubled from around 600,000 on Jan. 1, 2024 to more than 1.4 million on March 18.\n\nSome Solana-based memecoin projects that have already conducted presales, including SMOLE and MOONKE, have delayed their token roll outs as a result of Solana’s congestion. “To keep everything fully transparent, with the current congestion of the Solana network we are going to bullishly delay our launch,” the MOONKE team wrote on X Tuesday.\n\nTesting Performance\n\n“The Solana network has been experiencing extremely high usage which has tested components of the network — specifically the implementation of priority fees and the transaction scheduler, both of which play important roles in block optimization,” the Solana Foundation wrote in a blog post on March 15.\n\nTom Wan, who works in strategy and business development at the parent company of crypto asset manager 21Shares, noted on X that the percentage of failed transactions on Solana has recently increased to 72%, although a large majority of these appear to be related to bots that are spamming the network because of the new token opportunities.\n\nRead More: Solana at 4, Memecoins Help Drive Network to All-Time High in Market Cap Post FTX Collapse\n\nMert Mumtaz, the CEO of the Solana-based developer firm, Helius, also indicated that Solana is facing challenges in performance from all this memecoin activity. In a private message to Unchained on X, he acknowledged the presence of bugs and said that improvements are “coming soon” to address Solana’s challenges. Despite this, Mumtaz highlighted Solana’s performance compared to Ethereum’s rollups, noting that “We’re able to do about 20x more TPS [transactions per second] than all [Ethereum] rollups combined currently (so roughly 2,000 tps).”\n\nQiao Wang, founding partner of crypto accelerator AllianceDAO, wrote on X this week that “Solana right at this moment is similar to the Ethereum 2017 ICO era.” He cited the demand among Solana users to trade memecoins and “an increasing demand for SOL to participate in those imos (initial meme offerings).”\n\nAngel investor Eberle noted that one similarity is how businesses aiding the launch of memecoins are mirroring firms that facilitated ICOs back in 2017. “It’s getting a bunch of people excited to speculate to try to get rich quick, again. We’re seeing businesses pop up in support of the memecoin ecosystem just like we saw the ‘ICO experts’ pop up back then,” Eberle wrote in a Telegram message to Unchained.\n\nRead More: Crypto Enthusiasts Raise Nearly $690,000 to Put Dogwifhat Meme on Las Vegas Sphere\n\nOne such ICO business in 2017 was Ambisafe, a company that was founded in 2015 to help people and institutions with fundraising and capital management. In the same vein, Blockchain App Factory is now providing services to support people and entities rolling out new memecoins on the Solana blockchain.\n\nSolving Problems Versus Producing Speculative Riches\n\nWhile both memecoins on Solana in 2024 and ICOs on Ethereum in 2017 have attracted lots of attention and massive amounts of liquidity, crypto users have criticized both for their emphasis on get-rich-quick schemes. “It’s frustrating to see billion-dollar-cap memecoins overshadow hardworking teams building legit products to advance this industry,” wrote Ki Young Ju, founder of blockchain analytics firm CryptoQuant, on X this week.\n\nEven though memecoins can show flashes of creativity and humor, Eberle noted that “we have to find more ways to lead with the power of blockchains to solve problems in new ways vs. speculative get rich opportunities.”\n\nAs Ju noted, “easy money can’t drive industry-wide progress, as shown by the 2018 ICO burst.”"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE9GTmJMOWVRME1BMlI3Mms1VWFELTR1b0kyX2otYXk0SEJTWW1QWDBfNGJmR2s1eXRlY193eXZ6LXBvRzBrUVNBb3FzbmN4NTF4UlJEZmFSRENBbjhUSXlzTE8teURoSUNyWndYaVVfU29GNEs3Q0ZGLXh5SVg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Mar 2024 07:00:00 GMT",
        "title": "Why the SEC Shouldn’t Classify ETH as a Security - Yahoo Finance",
        "content": "Recent reporting from CoinDesk and Fortune suggests the U.S. Securities and Exchange Commission is preparing to classify ether {{ETH}}, the native token of the second-largest blockchain, Ethereum, as a security. The move would undoubtedly have severe repercussions for the entire crypto industry, including derailing plans for an spot ETH exchange-traded fund.\n\nThis is an excerpt from The Node newsletter, a daily roundup of the most pivotal crypto news on CoinDesk and beyond. You can subscribe to get the full newsletter here.\n\nCiting several unnamed sources, Fortune reported that the SEC has subpoenaed several U.S. companies for documents related to their dealings with the Ethereum Foundation, the non-profit that organized the launch of the eponymous blockchain and is based in Switzerland. Apparently, the probe began shortly after the Merge event that introduced ether staking in 2022.\n\nSee also: What Happens if Ether Is a Security?\n\nShortly after Ethereum’s proof-of-stake upgrade, SEC Chair Gary Gensler said that proof-of-stake chains, which pay users token rewards for locking up their coins as a security model, resemble investment contracts and could be classified as securities — though he did not mention ETH by name.\n\nHe has, however, launched lawsuits against a number of U.S.-based and international crypto exchanges including Coinbase, Kraken and Binance on the grounds that they were selling securities to U.S. investors without the appropriate registrations. These include assets like Cardano’s {{ADA}} and Solana’s {{SOL}}.\n\nETH has never been named outright as a security in an SEC enforcement action, a point that strikes crypto attorney Ignacio Ferrer-Bonsoms as contradictory. In a recent blog, Ferrer-Bonsoms compared Ethereum to Cardano to argue that if the SEC considers one to fall afoul of securities laws then it must consider the other the same way.\n\nBoth the Ethereum Foundation and Cardano Foundation raised millions via token sales to fund network development ($18.3 million in bitcoin versus $62 million, respectively); both govern their respective networks through foundations based in Zug, Switzerland; and both allocated tokens to their founders and foundations.\n\nMoreover, both foundations contribute work specifically to increase the value of their tokens. Ferrer-Bonsoms noted Ethereum’s burn mechanism, introduced in the EIP-1559 upgrade in August 2021, that made the network (sometimes) deflationary. “In this way, investors may perceive the token as an investment with expectations of value appreciation,” he wrote.\n\nIndeed, unlike bitcoin {{BTC}}, the only cryptocurrency that is hands-down a commodity under U.S. law, members of Ethereum’s founding team are still highly active in the industry. Vitalik Buterin, despite announcing a soft retirement on his 30th birthday, regularly introduces new ideas for Ethereum tools and influences the network’s roadmap while Joseph Lubin oversees the influential Etheruem incubator ConsenSys.\n\nStory continues\n\nSee also: How Much ETH Does Joe Lubin Hold? | Opinion\n\nAnd while technically there is a Bitcoin Foundation, it has almost no influence and does not pay salaries for Bitcoin Core developers.\n\nThe case against classification\n\nThat said, not everyone agrees that Ethereum is a security. Most importantly, the Commodities Futures Trading Commission (CFTC), the SEC’s smaller sister agency, has for years allowed ETH futures trading, implying that it is a commodity. And, in the CFTC’s lawsuit against Sam Bankman-Fried, the agency outright said ETH is a commodity (alongside BTC and {{USDT}}.\n\nIndeed, the SEC’s unilateral determination that ETH is a security would have severe repercussions for U.S. businesses and investors that already interact or rely on Ethereum, including major exchanges like CME Group and Cboe Global Exchange that trade millions of dollars of ETH futures per day.\n\nThe best argument that ETH isn’t a security is that it hasn’t been up to now and changing status would have harsh impacts. It’s “the whole ‘you can't just arbitrarily change your mind and damage people for hundreds of billions of dollars after a decade’ and also by the way the CFTC will likely fight back” argument, Austin Campbell, a Columbia Business School assistant professor, told CoinDesk in an interview.\n\nBrian Quintenz, a former CFTC commission and now head of policy at a16z Crypto, echoed this point on X, saying that when the SEC approved ETH futures ETFs to trade on its regulated security exchanges in October 2023 (months after the Merge), \"it explicitly acknowledged the status of the underlying, ETH, as being a non-security and outside of its jurisdiction.\"\n\n\"It will be interesting to watch what, if any, excuse the SEC uses if it were to delay or deny an ETH ETF given it has already informed the market on ETH being outside its jurisdiction,\" Quintenz added. It's worth noting that the news comes a day after the SEC was hit with unprecedented court sanctions for its \"gross abuse of power\" in a lawsuit it brought against the crypto company DEBT Box.\n\nBrian Frye, the Spears-Gilbert Professor of Law at the University of Kentucky, said the best reason against classifying ETH as a security “is that ETH looks more like BTC than any other token.” He added that “the SEC has repeatedly said it considers BTC a commodity, rather than a security ... primarily because of the lack of centralized control.”\n\nSee also: Coinbase Tried to Rein in a Renegade SEC | Opinion\n\nThe existence of the Ethereum Foundation casts a shadow of a doubt on that argument, Frye admitted. However, it is undeniable there are thousands of stakeholders in Ethereum beyond the founding corporation. In some areas even, Ethereum could be considered more decentralized than Bitcoin — including the number of applications running on it and developer count.\n\nFurther, IntotheBlock found that, as of six months ago, there are more than double the number of long term ETH holders (73.5 million) than bitcoin (33.61 million). There are 5,370 addresses holding between 1,000-10,000 ETH but only 1,920 addresses with between 1,000-10,000 BTC.\n\nNone of this may matter considering Gensler’s apparent warpath against crypto, an industry he sees as rife with fraud and financial abuses. The ironic thing is nearly everyone in crypto wishes Gensler would spend his time prosecuting actual crime, rather than harassing legitimate business or attacking decentralized protocols.\n\nFrye sees this apparent overreach as potentially Gensler’s undoing. “The SEC is getting too far out over its skis and is liable to crash. It's relying on Howey, which provides an extremely broad definition of ‘security’ and consequently gives the SEC very broad regulatory authority,” he said, referring to one of the tests the agency uses to define “investment contracts.”\n\n“But the Supreme Court can change Howey. And, the more aggressively the SEC regulates, the more likely a case will go to SCOTUS. As soon as one gets there, the Supreme Court is likely to ‘clarify’ Howey by narrowing it.”"
    }
]