[
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxQTy1lWk1Mak5IOEVlTEpzbFdydHNLTmZFSS1Wd0M3MUt4QzIwcmxaWlFVUzBjeG9BZmRGS09MUFBtNXlDX2gxcnpoeWJ4TXdjdzFZa3dIX0ZZYURfOUM3TlA0VlY1cWwxNFBvX09GUDYyR1VWdlBoXzRCMGlUOVhtb3ZCMVRodW9HN1hRSVNVZHNBVWtvRVoyWmlRLU5jQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jul 2024 07:00:00 GMT",
        "title": "Bitwise CIO lists three reasons why Ethereum will hit record after ETF launch - DLNews",
        "content": "Ethereum ETFs’ launch will catapult its price to new heights, expert says.\n\nThe cryptocurrency’s staking feature plays a key role in its prices.\n\nBitwise CIO expects $15 billion in inflows over the next 18 months.\n\nWith spot Ether exchange-traded products set to hit markets next Tuesday, one expert says Ethereum will hit a new all-time high soon after.\n\nMatt Hougan, Bitwise’s chief investment officer, said there are three reasons why Ethereum will rise above $5,000 after the ETFs start trading.\n\nUnlike Bitcoin, Ethereum’s slow supply growth, lack of miners, and staking will pay serious dividends and enable the new ETFs to outperform Bitcoin funds, Hougan said in a new investor note.\n\nHe has previously estimated that investors will pour $15 billion into spot Ethereum ETFs in their first 18 months of trading.\n\nEthereum supply slows\n\nMost cryptocurrencies are inflationary, meaning more are created and sold on the market over time.\n\nBitcoin does this, but the amount that will ever exist is capped at 21 million.\n\nEthereum is also inflationary, but a technical feature that slows this process was added three years ago.\n\nThe burn feature destroys a small portion of Ether with every transaction.\n\nJoin the community to get our latest stories and updates\n\nWhen people swap, trade, or lend on the Ethereum network more frequently, more Ether can be destroyed than produced.\n\nAccording to data from Etherscan, the net amount of Ether hitting the market has been nearly zero as of September 2022.\n\nThe network produces an equal amount of Ether as the burn feature destroys.\n\nThe total supply growth of Ethereum since 2015. Source: Etherscan. The total supply growth of Ethereum since 2015. Source: Etherscan. (Etherscan/Etherscan)\n\nHougan said this slowed growth and the launch of a new demand source will increase Ethereum’s price.\n\nThere’s less Ethereum on the market, and with the launch of Ethereum ETFs, many Wall Street firms will start buying it for their products.\n\nMore demand translates to higher prices.\n\nMiners aren’t stakers\n\nBitcoin mining is an industry that demands enormous resources, from electricity costs to high-end machines. Miners regularly sell the Bitcoin they mine to pay these costs.\n\nThis isn’t the case with Ethereum stakers.\n\nEthereum operates a proof-of-stake consensus algorithm. This means it doesn’t require an industrial-grade mining operation to keep it secure.\n\nInstead, users must lock up 32 Ether, which is worth roughly $111,000 today, and become validators who secure the network.\n\nValidators are paid in newly created Ethereum to prevent fraudulent transactions on the network.\n\nRunning a validator is far less expensive than running a profitable mining outfit. This means there is less need to sell Ethereum to continue operating.\n\n“In the short term, there is simply less forced selling each day in Ethereum than in Bitcoin,” said Hougan.\n\nStaked and off the market\n\nMore than 33 million Ether are staked today, nearly 28% of the entire cryptocurrency’s supply, according to a Dune dashboard by analyst Hildobby.\n\nMore importantly, says Hougan, this is Ether that’s not moving soon either, as they are locked up for a set period, meaning it cannot be withdrawn or sold.\n\n“Currently, 28% of all ETH is staked, meaning it is effectively off the market,” Hougan said\n\nThe combination of low inflation, fewer sellers in Ether stakers, and millions of Ether off the market make the proposition of an ETH ETF especially bullish, said Hougan.\n\n“If the ETPs are as successful as I expect — and given the dynamics above — it’s hard to imagine ETH not challenging its old record.”\n\nCrypto market movers\n\nBitcoin is up 3% over the past 24 hours to trade at $65,000.\n\nEthereum is up 1.8% to $3,476.\n\nWhat we’re reading\n\nLiam Kelly is a DeFi correspondent at DL News. Got a tip? Email at liam@dlnews.com."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxNV3RGU28xS2JVWWFPRnlCNTM0T1dMVnVURlNWZG50enpHZDdJdTVlQm5yMklLaG5fYkJmVDJER1VhTlZtdVZuLXNyeXN4QVR4SThSSW9JRXB3dEtIbm4tWXNZUHV0UWhPVGo3LTQ2dXFBVnNDU3FSMnE0anRwTkNOMW1PM2RlUC1BTWdXcXh5Mm00VWlVYVNWZURVTWXSAaIBQVVfeXFMTkRVY09LZ1lyLU5aYldEZHhGYlRfR2xGNFp1RDZBMjRRTG9XTDMxNjZ5TGtrV08yYzZGSXNhUnlIa0VkeHRobFFTZDYtOG81c2owSTRDY3l4Z3pONnlpZThwQzZDSlp6aUc4X2c4X2NKWThRbWFpWGlnQ0VfZkhsS1F2bjdYaUN1b204NlNJSEJtZzBpTXVtcXB5aTR1X0pfMVR3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jul 2024 07:00:00 GMT",
        "title": "Ethereum co-founder warns against voting only on 'pro-crypto,' a day after a16z founders support Trump - CNBC",
        "content": "Ethereum co-creator Vitalik Buterin on Wednesday cautioned against voting for political candidates based solely on whether they have adopted a \"pro-crypto\" stance.\n\n\"The game of politics is much more complicated than just 'who wins the next election', and there are a lot of levers that your words and actions affect,\" Buterin wrote in a blog post that warned even Putin and the Russian government had \"expressed willingness to become 'open to crypto.'\"\n\nButerin's post comes as Donald Trump, who has positioned himself as the pro-crypto candidate for president, rallies members of his party at the Republican National Convention in Milwaukee, and a day after venture capitalists Marc Andreessen and Ben Horowitz told employees of Andreessen Horowitz (a16z) that they plan to make significant donations to political action committees supporting Donald Trump's campaign.\n\nIn an episode of \"The Ben & Marc Show,\" which features the a16z co-founders, Horowitz said that the Joe Biden administration, in the form of the U.S. Securities and Exchange Commission and the Federal Deposit Insurance Corporation, has \"fought\" them every step of the way by \"using very nefarious means.\"\n\n\"They've sued I think over 30 of our companies,\" added Horowitz. \"They're losing almost all these lawsuits, but the problem is that when you're a startup you don't have the money to fight the U.S. government and so they're kind of nuking the industry in that way.\"\n\nFairshake, a super PAC backed by crypto's top companies, is now one of the top-spending PACs in this election cycle. Of the $160 million in total contributions it has raised, 94% can be traced back to just four companies: Ripple, Andreesen Horowitz, Coinbase and Jump Crypto.\n\n\"There is a particular style of being 'crypto-friendly' that is common to authoritarian governments, that is worth being wary of. The best example of this is, predictably, modern Russia,\" added Buterin, a Russia-born coder who built ethereum in his late teens.\n\nTesla chief Elon Musk and venture capitalist Peter Thiel, as well as crypto leaders like Tyler and Cameron Winklevoss have also endorsed Trump.\n\nIn early June in San Francisco, technologists, crypto executives, and venture capitalists paid up to $300,000 per ticket to join a Trump fundraiser that ultimately raised more than $12 million.\n\n\"In particular, by publicly giving the impression that you support 'pro-crypto' candidates just because they are 'pro-crypto', you are helping to create an incentive gradient where politicians come to understand that all they need to get your support is to support 'crypto,'\" continued Buterin, who is known for periodically posting longer essays opining on existential threats to the ecosystem writ large.\n\nButerin did not single out any names in his post of either political candidates, or of those opting to support them.\n\nTrump — who launched his latest non-fungible token collection on the solana blockchain in April — has been making increasingly bullish comments on crypto.\n\nHe is accepting digital currency donations and has pledged to defend the rights of those who choose to self-custody their coins, meaning that they don't rely on a centralized entity like Coinbase to hold their tokens and instead, do it themselves in personal crypto wallets, which are sometimes outside the reach of the Internal Revenue Service. Trump also vowed at the Libertarian National Convention in Washington in May to keep Sen. Elizabeth Warren, D-Mass., and \"her goons\" away from bitcoin holders.\n\nMeanwhile, following a meeting with bitcoiners at Mar-a-Lago with about a dozen mining executives who pledged cash and votes to him, Trump declared that all future bitcoin will be minted in the U.S., should he return to the White House.\n\nOn Monday, the Republican presidential nominee added Ohio Senator JD Vance to his ticket as vice president — a move viewed by many as a net win for the crypto sector. Vance has advocated for looser regulation of crypto and disclosed in 2022 that he personally holds bitcoin .\n\nIt comes in stark contrast to the Joe Biden White House, which has been seen as hard on crypto. Under President Biden, the SEC has dialed up actions on the sector, and even in the absence of hard-and-fast rules from Congress, the U.S. has proven to be one of the most active enforcers of penalties and legal enforcements against crypto companies.\n\nThe angrier the crypto industry got at the SEC for arresting and prosecuting them, the more people like Vance saw a chance to stake out a position on the opposite side of a crypto-skeptical Biden administration.\n\nHowever, the perception that Biden is anti-crypto and Trump is pro-crypto has some Biden allies concerned enough to take their case directly to senior White House officials.\n\nTrump is set to headline the Bitcoin 2024 conference in Nashville, Tennessee on July 27."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxNV3RGU28xS2JVWWFPRnlCNTM0T1dMVnVURlNWZG50enpHZDdJdTVlQm5yMklLaG5fYkJmVDJER1VhTlZtdVZuLXNyeXN4QVR4SThSSW9JRXB3dEtIbm4tWXNZUHV0UWhPVGo3LTQ2dXFBVnNDU3FSMnE0anRwTkNOMW1PM2RlUC1BTWdXcXh5Mm00VWlVYVNWZURVTWXSAaIBQVVfeXFMTkRVY09LZ1lyLU5aYldEZHhGYlRfR2xGNFp1RDZBMjRRTG9XTDMxNjZ5TGtrV08yYzZGSXNhUnlIa0VkeHRobFFTZDYtOG81c2owSTRDY3l4Z3pONnlpZThwQzZDSlp6aUc4X2c4X2NKWThRbWFpWGlnQ0VfZkhsS1F2bjdYaUN1b204NlNJSEJtZzBpTXVtcXB5aTR1X0pfMVR3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jul 2024 07:00:00 GMT",
        "title": "Ethereum co-founder warns against voting only on 'pro-crypto,' a day after a16z founders support Trump - CNBC",
        "content": "Ethereum co-creator Vitalik Buterin on Wednesday cautioned against voting for political candidates based solely on whether they have adopted a \"pro-crypto\" stance.\n\n\"The game of politics is much more complicated than just 'who wins the next election', and there are a lot of levers that your words and actions affect,\" Buterin wrote in a blog post that warned even Putin and the Russian government had \"expressed willingness to become 'open to crypto.'\"\n\nButerin's post comes as Donald Trump, who has positioned himself as the pro-crypto candidate for president, rallies members of his party at the Republican National Convention in Milwaukee, and a day after venture capitalists Marc Andreessen and Ben Horowitz told employees of Andreessen Horowitz (a16z) that they plan to make significant donations to political action committees supporting Donald Trump's campaign.\n\nIn an episode of \"The Ben & Marc Show,\" which features the a16z co-founders, Horowitz said that the Joe Biden administration, in the form of the U.S. Securities and Exchange Commission and the Federal Deposit Insurance Corporation, has \"fought\" them every step of the way by \"using very nefarious means.\"\n\n\"They've sued I think over 30 of our companies,\" added Horowitz. \"They're losing almost all these lawsuits, but the problem is that when you're a startup you don't have the money to fight the U.S. government and so they're kind of nuking the industry in that way.\"\n\nFairshake, a super PAC backed by crypto's top companies, is now one of the top-spending PACs in this election cycle. Of the $160 million in total contributions it has raised, 94% can be traced back to just four companies: Ripple, Andreesen Horowitz, Coinbase and Jump Crypto.\n\n\"There is a particular style of being 'crypto-friendly' that is common to authoritarian governments, that is worth being wary of. The best example of this is, predictably, modern Russia,\" added Buterin, a Russia-born coder who built ethereum in his late teens.\n\nTesla chief Elon Musk and venture capitalist Peter Thiel, as well as crypto leaders like Tyler and Cameron Winklevoss have also endorsed Trump.\n\nIn early June in San Francisco, technologists, crypto executives, and venture capitalists paid up to $300,000 per ticket to join a Trump fundraiser that ultimately raised more than $12 million.\n\n\"In particular, by publicly giving the impression that you support 'pro-crypto' candidates just because they are 'pro-crypto', you are helping to create an incentive gradient where politicians come to understand that all they need to get your support is to support 'crypto,'\" continued Buterin, who is known for periodically posting longer essays opining on existential threats to the ecosystem writ large.\n\nButerin did not single out any names in his post of either political candidates, or of those opting to support them.\n\nTrump — who launched his latest non-fungible token collection on the solana blockchain in April — has been making increasingly bullish comments on crypto.\n\nHe is accepting digital currency donations and has pledged to defend the rights of those who choose to self-custody their coins, meaning that they don't rely on a centralized entity like Coinbase to hold their tokens and instead, do it themselves in personal crypto wallets, which are sometimes outside the reach of the Internal Revenue Service. Trump also vowed at the Libertarian National Convention in Washington in May to keep Sen. Elizabeth Warren, D-Mass., and \"her goons\" away from bitcoin holders.\n\nMeanwhile, following a meeting with bitcoiners at Mar-a-Lago with about a dozen mining executives who pledged cash and votes to him, Trump declared that all future bitcoin will be minted in the U.S., should he return to the White House.\n\nOn Monday, the Republican presidential nominee added Ohio Senator JD Vance to his ticket as vice president — a move viewed by many as a net win for the crypto sector. Vance has advocated for looser regulation of crypto and disclosed in 2022 that he personally holds bitcoin .\n\nIt comes in stark contrast to the Joe Biden White House, which has been seen as hard on crypto. Under President Biden, the SEC has dialed up actions on the sector, and even in the absence of hard-and-fast rules from Congress, the U.S. has proven to be one of the most active enforcers of penalties and legal enforcements against crypto companies.\n\nThe angrier the crypto industry got at the SEC for arresting and prosecuting them, the more people like Vance saw a chance to stake out a position on the opposite side of a crypto-skeptical Biden administration.\n\nHowever, the perception that Biden is anti-crypto and Trump is pro-crypto has some Biden allies concerned enough to take their case directly to senior White House officials.\n\nTrump is set to headline the Bitcoin 2024 conference in Nashville, Tennessee on July 27."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiYkFVX3lxTE9mdTFjTC0wOENRbWR4WnYyaEIxVTFKYVc4dHIxVno2NGtmVFE2eWduYWFSZ2V5MExpdmxkbjVLTl9GZVRwd0VpbDhIZ3hJVFV5c2VqUW9ZNTQ3eWdoYUtpMFRn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETFs start trading Tuesday. Here’s what you need to know. - Fortune",
        "content": "New spot ETFs for Ethereum—which will let investors purchase the second most popular cryptocurrency in the form of stocks— are expected to begin trading on Tuesday, July 23. The Securities and Exchange Commission has green lit at least three funds to enter the market that day, sources told Reuters, although it’s believed that a total of eight Ethereum ETFs will launch simultaneously.\n\nThe instruments follow in the footsteps of the eleven trading spot Bitcoin ETFs. Having accumulated over $54 billion in assets under management since launching in January, Bitcoin has soared 47% this year. Here’s all you need to know about their Ethereum counterparts.\n\nWhat is a spot Ether ETF?\n\nEther is the native cryptocurrency of the Ethereum blockchain. Despite the SEC’s reservations, Ether is legally considered to be a commodity, but the corresponding ETFs will be securities.\n\nETFs first came to market in 1993. The funds pool together a basket of securities, such as a handful of different energy stocks, and the price aligns with the indexes that it tracks. They are listed on exchanges and can be traded during market hours, thus operating like stocks.\n\nSpot Ether ETFs will track the spot—or current—price of Ether. The products give investors access to the underlying crypto without the need to own a crypto wallet. The ETFs will be set up as grantor trusts, meaning investors will own a share of the Ether held by the trust.\n\nWho issues them and what are the fees?\n\nEight asset managers are proposing to offer Ethereum ETFs: BlackRock, Ark Invest/21Shares, VanEck, Grayscale, Fidelity, Bitwise, Franklin Templeton and Invesco/Galaxy Digital. Each instrument will be near-identical, so the fees charged to investors are competitive. For now, we know that Franklin Templeton will charge 0.19%, VanEck at 0.20%, and Invesco and Galaxy Digital will charge a 0.25% fee for its jointly filed ETF.\n\nThe full list of fees will be revealed when the final registration statements, or S-1s, are submitted to the SEC. This will be on Tuesday, if trading begins for all eight.\n\nWhere can I access them?\n\nThey will be listed on the Nasdaq, Chicago Board Options Exchange (CBOE) and New York Stock Exchange.\n\nWhy would someone buy an Ethereum ETF?\n\nBitcoin and Ether tokens represent units of ownership—and thus value—of an underlying blockchain. Beyond that, they are very different.\n\nWhereas Bitcoin may be a long-term hedge against inflation, Ethereum is closer to a tech investment. The blockchain’s main premise is “to remove the intermediary and allow for 24/7 uptime in financial services, such as trading and lending, in addition to tokenization, digital collectibles, and digital identity,” Vetle Lunde, senior analyst at K33 Research, told Fortune.\n\nWhile for now crypto markets are tightly correlated, this may not always be the case, he adds. So, Ether ETFs allow investors to diversify which corners of the crypto economy they want to invest in.\n\nWill their popularity match the spot Bitcoin ETFs?\n\nDemand for the funds will be 20% that of the spot Bitcoin ETFs, James Seyffart, Bloomberg’s ETF analyst, told Fortune. This prediction is because the market capitalization of Ether is about one-third of the size of Bitcoin. Plus, he adds, the ETFs will lack a key benefit of holding Ether: Investors will not be allowed to stake, which generates yields. But, even at this smaller size, they would be “extremely successful” by any ETF launch standard, says Seyffart. Similarly, K33 Research predicts that during the first six months of trading, inflows will be $4 billion—a quarter of the spot Bitcoin ETFs.\n\nWhen judging their success, it’s key to evaluate performance after six months of trading, rather than simply on “game day” and the initial weeks, Leah Wald, CEO and president of Cyberpunk Holdings Inc., told Fortune. Launching in summer, they’re coming to market when trading is typically “more muted,” she points out. Plus, success should also be judged on volume and spread, rather than simply inflows, as the health of these metrics foreground AUM growth down the line, she adds, as investors feel safe allocating dollars into these new securities.\n\nWho will be investing in them?\n\nInstitutional investors, such as hedge funds, pension funds, banks and endowments. Retail investors will also access them, either by buying them directly, or through portfolio allocations via wealth advisors. The latter group will likely dominate the first six months of trading, as the Q1 13Fs for the spot Bitcoin ETFs reveal that over 80% of total AUM was from non-professional investors.\n\nHow will the ETFs impact the crypto market?\n\nIf K33’s prediction of $4 billion in inflows over six months is accurate, at current prices, this would mean 1% of Ether in circulation would be absorbed by the ETFs by the end of the year. This absorption is “well positioned” to strengthen Ether’s price in the second half of the year, says Lunde.\n\nThe inflows would also be bullish for the wider market, history suggests. The fresh capital flowing into Bitcoin via the ETFs have boosted the crypto market cap by 46% in 2024, according to K33. Lunde anticipates the products “could further expand the broad market strength” as they enable sidelined capital to enter the market. Plus, Bitcoin ETF investors have “have proven to handle volatility with grace, and flows have been solid even during deep corrections,” says Lunde, suggesting ETFs can open up the market to new investors committed to the long-term.\n\nLastly, as BlackRock, a behemoth of traditional finance, is issuing one of the funds, this shows the firm is diving deeper into crypto. This grants the industry a “solid and well-needed stamp of approval,” he says."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMipwJBVV95cUxNS0puODdtWkhoc1BqWkRQc2REdlVYSnpCWGFIbGVkZFZKY0o4dk1KTkQ4dUtOWGdPVlJQRS0tS0JZb3JiRU9DVGJMR3hOanFOM2hzYU5MZkxrUGVSLWdlbVZ1dG1Rc1hwSkp4QkU1Y2JSVnoyYXpHM19LU19uUnVJczh2a09ucjgyaWYyaUxCdW54eWR0anRMXzVkRksxb01JZ2FtdFFPVjh0emhaOGxadVlwcTEtMUQ4MmdpV05YOTNNUklNdWEwWnZWVmFYSkhzdUhUX1NHUnU1SzVFTk94ZUJwbXRIVC1YMU00ZGR4RHBsa0FTTGhWT1ljZWpORVlyY2hDODFVSHRqNUc1cUJTNENweXB2b2pydlljWWlsOHU5dk1LX1h3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jul 2024 07:00:00 GMT",
        "title": "Grayscale Investments® Provides Update Related to Upcoming - GlobeNewswire",
        "content": "STAMFORD, Conn., July 17, 2024 (GLOBE NEWSWIRE) -- Grayscale Investments®, the world’s largest crypto asset manager*, offering more than 20 crypto investment products, previously announced that it has set a record date of July 18, 2024 (the “Record Date”) for the initial creation and distribution of shares of Grayscale Ethereum Mini Trust (the “ETH Trust”) to shareholders of Grayscale Ethereum Trust (Ticker: ETHE) (“ETHE”) (referred to as the “Initial Distribution”). Grayscale intends to list the ETH Trust on NYSE Arca, subject to required regulatory approvals, under the ticker symbol “ETH.” See that press release here.\n\n\n\nToday Grayscale is confirming that from and after July 18, 2024, anyone who purchases ETHE shares will not be entitled to receive ETH shares in the Initial Distribution.\n\nAdditionally, Grayscale currently expects the Distribution Date to be July 23, 2024, following (i) the filing and effectiveness of the ETH Trust’s registration statement on Form 8-A to register the ETH Shares under the Exchange Act, (ii) the effectiveness of the ETH Trust’s registration statement on Form S-1 (Registration No. 333-278878) under the Securities Act, and (iii) the ETH Shares having been approved for listing on NYSE Arca. No assurance can be given that the Initial Distribution will occur on Grayscale’s anticipated timeline, and Grayscale will update the market to the extent its expectations change.\n\n\n\nRecord Date July 18, 2024 Ratio of ETHE Shares: ETH Shares 1:1 % of Ether held by ETHE contributed to the ETH Trust 10% Anticipated Distribution Date July 23, 2024\n\n*By AUM as of 7/15/2024\n\nNO OFFER OR SOLICITATION\n\nThis communication is for informational purposes, solely in your capacity as a shareholder of ETHE, and does not constitute an offer to sell or the solicitation of an offer to buy any securities or a solicitation of any vote or approval, nor shall there be any sale of securities in any jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of such jurisdiction. No shareholder approval of the Initial Distribution is required by applicable law, and we are not seeking ETHE shareholder approval.\n\nFORWARD-LOOKING STATEMENTS\n\nCertain of the statements contained herein may be statements of future expectations and other forward-looking statements that are based on Grayscale’s views and assumptions and involve known and unknown risks and uncertainties that could cause actual events to differ materially from those expressed or implied in such statements. Grayscale assumes no obligation to update any forward-looking statements contained herein and you should not place undue reliance on such statements, which speak only as of the date hereof. Although Grayscale has taken reasonable care to ensure that the information contained herein is accurate, no representation or warranty (including liability towards third parties), expressed or implied, is made by Grayscale as to its accuracy, reliability, or completeness. You should not make any investment decisions based on these forward-looking statements. No assurance can be given that the Initial Distribution will occur on Grayscale’s anticipated timeline, or at all.\n\nIMPORTANCE OF OBTAINING PROFESSIONAL TAX ADVICE\n\nThis communication is not intended as, and does not constitute, tax advice. As further discussed in the section of the Preliminary Information Statement filed by ETHE entitled “Material U.S. Federal Income Tax Consequences of the Initial Distribution,” the U.S. federal income tax consequences of the Initial Distribution are complex, subject to uncertainty in certain respects and may be affected by circumstances specific to a beneficial owner of ETHE Shares. Any beneficial owner of ETHE Shares who receives ETH Shares in the Initial Distribution, and any intermediary holding ETHE Shares or ETH Shares, should consult their own tax advisor regarding the U.S. federal income tax consequences of the Initial Distribution, including the proper allocation of existing tax basis between ETHE Shares and ETH Shares. Please refer to the Preliminary Information Statement filed by ETHE for more information, including other U.S. federal income tax considerations relating to the Initial Distribution and ownership of the ETH Shares.\n\nADDITIONAL INFORMATION AND WHERE TO FIND IT\n\nA definitive information statement on Schedule 14C will be furnished to ETHE shareholders on or after the Record Date for the purpose of informing ETHE shareholders of the Initial Distribution, in substantial compliance with Regulation 14C of the Exchange Act. The information statement will describe the Grayscale Ethereum Mini Trust, risks of owning shares of the Grayscale Ethereum Mini Trust and other details regarding the Initial Distribution, and will be made available on our website at www.grayscale.com/documents#regulatoryfilings. ETHE shareholders will not need to pay any consideration, exchange or surrender existing ETHE Shares, or take any other action to receive shares of the Grayscale Ethereum Mini Trust in connection with the Initial Distribution.\n\nETHE is not a fund registered under the Investment Company Act of 1940 and is not subject to regulation under the Investment Company Act of 1940, unlike most mutual funds or ETFs.\n\nGrayscale Ethereum Trust and Grayscale Ethereum Mini Trust Risk Disclosures:\n\nAn investment in the Grayscale Ethereum Trust or Grayscale Ethereum Mini Trust may be deemed speculative and is not intended as a complete investment program. An investment in ETHE or the Grayscale Ethereum Mini Trust should be considered by persons financially able to maintain their investment and who can bear the risk of total loss associated with an investment in ETHE or the Grayscale Ethereum Mini Trust. Extreme volatility of trading prices that many digital assets, including Ether, have experienced in recent periods and may continue to experience, could have a material adverse effect on the value of ETHE and the Grayscale Ethereum Mini Trust and the shares of each trust could lose all or substantially all of their value. Digital assets represent a new and rapidly evolving industry. The value of ETHE and the Grayscale Ethereum Mini Trust depends on the acceptance of the digital assets, the capabilities and development of blockchain technologies and the fundamental investment characteristics of the digital asset. Digital asset networks are developed by a diverse set of contributors and the perception that certain high-profile contributors will no longer contribute to the network could have an adverse effect on the market price of the related digital asset. Digital assets may have concentrated ownership and large sales or distributions by holders of such digital assets could have an adverse effect on the market price of such digital assets. The value of ETHE and the Grayscale Ethereum Mini Trust relate directly to the value of the underlying digital asset, the value of which may be highly volatile and subject to fluctuations due to a number of factors.\n\nA registration statement related to Grayscale Ethereum Mini Trust has been filed with the SEC but has not yet become effective. An investment in the Grayscale Ethereum Mini Trust cannot be made, nor money accepted, until the registration statement is effective. An investor should consider the investment objectives, risks, and charges and expenses of the Grayscale Ethereum Mini Trust carefully before investing. A preliminary prospectus which contains information about Grayscale Ethereum Mini Trust may be obtained by emailing info@grayscale.com. The information in the preliminary prospectus is not complete and may be changed. The final prospectus should be read carefully before investing, and when available may be obtained from the same source. This communication is not an offer to sell shares and is not soliciting an offer to buy shares in any state where the offer or sale is not permitted.\n\nGrayscale Investments, LLC is the Sponsor of Grayscale Ethereum Trust and Grayscale Ethereum Mini Trust.\n\nAbout Grayscale Investments®\n\nGrayscale enables investors to access the digital economy through a family of regulated and future-forward investment products. Founded in 2013, Grayscale has a proven track record and deep expertise as the world’s largest crypto asset manager. Investors, advisors, and allocators turn to Grayscale for single-asset, diversified, and thematic exposure. Certain Grayscale products are distributed by Grayscale Securities, LLC (Member FINRA/SIPC) and certain products are managed by Grayscale Advisors, LLC.\n\nMedia Contact\n\nJennifer Rosenthal\n\npress@grayscale.com"
    }
]