[
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxOeFRBSVdfajVsSUhCZjM3Zm1iR0lQOTNHdHlaellrV1VNTmRPaWRlSkttaVZfTUVScWZmMG4yVFJLUVdZOWlET0NqcWhNREt0eEhxWEVUZ25EdWZHa01YUWVKMDJ4T2dqb1YtdWlpa0dQZGlfa2Y4blBVRzdSVXRaTFVMcWM5ZXBpNWgzTzNTVkpLcDZ5M0x0WVlxbGZzSlBCZUROYlFoclN0d3dQZWNrT0NfUkdwZEV1dGfSAb8BQVVfeXFMTjhMb3pzTGtQNmtfRXZFQ1Zha3ZfNE5BTVZoVWJBOVJ2RVpmVzdzdHAyM2QwRG9IY2JqVUxZc0xIellVY1NSc2xWeHFFcW5ScnJ0b1NTZjEwSG0tcEpVRDF5S3BBYW5sWWtpVWRrVFRCcW1KLXhtU2Ixc3hRWTRGaTJGSC00NldIeWJhRVQxTDFmaVJlUzVsc3BCbHgwcGRRdUU0ZDZmanJneUVzZHZCS2lMRV9fMzF5YXJ2bmJBSXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Feb 2024 08:00:00 GMT",
        "title": "Crypto Trader Says Ethereum Accumulation Phase Now Over, Predicts Rally for ETH Rival - The Daily Hodl",
        "content": "A closely followed crypto strategist believes that Ethereum (ETH) is now in an uptrend after a lengthy period of accumulation.\n\nPseudonymous analyst Inmortal tells his 206,500 followers on the social media platform X that ETH has convincingly broken out of a trading range after retesting the lower $2,000 level several times in the past few months.\n\n“Wake up honey, bear market accumulation is over.”\n\nEthereum is trading for $2,670 at time of writing, up more than 6% in the last 24 hours.\n\nNext up, the trader thinks there is a price correlation between ETH-rivals Solana (SOL) and Avalanche (AVAX) and is expressing bullish sentiment on both tokens.\n\n“If SOL pumps, AVAX will follow. Muscle memory.”\n\nSOL is trading for $113.94 at time of writing, while AVAX is trading for $41.27.\n\nThe trader is also bullish on open-source gaming blockchain Beam (BEAM).\n\n“My unspecified amount of BEAM is up.”\n\nLooking at his chart, the trader suggests BEAM is in an uptrend after bouncing off the bottom of a trading range at around $0.0170.\n\nBEAM is trading for $0.0294 at time of writing, up more than 14% in the last 24 hours.\n\nLastly, the trader is predicting Bitcoin (BTC) will go on a massive rally when retail traders sitting on the sidelines enter the crypto market.\n\n“No new participants in crypto and we are at $48,000, chilling. Imagine when the masses come in like they did in 2021. We are going much higher, soon.”\n\nBitcoin is trading for $49,777 at time of writing, up more than 3% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxNcnhFT2NWaEtvZUlMVDVXMGRiTkxPWW5wUV8tVEdTWGhfWUJGd1c4V3pWOU1SNUN4Qlp2cGwtd2E5YzcycHEzc2ltdkQ5Q3Vza1dPdjlEUVp2MU5ob21qY2EzNVgyVExyeWN6cXBuWXZiR3VpTFJCcUxwWHl1dUVUZ1JSUnRpLXNRSUNWOERDb2k3VWNDR09QS1oxbzBRdHZWcFFhVWVPUlZLSDVRUFR1MjNB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Feb 2024 08:00:00 GMT",
        "title": "Ethereum, Solana see gains as Bitcoin's rally above $50,000 causes $184 million liquidations - CryptoSlate",
        "content": "Bitcoin’s surge past $50,000 catalyzed a broader market upswing, propelling numerous large-cap alternative digital assets such as Ethereum (ETH), Solana (SOL), and others to significant gains.\n\nAccording to data from CryptoSlate, Ethereum saw a 7% uptick, reaching $2,661, while SOL surged 8% to hit $114. Among the top 10 digital assets, Avalanche’s AVAX spiked 6% to $41, Cardano’s ADA rose by 3.74% to $0.5574, while BNB Coin (BNB) and Ripple’s XRP experienced more modest gains, each climbing by less than 3%.\n\nMarket analysts attribute this bullish trend to the buzz surrounding the multiple spot Bitcoin exchange-traded funds (ETFs) in the US. Vetle Lunde, a senior analyst at K33 Research, noted that inflows into these ETFs have remained robust more than a month after their launch.\n\n“Yesterday saw a net inflow of 9,870 BTC, pushing the net U.S. spot ETF flow since launch to 72,312 BTC. The new nine now hold 228,000 BTC,” Lunde added.\n\nDuring the past day, BTC’s price crossed the $50,000 threshold for the first time since late 2021. The top crypto’s value has risen 4.2% to $50,146 as of press time, extending a positive run that had seen it gain 16% over the past week.\n\n$184 million in liquidation\n\nThe broader crypto market rally resulted in a significant liquidation totaling over $184 million from more than 56,000 traders, according to Coinglass data.\n\nShort traders, or speculators betting against price increases, bore losses amounting to $134 million, while long traders betting on price increases lost approximately $50 million.\n\nAcross assets, Bitcoin led the liquidation charts with a total loss of $69.80 million. Short Bitcoin traders accounted for $55.04 million in losses, while long traders lost $14.76 million. Ethereum followed closely, contributing $39.85 million to the overall liquidation.\n\nOther assets like Solana, LINK, and ORDI also experienced liquidations of $10.14 million, $5.93 million, and $4.81 million, respectively.\n\nAcross exchanges, Binance witnessed the highest proportion of liquidations at 43.13%, totaling $79.42 million. Other platforms like OKX and ByBit recorded liquidations of $58.29 million and $18.73 million, respectively.\n\nNotably, the most significant liquidation order occurred on Bitmex for LINKUSD, amounting to $3.14 million.\n\nMentioned in this article"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxOU0tFZkdYRUhRMUxnUjg3dk40THRBbkhWcnBJV0FGZl9HY0twVmctTTVXOE5ad095SkN5OUZjOVdKNldhRVdKSG16TzNzZVVCUF9lSWxSTzl4X3d5MVhmUjFDcnNuM2JmN2xMRUlheFZHTEFQNVJOSU9VdjFuZzM5Ti1EVUxnRnM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Feb 2024 08:00:00 GMT",
        "title": "Is Ethereum (ETH) Price on the Verge of a $3,000 Rally ? - crypto.news",
        "content": "On Feb. 12, Ethereum (ETH) price peaked at $2,633, just shy of its 2024 top, while Bitcoin (BTC) raced above the $50,000 for the first time since 2022.\n\nBitcoin (BTC) attracted the media attention after breaking the $50,000 barrier on Feb. 12, but Ethereum bulls are making strategic moves to stage a similar breakout.\n\nWill ETH price reclaim $3,000 in the coming days?\n\nEthereum derivative traders have intensified bullish bets\n\nEthereum and Bitcoin price action have been closely correlated for many years. This has sparked optimism that BTC hitting the $50,000 milestone on Feb. 12 could open the doors to ETH making a similar bullish upswing.\n\nIn the ETH derivatives markets, there has been an noticeable increase in the spate at which speculative traders are placing leveraged bullish bets.\n\nCryptoQuant’s funding rate represents the aggregate percentage of fees paid by perpetual futures traders to keep their positions open.\n\nThe chart below, shows the ETH funding rate rose to 0.4% on Feb. 13, signaling that speculative traders are placing more leveraged bets on an imminent ETH price upswing.\n\nNotably this is its highest in more than 40-days dating back Jan. 8, when investors were piling on bullish positions ahead of the Bitcoin spot ETF verdict.\n\nEthereum (ETH) Funding Rate vs Price Source: CryptoQuant\n\nConcisely put, rising values of positive funding rates indicates that long position holders are showing paying increased fees to short traders, in anticipation that an imminent price upswing will yield outsized profits.\n\nETH is trading just below the $2,660 mark, at the time of writing on Feb. 13. Hence, this surge in ETH funding rates right after BTC crossing the $50,000 milestone indicates an overwhelming bullish outlook that an Ethereum price rally toward $3,000 could soon follow.\n\nUS whales are ramping their ETH purchases\n\nUS-based corporate entities have further intensified efforts to score an ETH spot ETF approval in H1 2024. On Feb. 12, Frank Templeton became the latest asset manager to file ETH derivative applications with the US Securities and Exchange Commission (SEC).\n\nIt appears that the institutional participants are backing up their optimism with rapid ETH purchases in the spot markets. Cryptoquant’s Coinbase Premium index tracks the intra-day difference in Ethereum prices quoted on Coinbase Pro exchange and Binance.\n\nAs depicted below, Ethereum Coinbase Premium index stood at 0.04 on Feb. 13 and has been trending in positive values since Feb. 8. And during that\n\nEthereum (ETH) Binance vs. Coinbase Premium index | Source: CryptoQuant\n\nThis critical metric is based on the premise that Binance dominates the retail trading market, the majority of Coinbase pro clientele is dominated by US-based corporates and high-networth investors looking to trade within a more regulated environment.\n\nHence, positive values of the Coinbase Premium index means that ETH quoted prices on Coinbase have been consistently higher than Binance, indicating that the whales’ buying pressure on Coinbase Pro has exceeded retail activity on Binance.\n\nThis pattern has often appeared in the build up to major ETH price rallies. Unsurprisingly, ETH price has gained 11% since the whales dialed up the buying pressure on Feb. 8.\n\nCombined with the dominant bullish sentiment among the speculative traders, this unusual buying trend observed among the whales could send ETH price to its next milestone target at $3,000.\n\nETH price forecast: $3,000 target in focus\n\nIn summary, speculative traders showing optimism with rising funding rates and the buying pressure from US-based whales have put ETH price on an upward trajectory.\n\nAnd based on the historical patterns associated with these bullish metrics, Ethereum price is likely to make another leg-up toward the $3,000 area.\n\nHowever, the bulls face major roadblock at the $2,750 range. IntoTheBlock’s in/out of the money data shows that, 878,100 addresses had acquired 671,830 ETH at the average price of $2,760.\n\nIf the bulls can scale this initial resistance level, it could generate momentum to push for $3,000 target as predicted.\n\nEthereum (ETH) Price Forecast, February 2024 | Source: IntoTheBlock\n\nOn the flip side, ETH price could enter a negative trend if the bears can force a downswing below $2,000. But this scenario seems unlikely in the short-term. The chart above shows that 3 million holders acquire 6.2 million ETH at the average price of $2,300. If those holders defend their position ETH will like a solid short-term support around the $2,350 level."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE4zeFVubGc1My16cGxGWUVvMG81SWRiMHBqN2ZjQ0NycE1qdUp3QUgwLWpHd3JWVmw2cFc5RkFsTjk1Q0F1NjF1QW1DNnUyYVJLeGotNGUwMWo1c1JhQkVodkdfUHY0NFV1QUdWQ3draFZFNkU1MTBYTjRJRHA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Feb 2024 08:00:00 GMT",
        "title": "3 Cryptos to Buy Before Bitcoin’s Next Major Move - Yahoo Finance",
        "content": "Bitcoin has been on fire lately! After a relatively quiet 2023, the king of crypto has awoken from its slumber over the past week. Bitcoin (BTC-USD) has gained over 13% in the last week alone, barreling over the key psychological $50,000 per token resistance level.\n\nThis recent surge signals that we may officially be entering a new crypto bull market. The last major Bitcoin bull run started in late 2020 after Bitcoin undertook its quadrennial halving event. Prices skyrocketed until a blow-off top in November 2021.\n\nThis time, the spark likely has more to do with an influx of institutional cash rather than the token’s upcoming halving. With 11 spot Bitcoin ETFs approved last month, billions in fresh capital is entering the crypto sector. Add on the fact that the next halving is likely happening in April 2024, and the stage seems set for even more fabulous fireworks this cycle.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nWhen Bitcoin starts pumping, history shows many altcoins follow suit in a big way. Here are three to consider before they do.\n\nEthereum (ETH-USD)\n\nA stack of ethereum coins\n\nSource: shutterstock\n\nAs the second largest cryptocurrency behind Bitcoin, Ethereum (ETH-USD) has cemented itself as the most correlated altcoin when compared to this crypto benchmark. When Bitcoin pumps, Ethereum almost always follows suit. Historically, Ethereum tends to see amplified gains relative to Bitcoin, delivering even higher returns for investors.\n\nI believe Ethereum is poised to outperform Bitcoin in the next major crypto bull market rally. It still has a smaller market capitalization than Bitcoin, giving it much more upside potential in terms of its valuation multiple. Additionally, Ethereum has recently become deflationary due to its proof-of-stake consensus mechanism and token burning. The token’s current annualized deflation rate sits around 2%, meaning existing Ethereum tokens become more scarce over time.\n\nBut what truly gives Ethereum an edge over Bitcoin as an investment is its role as the dominant smart contract-enabled blockchain network. Ethereum is the foundation for most decentralized applications and Web 3.0 use cases, from NFTs to DeFi. It is spearheading innovation in the blockchain space, while Bitcoin remains primarily a store of value commodity.\n\nFor these reasons, Ethereum has beaten Bitcoin’s performance in every bull market cycle. I expect this trend to continue in the next bull market, as more developers build on Ethereum and more investors recognize its network effects over other chains. The stars are aligning for potentially parabolic gains for Ethereum if Bitcoin’s momentum continues.\n\nStory continues\n\nKaspa (KAS-USD)\n\nAn image of a hand holding a cell phone with several visualizations of digital building blocks floating above it. representing sto platforms\n\nSource: Marko Aliaksandr/ShutterStock.com\n\nKaspa (KAS-USD) has seen tremendous growth over the last year to cement itself as a promising medium-sized layer-1 blockchain. With a market capitalization now above $3.1 billion at the time of writing, Kaspa is catching the eye of both developers and investors.\n\nAs I’ve discussed previously, Kaspa distinguishes itself through its unique DAG-based architecture called GHOSTDAG. By generalizing the blockchain into a directed acyclic graph structure, Kaspa is able to achieve significant scalability improvements in both transaction throughput and processing speed.\n\nThe protocol handles security and ledger ordering by distinguishing “blue blocks” created by honest actors from potentially malicious “red blocks.” The largest strongly connected cluster within the acyclic graph identifies trustworthy blocks to favor. This prevents attacks like double spends or transaction rollbacks. I think Kaspa has the potential to reach a market cap of over $10 billion if the project’s tech becomes more time-tested.\n\nPolygon (MATIC-USD)\n\nA phone, on top of a laptop keyboard, displaying the logo for Polygon. Polygon Price Predictions\n\nSource: sdx15 / Shutterstock.com\n\nPolygon (MATIC-USD) seems primed to ride any Ethereum bull run as a leading Ethereum scaling solution. Originally launching as a sidechain, Polygon has rapidly expanded its capabilities to become a versatile layer-2 network. Its core advantage lies in significantly improving Ethereum’s transaction speeds and reducing gas costs on the Ethereum network.\n\nPolygon now has two main components – Polygon PoS and Polygon zkEVM. Polygon PoS offers compatibility with Ethereum smart contracts by functioning as a sidechain alternative. Polygon zkEVM replicates the Ethereum virtual machine environment with zero-knowledge proof cryptography to enable private transactions.\n\nThis multi-faceted approach aims to maintain Ethereum’s censorship resistance and security guarantees while drastically increasing scalability. Polygon essentially tries to offer developers the best of both worlds – Ethereum-equivalent functionality with faster and cheaper transactions.\n\nNotably, Polygon’s roadmap indicates even bigger ambitions, including upgrading Polygon PoS to a zkEVM chain and launching new standalone chains. With abundant room for growth in both its network infrastructure and token price, Polygon could be one of the top performers if the crypto bull market returns in a big way.\n\nOn the date of publication, Omor Ibne Ehsan did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nOmor Ibne Ehsan is a writer at InvestorPlace. He is a self-taught investor with a focus on growth and cyclical stocks that have strong fundamentals, value, and long-term potential. He also has an interest in high-risk, high-reward investments such as cryptocurrencies and penny stocks. You can follow him on LinkedIn.\n\nMore From InvestorPlace\n\nThe post 3 Cryptos to Buy Before Bitcoin’s Next Major Move appeared first on InvestorPlace."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE4zeFVubGc1My16cGxGWUVvMG81SWRiMHBqN2ZjQ0NycE1qdUp3QUgwLWpHd3JWVmw2cFc5RkFsTjk1Q0F1NjF1QW1DNnUyYVJLeGotNGUwMWo1c1JhQkVodkdfUHY0NFV1QUdWQ3draFZFNkU1MTBYTjRJRHA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Feb 2024 08:00:00 GMT",
        "title": "3 Cryptos to Buy Before Bitcoin’s Next Major Move - Yahoo Finance",
        "content": "Bitcoin has been on fire lately! After a relatively quiet 2023, the king of crypto has awoken from its slumber over the past week. Bitcoin (BTC-USD) has gained over 13% in the last week alone, barreling over the key psychological $50,000 per token resistance level.\n\nThis recent surge signals that we may officially be entering a new crypto bull market. The last major Bitcoin bull run started in late 2020 after Bitcoin undertook its quadrennial halving event. Prices skyrocketed until a blow-off top in November 2021.\n\nThis time, the spark likely has more to do with an influx of institutional cash rather than the token’s upcoming halving. With 11 spot Bitcoin ETFs approved last month, billions in fresh capital is entering the crypto sector. Add on the fact that the next halving is likely happening in April 2024, and the stage seems set for even more fabulous fireworks this cycle.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nWhen Bitcoin starts pumping, history shows many altcoins follow suit in a big way. Here are three to consider before they do.\n\nEthereum (ETH-USD)\n\nA stack of ethereum coins\n\nSource: shutterstock\n\nAs the second largest cryptocurrency behind Bitcoin, Ethereum (ETH-USD) has cemented itself as the most correlated altcoin when compared to this crypto benchmark. When Bitcoin pumps, Ethereum almost always follows suit. Historically, Ethereum tends to see amplified gains relative to Bitcoin, delivering even higher returns for investors.\n\nI believe Ethereum is poised to outperform Bitcoin in the next major crypto bull market rally. It still has a smaller market capitalization than Bitcoin, giving it much more upside potential in terms of its valuation multiple. Additionally, Ethereum has recently become deflationary due to its proof-of-stake consensus mechanism and token burning. The token’s current annualized deflation rate sits around 2%, meaning existing Ethereum tokens become more scarce over time.\n\nBut what truly gives Ethereum an edge over Bitcoin as an investment is its role as the dominant smart contract-enabled blockchain network. Ethereum is the foundation for most decentralized applications and Web 3.0 use cases, from NFTs to DeFi. It is spearheading innovation in the blockchain space, while Bitcoin remains primarily a store of value commodity.\n\nFor these reasons, Ethereum has beaten Bitcoin’s performance in every bull market cycle. I expect this trend to continue in the next bull market, as more developers build on Ethereum and more investors recognize its network effects over other chains. The stars are aligning for potentially parabolic gains for Ethereum if Bitcoin’s momentum continues.\n\nStory continues\n\nKaspa (KAS-USD)\n\nAn image of a hand holding a cell phone with several visualizations of digital building blocks floating above it. representing sto platforms\n\nSource: Marko Aliaksandr/ShutterStock.com\n\nKaspa (KAS-USD) has seen tremendous growth over the last year to cement itself as a promising medium-sized layer-1 blockchain. With a market capitalization now above $3.1 billion at the time of writing, Kaspa is catching the eye of both developers and investors.\n\nAs I’ve discussed previously, Kaspa distinguishes itself through its unique DAG-based architecture called GHOSTDAG. By generalizing the blockchain into a directed acyclic graph structure, Kaspa is able to achieve significant scalability improvements in both transaction throughput and processing speed.\n\nThe protocol handles security and ledger ordering by distinguishing “blue blocks” created by honest actors from potentially malicious “red blocks.” The largest strongly connected cluster within the acyclic graph identifies trustworthy blocks to favor. This prevents attacks like double spends or transaction rollbacks. I think Kaspa has the potential to reach a market cap of over $10 billion if the project’s tech becomes more time-tested.\n\nPolygon (MATIC-USD)\n\nA phone, on top of a laptop keyboard, displaying the logo for Polygon. Polygon Price Predictions\n\nSource: sdx15 / Shutterstock.com\n\nPolygon (MATIC-USD) seems primed to ride any Ethereum bull run as a leading Ethereum scaling solution. Originally launching as a sidechain, Polygon has rapidly expanded its capabilities to become a versatile layer-2 network. Its core advantage lies in significantly improving Ethereum’s transaction speeds and reducing gas costs on the Ethereum network.\n\nPolygon now has two main components – Polygon PoS and Polygon zkEVM. Polygon PoS offers compatibility with Ethereum smart contracts by functioning as a sidechain alternative. Polygon zkEVM replicates the Ethereum virtual machine environment with zero-knowledge proof cryptography to enable private transactions.\n\nThis multi-faceted approach aims to maintain Ethereum’s censorship resistance and security guarantees while drastically increasing scalability. Polygon essentially tries to offer developers the best of both worlds – Ethereum-equivalent functionality with faster and cheaper transactions.\n\nNotably, Polygon’s roadmap indicates even bigger ambitions, including upgrading Polygon PoS to a zkEVM chain and launching new standalone chains. With abundant room for growth in both its network infrastructure and token price, Polygon could be one of the top performers if the crypto bull market returns in a big way.\n\nOn the date of publication, Omor Ibne Ehsan did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nOmor Ibne Ehsan is a writer at InvestorPlace. He is a self-taught investor with a focus on growth and cyclical stocks that have strong fundamentals, value, and long-term potential. He also has an interest in high-risk, high-reward investments such as cryptocurrencies and penny stocks. You can follow him on LinkedIn.\n\nMore From InvestorPlace\n\nThe post 3 Cryptos to Buy Before Bitcoin’s Next Major Move appeared first on InvestorPlace."
    }
]