[
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTFBiQnltT3pCcENTd01jRXRrOFlQRDktNWxTTEVERzB1MDRkSmhlTmxOVnZJR0dWdnpFdlhpX01qRVBrVmNxeUc0QWRrY3YtTUN1VmQ0bW9kWW1WakNqVm5JXzJtcGdXRUxlMTd2QzdTQnJLRHRQSkVCVW5rNNIBgAFBVV95cUxQSkhYbzEzemYtdVhlLVpESnBIWnlmdFJJYlhPazhGV3FmSkI3OXUxX2d5Y3hGREVDYnlqRWEtSGotNTd1Rm04X0FxMms2V04tUElVTmtsZUs5OERpNlVqWmJjdFlPRjNQTndTUXczMjd1Zkd2Vklod0h0N0Z0Vmh3bQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 12 Mar 2024 07:00:00 GMT",
        "title": "Ethereum surpasses US$4,000 ahead of Dencun upgrade - Forkast News",
        "content": "Ethereum is set to undergo a significant upgrade named Dencun this Wednesday, which is anticipated to reduce gas fees for scaling networks.\n\nThe upgrade, which combines elements from previous upgrades Cancun and Deneb, aims to improve the blockchain’s scalability, security, and user experience.\n\nThe Dencun hard fork will introduce nine Ethereum Improvement Proposals (EIPs), including proto-danksharding with EIP-4844, which is expected to lower transaction fees and increase processing speed.\n\nThe Dencun upgrade follows roughly a year after the Shanghai upgrade and is considered one of the most significant changes to the Ethereum network since the Merge.\n\nIt is designed to enhance the network’s layer-2 scaling solutions, which are platforms built on top of the Ethereum blockchain to increase its transaction capacity\n\nThe upgrade will not directly affect mainnet gas fees but is expected to encourage more users to utilize layer-2 networks.\n\nThe Dencun upgrade also includes EIP-7044, which allows validators and stakers to set conditions for exiting their staking positions, providing additional security and flexibility."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxQMENtRDdTNkE5R2ozQ3hCMlFGZnptTE96Rk45bXJWcThILW5ZYVU1eEQxZFd2d0QyQ0ljMXdIRHNGdlJvVlpvanNlcHNBc0p6Z1BwVS1rNTNmM1NNR241Yk1DdVRGd2k1QW93bWtRb1ZfRVIxZXdXMmNla1BLdEFlVXQxb1dwa291WkduVGtlWTk2Ym5MVnN3Wjk2SlU2MVhwZnJnd1ItSzRRZmhFVjhrOXoyX2t5TDJ0TDY4SThlUVlpcEhuVklZdmV3X1dZNlZPY3BIVQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 12 Mar 2024 07:00:00 GMT",
        "title": "'Solana Is The Ethereum Of The Last Cycle,' Says Raoul Pal: SOL Up 11% In A Week - Benzinga",
        "content": "Layer-1 blockchain Solana SOL/USD is up 11% over the past week, taking back the spotlight from meme coins and looking to build further bullish momentum.\n\nWhat Happened: \"Macro guru\" and Real Vision CEO Raoul Pal stated that \"crypto summer\" just started and is \"up only\" in his latest interview on the Rug Radio YouTube channel.\n\nHe described crypto summer as being in the middle of a strong uptrend, wherein you can get 30% pullbacks in the short term. Pal foresees 2024 as a crypto summer year:\n\n“This is the time when ETH outperforms Bitcoin, Solana outperforms ETH, a bunch of alts will outperform Solana… The big trade is now on.”\n\nSpecifically highlighting Solana, he predicts the token to peak at fresh all-time highs this market cycle, saying that “Solana is the Ethereum of the last cycle.”\n\nDepending on the upcoming crypto cycle, Solana is likely to witness a surge between 235% and 570% from current levels, Pal said.\n\nAlso Read: Bitcoin Rally Sparks Hope For Altcoins Revival Despite 72% Of Projects Dying Since 2020: 'BTC Increasing Lifts All Boats In A Way'\n\nWhy It Matters: The rise in Solana addresses and total value locked indicates rising adoption of the token and genuine user engagement on the network.\n\nThe surge in addresses comes amid a weekly 8% price rally, taking its monthly gains to 35%.\n\nZeta Markets Founder Tristan Frizza told The Block, “With Solana already recording more daily transactions than Ethereum, Arbitrum, Optimism, BNB Chain, Tron, and Avalanche combined, its ascent to a top three blockchain by market cap seems inevitable.”\n\nBased on The Block’s Data Dashboard, the number of daily active addresses on Solana has surged to 1.01 million as of March 11, compared to 779,080 addresses one week prior.\n\nAdditionally, the number of new addresses on the Solana network surged to 717,960 as of March 11, compared to 513,270 one week prior.\n\nSolana's value moved on-chain, daily, standing at $3.18 trillion as of March 10, compared to $1.13 trillion as of last week.\n\nWhile meme coins have been witnessing a rally for some weeks now, Layer-1 coins may be heating up to catch the market rally.\n\nRead Next: Dogecoin, Pepe, Shiba Inu Rally Raises Hopes For Impending Altcoin Season: '...Will Start Outperforming About The Time We Are Now'\n\nImage: Rcc_Btn/Shutterstock"
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxQMENtRDdTNkE5R2ozQ3hCMlFGZnptTE96Rk45bXJWcThILW5ZYVU1eEQxZFd2d0QyQ0ljMXdIRHNGdlJvVlpvanNlcHNBc0p6Z1BwVS1rNTNmM1NNR241Yk1DdVRGd2k1QW93bWtRb1ZfRVIxZXdXMmNla1BLdEFlVXQxb1dwa291WkduVGtlWTk2Ym5MVnN3Wjk2SlU2MVhwZnJnd1ItSzRRZmhFVjhrOXoyX2t5TDJ0TDY4SThlUVlpcEhuVklZdmV3X1dZNlZPY3BIVQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 12 Mar 2024 07:00:00 GMT",
        "title": "'Solana Is The Ethereum Of The Last Cycle,' Says Raoul Pal: SOL Up 11% In A Week - Benzinga",
        "content": "Layer-1 blockchain Solana SOL/USD is up 11% over the past week, taking back the spotlight from meme coins and looking to build further bullish momentum.\n\nWhat Happened: \"Macro guru\" and Real Vision CEO Raoul Pal stated that \"crypto summer\" just started and is \"up only\" in his latest interview on the Rug Radio YouTube channel.\n\nHe described crypto summer as being in the middle of a strong uptrend, wherein you can get 30% pullbacks in the short term. Pal foresees 2024 as a crypto summer year:\n\n“This is the time when ETH outperforms Bitcoin, Solana outperforms ETH, a bunch of alts will outperform Solana… The big trade is now on.”\n\nSpecifically highlighting Solana, he predicts the token to peak at fresh all-time highs this market cycle, saying that “Solana is the Ethereum of the last cycle.”\n\nDepending on the upcoming crypto cycle, Solana is likely to witness a surge between 235% and 570% from current levels, Pal said.\n\nAlso Read: Bitcoin Rally Sparks Hope For Altcoins Revival Despite 72% Of Projects Dying Since 2020: 'BTC Increasing Lifts All Boats In A Way'\n\nWhy It Matters: The rise in Solana addresses and total value locked indicates rising adoption of the token and genuine user engagement on the network.\n\nThe surge in addresses comes amid a weekly 8% price rally, taking its monthly gains to 35%.\n\nZeta Markets Founder Tristan Frizza told The Block, “With Solana already recording more daily transactions than Ethereum, Arbitrum, Optimism, BNB Chain, Tron, and Avalanche combined, its ascent to a top three blockchain by market cap seems inevitable.”\n\nBased on The Block’s Data Dashboard, the number of daily active addresses on Solana has surged to 1.01 million as of March 11, compared to 779,080 addresses one week prior.\n\nAdditionally, the number of new addresses on the Solana network surged to 717,960 as of March 11, compared to 513,270 one week prior.\n\nSolana's value moved on-chain, daily, standing at $3.18 trillion as of March 10, compared to $1.13 trillion as of last week.\n\nWhile meme coins have been witnessing a rally for some weeks now, Layer-1 coins may be heating up to catch the market rally.\n\nRead Next: Dogecoin, Pepe, Shiba Inu Rally Raises Hopes For Impending Altcoin Season: '...Will Start Outperforming About The Time We Are Now'\n\nImage: Rcc_Btn/Shutterstock"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxOU01NcjByVGZSVlg1SWFqRGpJRmU3MEdaUWpRVURCR1Y0NXpubXpmVDRMY28yN1dJMGRfczBaNnA5SDkyYUJueUlkb3piX2ZUU0ZFR2hzOUFHRWVLb3J2YTVvZjVpTHBFNU85aGJGWWpySzNnZU92OW9MOFhhX2NVR0xTNEthTGdrZFZ1RDFndDV2cE5WY1gyWlZBcUo?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 12 Mar 2024 07:00:00 GMT",
        "title": "Punters put 79% odds on Ethereum all-time high even as ETF approval chances shrink - DLNews",
        "content": "Ethereum has a four-in-five chance of hitting a new record high in 2024, according to bettors on Polymarket.\n\nAt the same time, analysts and online punters’ hopes for an Ethereum ETF approval are dwindling.\n\nSo what’s driving the surge?\n\nOnline punters put the odds of Ethereum breaking a record this year at 79%, according to a bet on crypto predictions platform Polymarket. That’s up from 31% in mid-February.\n\nYet bettors and analysts are putting slim chances of a Securities and Exchange Commission approval of a spot Ethereum exchange-traded fund.\n\nThe deadline for an SEC decision on VanEck’s application is on May 23.\n\nBettors on Polymarket give a spot Ethereum ETF a 31% chance of being approved, down from 82% at the beginning of January.\n\n“I get all the reasons they should approve it — and we personally believe they should — but all the signs/sources that were making us bullish [two and a half months] out for Bitcoin spot are not there this time,” Eric Balchunas said in a post on X.\n\nHe and his fellow Bloomberg Intelligence analyst James Seyffart revised their approval odds to 35% on Monday, down from 70% in February.\n\nThe hope is that if and when spot Ethereum ETFs are approved, they will give the asset a similar growth as Bitcoin had on the back of ETFs in January.\n\nThe news comes as Bitcoin hit a new all-time high of $71,000 on Monday, with many wondering if Ethereum will follow suit.\n\nJoin the community to get our latest stories and updates\n\nEthereum surged to a yearly high above $4,070 on Monday and is up more than 60% over the last 30 days.\n\nEthereum reached a record $4,878 in November 2021.\n\nAnalysts have identified several key factors that could super-charge it to new peaks.\n\nThey include broad optimism, supply-side dynamics, and the upcoming Dencun upgrade.\n\nSupply constraints\n\nAnother Ethereum tailwind: its shrinking supply due to tokens being locked up for staking, Pratik Kala, senior digital asset investment analyst at crypto fund manager DigitalX, told DL News on Monday.\n\n“Less supply to go around is always bullish,” Pratik said. “This also indicates strong long-term investor demand to buy/hold/stake ETH versus using it for short-term speculation.”\n\nStaking in Ethereum parallels Bitcoin mining by generating additional tokens, verifying transactions, and safeguarding the blockchain.\n\nLocking up tokens for staking effectively means removed them from the circulating supply, which can lead to a decrease in the overall available supply.\n\nRoughly 26% of Ethereum’s estimated circulating supply of more than 120 million tokens are locked away, according to blockchain explorer beaconcha.in.\n\nDencun upgrade\n\nInvestment bank JPMorgan and spot Bitcoin ETF provider Grayscale are among those that have identified the Dencun upgrade as a catalyst for Ethereum.\n\nThe upgrade, due Wednesday UK time, is designed to enhance scalability and reduce transaction fees on layer 2 platforms.\n\n“With layer 2 solutions built on top of Ethereum, the blockchain is becoming the settlement layer for a whole new digital infrastructure encompassing gaming, trading, and investing,” Eugene Cheung, Bybit’s head of institutions, told DL News earlier in March.\n\n“The value of all of this will tend to accrue to the ETH asset.”\n\nCorrection: A previous headline misstated the Polymarket odds of an Ethereum record at 56%. It has been corrected to 79%.\n\nSebastian Sinclair is a markets correspondent for DL News. Have a tip? Contact Seb at sebastian@dlnews.com."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTE9tTHRKZUlyZHNudEVvM3hHVVh3QlkxWHFaRzFVZGhreFJNUFAyYTAyYzltSmRBRHpURVF0WXNTQ21MUExIOWpwQXROaWFWYklRNTNwQnRRS3RBMGJlb1l4dUs1ekExWHZRUDcwVHBZVnhnMXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 12 Mar 2024 07:00:00 GMT",
        "title": "Cheatsheet: Ethereum on track to burn $10B ETH over next year - Blockworks",
        "content": "This is Cheatsheet, a primer on what’s happening in crypto today.\n\nCrypto has hit that point of the bull market where anything and everything is rallying without any real link between star performers.\n\nToday, toncoin (TON) is beating the top end of the table, up 25% as of 8 am ET. While TON is its own layer-1 blockchain, the token finds utility with a web of Telegram trading bots rapidly gaining popularity over the past year.\n\nXRP is second for the day with 12.5%, followed by flow (FLOW), the native crypto for the NFT-focused chain built by Dapper Labs, which is up 9%.\n\nBitcoin (BTC) and ether (ETH) have ended up flat over the same period. Crypto’s total market capitalization is now only 7% shy of its $3 trillion record high, set in late 2021.\n\nOn-chain mail\n\nAfter plateauing for six weeks, Ethereum is now burning supply faster than at any point in the past nine months.\n\nThe ETH supply has shrunk by 74,603 ETH ($300 million) over the past month.\n\nBurns were totally stagnant between Christmas and the second week of February.\n\nEthereum will burn $10 billion ETH over the next year at its current pace (and current prices), per ultrasound.money.\n\nAs of August 2021, the Ethereum network burns a small amount of ETH with every transaction — specifically the base fee paid by users.\n\nThe ETH supply has shrunk by 0.31% over the past year and is currently on track to reduce by 1.42% over the next if on-chain activity keeps up.\n\nThe network still issues fresh ETH with every block: without burns, the circulating ETH supply would increase by 0.5% every year.\n\nTop DEX Uniswap still burns more ETH than any other platform — more than 22,000 ETH ($87.9 million) over the past month.\n\nTelegram trading bot Banana Gun is burning more ETH than layer-2s Arbitrum and Optimism.\n\nETH supply is tipped to dip below 120 million sometime in May, which would return it to Aug. 2022 levels.\n\nEthereum supply may have peaked in September 2022 (source)\n\nCrypto business\n\nBitcoin’s strength still hasn’t converted to gains for crypto stocks, with only two set to open Tuesday higher: MicroStrategy and Coinbase.\n\nMicroStrategy gained 4.11% on Monday and added another 5% after hours as of 7 am, ET.\n\nCoinbase slipped nearly 1% but regained 1.5% post-bell.\n\nCleanSpark and Marathon took a beating, down 17.24% and 13.2%, respectively.\n\nStill, CleanSpark is the only miner to beat S&P 500 over the past month, now up 20% to the S&P’s 2%. The Las Vegas-headquartered firm announced plans to double its hashrate in February.\n\nOver the year-to-date, CleanSpark’s 52% gains are second only to MicroStrategy, now up 147%. Coinbase trails slightly with 48.3%.\n\nCleanSpark, now the second-largest mining stock by market value, flipped Colorado-headquartered Riot earlier this month, worth $3.34 billion to $2.98 billion.\n\nFormer MicroStrategy CEO Michael Saylor has sold $167.4 million in MSTR shares this year, per OpenInsider.\n\nSaylor sold those shares for $688.29 on average, MSTR currently trades for more than double that price.\n\nHe announced a plan to sell 315,000 shares in January — he’s more than three-quarters of the way through that stack.\n\nOn the ground\n\nLoading Tweet.. We never stood a chance\n\nLoading Tweet.. Prometheum is bleeding cash\n\nLoading Tweet.. Analysts in disbelief\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    }
]