[
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMi4wFBVV95cUxNZXdjcUZiWUtBZFJIQ1p4b0FfdGZaeFl1Y09lU2V2Z21rS3I0WkxRQlcyTE4zQ09VTGNDa3hPaVNyUS12WWpsTmRIem5ESmpDS0xtUW4yU3VLYjIwYUpSajlNRHFMU3NUQ0JONU1UZDR4Ym8xdlh3S0kyeHJHOVdRNXJtTkFHYkZlemk0RzVWVUFUOURqS25vMnJTXzk5cUxCdlBoVFlQSDZEUEw1bnRjdXJ6VE1nd0gtTE1aNlJjSjlPRzZpLVYxSDBsMWQxYkFSVlJKRVVuNDFtMDVSdmxZWjJ1QQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 May 2024 07:00:00 GMT",
        "title": "Ethereum Under Siege: Most Attacked Blockchain In 2024 Suffers 43% Of May's Crypto Losses - Benzinga",
        "content": "Ethereum ETH/USD was the most targeted blockchain by hackers and fraudsters in May, constituting nearly 43% of the total losses.\n\nWhat Happened: The world's largest network for decentralized apps and services suffered the most individual attacks, totaling 9, in the month, according to a report released by Web3 security firm Immunefi.\n\nThe second on the list was BNB Chain BNB/USD with 4 incidents. Together, Ethereum and BNB Chain accounted for a massive 62% of the total losses across major chains.\n\nAmong the most sensational of Ethereum losses was the $21 million exploit on the Web3 game Gala Games GALA/USD.\n\nOverall, total cryptocurrency losses to hacks and rug pulls dropped 20% this year compared with the same period in 2023. Additionally, losses in May declined 28% month-over-month.\n\nWhy It Matters: Ethereum was the most targeted chain last month, and also during the first quarter.\n\nWith a vast array of decentralized finance projects, the network has been vulnerable to attacks from bad actors. It is the largest DeFi chain, with upwards of $64 billion in deposits as of this writing, according to DeFiLlama.\n\nThe Immunefi report specifically underlined that DeFi projects were the main target of exploiters, representing 100% of all the losses.\n\nPrice Action: At the time of writing, ETH was trading at $3,743.49, marginally down 0.38% in the last 24 hours, according to data from Benzinga Pro.\n\nRead Next: Ripple CEO Brad Garlinghouse Foresees XRP, Solana, Cardano ETFs Amid Bitcoin, Ethereum Approvals\n\nPhoto by DrawKit Illustrations on Unsplash"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTE51SUJiS181QmxQWWV5VWg5NXRWY1l2bE5VWklOVU9fYnJtTWR0Z25wMnItNW04SmxOeGVCQXRxUHV5RWE3MnlNRnI0OHNMRTNaRFMyWkFJb1phTFhYQ3ZYdlVwMUVkNkdvTzZtZm9jenZPOGFK?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 May 2024 07:00:00 GMT",
        "title": "Why Bitcoin (BTC)'s $1.3T Market Cap and Ethereum (ETH)'s Innovations Make Furrever Token a Must-Watch - Yahoo Finance",
        "content": "Furrever Token\n\nNew York, NY, May 31, 2024 (GLOBE NEWSWIRE) -- The cryptocurrency market is in a dynamic phase, with Bitcoin and Ethereum at the forefront of innovation and growth. Bitcoin's market cap has surged to an impressive $1.3 trillion, reinforcing its status as the digital gold standard. Ethereum, meanwhile, continues to drive blockchain advancements with its robust smart contract capabilities and the upcoming Ethereum 2.0 upgrade aimed at improving scalability and reducing transaction costs. Amidst these giants, Furrever Token (FURR) is carving out its own niche, offering unique appeal and significant growth potential.\n\nBitcoin's $1.3T Market Cap: The Digital Gold Standard\n\nBitcoin, the first and most prominent cryptocurrency, has reached a market cap of $1.3 trillion, nearing the value of silver. This milestone reinforces Bitcoin's position as a digital store of value, often likened to gold. Bitcoin's growth is driven by increasing institutional investment, mainstream adoption, and its finite supply of 21 million coins. Its decentralized nature and robust security through proof-of-work consensus make it a reliable asset. As more companies and financial institutions integrate Bitcoin, its influence on the broader cryptocurrency market grows, driving interest and investment in alternative cryptocurrencies.\n\nEthereum's Innovations: The Backbone of Decentralized Finance\n\nEthereum remains a cornerstone of the crypto ecosystem due to its versatile blockchain, which supports a myriad of decentralized applications (dApps) and smart contracts. The recent statements from Vanguard, a $7 trillion company, highlight Ethereum's potential and limitations. Although Vanguard has no immediate plans to support Ethereum ETFs, the blockchain's ongoing upgrades aim to address scalability issues and enhance transaction efficiency. The upcoming Ethereum 2.0 upgrade, transitioning from Proof of Work (PoW) to Proof of Stake (PoS), is expected to significantly improve transaction speeds and reduce fees. This evolution is crucial as Ethereum powers a substantial portion of the DeFi (Decentralized Finance) space, making it indispensable for developers and investors alike.\n\n\n\n\n\nFurrever Token: A Unique and Promising Contender\n\nAmidst the well-established Bitcoin and Ethereum, Furrever Token (FURR) is emerging as a unique player with its charming and engaging approach. Designed to bring a refreshing dose of cuteness and community engagement to the crypto space, Furrever Token stands out with its whimsical approach. The token integrates adorable cat-themed stickers, emojis, and visuals, fostering a warm and friendly community.\n\nStrategic Tokenomics and Growth Potential\n\nFurrever Token's tokenomics are structured to ensure long-term growth. With 9 billion tokens in total, 65% are allocated for presale, 25% for decentralized exchanges (DEXs), and 10% for the team, which will be locked for a year. This strategic allocation aims to provide liquidity while ensuring the team is committed to the project's longevity.\n\nThe presale has already raised over $1.1 million, and with the current price at $0.000648, there is an expectancy of up to 15X returns for early investors. The upcoming launch on PancakeSwap is generating significant excitement and FOMO (Fear of Missing Out), making Furrever Token an attractive investment opportunity.\n\nWhy Furrever Token is a Must-Watch\n\nUnique Appeal: Furrever Token's whimsical approach with cat-themed visuals and community engagement stands out in the crypto market. Strong Community: A growing and active community on platforms like Telegram ensures continuous engagement and organic growth. Significant Growth Potential: With a presale price of $0.000648 and potential for substantial returns, Furrever Token offers an enticing opportunity for investors. Upcoming Launch: The planned launch on PancakeSwap and future exclusive content create a sense of anticipation and excitement.\n\nConclusion\n\nBitcoin's impressive market cap and Ethereum's ongoing innovations underscore the dynamism of the cryptocurrency market. Amid these developments, Furrever Token presents a unique and promising investment opportunity. Its engaging approach, robust community, and potential for high returns make it a must-watch for investors looking to diversify their portfolios. As Bitcoin continues to dominate and Ethereum drives innovation, Furrever Token offers a delightful and potentially lucrative alternative. Visit furrevertoken.com to learn more and invest today.\n\n\n\nJoin Furrever Token Presale Now:\n\nFurrever Token Official Website\n\nVisit Furrever Token Presale\n\nJoin Official Telegram Group\n\nFollow Official X Account\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\nCONTACT: Media Contact: Robert Smith https://furrevertoken.com/ support(at)furrevertoken.com\n\n\n\n"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTE51SUJiS181QmxQWWV5VWg5NXRWY1l2bE5VWklOVU9fYnJtTWR0Z25wMnItNW04SmxOeGVCQXRxUHV5RWE3MnlNRnI0OHNMRTNaRFMyWkFJb1phTFhYQ3ZYdlVwMUVkNkdvTzZtZm9jenZPOGFK?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 May 2024 07:00:00 GMT",
        "title": "Why Bitcoin (BTC)'s $1.3T Market Cap and Ethereum (ETH)'s Innovations Make Furrever Token a Must-Watch - Yahoo Finance",
        "content": "Furrever Token\n\nNew York, NY, May 31, 2024 (GLOBE NEWSWIRE) -- The cryptocurrency market is in a dynamic phase, with Bitcoin and Ethereum at the forefront of innovation and growth. Bitcoin's market cap has surged to an impressive $1.3 trillion, reinforcing its status as the digital gold standard. Ethereum, meanwhile, continues to drive blockchain advancements with its robust smart contract capabilities and the upcoming Ethereum 2.0 upgrade aimed at improving scalability and reducing transaction costs. Amidst these giants, Furrever Token (FURR) is carving out its own niche, offering unique appeal and significant growth potential.\n\nBitcoin's $1.3T Market Cap: The Digital Gold Standard\n\nBitcoin, the first and most prominent cryptocurrency, has reached a market cap of $1.3 trillion, nearing the value of silver. This milestone reinforces Bitcoin's position as a digital store of value, often likened to gold. Bitcoin's growth is driven by increasing institutional investment, mainstream adoption, and its finite supply of 21 million coins. Its decentralized nature and robust security through proof-of-work consensus make it a reliable asset. As more companies and financial institutions integrate Bitcoin, its influence on the broader cryptocurrency market grows, driving interest and investment in alternative cryptocurrencies.\n\nEthereum's Innovations: The Backbone of Decentralized Finance\n\nEthereum remains a cornerstone of the crypto ecosystem due to its versatile blockchain, which supports a myriad of decentralized applications (dApps) and smart contracts. The recent statements from Vanguard, a $7 trillion company, highlight Ethereum's potential and limitations. Although Vanguard has no immediate plans to support Ethereum ETFs, the blockchain's ongoing upgrades aim to address scalability issues and enhance transaction efficiency. The upcoming Ethereum 2.0 upgrade, transitioning from Proof of Work (PoW) to Proof of Stake (PoS), is expected to significantly improve transaction speeds and reduce fees. This evolution is crucial as Ethereum powers a substantial portion of the DeFi (Decentralized Finance) space, making it indispensable for developers and investors alike.\n\n\n\n\n\nFurrever Token: A Unique and Promising Contender\n\nAmidst the well-established Bitcoin and Ethereum, Furrever Token (FURR) is emerging as a unique player with its charming and engaging approach. Designed to bring a refreshing dose of cuteness and community engagement to the crypto space, Furrever Token stands out with its whimsical approach. The token integrates adorable cat-themed stickers, emojis, and visuals, fostering a warm and friendly community.\n\nStrategic Tokenomics and Growth Potential\n\nFurrever Token's tokenomics are structured to ensure long-term growth. With 9 billion tokens in total, 65% are allocated for presale, 25% for decentralized exchanges (DEXs), and 10% for the team, which will be locked for a year. This strategic allocation aims to provide liquidity while ensuring the team is committed to the project's longevity.\n\nThe presale has already raised over $1.1 million, and with the current price at $0.000648, there is an expectancy of up to 15X returns for early investors. The upcoming launch on PancakeSwap is generating significant excitement and FOMO (Fear of Missing Out), making Furrever Token an attractive investment opportunity.\n\nWhy Furrever Token is a Must-Watch\n\nUnique Appeal: Furrever Token's whimsical approach with cat-themed visuals and community engagement stands out in the crypto market. Strong Community: A growing and active community on platforms like Telegram ensures continuous engagement and organic growth. Significant Growth Potential: With a presale price of $0.000648 and potential for substantial returns, Furrever Token offers an enticing opportunity for investors. Upcoming Launch: The planned launch on PancakeSwap and future exclusive content create a sense of anticipation and excitement.\n\nConclusion\n\nBitcoin's impressive market cap and Ethereum's ongoing innovations underscore the dynamism of the cryptocurrency market. Amid these developments, Furrever Token presents a unique and promising investment opportunity. Its engaging approach, robust community, and potential for high returns make it a must-watch for investors looking to diversify their portfolios. As Bitcoin continues to dominate and Ethereum drives innovation, Furrever Token offers a delightful and potentially lucrative alternative. Visit furrevertoken.com to learn more and invest today.\n\n\n\nJoin Furrever Token Presale Now:\n\nFurrever Token Official Website\n\nVisit Furrever Token Presale\n\nJoin Official Telegram Group\n\nFollow Official X Account\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\nCONTACT: Media Contact: Robert Smith https://furrevertoken.com/ support(at)furrevertoken.com\n\n\n\n"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTFBoMzloaWFlcnZwR09aZ3VadmtrN0tIUEZ5ZTNKWVNDUVl1UHoySkJJZGpKZkRmSXM4SDVTZ0FsTnJGUW1hVWludGNSS3JTdXlNcU1Zd2Q5QWRNSUlFMUtVck9NQllVMzRMZEVBR2JxMUo?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 May 2024 07:00:00 GMT",
        "title": "EigenLayer raises the stakes for ethereum - Financial Times",
        "content": "Print this page\n\nThis article is an onsite version of our Cryptofinance newsletter. Premium subscribers can sign up here to get the newsletter delivered every week. Standard subscribers can upgrade to Premium here, or explore all FT newsletters\n\nHello and welcome to the FT Cryptofinance newsletter. This week we’re taking a look at a fast-growing new trend in decentralised finance.\n\nThe excitement over the arrival of stock market funds investing directly in cryptocurrencies this year has obscured the rapid changes taking place in the world of decentralised finance, or DeFi.\n\nThe hottest thing in the market at the moment is the emergence of EigenLayer, a new network that lets holders of the ether cryptocurrency simultaneously lend out the same coin multiple times.\n\nUnderscoring its appeal, its Seattle-based parent company Eigen Labs in February raised $100mn from Andreessen Horowitz’s a16z, one of the most influential crypto venture capitalists.\n\nThe concept behind EigenLayer is “restaking”, a new concept for the crypto market. At present holders of ether can earn interest, in the form of more tokens, if they deposit or “stake” their ether on ethereum, allowing the system to secure and validate transactions on the blockchain.\n\nThey earn a reward for it but that keeps their coins locked up and immobile. EigenLayer takes the staked ether and allows it to be reused in other applications that are also built on ethereum — earning them further yield in the process.\n\nIt may well sound familiar. That’s because, fundamentally, it is rehypothecation, or the practice of lending the same asset over and over again. It’s something global financial regulators have clamped down on since the 2008 collapse of Lehman Brothers, when it emerged that the US bank had used collateral posted by clients to help fund its own trades. It took years for customers to be reunited with their assets.\n\nIn the world of crypto, this vice is turned into a virtue. Other services such as Lido Finance also rehypothecate assets but hand out tokens that represent the value of the staked ether.\n\nThe twist with EigenLayer is that it is trying to extend the security that underpins the ethereum network to other applications that are also being built on ethereum. EigenLayer sits in the middle, connecting people who want to use their staked tokens to lend with new applications that are being built. EigenLayer uses automated algorithms and smart contracts to manage the process.\n\nThe advantage of EigenLayer is that, at least in theory, it solves a major issue for the ethereum network. Every application built on ethereum has to sort out its own security with its own validation, and that makes it a highly inefficient, fragmented and costly system that is difficult to scale. EigenLayer can help the network grow by piggybacking on the complex and effective system that validates it.\n\nFrom a standing start in December there are now just under 5mn ether coins, valued at $18.6bn, locked up in EigenLayer, according to data provider DefiLlama. That makes it the second-largest application in the DeFi market, between longtime players Lido on $36bn and AAVE on $13bn.\n\nBut in a research paper this week, Carol Alexander, professor of finance at the University of Sussex in the UK, argued that restaking was creating a major, new risk in the market.\n\nShe said the $18.6bn figure was “vastly overestimated” because some of the numbers had been counted multiple times. The true figure backing the activity is closer to two-thirds of that, she thinks.\n\nThat matters because, she said, each new application needs to rely on highly leveraged tokens backed by very little in a thin market.\n\nThe EigenLayer system is designed to punish bad actors such as hackers by confiscating a portion of staked tokens or deposits as a penalty. It relies on algorithms that unilaterally decide when malicious activity is happening.\n\nThat leaves the leveraged staking market exposed if there are deliberate attacks to steal funds, if prices are manipulated or if lenders simply have poorly coded algorithms, light borrowing standards or poor risk controls. And all built on an IOU of ether, she says.\n\n“Because the vast majority of staking is on ethereum, any stress events . . . have the potential to spread credit contagion throughout the DeFi ecosystem, and this could precipitate another DeFi winter,” she concluded.\n\nAlready the multiplication of layers is dizzying. Applications such as Renzo restake staked ether tokens on EigenLayer — and mint another token to represent that transaction. Applications such as Renzo “are taking on a very large credit risk”, Alexander warned.\n\nThat could lead to a cascade of liquidations in the market and tokens could depeg from other tokens whose value they are supposed to track, she said.\n\nIt has happened before. The collapse of the terra stablecoin, which triggered the crypto market crash of 2022, began with staked ether tokens in the DeFi market and spread because bigger traders and lenders were interlinked with other markets.\n\nHowever some have argued that introducing layers of applications on top of staked ether is “financialisation” of the ethereum network.\n\nEither it can be a protocol for open innovation, more akin to a commodity, or it can be an investable asset that will deliver a yield for investors, said the head of research at one staking service who declined to be identified.\n\n“It’s not really possible for them to do both. If you optimise ether as the financial asset . . . you’re encouraging the creation of this kind of layers and going further out in the risk curve to maximise yield.”\n\n\n\nYet market demand is potentially pushing ether and ethereum towards it being an investable asset, just when US lawmakers and financial regulators are leaning towards ether being a commodity.\n\nIf the Commodity Futures Trading Commission becomes the main US regulator for crypto as expected, then the agency may find itself going down a very deep rabbit hole when piecing together the aftermath of the next market crash.\n\nWhat’s your take? Email me at philip.stafford@ft.com\n\nWeekly highlights\n\nFormer FTX senior executive Ryan Salame was sentenced to more than seven years in prison after pleading guilty last year to election fraud charges and conspiring to operate an unlicensed money-transmitting business while at Sam Bankman-Fried’s failed cryptocurrency exchange.\n\nBlackRock’s IBIT became the world’s largest bitcoin exchange traded fund even though it only launched in January. Its holdings of just under 300,000 bitcoin pipped those of Grayscale, even though its rival held more than 619,000 at the start of the year.\n\nUsers of Gemini’s Earn lending programme will get nearly $2bn of their crypto that was stuck at Genesis, following the digital asset trader’s bankruptcy in January 2023.\n\nSoundbite of the week:\n\nElon Musk dismissed stories that he had talked to Donald Trump about digital assets. He wrote on his X social media site:\n\n“Pretty sure I’ve never discussed crypto with Trump, although I am generally in favor of things that shift power from government to the people, which crypto can do.”\n\nData mining: the rise of ethena\n\nAmong the signs of soaring optimism in DeFi is the emergence of a stablecoin called ethena. It is pegged to the ether cryptocurrency rather than the US dollar, and offers buyers a yield of 36 per cent. From nothing in January, it is now the world’s fourth-largest stablecoin with nearly $3bn in circulation. Its backers argue that it is fully decentralised — pegged to the price of ether so there are no deposited assets sitting in a bank. Instead it uses derivatives to keep the value in balance. This week it overtook First Digital USD, which has $5.29 in circulation and now sits behind Dai, which has $5.3bn in circulation.\n\nCryptofinance is edited by Laurence Fletcher. To view previous editions of the newsletter click here.\n\nYour comments are welcome."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTFBoMzloaWFlcnZwR09aZ3VadmtrN0tIUEZ5ZTNKWVNDUVl1UHoySkJJZGpKZkRmSXM4SDVTZ0FsTnJGUW1hVWludGNSS3JTdXlNcU1Zd2Q5QWRNSUlFMUtVck9NQllVMzRMZEVBR2JxMUo?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 May 2024 07:00:00 GMT",
        "title": "EigenLayer raises the stakes for ethereum - Financial Times",
        "content": "Print this page\n\nThis article is an onsite version of our Cryptofinance newsletter. Premium subscribers can sign up here to get the newsletter delivered every week. Standard subscribers can upgrade to Premium here, or explore all FT newsletters\n\nHello and welcome to the FT Cryptofinance newsletter. This week we’re taking a look at a fast-growing new trend in decentralised finance.\n\nThe excitement over the arrival of stock market funds investing directly in cryptocurrencies this year has obscured the rapid changes taking place in the world of decentralised finance, or DeFi.\n\nThe hottest thing in the market at the moment is the emergence of EigenLayer, a new network that lets holders of the ether cryptocurrency simultaneously lend out the same coin multiple times.\n\nUnderscoring its appeal, its Seattle-based parent company Eigen Labs in February raised $100mn from Andreessen Horowitz’s a16z, one of the most influential crypto venture capitalists.\n\nThe concept behind EigenLayer is “restaking”, a new concept for the crypto market. At present holders of ether can earn interest, in the form of more tokens, if they deposit or “stake” their ether on ethereum, allowing the system to secure and validate transactions on the blockchain.\n\nThey earn a reward for it but that keeps their coins locked up and immobile. EigenLayer takes the staked ether and allows it to be reused in other applications that are also built on ethereum — earning them further yield in the process.\n\nIt may well sound familiar. That’s because, fundamentally, it is rehypothecation, or the practice of lending the same asset over and over again. It’s something global financial regulators have clamped down on since the 2008 collapse of Lehman Brothers, when it emerged that the US bank had used collateral posted by clients to help fund its own trades. It took years for customers to be reunited with their assets.\n\nIn the world of crypto, this vice is turned into a virtue. Other services such as Lido Finance also rehypothecate assets but hand out tokens that represent the value of the staked ether.\n\nThe twist with EigenLayer is that it is trying to extend the security that underpins the ethereum network to other applications that are also being built on ethereum. EigenLayer sits in the middle, connecting people who want to use their staked tokens to lend with new applications that are being built. EigenLayer uses automated algorithms and smart contracts to manage the process.\n\nThe advantage of EigenLayer is that, at least in theory, it solves a major issue for the ethereum network. Every application built on ethereum has to sort out its own security with its own validation, and that makes it a highly inefficient, fragmented and costly system that is difficult to scale. EigenLayer can help the network grow by piggybacking on the complex and effective system that validates it.\n\nFrom a standing start in December there are now just under 5mn ether coins, valued at $18.6bn, locked up in EigenLayer, according to data provider DefiLlama. That makes it the second-largest application in the DeFi market, between longtime players Lido on $36bn and AAVE on $13bn.\n\nBut in a research paper this week, Carol Alexander, professor of finance at the University of Sussex in the UK, argued that restaking was creating a major, new risk in the market.\n\nShe said the $18.6bn figure was “vastly overestimated” because some of the numbers had been counted multiple times. The true figure backing the activity is closer to two-thirds of that, she thinks.\n\nThat matters because, she said, each new application needs to rely on highly leveraged tokens backed by very little in a thin market.\n\nThe EigenLayer system is designed to punish bad actors such as hackers by confiscating a portion of staked tokens or deposits as a penalty. It relies on algorithms that unilaterally decide when malicious activity is happening.\n\nThat leaves the leveraged staking market exposed if there are deliberate attacks to steal funds, if prices are manipulated or if lenders simply have poorly coded algorithms, light borrowing standards or poor risk controls. And all built on an IOU of ether, she says.\n\n“Because the vast majority of staking is on ethereum, any stress events . . . have the potential to spread credit contagion throughout the DeFi ecosystem, and this could precipitate another DeFi winter,” she concluded.\n\nAlready the multiplication of layers is dizzying. Applications such as Renzo restake staked ether tokens on EigenLayer — and mint another token to represent that transaction. Applications such as Renzo “are taking on a very large credit risk”, Alexander warned.\n\nThat could lead to a cascade of liquidations in the market and tokens could depeg from other tokens whose value they are supposed to track, she said.\n\nIt has happened before. The collapse of the terra stablecoin, which triggered the crypto market crash of 2022, began with staked ether tokens in the DeFi market and spread because bigger traders and lenders were interlinked with other markets.\n\nHowever some have argued that introducing layers of applications on top of staked ether is “financialisation” of the ethereum network.\n\nEither it can be a protocol for open innovation, more akin to a commodity, or it can be an investable asset that will deliver a yield for investors, said the head of research at one staking service who declined to be identified.\n\n“It’s not really possible for them to do both. If you optimise ether as the financial asset . . . you’re encouraging the creation of this kind of layers and going further out in the risk curve to maximise yield.”\n\n\n\nYet market demand is potentially pushing ether and ethereum towards it being an investable asset, just when US lawmakers and financial regulators are leaning towards ether being a commodity.\n\nIf the Commodity Futures Trading Commission becomes the main US regulator for crypto as expected, then the agency may find itself going down a very deep rabbit hole when piecing together the aftermath of the next market crash.\n\nWhat’s your take? Email me at philip.stafford@ft.com\n\nWeekly highlights\n\nFormer FTX senior executive Ryan Salame was sentenced to more than seven years in prison after pleading guilty last year to election fraud charges and conspiring to operate an unlicensed money-transmitting business while at Sam Bankman-Fried’s failed cryptocurrency exchange.\n\nBlackRock’s IBIT became the world’s largest bitcoin exchange traded fund even though it only launched in January. Its holdings of just under 300,000 bitcoin pipped those of Grayscale, even though its rival held more than 619,000 at the start of the year.\n\nUsers of Gemini’s Earn lending programme will get nearly $2bn of their crypto that was stuck at Genesis, following the digital asset trader’s bankruptcy in January 2023.\n\nSoundbite of the week:\n\nElon Musk dismissed stories that he had talked to Donald Trump about digital assets. He wrote on his X social media site:\n\n“Pretty sure I’ve never discussed crypto with Trump, although I am generally in favor of things that shift power from government to the people, which crypto can do.”\n\nData mining: the rise of ethena\n\nAmong the signs of soaring optimism in DeFi is the emergence of a stablecoin called ethena. It is pegged to the ether cryptocurrency rather than the US dollar, and offers buyers a yield of 36 per cent. From nothing in January, it is now the world’s fourth-largest stablecoin with nearly $3bn in circulation. Its backers argue that it is fully decentralised — pegged to the price of ether so there are no deposited assets sitting in a bank. Instead it uses derivatives to keep the value in balance. This week it overtook First Digital USD, which has $5.29 in circulation and now sits behind Dai, which has $5.3bn in circulation.\n\nCryptofinance is edited by Laurence Fletcher. To view previous editions of the newsletter click here.\n\nYour comments are welcome."
    }
]