[
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxPQ1ZqTzFtdFhXRGU2UGZkLUVLejlfNTlZN2VQVW1zWWJUeW5IeXlvM05rOEQ2UHM4Y3JMSTRja1kwVzZHLVE0azZXbmVZMnlfSXBLZ3BzdDZzaTk2QlhkbjFYTEc0WTdtM1I0cDB6ci1lb1BTOENXeHhRcGVoVVVHRUtIMmhQQk43bHlFaXlRLUtKaERDWEJYUE9aeVbSAaIBQVVfeXFMTnhoRy1OT2t2c0xqaHJxazQtSWlYa2E2dXY2RlljR1FHblVIMzV5UUJLdWJfdHRfbGJxaWpyeC1vR29PZGdaZWswZU5oVUZwNXVJNXQySTRlNHBmejFOOGlDb20tbFQ5YkZHOEx0enlFUGxnODQ5ZzFRaTRTZmNQdjdRM3pET215ZGMzTk5tanRsUXhNMzFMRVc3RUlMWmZyUl9B?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 May 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Price to Reach $10,000 by the End of 2024? Analyst Weighs In - CryptoPotato",
        "content": "TL;DR\n\nEthereum’s price recently surpassed $3,000, with analysts predicting further significant gains.\n\nDeclining MVRV ratio, negative exchange netflow, and potential approval of a spot Ethereum ETF in the US could drive ETH’s value higher.\n\nIs ETH Gearing up for an ATH?\n\nThe cryptocurrency market has experienced a significant uptrend in the past few days, with numerous digital assets rising to multi-week highs. Although not witnessing such a substantial increase, Ethereum (ETH) is also among the notable gainers.\n\nIts price surpassed the $3,000 mark, representing a 4% increase on a daily scale. Numerous analysts believe this could be the starting point of a bull run that can take place in the near future.\n\nThe X user Michael van de Poppe is among the optimists. He claimed recently that ETH is on its way to reaching a higher timeframe support level. “The good times are there in a few weeks’ time,” he assumed.\n\nCryptoYoddha was even more bullish, envisioning a price explosion toward the $10,000 milestone by the end of the year.\n\nLast but not least, World of Charts argued that ETH has started breaking the “falling wedge consolidation” on a 12-hour timeframe. “Trend is already up and expecting continuation towards $4500 in coming weeks,” the analyst forecasted.\n\nObserving Some Important Factors\n\nOne element signaling that ETH’s value could be on the verge of a rally is the Market Value to Realized Value (MVRV). It helps to identify if the asset is overvalued or undervalued. A high ratio suggests a market top, while a low one may indicate a good buying opportunity. The MVRV has been on a significant downfall since mid-March.\n\nAnother factor is ETH’s exchange netflow, which has been predominantly negative in the past month (according to CryptoQuant’s data). Shifting from centralized platforms towards self-custody methods is considered bullish since it reduces the immediate selling pressure.\n\nLast but not least, ETH’s price may head north in case of the approval of a spot Ethereum ETF in the United States. However, such a green light may also lead to the same immediate “sell-the-news” event witnessed after the BTC ETF approvals in January."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxPakFzOEhEU2g2REMtc1dzQkdMRnN3MTcyUjdPNE43ZXZ5b1JjckhFdnN4QmNLUHNXS0N6WW8taFkxVV9rTTc2Z0VLR2VMYUNSV01YbW13b2IwRHZOZlRJU1QxRFRaS3lLQjF4M2djNkFYNTQyVGJIbTVoRDJuSlg3RkFTclQtVGNTZGl6QVlKUHZxOGQ0b3g3ZUNrS3RZWktLN0Vzdi0zVFhuSENzR3QyUk9KWTJ3T0twSDZibTdVempib1NlX3lfTUlXZkJtT18yaURNd2p30gHbAUFVX3lxTE9RR0JCelQ5b2xtWGVqS1Vtd2hkNnh6REFReXZlUHdjcElDcnQ0Sll0c0VYenpTWVVOTzF5WVNVeVp1NmFKSkFSbERUdXIxTHZlMUlhOVRSTVFyOHJWZkVtZTd4eHhidFM0QlJPUWxoaGszaFd5d2FHN21paElITjQyUkkyczZ2aFRDWHQzNkRtSWJqaUxIR1VXSVlQbktYSWNxU2tSeG1WejB5TzV6TzMwSGFTNk1seHhibk5zTHBJbElLSU4yY0pxUF9qcFR1WnkzWjF6aUtma2FHSQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 May 2024 07:00:00 GMT",
        "title": "Crypto Analyst Says Ethereum Competitor To Rip Higher, Predicts Outlook on Dogecoin and One More ETH Rival - The Daily Hodl",
        "content": "A closely followed crypto analyst predicts one Ethereum (ETH) competitor is about to have a massive breakout against Bitcoin (BTC).\n\nPseudonymous trader Kaleo tells his 638,000 followers on the social media platform X that the smart contract platform Avalanche (AVAX) could soar against BTC by more than 84% from its current value.\n\n“AVAX/BTC: I might be crazy bros, but I still believe AVAX rips higher from here.”\n\nLooking at his chart, the analyst suggests that AVAX/BTC is printing a bullish flag pattern on the daily chart and could soon reach 0.000950 BTC ($62.13).\n\nAVAX/BTC is trading for .000515 BTC ($33.89) at time of writing, down more than 3% in the last 24 hours.\n\nNext, the analyst predicts ETH competitor Solana is about to soar against Bitcoin (SOL/BTC) after printing a bullish pattern on the daily chart of higher high prices and higher low prices.\n\nHe believes SOL/BTC could soon cross the 0.0032 BTC ($209) level.\n\n“SOL/BTC: Solana is still one of the biggest no brainer long plays out there. Don’t fight strength.”\n\nSOL/BTC is trading for 0.00243 BTC ($160) at time of writing, up more than 3% in the last 24 hours.\n\nLastly, the analyst predicts that Dogecoin (DOGE) will breakout based on a 2021 pattern when the memecoin rallied after the soaring meme stock GameStop (GME) hit a market top. GME had a massive rally this week but has since retraced.\n\n“I’m going to make this simple for you. Here’s a chart of Dogecoin versus GME. You may not remember this, but it was GameStop that led the way back in early 2021. It wasn’t until after it topped that DOGE started sending. Dogecoin is overdue for a good pump. It’s almost time.”\n\nDOGE is trading for $0.15 at time of writing, up slightly in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/your/dTosh"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxQSkdJZHV5clpmN0ZJbHNDWjNoWWFPdXA2aFhBbkU0T05Oc3E3NDJELUQ4WFBJTG1IV1dHWEc3Nll1Zzg4dUQ4R1ZiNlIwcGp1azlmMktEdjNjNEx0QkZPTFZ0R1FramR6bGFCY3NrU2g1RWctNllqa0NJdURTbXpYaVVSVFVMbU93QTRCQ2UyaUhIQjZJU0loUmZFaWVYdkZVMmhUTll5SXZNVFFDbjBfOHpwckhJWkJ3eFd0a2ZSeUtrWXAwY2M00gHMAUFVX3lxTE1HSUVWUy1aTEs1VlpZbzMzVlc4NXAxTXl2OThVTnNNWExtSlFIX3gwbVFhc2g1SkdqWkNDWDRsdkMzVXRaaFB5Z2swa2JqMlpnejVXSmQwVS1xWVJmNG5GRXhWUDAtUWJGdC01eHotbjFJWVBWX2ZwWWZWSnQ0YjhlQW1IdFB3U2lMUGREX0lLdkV6YTRKaWZLV0VoUkRlZHp1MmhmNHhPeFRTcEQxZWZCMXNpWmVTakV4cENPa3k3bzVtbkZnNlFaVUwtRw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 May 2024 07:00:00 GMT",
        "title": "Billionaire Mike Novogratz Says New ‘Market Events’ To Propel Bitcoin, Ethereum and Solana Higher - The Daily Hodl",
        "content": "Galaxy Digital CEO Mike Novogratz is predicting that new “market events” will propel Bitcoin (BTC) and other crypto assets to the next leg up.\n\nIn Galaxy Digital’s Q1 earnings call, the billionaire says that a break out for Bitcoin, Solana (SOL), Ethereum (ETH) and other digital assets could still be a few months away, following a period of sideways trading.\n\nHe says Bitcoin could trade in a range of $55,000 and $75,000 until the upcoming US presidential election in November provides clarity on crypto regulations or the Federal Reserve cuts interest rates, which he believes could send crypto higher.\n\n“Listen, we had a lot of tailwinds in Q4 and Q1 – the adoption of the [Bitcoin exchange-traded funds] by far the biggest. That was the giant wake-up call that this is now an institutional asset. We also had the halving that we’ve now put in the rearview mirror. There was also a view that the Fed would bring rates down significantly this year and that view has changed. It’s changed in the market; it’s changed here in Galaxy and so I think we’re at a consolidation phase in crypto.\n\nBitcoin, Ethereum and everything else, Solana, will consolidate. What does that mean? It means [Bitcoin trades] probably somewhere between $55,000 and $75,000 until the next set of circumstances, the next set of market events brings us higher…\n\nI think that’s probably where we are certainly for this quarter, maybe next quarter until either (a) the Fed starts cutting rates because the economy finally slows or (b) we get through the election and I think the election will bring clarity, one way or the other, to the crypto regulatory landscape.”\n\nBitcoin is trading for $65,884 at time of writing, up nearly 7% in the last 24 hours. Meanwhile, Ethereum is trading for $3,019 at time of writing, up 4.4% on the day and Solana is trading for $155 at time of writing, up 8.6% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxNMnh5VEg0SGFaaEIzUXAybFpaUlN2SkdLNGRvM1FPcmlvQ29tTF84Z29LbEN2X2ZQang1Q1BZUTNZbEItTVozZkpfeC00cGwyenk5ZmVqU2xnR2d2U0VjRHJRT1pTZm4wQTdmLTcyVTNPeVpzUFBWRlUzaW1LQzUyNmNSRExDdy1rd3NZaWx1LWpBZ2JxTW1adU1NdGVtM3paWEFVNjFvUVpZWUpE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 May 2024 07:00:00 GMT",
        "title": "MIT grads’ $25 million crypto crime puts spotlight on Ethereum front-running - Fortune",
        "content": "If you graduate from the Massachusetts Institute of Technology with elite computer skills, you can make great money working for a tech company—or even more money working on Wall Street. But if that doesn’t grab you, and you want to get even richer, you can always try your hand at white-collar crime like twentysomething brothers Anton and James Peraire-Bueno. The pair came up with a scheme that let them pocket $25 million in just 12 seconds. Unfortunately, it ended badly, as the feds announced yesterday in a press release that reads like a pulp novel.\n\n“Unfortunately for the defendants, their alleged crimes were no match for Department of Justice prosecutors and IRS agents,” wrote the DOJ. For good measure, the release quotes an agent who declares the crime was solved “with cutting-edge technology and good-ole-fashioned investigative work.”\n\nPurple prose aside, the case involves some impressive detective work as well as a sophisticated explanation by Justice Department lawyers of a new type of alleged crime involving the Ethereum blockchain. The crime involves the arcane business of “Maximum Extractable Value,” or MEV, which entails packaging transactions in a block in a way that allows those who construct the blockchain to profit from others’ transactions.\n\nThe miners who build blockchains do not, of course, do this out of the goodness of their hearts. Instead, the process relies on incentives that allow miners—in the case of Bitcoin, Ethereum, and other chains—to obtain a reward in the form of both coins and transaction fees for adding a new block. When Ethereum switched to a new blockchain construction process known as proof-of-stake, however, it created new opportunities for miners to make money—including by front-running trades included in the blocks they package. This is what people mean by MEV. (Bitcoin investment firm River, as well as the DOJ’s criminal indictment, has a good explanation of how exactly it works).\n\nMEV has been around for a while now, and while a number of people in crypto find it distasteful, it is not illegal—and indeed, similar things go on in the world of traditional finance such as the practice known as payment for order flow. The Peraire-Bueno brothers, however, took things a step further when they detected a bug in a popular piece of software used to carry out MEV. This allowed them not to simply front-run Ethereum users’ transactions, but to tamper with them in a way that allowed them to outright rob them.\n\nAll of this is likely to draw new scrutiny of the murky practice of MEV, and potentially lead to calls for reform among the Ethereum crowd. As for the Peraire-Bueno, the episode also showed that people with MIT degrees are also capable of old-fashioned stupidity. Not only did they get caught, but the DOJ also found evidence they conducted web searches about things like money laundering and how to get away with financial fraud. Don’t Google your crimes, people! Finally, the brothers can at least take comfort that they are not the only MIT grads to be charged with crypto crimes—the school is also the alma mater of a certain Sam Bankman-Fried.\n\nJeff John Roberts\n\njeff.roberts@fortune.com\n\n@jeffjohnroberts\n\nDECENTRALIZED NEWS\n\nThe government of El Salvador has mined 474 Bitcoins in the last three years via volcano-powered rigs, contributing to the country's overall holding of 5,575. (Reuters)\n\nCircle is moving its legal base of operation from the U.S. to Ireland, a move that could increase the firm's tax bill. (Bloomberg)\n\nTornado Cash developer Alexey Pertsev is appealing his money laundering conviction. (CoinDesk)\n\nBitcoin jumped back above $65,000 partly in response to encouraging CPI data. (CNBC)\n\nCanadian authorities arrested a self-proclaimed “crypto king” who took $40 million from around 160 investors and blew most of it on travel and luxury cars—a decision that also led to him being kidnapped and tortured by those he scammed. (CoinDesk)\n\nMEME O’ THE MOMENT\n\nBitcoin wallet for sale:"
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxQa1hoVmJnVXNfZGNUVno3bXEwSW5ndjJmT0dnYXV5YkItWHVnZkhnb2lUU3dmdkJxNTNlOGk0MWZRM0NmT1ZfS1FiVWkydW5fOGVydUVlSkM0c0pfSDE2ejNkWXFuQTFRT2pKWEF0dnRwYkpDbHQzcUkwbDExLV9ObGlRNjLSAYwBQVVfeXFMTms3UXg2RlRpaUwwRHRhN09rbFhrM3ZGRTFxUlZYU2NWMVhIa0diMDJZdWdYLXd0U1o5TkxRQlFhSDJrdnpOWTBMQkFzdnFZSGh0VDlqYUpIcVhBUzF2aXN3emllcmxJaF81YzFaRnA4TDlIbVEtc0ZmUEpaQlpWSHdHaDg0NkJJYzkyWEg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 May 2024 07:00:00 GMT",
        "title": "Why Did DeGods Leave Solana for Ethereum? 'I Was Just Being a Pussy', Says Founder - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIn a candid tweet Thursday, DeGods and y00ts NFT project founder Rohun Vora (aka Frank DeGods) took a critical look at his previous decisions, especially those made during tumultuous times for the well-known collections. His reflection sheds light on the pressures of community expectations and being a founder.\n\n“I used to try to move mountains to appease the community in times of chaos,\" he began. \"Every single time it's backfired.\"\n\nThroughout the years as the leader of DeGods, he has made many decisions to try and please his holders and keep the buzz going. For example, the team went through many art changes, including a planned upgrade and self-proclaimed art “downgrade.” On Thursday, the team said that it would make no further art changes to DeGods.\n\nBut the biggest and most controversial move was bridging DeGods NFTs from Solana to Ethereum last year, along with y00ts from Solana to Ethereum sidechain network Polygon—though they then moved y00ts to the Ethereum mainnet and returned a $3 million grant from Polygon Labs.\n\nAD\n\nAD\n\ni used to try to move mountains to appease the community in times of chaos. every single time it's backfired. the truth is, on the internet you either stand by your conviction or you're a pussy. i've been a pussy in the past. like the bridge off SOL. everyone in the community… — Frank (33.3%) (@frankdegods) May 16, 2024\n\nMaking the decision to bridge the projects off of the Solana blockchain happened as the community was in a state of panic following the collapse of crypto exchange FTX in November 2022, which preceded Solana’s price collapsing to a low of about $8—roughly 97% from its 2021 peak.\n\nFrank, feeling the pressure, made the call to move the projects to the Ethereum ecosystem, which houses the most valuable NFT projects. He framed the move at the time as one designed to elevate DeGods into the big leagues of NFT culture.\n\n\"Like the bridge off SOL,” Frank wrote. “Everyone in the community was panicking (myself included) during FTX. I tried to fix their anxiety. In reality, I was just being a pussy.\"\n\nAD\n\nAD\n\nFrank contrasted his past actions with his current mindset, emphasizing the importance of standing by your convictions.\n\n\"The truth is, on the internet you either stand by your convictions or you're a pussy,\" he tweeted. Frank stressed that succumbing to short-term pressures and seeking immediate approval often backfires. It’s a lesson he learned by leading one of the most prominent NFT projects, and one that has faced considerable challenges—many self-inflicted, as he admitted.\n\nFrank recently announced the launch of an optional bridge back to Solana for both DeGods and y00ts. This move allows the community to decide whether to stay on Ethereum or return to Solana, reflecting his desire to provide flexibility and choice. There are no strong-armed incentives this time around. It's just an option.\n\n\"I said I want to allow our community to come back home and I meant it. I still do,” he wrote, though they launched the latest bridge with decidedly less fanfare than the original.\n\nDecrypt reached out to Frank for additional comment, but did not receive an immediate response.\n\nFrank’s tweet offers a raw and honest look at the challenges of leading an NFT project amid the constant demands of holders, particularly amid a diminished market for such assets. The bridge back to Solana and increasing openness about the past appear to be moves to atone for lingering regrets, all while the projects attempt to move forward.\n\nyou can now bridge your DeGods & y00ts between solana & ethereum. pic.twitter.com/EXCIwcvbY5 — de (@delabsxyz) May 1, 2024\n\nAD\n\nAD\n\nLooking forward, Frank expressed his belief in building a robust and resilient community, rather than one that constantly seeks validation through reactive measures.\n\n\"I believe that antifragility is the answer,” he wrote. “That's my conviction. Not just building the best community, but the strongest one.\"\n\nEdited by Andrew Hayward"
    }
]