[
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxOcUlHa3R5NTY5SW91WV9rczFiSVNFS1JHTHZjYnNjLVpmeU9rbFcwZXlnMlFjWFVhQjlTSU9iaHItUDQ1ejhuSkh5bDk1U2EtSUJkMzY1OUdCdldJVFdRN1NaR2x2aGRJTHo4YV9CV25uRWkzWE12VHRLNHRJZ3EwZ3dfNXNGQ01sLXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Dencun - The planned upgrade for March 2024! - Cointribune EN",
        "content": "Fri 09 Feb 2024 ▪ 3 min read ▪ by Eddy S.\n\nThe Ethereum Foundation recently announced the deployment date of the Dencun upgrade on the mainnet. Scheduled for March 13, 2024, this long-awaited hard fork will bring significant structural changes to the Ethereum network.\n\nEthereum, Technical Improvements Brought by Dencun\n\nTechnically, Dencun introduces several notable new features to the Ethereum blockchain:\n\nTransition to a proof of stake consensus to validate blocks, replacing energy-intensive mining with validators. This is a fundamental change in the protocol, ending the use of intensive computing power to secure the network in favor of a system based on holding ETH.\n\nTransaction fees significantly reduced, divided by 100 thanks to Dencun. The Ethereum network becomes much more affordable for end users and improves its competitiveness against competing blockchains.\n\nImproved scalability achieved through larger blocks and solutions like sharding. The goal is to support 100,000 transactions per second compared to only 15 currently. This increased capacity is crucial for Ethereum to meet growing demand.\n\nEnhanced security thanks to new EVMs and “proto-danksharding.” These technical changes will make smart contracts and transactions on Ethereum more robust against exploits.\n\nThese technical improvements prepare Ethereum to welcome many more users and decentralized applications. They significantly modernize the infrastructure to make it more efficient, secure, and scalable.\n\nThe Economic Impact of the Hard Fork\n\nBeyond its technical implications, Dencun will also have significant economic repercussions on Ethereum:\n\nEnd of new ETH issuance through mining, replaced by only 900 ETH created each day. This drastic reduction in the network’s native inflation strengthens the scarcity of Ethereum (ETH) and favors an increase in its price by eliminating mining sales.\n\nDestruction of transaction fees, made possible by the EIP-1559 mechanism. This mechanically reduces the total number of ETH in circulation when network activity is high. A positive deflationary impact.\n\nAnnounced end of the triple halving of issuance with each major fork. Dencun will be the last fork to divide the issuance by three. In the long term, ETH becomes increasingly scarce.\n\nStaking rewards encouraging Ethereum holders to participate in securing the network, with an estimated yield between 5 and 15%. A much less inflationary model than mining.\n\nWith its Dencun upgrade, Ethereum enters a new decisive technical and economic era on March 13, 2024. These fundamental changes position the blockchain as an ideal infrastructure for Web3 and decentralized finance, and the anticipated positive impact on the value of ETH also generates considerable interest from investors.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxPeWJ2Ry1GQWRYczVuWW11ZUNsZmdJZl9Md2EtWUVoeUZ2czBCdkQyNnVtcndSRlBHeHBZdnd5ZFlGUUNqRDhvV19FakEzNkRMR3hENS12Z2RMZEk3Vm5JNmFueU82czRqMXpVSVluRnJkNWh1ekdkeHk5ZU90XzdTa3dOZGMzdHd0SFdPUkNRaF8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Feb 2024 08:00:00 GMT",
        "title": "COTI leaps 55% following latest Ethereum MPC privacy innovation - CryptoSlate",
        "content": "COTI’s privacy-focused Ethereum L2 development reached a critical milestone by successfully integrating its Multi-Party Computation (MPC) protocol. Its token price surged approximately 55% following this technical achievement.\n\nMPC is a powerful cryptographic tool that allows several parties to work together on a computation using their private data without revealing that data to each other. COTI confirms that the successful implementation of the MPC protocol represents the first in a series of technical goals they will meet before COTI V2 is fully deployed.\n\nCOTI V2 architecture and MPC integration.\n\nCOTI V2 architecture hinges on MPC technology, ensuring the privacy of its Layer 2 computations on Ethereum over private inputs executed without compromising data confidentiality. Participants supply encrypted data to an MPC’ black box’, which executes specific computational processes. MPC results are delivered in a way that safeguards data integrity throughout, even amidst potential external scrutiny. Each MPC entity, dubbed an “MPC endpoint,” will later integrate into the project’s custom Extended-EVM execution module.\n\nMPC endpoints facilitate collaborative computation without sacrificing data privacy. This advancement significantly improves EVM functionality, unlocking support for more diverse dApps within a framework offering transparency alongside essential privacy capabilities. This integrated MPC architecture provides greater privacy and security for complex computations on-chain, potentially fueling wider adoption of Ethereum technology as use cases expand.\n\nTo facilitate MPC use, users first establish cryptographic key material. Next, data is submitted in encrypted form for safe storage. Users then submit workloads in secure MPC bytecode, with operations like addition and multiplication taking place on confidential data without exposing those original values. Workloads can generate public outputs or outputs specifically encrypted to remain accessible only to chosen users.\n\nTesting and future plan.\n\nPer COTI, a simulated state was tested within MPC modules as they collaboratively generated a ‘garbled circuit.’ This cryptographic concept represents a specific computational function and has inherent security, being inherently single-use. This provides forward and backward secrecy through design.\n\nThis first development milestone includes completing the protocol, including design and algorithms. Importantly, COTI developers demonstrated the capability to securely input and output data using distributed keys, enabling advanced encryption and decryption functions without compromise.\n\nThe achievement of this privacy-focused landmark emphasizes the progress towards COTI’s ambitious Layer 2 solution. A COTI blog post states,\n\n“The creation and implementation of a secure MPC protocol is the first of many development milestones we’ll reach throughout the year. Stay tuned for further COTI V2 updates as development continues.”\n\nMentioned in this article"
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMi9wFBVV95cUxPQWRZaW1MdHBkVjJHeU9oUWZTM1JDM0l6R2dITEMzVUcyaFlBZFFzMEhNbm9BYm10MVhGNkpobEg3cHFITnczVlY1aFdZOUdMZERsSVh4UXdVRzBpMWFub3VpSXRWMmNDQTI5dXBZQ3dmRUJkaHBzb0Qxd29mS1g1SjhGZC1WcktNT2dkWlRQN2d4RXlMbDhnM05Za1RERFBIWjJDaHhRY2NMVDF3dVF2VjhhVXc2OEV0QzgydXROemtzanFQbEptTDYxTFM4Q0cxMldOY2VydWZROTBlY2RYeGZTMHd6ZVV0Rm8ycHBDenBBT3JvcW5B0gH8AUFVX3lxTE5YODRQZ3JiRXp6a1RUa2F4bTV2Sm9HRWtna2dSSFY2Tkw0cDJ1NXF0b2E1NDlUT1pEWWRHbmhvTk9CUGZVY21kcVBDeWY4WTFvbVc5S1JoR3ZQSmNFcHE0MU9tM2pjMk1zdlBpdTJWd3VyNXRtQ3c5Q2NIYXNXTGNvUlBKcGc4TWJYMnV4ZVY0cjFFQ01uOG5IdkJBaExrQi1KRW9jMko4cHRUeWZxaW9vVm56dWdrbUhoRzY4Q0pibFBxVTNfMk1FMkU4cWY4UHRldGt3dHdnSWV1QWh4VllXYzVrVHhOTzFEUHE0YmdqanZoZUh4UlUwYzh4UQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Feb 2024 08:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: BTC eyes $48,000 with Chinese Lunar New Year of the Dragon - FXStreet",
        "content": "Bitcoin price could hit $48,000 this weekend if BTC decisively closes above $45,451 mean threshold.\n\nEthereum price could reclaim $2,717 range high as ETH leads altcoin’s revival recourse.\n\nXRP could reclaim $0.5500 as Ripple price breaches midline of the descending parallel channel.\n\nBitcoin (BTC) price started moving after a prolonged consolidation, and with it Ethereum (ETH) and Ripple (XRP) prices. The general outlook is revival recourse, with markets flashing green as the Chinese Lunar Year of the Dragon sets in this weekend. It is a special year, representing strength.\n\n“We’re happy to do the Year of the Dragon, because it’s a very powerful year and very auspicious,” said local board member of the Organization of Chinese Americans, Anna Wong, adding, “and everyone feels lucky when they’re in the Year of the Dragon.”\n\nWith this optimism, crypto markets could rally this weekend as Chinese investors feel lucky.\n\nAlso Read: Bitcoin price shows strength as US BTC ETF flow percentage beats AUM in most regions\n\nBitcoin price could make it to $48,000 this weekend\n\nBitcoin (BTC) price has forayed past the midline of the supply zone at $45,451. The supply zone extending from $44,235 to $46,715 is an order block characterized by aggressive selling. If BTC manages to close above its midline, it could extend the gains to $48,000 this weekend, or in a highly bullish case, extend the gains to $50,000. Such a move would denote a 5% climb above current levels.\n\nThe Relative Strength Index (RSI) is northbound, pointing to rising momentum. The Moving Average Convergence Divergence (MACD) is also in positive territory with histogram bars flashing green to show a strong bullish wave.\n\nBTC/USDT 1-day chart\n\nConversely, with the RSI above 70, BTC is in overbought territory and a correction may be looming. Another threat to Bitcoin price upside potential is early profit-taking, which could see BTC fall back into the range between $40,650 and $43,750.\n\nIf selling pressure sends BTC all the way to $37,800, the cliff could see Bitcoin price roll over to $30,000, below which the bullish thesis would be invalidated.\n\nAlso Read: Bitcoin Weekly Forecast: BTC targets $52,000, will New Moon trigger a pullback first?\n\nEthereum price could reclaim its $2,717 range high\n\nEthereum (ETH) price is on a sustained uptrend, and could extend the climb past $2,600 to tag $2,717, levels last tested on January 12. This would constitute a 9% climb above current levels.\n\nThe RSI position at 63 shows there is more room in the north before ETH is overbought, with the inclination of the momentum indicator showing rising buying strength.\n\nThe MACD histogram bars are also green to show the strong presence of bulls in the market. Enhanced buyer momentum could see Ethereum price shatter past the range high to hit $2,800.\n\nETH/USDT 1-day chart\n\nOn the flip side, if traders start cashing in, Ethereum price could drop. While a break below $2,388 would harm ETH holders, the prevailing bullish outlook would only be invalidated if ETH crosses and closes below $2,280.\n\nAlso Read: Ethereum price tops $2,400 as 25% of ETH supply is staked and ETF applicants amend filings\n\nRipple price could take back $0.5500\n\nRipple (XRP) price has broken above the midline of the descending parallel channel. With momentum rising, XRP price could extend the gains 5% to the $0.5500 level. In a highly bullish case, the price could extend the climb, shattering the 50, 200 and 100-day Simple Moving Averages (SMA) at $0.5633, $0.5730 and $0.5970, respectively. This could lay the path for XRP to hit the $0.6000 psychological level.\n\nXRP/USDT 1-day chart\n\nOn the flipside, if the bears have their way, Ripple price could dwindle, potentially retesting the $0.4734 support.\n\nAlso Read: XRP Price faces threat of fall below $0.50 as XRPLedger AMM amendment is uncertain"
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTFBGWjRsVWxUcGJHWnRYYUZDVy1tX0UtbFVJcU5EY1daR25UWW9TbGk0QkJZamRZampIU0I2enBQOTdYdTB5VWkzdXV1TXNfS1ZmNjdkcHBiMFV1bHBiSnBuYXZjNDlHVjNUSE5nQTVvblQ5ODRRX2040gF8QVVfeXFMT0dUbk9jUmp3eUxpU2ZhNTlVQWxZVUJSMDNVR3Y5bFBBZEJXU0VVN2c0OFR0TFNPdFRpX2ZwbERiMUkxYjF5ODl6NmVETDhmSDJhX1lNTFg1dlQ3SXBTQWhkNGljd2JWakZiZFNkb3NSSVJ0bmR0bm5LZmZoWA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Insider: China's ETH Stake 'Jeopardizes Crypto' - Bitcoinist",
        "content": "Steven Nerayoff, a former advisor to Ethereum, has publicly voiced concerns about the Chinese Communist Party’s (CCP) alleged dominance over the ETH blockchain. His comments, made on X (formerly Twitter), echo the investigative findings of TruthLabs, an on-chain sleuth.\n\nAccording to TruthLabs, the CCP is speculated to control approximately 66.6% of ETH supply. This claim, if accurate, presents significant implications for the decentralization, security, and regulatory standing of Ethereum.\n\nThe CCP has taken over Crypto by being Ethereum's largest hidden whale, with an ownership estimation on my end of near 66.6% of the Eth supply today. They've clearly compromised the SEC, and CFTC, with Prometheum being given the ONLY Special Purpose Dealer Broker license for… pic.twitter.com/C5eCrGUH7d — TruthLabs 🫡 (@BoringSleuth) February 8, 2024\n\nNerayoff’s statements bring to light the potential deep-seated vulnerabilities within the ETH ecosystem. The CCP’s stake in Ethereum jeopardizes the entire crypto world. It’s inevitable. Ethereum has vulnerabilities—that’s a fact. The SEC and other entities are compromised. We can’t ignore this; we must confront the corruption, hold key figures accountable, and keep advancing this constantly evolving industry,” Nerayoff stated, underlining the urgency of addressing these issues head-on.\n\nA focal point of these allegations is Prometheum, a company that recently received a Special Purpose Dealer Broker (SPDB) license from the US Securities and Exchange Commission (SEC), marking a controversial step towards potentially classifying Ether as a security. Nerayoff’s critique extends to this development, emphasizing the implications of such a classification.\n\n“Prometheum’s declaration of Ethereum as a security extends beyond regulatory semantics; it’s a move by entities with deep CCP ties, aiming to control the narrative and the crypto space,” he remarked, highlighting the strategic influence exerted by the CCP through entities like Wanxiang, which is deeply involved with Prometheum.\n\nIn his comments, Nerayoff also referenced TruthLabs findings about the SEC filings that underscore the pivotal role of Wanxiang in the operation and development of the Prometheum Network.\n\n“The company (Prometheum) uses Wanxiang (CCP) as their SOLE project developer and relies on Wanxiang’s ability to create and maintain a successful platform. The loss of the services of Wanxiang could have a material adverse effect on the ability of the Company to Develop, Operate, or maintain the Prometheum Network,” TruthLabs quoted, spotlighting the ties with China.\n\nIs Ethereum Really Infiltrated By China’s CCP?\n\nTruthLabs has been at the forefront of uncovering these unsettling dynamics, alleging that the CCP’s influence over Ethereum and entities like Prometheum could compromise the privacy and security of American citizens. The researcher’s analysis suggests that the CCP’s involvement enables direct access to sensitive information of US consumers, a claim that amplifies the call for scrutiny and accountability within the crypto industry and regulatory bodies.\n\nTune in at 1:10 and tell me @prometheuminc isn't eager to sell you their Wanxiang, deep CCP tied, Crypto. Why is Gary Gensler giving this company access to our markets, and to American consumers? How did this CCP front company get the only approval and US companies did not? Now… https://t.co/0FcfqHvv3i — TruthLabs 🫡 (@BoringSleuth) February 9, 2024\n\nMoreover, Nerayoff’s direct challenge to prominent Ethereum figures, including Vitalik Buterin and Joseph Lubin, underscores the gravity of the situation. “It’s undeniable now. Your day of reckoning approaches… Vitalik Buterin, Joseph Lubin, Ethereum Foundation,” he warned, signaling the need for a concerted effort to address and mitigate the alleged corruption and external influence that threaten the ethos and integrity of the Ethereum network.\n\nAs Bitcoinist reported, Nerayoff is currently preparing a fraud lawsuit with the help of TruthLabs against the Ethereum Foundation, Buterin and Lubin. It is not yet known when the lawsuit will be filed in a US court.\n\nOver the past few months, Nerayoff has made numerous serious accusations against the Ethereum founders and submitted an old audio recording as evidence. Neither the Ethereum Foundation nor Buterin or Lubin have yet commented on any allegations, something Nerayoff and TruthLabs interpret as an admittance of guilt.\n\nAt press time, ETH traded at $2,454.\n\nFeatured image created with DALL·E, chart from TradingView.com"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxNNDhxVUJZbVBIdWVpRm9WdUdWLUhpQ01mN0NINlVtWnExR0Qwd0ZIaFZmSTdXSzU3VDZvSXJncU5oZHJ0NHRvRmpaVm1UYkNMOGw1TGotZURUSXhGRjdndHM5cS02YllNUThYVXBfbXlhdjJrT1RtNEdTcG1meVczN0x6bUxIRGFRQXdhaXE1ai1hWndKR1doS0FYblBuVTlV0gGoAUFVX3lxTE9QTmR0Wmh6ajNaQkZ6a3hWbHpmeUdaNHRUdDh0T3JQQnp2YWhGbk9kTTk3ZTd4TlhCeG5GQjBOU2dDMFUtQXZUbHRQb3drSWo0WE9XVlo1aG1nT2ZwTG11NDJPMzNNaGRQajVFYjJTTmtwMnloVFJrZ2p1alNsMlNKRVdERExpd3k4WGE2X0diSUcwM3g4bE5HaE5MYU00Rll6X1NKclpJZg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Feb 2024 08:00:00 GMT",
        "title": "What Is ERC-404? The Experimental ‘Semi-Fungible’ Ethereum Token Standard - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEstablished token standards for Ethereum include fungible ERC-20 tokens and non-fungible ERC-721 tokens (NFTs). Now an experimental and unofficial new token standard, ERC-404, aims to combine elements of both into a single \"semi-fungible\" digital asset.\n\nWhat is ERC-404?\n\nERC-404 is a new token standard for digital assets on the Ethereum blockchain developed by pseudonymous creators \"ctrl\" and \"Acme.\"\n\nToken standards are formal sets of rules and protocols that determine the behavior of tokens on blockchain networks such as Ethereum.\n\nAD\n\nAD\n\nThe ERC-404 token standard combines features of ERC-20 and ERC-721, enabling the creation of \"semi-fungible\" tokens that employ features from fungible and non-fungible tokens.\n\nHow does ERC-404 work?\n\nNFTs are non-fungible, meaning that they are unique and indivisible; you can't own fractions of an NFT.\n\nERC-404 circumvents this limitation by using token mint and burn mechanics to enable fractional transfers of an NFT.\n\nIssued tokens are linked to an NFT. If you buy a full token, the linked NFT is minted to your wallet. If you sell a fraction of the token, the linked NFT is burned. If a wallet holding fractions of a token purchases enough fractions to hold a complete token, a new NFT is minted automatically.\n\nWhat's so special about it?\n\nThe ERC-404 token standard enables native fractionalization of NFTs, creating new primitives and new mechanics built atop them. This, in turn, allows for experimentation with NFTs and the trading of them.\n\nAD\n\nAD\n\nThe token standard's creators suggest that the goal is to create an NFT with \"native fractionalization, liquidity and encourages some aspects of trading/engagement to farm unique trait sets.\"\n\nThe team behind Pandora, a project using ERC-404, claims that it effectively enables NFTs built using the standard to \"effectively have a token price that reflects a floor price in real-time\" because it allows for \"actual native liquidity.\" Rather than needing a single counterparty to buy their NFT, holders of ERC-404 tokens can sell at a time of their choosing if there's a liquidity pool.\n\nFurthermore, instead of having to lock up or wrap NFTs and issue shares against them, fractionalization of NFTs can be achieved natively without relying on third-party protocols and solutions.\n\nAnother possible use case suggested by the Pandora team is gaming NFTs that incorporate randomization into the destroying and reminting of NFTs.\n\nERC-404 projects\n\nPandora: Pandora is one of the first projects to employ the ERC-404 token standard. It comprises 10,000 PANDORA ERC-20 tokens and 10,000 linked \"Replicant\" NFTs. A Replicant NFT is minted to your wallet if you purchase a PANDORA token on an exchange.\n\nPandora is one of the first projects to employ the ERC-404 token standard. It comprises 10,000 PANDORA ERC-20 tokens and 10,000 linked \"Replicant\" NFTs. A Replicant NFT is minted to your wallet if you purchase a PANDORA token on an exchange. DeFrogs: DeFrogs is a collection of 10,000 Pepe the Frog-themed NFTs using a variant of the ERC-404 token standard, billed as the first ERC-404 PFP collection, which its creators claim is deflationary.\n\nDeFrogs is a collection of 10,000 Pepe the Frog-themed NFTs using a variant of the ERC-404 token standard, billed as the first ERC-404 PFP collection, which its creators claim is deflationary. Monkees: Another PFP collection using the ERC-404 token standard, Monkees consists of 100 NFTs with ten attributes and six traits.\n\nThe future of ERC-404\n\nUnlike the popular ERC-20 and ERC-721 token standards, ERC-404 is \"experimental\" and unofficial. That means it hasn't been submitted for review as an Ethereum Improvement Proposal (EIP) or undergone a full external audit. This means it could have undiscovered flaws, introducing a significant risk to token holders.\n\nThe team states that, \"While these two standards are not designed to be mixed, this implementation strives to do so in as robust a manner as possible while minimizing tradeoffs,\" though they concede it is a \"non-standard\" implementation of ERC-721.\n\nBecause ERC-404 is an unofficial token standard, many NFT platforms and marketplaces do not support it by default\n\nThe team behind the token standard plan to submit it as an official Ethereum Improvement Proposal, a potentially lengthy process. However, their decision to circumvent the standard approval process for token standards could encourage other projects to do the same—which could lead to more unaudited token standards going to market, with the attendant risks to users that entails.\n\nAD\n\nAD"
    }
]