[
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE5Yc0ZjRUpOTkJWbjB6UTFYN0txend5aUhuWjdxX0FHYTJPOEhlY1I4RW9zSW5VeTE1cXFhUjRGRFRaUzhQaGF2WlZRMVBHOU9sNzAtVGFLM2tCbWx4dTA4UUVya2pnRTBpSnFTbVliZU81cm5pampwTdIBfkFVX3lxTE44S1JiZVlsOG1sX3BycmVJTGFab0ZySlZfYnhCdE02YUROampLYmZjclpIVEZ2UUN6NlA3U0VqMXBTdmpmSy1OMHVMbEFXOVBhRGNYTjdPbElKUVpMSjlPUF9CSWl1bTRxcE9pOWo2ZmpoSTVfcnU0OHRRamY2QQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Bloodbath Incoming? Celsius’ $125 Million Move Threatens ETH Price - NewsBTC",
        "content": "The Ethereum price might be doing well post-spot Bitcoin ETF launch, but recent moves by Celsius threaten to destabilize the price movement. The now-bankrupt crypto lender seems to have begun its reimbursement plan to its creditors, as on-chain data reveal the movement of its ETH holdings to crypto exchanges.\n\nAccording to crypto market intelligence company Arkham Intelligence, Celsius Network carried out transfers worth over $125 million worth of ETH last week to various crypto exchanges.\n\nCelsius Transfers ETH To Exchanges\n\nData shows that between January 8 and January 12, Celsius executed transfers worth $95.5 million to crypto exchange Coinbase while also sending $29.73 million to FalconX. At the time of writing, Celsius Network’s balance sheet has 584,601 ETH worth $1.47 billion. Notably, it also has 9,799 BTC worth $418.2 million and 659 million CEL tokens worth $133.2 million on its books, among other cryptocurrencies.\n\nRelated Reading\n\nBitcoin Hashrate Hits New All-Time High Amid Spot ETF Frenzy 8 months ago\n\nLooks like Celsius took the opportunity to unload >$125M of ETH over ETF Week. In the past week, they’ve deposited $95.5M to Coinbase and sent $29.73M to FalconX. They still have $1.4 billion (540K ETH) remaining.https://t.co/jp1PJbN46r pic.twitter.com/xgfX6yU5Ye — Arkham (@ArkhamIntel) January 13, 2024\n\nCelsius’s motive behind the transfers into exchange points to nothing apart from an intending selloff, as the company is well on its way to clearing its liabilities under bankruptcy proceedings.\n\nCelsius filed for bankruptcy in July 2022 shortly after the fall of TerraUSD and the LUNA ecosystem, leading to creditors having their funds trapped on the platform for the last 18 months. However, the defunct crypto lender has been making major moves in its bankruptcy proceedings to refund creditors. According to reports, the company sold $240 million worth of ETH in December 2023.\n\nNotably, the company communicated its decision earlier this month on January 5 to unstake $465 million worth of Ethereum (ETH) which will be distributed to its creditors.\n\nETH price shows strength as new trading week opens up | Source: ETHUSD on Tradingview.com\n\nIncoming Ethereum Price Crash?\n\nEthereum is currently on a roll, still on a 13% gain in the past seven days. However, huge selloffs like this tend to shake market confidence, leading to a sell-off from other investors. On the other hand, some tend to believe that the crypto is sufficiently resilient.\n\nRelated Reading\n\nHow To Buy, Sell, And Trade Tokens On The BSC Network 8 months ago\n\nIt’s important to note that Ethereum retained its bullish sentiment during the time these transfers were made, as price action revealed a 23% jump from $2,191 on January 8 to $2,706 on January 12. Ethereum has declined since then and is now trading at $2,514. According to Coinglass, $23.84 million worth of ETH positions were liquidated in the past 24 hours.\n\nDespite the recent large transfers, Celsius still retains significant cryptocurrency assets including ETH, BTC, MATIC, and LINK. A decision to continue the selling off of these assets could lead to a bigger dent in the price of the assets, particularly Ethereum, which is now testing the $2,500 support level.\n\nOn-chain data from Spotonchain also reported FTX and Alameda Research moving 1,000 ETH worth $2.33 million to crypto exchange Coinbase during the week.\n\nFeatured image from The Daily Hodl, chart from Tradingview.com"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxQQ2R6b3J3T2FmOXRUaUQxeko1aGFnb2VpcU1TSThoYXpHNUFwOExxYmRObXV6UmhQeUxTdEFYcXY1a29Da2NoWVpSeWRpRU0wajVqU0Q3RElva0xtVXozaGtIQlFBdkN1SThsY25mWlZYX2FKOGJOOFMwY2xYem15bXpyVDFzLVhHRFBjWjBjYW5LRklZS2c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jan 2024 08:00:00 GMT",
        "title": "Forget XRP: This Crypto Could Be Unstoppable in 2024 - The Motley Fool",
        "content": "Unlike XRP, Solana has a number of high-upside growth catalysts in place for 2024.\n\nAt the end of December, Solana (SOL -0.17%) flipped XRP (XRP 4.27%) to become the fifth-most valuable cryptocurrency. This capped off an impressive run for Solana in 2023. At one point, Solana was up more than 1,000% for the year.\n\nAll this has me thinking it's finally time to forget about XRP. The former crypto market darling is still bogged down in litigation with the Securities and Exchange Commission (SEC). Until that regulatory matter is cleared up, XRP shows no signs of breaking through the $1 price level. Contrast that to Solana, which now seems to have a very bright future ahead of it. Let's take a closer look.\n\nSolana is on pace to topple Ethereum\n\nThe primary investment thesis for Solana is that it is the new Ethereum (ETH 0.24%). Since 2020, crypto investors have been touting Solana as a potential \"Ethereum killer,\" and that scenario now seems to be finally playing out. While there are plenty of other Layer 1 blockchain challengers out there, Solana seems to be the one with the best chance of displacing Ethereum.\n\nSimply stated, Solana is a faster, cheaper, more efficient version of Ethereum. While Ethereum had to pull off a very complicated technical transformation (known as The Merge) to become an energy-efficient, proof-of-stake blockchain back in 2022, Solana launched right out of the box as a proof-of-stake blockchain. Whether it's transaction processing speed or overall transaction throughput, Solana seems to have the superior technology.\n\nGranted, the \"best technology\" does not always win. There are a lot of other factors to consider, including first-mover advantage and network effects. That's why Solana has taken nearly four years to finally catch up to Ethereum. But the investment narrative around Solana certainly seems to be shifting. A number of very smart investors -- including Cathie Wood of Ark Invest -- now seem to buy into the idea of Solana as a faster, more cost-efficient version of Ethereum.\n\nSolana has some big-time growth catalysts in place\n\nWhile Ethereum has been around longer than Solana, Solana has one thing Ethereum does not: a mobile crypto strategy. First announced back in the summer of 2022, this mobile crypto strategy has steadily been taking shape over the past 18 months.\n\nLast May, Solana finally launched the first-ever mobile crypto phone, the Saga. The goal of the crypto phone was to usher in a new mobile-first approach to crypto. Think about it -- today's smartphones are not crypto-native. They are designed for neither crypto users nor crypto wallets or for buying non-fungible tokens (NFTs) while waiting in line for a coffee from your favorite barista. So, Solana -- led by a talented team of former Qualcomm (QCOM -1.47%) engineers -- decided to change all that.\n\nThis mobile crypto strategy also includes a mobile payments component. In February 2022, Solana launched Solana Pay, a blockchain-based payment protocol for merchants who want to accept crypto at the point of sale. Again, this builds on a very intuitive idea: Some people want to pay with crypto, and most merchants want to avoid high credit card processing fees. As a proof-of-concept, Solana announced an integration with Shopify (SHOP -1.91%) at the end of August.\n\nYes, of course, these mobile crypto initiatives could absolutely fail. But they are the types of big-time growth catalysts that XRP simply does not have right now. As long as the legal drama with the SEC stretches on (which could be until the end of 2024), it's highly unlikely that XRP will be able to do much of anything in the U.S. market.\n\nAt the same time, the company behind the XRP token (Ripple Labs) is hemorrhaging cash to pay lawyers. According to Ripple executives, these legal costs could wind up being more than $200 million.\n\nBefore you dump all your XRP tokens\n\nWhile I'm highly confident that Solana could be an unstoppable crypto in 2024, there's also a chance that XRP could soar in price this year. Last summer, when XRP scored a major legal win in its ongoing SEC court case, the price of XRP doubled nearly overnight. So, there is upside potential. If you're currently holding XRP tokens, it could be worth waiting to see what develops.\n\nOver a long-term horizon, though, Solana appears to be a far superior investment. As soon as Solana flipped XRP at year-end, that should have been a wake-up call to XRP investors. It's finally time to look for a new crypto champion, and right now, that champion appears to be Solana."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxQQ2R6b3J3T2FmOXRUaUQxeko1aGFnb2VpcU1TSThoYXpHNUFwOExxYmRObXV6UmhQeUxTdEFYcXY1a29Da2NoWVpSeWRpRU0wajVqU0Q3RElva0xtVXozaGtIQlFBdkN1SThsY25mWlZYX2FKOGJOOFMwY2xYem15bXpyVDFzLVhHRFBjWjBjYW5LRklZS2c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jan 2024 08:00:00 GMT",
        "title": "Forget XRP: This Crypto Could Be Unstoppable in 2024 - The Motley Fool",
        "content": "Unlike XRP, Solana has a number of high-upside growth catalysts in place for 2024.\n\nAt the end of December, Solana (SOL -0.17%) flipped XRP (XRP 4.27%) to become the fifth-most valuable cryptocurrency. This capped off an impressive run for Solana in 2023. At one point, Solana was up more than 1,000% for the year.\n\nAll this has me thinking it's finally time to forget about XRP. The former crypto market darling is still bogged down in litigation with the Securities and Exchange Commission (SEC). Until that regulatory matter is cleared up, XRP shows no signs of breaking through the $1 price level. Contrast that to Solana, which now seems to have a very bright future ahead of it. Let's take a closer look.\n\nSolana is on pace to topple Ethereum\n\nThe primary investment thesis for Solana is that it is the new Ethereum (ETH 0.24%). Since 2020, crypto investors have been touting Solana as a potential \"Ethereum killer,\" and that scenario now seems to be finally playing out. While there are plenty of other Layer 1 blockchain challengers out there, Solana seems to be the one with the best chance of displacing Ethereum.\n\nSimply stated, Solana is a faster, cheaper, more efficient version of Ethereum. While Ethereum had to pull off a very complicated technical transformation (known as The Merge) to become an energy-efficient, proof-of-stake blockchain back in 2022, Solana launched right out of the box as a proof-of-stake blockchain. Whether it's transaction processing speed or overall transaction throughput, Solana seems to have the superior technology.\n\nGranted, the \"best technology\" does not always win. There are a lot of other factors to consider, including first-mover advantage and network effects. That's why Solana has taken nearly four years to finally catch up to Ethereum. But the investment narrative around Solana certainly seems to be shifting. A number of very smart investors -- including Cathie Wood of Ark Invest -- now seem to buy into the idea of Solana as a faster, more cost-efficient version of Ethereum.\n\nSolana has some big-time growth catalysts in place\n\nWhile Ethereum has been around longer than Solana, Solana has one thing Ethereum does not: a mobile crypto strategy. First announced back in the summer of 2022, this mobile crypto strategy has steadily been taking shape over the past 18 months.\n\nLast May, Solana finally launched the first-ever mobile crypto phone, the Saga. The goal of the crypto phone was to usher in a new mobile-first approach to crypto. Think about it -- today's smartphones are not crypto-native. They are designed for neither crypto users nor crypto wallets or for buying non-fungible tokens (NFTs) while waiting in line for a coffee from your favorite barista. So, Solana -- led by a talented team of former Qualcomm (QCOM -1.47%) engineers -- decided to change all that.\n\nThis mobile crypto strategy also includes a mobile payments component. In February 2022, Solana launched Solana Pay, a blockchain-based payment protocol for merchants who want to accept crypto at the point of sale. Again, this builds on a very intuitive idea: Some people want to pay with crypto, and most merchants want to avoid high credit card processing fees. As a proof-of-concept, Solana announced an integration with Shopify (SHOP -1.91%) at the end of August.\n\nYes, of course, these mobile crypto initiatives could absolutely fail. But they are the types of big-time growth catalysts that XRP simply does not have right now. As long as the legal drama with the SEC stretches on (which could be until the end of 2024), it's highly unlikely that XRP will be able to do much of anything in the U.S. market.\n\nAt the same time, the company behind the XRP token (Ripple Labs) is hemorrhaging cash to pay lawyers. According to Ripple executives, these legal costs could wind up being more than $200 million.\n\nBefore you dump all your XRP tokens\n\nWhile I'm highly confident that Solana could be an unstoppable crypto in 2024, there's also a chance that XRP could soar in price this year. Last summer, when XRP scored a major legal win in its ongoing SEC court case, the price of XRP doubled nearly overnight. So, there is upside potential. If you're currently holding XRP tokens, it could be worth waiting to see what develops.\n\nOver a long-term horizon, though, Solana appears to be a far superior investment. As soon as Solana flipped XRP at year-end, that should have been a wake-up call to XRP investors. It's finally time to look for a new crypto champion, and right now, that champion appears to be Solana."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxOb1htaVZyMDZXbm9VQlJQQnlfcFdodU12ZHNoWlBJTWFmdy1NUUlGQmpybHpNQ09Ed1d1RHlBYkh3cExWR2t2VldjZWN6ZDNPcmQyOS1LVzlBU0xTbjVCeGhFSmpxQXB4VnRxVzBwdm1jWm0zaGZ6R3dZX3pBQUc5M09RVQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jan 2024 08:00:00 GMT",
        "title": "Liquid staking protocols: new era for Ethereum validators - crypto.news",
        "content": "Discover how Ethereum’s shift to PoS and liquid staking protocols transform blockchain technology and address the 32 ETH staking challenge.\n\nEthereum staking has revolutionized the way we use and interact with blockchain technology. With its security now relying on capital rather than computing power, Ethereum’s (ETH) shift to proof-of-stake (PoS) offers numerous benefits, including a reported 99% reduction in the network’s carbon footprint.\n\nHowever, it still presents several drawbacks, chief among them being the 32 ETH economic requirement for participants to run a dedicated node on the network.\n\nYou might also like: What is proof-of-stake (PoS)?\n\nLiquid staking protocols: what to look out for\n\nAs of January, 32 ETH is about $84,724. Not many would-be validators can easily afford that amount, especially in regions with lower incomes.\n\nAdditionally, staking funds become locked and lack liquidity, pushing stakers to join staking pools instead. These pools often prove more profitable than individual validators due to the advantages of smoothing effects, safety mechanisms, and insurance they offer.\n\nThe situation has led to a concentration of power on the Ethereum network, with a small number of stakers controlling a significant share of the blockchain. Since these entities hold most of Ethereum’s validator keys, it gives them full control over crucial aspects like block production, transaction censorship, and MEV (maximal extractable value) choices.\n\nBreakdown of top depositors on Ethereum | Source: Etherscan\n\nAnd as these pools grow larger, they gain more strength, eroding the core decentralization principles of Ethereum. As a result, there have been calls for more decentralized and pocket-friendly solutions to address this concern.\n\nThis is where community-driven liquid staking protocols come in. These platforms offer a new way to stake ETH and enjoy the benefits of staking while maintaining liquidity and flexibility. To shed light on this groundbreaking trend, we sat down with the teams behind three emerging liquid staking protocols: ether.fi, Diva, and Tenderize.\n\nYou might also like: Vitalik Buterin unveils major overhaul of Ethereum staking\n\nether.fi: unlocking liquid staking\n\nEther.fi team has pioneered a non-custodial protocol that enables users to stake their ETH holdings while keeping their private keys securely in their possession.\n\nether.fi business model | Source: ether.fi\n\nAmong the people associated with this project is Arthur Hayes, an investor who actively contributes to ether.fi through his family office, Maelstrom.\n\nYou might also like: Arthur Hayes dumps Solana for Ether, cites divine inspiration\n\nWhen we asked the ether.fi team about their target audience, they responded,\n\n“We cater to individuals who have a keen interest in staking Ethereum.”\n\nHowever, they also highlighted the regulatory uncertainties surrounding ETH staking in the United States. Consequently, ether.fi has temporarily geofenced U.S. users until the Securities and Exchange Commission (SEC) provides more precise guidance.\n\nYou might also like: Staking rewards are now taxable, says IRS\n\nThe ether.fi team prioritized security for their protocol, employing auditors like Nethermind, Omniscia, Zellic, and Solidified to enhance safety measures.\n\nEther.fi offers loyalty points and membership programs, providing rewards for users. The platform adopts a non-custodial approach, allowing users to maintain control over their keys, aligning with the principle of “Not your keys, not your coins.”\n\nTo tackle liquidity and volatility issues in staked tokens, ether.fi has made provisions for users to withdraw or trade their assets through the eETH liquidity pool.\n\nAs of Jan. 12, ether.fi was one of the major liquid staking protocols per the amount of ETH staked in the last six months.\n\nhttps://twitter.com/ether_fi/status/1745565800830763314\n\nDiva: another approach to liquid staking\n\nDiva, a liquid staking protocol that will be launched in 2024. Diva’s distributed validator technology (DVT) allows the entire network to perform validation, reducing the risks associated with centralization. Per developers, Diva’s security model, based on DVT, offers improved uptime and a diverse range of operators without requiring permission.\n\nDiva liquid staking model | Source: Diva on Medium\n\nIt provides an alternative to solo staking, which demands 32 ETH per validator and requires considerable technical expertise. Diva’s operator union model makes staking more accessible by allowing users to lock as little as 1 ETH while providing better rewards and flexibility, according to the protocol’s developers.\n\nThe platform engages its community through Discord channels, encouraging users to contribute to early testing and provide feedback. According to the team, the community plays a significant role in governance decisions, ensuring the protocol evolves in response to the needs and concerns of its users.\n\nThe Ethereum Shanghai upgrade has played a crucial role in accelerating the growth of liquid staking for ETH. This upgrade completed the circle for Diva, particularly by making liquid staking tokens (LSTs) fully functional. This functionality allows LSTs to trade closely to their fair value, significantly reducing the cost of providing liquidity in defi.\n\nYou might also like: Ethereum Shanghai upgrade for geeks: unpacking the tech side\n\nWith deep liquidity pools now more accessible, protocols like Diva may gain a competitive advantage over established players like Lido Finance.\n\nTo ensure the stability and liquidity of the stETH derivative token, Diva employs divETH tokens, which closely track ETH at a 1:1 ratio. This approach, combined with DVT-based security, is how Diva mitigates significant price deviations from ETH.\n\nThe protocol has also adopted a special approach to navigate legal challenges and ensure regulatory compliance globally. Instead of operating as a traditional company or platform, Diva positions itself as a pure software extension of Ethereum. Its immutable code, similar to contracts such as Wrapped ETH or Liquity, ensures that no central entity offers services or charges fees. Diva aims to establish regulatory equivalences by staking on Ethereum itself, simplifying compliance efforts.\n\nAt the time of writing, Diva has not yet launched. However, by offering an Operator Testnet Alpha and proposing a Pre-Launch Vault, Diva aims to encourage early commitments of total value locked (TVL) in ETH or stETH.\n\nhttps://twitter.com/divastaking/status/1737879212625719690\n\nTenderize: empowering validators\n\nTenderize is a liquid staking solution that allows any validator on the network to participate, potentially unlocking as much as $30 billion worth of crypto previously neglected in liquid staking.\n\nAccording to the Tenderize team, the platform has attempted to tackle issues of neglected assets by providing each validator with highly-liquid staked tokens, promoting decentralization in the ecosystem.\n\nTendirize ecosystem | Source: Tenderize website\n\nThe platform has a new upgrade dubbed Tenderize v2, and what sets it apart, in the words of its creators, is its self-custodial nature, which eliminates the need for intermediaries. It means users can swiftly exit staking through a native decentralized exchange (DEX), with the shared liquidity approach ensuring greater flexibility and liquidity access without centralizing stake on whitelisted nodes.\n\nMuch like Diva, the Ethereum Shanghai upgrade played a vital role in accelerating the growth of liquid staking for Tenderize, with the platform reportedly experiencing its fair share of positive impact.\n\nPrior to the upgrade, TenderSwap, a crucial component of the Tenderize protocol, faced limitations in facilitating unstaking. However, with the upgrade, users could unstake ETH, which paved the way for the launch of tETH through Tenderize v2.\n\nThe protocol emphasizes community involvement in its development, with Tenderize offering grants to validators and liquidity providers for their input and testing. The platform also involves token holders in governance decisions, such as fee and reward determination.\n\nIn liquid staking, addressing stability and liquidity concerns is crucial. Tenderize offers two methods for converting tTokens back to their original form.\n\nOne method is through TenderSwap v2, where users can exchange their tTokens (like tMATIC, tLPT, or tGRT) for the corresponding asset (MATIC, LPT, or GRT) at a 1:1 ratio, subject to a service fee. The alternative method requires waiting for the unstaking period to end, which varies by blockchain. Tenderize aims to maintain a 1:1 swap ratio on TenderSwap to manage price deviation risks and support user stability and liquidity.\n\nThe mainnet launch is scheduled at Jan. 29, according to Tenderize X account.\n\nhttps://twitter.com/tenderize_me/status/1745799023569879411\n\nLiquid staking protocols: the future of staking?\n\nEthereum staking represents a notable development in the cryptocurrency space, with various projects contributing to this trend. These projects enable users to stake amounts less than 32 ETH, supporting Ethereum’s transition to proof-of-stake.\n\nAdditionally, these projects offer methods for users to liquidate their staked assets without undergoing a full withdrawal process, enhancing the flexibility of cryptocurrency staking.\n\nProjects supporting ETH staking below the 32 ETH threshold provide an opportunity for users to participate in staking with smaller investments."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxOb1htaVZyMDZXbm9VQlJQQnlfcFdodU12ZHNoWlBJTWFmdy1NUUlGQmpybHpNQ09Ed1d1RHlBYkh3cExWR2t2VldjZWN6ZDNPcmQyOS1LVzlBU0xTbjVCeGhFSmpxQXB4VnRxVzBwdm1jWm0zaGZ6R3dZX3pBQUc5M09RVQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jan 2024 08:00:00 GMT",
        "title": "Liquid staking protocols: new era for Ethereum validators - crypto.news",
        "content": "Discover how Ethereum’s shift to PoS and liquid staking protocols transform blockchain technology and address the 32 ETH staking challenge.\n\nEthereum staking has revolutionized the way we use and interact with blockchain technology. With its security now relying on capital rather than computing power, Ethereum’s (ETH) shift to proof-of-stake (PoS) offers numerous benefits, including a reported 99% reduction in the network’s carbon footprint.\n\nHowever, it still presents several drawbacks, chief among them being the 32 ETH economic requirement for participants to run a dedicated node on the network.\n\nYou might also like: What is proof-of-stake (PoS)?\n\nLiquid staking protocols: what to look out for\n\nAs of January, 32 ETH is about $84,724. Not many would-be validators can easily afford that amount, especially in regions with lower incomes.\n\nAdditionally, staking funds become locked and lack liquidity, pushing stakers to join staking pools instead. These pools often prove more profitable than individual validators due to the advantages of smoothing effects, safety mechanisms, and insurance they offer.\n\nThe situation has led to a concentration of power on the Ethereum network, with a small number of stakers controlling a significant share of the blockchain. Since these entities hold most of Ethereum’s validator keys, it gives them full control over crucial aspects like block production, transaction censorship, and MEV (maximal extractable value) choices.\n\nBreakdown of top depositors on Ethereum | Source: Etherscan\n\nAnd as these pools grow larger, they gain more strength, eroding the core decentralization principles of Ethereum. As a result, there have been calls for more decentralized and pocket-friendly solutions to address this concern.\n\nThis is where community-driven liquid staking protocols come in. These platforms offer a new way to stake ETH and enjoy the benefits of staking while maintaining liquidity and flexibility. To shed light on this groundbreaking trend, we sat down with the teams behind three emerging liquid staking protocols: ether.fi, Diva, and Tenderize.\n\nYou might also like: Vitalik Buterin unveils major overhaul of Ethereum staking\n\nether.fi: unlocking liquid staking\n\nEther.fi team has pioneered a non-custodial protocol that enables users to stake their ETH holdings while keeping their private keys securely in their possession.\n\nether.fi business model | Source: ether.fi\n\nAmong the people associated with this project is Arthur Hayes, an investor who actively contributes to ether.fi through his family office, Maelstrom.\n\nYou might also like: Arthur Hayes dumps Solana for Ether, cites divine inspiration\n\nWhen we asked the ether.fi team about their target audience, they responded,\n\n“We cater to individuals who have a keen interest in staking Ethereum.”\n\nHowever, they also highlighted the regulatory uncertainties surrounding ETH staking in the United States. Consequently, ether.fi has temporarily geofenced U.S. users until the Securities and Exchange Commission (SEC) provides more precise guidance.\n\nYou might also like: Staking rewards are now taxable, says IRS\n\nThe ether.fi team prioritized security for their protocol, employing auditors like Nethermind, Omniscia, Zellic, and Solidified to enhance safety measures.\n\nEther.fi offers loyalty points and membership programs, providing rewards for users. The platform adopts a non-custodial approach, allowing users to maintain control over their keys, aligning with the principle of “Not your keys, not your coins.”\n\nTo tackle liquidity and volatility issues in staked tokens, ether.fi has made provisions for users to withdraw or trade their assets through the eETH liquidity pool.\n\nAs of Jan. 12, ether.fi was one of the major liquid staking protocols per the amount of ETH staked in the last six months.\n\nhttps://twitter.com/ether_fi/status/1745565800830763314\n\nDiva: another approach to liquid staking\n\nDiva, a liquid staking protocol that will be launched in 2024. Diva’s distributed validator technology (DVT) allows the entire network to perform validation, reducing the risks associated with centralization. Per developers, Diva’s security model, based on DVT, offers improved uptime and a diverse range of operators without requiring permission.\n\nDiva liquid staking model | Source: Diva on Medium\n\nIt provides an alternative to solo staking, which demands 32 ETH per validator and requires considerable technical expertise. Diva’s operator union model makes staking more accessible by allowing users to lock as little as 1 ETH while providing better rewards and flexibility, according to the protocol’s developers.\n\nThe platform engages its community through Discord channels, encouraging users to contribute to early testing and provide feedback. According to the team, the community plays a significant role in governance decisions, ensuring the protocol evolves in response to the needs and concerns of its users.\n\nThe Ethereum Shanghai upgrade has played a crucial role in accelerating the growth of liquid staking for ETH. This upgrade completed the circle for Diva, particularly by making liquid staking tokens (LSTs) fully functional. This functionality allows LSTs to trade closely to their fair value, significantly reducing the cost of providing liquidity in defi.\n\nYou might also like: Ethereum Shanghai upgrade for geeks: unpacking the tech side\n\nWith deep liquidity pools now more accessible, protocols like Diva may gain a competitive advantage over established players like Lido Finance.\n\nTo ensure the stability and liquidity of the stETH derivative token, Diva employs divETH tokens, which closely track ETH at a 1:1 ratio. This approach, combined with DVT-based security, is how Diva mitigates significant price deviations from ETH.\n\nThe protocol has also adopted a special approach to navigate legal challenges and ensure regulatory compliance globally. Instead of operating as a traditional company or platform, Diva positions itself as a pure software extension of Ethereum. Its immutable code, similar to contracts such as Wrapped ETH or Liquity, ensures that no central entity offers services or charges fees. Diva aims to establish regulatory equivalences by staking on Ethereum itself, simplifying compliance efforts.\n\nAt the time of writing, Diva has not yet launched. However, by offering an Operator Testnet Alpha and proposing a Pre-Launch Vault, Diva aims to encourage early commitments of total value locked (TVL) in ETH or stETH.\n\nhttps://twitter.com/divastaking/status/1737879212625719690\n\nTenderize: empowering validators\n\nTenderize is a liquid staking solution that allows any validator on the network to participate, potentially unlocking as much as $30 billion worth of crypto previously neglected in liquid staking.\n\nAccording to the Tenderize team, the platform has attempted to tackle issues of neglected assets by providing each validator with highly-liquid staked tokens, promoting decentralization in the ecosystem.\n\nTendirize ecosystem | Source: Tenderize website\n\nThe platform has a new upgrade dubbed Tenderize v2, and what sets it apart, in the words of its creators, is its self-custodial nature, which eliminates the need for intermediaries. It means users can swiftly exit staking through a native decentralized exchange (DEX), with the shared liquidity approach ensuring greater flexibility and liquidity access without centralizing stake on whitelisted nodes.\n\nMuch like Diva, the Ethereum Shanghai upgrade played a vital role in accelerating the growth of liquid staking for Tenderize, with the platform reportedly experiencing its fair share of positive impact.\n\nPrior to the upgrade, TenderSwap, a crucial component of the Tenderize protocol, faced limitations in facilitating unstaking. However, with the upgrade, users could unstake ETH, which paved the way for the launch of tETH through Tenderize v2.\n\nThe protocol emphasizes community involvement in its development, with Tenderize offering grants to validators and liquidity providers for their input and testing. The platform also involves token holders in governance decisions, such as fee and reward determination.\n\nIn liquid staking, addressing stability and liquidity concerns is crucial. Tenderize offers two methods for converting tTokens back to their original form.\n\nOne method is through TenderSwap v2, where users can exchange their tTokens (like tMATIC, tLPT, or tGRT) for the corresponding asset (MATIC, LPT, or GRT) at a 1:1 ratio, subject to a service fee. The alternative method requires waiting for the unstaking period to end, which varies by blockchain. Tenderize aims to maintain a 1:1 swap ratio on TenderSwap to manage price deviation risks and support user stability and liquidity.\n\nThe mainnet launch is scheduled at Jan. 29, according to Tenderize X account.\n\nhttps://twitter.com/tenderize_me/status/1745799023569879411\n\nLiquid staking protocols: the future of staking?\n\nEthereum staking represents a notable development in the cryptocurrency space, with various projects contributing to this trend. These projects enable users to stake amounts less than 32 ETH, supporting Ethereum’s transition to proof-of-stake.\n\nAdditionally, these projects offer methods for users to liquidate their staked assets without undergoing a full withdrawal process, enhancing the flexibility of cryptocurrency staking.\n\nProjects supporting ETH staking below the 32 ETH threshold provide an opportunity for users to participate in staking with smaller investments."
    }
]