[
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxPMXZSeGxnQXRtNmg0SEZzVjczN1Jrb3V2Sk1aTWhhNE5hYnlpY1NaaWp0NEkwdF95c2hwU0ZJcEEtbjRYSHdzZHI5WkwwcWFiMU4zZTFKeU9rS2hLWjBGNUROQnY2RUh0a056aU91dkc5UnpoUDkzM25EaUJnakVWNEtFbWVQZEgyUlhsZVpzMjhsZFBaSmYzVDNzSWY3d9IBowFBVV95cUxOaTY3aUZRaU0wSGNCU056SHBJYzVRYUhaQlFNY0JKOFlkMXJLX2NzQzdTbTJmZzZjXzZsdHEzY1JUVkc1NTByYzdmSUdBQW5RMTAzLUJSdmtTR2Y3dExFQksxRFhuajRJZGRpV2JEQ0VQcHRHMTVKVmRaMGRBT2lvd3lLbHVRam1NSXA0dWNXR1JXZVpwd0dNQVVPUjJBQVlzQ2ln?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Classic’s bullish outlook fades; Look out for these key signals now! - AMBCrypto News",
        "content": "ETC’s market structure was bullish at press time\n\nMomentum and volume indicators turned bearish on the charts though\n\nEthereum Classic [ETC] retested the $25-support level and nearly flipped its higher timeframe market structure bearishly. This came after an unfavorable U.S May Jobs Report. Its short-term momentum seemed bearish too.\n\nIn a recent report, AMBCrypto noted that the $28.4-$29 zone could be revisited before a bounce. Ethereum Classic dropped more than expected. Ergo, the question – How do traders react to the recent price action?\n\nThe $29-support level did not hold\n\nThe recent higher low was set at $25.19 on 13 May. The price drop on 7 June, touched $25.07, but did not close a daily session below $25.19. Hence, the bulls seemed to have the upper hand on the higher timeframe, though it appeared tenuous.\n\nThe Directional Movement Index saw the -DI (red) jump above the 20-mark. It was an early sign that the trend could be shifting bearishly, as the ADX (yellow) would also need to climb past 20 to signal a strong downtrend in progress.\n\nThe CMF was at -0.09, indicating significant capital flow out of the market. This selling pressure has been present for a week. It would need to turn around for bulls to regain some hope.\n\nFutures market highlighted intense bearishness\n\nOver the past 10 days, Ethereum Classic has steadily risen from $31 to $28.6. The past 24 hours saw a flurry of selling activity spurred by Bitcoin [BTC] though. Hence, ETC fell by 14.32% in a single 4-hour trading session, followed by a bounce from $25.07 to $27.\n\nRead Ethereum Classic’s [ETC] Price Prediction 2024-25\n\nThe Open Interest also fell sharply alongside the price, showing bearish sentiment and a reluctance to enter positions due to volatility. The spot CVD continued its downtrend too. The volume indicators agreed that selling pressure was firm.\n\nThe bulls would need to change this to re-establish an uptrend on the lower timeframes.\n\nDisclaimer: The information presented does not constitute financial, investment, trading, or other types of advice and is solely the writer’s opinion."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxPWDZIb1p2clhMc2haOEktQU00NkxSeVZlenBGWUtLS2VvSk9Rb2E5U05zQmtvQ2dNUEVKWUxHV3VNeXc1X0NPZlBuTWRTSEdBVTFWOEVQRks5M1A3QUJIRmhSd0x3NnJ1cnJnT2syczZhUGFkN0pxWmRyRzVXSTgtZ3hYN0lNWGVHdkkyWkJQWThXZ9IBlwFBVV95cUxQdnpvdEd4S05WYWZ3VEprbDY3ZzJBc0dMay1ETk1fY3FVMWp4b3Q5NW1POEZ5UUd1eU5SVm9JbGlGWkFhNlpUR0JyWnRCX3lfT2hwTnRxMmFXZUc4VTg2SWxpWXpEQmdJUE03Q1ZSODJoYVlUdHYwMTAyandvSUkzbUxBbVByelJIVUFxaDJwV1dTaHU3OEFN?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Jun 2024 07:00:00 GMT",
        "title": "Ethereum whale’s $56M sell-off could have THIS impact on the market - AMBCrypto News",
        "content": "A major whale sold part of its ETH holdings\n\nAltcoin’s price fell, while Ethereum’s network growth declined too\n\nEthereum [ETH]‘s price registered a massive hike over the last few weeks, one fueled by news of new spot ETFs for ETH. Despite the optimism around the network, however, a large whale recently decided to sell its holdings.\n\nWhales shy away\n\nOn 8 June, a significant transaction occurred on the Ethereum blockchain. A major whale transferred 15,200 ETH, worth approximately $56.47 million, to Kraken. This particular address received massive holdings of 67,000 ETH directly from the Ethereum Foundation. It is further believed that this same address also received an initial 200,000 ETH during the Ethereum Genesis block, likely signifying participation in the ICO (Initial Coin Offering) that launched the Ethereum network.\n\nHere, it’s worth noting that despite this recent transfer, the wallet still holds a balance of 41,000 ETH – Valued at approximately $151 million.\n\nThis large transaction may be interpreted by some investors as a sign that the whale is losing confidence in Ethereum’s future, prompting it to sell its holdings. This fear-based selling could trigger a domino effect, driving the price down further.\n\nAdditionally, the unknown purpose behind the transfer can spur further uncertainty.\n\nHow is ETH doing?\n\nAt press time, ETH was trading at $3,683.83, with its price down by 3.14% in the last 24 hours. Despite this sudden dip in ETH’s price, however, the overall trend of the price movement looked relatively positive.\n\nAnd yet, the network growth for ETH declined significantly over the last few days, implying that new addresses were losing interest in ETH and were not ready to buy ETH at the current rate. If the price dips further, there may be a chance that ETH may begin to look lucrative to new investors in the future.\n\nCoupled with the declining network growth, the velocity at which ETH was trading also fell materially.\n\nIn terms of overall activity on the network, gas usage on the Ethereum network declined over the last few days. Additionally, the overall NFT trades on the network plummeted as well.\n\nThe lack of activity on the Ethereum ecosystem can be detrimental to both the the network and the price of ETH in the long run.\n\nIs your portfolio green? Check the Ethereum Profit Calculator"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxOUE9Rc3FyMTZUMzVxVlpsejY3QlFaVmM3LXVxR1FTV1huUmhfYnZQNzdWSjV2ajJzVVRvRlBpSDdTSGx2ZEZKWjAtNkp0cmltUGlMQ05UU1dxdFlOV19NckVHdW9YWC1fUW1HNXczRzlKM1pfN2NUZVlXN3hORjd4S1ctUDdlZ9IBjgFBVV95cUxPWmExNGFicWJGUGpEc0EtT0x2cC1TZWstWTdxcjctOHh3Ykx2aV81UFU2emI4UkNHRDU5Y3U1QnI5Q2drQVZqdFgxd1BIbFhtRXZwNXk5TzZicUxzN2RGZXFOM2xLem4zYnk0VjFyY3d3U2tBUWdnejRxZE5FcnBHeE83cmIzeEZGdW1udGJR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Jun 2024 07:00:00 GMT",
        "title": "This Week in Coins: Bitcoin and Ethereum Pump—Then Dump—Amid Roaring Kitty Rush - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIllustration by Mitchell Preffer for Decrypt.\n\nBitcoin and crypto investors received a lot of good news this week, even though the market still can’t manage to break free from its highs three months ago.\n\nOn Tuesday, the US Bitcoin spot ETFs absorbed net inflows of $887 million—the second-best daily performance for the ETFs to date. The price of Bitcoin surged above $71,000 in the process, reaching its highest price since March.\n\nThat performance was followed by not one, but two high-profile Bitcoin ETF sponsors assuring investors that a second, much larger wave of institutions was coming to buy Bitcoin through the funds. Bitwise CIO Matt Hougan wrote in a memo that crypto regulatory progress on Capitol Hill was untapped “alpha” for investors, while Franklin Templeton CEO Jenny Johnson said the ETFs had only been touched by their “first wave of the early adopters.”\n\nAD\n\nAD\n\nJUST IN: Franklin Templeton CEO on #Bitcoin ETF adoption says “This is really the first wave of the early adopters. …the next wave is the much bigger institutions.” WATCH👇 pic.twitter.com/G52jWUEetX — Bitcoin Archive (@BTC_Archive) June 5, 2024\n\nAnd at least in the memecoin world, the bull market appeared to be back in full swing. Bitcoin’s very first BRC-20 token, ORDI, surged by over 30% to $60 as of Friday, while PUPS and Bitcoin Wizards (WZRD) more than doubled in value intraweek, according to CoinGecko data.\n\nOther more popular memecoins like PEPE, BONK, and SHIB weren’t as lucky, all posting losses this week.\n\nThe Solana-based meme coin GME seriously spiked, blasting up 467% at its height this week, building on the momentum of its stock market namesake Gamestop (GME). Meme influencer Roaring Kitty—who sparked the Wall Street-confounding GameStop movement back in 2021—gave the stock a second wind with his surprise returns to both YouTube and live streaming, with his net worth briefly edging toward $1 billion—before a Friday cold shower from the game retailer.\n\nPerformance-wise, between Bitcoin and meme coins is Ethereum, which kept pace with Bitcoin’s gains this week as its progressed toward a spot ETF launch. VanEck analysts posted a lengthy report arguing that ETH will reach $22,000 per unit by 2030, after sucking away financial market share from Apple, Google, and big banks.\n\nAD\n\nAD\n\nFinally, with both the Bank of Canada and European Central Bank lowering interest rates this week, BitMEX co-founder Arthur Hayes told followers that it was officially time to start apeing into Bitcoin and shitcoins.\n\nYet his call may have been a tad premature: at the end the week, a liquidation cascade on Friday sent Bitcoin crashing from $71,000 to $68,000, and ETH down from $3,800 to $3,600. Meanwhile, GME—both the stock and the memecoin—cratered by over 35% each.\n\nRoaring Kitty is the greatest business communicator since Steve Jobs. Dude shows up 30 minutes to the livestream. Builds the tension up to 11. Shows up on the livestream in a fake bandage and cast. And the first thing he says is “oh shit”. pic.twitter.com/YlTesdxJGB — Trung Phan (@TrungTPhan) June 7, 2024\n\nBitcoin is trading for $69,335 as of writing, while Ethereum is priced at $3,686. The price of the GME meme coin has once again settled near $0.014.\n\nPrices current as of 3am ET on June 8, 2024. Edited by Ryan Ozawa."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPdHQ3UWY4VTUtMnR1eUhhcjVKLWdWU2YtMWo4WmJOd1VXQzlXRE1vcXVHZTBMZmlSWUlIQXoweV9xaTh4Z09EbEVkV2ZMUFNlak9CTnI5RUZBeFRJb3A4WlBMWFo3U0NDQTV3QVVSUXVEUzdGZHFfU0otNXpsTTJmZkpjUGNobHdrZjNtaGRGZGt4bTA5dURvNdIBngFBVV95cUxNTlk2NVZfVTlNb0RmOExWUjRwMFpjQXl1dHQ0andwUWsyZExlcWtRLWtzaTBoZEtpZklFajZ3UWVZMmxaR0VEZDR0NDh2T21Zb1BSVFNBWWMwbGgxOWpFTDRLWWU0a3pmRmdEdHFjVzNVOC1tdENVSUxmRHVMa0NJR2R4UXlSZzJ5dVAtdWR4UFp0M2o5TDdUUlBPcGZPUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Jun 2024 07:00:00 GMT",
        "title": "What Historical Trends Hint for Ethereum Price Behavior in June? - CoinGape",
        "content": "Ethereum Price: Over the past two weeks, the second-largest cryptocurrency Ethereum witnessed shrunk volatility carrying a consolidation trend above $3600. The daily chart projecting short body candles and rejection on both sides indicates a lack of direction among market participants. Will the BTC price drop below $70000 push a prolonged correction in the altcoin market?\n\nAlso Read: Crypto Prices Today June 8: Bitcoin & ETH Take Bearish Turn, Wormhole & INJ Pump\n\nadvertisement\n\nEthereum Price Defend Key Support Amid Broader Uncertainty\n\nDuring mid-May, the Ethereum price rebounded sharply from the $2860 support indicating the investor continued to accumulate this asset at market dips. The renewed buying force uplifted the ETH value by 39% to reach a 10-week high of $3975.\n\nHowever, with broader market uncertainty the recovery momentum in Ether stalled resulting in a sideways action above $3630. This support coinciding closely with the 20-day EMA slope and 23.6% Fibonacci retracement level creates a high area of interest for buyers.\n\nThe notable rejection of candle tails at this support indicates the buyers are defending this support. For risk-averse traders, a breakout above the overhead resistance of $4090 will give a better confirmation of a prolonged rally.\n\nWith sustained buying, the Ethereum price prediction hints at a rally to challenge the ATH (All-time-high) resistance of $4880.\n\nOn a contrary note, a breakdown below $3630 will accelerate the selling pressure and may extend the current correction for a week or month.\n\nAlso Read: Crypto Market Selloff: Here’s Why Bitcoin, ETH, SOL, XRP, DOGE Prices Slips Today\n\nHistorical Trends Show June’s Mixed Fortunes for Ethereum\n\nEthereum’s price performance in June has shown significant volatility over the past years, with both notable gains and sharp declines. The largest drop occurred in 2022 with a steep decline of -44.79%, while the highest gain was in 2017 at +26.19%.\n\nOn average, June tends to yield negative returns, with an average of -6.76% and a median of -2.53%. This negative bias suggests that June is often a challenging month for Ethereum. However, the data also hints at the potential for sharp reversals, as seen in the positive return of +8.86% in 2019 following a significant drop of -21.34% in 2018.\n\nThese variations are likely influenced by broader market conditions, including macroeconomic factors and regulatory news. Given this historical performance, investors might approach June with caution.\n\nHowever, with steady development for the launch of Spot Ethereum ETFs, the market is better leaning in buyers’ favor.\n\nTechnical Indicator\n\nExponential Moving Average: The Ethereum price trading above the daily EMAs (20, 50, 100, and 200) indicates the path to least resistance is upward.\n\nAverage Directional Index: The downtick in ADX slope at 33% indicates the current consolidation could assist buyers in recuperating exhausted bullish momentum.\n\nRelated Articles\n\nSahil Mahadik Sahil is a dedicated full-time trader with over three years of experience in the financial markets. Armed with a strong grasp of technical analysis, he keeps a vigilant eye on the daily price movements of top assets and indices. Drawn by his fascination with financial instruments, Sahil enthusiastically embraced the emerging realm of cryptocurrency, where he continues to explore opportunities driven by his passion for trading\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE5rM2lpQUl6dWtITFAzTjM3aDlPZWZIem1UMnNhbFFMMy1Ub2FwMkx4ZEZZaUhuV0M3dUtfdjkyWVhOV2oxai1hejBidTNaSWdvbHY1RmlTdXBHMDc4SUp3LVpzYzhEdkFOYU9UeWFsMWE5MTF3T3JfTFhGUVk2d9IBhgFBVV95cUxQa19lbzBIMkNCcVB5YlRtVHMycXpycnBQVW5VYzExa0NKcG5yZDluTUkwU08xSHE1d3VSeC1Mdko1T1NWOVc5QzVvbDA3cEMxbFphazcxZnJORnpCNHZPbGRmWEYxZlNlV1FQRW5jTnhNazdCWk8yMVJKWkdPRlNkRHQ4Ui1qUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 08 Jun 2024 07:00:00 GMT",
        "title": "Why Ethereum Layer-2 Network Taiko Is Spending $100K Daily on Blobs - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAn Ethereum layer-2 network named Taiko is dominating the market for so-called blobs, or dedicated data storage for Ethereum scalers—but those endeavors are resulting in tens of thousands of dollars worth of costs for the little-known scaling solution each and every day, even topping the $100,000 mark multiple times this week.\n\nThe Taiko protocol, which went live in late May, seeks to offer users cheaper and faster transactions than on Ethereum's mainnet, while borrowing elements of the network's security. Since going live, Taiko has spent a whopping $900,000 on blobs in less than two weeks to funnel users’ transactions over to Ethereum’s network.\n\nMeanwhile, Taiko’s competitors, such as the Optimism network, rarely spend more than $1,000 per day on Blob-related fees. Introduced in March as part of an Ethereum upgrade, blobs were billed as a new resource for layer-2 scaling networks to post Ethereum transactions more cheaply.\n\nThe protocol’s maker Taiko Labs announced in March that it had raised $15 million in a Series A funding round. Leveraging “zero-knowledge” cryptography in its design, Taiko is striving to differentiate its scaling design in an increasingly competitive field that includes dozens of different scaling networks.\n\nAD\n\nAD\n\n“Taiko just launched its mainnet, and there’s a lot to be figured out before it becomes stable,” Taiko Labs CEO Daniel Wang told Decrypt in a written statement. “We knew that we will use more blobs than other layer-2s. This is a design decision, not a bug.”\n\nLayer-2 networks often work by bundling batches of transactions together and processing them on a separate chain before posting receipts back to Ethereum. However, Taiko’s design differs from that formula, where lots of transactions are rolled up into batches elsewhere.\n\nInstead, the process of ordering transactions, known as sequencing, takes place on Ethereum itself. In a blog post, Taiko Labs said this process, dubbed “base sequencing,” is more decentralized than that of other layer-2s that rely on centralized sequencers—which are controlled by a network’s development team and collect a small portion of users’ fees.\n\n“That sounds expensive,” Alexei Zamyatin, the co-founder of Bitcoin layer-2 network BOB, told Decrypt in an interview. “It makes it more secure, but not as secure as [Ethereum], and you’re also much more expensive than most layer-2s.”\n\nAD\n\nAD\n\nA game of tradeoffs\n\nStill, Wang stated that the costs associated with Taiko’s functionality could easily reach the point of break-even if “Taiko is fully utilized by users,” providing a sustainable amount of gas fees.\n\nWang added that Taiko is fully aware of the pros and cons associated with its sequencing method, and he hopes that Ethereum researchers will study Taiko’s on-chain data to explore improvements that could allow Ethereum to better support similar scaling networks.\n\nSome Ethereum researchers, including Justin Drake, believe that Taiko’s team is trailblazing a new form of decentralized sequencing that could solve key hurdles in Ethereum’s ecosystem.\n\n“It is making a leap forward in the decentralization, credible neutrality, and composability of rollups,” he told Decrypt in a written statement.\n\nIf more layer-2 networks shifted the sequencing of their transactions to Ethereum itself, then fragmentation issues holding the entire space back could be solved, he stated. As of now, liquidity and assets are largely spread out across different layer-2s, effectively siloing users and applications within a given scaling solution while all being tied to Ethereum.\n\nWhen it comes to layer-2 networks on Ethereum, the introduction of blobs represented a significant shift in how those protocols interact with the underlying blockchain. Before blobs were available as a separate fee market, layer-2s could only post bundled transactions in the form of Ethereum “calldata,” a space for data to be contained within transactions.\n\nInstead of trafficking users’ transactions in bulk alongside regular Ethereum activity, blobs serve almost as a dedicated lane on a highway, where less congestion can reduce costs. However, the best way to package those transactions before they’re shipped is still up for debate.\n\nBlobs blobs blobs\n\nIn some cases, centralized sequencers can be leveraged to grind a network to a halt, puncturing the veil of permissionless activity that is synonymous with crypto. Sometimes, centralized sequencers can be abused to delay transactions too. However, Taiko’s commitment to decentralization may not be the most efficient, according to one of its community advocates.\n\nAD\n\nAD\n\n“Sadly, it’s kind of expensive,” the pseudonymous crypto researcher arixon.eth said on Twitter (aka X). “Because of based sequencing, we need to post a blob every 12 [seconds], and if there aren't enough [transactions], then we just won't fill the blobs.”\n\nBecause of based sequencing, we need to post a blob every 12s and if there aren't enough txs then we just won't fill the blobs Sadly it's kinda expensive, so we really need based preconfs — arixon.eth (@arixoneth) June 1, 2024\n\nWang of Taiko Labs said changing this pace could be a potential solution enacted soon, stating that Taiko’s community is “considering lowering the block proposing frequency a bit.”\n\nThe constant stream of blobs, regardless of how full they are, has made Taiko a top user of them. On Sunday, for example, Taiko posted 25% of all blobs on Ethereum, according to a popular Dune dashboard. That day, Taiko spent nearly $63,000 on blob-related fees.\n\nOn Thursday, Taiko paid $123,000 in fees for blobs—representing 73% of all costs paid for them across layer-2s—which was its second straight day with a six-figure fee tally. And while most layer-2s pass cost savings onto their users through lower fees, the premium Taiko is paying for decentralization, as of now, isn’t a bill that users need to foot.\n\n“For now, it's partially subsidized by the team,” arixon.eth said, adding that the process could be modified in the future so that “blocks are missed until there are enough [transactions] in the mempool for a proposer to push a block to [Ethereum] profitably.”\n\nAmid the network’s first airdrop on Wednesday of TAIKO tokens, the network’s native cryptocurrency, the layer-2 averaged around 6.42 transactions per second, according to L2BEAT. Meanwhile, Ethereum registered around 13.6 transactions per second itself.\n\nSo far, the performance of Taiko’s token has been turbulent. After crashing 40% an hour after it launched, to $2.27 from $3.80, the token’s price had recovered to $2.45, as of this writing, showing a nearly 3% decrease over the past day, according to CoinGecko.\n\nAD\n\nAD\n\nEdited by Andrew Hayward"
    }
]