[
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiygFBVV95cUxOa1VCVWtBODE3ekF1d3pHSkdDa21IUnViQ2tpSERRQUo4bVF2UlpSRGdqbldXT3lIeWdueF9NcEtvN0N0N2h4Q2ViTHRvWFd1dERuZnM4SjVfZVBEalItOGE1ZVZPR3FNNlA5eDhJbXp6ZnBEY1VQVURDQUlGWmhydVRNS1pFX09TcEZQaUZwNVd2SHd4dU9rTklyb29zUmRvQXVpa3VHdjRud1ZfZ3o0R084dVlLLUNodm55b1MwYnJvNUh3akZhdVFB0gHPAUFVX3lxTE5GZmNJSm5POUJPVXktUFdaY0F0Wm5tQThmWVZWSjhfY3l5UkM3WVA5aXJkX3RxdXgxRTRzRkFkS24xbVdtTThtVGdETHBqZzJSRGNTRFRKYWRZbmZpd3lCQ1pVWXFDcVdZMzJGZHNCekxMeXc1YkxmdDl0VDB4V18yWFkybzF5bVRRZmdVR3J5bjJJZWVPREpZQ0xIMWxSQVA1dEZVLVg3OWItMFV6SVQ1SHlKTWVxYW9QY2gtVUF2aXVTVmtzdFg1aW4wVmN1UQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Feb 2024 08:00:00 GMT",
        "title": "Crypto Custodian Taurus Enlists Lido to Bring Liquid Ethereum Staking to Swiss Banks - CoinDesk",
        "content": "“One open question that was clarified from a banking law perspective was that when funds are locked up, those funds must be available to clients at any given time,” Lavrov said in an interview. \"You could argue that is achieved by liquid staking, since funds are readily available and the token can be exchanged one-to-one with ETH. So I see a breakthrough opportunity for banks to get into solutions like Lido.\""
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxPR2J6ajY1N3BZTGlxaE5VVDRjMHkzeE96blluWGhzbDVodVBJQ2JrMW0wMlpBODExVFR1dlVvdVQzWTZra0t6ZkpJNjdCRTdIdnNfVUdUdEstN1dKSzFwVHlkSTNHdDlKRGdxMkVJaXpLTmFiY0lNdjF5MlhpTldaMWFucDlxaUYzWl9TXzh4QXFyM3Q2ZDhaSnBmUWo2RElTeGs0UGhJbXNjZGVs?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Feb 2024 08:00:00 GMT",
        "title": "Franklin Templeton files for spot Ethereum ETF, Sui and KangaMoon unveil new initiatives - crypto.news",
        "content": "Disclosure: This article does not represent investment advice. The content and materials featured on this page are for educational purposes only.\n\nFranklin Templeton has applied to issue a spot Ethereum ETF. At the same time, the launch of the AUS-Sui Blockchain Academy through a partnership between the Sui Foundation and the American University of Sharjah is in the works. So far, the KangaMoon presale is ongoing. KANG is trading for $0.005.\n\nAnother firm files to issue a spot Ethereum ETF\n\nFranklin Templeton has filed to issue a spot Ethereum ETF, allowing the company to provide its clients access to Ethereum.\n\nThe fund may also participate in Ethereum’s consensus mechanism and earn staking rewards.\n\nYou might also like: Franklin Templeton enters competition to introduce spot Ether ETF\n\nOther financial giants, such as Ark 21Shares and BlackRock, have also filed for spot Ethereum ETFs.\n\nThe U.S. SEC is yet to approve any of these applications.\n\nETH is up 14.6% in the past week.\n\nSui Foundation partners with UAE University\n\nAUS-Sui Blockchain Academy has been launched by Sui in collaboration with the American University of Sharjah (AUS).\n\nThis academy will allow developers to learn more about blockchain technology.\n\nYou might also like: Sui defi ecosystem rises to top 10 as TVL spikes above $430m\n\nThe partnership aligns with the strategic vision of the Emirate of Sharjah, which aims to become a hub for innovation and education in the field of technology and blockchain.\n\nSUI reached an all-time high of $1.81 following the announcement.\n\nKangaMoon presale growing\n\nKangaMoon is popular among meme coin enthusiasts and investors.\n\nThe project has already sold over half of its tokens in the presale, and investors are joining to be part of the upcoming community that will focus on meme coin culture, social-fi, and play-to-earn gaming.\n\nYou might also like: Analyst bullish on Polkadot and Celestia, KangaMoon rallying\n\nKANG is the utility token of the KangaMoon ecosystem and will power in-game activities and other functions.\n\nHolders can participate in weekly, monthly, and quarterly competitions to grow their holdings before the game’s official launch.\n\nThe KangaMoon project has potential due to its link to the play-to-earn NFT gaming market, which is expected to grow at a CAGR of 17.93% by 2028.\n\nConclusion\n\nInstitutional investors are interested in cryptocurrencies, as evidenced by Franklin Templeton’s application for a spot Ethereum ETF.\n\nIf approved, altcoins like KangaMoon will likely rally in 2024.\n\nThe first presale stage for KangaMoon is almost ending, and its price could increase to $0.0075."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxOYUgxNG1paVJjeV8yMFFTSHd2TXJURTUxUDN0bDZHdTNvYUNOaXY5Zk0zMkpuY0p4czVkb1ZGVWFBSnV1UGhObXBpYXRqSUVwNzk4ZjZJYlFqRElaSEZUMHZXLTZOVHVIMUp5bjRjUHh3cGdoWW5JVEpwWGRDeGRaV1BvUWxKUXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Feb 2024 08:00:00 GMT",
        "title": "$Sharbi Unleashes FETCH to Allow Users to Bridge Between Shibarium, Ethereum and Arbitrum in Seconds - Yahoo Finance",
        "content": "One year after crypto's \"Queen of Memes\" launched on the Ethereum chain, the Sharbi team is rolling out its bridge built by Solidity.io to reduce offchain bridging time from 7 days to 15 seconds\n\nAustin, Texas--(Newsfile Corp. - February 14, 2024) - The team behind $Sharbi, the top overall coin on the Shibarium chain that was recently launched by the Shiba Inu community, today announced the launch of FETCH, the first multichain bridge that connects Shibarium, Ethereum and Arbitrum. Built by Solidity.io, FETCH will reduce current offchain bridging time from seven days to 15 seconds, a massive cryptocurrency market advantage. Go to https://fetch.sharbi.net/ to view and use the bridge.\n\n\n\n\n\nSharbi\n\n\"Investors understand the frustration of having their hands tied when they recognize an opportunity but can't access their funds fast enough to capitalize on it,\" commented Andrew Rosemond, Sharbi Core Team Member and a Decentralized Autonomous Organization (DAO) Administrator for Sharbi. \"FETCH will be truly transformative for the Shibarium ecosystem, empowering users to bridge between chains in seconds, not days.\"\n\nThe second significant Valentine's Day in a row for the Sharbi team, the FETCH bridge is today being rolled out to the entire cryptocurrency community, following months of building and testing with Solidity.io, and on the heels of Sharbi's first birthday, January 25th. FETCH users are now able to bridge $Sharbi, $Bone and any tokens the DAO votes to whitelist going forward.\n\n\"Sharbi is just getting started,\" Rosemond added. \"The word is beginning to get out about Sharbi's new investment fund Boom Boom Capital, as well as the strategic partners with whom we've aligned to build the Sharbi ecosystem.\"\n\nSharbi is a fully decentralized, 100 percent DAO-controlled, pay-to-hold coin. Of note, Sharbi is also a Know Your Customer / Know Your Client (KYC) Verified Project and achieved The Verification Gold Standard® of Assure DeFi®. To date, Sharbi has distributed over $1 million dollars to holders as passive revenue.\n\nTo learn more about Sharbi, go to https://www.sharbi.net/.\n\nAbout Sharbi\n\nSharbi is a community-owned, multichain cryptocurrency built on Arbitrum, Ethereum and Shibarium. Sharbi harnesses the power of a decentralized WEB3 community and is 100 percent Decentralized Autonomous Organization (DAO) controlled. Sharbi is a Know Your Customer / Know Your Client (KYC) Verified Project and achieved The Verification Gold Standard® of Assure DeFi®. Boom Boom Capital, Sharbi's DAO investment fund, participates in exclusive seed round/pre-sale crypto opportunities, and all revenues generated are distributed quarterly. A MEME 2.0 community token, Sharbi provides ongoing USD Coin (USDC) and BONE rewards to holders. A four percent fee on every Sharbi transaction is redistributed to all holders across each chain in USDC (ETH/ARB) and BONE (Shibarium), and a one percent fee goes toward project liquidity. Sharbi also launched FETCH, the first multichain bridge that connects Shibarium, Ethereum and Arbitrum. Connect with us on Twitter (@SharbiToken) and Telegram (t.me/SharbiPortal).\n\nStory continues\n\n\n\n\n\nFetch Sharbi\n\nMedia Contact:\n\nAndrew Rosemond\n\n832-875-1414\n\nlnrcryptoatx@gmail.com\n\nTo view the source version of this press release, please visit https://www.newsfilecorp.com/release/197823"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxOYUgxNG1paVJjeV8yMFFTSHd2TXJURTUxUDN0bDZHdTNvYUNOaXY5Zk0zMkpuY0p4czVkb1ZGVWFBSnV1UGhObXBpYXRqSUVwNzk4ZjZJYlFqRElaSEZUMHZXLTZOVHVIMUp5bjRjUHh3cGdoWW5JVEpwWGRDeGRaV1BvUWxKUXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Feb 2024 08:00:00 GMT",
        "title": "$Sharbi Unleashes FETCH to Allow Users to Bridge Between Shibarium, Ethereum and Arbitrum in Seconds - Yahoo Finance",
        "content": "One year after crypto's \"Queen of Memes\" launched on the Ethereum chain, the Sharbi team is rolling out its bridge built by Solidity.io to reduce offchain bridging time from 7 days to 15 seconds\n\nAustin, Texas--(Newsfile Corp. - February 14, 2024) - The team behind $Sharbi, the top overall coin on the Shibarium chain that was recently launched by the Shiba Inu community, today announced the launch of FETCH, the first multichain bridge that connects Shibarium, Ethereum and Arbitrum. Built by Solidity.io, FETCH will reduce current offchain bridging time from seven days to 15 seconds, a massive cryptocurrency market advantage. Go to https://fetch.sharbi.net/ to view and use the bridge.\n\n\n\n\n\nSharbi\n\n\"Investors understand the frustration of having their hands tied when they recognize an opportunity but can't access their funds fast enough to capitalize on it,\" commented Andrew Rosemond, Sharbi Core Team Member and a Decentralized Autonomous Organization (DAO) Administrator for Sharbi. \"FETCH will be truly transformative for the Shibarium ecosystem, empowering users to bridge between chains in seconds, not days.\"\n\nThe second significant Valentine's Day in a row for the Sharbi team, the FETCH bridge is today being rolled out to the entire cryptocurrency community, following months of building and testing with Solidity.io, and on the heels of Sharbi's first birthday, January 25th. FETCH users are now able to bridge $Sharbi, $Bone and any tokens the DAO votes to whitelist going forward.\n\n\"Sharbi is just getting started,\" Rosemond added. \"The word is beginning to get out about Sharbi's new investment fund Boom Boom Capital, as well as the strategic partners with whom we've aligned to build the Sharbi ecosystem.\"\n\nSharbi is a fully decentralized, 100 percent DAO-controlled, pay-to-hold coin. Of note, Sharbi is also a Know Your Customer / Know Your Client (KYC) Verified Project and achieved The Verification Gold Standard® of Assure DeFi®. To date, Sharbi has distributed over $1 million dollars to holders as passive revenue.\n\nTo learn more about Sharbi, go to https://www.sharbi.net/.\n\nAbout Sharbi\n\nSharbi is a community-owned, multichain cryptocurrency built on Arbitrum, Ethereum and Shibarium. Sharbi harnesses the power of a decentralized WEB3 community and is 100 percent Decentralized Autonomous Organization (DAO) controlled. Sharbi is a Know Your Customer / Know Your Client (KYC) Verified Project and achieved The Verification Gold Standard® of Assure DeFi®. Boom Boom Capital, Sharbi's DAO investment fund, participates in exclusive seed round/pre-sale crypto opportunities, and all revenues generated are distributed quarterly. A MEME 2.0 community token, Sharbi provides ongoing USD Coin (USDC) and BONE rewards to holders. A four percent fee on every Sharbi transaction is redistributed to all holders across each chain in USDC (ETH/ARB) and BONE (Shibarium), and a one percent fee goes toward project liquidity. Sharbi also launched FETCH, the first multichain bridge that connects Shibarium, Ethereum and Arbitrum. Connect with us on Twitter (@SharbiToken) and Telegram (t.me/SharbiPortal).\n\nStory continues\n\n\n\n\n\nFetch Sharbi\n\nMedia Contact:\n\nAndrew Rosemond\n\n832-875-1414\n\nlnrcryptoatx@gmail.com\n\nTo view the source version of this press release, please visit https://www.newsfilecorp.com/release/197823"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE00T05ZSGxFWWw3a3RMYUhjUU9rSXlXSk5Wb1JWYW9lTU5mSjExUGZsNUdUU21QYy0yaXA1a1JwNF9jU1djNmNoYTFNUW1rM3dOSlEyUXFoc0tSTEFXZHdVdFV5SkJ4V2htT0otcjNueHVXSk45dVp3bkF5UGlUZ9IBhgFBVV95cUxPWklEOUFTZVN5U3NrTW9ydFF3ZmNYX2Vxb0Z4Wkt0YWIzWEk2bnRiSWNaUjA3aV9uUVJLcDdpN3pCTzBwNGh1b0pRRVFYZi1udW9vUHI1VU05WlZxOHdwNDZUZmNjREdnNVZJOWVfQThFV3EzUU5UOWt0SUthNGpzT1VuSlh1Zw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Feb 2024 08:00:00 GMT",
        "title": "Points Season: Who's Winning the NFT Marketplace Wars on Ethereum, Solana, and Bitcoin? - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe “points” meta has overtaken the crypto space as of late, and NFT marketplaces across Ethereum, Solana, and Bitcoin are jumping on the bandwagon (and in some cases driving it) in an attempt to win the hearts, minds, and wallets of traders everywhere.\n\nWill points translate to token airdrops? Will the NFT market return to its former glory? And if so, which company is in the best position to win the NFT marketplace wars? Here’s how things are shaping up so far:\n\nMagic Eden is the latest NFT marketplace to try and lure in users through points-like loyalty models that could pay off with a token drop or other rewards. The marketplace recently launched its Diamonds rewards system, which includes a retroactive drop of rewards to Solana traders dating back to 2021.\n\nEthereum marketplace Blur pioneered the points model, and it was this time last year that the upstart platform dethroned longtime leader OpenSea by dropping hundreds of millions of dollars worth of BLUR tokens to its most loyal users. By the end of the year, Blur had given away $818 million worth of BLUR tokens after users racked up points.\n\nAD\n\nAD\n\nTensor, the leading Solana NFT marketplace, has employed a similar points-based loyalty model, and similarly overtook leader Magic Eden last year—but Tensor still has yet to launch its crypto token. To be clear, Tensor has yet to officially announce a token airdrop tied to the points, though it has teased such sentiments in the past.\n\nMagic Eden’s launch of its Diamonds system—starting on Solana, but expanding to Bitcoin, Polygon, and Ethereum soon—signaled an apparent attempt to catch up to Tensor. Similarly, we don’t know yet what Magic Eden’s points-like Diamonds will actually be used for, though there’s also a separate NFT token drop coming in parallel with the rewards system.\n\nIs Magic Eden’s rewards shift paying off in terms of boosting its market share? So far, not really.\n\nMagic Eden briefly saw a Solana surge that suggested it was making up ground on Tensor. On February 5, Decrypt observed that market data from analytics platform Tiexo pointed to Magic Eden claiming a 41% share of Solana NFT volume over the previous 24-hour period, compared to 53% for Tensor. That was much closer than it had been in recent weeks.\n\nAD\n\nAD\n\nHowever, as of this writing, Tensor commands about 73% of Solana NFT market share over the past 24 hours, per Tiexo, compared to just 22% for Magic Eden. Zooming out a bit, there isn’t a significant shift over the past weeks. In the last seven days, Tensor has over 75% share compared to 19% for Magic Eden; in the last month, Tensor claims over 73% with Magic Eden at less than 22%.\n\nImage: Tiexo\n\nExpanding the data to include platforms across several major NFT chains, however—including Solana, Ethereum, Bitcoin, Polygon, and BNB Chain—reveals some other interesting details about how rewards models are further reshaping the marketplace wars.\n\nLooking at the broader landscape, Blur rules the market by a wide margin, commanding about 42% market share over the past week. That’s entirely on Ethereum mainnet, still the leading blockchain for NFTs, and Blur’s existing token and history of sizable airdrops to users appears to be propelling its continued dominance.\n\nTensor is second overall with about 14.5% market share among tracked networks, all on Solana, followed by Magic Eden with 14%—with the majority of that volume coming from Bitcoin Ordinals sales.\n\nOpenSea, which has no points system and has long resisted calls to launch its own token, lands in fourth with about 12.4% share, primarily on Ethereum and scaling network Polygon. Bringing up the rear is OKX’s marketplace for Bitcoin Ordinals, which are similar to NFTs, with about 7.7% market share.\n\nTiexo’s 24-hour data shows some deviations due to the smaller sample size, with Blur holding an even larger share at 52.5% and Magic Eden up second with just under 12%—but the majority of that volume is on Bitcoin, likely due to Tuesday's sale for the Bits gaming project. OpenSea, Tensor, and OKX bring up the rear, in that order.\n\nImage: Tiexo\n\nMagic Eden is readying a significant push on Ethereum with the launch of a new marketplace for that chain, created in partnership with Bored Ape Yacht Club creator Yuga Labs. Set to debut on February 27, the marketplace has also set alliances with the teams behind major Ethereum projects like Pudgy Penguins and Azuki.\n\nWill the launch of Magic Eden’s new Ethereum marketplace, with associated Diamonds rewards, help turn the tide and provide a sustainable boost as it battles rivals? We’ll see later this month, as it’s the next big shift on the horizon—although the NFT world is ever full of surprises.\n\nAD\n\nAD\n\nEdited by Guillermo Jimenez"
    }
]