[
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMi7wFBVV95cUxQM2JkcTB2RVJMMC1ZSlV0anNRMzJHM2REamhBVWxaTVlQamN2MUp1SHVBQm5YaHBMZHJiRzl5QmQ3MGloU0tNeUc4clhLWVVFa1BDbEg5NTFzVDVWX3FXY05RVjlBWWp2RHFFT3NKSi1oR09QeGpwTGc2LWUyeDJENjQyNmdJV3RQak8xWkhZT1g5dGFBbnpUZWdpbklmX0lQZENlTUxHeV9QOGlTQjZjTDg3anJYR1ByODRES2pyT0h1Q1N4Zm05LU9uM2xGY040UGNSQWM4amV3SW1RN2hYUTUtcWszZlJGUXd0WUp2ONIB_AFBVV95cUxOcTBERzdLSExiTE13MWYyRi1ZLUZ3U3VWdzVCSENuMnNLdDJhbkdaMkNuZl9oVXVEYmlPVTFQeG56LWlwNVd3VWhJQ3Bjd2pvRXM2dzJFc2lLUjBoMTF3Vk10VDhmRnhoNmp3NVpqeW8zRDl0Ml9lREdPNDZSMkpDYWdnLVF3MV9Md0ZnN2hVdE90azBTQnBScDFvTGtYbW9jcWJJOXBmMUVJWG1OVGVjRkpuZURJa0o0X3VlaVNuWmNzcjNHc192ci04RnRqaVByVnZfemszMGdhdG5Ed0E0MXdwcXFWM2V5X3l1Nkk0VHR1c3hCemRmM1hvenQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jan 2024 08:00:00 GMT",
        "title": "Analyst Eyes 786% Ethereum Growth; Render and Borroe Finance Rises as Key AI Crypto Contenders - Analytics Insight",
        "content": "Following the analyst who shared his beliefs on X, ETH could reach a minimum of $10,000 in 2024 and a maximum target of $20,000. As of the time of his post, he envisaged a potential growth of 786%. While his projections might appear wild, his perspective aligns with current happenings in the space. As of this writing, ETH had risen past the $2,400 resistance level and sold for $2,543.06."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxNcy02VTgxYWt1TWZhUWxPemlidy1zdldrWDhNbEZBMnZUcTFGNVc2QTlPWUh0cmM0X254RUFwenZGck9vaTU1Yjl0ZXdJNzByd1llMDB1QlFrX2kyeXNJMU1CYldSUTF2cW5BdXBRWXdqY3hqemFWRlhJWkNpVVhsZzQ1ZmhvNVU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jan 2024 08:00:00 GMT",
        "title": "Total value locked in Ethereum surges 230% as ETH targets $3k - Finbold - Finance in Bold",
        "content": "Ethereum (ETH) has reached yet another remarkable achievement, dominating decentralized finances (DeFi) total value locked (TVL) by 80%. Meanwhile, its native token, Ether, aims at the $3,000 price zone, threatening a short squeeze soon.\n\nRemarkably, the total value locked on Ethereum’s first layer surged 231% in the last 24 hours to $100.31 billion. This sums up to recent increases, resulting in 255% and 283% changes in the last seven and 30 days, respectively.\n\nTotal value locked on the top 5 DeFi chains. Source: DefiLlama\n\nIt is worth mentioning that the above data, retrieved by Finbold from DefiLlama, does not include Ethereum’s second layers. For example, Arbitrum (ARB) has its own $2.62 billion in total value locked, ranking fourth among the DeFi chains.\n\nEthereum’s 80% dominance on DeFi by total value locked\n\nInterestingly, Tron (TRX) holds the second place with over 13 times less TVL than Ethereum, with $8.063 billion.\n\nIn this context, Ethereum layer-1 now dominates the DeFi ecosystem with an impressive 80.62% TVL dominance. Tron gets a share of 6.23%, mostly on stablecoins, while BNB Chain (BNB) and Arbitrum have over 2%. Solana (SOL) is the fifth most valuable DeFi chain with a $1.34 billion TVL and a 1.04% dominance.\n\nPie chart: Total value locked in all chains. Source: DefiLlama\n\nEthereum’s total value locked is distributed among 1004 DeFi protocols, contributing to its ecosystem.\n\nEthereum price analysis\n\nMeanwhile, ETH is trading at $2,554 per token by press time, slightly up 2% in the last 24 hours. Ether reached $2,714, its highest price of 2024, so far. On the other hand, $2,140 was the lowest for the first month of the year.\n\nETH/USD 4-hour price chart. Source: TradingView\n\nEthereum has around $307.09 billion of market capitalization at these prices. This is three times more than its DeFi ecosystem has in total value locked, evidencing how meaningful its dominance is among other chains.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNdEpmT0RuX2thaWpIal9jMzk4SGpjVWJyaDhvSXo0STZkNEJ1YU10aUNWcFh0dU5NcDJuQmE2OE8ySW04VFdvQ25UcG01LWpLNEVRMnl2c01xWm5uOEtCTUh4VXdjQmRnajFqS3oydGU4aUt0M21Mb1JlU2ZHY1lMY2FLR1BrR1BuY3Y3UNIBlAFBVV95cUxQeDJpUms4ckNjZmFseEVtNG4yNVExN0c4UzRlS2JRbUlUQXc3Q29EVFNBVjFyS19mLTlEVV8tTmYxbWNLMGh0dXZ4TjBqT3NVRURRQV9Hb0xvUHBWdVo5R3ItMWkxQTJDaWZ0V2M0NEg5eUNhM1Z1cUZwUm1GemxZZjdWbUZDcFFsSlhfMWJmR09iY0lJ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jan 2024 08:00:00 GMT",
        "title": "'Dookey Dash' Gets Free-to-Play Reboot With Token Rewards for Ethereum NFT Owners - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEver wished you could run endlessly through a sewer? Soon you’ll be able to—again—as Bored Ape Yacht Club maker Yuga Labs is bringing back its Dookey Dash game in a new free-to-play “Unclogged” edition thanks to a collaboration with game studio Faraway.\n\n“Looks like Curtis needs to get the plunger out, there’s something in the toilet,” a post from Yuga Labs reads.\n\nThe crypto startup will bring Dookey Dash back sometime this quarter, according to the post. In the single-player original Dookey Dash, gamers had to race through a 3D sewer tunnel as an ape riding a vehicle underwater to gain as many points as possible while avoiding obstacles that, if hit, would eliminate them from the game.\n\nUnlike the first release—which required a Sewer Pass NFT on Ethereum, granted free to Bored Ape and Mutant Ape NFT owners—anyone will be able to play the sewer-themed endless runner.\n\nAD\n\nAD\n\nToken benefits for BAYC, MAYC, Kodas, BAKC, and HV-MTL. pic.twitter.com/4RHnb2tKtN — Yuga Labs Gaming (@yugalabsgaming) January 16, 2024\n\nDookey Dash saw quite a bit of competition during its previous launch. Back in February 2023, the pro Fortnite player known as “Mongraal” won the first version of Dookey Dash with the highest score—and sold his winning NFT key to billionaire Adam Weitsman for $1.63 million.\n\nThat said, those who do hold Yuga Labs Ethereum NFTs like Bored Apes, Mutant Apes, Kodas, Bored Ape Kennel Club dogs, and HV-MTL Forge NFTs will be eligible for “token benefits,” according to the company. The trailer posted to Twitter shows ApeCoin logos, suggesting the Ethereum token for Yuga’s Bored Ape ecosystem will be given out as rewards. However, a Yuga Labs representative would not confirm that detail.\n\nThe new Dookey Dash: Unclogged game will be released for iOS, Android, Mac desktop, and Windows desktop users—suggesting it won’t be a web browser-based game like before. Mobile and desktop app-based games tend to run more smoothly and securely than browser-based games, so this is a win for fans of the stinky original.\n\nAD\n\nAD\n\nA Bored Ape and gaming influencer known as The Fortnite Guy or “TFG,” who was part of the latest Dookey Dash playtest and Yuga Labs’ gaming council, added Tuesday that the game is slated for a mid-February launch and that select Yuga NFT holders may get more NFTs via the game.\n\nTFG showed a video that displays different playable character skins, new game vehicles, a leaderboard, and purchasable in-game currencies in the new upcoming game version. Yuga Labs’ official gaming account on Twitter shared TFG’s video.\n\nThe new version of Dookey Dash appears to offer “Coins,” “Boosters,” “Energy,” “Skip-It” passes, and other items available for purchase using fiat currency. TFG also stated that coins can be earned by playing the game.\n\nDOOKEY DASH IS BACK!🤯 I've been invited to the @YugaLabsGaming council to playtest, create content, and work alongside the Yuga team to improve the game ahead of launch!🙏 There is SO MUCH new information about the game and I created a full length video discussing the updates… pic.twitter.com/MLFqaEw8e0 — TFG (@TFGmykL) January 16, 2024\n\nThe video also shows a new “Sewer Rank” system to show the game’s different competitive tiers. There’s Amateur at the bottom, followed by Semi-Pro, Professional, All-Star, Champion, Hall of Famer, and GOAT listed as the game’s ranked tiers, each with a different respective “boost” percentage. Players will be able to select different boosters before the game starts, with options like a “slow booster,” a “magnet booster,” and a “power shart,” for example.\n\nPresumably, the slow booster slows down the game to make it easier to navigate the cramped tunnels, while the magnet pulls in desirable items for the player to collect, and the “power shart” is… well, mostly likely Dookey Dash’s version of a very putrid nitro boost through the cartoonish game world.\n\nThe game’s updated version and re-release appears to be an effort to draw in the broader crypto community. Hopefully, this new version won’t suffer from quite the same levels of reported cheating and boosting as its original.\n\nEdited by Andrew Hayward\n\nAD\n\nAD"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxOcmlLTWxGTGxzMEZpa1VBOWFhWmRRY01idEVwLWxrczk2eWZGbXJMMktKNmxkQ3hWelcyaEVlM294THVyUnBMaEJvTy1sZ0dud0FYLTM4OW03ekc1UFpaNmY4bWdGeEpWVEJ5ZkVqb29TNGh4SEM5VWw2RUFaR0xhU08xd0VRZ2hORFRibUJlUTFsSkRkT0xaZS1XVkx6Z0h2ZDNpY1NKaGRaTVNyMGfSAbMBQVVfeXFMTkRwSUZXQkhaOTB1bHFab3l1Um4xbVRFdGViczBNVFpwNEtfMjJ6N3JYa1ozNXdkaUJpQ1JHblBaRlJjS19ubzl3SDhxcndKVGJEcnFqZXRkNkZrNlVqWWZCd0ktLTg2QXJ0RXl5cU5QUmpUOU82TklqVEJvZ2liekxoT3M0ZGRvaU5EYzdOMEU2S014bHRCdEhicW9NbF9ybVhHdW1vdmJ6aHdCdmVJdHZYUjQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jan 2024 08:00:00 GMT",
        "title": "Shiba Inu (SHIB) Becoming Bullish, Ethereum (ETH) Price Screams Rally Continuation, Bitcoin (BTC) Not Giving up Market Dominance - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nShiba Inu currently displays an ascending triangle pattern on the SHIB/USDT chart. This technical formation is widely recognized and could be a signal to a significant price surge for the meme.\n\nAdvertisement\n\nAn ascending triangle is characterized by a flat upper resistance line and a rising lower support line. This pattern suggests that buyers are gradually gaining ground against sellers, as each dip is bought up at a higher level than the previous one, indicating accumulating pressure for an upward breakout.\n\nSHIB/USDT Chart by TradingView\n\nFor Shiba Inu, which has been lingering in a period of relatively nonexistent activity, this pattern could serve as massive fuel for volatility in the near future. Recent market conditions have seen a decline in interest toward legacy meme coins, with SHIB being no exception. The lack of significant developments within the Shiba Inu network has contributed to the muted activity around this cryptocurrency.\n\nIn contrast, the majority of the action in the meme coin sector has been taking place on the Solana network. This platform has become a hotbed for the deployment of new meme coins, which are exhibiting far greater volatility than those on the Ethereum network, where Shiba Inu resides. The brisk activity on Solana contrasts sharply with the sluggishness observed in Ethereum's meme coin space, drawing in traders and investors looking for quick gains and high excitement.\n\nEthereum's correction is temporary\n\nThe Ethereum market is currently exhibiting a correction, and there are patterns that suggest a rally may not only be on the horizon but could also be in continuation. The asset has recently experienced a sharp downturn, movement that is readily apparent on intraday timeframes. However, such stark movements are often precursors to reversals, signaling that Ethereum could be gearing up for an upswing.\n\nA closer look at the charts shows Ethereum's price action respecting a series of key technical indicators which, together, build a case for potential upward momentum. The asset has been tracing back to touch base with its moving averages, a behavior that is typically followed by a rebound, as these levels can act as dynamic support zones.\n\nThis corrective phase is noteworthy, especially considering the robust rally Ethereum enjoyed in the preceding weeks. Corrections are a natural and healthy part of any asset's price trajectory, allowing for consolidation before the next leg up. For Ethereum, the current pullback could be shaking out weak hands, setting the stage for a stronger rally propelled by a more committed investor base.\n\nBitcoin's dominance not going anywhere\n\nAfter a brief breach below the 50-day EMA — a critical indicator of medium-term market sentiment — Bitcoin has clawed its way back above this pivotal level. This move indicates a bullish signal for market observers, suggesting that Bitcoin is not yet ready to relinquish its market dominance.\n\nHowever, the ascent above the 50 EMA has not been met with the kind of vigorous momentum that bulls would hope for. The growth has been moderate, hinting that Bitcoin might encounter selling pressure as it ascends. This is not unusual on the crypto markets, where significant moves often face immediate resistance as traders take profits and skeptics cast doubts.\n\nThe recent price action has been a roller coaster for Bitcoin, which saw its value tumble from highs around $47,000 to lows near $41,000. This downturn briefly shifted the spotlight to altcoins, which seized the moment to stage local rallies. The diversification of gains across the crypto spectrum during Bitcoin's periods of weakness is a trend that has become more pronounced as the overall market matures.\n\nYet Bitcoin's ability to push back above the 50 EMA serves as a reminder of its underlying strength and the confidence investors have placed in it. Despite the opportunity for altcoins to rise, Bitcoin remains the anchor of the crypto market, with its moves often dictating broader market sentiment. This recent rebound above a crucial technical level could be interpreted as Bitcoin's silent assertion that it is not ready to give up the throne just yet."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxOcmlLTWxGTGxzMEZpa1VBOWFhWmRRY01idEVwLWxrczk2eWZGbXJMMktKNmxkQ3hWelcyaEVlM294THVyUnBMaEJvTy1sZ0dud0FYLTM4OW03ekc1UFpaNmY4bWdGeEpWVEJ5ZkVqb29TNGh4SEM5VWw2RUFaR0xhU08xd0VRZ2hORFRibUJlUTFsSkRkT0xaZS1XVkx6Z0h2ZDNpY1NKaGRaTVNyMGfSAbMBQVVfeXFMTkRwSUZXQkhaOTB1bHFab3l1Um4xbVRFdGViczBNVFpwNEtfMjJ6N3JYa1ozNXdkaUJpQ1JHblBaRlJjS19ubzl3SDhxcndKVGJEcnFqZXRkNkZrNlVqWWZCd0ktLTg2QXJ0RXl5cU5QUmpUOU82TklqVEJvZ2liekxoT3M0ZGRvaU5EYzdOMEU2S014bHRCdEhicW9NbF9ybVhHdW1vdmJ6aHdCdmVJdHZYUjQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jan 2024 08:00:00 GMT",
        "title": "Shiba Inu (SHIB) Becoming Bullish, Ethereum (ETH) Price Screams Rally Continuation, Bitcoin (BTC) Not Giving up Market Dominance - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nShiba Inu currently displays an ascending triangle pattern on the SHIB/USDT chart. This technical formation is widely recognized and could be a signal to a significant price surge for the meme.\n\nAdvertisement\n\nAn ascending triangle is characterized by a flat upper resistance line and a rising lower support line. This pattern suggests that buyers are gradually gaining ground against sellers, as each dip is bought up at a higher level than the previous one, indicating accumulating pressure for an upward breakout.\n\nSHIB/USDT Chart by TradingView\n\nFor Shiba Inu, which has been lingering in a period of relatively nonexistent activity, this pattern could serve as massive fuel for volatility in the near future. Recent market conditions have seen a decline in interest toward legacy meme coins, with SHIB being no exception. The lack of significant developments within the Shiba Inu network has contributed to the muted activity around this cryptocurrency.\n\nIn contrast, the majority of the action in the meme coin sector has been taking place on the Solana network. This platform has become a hotbed for the deployment of new meme coins, which are exhibiting far greater volatility than those on the Ethereum network, where Shiba Inu resides. The brisk activity on Solana contrasts sharply with the sluggishness observed in Ethereum's meme coin space, drawing in traders and investors looking for quick gains and high excitement.\n\nEthereum's correction is temporary\n\nThe Ethereum market is currently exhibiting a correction, and there are patterns that suggest a rally may not only be on the horizon but could also be in continuation. The asset has recently experienced a sharp downturn, movement that is readily apparent on intraday timeframes. However, such stark movements are often precursors to reversals, signaling that Ethereum could be gearing up for an upswing.\n\nA closer look at the charts shows Ethereum's price action respecting a series of key technical indicators which, together, build a case for potential upward momentum. The asset has been tracing back to touch base with its moving averages, a behavior that is typically followed by a rebound, as these levels can act as dynamic support zones.\n\nThis corrective phase is noteworthy, especially considering the robust rally Ethereum enjoyed in the preceding weeks. Corrections are a natural and healthy part of any asset's price trajectory, allowing for consolidation before the next leg up. For Ethereum, the current pullback could be shaking out weak hands, setting the stage for a stronger rally propelled by a more committed investor base.\n\nBitcoin's dominance not going anywhere\n\nAfter a brief breach below the 50-day EMA — a critical indicator of medium-term market sentiment — Bitcoin has clawed its way back above this pivotal level. This move indicates a bullish signal for market observers, suggesting that Bitcoin is not yet ready to relinquish its market dominance.\n\nHowever, the ascent above the 50 EMA has not been met with the kind of vigorous momentum that bulls would hope for. The growth has been moderate, hinting that Bitcoin might encounter selling pressure as it ascends. This is not unusual on the crypto markets, where significant moves often face immediate resistance as traders take profits and skeptics cast doubts.\n\nThe recent price action has been a roller coaster for Bitcoin, which saw its value tumble from highs around $47,000 to lows near $41,000. This downturn briefly shifted the spotlight to altcoins, which seized the moment to stage local rallies. The diversification of gains across the crypto spectrum during Bitcoin's periods of weakness is a trend that has become more pronounced as the overall market matures.\n\nYet Bitcoin's ability to push back above the 50 EMA serves as a reminder of its underlying strength and the confidence investors have placed in it. Despite the opportunity for altcoins to rise, Bitcoin remains the anchor of the crypto market, with its moves often dictating broader market sentiment. This recent rebound above a crucial technical level could be interpreted as Bitcoin's silent assertion that it is not ready to give up the throne just yet."
    }
]