[
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxQZGdTaDdzOEN4RVpocVRDQ1pSZVFxaFRNT2dObDBqQXZiMVIyYlRidnhCMklKOXVfOWt0MlpWZTVmNFdXUHphVEZ5WXpJTHgzVmJDcGl3QXZkM1BadXl5SWF2QXRVY3lFN3o0TlZrTDhKNlpSYmVDcVNrSUFGbWZEMkJRZVRvaEk3UzJETzF1MFJTdlNaN2Q1aDU5Zw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 15 Feb 2024 08:00:00 GMT",
        "title": "Neon EVM Is a 'Translator' From Ethereum to Solana, Developer Says - CoinDesk",
        "content": "Why is interoperability so important for developers? It's important to choose exact Blockchain for their needs and for users they need to get the best from the old chains. Explain the Neon M and Deb bridge integration to me like I'm Five Neon Em is like translator from Ethereum language to Solana language and the bridge. It's a distraught that connects all assets and allow you to move assets from Ethereum to Solana board. What's the most exciting development in DFI? So since you for sure, you own your assets and second from development perspective, you can experiment with all types of financial instruments on how to work with it without any regulations. How did you get into crypto when I heard about philosophy and ideas of web tree space? And it was for me like continue moving from banking and security to crypto and security like a tokens. What's the biggest challenge facing developers right now, interoperability between all protocols and standards?"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiY0FVX3lxTE9SOE5mcjEyQmstRDBCbUhDdnRPU1RnZ0ppbS1YMTJpUWhPeW5TQUoyazRZUjRyNi1NYTRFNzg3TmJYUll4anFscTBaNXpCVk12eFN6dkIwR1EyZVRIc3c0ZzBiMNIBaEFVX3lxTE1kSmxHdlFoNkdmbFJDRUgwMFc0WXdBTXg2amhvczBqR2tqYk5RTjd0N1RvdHdaaDUtSlFjbG9pTXVyNGY5U2lLR2ViVks3ME5sdi1rY0hCRFlaWExId3p0SEJEVzZUNF8z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 15 Feb 2024 08:00:00 GMT",
        "title": "Tim Beiko Shares Key Ethereum Updates - U.Today",
        "content": "Advertisement\n\nTim Beiko, a prominent figure within the Ethereum ecosystem, took to X to relay significant updates from the latest All Core Devs Execution (ACDE) call, focusing on the progress of various Ethereum Improvement Proposals (EIPs).\n\nAmong the discussed topics, EIP-2935 stood out, gaining renewed interest thanks to the potential integration of Verkle trees.\n\nThese social media updates offered a glimpse into the Ethereum community's ongoing efforts to enhance the network's efficiency and security, particularly highlighting the strides being made toward improving stateless client support and refining the execution layer (EL) state transition function.\n\nStateless client support\n\nBeiko's posts detailed the discussions around EIP-2935, aimed at improving the verification process of historical block hashes to bolster stateless clients' operational trustworthiness.\n\nAdvertisement\n\nThis proposal, along with its adjustments to accommodate the latest fork activation schemes and the Verkle roadmap, represents a crucial step towards reducing the network's trust assumptions.\n\nMoreover, the community's exploration of adopting an architecture similar to EIP-4788, which employs a ring buffer for historical data storage, demonstrates a proactive approach to resolving technical challenges and enhancing Ethereum's foundational infrastructure.\n\nFuture outlook and security concerns\n\nThrough his X thread, Beiko also brought to light concerns regarding potential exploits that could arise from the use of contracts designed to overload the network with computational demands.\n\nThis issue, particularly relevant with the shift to more compute-intensive Verkle hashing, reflects a broader challenge that the Ethereum team is committed to investigating further.\n\nIn addition, the discussion extended to other pivotal EIPs, such as the PAY opcode (EIP-5920) and the reduction in the cost of transient storage (EIP-7609), which collectively aim to streamline transaction processes and fine-tune resource pricing for enhanced network performance."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxPQll1V0hVNzZMbm9OS01CaVVQZ0hQOHdEbXRNazhEOGFPQW9ISF8wMkxKR19SVklvSjBYRkhIaWJldUZCQnRPZzhEclVXSVcwcmI4VmJ6ZTFXZ19talFSSmFrdEh1aWZrMk5EbjAtT191ZFJFUFRMb0YyZm80VlNOYXBEeFowYlhFdXpkTWdra2h5eDFFZTREMjVTR3VIN0E1UndkaXNiMldiSjUtbTNOeUZORTZVRTR6dVhpZVZsNXhFR2fSAcgBQVVfeXFMT1RVOEhJM1NGb19UMUJMY1p4bmJTWDlkelZSZUJWMEg5Xy1obTFnS2xlcXVVMl9SQk90NFJXbExtazdqNmpHM2JhSkoxaEFxelJMTDZSZDFsTTAySE5qYlJYZGdxN3BDLVhkRTVUekRBZ0tENUlXczVHbFVydXMwaUhTVk1ibGtXcHRpak1HQmw5dDJueHVlSUpXY3l0bDlhZUtURmdhWnpxcXFKMTZTcWhmSGRQN1FxMk5LMnpNUldLeEVYS0RCVXE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 15 Feb 2024 08:00:00 GMT",
        "title": "Solana-Based Decentralized Rendering Altcoin Offers Tepid Response to Coinbase Listing News - The Daily Hodl",
        "content": "A Solana-based (SOL) decentralized rendering altcoin is trading sideways despite the news that the top US crypto exchange platform would be adding support for it.\n\nIn a new announcement, Coinbase says that it’s going to be listing Render (RENDER), a decentralized altcoin that allows users to share their unused GPU (graphics processing unit) power to render graphics and visual effects for other projects as a means of earning rewards.\n\n“Coinbase will add support for Render on the Solana network (SPL token). Do not send this asset over other networks or your funds may be lost. Transfers for this asset are available on Coinbase and CoinbaseExch in the regions where trading is supported.”\n\nThe digital asset had a lukewarm response to the listing, as it is trading for $4.91 at time of writing, a 2.1% decrease over the last 24 hours.\n\nRender used to be an Ethereum-based (ETH) token, but it switched over to Solana in late 2023. According to Jules Urbach, the project’s founder, the move greatly enhanced the utility of the protocol.\n\nSays Urbach,\n\n“Moving Render’s core infrastructure to Solana is a watershed moment that unlocks major new capabilities like real-time streaming and dynamic NFTs.”\n\nAccording to Coinbase, it will be supporting both the Solana and Ethereum versions of the asset, noting that the tokens have slightly different names across blockchains.\n\n“Coinbase will support trading of the Render token on both Ethereum and Solana networks. Render on the Ethereum network will retain the ticker RNDR while Render on Solana will have the ticker RENDER and will be named Render (Solana) on our trading platform.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxObG9BN1htTVVnM25sYm52S24wTWlKOENlam9WZDhXa3QxYmRkNDhvTEJVRmNiUlpRVTFob2RBRndEazVMTENyT2owN0V1aFdwNmlQN19oYlB5enh6RXNZa2NHS2syeTR5UGNEVFctOEdXc3MwcmlpRk90T1ZoOXViV05ZLThoX1RpbHVvWEFHc0NpMnJGYlRLbmp5TGRNQ0czOVBPZmx4Vk5zUks0eUxGczhaTC03b21jd1NXX19SUmRTYTjSAcgBQVVfeXFMTXNhTWVSMlY2V1RFSWJtSGhqUkRyN2tTU2dmYXR1SC0wUFNZRlVrbkxrZXNqeC01UVRCamJ0b2MwYkdPaXpEd1cwdjFKT2NtRjZQblphWW50QkZSWXVzWmNDYTdPQkNhUlFUeGhHMTB2elg3VHAzSFdid1FtWURWd3gtNE9KeEFRWEsxVTFJRDNWcjVZLTV5T1ZwUW1GWGs3SFJXNjNWeXI3ZzVKYnI3LVFGNUpQVW53b0lDMTBIZjJtdUhpNmFXVmI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 15 Feb 2024 08:00:00 GMT",
        "title": "Will Genesis Dump $1.6 Billion Worth of Bitcoin and Ethereum Trust Shares on the Market? Details of the Lat... - CryptoPotato",
        "content": "Genesis Global has been approved by the bankruptcy court to sell around 35 million shares of Grayscale Bitcoin Trust, with an estimated value of $1.3 billion. U.S. Bankruptcy Judge Sean Lane made the decision during a court hearing held in White Plains, New York.\n\nThis approval authorizes Genesis to monetize its holdings of Grayscale Bitcoin Trust, Grayscale Ethereum Trust, and Grayscale Ethereum Classic Trust.\n\nGenesis to Sell its GBTC Shares\n\nIn addition to the $1.3 billion in GBTC shares, Genesis intends to sell over 11 million shares in two Grayscale Ethereum Trusts, with a combined value exceeding $200 million, as detailed in a court filing dated February 2.\n\nThis will result in a total of approximately $1.6 billion shares in Grayscale Bitcoin Trust (GBTC), Grayscale Ethereum Trust (ETHE), and Grayscale Ethereum Classic Trust (ETCG) combined.\n\nHowever, Genesis’s parent company, Digital Currency Group, attempted to delay the proposed sale until after the bankruptcy court decides on the subsidiary’s debt repayment plan, which is scheduled for later this month. DCG expressed concerns that premature Grayscale share sales could depress prices, minimizing potential recoveries for Genesis creditors.\n\nJeffrey Saferstein, representing DCG, also emphasized the need for careful consideration to avoid the rapid unloading of shares. Additionally, DCG sought the right to seek input on selling Grayscale shares.\n\nDespite these objections, Judge Sean Lane ruled in favor of Genesis, asserting the company’s right to determine the strategic sale of its assets. He emphasized that the sales would be conducted over time with the assistance of a broker to prevent any rapid unloading of shares, which could adversely affect prices.\n\nLane justified his decision by highlighting the “considerable expertise” of Genesis and its creditors in crypto, suggesting that they are well-equipped to maximize the value of the Grayscale shares.\n\nSEC and NY Attorney General Settlement\n\nMeanwhile, Genesis is moving forward with its liquidation plan, which entails shutting down the company and repaying customers in cash or cryptocurrency, depending on the nature of their deposits.\n\nThe company has reached settlements with the U.S. SEC and New York Attorney General Letitia James earlier this month, resolving their objections to its bankruptcy plan.\n\nUnder the terms of the settlements, the SEC will be paid a $21 million fine if Genesis has any surplus funds after repaying customers. Furthermore, any funds recovered from the bankruptcy proceedings will be used by the New York Attorney General to assist creditors allegedly defrauded by Genesis."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxNQTB1cXFUZzRRQWFsQ2pxeDRDWWRXVGo0am5qUWVqSm1JbVBCcnRlMGtYbkZWVHMyNW5zc3hUbWhab19KTUZFWEt6cFZFOFNMcm12SjY3SklqWmdSUm1yNTJWdzVzSlF5U3VlLVotTFRGUm41S3Zhd2M2eFhab0tqUWlB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 15 Feb 2024 08:00:00 GMT",
        "title": "Are you more of a Bitcoin or Ethereum person? - Cointribune EN",
        "content": "Thu 15 Feb 2024 ▪ 3 min read ▪ by Luc Jose A.\n\nIn the particularly booming crypto market landscape lately, making a relevant choice between positioning on Bitcoin or Ethereum can be quite the dilemma. These two crypto ecosystems are the leaders of the crypto market. But they are distinctly different in terms of their functionalities and advantages. Understanding this divergence can be crucial for your crypto investment choices.\n\nBitcoin (BTC), the safest crypto investment over Ethereum (ETH)?\n\nLaunched in 2009, the Bitcoin cryptocurrency (BTC) is often nicknamed the “digital gold” due to its longevity and its increasing value over time. It is now widely regarded as a store of value and a hedge against often rampant inflation.\n\nMoreover, its simplicity and history make it an appealing choice for cautious, or even wary, investors. On this point, it stands out significantly from Ether (ETH), the native cryptocurrency of the Ethereum firm.\n\nThe latter offers a decentralized platform that allows the creation of smart contracts and decentralized applications (dApps). Unlike Bitcoin, Ethereum is not just limited to being a simple cryptocurrency.\n\nThanks to its flexibility, this platform paves the way to new prospects in various sectors such as finance and logistics, among others. This leads some to say that Ethereum represents decentralized innovation where Bitcoin is a safe investment choice. However, this doesn’t always settle the question of choosing between these two crypto platforms.\n\nBitcoin or Ethereum: how to make the choice?\n\nThe choice between Bitcoin and Ethereum mainly depends on your investment goals and your risk tolerance as an investor. Generally, Bitcoin is a good option if you’re looking to preserve value, due to its stability and reputation as a safe asset.\n\nIf, on the other hand, you are looking for growth opportunities, Ethereum might be particularly attractive because of its potential for innovation and its diversity of applications. This characteristic makes it an undisputed solution in terms of application development, due to its structure that’s especially suitable for deploying dApps in a relevant way.\n\nEither way, these two crypto platforms share one common factor. As with the majority of cryptocurrencies, they are subject to high volatility and face uncertain regulations in many regions around the world. Even though Bitcoin features a more established technology while Ethereum is constantly evolving with regular updates.\n\nUltimately, the choice between Bitcoin and Ethereum will depend on your investor profile and your long-term goals. Hence the need to do your own research beforehand to take into account your particularities in terms of crypto investment.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    }
]