[
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxORE1xX2llQ1dKTUJXbUcxNjBtRjB2U3dlU242cFI4N2hLYV96OVc1d3RHVkNkTWhuNmxtMkZDcUxrVFIxNnpZRDExSFJCaVQtN25KQlB2WTk2aG9ITXFWSXZoQzY4dzV5RlhoeUM1Y2FsWm5STVN1Tklic3p4VHRqTmdBaGszRFgt?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Restaking App Approaches $4 Billion In Deposits: Biggest Airdrop In History Incoming? - Yahoo Finance",
        "content": "EigenLayer is a new liquid restaking platform for Ethereum. The protocol allows users to stake the same amount of Ether (ETH) across multiple projects simultaneously to earn additional rewards. Proponents of the technology say that it will increase capital efficiency and spur innovation. Those against the technology believe that it could cause overleveraging and is susceptible to slashing.\n\nThough the new technology is causing a debate among ETH enthusiasts, it is impossible to deny the project’s popularity. Initially, EigenLayer put a 200,000 ETH cap on each protocol so that it could test the concept without extreme amounts of volume. The limit was removed on Feb. 5. Within 24 hours, over 700,000 ETH, or over $1.6 billion was deposited into EigenLayer. According to data from DefiLlama, this brought EigenLayer's total volume locked (TVL) to nearly $4 billion, which is over 1% of all Ethereum in circulation. For comparison, EigenLayer had less than $300 million in TVL for most of December 2023.\n\nDon't Miss:\n\nWhile the limit on deposits has been temporarily removed, a new limit will be put in place on February 9th. While the exact limit is unknown, it will likely be close to the TVL on February 9th. However, the project has also stated that it hopes to eventually remove any deposit limits, though this will likely happen some time in the future, if it happens at all.\n\nOn February 5th, ETH appreciated more than 3.5%, causing its market cap to approach $300 billion. Despite the strong day, ETH was still down more than 1% over the previous 7 days.\n\nTo make the project even more enticing, EigenLayer has begun showing EigenLayer Points, which are a calculation consisting of the time spent restaking, volume restaked, etc. to formulate a numerical value. While there is no guarantee that this could lead to an airdrop, other staking platforms have used a similar system in the past to mete out tokens in the event of an airdrop. One example from recent memory was the Jito (JITO) airdrop on the Solana chain. This project also used a point system, which allowed users to be placed into tiers that gave different amounts of JITO on the day of the airdrop. Again, there is no guarantee that EigenLayer will use the points system for an airdrop, but it has been used in the past.\n\nTrending: This brokerage offers custom rewards for users to switch – the biggest reward so far for 1 user is $19,977.48. Will yours beat it?\n\nEigenLayer and restaking is certainly an interesting system, especially considering the potential for spot Ethereum ETFs and Ethereum chain upgrades potentially coming soon. As the protocol continues to grow and we start to see its use cases, we will gain a better understanding of where liquid restaking could potentially play a role in the future of blockchain.\n\nStory continues\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nGet the latest stock analysis from Benzinga?\n\nThis article Ethereum Restaking App Approaches $4 Billion In Deposits: Biggest Airdrop In History Incoming? originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxORE1xX2llQ1dKTUJXbUcxNjBtRjB2U3dlU242cFI4N2hLYV96OVc1d3RHVkNkTWhuNmxtMkZDcUxrVFIxNnpZRDExSFJCaVQtN25KQlB2WTk2aG9ITXFWSXZoQzY4dzV5RlhoeUM1Y2FsWm5STVN1Tklic3p4VHRqTmdBaGszRFgt?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Restaking App Approaches $4 Billion In Deposits: Biggest Airdrop In History Incoming? - Yahoo Finance",
        "content": "EigenLayer is a new liquid restaking platform for Ethereum. The protocol allows users to stake the same amount of Ether (ETH) across multiple projects simultaneously to earn additional rewards. Proponents of the technology say that it will increase capital efficiency and spur innovation. Those against the technology believe that it could cause overleveraging and is susceptible to slashing.\n\nThough the new technology is causing a debate among ETH enthusiasts, it is impossible to deny the project’s popularity. Initially, EigenLayer put a 200,000 ETH cap on each protocol so that it could test the concept without extreme amounts of volume. The limit was removed on Feb. 5. Within 24 hours, over 700,000 ETH, or over $1.6 billion was deposited into EigenLayer. According to data from DefiLlama, this brought EigenLayer's total volume locked (TVL) to nearly $4 billion, which is over 1% of all Ethereum in circulation. For comparison, EigenLayer had less than $300 million in TVL for most of December 2023.\n\nDon't Miss:\n\nWhile the limit on deposits has been temporarily removed, a new limit will be put in place on February 9th. While the exact limit is unknown, it will likely be close to the TVL on February 9th. However, the project has also stated that it hopes to eventually remove any deposit limits, though this will likely happen some time in the future, if it happens at all.\n\nOn February 5th, ETH appreciated more than 3.5%, causing its market cap to approach $300 billion. Despite the strong day, ETH was still down more than 1% over the previous 7 days.\n\nTo make the project even more enticing, EigenLayer has begun showing EigenLayer Points, which are a calculation consisting of the time spent restaking, volume restaked, etc. to formulate a numerical value. While there is no guarantee that this could lead to an airdrop, other staking platforms have used a similar system in the past to mete out tokens in the event of an airdrop. One example from recent memory was the Jito (JITO) airdrop on the Solana chain. This project also used a point system, which allowed users to be placed into tiers that gave different amounts of JITO on the day of the airdrop. Again, there is no guarantee that EigenLayer will use the points system for an airdrop, but it has been used in the past.\n\nTrending: This brokerage offers custom rewards for users to switch – the biggest reward so far for 1 user is $19,977.48. Will yours beat it?\n\nEigenLayer and restaking is certainly an interesting system, especially considering the potential for spot Ethereum ETFs and Ethereum chain upgrades potentially coming soon. As the protocol continues to grow and we start to see its use cases, we will gain a better understanding of where liquid restaking could potentially play a role in the future of blockchain.\n\nStory continues\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nGet the latest stock analysis from Benzinga?\n\nThis article Ethereum Restaking App Approaches $4 Billion In Deposits: Biggest Airdrop In History Incoming? originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiZkFVX3lxTFA4TVI1bXdxQUhaMlJ3cTlzVm1LNUtDQXdzeElvTUloRjlrLU1XLVBPeWpaNlpLa2RLNUg3V1F3VEhQUDV2c28zN0NyaVlaWmVXRVVVTlhYakRtNmloM01lSVp6NVlOUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Feb 2024 08:00:00 GMT",
        "title": "What is Ethereum fragmentation? - Crypto Briefing",
        "content": "Share this article\n\nEthereum’s evolution is marked by the adoption of Layer 2 scaling solutions (L2s), designed to alleviate the network’s congestion and high transaction fees.\n\nL2s operate on top of Ethereum (Layer 1 or L1), processing transactions more efficiently before finalizing them on the main chain. However, this has led to a new challenge: each L2 functions in its isolated environment, creating silos that hinder interoperability—a state we refer to as fragmentation.\n\nWhat is Universal Synchronous Composability (USC)?\n\nThe core issue with fragmentation is the loss of “universal synchronous composability” (USC), a feature allowing different applications to interact with each other seamlessly in real time. Imagine Ethereum as a bustling city where roads (L2s) connect buildings (applications).\n\nFragmentation is akin to having roads that don’t interconnect, forcing you to take a long detour to move from one building to another.\n\nThe proposed solution, “shared sequencing,” is like establishing a city-wide transit system that links all roads, enabling direct travel routes between any two points without detours.\n\nTo further simplify, consider shared sequencing as the internet of Ethereum. Just as the internet allows different computers to communicate directly regardless of their physical location, shared sequencing enables different L2s to interact seamlessly. This system removes barriers, allowing for immediate transactions across the network, akin to sending an email from one side of the world to the other in seconds.\n\nTechnical Explanation of Shared Sequencing\n\nShared sequencing coordinates the order of transactions across all L2 solutions on Ethereum. It uses a centralized mechanism to sequence transactions identically across different L2s without requiring major infrastructure changes.\n\nShared sequencing leverages Ethereum’s existing data availability capabilities. It proposes adding functionality for L2 solutions to sequence transactions in a unified manner. By sequencing transactions in the same order everywhere, shared sequencing enables instant interactions between L2s across Ethereum.\n\nPotential Use Cases for Shared Sequencing\n\nAdopting shared sequencing could revolutionize Ethereum. It would enhance liquidity and reduce transaction costs by enabling seamless communication between L2 solutions. This would eliminate the need for complex bridging between L2s.\n\nShared sequencing could enable more robust decentralized applications (dApps) and services that integrate across L2s. This would improve user experience and accessibility. By restoring composability across L2 solutions, shared sequencing would strengthen Ethereum’s network effects and dominance as a platform for blockchain applications.\n\nThe Road Ahead for Ethereum’s Ecosystem\n\nWhile Ethereum’s journey through fragmentation may resemble a challenging phase of growth, the horizon holds promise for a unified and efficient ecosystem. Shared sequencing represents a leap towards realizing this vision, offering a roadmap to re-establish Ethereum’s composability and network effects.\n\nAs we look to the future, continued innovation and collaboration within the Ethereum community will be pivotal in overcoming current limitations and unlocking the platform’s full potential. Through these efforts, Ethereum can evolve into a more interconnected and powerful platform, paving the way for the next generation of blockchain applications."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiZkFVX3lxTE9EVGtDbjZVN1JIY1dTQ1ZfZFBnYVkxSXdHMXlyc0FNWElwZmgySFBiR0gtbVZuVWhjelRXdHVDRTJTSHRtRHBSRlF2MzVzS2pud2NEcC15SGFNS2QyTUZrWW14VDhXUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Feb 2024 19:18:33 GMT",
        "title": "Ethereum’s Dencun is now live on the Holesky testnet - Blockworks",
        "content": "Ethereum’s Dencun upgrade, featuring “proto-danksharding,” has successfully run on the Holešky testnet.\n\nHolešky replaced Ethereum’s Goerli testnet, widely used to test validating and staking, in September last year, though it did not officially enter its “end of life” status until January this year.\n\nTestnets refer to a copy of the blockchain network which are used by developers to test smart contracts and protocols before they deploy on mainnet.\n\nRead more: Ethereum’s Holešky testnet launch hits a speed bump\n\nPrior to running on Holešky, the Dencun upgrade also ran on Ethereum’s Goerli testnet and Sepolia testnet.\n\nFollowing the successful fork of each of these different testing environments, Ethereum’s development team is now figuring out a time to run the Dencun upgrade on Ethereum mainnet.\n\nLoading Tweet..\n\nWhat’s so special about the Dencun upgrade?\n\nThe Dencun upgrade will enable proto-danksharding — introduced in Ethereum Improvement Proposal (EIP) 4844 — to the Ethereum blockchain.\n\nRead more: Ethereum Improvement Proposals to watch in 2024\n\nNikolay Angelov, head of blockchain at Nexo, told Blockworks that EIPs carry enormous, potentially institutional weight in the digital asset space.\n\n“Over the years, Ethereum has accommodated thousands of projects that utilize the network and its specific layers to create a diverse ecosystem of some of the most founding projects in the industry, [like] Tether,” Angelov said.\n\nHe notes that changes and enhancements to this foundational layer would require technological precision and synchronization across deployment.\n\n“In that sense, the testnets’ role is to mirror the mainnet’s functionalities by encouraging and committing to public testing of the deployment is a testament to the magnitude of Ethereum Upgrades,” he said.\n\nIn the case of EIP 4844, Ethereum will be introducing a new transaction type, which involves “blobs,” or sharded data, that can live on the beacon node for a short period of time.\n\nEthereum rollups today must put raw transaction data onto Ethereum using something called “calldata.”\n\nWith the introduction of EIP 4844, rollup block submitters will instead be able to put this data into blobs. This will guarantee data availability and will also be much more affordable than calldata.\n\nRead more: Ethereum devs consider ‘existential’ upgrade to the EVM\n\nData availability in blockchain refers to the process of storing data for a set period of time to ensure that all network participants will be able to access and retrieve it so that they can challenge whether or not the data is accurate.\n\nRollups only need this data to be available once and for a set period to give honest participants enough time to construct the rollup state and verify its accuracy.\n\n“While Ethereum has rightfully suffered from criticism over fees and processing times, the\n\nDencun concepts of proto-danksharding and “data blobs” have the mission to address and overcome those,” Angelov said.\n\nHe notes that should the upgrade on mainnet be successful, Ethereum will be able to manage data throughput and network costs much more efficiently, giving it a competitive advantage over other layer-1 solutions.\n\n“Ultimately, it is the ability to onboard new protocols into a much freer-flowing environment and move capital at lower costs that will ultimately enhance cryptocurrency adoption by delivering a more economically feasible, highly-scalable on-chain solution,” he said.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxOM2F4VjlyRUh2M2xRcUFkUTRVWXRZN1N2a21TRklGbnBEWThrOWRzZldqYzdVSU5nZHNKeDlYZXl2SE0wdjdOc0NPelhuRjVVSmFzQzB4aFFiRjNPYmZxenpzb2RZUEpqRUY0UnpmalNaNTgzTWx4TFZ0a1loOXpYemZiV3hDQTRMLUJOcXNFZVJyc3RYcXpzbUg5a19falE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Feb 2024 08:00:00 GMT",
        "title": "SEC may be forced to declare Ethereum a security after controversial new launch - Fortune",
        "content": "Prometheum plans to announce on Wednesday the launch of custodial services for Ether, the native cryptocurrency of the Ethereum blockchain, whose $280 billion market cap is second only to Bitcoin’s. The move may be part of a larger strategy by the crypto firm to get regulators to identify Ether as a security—a position widely unpopular among industry peers.\n\nSo far, the Securities and Exchange Commission has avoided taking a position on Ethereum’s legal status even while declaring more than a dozen other popular cryptocurrencies to be securities. The latest gambit by New York–based Prometheum, which claims it has discovered a compliant path for crypto within existing laws, could force the agency’s hand.\n\nLegal experts have told Fortune that Prometheum’s plan to launch its custodial service may compel the SEC to resolve the long-running Ethereum question. If the agency does indeed proclaim Ether to be a security, Prometheum could be in a pole position when it launches its planned trading platform next quarter—even as the rest of the industry insists crypto can’t be viable without new laws.\n\nA controversial new player\n\nLongtime crypto exchanges like Coinbase and Kraken offer trading platforms in the U.S., allowing users to buy and sell popular cryptocurrencies like Bitcoin and Ether. While many of the firms have been around for more than a decade, they still operate outside the regulatory framework of the existing financial system, which has led lawmakers to propose new rules for the industry.\n\nSEC Chair Gary Gensler, who has stepped up enforcement after the disastrous collapse of FTX, has said existing rules are sufficient and filed lawsuits against exchanges for failing to register with the agency. In response, companies like Coinbase have argued that the existing rules are outdated.\n\nWhile much of the U.S. crypto industry has sided with Coinbase, Prometheum has taken a different—and contentious—approach.\n\nFounded by two brothers, Aaron and Benjamin Kaplan, Prometheum received regulatory approval in 2021 to operate an alternative trading platform—similar to a stock exchange—where users can buy and sell different securities. The company went on to gain widespread attention in mid-2023 when it announced a first-of-its-kind approval from the Financial Industry Regulatory Authority (FINRA)—an industry oversight body that’s independent of the SEC—to operate as a special purpose broker-dealer for digital asset securities. The SEC first created the designation in 2021, but no other firm has succeeded in obtaining a license, though others, including Robinhood, have tried.\n\nPrometheum’s claim to have found a compliant path for crypto trading immediately drew condemnation from legal figures in the crypto industry, who argued that even if the SEC and FINRA approved Prometheum’s structure, it would not have any assets available for trading. That is because, skeptics argue, the SEC has jurisdiction over securities, while cryptocurrencies like Solana and Ether are more like oil or gold—assets that don’t fit the legal definition of a security and so can’t be registered.\n\nThe Kaplan brothers, in contrast, agree with the SEC’s assessment that most cryptocurrencies are securities. They argue that Prometheum will be able to list different crypto assets as securities under an exemption called Rule 144, which is used to trade restricted stocks, and that they can use blockchain data to determine whether the assets have been in circulation for more than a year—a key factor for the exemption. As an alternative trading system (or ATS), Prometheum will not have to work directly with the issuers but instead can choose which assets to list.\n\nPrometheum’s claims have not only riled the crypto industry but Republican lawmakers, who have argued that Gensler had propped up the little-known firm to further his own regulatory agenda. In a June appearance on CNBC, for instance, Gensler touted Prometheum’s registration as a special purpose broker-dealer as an example of a compliant path for the industry. And last June, the company received a prized invitation to testify at a congressional hearing about crypto despite having virtually no presence in the industry.\n\nThe debate over Prometheum’s proposal has until now been theoretical, but Wednesday’s announcement of Ether custodial services, which are slated to launch by late March for institutional clients, means the company is on the cusp of becoming the first crypto exchange to compliantly offer assets like Ether for trading.\n\n“We want to work with the crypto industry,” Benjamin Kaplan said in an interview with Fortune. “Our goal is not to destroy, it’s not to harm, it’s not to undermine—it’s to help build.”\n\n‘Move the ball forward’\n\nIn the traditional world of stock markets, the various steps that make up a trade are divided among different firms. For instance, a retail trader visits a broker like Fidelity to buy a share of Apple stock, leading Fidelity to turn to a broker-dealer like Citadel Securities to fill the order. Next, a firm called the National Securities Clearing Corporation, a subsidiary of the Depository Trust and Clearing Corporation, figures out who owes what in all the trades the broker has made that day—a process known as clearing.\n\nAt this point, another DTCC subsidiary called the Depository Trust Company steps in to oversee the funds and securities moving from one party to another—a process called settlement. Finally, an institution—either the original broker or a firm like State Street or BNY Mellon—serves as the custodian, meaning it holds the actual securities on behalf of the investors.\n\nOne of the reasons for separating these various functions is to prevent conflicts of interest. If Citadel, for example, was serving as both an exchange and a broker-dealer, it could digest customer trade information and front-run orders. Separating brokers into distinct entities also prevents markets from having a single point of failure, as happened with FTX.\n\nJames Angel, an associate professor at Georgetown focused on financial regulation, told Fortune that much of the separation is also historical—a convention that the crypto industry is seeking to disrupt with the help of blockchain technology.\n\nFirms like Coinbase offer clearing, settling, custody, and trading services under one roof, an arrangement that provided partial fodder for the SEC’s lawsuit against the exchange. The agency’s primary complaint, though, was that Coinbase and others had not registered with the SEC to offer any of these services—even as it sold what the agency deemed to be securities.\n\nPrometheum, meanwhile, believes it has found a way to sell crypto without triggering any of these objections from the SEC, in part by dividing itself into two entities.\n\nOne, the alternative trading system, is a member of FINRA and registered with the SEC, and will provide a front-end platform for investors to buy and sell crypto assets. The other entity, Prometheum Capital, is the company that received the special purpose broker-dealer license and a final go-ahead from FINRA in January to offer the clearing, settling, and custody services necessary to complete the trades.\n\nThe upshot is that, while firms like Coinbase have been battling with the SEC, Prometheum has been getting approvals from FINRA, which is nominally independent of the agency but also works closely with the SEC and is ultimately subject to its oversight. It is also notable that, while other firms have applied to receive the special purpose broker-dealer license—the one created by the SEC in 2021 and issued by FINRA—Prometheum is the only one to receive it.\n\nNow, Prometheum’s custodial services for Ether announcement suggests the company is on track to offer the popular cryptocurrency for trading to institutional investors later this spring. More consequentially, by offering custodial services for Ether, Prometheum is claiming that Ether is a security—a critical question that the SEC has yet to decide on—and doing so as a FINRA- and SEC-regulated business.\n\n“You have to be able to custody before you trade,” Aaron Kaplan told Fortune. “This is hopefully going to move the ball forward.”\n\n‘It’s a gamble’\n\nFortune spoke with four lawyers and academics with expertise in digital asset regulation who agreed that Prometheum’s custody launch could lead the SEC to finally rule on Ethereum’s legal status, especially because Prometheum prominently displays its registered status with the two organizations on its website—a decision that Boston University lecturer Mark Williams described as “marketing.”\n\n“It’s a gamble,” Williams told Fortune. “Maybe it’s part of their business strategy to force the hand of the SEC.”\n\nWilliam Brannan, vice chair of the crypto practice at Lowenstein Sandler, said that Prometheum would be creating “unnecessary controversy” by announcing Ether as the first asset it would custody, given the SEC’s reluctance to take a stance on it.\n\nEven though Prometheum’s primary regulator is FINRA, which operates separately from the SEC, Brannan said FINRA likely would be working with the SEC on the question of Prometheum’s launch of Ether custodial services, owing to the decision’s magnitude.\n\n“My hunch would be that, particularly for these types of issues, FINRA is in very close contact and consultation with the SEC, and would likely be liaising with them and seeking to get some clarification on their position,” Brannan told Fortune.\n\nAccording to a company spokesperson, since Prometheum received the special purpose broker-dealer license from FINRA, it doesn’t require further approval to make assets available for custody, but it has informed FINRA of its plans to offer services for ETH.\n\nSpokespersons from FINRA and the SEC both declined to comment when reached by Fortune.\n\nIf the SEC took action to stop the offering, it would likely come after Prometheum launched its custodial services for Ether. Still, Ron Geffner, a partner at Sadis & Goldberg and a former SEC enforcement attorney, said that he does not expect the SEC to block Prometheum’s approach given Gensler’s stated desire to find a company that can operate under the SEC’s preferred guardrails. “The SEC, given their position on crypto being a security, wants successful registrants in the marketplace that are complying with federal securities laws and supporting their position,” he told Fortune.\n\nThe question remains whether Prometheum can draw investor interest—and whether its approach will survive subsequent SEC administrations. The Kaplan brothers argue that creating a compliant approach will drive institutional participation in the crypto industry, although they haven’t specified if the trading platform has potential clients lined up. Williams expressed skepticism that Prometheum would pull off its bold move. “They’re not market-tested, so I would just have some caution in regard to their ability,” he told Fortune.\n\nBut even if Prometheum can’t drum up demand, or running the operation proves too expensive, a successful launch could upend the industry’s argument that crypto is incompatible with existing securities laws. And that clarity, Brannan said, wouldn’t be the worst thing.\n\n“There’s a certain degree of value,” he told Fortune, “in just knowing exactly what the rules of the road are.”"
    }
]