[
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxNeUxibmJQd1NvQWF1U2ZNWFB3ZVlUMF8zX194Y0R2WmJQRnFpTFo4UmI1ZTFmRzZ4M0ZmNGVLV3ZUaWZiVGlIUGhpa0JPaUNrTFpZdmFFaEt5NEZ5SE1uSnJWcjRaekdmY2dMc3Q4dmlIOURmOWF3RFNlZHFuWTBxT25WbkRxZzVsdXo4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 23 Feb 2024 08:00:00 GMT",
        "title": "Reddit invests in Bitcoin and Ethereum ahead of IPO - Yahoo Finance",
        "content": "Reddit, the popular social media platform, has invested in Bitcoin (BTC) and Ethereum (ETH) as part of its treasury management strategy.\n\nThe company’s initial public offering (IPO) filing with the U.S. Securities and Exchange Commission (SEC) on Feb. 22, also mentioned the acquisition of ETH and Polygon (MATIC) for virtual goods sales.\n\nReddit’s potential IPO is anticipated to be one of the largest tech IPOs of the year, although the company has not yet disclosed the number of shares to be sold or the price range for the offering.\n\nThe S-1 filing unveiled that select Reddit moderators and users could participate in its IPO via a directed share program, diverging from the norm of shares being predominantly bought by large institutional investors.\n\nReddit’s foray into the cryptocurrency market is part of a larger vision to integrate blockchain technology into its network of forums and discussions.\n\nThe social media platform has a history with blockchain technology, though not always successful.\n\nLast year, Reddit announced the shutdown of its community points program associated with its MOON cryptocurrency."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxPa1lRT3pwVzBlNmtjdlAxN2lTazdvQVl0bF9obVRyMTMtMWNFRWVMc3dqYjBUZXRucG44ZHNEUWVSRmdTWUY1SVpnLUxRb2dVQlNWWDNuVnVpZzNiYmZiUndnOUZZRUxaQmhsNEV1T0R2dFJBZGcxVm1PUmxyaHZPbkp4MVV0Q0xVWTdabXdHX3BXOVlaTWlfUGVEN25hUEktcE9v?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 23 Feb 2024 08:00:00 GMT",
        "title": "Superfluid Secures $5.1M to Fuel Ethereum-Based Token Streaming - Crypto Times",
        "content": "Superfluid secures $5.1 million in funding, spearheaded by Fabric Ventures, to innovate real-time crypto transactions on the Ethereum platform. Drawing support from prominent investors, the recent funding round for Superfluid underscores the market’s robust confidence in its innovative vision.\n\nWith the launch of “distribution pools,” the platform heralds a new era in efficient one-to-many crypto streaming. Moreover, Superfluid’s approach to scaling, with its “super tokens,” promises a seamless transaction experience. This innovation allows for predictable gas costs, even as the number of recipients scales up.\n\nStrategic Growth and Community Governance\n\nWith a focus on the Ethereum ecosystem, Superfluid is poised for strategic expansion. The team, primarily engineers, plans to boost its marketing efforts with fresh capital. Additionally, the possibility of a native token launch remains open, reflecting the protocol’s community-first approach.\n\nSuperfluid’s strategic funding and innovative offerings are setting new standards in the crypto transaction space, backed by a strong ethos of community governance and scalable solutions."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiYkFVX3lxTE80c01MTFBWdXp3YlJFNEZmWENraktsZGdTWF95UE5pSkNwNWhsSUo4ZnlFVGpFSWdTcTJfclgxd1NTVDQ4SEJBY0swZGRvLXQyZHRiNDlGTDFqbUE0bXBwUkFB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 23 Feb 2024 08:00:00 GMT",
        "title": "Grayscale: Ethereum’s Dencun upgrade driving price upward - crypto.news",
        "content": "While a possible spot Ethereum ETF approval looms ahead, Grayscale experts believe an upcoming technological improvement is behind recent price upticks.\n\nGrayscale research analyst William Ogden Moore said in a Feb. 23 report that Ethereum’s Dencun upgrade has most likely triggered rallies in Ether (ETH) prices. According to CoinMarkerCap, ETH is up 34% in the last 30 days and 28% year-to-date per TradingView.\n\nEthereum’s Dencun upgrade, scheduled for March 13th, 2024, represents a major step forward and could help Ethereum compete in terms of scalability with faster chains in the Smart Contract Platforms Crypto Sector, such as Solana. We believe that recent price performance reflects the market’s anticipation of this upgrade. William Ogden Moore, Grayscale research analyst\n\nETH 30D price chart | Source: CoinMarketCap\n\nYou might also like: Coinbase calls on SEC to approve Grayscale’s spot Ethereum ETF\n\nDencun promises to uplift throughput and reduce transaction costs, allowing users to spend less gas fees and make more transactions on ETH’s mainnet and layer-2 scaling solutions like Arbitrum.\n\nDevelopers plan to achieve this key overhaul via proto-danksharding, introducing data blobs.\n\nMoore’s report suggests that Ethereum could seize greater smart contract business share from competitors like Solana if the network can offer cheaper fees. Moore opined that this might unlock a multi-billion market tied to real-world assets.\n\nIf Ethereum can simply become more competitive in throughput and cost, it could position itself to capture smart contract applications that demand high levels of security and censorship-resistance like stablecoins or tokenized financial assets. William Ogden Moore, Grayscale research analyst\n\nGrayscale’s bullish outlook on ETH and its blockchain complements the investment firm’s bid for a spot exchange-traded fund following its successful GBTC conversion last month. According to Yahoo Finance, the company hopes to do the same with its Grayscale Ethereum Trust (ETHE), which holds over $7 billion in assets under management (AUM).\n\nThe U.S. SEC delayed a decision on Grayscale’s application till May, along with several other issuers.\n\nETH YTD chart | Source: TradingView"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxQajBrRGhpeU5wVVFlMDg1VUtkYzRhbzh4VFhKME1xRVJiQy1SRTZZalhKOXZiME5EWHRuWWtQVVltOVZzdmQ5RjBjcGRGNG1MaDJpSUZUMlhfZlV0MHdEUG1EeGJMbzkxbnN2cEQ2ZG1TUEtUakY3Mm5BajAtd0thUU9FUThiMUtQSF9FUmVPUTRuQTVLemNBc2I0YURNVUJySkI1dnJhM2Jlc05XZ0xDUUVPWTJjdUxGZ3fSAb8BQVVfeXFMUDlDNWFaLUd2WFN2TWtZTFozcF9mdHV3TW9OaUFVTk9vQlFNS3RaX1FCUXNzR0UyQWpRdFpQTGNvWFhNb2VFSmZ6X2FMeVVmdTdmMmh1MVJLV29VdEpia2hTa3BRTUJFUW9OV1BTTEh6WGJVSWFvd0VValNsNXpTdW9Gd2UtYWZaTXMwN2dGY3lCT0xSSU5oNk9jUG9Hc2tackdPMEluZHpkcDJXcjIxWFJDOXlkcXNWclRpeHFwV2M?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 23 Feb 2024 08:00:00 GMT",
        "title": "ETH/BTC Chart Analysis: Is Ethereum’s Rally Against Bitcoin Ushering In the Altcoin Season? - CoinGape",
        "content": "The first quarter of 2024 is proving to be an exciting era for crypto investors. While attention was majorly on Bitcoin in Q4 last year and in early January, interest has been gradually shifting to Ethereum and the altcoin market in general. The ETH/BTC chart analysis takes into account the changing dynamics, that could result in an unparalleled altcoin season.\n\nETH/BTC Chart Analysis: Ethereum Fires Up As Bitcoin Stalls\n\nThe ETH/BTC trading pair with a value of $0.0574 holds above an important support area highlighted by the 0.382 Fibonacci ratio around $0.0573. Slightly below the same demand zone is the 200-day Exponential Moving Average (EMA) (the blue line on the chart).\n\nadvertisement\n\nWith the Relative Strength Index (RSI) neutral but sliding toward the midline and the oversold region, ETH/USD could push harder on the above support area. Holding firmly above the 0.382 Fibo would make Ethereum stronger, insinuating a larger breakout in ETH price. Ethereum will weaken against Bitcoin if the same support caves.\n\nThe technical structure on the daily chart is no different, with the ETH/USD pair expected to bounce off the 0.382 Fibonacci support level. A stronger Bitcoin in January butchered the demand area, causing a flash drop to $0.051, underscoring the importance of controlling sell-side pressure.\n\nThe upcoming Dencun upgrade is likely the secret weapon Ethereum bulls have against Bitcoin. This upgrade has many benefits for Ethereum as a network and its underlying layer 2 scaling solutions such as Arbitrum and Polygon.\n\nAssessing ETH/USD Weekly Technical Structure\n\nSeveral key levels would determine where the ETH/BTC pair heads in the coming days or weeks. For starters, support highlighted by the green band on the weekly chart has been tested more than once — in May, in Dec/Jan, and in February.\n\nThat said, there is a high chance ETH/USD will rebound from the green-colored support area for another targeted attempt at the trend line resistance from September last year. Ethereum will emerge extremely bullish if this resistance is broken, paving the way for widespread rallies in the altcoin market.\n\nA potential spot Ethereum ETF is another key factor to keep in mind while trading the ETH/BTC pair, especially long-term. Experts anticipate the same bullish outlook for Ethereum if the SEC greenlights the products that allow traditional investors to seek exposure to ETH on the stock market without having to worry about the complexities of crypto including exchanges and storage.\n\nHowever, the Bitcoin halving due in April may turn the tables around, bolstering BTC price rally toward the end of the year and subsequently in 2025.\n\nRelated Articles\n\nJohn Isige John is a seasoned crypto expert, renowned for his in-depth analysis and accurate price predictions in the digital asset market. As the Price Prediction Editor for Market Content at CoinGape Media, he is dedicated to delivering valuable insights on price trends and market forecasts. With his extensive experience in the crypto sphere, John has honed his skills in understanding on-chain data analytics, Non-Fungible Tokens (NFTs), Decentralized Finance (DeFi), Centralized Finance (CeFi), and the dynamic metaverse landscape. Through his steadfast reporting, John keeps his audience informed and equipped to navigate the ever-changing crypto market.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxOZWRpNmFaRC1qRHNKbUY2c25TdGk0QmExQ2Y4UUtIdzdvNlNWb1VQTHNOVXhsbnkzQy1LVGtXLWR1NnFaRE1rOGVQZTEySHhONk9sYVlDTktuS1NvMGJKMzlKbjQ2eUt5dkFyVjBrWjZaeWFheWwzazg0S1FlWTVjRlpEQ0phMktaMlVIeEJFaGMwaXY5MjBPVEJzZmJuSXI0a0l1ekdEWmRJV2JqNDZ5MElUMUFxZ9IBuwFBVV95cUxQY3ppN3BjaVhfMGhYT1RjbVdIUzY0LWt4aXBRY052WE5fRGFIb1lzZkFkZFJNYUNGSnhDOG80bGk2dkh0blJSREV6WmZQMEZwT3BmRVNTNXY0R1pmR2llUlpCWDU3N19ZY3N0SWp0UE5XX1dPczl2S3FhZ3pOd2h6ZzMyUDRPdk9vS19tMHo0REFHTnc3RXl4MWJLdkRJNzYwWUNLa1o4WXYzcFpwWEFieXkwMnNTMmRIZmow?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 23 Feb 2024 08:00:00 GMT",
        "title": "Dogecoin (DOGE) 'Hidden Golden Cross' Might Surprise You, Ethereum (ETH) Breaks $3,000 Barrier, How Long Will Solana (SOL) Stay Bearish? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nDogecoin is showing a gleam of technical optimism. The recent crossing of the 100-day and 50-day EMAs is a small version of the much celebrated 50-200 EMA golden cross, often regarded as one of the most bullish signals in technical analysis.\n\nThis mini golden cross, while not as definitive as the classic version, still gives traders a reason to pay attention. Historically, such crosses have been precursors to potential uptrends. For Dogecoin, the price has been oscillating around this crossover region, suggesting a tug-of-war between bears and bulls.\n\nDOGE/USDT Chart by TradingView\n\nDogecoin's current support level can be spotted around the $0.077 mark, which aligns with the 100-day EMA. Should this level hold, it could act as a springboard, reinforcing the bullish sentiment brought about by the EMA crossover. On the flip side, if this support falters, we might see a dip toward the $0.070 threshold, where previous market activities have shown interest.\n\nIf Dogecoin can capitalize on this mini golden cross, the next target would be to test the resistance at $0.088. A break above this level with sustained volume could set the stage for a continued upward trajectory, with the $0.10 psychological barrier as the next significant milestone.\n\nAdvertisement\n\nEthereum finally scores\n\nEthereum has achieved a significant milestone by breaking through the $3,000 price barrier, a bullish signal that many investors have anticipated for the last few months.\n\nThe ascent to $3,000 marks a key psychological and technical level for Ethereum. This breakthrough is supported by a robust volume profile, suggesting that the move is backed by substantial market interest.\n\nLocal support levels now adjust to this new paradigm, with previous resistance around $2,800 potentially becoming a new support zone. Should ETH maintain its position above this level, it would confirm the strength of the current trend and possibly establish a foundation for further gains.\n\nLooking at the potential for a rally continuation from the current levels, the momentum appears strong. Investors and traders will now be eyeing the next resistance levels, which could be around the $3,200 to $3,300 range, where ETH may face a test. A consolidation above $3,000 could provide the springboard needed to challenge these higher thresholds.\n\nIn a bullish scenario, if Ethereum manages to sustain its current levels and market sentiment remains positive, there is a possibility of continued growth, potentially targeting the all-time highs seen previously. The RSI and volume will be key indicators to watch for sustaining buying pressure.\n\nSolana still losing\n\nSolana is currently exhibiting bearish tendencies. A close look at SOL's price trajectory reveals it is navigating through a potentially critical phase.\n\nAs of now, SOL is manifesting a downtrend within a bearish channel pattern. The price has recently faced resistance at the upper trend line of this channel, suggesting a possible continuation of bearish momentum. Key support levels to watch include the psychological round number at $100, followed by a more established support at around $90 which, if broken, could lead to a further slide.\n\nIf SOL fails to hold the $100 level, we could witness a steeper decline, with the next substantial support level at $90. A break below this could potentially open a path toward the $80 mark, especially if broader market sentiment remains negative.\n\nA bullish reversal could occur if SOL finds solid footing at the current support levels. For a shift in trend, SOL would need to break out of the descending channel, pushing past the immediate resistance near $110. This could indicate short-term bearish exhaustion and potentially signal the start of a recovery phase, targeting subsequent resistance levels at $120 and above."
    }
]