[
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxPa2tfb0c2Nk5UMFFoS0hSYUF3WXBUdGc5el9raWd6OUVBTko2cHVwVnV2N3lFSTlxdmxfNnM5d0E4dTM2VmZxU3l3RmxKUk9UcmctM1h4OFc0ZDJjeENxZk1ZeS0yR010XzhPcWNlTWFXQy1UT3R0ZXpNeTdadjJYVmJwdzN0cXppaDVaNndjZEYwcm1lVnA2UGg5MDQ2WHNoUTBiMUgxTEFzWlRoNEFRS2tfUdIBuAFBVV95cUxQTXdvZEpGNEVrWWdXdmVITnVMSWdKdnFRUFFXRVlFQVd6YldzVHJNWkctb3BvX05fSVRxSXdNSzJndW52ZEJYVFAyTXNRMDFKdDJXdEVna1JJVVpEejZnTl9LWndXX2FQTjkyaVJNbEFYbDhMNXN4SUhxMGJKTGVtaWkxck8xTkVMOXlDOF8tc3pQZDRaN21XdWR3V0x3b2JSWWZHZnJDcVNtOWZWa05YcWFoUGpRM2Zu?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 27 Feb 2024 08:00:00 GMT",
        "title": "PEPE and WIF Jump 50%, Putting Ethereum and Solana Meme Coins in Focus - CoinDesk",
        "content": "Such tokens are usually considered to have no intrinsic value – have recently risen in prominence as a beta bet on whichever ecosystem they are based on. Some, like the Avalanche Foundation, a non-profit that maintains the Avalanche blockchain, have even started to invest in meme tokens built on the network in recognition of the online culture and memetic value that such tokens can drive among investors."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMia0FVX3lxTE9UbE14ekUweGt0SDJwaHpnQl94b3lJdy1zaW9kQVRLa3FLazBxSzV1Q2UyMVE0OXo4NG1nVkFyNmdNdVliVXJiZkRnR200X2tJUGNrZ3dFZXNQZW1hRmhSVXFTUGJHWjktM3Bn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 27 Feb 2024 16:07:10 GMT",
        "title": "Ethereum Foundation gives Dencun upgrade an activation time on March 13 - Blockworks",
        "content": "The Dencun network upgrade has been “successfully activated on all testnets,” the Ethereum Foundation Blog announced on Tuesday.\n\n“Two years after its ETHDenver inception, dozens of testing calls and devnets later, protodanksharding is finally going live on mainnet,” the Ethereum Foundation said.\n\nDencun will be activated on the Ethereum mainnet on March 13 at epoch 269568, the blog post added. The activation will take place at 13:55 UTC, or 8:55 am ET.\n\nAccording to a post on X from Galaxy’s Christine Kim, March 13 was the expected date for the activation, though the exact timestamp was unknown.\n\nLoading Tweet..\n\nStakers will need to update their beacon nodes and validator clients to be compatible with the upgrade.\n\nAs of Feb. 22, according to Kim, “all client teams, except Lodestar, have released final software versions for the Dencun upgrade.”\n\nRead more: Ethereum’s Dencun is now live on the Holesky testnet\n\nThe upgrade was run successfully on the Holešky testnet earlier this month. It previously ran on the Goerli and Sepolia testnets.\n\nThe upgrade will introduce proto-danksharding to the Ethereum blockchain. Rollups, under EIP-4844, can add “blobs” of data on a beacon node.\n\n“The data in these blobs is not accessible to the EVM and is automatically deleted after a fixed time period (1-3 months). This means rollups can send their data much more cheaply and pass the savings on to end users in the form of cheaper transactions,” a post on the Ethereum Org’s website said in early January.\n\nThe name Dencun, the Ethereum Foundation post added, comes from a combination of star and Devcon city names. Specifically, Dencun is the combination of Deneb — a star — and Devcon 3 location Cancun.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxOQjhGWGFFRU92YlVOdkFGdm1VWUNfVFZYSWhVeWNPTTZtQzlDSzVQTjBUTzhndUtMZ1p1UUVKMXdiR29ZLTNwaHZjRFk0T2pxTG1tRklVTnJyNjJzbWY1d0RQN1lHUEhFSnFmRGU3U3dveE56QndhMFM5MzhSdXlDa3Bsbmk4ejdoZ09EWk1pLTlLbzFN?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 27 Feb 2024 08:00:00 GMT",
        "title": "Why Bitcoin, Ethereum, and Dogecoin Rallied on Tuesday - The Motley Fool",
        "content": "Major cryptocurrencies jumped amid speculation for another extended rally ahead of the first Ether ETFs.\n\nSeveral major cryptocurrencies rallied on Tuesday amid news of growing crypto adoption and speculation surrounding the timing of the first spot Ethereum-centric exchange-traded fund (ETF) approvals.\n\nWhen all was said and done during today's regular trading session, the price of Bitcoin (BTC -0.09%) was up 4.5%, Ethereum (ETH -0.78%) had gained 1.8%, and Dogecoin (DOGE 3.96%) climbed 12.2%.\n\nWith Bitcoin ETFs approved, are Ether ETFs next?\n\nThe price of Bitcoin climbed above $57,000 today for the first time since December 2021, apparently bolstered by record inflows into Bitcoin ETFs. Around $2.5 billion flowed into digital asset investment products last week, according to data from crypto research firm CoinShares, with Bitcoin funds responsible for 99% of those inflows. That influx of capital followed a historic decision last month by the United States Securities and Exchange Commission (SEC) to simultaneously approve the first 13 applications for spot Bitcoin ETFs.\n\nThose approvals, of course, were the culmination of months of speculation after the SEC declined to appeal a federal court's ruling in August that prevented crypto-asset manager Grayscale Investments from converting its popular Grayscale Bitcoin Trust into an ETF. That inaction put the onus back on the SEC to move forward with its Bitcoin ETF approval process.\n\nFor several weeks leading up to the SEC's multiple thumbs up, many opportunistic traders capitalized on a broad crypto rally while noting that ETFs are a much more accessible medium for investors hoping to put their money to work in cryptocurrencies. ETFs can be bought and sold throughout the normal trading day through nearly any online brokerage, in contrast to the previous need for investors to set up separate crypto accounts or wallets with a crypto-specific broker. The approvals also stand tall as a de facto vote of confidence from a government agency in crypto ETFs as a legitimate investment medium.\n\nStill, it's worth noting that after a multi-month rally that began in October, major cryptocurrencies initially pulled back following the official launch of the first spot Bitcoin ETFs six weeks ago.\n\nAccording to data analytics firm CryptoQuant, however, the capital influx stemming from spot crypto ETFs -- including a potential Ether ETF next -- has the potential to increase the overall cryptocurrency market capitalization by a total of more than $1 trillion over the long term.\n\nTo that end, crypto traders have now turned their eyes toward the date of May 23, 2024 -- which is the final deadline for the SEC to approve (or deny) spot Ether ETF applications from multiple investment management companies including VanEck and Ark's 21Shares.\n\nWhat's next for crypto investors?\n\nThere are no guarantees, of course, that spot Ether ETFs will be approved in May. But given the similarity of the assets and the precedent set by the dozens of now-live Bitcoin ETFs, the likelihood of an SEC denial seems extraordinarily low with the proverbial crypto ETF floodgates already opened.\n\nBut with the May 23 deadline now less than three months away, analysts at both Bloomberg and Standard Chartered have mused in recent weeks that anticipation of the first Ether ETFs could spark a similar extended rally to what we saw leading up to the first Bitcoin ETF approvals. Considering the Bitcoin ETF hype cycle appeared to spark its own rally around three months prior to those approvals, it's no surprise we're now seeing increased speculation surrounding the potential Ether ETF approval timeline.\n\n\"The Ether spot [ETF] is tied to the hip of Bitcoin spot for sure,\" mused Bloomberg ETF analyst Eric Balchunas last month. \"It's gonna go wherever it goes -- it's basically like on a 15-foot rope following it.\"\n\nIn the end, keep in mind these hype-based gains could be fickle over the short term. But there's obviously multiple billions of very real dollars each week flowing into crypto assets as the world steadily appears to be accepting it as a valid place to park capital. If that keeps happening, it will be no surprise to see the prices of major cryptocurrencies continue to rise accordingly."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxOTEJRdHVJOVFOcERpQzVHSmFfSk1za0hvY2JTajlPSjRLYWVxNTZYOHRIU2x4dWV4Q3BPalBoYmE2RVBHSHNyckNsUW5qV21jN05EZ3dEOXZxRFJZYmhyWGkwLWlEQ1Q5bWtmNXV4U2UzdGxEeVctN3B4NGJ5T0FUNkxxSWRaZ0dEU2F0b3BDSExfN2ZJa0RhdjVKcDF0Zw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 27 Feb 2024 08:00:00 GMT",
        "title": "4 Crypto Stocks to Watch in the 2024 Ethereum Institutional Rally - Nasdaq",
        "content": "The second-largest cryptocurrency in the world, Ethereum (ETH), has started 2024 on a great note. While Bitcoin (BTC), too, has been fast off the blocks, rising 20% year to date, ETH has risen 33%. Ethereum, which trails only Bitcoin in the crypto world, is known for its uses as a blockchain-powered, open-ended decentralized software platform.\n\nThe network has, over the past year, completed the Shanghai Upgrade. The upgrade has ensured that it shifts its blockchain validation system from proof-of-work to proof-of-stake. Under the proof-of-stake system, miners of Ethereum will rely on Ether holders who will act as validators, thus lending more assurance to the system. In essence, proof-of-stake allows holders of Ether to lock up their funds as collateral to validate transactions and create new blocks, reducing the need for extensive computation and energy consumption.\n\nThis has led to far stricter trading, and ETH supply has remained stagnant as a result. Also, the amount of Ether locked up has risen significantly, with ETH held on exchanges at an all-time low of 11%.\n\nHowever, per Bybit Research, the biggest boost has come from the new institutional investments. Institutions are over-allocating their portfolio to ETH compared to BTC. This is in contrast to the retail crypto market, where investors lean on Bitcoin.\n\nMajor players like Franklin Templeton and Fidelity, which already had Bitcoin ETFs approved by the Securities and Exchange Commission, are among firms that have submitted applications for an ether ETF. In fact, demand has gone up over the past few weeks, with market participants expecting a probable ether spot ETF approval by May of this year. ETH is currently trading above $3200, and the next earmarked resistance level is $3500.\n\nSo, with Ethereum already starting to make good of the state of the market, it might be prudent to keep a watch on stocks exposed to this open-source, decentralized blockchain platform. Here is a selection. These currently carry a Zacks Rank #1 (Strong Buy), #2 (Buy) or #3 (Hold). You can see the complete list of today’s Zacks #1 Rank stocks here.\n\nAccenture plc ACN: This global system integrator provides consulting, technology and other services markets Ethereum-based blockchain solutions to businesses to make it easier to process payments.\n\nAccenture’s expected earnings growth rate for the current year is 4.7%. The Zacks Consensus Estimate for its current-year earnings has improved 0.1% over the past 60 days. Accenture currently carries a Zacks Rank #3.\n\nCME Group Inc. CME: This company operates as one of the world's largest futures exchanges and offers a wide range of derivatives contracts and various solutions to invest in cryptocurrencies like Ethereum.\n\nCME Group’s expected earnings growth rate for the current year is 2.8%. The Zacks Consensus Estimate for its current-year earnings has improved 1.5 % over the past 60 days. CME Group currently carries a Zacks Rank #3.\n\nHIVE Digital Technologies Ltd. HIVE: This cryptocurrency mining company that operates in Canada, Sweden and Iceland, engages in the mining and sale of digital currencies, including Ethereum Classic.\n\nHIVE’s expected earnings growth rate for the current year is 66.5%. The Zacks Consensus Estimate for its current-year earnings has improved 11.9% over the past 60 days. HIVE currently carries a Zacks Rank #3.\n\nBlackRock, Inc. BLK: This publicly owned company, which is one of the world’s largest investment managers andwas one of the first companies from the traditional market to join the Bitcoin ETF race back in June 2023 and got it approved this January, has already entered the ETH fray by applying for spot ETF.\n\nBlackRock’s expected earnings growth rate for the current year is 4.9%. The Zacks Consensus Estimate for its current-year earnings has improved 5.2% over the past 60 days. BlackRock currently carries a Zacks Rank #2.\n\nJust Released: Zacks Top 10 Stocks for 2024\n\nHurry – you can still get in early on our 10 top tickers for 2024. Hand-picked by Zacks Director of Research, Sheraz Mian, this portfolio has been stunningly and consistently successful. From inception in 2012 through November, 2023, the Zacks Top 10 Stocks gained +974.1%, nearly TRIPLING the S&P 500’s +340.1%. Sheraz has combed through 4,400 companies covered by the Zacks Rank and handpicked the best 10 to buy and hold in 2024. You can still be among the first to see these just-released stocks with enormous potential.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nCME Group Inc. (CME) : Free Stock Analysis Report\n\nAccenture PLC (ACN) : Free Stock Analysis Report\n\nBlackRock, Inc. (BLK) : Free Stock Analysis Report\n\nHIVE Digital Technologies Ltd. (HIVE) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxOTEJRdHVJOVFOcERpQzVHSmFfSk1za0hvY2JTajlPSjRLYWVxNTZYOHRIU2x4dWV4Q3BPalBoYmE2RVBHSHNyckNsUW5qV21jN05EZ3dEOXZxRFJZYmhyWGkwLWlEQ1Q5bWtmNXV4U2UzdGxEeVctN3B4NGJ5T0FUNkxxSWRaZ0dEU2F0b3BDSExfN2ZJa0RhdjVKcDF0Zw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 27 Feb 2024 08:00:00 GMT",
        "title": "4 Crypto Stocks to Watch in the 2024 Ethereum Institutional Rally - Nasdaq",
        "content": "The second-largest cryptocurrency in the world, Ethereum (ETH), has started 2024 on a great note. While Bitcoin (BTC), too, has been fast off the blocks, rising 20% year to date, ETH has risen 33%. Ethereum, which trails only Bitcoin in the crypto world, is known for its uses as a blockchain-powered, open-ended decentralized software platform.\n\nThe network has, over the past year, completed the Shanghai Upgrade. The upgrade has ensured that it shifts its blockchain validation system from proof-of-work to proof-of-stake. Under the proof-of-stake system, miners of Ethereum will rely on Ether holders who will act as validators, thus lending more assurance to the system. In essence, proof-of-stake allows holders of Ether to lock up their funds as collateral to validate transactions and create new blocks, reducing the need for extensive computation and energy consumption.\n\nThis has led to far stricter trading, and ETH supply has remained stagnant as a result. Also, the amount of Ether locked up has risen significantly, with ETH held on exchanges at an all-time low of 11%.\n\nHowever, per Bybit Research, the biggest boost has come from the new institutional investments. Institutions are over-allocating their portfolio to ETH compared to BTC. This is in contrast to the retail crypto market, where investors lean on Bitcoin.\n\nMajor players like Franklin Templeton and Fidelity, which already had Bitcoin ETFs approved by the Securities and Exchange Commission, are among firms that have submitted applications for an ether ETF. In fact, demand has gone up over the past few weeks, with market participants expecting a probable ether spot ETF approval by May of this year. ETH is currently trading above $3200, and the next earmarked resistance level is $3500.\n\nSo, with Ethereum already starting to make good of the state of the market, it might be prudent to keep a watch on stocks exposed to this open-source, decentralized blockchain platform. Here is a selection. These currently carry a Zacks Rank #1 (Strong Buy), #2 (Buy) or #3 (Hold). You can see the complete list of today’s Zacks #1 Rank stocks here.\n\nAccenture plc ACN: This global system integrator provides consulting, technology and other services markets Ethereum-based blockchain solutions to businesses to make it easier to process payments.\n\nAccenture’s expected earnings growth rate for the current year is 4.7%. The Zacks Consensus Estimate for its current-year earnings has improved 0.1% over the past 60 days. Accenture currently carries a Zacks Rank #3.\n\nCME Group Inc. CME: This company operates as one of the world's largest futures exchanges and offers a wide range of derivatives contracts and various solutions to invest in cryptocurrencies like Ethereum.\n\nCME Group’s expected earnings growth rate for the current year is 2.8%. The Zacks Consensus Estimate for its current-year earnings has improved 1.5 % over the past 60 days. CME Group currently carries a Zacks Rank #3.\n\nHIVE Digital Technologies Ltd. HIVE: This cryptocurrency mining company that operates in Canada, Sweden and Iceland, engages in the mining and sale of digital currencies, including Ethereum Classic.\n\nHIVE’s expected earnings growth rate for the current year is 66.5%. The Zacks Consensus Estimate for its current-year earnings has improved 11.9% over the past 60 days. HIVE currently carries a Zacks Rank #3.\n\nBlackRock, Inc. BLK: This publicly owned company, which is one of the world’s largest investment managers andwas one of the first companies from the traditional market to join the Bitcoin ETF race back in June 2023 and got it approved this January, has already entered the ETH fray by applying for spot ETF.\n\nBlackRock’s expected earnings growth rate for the current year is 4.9%. The Zacks Consensus Estimate for its current-year earnings has improved 5.2% over the past 60 days. BlackRock currently carries a Zacks Rank #2.\n\nJust Released: Zacks Top 10 Stocks for 2024\n\nHurry – you can still get in early on our 10 top tickers for 2024. Hand-picked by Zacks Director of Research, Sheraz Mian, this portfolio has been stunningly and consistently successful. From inception in 2012 through November, 2023, the Zacks Top 10 Stocks gained +974.1%, nearly TRIPLING the S&P 500’s +340.1%. Sheraz has combed through 4,400 companies covered by the Zacks Rank and handpicked the best 10 to buy and hold in 2024. You can still be among the first to see these just-released stocks with enormous potential.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nCME Group Inc. (CME) : Free Stock Analysis Report\n\nAccenture PLC (ACN) : Free Stock Analysis Report\n\nBlackRock, Inc. (BLK) : Free Stock Analysis Report\n\nHIVE Digital Technologies Ltd. (HIVE) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    }
]