[
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxOeml5NHJWQmpJY0hPdWZQR1VWcXpuZ1N5TzZRUHZPZlpJNDFybzJmVmNzdzNQOHVfVWN4N0hkQ2VxdUJHMlpPVl9lNzB5TDEtcTB2dFJ3R2NDMjFvQXp0M0pJRVI3NjRydmJYU3lqZHZEeG9hMDdIY1hBX0ZhZVdqMTJDc9IBiAFBVV95cUxOTWdWeEJLaUVMSndJTmVucW9Hb01WdVpyWDJoTFc2dVVrNG1adkRqbnI4UEZwN3BVUF93d2s3ZG4yNzNtZ1VlWDNONXJ2eHNGLXJsUGFIeWttdHdjTFBvdHdBOG5BazhoR1hmUWloV094NllHNnF6MGFVRFhTMHVmRERDOEM3M0hK?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 May 2024 07:00:00 GMT",
        "title": "Exploring Ethereum's Staking Expansion: Potential for Growth and Innovation - CoinDesk",
        "content": "The next Ethereum upgrade, Pectra, will likely take place by the end of 2024, or in early 2025. One of the key proposals, EIP 7251, can provide a better UX for validators to earn staking yield. This proposal will increase the max effective balance of validators from 32 to 2048. Leading staking service providers, like Coinbase, are managing more than 130,000 validators already. The lift in maximum effective balance allows these providers to consolidate the number of validators and ultimately increase efficiency and lower the cost of operation."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxPaFItMlVrVTFhOTRaa1pqcUlCdW83Y2VFMnRETk1SZk1pcncweUdiUjUwVXdMbzlGU0FGWW9IdTRUNUVLY2tjZjhyZDVfZm9DWDJaSV9SSkxjYTdrbkw2RkxkZFdQTzhJcDVGOENDekF4MzZ5Mm9aVUllOFB2UzNvN0FURW5vcHpHRlNtTURKMWNtaDVBZlQ5SVN5cHlOQVpxZlNsRlNTeXdsYllFX3FpR2hR0gG3AUFVX3lxTE5UZXh0R2FYbDRHWDdMdzh1NEU4TlBFRVJKV0QxX01TWUs0RnR2MURqLUJvb2d3T29qbmFRVmdlRWVwMEVXRkduQ3AzYmw5SXVQZlRoRjVjOHZrZjI3Wkc1T0NUeUhsRUxMRXp5WVkzLUhZSmhNMEI4S0w3WTVBOWlRU1dKd2pHWjJBNmY2STFCa04tdDRkNk12S09weWdoVl96cG9KX25wcy04UkxWUzR0RG5IZFpTMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 May 2024 07:00:00 GMT",
        "title": "Brothers Accused of $25M Ethereum Exploit as U.S. Reveals Fraud Charges - CoinDesk",
        "content": "The brothers created 16 Ethereum validators and targeted three specific traders who operated MEV bots, the indictment said. They used bait transactions to figure out how those bots traded, lured the bots to one of their validators which was validating a new block and basically tricked these bots into proposing certain transactions. The brothers allegedly frontran the bots on certain trades and also used their validator to \"tamper with\" the new block by sending a false digital signature that gave them access to the block's full contents and replaced \"lure transactions\" with \"tampered transactions.\" In those tampered transactions, the brothers allegedly sold illiquid cryptocurrencies they had tricked the victims' trading bots into placing buy orders for."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMibEFVX3lxTE43VEJKZHBYNndrb29FZW1mdzExTWZBbTNzVXhlYXFzMlNKVTRvMlVUdWhnVFdyaEUtdG9JTFZzQVI4LW5vajdqSWJ6MmVpVzUxZGMyRlZXamxQeWxJSk43UGxFalFjWkZ2NmJCQw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 May 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum prices rise after U.S. inflation report - crypto.news",
        "content": "Bitcoin and stocks experienced a notable price increase following the release of the April U.S. inflation data.\n\nThe Consumer Price Index (CPI), which measures the average change over time in the prices paid by urban consumers for a market basket of consumer goods and services, indicated a 3.4% increase in consumer prices from last year.\n\nThe year-over-year inflation figure represents a slight decrease from March’s inflation rate of 3.7%, as reported by the U.S. Bureau of Labor Statistics (BLS).\n\n24-hour price of BTC from CoinMarketCap\n\nShortly after the BLS published its findings, Bitcoin’s price (BTC) reached $64,492, marking a 4% rise over the past 24 hours and a 1% increase within the last hour, according to CoinMarketCap.\n\nYou might also like: Legal experts weigh-in on case against Roger Ver\n\n24-hour price of ETH from CoinMarketCap\n\nSimilarly, Ethereum (ETH), the second-largest cryptocurrency by market capitalization, increased its price to $2,960.94, up 1.87% from the previous day and 1% from an hour earlier.\n\nThe BLS highlighted housing and gasoline as the primary contributors to the inflation rate in April, reflecting ongoing economic pressures in these sectors."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxPVGNnWkViaWxFNUVMTGVpdFRfUFphRVBXbDlmNXJjbDUzUkxIM3JsWmlRUVA5QVZTdWVNTF9oQ3Blc0ZZd2xyR0ZDd055NXR5QldMT1V1U0xXYXNOZzgyeU8xX3BuOVdCWTNEcDlvbEZWVnJ6djhfSk9LOHJkaTlDck1RcXV5ZUc5NVQ3aElMaUZjdVHSAZsBQVVfeXFMUFVfMGdhblByQnNTUWE3SmExamlua19LeGMwenZUZEJQQkxpMFIyUlRUN2MxemUwckFybDJ4WDZJaEMwYzFyUFlZU19ka1ZXdEViV3dxSmVnbWZNRl91V3ZaRVlseHlvQU8wZEFsb0NuQ0VTWVlQeW5BNUhfRnRrNnNEYmxLa2FWM1JEUEJQMk5WLWhnd0R3cFJzdTA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 May 2024 07:00:00 GMT",
        "title": "Bitcoin and Ethereum Steady Ahead of U.S. Consumer Prices Report - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin and Ethereum, the two largest cryptocurrencies by market capitalization, were steady hours heading into another U.S. Bureau of Labor Statistics consumer prices report.\n\nThe new Consumer Price Index report will be released at 8:30 a.m. EST. For now, things seem pretty tame in crypto markets.\n\nBitcoin price sitting just above $62,000—up 0.6% compared to the same time yesterday. And the Ethereum price, which had sunk to around $2,900, was down 0.2% since Tuesday morning, according to CoinGecko data.\n\nEconomists have been forecasting that the market is in for another disappointingly high Consumer Price Index report today. The CPI is one of the key metrics that the Federal Reserve uses to determine whether it should lower the federal interest rate. But analysts have flagged that gas prices have been on the rise and prices have been inching upwards in the services sectors.\n\nAD\n\nAD\n\nIt's bad, but not necessarily terrible news, Michael Pugliese, senior economist at Wells Fargo, told Morningstar.\n\n“The trajectory is still down,\" he said, \"but it’s been a more gradual downward move relative to the expectations coming into 2024.”\n\nWhen the BLS issued its March Consumer Price Index report last month, it showed that personal expenditures in the U.S. had grown by 3.7%. The news that the U.S. economy had been growing slower than expected caused BTC and ETH to dip.\n\nBitcoin started the month having sunk below $60,000, briefly touched $65,000, and triggered the liquidation of hundreds of millions worth of derivatives positions along the way. More recently, the mix of macroeconomic factors—including the war in Israel's War on Gaza and slowed growth in major economies like the U.S.—has sparked pessimism in crypto markets.\n\nAD\n\nAD\n\nBut there's a little good news: Bitcoin billionaire Arthur Hayes said earlier this month that the bottom for BTC is already in.\n\n\"I expect prices to bottom, chop, and begin a slow grind higher,\" he wrote in a recent blog post. But he noted that he wasn't planning to add more Bitcoin to his bags.\n\n\"The recent intense puke out provides an excellent opportunity to unstake my USDe and spend synthetic dollars on high beta shitcoins,\" Hayes said. \"I’m buying Solana and doggie coins for momentum trading positions.\""
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxOUC1YOGhqeGVzNjZHY2w5SHlFWlVJZnBYUGdPTXBxOW5ObnhWYk1uYlQ3WGlsMnZDU2s1UU5YQXNjbjUxT3JfRklST2JHa1cxUGc5bHpMc2UzZ0pnVXJNS2FGMTBTNnZoYU1nTEowMDFHcTVDcDBTa0ZuN3MtT3k0QVNIbEFHN05vTFRYZzRwUVY4MG1XOHhrN0RGSEFKaXZGM3lWbzJhSUtTUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 May 2024 07:00:00 GMT",
        "title": "Ethereum Scaling With L2s Has Damaged Its Tokenomics. Is It Possible to Fix It? - Unchained",
        "content": "While Ethereum layer 2s are at an all-time high in terms of active addresses and transactions, the mainnet may not be doing as well.\n\nEthereum, often celebrated for being “ultrasound money” owing to its deflationary bent, has turned inflationary again over the past month, challenging the foundational principles that its community thought drove its value. A recent report from CryptoQuant has declared the ultrasound money narrative dead, sparking debates and concerns about the tokenomics of ETH.\n\nLearn more: What Is Tokenomics? A Beginner’s Guide\n\nThe core of the issue lies in the balance between Ethereum’s main chain and its Layer 2 scaling solutions (L2s). While L2s have successfully improved Ethereum’s scalability by handling transactions off the main chain, they have inadvertently reduced the demand for Ethereum’s native token, ETH, on the main chain. This reduction in demand has led to lower transaction fees, measured in gwei, and subsequently, less burning of ETH. Currently, gwei sits at around 8, significantly lower than in previous times, indicating that at this level, ETH is far from being deflationary.\n\nRead more: Why Ethereum Gas Fees Have Fallen to Their Lowest Level Since 2020\n\nEthereum can shift from deflationary to inflationary due to changes in network activity and the balance of Ether burned versus issued. Under EIP-1559, when transaction volumes are low and the burned base fees are less than the Ether issued in block rewards, the total supply of Ether increases, making Ethereum inflationary. This dynamic demonstrates how Ethereum’s supply is not fixed but responsive to network usage, potentially impacting its value and scarcity when shifts from a deflationary to an inflationary state occur.\n\nMeanwhile, Ethereum L2s are ripping, processing 10 times more transactions than the main chain, while reaching an all-time high in weekly active addresses.\n\nGiven these levels of gas fees, the question arises: how much activity needs to happen in the L2s for ETH to become deflationary again?\n\nRead more: Horizontal Scalability Is the Solution to L2 Fragmentation\n\nA Complex System\n\nAnsgar Dietrichs, a researcher from the Ethereum Foundation, told Unchained that the deflationary mechanism of ETH is directly tied to its market cap and the balance between revenue and expenses. At low prices, the burning mechanism can exceed the issuance, making ETH deflationary. However, as the market cap grows and if revenues don’t keep up proportionally, ETH can become inflationary.\n\nThis bidirectional influence means that the market cap not only affects the deflationary or inflationary nature of ETH, but also that this nature, in turn, affects the market cap through investor perceptions and behaviors.\n\nTo reverse this trend and restore the deflationary status of ETH, a significant increase in activity on L2s is required. This means that more transactions and fees need to be funneled back to the Ethereum main chain to increase the burning of ETH. However, according to Dietrichs, research has not been done to assess exactly how much activity it would take. Neither the Ethereum Foundation nor researcher Justin Drake responded to several emails requesting additional information on how much L2 activity is needed to keep ETH supply deflationary.\n\nIn addition, Dietrichs pointed out that for any given revenue and issuance level, with constant investor preferences, there is essentially one specific equilibrium market cap that the market would trend towards. Any change in these factors—revenue, issuance, or investor preferences—shifts this equilibrium market cap point. This dynamic feedback loop suggests that addressing the deflationary challenge is not just about tweaking a few parameters, but about understanding and influencing a complex system of interrelated factors.\n\nAs Ethereum continues to evolve, the question remains: Can the foundational promise of ultrasound money be restored, or will Ethereum have to adapt to a new economic reality?\n\nLearn more: A Beginner’s Guide to Ethereum Layers: Data Availability, Consensus, and Execution"
    }
]