[
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxQbV9HdUNYa1JOYnRSc1dVYnVpNHloR3BjWWY4OURfZF83aUlwOHgzd2RHeDhtOF81bGZRTUMxSGM0djhkX0haWUdqWjJfMXpNNjlEc1c4cWQxbVVDb2F3RmNTbC01MUYxTHZxSVRIN3NnSmxfd1FwMzIzQWhLQk5aN2RMNDQzdml3c1NGbDdR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Feb 2024 08:00:00 GMT",
        "title": "Ether Price Hits $3,000 for First Time Since April 2022 - Unchained",
        "content": "Ether’s trip to $3,000 may have been short-lived, but on-chain data and the state of the wider ecosystem suggests that there’s reason to be optimistic about the digital asset.\n\nEthereum’s native token ether (ETH) hit a near two-year high ahead of $3,000 on Tuesday – the first time it has traded at this level since April 2022.\n\nThe second largest digital asset by market cap rallied over 12% in the last week and briefly changed hands at $3,031, according to data from CoinMarketCap. At the time of writing, ether had failed to gain momentum towards a move higher, suggesting that this resistance level won’t be so easy to breach.\n\nFrom a psychological perspective, this recent rally could also have some traders on their toes, given the last time ether rallied to this level in the weeks leading up to April 3, 2022. At the time, ether rallied from $2,520 over three weeks to a high of $3,580, but its price plummeted 46% over the next 40 days that followed.\n\nIn its most recent review of the crypto market, onchain analytics firm Glassnode noted that while Bitcoin dominance still remains significant, there are early signs of more investor capital rotating into other ecosystems like Ethereum and Solana.\n\n“We note that following the approval of the bitcoin ETF, ether has started to outperform bitcoin, which is a change from the relative underperformance throughout 2023,” said the Glassnode analysts.\n\nIt is also likely that major inflows into ether will only materialize over the coming weeks, as they tend to lag relative to bitcoin inflows on account of investors looking for confirmation that digital asset markets are growing.\n\n“In the 2021 cycle, the peak influx of new capital into bitcoin occurred 20 days before the peak influx into ether,” said Glassnode analysts.\n\nOptions market data suggests that a retest of some crucial price levels might come sooner rather than later. Coinalyze data points to more bullish bets on the price of ether, showing that 59% of traders were in long positions over a 24-hour time frame."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxOTm5VME9xRVBQN3Fxd1htdHF2endtM3BtNU5rc19TbHJGV0JoelVwM3ZHb1cxM04tVGxUZmJONnFVelZJd1dOaUluZzJSNmxJbDhmT3NJZXEzVzNaM1hwMG1fVWxwdWJJTTJRT2JaSEdIZmhYbUR2cjdsT1ZGOVpXclJmVnBlUHNjekNYMnZlSm5oOEhLa254V0RtM3JsalI1TnVZZEQ5Qmc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Feb 2024 08:00:00 GMT",
        "title": "Spot Ether ETFs Could Introduce New Concentration Risk in Ethereum: S&P Global - Unchained",
        "content": "An increase in ether staking ETFs could affect Ethereum’s validator mix, and potentially increase the network’s concentration risk, say analysts from S&P Global.\n\nS&P Global said that an increase in ether staking ETFs could affect the mix of validators, and potentially increase the network's concentration risk.\n\nUS ether spot exchange-traded funds (ETFs) could be approved as early as May this year, but certain funds with staking functionality could introduce new concentration risks for the Ethereum blockchain.\n\nIn a Feb. 20 report, analysts at S&P Global said that an increase in ether staking ETFs could affect the mix of validators participating in the Ethereum network’s consensus mechanism.\n\nThe S&P analysts, Andrew O’Neill and Alexandre Birry, noted that while the participation of institutional custodians could reduce the current concentration on the decentralized staking protocol Lido, it could also introduce new concentration risk if a single entity is chosen to stake the bulk of ether included in these ETFs.\n\nLido is the largest Ethereum validator with $29.2 billion in total value locked (TVL), according to DefiLlama. Industry watchers have often pointed to the staking provider’s dominance in the liquid token staking market as a concern, arguing that Lido’s 31% market share presents a significant centralization threat to Ethereum.\n\nHowever, Marin Tvrdić, the protocol relations contributor for Lido, explained in an interview with CoinDesk last year that neither the decentralized autonomous organization (DAO,) nor the protocol itself, holds custody of users’ ether, or staked ether.\n\n“At no point is it a custodial solution,” Tvrdić said. “At every single point in time, from the moment ether enters the protocol and gets deposited on a validator, it’s self-custodial.”\n\nS&P’s O’Neill and Birry believe that spot ether staking ETF issuers are unlikely to choose decentralized protocols like Lido, but rather an institutional crypto custodian.\n\n“Coinbase acts as a custodian in eight of the 11 recently approved U.S. bitcoin ETFs and is named as a staking institution by three of the four largest ether staking ETFs outside the U.S,” they noted.\n\n“The effect of U.S. spot ether ETFs on concentration risk, be it positive or negative, could be significant, which makes constant monitoring of concentration risk even more important,” they said.\n\nCurrently, there are eight spot ether ETFs being considered by the U.S. Securities and Exchange Commission (SEC), including Cathie Wood’s Ark Invest and 21Shares, Grayscale Investments, BlackRock, VanEck, Hashdex, Invesco and most recently, Franklin Templeton."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiXEFVX3lxTE9xU1hOeWRDbDJ2UUVQVTBuY05EeGJ0bTAtZXdZVHVfbXM5bWk4SHdPbUVRLVN6REo2QTRXUl9seGV6Q3ljdThTQnJfRmNjcG56WnBuRkcySnU3NUQw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Feb 2024 08:00:00 GMT",
        "title": "Solana Price Eyes $150 after Receiving $26M from Ethereum - crypto.news",
        "content": "On Feb. 20, Solana TVL surpassed $2 billion for the first time in 2 years, and funds flowing in from Ethereum through the Wormhole bridge suggest more SOL price gains ahead.\n\nSOL‘s price has lost steam after soaring to a new 2024 peak of $118.40 on Feb. 15. However, an on-chain data trail of funds inflows trickling down to Solana from the Ethereum (ETH) network this week could spark a SOL price rebound toward $150.\n\nSolana price dips 12%, falling below market average\n\nIn the first half of February 2024, Solana was at the forefront of the crypto market rally, with SOL price soaring 26.8% and adding nearly $11 billion to its market capitalization. But that market trend flipped on Feb. 15 as investors began to take profits once the SOL price reached the 2024 peak of $118.\n\nSolana (SOL) price performance vs. Total3 Altcoin Market Cap (Excluding BTC and ETH) | Source: TradingView\n\nAt press time on Feb. 21, Solana is trading at $103, down 12% from its Feb. 15 peaks.\n\nMeanwhile, in contrast, the total altcoin market has grown by 5% during that period. Solana’s negative price performance seems driven by insiders and existing holders’ booking profits rather than macro factors.\n\nSolana receives $25 million in inflows from Ethereum\n\nHowever, while some SOL traders are taking chips off the table, the Solana network has continued to make some giant strides this week, which could trigger an early price rebound.\n\nIn the past week, Solana has received significant inflows from Ethereum as investors increasingly look to leverage Solana’s more efficient and cost-effective defi services.\n\nBetween Feb. 14 and Feb. 21, investors transferred funds worth over $24.6 million from Ethereum to Solana, per on-chain data from Wormhole bridge Explorer.\n\nFund Outflows Ethereum (ETH) to Solana (SOL), Feb. 13 – Feb. 21 | Source: Wormhole Bridge\n\nThis indicates that Solana continues gaining traction among developers and defi users due to its high throughput and low transaction costs. Hence, this rising flow of funds bridged into Solana-hosted decentralized applications (dApps) is a bullish indicator of its growing adoption and utility.\n\nSolana defi TVL hits $2 billion milestone\n\nInvestors transferring funds worth over $24.6 million from Ethereum into the Solana ecosystem, despite the 12% decline in Solana’s price over the last seven days, shows an evident divergence between short-term price movements and long-term investor sentiment.\n\nSolana (SOL) Total Value Locked (TVL) hits $2 billion, Feb. 21, 2024 | Source: DeFiLlama\n\nThe latest wave of fund inflows has now propelled Total Value Locked (TVL) on the Solana network above the $2 billion milestone for the first time since June 2022.\n\nThis further underlines that the ongoing SOL price pullback is not driven by any discernible deterioration of Solana’s fundamental network growth metrics.\n\nIf the trends persist, the rising demand for Solana defi service could eventually evolve into market demand for native SOL tokens and ultimately trigger a bullish price reversal towards the $150 territory in the coming weeks."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxNRk9tMnRLa3RocTF1MUF4X2c1VS0wbFZYcWRIWi1uNFFja3poaVdXT2lQeXFmLVlDSXFSQTh4Si00TmZ4bnBWcV8yU1V4aVBJUHhUSy1TRnBxUmRxNjNLZjJWbVBqTk5ha3RjWm5tRXhGczFmSGJOeTlyVDUwTlVXTTRuRdIBiwFBVV95cUxOS2JseFU5bE03dDFCcGFTLU51WEh0d0x4OTY4Q1o4cDZLVm1xcWtrS0FpY0NLOXlvd3l3NV9LT1pBcXhrWDBNUU9fSXh3UkR5Q3dzQ0VlaGhCYmNpRWttVDg3NnA1Z2lLT0tOdWx1b0Y0OHRzcHd1WHVsZzdQNXd6V0xMdkpIenI0Vk80?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Feb 2024 08:00:00 GMT",
        "title": "Portal Launch Set as Binance Offers 50 Million Ethereum Gaming Token Rewards - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAfter an airdrop farming campaign that prompted hopeful recipients to flood Crypto Twitter with tweets, the Portal gaming token finally has a launch date—and it comes with the announcement of a Binance Launchpool campaign that will offer up another way for crypto users to earn a potentially sizable stash of PORTAL.\n\nPORTAL will launch on February 29, according to the Binance Launchpool campaign page, and the crypto exchange will list the token at 10am UTC (or 5am EST). The Launchpool campaign will debut tomorrow, February 22, and offer token staking rewards ahead of the listing.\n\nBinance customers who stake either Binance Coin (BNB) or the FDUSD stablecoin into PORTAL liquidity pools can earn a share of the total rewards pool, which numbers 50 million tokens—that’s 5% of the total PORTAL supply of 1 billion Ethereum-based tokens.\n\nAccording to Binance, the token will debut with a circulating supply of 167,134,615 PORTAL, or about 16.7% of the total supply. However, Binance’s Launchpool campaign is not available to users in many countries, including the United States, Canada, Australia, Japan, and more. A full list can be found here.\n\nAD\n\nAD\n\nPortal has yet to announce details about the actual airdrop distribution following a farming campaign that spanned November and December last year. A Portal representative told Decrypt’s GG that details will be announced before the Binance token listing.\n\nIn pre-market trading on Whales Market, the PORTAL token is commanding bids of $1.02, which puts the total estimated value of the Binance rewards pool at just a hair over $50 million.\n\nWhat is Portal? Billed as a cross-chain crypto gaming platform and token, it’s designed to bridge the gap across various ecosystems, providing one place to play, discover, and transact across popular blockchain games.\n\n⚡ Portal x @binance ⚡ The moment you’ve all been waiting for is nearly here. On Feb 29, 10am UTC, $Portal will officially launch on @binance. This is just the beginning. We’ve got so much to show you about Portal and the products we’ve been building. Get ready! https://t.co/zge4Prs1n1 — Portal (@Portalcoin) February 21, 2024\n\nAD\n\nAD\n\nSome of Portal’s founding team members and advisors are associated with SuperDuper, the startup behind Ethereum NFT collection Creepz, including Chief Business Officer Dan Keene, who serves the same role at SuperDuper. Advisors Jamie King (ex-Rockstar Games) and Matt Dixon (ex-Electronic Arts) are among those who also advise SuperDuper.\n\nPortal is represented by prominent Hollywood agency WME. Beyond the airdrop farming campaign, the project also held a presale in December that attracted nearly $10 million worth of interest across Ethereum and Solana in just 15 minutes alone.\n\nThe Portal campaign comes right after Binance concluded a Launchpool push for PIXEL, the Ethereum token of the Ronin network game Pixels. PIXEL was listed Monday and generated more than a billion dollars worth of trading volume in less than a day, making it one of the top 10 most-traded cryptocurrencies in the world that day, per data from CoinMarketCap.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxPbEdfbHRCZzBFUFdMRldIUXNPbUJxSXA4eHBiaXNSYndXMm9ybVYxSDdqWDczTTM5LVplUnczRWhUNXAtd2l4bUFiV1BvOTVZLWdlZkI5WDFuMGVRWm9aSVQ2WHdhcVVvWThlaVNvMm43TmVPUW1EdTJTdnVuSW45ME54N1kyUjZseHVfUzh5VDI3dTFLZnhLRGZmNWQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 21 Feb 2024 08:00:00 GMT",
        "title": "First Bitcoin, now Ethereum. Analysts see four drivers behind an even bigger surge - DLNews",
        "content": "With the Bitcoin ETF dust settled, analysts are now turning to Ethereum.\n\nSeveral key catalysts could see Ether outperform Bitcoin this next cycle.\n\nOnchain activity is already on the rise, specifically for stablecoins built on Ethereum.\n\nThe immensely successful launch of Bitcoin spot exchange-traded funds in the US is setting the stage for a new wave of speculation.\n\nThis time, it’s all eyes on Ethereum.\n\nThe Securities and Exchange Commission has a good chance of approving Ethereum spot ETFs in May, analysts told DL News.\n\nThat’s not the second-most valuable cryptocurrency’s only tailwind, either.\n\nSEC’s next ETF hurdle\n\nWith Bitcoin ETFs now out of the gate, analysts are turning their attention to Ethereum and its slew of catalysts.\n\nAt the top of the list: The SEC might greenlight a slew of Ethereum spot ETFs in May. BlackRock, Fidelity, and other Bitcoin spot ETF issuers have already filed applications to launch such products.\n\n“While the Ethereum ETF isn’t as much of a guaranteed approval as the Bitcoin ETF, the market has now gotten a taste of what to expect when it is approved,” Quinn Thompson, head of capital markets at Maple Finance, told DL News.\n\nOver $10 billion has already flowed into Bitcoin ETFs, excluding Grayscale’s fund, which already existed prior to its conversion into an ETF. The action has helped buttress Bitcoin’s hefty 21% rally since the year’s start.\n\nJoin the community to get our latest stories and updates\n\n“Given Ethereum’s smaller market cap and liquidity, a similar or lesser amount of flows would have an even bigger impact on Ethereum’s price,” said Thompson. “The market will begin to reprice this possibility higher over the next one to two months ahead of more clarity from the SEC.”\n\nBrian Rudick, senior strategist at crypto trading firm GSR, told DL News he saw the odds of Ethereum ETFs being approved at roughly 66%.\n\n“The experts I’m seeing give May approval odds between sub-50% to 70%,” he said. “Almost everyone, however, thinks it’s only a matter of time, since Ethereum futures-based ETFs exist already — if denied in May, the SEC will get sued, and approval moves to 2025.”\n\nUsers of the crypto-powered prediction site Polymarket price approval odds at 47%.\n\nThe deadline for approval is May 23, says Bloomberg Intelligence ETF analyst James Seyffart. That’s the final deadline for VanEck’s application.\n\nThe SEC will likely want to greenlight all applications at the same time, just as it did for Bitcoin spot ETFs.\n\nSeyffart and fellow Bloomberg Intelligence ETF analyst Eric Balchunas said last year that the agency wanted to avoid being a “kingmaker” by approving a fund ahead of others — like when it allowed ProShares to launch its Bitcoin futures ETF before anyone else.\n\nDencun, EigenLayer and Ethereum’s burn\n\nEthereum has three other tailwinds, too.\n\nScheduled for March 13, the Dencun upgrade — designed to enhance scalability and reduce transaction fees on layer 2 solutions — is Ethereum’s most significant upgrade since Shapella, which allowed stakers to finally withdraw their ETH from the network.\n\n“Layer 2s are a vital component of Ethereum’s future success,” CCData research lead Joshua de Vos told DL News. “Improving their scalability and cost-effectiveness is going to enhance the attractiveness of Ethereum compared to competing layer 1s such as Solana.”\n\nThe rise of restaking protocols such as EigenLayer is another reason traders may flock to Ethereum, Rudick pointed out.\n\nAnd stablecoin growth on the network is an indication that activity was ready to pick back up, Thompson argued. Ethereum stablecoin supply is up 4.4% since January 1, from $68 billion to $71 billion, according to DefiLlama data.\n\nFinally, Ethereum’s monetary policy may also play to the bulls. Vigorous onchain activity means the network burns even more Ethereum per transaction. If this destruction outpaces issuance — or how much new Ethereum enters the market — it can create a deflationary dynamic.\n\nSince February 8, for example, there has already been more Ether destroyed than created, per data from ultrasound.money.\n\n“In a bull market where onchain activity is increasing, stablecoin supply growing and user adoption scaling at a higher pace, Ethereum is positioned to outperform Bitcoin given its more levered to economic activity in the crypto ecosystem,” Thompson said.\n\nCrypto market movers\n\nBitcoin is down 0.3% in the last 24 hours and trading for $51,217.\n\nEthereum is trading flat over the same period, now at $2,912.\n\nWhat we’re reading\n\nTom Carreras is a markets correspondent at DL News. Got a tip? Reach out at tcarreras@dlnews.com"
    }
]