[
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMia0FVX3lxTE1FMjV1SGZxWWFtU0Q2TlZfMGlxY2E0QVJDQmpLRlZyQ3huTlFydmRXQ3YtWGxOeEdTOVJpWHVOc1dOdzBmdUxsajJ2azd4LTFzMFBFSzRTcGl3OUVEUEh6V2ZUd3JCV2dBdGgw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 May 2024 07:00:00 GMT",
        "title": "Ethereum devs set Pectra upgrade for Q1 2025 - Crypto Briefing",
        "content": "The upgrade will replace EIP-3074 with EIP-7702, proposed previously by Ethereum developers, including Vitalik Buterin.\n\nShare this article\n\nEthereum’s anticipated Pectra upgrade is now scheduled for release by the end of Q1 2025, according to recent updates from Ethereum developers. Pectra is the next major milestone on Ethereum’s development roadmap, following the Dencun upgrade which was successfully deployed in March.\n\nSome more up to date thoughts the next hard fork after Cancun, Pectra (Prague + Electra):\n\n* Ship Pectra by end of Q1 2025.\n\n* Include PeerDAS for Rollups to scale.\n\n* Include EOF for improving the EVM on both L1 and L2. Longer doc inside.\n\nExcited for the conversation to continue. https://t.co/lNwYg0I4vj pic.twitter.com/80dJfALaSv — Georgios Konstantopoulos (@gakonst) May 23, 2024\n\nThe decision comes after Ethereum developers evaluated multiple timeline scenarios. The team has opted against a rushed release before Devcon in November 2024, favoring a more cautious approach that allows for the inclusion of additional, impactful user features.\n\n“We are observing that this is also what happened with Cancun, so being realistic, my vote would be to aim to ship Prague in Q1 2025. With today’s scope, delaying Prague seems to have marginal impact on users and allows us to consider expanding the scope to include more impactful features for users,” Ethereum developers noted in a document.\n\nDevcon is the largest developer summit in the Asia Pacific region. This year, the event will take place in Bangkok, Thailand, from November 12-15, aiming to bring together developers, technology leaders, and dev-tool companies to learn, discuss, and debate the key opportunities and challenges in the developer ecosystem.\n\nAvoiding releasing the Pectra upgrade before/during Devcon will allow the developer team to effectively monitor the execution of Pectra.\n\nDuring the deployment of Dencun on the Goerli testnet in January, Ethereum developers encountered difficulties achieving consensus within the expected timeframe. The issue was then resolved, allowing the Goerli testnet to finally reach consensus.\n\nIn addition to the upgrade timeline, the focus is on improvements in the consensus layer scope and execution layer scope. Developers aim to integrate PeerDAS into Pectra to enhance Ethereum’s Data Availability capacity ahead of the Osaka upgrade, as noted in the document.\n\nEthereum’s Osaka upgrade is a future hard fork that is expected to include features that were previously considered for the Pectra upgrade but have been postponed. Specifically, the Osaka upgrade is likely to include the implementation of Verkle Tree, a new data structure designed to enhance Ethereum’s scalability and decentralization.\n\nDevelopers also considered the inclusion of EOF to improve smart contract security and developer experience, as well as other enhancements like replacing EIP-3074 with EIP-7702 for better account abstraction compatibility, and patching EIP-2935.\n\n“We need to decide on EIP7702 on ACDE, and if so, implement it as a replacement for EIP-3074. We think it makes sense to do so as it’s a more native-AA compatible solution because of the new transaction type vs an opcode,” Ethereum developers wrote.\n\nEIP-7702 is a new transaction type proposed by a group of prominent Ethereum developers, including Vitalik Buterin, earlier this month. The proposal is expected to bring similar benefits to EIP-3074 while addressing its potential risks."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTFBSRi1wbllzS0FaRGkyV1ZzbkhQTml2SDY5R2ZZRHcwWlNQWHFhbzJiYV85SVFkLVlObHpQc3dkbXFvcU5tYWhsNFp3V0pKSUxzdy1ZNkdOVHBwVnhrX3dpTjVpQzFkSzZFTVVONEdpZGlEWEcyTHN6WDFRUm85UQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 May 2024 07:00:00 GMT",
        "title": "Enterprise Ethereum Alliance (EEA): Meaning, Examples, and Membership - Investopedia",
        "content": "What Is the Enterprise Ethereum Alliance (EEA) ?\n\nThe Enterprise Ethereum Alliance (EEA), launched in February 2017, brings together various start-ups, Fortune 500 companies, technology vendors, academics, and Ethereum subject matter experts to work on Ethereum as an enterprise-grade technology.\n\nKey Takeaways The Enterprise Ethereum Alliance (EEA) \"...is a member-led industry organization whose objective is to drive the use of Ethereum blockchain technology as an open standard to empower enterprises.\"\n\nThe EEA's mission is to deliver an open, standards-based architecture and specification to accelerate the adoption of Enterprise Ethereum.\n\nThe EEA provides its members a community and access to educational material and various technical and media resources.\n\nHow the Enterprise Ethereum Alliance (EEA) Works\n\nAlthough many technology giants and businesses had been supporting Ethereum via Cloud services and working towards its adoption, most efforts towards its scalability, privacy, and interoperability remained scattered until the Enterprise Ethereum Alliance came into being.\n\nThe alliance aims to build, promote, and support Ethereum blockchain technology best practices, standards, and a reference architecture capable of handling real-world applications and usage.\n\nLaunched in 2015, Ethereum is a blockchain-based, decentralized software platform that enables smart contracts and Distributed Applications (dApps) to be built and run without downtime, fraud, control, or interference from a third party.\n\nEthereum is not just a platform but also a Turing complete programming language running on a blockchain that helps developers build and publish distributed applications.\n\nThe potential applications of Ethereum are wide-ranging, and this has attracted several enterprises to explore the technology. Ether, the cryptographic token used on the Ethereum platform, is the second most popular cryptocurrency in terms of market capitalization, with an aggregate market cap of around $456 billion as of May 2024.\n\nEEA Efforts\n\nRecently, member companies (and others) have initiated and worked on multiple pilot projects covering areas such as supply chain provenance tracking, inter-bank payments, reference data, securities settlement, and many others.\n\nHowever, real-world enterprise use calls for collaborative efforts to build architectures allowing permissioned and public Ethereum networks. The formation of EEA is an important step in this direction.\n\nThe EAA also provides education and training for members. The organization publishes newsletters, videos, and webinars as part of its public service mission.\n\nEEA Membership\n\nThe board members of the Enterprise Ethereum Alliance included Accenture, BlockApps, ConsenSys, Ethereum Foundation, EY, J.P. Morgan, Microsoft, and Santander.\n\nAccording to the EEA website, there are over 100 associate and organizational members of EEA. Associate members are represented by the Blockchain Research Institute, Hyperledger, and SAE ITC. Social impact partners include the Blockchain for Social Impact Coalition and the Decentralized Identity Foundation.\n\nThe members of EEA represent varied businesses from every region of the world, including technology, banking, government, healthcare, energy, pharmaceuticals, marketing, and insurance.\n\nWith a focus on solving the real-world challenges of deploying Ethereum at an enterprise scale, the Enterprise Ethereum Alliance is an important initiative in the adoption of blockchain and decentralization.\n\nEEA Benefits\n\nOrganizations that join the EEA get to leverage Ethereum technology in their business operations. It also exposes them to over 20,000 Ethereum community members. Members can network, establish partnerships, and showcase technology within the largest Ethereum ecosystem.\n\nEEA membership provides market opportunities through branding, speaking, and advertising, and facilitates building solutions on globally trusted EEA standards. The EEA also offers speaking and advertising opportunities at events, RFP inclusion, and prominent placement in the Ethereum Ecosystem stack.\n\nEEA membership also drives industry adoption by contributing to best practices and utilizing EEA resources to design enterprise-level solutions. Members participate in working groups to address Ethereum challenges, vote on technical developments, and access the EEA Testnet for testing. EEA even offers certification to ensure solutions meet industry standards and interoperability requirements.\n\nFinally, EEA members can join interest groups, access member service discounts, and use EEA branding. Members can access the global developer community of 3,000+ contributors and 15+ user groups across 25 industries and six continents to enhance collaboration. To gain access, EEA provides a password-protected member collaboration site.\n\nWhat Is the Ethereum Enterprise Alliance? The EEA is an organization that collaborates to promote the Ethereum ecosystem for business uses.\n\nWho Are the Partners of the Enterprise Ethereum Alliance? There are over 100 member organizations partnered with the EEA. Notable members you may recognize are Ernst & Young, FedEx, Microsoft, and VMWare.\n\nWhat Are the Main Objectives of the Enterprise Ethereum Alliance? The alliance is a group of organizations interested in using the Ethereum blockchain and ecosystem to deliver business solutions.\n\nThe Bottom Line\n\nThe Enterprise Ethereum Alliance (EEA) is an industry-led organization. Its objective is to promote using the Ethereum blockchain to empower enterprises. The EEA works to deliver an open, standards-based architecture created to accelerate the adoption of Enterprise Ethereum in the business world."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxQeVBpYkh4T1pJaVl1ckljTkE3VTFNdk9RSGJHd1I3RjYzME5Mc3lZMFhjNDdqdHBKZHg2dlkzbGdBVnpZaHNzeGRjLTdQX3NjdTZXQ0NkSjM5UFh1V3FSZEhqc01RSjV4STkzaEZndHhRN1dDTXh0U0ptT2hEWVZZYTZ3UVU3cHo1dDJNYVdsQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 May 2024 07:00:00 GMT",
        "title": "Ultimate Investment Guide: Furrever Token Set to Achieve Bitcoin and Ethereum-Level ROI in 2024 - Yahoo Finance",
        "content": "Furrever Token\n\nNew York City, NY, May 26, 2024 (GLOBE NEWSWIRE) --\n\nBitcoin (BTC) has fallen below $68,000, trading at $67,183 with a 3% decrease in the last 24 hours, raising concerns of a potential downtrend. Meanwhile, Ethereum (ETH) remains stagnant at $3,800 despite the approval of eight spot Ethereum ETFs, showing no significant uptrend. On the other hand, Furrever Token (FURR) captivates investors with its promising presale, nearing $1.1 million raised, and potential for a 1500% increase in value post-launch.\n\nBTC Falls Below $68,000 – Will the Decline Persist?\n\nInvestors and traders are especially showing new interest to Bitcoin strategies now that its current position and price fluctuations are driving this new found wave. Bitcoin which was trading at $/$67,183 began to decrease by 3. 3% in the last 24 hours, has a transaction volume of 36$, a monthly volatility of 4%, a monthly average price of 350$ and a Year to date return of 19%. 7 billion.\n\nAnalyzing the global market, it is possible to say playing a Capstone project budget of $1. 2.3 Q It is worth mentioning that bitcoin remains the most valuable coin in the market of cryptocurrencies with the worth of more than 3 trillion. Bitcoin (BTC/USD) is down 3% to 67,183 from its price earlier today. While analyzing the overall price fluctuations of this token, users are going to observe that in the last 24 hours 3% price swing indicates a bearish trend. Yet, these figures $68,263, especially emphasizing the pivot point belong to the direction of the current increase trend.\n\nThe 50-day Exponential Moving Average (EMA) is located at $68,615, which forms a resistance level near the pivot point. Technically, Bitcoin is trading below the pivot point, indicating a potential downtrend. As an entry strategy, selling below $68,263, targeting a take profit level of $66,357 and setting the stop loss at $70,029 could be recommended. This strategy can enable investors to take advantage of possible further declines while managing risk.\n\nHow Did Ethereum Price React After Approval: Has the Expected Rise Come?\n\nFollowing the approval of eight spot Ethereum ETFs by the SEC last night, ETH price remained stagnant at $3,800 and showed no signs of a significant uptrend. Despite this, ETH experienced a significant increase of over 30% last week. Investors are currently taking a cautious stance and are watching to see if this development will result in a “news sell” event.\n\nAhead of the US SEC announcing its Ethereum ETF approval decision, ETH price witnessed some sharp fluctuations. In the tense hours before official approval, ETH initially fell to $3,500 during the traditional US market close. It later approached $3,900 after initial unconfirmed reports emerged pointing to confirmation, and ultimately settled above $3,800 after confirmation. In the midst of these huge price swings, it turned out that a whale made a staggering sale of 7,900 ETH worth $29 million.\n\nStory continues\n\nDuring the turbulent period, liquidation of leveraged crypto derivatives positions reached over $350 million throughout the day, the highest figure since May 1, according to CoinGlass data. The majority of these liquidated positions were long positions anticipating price increases and totaled approximately $250 million. This shows that traders who had overextended themselves with leverage were surprised by the sudden price drop. Among those affected, ETH traders bore the brunt, with $132 million in liquidations.\n\nApproval of spot Ethereum ETFs could bring inflows of more than $500 million, as analysts estimate. However, it may take some time for this to happen and the uptrend to begin. Some on-chain indicators suggest that Ethereum could form a base above $4,000 and continue to rise to $5,000-6,000 by August this year. While the approval of Bitcoin ETFs has led to strong institutional inflows, it will be interesting to see whether the ETH ETF launch will lead to greater institutional adoption.\n\n\n\n\n\nFurrever Token: The Upcoming Game-Changer in Meme Coins\n\nFurrever Token is poised to capitalize on the growing interest in meme coins with its charming cat-themed imagery. Currently in the final phase of its presale, the token has already raised over $1.1 million, aiming to reach $1.9 million before its official launch on PancakeSwap. The potential for a 1500% increase in value post-launch positions Furrever Token as a highly attractive investment. Early presale participants, with tokens priced at $0.000648, stand to benefit significantly from this anticipated growth.\n\nFurrever Token's engaging approach, featuring cat-themed stickers, visuals, and community challenges, promotes a vibrant community. Additionally, the project's commitment to security and transparency, evidenced by its audited smart contract and a one-year lock on team tokens, reassures investors about its long-term prospects. With nearly 4,000 active members in its Telegram channel, Furrever Token demonstrates robust community support and engagement.\n\nAs the presale concludes, now is an opportune time for investors to get involved with the Furrever Token community and potentially secure significant returns.\n\nVisit furrevertoken.com to secure your tokens and join this exciting venture. Investors interested in this opportunity are advised to contact only the official support at support@furrevertoken.com to avoid potential scams.\n\nJoin Furrever Token Presale Now:\n\n\n\nFurrever Token Official Website\n\n\n\nJoin $20,000 Furrever Token Giveaway\n\n\n\nJoin Official Telegram Group\n\n\n\nFollow Official X Account\n\n\n\nMedia Contact:\n\nRobert Smith\n\nhttps://furrevertoken.com/\n\nsupport@furrevertoken.com\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\nCONTACT: Robert Smith support at furrevertoken.com\n\n\n\n"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxQeVBpYkh4T1pJaVl1ckljTkE3VTFNdk9RSGJHd1I3RjYzME5Mc3lZMFhjNDdqdHBKZHg2dlkzbGdBVnpZaHNzeGRjLTdQX3NjdTZXQ0NkSjM5UFh1V3FSZEhqc01RSjV4STkzaEZndHhRN1dDTXh0U0ptT2hEWVZZYTZ3UVU3cHo1dDJNYVdsQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 May 2024 07:00:00 GMT",
        "title": "Ultimate Investment Guide: Furrever Token Set to Achieve Bitcoin and Ethereum-Level ROI in 2024 - Yahoo Finance",
        "content": "Furrever Token\n\nNew York City, NY, May 26, 2024 (GLOBE NEWSWIRE) --\n\nBitcoin (BTC) has fallen below $68,000, trading at $67,183 with a 3% decrease in the last 24 hours, raising concerns of a potential downtrend. Meanwhile, Ethereum (ETH) remains stagnant at $3,800 despite the approval of eight spot Ethereum ETFs, showing no significant uptrend. On the other hand, Furrever Token (FURR) captivates investors with its promising presale, nearing $1.1 million raised, and potential for a 1500% increase in value post-launch.\n\nBTC Falls Below $68,000 – Will the Decline Persist?\n\nInvestors and traders are especially showing new interest to Bitcoin strategies now that its current position and price fluctuations are driving this new found wave. Bitcoin which was trading at $/$67,183 began to decrease by 3. 3% in the last 24 hours, has a transaction volume of 36$, a monthly volatility of 4%, a monthly average price of 350$ and a Year to date return of 19%. 7 billion.\n\nAnalyzing the global market, it is possible to say playing a Capstone project budget of $1. 2.3 Q It is worth mentioning that bitcoin remains the most valuable coin in the market of cryptocurrencies with the worth of more than 3 trillion. Bitcoin (BTC/USD) is down 3% to 67,183 from its price earlier today. While analyzing the overall price fluctuations of this token, users are going to observe that in the last 24 hours 3% price swing indicates a bearish trend. Yet, these figures $68,263, especially emphasizing the pivot point belong to the direction of the current increase trend.\n\nThe 50-day Exponential Moving Average (EMA) is located at $68,615, which forms a resistance level near the pivot point. Technically, Bitcoin is trading below the pivot point, indicating a potential downtrend. As an entry strategy, selling below $68,263, targeting a take profit level of $66,357 and setting the stop loss at $70,029 could be recommended. This strategy can enable investors to take advantage of possible further declines while managing risk.\n\nHow Did Ethereum Price React After Approval: Has the Expected Rise Come?\n\nFollowing the approval of eight spot Ethereum ETFs by the SEC last night, ETH price remained stagnant at $3,800 and showed no signs of a significant uptrend. Despite this, ETH experienced a significant increase of over 30% last week. Investors are currently taking a cautious stance and are watching to see if this development will result in a “news sell” event.\n\nAhead of the US SEC announcing its Ethereum ETF approval decision, ETH price witnessed some sharp fluctuations. In the tense hours before official approval, ETH initially fell to $3,500 during the traditional US market close. It later approached $3,900 after initial unconfirmed reports emerged pointing to confirmation, and ultimately settled above $3,800 after confirmation. In the midst of these huge price swings, it turned out that a whale made a staggering sale of 7,900 ETH worth $29 million.\n\nStory continues\n\nDuring the turbulent period, liquidation of leveraged crypto derivatives positions reached over $350 million throughout the day, the highest figure since May 1, according to CoinGlass data. The majority of these liquidated positions were long positions anticipating price increases and totaled approximately $250 million. This shows that traders who had overextended themselves with leverage were surprised by the sudden price drop. Among those affected, ETH traders bore the brunt, with $132 million in liquidations.\n\nApproval of spot Ethereum ETFs could bring inflows of more than $500 million, as analysts estimate. However, it may take some time for this to happen and the uptrend to begin. Some on-chain indicators suggest that Ethereum could form a base above $4,000 and continue to rise to $5,000-6,000 by August this year. While the approval of Bitcoin ETFs has led to strong institutional inflows, it will be interesting to see whether the ETH ETF launch will lead to greater institutional adoption.\n\n\n\n\n\nFurrever Token: The Upcoming Game-Changer in Meme Coins\n\nFurrever Token is poised to capitalize on the growing interest in meme coins with its charming cat-themed imagery. Currently in the final phase of its presale, the token has already raised over $1.1 million, aiming to reach $1.9 million before its official launch on PancakeSwap. The potential for a 1500% increase in value post-launch positions Furrever Token as a highly attractive investment. Early presale participants, with tokens priced at $0.000648, stand to benefit significantly from this anticipated growth.\n\nFurrever Token's engaging approach, featuring cat-themed stickers, visuals, and community challenges, promotes a vibrant community. Additionally, the project's commitment to security and transparency, evidenced by its audited smart contract and a one-year lock on team tokens, reassures investors about its long-term prospects. With nearly 4,000 active members in its Telegram channel, Furrever Token demonstrates robust community support and engagement.\n\nAs the presale concludes, now is an opportune time for investors to get involved with the Furrever Token community and potentially secure significant returns.\n\nVisit furrevertoken.com to secure your tokens and join this exciting venture. Investors interested in this opportunity are advised to contact only the official support at support@furrevertoken.com to avoid potential scams.\n\nJoin Furrever Token Presale Now:\n\n\n\nFurrever Token Official Website\n\n\n\nJoin $20,000 Furrever Token Giveaway\n\n\n\nJoin Official Telegram Group\n\n\n\nFollow Official X Account\n\n\n\nMedia Contact:\n\nRobert Smith\n\nhttps://furrevertoken.com/\n\nsupport@furrevertoken.com\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\nCONTACT: Robert Smith support at furrevertoken.com\n\n\n\n"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxQeVBpYkh4T1pJaVl1ckljTkE3VTFNdk9RSGJHd1I3RjYzME5Mc3lZMFhjNDdqdHBKZHg2dlkzbGdBVnpZaHNzeGRjLTdQX3NjdTZXQ0NkSjM5UFh1V3FSZEhqc01RSjV4STkzaEZndHhRN1dDTXh0U0ptT2hEWVZZYTZ3UVU3cHo1dDJNYVdsQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 May 2024 07:00:00 GMT",
        "title": "Ultimate Investment Guide: Furrever Token Set to Achieve Bitcoin and Ethereum-Level ROI in 2024 - Yahoo Finance",
        "content": "Furrever Token\n\nNew York City, NY, May 26, 2024 (GLOBE NEWSWIRE) --\n\nBitcoin (BTC) has fallen below $68,000, trading at $67,183 with a 3% decrease in the last 24 hours, raising concerns of a potential downtrend. Meanwhile, Ethereum (ETH) remains stagnant at $3,800 despite the approval of eight spot Ethereum ETFs, showing no significant uptrend. On the other hand, Furrever Token (FURR) captivates investors with its promising presale, nearing $1.1 million raised, and potential for a 1500% increase in value post-launch.\n\nBTC Falls Below $68,000 – Will the Decline Persist?\n\nInvestors and traders are especially showing new interest to Bitcoin strategies now that its current position and price fluctuations are driving this new found wave. Bitcoin which was trading at $/$67,183 began to decrease by 3. 3% in the last 24 hours, has a transaction volume of 36$, a monthly volatility of 4%, a monthly average price of 350$ and a Year to date return of 19%. 7 billion.\n\nAnalyzing the global market, it is possible to say playing a Capstone project budget of $1. 2.3 Q It is worth mentioning that bitcoin remains the most valuable coin in the market of cryptocurrencies with the worth of more than 3 trillion. Bitcoin (BTC/USD) is down 3% to 67,183 from its price earlier today. While analyzing the overall price fluctuations of this token, users are going to observe that in the last 24 hours 3% price swing indicates a bearish trend. Yet, these figures $68,263, especially emphasizing the pivot point belong to the direction of the current increase trend.\n\nThe 50-day Exponential Moving Average (EMA) is located at $68,615, which forms a resistance level near the pivot point. Technically, Bitcoin is trading below the pivot point, indicating a potential downtrend. As an entry strategy, selling below $68,263, targeting a take profit level of $66,357 and setting the stop loss at $70,029 could be recommended. This strategy can enable investors to take advantage of possible further declines while managing risk.\n\nHow Did Ethereum Price React After Approval: Has the Expected Rise Come?\n\nFollowing the approval of eight spot Ethereum ETFs by the SEC last night, ETH price remained stagnant at $3,800 and showed no signs of a significant uptrend. Despite this, ETH experienced a significant increase of over 30% last week. Investors are currently taking a cautious stance and are watching to see if this development will result in a “news sell” event.\n\nAhead of the US SEC announcing its Ethereum ETF approval decision, ETH price witnessed some sharp fluctuations. In the tense hours before official approval, ETH initially fell to $3,500 during the traditional US market close. It later approached $3,900 after initial unconfirmed reports emerged pointing to confirmation, and ultimately settled above $3,800 after confirmation. In the midst of these huge price swings, it turned out that a whale made a staggering sale of 7,900 ETH worth $29 million.\n\nStory continues\n\nDuring the turbulent period, liquidation of leveraged crypto derivatives positions reached over $350 million throughout the day, the highest figure since May 1, according to CoinGlass data. The majority of these liquidated positions were long positions anticipating price increases and totaled approximately $250 million. This shows that traders who had overextended themselves with leverage were surprised by the sudden price drop. Among those affected, ETH traders bore the brunt, with $132 million in liquidations.\n\nApproval of spot Ethereum ETFs could bring inflows of more than $500 million, as analysts estimate. However, it may take some time for this to happen and the uptrend to begin. Some on-chain indicators suggest that Ethereum could form a base above $4,000 and continue to rise to $5,000-6,000 by August this year. While the approval of Bitcoin ETFs has led to strong institutional inflows, it will be interesting to see whether the ETH ETF launch will lead to greater institutional adoption.\n\n\n\n\n\nFurrever Token: The Upcoming Game-Changer in Meme Coins\n\nFurrever Token is poised to capitalize on the growing interest in meme coins with its charming cat-themed imagery. Currently in the final phase of its presale, the token has already raised over $1.1 million, aiming to reach $1.9 million before its official launch on PancakeSwap. The potential for a 1500% increase in value post-launch positions Furrever Token as a highly attractive investment. Early presale participants, with tokens priced at $0.000648, stand to benefit significantly from this anticipated growth.\n\nFurrever Token's engaging approach, featuring cat-themed stickers, visuals, and community challenges, promotes a vibrant community. Additionally, the project's commitment to security and transparency, evidenced by its audited smart contract and a one-year lock on team tokens, reassures investors about its long-term prospects. With nearly 4,000 active members in its Telegram channel, Furrever Token demonstrates robust community support and engagement.\n\nAs the presale concludes, now is an opportune time for investors to get involved with the Furrever Token community and potentially secure significant returns.\n\nVisit furrevertoken.com to secure your tokens and join this exciting venture. Investors interested in this opportunity are advised to contact only the official support at support@furrevertoken.com to avoid potential scams.\n\nJoin Furrever Token Presale Now:\n\n\n\nFurrever Token Official Website\n\n\n\nJoin $20,000 Furrever Token Giveaway\n\n\n\nJoin Official Telegram Group\n\n\n\nFollow Official X Account\n\n\n\nMedia Contact:\n\nRobert Smith\n\nhttps://furrevertoken.com/\n\nsupport@furrevertoken.com\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\nCONTACT: Robert Smith support at furrevertoken.com\n\n\n\n"
    }
]