[
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxQUGJhT2s4R3U1My1NOVZwMXZxZ2hXbDl3N0thanVMTmtBOUpKWlh5M2M0Tmd4UklPbDlDSC1vVmc0dXBhcWEzNVdVczlZRDVkYlZSTUtaM0VmMm1EWXVlVEZUOHA5cG5HcW9OYzVlTUduOHZBZWNaYTRvNkM0MjhMT3ViRUFGUlg5YkE2MmlZQVJ3VFlpWldySkNn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Apr 2024 07:00:00 GMT",
        "title": "Polkadot community backs SnowBridge for seamless Ethereum integration - CryptoSlate",
        "content": "Polkadot’s governance is currently mulling over a proposal to activate SnowBridge, a cross-chain bridge designed to link the Polkadot blockchain with Ethereum.\n\nA cross-chain bridge essentially serves as a decentralized application (DApp), streamlining asset transfers between blockchains to enhance token utility by fostering cross-chain liquidity.\n\nMarket observers have highlighted the significant role SnowBridge would play in enabling Polkadot’s ecosystem to tap into Ethereum’s extensive DeFi landscape.\n\nThe SnowBridge proposal has garnered substantial support from the community due to the potential benefits, t, with all cast votes currently in favor of its implementation. If approved, SnowBridge is slated to go live in 28 days.\n\nWhat is SnowBridge?\n\nSnowBridge is one of the many bridges under development within the Polkadot ecosystem. This initiative, a collaboration between Snowfork and Parity Technologies, aims to revolutionize the movement of Ethereum assets into and out of Polkadot.\n\nCurrently, bridging ERC-20 tokens into Polkadot necessitates using bridges reliant on third-party signatures. While this method is standard in Web3 ecosystems, it poses limitations for Parachains and dApps on Polkadot due to its impact on their trust model.\n\nSnowBridge offers a solution through a trustless model that relies solely on signatures from first-party Ethereum and Polkadot validators. It operates on BridgeHub and is poised to enhance cross-chain interaction between Polkadot and Ethereum.\n\nSnowBridge has been in development for some time and was deployed on the Polkadot parachain testnet Rococo in January 2024. Subsequently, developers utilized it to transfer assets between the Ethereum Sepolia testnet and AssetHub on Rococo, with ERC-20 tokens initially being the sole supported asset type.\n\nSince its deployment, several updates to SnowBridge have been implemented based on thorough testing and audits conducted by the team and security firms.\n\nDisclaimer: CryptoSlate has received a grant from the Polkadot Foundation to produce content about the Polkadot ecosystem. While the Foundation supports our coverage, we maintain full editorial independence and control over the content we publish.\n\nMentioned in this article"
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxPR25YanJmVFJkZVNWcmlYNTk2eElLMVZBMDBWTWhBTGdTM3R5NFgyMWNia1l1aE96WlRLTVNwTlZ4bWlWZl82X295RnZBeWsxcUhhSlM1cnNtdGpadHZiMmtxeHB1QmYzRE1kY0QwQ1AxUkVJMDBIQmRTeTRJRzNxYWFYTG5vY0k5WVltMDd1Qmx6cjRpWWZoTHhXN1NuM2w2YkJFdldaVkF6Z0E0b3lacy1GZngxRFJtUmJiVUVlcHBEaE1qLU40Y3RFcV9FTVhyRVZpbjQ4ZE5VSUNOVjl0WTdsNXlxZXBj?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Apr 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum, Dogecoin On Shaky Ground, Crypto Veteran Sees 'Bitcoin Still Stuck In Range' - Benzinga",
        "content": "Cryptocurrency markets are trading down on Friday, alongside a drop in total short crypto liquidations to the lowest levels since February 2024. One week after the Bitcoin Halving, exchange net flows for Bitcoin witnessed a major drop of 227% to $114 million.\n\nWhat Happened: Crypto markets experienced a shaky Friday late evening, with Bitcoin BTC/USD, Ethereum ETH/USD, and Dogecoin DOGE/USD trading in the red. Global concerns, such as the Japanese yen’s tumble to a fresh 34-year low against the U.S. dollar, weighed on the stock and crypto markets.\n\nPrices as of 4 p.m. Eastern Time:\n\nCryptocurrency Gains +/- Price Bitcoin BTC/USD -1.4% $63,876.32 Ethereum ETH/USD -1.1% $3,139.89 Dogecoin DOGE/USD -2.2% $0.1497\n\nA development on the Asian market will see Chinese investors with a Hong Kong residence permit allowed to buy shares in the Hong Kong ETFs. The global cryptocurrency market cap now stands at 2.36 trillion, down 1.07% in the past 24 hours. In the same period, 48,733 traders were liquidated, with total liquidations reaching 119.34 million.\n\nNotably, crypto short liquidations as of April 26 at 3:30 pm ET stood at the lowest since February 2024, at $24.96 million. IntoTheBlock data highlights that Bitcoin exchange’s net flows dropped significantly by 226.6% to 114.4 million, while large transaction volumes narrowed by 23.6% to $37.98 billion.\n\nTop Losers\n\nCryptocurrency Gains +/- Price Wormhole (CRYPTO: W) -10.0% $0.5994 Pendle PENDLE/USD -9.9% $5.44 Arweave AR/USD -8.0% $8.22\n\nAlso Read: Bitcoin’s Consolidation Is The ‘Calm Before The Storm,’ Veteran Trader Lark Davis Writes\n\nAnalyst Notes: Crypto veteran trader Michaël van de Poppe states that Bitcoin is still stuck in a range. However, he expects altcoins to perform better.\n\n#Bitcoin is still stuck in a range.\n\n\n\nI don't think we'll see much happening from here for the coming 3-6 months.\n\n\n\nSlow sideways, perhaps a grind.\n\n\n\nExpecting way more from #Altcoins. pic.twitter.com/akiD1uhTCU — Michaël van de Poppe (@CryptoMichNL) April 26, 2024\n\nHeavily-followed meme coin analyst and trader Murad shared potential price targets to determine whether the current range is accumulation or distribution.\n\nMy current base thinking on $BTC\n\n\n\nExpecting continued chop suey in the purple box into the Summer\n\n\n\nIn that box, you have to look for clues whether this is re-accumulation or re-distribution\n\n\n\nRe-accumulation –> 100K\n\n\n\nRe-distribution –> 52K or 42K or 32K\n\n\n\nBrush up on Macro pic.twitter.com/6YHvPoaG47 — Murad (@MustStopMurad) April 26, 2024\n\nCrypto trader Tim estimates that the “crypto market will be much higher” and is holding his entire portfolio. He states, “If the ship goes down, I’ll join you, but I think we’ll go higher after May, and this is a consolidation phase before the next leg up.” He strongly reaffirms that in all scenarios, crypto is here to stay and will grow.\n\nWhat’s Next: These topics are expected to be thoroughly explored at Benzinga’s upcoming Future of Digital Assets event on Nov. 19.\n\nRead Next: Arthur Hayes: Bitcoin Bull Market Not Over, Urges Investors To ‘Left Curve It’\n\nImage created using artificial intelligence with Midjourney."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxPR25YanJmVFJkZVNWcmlYNTk2eElLMVZBMDBWTWhBTGdTM3R5NFgyMWNia1l1aE96WlRLTVNwTlZ4bWlWZl82X295RnZBeWsxcUhhSlM1cnNtdGpadHZiMmtxeHB1QmYzRE1kY0QwQ1AxUkVJMDBIQmRTeTRJRzNxYWFYTG5vY0k5WVltMDd1Qmx6cjRpWWZoTHhXN1NuM2w2YkJFdldaVkF6Z0E0b3lacy1GZngxRFJtUmJiVUVlcHBEaE1qLU40Y3RFcV9FTVhyRVZpbjQ4ZE5VSUNOVjl0WTdsNXlxZXBj?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Apr 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum, Dogecoin On Shaky Ground, Crypto Veteran Sees 'Bitcoin Still Stuck In Range' - Benzinga",
        "content": "Cryptocurrency markets are trading down on Friday, alongside a drop in total short crypto liquidations to the lowest levels since February 2024. One week after the Bitcoin Halving, exchange net flows for Bitcoin witnessed a major drop of 227% to $114 million.\n\nWhat Happened: Crypto markets experienced a shaky Friday late evening, with Bitcoin BTC/USD, Ethereum ETH/USD, and Dogecoin DOGE/USD trading in the red. Global concerns, such as the Japanese yen’s tumble to a fresh 34-year low against the U.S. dollar, weighed on the stock and crypto markets.\n\nPrices as of 4 p.m. Eastern Time:\n\nCryptocurrency Gains +/- Price Bitcoin BTC/USD -1.4% $63,876.32 Ethereum ETH/USD -1.1% $3,139.89 Dogecoin DOGE/USD -2.2% $0.1497\n\nA development on the Asian market will see Chinese investors with a Hong Kong residence permit allowed to buy shares in the Hong Kong ETFs. The global cryptocurrency market cap now stands at 2.36 trillion, down 1.07% in the past 24 hours. In the same period, 48,733 traders were liquidated, with total liquidations reaching 119.34 million.\n\nNotably, crypto short liquidations as of April 26 at 3:30 pm ET stood at the lowest since February 2024, at $24.96 million. IntoTheBlock data highlights that Bitcoin exchange’s net flows dropped significantly by 226.6% to 114.4 million, while large transaction volumes narrowed by 23.6% to $37.98 billion.\n\nTop Losers\n\nCryptocurrency Gains +/- Price Wormhole (CRYPTO: W) -10.0% $0.5994 Pendle PENDLE/USD -9.9% $5.44 Arweave AR/USD -8.0% $8.22\n\nAlso Read: Bitcoin’s Consolidation Is The ‘Calm Before The Storm,’ Veteran Trader Lark Davis Writes\n\nAnalyst Notes: Crypto veteran trader Michaël van de Poppe states that Bitcoin is still stuck in a range. However, he expects altcoins to perform better.\n\n#Bitcoin is still stuck in a range.\n\n\n\nI don't think we'll see much happening from here for the coming 3-6 months.\n\n\n\nSlow sideways, perhaps a grind.\n\n\n\nExpecting way more from #Altcoins. pic.twitter.com/akiD1uhTCU — Michaël van de Poppe (@CryptoMichNL) April 26, 2024\n\nHeavily-followed meme coin analyst and trader Murad shared potential price targets to determine whether the current range is accumulation or distribution.\n\nMy current base thinking on $BTC\n\n\n\nExpecting continued chop suey in the purple box into the Summer\n\n\n\nIn that box, you have to look for clues whether this is re-accumulation or re-distribution\n\n\n\nRe-accumulation –> 100K\n\n\n\nRe-distribution –> 52K or 42K or 32K\n\n\n\nBrush up on Macro pic.twitter.com/6YHvPoaG47 — Murad (@MustStopMurad) April 26, 2024\n\nCrypto trader Tim estimates that the “crypto market will be much higher” and is holding his entire portfolio. He states, “If the ship goes down, I’ll join you, but I think we’ll go higher after May, and this is a consolidation phase before the next leg up.” He strongly reaffirms that in all scenarios, crypto is here to stay and will grow.\n\nWhat’s Next: These topics are expected to be thoroughly explored at Benzinga’s upcoming Future of Digital Assets event on Nov. 19.\n\nRead Next: Arthur Hayes: Bitcoin Bull Market Not Over, Urges Investors To ‘Left Curve It’\n\nImage created using artificial intelligence with Midjourney."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxPYnRyNU5lWG0xS0RscUFORkh3N1lTZzFPU0RPWHdCaTNCbU4tQ2xIMjJpUDR2WTZSREQ1YmZUSlBjNXg5b2tUWmRWeGVTWUVkdndib1paYWI0MFFsbnp2TXhzZ0lvdFlZRnBTclpacVNXeURGS3ozc3pSdk1jQ0wwX0RMbGoyZHVHZEtPUDk3TGNmSDhRODBuUnhFdEtTN1E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Apr 2024 07:00:00 GMT",
        "title": "Why Ethereum is failing to keep up with Bitcoin and how Solana could benefit - DLNews",
        "content": "Ethereum’s price in Bitcoin hit a multi-year low in April.\n\nSeveral factors suggest that the gap between the two could become more pronounced.\n\nInvestors are losing their faith in Ethereum as the cryptocurrency continuously fails to keep pace with Bitcoin’s outsized gains.\n\nAnd things could get worse for the world’s biggest altcoin.\n\nNot only have the odds for a US spot Ethereum exchange-traded fund getting approved in May dropped, but Ethereum exchange-traded products suffered $34 million worth of outflows this past week, CoinShares data shows — making them the only asset group among those CoinShares tracks to register a net outflow since the start of the year.\n\n“ETH sentiment is anecdotally at the lowest it has been in years, despite recent developments such as the BUIDL fund by BlackRock,” Luke Nolan, a research associate at CoinShares, told DL News.\n\nThe decreasing optimism comes as smaller altcoins, like Solana, have attracted investors who don’t expect Ethereum investments to yield as high returns as they did in the past.\n\nA Bitcoin-driven market\n\nIn previous bull markets, Bitcoin has outperformed other cryptocurrencies at the beginning of the cycle — a trend that looks to be playing out again.\n\nThis time the focus on Bitcoin has been catalysed by inflows to the 10 US Bitcoin ETFs that launched on January 11.\n\nThey have so far seen over $12 billion in inflows, according to data from Farside Investors.\n\nJoin the community to get our latest stories and updates\n\nYet, Ethereum has not managed to capitalise on the rally.\n\nEthereum’s price in Bitcoin — or ETHBTC — fell to a low of 0.046 in April, creating the biggest price gap between the two assets in almost three years.\n\nThat means that since ETHBTC peaked in 2022, an investment in Bitcoin has outperformed Ethereum by 44%.\n\nThe ETHBTC trading pair shows the price of Ethereum divided by the price of Bitcoin. Traders use this metric to gauge the relative strength of Ethereum against benchmark cryptocurrency Bitcoin.\n\n“Even though some people may not view ETH as an altcoin per se, its over- or underperformance relative to Bitcoin is a powerful metric to try and understand what kind of market we are in,” Nolan said.\n\nIf the Bitcoin ETFs continue to steam ahead, the price gap between Bitcoin and Ethereum may become more pronounced.\n\nAnd there’s reason to believe that Bitcoin ETF inflows will continue to soar. Hong Kong recently approved the launch of Bitcoin ETFs, which are set to begin trading April 30.\n\nEthereum ETF approval looks unlikely\n\nWhile Hong Kong also approved a spot Ethereum ETF, the odds of US regulators approving similar funds on May 23 — the deadline for when they have to either approve or reject VanEck’s application — are low.\n\nBloomberg Intelligence analysts James Seyffart and Eric Balchunas put odds for a May approval at around 25%.\n\nSimilarly, punters on blockchain-based betting platform Polymarket put the odds of an approval at 13%.\n\nThis week, BlackRock amended its spot Ethereum ETF application while competitor Grayscale filed to convert its futures Ethereum ETF to a spot fund.\n\nDespite this, analysts remain sceptical that any US spot Ethereum ETF will be approved.\n\n“The ETH ETF is almost certainly going to be rejected in May, which has dampened flows into ETH in already existing [exchange-traded] products,” Nolan said.\n\nSolana steals the spotlight\n\nAmong so-called altcoins, Ethereum is the largest, with a market value of $384 billion. But this success is a double-edged sword, according to Nolan.\n\n“ETH has a large market cap and investors have turned to lower cap alternatives,” Nolan said.\n\nOne popular alternative is Solana.\n\nMost traders assume it would be difficult for Ethereum’s market value to exceed that of Bitcoin. So with Bitcoin sporting a market value of $1.27 trillion, Ethereum traders see limited upside potential.\n\nDespite rallying 546% over the past year, Solana’s market cap is a comparatively low $64 billion, leaving more room for it to grow.\n\nTraders are also starting to pay more attention to Solana’s price compared with other cryptocurrencies.\n\n“I have noticed much more attention this cycle vs. last cycle to SOL/ETH and SOL/BTC pairs,” Nolan said.\n\nSigns of hope\n\nThere’s still hope Ethereum could stop bleeding against Bitcoin — but not for a while.\n\nThe approval of a spot Ethereum ETF should help drive interest. Nolan said he expects an ETF will “likely” be approved in 2025.\n\nAdditionally, if the current bull market repeats previous ones, Ethereum should do better as time goes on.\n\nUntil then, traders will continue to watch the ETHBTC chart closely for clues as to where the top two cryptocurrencies are heading next.\n\nTim Craig is DL News’ Edinburgh-based DeFi Correspondent. Reach out with tips at tim@dlnews.com."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxPWlhiOFVEd21FVXRYVHVPLVBvYk05RnJEUXpNNHVvQTJvQk5hUUtCRkF0RTZoQ3kzd2JnU3RIel9fek82c0Zpb3FoSzBsU2lNaFlwZTFzanBUT0xZQW10N3h3VXRRWUR2bnpHbFNiM0d3TDk3NnluQ3BJcHpuM3BoN0swdFpaZlFwZm0tSWtaQ1pGZ3U4eS1j0gGcAUFVX3lxTE50c0xsOV9yaGpxVFNzMzFUMXIyVnRZdVFsbDZtYXFidC16UWQ1b09FR084bWJaaXEwcVprY0Q3RmxRVGlEZ083X2o4b1ZRSVRnbEM5d1ZLNGw0TFFiaFRhenZNQk1NdjZtazdDZ21jQUxDOFZjamtRVU83ZW5VUzlCYnBwRk5pZzVkY21NU2VVaEItbzgtWjJJMi1wWA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Apr 2024 07:00:00 GMT",
        "title": "6 Under $1 Ethereum Meme Coins To Buy This Weekend For 50X Gain - CoinGape",
        "content": "The cryptocurrency market shines a spotlight on several Ethereum meme coins to buy that are currently valued under one dollar. Notable among these are Pepe (PEPE), Shiba Inu Coin (SHIB), and Floki (FLOKI). Each of these digital currencies has seen impressive gains recently, attracting the interest of investors aiming for significant returns. Their growing popularity may suggest they are viable options for turning a small investment into considerable profits in the volatile crypto market.\n\n1. Pepe (PEPE)\n\nPepe (PEPE), a new cryptocurrency on the Ethereum blockchain, is swiftly gaining traction. It aims to match or surpass the success of iconic meme coins like Shiba Inu and Dogecoin. Currently holding the 35th spot in market rankings, Pepe coin boasts a market cap of $3.22 billion.\n\nadvertisement\n\nEnhanced support from platforms like Coinbase and significant acquisitions by large-scale investors have propelled its visibility and value. Market trends and a rise in similar meme coins also contribute to Pepe bullish momentum.\n\nPresently, the Pepe price is $0.000007638, marking a 5% increase in the last 24 hours. This recent surge has positioned it as today’s most popular meme coin on CoinMarketCap. Over the last week, it has witnessed a substantial 47% increase. Over the past 12 months, PEPE value has skyrocketed by 3368%, highlighting it as a potential investment for significant returns this weekend.\n\n2. Shiba Inu Coin (SHIB)\n\nShiba Inu Coin (SHIB) continues to flourish within the decentralized finance realm. As another Ethereum-based digital asset, it has recently seen a 3% rise in its value. The current price of Shiba Inu stands at $0.00002577, suggesting continued growth. With a 146% increase over the past year, SHIB remains a strong contender in the market.\n\nRanked 11th by CoinMarketCap, SHIB has a market capitalization of $15.18 billion. Factors such as enhanced trading volume, strategic token burns, and the introduction of Shibairum are driving its upward trajectory. This makes SHIB another attractive meme coin for potential investors looking for substantial gains.\n\n3. Floki (FLOKI)\n\nFloki (FLOKI), initially recognized as a meme coin, has evolved significantly in the web3 realm. It now engages prominently in the Metaverse, decentralized finance (DeFi), and non-fungible tokens (NFTs). Dubbed “The People’s Crypto,” Floki integrates popular internet culture with cutting-edge, practical projects.\n\nAs of now, Floki price stands at $0.0001885, marking a 4% increase in the last day. It holds the 55th position in global market capitalization, valued at $1.8 billion, and is showing promise for substantial future gains following trends seen in other Ethereum-based meme coins.\n\n4. Grok (GROK)\n\nGrok (GROK) is carving out a space in the meme coin sector. It gains its inspiration from the Grok AI project by Elon Musk’s X company. This association has significantly heightened its profile, pushing it to the forefront of AI-related meme cryptocurrencies.\n\nGrok price is trading at $0.008313, reflecting a slight 2% dip over the past day. With a market capitalization of $52 million, it is ranked 596th on CoinMarketCap, highlighting its position among the top Ethereum meme coins.\n\n5. Bonk (BONK)\n\nBonk (BONK), a newly minted dog-themed cryptocurrency on the Solana network, has made a significant splash by allocating half of its tokens to the Solana community. This strategy has vaulted its market capitalization to a robust $1.74 billion. At the time of writing, the Bonk price is trading at $0.00002667, which represents an 8% increase over the past 24 hours.\n\nThis trend reflects a 79% rise over the past week and an astonishing annual gain of 4100%. Such dynamics suggest BONK could be a lucrative investment, especially as it rides the growing popularity of Solana, positioning itself as a top meme coin with the potential for exponential gains.\n\n6. CorgiAI (CORGIAI)\n\nCorgiAI (CORGIAI) has carved a niche within the artificial intelligence sphere, fueled by a vibrant community-driven project. The introduction of its Corgi Cre8r tool, enabling users to generate text-to-image NFTs, showcases its commitment to innovation.\n\nDespite a slight 1% dip in its price today, CorgiAI’s token, currently valued at $0.001672, has surged 542% this year. This impressive performance highlights its appeal as a promising investment among Ethereum meme coins, hinting at substantial returns for future investors. The current CoinMarketCap ranking is 3097, with a market cap of 507 million.\n\nBottom Line\n\nAs the crypto market continues to evolve, these selected Ethereum meme coins represent promising opportunities for investors. With their low entry price and recent upsurge in popularity, they are prime candidates for potentially lucrative investments this weekend.\n\nRelated Articles\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    }
]