[
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxPMUFmQnh5V01pSzA5WGVlT1podHFwQkhkUFNldEJiNjZGSEN3QTFjdEFuSXJVS0FxR01KQUlWNXNWbEdTbHZRMlRjaVNfZXBzVlBCSnY1bGVlX0dFazRELXpSbllsSC1FRDJDQkJqNlpOcmNlbHBvU251czh2RlFTcjhJa1p1cVMyempkMll5TXdUX09CWXczVWs1azNLeWlzQzN3WjF0UUFzNkdlLVJkQTE5TXlreDg4Rk5rM0c5NWV6eG0tVzlXVmF3ZUVYMEk1eFZUeVVB0gHbAUFVX3lxTE9vczhfNDNwWm9QZHYzaEhwVTN1LWFqc2pQWlpxdDBCQjhLRFFkVVE1eGVyMjF1YkFVcVRIV0RqdmxpYnBmRTNnY1puenRSSVVTTDdVZU40SWFRX3lnNWlmWFBYTmlNYVMwempVczRhejI5TG81Z29wMm51WjFuR3FVN2VUcVM3Z2EtV240SHpDWlJGRjR6cXQwb0ttN3dBaDFhbXlTc2JWNnNVbXdHQzF3RUU5MTZQR0w1RUlodWM4NFFTdzRlTzNlanFQTXpFY3h5UmVlT2dXNWdjYw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Dec 2023 08:00:00 GMT",
        "title": "Top Crypto Analyst Says Two Altcoins Primed To Explode by Over 80%, Updates Outlook on Bitcoin and Ethereum - The Daily Hodl",
        "content": "A trader who accurately called Bitcoin’s (BTC) 2018 price floor is predicting massive moves to the upside for two top 50 altcoins.\n\nStarting with Solana (SOL), the analyst and trader pseudonymously known as Bluntz tells his 232,000 followers on the social media platform X that the sixth-largest crypto asset by market cap will surge in value against Bitcoin (SOL/BTC).\n\nAccording to the analyst, the bullish SOL/BTC chart indicates that Solana will likely soar against the US dollar.\n\nThis was another banger SOL/BTC picolow call. Since the original post, it has rallied impulsively from the low in five waves and has now done yet another ABC down. SOL/BTC is about to full send in my opinion.\n\nI have no idea where USD pair goes in terms of levels, but I genuinely think it will be $140+.”\n\nSolana is trading at $73.65 at time of writing and would need to appreciate by over 90% to hit the target of at least $140.\n\nTurning to the governance token of the decentralized finance (DeFi) lending protocol Aave (AAVE), Bluntz says that the 50th-largest altcoin by market cap looks poised for a big breakout rally.\n\n“Monster three-day candle on AAVE. Legit gearing up to gigasend.\n\nPlenty of juice in the tank in my opinion, shouldn’t be aiming for anything less than $200 in my opinion.”\n\nAAVE is trading at $108.13 at time of writing and would need to go up by 85% to reach a target of $200.\n\nOn Bitcoin and Ethereum (ETH), Bluntz says he’s now bullish on the two crypto assets after initially expressing reservations. Initially, the pseudonymous crypto analyst had warned of a possible downward move for Bitcoin and Ethereum after the two leading crypto assets pulled back from their ascending channel highs.\n\n“Overnight price action made me do a 180 on this take. Sh*t looks bullish as f**k again.”\n\nBitcoin is trading at $42,113 at time of writing while Ethereum is worth $2,244.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    }
]