[
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTFBsa29EWG1CUHJiZmtvWW9naVJHNExBWXlXV25XR1ZWc1lvVHgxTlR3VXF4U1NsM2hZN1hRRnB4bWhBaEpMdjJONHJlcEFjbUZHcW1XVXhteHU4NXBuM1ljS0JKU0JQSDBRd1g0ZDhhdFhsT0RpdHNJ0gF_QVVfeXFMTnBtaUdvTjJvcktUcnVwSE00bEx5RGdNVGxIVUxSMTlUMzB5ZEdUX1ZWTTk1SEFZZ2ZEcTR3MlJBYVpZeGJLaVdQNDF3cUUzeHJ5TGd4T0wzU0x1ZXRRVDQySFYyU2RaOFVLWHRhdmxUYlJSWEIzZHJrSjBzTFZZYw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "DOGE Go Up: Ethereum and Solana Hit Hard By Sell-Off—But Dogecoin Makes Gains - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe crypto market took a hit Friday morning Eastern Time, with all major digital assets except for Dogecoin (DOGE) down significantly. Ethereum (ETF), XRP, and Solana (SOL) have all seen significant losses in the past day.\n\nAt the time of writing, the original meme coin was trading for $0.08, a 4% increase over the past 24-hour period. And over the week, the asset, which was once Elon Musk's favorite cryptocurrency, has gained more than 10% in value, according to CoinGecko.\n\nIn the past day, $2.7 billion worth of DOGE has changed hands. The only times the meme coin's volume has been higher in 2023 were around the time that Musk changed the Twitter logo to a Shiba Inu in April and a Dogecoin developer teased at a new development in February.\n\nAs of 9.30am ET, it the best-performing top digital currency, CoinGecko data shows.\n\nAD\n\nAD\n\nElsewhere, though, major assets were hit by a sell-off. ETH lost its $2,000 per coin level it hit last week. As of this writing, it has shed more than 4% of its value and was trading for $1,941.\n\nBitcoin, the biggest digital asset by market cap, was still trading above $36,000—only slightly—but had taken a 2% 24-hour hit.\n\nIn the past day, Bitcoin's dominance slid slightly to 51%, impacting overall market sentiment​​. Stablecoins dominated the trading volume in the past 24 hours, accounting for 89% of the total crypto market's trading volume​​.\n\nAnd SOL, which had been on a big run, was down over 9%, trading hands for $56.82 per coin.\n\nAD\n\nAD\n\nXRP was also a big loser—having lost over 5% in the past day, the asset was trading for $0.59 Friday morning.\n\nAnd Avalanche (AVAX), which yesterday surged on news that banking giant J.P. Morgan used the blockchain to tokenize portfolios, lost more than 10% of its value. It was trading for $20.97 by the time this story was published.\n\nEdited by Stacy Elliott."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTFBsa29EWG1CUHJiZmtvWW9naVJHNExBWXlXV25XR1ZWc1lvVHgxTlR3VXF4U1NsM2hZN1hRRnB4bWhBaEpMdjJONHJlcEFjbUZHcW1XVXhteHU4NXBuM1ljS0JKU0JQSDBRd1g0ZDhhdFhsT0RpdHNJ0gF_QVVfeXFMTnBtaUdvTjJvcktUcnVwSE00bEx5RGdNVGxIVUxSMTlUMzB5ZEdUX1ZWTTk1SEFZZ2ZEcTR3MlJBYVpZeGJLaVdQNDF3cUUzeHJ5TGd4T0wzU0x1ZXRRVDQySFYyU2RaOFVLWHRhdmxUYlJSWEIzZHJrSjBzTFZZYw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "DOGE Go Up: Ethereum and Solana Hit Hard By Sell-Off—But Dogecoin Makes Gains - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe crypto market took a hit Friday morning Eastern Time, with all major digital assets except for Dogecoin (DOGE) down significantly. Ethereum (ETF), XRP, and Solana (SOL) have all seen significant losses in the past day.\n\nAt the time of writing, the original meme coin was trading for $0.08, a 4% increase over the past 24-hour period. And over the week, the asset, which was once Elon Musk's favorite cryptocurrency, has gained more than 10% in value, according to CoinGecko.\n\nIn the past day, $2.7 billion worth of DOGE has changed hands. The only times the meme coin's volume has been higher in 2023 were around the time that Musk changed the Twitter logo to a Shiba Inu in April and a Dogecoin developer teased at a new development in February.\n\nAs of 9.30am ET, it the best-performing top digital currency, CoinGecko data shows.\n\nAD\n\nAD\n\nElsewhere, though, major assets were hit by a sell-off. ETH lost its $2,000 per coin level it hit last week. As of this writing, it has shed more than 4% of its value and was trading for $1,941.\n\nBitcoin, the biggest digital asset by market cap, was still trading above $36,000—only slightly—but had taken a 2% 24-hour hit.\n\nIn the past day, Bitcoin's dominance slid slightly to 51%, impacting overall market sentiment​​. Stablecoins dominated the trading volume in the past 24 hours, accounting for 89% of the total crypto market's trading volume​​.\n\nAnd SOL, which had been on a big run, was down over 9%, trading hands for $56.82 per coin.\n\nAD\n\nAD\n\nXRP was also a big loser—having lost over 5% in the past day, the asset was trading for $0.59 Friday morning.\n\nAnd Avalanche (AVAX), which yesterday surged on news that banking giant J.P. Morgan used the blockchain to tokenize portfolios, lost more than 10% of its value. It was trading for $20.97 by the time this story was published.\n\nEdited by Stacy Elliott."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiY0FVX3lxTE00Vm01NjRRdmJMRUlSZ2IxYXBkSm9mM3huS1hjdXZGM0xJNEd3UjE1TWZabl80TUZtOTlFb0d1WUdwVjRhLXZycEdtX1l1bTN5VGRqZDlQR2FTLThvTUZUSHhsZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 16:51:13 GMT",
        "title": "SEC delays decision on Hashdex ETH ETF rule change - Blockworks",
        "content": "The US Securities and Exchange Commission has delayed a decision on Hashdex’s proposed ethereum ETF rule change.\n\nThe move, confirmed by a filing dated Nov. 15, comes just days after the regulator similarly delayed Hashdex’s bitcoin ETF proposal.\n\nIf the SEC were to approve the rule change, the ETF would hold future and spot ether contracts.\n\nAccording to the SEC’s filing, the Commission now has until Jan. 1, 2024 to make a decision or “institute proceedings to determine whether to disapprove the proposed rule change.”\n\nThe delay is one of the handful expected this week, including SEC decisions on the Franklin Templeton proposed spot bitcoin ETF. The SEC also postponed a decision on Grayscale proposed ethereum ETF rule change on Nov. 15.\n\nThe Grayscale delay, as noted by Bloomberg analyst James Seyffart, was not “remotely surprising.”\n\nThis isn’t the first round of SEC delays on recent bitcoin or ether spot ETF applications, either. Back in late September, the agency delayed the BlackRock and Valkyrie spot bitcoin ETF decisions.\n\nThroughout the years, the SEC has issued over 30 rejections to a number of filers including the Winklevoss twins. The spot bitcoin race really began heating up in July of this year after BlackRock — the world’s largest asset manager — tossed its hat in the ring. BlackRock has faced a very few number of rejections for their funds, pumping the optimism for eager ETF watchers.\n\nIn October, eagle-eyed viewers noted that the asset management firm seemed to take a step closer to a possible green light from the SEC after the ETF was listed on the Depository Trust and Clearing Corporation’s website. However, a DTCC spokesperson later told Blockworks that the move did not signal a possible approval by the SEC.\n\nBlackRock has also thrown its hat in the ring for a possible spot ether ETF.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE8wZ0ZHYzM4VGdtZlVoOUVQY0lvaW1MaGNiR2E3RG5jbkozU2FVOWxQYWVtMHZ0dmt5cG9BVDQ0cW9CN3p1SnRKUk4zY3J3UndUMThmcmZoWDkxUXZCX010c0drcFQyNFY5M2F1UkpINXNhdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 17:14:10 GMT",
        "title": "Nocturne brings private accounts to Ethereum - Blockworks",
        "content": "Nocturne, a protocol that enables private accounts on Ethereum, has launched its first version on mainnet.\n\nThe protocol is designed so that users are able to deposit or receive funds privately on what Vitalik Buterin calls stealth addresses.\n\nThis means that users can generate a secret spending and viewing key, which can then be used to create multiple meta-addresses that can be used to interact with other accounts.\n\nThese addresses are held within Nocturne smart contracts and are intended to be used to trade what the company refers to as ‘hot assets,’ or crypto assets that are not designed to be held.\n\nAccording to Nocturne, its smart accounts will be compatible with DeFi protocols that “represent state via output tokens.” This means that it will only be compatible with tokens that are made valuable from a previous input — or tokens where a user must deposit collateral in order to mint the token.\n\nSuch tokens could include Uniswap liquidity tokens, Aave’s aTokens, and Compound’s cTokens.\n\nThere are plans to later extend smart account compatibility to arbitrary protocols with the help of zero-knowledge technology, which can prove ownership of assets without revealing the details of the assets owned themselves, Nocturne notes.\n\nLuke Tchang, CEO and co-founder of Nocturne, noted in a press release reviewed by Blockworks that the company is moving away from simply being a ‘privacy tool.’\n\n“Privacy should be embedded at the account layer and the v1 launch is the first step in making this possible,” Tchang said. “Our goal is to ensure that everyone, from individual users to large institutions, can transact securely without exposing their financial history to the world.”\n\nUsers who wish to access Nocturne v1 can do so through a private vault user interface. The current capabilities of the interface are limited to deposits, transfer of tokens to burner addresses, and private swapping and staking, the company said.\n\nFuture versions of the protocol include the migration of a ‘proof-of-innocence’ protocol that can prove transactions are verified without revealing any information about the user’s identity and further usability and functionality of Nocturne wallets by enabling compatibility with arbitrary smart contracts.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxOS0cwc1JkLUtHeUNIb1hlbjBRdVJyMTNZWTViLUZSdmtIdFBYQ0o3cW11ekVhRnNObWh5ZG8xUEN1MDBTblNwV2JvOW1hQThNTngxRGlmYUdjZ0taUjVSYzBySENEVTBSMlRkTnFIVm5kaFh5NjRBVGQ4N1BwTEtBOWhpcG5Gbk5oYVlWM0duLVhncjZMNXFxTW1YSmRxMGk3WkdpS3lPai1GQ2Z0Z1NYNk11Q2pUR0p4cFE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 14:02:53 GMT",
        "title": "Ethereum Forecasted to Reach $5.8K by 2025; InQubeta’s Bullish Forecast Explained - NewsBTC",
        "content": "InQubeta (QUBE) and Ethereum (ETH) are two of the best coins to invest in right now as both projects are projected to enjoy exponential growth in the coming years. Financial firm Finder recently released projections that had ETH prices reaching $5,824 by 2025. The forecast also anticipates prices will reach $14,411 by 2030.\n\nQUBE predictions are even more impressive with some projections expecting prices to grow as much as 100x by 2025 as the new DeFi project opens up access to artificial intelligence (AI) investments with its crowdfunding approach.\n\nEarly InQubeta investors have already earned 130% returns on their capital and they will be up a total of 440% by the time tokens launch on exchanges. Newcomers to its presale can still earn 90% returns on their investment before the event ends.\n\nBest coins to invest in: InQubeta (QUBE) poised to lead altcoins in growth\n\nInQubeta’s blockchain is hosted on the Ethereum network and it enjoys its transparency, security, and functionality. This allows AI companies fundraising on the platform to mint investment opportunities into non-fungible tokens that are sold on its NFT marketplace.\n\nInQubeta’s link to AI and its small token supply at 1.5 billion gives it comparable growth potential to where Bitcoin (BTC) was a decade ago as it helps to advance artificial intelligence by directing capital to companies in the space. Investments in AI have risen exponentially in the past several years and more than $1.5 trillion is anticipated to be poured into the technology by 2030.\n\nAI is on course to shake up the world and it will open new opportunities for investors to earn huge returns on their investments. Governments worldwide are already passing regulations to help limit the disruption the technology causes as it becomes apparent it will be the next major revolution.\n\nMany would say the AI revolution is already moving full steam ahead as some of the most complex AI concepts like autonomous cars and humanoid robots are now a reality. Thanks to InQubeta, investors who don’t have access to mainstream investment avenues can now be part of the AI revolution.\n\nDecentralized finance meets artificial intelligence\n\nSmart contracts, ERC20 coins, and fractionalization come together to create an inventive investment process on the InQubeta network. Stocks don’t exist here, but ERC20 coins (non-fungible tokens) perform the same duties.\n\nThese tokens are made by startups looking for capital and sold on the NFT marketplace to those looking to invest in AI. Some tokens give other rewards like exclusive access to items developed.\n\nInvestment opportunities can be purchased with QUBE on the NFT marketplace and any tokens bought can be resold whenever.\n\nInvesting in InQubeta\n\nQUBE is currently priced at $0.0161 but could reach a dollar by 2025 if its market share reaches $1.5 billion. That’s not some unsurmountable milestone in the cryptocurrency space given the fact that meme coins with no real value or purpose like Dogecoin (DOGE) have raised over $9 billion despite the many issues plaguing their networks.\n\nEthereum (ETH) fails to keep up with Bitcoin\n\nEthereum price charts have historically mimicked BTC charts, but the second most popular crypto hasn’t been able to keep up with its older sibling during its current bull run. Still, ETH prices have risen 34% in the past 30 days and Finder’s projections have prices reaching $5,800 by 2024.\n\nWhile its anticipated growth won’t keep up with QUBE, it will allow investors to almost triple their investment in a few years.\n\nSummary\n\nInQubeta and Ethereum are two of the best coins to invest in right now thanks to their impressive projections. QUBE is expected to see more growth than ETH, thanks to how undervalued tokens currently are, the project’s creative way of advancing AI, and the $1.5 trillion projected to be guided into the space by 2030.\n\nVisit InQubeta Presale\n\nJoin The InQubeta Communities\n\nDisclaimer: This is a paid release. The statements, views and opinions expressed in this column are solely those of the content provider and do not necessarily represent those of NewsBTC. NewsBTC does not guarantee the accuracy or timeliness of information available in such content. Do your research and invest at your own risk."
    }
]