[
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxON3o0RENWOFB5ZlJBY3hqOGQ2WGhLNFdNdjE3UmRSXzNxTE9nR1AyWWNNQ2RvVlJLOFk4cDJGUDdpWkVoZW1MR1pVcTh6NG5mdmx2S2VBV3lweTAxdlBVaEhocUFPTFY2YlRYekVsLVVJaW9TeVNmRkVWbGpQOW1PLTdYNFc3NDdudnI2eFc5NTVuODFVYmVwX2tB0gGfAUFVX3lxTE9TRm1RNDBXY0x4QmdsbmZaRm4xMm1hNE1NVXJQUG01dElMc1l6VDdMUG9sejJqeU43d2lDeUoyVF9YYjhKOEtaTW54eThPUllLazhNYW10c1ctUzN5bXEtY2Q2N2V3SG1LRDlVTlk1NTM3QXJuTWxoMjFMM0R0Nl9JQ1B6WUg4bG8wYjR5VGNVaURtbVRWU3BGUlg3MUpOOA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "Solana Founder Gives Ethereum's Vitalik Buterin His Flowers After This Happened - U.Today",
        "content": "In a surprising turn of events, Anatoly Yakovenko, the cofounder of Solana, took to X to express his appreciation for Ethereum's visionary founder, Vitalik Buterin. The post comes in the wake of a pivotal moment in SOL's history that shook the crypto world.\n\nAdvertisement\n\nThe focal point of Yakovenko's tweet can be traced back to a message Buterin shared on Dec. 30 last year, where he acknowledged the earnest and smart developer community at Solana. At that time, Solana was grappling with the consequences of the collapse of the crypto exchange FTX, which was closely intertwined with the blockchain.\n\nSOL to USD by CoinMarketCap\n\nThis unfortunate incident resulted in a significant drop in the price of SOL, hitting a three-year low of $7.78 per token.\n\nAdvertisement\n\nWhat added to the challenge was the dwindling number of developers within the Solana ecosystem, with only approximately 70 left. This raised concerns about the platform's future viability.\n\nCrypto unity\n\nYakovenko's appreciation for Buterin's message extends beyond the competition and rivalry between the Ethereum and Solana communities. He emphasizes that even though the two blockchain ecosystems may have their differences, they are united by the common goal of advancing the industry.\n\nWith all fairness @chainyoda, my read is that Mert isn’t attacking ethereum folks or the community.\n\n\n\nWe are supposed to argue about tech and vision in the search of truth. Maybe it’s not possible to build the best world computer and best stateless money in one design.\n\n\n\nThere… — toly 🇺🇸 (@aeyakovenko) November 1, 2023\n\nThe Solana cofounder asserts that these disputes should revolve around technological advancement and vision, ultimately contributing to the betterment of the entire crypto industry.\n\nIn essence, the message highlights the significance of collaboration and unity within the crypto space, reminding us that even in times of competition, the industry thrives on collective efforts to push the boundaries of what's possible."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxQNmFMblhFODRreFo2ZnNDMHdrUGJrRmJBT09NbF96Uk92YVZ4cnMzb2Z4RGM2b2tFQ2ZJbGdjOEZFMkhzaE5kNUVwejBoMldUNGZEM2Y0Y1FtR0I5Z0VzdG9SNkxXVi0tblB3TWc1VnFDNks3SkI1NU5UYXpzeGdBZnV1UXRKMmtwTkFZcXlmT0wxb1lTc1cxeXBoejRmdzF3bEZrOEFjTmpESC1NX3pDVVNPYw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "Vitalik Buterin says Ethereum layer-2 solutions will become more diverse and specialized - CryptoSlate",
        "content": "The Ethereum layer-2 ecosystem continues to expand and diversify, according to Ethereum co-founder Vitalik Buterin in a recent blog post. As new scaling solutions emerge, Buterin predicts increasing heterogeneity in layer 2 designs based on specific security and cost tradeoffs.\n\nRollups, validiums, sidechains, and other layer-2 constructions offer different balances between decentralization, security, and scalability. Financial applications demand the highest security guarantees, while social media and gaming can accept some downtime in exchange for lower fees.\n\nButerin notes that projects transitioning from independent layer-1s to Ethereum layer-2s will likely take a gradual, multi-stage approach. Moving all activity to a rollup at once would hurt usability, but waiting too long risks missing the opportunity. Centralized projects and niche layer 1s also want enough decentralization for added security assurances without sacrificing high throughput.\n\nHow differing layer-2s interact with Ethereum\n\nValidiums rely on zero-knowledge proofs to ensure correct computation without storing all data directly on Ethereum. This saves costs compared to rollups, but validiums face data availability risks if operators fail to make data available. Rollups guarantee users can always withdraw funds to the Ethereum mainnet.\n\nDisconnected systems like sidechains offer even lower costs but require trust in a small set of validators. Hybrid approaches are also emerging, such as validiums that allow users to pay for periodic Ethereum data availability.\n\nButerin emphasizes the importance of external chains maintaining tight links to Ethereum. This reduces security risks when bridging Ethereum-native assets and enables shared account abstractions across chains.\n\nValidating bridges can provide validium-level security, proving correct state transitions. However, handling edge cases like 51% of attacks requires a social commitment to coordinate upgrades. Reading Ethereum data and reverting when Ethereum reverts is also critical. Chains that only read Ethereum’s finalized blocks avoid some complexity but give up functionality during periods of low finality.\n\nOverall, Buterin sees merit across a spectrum of layer-2 designs. Applications will continue tailoring solutions to their specific security, scalability, and decentralization needs. However, maintaining connections to Ethereum provides benefits regardless of the architecture. He believes that, as technology progresses, projects can strengthen their ties to Ethereum in stages over time.\n\nMentioned in this article"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNR2dKbTJFSC1LUmVkSk84cDdsbGh2cE1NOFFsV2xvQVY2WEtNWHN6cEg2Wkp5WlJBOFQ2RURQSHFwLU9SRTVLUUUxOGxveldsY0d6amtvTjdteVRCNUoyU2l0Q09JUjFmX0tucmtRMlhuNG1LbWs0M3loUW1WRWhScThjQ05zelcwcUxtRA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "Introducing $CHIMPZ: The Ultimate Safe Haven for Risk-Takers on Ethereum Blockchain - Yahoo Finance",
        "content": "Chimpz\n\nGeorge Town, Cayman Islands, Nov. 01, 2023 (GLOBE NEWSWIRE) -- In an exciting leap towards the moon, $CHIMPZ , the crypto community's newest sensation, is thrilled to announce its upcoming launch on the Ethereum Blockchain. This digital sanctuary for risk-takers worldwide is set to redefine the world of cryptocurrencies and propel its community into the next moon mission.\n\nInspired by the historic journey of Ham the Chimp, Chimpz is a cryptocurrency project dedicated to risk-takers and daredevils who are ready to join the ranks of the audacious. Just as Ham challenged the boundaries of space exploration, Chimpz challenges the conventional in the world of crypto. It's time for the primates to take over.\n\nSuccessful Presale and Anticipated Launch\n\n$CHIMPZ recently conducted a groundbreaking presale event on PinkSale, garnering significant interest and support from investors, enthusiasts, and risk-takers who are ready for the adventure of a lifetime.\n\nWith the presale completed, $CHIMPZ now gears up for the grand moment that the crypto world has been waiting for. $CHIMPS is scheduled to launch on Uniswap on November 01, 2023, 18:00 UTC. This exciting milestone is just around the corner, and the project thrilled to invite everyone to be part of the journey.\n\nChimpz - More Than Just a Token\n\nChimpz, with its symbol $CHIMPZ, is more than just a token; it's a ticket to an exclusive community. As a $CHIMPZ holder, users can gain access to a private Discord group where they can engage with peers, chart analysts, and the Chimpz team directly. This exclusive membership offers a gateway to future ICOs, NFT whitelists, early alpha releases, and risk management groups.\n\nIn a world where opportunities often seem reserved for the privileged few, Chimpz levels the playing field, allowing everyone to be a part of this exciting journey.\n\nUnwavering Security and Transparency\n\nChimpz takes financial safety seriously. The project has partnered with industry leaders such as InterFi, BlockSaFu, Coinscope, SolidProof, and Consult for contract security. With their backing, Chimpz is fortified against potential risks, ensuring a secure and reliable environment for its community.\n\nAdditionally, Chimpz has teamed up with Pinksale for its presale and KYC verification, adding an extra layer of security and trust. Ownership will be renounced post-launch, and liquidity will be locked for an entire year.\n\nTokenomics - A Win-Win for Everyone\n\nChimpz boasts a total supply of 1,000,000,000 tokens and an impressive array of features to safeguard its community. The contract comes equipped with Anti-Bot, Anti-Sandwich, Anti-Gas, and Safu Code, all developed by the renowned contract creator Trynos.\n\nStory continues\n\nThe tax structure at launch is designed to benefit all holders. There is a 3% fee for both purchases and sales, with 2% allocated for long-term marketing and development. The remaining 1% is distributed as reflections to holders, effectively putting the power in the hands of the Chimpz community.\n\nChimpz - A Community of Dreamers\n\nChimpz's mission revolves around three core pillars: Security, Transparency, and Inclusivity. This project isn't just about making money; it's about creating a supportive ecosystem where individuals from all backgrounds can come together and thrive.\n\n100x Potential in 2023?\n\nThe burning question on everyone's mind: Does Chimpz have the potential to soar to new heights in 2023? With a successful presale, and the official launch scheduled for November 1, 2023, 18:00 UTC, the Chimpz team is gearing up for an exciting ride.\n\nThe presale funds are allocated wisely, with 60% going into the liquidity pool, ensuring stability and sustainability, and 40% will be distributed in various ways to further propel Chimpz:\n\nMarketing/Partnerships (20%): A significant portion will be invested in marketing and forging strategic partnerships to boost the project's visibility and reach.\n\nDapp Development (10%): Innovation is at the heart of Chimpz. The funds allocated for Dapp development will ensure that the Chimpz ecosystem continues to evolve, providing exciting opportunities for its community.\n\nInitial CEX Funds (10%): To make Chimpz accessible to a broader audience, 10% of the funds will be allocated to initial Centralized Exchange listings.\n\nIn a world where cryptocurrencies have the potential to change lives, Chimpz emerges as a project that combines audacious dreams with solid fundamentals. The potential for 100x gains in 2023 is an exciting prospect, and the Chimpz team is dedicated to making this journey a reality for its community.\n\nDon't miss the opportunity to join the Chimpz community and become a part of a revolution in the world of crypto. Visit the Chimpz website at https://www.chimpzerc.com/ , and connect with them on Twitter ( https://twitter.com/ChimpzERC ) and Telegram ( https://t.me/ChimpzPortal ). The moon is waiting, and the Chimpz are ready to take you there. Apes together strong!\n\nAbout Chimpz\n\nChimpz is more than just a cryptocurrency; it's a daring mission inspired by the legendary journey of Ham the Chimp. It has created a vibrant, inclusive community for risk-takers and crypto enthusiasts who dare to dream big. Holding $CHIMPZ not only gives users a ticket to the exclusive Discord, where they can connect with peers and experts but also grants them priority access to exciting ICOs, NFT whitelists, and early alpha releases.\n\nCHIMPZ’s commitment to security, transparency, and inclusivity sets Chimpz apart, ensuring that the audacious dreams of our community members are within reach.\n\nWebsite | Twitter | Telegram | Discord\n\n\n\nhttps://www.chimpzerc.com/\n\n\n\nDisclaimer: This announcement is not directed at any investors or potential investors, and does not constitute an offer to sell — or a solicitation of an offer to buy — any securities or cryptocurrencies, and may not be used or relied upon in evaluating the merits of any investment. Any projections, estimates, forecasts, targets, prospects, and/or opinions expressed in this release are subject to change without notice. The contents herein should not be construed as or relied upon in any manner as investment, legal, tax, or other advice.\n\nCONTACT: Macho Randy Chimpz contact(at)chimpzerc.com\n\n\n\n"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNR2dKbTJFSC1LUmVkSk84cDdsbGh2cE1NOFFsV2xvQVY2WEtNWHN6cEg2Wkp5WlJBOFQ2RURQSHFwLU9SRTVLUUUxOGxveldsY0d6amtvTjdteVRCNUoyU2l0Q09JUjFmX0tucmtRMlhuNG1LbWs0M3loUW1WRWhScThjQ05zelcwcUxtRA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "Introducing $CHIMPZ: The Ultimate Safe Haven for Risk-Takers on Ethereum Blockchain - Yahoo Finance",
        "content": "Chimpz\n\nGeorge Town, Cayman Islands, Nov. 01, 2023 (GLOBE NEWSWIRE) -- In an exciting leap towards the moon, $CHIMPZ , the crypto community's newest sensation, is thrilled to announce its upcoming launch on the Ethereum Blockchain. This digital sanctuary for risk-takers worldwide is set to redefine the world of cryptocurrencies and propel its community into the next moon mission.\n\nInspired by the historic journey of Ham the Chimp, Chimpz is a cryptocurrency project dedicated to risk-takers and daredevils who are ready to join the ranks of the audacious. Just as Ham challenged the boundaries of space exploration, Chimpz challenges the conventional in the world of crypto. It's time for the primates to take over.\n\nSuccessful Presale and Anticipated Launch\n\n$CHIMPZ recently conducted a groundbreaking presale event on PinkSale, garnering significant interest and support from investors, enthusiasts, and risk-takers who are ready for the adventure of a lifetime.\n\nWith the presale completed, $CHIMPZ now gears up for the grand moment that the crypto world has been waiting for. $CHIMPS is scheduled to launch on Uniswap on November 01, 2023, 18:00 UTC. This exciting milestone is just around the corner, and the project thrilled to invite everyone to be part of the journey.\n\nChimpz - More Than Just a Token\n\nChimpz, with its symbol $CHIMPZ, is more than just a token; it's a ticket to an exclusive community. As a $CHIMPZ holder, users can gain access to a private Discord group where they can engage with peers, chart analysts, and the Chimpz team directly. This exclusive membership offers a gateway to future ICOs, NFT whitelists, early alpha releases, and risk management groups.\n\nIn a world where opportunities often seem reserved for the privileged few, Chimpz levels the playing field, allowing everyone to be a part of this exciting journey.\n\nUnwavering Security and Transparency\n\nChimpz takes financial safety seriously. The project has partnered with industry leaders such as InterFi, BlockSaFu, Coinscope, SolidProof, and Consult for contract security. With their backing, Chimpz is fortified against potential risks, ensuring a secure and reliable environment for its community.\n\nAdditionally, Chimpz has teamed up with Pinksale for its presale and KYC verification, adding an extra layer of security and trust. Ownership will be renounced post-launch, and liquidity will be locked for an entire year.\n\nTokenomics - A Win-Win for Everyone\n\nChimpz boasts a total supply of 1,000,000,000 tokens and an impressive array of features to safeguard its community. The contract comes equipped with Anti-Bot, Anti-Sandwich, Anti-Gas, and Safu Code, all developed by the renowned contract creator Trynos.\n\nStory continues\n\nThe tax structure at launch is designed to benefit all holders. There is a 3% fee for both purchases and sales, with 2% allocated for long-term marketing and development. The remaining 1% is distributed as reflections to holders, effectively putting the power in the hands of the Chimpz community.\n\nChimpz - A Community of Dreamers\n\nChimpz's mission revolves around three core pillars: Security, Transparency, and Inclusivity. This project isn't just about making money; it's about creating a supportive ecosystem where individuals from all backgrounds can come together and thrive.\n\n100x Potential in 2023?\n\nThe burning question on everyone's mind: Does Chimpz have the potential to soar to new heights in 2023? With a successful presale, and the official launch scheduled for November 1, 2023, 18:00 UTC, the Chimpz team is gearing up for an exciting ride.\n\nThe presale funds are allocated wisely, with 60% going into the liquidity pool, ensuring stability and sustainability, and 40% will be distributed in various ways to further propel Chimpz:\n\nMarketing/Partnerships (20%): A significant portion will be invested in marketing and forging strategic partnerships to boost the project's visibility and reach.\n\nDapp Development (10%): Innovation is at the heart of Chimpz. The funds allocated for Dapp development will ensure that the Chimpz ecosystem continues to evolve, providing exciting opportunities for its community.\n\nInitial CEX Funds (10%): To make Chimpz accessible to a broader audience, 10% of the funds will be allocated to initial Centralized Exchange listings.\n\nIn a world where cryptocurrencies have the potential to change lives, Chimpz emerges as a project that combines audacious dreams with solid fundamentals. The potential for 100x gains in 2023 is an exciting prospect, and the Chimpz team is dedicated to making this journey a reality for its community.\n\nDon't miss the opportunity to join the Chimpz community and become a part of a revolution in the world of crypto. Visit the Chimpz website at https://www.chimpzerc.com/ , and connect with them on Twitter ( https://twitter.com/ChimpzERC ) and Telegram ( https://t.me/ChimpzPortal ). The moon is waiting, and the Chimpz are ready to take you there. Apes together strong!\n\nAbout Chimpz\n\nChimpz is more than just a cryptocurrency; it's a daring mission inspired by the legendary journey of Ham the Chimp. It has created a vibrant, inclusive community for risk-takers and crypto enthusiasts who dare to dream big. Holding $CHIMPZ not only gives users a ticket to the exclusive Discord, where they can connect with peers and experts but also grants them priority access to exciting ICOs, NFT whitelists, and early alpha releases.\n\nCHIMPZ’s commitment to security, transparency, and inclusivity sets Chimpz apart, ensuring that the audacious dreams of our community members are within reach.\n\nWebsite | Twitter | Telegram | Discord\n\n\n\nhttps://www.chimpzerc.com/\n\n\n\nDisclaimer: This announcement is not directed at any investors or potential investors, and does not constitute an offer to sell — or a solicitation of an offer to buy — any securities or cryptocurrencies, and may not be used or relied upon in evaluating the merits of any investment. Any projections, estimates, forecasts, targets, prospects, and/or opinions expressed in this release are subject to change without notice. The contents herein should not be construed as or relied upon in any manner as investment, legal, tax, or other advice.\n\nCONTACT: Macho Randy Chimpz contact(at)chimpzerc.com\n\n\n\n"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQWU42aHl5YXE1RzdzTlpZWEFYa0RaY2s5SjFWS0ZXTEpaOHVOWHRtNlU0RkJYbkZXSHdMOVpFYm91ZERDRGZyQldsUzFSVVZHb2l5Yk12N09GSHRqQlNTbU1HVTJ2U19hVC1abzJQX0RaRUNPNXFSUG0yckVxU0YzNzBCSExqZjZkcFE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "Ethereum’s Dencun upgrade: EIP-7514 and its impact on ETH price - crypto.news",
        "content": "Ethereum core developers have included EIP-7514 in the upcoming Dencun upgrade. This proposal slows the growing ETH staking while allowing developers to explore long-term solutions for unchecked staking.\n\nEIP-7514 is an Ethereum Improvement Proposal co-authored by Tim Beiko and Dapplion that is meant to slow down the rate of Ether (ETH) staking.\n\nThe proposal is part of Ethereum’s Dencun upgrade slated for activation in October 2023, and it is essentially an attempt to buy the community time to come up with a more practical reward scheme for stakers on the network.\n\nNext up, we continued a conversation from last week's ACDC call, about whether to add a constant cap to the validator activation queue. The proposal had since then been formalized as EIP-7514: https://t.co/sd4D4GlMRY — timbeiko.eth ☀️ (@TimBeiko) September 14, 2023\n\nAccording to some Ethereum developers, if the pace of staking remains unchecked, it will be possible to witness half of all ETH staked by May 2024, which could escalate to three-quarters by September 2024 and potentially hit 100% by December 2024.\n\nThe Beacon chain is growing exponentially\n\n\n\nWe all like up-only, but not when the safety of Ethereum is at stake. By doing nothing, next year we will enter unknown economic territory with >50% of total ETH stake\n\n\n\nToday ACD will vote to bound max growth to buy research time pic.twitter.com/iA7T6BHjak — Lion ⟠ dapplion .eth (@dapplion) September 14, 2023\n\nWhile at first glance, this might appear positive, it could apply undue pressure on the network and render the rewards for staking less attractive.\n\nEIP-7514 is meant to bring changes to the way new validators, those responsible for processing transactions and creating blocks, can join the network.\n\nIt is a temporary fix to manage the increasing number of validators while also allowing developers to look for more permanent solutions. These future solutions could lead to big changes in Ethereum’s economic rulebook, potentially sparking a new age of staking in the system.\n\nSo, how did it get to the point where a squeeze on ETH staking became necessary? And more importantly, what are the possible future ramifications of EIP-7514 on the price of ETH? Read on to find out more.\n\nThe Merge and the staking surge\n\nIn 2022, the Ethereum network successfully executed a large-scale software upgrade, commonly referred to as the “Merge,” that moved it from the energy-intensive proof-of-work (PoW) consensus mechanism to the more sustainable proof-of-stake (PoS) mechanism.\n\nFor those not in the know, a consensus mechanism is a protocol used in a blockchain network to ensure all computers or nodes making up the network agree on a single data set. It serves as the standard for verifying and approving each transaction on the blockchain.\n\nThe Ethereum upgrade involved merging the original Ethereum mainnet with a separate PoS blockchain called the Beacon Chain, allowing the network to transition from a mining-based PoW blockchain to a staking-based PoS model.\n\nStaking is when users lock up their ETH tokens as a way of validating transactions on the network. In return, these validators are rewarded with more ETH tokens.\n\nThis feature is central to Ethereum because it provides the mechanism for achieving consensus in the network. It encourages security by ensuring validators have a vested interest in the network, particularly since they risk losing their staked ETH if they try to cheat the system.\n\nTo become a validator requires staking a minimum of 32 ETH, which is worth approximately $52,000 at current rates.\n\nYou might also like: Ethereum goes red as active addresses, deposits spike\n\nStaked ETH withdrawal and the rise of liquid staking\n\nThe introduction of staking was met with soaring demand, sparking concerns regarding the potential for the Ethereum network to become overly congested.\n\nDriving this fervor for staking was EIP-4895, introduced as part of the April 2023 Shanghai upgrade, which allowed validators to withdraw staked ETH and staking rewards.\n\nAccording to Dankrad Feist, a researcher at the Ethereum Foundation, while the implementation of EIP-4895 was anticipated to grow Ethereum’s validator network, the widespread impact of liquid staking was not fully realized at the time.\n\nLiquid staking is a solution that allows users to stake their ETH directly on Ethereum in exchange for an ERC-20 liquid staking token (LST) that represents their staked ETH. It enables the staked ETH to remain liquid or movable rather than locked on the blockchain.\n\nThe three biggest liquid staking derivatives (LSDs) on the Ethereum mainnet are stETH by Lido, rETH by RocketPool, and SETH2 by Stakewise. They allow users to stake and unstake any amount of ETH without waiting for a specific unlock period.\n\nIn Feist’s opinion, the unwillingness of staking pools to self-regulate, especially those holding a dominant position in the liquid staking arena, could potentially jeopardize Ethereum’s decentralization.\n\nThe researcher suggested a governance attack on a major staking protocol might pose significant challenges for Ethereum.\n\nMy reasoning on why I'm for EIP-7514. It is currently unclear if (especially liquid) staking will keep growing indefinitely. In the case that the withdrawal queue does not empty over the next few months, the lower churn limit will give the Ethereum community the time needed to… — Dankrad Feist (@dankrad) September 14, 2023\n\nETH developers foresee exponential growth in validator sets\n\nIn the PoS version of Ethereum, validators are randomly chosen to confirm transactions and create a set of consecutive blocks called an epoch.\n\nAn epoch is important as it helps in the management of the blockchain, ensuring not all validators are active at the same time, which would be inefficient and unnecessary. Each epoch lasts about 6.4 minutes and is made up of 32 slots, with each slot allocated 12 seconds.\n\nAt each slot, the system allows a validator to propose a block, even though not all slots may contain a block.\n\nAs mentioned previously, validators earn their status by staking ETH, and the potential for profit has seen more and more users joining as validators and increasingly staking higher amounts of ETH.\n\nHowever, this rapid growth in validators has raised a couple of issues. First, it could burden Ethereum’s peer-to-peer (P2P) networking infrastructure, increasing the chances that nodes making up the network may fail due to higher computational and bandwidth demands caused by increased “gossip messages” among validators.\n\nSecondly, the expanding number of validators could complicate Ethereum’s attempts to achieve single-slot finality, the quest to make a transaction final and irreversible in just one slot.\n\nThere are currently more than 795,000 active validators. With the next upgrade following Dencun not anticipated until May 2024 at the earliest, Dankrad Feist fears there may be more than 2 million validators by then.\n\nMoreover, he believes that the Ethereum community will find itself in uncharted waters if the combined LST market cap surpasses that of unstaked ETH.\n\n“This technical problem is exacerbated by an economical one: liquid staking tokens exceeding the remaining (unstaked) Ether market cap brings us in an untested economic regime. A point of no return might be reached when incentives lead to them having similar liquidity and utility in DeFi – even a staking yield close to 0% (but still positive) might be enough to keep the LST attractive” Dankrad Feist, Ethereum Foundation researcher\n\nAt present, approximately 25.8 million ETH, representing 21% of all ETH in circulation and equivalent to a staggering $41.8 billion, has been staked, per data from beaconcha.in.\n\nAccording to projections by Ethereum developers Tim Beiko and Dapplion, should the current momentum persist, the percentage of staked ETH in relation to total ETH supply could mushroom to 50% by May 2024 and escalate to 100% by the end of that year.\n\nProjected validator set | Source: ethereum.org\n\nIf Beiko and Dapplion’s projections were to hold true, the Ethereum network might find itself devoid of ETH, meaning that users will have no way to pay for transactions on the network.\n\nYou might also like: Ethereum unveils new testnet called ‘Holešky’\n\nThe EIP-7514 solution\n\nEIP-7514 doesn’t directly address the potential technical and economic problems emanating from the unprecedented growth of ETH staking. Instead, it seeks to buy the Ethereum community a bit of time to find lasting solutions for them.\n\nIt essentially puts the brakes on the growth of staked ETH by restricting the churn limit, which is the number of validators that can enter or exit the network during an epoch.\n\nUsually, Ethereum’s churn limit is dynamic, determined by calculations based on the total number of active validators divided by 65,536. As of Sept. 11, 2023, the upper churn limit was 12 per epoch, with the next determination set for Oct. 4.\n\nYesterday, the churn limit increased from 11 to 12. Next churn limit increase projected to occur around October 4!\n\n\n\nH/t: @dapplion pic.twitter.com/ftwhRxbGFE — Christine Kim (@christine_dkim) September 11, 2023\n\nBeiko and Dapplion’s proposal seeks to do away with the dynamic calculations and instead establish a fixed maximum churn limit of 8 per epoch.\n\nIn so doing, EIP-7514 could theoretically extend the time it would take for staked ETH to reach 50% of total ETH supply by at least one year and as many as four years for it to get to 100%, therefore giving the community enough time to find lasting solutions for the imperfections in the validator reward system.\n\nThis proposed cap will not interfere with the churn limit that controls validator exits. That limit will keep adjusting dynamically, maintaining a balance with the expansion of the validator set.\n\nThe goal is to prevent a scenario where the staking withdrawal queue is constantly full, therefore complicating the efficient administration of validator rewards.\n\nWhile the proposal has largely been positively received, some sections of the Ethereum community have been critical of its rushed nature and have suggested it could compromise Ethereum’s neutrality.\n\nhttps://twitter.com/ryanberckmans/status/1702336972700942366\n\nPotential EIP-7514 impact on ETH price\n\nThe immediate impact of EIP-7514 on the price of ETH is unclear at this point, but some market watchers think it could have a noteworthy long-term effect.\n\nThe proposal is intended to slow down the rate of ETH staking, which, in turn, could potentially influence the coin’s supply-demand dynamics.\n\nIf successfully executed, EIP-7514 could significantly reduce the amount of ETH being staked, therefore alleviating the potential pressure on the Ethereum network and making staking rewards more attractive.\n\nSome analysts believe the enhanced attractiveness of staking rewards and the reduced supply of ETH in the market could potentially increase its price.\n\nHowever, the proposal is only a temporary fix for managing an increased number of validators, and the Ethereum community will still have to find a more permanent solution. As such, the long-term effects of EIP-7514 on the price of ETH may be speculative at best, depending on what these future solutions could be.\n\nIf they result in a more efficient and secure network, it can potentially boost Ethereum’s overall value, resulting in a price increase for ETH. Conversely, if these changes are not well-received or cause network instability, it could put downward pressure on the ETH price."
    }
]