[
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxQR0swZzg2MVoxcnREeE0wbVU4Y2hwdFJGZlJINVlGTVZ4Zkc4SWxvY1AzYWpPM2RHOFBXWko5R0Z4a0V2N1hIZDdJV1gxQXk1TlY3WHlremEzR0hfeGdaUlZ2X3lYWWduaFNZdG1meHRUVGlXZU1DeW02TUdVS2hjM1BNX3duVUpOQ29GVG1WYUVkYy1xaEhPMHd1a3lDOHkwMTRhYkZDa3NoaDIyZzgtTGs5NHJkU3Vtc3BiR1djLV80dUhsN2RN?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Peter Brandt Predicts Bitcoin to Hit $43,289, Also Identifies Rising Wedge on Ethereum Chart - The Crypto Basic",
        "content": "Bitcoin (BTC) is on track to clinch a $43,289 price amid the formation of a pennant, as disclosed by veteran analyst Peter Brandt, who also called attention to a bearish rising wedge for Ethereum (ETH).\n\nBrandt made these disclosures in two separate analyses of the two largest crypto assets in the market. In a recent Bitcoin analysis, the analyst highlighted the formation of a pennant pattern on the BTC daily chart amid the ongoing uptrend.\n\nBitcoin Forms Bullish Pennant\n\nA pennant during an uptrend is a bullish continuation pattern. It features converging trendlines forming a small symmetrical triangle, preceded by a flagpole, which reflects the previous price surge. This pattern suggests a brief consolidation before the previous upward trend is likely to resume.\n\n- Advertisement -\n\nThe flagpole of the current pennant formed when Bitcoin staged a rally from the $26,555 low on Oct. 12. The rally saw BTC appreciate to $35,280 on Oct. 24, marking a massive 33% increase in less than two weeks. Although Bitcoin has retained its upward trajectory, the momentum has reduced, leading to the formation of the pennant.\n\nWhen a pennant forms, analysts view it as a brief pause to the rally, preceding a continuation of the bull run. According to Brandt, to gauge the extent of the next price rally, market participants should measure the height of the previous price rally that formed the initial flag pole, from the lowest to the highest point into the pennant.\n\nAccording to him, they can then project this same appreciation rate for the next surge, starting from the last small reaction inside the flag. Using this technique, Brandt projects that Bitcoin could appreciate $43,289 in the following price run after breaking out from the flag.\n\nEthereum Forms a Rising Wedge\n\nWhile Bitcoin could see a potential rally, Ethereum finds itself in a bearish pattern. Notably, ETH recently formed a rising wedge on the weekly timeframe, as highlighted by Brandt in a recent post on X.\n\nMarket watchers typically consider a rising wedge a bearish reversal pattern. It forms converging upward-sloping trendlines, indicating a tightening range between highs and lows. The pattern signals that the upward momentum is weakening and that a potential trend reversal to the downside may occur.\n\n- Advertisement -\n\nNotably, the rising wedge formation began in June 2022 when ETH slumped to a low of $881 following the Terra collapse in May. The asset registered a comeback, eventually recovering its lost value. However, amid the recent uptrend, a slowdown has resulted in the formation of the wedge.\n\n“It will be interesting to see if this market can expand beyond this pETH of pie,” Brandt said on X, calling attention to the bearish structure.\n\nPeter Brandt’s statement appears to be a play on words, referring to a portion of the Ethereum price chart within the rising wedge pattern. Brandt’s words suggest that the analyst is watching to see if Ethereum’s price can break out of the pattern and surpass the upper boundary of the wedge.\n\nMeanwhile, Ethereum seems to be seeing gains in the short term, while Bitcoin is currently down. ETH is up 7.12% over the past 24 hours, currently trading for $2,080. However, BTC is changing hands at $37,100, with a 1.50% decline within the same timeframe."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE1nTDZEeWduMWdMWWxjRkttQnpxbXBEQzZpcTRBWFgxMGZCVzVRa2NvcG9mb0VUNWhlVWROOGtBWk82aFpQbmlzZ3M0dlVscEFHTjRjQW1jMGxOb2RlQS1Fa2tfdmI4cW5XQlUzdDBRZGVCRThRNHBMQTdB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Ethereum gets a BlackRock boost, but the real test lies ahead - Fortune",
        "content": "Happy Friday. The week is ending on a high note for Ethereum, which is back in the news after financial giant BlackRock filed to launch an ETF backed by Ether, the blockchain’s native currency. This led the price to jump 10%, back over the $2,000 mark, for the first time in months as investors bet that BlackRock’s entry will attract billions of dollars in new capital.\n\nThis development brings renewed attention to the world’s second-largest cryptocurrency, which has largely been overshadowed by Bitcoin and even Solana during the long-awaited rally of the last two months. But while Ethereum boosters are rightfully enjoying the price surge, the return of the spotlight has also raised some familiar concerns.\n\nThese include griping about Ethereum’s transactions costs, known as gas fees, which have soared along with the burst of activity on the blockchain that has come with more trading. For long-time crypto watchers, this will bring back unpleasant memories of 2017 and 2021 when hype over Ethereum’s smart contract promise led to a surge in price—followed by the blockchain slowing to a crawl, which in turn forced those who wanted to transact to pay outrageous fees.\n\nEthereum’s momentous shift last year to a proof-of-stake system was supposed to alleviate the price and congestion issues, along with so-called layer-2 solutions—sub-layers on the network that process transactions in batches and then record them on the main blockchain.\n\nThe trouble is that while the layer-2 systems do indeed lower costs dramatically, they add complexity and make the Ethereum user experience—already an ordeal for those who aren’t crypto diehards—even more of a headache. They are also less secure. This has led some to gripe that Ethereum should have devoted its energy to making its main network cheaper and efficient rather than outsourcing the task to other projects.\n\nFinally, the switch to proof of stake has also raised concerns over centralization as a relatively small amount of validators are now responsible for maintaining the network—a fact that Bitcoin purists, never gracious at the best of times, have lampooned mercilessly as part of the crypto world’s eternal infighting.\n\nNone of this means that Ethereum is facing major trouble—the network is the leading smart contract for a reason, with by far the most users and a robust and dedicated developer community. But as a new crypto bull market emerges, it will be harder for the platform to blame familiar headaches on growing pains. Ethereum is now almost a decade old, and the time has come for it to show it can deliver on its enormous potential.\n\nJeff John Roberts\n\njeff.roberts@fortune.com\n\n@jeffjohnroberts\n\nDECENTRALIZED NEWS\n\nChainlink's LINK token is up 175% since January as the oracle provider has branched out from pure crypto pricing to tie-ups with the TradFi sector. (Fortune)\n\nThe notorious \"Cryptoqueen\" who oversaw legal and compliance for Ponzi-like OneCoin pled guilty in the $4 billion fraud. (WSJ)\n\nEconomist Nouriel Roubini, a.k.a Dr. Doom, has long been a fierce critic of Bitcoin and crypto, but in a surprise move is launching his own stablecoin. (The Defiant)\n\nIn a first-of-its-kind crypto bankruptcy exit, a restructuring plan will give Celsius customers 37 cents on the dollar and shares in a new company dedicated to staking and mining. (WSJ)\n\nBitcoin brushed $38,000 on Thursday, the highest the token has traded in 18 months. (Fortune)\n\nMEME O’ THE MOMENT\n\nTFW you learn one-third of Ethereum nodes are 20 miles from CIA headquarters:"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxPelZ3eWk2a3pJSE1BOWY1aHY2RU1mWEU1VUp2dGgxaERES0xGeHpYQXBGZ1lkVnpLNTU2SDk2MVFRTFFvMWZuV0h2YVh4TnY4RlBMYjFMM1B5UEpoQTRBMW1tNTRvWEFsVVd4Sk5wQlBiRF9qRGhfaWhLX2J6MkZJc1Fnb0ZZa0ZHLXVDUjRQWFc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Solana Is on a Tear. So Why Do Ethereum NFTs Remain Top Dog? - Unchained",
        "content": "SOL more than doubled in the last month. But here’s why Ethereum NFTs continue to outperform Solana NFTs by a mile.\n\nSolana is ripping. Not only has general crypto market sentiment turned more positive, which has boosted assets beyond just bitcoin, but Solana also just completed another one of its attention-grabbing conferences, Breakpoint. That’s all led to SOL more than doubling in the past month.\n\nDespite developer interest in Solana, the jump in its token price, and the fact that the speedy chain is known for NFT activity, as of yet, the leading blockchain for NFTs remains Ethereum.\n\nRead more: NFT Trading Activity on Ethereum Surges, Reaching a Six-Month High\n\nAccording to data from CryptoSlam, in the past 30 days, Ethereum led the NFT market in sales volume with $245 million in sales. Ethereum’s activity underscores its dominance, with a vast number of transactions totaling 745,175 and engaging 70,423 buyers.\n\nComparatively, Solana, which stands fourth in the ranking, reported $30.1 million in sales, just 12% of Ethereum’s volume, even after considering the fact that SOL has outperformed ETH by 127% in the last 30 days.\n\nWith Solana struggling to grab market share in the NFT ecosystem, Hildebert Mouiliere, aka Hildobby, a data scientist at VC firm Dragonfly, told Unchained that “a lot of things that appear on [Solana] are just copying what happened on Ethereum, which isn’t very innovative.”\n\nSolana is also battling the fact that Ethereum’s longer history makes it a hub for many types of activity beyond just NFTs. “I think Ethereum has become a center of liquidity for a lot of things,” said gmoney, NFT collector and founder of 9dcc. “And not just NFTs, but also certain tranches of DeFi and what have you. And so I think that’s going to be hard to displace even though there are narratives that build up around other chains.”\n\nHowever, Solana could still become a contender if it builds on the particular advantages of its technology over Ethereum. “I hope that we see in the future some teams actually using what this tech can do to leverage what is lower fees and higher frequency transaction,” said Hildobby.\n\nRead more: Anatoly Yakovenko on Solana’s Astounding Recovery and Its Future Plans\n\nOver a year has passed since marketplaces like Magic Eden sparked a seismic shift in the NFT industry by making creator royalties optional—a move that continues to influence market dynamics.\n\nHildobby noted the complex nature of enforcing such payments and suggested that creators may need to consider additional incentives to encourage voluntary compliance. “It’s impossible to enforce those things,” he said.\n\nAs for where the market could go, Hildobby said he’s looking to the rise of NFT derivatives and lending platforms, which could diversify NFTs as financial instruments. “The vast majority of volume now is around lending, which allows for those high prices to now land at a much discounted rate,” Hildobby explained, emphasizing the potential for these platforms to broaden market participation.\n\nLearn more: What Are NFT dApps?\n\nGmoney also thinks future innovation in NFTs will come in their financialization and bringing real world assets on chain. As an example, he said, “the sneaker resell market is huge,” noting that with NFTs, “you can give them access to credit that they otherwise wouldn’t have.” Once that is a proven application, he said that could show the potential for NFTs to unlock value in other collectors’ items such as watches and handbags. “To me, one of the most interesting things is obviously, definitely the real world asset side of things, because I just think that you need to see the melding of those two worlds at some point, and I think that starts to happen over the next three to five years.”"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFA5QlR4S25jVFk4ZXRGUE1RWGc1eERiN1R4WFZKQURoU1hJUHdZQ3BDdEFaYkt0ZXRMSXBTdExFQ01lcUFVaWtBWDVsVVNBdEN4dFZwa2lOZHprY0haYVRyX1N3MGFXN0hiQThwTlZQQ3pJbFBNMXhBeHB0NkPSAYQBQVVfeXFMTlg0RnZ2cDU1Q2JYT0RzTEY5UUlseDNSVTBMazZ3RHpEd2J0cExSbmpnUjNvUUxNV0dpUGtLVGpCdHBkZW1RN0w5VjhrRHYxSWo4T3VrdHNXY1hRQl92UDljcTJKRVFrOWFWMHdscmNfdUJSNzM1ZmQxRmZiQU1TbWJpY05s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Here We Go Again: Pet Rock JPEGs on Bitcoin, Ethereum Sell for Over $100K - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThis week, half-giddy, half-cautious optimism spread across crypto circles as Bitcoin surged past $37,000 for the first time in 18 months on excitement regarding the approval a spot Bitcoin ETF, and Ethereum pumped past $2,100 on similar news of a pending ETH ETF application from BlackRock.\n\nThere’s clearly an emergent hope within crypto that the bottom—finally—is in. But to those who protest that it could never be a true bull market without obscenely expensive, seemingly pointless JPEGs trading hands: there’s now reason to rejoice on that front as well.\n\nOn Friday, two separate on-chain images of illustrated rocks—one hosted on Ethereum as an NFT, the other inscribed on Bitcoin as an Ordinal—sold for six-figure respective sums on secondary markets.\n\nAn NFT from the EtherRocks collection, EtherRock #95, traded hands this morning for 100 ETH, or just over $209,000. Just hours prior, an Ordinal from the visually identical Bitcoin Rock collection sold for 2.99 BTC, worth just over $111,000 at writing.\n\nAD\n\nAD\n\nThe JPEGs do not come with any affiliated memberships or perks, or anything that doesn’t meet the eye. They are, quite simply, lightly illustrated images of nearly indistinguishable gray boulders that don’t even feature backgrounds.\n\nBitcoin Rock #75 has sold for 3btc on the secondary market. Congratulations to @Scobra9000 on the sale. A warm welcome to @GrantWSchneider, already a legendary collector in the ordinals community, who has now taken it to the highest level. pic.twitter.com/wkqkk8Kbn9 — BITCOIN ROCKS ◉ (@ordrocks) November 10, 2023\n\nDumb as rocks?\n\nEtherRocks first launched in 2017 to little fanfare. Only during the height of the NFT bull run, in late 2021, did the 100-piece collection catch fire—largely as a means to poke fun at the absurdity of value and the crypto market. Individual EtherRocks regularly sold at the time for hundreds of thousands of dollars a piece; one sold for the equivalent of $1.3 million.\n\nAD\n\nAD\n\n“Monetary value of art is all an illusion,” an EtherRocks buyer wrote at the time. “The pet rocks present the perfect shock value, it’s so stupid that it’s perfect. Fate loves irony.”\n\nIn January, an apparently unaffiliated Ordinals user inscribed a set of 100 images almost identical to the EtherRocks onto small denominations of Bitcoin, creating a new collection: Bitcoin Rocks. While that Ordinals collection has not enjoyed the same success as its Ethereum predecessor, it has generated five-figure secondary market sales in recent months.\n\nIn the context of recent market trends, though, Friday’s sales appear to be hitting differently. Numerous Twitter users saw the news as a harbinger of the return of the type of obscenity, absurdity, and flagrant financial foolishness that defined the previous crypto bull run.\n\nLol that scam again.\n\nWe're so back — Dr.M₳ryJ⚡I buy Shitcoins,I hold ₿itcoin ❤₳d₳ᴺᶠᵀ𓊽 (@mary_el83) November 10, 2023\n\nMembers of the crypto community appear divided about whether that’s a good thing or a bad thing.\n\nThis space never fails to amaze me — sugarspicysauce (@sugarspicysauce) November 10, 2023\n\nBut despite the return of bull market antics, crypto activity is nowhere close to the levels enjoyed when EtherRocks were last ascendent. Though Bitcoin Ordinals trading did indeed hit a six-month high earlier this week, and NFT trading volume posted its best numbers since August, those numbers still pale in comparison to the type of volume witnessed during the 2021/2022 NFT bull run.\n\nLast week’s apparently encouraging NFT figures, for example, marked a 93% decrease in trading volume from the market’s peak in April 2022. But these pricey digital rock purchases point to at least a desire for the same kind of frothy, frenzied excitement that defined that earlier era.\n\nAD\n\nAD\n\nEdited by Andrew Hayward"
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxQeDFsdm1lVmlLTjFBQ3dBQjEtbzF0SjFraE42aVpqekRBU1VYUXpOV1c0WW1XYlJtNkVTRlJqY21mb3ZsMERYQ0M5b1FwajdMY2FNZ1BYa0w1eWNta0JwMi16UWFOUmFtWDViWGNmREZqQ1VOSGJjS2pob3BKVzJaal8wZEp5WGdwa0xNeDJiWE43Z0YxaFZCbGdNSjlVb2dBeDdJSVBmb0FuNnZoMXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Nov 2023 08:00:00 GMT",
        "title": "Solana Price Could Reach $1,000, Analyst Explains Why - TradingView",
        "content": "Crypto analyst Jacob Canfield has laid out a comprehensive analysis, suggesting Solana (SOL) could be on the brink of an unprecedented market surge. “In my opinion, I think that Solana is going to continue to be one of the biggest movers during this current bull market cycle,” Canfield states, proposing that Solana could potentially escalate its market dominance to the 12-15% range.\n\nCan Solana Hit $1,000?\n\nCanfield bases his analysis on several indicators. He highlights the Solana Dominance (SOL.D) chart, noting that at the peak market cap, it didn’t even crack 3%. Given the current trends and the breakout of SOLBTC from its weekly resistance, Canfield envisions a scenario where Solana could enter a parabolic rally phase, which is further supported by the SOLETH chart showing a similar pattern. “SOLETH – Also currently broke out of a weekly resistance and looks to be forming a parabolic rally against it.”\n\nNewsBTC\n\nA significant factor in Canfield’s analysis is the current state of Ethereum Dominance (ETH.D). He notes that ETH.D is breaking down from a long-term trendline and losing the 200 weekly moving average, now sitting at 17%. “If Solana continues to trend against Ethereum and it continues to break down to 2019-2020 levels, we could see SOL as the big winner this cycle,” Canfield explains.\n\nHowever, Canfield does not disregard the potential ramifications of recent news regarding an Ethereum ETF. “This may not play out with the current ETF announcement news as it will bring more attention,” he acknowledges, indicating that an approved Ethereum ETF could shift investor focus and capital back to Ethereum, potentially tempering Solana’s ascent.\n\nDespite potential headwinds from the Ethereum sector, Canfield emphasizes Solana’s robust partnerships with corporate giants like Google, Circle, and Amazon, positing that these collaborations could significantly drive adoption and enhance Solana’s visibility in this cycle of the crypto market.\n\nFurthermore, Canfield’s analysis extends beyond charts and partnerships. He delves into the Solana ecosystem, spotlighting projects that are paving the way for its expansion. From decentralized finance protocols and automated market makers to NFT storage solutions and governance tokens for gaming platforms, Canfield points to a breadth of innovation within Solana that parallels, and in some aspects, seeks to outdo Ethereum’s ecosystem.\n\nIn light of the FTX debacle, Canfield remarks on the psychological impact on Solana’s market sentiment, noting that with Sam Bankman-Fried’s legal troubles, there is an opportunity for Solana to redefine itself. “There’s a bit of PTSD around the ecosystem, but it’s time to become its own entity and forge its own future,” he asserts, suggesting that Solana’s future will be shaped by those who are deeply integrated into its ecosystem, from developers to traders and influencers.\n\nHis conclusion: “Solana could triple or quadruple it’s all time high market dominance around 12-15% and if it continues to trend against Bitcoin, could easily see a $1,000 per coin and take the #2 spot behind Bitcoin.” When asked about the potential of Ethereum, Canfield emphasized, “No reason to not have allocations to both. It’s like trying to bet on Microsoft or Google. Tesla or Ford: Just buy both.”\n\nShort-Term SOL Price Outlook\n\nOn the shorter-term horizon, analyst Rekt Capital brings attention to Solana’s price movements in a recent post on X. “Solana continues to outperform in the market. In 2021, SOL upside deviated to $53 and then $61 before retracing to the bottom of the purple box,” he noted, referring to a specific zone on the price chart that has historically acted as both resistance and support.\n\nNewsBTC\n\nIn the Rekt Capital chart, SOL is currently breaking out above the zone. However, if history repeats itself and the zone once again acts as strong resistance, the SOL price could suffer a severe pullback. Using the green arrow in the chart, Rekt Capital paints a scenario in which SOL initially falls back towards $30 before the price rises again towards $42."
    }
]