[
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPM1V6RVJZem43OW9TTklGeGRhMUFfYlgxUVE1aVdsR2FSd2JJZ2lLVFdaVlBxSGJya2Y5dnV2Um1pQVJOX1M0WUoyRzhWNWRmdVN2TkxLeEVGU2V6UUxmbVlCN2FrWkJzMDRBTkNqT0FzRElxbkxDMFVyeW5rTWRYVlBhT1dmdS1J0gGOAUFVX3lxTFA0cUVNZTVEaVFTejhyMmZla2w2MGJnQnFRNTNWWElKY1J4UmwwbEZXejlab1pwWV85LWp2V0hxLXpzR0U3dkFKcHpMMTFTeVROZU42c3ZXZXZMc3Z4eUl5Nl9ucVlXTnJXeHk2eEp3NzI5TzhMLUYtLVRqLVJPeFJJZmtIcEpfRXhmQUFCOXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Dec 2023 08:00:00 GMT",
        "title": "'Narrative Shift Away From ETH': Investor Justin Bons on Non-EVM L1s - U.Today",
        "content": "Advertisement\n\nIn Q4, 2023, the cryptocurrency segment is going through \"awesome\" processes as mainstream narratives are moving toward truly scalable L1s, a seasoned cryptocurrency expert says. Did EVM L2s fail to deliver on their promises?\n\nSOL, AVAX, NEAR, EGLD: Justin Bons indicates \"narrative shift\" and L2s' failure\n\nThe blockchain sphere is witnessing a major \"narrative shift\" nowadays. Instead of Ethereum (ETH), all eyes are on its L1 competitors, Cyber Capital CIO Justin Bons says in a recent X post.\n\nScalable first-layer blockchains like Solana (SOL), Avalanche (AVAX), Near Protocol (NEAR) and MultiverseX (formerly Elrond, EGLD) are beneficiaries of this shift.\n\nAdvertisement\n\nThis process is validating Ethereum's (ETH) strategy to bet on Layer 2 solutions (rollups) as a core scaling instrument, Bons concluded.\n\nAs a result of this shift, the \"blockchain trilemma\" may have finally been solved. As covered by U.Today previously, in his earliest statements, Bons appreciated the scaling opportunities of Tezos (XTZ) and The Open Network (TON).\n\nThe Cyber Capital CIO is an adamant critic of the current state of Bitcoin (BTC), Ethereum (ETH) and its L2s as well as XRP.\n\nNew Solana (SOL) summer catalyzed by retro airdrops?\n\nAccording to his views, these assets lack security and decentralization. Also, he stressed that a blockchain should make its L1 scalable instead of relying on rollups and sidechains.\n\nSolana (SOL) as a dangerous Ethereum (ETH) competitor is yet again in the spotlight for analysts in December 2023. As the blockchain exceeded Ethereum (ETH) in DEX trading and NFT sales, experts recall its 2021 rally to three-digit zones.\n\nAt the same time, the interest in Solana (SOL) is triggered by the activity of retroactive airdrop farmers. Inspired by Jito Network's (JTO) generous rewards, they are completing tasks to be eligible for Jupiter, Orca and other potential airdrop campaigns expected in Q1, 2024."
    }
]