[
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxPWjhuNHBlczYzSGhKdnZDVmQyS21IcnZNSEU1cDJ1N2xaRnpIVnFEXzFzZ0FDOEM3SGFVaHU4MjNFN2ctNzBlaXZQX2xrdUdUMXFoN0t6ejB6MFJCOTJCV0d2VHlaQl9yaS1kN253OXZldEZ5a1FUUWtybzkxRHR0bVN6Vzk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Dec 2023 08:00:00 GMT",
        "title": "Solana’s DeFi DEX Volume Surpasses Ethereum’s For the First Time - Yahoo Finance",
        "content": "Solana’s DeFi DEX Volume Surpasses Ethereum’s For the First Time\n\nSolana (SOL) has achieved a significant milestone by surpassing Ethereum (ETH) in terms of decentralized exchange (DEX) trading volume over the past week. According to DefiLlama, DEX volume on Solana soared to $10.1 billion over the last seven days, while Ethereum recorded $8.8 billion in volume during the same period.\n\nSolana's recent surge in DEX activity can be attributed to its lower gas fees compared to Ethereum, and rise of memecoin trading. The chain’s leading memecoin, BONK, dominated headlines after its meteoric rise to over a billion-dollar market capitalization, following Binance and Coinbase listings. Another Solana memecoin, Dogwifhat (WIF), has also captured attention, skyrocketing from obscurity to reach $322 million in market cap. BONK and WIF are among the top traded tokens on Solana DEXs over the past week, excluding stablecoins.\n\nThe success of these memecoins and heightened activity, coupled with major airdrops from protocols like Jito (JTO), have contributed to SOL's impressive rally, with the token flipping XRP and reaching a new 2023 high of $99, according to CoinMarketCap data.\n\nHowever, despite recent gains, SOL's market cap currently sits just above $41 billion, while Ethereum remains has a market cap of $268 billion, more than seven times larger than Solana.\n\nLet us know what you loved about this article, what could be improved, or share any other feedback by filling out this short form."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxPWjhuNHBlczYzSGhKdnZDVmQyS21IcnZNSEU1cDJ1N2xaRnpIVnFEXzFzZ0FDOEM3SGFVaHU4MjNFN2ctNzBlaXZQX2xrdUdUMXFoN0t6ejB6MFJCOTJCV0d2VHlaQl9yaS1kN253OXZldEZ5a1FUUWtybzkxRHR0bVN6Vzk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Dec 2023 08:00:00 GMT",
        "title": "Solana’s DeFi DEX Volume Surpasses Ethereum’s For the First Time - Yahoo Finance",
        "content": "Solana’s DeFi DEX Volume Surpasses Ethereum’s For the First Time\n\nSolana (SOL) has achieved a significant milestone by surpassing Ethereum (ETH) in terms of decentralized exchange (DEX) trading volume over the past week. According to DefiLlama, DEX volume on Solana soared to $10.1 billion over the last seven days, while Ethereum recorded $8.8 billion in volume during the same period.\n\nSolana's recent surge in DEX activity can be attributed to its lower gas fees compared to Ethereum, and rise of memecoin trading. The chain’s leading memecoin, BONK, dominated headlines after its meteoric rise to over a billion-dollar market capitalization, following Binance and Coinbase listings. Another Solana memecoin, Dogwifhat (WIF), has also captured attention, skyrocketing from obscurity to reach $322 million in market cap. BONK and WIF are among the top traded tokens on Solana DEXs over the past week, excluding stablecoins.\n\nThe success of these memecoins and heightened activity, coupled with major airdrops from protocols like Jito (JTO), have contributed to SOL's impressive rally, with the token flipping XRP and reaching a new 2023 high of $99, according to CoinMarketCap data.\n\nHowever, despite recent gains, SOL's market cap currently sits just above $41 billion, while Ethereum remains has a market cap of $268 billion, more than seven times larger than Solana.\n\nLet us know what you loved about this article, what could be improved, or share any other feedback by filling out this short form."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxObjFVNF82dEwtUTFOdXJDTjJUTkt0ekFtNFh0TGg3SHpaNllURWw2bU1Ecm01NFk0QlRJeDljdm9hRFNtX0FsUDR5RTJHdDF4NUp2UV9HX3VweVZqYTdPZmpzamRpVlBjZmNDMm5XZlVuczNYYy1kR0kteExnbGozcXRNYmF6X3JXZWdlQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Dec 2023 08:00:00 GMT",
        "title": "Solana Surges to $84, Flips Ethereum in Weekly DEX Volume - Unchained",
        "content": "Solana’s native token rallied 13% over the last 24 hours, while the blockchain overtook Ethereum in seven-day DEX trading volume.\n\nIt may not be altcoin season just yet, but one of them has already doubled Bitcoin’s percentage gains over the last year.\n\nSolana’s native token SOL is up 580% over a one-year period, gaining 13% in the last 24 hours to trade at $84 at the time of writing.\n\nDaily trading volume for the token was up a whopping 108% to $3.9 billion, making it the third most traded crypto asset outside of Bitcoin, Ethereum and stablecoins like USDT and USDC.\n\nRead more: Solana Mobile Is Making a Second Crypto Smartphone\n\nActivity on the blockchain has also picked up significantly over the last week, with data from DeFiLlama showing that decentralized exchange (DEX) volume on Solana surpassed Ethereum over the last seven days.\n\n🚨BREAKING: Solana Overtakes Ethereum in Weekly DEX Trading Volume for the First Time Ever Solana Now Becomes No. 1 Chain for Both NFT and DEX Daily and Weekly Volume pic.twitter.com/w6dSuEtcUu — SolanaFloor (@SolanaFloor) December 21, 2023\n\n\n\nEarlier this week, Unchained reported that Solana had taken the lead in daily stablecoin transfer volume, which has grown 600% to $16.6 billion since the start of December.\n\nInstitutional data platform Artemis attributed the uptick in the blockchain’s usage to growth of memecoins like BONK and WIF, which created more room for retail activity evidenced by the high number of daily active addresses on the network since the summer of 2022.\n\nThe dog-themed memecoin BONK now has a market capitalization of $1.2 billion, and those cashing out of their holdings will typically convert their coins back into SOL creating a fair amount of buying pressure.\n\nRead more: Paxos Bringing Stablecoin Issuance on Solana, Diversifying Beyond Ethereum\n\nIt is worth noting that the bankruptcy estate in charge of crypto exchange FTX has been approved to sell its $3.4 billion in crypto holdings, of which $1.16 billion is in SOL.\n\nEarlier this month, a wallet associated with FTX unstaked $90 million worth of SOL and sent it to Coinbase, presumably with the intention to sell, meaning that the token has been able to withstand a large amount of selling pressure coming from the exchange’s liquidation plans."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE5IN2FHeXVLaWJoN0FLYWRpM3Q5eFdGemxtNkxmdzZMVVRWZFFVLVpRS1F1eEdZNHRzUXdVUUhlZEQxbDhoQVdwcC04VlBTMmFISG9SdUtablFRcWFhWjQyU3I4SDZIUkNWQm85ZHFBVkRHQUg2WnJaNlJ3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Dec 2023 08:00:00 GMT",
        "title": "Buterin, Coinbase and more to fund Ethereum decentralization grants - Blockworks",
        "content": "The PBS Foundation is opening applications for an initial $1 million in grants for research and development on Ethereum proposer-builder separation.\n\nThe non-profit’s pilot phase drew support from Coinbase, Consensys, Fenbushi Capital, Flashbots, Paradigm, the Uniswap Foundation and Vitalik Buterin.\n\nGrants will be disbursed by a council. The council includes representatives from Blocknative, Consensys, the Ethereum Foundation and Flashbots, among others. The foundation’s grant lead is Eugene Leventhal from the research group Metagov.\n\nRead more: For Ethereum rollups, dealing with data remains a bottleneck\n\nFirst proposed by Ethereum founder Vitalik Buterin, proposer-builder separation (PBS) is the concept of separating proposers — which submit transaction bundles to validators on a blockchain — and builders, which organize the transactions in a specific order.\n\nPBS represents an attempt at decentralization, as the combination of proposing and building gives well-heeled centralized mining pools a competitive advantage.\n\nPBS first went into effect after Ethereum’s Merge to proof-of-stake. Now, the PBS Foundation aims to promote research and infrastructure to address some of the challenges the concept currently faces.\n\nNotably, MEV-boost relays have become centralized since the Merge. Relayers operate between block builders and validators on maximal extractable value (MEV) boosted transactions, selecting blocks with the highest possible fees. Roughly 90% of transactions in the last 500 epochs, or roughly two days, made use of MEV-boost. Of MEV-boost transactions in the past 24 hours, roughly 97% have been handled by five relayers, according to relayscan.\n\nBlocknative, once among those top relayers, discontinued its service in September, citing economic viability concerns. Relayers do not currently collect fees. Uri Klarman, CEO of bloXroute, which runs a large relayer, has advocated fee structures outside of public goods funding to incentivize more relayers to join the fray.\n\nA spokesperson for the PBS Foundation said the grant funding could be used to fund relayers, with a particular emphasis on those who introduce novel designs for relaying.\n\nThe funding will also be focused on community and educational materials, data transparency on Ethereum’s mempool and blocks, and research on how PBS can be improved — or even enshrined — on both the primary network and on layer-2 networks.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxQc29lV3g1c0lVNkxQcWJjTHQ1T1hrYnJySzV4UERqZGxPbnphcEh3bDd4MFJxdi1OZlV6WnUtV1dGMW9EZDd2LVlhTkdwWlNDNTJ4UWVpTUp5cG95ZWR6LTdjVmpDclNoemducTZBYjEzT3lmMnlqSWxxM0FVdll6cTJubw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Dec 2023 08:00:00 GMT",
        "title": "Ethereum’s Dencun upgrade set for 2024 testnet launch - CryptoSlate",
        "content": "Ethereum developers have tentatively decided on Jan. 17, 2024, for the upcoming “Dencun” upgrade’s first testnet deployment during the latest bi-weekly dev meeting on Dec. 21.\n\nOriginally slated for the last quarter of 2023, the ‘Dencun upgrade was pushed to 2024 due to the engineering complexities involved.\n\nTim Beiko, the protocol support lead at the Ethereum Foundation, noted that the date is not set in stone and could change if major issues arise. The team aims to release a blog post detailing the fork during the week of Jan. 8, 2024 — giving stakeholders a week to prepare for the update.\n\nDencun upgrade timeline\n\nThe meeting set out a draft timeline for the testing phase of the Dencun upgrade.\n\nFollowing the Goerli testnet on Jan. 17, 2024, developers plan to run tests on other networks — Sepolia on Jan. 31, 2024, and Holesky on Feb. 7, 2024.\n\nThe developers aim to deploy the changes on the mainnet by the end of February 2024 if everything goes smoothly. However, these dates are subject to change based on the results of the testnet forks.\n\nDencun will be Ethereum’s first major upgrade since ‘Shapella’ earlier this year, which was a significant milestone in itself, enabling staked ether (ETH) withdrawals from the blockchain.\n\nSimilarly, a major aspect of the Dencun upgrade is the implementation of “proto-danksharding.” This new process is designed to enhance Ethereum’s capacity for data storage, a move that is expected to reduce fees for Layer 2 rollups and scale the blockchain by increasing space for “blobs” of data.\n\nBy improving data handling capabilities and efficiency, it aims to enhance the performance of rollups and, consequently, the overall throughput and affordability of the Ethereum network.\n\n“Layer 3 app-chains”\n\nIn addition to the Dencun upgrade, the meeting also highlighted a collaboration between Avail and StarkWare. The partnership aims to augment data availability for appchains within the Starknet Layer 2 network. Leveraging Madara, a customizable sequencer, this initiative seeks to develop app-chains that will function as Layer 3 solutions within the Starknet ecosystem.\n\nThese Layer 3 app-chains, powered by the combined efforts of Avail and StarkWare, aim to revolutionize data availability modes, including validium and sovereign rollups. This, in turn, will help optimize transaction processing efficiency and finality, which is crucial for blockchain scalability.\n\nThe developers also touched upon Ethereum’s role in the broader context of decentralized finance (DeFi) and blockchain technology. They reiterated their commitment to maintaining Ethereum’s position as a leader in the space, emphasizing the need for continuous innovation and adaptation to meet the ever-evolving demands of the market.\n\nThe meeting also provided a platform for developers to discuss the challenges and opportunities that lie ahead for Ethereum. From addressing network congestion issues to enhancing user experience, the developers explored a range of topics that are critical to Ethereum’s roadmap and its users’ needs.\n\nMentioned in this article"
    }
]