[
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxOY2ktdjBFRldGSW85aFFkSmFSVWVhM29zT1ZlZHdxLVpzZVUzZkN2R2puY2hpbGI1Q2JTMUVGM1JfVDJac2RQQm1MNnJkYlY5dDdYTnIzQU14UTR3c1NydWZSSE9ucDNSY0Fsem9Yc0poaWwxOU1tZl8xQlRWd1paYw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "OKX Unveils New Ethereum L2 Network Powered by Polygon - Crypto Briefing",
        "content": "OKX leverages its 50 million user base to fuel X1 growth.\n\nShare this article\n\nCrypto exchange OKX and blockchain developer Polygon Labs have announced a collaboration to launch a new Ethereum layer 2 network called X1.\n\nThe X1 testnet launched today uses zero-knowledge (ZK) proofs to allow quick and low-cost transactions on a secure network that is compatible with Ethereum.\n\n“X1 will be a key pillar of our efforts to educate and bring our users on-chain and into the world of Web3,” said Jason Lau, OKX’s Chief Innovation Officer. “By collaborating with Polygon Labs, we look to bring more builders, more use cases, and ultimately the mass adoption of Web3.”\n\nOKX’s token OKB will be used to pay gas fees on the X1 network. OKB token is the native utility token of the OKX exchange, used to pay for trading fees on OKX, to participate in OKX’s Jumpstart token launch platform, and to earn rewards on OKX Earn.\n\nThe goal of X1 is to attract developers to build decentralized applications that can leverage OKX’s user base which exceeds 50 million worldwide. As part of the partnership, OKX will contribute engineering resources to enhance Polygon’s Chain Development Kit (CDK), a framework that enables developers to build custom ZK-powered layer 2 blockchains on Ethereum\n\nThe launch of X1 comes as competition heats up among crypto exchanges offering proprietary layer 2 solutions. Coinbase recently launched its Base layer 2 network using Optimism’s technology, while Kraken is exploring building a new scaling solution in collaboration with Polygon.\n\nOKB has remained relatively flat over the last 24 hours, down just 0.3% according to CoinGecko."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE16MTBGU0ROOUV4c0V3ZTlsal94dWRvQTdIQm04TWVFOVZ3SkNKZ0t6VFVLa3IySWcxOU5ic3MzVG90VmN2Z0dtOHk4U2YycmVtcEljOW9obXdxQW5XYnhReVE5ZUxPQnd3eTdaSkFnbk9pQdIBekFVX3lxTE5sRFVxYnV4ZFNtYUdLNTBVZlZ6YjV0TkhRX29TVnNTVkE4RmhRU3c5UE1LRWxKTGdYV1BSMDZCRWJFNTMtYlVUM3JtMEZNek51dmdaSi0wUjRFMlRRZmpTRWtldXJKRVY3V0xLenJNN3NuTzVycUtNcTBB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin and Ethereum Lag While DeFi Tokens dYdX and Maker See Gains - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nA number of decentralized finance (DeFi) assets surged on Tuesday while major cryptocurrencies—including Bitcoin and Ethereum—experienced losses.\n\nDecentralized lender dYdX, which runs on Ethereum, was at the time of writing trading for $3.34, having gained nearly 7% in 24 hours. Over the week, the protocol's native token, ETHDYDX, had boomed by 42%, CoinGecko data showed.\n\nElsewhere, Maker (MKR) also experienced a surge: at the time of writing, it was only up over 1%, trading for $1,366, but had shot up earlier on Tuesday morning Eastern Time to a high of $1,423.\n\nAnd decentralized exchange PancakeSwap (CAKE) was also up nearly 3%, coming in at a price of $2.24.\n\nAD\n\nAD\n\nDeFi refers to the projects in the cryptocurrency space which want to replace traditional financial services, such as borrowing, lending or banking.\n\nSuch projects are new, experimental and prone to hacks—which means respective coins and tokens are volatile.\n\nBitcoin, the largest digital asset by market cap, had lost more than 2% of its value by the time this story was published, and was trading hands for $36,049.\n\nAnd Ethereum, which last week pushed past $2,000, was down nearly 3%. It is priced at $2,041 per coin.\n\nAD\n\nAD\n\nLast week ETH saw major gains on news that BlackRock Advisors, a division of the Wall Street titan, was preparing to file an application for an Ethereum ETF. The iShares Ethereum Trust application is BlackRock's first official application for an Ethereum ETF.\n\nWithin 24 hours after the filing of the iShares Ethereum Trust application, the price of Ethereum crossed the $2,000 mark, a level it had not seen since July 2023. The price of Ethereum experienced a substantial increase, with gains reported at over 8%. Moreover, the trading volume surged by 259%, indicating a significant rise in market activity.\n\nConcurrently, the market capitalization of Ethereum increased by a little more than 10%—reflecting a marked growth in investor confidence and market valuation following the news of the filing.\n\nElsewhere, major coins and tokens were having a rough morning. Solana (SOL), which last week blew up in value, was trading little over $56 per coin, up less than 1%. Even when ETF optimism cooled for Bitcoin and Ethereum, Solana has held onto its gains.\n\nSOL has surged nearly 160% over 30 days. For a few days, it briefly overtook the market capitalization of major stablecoin USDC. But it has since dropped below it again. As of this writing, SOL has a market cap of $23.8 billion and USDC has a market cap of $23.9 billion.\n\nEdited by Stacy Elliott."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPaXowekpvdEV3R1l3UXNVR2tNamt0TElhdDJuOUF3RjlxU0ZtQ0xxTzVyYm02eUJvcHJKeGxSQThNRU14X2I4cmVuaWd3STNqNjhzVnRSckRnbjZGMk9zOFJsZHFEWEU5UFI0dmZIaVpudm14M25manFfYm5tdU9IUGp1anl2bEF4UkNvNkVB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Ethereum and Solana lead DeFi surge as TVL and DEX activity soar - CryptoSlate",
        "content": "The DeFi sector has experienced a significant increase in both activity and token prices, primarily driven by Bitcoin’s October rally. Central to understanding this landscape is the concept of Total Value Locked (TVL) and decentralized exchange (DEX) volumes, two critical metrics that offer insights into the health and trajectory of DeFi protocols.\n\nTVL, the aggregate value of assets deposited in DeFi protocols, serves as a barometer for sector health and investor sentiment. CryptoSlate analysis found an interesting growth pattern across various chains. Ethereum, the frontrunner with $25.336 billion in TVL, has seen a 31.14% increase over the past month, cementing its dominant position in the DeFi space. Solana, though lower in overall TVL, showed the highest growth rate at 89.31%. Notably, all chains recorded positive growth over the month, indicating a robust expansion across the sector.\n\nThe number of active users on these chains offers additional insights. Despite its lower TVL, Tron boasts a significantly larger active user base of 1.69 million, which could result from a more retail-oriented user landscape. Conversely, Ethereum’s lower active user count than its TVL might indicate a higher engagement of institutional or sophisticated, high-net-worth investors.\n\nThe market cap to TVL ratio is another critical metric, shedding light on the market’s perception of a chain’s value. Ethereum’s ratio of 9.72 suggests a mature market. In contrast, Solana’s higher ratio of 43.49 indicates either potential growth opportunities or an undervalued ecosystem, warranting closer investor scrutiny.\n\nName Protocols Active Users 1D Change 7D Change 1M Change TVL Stablecoins 24h Volume 24h Fees Market Cap to TVL ratio 1.Ethereum 946 304,493 -0.12% +6.50% +31.14% $25.473b $64.929b $1.718b $7.27m 9.63 2.Tron 26 1.69m -1.34% +5.04% +25.14% $8.291b $47.455b $11.33m $1.66m 1.13 3. BSC 663 945,060 +0.22% +1.70% +12.58% $2.996b $4.992b $429.32m $348,294 12.62 4.Arbitrum 481 133,870 -0.38% +10.90% +25.21% $2.095b $1.844b $925.94m 0.66 5.Polygon 488 +1.28% +8.10% +21.93% $852.6m $1.17b $369m $87,858 10.06 6.Optimism 197 91,508 -0.12% +11.94% +25.87% $739.39m $576.85m $109.27m 2.11 7.Avalanche 344 33,880 -1.04% +12.63% +28.18% $615.82m $1.07b $140.2m $36,244 9.73 8.Solana 115 -1.55% +23.58% +89.31% $530.8m $1.513b $425.62m $108,773 42.62\n\nTable showing the TVL, active users, volume, and market cap to TVL ratio for the 8 largest L1 chains on Nov. 14, 2023 (Source: DeFi Llama)\n\nDEX volumes provide a lens into the trading activity within these ecosystems. Ethereum leads with a 24-hour volume of $1.718 billion, accounting for a substantial portion of the total market. The rapid growth in DEX volumes on platforms like Solana and Polygon, with increases of 81.35% and 86.32%, respectively, reflects growing user adoption and confidence.\n\nName Weekly change Volume (24h) Volume (7d) TVL % of total Cumulative volume 1. Ethereum +27.29% $1.718b $10.65b 5.941b 37.12% $1.888t 2. Arbitrum +58.15% $925.94m $4.415b 1.127b 20.00% $138.902b 3. BSC +7.54% $429.32m $2.752b 1.577b 9.27% $757.4b 4. Solana +81.35% $425.62m $2.571b 185.78m 9.19% $54.616b 5. Polygon +86.32% $369m $1.711b 0 7.97% $101.421b Table showing trading volumes and total value locked for decentralized exchanges (DEXs) across the five largest L1 chains on Nov. 14, 2023 (Source: DeFi Llama)\n\nThe observed trends in TVL, active users, and DEX volumes show a market booming with activity. Ethereum continues to lead, both in terms of TVL and DEX volume, signaling strong investor confidence and market dominance.\n\nHowever, the rapid growth of newer platforms like Solana and Polygon suggests a diversifying landscape, with different chains catering to varied user needs and investment profiles. The market cap to TVL ratios further confirms the growth potential of lower market cap chains, with Solana and Polygon positioning themselves for future growth.\n\nMentioned in this article"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMi8gFBVV95cUxPREswRndBVkRSQm9FYU16ZW1TMm4yb0g4am9mTFhZNUVJRlJxTmNnWVQtU2NPUDdDb3Vra2QtOXBDMDQ2Ujl6TXhsV0VSZ0VjOFVCZlpkYlM2bDRLZTJHcW5FRDZZemJsbFR5aW9mWkdBR0JpWkwyWmg1bkVhblh2OUxRMUhnek44RU9YLTNpZnR0Rl9QWjh6MV9ndWR6UXVGT1Q5NDJCTzgyMWtadW9MeHVfVXF2SF8tWXV0emIwUEVBTVBpa3NUaFJ3UzhvdHFDVTZOWHNOd1V4SGxac3lZUUp2anh4aVNwQWlESnNpdjhRd9IB9wFBVV95cUxPbDZ2d09ITy1iamlOZXNZX1VLYXVYcXhZZkJhdW85TzlBQUNWN2FybXpPNEdrdFhqekk2ZFJVV3VhZWo5bU5xTXdIZnk1enZxa1dvU0Mtd0s1QmpPbnFWd29wVGZDQ3NUUHNVb3hFeHBSdDhEUml5cUVkQ3hudFZJLUtVRjR6Q3FwZ0J1T3ZSWlFZcnZYUmNZVFExbTVYMEtKQ2k4c3lwXzVuTGlXb09DeG5kWFdVQjJaTTdtdnI5UHJFRGF6ZzVCaElrMnBWUzd0UDZ2TGFJSWRiVHJJMnhiVkRNVVQzeVlNbDlLNW56NGd4SWNPb3Zr?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: Next 3 days could be interesting for BTC as Nov 17 draws - FXStreet",
        "content": "Bitcoin price could fall 5% to bounce at the 250-day EMA at $34,483 for the next leap north.\n\nEthereum price likely to rise 5% to $2,136 range high if the support provided by the ascending trendline above $2,029 holds.\n\nRipple price filling up a symmetrical triangle makes a 10% drop to $0.5981 likely as XRP erases its weekly gains.\n\nBitcoin (BTC) price along with that of Ethereum (ETH) and Ripple (XRP) are static for the moment. However, following recent comments by James Seyffart, an analyst with Bloomberg Intelligence, the US Securities and Exchanges Commission (SEC) has a narrow window ending November 17 to approve spot BTC exchange-traded funds (ETF). On the back of speculation and investors trying to front-run a possible launch, the next three days could be interesting for the king of cryptocurrency.\n\nAlso Read: Week Ahead: Bitcoin ETF approval this week, yay or nay?\n\nBitcoin price eyes 5% slump unless a spot BTC ETF launches\n\nBitcoin (BTC) price could fall 5%, or not, depending on what the US SEC decides to do in the next three days. Whether it will be a yay or nay in regard to the spot Bitcoin exchange-traded funds (ETFs) will be the determining factor as the detailed eight-day window closes fast.\n\nMeanwhile, a 5% slump seems likely for Bitcoin price amid falling momentum. It comes amid buyer exhaustion after BTC was massively overbought. With the Relative Strength Index (RSI) and the Awesome Oscillator (AO) supporting the downside, BTC could slide to test the support confluence between the 25-day Exponential Moving Average (EMA) and the horizontal line at $34,483 before a possible bounce.\n\nIn a more dire case, the slump could crack past $34,483 to test the 50-day EMA at $32,332. Selling pressure could see Bitcoin price lose critical support at $31,190. A daily candlestick close below this level would invalidate the bullish thesis.\n\nBTC/USDT 1-day chart\n\nOn the flipside, increased buying pressure, which would happen if the SEC approves the launch of a spot BTC ETF, could send Bitcoin price north, clearing the range high at $37,972 to bring the $40,000 psychological level into sight.\n\nAlso Read: Bitcoin rages on, $40,000 may not be a hopium pipe dream for BTC after all\n\nEthereum price must hold above ascending trendline to realize upside potential\n\nEthereum (ETH) price is showing weakness, but the overall trend remains bullish. To realize more gains, the second largest cryptocurrency by market cap must hold above the ascending trendline, which could deliver 5% gains for a test of the $2,136 range high. In a highly bullish case, the gains could stretch to the $2,200 psychological level.\n\nETH/USDT 1-day chart\n\nOn the other hand, increased seller momentum could send Ethereum price below the ascending trendline at $2,029. A break and close below this level could see ETH fall into the supply zone turned bullish breaker. A break and close below its midline at around $1,935 would solidify a continuation south.\n\nAlso Read: Ethereum Price Prediction: Eighteen-months ascending triangle pattern appraises $4,000 target for ETH\n\nRipple price fills up a triangle\n\nRipple (XRP) price has filled up a triangle amid reducing volatility in the XRP market. For the next directional bias, investors should wait for a confirmed breakout of this pattern. Meanwhile, all signs point to a downside move, amid falling momentum, indicated by the RSI and the AO histogram bars flashing red.\n\nIncreased selling pressure could see Ripple price break the lower trendline of the triangle to test the 25-day EMA at $0.6187. If the 25-EMA fails to hold as support, the slump could extend for XRP to tag the $0.5981 support level, 10% below the current price. A break and close below this level would clear the path for the remittance token to spiral further, slipping past the 50-day and 100-day EMAs at $0.5837 and $0.5619, respectively, to fall into the consolidation range between $0.5392 and $0.4735.\n\nXRP/USDT 1-day chart\n\nOn the flipside, a break above the upper trendline could see Ripple price stretch to reclaim the November 13 high of $0.7500. In a highly bullish case, it could break past the Fair Value Gap (FVG) ranging from $0.7519 to $0.7623, restoring balance before tagging the $0.8000 psychological level. Such a move would constitute a 20% climb above current levels.\n\nAlso Read: SEC v. Ripple lawsuit still drags on, Judge Torres sets schedule for 2024"
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxOVkZhRmhtZ2cyYXF6UzY1NkFPZXZIUEFfUHVVMkxseDRibG55OHMwOGlVNHQyZHhZUHVDWGN0TDVVeXQtRGNhNGZMTkZGSTEteUVPM0hvcjlYczJuN2RidUZpY1JVWUZWNVp3RXcxQjRRdXFNNXM5U2NaTnpTdG5zRWtVWDlUQnBKakR1LUgxVkZsUm1NY0Q0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Nov 2023 08:00:00 GMT",
        "title": "Should You Buy Ethereum While It's Still Underperforming the Market? - The Motley Fool",
        "content": "A number of factors are holding back Ethereum's market performance, including the reemergence of Bitcoin.\n\nAt first glance, Ethereum (ETH 1.79%), the world's second-most valuable cryptocurrency, seems to be having a banner year. Ethereum is up 57% and appears to be gaining momentum heading into the final weeks of the year. Over the past 30 days, Ethereum is up more than 20%.\n\nBut context matters, and right now, Ethereum is badly underperforming the crypto market. Bitcoin (BTC 2.86%), for example, is up a spectacular 112% this year. And other top cryptocurrencies are similarly posting triple-digit gains in 2023. All of this has complicated the decision-making calculus around Ethereum, which now looks like a market laggard. If you are thinking about buying Ethereum, this is what you need to know.\n\nWhy is Ethereum underperforming?\n\nWhat's particularly puzzling about Ethereum this year is that it's just so hard to pinpoint exactly why it's underperforming Bitcoin and other top cryptos. Heading into 2023, Ethereum seemed to be riding a wave of momentum after pulling off The Merge, which was widely hailed as one of the greatest technical achievements ever in the blockchain world. As a result of The Merge, Ethereum changed its overall blockchain infrastructure, all with the goal of reducing transaction fees, boosting transaction processing speeds, and improving overall efficiency.\n\nBut a number of issues have popped up throughout this year. For one, overall activity on the Ethereum blockchain seems to be down and that's not a good sign for future growth. Case in point: Bitcoin recently passed Ethereum for the first time ever in terms of 24-hour non-fungible token (NFT) sales volume, an area Ethereum has always dominated. And Total Value Locked (TVL), which measures activity on the blockchain, also recently reached a 12-month low, a potential sign of Ethereum's weakening position in decentralized finance. These might just be short-term blips on the radar, but they are still concerning.\n\nThere have been regulatory concerns, too, such as those related to staking activity on Ethereum's brand-new proof-of-stake blockchain. The primary concern is that the SEC's willingness to go after major cryptocurrency exchanges for their staking activity, as we saw earlier this year, will eventually erode the attractiveness of Ethereum as an investment option.\n\nMoreover, The Merge is not having the sort of breakthrough impact it was supposed to have, as measured by transaction fees and transaction processing speeds. For example, transaction fees for relatively straightforward activities, such as buying a new NFT, can sometimes run into the hundreds of dollars. And the main Ethereum blockchain can still only handle 20 to 30 transactions per second, a far cry from the 1 million transactions per second promised years ago.\n\nEthereum vs. Bitcoin\n\nPerhaps the best explanation, though, might be that investors are almost single-mindedly focused on Bitcoin at the moment. Just about everyone seems to be looking ahead to the imminent launch of the first-ever spot Bitcoin exchange-traded fund (ETF), and what that could mean for the broader crypto market. Ethereum almost feels like an afterthought right now.\n\nPerhaps as a result, the longtime strong correlation between Ethereum and Bitcoin appears to be weakening. Until mid-March, the correlation between Bitcoin and Ethereum was nearly 0.95. That's almost a perfect 1-to-1 match in terms of performance. But now the 90-day correlation between the two has dipped to the 0.8 level.\n\nEthereum vs. other altcoins\n\nIn addition, many other cryptos appear to be passing Ethereum right now. That's of particular concern in the case of Solana (SOL 4.65%), which is arguably Ethereum's greatest rival right now in the Layer-1 blockchain space. Solana is up a stunning 325% year to date. While Solana has its own fair share of regulatory and technical issues, investors have largely been willing to shrug them off due to Solana's perceived growth prospects. Solana's new \"crypto phone\" is just one of the most exciting projects.\n\nThese shifting investor perceptions of Ethereum are having an impact on institutional money flows. Quite simply, large institutional investors appear to be taking their money out of Ethereum and moving it into Solana. In 28 of 32 weeks this year, Solana has seen net positive inflows, according to CoinShares, which tracks inflows and outflows into different cryptocurrencies. In contrast, Ethereum has seen outflows. And that has led to CoinShares calling Solana \"the altcoin of choice\" for institutional investors right now.\n\nCan Ethereum bounce back?\n\nAt the end of the day, the decision whether or not to invest in Ethereum comes down to your view of its long-term growth prospects. Ethereum is still the clear leader in just about every niche or sector of the blockchain world and it's one of the few cryptos that seems to have the implicit support of federal regulators. Notably, SEC Chair Gary Gensler has always stopped short of calling Ethereum a \"security.\" And it's not like analysts have completely given up on Ethereum. Standard Chartered Bank, for example, just put out an aggressive $8,000 price target for Ethereum.\n\nGoing forward, I'm keeping a close eye on how Ethereum fends off the threat from rival Solana. This one factor could end up having the greatest impact on Ethereum's long-term growth prospects. If Ethereum is unable to keep up with Solana and other Layer-1 blockchains, that could have a huge impact on my decision of whether or not to invest in Ethereum going forward."
    }
]