[
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMi7gFBVV95cUxNTnBKUXE0RnVSekNoTUs4VWVac0F4MDd1UTNDN0s1elRyR1dYaFJVMUZlNEZEUkxtVGwxaXNmbG5uSC1HdDJJLXEzMm9JaG0zSjI5Mkl6ZHYxRDhmVkRQVER6SUJIM2NFMXRlREE3YkwyVUpjOFZ6dlRTZTUwQkpSZ3hwTV9GWGt6Z0hFRnROMzZOZ0dEYl92dTlZLTdVWmZjVlEyRlM5TXpGblB3NW11Qm1DcGpqYXQ5cnlsV3g1c1FkN2FLT0ZFRkdPSEhaQlE5eUE1TXFKeHZhdDRHMFV0b3VGWXBMQVh2YUFTai1n0gHzAUFVX3lxTFBpeTRKQncteGxBSlZSc2dmYVdDM1V6WkY0MFowRTFtM0lYSExkX2c0YUgxNG83UnplM1BodDBOVTJkUVdpdm5wODFvdDdLS01CN2FFd2lGYlNFMldqaEZvTFRtYWd2ZFk2ZjVPMUE0dnZMTmp4bjNBRFlDcTJjeHRsckc2SERpU0JoR0ExZ2xIVVpRa1RzMjRTUk56ZGlEbGw1Rm93c29TNmF3VEVlMlVkbzktanRVVFQ5bUltTExwWkFObWZjLUpOYV90ZnFEQVpQVWhKOE1Oc01yVk45OHhwYWthbUR2UWxubElGUGwxejVVRQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Charles Hoskinson and XRP community in loggerheads again, debate on Ethereum’s free pass resurfaces - FXStreet",
        "content": "Charles Hoskinson has addressed the rumors of Joseph Lubin of ConsenSys bribing the SEC to go after XRP.\n\nHoskinson finds himself in a similar situation as Brad Garlinghouse, as the SEC considers ADA an “investment contract” in its lawsuit.\n\nThe Cardano founder has asked the XRP community to present evidence of the bribery allegations and dispels the rumors.\n\nCharles Hoskinson, the founder of Cardano, engaged in a debate with the XRP community over the rumors of ConsenSys founder, Joseph Lubin, bribing the US financial regulator. The rumors seem unfounded and the XRP community has failed to present evidence supporting the claims.\n\nAlso read: LUNC ranks among trending tokens alongside Dollar pegged stablecoin USTC, eyes recovery\n\nCharles Hoskinson addresses rumors surrounding Ripple lawsuit\n\nCharles Hoskinson, the founder of Cardano is one of the co-founders of Ethereum. Hoskinson has been embroiled in a debate with the XRP community over alleged rumors of ConsenSys founder Joseph Lubin bribing the US Securities and Exchange Commission (SEC) to give Ethereum a “free pass” and go after Ripple. Here free pass meant Ethereum was allowed to conduct business as usual while Ripple was hit by a lawsuit.\n\nIt is important to note that Hoskinson currently finds himself in a similar situation to Brad Garlinghouse, the CEO of Ripple, in 2020. The US SEC slammed Ripple with a lawsuit, alleging the unregistered sale of securities, here securities meaning XRP. The SEC has listed Cardano as an investment contract in its lawsuit against Kraken, a cryptocurrency exchange. It is therefore clear that the regulator considered Cardano an investment contract.\n\nHoskinson commented on the rumors stating that the XRP community needs to present evidence to back its claims, or else he finds it a “grand conspiracy.”\n\nFor the argument that Joe bribed the SEC to go after XRP that is the conclusion. That is the entire point of calling it a grand conspiracy. The free pass has nothing to do with the case against Ripple. They are unrelated events. Two years now and you haven't provided any evidence… — Charles Hoskinson (@IOHK_Charles) November 30, 2023\n\nJoseph Lubin is involved here as ConsenSys is software production studio that offers clients enterprise Ethereum solutions. The tight relationship between ConsenSys and Ethereum gave rise to the rumors, however, no evidence of bribery has been presented so far."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMi2gFBVV95cUxQeE9pWWFQS0RHZ01tV3hXa3BONU9yMENfR2h5alg1QXhaT2Q3LVpBdGp3dFNEWFFhVGVObnNYOTZlZS1vMEpEX3ptcENCZm9qdHp1QVk3ZEVtY0VzczdxQUp6bW0wdld6cHRaMDdRb1VNSEZjd0U3S0otWkhMNHZ6V1h3cWkzUjR3b3dqT3pFajNFZUlsMEJXVXBxd0NrWkRycW5zeE1IVmdXbnJrTHhoY0lKcTZlRVJ1SFM3YTNvWkVMVTlMbnJYeFdTY2k1MXd2OWFRR2FWaDQ0Zw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Will XRP Make You Rich? Here’s What XRP Price Looked Like 5 Years Ago When ETH was $102, and Cardano $0.0328 - The Crypto Basic",
        "content": "Recently, XRP community members looked back into history to compare XRP’s price through their years of holding on to the digital asset with respect to the performance of other competing crypto projects.\n\nPer statistics from authoritative sources, XRP appears to be the worst-performing cryptocurrency when compared to others ranking in the top ten, like Bitcoin (BTC), Ethereum (ETH), and Cardano (ADA).\n\nXRP Price Five Years Ago\n\nToday, five years ago, data from prominent market tracker CoinMarketCap shows XRP traded at a low of $0.3625 and a high of $0.381. At that time, it had a market cap of $14.61 billion, with a 24-hour trading volume of around $512 million.\n\n- Advertisement -\n\nThroughout November 2018, the highest point XRP reached was $0.5605, while its lowest was $0.325, per CoinMarketCap statistics.\n\nXRP’s lowest value five years ago, when compared to its price of $0.6 today, suggests the token has again only 86.45% all the way from 2018 to 2023. On the high side, with $0.5605, XRP has seen only 8.12% in five years.\n\nBitcoin Price Five Years Ago\n\nMeanwhile, on November 30, 2018, BTC traded at a low of $3,942.82 with a valuation of $69.9 billion and a trading volume exceeding $6 billion. The firstborn crypto’s lowest value for November 2018 was $3,585.06, which translates to a 957% gain when factored against today’s price of $37,902.\n\nEmphatically, Bitcoin’s value five years ago compared to today implies BTC investors have reaped more than ten times more profit than XRP investors.\n\nETH and Cardano Price\n\nSimilarly, Ethereum exchanged hands at a low of $111.74 today five years ago, with a market cap exceeding $11,7 billion. In the same month, ETH bottomed at $102.45 and has grown 1887.71% since then to $2,036 today.\n\n- Advertisement -\n\nIn other words, investors who bought ETH’s dip in November 2018 have seen 21 times more profit than those who bought XRP’s dip the same month. Likewise, Cardano sold at a discount of $0.0328 in November 2018. However, ADA’s value has risen 1,053.05% since then to $.378.\n\nCrypto Community Reacts\n\nA crypto enthusiast with X username “@Ianbins” put XRP’s five-year value alongside rivalry tokens with a satirical comment.\n\n“Buy XRP, they said; it will make you rich, they said,” he mocked, given that XRP’s current value is not much different from November 2018.\n\nMeanwhile, Bill Morgan, a lawyer known for his pro-XRP stance, remarked:\n\n“Wow. I never realized XRP’s price performance was this poor compared to other major coins and not only compared to Bitcoin and Ethereum.”\n\nWow. I never realised XRP’s price performance was this poor compared to other major coins and not only compared to Bitcoin and Ethereum. It has of course been under the cloud of a SEC investigation and then lawsuit that entire period but you would think it would have caught up… https://t.co/Eyflqp0JZq — bill morgan (@Belisarius2020) November 29, 2023\n\nNotably, the XRP Army has argued the multi-year regulatory battle against XRP had hindered its performance. Following the court ruling in July, XRP reached $0.93 but has since lost those gains.\n\nNonetheless, it remains to be seen how XRP will perform in the coming years with the U.S. regulatory fight out of the way."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxOcTFQVDQ4OFdKNU0ydmZvTmJ3WTJGLXBCNS1RejV6dmRyOUJUMmhNLVNsS3VHYUs5NENGeGtGVE1kYUZBbDh0YWRMNlZEWVZFZURpMkwwNlhnWF9ieHRNQXRoOHJpXzQ1dEU4NG1ZVlJPVHdIMU5KT1lqMlVkSnBuclQ1RDQ5dkJ6Y01ab3FVUmFQUdIBlwFBVV95cUxPR0tJdW9vX0dzbkpnN1g4a2JKZTJfWm1iUTFPdGJzTldfcDF5Q0w3NmJNQ0FyUVlvb2oxZjhjZ2h4ZUxwMUc5YXptMG4yMzE0LTRBMk0tNkZFRld2NEtzM01lTzVoR1p4ZzhMUGw1c2ozQ1VKV21ET2lmd19nZ3E1Z2h5Szg0bmtWLTFVOWtXWG43ZWYzdkpZ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Price Prediction: Is ETH Ready For New ATH In 2024? - CoinGape",
        "content": "Ethereum Price Prediction: Ethereum (ETH) price stayed relatively unchanged on Thursday despite the trading volume dropping by 20% to $8.5 billion. Intriguingly, the altcoin’s market cap is holding up above $245 billion, according to market data by CoinMarketCap.\n\nThis has been a week of consolidation with Ethereum price sitting above the $2,000 level. Recovery has become an uphill battle leaving Ether to wobble between support at $2,020 and a short-term resistance at $2,070.\n\nadvertisement\n\nEthereum Price Prediction: How Far Is Ethereum From Breakout?\n\nThe Moving Average Convergence Divergence (MACD) indicator upholds the mundane sideways trading Ethereum has displayed since Monday. Its downside is protected by the 100 Exponential Moving Average (EMA) (blue) at $2,020 and the ascending trendline.\n\nEthereum price tends to react bullishly every time it has retraced to touch the trendline. Therefore, in case of dips towards the $2,000 mark, bulls could seize the opportunity to buy into ETH while speculating on the next breakout first to $2,200, and later to the subsequent levels at $2,500 and $3,000.\n\nTraders should exercise caution and restraint as long as Ethereum is trading below the short-term resistance at $2,040, as highlighted by the 50 EMA (red). The action above this level and the next resistance between $2,058 and $2,070 would serve as a breakout signal, paving the way for a bigger move to $2,200.\n\nThe momentum indicator will confirm the uptrend’s continuation with the blue MACD line flipping above the red signal line.\n\nA triangle pattern forming on the four-hour chart could nurture a bigger breakout towards $3,000 if validated. Bulls must focus on breaking above resistance at $2,120 to activate the triangle breakout. Most traders would consider going long on Ethereum slightly above the triangle.\n\nRecommended for you: Dogecoin Price Could Blast Through $0.12 Resistance If This Technical Pattern Plays Out\n\nA glimpse of the daily chart assures traders of support at $2,015 but based on the current technical, as depicted by the sell signal from the MACD, ETH might drop again before making another significant recovery attempt.\n\nHowever, backing the bullish outlook in ETH is the position of all three moving averages; the 50-day EMA, the 100-day EMA, and the 200-day EMA. If the MAs uphold the ongoing uptrend, the path with the least resistance is likely to stick to the upside.\n\nEthereum DeFi TVL Shoots To $26 Billion\n\nThe dollar value of all ETH locked in staking protocols and other decentralized finance (DeFi) networks is increasing rapidly. According to data by Defi Llama, the total value locked (TVL) currently stands at $26 billion from approximately $19.4 billion in mid-October.\n\nThe growth in TVL underscores the long-term bullish outlook investors have for Ethereum price. They are willing to lock up their Ether for longer periods, expecting that the uptrend will continue into 2023. A high TVL value significantly reduces the selling pressure.\n\nRelated Articles\n\nJohn Isige John is a seasoned crypto expert, renowned for his in-depth analysis and accurate price predictions in the digital asset market. As the Price Prediction Editor for Market Content at CoinGape Media, he is dedicated to delivering valuable insights on price trends and market forecasts. With his extensive experience in the crypto sphere, John has honed his skills in understanding on-chain data analytics, Non-Fungible Tokens (NFTs), Decentralized Finance (DeFi), Centralized Finance (CeFi), and the dynamic metaverse landscape. Through his steadfast reporting, John keeps his audience informed and equipped to navigate the ever-changing crypto market.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiY0FVX3lxTE1NVnVnVW1uN3czaE1FWFp2cFZoNmVpSW1KTDZ4R2JENHNaWng5eXJaLXFKdUhlM040ckJNc3o4MjFfNndTYXBNZF9xa1RyVlZFUEx3STlPZC1tUEtfc2ViQ2lwTQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Blast from the past: 3 years on from the launch of ETH staking - Blockworks",
        "content": "Yeeting ETH into the void is nothing new for Ethereans.\n\nBy the time the Beacon Chain officially launched on Dec. 1, 2020, the staking contract — referred to as “ETH 2.0” back then — had already seen around 880,000 ETH in deposits.\n\nSo perhaps it’s no surprise that multisig-with-a-plan project Blast now sports $650 million in staked ether and stablecoins under its control.\n\nBlast’s explicit promise is that deposited tokens will earn an on-chain yield, plus rewards of unknown value. Ether staking yield comes via Lido’s stETH tokens, while stablecoins are converted to dai deposited in Maker, or savings dai (sDAI).\n\nOn Thursday it emerged that the Blast deposit interface set its slippage tolerance to an inordinately high 10%, resulting in one user losing about $100,000 in value. The Blast team says they’ve fixed it.\n\nBut, sandwich attack surprises aside, most depositors at least know that all assets will be locked until the proposed optimistic rollup launches in February.\n\nDepositors to the Beacon Chain, too, knew that their ether would be locked up for at least a couple of years — though it wasn’t clear when exactly The Merge and subsequent enabling of staking withdrawals would happen when many aped in.\n\nUltimately it took until April 2023, by which time about 18 million ETH (about $33 billion at the time) were deposited.\n\nIn the interim, there was a rapid growth in liquid staking, with Lido becoming the dominant player in early 2022, and already nearing a third of all staked ether by May 2022. It has remained between 29% and 33% ever since, keeping the project at the center of a debate about centralizing market forces on Ethereum.\n\nThe total percentage staked through Lido currently stands at 32.28%, and Blast — which uses Lido exclusively — isn’t helping.\n\nHow much of a problem that is, depends on who you ask.\n\nSome will analogize the concentration of ether stake to the preponderance of the Go Ethereum (Geth) execution client for Ethereum node operators. A great deal of social coordination was needed to bring down the market share of Prysm on the consensus layer, which reduces risks to the network as a whole. Geth is currently at 84%.\n\nClient diversity is widely seen as one of Ethereum’s strengths, a hallmark of its resilience through decentralization, which is unmatched in crypto. Indeed, decentralization and resilience are often seen as synonymous.\n\nLoading Tweet..\n\nThat’s why some are concerned about the Blast-fueled tick up in Lido’s stake share.\n\nBut for others, it’s a feature, not a bug. Blur and Blast investor Izebel.eth stated the “3 line pitch” for Blast is that “[Ethereum] would be better if everyone used stETH…so we use the bridge as a forcing function.”\n\nLoading Tweet..\n\nOf course, the “bridge” is not really a bridge, while it can only be crossed one way. And forcing people into a harmful position isn’t doing them any favors.\n\nLoading Tweet..\n\nIt’s generally good advice to be wary of promises from backers that something can “reshape the fabric of society.” That’s not just “ambitious” — it’s hubris.\n\nNone of the more academic discussions ultimately matter, though, when you have gamification as your selling point. And, maybe there are bigger fish to fry.\n\nIn any case, Lido has more TVL — approaching $20 billion — than any other DeFi protocol by a country mile. And Blast is bigger than Base — in third place behind Arbitrum and Optimism according to L2Beat — while now hiring software engineers, much to the amusement of crypto Twitter.\n\nPlenty of folks in this industry idolize the free market; so if that’s your modus operandi, then the market has spoken, for now.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxNTzVHQVpvR3dnSXlVVmk2SDIzbVh6NDB2MHZETTFLdkJBd2hSNHR3b3gyMkpteGFGRkd6V2p3TTk0UlhqUld0NmdHRW91WVpnTXVNb3dyb05OTkhLQTdNN096bEVVMDFkNnJKR3JRSDdUWWpBT1RPSlV0bEVCMldSLXpMbTNMdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Vitalik is the public intellectual the tech world needs right now - Fortune",
        "content": "Vitalik Buterin is best known for creating the world’s second-most-valuable blockchain, Ethereum, when he was just 19 years old. In the past few years, though, Buterin’s influence has expanded well beyond the world of crypto and into the broader realm of ideas where the young polymath—who taught himself Mandarin while traveling the world—offers important treatises on technology and the future.\n\nThe latest example is a 10,000-word essay Buterin published this week titled “My techno-optimism.” It’s a response to the much-discussed “manifesto” with a similar title by the influential venture capitalist Marc Andreessen. Buterin’s piece endorses many elements of the manifesto, including an affirmation that technology has delivered marvelous benefits to humanity, and that fear and overzealous regulation have limited progress in fields like biotech. But while he endorses a foot-on-the-gas approach, especially to solve the climate change crisis, Buterin also calls for a more cautious approach when it comes to AI.\n\nWhile the Ethereum creator has long been a leading thinker in computer science, he has also become one in the governance of technology and society. Here is Buterin on the crack-up at OpenAI and the problem of putting guardrails on technology by means of small councils of elite decision-makers:\n\n“[It was] a well-intentioned effort to balance the need to make a profit to satisfy investors who provide the initial capital with the desire to have a check-and-balance to push against moves that risk OpenAI blowing up the world. In practice, however, their recent attempt to fire Sam Altman makes the structure seem like an abject failure: It centralized power in an undemocratic and unaccountable board of five people, who made key decisions based on secret information and refused to give any details on their reasoning until employees threatened to quit en masse.”\n\nDrawing on his experience in trying to build decentralized communities in the Ethereum realm, Buterin provides new and important insights into how to think about AI—including how to avoid the very real possibility that humans end up as pets to machine overlords. He is, of course, hardly the only one with big ideas about the future of technology. But what makes Buterin stand apart is his deep capacity for empathy and lack of ego.\n\nUnlike Andreessen and Balaji Srinivasan—another tech genius whose ideas carry a lot of weight in the debate over technology—Buterin doesn’t have contempt for those who disagree with him, and he doesn’t frame the debate in the shrill us-versus-them tone of the venture capital elite.\n\n“I believe that these [technologies] are deeply good, and that expanding humanity’s reach even further to the planets and stars is deeply good, because I believe humanity is deeply good,” he writes. In a troubled moment where too many people are consumed with fear and negativity, it is welcome to read a tech genius who relies on empathetic persuasion. If you want a shorter and more approachable window into Buterin’s worldview, you can also check out this new Fortune Q&A, which includes the moral case for supporting Ukraine and the fascinating sci-fi realm of the popular book and film The Three Body Problem. Have a great weekend.\n\nJeff John Roberts\n\njeff.roberts@fortune.com\n\n@jeffjohnroberts\n\nDECENTRALIZED NEWS\n\nBitcoin bulls are predicting the currency, which is up around 130% in 2023, will end the year at $40,000 even as it has struggled to maintain a consistent foothold above $38,000. (Bloomberg)\n\nRep. Tom Emmer (R-Minn.), a GOP House leader, warned about a legal framework for stablecoins based around CBDCs that he says could “swallow up” crypto in a “surveillance security state.” (Fortune)\n\nPolygon secretly gave preferential status to Draft Kings in the form of millions of dollars’ worth of subsidies to a validator run by the sports betting site—an effort that is now kaput. (CoinDesk)\n\nA new survey of the Bitcoin mining industry raises concerns about its use of water, which it claims is about equal to the annual consumption of Washington, D.C. (The Verge)\n\nAmid a broader reckoning in the VC industry, Tiger Global slashed valuations in its venture fund, including markdowns of 94% to OpenSea and 64% to Bored Ape Yacht Club. (Bloomberg)\n\nMEME O’ THE MOMENT\n\nOne version of the future:"
    }
]