[
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxQclhDNWZScDJRUHVWOTFKdTZpNmZiMWJUREtockktNTNvSllOMVN4bVV5andiTno5NHI2YzBORk1xaXZxZXhFWWxaRjRhUjNhUDF2VG9YYmdQR3V2Um1JcWM4VS16NVdPWERVZXZvVnEwSjhYdUszLUZPNjdnNGFyU19EVmU2YkFudXdlT21mLXhuSE8tQ295Nl91bmxLVFhJelZla3hzaEpONzZ4U191Zm0zRV9XeS1kWEhhWm1mMnd5d9IBxwFBVV95cUxNMnI4b3hvbjNaeVlJZWJkX3dyM2VFSUlRXzNVNG9ld0NNNnJmS1lVaHFoaEhGQUNVdUpZQXBDU19zNTlLU3h1Q09fdWVWU2RFamtJOG16NTVkdV8tN19UbGRINDR1WER4UDdtaTQyWUhpVTItNkprUlJUSU5GVVB4R1g4U1V2QjBKeTlnLWpIYlYzNVNRSkJJdDRKMExkck9CWlFLLW05V3ZRenI0WVplbmRtam9Qc3NONDVnbUZVQVhHWG9tN3hF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "Banker Loses Access to $450,000,000 Worth of Ethereum (ETH) After Misplacing Wallet Keys: Report - The Daily Hodl",
        "content": "An Estonian banker has confirmed himself to be the owner of an Ethereum address with over 250,000 ETH worth nearly half a billion dollars – but says he lost the keys.\n\nIn a new interview with Vikerraadio in Estonia, LHV Bank founder Rain Lõhmus was asked about something he said years ago about getting into Bitcoin (BTC) and Ethereum in their early days but then losing access to his wallets.\n\nAsked if he ever found his keys, Lõhmus says,\n\n“No, and I haven’t made much effort either. It’s no secret that I have a wallet with 250,000 Ethereum units, anyone can calculate for themselves what it’s worth.\n\nInterviewer: That’s hundreds of millions?\n\nYeah, and I can’t solve this alone; if someone thinks they can, I’ll take all offers. My own best plan is to build Rain Lõhmus as an AI and see if he can get his memories back.\n\nLõhmus said the dangers of handling your own keys and seed phrases was one of the weak points of crypto.\n\n“I absolutely agree that this is a very weak point of this system, which makes you think that this perfect decentralization has other risks that you don’t usually think about. But it’s very common for me to lose passwords. I went to renew my ID card passwords today; if it were crypto, I’d be in a big crisis again, but luckily the police and border police work.”\n\nBased on the information shared by Lõhmus, on-chain analysts have identified his Ethereum address, and according to Etherscan, it is the fourth biggest holding of ETH excluding exchanges, the Ethereum Foundation, and the Wrapped Ether (wETH) address.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Tithi Luadthong/Natalia Siiatovskaia"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiYkFVX3lxTE93T1R0cEt4UGlHV1NYTVNUT3R4Nml2bWcwQnlxcFhkdTViNktFM0ZvWHB6eVZuOXlTakswZENjZ1JzOWJXOGxXSlE5ek1HQ2VKQ3ROM0wwTFFCZkR1Ynp2OWl3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "Evmos hopes to lure Ethereum developers to IBC by deprecating Cosmos transactions - Blockworks",
        "content": "On the Cosmos-based EVM chain Evmos, Cosmos transactions and Ethereum transactions have been operating under different standards, leading to complications as these two types of transactions struggle to decode each other effectively.\n\nEvmos plans to relieve this technical headache by only supporting Ethereum-formatted transactions by 2024 Q3, it announced in a blog post Tuesday. Despite this strategic shift, the protocol emphasized that Evmos is not exiting the Cosmos ecosystem. Additionally, Evmos’ founder suggested that the move could help bring Ethereum developers to the IBC.\n\nEvmos functions as an Ethereum Virtual Machine (EVM) compatible blockchain that integrates the Cosmos IBC protocol, allowing it to operate as an EVM within the Cosmos network. Evmos raised $27 million via token sale in late 2022.\n\nRead more: Uniting the blockchain ecosystems: Q&A with Cosmos founder Ethan Buchman\n\nThe project’s co-founder Federico Kunze Küllmer said that by only supporting Ethereum transactions, Evmos hopes to make it easier for Ethereum developers to start working in Cosmos.\n\n“The wallets and the tools that they are already used to on Ethereum do not work easily on Cosmos,” Küllmer said. “We want to make it very easy for the developers and users that are already interacting with Ethereum wallets to interact with any Cosmos application specific blockchain.”\n\nThe Interchain Foundation, a non-profit focused on Cosmos adoption, made onboarding Ethereum developers a large part of its 2024 roadmap, Blockworks previously reported.\n\nIn the lead-up to fully embracing Ethereum-formatted transactions by Q3 2024, the protocol has committed to burning all Cosmos transaction fees during this interim period. This action will effectively remove these fees from circulation, signaling a shift towards revised token economics for the EVMOS token. Küllmer indicated that further details on the new tokenomics will be unveiled next week.\n\nEvmos (EVMOS) was worth around $0.07 at the time of publication.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTE9oYWFralhTRDhsVFllVVRTdFpnSS10VXpxVXdtbmIyR3hjQzQ1Mm9LTzg4REhWMC1UY1J6bk9aOFMwQ2thNV9yRjlqRVVvYlZ0WkNWeG5Cb0JlSDVPN3hCTDAwNUZ1aUctYlNvc2wtMnZYUTA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "New Ethereum rollup takes a zero-knowledge approach to sharding - Blockworks",
        "content": "Ethereum scaling solution builder =nil; Foundation has introduced zkSharding for Ethereum, the latest infrastructure attempt at gaining faster transaction speeds while maintaining Ethereum’s economic security.\n\nSharding, unlike other popular scaling solutions, is designed to divide the Ethereum network into different sections and process transactions in a cheaper, more efficient manner.\n\nZkSharding utilizes zero-knowledge (zk) technology to generate proofs, ensuring that transactions are valid across different layer-2 shards before being submitted to Ethereum mainnet. The greater the sub-shards, the higher the maximum throughput on Ethereum.\n\nThis technique is not to be confused with Proto-Danksharding, which refers to Ethereum Improvement Proposal (EIP) 4844, and whose primary purpose is to reduce the costs of transactions for zk rollups by storing them in temporary data blobs, Misha Komarov, CEO and co-founder of =nil; Foundation told Blockworks.\n\nAll zk rollups can benefit from Proto-Danksharding, but only applications built on =nil; will be able to benefit from zkSharding on top of that, Komarov explains, noting that data-intensive environments and high-load environments will be able to benefit most from zkSharding.\n\n“As a zk rollup, =nil; benefits from Proto-Danksharding that cheapens storing transactions on Ethereum, however zkSharding as a scaling concept addresses fragmentation of liquidity and economic security,” Komarov said.\n\nZkSharding represents a combination of modular and monolithic blockchain architectures and delivers an appropriate solution based on its features in a competitive layer-2 environment, he said.\n\n“We believe that zkSharding addresses the drawbacks common for other alternatives on the market that go, by design, with application-specific scaling,” she said.\n\nSpecifically, Komarov notes that applications built on other zk rollups can only interact with liquidity or data that was migrated to its specific zk rollup environment, limiting market efficiency and creating additional trust assumptions and costs through bridges for interoperability.\n\n“zkSharding introduces separate shards as dedicated execution layers that are fully composable with each other, meaning a transaction can trigger the creation of new transactions on other shards,” Komarov said.\n\nThe goals are familiar from other zk-based scaling approaches such as zkSync’s, however. ZkSync terms chain connections using the ZK Stack architecture “hyperbridges,” which are also designed to trigger transactions on other “hyperchains,” a spokesperson told Blockworks.\n\n“As a rule, don’t trust, verify the claims of those that promise to solve the layer-2 fragmentation of liquidity issues — even with cutting-edge zk tech, it’s definitely not solvable for native assets without adding non-negligible security assumptions,” the spokesperson said.\n\nFinding the proof in the pudding will have to wait in the case of the new =nil; layer-2, which is initially operating with a single shard on a testnet."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxOeGVzS2EwRjBMZUhibmxWcHdKbWFXOV81d3l2QXpJdk02d2dLMzgzYUJhTVZWSC1mUWEyQmhzNWRnSU5PY0hGdVdyMkxNeXNrempWMVJkRGt5WGJVQy11Q2xkWWpqbE1GOFF3UjdDTUZNcVJpYXV6TmR4aE8tQTlnaEZLMzE2MWs4aXdj0gGTAUFVX3lxTE4xWVBnZHBONzZ0eFhlcll2YmhnRXZJTjl3TWdvdW11ZVgyMnN0d05ldml4QThQOUpzb0RDd1RFY3pUNy0tMTNmSFNRTXdfT1pXUldaQXk1WGxySFNmZVBpOFF1aGkzcmptWklDRWZwSzFza3FMUF9uRHBvZjZXdTdsZ1hmQmpGQ2NGejNHd29WT2tNWQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Rival Solana Is Back—Experts Say It's No Surprise - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nSolana is once again the talk of crypto, and its native coin SOL is benefiting from the attention. The price of SOL is up over 9% today, hitting a 24-hour high of $44.41.\n\nOver the past 30 days, it has exploded in value by over 88%, according to CoinGecko—making it the biggest winner of all the major cryptocurrencies.\n\nAnd despite its association with the collapsed FTX crypto exchange and its criminally convicted founder Sam Bankman-Fried, experts say Solana’s recent rise shouldn’t come as a shock.\n\nWidely considered a competitor to Ethereum, Solana aims to be the go-to network for on-chain applications and experiences. Ethereum proponents argue that the leading smart contract network offers greater stability and security, but Solana is objectively cheaper and faster for those wanting to build or use lending protocols, games, and other applications that utilize blockchain technology.\n\nAD\n\nAD\n\nSolana gas fees right now stand at $0.000522; to make a transaction on Ethereum, it costs $6.58 on average.\n\nFor this reason, Solana has grabbed the attention of Visa, Shopify, and developers wanting to build on the network.\n\n“Solana adopts a streamlined approach, emphasizing high base layer throughput while simplifying the developer experience,” portfolio manager at Yield App Akash Mahendra told Decrypt, highlighting how much data can be processed by the blockchain.\n\nMahendra added that major partnerships and institutional interest are also helping drive up the price of SOL.\n\nAD\n\nAD\n\nIt wasn’t that long ago that Solana was getting a bad rep. FTX, once one of the biggest and most recognizable brands in the crypto space, was heavily invested in Solana.\n\nEx-FTX boss and co-founder Sam Bankman-Fried was a prominent Solana supporter, and the company invested in numerous Solana-related projects. FTX launched a marketplace for Solana NFTs, and even co-created Serum, which at one point was considered a foundation of the Solana DeFi space. At its peak in 2021, Solana commanded a market cap of $78 billion and boasted a $10 billion DeFi ecosystem.\n\nFTX then collapsed in a highly publicized bankruptcy while holding over $1 billion in SOL. The cryptocurrency plunged as a result.\n\nBut big players still see real value in the project.\n\nIn August, Solana’s payment protocol Solana Pay integrated with the e-commerce platform Shopify, allowing merchants to accept stablecoin USDC via the blockchain. This collaboration “capitalized on Shopify’s influential 10% share in the U.S. online retail sector, which translates to an estimated $444 billion in global transactions,” according to Mahendra.\n\nThen, payments giant Visa announced in September that it had chosen Solana’s blockchain for its stablecoin ambitions. This, according to Solana Foundation’s head of strategy Austin Federa, “validates the importance of the network’s unmatched speed and scalability.”\n\nThese two moves were seen as bullish by investors who have since been plugging fresh cash into the project. And things really picked up in the last month.\n\nPatrick Felder, founder & CIO at Prismatic Capital, told Decrypt this was because when Bitcoin and the broader crypto market started rallying, SOL was the most deeply oversold asset in the space following news that FTX’s new management might sell off large amounts of SOL.\n\nAD\n\nAD\n\nBut this, according to Felder, was “massively overblown” FUD (fear, uncertainty and doubt) and “triggered a massive short squeeze.” In the world of trading, a short squeeze is when the price of an asset shoots up unexpectedly due to short sellers (those who’ve bet on the asset going down) exiting their positions.\n\nThis happened with SOL, according to Felder, as many had bet on Sam Bankman-Fried’s FTX trial hurting the asset's price.\n\nThe Solana community’s annual conference, Breakpoint, took place at the end of October, leading to an even bigger rally, added Felder.\n\nThe irony is that at Breakpoint last year, the price of SOL had plunged by 60% in the week following the FTX crash. Spirits were low. But now, the coin has made a stunning comeback.\n\nAs always the question is, will it last?\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxNTUwyZVJMWndTWUhnZkZtUl9JdS0tcVBKWXdkTnc2RXhLQzBSNDNnZEFnUTZSOGFxUW5XY3dTZ2tvNnduYjJkTDJoc2Z2LTVxY1FwSU40M1BIVGlCSVZsdm9JcG1LY3Nmdl9kY3NvOTZjVmx4a2I4NS1US2hXX0FGbGN0a2FlS1NaS1hwdXZEdGRZZFpMZDZWM1JQdVU5djJQbDdpRXo0X3hTbl9fdHZj0gG0AUFVX3lxTE5qUjVQT3VKNVZ5cXh1UnNnZi1lblhtYmY4SG12SDRNejY0OVJDbmNHbzQ2QWltdFJCeG9acXh4bzVXaHNQd1kwRXNsdFdjVjhDdnBmMFMxc01kemFwenEtUVBVWHJxc2ZrVS12M3FJX25oT3VhY19EX3hmOWk1U0JqTmtmQndKTzF1LUt2QlM3Q1djdXhBSkxlQmNCU09xT001OF90bDNMek1BaGRVT1V2alV4Uw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Price Prediction: ETH Going To $5.8? Here’re The Levels To Watch - CoinGape",
        "content": "Ethereum (ETH) price is pulling back after taking a breather in the wake of the climb to $1,900 earlier this week. The prominent smart contracts token needs to sweep fresh liquidity preferably at $1,800; the immediate support. Traders may take this opportunity to lock in the gains, a move likely to trigger a larger sell-off.\n\nHowever, with a bull flag pattern validated on the weekly chart, investors do not need to panic, as the next rebound could overcome resistance at $2,000 and pave the way for gains to a new all-time high of $5,800, foreshadowed by the Finder’s panel.\n\nadvertisement\n\nA higher support is anticipated above $1,800 as Ethereum collects liquidity for the next breakout above $2,000. For now, it might be prudent to let the consolidation play out before betting on either longs or shorts.\n\nEthereum Price Bullish Scenario – Bull Flag Pattern\n\nThe weekly chart highlights the formation and validation of a bull flag. This is a bullish flag pattern, formed by a couple of price rallies set apart by a consolidation period.\n\nThe flagpole represents the bullish muscle blindsiding sellers who then briefly assume control over the price (the channel), as profit-booking takes place, but eventually, the price breaks out to a higher level.\n\nIn Ethereum’s case, the bull flag breakout has already been validated. However, due to the resistance at $1,900, buyers lack the momentum to complete the 49.44% breakout target of $2,678.\n\nWith Ethereum price holding above all three moving averages, including the 50-week Exponential Moving Average (EMA), the 100-week EMA, and the 200-week EMA, the uptrend has a higher chance of resuming than a correction taking place below $1,800.\n\nTraders should be on the lookout for how Ethereum price responds to the support provided by the 100-week EMA (blue) at $1,806. A retest of this support could prove highly bullish and trigger a larger breakout.\n\nHowever, trading below $1,800 might be detrimental to ETH price as it may discourage traders from booking new long positions afraid of capitulation. Below $1,800, the next key support areas are the 50-week EMA (red) at $1,757 and the 200-week EMA (purple) at $1,633.\n\nFinder Analysts Predict Ethereum Price Rise To $5.8k By 2025\n\nFinder, a platform that brings together predictions from different industry leaders, has predicted a potential surge in Ethereum price to $5,800 by 2025.\n\n“On average, our panel thinks Ether (ETH) will be worth US$1,840 by 2023 before rising to US$5,824 by 2025 and then US$14,411 by 2030,” Finder’s latest report states.\n\nMeanwhile, Ethereum is expected to close the year at $1,840 based on the average prediction of the panel of 31 crypto industry specialists. The panel appears to have changed its tune toward the bearish side, following a previous optimistic prediction of $2,451 in July.\n\nMost panelists believe that “ETH has a huge growth potential” especially with the growing interest in “Ethereum staking and [ETH’s] exceptional low inflation rate” which points to a potential short squeeze likely to culminate in a remarkable upside in the ecosystem, believes Ben Richie, the managing director at Digital Capital Management Pty Ltd.\n\nHowever, some specialists like Ryan Grace, the head of tasty tastycrypto said that like Bitcoin price, Ethereum price is bound to encounter macro headwinds which could limit its upside action in the short-term, especially with the Federal interest rates above 5%.\n\nRelated Articles\n\nJohn Isige John is a seasoned crypto expert, renowned for his in-depth analysis and accurate price predictions in the digital asset market. As the Price Prediction Editor for Market Content at CoinGape Media, he is dedicated to delivering valuable insights on price trends and market forecasts. With his extensive experience in the crypto sphere, John has honed his skills in understanding on-chain data analytics, Non-Fungible Tokens (NFTs), Decentralized Finance (DeFi), Centralized Finance (CeFi), and the dynamic metaverse landscape. Through his steadfast reporting, John keeps his audience informed and equipped to navigate the ever-changing crypto market.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    }
]