[
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxPdjJDNVZmek1nQ1hHRzB2THk0bXRMdDZEQVpZbUJtOVM0SVdMR01ZaF8xWmZ6ejI1Tk1aSUJxZ2Y0Tl9sSDNyWGVUbWYzSDNvQzdCMlBWc05wa1YyeFdNWlVROS1zaTFEQ19remdlYV9heWJoemp6UURDcjkyazNRRkIxY9IBiwFBVV95cUxNWHBpa3dpbzRVVC0zM2pQMU95OUNjaWszQk14dkNLaXY5UUg2Y1VtYXFtZGVsdU5wR2R5amlpOFJkME1la2FvUjBQem1EQnBIRS1COFM0TWZyVmt5MnZua2Vld1FpWk9RdVhmT3lIOGlXYnZ2SWlZN1kxYUZjZGdXQW10dnJta1gyZzlV?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Solana Gets Some Shine: Ethereum Rival Rallies Again - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAfter cooling its November rally Solana has shot up again: it's right now the best-performing cryptocurrency out of the top 20 coins and tokens.\n\nAt the time of writing Solana (SOL) is trading for $60.16 per coin—a 24-hour jump of over 7%, according to CoinGecko. Over the past seven days, SOL has gained 10% in value.\n\nSOL experienced a phenomenal rally throughout November. The Ethereum-competitor price soared past $50 for the first time since May 2022, beating most coins and tokens in performance.\n\nAccording to experts, the boom was likely down to a short squeeze caused by short sellers exiting their positions and renewed interest from institutions. But that was nearly a month ago and Solana is still pumping.\n\nAD\n\nAD\n\nSOL was the most oversold asset in the space after rumors swirled that collapsed crypto exchange FTX's new management was thinking about selling large amounts of SOL. But it shot up unexpectedly after short sellers (those who’ve bet on the asset going down) rapidly exited their positions.\n\nOver the past 30 days, SOL is up over 70%.\n\nElsewhere, the crypto market is relatively sleepy. Bitcoin has barely budged over a 24-hour period; the same goes for Ethereum. Other major players like Dogecoin, Tron, and XRP have also not moved by a percentage point.\n\nBitcoin yesterday did experience impressive price movements, breaking past $38,000 per coin for the second time in a week.\n\nAD\n\nAD\n\nThe same goes for most of the top digital assets—except for Avalanche (AVAX), which is up in the past day, coming in at $20.87.\n\nAVAX—like SOL—is also a winner over the past 30 days: it has gained 80% in value. The cryptocurrency experienced a price bump earlier this month after banking giant J.P. Morgan said it had used the blockchain to tokenize portfolios.\n\nEdited by Stacy Elliott."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxPdjJDNVZmek1nQ1hHRzB2THk0bXRMdDZEQVpZbUJtOVM0SVdMR01ZaF8xWmZ6ejI1Tk1aSUJxZ2Y0Tl9sSDNyWGVUbWYzSDNvQzdCMlBWc05wa1YyeFdNWlVROS1zaTFEQ19remdlYV9heWJoemp6UURDcjkyazNRRkIxY9IBiwFBVV95cUxNWHBpa3dpbzRVVC0zM2pQMU95OUNjaWszQk14dkNLaXY5UUg2Y1VtYXFtZGVsdU5wR2R5amlpOFJkME1la2FvUjBQem1EQnBIRS1COFM0TWZyVmt5MnZua2Vld1FpWk9RdVhmT3lIOGlXYnZ2SWlZN1kxYUZjZGdXQW10dnJta1gyZzlV?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Solana Gets Some Shine: Ethereum Rival Rallies Again - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAfter cooling its November rally Solana has shot up again: it's right now the best-performing cryptocurrency out of the top 20 coins and tokens.\n\nAt the time of writing Solana (SOL) is trading for $60.16 per coin—a 24-hour jump of over 7%, according to CoinGecko. Over the past seven days, SOL has gained 10% in value.\n\nSOL experienced a phenomenal rally throughout November. The Ethereum-competitor price soared past $50 for the first time since May 2022, beating most coins and tokens in performance.\n\nAccording to experts, the boom was likely down to a short squeeze caused by short sellers exiting their positions and renewed interest from institutions. But that was nearly a month ago and Solana is still pumping.\n\nAD\n\nAD\n\nSOL was the most oversold asset in the space after rumors swirled that collapsed crypto exchange FTX's new management was thinking about selling large amounts of SOL. But it shot up unexpectedly after short sellers (those who’ve bet on the asset going down) rapidly exited their positions.\n\nOver the past 30 days, SOL is up over 70%.\n\nElsewhere, the crypto market is relatively sleepy. Bitcoin has barely budged over a 24-hour period; the same goes for Ethereum. Other major players like Dogecoin, Tron, and XRP have also not moved by a percentage point.\n\nBitcoin yesterday did experience impressive price movements, breaking past $38,000 per coin for the second time in a week.\n\nAD\n\nAD\n\nThe same goes for most of the top digital assets—except for Avalanche (AVAX), which is up in the past day, coming in at $20.87.\n\nAVAX—like SOL—is also a winner over the past 30 days: it has gained 80% in value. The cryptocurrency experienced a price bump earlier this month after banking giant J.P. Morgan said it had used the blockchain to tokenize portfolios.\n\nEdited by Stacy Elliott."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxPN2dPdEI3dExzbjBvdTR3Mmt6REp5Y2hvYUhqc1MyWjRpZGs0MERIQ1VnWXlEZUVJa2pEelBDSlNYejBvVkRJWl9RYkNMVzFzR2hkdGxSX2ZxUFN1anp4TGljWTNGZmw1dXM2dEM3Y05VQ0lNRXBTV1hXLWh6Q2o5aWZpWdIBiAFBVV95cUxNT25nZ3JqRVgxX2stcFhWV2J4TzlCVmZxSzZKNVgxbGZJN0hzT1FqMjFQRVVQY0JLdWhoUFQ5bVdEbUIyR21hSkljcWdwLU1NY3V6Rk1hWF9fMzlDSUZqaUc1VlQwWFRUdWtnVjJyM1BLRlJLOFRzYXV4OVF5VGc0NjVIYmVkUGUt?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Ethereum Price Prediction: Will $ETH Surpass $3000 in December? - CoinGape",
        "content": "Ethereum Price Prediction: Throughout the major part of November, the Ethereum price remained within a sideways range, fluctuating between $2133 and $1917. Both of these horizontal levels were tested twice, signaling uncertainty among market participants. However, this consolidation has formed a bearish reversal pattern, suggesting a potential further downside for ETH.\n\nAlso Read: Here’s Why CBDCs Could Outshine BTC, Ethereum, and Other Private Cryptos\n\nadvertisement\n\nWill $ETH Consolidation Lead to Massive Leap?\n\nThe overhead supply at $2133 assists sellers in developing a bearish reversal pattern called double bottom\n\nThe $1917 level aligned with the 32.8% Fibonacci retracement level creates a strong support zone.\n\nThe intraday trading volume in Ether is $10.5 Billion, indicating a 16% gain.\n\nAmid the past two weeks’ consolidation, the Ethereum price retreated twice from the $2133 resistance, indicating substantial overhead supply. These reversals have emphasized the emergence of a bullish reversal pattern known as a Double Bottom on the daily timeframe chart.\n\nTypically observed near market tops, this pattern signifies a decline in bullish momentum. At present, ETH trades at $2,025 and, with an intraday loss of 1.6%, is gradually approaching the neckline support at $1,970.\n\nA bearish breakdown below this neckline could intensify supply pressure, potentially causing ETH to drop to around the $1700 mark, marking a potential loss of 12%.\n\nHowever, the recent price rejections around the psychological support of $2,000 suggest buyers are attempting to counter the bearish setup. If this buying pressure persists, the ETH price might rebound to challenge the last swing high at $2133 and the upper trendline of a longstanding wedge pattern.\n\nETH Price Recovery to $3400\n\nOver the past 20 months, the ETH price has experienced a shallow recovery within a rising wedge pattern. Historically, the upper boundary of this trendline has resulted in increased supply pressure, leading to significant corrections. Therefore, the current upward movement towards this upper trendline necessitates a definitive breakout to confirm a bullish trend. A post-breakout rally could potentially drive prices up to $3400\n\nRelative Strength Index (RSI): A sharp drop in the daily RSI slope suggests a bearish divergence with the Ethereum price, hinting at potential upcoming downturns.\n\nBollinger Bands: The converging boundaries of the Bollinger Bands indicate an uncertain market sentiment prevailing for Ethereum.\n\nSahil Mahadik Sahil is a dedicated full-time trader with over three years of experience in the financial markets. Armed with a strong grasp of technical analysis, he keeps a vigilant eye on the daily price movements of top assets and indices. Drawn by his fascination with financial instruments, Sahil enthusiastically embraced the emerging realm of cryptocurrency, where he continues to explore opportunities driven by his passion for trading\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTFB5bGVYQVA2RjVtTm1jd1J0S2tSVi1KQS03ZWdYWkt1RnMzUVBNQ2k0d3ZCeHZyS2lyNTZFUUw1b3d0R3hPdEFwS2ZKTkM5WG1pZk00VDJPU29EUzU4bnVNdGtrVDZkdEZWQmVrZGpSdTJKM05B?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "What Is Block Time? What It Measures, Verification, and Example - Investopedia",
        "content": "What Is Block Time?\n\nBlock time measures the time it takes the miners or validators within a network to verify transactions within one block and produce a new block in that blockchain.\n\nBlockchains were first popularized by Bitcoin when it was introduced in 2009. The technology has grown as more cryptocurrencies are created, each of which can use a different or identical blockchain, validation methods, and techniques for creating new blocks.\n\nKey Takeaways Block time is the time it takes to process a block in a cryptocurrency blockchain.\n\nOn the Bitcoin blockchain, a block is verified by miners, who compete against each other to verify the transactions and solve the hash, which creates another block.\n\nOn the Ethereum blockchain, a block is validated by randomly selected nodes, which is must faster because there is no competition.\n\nOther chains might use different mechanisms, which would affect their block times.\n\nUnderstanding Block Time\n\nA blockchain is a distributed database that records all transactions within a cryptocurrency network. You can think of a block within the database as a cell in a spreadsheet where transaction information is stored. Bitcoin miners verify the transactions, which takes time because finding the solution to the encryption problem requires the computers to make a vast number of trial-and-error attempts.\n\nOn the Bitcoin blockchain, this is called hashing—generating random hexadecimal numbers to try and find one that is less than or equal to one set by the network. When the block solution is found or otherwise validated, a new block is opened. The amount of time it takes to find the solution and create a new block is the block time.\n\n\n\nHere are a few key points to remember if you're trying to understand block time:\n\nA block is a record of the most recent cryptocurrency transactions, similar to a cell in a table of columns and rows.\n\nEach block contains the information from the block that preceded it in hashed form (that's why it is theoretically impossible to alter cryptocurrency).\n\nOn the Bitcoin blockchain, cryptocurrency \"miners\" race against each other to generate a random hash plus the nonce that is less than or equal to the target hash. The winner receives a reward.\n\nEthereum validators use a different consensus mechanism, which makes the block times shorter.\n\nBlockchains that use other mechanisms may have shorter or longer block times.\n\nWhy Block Times Differ\n\nConsensus mechanisms are what allow a network of participants to agree that a transaction is valid. Cryptocurrencies can use different consensus mechanisms, which, among other factors, affect the time it takes to verify transactions and create new blocks.\n\nProof-of-work and proof-of-stake are two types of consensus mechanisms that use different transaction verification methods. Each blockchain has a different block time because of the way their mechanisms work—Bitcoin averages about 10 minutes, while Ethereum only takes around 12 seconds.\n\nThe exact amount of time it takes for block generation on the Bitcoin proof-of-work blockchain is governed by the difficulty level, which changes with network traffic and the number of miners on the network to keep block times at 10 minutes.\n\nEthereum uses proof-of-stake, which is much faster because there is no competition for a reward—participants with staked ether are randomly selected to validate the transactions and receive network fees.\n\nBlock Time vs. Confirmation Time\n\nSometimes confused with each other, block times and confirmation times are two different measurements on a blockchain. Confirmation time is the amount of time it takes a blockchain to confirm a transaction.\n\nIt's often thought that a transaction needs six confirmations before it goes through; however, this is a misunderstanding. When a transaction makes it into a block, and the block is closed, the transaction has one confirmation and concludes. The number six comes from the belief that a transaction that was confirmed six times (included in six closed blocks) is secure from any network attacks.\n\nA block may be opened every 10 minutes on the Bitcoin blockchain, but not all transactions that occur within that period can be sent to the current block to be mined and confirmed. Confirmation can take up to several hours on the Bitcoin blockchain because transactions are sent to a mempool, where they are queued in order of the amount of fees paid.\n\nUsers who want their transactions placed in front of others pay more than the average, while those who pay average or below-average fees must wait their turn to be sent to a block, verified, and confirmed at least once.\n\n\n\nHow Many Bitcoins Will Ever Be Created? Bitcoin has a limit of 21 million. There are over 19 million Bitcoins in circulation, and the number of Bitcoins created yearly halves every four years. This slows down Bitcoin creation over time.\n\nHow Many Ethereum Will Ever Be Created? Ethereum, unlike Bitcoin, doesn't have an upper limit on the number of coins that will be created.\n\nHow Do I Get a Bitcoin Block? You never actually receive a Bitcoin block since it is part of Bitcoin's framework. Instead, you receive a reward of bitcoin when your miner solves the hash and creates another block.\n\nThe Bottom Line\n\nBlocks are one of the structures used in a blockchain that store information. The time it takes to open a new block on a chain is that chain's block time. Block times differ from confirmation times, which can take several hours or days to complete.\n\nThe comments, opinions, and analyses expressed on Investopedia are for informational purposes online. Read our warranty and liability disclaimer for more info.\n\n\n\n"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTFBFQV9XM2NoMU5pcmpOZEdmVjVSTS1WM0lnOVFIWmxlZ1FhbFRuSWZMYVF3TU4zNHFxN0doaGFHN2ZIQmZWQjhRQmhCNGRGNXF6UzhGQ2VTeGVCaERVQk5ydnNzSWx4YVFsVXJpWDdFbnJ1ZmtiLTNtazdHdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Optimistic Rollups vs. ZK Rollups: Which Is Better? - hackernoon.com",
        "content": "Today, we’ll differentiate between ZK Rollups and Optimistic Rollups, famous Ethereum Layer 2 protocols that help boost speed and lower costs.\n\n\n\n\n\nBut first, let’s define rollups.\n\nWhat are Blockchain Rollups?\n\nBlockchain rollups are scaling solutions designed to scale slow and expensive blockchains like Ethereum.\n\n\n\n\n\nRollups process transactions on another, faster blockchain called Layer 2, then bundle them up into groups or batches and submit them to the parent blockchain (Layer 1) instead of sending each one individually.\n\nThat way, the cost of that transaction is split across many users.\n\n\n\n\n\nAlso, their time is saved because they don’t have to wait and pay for each transaction to process independently on Ethereum.\n\nTherefore, users can benefit from the speed and cheapness of the roll-up while also benefiting from the security of the main blockchain.\n\n\n\n\n\nTo make it more transparent,\n\nEthereum processes around 15-30 transactions per second (TPS). That's like handling 54,000 - 108,000 transactions in an hour.\n\n\n\n\n\nNow, imagine this:\n\nWhen loads of people try to transact, only the top 54,000 - 108,000 transactions get through due to congestion, causing high fees and slow verification.\n\n\n\n\n\nBut what if we had an \"express lane\" for Ethereum transactions?\n\n\n\n\n\nThis lane gathers up lots of transactions, say 10 thousand, and bundles them into a single package. Then, this package gets submitted onto the Ethereum network as one transaction.\n\nSo, one move represents a group of transactions, easing the congestion and boosting TPS.\n\nWith this, Ethereum could process over 10,000 transactions per second.\n\nThis is the ideology behind rollups.\n\n\n\n\n\nNext, we’ll look at the two main types of rollups.\n\nTypes Of Rollups (Optimistic vs. Zero Knowledge)\n\nThe difference is how they verify transactions before posting them to the main blockchain.\n\nLet’s start with Optimistic Rollup.\n\nFor Optimistic rollups, they assume that all the transactions contained within a rollup are valid unless proven otherwise using a fraud-proof.\n\n\n\n\n\nTransactions are grouped off-chain into a batch and processed off-chain by a set of validators, after which they are submitted to the main chain in a compressed format.\n\n\n\n\n\nBut here is the exciting part:\n\nNetwork users can dispute fraudulent transactions before they are submitted to the main chain to ensure that this batch of transactions is not manipulated.\n\n\n\n\n\nThis is termed the “challenge period,” during which anyone can submit evidence or fraud-proof to prove a transaction is invalid. This lasts for about a week.\n\n\n\n\n\nIf no evidence is submitted, the batch is considered valid and is added to the main blockchain.\n\n\n\n\n\nOn the other hand, if evidence is submitted, the dispute is resolved through a dispute resolution process, and the batch is either accepted or rejected based on the procedure's outcome.\n\nNext is the Zero Knowledge (ZK) Rollup.\n\nZK rollups do not assume the validity of the submitted transactions.\n\n\n\n\n\nInstead, they use a sophisticated cryptographic technique known as Zero-Knowledge proof to verify the legitimacy of transactions before submitting them to the main blockchain.\n\n\n\n\n\nZero-Knowledge Proofs are a type of cryptography that allows someone to prove that they know something without revealing what the thing is.\n\n\\In the case of ZK rollups, “the thing” that is being proven is that the transactions in a rollup block are valid without showing all the transaction details.\n\nLike other rollup solutions, ZK Rollup begins by grouping multiple transactions into a batch or rollup block.\n\n\n\n\n\nNext, it uses mathematical algorithms to generate validity proofs for each transaction within the batch.\n\nInstead of submitting all transaction details to the main blockchain, it submits only these validity proofs.\n\n\n\n\n\nThese validity proofs indicate that the transactions have indeed occurred and are valid.\n\nIn addition, the validity proof allows anyone to confirm that the transactions within a rollup block are valid without revealing any information about those transactions.\n\nBut Which is Better of These Two?\n\nLet’s look at their strength and weaknesses under these four categories.\n\nTransaction Validity time Security and Privacy Gas Fees and Implementation\n\n\n\n\n\n1. Delay in Transaction Validity\n\nOptimistic rollup transaction verification can take a week because of how fraud-proof works.\n\nThis means that users' funds take up to a week to be reversed during the challenge period if the transaction's validity is questioned.\n\n\n\n\n\nOn the other hand, ZK rollups eliminate the need for a challenge period.\n\nThis enables users to withdraw their funds promptly and without any waiting period.\n\n2. Security and Privacy\n\nCompared to Optimistic rollups, ZK rollups offer improved security and privacy by verifying transactions through validity proofs.\n\n3. Gas Fees\n\nZK rollups typically have higher gas fees as they require more computational power than Optimistic rollups to generate validity proofs.\n\n4. Implementation\n\nZK rollups are generally more complex to implement than Optimistic rollups.\n\nThis is primarily due to the cryptographic techniques and computations in generating and verifying Zero-Knowledge proofs.\n\nIn addition, ZK rollups are limited to supporting specific use cases, such as swapping NFTs or transferring coins.\n\n\n\n\n\nHowever, there is a new type of ZK rollup called zkEVMs.\n\nzkEVMs are a new type of ZK rollup that is EVM-compatible\n\nThis means that they can be used to run Ethereum applications.\n\nFinal Thoughts\n\nBoth Optimistic Rollups and ZK Rollups are promising scaling solutions for Ethereum.\n\nHowever, they have different strengths and weaknesses.\n\n\n\n\n\nOptimistic rollups lead the way regarding reduced complexity and lower gas fees.\n\nTwo of the leading layer 2 blockchains that use optimistic rollups are Arbitrum and Optimism.\n\nOn the other hand, when it comes to security, scalability, and privacy, Zk rollups take the lead.\n\nSome of the most prominent layer 2 blockchains using ZK rollups are Polygon zkEVM and zkSync.\n\n\n\n"
    }
]