[
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMi1gFBVV95cUxQMFlnb0JVZDl3Y2trNWZBWEdzUkNLV2MzcndXYktmSEJwT2ZWVWVkTlZ0aW1wbm1FckRNUkVWZnV6SUZWTHVaNVlpbmlTOHpUNWlrajZJcW9rSjFUX25DVmctS0VhY2dhVWxvN1NOQVhMbm05c3o1ak9PbXd3U2I4ME5iMTBqdUR4Q3JpUVBfZXl4UV81d2xuTjdCc21fRTBlQVU0OFZQckV1SzM4RWhXNGVDTkZkR0hWVW1BMWxWWVpZZXdrTkRsdkJ0WHpOYVJjYmt6YXB30gHbAUFVX3lxTE9uSUFod2xrNkhKWVhOVEFWaFY4WWFuYlZyd3lfYl9RaFZMbEYxeVdKUVlPaENseWZHc0NxbHdPeEphM1pNOU84SGJtSmR6cjBEQzJycE9NcFBhYm9taDFLZHVXdFEwYWx1bnZDamFGQjVOdXFBT2cyMzg2YmxjVGhvMmE0UVRmU0l1TG5mSTd2Z2JRVUZfY0NXdzVLVlpPbFZMNl9aWHpZQzc1SjBMbFoySGppd0pQaTN1elJmSVlqd2xJTFhhOC1pMW1BZzNieTk0NV9wSWNJYkctMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Layer-2 Crypto Project’s Token Soars Over 260% in a Week Amid Launch of a $425,000,000+ Ecosystem Fund - The Daily Hodl",
        "content": "The native token of a little-known Ethereum (ETH) scaling solution has soared by triple digits amid the announcement of an incentive program.\n\nEthereum layer-2 Metis (METIS) is up nearly 20% over the past 24 hours and up 261% in seven days from December 20th’s opening price of $25.67.\n\nMETIS is trading at $92.58 at time of writing.\n\nThe explosive rise in the token’s price comes a little over a week after the Metis crypto project announced the launch of the Metis Ecosystem Development Fund (Metis EDF).\n\n“The Metis Ecosystem Development Fund (Metis EDF) is a 4.6 million METIS fund dedicated to accelerating adoption in the Metis ecosystem. The Metis EDF will be used to fund grants for new project deployments, product development for existing DApps, Builder Mining rewards, sequencer mining, and more.”\n\nAt the current price of $92.58 per METIS the fund’s allocation is currently worth nearly $426 million. The Metis Ecosystem Development Fund is expected to commence disbursements in the first quarter of 2024 and the funds will be distributed over the course of a decade.\n\nThe lion’s share of the funding, 65.4%, will go to sequencer mining while 34.6% will be allocated to ecosystem funding. Sequencer mining is the process by which various parties stake their tokens to earn mining rewards while assisting in block production.\n\nAmong the potential beneficiaries of Metis EDF’s ecosystem funding include sectors such as decentralized finance, Real World Assets tokenization, decentralized identity and privacy solutions, blockchain gaming and metaverse applications and prediction markets.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxQUmIteGlBTXhscXg0NFdJSmFENFJacVYxYnFUMnVZX1k5ckh2SWdrOWp6XzdlZFY4d2wxaUplNGhZaURDMjcxWElGWWN4WENLRTdUTkdPekl6cE5STnVKaE1EU1N3MkFTeG5IYnUzWHR5d2l4TEpXQWlIVjc1Zm9ZZlplRWFuZ9IBiwFBVV95cUxQS2RjX0Jnajk1US1CcGk0V3ZCdGMtUTlFNFhkVzlkUU9nM1VOZWxWcS1CVU5HaC1CazdSY25iaXdLT3BxaUtLYkctRjFzMnpPZWtHR1BTeVNMYkw2blNJVFBONG8zd053QmNqUUtwVEZHMFQxU0p4c0NMRnFDOFpRTzdzUkljSnI1VDc4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Dec 2023 08:00:00 GMT",
        "title": "New Ethereum (ETH), XRP and Solana (SOL) Pairs to Go Live on Binance - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nIn a bid to enhance the user trading experience and provide a wider array of choices, Binance has announced the launch of USDC-margined perpetual contracts for popular cryptocurrencies such as Ethereum (ETH), Solana (SOL) and XRP.\n\nAdvertisement\n\nThe introduction of these new trading pairs with up to 125 times leverage is set to go live on Jan. 3, 2024, at 12:30 p.m. (UTC). This move follows closely on the heels of Binance's recent addition of XRP and ADA trading pairs against USDC, showcasing the platform's strategic maneuvers and a notable return of the stablecoin to its ecosystem.\n\nTo celebrate the launch of USDC-margined futures contracts, Binance Futures is offering a 10% promotional trading fee discount on all trades within the specified period. The promotion period is from Jan. 3, 2024, at 12:30 p.m. (UTC) to April 3, 2024, at 12:30 p.m. (UTC).\n\nAdvertisement\n\nFor users opting to pay their trading fees with BNB on the Binance Futures platform, the 10% promotional trading fee discount for USDC-margined futures contracts will be an additional benefit on top of the existing 10% BNB fee discount. This double discount provides added value for BNB users, encouraging further engagement with the new trading pairs.\n\nBinance’s regulatory landscape and delisting decisions\n\nThe expansion of trading pairs and the reintroduction of USDC come at a time when Binance is navigating increased regulatory scrutiny.\n\nRecent delisting decisions, including spot trading pairs linked to the British Pound (GBP), such as ADA, BTC, DOGE and XRP, reflect Binance's efforts to streamline operations and comply with regulatory requirements.\n\nThe ongoing investigations by the U.S. Department of Justice (DOJ) and the SEC have created an atmosphere of uncertainty, prompting the exchange to make strategic decisions to ensure regulatory compliance. Traders and enthusiasts alike will be closely watching how these developments unfold in the coming months."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMibkFVX3lxTFBrcWZKS1M5MHhTRFd6WFdzNTFoaW9TVTlCWEYyWnhsaWFlZWl5NWQzbGpPUHFtN3NxYmZCSWZSa2NVRXZQeGlhckdEUDdxVU85SDgwb2FlTGIxTF8xZmI3dXI3dnVmQnFHR3JRV1R30gFzQVVfeXFMTnV3RV8yMkNsRU5QdkMwcUhGR1pZZl84elJKMVNsbU9ySUVDV1h3TmNTSkY5QnFYNDF4SU5jY0dqMWNBWFdRblQ1Y3BuMmhCTXdySFVZbU81SWp6MXdyUGZUOGJ1enlnbk5mVmlOR0k2cVNDMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Dec 2023 08:00:00 GMT",
        "title": "Ethereum Founder Vitalik Buterin Shares Thoughts On The Current State Of Web3 | Bitcoinist.com - Bitcoinist",
        "content": "In a recent blog post titled “Make Ethereum Cypherpunk Again” the founder of Ethereum, Vitalik Buterin has expressed his thoughts on the current state of the Web3 ecosystem.\n\nEthereum Founder Voices Concerns Over Faded Web3 Vision\n\nIn a blog post published on December 28, Ethereum Founder, Vitalik Buterin reflected on his past experiences from a decade ago where he witnessed Bitcoin’s steady adoption and integration into daily life activities. In this reflection, Buterin highlighted the transformative vision he visualizes of the Web3 ecosystem.\n\n“The reason why I bring these memories up is that they remind me of a deeper vision underlying crypto: we are not here to just create isolated tools and games, but rather build holistically toward a more free and open society and economy, where the different parts – technological, social and economic – fit into each other,” Buterin wrote in the blog post.\n\nWhile maintaining a positive perspective of the Web3 ecosystem, Buterin acknowledged that the vision for the Web3 space has become somewhat diminished. He noted that the vision had begun fading into the background since 2017.\n\nThe Ethereum founder highlighted several reasons for his statement, with the foremost factor being the rise of transaction fees, which he identified as the number one culprit for the fading Web3 vision.\n\nButerin explained that when the cost of writing to the chain was $0.001 or $0.1, many individuals would actively engage with blockchains. However, as transaction fees rise to $100, a specific audience, the degen gamblers remain willing to pay the substantial cost.\n\nButerin pointed out that when degen gamblers become the predominant users of the chain, it alters the perception of the public and adversely affects the internal culture of the crypto space.\n\nHe also revealed that “there is a large ideological rift where significant parts of the non-blockchain decentralization community see the crypto world as a distraction, and not as a kindred spirit and a powerful ally. In many countries, people do use cryptocurrency to send and save money, but they often do this through centralized means.”\n\nETH price at $2,372 | Source: ETHUSD on Tradingview.com\n\nCypherpunk Future Achievable Amid 2023 Development\n\nIn his blog post, Buterin highlighted several positive developments made in 2023 that could facilitate the development of a cypherpunk future for the Web3 space.\n\nSome of these developments include the existence of Blockchain Rollups which are special Layer-2 blockchains that process transactions off-chain. Buterin also noted the expansion of second-generation privacy solutions like Railway and Nocturne, alongside advancements in Zero Knowledge Proofs, a powerful tool used for enhancing privacy and security.\n\nConcluding his list of positive developments within the Web3 space in 2023, Buterin affirmed that these changes would create a great opportunity for the Ethereum blockchain.\n\nHe stated that the developments would “make at least a part of the Ethereum ecosystem actually be the permissionless, decentralized, censorship-resistant, open source ecosystem that we originally came to build.”\n\nFeatured image from Analytics Insight, chart from Tradingview.com"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxQMkZLMnByQkFnaGJ6Z0w2MVVIaDZTZUx1VGNhR2JyRE15MHozRWtXNVptWGZZcXRSQkk0UHJJOG1meHpLZ3ZkQlRUQ0pwX09KZjNCYVRRd3FLRnZEazZ5Snc0bk5iNjdCbUJNMzBoeWE2U3o1ZWhOUE9xZ0lzdTRNNzhaWWdQODduYXhSS9IBkgFBVV95cUxNamNNaVlZenlnSDRMSkNWeEJMeFRrU3l5OGg5WFQ0LWxwekVGT2k1aHE1MEc2SUpyZGUzUDV5ZnBkbzZ1M05rNlp6ZnUyczB5MWZ3TWx4aVRWYWJja2pLeDNId1dNZWZXT0cwaWlwVHhTcDF4dTBfZVVZZFBFYUgyaFAxR1FTWlNPV2F1elQxVWR3dw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Dec 2023 08:00:00 GMT",
        "title": "Vitalik Buterin Proposes Solutions for Ethereum PoS Complexity - CoinGape",
        "content": "Vitalik Buterin, Ethereum’s co-founder, recently outlined a trio of potential solutions to address a critical complexity issue in Ethereum’s proof-of-stake (PoS) consensus mechanism. His proposals, targeting the burgeoning challenge of managing digital signatures within the Ethereum network, were detailed in a post on the Ethereum Research forum. Buterin focuses on streamlining the process to require only 8,192 signatures per slot, simplifying and lightening the network’s load.\n\nVitalik Buterin Unveils Two-Tier Staking System Idea\n\nThe first approach Vitalik Buterin suggests involves the transformation of staking pools. By increasing the minimum ether required to run a validator, smaller validator operations would need to combine their resources. This consolidation aims to reduce the overall number of validators, thereby lessening the signature workload.\n\nadvertisement\n\nThis solution is about scaling down the number of participants and fostering a more collaborative and resource-shared environment within the Ethereum network. While compelling in its simplicity, this method raises questions about the impact on smaller validators and the potential centralization of power among larger staking pools.\n\nButerin’s second proposal introduces a two-tier staking system. This novel approach distinguishes between stakers with varying responsibilities and requirements. The two layers of stakers would be integrated differently in the block finalization process, with one layer shouldering heavier requirements and the other operating under lighter ones.\n\nThis bifurcation could create a more balanced system, where responsibilities and rewards are aligned with the capabilities and commitments of different stakers. However, this solution also introduces complexity in managing these two distinct groups and ensuring fair and effective participation from both.\n\nNew Ethereum Model Aims to Reduce Signatures\n\nThe final solution put forth by Buterin involves a rotating system of validators. In this model, a random set of validators would be selected for each slot, distributing the workload more evenly across the network. While this approach could effectively reduce the number of signatures needed, it introduces new complexities.\n\nThe random selection process must ensure fairness and transparency while maintaining network security and efficiency. This solution balances reducing the signature burden and maintaining a diverse and decentralized pool of validators.\n\nEach of these proposed solutions by Buterin comes with its advantages and challenges. The central theme in all three is the balancing act between reducing the signature workload and maintaining the decentralized ethos of the Ethereum network.\n\nRead Also: Ether Poised to Outshine Bitcoin in 2024, ETC Group Report Predicts\n\nMaxwell Mutuma Maxwell is a crypto-economic analyst and Blockchain enthusiast, passionate about helping people understand the potential of decentralized technology. I write extensively on topics such as blockchain, cryptocurrency, tokens, and more for many publications. My goal is to spread knowledge about this revolutionary technology and its implications for economic freedom and social good.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxNQldMQVNjS0dqbEZzV0Z3WVlHWVNFVkJzMEJVTVhVTEFNZ1NZeEhKRE5GWTZuQTNST3dVblo3WDFMdWhnSTFzWXFIdUc0NmlGY1lEdmVJWm1zU2xaSkRCcDdsQlU1UTRCdUFHV1dLSXhIMjdOQ2s3ZkFlWXlJYUIwM3RKMU5yLXRFd0ZGRkhzVmlVd3ZlZGNFemYtNFM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Dec 2023 08:00:00 GMT",
        "title": "L'innovazione di Ethereum: le migliorie alla proof of stake - The Cryptonomist",
        "content": "The world of cryptocurrencies is constantly evolving, with Ethereum (ETH) standing out as a pioneer in the field of proof of stake.\n\nRecently, ETH has recorded an increase of 6.77%, a positive signal for investors and industry enthusiasts.\n\nThis development can largely be attributed to the proposal by Vitalik Buterin, co-founder of Ethereum, to simplify the proof of stake (PoS) consensus mechanism of the platform.\n\nThe problem of complexity in Ethereum’s proof of stake\n\nThe heart of the matter lies in the intrinsic systemic complexity of Ethereum’s Proof of Stake (PoS) mechanism. Buterin has identified a critical node: the management of digital signatures. Validators, responsible for the network’s operation, must produce a high number of digital signatures.\n\nThis process, already burdensome, becomes even more burdensome with the increase of validators, leading to system overload.\n\nFuture implementations could even further intensify the signing requirements. The challenge is therefore not only to maintain, but also to optimize efficiency in a constantly growing ecosystem.\n\nAddressing this issue is crucial to ensure the long-term scalability and sustainability of Ethereum.\n\nThe solution proposed by Buterin aims to simplify the process without sacrificing the security and integrity of the network.\n\nButerin’s three proposals to simplify the process\n\nButerin outlined three possible solutions at the Ethereum research forum on December 27th. The common focus of the proposals is to reduce the number of signatures required per slot to 8,192 in the Ethereum blockchain.\n\nDecentralized staking pools: The first solution proposes the introduction of decentralized staking pools. This would involve increasing the minimum amount of ether required to run a validator, encouraging operators to collaborate and pool their resources. This approach could not only lighten the workload of individual validators but also promote an atmosphere of cooperation and mutualism within the Ethereum network. two levels of stakers: The second solution involves creating two levels of stakers: one with more demanding requirements and the other with lighter requirements. These two levels would be treated differently in the block finalization process. This structure could provide greater flexibility and accessibility for different types of participants in the network, balancing security and inclusivity. Rotating participants: Finally, the third proposal suggests the adoption of a system of rotating participants, where a random set of validators is selected for each slot. This system would distribute the workload and reduce the total number of signatures, but it would add complexity to the system. This method could improve fairness and decentralization, ensuring a more even distribution of responsibilities and rewards among participants.\n\nConclusion\n\nButerin’s proposal represents a significant step towards a more efficient and effective implementation of the PoS mechanism in Ethereum.\n\nBy reducing the complexity and workload of validators, Ethereum could achieve greater scalability and security. It is clear that the future of Ethereum, with its transition to the proof of stake model, still holds many innovations and potential improvements.\n\nIn addition, this evolution highlights Ethereum’s ongoing commitment to finding solutions that not only improve network performance, but also contribute to greater decentralization and democracy in the world of cryptocurrencies.\n\nButerin’s vision for a leaner and more robust system could prove crucial in the evolution of the cryptocurrency industry, marking an era of new possibilities and applications."
    }
]