[
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxNaVdJYjE4cjJSaTBMOTFTb215ZkdoMFo5OUI2b2Q2STZyeWhzdEJib1N2VFkwbDNKVUtZZjdrUXdpdXI4WjhKdVkxX2lsRlV3U25LNjhHdmlrOXBuTjlHcFdYSlNPbEU5UzNmQzBheG1NNVE2cFpSZTg3VXdwVVM2MUZ6RDlOM2xJLTI0b0hjM21zS1I5dmJhMzgtNlFySkg4MmtZdFNkMEViYkpYSEZ5NdIBtgFBVV95cUxNNDREVUs1d3lScjkyRFA4U2ZLSXJxbk42ZHFFVHR5cURvenQyeF96NldHYTlTMjdDTm42blNNWjduRkdyLW5QaGw4TG9WUlM3eDJyVi1KRlhELUpRWXYwbzFTaGFsWUV5c3ZaR1VVTU9TZDhsdjVranlxTDFaNFdNR3N1WF8yc1dGTHdCbzNvb3VLTkg1TTRkOE5zUmpQWEZESmRFTlZNQm01UlVWaHRyeG9seTBGUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Nov 2023 08:00:00 GMT",
        "title": "Near Foundation and Polygon Labs Collaborate to Build ZK Solution - CoinDesk",
        "content": "“We are proud to collaborate with Near on this exciting research initiative to further drive the development and adoption of ZK technology,” said Sandeep Nailwal, co-founder of Polygon. The zkWASM prover maximizes developer customizability, which means projects will be able to select from a number of provers when building with Polygon Chain Development Kit (CDK), whether that’s launching or migrating an EVM chain, or building a WASM chain for closer Ethereum alignment and access to liquidity.”"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxONmNFZFptZ25LYkZuU3VoYVI3N3RWZ2NqTXduR0ZFQ08zbVlXcWhCcW5MZEhoZDNXbm5wOXVvT3ppSklwZ21sSnhhMW9SMG43eFplYXZVTjNjRXJOYWJJMzZIQTMzODFUREhfWUxJUGd3eEh4bHhkNlBFcndnNEJCTzJneGdoZHJPV1lkeVNfVE9EdlJHU0xGMTVn0gGfAUFVX3lxTE1lSXZuZGlPUDhhRUh3cW5zQWpGUWxwYU9MakFKeUNOZjBwSjc5eHI5QllIR0pTNHJWWGRSWER5N1d0VlBiREd0LUJ0QkM0bVc1TG1EcGthaHM4eml0VkV2aTNMOFdIQUFIMm5sOU05eVVHRDJIc1pOYkNDZmlvSXR0MGI5Mk9qelY2QW5Pb0pLbjd0TVFoQ2Y5RHFaUWREVQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Nov 2023 08:00:00 GMT",
        "title": "The Protocol: Kraken Awakens – as Ethereum L2 Candidate - CoinDesk",
        "content": "CELESTIA POSTSCRIPT: Rarely are blockchain projects alone in the pursuit of hot new ideas. That's true of the au courant rush by various efforts to provide \"modular\" solutions for handling the various tasks of a blockchain, including the job of \"data availability,\" which involves managing growing reams of data and efficiently providing it to users or applications when requested. The data-availability network Celestia dominated the headlines last week, especially with the buzzy airdrop of TIA tokens garnering interest from crypto traders. This week, a rival project, Avail, announced a new incentive program on a test network to encourage early adopters to \"battle-test our code base.\" And Near Foundation, hosting an annual conference this week in Lisbon for the layer-1 blockchain NEAR Protocol, announced its own plans to offer a data-availability network for the Ethereum ecosystem. Despite the interest from solutions providers, early usage of Celestia appears to be modest so far. Galaxy Research's Christine Kim wrote in a newsletter on Nov. 3: \"Now that Celestia has launched, the true value of the protocol will come from the rollup ecosystem that is created over the next few months and years on top of Celestia. The adoption of the rollups built on top of Celestia will dictate the revenue and long-term success of the protocol, and ultimately, prove (or disprove) the blockchain modularity thesis. \""
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMi2wFBVV95cUxQcUp5cmFyZGY5eVlxak5EQjdMcl9vUHVMMDRDMnN2QkdhMUdaQWlSTEFrM29HY2VDUnRBZHJ1Mks3QWhpR2hCTWpnYmVhdEl2STdXQVJHQmNfNUxyNTlfS2JzeFZCM1ZLaWV2aGJ0SFJIdDRpZTg5LVI1MDMxX2xldjRCMEUyV1doV3lWQ2R6R3NVRHBhVXJFUElGd0NsVmpyYnBTenRIQzRtbGx6WlhDa3h5YzYwcjVBaTUtZTA0QzZUSTdheWFBdk8yNmh3UmJXTk1jQl9kOGRGZmvSAeABQVVfeXFMUHdDTVBUbXkwbkpvRkZ6T21hdWlUem9rTmduOG5JNm9jZ1o0MTlBS1NnVzJfMkZ5R2NHZmN4NVJEUjFaaFJyaG04NVVTd1FqZ3ZHd2c2VlpoUzVMQ054TERYLWZxOENGdUJ2bVN2bzJzVmJDS3lEU3FYOFpFSk1FdzUzU2tKYXdhMktzV1pfMVNwaEJYOVNEaTlpX2pTQjBRRlQ1UTJ4MFRWblRPQnZFZEFNZHB6NW9yWUgzSHlpSGtaR3A2S0c3X2p4Y0hwa3h6YWo3aC1zcUlWbnV2NGFEYW8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Nov 2023 08:00:00 GMT",
        "title": "Top Trader Says No Resistance for Solana Until Well Above $100, Unveils Forecast for One Ethereum-Based Altcoin - The Daily Hodl",
        "content": "A crypto trader who accurately called Bitcoin’s (BTC) 2018 bear market price floor is predicting Solana (SOL) will easily soar beyond $100.\n\nPseudonymous analyst Bluntz tells his 226,000 followers on the social media platform X that the Ethereum (ETH) competitor Solana will likely increase by more than 218% from its current value after a long accumulation phase.\n\n“These high timeframe accumulation breaks after 90% drawdowns are the things dreams are made of. No high time frame resistance in my opinion until $137 on SOL.”\n\nHe also says that Solana is showing bullish momentum after breaking out of a downward channel.\n\n“SOL baby let’s go. LTF (low time frame) accumulation and channel breakout.”\n\nSolana is trading for $42.95 at time of writing.\n\nThe trader also weighs in on the liquid-staking service provider Lido DAO (LDO). According to Bluntz, the LDO against Bitcoin (LDO/BTC) pair may have already carved a cycle low.\n\n“LDO/BTC from inception. Trying to keep a level head about it and not get carried away, but good chance this is a cycle bottom against BTC.”\n\nLooking at LDO versus the US dollar (LDO/USD), Bluntz says that the pair is flashing a bullish setup on the four-hour chart.\n\n“LDO consolidating above the prior high, gearing up for the next markup in my opinion. I really like this setup. LDO/BTC ended up closing the week as a very nice engulfing as well.”\n\nLDO/BTC is trading for 0.0000555 BTC ($1.97) at time of writing.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxOM2xHbTJxMFl3TkwzSmlpczZkRTJ0RDNGSkRtREhpekhvVmFvcGpVeGNFRGdWc212OFBWR1hwaF82ZWJSbXVnNHpXZkozZUlqRGlvalVfc1c3RGdHZjFiMzh4QmlseWlMZTh6dDhoeWZmR3lnMGN2NjFsMnNoWmFQZ1R3TnZ6TkVkVVRnMkx0VjdYZDQ0NUhwOHJB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Nov 2023 08:00:00 GMT",
        "title": "Unmasking Owner of Ethereum Wallet with 250,000 Lost ETH - The Crypto Basic",
        "content": "Investigations have uncovered the mysterious owner of a crypto wallet that lost the keys to a $450 million fortune in Ethereum (ETH).\n\nAccording to Coinbase director Conor Grogan, the owner of this wallet is Rain Lohmus, co-founder of LHV Bank. The wallet contained as much as 250,000 ETH, most acquired during the coin’s Initial Coin Offering (ICO) in 2014.\n\nOne mystery solved: This address (which now holds $450M of crypto) belongs to Rain Lohmus, founder of LHV Bank Unfortunately he lost his keys and can't access these 100s of millions. If you can help him recover them somehow, he's willing to split them with you https://t.co/wYLAU9gKzb pic.twitter.com/0A1nIjFSyn — Conor (@jconorgrogan) November 6, 2023\n\n- Advertisement -\n\nRain Lohmus and Recovery Strategy\n\nLosing the keys to wallet addresses is not uncommon in the crypto ecosystem. Infact, according to a computation made by Conor, a minimum of 909,800 ETH with a valuation of over $1.73 billion remains lost on-chain. This accounts for 0.73% of all circulating Ethereum supply.\n\nOne distinguishing trait of Rain Lohmus is that he has chosen not to give up on the push to recover the asset. He has a strategy to power the recovery, but according to what appears as an interview excerpt shared by Conor, he wants as much help as he can get, from anyone.\n\nWhile he said he’s open to any offers from the public on how to recover the funds, he revealed his best plan is to build “Rain Lohmus” as an AI to see if his memories can come back to remember the lost keys.\n\nDaunting as this task is, the LHV Bank founder said he takes it easy on himself. Lohmus acknowledged the possibility of spending a decade trying to hack this challenge and achieving zero results. Based on this, he said he’d rather embrace solutions where he can get visible progress daily.\n\n- Advertisement -\n\nFor anyone who can help him recover the funds, Lohmus plans to split the funds as compensation.\n\nOnly Untouched ICO Wallet for Now\n\nRecently, we have seen some Ethereum ICO wallets coming alive, but Conor noted that in his research, the Rain Lohmus wallet remains the only address from this era that has stayed dormant.\n\nBased on previous discoveries, the wallet acquired $75,000 worth of ETH at the 2014 ICO and has never made a single transaction. The wallet, over the years, received an intriguing bonus worth $6.5 million just for HODLing, the earlier acquired ETH."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiXkFVX3lxTE5LR2lOeVh0eU16WGNXelp5LVRFc19JMWVsZmZ6cjM5Z3hndGE2MG1Cay1pU3ExUE5TSlBrTGNYajcxNFhVMERiYVlibzk3VDk4WTRqSDQ1ZGI2NDhlV1E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Nov 2023 08:00:00 GMT",
        "title": "Ethereum’s Justin Drake is unconcerned despite ether’s middling year pricewise: Q&A - Blockworks",
        "content": "When Ethereum’s “Merge” to proof-of-stake went off without a hitch last September, some felt the layer-1 was primed for a breakout. Speculation arose around a “flippening” and institutional investors waited in the wings.\n\nBut ether’s price did not end up meeting these expectations. NFTs tested new lows, and the bear market muted DeFi engagement. Bitcoin continued to outpace ether in 2023 — recently reaching dominance levels not seen since 2021. Meanwhile, institutional inflows are largely yet to materialize.\n\nBlockworks spoke with Justin Drake, a researcher at the Ethereum Foundation, about the network’s current standing and future prospects. Keep reading for more excerpts from Blockworks’ interview with Drake.\n\nBlockworks: You can see variations of this stat in different places, but the rewards paid out by Ethereum were larger than the transaction fees that were burned in both September and October. It looks like that’s turned around a little bit, but how should people think about issuance versus burn and when that flips negative?\n\nDrake: The fee market is exceptionally volatile. What you really want to be doing is zooming out, because when you zoom out, you’re smoothing your data over a longer period of time.\n\nIf you look at ultrasound.money, you’ll notice that when it’s profitable, it’s like printing money. It’s really, really profitable. Ethereum has about a profit margin of 50% which is outstanding for a business. Now okay, on some days, especially weekends, it won’t be profitable. In some months, if you’re in the absolute depth of the bear market, then it won’t be profitable. But over a long period of time, it’s extremely profitable.\n\nBlockworks: How important is this deflationary aspect of Ethereum and Ethereum’s ability to generate fees? Because obviously Ethereum is not a company in the traditional sense where your revenues need to outweigh costs. So how should people think about revenue versus issuance? And how important is that metric as a way to gauge the success of the network?\n\nDrake: Broader than just as a company, some people think of ether, the asset, as money for the internet. And in that context, scarcity as a meme is extremely important. There’s this almost obsession with the 21 million Bitcoin meme precisely because it’s all about scarcity. And for the first time in history pretty much, we have money which not only has a fixed supply but actually has a decreasing supply.\n\nSo now there’s what I call memetic potential. Memes are ideas that spread. The 21 million meme is one that spreads far and wide because it’s kind of an attractive thing intellectually. There’s an opportunity potentially for this meme to spread that ether is the scarcest money on Earth. Its supply is going down over time.\n\nBlockworks: And who benefits from this meme?\n\nDrake: Ether the asset is the basis of two very fundamental public goods in any programmable blockchain.\n\nPublic good number one is economic security. We’re trying to build systems here which have a lot of longevity. We want to be in a position where it’s extremely difficult even for the most powerful nation-states out there to attack Ethereum.\n\nAnd then there’s this second really important public good for blockchains which is called economic bandwidth, and that’s the ability to be used as collateral within DeFi. Ether is especially valuable as collateral money because it’s the only so-called pristine collateral. Pristine means that there’s no contract risk. There’s no governance risk. There’s no oracle risk. It’s the one risk free asset.\n\nBlockworks: It sounds like you’re saying the idea of ultrasound money is a means to these larger ends that you described.\n\nDrake: Exactly. It’s a Trojan Horse, but ultimately the value is utilitarian through economic security and economic bandwidth.\n\nBlockworks: Ethereum’s validator queue has been in the hundreds of people waiting to stake ether (ETH), and that’s down from tens of thousands over the summer and even into September. What do you make of this?\n\nDrake: The churn, which is basically the amount of validators that can be processed by the queue, is proportional to the amount of staked ETH. As the amount of staked ETH grows, the churn grows and it becomes easier and easier to clear the queue. And so in that sense, looking at the queue is kind of a totally irrelevant game. The fact that the queue is very low just means that ether is very efficient at processing deposits.\n\nThe better metric is what’s called deposits. Every single day on average, there’s 40,000 ETH coming in, which is a huge amount of money.\n\nBlockworks: How concerned are you about staking yields being down?\n\nDrake: I mean in a way, the lower the better, right? Because it means that we’re not spending as much to secure Ethereum. Ethereum is already extremely secure.\n\nThe security ratio is the value secured by Ethereum, which is all the ETH, all the NFTs, all the ERC-20s divided by the value securing Ethereum, and it’s 7.5, which is extremely healthy. If we were to have more staked ETH, this ratio would keep on going down. But there’s no real need for that. And so having more staked ETH in the way is wastefully paying for security.\n\nBlockworks: Post-Merge, there was a lot of excitement about Ethereum. In 2023, ether’s price has gone up, but especially compared to bitcoin, not as much as some had predicted. Why is that?\n\nRead more: The flippening: Will ether flip bitcoin in the next year?\n\nDrake: What tends to happen, generally speaking, is that during bear markets, dominance of bitcoin goes up, and then during bull markets, it drops down precipitously and then it reaches a new low, so this is all standard behavior.\n\nWhat I’ll say is that bitcoin dominance hasn’t grown as much as what would have been expected in the bear market. So I think expectations were unreasonable thinking that during a bear market, ether will outperform [bitcoin].\n\nThis is all speculation, but my guess is that there will be a flippening in the next bull run.\n\nInterview responses were edited for brevity and clarity.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    }
]