[
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxPYnRkZWw5ckhTMWpBMnJqU25zOFJQLWhnQkNLU0FFakJvYXRhbmFsMGVaUUgxMVpEd2cwVGtMUUNVam9DUHdIYUV2MkJRZlJvbHdLcGxOYlhNTS00Sy03ODBNM2g2c29NaEllZFVYakRDcUN5ZE5NUFJReEt2TnZrVDBOemJQeTNvcy16MmxuM3PSAZgBQVVfeXFMTzA5VVN0Sl9paWtCM19rZlpDVUw0a0htZkpqYVRhLTJtUVZnZzVqYnZVVjdKUGc2eE4wQnZZZ2NYcE03bU1xa213UnUxeUJWLVgxVDdySTRRNTk1eTZ4VmUtVGdqMEpzQXVCTWJmVTdQdVZHU3VaY3Jod0dCZkpxeXRBMEJZQUVVV01fcmQ4aW5hbkVJVk5KcWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Nov 2023 08:00:00 GMT",
        "title": "How to Claim the Pyth Airdrop for Ethereum, Solana, Aptos Users - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nDecentralized finance (DeFi) oracles network Pyth will kick off an airdrop of roughly 255 million PYTH tokens to its users and community members beginning in just four days, the network announced Thursday.\n\nOver 90,000 wallets will be eligible to claim PYTH tokens through the airdrop once it opens on November 20 at 2:00 pm UTC, according to Pyth. Users of dapps that rely on Pyth network data across 27 blockchains—including Ethereum, Solana, Aptos, Polygon, Arbitrum, Avalanche, and Optimism—may be eligible for a token allocation, according to the network. Pyth Network Discord administrators and holders of Pyth NFTs are also likely to receive an allotment.\n\nThe Claim Process for the Pyth Network Retrospective Airdrop will open on Monday, Nov 20 at 2 PM UTC. Stay tuned for more details on instructions on how the Claim Process works. Additionally, the Claim Process will be available for 90 days. The Airdrop Claim Page will be active… — Pyth Network 🔮 (@PythNetwork) November 16, 2023\n\nAD\n\nAD\n\nAfter November 20, the airdrop will remain open until February 18. DeFi users can check their potential eligibility for the airdrop, as well as the amount of PYTH they are set to receive, at the network’s airdrop check page.\n\nPyth users in several countries, however, will be ineligible to participate by default, due to mitigating legal factors. Residents of the United States and the United Kingdom will not be able to claim PYTH tokens; nor will residents of North Korea, Ukraine, Cuba, Syria, Iran, Yemen, South Sudan, the Democratic Republic of the Congo, and eight other nations and territories.\n\nPyth’s native token will have an initial circulating supply of 1.5 billion, according to the network. 8.5 billion additional PYTH tokens will unlock between six and 42 months from launch.\n\nDeFi oracle networks like Pyth connect blockchains with data sources from the off-chain world, allowing DeFi smart contracts to execute based on inputs and outputs from real-world events and data. They can enable smart contracts, for example, to automatically order products when an inventory drops; to pay out agreements that hinge on the price of stocks and commodities; or to track carbon emissions and tax a company if a certain level is exceeded. Oracle networks are central to the growing integration of the crypto market and traditional financial markets, as well as the application of smart contracts to traditional businesses.\n\nAs intermediaries of information, oracle networks can also be exploited. Last fall, a hacker managed to drain $100 million from decentralized exchange Mango Markets by manipulating the oracle-reported price of the MNGO token.\n\nAD\n\nAD\n\nPyth is the fourth-largest such oracle network by total value secured, according to DeFi Llama; Pyth’s chief competitor, Chainlink, boasts over nine times the value secured, and a dominant 45% market share, compared with Pyth’s 4.83%.\n\nEdited by Stacy Elliott."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxQbTZQY1lKRGUydFNHcFkxeVZNMFFYbGdiZGNLMThNQUpPLVVDM1lTT2NTdmFDQ3FLMUhUZVhiV2w5WjJJdEFGMjRudThwY1dqOXlDMjh6X1V2dS1tbUtWMmtrYlMyUmR3YUJUeDJOMGJqT2o2V0VsajNzMFh6SFo1TnZKTEowdlQ0eGdGbkg1UEpnamxL?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Nov 2023 08:00:00 GMT",
        "title": "JPMorgan Chase, Siemens, and FedEx show that blockchain finance is more than a buzzword - Fortune",
        "content": "Innovation is a funny thing. It often arrives with an excess of hype and then fades into disappointment—before reemerging in full bloom. A case in point is JPMorgan Chase’s “JPM Coin,” a corporate stablecoin launched shortly after the 2017 crypto bubble that seemed doomed to languish as a proof of concept that would never catch on in the real world.\n\nIn recent weeks however, the story around JPM Coin has changed dramatically as the bank announced that it is notching daily transaction volumes above $1 billion and that its big corporate clients are finally tapping into the coin’s promise to provide “programmable” money.\n\nIf you’re unfamiliar with JPM Coin, it’s a digital dollar that the bank created on a private version of the Ethereum blockchain. This means that clients with access to the coin (or ones like it) can enjoy the benefits of crypto technology—including 24/7 transactions and smart contracts—within a secure corporate environment. Well, that’s how it’s supposed to work in theory.\n\nIn reality, the past six years have been marked by a series of announcements involving banks and companies saying they’ve carried out a blockchain transaction—involving dollars or equities or commodities—and that’s been the end of the matter. While the transactions did occur, they didn’t really matter since they were mostly one-off events that didn’t lead to any changes in day-to-day commerce.\n\nThis has quietly begun to change, however, as companies have moved past the PR phase of blockchain and started tapping into its actual benefits. I spoke with Naveen Mallela, the head of coin systems (yes, that’s a title) at JPMorgan Chases’s Onyx unit, and he explained that the likes of Siemens, Cargill, and FedEx are all using these tools in daily operations.\n\nMallela told me that customers are viewing JPM Coin less as a stablecoin than as a tool to manage commercial deposits and take advantage of programmable money. I pushed him on that, asking what exactly he means by programmable. He explained that it means creating automated instructions for funds you control. A primitive illustration is autopay for bills but, thanks to blockchain, companies can now carry out far more sophisticated operations.\n\nMallela gave three persuasive examples of programmable money in action: companies using blockchain to carry out cash sweeps that used to happen once a day, but that can now occur anytime; finance firms using smart contracts to monitor and address margin calls for securities; and companies arranging for shipping payments to be released at various stages of a voyage.\n\nBy relying on smart contracts to handle these operations, companies can deploy cash and staffing resources more efficiently. And this is likely only the beginning. Mallela notes that IFTTT (“if this, then that”) instructions are becoming commonplace in the corporate blockchain environment and that companies will find more and more ways to use them.\n\nMeanwhile, programmable money is sprouting up in the investment sector as well—JPMorgan Chase and Apollo just launched tokenized funds in Singapore, while a startup called Superstate, founded by the creator of the popular DeFi protocol Compound, just raised $14 million to do the same in the U.S. All of this shows that while blockchain-based finance is still far from mainstream, it has quietly taken a giant leap forward.\n\nJeff John Roberts\n\njeff.roberts@fortune.com\n\n@jeffjohnroberts\n\nDECENTRALIZED NEWS\n\nBinance is launching a new crypto exchange in Thailand alongside Gulf Energy, a giant conglomerate run by the country's second-richest man. (Bloomberg)\n\nPaxos is launching a new USD-pegged stablecoin in Singapore after becoming the second company to obtain a key approval from the country's Monetary Authority. (The Block)\n\nThe SEC deferred on two more crypto ETF applications, including Grayscale's bid to launch one for ETH futures, though many predict approvals in January. (Bloomberg)\n\nArk's Cathie Wood plugged Solana on TV, helping to push the altcoin's price to three times what it was in January. (CNBC)\n\nBitcoin soared 6%, wiping out losses from earlier this week and returning the currency to just under $38,000. (Coindesk)\n\nMEME O’ THE MOMENT\n\nGary + Liz foreva:"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTFByMUR0Y2xXcXN1NC1SVmZiV3IyUW42Vmp3eDJQTFZFc0tTc05TWGpJWFQ1TldMSkphcnJ6bTd3WTJBV2hxUklNa1lxSTFBcFE2bXNYZllkTUdWY2U2OHRjTEh0MlFPU0libkVnRDZ4djk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Nov 2023 08:00:00 GMT",
        "title": "Ethereum won’t flip Bitcoin anytime soon, but Ordinals could change that - Blockworks",
        "content": "Bitcoin block space looks set to be the hottest commodity in crypto.\n\nBitcoin once again occupies more than half the entire crypto market, having outperformed ether by nearly double so far in 2023. Now, the long-prophesied “flippening” of ether over bitcoin is even further in the future.\n\nThe market currently values Bitcoin three times higher than Ethereum. Bitcoin’s market cap, at $727 billion, has swelled by $400 billion in 2023 — a figure bigger than Mastercard’s entire stock valuation and about twice that of Netflix’s.\n\nEthereum’s valuation has grown by $100 billion, jumping from under $145 billion in January to nearly $245 billion today.\n\nSome anticipate that Ethereum’s market cap will one day eclipse Bitcoin’s, despite the latter’s half-decade head start.\n\nThings were looking good coming out of the 2019 bear market and into 2021’s explosive bull cycle. DeFi summer and NFT mania boosted interest in Ethereum, at times driving up fees for certain actions beyond $250.\n\nBitcoin‘s market value was 925% of Ethereum’s — $130 billion to $14 billion — at the end of 2019 (bottom of the bear market).\n\nThat figure had shrunk to under 200% by the end of 2021 (peak bull market).\n\nBitcoin’s market value is now 300% of Ethereum’s.\n\nThe Bitcoin rally has widened the gap\n\nThe case for flippening has recently taken a hit by a different flip: The Bitcoin network now rakes in more fees than Ethereum for the first time since December 2020.\n\nOver the past four days, Bitcoin users have paid miners about $40 million to have their transactions processed.\n\nEthereum users, meanwhile, forked out less than $27 million ether (most of those fees have been burned, slightly reducing Ethereum’s overall supply).\n\nLayer-2 Ethereum networks Arbitrum and Optimism haven’t bridged that gap as they each generate less than $200,000 in fees per day right now.\n\nThe fee-flippening (flee-pening?) is awkward when you consider the sheer amount of use cases supported by Ethereum. Decentralized exchanges, DAOs, memecoins, NFTs, stablecoins, DeFi and GameFi all run atop Ethereum.\n\nRead more: Ethereum’s Justin Drake is unconcerned despite ether’s middling year pricewise: Q&A\n\nBitcoin, on the other hand, had for the longest time mostly had one application — bitcoin transactions. But the rate of on-chain transactions had until recently sustained very little growth since 2015. Perhaps due to its “digital gold” narrative and the rising ubiquity of alternative cryptocurrencies.\n\nOver the past five years, Ethereum users have paid $17 billion in fees, Bitcoin users just $2.9 billion\n\nAll that changed with Ordinals — a protocol for inscribing individual units of bitcoin (BTC) with unique data to create digital collectibles, first launched in January.\n\nMusic, text, art, video and even code for browser-based DOOM clones have since been inscribed to Bitcoin, resulting in an on-chain collectibles market worth thousands of BTC. Bitcoin users trade Ordinals as Ethereum or Solana users would trade NFTs.\n\nToday, anywhere from around a third to one half of Bitcoin transactions contain Ordinals, driving up demand for blockspace as well as transaction fees. At times today, “medium priority” transactions went for around $11 compared to around $2.30 for the same on Ethereum (more priority generally means faster processing), although those prices have since come down.\n\nTron comes in third overall for monthly fees, mostly thanks to stablecoin Tether\n\nSo is Bitcoin netting more fees than Ethereum good for Bitcoin? Maybe not.\n\nSome Bitcoin insiders worry the network isn’t properly equipped to handle Ordinals and potential influxes of interest in its original use case, BTC payments.\n\nThe CryptoKitties incident in December 2017 — during which a NFT game grew so popular that it spectacularly clogged Ethereum — first showed that Ethereum probably couldn’t handle serving as the “World Computer” just yet.\n\nThen, the 2021 bull market saw NFT mint costs soar to $250 at times — a reminder of how necessary it was to port activity to smaller chains, including rollups. Still, memecoins and low quality token projects ratcheted up fees beyond $20 earlier this year, drastically reducing Ethereum’s usefulness for non-critical tasks.\n\nThe NFT craze of 2021 made Ethereum block space the hottest commodity in crypto. Even while tanking its utility.\n\nOrdinals may end up having the same effect on Bitcoin, especially if demand keeps up and the bull market truly hits.\n\nAt that point, it would seem reasonable to value Bitcoin and Ethereum more similarly. It might just take another run.\n\nUpdated Nov. 16, 2023 at 4:25 pm ET: Corrected reference to percentages in bullet points.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiaEFVX3lxTFBHeDJkdXFhTnFua2ZFMmNrcFp6dldvai1SYUlBTzNIcUg1MFk2YlFrSXdvNE40S1Npb2tBeEhlTWRQWGt0NTFYcTdTQWhzQW1zWmtQbGVxbm4ybjgtME9iRmZEQnRnanBt?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Nov 2023 08:00:00 GMT",
        "title": "What Is Validium in Ethereum? A Beginner’s Guide - Unchained",
        "content": "Validium is an innovative addition to the suite of scaling solutions helping to solve Ethereum’s scalability challenges.\n\nValidium is a protocol that was introduced to improve scalability issues on the Ethereum network. In this guide, we look at what Validium is, how it works, and its benefits and challenges.\n\nWhat Is Validium?\n\nValidium is a Layer 2 (L2) scaling solution that leverages zero-knowledge proofs (zk-proofs) to verify off-chain transactions. Its primary goal is to enhance the scalability, privacy, and security of the Ethereum network.\n\nAt the solution’s core are sidechains or L2 solutions linked to but handling transactions separately from the Ethereum main chain. In this way, they move transactions off-chain and help ease transactional pressure on the Ethereum network.\n\nConsequently, users can enjoy faster confirmation times while moving more volumes. Furthermore, Validium significantly reduces gas fees due to the reduced computational overhead, as it doesn’t need to verify every transaction individually.\n\nHow Does Validium Work?\n\nValidium bundles sidechain transactions into batches and generates zk-proofs for each batch. Zk-proofs ensure the validity of the transactions and that the off-chain chain has been updated correctly.\n\nEvery sidechain has a validator responsible for aggregating transactions and generating zk-proofs, which are then submitted to the Ethereum mainnet for verification.\n\nIf the proof is valid, the verifiers update the mainnet record to reflect the changes that occurred in the sidechain.\n\nUse Cases and Applications of Validium in Ethereum\n\nValidium has several potential use cases and applications within the Ethereum ecosystem.\n\nDecentralized Finance (DeFi)\n\nDeFi protocols can use Validium to improve their efficiency and usability. For example, they can adopt the technology to create faster DeFi investment platforms with lower gas fees. This efficiency broadens the platform’s accessibility and enhances the user experience.\n\nGaming and NFTs\n\nValidium solutions can facilitate seamless in-game transactions and interactions with NFT marketplaces due to their low fees and faster confirmation times. This provides gamers and collectors with more enjoyable experiences.\n\nSupply Chain Management\n\nThrough Validium, manufacturers can set up more efficient and transparent supply chain management systems. They can track their consignments off-chain easily and cost-efficiently without overloading the blockchain with data.\n\nKey Benefits of Validium in Ethereum\n\nLet’s take a look at some of the key benefits Validium brings to Ethereum.\n\nEnhanced Scalability\n\nValidium can process thousands of transactions per second (tps), compared to the Ethereum mainnet’s 15-25 tps. This feature makes it ideal for high-throughput applications like decentralized exchanges and gaming platforms. Increased throughputs are crucial to Ethereum adoption as they guarantee timely transactions.\n\nPrivacy and Security\n\nValidium uses zk-proofs to verify transactions by allowing one party to prove to another party that they know something without revealing what the thing they know is. As such, zk-proofs provide an elevated level of security for transactions, ensuring that validators cannot cheat or steal user funds. Additionally, Validium improves privacy by excluding sensitive user data from the public Ethereum blockchain.\n\nLower Transaction Fees\n\nReduced computational overhead makes Validium settlements significantly cheaper than mainnet ones. This is a major benefit for users, making Ethereum more affordable.\n\nFaster Transaction Speeds\n\nDue to its off-chain processing, Validium operations are much faster than those on the mainnet. This is important for applications that require fast and reliable transactions, such as decentralized exchanges and gaming platforms.\n\nChallenges and Limitations of Validium\n\nDespite its benefits, Validium also has some challenges and limitations.\n\nCentralization of the Network\n\nUsers must trust the validator to process transactions correctly. This could lead to centralization concerns, as few validators could control a sizable portion of the network. Introducing a trusted third party contradicts the decentralization philosophy of cryptocurrencies.\n\nInteroperability and Compatibility\n\nIntegrating Validium with existing Ethereum smart contracts and protocols can be challenging due to potential data structure incompatibilities. Ethereum developers are working on ways to ensure seamless interaction between the mainnet and its sidechains.\n\nDependence on Data Providers\n\nThe technology relies on data providers to make off-chain data available. This dependence on them introduces an element of trust that runs counter to decentralization, a central tenet of cryptocurrencies.\n\nHaving external data providers also puts the data processed on the network at risk of hacking or unauthorized access by malicious parties.\n\nConclusion\n\nValidium is important in Ethereum’s journey toward scalability. Its ability to significantly improve transaction speeds, lower costs, and streamline operations is poised to redefine the network’s experience, with many developers seeking to integrate it into their products."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiZEFVX3lxTE4wbkpuWG5INW9YWXNXOU15U3JlNGRNT0tqNDRrdjJKRHRPbjRaZS1DOVJwblBydENpS1V1bzZDQ2VkQlVlYlNOZlVFZ1p0VHlqcWRubzJ2YmRHQjBnYmJQZ0lqekI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Nov 2023 08:00:00 GMT",
        "title": "What is Plasma and why is Vitalik Buterin into it all over again? - Blockworks",
        "content": "Ethereum co-founder Vitalik Buterin wants to bring back Plasma as a blockchain scaling solution that could sidestep existing data availability concerns.\n\nFirst created in 2017, Plasma networks can be considered “child” chains of the Ethereum mainnet. These execute transactions away from Ethereum using their own block-validation mechanisms, then periodically post final states back to mainnet.\n\nPlasma chains differ from popular scaling solutions such as Arbitrum or Optimism, which instead post computed data back to Ethereum mainnet, although it is compressed.\n\nIn the blockchain world, data tied to computational tasks — such as processing transactions — must be stored somewhere. When stored on-chain this process is often costly and time-consuming for network participants, particularly validators and other node operators.\n\nFull nodes on Ethereum mainnet — and there are roughly 11,000 of them active worldwide — download all the data of each block so that network participants can verify it. This redundancy make it difficult for invalid transactions to be mistakenly executed.\n\nAlthough great for security, the consensus process hinders scalability as it is inefficient and reduces throughput.\n\nWith Plasma, all data processing and computational tasks are kept off Ethereum mainnet — only final verified states are posted to the chain — and thus less data takes up Ethereum block space.\n\nThe problem with Plasma\n\nAccording to Buterin, Plasma was not considered by the current batch of roll-up solutions for its overwhelming costs around client-side data storage and its application limits. This made it difficult to build Plasma-powered apps which did more than simple payments.\n\nIn his recent blog post, Buterin discussed a previous Plasma implementation known as Plasma Cash. This system sees each individual coin as its own non-fungible token (NFT) with a unique history.\n\nOperators on Plasma chains create new blocks in the form of a root of a Merkle tree. This means that every time there is a transaction, the owner of that transaction can be found by stepping through the tree.\n\nIf an operator chooses to misbehave by publishing an invalid or unavailable block, the owner of that transaction will have seven days to cancel by showing that they are either not the latest owner, that there is a double spend, or that there is an invalid history. This can make for a clunky process in the real-world, Buterin explained.\n\n“If you receive 0.001 ETH each from hundreds of people who are buying coffees from you, you are going to have 0.001 ETH in many places in the tree, and so actually exiting that ETH would still require submitting many separate exits, making the gas fees prohibitive,” Buterin wrote.\n\nDefragmentation protocols do exist, Buterin said, but they are difficult to implement in practice. Further, it is difficult to apply the Plasma design to a generalized Ethereum virtual machine (EVM) as the design requires specific owners to object to false transactions.\n\nMany DeFi protocols on-chain, for example, do not have unique or individual owners, meaning that complex applications would not be able to work on Plasma.\n\nEnter zk-SNARKS\n\nButerin noted that concerns around Plasma can be resolved with the introduction of zk-SNARKS and validity proofs.\n\nZk-SNARKS, short for “zero-knowledge succinct non-interactive argument of knowledge,” enables blockchains to prove that information is accurate without revealing the contents of the information itself.\n\nSNARKS are the proof system, and validity proofs are cryptographic proofs which attest that the information is indeed accurate.\n\n“The largest challenge of making Plasma work for payments, client-side data storage, can be efficiently addressed with validity proofs. Additionally, validity proofs provide a wide array of tools that allow us to make a Plasma-like chain that runs an EVM,” Buterin wrote.\n\nValidity proofs will be able to prove that each Plasma block that is on the blockchain is valid — meaning that it will no longer be necessary to worry about who the last owner of each individual transaction on a Merkle tree is.\n\n“In a validity-proven Plasma chain, such withdrawals would not be subject to any challenges at all. This means that, in the normal case, withdrawals can be instant,” Buterin wrote.\n\nConsiderations\n\nAlthough zk-SNARKs and validity proofs can address significant problems with the previous Plasma design, Buterin reasoned, there are still limitations.\n\nThis is most clearly highlighted when a particular state object, such as a token, does not have a clear economic owner.\n\nButerin drew on the example of Uniswap liquidity provider positions: “If you traded USDC for ETH in a Uniswap position, you could try to withdraw your pre-trade USDC and your post-trade ETH. If you collude with the Plasma chain operator, the liquidity providers and other users would not have access to the post-trade state, so they would not be able to withdraw their post-trade USDC.”\n\nThis shows that although Plasma potentially offers useful solutions, there may still be concerns about bad actors, which should be addressed.\n\nDespite this, Buterin believes that Plasma remains an underrated design in the blockchain technology space and could help ease Ethereum transaction fees.\n\n“Rollups remain the gold standard, and have security properties that cannot be matched. This is particularly true from the developer experience perspective: nothing can match the simplicity of an application developer not even having to think about ownership graphs and incentive flows within their application,” Buterin said.\n\n“However, Plasma lets us completely sidestep the data availability question, greatly reducing transaction fees. Plasma can be a significant security upgrade for chains that would otherwise be validiums.”\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    }
]