[
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxQY3IxU3lwNEJEc2xIM2dUY3RMdnNyU2RRd2prWVFZTXJmbDBwWUNxci1QMDdUaG1CMVNzcUFCeGdyQ0xxa2VQSlV5a1JMay1BcmR6eVlncWVXSGFXM0p5NmEtanNDcWlxUGR6MzNNRVpielQ5T0xxZUFLd0d5WkwxY1VoVE5uVTdDZS1LWGNTYW8tNk10a2NKVXMzTzNZdEw5QjQ2QmFJakFWM0g1YXI4RUh5aUVBUzdvME9fc25TbXJSdkdpM1hFeC14MldRY3EtdEt4cXVLUFBjaTJtLW1wX2NTMWM1T0dj?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Bonk, Pepe Outstrip Gains Of Bitcoin, Ethereum Amid Searing Hot Rally — Beat Biggies Dogecoin And Shiba Inu In Trading Volumes - Benzinga",
        "content": "Memecoins took center stage on one of the best days for the cryptocurrency market, with the likes of Pepe PEPE/USD and Bonk BONK/USD turning out to be the highest gainers.\n\nWhat Happened: The market rallied on higher expectations of an Ethereum ETH/USD spot ETF approval by the SEC, resulting in the highest market cap growth in three months, according to Santiment.\n\nPrice Action: While the rally was spurred by developments around Ether, memecoins stole the highlight yet again, as popular coins like PEPE and BONK grew by 27% and 23% respectively, according to data from Benzinga Pro.\n\nEthereum ETH/USD-based PEPE rose to an all-time high of $0.000011, while the Solana SOL/USD-based meme coin BONK bumped to a two-month high of $0.000031. The rest of the meme coin market also reported significant gains.\n\nCryptocurrency Gains +/- Price (Recorded at 10 p.m. EST) Bonk BONK/USD +27% $0.000031 Pepe PEPE/USD +23% $0.000011 Floki FLOKI/USD +10.48% $0.000211\n\nPepe's trading volume surged to $2.16 billion in the last 24 hours, exceeding bigger coins with larger market caps like Dogecoin DOGE/USD and XRP XRP/USD, Bonk clocked a volume of $850 million, trumping Shiba Inu SHIB/USD\n\nWhy It Matters: The latest rally reflected a strong appetite for meme coins, the class of cryptocurrencies that has witnessed significant gains in the year.\n\nSocial analytics platform LunarCrush highlighted bullish social media discourse around the two coins, with 82% of all BONK posts, and 80% of PEPE posts being positively weighted.\n\nSuch degrees of optimism could potentially help sustain the rally for the two meme coins.\n\nImage via Shutterstock\n\nRead Next: Bitcoin, Ethereum, Dogecoin Shoot Up On One Of The Best Days For Crypto In 2024 Amid Ether ETF Approval Buzz: Analyst Flags ‘Robust’ US Investor Demand for King Crypto"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPTlV6c0JhcV93Y3pRR2NLVXcyOFVjMzNrVnJDc3RTTW9WZktOd29aclhHQ3hLVzNJamh6ZXJDV0N2OGEtbzJEOTdXQV9hVi1FR1QwWURncHZyR2FibUo5eUlGWjZGRzhDVHpORndUbnpBU0hVRE1hZExaWWZfSEJwMWRuRmR3c24t0gGQAUFVX3lxTE9ob09pNGFHQ3M0V0hHakJVSC1hUmthenZjenpfT25BXzNSelpJU0dQQVR3ak9CcDA1VDNtakNiZXNsU2NjTW9GWUVzcEpQWmRaUjFFcVpWRUNSSkRMdFpJUzhsRUJLanotcXllRW9ZUFJfY3RjeDhadHpWRXhnbUJ3czJvZVVQRGhVWVZBZF84Vg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Solana, Avalanche Soar as Ethereum Price Tops $3,500 - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin and Ethereum are up big today—with the latter soaring on rumors that an ETH-based exchange-traded fund (ETF) could soon hit the U.S. market.\n\nThe price of Bitcoin touched $70,000, triggering a flood of liquidations, while ETH is trading over $3,500 as of writing. But the top two coins by market cap aren't the only ones seeing big gains. The entire crypto market is up, with Solana and Avalanche the top gainers.\n\nSolana, the fifth biggest coin by market cap, is up over 8% in the past day and is now trading hands for $184.17, according to CoinGecko.\n\nAD\n\nAD\n\nThe coin isn't as close to breaking records like Bitcoin is, though—it still has to rise in value by another 29% to hit its 2021 all-time high of $259.\n\nElsewhere, Avalanche is also riding high: of the top 20 coins and tokens, it's doing the best, having shot up by nearly 9% in 24 hours. It is now priced at $38.24.\n\nThe coin, which runs on a network used by developers to build decentralized apps, is the 12th biggest digital asset by market cap and last year made headlines when J.P. Morgan announced that it had used its blockchain to tokenize investment portfolios.\n\nFurther down the list of top cryptocurrencies by market cap, price surges have also hit Uniswap (UNI), Pepe, and Lido DAO (LDO) with 24-hour gains of over 18%, 20%, and 21%, respectively.\n\nEthereum, the second biggest cryptocurrency, is currently up 14% in the past day, coming in priced at $3,511. The asset shot up on news that Wall Street's biggest regulator, the Securities and Exchange Commission, could be close to approving a spot ETH ETF.\n\nAD\n\nAD\n\nSuch an investment vehicle would give people exposure to the second biggest digital currency by market cap via shares that trade on a traditional stock exchange.\n\nThe SEC approved 11 spot Bitcoin ETFs in January but has been coy on the issue of approving an ETH equivalent.\n\nA long-list of big Wall Street firms have filed paperwork to release a spot ETH ETF, including BlackRock, Grayscale, and VanEck. Up until the latest rumors, the prospects of approval seemed dim.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxPSXFZTDVsNEliTUpoOGcwVUNReXp6Wm1kS2REX3AyWFVVRG9scUZkUEFaMWp0MzFXbG9qY1JEUzNMekJXdGpEMDM3dmVneWtJbUJqUmVkWHpJeW1qRmhkZGE1enh0dDdZV2h1b05mN0hWbWRpMFZwSWJvRmQ5aUNyOXJ0eHVmZFpJLXNGLWFPN2xXeU5IamdydkhGMHNaYjQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Ethereum soars as odds of ETF approval jump to 75% — ‘SEC could be doing a 180’ - DLNews",
        "content": "Bloomberg Intelligence ETF analyst Eric Balchunas says the odds of the SEC approving the Ethereum ETFs have greatly improved.\n\nThe SEC's sudden change of attitude is leaving everyone scrambling, Balchunas said.\n\nHe upped his odds of approval to 75%, from 25%.\n\nThe odds that the Securities and Exchange Commission will greenlight Ethereum spot exchange-traded fund applications have just increased.\n\nBloomberg Intelligence ETF analyst Eric Balchunas, long bearish on the products’ odds, posted on X that chances of approval have shot up to 75% from 25%.\n\nBalchunas said he was “hearing chatter this afternoon that the SEC could be doing a 180 on this (increasingly political issue), so now everyone is scrambling (like us everyone else assumed they’d be denied).”\n\n“It’s what we’re hearing from multiple sources,” Bloomberg Intelligence ETF research analyst James Seyffart said. “Should see a bunch of filings over coming days if we’re correct.”\n\nEthereum soared 8% off Balchunas’ tweet, recently trading at $3,400.\n\n“If the spot ETH ETF is approved, it will be a true shock to everyone I know in DC who’s close to this process,” Jake Chervinsky, chief legal officer at Variant fund, posted. “It means approval could signal a major shift in US crypto policy after the SAB 121 vote, perhaps more important than the ETF itself.”\n\nLast Thursday, the Senate voted on a resolution to repeal a controversial accounting guidance from the SEC, called SAB 121, which critics say has deterred investment banks from offering crypto custody at scale.\n\nPresident Joe Biden indicated that he would veto the provision if approved. Prominent Democrats, however, have sided with their Republican colleagues against the rule, raising speculation that the White House may back down.\n\nJoin the community to get our latest stories and updates\n\nDeadline\n\nIf the SEC wants to approve the Ethereum ETF products, it will have to be fast about it. The deadline for VanEck’s Ethereum ETF application is on Thursday — and the SEC is unlikely to approve some of the filings ahead of others in order to avoid playing the role of a kingmaker.\n\nNate Geraci, president of ETF Store, said that even with the tight deadline, it would be possible for the SEC to approve one set of important filings, called 19b-4s, before the deadline, and then “slow play” the second set of filings, called S-1s.\n\nThe SEC must approve both set of filings before the ETFs could come to market.\n\nBalchunas had previously told DL News that in light of the reported lack of engagement from the SEC with prospective issuers, Ethereum ETFs were unlikely to get approved before the end of 2025.\n\nIf the ETFs are rejected, issuers will likely wait until after the US presidential election to file again, because a victory for presumptive Republican nominee Donald Trump would probably mean a change of leadership at the SEC — perhaps in favour of someone less antagonistic toward crypto than current chair Gary Gensler.\n\nTom Carreras is a markets correspondent at DL News. Got a tip about Ethereum ETFs? Reach out at tcarreras@dlnews.com"
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiZEFVX3lxTFBLVzhhejNEclJHUURvMXExUEFEOENWOTBTSHlRSWxzMk8xYzVRRHhob196N0xaUGNmbVZDdjNmZFJ4aVo5dWNxTlRrdnJqX0JJc3ZMNlBHTUlObXFQdVZjTk5jWE8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "Ethereum is too hard to use - Blockworks",
        "content": "Anyone else think Ethereum is difficult to use these days?\n\nYeah, there’s a bunch of cool stuff on Ethereum — meme tokens, NFTs, DeFi, degens — it’s all there. But over the years as the blockchain evolved, it has become more expensive and more complicated — as in, an already complex technology for users has become even moreso.\n\nNot only do users need to understand crypto basics like wallets, irreversible transactions and addresses, they also now have to contend with getting to know different chains. You can’t just send Ethereum chain ETH to Optimism chain ETH, or Optimism chain ETH to Polygon chain ETH, unless of course you use a bridge which means that this system might be getting a little complex for many users.\n\nEthereum is becoming a multilayered lasagna-like system whereby complexity and fees are pushing people to the margins, causing interoperability and security concerns.\n\nHow did we get here?\n\nI wouldn’t say there’s anyone in particular to blame for this; it’s an ecosystem problem as a whole. When Ethereum launched almost 10 years ago, nobody was using it. At that time, any usage at all was welcomed.\n\nNow, it’s 2024 and there is usage. But there’s also expensive layer-1 fees. Average transaction fees on the layer-1 Ethereum blockchain are at $0.94. If a user wants to interact with a smart contract, like a DEX, fees are averaging $4.70.\n\nSome might say, “Well, maybe it’s time to examine fees themselves.” Problem is, fees are what secure the network. If validators were not being incentivized by staking and reaping fees, what would be the point?\n\nOkay, yeah, but there’s the layer-2 options, right? There are. And Arbitrum and Optimism have both transaction and smart contract fees at less than $0.02. We’re securing the bottom layer, enabling lower fees on the second.\n\nBut as a Coinbase report from late last year noted, there are so many of these layer-2s that fragmentation now exists between all of these different chains. And mainstream users, aka those who could enable mass adoption, want financial apps that don’t make things complicated.\n\nThe sandbox\n\nThe point is clearly that Ethereum is just one big-ass financial experiment. I actually wrote about this way back in 2016, about Ethereum being a fintech sandbox.\n\nAnd it has been one. When I wrote that piece, ICOs were only slowly gaining traction, DEXs were in their infancy and there wasn’t even an NFT token standard yet — just Plain Jane ERC-20s.\n\nRead more from our opinion section: BlackRock clearly wants to take crypto seriously. Too bad it’s forever silly.\n\nTimes have certainly changed. Ethereum’s “world computer” concept, the idea that people could build programmable monetary systems on a verifiable blockchain, has been a success. The Ethereum Virtual Machine, or EVM, is a standard for smart contract development — even outside the Ethereum ecosystem.\n\nThen, there’s the 2022 move to the proof-of-stake model, which to Ethereum’s credit, was pulled off with remarkable execution.\n\nYet I’ve heard of people working on Ethereum layer-3 projects now. That’s an abstraction of two layers — can anyone come up with something comparable for so many layers in technology? Maybe the OSI model? It has seven layers. But it’s used for data in networking, all running at the same speed. And there’s no fees. It’s just categorizing data.\n\nOkay, well, blockchains are just data. So then we arrive back at the fee conundrum. But blockchains are decentralized, so there has to be some incentive to support the network, right?\n\nA fee quagmire\n\nFees secure the Ethereum network, rent the computing power to do things and also limit spam. With that in mind, I suppose there have to be fees in the system — I’m not proposing some grand, new fee-less Ethereum design, that’s for the Vitalik Buterins of the world.\n\nThere are rollups, and that’s promising because they can batch process transactions off of Ethereum while lowering fees with the same level of security. Or maybe some smart startup can somehow increase interoperability — instead of reducing it by having users dig through layers like a Stouffer’s Italiano.\n\nI just am not convinced of the feasibility and long-term viability of so many bridges, some of which have been compromised. It feels like too many vulnerabilities in the margins. Perhaps a standardization of bridges is needed, and many wallets do warn users about interacting with bad smart contracts, so some safeguarding is happening.\n\nBut I’m still trying to coincide my recent experiences with Ethereum as something…\n\nVery.\n\nLasagna-like.\n\nTasty for the taste buds as a food, yes.\n\nBut isn’t it a bit complex for people to use as a blockchain? People want apps that offer free flow of money, not restrictive layers. Hopefully, Ethereum can evolve past this lasagna stage.\n\nDaniel Cawrey has been involved full-time in the crypto space since 2013, including as an editor at CoinDesk. He is author of 2020’s “Mastering Blockchain” and 2023’s “Understanding Crypto” books, both available on Amazon.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiZkFVX3lxTE9nX2pJdno5TU5JemxNOEdsazRDV0FZQ2JaTVhlRkZtVHlyU1VRVVFYSjlTWnVNR2c3bEVBRmNfeW9aUUl6RWF2aGN5cXBfSXlPS2FWbUZDYTQzSWFkb3Q1dFlpTG10dw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 May 2024 07:00:00 GMT",
        "title": "What Is the EIP-7022 Proposal on Ethereum? - Unchained",
        "content": "EIP-7702 is a new proposal that will introduce a new transaction type to enhance the security and functionality of EOAs.\n\nEthereum co-founder Vitalik Buterin and a team of developers are spearheading a new Ethereum Improvement Proposal (EIP). EIP-7702 will significantly improve smart contract functionality on Ethereum by temporarily merging it into externally owned accounts (EOA), thus simplifying and improving user experience.\n\nRead on to learn about the EIP-7702 proposal on Ethereum, how it works, its potential impact, and its benefits and drawbacks.\n\nWhat Is EIP-7702?\n\nThe EIP-7702 proposal was introduced as an alternative to EIP-3074, which was approved for inclusion in the Pectra upgrade scheduled for Q4 2024.\n\nEIP-3074 was designed to refine account management within the Ethereum protocol by allowing Externally Owned Accounts (EOAs) to assign control to smart contracts, paving the way for more advanced transaction strategies. EOAs are a type of Ethereum account controlled by users rather than code\n\nThe proposal would achieve this by introducing two new opcodes, AUTH and AUTHCALL, enabling EOAs to transition smoothly into smart contracts without deploying new ones. This would improve transaction efficiency and flexibility in interactive scenarios and complex operations.\n\nHowever, EIP-3074 faced some limitations, including technical issues and security challenges. These issues became evident in practical applications, especially when dealing with high-value or large-scale transactions. Vitalik Buterin, alongside Ansgar Dietrichs, Matt Garnett, and Sam Wilson, developed EIP-7702 in response to these issues and as an alternative to EIP-3074.\n\nEIP-7702 is a new proposal that will introduce a new transaction type to enhance the security and functionality of EOAs. The proposal will enable EOAs to behave momentarily like smart contracts.\n\nSimply put, EIP-7702 will inherit and expand some of the functionalities of EIP-3074, such as batch processing, lowering privileges, and transaction sponsorship.\n\nHow Does EIP-7702 Work?\n\nThe proposed EIP-7702 will provide a new method for EOAs to interact within the Ethereum blockchain. Externally owned accounts will be temporarily able to operate as smart contract wallets during transactions before returning to their initial state after the transaction.\n\nThis technique improves the functionality and security of Externally Owned Accounts without launching new opcodes, making assimilation more efficient than EIP-3074. Moreover, removing opcodes from the process helps decrease complexity, compatibility difficulties, development resources, and potential security flaws linked to them.\n\nEIP-7702 has been developed to be forward-thinking, given its compatibility with ERC-4337. ERC-4337 is an account abstraction standard on the Ethereum network that aims to improve security and user experience by launching smart contract functionality in wallets. This integration can help externally owned accounts attain features such as multi-factor authentication, the potential for people to transact using any token, and social recovery.\n\nEIP-7702 can significantly reduce transaction fees by batching transactions, making the Ethereum network more efficient. The proposal promotes financial inclusion by introducing transaction sponsorship, where one user can offset the transaction fees for another user. It also makes the platform more accessible, lowering the barrier to entry.\n\nEIP-7702 also includes downscaling privileges. Accounts can limit their privileges for certain crypto transactions, boosting the platform’s security against fraudulent and phishing activities.\n\nThe Potential Impact of EIP-7702 on the Ethereum Network\n\nThe new Ethereum proposal, EIP-7702, if included in the Pectra upgrade scheduled for Q4 2024, is expected to impact the Ethereum network positively. Although currently in the discussion stage, EIP-7702 offers a robust solution to enhancing Ethereum by introducing account abstraction.\n\nAccount abstraction makes it more flexible for users to program their security better while enjoying an enhanced user experience. Lowering the barrier to entry for Ethereum enhances accessibility, potentially boosting its adoption in the Web3 ecosystem. In addition, smart contracts can provide better safety features, such as recovering funds in case private keys are lost.\n\nTransaction sponsorship also means that users can easily get started with the Ethereum network as they don’t have to worry about buying ether for gas fees.\n\nThe proposal introduces greater flexibility in the design of smart contract wallets for developers. They can customize their verification logic, incorporating features such as emergency recovery techniques, multi-factor authentication, and spending limits. This opens up new opportunities for developers to explore smart contract wallets.\n\nBenefits and Drawbacks of EIP-7702\n\nWhile still in discussions, EIP-7702 has some benefits and drawbacks linked to it. Below are some benefits of the proposal:\n\nBatched Transactions: The Ethereum network can become much more efficient through the batched transaction feature, which can also reduce transaction costs.\n\nERC-4337 Compatibilit y: The EIP-7702 is a forward-thinking proposal compatible with the ERC-4337 standard on Ethereum, which can enhance the user experience and security of the Ethereum blockchain while advancing blockchain technology.\n\nTransaction Sponsorship : If successfully implemented, EIP-7702 will enable users to cover the transaction fees of other users, making the platform more accessible for everyone.\n\nWidespread Ethereum Adoption : By lowering the barrier to entry for users, more people will be able to access and use the Ethereum platform, leading to its widespread adoption.\n\nWhile there is optimism surrounding EIP-7702, it’s not without its drawbacks. Below are some challenges with the EIP-7702 proposal:\n\nAdjusting Gas Costs : It’s still unclear how EIP-7702 will scale the gas fee costs associated with its transactions.\n\nRevocation of Transactions : Implementing EIP-7702 would mean that users relinquish the control of their externally owned accounts to smart contract codes, which, albeit need to be trusted, can be prone to malice. Therefore, the Ethereum team must ensure users can revoke and revert transactions signed using malicious code.\n\nThe Bottom Line\n\nThe introduction of EIP-7702 is expected to benefit Ethereum. Still, its implementation will depend on its developers finding solutions to the raised issues and getting consensus from the Ethereum community.\n\nAnsgar Dietrichs, one of the researchers at the Ethereum Foundation, suggested implementing EIP-7702 to the Pectra upgrade first and tracking it for several weeks before deciding whether to replace EIP-3074 with EIP-7702.\n\nIf incorporated, it remains to be seen how EIP-7702 will revolutionize the Ethereum blockchain."
    }
]