[
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxPZWF6X1QtTzJidHJ2dDd3STdjbXh5TUJkTjdKM0JxOUNYTmlIaWpBcHJpMGE4RVZNYllMSjFPWmxkTnRzWTFjVXRFWFZjRW5zc2JpTERmNzluUDRoejVYRWw0WHBKOElWa2sxYzdWdUkyZmtyUWo0OUV2Nmt4U2xoTHhlZ2h3QTNjNDFRZGh3WVk5U0lPRnhPWGdVV0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Apr 2024 07:00:00 GMT",
        "title": "Picasso Network Integrates with Ethereum via IBC Protocol - Crypto Times",
        "content": "Based on a medium post, Picasso Network is now entitled to Ethereum’s Inter-Blockchain Communication (IBC) protocol. It facilitates sending assets and data across Ethereum and all Cosmos network nodes, considerably increasing communication between separate blockchains.\n\n🎨 @Ethereum @IBCprotocol is live on https://t.co/AJSBStq1qm!\n\n\n\nWe're thrilled to announce the official mainnet launch, connecting Ethereum with @Cosmos and @Polkadot – and soon, @Solana. This milestone brings us closer to a universally interoperable and secure DeFi ecosystem.… pic.twitter.com/aS4hCwYHDh — Picasso 🎨 (@Picasso_Network) April 3, 2024\n\n“By connecting Ethereum with Cosmos through IBC and designating Osmosis as the primary liquidity hub, we are setting the stage for a new chapter in DeFi,” Henry Love, Composable Foundation Executive Director, stated.\n\nDeveloping this integration and a greater security level over the conventional bridge methods by creating a common platform to work together with Ethereum and Cosmos community members."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMia0FVX3lxTFBDdmJZc24wTldJX000Y1hKSUFoLWtkbjIzS2RFSVVqWGFYLV84UWFjTEw3VUU4WFhXOFhDdm9HWTREcVlPeUNmS01hMU1ZTGpPZTJBb3J1ZHRveUVhYm9nbTVfMndEcmNFYm8w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Apr 2024 07:00:00 GMT",
        "title": "Ripple to debut a dollar-pegged stablecoin on XRP Ledger and Ethereum this year - Crypto Briefing",
        "content": "Ripple aims to tap into the growth potential and niche opportunities within the stablecoin market.\n\nShare this article\n\nRipple plans to issue a stablecoin tied to the US dollar, which will be 100% backed by USD deposits, short-term US bonds, and other cash equivalents. Expected to debut later this year, Ripple’s stablecoin will be deployed on the XRP Ledger and the Ethereum blockchain, with plans to extend to other blockchains and DeFi platforms, Ripple said on its website.\n\nTo ensure transparency and address potential concerns about reserve quality, Ripple will publish monthly attestations of its stablecoin reserves. Additionally, these reserves will be audited by a reputable third-party accounting firm. Specific details regarding the chosen firm have not yet been disclosed.\n\nBrad Garlinghouse, Ripple CEO, explained that the launch is to address the growing demand for stablecoin with a compliant and trusted solution and drive development and use cases within the XRPL ecosystem.\n\n“Institutions entering this space are finding success by partnering with compliant, crypto-native players and Ripple’s track record and resiliency speaks for itself, as we launch new products and acquire companies through multiple market cycles. This move is also monumental for the XRP Ledger community, driving more use cases, liquidity and opportunities for developers and users,” said Garlinghouse.\n\nRipple claims its stablecoin offers a unique combination of features tailored for enterprise use, regulatory compliance, and a thriving developer ecosystem. The firm seeks to fill a gap in the market for institutions seeking stablecoin integration for large-scale payments.\n\nA lucrative market\n\nStablecoins are an integral part of the crypto ecosystem. According to data from the Federal Reserves, over 80% of trading volume on major centralized crypto exchanges in 2022 involved stablecoins. This popularity can be attributed to their role as a frictionless on-chain intermediary. Unlike converting to traditional fiat currency, stablecoins allow traders to quickly move between positions without leaving the crypto ecosystem.\n\nWith a value of around $150 billion, Ripple CTO David Schwartz expects the stablecoin market to reach over $2 trillion by 2028. Currently, the market is dominated by Tether’s USDT and Circle’s USDC. However, Schwartz sees opportunities for niche players to carve out their space.\n\n“We think it will be over $2 trillion by 2028, and there’s only two market leaders. We don’t think it’s a winner-take-all-all ecosystem, particularly on the DeFi side,” said Schwartz.\n\nThe stablecoin market is not just sizable, it’s highly profitable. Leading stablecoin issuer Tether recently reported a nearly $3 billion in quarterly profits last year, with $1 billion coming from US bonds. Last month, Tether hit a $100 billion market cap; this level of growth puts Tether in the same league as established giants like British oil and gas giant BP and Shopify in terms of market capitalization."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxQd1ZiV2hrLWNxNlVzaEVJblFmMGlPS3U5WWpfeEw3dGpkdnlNSlNQMGdaQkEtWm5lclYxdjhGRUFnMVBiblBjUERSRE9tRzY4N3ZobG5aa3JsM2huZkx2U1UzcE1OeG92Ykl3RVZ3OVc3dHU1SjBGZy1ncmJlNUc5Uml6NEdtT25tX3lSVVY5OE5WUUdXbkRzQXZ0eDFqNFdxX1dn0gGoAUFVX3lxTE9MVm5pTTdETFRwZVFKbjZkRUZoZjg3bklXUVg0NEMzcFJmd1F4REVmdUFoVllUU294aFR6S08taHVpR2NmS09IM3FpcUpkUzFNSUxleVNueVpvdUVublppSFNrc0pFejlwS2NFX1ZsbENZRDlleXo1MFdyNi1xMmhvNlFrNGhUc3VqOTBLaGQxMjE1YkFjRWZNY1U0dmxPZ2pEX1d0amFKaA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Apr 2024 07:00:00 GMT",
        "title": "US Gov Moves $40M Bitcoin & Ethereum Seized In 2022, Will It Disrupt Price Recovery? - CoinGape",
        "content": "The US government has been observed transferring $40 million worth of Bitcoin (BTC) and Ethereum (ETH) on Thursday, April 4. This crypto reserve was seized from two Estonian citizens back in 2022. This move comes amidst a turbulent period for the leading cryptocurrency as the Bitcoin price just managed to rebound above $67,000.\n\nUS Gov Makes Massive Bitcoin & Ethereum Transfer\n\nThe seized Bitcoin and Ethereum, now in the possession of US authorities, holds the potential to impact the crypto market dynamics significantly. According to Arkham Intelligence, the US government made two subsequent transfers today for BTC and ETH, respectively. The first transfer was of 4,567 ETH worth $15.21 million.\n\nadvertisement\n\nIn addition, the authorities transferred 374 BTC worth $24.80 million to an unknown wallet. With the market eagerly watching the US government’s next steps, speculation is rife regarding the potential impact on the Bitcoin and Ethereum price.\n\nIt is estimated that the eventual sale of the seized crypto reserve by the US government could exert downward pressure on the Bitcoin and Ethereum price. The influx of such a substantial amount of Bitcoin into the market may trigger selling pressure, expediting the current dip in prices.\n\nEarlier, late Tuesday morning, a wallet associated with the US government transferred a massive 30,175 Bitcoin. Considering the Bitcoin price of around $65,000 at the time, this transaction amounts to approximately worth $2 billion.\n\nThe last confirmed instance of the government selling Bitcoin dates back to March 2023. During this event, they sold 9,861 coins for $216 million. This sale followed the government’s seizure of around 50,000 Bitcoin linked to the Silk Road website in late 2022.\n\nAmong the recent transfers, approximately 2,000 Bitcoin were sent to a wallet identified by Arkham Intelligence as belonging to the crypto exchange Coinbase. The remaining Bitcoin was transferred to a wallet flagged by Arkham as being owned by the government.\n\nAlso Read: Bitcoin Short-Term Investors Lose $5.2B Amid BTC Price Crash\n\nBTC & ETH Price Rebound\n\nAfter plummeting over 11% from the recent high of $73,750.07, Bitcoin has recovered significantly. As of writing, BTC price was $67,534.94, gaining 2.58%. Meanwhile, the market cap for BTC stood at $1.32 billion. In contrast, the trading volume plunged 20.20% to $30.11 billion.\n\nHowever, if the recent US government Bitcoin and Ethereum transfer is made for a selloff, the rebound could be short-lived. In addition, Michaël van de Poppe predicted that the Bitcoin consolidation will continue and there’s not much upside as of now. On the contrary, he expects a surge in altcoin prices, which could benefit Ethereum despite the potential selloff.\n\nAt press time, the ETH price was up by 1.35% to $3,374.15 with a market cap of $404.99 billion. Whilst, the trading volume for Ethereum slumped 24.82% to $13.12 billion in the last 24 hours.\n\nAlso Read: Ethereum L2s May Outshine Main Blockchain, VanEck Reports\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTFBPQjlnRWt5bnM3NHV3Y0FZSXkzX040b3JpZG4yMVZ2c1JaVkp6RnZRd09TVlZ5eThTdHNzaEJqZmNrVmgyLU1TcDRtbjRJTnFFUmcxN2hXLTRfdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Apr 2024 07:00:00 GMT",
        "title": "What Is Blast on Ethereum? A Beginner’s Guide - Unchained",
        "content": "Blast is a new Ethereum layer 2 that introduces the concept of native yield for ETH and stablecoins.\n\nBlast is a new Ethereum layer 2 network that has made waves after introducing the concept of native yield. Unlike other layer 2 solutions, Blast users can earn yield paid in crypto simply by having certain tokens in their wallets.\n\nRead on to learn about Blast, how it works, and what it is bringing to Ethereum.\n\nWhat Is Blast on Ethereum?\n\nBlast is an EVM-compatible Ethereum layer 2 platform that offers native yield for ether and stablecoins. It operates as an optimistic rollup solution to tackle scalability issues on Ethereum by increasing the network’s capacity for more transactions at lower costs.\n\nBlast’s testnet went live in January 2024, and its mainnet launched in February. The platform, founded by Tieshun Pacman Roquerre (the creator of NFT marketplace Blur), has surpassed $1 billion in total value locked at the time of writing.\n\nThe project is different from other Ethereum layer 2 solutions as it offers native yields for both ETH and stablecoins.\n\nHow Does Blast Work?\n\nBlast yield income for decentralized finance (DeFi) users comes from the concept of Ethereum staking. Ethereum staking is a process on the Ethereum network whereby users can temporarily lock tokens to validate transactions.\n\nTraditionally, managing staking requires individual attention from users. However, Blast simplifies this process by handling staking on behalf of its users within its ecosystem, making it an L2 platform with native yield.\n\nWhen assets are bridged to the Ethereum mainchain within Blast’s network, they are automatically staked, initiating the interest-earning process. Blast’s smart contracts facilitate the collection of this interest, which is automatically redistributed to users in the form of ether (ETH) and stablecoins.\n\nHow Does Blast Offer Yield?\n\nBlast offers a 4% interest rate for ETH and a 5% interest rate for stablecoins like USDT, USDC, and DAI deposited on the network. These interest rates are compounded, meaning they apply to the balance over time rather than the initial deposit.\n\nThe native yield feature is powered by rebasing tokens and is based on the Risk-free Interest Rate (RFR) yield structure.\n\nThe 4% yield on Ethereum is sourced through liquid staking on the Ethereum network. After the merge, the proof-of-stake (PoS) on the Ethereum network offers a 4% APR on staked ETH. Blast utilizes this feature through partnerships with platforms like Lido, leveraging staked user assets for yield generation.\n\nSimilarly, stablecoins bridged to Blast are routed to T-bill protocols, such as MakerDAO, where they generate yields. Blast channels them to MakerDAO’s T-bill protocol, and users receive USDB on Blast. USDB accumulates stablecoin profits over time at a 5% APR, and users can redeem the asset for USDC when they bridge back from Blast.\n\nWhat Does Blast Bring to the Ethereum Ecosystem?\n\nBlast’s main aim is to enhance transaction efficiency on the Ethereum network. The layer 2 solution operates on Ethereum but doesn’t rely on the full processing power of the main chain. The move ensures that transactions remain reliable and decentralized while enhancing scalability.\n\nThe L2 also tackles asset depreciation by providing users with a “risk-free” interest rate, regardless of the coin’s value. By providing both ETH and T-Bill yields, Blast ensures users receive benefits similar to those on the mainchain but adds optimistic rollup services and other layer 2 network scaling solutions.\n\nCompared to Ethereum’s core network, which can only process roughly 15 transactions per second, Blast can process thousands of transactions per second by grouping them together. Thus, transactions can be confirmed more quickly, resulting in a more responsive and seamless user experience.\n\nThe Blast Airdrop\n\nTo participate in the airdrop, users need to obtain an invitation link from their peers through a referral. Users can then register on the airdrop page to claim their sign-up reward. Registered participants can unlock additional rewards by bridging assets to the platform or inviting other users.\n\nNotably, airdrop points are granted based on the value of assets bridged and the number of users successfully referred.\n\nWhile the bridge to Blast is operational, participants in the airdrop campaign can only redeem their accumulated airdrop points beginning May 2024. Part of the airdrop is designated for Season 3 of Blur participants.\n\nFurthermore, part of the airdrop is set aside for developers, particularly winners of the Big Bang contest and mainnet dApps. Developers can reallocate their airdrop points to users, thus enhancing liquidity and expanding the user base.\n\nChallenges and Controversies Associated With Blast\n\nThe crypto community has raised some questions regarding the project’s operations and the validity of its promises.\n\nBlast’s holding contract for deposited assets is safeguarded by a multi-signature mechanism involving five participants. At least three of these participants must consent to approve any withdrawal request. However, the identities of these five participants remain undisclosed, as the project founder operates under a Twitter pseudonym. Furthermore, the criterion for signature approval remains unclear.\n\nFurthermore, questions have been raised regarding the rebase structure and the native yield arrangement. While Blast developers and project partners have strongly supported the project, comments on the rebase token design suggest differing opinions on its feasibility and efficiency.\n\nThe network’s security has also recently become an issue. Munchables, a GameFi platform operating on Blast, disclosed recently that it experienced a security breach resulting in a loss of $62 million. Additionally, an associated vault on Juice Finance avoided a $25 million loss due to a typographical error.\n\nHowever, unlike other hacks, the hacker lacked leverage due to Blast’s multiple centralized components, which eliminated any chance for the attacker to attempt to launder the stolen funds. Eventually, the attacker relinquished control of the private keys.\n\nConclusion\n\nBlast has gained traction, achieving a total value lock (TVL) exceeding $1 billion. The network aims to transform the crypto and gaming industries by providing a layer 2 solution with native yield.\n\nHowever, the project is still in its early stages and has much to prove, including liquidity efficiency and native yield arrangement over time."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMi0gJBVV95cUxORGpTaE9NM205Q25sTFZWa0wxT25LT0d4RW9RV0lnTjViVlAyeHhENnQ3Qk1CaldBc3J6UFhnTlVXRjVGNEV0Y2xobm9VN0cwSlFtam9xN2NOLTBjcHhzZFFxcV9ycXRPT1dFME83enB2U3JLYy1Ha21TeTJwMV9feENZOVkzS2dEem1PYzM2cEtrNndpbTkwRmRQNjQtMEY4R0I5RzR3Y01QTHlid2FWTWNFSkdOTzI3YXFMQVdwdncxcUI4RVB4ekRneWJ0c1VTXzQzREVVSUZ4dVFSQUlXdzZWWUVnbU5CdHNXWUU5UHExaFpxV3dteWxSY0N6RnBUT290TlluNENaS0JEOTh4NmpkQjVFanlLTE9odThhaUk5aWdybzdVaXBHT3lSYnR1OHIxWjNUVUVJcVVCSHZPaWZaNE5ybmRhNTI1aDV2OVBfUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Apr 2024 07:00:00 GMT",
        "title": "Grayscale® Digital Large Cap Fund, Grayscale® DeFi Fund, and Grayscale® Smart Contract Platform Ex-Ethereum Fund Announce Rebalancing of Funds for First Quarter 2024 - GlobeNewswire",
        "content": "STAMFORD, Conn., April 04, 2024 (GLOBE NEWSWIRE) -- Grayscale Investments® , the world’s largest crypto asset manager*, and manager of Grayscale® Digital Large Cap Fund ( OTCQX: GDLC ) (Digital Large Cap Fund), Grayscale® DeFi Fund ( OTCQB: DEFG ) (DeFi Fund), and Grayscale® Smart Contract Platform Ex-Ethereum Fund (GSCPxE Fund), today announced the updated Fund Component weightings for each product in connection with their respective first quarter 2024 reviews.\n\n\n\nIn accordance with the CoinDesk Large Cap Select Index methodology, Grayscale has adjusted GDLC’s portfolio by selling Cardano (ADA), and using the cash proceeds to purchase existing Fund Components in proportion to their respective weightings. As a result of the rebalancing, Cardano (ADA) has been removed from GDLC. At the end of the day on April 3, 2024, GDLC’s Fund Components were a basket of the following assets and weightings.**\n\nBitcoin (BTC), 70.96%\n\nEthereum (ETH), 21.84%\n\nSolana (SOL), 4.52%\n\nXRP, 1.73%\n\nAvalanche (AVAX) 0.95%\n\n\n\nNo new tokens were added or removed from DeFi Fund. At the end of the day on April 3, 2024, DEFG’s Fund Components were a basket of the following assets and weightings.**\n\nUniswap (UNI), 48.74%\n\nMakerDAO (MKR), 20.41%\n\nLido (LDO), 13.17%\n\nAave (AAVE), 9.99%\n\nSynthetix (SNX), 7.69%\n\n\n\nIn accordance with the CoinDesk Smart Contract Platform Select ex ETH Index, Grayscale has adjusted GSCPxE’s portfolio by selling Cosmos (ATOM), and using the cash proceeds to purchase existing Fund Components in proportion to their respective weightings. As a result of the rebalancing, Cosmos (ATOM) was removed from GSCPxE. At the end of the day on April 3, 2024, GSCPxE’s Fund Components were a basket of the following assets and weightings.**\n\nSolana (SOL), 58.41%\n\nCardano (ADA), 14.56%\n\nAvalanche (AVAX), 12.25%\n\nPolkadot (DOT), 8.53%\n\nPolygon (MATIC), 6.25%\n\n\n\nNeither GDLC, nor DEFG, nor GSCPxE Fund generate any income, and all regularly distribute Fund Components to pay for ongoing expenses. Therefore, the amount of Fund Components represented by shares of each fund gradually decreases over time.\n\nFor more information, please visit grayscale.com .\n\nThis press release is not an offer to sell or the solicitation of an offer to buy any security in any jurisdiction where such an offer or solicitation would be illegal, nor shall there be any sale of any security in any jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of that jurisdiction.\n\n*Largest by AUM as of April 4, 2024\n\n**The compositions of the GDLC, DEFG and GSCPxE Fund are evaluated on a quarterly basis to remove existing Fund Components or to include new Fund Components, in accordance with the index methodologies established by the Index Provider. Holdings and weightings of each Fund are subject to change. Investors cannot directly invest in an index.\n\nAbout Grayscale® Digital Large Cap Fund\n\nDigital Large Cap Fund seeks to provide investors with exposure to large-cap coverage of the digital asset market through a market cap-weighted portfolio designed to track the CoinDesk Large Cap Select Index. Digital Large Cap Fund holds the largest and most liquid digital assets that meet certain trading and custody requirements and are classified in the CoinDesk Digital Asset Classification Standard (DACS); the weightings of each Fund Component change daily and are published around 4:00 p.m. NY-time. Additional information on the Index methodology can be found at: https://www.coindesk.com/indices/dlcs/ .\n\nDigital Large Cap Fund’s investment objective is for its Shares to reflect the value of Fund Components held by the Digital Large Cap Fund, less its expenses and other liabilities. To date, the Digital Large Cap Fund has not met its investment objective and the Shares quoted on OTCQX have not reflected the value of Fund Components held by the Digital Large Cap Fund, less the Digital Large Cap Fund's expenses and other liabilities, but instead have traded at both premiums and discounts to such value, with variations that have at times been substantial.\n\nAbout Grayscale® DeFi Fund\n\nDeFi Fund seeks to provide investors with exposure to a selection of industry-leading decentralized finance platforms through a market cap-weighted portfolio designed to track the CoinDesk DeFi Select Index. DeFi Fund holds the largest and most liquid digital assets that meet certain trading and custody requirements and are classified in the DeFi sector defined by CoinDesk Digital Asset Classification Standard (DACS); the weightings of each Fund Component change daily and are published around 4:00 p.m. NY-time. Additional information on the CoinDesk DeFi Select Index methodology can be found at: https://www.coindesk.com/indices/dfx/ .\n\nDeFi Fund’s investment objective is for its Shares to reflect the value of Fund Components held by the DeFi Fund, less its expenses and other liabilities. To date, the DeFi Fund has not met its investment objective and the Shares quoted on OTCQB have not reflected the value of Fund Components held by the DeFi Fund, less the DeFi Fund's expenses and other liabilities, but instead have traded at both premiums and discounts to such value, with variations that have at times been substantial.\n\nAbout Grayscale® Smart Contract Platform Ex-Ethereum Fund\n\nGSCPxE Fund seeks to provide investors with exposure to a selection of industry-leading Smart Contract Platforms through a market cap-weighted portfolio designed to track the CoinDesk Smart Contract Platform Select Ex ETH Index. GSCPxE Fund holds the largest and most liquid digital assets, excluding ETH, that meet certain trading and custody requirements, and are classified in the Smart Contract Platform sector defined by CoinDesk Digital Asset Classification Standard (DACS); the weightings of each Fund Component change daily and are published around 4:00 p.m. NY-time. Additional information on the CoinDesk Smart Contract Platform Select Ex ETH Index methodology can be found at: https://www.coindesk.com/indices/scpxx/ .\n\nGrayscale intends to attempt to have shares of this new product quoted on a secondary market. However, there is no guarantee this will be successful. Although the shares of certain products have been approved for trading on a secondary market, investors in this product should not assume that the shares will ever obtain such an approval due to a variety of factors, including questions regulators such as the SEC, FINRA or other regulatory bodies may have regarding the product. As a result, shareholders of this product should be prepared to bear the risk of investment in the shares indefinitely.\n\nAbout Grayscale Investments®\n\nGrayscale enables investors to access the digital economy through a family of regulated and future-forward investment products. Founded in 2013, Grayscale has a proven track record and deep expertise as the world’s largest crypto asset manager. Investors, advisors, and allocators turn to Grayscale for single asset, diversified, and thematic exposure. Grayscale products are distributed by Grayscale Securities, LLC (Member FINRA/SIPC)."
    }
]