[
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxNRGRfeVc2bzZ0ZC1NTmFSdFVESE1kcE1oZEpjdDlmSGRJU1FGVkFKaXNUQVZVTEtQYmlHWEV1NnozaWMzcl82eG5PdWoxWjVJUnRYYU1PVDU5Wm5ZX3IwSDhUeUpsaVhPcTNTcFJwS3d5VDQ3a2FhT3dGU3BjX01BRldTck1hbV93R2d0Q3BRZmPSAZYBQVVfeXFMT2txaFRPNmpvVE5wNWI1aGl0QUFtVmFyZmhJMERuTkhjNXJqa0R1d0V3dlJ5RS16YTNHclFzZlBIUTZoYWxfYzBURnUteUN0NHFzZTJqRFdJSTNRamd4TzBySWthTEh4VG9PekJaSVY0R2ZVVDNFeWVBT2xQaXg2S3Aza21uYjRNZTNZSmV3VFRNZ3drYkJB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jan 2024 08:00:00 GMT",
        "title": "Here’s Ethereum’s Roadmap for 2024, According to Vitalik Buterin - CryptoPotato",
        "content": "Vitalik Buterin, the co-founder of Ethereum, has released a roadmap detailing the network’s upgrades and activities for 2024.\n\nIn a series of tweets, Buterin stated that the 2024 roadmap contained few changes from the 2023 plan and that the network is set to focus on the Merge, the Surge, the Scourge, the Verge, the Purge, and the Splurge.\n\nEthereum’s Roadmap For 2024\n\nSince the Merge took place in September 2022, the Ethereum network will now prioritize implementing the role of a single slot finality (SSF). While the Merge saw Ethereum transition from a Proof-of-Work (PoW) consensus mechanism to that of Proof-of-Stake (PoS), SSF will resolve the network’s current weaknesses.\n\nThe concept of SSF can make Ethereum’s consensus mechanism validate blocks more efficiently; the blocks could be proposed and finalized in the same slot, significantly reducing time-to-finality by 15 minutes. Buterin believes this is the easiest path to fixing Ethereum’s PoS issues.\n\nThen comes the Surge with a goal of 100,000 transactions per second on rollups. The Ethereum co-founder revealed that cross-rollup standards and interop have been highlighted as areas for long-term improvements, and 2024 will see significant progress on rollup scaling both on EIP-4844 and from rollups themselves.\n\nEthereum is also looking to fix its centralization issues through the Scourge. Per the roadmap, the focus will be on mitigating such concerns in the network’s PoS design, especially around Maximal extractable value (MEV) and liquid staking or pooling. Buterin earlier recommended reducing the cost of running nodes to fix the challenge.\n\nEasing Block Verifications\n\nFurthermore, the roadmap mentioned the Verge, which could make block verification easier. Verkle trees are almost ready for inclusion, and soon, verifying blocks would only involve downloading some bytes of data, performing a few basic computations, and verifying a Succinct, Non-Interactive Argument of Knowledge (SNARK).\n\nThe network would explore Ethereum Virtual Machine (EVM) verification precompile to arrive at a fully SNARKed Ethereum.\n\nIn addition, the Purge will simplify the protocol, eliminate technical debts, and limit network participation costs, while the Splurge will fix everything else.\n\n“‘Increase L1 gas limit’ was removed to emphasize that the limit can be raised *at any time*; no need to wait for full SNARKs esp for small increases. ‘State expiry’ has been shrunk, to reflect a general consensus that it’s a fairly low-priority and low-urgency item esp given stateless clients and PBS / execution tickets,” Buterin explained."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxOcHkzOGhLZkxLdnhWc0NFUVVWNUZWUVg3SlZjR0NJSEJ3OWs4TXhMdEx2MEJlblN5Ym1FU3dvQkR0ejZnV3dNUHZmTlRvN29TUVRtazhHMlRmc1czV04zWFotWEtvdFoyV05yeENzUU5Cd3lNaEFGNjY2MW04QTl2bmhVSW1Cd9IBjgFBVV95cUxPUWUxWFRObjRlZTNYSzc1Qloya1NIaGxYQk1KbUJTWWN0ZUFKUWY3RDkyRVZzb0E4STE5NzhUU2d4VXBSb1lzNG9NbEp1emxIRFJJb005WnNfM0xUNkRTR3R2Tk15NTVXTWtON09KMk9SV0pPMUloRmFBWkQwV3luYXFTTkVVNUhXamdIZUhB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jan 2024 08:00:00 GMT",
        "title": "Dymension Is the Latest Airdrop for Solana, Ethereum, and Cosmos Users - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIt’s a new year, but airdrop season is continuing at full force into 2024. The latest: Dymension, a network for deploying app chains called “RollApps,” has revealed a token drop for more than a million crypto users across various chains and projects.\n\nDymension is a layer-1 blockchain built on Cosmos and the inter-blockchain communication protocol (IBC) to enable connections across various rollup scaling networks. “Dymension standardizes rollups with IBC, similar to how tokens were standardized with ERC,” Dymension wrote on Twitter (aka X), referring to Ethereum’s token standards.\n\nThe network lets RollApp creators choose which virtual machine and token to use, and can publish data to external chains like Celestia or Avail. Dymension CEO and co-founder Yishay Harel told Decrypt that the L1 network uses Ethereum Virtual Machine (EVM) addresses.\n\nOn Tuesday, Dymension revealed its “genesis rolldrop,” which offers up DYM tokens to eligible users until January 21. United States residents cannot participate in the airdrop. However, a wide array of other crypto users are eligible for the airdrop, with some 70 million DYM tokens (7% of the supply) being offered up.\n\nAD\n\nAD\n\nStarting today, over one million addresses have the opportunity to participate in Dymension’s Genesis Rolldrop! Eligible participants can claim up to 70M DYM (7% of total supply), the native asset of Dymension, until 21 January 2024, 12:00 UTC — Dymension (@dymension) January 2, 2024\n\nFull details are available in this blog post, but eligible users include those who staked the TIA token in Celestia as of December 19, 2023, along with users of Ethereum layer-2 networks Arbitrum, Optimism, Base, and the upcoming Blast based on certain criteria.\n\nCosmos Hub and Stride users who meet certain eligibility can also claim DYM tokens, along with users of the Osmosis decentralized exchange (DEX).\n\nMore than 500,000 Solana users are also eligible, according to the post, including addresses that have used protocols like cross-chain bridge Wormhole, leading NFT marketplace Tensor, and NFT distribution platform Drip.Haus.\n\nAD\n\nAD\n\nAdditionally, owners of Pudgy Penguins, Mad Lads, Tensorians, and Bad Kids NFTs can also claim an allotment of DYM tokens. Pudgy Penguins is minted on Ethereum, Mad Lads and Tensorians are on Solana, and Bad Kids is on the Cosmos-based Stargaze chain.\n\nLastly, following the genesis airdrop, Dymension has proposed allocating a further 2.5 million DYM to users who bridge funds to the chain from other networks. Eligible tokens include USDC, TIA, USDT, ATOM, ETH, and SOL, with that program expected to begin about a week following the upcoming Dymension airdrop launch.\n\nDymension joins a growing list of networks and projects that are dropping their tokens lately, including recent high-profile airdrops from Jito and Pyth Network and upcoming drops from the likes of Jupiter, Starknet, Portal, Frame, and Blast.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxQV1h3M0k5QlIyeE5PQ1NrYlVjOWgybUVQeEFwZDJCS2hVSW56b0hiSE9rem93N3RYLWtkekZIWno5d1RRa1V6NURlWWZqeXlsdWNvUzJycy1tVUdVd2FobG42WGs0NUFmclBQNjltcnpDNmZrT2JlUnh0a1FBaWVYdlRB0gGKAUFVX3lxTE9zY253aDN6Y2tvVTVMc0tFWC13X3d3WllGaHFsc1E5ZTdKOExCX2hyWTdWVW9SZk5DV3BuS3BvRVZzUnlKNW5vMTVrM1ZkdGVkdV9JSkMtZlFRY05fU1hvTy1PTHEtZ1lWUXppUWszMkZfYnowSmJwQk1TeW1sdFl2RnhfM1BYdFE0Zw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jan 2024 08:00:00 GMT",
        "title": "Solana NFT Sales Skyrocket, Topping Ethereum in Monthly Volume for First Time - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nSolana’s surging fortunes of late have produced a surprising result in the NFT market: monthly sales volume of NFTs on the network beat that of NFTs on Ethereum in December 2023, for the first time ever.\n\nAccording to data from analytics platform CryptoSlam, Solana NFT sales tallied about $366.5 million worth in December compared to $353.2 million on Ethereum. CryptoSlam’s “organic” sales figures exclude suspicious trades marked as “wash trading,” with about $381 million worth of Ethereum sales excluded and just $10.1 million worth of Solana sales pulled out.\n\nSolana’s total of $366.5 million in trades nearly matched the network’s all-time high, according to CryptoSlam, which was about $373.5 million worth in October 2021 as the space was just heating up. We’ve seen daily Solana NFT sales volume pop above Ethereum at times, but never in terms of a full month’s worth of trades.\n\nSolana saw about double the amount of unique buyers and sellers in December too, and far more total NFT transactions. CryptoSlam reports about 218,000 sellers and 279,000 buyers on Solana across nearly 6.6 million NFT transactions. Compare that to about 114,000 sellers and over 143,000 buyers on Ethereum, across 698,000 transactions.\n\nAD\n\nAD\n\nEthereum’s NFT sales volume in December was pretty much flat compared to November’s total of almost $350 million worth, while Solana saw a surge from about $83 million worth then.\n\nOf course, Solana has seen its price rise dramatically of late. SOL is up over 71% in the past month, and has more than quadrupled in price over the past three months. Ethereum, by contrast, is up 9% in the last 30 days and about 44% since three months ago.\n\nSolana’s price jump may be part of the reason why the value of its NFT sales spiked in December, but it doesn’t account for the roughly tripled number of unique traders and sixfold increase on monthly NFT transactions. Also, the average NFT sale on Solana actually fell from about $74 in November to under $56 in December.\n\nThe surge in users and transactions may be due to broader momentum around Solana and hype around particular projects tied to potential access to airdrops and other perks. Tensorians, for example, the NFT project tied to leading Solana marketplace Tensor, saw $28 million worth of trades in December, while Mad Lads generated $24.5 million in trades.\n\nAD\n\nAD\n\nAccording to CryptoSlam, the top Ethereum NFT project in December was the Bored Ape Yacht Club with $19.5 million worth of NFT trades, with Pudgy Penguins following behind with about $18.3 million worth of trades.\n\nAt a glance, CryptoSlam’s data suggests that Bitcoin Ordinals trades—that is, the protocol that enables NFT-like media to be put on the Bitcoin blockchain—generated more trading volume than Ethereum and Solana combined in December, with $881.2 million worth across over 493,000 transactions.\n\nHowever, CryptoSlam tracks Bitcoin Ordinals differently than it does NFTs on other networks. The data includes trading of BRC-20 tokens, which are minted via the Ordinals protocol but function like fungible, interchangeable tokens on other chains. CryptoSlam does not track the trading of Ethereum ERC-20 tokens or Solana SPL tokens, which are effectively similar to BRC-20 tokens.\n\nUncategorized Ordinals—that is, various media assets that aren’t part of a defined project—made up about $88.5 million worth of trades in December, with the top individual Ordinals project being Bitcoin Frogs at $27.7 million.\n\nThe next-highest ranking individual Ordinals project that isn’t a BRC-20 token? Bitcoin Punks, a CryptoPunks knockoff, with less than $3.3 million worth of trades in December. Fungible token trades make up an enormous portion of Ordinals trading tracked on the platform, making it difficult to take the Bitcoin figures at face value."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiUkFVX3lxTE4xa2VRY1hOYk8xRnE2MXg1VlZvVjNzWU1TenhVblNzQ3RtTXl5VmJIS3VtWUxFczByX1A2SmNGV1NicDZ1bDVGdURETDJXNzI2QWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jan 2024 08:00:00 GMT",
        "title": "A comprehensive outlook on altcoin predictions for 2024: trends and insights - crypto.news",
        "content": "Unpacking altcoin predictions for 2024, focusing on Ethereum’s advancements, Solana’s market position, and the trajectories of promising altcoins.\n\nAs 2023 has come to a close, let’s delve into the altcoins forecast and find out what might be next for these digital currencies.\n\nThroughout 2023, a few top altcoins stood out due to their impressive performance and notable advancements.\n\nInjective Protocol (INJ) leads the pack, showcasing a growth of over 3000% over the past year. This surge can be attributed to several factors, including its mainnet upgrade, which introduced new features like message signing, advanced balance indexing, and upgraded WASM smart contracts.\n\nFollowing closely is Immutable (IMX), which experienced over 490% surge. Immutable stood out for its approach to decentralized trading, aiming to offer a fully decentralized and trustless on-chain order book-based DEX development infrastructure.\n\nMeanwhile, THORchain (RUNE), another rising altcoin, saw its value increase over 340% last year despite difficult market conditions, reflecting the growing ecosystem of the Cosmos-based blockchain protocols.\n\nWhile the past performance of best-performing altcoins like INJ and IMX offers insights, the focus shifts to what the future holds, especially for the most promising altcoins for 2024.\n\nLet’s dive deeper and uncover the potential trends that could shape the altcoin price prediction in the upcoming year.\n\nEthereum L2s could gain the momentum\n\nIn 2024, the altcoin market, especially Ethereum (ETH) and its layer 2 (L2s) networks, is brimming with potential.\n\nEthereum’s upcoming upgrade, EIP-4844 (proto-danksharding), could significantly reduce transaction fees and enhance scalability. This is crucial for L2 chains like Polygon (MATIC), Arbitrum (ARB), and Optimism (OP).\n\nVanEck predicts that this upgrade could usher in a more efficient altcoin market. Particularly, it’s anticipated that within a year, Ethereum’s L2 networks will consolidate to 2-3 dominant players. These platforms could be major contributors to the altcoin forecast for 2024.\n\nVanEck even suggests that one of the best altcoins for 2024 could be the layer 2 network that surpasses Ethereum in monthly DEX volume and total value locked (TVL).\n\nThis increase in efficiency is likely to attract more trading volume and arbitrage opportunities, making these L2 networks some of the most promising altcoins for 2024.\n\nSolana could make strides in 2024\n\nAccording to VanEck analysts, Solana (SOL) is expected to emerge as a top-three blockchain in terms of market cap, TVL, and active users. This rise is attributed to Solana’s clear scalability roadmap, which may give it an edge over competitors like Ethereum.\n\nSolana’s defi ecosystem, already among the top five in TVL, has witnessed an impressive surge to around $1.5 billion as of January 2024 from $300 million levels in October.\n\nThis growth is spread across a vast number of wallet addresses and protocols, indicating a strong and active network.\n\nMoreover, VanEck analysts also predict that along with Bitcoin ETFs, several asset managers could file for Solana-based spot ETFs. This move could enhance Solana’s visibility and attract further investment.\n\nMeanwhile, Solana’s expected growth in TVL through Pyth, a Solana-based price oracle, could help Solana gain a substantial market share.\n\nThese developments suggest that Solana could be one of the most promising altcoins for 2024. Its potential growth in market cap, TVL, and user base, along with its probable venture into ETFs could redefine altcoin future predictions, especially in the DeFi sector.\n\nMost promising altcoins for 2024\n\nRipple (XRP)\n\nRipple’s (XRP) ongoing lawsuit with the SEC remains a crucial factor for its future. As of January, Ripple had secured some partial victories in court, with a key ruling stating that past XRP sales were not investment contract offers.\n\nThis has provided Ripple with a temporary advantage in the case. The lawsuit is expected to be resolved in spring 2024, and a favorable outcome for Ripple could positively influence XRP’s market value.\n\nThe anticipation of this resolution has been contributing to fluctuations in XRP’s price, with notable buying activity from large-scale investors hinting that it could positively impact altcoin’s price prediction.\n\nAvalanche (AVAX)\n\nAvalanche (AVAX) has been making strides as a decentralized platform for building and launching custom blockchain applications.\n\nIts consensus mechanism aims to enable rapid transaction finality and low transaction fees, making it an attractive platform for developers.\n\nThe growth of the defi market in 2024 could benefit AVAX, especially as it offers a scalable and user-friendly platform alternative to more established blockchains like Ethereum​​, making it one of the most promising altcoins.\n\nLido DAO (LIDO)\n\nLido DAO (LIDO) has gained significant attention due to its role in liquid staking, particularly on the Ethereum network. It has become a major contributor to Ethereum’s TVL, highlighting its growing importance in the DeFi space.\n\nThe success and innovations in liquid staking and its impact on Ethereum’s ecosystem put LIDO in the race to become one of the best altcoins for 2024.\n\nPolkadot (DOT)\n\nPolkadot’s (DOT) parachain feature has been a key factor in its growth. This feature allows multiple blockchains to connect and interact within the Polkadot network while maintaining their independent operations.\n\nThe potential for interoperability and the facilitation of cross-chain communication could make DOT one of the best-performing altcoins for 2024​.\n\nThe road ahead\n\nThe altcoin forecast for 2024 appears both promising and challenging. Investors eyeing the best altcoins for 2024 should remain vigilant, considering the volatile nature of the crypto market.\n\nFor those seeking the most promising altcoins for 2024, it’s essential to look beyond just the hype and deeply analyze the technological advancements, market trends, and regulatory shifts that could impact these digital assets.\n\nYou must exercise caution as the crypto market is notoriously fast-paced. While the potential for high returns is significant, so is the risk of loss.\n\nHappy investing, and don’t forget the golden rule: never invest more than you can afford to lose.\n\nFAQs\n\nWhat are the best altcoins to buy in 2024? Looking towards 2024, some of the best altcoins to consider for investment include the ones that match your risk appetite and investment goals. You should conduct thorough research and stay updated with the latest market trends when considering these most promising altcoins for 2024. Are altcoins a good investment? Altcoins can be a good investment, but they also come with a high level of risk due to the volatility of the cryptocurrency market. Due diligence, ongoing market research, and a careful altcoin forecast approach are key to making informed decisions in this space. Which altcoins can explode in 2024? Predicting which altcoins will explode in 2024 involves speculation, but based on current trends and developments, altcoins like Ethereum, Ripple, Avalanche, Lido DAO, and Polkadot show considerable promise. However, the crypto market is highly unpredictable, and investors should keep an eye on market trends to identify the best altcoins for 2024."
    }
]