[
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxOSzRYQW9IZnktdnJvWEVGT18ySmNvbkNaOFZ4aHBiLWJJTkY1Z0h5TFJXVEd5bkVfM096YlZpSy1aR19KU0FZRmpxNXFSbEF1ZkhCNV80bDA4VnY1RFk5cTRiLWN6a3dRVXlrdVpZdlhURVphMmxlVEo2UFBDVE4zZzBTdThYazJmSTV5dmtOMV9fdkN1TXNZVEVudW8tTzV3cWlVQUtzRW1vdUo2dHU0M9IBtgFBVV95cUxQV1ZKd1pyUjRWa1c3UWVWVWMyTkRTYUx2eTgyazV4cHhmSFZFc1dqWGM5bDVhaENndVJPM053MnczdEFWMG5mNjQwMGtVWm5tbTM5endtUFJ1RkFCR1hFOHNDdWFmQUZOV0dFNFNpZGZLdE5sSkRNd0U1Vlh5SUJhZkstZEhHVnkxWFQ2VEFOT1BLZTlGUmZNc0l2OHNtQUl0czdSdHpzRURnY3NPbF9CZUxuMUhKUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "Solana (SOL) Set to Skyrocket to $150 Again, Ethereum (ETH) Huge Gains Ahead? Massive Reversal Pattern Formed, Shiba Inu (SHIB) Stealth 20% Surge - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nSolana could be aiming at the $150 price threshold once again as the price starts showing reversal potential after reaching the 200 EMA. The trend flattening is often one of the first signs of an upcoming price reversal. However, it is important to stay cautious as in the midterm, Solana is still in a downtrend.\n\nThe SOL/ETH chart indicates that Solana has been steadily declining over the last several months, but there may be a shift in store as of late. The price has bounced back somewhat after touching the 200 EMA, which has served as a support level. This suggests that bullish momentum may be developing.\n\nNear the oversold area at about 35 is where the RSI is currently trading. This could mean that buyers are about to intervene and that the selling pressure is lessening. The MACD histogram also exhibits indications of a possible bullish crossover. An increase in purchasing activity is indicated by volume analysis, which may be good news for Solana.\n\nGiven the large uptick in volume bars, it appears that traders are beginning to stockpile SOL at these lower price points. Despite these encouraging indicators, it is critical to recognize the difficulties Solana may encounter while recovering.\n\nAdvertisement\n\nEthereum's reversal potential\n\nEthereum could be forming a ground for a price surge as the second-biggest cryptocurrency enters the falling wedge pattern formation in addition to relying on the 50 EMA. At this technical threshold, Ethereum could easily perform a reversal.\n\nThe falling wedge pattern is usually interpreted as a bullish reversal pattern indicating that an upward movement may be approaching and that the downtrend may be coming to an end. According to Ethereum's recent price action, the pattern's peak, which typically comes before a breakout, is getting closer. The blue line on the chart, the 50 EMA, has served as an important level of support. The fact that Ethereum's price has repeatedly rebounded from this level suggests that there is significant buying interest in this vicinity.\n\nEthereum's chances of a bullish breakout from the falling wedge pattern are greatly increased if it can hold this support. The relative strength index or RSI is currently trading close to 46, suggesting that Ethereum is neither overbought nor oversold.\n\nEthereum has the freedom to rise from this neutral position without being under a lot of selling pressure. Volume analysis indicates that buying activity is gradually increasing, indicating that traders are starting to accumulate Ethereum at these prices. The possibility of a bullish reversal is further supported by the fact that this accumulation phase frequently comes before a notable price movement.\n\nShiba Inu's last hope?\n\nDespite the enormous 25% price drop we saw on Shiba Inu, there is still some hope for a reversal at around $0.000018. However, a quick glance at the trading volume of Shiba Inu clearly shows that it is not the most favorable asset on the market right now.\n\nRecently, Shiba Inu's price dropped by 25%, indicating a significant decline. SHIB is now at a critical support level at $0.000018 due to the drop. This stage may serve as a possible turning point in the event that buyers intervene. Nevertheless, SHIB's trading volume has been comparatively low, suggesting that there isn't currently a lot of buying interest.\n\nOne significant element that could impede a speedy recovery is this low volume. Right now, the relative strength index (RSI) is circling the oversold area. This can suggest that a reversal is imminent and that the selling pressure may have been overdone. Nevertheless, a reversal cannot be ensured by the RSI alone — higher buying volume is required.\n\nResistant moves have been made by the moving averages, especially the 50 EMA. In order to verify a reversal, SHIB must make a significant volume breakout above these moving averages.\n\nEven though the Shiba Inu market is currently difficult, there is some hope because of the support level at $0.000018. We could witness a 20% increase if SHIB can maintain this support and return toward the moving average.\n\nAn important role is also played by the larger cryptocurrency market. SHIB may benefit if Ethereum and Bitcoin begin to rebound."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTE9fcWJQUVhPcFNXY0h1VDhCdi04V3BGMDJ4aTJpa1I0OXZlZG56b2RIWUNvSjZ6UU9JTDIzV21ONDlCaXdDTTdHZjJaYVYwQWpSdEdKVXhOYl9XUVJ3OEJIY3FJYUlVMkdHalE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "Who Holds The Most Ethereum (ETH) in 2024? - Benzinga",
        "content": "SHORT ANSWER: The Beacon Deposit Contract has emerged as the dominant force, holding a staggering 38% of all ETH.\n\nEthereum, the world's second-largest cryptocurrency by market cap, continues to power decentralized applications and fuel innovation. But who are the whales holding the vast majority of Ethereum? In 2024, the landscape of major ethereum holders might have shifted. This guide dives into the latest data, revealing the key players — from individual investors to institutional giants — who control the most ETH. Join us as we unveil the hidden forces shaping the ethereum ecosystem and explore the potential implications for the future of this dynamic cryptocurrency.\n\nWho Owns the Most Ethereum?\n\nWith the recent ethereum merge transitioning the network from Proof-of-Work (PoW) to Proof-of-Stake (PoS), a new player has emerged as the biggest ethereum (ETH) holder: the Beacon Chain Deposit Contract. This contract allows users to stake their ETH on the Beacon Chain, the foundation of Ethereum 2.0. This shift to PoS likely explains the Beacon Deposit Contract's significant holding, currently sitting at over 46 million ETH, representing a whopping 38% of all ether. This translates to a staggering value of approximately $165 billion at the time of writing. Essentially, users have locked their ETH in the contract to contribute to the security and validation of transactions on the Ethereum network.\n\nTop 10 Ethereum Holders\n\nLet’s explore the top 10 Ethereum holder of current times:\n\n1. Beacon Deposit Contract\n\nThe Ethereum Merge to Proof-of-Stake (PoS) created a powerful new dynamic with the Beacon Deposit Contract. This contract lets users stake their ETH on the Beacon Chain, the core of Ethereum 2.0. This explains the Beacon Deposit Contract's massive holding — over 46 million ETH, a huge 30% of all Ethereum! Worth roughly $165 billion, users essentially locked their ETH to secure and validate ethereum transactions.\n\n2. Wrapped Ether Contract\n\nWrapped ether (WETH) plays a key role in Decentralized Finance (DeFi) applications. Since regular ETH isn't compatible with these platforms, WETH acts as a “wrapped” version that functions as an ERC-20 token. This allows users to seamlessly use their ETH on DeFi apps like Uniswap. Notably, the value of WETH remains identical to regular ETH, offering increased functionality without impacting price. Interestingly, the WETH contract holds a significant amount of ether, currently sitting at over 2.84 million ETH, making it the second-largest holder in the network.\n\n3. Binance 7\n\nBinance, the world's leading cryptocurrency exchange by trading volume, is also a major Ethereum (ETH) holder. Surprisingly, just three of its main ETH addresses (Binance 7, 8, and 28) collectively hold over 3.2 million ETH, making them the network's third-largest holder. These addresses manage exchange functions and bridge ETH between Binance Smart Chain (BSC) and Ethereum. The bridged ETH resides in the “Peg Tokens” address until it's withdrawn back to the Ethereum network.\n\n4. Arbitrum: Bridge\n\nArbitrum, a popular ethereum scaling solution, is emerging as a significant ETH holder. This technology allows users to interact with decentralized applications (dApps) and deploy smart contracts on a faster and cheaper network compared to Ethereum's mainnet. At the heart of Arbitrum lies its bridge contract, currently holding over 1.8 million ETH. This positions the bridge as the network's fourth-largest ETH holder. As Arbitrum gains traction due to its cost efficiency, this holding will likely increase further.\n\n5. Robinhood\n\nRobinhood, the popular trading app known for its commission-free stock trading, also holds a surprising amount of Ethereum. Despite some past controversies, Robinhood is the 5th largest individual holder of Ethereum, with nearly 1.4 million ETH under a single wallet address. This means Robinhood is a major player in the ethereum world, holding a large amount of this cryptocurrency.\n\n6. Kraken\n\nDespite facing SEC charges related to staking options, cryptocurrency exchange Kraken ranks as a major Ethereum holder. Their “Kraken 13\" wallet alone holds over 850,000 ETH, making it the 6th largest individual holder. Given Kraken's high trading volume, they likely hold even more ETH in smaller amounts across other wallets, though these wouldn't be on the top 100 individual address lists.\n\n7. Base: Base Portal\n\nNewcomer Base Portal is making waves in the Ethereum world. This project acts as a bridge, allowing users to move their ethereum (ETH) between different blockchains easily. Interestingly, Base Portal holds a significant amount of ETH, currently ranking as the 7th largest individual holder with over 504,000 ETH. This substantial holding suggests Base Portal might play a vital role in the Ethereum ecosystem, but it's still too early to say for certain.\n\n8. Bitfinex 19\n\nAnother major exchange by volume, Bitfinex, stands at 8th position and holds a significant amount of ETH scattered across five top 100 addresses: Bitfinex 19, MultiSig 3, 20, 15, and 5. These collectively hold around 2 million ETH. Two addresses likely serve trading and exchange functions, while the “MultiSig 3\" address might be their secure cold storage wallet due to its multi-signature nature.\n\n9. Gemini\n\nThe Gemini exchange, founded by the Winklevoss twins, is a major ethereum player. Their single wallet address ranks 9th largest holder, containing over 369,000 ETH. This positions Gemini as one of the top exchanges for holding ether, showcasing their confidence in this cryptocurrency.\n\n10. EthDev\n\nThe nonprofit ethereum Foundation oversees Ethereum's development. ETHDEV, a separate group of developers in cities like London and Berlin, acts as the project's development arm. As Ethereum matured, other organizations like ConsenSys joined the ecosystem to tackle specific areas. This division of labor allows focused development and benefits the entire ethereum network. Interestingly, ETHDEV holds over 309,000 ETH, ranking 10th among the largest ether holders.\n\nThe Largest Holders are Contracts, Not People\n\nThe landscape of major ETH holders has shifted significantly in 2024. The Beacon Deposit Contract, a product of the ethereum merge, has emerged as the dominant force, holding a staggering 38% of all ETH. This reflects users' commitment to securing the network by staking their ETH. Wrapped ethereum (WETH), crucial for DeFi applications, sits at number two with over 2.8 million ETH. Major cryptocurrency exchanges like Binance and Kraken are also major players, holding significant amounts across multiple wallets. Interestingly, newcomer Base Portal and the Winklevoss twins' Gemini exchange showcase the growing involvement of diverse players in the ethereum ecosystem. While the distribution of ETH ownership highlights its decentralized nature, the Beacon Deposit Contract's dominance underscores the critical role users play in securing the ethereum network.\n\nFrequently Asked Questions"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTE9fcWJQUVhPcFNXY0h1VDhCdi04V3BGMDJ4aTJpa1I0OXZlZG56b2RIWUNvSjZ6UU9JTDIzV21ONDlCaXdDTTdHZjJaYVYwQWpSdEdKVXhOYl9XUVJ3OEJIY3FJYUlVMkdHalE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "Who Holds The Most Ethereum (ETH) in 2024? - Benzinga",
        "content": "SHORT ANSWER: The Beacon Deposit Contract has emerged as the dominant force, holding a staggering 38% of all ETH.\n\nEthereum, the world's second-largest cryptocurrency by market cap, continues to power decentralized applications and fuel innovation. But who are the whales holding the vast majority of Ethereum? In 2024, the landscape of major ethereum holders might have shifted. This guide dives into the latest data, revealing the key players — from individual investors to institutional giants — who control the most ETH. Join us as we unveil the hidden forces shaping the ethereum ecosystem and explore the potential implications for the future of this dynamic cryptocurrency.\n\nWho Owns the Most Ethereum?\n\nWith the recent ethereum merge transitioning the network from Proof-of-Work (PoW) to Proof-of-Stake (PoS), a new player has emerged as the biggest ethereum (ETH) holder: the Beacon Chain Deposit Contract. This contract allows users to stake their ETH on the Beacon Chain, the foundation of Ethereum 2.0. This shift to PoS likely explains the Beacon Deposit Contract's significant holding, currently sitting at over 46 million ETH, representing a whopping 38% of all ether. This translates to a staggering value of approximately $165 billion at the time of writing. Essentially, users have locked their ETH in the contract to contribute to the security and validation of transactions on the Ethereum network.\n\nTop 10 Ethereum Holders\n\nLet’s explore the top 10 Ethereum holder of current times:\n\n1. Beacon Deposit Contract\n\nThe Ethereum Merge to Proof-of-Stake (PoS) created a powerful new dynamic with the Beacon Deposit Contract. This contract lets users stake their ETH on the Beacon Chain, the core of Ethereum 2.0. This explains the Beacon Deposit Contract's massive holding — over 46 million ETH, a huge 30% of all Ethereum! Worth roughly $165 billion, users essentially locked their ETH to secure and validate ethereum transactions.\n\n2. Wrapped Ether Contract\n\nWrapped ether (WETH) plays a key role in Decentralized Finance (DeFi) applications. Since regular ETH isn't compatible with these platforms, WETH acts as a “wrapped” version that functions as an ERC-20 token. This allows users to seamlessly use their ETH on DeFi apps like Uniswap. Notably, the value of WETH remains identical to regular ETH, offering increased functionality without impacting price. Interestingly, the WETH contract holds a significant amount of ether, currently sitting at over 2.84 million ETH, making it the second-largest holder in the network.\n\n3. Binance 7\n\nBinance, the world's leading cryptocurrency exchange by trading volume, is also a major Ethereum (ETH) holder. Surprisingly, just three of its main ETH addresses (Binance 7, 8, and 28) collectively hold over 3.2 million ETH, making them the network's third-largest holder. These addresses manage exchange functions and bridge ETH between Binance Smart Chain (BSC) and Ethereum. The bridged ETH resides in the “Peg Tokens” address until it's withdrawn back to the Ethereum network.\n\n4. Arbitrum: Bridge\n\nArbitrum, a popular ethereum scaling solution, is emerging as a significant ETH holder. This technology allows users to interact with decentralized applications (dApps) and deploy smart contracts on a faster and cheaper network compared to Ethereum's mainnet. At the heart of Arbitrum lies its bridge contract, currently holding over 1.8 million ETH. This positions the bridge as the network's fourth-largest ETH holder. As Arbitrum gains traction due to its cost efficiency, this holding will likely increase further.\n\n5. Robinhood\n\nRobinhood, the popular trading app known for its commission-free stock trading, also holds a surprising amount of Ethereum. Despite some past controversies, Robinhood is the 5th largest individual holder of Ethereum, with nearly 1.4 million ETH under a single wallet address. This means Robinhood is a major player in the ethereum world, holding a large amount of this cryptocurrency.\n\n6. Kraken\n\nDespite facing SEC charges related to staking options, cryptocurrency exchange Kraken ranks as a major Ethereum holder. Their “Kraken 13\" wallet alone holds over 850,000 ETH, making it the 6th largest individual holder. Given Kraken's high trading volume, they likely hold even more ETH in smaller amounts across other wallets, though these wouldn't be on the top 100 individual address lists.\n\n7. Base: Base Portal\n\nNewcomer Base Portal is making waves in the Ethereum world. This project acts as a bridge, allowing users to move their ethereum (ETH) between different blockchains easily. Interestingly, Base Portal holds a significant amount of ETH, currently ranking as the 7th largest individual holder with over 504,000 ETH. This substantial holding suggests Base Portal might play a vital role in the Ethereum ecosystem, but it's still too early to say for certain.\n\n8. Bitfinex 19\n\nAnother major exchange by volume, Bitfinex, stands at 8th position and holds a significant amount of ETH scattered across five top 100 addresses: Bitfinex 19, MultiSig 3, 20, 15, and 5. These collectively hold around 2 million ETH. Two addresses likely serve trading and exchange functions, while the “MultiSig 3\" address might be their secure cold storage wallet due to its multi-signature nature.\n\n9. Gemini\n\nThe Gemini exchange, founded by the Winklevoss twins, is a major ethereum player. Their single wallet address ranks 9th largest holder, containing over 369,000 ETH. This positions Gemini as one of the top exchanges for holding ether, showcasing their confidence in this cryptocurrency.\n\n10. EthDev\n\nThe nonprofit ethereum Foundation oversees Ethereum's development. ETHDEV, a separate group of developers in cities like London and Berlin, acts as the project's development arm. As Ethereum matured, other organizations like ConsenSys joined the ecosystem to tackle specific areas. This division of labor allows focused development and benefits the entire ethereum network. Interestingly, ETHDEV holds over 309,000 ETH, ranking 10th among the largest ether holders.\n\nThe Largest Holders are Contracts, Not People\n\nThe landscape of major ETH holders has shifted significantly in 2024. The Beacon Deposit Contract, a product of the ethereum merge, has emerged as the dominant force, holding a staggering 38% of all ETH. This reflects users' commitment to securing the network by staking their ETH. Wrapped ethereum (WETH), crucial for DeFi applications, sits at number two with over 2.8 million ETH. Major cryptocurrency exchanges like Binance and Kraken are also major players, holding significant amounts across multiple wallets. Interestingly, newcomer Base Portal and the Winklevoss twins' Gemini exchange showcase the growing involvement of diverse players in the ethereum ecosystem. While the distribution of ETH ownership highlights its decentralized nature, the Beacon Deposit Contract's dominance underscores the critical role users play in securing the ethereum network.\n\nFrequently Asked Questions"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiakFVX3lxTE9fcWJQUVhPcFNXY0h1VDhCdi04V3BGMDJ4aTJpa1I0OXZlZG56b2RIWUNvSjZ6UU9JTDIzV21ONDlCaXdDTTdHZjJaYVYwQWpSdEdKVXhOYl9XUVJ3OEJIY3FJYUlVMkdHalE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "Who Holds The Most Ethereum (ETH) in 2024? - Benzinga",
        "content": "SHORT ANSWER: The Beacon Deposit Contract has emerged as the dominant force, holding a staggering 38% of all ETH.\n\nEthereum, the world's second-largest cryptocurrency by market cap, continues to power decentralized applications and fuel innovation. But who are the whales holding the vast majority of Ethereum? In 2024, the landscape of major ethereum holders might have shifted. This guide dives into the latest data, revealing the key players — from individual investors to institutional giants — who control the most ETH. Join us as we unveil the hidden forces shaping the ethereum ecosystem and explore the potential implications for the future of this dynamic cryptocurrency.\n\nWho Owns the Most Ethereum?\n\nWith the recent ethereum merge transitioning the network from Proof-of-Work (PoW) to Proof-of-Stake (PoS), a new player has emerged as the biggest ethereum (ETH) holder: the Beacon Chain Deposit Contract. This contract allows users to stake their ETH on the Beacon Chain, the foundation of Ethereum 2.0. This shift to PoS likely explains the Beacon Deposit Contract's significant holding, currently sitting at over 46 million ETH, representing a whopping 38% of all ether. This translates to a staggering value of approximately $165 billion at the time of writing. Essentially, users have locked their ETH in the contract to contribute to the security and validation of transactions on the Ethereum network.\n\nTop 10 Ethereum Holders\n\nLet’s explore the top 10 Ethereum holder of current times:\n\n1. Beacon Deposit Contract\n\nThe Ethereum Merge to Proof-of-Stake (PoS) created a powerful new dynamic with the Beacon Deposit Contract. This contract lets users stake their ETH on the Beacon Chain, the core of Ethereum 2.0. This explains the Beacon Deposit Contract's massive holding — over 46 million ETH, a huge 30% of all Ethereum! Worth roughly $165 billion, users essentially locked their ETH to secure and validate ethereum transactions.\n\n2. Wrapped Ether Contract\n\nWrapped ether (WETH) plays a key role in Decentralized Finance (DeFi) applications. Since regular ETH isn't compatible with these platforms, WETH acts as a “wrapped” version that functions as an ERC-20 token. This allows users to seamlessly use their ETH on DeFi apps like Uniswap. Notably, the value of WETH remains identical to regular ETH, offering increased functionality without impacting price. Interestingly, the WETH contract holds a significant amount of ether, currently sitting at over 2.84 million ETH, making it the second-largest holder in the network.\n\n3. Binance 7\n\nBinance, the world's leading cryptocurrency exchange by trading volume, is also a major Ethereum (ETH) holder. Surprisingly, just three of its main ETH addresses (Binance 7, 8, and 28) collectively hold over 3.2 million ETH, making them the network's third-largest holder. These addresses manage exchange functions and bridge ETH between Binance Smart Chain (BSC) and Ethereum. The bridged ETH resides in the “Peg Tokens” address until it's withdrawn back to the Ethereum network.\n\n4. Arbitrum: Bridge\n\nArbitrum, a popular ethereum scaling solution, is emerging as a significant ETH holder. This technology allows users to interact with decentralized applications (dApps) and deploy smart contracts on a faster and cheaper network compared to Ethereum's mainnet. At the heart of Arbitrum lies its bridge contract, currently holding over 1.8 million ETH. This positions the bridge as the network's fourth-largest ETH holder. As Arbitrum gains traction due to its cost efficiency, this holding will likely increase further.\n\n5. Robinhood\n\nRobinhood, the popular trading app known for its commission-free stock trading, also holds a surprising amount of Ethereum. Despite some past controversies, Robinhood is the 5th largest individual holder of Ethereum, with nearly 1.4 million ETH under a single wallet address. This means Robinhood is a major player in the ethereum world, holding a large amount of this cryptocurrency.\n\n6. Kraken\n\nDespite facing SEC charges related to staking options, cryptocurrency exchange Kraken ranks as a major Ethereum holder. Their “Kraken 13\" wallet alone holds over 850,000 ETH, making it the 6th largest individual holder. Given Kraken's high trading volume, they likely hold even more ETH in smaller amounts across other wallets, though these wouldn't be on the top 100 individual address lists.\n\n7. Base: Base Portal\n\nNewcomer Base Portal is making waves in the Ethereum world. This project acts as a bridge, allowing users to move their ethereum (ETH) between different blockchains easily. Interestingly, Base Portal holds a significant amount of ETH, currently ranking as the 7th largest individual holder with over 504,000 ETH. This substantial holding suggests Base Portal might play a vital role in the Ethereum ecosystem, but it's still too early to say for certain.\n\n8. Bitfinex 19\n\nAnother major exchange by volume, Bitfinex, stands at 8th position and holds a significant amount of ETH scattered across five top 100 addresses: Bitfinex 19, MultiSig 3, 20, 15, and 5. These collectively hold around 2 million ETH. Two addresses likely serve trading and exchange functions, while the “MultiSig 3\" address might be their secure cold storage wallet due to its multi-signature nature.\n\n9. Gemini\n\nThe Gemini exchange, founded by the Winklevoss twins, is a major ethereum player. Their single wallet address ranks 9th largest holder, containing over 369,000 ETH. This positions Gemini as one of the top exchanges for holding ether, showcasing their confidence in this cryptocurrency.\n\n10. EthDev\n\nThe nonprofit ethereum Foundation oversees Ethereum's development. ETHDEV, a separate group of developers in cities like London and Berlin, acts as the project's development arm. As Ethereum matured, other organizations like ConsenSys joined the ecosystem to tackle specific areas. This division of labor allows focused development and benefits the entire ethereum network. Interestingly, ETHDEV holds over 309,000 ETH, ranking 10th among the largest ether holders.\n\nThe Largest Holders are Contracts, Not People\n\nThe landscape of major ETH holders has shifted significantly in 2024. The Beacon Deposit Contract, a product of the ethereum merge, has emerged as the dominant force, holding a staggering 38% of all ETH. This reflects users' commitment to securing the network by staking their ETH. Wrapped ethereum (WETH), crucial for DeFi applications, sits at number two with over 2.8 million ETH. Major cryptocurrency exchanges like Binance and Kraken are also major players, holding significant amounts across multiple wallets. Interestingly, newcomer Base Portal and the Winklevoss twins' Gemini exchange showcase the growing involvement of diverse players in the ethereum ecosystem. While the distribution of ETH ownership highlights its decentralized nature, the Beacon Deposit Contract's dominance underscores the critical role users play in securing the ethereum network.\n\nFrequently Asked Questions"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMizgFBVV95cUxQMHhnRUsyNFFqdUVzVUNkd29rSEhWR2xyNUlIdnNNampLc01xRlp6blo0REpiYWVZZDNOQlRyWkJkbUdJS0xkRGVkX0ZKTXRWcGtnYUFnOGJicHY1dUh0dWZkUHkwNmFaZUw1a0Ywd3pMTmx6ZzI3ZTM5MFZ6Q0hGemVGZE1pem9XaVc5TkViRWZuVVZGUDFQRldncGNQRW1QcV9QdjlBRkJEZENXRGR0ODZSZlctUlQwNkxPQ0VsMlFnbnhLVkZHb3ZYVE14Zw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "Securities and cryptocurrencies: The SEC drops the Ethereum case, but continues to pursue Ripple - The Cryptonomist",
        "content": "The latest news from the crypto market talks about new developments in the respective cases of the SEC against Ripple and Ethereum in relation to the security token issue.\n\nThe federal agency of the United States has definitively abandoned all investigations on the Ethereum Foundation, determining that ETH does not fall within the definition of security and thus preparing for the asset’s entry into U.S. exchange-traded funds.\n\nIn the meantime, the dispute against Ripple continues, with the SEC requesting a fine of over 100 million dollars, awaiting the resolution of the case at the trial that will determine once and for all if XRP should be considered a financial security or not.\n\nAll the details below.\n\nThe SEC concludes investigations on ETH: everything ready for the launch of spot ETFs\n\nAccording to recent reports from the cryptographic developer Consensys, the SEC is about to drop all investigations into the Ethereum Foundation, first initiated in March 2023 with the intention of classifying ETH as a security token.\n\nAs reported within the post “Ethereum has survived the SEC” and now the insiders of the well-known blockchain of smart contracts will be able to build freely without having to worry about regulatory limitations.\n\nThis very important milestone for the sector comes after Consensys had sued the SEC on April 25, only to renegotiate with the agency on June 7, requesting the case to be closed.\n\nETHEREUM SURVIVES THE SEC.\n\n\n\nToday we’re happy to announce a major win for Ethereum developers, technology providers, and industry participants: the Enforcement Division of the SEC has notified us that it is closing its investigation into Ethereum 2.0.\n\n\n\nThis means that the SEC… — Consensys (@Consensys) June 19, 2024\n\nETH no longer considered a financial commodity, after 6 years in which the SEC has repeatedly changed its mind on the matter. Initially, in fact, in 2018 it expressed opposition to this connection, only to return to accuse the issuers of the currency of selling unregistered securities after the chain’s consensus mechanism transitioned from PoW to PoS.\n\nTo tell the truth, even Gary Gensler, chairman of the Commission, has never given a clear and precise definition regarding Ethereum, while he had expressed himself in a much more convinced manner for other cryptographic products such as those offered by Ripple, Cardano, and Dash.\n\nDuring a testimony to Congress last year, he indeed refused to answer the question of whether ETH fell under the definition of security and if it meets the requirements of the Howey Test.\n\nJUST IN: 🇺🇸 SEC Chair Gensler refuses to answer if Ethereum $ETH is a commodity or a security while testifying before congress. pic.twitter.com/IkDTgNrfix — Watcher.Guru (@WatcherGuru) April 18, 2023\n\nNow that the SEC has closed the investigations on Ethereum, we can officially prepare for the listing of the cryptocurrency in the spot ETF markets in the United States.\n\nThe Securities and Exchange Commission had already approved this kind of financial products with underlying ether in May, but the S-1 applications of the registrants were not given the green light.\n\nThe landing of exchange-traded funds for ETH could now be very close: indicatively the listing is expected by the beginning of autumn but it could also arrive in the coming weeks.\n\nThe asset managers like BlackRock, Fidelity, and Bitwise are getting ready by starting to release the first promotional videos of the next investment offering, implying that it is only a matter of time before Ethereum makes an appearance on Wall Street.\n\nUnlike Big Finance, Ethereum doesn't clock out at 4 p.m. pic.twitter.com/0gCJi3wlXp — Bitwise (@BitwiseInvest) June 20, 2024\n\nDespite the victory against the SEC in a historic lawsuit, Consensys warns that the broader web3 sector could still be under the watchful eye of the federal agency.\n\nAs reported in a post from last week:\n\n“The closure of the Ethereum investigation is important, but it is not a cure for the numerous blockchain developers, technology providers, and industry participants who have suffered under the SEC’s illegal and aggressive cryptocurrency enforcement regime.”\n\nThe SEC abandons Ethereum, but continues the case against Ripple: the 100 million dollar fine\n\nOne of the cryptocurrency companies still in the eye of the storm is Ripple, with the SEC motivated to classify XRP as a security despite a court having refuted this connection last year.\n\nAt this moment the Federal Securities and Exchange Commission is asking the company that manages the issuance of the cryptocurrency, for compensation of 102.6 million dollars after reducing the amount from an initial fine set at 2 billion dollars for selling XRP without a license.\n\nRipple refuses to give in to this bullismo, and has recently proposed a fine of 10 million dollars, citing the agreement with Terraform Labs as justification. However, the SEC has countered that such a low fine “would not meet the purposes of civil penalty laws.”\n\nThe regulator has indeed clarified that Terraform Labs has agreed to destroy “the keys to all its securities in crypto assets”, “return a significant amount to investors in those securities”, and remove “two of the board members in command at the time of the violations”.\n\nAs stated by the SEC itself:\n\n“Ripple also confronts the dimension of the sanction of Terraform with the amount of the ‘gross sales’ of that defendant, arguing that the Court should impose the same ratio (1.27%). But this is not an apples-to-apples comparison”\n\nIn the middle of this debate, last week Judge Phyllis Hamilton dismissed at least the 4 compensation claims in separate class actions, while still keeping the main case alive to label Ripple’s token as an unregistered security.\n\nIn particular, Hamilton focused on the fact that Brad Garlinghouse, founder of the accused company, had insistently promoted the currency in 2017 while he himself was proceeding to sell large shares on the market.\n\nThe promotional activity of Ripple which Judge Hamilton may be treating with more weight than Judge Torres could give the expectation. There seems to be some additional evidence of promotional statements before Judge Hamilton. The whole remaining cause of action going forward… https://t.co/Cd1RS4xQgX — bill morgan (@Belisarius2020) June 21, 2024\n\nDespite Judge Annalisa Torres having previously closed the XRP-security case, now everything seems to be back in the spotlight: the ball is now in the court of the trial, which will decide whether to classify Ripple’s digital currency used for cross-border payments as a financial security.\n\nThe SEC is trying to assert itself by instilling fear in the entire digital token industry, in order to “discourage future misconduct in the cryptocurrency sector“.\n\nIn the meantime, while the federal agency limits the expansion of the crypto sector with these attempts at destabilization, more and more famous personalities and US celebrities are illegally promoting tokens linked to their name, which inevitably end up causing their investors to lose money."
    }
]