[
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxNOGNQZG11bDJIamNqNndpeXM4VG04dXpMMWxxVkJ2ZjFoMWt0ZjVNN29LZlh3dk9YODV3aWVyR28xTUNQNG5JS2JmZHhENG5rdFNCanJ4VnMzOWhxa3NrNzVuYm1Ob0Z2SEtOeUtSYVdXNXVWajZIZWg3UzNoeWFCeWUxMXdoeWZiMmYyQzRxWWx6UURXZm1IekFTUE8wbWloYjhYZkNwSVVqT0JBZHpjS2NNdGZWS2ZDekF0X3hvemzSAcYBQVVfeXFMTUhWcnhTOElTTzdyM0xOYThxYzFreDUtSFp5QlFIbHVFVnNHRjJ2SllJclM3R1JjVHZ2WkxNMUEzajJYamJsOGsyMWFxUVNZMlpJMGhfaHpVMDY4OEhEZDh6WUFYWnNqTVlpZkJMQW5YOGoySXJLZlQ5NUhQVlBLNldfNHpKdU96ejBTeXA3aFVLWUpUNm00Wk5nQTdVOWp3V2tRaVdKWVFVMVNsRXdQNVRzd3RXMER4NXpFaUdCYUUyLVFjMWhR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Apr 2024 07:00:00 GMT",
        "title": "VanEck CEO Says Transaction Fee Is Bigger Story Than Bitcoin or Ethereum ETFs - CoinDesk",
        "content": "With new solutions for lower and much more predictable transaction fees, developers can now build applications that are much more useful, which Jan Van Eck predicts will be more prominent going forward. \"The most interesting thing happening in crypto to me right now is that you have databases that can scale, that can take a lot of users of high uptime and now have predictable costs. And so real stuff can be built on these databases now,\" he said. \"We're going to see that in the next couple of years.\""
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxQdEx5MWtCblFOYzBXT3dGeDlITUJtZGF4X3BpaVBITVlHT09ZSnpMaS1zRTEtdUNkXzlxWXppX1U0b2VNbF93RVZvcm5pZmczS1ZBcHVnb2xTTW9ScHU2VHVRVlJvVnhwUkJoMW85eTEyempUcnU4WGF2YmNfa0lZdkxKMDYwazjSAY8BQVVfeXFMT2ppZkZEamctQXFFRVpadTNvUFlvamdHc2loOHdQVEE0UWpPUVU2bXBSZTJ5WlFHSUxERThEU0tGRndVZHV5ODJKZnBrRzVCc0FGM1Y2bVotUDgxTzhSTmx6cjFmVXY3TW4xajRGWThfMHA5ZDJOQW1NMUpVU3VfMFhHVlAxRE94cndjdWdvSVU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Apr 2024 07:00:00 GMT",
        "title": "What Is Monad? The Ethereum, Solana Rival Just Raised $225 Million - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIn 2024’s largest crypto raise so far, Monad Labs, the firm behind the upstart layer-1 network Monad, secured a whopping $225 million in funding on Monday from a round led by crypto venture juggernaut Paradigm.\n\nThe raise, which was also supported by crypto VC Electric Capital and the tech investment firm Greenoaks, constitutes a significant show of faith by crypto mainstays that Monad—which has yet to launch—will become a speedy, affordable, and dependable decentralized finance (DeFi) alternative to both the Ethereum ecosystem and layer-1 networks like Solana.\n\nFounded in 2022 by Jump Crypto alum Keone Hon, Monad is an Ethereum Virtual Machine (EVM)-compatible network that is seeking to fill what is sees as a gap in the current crypto landscape: A blockchain able to easily interact with the Ethereum ecosystem, that is distinctly more capable of accommodating extremely high traffic while remaining speedy, cheap, and secure.\n\nThere are plenty of blockchains out there that would argue they already fit that criteria, to be sure. Following the landmark Dencun upgrade last month, Ethereum layer-2 scaling networks like Arbitrum, Optimism, and Base have seen transaction costs plummet to near-zero. If any of those networks were to see massive upticks in usage, however, their gas fees would almost certainly spike.\n\nAD\n\nAD\n\nNon-Ethereum layer-1 networks, particularly Solana, have ballooned in popularity in recent months—particularly for DeFi users—due to their speed and lower fees. But Solana has also suffered repeated outages as it attempts to scale to become a linchpin of the crypto ecosystem.\n\nBy offering full capability with EVM—the software that powers Ethereum, and all networks built on top of it—Monad appears to be tapping into the dominant influence Ethereum has over crypto users and developers, while simultaneously attempting to build a more streamlined version of the network from the ground up.\n\nIt also looks like a play for attracting top-level developers. According to a January report from Electric Capital, some 90% of crypto developers working on multiple chains work with EVM.\n\nOther EVM-compatible layer-one networks are already out there, most notably Avalanche and BNB Chain, the latter of which was created by Binance. But Monad Labs’ fundraise today marks the flashiest entry into the crowded blockchain ecosystem in some time—certainly since the crypto crash of 2022.\n\nAD\n\nAD\n\n“We are excited about Monad because it solves one of the critical bottlenecks in scalability for the Ethereum ecosystem: the Ethereum Virtual Machine,” Electric Capital Managing Partner Avichal Garg told Decrypt. “Monad’s parallelized EVM can unlock a 100x improvement in throughput in the EVM ecosystem and make consumer-grade, decentralized applications possible.”\n\nPrior to today’s news, Monad Labs previously raised a $19 million seed funding round in early 2023, led by Dragonfly Capital.\n\nEdited by Andrew Hayward"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE8zNU5FdXZ0SWJ3UEdIR0dRV0lYczJybHJpLThyOFpBQkRKbjlwbV9yd20wYVBXdGxaWWdBcTkzNlZibnFELW4yNzFMeHJjRFU3dVh6X2Mwd2lXZ0lGeGVHOXJkakhPWXVBYTRtTWxkcDRRZkk4QUhF?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Apr 2024 07:00:00 GMT",
        "title": "Restaking protocol EigenLayer heads to Ethereum mainnet - Blockworks",
        "content": "EigenLayer, the highly-anticipated Ethereum restaking protocol that has attracted billions of dollars worth of customer deposits, went to mainnet Tuesday afternoon.\n\nEigenLayer’s data availability solution, named EigenDA, also went live as an actively validated service (AVS) built on top of EigenLayer.\n\nThe launch came with training wheels of sorts, however, as critical components of EigenLayer are not set to go live until later this year.\n\nEthereum is secured by ether (ETH) that is staked, or pledged to earn yield in return for accurately verifying transactions. EigenLayer takes this a step further with restaking, which allows staked ETH be restaked and used to secure and run AVSs, which are various blockchain-based platforms built on EigenLayer.\n\nRead more: Restaking platform EigenLayer ‘flips’ Aave in TVL\n\nWith the mainnet launch, restakers can now delegate their restaked balance to EigenLayer operators, who can then run AVSs.\n\nEigenLayer’s total value locked (TVL) has raced above $13 billion in the past few months, making it the second-largest DeFi protocol according to DeFiLlama. EigenLayer’s offering of points for depositors, which some speculate will determine allocation in a future token, played a major part in the rapid growth.\n\nIt has also benefited from the popularity of liquid restaking tokens that restake deposits and issue liquid tokens in return, similarly to how Lido’s stETH works.\n\nRead more: DeFi ‘points’ farming has reshaped the crypto investment landscape\n\nSome have expressed concerns over potential risks that could stem from restaking, which until now was a totally unproven model for Ethereum security.\n\nAny risk that EigenLayer could create “feels very systemic,” Sebastian Higgs, chief operating officer of Cordial Systems, told Blockworks prior to the mainnet launch.\n\n“If there is an issue, the knock-on impact could be far reaching and so that’s why I’m proceeding very cautiously and I still have more questions than answers at this point,” said Higgs.\n\nWhatever those risks may be, they aren’t likely to surface quite yet. In an X thread announcing its mainnet, EigenLayer said it would allow its marketplace to “develop and stabilize” before introducing in-protocol payments and slashing later this year. In this case, slashing refers to an EigenLayer operator being financially punished for not adhering to rules set by an AVS.\n\nIf payments are enabled before slashing, operators and liquid restaking tokens would likely support every AVS, Ian Unsworth, co-founder of Kairos Research, told Blockworks. “[B]ut once slashing gets implemented, we will see a ‘de-leveraging’ so to speak, as the stake gets re-delegated to reflect the actual risk.”\n\nThe mainnet launch means some large venture bets will start to play out. A16z invested $100 million into Eigen Labs in February, adding to the $50 million it raised in early 2023. Multiple recently-funded startups are also teed up to become AVSs, including shared sequencer marketplace Espresso and restaked rollup provider AltLayer.\n\nRead more: Espresso lands $28M to become marketplace for shared sequencing\n\nElsewhere, investors have seemingly taken a liking to liquid restaking projects like ether.fi, which announced its $23 million Series A in February.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMi3AFBVV95cUxPLWc5QWI1WkR2TFFUODQySGNFVTZXRjUzOHpMR3J0azRJTEQ5UFdiUjFwaWY2NF9aSnluRnByVlplQWREZzNMMnBjaTN5Q1BiYTNRME1OYVAwQkprTGxTZDViMWk2UjRTcWpzaDA5OVR3SmVJYTUzYWxHcnNJM0pMdmtYUUJXbUNoMUJLc1J0LVp5VHI0RnpBYzVSLW9vZ0p4Nl9JbWxyNnZiTVprblpaeXZPV3JBODdvcGNqNjJrTElUZnF1SW01OXpmS28xZThrdVBsQjQwWnVDRlg20gHiAUFVX3lxTE80X0FBR0lHbWZoOUNYZFhNZ1V0ODYydEJnZTNLbzd4QVNITDQzclM0ZzU3TzIwN1ozdU9rOHZnd3R4ZHRLX0RZNm5TSkFZSzFuWDlhbGlHc1hhejdwLWZyUkxoTVFJem5naTZheWZuX0RMMnE2UWhqdG1ZeW92RWlmNHNlbHpGUkRyOUNXQU1lUEVxdUktdlRnRmFQWU5sVGZESEdGZzNLWXRkeEpDLXgwcVp5VHZTU3lSY3hoTUxkRjRKaXE2bGNzVEx4bmhmVnNEaWNhLXNyaDJ1VzZTYWt0N2c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Apr 2024 07:00:00 GMT",
        "title": "Will Ethereum's classification as a security disrupt Web3 innovation? - The Economic Times",
        "content": "Transitioning to Proof-of-Stake\n\n\n\nChallenges and Uncertainties for Web3\n\n\n\nThe Decentralization Dilemma\n\n\n\nLooking Ahead: A Web3 Future in Question\n\n\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nBlackRock’s CEO Larry Fink has been quoted today in the media stating that even if Ethereum (ETH) is classified as a security, a spot Ethereum exchange-traded fund ( ETF ) might still be possible. The recent launch of several Bitcoin ETFs by the U.S. Securities and Exchange Commission ( SEC ) was a positive step for the crypto industry, offering investors a clearer path to participate in the virtual digital asset class. This regulatory progress has fueled optimism within the crypto space, with many anticipating a similar green light for Ethereum ETFs in the near future.The success of Bitcoin ETFs, alongside the ongoing price rally, has undeniably instilled a sense of excitement about the potential of Ethereum and the broader blockchain landscape.Amidst these, the recent media reports about SEC reportedly investigating the Ethereum Foundation, coupled with the ongoing debate about Ethereum’s native token, ether (ETH) ’s potential classification as a security, raises critical questions about the impact on Web3, the burgeoning decentralized ecosystem built on Ethereum's blockchain technology.Ethereum, conceived by the visionary Vitalik Buterin in 2013, introduced a revolutionary concept: a decentralized platform for building smart contracts and decentralized applications (dApps). Its impact has been profound, fueling the rise of DeFi (Decentralized Finance), NFTs (Non-Fungible Tokens), and a myriad of other innovations that comprise the Web3 industry.Previously Ethereum relied on a proof-of-work system to secure its network. Like in Bitcoin, in Ethereum computers competed to solve complex puzzles, with the winner earning newly minted Ethereum tokens. Every time a transaction is carried out on the Ethereum platform, one has to pay a gas fee or a transaction fee, irrespective of what the nature of that transaction might be. The gas fees previously were high, going up to $150 per transaction.To solve this problem and after years of testing to replace energy-intensive mining, Ethereum switched on its proof-of-stake mechanism in 2022. The new proof-of-stake system eliminated this competition. Instead, users \"stake\" their existing Ethereum holdings to validate transactions and earn rewards. This shift is estimated to have reduced Ethereum's energy consumption significantly. The ecosystem carried out another upgradation recently, called the Dencun upgrade, as a result of which transaction fees are expected to plummet to almost zero. Dencun achieves this by reducing rollup fees through the introduction of \"blobs,\" larger data packets that enable more efficient handling and storage of transaction-related information.Does staking constitute an investment contract, a key characteristic of a security?Since the transition from a proof-of-work to a proof-of-stake system, a debate among regulators and industry experts has sparked: could Ethereum's new model classify it as a security? The US SEC, for instance, in the past suggested this model could grant excessive control to the network's developers, potentially undermining its core tenet of decentralization.The potential classification of Ethereum as a security could have significant ramifications for the Web3 industry, raising critical questions about decentralization, regulation, and accessibility. It might lead to overly broad regulations, potentially impacting trading platforms, investor participation, and the overall market dynamics within the crypto space.Ethereum is the foundation for a vast ecosystem of decentralized applications (dApps) and Web3 projects. These applications, ranging from DeFi to NFTs rely heavily on Ethereum's Layer2 Of late, the total value locked (TVL) in DeFi ecosystem has experienced a significant resurgence, reaching a milestone of $100 billion, Ethereum leads the space with over 60% market share.A security designation for Ethereum could create regulatory hurdles for dApps built on its network, potentially stifling innovation and growth within the Web3 space.Decentralization is a core principle of Web3, aiming to create a more transparent and user-controlled internet experience. However, the SEC's potential classification of Ethereum as a security could centralize control, as exchanges may delist the asset or restrict trading for certain investors.The inherent decentralization of Ethereum, or for that matter any blockchain, presents a significant challenge to the potential enforcement of any forthcoming regulations. The ability of the SEC, or any national regulatory body, to effectively implement restrictions would be limited by the global nature of the crypto market.The ramifications extend beyond Ethereum itself, encompassing the broader crypto space. If Ethereum is classified as a security, it sets a precedent that could potentially impact other blockchains operating on similar principles.Currently, DeFi boasts 15 million daily transacting users, a number projected to surge to 100 million by 2025. The prospect of mass adoption of blockchain technology looms large, and the recent upgrades in Ethereum network were certain to incentivize developers to build even more innovative use cases. While regulations aim to protect investors, and rightly so, finding a balance between investor protection and fostering innovation will be crucial.As we confront these questions, one thing remains clear: navigating a new and innovative space like Web3 requires ongoing collaboration and a commitment to fostering responsible growth. Ethereum holds a significant place in the broader decentralized ecosystem and any such regulatory decision will have profound implications for the future of Web3 and shaping the next chapter of the digital revolution.(The author is Co-Founder, CoinDCX & Okto)(Disclaimer: Recommendations, suggestions, views, and opinions given by experts are their own. These do not represent the views of the Economic Times)"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMi3AFBVV95cUxPLWc5QWI1WkR2TFFUODQySGNFVTZXRjUzOHpMR3J0azRJTEQ5UFdiUjFwaWY2NF9aSnluRnByVlplQWREZzNMMnBjaTN5Q1BiYTNRME1OYVAwQkprTGxTZDViMWk2UjRTcWpzaDA5OVR3SmVJYTUzYWxHcnNJM0pMdmtYUUJXbUNoMUJLc1J0LVp5VHI0RnpBYzVSLW9vZ0p4Nl9JbWxyNnZiTVprblpaeXZPV3JBODdvcGNqNjJrTElUZnF1SW01OXpmS28xZThrdVBsQjQwWnVDRlg20gHiAUFVX3lxTE80X0FBR0lHbWZoOUNYZFhNZ1V0ODYydEJnZTNLbzd4QVNITDQzclM0ZzU3TzIwN1ozdU9rOHZnd3R4ZHRLX0RZNm5TSkFZSzFuWDlhbGlHc1hhejdwLWZyUkxoTVFJem5naTZheWZuX0RMMnE2UWhqdG1ZeW92RWlmNHNlbHpGUkRyOUNXQU1lUEVxdUktdlRnRmFQWU5sVGZESEdGZzNLWXRkeEpDLXgwcVp5VHZTU3lSY3hoTUxkRjRKaXE2bGNzVEx4bmhmVnNEaWNhLXNyaDJ1VzZTYWt0N2c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Apr 2024 07:00:00 GMT",
        "title": "Will Ethereum's classification as a security disrupt Web3 innovation? - The Economic Times",
        "content": "Transitioning to Proof-of-Stake\n\n\n\nChallenges and Uncertainties for Web3\n\n\n\nThe Decentralization Dilemma\n\n\n\nLooking Ahead: A Web3 Future in Question\n\n\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nBlackRock’s CEO Larry Fink has been quoted today in the media stating that even if Ethereum (ETH) is classified as a security, a spot Ethereum exchange-traded fund ( ETF ) might still be possible. The recent launch of several Bitcoin ETFs by the U.S. Securities and Exchange Commission ( SEC ) was a positive step for the crypto industry, offering investors a clearer path to participate in the virtual digital asset class. This regulatory progress has fueled optimism within the crypto space, with many anticipating a similar green light for Ethereum ETFs in the near future.The success of Bitcoin ETFs, alongside the ongoing price rally, has undeniably instilled a sense of excitement about the potential of Ethereum and the broader blockchain landscape.Amidst these, the recent media reports about SEC reportedly investigating the Ethereum Foundation, coupled with the ongoing debate about Ethereum’s native token, ether (ETH) ’s potential classification as a security, raises critical questions about the impact on Web3, the burgeoning decentralized ecosystem built on Ethereum's blockchain technology.Ethereum, conceived by the visionary Vitalik Buterin in 2013, introduced a revolutionary concept: a decentralized platform for building smart contracts and decentralized applications (dApps). Its impact has been profound, fueling the rise of DeFi (Decentralized Finance), NFTs (Non-Fungible Tokens), and a myriad of other innovations that comprise the Web3 industry.Previously Ethereum relied on a proof-of-work system to secure its network. Like in Bitcoin, in Ethereum computers competed to solve complex puzzles, with the winner earning newly minted Ethereum tokens. Every time a transaction is carried out on the Ethereum platform, one has to pay a gas fee or a transaction fee, irrespective of what the nature of that transaction might be. The gas fees previously were high, going up to $150 per transaction.To solve this problem and after years of testing to replace energy-intensive mining, Ethereum switched on its proof-of-stake mechanism in 2022. The new proof-of-stake system eliminated this competition. Instead, users \"stake\" their existing Ethereum holdings to validate transactions and earn rewards. This shift is estimated to have reduced Ethereum's energy consumption significantly. The ecosystem carried out another upgradation recently, called the Dencun upgrade, as a result of which transaction fees are expected to plummet to almost zero. Dencun achieves this by reducing rollup fees through the introduction of \"blobs,\" larger data packets that enable more efficient handling and storage of transaction-related information.Does staking constitute an investment contract, a key characteristic of a security?Since the transition from a proof-of-work to a proof-of-stake system, a debate among regulators and industry experts has sparked: could Ethereum's new model classify it as a security? The US SEC, for instance, in the past suggested this model could grant excessive control to the network's developers, potentially undermining its core tenet of decentralization.The potential classification of Ethereum as a security could have significant ramifications for the Web3 industry, raising critical questions about decentralization, regulation, and accessibility. It might lead to overly broad regulations, potentially impacting trading platforms, investor participation, and the overall market dynamics within the crypto space.Ethereum is the foundation for a vast ecosystem of decentralized applications (dApps) and Web3 projects. These applications, ranging from DeFi to NFTs rely heavily on Ethereum's Layer2 Of late, the total value locked (TVL) in DeFi ecosystem has experienced a significant resurgence, reaching a milestone of $100 billion, Ethereum leads the space with over 60% market share.A security designation for Ethereum could create regulatory hurdles for dApps built on its network, potentially stifling innovation and growth within the Web3 space.Decentralization is a core principle of Web3, aiming to create a more transparent and user-controlled internet experience. However, the SEC's potential classification of Ethereum as a security could centralize control, as exchanges may delist the asset or restrict trading for certain investors.The inherent decentralization of Ethereum, or for that matter any blockchain, presents a significant challenge to the potential enforcement of any forthcoming regulations. The ability of the SEC, or any national regulatory body, to effectively implement restrictions would be limited by the global nature of the crypto market.The ramifications extend beyond Ethereum itself, encompassing the broader crypto space. If Ethereum is classified as a security, it sets a precedent that could potentially impact other blockchains operating on similar principles.Currently, DeFi boasts 15 million daily transacting users, a number projected to surge to 100 million by 2025. The prospect of mass adoption of blockchain technology looms large, and the recent upgrades in Ethereum network were certain to incentivize developers to build even more innovative use cases. While regulations aim to protect investors, and rightly so, finding a balance between investor protection and fostering innovation will be crucial.As we confront these questions, one thing remains clear: navigating a new and innovative space like Web3 requires ongoing collaboration and a commitment to fostering responsible growth. Ethereum holds a significant place in the broader decentralized ecosystem and any such regulatory decision will have profound implications for the future of Web3 and shaping the next chapter of the digital revolution.(The author is Co-Founder, CoinDCX & Okto)(Disclaimer: Recommendations, suggestions, views, and opinions given by experts are their own. These do not represent the views of the Economic Times)"
    }
]