[
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxOM0xfQ3E5LXdvT1NVamY3LWl2X3FKTDVWMXlFbWlkTnlkLVY2a3hUQWUxVy10cVByY21ISUotN3pkMzY3Ykg5VVpxMkREcWtWc0RjNFQwOVd4Zno3aVVHaTdRUG9EaTRkSUlnZ1Q1dEh5bjJGOWJlRDdVY0JWR25Yazc3Q0ZsVWo5Yk8xVdIBkgFBVV95cUxQLVVvZGN3ZHpIT1UxVDAxSGdjN0hTLTZDTl9rVUt2aEJDYzVPUGNMeDQxWWVwd0R3cUxxc0ZmbUYweGZUVi1tN3JtRkgyRlVNMElOT0hURTNESWd0SmdvQkQ2ZUhMN19CXzlZRmo2OXBuODI1Z3AzSkFLTml0SllzMkhuOWZxcVk2cnBNaHdHekpmdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 17 Mar 2024 07:00:00 GMT",
        "title": "Ethereum could drop as low as $3100 – Time to rethink your moves? - AMBCrypto News",
        "content": "Ethereum broke its lower timeframe bullish structure.\n\nThe liquidation levels heatmap outlined two support zones.\n\nEthereum [ETH] saw a sizeable pullback over the past few days after its steady bullish march over the past month. The $4.1k level was almost reached before the bulls were forced to retreat. Investors need not worry about this dent in prices too much.\n\nBitcoin [BTC] also faltered just above the $73k level and dragged the rest of the market down. While the rally is expected to continue higher in the long run, further losses are anticipated over the next few weeks.\n\nTraders need to be prepared for a fall below $3500\n\nThe 12-hour chart showed that the bullish bias remained intact based on the price action. Yet on the 4-hour timeframe and lower the structure has flipped bearishly. Even the 12-hour RSI fell below the neutral 50 mark to reflect bearish momentum was rising.\n\nThe recent pullback is not a flush of the overleveraged bulls as we saw on the 5th of March. The rally saw its momentum stutter after the 12th of this month, followed by an increase in selling pressure.\n\nThe OBV began to drop lower to support this idea. The Fibonacci retracement levels (pale yellow) highlighted that the 61.8%-78.6% region at $3100-$3315 would likely be retested as support. The $3463 level could also halt the bearish progress.\n\nLong-term investors need to brace for further losses\n\nAMBCrypto’s analysis of the liquidation levels heatmap showed that ETH would likely post more losses. The $3560 level was estimated to trigger $2.6 billion worth of liquidations.\n\nThese large liquidation levels were concentrated in the $3520-$3560 region, marking it as a support zone. Ethereum could see a bullish reaction from here.\n\nIs your portfolio green? Check the Ethereum Profit Calculator\n\nBelow the $3520 level, the next large liquidation levels sat at $3300 and $3130. The former was estimated to have $2.2 billion in liquidations, and the latter to have $5.4 billion.\n\nIt also had confluence with the 78.6% retracement level at $3102.\n\nDisclaimer: The information presented does not constitute financial, investment, trading, or other types of advice and is solely the writer’s opinion."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxNeWR6bnJUUHhaZFo2MjBCZjkyZkhQNlBuVHBqMUNMcmFISXJ6TGhyYXU0VnNseE9KT0tnbU0tM0ZDYmZmX1NHUkwwS3Axa25GV0RkX2VjZElWUnNod2w4aXFTcjM5UmRGSlg4YnV5MS1iY1BfbjQxQ3RHZnA1U3lMbGFva1JQTEhE0gGOAUFVX3lxTE1SZlZSMFJrRWt6ODZNRjlEa2FYMXo0enJmSWtqcHdkYkllR2R2NlhET1dFTzItUE9EU09YZTFIbGY1ZDhDVG84WV9HbGJKemFETkNzaXB2cFJGMjlwSVcwMTkzenJSVVAybmk1UUliNGNOOUNOZHJDYmhmeTlJVTBpakNyZ1VoNllOYVVlakE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 17 Mar 2024 07:00:00 GMT",
        "title": "Ethereum: Will fresh demand again push ETH past $4K? - AMBCrypto News",
        "content": "New demand for Ethereum now sits at a year-to-date high.\n\nIts DeFi and NFT sectors, however, witnessed declines in the past week.\n\nThe daily count of new addresses on Ethereum [ETH] assessed on a seven-day moving average reached a year-to-date (YTD) high of 116,000 on 14th March, according to The Block’s data dashboard.\n\nThis marked a 35% increase from the 86,000 unique addresses that appeared for the first time in a transaction of the native coin in the network on 1st January.\n\nEthereum’s rally in new demand to a YTD high came amidst a surge in its on-chain volume. AMBCrypto found that transaction volume on the network, also assessed using a seven-day moving average, attained a YTD high of $7 billion on 11th March.\n\nAs transaction volume rallied, the average fee paid per transaction on the network also climbed. According to The Block’s data, this reached a YTD high of $25 on 11th March.\n\nThe DeFi and NFT sector fails to react\n\nDespite the recent uptick in demand for the Ethereum network, its decentralized finance (DeFi) and non-fungible token ecosystems have witnessed declines.\n\nFor example, the total value of assets locked (TVL) across the DeFi protocols housed within the chain declined by 5% in the last week. Per DefiLlama’s data, Ethereum’s TVL was $53.4 billion.\n\nOut of the top 10 DeFi protocols on Ethereum, only one (ether.Fi) recorded a TVL hike in the past seven days. The rest of them witnessed a decline.\n\nThe network’s NFT sector recorded a 21% decrease in sales volume in the last seven days.\n\nAccording to CryptoSlam’s data, despite the 90% uptick in the number of traders trading NFTs on the network during that period, the transaction count fell by 2%.\n\nIn the last seven days, 166,000 NFT transactions worth $130 million were completed on the Ethereum network.\n\nLook before you leap\n\nThe network’s native coin ETH sold for $3,721 at press time. Per CoinMarketCap’s data, its value dropped by 6% in the last week. The decline followed a sharp fall in Bitcoin’s value on 14th March, when its value was below $68,000.\n\nHow much are 1,10,100 ETHs worth today?\n\nAn assessment of ETH’s performance on a daily chart revealed that its Awesome Oscillator (AO) indicator has posted red upward-facing histogram bars since 11th March.\n\nAn asset’s AO measures market trends and changes in momentum. When it displays red upward-facing bars, it suggests increasing negative momentum in the market. Traders often interpret this as a signal to consider selling or entering short positions."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxNeWR6bnJUUHhaZFo2MjBCZjkyZkhQNlBuVHBqMUNMcmFISXJ6TGhyYXU0VnNseE9KT0tnbU0tM0ZDYmZmX1NHUkwwS3Axa25GV0RkX2VjZElWUnNod2w4aXFTcjM5UmRGSlg4YnV5MS1iY1BfbjQxQ3RHZnA1U3lMbGFva1JQTEhE0gGOAUFVX3lxTE1SZlZSMFJrRWt6ODZNRjlEa2FYMXo0enJmSWtqcHdkYkllR2R2NlhET1dFTzItUE9EU09YZTFIbGY1ZDhDVG84WV9HbGJKemFETkNzaXB2cFJGMjlwSVcwMTkzenJSVVAybmk1UUliNGNOOUNOZHJDYmhmeTlJVTBpakNyZ1VoNllOYVVlakE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 17 Mar 2024 07:00:00 GMT",
        "title": "Ethereum: Will fresh demand again push ETH past $4K? - AMBCrypto News",
        "content": "New demand for Ethereum now sits at a year-to-date high.\n\nIts DeFi and NFT sectors, however, witnessed declines in the past week.\n\nThe daily count of new addresses on Ethereum [ETH] assessed on a seven-day moving average reached a year-to-date (YTD) high of 116,000 on 14th March, according to The Block’s data dashboard.\n\nThis marked a 35% increase from the 86,000 unique addresses that appeared for the first time in a transaction of the native coin in the network on 1st January.\n\nEthereum’s rally in new demand to a YTD high came amidst a surge in its on-chain volume. AMBCrypto found that transaction volume on the network, also assessed using a seven-day moving average, attained a YTD high of $7 billion on 11th March.\n\nAs transaction volume rallied, the average fee paid per transaction on the network also climbed. According to The Block’s data, this reached a YTD high of $25 on 11th March.\n\nThe DeFi and NFT sector fails to react\n\nDespite the recent uptick in demand for the Ethereum network, its decentralized finance (DeFi) and non-fungible token ecosystems have witnessed declines.\n\nFor example, the total value of assets locked (TVL) across the DeFi protocols housed within the chain declined by 5% in the last week. Per DefiLlama’s data, Ethereum’s TVL was $53.4 billion.\n\nOut of the top 10 DeFi protocols on Ethereum, only one (ether.Fi) recorded a TVL hike in the past seven days. The rest of them witnessed a decline.\n\nThe network’s NFT sector recorded a 21% decrease in sales volume in the last seven days.\n\nAccording to CryptoSlam’s data, despite the 90% uptick in the number of traders trading NFTs on the network during that period, the transaction count fell by 2%.\n\nIn the last seven days, 166,000 NFT transactions worth $130 million were completed on the Ethereum network.\n\nLook before you leap\n\nThe network’s native coin ETH sold for $3,721 at press time. Per CoinMarketCap’s data, its value dropped by 6% in the last week. The decline followed a sharp fall in Bitcoin’s value on 14th March, when its value was below $68,000.\n\nHow much are 1,10,100 ETHs worth today?\n\nAn assessment of ETH’s performance on a daily chart revealed that its Awesome Oscillator (AO) indicator has posted red upward-facing histogram bars since 11th March.\n\nAn asset’s AO measures market trends and changes in momentum. When it displays red upward-facing bars, it suggests increasing negative momentum in the market. Traders often interpret this as a signal to consider selling or entering short positions."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMi5AFBVV95cUxOaDFYSEs1ejN4M0RGdnFnOTlpX1pnZnpLSWU1MVIxQTgtb1hYQ2Q4TXYyRVM2QkFBS0diX1djX2pHU01Ic1JfQlhuZ0xxOGJYQ1RBVkNGamlLM3Bwdm9fSXhqTnhFYzFOZFBnbF9RVHA4VlVaVm1JMTR2VkdIN0l0UzdYMFYxT0hVcnNfdVdGM1RndndCRVcya2RSMnByeUxBdzlwSXFTTldPeUVfSXg3c3BWZ2ZOY2F3SHVDZjdVdXFVOWE0OTJ3UDRKdkp0VHRGVWhmOXFXMG95dEJHUnZtdHMxZG_SAeQBQVVfeXFMTmgxWEhLNXozeDNERnZxZzk5aV9aZ2Z6S0llNTFSMUE4LW9YWENkOE12MkVTNkJBQUtHYl9XY19qR1NNSHNSX0JYbmdMcThiWENUQVZDRmppSzNwcHZvX0l4ak54RWMxTmRQZ2xfUVRwOFZVWlZtSTE0dlZHSDdJdFM3WDBWMU9IVXJzX3VXRjNUZ3Z3QkVXMmtkUjJwcnlMQXc5cElxU05XT3lFX0l4N3NwVmdmTmNhd0h1Q2Y3VXVxVTlhNDkyd1A0SnZKdFR0RlVoZjlxVzBveXRCR1J2bXRzMWRv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 17 Mar 2024 07:00:00 GMT",
        "title": "Stellar Lumens Challenges Ethereum: Ripple Rival Expands Reach with Smart Contracts – XLM Poised to Dominate The World - Crypto News Flash",
        "content": "Stellar Lumens is set up to challenge Ethereum in the smart contract space after the launch of the Soroban project.\n\nThe Ripple rival is looking to dominate the market, and with the launch of the smart contracts platform and its innovative financial technology infrastructure, it is set up to lead its rivals.\n\nEarlier this year, the Stellar Development Foundation (SDF) confirmed the launch of the much-anticipated Soroban platform. Deployed through the “Protocol 20” upgrade, which was deemed the greatest upgrade since the launch of the Stellar Lumens network, this platform sees the network rival Ethereum.\n\nAs CNF reported, with the new Soroban project, the network will compete with Ethereum, which has been the leader in the smart contract space. It will further enable the network, which was primarily built as a payment blockchain, to attract developers, users, and new applications.\n\nWith the capability to host decentralized applications (DApps) and smart contracts, this marks a new era for the Stellar blockchain. The network becomes a direct rival of Ethereum, which is regarded as the king of smart contracts and the platform for building them. Over the years, several blockchain platforms, including Cardano, Solana, and Polkadot, have challenged Ethereum, but none has been able to topple the world’s second-largest cryptocurrency project.\n\nBut with Stellar, this could be the greatest test for Ethereum yet. Stellar Lumens has already shown its superiority in financial applications. Often regarded as a Ripple rival, not only was it co-founded by a former Ripple co-founder, but it also sought to shake up the financial sector. Specifically, Stellar aims to bank the bankless, bringing financial solutions to those who lack access.\n\nAs highlighted by CNF, the project has recorded numerous successes in this regard. More recently, the Stellar Development Foundation (SDF) has made a case for open banking innovations. In an open letter to the US Treasury, the Stellar Development Foundation (SDF) responded to the U.S. Department of the Treasury’s Request for Information on Financial Inclusion, emphasizing the importance of access and leveraging technology to advance financial inclusion efforts, supported by Stellar Lumens (XLM).\n\nWith the new upgrade, the project will look to lead the finance revolution with tokenization, digitizing real-world assets for faster transactions. The adoption of Soroban could be accelerated due to its working relationship with traditional financial institutions, including WisdomTree, Deloitte, Franklin Templeton, and Circle.\n\nGoing after Ripple and Ethereum, both of which are ranked higher by market cap, could be a big undertaking for Stellar. But it could offer a chance to become the only go-to network that encompasses everything a user and developer could want or need.\n\nAt the time of writing, XLM is trading at $0.13 after a drop in the past 24 hours. The token is now down by nearly 10% on the weekly chart. Although the altcoin is struggling to break out of its long-term bearish trend, popular crypto analyst EGRAG expresses optimism for Stellar (XLM) and foresees a rise to $5 due to its expanding potential.\n\nRecommended for you:\n\n[thrive_leads id=\"228374\"]"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxNZVVMMEdyVl9YUGluSm1TMGVRRjZoREFrazliTmxtcDF1Q1ptWHBxb2JiWENvSndFSGU3c2NMLVE1V3ZpR05nMFpKSFJZZEYwQ080TkhYbTZCX0RVOG9XTGdxNjRfS1lKMUhTcE9SSEF1VTZYNEl1dDFnMzlVOXRsd0I3V0REVnpSMm8xcmEtSXhrNG55T1ZnRlBxSkFHYUI0LUlKWVpkaVh1WHZfdXZ2Q2VsT291dHVtdWpjU3R0bmp6dDE1cHc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 17 Mar 2024 07:00:00 GMT",
        "title": "Ethereum Blockchain, Chiliz token burn, BlockDAG, keynote, best crypto - Techpoint Africa",
        "content": "The crypto world is buzzing with anticipation as major developments unfold, promising to reshape the landscape of digital currency investments. At the heart of these changes are Ethereum's Dencun upgrade, Chiliz's innovative token burning mechanism and BlockDAG's ambitious $600M roadmap. Each of these entities brings something unique to the table, targeting investors looking for the next big crypto opportunity with a mix of technology enhancements and strategic initiatives.\n\nEthereum's Dencun Upgrade\n\nEthereum just launched its Dencun upgrade this week, a much anticipated event of 2024. This upgrade, the most substantial change to the Ethereum blockchain in over a year, introduces \"proto-danksharding\" via Ethereum Improvement Proposal (EIP) 4844. Aimed at reducing fees for layer-2 (L2) rollups, this move is expected to enhance Ethereum's scalability by improving data handling capabilities for auxiliary networks. L2s like Arbitrum, Optimism, and Polygon stand to benefit the most, potentially enjoying reduced operational costs and fostering a more efficient transaction process. This step towards sharding indicates Ethereum's commitment to solving high gas fees in the short term, potentially boosting its appeal to investors and users.\n\nChiliz's Strategic Move with Token Burning\n\nChiliz, the powerhouse behind fan tokens, has introduced a token burning mechanism to reignite interest in this niche. By burning tokens whenever a team scores or wins, Chiliz aims to reduce the overall token supply, thereby increasing scarcity and potentially boosting token value. This innovative approach not only adds excitement to the Champions League but also positions Chiliz as a forward-thinking player in the crypto space. The immediate response was positive, with the CHZ token witnessing a 2.47% rise in value following the announcement. This strategy could significantly enhance the attractiveness and utility of fan tokens, setting Chiliz apart in the competitive crypto market.\n\nBlockDAG's Keynote: An Ambitious Roadmap For 2024\n\nBlockDAG is setting the stage for monumental growth with its impressive keynote for the year 2024. Having raised over $4.8 million already and eyeing a $600 million milestone that could outpace all presale competitors, BlockDAG has sold out its Batch 2 and has jumpstarted in Batch 3 with a price of $0.002. With plans for top exchange listings on platforms like KuCoin and Gate.io, BlockDAG is not just aiming for visibility but also for accessibility to a broader audience. The promise of 50X returns for early investors highlights the project's confidence in its value proposition.\n\nGone are the days when miners needed high powered specialised equipment BlockDAG has introduced a user friendly app - BlockDAG X1 app, which is available in various platforms like AppStore and Google Play. For those naive to the crypto world about the prospects of mobile mining convenience, get enlightened with the fact that it allows users to mine up to 20 BDAG coins daily effortlessly from their smartphones. This innovative approach offers a passive income stream, further sweetened by the specialised mining units for enhanced profits. BlockDAG offers state of the art mining rigs that make mining easier with added processing power and extended operational life. Miners can trade their coins and resale at much established platforms like Amazon, Ebay and Shopify.\n\nWhy BlockDAG Stands Out\n\nIn a market teeming with opportunities, BlockDAG distinguishes itself through a blend of ambitious goals, strategic exchange listings, and user-friendly mining solutions. As Ethereum works to lower operational costs for its network and Chiliz explores new ways to engage and reward its community, BlockDAG's comprehensive approach addresses the investment and participation angles, making it a noteworthy contender for those looking to dive into crypto. With its Layer 1 Presale now live, BlockDAG invites investors to be part of a project poised for significant growth, promising not just returns but also an active role in the evolving crypto ecosystem.\n\nTo know more about BlockDAG:\n\nWebsite: https://blockdag.network\n\nPresale: https://purchase.blockdag.network\n\nTelegram: https://t.me/blockDAGnetworkOfficial\n\nDiscord: https://discord.gg/Q7BxghMVyu"
    }
]