[
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxQWm13TFg2M0pBSzYtV0NCQU80VnpGelJwa3dmUWd4Z1FjUG1vYUlGZkRBdmFpYkNLVFBvWUkyV25LYk5GelRKSnFrTExxdTdJcWZ2V1I5V2I3VkJhOEJuOFpnQzhCRHVDNFViTFlSaWhpVXFoa2pseTZHdXF6cklFMjNjclpyc0VDX1ZUQ3F0NjEtb2hRLTlMUExB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Ethereum applications take place as top gainers ahead of ETF announcement - crypto.news",
        "content": "According to CoinMarketCap, native tokens of Ethereum applications, including Lido DAO, Rocket Pool, and Aribtrum, take the lead ahead of spot Bitcoin ETF approval day.\n\nLido DAO (LDO) takes the top spot on the gainers on the Jan. 10 charts with a live price of $3.80, with a 24-hour trading volume reaching $385 million, in what is a 16.1% increase. The surge in the value of Ether (ETH) and native tokens of Ethereum-based applications is said to be driven by trader optimism surrounding the potential approval of an Ether exchange-traded fund (ETF) following the anticipated approval of a Bitcoin ETF in the United States.\n\nBlackRock’s iShares Ethereum Trust, a spot Ether ETF, may have its way paved by the approval of its Bitcoin counterpart.\n\nTop crypto gainers of the day | CoinMarketCap\n\nYou might also like: Stacks, Injective, Internet Protocol emerge as crypto top gainers\n\nFor similar reasons, Rocket Pool (RPL) has also seen an increase in value today, operating as a decentralized Ethereum staking pool that offers a competitive annual percentage rate (APR) of up to 4.3% for ETH2 staking. As of the most recent update, the live price of Rocket Pool stands at $31.76, accompanied by a 24-hour trading volume of $22 million, revealing a 14.9% increase in Rocket Pool’s value over the last 24 hours.\n\nRounding out the third spot is Arbitrum (ARB), which stands out as an Ethereum layer-two (L2) scaling solution, employing optimistic rollups to enhance speed, scalability, and cost-effectiveness within the Ethereum network. As of the latest data, the live price of Arbitrum is currently $1.94, accompanied by a 12.1% increase in value.\n\nWith the market experiencing significant volatility this week in response to ETF updates, investors are making many big moves in the crypto space."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxNUEVPdF92UjdSLUNpbVpJamxhczE5VENpdHg4QWZTX3NLMFJNQ2dVU3RQcHA5azc4UmRjNjhlUHNxRjlCY09hTE5JMlFUaVZfR2NMRjBKMGRJMGtiVkFmV3lCWDEwUUU4T04tT3dEdGQ2bjUwU3NQNGpDZ2lzN0xJaDBhS2tJUjgzSWEzZ0VMQUJHREdwcTZMZW1NMFlvS01Vcm1KQdIBqgFBVV95cUxNNE9pRkprUlUzaFpQZGFnVHNPRTNodEQ2ZHQwUGpWaGxWVUhOWUR5N3hOU09McFhyWkZWV3Bod05tTUV4Y0QxSXpYcnVGdDRfaUFVeDI2MndFQ0dZaS11V0lRU0JaMDg2ZWZNUGp4eGhXN3V3aUtVM0hsZTdzTVY0MF9aNmdveXNvZTlHMWZEZU5WeDZXR0hJVWxHRU5FOGRqUjRmdlJMUDNRdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Tests $2.4K as Bulls Look to Finally Take Control: ETH Price Analysis - CryptoPotato",
        "content": "Ethereum has been increasing in the past day in the hopes that an ETH ETF might be next in line on the SEC’s agenda.\n\nMeanwhile, the probability of a further bullish continuation seems to remain high, considering what the charts are demonstrating.\n\nTechnical Analysis\n\nBy TradingRage\n\nThe Daily Chart\n\nOn the daily timeframe, the price has been trapped between the $2,100 and $2,400 levels over the last month. A breakout from either side of this range can determine the trend’s short-term direction.\n\nA bearish breakout would likely result in a decline toward the 200-day moving average, located around the $1,900 mark. On the other hand, a break above the $2,400 level would pave the way for the price to target the $2,700 resistance zone in the upcoming weeks.\n\nThe 4-Hour Chart\n\nLooking at the 4-hour chart, the recent choppy price action becomes much more clear. The cryptocurrency has tested both the higher and the lower boundary of the range several times.\n\nCurrently, the price is testing the $2,400 resistance area. A breakout from this level would result in a rally higher toward the $2,700 area, while a rejection could lead to a drop back to the support zone at $2,100.\n\nSentiment Analysis\n\nBy TradingRage\n\nEthereum Open Interest\n\nWhile Ethereum’s price has been going through a consolidation phase, the underlying dynamics of the futures market are displaying an interesting sign.\n\nThis chart demonstrates open interest, which is one of the most essential metrics for future market sentiment evaluation. It measures the number of open futures positions. Higher values are typically associated with higher volatility and vice versa.\n\nIt is evident that while the price has been moving in a tight range recently, the open interest has dropped considerably. A significant decline in open interest without a price plunge is considered a bullish signal, as it hints at the fact that the futures market is not overheated anymore, and the price can continue its gradual uptrend in the coming weeks."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMi4gFBVV95cUxNWFZKQXJXX3J6RXZhRnlNNTNvMGNxalFfTGNObTNhY0RmY0pTU2U0azNIMlNqSlVqdzdXVUN3UGxUdGlDMDFYaVZNNFpnOEMtSktVXzh1LUNzZ1dKUTZ0eHotZXF0bGlqQ0pJYm16b1Jac2VTeG56UUl1WWRKT25vWEZ3TGlydjY2MUdNSVpEWTM5SkZaTXRLOGFKY05IQkdBSjJ3cm95YXB4b0V6UkNnMlIzYUE0TFZycDJra05ZeVpobG5HRzRtSWZEY2NwLWpjQVozVU8zUFA0YkhNeS13RDVB0gHnAUFVX3lxTE9oMkdlWGpwRTVGVzFlM19jTGJKX0pNeG93U1p3T1psNUkzYVZMcndVUDJRZXJmT2pfQ081SnJ0WUYtOVo4Y1dBT3lZemZmOWVWalVRVWhsa0lrdUVwLTBVY3o4YVR0U0pLWDVJdXpYWVBuR3FQcFJYbVQwYXlFMWVJdmhqcnNHQ1B6cnN5ZHlrWUxHU3Q4NlYySjUxTTFtX1lsZWlpVklVN2w1MHhzeUVGcHJINzY0SWNMTEdTcmEzZ3NiSlR2emdBV0xkc1dVSF93Z0tXVW9sRmpEYlp0b25xOGlVblpOWQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Classic Price Forecast: Chances of 21% correction wane on bullish market momentum - FXStreet",
        "content": "Ethereum Classic price formed a double-top reversal pattern that hints at a 21% decline.\n\nPrice indicators highlight the potential of the pattern failing due to bullish broader market cues.\n\nThe anticipated spot Bitcoin ETF approvals will likely have a bullish impact on altcoins, benefiting ETC.\n\nEthereum Classic price was seemingly adhering to the micro bearish reversal pattern, which failed despite the recent correction in the crypto market. The short-term outlook ahead of the spot Bitcoin ETF approval is now looking bullish as ETC is bouncing back from the crucial support of $19.33.\n\nEthereum Classic price notes a bearish reversal pattern\n\nEthereum Classic price on the 4-hour scale invalidates the double-top bearish reversal pattern that has been observed in the past four weeks. This pattern consists of two peaks or tops of nearly identical height positioned closely together, with a trough in between. It suggests a possible shift in market direction.\n\nThe potential trend reversal is indicated by the price encountering a resistance level on two separate occasions without successfully surpassing it. This is often interpreted as a sign to consider selling or initiating short positions as further declines in the market.\n\nIn the case of Ethereum Classic, this double top was formed at $23.42, with the neckline or support level of the pattern being marked at $19.33. This is also the breakout level, and an extended decline below this line would confirm the bearish reversal pattern. Furthermore, a successful pattern would only be observed when ETC falls to the target price of $15.24, which, according to the pattern, would register a 21% decline on the 4-hour chart.\n\nHowever, Ethereum Classic price took the other route and, instead of falling through the neckline, bounced off it to note minor recovery, trading at $19.90 at the time of writing. Although this does not rule out the potential for decline, the price indicators do suggest invalidation of the pattern is likely, too.\n\nETC/USD 4-hour chart\n\nThe Relative Strength Index (RSI) and the Moving Average Convergence Divergence (MACD) indicator are giving out mixed signals, with the former still sitting in the bearish zone and the latter noting a bullish crossover.\n\nEthereum Classic RSI and MACD\n\nIf Ethereum Classic price continues the current path and broader market bullish cues kick in, ETC could move sideways or upwards beyond $20 and invalidate the bearish pattern.\n\nOn the other hand, if the Ethereum namesake falls through the neckline and falls below $19, the bullish thesis would be invalidated, and the reversal pattern could be deemed mildly successful since absolute success would warrant a 21% correction."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxPb3UyZWhERGotQVNKUlQzck4tR2JrSnkzcmoxQ2JGMlctZFRjNGd5Y09yYUU5TFkyaUcyTXhvY1VnTkpWdTMxOWRyanVrbU1SN3JVRWhnZFRGMGVzYlcxSTQ0dG94NVFOYWZKOTFkdS1tOV9HU0JRcWY3WHpSLXp3WUJxXy1KSXhPby1NM0JBSFV0THoteHVCOUlB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "The fake approval of the Bitcoin ETF greatly benefits Ethereum! - Cointribune EN",
        "content": "Wed 10 Jan 2024 ▪ 3 min read ▪ by Eddy S.\n\nThe crypto market has experienced intense turbulence in recent days, following a false announcement that teased the imminent approval of a Bitcoin spot ETF by the SEC. While this misleading information has disenchanted Bitcoin investors, it has paradoxically energized Ethereum and many altcoins, which have seen their trading volumes explode upwards.\n\nEthereum and Altcoins Boosted by Optimism over Bitcoin ETFs\n\nDespite the Bitcoin ETF illusion turning against the queen of crypto, Ethereum cheerfully crossed the symbolic threshold of $2,400, with a 2.8% increase. More importantly, the decentralized cryptocurrency benefited from very high trading volumes, indicating growing investor interest in this digital asset with multiple use cases.\n\nMany altcoins like Avalanche, Solana, or Cardano also jumped between 3 to 8% simultaneously. This bullish surge reflects the market participants’ optimism regarding a future approval of a Bitcoin spot ETF in the United States. Such a decision would pave the way for massive inflows of institutional capital, benefitting the entire crypto ecosystem.\n\nBTC Struggles to Bounce Back in a Volatile Market\n\nOn the contrary, Bitcoin is struggling to recover from its speculative excesses, after falling by more than $2,000 within 24 hours. Briefly surpassing the $47,000 mark, the original cryptocurrency fell back below $45,000, reflecting the market’s nervousness after the ETF hoax.\n\nSome are hoping for support around $46,200, but caution remains advisable. Bitcoin is now trading around $45,000, far from its all-time high in November 2021. According to many analysts, this could be a “bear market rally,” a faint uptick in a sustained bear market. Others are more optimistic about a lasting rebound.\n\nBitcoin’s Dominance Erodes in Favor of Ethereum\n\nThese sharp jolts demonstrate the gradual emancipation of Ethereum and altcoins from Bitcoin, despite its still overwhelming dominance, accounting for about 53% of the crypto market cap. Boosted by record volumes, Ethereum and others are now progressing according to their own dynamics, little affected by Bitcoin’s transient downturn.\n\nThis tumultuous episode reminds us of the volatile nature of the crypto Wild West, prone to extreme fluctuations based on false news or unverified rumors. It also marks Ethereum’s spectacular breakthrough, which is emerging as the most serious alternative to Bitcoin, even if there is still a long way to go to dethrone the crypto veteran. The coming months promise to be exciting, with the prospect of a “flippening,” a reversal of the established order!\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNOWYybklzWE9YdXBNVUdGd3BaVll3UnBuWDhMeEtlTDM2VEtiN3VEbDkzdk5vOXpCdkQ3cFBRbkhxR0JYd0haM3RLQlBPWWlldzQ1VWlTWkN6bjEwQjdxUGdXbXBickJCM25wR2wzSmJpM2E1b0pLM1l2enZONGxiRjhTdzRzcGI1Nlg2dEV2eEV2d2QydEFxT9IBngFBVV95cUxNSFZwLUh1QnczYXFuVVlnWW9oV1BSTndHRmFHelVxZDV6ZEdSdXFrNTNZUTY5ZEZod3ZadjA2LUpfNlZWd0V0aVBfSVcyajJ0MlVBdHB2a182WV8yNVE2NEZrODkzdTY5ZXNKdU1lNWJidTdZc21TdktaVllscExiOGJZeDNLMTBkYVVRU2ZKcTFjLS1aalo1bUlpdTh2Zw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Price Prediction: Whale Accumulation Surges Ahead of Spot BTC ETF; Is $3K Near? - CoinGape",
        "content": "Ethereum Price Prediction: Ethereum, the second-largest cryptocurrency, currently shows a lack of bullish momentum contrary to the generally bullish sentiment around Bitcoin spot ETFs. The ETH price has been resonating between the $2400 and $2140 horizontal levels for the past five weeks, with the overhead supply preventing the buyers from a higher rally. Will potential approval from the US SEC bolster the Ether price to escape this uncertainty?\n\n$2400 Breakout Will Trigger a Direction Rally\n\nA steep support trendline leads to the current recovery trend in the ETH price.\n\nA potential recovery may face new resistances at $2680 and $3000\n\nThe intraday trading volume in Ether is $20.8 Billion, indicating a 68% gain.\n\nAn ascending trendline in the daily time frame chart shows the Ethereum price recovery is intact and the current sideways trend is likely a post-rally consolidation to recuperate the exhausted bullish momentum.\n\nadvertisement\n\nInterestingly, the Ethereum whales have accumulated nearly $1 billion worth of Ether despite its underperformance relative to Bitcoin. A recent tweet from renowned crypto analyst Ali Martinez reveals that the Ethereum smart money has significantly increased its holdings by accumulating more than 410,000 ETH tokens during the past month(December).\n\nThis accumulation amid the crypto market’s progress towards the first spot Bitcoin ETF hints the ETH may also witness a major impact of US SEC approval as the potential for spot Ethereum ETF will also accelerate.\n\nBy press time, the ETH price shows a 3.77% jump and teases a bullish breakout from the $2400 resistance level. If buyers succeed in closing a daily candle above this barrier, it could lay a solid foundation for additional upward movement.\n\nSuch a breakout could potentially result in a 10% rise in ETH, setting its next target at around $2,680. Following this, a prolonged recovery could target the $3,000 and $3280 mark.\n\nThis Support Prevents ETH From Major Correction\n\nOver the past two months, the ETH price has been receiving dynamic support from an ascending trendline. The coin price rebounded several times from this support indicating the buyers are actively accumulating at a dip which is a key sign of sustainable recovery. Thus, it also indicates losing this support could intensify selling pressure and trigger a new correction in this asset.\n\nBollinger Band: An uptick in the upper boundary of the Bollinger band indicator suggests the bullish momentum is strengthening.\n\nAverage Directional Index: A low value of ADX(15%) hints the ongoing consolidation has managed to offer buyers sufficient break to kickstart a new rally.\n\nRelated Articles:\n\nSahil Mahadik Sahil is a dedicated full-time trader with over three years of experience in the financial markets. Armed with a strong grasp of technical analysis, he keeps a vigilant eye on the daily price movements of top assets and indices. Drawn by his fascination with financial instruments, Sahil enthusiastically embraced the emerging realm of cryptocurrency, where he continues to explore opportunities driven by his passion for trading\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    }
]