[
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiXkFVX3lxTFBWMldnbjdiZlpRalcycTVWSXNJMTViQm5LTHpNMTY0eGRqbUtjenJESXJzT0VLSFJOczktR2EySF9vQWlFbmh6dmVycHBKWm92Xy1zMmxHUEE3RnJnR3c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Mar 2024 07:00:00 GMT",
        "title": "Ethereum Dencun upgrade sparks divergent opinions from crypto execs - crypto.news",
        "content": "While Ethereum developers inch closer to shipping Dencun, some experts are unconvinced the upgrade will deliver on its promises.\n\nDays before Dencun is scheduled to deploy on Ethereum’s mainnet, two industry veterans offered differing opinions regarding the impact of this much-anticipated upgrade amid skyrocketing Ether (ETH) prices.\n\nThe hype and crypto market euphoria pushed ETH to another two-year high, as the crypto crossed $4,000 for the first time since late 2021, at the peak of the previous bull cycle.\n\nYou might also like: Ethereum hits $4k amid bullish surge, market awaits Dencun upgrade boost\n\nCore DAO, Wormhole experts on Ethereum’s upgrade\n\nEthereum developers have said that Dencun will implement expanded data availability for layer-2 solutions like Arbitrum and Optimism, allowing for improved transaction capacity at lower gas fees.\n\nCore DAO initial contributor Rich Rines said in a statement received by crypto.news that the focus on Ethereum L2 may harbor unexpected issues around liquidity and on-chain fragmentation.\n\nWhile this should enable higher TPS on the network as a whole, questions remain whether this is a long-term fix. Over-reliance on Layer 2s could lead to fractured ecosystems and liquidity, as activity trends away from the base layer. Additionally, Layer 2s may involve more trust assumptions and can have sub-optimal influence on the base layer if transactions and fees are increasingly taken off the base chain. Rich Rines, Core DAO initial contributor\n\nRines noted that observers must closely monitor Dencun’s progress after deployment, which is expected by March 13 barring unforeseen delays. The Core DAO contributor also said questions may arise about whether the upgrade’s objective was the correct goal in the first place.\n\nOn the other hand, Wormhole Foundation co-founder and CCO Robinson Burkey views Dencun optimistically and expects the upgrade to herald a massive increase in cross-chain asset transfers.\n\nThe Dencun upgrade is undeniably a positive development for the crypto space. This upgrade will really enhance Ethereum’s scalability and security, which bodes well for defi and overall interoperability. This will result in cheaper and easier asset movement and more affordable transactions on Ethereum. Robinson Burkey, Wormhole Foundation co-founder and CCO,\n\nBurkey opined that the Dencun upgrade will bolster defi usage, accessibility, and dynamism as cheaper fees should incentivize greater on-chain participation in crypto’s largest decentralized ecosystem."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxNQWJjUGY4NVBWUjNsVUxkdzNNN3lQald4V3REcGNZSTRiOWNqdVFmTFUwbW00SG1udUZzNWM0ZU9GRGxLQWJBN25WWndfemlydkN0YldhdG5SU19PelJteTM1X0V6Qmh0b3RmNmhlbzNSc1dqTDR6b196XzJaX0xxSHFSaFNNZ0No0gGQAUFVX3lxTE82QUtETkI2Q245SjVVaERMMjFIa2ljMHNaTFJxR3pXME9pVVJGM3FFZDhheXMxTW9jbk9VaGZjLVp3TlVmM1dXdE01S2xfYkJOMjQwOHpsa2Q0SnhnN0NtejZxSGZad3UzQ2VqRnl6QWtDQnlLRXE3S1NYRk5MTUN6M1FQOWYyNXlMNFNDVkdINg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Mar 2024 07:00:00 GMT",
        "title": "Upland Reveals 'Share and Build' Airdrop Drive Ahead of Ethereum Token Launch - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nUpland, a crypto game built around real-world locations, announced Friday that it has launched the first wave of its \"Share and Build\" airdrop series. It's aimed at rewarding community members and newcomers alike for engaging with the Upland platform before its Ethereum token goes live.\n\nThe first chapter will let users earn Sparklet tokens—Upland's existing in-game utility token used to construct buildings and create content—through social media activities and in-app missions over a three-week period.\n\nUsers can connect their Twitter (aka X) accounts and earn points by engaging with Upland and Sparklet content on the social media platform. Those points will then be converted to Sparklet tokens within the Upland game. The Twitter-centric airdrop farming campaign recalls similar pushes around the Portal and BlockGames tokens.\n\nLast November, the EOS-based Upland announced that it planned to launch an Ethereum token that’s tied to its in-game Sparklet token. That whitepaper describing Upland’s plans was put to a community vote, with 87% of users voting in approval of the proposal.\n\nAD\n\nAD\n\nThe token tradability event (TTE) will follow the airdrop campaign, letting users convert their in-game Sparklet currency into a tradeable Ethereum token.\n\n\"We're excited to launch the 'Share and Build' airdrop series as we are getting ready for the Sparklet event. This initiative aligns perfectly with our vision of fostering a thriving Web3 ecosystem and rewarding passionate players,\" said Dirk Lueth, co-founder and co-CEO of Upland, in a release.\n\nThis first wave of the airdrop campaign offers 10 different reward levels, with users' engagement levels and social stats on Twitter determining their point multipliers. Users of select, as-yet-unrevealed Upland partners will also receive \"point boosts\" to help them earn more.\n\nAdditionally, by completing each forthcoming airdrop chapter, participants will be rewarded a distinct Block Explorer NFT that serves as a game piece within Upland. Collecting five such rewards unlocks an exclusive NFT for use within the Upland game.\n\nAD\n\nAD\n\nUpland began life in 2019 as a property-trading game, with digital versions of real life properties tokenized and sold within the game. It has since expanded into a more robust metaverse experience with vehicles, events, and other gameplay opportunities. Upland raised $7 million in a Series A extension round last November.\n\nEditor’s note: This article was written with the assistance of AI. Edited and fact-checked by Andrew Hayward."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxOLUxnUUg0ZklTem5meXd0bndvcjFHVUxBdXRDV081enVaMFNKMWtKcnZ5VElqNmNaLUZZR0tfOC1NYU03OEhkc0dzZ1FrV05nUEVlTk16WU9aVi1VajFUS242NkVnV0Facl82em9PSkpkWmJhdEZoTUliMUJDdnpZc1daakY0cVpPMmJxc00zMjZVMjY0OHpSakZoVHLSAaIBQVVfeXFMTjRpNHlseVZsNjl3QVI5c1ZpNzM2anpDRmpmZGpHbnVJQnkzUWZMT2ZvTXMxZG5zdXBoZWI1TUVSblFtWlBESjdCV1R5dmx0dHNQQ0pHeml2cS0zajlGYWFDNTVGZ0ljRFRHVC14ZW9GY1pPMnZuZ2x2ZEp0VHZvRXVicGh1TmU1bG56OHdnZ2dxWU92SU8tNUs5dXhMOUFEdlRB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Mar 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Price Drops 7.8% A Day After Dencun Upgrade, What’s the Next Support? - CoinGape",
        "content": "Following the successful implementation of the Dencun upgrade, Ethereum has encountered significant selling pressure. As of the latest update, the Ethereum (ETH) price has declined by 7.8%, trading at $3,669 with a market capitalization of nearly $450 billion. Additionally, Ethereum’s daily trading volume has surged by 45% to $32.29 billion\n\nEthereum (ETH) Price Levels to Watch Ahead\n\nThe Ethereum price faced resistance at the $4,000 level and initiated a downward correction, mirroring Bitcoin’s movement. ETH dipped below crucial support levels at $3,920 and $3,850, signaling a short-term bearish trend.\n\nadvertisement\n\nIt briefly dropped below the $3,680 support area, reaching a low of $3,625 before consolidating losses. Currently, a significant bearish trend line is forming with resistance around $3,850. The primary resistance levels are near $3,850 and the trend line, close to the 50% Fibonacci retracement level from the recent swing high at $4,083 to the low of $3,625.\n\nIf the Ethereum (ETH) price surpasses the $3,880 resistance, it may regain bullish momentum, aiming for the $4,000 level. Conversely, failure to break above $3,850 could lead to further downside movement. Initial support is at $3,680, followed by a major support zone near $3,600, with a potential downside target at $3,500. A decisive break below $3,500 might trigger a decline toward $3,350.\n\nPopular crypto analyst CrediBULL Crypto explained that the range of $3600-$3700 for Ethereum is likely to attract significant buying interest in the short term.\n\nFurthermore, blockchain analytics firm Elliptic uncovered a substantial transaction involving $12 million worth of Ether by the Lazarus Group. This transfer was facilitated through Tornado Cash, a cryptocurrency mixer. Despite being subject to sanctions, the North Korean hacker organization has resumed its use of this platform.\n\nThe funds are traced back to a cyber-attack on HTX and the Heco Bridge in November, orchestrated by the Lazarus group. This attack resulted in significant losses amounting to $100 million for the affected platforms.\n\nETH Gas Fee Drops Under $10\n\nAccording to Santiment, an on-chain data provider, the current scenario of Ethereum surpassing a $4,000 market value differs from October and November 2021. Today, the network’s transaction costs are significantly lower, standing at less than 1/6th of the previous levels. With gas fees averaging $9.35, this improvement can be attributed in part to the enhancements in network fees following the transition to Ethereum 2.0.\n\nBhushan Akolkar Bhushan is a FinTech enthusiast with a keen understanding of financial markets. His interest in economics and finance has led him to focus on emerging Blockchain technology and cryptocurrency markets. He is committed to continuous learning and stays motivated by sharing the knowledge he acquires. In his free time, Bhushan enjoys reading thriller fiction novels and occasionally explores his culinary skills.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxOWFpGLTI5Q0lfSV9qMkJ5eXJ4d3lLRVJYalVqdnp3MzN1eFFnZTByS2lUVVhUM0JvNW9abHlCS1AxMDlQUVVyQUd6dTNBUU44cmJ1ZVlGT2RfbHR2WlFpSno1OE1EaFhEeEY5Z1pGamZtNWo3UW5PWU1CWHlqRG16MHFLeG5uTmNEekFkTkFDVlBWVjRLcUZQTUppb1hYdXlBdG9zeVgzQlg5Mk9TUmNlZGlLd9IBuAFBVV95cUxORE10ZEdLS0djNVJrbmdwek43cE5NdnZGLUhhaGN1U2FGcGtsV0ZSWmk4bUpJcEtvOURKbmM1VG9kSFdlcFpDYzBRd3NabW45YjEzVGx5aXpNNlBmWHVCN3JLYUlSX0ljQURUanE2dHFVRkJFZXBGYWVDSFpEdVhTcDBqNHJPMFZTMWszc3MwYWR4bG1JMXhFNldqY2V6MDUwTmo3WXJFdTd5VW53NmhrTk5BbGpYbVpU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Mar 2024 07:00:00 GMT",
        "title": "Here’s How Low ETH Can Go if $3.5K Fails to Hold Selling Pressure (Ethereum Price Analysis) - CryptoPotato",
        "content": "Ethereum has recently breached a significant resistance level, crossing the psychological milestone of $4K and achieving a new high for the year.\n\nHowever, this breakthrough was met with resistance, leading to a noticeable correction. The question that arises now is whether this correction is merely a temporary setback or the beginning of a broader reversal in the bullish trend.\n\nTechnical Analysis\n\nBy Shayan\n\nThe Daily Chart\n\nA thorough analysis of the daily chart indicates a prevailing bullish sentiment surrounding Ethereum, evident in a strong and sudden upward surge that surpassed the critical resistance at $4K. This surge reflects heightened interest from market participants in Ethereum, resulting in increased volatility.\n\nHowever, after briefly surpassing the crucial $4K resistance level, the price encountered intensified selling pressure, likely due to profit-taking among participants, leading to a significant decline toward the substantial support zone of around $3.5K. It seems likely that the market will find support in this region and initiate a fresh rally.\n\nHowever, in the event of a continued corrective retracement, Ethereum’s price is expected to find support around key levels within the Fibonacci retracement, specifically between the 0.5 ($3,181) and 0.618 ($2,966) levels.\n\nThe 4-Hour Chart\n\nFurther examination of the 4-hour chart confirms the presence of buyers in the Ethereum market, propelling the price to its highest level since April 2022. This surge, accompanied by increased market volatility, demonstrates significant buying interest aimed at surpassing the previous all-time high of $4.8K.\n\nHowever, following the breakthrough above the critical $4K resistance level, the price faced rejection, leading to a sharp decline aiming for the key support zones around $3.5K and $3.3K. Additionally, an expanding bearish divergence between the price and the RSI indicator suggests the potential for a notable market correction.\n\nNevertheless, it is important to recognize that healthy bullish markets often experience periods of consolidation correction, allowing the asset to rest and rebuild demand. Therefore, it seems likely that the price will find support in the medium term, continuing its overall upward trend.\n\nOn-chain Analysis\n\nBy Shayan\n\nEthereum’s price has surged rapidly in recent weeks, briefly surpassing its previous all-time high of $4,000. This surge has attracted numerous speculators to the market, driving up buying pressure and instilling confidence among investors.\n\nThe accompanying chart illustrates the open interest, a valuable metric for assessing sentiment in the futures market. Open interest quantifies the number of outstanding perpetual futures contracts across various crypto exchanges.\n\nIt’s evident that the open interest has soared alongside the recent bullish trend, reaching unprecedented levels. This surge indicates the intensity of both long and short positions in the perpetual futures market, resulting in an overheated environment.\n\nWhile elevated open interest is typical in a robust bull market, it can also contribute to heightened volatility and unexpected market corrections. As such, it’s prudent for investors to carefully manage their risk in the short term."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxOTDBoeHJ3RldXN2tfZGxzMjdhWk1xWVNEZlcyU29BaUFxSGdMVnRXenBCcmItU256UWpvRk8zWkdFd1o3YzVNQWpydkZ0T2lGMmd0SGFzVlZjN1Fua3paQ0hkd1gzNHZhTGl0S1d3VHI5M0RYYkVDZF8tN2tPYmQyTQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Mar 2024 07:00:00 GMT",
        "title": "Upland unveils “Share and Build” Airdrop ahead of $SPARKLET token launch on Ethereum - The Cryptonomist",
        "content": "Upland has announced its Airdrop “Share and Build” program in anticipation of the launch of its token on Ethereum. The cryptocurrency game is gearing up for the debut of the Sparklet token and is offering rewards to users through game missions and social media interactions.\n\nLet’s see below all the details.\n\nUpland Airdrop Strategy: Launching the Ethereum Token\n\nAs anticipated, Upland, a game of cryptocurrencies based on real-world locations around the world, announced on Friday the launch of the first phase of the “Share and Build” airdrop series.\n\nThe goal is to reward both existing community members and new users who engage with the Upland platform before the launch of its token on Ethereum.\n\nThe first chapter of the series will allow users to earn Sparklet tokens, used within the game to build buildings and create content, by participating in activities on social media and missions within the application for a period of three weeks.\n\nLast November, Upland, based on EOS, announced plans to launch an Ethereum token linked to the Sparklet game token.\n\nThe whitepaper detailing these plans has been submitted to the community vote, with 87% of users voting in favor of the proposal.\n\nThe token commercialization event (TTE) will follow the airdrop campaign, allowing users to convert the in-game Sparklet currency into a tradable Ethereum token.\n\nAirdrop and NFT: expanding the gaming experience in the metaverse\n\nDirk Lueth, co-founder and co-CEO of Upland, stated the following:\n\n“We are excited to launch the ‘Share and Build’ airdrop series as we prepare for the Sparklet event. This initiative aligns perfectly with our vision to promote a thriving Web3 ecosystem and reward passionate players.”\n\nThe first phase of the launch campaign offers 10 different reward levels, with user engagement levels and social statistics on Twitter determining their point multipliers.\n\nFurthermore, selected Upland partner users will receive “point boosts” to increase their earnings.\n\nIn addition, each completed chapter of the airdrop will guarantee participants a unique NFT Block Explorer, which will serve as a gaming element within Upland.\n\nBy accumulating five of these awards, you will gain access to an exclusive NFT to use in the world of Upland.\n\nWe remind you that Upland originated in 2019 as a property trading game, with digital versions of real assets tokenized and sold within the game.\n\nOver time, it has evolved into a solid metaverse, offering vehicles, events, and other gaming opportunities. Last November, Upland raised $7 million in a Series A extension round.\n\nRevenues for Upland players in 2023 and more\n\nUpland has generated approximately $13.5 million in revenue for players in 2023, establishing itself as a growing digital economy and an economic hub in the Web3.\n\nRevenues are withdrawn in USD via PayPal in collaboration with Tilia, a payment solution offered by Second Life, another Metaverse platform. Additionally, players can withdraw their funds using Upland’s native UPX.\n\nThe co-CEO and co-founder of Upland, Dirk Lueth, shared this information in a press release with NFTgators, stating:\n\n“The platform has over 3 million registered users with active participation, turning Upland into an immersive digital economy.”\n\nPlaying and selling virtual properties on Upland has allowed uplanders to make millions in profits, while the platform has formed partnerships with entities such as FIFA, UNICEF Brazil, and Susan G. Komen.\n\nUpland emerges as a symbol of the power of GamiFi, true ownership, and engaging digital economy.\n\nFurthermore, Upland has announced progress in the ecosystem of user-generated content (UGC), open to all individuals.\n\nThe platform offers players the opportunity to verify the size of the property and the potential to adapt to different structures, welcoming valuable user feedback.\n\nThe video of the roadmap for the first quarter of 2024, published on January 10, 2024, reveals that Upland will focus on automotive transportation, car races, Sparklet, and renewed seasons."
    }
]