[
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxQeWhhc1dGRzFkeE02ZEE5TlZtT0NUeDdYdkwtYTBkN3g2Z2QyTWxlTE8wNGpOeEJMUkRxS2dNYkNQQ1BUTUNhQmFxa2FFZ09XY1pqTU1GSlFBN0Q0VnkyY1puU2dHclpobUtNYkEyQWNlZnRuMlYxYmc0Uzg3a0N3Y2FfQkx3RjF4OHdJbDlZQjRDLV8zQjlEcEdRZURxMFVyOVVha0pQeVMtNnNPdFJNUEdpaG03MWFB0gG-AUFVX3lxTE8wcHdfeGVibjJrNmR1cG1qQ3NqQW1yZ2lLeEN3c3JzcTFDVFhNOGFOR2dnWi1BZWtQdUpVZnZxQV9iZTUwNHVWaWZxUU8tOWhvV3BiRjlRY05Ed3VqM3hZbmFXcEhHQXZTdExSNW5MOWstTVFYN044UDFkTjRKNU1WNWZCVGwyVzVFdDF6VEJWZHZIck5LcEduQWhoWkQ1bmxiZkNIeVNsN090MzloSjFOaEJrdHNhY0lHak9DT2c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jul 2024 07:00:00 GMT",
        "title": "Blockchain Startup Rome Raises $9M to Serve Ethereum Layer-2s Through Solana - CoinDesk",
        "content": "A sequencer is the component of a layer-2 blockchain that batches up transactions and sends them to the base Ethereum blockchain to be settled, and some experts say these sequencers need to be decentralized to eliminate what can be single points of failure. A DA project is designed to store the reams of transactional data generated by Ethereum layer-2s, and to do so at a lower cost than what it takes to put the data onto the main Ethereum chain."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE4wWWxDQ1lud0JQeDNMQzhHT281alVPMUx0a0RxOGZUa0VqdDlISlI4SzNIRmJ3cjk3YXJMY3VVU2I1M29IMlBZYXdfQ2RINy1Qalp6YVFsS0pKUUo1SW43QmJrYnpKUThfUDczTWVxb1BVbGhDY2Ywbi1n0gF_QVVfeXFMTnNfVlY5YS1mVk94cU5NTFFoSlJpUHozNGdNWkYxY2FHYUs4T0tVTUI4V3pOTHFkYWtzVmF3VTl0MXBDc0JFUk5SS18tc0RuNEp4ZWx6YURPOVpvOFpGYktsaUZFWVlDZERXSjdlUmlvT1AzZ1NucDltZVVMUjVJMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jul 2024 07:00:00 GMT",
        "title": "$34 Million in Ethereum (ETH) in 24 Hours, What's Happening? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nEthereum (ETH) whales have started to make major moves amid the ongoing uncertainty on the market. Per the latest tweet from Whale Alert, 11,215 ETH were transferred from an unknown wallet to crypto exchange Coinbase earlier today.\n\nAdvertisement\n\nThis latest ETH transaction is estimated to be worth around $34.35 million. It is a major move as it appears that the whale has shifted ETH in order to trigger a sell-off. Moreover, the timing of this sell-off is crucial as it comes amid the recent market crash.\n\nThe broader crypto market has been consolidating after last week’s crash. The price of Ethereum, the leading altcoin, has crashed 16.68% over the last 30 days. This shows the intensity of this market dump, impacting major coins like Ethereum and Bitcoin (BTC) .\n\nWhile many are still expecting a price recovery from ETH, it appears that some traders are dumping their holdings. In the case of this Ethereum whale, they have almost $34.35 million in ETH. Since this is a major amount, it can further impact the market and push the ETH price to lower levels.\n\nAdvertisement\n\nWhales always play a crucial role on the digital asset market. The buying and selling from these traders leave short-term impacts on the price movements of a particular coin. In this case, the Ethereum price can absorb the toll of this sell-off. It may hinder the potential recovery of the coin after a recent downturn.\n\nETH price outlook\n\nAs of press time, Ethereum is trading around $3,072. While the price is up 0.52% in the last 24 hours, it has failed to recover from the previous losses. The recent bearish sentiment has not been good for bulls, causing uncertainty on the market."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxQWnl0eHpiQ2tOSWJGSGJsV1cybmxLSHRsM3BuLS1xVEo5a2hTM0p0WkdBVGZIZkR4MWV3RnkxT25sZEFQaEpWdF9USE4zMXk3bHU3MU5tZFJoRjU3bEtOc3NPSWFScDI3SjJhOUZWeWlqZkN0R2NJVkVsT01uam1lMkNFTExTelhYTVJrQ0F5ZzhFMDl3S3NLeHp2cWZROE93QzFkbVkzZjM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jul 2024 07:00:00 GMT",
        "title": "Rome Protocol secures $9 million to bring Solana capabilities to Ethereum Layer-2 - CryptoSlate",
        "content": "Rome Protocol has secured $9 million in a funding round to integrate modular services from the Solana network into Ethereum’s ecosystem.\n\nThe protocol stated that its funding round included several notable investors like Hack VC, Polygon Ventures, HashKey, Portal Ventures, Bankless Ventures, Robot VC, LBank, Anagram, TRGC and Perridon Ventures.\n\nThe round also included notable angel investors, such as Solana’s Anatoly Yakovenko and Austin Federa. Other investors included Nick White, Santiago Santos, Comfy Capital, and Jason Yanowitz.\n\nRome protocol\n\nAccording to the protocol, the platform would be designed to integrate Solana’s capabilities into services on Ethereum.\n\nThis approach will allow Ethereum-based rollups to use Solana as a shared sequencer, thereby confirming transactions faster, enhancing privacy and scalability, and reducing blockchain costs.\n\nRome Protocol pointed out that Ethereum’s isolated sequencer feature raises concerns about liquidity fragmentation, weakest link security, and interoperability on the network’s rollup-centric roadmap. Due to this, many rollups rely on centralized sequencers, which risk censorship, limited visibility, and critical downtime.\n\nTo solve these challenges, Rome Protocol will enable rollups to use Solana’s existing validators as shared sequencers for transactions, state maintenance, and transaction publication. This approach aims to turn Solana’s 50,000+ transactions-per-second (TPS) capacity into infrastructure for Ethereum rollups. It also ensures atomic composability with transactions confirmed on Solana before submission to Ethereum.\n\nRome Protocol will allow developers to focus on their applications rather than building new cross-chain interoperability infrastructure. Ethereum developers canuseg familiar technologies like OP Stack for execution and state maintenance.\n\nShared sequencer architecture\n\nThe proposed shared sequencer architecture includes the Rhea, Remus, Romulus, and Hercules features.\n\nRhea will ensure fair sequencing and submission to Solana, while Remus will enhance atomic transactions across rollups.\n\nAccording to the protocol:\n\n“Rhea enables fair and blind sequencing of rollup transactions. All transactions are treated equally and processed on a first-come, first-served basis. Remus enables atomic execution of cross-rollup transactions as a premium service.”\n\nRomulus will facilitate atomic transactions across Solana and various rollups, while Hercules will accept ordered transaction blocks from Solana.\n\nMentioned in this article"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxPV1JnX00zRE4yamxpQkQwcWctcHNTNDRVYk5KY0JGQVpRNDZwWXJPYWZxTUJSckV4ZlNiUHVWNmNsLU9aUkVuQm9pOWxkVUNmUnJzSFg2bUI1Nk8zZWN6ZEJFTm4tdDFkaFZ1VVpWTW10dkloZURqNm1MZ2JSdlpVX2pKOVB3UdIBiwFBVV95cUxNNGZhamU5TFd4Ulg0MjFfbjBRZ2JPVHN2bzd6dnVrWG5XSW1YaThlMUlwWHJxekhGelRQNWN1dkVaczBoU0dfZF9vVUR4b2dIR1VRMVF5Q2x4N09qT2ZNV2J3bVVYMFJWNXlCNnhNZkhQRGhQWVVwVDgwQjZySFk0Umo2bzVRMDEtWFVN?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jul 2024 07:00:00 GMT",
        "title": "Ethereum: How whales failed to reverse ETH’s bearish trend - AMBCrypto News",
        "content": "Most short-term traders experienced losses and would be eager to exit their positions in case of a price bounce.\n\nThe $2.8k level is likely to be revisited as support, but it is unclear if the bulls can hold on thereafter.\n\nThe Ethereum [ETH] flow from exchanges took a turn recently and strayed deep into negative territory in June, but this has not turned out the way investors were hoping it would. Instead of appreciating, the prices continued to drop.\n\nBearish sentiment was prevalent in the market, as seen by the price drop below $3k. This psychological level is likely to be contested hard, but the selling pressure behind ETH has been unforgiving.\n\nWhale accumulation did little to halt bearish trend\n\nIn June, the 7-day simple moving average of the exchange netflow dropped deep into the negative territory. It stayed negative till the 28th of June.\n\nIn the past ten days, it has crept into the positive territory, accompanying the sharp price drop seen in July.\n\nThe negative netflow indicated Ethereum tokens moving outside of exchanges and signaled accumulation. Despite this, the prices continued to slump.\n\nInvestors would be hoping that this is the final jolt of pain before the trend turns bullish.\n\nThe supply distribution analysis showed that the 10k-1M ETH holders have increased since mid-May. The 1k-10k ETH wallets moved higher toward the end of June but have fallen lower again over the past week.\n\nTogether it indicated the large whales with 10k+ ETH accumulated, but most other wallets have reduced their holdings.\n\nWhere can traders expect prices to find relief?\n\nAMBCrypto noted from the in/out of the money data that the $2850-$3000 zone was a strong support zone due to the number of holders.\n\nOver the past three days, the price decline to $2.8k saw a bounce to $3k but it is unclear if the buyers can withstand the sellers’ onslaught any longer.\n\nAround the current market price, 60.25% of the addresses were out of the money, which meant that price bounces would likely be sold as holders look to exit at break-even. This can add to the downward pressure.\n\nThe MobChart data outlined large limit orders on the order books for Ethereum. The $3100 and $3170 levels have $3.7 million worth of limit orders. Above them, the $3220-$3250 region and $3500 have just over $5 million, marking these as strong short-term resistances.\n\nRead Ethereum’s [ETH] Price Prediction 2024-25\n\nThe $2800 level has just under $10 million worth of buy orders and might be tested once again. Overall, the metrics show that in the short term, bears were in control.\n\nThe exchange outflow in June did little to halt the price decline, and the best bulls can hope for now is a period of consolidation around the psychological $3k support."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxQNXk2Z0FVMjhhQ2tLQURnMThVdzNUUlZPa2pLdHBqZ0VfaHhIUWZjOTNpMVMwRzN3RkNSQ0tIaTI2NzIxOUtCNHJZcTlCWWRaSjZfa2RFQXEyR3ZycEduTXMtX19iQmF2TEQ5N1ZDQjk5T2VGdGl6TUpwZGtZbmVjRnVPV0VpQkZNMEJIbl95ODlRWEZCVjhuX1RB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jul 2024 07:00:00 GMT",
        "title": "News regarding Ethereum (ETH) ETFs: towards a new bull run? - The Cryptonomist",
        "content": "News regarding the approval of Ethereum (ETH) ETFs, which could trigger a new bull run in the cryptocurrency market, with the United States SEC playing a crucial role.\n\nLet’s see all the details below.\n\nThe SEC at the center of the wait for spot ETFs on Ethereum (ETH): latest news\n\nAs anticipated, Ethereum ETFs are considered a possible spark for a new bull run, but the approval of the US SEC is crucial.\n\nThe regulatory authorities, traders, and investors are eagerly awaiting the presentations of the form S-1 for the spot Ethereum ETFs, which are expected to be available by the weekend.\n\nToday, the entities that have applied for ETH ETFs, including BlackRock, 21Shares, Fidelity and Grayscale, will submit the S-1 forms to the SEC after making the requested changes.\n\nThe first half of 2024 was dominated by the issue of Spot ETFs on Bitcoin. Now, the attention has shifted to ETFs on Ethereum.\n\nNate Geraci, co-founder of the ETF Institute, tweeted:\n\n“the amendments to the ETF S-1 of the spot ETF should be made tomorrow… How quickly will the SEC be able to reverse course?”\n\nGeraci emphasizes the importance of commissions, adding that the issuers might be ready to launch the products in the coming weeks.\n\nBitwise, an asset management company, has recently updated its S-1 registration with the SEC to list and trade shares of ETH ETFs.\n\nThe CIO of Bitwise, Matt Hougan, predicts that ETH ETFs will attract at least 15 billion dollars in net flows by 2025. Hougan, in particular, states the following:\n\n“Everyone wants to know how much the exchange-traded product (ETP) of ether spot will attract in terms of net flows. My answer: 15 billion dollars in the first 18 months. It is not a random guess. It is what the data suggests.”\n\nFocus on the price of Ethereum\n\nAt the moment, Ether has slightly recovered from last week’s drop, trading at around $3,042. The price has increased by 0.7% in the last 24 hours, but remains 12.2% lower compared to seven days ago.\n\nThe recent history of Bitcoin shows how the approval of the Spot BTC ETF led to a 58% surge in just a few months. On January 10, the day of the approval of the Spot ETF on BTC, the price of Bitcoin was $46,105, rising to $73,097 in March.\n\nThe approval of the Spot ETF on Ethereum could bring the markets back into the green. Based on historical data, the approval of a Spot ETF on ETH could push the price of Ethereum above $4500, assuming a 50% increase.\n\nIn any case, the 1-hour chart of ETH/USD showed a recent bullish trend that started at $2,803, highlighted by a significant bull candle that reached $3,096 before a slight retracement.\n\nA bullish engulfing pattern indicates a possible continuation of this trend, although the recent declines suggest a consolidation phase. The volume analysis reveals a peak during the bullish movement.\n\nHowever, the decreasing volume during the consolidation suggests that, if the volume were to increase again, the bull trend could resume.\n\nOn the 4-hour chart of ETH/USD, Ethereum has confirmed a downward trend recently bouncing from the low of $2,803. A strong increase on July 8 indicates a significant bull movement, potentially suggesting a short-term reversal.\n\nHowever, the recent candles with small bodies and reduced shadows also highlight a certain degree of uncertainty in the market. The volume analysis supports this bullish movement with higher volume, indicating a genuine buying interest.\n\nThe daily chart shows a clear downward trend in the last month, with ETH falling from around $3,889 to a low of $2,803.\n\nContradictory forecasts: analysts divided on the future of Ethereum ETFs\n\nWith the imminent launch of spot exchange-traded funds (ETF) on Ethereum, the financial community is divided on the possible consequences of this debut.\n\nIf the Bitcoin ETFs have led to a significant increase in the price of BTC, analysts are not sure that Ethereum will follow the same path.\n\nRyan Lee, chief analyst at Bitget Research, expressed skepticism regarding the impact of ETFs on Ethereum compared to those on Bitcoin, stating:\n\n“Bitcoin and Ethereum are two assets with different fundamentals and a distinct market appeal. When ETFs on Ethereum start trading, ETH will capture about 2.5% of its market capitalization. If this bull scenario were to materialize, the spot ETF on Ethereum could see $11.55 billion in assets under management.”\n\nOn the other hand, Galaxy Research predicts that inflows into Ethereum ETFs will be slower compared to those into Bitcoin.\n\nCharles Yu, vice president of research at Galaxy, has estimated that “Ethereum spot ETPs will see about 5 billion dollars in net inflows in the first five months of trading.”\n\nDespite the moderate expectations of some, other observers are very optimistic about the future of Ethereum post-launch of the ETFs. Steno Research predicts that ETH could reach at least $6,500 by the end of the year, thus surpassing the previous all-time high of ETH by 33%.\n\nStandard Chartered offers an even more bullish forecast. Specifically suggesting that the approval of spot ETFs on Ethereum could lead to up to 45 billion dollars of inflows within the first 12 months. Potentially pushing the price of ETH to $8,000 by the end of 2024.\n\nHowever, not everyone shares this optimism. Jupiter Zheng, partner of the Liquid Fund of HashKey Capital, predicts a short and modest initial rally followed by a strong “sell-the-news” event.\n\nEvent in which investors might sell their positions after the launch of the ETFs, leading to a price correction."
    }
]