[
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTFBVWlRGcFRpUmJ2QUhHdU14MHJiOGcxb0tLeXhHVFV1NWxOWnZXcFdlRHduZ1dWU01kQXNoc1UzcFdPeGtrZ29sYlJEc3Yzd2VPZmFEenFYREtiTDR6TXozQm1meDJUd0xKYUEwcDgwLS1LbVHSAXtBVV95cUxOSnpianV6RXViZFFUTFFhZmRJdEJGbUREeEphVjRjcWJMQ21nUm0wN1BTeGY3SWpNNWN0ZzdpRE4wRDZ5VWV0NGZmQjBEU3l5ZE8tWTI0ZDJfd3JVcGZvMmQ0MWJRZWYxcXQ0bjRHcHFyTDg2clg1akY5NG8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Feb 2024 08:00:00 GMT",
        "title": "Bitcoin, Ethereum Mostly Flat as Solana Price Sags 5% - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin and Ethereum were mostly flat on Tuesday morning while the Solana price sagged by 5% compared to yesterday.\n\nEven while trading mostly flat, the price of Ethereum managed to very briefly inch past the $3,000 mark before falling back to $2,932.95 at the time of writing, according to CoinGecko data. It's down 0.4% from yesterday but has gained 11% since last week.\n\nMeanwhile, Bitcoin seems to be taking a breather after looking like it was going to reach $53,000 yesterday. At the time of writing, Bitcoin is changing hands for $51,491.97—a 0.8% drop from the same time yesterday, according to CoinGecko data.\n\nBTC has been enjoying a lot of attention and renewed enthusiasm because of all the action on spot Bitcoin ETFs in the U.S. Net flows for the funds have already surpassed $3 billion as of last week.\n\nAD\n\nAD\n\nAll that hype has been compounded by the upcoming Bitcoin halving, which traders are expecting will launch the world's oldest and biggest assets by market capitalization into a bull market.\n\nThings for Solana have been more of a mixed bag.\n\nThe total value locked in DeFi projects on the network—launched in 2020 as a direct competitor for Ethereum—has topped $2 billion for the first time in a long time. But SOL, the native token of the ecosystem, has taken a beating on its price since yesterday.\n\nAt the time of writing, SOL is changing hands for $105.40—down 6.5% since yesterday and 3.2% lower than it was a week ago, according to CoinGecko data.\n\nAD\n\nAD\n\nThis year, Solana has seen a ton of activity because of several large-scale airdrops, like Jupiter, Dymension, and meme coin WEN.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxNNnZPczlqRGx6MlU3bWtZT0puLUF1MFdnVE5sNGdIQmVKUlhldHJkNmRIU1ZWRldTMzRiUnlSdHVtaXJXejZmcnJrdXVqM1IwZUJvVFR4WVc0X0RyMGRPcGVyRzJELXpsXzZTSi04bGUyVjJneURZSFFZdHVkTUhMTnppZm1ST2xj0gGOAUFVX3lxTE1oLU5KcWRNeGtyMENDQlBWMUlSd3d3aDROUjVGQllmQ0dCVFpGaEFyMUZoNmhoQ0tvMmM4emtNYXl3M1pZMmZjaVdyNlVTQm9VT2VxNG5XT01jemtNU0ZpcGVaRHdLM2NlbFhzYURjUXpyRkt3ZzAzaFJlcGdDbTE1ekI1ZXFlT1Z2QmN5eVE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Price Prediction: Will ETH Hit $3.3K in February? - CryptoPotato",
        "content": "Renowned crypto analyst Michaël van de Poppe has made a bullish prediction for Ethereum, suggesting that it could soar to $4,500.\n\nVan de Poppe believes Ethereum is soaking up Bitcoin’s upward momentum as investment capital shifts to ETH. According to the analyst, this is a “massive period to be rotating from Bitcoin towards Ethereum.”\n\n#Ethereum is on its way towards $3,800-4,500. pic.twitter.com/TfoBGloBsH — Michaël van de Poppe (@CryptoMichNL) February 19, 2024\n\nVan de Poppe’s forecast comes amidst Ethereum’s recent surge in price, which saw a 9% increase in seven days and 17.5% in one month. Ethereum-related cryptocurrencies have experienced notable gains as well, with MATIC and OP surging by 5% and 6%, respectively.\n\nOn Monday, ETH tapped $3K, its highest in nearly two years, signaling a bullish trend. The recent price surge could be attributed to the growing optimism surrounding the potential approval of a spot Ethereum ETF by the SEC, following the footsteps of Bitcoin.\n\nSome experts, such as Tom Crown (CEO of Crown Analysis), believe the upswing could continue in the following days, predicting ETH’s surge to $3,300 before the end of February.\n\nAnother person who outlined an optimistic scenario is Raoul Pal (co-founder and CEO of Real Vision). Earlier this month, he forecasted that ETH could rise to as high as $20,000 during the next bull cycle, while BTC could hit the astonishing $250,000.\n\nThe X (Twitter) user Altcoin Gordon was also quite bullish, setting a price tag of $11,250 to be reached by the end of the ongoing year.\n\nHowever, Ethereum’s current market strength could be further bolstered by the upcoming Dencun upgrade, or a short-term peak of BTC, according to the analyst.\n\nEthereum Upgrades Could Boost ETH’s Price\n\nThe Dencun upgrade aims to address Ethereum’s limitations in transaction speed and cost. By implementing sharding —a concept involving breaking network data into smaller “shards”— the upgrade aims to increase the overall computation throughput on the Ethereum network, making it more competitive with faster networks like Solana.\n\nVitalik Buterin underscored the Dencun upgrade as a significant development for Ethereum and its accompanying Layer-2s.\n\nAccording to Buterin, Dencun is a big step towards making Ethereum more “rollup-friendly” while enhancing scalability and reducing costs on transactions.\n\nBesides the Dencun upgrade, the integration of Verkle trees on the Ethereum blockchain is expected to streamline Ethereum nodes’ storage needs while maintaining their block validation capabilities, enhancing efficiency and decentralization within the network\n\nMeanwhile, another factor that could increase Ethereum’s price is the approval of a spot in the ETH ETF by the US Securities and Exchange Commission. Check out our recent video on the matter here:"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQcHY1RV90ZjBCNU1hMmhncTIyZEs5UnJqUVJiYkRoeVY5b3BmSGlhcW44a1dzVURiQlo4QXdlcjdJQUp3VzBCbkprbWJuR2FQQzNUZEU5VHhQbURRWHRKZEp5czExUlBxYm5HdGU5R1NVRGJLcW1uZlhpWExROVlOaTk5bmZOV2pwYlI5Uzc2bmNyYlB5Q0l2NQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Feb 2024 08:00:00 GMT",
        "title": "Why Ethereum, Filecoin, and Hedera Are on Fire Right Now - The Motley Fool",
        "content": "Speculation about cryptocurrency ETFs continues, but a lot is going on under the crypto hood.\n\nThe crypto market's hot streak is continuing, and since the market closed on Friday, there have been some big movers. And in some of these cases, the moves have been driven by real developments, not just hype.\n\nEthereum (ETH -0.88%) has risen as much as 8.1% since the stock market closed on Friday, Filecoin (FIL -0.78%) jumped by 40.7%, and Hedera (HBAR -2.34%) was up 38.7%. As of noon ET Tuesday, the tokens were up 5.4%, 30%, and 22.1% since Friday.\n\nBig crypto moves all around\n\nEthereum is rising in part because traders are still speculating that regulators will approve more crypto ETFs beyond the Bitcoin (BTC -0.45%) ETFs launched in the last few months. The next coin that is likely to get approval for one is Ethereum because of its size and recognition in the market.\n\nIf an ETF were approved, the purchasing activity around the coin could push Ethereum higher, in a similar fashion to the way Bitcoin has responded. Just last week, $2.4 billion flowed into Bitcoin ETFs.\n\nFilecoin's rise was prompted by more fundamental news: It announced it will store Solana's (SOL -0.46%) block history, allowing Solana to move to more decentralized storage. This should be a win for both cryptocurrencies; Solana can now focus more attention on expanding the high-throughput network while Filecoin gets a significant partner.\n\nLesser-known token Hedera is benefiting from the growth in its SaucerSwap decentralized exchange, which now has over $127 million in total locked value, a gauge of how much investors are putting into the exchanges on the ecosystem.\n\nBuilding the foundation of crypto's future\n\nIndividually, these moves may seem small. But together, they tell a story about where crypto is headed in the near future.\n\nBitcoin ETFs have been approved, which suggests that eventually, ETFs for Ethereum and other tokens could arrive too, bringing more money into the ecosystem and driving values higher. If an Ethereum ETF gets approved, there may soon be dozens of crypto ETFs.\n\nThe Filecoin and Hedera news is more useful for the industry long term. As more tokens and exchanges are launched, it's necessary for market makers to put value into the ecosystem, and that's part of what we're seeing with the SaucerSwap exchange. Filecoin helping Solana store its blockchain history moves that token toward the decentralized vision that so many advocates would like to see.\n\nIf Solana and Filecoin can work together to create an extremely fast, high-throughput blockchain with accessible storage, it would be a win for all blockchain users. This is where I think we will see more utility and financial products built in the near future.\n\nCrypto is maturing before our eyes\n\nTwo years ago, crypto was still in the speculative trading days, and speculation in that market still exists, but major tokens like this are now focused on building real utility on blockchains. If that utility is combined with more investors putting money into the crypto ecosystem, it could create a reinforcing loop of value creation."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMi9AFBVV95cUxNSUxGTExjOTE1OWtHOERzMmdlTVBSdkxhakVySktnMWpMbEtiNm00bFhwUFcxMVZhTHJDX2pXbTdHZEg1QVpfN29rRVpHN0hZOS1vcFltUjhQdi1WQmNMdTJkeFN0bnVEeWd6WkxMNW5rSDZkTXdIUzQtLU1pWmpYQ1V6S2o0dHU3ZU96dlNUZkFleUdaWjJ0NTM0TWs4Wk43TzFrWGNKWGVJS1ZlMlBPZzU5VkttdkpnNlJ2NVhobDVocy1sZnM4OW9LaThFWURlUlhXVllkRHhPZUFjdXRDejBwVGJBXzlPaTdXcUd5MFFyQ2Q00gH6AUFVX3lxTE9Wb0JlMUtNRWN6b25GWnZKN1VZajZnWUs4QVpINjdDelhkeE9zSHVUa19hUFFwblZMbnZCVWlENUlEQ1JkR285cUxsRFhQY3RQcXctby1kZ19ReHRGUGd6cTljc19zV1ZENGJVdW5LWlZQNWVTeUVndjU3cjRwaDA3cGlwOVJ6UlE0WEY4Y3F6Nm1yQ0tvVW9rdXRudXN6LUlfdDF4Vm1TMEplQW0tTllBNVN4X3RZZ09pZ1lpdUUzbW52WGlGMGNsR193c0VHQVN0R3JMS1RCSm5ES3I1TzZ6RTV4UlZMUFVoRWVmV05xV05IdTJsRlNQVEE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Feb 2024 08:00:00 GMT",
        "title": "Ethereum price scrapes $3,000 psychological threshold after 20 months, inspiring conjecture on altseason - FXStreet",
        "content": "Ethereum price has tested the $3,000 psychological level, a threshold last hit in 2022.\n\nETH could drop 10%, giving sidelined investors another entry before next leg up.\n\nThe bearish thesis will be invalidated if the PoS token records a higher high above the $3,004 peak.\n\nEthereum (ETH) price has managed to test a crucial milestone for the first time in months, which is a remarkable show of strength considering Bitcoin (BTC) price has hinted at a fall. This means that Ether has managed to sidestep the BTC cue, causing markets to speculate on whether another alt season is underway.\n\nAlso Read: Ethereum outperforms Bitcoin with double-digit weekly gains and spike in Open Interest\n\nEthereum tests $3,000 after almost two years\n\nEthereum (ETH) price scrapped the $3,000 psychological level on Tuesday, a level last tested on April 26, 2022, almost two years ago. It comes a day after the Proof-of-Stake (PoS) token outperformed BTC with double-digit weekly gains and a spike in Open Interest.\n\nOver the last 24 hours, Ethereum price has slumped 0.78%, causing up to $15.47 million in short positions to be liquidated against $20 million of long positions. The disparity shows that most traders anticipated the surge in Ethereum price and took long positions, only that their take profits were higher such that their margin accounts could no longer support the open positions.\n\nETH liquidations\n\nAs it stands, Ethereum price is suffering the aftermath of an overbought asset, seen with the Relative Strength Index (RSI) above 70. Traders looking to take new long positions should probably wait as the ETH market is at high risk of a pullback to the south.\n\nSuch a directional bias could provide sidelined or late investors a buying opportunity around the $2,689 support level before the next leg up. This would denote a 10% fall below current levels.\n\nIn a dire case, Ethereum price could slip below the aforementioned level to test the $2,500 level. Or ETH could find support at the $2,388 critical support.\n\nETH/USDT 1-day chart\n\nOn the other hand, if ETH bulls show strength, Ethereum price could reclaim the $3,000 milestone, potentially going as high as to reclaim the $3,004 range high. A decisive candlestick close above this local top on the daily timeframe would invalidate the bearish thesis.\n\nIs an alt season coming?\n\nMeanwhile, speculation has it that the bold move by Ethereum price against BTC’s price consolidation could be the beginning of an alt season.\n\nAlt season is a colloquial term that is used to describe a phase where investing in altcoins provides better returns compared to Bitcoin or Ethereum. Consequently, the dominance that Bitcoin holds in the market declines, and that of altcoins increases. The alt season indicator from BlockchainCenter is also leaning in favor of a potential altcoin season taking place as opposed to a Bitcoin season.\n\nAlt season index\n\nQuick summary of an alt season in play\n\nFresh capital enters the cryptocurrency ecosystem, effectively flowing into stablecoins, Bitcoin or Ethereum on preference that they are relatively safe: check! Markets rally as a consequence of this capital influx: check! The profit from these ecosystems, along with the new capital, moves into altcoins: in progress This rotation of capital triggers an alt season: possible result!\n\nThe chart above provides a visual representation."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxPbl9nVjZyODU3T0kwb1VwZGVpUDlaNzViQmJfUjFpVERYcW1OQjk5QnI5blBOaXlvR2tOajhkdEk2Y1dnWkFmUGdrdUM4QlB0LUVCdXNsWnNsREFWdGJUR2c0cFBzMUVJbDFlQU9aT0daSURzVUZrRXJSZWNWTzBQc3lKQ09OcFZCVThYRnJKMTNfclXSAZgBQVVfeXFMTmxaTmlfYkV5NHNZVGdZZktKY0xWZ3N2TTV1RUcyTmNqZXplRGlSZEVseEVpZGdzQ2pnZXB6Y09ndVk2R1YxYm5OWWhpSU5qSlZwMXBzMjFXekllOWFQTUZrc0x3SGZRdHNqS3NHT3lycmNSVVJNNkdIQnU5MEFPQXluN25DLWJXUzRkdkxYTTFnQW5FWXdoaEo?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 20 Feb 2024 08:00:00 GMT",
        "title": "XRP Brutally Denied, Ethereum (ETH) Flirts With $3,000, Did Bitcoin (BTC) Plateau? - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nXRP's recent price trajectory has been met with a stark rejection, as it encountered a near-impenetrable resistance level that has halted its upward momentum. This resistance confluence is particularly formidable as it aligns with the 100, 50 and 200 EMAs, key technical indicators closely monitored by traders for significant price movements.\n\nThe current price level has proven to be a substantial barrier for XRP, as the EMAs have converged to form a tight band of resistance. This band has effectively capped the price, acting as a ceiling that XRP has struggled to breach. The close proximity of these EMAs indicates a critical decision point for the asset; a break above could signal a strong bullish turn, while continued rejection may cement the current level as a robust ceiling.\n\nFurther exacerbating the situation is the noticeable lack of trading volume. Volume acts as fuel for price movements, with higher volumes often associated with strong price action. The tepid volume accompanying XRP's approach to this resistance suggests a lack of conviction among buyers, which can often precede a price retreat.\n\nFrom a technical perspective, the resistance zone around $0.58 to $0.60 is the area of interest. XRP's recent approach to this level was met with swift denial, indicating that overcoming this barrier will require a significant influx of buyer interest and volume.\n\nAdvertisement\n\nOn the support side, the $0.50 level is one to watch. It has served as a historical psychological and technical support level, providing a foundation for price rebounds in the past. Should XRP retreat, the response of buyers at this level could determine the asset's short-term fate.\n\nEthereum almost there\n\nEthereum is on the cusp of breaching the pivotal $3,000 mark, showcasing formidable strength in an otherwise tepid market. Its resilience and upward momentum may well act as a catalyst for broader market optimism.\n\nThe ascent toward $3,000 has been marked by consistent higher lows and higher highs, a bullish pattern that suggests strong buying interest at every dip. Technical indicators have turned favorable, with Ethereum recently pushing past the 50-day and 100-day EMAs — a sign that the momentum could sustain.\n\nSupport levels for ETH have been notably robust. The primary support at the $2,750 mark, which aligns with the 50-day EMA, has been defended well by the bulls. This level is critical as it has been tested multiple times, proving to be a springboard for subsequent rallies. On the upside, the psychological and technical barrier of $3,000 stands as the next significant challenge. A decisive close above this level could open the gates for further exploration into uncharted price territories, with potential intermediate resistance at $3,200.\n\nETH's exceptional performance can be partly attributed to the ongoing development within its ecosystem. The introduction of ERC-404, a new token standard that combines the versatility of NFTs with the fungibility of standard tokens, is an innovation that could further solidify Ethereum's position as the leading platform for decentralized applications.\n\nBitcoin faces opposition\n\nExamination of the BTC chart reveals that the asset is experiencing a consolidation phase, which is often a precursor to a trend continuation rather than a sign of stagnation.\n\nCurrently trading above the $50,000 mark, Bitcoin has maintained a steady position near this psychological threshold. The consolidation phase is characterized by a narrowing price range, with Bitcoin oscillating between support and resistance levels that converge over time. This tightening of price movement is often associated with the accumulation of assets by traders and investors, setting the stage for a potential breakout.\n\nThe key support level for Bitcoin lies around the $48,000 area, which aligns with the 50-day EMA. This level has been tested and held firm on several occasions, indicating strong buying interest. On the flip side, the immediate resistance is located near the $53,000 mark. A convincing break above this level could signal a bullish continuation, potentially targeting previous highs or setting new records."
    }
]