[
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxQOU1DeFJOa2xaOHZSUkZRbFEzdzJaR21fXzN4RlBKNU01cGp3ZkN5VF8tbTFMOFBva1RXWElLV2Rkb1BBNmNxeHlPcFhuVWN0bHBPRW5FMmdNSUVvblJ6SnlpNUJTcFNpWUY5dVdscGdTU0QxRmY4TXBjNVRmdmZiQlc3M1paRm85TDUwR2o0ekJPZ0FZYnc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Ethereum takes the lead over Bitcoin in derivatives trading volume - CryptoSlate",
        "content": "What is CryptoSlate Alpha? A web3 membership designed to empower you with cutting-edge insights and knowledge, powered by Access Protocol. Learn more ›\n\nConnected to Alpha Welcome! 👋 You are connected to CryptoSlate Alpha. To manage your wallet connection, click the button below.\n\nImportant: You must lock a minimum of 20,000 ACS If you don't have enough, buy ACS on the following exchanges: Coinbase Kucoin Orca\n\nConnect via Access Protocol Access Protocol is a web3 monetization paywall. When users stake ACS, they can access paywalled content. Sign up for Access ›\n\nDisclaimer: By choosing to lock your ACS tokens with CryptoSlate, you accept and recognize that you will be bound by the terms and conditions of your third-party digital wallet provider, as well as any applicable terms and conditions of the Access Foundation. CryptoSlate shall have no responsibility or liability with regard to the provision, access, use, locking, security, integrity, value, or legal status of your ACS Tokens or your digital wallet, including any losses associated with your ACS tokens. It is solely your responsibility to assume the risks associated with locking your ACS tokens with CryptoSlate. For more information, visit our terms page."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiYkFVX3lxTE9UeWJpU2t5OTAtQ0JUeVJEVWQ0bU9nNUFyam5UT2RBX1k3Vnhsb056cGFZamh6SXo5VTkxM0o5aTVQdlFOOW5EZmpjaHl1UkVjbTRtQ1pZbEhVMEZqRUVnWDNB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 12:55:21 GMT",
        "title": "Ethereum ETF hype spills over to Ethereum Classic, leading to 50% pump - Blockworks",
        "content": "Bitcoin is still down on 21-month highs set directly after the SEC bungled its spot ETF announcement on Tuesday. Ethereum, on the other hand, is way up.\n\nEther (ETH) has rallied more than 16% in that time and is now easily the year-to-date best performing top-20 cryptocurrencies by market cap. Bitcoin (BTC) is so far in second-place, with about half those returns.\n\nMarkets sold the news one day early due to the SEC’s unauthorized announcement and appear to have simultaneously bought the rumor on ether ETFs.\n\nEthereum Classic (ETC) — the original Ethereum hard fork in 25th position — is however having a moment. The blockchain’s native token ETC has spiked nearly 50% over the past day.\n\nDue to the timing, there doesn’t appear to be any real rhyme or reason for ETC to be climbing so quickly.\n\nThe devil’s advocate would say that Ethereum Classic is gearing up for a hard fork later this month tipped to better align the network’s EVM with Ethereum’s, which could help inspire projects to work with the chain.\n\nAnd the network’s hashrate did spike to all-time highs following Ethereum’s switched to proof-of-stake in late 2022, as former ETH miners sought a substitute revenue stream at which to direct their GPU mining rigs.\n\nEther has jumped from $2,200 to $2,650 this week. Ethereum Classic has gone from $20 to $30.\n\nMuch of Ethereum Classic’s post-Merge hashrate has stuck around, despite the network only seeing around 30,000 in transactions per day (about the baseline for Bitcoin Cash).\n\nFor scale, Litecoin is currently processing more than half a million transactions per day (boosted by the network’s own brand of inscriptions) while Ethereum mainnet handles about twice as much, per BitInfoCharts.\n\nStill, Ethereum Classic only boasts less than 15% of Ethereum’s hashrate recorded just before the Merge.\n\nETHPoW, the hard fork of Ethereum from around the Merge meant to compete with Ethereum Classic, currently has about one-tenth of the latter’s hashrate.\n\nRead more: Grayscale Still Deciding What To Do With ETHPoW\n\nIn fact, until yesterday’s formal SEC approval of spot bitcoin exchange-traded funds, ETC had returned nothing over the past year.\n\nThe more likely explanation is that traders are looking to frontrun the next big media narrative around crypto: the SEC approving spot bitcoin ETFs means an eventual greenlight for spot ether funds.\n\nDue to illiquid markets, dumb money or widespread left-curving, Ethereum Classic has tagged along for the ride but ended up dominating ether for gains over the short-term.\n\nGrayscale does already sell exposure to the token through one of its trusts, and the firm is now set to convert its $29 billion bitcoin trust into an ETF.\n\nSome reckon fund issuers might soon seek approval for ETFs for other cryptocurrencies, including XRP and solana.\n\nThe odds of fund issuers lining up to launch ETFs for Ethereum Classic are slim. Although stranger things have happened in crypto.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxNLTlRdmgwbUVsWml1MGctWDdPMXQ0czFRR3c2REs3b3IxVUpjM1BfdkhGSmhHcHBsRVJwREtpTVFWS2hyR2hVXy1INFpEbmE3NDNPcUhJTHFWN3gyWmpQbUZKWjBUZEU4SE9FX1lJM012czFNOTFWdGFwRHJWRWJPLUtLZWtSYS1zRTYybTNPZnRVUk5lMEhXa0JuemF4VnhXSUhjR9IBqgFBVV95cUxPX2tYNUxBNlJOTFRyTmZ4bHlRM3NMV2gwUHJKTUtOU2ZhajAxLV9OaUg4bTZhVERMZG9kU203R1M3NG5wenVJTTJFaXZoa3N4R3ViVW1TbjFVTm00U0xQMGZHWGJiUmFtTU45dWNkdjZEWW5rTjRsQUVpSTNPbUpMeHRVZW80eGw4ZXAwTHNrV3pKaWRMSVJFMXhIQk5mMkZhTWdoSWxMX3Ytdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Ether prices spike on hopes of an ETF — but the SEC signals that's less clear cut than bitcoin - CNBC",
        "content": "In this article BTC.CM=\n\nETH.BF= Follow your favorite stocks CREATE FREE ACCOUNT\n\nwatch now\n\nSt. Moritz, SWITZERLAND — U.S. Securities and Exchange Chair Gary Gensler fired warning shots to the crypto industry, casting doubt over whether digital coin ether would follow next in the footsteps of bitcoin to receive approval for an exchange-traded fund. After the bitcoin ETF approval, prices for ether — the token linked with Ethereum — spiked to their highest level since May 2022. That was because investors are betting on an ether — or ETH — ETF to be rubberstamped by the SEC next. The agency is due to give decisions on spot ETH ETF applications beginning in May. BlackRock, Invesco, Ark and VanEck are among the firms in line for approval, as well as Grayscale.\n\nThe SEC has long been an opponent of cryptocurrencies, and its bitcoin ETF approval in no way changed its stance in a big way. After the ETF decision, Gensler issued a statement in which he called bitcoin \"speculative\" and said it could be used for \"illicit\" purposes. One comment poured cold water over hopes of an ETH ETF. \"Importantly, today's Commission action is cabined to ETPs holding one non-security commodity, bitcoin. It should in no way signal the Commission's willingness to approve listing standards for crypto asset securities,\" Gensler said Wednesday after the SEC decision on the ETFs.\n\nCrypto as commodities or securities?\n\nA long-running debate in the U.S. is over whether cryptocurrencies are classified as securities or as commodities. Key to Gensler's comments was his reference that bitcoin's status as a \"non-security commodity\" was one of the reasons why the SEC was comfortable approving the ETF. Gensler made clear that \"the vast majority of crypto assets are investment contracts and thus subject to the federal securities laws,\" in the SEC's view. This complicates matters for an ETH ETF. \"One distinction which I think people have to look at which is that bitcoin clearly has been bucketed as a commodity, Ethereum, there's still some question. Is it a security? Is it a commodity? And I think until that's resolved, it cannot be look at exactly like the bitcoin product, in terms of how do you structure and ETF around it,\" Bill Tai, chairperson of Aktai, told CNBC in an interview at the Crypto Finance Conference in St. Moritz. Tai said that approving an ETH ETF is \"not as clear cut\" as was the case of bitcoin. \"I do think that it's not out of the range of possibility, but there are additional factors to consider around that one because of its classification,\" Tai said. Securities and commodities are regulated under different laws and by different agencies.\n\nWill an ETH ETF happen this year?\n\nCommentators are split on when an ETH ETF may come to the market. Some, like Antoni Trenchev, co-founder of cryptocurrency exchange Nexo, think it will happen this year. \"I'd watch what the SEC does and not what it says, because it wasn't long ago that the prospect of a spot Bitcoin ETF seemed like a distant dream. Things move very fast in crypto and investors are front-running what they believe to be the next big spot ETF approval,\" Trenchev told CNBC by email. \"You'd have to say now that bitcoin has knocked down the door it's only a matter of when not if others will follow — most likely in 2024 — and ETH is definitely the leader of the pack.\" Christopher Giancarlo, co-founder of the digital dollar project and former chair of the U.S. Commodity Futures Trading Commission, oversaw the introduction of bitcoin futures in 2017. He said that, in his experience at the regulator, the approval of one product opens the doors for others. \"Once we greenlighted bitcoin futures, there as a tremendous movement in the CFTC jurisdiction area for greenlighting ethereum futures and that did come 18 months later,\" Giancarlo told CNBC on Thursday. He added that he would be \"shocked\" if there weren't growing demand for an ether ETF. \"The SEC's going to have deal with the growing demand for that product,\" Giancarlo added. Others are a little more skeptical that the SEC could approve an ETH ETF in the short term.\n\nwatch now"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxNLTlRdmgwbUVsWml1MGctWDdPMXQ0czFRR3c2REs3b3IxVUpjM1BfdkhGSmhHcHBsRVJwREtpTVFWS2hyR2hVXy1INFpEbmE3NDNPcUhJTHFWN3gyWmpQbUZKWjBUZEU4SE9FX1lJM012czFNOTFWdGFwRHJWRWJPLUtLZWtSYS1zRTYybTNPZnRVUk5lMEhXa0JuemF4VnhXSUhjR9IBqgFBVV95cUxPX2tYNUxBNlJOTFRyTmZ4bHlRM3NMV2gwUHJKTUtOU2ZhajAxLV9OaUg4bTZhVERMZG9kU203R1M3NG5wenVJTTJFaXZoa3N4R3ViVW1TbjFVTm00U0xQMGZHWGJiUmFtTU45dWNkdjZEWW5rTjRsQUVpSTNPbUpMeHRVZW80eGw4ZXAwTHNrV3pKaWRMSVJFMXhIQk5mMkZhTWdoSWxMX3Ytdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Ether prices spike on hopes of an ETF — but the SEC signals that's less clear cut than bitcoin - CNBC",
        "content": "In this article BTC.CM=\n\nETH.BF= Follow your favorite stocks CREATE FREE ACCOUNT\n\nwatch now\n\nSt. Moritz, SWITZERLAND — U.S. Securities and Exchange Chair Gary Gensler fired warning shots to the crypto industry, casting doubt over whether digital coin ether would follow next in the footsteps of bitcoin to receive approval for an exchange-traded fund. After the bitcoin ETF approval, prices for ether — the token linked with Ethereum — spiked to their highest level since May 2022. That was because investors are betting on an ether — or ETH — ETF to be rubberstamped by the SEC next. The agency is due to give decisions on spot ETH ETF applications beginning in May. BlackRock, Invesco, Ark and VanEck are among the firms in line for approval, as well as Grayscale.\n\nThe SEC has long been an opponent of cryptocurrencies, and its bitcoin ETF approval in no way changed its stance in a big way. After the ETF decision, Gensler issued a statement in which he called bitcoin \"speculative\" and said it could be used for \"illicit\" purposes. One comment poured cold water over hopes of an ETH ETF. \"Importantly, today's Commission action is cabined to ETPs holding one non-security commodity, bitcoin. It should in no way signal the Commission's willingness to approve listing standards for crypto asset securities,\" Gensler said Wednesday after the SEC decision on the ETFs.\n\nCrypto as commodities or securities?\n\nA long-running debate in the U.S. is over whether cryptocurrencies are classified as securities or as commodities. Key to Gensler's comments was his reference that bitcoin's status as a \"non-security commodity\" was one of the reasons why the SEC was comfortable approving the ETF. Gensler made clear that \"the vast majority of crypto assets are investment contracts and thus subject to the federal securities laws,\" in the SEC's view. This complicates matters for an ETH ETF. \"One distinction which I think people have to look at which is that bitcoin clearly has been bucketed as a commodity, Ethereum, there's still some question. Is it a security? Is it a commodity? And I think until that's resolved, it cannot be look at exactly like the bitcoin product, in terms of how do you structure and ETF around it,\" Bill Tai, chairperson of Aktai, told CNBC in an interview at the Crypto Finance Conference in St. Moritz. Tai said that approving an ETH ETF is \"not as clear cut\" as was the case of bitcoin. \"I do think that it's not out of the range of possibility, but there are additional factors to consider around that one because of its classification,\" Tai said. Securities and commodities are regulated under different laws and by different agencies.\n\nWill an ETH ETF happen this year?\n\nCommentators are split on when an ETH ETF may come to the market. Some, like Antoni Trenchev, co-founder of cryptocurrency exchange Nexo, think it will happen this year. \"I'd watch what the SEC does and not what it says, because it wasn't long ago that the prospect of a spot Bitcoin ETF seemed like a distant dream. Things move very fast in crypto and investors are front-running what they believe to be the next big spot ETF approval,\" Trenchev told CNBC by email. \"You'd have to say now that bitcoin has knocked down the door it's only a matter of when not if others will follow — most likely in 2024 — and ETH is definitely the leader of the pack.\" Christopher Giancarlo, co-founder of the digital dollar project and former chair of the U.S. Commodity Futures Trading Commission, oversaw the introduction of bitcoin futures in 2017. He said that, in his experience at the regulator, the approval of one product opens the doors for others. \"Once we greenlighted bitcoin futures, there as a tremendous movement in the CFTC jurisdiction area for greenlighting ethereum futures and that did come 18 months later,\" Giancarlo told CNBC on Thursday. He added that he would be \"shocked\" if there weren't growing demand for an ether ETF. \"The SEC's going to have deal with the growing demand for that product,\" Giancarlo added. Others are a little more skeptical that the SEC could approve an ETH ETF in the short term.\n\nwatch now"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxOS0ttOXV3cUNSNk1EWU81c3RiNGlFVlhObkNvUE5IdXE3WVBUVUwxNmkzakswNklQSDEyZ3Q3dnZCOXN2cVNZN0xONGwwekxDMjdVcVFDNzB6TFJaci1OZHN3VXhiODJBZWwwMERVQlhDelR0bHhNRS00aEdOX3FtNzIwcHRqTENGeHExeUFsc0tpTENfTi1uQg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Should You Buy Ethereum While It's Still Below $2,500? - The Motley Fool",
        "content": "There are three different catalysts that have the potential to send Ethereum higher in 2024.\n\nAmid the current crypto market rally led by Bitcoin, there's one crypto that seems to be getting completely overlooked: Ethereum (ETH 0.21%). That's somewhat surprising, given that Ethereum is the world's second-largest cryptocurrency, with an enormous $290 billion market cap.\n\nHowever, the hype around a spot Bitcoin exchange-traded fund (ETF) has focused investor attention squarely on Bitcoin. At the same time, a number of direct Ethereum rivals skyrocketed to triple-digit percentage gains last year, and have become the new darlings of crypto investors looking for maximum upside. But there are several reasons Ethereum might be undervalued at its current price of about $2,400.\n\nEthereum vs. the wannabe Ethereums\n\nAt the end of 2022, Ethereum was the talk of the crypto industry. It had just pulled off The Merge, which fundamentally transformed its blockchain to make it faster, cheaper, easier to use, and much more energy efficient. The hype around Ethereum grew to the point where some investors even thought that Ethereum might eventually surpass Bitcoin in terms of market cap.\n\nBut then came 2023. All of a sudden, rival blockchains like Solana started gaining traction with investors. At one point, Solana was up more than 1,000% for the year. Avalanche, another Ethereum rival, was up nearly 200% for the year. By way of comparison, Ethereum was up 90%, and seemed to be losing the attention of investors.\n\nSo the big question is whether Ethereum is still best-in-class. If you think that the so-called Ethereum killers are just a bunch of Ethereum wannabes with no long-term staying power, then Ethereum could be highly undervalued at its current price. But if you think that Ethereum's long reign as the top Layer-1 blockchain network in the world is coming to an end, then it's a completely different story.\n\nA spot Ethereum ETF incoming?\n\nRight now, the imminent arrival of the first spot Bitcoin exchange-traded fund (ETF) for the U.S. market is getting all the headlines. But, according to a growing number of crypto investors, a spot Ethereum ETF could be coming soon. And that means that Ethereum could soon get the same type of boost Bitcoin is getting right now.\n\nCertainly, the underlying logic makes sense. Wall Street is looking for more reliable ways to invest in crypto, and has apparently determined that the ETF investment product is the best way to achieve this. Once it can show that a spot Bitcoin ETF is successful, then it's time to crank up this formula for every other major cryptocurrency.\n\nGiven Ethereum's market heft -- it now accounts for about 17% of the market value of the entire crypto market, second only to Bitcoin -- it would only make sense that Ethereum would be next in line for a spot ETF. And, indeed, there is already an application in the works for just such a product. In September, Cathie Wood's Ark Invest filed for a spot Ethereum ETF. If the Securities and Exchange Commission (SEC) decides to approve this (admittedly, a big \"if\"), it could result in billions of dollars flowing into Ethereum, pushing up its price.\n\nA sexy new upgrade\n\nFinally, there's the matter of Ethereum's next big upgrade. Ethereum recently published its strategic roadmap for 2024, and one item on the roadmap that caught the attention of investors was something called EIP-4844 (\"Ethereum Improvement Proposal 4844\"). Basically, this is a proposed technical change that would enable the processing of transactions on the Ethereum blockchain to become much faster and more efficient.\n\nI know, I know. You're probably rolling your eyes right now. What a bunch of blockchain babble, right? But consider that EIP-4844 got J.P. Morgan really excited. In a research note to clients, JPMorgan specifically referred to EIP-4844 as a key reason it thinks Ethereum could outperform Bitcoin in 2024. That's because this major technical change would make it theoretically possible for the Ethereum blockchain to handle 100,000 transactions per second, up from about a dozen or so now. With that type of speed, Ethereum would basically be unstoppable.\n\nHow much higher can Ethereum go?\n\nFirst and foremost, Ethereum needs to convince investors that it is still the preeminent Layer-1 blockchain network. So keep an eye on how Ethereum deals with the growing threat from the likes of Solana. As long as investors buy into the idea that Solana is a faster and more cost-efficient version of Ethereum, it's hard to see Ethereum skyrocketing in price.\n\nWith that in mind, it's certainly possible to find a number of bullish Ethereum price predictions for 2024. Some crypto traders think that Ethereum could double, triple, or even quadruple in value. I may not be as bullish on Ethereum, but I'm certainly open to the idea that Ethereum could surprise a lot of people in 2024."
    }
]