[
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMi0AFBVV95cUxPbHY0eDdJYXJ4b3I0M3Y5VVVpRzNIUGE1QWxzaTUtSDlVSzlPY0RoSThFaXAtekMxNElxdEREemhlMTlWVl9QbVktU1F5c1dnS3dFeWxtbVRFTFdMREJ6czZzeDUwNEowNVB0UHp5YzZkUW1INGpCcS1tZzdpVGNHcHBGVGNMWEtyMy1vVjJuZGhOWnU3NW9jdTJHQ1hsVnhsSWZ4QllCTDRhcHNTQzVHSzRERnJMR3VLWmZsMFJxTktZZXYzbHBDWWVuT2V2MEZq0gHWAUFVX3lxTE9Wajl0cmxXWlRLdDRtcHhTRThPYjNzYm5rb1dyUG15SDV3M1lKcDM1T01KNWNhTFVsZk5FTjd4b3BnSlBCemNobEx1b1NHY3JkQ3dVUkhNNzZKTUtZS3NGd3ZwaTBoczFzWUctYVM3RUMteXdyRlNrRFE0ci1nYVNkc1NwakVJanBNSE9OSnFzdURLajhRaGUyTTF2VVFhR1JqS1NqT3VfdmxlZmYyejZxYVlnb2RDM2dSeWlxeTRFSVFJbkc2Q0NwbWNGOXQwbmFQX2N3TUE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "XRP Ledger Now Closer Than Ever To Ethereum Compatibility As Second Audit Nears Completion: Developers - The Daily Hodl",
        "content": "The XRP Ledger (XRPL) is almost ready for the launch of its much anticipated Ethereum Virtual Machine (EVM) compatible sidechain, according to developers working on the project.\n\nThe project aims to allow Ethereum (ETH) developers, who are used to Solidity, the main programming language for writing smart contracts on Ethereum, to access and build on the XRPL network.\n\nDevelopment firm Peersyst Technologies says on the social media platform X that the new sidechain is waiting for a few components to come together, such as its XChainBridge which is currently being voted on by validators.\n\nThe bridge aims to allow users to automatically bridge any token from the sidechain onto the XRPL.\n\nPeersyst also says that the sidechain, which is “more advanced than ever” and has already been audited by security firm Bishop Fox, is going through a second audit with “a recognized supplier” that will be published soon.\n\nThe firm also says that a new version of blockchain explorer Blockscout is being built for the sidechain.\n\nAccording to Ripple, some highlights of the EVM sidechain include:\n\nSupport for 1000 transactions per second, enabling large loads and throughput.\n\nLow transaction confirmation times, producing a block every 5 seconds.\n\n1 block finalization time; once a block is added to the chain and confirmed, it’s considered final.\n\nFull Ethereum Virtual Machine (EVM) compatibility, enabling you to connect your wallet and interact with or deploy smart contracts written in Solidity.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Natalya Yudina/INelson"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiYkFVX3lxTE1wTXdtQ2k3OUZhaENZTmhTV2tGVFlGbDB5UlB5aWdUeUtnZGFENkdRVEpzQldXbnhkdllBalpteTl5MC1oWnZhQ0NPcjZNQ29MV0JKSGRSRUplc0tEZWx5VHVR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 20:30:31 GMT",
        "title": "BlackRock spot ether ETF decision delayed by SEC - Blockworks",
        "content": "\n\nThe Securities and Exchange Commission delayed a decision on BlackRock’s proposed spot ether ETF.\n\nThe delay pushes any decision on the proposed fund to March 10, according to an official release by the agency.\n\nThe delay was largely expected, with the SEC also delaying decisions on Fidelity’s proposed fund on Jan. 18.\n\nRead more: After spot bitcoin ETF approval, eyes shift to ether fund decision\n\n“Spot Ethereum ETF Delays will continue to happen sporadically over the next few months. Next date that matters is May 23rd,” Bloomberg Intelligence analyst James Seyffart said.\n\nLoading Tweet..\n\nThe decision comes just weeks after the SEC approved nearly a dozen spot bitcoin ETFs. Three commissioners — Hester Peirce, Mark Uyeda and Chair Gary Gensler — voted in favor of the ETFs.\n\nFollowing Grayscale’s legal victory in August, the SEC was compelled to reevaluate its application for a spot bitcoin ETF conversion. Despite this progress, the status of ether ETFs continues to be unclear.\n\nIn an interview on Tuesday, Peirce said that the SEC would “apply precedent” to any decisions on spot ether ETFs. She further noted that the agency doesn’t plan to repeat history and face another court case in order to approve such funds.\n\n“I’m not holding my breath,” Lara Crigger, editor-in-chief at VettaFi previously told Blockworks about ether ETF approval.\n\nHowever, Seyffart previously said that he was more bullish about the future of ether ETFs.\n\n“If [Gensler] goes after ETH, it’s not just going to be a lot of these industry players; it will also be the CFTC that he has to contend with, and it’s just not worth it,” he told On the Margin podcast.The delay was largely expected after the SEC also delayed Fidelity’s proposal\n\nIn his press release following bitcoin ETF approvals, Gensler noted that the decision “should in no way signal the Commission’s willingness to approve listing standards for crypto asset securities.”\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxPTE56Rnp0bUdmbHplZ1pjbjFlWXI3dkh6YXRCd3hSZ3NuWmdhX2RQYnVaWGFZRmdpZ250V1NWQ01CRkhVV194SmhUYnlMLUdrQWM1S0dnT0xvZWsyVjNTcXBQVWVtZ2FCaENwVkxRZ2NrSV9FQmFOQkZsVzNYeFhxdUVYRdIBiwFBVV95cUxPdE9Sckd1bWhkLXN4SVFqXzNQVHdRVDBTRlRzQTlGTzlVaFhkcXVxVkZETTlleERuWmg4TFkxajc3cXBvMHNaYVZmakJsMFppMTQycmt3aUVmazJRcWRiUjVNM0ZIWGkxM3BsUVhROXVDbW9mNGRvWnAwa1EyZ2RMcDVRd3I1UEpHcEY4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Donald Trump’s Ethereum Wallet Holds $1.1M in MAGA Meme Coin - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nYou never know when a huge pile of meme coins can turn into serious cash. Early Dogecoin (DOGE) investors know this well, as do Solana developers who received an airdrop of BONK. And the latest beneficiary of a meme coin glow-up is… former U.S. president Donald Trump?\n\nAn Ethereum wallet that blockchain analytics firm Arkham Intelligence previously tied to Trump, which holds a share of royalties from sales of the official Trump NFT collections, also holds over 579,000 MAGA (TRUMP) tokens. And a recent surge in price for the meme coins means that Trump’s holdings are valued at about $1.1 million as of this writing, as first reported by CoinDesk.\n\nThe TRUMP token has jumped 222% this week alone, per data from CoinGecko, and 689% over the past 14 days. Meme coins are famously volatile and can be driven by social media sentiment and real-world events, and Trump has racked up a pair of 2024 presidential primary wins in recent days as he attempts to win a second term in office.\n\nTrump’s wallet isn’t associated with the creation of the TRUMP token, and in many cases, meme coins inspired by celebrities and public figures aren’t created by the person in question. Instead, they’re often created anonymously in an effort to ride the wave of hype and FOMO.\n\nAD\n\nAD\n\nIn this case, Trump’s wallet was sent the sizable allotment of TRUMP tokens across multiple transactions in August and October 2023, per public blockchain data tracked by Etherscan. At the time of the largest transfer, on August 19, the 469,901 tokens received on that date were collectively worth approximately $5,670, per data from DexScreener.\n\nNow his stash of TRUMP tokens is valued at $1.1 million, making up the largest single holding in the Trump-affiliated wallet. Overall, it holds nearly $2.6 million worth of cryptocurrency as of this writing, including about $755,000 worth of Ethereum (ETH) and $731,000 worth of Wrapped Ethereum (WETH).\n\nIn December, the wallet dumped $2.4 million worth of ETH across a period of three weeks, following the launch of his third collection of NFTs minted on Ethereum scaling network Polygon. Only about half of the latest NFT collection has been minted so far, after the two previous collections both sold out.\n\nThe wallet was tied to Trump by Arkham last year following a financial disclosure notice from the former president, as the wallet receives royalties from the sale of his officially licensed NFTs.\n\nAD\n\nAD"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMi4gFBVV95cUxQbDRlTUk0SENRWEFvMXJQTE56VXRKUzdQZmJNTGpHZ1djdm9VMnhla1JRNmpUZ1JDZER1QTZRb0pkNThqS2JENUJBTWtpY1FYLVpLRjBVWjliQ0VPSDh3b3NuNU1JTkI5VHlkNUNqaXVUV0lrYlZJTXMwZ0tPdTFDVWxvRXpUODBULUlLN2RkTUlPLWx6azdyNEJZUjM5ckdtenB0WWhqaV9IdkllR2xFTzg3eWJzeUtHTmtRVnhkbFlwMUFfN2lzUjQ5VVc0TURhRC16T2pBS1k1aG1QanNsMlZ30gHnAUFVX3lxTFBvMWJwWnRXX1d0cFRwUnRWMWdUVUVwT3RaTFhVbG8zcnUyMUgyOWFod3hRd3hnQlBKSHZKOEwwamJIOEFIRlRyT25DS0NzS0FnYXB2aDd5RS0xS2o4eFJWU1Z0MVlOXzE5UmE4UjlyMTRzdzRaNFQ2VDBRQkNZRjlpd29mRnZfdTZhWDgwQ3N4UE1vV0wwSjMtVGRRUnFIWURtM3FITGF4S2NieHlYR3FnUG9xNlVnOVJ0SnMtb1piZ19vT1N4Wkd1bVJqV2pvbnlWZWZxbVRWQ0ZqT2dVbEVXZ0IybThpQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Analyst Says Ethereum Massive Bullish Reversal Signal Flashing, Updates Forecast on Bitcoin and One Low-Cap Altcoin - The Daily Hodl",
        "content": "A widely followed crypto strategist says that Ethereum (ETH) is giving off a bullish reversal signal when paired against Bitcoin (ETH/BTC).\n\nTrader Michaël van de Poppe tells his 685,700 followers on the social media platform X that he thinks Ethereum will outperform Bitcoin in the coming weeks.\n\nAccording to the analyst, ETH/BTC is flashing a bullish divergence on the weekly chart, indicating that the pair may be gearing up for a move to the upside.\n\n“I personally believe that Ethereum is going to outperform Bitcoin in the upcoming period and it has started since the ETF (exchange-traded fund) approval.\n\nMassive weekly bullish divergence created, but facing crucial resistance at 0.06 BTC ($2,385).\n\nSome more consolidation and then we’re likely going up.”\n\nLooking at the trader’s chart, he seems to think that ETH/BTC will rally to as high as 0.13 BTC ($5,168) sometime this year.\n\nAt time of writing, ETH/BTC is worth 0.05596 BTC ($2,224).\n\nAs for Bitcoin itself, Van de Poppe thinks BTC may fall to around $38,000 before finding support.\n\n“Bitcoin is at the range low and is actually in the area to be accumulated.\n\nAdditionally, this also means that altcoins are in stages to be bought as those 20-40% dips are a great opportunity.”\n\nAt time of writing, Bitcoin is trading for $39,800.\n\nVan de Poppe is also keeping a close watch on the price action of blockchain data-aggregator Covalent (CQT). According to Van de Poppe, CQT is likely headed to its next support level at around $0.15 before igniting a strong surge.\n\n“One of the latest runners has been TIA (Celestia), but competitors are likely to pace up momentum too.\n\nCQT is one of them. Market capitalization is relatively low and correcting, just like the entire market.\n\nThis provides opportunities and I think CQT is one before it reaches $0.42.”\n\nAt time of writing, CQT is trading for $0.214.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/PeachShutterStock/Spyro the Dragon"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMi9AFBVV95cUxNLTU5RERvdkZNbDNCQWdRR2kxdzRWZmZ1LTZleG94VEluVmRneGtNd2RVUXBjdmJGVXNaUnMySlFxeXhOZGhHeU9EcnZlRHJ4UEl1alJOUkY4aUdjNjFzTHczUy11alhCTjM5WS0zUlFrR2FVdmRjUGtNbXVESVU4R0c2TzRralFtS0NoQ1lpbk50REFwWlU2R3BUZ2MyUTJOWS16NUxnVDQ5czlrSXJ2bWhka1JMWFdHY3ZLMWVYR2hvU1dGRV9wclN6ZlM3Uzl2aFdFODhqMUlfOHU1el90a3BQOGVtdWlscWdLQjViQ2J3eDJl0gH6AUFVX3lxTE91bXFVVVJZNmlSUGcwRkVuOTRPQUdNY0o3Ql9yWTdtNFBCMUpaaGpFY3VwdGNuaEZNR21vTkNmZ0J3TG5hQ3lpYVhTLUdqczVKTWc2YWxnRGtReUlkbW4wbDFJc1ZoVjJhWnh5YVBubnVZLVlTaHQ3XzVfYV9LVVJQcTBSc1E2VF9TWEtrclE3TVpPRU9RNXRvbXphU0I5Xy1PUkFqb2ROa2JYU3ZudWN5RjQ2UW5TYUdHb3BKWTBYQTNDemh4SWRPNjZmLXVObGlvbXJpVzFnVUhEMlk1SXdUQTJDY2J3ZG9qUC16SllwWW5ZN20tTWd0dFE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: BTC defies respectable correction, restores above $40,000 - FXStreet",
        "content": "Bitcoin price could make a move north if it closes above the $40,726 support on the three-day timeframe.\n\nEthereum price likely to fall 5% before inflection with uncollected liquidity residing below $2,135.\n\nRipple price looks poised for recovery after a double chance on the FVG.\n\nBitcoin (BTC) price is attempting a recovery barely 24 hours after speculation of a “respectable correction” that was expected to send BTC to the $35,000 range. Ethereum (ETH) price is yet to heed BTC’s cue, while Ripple (XRP) appears to have bottomed out.\n\nAlso Read: Bitcoin price could face short squeeze, analyst says, as FTX sells nearly $1 Billion of Grayscale spot BTC ETF\n\nBitcoin price fights to find a hinge\n\nBitcoin (BTC) price is pulling back after a strong rejection from the $48,000 psychological level. Despite a slippery slope, BTC has managed to reclaim the $40,000 psychological level after a range low of $38,555. BTC holders remain in murky waters until such a time when the price breaks and closes above the $40,726 support on the three-day timeframe.\n\nThe Moving Average Convergence Divergence (MACD) and Awesome Oscillator (AO) indicators remain in positive territory above their respective mean lines, inspiring hope for a possible move north.\n\nIf the bulls have their way, a decisive move above $40,726 would set the pace for Bitcoin price to breach $43,750, or in highly bullish cases, reclaim the $48,000 level. Overly ambitious outcomes could send BTC past the $50,000 psychological level, last tested in December 2021.\n\nBTC/USDT 3-day chart\n\nConversely, with the Relative Strength Index (RSI) below 50 and still southbound, Bitcoin price could extend the fall, potentially slipping past the $37,800 support. Losing this buyer congestion level could send BTC to the $30,000 psychological level.\n\nAlso Read: Bitcoin Price Outlook: Analyst anticipates $35,000 retest for BTC as part of ‘respectable’ correction\n\nEthereum price could extend the fall 5%\n\nEthereum (ETH) price may have an additional 5% in losses coming to test the $2,135 level, amid uncollected sell-side liquidity residing below this critical level. This level is critical for Ether market value, as it continues to hold Ether afloat after a prolonged consolidation since December 3.\n\nIt therefore marks a possible inflection point or another measure of quicksand to invalidate the prevailing bullish outlook.\n\nThe odds support the bearish thesis, suggesting the drop could come as the RSI is showing falling momentum as the MACD is subdued and moving in tandem with the signal line (orange band). The AO histogram bar is flashing red but still in positive territory, reinforcing the assumption that $2,135 will be critical in determining the next directional bias.\n\n\n\nETH/USDT 3-day chart\n\nIf the $2,135 support holds, the Ethereum price could bounce, with the potential to overcome resistance due to the midline of the channel as it targets the $2,800 level, 25% above current levels.\n\nAlso Read: Ethereum ETFs likely to get better deal than their Bitcoin counterparts\n\nRipple price likely to bounce from here\n\nRipple (XRP) price looks ready for recovery after a second retest of the Fair Value Gap (FVG) between $0.4927 and $0.5111. The RSI has tagged 30, suggesting XRP is oversold and a bullish correction may be due. A reentry by the bulls could see the Ripple price reclaim the support offered above $0.5442. In a highly ambitious case, XRP could extend the gains to the $0.5784 level. Beyond this, the next logical target for the XRP price could be the $0.6000 psychological level, standing around 16% above current levels.\n\n\n\nXRP/USDT 1-day chart\n\nOn the flip side, if the XRP price extends the fall below the midline of the FVG at $0.5029, the load-shedding exercise could extend with Ripple price likely to revisit the $0.4746 support, around 8% below current levels.\n\nAlso Read: XRP price could gain nearly 12% as on-chain metrics signal recovery"
    }
]