[
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxPYVdkc200RG85ZloybkJPTU4xa0Y0ZnNTckVTQ2J4eThTTGhZTUVaMzFpR3l1NHVSWE5tV1d2OXpYaG5oN2Vkb2J2VUJ0QW91clBwSFFkT2pTLU5DOUs2bldzZVF0eFo1NmdYTFlmWDBmMkZJanYzdVp1ZlYyT0ZRWWQ2MDdaTFQ1YnpSSjNEeHZNTE8wRDlIX3dlbVlIV1Brb0NncWxHU19rZENKQ3JVVFJ4b1I4dzJreXNMenhicDl2SURzRDlOU0F1bXBPa3JuenkwOER2bGhBdWw3NXUzVmJUc2lvRUFX?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 May 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum, Dogecoin Lose Ground, Cannot Back Up Friday's ETF Flows Inflows: 'Bitcoin Is The Escape Hatch' - Benzinga",
        "content": "Cryptocurrency markets could not continue their uptrend initiated by surprisingly strong ETF data on Friday.\n\nWhat Happened: Major cryptocurrencies are trading lower at the time of writing:\n\nPrices as of 4 p.m. Eastern Time:\n\nCryptocurrency Gains +/- Price Bitcoin BTC/USD -1.18% $63,119.77 Ethereum ETH/USD -2.5% $3,065.67 Solana SOL/USD +4.8% $153.09 Dogecoin DOGE/USD -3.1% $0.1571 Shiba Inu SHIB/USD -3% $0.00002399\n\nNotable Statistics:\n\nIn the past 24 hours, 66,592 traders were liquidated. Total liquidations tallied $189.94 million, with $158.2 million coming in the past 12 hours.\n\nBloomberg analyst Eric Balchunas points out that more than 95% of ETF investors “HOLD-ed” during the “nasty and persistent downturn.”\n\npoints out that more than 95% of ETF investors “HOLD-ed” during the “nasty and persistent downturn.” Total exchanges outflows witnessed a significant drop from $883.03 million to $453.2 million in single day.\n\nMichael Saylor's MicroStrategy holds 214,400 Bitcoin, worth $13.6 billion, which is more than any country.\n\nNotable Developments:\n\nTop Losers:\n\nCryptocurrency Gains +/- Price Bonk BONK/USD -6.4% $0.00002507 Conflux CFX/USD -5.3% $0.2195 Nervos Network CKB/USD -5% $0.01819\n\nAlso Read: Sell Bitcoin In May And Go Away? Here’s How How You Could Have Pocketed A 1,449% Cumulative Return\n\nAnalyst Notes: Heavily followed Bitcoin expert Max Keiser, in his latest tweet, commented how the U.S. is “killing the dollar” through a Bitcoin speculative attack. He wrote that the U.S. economy is no longer competitive and Bitcoin is “the escape hatch.\"\n\nHow the US is killing the $USD via a #Bitcoin speculative attack.\n\n\n\n1. The US economy is no longer competitive, thanks in part to the presence of #Bitcoin — and the gov is filling that hole with money printing.\n\n\n\n2. Money printing is driving up inflation & interest rates;… — Max Keiser (@maxkeiser) May 6, 2024\n\nWhat’s Next: The influence of Bitcoin as an institutional asset class is expected to be thoroughly explored at Benzinga’s upcoming Future of Digital Assets event on Nov. 19.\n\nRead Next: Bitcoin ‘Could Still Have A Correction Down,’ Cautions Lark Davis: ‘Let’s Not Get Ahead Of Ourselves’\n\nThis content was partially produced with the help of AI tools and was reviewed and published by Benzinga editors.\n\nImage created using artificial intelligence with Midjourney."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxPYVdkc200RG85ZloybkJPTU4xa0Y0ZnNTckVTQ2J4eThTTGhZTUVaMzFpR3l1NHVSWE5tV1d2OXpYaG5oN2Vkb2J2VUJ0QW91clBwSFFkT2pTLU5DOUs2bldzZVF0eFo1NmdYTFlmWDBmMkZJanYzdVp1ZlYyT0ZRWWQ2MDdaTFQ1YnpSSjNEeHZNTE8wRDlIX3dlbVlIV1Brb0NncWxHU19rZENKQ3JVVFJ4b1I4dzJreXNMenhicDl2SURzRDlOU0F1bXBPa3JuenkwOER2bGhBdWw3NXUzVmJUc2lvRUFX?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 May 2024 07:00:00 GMT",
        "title": "Bitcoin, Ethereum, Dogecoin Lose Ground, Cannot Back Up Friday's ETF Flows Inflows: 'Bitcoin Is The Escape Hatch' - Benzinga",
        "content": "Cryptocurrency markets could not continue their uptrend initiated by surprisingly strong ETF data on Friday.\n\nWhat Happened: Major cryptocurrencies are trading lower at the time of writing:\n\nPrices as of 4 p.m. Eastern Time:\n\nCryptocurrency Gains +/- Price Bitcoin BTC/USD -1.18% $63,119.77 Ethereum ETH/USD -2.5% $3,065.67 Solana SOL/USD +4.8% $153.09 Dogecoin DOGE/USD -3.1% $0.1571 Shiba Inu SHIB/USD -3% $0.00002399\n\nNotable Statistics:\n\nIn the past 24 hours, 66,592 traders were liquidated. Total liquidations tallied $189.94 million, with $158.2 million coming in the past 12 hours.\n\nBloomberg analyst Eric Balchunas points out that more than 95% of ETF investors “HOLD-ed” during the “nasty and persistent downturn.”\n\npoints out that more than 95% of ETF investors “HOLD-ed” during the “nasty and persistent downturn.” Total exchanges outflows witnessed a significant drop from $883.03 million to $453.2 million in single day.\n\nMichael Saylor's MicroStrategy holds 214,400 Bitcoin, worth $13.6 billion, which is more than any country.\n\nNotable Developments:\n\nTop Losers:\n\nCryptocurrency Gains +/- Price Bonk BONK/USD -6.4% $0.00002507 Conflux CFX/USD -5.3% $0.2195 Nervos Network CKB/USD -5% $0.01819\n\nAlso Read: Sell Bitcoin In May And Go Away? Here’s How How You Could Have Pocketed A 1,449% Cumulative Return\n\nAnalyst Notes: Heavily followed Bitcoin expert Max Keiser, in his latest tweet, commented how the U.S. is “killing the dollar” through a Bitcoin speculative attack. He wrote that the U.S. economy is no longer competitive and Bitcoin is “the escape hatch.\"\n\nHow the US is killing the $USD via a #Bitcoin speculative attack.\n\n\n\n1. The US economy is no longer competitive, thanks in part to the presence of #Bitcoin — and the gov is filling that hole with money printing.\n\n\n\n2. Money printing is driving up inflation & interest rates;… — Max Keiser (@maxkeiser) May 6, 2024\n\nWhat’s Next: The influence of Bitcoin as an institutional asset class is expected to be thoroughly explored at Benzinga’s upcoming Future of Digital Assets event on Nov. 19.\n\nRead Next: Bitcoin ‘Could Still Have A Correction Down,’ Cautions Lark Davis: ‘Let’s Not Get Ahead Of Ourselves’\n\nThis content was partially produced with the help of AI tools and was reviewed and published by Benzinga editors.\n\nImage created using artificial intelligence with Midjourney."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxOc0haWF9fYk04cVZyNTBRRG1OMENKTFpTQU13Y2RVMlNvSi1iaE5BM3JESXZ2dUtHVzM3a2ppYmFudHYxWFU4bG9RaC1vcjhGQXFLbGM5enNfdFRsSXpVa0F6NDNZd1A3UW96MWktbUtYY1hEclJ3RmV0VkUwOEZ5dUVTanFEcURjSVBDbXZB0gGWAUFVX3lxTE45WlRyUjAxblVWbUw1U0lwdXRNVHBxR2JhMU84MTl4MF9EYVhUX0pXWDRfbEw5OWpkVmVLYnd0NElfU0l5Yml3bTExNnN5VmFITlpWYmh3SExiNi03WElaU0dJNlE0Zk5fZ1Zpd0ZscHNoenRCV3FxWHQ1UUZ2bGxyaTV0a2JlNHZBOTdTelBqMzloSW5Fdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 May 2024 07:00:00 GMT",
        "title": "90% of Ethereum, Tron, Solana Stablecoin Transactions Are ‘Inorgranic Activity’, Visa Says - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nNearly all stablecoin transactions are tied to “inorganic activity,” according to payments giant Visa and enterprise blockchain data provider Allium.\n\nThe companies have launched a new data dashboard designed “to remove potential distortions that can arise from inorganic activity and other artificial inflationary practices,” and its adjusted figures reveal upwards of 90% of tracked transactions occur without human involvement.\n\nThe dashboard tracks Tether's eponymous USDT, Circle's USDC, Paxos's USDP, and PayPal's PYUSD. All of them are pegged 1:1 to the U.S. dollar and keep cash or cash-like (U.S. treasury bonds) reserves to back their tokens. Visa doesn't attribute the \"inorganic activity\" to any particular stablecoin, but comparing the adjusted and unadjusted figures casts a stark light on just how infrequently humans are the ones initiating stablecoin payments.\n\nFor example, Visa reports that $51.6 billion worth of stablecoin transactions were processed on Sunday, May 5. That's the unadjusted figure. When the data is adjusted to remove so-called inorganic activity, the number plummets to $4.6 billion.\n\nAD\n\nAD\n\nThe Visa data analysis was conducted, at least in part, in response to a Coin Metrics chart making the rounds on Twitter claiming that stablecoin were catching up with established settlement networks.\n\nIn a blog post last week, Visa's head of crypto, Cuy Sheffield, argued that transactions initiated by smart contracts—without any human explicitly involved—aren't directly comparable to the kind of transactions handled by traditional payment processors.\n\n\"For instance, developers can create automated bot programs that perform activities such as stablecoin arbitrage, liquidity provision, and market making, among others,\" he wrote. \"These activities are vital for sustaining the growing decentralized finance (DeFi) ecosystem. However, the on-chain transactions resulting from interactions with these automated programs don't resemble settlement in the traditional sense.\"\n\nOther notable data points emerged from the analysis. According to Visa, USDC usage has experienced marked growth in the past eight months.\n\nAD\n\nAD\n\nIn September 2023, USDC was used for 23% of all the stablecoin transactions analyzed by Visa. But by the end of the year, that rate of use had more than doubled, surpassing 50% of all stablecoin transactions—as high as 60% in February—every month since December, according to Visa."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxOQl9IVzFBZy1wd0VUWXNsZFBOTml6UTczeHprU1hMWVV6aldPOEkyN0R0SDFNbF9nM2U5T21GMC04bnl3c3hET0gwVEdXYVVkYnhaOU1nOFN0XzVfTE5KUk5ubWdMekMxSnMyREY3UTZrdEVjeFV5aWNIcEl4MVYzWW9TbTg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 May 2024 07:00:00 GMT",
        "title": "Battle for Ethereum ETFs turns messy in the US — what’s next? - crypto.news",
        "content": "Michael Saylor thinks they won’t launch at all, and even some fund issuers think it’s unlikely this year. Meanwhile, other countries are gaining a first-mover advantage.\n\nThe battle to launch exchange-traded funds based on Ethereum’s spot price in the U.S. is heating up — and so far, the journey looks similar to Bitcoin’s long and messy road to approval.\n\nOnce again, the U.S. Securities and Exchange Commission is dragging its heels on offering a definitive answer to the applications already made. A green light matters because it would allow investors to gain exposure to ETH without owning the underlying asset.\n\nGrayscale and Franklin Templeton were both due to receive a response from the SEC in April, but the regulator’s now pushed their deadlines back to June.\n\nFidelity and BlackRock have had similar applications kicked into the long grass as well. VanEck and ARK Invest are due to receive a response later this month, but hopes of approval have been dwindling fast.\n\nWhy? Because there are signs that the regulator believes that Ether is a security, and not a commodity like Bitcoin.\n\nYou might also like: What’s next for global finance?\n\nA growing dispute\n\nBack in June 2023, speaking in front of the House Financial Services Committee, SEC chair Gary Gensler had refused to say whether he believes ETH is a security.\n\nThe lack of a clear answer had spooked the crypto industry — especially considering this contradicted earlier guidance made by his predecessor Jay Clayton.\n\nAnd even earlier than that, around the time of The Merge in September 2022, Gensler had hinted that the staking process may fall under securities rules.\n\nEther’s status matters because it determines which organization holds regulatory oversight in the U.S. — and if it is a security, this could cause big problems for other altcoins.\n\nConsensus recently sued the SEC and leapt to Ethereum’s defense — arguing the commission’s “unlawful power grab threatens to undermine America’s position as a leader of the next generation of the internet.”\n\nThe Case for #Bitcoin on the Corporate Balance Sheet pic.twitter.com/LcZ4V2nqV0 — Michael Saylor⚡️ (@saylor) May 3, 2024\n\nSaylor’s prediction\n\nMicroStrategy’s executive chairman Michael Saylor, a vocal Bitcoin supporter who spearheaded efforts to add hundreds of thousands of BTC to the company’s balance sheet, doesn’t believe that ETFs based on ETH’s spot price will ever see the light of day. Speaking at the annual Bitcoin for Corporations event, he warned:\n\n“Some time this summer, it’ll be very clear to everyone that Ethereum is deemed a cryptoasset security, not a commodity. After that, you’re gonna see that Ethereum, BNB, Solana, Ripple, Cardano — everything down the stack — is just a cryptoasset security unregistered. None of them will ever be wrapped by a spot ETF, none of them will be accepted by Wall Street, none of them will be accepted by mainstream institutional investors as cryptoassets. [Bitcoin] is the one universal, consensus accepted, institutional-grade cryptoasset in the world. There won’t be another one.” Michael Saylor\n\nOf course, you could argue that Saylor was bound to say this — especially considering that he believes BTC is the only cryptocurrency that is technically and ethically sound. Speaking at the Blockchain Economy Istanbul Summit back in July 2022, he had warned that Ether’s continual upgrades “introduce new attack surfaces” that undermine security and reliability.\n\nWhat happens next?\n\nThe bigger challenge now appears to be that there’s a lack of dialog between the SEC and firms hoping to bring an Ether ETF to market. As Barron’s reported last month, applicants aren’t being given “the critical feedback needed to finalize their products.” By contrast, BTC ETF issuers had engaged in a “robust back-and-forth” before their funds started trading.\n\nJan van Eck, whose eponymous investment firm is awaiting a verdict from the SEC, candidly told CNBC in April that he believes the application will “probably be rejected” — while Jean-Marie Mognetti from CoinShares predicted that no approvals will happen in 2024.\n\nWhile the U.S. continues to be paralyzed by regulatory uncertainty, where a lack of clarity on Ether’s status is leaving crypto firms exasperated, other jurisdictions are gaining a first-mover advantage.\n\nAlthough trading volumes were rather tepid on the first day, it remains significant that Hong Kong has now launched an ETH ETF, amid speculation this could one day open the door to investors from mainland China.\n\nAs S&P Global recently noted, funds based on Ether’s spot price have already been approved in Canada, Switzerland, Sweden and Germany — with some offering additional yield by offering staking returns as well.\n\nWith ETFs in other territories now boasting billions of dollars in assets under management, the U.S. risks falling further and further behind."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxPaW1EV0ktLTA0UWNHMzZNUVJGb0s3dnNieW9IWWdNVEQyYi0zYzNzVFk5dHJ4cDZEWGh5X2V1bXdmUlA2MjhwMDg0eWdNRHBHcEZGRF9JeE1xVjJVMVp5VTBmdTdtb1g3ZHltR3RCVlpqR3dWMnZIcE13bFdXV3ppQ3lwQmVYb01pZUg1OU1BdWNqanpyR0lidjJ6Z1ZhYmw5bHNWakkzdTQ3eVdRQllXUGFR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 May 2024 07:00:00 GMT",
        "title": "Entrepreneurs, Journalists, Researchers: The Ethereum Influencers to Follow to Stay Informed! - hackernoon.com",
        "content": "When Ethereum was conceived in 2013, little did we know that it would become the center of attraction and rally competitors in the crypto space.\n\n\n\n\n\nNevertheless, what about gas fees? Scalability? Network? Competition? Nothing can stop an ETH Maxi from vehemently pushing the narrative of the first-ever smart contract blockchain layer.\n\n\n\n\n\nIn every crypto ecosystem, some undeterred believers passionately promote their native token or cryptocurrency to the masses. Nonetheless, the limitation of the currency or the presence of a better alternative; these influencers are the mainstay.\n\n\n\n\n\nFrom building DeFi to establishing the fortress for Web3, to its transition to Proof of Stake, Ethereum has proven to be a blockchain flexible enough to adapt and perhaps the only true competitor to Bitcoin. Every other chain either measures itself against Ethereum, builds on top of it (as Layer 2 solutions), or claims to be the “Ethereum killer”—a classic anecdote for the crypto saga.\n\n\n\n\n\nHowever, ETH thought leaders will always remain steadfast. So if you’re here looking for the most influential Ethereum influencers to follow and keep an eye on their updates, you’ve come to the right article.\n\nWho Are Crypto Influencers?\n\nWhether you call them Maxis, Thought Leaders, or KOLs (Key Opinion Leaders), this group of crypto personalities advocates for everything related to cryptocurrency and the blockchain industry.\n\n\n\n\n\nTheir responsibilities go beyond merely owning a social media account with a substantial number of followers. They actively create bullish posts about digital assets (including tokens and NFTs) within the ecosystem. Additionally, they provide technical analyses of these assets, share updates about cryptocurrencies, and stay informed about other developments in the complex crypto landscape.\n\n\n\n\n\nThese thought leaders possess a wealth of knowledge and experience, allowing them to break down intricate structures into easily digestible educational content for their followers. Their guidance helps navigate the labyrinthine world of blockchain.\n\nWhy Should You Follow Influencers on Ethereum Blockchain?\n\nIf you were left to wander the vast expanse of Ethereum on your own, you’d feel like a lost puppy trying to find your way out of a maze. Keeping track of influencers provides a glimmer of hope.\n\n\n\n\n\nEthereum offers numerous opportunities in DeFi, NFTs, and Web3. It is the foundation for other blockchains that leverage its layer to create more sustainable networks, enhancing the overall user experience. While most ETH enthusiasts are open to sharing knowledge, there are a few narcissistic territorial maxis who might be an exception.\n\nBest Ethereum Influencers to Follow on Social Media in 2024\n\nInfluencers wield their influence primarily on social media platforms. Several platforms exist where these influencers keep their followers and members of the crypto community informed about the cryptocurrency market. These platforms include:\n\n\n\n\n\nTwitter (X)\n\nBitcointalk\n\nReddit\n\nTelegram\n\nDiscord\n\nPodcasts\n\nTikTok\n\nYouTube channels\n\n\n\n\n\nAmong these options, Twitter (X) stands out as the most reliable and easily accessible channel. However, other platforms may require invitations or access, which can be challenging for crypto enthusiasts to obtain. Some platforms also have complex user interfaces that can be difficult to navigate.\n\n\n\n\n\nNow, how do you identify the Twitter accounts of these influencers? Simply go to Twitter, search for “eth,” and scroll through the results.\n\n\n\n\n\nHowever, be cautious—you’ll encounter a maze of Twitter users masquerading as influencers, promoting scam tokens, or building their social media presence for influencer marketing purposes.\n\n\n\n\n\nTo simplify your journey through the bustling Ethereum world, I’ve curated an A-list of the top 10 Ethereum influencers to follow. These thought leaders range from founders and team members to market analysts, opinion leaders, and crypto news headliners. Following them will help you stay informed and engaged.\n\n\n\n\n\nVitalik Buterin (X: @VitalikButerin )\n\nWe’d have to issue an official apology if we didn’t start by acknowledging the brain behind the Ethereum blockchain.\n\nVitalik Buterin is the initiator and co-founder of Ethereum. This Russian-born Canadian programmer began his crypto journey as a writer for Bitcoin Weekly in 2011, earning 5 BTC (approximately $3) per article. Shortly thereafter, he became a co-founder and writer for the groundbreaking cryptocurrency publication, Bitcoin Magazine.\n\nIn 2013, Buterin conceptualized Ethereum—a “decentralized mining network and software development platform rolled into one.” He published a whitepaper outlining this vision. As the idea gained recognition, he collaborated with other co-founders to bring it to life in 2015.\n\nSince then, Vitalik Buterin has been the primary source of news related to Ethereum—covering its developments, updates, events, and the broader ecosystem. If you want to stay informed about Ethereum, following Buterin is like having a substantial slice of the crypto pie.\n\nButerin’s influence extends beyond the Ethereum ecosystem; he’s a force to be reckoned with in the entire crypto industry. He consistently ranks among the top crypto influencers. Keeping up with his updates and interests will undoubtedly keep you well-informed in this dynamic industry.\n\n\n\nHayden Adams (X: @haydenzadams )\n\nUniswap, the largest decentralized cryptocurrency exchange based on Ethereum, is widely regarded as the godfather of modern DEXes. This exchange played a significant role in ushering in the DeFi era and subsequently fueled the 2020 bull run. And who is its founder? Hayden Adams.\n\nAs a Stony Brook University engineering graduate and former Siemens analyst, Adams pursued Vitalik Buterin’s vision of decentralized applications by creating a DEX (decentralized exchange) powered by code-controlled automated market makers. Uniswap has achieved remarkable success, surpassing $2 trillion in trading volume since its inception in 2017. It’s no surprise that regulatory bodies like the SEC are closely scrutinizing its operations for explanations and tax compliance.\n\nAdams swiftly ascended to an influential position within the Ethereum community due to Uniswap’s achievements. He collaborates closely with Buterin and their team.\n\n\n\nJoseph Lubin (X: @ethereumJoseph )\n\nJoseph Lubin is as synonymous with Ethereum as one can be. He co-founded Ethereum, serves as the COO of Swiss-based EthSuisse, and is the founder of ConsenSys—a private blockchain software technology company. ConsenSys actively collaborates with crypto startups and supports the development of decentralized applications (DApps). Their developer quickstart and tutorial series offer excellent learning resources for training and onboarding developers.\n\nAs a Princeton graduate, Lubin has also actively participated in cross-industry groups with a mission to address governance challenges within the crypto world—a commendable endeavor.\n\nIf you’re looking to stay informed about the latest happenings in the crypto and Ethereum space, visiting his page is a wise choice.\n\nChris Dixon (X: @cdixon )\n\nChris Dixon, an American internet entrepreneur, investor, and cryptocurrency advocate, wears many hats in the tech and crypto world. His diverse roles and accomplishments make him a prominent figure:\n\nBackground: Dixon previously worked at eBay, gaining valuable experience in the e-commerce industry.\n\nHis journey extended beyond eBay as he delved into various investments. Midas List Ranking: In 2022, Dixon secured the top spot on the prestigious Midas List , which recognizes the most successful venture capitalists.\n\n, which recognizes the most successful venture capitalists. His knack for identifying promising startups and disruptive technologies contributed to this achievement. Hunch and Andreessen Horowitz: Dixon co-founded Hunch , a platform that provided personalized recommendations based on user preferences.\n\n, a platform that provided personalized recommendations based on user preferences. As a general partner at Andreessen Horowitz, a renowned venture capital firm, he continues to shape the tech landscape. Authorship: Dixon penned the New York Times Bestseller, “Read Write Own”, which likely delves into the intersection of technology, ownership, and innovation. Crypto Enthusiast: His passion extends to the crypto space, where he closely follows developments.\n\nDixon has a soft spot for the two biggest cryptocurrencies: Bitcoin and Ethereum. Stay Updated: If you’re interested in staying informed about the crypto world, following Chris Dixon is a smart move.This American internet entrepreneur, investor, and cryptocurrency advocate has so many titles he could go by.\n\nJoseph Delong (X: @jose phdelong )\n\nLet’s delve into the world of Joseph Delong, a prominent figure in the Ethereum ecosystem and beyond:\n\nEthereum and Sushiswap: Delong has an impressive track record. He was a former team member at Ethereum —a project that needs no introduction in the crypto space.\n\n—a project that needs no introduction in the crypto space. Additionally, he served as the Chief Technology Officer (CTO) at Sushiswap. Sushiswap, a decentralized finance (DeFi) protocol, gained prominence as a fork of Uniswap v2. Astaria: Currently , Joseph Delong holds the position of CTO at Astaria . He assumed this role in January 2022 .\n\n, Joseph Delong holds the position of . He assumed this role in . Astaria is an intriguing project—an NFT lending platform that aims to revolutionize the NFT space by providing lending services. ConsenSys Connection: Before his involvement with Astaria and Sushiswap, Delong worked as a Senior Software Engineer at ConsenSys from October 2018 to October 2020 .\n\nfrom . His contributions extend beyond ConsenSys; he also served as the Chief Architect at 9th Gear Technologies for a brief period from May 2018 to November 2018. Stay Updated: If you want to keep abreast of developments in the Ethereum ecosystem and other cryptocurrencies, following Joseph Delong is a wise choice. Feel free to explore the exciting world of crypto through his updates!\n\nPéter Szilágyi (X: @peter_szilagyi ) Peter Szilágyi is a core software developer and team lead at Ethereum. That alone should be reason enough to follow him. Let’s enhance the information about him: Peter Szilágyi: As a core software developer and team lead at Ethereum, Szilágyi plays a crucial role in shaping the Ethereum ecosystem.\n\nHis contributions extend beyond coding; he actively influences the technical direction and development of Ethereum. Background: Szilágyi studied at Babes-Bolyai University in Cluj-Napoca , Romania. His academic foundation likely contributes to his expertise.\n\nin , Romania. His academic foundation likely contributes to his expertise. During his intern years, he gained practical experience working with other IT companies, further honing his skills. Stay Informed: If you’re interested in staying up-to-date with the technical intricacies of Ethereum and digital currencies within the ecosystem, following Szilágyi is a wise choice. Remember, the crypto world evolves rapidly, and Szilágyi’s insights can keep you informed\n\nTim Beiko (X: @TimBeiko )\n\nTim Beiko, another core team member of Ethereum, leads the core protocol meetings and provides support for Ethereum. These meetings are public and available on GitHub.\n\nAdditionally, he writes about upgrades to the Ethereum protocol. Beiko is one of the major spokespersons for Ethereum, frequently participating in interviews, press events, podcasts, and conferences to share the Ethereum roadmap with the broader community. If you follow Beiko, you’re definitely on the right track\n\nRyan Sean Adams (X: @RyanSAdams )\n\nMedia is essential, and Ryan Sean Adams is at the forefront of crypto media, advocating for transparency and freedom from mainstream media.\n\nAdditionally, Adams is an open finance maximalist and startup financier, actively promoting the message of financial sovereignty to the masses. He co-founded Mythos Capital, a crypto fund and staking provider for stakeholders, as well as Bankless with his co-founder David Hoffman.\n\nIn his efforts to drive a decentralized revolution, Adams aims to onboard billions of people into the world of cryptocurrency. And what better way to achieve this than through social media?\n\nJustin Drake (X: @drakefjustin )\n\nMeet Justin Drake, an Ethereum researcher. He graduated from Cambridge with a degree in Mathematics and later became a Bitcoin entrepreneur. As the founder of Duo Money, a global payment app that harnesses the power of cryptocurrency for value transfers, Drake has been at the forefront of financial innovation.\n\nIn addition to his entrepreneurial ventures, he is a Fellow at Anthemis Group—an asset management platform that invests in and supports pre-seed to growth-stage startups. These startups integrate finance into their products, services, and operations.\n\nCurrently, Justin Drake actively researches technologies for the Ethereum Foundation. By following him and reading his tweets, you can stay up-to-date with the latest news and insights on what Ethereum is building\n\nNick Johnson (X: @nicksdjohnson )\n\nNick Johnson founded the Ethereum Name Service (ENS), a decentralized naming service that allows users to register and manage human-readable names for Ethereum addresses. Many Ethereum influencers use ‘.eth’ in their profiles, and ENS is the origin of this practice.\n\nNick Johnson has a wealth of experience in software development. He started as a graduate of Computer Science from the University of Canterbury. His journey into the crypto world began when he transitioned from being a Software Engineer at Google to becoming a Software Engineer at Ethereum. Eventually, he left Ethereum to focus on building and developing ENS.\n\nIf you’re interested in DAOs and public goods within the Ethereum ecosystem, I recommend keeping an eye on his timeline.\n\n\n\n\n\nOther Crypto Influencers to Check Out\n\nWhile we often consider Ethereum maximalists as the primary sources for ETH updates, the truth is that several other influential figures identify as crypto evangelists.\n\n\n\n\n\nThese individuals ensure that they share everything happening in the crypto space, whether it pertains to BTC, ETH, LTC, or any other significant blockchain, making waves in the financial world.\n\n\n\nBen Armstrong (X: @BenArmstrongsX )\n\nI’m sure we all know that one guy who’s incredibly enthusiastic, and his energy is contagious. In the blockchain space, that person is Armstrong—he’s fully immersed and unwavering.\n\nPopularly known as BitBoy, Ben isn’t just an overzealous crypto fanboy; he has significant experience in the field. His journey has taken him from humble beginnings to success, and even setbacks. But now, he’s making a strong comeback.\n\nBitBoy hosts the BitBoy Crypto Show, where he explores various cryptocurrencies. If you want to stay updated, following him is a great idea!……\n\n\n\nAnthony Pompliano: (X: @APompliano ) Meet Anthony Pompliano, often known as ‘Pomp,’ the crypto world’s equivalent of a household name. His show, ‘The Pomp Podcast,’ boasts thousands of listeners worldwide.\n\nPompliano is an American entrepreneur and investor with a keen interest in finance, technology, and economics. From the comfort of his home, he manages a family office called Pomp Investments. This firm engages in various private investments and stakes across different businesses.\n\nAnthony Pompliano provides valuable insights into crypto market prospects. As a staunch advocate of cryptocurrencies, his page and podcast delve into these topics, along with his personal opinions on finance and technology. Following him is a smart move, but always remember to ‘DYOR’ (Do Your Own Research)!\n\n\n\nAndreas Antonopoulos ( X: @aantonop ) Antonopoulos’ Twitter(X) profile succinctly states, ‘Bitcoin & Open Blockchains.’ This concise description provides clarity.\n\nAndreas M. Antonopoulos, a British-Greek tech entrepreneur and author, has passionately advocated for Bitcoin and cryptocurrencies since 2012.\n\nHe previously served as the Chief Security Officer (CSO) of Blockchain.com, a cryptocurrency financial services company. Additionally, Antonopoulos is the author of six books, including ‘Mastering Ethereum: Building Smart Contracts and dApps.’\n\nHis unwavering commitment to decentralized financial principles is evident through his participation in various summits, and conferences, his YouTube channel, and his Twitter (X) page. Following him will keep you informed about the latest developments in the crypto world.\n\nPros and Cons of Following Ethereum Influencers\n\nIt is not recommended to take every word from an influencer’s tweets on social media or a podcast and digest them hook, line, and sinker. Just like everything else that exists, there are perks and drawbacks.\n\n\n\n\n\nTo better understand their influential materials, you must learn to differentiate what works from what doesn’t.\n\nPros\n\nReliable Sources: These influencers are often the most reliable references to turn to when you encounter random news about Ethereum. They commit themselves to being the avenue through which others stay updated on recent events in the space. Spreading false information would only tarnish their reputation.\n\n\n\n\n\nStay Up to Date: When Bitcoin ETFs were under consideration by the SEC, those following BTC maximalists were continuously kept informed about the proceedings. Ethereum ETFs have also been hinted to arrive soon. Can you guess where you’ll find this information? Exactly—ETH maximalists.\n\n\n\n\n\nReal-Time Information: Influencers provide real-time updates on various aspects: market volatility, trends, legal challenges, crypto-government conflicts, recent launches, upcoming airdrops, and more. No one reports it better than these maximalists.\n\n\n\nDeep Insights and Content on Cryptocurrency: First, Key Opinion Leaders (KOLs) are the go-to sources for news, updates, and events. But beyond that, they analyze these developments and share market sentiments through various mediums such as social media posts, YouTube videos, AMAs (Ask Me Anything), and blogs. KOLs engage in fact-based speculations, discussions, and provide expert opinions.\n\nCons\n\nInformation Overload: Someone needs to tell influencers to cut us some slack. There are too many influencers, each sharing their individual opinions. It’s overwhelming to take in and comprehend all the updates, analyses, and news that come in droves. We have too little time to make sense of it all.\n\n\n\nMisinformation: Having influence doesn’t guarantee that their content is always accurate, especially for those who are not part of the Ethereum team. To avoid this, follow reputable sources like Vitalik and steer clear of influential farmers.\n\n\n\nMarket Influence and Bias: Predictions and analyses by Key Opinion Leaders (KOLs) can sometimes be wrong. KOLs are not supreme beings with the ability to control the market through their thoughts. Instead, they use sentiments to sway their audience. Occasionally, they spread hate or bias toward other opinions or chains, subtly influencing their followers.\n\n\n\n**False Hope:**Being bullish is fine, but delivering doses of ‘hopium’ to susceptible followers who hang on your every word goes against crypto principles. However, for many ETH maximalists, the hype should remain alive.\n\n\n\nEnd Words\n\nEthereum is the second-largest blockchain after Bitcoin and the most actively engaged blockchain in the history of distributed ledgers. This prominence places the pioneer smart contract network at the center of numerous discussions within the crypto space.\n\n\n\n\n\nAddressing criticisms, making comparisons, and staying updated all require experts who can readily highlight and clarify complex topics. Their insights help followers make informed decisions and take enlightened steps.\n\n\n\n\n\nHowever, it’s crucial to recognize that the term ‘influencer’ doesn’t imply blindly following their investment advice. While influencers play a valuable role, you should never let them entirely dictate your crypto investment decisions. There will always be digital currencies, NFTs to explore, bridges to test, and DeFi projects to consider. But don’t rush into decisions solely because an influencer recommends it. Instead, make your own choices, build a solid rationale, and remember the crypto mantra: DYOR (Do Your Own Research).\n\nFAQs\n\nWho are the best ETH influencers? Vitalik Buterin and every other dedicated Ethereum supporter on social media have everyone’s interests at heart. They are undoubtedly crypto influencers too.\n\n\n\nWill $ETH supersede $BTC? Crypto remains uncertain, leaving room for possibilities. However, $BTC stands strong as the pioneer of crypto, making it challenging for other cryptocurrencies to surpass it.\n\nFrom every perspective, Ethereum’s goal is not to replace Bitcoin but to serve as the decentralized open-source smart contract layer for applications to build upon.\n\nThere’s no direct competition between $BTC and $ETH—only mutual respect (except for the maximalists who might think otherwise).\n\n\n\nWhat impact will the launch of more “Ethereum Killers” have on Ethereum? From my viewpoint, it won’t have a significant impact. Ethereum will continue to thrive. The crypto space operates as an open-source collaborative environment.\n\nEthereum will persistently evolve, while other blockchains may create forks. In the end, survival will favor those who adapt.\n\n\n\nWill the growth of other cryptocurrencies affect the future of the Ethereum Blockchain? Ethereum proudly remains the mother of smart contracts. Most ecosystems either build on it, adopt its architecture, or strive to provide better scalability. Therefore, the growth of these projects cannot undermine ETH, as it plays a crucial role in the crypto industry.\n\n\n\n"
    }
]