[
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxQVGJsSmxiaHNETXk3SzVVQTFlV2t0dTlXTkpWOGRkMG1XRlNGV3BDdklTSU53YU5xZXNqSU9oR05UdjV3OGFwUXp0ZEpMZnJoa19HakVrREZjTmNCSDAzM3A2eUFBaHNjeUdUeUlMQjEyajVSenV4bUlmRDM4UTZnWVRUUzlReFo4eVEzeXF4bVE5ekVaY2NIWjIyb3Q5a2I0b09EVUtpWVo5QkY2aE5Halp2dkVMZXF4TDdjZNIBwgFBVV95cUxQVFpXSXh0emZJNHBneVNZcVdseXkzZjFZeWlFeXdiZWZhV1pnWnlLRHFBTllPSXUyQVNfZkdqdmtCVU1kSjlCRWZiQXh0QlpBRU5VR1FQdm96c3ZYelQwV1REdUFCWDFERjdzOW5iSks4bWxtX21UTEQ0aEc1ZDFMekloSmc5bldCRjZtZmpjOGtVMVg2a1lUaF9qcE4za2lrTEpKUWJRd3hhSFV4MWt4THJRdHJhaVNaZUxNX2Y2MGVaUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Gearing Up for More Than 35% Surge, According to Top Analyst – Here’s the Timeline - The Daily Hodl",
        "content": "A closely followed crypto analyst says Ethereum (ETH) is setting up for a sizeable rally after successfully completing a long consolidation phase.\n\nThe pseudonymous crypto analyst known as Pentoshi tells his 742,000 followers on the social media platform X that he believes Ethereum is on its way to the $3,500 range, the upper level of a range he sees ETH trading in.\n\n“ETH.\n\nWent to the mid-range of the new range we are in.\n\nYear-long consolidation into mid.\n\nExpect the higher range sometime Q1 early Q2.”\n\nAt time of writing, ETH is trading for $2,511.\n\nPentoshi is also keeping an eye on ETH’s biggest rival, Solana (SOL). According to the popular analyst, SOL, which had a dramatic run in the latter part of 2023, needs to consolidate for some time before making any new moves.\n\nHe pinpoints the $70 level as potential support for Solana.\n\n“SOL.\n\nThink this is just going to take time to play out. So far following squiggly [line]. While there is support just below here where it bounced from, think there has to be at least 30 days of consolidation somewhere. Even if we don’t see that $70 area.”\n\nSOL is trading for $95.49 at time of writing.\n\nLooking at Bitcoin, Pentoshi says that the recent approval of the spot BTC exchange-traded funds (ETFs) is a huge win for the crypto markets.\n\n“Day one volume record already broken on the BTC ETF. What [does it] mean?\n\nAnd what does it mean for other digital currencies?\n\nWill give a few hints:\n\n1. Others in line for ETF\n\n2. This is a great advertisement for the space. A ton of new eyes and entrants will come as a result\n\n3. You aren’t bullish enough long term.”\n\nBitcoin is trading at $42,625 at time of writing.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMivAFBVV95cUxOczdtMmRLMGtsdXdEU01KVk1IRnVYbFhmd2lLSVhUUEhEZnF1bE9wM0JPeHZIQmI4elpON204LURveXJPYngwazRrckI2cUpQdmhpTHlNYXY0Z1dydl9hbHIzYUNaYlBpNXQ2UGY3VU5CNHpfYS1mb2c4emJVNE03RHZ2OWNTMFh1LXNqa3libTZZcTNWNjFxcWJORWVob0Z2ckdseDRreUMwRVJoRm5TRmpGVEZMc1dYeFNTQdIBwgFBVV95cUxPYWNCZlAwZldVRE54ZEVaX19wU3pDd2pIanI2eC1aN0xwRXZ6cm1VYVBtaDRpcG42N1pjQzdqSFhLd1BqR2hjYjJRQnFCV1FsNnRRLWpkSDZ5Y2VDTDdtNExJWTBJajdGWVl5TjlLUDdTRHZzRWZQUzhVZV9YMkxaMEgwdnp4MzFyUnlxczhRN0hMcklYZDd1UjNaZG1ZN0h4ZzdmcER0NmNCZ0RhamI4aXhkQ1ZXaUpoc2FIZW1VMlhJUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Rival Records Nearly 2,000% Growth in Unique Active Wallets Last Year: DappRadar - The Daily Hodl",
        "content": "Crypto intelligence platform DappRadar says user activity on one Ethereum (ETH) challenger exploded in 2023 as decentralized applications (DApps) saw remarkable growth during the period.\n\nAccording to DappRadar’s yearly industry report, smart contract platform Near (NEAR) recorded 302,000 new unique active wallets (UAWs) last year, marking a year-over-year (YoY) increase of 1,902%, the most out of any chain.\n\nEnterprise-grade blockchain Klaytn (KLAY) and layer-2 scaling solution Arbitrum (ARB) rank next to Near as the networks with the highest UAW increase gain with 73,000 new UAWs, representing a 1,099% increase, and 88,000 UAWs, a 624% increase, respectively.\n\n“In terms of chain performance, Near, Klaytn, and Arbitrum were the top gainers in UAW percentage increase. They had also a good performance looking with their token, as Near had an increase of 200% since the beginning of the year, Klaytn a 20% and Arbitrum a 32% increase since its launch in March 2023.”\n\nConversely, DappRadar says Ethereum rival Solana (SOL) recorded only 65,000 new UAWs in 2023, a 76% drop on a year-over-year basis. Web3-focused blockchain Hive (HIVE) saw 77,000 new UAWs, representing a 68% drop, as per the firm.\n\n“Solana experienced a rough start of the year, influenced by its association with the FTX fallout. However, the Solana ecosystem saw an impressive recovery during the last months of 2023. Hive, primarily hosting the trading card game Splinterlands, also had a difficult year, missing financial targets and reporting significant losses.”\n\nOverall, DappRadar says the DApp industry had a good run in 2023 with a 124% YoY increase in UAWs and ending the year with an average of 4.2 million daily UAWs.\n\n“In 2023, the DApp industry surpassed all expectations, and reinforced the notion that it’s an enduring and evolving part of the global financial and technological landscape.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxOTy1FUlhUbEoyei0tOXpHc3cwRmVyb0IwcUNhcXlldGpUQmJyOHQxcUhvNTVfU0dkNGdmWDZmYXItLTM0cFRLUHRDX1ZuYXV4alc3VkNRQ3VCUUNYUHdYMnhTSnBsNXZ3TndMcUxJR1B2dVg2WUN3Nl92b3ZOVG1CVUl4Yk5qdENRRkNSMm4wMVdkLUhRMTlpbWRYc3puVzdwZmfSAacBQVVfeXFMTmhBZXZvdWJpa0U2NTJoYXZxZkpfTGRsV0loLTFRQURNanJRVGFLN1d0a3R6MkMyNDZrYTdIUnJ5VUJxT2F5dl9fay1GdGpoR0Rpd2w5NW5IUm45aFRiMzZnRkdsNmdQUUJUUWkzM2dvS3lOTnZRUUtFcVBiLUo3Q2VtemhpdFMzaE5sN0RLNEkzWEttcjFqUmFOYVBNelBFRkNfUnJBR1E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jan 2024 08:00:00 GMT",
        "title": "Terra Luna Classic Commits To Introduce EVM Support, LUNC Price Rebounds? - CoinGape",
        "content": "The Terra Luna Classic community looks beyond the typical chain developments to a more diverse approach by enabling Ethereum virtual machine (EVM) support on the chain. It will help the community-led Terra Classic chain to become compliant with new and emerging technologies, introducing many advantages.\n\nInterestingly, the EVM support will allow Terra Luna Classic to use the Solidity programming language, mostly used on EVM chains.\n\nadvertisement\n\nTerra Luna Classic EVM Functionality\n\nProposal 11978 “Investigate EVM Functionality” is under voting on the Station wallet and has already surpassed the pass threshold. The EVM will expand Terra Luna Classic use cases by bringing the programmability and composability of the EVM and sovereignty and interoperability of the Cosmos.\n\nThe proposal has received over 62% votes in favor, with 29 validators supporting the proposal. The deadline for voting is January 17.\n\n“Terra Classic will have the potential to become compliant with new and emerging technologies like Optimistic transactions, where Terra Classic does not need to send direct security information on each transaction, and Rollups, which allow significantly more transactions to be processed at once, dramatically increasing the processing power of Terra Classic,” said ClanMudhorn of Terrarium validator.\n\nEVM support on Terra Classic presents a strategic move toward interoperability and adoption of widely-used blockchain development standards. This can attract projects such as Curve DAO, Uniswap, ChainLink, Hedera, and others.\n\nMoreover, the limitations of inter-blockchain communication (IBC) on EVM will provide added advantage to Terra Luna Classic. The proposal outlines potential approaches, emphasizing a cautious and governance-driven decision-making process.\n\nRead More: Judge Denies Terra & Do Kwon’s Request For Reconsidering Court Ruling\n\nLUNC and USTC Price Momentum Fades\n\nLUNC price jumps over 5% in the last 24 hours, with the price currently trading at $0.000127. The 24-hour high and low are $0.000118 and $0.000126, respectively. Moreover, trading volume has increased by 40% in the last 24 hours, indicating a rise in interest among traders.\n\nMeanwhile, USTC price trades at $0.027, up over 10% in a week. The 24-hour high and low are $0.0266 and $0.0286, respectively.\n\nAlso Read:\n\nVarinder Singh Varinder has 10 years of experience in the Fintech sector, with over 5 years dedicated to blockchain, crypto, and Web3 developments. Being a technology enthusiast and analytical thinker, he has shared his knowledge of disruptive technologies in over 5000+ news, articles, and papers. With CoinGape Media, Varinder believes in the huge potential of these innovative future technologies. He is currently covering all the latest updates and developments in the crypto industry.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiX0FVX3lxTE9xR0hzVzB5aWdkcWlVTmFnQV9wM0UtdHZxZ3FPNnFlVTJFMjZ6Zjk3N2xYSTcyTjFLUUZBLTRwN2NyRGUxd2trQWNxMmNTc3lhM1cyeUkweGhfcVcwbThV?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jan 2024 08:00:00 GMT",
        "title": "Solana takes break from eating Ethereum’s lunch — for now - Blockworks",
        "content": "Finding the next big thing is the secret sauce for many investors, whether it’s startups, stocks, bonds, commodities or crypto.\n\nObsession with discovering “the next Ethereum” — or even an “Ethereum killer” — then seems only natural.\n\nEthereum’s smart contracts set the industry standard nearly a decade ago and have since inspired dozens, if not hundreds or even thousands, of rival networks.\n\nSolana is generally considered Ethereum’s primary competitor right now. Comparing market values shows nothing has really come close to eclipsing Ethereum. Yet.\n\nIn fact, BNB Chain (BNB) and Cardano (ADA) have come the closest over the past three years.\n\nThe market cap of BNB in April 2021 and late 2022 was about 33% of ether’s (ETH).\n\nADA had up to 25% of ether’s cap during the last bull market.\n\nSolana (SOL) set a new record relative to ether last month with 19%.\n\nRead more: It’s a Solanaissance: These 5 charts will cure the Ethereum vibecession\n\nPrice ratios — dividing one assets’ price by another and comparing over time — are commonly used to gauge the relative strength of cryptocurrencies.\n\nAnalyzing price alone is problematic due to inflation and deflation rates of many top cryptocurrencies.\n\nSolana’s market cap ratio against ether has retraced by a quarter since Christmas, now about 14%\n\nTake ATOM, the native asset for multichain ecosystem Cosmos. Over the past year, ATOM’s circulating supply has swelled by a third and its token price has slipped by 20%, according to data from The Tie.\n\nMeanwhile, ATOM’s market cap has grown 15%. Price alone implies ATOM is struggling, when it could be the market is simply absorbing fresh supply — and then some.\n\nSolana, on the other hand, has almost 17% more circulating supply than this time last year. Its price has quadrupled across that period, while its market cap has nearly quintupled. Comparing only SOL’s price would leave a chunk of the asset’s growth unaccounted for.\n\nMuch of Solana’s outsized growth over the past year can be attributed to its gradual recovery since the FTX debacle.\n\nRead more: Rebuilding trust: Solana’s roadmap after a challenging year\n\nDisgraced FTX co-founder Sam Bankman-Fried was a significant investor in Solana and its ecosystem, leading SOL to collapse by up to 65% directly following FTX’s implosion in late 2022. Ether fell less than 30% and completely recovered in about two months.\n\nMarket caps are just one metric by which to compare cryptocurrencies and blockchains. Total value locked, unique addresses, on-chain volumes, developer activity, fee revenues and transaction counts are among others. Each has its flaws.\n\nIn any case, Ethereum isn’t exactly threatened right now. But going by market cap growth alone, Solana is well on track to become Ethereum’s primary competitor over BNB.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiX0FVX3lxTE9xR0hzVzB5aWdkcWlVTmFnQV9wM0UtdHZxZ3FPNnFlVTJFMjZ6Zjk3N2xYSTcyTjFLUUZBLTRwN2NyRGUxd2trQWNxMmNTc3lhM1cyeUkweGhfcVcwbThV?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jan 2024 08:00:00 GMT",
        "title": "Solana takes break from eating Ethereum’s lunch — for now - Blockworks",
        "content": "Finding the next big thing is the secret sauce for many investors, whether it’s startups, stocks, bonds, commodities or crypto.\n\nObsession with discovering “the next Ethereum” — or even an “Ethereum killer” — then seems only natural.\n\nEthereum’s smart contracts set the industry standard nearly a decade ago and have since inspired dozens, if not hundreds or even thousands, of rival networks.\n\nSolana is generally considered Ethereum’s primary competitor right now. Comparing market values shows nothing has really come close to eclipsing Ethereum. Yet.\n\nIn fact, BNB Chain (BNB) and Cardano (ADA) have come the closest over the past three years.\n\nThe market cap of BNB in April 2021 and late 2022 was about 33% of ether’s (ETH).\n\nADA had up to 25% of ether’s cap during the last bull market.\n\nSolana (SOL) set a new record relative to ether last month with 19%.\n\nRead more: It’s a Solanaissance: These 5 charts will cure the Ethereum vibecession\n\nPrice ratios — dividing one assets’ price by another and comparing over time — are commonly used to gauge the relative strength of cryptocurrencies.\n\nAnalyzing price alone is problematic due to inflation and deflation rates of many top cryptocurrencies.\n\nSolana’s market cap ratio against ether has retraced by a quarter since Christmas, now about 14%\n\nTake ATOM, the native asset for multichain ecosystem Cosmos. Over the past year, ATOM’s circulating supply has swelled by a third and its token price has slipped by 20%, according to data from The Tie.\n\nMeanwhile, ATOM’s market cap has grown 15%. Price alone implies ATOM is struggling, when it could be the market is simply absorbing fresh supply — and then some.\n\nSolana, on the other hand, has almost 17% more circulating supply than this time last year. Its price has quadrupled across that period, while its market cap has nearly quintupled. Comparing only SOL’s price would leave a chunk of the asset’s growth unaccounted for.\n\nMuch of Solana’s outsized growth over the past year can be attributed to its gradual recovery since the FTX debacle.\n\nRead more: Rebuilding trust: Solana’s roadmap after a challenging year\n\nDisgraced FTX co-founder Sam Bankman-Fried was a significant investor in Solana and its ecosystem, leading SOL to collapse by up to 65% directly following FTX’s implosion in late 2022. Ether fell less than 30% and completely recovered in about two months.\n\nMarket caps are just one metric by which to compare cryptocurrencies and blockchains. Total value locked, unique addresses, on-chain volumes, developer activity, fee revenues and transaction counts are among others. Each has its flaws.\n\nIn any case, Ethereum isn’t exactly threatened right now. But going by market cap growth alone, Solana is well on track to become Ethereum’s primary competitor over BNB.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    }
]