[
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxPaFJGb1E1N21TWllQTzVmZkpraWpjOHBFT0ZiLU1WSVptdGVvRjgzTE5NMlRwWHo4bU9ueTk1bDhfVTFISVFoODc4VWxGTjNWYzhCZFo3NzNNb0Z6X18yTXRUU0h1SVRVc2lxQWpuMXhhVjVuYlBYTzJwTFE5THJnNHRkMlFxMTJubUJMZDF0b0pCWVUxcm40dGJLQkFBQy1R0gGmAUFVX3lxTE9mNGJ0c2J4c3prR0lZLW41andGLUhkNWZ0UE9KeFU1emRxSFpkUm9sNjMyc1dJcHA4eWpUNllKM2tzaHI3TWtYYnZNUE10M2owMkJFZHBEaG8zc1F3a3dIc2ZFYnB2cGhZUmtqNGVkRkdWaXFhUVl5TXU5REZzZ2dDaldRMFgxN3hwZ1FrbGVZdkQwQnMzQ0FPUGJoVHdtNGdPeU9xRVE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 May 2024 07:00:00 GMT",
        "title": "Ethereum Price Analysis: ETH Sees End-of-Correction With This Resistance Breakout - CoinGape",
        "content": "Ethereum Price Analysis: Ethereum, the second-largest cryptocurrency by market cap entered a fresh rally in mid-week and rebounded from $2860 monthly support. This renewed buying interest bolstered by the Bitcoin price jump to $67000 on Friday has surged the ETH price to an 8.7% gain. However, an analysis of the daily chart shows the rising Ether price is heading to a crucial resistance indicating an upcoming pivot momentum for this asset.\n\nAlso Read: Here’s Why Ethereum Charts Might Turn Bullish Now: ETH Targets $4k?\n\nadvertisement\n\nETH Poised for Rebound as Falling Channel Pattern Nears Break\n\nIn the daily time frame chart, the Ethereum price shows the formation of a falling channel pattern. The two parallel trendlines acting as dynamic resistance and support have plunged the ETH value from $4084 to $2864 support indicating a nearly 30% loss.\n\nWhile the BTC price rally bolsters a new recovery sentiment in altcoin, the ETH price could remain trapped in a correction until the chart setup is intact.\n\nHaving said that, the Ether coin is heading higher to challenge the upper boundary of the Channel pattern. After a 3% upswing, the coin buyers escape the range of this pattern, signaling the end-of-correction trend.\n\nAccording to Ki Young Ju, CEO of CryptoQuant, Bitcoin (BTC) is currently in the middle of its bull cycle. Ju highlighted that Bitcoin’s market cap is growing faster than its realized cap, a trend that historically lasts around two years.\n\nIf this pattern continues, the current bull cycle might extend until April 2025. The accompanying chart from CryptoQuant illustrates the growth rate difference between Bitcoin’s market cap and realized cap, showing similar cycles approximately every two years.\n\nThis potential uptrend significantly influences the altcoin market bolstering top assets like Ethereum (ETH), Solana (SOL), Cardano (ADA), and XRP to lead to higher rallies.\n\nThe ETH price breakout from the channel pattern will accelerate the buying momentum and assist buyers in rechallenging the $4080 high.\n\nTechnical Indicator\n\nExponential Moving Average: The dynamic resistance of the 50-day EMA prevents the ETH price from breaching the channel pattern.\n\nAverage Directional Index: The ADX slope falling below 18% hints the prevailing bearish momentum is weakening.\n\nRelated Articles\n\nSahil Mahadik Sahil is a dedicated full-time trader with over three years of experience in the financial markets. Armed with a strong grasp of technical analysis, he keeps a vigilant eye on the daily price movements of top assets and indices. Drawn by his fascination with financial instruments, Sahil enthusiastically embraced the emerging realm of cryptocurrency, where he continues to explore opportunities driven by his passion for trading\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxOV0VyQWxySUtveGFYRlIwWkdCV09DMzhYOERfRGVRUGlBNUF0bGcxZUdGOGctakRnTzgyaHlzTDlyTHBYQUhzcFFXSjVzakRUVzlmUGt1aVdic0xheTZnUDY2TkpKbHVzdVBDa05nWkxBNXBvZFdhVUxWYUd6R2ZWTTJtVU3SAYoBQVVfeXFMUFl6djJxRkgyNjJ5OEQ1NENQTlhKZ0RsSlBKaGcweUswM0tUT2RXbU10Z1l2U2ZqS1A0MTlyWVBFZk50a3llR1Y4VnFnV1RNNmxTeHhtQzlRT01IdGJKb05kMnY2Z0pCaGZ4YUxpZzM2OGsxUkstY0xIYjE2cGZSM09jdGpoNVI1VVln?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 May 2024 07:00:00 GMT",
        "title": "Vitalik Buterin Addresses Major Concerns by Ethereum Community - U.Today",
        "content": "Advertisement\n\nVitalik Buterin has published a new article outlining upcoming Ethereum improvements, particularly focusing on PeerDAS, the Verkle tree transition and decentralized methods for storing history as proposed in EIP-4444.\n\nGrats @dankrad @peter_szilagyi you got me to interrupt my work on EIPs and make a twitter response that turned into an unscheduled poast 😀https://t.co/mmVaiEV68K — vitalik.eth (@VitalikButerin) May 17, 2024\n\nEthereum's founder emphasized the importance of decentralization, a key element of ETH's unique development strategy. He also addressed issues like Maximal Extractable Value (MEV) and the balance between minimizing and quarantining it.\n\nThe article was inspired by a series of tweets from long-time Geth core developer Peter Szilagyi, who expressed concerns about MEV.\n\nAdvertisement\n\nMEV became an issue, so instead of trying to find solutions against it, we've glorified it and are now catering the protocol and infra around it to proprietary MEV builders instead of local block producers. It's futile to fight against MEV os might as well lean hard on it, right? — Péter Szilágyi (karalabe.eth) (@peter_szilagyi) May 16, 2024\n\nButerin noted that many of these concerns are already being addressed by ongoing protocol features and that additional issues can be resolved through realistic adjustments to the current road map.\n\nMEV\n\nButerin discussed Ethereum's approach to managing Miner Extractable Value (MEV), which emerged around 2020 when miners started using complex strategies to gain extra revenue from DeFi activities. This development compromised the fairness of block proposing, favoring larger actors.\n\nTwo strategies address MEV: minimization and quarantining. MEV minimization involves creating alternatives like Cowswap and using encrypted mempools to reduce exploitable information.\n\nMEV quarantining accepts MEV but limits its impact by separating block proposing from content selection. Validators focus on proposing blocks, while specialized builders choose block contents via an auction protocol.\n\nButerin supports a mix of both strategies, acknowledging that MEV will not disappear entirely and emphasizing the need to reduce the potential harm from builders to maintain decentralization.\n\nDecentralization\n\nButerin also emphasized the importance of making Ethereum nodes accessible, a central issue in blockchain decentralization. He highlighted EIP-4444 and Verkle trees as key technologies to reduce node hardware requirements, potentially to under 100 gigabytes or even near-zero by offloading history storage.\n\nButerin acknowledged concerns about centralization if responsibility for state maintenance and proofs is offloaded, suggesting an alternative: storing old history in a peer-to-peer network where each node holds a small portion of the data. This would ensure robustness with thousands of copies and potentially use erasure coding for added reliability.\n\nHe stressed that while Ethereum Layer 1 should support Layer 2 projects, it must maintain scalability and the unique properties that make Ethereum distinct, ensuring continued decentralization and security."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxPbzJNLXRlRGJvVjRyaHo2TVBLa2hvM09BbElzM0NIdWVrdGVFNUgwd1lNSVVLZi1iaWdLNU5neWxXdl9nT1pENW1MQ1l4TDA0UlRYR0lneHZEczZjdm5WRk1nbkRMaEpLZ2lVeWI2bElDNFphNU1aWG92TWMwMWs1YUtZZzJvT05xMkpMVXp0QXVvSGtlcnVGVVF0UdIBoAFBVV95cUxNT3IzNW5OYlV6YzB0SDZWMVNWWWtOR1NkVHhLRG1MakdrLUVDZ3ktY3Q4UnZLWloyUGlIQ2FHVnlUX2FTZ19JNXJmWnFOX0oyNWR5LW53Q1lFTGs3VlN5SHp2eHo1cWlPYlFCTzB2eERuNmVlbzZJbFpOb1VKOTc5dU9xUHIwdDNlNDY1a0NkQ1BPMlFzY1RqRXRGbDM4WnNJ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 May 2024 07:00:00 GMT",
        "title": "Crypto Prices Today May 18: Bitcoin Nears $67K, Ethereum Tops $3100 As SOL & XRP Surge - CoinGape",
        "content": "The top crypto prices today recovered as the Bitcoin (BTC) price inched closer to the $67,000 mark. In addition, the Ethereum (ETH) price rallied past the $3,100 level. Moreover, other top altcoins, such as Solana (SOL), XRP, and Cardano (ADA) mirrored the positive sentiment and extended gains.\n\nMajor Crypto Prices Today\n\n1. Bitcoin Price\n\nThe Bitcoin price surged 2.21%, reaching $66,903.49 at the time of writing on Saturday, May 18. On the other hand, it’s trading volume plunged 8.66% to $27.32 billion in the last 24 hours. Whilst, the crypto’s market capitalization stood at $1.31 trillion.\n\nadvertisement\n\n2. Ethereum Price\n\nThe Ethereum price soared 5.18% to $3,109.70 at press time with a market valuation of $373.42 billion. Whilst, ETH saw its trading volume spike 21.91%, reaching $14.82 billion.\n\n3. Solana Price\n\nThe Solana price extended above the $170 level, marking a crucial milestone today. The Solana price surged 6.34%, settling at $172.65. In addition, SOL witnessed a 9.76% gain in trade volume to $3.40 billion in the last 24 hours.\n\n4. XRP Price\n\nWhilst, the XRP price crossed the $0.52 mark again. The XRP price recorded a hike of 1.21%, reaching $0.5238. On the other hand, XRP’s trading volume dropped by 13.79% to $943.78 million.\n\n5. Cardano Price\n\nMeanwhile, the Cardano crypto price rallied 4.16% to $0.4838 today. Whilst, ADA recorded a gain of 16.67% in its 24-hour trading volume, settling at $421.30 million.\n\n6. Dogecoin & Shiba Inu Price\n\nThe Dogecoin price rose 3.75% to $0.1557 while its rival, Shiba Inu price was up 2.25% and traded at $0.00002491.\n\nAlso Read: 3 Meme Coins With 100X Potential Today\n\nTop Crypto Gainers Today\n\nOndo (ONDO): The ONDO crypto price surged 17.06% and traded at $1.03.\n\nThe ONDO crypto price surged 17.06% and traded at $1.03. Gnosis (GNO): The Gnosis price rallied 14.43% to $304.50.\n\nThe Gnosis price rallied 14.43% to $304.50. Pendle (PENDLE): The Pendle price soared 14.20% to $4.96.\n\nThe Pendle price soared 14.20% to $4.96. Ordi (ORDI): The ORDI price rose 13.70% to $41.86.\n\nTop Crypto Losers Today\n\nImmutable (IMX): The Immutable crypto price plunged 3.56% to $2.40.\n\nThe Immutable crypto price plunged 3.56% to $2.40. Floki (FLOKI): The FLOKI crypto price slipped 3.25% to $0.0002079.\n\nThe FLOKI crypto price slipped 3.25% to $0.0002079. Toncoin (TON): The TON price lost 3.18% to $6.46.\n\nThe TON price lost 3.18% to $6.46. Beam (BEAM): The Beam price dipped 1.46% to $0.02471.\n\nEthereum Classic (ETC), Sui (SUI), Jupiter (JUP), and Fantom (FTM) also gained significantly today. Moreover, some cryptocurrencies that experienced a in the last 24 hours also witnessed a recovery in the 1-hour frame. The rebound in Bitcoin’s price followed the robust Spot BTC ETF flows. On Friday, May 17, these ETFs clocked a notable influx of $221.5 million.\n\nAlso Read: Chainlink Price Analysis: Whale Accumulation Positions LINK for $20 Breakout\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxPYWNRNU5pQ0lURmRoNFBEWnRmMGliWTYtM1hLMXdTVWFJbkRES25UZ3R3SkdrNWNhTXQ3eFc0ZXVxU0JxZm9QYmRXcG10c3liU0tUN1FUbWpmcnVHU2VRUlNUbVJFdUttTXl3MmkzbGtabWwxSEQzM1FnQUpYanJtZjFXM1hrckItd3ZpM0pidEExdDJEVlFKS0VLZ093bHpEQjRJVlNaN1lCM1hZX21NSlVtVFhXZFpUUU9ia3hfNXN4VkU2OUxlUTVKOHJJYjhYMVNycmduMNIB3AFBVV95cUxPZ3RGTlE0YkFsLTVGcXBWTGNBSXZLUUpabkcwMG5HaUpyUVR6cnFHMW1UWVczRUF3ZzNlZnNadDgwZy1XSEdFbllpdDZxbFBIZGktU0FBMHVxYXBLclV2NldQTkl6cDdhNlR5dzdRVUJYRmNMc3pUaFlVYmxsNVhWMjZtT0hXZEdOT0ZVWnZhSnc0dEM0SF85SWhLaTd6NGIxc2lkZmN0VzlQUUVHaVNJQ3o2ekRUTWhBS3ZtQUpXbnA4a1MwQ1pjdW9ENzE4MThST1hXM2Nha2Fqcmtl?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 May 2024 07:00:00 GMT",
        "title": "Ethereum rallies 5% as Vitalik Buterin responds to criticism from community amid Coinbase ETH ETF prediction - FXStreet",
        "content": "Coinbase analysts expressed confidence that spot ETH ETFs would be approved.\n\nVitalik Buterin has responded to criticisms labeled at Ethereum developers, stating how they have been addressing some of the concerns of community members.\n\nEthereum could see a further rise as it outperforms Bitcoin for the first time in May.\n\nEthereum (ETH) saw a quick rally on Friday, posting a 5% gain as its co-founder, Vitalik Buterin, responded to recent criticisms from the crypto community. Coinbase analysts have also expressed confidence that spot ETH ETFs would debut in the market soon.\n\nRead more: Ethereum drops below $3,000 again, spot ETH ETF sparks debate in crypto community\n\nDaily digest market movers: Processing speed, Buterin's response\n\nCoinbase analysts have said that spot Ethereum ETFs would debut in the market despite the silence from the Securities & Exchange Commission (SEC) towards issuers. \"As crypto begins to take form as an election issue, it’s also less certain in our view that the SEC would be willing to front the political capital necessary to support a denial,\" said Coinbase analyst David Han.\n\nHe added that if the first deadline on May 23 sees a rejection from the SEC, \"there’s a high likelihood that litigation could reverse that decision.\"\n\nMeanwhile, following Ethereum's slow price growth compared to Bitcoin and Solana, many crypto community members on X have targeted core Ethereum developers through a series of criticisms.\n\nMany criticized Ethereum's \"acceptance of MEV\" after the Department of Justice arrested two brothers for an MEV-related exploit on the number one smart contract blockchain. Others complained that Ethereum folks need to post more about the protocol and its updates.\n\nRead more: US Department of Justice charges brothers for alleged 12-second MEV fraud\n\nOne X user, @chainyoda, shared his plight:\n\nEthereum has a very bad case of cosmos infection. Last cycle the ethereum discourse was human usable apps like uniswap and aave. This cycle all the ethereum devs and investors speak only PhD eg based sequencer, shared sequencer, intercontinental rollup... and one else gives a fk — chainyoda (@chainyoda) May 17, 2024\n\nMore importantly, Geth core developer Peter Szilagyi expressed dissatisfaction with the several upgrades the Ethereum network has undergone in a short while. \"My criticism is that you (Ethereum developers have) [...] have abandoned due process and rushed to hotfix things.\"\n\nPrivate transactions. Check.\n\nProprietary settlements (MEV). Check.\n\nStaked Ether issued by central auth. Check.\n\n\n\n0 local miner tips will nuke local stakers.\n\nGigagas hardware reqs will nuke local nodes.\n\n\n\nVoila, the banking system recreated. All privately held and operated. — Péter Szilágyi (karalabe.eth) (@peter_szilagyi) May 16, 2024\n\nThe increased concerns sparked a series of posts from several Ethereum core contributors, including Josh Stark, Tim Beiko, Dankrad Feist and Ethereum co-founder Vitalik Buterin.\n\nButerin gave a detailed response to these criticisms in a blog post, stating that the concerns raised by community members are valid and \"are already being addressed by protocol features that are already in-progress.\"\n\nHe also stated that several other concerns from the community can be \"addressed by very realistic tweaks to the current roadmap.\" Buterin addressed three major areas that he believes form the majority of the concerns raised:\n\nMEV and builder dependence\n\nLiquid staking\n\nHardware requirement of nodes\n\nHe discussed how Verkle trees, EIP-4444, robust solo staking, and a peer-pressuring development process for MEV reduction can solve these issues.\n\n\"There is a near-unlimited number of blockchain projects aiming for the niche of ‘we can be super-fast, we'll think about decentralization later.’ I don't think Ethereum should be one of those projects,\" said Buterin.\n\n\"We should have deep respect for the properties that make Ethereum unique, and continue to work to maintain and improve on those properties as Ethereum scales,\" he added.\n\nETH technical analysis: Ethereum could attempt to break $3,251 resistance\n\nEthereum posted a 5% gain on Friday after it broke the $3,103 resistance. The rise follows a general appreciation of assets in the crypto market. However, Ethereum notably outperformed Bitcoin in the past 24 hours after several community members highlighted the ETH/BTC ratio was nearing a bottom.\n\nAlso read: Ethereum shows slight bullish signs, SEC faces several hurdles in attempts to deny spot Ethereum ETFs\n\nAs a result, ETH short liquidations are outpacing longs for the first time. With a total liquidation of $24.5 million in the past 24 hours, short liquidations sit at $17.54 million compared to $6.76 million long liquidations, according to data from Coinglass.\n\nThe recent ETH rise has also caused a spike in ETH open interest, which increased by 6.6% in the past 24 hours. This signifies renewed investor interest in ETH, meaning it may see less sideways movement in the coming days.\n\nETH/USDT 4-hour chart\n\nIf renewed confidence prevails, ETH could attempt to break the $3,161 resistance and, if successful, move past the $3,251 mark. However, it's important to watch out for volatility in the days leading up to the SEC's decision on spot ETH ETFs on May 23."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxPYWNRNU5pQ0lURmRoNFBEWnRmMGliWTYtM1hLMXdTVWFJbkRES25UZ3R3SkdrNWNhTXQ3eFc0ZXVxU0JxZm9QYmRXcG10c3liU0tUN1FUbWpmcnVHU2VRUlNUbVJFdUttTXl3MmkzbGtabWwxSEQzM1FnQUpYanJtZjFXM1hrckItd3ZpM0pidEExdDJEVlFKS0VLZ093bHpEQjRJVlNaN1lCM1hZX21NSlVtVFhXZFpUUU9ia3hfNXN4VkU2OUxlUTVKOHJJYjhYMVNycmduMNIB3AFBVV95cUxPZ3RGTlE0YkFsLTVGcXBWTGNBSXZLUUpabkcwMG5HaUpyUVR6cnFHMW1UWVczRUF3ZzNlZnNadDgwZy1XSEdFbllpdDZxbFBIZGktU0FBMHVxYXBLclV2NldQTkl6cDdhNlR5dzdRVUJYRmNMc3pUaFlVYmxsNVhWMjZtT0hXZEdOT0ZVWnZhSnc0dEM0SF85SWhLaTd6NGIxc2lkZmN0VzlQUUVHaVNJQ3o2ekRUTWhBS3ZtQUpXbnA4a1MwQ1pjdW9ENzE4MThST1hXM2Nha2Fqcmtl?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 May 2024 07:00:00 GMT",
        "title": "Ethereum rallies 5% as Vitalik Buterin responds to criticism from community amid Coinbase ETH ETF prediction - FXStreet",
        "content": "Coinbase analysts expressed confidence that spot ETH ETFs would be approved.\n\nVitalik Buterin has responded to criticisms labeled at Ethereum developers, stating how they have been addressing some of the concerns of community members.\n\nEthereum could see a further rise as it outperforms Bitcoin for the first time in May.\n\nEthereum (ETH) saw a quick rally on Friday, posting a 5% gain as its co-founder, Vitalik Buterin, responded to recent criticisms from the crypto community. Coinbase analysts have also expressed confidence that spot ETH ETFs would debut in the market soon.\n\nRead more: Ethereum drops below $3,000 again, spot ETH ETF sparks debate in crypto community\n\nDaily digest market movers: Processing speed, Buterin's response\n\nCoinbase analysts have said that spot Ethereum ETFs would debut in the market despite the silence from the Securities & Exchange Commission (SEC) towards issuers. \"As crypto begins to take form as an election issue, it’s also less certain in our view that the SEC would be willing to front the political capital necessary to support a denial,\" said Coinbase analyst David Han.\n\nHe added that if the first deadline on May 23 sees a rejection from the SEC, \"there’s a high likelihood that litigation could reverse that decision.\"\n\nMeanwhile, following Ethereum's slow price growth compared to Bitcoin and Solana, many crypto community members on X have targeted core Ethereum developers through a series of criticisms.\n\nMany criticized Ethereum's \"acceptance of MEV\" after the Department of Justice arrested two brothers for an MEV-related exploit on the number one smart contract blockchain. Others complained that Ethereum folks need to post more about the protocol and its updates.\n\nRead more: US Department of Justice charges brothers for alleged 12-second MEV fraud\n\nOne X user, @chainyoda, shared his plight:\n\nEthereum has a very bad case of cosmos infection. Last cycle the ethereum discourse was human usable apps like uniswap and aave. This cycle all the ethereum devs and investors speak only PhD eg based sequencer, shared sequencer, intercontinental rollup... and one else gives a fk — chainyoda (@chainyoda) May 17, 2024\n\nMore importantly, Geth core developer Peter Szilagyi expressed dissatisfaction with the several upgrades the Ethereum network has undergone in a short while. \"My criticism is that you (Ethereum developers have) [...] have abandoned due process and rushed to hotfix things.\"\n\nPrivate transactions. Check.\n\nProprietary settlements (MEV). Check.\n\nStaked Ether issued by central auth. Check.\n\n\n\n0 local miner tips will nuke local stakers.\n\nGigagas hardware reqs will nuke local nodes.\n\n\n\nVoila, the banking system recreated. All privately held and operated. — Péter Szilágyi (karalabe.eth) (@peter_szilagyi) May 16, 2024\n\nThe increased concerns sparked a series of posts from several Ethereum core contributors, including Josh Stark, Tim Beiko, Dankrad Feist and Ethereum co-founder Vitalik Buterin.\n\nButerin gave a detailed response to these criticisms in a blog post, stating that the concerns raised by community members are valid and \"are already being addressed by protocol features that are already in-progress.\"\n\nHe also stated that several other concerns from the community can be \"addressed by very realistic tweaks to the current roadmap.\" Buterin addressed three major areas that he believes form the majority of the concerns raised:\n\nMEV and builder dependence\n\nLiquid staking\n\nHardware requirement of nodes\n\nHe discussed how Verkle trees, EIP-4444, robust solo staking, and a peer-pressuring development process for MEV reduction can solve these issues.\n\n\"There is a near-unlimited number of blockchain projects aiming for the niche of ‘we can be super-fast, we'll think about decentralization later.’ I don't think Ethereum should be one of those projects,\" said Buterin.\n\n\"We should have deep respect for the properties that make Ethereum unique, and continue to work to maintain and improve on those properties as Ethereum scales,\" he added.\n\nETH technical analysis: Ethereum could attempt to break $3,251 resistance\n\nEthereum posted a 5% gain on Friday after it broke the $3,103 resistance. The rise follows a general appreciation of assets in the crypto market. However, Ethereum notably outperformed Bitcoin in the past 24 hours after several community members highlighted the ETH/BTC ratio was nearing a bottom.\n\nAlso read: Ethereum shows slight bullish signs, SEC faces several hurdles in attempts to deny spot Ethereum ETFs\n\nAs a result, ETH short liquidations are outpacing longs for the first time. With a total liquidation of $24.5 million in the past 24 hours, short liquidations sit at $17.54 million compared to $6.76 million long liquidations, according to data from Coinglass.\n\nThe recent ETH rise has also caused a spike in ETH open interest, which increased by 6.6% in the past 24 hours. This signifies renewed investor interest in ETH, meaning it may see less sideways movement in the coming days.\n\nETH/USDT 4-hour chart\n\nIf renewed confidence prevails, ETH could attempt to break the $3,161 resistance and, if successful, move past the $3,251 mark. However, it's important to watch out for volatility in the days leading up to the SEC's decision on spot ETH ETFs on May 23."
    }
]