[
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxPNU1MZkdJVlZsRzVIY1Q0MHIzUS1VQzVkcVpIeDdscnkyX3N2Z3FRRklSZU8tak83MlViZGR4OWZ3TlRNV0F5SUlHYklGeEVtLUFVeElBc3J2X0FzRERNOWZGX2tPU2Y5bWV4U1Nsck5hRFhpb2Y1S3JoalBFem4wT3lNM3RFNEJ0cE9heWRQNEdod2htdHpMdVBPaG40R2lMbEhzN3l5eTBiOU1lSWRTeno1U1BTbTYzT0VzalpLbnhqWUVGVGt6UUNHd1NjakpGTnJHcNIB2gFBVV95cUxNemN1QzVOM2FfZDE4N250WlpmVXFJME8zVkNHXzFFbDFOay1na05DVmh3VmZKTFU0VUNoQzFPQWM3MDVRbTl2MUVNYTJsSFhyaEt2Z3NQREhWSnpDeGJsY3RlZnpsc3VLVDhjV3ZfQy00aFB3VllJLWNzQTMzWkxoM3JyVEZ0ajZsNUtoMjdpbVhiVjRIcGdSbTNTRU8yS2JJZ04zRjA2RVlZQm1EbFBRR3NDT1E1UzRIeVB3SlgxNFg3cy1ia0pmVlpKUGFGdm9ZOFFfbkZYM0RsUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 May 2024 07:00:00 GMT",
        "title": "Ethereum Competitor NEAR Protocol Looks ‘Extremely Bullish,’ Says Analyst Jamie Coutts – Here Are His Targets - The Daily Hodl",
        "content": "Real Vision crypto analyst Jamie Coutts says that key indicators for one Ethereum (ETH) competitor are flashing bullish.\n\nThe former Bloomberg analyst tells his 14,100 followers on the social media platform X that NEAR Protocol (NEAR) could soar more than 47% from its current value.\n\n“Absolute price momentum: has been consolidating since March. The technical pattern looks extremely bullish if it breaks this resistance around $7.60 which is where a cluster of volume has traded these past months. This is a high conviction set up if it breaks the pattern neckline, producing a target above $10.50 (+30%).”\n\nLooking at his chart, the analyst suggests NEAR is printing an inverse head and shoulders pattern (I-HNS). An I-HNS is a bullish technical formation with the right shoulder suggesting bulls are willing to accumulate the asset without waiting for the price to drop to its previous low.\n\nThe analyst also predicts that NEAR’s bullish trend against Bitcoin (NEAR/BTC) and Solana (NEAR/SOL) will continue.\n\n“Relative price momentum: NEAR versus SOL and BTC are positive and ready to break higher.”\n\nAccording to the analyst, NEAR is also experiencing huge daily active user (DAU) growth on the network compared to other smart contract platforms, which is another bullish signal.\n\n“Absolute active user momentum: NEAR’s Daily active users have grown from 50,000 to 1.76 million in the past year. Ex-NEAR that number has grown from 5.4 million to 8.75 million.”\n\nHe says the user growth rate far exceeds the combined growth rate of the other layer-1 and layer-2 projects.\n\n“Relative active user momentum: that’s growth of 33x vs 0.6x for the rest of the L1/L2 ecosystem.”\n\nNEAR is trading for $7.14 at time of writing, down 3.6% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPemVTWnR6Wk9Ja2RLMmlxcXplM2VrVE95d0xxYVhDdWVBbVl3aFNHMWU2QWpTY1JwWUF0RDFqTnBZLVNEc2pFYWVhYjZ6Q0ZtV3cxWWdRM0Fiel9WRGFlWUNQWFdKRlJqbmd3QmRZRHM4S0ozZ2VOQ1ZQZElYU0JELXphVUo3alnSAY8BQVVfeXFMTW5qaFFjeW5xUVRqamtJVUU5c1RrNDRjZ09IUmZUUXFQMWpvbkdMOTJNT3lyYUlCdndhWlFJenZINGVITGlxTUZpSlBxUG1aX1B3NVpTMmtZYzFmeWE0d05xd09WQS1UM1VibXFnQURndmwwbVRFMVBBX2dJVjVyU0RnRlpMTGhyUmN5LV9Dcmc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 May 2024 07:00:00 GMT",
        "title": "Ethereum Devs Shut Down Linea—Can Layer-2 Networks Be Trusted? - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nLate Saturday, an Ethereum layer-2 network called Linea found itself stuck between a rock and a hard place.\n\nUsing an exploit, attackers had drained $2.3 million worth of ETH from a decentralized exchange that operates on Linea, called Velocore. Unable to reach the Velocore team, Linea’s leadership made the decisive call to freeze all transactions across the network in an effort to prevent further malfeasance. The plan worked: Linea users were insulated from additional losses.\n\nThat’s when the trouble started.\n\nCrypto users immediately decried Linea’s actions across social media, arguing that the company had violated the industry’s core principle, decentralization. If a few people could halt Linea in their pajamas, then how could the network be considered any better than Wells Fargo?\n\nAD\n\nAD\n\nI'm done with this crap. It's 2024, and L2s are still spewing the same bullshit about their core values being \"permissionless\" and \"censorship-resistant\" after being live for over a year but are still running centralised sequencers. Give me a break. They act all high and mighty,… https://t.co/MykDJ9G3IF — sudo rm -rf --no-preserve-root / (@pcaversaccio) June 2, 2024\n\nLinea immediately pivoted, posting on Twitter that the network was still in the “training wheels” phase of decentralization, but that it planned to eventually transition to a completely trustless structure. (Disclosure: Linea is owned by Consensys, which is one of 22 investors in Decrypt).\n\nConsensys' L2 unilaterally turned off the chain yesterday Reasonable given the circumstances but also a clear sign that this is not crypto pic.twitter.com/q8VaaEFOpN — mert | helius | hSOL (@0xMert_) June 2, 2024\n\nThe incident laid bare a contradiction, some developers say, that doesn’t only pertain to just one blockchain. Rather, it exposed flaws in the entire, burgeoning layer-2 ecosystem—a collection of privately owned networks that has been frequently touted as Ethereum’s path forward.\n\nAD\n\nAD\n\n“So you're saying you intervened on behalf of users here, but in the future, hopefully, if you work really hard, you won’t be able to intervene and your users will lose all their money?” Tom Lehman, the co-founder of several Ethereum projects including layer-1 alternative Facet and Ethscriptions, told Decrypt. “It doesn’t make sense.”\n\nTo Lehman, the contradictions exposed by Linea’s public relations woes this week are not isolated—they are endemic to layer-2 networks.\n\n“Having a layer-2 that's centrally controlled is not a problem,” he said. “It’s just that every single one of them being centrally controlled is a problem.”\n\nNearly all major scaling networks—like Optimism, Arbitrum, Base, and Polygon—were created by private, for-profit companies. Most rely on sequencers, controlled by the network’s team, which batch transactions together and submit them to the Ethereum mainnet. In such cases, like Linea’s, project teams have the power to effectively shut off a network by halting said sequencers.\n\nWhy do most layer-2s exert such centralized control over their transactions? Linea, which did not respond to Decrypt’s questions by the time of publication, claimed in statements this week that the issue is a technical one that requires long-term finesse.\n\nBut financial incentives may also be at play. By controlling that single choke point through which all transactions must pass, layer-2 teams also control the profits derived from processing every network transaction. Such fees are the lifeblood of layer-2s, which often employ dozens of people, and such Ethereum networks are collectively raking in millions of dollars in monthly, on-chain profit.\n\n“L2s can be very profitable to run,” Lehman said. “But that profit is tied to how much control you have.”\n\nSome layer-2 teams say they are ahead of the pack, and have taken distinct steps towards decentralization. Arbitrum, for example, features a backup pathway that allows users to post their transactions to Ethereum directly, in case any issues emerge within the Arbitrum ecosystem. Submitting transactions via this delayed inbox is not ideal, however, and can take up to 24 hours.\n\nAD\n\nAD\n\nSteven Goldfeder, the CEO of Arbitrum core developer Offchain Labs, told Decrypt that the company is currently working to decentralize its sequencer—but made a point of arguing that it poses less of a centralization threat than other layer-2s, given that the Arbitrum Foundation could not single-handedly prevent users from posting transactions.\n\n“On Arbitrum, the problem is a lot smaller than on other networks,” said Goldfeder.\n\nGoldfeder welcomes vocal criticism of centralization risks in the layer-2 ecosystem. He believes such dissent applies crucial pressure to companies that otherwise might focus on different priorities.\n\n“Otherwise, you have the wrong incentives: growth first, and decentralization at some point,” he said. “If we just take one centralized system and replace it with another centralized system with a vague claim of eventually decentralizing—often without technical details—then I think it's very dangerous.”\n\nSome developers like Arjun Bhuptani, the founder of inter-blockchain bridge Everclear, however, feel that even Arbitrum’s solution to current centralization issues on layer-2s is insufficient.\n\n“It is better, but is still not ‘censorship resistance,’” he told Decrypt of Arbitrum.\n\nFurther, Arbitrum itself has suffered network-wide outages repeatedly in the last year.\n\nTo Bhuptani, the issue of centralization is so pervasive on layer-2s simply because the privately owned networks are currently facing other, greater concerns.\n\nAD\n\nAD\n\n“It largely just comes down to prioritization,” he said. “Projects are seeing bigger threats to their survival today on other axes than censorship, and so building decentralization is lower priority than things like security, custody risk, and market traction.”\n\nIt’s true that the matter of censorship on layer-2 networks is still largely theoretical. The Linea team, for example, has never used its power to block transactions on behalf of a sovereign government.\n\nBut such a scenario is by no means fanciful. The U.S. government has blacklisted Ethereum wallet addresses on multiple occasions. Centralized crypto exchanges have cooperated with the Israeli government to ban flagged accounts. Just last month, a Dutch court sentenced a developer of Tornado Cash, an Ethereum coin mixer designed to keep transactions private, to over five years in prison.\n\nEven those within the layer-2 ecosystem worry about what might happen if the private teams behind so many networks—which, thanks to their incredibly low transaction fees, have recently been positioned as the best way to securely onboard the masses to crypto—are legally compelled to do the bidding of governments across the world.\n\n“Something that I might think is legitimate,” Goldfeder said, “some oppressive regime somewhere might think is illegitimate behavior that should be censored.”\n\nSome Ethereum developers feel, however, that the whole debate this week about Linea and crypto’s future has been blown out of proportion.\n\n“It's easy for people who were not affected by hacks to complain,” Joseph Schiarizzi, developer of Arbitrum-based stablecoin OpenDollar, told Decrypt. “But if you've ever been a victim, you understand the Linea team made the right move.”\n\n“I do not expect every piece of infrastructure to be decentralized,” he continued. “I care much more about honesty and transparency, which Linea was great on.”\n\nAD\n\nAD\n\nLehman, who is currently developing a more decentralized alternative to networks like Arbitrum and Optimism, said he doesn’t want to demonize layer-2 networks or dismiss their usefulness. He only worries about crypto’s future if they become omnipresent.\n\n“The problem comes when you say ‘L2s are the future, that's how we scale, that's it,’” Lehman said. “And in the process, [you] hand over the keys to giant billion-dollar entities and endorse them running insecure systems.”\n\nEdited by Andrew Hayward"
    }
]